{"id": 10004, "slug": "mages-of-mystralia", "name": "Mages of Mystralia", "name_original": "Mages of Mystralia", "description": "In the kingdom of Mystralia, it takes more brains than brawn to succeed. You will face down giant, powerful creatures and navigate treacherous terrain. You will encounter puzzles that confound even the wisest of the old sages. And you must overcome obstacles put in place by people who do not want you to succeed.<br/><br/><br/>Your path will not be easy. In Mages of Mystralia, you play as Zia, a young girl who discovers that she has been born with an innate sense of magic. Unfortunately, magic has been banned, so she strikes off to train on her own to gain some control over her powers. On her journey, she meets other exiled mages and, discovers runes with magical properties and realizes that she can combine these runes in millions of different ways to come up with completely new spells.<br/><br/>The story was written by bestselling author Ed Greenwood, creator of the Forgotten Realms fantasy world for Dungeons and Dragons, which served as the basis for games like Baldur’s Gate and Neverwinter Nights, as well as about 170 fantasy books.<br/><br/><br/><ul><li>Design spells to fight enemies, solve environmental puzzles and battle epic bosses<br/></li><li>Powerful yet simple spell crafting system<br/></li><li>Classic action-adventure with over a dozen of distinct regions to explore<br/></li><li>Original orchestral score conducted by Shota Nakama and performed by the Video Game Orchestra at SoundtRec Boston of Final Fantasy XV and Kingdom Hearts fame</li></ul>", "metacritic": 75, "released": "2017-05-17", "tba": false, "updated": "2023-09-25T19:26:29", "background_image": "https://media.rawg.io/media/screenshots/d11/d11d56d1bb5c8241ad8723e2af0fbc81.jpg", "website": "http://www.magesofmystralia.com", "rating": 3.23, "rating_top": 4, "added_by_status": {"yet": 108, "owned": 918, "beaten": 23, "toplay": 14, "dropped": 12, "playing": 2}, "playtime": 4, "achievements_count": 104, "ratings_count": 42, "suggestions_count": 392, "game_series_count": 0, "reviews_count": 43, "platforms": ["PlayStation 4", "Nintendo Switch", "Xbox One", "PC"], "developers": ["Borealys Games"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Borealys Games"], "esrb_rating": null}