{"id": 100064, "slug": "grab-bag", "name": "Grab Bag", "name_original": "Grab Bag", "description": "<p><strong>Note</strong>:  although the download says Mac &amp; Windows, there are a few that only work on Windows.  </p>\n<p><strong>Suction</strong> (2009, Win/Mac):  This is a simulation of the verb \"to suck\". It is a short, one-level game created in about a day.</p>\n<p>Exhibited in <em>New Media, Sex and Culture in the 21st Century</em> at the Museum of New Art in Detroit, and <em>Art.tech</em> at The Lab in San Francisco.  It was also chosen for Rhizome.org's Artbase.</p>\n<p><strong>Baptize (2009, Win):</strong> This is from a series of videogames where I take verbs that have not been well-represented in games and simulate them, particularly those related to religion.</p><p>Exhibited in <em>Searching for God</em>, Kuhn Fine Art Gallery, Marion, OH, 2011, FILE Media Art 2010, São Paolo, Brazil, JavaMuseum 2010 “Celebrate!”, Cyber Human Forms, UAVM &amp; Fonlad #06_2010, HZ Net Gallery #13:  December 2009 and VIDEOKILLS International Video Art Festival, Berlin, Germany, 2009.  It was also chosen for Rhizome.org's Artbase.</p>\n<p><strong>REPENT</strong> (2009, Win/Mac): This is another from a series of experimental video games exploring religious actions. I choose certain rituals, activities or mental games that people play to reinforce their faith.</p>\n<p>Exhibited in <em>Searching for God</em>, Kuhn Fine Art Gallery, Marion, OH, 2011. It was also chosen for Rhizome.org's Artbase and the Pirate Bay Bundle.</p>\n<p><strong>Invisible Landscaping</strong> (2011, Mac/Win): An attempt at spatial composition, this is game that allows the player to garden an audio terrain, trimming down larger, identifiable ambient sound and water and growing small, abstract, subterranean sounds. By distinguishing sounds within noise, the player is able to create a new soundscape.<br/></p>\n<p>Featured in Infinity's Kitchen, l'Autre Musique Laboratoire's <em>New Writings of Sound and Music</em>.  It was originally created for the Experimental Gameplay Project's May 2011 theme, Zoom.  Video is here.</p>\n<p><strong>Markers</strong> (2009, Mac/Win):  This is a two-player game for play on one computer. During play, players explore and change their own faces, but eventually come to realize the results that their actions have on each other.  Not much to it.</p>\n<p><strong>Memory</strong> (2009, Mac/Win):  This is a videogame where the goal is to organize and make connections among memories, avoiding distractions.  It was made for the Experimental Gameplay Project's Nov. 2009 topic \"Art Game\".  Video documentation was screened as part of the <em>One Minute Film Collection 2</em> of VideoChannel Cologne 2010.</p>\n<p><strong>Touch Them</strong> (2009, Mac/Win):  This is the first game I made in Unity, a cacophony of sound in mostly darkness where you're reaching out and feeling your way around.</p>\n<p><strong>Rosemary</strong>,<strong> </strong><strong>Moses</strong>, and <strong>Sightless Adventure</strong> (2000, Win): Early experiments in environmentally-embedded narrative, audio-only gameplay and interactive video.  These are over 15 years old, created in Macromedia Director, and I can't guarantee them to work, though I tested them recently (3/2015) and successfully on a Windows 8 machine.</p>\n<p><em>Moses</em> was selected for the exhibition, <em>Born Again Dada</em>, at the District of Columbia Art Center (DCAC) in Washington, D.C., 2006.<br/></p>\n<p><strong>Three Shorts:  Eye Contact, Waiting and Shame</strong> (2009, Mac/Win):  Three games created within three days.  They all require sound, and the only interface is mouse movement: no clicking (except to begin) or keyboard.  They were selected for <em>AWKWARD: A New Media Exhibition </em>at the AVA Gallery in Chattanooga, TN.</p>\n<p><strong>End Sands</strong> (2012, Mac/Win):  A game with textures created from sunburned cyanotypes.  Avoid the sun during the day. At night collect the burnt bodies of other creatures for food.  Video captures was showing on ACRE TV's <em>Were the Eye Not Sunlike</em> screening.</p>\n<p>This collection used to contain Escape the Cage, but it stopped functioning.</p>", "metacritic": null, "released": "2015-03-03", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/955/9559a0322ea05f9dce359df230497da5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 119, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["AaronOldenburg"], "genres": [], "publishers": [], "esrb_rating": null}