{"id": 100027, "slug": "circuit-breakers-demo", "name": "Circuit Breakers - Demo", "name_original": "Circuit Breakers - Demo", "description": "<p>Circuit Breakers is a fast-paced multi-player top down shoot 'em up. Get together with five of your friends and fight to rid the universe of an intergalactic robot army.</p><p>Full game is now available at: http://store.steampowered.com/app/390870/</p><p><strong>Features (Full version)</strong><br/></p><ul><li>Easy-to-learn and hard-to-master chaotic shooter gameplay suitable for players of any skill level! </li><li>Chew through hordes of enemies with four unique characters and additional unlockable characters </li><li>Local multi-player for up to six players!</li><li>Classic endless top-down action in Arcade mode! </li><li>Play through specific courses and compete for the highest score in Score Attack! </li><li>An enormous Challenge Board full of secrets to unlock! </li><li>Customize your game with the Core System and fight things like super-armored lightning-fast matrix-dodging death robots!</li></ul><p>The Circuit Breakers Demo features just two of the playable characters and includes the first three maps and the first boss fight. The full game is out now on Steam.<br/><br/><strong>Controls</strong><br/>WASD - Movement<br/>Arrow Keys - Shoot<br/>Shift - Shield<br/>E - Confirm<br/><br/>A 360 controller can be used as well, however you may need to relaunch the game after playing the tutorial to access the edit controls button.<br/></p>", "metacritic": null, "released": "2016-09-02", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/065/06524766166cb14314cedf726ec5051a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 142, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["reel_big_kris"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}