{"id": 100080, "slug": "vr-jurassic-cardboard-park", "name": "VR Jurassic - Cardboard Park", "name_original": "VR Jurassic - Cardboard Park", "description": "<p>Have you ever dreamed of meeting a dinosaur in real life? Now you can be closer than ever!</p><p>Welcome to Jurassic VR - Dino Park simulator!</p><p>Three different modes provide amazing experiences:</p><p>- Park</p><p>- Movie</p><p>- Roller coasters</p><p>They give you the opportunity to spend a lot of time in the 360 gradual Jurassic production for Cardboard.</p><p>All modes can be played in 3D and virtual reality.</p><p>Theme park can visit the Jurassic zoo full of dinosaurs. Without limitation, you decide where you want to go and what dinosaur meet. Dreams come true. You can stand next to one of the largest dinosaurs closer than ever!</p><p>In Movie mode, you can find the first episode in the history of this island. Something went wrong. Learn what.</p><p>Virtual reality brings us new gameplay modes, so far two roller coasters.</p><p>Check Ride Stegosaurus and Brachiosaurus bench. These are big and very fast queue. Be careful they can spin pretty well in the head.</p><p>Not all people can ride a real queues so the same can be in virtual reality!</p><p>VR Jurassic - Dino Park simulator is like 360 gradual time machine.</p><p>Only much safe. The dinosaurs were bigger and more dangerous than the animals of our world. Now you can encounter deadly creatures like T Rex or Spinosaurus without compromising life. Survive the adventure on one of the forgotten islands.</p><p>You can take this prehistoric world into your pocket and show off to friends everywhere.</p><p>Types of dinosaurs in the game:</p><p>- Tyrannosaurus Rex T</p><p>- Triceratops</p><p>- Velociraptor or Raptor</p><p>- Stegosaurus</p><p>- Brachiosaurus</p><p>- Parasaurolophus</p><p>- Pachycephalosaurus</p><p>- Spinosaurus</p><p>- Tropognatus</p><p>In the next updates will add Pterodon and Compsognatusa so stay tuned.</p><p>KEY FEATURES:</p><p>- Incredibly mapped Jurassic world</p><p>- Meetings with your favorite creatures like T Rex</p><p>- Simple controls, refer to the ground to walk or use the pads on the screen</p><p>- Many types of dinosaurs, carnivorous hunters from the gentle herbivores</p><p>- Prehistoric 360-degree virtual reality simulator in your smartphone</p><p>- Achievements Google Play Games</p><p>REQUIREMENTS AND NOTES:</p><p>To use virtual reality, or VR need Cardboard Box for your device.</p><p>For a better experience, use headphones.</p><p>Remember that virtual reality does NOT work on all devices. The device more than 7 inches can run 3D mode only.</p><p>Do not wait any longer. T Rex and many other attractions waiting just for YOU!</p><p>Facebook:</p><p>https://www.facebook.com/lvlappstudio/</p><p>Twitter:</p><p>https://twitter.com/LvlAppStudio</p>", "metacritic": null, "released": "2017-02-07", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/460/4605bd963d960005d56ae5af5fb1c967.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 221, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["LvlAppStudio"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}