{"id": 10009, "slug": "captain-lycop-invasion-of-the-heters", "name": "Captain Lycop: Invasion of the Heters", "name_original": "Captain Lycop: Invasion of the Heters", "description": "<strong>Mankind has received a transmission from space. An alien ship is coming. A hardened officer has been choosen to assess the danger.<br/><br/>Dive into the heart of Captain Lycop: Invasion of the Heters, a space shooter mixing adventure, action and management. Face off against pen-pushing insects, merciless enemies and epic bosses. Your only hope is to banish all cowardice and follow a virtuous path.</strong><br/><br/>Captain Lycop: Invasion of the Heters gives players a space shooter with complete freedom of movement.<br/><br/>Shoot your way through several zones and a complex story.<br/><br/>Scavenge ennemy ships to equip modules on your own. Your ship holds up to seven modules pointed in any direction, allowing you to choose your play style.<br/><br/>With a wide tech tree, replay the adventure with varying strategies choosing among 31 different technologies.<br/><br/>Discover an alien universe with its own rules, mixing friendly yet annoying pacifists, administrators with little regard for your future and conquerors with no morals.<br/><br/>The outcome of the adventure will depend on your choices.<br/><br/>But most of all you must overcome! Overcome hoards of enemies, led by bosses as feared as they are fearless! Overcome with no fear!<br/><br/>Because Captain Lycop is no coward.", "metacritic": null, "released": "2017-02-10", "tba": false, "updated": "2019-08-28T22:14:40", "background_image": "https://media.rawg.io/media/screenshots/d7f/d7f3aee3817a78ec5690e7125f26fc93.jpg", "website": "http://aeronie.fr/lycop/index_en.html", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 127}, "playtime": 4, "achievements_count": 4, "ratings_count": 0, "suggestions_count": 233, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["Aéronie"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Aéronie"], "esrb_rating": null}