{"id": 100012, "slug": "excelsior-phase-one-lysandia", "name": "Excelsior Phase One: Lysandia", "name_original": "Excelsior Phase One: Lysandia", "description": "<p><strong>Excelsior Phase One: Lysandia</strong> is the first in a series of role-playing games designed in the spirit of the iconic Ultima games. Excelsior combines the look and feel of classic role-playing games with an intricate story line.</p><p>In Excelsior Phase One: Lysandia, you take on the role of a \"Fixer,\" under the employ of the Grand Council of World Watchers - the dieties who created and oversee the multiverse. Unbeknownst to the inhabitants of the many worlds of the multiverse, history is predetermined by the Watchers. Occasionally, however, something goes awry and history veers off its planned course. It is the job of the Fixer - donning an appropriate guise - to travel to the world in question and set history back on course.</p><p>Lysandia has for generations been a prosperous land and its ruler, King Valkery, is immensely popular. Popular, that is, until he abruptly underwent a startling personality shift and began behaving erratically. Terrible monsters were unleashed. The citizens are in panic. The cause of the King's madness is a mysterious chaotic entity that has taken control of his mind. Donning the guise of a normal townsperson, you, the Fixer, must find and vanquish this chaotic entity from Lysandia and restore the benevolent King to power...</p><p>Excelsior Phase One is a throwback to classic RPGs, and features:<br/></p><ul><li>An intricate and intelligent plot.</li><li>More than 140 unique items, including many varieties of weapons and armor.</li><li>More than 100 types of monsters and townpeople.</li><li>Hundreds of individuals with whom to converse.</li><li>A complex and unique magic system with 35 spells.</li><li>Over 30 cities, villages, huts, dungeons, and keeps to explore.</li><li>An estimated play time of 30 hours!</li></ul><p>The game download also includes:</p><ul><li><strong>A 68 page Manual filled with information about Lysandia, including a complete spell list.</strong></li><li><strong>An 80 page Hint Book containing a complete walkthrough, maps of all locations, weapons and armor statistics, and much more!</strong></li></ul>", "metacritic": null, "released": "2017-02-06", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/e60/e60587f84abdf18048a7ef9a64e6288c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 154, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["11th Dimension Entertainment"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}