{"id": 10019, "slug": "amazing-frog", "name": "Amazing Frog?", "name_original": "Amazing Frog?", "description": "Amazing Frog? is a Hardcore Parkour openworld buffet of bonkers physics sandbox gameplay.<br/>Welcome to the town of Swindon, UK. Home to flatulant super hero, Amazing Frog?The HideoutStart in hideout, play on your own or split screen with your friends<br/>SwindonEnter Swindon where you can drive cars, buses and mobility scooters, jump on trampolines, fire yourself out of cannons, into explosions, search for trophies and Tvs and reach the heights and a whole lot more. Its your Swindon do as you please.<br/><br/><br/>Swindon Local AttractionsTake a quiet trip to the Swindon fArt Gallery if it pleases you…. Feeling aggressive ? find a crossbow, machine gun or laser and shoot the hell out of each other.  Visit the Fart Gyms for a workout or discover the Zombie filled underground Sewers.<br/><br/>SwindonShirePlan your escape of Swindon to explore Greater SwindonShire (a 20KM island) where you can go offloading, ride pigs, discover secrets, go for a swim or drive boat in the surrounding Ocean and Lakes<br/><br/><br/>SHARKS... but watch our for the relentless sharks… cos they huuuuungry.<br/><br/>The Swindon Town Planning OfficeRemember to always The Swindon Town Planning Office after an Update. This is where Gaz and Hal from Fayju will notify you in game of updates and additions.<br/>Frogulus RiftPlay in VR if you want to get super dizzy. Comfort not guaranteed. I mean if you like being hurled way up in the sky by an explosion or driving a car of a building in VR… then this mode is for you. Currently supports Oculus.<br/><br/>Test RoomsThere is also a bunch of test Rooms to play around in. For testing out vehicles, trampolines , weapon testing facilities, playing with sharks… basically seeing what your frog can do. Many mechanics are built in these test rooms.<br/>Amazing Frog? Key features:<ul> <li>a 20Km Landscape</li> <li>A whole bunch of vehicles</li> <li>4 player split screen</li> <li>Oculus VR support.</li> <li>Pigging backs… and pigs</li> <li>ridiculous ragdolls, trampolines, cannons and explosions</li> <li>Weapons like crossbows lasers and machine-guns</li> <li>Vicious Sharks</li> <li>Swimmming ish and Boats in the ocean</li> <li>Fully fitted Fart Gym</li> <li>Underground Zombie Frogs in the Sewers</li> <li>A Giant chessboard</li> <li>A bunch of test rooms</li> <li>and a whole lot of mystery...</li></ul><br/>play together. <br/>", "metacritic": null, "released": "2014-11-21", "tba": false, "updated": "2019-08-28T22:14:39", "background_image": "https://media.rawg.io/media/screenshots/db1/db16b0bd3106112b292afce2741883fd.jpg", "website": "http://www.fayju.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 28, "beaten": 1, "toplay": 1, "dropped": 1}, "playtime": 6, "achievements_count": 0, "ratings_count": 4, "suggestions_count": 319, "game_series_count": 0, "reviews_count": 4, "platforms": ["iOS", "Linux", "macOS", "PC"], "developers": ["Fayju"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Fayju"], "esrb_rating": "Everyone 10+"}