{"id": 100188, "slug": "blood-alloy-reborn-itch", "name": "Blood Alloy: Reborn (itch)", "name_original": "Blood Alloy: Reborn (itch)", "description": "<p>Jetpacks. Guns. Swords. Endless robotic death.</p><p>Render the robot swarms unto wreckage and shrapnel in the hyper-acrobatic tactical shooter/slasher Blood Alloy: Reborn! As the cyborg soldier Nia Rhys, you'll hit subsonic speeds thanks to the BLade Assisted Surface Traversal (BLAST) system. Blast along the floor, up walls, and across ceilings at breakneck speeds to gain positional advantage on your foes. Blast and slice your foes to bits from every angle!</p><p>Become a hyper-agile cybernetic machine of robot death. Survive as long as you can and boost, slice, and shoot your way to the top of the score rankings! </p><p>Unlock new arenas, weapons, and equipment as you play. Every play session accrues you experience, but bragging rights belong only to those with the highest scores, and Blood Alloy's dynamic scoring system rewards only the most aggressive and skilled.</p><p>Features:<br/>- 3 high-octane levels in which to commit relentless cybernetic slaughter<br/>- A devastating uberboss whose onslaught will push your circuits and servos to the limit<br/>- Instantaneous switching between gunplay and swordplay, perfect for absurd combos and tactics!<br/>- Every playthrough earns you experience for unlock progression<br/>- More than 60 weapon and armor upgrade combinations to experiment with<br/>- Preposterous amounts of shrapnel, explosions, and Matrix-style slow-motion<br/>- Fist pumping soundtrack that includes your favorite electro-synth artists, including Magic Sword and Perturbator!</p><p>Leaderboard and Achievement support available on the Steam version!  </p><p>(Every purchase on Itch.io comes with a Steam key)</p>", "metacritic": null, "released": "2016-06-23", "tba": false, "updated": "2019-08-28T23:25:09", "background_image": "https://media.rawg.io/media/screenshots/c8d/c8dcfde9f5e1621eec39114ff7649755.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 165, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SuppressiveFireGames"], "genres": ["Action"], "publishers": [], "esrb_rating": null}