{"id": 100230, "slug": "the-wild-eternal-itch", "name": "The Wild Eternal (itch)", "name_original": "The Wild Eternal (itch)", "description": "Lose yourself above and below the fog in The Wild Eternal, an immersive exploration game with RPG elements. Embark on a meditative journey to heal the scars of your past. Can you escape the cycle of reincarnation?\r\n<p>It is the early 1600's.</p>\n<p>You are an old woman named Ananta who has fled a life of suffering to search for lasting peace in the Himalayan wild. After a traumatic life, you long to escape the cycle of reincarnation so that you may finally rest in peace.</p>\n<p>Your defiance of reincarnation has landed you in a lush, deserted wilderness covered in fog. A fox-shaped demigod agrees to help you escape your fate, but only if you'll help him in return.</p>\n<p>Explore the mystical wilderness together as you embark on a meditative adventure to heal the scars of your past in hopes of avoiding an eternity of suffering.</p>\r\nFeatures\r\n<p>On your journey to escape the cycle of reincarnation you will:</p>\n<ul><li>Explore a mystical wilderness: from clear vistas to the foggy landscape below.</li><li>Navigate a meaningful narrative to uncover your past and answer questions about your present.</li><li>Find ancient artifacts and unlock powerful abilities at hidden shrines.</li><li>Interact with wild, mythical and sometimes dangerous creatures.</li><li>Seek guidance from an outcast demigod and other lost souls.</li>\n</ul>\r\nSystem Requirements\r\n<p><strong>Minimum:</strong></p>\n<ul><li>OS: Windows 7 or higher</li><li>Processor: Intel Core i3 2.00 GHz or AMD equivalent</li><li>Memory: 6 GB RAM</li><li>Graphics: NVIDIA GeForce 450 or higher with 1GB Memory</li><li>DirectX: Version 9.0c</li><li>Storage: 2 GB available space</li></ul>", "metacritic": null, "released": "2016-09-08", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/674/6744926d739a7670ec515bdc7e8ba9b0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 290, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ilsanjo"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}