{"id": 100291, "slug": "the-story-of-my-hanok", "name": "The Story of my Hanok", "name_original": "The Story of my Hanok", "description": "<p><strong>The Story of my Hanok</strong></p><p><strong>An interactive Documentary</strong><br/></p><p><strong>Game Summary:</strong></p><p> The Story of my Hanok, is an interactive documentary where the player is placed inside an abandoned Hanok(Home) owned previously by Patrick Son's Grandmother in the time period of the Korean War. The player is given the task and/or direction to enter the home and learn of what happened, why it was abandoned, and make their own conclusions. With the intention of creating an atmosphere of awkward stillness, the player traverses the level and get a feeling about an abandoned house through the perspective of something that changed from a home into a decaying building.</p><p> Our vision for the game was to formulate an experience for the player that depicts the life of a refugee through the eyes of the individual whom lived through those times watching his or her family be taken away from conscription, coercion and death. This documentary had the explicit goal of allowing players a new perspective on the calamity of war and life of a modern refugee. Many, if not most people learn history through a distorted lens, in which grants only one perspective of the calamity of past events. One such common stereotype is that refugees are always depraved, wealthless individuals pushed out of their respective countries. The truth of reality is, a refugee whether they are rich or poor is a person who is fleeing his or her own home or country because of events that are uncontrollable to them such as war, famine, or tragedy. With direct influence from current events internationally, as well as a personal story to tell, My Hanok was a touchy subject through and through.</p><p> Being a depiction of a true telling of the Soon family, Mrs Soon and her relatives lived a wealthy existence before the outbreak of the war. During the anxiety ridden anticipation of Chinese forces advancing on their hometown, the family had to make many very quick decisions using their influence to protect the well being of the relatives, all the while trying to remain in the home they resided in. My Hanok takes advantage of open ended storytelling to delicately dance through the history of the Soon household, told through the aftermath of the environment.</p><p><strong>Game Play:</strong> </p><p> The player moves around the level using the W,A,S,D Keys and pressing left click to interact with objects and to listen/learn what the object was and why it was related to Mrs. Soon. Most of the gameplay/fun comes from the player's mind itself as they try to understand what happened to the home and why the family left in the first place.<br/></p><p><strong>UPDATES:</strong><br/></p><p>Currently near completion with more content added. More voice lines will be added soon along with sound.</p><p><strong>Current Version: </strong>Alpha Prototype<br/></p><p><strong>Creators:</strong><br/></p><p><strong>Patrick Son: Team Lead/Main Artist</strong></p><p><strong>Brian Herman: Lead Programmer</strong></p><p><strong>John Scovic: Level Designer</strong></p><p><strong>Jose Santos: Artist</strong></p><p><strong>Brett Rossiter: Sound Designer</strong></p>", "metacritic": null, "released": "2016-11-17", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/ebf/ebf57a72ffc3f9ab7f95461cfee85ecb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 77, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["TeamGlowBox"], "genres": [], "publishers": [], "esrb_rating": null}