{"id": 100236, "slug": "game-night", "name": "Game Night", "name_original": "Game Night", "description": "<p><em>The Mist moves ever eastward, nipping at your heels.  Breathe it in, and you will die. Dash through the ruins of a border town while slaying the monstrous remnants of those who once lived there. Death is coming for you.</em></p>\n<p>Tutora, Sheris, and Baya might not entirely buy the gravitas of <em>Arcane Mist 7</em>, but that doesn't mean they're not going to play it. Well, Tutora will play it. Sheris will probably just make fun of it and Baya will probably fall asleep and knock her soda over, but hey, that's what friends are for, right?</p>\n<p><strong>Enjoy a difficult, nuanced turn-based dungeon crawler with seven different classes that each interact with the world in a different way. </strong> Will you build Sheris as an evasive, counter-attacking Fencer that eviscerates enemies as her allies enchant her? Or will she be an apothecary that collects herbs from along the dungeons' paths, revitalizing her allies and duplicating their beneficial effects? Do you use your Engineer to build a bridge, or should you take that northern route that looks like it has a disturbed grave for your Priest to tend to? Maybe that ritual will even push back the Mist...</p>\n<p><strong>THERE IS A BUG IN THIS IGMC VERSION WHERE THE GAME WILL CRASH IF YOU USE A BOMB OR ENEMY-TARGETING SCROLL. MY APOLOGIES; A LAST-MINUTE ADDITION TO THE GAME BROKE THEM. THE REST OF THE GAME RUNS FINE. SORRY FOR ANY INCONVENIENCE.</strong><br/></p>", "metacritic": null, "released": "2017-11-06", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/097/097b000b241612056da08ad1086c8954.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 127, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["crazetex"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}