{"id": 100395, "slug": "error-ware", "name": "Error Ware", "name_original": "Error Ware", "description": "Is your brain fast enough for Error Ware?\r\n<p><strong>Error Ware</strong> is the first entry in the crazy<strong> </strong>party game series <strong>for Windows</strong>! Originally released back in <strong>October 2012</strong>, it is <strong>finally coming to itch.io</strong> to celebrate <strong>U-GameZ</strong>' <strong>10 Years Of Weird GameZ™</strong>.</p>\r\nDid you know U-GameZ is working on an even better sequel? Check out Error Ware 2!\r\n<p><strong>Error Ware </strong>is a barrage of quick \"micro\" games in the spirit of <strong>Nintendo's Wario Ware </strong>series or <strong>Konamis Bishi Bashi</strong> series . You've only got a few seconds to figure out what to do until the timer runs out and the next micro game starts!</p>\r\nFeatures\r\n<ul><li><em>More than <strong>30</strong> <strong>crazy \"micro\" games</strong> + boss games in 3 difficulties</em></li><li><em>Local \"<strong>hot seat</strong>\" multiplayer mode \"<strong>Error Party</strong>\" for <strong>up to 4 players</strong></em></li><li><em>Gameboy-like \"<strong>Error Boy - Games</strong>\"</em></li><li><em>Unlockable  <strong>boss challenges</strong>, <strong>music</strong> and <strong>stickers</strong></em></li><li><em> Choose between <strong>English</strong> and <strong>German</strong> text</em></li><li><em>Playable with <strong>keyboard and mouse</strong> or <strong>a</strong> <strong>Nintendo </strong><strong>Wii Remote</strong></em></li></ul>\n<p><em>Making this game was great fun, I'll hope you'll enjoy playing it!</em></p>\r\n\r\nHow to play the game with a Wii Remote\r\n<p>This game can be played with motion controls by<strong> connecting a single Nintendo Wii Remote to Windows via Bluetooth</strong>. </p>\n<p>To use the Wii Remote's pointer, you'll also need <strong>a wireless Wii Sensor Bar</strong> placed above or beneath your screen (You can also use two candles, but don't burn your house down!).</p>\n<p><strong>If you have access to Bluetooth</strong> (built in or via a dongle), <strong>a Wii Remote </strong>and a <strong>Sensor Bar</strong>, follow these steps <strong>before starting the game</strong>:</p>\n<ol><li><strong>Connect the Wii Remote to Windows. </strong>You can watch these videos showing how to do that on Windows 7 and Windows 8 / 10.  <em><strong>Note: If your computer uses Bluetooth 4.0 or newer, the Wii Remote might not connect (because it uses older tech). Please try it with an older Bluetooth USB dongle with Bluetooth 3.x or older.  </strong></em></li></ol>\n<ol><li><strong>Download and unzip</strong> the \"<strong>Wii Remote Pack for Error Ware</strong>\" from this site. It includes the software \"GlovePie\" and a custom script for it.</li><li><strong>Start the GlovePIE.exe</strong> and click on File &gt; Open... and choose the <strong>ErrorWareWiimoteScriptFinal.PIE</strong> script that came with the Wii Remote pack to <strong>load it into GlovePIE</strong>.</li><li>Click on the \"Run\" Button. You should now be able to move the mouse cursor by pointing at the Sensor Bar. </li><li>Stop the script by clicking the \"Stop\" button.</li><li>Start Error Ware</li><li>Run the script in GlovePIE again by clicking the \"Run\" button again and minimize the GlovePIE window</li><li>In Error Ware, make sure to change the controls to \"Wii Remote\".</li><li>Have fun!</li></ol>\n<p>If you can't get it to work, don't worry. The game is still fun to play with mouse &amp; keyboard controls. In the sequel <strong>Error Ware 2</strong> playing with a Wii Remote is much easier (you don't need GlovePIE for it), but back when I made this game I didn't know better :)</p>\n<p>You can ask for help <strong>in the comments</strong> or tweet me @U-GameZ_McJey<strong>. </strong>I also love to share <strong>reviews and videos</strong> of people from around the world playing my games! <strong>I made a YouTube playlist</strong> with some of my favorite videos of people enjoying Error Ware. Watch them here! And if you want to know how to <strong>unlock all the stickers</strong>, have a look at this secret list!<br/></p>", "metacritic": null, "released": "2017-12-30", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/77c/77c7ae0bdab979868c07be0ed3a2fc45.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 244, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["U-GameZ"], "genres": [], "publishers": [], "esrb_rating": null}