{"id": 100444, "slug": "conflicks-revolutionary-space-battles-2", "name": "Conflicks: Revolutionary Space Battles", "name_original": "Conflicks: Revolutionary Space Battles", "description": "<p>Spaceships, lasers, and… chickens! What more could you ask for? </p><p> <br/> Conflicks: Revolutionary Space Battles is a creative new take on space-themed videogames that merges the deep, thoughtful gameplay of real-time strategy with the intuitive accessibility of physics-based games. <br/> <br/> The game universe is a futuristic alternate history of the European Renaissance that combines elements from the 16th, 17th and 18th centuries with science fiction and an oddball sense of humor into a stylized, absurdist world that never takes itself too seriously. Conflicks can be played in a single-player campaign mode where missions are linked together by a story, as well as in multiplayer skirmishes. <br/> <br/> Pledge your allegiance to Greater-Britain, the Celestial Empire, the Sacred Alliance or the Sublime Gate and harvest metamatter in the name of your emperor, or join the Chk'Rathii and lead the Revolution against those poultry-hoarding galactic despots!</p><p>Main Features</p> <ul> <li>Original game mechanics based on the principle of flicking. Easy to learn, hard to master!</li> </ul> <ul> <li>Play 4 different factions with dozens of ships, each with its own unique powers!</li> </ul> <ul> <li>Play solo and immerse yourself in an epic campaign unveiling a rich and captivating story!</li> </ul> <ul> <li>Play with your Steam friends in free-for-all or team matches and fight in fierce conflicts in the eternal war to control metamatter!</li> </ul> <ul> <li>Show your panache and compete against the best admirals of the galaxy in a competitive multiplayer mode complete with leaderboards!</li> </ul> <ul> <li>Upgrade your ships' special powers by accumulating Steam Achievements!</li></ul>", "metacritic": null, "released": "2016-02-12", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/e76/e76dd0e03a6083f61090d8cf073b5c13.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 229, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Plug In Digital"], "genres": ["Action", "Strategy"], "publishers": [], "esrb_rating": null}