{"id": 100458, "slug": "house-of-the-rising-sun", "name": "House of the Rising Sun", "name_original": "House of the Rising Sun", "description": "<p>Once upon a time you, as a glorious scientist, was sent to a faraway star. You have a mission to explore this star. And your crew is there to help you. But would you be able to beat the difficulties you met here? Sooner or later we’ll know it.</p>\n<p><em>You’re on a science station, dropped by ESS Frontier, United Nations of Earth flagship, in a far star system to investigate the local solar activity. Your primary goal is to file a report on Sun activities when the ship will arrive to pick you up. The team of brave scientists and engineers are ready to use any resources to achieve this goal. They might be a little too brave though, and would disregard their basic needs in this mission. Look out for them and settle this place for them to get enough Science points for a glorious homecoming. Good luck!</em></p>\r\nGame objective\r\n<p>The game objective is (not very clear now) to gather 6000 of <em>science</em> resource in first 480 seconds. Don’t forget about your vital resources: <em>water</em>, <em>food</em> and <em>oxygen</em>.</p>\r\nControls\r\n<ul>\n<li>Use mouse to navigate (RMB to pan the camera) and to select things</li><li>In the left down corner, there is a hammer icon that can dismantle machines.</li><li>To build things click on the room, asteroid or hull socket and select the machine to build (if available)</li></ul>\r\nHints\r\n<ul>\n<li>You can remove solar panels and replace them with other things.</li><li>To build extractors you first need to replace the solar panel with the <em>Examination Station</em>. It can be build only on the hull.</li></ul>", "metacritic": null, "released": "2017-08-01", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/4f4/4f4465e4cafea5bfddf4c5ce91c29bd0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 201, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["shide"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}