{"id": 100433, "slug": "medieval-steve-demo", "name": "Medieval Steve - DEMO", "name_original": "Medieval Steve - DEMO", "description": "<p>TL:DR - </p>\n<p>Medieval Steve is a 3D Platformer, where you play as a pile of armour, held together by magic; that can stomp and smash, killing everything on screen! You job is to save the world from total destruction. You race through the levels, killing and collecting everything.</p>\n\n<p>\r\n\tMerlin, a very powerful and wise wizard needed an apprentice; to help around the house. He used his powerful magic and created his apprentice from some old armor. At this moment, Steve was born. With no flesh or bones holding him together, Steve was impervious to pain and could regenerate, should the worst happen.\r\n</p>\n<p>\r\n\tMerlin was experimenting with spells such as inter-dimensional portals and even time travel. However, even with his great wisdom, Merlin's experiments went horribly wrong. He had torn a huge hole in the fabric of space and the worlds we know and love, crumbled and broke into thousands of shards. As Steve was not part of the mortal relm, he was not affected by Merlin's spell and the fate of the world rested on his shoulders.\r\n</p>\n<p>\r\n\tWith the crumbling of the worlds, grotesque and hideous creatures were spawned out of evil, outer-world dimensions.\r\n</p>\n<p>\r\n\tAlong the way, Merlin was managing to send notes to Steve to give him hints and enable Steve with powers and abilities. Steve has to collect all of the broken shards of the worlds and fix everything before it was too late.\r\n</p>\n<p>\r\n\tYou play as Steve. Can you be the hero, the world needs?\r\n</p>\n\n\n\n<p>Throughout the game, there are a number of collectables. The main one, being the blue gems. These are the magic that held the fabric of the world together. Without these, the world is nothing. Steve must collect as many of these as possible, if he stands a chance of saving the world. </p>\n\n<p>The other collectables are, big green gems, that replenish a percentage of any health lost, throughout the levels, hand tokens, which imbue Steve with the 'strange' ability to turn into a hand (much to the narrators dismay).  Finally, there are the secret artefacts, that will lead to a super mega surprise at the end! </p>\n<p>\n<br/>\n</p>\n<p>Steve has amazing abilities, that allow him to squash his enemies, in style! Like the Super Smash. </p>\n\n\n\n<p>Staying true to classic platformers, there are 5 different worlds in the game. </p>\n<ol><li>Grasslands (the true beginnings of any platformer), lush green grass, tutorial levels, everything is fine. </li><li>The Snowlands, everything is frozen, cold winds, something isn't quite right here. </li><li>The Ancient Ruins, destruction everywhere, traps galore, mean enemies. </li><li>Sky Castles, all floaty like, up in the clouds, gravity defying platforms, hot air balloons. </li><li>The Depths, fire and lava everywhere, explody enemies, intense levels. </li></ol>\n\n\n<p>One of the first teaser trailers that was made for the game, introduced Steve. Take a look! </p>\n\n<p>\r\n\tIf you are interested in following the progress of Medieval Steve, I update the social media profiles with all the latest news, images and videos.\r\n</p>\n<p>\n<br/>\n</p><p>If you are looking to do a review of the game demo, please use the press kit attached, for story, links, description, images and screenshots. </p><p>Press Kit Download</p>\n<p>\r\n\tTwitter - https://twitter.com/MedievalSteve\r\n</p>\n<p>\r\n\tWebsite - www.medievalsteve.com</p>\n<p>\r\n\tFacebook - https://www.facebook.com/MedievalSteve/</p>", "metacritic": null, "released": "2017-02-10", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/06c/06ce38eba058cf57df2a61c80895d601.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 371, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["JforthDesigns"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}