{"id": 100496, "slug": "pocket", "name": "Pocket", "name_original": "Pocket", "description": "Created for the Ludum Dare 29, based on the theme – \"Beneath the Surface\" Pocket is a lost soul in a mysterious cavern, lost and lonely. But he's not alone. He's made a companion in the form of a mysterious orb, which he calls Spriit. The cave is also home to strange creatures, who happen to be very attracted to Spriit's green glow. With Spriit's help, guide Pocket out of the cave.<br/>How to Play: <br/><br/>Navigate Pocket out of the cave, using the Action button to interact with certain objects. Some areas you will need help to get past. Use Spriit and Change color to green to attract cave creatures. When Spriit is red, the creatures are uninterested and will not try to move towards.<br/>Pocket Controls (Keyboard): <br/>Move – WASD <br/>Jump – Space <br/>Action – E <br/><br/>Spriit Controls: <br/>Move – Arrows <br/>Change Color – Right Shift <br/><br/>Enter – Reset <br/>ESC – Quit <br/><br/><br/>Pocket Controls (PS4): <br/>Move – Left Stick <br/>Jump – X <br/>Action – O<br/><br/>Spriit Controls: <br/>Move – Right Stick <br/>Change Color – R3 <br/><br/>Options – Reset <br/>PSN – Quit <br/><br/><br/><br/>Unfortunately we got stuck on a lot of bugs that slowed down development intensely, so only the first level is complete. The second level loads, but you can only get so far before this stop working correctly. We're also having a bug issue with our character animation, so we hope to get that fixed here (climb animation won't switch). <br/><br/>A very challenging weekend, but all in all we are happy with what we were able to get done. If you get to the second stage, stick around for the music, I'm really happy how it turned out!", "metacritic": null, "released": "2017-01-10", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/2df/2df4a87308201dd66487c38ff303e450.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 66, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["ShuddaHaddaLottaFun"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}