{"id": 10046, "slug": "dark-legion-vr", "name": "Dark Legion VR", "name_original": "Dark Legion VR", "description": "Dark Legion VR is a first person shooter (FPS) and magic game. The player plays a chief officer on a space mission. The spaceship breaks down on the way back to earth, causing a forced landing onto a mysterious planet. In order to return back to earth, the player starts an expedition to search for energy source, only to find a huge conspiracy that a military troop on this planet is making mutant creatures in secret, that will be a catastrophe for human race. To protect your own race and your own planet, load your weapons and go destroy the dark legion!<br/><br/>You can move freely using HTC Vive (if you have enough space) and teleport yourself. All the scenes are open and free.<br/>Huge battle scenes, advanced game level design, and smart AI, making you indulged in the game for a dozen hours (which we wouldn’t suggest you to go for that long, that’s why we have archives).<br/><br/><strong>Features</strong><br/>a. Combination of Shooting and Spells<br/>    The character can release the spells and the enemy also gets similar power. There are also magicla traps In the stages.<br/><br/>b. Weapon System<br/>    You can use Pistols, Machine Guns, Shotguns, Rifles, RPGs, Grenades, TNTs, Bows and Shields. You can feel it as reality when you reload, release the bold, aim and fire.<br/><br/>c. AI Smart enemies<br/>    The enemy is built with high-level AI system. They could dodge, duck and aim at the player.<br/><br/>d. The Collection System<br/>    You could find the treasure in the stages to archive supplies including Health, Weapons and Ammo. You will also need the clues to find the password and open the door to the next area.<br/><br/>e. The Real Shooting Practice<br/>    Get familiar with every weapon you use. Score and locations will be displayed. You could also invite your friend to compete with.", "metacritic": null, "released": "2017-03-07", "tba": false, "updated": "2019-08-28T22:14:39", "background_image": "https://media.rawg.io/media/screenshots/ebb/ebb195a83763435c5f226bcbe793e03c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 7}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 574, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ice World"], "genres": ["Action", "Adventure", "Casual", "Indie"], "publishers": ["Ice World"], "esrb_rating": null}