{"id": 100578, "slug": "loot-burn-kill-repeat", "name": "Loot Burn Kill Repeat", "name_original": "Loot Burn Kill Repeat", "description": "<p><em>Shrieks of pain echoes in the corridors</em> as a curious infection spread throughout the IGCC station, turning all living things into blood craving monsters. You will soon come to realize that it is up to you to put an end to the obscure events and save the remaining survivors from the horrors</p>\n<strong>THE RISE OF A SOLDIER</strong>\n<p>Take the role of a true monster slayer, play as the cryptic, technician or soldier and progress through the world, destroy your enemies in fast-paced and gory combat, with the help of your powers and mythical equipment</p>\n\n<strong>TOUCHED BY ARCANE POWERS</strong>\n<p>Massacrate your enemies with elements of fire, ice, shock and poison, shake the world or summon technological minions and a whole lot more with the help of your hero's special powers.</p>\n\n<strong>IN THE DEPTHS OF THE PLANET</strong>\n<p>Journey through a variety of randomized 3D environments taking you from the IGCC space station to deep within the planets core, packed with blood-thirsty creatures. Face a wide array of monsters and gather randomized and procedurally generated loot and survive randomized world events.</p>\n\n<p>Explore the world to uncover what caused the terror that plagues the IGCC, or to reveal secret locations, loot, events or maps and accomplish it's challenges to unlock secret character classes and loot of devestating power. Revisiting the same location is never a bad idea in!</p>\n<p> </p>\n<strong>AS THE RAVEN COLLECTS</strong>\n<p>Customize your character with equipment and modified powers.<br/> Find rare monsters and world events as you explore the environment to find mythical and unique equipment or scavenge resources from the monsters you kill to upgrade your arsenal.</p>", "metacritic": null, "released": "2017-03-10", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/7ce/7cea49cc9abe19a31a4a1e5122103800.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 185, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Crumblin' Cookie"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}