{"id": 100588, "slug": "regeria-hope-episode-1-itch", "name": "Regeria Hope Episode 1 (itch)", "name_original": "Regeria Hope Episode 1 (itch)", "description": "<p>\n</p>\n<p>\n</p>\n<p>\r\n\tThis is the HD version of the full first episode of Regeria Hope.\r\n\t<br/>\n</p>\n<p>\r\n\t \"Regeria Hope is, as you correctly guessed, a fresh take on the Ace Attorney formula, that manages to successfully replicate its mood and gameplay and add enough new ideas to keep things interesting.\"  - Konstantinos Dimopoulos<em>, </em>Rock, Paper, Shotgun.\r\n</p>\n<p>\r\n\t\"Regeria Hope Episode 2 is firmly on our radar now, and is something we feel suitable excited about after playing through this lively and entertaining introduction.\" - Spanner Spencer, Gamezebo<br/>\n</p>\n<ul>\n</ul>\n<p>\r\n\tRegeria Hope is a whimsical courtroom visual novel in the style of Phoenix Wright with original characters and cases. You play as Regeria, a female lawyer who can use her powers of logic and reason to prove her clients innocent.\r\n</p>\n<p>\r\n\tIt's not all that straightforward though. Sometimes, you may find compelling reasons for throwing a case, forsaking the very defendant you are sworn to protect. These decisions will affect the outcome of the case and will have a ripple effect on later episodes of the series.\r\n</p>\n<p>\r\n\tThe first trial has you defending a husband whose wife has been poisoned during the wedding reception. Currently you have the ability to prepare your witness, and interrupt other characters while they are speaking, but be careful, as you have a time limit to solve the case!\r\n</p>\n<p>\r\n\tFeaturing Music by Zack Parrish!\r\n</p>\n<p>\r\n\tFeaturing Sprite Art by Maesketch (Check her out at \r\n\thttp://maesketch.deviantart.com/or http://hazakurain.tumblr.com/art )\r\n</p>\n<p>\r\n\tFeaturing Background Art by Sendo (Check him out at  \r\n\thttp://lemmasoft.renai.us/forums/viewtopic.php?f=38&amp;t=28312)\r\n</p>\n<p>\r\n\tVoice Acting by:\r\n</p>\n<ul>\n<li>Rachael Messer (Regeria)</li>\n<li>Marissa Lenti (Artemis)<br/>\n</li>\n<li>Dane Doyle (Judge)<br/>\n</li>\n<li>Rocky Marks (Pharrell)</li>\n<li>DigglyCerides (Hawk)<br/>\n</li>\n</ul>\n<p>\n<br/>\n</p>\n<p>\r\n\tPast releases:\r\n\t<br/>\n</p>\n<p>\r\n\tRegeria Hope HD has been released, changes include:\r\n</p>\n<ul>\n<li>ALL OF THE CHANGES! Seriously, download it. Even if you've played this before.</li>\n</ul>\n<p>\r\n\tRegeria Hope 1.2.1 has been released, changes include:\r\n</p>\n<ul>\n<li>Screen animations can be turned on and off.</li>\n<li>Small bug fixes.</li>\n</ul>\n<p>\r\n\tRegeria Hope 1.2 has been released, changes include:\r\n</p>\n<ul>\n<li>All new case files menu screens.</li>\n<li>All new testimony screen animations.</li>\n<li>All new \"Witness Prep\" game play has been added to this version.</li>\n<li>New evidence has been added, and you can use it to prove certain statements wrong.</li>\n<li>New \"Check pointing\" system has been added. The game will save at regular intervals.</li>\n<li>Updated sprites for Regeria, Artemis and Hawk.</li>\n<li>Many other little updates, and hopefully no bugs!</li>\n</ul>\n<p>\r\n\tRegeria Hope 1.1 has been released, changes include:\r\n</p>\n<ul>\n<li>Smaller timer and confidence bars.</li>\n<li>An easier to see \"Interrupt\" button.</li>\n</ul>", "metacritic": null, "released": "2014-12-22", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/5f7/5f744b59af3f83d4d6fa9375127483c8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 170, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Golden Game Barn"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}