{"id": 10053, "slug": "project-snowblind", "name": "Project: Snowblind", "name_original": "Project: Snowblind", "description": "<p>Experience the dramatic intensity of the frontlines of a war through the eyes of the first of a new breed of super soldiers in this gritty and epic first-person action game.<br />\nAn augmented super-soldier must stop a renegade regime from eradicating the civilized world.<br />\nHong Kong, 2065. 2nd Lt. Nathan Frost is just a regular grunt in an international army called the Liberty Coalition. When he takes massive injuries from an explosion on the battlefield, Frost undergoes an experimental procedure. The outcome of the surgery is something more than human; a transformation that makes him a unique weapons-grade warrior, with abilities that far surpass those of the average soldier.<br />\nEmpowered with these extra-normal abilities via implanted augmentations, Frost is immediately sent to the frontlines of a war as a secret weapon against the destructive regime. Stranded in hostile territory, cut off from command and far outnumbered, Frost and a handful of men must try and stop the entire renegade militia&#39;s plan threatening to plunge the world into darkness.<br />\nEngage in battle online multiplayer with up to 16 players &amp; voice over IP support in classic and new multiplayer modes.<br />\nA wide variety of game pacing ranges from the frenetic chaos of battlefield action to tactical stealth infiltration style missions.<br />\nEquip yourself with an arsenal of experimental weaponry such as the Riot Wall™ and Attack Drones, and other high tech gadgetry. Used in combination, the equipment yields a variety and depth of gameplay never before realized, especially in multiplayer play.<br />\nIn multiplayer, vehicles are co-operatively used; one guy drives while the other mans the mounted turrets.<br />\nAugmentations such as Invisibility, Reflex Boost and Electrical Storm give you an edge on the battlefield against your highly equipped and battle-ready foe.<br />\nPick-up &amp; play, visceral action pulls the player through a cinematically immersive storyline from Minute One of play.<br />\n11 missions spanning across 16 maps including the Opera House turned Prison, a Buddhist Temple converted to a Military Base, and the sprawling urban Wastelands.</p>", "metacritic": 76, "released": "2005-03-29", "tba": false, "updated": "2024-04-12T08:24:58", "background_image": "https://media.rawg.io/media/games/7e2/7e259589600668bca01f8bb019bb17c5.jpg", "website": "http://www.projectsnowblind.com/", "rating": 2.74, "rating_top": 3, "added_by_status": {"yet": 50, "owned": 873, "beaten": 21, "toplay": 11, "dropped": 17, "playing": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 38, "suggestions_count": 518, "game_series_count": 0, "reviews_count": 38, "platforms": ["Xbox", "PlayStation 2", "PC"], "developers": ["Crystal Dynamics"], "genres": ["Action"], "publishers": ["Square Enix"], "esrb_rating": null}