{"id": 100633, "slug": "city-gardener", "name": "City Gardener", "name_original": "City Gardener", "description": "STORY\r\n<p>You have arrived to the city of Technopolis. The first thing you notice in this modern city is that there's nothing natural to be found. However, you manage to acquire the only piece of land left with nothing built on it. So you decide to create your own garden to bring some life to this soulless city.</p>\r\nHOW TO PLAY\r\n<p>Your piece of land consists on a 10x10 grid and you can move from square to square in a first person view. You can sow a plant on each square, and after that you must water it regularly or else it will wither and die. You can sow other plants in other squares while the already existing plants are growing. Once a plant has fully grown into a tree, you won't need to water it anymore. Your objective is to grow the highest amount of trees that you can before the time runs out.</p>\n<p>But be careful! If you step on a square that contains a plant, you will damage it and it will take longer to fully grow. Sometimes you will have to step on a plant in order to reach and water another plant. So plan carefully where do you start sowing you plants and watch your steps to avoid damaging your plants as much as you can. Fully grown trees, along with 10 random rocks scattered through the land will block your way. They can make things harder for you!</p>\n<p>This is the cycle of a plant as long as you water it in time:</p>\n<ul><li>Nothing  -&gt;   Seed planted   -&gt;   Small plant   -&gt;   Bush   -&gt;   Tree</li></ul>\n<p>If you don't water the plant in time or if you step on it, it will go back one step as follows:</p>\n<ul><li>Bush   -&gt;   Small plant   -&gt;   Nothing</li></ul>\n<p>Remember that trees won't die, and if a plant fully dies, you'll have to plant the seed again.</p>\r\nCONTROLS\r\n<ul><li>W: Move forward</li><li>S: Move Backward</li><li>A: Rotate Left</li><li>D: Rotate right</li><li>Q: Strafe Left</li><li>E: Strafe Right</li><li>1: Plant a seed</li><li>2: Water the seed / plant</li></ul>", "metacritic": null, "released": "2018-08-13", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/3aa/3aab4b90e0175674d472c647521e8f9c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 25, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["PacoChan"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}