{"id": 100630, "slug": "remember", "name": "​REMEMBER", "name_original": "​REMEMBER", "description": "<p>The core premise of Remember is the ability to explore the relationship between past and present in one's Home-life The same place viewed through different times can convey very different memories and emotions, and it is through this experience that the game embodies the theme of Home. With the player's ability to see both past and present simultaneously, the goal of the game was to challenge players to think outside the box in regards to moving around the house and navigation obstacles in their path, rewarding those who act on curiosity. </p><p><strong>Notes</strong>: </p><p>- The game is meant to be played at the resolution of 1920x1080p. </p><p>-The current build available is designed to be played with a computer and xbox controller. A PC build with keyboard and mouse controls will be available in the next coming days. </p><p>Design: Melinda Asher, Kira Zingmark<br/></p><p>Programming: Henoch Yanuary</p><p>Audio: Jonny Bullpitt<br/></p><p>Animation: Ewan Winter, Mate Kvesic, Hayden Price<br/></p><p><strong>Legal</strong></p><p>'Remember' is an educational project, and is not for sale or commercial reproduction. It is provided free of charge, however users are free to make a donation if they wish. Any and all assets used including but not limited to Audio, Video, and 3D Models, were created solely for this project by the author, are available for use free of charge, or used in manner that falls under the use of the <em>'Fair Dealing'</em> clause of the <em>Australian Copyright Act of 1968</em>. Any remaining works consist of a mix of Freeware, Creative Commons, Public Domain, and Non-Commercial licenses. Due to their limited use and the non-profit nature of the project as an educational piece, their use in 'Remember' falls under the umbrella of <em>'Fair Use'</em>.</p>", "metacritic": null, "released": "2017-04-24", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/c79/c7950133701a19c541505197b4573185.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 80, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Melinda Asher"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}