{"id": 10061, "slug": "watch_dogs-2", "name": "Watch Dogs 2", "name_original": "Watch Dogs 2", "description": "<p>Watch Dogs 2 is an action-adventure open-world game developed by Ubisoft Montreal. It is the second installment in the series and continues the main idea of its predecessor - hacking and hacktivism in an open world.</p>\n<p>Welcome to San-Francisco. It is the second city in the United States to install the city-wide operating system named ctOS, which connects everything from your car to your smart home to a global network. Marcus Holloway is tagged by the system as a suspect for a crime he did not commit. Marcus decides to take action and gets together with the hacktivist group DedSec to expose ctOS and its creators.</p>\n<p>WD2 offers the player an immense open world which consists of San-Francisco, Oakland, Marin and Silicon Valley. It&#39;s the player&#39;s choice to navigate the world on foot or on a wide range of vehicles from cars to boats.</p>\n<p>It is up to the player to choose whether to use a lethal or non-lethal approach on a mission as there is always a taser in your inventory and a billiard ball attached to a paracord that knocks enemies out. </p>\n<p>It is possible to hack into any devices that are connected to ctOS. For instance, Marcus can control forklifts, buzz guards phones in order to distract them.</p>", "metacritic": 79, "released": "2016-11-28", "tba": false, "updated": "2024-04-17T13:20:39", "background_image": "https://media.rawg.io/media/games/f52/f52cf6ba08089cd5f1a9c8f7fcc93d1f.jpg", "website": "http://watchdogs.com/", "rating": 3.84, "rating_top": 4, "added_by_status": {"yet": 517, "owned": 4111, "beaten": 1334, "toplay": 297, "dropped": 594, "playing": 136}, "playtime": 17, "achievements_count": 367, "ratings_count": 1675, "suggestions_count": 557, "game_series_count": 2, "reviews_count": 1689, "platforms": ["Xbox One", "PlayStation 4", "PC"], "developers": ["Ubisoft Montreal"], "genres": ["Action", "Adventure"], "publishers": ["Ubisoft Entertainment"], "esrb_rating": "Mature"}