{"id": 1007, "slug": "slender-rising", "name": "Slender Rising", "name_original": "Slender Rising", "description": "**** Over 5000 AppStore reviews rated 4.5/5 **** New 1.7 Update ****<br/><br/>THE DEFINITIVE HORROR GAME and the scariest game on the AppStore according to players arround the world. This game is only designed for touchscreens and inspired by the popular urban legend. Shocking over 10 Million worldwide. And if you are finished, you are ready for the official sequel. 'Slender Rising 2' is out now!<br/><br/>TouchArcade: \"Inarguably the pinnacle of the mythos on iOS.\" <br/><br/>This is what players say:<br/>\"The best horror game ever!\" <br/>\"The first 3 minutes...too scared to play it....\"<br/>\"If you choose to get 1 horror game, MAKE IT THIS GAME!\"<br/>\"I love this game. I'm too afraid to play at night!\" <br/>\"I dropped my iPod and ran away.\"<br/>\"I wish I could give this more than 5 stars, it is so awesome!\"<br/><br/>• Day and night modes. <br/>Investigate haunted places during the day and with a flashlight during the night. Additional nightivision and thunderstorm modes for extra shock value!<br/><br/>• Easy controls. <br/>Tap and Swipe to move your character. Multiple optional joystick control schemes.<br/><br/>• Intense horror atmosphere.<br/>Hear frightening sound effects and terrifying music.<br/>Feel the fear as the enemy is coming closer and escape his deadly stare.<br/><br/>• Endless suspense<br/>Find as many of the mysterious signs as you can before the enemy takes you or find 7 signs  to escape.<br/><br/>• Unreal Engine powered graphics.<br/>Special effects for newest Apple devices to create an even more intense atmosphere. <br/><br/>• Good performance. <br/>Even runs on older devices from iPhone 3GS upwards.<br/><br/><br/>Use headphones when playing, ideally at night and alone! ;)<br/>If you experience any issues with sound etc. please close all backgroud apps. <br/><br/><br/>Credits: bit.ly/1lMyHSq", "metacritic": null, "released": "2012-11-16", "tba": false, "updated": "2019-10-22T14:27:37", "background_image": "https://media.rawg.io/media/screenshots/b99/b999be79fd72039d93ec3a31bd3a582f.jpg", "website": "https://twitter.com/HegiDev", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 1, "dropped": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 134, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Michael Hegemann"], "genres": ["Action", "Adventure"], "publishers": ["Michael Hegemann"], "esrb_rating": null}