{"id": 100735, "slug": "ninja-raiden", "name": "Ninja Raiden", "name_original": "Ninja Raiden", "description": "Foreword<p>If you are reading this, you're probably a NES Ninja Gaiden fan, a Metal Gear Rising fan, or both. If so, I want you to know that this game was made by someone like you for people like you. </p><p>I grew up obsessed with the original NES trilogy of Ninja Gaiden (here in Spain we only got the first two, known as Shadow Warriors). Over two decades I've recurrently tried to make my own Ninja Gaiden game. And so time passed and many attempts failed. </p><p>In 2013 Metal Gear Rising, a hack&amp;slash masterpiece starring a cyborg ninja, arrived. A seed was planted in my mind. </p><p>Now, with way more years of experience and knowledge, I decided to tackle again the plan to make my own NG game. But this time a different approach was floating in my mind. The more I thought about the structure and gameplay of MGR, the more similarities I saw. So, part a long-running-challenge, part serendipity, this game was born, and my goal to you, the player, is that you enjoy playing this game as much as I enjoyed making it. </p><p>This is my love letter to you. </p><p>―Jesús Alonso Abad</p>How to play<p>This game can be played only with the keyboard, using the following configuration:</p><strong>[W][A][S][D] keys</strong>Directional controls<strong>[K] key</strong>A button (jump)<strong>[J] key</strong>B button (attack)<strong>[Spacebar] key</strong>Select button (toggle blade mode)<strong>[Enter] key</strong>Start button<strong>[F12] key<br/></strong>Seppuku<strong>[9][0] keys</strong>Lower/raise the music volume, respectively<p>However, tools like the excellent JoyToKey can be used to map these keys to other controllers, like, a USB NES-like controller!</p><p>View the game manual with all the information you may need here.</p>Leaderboards<p>You can play the game online in bit.ly/NinjaRaiden. When played there, you can submit your results to the online leaderboard upon completion, and see your ranking according to different criteria.</p>Disclaimer<p>METAL GEAR RISING: REVENGEANCE is ©2012 Konami Digital Entertainment and Developed by PlatinumGames Inc. </p><p>NINJA GAIDEN is ©1988-2014 Tecmo Koei Games Co.,LTD. </p><p>All the trademarks, logos, brand names and copyrighted material used in this game belong to their respective owners and were used only for the purpose of paying tribute to them. </p><p>In no way the author is affiliated to them, nor is after the monetization of this game.</p>", "metacritic": null, "released": "2017-02-14", "tba": false, "updated": "2019-08-28T23:25:07", "background_image": "https://media.rawg.io/media/screenshots/f29/f29818583cad2f9c1953caf238860de4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 75, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Kencho"], "genres": ["Action"], "publishers": [], "esrb_rating": null}