{"id": 100722, "slug": "cherry-creek-game-jam-build", "name": "Cherry Creek (Game Jam Build)", "name_original": "Cherry Creek (Game Jam Build)", "description": "<p>\r\n\t Cherry Creek was made in 72hrs for the Ludum Dare game jam, and was originally released in December 2017. It's a tile-rotating puzzle game, the idea is to rotate the tiles until the rivers connect the fountain to all the cherry trees. <br/>\n</p>\n\n\n<p>\n</p>\n<p><strong>WHY WE MADE IT</strong><br/>\r\n\t The theme for this Ludum Dare was 'The More You Have the Worse it Gets'.  We struggled with the theme this time around, and it took us a while to settle on an idea we were enthusiastic about, we even started a different idea and gave up before moving on to this one.  The link to the theme,  was the more tiles on the screen, the harder the difficulty.  I really enjoy this kind of puzzle game, and had messed about with it before, but I enjoyed the chance to see the idea through to completion.</p>\n\n<p>\n<strong>CONTROLS &amp; HELP</strong><br/>\r\n\tThe controls are very simple, you simply left click the tile you want to rotate.  There is also the option to right-click a tile to lock it in place. You can press 'P' for the pause menu at any time.<br/>\n</p>\n<p>\r\n\tThe trick to playing the game is the fact that every tile must connect to something.  All the solutions are designed to only work when all the tiles join up.  You can use this to figure out which tiles must face in a certain direction.  For example, a straight piece at the edge of a level must connect at both ends, so it can't face off the playing grid - this means there is only one way it can face.  When you know a tile must face a certain direction, you can rotate it and then right-click to lock it.  This might reveal that an adjacent tile must face also a certain direction, and you can lock that as well.  You can continue locking the tiles you are sure about, and then just concentrate on the  remaining ones to try and complete the puzzle.</p>\n<p>The various difficulty levels add more and more tiles, so you can tailor the challenge to what you enjoy.  There is a local high score system, so you can try to beat your quickest time, or take a big longer to think about it and beat your lowest move count.</p>\n\n<strong>JAMES</strong>\n<strong>EDGE</strong>\n<strong>ADAM</strong>\r\n\t\r\n\t\r\n\t\r\n\r\n\r\n\t\r\n\t\r\n\t\r\n\t\tArt, Design\r\n\t\t<br/>\r\n\t\t &amp; Animation\r\n\t\r\n\t\r\n\t\tGameplay,\r\n\t\t<br/>\r\n\t\tSound &amp; Music\r\n\t\r\n\t\r\n\t\tArt, Design\r\n\t\t<br/>\r\n\t\t &amp; HUD", "metacritic": null, "released": "2017-12-09", "tba": false, "updated": "2019-08-28T23:25:07", "background_image": "https://media.rawg.io/media/screenshots/6ac/6ac27a03deb1b88228ea043cf679bb1c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 53, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Second Dimension Games"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}