{"id": 10083, "slug": "the-watchmaker", "name": "The Watchmaker", "name_original": "The Watchmaker", "description": "In The Watchmaker, a puzzle-adventure game, players take on the role of Alexander. In his steampunk world of giant clock mechanisms, Alexander’s routine involves repairing his precious clock tower every day, adjusting its mechanisms, oiling the gears and polishing everything down to the smallest piece. For years, this is the only life he has known.<br/><br/>But one day Alexander is awakened by a mysterious voice. This disembodied voice alerts him that something has gone wrong: someone, some unknown being, has sabotaged his beautiful tower. With the clock not working properly, time has gone mad. Consequently, Alexander starts ageing abnormally quickly, leaving him only a handful of time to repair the damage.<br/><br/>Guided by the mysterious voice and armed with a magnetic glove and a bag of time bombs, he must search the halls and arcades of the tower in search of the saboteur. Various obstacles, enemies and riddles buried in the clock’s intricate mechanisms stand in his way. But Alexander must push on to save the clock and restore time to its natural rhythm, all while gradually uncovering the mysteries of the tower and its even stranger past.Features<br/><ul><li>Steampunk puzzle-adventure set in 5 extensive locations<br/></li><li>Diverse gameplay, with a mix of exploration, puzzles, platforming action and boss fights<br/></li><li>Environmental puzzles and special gadgets to solve them, such as magnetic gloves and time bombs<br/></li><li>Unique ageing process that replaces the usual health bar</li></ul>", "metacritic": null, "released": "2017-06-30", "tba": false, "updated": "2022-10-01T23:37:19", "background_image": "https://media.rawg.io/media/screenshots/b63/b631ea7d77074c2d517a29bd24941eb1.jpg", "website": "", "rating": 1.75, "rating_top": 1, "added_by_status": {"yet": 3, "owned": 150, "beaten": 2, "toplay": 2, "dropped": 4}, "playtime": 1, "achievements_count": 43, "ratings_count": 8, "suggestions_count": 455, "game_series_count": 0, "reviews_count": 8, "platforms": ["PC"], "developers": ["Micropsia Games"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["1C Company"], "esrb_rating": null}