{"id": 10097, "slug": "exa-the-infinite-instrument", "name": "EXA: The Infinite Instrument", "name_original": "EXA: The Infinite Instrument", "description": "EXA is a musical instrument unlike any other. Crafted exclusively for virtual reality, EXA's vision is to bring the feeling and expressiveness of playing real-world musical instruments into an incredibly versatile virtual space -- offering an entirely new dimension of musical creativity and performance.<br/><br/>The infinite instrument is here... what will you create?<strong>RINGERS</strong>Musical shapes, called “ringers”, are the main building-block for creating musical structures within EXA. From the tip of the drawing tool, ringers are drawn into existence, springing into the form of ellipses, rectangles, triangles, or lines. Of these shapes, lines behave like guitar strings, while the others behave like two-sided drums.<br/><br/><br/><strong>SOUNDS</strong>When struck, a ringer bursts into sound, glowing and resonating to its tones. By sampling audio from Soundfont (SF2) packages, which are often freely-available online, ringers can produce any imaginable sound. EXA ships with hundreds of Soundfonts, from strings to drums to synths, and allows users to import their own.<br/><br/><br/><strong>TOOLS</strong>EXA uses a tool-based system for drawing, selecting, striking, muting, and more. Tools snap onto the magnetic ends of EXA’s 3D-controller-based handles, and often utilize the controller’s inputs to perform actions.<br/><br/><br/><strong>LOOPS</strong>Recording and replaying loops takes EXA musical performances to the next level, allowing the musician to build up many layers of tones and rhythms. Loops react to tempo changes in real-time, and can be adjusted after recording is complete. Starting and stopping a loop is as simple as striking a ringer, extending EXA’s musical possibilities even further.<br/><br/><br/>", "metacritic": null, "released": "2017-03-31", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/492/492108fe31715768f4aa344ebf65747a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 4}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 156, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Aesthetic Interactive", "Zach Kinstner"], "genres": [], "publishers": ["Aesthetic Interactive"], "esrb_rating": null}