{"id": 1010, "slug": "transistor", "name": "Transistor", "name_original": "Transistor", "description": "<p>Transistor is a cyberpunk game that uses isometric point-of-view as its primary mechanic. Following the story of Red, she discovers a body of an unknown man with a sword in his chest called Transistor. Sword has possessed the mind and voice of its previous owner and now able to speak with Red, navigating her in a city called Cloudbank, as the Process attacked the city and still searches for Red to kill her and return the sword back to them for unknown reasons. </p>\n<p>Despite having real-time battles, Red can freeze the time with her ability called Turn that draws her action bar. Until it is fully restored, no abilities can be used if only you don&#39;t have the upgrades. As an addition, Red can retrieve Functions from her fallen enemies - new powers for her weapon with a passive, persistent effect or other. Beautiful design and interesting lore give this game a unique atmosphere being doubled by the soundtrack, done by Darren Korb.</p>\n<p><strong>Key Features</strong>:<br />\n• An all-new world from the team that created Bastion<br />\n• Configure the powerful Transistor with thousands of possible Function combinations<br />\n• Action-packed real-time combat fused with a robust strategic planning mode<br />\n• Vibrant hand-painted artwork in full 1080p resolution<br />\n• Original soundtrack changes dynamically as the action unfolds<br />\n• Hours of reactive voiceover create a deep and atmospheric story<br />\n• &#39;Recursion&#39; option introduces procedural battles after finishing the story<br />\n• Fully customizable controls custom-tailored for PC</p>", "metacritic": 83, "released": "2014-05-20", "tba": false, "updated": "2024-04-11T21:40:12", "background_image": "https://media.rawg.io/media/games/d1f/d1f872a48286b6b751670817d5c1e1be.jpg", "website": "https://www.supergiantgames.com/games/transistor/", "rating": 4.18, "rating_top": 5, "added_by_status": {"yet": 613, "owned": 5072, "beaten": 1006, "toplay": 272, "dropped": 521, "playing": 98}, "playtime": 4, "achievements_count": 120, "ratings_count": 1441, "suggestions_count": 496, "game_series_count": 0, "reviews_count": 1456, "platforms": ["Nintendo Switch", "PlayStation 4", "PC", "iOS", "macOS", "Linux"], "developers": ["Supergiant Games"], "genres": ["Action", "RPG", "Indie"], "publishers": ["Supergiant Games"], "esrb_rating": "Teen"}