{"id": 101126, "slug": "hade-itch", "name": "Hade (itch)", "name_original": "Hade (itch)", "description": "<p>Simple rules. <br/>Complex variations. <br/>Elegant solutions. <br/><br/>\"Hade\" is a small puzzler made in an abstract minimalist style. <br/>Game mechanics is based on the manipulation of the movement direction by placing objects on the field. With trials and errors player must find right order of positioning to solve the puzzle. <br/><br/>With progression you discover new elements. It brings various new mechanics. Old schemes stopped working and you need to improve your problem-solving skills all the time.<br/></p><p>Hade is currently crawling through greenlight and if you enjoyed demo, please support it by voting and/or leaving comments. Full version currently have 100+ levels, most of them as difficult as last levels of the demo, so it could be interesting and rewarding occupation for the price of can of cola :)</p><p>Greenlight page<br/></p><p><strong>FAQ</strong><br/></p><p>Q: So, is it another one flash mobile clicker?</p><p>A: No. This is PC logic puzzle game with deterministic rules. There is no such thing as timeclicking etc. Only pure brainstorming. Also, I do not think, that genre of logic games belongs to some specific (especially mobile) platform.<br/></p><p>Q: Is development finished? How much is done already?</p><p>A: This game was in development since April and now it is going through final stages. I am currently constructing last levels for recently added mechanics and polishing existing levels. There is also steam integration remains...<br/></p><p>Q: How many levels are we talking about? And in terms of gameplay hours?</p><p>A: At the time I have 140 levels, but some of them are not as good as I want. I am aiming for difficult puzzles, which solving require some solid thinking (unlike most levels of demo), but there are different kinds of people.. One tester completed level for like 3 minutes, other took half of hour to solve the same level. So it is hard to give accurate universal answer, but, I guess, in most cases it will take approximately 4 hours to comlpete the game. I can be wrong but I am aiming for this number.</p><p>Q: So, you have like, what, 2 testers?<br/>A: It was not the point of my previous answer (T_T). But if you want to participate, you can start with demo. I'll be glad to read some opinions and remarks.</p><p>Q: Wait, demo? Where can I find it?</p><p>A: Here, on top of the page.</p><p>Q: It was too short. 25 levels is not enought for the game!</p><p>A: That was just a demo. I am currently trying to pass greenlight.</p><p>Q: How can I learn more about this game? SOMEHOW I feel interested in it.</p><p>A: Glad to hear! You can play short demo with first levels. They are relatively easy, but they help to get more detailed representation of the full game. Also, I will be glad to answer questions in comments below.</p><p>Q: I think I am ready to support you.</p><p>A: Nice! Then, vote here please.<br/></p><p>Q: How much will it cost if it actually get greenlit?</p><p>A: Something about 1-2 dollars, I guess. Definitely not more.</p>Q: I hate you and you game!<p>A: It makes me sad. But it is not even a question...<br/></p><p>Q: I hate you and your game! Where can I write about my feelings?<br/></p><p>A: Here or on greenlight page. But, please, dont :(<br/></p><p>Q: I think, there is not enough links on greenlight. Can you add more?<br/></p><p>A: Sure! Why not?<br/></p><p>Q: I bet noone actually asked you these questions. They are made up! Even this one!</p><p>A: You are right :-( I am just talking to myself. Though, again, it was not a question!</p>Q: This FAQ  is useless!<p>A: Damn!</p> <p>Q: Well, I think it is enough of made up questions. Let's call it a day.</p><p>A: Ok. Bye :3<br/></p>", "metacritic": null, "released": "2016-09-15", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/d91/d91edd5fccf37a745f2832c276846903.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 35, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["KirUn"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}