{"id": 101199, "slug": "runrunrun-itch", "name": "RUNRUNRUN (itch)", "name_original": "RUNRUNRUN (itch)", "description": "<p>RUNRUNRUN is a team-based local multiplayer game for 1 to 4 RUNners. <br/>Break into the safest banks and grab as many gold bars as you can before<br/> the timer runs out! Avoid guards, use powerups to your advantage, find <br/>the best paths and secrets on every bank and help your RUNning team <br/>climb up the world leaderboard!</p>\n<ul><li><strong>Fast-paced, combo-driven arcade stealth game</strong>\r\nRUNRUNRUN\r\n features simple controls (only left stick!) and mixes retro classic \r\ngameplay with fresh new mechanics! Stealth gameplay elements, powerups, \r\ncombos spice up the rules so every game is different, with many subtle \r\nyet important gameplay mechanics hidden here and there.\r\n</li></ul>\n<ul><li><strong>80+ rooms to explore</strong>\r\nEach\r\n bank is subdivided in rooms. When a room is complete, the fastest \r\nRUNner decides where to go next. Find the best path through all the \r\nrooms of each bank so you can maximize your score. \r\n</li></ul>\n<ul><li><strong>Co-op gameplay for up to 4 players</strong>\r\nThe\r\n more the merrier! Casual and hardcore gamers alike can help you \r\nreaching deeper rooms and improve your score! Elaborate strategies with \r\nyour teammates to clear each stage as quickly as possible while RUNning \r\naway from guards.</li></ul>\n<p>You will also enjoy neon-retro-ish graphics and an adaptative soundtrack that will pump your team up until the very end of each game for a real modern arcade feeling! <br/>So what are you waiting for? Let's RUN!</p>", "metacritic": null, "released": "2017-06-16", "tba": false, "updated": "2019-08-28T23:25:04", "background_image": "https://media.rawg.io/media/screenshots/988/988cf78b3f75c61d36a7fb089ebf9fb0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 170, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Zoglu"], "genres": ["Action"], "publishers": [], "esrb_rating": null}