{"id": 10121, "slug": "conflict-denied-ops", "name": "Conflict: Denied Ops", "name_original": "Conflict: Denied Ops", "description": "*This is a single player only title*<br/><br/>Venezuela is left in a state of civil war after the government was brutally overthrown by a military coup.  With factions fighting to reinstate democracy, the U.S. government has offered their assistance, though the new government regime has threatened to deploy nuclear weapons if the U.S. meddles in Venezuelan affairs.  The threat needs to be neutralized, and the U.S can't risk nuclear war.<br/><br/>The CIA Special Activities Division operates in isolation and secrecy.  If captured, any link with the U.S. Government will be denied.<br/><br/>Conflict: Denied Ops is a highly accessible FPS featuring massive, extremely explosive firefights across destructible environments.  Work as a team to utilize the specific skills of each operative and experience the ultimate in destructive satisfaction with tons of exploding objects and an endless barrage of terrorists who are begging to be blown to hell.<strong>Key Features:</strong> <ul><li><strong>Two-Man Tactics</strong> \u0096 Switch between team members at any time for maximum control.<br/></li><li><strong>Explode Your Enemies</strong> \u0096 Levels are built around massive fire fights with a continuous stream of enemies, and tons of exploding objects littered around the level to help your cause.<br/></li><li><strong>Destroy Everything</strong> \u0096 Obliterate your enemies with explosions, demolish buildings, blow through walls and destroy almost anything in the environment.<br/></li><li><strong>Accessible Action</strong> \u0096 Give commands to your team mate simply by pressing or holding a single button. Concentrate on the action, not complicated menus or control schemes.<br/></li><li><strong>Puncture-Tech\u0099</strong> \u0096 Utilize strategic destruction made possible with new Puncture-Tech\u0099 technology developed by Pivotal Studios.  Blast open new pathways, shoot unaware enemies through walls, or create holes in your cover to generate firing paths.</li></ul>", "metacritic": 58, "released": "2008-02-08", "tba": false, "updated": "2023-05-15T07:35:58", "background_image": "https://media.rawg.io/media/screenshots/58d/58dea937cb848952b3734bed14829569.jpg", "website": "http://www.conflictdeniedops.com/", "rating": 2.67, "rating_top": 3, "added_by_status": {"yet": 33, "owned": 756, "beaten": 19, "toplay": 3, "dropped": 19, "playing": 1}, "playtime": 1, "achievements_count": 44, "ratings_count": 45, "suggestions_count": 727, "game_series_count": 0, "reviews_count": 45, "platforms": ["PC", "Xbox 360"], "developers": ["Pivotal Games"], "genres": ["Action", "Shooter"], "publishers": ["Square Enix", "Eidos Interactive"], "esrb_rating": "Mature"}