{"id": 101219, "slug": "dog-gone-golfing-itch", "name": "DOG GONE GOLFING (itch)", "name_original": "DOG GONE GOLFING (itch)", "description": "<p>The origins of Dog Golf are unclear and much debated. However, it is generally accepted that modern Dog Golf was developed in Scotland during the Middle Ages. The game did not find international popularity until the late 19th century, when it spread into the rest of the United Kingdom and then to the United States and Canada. Hushed whispers echo in the Dog park the name of the legendary Dog Golfer, Lady Bird, and her epic battles with the hard nosed Pit-bull Tyson. Every century, the gods call upon the Canines to engage in the ritual of Dog Golf. Who will become the new legend?</p>\n\n<p><strong>MODES OF PLAY</strong></p>\n<p><strong>WORLD TOUR -</strong> Master the art of Dog Golfing as you compete through a series of 20 unique worlds. Each world adds new challenges and features to test your skill. Compete against friends for dog park supremacy and earn coins to unlock new puck skins.</p>\n<p><strong>SHOT STREAKER -</strong> See how long you can keep your streak going in this challenge mode where you have a limited amount of shots per hole. Each time you play new holes will be generated, so no two rounds are ever the same. Only true masters will climb the ladder and become a Dog Golf hero. </p>\n\n<p><strong>ENDLESS JOURNEY -</strong> No hole is ever the same but all players complete holes in the same order! Play forever as you explore the infinite universe of Dog Golfing. This mode literally never ends, even the developer doesn't know what lies ahead. Will there be dog treats? Who knows? </p>\n<p><strong>DOG GOLF ARENA -</strong> It's Dog vs. Dog in this local 2 player battle for the title of ultimate Dog Golfer. Can't find a friend? No problem! Take on one of 5 highly skilled Robotic K-9 neural network learning machines. </p>\n<p><strong>PRACTICE GREEN -</strong> Hone your craft and learn to play Dog Golf on an unlimited number of randomized holes. Learn the unique skills of each Dog Golfer, and become a true champion in the Dog Golf community.</p>\n\n<p><strong>OTHER FEATURES</strong></p>\n<p>- Unlock puck skins as you earn coins for skilled play and Howl-in-Ones.<br/>- Learn to play as a variety unique Dog Golfers, each with their own set of skills and shot types.<br/>- Play up to 18 Holes in a round of Dog Golf against a friend or a devious A.I. Computer CPU Dog type computer robot.<br/>- Make up a new song or Dog Rap, and explore the DOG GONE GOLFING title screen bark machine.<br/>- Unlock and earn achievements and compete on Leaderboards.</p>\n<p><strong>LAST BUT NOT LEAST...</strong></p>\n<p>The dogs in DOG GONE GOLFING are based on real world dogs past and present. Never miss an opportunity to pet a friendly pup and remember, \"Old dogs are the best dogs\". See you at the Dog Golf park!</p>", "metacritic": null, "released": "2017-11-28", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/e04/e0417aac816e7795ca7ba58cb5888b77.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 142, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Vagabond Dog"], "genres": ["Sports"], "publishers": [], "esrb_rating": null}