{"id": 101271, "slug": "big-sky-farm", "name": "Big Sky Farm", "name_original": "Big Sky Farm", "description": "<p><strong> Developer</strong>: Josh Burleson (Code, Art, Music)<br/></p>\n<p><strong> Controls</strong>:<br/><em>Movement</em>: \"A\" to move left, \"D\" to move right.<br/><em>Interact</em>: \"Space\".<br/><em>Inventory</em>: \"I\".<br/><em>Inspect Plot</em>: Hold \"S\".<br/><em>Use Item:</em> \"Space\" when plot selected.</p>\n<p><strong> Goal</strong>:<br/>Buy seeds, cultivate your garden using tools, harvest and sell crops <br/>until you have enough $ to buy a Great Pumpkin seed. On harvesting a Great Pumpkin you win the game.)</p>\n<p> Notes:<br/></p>\n<ul><li>Before I put in music I had bit SFX in the game. It ended up clashing with the music so I had to remove them without having the time to replace them with new ones. When you \"use\" an item from your inventory you can hear a leftover SFX I missed. </li><li>Game pacing is off. I only started working on the game a week before the deadline so I didn't have time to properly implement a tutorial. It may be hard to understand what you need to do when you start. This was an oversight on my part.</li><li>Music was done by myself playing guitar in a damp basement. The submission deadline was 3 hours away and I only had time for a single take. Hence poor sound quality, off notes and background noise. It's a hot mess. </li><li>Game takes about 20 minutes to complete. I feel this is far too long for a game jam game but oh well. If you stick with it till the end you are rewarded with a nice cut scene.</li></ul>\n<p><strong> Thanks for playing!<br/></strong>I really appreciate anyone who takes the time to play the game. Feel free to leave comments/feedback and let me know what you think.<br/></p>", "metacritic": null, "released": "2017-08-16", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/d8d/d8d51ba9e84b6460ad91be4fbfce8632.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 95, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "Web"], "developers": ["JoshBurleson"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}