{"id": 101217, "slug": "the-fearcreepy-scream-house", "name": "The Fear:Creepy Scream House", "name_original": "The Fear:Creepy Scream House", "description": "<p><strong>Suddenly everything started going wrong. Someone is following you and your family is in threat. You should come back home quickly and see if your wife and daughter are fine. Don't let your fear beat you and arrive your home before getting late for everything.</strong></p><p>\"Something had started happening to Marta. She was acting strangely. A couple months later, it was diagnosed that she was psychopath and its cure had not been existed. She was performing scary behaviors. She had started damaging herself. The only choice was taking her to the asylum and breaking up with her. I was so desperate but it was the best thing for our family. I met with Serena after taking her to the asylum and I married with her to forget Marta. Me and my daughter have been happy, but its like I feel something at nights. I have dreamt suicide of my ex-wife for a couple days. I sometimes hear some weird sounds and all of these make me scared. I don't talk about that with my girl and daughter because I don't want to make them worried. I don't know what to do. The only thing that I know is I can't stand all of these anymore...</p><p>Mike\"</p><p>- Plug in your headphones for the best<br/></p><p>- Deeply affecting story</p><p>- High graphics</p><p>- Fearful and tension atmosphere</p><p>- 8 different languages Turkish , English , Russian , Chinese , German , French , Japaniese , Spanish</p>", "metacritic": null, "released": "2016-08-21", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/fb5/fb5844813a50f249a3b37ee13ed1acb7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 211, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "Android"], "developers": ["Genetic Studios"], "genres": ["Action"], "publishers": [], "esrb_rating": null}