{"id": 101330, "slug": "keep-walking-ep", "name": "Keep Walking EP", "name_original": "Keep Walking EP", "description": "<p><em>Why walk with people when you got music, beer, ciggs and games? Play as a chill loner going out on a weekend and listen to some indie music on the way. Use the reflections from the buildings on the other side of the street to navigate between four lanes on the sidewalk avoiding other pedestrians, while also collecting what you need for the destination.</em></p><p><em>Controls: \"Arrow-keys\" (and \"space\" in menu)</em></p><p>We made a little prototype of Keep Walking a while back and decided it would be fun to make it a bit bigger and have some real bands be a part of it. So after finding all the bands, and getting together to work on the game, we - at last - finished it. And now, we simply hope people enjoy it and maybe find a new band they like. We, nor the bands are getting any money out of this and it was just a fun project and a nice way to promote our friends bands. </p><p>Developers: Christopher Andreasson (Code and Design) and Josef Martinovsky (Art and Design).</p><p>Engine : Gamemaker Studio.</p><p>Music: Doris Vida Vojic, 2 Year Vacation, Mon Sai, Faded Paper Figures, Lissi Dancefloor Disaster, and idaydream.</p><p>Thanks to: All the awesome bands that let us use their music, Karl Kardaal for helping us find bands and of course everybody that downloads and tries out our little game. </p><p>There might be some bugs, sorry :3. If it crashes for some reason just restart it and hope it doesn't happen again - that usually works.</p>", "metacritic": null, "released": "2014-10-10", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/00c/00ca40f940cb9796464231a6c031001a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 89, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["YCJY"], "genres": [], "publishers": [], "esrb_rating": null}