{"id": 101419, "slug": "in-my-mind-2", "name": "In My Mind", "name_original": "In My Mind", "description": "<p>In My Mind is a small games experience designed to represent what it’s like living inside my head. The gameplay involves the player walking around a room and interacting with furniture to talk out loud to themselves. This is a direct representation of how I talk to myself to sort through various thoughts and problems I am having.</p>\n<p>All of the dialogue has been pulled directly from my own mental health blog, which I’ve kept since I was first diagnosed with Bipolar. The game doesn’t follow any sort of linear pattern of events and each person would experience my thoughts in a different order. This is to represent the disjointed nature of my own thoughts. I have aimed to create the experience of the player having to put these thoughts together themselves to better understand my experiences.</p>\n<p><strong>Trigger Warnings for:</strong> Self Harm, Suicide, Eating Disorders and mentions of withdrawal symptoms.</p>\n<p>All of these can be filtered out of the experience in the settings.</p>\n<p><strong>Pricing!<br/></strong>If you can only afford the minimum price, go for it! If you could afford to give me anything higher, that'd be grand! If you want to give a little extra to also help cover people that can't afford it, please do!<br/></p>\n<p><strong>Can't afford it?<br/></strong>Please hit me up on charliefrancis(a)charliethegoldfish.com and I'll set you up with a copy. I don't want anyone missing out on this because they don't have the money for it.<br/></p>\n<p><strong>Trouble paying?<br/></strong>A couple of people have noted that paying with Paypal seemed to not be working. If you're having trouble send me an email and I'll sort out another way.<br/></p>", "metacritic": null, "released": "2017-08-21", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/08d/08d267a276a9022e6a569c3c0496a510.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 18, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Charlie Francis Cassidy"], "genres": [], "publishers": [], "esrb_rating": null}