{"id": 101485, "slug": "beat-stickman-demo", "name": "Beat Stickman - Demo", "name_original": "Beat Stickman - Demo", "description": "<p><strong>⚠ Warning:</strong> <em>this game is so strong that even Google can't handle it and bans the game from their Play Store.</em></p>\n<p><strong>Trailer</strong></p>\n<p><strong>The Story</strong></p>\n<p>Once upon a time, in the Shadow dimension of an alternative universe, there lives a Stickman which is made up of dark matter and ketchup. No one know who created it, and why? Stickman can not feel pain, or anything at all. Stickman can not die too, it just can be destroyed and re-created immediately right after, again and again. And lastly, Stickman is cursed to be tortured forever, its destiny is to be beaten endlessly…well, until the end of space and time. </p>\n\r\nThe Stickman inhabits in the Shadow dimension of an alternative universe\r\n<p>As legend continues, the words from an old wise man say:  whoever, regardless of universe and dimension, helps the Stickman with its destiny will be rewarded with the best reward of the multiverse: the great, great time of entertainment. And you, a strong joy seeking individual, set the begin to a long joyful adventure – to beat the Stickman!\r\n  </p>\n\r\nIt was born to be beaten. So beat it!\r\n<p>So, here you are, holding a seemingly normal phone, but you never fully knew what it’s capable of until now! This game will serve as a portal, using your phone to connect you to the space-time location where the Stickman inhabits, teleporting stuff from the Earth where you’re living (we’re just assuming) to the Shadow dimension to torture the Stickman to its destiny. </p>\n\r\nBeat Stickman leverage hardware of your phone to teleport stuff to the Stickman's location using Universe Hole\r\n<p><strong>Game features</strong></p>\n<p>The game has 27 unique, creative weapons for you to unlock and upgrade. Some featured weapons like: hot laser, frozen laser, the Galaxy 7 phone, Fidget Spinner, Nuclear Bomb,…You can even teleport alive creatures there, like: Bloody Bat and the Stickman’s Evil Twin. </p>\n<p>The core mechanism of the game is Idle, where you play with super big numbers. You start out tapping on the screen as the only way to earn the in-game currency, but as you progress all the cool weapons you unlock will work for you endlessly, even when you exit the game or your phone is off! </p>\n<p>Incorporated with the Idle mechanism is Lucky Wheel. It’s totally an option but you are absolutely gonna love it as it is designed to speed up your progress. Lucky Wheel in Beat Stickman is very innovative, as you can spin the wheel at any cost as you please, even with the cost of zero. </p>\n<p>Beside, the game is packed with many features like stopping, unpausing time, taking and sharing screenshot. And many more cool features are already scheduled to be released in the future updates. </p>\n<p><strong>Stay in touch with us</strong></p>\n<p>Facebook page: https://www.facebook.com/Beat-Stickman-2068039180082501/</p>\n<p>Website: http://BeatStickman.com</p>\n<p> And don’t forget the hashtag #BeatStickman to share your moment in the game.</p>", "metacritic": null, "released": "2017-12-13", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/11a/11a4dc6f9f9f2b13733e637bbd85e47d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 79, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Android", "Web"], "developers": ["FVS"], "genres": [], "publishers": [], "esrb_rating": null}