{"id": 101489, "slug": "dimension-drive-itch", "name": "Dimension Drive (itch)", "name_original": "Dimension Drive (itch)", "description": "<p>This intense space shoot ’em up challenges you to fight across two battlefields on one splitscreen. Instantly switch between them to dodge waves of bullets, reach secret areas, or surprise your enemies. Play solo or turn it up to 11 with a local co-op partner to give your enemies hell when you team up on one screen, or split up to grab as much loot as possible.<br/><br/>Unlock and power up a variety of weapons like the Flak Shotgun - an overpowered beast that blasts ships to atoms at point blank range or the burning wall of space death streaming from the flame-thrower like Plasma Torch. Master advanced techniques like the Drift Drive that lets you dodge bullets in a split second or even flip into Reverse Drive to hit enemies when they least expect it. <br/><br/>Fight through a richly detailed sci-fi adventure and unfold the secrets of the Dimension Drives, then climb the global leader-boards in four different difficulty modes ranging from Normal for a balanced challenge to Insane for whoever can take the pain. Still too easy? Step into the 13 zones of the Mirror Dimension in New Game+.</p>\n\n<ul><li>Space shoot 'em up action switching between two battlefields on one splitscreen</li><li>Play solo or in local co-op</li><li>13 levels of story campaign and 13 more in New Game+ mode</li><li>Online leaderboards and four difficulty modes offer the ultimate challenge</li><li>Advanced gameplay strategies including Drift and Reverse Drive to test your skill</li><li>Find secret data cubes to unlock and power-up new weapons like the he Flak Shotgun or the Pulse Cannon</li><li>Unfold the secrets of the Dimension Drives in a rich sci-fi adventure</li><li>Created by two ex-space engineers</li></ul>", "metacritic": null, "released": "2018-03-25", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/8fa/8fa14da67d596fd05e8ccc4b757ea3c4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 390, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["2awesomestudio"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}