{"id": 101529, "slug": "dead_fileexe-itch", "name": "dead_file.exe (itch)", "name_original": "dead_file.exe (itch)", "description": "<p>Tired of life and gray everyday being or morally killed? Then we found solutions to get rid of the pain of human consciousness! <em>Now DRM-free!</em></p>\n<p>Exclusively for you, Engine Investigators engineers, provide a new device for digitizing your brain, without serious consequences!*<br/>In exchange for passing a few tests we will make life better!<br/>So...Have you signed the waiver of responsibility?<br/></p>\r\nInside the game..\r\n<ul><li>You will have to understand, that the game exists without you</li></ul>\n<ul><li>You will have to spend a couple of your nerves on the passage of difficult levels</li></ul>\n<ul><li>You will have to fight with the insane program inside you</li></ul>\n<p><strong>Dead File</strong> - is an unusual experience of platformer genre game, which besides hardcore levels contains the mystery story, dressed with the <em>chip, but not tune soundtrack</em> and the <em>graphics stylized like old VHS cassette</em>. However, be careful, because this game does not die after closing its file.<br/></p>\r\nCore features\r\n<ul><li>6 chapters with cardinally different gameplay</li></ul>\n<ul><li>3D sound effect</li></ul>\n<ul><li>Unique graphics effect, provided by graphics libraries of our own development called <em>Cinnamon Core</em></li></ul>\n<ul><li>VHS effect, based on real VHS glitches</li></ul>\n<ul><li>Riddles, that you have to solve yourself to understand the true essence of the dead_file.exe</li></ul>\n<ul><li>The intricate storyline, that is given during the game, and not as theories or readme file</li></ul>\n<ul><li>The choices, that will affect the whole game</li></ul>\n<p><em>* - under lite consequences we mean death, the deterioration of one of the parts of the brain and the death of consciousness.</em></p>\r\nNeed more fun?\r\n<p>dead_file.exe available in Steam Store with achievements, global stastistics, community and other cool features!</p>", "metacritic": null, "released": "2017-10-29", "tba": false, "updated": "2019-08-28T23:25:02", "background_image": "https://media.rawg.io/media/screenshots/039/039056bac315ded6c251a3aaffe29e04.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 18, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Dyen"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}