{"id": 1015, "slug": "autumn-dynasty-warlords", "name": "Autumn Dynasty Warlords", "name_original": "Autumn Dynasty Warlords", "description": "Our apologies, but we cannot update AD Warlords and it will be unplayable after iOS 11. This would be the last the game is available and so we’re setting it at 70% off.<br/><br/>Revered, feared and enigmatic. The First Autumn Emperor’s legacy is undisputed. He began as a minor warlord, yet he would one day unify the country, discover firedust, and repel the greatest barbarian invasion in history. His personage is a mystery, but his exploits are legendary. Could you have ruled in his place instead?<br/> <br/>Manage your empire turn by turn: manage cities, construct buildings, raise armies and engage in diplomacy and espionage. Unify the land by conquering all provinces!<br/><br/>Fight your battles in real time: use simple gestures to direct your armies and turn the tide of battle with special abilities. Outsmart and outmaneuver your foes through superior tactics!<br/> <br/><br/>• 4X-RTS gameplay: Explore, expand, exterminate and exploit in your quest to establish your dynasty<br/><br/>• Riveting missions: Experience them all with more than 100 hours of gameplay<br/><br/>• Non-linear campaign: Each decision you make can affect the fate of your empire<br/><br/>• Strategic flexibility: Select the right troops, decrees and officers to defeat the enemy<br/><br/>• Choose your path to victory: Pick your battlefields as you fight your way into enemy cities<br/><br/>• Unique touch controls: Direct your forces with simple gestures and brushstrokes<br/><br/>• In-game interactions: Send your officers on missions: engage in diplomacy, espionage or sabotage  <br/><br/>• Randomly generated battle maps, beautifully rendered in oriental watercolor style<br/><br/>• Retina display ready <br/><br/>• Game Center achievements<br/><br/>• Universal App - Plays on all supported devices -  iPhone 4, iPhone 4S, iPhone 5C, iPhone 5S, iPad, iPad 2, iPad 3, iPad 4, iPad Air, iPad mini, iPad mini Retina, iPod Touch 4th Gen, and iPod Touch 5", "metacritic": null, "released": "2014-02-26", "tba": false, "updated": "2021-01-25T06:36:55", "background_image": "https://media.rawg.io/media/screenshots/de2/de2575fa08cc1e33ab54add60907d5de.jpeg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 329, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Touch Dimensions"], "genres": ["Action", "Strategy"], "publishers": ["TOUCH DIMENSIONS INTERACTIVE PTE"], "esrb_rating": null}