{"id": 10152, "slug": "killing-room", "name": "Killing Room", "name_original": "Killing Room", "description": "Killing Room is a first person shooter mixed with a rogue-like RPG and reality-show parody. You are an (un)lucky contestant in Killing Room, a popular reality-show in a decadent 22nd century. You know that there is only glory or death – with death winning in 99 out of 100 cases. <br/><br/><br/><ul><li>First person shooterKilling Room offers classical first person gunplay with many weapons, even melee ones like Scythe or the  audience’s favorite flyswatter.</li></ul><ul><li>Rogue-likeThere is Permanent death, random generation and very high difficulty in Killing Room so as to ensure that your skills will be properly tested and that every wrong move can cause you a lot of trouble.</li></ul><ul><li>Reality-show parody We love the  idea behind the Smash TV game of the  Running Man movie/book. The Killing Room therefore aims for this. Your character is in a bad situation but he can become ridiculously rich in few hours. However, everyone will do everything possible to stop him. Killing Room is a cruel reality-show, one full of dark humor and cynicism.</li></ul><ul><li>Online voting for streamers and viewers You can let a  real online audience decide how you will be rewarded or punished during your playthrough. Just stream the game and share the  provided URL with your followers. This is a completely new way of interaction between a player and his/her audience. We made sure that it brings a great amount of fun for both sides while it is absolutely optional. Playing without a real online audience is still a complete experience.</li></ul><ul><li>Popularity-drivenYou will be closely watched not only by an online audience. Your actions will be evaluated by an AI audience as well. If you are boring, your popularity will drop. But if you entertain crowds, you can become their hero. Being popular is everything when it comes to TV shows! Literally, it is everything, because if you annoy the audience, they will make you regret the moment you ever entered Killing Room.</li></ul><ul><li>RPGYour character is defined by various attributes – Stamina, Health, Speed, Defense, Accuracy, etc.   You can invest into boosting these attributes to significantly help you in your desperate effort. But you can also depend on items which can boost your attributes and even give you special effects and bonuses beyond the basic RPG system. There are double-jumps, invulnerability to traps, various maps of Killing Room sets, and tons of other useful things. But if you are a bad boy or girl with low popularity or begrudging online viewers, you can also get trouble items which will cause you…well, trouble...from hardly noticeable penalties to your attributes to serious diseases, the inability to run or losing an eye.</li></ul><ul><li>Diverse and rich in content and gameplay Guns and melee weapons, 3 different 'worlds' with unique enemies, boss fights, more than 100 unique items, points of interest with rewards and many more awaits you in Killing Room. Also, while our show permanently tries to kill its participants, it is not only about shooting. We have prepared many interesting traps, puzzles and other elements to make sure that our show is in no way boring.</li></ul><br/><br/><ul><li>8 random generated levels<br/></li><li>8 boss creatures with unique gameplay and intro animations<br/></li><li>Online voting for better interaction between streamers and their audience<br/></li><li>15+ weapons<br/></li><li>25+ enemy types<br/></li><li>150+ unique  Items<br/></li><li>Fighting, puzzle and trap rooms</li></ul>Free content patchesWe are going to support Killing Room after release not only by fixing bugs but also with free content updates bringing you more Items, Weapons, Enemies and room variations.", "metacritic": null, "released": "2016-10-20", "tba": false, "updated": "2023-01-26T07:52:33", "background_image": "https://media.rawg.io/media/screenshots/77c/77cb16b3a6ee6870d81d3bd805d8397d.jpg", "website": "http://killingroom.aldagames.com/", "rating": 3.31, "rating_top": 4, "added_by_status": {"yet": 9, "owned": 205, "beaten": 2, "toplay": 1, "dropped": 8}, "playtime": 2, "achievements_count": 42, "ratings_count": 13, "suggestions_count": 607, "game_series_count": 0, "reviews_count": 13, "platforms": ["PC"], "developers": ["Alda Games"], "genres": ["Action", "RPG", "Indie"], "publishers": ["Alda Games"], "esrb_rating": null}