{"id": 101630, "slug": "old-memories-2-fnaf-fan-game", "name": "Old Memories 2 (fnaf fan game)", "name_original": "Old Memories 2 (fnaf fan game)", "description": "<p>Check out the full OST here!</p>\n<p>\r\nAfter The fire at the old Freddy Fazbear's, Fazbear entertainment took the animatronics to a warehouse in hopes of reopening a new pizzeria. However, things didn't go as planned. The animatronics are now running amok around the facility. What is worse is that they have been \"repaired\", and so are now faster and smarter than last time. Will you still be alive by the end of the week?<br/><br/>\r\nThe game will always lag for a moment after loading! I cant fix anything about that!<br/>\r\nIf the game lags really badly then don't hesitate to change the settings, they won't affect the game too much!<br/><br/>\r\nComposer: FlyingOrion<br/>\r\nVoice Actors: Matsu, Ant, Apollo, Fnaf Luigi fan<br/>\r\nCutscene edited by PlanetRunner</p>\n<p>This game was made in Terror Engine, a simple horror game making software.<br/>\r\nTerror Engine was created by Zeoworks.<br/>\r\nAssets used in the game are from Zeoworks or the Five Nights at Freddy's games.<br/>\r\nNPCs made by Santikun.<br/>\r\nNPC models by I6NIS.<br/><br/>\r\nSpecial thanks to:<br/>\r\nIULITM for playing the demo<br/>\r\nDawko for playing the demo during his random FNaF fan game livestream and giving ideas on how to improve the game (Unfortunately there is no way to be able to skip the beginning of each night, but I hope the shorter elevator times will make up for it!)</p>\n<p>Everyone who has helped make assets for this game (The Voice actors and the composer)</p>", "metacritic": null, "released": "2018-05-16", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/b13/b13e60ce99976dff25732f10fbab6495.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 55, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Deerpyboi"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}