{"id": 10168, "slug": "boring-man-online-tactical-stickman-combat", "name": "Boring Man - Online Tactical Stickman Combat", "name_original": "Boring Man - Online Tactical Stickman Combat", "description": "Boring Man - Online Tactical Stickman Combat is the greatest 2D shooter you've never heard of. From a selection of 70 weapons, battle and destroy your enemies using a variety of guns, parkour abilities, dynamite, swords, and so much more.<br/><br/>Boring Man features a wide selection of game modes, and a even more vast collection of mutators that turns your vanilla game mode into a chaotic madhouse.<br/><br/><ul><li> With 70 weapons to choose from, Boring Man offers a huge range of load out customization that can fit nearly every play style.<br/><br/></li><li> 7 different game modes! Get in touch with your competitive side with classic Capture the Flag, or survive with your friends in the Zombrains game mode.<br/><br/></li><li> Host your own server for your friends and explore the many mutators in the game, such as the Low Gravity mutator or the Rocket Madness mutator that changes every projectile into a deadly explosive rocket!<br/><br/></li><li> Traverse the difficult climb maps that will leave you crying!<br/><br/></li><li> Make your own maps with the BoringEditor map tool!<br/><br/></li><li> Want even more? Get the Boring Man Premium! edition and have extra customization features for your stick figure soldier, such as hats and colored bullets.<br/><br/>In Boring Man, it's everything but boring.</li></ul>", "metacritic": null, "released": "2015-02-20", "tba": false, "updated": "2022-09-30T00:01:32", "background_image": "https://media.rawg.io/media/screenshots/216/216c309847a8507b44831b96f42e7d4b.jpg", "website": "http://spasmangames.com/", "rating": 2.0, "rating_top": 1, "added_by_status": {"yet": 22, "owned": 553, "beaten": 3, "toplay": 1, "dropped": 21, "playing": 1}, "playtime": 1, "achievements_count": 60, "ratings_count": 31, "suggestions_count": 150, "game_series_count": 0, "reviews_count": 31, "platforms": ["PC"], "developers": ["Spasman Games"], "genres": ["Action"], "publishers": ["Spasman Games"], "esrb_rating": null}