{"id": 101656, "slug": "legends-of-iona-rpg-itch", "name": "Legends Of Iona RPG (itch)", "name_original": "Legends Of Iona RPG (itch)", "description": "<p>Available on www.legendsofiona.com for now...</p><p>Play has Zaak, a young man stuck in an ancient underground world. He must face many dangers in order to escape. However, during his adventures, Zaak will awaken a past long lost forgotten…</p>\n<p><strong><em>This classic dungeon crawler role-playing game is rated general aimed at family gaming or geeks</em></strong>. The gameplay <strong><em>is simple</em></strong> and in order<em><strong> to enjoy this game, you must follow the quests</strong></em> and conversations with the characters in the game. Contrary to other RPG’s this game<strong><em> does not have spells, but rather combinations of weapons with ionix crystals</em></strong> since the entire <strong><em>story of the world of Iona is .. the ionix crystals.</em></strong> So expect a <strong><em>different</em> </strong>gameplay from other traditional games. In the world of Iona, the Ionix minerals are the most important thing in this universe and they will help you survive and strive during your adventures. Iona TWOY RPG is a game that integrates some of David Deschenes’s ideas particularly with; an optional integrated geek culture E-learning battle system (EBS) to make players smarter! Many who tried this game enjoyed it greatly and now it’s your turn.</p>\n<p>Also, one important point; part of the graphics and code was done by <strong><em>students</em></strong>. this explains the simplicity of some of the graphics <em><strong>mixed</strong></em> with flawless ones made by our staff. Your financial <strong><em>support</em> </strong>and<em><strong>constructive </strong>comments</em> is much appreciated. Once you get used to play the game is grows on you and gets better and better ! A fun game to relax at home.</p>\n<p><em><strong>Features :</strong></em></p>\n<ul><li>5 giant levels filled with dungeons, treasures, monsters and open spaces with a lot of important characters to meet and help through enjoyable quests.</li><li>Story-line, species, and characters are well-developed serves has a foretold of the upcoming MMO World Of Iona.</li><li>The atmosphere of this game takes the best of game-play seen in RPGs from the 80’s and 90’s merged with modern game play and wide areas.</li><li>Different game-play traditional spells are replaced with combinations of ionix crystals and special armor and weapons.</li><li>Similar to old-school RPGs, this game is an average 30+ hours of game-play. There is no blood/gore in this game.</li><li>And integrated cultural E-learning battle system (EBS) to make players smarter!</li><li>One of the interesting meals in this RPG is Quebec’s poutine!  (Game was developed in Quebec)</li></ul>\n<p>“This game has a great future, I’ve tried a Beta version and I already know this is a big winner.”  -Jonathan, Visitor, Montreal Comiccon</p>\n<p>“At last a geek game I like! I am so happy to see this game out !” – Luduc, Youtube Channel</p>\n<p>“Here is the proof that Studio Desgraff stands out with this jewel! ”  – Alain Rivards SeniorFX (StarTrek, BattleStar Gallactica)</p>\n<p>“I am impressed by the graphics and the extent of the game. Me and my family will enjoy! ” Martin L. CEO, Ray FX</p>", "metacritic": null, "released": "2017-06-10", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/6d6/6d66f107885945f938c9f8cfcddd5db4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 283, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Desgraff"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}