{"id": 10161, "slug": "blackwake", "name": "Blackwake", "name_original": "Blackwake", "description": "<p>Blackwake is a multiplayer naval FPS focused on teamwork and cooperation.<br />\nBroadside or board enemy ships as a crew with intense FPS Naval Combat based in the Age of Sail<br />\nMan the cannons and fire off coordinated broadsides with other players to sink the opposing ship. You will fight as a crew of up to 16 real players on a ship led by another player that has been voted as captain. Modes can have up to 54 players in a battle!Coordinate and cooperate to be efficient and be a devastating crew<br />\nIf you&#39;re part of the crew, you may help the ship in any way you see fit without being forced to a role. You can be the part of the gunnery crew by loading cannons and firing at the enemy, or be the master of repairs and help keep the ship afloat by patching holes in the ship, repairing sails, or pumping out water. Help keep your ship&#39;s fire power up by running supplies for your fellow crewman, or even board an enemy ship and conquer it!Lead your crew as the Captain and dominate the opponent or defeat an arch nemesis<br />\nIssue commands to your crew, keep the coordination flowing as to which side to be at the ready, focusing on repairs or boarding the enemy! You can order which sides of the ship you want loaded with what, and motivate them until victory or death. Captain nominations occur at the start of the round and captain ratings improve or worsen depending on your success or failure.Game modes with variation<br />\nRanging from a traditional duel style 1v1 ship deathmatch all the way to a 3v3 deathmatch of various ship sizes, you will be tested as a captain, your coordination with other captains, and as a crew. Weather will change with each round, spanning from a calm day with islands to a heavy storm in the open ocean. More game modes are planned to come in free content updates to make sure things stay interesting!Communication is key<br />\nThere are multiple voice chat channels to keep coordinated, global, crew, faction, and proximity. Tell the powder monkey next to you, to fill yer&#39; crate or the friendly ship&#39;s captain to come to your aid. Aside from voice channels there are also crew commands that are extremely helpful to people without microphones. You can expect the crew with the best communication and cooperation to win!Customization as both player and yer Ship<br />\nName your ship, change its colors and make it known in tales told. Change your appearance and outfits to display your skill, time played and persistence as a fellow crewman.Developers that are passionate about feedback and are part of the community<br />\nSince our early development and Kickstarter we&#39;ve spoken to our players through both discord and in-game chat, taking suggestions and feedback with care in real time. Every suggestion made by our players is truly considered and discussed, and we&#39;ve been careful to keep in line with the vision we set out to create for Blackwake. The result is a game that we all helped create together and can enjoy together.As long as Blackwake breathes we&#39;ll keep her fed with content<br />\nWe want to keep developing Blackwake with FREE additional content to make Blackwake the best possible game it can be. No paid DLC to divide the community or pay to win items to give players who spend more an advantage. We have many more ideas for Blackwake, and we&#39;re excited to use them to keep the game fresh and active.</p>", "metacritic": null, "released": "2017-02-24", "tba": false, "updated": "2024-04-20T06:22:25", "background_image": "https://media.rawg.io/media/screenshots/360/3609a212ee012fad38d06f0cdd616091.jpg", "website": "http://www.blackwake.com", "rating": 3.26, "rating_top": 4, "added_by_status": {"yet": 86, "owned": 1488, "beaten": 10, "toplay": 6, "dropped": 83, "playing": 4}, "playtime": 2, "achievements_count": 39, "ratings_count": 93, "suggestions_count": 498, "game_series_count": 0, "reviews_count": 93, "platforms": ["macOS", "PC"], "developers": ["Mastfire Studios"], "genres": ["Action", "Strategy", "Casual", "Indie"], "publishers": ["Mastfire Studios"], "esrb_rating": "Mature"}