{"id": 101659, "slug": "eleanors-stairway-playable-teaser-2015-concept-tes", "name": "Eleanor's Stairway Playable Teaser (2015 concept test)", "name_original": "Eleanor's Stairway Playable Teaser (2015 concept test)", "description": "<p>This game concept is being completely remodeled and replanned, still focusing on keeping the suspense and horror. But this is a small first teaser/proof of concept I developed back in 2015. I am working on a small demo/prologue which I plan on releasing in a few months. Please follow me for more details and to follow the production of the new version on <strong>Instagram</strong> and our page on <strong>Facebook </strong>.</p>\n<p>https://www.instagram.com/renato.aruffo/<br/></p>\n<p>PoC details ____________________________________________________________________________</p>\n\n<p>This is a (2-3 minutes) short teaser game I developed back in 2015 inspired by the classic Beatles song, Eleanor Rigby and Silent Hills playable teaser, P.T. I tried to mix the mystery behind that music in a game style environment to see if I could show a nice and scary ambiance.</p>\n<p>This game started as a school project(Gnomon School of Visual Effects) and a art for a Halloween contest and got the 1st place at the Sketch Fab and after that I decided to make a extension beyond visual stuff. This was great to practice lots of technical art and design, I love to develop interactive entertainment and creating video games is a big passion. Horror also has a special place in my heart, so mixing both together came a really fun project to develop and learn.</p>\n\n\n<p>I used zBrush, Maya, Blender, 3D Coat, Substance Designer, Substance Painter, xNormals and Unity 5.2 to create this scene, also used and tested it on Sketchfab, later I programmed the game in C# inside Unity 3D.</p>\n\n<p>This started just a art scene with interaction and events around, just added that name because of Silent Hills inspiration, but If there are lots of feedback and people supporting/playing this project I will extend and make a real beginning to end game.</p>", "metacritic": null, "released": "2018-07-29", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/169/169d7b8dd97e57ab345fc85f2967c456.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 54, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["renatoaruffo"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}