{"id": 101876, "slug": "battle-brothers-itch", "name": "Battle Brothers (itch)", "name_original": "Battle Brothers (itch)", "description": "<p>Battle Brothers is a turn based strategy RPG mix wherein you lead a band of mercenaries in a medieval fantasy world on the hunt for coin, fame and legendary artifacts. The gameplay is inspired by such classics as X-Com: UFO Defense and Jagged Alliance.</p><strong>Gameplay</strong><p>\r\n\tThe game consists of a strategic layer, or worldmap, and a tactical combat layer. On the worldmap you can choose where to travel next in order to find places worth looting, enemies worth pursuing or towns to resupply and hire men at. This is also where you manage, level up and equip your troops and chose the next target of your traveling party. Once you move close to an enemy force or potentially dangerous place you will switch to the tactical combat map where the actual fighting takes place. Both the worldmap and the combat maps are procedurally generated so no two playthroughs will ever be alike.<br/>\n<br/>\n</p><strong>Features</strong><ul>\n<li><strong>Procedurally generated.</strong> Worldmap, combat maps, characters and even the nature of the invasion itself are procedurally generated. No two games will ever be alike!\r\n\t</li>\n<li><strong>Open and dynamic world.</strong> No boring linear missions, you decide where to go and what to do! But with choice come consequences – the world will change permanently as the invasion sweeps the lands, and you may just find a town burned to the ground if you don’t come to its aid.\r\n\t</li>\n<li><strong>Permadeath – decisions really matter. </strong>If a Battle Brother is killed in combat he is dead forever, his experience and skills will be lost. So you better think twice about that suicide charge with your most experienced Brother.\r\n\t</li>\n<li><strong>Huge tactical combat maps.</strong> This is not checkers, this is a complex combat simulation. Field up to 12 Battle Brothers at the same time on huge combat maps. Send your rangers through the woods into the back of the enemy while your armored shieldbearers stall the enemy attack.\r\n\t</li>\n<li><strong>Height levels in combat maps.</strong> Use the high grounds for your tactical advantage! Increase the range of your archers or repell overwhelming attacks against unsurmountable enemy numbers.\r\n\t</li>\n<li><strong>Diverse enemy roster.</strong> Enemies don’t just differ in name. All enemies have unique skills and unique AI behavior, and you have to adjust your tactics if you want to stand a chance.\r\n\t</li>\n<li><strong>Character development.</strong> Each Battle Brother gains experience through combat. Level them up and aquire new, powerful perks to fit your own strategy.\r\n\t</li>\n<li><strong>No restrictive class-system.</strong> Your Battle Brother’s skills and abilities are given by their equipment and weapons. You want to make an all ranged squad? The only limitations is whether it stands the test on the field of battle!\r\n\t</li>\n<li><strong>Detailed inventory system.</strong> Equip your Battle Brothers with weapons, arms, armor and powerful accessories.\r\n\t</li>\n<li><strong>Equipment that matters.</strong> Different weapons grant unique skills – split shields with axes, stun enemies with maces, form a spearwall with spears or crush armor with a warhammer.<br/>\n<br/>\n</li></ul><strong>Status of the game</strong><p>\r\n\tBattle Brothers is currently in development for PC, Mac and Linux. We have a fully playable combat demo which you can download below to judge the game for yourself.</p><p>The game also recently launched on Steam Greenlight and we would very much appreciate your help in voting for us and sharing the link with other people who could enjoy the game. Thanks!</p><strong>Links and Contact</strong><p>Website: www.battlebrothersgame.com</p><p>Twitter: www.twitter.com/OverhypeStudios</p><p>Email: contact@overhypestudios.com</p><p>Greenlight: http://steamcommunity.com/sharedfiles/filedetails/?id=311186565</p>", "metacritic": null, "released": "2014-09-23", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/f97/f97b7dcb27be4def94d10f0ed5d502c4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 304, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Overhype Studios"], "genres": ["RPG", "Strategy"], "publishers": [], "esrb_rating": null}