{"id": 101886, "slug": "sun-dogs-itch", "name": "Sun Dogs (itch)", "name_original": "Sun Dogs (itch)", "description": "<p>Sun Dogs is about exploring our inner solar system, altering your body, and embracing death.</p>\n<p>In a future where humanity alters itself without a second thought, you must do the same. Skim along the Sun's corona, float in the Venusian clouds, travel the Martian plains. When your body dies, your mind will be given a new one, and you will keep going.</p>\n<p>Featuring an expansive world of unique science fiction, spread across planets, moons, and space stations. Dynamic text reacts to your character and your actions, and a full modding system allows you to rewrite the entire game.</p>\n<p>More info at our website, including design notes on the art, science fiction, and modding tools. Follow twitter for more updates and bits of fiction. </p>\n<p>Credits: </p>\n<p>Nic Tringali - writing and design <br/>Rebecca McCarthy - writing<br/>Sasa-P - music</p>\n<p>Praise for <em>Sun Dogs</em>: </p>\n<p>Kill Screen: \"... vagueness and ambiguity are their own virtues in Sun Dogs.\" </p>\n<p>Offworld: \"The real meat of the game is the text, lush but brief, that appears to illuminate the vast array of worlds and cultures you explore.\"</p>\n<p>Emily Short's Interactive Storytelling: \"The biggest appeal for me was simply drifting from place to place and investigating all the unusual places and events.\" </p>\n<p>FailBetter Games: \"... a memorable and intelligent flavour to its economically written stories.\" </p>", "metacritic": null, "released": "2015-10-29", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/5ca/5ca97c09df72f38ec57c517ce57c4223.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 60, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Royal Polygon", "nic tringali"], "genres": [], "publishers": [], "esrb_rating": null}