{"id": 10183, "slug": "euro-fishing", "name": "Euro Fishing", "name_original": "Euro Fishing", "description": "<strong>Now With Basic Cast Control and Float Fishing</strong><br/>Euro Fishing immerses you deep into the adrenaline-packed action, fun and beauty of Europe’s most famous lakes. Master your rod, line and tactics, and refine your technique to become a top angler. This is the closest you can get to real fishing from the comfort of your own sofa. Welcome to the Great Indoors!<br/><br/>Whether you’re a fishing beginner or angling pro, Euro Fishing accurately and authentically replicates the feeling of actual fishing using our unique physics-based casting and reeling system, ‘Total Cast Control’.<br/><br/>Start by learning the basics of casting with in-game tutorials, or dive straight into one of the five unique European locations included, such as Digger Lakes and the famous St John’s Lake at Linear Fisheries, each posing their own unique challenge to land the big catch.<br/><br/>Using advanced AI and customisable environment effects, fish respond to water temperature, time of day, weather conditions and baits as they do in real life. Spot fish ‘shows’ before casting into the right area from a pre-set peg or the lake bank, and customise your angling equipment for the best chance of landing a catch.<br/><br/>In Euro Fishing, you can fish by yourself, or compete against friends and opponents in single player or hosted multiplayer tournaments, tracking and comparing catches in real time.<br/><br/><strong>Euro Fishing – Cast, Catch, Compete!</strong><br/><br/><br/><br/><br/><br/><br/><strong>Basic Cast Control</strong><br/>An entry level (power bar style) casting system for new users to experience the game before trying to master \"Total Cast Control\"  <br/><br/><strong>Total Cast Control</strong><br/>A full physics based casting system. For the first time in a fishing game, experience the feeling of casting with real fishing rods from your own PC. <br/><br/><strong>Intelligent Fish AI</strong><br/>The battle of wits between fish and angler come to life with intelligent AI<br/><br/><strong>Competition and Tournaments</strong><br/>Challenge your friends in a multiplayer tournament and compare catches in real time, or compete against AI in our hosted tournaments<br/><br/><strong>Stunning Locations</strong><br/>Five unique European venues await every fisherman, including real venues such as Digger Lakes and the famous St John’s Lake at Linear Fisheries, all recreated in magnificent detail<br/><br/><strong>Dynamic Weather and Time of Day</strong><br/>Set weather conditions to reflect real world settings or create your own preferences to affect how fish behave <br/><br/><strong>Tackle Box</strong><br/>Select the right angling equipment for the best chance of landing the big catch; choose from a wide range of rods, reels, rigs and bait in thousands of possible combinations<br/><br/><strong>Watercraft</strong><br/>Read the water and its features, predict what the fish are going to be doing and cast from the bank or a peg for the best chance of a catch<br/><br/><strong>Full Steam Controller Support</strong><br/>Immerse yourself in Euro Fishing with the new Steam Controller, now with full integration<br/><br/><strong>Cutting Edge Technology</strong><br/>Using the latest Unreal Engine 4 graphics technology, Euro Fishing looks and feels as close to the real thing<br/><br/><strong>Created by Experts</strong><br/>Working with carp angling experts, including Korda and Simon Scott, Euro Fishing replicates the experience of real fishing", "metacritic": null, "released": "2015-11-02", "tba": false, "updated": "2023-04-10T15:49:10", "background_image": "https://media.rawg.io/media/screenshots/13b/13bc58f642143c97c3d0a5c1c0f4314b.jpg", "website": "http://www.dtgfishing.com", "rating": 2.35, "rating_top": 1, "added_by_status": {"yet": 2, "owned": 159, "beaten": 6, "toplay": 1, "dropped": 4}, "playtime": 2, "achievements_count": 326, "ratings_count": 20, "suggestions_count": 348, "game_series_count": 0, "reviews_count": 20, "platforms": ["PlayStation 4", "Xbox One", "PC"], "developers": ["Dovetail Games"], "genres": ["Simulation", "Sports"], "publishers": ["Dovetail Games", "Dovetail Games - Fishing"], "esrb_rating": null}