{"id": 101820, "slug": "bit-odyssey-itch", "name": "Bit Odyssey (itch)", "name_original": "Bit Odyssey (itch)", "description": "<p>\n<strong>Updated: 05/07/2016</strong>\n</p><p>\n<em>\"Shaping up to be what could possibly be the best game of its kind that's ever been made..\"</em>\n</p><p>\r\n\t-Craig Forshey, Super Game Droid\r\n</p><p>\n<em>\"I don't know about you, But this the game I've wanted to play my whole life\"</em>\n</p><p>\r\n\t-Owen Faraday, Pocket Tactics\r\n</p><p>\n<br/>\n</p>\r\nAre you ready to sit in the Captain's Chair?<p>\r\nFrom the creators of Vincere Totus Astrum comes a universe of exploration and adventure. As the Captain of your own Starship begin your trek of literally endless worlds by first selecting and editing your randomly generated race and ship, then set out for the stars.\r\n</p><p>\r\n\tEncounter alien races and exotic locations as you travel in an endlessly procedurally generated galaxy. No two game are the same. As you explore, randomly generated \"Episodes\" will have you fighting hostile ships, helping aliens and exploring the surface of new planets.\r\n</p><p>\r\n\tHow long can you survive the deep of space? How far can you travel? Who knows what is waiting for you! Your trek begins now! \r\n\t<strong>INCLUDES STEAM KEY</strong>\n</p><p>\r\n\tAvailable on Steam: \r\n\thttp://store.steampowered.com/app/328740\r\n</p><p>\r\n\tAvailable on Humble Bundle: \r\n\thttps://www.humblebundle.com/store/p/tinytrek_storefront<br/>\n</p><p>\n</p>\r\nSetting out to the stars!\r\n<p>\r\n\tThe game starts with players selecting a Home Star from the intro screen galaxy view. From there you zoom into your new system and select a homeworld. The type of the star and the kind of planet you select orbiting it determines some of the base stats of your race. A low gravity cool and wet world tends to produce sentient species that are more docile in nature, where as more hostile environments lead to more aggressive races. These differences help decide how battle-hardened they are or how adept at science they may be etc. From these base stats a player then sets out to determine the look of their race through a set of procedurally generated tools and what kind of society they come from. All of your decisions up to this point help affect what your ship will turn out like. Using procedural generation the game creates unique ship designs which you can edit. Design choices affect a ship's capabilities and stats. Once you're done, it's time to set out amongst the stars.\r\n</p><p>\n</p><p>\r\n\tBit Odyssey is designed to be endless... Well, endless if you are a good Starship Captain, that is. Players could select one direction and keep on going, if they choose to do so. The way you lose, of course, is getting killed or running out of resources. As you travel, make sure to orbit some stars and collect fuel. Damaged and need repairs? Visit a planet rich in minerals and mine for them, or trade with a local spacefarer.\r\n</p><p>\r\n\tExploration in itself is fun, but throughout your star hopping you will encounter randomly activated \"Episode triggers\". The triggers are the starting point for an adventure that is created procedurally from the Mission Matrix. For instance, you may locate a plasma trail during interstellar travel. The bridge crew would then ask you if you would like to investigate. If you choose yes, then the game may take you to a ship in distress in an asteroid field, or one that is under attack or has crashed on a planet. From there, your choices affect the rest of the episode. Attacking the damaged vessel will mark you an enemy of that race whereas tractoring them out makes them a friend</p>\r\nFeatures<br/>\n<p>\n<strong>Galaxy is big</strong> And when I say big I mean really big like a never ending Galaxy with stars, planets, nebula and other space phenomenon.\r\n</p><p>\n<strong>Do you have that ship in a different color? </strong>Yes we can do that with our procedural generation algorithms. Everything from the planets and stars to ships and races is created on the fly. And then to take it step further we provide you tools to edit your Ship and your race.\r\n</p><p>\n<strong>Lets fire blue particle cannons full...</strong> Engage in battles of one on up to three enemy vessels. Cool thing is with the Mission Matrix, a ship might jump out of battle and you may get the option to chase them, once you catch up you may finish them off or two of his friends might be waiting for you.\r\n</p><p>\n<strong>You think they have apples on an alien planet? </strong>I don't know if apples will be there, but the idea is that you can explore endless alien worlds and conduct various away missions. Planets will contain unique items that your science officer can scan, and your engineer can collect to bring back to the ship for trade.\r\n</p><p>\n<strong>Making Friends will be important</strong> Talk, trade and assisting other spacefarers will benefit you as each race you encounter will store an enemy, neutral or friend status. That will effect how your next encounter with them will be.\r\n</p><p>\n<strong>Episodes for everyone!</strong> In Bit Odyssey we have worked on creating a generator that creates randomized missions or as we call it, episodes. Each episode last around 3-8 minutes on average and include everything from search and rescue, transport, battles and more. Imagine receiving a distress signal, then approaching a ship to discover it's a trap. After defeating them and searching the ship discover that the stranded crew is on a nearby planet. The unique Mission Matrix generates over a 100 different \"episode\" types and puts them together.\r\n</p><p>\n<strong>Stuff is cool...</strong> Player will be able to collect and store unique plants, materials and relics you discover on your journey. And trade them for other resources or information.</p><p>#MadeWithFusion<br/></p>", "metacritic": null, "released": "2015-03-08", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/5b6/5b6373066c53f7de98477a8479c399d6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 217, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Clickteam"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}