{"id": 101872, "slug": "chupacabras", "name": "Chupacabras", "name_original": "Chupacabras", "description": "STORY:<p>\r\n\tMany years after the last sighting, an alien force has come down to earth to study earthling DNA. To do this they must bring back the legendary blood sucking beast known as the Chupacabras. This time it has returned to bring destruction and mayhem to the goat owners of numerous farms across the Caribbean Islands and Central America. He has returned to kill goats and suck their blood until they are dry as a goat prune, and spit acid in the face of the anyone who get in his way.\r\n</p>GAME DESCRIPTION:<p>\r\n\tYou play as the chupacabras, and your goal is to get the most goats possible, while avoiding the humans. Invade farms and get the goats.\r\n</p><p>\n<em><strong>Winning Conditions: </strong></em>\n</p><ul>\n<li>Get at least one goat before the time runs out. </li>\n<li>Get every goat present on the farm. </li>\n</ul><p>\n<em><strong>Losing Conditions: </strong></em>\n</p><ul>\n<li>Get caught by a human enough times to run out of hearts. </li>\n<li>Every goat escaped before the time runs out. </li>\n<li>The time runs out and you got no goats. </li>\n</ul><p>\n<em><strong>Game Progress: </strong></em>\n</p><p>\r\n\tThe game main goal is to get all the goats that you can while avoiding the humans and their bullets. The game difficulty will start very easy, but as the level increases, the difficulty will ramp up. The higher the level, the farther away can the humans and animals detect you, so hunting for goats will become increasingly difficult. Also there will be more humans on the farms to hunt you down. The game has up to 256 levels before it ends, so try your best to get all the goats and survive from the humans.\r\n</p><p>\n<br/>\n</p>PERSONAL NOTES:<p>\r\n\tThis is my first game, so I decided to make something simple. An arcade shooter inspired by the retro classics like pacman. Also inspired by my local folk stories here in Puerto Rico, in this case the legendary Chupacabras. I realy hope you enjoy the game, and there will be many more games to come.\r\n</p>", "metacritic": null, "released": "2016-09-29", "tba": false, "updated": "2019-08-28T23:25:00", "background_image": "https://media.rawg.io/media/screenshots/5ea/5ea63e5a8d660b1d230cfc245724d222.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 94, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Jonathan Velez"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}