{"id": 10193, "slug": "rend", "name": "Rend", "name_original": "Rend", "description": "<p>Choose your side in this faction-based survival game, pitting groups of players against each other amid hordes of horrific demons in an ongoing epic war.  Explore a mysterious and unforgiving world in search of resources and powerful artifacts as you race against the clock to achieve the glory of victory before you are wiped from existence.  Carve a unique niche for yourself with RPG-like talent and skill systems, allowing you to tailor your character to any play style.  Expand your technology and knowledge with your faction to unlock new heights of power to wield against your foes.  Defend your base against an ever increasing onslaught from the unyielding armies of the Lost, and from enemy player factions.  Survival is only the first step, as there can only be one victor.  Will you be lost and forgotten, or will you emerge as champions?Three Way Faction Warfare<br />\nEngage in a struggle for dominance between three factions: Order, Conclave, and Revenant.  You will not survive this war alone, and your faction will be your home in the world of Rend.  Together you will build a stronghold to withstand enemy forces and protect your valuable resources and buildings.  Only one faction can win this race toward victory, but all may lose.Play Your Way<br />\nTake advantage of deep and engaging talent and skill systems to fully customize your character.  Your character will end up with a personalized set of capabilities tailored specifically for you.  Find what you love to do and be rewarded for it, no matter your play style.Defend Your Base<br />\nThe world is a hostile place, and you will be called upon to defend what is yours.  Your home will be protected much of the time, but when the Time of Reckoning strikes, you will be open for attack from the armies of the Lost Ones.  Enemy factions may also strike while you are vulnerable, so your guard can never be let down.  Just remember, while your base is unprotected, your enemies are also ripe for plunder.Explore, Craft, and Research<br />\nYou and your allies will venture forth to explore and collect resource from the world and its dangerous inhabitants.  Upgrade your faction&#39;s technology in many different directions as you go, giving you the ability to craft more and more powerful weapons and armor.  Uncover the secrets of the spirit world to bind vanquished creatures to you as mountable companions, and unlock powerful magics to bolster your abilities.Conquer Your Enemies<br />\nHiding deep within the frozen hellscape of the Eternal Wastelands lie the keys to victory.  Long sealed tombs contain powerful artifacts you can use to turn the tide of war to your favor.  You must gather your allies and prepare for a grueling trip through harsh and unforgiving environments, battling against the world&#39;s most fearsome denizens.  Beware of waiting too long, as your coveted treasure may be stolen by enemy factions before you ever arrive.  Of course, you can always take it from their cold, dead hands...<br />\nEnter the world of Rend if you dare.  Only the strongest and most cunning will last long, and only one side will win.  Your survival is not guaranteed...</p>", "metacritic": null, "released": "2019-03-30", "tba": false, "updated": "2020-07-15T12:56:05", "background_image": "https://media.rawg.io/media/screenshots/fd4/fd49324410097fe67870e0ad9f488a94.jpg", "website": "http://www.frostkeep.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 36, "toplay": 1, "dropped": 1}, "playtime": 7, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 513, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Frostkeep Studios"], "genres": ["Action", "Adventure", "RPG", "Massively Multiplayer", "Indie"], "publishers": ["Frostkeep Studios"], "esrb_rating": null}