{"id": 101928, "slug": "better-to-upload", "name": "Better to Upload", "name_original": "Better to Upload", "description": "<p><strong>Description</strong><br/></p>\n<p>What if you had a huge fan base that loved you?  What if your content is what kept them alive? What if you stopped making content and took a break from them? What if you never came back? What if no medicine in the world can cure the ones you hurt? What if their world became so red they decided to get revenge? What if they decided to return the pain? What if it was simply Better to Upload? Maybe it would have been... Now you have a chance. There is still someone on your side to protect you. But they can always turn against you too. Don't let the red get you. Don't let him catch you. If you do... All I can tell you is that it is Better to Upload...</p>\n<p><strong>Story</strong></p>\n<p>You're a content creator who hasn't uploaded in three years. Don't make the same mistake. You started this and they won't stop until you die. Warning this game is not intended for kids and is very scary. It is also still in development and is only a small portion of what you can expect when the full game releases. </p>\n<p><strong>Disclaimer</strong></p>\n<p>This demo contains frightening scenes, loud noises, and flashing lights. This is still a work in progress build and is in early stages of development. Feedback is always appreciated. This game is a horror game. You might get scared here and there. </p>\n<p><strong>Controls</strong></p>\n<p>Use the WASD keys to move (In-Game and outside) Use space to interact, to Enter the game and to resume dialogue. Use Q to look to your right. Use F to toggle Flashlight. Use Enter to enter the monitor (In the Game).</p>\n<p><strong>Social Media</strong></p>\n<p>Twitter: @Tokaint</p>\n<p>Twitter: @QuickShockGames</p>\n<p>Youtube: https://www.youtube.com/channel/UCSw9vTKObKLWmEntduSLj8Q<br/></p>\n<p>Instagram: @tokaint</p>\n<p>Instagram: @quickshockgames</p>\n<p>These are the only Social Media I use linked to the game. Feel free to say hello.</p><p>Download for Android now!</p>", "metacritic": null, "released": "2018-08-01", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/ab2/ab2c8e69c4ced81c6b93013f7079ec5d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 75, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Android"], "developers": ["Tokaint"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}