{"id": 101918, "slug": "the-adventures-of-an-immortal-a-war-survivor-and-o", "name": "The Adventures of an Immortal, a War Survivor, and Other Misc. Queers", "name_original": "The Adventures of an Immortal, a War Survivor, and Other Misc. Queers", "description": "<p>\"<strong>The Adventures of an Immortal, a War Survivor, and Other Misc. Queers</strong>\"<br/></p>\n\n<p>The year is 2099. Since bombed by the Global Alliance in 2092, America's survivours are forced to gather into camps of tightly-knit civilians and ex-troops to survive - the elements, starvation, and stereotypical zombie-like creatures presumed to be the government's final blunder before its collapse.</p>\n<p>Play from the perspective of Rig - an immortal who has a hardcore thirst for higher ranking survivour Wink. </p>\n<p>Will Rig ever catch Wink's eye?</p>\n<p>Is there a secret hiding in plain sight?</p>\n<p>Was the government truly at fault for the creatures plaguing the United States?</p>\n<p>(First screenshot is Wink, second is Rig)</p>\n<p>*Note: this game is a demo and I will be updating as frequently as humanly possible. Currently it is not very long but I am trying my damndest to change that. There is cursing, if I need to have a warning for that, heh. I'm also working on drawings of the rest of the main characters, but not sure how soon I'm gonna get to all of them ^.^'</p>\n<p>MADE IN TWINE</p>\n<p>Thanks for playing and feedback is really appreciated.</p>\n\n<p>(5/12/18 - game published and submitted for Queerly Represent Me game jam (https://itch.io/jam/queerly-representing); Rig sketch added; Wink stetch added)</p>\n<p>(5/13/18 - Poe sketch added, although she is not yet been implemeted into this version of the game. She's on her way, though!)</p><p>(5/28/18 - V. 1.4 uploaded, text highlighted to make reading easier)</p>", "metacritic": null, "released": "2018-05-12", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/4f4/4f4cee5423c8a8c272a292ef69bb3105.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 70, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Android", "Web"], "developers": ["cactusfinger"], "genres": [], "publishers": [], "esrb_rating": null}