{"id": 10191, "slug": "concealed-intent", "name": "Concealed Intent", "name_original": "Concealed Intent", "description": "Concealed Intent is a simultaneous turn-based game of tactical space combat. Players control their ships in a fully 3D world - hunting down their enemies, just as they are being hunted themselves. In Concealed Intent you know your enemies are out there, but not exactly where, or even what they are.<br/><br/>To defeat your enemies you need to devise a range of strategies to gain enough information to successfully shoot at them. All the while they are trying to do the same to you.<br/><br/><br/><br/>Space is big and empty. Finding something can be like looking for a needle in a haystack, but there is nowhere for the needle to hide. To stay concealed a ship needs to fade into the background as much as possible. Everything a ship does will signal its presence and increase the ability of those nearby to detect it. A big ship may blot out stars as it passes. Heat from engines can be detected against the cold of the void. Lasers can be traced back to their origin. Eventually as detection increases, a firing solution can be calculated so that a beam of coherent light a few millimeters in diameter can cross thousands of kilometers to strike an evasive enemy - hidden no longer!Key Features<ul><li>Turn-based - play at your own pace<br/></li><li>Single player campaign<br/></li><li>Instant procedural PvE skirmishes, with various objectives:<ul class=\"bb_ul\"> <li> Duel - Head to head duel, only one team can survive!<br/> </li><li> Bases - Destroy the enemy base for victory.<br/> </li><li> Waves - Endless waves of enemies assaulting your base, how long can you hold them off? <br/> </li><li> Savior - A number of civilian shuttles are trying to reach a base while under attack, can you identify friend or foe quickly enough to save them all?</li></ul></li><li>Challenge your friends to online PvP duels &amp; play at your own pace - over minutes, days or weeks.<br/></li><li>Numerous playable ship types with configurable offensive and defensive ship components<br/></li><li>Rewatch turns<br/></li><li>User editable colors - colour-blind friendly<br/></li><li>Non-cheating AI - all the AI enemies have no more information than the Player would have in the same situation, and the same equipment<br/></li><li>Further skirmish options - set the number of player and enemy ships, apply modifiers (like \"Harder AI\" or \"Loot Drops\"), or even change the loadout of your opponent. </li></ul>", "metacritic": null, "released": "2016-08-02", "tba": false, "updated": "2019-08-28T22:14:34", "background_image": "https://media.rawg.io/media/screenshots/4c2/4c24345aecba2d2ff1f39c6ab5deb529.jpg", "website": "http://www.concealedintent.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 18, "toplay": 1}, "playtime": 3, "achievements_count": 8, "ratings_count": 0, "suggestions_count": 321, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "Linux", "PC"], "developers": ["Jarrah Technology"], "genres": ["Strategy", "Simulation", "Indie"], "publishers": ["Jarrah Technology"], "esrb_rating": null}