{"id": 101908, "slug": "syberia-3-deluxe", "name": "Syberia 3 Deluxe", "name_original": "Syberia 3 Deluxe", "description": "Digital Deluxe Edition includes: \r\n<p>Digital Standard Game</p>\n<p>Digital Soundtracks (*mp3)</p>\n<p>Exclusive Digital 20 first pages of the next Comic Books (*Pdf)</p>\n<p>1 Digital Wallpaper</p>\r\nOverview:\r\n<p>The limitless imagination of Benoît Sokal continues in Syberia 3, focusing on an entirely new adventure. After abandoning the island, Kate is found dying on the edge of a river by the Youkole tribe, a nomadic people migrating with their snow ostriches. Stuck in Valsembor village, together they must find a way to continue their journey in a race against their enemies and unexpected obstacles, not to mention Kate's past, which catches up with her.<br/></p><p>The next generation in adventure games, Syberia 3 takes you inside an enchanting, mysterious universe full of life for you to explore in 3D. Plunged into the heart of a world inhabited by a cast of interesting characters, you'll discover and experience a fabulous tale as imagined by Benoit Sokal.</p>\n\n<ul><li>A brand new tale, completely different from the first two Syberia games</li><li>Exceptionally immersive storytelling, multiplied by Benoit Sokal's unparalleled artistic direction</li><li>Explore Benoit Sokal's poetic universe in 3D for the first time</li><li>Original score by Inon Zur (Syberia 2, Fallout, Dragon Age, Prince of Persia)</li><li>Original, real-time 3D puzzles and mysteries</li></ul>\r\nPreviously in Syberia\r\n<p>A lawyer in NYC, Kate Walker was sent to Europe on a simple mission that gradually transformed into personal quest, an adventure that led her on a voyage aboard a locomotive bound for the reaches of the Europe. Accompanied by a robot named Oscar, she fulfilled inventor Hans Voralberg's dream, searching for the last mammoths all the way on the legendary island of Syberia.</p>", "metacritic": null, "released": "2017-04-19", "tba": false, "updated": "2023-11-23T11:43:50", "background_image": "https://media.rawg.io/media/screenshots/e23/e23c346c5da961b9918c96e2c6f921c8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"beaten": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 3, "suggestions_count": 507, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC"], "developers": ["Plug In Digital"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}