{"id": 102080, "slug": "dactylographe", "name": "Dactylographe", "name_original": "Dactylographe", "description": "<p>Dactylographe est un jeu de réflexion dans lequel il faut trouver des mots pour en affronter d'autres.</p>\n<p><em>Note : Cliquer une fois dans la fenêtre après le lancement du jeu pour pouvoir utiliser votre clavier en plus de votre souris.<br/></em></p>\r\nConcept\r\n<p>Lors d'un affrontement, vous êtes face à un mot qu'il vous faut neutraliser. Pour cela, vous devez écrire vous même un mot avec le plus de lettres concordantes possibles. Les lettres correspondantes adverses seront détruites, celles qui restent vous infligeront des dégâts.</p>\n<p>Le jeu a des aspects de rogue et beaucoup d'aléatoire.<br/></p>\n<p>Votre clavier est votre arme, et vous commencez la partie avec une machine à écrire aux touches manquantes. Elle n'en compte que 9 ! Toutefois, vous aurez régulièrement, vous aurez la possibilité d'en récupérer de nouvelles, vous permettant de mieux vous défendre face aux nouvelles attaques. De la même façon, vous pourrez récupérer de la vie ou améliorer votre endurance.</p>\n<p><strong>Retrouver toutes les lettres manquantes pour terminer la partie.</strong></p>\n<p><em>Attention, la machine à écrire est vieille. Lorsque vous utilisez trop de fois la même lettre, il est possible qu'elle reste enfoncée...<br/></em></p>\n\r\nRéalisation\r\n<p>Jeu réalisé seul pour la game jam POT-AU-JEU du 20 au 22 juillet 2018. Thème : \"Faire du neuf avec du vieux !\"</p>\n<p>Pour l'occasion, c'était ma premier Game Jam. Merci à At0 qui trouve les mots justes pour donner la motiv' :)<br/></p>\n<p>Optimisé pour Firefox et Chrome.</p>\n\r\nCrédits\r\n<ul><li>Framework JS : vuejs.org</li><li>Icones : feathericons.com et game-icons.net</li><li>Sons : freesound.org</li><li>Dictionnaire français : lexique.org</li><li>Polices :<ul><li>Averia Libre : 1001fonts.com/averia-libre-font</li><li>Inconsolata: fontsquirrel.com/inconsolata</li></ul></li></ul>", "metacritic": null, "released": "2018-07-22", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/a48/a48c587aa99cbc73e1e77a6daf4afa5a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 29, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Citron Curieux"], "genres": ["Strategy", "Puzzle"], "publishers": [], "esrb_rating": null}