{"id": 102070, "slug": "lust-for-darkness-itch", "name": "Lust for Darkness (itch)", "name_original": "Lust for Darkness (itch)", "description": "<p>Jonathan Moon receives a letter from his wife who has gone missing a year before. Following information from the message he heads for a secluded mansion where an eldritch, occult ceremony takes place.<br/>Gates to another world - the profane, perverse land of Lusst’ghaa are opened.<br/><br/><br/></p>TWO WORLDS\r\n<p>Move in both a Victorian mansion and Lusst’ghaa - an alien dimension filled with otherworldly creatures. Lusst’ghaa used to be similar to our earth until the local beings decided to undergo total degeneration at their own wish. Through experiments they transformed their bodies so that they could never cease to experience carnal delights. Hundreds of years have passed since that metamorphosis and Lusst’ghaa is now a land overgrown with alien vegetation and full of monstrosities squirming in a never ending ecstasy. <br/><br/><br/></p>FEATURES\r\n<ul><li>Erotic and occult themes</li><li>World design inspired with works of Lovecraft, Giger &amp; Zdzisław Beksiński</li><li>Exploring a Victorian mansion and the world of Lusst’ghaa</li><li>Using portals to traverse between two alternative realities</li><li>Searching for hidden items to unlock side stories find out more about the game’s backstory</li><li>Escaping the creatures of Lusst’ghaa</li><li>Original soundtrack by a known composer (Draco Nared)</li></ul>", "metacritic": null, "released": "2018-06-08", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/870/870448a77841d5bf3129a5fe81a6904e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 297, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Plug In Digital"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}