{"id": 102094, "slug": "heroes-of-loot-itch", "name": "Heroes of Loot (itch)", "name_original": "Heroes of Loot (itch)", "description": "<p>Heroes of Loot combines the action of twin-stick shooters with the dungeon crawling of rogue-likes. You'll find yourself in the middle of hordes of ghosts, skulls, cyclops, critters and much more.. survive using quick reflexes, level up to improve your weapon, and if you have time complete some quests for extra loot and upgrades.</p><p>Heroes of Loot get's a lot of the inspiration from the original 80's classic Gauntlet games, combined with Robotron and Smash-TV style gameplay.</p><p>There are various secrets to uncover, hidden rooms full of special items to find, and perma-items to find and collect for extra power.<br/>So, how deep into the dungeon can you go?</p><p>Play it alone, or with a co-op buddy.. just be sure to share the loot, healing potions, weapons, and shields…<br/>…or not, and sacrifice your buddy for your own gain !</p><p>Heroes of Loot is a dungeon-game like no other: every time you play the dungeon will be different, every time you become better, the dungeon will also grow and become more dangerous..</p><p>this game will learn from you !</p><p>Features:</p><ul><li>Unlimited amount of randomly generated dungeons</li><li>Random quests to reward you with extra loot, items, experience, and more</li><li>Four classes to choose from: Elf, Warrior, Wizard and Valkyrie</li><li>Special fifth class to unlock for the real gamers</li><li>Secret area's</li><li>Special mysterious dungeon items and obstacles</li><li>A large collection of loot and items to acquire and aid you in your quest</li><li>Always changing gameplay</li></ul><p>This rogue-like walks a fine line between dungeon-crawler and shoot-em up.</p>", "metacritic": null, "released": "2014-01-21", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/15d/15d5e534c8d4e8cba52dd2a5475b5b5c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 92, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "macOS", "Linux"], "developers": ["Orangepixel"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}