{"id": 102011, "slug": "goo-saga-hd", "name": "Goo Saga HD", "name_original": "Goo Saga HD", "description": "<strong>Goo Saga is a platform adventure game that takes place in a   hidden underwater lab, where a reclusive genius scientist seeks to create   life for his own enigmatic reasons.</strong> <br/><br/>After many failed attempts, he succeeds   in creating Goo, a strange creature with elastic properties. The scientist   soon disappears mysteriously and Goo embarks οn a perilous journey through   the sunken laboratory, in an effort to find his creator – and with him, the   purpose of his own creation. Will Goo succeed? <br/><br/>Throughout the game, the player   is invited to guide Goo and solve puzzles, avoid deadly traps and face an   army of foes that threaten to bring an end to his quest. Goo’s destiny is in   the player’s hands. Goo can be in one of three states: Deflated, Normal, and   Inflated, each one conferring different advantages. The player may choose   which is the most suitable for each situation Goo faces, as the game   progresses. <br/><br/>Finally, the player may collect crystals by completing levels in   different modes (Normal, Survival, Time Trial). Crystals are important as   they may be used to enhance Goo’s various abilities in order to get through   levels of increased difficulty. Free access to a powerful level editor allows   the player to extend Goo’s journey of discovery in unprecedented directions.\r\n\n\n<br/>", "metacritic": null, "released": "2017-08-03", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/ab4/ab4953ae158631f16c7b276c93849ee4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 251, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Libredia"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}