{"id": 102054, "slug": "stahlkampf", "name": "Stahlkampf", "name_original": "Stahlkampf", "description": "Um jogo de estratégia em turnos em uma Alemanha dieselpunk<p>\r\n\tApós a queda do Império Alemão durante a Primeira Guerra Mundial, máquinas avançadas foram criadas para reparar os estragos causados nos conflitos. Porém um grupo dessas máquinas iniciou uma rebelião e ameaçam todas as nações da Europa! Em \r\n\t<strong>Stahlkampf</strong>, você é o comandante de uma pequena força-tarefa designada para esmagá-los antes que seja tarde demais! ...ou você é a mente biônica por trás dessas máquinas, pronto para conquistar o planeta! <em>De qual lado você está?</em>\n</p><p>\r\n\tBaseado em clássicos como Advance Wars e Fire Emblem, você controlará suas unidades pelo mapa, aproveitando os benefícios de cada uma e o terreno onde elas estão para chegar à vitória. \r\n\t<strong>Stahlkampf</strong> é um jogo para dois jogadores — você poderá chamar outro comandante para enfrentar as suas tropas. Está pronto para vencer essa batalha?\r\n</p><ul>\n<li><strong>Multiplayer local</strong> para dois jogadores</li>\n<li><strong>2 operações exclusivas </strong>para serem revividas</li>\n<li><strong>3 tipos diferentes </strong>de unidades, com características distintas<br/>\n</li>\n<li><strong>Vários terrenos</strong> que influenciam na hora da batalha<br/>\n</li>\n<li><strong>Trilha sonora exclusiva </strong>e disponível no SoundCloud</li>\n</ul><p>\n<em><strong>Stahlkampf </strong>foi feito no processo de treinamento de novos membros, em 2015, usando GODOT. Ele está disponível para Windows, Linux, Mac OS X e Web, apenas em Inglês. Além disso, o código-fonte do jogo também está disponível no GitHub.</em>\n</p>Como jogar<p>\r\n\tAntes de jogar, você deve escolher um dos níveis disponíveis — \r\n\t<em>Operation Burning Lake</em> ou <em>Operation Mobius</em> —, clicando em Operations. <strong>Stahlkampf</strong> é um jogo para dois jogadores, então, você revezerá o controle do jogo com uma outra pessoa, cada uma liderando um dos lados da batalha, os humanos e os robôs. No centro superior da tela, você pode ver um círculo laranja, que mostra de quem é a vez de jogar.\r\n</p><p>\r\n\tPosicione uma unidade do seu time no Quartel General do inimigo para vencer (o prédio com a bandeira). Selecione unidades com o clique esquerdo para gastar um ponto de ação (mostrado no topo da tela) e revelar seu alcance de movimento e de ataque. Quadrados azuis indicam possibilidade de movimento, e quadrados vermelhos, possibilidade de ataque. Clique com o botão esquerdo do mouse para mover, e com o direito para atacar. Passe o mouse por cima de uma unidade para revelar algumas informações, como pontos de dano e vida.\r\n\t<br/>\n</p>Ouça a trilha sonora!Listen to the soundtrack!In English<br/>\n<p>\n<strong>A TURN-BASED STRATEGY GAME SET IN A DIESELPUNK GERMANY. </strong>After the downfall of the German Empire during the First World War, advanced human-like machines were built in order to repair the damages caused by the war. But, in the middle of Germany, a group of these machines started a rebellion and threatens all the nations of Europe! In <strong>Stahlkampf</strong>, you are the commander of a small taskforce assembled to crush them before is too late! Control your units via turn-based mechanics much like Advance Wars and Fire Emblem in a two-player battle. <strong>Stahlkampf</strong> is available for Windows, Linux, Mac OS X and Web in English. The source is also available in GitHub.\r\n</p>Créditos (Credits)<ul>\n<li><strong>Programação (Programming): </strong>Arthur Souza, Ítalo Tobler, João Guimarães, Rafael Pedrosa</li>\n<li><strong>Arte (Art): </strong>Ítalo Tobler, Gabriel Simmel</li>\n<li><strong>Design de Jogo (Game Design): </strong>Rafael Pedrosa</li>\n<li><strong>Som (Sound): </strong>Arthur Souza</li>\n<li><strong>Dublagem </strong><strong>(Voice Acting): </strong>Gabriel Arantes<br/>\n</li>\n</ul>", "metacritic": null, "released": "2016-09-06", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/e92/e927066f1eb7cd58f8d86d962a0557dc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 42, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Web"], "developers": ["Fellowship of the Game"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}