{"id": 102045, "slug": "skullshot", "name": "Skullshot", "name_original": "Skullshot", "description": "The Skullshot Experience<p>\n<strong>Single Player</strong> | Multiplayer | Level Editor\r\n</p><p>\r\n\tSkullshot was originally created in 2014 as a spooky single player experience, but we've done a lot of work on it since then, adding a multiplayer mode as well as a level editor! Unfortunately, due to the nature of these modes and the way the game's code has evolved throughout their creation, we've decided to release each of them as separate components for now. Our long-term plan is to combine them all into a single, complete game and likely sell it for few bucks, so enjoy this stuff while it's free!<br/></p><p>\r\n\tScully never could quite get a\r\n\t<em>head</em> in life...but the afterlife is a different story! Play as Scully the Skeleton, whipping your skull at bats, ghosts, frogs, and pumpkins in a number of tough platforming stages that will put your reflexes to the test! Take it slow and try to get a full combo or go full speed ahead and aim for the best time!\r\n</p>Controls:<ul>\n<li>Skullshot is played with a mouse and keyboard, but we plan on supporting gamepads in the future!</li>\n<li>WASD moves Scully left and right, up and down. You can also use spacebar to jump if you've just finished a Quake III marathon and don't have time to argue with muscle memory!</li>\n<li>Left click to throw your skull and right click to drop or roll it!</li>\n<li>After losing your head, pull it back toward you by clicking either mouse button. Just make sure you're unobstructed and ready to catch it!</li>\n</ul>How to Play:<ul>\n<li>Throw your skull at baddies to take them out! Destroy all the enemies in a level and you win!</li>\n<li>Beat the level fast enough to win a medal! Try to beat your friend's best times!</li>\n<li>Try to keep your combo running! If your skull takes out an enemy and you don't pick it up after five seconds, you'll break your combo. It's the five second rule!</li>\n<li>Don't get hit too many times or you'll be sent to an early grave...for the second time, from the looks of it!</li>\n</ul>Tips and Tricks:<ul>\n<li>Did you know? Your head is the smartest part of your body! Your skull will seek out nearby enemies after the first contact, so look for patterns!</li>\n<li>Maintain a high combo to keep your skull moving fast! You'll move a little faster without the weight, too!</li>\n<li>Man, you must have a really heavy head...looks like you can double jump while headless as well!</li>\n<li>You can only use the recall technique once per throw, but taking out an enemy will restore its use!</li>\n<li>Even if you're blocked by a surface, recalling your skull could give it that extra bounce it needs to hit another target!</li>\n</ul>Credits:<p>\r\n\tProgramming by Eric Neuhaus (@donkeyspaceman)<br/>\r\n\tArt by Colin Greenhalgh (@CuddlyColin)<br/></p><p>\r\n\tCreated with Scirra Construct 2<br/>\r\n\tSound effects made with Bfxr\r\n</p>", "metacritic": null, "released": "2014-11-01", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/7de/7de6b8ce3ad628f8184a4e3a5d204ea1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 130, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Web"], "developers": ["Virtually Competent"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}