{"id": 102075, "slug": "space-lords", "name": "Space Lords", "name_original": "Space Lords", "description": "<p><em>Let the battle for galactic supremacy begin!</em></p>\n<p><strong>Space Lords</strong> is a 1-4 player space-station smashing battle-game for the Commodore 64/128 home computer that supports a huge variety of controllers (joysticks, mice, paddles, keyboard and the Protovision 4-Player adapter) and includes several game modes for either tournaments or single play sessions.</p>\n<p>Initially released as one of the higher scoring entries in 2011's C64 16KB Cartridge Competition, ALeX, Retrofan and Taxim from P1X3L.NET are proud to present the 'Centaurus' version of the game on a 16KB cartridge courtesy of RGCD, complete with a space-freighter load of aesthetic and gameplay improvements over the previous Andromeda and Andromeda II builds.</p>\n<p>\n<strong>Space Lords</strong> features:</p>\n<ul><li><em>1-4 player interstellar mayhem (Protovision 4-player adapter required)!</em></li><li><em>Supports joystick, paddle, keyboard and mouse control!</em></li><li><em>Multiple game modes!</em></li><li><em>Fiendish AI opponents!</em></li><li><em>Beautiful graphics and an awesome SID soundtrack!</em></li><li><em>Full PAL &amp; NTSC compatiblity!</em></li></ul>\n<p><em>For further information on the game, please check the press kit.</em><br/></p>\n\n<p><strong>Playing Space Lords on Windows, Mac or Linux</strong></p>\n<p>Please note that the downloadable Commodore 64 version available here is primarily for use with emulators, but can also be run on a real C64 via hardware such as the 1541 Ultimate II or Turbo Chameleon. For emulator users, we recommend VICE, as it works on a variety of operating systems and is very user friendly. In fact, we've even included a pre-configured Windows, Mac and Linux version of the emulator with the download as well as some simple user instructions (we're nice like that).</p>\n<p><strong>Buy Space Lords on Cartridge for your Commodore 64 Computer!</strong></p>\n<p>Enjoyed <strong>Space Lords </strong>on your modern-day PC? Have an old Commodore 64 stashed away in the loft? Well, you'd be a fool not to grab a physical copy of the C64 version - it comes boxed with a manual, vinyl stickers and even a postcard, just like in the good old days!</p>\n\n\n<p>Head on over to our online store to order your copy today :)<br/></p>", "metacritic": null, "released": "2018-02-02", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/72b/72b4b3e363c25d61d95208831f8a7e2b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 121, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "Linux", "PC"], "developers": ["RGCD.DEV"], "genres": ["Action"], "publishers": [], "esrb_rating": null}