{"id": 102163, "slug": "centauri-sector-itch", "name": "Centauri Sector (itch)", "name_original": "Centauri Sector (itch)", "description": "<p><strong>Centauri Sector</strong> is a tactical, space combat game that combines several gameplay elements effectively to create an addicting game. You assume the role of a fleet commander, starting out with a basic corvette class ship, tasked with defending the Tabula Rasa system from constant space pirate attacks. The main campaign plays in turns, as players move their ship or fleet once per turn before engaging in the tactical battles. <br/><br/>After each successful mission, players gain prestige (money/credits) and experience, to level up and unlock skills like speed boosts, shield upgrades and more. The level ups also allow fleet slots to add ships to a squad. Not only can different ship types be added, but each ship has different weapon and module slots depending on the class. Players can also purchase and add modules that increase shield capacity, buffer a weapon's overheating rate, and speed up engines. </p>\n<p><strong>Features:</strong></p>\n<ul><li>Pilot your flag ship in a awesome top down 2d combat.\r\n</li><li>While in combat, manage your shields, power, weapons capacitor and more.\r\n</li><li>Engage in advanced tactical combat by forming your own fleet and issuing commands to destroy your enemies.\r\n</li><li>Gain new active and passive skills and bonuses by climbing through the ranks.\r\n</li><li>Equip your ships with a wide variety of modules and guns.\r\n</li><li>Engage in a dynamic war powered by a turn based dynamic campaign that doesn't always plays the same.</li><li>Participate in ground defense missions.</li></ul>\n<p><strong>System Requirements:</strong></p>\n\n<p>MINIMUM: </p>\n<p>OS: Windows 7 <br/>Processor: Intel Core 2 CPU <br/>Memory: 2 GB RAM <br/>Graphics: NVIDIA GT/s 2xx or Equivalent <br/>DirectX: Version 9.0c <br/>Hard Drive: 300 MB available space <br/>Additional Notes: Works on XP too, but this might change on future updates.<br/></p>", "metacritic": null, "released": "2014-11-20", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/6ac/6ac31dcbfe7d4ce2b970d432506cb327.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 162, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["LW Games"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}