{"id": 102147, "slug": "jeff-penguinns-cartridge-stacking-professional", "name": "Jeff Penguinn's Cartridge Stacking Professional", "name_original": "Jeff Penguinn's Cartridge Stacking Professional", "description": "<p>\r\nSo after watching Giant Bomb's \r\n\tUnprofessional Fridays: 10/31/2014 I was left with the image of Jeff Gerstmann sitting there in a penguin costume, struggling to play Super Puzzle Fighter II Turbo on a modular CPS-2 setup.\r\n</p><p>\r\n\tI was giggling, I was weeping. I knew I had to do something. This game is the result of the few weeks after that broadcast. I had 3 goals while making it:\r\n</p><ol>\n<li>Make a match-3 game using only red-green colorblind friendly colors. As it turns out, that means mainly yellow and blues.</li>\n<li>Have a \"drop a cart onto its matching console to score\" mechanic. Something like Kirby's Star Stacker or Burger Time.</li>\n<li>Make a game! This is the first game I've made by myself from scratch (well, in Game Maker: Studio). Until now I've had to rely on other people for coding. So just having something full and playable is an accomplishment for me.</li>\n</ol><p>\r\n\tCoded in Game Maker: Studio. All art created from scratch. Music created using MTV Music Generator for the PS1.\r\n</p><p>\r\nGiant Bomb<br/>\r\nOleetku Studios\r\n</p>UPDATE 3/30/2016:<p>a new version of Cart Stacker Pro is currently in the works! It's getting a large backend upgrade, huge gameplay changes to multiplayer, and a bunch of new art. The preview video at the top of the page is from a WIP build of this new version.</p><p>Although I'm happy with the progress made so far, it's still not close enough to know when it's going to be ready for release. But rest assured I want to see an improved version of the game out at least as much as you do!</p>How to play:\r\n<p>Instructions are laid out in the Single player / practice mode.</p><p>Drop carts on top of consoles to clear the consoles and earn a point.</p><p>Match 3 cards in a row (even diagonally) to clear them out, but for no points.</p><p>Make a match of more than 3 (4, 5, T-matches, 2 sets of 3, etc.) for bonus points.<br/></p><p>Player 1:</p><ul>\n<li>A /D keys to move</li>\n<li>W / S keys to pick up and drop</li>\n<li>Spacebar to switch pocketed cartridge</li>\n</ul><p>\r\n\tPlayer 2 / single-player:\r\n</p><ul>\n<li>Left / Right Arrow keys to move</li>\n<li>Up / Down Arrow keys to pick up and drop</li>\n<li>Numpad 0 to switch pocketed cartridge</li>\n</ul><p>\r\n\tGamepad:\r\n</p><ul>\n<li>D-pad to move</li>\n<li>A to pick up</li>\n<li>X to drop</li>\n<li>Y to switch pocketed cartridge</li></ul><p>Just like a collecting video games in real life, there is no way to win. Just keep things as organized as you can and go for the high score.</p><p>Single player and multiplayer. Some difficulty settings in the options menu.</p>Updates:<p>1.0: First release.</p><p>1.1: fixed gamepad support (worked incorrectly in SP, added support to menus).</p><p>1.1.2: More gamepad support update. Single Player mode now accepts both arrows and num0 as well as wasd and space.<br/></p>", "metacritic": null, "released": "2014-12-06", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/f32/f32da0f6338e6a88bc68cc9b1f2578d5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 112, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["LCom"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}