{"id": 102146, "slug": "catacombs-1-demon-war-itch", "name": "Catacombs 1: Demon War (itch)", "name_original": "Catacombs 1: Demon War (itch)", "description": "<p>You have lived in the village of Glendoe your entire life. Little did you know there were evil forces at work that have cursed your family for generations, and now after your father's passing, you must discover the dark past of your home and defeat the corruption that threatens everything you hold dear.</p>\n<p>Catacombs 1: Demon War is the first of a 3-chapter odyssey that puts you into the shoes of a brave young hero, building your strength to face long-buried secrets, deception and betrayal.<br/><br/>Features:</p>\n<ul><li>High-res 720p (1280x720) graphics, maps, monsters and backgrounds, and customizable options menu includes lots of font and window graphic choices along with easy mouse or keyboard controls, so you can play the way you like.</li><li>Stirring high-quality original orchestral music score and sound effects throughout the game.</li><li>Over 300 different weapons, armor and items to find, with over 160 prefixes and suffixes for each, making for hundreds of thousands of possible combinations.</li><li>Loot, gameflow and encounters are randomized each and every game for strong replayability. Customize your character with a point-based system. Build the character you want!</li><li>Novel-quality writing and professional voice acting to draw you into the story.</li><li>Easy to learn, slick combat interface gives you lots of options yet isn't overwhelming.</li><li>Over 35 quests to complete, companions to find and join your quest, and over 60 different monsters to fight keep things varied.</li></ul>\n<p>Explore the world of Catacombs in this thrilling RPG/Adventure game today! <strong>Steam key included with every purchase.</strong><br/></p>", "metacritic": null, "released": "2017-08-16", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/913/913d0abebc3ce111a3b7d0a6e40b0903.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 148, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SimProse Studios"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}