{"id": 10222, "slug": "battleline-steel-warfare", "name": "Battleline: Steel Warfare", "name_original": "Battleline: Steel Warfare", "description": "Real time strategy meets tank shooter in Battleline. <br/><br/>Defeat your nemesis one-on-one, command a squad of tanks to maneuver, and concentrate fire while invading other territories in a game of geopolitical chess using upgradeable tanks as your pawns!<br/><br/>If you love sighting and delivering sabot rounds downrange as well as invading enemy territory with your tank guild, then Battleline is for you!<br/><br/><strong>Features</strong><br/><ul><li><strong>Strategy at Multiple Levels (ARTS)</strong> - Only by winning strategic contests at every level is complete victory possible.  From tank sniping all the way to capturing enemy territory, Battleline requires quick, tactical decision making for battle supremacy. <br/></li><li><strong>Tanks From Every Era</strong> - Battleline brings tanks from the inception of armored warfare to modern day.  Tanks from the earliest days can fight alongside modern armor at any time!<br/></li><li><strong>Advance as a Team </strong>- Leave no one behind as you decisively conquer the enemy's home turf!  Combat is not just a shoot and scoot exercise though; skills executed at the right moment can turn aside an enemy’s shell or allow you to make that one in a million killshot!<br/></li><li><strong>Unit Commander</strong> - It's not just you on the Battleline.  You can command more than one tank in all of your battles.  Create tank teams that can not only attack but scout the enemy in lightning fast recons, pursue them in vicious counter-attacks or hold the line!<br/></li><li><strong>Long Distance Shooting </strong>- You can snipe tanks at distance after you maneuver into position!  From the point of view of an individual tank, take out adversaries with carefully set up skill shots.</li></ul>", "metacritic": null, "released": "2016-08-25", "tba": false, "updated": "2022-08-27T23:23:37", "background_image": "https://media.rawg.io/media/screenshots/41d/41dc6f6550e9ba66ae4584070c449e9e.jpg", "website": "https://www.battlelinegame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 134, "toplay": 1, "dropped": 1}, "playtime": 1, "achievements_count": 43, "ratings_count": 1, "suggestions_count": 274, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["CREANT Co."], "genres": ["Action", "Strategy"], "publishers": ["BANDAI NAMCO Entertainment US"], "esrb_rating": null}