{"id": 102220, "slug": "choose-your-own-caveventure", "name": "Choose your own CaveVenture", "name_original": "Choose your own CaveVenture", "description": "<p>Choose your own CaveVenture is a crossbreed roguelike dungeon crawl dropping the player in the depths of an unknown cave with only one goal: Find a way out, or perish in the attempt. The game marries the concept of a randomized dungeon and emergent adventures with the principles of choose your own adventure-books: The world is that of a classic roguelike but seen through a text description that offers you all options of what you can do in any given situation.</p>\n<p>Simple game play, deep mechanics and a mysterious cave full of monsters, mystical treasure and enigmatic shrines. Can you get to the exit alive or will this place be your tomb?</p>\n<p>Newest additions: Key configuration, rest until something happens, monster health status messages, highly experimental Linux version</p>\n<p>Current beta of the game features:</p>\n<p>-Six floors of procedurally generated cave.</p>\n<p>-Many different monsters, each with their own behavior.</p>\n<p>-Weapons, potions and amulets with mystery-effects.</p>\n<p>-Interactive features in the cave that can be both helpful and dangerous.</p>\n<p>-Quick roguelike gameplay: Beat the game in your coffee-break or experience permadeath.<br/><br/>Some tips for beginners:<br/>-Some monsters will chase you down, others won't. Learn which does what.<br/>-Expect to die a lot. This is about learning.<br/>-Use your surroundings to your advantage. Monsters have different sizes that affect how well they can traverse passages and how you can interact with them in some special rooms.<br/>-Stay hydrated.<br/>-Run away!<br/>-The cave is likely much smaller than you think – draw a map.<br/></p>", "metacritic": null, "released": "2014-02-16", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/e58/e58cf1b17eeb06fb8dff1e39af63decf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 38, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "Linux"], "developers": ["MadZab"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}