{"id": 102240, "slug": "a-matter-of-caos-complete-edition", "name": "A Matter of Caos: Complete Edition", "name_original": "A Matter of Caos: Complete Edition", "description": "<p>\r\nA Matter of Caos: Complete Edition\r\n\t<br/>\n</p><p>\r\n\tAn old style, pixel-art graphic adventure, a noir story in black and white.\r\n</p><p>\r\n\tMavropolis, a dark and corrupted city, where the crime rules and fear is the law.\r\n\t<br/>\r\n\tHere, you'll follow Mr. Gilbert, a private detective, in his mission: finding a missing girl.\r\n</p><p>\r\n\tNothing will be too easy, or to be taken for granted: you'll have to lead your investigations through a path of dangerous ladies, relentless mobsters, dark cults, corrupted policemen and infernal creatures.\r\n</p><p>\r\n\tIMPORTANT NOTE: Caos is not a misspelling. It's not 'chaos'. It's Caos.</p><p>You can play the game in episodes on Kongregate.com for free.</p><p>IMPORTANT: in this version there is a minor change in the story and more content at the end of the story! Moreover if you buy this version you will be able to download a package with ARTWORKS files and a small BOOKLET containing sketches and notes.</p><p>With this small donation you will help us to develop a new Mr. Gilbert adventure; we have so many ideas about this project.<br/><br/>We want to create something new:<br/>- a long detailed story, far deeper and captivating than the first one;<br/>- a completely renewed graphic style, more professional, elaborated and fully animated;<br/>- multi-languages support with completely revisited texts;<br/>- a full original soundtrack;<br/>- professional dubbed dialogues;<br/>- more engaging enigmas and mini games;<br/>- and much much more!</p><p>If you already played 'A Matter of Caos' series or you're going to play it and you like it support us as much as you can: even just speaking about us would be great!</p><p>If you have any issue don't hesitate to contact us at info@experagamestudio.it<br/></p>", "metacritic": null, "released": "2015-07-23", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/98e/98eb8ae3fb311dfb478407b6d713dd2a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 132, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["ExperaGameStudio"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}