{"id": 102204, "slug": "a-priori", "name": "A Priori", "name_original": "A Priori", "description": "<p>【Recruitment thread】</p>\r\n\"A Priori\" is a high-speed, logic-action game in which the player enters a school's game theory club. Here, the members propose simple games to be played together. Defeating your opponent alone is not sufficient, though: the real challenge takes place after the game itself. Your task is debating with (or against) the others members in order to find the only strategy that grants perfect play.\r\nSynopsis\r\n<p><em>A Priori</em> is a visual novel featuring a logic/mathematical game theme (please note that \"mathematical\" doesn't mean \"with numbers\": <em>Tic-tac-toe</em> is an example of that).<br/></p>\r\nStory\r\n<p>In order to ensure the overall quality of the dialogues and a reasonable amount of work, the story will follow a nearly linear structure with few branching paths (image below is an example of that).</p>\r\nThe length of the story itself won't be excessive, but it will contain elements of deep substance, such as depression and interpersonal relationship (see Setting and Character).\r\nGameplay\r\n<p>Finally, the gameplay: each minigame is a simple mathematical game inherent to the story (such as Tic-tac-toe, Chomp, but also games invented appositely) played against one or more characters controlled by a simple AI. Once the player wins, they will enter the Crack Phase.<br/></p>\n<p>In the Crack Phase, the goal is no more the defeat of your opponent, but the one of the game itself: you will have to provide a perfect strategy that guarantees victory from the start. This moment is much like a Danganronpa/Ace Attorney trial: a debate segment with various deductive minigames put in between (why don't you give a look at the screenshots?).</p>\r\nSetting\r\n<p>Even in your everyday japanese high school, having a Game Theory club is pretty unusual. And yet, the club's president seems to manage to keep the place running way to easily despite the lack of new inscriptions. While getting to know your friends better each day that passes, it will be up to you to unravel the club's mysteries. Or to decide it's better not.</p>\r\nCharacters\r\n Sango Kojima<p>You won't find a nicer girl than Sango anywhere in the world. She's always willing to lend a hand, and she's happiest when her friends are. After the Debate Club she was in closes because of... circumstances, she starts looking for something else, and ends up joining the small Game Theory Club.</p> Haruto Sato<p>Even though Haruto is pretty much the \"normie\" type, approaching him is not such a big deal. Also, because of this first year's lack of talent in everything he does, he is well used to studying and preparing stuff in advance. He meets Sango for the first time when they join the Game Theory Club together.<br/></p> Kayu Shibata<p>Don't let her loli appearence fool you: Kayu is a really foulmouthed girl! As one could easily expect from her, she likes sweets and chocolate, and this preference of her is also reflected in the games she proposes as club activities.<br/></p> Utamara Wakamatsu<p>Because of his body appearence, Utamara is not a very popular guy, and is often verbally abused by Kayu. He joined the Game Theory Club to make new friends: that's why he always tries to find games to be played by as many players as possible at once.<br/></p> Akia Sazama<p>Akia is the kind of senior student that would do anything to attract some cute girls. Since he's harmless, though, the female students of the school usually just ignore him or treat him kindly out of pity. He accepted the role of Vice President of the Club to please the Club President. He likes playing games that make him look cool in front of other, putting under the spotlight his hobbies and \"talents\".<br/></p>Una Yagi<p>Una is the Game Theory Club President. She is a very cool and composed person, so seeing through her isn't easy at all. She's a top-grade student, so she sometimes helps the club members with their studies. Unlike many other clubs' presidents, she is not interested in making her club bigger at all. For her, \"it's better to keep one's special place as intimate as possible\".</p>\r\nOST Samples\r\n\n\n\r\n\r\nKnown bugs<ul><li>If the text is too big for the message boxes, you probably forgot to install the game fonts first</li><li>Do not save when there's a multiple-choice question on-scren! The game will get stuck after answering if you load that save file later</li></ul>", "metacritic": null, "released": "2018-08-13", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/7dc/7dc089f85190408f2c1a99399022152e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 234, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["FoxySeta"], "genres": [], "publishers": [], "esrb_rating": null}