{"id": 102343, "slug": "dice-breaker-clicker-rpg", "name": "Dice Breaker - Clicker RPG", "name_original": "Dice Breaker - Clicker RPG", "description": "<p>The Dice Rangers have vanished.</p><p>Without the defenders of justice only one average high schooler – Takeshi must face the evil forces that took over the realm! Take part in truly challenging and hardcore RPG experience.</p><p>Start your own epic anime-like tale as a Dice Ranger and fulfill your destiny. Play as fifteen year-old Takeshi and become the defender of justice and harmony. Roll the dice, gain power, panties and skills and use them to fight dozens of epic enemies in this turn-based hardcore RPG tale. </p><p>Win with the evil villains by clicking them to death and challenge their fierce leaders with powerful allies by your side on the road to discover your ultimate fate.</p><p>Beware! They won't hesitate to use every trick in the book to put you down, conquer the realm and kidnap your Masked Love!</p><p>Take control over your destiny and become a true titan. Feel like the main character of an anime with a lot of action and comedy which will make you laugh many times!</p><p>Experience the trilling world of Dice Rangers where everything is dice. Items are dice. Skills are dice. And even dice are dice. Put your fate on the line, roll the 6 sided cube and stand against the destiny!</p><p><strong>Key features of Dice Breaker – Clicker RPG:</strong></p><p>- Epic anime – like storyline presented in comic book style</p><p>- Nonlinear RPG character development (choose your play style as a Dice Ranger - thanks to many different skills each fight may look different to guarantee you the best combat experience)</p><p>- Scheme breaking, innovative turn-based combat system that requires both thinking and dexterity</p><p>- Dozens of unique enemies (zombies, Slavic ninjas, old people, sexy robot chicks and much more)</p><p>- Classical RPG fashion items upgrading your skills and statistics</p><p>- High quality, hand-drawn graphics with astonishing special effects</p><p>- Really challenging, fierce boss fights which will test your tap skills and perception</p><p>- During Takeshi's adventures, experience tons of hilarious gags, meet variety of legendary anime heroes and pop-culture characters</p><p>Do you have nimble fingers ready for tapping? Enjoy hardcore fights which requiring some tactics? Love anime with epic stories, comedy and plot twists? If your answers are YES then face your destiny, suit up yours ranger armor and get ready for the heroic war!</p><p>Follow Us on </p><p>Facebook</p><p>https://www.facebook.com/fakefairygames/</p><p>Twitter</p><p>https://twitter.com/FakeFairyGames</p><p>Google +</p><p>http://www.goo.gl/ZCfgVI </p><p>Youtube</p><p>https://www.youtube.com/channel/UC-2cQKHaXsRBElwAb...</p>", "metacritic": null, "released": "2017-04-03", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/e7c/e7c1d3b5d1ecbaa8417ba046daf18521.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 213, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["FakeFairy"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}