{"id": 10237, "slug": "destination-ares", "name": "Destination Ares", "name_original": "Destination Ares", "description": "<strong>A colony spaceship has been thrown together with old, worn parts. The crew boots up the ship's artificial intelligence as they start the arduous journey to the red planet.</strong><br/><br/><strong>You've awoken, AI. Can you survive the journey ahead?</strong><br/><br/>Destination Ares is an unforgiving resource-management sim, wrapped in a pensive story. As the ship's AI, it's your job to keep the crew alive, against all odds and obstacles (including themselves).<br/><br/>After all,<br/><ul> <li> Everything breaks eventually<br/> </li><li> The crew members have minds of their own<br/> </li><li> And you're in a race against dwindling resources</li></ul><br/>Discover hidden story arcs, ponder the meaning of your existence, and panic as another system breaks down. All this while you laugh at (and cry over) a crew that is woefully incompetent.<br/><br/><strong> </strong>Unique Gameplay<br/>At your disposal, you have direct control over all of the ship's systems. Turn them on, turn them off, or throw them into overdrive. You can also set alarms on everything and everyone, just to make sure the crew pays extra attention.<br/><br/>Every resource is critical to your success. Even waste is important in the recycling loop.<br/><br/>Eventually, you'll run out of everything. What are you willing to give up first?<br/><br/>Events regularly pop up to throw a wrench in your plans. Sometimes it's random drama amongst the crew, sometimes it's another key step in your journey, and, if you're lucky, sometimes it's a nice chance to catch your breath. Each event poses a challenge to be overcome. Will you trust in luck? Or will you do your best to solve the problem yourself?<br/><br/><strong>There's a catch:</strong><br/><br/>The crew members are independent beings. You can't directly control them. They're also fickle, needy, and liable to mess everything up. Despite all that, only they can do any real work onboard. You'll have to rely on them, so treat them well.<br/><br/><strong> </strong>Features and Themes<br/><strong>Engaging Mechanics</strong><br/><ul> <li> Deeply involved resource management. Recycle resources through a meticulously fleshed-out loop that has several outputs and few inputs.<br/> </li><li> Travel determined by speed, heading, and acceleration based on real physics.<br/> </li><li> Unforgiving permadeath, plus a memorial to past attempts!<br/> </li><li> Heavy customization: create your own crew, build your own ship, plan your own system layouts, and allocate your own starting resources.</li></ul><br/><strong>Careful Design</strong><br/><ul> <li> Crew behavior (NPC AI) that makes you want to give up on humanity.<br/> </li><li> Branching story arcs with secret possibilities. Multiple outcomes and endings every step of the way.<br/> </li><li> Self-balancing difficulty: events will change in frequency based on performance. For example, helpful events come along more often for players falling behind. Take that, RNG.</li></ul><br/><strong>Stylistic Art</strong><br/><ul> <li> Retro pixel graphics with a unique twist and copious modern effects, taking full advantage of today's advanced tech.<br/> </li><li> Judiciously desaturated color scheme. (Candy colors are for candy games)</li></ul><br/><strong>Great Themes</strong><br/><ul> <li> Dark humor.<br/> </li><li> Nonviolent gameplay.<br/> </li><li> Struggles come from within. No aliens, no competitors. It's just you and your crew in desolate space.<br/> </li><li> Lose capability over time. You're no farmboy-turned-hero; play smarter, because you certainly won't get stronger.</li></ul><br/><strong>Natural Accessibility</strong><br/><ul> <li> Light, adaptable controls. Play with only a mouse, or take advantage of the many hotkeys. Your call.<br/> </li><li> Simple interfaces for a complicated simulation. Plenty of tooltips to peek under the hood, if that's your style.<br/> </li><li> Short game sessions; each run takes less than an hour (sometimes much less).<br/> </li><li> Inherently red-green colorblind ready.</li></ul><br/><strong>Built with Dedication</strong><br/><ul> <li> Lovingly handcrafted by one developer over years of blood, sweat, and tears.<br/> </li><li> Intended as a living title; expect updates throughout early access and maybe beyond.</li></ul><br/><strong>Amazing Music</strong><br/><ul> <li> All original tracks by R Kim Shultz, a composer plucked straight from the film industry.</li></ul>", "metacritic": null, "released": "2016-11-14", "tba": false, "updated": "2019-08-28T22:14:33", "background_image": "https://media.rawg.io/media/screenshots/db5/db52d43b0a7bc625d5768f019974e3dc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 4}, "playtime": 2, "achievements_count": 4, "ratings_count": 0, "suggestions_count": 109, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Patrick Scott"], "genres": ["Adventure", "Strategy", "Simulation", "Indie"], "publishers": ["Patrick Scott"], "esrb_rating": null}