{"id": 102309, "slug": "force-of-nature-itch", "name": "Force of Nature (itch)", "name_original": "Force of Nature (itch)", "description": "<p>*** Download links are available below ***<br/><br/>You are an angry walking tree protecting the forest from wood-cutting fire-wielding trolls.</p><p><strong>Force of nature</strong> is fast-paced combat roguelike with emphasis on classic run-and-bump gameplay. Your objective in each of 7 \"chapters\" (game levels) is to find an exit, kill the boss guarding it and proceed to the next chapter. Apart from bump attack (with added stun chance) you have roots, which automatically damage all visible enemies in some radius every turn – serving as some kind of ranged attack.</p><p>There are only <strong>two added mechanics</strong> on top of that – converting the terrain and naturalizing the corpses.</p><p><strong>Conversion</strong> – most of the tiles (both floor and walls) have two states, \"burned\" and \"regrown\". When you begin a chapter, most of tiles there are burned. Every turn, there is a chance that you will convert a random burned tile in your sight to regrown one. When this happens, you are getting small damage bonus and small health regeneration for the next few turns (this is called '<strong>Grace</strong>' in game). This is your only reliable source of healing, and running out of terrain to regrow means you won't be able to heal yourself.</p><p><strong>Naturalizing</strong> – corpses left by enemies can be naturalized (eaten) to get new talents and permanent bonuses. The problem is that naturalizing lasts for several turns and can not be interrupted, so it could be very dangerous (but possible and sometimes justified) to do this while being surrounded by enemies. Corpses deteriorate and disappear quickly while on the ground. Naturalizing is also used to pick up power-ups (\"essences\").</p><p>There are also lots of <strong>fire</strong>. Standing in fire or being attacked by fire could lead to your tree catching the fire up and <strong>burning</strong> for several turns. Burning stacks to 10 and could be very dangerous on higher stack levels. Standing in water instantly removes all fires from you.</p><p>You can develop your tree by getting experience levels, picking up essences and by naturalizing the corpses. There are <strong>talents</strong> (3 initially, but you can get more from corpses) which enhance your powers. Talents can be upgraded by spending talent points on them (<level+1> points are required to raise talent level by 1). Gains from upgrading your talents are slow at first, but can be rather powerful on higher levels.</level+1></p><p>Have fun restoring the forest and killing these pesky trolls!</p><p><strong>Known issues:</strong></p><p>- WebGL version could be lagging on slow PC's (Well, it's Unity).</p><p>- Resolution (and WebGL viewport) is fixed to 1024x768. Sorry, people with very large or very small displays.</p><p>- Sometimes level generator can't find a proper room to put you at the start, so you begin the level standing at random spot, usually surrounded by random bosses. After some thought, I decided not to fix it.</p><p>- Fair amount of silly English mistakes here and there.</p>", "metacritic": null, "released": "2016-03-11", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/f37/f3736575857d9e9933644329feb6fb57.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 64, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux", "Web"], "developers": ["Evgenii Petrov"], "genres": [], "publishers": [], "esrb_rating": null}