{"id": 102459, "slug": "space-time-quest", "name": "Space Time Quest", "name_original": "Space Time Quest", "description": "<p>Have you ever wondered what it would be like to be in charge of a budget of 100 million!? Have you ever wondered what it would be like to manage a continent spanning science project, with the aim of making one of the most important discoveries of the last 50 years? In Space Time Quest you use your scientific skills to build the most sensitive gravitational wave detector ever, and use it to listen to the symphony of the Universe as never before!\r\nSee how you compare to the best out there in our gravitational wave high-score hall of fame.\r\n</p>\n<p>Spread your budget wisely and optimise the different subsystems of an interferometric gravitational wave detector, of the same type as the real detectors, such as LIGO and Virgo. Be the first to detect the elusive gravitational waves, and the Nobel Prize will surely be yours!</p>\n<p>Space Time Quest can be played in English, Spanish, Catalan, Dutch, German, Chinese, French, Italian, Russian, Hindi, Japanese and Brazilian-Portuguese.!</p>\n<p>Have a look at our instructions on How to Play, and read about the history of the game.</p>\n<p>What is new in 1.5?</p>\n<ul><li>added event-specific leaderboards (by using an event tag)</li><li>new languages are available (Hindi, Japanese, Brazilian Portuguese) </li><li>a bug in the score calculation has been fixed</li></ul>", "metacritic": null, "released": "2017-09-01", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/cbc/cbc7ed87233d6c619ff36c043204203d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 116, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Android"], "developers": ["Laser Labs"], "genres": ["Simulation", "Educational"], "publishers": [], "esrb_rating": null}