{"id": 102438, "slug": "children-of-yohh-classic", "name": "Children of Yohh Classic", "name_original": "Children of Yohh Classic", "description": "<p><em>This game was created for Epic Game Jam BR.</em></p>\n<p><strong>Children of Yohh</strong> is a one on one, local multiplayer battle arena. </p>\n<p>In <strong>CoY</strong>, each player represents one of the elemental beings, Bmyohh and Tyohh, in the Duel of Totens!<br/></p>\n<p>In the game, players aim to destroy the opponent's Totem. For this, the players must use the Legendary Sword of Yohh. The first player to hit the opponent's Totem with the sword three times wins!<br/><br/>But this isn't all. Each player has the power of the 'sacred spit', which enables the champion to control some elements of the level. When the the 'sacred spit' hit the pillars of the arena, the player takes control of that pillar and can manipulate it using the power of Yohh's scream! Players can use it to defend themselves or make the enemy more vulnerable.<br/><br/>Children of Yohh is fast paced, extremely entertaining and a very competitive game that's a lot of fun! </p>\n<p><strong>COMMANDS:</strong></p>\n<p>Children of Yohh is a two player game, so you're gonna need two game controllers!</p>\n<p><strong>A Button: </strong>Jump;</p>\n<p>Analog and Digital Directionals: Move;</p>\n<p><strong>R1 Button:</strong> Hold the Legendary Sword of Yohh (must grab it by the handler!). You must hold the R1 button while you have the sword, otherwise you'll drop it;</p>\n<p><strong>X Button:</strong> </p>\n<p>+ If you have the Sword: Throw the Sword in the direction you're facing. </p>\n<p>+ If you don't have the Sword: Cast the 'Sacred Spit' in the direction you're facing.</p>\n<p>+ If you have hit the 'Sacred Spit' into one of the pillar's: Change the pillar instance (up or down).</p>\n<p><strong>That's it! :)</strong></p>", "metacritic": null, "released": "2017-04-17", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/ad4/ad4b7deff7f957c35d636b28d7f9f402.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 290, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["UNDEVS"], "genres": ["Action"], "publishers": [], "esrb_rating": null}