{"id": 102416, "slug": "dialogue-with-nature", "name": "Dialogue With Nature", "name_original": "Dialogue With Nature", "description": "<p>I was inspired by the film 'Avatar' directed and produced by James Cameron, especially when the plants on the planet Pandora emits light during the night time. The aim of this game is to walk around and explore different environments and with each environment has its own unique weird structured plants, all adapted to different environment. I also wish to capture the audience's attention through the flowers and plants, a message to appreciate the wonders of nature and protect it while we still can. <br/></p><p>\"Every single thing in existence is worthy of supreme reverence. Nature is not something for human beings to exploit as they see fit, solely for their own interests. Both nature and humanity are part—and at the same time complete expressions—of the life of the universe. To destroy the natural world is to destroy human life.\" - Daisaku Ikeda<br/></p><p>Controls (FPS): W,A,S,D for movement, MOUSE for camera movement, SPACE to jump, SHIFT to run</p><p>All the plants are design and model by me and it's my first time doing it :P Programs used: Maya and Unity</p><p>Textures for the ground and skybox are from the internet.</p><p>All the songs are by Yiruma: 'Kiss The Rain', 'Spring Time', 'When The Love Falls'<br/></p><p>This is my first year individual Uni project that I'm doing and I'm very new to it and still learning. I would love to improve this game, any comments would be helpful. Thank you! Enjoy! </p>", "metacritic": null, "released": "2016-10-25", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/800/8006a289de7054ed53ee959a01430913.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 253, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Yauwee"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}