{"id": 102466, "slug": "video-game-critic-simulator", "name": "Video Game Critic Simulator", "name_original": "Video Game Critic Simulator", "description": "<p>\n<strong>Video Game Critic Simulator</strong>\n</p><p>\r\n\tLive all the exciting highs, lows and mundane keyboard tapping involved in reviewing a game.\r\n</p><p>\r\n\tIt's time to write your very own Video game Review as a Video Game Critic. Brainlessly tap at a keyboard, leave in spelling mistakes for your editor to fix, edit your score to get mentioned on the Developer's Twitter and explore the fun world of writing about the newest installment in an annual game franchise.\r\n</p><p>\r\n\tVideo Game Critic Simulator is available to download for PC, Mac and Linux.\r\n</p><p>\r\n\tVideo Game Critic Simulator is Free. Like it? Buy me a beer or some junk food with a donation.\r\n</p>&lt;form action=\"https://www.paypal.com/cgi-bin/webscr\" method=\"post\" target=\"_top\"&gt;For press access to the game or interview requests contact @LauraKBuzz or LauraK@IndieHaven.com.&lt;/form&gt;<p>\r\n\t(When I started work on Video Game Critic Simulator, initially titled Game Journalist Simulator, I was unaware that the trademark on that name was owned by Jason Evangelho. Since starting work on the game his project has got a level of press attention. After discussions with Jason EvangelhoI I was able to continue and release my game, with some content changes and a change of name. Jason Evangelho is aware of my game, which was independently designed and created. He does not object to this game's release).\r\n</p>", "metacritic": null, "released": "2014-07-16", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/8ad/8ad6ed6f1617ac14a41ba9c8ab55a81b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 15, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Laura Kate Dale"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}