{"id": 102523, "slug": "vr-fractals-itch", "name": "VR Fractals (itch)", "name_original": "VR Fractals (itch)", "description": "<p>VR Fractals is a 3D Fractal viewer for the Oculus Rift and the HTC Vive. To use this you must have one of those headsets.</p><p>This is an experience similar to Oculus Dreamdeck, so expect about 5-20 minutes of gameplay for the price of a large candy bar.</p><p>Right now there are 8 fractals. A code editor is included which will allow users to create their own fractals/shaders and share them with the community. More fractals will be added in later updates as well.</p><p>There is a free demo available now with one fractal and no editor that should give you a pretty good jist of what to expect.</p><p>My method of rendering ended up not looking \"3D\". This is something I will just say is a downside of VR Fractals, that I want to be honest about, and that you can see in the demo.</p><p>There is a 1.02 beta version that contains three 3D fractals, alongside the editor (which also now functions in 3D). That comes for free if you purchase VR Fractals. There is an issue with Unity (the game engine that I am using) that causes lag once I build the remaining fractals in 3D (but they run smoothly in the editor). I'm trying to find workarounds to this issue, but I can't promise anything because part of it is out of my control. I'm sorry for those that didn't get what they were expecting.</p><p>I was planning on making a music visualizer as well. There isn't much interest in VR Fractals as is, so I can't really justify spending more time in it at this time. If more people become interested then I will pick this back up again, but I don't want to make promises. Sorry again for those that were looking forward to that.</p><p>7/16 - Update 1.01:</p><p>- Added the option to change the control scheme, which will allow users to use their Vive Controllers and other peripherals. Official Vive Controller support is planned for a future release.<br/></p><p>- Fixed a scaling issue on the Vive so things are no longer slightly distorted.</p><p>7/21 - Update 1.03</p><p>- Tweaked a few of the fractals (I think you'll enjoy the changes :) )</p><p>- Made all of the fractals actually be in 3D</p><p>7/30</p><p>VR Fractals is now on Steam! You can find it at http://store.steampowered.com/app/506160. Everyone that has purchased it on itch.io can download a free steam key here to be used there as well, and future updates will be on steam so it's recommended to migrate to there if you're interested.</p>", "metacritic": null, "released": "2016-07-16", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/b7e/b7ea8b1ee28b5adb143643a7afad7584.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 186, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["vrfractals"], "genres": [], "publishers": [], "esrb_rating": null}