{"id": 102607, "slug": "neurotic-beta", "name": "Neurotic (Beta)", "name_original": "Neurotic (Beta)", "description": "<p>You are a nobody in the land of Taelen. You woke up in this strange land with your friend Lerana with no recollection of time before now. You are unarmed, unprepared and confused. The only way now is forward. Beware of your interactions with others in this land, as something is very clearly... off...</p>\n\n<p>Awesome features:</p>\n<ul><li>Class switching! You can switch your class and/or a party member's class at any time. If you have leveled up on your default class, you will start at Lv1 if you switch classes. Every class has it's own level progression for each character.</li><li>Weapon upgrades! Find Runes, Glyphs and Orbs to upgrade your weapons with different enchantments: Status effect chance on hit, stat boost, change the element type of your weapon, etc. </li><li>Armor upgrades! Enchant your armor with different stat boosts.</li><li>Gamepad support! You can even change button binds</li><li>No main quest or quest log! Break away from that laundry list of petty tasks often encountered in RPGs. In this game, your character is a nobody from the start and you start little adventures depending on who you talk to. Play an RPG that feels like it would if you, yourself hopped into a fantasy world!</li><li>A world of insanity! Encounter psychotic desert hobos, autistic skeletons, aged hippie adventurers, neurotic slavers, asshole wizards, and much more! Each NPC that is worth a shit has been given my full love and attention.</li><li>Meaningful dialogue! Your interactions with many NPCs have lasting effects in the game world. Piss someone off and you may find they they want to fight, and fight ye shall. If you lose, it's game over. If you win, that person is gone forever for that play through as well as any items/services/quest/etc that they might have offered.</li></ul>", "metacritic": null, "released": "2017-05-27", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/f2e/f2e322351c9495ab2efb8a06e094385c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 127, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Xxaion"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}