{"id": 102720, "slug": "loonyland-2-winter-woods", "name": "Loonyland 2: Winter Woods", "name_original": "Loonyland 2: Winter Woods", "description": "<p>After vanquishing the Evilizer in Halloween Hill, Loony found himself traveling north in search of the Happy Stick Witch, following an ever-diminishing trail of clues.  Eventually, he became lost in a blizzard and collapsed, only to wake up in the care of a friendly villager in Winter Woods.  Now his quest takes him up high cliffs and even down into the depths of the earth, all in search of the mysterious truth behind Happy Stick.  Unfortunately, Winter Woods seems to have its own huge set of problems to distract him along the way...</p>\n<p>* Special bonus!  Loonyland 2 now includes the complete Collector's Edition contents, which means a over 2 hours of developer's commentary, level editor, bonus adventure, an art gallery with Gallery Goals to complete, and more surprises.</p>\n<p>* Action/RPG gameplay - gain levels, learn 50 Skills and 30 Talents, and decide how to develop your character</p>\n<p>* Randomly generated items with dozens of possible powers - millions of possible combinations!</p>\n<p>* Craft your own items, mix your own potions, and even build your own killer robots!</p>\n<p>* 50 Quests to guide you deeper into the mystery</p>\n<p>* 2 different sides to join, with unique quests and allies.</p>\n<p>* 100 hidden Achievements - complete them to unlock Game Modifiers</p>\n<p>* Modifiers let you tweak the rules of the game, playing it how you want, or adding fun new features</p>", "metacritic": null, "released": "2017-12-16", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/f07/f07c124b6f47bbd1c86cc157222226bf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 204, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Hamumu"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}