{"id": 10272, "slug": "cuit", "name": "Cuit", "name_original": "Cuit", "description": "In <strong>CUIT,</strong> it is only you and your mind. A challenging and relaxing puzzle experience, ready to test you from top to bottom.<br/>You are given a circuit. Interact with the buttons to navigate a current from the battery to a special target - Just make sure to avoid all the explosives, or you will have to start all over again. Sounds easy? Try it. And guess again.<strong>CUIT is challenging. Really challenging </strong> The term \"challenging\" is very overused these days. But to finish CUIT, you'll have to do your very best of logical thinking. But don't worry: CUIT is a perfect pastime for everyone, who likes to challenge their mind every now and then. No need to be a superhero.<br/><br/>CUIT doesn't require any prior experience in binary logic, circuits or computer engineering CUIT teaches it. <br/><br/><br/>CUIT is more than just a puzzle game: <strong>Create and share </strong>your own levels and playlists with the world and explore the wildest and most insane creations of the community - In CUIT, you are not restricted to only puzzles: With it's native support of logical operations, you can basically create functioning computers within it - The only limitation is your mind.<br/><br/>Level up through 4 tiers and 60 ranks, solver over 100 levels, earn the golden trophy's for each and unlock new backgrounds, special puzzles and gather all Steam-Achievements. Create your own mind-bending levels and watch others loose their head over it. Come in - relaxe - and have fun!<br/><br/><ul><li>-Over 70 Levels<br/></li><li> Integrated Level-Builder<br/></li><li> Integrated Steam-Workshop Support<br/></li><li> Soundtrack with 10 tracks by 'AK' (Aljosha Konstanty)<br/></li><li> Steam Acchievements<br/></li><li> Ranks and Tiers<br/></li><li> Level-Challenges<br/></li><li> Over 30 logical gates<br/></li><li> Special Level-Creator-Features</li></ul>", "metacritic": null, "released": "2017-04-24", "tba": false, "updated": "2019-08-28T22:14:31", "background_image": "https://media.rawg.io/media/screenshots/591/5916cf1a01ed79b2ca54d6f56c7c9d86.jpg", "website": "http://www.cir-cuit.com", "rating": 0.0, "rating_top": 3, "added_by_status": {"owned": 138, "beaten": 5, "toplay": 1}, "playtime": 1, "achievements_count": 6, "ratings_count": 5, "suggestions_count": 83, "game_series_count": 0, "reviews_count": 5, "platforms": ["PC"], "developers": ["Class-X Games"], "genres": ["Strategy", "Casual", "Indie"], "publishers": ["Class-X Games"], "esrb_rating": null}