{"id": 102823, "slug": "jawbreaker-itch", "name": "Jawbreaker (itch)", "name_original": "Jawbreaker (itch)", "description": "<p><strong>Overview</strong>:<br/></p>\n<p>Jawbreaker is a 2D arcade style beat em up. The rules are simple: get as high up the elevator as you can before meeting your fate at the hands of the enemies. Fight for the highest score!</p>\n<p>Jawbreaker can also be played with a buddy! Grab a friend and hit the elevator together as a team. Or, if you've got a score to settle, face off in Versus Mode!</p>\n<p><strong>Tips on Fighting:</strong></p>\n<p>As you fight, your special meter builds up. There are three sections of the special meter, each granting you a stronger attack. These attacks deal massive amounts of damage. </p>\n<p>When a special is used, the fighter will flash for a brief moment afterwards. This is the opponent's chance to do a counter attack. To execute a counter, simply hit the opponent while he's flashing. Counter attacks also deal massive damage, so if you're going to use a special, be careful you don't miss!</p>\n<p>-THIS GAME SUPPORTS GAMEPADS!-</p>\n<p><strong>***PLEASE LET ME KNOW IF YOU EXPERIENCE ANY ISSUES!***</strong></p>\n<p><strong>***I will do my best to fix any glitches or problems that are encountered!***</strong></p>\n<p>As always, thank you for playing! I really hope you enjoy this one; it's been in the works for a while. If you want to support me,  please consider checking out my patreon: https://www.patreon.com/JackBreen</p>", "metacritic": null, "released": "2017-12-18", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/7eb/7eb834968ba2393102ce86a664e4223d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 36, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["JackBreen_HG"], "genres": ["Action", "Fighting"], "publishers": [], "esrb_rating": null}