{"id": 102893, "slug": "cyclothymia", "name": "Cyclothymia", "name_original": "Cyclothymia", "description": "<p><strong>Connect the constellations, spin the planets, control the tides, affect your emotional phase. Explore your feelings. </strong></p><p>Instructions: Take your time to let things be figured out.</p><p>Cyclothymia is a narrative through astrological ties to emotional cycles. Its name comes is a mental health disorder - something I feel. It also brings out the juxtaposition of the medicalization of feelings and the super hippy-dippy new-age mode of understanding, as I jump between both. I worked with this idea of mental health, cycles, and astrology because I'm really into astrology and mental health. Not just conceptually but personally. I've found that looking at my own emotional phases through the lens of astrology has been really healing. I'm one of those classic emotional investigators - like if I feel a certain way, say happy and excited - I'm like, \"Why am I so happy? Should I be feeling this way? Are things in my life good enough to be warrant this feeling? am I too happy? Is this an episode?\" And that's really anxiety inducing for me. Astrology has a way for me to practice radical acceptance. \"I'm feeling so melancholic because the moon is in pisces. It will pass\" I also struggle, like many people with specific mood phases, with thinking that I will be stuck feeling the same way forever, I'll be this depressed forever, this crushed forever. But astrology again has been a great reminder that the world keeps on spinning, and all phases end and new ones begin, daily, weekly, monthly, yearly.</p><p><em>Created by Kara Stone</em></p><p><em>Programmed by Kevin Stone</em></p><p><em>Music by Halina Heron</em></p><p><em>- @karaastone - www.karastonesite.com -</em></p><p>From Amber Christensen, Curator of<em> There Should be Gardens</em> art exhibition.<em> </em></p><p><em>Kara Stone's videogame, \"Cyclothymia,\" speaks to the intuitive connections and affectivities of the links between humans and the cosmological. Whether these links are scientifically proven is irrelevant. The lack of human figure within the game heightens the sense of embodiment for the player, intensifying the psychophysical response. Within the gentle waves of music and delicate drawings of the game space, an affinity is found between mental health issues, emotional cycles, and the sun, moon, and stars. \"Cyclothymia\" provides a vessel through which mental health transcends the clinical to acknowledge that bodies share affectivities with worlds outside of the physiology of an individual's body. Stone writes in her artist statement that astrology has been a way for her to \"practice radical self acceptance.\" Emotions, feelings—even those that go unexpressed—float, settle and unsettle within the haptic space of \"Cyclothymia.\" Time is connected to something outside of the human realm, and an ease is found within these multiple temporalities of human and astrological time.<br/></em></p>", "metacritic": null, "released": "2015-04-28", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/9bb/9bbbe731cb45f1371b5fcbe855ec54a2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 33, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Kara Stone"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}