{"id": 102981, "slug": "cornershop-tycoon", "name": "Cornershop Tycoon", "name_original": "Cornershop Tycoon", "description": "<p>\r\n\tInspired by the likes of the Lemonade Stand Tycoon Series. Cornershop tycoon sees you inherit a small grocery store where you must regularly maintain your stock, keep your reputation high as you attempt to payback your loan and over time grow your store into a thriving tycoon.</p>Current Features<p>\n<strong><em>Stock Management </em></strong>- Buy, Sell and Manage your stock in your store. Keep an eye on your stock and make investments based on the various conditions to optimise profits and keep your store alive.\r\n</p><p>\n<strong><em><strong><em>Customers</em></strong> </em></strong>- Customers will visit your store each day expecting different items, be sure to have the items in stock to keep them happy and keep your store profitable.  Most customers will come looking for a specific item and will likely continue shopping if they find it!\r\n</p><p>\n<strong><em>Reputation - </em></strong>Keeping customers happy is important for your reputation. If you don't provide them with what they're looking for, you'll lose reputation and subsequently see a drop in customers each day.\r\n</p><p>\n<strong><em>Upgrades - </em></strong>Purchase new shelves, signs and even invest into building a car park to get the most out of your store and maximise your earning potential!\r\n</p><p>\n<strong><em>Weather - </em></strong>Daily Weather will affect your store's performance each day, be sure to keep an eye on it to understand the trends and save spending unnecessary cash that could be spent elsewhere!\n</p><p>\n<strong><em>Peak Times</em></strong> - Each day has a peak time where you can expect more customers and hopefully, more profits!</p><p>\r\n\tThe game was created in just under a week as a jam to see out the year, and as a creative exercise in Flat UI Design and simple, but enjoyable gameplay.\r\n</p><p>\r\n\tIt's feature complete, in regards to what I wanted to achieve for the time period, but as I continued developing it more and more ideas began to form. If people enjoy the game, I'd like to spend some more time with the game in the future to implement some of those ideas!\r\n\t<br/>\n</p><p>\n<strong>Post-Launch Feature Ideas:</strong>\n</p><ul>\n<li>Checkout System</li>\n<li>Staff</li>\n<li>Improved Customer</li>\n<li>Expiring Stock</li>\n<li>More Upgrades</li>\n<li>More Stock</li>\n<li>And more!</li>\n</ul><p>\r\n\tFeel free to download the game and give feedback. Hope you enjoy it and I wish you an awesome new year!\r\n</p>", "metacritic": null, "released": "2016-12-31", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/d96/d96119ec2e1b3c40d7b46fdb313c5cd8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 26, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Android"], "developers": ["Skatanic Studios"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}