{"id": 102960, "slug": "hockey-mania-c64", "name": "Hockey Mania (C64)", "name_original": "Hockey Mania (C64)", "description": "<p>Attention: can only be played with 2 (or more) players!<br/><br/></p><p>Hockey Mania is a sports game for two or four players. </p><p>Each player controls one Hockey field player. He can snatch the puck, and can knock against the opponent team's players.</p><p> In the 4 player mode, each team has 2 field players and a goalie, which is controlled by the computer. </p><p>The firing speed of the puck can be strengthened by longer pressing of the fire button. A bar line display within the lower border visualizes the procedure accordingly. The more strongly the shot, the more highly the risk of a miss becomes. The puck then soars, partly uncontrolled, over the heads of the players. </p><p>On the playing field coincidentally appear small yellow stars, which can be collected. Per round a player can get hold of maximally 9 pieces. After a third was played to end, the collected stars can be exchanged against upgrades of the player skills.</p><p> Available are: Higher maximum speed, faster turns and more grip on the ice. After everyone increased the skills of his player, steering itself is accordingly differently on the playfield. The Upgrades are important, in order to be superior of the opponent team.</p><p>The game uses the multicolor mode for menus and other graphics. The playing field was drawn in hires. Like already in Team Patrol, Glenn Rune Gallefoss was engaged again for the audio composition. He contributed 2 complete music pieces for the menus, 4 jingles for interruptions in the expiration of play (goals etc....), plus 19 (!!!) sound effects.</p>", "metacritic": null, "released": "2016-09-16", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/a80/a8010bc3aa89eb770b12b6225a5f3cf4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 153, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Protovision"], "genres": ["Sports"], "publishers": [], "esrb_rating": null}