{"id": 10306, "slug": "maximum-archery-the-game", "name": "Maximum Archery The Game", "name_original": "Maximum Archery The Game", "description": "<strong>Maximum Archery The Game is an Ultra-Realistic first person Bow Hunting simulation.</strong><br/><br/>Players must master hunting equipment and the elements just like you would in a real life buck hunt. The game is targeted for users who love to experience a challenging bow hunt for monster white tail deer.<br/><br/>The game includes 20 different episodes with an array of different weather and hunting conditions.<br/>You will hunt with the help of your special powers cameraman assistant, from ground blinds and tree stands, use various baits, decoys and real life hunting equipment to pursue your prey of monster bucks, bucks, does, turkey, raccoon and squirrel, under extreme conditions including snow, rain, wind, and fog.<br/>Successfully shooting your target requires you to track down your prey by following a blood trail to bag your kill and increase your score.<strong>Key Features</strong><ul><li> Ultra-Realistic Bow Hunting Experience.<br/></li><li> Hunt from both tree stands and ground blinds.<br/></li><li> Use Decoys, Baits and other real hunting Equipment.<br/></li><li> Hunt Does, Bucks, Turkeys, Raccoons and Squirrels.<br/></li><li> Pursue your prey under extreme conditions including snow, rain, wind and fog.</li></ul>", "metacritic": null, "released": "2016-10-14", "tba": false, "updated": "2019-08-28T22:14:30", "background_image": "https://media.rawg.io/media/screenshots/d38/d38f48d1eeef255ea6fb456e29ace40e.jpg", "website": "http://www.maximumarcherythegame.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 8}, "playtime": 5, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 255, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Max Apps"], "genres": ["Action", "Adventure", "Strategy", "Simulation", "Sports", "Casual", "Indie"], "publishers": ["Max Apps"], "esrb_rating": null}