{"id": 103018, "slug": "idol-goddess-made-captive-2017", "name": "Idol Goddess Made Captive 2017", "name_original": "Idol Goddess Made Captive 2017", "description": "<p>What would you do if you were kidnapped without warning and then given little to do but to fight for the entertainment of others? What if your kidnapper wanted to make you into an idol and marry you? And...  What if... your new life was better than your old one?</p>\n<p>Rock-paper-scissors type combat and a somewhat discreet tutorial mode (except the first battle) where you can experiment and see what works and when. The tutorial mode levels with you! After getting past the tutorial mode, you, the player, controls when the story progresses and which storyline progresses!</p>\n<p>Features over 32 sub-endings and 3 main endings! Hidden cheat mode! Super secret characters (less than 0.001% of players are expected to find them!) Maybe something happens if you find all the endings.</p>\n<p>Warning: A lot of clues are hidden within the dialogue. In particular, people seem to be missing the fact that Faerei hands you a book to read and later an NPC shows up that hints at using the book to change your class. Your room is another clue as it slowly changes.</p>\n<p>10 Playable Classes for your Main Character! (There are more classes than that, but most are for hidden characters).</p>\n<p>While the fastest endings can be reached in less than an hour, there are many endings that are more difficult to obtain!  Note, you can only start collecting bad ends once you've found a primary ending.</p>\n<p>There are many endings not available to the public, but maybe there is some secret method to find them? (Most will be made available to the public again, but the 'secret' endings will not as they are supposed to be 'what if' endings). Sorry I wasn't able to include all the endings. This was my first RPG Maker MV game and I was still learning the engine since I only gave myself 4 days to make the game.<br/></p>", "metacritic": null, "released": "2017-11-04", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/444/444e4437164ab73c925e35c03f5db56e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 98, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS"], "developers": ["AI Sin"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}