{"id": 103185, "slug": "tsa-frisky-demo", "name": "TSA Frisky DEMO", "name_original": "TSA Frisky DEMO", "description": "TSA Frisky is a VR game in which you play a TSA agent\r\n<p>managing lines, luggage, and leisure. Your goal is to clear all the passengers and their luggage without blacking out from stress. Helping you learn the ropes is your supervisor, who will point you to the tutorial slides, and let you know when you score points on the job. You will be scored based on your performance, and a global leader board is coming soon!</p>\n<p>This game began as a student project, and is now in full development with Out There Entertainment, a Savannah-based VR startup dedicated to playing with the ridiculous, and making people smile. Check out our website, social media pages, and even email us if you have any questions, concerns, or just want to find out more! Thank you for all of the amazing support, we will keep you all updated on future updates and possible release date of our game. </p>\n<p>Social Media:<br/>https://www.facebook.com/tsafrisky<br/>https://www.tsafrisky.com/</p>\n<p>Email:</p>\n<p>Contact@OutThereEnt.com</p>\n<p>How to Play:<br/>* Frisky passengers as they advance through the line. Use your tool belt to locate and irradiate contraband, and dispose of it in the red bin.<br/>* Search through each passengers luggage, and dispose of the contraband accordingly. Close suitcases when done before the timer runs out!<br/>* You must thoroughly search both the passenger and their luggage before the next pair advance.<br/>* Prevent travelers from taking their pesky contraband onto the planes.<br/>* Score points by being an effective employee, and earn the respect of your supervisor!</p>\n<p>Technology/Tools:<br/>Technology<br/>* Utilizing the HTC Vive and Steam VR on PC<br/>Tools<br/>* Game: Unreal Game Engine 4.18, Perforce<br/>* Art: Adobe Photoshop, Adobe Illustrator, Maya 2017, Headus UV Layout, Substance Painter<br/>* Sound: Avid Pro Tools, Soundminer, Unreal Game Engine 4.17, Audiokinetic Wwise</p>\n\n<p>Core team:<br/>Preston O'Bryan - Co-Founder - Audio Director / Environment Artist<br/>Christian Willet - Co-Founder - Programmer / Game Design<br/>Remy Bustani - Co-Founder - Concept Artist / Graphic Design / 3D</p>\n<p>External work (In no particular order)<br/>Ralph Roma - 3D Artist<br/>Neil Waters - 3D Artist<br/>Neal Krupa - 3D Artist<br/>Conner Burke - Animation<br/>Logan McClure - Code<br/>Kaushik Paddy - Code<br/>Reichal Min - Motion Media<br/>Peter Turner - Sound<br/>Jacob Henderson - Voice Acting<br/><br/><br/></p>\n\n\n<p>Special Thanks to the professors of the SCAD ITGM department and the original TSA Frisky team, without whom this game would never have come so far:</p>\n<p>Kaushik Paddy<br/>Victoria Law<br/>Alyssa Juarez<br/>Elissa Danese<br/>Kevin Achen<br/>Daniel Wright<br/>Christian Willet<br/>Preston O'Bryan</p>", "metacritic": null, "released": "2017-02-27", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/241/241c3940d8b78d8d2de20a5eb2166323.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 185, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["OutThereEntertainment"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}