{"id": 103188, "slug": "goop-legacy", "name": "Goop Legacy", "name_original": "Goop Legacy", "description": "The GOOPS are back in this game of pet-battling and inheritance! \r\n<p>Years have passed since the Goopoids were created and then set loose on the world. In that time humanity has learned to co-exist with these slimey, aggressive creatures. <em>SOME</em> humans have even begun taming Goops and training them in Goop-to-Goop combat. You are one of those humans.<br/></p>\n<p>Battle wild Goops with your trusty Goopling, find Mutagens to boost your Goop's powers, and then Mix your Goopling with other players' (Using Rumpus, our web tech) and Inherit their powers to form a long legacy of potent Goopoids. You may even uncover other Goop species in the process!</p>\r\nFEATURES:\r\n<ul><li>13 species of Goopoid, each with its own stat preferences</li><li>Clicker-like combat with TONS of stats</li><li>Mix your Goop with other players via Rumpus to create even more powerful goops, and uncover new species. Find other players in the Butterscotch Discord!</li><li>Learn which traits, behaviors, types, and genetics your Goop possesses to maximize its stats and your battle outcomes</li><li>An open, infinite world filled with dangerous Goopoids (and not much else)</li></ul>\n<p>This game takes place after the events of Do You Even Lift and  Goopidemic, two of our other jam games. It was made for the 2018 Butterscotch Shenanijam. Big shoutout to Visager for his fantastic open-source chip tunes, which filled out our soundtrack, and to Fatbard for soundfx! We drew the theme <strong>STICKY JUSTICE</strong>!<br/></p>\r\nAchievements:\r\n<ul><li><strong>Buttersmooth Tools </strong>- Use Inkscape and Gamemaker to make the game.</li></ul>", "metacritic": null, "released": "2018-06-11", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/606/606f6f4f9e3d34c14c3f2e45343e4e92.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 79, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Butterscotch Shenanigans"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}