{"id": 103136, "slug": "ecosim", "name": "EcoSim", "name_original": "EcoSim", "description": "<p>EcoSim is a simulator where you throw energy of various types into a pixel field, and then design cell types to live off of the energy. EcoSim features a <strong>closed energy system</strong>, meaning that energy is only added or removed when you left or right click. Cells consume energy, and when they move they release it again, usually in another form.<br/></p>\n<p><strong>EcoSim has very little in-game instructions.</strong> Most commands are done by pressing keys shown in capital letters on-screen.<br/></p>\n\n<p><strong>Simulation Rules:</strong><br/></p>\n<p><strong>Energy Types:</strong> Type 1 is red energy, called heat. It will spread across the pixel field and change color as it gets more concentrated, from red, to yellow, to white. Often it will be in such low concentrations that you can't even see it. Type 2 is yellow energy, called energy in my great naming skills. It is static. When there's too much of it in one pixel, the excess becomes type 1 energy. Type 2 energy randomly decays into type 1. Type 3 energy is the particle system. Unlike types 1 and 2, it exists in an on-off state, rather than in concentrations. You can design your own particle types (set their colors and rules) in-game.</p>\n<p>All three energy types can overlap each other. They inhabit separate pixel fields, one on top of the other.</p>\n<p><strong>Cells:</strong> Cells have a bunch of basic traits that you can set the parameters of in-game. Every cell consumes a certain energy type whenever there's any to eat under its body. Cells move in a random direction each frame (up, down, right, or left) and release energy of a certain type when they do.<br/></p>\n\n<p>I made this program in a week when I was <em>really, really</em> bored. Its status is \"cancelled\" because I made this years ago and don't even use Java anymore.</p>", "metacritic": null, "released": "2017-05-22", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/f8f/f8f16b41c8213dae109b54993c456fc6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 100, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["TheBlackMezek"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}