{"id": 103127, "slug": "wreck-arena", "name": "Wreck Arena", "name_original": "Wreck Arena", "description": "Wreck Arena is a physics based building/fighting game.<p>\r\n\tThe aim of the game is to build an efficient fighting machine and enter into tournaments to beat opponents. Machines can be built from a variety of interesting and functional parts, which can be stuck together however you see fit. The only limit is your imagination!\r\n</p>So what exactly can you do?<p>\r\n\tYou can pretty much do and build anything you want, but let's make a list, because who doesn't like lists?\r\n</p><ul>\n<li>Build and control a machine with 4 wheels</li>\n<li>Build and control a machine with 37 wheels</li>\n<li>Build something that resembles a futuristic lawn mower</li>\n<li>Fight with your creations against other machines in a free for all game mode</li>\n<li>Machines can use any number of weapon systems using any combination of;</li>\n<li>Pistons, motors, angle motors, blades, sledgehammers, sharp, pointy implements</li>\n<li>Players can design their own contraptions with servo parts, suspension, blocks, hinges and more</li>\n<li>Build your creations and share them with other players</li>\n</ul><p>That's roughly what you can achieve at the moment. New blocks are always being worked on. In the future there will be a fantastic selection of new and interesting blocks to use, new arenas with unique properties and gameplay, and a puzzle mode which will push players to use ingenuity to unlock new parts.</p>But what's next?<p>If all goes well, Wreck Arena will be released to Steam early access in a few months and a full release will happen some time in 2016. Before then, I'll be pushing a crowd funding campaign to keep development going and will continue updating the public demo until an adequate level of development has occurred (at which point the game will hopefully be available on Steam).</p>That's all cool, but what do I do?<p>Play the demo! If you like where the game is heading, drop by and say hi :) If you have feedback or suggestions, I'd love to hear it. Last but not least, spread the word. Tell your friends, tell your friends' friends. Tell that person across the street. And of course, check out the crowd funding campaign once it is set up. Thanks for looking.</p>", "metacritic": null, "released": "2015-08-29", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/7f3/7f3d1a6c7881b36fda68b9c0580ea12f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 99, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["MUCK GAMES"], "genres": ["Action", "Fighting", "Puzzle"], "publishers": [], "esrb_rating": null}