{"id": 103216, "slug": "solseris", "name": "Solseris", "name_original": "Solseris", "description": "<p>\n</p><p>\r\n\tSolseris is a game about matching blocks quickly to build combos and maximize the effects of special abilities. It features energetic original soundtracks and online leaderboads to track your scores versus your friends or the world!\r\n</p>Game Modes<p>\r\n\tEndless - Play through 8 levels of difficulty and compete for a high score!\r\n</p><p>\r\n\tTime Attack - Score as many points as you can in 1, 2, or 5 minutes. Choose one of the three difficulties and go for it!\r\n</p>Core Mechanics<p>\r\n\tRotation - Spin a group of four blocks clockwise or counter-clockwise using the mouse and keyboard.\r\n</p><p>\r\n\tMatching - Arrange matching blocks into sets of 2x2 or greater to score points and gain health.\r\n</p><p>\r\n\tCombos - Get matches quickly to build your combo and multiply the value of each match! The window of time between matches is adjusted based on the complexity of your last match.\r\n</p>Unique Mechanics<p>\r\n\tThe Vortex - Pull all blocks towards the center of the stage and complete any resulting matches. Achieving a match will spin the Vortex again, and each successive match is worth more than the last!<br/>\n</p><p>\r\n\tSupernova - The Supernova meter fills whenever you arrange a match. Clear all blocks of a single color or remove all hazards from the stage!\r\n</p><p>\r\n\tSingularities - These hazards drain your health and eventually explode, destroying blocks nearby.\r\n</p><p>\r\n\tHeat - Heat determines when Singularities will appear and how many can be present on the board at once. Heat is reduced by matches, it rises quickly at high difficulties!<br/>\n</p>", "metacritic": null, "released": "2015-02-22", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/00a/00ae97632ae2a709710b3384f4a4c53c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 110, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Tan Army Gaming"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}