{"id": 103215, "slug": "legend-of-moros-itch", "name": "Legend of Moros (itch)", "name_original": "Legend of Moros (itch)", "description": "<p>\r\n\tLegend of Moros is a retro-style RPG. While the combat is turn-based, there are a large number of differences that set this RPG apart from the rest. There are plenty of sidequests, a crafting system that uses parts from monsters, and an unusual twist on the standard combat formula.<br/>\n</p><p>\r\n\tMain Features:\r\n</p><ul>\n<li>Characters: There are over 12 characters that will join you on your journey. The main character does not have to be in the active party, which results in 1000+ potential party combinations!</li>\n<li>Storyline: A carefully written storyline that is equal parts dramatic and humorous. NPC's and sidequests help to increase the player's understanding of the world outside of the main quest.</li>\n<li>Original Assets: Custom animations, tilesets, music, and monsters help to set a unique tone and aesthetic for the world.</li>\n<li>Gameplay: A tactical combat system that rewards proper execution of both individual character tactics and the overall team strategy. Select one of three difficulty settings to choose from for this 30-40 hour adventure.</li>\n<li>Diversity: There is a wide variety of genders, skin tones, and disabilities that are represented in this game.</li>\n</ul><p>\r\n\t Sidequest driven: Apart from the main story, NPC's or objects may start a potential sidequest. The player is free to choose whether or not to take these missions, but there are rewards for them, as well as helping to learn about the other character's motivations. There is also no time limit for completing a sidequest, but certain sidequest bosses may grow stronger if you choose to progress through certain points of the main story.\r\n\t<br/>\n<br/>\r\n\t Equipment: Equipment has been simplified. As opposed to many separate pieces of armor and multiple hand slots, characters each have a few different and unique weapons that do most of the modifications to statistics. In many games, weapons get progressively better as you make progress. In Legend of Moros, there are always benefits and drawbacks. A weapon may have a high critical hit rate, but poor defenses, for example. You can also equip one weapon mod (to change your basic attack's element, or to give a chance for a status effect), one seal (which lets your character use a skill they otherwise couldn't), and two accessories (status resistance, extra attack power, health regeneration, and so on). \r\n\t<br/>\n<br/>\r\n\t Unique Combat: This game uses an unusual Stamina system. As opposed to games where spellcasters use MP and everyone else is just attacking, Stamina is consumed by a character whenever they use a skill or spell. \r\n\t<br/>\n<br/>\r\n\t But that's just using another name for a resource, and this is still a turn-based game. How is that different? \r\n\t<br/>\n<br/>\r\n\t Each character can set a certain Tactic; this allows them to gain Stamina whenever certain criteria are met. Which do you prefer: having your main healer regain Stamina whenever they heal someone, or whenever a party member takes damage? While each option covers multiple criteria (so you could have both of these), there are many different ways each character can be used. While RPGs have tended toward more of an action and reflexive skillset as time has gone on, I have tried to make this the epitomy of a strategy RPG.\r\n</p><p>\r\n\t There's a large and interesting cast of characters, and for the vast majority of the game, you can choose to have any four characters that you've found in the active party. If you don't like the main character, you can swap them out very early on. Also, at the beginning of the game, you are able to pick the difficulty you'd like to play on. (you can also press F1 on the keyboard to check/edit controls, if need be)\r\n</p><p>\r\n\tIf you have any issues or feedback, you can email me at cannibalinteractive@gmail.com.</p><p>\r\n\tThank you for your interest!\r\n</p><p>\n<strong>12/3/2016 Update:<br/>-Fixed an error where certain fights created black screens afterward<br/>-Party members not in combat gain 75% of Exp., instead of 50%.<br/>-There is now an item category for \"Directions\". When used, you will be told what direction the chosen town is from your current location.</strong></p><p>\r\n\tSystem Requirements:\r\n</p><p>\r\n\tProcessor: 1.6 GHz\r\n\t<br/>\r\n\tMemory: 2 GB RAM\r\n\t<br/>\r\n\tGraphics: 1024 x 768 pixels or higher desktop resolution\r\n\t<br/>\r\n\tHard Drive: 255 MB HD space\r\n</p>", "metacritic": null, "released": "2015-05-21", "tba": false, "updated": "2019-08-28T23:24:53", "background_image": "https://media.rawg.io/media/screenshots/673/673fc86c29b4f6955643971bbdfa834d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 92, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["CannibalInteractive"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}