{"id": 103227, "slug": "rosenturm-the-tower-of-eden", "name": "Rosenturm - The Tower of Eden", "name_original": "Rosenturm - The Tower of Eden", "description": "<p>In a world where the only liveable place is a little town kept secluded from the rest of the world, a man has decided to build a giant tower that may reach the \"Upper World\". However, he hasn't succeeded and is left for dead along with his son in the tower still under construction. <br/>A century later, a man named \"Hell\" wants to discover the truth about their disappearance and resume the construction of the tower.</p><p><strong>Disclaimer: This game was made with RPG Maker VX Ace and is actually pretty generic. Besides, it was done with royalty-free elements. That's why I want it to remain free, not to make money out of their work.</strong></p><p><strong>To make this game, I used the scripts of:<br/>- HimeWorks<br/>- YanFly<br/>- Saba Kan<br/>- Galv<br/>- Lemonheaded<br/>- Moghunter<br/>And the music from Incompetech (Kevin MacLeod.)</strong></p><p>The main goal of the game is to climb the tower and find the truth about Frederick E. Rosenstein and his son's disappearance. However, there will be another goal of freeing everyone caught in the tower. (I'm using future since that's what I haven't finished.)<br/> The player will do all that controling a shady character named \"Hell\" and ONLY him.</p><p>With approx. 20 people to save and the mystery to unravel by climbing the tower, I think the challenge should be present for the entirety of the game.<br/><br/> </p><p>First (the maid) introducing the \"Rescue Log\", helping to know how many people are still inside the tower. </p><p>Within these people to save, a lot of them may propose different services.<br/> For example, Linda who's the first person the player can save in the tower will buy some items ten times the shop will do.<br/><br/> </p><p>The player can also choose to give her items, instead of making her pay. It may help later in the game.<br/><br/> </p><p>The shop is a classic from RPG Maker, so I don't need to go further in explaining how it works.</p><p>Unlocking the Bataglia Trio may gain the player access to the inn and the restaurant as well as some intel about characters (Mia, the girl in the picture, will be the one giving intel.)</p><p>Karina is a sorceress mastering Buff, Debuff and Healing spells. She will teach Hell some of her spells in exchange of services (be it items or coins.) </p><p>Graham and Rhea are crafters able to enhance Hell's weapons and best armor. Still in exchange of coins, but another factor is needed: Fairy Dust (for weapons) and Fairy Drops (for the armor.)</p><p>When the player will set Miguel free, instead of reopening the Bounty Hunters' Association, he will be rebuilding it with Gregorio's help. The latter will propose to look for items in exchange of coins.</p><p>This is the bank held by Jacques. It's a classic system of Withdraw/Deposit and the player may deposit as much as he wants.</p><p> <br/></p><p>Liselotte (down) and Gambit (up) propose each a mini-game of hasard to gain either items (with Liselotte) or coins (with Gambit.)</p><p>Anyway, that's all for characters... for now.<br/> The player may also interact with jars and furnitures, which helps to gain free items or coins.</p><p>The player may also check some books and find some interesting ones. </p><p>Or check the underground alley for treasures.</p><p>As for the dungeon, most of the floors are randomly generated and are furnished with minimaps:</p><p>However, enemies can't be beaten in a rogue-like way: when the player touch them, it'll activate a classic J-RPG battle.</p><p>There are several ways to battle:<br/> - Attacking (the Normal Attack will change element according to Hell's weapon.)<br/> - Offensive spells (from six elements: Water, Fire, Wind, Ice, Earth, Lightning, and non-elemental spells.)<br/> - Defensive spells (Healing, Buff/Debuff...)<br/> - Guard (but the plyer can't win if he guards only.)<br/> - Items<br/> - Summons (Hell may summon three creatures.)<br/></p><p>Escaping a battle results of preventing the enemy from moving in the map for 1 to 6 turns, while winning kills the hindrance.<br/> Hell doesn't gain stats by leveling up, but gains stats after every victory (depending on the enemy.)<br/> For example, the player begin with Hell at 50MHP and 100MMP (125MMP if they let its equipment, but I'll take it raw for this example.)<br/> If the player kills a group of 2 slimes, Hell will gain 1MHP and 1 or 2MMP (depending on your luck)<br/> It means while Hell began with 50|100, after one battle against 2 slimes, he will either be at 51|101 or 51|102 (for ten battles against them and nothing else, it would be 60|110-120.)</p><p><strong><em>Enjoy the game.<br/></em></strong></p>", "metacritic": null, "released": "2016-02-21", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/f25/f25b543a30fb3f93c2e90deb4788f4cc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 19, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["KaiserKreuz"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}