{"id": 10335, "slug": "tales-runner", "name": "Tales Runner", "name_original": "Tales Runner", "description": "Tales Runner is a wonderfully bright and cheerful racing game that you can play with your friends! Set in a world where your favorite fairy tales come to life, challenge your friends and take some friendly competition to the next level. With multiple game modes, quests, and social features such as the community Plaza, Farm and chat, there is never a dull moment! Race through your favorite fairy tales from all over the world!Key Features<ul><li><strong>Co-Op Mode</strong>: Join with your guild members and friends and face terrifying boss monsters together! There are puzzles that you must work together and solve in order to advance to the next area. You must learn to work together!</li></ul><ul><li><strong>8-man or 20-man Modes</strong>: Play Tales Runner maps with up to 8 or 20 players at once! With item mode and crush mode enabled, it's sure to be one crazy time!</li></ul><ul><li><strong>Relay Mode</strong>: Race against other teams in this relay mode! Important thing is to work together with your teammates and pass the baton at just the right time.</li></ul><ul><li><strong>Animal Racing</strong>: Ride your pets and race against other players! Learn to drift your way through steep curves and emerge victorious!</li></ul><ul><li><strong>Item or No Item Mode</strong>: Want to race purely based on skills? Go for No Item mode! Want chaotic fun where you can use items to boost yourself and mess up other players? Go for the Item mode!</li></ul><ul><li><strong>Farm System</strong>: Decorate and build up your farm! Invite your friends over for a party or even an Animal racing or two at your farm. Help grow your friends' farms and receive farm points that you can spend to buy special items. </li></ul><ul><li><strong>Plaza</strong>: Meet your friends in the plaza and relax. Play mini-games in the minigame arcade, visit the Oracle for your fortunes and more!</li></ul><ul><li><strong>Customization</strong>: Hundreds of items are available for your characters! Customize the way your characters look and increase their stats to give you an edge in racing!</li></ul><ul><li><strong>Meeting System</strong>: Meet new players from all over the world with the built-in meeting system! </li></ul><ul><li><strong>Regular Updates</strong>: Tales Runner is updated once every 2 weeks! The game never gets old with new items, events, maps, and contents added constantly!</li></ul>", "metacritic": null, "released": "2015-02-17", "tba": false, "updated": "2022-09-29T23:55:32", "background_image": "https://media.rawg.io/media/screenshots/5af/5aff8173c59a7cca0bf0b80f9ef83355.jpg", "website": "http://tr.ogplanet.com/en/main.og", "rating": 2.0, "rating_top": 1, "added_by_status": {"yet": 6, "owned": 308, "beaten": 2, "dropped": 2}, "playtime": 1, "achievements_count": 15, "ratings_count": 6, "suggestions_count": 458, "game_series_count": 0, "reviews_count": 6, "platforms": ["PC"], "developers": ["Rhaon Entertainment"], "genres": ["Action", "Adventure", "Racing", "Casual"], "publishers": ["OGPlanet"], "esrb_rating": null}