{"id": 10334, "slug": "one-eyed-kutkh", "name": "One Eyed Kutkh", "name_original": "One Eyed Kutkh", "description": "One-Eye Kutkh - an exciting space adventure based on the fairy tales of the Far North.<br/>\n<br/>\r\nA single traveler on his way home crashes on a mysterious planet. To continue his journey, he'll have to get to the ninth heaven, deceive the Sun and the Moon and steal their space-boats.<br/>\n<br/>\r\nGame features<br/>\r\n- The unique graphic style<br/>\r\n- A mix of fiction and fairy tales of the Far North<br/>\r\n- Explore the World Tree<br/>\r\n- Two playable characters<br/>\r\n- The game tells its story through the action<br/>\r\n- Interesting and simple puzzles for everyone: from child to elder<br/>\n<br/>\r\nOne Eye Kutkh  is an experimental project, something in between video game, theatrical performance and an animated film. But most importantly, One-Eye Kutkh is a unique world filled with the atmosphere of the Northern myths. The challenge of the game lies not within obstacles that prevent the player from moving forward, but within the possibility to see the world through the eyes of his heroes.<br/>\n<br/>\r\nWe will be happy if you give our game an hour of your time and are grateful if you tell us about your impressions, good or bad.<br/>\n<br/>\n<br/>\r\nIf you liked \"One Eyed Kutkh\" and you'd like to support developers you can do that by buying DLC. Here's a list of what you'll get for purchasing it:<br/>\n<br/>\r\n- Two digital art books showcasing concept art (44 pages), in-game art (32 pages) and scans from design notebook (80 pages).<br/>\r\n- Original music soundtrack consists of 6 original and one bonus track, a total of 15 minutes.<br/>\r\n- Desktop backgrounds.", "metacritic": null, "released": "2017-03-30", "tba": false, "updated": "2023-09-07T07:50:18", "background_image": "https://media.rawg.io/media/screenshots/80b/80b2197b44ff375bb208e1943defc8c4.jpg", "website": "http://babayagagames.ru/oneeyedkutkh/en/", "rating": 3.0, "rating_top": 4, "added_by_status": {"yet": 7, "owned": 231, "beaten": 9, "toplay": 1}, "playtime": 1, "achievements_count": 42, "ratings_count": 12, "suggestions_count": 138, "game_series_count": 0, "reviews_count": 12, "platforms": ["Xbox One", "PS Vita", "Nintendo Switch", "macOS", "Linux", "PC"], "developers": ["Sometimes You", "Evgeniy Kolpakov t/a Sometimes You", "Baba Yaga Games"], "genres": ["Adventure", "Indie"], "publishers": ["Sometimes You", "Baba Yaga Games"], "esrb_rating": "Everyone"}