{"id": 10338, "slug": "gates-of-hell", "name": "Gates of Hell", "name_original": "Gates of Hell", "description": "<p>From the creators of Men of War, Gates of Hell arrives with unmatched immersion, hard boiled historical campaigns and massive dynamic multiplayer battles. GoH offers revamped infantry dynamics, accurate reworked ballistics and much more, including community requested features like redesigned flight model, combat improvements and expanded factions in its upgraded engine. Shift between RTS and Top-down Third person direct control modes and use the total destructibility of landscapes to revive the most intense portrayal of World War II.<br />\nGates of Hell is a historical/realism action-based RTS based on the powerful GEM2 game engine by Best Way.<br />\nGates of Hell aims to attract all fans of previous Men of War games. In addition, GoH has a much more comfortable learning curve, aiming to target newcomers to RTS games and also players from other RTS which seek a new experience. The time has come to experience the combat you&#39;ve always desired, tantalisingly recreated, no detail ignored. Passionately reinvented to give the most heart-rending portrayal of warfare to date. It will be bloody, it will be gritty, it will be war in the raw. You will experience the sensations you felt when watching and reading war films and books. Join us as we attempt to retell the stories of the Second World War, from both perspectives, of the victors and the vanquished. Now, only one question remains... Where does your loyalty lie?<br />\nIn Gates of Hell, the player will fight throughout WW2 battles, from the sands of North Africa to the snow covered peaks of Russia. In Early Access and until full release the action will be packed on the Eastern Front as the HD content for the game piles up. The player must use his skill plus the situation to defeat his enemy or complete mission objectives in spite of all odds that will arise. Weather the task is to snipe out an enemy officer, to destroy a tank column or fight against human rivals in the multiplayer game-modes, players must analyse the battle with their situational awareness and use the advantages of the nation they are playing, the terrain and their strategy. Whereas some players will prefer direct confrontation if they afford superior firepower, others might choose coordinated sabotage tactics. It is up to you to use historical warfare techniques to outsmart and outmanoeuvre the enemy!Features:Singleplayer and multiplayer support, including cooperative missions and PvP gamemodes.<br />\nHistorical battles with overhauled and optimised multiplayer: Versatile &amp; dynamic system to allow year setting option, extensive infantry types, and new vision ranges to create historical and tactical games.<br />\nModular Faction/Campaign system<br />\nIntegrated Steamworks<br />\nIncludes editor for modding, mission making and sandbox gameplay<br />\nHighly accurate human models, headgear, and weapons for an ultimate detail standard.<br />\nHeavily revamped infantry dynamics to allow for intense infantry combat as well as offering historical tools for trench/foxhole/pit/mine building depending on infantry proficiency.<br />\nSmart terrain, plus additional aerial and naval flight/sea models for vehicles of all sorts.<br />\nEnhanced graphics and colour palette for unparalleled atmosphere.<br />\nAstounding audio system with in depth live-recorded sounds, reverbs and echoes<br />\nOverhauled ballistics for each individual weapon to calculate penetration &amp; explosive values for different shell types, including composite rounds; as well as bullet drop and speed: A complete ballistics system.<br />\nAtmospheric 3D engine with smart, optimised AI and completely animated game objects.<br />\nFull destructibility of ground layer and objects, including burning parameters for flammable materials, flora, etc.<br />\nRealistic damage system for human objects and damage/repair system for vehicles&#39; components (No healthbars on vehicles!).<br />\nMod-friendly engine platform<br />\nHigh definition scenery including accurate soldier and vehicle models, spectacular FX, and detailed landscapes.<br />\nRTS and Third person top-down (direct control) shooter interchangeable gameplay modes for any unit, including vehicles and human entities.<br />\nFully modelled physics, including acceleration due to gravity, effects on ballistics, collision systems, penetration behaviour/normalisation for different shells, etc.<br />\nOver 250 vehicles, more than 100 weapons and 200 human model types to play with. (Roster plan for full release)<br />\nComplex AI which can assess the battle situation and unless ordered to hold ground, will advance or retreat depending on their morale</p>", "metacritic": null, "released": "2019-11-05", "tba": false, "updated": "2024-04-09T09:10:14", "background_image": "https://media.rawg.io/media/games/e40/e4036a98194944a20e7aef2c17b64b5c.jpg", "website": "", "rating": 4.25, "rating_top": 5, "added_by_status": {"yet": 8, "owned": 100, "beaten": 3, "toplay": 12, "dropped": 5, "playing": 3}, "playtime": 6, "achievements_count": 108, "ratings_count": 15, "suggestions_count": 563, "game_series_count": 0, "reviews_count": 16, "platforms": ["Nintendo Switch", "PC", "macOS", "Linux"], "developers": ["Super Icon", "Barbed Wire Studios"], "genres": ["Action", "Strategy", "Simulation", "Indie"], "publishers": ["Super Icon", "Best Way Soft"], "esrb_rating": "Mature"}