{"id": 10346, "slug": "fistful-of-frags", "name": "Fistful of Frags", "name_original": "Fistful of Frags", "description": "<p>Fistful of Frags is a western-themed modification created on the Source engine. This is the same engine that was used by Valve for their hits like Half-Life and Team Fortress 2. The game started as a Half-Life mode but was renewed and re-released in 2014. The name of the game is a pun on Sergio Leone&#39;s famous western movie A Fistful of Dollars.</p>\n<h3>Weapons</h3>\n<p>The game offers a variety of XIX century weapons. In Fistful of Frags, there are five weapon classes (melee, pistols, rifles, shotguns, and special) and several weapon tiers. The lowest tier is Starter Weapons, the ones the player gets when he or she spawns. There are Blue, Red, and Gold weapons that the player can find in the chests of the respective color. Different weapons allow different actions, such as dual wielding or throwing. There&#39;s a weight limit that doesn&#39;t allow the player to carry too many weapons at once. The way the player obtains the weapons strongly depends on the mode.</p>\n<h3>Game modes</h3>\n<p>Fistful of Frags includes multiple game modes, both single and multiplayer, cooperative and competitive. In the Team Shootout mode, the players are divided into 4 or 2 teams and eliminate each other trying to get the most frags. When spawning, the player can obtain additional weapons, spending his or her &quot;stars&quot;. Break Bad mode is similar, but the goal of each team is to gather more money. The guns are also purchased with the in-game money. There are also Versus, Elimination, Shootout, and Teamplay modes.</p>", "metacritic": null, "released": "2014-05-09", "tba": false, "updated": "2024-04-21T07:23:37", "background_image": "https://media.rawg.io/media/screenshots/d2d/d2da7735c7f8a2a765c4649a650e2c30.jpg", "website": "http://www.fistful-of-frags.com", "rating": 3.13, "rating_top": 4, "added_by_status": {"yet": 59, "owned": 2124, "beaten": 53, "toplay": 6, "dropped": 145, "playing": 11}, "playtime": 2, "achievements_count": 20, "ratings_count": 269, "suggestions_count": 487, "game_series_count": 0, "reviews_count": 270, "platforms": ["Linux", "macOS", "PC"], "developers": ["Fistful of Frags Team"], "genres": ["Action", "Indie"], "publishers": ["Fistful of Frags Team"], "esrb_rating": null}