{"id": 103460, "slug": "battery-powered-drift", "name": "Battery Powered Drift!", "name_original": "Battery Powered Drift!", "description": "<p><em><strong>Part drifting game, part eurobeat mixtape, all fun!</strong></em></p><p>Battery Powered Drift is the second game produced by the Eight Weeks, Four Games Jam (#8W4Gjam) initiative by <strong>Sylver's Edge</strong>.</p><p>Burn rubber across five different tracks in your battery powered Driftmobile! </p><p><strong>But be warned! </strong>Your Driftmobile continually loses power, so be sure to collect special Driftbatteries scattered all across the track, and try not to crash into the barrels or powerstrip walls which will drain your energy!<br/></p><p>Race around the track to get the fastest times while grooving to select eurobeat tracks from the likes of Odyssey, Ken Blast, Max Coveri, and more!</p><p><em><strong>Controls are listed in the Instructions section!</strong></em></p><p><strong>PROTIP:</strong><strong> My method of control combines both available control schemes, as delegating one hand to WASD (preferably W) and the other to the arrow keys (for turning and braking) will be a MUCH better experience. </strong><em>Good luck!</em></p><p>This game uses the Clay.io leaderboards API to facilitate lap time saving, so feel free to log into your account if you have one, or fill in a username of your choice to have your moniker on the boards.</p><p>Yes, these are global leaderboards, not just your personal best times! Do your best!</p><p>Unfortunately, with Clay.io seemingly revamping their SDK, the leaderboards are offline indefinitely. Most likely, a new version of BPD will be tweaked to use another leaderboard SDK - probably the Scirra Arcade's own.</p><p>Apologies for that!</p><p><em>Version 1.1 Changelog</em>: </p><ul><li>Removed all references to the Clay.io leaderboard framework, since it caused the game to freeze.</li></ul><p><strong>There's a bit of a bug with some tracks that causes the game to freeze. That will be fixed soon.</strong></p>", "metacritic": null, "released": "2015-03-23", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/439/439c4b6105bf9f2ede202850a2822a92.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 33, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Sylverstone Khandr + Sylver's Edge"], "genres": ["Sports", "Racing"], "publishers": [], "esrb_rating": null}