{"id": 103419, "slug": "ouranos-beset-by-frogs", "name": "OURANOS, BESET BY FROGS", "name_original": "OURANOS, BESET BY FROGS", "description": "<p>You are <strong>THE NIGHT SKY OF WHISPERING WINDS</strong>, a vast, alien sky deity! Across the dozens realms you exist in, your interest lies in one with a Giant Swamp, and in that swamp, a Crystal-Clear Pond where you have indulged your vanity for ages. But now, your Pond has been <strong>BESET! BY FROGS!</strong></p><p>hey there, i'm releasing a twine game that i've been talking about for a good while now! it's a nice weird text adventure with multiple endings i took up to get a hang of twine, as well as make a proof of concept of a big cosmic fantasy setting i've been world-building for a good while now!<br/></p><p>FEATURES:</p><li>4 distinct endings across 2 different story routes!</li><li>over 22k words of LORE and FROGGITUDE, all in an original story!</li><li>4 celestial ladies to advise and guide you in your dealings with the frogs! </li><li>Maggy, the Charming Old Grandma who works for a Catering Company, and goes Bowling with her Fellow Old Ladies on Fridays, is one of them!</li><li>a world that changes vastly around you based on your choices!</li><li>gay frogs!</li><li>an official pay-what-you-want price, meaning you can either pay for the low low price of free, or pay to help a struggling college student knock out their colossal tuition fee!<br/><br/>any and all downloads are deeply appreciated!  remember to check out the credits first to see the amazing friends who've helped me out a ton along the way, as well as receive a helpful pro tip that will vastly improve the gameplay experience!<br/></li><p>the first file is recommended for chrome users and is the full experience.  however it seems to glitch out a bit on other browsers, so if you're using another browser or don't want to mess with the images or something then the second is very much recommended!</p>", "metacritic": null, "released": "2016-09-15", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/4a8/4a8c47797170d32cad3d3c56987c1776.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 8, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["rexsc"], "genres": [], "publishers": [], "esrb_rating": null}