{"id": 10343, "slug": "overclocked-a-history-of-violence", "name": "Overclocked: A History of Violence", "name_original": "Overclocked: A History of Violence", "description": "Set against the backdrop of a catastrophic thunderstorm raging over New York City, Overclocked explores an archetypical, yet actual condition of mankind: violence. This psychological thriller mixes frightening fictional thriller elements using innovative narrative structures. Overclocked charts the diffuse areas where memories and illusions; dreams and reality; perpetrators and victims; collide.<br/><br/>Army psychiatrist, David McNamara, is called to the Staten Island Forensic Hospital in New York City to consult on a case that requires his expertise in forensic psychiatry. Tasked with exploring the minds of five young men and women who were found scared, screaming, and without memory, he makes alarming discoveries as he begins to cautiously explore the psyches of his young patients. Throughout the game, players will switch between six different characters in this chilling interactive psycho thriller.Key Features<ul><li>Experience Overclocked from various perspectives as you play as six different characters throughout the game<br/></li><li>Explore 45 diverse locations with densely animated pre-rendered settings<br/></li><li>Innovative storytelling techniques create a unique gameplay experience<br/></li><li>Meet and interact with a cast of intriguing characters, each with their own distinct personalities<br/></li><li>Characters come to life with fluid movements and realistic facial expressions created with Emotion FX 2 technology<br/></li><li>Cinematic cut-scenes designed using advanced camera techniques pioneered by feature films<br/></li><li>Exceptional visuals enhanced by shadow and shader effects, real-time atmospheric particle effects (rain, snow, lightening), and dynamic lighting<br/></li><li>Unique icon-based dialogue system</li></ul>", "metacritic": 70, "released": "2007-04-06", "tba": false, "updated": "2024-04-12T07:05:13", "background_image": "https://media.rawg.io/media/screenshots/03b/03b86a07509545b9de21dd956c16b8d6.jpg", "website": "", "rating": 3.24, "rating_top": 4, "added_by_status": {"yet": 8, "owned": 184, "beaten": 25, "toplay": 5, "dropped": 3, "playing": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 24, "suggestions_count": 262, "game_series_count": 0, "reviews_count": 25, "platforms": ["PC"], "developers": ["House of Tales"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["THQ Nordic"], "esrb_rating": null}