{"id": 103551, "slug": "eremidia-an-empty-tome", "name": "Eremidia: An Empty Tome", "name_original": "Eremidia: An Empty Tome", "description": "<p><strong>Introduction</strong></p>\n<p>This is a reboot of Eremidia: Dungeon!, which has been redirected after years of development. <br/></p>\n<p>Link to the old version: https://richter-h.itch.io/eremidia-dungeon<br/></p>\n<p>The storyline has drastically changed and the gameplay has been improved, yet I keep some aspects true to its former counterparts. <br/></p>\n<p>After months of reworks, the game has reached its first milestone and the alpha version has been available to be tested. <br/></p>\n<p><strong>Synopsis</strong></p>\n<p><em>The story revolves around the Scout who's been hired by the Queen of the soon-to-be-ended Kingdom. The mission is quite simple: search and rescue the missing King when he's embarking the expedition towards a mysterious island in the sky. The Scout then embarks the journey into the island with an Airship full of skillful crews and a Farsight Amulet in hand.</em><br/><em>Long story short, the Scout finds himself/herself stranded in an euclidean chambers<br/> in the middle of void which connects the inner part of the island and the outer world, called Void Rift. The Scout is not alone; he/she's in there along with the crewmates of former and latter Airships, yet the  King was alleged lost in the Rift. </em></p>\n<p><em>Along with the Guardian Duo--Richter and Theo, who were also part of the Airship crewmates--the Scout has to find the King and save him at all costs. Little they know the Rift has surprises for those brave and foolish enough to explore the seemingly endless masses of land in the middle of void, and even lesser they realize that the island hides such a threat to the Kingdom; it is called Herald of the World's End for reasons...</em></p>\n<p><strong>So, why with the Kingdom?</strong></p>\n<p>In this project, Eremidia Kingdom is simply called \"Kingdom\" intentionally; while it's still having connections with its former project, An Empty Tome is an independent story which is currently handled by me (richter_h). The whole story is all based on my insight and proposed concepts without direct intervention from the dispersed RPGMakerID community. Most of the contents are left intact; some are altered from their original concepts.</p>\n<p>Eremidia itself has been neglected for more than a year, and I have no intention to continue it after this project. That's why the story hints the  Kingdom will be ended when the story is concluded.</p>\n<p><strong>Features</strong></p>\n<ul><li>The story is now streamlined into rather linear, simplified story.\r\n</li><li>Control one of the Scouts with distinctive abilities. Yep, unlike the previous build, now the Scouts are taking part in battle.</li><li>Navigate through the Void Rift and find the connected places \r\nharbored around the emptiness, including the not-so-great Goldian Great \r\nLibrary\r\n</li><li>Randomized loot across the maps. Sometimes you might find common items, sometimes you might find artifacts inside a chest.</li><li>Event-based encounter. No random encounters, and for those who knows\r\n how to run, most of battles can be avoided by simply run away from the \r\nmishaps!\r\n</li><li>Grid Battle System; Fight various enemies along your way in the Rift\r\n in chess-like battlefield. In this case, everyone is a queen. Party \r\nplacements can be set in Formation menu.</li><li>Per-action EXP gain; no need to finish the battle to get them EXPs. Characters who deliver the killing blow gains more EXPs!\r\n</li><li>Various 'recruitable' characters with unique abilities, including \r\nthose who were NPCs like the chatty town guard Richter, Iris the sly \r\nAstral Witch, and even the cunning Theodoric armed with ropes and \r\ndagger. They'll be recorded into Companions Book once their recruitment \r\nconditions are met.</li><li>Separated level up system. Characters won't level up after battles; \r\nthey have to be manually level up via designated Level Up menu. Their \r\nskills are also can be upgraded. The upgrades cost EXP points.\r\n</li><li>Scout's choices will affect many things. Your deeds also will be \r\nmeasured with hidden Karma parameter which determines many things--from \r\nrewards given by quest givers, access to hidden places, to recruitment \r\nconditions for the recruitable characters along the story. Side stories \r\nand even main story will be affected by the Scout's choices\r\n</li><li>Scout's battle performance also will affect things like rewards, \r\naccess to hidden areas, up to some perks that accessible only by \r\nreaching some degree of skills.</li><li>Collect artifacts across the connected planes in the Rift, which \r\nwill be recorded in Tome of Artifacts. Those artifacts are beneficial in\r\n nature, but some artifacts have their drawbacks to the characters.\r\n</li><li>Record every enemies encountered across the Rift into Eremidiae \r\nBestiarium. Recorded enemies will tell the Scout everything about fought\r\n enemies.</li><li>Gacha, the notorious feature of many Japanese mobile games is also \r\npresent in An Empty Tome. Some artifacts may be appeared by gambling \r\nwith the RNG.\r\n</li><li>Planned: A growing headquarter. Sanctuary will be filled with many characters as the story goes on.</li><li>Planned: Multilanguage support</li></ul>", "metacritic": null, "released": "2017-12-02", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/6f5/6f557035796931d426dc9c53b3835d03.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 184, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["richter_h"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}