{"id": 103596, "slug": "everhunter", "name": "EverHunter", "name_original": "EverHunter", "description": "<p><strong>EverHunter</strong> is a Challenging Action Packed Rogue-like/Platformer game in which you play as an Experienced Hunter who has come to a Legendary cave looking for a Mythical treasure that Legends speak about. You will have to use your knowledge from previous runs, your reflexes, and Many Different types of Arrows to survive and go deeper into a Legendary Cave. Be careful tho, every time you play the Level's layout will be different, 4 Different zones contain new beautiful terrain and challenging enemies. Every 3 levels you'll have to face a new Ruthless and Unique Bosses.<br/></p><p>Hello everybody, we are happy to announce that we just started our Kickstarter Campaign, if you wish to see the full game released please support us or help us sharing it please!.</p><p>You can acces the KickStarter campaign here: http://kck.st/2mu9B6s<br/>or direct link here:<br/>https://www.kickstarter.com/projects/1863132689/everhunter</p><p>Cmo'n guys we can do this.</p><p>Also we are proud to announce Update #4 which comes with a lot of Extra polishing and Juicy effects. We hope you enjoy it.</p><p>This demo version contains 1 zone with 3 levels.<br/></p><p>The game is still in development and we need your support to get it fully released, soon we will be on kickstarter and greenlight.<br/></p><p>Contact and report bugs at: everhuntcontact@gmail.com</p><p>-Everhunt Team, Enjoy the hunt.<br/></p><p>All credits of the trailer to:<br/></p><p>https://twitter.com/Chocolatiergame</p>", "metacritic": null, "released": "2017-03-14", "tba": false, "updated": "2019-08-28T23:24:52", "background_image": "https://media.rawg.io/media/screenshots/e74/e741eb54acc02c18db5103af3f0277cd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 114, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["EverHunter Developer"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}