{"id": 1035, "slug": "galactic-phantasy-prelude", "name": "Galactic Phantasy Prelude", "name_original": "Galactic Phantasy Prelude", "description": "It is now FREE for a limited time! Don&amp;#39;t miss the chance and download it now!<br/><br/>Experience the life of a Space adventurer in this stunning action RPG. Build a fleet with 46 different spaceships of various classes from small frigates to giant battle cruisers; make them your very own with thousands of customization options; wander in an open world of the huge Universe; enjoy console quality graphics and immersive gameplay right on your palm.<br/><br/>official trailer: http://www.youtube.com/watch?v=rT1np76dyeA<br/><br/><br/>From Agile Frigates to Imposing Battlecruisers<br/><br/>Pilot 46 meticulously detailed spaceships of various classes such as the Frigate, Transport, Destroyer, Cruiser, Battleship and Battlecruiser. Each class of spaceships handles distinctively and has its own set of equipment. Customize each of your ships with various equipment types to align with your preferred battle tactics.<br/><br/>Innovative Full-Action Battle System<br/><br/>Take your fleet of spaceships into full action battles where reflexes and tactics are equally important. Customize your ships with 2000+ pieces of equipment in 20+ categories. Develop your own battle strategies; stun your enemies, drain their energy, or even take them all down with sophisticated range attack. Mind you, no one can hear you scream in space.<br/><br/>RPG-style open world gameplay<br/><br/>Roam freely and challenge various kinds of missions in 10 star systems, 40 starports and two nations with unique technology levels. <br/><br/>An Exciting Journey in Space<br/><br/>Experience an epic story in which you start your humble life with a stolen spaceship. You would do whatever it takes to stay alive in the world of pirates, be it robbing, trading, smuggling and battling. You would build your own fleet of spaceships, uncover the secrets of the Sphinx Empire and finally save your home country Galactic Union 20.<br/><br/>Optimized for iPHone 5&amp;#39;s 4-inch retina display<br/><br/>Enjoy super high quality graphics on various iOS devices. The game is highly optimized for the platform and it takes full advantage of the capabilities of the latest iOS devices. GPP on iPhone 5 even provides you the very best 16:9 gaming experience.<br/><br/>(On low-end devices like the iPod 4, it is recommended that you stop other memory intensive apps before running GPP to improve performance)", "metacritic": null, "released": "2012-10-29", "tba": false, "updated": "2019-10-22T14:27:37", "background_image": "https://media.rawg.io/media/screenshots/15b/15b0083491cc4755b0567f14fa824361.jpeg", "website": "http://www.moonfishsoftware.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 240, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Moonfish Software"], "genres": ["Adventure", "RPG"], "publishers": ["Moonfish Software"], "esrb_rating": "Teen"}