{"id": 103625, "slug": "castlon", "name": "Castlon", "name_original": "Castlon", "description": "Story.\r\n<p>Castlon, a story about a  princess, a smart, funny and intelligent princess, whose name is Beatrice. She has an happy life... until something happened. She started to have dreams? One where she  dies! Was that a dream or reality? Find out what is happening by playing through her counted days!</p>\n<p>This is a work in project, meaning that some parts of the story may change in the future. </p>\n<p>===============================================================<br/></p>\r\nGameplay.\r\n<p>An 2d adventure story telling  game, with a touch of horror elements (at least I tried...) fantasy and  some simple puzzles.</p>\n<p>===============================================================<br/></p>\r\nKey Features.\r\n<p><em>-Made on RPG Maker MV</em></p>\n<p>-4 Chapters! (The game will have 7 chapters on total, the free version has 3 Chapters, and I will not add more story on the free version.)</p>\n<p>-Post edited Maps! (After I made the maps on the RPG Maker, I toke some time an edited all the maps, adding my own style.)</p>\n<p>-Day Cycle! (The way I edited the maps, you will able to distinguish  if it is day/afternoon or night.)</p>\n<p>-Likeable Characters! (At least I do.... Maybe cause I am the creator?)</p>\n<p>-Featuring Music from Chelsea and Patrick de Arteaga (They have really cool musics).</p>\n<p>===============================================================<br/></p>\r\nWork in progress?\r\n\n<p>This is a work in progress game, meaning that it isn't complete. But what it's missing?</p>\n<p>What haven't I done? How long will it take to be finished?</p>\n<p>First off all, the game is missing 3 chapters, I haven't time to finish that, but I do have all of the story in mind. </p>\n<p>The game is also missing animations, I don't know how to make them, and I didn't had time to learn. But now I will learn, it will take some time. </p>\n<p> And the BIG ONE is..... portraits and backgrounds, the RPG Maker give us some portraits but I don't like them so, I will make my owns.... If I can, my skill on drawing isn't the best, BUT with a little time (something that I have now) I think I can do it. <br/></p>\n<p>Why backgounds? First, I think it will give some \"immersion\", and it looks cool on some scenarios, and secondly... I can give some bonus to those who donate or by the game. I do need to reward those people (at least thats how I think), and backgrounds are not a bad idea.</p>\n<p>I inted to be finished on the end off October. And it will be realesed on steam.</p>\n<p>===============================================================<br/></p>\r\nKnown Issue.\r\n<p>There is a annoying issue with the resolution of the game, not my fault though. The RPG Maker has a fixed resolution, with plugins or by messing with the code you can change the resolution.... I was able to change to 1248 x 720 , but if I increase more, the game will became blury, it also means in fullscrean to. I have a 900p monitor meaning it dosen't affect me as much, but those with 1080p or higher might be a pain to play in windowed mode. I will try to see if I can fix this. </p>\n<p>===============================================================<br/></p>\r\nWorking On.\r\n<p>For these next weeks I will be working on learning how to make animations and level up my drawing skill. Meaning these to following weeks the game might not be updated. If there are any errors/bugs I will fixed. I will post my progress.</p>\n<p>If you have any questions, ideas or problems, comment down bellow or send an email to castloncreator@gmail.com.<br/></p>", "metacritic": null, "released": "2018-04-23", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/ea9/ea93cf0664fc04504a4aeb31fc16219a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 93, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ranner"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}