{"id": 10366, "slug": "gloria-victis", "name": "Gloria Victis", "name_original": "Gloria Victis", "description": "Gloria Victis is a MMORPG with an emphasis on realism, set in a low-fantasy medieval open world. Enjoy skill-based non-target combat, open PVP with territory control, deep, expanded crafting system, player-driven economy and a mature, extensive storyline – all that served with beautiful, realistic graphics and immersive atmosphere.<br/> <br/>Choose one of two nations: proud Midlanders inhabiting vast green lands or vengeful Ismirs from the frosty North and join the conflict!<br/><br/><strong>FEATURES:</strong><br/><br/><strong>Non-Target Combat</strong> – Engage in action-based, non-target combat where your skills and tactics matter! Prove your skills and earn fame as an undefeatable duelist, eagle-eyed archer or respected commander inspiring your allies in battle!<br/><strong>Open PVP</strong> – Fight to the death in tournaments, towns and castles sieges and epic wars where entire armies collide!<br/><strong>Territory Control</strong> – Conquer the lands, siege non-instantiated towns and castles and develop fortifications to earn an advantage in the everlasting conflict of the realms!<br/>Innovative Partial Loot System – Defeated your enemy? Take your reward, selecting which specific items you would like to loot – but hurry, the clock is ticking!<br/><strong>Fame and Disgrace</strong> – Be a part of a living feudal society, establish your reputation and move up the feudal hierarchy, leading your allies to victory under your guild’s banner – or run and hide as an outlaw!<br/><strong>Complex Crafting System</strong> – Look for the best resources and materials, use crafting workstations and co-operate with others to increase your efficiency and achieve mastery in one of 8 different realistic crafts. The economy is in your hands – swords don’t drop from wolves but are forged by the blacksmiths!<br/><strong>Class-less Progression</strong> – Become who you want to be, shaping your character without artificial classes and fully customizing your equipment using hundreds of available items!<br/><strong>Open Living World</strong> – Seamless, breathtaking, challenging, dynamically reacting to your actions – the diversified and overwhelming world of Gloria Victis awaits you!<br/><strong>Low-fantasy Setting</strong> – Explore the lands based upon medieval Europe and Middle-East, discover ancient secrets, seek for forgotten treasures and face creatures designed after medieval tales!<br/><br/><strong>DISCLAIMER</strong><br/><br/>Please remember that the game is currently in alpha stage and you may experience some issues or some of the features may not be implemented yet. Read the \"Early Access\" section above for details!<br/>We are continuously improving and expanding all the described features according to the Community voice, while the others are under development or on our to-do list.<br/><br/>Features which will come with the future updates:<br/><br/><strong>Mounts</strong> – Tired of walking? Get on a horse, take your lance and charge the enemy – or prove your incomparable skills in mounted archery!<br/><strong>Full-scale Sieges</strong> – Rams, ballistae, trebuchets and catapults – medieval warfare in all its beauty and glory!<br/><strong>Sailing and Naval Combat</strong> – Build a cog to deliver goods to distant realms, lead your fleet in naval warfare or make your mark as a world-known corsair!<br/><strong>Housing</strong> – Build your own house, develop and decorate it – home sweet home!<br/><strong>Freedom and Immersion</strong> – Want to rest for a while? Enjoy numerous side-activities, such as fishing, gambling and the beer drinking contest!<br/><strong>Mature storyline</strong> – Choose one of three playable nations based upon the old powers from medieval Europe and the Middle-East – Midlanders, Ismirs and Azebs – and enjoy an epic adventure to discover their rich culture, history and an own beliefs system!<br/><br/><strong>We are currently hosting servers for following regions:</strong><br/>- West Europe<br/>- East Europe/Russia<br/>- North America<br/>- South America<br/>- Australia<br/>- South East Asia", "metacritic": null, "released": "2016-06-09", "tba": false, "updated": "2024-03-09T10:37:22", "background_image": "https://media.rawg.io/media/screenshots/cf3/cf3e36b3c8df46feca1829c1c29c91a6.jpg", "website": "http://www.gloriavictisgame.com", "rating": 3.0, "rating_top": 3, "added_by_status": {"yet": 29, "owned": 752, "beaten": 1, "toplay": 3, "dropped": 6}, "playtime": 6, "achievements_count": 87, "ratings_count": 20, "suggestions_count": 603, "game_series_count": 0, "reviews_count": 21, "platforms": ["PC"], "developers": ["Black Eye Games"], "genres": ["Action", "RPG", "Massively Multiplayer", "Indie"], "publishers": ["Black Eye Games"], "esrb_rating": null}