{"id": 103647, "slug": "incubus", "name": "INCUBUS (itch)", "name_original": "INCUBUS (itch)", "description": "<p><strong><em>READ ME PLS:</em></strong> </p><p><em>This is an <strong>ALPHA/DEMO</strong> of INCUBUS and <strong>not</strong> the full game. Certain elements have been removed for this release as it is more intended for us to gain feedback on core elements to help continue development. As it stands you will only be able to play the first level of the game's endless mode. Once you have completed the demo you will unlock an \"dev mode\" where you can mess around with level 30 weapons and more health. (*hint ;) find the portal) </em></p><p><strong>The bit about the game:</strong></p><p>Incubus is a randomly generated roguelike dungeon crawler first person shooter. You play a female intergalactic agent for WASA (Women's Aeronautics &amp; Space Administration) who has crash landed on an asteroid where you must fight to regain control of the now demon infested space station to defeat the <strong>INCUBUS</strong> threatening wo-mankind.</p><p> You'll have to trust us that the full game/story makes way more sense and is way less offensive than this bit makes it sound.</p><p>Currently there are 3 distinct enemy types, a procedurally generated dungeon, a weapon leveling system, as well as 3 guns each with distinct augments. <em>Pssst the shotguns augments are completely broken and a lot of fun atm...</em></p><p><em><strong>Do us a solid!</strong></em></p><p>If you come across any bugs/have any ideas please shoot them our way! There's only three of us and we don't have whole lot of experience of doing this sort of thing so we'd really appreciate it. </p><p><strong>You can reach us at:</strong></p><p>Twitter:    </p><p>Sam - Programming and \"art\"</p><p>Kieran - Programming and better art<br/></p><p>James - Programming<br/></p><p>Email: almostlunchgames@gmail.com</p><p><strong>We also have a website!</strong> (and most other social medias)</p><p>Almost Lunch web thing...<br/></p><p>Extremely active Instagram...<br/></p><p>I'm not even going to bother linking our facebook page... we don't really like him :/ </p>", "metacritic": null, "released": "2017-04-14", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/696/6965ccaf1fc06ba2738e48fbe44600da.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 45, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["AlmostLunch"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}