{"id": 103713, "slug": "battle-ops", "name": "Battle Ops", "name_original": "Battle Ops", "description": "<p><strong>Remember to donate us if you like our game :D</strong></p>\n<p><strong>Introduction:</strong></p>\n<p>“Battle Ops” is a multiplayer first-person shooter game developed by “Beyond Infinity Games”. “Battle Ops” is currently only available for Microsoft Windows. The game consists of two teams fighting each other to prove who is stronger. Tasks of both teams are to eliminate each other. Battle Ops also received a lot of positive feedbacks, when it was in in it’s Beta testing mode.</p>\n<p><strong>Weapons:</strong></p>\n<p>There are a large number of weapons made available in this game. Players can choose from a large range of weapons including Pistols, Machine guns, Semi-machine guns, Assault Rifles, Sniper Rifles, Shotguns, Grenades, etc</p>\n<p><strong>Game environment &amp; Maps:</strong></p>\n<p>Battle Ops consists of many different in-game environments and maps. There are different categories of maps including small, medium, and large maps. The game textures are very rich and there are different environments available like Rainy environment, Foggy environment, Sunny day environment. Players will also have the ability to choose from different day timings like Morning, Evening, or Night.</p>\n<ul><li>Hangar</li><li>Downtown</li><li>Dark City </li><li>Research </li><li>Village</li></ul>\n<p>More maps are expected to be added</p>\n<p><strong>Multiplayer:</strong></p>\n<p>The game will also consist of multiplayer option. Servers will be provided by “Beyond Infinity Games”. The players will only need to host a game. Players will also have the ability to choose number of slots for server as well as password protect the servers. The online multiplayer will be completely free from hackers; Now protected with AntiHack 4.0 specially made for Battle Ops.</p>\n<p><strong>System Requirements: </strong></p>\n<p>Processor: Core 2 Quad Q6600</p>\n<p>Memory: 4GB</p>\n<p>Hard Disk Space: 2gb</p>\n<p>Direct X Version: Direct X 11 (Can run on DX10)</p>", "metacritic": null, "released": "2017-08-10", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/6e3/6e3a6c64b194484ddc7316970d83342e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 428, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Beyond Infinity Games"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}