{"id": 10373, "slug": "genital-jousting", "name": "Genital Jousting", "name_original": "Genital Jousting", "description": "Genital Jousting is an online and local multiplayer party game about flaccid penises and wiggly anuses for up to eight players at once. Players control a detached penis complete with testicles and an anus. Multiple game modes provide a stimulating orgy of objectives: penetrate and be penetrated as fast as possible or compete in absurd, silly and sexually suggestive games and challenges.<br/><br/><strong>If this is something that makes you uncomfortable or sounds unappealing, please do not purchase or play Genital Jousting, or even continue reading. </strong><br/><strong>Online and Local Multiplayer for Eight:</strong> Genital Jousting is more fun with friends and can satisfy up to eight players at once! Find a few willing partners, cuddle up on the couch, and share controllers or go online to joust with anonymous players from all over the world.<br/><strong>Traditional and Party Modes:</strong> Dabble in the throbbingly fast-paced Traditional Mode or jostle your way through some stiff competition in Party Mode including challenges like Double Delight, Obstacle Intercourse, and Weiner Round Up. <br/><br/><strong>Customize Your Member:</strong> Genitals come in all shapes and sizes so pick your favorite color and decorate it with the most appealing outfit to customize a penis you can really get behind!", "metacritic": null, "released": "2016-11-17", "tba": false, "updated": "2024-04-06T12:08:23", "background_image": "https://media.rawg.io/media/screenshots/d7a/d7a839a667ded013ddb140437ca9b768.jpg", "website": "http://www.genitaljousting.com/", "rating": 3.75, "rating_top": 4, "added_by_status": {"yet": 42, "owned": 912, "beaten": 65, "toplay": 10, "dropped": 60, "playing": 11}, "playtime": 1, "achievements_count": 28, "ratings_count": 139, "suggestions_count": 119, "game_series_count": 0, "reviews_count": 142, "platforms": ["PC"], "developers": ["Free Lives"], "genres": ["Action", "Indie"], "publishers": ["Devolver Digital"], "esrb_rating": "Adults Only"}