{"id": 103890, "slug": "football-drama-itch", "name": "Football Drama (itch)", "name_original": "Football Drama (itch)", "description": "<p>You're Rocco Galliano, the existentially troubled manager of a struggling football team. Train players, <strong>choose your own narrative, survive the drama, and play turn-based football matches via tactical cards and hard choices.</strong> If you avoid the axe you could win the championship, understand what football really is, retire to the French Riviera, end up in jail, or who knows what else!</p>\n<p>In Football Drama you are Rocco Galliano, the Marseillaise new manager of Calchester Assembled Football Club.\r\nAfter the abrupt ending of your coaching career seven years ago, the hysterical attention of the press quickly faded. But struggling results by Calchester FC convinced Boris Aluminovitch, its billionaire president, to axe the previous beleaguered manager and give you a new chance.\r\nThis is the only football game where you may lose the championship and win the game!\r\nKey features of the game:\r\n</p>\n<ul><li>Interactive narrative with meaningful game-changing choices</li><li>Karma or chaos: life choices, game choices</li><li>Turn-based match play with live-action animations</li><li>18 dramatic weeks of procedural championship where you can be fired at any time</li><li>Deck-building mechanics determined by life choices and game results</li><li>Ridiculous cards about the craziest aspects of today's football</li><li>Deck-building mechanics determined by life choices and game results</li><li>Illustrated log of each of your matches</li><li>Silly main commentator with his obligatory colourful sidekick</li><li>Replayable - every championship is unique, several different endings</li><li>Nicely designed user interface by Pino Panzarella</li><li>Stunning illustrated cards and characters by Daniele Giardini \"Demigiant\"</li><li>Share your wins with friends and enemies</li></ul>", "metacritic": null, "released": "2018-07-20", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/d54/d54e156a2720cedfd8bc14927740695d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 241, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Open Lab Games"], "genres": ["Strategy", "Sports"], "publishers": [], "esrb_rating": null}