{"id": 10389, "slug": "gothic-ii-gold-edition", "name": "Gothic II: Gold Edition", "name_original": "Gothic II: Gold Edition", "description": "<p>The second game from the series Gothic.<br />\nIn the first game, people who inhabit a fantasy kingdom, lose the war to the orcs. To win, the king needs magical ore mined in local mines. The king decides to send to the mines everyone who is accused of any crime and create a magical Barrier around the mines so that no one can escape from the mines. However, Barrier surrounded a much larger area and the prisoners became masters inside the Barrier. Inside Barrier and beyond, there is a struggle for ore, power and the things necessary for life. In addition to the king, the magicians who built Barrier and various groups of convicts take part in the struggle. The hero of the first game is one of those who are sentenced to work in mines. He wants to become free, forced to carry out various assignments of the warring parties and seek a way out. He has to fight and solve other problems. The first game ends with the destruction of the Barrier. The second game begins two weeks after the end of the events of the first game. During the events, as it turned out, the hordes of magical creatures were awakened, this sets the plot of the second game.<br />\nFights in the game are near and far. For each type of battle there is a weapon. Stock inventory allows you to store any number of everything. In addition to the &quot;ordinary&quot; weapons, magical spells operate. The game allows you to turn into different animals. Becoming an animal, you can act and even fight - there are battle regimes for such cases. The Gold edition includes Gothic II and the addition Night of the Raven.</p>", "metacritic": 79, "released": "2010-01-13", "tba": false, "updated": "2024-01-19T12:48:10", "background_image": "https://media.rawg.io/media/games/5b7/5b7929040526f74f5e6073c06e7de902.jpg", "website": "http://www.piranha-bytes.com/gothic2", "rating": 4.41, "rating_top": 5, "added_by_status": {"yet": 187, "owned": 2440, "beaten": 335, "toplay": 48, "dropped": 70, "playing": 9}, "playtime": 1, "achievements_count": 0, "ratings_count": 430, "suggestions_count": 536, "game_series_count": 0, "reviews_count": 432, "platforms": ["PC"], "developers": ["Piranha Bytes"], "genres": ["Action", "RPG"], "publishers": ["THQ Nordic"], "esrb_rating": null}