{"id": 10386, "slug": "command-northern-inferno", "name": "Command: Northern Inferno", "name_original": "Command: Northern Inferno", "description": "<p>The year is 1975, the Cold War is omnipresent and beneath the veneer of détente the tension between the two superpowers irreversibly escalate towards the ultimate confrontation.<br />\nAs an at-sea &quot;accident&quot; results in the sinking of a Royal Navy frigate and the Warsaw Pact is mobilizing, events rapidly spiral out of control. The world is plunging towards another global conflict - but this time, there will be no post-war recovery, only nuclear disaster.<br />\nDo you have what it takes to stand up to Soviet/WP forces and avert Armageddon?<br />\nCommand: Northern Inferno is a stand-alone game that uses the latest version of the Command: Modern Air/Naval Operations (CMANO) engine. It also serves as a DLC for existing CMANO owners.<br />\nFor the first time after the release of the most realistic and accurate modern warfare simulation, the developer, Warfare Sims, has created a fully-fledged campaign expansion that encompasses 15 scenarios across one of the most thrilling and intense moments of recent history.<br />\nWhile the campaign is fictitious, every single part of this electrifying set of scenarios has been meticulously researched to deliver an entirely new experience to please both novice players and experts.<br />\nA full stand alone game, that expands the Command: Modern Air/Naval Operations franchise,  2013&#39;s Wargame of the Year, to a new theatre: play as a single, separate game, or add it to your collection of scenarios for CMANO<br />\n15 nail-biting campaign scenarios written by Paul A. Bridge, active Royal Navy officer and Falklands veteran: scenarios are introduced by historic videos, edited and voiced over to link scenarios and set the scene for the campaign progression<br />\n6 introductory tutorials: designed and built to teach you how to get into the game in an approachable and accessible way<br />\nAir, surface and underwater combat utilizing CMANO&#39;s highly-praised simulation engine: in a world on the verge of global conflict, every unit is key to success, but only by mastering joint operations, will contenders be able to achieve victory<br />\nConventional and nuclear operations: how far can the world go?  Will they use nuclear weapons?</p>", "metacritic": null, "released": "2015-10-22", "tba": false, "updated": "2022-01-10T17:17:50", "background_image": "https://media.rawg.io/media/games/b3a/b3aaabb00cc762a6531c24d418efbeb8.jpg", "website": "http://matrixgames.com/products/589/details/Command:.Northern.Inferno.", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 11, "beaten": 1, "playing": 1}, "playtime": 4, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 164, "game_series_count": 5, "reviews_count": 1, "platforms": ["PC"], "developers": ["WarfareSims"], "genres": ["Strategy", "Simulation"], "publishers": ["Slitherine"], "esrb_rating": null}