{"id": 103856, "slug": "assasseeds-crin", "name": "Assasseed's Crin", "name_original": "Assasseed's Crin", "description": "<p><em>Disclaimer: This game is not related to or endorsed by Ubisoft Entertainment. Ubisoft Entertainment is the owner of all copyright and trademark rights on Assassin’s Creed. Oddly Shaped Pixels does not claim any copyright or trademark right on the elements based on Ubisoft’s franchise “Assassin’s Creed”.</em></p>\n<p>\r\n\tHelp Altzio kill as many targets as possible in this small Assassin's Creed demake made for the Mini Ludum Dare #50.</p><p>\r\n\tObtain the Assasseed's Crin Gold trophy by eliminating 30 targets (Bronze:10, Silver:20).</p><p>Have a look here if you want to see how to achieve it : Gold Trophy Run</p><p>If you enjoy the game, don't hesitate to click the \"Support\" button and leave a coin, it's always welcome and it will motivate me to make more fun games!</p><p>Thank's!</p>Controls<p>\r\n\t- <left arrow=\"\">/<right arrow=\"\"> : Move Altzio</right></left></p><p>\r\n\t- <z> : Interact with people (kill them, mostly) when flashing white</z></p><p>\r\n\t- <a> : Interact with building/hay chariot/tower when flashing white + Jump from top of building</a></p><p>- <m> : Mute sounds and music</m></p><p>- <tab> : Remap your keys (from the main menu)</tab></p>Gameplay<p>\r\n\tYou play as Altzio, a not so famous assassin from Damascus hired to eliminate a quite consequent amount of targets.</p><ul>\n<li><em>Citizens</em></li></ul><p>\r\n\tYou have 10 seconds to eliminate your first target and then:</p><p>\r\n\t- killing a target will give you an extra 5 seconds</p><p>\r\n\t- killing an innocent bystander will remove 4 seconds</p><p>\r\n\tTo kill a citizen, just stand in front of or behind him and wait for him to flash white then press <z>.</z></p><p>\r\n\tDead citizen will (or not) give you a small amount that may come in handy to bribe a guard or two!</p><ul>\n<li><em>Guards</em></li></ul><p>\r\n\tThe guards in Damascus can be in one of these 3 states:</p><p>\r\n\t- RELAX: it's their default state, they will patrol in the city until they see a dead body on the floor</p><p>\r\n\t- ON ALERT: if a guard sees a dead body, he'll immediately start looking for Altzio in the whole level</p><p>\r\n\t- ON HUNT: if a guard on alert sees Altzio, he'll turn \"on hunt\" and chase him until he can capture him. To escape a guard on hunt, you can:</p><ul><li>hide in a hay chariot and wait for 1 second</li><li>become invisible by standing still 1 second,  if you have the \"Blend In\" ability</li><li>bribe him with 5$ if you have enough money</li></ul><ul>\n</ul><p>\r\n\tYou can only kill guards on \"Relax\" or \"Alert\" state and only from behind, unless you use the Hayssassinate ability, in which case the orientation doesn't matter.</p><ul>\n<li><em>A word on dead bodies</em></li></ul><p>\r\n\tEvery kill will leave a body on the ground. You have to be really careful as it's the dead bodies that make guards go on alert. Hayssassinate people won't leave any body on the ground.</p><p>\r\n\tA citizen dead body will disappear after 15 seconds.</p><p>\r\n\tA guard dead body will disappear after 40 seconds (metal plates are less biodegradable).</p>Altzio's abilities<p>\r\n\tFor each 5 targets eliminated, Altzio will gain a new special ability:</p><p>\r\n\t- 5 targets get you \"Blend in\" : stay still for one second and you'll go invisible to the guards (same effect as jumping into a hay chariot)</p><p>\r\n\t- 10 targets get you \"Hayssassinate\": when hiding inside a hay chariot, you can kill any close enough character without leaving a body by pressing <z> (you can't kill a guard on hunt though)</z></p><p>\r\n\t- 15 targets get you \"Towerjump\": you can climb on a tower by pressing repeatedly on <a> when standing near it. On top of a tower, you'll be able to designate a new target for each 2 seconds spent. Press <a> to jump from the tower top into a hay chariot. If when climbing you decide not to get to the top, press <a> with the <left arrow=\"\"> or <right arrow=\"\"> to immediately fall down</right></left></a></a></a></p>Credits<p>\r\n\tDesign/Code/Art/Music/Sounds : R3nD</p><p>\r\n\tPlaytester : Paula</p><p>\r\n\tI hope you enjoy this small game, it may seem a bit hard at the beginning but you'll rapidly improve, no doubt!</p><p>\r\n\tIf you have any comment about this game, you can do it here.</p><p>Any question you have, you can email me, contact me on Twitter or just visit my my blog.</p>", "metacritic": null, "released": "2014-04-07", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/caf/cafd5999d9d7598e9990aeeab6aa7e4a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 24, "game_series_count": 0, "reviews_count": 0, "platforms": [], "developers": ["Oddly Shaped Pixels"], "genres": ["Action"], "publishers": [], "esrb_rating": null}