{"id": 10385, "slug": "command-modern-air-naval-operations-woty", "name": "Command: Modern Air / Naval Operations WOTY", "name_original": "Command: Modern Air / Naval Operations WOTY", "description": "YOU ARE IN CONTROL<br />\nSurface fleets, submarine squadrons, air wings, land-based batteries and even satellite constellations are yours to direct as you see fit – from the lowliest pirate skiff to the mightiest aircraft carrier, from propeller biplanes to supersonic stealth fighters, and from WW2-era iron bombs, torpedoes &amp; mines and the trusty &quot;Mk1 Eyeball&quot; to ultra-modern radars with imaging capability, multi-spectral recon satellites, &quot;brilliant&quot; self-guided stand-off weapons, 200-knot supercavitating torpedoes and hypersonic anti-ship ballistic missiles. Every sensor and weapon system is modeled in meticulous detail. You are given the hardware; but you have to use it well.<br />\nTHE WORLD AT YOUR FINGERTIPS<br />\nThrow your distorted flat maps away – Command uses a realistic 3D earth globe for each of its scenarios. Rotate and zoom in and out of the action, from satellite view down to the trenches and wavetops. Play scenarios or build your own on any place on earth – from classics like the Middle East, South Atlantic, North Cape and Europe to new and rising hotspots like the Arctic, the Pacific and the Indian Ocean. Use a powerful yet intuitive point-and-click mouse interface for controlling your forces and go advanced with a wide collection of hotkeys for quickly jumping around the action and issuing complex orders in the heat of the battle.<br />\nRELENTLESS REALISM<br />\nSensors and weapons work just like in real life, with all their strengths and weaknesses. Units move, detect, fight and win or die based on what their systems can and cannot do. Electronic warfare and technological levels can tilt the balance of battle. The weather can be your best ally and your worst enemy. The terrain, both overland and undersea, can hide you from the enemy but also can block your weapons from firing. Your aircraft can choose different mission profiles and loadouts, each with its advantages and limitations, and can dash high (speed, range) or scream low (protection). Thermal layers, convergence zones, surface ducting, the deep sound channel and factors such as water temperature and terrain slope may decide the sub vs ship duel. Thick clouds or rain can render your fancy laser-guided bombs useless. Stealth may help you avoid detection, or a jamming barrage may tip the scales when you are out of options. Command’s battle environment is as unforgiving as the real thing – and as rewarding for those who understand and use it.<br />\nTHE MEN AT THE CONTROLS<br />\nYour war machines are (almost always) not robots; they are crewed by humans. People trained with varied proficiency (from novice to ace), operating under custom doctrine and rules of engagement (when to do what, how to decide, how to react etc.), most of the time making the rational decision, and sometimes making a brilliant call or a mistake. These people often matter far more than the hardware. The very same surface-to-air missile battery that is a worthless toy when staffed by Iraqi or Libyan crews turns to a deadly weapon even against ultra-modern aircraft under the expert hand of Egyptian, Serbian or Russian operators. The deadliest combat units are only as sharp as their crews.<br />\nAIR/NAVAL WARFARE AROUND THE WORLD<br />\nKorea. Colonial wars. Vietnam. Middle East. Cuba. Falklands. Iran-Iraq. World War 3. Desert Storm. India &amp; Pakistan. The Arctic circle. Past and future conflicts in the Pacific, Norwegian Sea, Russian periphery and more. Experience conflict from post-WW2 all the way to 2020+ and beyond. Test your mettle against lethal land-based missile batteries, air regiments, naval fleets or pirate groups. Face off against threats of the past, present and future. How do you measure up against the challenges of modern warfare?<br />\nLEAD, DON’T MICROMANAGE<br />\nRealistic modern combat with all its technicalities scaring you away? Your staff &amp; tactical AI sweat the details so you don’t have to. Airbase crews shuffle aircraft around on land facilities to prepare them for the next mission. Aircraft position themselves to deliver their payloads optimally, and refuel on their own if they have to; Ships and subs maneuver on their own to reach out and touch the enemy (including winding their way around islands, landmasses and even known mines) – and everyone tries very hard to save his skin when bullets are flying. Manage the big decisions and let your virtual crews get to the details – and still intervene whenever you want.<br />\nMAKE YOUR OWN WAR<br />\nThink you can build a better conflict? Prove it! Command’s integrated scenario editor offers unparalleled functionality for making your own scenarios or editing existing ones. Create and share with other players detailed, exact-down-to-the-meter land installations from all over the world – from airbases to port complexes to ICBM fields. Customize unit icons, sound effects, even platform weapons and sensors (Aegis on the USS Iowa – click and done). Create multiple sides with variable, complex alliances and postures and different proficiency ratings. Assign forces to detailed missions with custom behaviors and inheritable doctrines. Script complex interactive events with the advanced event editor. Assign variable success thresholds – from triumph to utter defeat. From a gunboat duel all the way to global thermonuclear warfare – the possibilities are endless.<br />\nHUNDREDS OF SCENARIOS<br />\nCommand MANO includes 42 scenarios (3 tutorials) and hundreds of community scenarios availableFEATURESPowerful, detailed 3D-globe (Google Earth-style) with multiple map layers<br />\nIntuitive, point-and-click user interface for beginners backed up by a vast array of hotkeys for power users<br />\nAircraft, surface ships, submarines, land units, strategic &amp; space forces and all their real-life sensors, weapons and other systems are at your disposal<br />\nExtensive, detailed simulation databases modeling faithfully the capabilities &amp; limitations of each unit<br />\nMore then 40 included scenarios covering multiple historic and hypothetical conflicts.<br />\nIntegrated scenario editor - make and share your own battles or modify existing scenarios<br />\nIntegrated database viewer - browse through the stats for every platform, sensor and weapon in the game<br />\nTremendous flexibility of scale: From counter-piracy skirmishes to strategic nuclear war<br />\nDetailed modeling of air (including near-space) and naval operations, both surface and underwater, supported by high-quality physics, sensor/EW, terrain and weather, weapon and damage models<br />\nFocused modeling of land-based forces relevant to air/naval/space operations<br />\nMine and mine-countermeasure operations<br />\nNuclear operations and other special-weapon categories<br />\nRecorder &amp; replay ability</p>", "metacritic": null, "released": "2014-09-26", "tba": false, "updated": "2021-06-25T11:27:50", "background_image": "https://media.rawg.io/media/games/38a/38afd22e8216f3bef8c932dcd93e7169.jpg", "website": "http://www.warfaresims.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 27, "toplay": 2, "dropped": 1, "playing": 1}, "playtime": 3, "achievements_count": 0, "ratings_count": 3, "suggestions_count": 307, "game_series_count": 5, "reviews_count": 3, "platforms": ["PC"], "developers": ["WarfareSims"], "genres": ["Strategy", "Simulation"], "publishers": ["Slitherine"], "esrb_rating": null}