{"id": 103864, "slug": "blooming-heights", "name": "Blooming Heights", "name_original": "Blooming Heights", "description": "<p>Blooming Heights is a game where you play as gardener on a floating island. A pretty careless gardener at that. The island itself is held toghether by a special crystal plant. However the plant dies one day, and being unprepared, you spend almost all of your money to buy a new sprout. It will take some time to regrow and island itself slowly starts to collapse.<br/></p>\n<p>Your task is to grow plants and sell them for profit while island around you collapses. Less space means less plants, less plants means less profit. In order to win you need to survive until the crystal plant grows fully. You can't fall off the island and you can't allow your house or crystal plant to collapse. Plants will yeld you shards, which can be used to purchase more seeds, as well as island repair kits (You can use those to bring back 1 tile). Be careful what you plant though. Some plants will affect your islands integrity which determines how often landfalls occur.<br/><br/>You will be required to manage space for plants as well as your money, so you can buy island repair kits and repair the damage. If the tile with plant gets removed, the plant is also gone. However tiles will only collapse if they are on the border of the island (Red grass colour). You can protect your house and plants by building around them. You lose if landfall occurs while either your house or your crystal plant is on the border or your character is standing on a tile that is about collapse. I recommend playing on easy difficulity first so you can get familliar with the plants and then move to normal or maybe even hard.</p>\n<p>Created for LD42</p>", "metacritic": null, "released": "2018-08-13", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/b52/b529cfa62e4855359642218d171679a5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 34, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["Jakupf"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}