{"id": 103978, "slug": "schwarzerblitz", "name": "Schwarzerblitz (itch)", "name_original": "Schwarzerblitz (itch)", "description": "Schwarzerblitz\r\n<p><em>\"Indie fighter Schwarzerblitz pays tribute to early ’90s 3D fighters\"  </em><em>- </em><strong>Shoryuken.com</strong></p>\n<p>\"<em>Schwarzerblitz Shows Love To Early Polygonal Fighters\"</em> - <strong>Siliconera</strong></p>\n<p><strong>Schwarzerblitz</strong> is an indie fighting game written in C++ and running on a custom version the <strong>Irrlicht graphic engine </strong>(find out more here!). The game is completely in English and supports both keyboard and joypad, though the second is <em>highly recommended</em>.</p>\r\nLet the Black Lightning strike!\r\n<p>It's 2064 and the world is not what we used to know. Fennoscandia has sunk deep into the ocean, half of Ireland is ridden by heamophages, nuclear power has been replaced by reality-distorsion-resonance (<em>RDR</em>) power plants and an alien planetoid has made first contact for more than fifty years,by now.<br/></p>\n<p>In 2063, a major accident shook the whole Europe: Euterpe, the Italian capitol city, was razed by an explosion of incredible power, followed by a storm of black lightnings. The accounts of the witnesses diverged and no light was shed on the real cause of the disaster.</p>\n<p>After a one-year manhunt, the Delta Team has finally found a consistent trail, which leads directly to a secret governative project known as <em>Schwarzerblitz</em>, \"the black lightning\"...</p>\n\r\nGame mechanics\r\n<p>- <strong>five button system</strong>: Guard, Punch, Kick, Tech and Trigger</p>\n<p>- <strong>fluid combo system</strong>: most attacks can chain into each other, leading to long combo strings</p>\n<p>- <strong>impact attacks</strong>: send your opponent flying with powerful blows - as the only way to send them out of the ring</p>\n<p>- <strong>trigger attacks</strong>: by using a <strong>bullet counter</strong>, one attack becomes guard-breaking and increases the hitstun, leading to easier combos and increased damage</p>\n<p>- <strong>trigger revenge / combo breaker</strong>: when comboed, you can use a <strong>bullet counter</strong> to cancel the hitstun and strike back against your opponent</p>\n\r\nMain features\r\n<p>- thirteen playable characters, with more to come (20+ characters are planned)</p>\n<p>- seventeen different stages with animated background elements and ring out mechanics</p>\n<p>- 8-way movement in a complete 3D environment</p>\n<p>- extended movelists for every character, listing every possible chain</p>\n<p>- varied soundtrack with different genres and tunes</p>\n<p>- moddable game engine (yes, you can add your own character, if you know how to use Blender!). A modding guide will be released after the alpha makes his way</p>\n<p>- controls can be freely remapped in-game. Both keyboard and joypads are supported.</p>\n<p>- a drunken shark-man</p>\n<p>- a politically incorrect robot</p>\n\r\nImportant notes (before you play)\r\n<p>- the game requires Microsoft <strong>Visual C++ 2013 redistributable (</strong>https://www.microsoft.com/it-it/download/details.a...). Be sure to download and install it before playing the game!</p>\n<p>- the game requires also Microsoft <strong>Directx9, 10 or 11</strong>. Directx12 is not supported. In case of doubt, download and install the Directx9 redistributable from this official link: https://www.microsoft.com/en-us/download/details.a...</p>\n<p>- for any questions not directly covered in the <strong>F.A.Q.</strong> below, please contact me as soon as reasonably possible!</p>\n<p>- the default controls via keyboard are <strong>C</strong> for selecting items,<strong> X </strong>for canceling a selection and <strong>Z</strong> to browse to the available costumes for the characters. You can remap this controls anytime from the <strong>Options Menu</strong>! See the quick reference guide for the in-game commands.</p>\n\r\nF.A.Q.\r\n<p><strong>Q: The game does not start. It says that [insert name here].dll is missing</strong></p>\n<p><strong>A:</strong> See the important notes above. Your computer probably misses one of the necessary Windows components.</p>\n<p><strong>Q: The game goes down to really low FPS on my laptop</strong></p>\n<p><strong>A:</strong> By default, Windows runs the game with the integrated graphic card. Try right clicking the .exe to start it with the dedicated graphic card. If this does not help, go into the game settings and lower the graphics settings (shadow quality, post-processing, etc.)</p>\n<p><strong>Q: Is there any known bug / issue?</strong></p>\n<p><strong>A:</strong> There is a known bug involving DirectX12. If you happen to have no view of the battle screen aside from the HUD while starting a match (i.e. black screen), dowload the <strong>DirectX9 Redistributable</strong> from Microsoft website (https://www.microsoft.com/en-us/download/details.a...) and install it on your PC. After this intervention, the game will run smoothly.</p>\n<p><strong>Q: Is there local any local multiplayer?</strong><br/></p>\n<p><strong>A:</strong> Yes, both with split-keyboard (very uncomfortable) or joypad + keyboard.</p>\n<p><strong>Q: What if my joypad has less than 12 buttons?</strong></p>\n<p><strong>A:</strong> If your joypad has less than 12 buttons but at least 8, please map every button after the first 7 to one button. This will let you play the game even if your joypad has less inputs available. Notice that you can map buttons even to the right analog stick horizontal and vertical axes. You need exactly 7 buttons to play smoothly: (P)unch, (K)ick, (T)ech, (G)uard, (Tr)igger, Start and Back. Any additional button can be used for hotkeys or simply assigned to the remaining slot.</p>\n<p><strong>Q: I can't take a screenshot with Print in fullscreen mode</strong></p>\n<p><strong>A:</strong> If you have Windows 10, use the command combination <strong>Win + Alt + Print</strong>. Otherwise, there's no obvious solution :/</p>\n<p><strong>Q: At some point, the game becomes irresponsive in windowed / borderless window mode</strong></p>\n<p><strong>A:</strong> The window lost focus. Just click on it with your mouse to activate it again.</p>\n<p><strong>Q: Will there be online multiplayer?</strong></p>\n<p><strong>A:</strong> It's not planned, at the moment. It strongly depends on how well the game is received, though.</p>\n<p><strong>Q: What about voice acting?</strong><br/></p>\n<p><strong>A: </strong>It's not planned until the game reaches his finishing touches. It would not make sense, at the moment.</p>\n\r\nEnd notes and remarks\r\n<p>This game has been inspired by the countless hours spent in the local arcade playing Tekken 2 and dozens of other fighting games. It draws influences from Street Fighter, Mortal Kombat, and Soul Calibur as well, some for the character design, some for the game mechanics.</p>\n<p>It's both a tribute to my passion for fighting games and the genuine realization of the dream of a (then) ten years old kid who was drawing these exact same characters on his school diary.</p>\n<p>And now that kid's quite happy with the result :)</p>\n<p><strong>P. S.</strong> a full list of credits is accessible in-game ;)</p>", "metacritic": null, "released": "2017-03-21", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/0d6/0d6d1aec8a894ceaff3d5be99cc79d53.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 145, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Andrea \"Jens\" Demetrio"], "genres": ["Action", "Fighting"], "publishers": [], "esrb_rating": null}