{"id": 104053, "slug": "burd", "name": "Burd", "name_original": "Burd", "description": "<p>Made in 2012 (I think), burd was an experiment with visuals and controls made in Gamemaker. I wanted to create a satisfying representation of flight. I'm not mainly a programmer, and (specifically from a coding standpoint) this is probably the most complex and nicest thing that I've ever made.</p><p><strong>Blue Peaches</strong><br/></p><p>Collecting all the Blue Peaches doesn't cause anything to happen!!! They are just to mildly encourage exploration.</p><p><strong>Explanation of the physics/controls:</strong></p><p>Burd flies essentially by jumping over and over, but the acceleration pattern encourages the player to take long, full wing-flaps rather than flapping very quickly. Moving left and right in the air causes the player to glide and fall slower. Diving causes the player to fall more quickly.</p><p><strong>Art Notes:</strong></p><p>I had a good time with the painting here. I noticed how well it worked to just mash loosely painted stuff together, and this has informed the art in Even the Ocean. I think there's only 1 cliff sprite in Burd that I just placed all over to create all the ground.<br/></p><p>I'm pretty proud of Burd itself, which was just a hand drawn animation and features a dynamic shadow so it looks different depending on where you are relative to the sun. There's a base layer then a shadow layer masked by the base layer, then the outlines. I think.</p><p><strong>Sound:</strong><br/></p><p>There's no music... try playing it with your fave relaxing music in the background?? Heh. I made the peach SFX in SFXr.</p>", "metacritic": null, "released": "2016-01-10", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/75e/75e6fb8c9894069f354e4762ef28995e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 68, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Marina Kittaka"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}