{"id": 10407, "slug": "aerea", "name": "AereA", "name_original": "AereA", "description": "The world needs you!<br/>AereA is a music themed Action RPG in which you play as one of Great Maestro Guido’s disciples and explore Aezir; a floating island that was broken into pieces. Your mission is to find and return the nine primordial instruments to restore balance and peace to the world. You have to find your way through all parts of the scattered islands; complete quests, solve puzzles, defeat bosses and discover the truth behind the islands. Will you be able to return the nine primordial instruments?<br/><br/><br/><br/>Play as Wolff the Harp-Archer, Jacques the Cello-Knight, Jules the Lute-Mage, Claude the Trumpet-Gunner, or team up with your friends in local co-op. Collect Music Sheets to learn new skills and customize your weapons to your play style.Features<br/><ul><li> Enjoy the beautifully hand-drawn music themed graphic style<br/></li><li> Experience the story to find out what happened to the floating island <br/></li><li> Play as 4 different characters, each with their own unique set of abilities<br/></li><li> Fight 9 unique bosses, inspired by a specific musical instruments <br/></li><li> Explore multiple islands with a wide variety of biomes, enemies and puzzles<br/></li><li> Switch to local co-op to form a team with up to 4 friends at any time<br/></li><li> Native 4K Support</li></ul>", "metacritic": 57, "released": "2017-06-02", "tba": false, "updated": "2023-12-25T21:46:24", "background_image": "https://media.rawg.io/media/screenshots/767/7677891557c8e3b1547848013ca8ea29.jpg", "website": "http://aerea-game.com/", "rating": 2.64, "rating_top": 3, "added_by_status": {"yet": 6, "owned": 59, "beaten": 2, "toplay": 1, "dropped": 4, "playing": 2}, "playtime": 5, "achievements_count": 75, "ratings_count": 14, "suggestions_count": 462, "game_series_count": 0, "reviews_count": 14, "platforms": ["PlayStation 4", "Xbox One", "Linux", "macOS", "PC"], "developers": ["SOEDESCO Publishing", "Triangle Studios"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["Soedesco"], "esrb_rating": null}