{"id": 10416, "slug": "darkwood", "name": "Darkwood", "name_original": "Darkwood", "description": "<p>PLEASE READ THE KNOWN ISSUES THREAD BEFORE BUYING<br />\nDarkwood provides a new perspective on survival horror.<br />\nScavenge and explore the rich, ever-changing free-roam world by day, then hunker down in your hideout and pray for the morning light.<br />\nSurvival horror from a top-down perspective that is terrifying to play.<br />\nNo hand holding or quest markers. Test your skills and figure things out on your own!<br />\nBy day explore the randomly generated, ever-sinister woods, scavenge for materials, craft weapons and discover new secrets.<br />\nBy night find shelter, barricade, set up traps and hide or defend yourself from the horrors that lurk in the dark.<br />\nGain skills and perks by extracting a strange essence from mutated fauna and flora and injecting it into your bloodstream. Watch out for unexpected consequences…<br />\nMake decisions that impact the world of Darkwood, its inhabitants and the story you experience.<br />\nMeet eerie characters, learn their stories and decide their fate. And remember - don’t trust anyone.<br />\nAs nights go by, the lines between reality and nightmarish fantasies begin to blur. Are you ready to step into Darkwood?</p>", "metacritic": 78, "released": "2017-08-17", "tba": false, "updated": "2024-04-07T01:34:54", "background_image": "https://media.rawg.io/media/games/341/3415bdd0f19cb034574e559f2ff163ab.jpg", "website": "http://www.darkwoodgame.com", "rating": 3.78, "rating_top": 4, "added_by_status": {"yet": 190, "owned": 1946, "beaten": 87, "toplay": 97, "dropped": 126, "playing": 29}, "playtime": 2, "achievements_count": 19, "ratings_count": 234, "suggestions_count": 178, "game_series_count": 0, "reviews_count": 236, "platforms": ["Xbox One", "Nintendo Switch", "PlayStation 4", "PC", "macOS", "Linux"], "developers": ["Crunching Koalas", "Acid Wizard"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["Crunching Koalas", "Acid Wizard Studio"], "esrb_rating": "Mature"}