{"id": 10410, "slug": "wildlife-park", "name": "Wildlife Park", "name_original": "Wildlife Park", "description": "<p>Here is your chance to create a giant and beautiful zoo. A park so amazing, it would be impossible to build in real life. In Wildlife Park you must build an animal park from scratch, managing it so your visitors will spend their money. You begin with just the park area, a ticket booth, and some money. From there you can buy animals, build the zoo, hire employees, and then open the gates and let the visitors come.<br />\nFeatures:<br />\n• 45 detailed, seamlessly animated and simulated species ranging from mammals and reptiles to birds and marine animals<br />\n• Fascinating, challenging, and realistic animal behavior in areas such as reproduction, socialization, aging, birth, aggression, and &quot;trainability&quot;<br />\n• Animals can be trained with a huge variety of interaction devices such as trampolines, ropes, slides, trees, and video screens<br />\n• Aside from the 20 missions there are (potential) zoo locations around the world awaiting the player to master zoo management under these different preconditions.<br />\n• Choose a variety of terrains with different climates, environmental sounds, and music themes to start your park in. But be careful in your choices in climates and animals, as keeping a polar bear happy in the Sahara is an incredible challenge!<br />\n• No single goal to reach the finish of the game. The park has to be managed well to gain access to new areas, attractions, and more importantly, exotic animals<br />\n• No-limits landscaping at various heights, many plants, bridge constructions, ponds, rivers and waterfalls, and buildings<br />\n• 10 professions for your personnel to care for the animals and park: Feeder, Garbage, Zookeeper, Animal Catcher, Gardener, Scoutmaster, Vet, Worker, Animal Trainer, First-Aid<br />\n• Great athmosphere wirht realistic sounds and corresponding music themes.<br />\n• Building architecture style differs by climate<br />\n• Transparent walls give visitors a better view of marine animals, allowing you to build underwater observation rooms</p>", "metacritic": null, "released": "2003-05-01", "tba": false, "updated": "2020-03-20T09:31:13", "background_image": "https://media.rawg.io/media/screenshots/b61/b6171b7b896474c5c0c36eb6ba749554.jpg", "website": "http://www.b-alive.de", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 4, "owned": 8, "beaten": 1, "toplay": 2, "dropped": 3}, "playtime": 3, "achievements_count": 44, "ratings_count": 2, "suggestions_count": 534, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC", "macOS"], "developers": ["b-Alive"], "genres": ["Strategy", "Simulation", "Casual", "Indie"], "publishers": ["b-alive"], "esrb_rating": null}