{"id": 104177, "slug": "in-delinquency-discipline-and-disorder", "name": "in Delinquency, Discipline, and Disorder", "name_original": "in Delinquency, Discipline, and Disorder", "description": "<p><em>Instead of Spending Summer in My Home Country, I Decided to Study Abroad,  Now I'm the Student Council President of This Foreign School!</em><br/></p>\n<p><strong>SYNOPSIS</strong><br/>\n</p>\n<p><strong>Wanting to leave a mark on her beloved school, Elisa decides to take matters into her own hands.</strong><br/></p>\n<p><em>in Delinquency, Discipline, and Disorder</em> is the story of one Elisa Augustine, a high school senior, as she tries to manage schoolmates and the studentry's activities. \"Studies first, romance later.\" has become her motto of sorts, but that doesn't mean she won't have romance as well, after all, she's expected to live longer than her classmates and be better than everyone else.<br/></p>\n<p><strong>CHARACTERS</strong>\n</p>\n\r\nActually just 6 main characters. Angelika and Heiko play supporting roles.<br/>\n<ul><li><strong>Elisa Augustine</strong> - The protagonist of this game. Elisa is a 8th generation sprite-human hybrid, meaning she has more magic in her than a normal human. She also lives thrice as much. Elly, as her friends call her, is a quite but sociable character but she's rather vulgar when it comes to some things.</li><li><strong>Francesca Jenna Helminen</strong> - Elisa's best friend. She does her best to support Elly in their mutual quest of running the student body in the darkest of times.</li><li><strong>Stefania Justina Moretti </strong>- A two-time winterover, meaning she has forsaken the sunnier side of things for one of solitude. A rather introverted character to a stranger, but her friends would say otherwise. She is the captain of the fencing club.</li><li><strong>Angelo Testarossa - </strong>Elisa's classmate since 1st year. An annoying chap who likes to pretend he's Casanova. Notoriously known among female students as someone who asks for dates but gets rejected most of the time. He is Stefania's childhood friend.</li><li><strong>Mike Godfrey</strong> - Mike is a man of few words. He prefers to let his fists do the talking, well not until Francesca told her to stop or he would be deported right away. Despite his rough past, Mike enjoys the arts, as such is the only wintering member of the art club.</li><li><strong>Erich Staedtler - </strong>The bookworm. Erich is a calm and collected individual. He is rarely seen among his peers, preferring instead to hole up in the library. He's very interested in history and will talk about it when a chance presents itself.</li><li><strong>Heiko Ayanami</strong> - Elisa and company's homeroom adviser, and the acting principal. She is very friendly and almost motherly towards her students.</li></ul>\n<p><strong>SETTING</strong><br/></p>\n<p>The game is set in the 22nd Century, but in an alternative universe version of Earth. The story specifically takes place in Winter, in a city called Concordia, at the Auditore 8th Academy.</p>\n<p><strong>FEATURES</strong></p>\n<p>The current demos present a word count of 40,000 and features the old battle system (a modified Jake's Battle Engine for Ren'Py, two iterations) and the hand painted backgrounds. </p>\n<p>The final game is expected to have a 90,000 word count, the in-progress club management features, <strong>a</strong><strong>nd vastly improved and consistent art.</strong></p>\n<p><strong>UPDATE</strong><br/></p>\n\r\nFrom Left to Right: Clara, Aletta, Meilin, Helma, Alexandrie, Claire, Natasha, Sumire. Mass Produced Kouhais And Cuties<br/>\n<p>We opened the past alpha builds for downloads again. Click away, download and play, and maybe wail about this game. Whatever your impression is, do not hesitate to comment about any feedback you might have. We are entering a new phase of production. Stay tuned for more updates. <br/></p>\n<p>Sorry to say though, some of the girls are not in the earlier builds. </p>\n<p>We also have an indieDB page where we occasionally dump updates. Please visit and follow us by clicking the link below. </p>\n<p>\n</p>", "metacritic": null, "released": "2015-01-28", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/c89/c895d8a7f1063c813b3c132c03ad0823.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 190, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Circle Cosine"], "genres": [], "publishers": [], "esrb_rating": null}