{"id": 104142, "slug": "mad-snowboarding-itch", "name": "Mad Snowboarding (itch)", "name_original": "Mad Snowboarding (itch)", "description": "<p>\r\nMad Snowboarding - a crazy open world snowboard game. Reach the finish and make as many tricks as possible on your way down the mountain. Choose your individual path to the finish through the snowy mountain landscapes of the game. Mad Snowboarding has a built-in level editor, which allows you to create own levels and share them with the community. This way there are always new levels to explore. Fight for daily worldwide highscores or challenge up to four of your friends to play simultaneously either with or against you in the split screen mode!\r\n</p><ul>\n<li> open world </li>\n<li> various tricks </li>\n<li> built-in level editor </li>\n<li> 4 player split screen </li>\n<li> highscores, replays &amp; ghosts </li>\n<li> 5 characters </li>\n<li> future Oculus Rift support</li>\n</ul><p>Mad Snowboarding's community is strong and has created more than 500 levels with the built-in level editor.</p><p>No headset can give that good feeling of playing together with your friends in the same room! Also, since SSX, Coolboarders and 1080 Snowboarding there was no good split-screen snowboarding game. Therefore, we thought it was time to revive the split-screen snowboarding again :)</p><p>p.s.: in contrast to all other stores below this version has no ads and no in app purchases. You can unlock all characters by playing the game.<br/></p>", "metacritic": null, "released": "2015-07-29", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/484/4849aa142f2636d98372be19e98e1b24.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 250, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Denis Lapiner"], "genres": ["Sports"], "publishers": [], "esrb_rating": null}