{"id": 10418, "slug": "battle-for-orion-2", "name": "Battle for Orion 2", "name_original": "Battle for Orion 2", "description": "Earth has been destroyed. Mankind is fractured. The galaxy is at war. But one hope remains: a new home for mankind. Probes detected a habitable planet in the Orion sector. You must fight your way to it, but nothing is as it seems. A more devious plan is underway that threatens the entire galaxy.<br/><br/>Since the destruction of Earth, not a single habitable planet has been found. Millions of long range probes have been sent out to find a suitable home for mankind. For now, man lives in spacecraft and orbital modules around uninhabitable planets. Over centuries of expansion, factions and galactic corporations have laid claim to the galaxy. When a habitable planet was discovered, the galaxy erupted in war. <br/><br/>Suddenly, you wake up after hundreds of years in stasis. A mysterious AI created by the Terranovus Initiative delivers your mission, and you embark on an epic conquest across the galaxy. Collect advanced technology, grow your empire, conquer foes in massive battles, ally with powerful rivals, and discover the ultimate weapon that threatens every system in the galaxy.Features<ul><li>Galactic domination meets real time strategy<br/></li><li>Battle through 24 story missions that will challenge and engage you<br/></li><li>Conquer star systems to expand your empire and control of the galaxy<br/></li><li>Construct orbital modules around planets to improve your economy, military, and research<br/></li><li>Mine asteroids, space debris, and moons for resources<br/></li><li>Build over a dozen unique ships including capitol ships with advanced abilities<br/></li><li>Collect powerful technology to strengthen your fleet, economy, and defenses<br/></li><li>Build massive superweapons powered by stars<br/></li><li>Randomly generate endless maps with the Battle Simulator<br/></li><li>Create your own galaxy and publish maps for other players to enjoy with the built in Map Editor</li></ul>", "metacritic": null, "released": "2017-03-23", "tba": false, "updated": "2019-08-28T22:14:26", "background_image": "https://media.rawg.io/media/screenshots/d9f/d9fd1c7f97959a5b86b2ad286b886f9f.jpg", "website": "http://infloopgames.com/battle-for-orion-2/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 47}, "playtime": 3, "achievements_count": 50, "ratings_count": 0, "suggestions_count": 184, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC", "Linux"], "developers": ["Infinite Loop Games"], "genres": ["Strategy", "Indie"], "publishers": ["Infinite Loop Games"], "esrb_rating": null}