{"id": 10419, "slug": "subnautica", "name": "Subnautica", "name_original": "Subnautica", "description": "<p>Subnautica is a first-person game about survival in the deep sea. You control Ryley Robinson, a space traveler in the 22nd century, who crash-landed his starship on a planet that is covered almost entirely by the ocean. The protagonist needs to eat and drink, although this can be disabled in lower difficulty modes. He can desalinate oceanic water, catch or gather the seafood, and create useful tools and structures. Unlike many survival games, Subnautica has a detailed plot, in which Ryley has to uncover why his ship crashed. By exploring the ocean, finding the remnants of other crashes, and listening to the radio messages, Robinson will learn about the enormous Leviathan, the mysterious Precursors, and the reason why this planet is quarantined.<br />\nThe game is famous for its spectacular portrayal of the ocean and its wildlife. Robinson is equipped with a scuba diving gear that allows the player to spend most of the game underwater, although oxygen still has to be replenished. The player can dive deep and explore the world full of corals, fish, and other colorful sea creatures, often grotesque or bio-luminescent. The environment is randomly generated to improve replayability.</p>", "metacritic": 83, "released": "2018-01-23", "tba": false, "updated": "2024-04-13T17:18:29", "background_image": "https://media.rawg.io/media/games/739/73990e3ec9f43a9e8ecafe207fa4f368.jpg", "website": "http://unknownworlds.com/subnautica", "rating": 4.24, "rating_top": 5, "added_by_status": {"yet": 489, "owned": 4101, "beaten": 773, "toplay": 415, "dropped": 657, "playing": 164}, "playtime": 10, "achievements_count": 22, "ratings_count": 1385, "suggestions_count": 863, "game_series_count": 1, "reviews_count": 1409, "platforms": ["PlayStation 4", "Xbox Series S/X", "PC", "macOS", "Nintendo Switch", "Xbox One", "PlayStation 5"], "developers": ["Unknown Worlds Entertainment"], "genres": ["Adventure", "Indie"], "publishers": ["Unknown Worlds Entertainment"], "esrb_rating": "Everyone 10+"}