{"id": 104125, "slug": "himawaris-garden", "name": "Himawari's Garden", "name_original": "Himawari's Garden", "description": "Himawari's Garden\r\n<p><em>Bloom the world</em></p>\n<p>You're Himawari, a descendant of the clan of the gardening witches. You have been entrusted an important mission by the Forest King: go down the mountain, meet the forest' inhabitants and bring to life the garden of their dreams.</p>\n<p>You have the power to create all kinds of plants, fungi and trees* which will grow, reproduce, expand and decay all on their own. It will be your job to determine which kind of vegetation each one of the forest people needs. </p>\n<p>Every plant possesses its own characteristics which impact how it grows, how often it reproduces and the pattern of its expansion on the field. Feel free to experiment different combinations to your heart's content. Plant some seeds around you (by clicking with the left mouse button) and watch as they grow in real time. Try out some other seed, sit back, and witness the beautiful garden expanding before your eyes.</p>\n<p>If you complete all the quests in this very short demo, you may get a glimpse at the truth of what happened to the forest and to your clan, and the reason why <em>you</em> were chosen by the Forest King.</p>\n<p><strong>Controls:</strong><br/></p>\n<ul><li><strong>WASD </strong>- Movement</li><li><strong>Shift - </strong>Sprint</li><li><strong>Left Mouse Click - </strong>Plant seed (only when the on-screen cursor is green)</li><li><strong>X </strong>- Talk to the NPCs</li><li><strong>Tab</strong> - Toggle the Plant Info menu</li><li><strong>P, ESC - </strong>Pause</li></ul>\n<p>*what you see here is only a fraction of the plants planned for the full game.</p>\r\nWho made it:\r\n<p><strong>Ludomyth</strong> - Game Design and Programming<br/></p>\n<p><strong>Squaredev </strong>- Art and Game Design</p>\n<p><strong>Roby </strong>- Cover illustration</p>\n<p><strong>Boyful </strong>- Music<br/></p>\n<p><strong><em>Please note that this is a very early demo of the game, made mostly to test the validity of the game's base concept and mechanics. Therefore there may be bugs, glitches and other kinds of issues. If you run into any problem, do let us know in the comment. </em></strong></p>\n<p><strong><em>Feedback of any kind is greatly appreciated!<br/></em></strong></p>", "metacritic": null, "released": "2018-03-03", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/60a/60a020a1ce870154ae8fe78839513853.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 44, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["SquareDev", "ludomyth"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}