{"id": 104255, "slug": "cho-am", "name": "Cho-Am", "name_original": "Cho-Am", "description": "<p>Visit the cremation site of Pol Pot as a sleepwalker.  Interpret the world your character is inhabiting by their gestures and brief glimpses inside their head.</p>\n<p>This game does not have an ending until you decide to leave.  Game time is connected to the current real time in Cambodia.</p>\n<p>The real life cremation site of Pol Pot in Cho-Am* is a place of contradictory spiritual and political significance.  As a \"good-luck\" shrine, offerings are continuously left by visitors who hope to have assistance in their prayers from a main architect of the Cambodian auto-genocide.  One of these visitors, a Thai businessman, constructed a hand-made spirit house at the site as thanks for Pol Pot appearing in a dream to him and giving him winning lottery numbers.</p>\n<p>This is a way of dealing with the memory and presence of someone responsible for pain and destruction that is outside of the realm of forgiveness and punishment.<br/></p>\n<p>The site itself, across from a casino in a small town on the border with Thailand, in the region of Anlong Veng (a previous base of the Khmer Rouge), has very little aside from a tin roof covering a mound of dirt where Pol Pot's ashes used to be, a burn bin, a couple of spirit houses, and a hut near the entrance where a guard (the wife of a former Khmer Rouge general) sits and takes admission payment.  It is an otherwise empty area with a powerful history.</p>\n<p>Much of the experience of the site takes place in one's head.</p>\n<p>\"The actions themselves are recognizable, familiar, and affecting, but alien . . . .\" - Daniel Fries, Kill Screen<br/></p>\n<p>\"The chilled out tone and ethereal texture of the game suggest a certain degree of pensiveness and maybe even transcendence. [ . . . It] captures some complex and not altogether noble feelings evoked by engaging with historical trauma of this magnitude. It's difficult to wrap one's head around, and feels far away, and yet there's the lingering phantom of something terrible just out of view.\" - Lana Polansky, Sufficiently Human</p>\n<p>Selected for <em>Games and Playful Media Exhibition</em> at A MAZE. / Johannesburg 2016 and <em>Signification</em> exhibit<em> </em>at A1LabArts in Knoxville, TN.</p>\n<p>* Normally transliterated as Choam, this less common spelling helps with pronunciation.  Also CHOAM appears to be thing in the world of Dune.</p>", "metacritic": null, "released": "2016-02-12", "tba": false, "updated": "2019-03-20T00:22:50", "background_image": "https://media.rawg.io/media/screenshots/08a/08aa7ed2765a8addc3b9546274470a79.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 104, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "macOS", "Linux"], "developers": ["AaronOldenburg"], "genres": [], "publishers": [], "esrb_rating": null}