{"id": 104278, "slug": "dark-system-alpha", "name": "Dark System Alpha", "name_original": "Dark System Alpha", "description": "<p>Note: Dark System is now in closed beta so the alpha is no longer receiving updates. Please feel free to continue enjoying the alpha and providing any feedback you might have.<br/></p><p>Dark System is completely free while in alpha. I'm trying to get as much feedback as I can, so please try it out and let me know your thoughts. You can reach out to darkstonegamestudios@gmail.com, or post on the steam group or in the Discord:</p>\n<p>http://steamcommunity.com/groups/DarkSystemAlpha</p>\n<p>https://discord.gg/ZC9wVeU<br/></p>\n<p>Early Alpha for Dark System, a physics-based top down space shooter RPG in an open galaxy.</p>\n<ul><li>Fast, fun, physics-based combat with intuitive controls.</li><li>Explore the galaxy! Find rare and powerful new ships, weapons, shields, power cores, and engines to use in a procedurally generated galaxy.</li><li>75 different ships to pilot and fight against.</li><li>Weapons and equipment that manipulate gravity, slow time, create wormholes, and steal energy from enemy ships!</li><li>Modular weapon system that allows any weapon to have different properties added to it, like adding extra projectiles, and increasing fire rate.</li><li>Battle different alien factions, each with their own strengths, weaknesses, and unique equipment.</li><li>Organic trading system that you can manipulate to create very profitable trading routes.</li></ul>\n\n<p>Dark System will be $10 on release, so now is a good time to check it out for free!</p>\n<p>Feedback is extremely important to us, so please leave any thoughts you have on the game in the forums here, or in the Steam group:</p>\n<p>Dark System Alpha Group<br/></p>\n<p> Thank you!</p>\n\n<p>If you like the game be sure to give us a way to give you updates, either through the Steam group, Twitter, or our newsletter, which you can find below:</p>\n<p>Twitter</p>\n<p>Darkstone Studios Newsletter</p>", "metacritic": null, "released": "2017-04-09", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/c70/c7023655a8012a78d4fd0e929fbc21ba.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 96, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["DarkstoneStudios"], "genres": ["Action"], "publishers": [], "esrb_rating": null}