{"id": 104245, "slug": "ookibloks-itch", "name": "Ookibloks (itch)", "name_original": "Ookibloks (itch)", "description": "<p><strong>Available Now on Windows and Mac OS X!</strong><br/></p><p><strong>Purchase includes Steam key!</strong><br/></p><p>Cunning crabs have absconded with Ooki's banana stash!<br/></p><p>What's an honest monkey to do in a situation like that? </p><p>Get even, of course! </p><p>Ookibloks combines the spirit of classic action puzzlers with a bright visual style and an ultra-catchy soundtrack. In this game you help Ooki the Monkey collect all his stolen bananas while avoiding enemies like crabs, ghosts, piranhas and the all-powerful Devil Cat.</p><p>Featuring:</p><ul><li>100+ stages of fruit flinging, badguy bashing monkey mayhem!</li><li>9 different worlds! Each featuring 10 stages, it's own unique funky soundtrack and challenging boss character to beat!</li><li>Jam melodies over the music as you play with the awesome musical sound effect system! It's never the same twice!</li><li>Train up on your skills in \"Banana Chase\" mode, an endless game play variation to get the highest combo!</li><li>Super tough challenge stages via the Devil Cat's Volcano - for hardcore players or players looking for a real challenge!</li><li>Enjoy the game ad-free and with NO in-app purchases!</li><li>Play the game how you like with support for multiple resolutions and control via keyboard, mouse, and Xbox 360 controller!</li><li>Includes Original Soundtrack so you can jam to Ookibloks anywhere!</li></ul>", "metacritic": null, "released": "2015-09-24", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/3e3/3e304977594f602f8af12f9ab537b7bb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 220, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Skyboy Games"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}