{"id": 104343, "slug": "plus-adventure", "name": "Plus Adventure", "name_original": "Plus Adventure", "description": "plus adventure\r\n<p>the BNHA RPG project! fantasy AU feat. dungeon crawling , turn-based battle, and visual-novel style story. free, currently developing Chapter 1!</p>\n<p>===</p>\r\nvery first PROOF OF CONCEPT prototype!\r\n<p>in this version, we show you our quest structure, random dungeon crawling, and battle! it's only been 11 days since the announcement of this project! thanks to the 100+ people who have joined us , especially our artists, writers, composers, game designers, and MVPs, you know who you are!</p>\n<p>===</p>\r\nit's team effort, get involved through Discord! \r\n<p>totally open. DM me on discord melissa#6127 for an invite, or dig out the link on the project's (work in progress) tumblr.</p>\n<p>thanks corsev, naina, kazehita, chara, and mistake for the little portraits used in this version! can't wait to get everyone's work incorporated!</p>\n<p>thanks bruno for the hometown (the first scene) and dungeon music! thanks nokisoup for the battle music! thanks iroz for the sword room (very last scene) music!</p>\n<p><strong>HOW TO PLAY:</strong> for right now, it's all click-based! click around to travel to different locations, talk, etc. first, take a few quests from the quest board, the grassy rectangle in the first scene.</p>\n<p><strong>NOTE TO MAC USERS:</strong> if it says you can't play because you've downloaded this from the internet, go to your security settings and say open anyway.</p>\n<p>very first prototype. sorry for spelling errors, and artifacts of debugging. it's in its ugly duckling stage!</p>", "metacritic": null, "released": "2018-08-19", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/2f5/2f50e1df0c1e29cc6c1e31c222fc0766.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 114, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS"], "developers": ["Melissa Ran"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}