{"id": 104355, "slug": "silverquest-gaiden-2", "name": "SilverQuest Gaiden", "name_original": "SilverQuest Gaiden", "description": "<p>\n<strong>Current Release</strong> — <em>Alpha 12</em></p><p>\n</p><p>\r\n\tSilverQuest: Gaiden is retro dungeon crawling at it's best. FM Synth sounds and music bring you deep into a world of dungeon exploration where each game is a new experience! All art, music, items, enemies … \r\n\t<em>everything </em>is exposed outside of the game, meaning anyone can add, remove or change anything in the game. Add color, release your own mod-pack, anything! Mod-packs are officially supported, and can be downloaded on our Desura page when they are available. </p><p>Thank you for waiting so long for Alpha 12! The next update will release in the next week.</p><p>These same easy methods for us to make changes and add new content are also available to you. Currently, Monster and Item data as well as graphics are located in a folder called \"\r\n\t<strong>xData</strong>\" anyone can access this folder, add new monsters or items. Please bear in mind some of the functionality listed in the XML files is not yet implemented. Please be patient for these features.<br/></p><p>\r\n\tIt will be possible to upload your own xData Packages on Desura and Moddb. We're excited to see what you come up with.</p><p>We plan on having 90% of the game in a state where anyone from a hobbyist modder to the first time gamer interested in how games work will be able to change parameters in game and see how things function.</p>", "metacritic": null, "released": "2014-02-13", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/3ea/3ea70e95e81390a48791bf7ba6dd57b0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 11, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Wolfgame"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}