{"id": 104325, "slug": "drift-racing-mania", "name": "Drift Racing Mania", "name_original": "Drift Racing Mania", "description": "<p>Drift Racing Mania is just the beginning of an era of non-stop drift racing, where you go full throttle with nitro and dive into this fever of drifting. </p>\n<p>Get ready to drive high-performance cars and make them drift at high speed in tracks designed specifically for drift racing.<br/>Drift Points grow proportionally to drift angle, drift time and speed. If points reach every multiple of 100 again, Drift Combo is increased by 1 again. This works only if you keep drifting without too long interruptions between one drift and the other (less than 1 second), otherwise Drift Combo multiplier will be reset to 1.<br/>Proximity multiplier is increased when you drift with the back of the car near a wall (less than 1.5 meters) proportionally to closeness. You'll notice this bonus with a slow motion effect and a text showing the multiplier factor. If you hit anything you'll lose your partial points and all multipliers.<br/>Drift Racing Mania game represents a corollary of drift based racing games, more precisely they are a drift technique’s based on a car’s steering ability to achieve sideway movement.<br/>Be an expert and Furious Drift racer, perform drifting and burnouts. Real Drifting is combined with stunning visuals and high-fidelity graphics.</p>\n<p>Start drifting through the challenging tracks full of obstacles and bonuses of Drift Race and try to win the level and earn some money. <br/>Improve your racing and drifting skills and earn virtual money to buy new exotic cars.<br/>Get ready for the most Realistic and Exciting Drift Experience on Windows Store.<br/>If you are in the mood for drifting, you have come to the right place. It’s always game time!<br/>Download the game Drift Racing Mania for free, and join the fun! <br/>◆◆◆◆◆ Drift Racing Mania Features ◆◆◆◆◆<br/>✓ Realistic 3D graphics<br/>✓ 5 Amazing Drift Cars<br/>✓ 5 Amazing racing tracks: Industrial, Downtown, Village, City, and Highway with beautiful skylines<br/>✓ Show your drifting skills by driving close to the walls and earn more drift   multiplier<br/>✓ Compete and unlock secret cars<br/>✓ Real engine sounds for every car<br/>✓ Turbocharger, gearbox and tires sounds</p>\n<p>Please take your time to rate your experience with this fun game Drift Racing Mania and write a short review.<br/>We will be grateful to hear your opinions and improve - whenever needed - in future versions.<br/>Have a nice time playing Drift Racing Mania!</p>", "metacritic": null, "released": "2017-11-29", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/595/595ed3f16b361ea0c0926725bf3cddab.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 147, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Sathyaraj"], "genres": ["Action", "Racing"], "publishers": [], "esrb_rating": null}