{"id": 104320, "slug": "team-racing-league-itch", "name": "Team Racing League (itch)", "name_original": "Team Racing League (itch)", "description": "<p><strong>Download and play the Demo!</strong></p>\n<p>Get the Demo on\r\nSteam\r\nto join in the Weekly Challenge and win keys for the full game</p>\n<p><strong>Team Racing League</strong>\n</p>\n<p>Team Racing League is the first team-based racing game where you win and lose as a team. Compete in an online 3v3 race where skill and collaboration are key to victory. Team up, strategize and use tactics to disrupt and beat the opposing team in a MOBA-like race experience!\r\n  </p>\n<p>In Team Racing League, players have access to various skill-based mechanics. You can race, crash, boost, drift, block, jump and brake your way to success. Choose to fight for position, play a support role or turn around to troll your opponents. In Team Racing League not everyone on the team needs to race. Only one player needs to complete all laps before an opponent does, so the other players can support the racer. Use blocks to close off areas, create roadblocks to obstruct your opponent or activate anchor mode to create a choke point. You can also connect your hovercraft to teammates. Once connected, the co-driver can charge a boost, extend into a roadblock or turn on the flamethrower, burning everything in its path.\r\n  </p>\n<p>Team Racing League is inspired by retro arcade racing games like Super Off Road, Micro Machines and Super Mario Kart. The game is all about teamwork and racing skills. It aims to be a pure racer, without artificial equalizing mechanics. The complete track and all racers are always visible in a top-down view so you have excellent overview of what's going on. Team up with your friends, outstrategize and beat your opponents!\r\n  </p>\n<p><strong>Features:</strong>\n</p>\n<ul><li>Team-based 3v3 racing\r\n  </li><li>Win together, lose together\r\n  </li><li>Literally team up by connecting your hovercrafts \r\n  </li><li>Support your teammates with anchor mode, blocks and roadblock\r\n  </li><li>Burn your opponents using flaming hot toasting mechanics \r\n  </li><li>Pure, skill-based racing \r\n  </li><li>Free demo available to practice racing against your own ghost\r\n  </li></ul>", "metacritic": null, "released": "2017-06-20", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/a07/a07ce56ffb62561c3a0d740c5a688441.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 193, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Gamious"], "genres": ["Sports", "Racing"], "publishers": [], "esrb_rating": null}