{"id": 104303, "slug": "ld30-god-game-khaibit", "name": "LD30 God Game - Khaibit", "name_original": "LD30 God Game - Khaibit", "description": "<p>LD30 Theme: Connected Worlds<br/></p><p>Premise   : Gods and Human Worlds Connected (Godly Interaction), Game and Real Life Worlds Connected (Time).</p><p>Info      : An in-game day takes 1 real life day. Sun and Moon rotate based on real life time,</p><p>            and day fades to night, and night fades to day. Make sure you check at all times of</p><p>            day to see all transitions and times of day.</p><p>Disclaimer: Sorry everyone outside of the EST timezone! It only currently supports EST, although if there is</p><p>            enough interest in the continuation of this project I will gladly support all time zones, update</p><p>            graphics, and add sound (Sorry for the lack of sound, I was aiming for things for you guys to do</p><p>            and wanted to get submitted to be able to gauge the process next Ludum Dare! :D). </p><p>Every 5 minutes there is a chance for another Human to join your tribe.</p><p>Population (Male + Female) increases Faith Regain, but also Health Degredation.</p><p>Controls:</p><p>Click Comet Icon       - Summon a Comet to restore 100% Faith. Can only be used once per 24 hours.</p><p>Click Sword Cross Icon - Summon a Sword Cross to double Faith Regain Rate. Cost: 100% Faith.</p><p>Click Berry Bush Icon  - Summon a Berry Bush to regain 10% Health. Cost: 10% Faith.</p><p>Click Deer Icon        - Summon a Deer to regain 20% Health. Cost: 20% Faith.</p><p>I hope you all enjoy what I have here!</p><p>Thank you, Ludum Dare! You kept me busy and on track! My time management is better than I thought. Glad I could submit for my first attempt! :)</p><p>To run the game: Run LD30GodGame.jar in the same folder as this README.txt.</p>", "metacritic": null, "released": "2014-08-25", "tba": false, "updated": "2019-08-28T23:24:50", "background_image": "https://media.rawg.io/media/screenshots/0db/0db8249cb7cb26248fb6fe87e1248505.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 9, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Khaibit"], "genres": ["Strategy", "Simulation"], "publishers": [], "esrb_rating": null}