{"id": 10442, "slug": "where-are-my-internets", "name": "Where are my Internets?", "name_original": "Where are my Internets?", "description": "\"Where are my Internets? \"  It is a board game set in a strange fictional world that resembles our present-day world, but with elements of humour and surreal events. You play as a typical city person who arrives in a desolate countryside with no trace of the internet. Your aim is to survive in these tough conditions. There is only one way you can do it: become an internet provider, and get online.<br/><br/><strong> Features </strong><br/><br/>● Unusual idea and setting.<br/>● Original graphics with a unique style.<br/>● Pleasant atmospheric soundtrack.<br/>● Single Player, with up to four Characters (Hotseat only)<br/>● A lot of surprises and humor.<br/><br/><strong> How to play </strong> <br/><br/><br/><br/>The game is based on a single player turned based board game with 1-4 characters <br/><br/>The aim of the game is to bring the internet to every village on the map. It requires money, which can be obtained by selling items you earn from using the cards.<br/><br/><br/><br/><br/>These are the player Characters. You decide the number of spaces the Characters will move on the board by rolling the dice. But each player has a limited number of moves, they are called mood points. The player loses one mood point per turn, except when they are in the vicinity of a village. When the number of mood points reaches zero, the player is out. Players can replenish their mood points when they access the internet.<br/><br/>The game features three types of location.<br/><br/>The first is the wilderness. When a player is in the wilderness, they have a choice on each turn between staying to activate some event card and going further. There are 27 event cards, of which 3 are unique to each type of location. The wilderness location has the following land types.<br/><br/><br/><br/>Each card describes a different event, usually a fight. If the player wins the fight, they gain an item card, if they lose, they lose one mood point. There are a few surprise cards, marked with a question mark, for unexpected events.<br/><br/><br/><br/>Players can sell items they have earned, and get onto the internet in a village. The cost of internet use will go up each time you connect to and or use it. If the village already has a connection, players can simply use it (but must pay the owner). An indicator in the upper right corner shows whether the village is connected or not, and who owns the connection.<br/><br/><br/><br/>If a player's token is somewhere near an internet-connected village, the player can get a remote internet signal and replenish their stamina as if they were in the village.<br/><br/> <br/><br/>If there is no signal, the player has to draw a fight card.<br/><br/>You can also tweak your dice move by using bonus cards. These are given out after you finish a circle, and sometimes also drop from the chests.<br/><br/><br/><br/>I hope you have a great time playing our game with hours of enjoyment, and a fun!", "metacritic": null, "released": "2016-12-16", "tba": false, "updated": "2019-08-28T22:14:25", "background_image": "https://media.rawg.io/media/screenshots/bac/bacd0bdf285954d87c081cb2a9033579.jpg", "website": "http://dnva.biz/where-my-internets.html", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 53, "beaten": 1}, "playtime": 5, "achievements_count": 45, "ratings_count": 3, "suggestions_count": 230, "game_series_count": 0, "reviews_count": 3, "platforms": ["Linux", "PC", "macOS"], "developers": ["Lokator Studio"], "genres": ["Indie"], "publishers": ["DNVA"], "esrb_rating": null}