{"id": 104485, "slug": "strange-warrior", "name": "Strange Warrior", "name_original": "Strange Warrior", "description": "<p>+How to play : <br/></p>\n<p>- Upgrade your tower/shield/bow/wall/... from the village<br/>- Hire some Soldiers to help you defending against monsters<br/>- the longer time you press, Strange Warrior will stretch more his bow and the arrow will go faster <br/>- Attack other players<br/>- Finish Quests and make some gold<br/>- Reclaim your first village, and then claim other villages from the Global Map<br/>- Attack House of Skeleton and take its gold chest<br/>- Watch out for the Mighty Castle<br/>- Dominate the map<br/>*Easy to learn, hard to master addictive one button gameplay.</p>\n<p>+Subject :In the Dark Ages, Humanity have fall down under the invasion of Evil Monsters. <br/>Only one city have resisted, one last city for the human race, Mankind Hope, but the monsters numbers are increasing, and their attacking skills are getting greater, situation seems hopeless, then ...<br/>Suddenly, a Strange Warrior appear  from nowhere, this stranger who has no past, no present, put himself at the service of the town.<br/>With the Strange Warrior help, hope will be restored, and Humanity will never falllllllllll ...... </p>\n<p>This city is surrounded by Mountains and Trees all over, with only one entrance, where the villagers have build a fortress to defend themselves, which have made a good defense against monsters in the past. <br/>Declaring his will for help, the Strange Warrior, decided to stand up on top of the Main Gate for this city, his weapon in his hand, waiting for any weird creature to appear, ready to defend with his life.</p>\n<p>will the city succeed in surviving against the Evil Monsters with the help of this unknown warrior ?</p>", "metacritic": null, "released": "2018-07-05", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/d5f/d5fbb71f624fe878a5254f2b1c8d9cc2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 159, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["fikani4games"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}