{"id": 10450, "slug": "youtubers-life", "name": "Youtubers Life", "name_original": "Youtubers Life", "description": "Youtubers Life is the ultimate life simulation/tycoon videogame in which you can become the world’s greatest content creator in history by editing videos, expanding the number of fans and turning yourself into a wealthy fellow. Create your character and start making your first broadcasts in the cosy room at your parents’ where you have grown up since you were little. Keep an eye on daily tasks and socialise yourself to increase your popularity while you have to deal with fans, friends, family and time management!<br/><br/><br/>Become the most important gamer on Internet ever! Attend presentations of new games, buy new and classic consoles, purchase your favourite titles online, get them delivered at home and start recording your gameplay sessions right away!<br/><br/><br/>Have you ever wished to become a music star on Internet? Play up to 30 different instruments and master every music genre —there are more than 10! Publish cover videos, music lessons, duets and be the focus in a live concert.<br/><br/><br/>Enjoy the new Cooking Channel in which you will record the best cuisine-themed videos online! Buy ingredients, choose the appropriate kitchen tools and create recipes. Giving cooking advices has never been so fun!", "metacritic": 63, "released": "2017-02-02", "tba": false, "updated": "2024-03-13T21:05:05", "background_image": "https://media.rawg.io/media/screenshots/9b5/9b500837b7dbd289ccec169fe102d1c0.jpg", "website": "http://www.youtuberslife.com", "rating": 2.94, "rating_top": 3, "added_by_status": {"yet": 20, "owned": 347, "beaten": 30, "toplay": 8, "dropped": 56, "playing": 5}, "playtime": 6, "achievements_count": 102, "ratings_count": 71, "suggestions_count": 349, "game_series_count": 0, "reviews_count": 71, "platforms": ["PC", "Linux", "Android", "macOS"], "developers": ["U-Play Online"], "genres": ["Strategy", "Simulation", "Indie"], "publishers": ["U-Play Online"], "esrb_rating": null}