{"id": 104559, "slug": "tower-of-the-wizard-gameboy-adventure", "name": "Tower of The Wizard: Gameboy Adventure", "name_original": "Tower of The Wizard: Gameboy Adventure", "description": "<p>The mad Wizard in his tower has sent his minions to terrorize the countryside. With the army away in foreign lands, a lone stranger enters the Wizard's tower to end his menace.</p><p>You play as a lone adventurer who seeks to put an end to the threat of the mad wizard. Navigate a challenging dungeon, filled with traps and foes. Use the map that you will pick up early on in order to find various equipment, and use them in turn to traverse the myriad obstacles the tower presents to you. In the tower you will find a spear that will allow you to slay foes and bounce on their heads, a pair of gloves that will allow you so slide down walls and also cling to them and jump from them, and last but not least, a light cloak that will allow you to glide as you fall.</p><p>Tower of The Wizard: Gameboy Adventure (full title), is a metroidvania platformer at heart. You need to explore a vast, open castle, and use your map and your skills to progress. The game is a love letter to the old platformers, and is very challenging. You will need a lot of patience and practice to progress in the game, but once you finally cross a pesky section by pulling off a series of connected maneuvers, you will feel like the biggest badass of them all!</p><p>Features:</p><p>1) A big tower to explore, consisting of 36 connected rooms.</p><p>2) 4 fun character upgrades.</p><p>3) 5 different enemy types (not counting the final boss!)</p><p>4) 4 different trap types.</p><p>5) Challenging and rewarding platform gameplay, interwoven with basic combat mechanics.</p><p>6) An intense and surprising boss fight at the end.</p><p>7) Retro graphics, inspired by the 4-color palette, and the pixel height (144px) of the gameboy.</p><p>8) Chiptune soundtrack.</p>", "metacritic": null, "released": "2017-02-08", "tba": false, "updated": "2019-08-28T23:24:49", "background_image": "https://media.rawg.io/media/screenshots/fbc/fbcf66fbf248c045bd3f92239b377811.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 85, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Suhail Habib"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}