{"id": 104651, "slug": "chopper-attack-helicopters-web", "name": "Chopper: Attack helicopters web", "name_original": "Chopper: Attack helicopters web", "description": "<p>In this 3D simulator, you will find Russian attack helicopters Mi-8, Mi-24 \"crocodile\", Ka-50 \"black shark\" and Mi-28 \"night hunter\".</p><p>Your mission is to capture enemy bases and destroy its forces, to capture a base it is needed to perform landing at the appropriate helipad. Capture of all 4 bases is needed to win. On landing, your helicopter armour and ammo are replenished.</p><p>At the very beginning you have only one Mi-8 combat helicopter, and only one map. On completion of the mission, another helicopter becomes available, as well as new map and another mission. All missions can be performed with any of available attack helicopters. Enemy units performance is improved, according to the combat helicopter you have chosen.<br/></p><p>Three types of weapons are present in the game: unguided missiles, guided air-to-ground missiles and machine gun.</p><p>How to control the helicopter:<br/>- Collective: 'W'-S'<br/>- Rudder: 'A'-'D'<br/>- Cyclic: arrow keys<br/>- Fire: spacebar<br/></p><p>Navigation arrow points to one of the helipads, and switching automatically on every landing. For manual switching use the icon in the left bottom part of the screen (or press '1'). To toggle the optical zoom mode, use the icon on the left from the shooting zone (or press '2'). To toggle weapons, use the icons on the right from the shooting zone (press '9' or '0'). <br/>The indicators on top of the screen show progress of the mission, number of the destroyed targets and the rest of your helicopter armour.<br/></p><p>Good luck!</p><p>*Soundtrack: Battle of the Void by Marcelo Fernandez (http://www.marcelofernandezmusic.com).<br/> Licensed under Creative Commons Attribution 4.0 International (http://creativecommons.org/licenses/by/4.0/).</p>", "metacritic": null, "released": "2016-01-21", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/397/397a95ce08a038688379c4b9d8c5dd52.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 167, "game_series_count": 0, "reviews_count": 0, "platforms": [], "developers": ["GTS"], "genres": ["Shooter", "Simulation"], "publishers": [], "esrb_rating": null}