{"id": 104670, "slug": "skytown", "name": "SkyTown", "name_original": "SkyTown", "description": "<p>\r\n\tWelcome to SkyTown! A city simulation game where your goal is to build a city,make your citizens happy and keep them well fed. In return they will work at your factories and produce money and other resources.You will need to face a lot of difficulties when raising a town from a small village to a huge city. Your citizens react to every change you make so you need to plan your city well.\r\n</p>\n<p>\n<strong>Features:</strong>\n</p>\n<ul>\n<li>Every change you make in the city will have a impact on the people living there. Too many factories will cause a lot of polution and your citizens will become unhappy and stop working.  </li>\n<li>At the start of every game you choose what major you want to play like. Every major have his/her own ability/buff that will boost your city in different ways.</li>\n<li>Buildings react to each other. For example: If you make a forest close to a factory area the forest can be destroyed by the polution and that will produce a lot of unhappiness! </li>\n<li>SkyTown also got special resources that spawn on the map. What resource you start with is random wich makes the game more interesting to play over again as you will have new challenges based on what resource your island will start with.</li>\n<li>Unlock new majors by playing. At the start of the game you will only have one major but after playing you will unlock more majors untill you have them all.</li>\n</ul>\n<p>\n<strong>Why Early Acces?</strong>\n</p>\n<p>\r\n\t\r\n\tMaking a game is not free. As i am a \"one man team\" i sometime have to hire freelancers to do some of the work i cant do myself. The people who support helps me fund the game so i can keep working on it. If you buy the game now you will get all future updates and if the game ever makes it to steam you will get a steam key!\r\n\t\r\n</p>\n<p>\r\n\tPlanned Features:</p>\n<ul><li>Water pipe system</li><li>Tax system</li><li>Custom maps</li><li>More buildings</li></ul>", "metacritic": null, "released": "2014-10-08", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/292/292c78ad65a042a26e147c936424c60d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 34, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Bitlazygames"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}