{"id": 104695, "slug": "fall-from-grace", "name": "Fall From Grace", "name_original": "Fall From Grace", "description": "<p>\r\n\tFall From Grace is a physics-based ragdoll game. You must descend the pit to recover your lost virtue before facing a trial by fire!  It's a simple one-touch game - tap to pull the skeleton towards the tap, while guiding it down the pit and towards the virtues.\r\n</p><p>\r\n\tThis game was made in 4 hours for the #CoronaBlitz2017 game jam (plus an extra hour for \"packaging\" and such) given the theme \"Virtue\".  I did my \"dev-blogging\" via Twitter, if curious:  https://twitter.com/davebollinger</p><p>\r\n\tI spent the first two days doing nothing but pondering the theme, because rather than seeing it as limiting, I found it to be quite vast, so I wanted an idea that could \"cover\" (at least in a trivial way) the breadth of what \"virtue\" entails, while still being something I could actually accomplish in 4 hours!\r\n</p><p>\r\n\tI knew i'd prefer to do a \"reversal\" of the theme if possible, just to be clever, so I was thinking along the lines of \"lost virtue\" rather than \"virtue\".  So I needed a \"tragic hero\", and a simple \"one-thing\" mechanic, and that sort of sparked the ragdoll idea.  Throw in some gravity, and scattered \"virtue collectables\" and viola!, the rest of the idea just sort of came together in an instant (an \"a-ha\" moment).\r\n</p><p>\r\n\tIt wasn't a \"perfect\" idea, but it seemed good enough AND doable in 4 hours, so it was settled.  It's perhaps a bit more \"religious\" interpretation of the theme than I might have preferred, though I tried to keep it generic and not overt.\r\n</p><p>After finally deciding on the idea, I spent about an hour a day actually working on it.  I'd think about it off and on throughout the day so that the coding time (ie, time spent actually typing) could be as productive as possible.  The final night of coding, Thursday, I \"recovered\" about 45 minutes that I had attributed to graphics/sound development for shining up the pause and end game dialogs, making scores persistent, and putting stars on the title screen select.</p><p>The sometimes wonky ragdoll physics are actually intentional - the primary challenge of the game is to avoid getting stuck in the rocks yet still moving around enough to avoid scrolling off screen while trying to collect the virtue.</p><p>Music: \"The Snow Queen\" Kevin MacLeod (incompetech.com)<br/></p><p>\r\n\tLicensed under Creative Commons: By Attribution 3.0<br/>\r\n\thttp://creativecommons.org/licenses/by/3.0/\r\n</p><p>Game itself is about 1.3kloc, plus about 1kloc of my own pre-existing support lib, no third-party libs, ui/fire/grass gfx borrowed from my own pre-published apps, rest from scratch by me for comp.</p>", "metacritic": null, "released": "2017-04-07", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/29c/29c379d104209477966f9a4756632148.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 160, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["danisobo"], "genres": ["Action"], "publishers": [], "esrb_rating": null}