{"id": 10477, "slug": "samurai-of-hyuga", "name": "Samurai of Hyuga", "name_original": "Samurai of Hyuga", "description": "Samurai of Hyuga is a brutal, heart-pounding interactive tale. Prepare to enter the land of silk and steel, where fantasy clashes against grim reality, and where the good guys don\u0081't always win in the end. It\u0081's a harsh world with tough choices at every turn. Good thing you\u0081're the toughest ronin around.<br/><br/>\"Samurai of Hyuga\" is a 135,000-word interactive fantasy novel by Devon Connell, where your choices control the story. It's entirely text-based--without graphics or sound effects--and fueled by the vast, unstoppable power of your imagination.<br/><br/>A bodyguard, an assassin, a savior. Become all those things and more! Will you be able to change your ways and protect those around you? Or will you succumb to your bloodthirst and become the ultimate manslayer? Will you find love, or lust? Will you adopt a code of honor, or do whatever it takes to win? Can your spirit survive against your own demons? <br/><br/>Combat, drama, and so much more await you in the first book of this epic series! <br/><br/><ul><li> Become a badass ronin, a master manslayer, and reluctant bodyguard for hire!<br/></li><li> Join with your spirit animal to take on mythological oni!<br/></li><li> Face down your own demons in this dramatic, unforgettable adventure!<br/></li><li> Over 140,000 words of interactive fiction!</li></ul>", "metacritic": null, "released": "2015-07-16", "tba": false, "updated": "2019-08-28T22:14:24", "background_image": "https://media.rawg.io/media/screenshots/fd6/fd65f3d3bb14c2ae1df7629d32b69214.jpg", "website": "https://www.choiceofgames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 7}, "playtime": 9, "achievements_count": 30, "ratings_count": 1, "suggestions_count": 61, "game_series_count": 0, "reviews_count": 1, "platforms": ["macOS", "PC", "Linux", "Android", "iOS"], "developers": ["Hosted Games"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["Hosted Games"], "esrb_rating": "Mature"}