{"id": 104722, "slug": "princess-princess", "name": "Princess Princess", "name_original": "Princess Princess", "description": "<p>In this (first ever?) VX Ace game, made with the original Japanese Trial, comes the story of 4 brave warriors to save THE PRINCESS from the hands of the EVIL OVERLORD! Will you be able to find the princess in time, or will she fall into the hands of the EVIL OVERLORD!? <br/><br/><strong>Warning! This game contains:</strong> <br/>- Cartoon Violence <br/>- Sexual Themes <br/>- Racism <br/>- Sexism <br/>- ...Well, you know. <br/><br/>In this game, we strongly suggest that you take time to talk to NPCs, explore the landscape, constantly check your inventory, and read the status of each and every character~ The game aims to be a simplistic but fun experience. Nevertheless, you can't just mash the attack button to win every battle. <br/><br/><strong>Because this game was made with the Japanese Trial Version, there are limitations:</strong> <br/>- The trial disallows compressing game data. <br/>- There is also a cap on the number of database entries for items, equipment, animations, etc. <br/>- Scripts cannot be edited. <br/>However, the Scripts.rvdata2 was replaced with the default English Scripts.rvdata2 to avoid Japanese characters and bugs. <br/><br/>This is the First Act of the Princess Trilogy, which together comprise Episode 6 of the Division Heaven series. The Second Act, Porcupine Princess, is in production. We are also planning to make a sequel called Pixel Princess. These games share the same lore with the overall Divison Heaven series, but the games don't need to be played in order.</p>", "metacritic": null, "released": "2015-06-08", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/a0b/a0bc525af2e07d183f7da608449cde5f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 144, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Archeia"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}