{"id": 104787, "slug": "turbo-hellion", "name": "Turbo Hellion", "name_original": "Turbo Hellion", "description": "<p>In a lawless galaxy, the Hellions are feared as masters of destruction, annihilating mobs of pirates and the fleets of tyrants alike in their explosive last stand. How long will your precision, your reflexes, your will, last in the face of certain doom?</p><p>&gt; Dodge bullets and shoot down enemies to build your combo multiplier<br/>&gt; Difficulty slowly builds the longer you last with more enemies and faster bullets</p><p><strong>CHANGELOG</strong></p><p>1.0.2-hotfix - Crucial Crash-Fix Patch</p><ul><li>The previous update introduced a bug whereby clicking on the title screen instead of pressing space would cause the game to instantly crash. This should now be fixed.</li></ul><p>1.0.2 - Balance and Usability Patch</p><ul><li>The rate at which the difficulty increases over time has been given a huge boost, the game should now feel much harder and faster</li><li>To compensate for the difficulty increase, your combo no longer resets when an enemy passes off the edge of the screen</li><li>Added a second, much more readable font to the game for general text</li><li>Numerous text fixes</li><li>The game can now be restarted by clicking or pressing space at the game over screen</li></ul><p>1.0.1 - Post-Launch Bugfix<br/></p><ul><li>Fixed a bug whereby the game would crash if the last song was allowed to finish, it now loops back to the start of the song list as intended</li><li>Cut down file size drastically by converting the music to Ogg Vorbis (NOTE: might break mac compatibility, let me know in the comments if the game crashes)</li><li>Removed one song entirely: Black Vortex by Kevin Macleod</li><li>Cut up another song to reduce it to just the fast part: Lady In Chrome by Jens Kiilstofte</li></ul>", "metacritic": null, "released": "2015-11-01", "tba": false, "updated": "2019-08-28T23:24:48", "background_image": "https://media.rawg.io/media/screenshots/b19/b19f4ecdb228c7fc9ff9f28109060263.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 41, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["stomygame"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}