{"id": 104732, "slug": "wind-racer", "name": "Wind Racer", "name_original": "Wind Racer", "description": "<p>Introducing Wind Racer - I wanted to make an aeroplane racing game that didn't rely on rings, or invisible canyons, it's intended to be a bit more open and dynamic.  More info on the idea behind this game over on my dev blog here.</p><p>Best played with a joypad, here's how:</p><ul><li>Left stick to roll and pitch your plane (arrow keys on the keyboard)</li><li>Bottom left action button (usually X or A) to release your plane at the start, and to accelerate (space bar on the keyboard)</li><li>At the start of the race if you try to release too soon you will get a penalty - only hit release / accelerate when it says GO!</li><li>While flying, hold down accelerate if you don't want to crash</li><li>If you do crash, hit Esc to get back to the menu and start another race</li><li>Fly left of yellow balloons, right of red balloons, and below blue balloons - arrows will help you remember this</li><li>Each time you pass a balloon up to 5 in a row will improve your top speed</li><li>Each time you miss your top speed takes a penalty, so don't cut corners!</li></ul><p>Forgive the placeholder art and sound effects!  Also the collision is off on most objects and the other planes.</p><p>This is a prototype hacked together in a couple of weeks, I haven't had chance to explore more dynamic courses yet, the focus so far was on just getting the basics up and running as quickly as possible.</p><p>I'd love to hear from you if it's the sort of game you'd like to play when it's finished, as I haven't really established whether there's a viable market for it yet!<br/></p><p>Music from Kevin MacLeod's excellent collection - http://incompetech.com/</p>", "metacritic": null, "released": "2015-03-25", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/f5d/f5d2442f341533ade908896322cabf5d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 86, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Mike Enoch"], "genres": ["Simulation", "Racing"], "publishers": [], "esrb_rating": null}