{"id": 104768, "slug": "alice-1st-story-early-access", "name": "Alice: 1st Story [Early Access]", "name_original": "Alice: 1st Story [Early Access]", "description": "<p><em><strong>The following download is only the first half of the game.</strong></em></p>\n<p><strong>The most important rule of all is to be careful of who you trust.</strong> <br/>Delve into a world of madness known as Wonderland - a world that's not for the faint of heart. <br/>Solve puzzles, talk to the sane and not so sane Residents of the Heart Territory, and uncover the history of this world as you try to navigate through areas such as the Tulgey Woods and the Duchess' Palace to reach home. <br/><br/><strong>The full game [that may or may not ever be released] features</strong>: <br/>*An affection system which will determine your ending <br/>*4 endings and multiple ways to die <br/>*A world based on Lewis Carrol's Wonderland <br/>*Two possible candidates to aid you in your journey <br/>- Each have a set of optional areas you can explore in <br/>- They'll also provide you with different sets of dialogue and banter <br/>*Tons of parallax maps to explore in <br/>*Multiple ways to complete the quests given to you <br/>*1-2 hours of game play on the first Act alone. <br/>The full game may be up to 4 hours. <br/><br/>- Be warned. The game does feature dark and possibly touchy topics. - <br/>- There is no combat in this game. - <br/><br/>This is a slight puzzle based game in a dark fantasy setting. <br/>It has elements of a visual novel as well.(Otome elements)</p>", "metacritic": null, "released": "2018-02-01", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/3de/3de56e1be6dd42115e3aad211d772858.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 314, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MaliceDiary"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}