{"id": 104746, "slug": "satyagraha-episode-one", "name": "Satyagraha: Episode One", "name_original": "Satyagraha: Episode One", "description": "<p><strong><em>Satyagraha</em></strong> is a stealth game fused with an interactive story which introduces the player to the concept of non-violent resistance.</p><p>It's a prototype, currently still in development and created for #ResistJam 2017.  </p><p>Aesthetically, I took my inspiration from <em><strong>Sin City</strong></em> and <em><strong>Film Noir</strong></em> cinema.</p><p>I'd really love to develop this one further into a series of episodes so any contributions that you make will be greatly appreciated.  <em>Why not \"buy\" me a coffee by supporting me with a donation?</em>  Creating games as a solo developer is hard work and I'd love to be able to afford to do this full time, as well as pay a Programmer and additional team members one day.  Until then, it's just me doing everything and my programming hat doesn't fit me very well!</p><p>This project uses several public domain images, sounds, music, and 3D assets from the Unity Asset Store to streamline development since it's a week long jam.  Please see the Attribution text bundled with the game for source details and a big thank-you to all the authors of these assets.  I couldn't have made this prototype in a week without you. </p>Here's some handy tips :<p><strong>Move : W A S D</strong></p><p><strong>Run : Shift + W A S D</strong></p><p><strong>Spacebar : Jump / Select</strong></p><p><strong>Mouse : Look around / Left click - Select</strong></p><p><em><strong>** The gameplay scenes take a while to load. I'm hoping to fix that in future updates. Until then, please be patient when scenes are loading.</strong></em></p>", "metacritic": null, "released": "2017-03-10", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/0ce/0ce5b729b386eb1e1df38055af8d8f02.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 204, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["FutureStateMachine"], "genres": [], "publishers": [], "esrb_rating": null}