{"id": 10483, "slug": "the-hero-of-kendrickstone", "name": "The Hero of Kendrickstone", "name_original": "The Hero of Kendrickstone", "description": "Can a wanna-be hero like you rescue the city of Kendrickstone, held hostage by an evil wizard and his troop of black-clad soldiers? Face down fierce foes with spell, sword, or silver tongue. Outwit cunning rivals, cement your fledgling reputation, and maybe, just maybe, make enough money to pay your rent!<br/>\n<br/>\r\n“The Hero of Kendrickstone” is an epic 240,000-word interactive fantasy novel by Paul Wang, where your choices control the story. It's entirely text-based—without graphics or sound effects—and fueled by the vast, unstoppable power of your imagination.<br/>\n<br/>\r\nStep into the shoes of a fledgling adventurer in a world full of magic and mystery! Master physical combat, magic, stealth, or diplomacy. Choose to befriend–or betray–sorcerers and knights, bandits and baronesses.<br/>\n<br/>\r\nWill you spend the last of your silver on a bed for the night, or potions for your next adventure? Will you spend your evenings studying ancient secrets, or prize-fighting for extra coin? Will you seek a mentor to help hone your skills, or strike out on your own? Will you prove to be a paragon of compassion, or a callous mercenary? Will you die forgotten and un-mourned, or will you become the Hero of Kendrickstone?", "metacritic": null, "released": "2015-03-12", "tba": false, "updated": "2019-08-28T22:14:24", "background_image": "https://media.rawg.io/media/screenshots/e5d/e5df3d584e747158eec614b4aeb3b692.jpg", "website": "https://www.choiceofgames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 4}, "playtime": 7, "achievements_count": 13, "ratings_count": 1, "suggestions_count": 103, "game_series_count": 0, "reviews_count": 1, "platforms": ["macOS", "PC", "Linux", "Android", "iOS"], "developers": ["Choice of Games"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["Choice of Games"], "esrb_rating": "Teen"}