{"id": 10480, "slug": "sorcery-is-for-saps", "name": "Sorcery Is for Saps", "name_original": "Sorcery Is for Saps", "description": "As an apprentice sorcerer, you should never steal your master's identity. But what if that's the only way to save the kingdom?<br/><br/>\"Sorcery Is for Saps\" is a 200,000-word interactive fantasy novel by Hilari Bell and Anna-Maria Crum, where your choices control the story. It's entirely text-based—without graphics or sound effects—and fueled by the vast, unstoppable power of your imagination.<br/><br/>Will your powers save the cursed king--or will you turn traitor and seize the throne yourself? You can probably break a simple kindness curse, but there are dark forces at work and you may be in over your head before you can say “Abracadabra.”<br/><br/>Throw in your lot with scheming councilors, the attractive heir, or even go to work for the invaders. But whether you choose to save the king or your own neck, one thing is clear—this is your big chance!<br/><br/>‪Magic, power, or true love—which will you choose? In \"Sorcery Is for Saps,\" you'll find it's easier than waving a wand.<br/><br/><ul><li> ‪Be a hero or turn traitor, seduced by a sexy spy.<br/></li><li> ‪Play as male or female, gay, straight, or bi.<br/></li><li> ‪Steal a rival wizard's inventions.<br/></li><li> ‪Fight the maniacal, mechanical, magical monkey.<br/></li><li> Power up for politics, succeed at sorcery, or just get really, really rich.<br/></li><li> ‪Trade barbs with your snarky familiar. Or will you kow-tow to a sarcastic ferret?<br/></li><li> End up as a sorcerer, a royal councilor, a villain, or a mouse. (Literally. You can be turned into a mouse.)</li></ul>", "metacritic": null, "released": "2016-10-13", "tba": false, "updated": "2019-08-28T22:14:24", "background_image": "https://media.rawg.io/media/screenshots/2ec/2ecf9ae9ee13b0bfb8f476f0b81e0ac2.jpg", "website": "https://www.choiceofgames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3, "beaten": 1}, "playtime": 4, "achievements_count": 20, "ratings_count": 2, "suggestions_count": 39, "game_series_count": 0, "reviews_count": 2, "platforms": ["Linux", "macOS", "PC", "iOS"], "developers": ["Choice of Games"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["Choice of Games"], "esrb_rating": "Teen"}