{"id": 104994, "slug": "graina", "name": "Graina", "name_original": "Graina", "description": "<p>Hint: You can play the game directly on this page. Just wait a little bit if this is the first time you are opening the page</p><p>\r\n\tHey there, here is <strong>Graina</strong>, my game project that I've been working on solo for the past 2 years. It's under constant development.<br/>\n</p><p>\r\n\tIf you have played Lemmings before, \r\n\t<strong>Graina </strong>will feel similar, but not the same. Play with the \"literally\" sandbox levels and try to solve puzzles on each level to bring the Gnomes to safety.\r\n</p><p>\r\n\tThere is also a creative Tinker mode where you can try your own concepts or just play with the elements and have fun.\r\n</p><p><strong>Reviews &amp; Mentions<br/></strong></p><p><em>[Alpha v0.5] It's great fun sucking up and dumping the various types of materials as it gives the game a wonderfully tactile feeling and the granular physics are a joy to see in motion</em><strong> -</strong><em> FreeGamePlanet.com</em></p><p><em>[Alpha v0.0] ...the fun comes from finding ways in which the materials and the enviroment combine to produce new result. - RandomiseUser (Youtube)</em><br/></p><p>\r\n\tKnown bug : In tinker mode, save/Load doesn't work properly in full-screen. Issue is about entering text to the inputs.\r\n\t<br/>\n</p><p>Game is constantly being updated. I'll try not to break any save-games in the process. See the development log in comments for the latest news in the below community section.\r\n\t<br/>\n</p>", "metacritic": null, "released": "2015-10-03", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/ba3/ba3223f2ced6d730f17f1bc82d6d8fff.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 142, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Multiplex Games"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}