{"id": 104932, "slug": "child-of-eurymedon", "name": "Child of Eurymedon", "name_original": "Child of Eurymedon", "description": "<p>A game created for the Greek MytholoJam.</p>\n<p>The main inspiration is the legend of Eurymedon, child of Gaia and Ouranos, king of the powerful giants.</p>\n\n<p>After a fierce battle, Eurymedon is now imprisonned by zeus in the tartare. This is when our story begins...</p>\n<p>The city has put to use all its ingenuity to equip the troops with anti-giants weaponry. Aided by the gods, prepare the defenses of the city against the sons of Eurymedon before it is too late!</p>\n<p>Are you ready to battle against Eurytus, Hippolytus, Leon, Pelorus, Euryalus, Agrius and Hopladamus ?<br/></p>\n<p>Remember that you are fated, never go back ! AOUHHHHHH</p>\n\n<p><strong>Controls :</strong></p>\n<p>Use left and right to move the view in combat, use the mouse to select your action. Clic on the instrument on the bottom right to toggle sound on/off, or press M. <br/></p><p><strong>How to play ?<br/></strong></p><ul><li>you start with a preparation phase. You have all the time you want to choose units by clicking on the icons and placing them in the city</li><li>spend all your glory points ! the amount will be reset on next level</li><li>try to think of good ways to combine units</li><li>when you are ready, clic \"wrestle!\" and the giant will attack</li><li>you can do some actions with units (moving for foot units, shooting for siege units)</li><li>use spells to help your sodliers ! clic on the spell on the right, then clic where you want to use it</li></ul>\n<p>A game by ROBOWARRIOR and joqlepecheur<br/></p>", "metacritic": null, "released": "2017-12-07", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/f0a/f0aa205a51ec46be28f779e24ecf1e51.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 37, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["NEVER BEHIND"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}