{"id": 104985, "slug": "termitia-fr", "name": "Termitia [FR]", "name_original": "Termitia [FR]", "description": "<p>\r\n\t(English version here)<br/></p><p>Termitia, un jeu d'action-aventure à caractère scientifique. Basé sur de véritables données scientifiques, il propose de plonger au cœur d'une termitière et de tenter d'y survivre…\r\n</p><p>\r\n\tLe joueur incarne un membre d'une brigade d'intervention qui doit retrouver une équipe scientifique partie explorer les méandres d'une termitière. Seuls les réflexes, l'habilité et la capacité du joueur à comprendre et assimiler très rapidement le fonctionnement de la termitière et de ses occupants pourront lui permettre de mener à bien sa mission.\r\n</p><p><em>Termitia est un projet à but non lucratif : <strong>vous pouvez le télécharger gratuitement.</strong> Cependant, nous avons encore plein d'idées pour améliorer le jeu (et vous en aurez certainement d'autres à nous proposer)! Alors, <strong>n'hésitez pas à nous soutenir.</strong> Nous utiliserons l'argent ainsi récolté pour ajouter de nouveaux éléments au jeu, ou pour lancer une campagne de crowdfunding qui servira à financer le développement d'une nouvelle intelligence collective artificielle pour nos termites. On compte sur vous! </em></p><p>\n</p><p>Les coproducteurs Science Animation Midi-Pyrénées, Universcience et la PME iTolosa se sont associés au Centre de Recherches sur la Cognition Animale pour développer un jeu vidéo à partir de travaux de recherche sur les insectes sociaux. </p><p>\r\nConçu sur une idée originale de Science Animation Midi-Pyrénées, association culturelle qui a pour mission de rendre accessibles à tous les sciences, Termitia permet d'expérimenter le jeu d'action-aventure pour partager le travail des chercheurs.\r\n</p><p>Plus d'info sur le projet ici.</p><p><em>Attention, ce jeu peut contenir des éléments susceptibles de heurter la sensibilité des plus jeunes.</em><br/></p>", "metacritic": null, "released": "2015-02-10", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/a52/a52cb7f95786627814210245c2e51606.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 152, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Science Animation"], "genres": ["Action"], "publishers": [], "esrb_rating": null}