{"id": 10516, "slug": "the-age-of-decadence", "name": "The Age of Decadence", "name_original": "The Age of Decadence", "description": "The Age of Decadence, our first but hopefully not the last RPG, is now available. If you've been following it or playing it in Early Access, you know what to expect. If you've just discovered it, \"stay awhile and listen\". The most commonly asked question is:<strong>What Kind of Game Is It?</strong><br/>It’s a very different game than anything you’ve ever played. I’m sure you’ve noticed that the RPG genre hasn’t really been explored yet and most RPGs follow the formula that didn’t change in 20 years. While there were always games that strayed off the beaten path – Darklands, Planescape: Torment, King of Dragon Pass – such games were the exceptions that only reinforced the rule. <br/><br/>The Age of Decadence is an experiment, an attempt to explore a different direction, taking you back to the PnP roots of the genre. It doesn’t mean that the game is awesome. In fact, there is a good chance that you won’t like it, precisely because we took too many liberties with the established design. <br/><br/>So What Sets The Age of Decadence Apart From Other Games?<strong>1. The Setup</strong><br/>Traditionally, many fantasy RPGs are about killing things, clearing up dungeons, and being a hero. There is nothing wrong with mindless fun and wish fulfillment, but we want to offer you something different. To quote Tom Chick (Quarter to Three's game critic):<br/><br/>\"But Age of Decadence wants nothing to do with kobolds, just as it wants nothing to do with Doo-dads of Unimaginable Power. The overarching idea is a crumbling society divided among three noble Houses, each fumbling around in its own version of darkness to comprehend what destroyed the world. That’s the central mystery. It plays out like noir in that you are the detective, piecing together what really happened from differing accounts, all vividly written with clear voices and efficient prose. And like a detective in a noir yarn, you can’t help but become part of the central mystery, effecting an outcome you might not have intended.\"<br/><br/>The Age of Decadence is not a game about killing monsters or exploring mystical lands, but rather, surviving amid the greed and brutality of your fellow humans and carving out a name for yourself. Good and bad are purely relative. It’s a world of scheming and backstabbing in which your words and actions have the potential to forge alliances and sow discord, and your path is never certain.<br/><br/>You get to play with seven different factions: three Noble Houses and four 'professional' guilds: merchants, assassins, thieves, and the army, all fighting for power or influence; over 100 named characters, over 750 ‘generic’ characters with unique IDs taking part in violent take-overs, assassinations, and power grabs, and over 600,000 words of dialogue: a well-developed and thought through world, believable characters, realistic motivations, but no elves, dwarves, magic, and wizards in fashionable, pointy hats.<strong>2. Combat difficulty</strong><br/>Another design aspect worth mentioning is combat difficulty. It’s a hard game. <br/><br/>Combat difficulty is integrated into the setting. You can’t say that the world is harsh and unforgiving and then let the player kill everyone who looks at him or her funny. The game has to be hard, dying should be easy, and you should have reasons to pick your fights.<br/><br/>You aren’t a powerful hero who can defeat anyone and save the world and it is the difficulty that reinforces this notion. Make the game easier and we’re back to the powerful hero setup. So unless you’re a natural born killer, watch what you say and think before you act or you’ll end up dead before you can blink.<strong>3. Choices &amp; Consequences</strong><br/>Choices are what the game is all about - crafting your own narrative via a variety of choices that alter the story, playing field, and your options down the road. From multiple quest solutions to branching questlines you'll have plenty decisions to make and consequences of said decisions to deal with, which is what makes the game incredibly replayable.<br/><br/>Starting the game as a mercenary and joining the Imperial Guards will give a completely different experience, different quests, different content and points of view than, say, playing the game as a merchant (less buying low and selling high, more scheming and plotting to gain advantages for the guild), a praetor serving a Noble House, or an assassin.<br/><br/>The questlines are interwoven, forming a large, overarching story, so playing the game only once will be like witnessing events from a single perspective, which is limited by default. You will have to play the game several times to better understand what’s going on, piece everything together, and see the full effect of the choices you make.<strong>The Big Question: Should You Buy The Game?</strong><br/>Try before you buy. Even if everything I said sounds exactly like your kind of game, try the demo first. That’s what it’s there for. It gives you access to the first Chapter, consisting of 3 locations and about 30 quests split between mutually exclusive questlines and decisions.", "metacritic": 81, "released": "2015-10-13", "tba": false, "updated": "2024-01-24T22:47:42", "background_image": "https://media.rawg.io/media/screenshots/949/949a970eaf4304dfcbe33c29f77a01ef.jpg", "website": "http://www.irontowerstudio.com/", "rating": 3.83, "rating_top": 4, "added_by_status": {"yet": 78, "owned": 810, "beaten": 51, "toplay": 28, "dropped": 41, "playing": 3}, "playtime": 4, "achievements_count": 109, "ratings_count": 100, "suggestions_count": 502, "game_series_count": 0, "reviews_count": 100, "platforms": ["PC"], "developers": ["Iron Tower Studio"], "genres": ["RPG", "Indie"], "publishers": ["Iron Tower Studio"], "esrb_rating": null}