{"id": 105199, "slug": "hoverloop-pre-alpha-demo", "name": "Hoverloop Pre Alpha Demo", "name_original": "Hoverloop Pre Alpha Demo", "description": "<p><strong>Hoverloop is a Splitscreen Arcade Arena Combat game.</strong></p><p>In Hoverloop you will have access to an array of customizable drones, each with its own unique ability like Teleport, Deathray. Reverse Controls, Super Speed or Shield. You will have to fight against or work together with friends in splitscreen/online multiplayer, or you can play together with AI-Bots, in a variety of game modes such as Deathmatch, Team Deathmatch, Endless AI-Waves (Invasion), Battle Royale, Zombie Tag, Capture the Flag (Assault), and many more to come!<br/><br/><strong>So, the essence of the game: </strong><br/><br/>-Select and customize your drone, choose wisely as each drone has its own unique ability.<br/>-Add Splitscreen players to your game or choose to combat AI-Bots.<br/>-Pick your game mode, there will be a range of 10 game modes to choose from!<br/>-Choose your favorite Arena.<br/>-Game On!<br/><br/></p>Multiplayer<p>The core idea of the game is to bring gamers back together in their couch, sharing a snack and shouting battle cries at eachother!</p><p>We have up to 4-player splitscreen working at the moment. If you'd rather play by yourself, we have also implemented some AI-bots to play with. So each game mode can be played with a various mix of AI and human players.</p><p>Even the garage where you customize your drone, can be operated in splitscreen mode.</p><p>The plan for the future is to implement online play as well, but our main focus remains bringing gamers back together again.</p><p>Why? We strongly feel AAA-developers are moving away from splitscreen play because it gives them more processing power to create better graphics.</p>Game Modes<p>Upon release, we will have 10 playable game modes. So that the player can have some variation.</p><p>Currently we have 6 working ones, with or without splitscreen/AI-Bots.</p><p><strong>-Deathmatch:</strong> Is there any other gametype that's more familiar? You will be dropped into an arena, where you will have to shoot everything that moves while using your drone's unique ability. (with cooldown) The player with the most kills at the end of the match, wins.</p><p><strong>-Team Deathmatch:</strong> Exactly the same as Deathmatch, but here you can form teams!</p><p><strong>-Tag:</strong> Its like Zombie Tag, one player starts out as the tagger and has to chase other players and tag them. They will then also turn into a tagger. The game ends when everyone has been tagged, or the game timer runs out. (The untagged win)</p><p><strong>-Assault:</strong> Mash-up of genres. You will have to capture the enemy flag and retrieve it to your base, but before you can do that, you will have to disable the enemy shield that is blocking entrance to their base. How? Destroy their shield-generators!</p><p><strong>-Invasion:</strong> Endless AI-wave game mode. Each next wave will have more enemies in them. You can try and survive on your own, but its a lot more fun to do it in splitscreen with your friends!</p><p><strong>-Battle Royale:</strong> You will only have 1 life in this game mode, if you lose it, its over for you. Try to be the last man standing (or hovering?!) in the arena. If thats not hard enough, you will be tormented by the arena itself... Periodically, it will delete some parts of itself, it will force you into close quarters combat with your enemy towards the end of the game timer. If you fall off of the level, you will die as well!</p><p><strong>Four more game modes to be announced!</strong></p>Follow us on:<p>Facebook<br/>Twitter<br/>Site</p>We have been Greenlit by the community!<p>Hoverloop is planned for Q1 of 2018, for PC and Console. (Best played with controller!)<br/><br/>So its still a pre-alpha demo. Kickstarter coming in April!</p><p>You will need controllers to play in splitscreen mode. (It should work with all the mainstream controllers).</p><p>Player 1 has simple Keyboard &amp; Mouse support as well, for the sake of testing! (Navigate Menu's with the Arrow Keys, Enter &amp; ESC) </p>", "metacritic": null, "released": "2017-02-24", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/957/95722daa413f141acf743dabed1c6cd9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 211, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Hoverloop"], "genres": ["Action"], "publishers": [], "esrb_rating": null}