{"id": 1051, "slug": "ace-banana", "name": "Ace Banana", "name_original": "Ace Banana", "description": "VR games may cause some players to experience motion sickness.<br/><br/>A Shooting Gallery-style game, players must take up their bow and protect their banana stash against waves of monkeys coming to get them. Gameplay involves the player taking up the PlayStation Move controllers and mimic the movements shooting an arrow. Features a child-friendly cartoon style with cheerful graphics, Gameplay mode is solo play (with cooperative multiplayer coming out soon with up to four players fighting together). Compare your scores and compete for the rankings, with waves and waves of enemies are varied with huge Boss Battles occurring randomly. Player can look around with their VR Headset while aiming with their Move Controllers. Players are fixed in one position while being able to switch to various other locations in the game with their Rope.<br/><br/>PlayStation®Camera Required<br/>2 PS®Move controllers required<br/><br/>VR Games may cause some players to experience motion sickness.<br/><br/>1 player<br/>Offline Play Enabled<br/>PlayStation®VR Required<br/>PlayStation®Camera Required<br/><br/>  Software subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service &amp; playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.<br/><br/><br/>All trademarks referenced herein are the properties of their respective owners.", "metacritic": null, "released": "2016-10-13", "tba": false, "updated": "2019-08-02T16:25:25", "background_image": "https://media.rawg.io/media/screenshots/b90/b905fe0f28e6f9d59c12ba88bd4f71fb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 9, "beaten": 1, "dropped": 1}, "playtime": 0, "achievements_count": 32, "ratings_count": 0, "suggestions_count": 105, "game_series_count": 0, "reviews_count": 0, "platforms": ["PlayStation 4"], "developers": ["Oasis Games"], "genres": [], "publishers": [], "esrb_rating": "Teen"}