{"id": 105235, "slug": "infinite-golf-itch", "name": "Infinite Golf (itch)", "name_original": "Infinite Golf (itch)", "description": "<p>Simple, relaxing, addictive golf game with infinite amount of levels.<br/></p><p>In this arcade golf game, you'll never run out of levels to play, and always have fun. Playing this game gets you in a zen mode, helps you relax, and enjoy your time hitting balls into holes while listening to relaxing synth music. You'll end up feeling recharged.</p><p>This game doesn't waste your time with in-game currencies, psychological tricks, evil game design. It doesn't ask for your money. It doesn't have any ads.  There's no way for me to make money. There's no god. I'm starving here but trying to make you play this golf game.</p><p>Infinite Golf is challenging, with never-ending levels that get bigger in time, with new holes. This game is easy for casual players but it's also challenging for core gamers who want a good stroke-hole ratio. If you want to play like a pro, you can minimize your strokes by thinking and looking ahead. You'll find yourself calculating how to get the ball to the hole with less strokes. But if that's not your style, you can play the game casually and have as much fun.</p><p>Inspiration for this game came from Desert Golfing and Spelunky. The idea was to play Desert Golfing with Spelunky-like vertical level generation. We are quite happy with the result. Thanks a lot for playing, and we hope you enjoy your time with Infinite Golf.</p>", "metacritic": null, "released": "2016-02-20", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/972/97212aba6a6d2dc8016aa06c47fabff3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 28, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Android"], "developers": ["Kayabros"], "genres": ["Sports", "Platformer"], "publishers": [], "esrb_rating": null}