{"id": 105289, "slug": "serious-to-the-end", "name": "Serious to the End", "name_original": "Serious to the End", "description": "<p>\r\n\tOur narrator born in Hawaii meets a young college student who goes to the same school. He was practicing for the 10k marathon until the narrator saw the young girl crying. Her name is Aya, her trouble life is leading her to consider suicide or murder as an alternative to being happy. The story progress to more and more life changing events that happens almost everyday in the real world.\r\n\t\r\n</p><p>\n<br/>\n</p><p>\r\n\tSpecial thanks to konett for allowing the characters to be use for commercial use\r\n\t\r\n</p><p>\r\n\tCurrently the demo is out and it's free to play, however the full version will be used to help fund American Foundation for Suicide Prevention.\r\n</p><p>\n<br/>\n</p><p>\r\n\twww.afsp.org<br/>\n</p><p>\n<br/>\n</p><p>\r\n\tThe reason?\r\n</p><p>\r\n\tI too once thought about killing myself, the way I was bully and ignore it nearly made me do it. Thanks to the help of kind people around me, that part of me is gone but not all, I can control it which is a good thing. Building games have been one of the reasons that stop me from ending my life.\r\n</p><p>\r\n\tThank you for your support, the game was a fund raising for AFSP and while only 75 people ever download the game it still help. Total earning is $31.22 in over one year of the game publish date. I don't want people to think i'm not spending the money to AFSP, which is why the game will be free and will be available to android from this site or Amazon. Again thank you for everything and I will do more fund raising donations for many unseen organization.</p>", "metacritic": null, "released": "2015-05-13", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/cec/cec57aa8ded74471baa6a8aae16e2e89.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 176, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Android"], "developers": ["firecat"], "genres": [], "publishers": [], "esrb_rating": null}