{"id": 105234, "slug": "amalgama", "name": "AmalgamA", "name_original": "AmalgamA", "description": "<p>Simply connect the loose ends. It's mostly a game about exploring a computational space.<br/></p><p>I hope you find something of value here.</p><p>--------------------------------------------------------------------------------</p><p>A game based on cellular automata.</p><p>Endless Mode is the default way to play for most people (especially those unfamiliar with cellular automata). First steps.</p><p>Daily Mode is a more restricted Growth Mode with 15 levels. It always uses the same seed and grid size, but it chooses a new color-scheme and rule each day. This should give you an idea of how the rules may work, intuitively.</p><p>If you're feeling courageous, go for Growth Mode, where you have the most control and can explore at will!</p><p>Regarding Growth Mode, you should start by trying a few things, first:</p><p>-The seeds' symmetry defines the puzzle's symmetry. The simplest seed, (1) with a single colored cell in the center creates snowflake like pictures.</p><p>With this alone, you can explore quite a bit.</p><p>-Try even numbered rules (there's a more detailed explanation next but -- they essentially grow out, making better puzzles)</p><p>-Larger puzzles will have more interesting patterns and colors, so don't limit yourself to very small grids.</p><p>That should be enough for a start!</p><p>When choosing rules, use only the ones from the automata_rules textfile. Otherwise, you run the risk of the game looping through empty puzzles forever (and being dumped back to the menu). Also, don't edit it, it will ruin your life.</p><p>More info can be found on the I'MCONFUSED textfile.</p>", "metacritic": null, "released": "2016-09-29", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/c28/c28a824ca8df47b1173a928e3e898f83.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 81, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["Diogo Costa"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}