{"id": 105253, "slug": "tron-light-cycles-duel-2", "name": "TRON: Light Cycles Duel 2", "name_original": "TRON: Light Cycles Duel 2", "description": "<p>The computer; an extension of the human intellect.</p><p>The ENCOM 5-11: centre of the most calculating intelligence on Earth, programmed by Master Control to survive by all means. Now the ultimate tool, becomes your ultimate enemy in an old school epic Light Cycles Duel.</p><p>Based on the Tron movies this is basically a lightcycles game. The game features Turn AND Swipe controls. </p><p>Light Cycles are vehicles resembling motorcycles that are driven by programs in the Game Grid. Upon being rezzed in by a program's rod, a light cycle completely covers the driver - who is forced into a riding position - with a protective canopy. Each Light Cycle is colored according to the color of the rod that generated it.</p><p>On the Grid designed for them, light cycles are incredibly fast when moving, and leave behind a solid jetwall in their wake. They move in straight lines and only turn in 90° angles. With their brakes disabled, this creates a hazard whereby one light cycle could be forced to crash into the jetwall of another, causing the victim to derez along with their light cycle.</p><p>Can you beat the computer or another player in a Light Bike duel?</p><p>Features single and two player modes! For Free!</p><p>- Human VS Computer<br/>- Human VS Human (two players on one device!)<br/>- Human VS Computer VS Human<br/>- Human VS Computer VS Human VS Computer (two players on one device!)</p>", "metacritic": null, "released": "2015-08-27", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/7bf/7bf4d12d5881fe8009aa08f847e02f4f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 129, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Sander Voorn"], "genres": ["Action", "Racing"], "publishers": [], "esrb_rating": null}