{"id": 105349, "slug": "contractual-hero-a-talky-rpg", "name": "Contractual Hero: A Talky RPG", "name_original": "Contractual Hero: A Talky RPG", "description": "<p>The player takes the role of Ezt, a retiree who is legally obliged to go back to work as a hero due to some contractual anomaly enforced by magic. With no combat abilities, Ezt must overcome typical fantasy RPG heroic situations using only their social skills. The Tactical Discussion System gives the player freedom to apply Ezt's skills in many and varied ways, uncovering information from opponents and persuading them to help solve Ezt's quests.</p>\n<p>Contractual Hero features:</p>\n<ul><li><strong>Versatile Social \"Combat\"</strong> - The core of Contractual Hero is the versatile and rewarding social \"combat\" system - the Tactical Discussion System (with fifteen unique Skills!). It is \"combat\" because the two sides involved in a discussion may not be at odds with each other, but the player may still have certain goals to achieve.</li><li><strong>Diverse Character Representation</strong> - There is an issue with the representation rates of certain social groups in video games, with many drastically under-represented and males, whites and adults drastically over-represented. I made a design choice to not add to this issue by making all characters in the fantasy world of Contractual Hero of indeterminate gender, sex and race while still being recognisably humanoid.</li><li><strong>Fantasy RPG Tropes</strong> - Fantasy role-playing games often have very violent stories presented in a very matter-of-fact manner. If there's a dragon in a castle, the goal is to kill it and everything else you come across along the way. I want to prompt players to look at these tropes slightly differently by having them approach situations typical of fantasy games but with an inability to fight and kill to solve their problems.</li></ul>\n<p>Please be aware that this is a prototype and as such there are missing and incomplete features. You can play around with the Tactical Discussion System a fair bit, though. So have fun with that.</p>\n<p>Feel free to download and have a digital flick through the Design Document, too. It covers some of the design decisions and more deeply explains some of the gameplay. It also points towards how the prototype could be developed into a full game and which features I would include.</p>", "metacritic": null, "released": "2015-09-29", "tba": false, "updated": "2019-01-22T15:34:31", "background_image": "https://media.rawg.io/media/screenshots/d38/d382806beb553fd36a8544f3541009b7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 114, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "Web"], "developers": ["Mighty CheBo"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}