{"id": 105462, "slug": "handsy-demo", "name": "Handsy! (Demo)", "name_original": "Handsy! (Demo)", "description": "What is Handsy?\r\n<p>For one thing, it's a demo. Let's make that clear. It's incomplete, a little buggy and there are definitely plenty of features missing. But this is a demo with <em>panache, </em>my friend!<br/><br/>Oh and here's the other thing: <strong>This is the first game we have ever made. </strong>Kind of. The actual first game was this one: Handsy v1. We made that at our very first game jam, Como Game Jam II. Going into the jam, we had never used Unity or programmed in C# before, so it was a learning experience. After it ended, we couldn't help ourselves but to keep working on our favorite little severed hand!<br/></p>\r\nThe Story\r\n<p>Handsy is the severed hand of a corpse. During a reanimation ritual that involved a magical bracelet being placed on the wrist of the dead body, the hand was inexplicably severed. Thus Handsy was born of flubbed reanimation magic! The host body remains un-undead. RIP.</p>\n<p>So what is a newly-conscious disembodied hand to do in a world of magic and whimsy? Platforming! Puzzle-solving! Exploration! Combat! We envision this game being a rather large 3d platformer. What we have created so far is a first go at a hub world (but we've put a few fun things to do in it).</p>\r\nTime-Traveling Grave Portals\r\n<p>Okay, these aren't in <strong>yet</strong>, but they are gonna be cool. We already told you we have hub world - it's full of graves. Handsy's magical bracelet is going to let him open portals in theses tombstones and travel to different worlds. And whatever time period in which the grave's resident was alive... <em>that's where Handsy travels to when he goes into the portal!</em> We have ideas for a middle ages world, 1960s hippy-van world, ancient Egyptian pyramid world... the possibilities are endless!<br/></p>\r\nGameplay\r\n<p>There are 10 coins to collect in this demo. You can collect them or you can just explore, it's up to you. There is double-jumping (space bar) and dashing (left alt) for moving around the world. Finding all 10 coins is going to take a bit of problem solving, but if you do it, you get to check out a huge volcano island! Super cool!</p>", "metacritic": null, "released": "2018-01-16", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/979/97954667f66666f9db962deefbae6fff.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 129, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Virtuous Reality Games", "rmhibbs", "owlhowell"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}