{"id": 105435, "slug": "captain-disaster-in-the-dark-side-of-the-moon", "name": "Captain Disaster in: The Dark Side of the Moon (itch)", "name_original": "Captain Disaster in: The Dark Side of the Moon (itch)", "description": "<p>Sleep walking through an open StarGate isn't the best of ways to end up on a distant moon, especially when the StarGate closes behind you before you wake up. This is the position that the intrepid Captain Disaster finds himself in - not all, however, is as it seems; there is a greater purpose at work here.</p>\n<p>With innumerable references to classic adventure games, science fiction and of course Pink Floyd, <strong>Captain Disaster in \"The Dark Side of the Moon\"</strong> is a freeware, fully-voiced, light-hearted point and click adventure game which will exercise both your grey matter and funny bone. It's the first full adventure game to feature the Captain Disaster character, who will star in <strong>Captain Disaster in:  Death Has A Million Stomping Boots</strong> from December 2017 onwards!</p>\n\n<p>Should run okay on any modern (and even most ancient!) Windows PC.    Should run on Linux/Max under WINE emulation but I can't make any promises.</p>\n<p>I also accept no responsibility for any mental conditions you may pick up as a direct or indirect result of playing this game.</p>\n\n<p>The short story based on this game (with some added bits) is <strong>available as an eBook on Itch in PDF format</strong>.   Also available is another standalone short story, <strong>Captain Disaster: The Damaris Touch</strong>.</p><p>Epic pointy and clicky adventures can be had in the commercial game<strong> Captain Disaster in: Death Has A Million Stomping Boots.</strong></p>", "metacritic": null, "released": "2017-12-06", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/baf/baf4466e89c6fdae290fe08eda0af4fe.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 178, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["CaptainD"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}