{"id": 105493, "slug": "bicephal-nightmare", "name": "Bicephal' Nightmare", "name_original": "Bicephal' Nightmare", "description": "<p>Bicephal' Nightmare is not just a shooter. It's two shooters at once for one player !<br/>Control two ships, avoid asteroïds from two sides of screen, destroy enemies to pass to more difficult levels.</p>\n\n\n\n<p>The game is hard, very hard ! but you don't have to be a shooter pro-esport player to play it because it starts with the basics and just makes them harder. Bicephal' Nightmare is only based on your abbillity to do two things at once. First levels are here to let you learn how to split your mind and guide each eye separately .<br/>The only gear you need is a gamepad or a keyboard, or both if you break things when you are angry...<br/><br/></p>\n\n<br/><br/>\n<p>This is the first game of a 4 Belgians friends group who made it during their free time, this game gives you an infinity of levels to prove that you're the best !</p>\n<p>You can play Co-op too ! It's the same gamemode as for one player but it is easier because you don't have to focus on the two sides of the screen. Still, be careful, if your friend has the trigger-happiness-sickness, it might end the game by destruction.<br/><br/></p>\n\n\n<p>In the arcade game mode, you really have to focus. There are black holes, mini-bosses, asteroids walls and more ! This is the mode you have to play if you want to devlopp an addiction for moving your head left-right/up-down very fast.</p>\n<p>We sincerely hope you will enjoy our game and do not hesitate to post and send us your score, we will gladly judge your life.</p>\n<p>Find your way between asteroids to become the best pilot of all time !</p>", "metacritic": null, "released": "2018-03-14", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/569/569663826a236e83da55e5827ed68bb3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 27, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["Gredu"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}