{"id": 105599, "slug": "gravecamp", "name": "GraveCamp", "name_original": "GraveCamp", "description": "<p>\r\n\tWelcome to \r\n\t<strong>GraveCamp</strong>, detective.\r\n</p><p>\r\n\tMy, you look weary - please, rest.\r\n\t<br/>\n</p><p>\r\n\tIn the morning, Leo the Gravedigger can bring you to the water source and, hopefully, you can see what's wrong with it. You've had a long journey from Brain City...I know the graves are unnerving, but please, stay the night at the inn...oh?\r\n</p><p>\r\n\tYou refuse to pay an inn when you can sleep under the stars? Ho ho ho...well, get used to sleeping above the grave maggots...!\r\n</p><p>\r\n\tYou see, detective, GraveCamp is where the dead can truly rest - as burial has gone out of public fashion, GraveCamp is devoted to giving the deceased the rest they deserve.\r\n</p><p>\r\n\tHow many graves are there, you ask? Over ten million. Did you try counting them on your flight?\r\n</p><p>\r\n\tLeo? He's probably drinking himself at the cafe - he's kind of an oaf, but boy, those biceps...!\r\n</p><p>\r\n\tYes, the water has stopped. Deep in the cemetery, you will be able to access the water source. It draws in water from the surrounding sea and cleans it. GraveCamp is mostly self-reliable, detective.\r\n</p><p>\r\n\tAm I boring you? Please, rest...close your eyes...you have a long journey tomorrow~</p><p>\"GraveCamp is [...] The Merzbau of RPG Maker games.\" - Robin's friend</p><p>\"Very morbid and unusual game. At first, the visuals looked really ugly to me and the repetitive tones of the music had me reaching for the volume down key. I can't say the music grew on me but the visuals were unique enough and after awhile felt fitting for the game. I get the impression it was going for a gameboy vibe which it doesn't quite achieve. I found the unique setting and quirky characters engaging.\" - IGMC Judges</p><p><strong>Last update: November 7, 2016 : )</strong></p>", "metacritic": null, "released": "2015-08-06", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/209/20968ef9feb2491d9135b77303c1dabd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 113, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["nilson"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}