{"id": 105635, "slug": "jugular-rpg-maker-horror-short", "name": "Jugular (RPG Maker Horror Short)", "name_original": "Jugular (RPG Maker Horror Short)", "description": "<p>08/09/2009<br/>  That Tylam Family, they're hiding something disgusting, something vile. Makes me question what the human race is anymore. They haven't left the confines of their dilapidated property in ages.<br/><br/>08/13/2009<br/>   I saw the man who lived there leave the house with a black garbage bag. It was leaking something. I couldn't see what the liquid was, it was night. But he sure as hell was trying to make sure that liquid was cleaned off the face of the Earth. Those people don't even pay their bills, they got an eviction notice plastered to their door.<br/><br/>09/16/2009<br/>   Turns out a woman named Candace went missing around the same time Mr. Tylam took the \"trash\" out. Could he have really killed someone? No, unlikely. We haven't seen anyone go in there and we watch them like hawks.<br/><br/>10/28/2009<br/>   A cop came today to take the Tylam family out and 5 minutes later, like 20 gunshots were fired! A couple ambulance came and carried out 4 body bags in stretchers.....two of them were small. What in god's name was that cop thinking?!<br/> <br/>07/13/2014<br/>   The Tylam home has been abandoned for years and yet people still manage to die there.<br/></p><p>*Please note that the music and graphics used herein are subject to fair use IF the work provided is NOT for commercial use and IF it does not infringe upon the original creator's market.</p>", "metacritic": null, "released": "2016-08-10", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/692/6920645baf8a0af6272e14e385b5e4fc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 232, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Jeremy Perkins"], "genres": [], "publishers": [], "esrb_rating": null}