{"id": 105663, "slug": "dont-fear-the-sweeper-gmtk-jam", "name": "Don't Fear The Sweeper - GMTK Jam", "name_original": "Don't Fear The Sweeper - GMTK Jam", "description": "<p><strong>Made for the GMTK Game Jam</strong></p>\n<p>Don't Fear the Sweeper is a game about being a chimney sweep in the 1850's. However, the chimney you sweep for money is popular among fellow sweeps. Your job, is to sweep them and clean a fourth of the chimney to earn money.</p>\n<p><strong>Obligatory Features list: </strong></p>\n<p>- The music is sung by your character!</p>\n<p>- You can sweep things!</p>\n<p>- You can get an pneumonia from soot!</p>\n<p>- You can die in a fire at the bottom of said chimney!</p>\n<p>And so little more!</p>\n<p><strong>Things Specifically for the jam:</strong></p><p>My game follows the theme as sweeping not only cleans the chimney, but kills enemies as well. As you get hit, you are getting more and more sick till you die, but if you get close to death, you get bonus money as the people who pay you give you money out of sympathy, so less health, means more money. Otherwise as it is a video about Downwell, my game plays similarly to Downwell, as you fall down a large hole and kill enemies and are encouraged to move fast.</p><p><strong>FaQ (Not really, no one has asked questions)</strong><br/></p>\n<p>Q: Why does the background not work?</p>\n<p>A: I was running out of time to figure out how to make it look okay</p>\n<p>Q: Why do enemies spawn in the ground</p>\n<p>A: This is a two part-er, The real reason, is because of a bug I couldn't figure out, but the REAL real reason is in the lore of the world, some sweeps, are idiots.</p>\n<p>Okay great, were done there.</p>\n<p>I know there are bugs, if you encounter any game braking ones, just hit R.</p>\n<p>Although the tutorial is in the game file here it is on the project page, I know I am impressed as well:<br/></p>\n<p><strong>Tutorial</strong></p>\n<p>Press the left and right arrow keys for left and right.</p>\n<p>Press Up to Jump.</p>\n<p>Press Z to sweep.</p>\n<p>Hold Any arrow key and press z to sweep in that direction.</p>\n<p>Press Up and the right or left keys to jump off a wall, assuming you're on a wall.</p>\n<p>While Under a ledge, hold up to grab onto it and go off the side of the ledge to climb up, that ledge.</p>\n<p>The number on top of the screen (and other numbers) is the total amount of soot in the chimney.</p>\n<p>The number below that and on the right is how much soot you need to clean to be paid and to the left is how much soot you have already cleaned.</p>\n<p>If the total amount of soot isn't enough for you to make money, you lose.</p>\n<p>In the bottom left hand corner is effectively your health, but like in super smash bros, as, when you get sweeped, you get soot in your lungs and you chance of death increases until 100 and then you die.</p>\n<p>Oh, the owners of the chimney are super irresponsible and left a fire going, so if you fall into it you'll die. Just thought you'd like to know.</p>\n<p>I Probably forgot something but you'll figure it out, you're the player. Or Mark Brown. I guess, he'd be considered a player as well. </p>\n<p>BYE!</p>", "metacritic": null, "released": "2017-07-17", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/f88/f884a4e0b646b9d1b39c42a78f4b10b7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 39, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["John Clark"], "genres": ["Action"], "publishers": [], "esrb_rating": null}