{"id": 105623, "slug": "matchy-matchy", "name": "Matchy Matchy", "name_original": "Matchy Matchy", "description": "<p>\n<strong>MATCHY MATCHY</strong><br/>\r\n\tinstructional booklet\r\n\t<br/>\n<br/>\r\n\tWelcome to MATCHY MATCHY, the puzzle game of animal love.\r\n</p><p>\n<strong>CONTROLS:</strong>\n</p><p>MATCHY MATCHY is played using a mouse<br/>\n</p><p>LEFT CLICK - confirm selection (in menus), make a match (in game), quit game (in pause menu)\r\n\t<br/>\r\n\tRIGHT CLICK - back (in menus), pause game (in game), resume game (in pause menu)\r\n\t<strong><br/>\n</strong>\n</p><p>\n<strong>HOW TO PLAY:</strong>\n</p><p>\r\n\tConnect pairs ( or more ) of matching animals to solve puzzles, get points, and make love not war.\r\n\t<br/>\r\n\tTo make a match, move the cursor so that at least 2 matching animals are directly above, below or to the side of the cursor, then press O (Z on keyboard). Matching more than 2 animals yields more points:\r\n</p><p>\r\n\tPair ( 2 of a kind ) = 10 pts\r\n\t<br/>\r\n\tLove triangle ( 3 of a kind ) = 20 pts\r\n\t<br/>\r\n\tDouble date ( 2 pairs ) = 30 pts\r\n\t<br/>\r\n\tLove rectangle ( 4 of a kind ) = 40 pts\r\n\t<br/>\n<br/>\n<strong>GAME MODES</strong><strong>:</strong><br/>\n<br/>\r\n\tThere are two modes, the relaxed PUZZLE mode and the hectic TIME ATTACK mode.\r\n</p><p>\r\n\tPUZZLE mode - The aim is to try to clear all the pieces form the board so that no animal is left behind. You don't have to clear the entire board to unlock the next level, though. There are 35 levels in total. Can you clear them all? This mode encourages forward thinking and careful planning. Beware of making Love Triangles as this might leave an odd number of animals behind.\r\n</p><p>\r\n\tTIME ATTACK mode - The aim is to play as long as possible and get the highest score. As you play, new pieces are added to the board, faster and faster. If you run out of valid moves, several pieces will get added to the board at once! Also any wrong move will be punished by an extra piece.\r\n\t<br/>\r\n\tWhen you clear enough of the board with no moves left, you will level up. Levelling will generate a new board and slow down the timer a bit. The game is over when you run out of space on the board. This mode encourages quick thinking and changing strategy on the fly.\r\n\t<br/>\n</p><p>\n<em><strong>DISCLAIMER:</strong></em>\n</p><p>\n<em>The author deeply regrets that due to gameplay considerations MATCHY MATCHY is not representative of inter-species love. The author acknowledges that love knows no limits and no man, animal, machine, deity or other entity should attempt to impose such limits.</em>\n</p><p>\n</p>", "metacritic": null, "released": "2016-08-06", "tba": false, "updated": "2019-08-28T23:24:44", "background_image": "https://media.rawg.io/media/screenshots/f7f/f7f16f662a3c1b60f1c263e43fde74dd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 38, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["iLKke"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}