{"id": 10570, "slug": "a-tech-cybernetic", "name": "A-Tech Cybernetic", "name_original": "A-Tech Cybernetic", "description": "A-Tech Cybernetic is a visibly beautifully elaborated sci-fi game taking place at external and internal venues, whereby players are exposed to such effects and impacts, which are not possible for a human being to experience in real life without any dangers. The enemy consists of robots created by the humans, which are very realistic-looking enemies with an unbelievably detailed finish.<br/><br/>While preparing our game, we put emphasize on that it shouldn’t be “another wave shooter”, but a real challenging creation, in which the accomplishment of each new level will be a real feeling of success. Besides this, as part of an interesting and exciting story, you can discover the secret of the A-Tech Cybernetic, in which the sense of thrill and fear are guaranteed. <br/><br/>Our game is developed exclusively for VR platforms, exhausting all the possibilities to make you feel as if you were on another planet, but still in the reality. Our commands are adjusted to this as well, to make it as life-like as possible, be it physical fighting, shooting or pulling your bow. <br/><br/>Firstly only the Swarm mode can be accessed. You will have the chance to liquidate the enemies raiding on you! Take possession of the weapons in your surroundings, and try to survive as long as possible! Pistols, machine-guns, shotguns and several other weapons will be at your disposal, to become the hero of A-Tech! But beware, if you run out of ammunition, you can only count on your fist! :) Collect as many points as possible!<br/><br/><strong>Features</strong>:<br/><br/>•\t<strong>Elaborately detailed, innovative graphic design:</strong> <br/>            o\tWe are striving to elaborate virtual reality and shooting to a new level with the A-Tech Cyberntic. For this, we created such a visual world, which you have never seen in any other VR game! <br/>•\t<strong>Life-like armament:</strong> <br/>            o\tUse the VR tools as if they were real weapons! Pull the bow, aim with the pistol, and fight just as if you were in reality!  <br/>•\t<strong>Challenge! </strong><br/>            o\tWe experienced in several VR games, that there is simply no challenge in them, and no matter what, you always win at the end. We guarantee that in our Swarm mode we will really make you sweat, and achieving every higher level in the game will be a real experience of success for you! :)<br/>•\t<strong>Bullet-time:</strong> <br/>            o\tWe all like to liquidate our enemies in a very spectacular way. The Bullet-time provides an excellent tool for this!<br/>•\t<strong>Explosive barrels!</strong><br/>            o\tEvery now and then you get explosive barrels to ease your fight against the swarms! <br/><br/><strong>Future release plans for the Game</strong><br/><br/><strong>Step 2. March - May (Future) </strong><br/><br/>If One level was not enough, then we raise the stakes! We expand our repertoire with an additional level, and many more weapons. More levels, more weapons, even more fun :) <br/><br/><strong>Step 3. Jun-Jul. (Future) </strong><br/>Swarm mod was only the beginning! During the 3-4 hours’ long Story mode you can reveal the secrets of what happened to Earth, and what did the A-Tech Cybernatic do to humans! But be careful, for there are new dangers lurking for you on every corner. In the story mode, you will find every single element required for a proper horror game. Save our world from chaos, Be our hero All IN VR! <br/><br/><strong> After the story mode. (Future) </strong><br/><br/>Multiplayer and Co-op mode ;)<br/><br/><strong>Features coming soon</strong>:<br/><br/>•\t<strong>Story mode: </strong><br/>            o\tIn our Story mode you will find all kinds of tools which are necessary for you to really feel like being in a real horror game. With atmospheric ambience.<br/>•\t<strong>Puzzles: </strong><br/>            o\tAre you fed up with the brainless shooting VR games? Do you miss creative solutions and puzzle tasks to be solved from them? Then you won’t be bored in our story mode.<br/>•\t<strong>Traps, traps and traps! </strong><br/>            o\tAre you in big trouble? Place new traps; to make the job of your enemies as difficult as possible!", "metacritic": null, "released": "2017-03-15", "tba": false, "updated": "2022-10-01T23:55:06", "background_image": "https://media.rawg.io/media/screenshots/94b/94be41cd69630e96169ef4a349ef8c3e.jpg", "website": "http://xrealgames.com/a-techcybernetic", "rating": 2.88, "rating_top": 4, "added_by_status": {"yet": 15, "owned": 275, "beaten": 1, "toplay": 1, "dropped": 2, "playing": 1}, "playtime": 1, "achievements_count": 56, "ratings_count": 8, "suggestions_count": 469, "game_series_count": 0, "reviews_count": 8, "platforms": ["PC"], "developers": ["XREAL Games"], "genres": ["Action", "Indie"], "publishers": ["XREAL Games"], "esrb_rating": null}