{"id": 10575, "slug": "the-shrouded-isle", "name": "The Shrouded Isle", "name_original": "The Shrouded Isle", "description": "As the high priest, uncover and purge heretics to prepare for the awakening of your beloved god beneath the waves.<br/><br/><br/><br/><ul><li>Villagers with secret, randomly assigned virtues and vices create a different strategy every time.<br/></li><li>Manage your resources without angering your allies. <br/><br/><br/></li><li>Carefully choose who to serve as your advisors, as one of them must be your sacrifice at season’s end.<br/></li><li>Watch your advisors carefully to deduce their possible virtues and vices.<br/></li><li>4 different colour schemes available.<br/><br/><br/></li><li>Rename villagers at whim, and thereby sacrifice simulacrums of your friends, family, or followers.<br/><br/><br/></li><li>Search out the true heretics with unforgivable sins, to quiet the voices in your dreams.<br/></li><li>Can you survive all three years, and meet your Lord’s expectations of purity? <br/><br/><br/></li><li>Find all six cinematic endings.</li></ul><br/><br/><br/>For the past 497 years, a secluded island village has adhered to bloody yet sacred traditions. They speak of a sleeping God beneath the waves, whose awakening shall birth a new era for the worthy.<br/><br/>In this cult manager, there are sinners aplenty, and not all are eager to confess. Each member of your community has 2 hidden traits - one virtuous, one heretical. If you’ve earned the favor of their House, you may investigate their reputation. Otherwise, you may appoint them to your seasonal council and watch their work for clues.<br/><br/>Five powerful aristocratic families help maintain the village, seeking salvation through book burning, monument building, and heretical investigations. Choose one advisor from each family to assist in their ancient appointed task. However, every season, you must make the ultimate choice, designating a human sacrifice.<br/><br/><br/><br/>Closely examine your citizenry to find the best strategy for your people and beliefs, knowing that nobody wants their child sacrificed, even for the greater good.<br/><br/>When our Lord awakens, will He find you worthy?<br/><br/><br/><br/>The five families of The Shrouded Isle each supervise a different aspect of the community. Be cautious, as their loyalties are fickle as the tide.<br/><br/><br/><br/><ul><li>House Kegnni manages the farmlands of the village, and is charged with protecting the sacred ignorance of the community. Matron Kegnni trains her sons and daughters in the art of book-burning, erasing any trace of the old world and its many sins.<br/></li><li>House Iosefka are the village builders, using carpentry and masonry to create grand structures that ensure our Fervor may never be extinguished. Adjudicator Iosefka has designed a variety of monuments over the years, and is said to favor pyromaniacs, as their ritual fires burn brightest.<br/></li><li>House Efferson are the judges of our souls, wielding the whips that punish sinners and ensure Penitence. To confess to Vicar Efferson is to discover the newest and most effective flagellation techniques to appease our Lord.<br/></li><li>House Cadwell carefully count the wealth of the village, made up primarily of merchants and miners, and enforce Discipline. Lord Cadwell and his sons and daughters scour the village for forbidden delights that might distract from prayer and (we trust) dispose of them appropriately.<br/></li><li>Everyone in the village dreads House Blackborn, the guards and enforcers of Obedience. Stories abound of the dungeons of Inquisitor Blackborn, but lawful, peace-keeping citizens have nothing to fear.</li></ul>", "metacritic": null, "released": "2017-08-04", "tba": false, "updated": "2024-04-09T09:23:54", "background_image": "https://media.rawg.io/media/screenshots/a8c/a8c8cf05e16b29bb86508d37f71c1b38.jpg", "website": "http://www.kitfoxgames.com/shrouded-isle/", "rating": 2.89, "rating_top": 4, "added_by_status": {"yet": 68, "owned": 810, "beaten": 22, "toplay": 17, "dropped": 22, "playing": 6}, "playtime": 3, "achievements_count": 16, "ratings_count": 55, "suggestions_count": 166, "game_series_count": 0, "reviews_count": 56, "platforms": ["Nintendo Switch", "macOS", "PC"], "developers": ["Kitfox Games", "Tanya Short", "Erica Lahaie", "Jongwoo Kim", "FX Bilodeau"], "genres": ["Simulation", "Indie"], "publishers": ["Kitfox Games"], "esrb_rating": null}