{"id": 105736, "slug": "ocarina-of-vive-shooting-gallery", "name": "Ocarina of Vive - Shooting Gallery", "name_original": "Ocarina of Vive - Shooting Gallery", "description": "<p>Taking place in the Legend of Zelda timeline where the Hero of Time defeats Ganondorf, grows up, has a mid-life crisis because no one knows that he saved Hyrule, and decides to buy his own shooting gallery*, now you can shoot rupees to your hearts content--<em>in VR!</em></p><p>This game was made in one week for my college's New Media summer course's 3D project. It still needs a little polish, but it's playable in its current state. I'm planning on adding score keeping, more challenging modes, and more interactive items and targets later on. In the meantime, enjoy a couple minutes of nostalgic bow and arrow action!</p><p>A play area of at least 2m x 1.5m is recommended, but can also be played standing or sitting.</p><p><strong>Controls:</strong></p><p>Trigger: Pick up object. Bow/arrows can be used left or right handed. Object stays in your hand until you pull trigger again.<br/></p><p><strong>Instructions:</strong></p><p>To start the game, pick up an arrow from the table in front of you. The minigame will start as soon as you pick one up.</p><p><strong>Disclaimer:</strong></p><p>Scenario, textures, models, and sound effects are a property of Nintendo Co., Ltd.</p><p><strong>Credits:</strong></p><p>/u/TheStone Fox for providing the open-source VRTK framework for Vive controls.</p><p>* - As scribbled on a sticky note inside my copy of Hyrule Historia</p>", "metacritic": null, "released": "2016-06-24", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/988/98864c1a39eca7e1c04a64f56b982a54.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 93, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["CTNeptune"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}