{"id": 105833, "slug": "card-battle-prototype", "name": "Card Battle [Prototype]", "name_original": "Card Battle [Prototype]", "description": "<p>Gaming went from a past-time to a pay-per-view event in the time of only a few years. Skip ahead about twenty years and stadiums were created where people would play out arcade games in the real world.</p><p>Motorcycles were used in a game of snake eats snakes, football fields turned from their grassy well-kept state to augmented realities depicting war zones, and everyday actions became quests. Life became a game.</p><p>Traditional gaming however never went away. People still got together to play card and board games. These became somewhat of a mini-game to everyday life. If you had a dispute, you'd settle it over a game of cards. </p><p>Then a company emerged. GSM Technologies.</p><p>They were late into the industry of augmented entertainment. But the sport they created would captivate the world.<br/></p><p>Now it's time for you to discover Card Battle.</p><p> Everyday combatants step into the arena to partake in gladiator-style combat utilizing the advanced technology of reality bending decks of cards. </p><p>When in the arena it's common to see duelists summoning swords, shields, granting themselves extraordinary abilities, and even summoning monsters as if in a world of fantasy!</p><p>Card Battle takes traditional card gaming to the next level where both deck management and real world physical ability meets!</p><p>\n</p><p>Card Battle is being developed by a solo-developer trying to make it as a full-time developer. And in all honesty, Card Battle will be a costly project that will require a decent amount of quality art. </p><p>Therefore, all donations to the game will be put into an art fund solely for this project. Once enough has been raised, I will attempt to find an artist willing to work on enough artwork to have a polished demo. <br/></p><p>With that demo we would then bring Card Battle to Kickstarter to afford the remaining art assets. </p><p>I don't know if that day will ever come, that'll be up to you all. I hope you find the game worth giving a few dollars towards.</p><p>If you would like to follow along with the development of the prototype you may view the Trello page or even join my development Discord!</p>", "metacritic": null, "released": "2016-12-12", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/4bf/4bf4f3ac84b20bd2ecd3e2df8d8e533b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 89, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Fishagon"], "genres": ["Action", "Fighting"], "publishers": [], "esrb_rating": null}