{"id": 105871, "slug": "as-if-demo", "name": "As If [demo]", "name_original": "As If [demo]", "description": "<p><strong><strong>As If is a first-person story driven narrative game, designed to portray the issues revolving mental health. Packed with artistic symbolisms and realistic grits, As If offers an experience of walking in the shoes of those who face mental health issues. Play as Matthew, who struggles to achieve his dreams and ambitions, only to see them crumble when the voices shut his mind.</strong><strong>The demo opens with sets of abstract spaces that symbolize the feelings of the characters. Enjoy your steps and your surroundings before you finally get into our portrayal of Matthew’s world.</strong></strong></p>\n<p>As If takes you into the shoes of Matthew, a bright boy with promising future who have all the supports that he wants; a loyal best friend, a loving mother, and a father to look up to. His life is very simple and easy right before he starts to feel uneasy all the time. Apparently, there are voices with messages, telling him pieces about himself that he starts to believe.</p>\n<p>Schizophrenia slowly pulls Matthew further away from the life he loves. He starts to doubt the pieces that he used to like. Schizophrenia takes him away from his best friend, turns his mother into a stranger, and makes his father someone he avoids. Schizophrenia forces Matthew to believe what the voices telling him to do, even if they exist only inside his head. </p>\n<p>Everything crumbles as if Matthew doesn’t have any control of his mind anymore. As if he can’t differentiate between the reality and fantasy.</p>\n<p>The demo consists of the first act of the story and we are currently on the process of developing the whole game which will have 5 acts in total. Any support will be greatly appreciated :)</p>\n<p>Andreas Andika - Technical Director</p>\n<p>Chandrika N.D. - Art Director<br/></p>\n<p>M. Irfan Permadi - Lead Programmer<br/></p>\n<p>Mira Wardhaningsih - Lead Writer<br/></p>\n<p>Rolly Anwari - Audio Designer<br/></p>", "metacritic": null, "released": "2018-01-26", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/2af/2af259b0a8f506c6269e1a9d0f5d584d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 155, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["StoryTale Studios"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}