{"id": 105873, "slug": "take-your-pills", "name": "Take Your Pills", "name_original": "Take Your Pills", "description": "<p>You are desperate, unemployed, ugly, talentless and, above all, broke.  In your darkest hour, you turn to your only available avenue for income: enlisting in a shady underground government clinical trial.  Can you withstand the chaotic side effects of the experimental pills and come out slightly less broke and maybe even alive?</p>\n\n<p>Take Your Pills is a puzzle game, in which the player must venture through randomly generated mazes containing traps and enemies, whilst taking a variety of pills in order to unlock the exit.  As each trial is completed, more and more pills are required to advance with the combination of accumulated side-effects making each maze trickier than the last. <br/></p>\n<p>Will you be able to survive all 10 trials and make your mark on the global high-scores? \r\n  </p>\n<p>Or will you fall, just another failed test subject?</p>\n\n<p><strong><em>Instructions<br/></em></strong></p>\n<p>Gather enough pills to open the exit and get out.</p>\n<p>Rinse and repeat until you've escaped all 10 trials.</p>\n<p>Simple.<br/></p>\n<p>After taking a pill, if you believe you know what side-effect it has, you may also mark this pill with an icon in order to remind yourself of its side-effect when it crops up in the future. While doing so has no direct influence on gameplay, it can greatly help make tactical decisions in the future, in regards to which pills to take first, and which pills to stay well away from.</p>\n<p>Best of luck, and don't forget to not die.<br/></p>\n<p><em><strong>Controls</strong></em></p>\n<p>Movement: Arrow keys/WASD/either Xbox Joystick/D-Pad<br/></p>\n<p>Mark Pill: Space/Right Click/Left Bumper</p>\n<p>Toggle selected pill: Movement Up/Down</p>\n<p>Toggle selected mark: Movement Left/Right/Mouse Pointer/Xbox Joystick<br/></p>\n<p>Cancel Mark Pill: Escape/Left Click/ B</p>\n<p>Submit: Return/A<br/></p>\n<p>Pause: Escape/Start</p>\n\n<p><em><strong>Credits</strong></em><br/></p>\r\nDavid<br/>Hubber<br/>Game Design &amp; ProgrammingSebastian<br/>Parfitt<br/>Game Design, Programming \r\n&amp; Audio<br/>Original Ludum Dare 40 Team<br/>Sebastian Parfitt, David Hubber, \r\nVadym Strelchenko, Julian Geheeb, \r\nDavid Madl<br/>Special Thanks to<br/>Chelsey Waldeck, Ludum Dare, \r\nGames Bavaria , Werk 1 &amp; Unity\r\n\n<p><strong><em>Changelog<br/></em></strong></p>\n\n<p><em>b1.2.2<br/></em></p>\n<ul><li>Online highscores no longer allow duplicate names</li><li>Each mark may now only be applied to one pill, with previously marked <br/>pills being umarked when their mark is applied to a different pill</li><li>Added online lowscores to compliment the online highscores and provide positive, wholesome motivation to struggling players</li><li>Game will now automtically check for updates on main menu</li><li>Added sound to pill wheel</li><li>Fixed central pill marking icon from sometimes not disapearing when the marking wheel is closed</li><li>Prevented ghost enemies pill from spawning in first level</li></ul>\n<p><strong>View all past updates</strong>\n<br/></p>", "metacritic": null, "released": "2018-05-04", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/f65/f65274db799886bac66757c01a92134b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 158, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Shy Tea Games", "sergamer"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}