{"id": 105998, "slug": "vault-raiders", "name": "Vault Raiders", "name_original": "Vault Raiders", "description": "<p><strong><em><em>\"...legends speak of a colossal maze that extends deep underground, \"Matmurah\", this bullet hell fortress is said to be the the place where ancient relics with powers beyond our understanding lie, vanished from the overworld for causing wars, conflicts and diseases amongs all who wished their powers. Rumors say that some of these relics give life to the dead, other takes it from the living and even one of them allows it's holder to manipulate time at will. Only the bravest warriors would even dare to think about going inside Matmurah, since Relics are guarded by some of the deadlies and scariest creatures to have ever existed...\"</em></em></strong></p>\n\r\nDescription\r\n<p>VaultRaiders is a fast paced 3D Voxel Top Down Shooter with rogue-like and dungeon crawler elements, taking the best from each genre.</p>\n<p>It takes place on an epic underworld filled with enemies which destroy everything on their way, you willl have at your disposal a vast array of weapons to help you finish them all. Enhance your aim and upgrade your weapons, your wits and reflexes will be your best ally. It plays like Nuclear Throne and Dungeon Crawlers combined. Action, upgrade systems, allies, destructible environments, strong enemies, epic weapons, final bosses, hazards and much more... What are you waiting for to be the next VaultRaider.</p>\r\nProgress, Status of the Game &amp; Kickstarter\r\n<p>The game is in a prototype phase, planned initially PC, Mac, Linux (DRM-Free or Steam), though I would love to expand to other platforms like PS4, Vita and Switch.</p>\n<p>You can play through the first level of the game till you reach and kill the boss of the zone.</p>\n<p>Currently we have a Running Kickstarter campaign, if you like the game please go and support it's development by visiting the campaign. </p><p>Kickstarter Campaign: Vault Raiders kickstarter</p>\n<p>Follow Us on Twitter: https://twitter.com/HaiqGames</p>Controls\r\n<p><strong>WASD</strong> - Move</p>\n<p><strong>Left Mouse Button</strong> - Fire / Shoot</p>\n<p><strong>E</strong> - Pickup / Open / Action</p>\n<p><strong>Q</strong> - Swap Weapon</p>\n<p><strong>R</strong> - Reload Weapon</p>", "metacritic": null, "released": "2018-02-01", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/8e8/8e8d5caecab772992223c3c7c483e7c6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 124, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["HaiqGames"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}