{"id": 105950, "slug": "double-duder", "name": "Double Duder", "name_original": "Double Duder", "description": "<p>In the distant future of 20xx, the Police State, lead by rogue Giant Beast agents Vinny Caravella and Alex Navarro, have succesfully won the war against drugs. Also they may have kidnapped Dan Ryckert. Now it's up to Dr. Tracksuit and Agent Shoemaker (who is definitely NOT a cop) to take drugs back to the streets in \"The War Against the War on Drugs.\" And also maybe rescue Dan Ryckert. That as well.<br/></p>\n<p>Controls are featured in game.</p>\n\n<p><strong>Features:</strong></p>\n<ul><li>The most double dragon beat em up that isn't double dragon! Fight through the unrelenting hoards of the Police State as you take to the streets in search of Drugs (And also Dan Ryckert maybe.) Use an assortment of kung-fu moves, grapples, and dive kicks to best your opponent as you infiltrate Giant Beast Headquarters.</li><li>Two player co-op allows a second player to plug in a controller and take control of special guest star Agent Shoemaker of Cop Show fame. He's definitely not a cop though, and you can trust us on that since we'd have to tell you if he was.</li><li>Full of Giant Bomb goodness, including Baseball Bats and Knives, Dave Lang, UnLIMITED Anime, and more!</li><li>A killer soundtrack featuring a mix of original tunes and familiar Giant Bomb remixes.</li><li>Drugs. Lots of drugs.</li></ul>\n\n<p><strong>The Team:</strong></p>\n<p>UngratefulDead: https://ungrateful-dead.itch.io/</p>\n<p>Jays2Kings: https://jays2kings.itch.io/</p>\n<p>Violet: https://lariowand.itch.io/</p>\n<p>Kieran: https://kit-b.itch.io/</p>", "metacritic": null, "released": "2017-02-04", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/035/0359d578e7699e98b2708f8a7b2e819e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 84, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ungrateful Dead"], "genres": ["Action"], "publishers": [], "esrb_rating": null}