{"id": 106, "slug": "ravenmark-scourge-of-estellion", "name": "RAVENMARK: Scourge of Estellion", "name_original": "RAVENMARK: Scourge of Estellion", "description": "<strong>Upheaval and chaos approaches the ancient Empire of the Raven.</strong><br/><br/>In the world of Eclisse, the ruling Empire of Estellion is besieged by a scourge of embittered zealots from the swamp nation of Kaysan, erased from history by the Empire’s hubris. As the Empire struggles against nigh-endless invaders and ruthless political machinations, its heroes must fight to restore the banners of the raven… Or fall to the Scourge of Estellion.<br/><br/>Ravenmark: Scourge of Estellion is a turn-based wargame, where strategic troop placement is essential to succeess. Battles employ a dynamic “we-go” system where the actions of allies and enemies unfold in a simultaneous battle phase. As a result, commanders in Ravenmark are forced to think ahead, anticipating all movements of their enemies instead of just reacting to them. <br/><br/>Character traits, active abilities and tons of unit statistics come into play in Ravenmark, and have to be assessed and used in the best possible way. All of these are beautifully accessible in the Ravenmark Codex, where you will be able to learn about the different characters and unit types, as well as the deep and rich lore on which the game is based. <br/><br/>In Ravenmark, you are free to choose your own formations. Making proper use of the unique systems for command will be of vital importance to achieve victory! Will you align your pike formations into a single battle line for easier command and better frontage? Or will you keep your formations small and flexible? This is just one of the many choices you will face while fighting your way through your many battles!<br/><br/><strong>Features</strong><br/><br/><ul><li>Rich story-driven campaign: Take command of Calius Septim and a dozen other commanders as you fight your way through the beautiful world of Ravenmark<br/></li><li>Innovative “WeGo” game system: Anticipate all moves of your enemy in order to counter them effectively. <br/></li><li>Limited command: Decide which troops to order around when you have more of them in your force than your leader can deal with.<br/></li><li>Standing Orders: Harness A.I. assisted commands that persist across multiple turns and reduce the complexity of micro-managing large armies.<br/></li><li>Flexible Formations: Group up to three units of a kind into a single Formation, which provides special abilities and buffs to overcome foes with.<br/></li><li>Explore the Codex: Delve into the richly storied cultures and history of the various nations, characters and locales encountered throughout Ravenmark.</li></ul>", "metacritic": 75, "released": "2011-11-10", "tba": false, "updated": "2019-08-28T22:16:15", "background_image": "https://media.rawg.io/media/screenshots/d72/d7213392ecff59b2347ae22ee6c146c8.jpeg", "website": "http://www.ravenmark-saga.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 6, "owned": 66, "beaten": 1, "toplay": 1, "dropped": 2}, "playtime": 6, "achievements_count": 20, "ratings_count": 2, "suggestions_count": 461, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC", "iOS"], "developers": ["Witching Hour Studios"], "genres": ["RPG", "Strategy"], "publishers": ["Slitherine", "Witching Hour Studios Pte"], "esrb_rating": null}