{"id": 10607, "slug": "infested-planet", "name": "Infested Planet", "name_original": "Infested Planet", "description": "Command a team of 5 elite soldiers against an alien horde of 100,000.  Surrounded on all sides, you must outmaneuver and outsmart the enemy.<br/><br/>The enemy is closing in around you.  Your soldiers are being flanked and the perimeter is slowly collapsing under a vicious alien assault.  Robotic turrets will not last much longer.  Just a little more and the bugs will swarm into your unprotected base.  What are your orders?<br/><br/>You order your soldiers to fall back to a defensive chokepoint and rebuild your defenses.  Sacrifice the forward squads to gain some extra time.  Gather your team while equipping them with flamethrowers and laser guns.  Start building a siege cannon for fire support.  Then, while the aliens are busy, flank their main hives to destroy and capture them.<br/><br/>You have just pulled off a tactical victory - but there's no time to rest.<br/><br/>The aliens are constantly mutating.  One moment your shotguns are ripping through the horde, the next the aliens grow hard, bullet-proof armour.  You must adapt as well.  Equip your team with stealth suits, miniguns, grenade launchers - your commands will decide the battle's outcome.Features<ul><li>Real time tactical combat<br/></li><li> A lengthy campaign where you develop new weapons<br/></li><li> Procedural maps and random mutation system keep the game fresh<br/></li><li> 21 Human weapons and buildings for you to wield<br/></li><li> 33 Alien mutations to keep you on your toes<br/></li><li> Fight thousands of enemies at once</li></ul>", "metacritic": 75, "released": "2013-07-02", "tba": false, "updated": "2024-03-24T13:01:43", "background_image": "https://media.rawg.io/media/screenshots/ee7/ee7e610a38e994e8518c1b8a1de5c857.jpg", "website": "http://www.infestedplanet.com", "rating": 3.33, "rating_top": 4, "added_by_status": {"yet": 40, "owned": 800, "beaten": 18, "toplay": 2, "dropped": 13, "playing": 1}, "playtime": 3, "achievements_count": 36, "ratings_count": 45, "suggestions_count": 341, "game_series_count": 0, "reviews_count": 45, "platforms": ["macOS", "PC"], "developers": ["Rocket Bear Games"], "genres": ["Action", "Strategy", "Indie"], "publishers": ["Rocket Bear Games"], "esrb_rating": "Mature"}