{"id": 10603, "slug": "rivais-em-batalha", "name": "Rivais Em Batalha", "name_original": "Rivais Em Batalha", "description": "Rivals In Battle is a multiplayer third person shooter where you see not only a weapon held by arms but a character with a warrior body and a head of an animal race that there on the battlefield represents you in the command that will fight with your teammates against the rivals for the purposes of the game.<br/>This is a game that values the unity of the team, of your race and therefore does not show the score of the players in the match to know who killed more, died less or who is first because what matters is your effort in favor of your team.<br/><br/><strong>Use the flag of your country as your character's skin! The shoulder pads of the warriors will show which country you are!</strong>Featured on Rivais Em Batalha→ Open a session and call your friends to play with you! (We recommend minimum speed of 15 mb internet)<br/>→ You will aim in your opponents through the laser sights of your gun. Take care to not reveal your location in the scene while moving!<br/>→ You not see the kill/death rate. What matters is the teamwork. Play by the success of your team!<br/>→ Your team win you get 5 points, your team lose you get no points, your team draw you get 1 point.<br/>→ Add up points to up your patentThe RivalsWe are in a nearby galaxy to Earth, orbiting the planet called Bohlla. This is an inhabitable planet due to the toxic gases in his atmosphere, and the absence of water on its surface, but has several moons that otherwise are habitable and full of life. In the Moon MiG, living beings of two rival warrior races rivals. The surface of these moons and atmosphere are similar to Earth's enabling wide variety of life. The social agglomerates and vegetation are similar to the Earth. The MiG Moon races are divided into two clans: the clan of the Foxes and the clan of Galliformes. The clan of foxes is recognized by blue color and are large bipedal foxes corpulent as many males as females. The clan of Galliformes is recognized by the black and white colors and are great bipedal poultry as human beings and also obese. The two clans hate each other and there are times to live in peace and some time living in war. The last cause of strife between the two races is one of them decided to take by force the political and military control of the whole moon, not known who started the onslaught, as the Foxes accuse Galliforms and these in turn accuse the Foxes . As warriors are beings who love and learn the art and the culture of war from childhood, they can not spend too much time in peace with compatriot race.", "metacritic": null, "released": "2017-03-29", "tba": false, "updated": "2019-08-23T12:12:45", "background_image": "https://media.rawg.io/media/screenshots/999/999f6d70fb822d926d3aa4a1bbc2b56d.jpg", "website": "http://www.rivaisembatalha.com.br", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 49, "beaten": 1, "dropped": 1}, "playtime": 4, "achievements_count": 20, "ratings_count": 2, "suggestions_count": 394, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Art Games"], "genres": ["Action", "Indie"], "publishers": ["Mamilos Club Studios", "Art Games"], "esrb_rating": null}