{"id": 10601, "slug": "luke-sidewalker", "name": "Luke Sidewalker", "name_original": "Luke Sidewalker", "description": "In a city that never sleeps, one man has a lot of places to be.<br/><br/><br/><br/><br/><br/>Deadass, my man Luke has places TO BE! Luke is so ambitious, he doesn't even look before crossing the street. Luke is a New Yorker, and New Yorkers always have somewhere to be. Guide a hurried Luke through the chaotic sidewalks of NYC, across 7 familiar neighborhoods including Times Square, Central Park, and LES. Eyy I'm walkin here!<br/><br/><br/><br/>Bravely navigate the streets of New York as you majestically weave through a city festering with tourists, hipsters on fixies, little dogs, and the dreaded pigeon. Dodge traffic, catch the L train, avoid those hipsters, and complete your arduous task so you can desperately cling to your distanced girlfriend! Even try to catch an L train from Union Square during rush hour.<br/><br/><br/><br/>You better be smart! Walking around New York can be a challenge even for a brilliant tesseract of knowledge such as yourself. While avoiding obstacles, you must to also multi-task and solve puzzles. What are you signing up for?! Outsmart hot-dog stands, evade angry bouncers, avoid signing up for green peace, dodge projectile newborns, and more! But don't worry, even though you cannot run forever, you can collect coffee and dim-sum from the gum-spotted streets themselves to give you a short boost. Use subway vents to fly over the huddled masses, and twice per level, give a loud \"Excuse me!\" to disperse a particularly dense crowd.<br/><br/><br/><br/>Tons of New York City related trading cards to find and achievements to unlock!<br/><br/><br/><br/>Featuring totally unique unGooglable music and a 4:3 resolution. This is one game you don't want to miss.<br/><br/>“a mundane nightmare familiar to all eight million New Yorkers.”<br/>- Game of the Year, Geek.com 2017<br/><br/>\"10/10 would dodge babies again.\"<br/>- Random comment 2016 <br/><br/>\"That's nice dear.\"<br/>- Mom 2016 <br/><br/>\"I'm just gonna go out and get a pack of cigarettes.\" <br/>- Dad 1998", "metacritic": null, "released": "2016-12-05", "tba": false, "updated": "2022-09-30T00:49:46", "background_image": "https://media.rawg.io/media/screenshots/643/643d0bf0fc5d41bc7b79135ccd397d36.jpg", "website": "http://www.kbrosinc.com", "rating": 0.0, "rating_top": 1, "added_by_status": {"yet": 3, "owned": 225, "dropped": 3}, "playtime": 3, "achievements_count": 13, "ratings_count": 4, "suggestions_count": 155, "game_series_count": 0, "reviews_count": 5, "platforms": ["macOS", "PC"], "developers": ["Giant Fox"], "genres": ["Action", "Adventure", "Casual"], "publishers": ["K Bros Games"], "esrb_rating": null}