{"id": 106182, "slug": "times-race-against-time", "name": "Time's Race Against Time", "name_original": "Time's Race Against Time", "description": "Controls\r\n<ul><li>x - confirm</li><li>left/right arrow keys - move Time (your character)</li><li>up/down arrow keys - limit Time's fast forward effect</li><li>p - pause game</li></ul>\n<p>The goal is to reach the character Space. Stars provide power for Time's fast forward effect, and obstacles reduce her power. Reaching 0 power causes a game over. Time also loses power at a constant rate, and the frequency of obstacles increases at a constant rate. Limiting Time's fast forward effect temporarily increases these rates and reduces the effectiveness of stars.</p>\r\n\r\nPlot (?)\r\n<p><em>This game is loosely based on the visual novel Her Tears Were My Light.</em></p>\n<p>Time fails to save Space in the previous timeline, so she returns to the past to try again. However, this time, Nil appears early and latches on to Time's frame of reference in the current timeline, draining her power with each passing second from her perspective and using it to create obstacles. Now Time must collect stars to increase her ability to fast forward through time and reach Space before Nil can trap her.</p>\r\n\r\nCredits\r\n<ul><li>programming, music, pixel art - Alex Huang (@LydianChord)</li><li>characters from Her Tears Were My Light by NomnomNami (@nomnomnami)</li><li>made using the PICO-8 fantasy console</li></ul>\n<p>The soundtrack for this game is based on the original Her Tears Were My Light soundtrack (also by me), but the level theme is more specifically a remix of the fake battle theme I made for Nil.<br/></p>\n<p>You can view the game's source code here.</p>", "metacritic": null, "released": "2018-01-14", "tba": false, "updated": "2019-08-28T23:24:41", "background_image": "https://media.rawg.io/media/screenshots/be4/be4f7b727332869b5c91b7774af710c3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 5, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Alex Huang"], "genres": ["Action"], "publishers": [], "esrb_rating": null}