{"id": 1061, "slug": "gunjack", "name": "Gunjack", "name_original": "Gunjack", "description": "<p>Gunjack is the visually stunning best-selling VR game built from the ground up for virtual reality.<br />\nTake on the role of a gun turret operator on a mining vessel in the Outer Ring region of known space. As part of the ship’s defense team, it is up to you to protect the rig from pirates, opportunists and anyone else looking to take what rightfully belongs to the company. Jump into your heavy weapons turret, power up your guns, and challenge deadly waves of enemy ships determined to blast you and your crew into oblivion.<br />\n- Intense, full-immersion arcade gameplay that puts you in the gunner&#39;s seat.<br />\n- Intuitive controls for immediate pick-up-and-play action.<br />\n- Multiple missions, bonus levels, and leaderboards for endless replayability.<br />\n- A virtual reality gaming experience set in the sprawling EVE universe.<br />\n&quot;It’s well-designed, varied and exceptionally polished.&quot; ★★★★★ – VR Focus<br />\n“Gunjack is a seriously gorgeous VR game.” – CNET<br />\n“Wonderfully simple and intuitive” - TheSixthAxis<br />\nNotes:<br />\n- Use of this application is governed by CCP’s end user license agreement. This is available at http://www.gunjack.com/eula/<br />\n- Requires an HTC Vive Headset or Oculus Rift Headset<br />\n- Xbox controllers, Keyboard &amp; Mouse, or Vive Controllers supported but does not utilize Controller Motion Tracking functionality.<br />\n- For optimal play experience remain seated, but set the device to the ‘Standing Only’ mode.<br />\n- For optimal audio experience use HDMI audio output.<br />\n- To reset your orientation at any time use the left Menu button (Vive controller) or the Back button (Xbox controllers).<br />\n- Keyboard &amp; Mouse keybinds below:<br />\nFire: Space (Keyboard) or Left Click (Mouse)<br />\nReload: R or Left Alt (Keyboard) or Scroll wheel (Mouse)<br />\nUse Power-ups: Right Alt (Keyboard) or Right Click (Mouse)<br />\nPause (Menu): P (Keyboard)<br />\nBack: Backspace (Keyboard)<br />\nReset orientation: \\ (Keyboard)</p>", "metacritic": null, "released": "2016-04-05", "tba": false, "updated": "2023-09-20T08:07:45", "background_image": "https://media.rawg.io/media/games/f21/f2152dbd63c0a9c359250a5c378ff1aa.jpg", "website": "http://www.gunjack.com", "rating": 3.09, "rating_top": 4, "added_by_status": {"yet": 1, "owned": 95, "beaten": 6, "toplay": 4, "dropped": 6}, "playtime": 1, "achievements_count": 60, "ratings_count": 11, "suggestions_count": 581, "game_series_count": 4, "reviews_count": 11, "platforms": ["PC", "PlayStation 4"], "developers": ["CCP", "CCP Games"], "genres": ["Action", "Casual"], "publishers": ["CCP"], "esrb_rating": "Teen"}