{"id": 106229, "slug": "way-of-the-wolf", "name": "Way of the Wolf", "name_original": "Way of the Wolf", "description": "<p><em>Way of the Wolf is a stealth-action game where you team up with an AI wolf companion, Accalia, to fight the forces that are destroying your forest home.</em></p>\n<p>The evil mega corporation, Enviral, is harvesting the planet for all its resources, their robots scattered across the world. The place you once called home is dying out everyday, the gases from the robots' factories suffocating it.  It's now up to you and Accalia to take back your land.  You can sneak your way through the outpost, ambush the robots, shoot them from behind, use the environment to your advantage, pit their own tech against them, whatever it takes to shut their operation down. Working together, you two could save the world.  Listen to Accalia, pick your battles wisely, and Enviral won't even see you coming.</p>\n\n<p><strong>Developed as an Advanced Games Project at the University of Southern California.</strong></p>\n<p><strong>Be sure to like us on Facebook!</strong></p>\n\n<p>System Requirements</p>\n<p>OS: Windows</p>\n<p>Processor: Intel Core i5-2500 or better</p>\n<p>Memory: 4GB RAM</p>\n<p>Graphics: GTX 970 or better</p>\n<p>Storage: 600 MB available space</p>\n<p>Equipment</p>\n<p>PS4 or Xbox controller required to play; PS4 controller recommended as button prompts are configured for PS4 controllers.\r\n</p>\n<p>Headphones are recommended. <br/><br/>DEV NOTE: we still have some unexpected bugs (very rare) in the build that you might encounter. If the game seems to be bugged out, please press the Menu button on your controller. From there, you can choose the option \"Restart from Checkpoint\". This resets the world state to the latest checkpoint and likely resets the bug state as well. Sorry for the inconvenience! :)</p>", "metacritic": null, "released": "2018-08-03", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/c09/c0912b5ace3a388c12a62a8b489a1dec.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 252, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["wayofthewolf", "SamK"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}