{"id": 10633, "slug": "cold-war", "name": "Cold War", "name_original": "Cold War", "description": "<p>Steal weapons. Improvise gadgets. Evade capture. Uncover the conspiracy.The Story:On the run and fighting for your life, you are freelance journalist Matt Carter. Twelve hours after arriving in Moscow for a routine story, you&#39;ve been stripped of all possessions, beaten unconscious and thrown into the KGB&#39;s political prison. Caught in the midst of an international conspiracy that aims to control the U.S.S.R., you are now on your own behind the &quot;Iron Curtain&quot;. Using only recovered weapons and improvised gadgets, you must now evade and eliminate special Soviet forces and defeat the conspiracy or risk being either killed or sent to a remote Siberian prison camp.Key Features:Spy on your enemies through walls with the powerful and deadly X-ray camera<br />\nComplete missions in multiple ways: Stealth or Brute Force - the choice is yours<br />\nInteractive non-linear world: Accomplish objectives in multiple ways - find hidden paths, combine in-game elements to create weapons and traps, or silently eliminate opponents<br />\nExplore authentic recreations of real Soviet locations including: Lenin&#39;s Mausoleum, Chernobyl, the Kremlin and the KGB&#39;s Lubyanka prison<br />\nCollect and combine objects to create useful and deadly gadgets. You never know when a screw or a dirty old rag will come in handy.</p>", "metacritic": 64, "released": "2014-01-08", "tba": false, "updated": "2023-11-25T09:25:42", "background_image": "https://media.rawg.io/media/games/43f/43fbad9e5e2910a858a5ee04c4c7638f.jpg", "website": "", "rating": 3.52, "rating_top": 4, "added_by_status": {"yet": 6, "owned": 254, "beaten": 13, "toplay": 4, "dropped": 5}, "playtime": 1, "achievements_count": 0, "ratings_count": 23, "suggestions_count": 523, "game_series_count": 0, "reviews_count": 23, "platforms": ["PC"], "developers": ["Mindware Studios"], "genres": ["Action"], "publishers": ["THQ Nordic"], "esrb_rating": null}