{"id": 106313, "slug": "the-last-defender", "name": "The Last Defender", "name_original": "The Last Defender", "description": "<p>The game is an apocalyptic tower defense survival game (wow, that's a mouth full :3).<br/>The game is about a little guy who woke up to notice that an apocalypse took place over night.<br/>He is the last man alive, and he needs to defend himself from the dangers of the apocalypse.<br/>During the day, he must find as much resources as possible and strengthen his defense.<br/>At night, he can only pray for his defense to hold the monsters back from his basement, where he tries to get some rest.<br/>He is The Last Defender.</p><p>How to play</p><p>The game starts off at day time. At day time you will need to gather as much resources as possible to build up defenses to keep the monsters away from the basement door at night. Building defenses and looting costs hours. Every day will start with 24 hours. Your hours and resources will be shown on the top of the screen. The sun icon represents the amount of days you have survived. To gather resources you will have to click on the survivor who is wandering around the house. A box will pop up and you will have to select the amount of hours the survivor will loot. The more hours he loots, the bigger the chance he finds good stuff. Be careful not to make him loot too long because building defenses also costs hours! To build defenses you will have to tap the hammer logo on the bottom left side of the screen. Defenses will appear on the right of the screen. Select a defense and drag anywhere on the screen to move it. Click on the green OK button to place the defense or on the red NO button to cancel the defense. When you are ready, click the blue zzZ button on the bottom left of the screen to start the night. The eye button in the top right of the screen can be used to show and hide defense health and range. Good luck and enjoy!</p>", "metacritic": null, "released": "2017-02-17", "tba": false, "updated": "2019-08-28T23:24:41", "background_image": "https://media.rawg.io/media/screenshots/d03/d03883e2f014c21b54ff81c98e4143d2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 149, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Android"], "developers": ["t.brugel"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}