{"id": 106427, "slug": "sweet-volley-high-all-ages-ver", "name": "Sweet Volley High (All Ages ver)", "name_original": "Sweet Volley High (All Ages ver)", "description": "<p>http://www.patreon.com/newwestgames</p>\n<p>If you enjoyed the game, please consider supporting me on Patreon for early access to future titles and more :)</p>\n<p><strong>Story</strong>\n</p>\n<p>Embark on a journey through your last years of high school and beyond as you try to find success, love, and yourself.</p>\n<p>Aya Mizuki is a pretty typical teenager - cynical, lazy, and doesn't know what she wants to do with her life. As she finds she has a passion for volleyball, your choices will help guide her to passion in her love life as well.</p>\n<p>Things don't always end on a high note... but sometimes, that's just how life is.</p>\n<p><strong>Characters</strong>\n</p>\n\n<p>Aya Mizuki is a quiet, but lazy girl. She's not very social, and tends to spend most of her time with her nose in a book. She spends some of her evenings warming the bench for the school's volleyball team, as having club activities always looks good on a college resume. After a tragic accident injures one of the team's star players, Aya is called upon to step in, and with her Grandpa's help, finds a passion for volleyball that extends past her senior year in high school as she pursues a career.</p>\n\n<p>Nanami Ebihara is the volleyball team captain, and hates the fact that Aya isn't taking things seriously. Quiet, shy and unassuming, Nanami is far from a typical high school sports star, instead she dedicates her life to her craft.</p>\n\n<p>Yuka Saito is one of the most popular girls in school, pretty and with a sharp sense of humour she's the life of the party, so to speak. She flirts with and befriends Aya, introducing her to the local bar scene.</p>\n\n<p>Eri Toyama is one of Nanami's oldest friends, and joins the volleyball team after meeting Aya. She looks up to Aya as a big sister, and though she has a lot of problems in her home life, she's always optimistic, cheery and cute.</p>\n\n<p>Yuichi Hiyama is the star of the school's soccer team and is tipped for great things in the future. Yuichi and Aya become fast friends over their shared love of beef bowls. However as tryout season approaches, Yuichi comes to Aya with an offer she may not be able to pass up...</p>\n\n<p>Aya's grandpa Satoshi lives in the countryside and takes care of Aya in the summer. Satoshi had an oddball sense of humour, an equally oddball laugh and loves his family very much. Maybe it's all the tea he drinks. What Aya doesn't know is that he was once an athlete too.</p>\n<p><strong>Features</strong></p>\n<p>Over 25 wonderfully rendered CG's by the new CG artist from A Wild Catgirl Appears 2.0</p>\n<p>Partial voice acting and a 100,000 word script featuring multiple routes.</p>\n<p>A completely new soundtrack, different from the usual VN fare.</p>\n<p>Built with Ren'Py for stability and custom options.</p>", "metacritic": null, "released": "2018-04-17", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/b24/b246364b370c171b0beaa2d122c51e5e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 8, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["NewWestGames"], "genres": [], "publishers": [], "esrb_rating": null}