{"id": 106476, "slug": "castle-of-no-escape-early-builds", "name": "Castle of no Escape (Early Builds)", "name_original": "Castle of no Escape (Early Builds)", "description": "Steam (full and up-to-date) version can be found here\r\n<p>Castle of no Escape, Post-Jam (but pre-Steam) version</p>\n<p>This game was made for Ludum Dare 31 Jam. I've released an incomplete version (Beta 7) when we hit the deadline, but this readme file comes with a new, finished full version of this game, which includes everything I've planned to release (and even slightly more). Gameplay-wise being a clone/spin-off thing of a really old \"text adventure games\", I think it does a good job in reimagining those forgotten little pearls of game design.</p>\n<p>\"Castle of no Escape\" is based on the game named \"Leygref's Castle\", by Frank Dutton, released in 1986.</p>\n<p>~Xitilon.HD408</p>\n<p>THE GAME</p>\n<p>Explore the mysterious castle full of monsters and secrets in a quest to collect all the treasures (that will also protect you from the curses on your way) and crush the main boss. The game won't let you exit the castle, no matter how you try. Technically you can win, but there is no end.</p>\n<p>CONTROLS</p>\n<p>Press Enter to start the game</p>\n<p>Press 1, 2 or 3 to select a hero</p>\n<p>Strength, Intelligence and Dexterity at the hero selection screen are the maximal values which that hero can get. Strength is both for life and attack power, intelligence is both for mana and spell power. Dexterity affects your attack and defence accuracy.</p>\n<p>You lose the game when either of those parameters gets below zero!</p>\n<p>ON THE MAP</p>\n<p>Arrow keys to walk around<br/>Z or Enter to perform action (attack, open chest, read book, buy potions, use the stairs, gaze into an orb, drink from a pool)<br/>X or Space to cast spells in battle or to light a flare otherwise<br/>1, 2 or 3 to select a potion to buy or a spell to use<br/>Press M to turn background music on/off</p>\n<p>ARTEFACTS AND CURSES</p>\n<p>Opal VS Blindness - you forget the map and don't see any new rooms, flares become useless<br/>Pearl VS Forgetfulness - you don't remember where have you been before<br/>Ruby VS Lethargy - monsters get the first turn to attack<br/>Diamond VS Weakness - you lose 1 strength point every 20 turns<br/>Emerald VS Bad luck - your minimal attack power drop to 1 instead of 50% of strength value<br/>Blue Fire VS Bookstuck - book sticks to your hands and you can't attack anyone in this state<br/>Sign VS everything except Bookstuck</p>\n<p>SPELLS</p>\n<p>Web prevents the monster from attacking and lasts 0-3 turns. Costs 1 point of intelligence.<br/>Fireball is obvious enough. Costs 2 points of intelligence.<br/>IQ instantly kills your opponent if it's intelligence is less than yours. Otherwise, you lose. This spell doesn't spend anything.</p>\n<p>PROGRAMS USED</p>\n<p>Game Maker 8.1 Standard<br/>sfxr/bfxr<br/>FamiTracker<br/>FruityLoops<br/>Notepad (obviously, for Readme.txt)<br/>MS Paint</p>\n<p>CREDITS</p>\n<p>Xitilon.HD408 - game design/adaptation, programming, sound generation<br/>Esdeer aka BSOD - graphics, music, sound design, testing<br/>Inspired by Leygref's Castle etc.</p>\n<p>06.12.2014-19.08.2015</p>\n<p>Денис Нижник та Сергій Богданцев — переклад українською, 15.04.2017.<br/></p>", "metacritic": null, "released": "2015-08-19", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/115/11559384118e060dd65eb1fb80f92355.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 111, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Xitilon"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}