{"id": 106568, "slug": "sauber-ludum-dare-42", "name": "Sauber (Ludum Dare 42)", "name_original": "Sauber (Ludum Dare 42)", "description": "<p>The orbit of your planet is full of satellites. When a critical mass of satellites in orbit was hit, they're falling uncontrolled to the ground after there was no more space left for them up there. They threaten to destroy all the trees on the planet by setting them on fire. Without the trees there will be no oxygen and all humans will miserably suffocate.\r\n</p>\n<p>Earth is lost but there’s hope. A brave hero stays behind while the rest of humankind is preparing the evacuation of the planet. He protects the trees, extinguishes fires and tries not to be smashed by falling satellites while the evacuation ships are being started. It depends on the skill of this hero how many can be saved before the planet runs out of trees and earth is lost forever. It’s a suicide mission to save humankind.</p>\r\nGameplay\r\n<p>The goal is to keep the amount of living trees above the displayed threshold. For every tree alive you save one live per second. The game is over when the amount of living trees drops below the threshold  or you get hit by a falling satellite. Please post your survivor count in the comments.</p>\r\nControls\r\n<p><strong>Keyboard</strong></p>\n<ul><li><strong>Move around</strong> with WASD and the arrow keys.</li><li><strong>Extinguish fire</strong> with space.</li></ul>\n<p><strong>Controller</strong></p>\n<ul><li><strong>Move around</strong> with the right stick.</li><li><strong>Extinguish fire</strong> with the A button.</li></ul>", "metacritic": null, "released": "2018-08-13", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/2c6/2c69a7bba5f217b34a365504a5555f66.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 14, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["GagaPete", "meldrian"], "genres": ["Action"], "publishers": [], "esrb_rating": null}