{"id": 106515, "slug": "akuma", "name": "Akuma", "name_original": "Akuma", "description": "<p><strong>AKUMA</strong> est un jeu vidéo réalisé par les étudiants en 3e année de formation Game Design à l'ETPA : Alexandre Caille, Remi Courdil, Benoit Debono, Vincent Hoffmann, Maxens Lamy, Adrien Lombard, Chloé Maurel, Joris Vallier. Musiques originales de Lucile Santiago.<br/>AKUMA a gagné le grand prix game Design ETPA 2018. <br/></p>\r\nSynopsis\r\n<p>Dans un Japon uchronique, deux frères samouraïs servent le même<br/>daimyo (gouverneur féodal du japon).<br/>L’aîné trahi et assassine le daimyo, prenant la place de celui-ci, il accuse<br/>publiquement son jeune frère, seul témoin de la scène.<br/>Celui-ci préfère s’enfuir et devient un rônin ( samurai sans maître).<br/>Quelques années plus tard, par une suite de conquêtes territoriale, le<br/>frère aîné devient le shogun du Japon et assoit son pouvoir en créant<br/>une armée de robots qui tyrannise la population.<br/>Face à cette violence le frère cadet se décide à revenir au pays se<br/>venger de son frère.</p>\n<p><em>[EN]\r\n</em></p>\n<p><em><strong>AKUMA</strong> is a video game created by  students in their 3rd year of ETPA Game Design curriculum : Alexandre Caille, Remi Courdil, Benoit Debono, Vincent Hoffmann, Maxens Lamy, Adrien Lombard, Chloé Maurel, Joris Vallier. Musiques originales de Lucile Santiago.</em></p>\n<p>In an uchronial Japan, two brothers served the same Daimyo.<br/>The older one decided to slay his master to take his place. Unfortunatly his brother witness this act. Accussed by the older one to be the murderer, he prefer to run away.<br/></p>\n<p>Years after, the new Daimyo start to expend his power an tyrannyse his population.<br/>This is too much for his brother who decide to come back to put and end to this...</p>", "metacritic": null, "released": "2018-08-21", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/f2e/f2effb25aaee9796448b10aaab8a6a89.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 252, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ETPA"], "genres": ["Action"], "publishers": [], "esrb_rating": null}