{"id": 106687, "slug": "neofeud-short-story-collection", "name": "Neofeud Short Story Collection", "name_original": "Neofeud Short Story Collection", "description": "<p>In a dystopian future, the one-percent hover in glimmering golden sky-castles above a wasteland of destitution. A young 'low-born' seamstress' only chance to go from Cinderella rags to Kardashian riches is to be 'noticed' in a cosplayer competition, and to marry an ultra-wealthy prince or be picked up for a TV show by a megacorporation -- all while dealing with poor body-image and self-esteem issues, resulting from a society that doesn't need or want her.<br/></p>\n<p>A sentient machine, one of millions of 'defective prototypes' mass-produced by tech-giants, winds up in a 'machine prison' due to 'substrate profiling' -- robot is the new 'black'. He's beaten, abused, and finally teams up with the robo-convicts to jailbreak from the supermax facility. <br/><br/>Neofeud is a cautionary tale in the vein of Bladerunner, Neuromancer, VA-11 HALL-A, and Ghost In The Shell. A dark vision of where we may all be heading very soon, if we aren't careful.<br/><br/>\"Neofeud\" is a dystopic sci-fi adventure game. This series of short stories were written by Christian Miller, creator of Neofeud, and are set within the world of the game.<br/><br/>The game site: https://silverspook.itch.io/neofeud</p>\n\n<p><strong>More About Christian Miller AKA \"Silver Spook Games\"</strong></p>\n<p>Silver Spook Games is a one-person-team consisting of Christian Miller, a Hawaiian writer, artist, and game developer with a passion for creating works of depth and relevance. </p>\n<p>The art, stories and gameplay of Neofeud are a reflection of his experiences as a STEM teacher for the underserved youth of Honolulu’s inner city. Teaching robotics, programming, and sustainability is an often difficult, stressful, and even Kafka-esque endeavor -- being in one of the richest, most beautiful places on Earth, yet dealing with families with working parents, who are living out of a van, or sleeping on the street. It is hard trying to keep the kids out of gangs, off of drugs, and on a path towards better opportunities, such as the ones he had growing up in a slum area of paradise while going to an upscale private school. Christian made Neofeud to be a fun and engaging game in and of itself, but he also wanted the player to think about the society in which we live, as well as the one which we may be heading toward if nothing is done.<br/></p>\n<p>Christian now lives on the Big Island of Hawaii with his loving, geeky, cosplaying Canadian wife, and two kids.<br/></p>\n\n<p>Twitter: https://twitter.com/SilvrSpookGames</p>\n<p>Facebook: https://www.facebook.com/silverspookgames/</p>\n<p>Mastodon: https://mastodon.social/web/accounts/259792</p>\n<p>Youtube: https://www.youtube.com/user/twiliteminotaur</p>\n<p>Silver Spook Games\r\n</p>\n<p>Get the Neofeud Soundtrack!</p>", "metacritic": null, "released": "2018-05-07", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/577/577329d9dfd5e7e236a8c135afc442a4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 173, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["silverspook"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}