{"id": 106639, "slug": "2017-naura-pas-lieu", "name": "2017 n'aura pas lieu", "name_original": "2017 n'aura pas lieu", "description": "<p><em>\"2017 n'aura pas lieu \" was created during a game creation event, called </em><em>Mediajam</em><em>, in partnership with </em><em>La Belle</em><em> games and the information Website </em><em>Mediapart</em><em>. Eight teams composed of journalists and confirmed game developers created games inspired by the french presidential campain, during 48 hours.</em></p><p><em>The texts in game are written in french.</em></p>2017 n'aura pas lieu<p><em>Avec l'équipe de votre journal, vous allez enquêter sur les divers candidats à l'élection présidentielle afin de faire en sorte qu'elle n'ait pas lieu, par abandon des candidatures grâce à l'effet de vos révélations.</em></p><p><em>Présentation</em></p><p>Le plateau de jeu se divise en deux espaces :</p><p>L'espace public : on y trouve le journal et les candidats. A intervalle régulier, de nouveaux candidats vont apparaître. Chacun possède une forme dévoilant les scandales auxquels il est sensible : le joueur doit alors construire les preuves correspondants aux bons scandales pour ensuite attaquer le candidats et le faire tomber.</p><p>Le journal : ici, le joueur peut utiliser ses journalistes pour étudier des sources et générer des preuves, qu'il peut ensuite améliorer en les combinant soit avec d'autres preuves, des sources ou les journalistes.</p><p><strong>Les créateurs</strong>Léon Denise, William Dyce, Natacha Lefèvre, Edwy Plenel, Benjamin Vedrenne, Maxence Voleau.<br/></p><p><strong>Features</strong></p><ul><li>Un plateau de puzzle évolutif et réactif</li><li>Une simulation de journalisme d'investigation</li><li>Des fins multiples évaluant votre performance</li></ul><p><strong>Comment jouer ?</strong></p><p><em>Le jeu se joue uniquement à la souris :</em></p><p>- Clic gauche pour attraper une pièce, puis maintenir et déplacer la souris pour la déplacer</p><p>- Clic droit pour effectuer une rotation sur la pièce survolée.</p><p>Fiche technique</p><p>Systèmes d'exploitation</p><p>Windows, Linux, Mac OS, </p><p>Pour jouer sur Mac Os ou Linux, il faut installer le logiciel \"Love 2D\"</p><p>Processeur minimal</p><p>Intel® Celeron™ N3050 (1,6 GHz)</p><p>Carte graphique</p><p>Intel® HD Graphics</p><p>Mémoire vive minimale</p><p>512 Mo</p><p>Capacité disque dur</p><p>26 Mo</p><p>Résolution d'écran</p><p>1024 x 768</p><p><em>\"2017 n'aura pas lieu\" est un prototype réalisé en 48 heures durant la \"Mediajam\", un événement de création ludique et citoyen, coorganisé par le site d'information Mediapart et le collectif La Belle.</em><br/></p>", "metacritic": null, "released": "2016-10-31", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/747/747aee09bb1d18fe29fc5857f2cdf45a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 44, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["La Belle"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}