{"id": 106633, "slug": "donald-trump-saves-the-world", "name": "Donald Trump Saves the World", "name_original": "Donald Trump Saves the World", "description": "<p><strong>Donald Trump Saves the World:</strong></p><p>You are Donald Trump. Only you can save the world from an impending ISIS threat. Use your big brain, your excellent words, your reckless bravado -- and above all -- your amazing ability to select options from a menu, to stop ISIS terrorists from doing the unthinkable.</p><p><strong>How to Play:</strong></p><p>This game must be played in browser (Firefox, Internet Explorer, etc) but won't work in Chrome without a few tweeks.</p><p>Choose prompts. Just like Donald Trump, no choice you make is wrong. This isn't a Choose Your Own Adventure game. Don't worry!</p><p><strong>Share </strong>on Facebook and Twitter</p><p><strong>Support</strong> us at Patreon (we'd like to make more games, but they take time!</p><p><strong>Note</strong>:</p><p>This game is a satire -- let's not have a War of the World-type scenario. Disney World is and continues to be the happiest place on Earth, the election is not over, and Donald Trump continues to dream up his own reality.<br/></p><p><strong>Known Issues:</strong></p><p>- Chrome Browser: As your browser no-doubt told you, Unity doesn't play nice with the Chrome browser, so use Firefox or Internet Explorer.</p><p>- CONTENT: Occasionally, you might see \"CONTENT\" appear in game. We're currently looking into why this happens.</p><p>- Typos: Currently fixing typos as well! Note them in comments if you don't mind, but include a nice thought about the game too, so it's not all 'you don't know how to spell.'</p><p>Scrolling: Sometimes the scroll bar will jump up and you'll miss precious story! Don't panic! Just scroll back to read those juicy words.</p>", "metacritic": null, "released": "2016-10-08", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/de6/de66c5e33b033e043387a1c959512405.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 49, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Citizen Stories"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}