{"id": 10672, "slug": "the-feud-wild-west-tactics", "name": "The Feud: Wild West Tactics", "name_original": "The Feud: Wild West Tactics", "description": "Feud: Wild West Tactics is a turn based game all about gun blazing, shotgun blasting, knife stabbing and dynamite throwing action in the Wild West. Centered on the famous Hatfield and McCoy feud you’ll be able to play special storylines from each side with sets of unique characters, each with a ton of personality and grit! Learning how to use your posse effectively against the dangers of the world is the core of the game. Only the hardiest gunslingers can expect to go the distance and survive!<br/><br/>When you get through with the story, you can try your hand at empire building in Western Saga mode. Based on traditional 4x strategy games, you’ll be able to capture resources on the map, research numerous upgrades, explore, investigate events, hold up wagon trains, hunt down wanted men, and most importantly drive the other enemy families off your land for good!<br/><br/><strong>Key Features</strong><strong>Turn Based Tactics in the Old West</strong>Polished and fun turn based gameplay that focuses in small team battles. You’ll need to learn your character’s abilities and specialties to survive the fights. The Enemy talent system means the harder battles differ each time you play, giving enemies a personal touch.<strong>Develop your Characters</strong>As you move through storylines you’ll level up your characters choosing new abilities and developing existing ones. You’ll also be able to equip your characters with a variety of items including ones specially made for them.<strong>Multiple Storylines</strong>Play through three storylines and 32 missions with unique maps. You’ll face a wide range of challenges from straightforward kill missions to destroy missions. The advanced difficulty mode provides the ultimate challenge to the seasoned player!<strong>Western Saga</strong>A massive meta game that lets you see if you can build the ultimate western empire by taking over the map from three enemy factions. Choose from two different sides. You’ll explore, research, recruit and conquer. Saga includes a variety of difficulties including hardcore mode where your losses for fight to fight are permanent.<strong>Endless Mode</strong>Endless mode lets you throw together a team of hired guns, heroes or a combination of the two for a quick endless series of challenges on a variety of maps. Endless mode comes complete with a load of in game achievements to test the heartiest gunslinger.Game Features<ul><li><strong>RICH STORY MODE CAMPAIGN</strong> with a total of 32 missions and two difficulty levels</li></ul><br/><ul><li><strong>BUILD A WESTERN EMPIRE</strong> in saga mode where you can recruit hired guns, take over territory and research a massive amount of upgrades. Create your own strategies and see if you can defeat the enemy factions.<br/><br/></li><li><strong>ENDLESS SHOWDOWN MODE</strong> featuring hired guns, battle quirks and random challenges<br/><br/></li><li><strong>11 HERO CHARACTERS</strong> inspired by History and the archetypes of the old west with unique abilities and talents that allow you to develop different strategies.<br/><br/></li><li><strong>RPG STYLE ITEM SYSTEM</strong> with dozens of  common, uncommon, rare and legendary items to equip on your heroes <br/><br/></li><li><strong>CLASSIC WESTERN WEAPONS</strong> from pistols to long rifles and knives<br/><br/></li><li><strong>DEEP RESEARCH TREES</strong>  with over a hundred improvements to research in western saga <br/><br/></li><li><strong>DOZENS OF DYANMIC EVENTS</strong> await in saga mode including: Bank robberies, wagon heists, bear battles, deer hunting events, curses, hog stealing etc.<br/><br/></li><li><strong>RANDOMIZED WORLD MAP</strong> and hero discovery order means no two games are the same<br/><br/></li><li><strong>DIVERSE LOCATIONS</strong> including grassland, swamp, moutains, woods, towns, mines, lumbermills, caves and the desert with multiple maps in each area.<br/><br/></li><li><strong>UNIQUE PERK AND QUIRK SYSTEM</strong> gives your hired guns memorable traits like being a drunkard who occasionally takes a turn off to down some whisky or being a quickdraw master.<br/><br/></li><li><strong>CLASSIC WESTERN STANDOFFS</strong> where you draw and shoot, the gunslinger with the best timing wins.<br/><br/></li><li><strong>SPECIAL WEAPON ABILITIES</strong> are activated along with extra action points and boosted stats after a kill. Learn how to master them to change the flow of a fight<br/><br/></li><li><strong>BEAUTIFUL ORIGINAL SOUNDTRACK</strong> with over a dozen tracks<br/><br/></li><li><strong>CINEMATIC CAMERAS</strong> highlight special attack and brutal hits</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T22:14:18", "background_image": "https://media.rawg.io/media/screenshots/a85/a85ade7aa0ee806f3c7599bdbf12c04f.jpg", "website": "http://feudgame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 5, "toplay": 1}, "playtime": 6, "achievements_count": 20, "ratings_count": 0, "suggestions_count": 570, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Galaxy Pest Control"], "genres": ["RPG", "Strategy"], "publishers": ["Galaxy Pest Control"], "esrb_rating": null}