{"id": 106711, "slug": "synonymy-itch", "name": "Synonymy (itch)", "name_original": "Synonymy (itch)", "description": "<p>How can you go from a word like 'morbid' to a word like 'ecstatic'? Or from 'fastidious' to 'vigil'?</p><p>Synonymy is a game of finding the paths between random words through their network of synonyms. By taking the synonym of a word, and then a synonym of that synonym, and so on, you can ultimately arrive at any other word in the English language. (more languages forthcoming!) </p><p>Website: www.synonymy-game.com</p><p>Full Trailer: https://www.youtube.com/watch?v=Y1cu0i-4gb8</p><p>—————————————————</p><p>The full version of the game. Supports multiplayer, and weekly challenges in which users can compete globally on set start and end words. Every time a path is uncovered by a user, it is tweeted from @synonymygame and posted to our Facebook page. </p><p>Synonymy is the first game by filmmaker Christopher Cinq-Mars Jarvis and is narrated by world-renowned author and biologist, Richard Dawkins. </p><p>All profits go to various charitable, education-based foundations. </p><p>** Works best using iPhone 5/iPad 2 or later and iOS8. Requires iOS7 or later. The game seems to work on older devices but performance might suffer. Please address any concerns to www.synonymy-game.com/#contact</p><p>A visualization of the game's network can be seen here -- http://www.gigapan.com/gigapans/159329 -- In order to compute relative distance, all synonyms were mapped using 3d graphing software, as if each word were a planet that had a gravitational pull proportional to its number of relationships to other nodes. Above is a 2D representation of that model, a 40,000 x 40,000 image.</p>", "metacritic": null, "released": "2014-11-20", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/f2a/f2a4b7a928841e4feb089c513319ce6a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 54, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Android"], "developers": ["Synonymy"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}