{"id": 106877, "slug": "tic-sweeper", "name": "TIC-Sweeper", "name_original": "TIC-Sweeper", "description": "<p>This is a Minesweeper clone made for practice for the Gamecodeur Gamejam #7.</p>\n<p>It is made in Lua with the TIC-80 fantasy console.<br/>All code, graphics, sounds and music are made by myself with the included editors (with the exception of the title screen picture made with Pyxel Edit).<br/><em>Update: more efficient code help for highscores storage in the game's cartridge persistent memory from Rami (LIKO-12 developer)</em><br/></p>\n\n<p><strong>Controls<br/></strong></p><p>You can play with a gamepad or your keyboard.</p>\n\n<p>Have fun!</p>\n\n<p><strong>Gamecodeur Gamejam #7 additional info</strong></p>\n<p>- Elève Premium de Gamecodeur : Oui, annuel depuis quatre mois non intensifs<br/></p>\n<p>- Langage et Framework utilisé : Lua via TIC-80, une fausse console retro comme PICO-8<br/></p>\n<p>- Code / graphismes / sons / musique par moi-même via les éditeurs intégrés (à part l'illustration d'écran titre faite avec Pyxel Edit)<br/></p>\n<p>- Utilisation de librairies et codes externes : Non</p>\n<p>- Temps passé : entre 35 et 40 heures en comptant la création des assets, les recherches, les discussions sur l'implémentation de fonctionnalités avec le développeur de TIC-80, le post de la progression sur le salon Discord et les oublis de coupure ou de mise en route du chrono<br/></p>\n<p>- Comment as-tu (ou pas) abordé la contrainte du thème : après avoir passé du temps à faire un Tetris amélioré par rapport à l'atelier, je me suis dit que c'était quand même trop proche de celui-ci et ai décidé en dernière minute de participer en partant sur un autre style de jeu qui ne me prendrait pas énormément de temps. L'extension de la date de remise m'a permis de prendre le temps d'améliorer l'enrobage<br/></p>\n<p>- Petit postmortem : le Lua de TIC-80 est assez facile d'accès, plus proche du Lua natif que PICO-8, ce qui aide pour pouvoir chercher dans la documentation officielle.<br/>Niveau difficulté, j'ai passé par mal de temps sur la fonction révélant une zone de cases vides adjacentes (enfin plutôt deux fonctions récursives indirectes se renvoyant l'une vers l'autre), à essayer de comprendre d'où venaient les erreurs qui survenaient, en essayant de déclarer les fonctions de diverses manière, pour au final me rendre compte que j'avais oublié de remplacer un nom de variable en faisant un copier-coller (oui, c'est mal) et que ça fonctionnait parfaitement dès le départ à part ça.<br/>Au final, on veut toujours faire plus, mieux, plus grand, plus complet, plus joli, etc., mais je suis quand même satisfait de pouvoir dire que j'ai fini un premier projet! L'extension de la date de remise m'ayant permis d'un peu peaufiner le visuel et faire quelques petits sons et musiques, une fonction de pause, ainsi qu'un tableau des meilleurs temps. Il me restera à implémenter le stockage définitif de ces meilleurs temps dans la \"cartouche\".<br/>Note: j'avais déjà un peu programmé il y a 15 ans, un peu scripté il y a 10 ans, mais quasi tout oublié. J'ai au moins gardé la logique!<br/></p>", "metacritic": null, "released": "2017-06-15", "tba": false, "updated": "2019-08-28T23:24:38", "background_image": "https://media.rawg.io/media/screenshots/205/20507da2d79eaa1b14179293d27a261d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 136, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["Bentic"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}