{"id": 106820, "slug": "stereotype", "name": "STEREOtype", "name_original": "STEREOtype", "description": "STEREOtype\r\n<p>RHYTHM + TYPING. Strike keys to the procedural beat as it grows more and more complex. Can you type in 7/4?<br/></p>\n<p>Made in <strong>48 hours</strong> for Ludum Dare 41, and got 9th place in the compo! Works best in Chrome. Works okay in Firefox. Might not work in Internet Explorer at all.</p>\n<p>It's hard. Too hard. Hard even for me — I can't touch type. If you make it through a single section of 7/4, consider yourself a master.</p>\r\nKnown Issues:\r\n<ul><li>The music is pretty dreary, I know. A hypothetical future version would have beautiful music. Imagine that version as you play.</li><li>The occasional note isn't getting played. Think of it as... an extra challenge!</li><li>As the BPM increases to about 150 or so, the synchronization to the keyboard gets WAY OFF. I don't expect most players to get that far anyway. Think of it as... a broken game!</li><li>Long words (10+ letters) may not completely fit on the screen. This is what I was working on when 9 PM rolled around.</li><li>Tone.js, the library I use to generate music, occasionally crashes. I don't know why. It shouldn't happen too often; just refresh and try again!</li><li>Some people might have bad sync between the sound and key presses. I didn't test this on very many machines (one).</li></ul>\r\nStuff I Would Add Were I To Keep Working On It, Which I Probably Won't:\r\n<ul><li>Better music: proper melodies and harmonies instead of the random crap it's spewing out now</li><li>Give the player a life back if they get through a section without making a mistake</li><li>More dynamic difficulty scaling</li><li>A better, larger word list</li><li>Some kind of reward for perfect accuracy</li><li>An overall graphical upgrade</li><li>Get rid of Tone.js for something else</li></ul>\r\nThanks:\r\n<ul><li>Yotam Mann for Tone.js... well, half thanks. It has some issues that I had to work around. But it was free, so actually let's make that a full thanks again.</li><li>Huerta Tipográfica for the font I use, Cambo. I spent about 90 seconds picking it out, but I like it!</li><li>Josh Kaufman for the word list</li><li>Nic Mulvaney and Tim Down for code snippets of theirs I found online</li><li>You, for playing my game and reading all this crap</li></ul>", "metacritic": null, "released": "2018-04-23", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/577/57704582912d53847aa9e2fce45c08d2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 10, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Tom Quinn"], "genres": [], "publishers": [], "esrb_rating": null}