{"id": 106961, "slug": "hotar", "name": "HOTAR", "name_original": "HOTAR", "description": "<p>HOTAR is a singleplayer RPG about fighting bosses and arming your soldiers making them stronger and more dangerous. You will have to figure out the correct tactics and also get the right gear (e.g. some which provides you a certain resistance to a magic school) to be able to defeat a boss. If you enter a dungeon, the configuration of your party may also be crucial for your success. Different character classes offer different abilities and spells which you might need to control and defeat your enemies but also to heal and strengthen your own group members. <br/></p>\n<p>In the world of Hotar usually you will control a small group of 3 members which will gain experience and loot from each defeated enemy. However to face stronger opponents you will have to enter dungeons. These are special areas designed for bigger parties (6, 10, 15 or 20 people). In the game you will meet NPCs which will allow you to recruit further party members for some gold. These members initially will have a very poor gear but they will start at a higher level so you don't have to train them all the way up from the beginning. Any time you will have access to the pool of your group members and can decide which of them should fight the next battle to adapt your group to the current situation. <br/><br/>This game feels very much like an MMORPG with the difference that you can control all the involved characters by yourself. During battles the game can be paused so you can give orders to your people e.g. to use a spell or to move so you have enough time to control even the largest groups. <br/><br/><br/>Some of the features the game currently has to offer:</p>\n<p>+ 8 character classes<br/>+ Level 50 as the highest possible level which can be reached<br/>+ Dozens of different talents, magical spells and abilities<br/>+ Loot system: random items dropped by all monsters and specific, generally better items dropped by bosses<br/>+ A crafting system<br/>+ Usable items, i.e. potions (more to come)<br/>+ Different qualities of the items: bad, normal, magical, rare and epic<br/>+ Big levels which are filled with new enemies every time you re-enter. This way you can look for (specific) gear until you have what you need to proceed or try to reach even higher levels to become even stronger. You can also defeat a boss multiple times in a row if you have to.<br/>+ Dungeons which can be entered by parties of 6, 10, 15 or 20 people only<br/>+ Pause the game any time during battle to give orders to your characters<br/>+ English and German localization</p>\n<p>Planned features:<br/>+ Much more areas<br/>+ Much more bosses and other monsters<br/>+ More talents, spells and abilities to come<br/>+ More items<br/>+ Further kinds of items, e.g. arrows<br/>+ etc.</p>\n<p>For more information please visit the official site on:</p>\n<p>http://hotar.de</p>\n<p>You can also follow me on twitter to find out changes which will be released with the next update.</p>\n<p>You will find the complete list of changes to the current game version on the forums.</p>", "metacritic": null, "released": "2016-08-26", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/5ee/5ee9235682d297330026838b4b649e3b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 234, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Blast82"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}