{"id": 106950, "slug": "savejessica", "name": "#SaveJessica", "name_original": "#SaveJessica", "description": "<p>Originally the game was developed by five people from the University of East London for a games jam. However, the project was not completed within the 48 hour deadline. The concept was inevitably left to stagnant. After I graduated from UEL I decided to work on it as a portfolio piece to showcase my narrative skills, as I am applying for a games writer position. </p>\n<p>I devised the concept of the game, which derives from the up-rise in the use of social media; highlighting it's positive and negative aspects- but never forcing either aspect on the player. The game allows the player to judge the position and importance of social media within our society, based on their own morals. </p>\n<p>#SaveJessica is a short, relatively linear narrative experience. I would appreciate any (constructive) feedback. </p>\n<p>I would have preferred to have made this game in something like Unity, which allows players to play on an Android phone or tablet, ultimately giving the player a more authentic experience, one that imitates the feel of the game itself. Unfortunately I'm a novice programmer, and therefore chose Twine to make my first game in as I heard it is a relatively easy piece of software to use. The narrative is the main focus of the experience, which is why it's being used as a portfolio piece to demonstrate my writing skills to any companies I apply for. </p>\n<p>I hope you enjoy.</p>", "metacritic": null, "released": "2017-06-06", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/9a2/9a2fe2458407ce2c7207eb32098abd50.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 59, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["jmazurek"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}