{"id": 106994, "slug": "yabac", "name": "Yabac", "name_original": "Yabac", "description": "<p><strong>ATTENTION:</strong> The demolishing tool is currently gamebraking bugged. You will not be able to place any more buildings after using it. Sorry for this, do not use it please.<br/></p><p>This is our contribution for MiniLD69 on Ludum Dare (http://ludumdare.com/compo/2016/07/10/minild-69-co...).</p><p>Yabac is aimed at an oldschool audience that enjoyed classics such as Anno or The Guild. Right now, there is sadly only very little to do. Our time did not allow for more gameplay elements to be added before the end of MiniLD69. However, depending on feedback, this project will be continued, as we like it quite a lot up to now.</p><p><strong>Features</strong></p><ul><li>randomly generated world map</li><li>classic resources and production chains</li><li>soundtack generated by AI</li><li>quirky zoom and fullscreen support (beware of bugs)</li><li>lots of missing gameplay</li></ul><p><strong>Instructions</strong></p><p>Simply download the distributed package for your operating system. It should work right out of the box. <strong>Attention Linux users: Unfortunatelly, there is no easy way to distribute a Love2D app for Linux so far. You will have to get a hold of the packages yourself as described here </strong>(https://love2d.org/wiki/Game_Distribution)</p><p><strong>How to play</strong></p><p>After starting up the game, you are sent of to a randomly generated world with some starting resources. Right now, there are only a few types of buildings and resources, namely:</p><ul><li>thalers (currency, used for buildings, generated by taxes from houses)</li><li>wooden logs (chopped down trees by a lumberjack)</li><li>timber (used for buildings, produced at the sawmill, needs wooden logs)</li></ul><p>and</p><ul><li>house (some living room for your tax payers)</li><li>lumberjack (chops trees to wooden logs)</li><li>sawmill (produces timber from wooden logs)</li><li>forester (replenishes trees around the area)</li><li>road (connects places, right now useless though)</li></ul><p><strong>Goal</strong></p><p>There is no goal yet, which is the biggest letdown of this release. The time just did not suffice to introduce additonal gameplay elements. However, we plan on continuing the development of this little game with your feedback should a general interest for this arise.</p><p><strong>Shortterm Roadmap</strong></p><p>We will continue to work on Yabac on a hobby basis for now. Our next steps will be the addition of gameplay elements, namely more resources and production chains as well as making a further step in the direction of a real goal. Certain buildings will need to be connected via streets, population will need caretaking, new buildings will no longer be able to be placed at will but following a certain ruleset (i.e. fishermans hut only in the viscinity of water).</p><p><strong>Known bugs</strong><br/></p><ul><li>Zooming and using the fullscreen mode can lead to ugly seems and rendering bugs. This is partly caused by the way Love2d handles SpriteBatches.</li><li>Switching between the different states (building, selection, demolishing, etc..) may cause undesired behavior</li><li>Demolishing destroys more than the area indicator shows - nasty.</li></ul><p><strong>Feedback</strong><br/></p><p>If you enjoyed this prototype and would like development to continue on this game, or if you have any ideas or suggestions on what to implement and how to improve the experience, please let us know in the comments. Nothing is more motivating than your feedback.</p>", "metacritic": null, "released": "2016-08-01", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/f86/f861b56c5da325a3397781b82eebe742.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 53, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Team Klaus Klapper"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}