{"id": 106904, "slug": "remnants-of-celestial-giants", "name": "Remnants of Celestial Giants", "name_original": "Remnants of Celestial Giants", "description": "<p><em><strong>Remnants of Celestial Giants</strong></em> is a photography exploration game. Created in two days by @nicstaracek for the Make-A-Thing Jan 2017 Jam, and abiding to the keywords Remedy, Vermilion, and Parallel.</p>\r\nRituals have been practiced by many ancient tribes for generations, one that has originated from the northern African region of Morocco is \"Gnawa\" or \"Gnawi\". This well preserved heritage see's the combination of ritual chanting, music, and dancing and was typically dedicated to the remedy of evil spirits and illness, as well as other aspects of prayer, healing, and in respect of their believed gods.\r\n<p>In this game you will explore the remains of the past, navigating a landscape that was once home to an indigenous tribe. This land has since been abandoned and overrun by time and age. Document your findings with your disposable camera, and share them with whom, or where ever you please.</p>\n<p><em>In-game music is P'slarklyr by sduck409, used under </em>CC BY 3.0<br/></p>\r\n\r\nGame Controls\r\n\r\n<p><strong>W, A, S, D </strong><strong>-</strong> <em>Movement</em></p>\n<p><strong>C - </strong><em>Enter/ Exit Camera Mode</em></p>\n<p><strong>Left Click - </strong><em>Take Photo</em></p>\r\nnote: the photographs that you take in game are saved to a folder labelled \"snapshots\", which can be located in the build_data folder accompanying the game application (for Windows), inside the Contents folder (for MAC).", "metacritic": null, "released": "2017-01-18", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/a40/a40c70728944809f3f470be6e2ac1aae.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 126, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Nicholas Staracek"], "genres": [], "publishers": [], "esrb_rating": null}