{"id": 106955, "slug": "kid-bot-programming-puzzles-for-kids-and-big-child", "name": "Kid Bot - programming puzzles for kids and big children", "name_original": "Kid Bot - programming puzzles for kids and big children", "description": "<p><strong>Programming is the new literacy</strong>, and you better start early! Kidbot introduces kids to programming through <strong>a fun puzzle game</strong>.</p><p>A room. Toys all over. A robot under your command. Few commands, endless possibilities. Move around. Gather the toys. Get to the basket.</p><p>Kidbot uses a <strong>unique programming model</strong>, both powerful and intuitive. Instructions, conditions and jumps build on a familiar analogy with jigsaw puzzles, where the form of the piece indicates where it can fit.</p><p>The game lets kids and even teenagers gain understanding of the basic concepts behind coding and robot building:</p><li>instruction sequencing</li><li>identifying common patterns as separate procedures</li><li>conditional execution</li><li>loops</li><li>recursion</li><p>The programming language of the game is inspired by the fundamental ARM architecture. This means that the child learns how computers and programming work on a very low level, how loops and conditional execution are built by basic blocks.</p><p>The game has a very smooth learning curve, guiding the child in with many tutorials and tips. While the tips are only in English, the game can be played without the child being able to read yet, thanks to the interactive tutorials that show what to do action by action.</p>", "metacritic": null, "released": "2016-04-05", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/9af/9af5a6b10a9f71dfb0c50b4ee9bbb17c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 51, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Eskape 2 Play"], "genres": ["Educational", "Puzzle"], "publishers": [], "esrb_rating": null}