{"id": 10708, "slug": "affected-zone-tactics", "name": "Affected Zone Tactics", "name_original": "Affected Zone Tactics", "description": "Welcome to <strong>Affected Zone Tactics</strong>, a tactical online game with cooperative turn-based PvP combats. Travel through the Tesla portal to a dangerous parallel world, lead the squad of reckless mercenaries, and outrage mighty corporations and cliques.Key features:<ul><li>Cooperative turn-based battles<br/>Fight together with other players in a unique mode of tactical turn-based combats using covers and capturing strategic positions. Unite into clans and play with your friends.<br/></li><li>4 classes and 12 specs<br/>Hire various spec fighters and build a squad that meets your tactical preferences. Every spec has its own set of equipment, skills and combat tactics.<br/></li><li>Many types of weapons &amp; equipment<br/>Fight, get experience, and study new types of mercenaries' combat gear. The game features more than 100 real models of weapons from pistols and assault rifles to machine guns and grenade launchers.<br/></li><li>Commander's career<br/>Move your main character along the carrier ladder by making the squad grow and by taking new battles. Take over command over allied fighters.</li></ul>Features we are going to add:<ul><li>Clan hierarchy<br/>Development of clans and their players.<br/></li><li>Clan wars<br/>Advanced clan clashes and clan ranking.<br/></li><li>Player's and clan's bases<br/>Construction and development of your own base.<br/></li><li>Story PvE missions<br/>Fighting against mutants and monsters, performance of combat missions assigned by corporations' agents.<br/></li><li>Global map<br/>Global clan wars and territories seizure.</li></ul>", "metacritic": null, "released": "2015-11-17", "tba": false, "updated": "2019-09-17T11:32:17", "background_image": "https://media.rawg.io/media/screenshots/459/4594551d16051bf796942ad89464fd3a.jpg", "website": "http://azt.ggeek.ru", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 217, "dropped": 4}, "playtime": 1, "achievements_count": 19, "ratings_count": 4, "suggestions_count": 423, "game_series_count": 0, "reviews_count": 4, "platforms": ["PC"], "developers": ["Light Vision Interactive"], "genres": ["Strategy", "Massively Multiplayer"], "publishers": ["Light Vision Interactive"], "esrb_rating": null}