{"id": 107089, "slug": "cyberpaw", "name": "CyberPaw", "name_original": "CyberPaw", "description": "<p>This is a cooperative game where both players will have access to an orbital laser that is used to wipe out hazards and enemies alike. The orbital laser is activated when each player jumps a set number of times but the twist is, players do not control the orbital laser on their screen but rather they control the laser on the other player’s screen. Clearing out hazards and enemies will allow players a clearer path to keycards which unlock doors to proceed and also is a form of currency for players to buy items. Items will aid the player in their quest but only to a certain degree as they have to rely mostly on each other to go through this difficult game. Each level ends when both players manage to find the end room that will allow them to progress to the boss rooms where they have to not only survive the onslaught but effectively kill the bosses without getting hit to win the game..</p>\n<p> </p>\n<p>Here is the story,</p>\n<p>The year is 2127, two scientist were fired by the hugest research company in the world due to a weapons research that was pushed by the board of directors went wrong and took the life of the scientists lab partner. Fearing that they would go public with what had happened the company came out to the press saying that it was an accident and happened due to the scientists miscalculations. That act not only discredited the two scientist who had lost their dear lab partner and friend it also fueled them to destroy something that they help create. Both scientists worked throughout the night to create an orbital laser that will activate with just a firm push of a button. It was then stolen by their furry companions to exact vengeance for their masters</p>", "metacritic": null, "released": "2018-08-20", "tba": false, "updated": "2019-08-28T23:24:38", "background_image": "https://media.rawg.io/media/screenshots/f3f/f3ffff0f99ffa032d53a9da30d6ed827.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 186, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["KDU Glenmarie Games", "ray.b"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}