{"id": 107042, "slug": "amity-x-li", "name": "Amity x Li", "name_original": "Amity x Li", "description": "<p>A Twine story about two girls in love, chatting about life. Amity Watkins and her girlfriend Li Anderson are seniors in high school in the smallish, obscure town of Foxville, Massachusetts. It's Saturday, only five episodes of Sailor Moon Crystal have been released, and Amity wants to give Li a flower pendant.</p><p>There's a number of choices, some of which might change part of the conversation later, but it's generally just a nice little story, where you don't have to worry about \"winning\" or \"losing.\"</p><p>Now updated with SugarCube, which lets you save your place. (Also added the ability to use your browser's back button.)</p><p>IFID: A42FC7E6-3D6D-4598-830A-E319303AEE34</p><p>Currently, I don't have any plans to make a direct sequel. I didn't have any actual long-term plans when I created this, for one thing; I'd rather have an endgame in mind than just make an episodic series with no plans. And even if that weren't the case, too many elements were a direct consequence of being part of Ruin Jam 2014 (Nero, for example), I'm not satisfied with Magical Bouquet or the whole concept of the Insiders as written, and in retrospect I don't think it was quite such a good idea to use Inari in Hana's backstory the way I did. </p><p>Still, I wouldn't strenuously object to the idea of doing a reboot with the same protagonists and the same basic premise.</p>", "metacritic": null, "released": "2014-09-12", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/034/034d64dab21120df2f6d81bc2f9cf7b5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 32, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Dizzy H. Muffin"], "genres": [], "publishers": [], "esrb_rating": null}