{"id": 107010, "slug": "every-city-is-the-same", "name": "Every City Is the Same", "name_original": "Every City Is the Same", "description": "<p><em>Every City Is the Same</em> is a very short, introspective game about...deep stuff, and...life, or...cities, maybe? Or maybe it's about the loneliness you feel when you find that the place where you once thought you belonged was never really a place at all and you claw, and you claw, breathless, at the walls of one apartment after another, always homesick, never satisfied...or it might just be an abstract exercise in interactive poetry? Heck. What do I know? The author is dead and all that. </p><p>Anyway, you can stay in the little universe that I built for as long as you want. Simply exit out of the application when you think you're done (press the \"escape\" key). You can move around with the WASD, zoom in with the right mouse button, interact with one of the two working light-switches with the left mouse button, and I think that's basically it! Enjoy!<br/><br/><strong>Credits: </strong><br/></p><p>\"Every City is The Same\" was written, artificed, and coded by yours truly, Aleks Samoylov. If you want to encourage me to create more art, the most effective way to do so is to support me on Patreon. If you're already a patron, thank you from the bottom of my heart! </p><p><em>Fonts</em>:<br/><br/>Juice, by Gadisradio<br/>Frente H1, by Frente.<br/></p><p><em>Sound</em>: <br/></p><p>Piano Sonata Number 14 in C# Minor, Composed by Ludwig Van Beethoven and performed by Paul Pitman.<br/></p><p>Background sounds were recorded by Fyono.</p>", "metacritic": null, "released": "2016-01-02", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/a3c/a3cbf7ad2b64e6130efb99daa662ce76.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 36, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Aleks Samoylov"], "genres": [], "publishers": [], "esrb_rating": null}