{"id": 107033, "slug": "veins-of-light", "name": "Veins of Light", "name_original": "Veins of Light", "description": "<p>Gamepad Strongly Recommended!<br/></p>\n<p>Released by Fungi Studios, AKA Alex Lang.</p>\n<p>tribegalaxy.space</p>\n\n<p>Play the Last Hero of the Earth, delving deep into the ancient place of secret your forerunners built to house the Last Hope. Can you activate the Gems of Power, overcome the epic trials before you, and defeat the Evil that threatens all goodness? </p>\n<p><strong>Can you bring back the Light?</strong></p>\n\n<p>~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~</p>\n<p>       ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~</p>\n<p>                  ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~</p>\n<p><em>In Ancient times, there were vast gardens of lush and fertile life.<br/>There walked upon Mother Earth The Adama and the Titans.<br/>The Titans were strong like the stone, while the Adama were joyous and great was their play.<br/>The Adama nurtured all life, and Earth was a paradise of bliss...</em></p>\n<p><em>Then, the Demons descended.<br/>Beyond number they poured from a clear sky, until the Earth lay covered in their shadow.<br/>The Demons ravaged all land and life, and took blood from the Adama to sustain their race.<br/>They tormented and feasted on the flesh of animals, and clouded the air with toxic fumes.</em></p>\n<p><em>The Adama wept as the Earth wept tears of fire, and the fury of the Titans was roused like never before.<br/>The Titans fought the Demons and the Adama learned to kill, and they wept for this as well.<br/>But the hordes of the Demons grew mightier each passing season, and soon many of the Adama lost their way, following the deception of the Demons.<br/>The strength of the Titans ebbed, and the Adama became fewer every year...</em></p>\n<p><em>In a place of secret, the last Titans and Ancients of the Adama met.<br/>Borne of their life energy, they created a weapon of Godly power.<br/>The Covenant of Adama was forged, and the weapon was sealed away with gems of power.<br/>For although the weapon was ready, the Ancients had used the last of their strength in the creation, and could not activate it.<br/>With the race of Titans and Adama near extinction, they fled deep into the bowels of the Earth...</em></p>", "metacritic": null, "released": "2018-04-01", "tba": false, "updated": "2019-08-28T23:24:38", "background_image": "https://media.rawg.io/media/screenshots/7da/7da69d360b2ce521d62722fc4bbfdaa1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 172, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["galaxypickle"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}