{"id": 10723, "slug": "maya-lt-with-stingray", "name": "Maya LT (with Stingray)", "name_original": "Maya LT (with Stingray)", "description": "<strong>The Maya LT subscription now includes the Autodesk Stingray 3D game engine!</strong><br/>Note: Stingray is a Windows-based application.<br/><br/><strong>Maya LT</strong> is a 3D modeling and animation tool built for indie game makers. Maya LT lets you model, texture, light, and animate 3D characters and environments for your game. It’s based on industry-standard 3D tools used by game developers worldwide and refined continuously based on community feedback. Maya LT puts pro-level tools in the hands of indie game makers, empowering artists to realize the full creative potential of their game design.<br/><br/><strong>Stingray</strong> is a 3D game engine built on a powerful, data-driven core architecture. It features a physically-based renderer that can produce visually stunning games and VR experiences. Stingray features an unprecedented level of connectivity to Autodesk 3D tools like Maya LT. Working with a game engine that is directly connected to your 3D tool simplifies every part of the game-making process.What versions of Maya LT and Stingray are on Steam?<ul><li>Maya LT 2017 Update 3 - released February  22, 2017. Available for Windows and Mac OS X.<br/></li><li>Stingray 1.7.1177.0 - released February  22, 2017. Available for Windows only.</li></ul><br/><strong>Special Note</strong> - These tools do not have revenue, royalty, or usage restrictions beyond their monthly subscription price. They are not restricted to working within Steam game workshops and can be used to create full commercial games.How are Maya LT and Stingray Connected? <strong>Live Linked Cameras</strong><br/>Viewport cameras between Maya LT and Stingray can be linked so that the movement of one tool is mirrored in the other tool. This speeds up artistic evaluation and lets you check your assets in both tools at the same time. Assets can be viewed in Stingray fully lit, textured, and animated in the context of the level.<br/><br/><strong>One Click Asset Updates</strong><br/>When evaluating assets in Stingray, it’s easy to make changes and see the results immediately with just a single click. If you don’t like how something looks in your level within Stingray, you can make the change in Maya LT and then update it right away. The artistic iteration process has never been this fast!<br/><br/><strong>Shared Physically Based Materials</strong><br/>Maya LT and Stingray use the same physically based shader nodes found in ShaderFX (so do Maya and 3ds Max). So you can create a material once and use it in both tools. Then, if you want to make changes, the same one-click workflows update the materials right away.What can you do with Maya LT?<ul><li>Work seamlessly with Stingray to make your games faster than ever<br/></li><li>Work with other game engines using the common FBX and OBJ formats<br/></li><li>Create high quality 3D models with no export limit when working with Stingray, Unity, or Unreal.<br/></li><li>Create textures and materials for your models that can be shared in Stingray<br/></li><li>Animate your creations with tools based on Maya and HumanIK animation systems<br/></li><li>Learn today, prepare for tomorrow by using a professional 3D tool used in game studios worldwide</li></ul>What can you do with Stingray?<ul><li>Work seamlessly with Maya LT for super fast artistic iteration<br/></li><li>Build game levels with intuitive editor tools<br/></li><li>Create visually stunning games using a physically based renderer<br/></li><li>Add screen space visual effects to give your game a distinct visual style<br/></li><li>Create gameplay using Lua scripting<br/></li><li>Can’t write script? Use Flow, a visual, node-based scripting system<br/></li><li>Animate in-engine with tools based on HumanIK<br/></li><li>Add global illumination with Autodesk Beast<br/></li><li>Create pathfinding and pathfollowing for AI characters with Autodesk Navigation<br/></li><li>Create menus and UI elements with Scaleform Studio<br/></li><li>Add sounds and music with Audiokinetic Wwise<br/></li><li>Add physics with the NVIDIA PhysX system</li></ul>", "metacritic": null, "released": "2014-04-22", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/b7b/b7b3a7f3d1869fcc6ae609ca307bf9e3.jpg", "website": "http://www.autodesk.com/mayalt", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 372, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Autodesk"], "genres": [], "publishers": ["Autodesk"], "esrb_rating": null}