{"id": 107229, "slug": "windoge-96", "name": "Windoge 96", "name_original": "Windoge 96", "description": "<p><em>English below!<br/></em></p>\n<p><strong><em>¡El nuevo sistema operativo Windoge 96 ha salido a la venta!</em></strong></p>\n<p><em>Sentirás desde el primer momento que estás en el sistema operativo </em><em>más seguro del mundo. Además, entre sus grandes características se encuentran su </em><em>estilo alejado de los noventa y, por primera vez en la historia (y como nos queremos </em><em>subir al tren de las modas), ¡Battle Royale!</em></p>\n<p>En este divertido e irónico simulador de instalación de un sistema operativo tendrás que luchar contra un troyano que te intentará saturarte la CPU del ordenador intentando llenarla hasta que éste no aguante más. El simulador consta de varios minijuegos en los que tendrás que ser más rapido que el malvado troyano y estar atento con todos tus sentidos. Un juego sencillo, irónico y divertido para todas las edades, en el que aprenderás los peligros de Internet.</p>\n\n<p><strong>Equipo:</strong><br/></p>\n<p><em>Arian Rosales / @ArianRosales - Programación y diseño</em></p>\n<p><em>Eros Mesa - Programación</em></p>\n<p><em>Christian González - Arte</em></p>\n<p><em>Jonatan Galindo / @JonatanGalind12 - Música y SFX<br/></em></p>\n\n<p>Minijuego 1: Cierra las ventanas tan rápido como puedas haciendo click en el símbolo \"X\".</p>\n<p>Minijuego 2: Mueve las carpetas a la papelera arrastrandolas con el ratón.</p>\n<p>Para salir del juego selecciona “No” en la pantalla de instalación.<br/></p>\n<p>&lt;--------&gt;</p>\n<p><strong><em>The new OS Windoge 96 is now online!</em></strong></p>\n<p><em>You will feel from the very begin that you are on the safest OS in the world. </em><em>It's main characteristics are super new and modern style, very far from 90's and for the very first time in an OS, Battler Royales mode!</em></p>\n<p>On this funny and ironic OS simulator, you will have to fight a troyan who will try to push your CPU to the limit. This game consists in  minigames where you will need to be faster than the troyan. Simple, ironic and fun for every age.</p>\n\n<p><strong>Team:</strong><br/></p>\n<p><em>Arian Rosales / @ArianRosales - Programming and design<br/></em></p>\n<p><em>Eros Mesa - Programming<br/></em></p>\n<p><em>Christian González - Art</em><br/></p>\n<p><em>Jonatan Galindo / @JonatanGalind12 - Music y SFX</em></p>\n\n<p>Minigame 1: Close the windows as fast as you can by clicking on the \"X\" symbol.<br/></p>\n<p>Minigame 2: Move the folder into the bin by draggin them with the mouse.<br/></p>\n<p>To exit game select “No” on the installation screen.<br/></p>", "metacritic": null, "released": "2018-08-12", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/6b2/6b29ca8c85134efc50fad8455d7423a6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 58, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux", "Web"], "developers": ["Barbaarian"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}