{"id": 10720, "slug": "day-of-infamy", "name": "Day of Infamy", "name_original": "Day of Infamy", "description": "Day of Infamy takes you to the battlegrounds of Southern and Western Europe during World War II. There are 10 maps, ranging from war-torn cities to farm villages, fortified beachheads and snow-covered forests. Whether you are fighting for the U.S. Army, Commonwealth Forces or the German Wehrmacht, there is a vast arsenal of over 70 historical weapons and attachments.<br/><br/><br/>Day of Infamy features 9 player classes and 10 objective-based game modes, providing a variety of experiences depending on what you’re looking for. Your objectives include capturing areas, assassinating officers, stealing enemy intelligence, and destroying anti-aircraft guns, fuel dumps and radio communication centers. Multiplayer gameplay features large-scale battles with many reinforcement waves, as well as smaller scale operations with objective-based reinforcements. Cooperative gameplay features three distinct game modes against challenging AI enemy troops.<br/><br/><br/>Day of Infamy is a highly strategic experience that rewards intelligent maneuvering and coordination with your team. Pay close attention to your surroundings, as blindly running into an open area is the easiest way to get killed. Lean around corners, lay prone to steady your aim, and walk slowly to conceal the sound of your footsteps - these are effective tactics to stay alive. A team that sticks together, advances cautiously, and uses proximity VOIP is more likely to overcome a scattered and disorganized opponent.<br/><br/><br/>Selecting the Officer class in the game puts you at the top of your team's chain of command. Pairing with a Radioman in the field will enable you to request supply drops, smoke screens, artillery barrages, as well as aircraft strafing and bombing runs. You may also issue various tactical commands to your team such as flanking or charging an objective. Communicating effectively as an Officer will enable your brothers-in-arms to turn the tide of battle with an effective order.<br/><br/><br/>As you play the game, you will ascend through the ranks and unlock historic units. Earn cosmetic items such as melee weapons, rifle skins, and cloth wraps by attaining weapon skill thresholds. Unlocks do not provide players with any gameplay advantage, so game balance will always remain purely skill-based. <br/><br/><br/>The units you earn by ranking up contain unique items such as arm patches, helmet stencils, hats, cap badges, voices, and faces. The game contains historic regiments rarely found in WWII games, such as the U.S. Army’s 92nd “Buffalo Soldiers” Infantry Division, the Princess Patricia’s Canadian Light Infantry and the British Indian Army’s 12th Frontier Force Regiment. The game also contains some of the more popular fan-favorite historic units, such as the U.S. 82nd and 101st Airborne Divisions, 2nd Ranger Battalion, and German Luftwaffe Fallschirmjägers. <br/><br/><br/>The game comes with mod support and Workshop integration, providing players with a vast array of community created content. Built on Valve's Source Engine, the SDK is one of the most familiar out there. Modders can replace models, textures, sounds and user interfaces in the game, as well as add new maps or total conversions using the game's theater scripting system. There are already over 500 mods which have been released during the game's early access phase.", "metacritic": 77, "released": "2017-03-23", "tba": false, "updated": "2023-04-18T20:54:26", "background_image": "https://media.rawg.io/media/screenshots/2e6/2e62985490386eba0b40c2e3cf214f09.jpg", "website": "http://www.dayofinfamy.com", "rating": 3.78, "rating_top": 4, "added_by_status": {"yet": 26, "owned": 654, "beaten": 18, "toplay": 7, "dropped": 38, "playing": 3}, "playtime": 4, "achievements_count": 97, "ratings_count": 67, "suggestions_count": 568, "game_series_count": 0, "reviews_count": 67, "platforms": ["macOS", "PC", "Linux"], "developers": ["New World Interactive"], "genres": ["Action", "Shooter", "Indie"], "publishers": ["New World Interactive"], "esrb_rating": null}