{"id": 107361, "slug": "xenogunner-game-jam-version", "name": "Xenogunner - Game Jam Version", "name_original": "Xenogunner - Game Jam Version", "description": "The game:\r\n<p>Xenogunner is an intense boss-focused run-and-gun platformer based on games from the days of 16-bit consoles, with the addition of conveniences like mouse aiming and heavily customizable difficulty settings to slightly modernize things as well.</p>\r\nThe story:\r\n<p>The future is now in the year 2011, and Zeta Reak, the gentle king of the Xenolians, has been overthrown by a rebellion led by the ruthless tyrant known only as \"The Xenogunner\". Through a twist of fate, Zeta's prison cell breaks open... will you be able to reclaim the throne? Or will Zeta's Xenonature powers not be enough?</p>\r\nQuestions and Answers:\r\nQ. Does the game have controller support?\r\n<p>A. Nope. Sorry. It'd be too hard to add in controller support in the time remaining in the Jam.</p>\r\nQ. What about control remapping?\r\n<p>A. Sadly, no.</p>\r\nQ. Well, what does the game have, then?\r\n<p>A. 4 short stages, each of which ends with an intense, significantly longer boss battle. There also may or may not be a secret of some kind on the control test screen.</p>\r\nQ. Aren't stages usually supposed to be the longer part of games?\r\n<p>A. Usually, yes, but for this game I figured it'd be better to focus more on making great boss battles, rather than decent stages and decent bosses. Aren't bosses often the most memorable moments in games anyways? :)</p>\r\nQ. What's Xenonature, anywho?\r\n<p>A. Xenonature is a mysterious energy that can be found in life throughout the universe. Certain living creatures can harness it for awesome abilities, such as the elemental abilities that Zeta uses throughout the game: The Glacier Xenoshot, a rapid-fire ice attack, the Howitzer Xenoshot, an explosive orb of dark energy, the Graviton Xenoshot, a short-ranged but devastating rock, the Inverse Xenoshot, a boomerang made of pure light, the Reflect Xenoshot, a compact water blast capable of blocking attacks, and the Volley Xenoshot, an inaccurate wind attack that can take on groups of enemies.</p>\n<p>Supposedly \"The Xenogunner\" is able to move objects with his mind and create illusions with Xenonature, but few outside his rebellion have seen the full extent of his power...</p>\r\nQ. So basically you're saying that Xenonature is kinda like the fo-\r\n<p>A. For copyright reasons, I'm going to have to stop you right there. ;)<br/>You're not wrong, though.</p>\r\nQ. Why did you list the name of every single attack when explaining Xenonature? Isn't that a bit excessive?\r\n<p>Well, since the attack names aren't listed in-game, I wanted to be able to list them <em>somewhere.</em> You're might be right, though, it may have been excessive.</p>\r\nQ. Why is this questions and answers section so unprofessional?\r\n<p>Because I thought it'd be funny.</p>\r\nQ. Oh.\r\n<p>A. That isn't a question.</p>\r\nQ. Then why did you include it on the questions and answers section?\r\n<p>Because I made up all the questions myself instead of actually seeing if anybody had any real questions about the game that they wanted answers to.</p>\r\nQ. Oh.\r\n<p>A. That<em> still</em> isn't a question.</p>\r\nQ. Sorry. Does the game have any dragons in it? Oh, and will I get to battle any giant robots?\r\n<p>Yes to both of those. The first boss is a giant robot dragon!</p>\r\nQ. That sounds so cool! How much money are you asking for it?\r\n<p>Nothing currently. The game <em>is</em> a GameJam game, after all. The dev-team making an expanded version down the line isn't out of the question, though.</p>\r\nQ. This questions and answers section is too long! When will it end?\r\n<p>How about right now? Go ahead and give the game a shot!</p>\n<p>#IWantToCreate<br/></p>", "metacritic": null, "released": "2018-01-02", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/013/0136ea1d26910c143851ee0eea84bbfa.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 57, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["happy_frog_games"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}