{"id": 107352, "slug": "roots-of-sarkos", "name": "Roots of Sarkos", "name_original": "Roots of Sarkos", "description": "<p><strong>New with the 1.3 Release!</strong></p><p>This final update brings a wide variety of new goodies! In addition to a new <em>Master Quest</em> level for <em>Roots of Sarkos</em>, we also have four brand new and entirely different games made in the 5 weeks at the end of our program. These games are either based off of the world of Sarkos or the Denius-Sams Gaming Academy itself. You can read more about these new additions below!</p><p>In <em>Roots of Sarkos</em>, communication is key. It's a networked, asymmetric platformer with an emphasis on cooperation between two players. Both players must rely on each other's individual strengths and abilities in order to escape the mysterious floating islands of Sarkos. One player helps in guiding the other as both work together in this digital equivalent of a trust-fall.</p><p>This is a multiplayer-only game. Both players will need to communicate to survive the world of Sarkos!</p><p><strong><em>Master Quest</em> </strong>gives a new, increased challenge for experienced <em>Roots of Sarkos</em> players looking for more.</p><p><strong><em>Sarkos Arrival</em> is a PvP re-imagining of <em>Roots of Sarkos</em>.</strong> Quill has just arrived on the distant planet and is attacked by a Sarkosian Spirit. Think quickly as you sprint or fly around the arena in this fast-paced 2-player local multiplayer battle for supremacy!</p><p><strong><em>Beats of Sarkos</em> is a rhythm-based combat game.</strong> Join Madron's other apprentice Aithne on a colorful, psychedelic journey through the portal to Sarkos, as she traverses the planet's toroidal shape and fights off enemies to the beat.</p><p><strong>In <em>Back to Sarkos,</em> guide Quill through an endless adventure on a deserted island!</strong> Explore uncharted territory before the sun sets and a mysterious curse drains your life spirit. Meet interesting characters, collect hidden clues and uncover the secrets of the island to lift the curse!</p><p><strong>You've played <em>Roots of Sarkos</em>, now play the metagame <em>DSGA Simulator</em>. </strong>Take on the role of the Denius-Sams Gaming Academy program director. Choose staff and students, make schedules, and craft a program that will rocket your rising stars to the top! But watch out, not everything always goes according to plan...</p><p><strong>Update 1.3 Changelog (May 17, 2016):</strong></p><ul><li><strong>Addition of New Games: <em>Sarkos Arrival</em>, <em>Beats of Sarkos</em>, <em>Back to Sarkos</em> and <em>DSGA Simulator</em>.</strong></li><li><strong>New <em>Master Quest</em> Level for <em>Roots of Sarkos</em>.</strong></li><li><strong>Launcher for <em>Roots of Sarkos</em> and the new additional games.</strong></li><li><strong>Menu and Challenge UI for <em>Roots of Sarkos</em></strong><strong> updated.</strong></li></ul><p>This version is the 1.3 release of Roots of Sarkos, created by the Denius-Sams Gaming Academy class of 2015-2016.  </p><p>Please visit our <strong>website for more information and updates.</strong></p><p>Special thanks to Andrea Moon for composing the background music.  Additional sound effects for <em>Roots of Sarkos</em> by freesound.org users:<br/></p><ul><li>RuonVNiekerk</li><li>DrMinky<br/></li><li>michael_kur95<br/></li><li>ejfortin<br/></li><li>LittleRobotSoundFactory<br/></li><li>StephenSaldanha<br/></li><li>primeval_polypod</li></ul>", "metacritic": null, "released": "2016-01-22", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/f71/f71a80884f77c18797eeeb9e742fcd33.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 283, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["DSGA2016"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}