{"id": 1073, "slug": "keep-talking-and-nobody-explodes", "name": "Keep Talking and Nobody Explodes", "name_original": "Keep Talking and Nobody Explodes", "description": "<p>Keep Talking and Nobody Explodes is a game about defusing a bomb. It was initially made for virtual reality headsets but also supports traditional screens and controls.</p>\n<h3>Player cooperation</h3>\n<p>The game is meant to be played by at least two people in cooperation. Only one of them is wearing the VR headset or actually interacts with the computer. He or she acts as the main defuser who has to deactivate the bomb. All other players assume the roles of the experts. Their task is to help the defuser by reading aloud a manual about bombs. The experts need to be either in the same room with the defuser or to contact him or her over an audio messenger. </p>\n<p>The defuser is the only player who can see the bomb. He or she has to describe it in details to other players. The experts, in turn, have to find the described blocks in their manuals and tell the defuser what to do to solve the puzzle. </p>\n<h3>Bombs as puzzles</h3>\n<p>The composition and other attributes of each bomb are randomly generated for each level, and the players can customize them. The bombs consist of individual blocks, which are puzzles on their own. Some of the blocks require regular attention from the defuser, while others can be disarmed once and for all. </p>\n<p>The time for each level is limited. When the countdown reaches the end, the bomb will explode. Defuser&#39;s errors may also speed up the countdown or even activate the bomb and &quot;kill&quot; him or her. Each bomb has its own limit of time and errors.</p>", "metacritic": 67, "released": "2015-10-08", "tba": false, "updated": "2024-04-08T04:01:04", "background_image": "https://media.rawg.io/media/games/e88/e88ccd83bb2d69ad04d18b06c5e0df3d.jpg", "website": "http://www.keeptalkinggame.com", "rating": 4.2, "rating_top": 4, "added_by_status": {"yet": 93, "owned": 2144, "beaten": 199, "toplay": 58, "dropped": 248, "playing": 38}, "playtime": 3, "achievements_count": 50, "ratings_count": 395, "suggestions_count": 236, "game_series_count": 0, "reviews_count": 398, "platforms": ["Xbox One", "PC", "macOS", "Nintendo Switch", "PlayStation 4", "Android"], "developers": ["Steel Crate Games"], "genres": ["Simulation", "Indie", "Puzzle"], "publishers": ["Steel Crate Games"], "esrb_rating": "Everyone 10+"}