{"id": 107354, "slug": "void-wisp-itch", "name": "Void Wisp (itch)", "name_original": "Void Wisp (itch)", "description": "Void Wisp is an ambient arcade runner where you earn points by coming close to obstacles without crashing. \r\n<p>\r\n\tYou are a wisp. A collection of random energy that has coalesced into a sentient form. You float through the great nothingness that permeates existences, skimming off aether from the whatever that is nearby.\r\n</p>\n<p>\r\n\tThe gameplay is simple. You have two buttons; one moves you up and the other lets you glide. Typically you'll be holding the glide button to slow your descent when an obstacle comes near so you can grind along the top or bottom for points. The closer you are the more points you'll earn. You'll crash if the center of the Wisp contacts an obstacle.\r\n</p>\n<p>\r\n\tBelow is a short overview of how this game works.\r\n\t<br/>\n</p>\n<p>\n</p>\r\n Features:\r\n<ul><li>Simple gameplay that’s easy to pick up and hard to master. Designed for both short spurts and long sessions. </li><li>4 Game Modes each with a unique twist.\r\n<ul><li>In Classic Mode you’ll start to lose points the farther you go, so you want to get as many as quickly as possible.</li><li>In Caravan Mode you have one minute to score as much as possible. Crashing will lower the amount of time you have.</li><li>Survival Mode is the most complex mode. A timer is always ticking down but can be refilled by collecting luster and having a high multiplier. The game gets faster and you earn more points the further you make it.</li><li>In Traveler Mode there are 40 premade levels each with 5 goals to complete. You will face unique obstacles not found in the other modes.</li></ul></li><li>Accessibility options that let you customize the game’s looks, controls, and difficulty.\r\n<ul><li>You can change the appearance of the game and character to better suit what makes you comfortable.</li><li>Supports mouse, keyboard, and gamepad. All with fully remappable controls!</li></ul></li><li>Dreamy ambient music that partially reacts to how you play.</li></ul>", "metacritic": null, "released": "2016-06-25", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/433/433f78d2daea84f767478756ae19d3a3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 97, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["D. W. O'Boyle"], "genres": ["Action"], "publishers": [], "esrb_rating": null}