{"id": 107310, "slug": "house-party-itch", "name": "House Party (itch)", "name_original": "House Party (itch)", "description": "<p><strong>All the animations in the game are procedural, there are no keyframe animations in the game.</strong></p>\r\nThings we can do in game :\r\n<p>Stand, Walk, Jump , Punch (left and right), Grab (left and right) , Pull, Push, Move hands freely , Slam, Throw, HeadButt</p>\n<p>Player can combine all these moves</p>\r\nTools used :\r\n<p>Unity, Audacity, Blender, Krita</p>\n<p>It is a Physics Based fighting game. I got stuck spending all of my time in implementing the fighting mechanics, I had no time to play test the game even once. Im sorry if the game is crap</p>\r\nTheme / Idea :\r\n<p>So the theme was The more you have the worse it is.</p>\n<p><strong>The game</strong> : The more guests you have, the worse your migraine (Player Controls) get. You have thrown a house party, and there are some uninvited guests. They smoke, break your furniture, fight with each other. This causes you headache, a severe migraine headache. The players movement becomes extremely difficult to control as the headache increases</p>\r\nGame Rules :\r\n<p>Goal is to survive as long as possible. You will have to throw the guests out of the backyard to survive. The more guests there are, the worse your headache gets. You can punch, push, pull, slam or throw them. Do whatever it takes to kick them out. You have to throw them beyond the knee high - white bounding wall</p>\r\nControls :\r\n<p><strong>Controls for KeyBoard and Mouse: </strong>WASD to move; Tap Left or Right mouse button to punch; Hold Left or Right mouse button to Grab; Shift to Lift; Q - Headbutt; Space - Jump</p>\n<p><strong>Controls for Controller:</strong> Tap LB or RB for left or right punch; Hold LB or RB for left or right grab; After grab use right stick to move the hands freely; X - Headbutt; A - Jump</p>\n\r\nSome in game footage :\r\n\r\nThings that can be done in game :\r\n<p><strong>Walk</strong></p>\n\n\n<p><strong>Twirl</strong></p>\n\n\n<p><strong>Jumps</strong></p>\n\n\n<p><strong>Punches</strong></p>\n\n\n<p><strong>After Grabbing, the hands can be moved freely</strong></p>\n\n\n<p><strong>Attacks can be combined, like Grab with one hand and Punch with the other</strong></p>\n\n\n<p><strong>Multi-Directional Headbutts</strong></p>\n\n\n<p><strong>Slams and Throws</strong></p>\n\n\n<p><strong>Goal is to throw them outside the bounding wall</strong></p>", "metacritic": null, "released": "2017-12-07", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/a47/a47be1e7b6ac37eae9953d1cbee81034.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 42, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["richarddilip"], "genres": ["Action"], "publishers": [], "esrb_rating": null}