{"id": 107470, "slug": "finlandia-game-jam-package-kajak-games", "name": "Finlandia Game Jam Package - Kajak Games", "name_original": "Finlandia Game Jam Package - Kajak Games", "description": "<p>On the 6th of December in 1917 the Finnish parliament officially adopted the declaration of independence made few days before. </p>\n<p>After 100 years of Sauna, Indestructible Nokia's ,  Sandstorms, Sisu , Santa Claus, Beautiful nature, Free buckets, Proper Healthcare,  Social Awkwardness, Heavy Metal, Moomin and the everlasting darkness of the winter season....</p>\n<p>We Finns also love to make games and so we present to you some jam games commemorating this special event so go on ahead and take a look at them below:</p>\n\n\n<p><strong>DOKI DOKI SUOMI-CHAN</strong><br/></p>\n\n<p>In this Visual Novel you get to experience the perspective of an outsider who peers into our strange homeland. Will you be able to handle the Finnish social taboos and melt Suomi-chan's heart?</p>\n<p>Fun fact:   </p>\n<p><strong>LAMPEHEN LAULANTA (SWAMP SONG)</strong><br/></p>\n\n<p>In this Guitar Hero inspired game you take the roles of two loved characters from the Finnish Epic: Kalevala.  Väinämöinen and Joukahainen who on one day dueled with songs and melodies. And in the end one of them was quite literally sung into the swamp.</p>\n<p>Fun fact: did you know that J.R.R Tolkien took a lot of inspiration from Kalevala when making Lord Of The Rings?</p>\n<p><strong>LENTÄVIÄ PROPPEJA (FLYING PROPS)</strong></p>\n\n<p>In the Winter and Continuation war during the second world war, Finland had a very small air force (and everything else) when  compared to the behemoth that was the Soviet Union.  Still, brave men took to the skies and dodged enemy fighters and bombers. Oh yeah and the flying anti air tanks.</p>\n\n\n<p>Wait what?</p>\n<p>Fun Fact: When the Soviets attacked in 1939 Finland only had 116 mostly outdated planes and the Russians possessed 5000 out of which 2000 were sent to the Finnish theater.</p>\n\n<p><strong>MAY THE BEST FINN WIN!</strong></p>\n<p>Here we see two Finnish males trying to show dominance towards each other.</p>\n<p>Fueled by Olut(beer) they set out to compete in the most Finnish outdoor games you can imagine, including: wife carrying, beer floating, wood chopping, berry picking and ice fishing.</p>\n<p>Challenge your friends and prove once and for all on who is the best Finn!</p>\n<p>Fun Fact: Yes we do have quite a lot of weird sports. we even have competitions on who can throw a Nokia phone the furthest and the same goes for Nokia's rain boots.</p>\n<p><strong>MOTITUS</strong> <strong>(POCKET ENCIRCLEMENT)</strong><br/></p>\n\n<p>During the winter war the odds were stacked against the Finnish military, but they managed to persevere.  One of the tactics that were used in the war was called Motitus (Pocket encirclement) in which Finnish soldiers encircled and separated Soviet convoys and took out the enemy one by one. </p>\n<p>In this RTS game you will try do the same to the Soviet convoys heading your way.</p>\n<p>Fun fact: The etymology of the Molotov Cocktail comes from the Finnish soldiers using petrol bombs against pocketed Soviet tanks. And named after then-Soviet Foreign Minister Vyachelasv Molotov.</p>\n<p><strong>PRESIDENT EVIL</strong></p>\n\n<p>Choose a mighty Finnish President as your champion and fight in the the center of Helsinki for the glory of being the President for the best nation in the world!</p>\n<p>Choose from these giants of men: Kekkonen, Mannerheim, Santa and Niinistö!</p>\n<p>Yes Santa is a President of Finland and I wont hear your lies about it #FAKENEWS</p>\n\n<p>Fun fact: Honestly, when I was a child I thought that this was what Resident Evil was about. I was quite disappointed when I learned the truth...</p>\n\n<p><strong>RONIA ETSIMÄSSÄ (FINDING RONI)</strong><br/></p>\n\n<p>A tale of a man and his trusted companion; a bottle of Vodka.</p>\n<p>Your second most trusted companion Roni has bolted into the cold winter night and you must get him back before you two freeze to death! To help you whit this this task is your bottle filled with a magical mixture of warming liquid that keeps the cold away.</p>\n<p>Hurry now before you miss the most important event of the year! Watching live from the TV as the President couple shakes hands with famous people.</p>\n<p>Fun Fact: Read down below.</p>\n<p><strong>ITSENÄISYYSPÄIVÄN VASTAANOTTO SIMULATOR (INDEPENDENCE DAY RECEPTIONS SIMULATOR)</strong></p>\n<p>Indeed.<br/></p>\n<p>Instead of celebrating with good food or drinks, we anxiously watch the TV as the President couple shakes hands with the elite of Finland. Truly a wonderful sight to behold. </p>\n<p>But have we ever wondered how it would feel to be the one who has to shake all those hands? Wonder no more as with the power of Virtual Reality you too can experience this presidential duty.</p>\n<p><strong>SANTA SLEIGHER</strong><br/></p>\n<p>This jams only mobile game puts you in the boots of Santa as he flies over Finland.</p>\n<p>Drop presents and coal into the chimneys.</p>\n<p>Fun Fact: Although #FAKENEWS would have you believe other wise, Santa's real home is located in Finland at Korvatunturi instead of The Northpole.</p>\n<p><strong>SIMO (SIMO)</strong></p>\n\n<p>In this 1vs1 online multiplayer game you fight each other in the winter war setting...</p>\n<p>I'd tell you more but the servers don't work for me right now. Well at lest we have a pretty picture here.</p>\n<p>Fun Fact: Simo Häyhä is one the most famous snipers in the world, having 259 confirmed sniper rifle kills. And he did not use a scope as that could have revealed his position.</p>\n<p><strong>SUOMI OTOME NO PERKELE</strong><br/></p>\n\n<p>How would a Japanese interpretation of a classic Finnish painting look like?<br/></p>\n<p>Well just add some anime girls and over the top action and you should be good to go!</p>\n<p>Follow Suomi Maiden as she attempts to fight the evil Eagle of Weanajä.</p>\n\n\n<p>Yes I'm certain we don't need those tentacles in this one Japan, now go away.</p>\n\n<p><strong>TUNTEMATON YLIPÄÄLLIKKÖ (THE UNKNOWN COMMANDER IN CHIEF)</strong><br/></p>\n\n<p>Not everything in Finland's history is nice and happy, but those times should Not be forgotten.  Soon after declaring independence, Finland got in to a bloody civil war between the democratic Whites and communist Reds. The whites won in the end but they did not treat the losers greatly.</p>\n<p>Take the role of an unknown supreme commander of the White Forces in the Finnish Civil war and take out your enemy.</p>\n<p>No Fun facts about this one.</p>\n\n<p>And last but not least:</p>\n<p><strong>ÄMPÄRIPELI 2017 (BUCKET GAME 2017)</strong><br/></p>\n\n<p>We Finns love some weird stuff I admit it. Like salmiakki, rye bread, sauna and others but I doubt you expected this one.</p>\n<p>As Americans go crazy over Black Friday deals, we go crazy when a store is promising a free bucket to the 100 first customers. I don't need a bucket really... But... Imagine what I could do with a bucket... I NEED THAT BUCKET MAN!</p>\n<p>Fun Fact: What that ämpäri thing above wasn't enough?</p>\n\n\n<p>And so that's all the games you will find in our bundle this time! Be on the lookout for future installments and have look at one of our older ones:</p>\n<p>https://kajakgames.itch.io/kajak-games-summer-game-jam-package<br/></p>", "metacritic": null, "released": "2017-12-05", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/52c/52cf0cf13bfe847ae789349946a48326.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 86, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["KajakGames"], "genres": [], "publishers": [], "esrb_rating": null}