{"id": 10747, "slug": "void-destroyer-2", "name": "Void Destroyer 2", "name_original": "Void Destroyer 2", "description": "Start with barely a ship, end with an empire. <br/><strong>Void Destroyer 2 is currently a work in progress (including this page) - with Early Access started in September of 2016 and a planned Release in 2017.</strong><br/><br/>Void Destroyer 2 is a space sandbox game set in a desolate asteroid field. These are dangerous times with many opportunities, for the explorers, the brave, the cunning, and the ruthless.<br/><br/><br/><br/>Chose the path of a mercenary protecting transport ships. The path of a pirate, preying on the weak. A bounty hunter who will settle scores for a price. An entrepreneur, starting your own business as a trader or miner. Become a tycoon with others working for you, protect your assets by assigning escorts. <br/><br/><br/><br/>The path to domination isn't always a straight one, if you fight hard enough, smart enough, nothing will stand in your way.<br/><br/>As your wealth grows you'll upgrade your ship, then purchase new more powerful ones. Eventually being able to build up a fleet of combat and non-combat ships. What's a fleet without a way to tell them what to do? Void Destroyer 2 has a built in real time strategy (RTS) control method optimized for controlling multiple ships and fleets.<br/><br/>Void Destroyer 2 is inspired by classic sandbox games, but is also a response to them:<br/><ul>\n<li>Open sandbox for you to explore.<br/></li><li>Fly any ship - from small fighters to huge carriers.<br/></li><li>Multiple control methods. From direct flight to capital ship oriented schemes.<br/></li><li>Made for the PC (not consoles) and for PC gamers. Learning curve and challenges ahead.<br/></li><li>Build up a fleet.<br/></li><li>Own multiple ships? Easily give them orders via a RTS control method.<br/></li><li>Own multiple ships? Easily switch direct control from ship to ship.<br/></li><li>Time dilation (slow down time) - make time for decisions and tactics.<br/></li><li>Missions and events.<br/></li><li>Conquer territory and own property. (Early Steps - in development during Early Access)<br/></li><li>An engaging story line, with unique missions and boss battles. (Not currently in build - planned feature during Early Access)<br/></li><li>Be a pirate, then become a pirate lord.<br/></li></ul><br/><strong>Void Destroyer 2 emphasizes combat, tactics and strategy, with battles ranging from one on one to fleets versus fleets. With a simple, manageable yet engaging economy and offers loads of freedom to the player on how to play and who to play as. </strong>", "metacritic": null, "released": "2016-09-22", "tba": false, "updated": "2023-02-19T12:52:58", "background_image": "https://media.rawg.io/media/screenshots/a27/a2745df18127e3001d7d02381bc49e79.jpg", "website": "http://www.VoidDestroyer.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 29, "dropped": 3}, "playtime": 2, "achievements_count": 48, "ratings_count": 4, "suggestions_count": 255, "game_series_count": 0, "reviews_count": 4, "platforms": ["PC"], "developers": ["Iteration 11"], "genres": ["Action", "Adventure", "Strategy", "Simulation", "Indie"], "publishers": ["Iteration 11"], "esrb_rating": null}