{"id": 10756, "slug": "lifeless", "name": "Lifeless", "name_original": "Lifeless", "description": "<strong>Note on Early Access:</strong><br/><br/>LIFELESS is in Early Access. This means the game is still in active development, and can change drastically throughout development. The Early Access of Lifeless will allow you to experience and make a difference as the game evolves during development. <br/><br/>The team will continue to create new features throughout the process, and those who choose to purchase the game should expect missing content, bugs, incomplete content and potentially game breaking problems.<br/><br/><strong>Game Description: </strong><br/><br/>May 2021. Ten years have passed since patient zero. Ten years since the world turned into an infected wasteland... Two factions fight over resources, whilst battling an ever growing menace of infected humans. How will you choose to survive?<br/><br/><strong>Lifeless</strong> is a Massively Multiplayer Survival game, where you cooperate between players to survive a hostile environment. Experience a world with brutal, bloody combat, detailed environments, unique player skills, traders, merchants, and more. <br/><br/>With regular updates throughout Early Access, you can work with us to help shape the future of <strong>Lifeless</strong>! <br/><br/><strong>Key Features in the Early Access release:</strong><br/><br/><ul><li><strong>Welcome to Stillwater Bay</strong>. Maine’s most popular tourist spot has become a wasteland. Explore lush natural landscapes and deserted towns set after the world has collapsed.<br/></li><li><strong>Learn To Survive</strong>. Find supples, learn skills, trade with merchants in your safe zone and keep your weapons in working order to live in this violent new world.<br/></li><li><strong>Airdrops</strong>. Work with your faction to capture airdrops, and you can earn a rewards for your team. Be careful - the other faction will be after it, too.<br/></li><li><strong>Choose A Side</strong>. Two factions fight for survival – The civilian Nova Guard, or the crazed Spartan Phalanx, each with their own safe zones with merchants and traders<br/></li><li><strong>Fight For Your Life</strong>. Brutal, melee-focused combat means you have to get up close and personal if you want to save your ammo, or bolster your firepower with a number of different pistols, machine guns, the community requested bolt action rifle, and more!<br/></li><li><strong>Get Stronger</strong>. Train with your faction, and learn skills that will help turn the tide of battle<br/></li><li><strong>An Infected Threat</strong>. It’s not just the other faction you need to watch out for. Zombies will stop at nothing to take you down.</li></ul>", "metacritic": null, "released": "2016-06-16", "tba": false, "updated": "2023-12-18T17:44:42", "background_image": "https://media.rawg.io/media/screenshots/e93/e930fc9bb618c80abef61fc62a51ba21.jpg", "website": "http://lifelessgame.com/", "rating": 0.0, "rating_top": 3, "added_by_status": {"yet": 7, "owned": 103, "toplay": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 5, "suggestions_count": 293, "game_series_count": 0, "reviews_count": 5, "platforms": ["PC"], "developers": ["Rigid-Soft"], "genres": ["Action", "Indie"], "publishers": ["Rigid-Soft"], "esrb_rating": null}