{"id": 107514, "slug": "magnethead-construction-company", "name": "Magnethead Construction Company", "name_original": "Magnethead Construction Company", "description": "<p>Slapstick comedy physics game where you're a magnet who has trouble letting go of things. Use your magnetic personality to build the tallest skyscraper you can, before the work day is over.<br/></p>\n<p><em>Made in 72 hours for #SalvageJam, a game jam where you take an abandoned game of yours and finish it. All I had was a character and some very wonky magnetic physics - so I reworked it into a construction game.</em></p>\n<p><strong>Instructions</strong><br/></p>\n<p>Use your magnet head to pull the steel beams onto the blueprints to build the skyscraper before the time runs out. You gain 10 seconds on the clock for each beam placed, and a minute+ for each floor completed.</p>\n<p>Simple controls but intentionally diabolical movement:<br/></p>\n<strong>Action</strong><strong>Control</strong>WalkWASD, Arrow Keys, or Left joystick<br/>JumpSpacebar, or A button on Joystick<br/>Try to let go of metallic objects<br/>Smash the jump button rapidly while trying to walk in the direction away from the metallic object (or in a random direction if that works).<br/>\n<p><strong>Tip 1:</strong> You may need to figure out how to use the crane for effective construction on higher floors. Press against the crane for better friction.<br/></p>\n<p><strong>Tip 2:</strong> The more you carry, the heavier you are. It is a constant struggle between gravitational force versus magnetic force. </p>\n<p><strong>Tip 3:</strong> Use your head! The magnets are stronger at the poles (top of the head) and will have more grip for climbing up beams and walls, especially if it is not blocked by junk.<br/></p>\n<p><strong>Exhibition Edition<br/></strong></p>\n<p> A separate build geared for exhibitions is also available. To quit the exhibition edition, press Alt+F4. Escape will not work. The game will automatically reset if it is not played for 30 seconds after the first movement or jump. After game over, it will automatically reset in 15 seconds if the player does not restart.<br/></p>\n<p><strong>Third Party Attributions</strong></p>\n<p>Music: <em>Builder</em> by Kevin MacLeod, incompetech.com. (CC-BY); Icons (from NounProject): Crane by Bakunetsu Kaito, Clockwise by Travis Avery (CC-BY), Steel by Iconfly, Circle Arrow by Eric Miller (CC-BY); Sounds: Anvil by blevsque4 (CC-BY), Gong Hit by GowlerMusic (CC-BY). Font:DCC Ash by dccanim.</p><p><strong>Trivia</strong>: Magnethead is a character I originally drew as an icon/mascot for my smart study web app, Headmagnet, back in 2008!<br/></p>", "metacritic": null, "released": "2018-03-05", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/26d/26d95852335b84da7abe7825af848f4c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 57, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["andyman404"], "genres": ["Action"], "publishers": [], "esrb_rating": null}