{"id": 107557, "slug": "crescent-hollow-itch", "name": "Crescent Hollow (itch)", "name_original": "Crescent Hollow (itch)", "description": "Download on Steam<br/>What is Crescent Hollow\r\n<p>Crescent Hollow is an Action RPG, (2D Top Down Orthogonal).\r\n\"As above, so below, discover the mysteries of the hollow\". Step into \r\nthe world of Anthropia where you can dynamically change the world \r\nenvironment. Will you help the empires of the world, or destroy them? \r\nFour different classes with unique stories, and around a dozen party \r\nunits to summon at the barracks. (Build your own party + Couch COOP)<br/></p>\n<p>Crescent Hollow has been in development since 2015 and is a \r\nhandcrafted game from the ground up with custom music, sound design, \r\nart, and code.</p>\n\n<p>There are currently 4 classes to choose from: Airship Pirate, Ninja, \r\nDruid, or Dark Knight. All 4 classes have been fully animated, have \r\ntheir own unique intro story, and wield around 20 powers each.</p>\n\n<p>Real-time action combat, each class has about twenty powers and four \r\nto six standard attacks with their class weapon. Combat is about 75% \r\ncomplete, yet fully functional for the DEMO.</p>\n\n<p>Dynamic airship battle system that allows you to experience real-time\r\n combat in the skies. You can fire cannons, upgrade your cannons, \r\ncustomize your sail, and you will have to repair your hull after certain\r\n battles.</p>\n\n<p>Complex, yet comprehensive stat system, complete with resists for player, party and enemy.</p>\n<p>ATTRIBUTES:</p>\n<p>STRENGTH – Multiplies melee damage</p>\n<p>INTELLIGENCE – Multiplies Magic/Elemental damage</p>\n<p>VITALITY – Health Pool and Regen</p>\n<p>ENDURANCE – Stamina Pool and Regen</p>\n<p>WISDOM – Mana Pool and Regen</p>\n<p>AGILITY – Movement Speed</p>\n<p>DEXTERITY – Attack Speed</p>\n<p>Current Resists: Fire, Ice, Water, Lightning, Earth, Air , Dark, Light<br/></p>\n\n<p>So far there are about 30 fully animated creatures in the game, half \r\nof them can be gained via quests and can be commanded with command \r\nscrolls, then summoned at the barracks. (*not all enemies can be turned \r\ninto party units.) When you buy command scrolls at the barracks, and \r\nthen use a command scroll, it has a 15% chance of sucking the soul of \r\nspecial enemies in, then it turns into a command card. From there you \r\ncan summon that particular creature at the barracks. Plenty of bosses to\r\n fight!</p>\n\n<p>Three controllable party members called \"Party Units\", mix and match \r\nthem, level them up, unlock new powers. The barracks buildings can be \r\nfound in any major Empire or town, and is used to summon your party \r\nunits. *Each class starts off with their own unique party units.</p>\n\n<p>Experience combat with up to four friends. (refer to Kickstarter video for more footage)</p>\n\n<p>Harvest items from plants, trees, enemies. Craft potions from the \r\nalchemy station, weapons/armor at the anvil, cook food from the \r\ncampfire. Gather wood, stone, and ore to build your empire from the \r\nground up. You will also be able to farm. The build system ties into the\r\n games main story quest, it will all make sense as you play. For now, we\r\n will explain the best we can since build mode is not in the DEMO. In \r\nthe near future, we will release a build mode DEMO since the system is \r\nquite complex.</p>\n\n<p>Around a dozen biomes, each highly detailed and fleshed out. Multiple\r\n overworld maps. Explore the islands of the seas and the skies.</p>\n\n<p>The day/night cycle is connected to a global clock. There is also a \r\ncalendar that keeps track of every day of each month so that events can \r\nbe triggered any day of the month. As day turns into night it becomes \r\nespecially dangerous as there are exclusive nighttime creatures that \r\nspawn.</p>\n\n<p>SOUNDTRACK:\r\nhttp://crescenthollowgame.com/soundtrack/</p>\n<p>Fully customized music to bring the world of Crescent Hollow to life.\r\n The composer has brought her unique sounds in creating modern retro \r\nstyle music. <br/></p>\n\n\n<p>Platforms: Steam, PC, Mac, Linux, Switch<br/></p>\n<p>Distribution: Steam, Nintendo eShop, and DRM free</p>\n<p>Genre: aRPG (Action RPG) , Light RTS elements</p>\n<p>Retail Price: $14.99</p>\n<p>Engine: Unity</p>\n<p>Be sure to sign up for the newsletter:</p>\n<p>http://crescenthollowgame.com/</p>\n<p>Business Inquiries: contact@shadowinkdesigns.com</p>\n<p>Game Feedback: contact@shadowinkdesigns.com</p>", "metacritic": null, "released": "2017-10-04", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/090/090450d81911099a4c0ab82e408a0ed1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 378, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ShadowInk Designs"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}