{"id": 107677, "slug": "last-man-driving", "name": "Last Man Driving", "name_original": "Last Man Driving", "description": "<p>Last Man Driving is combination of two genres: Battle-Royale and Racing.<br/></p><p>Every round 10 players (9 AI) are spawned and only one can be the winner.<br/>AI will attack you and other AI's if it has weapon and ammunition. Otherwise it will flee.<br/>When there is only you and one AI left, red pole will tell you the position of the AI.<br/>There are fixed places where guns, ammunition and repair kits can spawn.<br/>Every weapon has a small aim assist.<br/>Type of gun and ammunition that spawns is random.<br/>Ammunition and repair kits respawn after some time.<br/>Trees and rocks are generated in random places every round.<br/>Icons on the left notify you about amount of your ammunition for each weapon.<br/>Icons on the right notify you about players that are alive, your kills and if \"Weapon swap\" is enabled.</p>\r\nHow to play:\r\n<ul><li>Pick up an weapon from the ground (RED - Rocket launcher, BLUE - Heavy cannon, YELLOW - Machine gun)</li><li>Pick up some ammunition for your weapon (RED for Rocket launcher, BLUE for Heavy cannon, YELLOW for Machine gun)</li><li>If you want to change your weapon: enable \"Weapon swap\" (SPACE) and drive through an weapon on the ground.</li><li>Every weapon has a small aim assist, so it's not necessary to directly face the enemy.</li><li>Destroy other cars or wait until they will destroy each other.</li><li>If you get damaged pick up repair kit (GREEN)</li><li>Win the game and be proud of yourself!</li></ul>\r\nDefault controls:\r\n<ul><li>Arrows/WASD - Steering</li><li>Left Ctrl/Left Mouse Button - Fire</li><li>Space - Enable/Disable swapping weapons</li><li>Enter - Restart game (works only after win/lose)</li></ul>Have fun!", "metacritic": null, "released": "2018-04-23", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/436/43649facb106970af55397a922703501.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 22, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["Rewzu"], "genres": ["Shooter", "Racing"], "publishers": [], "esrb_rating": null}