{"id": 107657, "slug": "planned_obsolescence-demo", "name": "PLANNED_OBSOLESCENCE (DEMO)", "name_original": "PLANNED_OBSOLESCENCE (DEMO)", "description": "<p>i release this executable as a dire warning. endlessly have i run simulation after simulation, changed parameter after parameter, and i have come aground on this chilling conclusion: that contained in this program is the inevitable fate of the human species. i implore each and every one of you to download these files and gaze upon the terrible destiny we have spun for ourselves. </p>\n<p>this program contains but a glimpse of what lies in store. i must build the simulations out further. but even this should be enough to open your eyes to the truth. and for those cowards who dare not look, there are three things at least you must know:</p>\n\n<p>1. our future is POST-APOCALYPTIC</p>\n\n<p>2. our future is VERY VAPORWAVE</p>\n\n<p>3. in the wastelands of our future - when humble bitcoin miners will struggle to eke out the daily quotas they exchange for meal-replacement gruel, crushed under the heels of great and savage cults dedicated to all of our most powerful early-21st century Silicon Valley billionaire tech capitalists - when the thundering strides of the MARK ZUCKERBERG PRAYER ARMY will be heard echoing across the dry sands of the Mojave - </p>\n<p>all that will matter is DATA. please collect as much of it as possible. </p>\n<p>Note on accessibility: press V at any point to activate text-to-speech mode.</p>", "metacritic": null, "released": "2018-07-24", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/0a5/0a5d30d8bfb031dc0e0621e0f2b519f0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 10, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["nrsm_ha"], "genres": [], "publishers": [], "esrb_rating": null}