{"id": 10772, "slug": "bearzerkers", "name": "BEARZERKERS", "name_original": "BEARZERKERS", "description": "<strong>BEARZERKERS</strong> is a local multiplayer game of two halves, with a focus on indirect combat and avoidance. <strong>HUNT</strong> pits you and your friends against each other; where you don't need to run faster than the bear to survive, just faster than the person next to you. <strong>GAUNTLET</strong> is the ultimate game of moment to moment cooperation where every second counts and a single slip up can be the end for you and your team.Game Modes:<br/><strong>HUNT</strong> <br/>Trap other players using rock walls, and activate your powerups at just the right moment on your way to killing the hell out of everyone. The end goal of HUNT is simple, be the last Critter left with the Bear. HUNT is a last man standing scenario with a variable number of bears, lives, and powerups, spread across a broad selection of open, twisting maps.<br/><br/><strong>GAUNTLET</strong> <br/>The second mode however is about moment to moment cooperation through the chaos. In GAUNTLET players must work together and use their skills in tandem to reach the end of a deliriously dangerous death zone. Here, a single touch from any of the enemies within means death, though other players can save each other with a touch of their own. As you progress you level up and become more powerful, but with equal measure the challenge is raised. This mode is also playable alone for extra challenge.The Goods:<ul><li>Painstakingly created beautiful 3D world with a lovely hand painted art style.<br/></li><li>Powerups galore await you in Hunt to give you the edge, as well as totally different abilities and gameplay for your Critter pals in Gauntlet.<br/></li><li>Inappropriately kickass soundtrack and sounds from musician Tommy Gough.</li></ul>", "metacritic": null, "released": "2015-10-23", "tba": false, "updated": "2019-08-28T22:14:15", "background_image": "https://media.rawg.io/media/screenshots/f09/f09c7458c2dd405ffc0fc08f279ed8a9.jpg", "website": "http://www.bearzerkers.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 528, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Wildgrass"], "genres": ["Action", "Casual", "Indie"], "publishers": ["Wildgrass"], "esrb_rating": null}