{"id": 10779, "slug": "sceal", "name": "Sceal", "name_original": "Sceal", "description": "\"A magnificent mini Irish folklore adventure game. 9/10 \" gameskinny.com<br/>\n<br/>\r\n\"...hauntingly beautiful adventure game. 77%\" cogconnected.com<br/>\n<br/>\r\n\"...I definitely say it’s a beautiful gem, which everyone should try. ...Great game, buy it, peace. 7/10\" invisioncommunity.co.uk<br/>\n<br/>\r\n\"Scéal is not your ordinary game. It will stay with you forever. It will leave footprints in your mind.\" infinitegaming.es<br/>\n<br/>\r\n\"...This game is a work of art...\" oneangrygamer.net<br/>\n<br/>\r\n\"Sceal is a game that I can recommend to anyone who likes interesting story with beautiful Irish music and artistically painted world.\" vgdb.pl<br/>\n<br/>\r\n\"...this is a gorgeous fairytale with simplistic gameplay and a tragic story. I love the art design and need to download the soundtrack immediately.\" defunctgames.com<br/>\n<br/>\r\n\"Lovingly animated in a hand-drawn watercolour style and underpinned by a haunting soundtrack, Scéal makes a handsome first impression.\" independent.ie<br/>\n<br/>\r\n\"The authors have artfully combined music, graphics and story into a harmonious unit with artistic value and skillfully filed storyline. 8/10\" sector.sk<br/>\n<br/>\r\n\"A good pick...\" graal.fr<br/>\n<br/>\r\n\"In short: \"Scéal\" - small game, but very big! 91%\" adventurespiele.net<br/>\n<br/>\n<br/>\r\n-------------------------------------<br/>\n<br/>\n<br/>\r\nSteeped in supernatural Irish folklore, Scéal (which means \"story\" in Irish) casts players into the role of the lost soul of a little girl, destined to wander the earth, with no memories of the life she once lived. <br/>\n<br/>\r\nLonging for release from her limbo, the spirit encounters Branna, the Raven of the Dead, who promises to take the girl to the afterlife if she can rediscover her name and recover the story of the life she once lived by reliving her memories inside the pages of Branna's magical storybook. <br/>\n<br/>\r\nAt the heart of Scéal’s gameplay is its vibrant watercolour paint palette. Players must complete quests by painting buildings and objects to progress the storyline. Scéal also features a day/night cycle with colour palettes and music that change as the story / time progresses. Playing as the little spirit, players can transform into an angel of light or a dark banshee, repainting the world as they move through it, changing the world from happiness to despair and back again. <br/>\n<br/>\r\nAlong with it's unique visual style and art direction, Scéal has a distinctive and hauntingly melodic soundtrack, sung in Irish and made in collaboration with renowned Irish folk singers Lorcan Mac Mathuna, Aislinn Duffy and Florence Glen.", "metacritic": null, "released": "2016-10-26", "tba": false, "updated": "2019-08-28T22:14:15", "background_image": "https://media.rawg.io/media/screenshots/626/6265340bad13709e325e2e4adc76f71f.jpg", "website": "http://scealthegame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 4}, "playtime": 4, "achievements_count": 5, "ratings_count": 0, "suggestions_count": 437, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Joint Custody"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Joint Custody"], "esrb_rating": null}