{"id": 107815, "slug": "alchemist-penguin-itch", "name": "Alchemist Penguin (itch)", "name_original": "Alchemist Penguin (itch)", "description": "<p>Support us on Steam Greenlight! :D<br/></p><p>You are a penguin, cut off from the rest of your species by a meteor crashing into the Antarctic tundra. Something has been awoken from deep within the ice… Something that once ruled this land and wants to take it back.</p><p>Dinosaurs.</p><p>Something about their slumber in the ice has advanced their minds significantly, and their crude spears and axes quickly become replaced with more and more sophisticated weapons as time progresses. All that stands between them and the destruction of the world as we know it is you and your knowledge of alchemy.</p><p>Take control of the Alchemist Penguin in the relentless battle against his dinosaur aggressors! Alchemist Penguin is an arcade-style action game where you are pitted in a stage against an army of dinosaurs under increasing difficulty. You are armed with a weapon, a potion and a technique—as well as a variety of single-round boosts and mode-specific abilities—to help you in your fight.</p><ul><li>5 game modes and 15 stages of challenging action</li><li>Over 60 abilities to utilize and level up in your fight against the dinos</li><li>Dino weaponry and tech scales and upgrades as a round goes on</li><li> Over 30 tasks (stage, powerup, and other gameplay challenges) to complete!</li></ul><p>UPDATED - Version 1.5 now available!</p><ul><li>A number of small changes and tweaks to improve the look and presentation of the game!</li></ul><p>Follow us on Twitter @FootITBox or send an email to support@footinthebox.com with any questions or issues! </p>", "metacritic": null, "released": "2015-06-05", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/a31/a311c834b77803520f2d506be6b326f9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 88, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Foot in the Box"], "genres": ["Action"], "publishers": [], "esrb_rating": null}