{"id": 10790, "slug": "zula-europe", "name": "Zula - Europe", "name_original": "Zula - Europe", "description": "Zula is a free-to-play online first person shooter. In Zula you will discover real unique locations as Istanbul, Northern Iraq and other places of the middle east, as well as indoor maps. Ten maps are available for now, all of them have their own particularities and offer a unique challenge. You will totally immerse yourself in the world of Zula thanks to very realistic graphics.<br/>\n<br/>\r\nAs player, you will be able to choose between two different factions of fighters: Zula, a group of vigilantes misunderstood as an organized crime syndicate and Gladyo, an international paramilitary force that has infiltrated almost every military organization worldwide.<br/>\n<br/>\r\nThe game has various game modes as for example Team Deathmatch, Capture the Flag, Free for All or Wanted, and new ones are on the way! Sixteen playable characters, inspired by popular TV heroes and with a unique background story, are available. In order to achieve an authentic feel, all character outfits and equipment are based on exact paramilitary specs. Moreover, you will have the choice between more than 150 weapons and new ones are regularly added to the game as well as items.<br/>\n<br/>\r\nEnjoy all special features of this incredible shooter and do not forget about the mission system in which you will earn fabulous prizes.<br/>\r\nPlay with your friends, improve your character skills, create a clan and participate in tournaments.<br/>\r\nZula offers you a realistic experience like you have never seen before, so don’t miss your objective, come forth and prove your bravery!", "metacritic": null, "released": "2016-11-24", "tba": false, "updated": "2024-04-06T22:16:59", "background_image": "https://media.rawg.io/media/screenshots/b03/b0382142dca1159f1dbf8e8e508187e6.jpg", "website": "https://en.idcgames.com/zula/", "rating": 2.39, "rating_top": 1, "added_by_status": {"yet": 7, "owned": 232, "beaten": 1, "dropped": 18}, "playtime": 1, "achievements_count": 59, "ratings_count": 23, "suggestions_count": 298, "game_series_count": 0, "reviews_count": 23, "platforms": ["PC"], "developers": ["Madbyte Games"], "genres": ["Action", "Massively Multiplayer"], "publishers": ["IDC/Games"], "esrb_rating": null}