{"id": 107961, "slug": "dungeons-dancers", "name": "Dungeons & Dancers", "name_original": "Dungeons & Dancers", "description": "<p>Orcs and DJs!<br/>Torches and spotlights!<br/>Skulls and shiny disco balls!</p>\n<p>Dungeons &amp; Dancers offers you the perfect plan: go partying without leaving your cave. This hilarious rhythm-based video game for PC and consoles mixes up the epic fantasy world with the present music scene to create a crazy adventure where the ultimate weapon is your rhythm skills.</p><p>Enroll yourself in an epic tour! Gather the best heroes and delve into the guts of the Dancegeons, musically cursed dungeons. Follow the rhythm to avoid falling prey to their traps, collect as many treasures as you can and escape before the time runs out!<br/></p>\n<p>Embody famous artists such as Strollex, creator of Dubgeonstep; dodge every trap with the swag of Justin Thiefberlake or leave your enemies with a poker face with the steps of Lady Gar-Gargoyle.</p>\n<p>Dozens of other artists remain trapped in the depths of the Dancegeons. Rescue them and add them to your party crew!</p>\n<p>Beat the rhythm and never stop partying!</p>\r\nFEATURES\r\n<ul><li>Hilarious characters resulting from mixing up famous music stars with fantasy races. (In the demo you play as Strollex)</li><li>Simple and intuitive control system.</li><li>Music responsive scenarios that react to the player’s progression.</li><li>Stunning OST.</li></ul>\r\nGAME CONTROLS\r\n<p>Use the directional keys or the D-pad to move to the music. The best you follow the rhythm the craziest the party will become! Avoid all the traps and enemies, collect all the treasures and scape before the time runs out!<br/></p>", "metacritic": null, "released": "2018-07-11", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/e1b/e1b80d0005393aa05d30ccc0878b35c2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 66, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Impressive Entertainment"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}