{"id": 10793, "slug": "1993-space-machine", "name": "1993 Space Machine", "name_original": "1993 Space Machine", "description": "<strong>Space shooters never die.</strong><br/>1993 is a testament to that, honoring classics like Life Force, R-Type and Xenon II. We're keeping the genre alive.<br/><br/>1993 was made in 1993. It is not made to look retro. It is not polished for today's tech - this is the genuine thing!<br/>It's 1993 in 2016!<br/><br/><br/><br/><br/><br/><br/><ul><li>Your're in charge! Explore and secure the different worlds in the order that fits your taste and urge.<br/></li><li>The kick ass weapon system lets you unlock weapons for use in later play sessions. We feature both classic powerful weapons plus some fresh smart weapons.<br/></li><li>Of almost 100 deadly enemy types, we have crafted unique evil behaviours for most of them.<br/></li><li>As an extra game mechanic we have introduced a new health and shield system for more interesting game play.<br/></li><li>Up to four player co-op mode.</li></ul><br/>In short:<br/><ul><li>10 Ships to choose from<br/></li><li>25 Different weapons with 3 power levels<br/></li><li>13 Levels<br/></li><li>10 Different Bosses</li></ul><br/>Started in the age of the Amiga 500, this game was featured in Amiga format and Commodore User - two of the largest gaming magazines of the time. A series of unfortunate events prevented this space shooter to get finished. We plan to do that now!<br/><br/><strong>Featured on:</strong><br/> <br/><br/><strong>Game story:</strong><br/>\"Towards the end of the interstellar wars, chaos spread and one band of elite mercenaries acted more like pirates and looters than actual soldiers. The leader of this group was the notorious and infamous Colonel Nestor.<br/><br/>Without a doubt the biggest prize of their looting campaigns was the Spacemachine: a device designed to terraform barren planets and making them habitable. With this device, and the rest of their treasure, Nestor and his men started to build an army that now poses a great threat to the known star systems.<br/><br/>Mission: Bring back the Space Machine.\"", "metacritic": null, "released": "2016-03-28", "tba": false, "updated": "2022-09-30T04:38:41", "background_image": "https://media.rawg.io/media/screenshots/0b2/0b235aa29180946eece7da4fd46220e4.jpg", "website": "http://www.1993game.com", "rating": 1.86, "rating_top": 1, "added_by_status": {"yet": 20, "owned": 411, "beaten": 3, "toplay": 1, "dropped": 3}, "playtime": 1, "achievements_count": 11, "ratings_count": 7, "suggestions_count": 403, "game_series_count": 0, "reviews_count": 7, "platforms": ["macOS", "PC"], "developers": ["Modesty"], "genres": ["Action", "Indie"], "publishers": ["Modesty"], "esrb_rating": null}