{"id": 107945, "slug": "the-chosin-few", "name": "The Chosin Few", "name_original": "The Chosin Few", "description": "The Chosin Few is a local splitscreen competitive FPS, that revolves around a team of invisible swordsmen hunting a team of gunmen in a game of sudden death.<p>\n<br/>\n</p><p>\n<br/>\n</p>Screenlooking is highly encouraged.<p>\n<br/>\n</p><p>\n<br/>\n</p><p>\r\n\tThe Chosin Few is inspired by the Battle of Chosin Reservoir, which occurred during the Korean War in the midst of winter, where UN forces were surrounded in a frozen forest.\r\n</p><p>\r\n\tTeams are divided by faction:\r\n</p><p>\n<strong>Swordsmen, called Chosin, are invisible and can move quickly across the map while taking 2 hits before they die.</strong>\n</p><p>\n<strong>Gunmen are killed instantly, but have infinite ammo and flashlights that will reveal a Chosin if pointed at them.</strong>\n</p><p>\r\n\tPlayers must screenlook and use their eyes, ears, wits, and teamwork in order to reach victory over their foes.\r\n\t<br/>\n<br/>\n<br/>\n</p>TEAM:<ul>\n<li>Daniel Pomidor: Lead/Designer/Programmer/2D and 3D Assets</li>\n<li>Rey Cuevas: Art Lead</li>\n<li>Nicholas Lawrence: Composer</li>\n<li>Ethan Mullett: QA, Facilitation</li>\n<li>Kamron Shushtar: Sound Design</li>\n<li>Camille Vincent: Animation</li>\n<li>Giovanna Coutinho: Rigger</li>\n<li>Sean Stephenson: Rigger</li>\n<li>Dima Dubodel: Level Designer</li>\n<li>Oran Domingue: Level Designer</li>\n</ul>STRATEGY:<p>\r\n\tThe Chosin Few revolves around two factions: The Chosin and The Gunmen. Chosin are agile, hardy, and invisible. They utilize a sword to get one-hit kills. The Gunmen are slow and weak, but are armed with semi-automatic pistols that kill the Chosin in two shots. They also have flashlights, which will reveal the Chosin when shined on them, but have limited range.\r\n</p><p>\r\n\tTeams must work together to eliminate the other team, while utilizing screenlooking and their ears to figure out where the other players are in relation to themselves. Players can blindfold themselves with the \"X\" button, which prevents other players from looking at their screen, but also blinds themselves. You can still be killed while blindfolded, so be careful! It has a 5 second cooldown to put on and take off.\r\n\t<br/>\n</p><p>\r\n\tFor further customization and to encourage passing controllers around, we've also made control customization easy. Pressing the \"Y\" button will toggle the look inversion on and off. Pressing \"Up\" on the \"D-Pad\" will increase look sensitivity, while pressing \"Down\" will lower it. These settings reset each life (we know, we're working on it), but we believe make it easier to quickly play the game without halting everyone else's enjoyment\r\n</p>PLAYING CHOSIN:<p>\r\n\tThe Chosin are speedy hunters that are downright terrifying when played properly. Here are some tips:\r\n</p><ul>\n<li>Jump, then swing your sword. Swinging your sword lunges you forward in whatever direction you're looking. When you're in the air, this lunge is far stronger, and serves as a key way of getting around the map and catching and ambushing fleeing Gunmen, as well as dodging shots when injured. </li>\n<li>You can get hit twice before you die, so don't be afraid to rush the other team.</li>\n<li>Utilize your environment. The trees and bushes are your greatest allies. Also use the high ground to ambush players. Combined with a sword lunge you can move long distances very quickly.</li>\n<li>If working on a team. use one player to distract the Gunmen while the other ambushes them.</li>\n<li>A good Chosin can kill two Gunmen with one swing.</li>\n<li>The Blindfold is a handy way for the Chosin to escape when they're out of options.</li>\n</ul><p>\n<br/>\n</p>PLAYING GUNMAN:<p>\r\n\tThe Gunmen seem to be at a disadvantage, but coordination and discipline can ensure easy victory. Here are some tips:\r\n</p><ul>\n<li>Stick together. Gunmen are far weaker alone than they are together, and chances of survival rise far higher if you watch each other's backs.</li>\n<li>Just because you can't see them with your flashlight doesn't mean you can't hit them. If you look at a Chosin's screen and have a good guess where they are, a well-placed shot can still hit them, even if they're out of range of your flashlight's shine.</li>\n<li>Use chokepoints to your advantage. Move to the high ground to narrow paths of pursuit by the Chosin down to as few as possible. Staircases and hallways are your friend.</li>\n<li>If you've hit a Chosin once, they will start bleeding. Even if you can't see them, you can see the blood they leave on the ground. Follow their blood.</li>\n<li>Two gunmen firing simultaneously at the same Chosin will kill a Chosin instantly.</li>\n<li>You can see the Chosin your teammate reveals. Use that to your advantage.</li>\n<li>Blindfolds on the Gunmen are less handy than on Chosin, but can still help you hide if you need to.</li>\n</ul><p>\r\n\tThe Chosin Few was a game that I designed and programmed during my final year at SCAD (2015-2016) as an exercise in creating a more-or-less fully formed multiplayer, couch-game FPS. I considered creating a company and putting the game through the Steam Greenlight process, but then we all graduated.</p><p>I was also highly discouraged to complete it upon finding out about the creation of \r\n\tChambara, which was created in a similar environment (USC, not SCAD),  style, design, and premise to ours, but basically beat us to the punch. Not wanting to appear as though I'm stealing their idea despite not hearing about it until I was starting final artpass, I stopped working on it.\r\n</p><p>\r\n\tThe game never quite reached the point of completeness that I wished it would, I rushed to finish modeling and programming it before graduation (development already suffering because I was leading, coding, promoting, and running DAEMON at the same time as making this) and at this point I've put it on hold to pursue other projects and not have to also worry about the legality of completing development without the majority of the team, etc etc. At the moment, the game is severely unoptimized, and can only use Xbox 360 controllers. Play at your own risk, though do let me know if you enjoy it.\r\n</p>", "metacritic": null, "released": "2017-01-30", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/bc9/bc943eaba68e48f4ef07c4a457bfd37b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 213, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Forward Instinct"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}