{"id": 108006, "slug": "illusions-of-loyalty", "name": "illusions of loyalty", "name_original": "illusions of loyalty", "description": "<p>The first main game in the \"Shackles of Varn\" universe (The same world as Heresies of Discord)<br/> <br/>Illusions of Loyalty is a short RPG game with a dark story about loyalty and the risks of blind trust, combined with a challenging battle system. <br/> <br/>General information: <br/>Illusions of loyalty is about 3-6 hours long to play through, depending on the difficulty level you choose and how much trouble the bosses give you. While the difficulty of the game leans on the \"hard\" side of the spectrum, there is are easier difficulty settings for those who are less hardcore.<br/> <br/>Story: <br/>War rages on between the Kingdom of Styx and the Gaius Republic. Worse still, Styx is on the brink of civil war due to the actions of a growing rebel movement. When a particularly violent attack implicates the brother of Captain Julius Logan, his loyalties are called into question. <br/> <br/>To prove his dedication to Queen and Country, Logan will have to do the impossible. Take three fellow soldiers into the neutral Eutorian Empire, assassinate their Queen, and pin the blame on Gaius in hopes of swaying the neutral Empire into joining their desperate war. <br/> <br/>Taking his kingdom's fate in his hands, Logan sets out with his three comrades, unaware of just how dire his situation is about to become... <br/> <br/>Gameplay: <br/>The combat in Illusions of loyalty is based around managing Aggression. Do you spend your Aggression on a powerful attack now, or do you hold back in case the boss might prepare to launch a devastating attack next turn? <br/> <br/>Do you go full offense and risk being punished severely, or do you put up your defenses and risk missing a window of opportunity? These are the decisions you will be faced with regularly, especially in the boss fights. And yet, for every impossible situation, there is a solution. <br/> <br/>Boss fights are designed around identifying the boss's specific patterns and weaknesses, and then using your character skills intelligently to turn the tide of battle in your favor. These bosses will test your abilities, patience and drive at every turn. Master the system, and you may just stand a chance. <br/> <br/> <br/>Features: <br/>No random encounters! <br/>- All normal battles are on-field sprites that can be avoided if you want! <br/> <br/>Quick to pick up, deeper than you think! <br/>- Each character has 6 unique skills, each one with their own uses and advantages. What might seem like dead weight at first glance might prove to be a saving grace in the right situation! <br/> <br/>Six challenging boss battles! <br/>- Three story bosses, 3 optional, all incredibly devious. Conquer them! <br/> <br/>Play smart, grind less! <br/>- Intelligent use of your skills, and proper understanding of the bosses can allow you to beat them at surprising levels. My personal record is finishing the game at level 7 on |Legend|.<em><br/>(Note: The current record is held by NeverSilent who beat the game at levels 4-4-5-4, and who skipped all the normal combat encounters. I'm still in shock)</em> <br/> <br/>Save as you please! <br/>- Do you want to save at will? You can do that. Would you rather go retro and be at the mercy of Save Points? You can do that too!<br/> <br/>Accessorize! <br/>- Enemies will sometimes drop accessories that let you tweak your characters. From first-turn advantages to regenerating HP over time, there's many to choose from! <br/> <br/>3 difficulty modes <br/>|Legend| - AKA, the hardcore mode <br/>- No mercy. Adapt on the fly, or die trying! <br/> <br/>|Knight| - AKA, the standard mode <br/>- Disables or weakens the 3 most \"unfair\" boss moves. <br/>- Allows the purchase of level-up manuals from shops. <br/>- Hints for dealing with bosses can be found by speaking with the townsfolk or other events. <br/> <br/>|Soldier| - AKA, the easy mode <br/>- Not hardcore? No problem! All the benefits from |Knight| mode apply, plus more! <br/>- Start with four headgear items that double EXP rate, gold drop rate, item drop rate, and boost attack and defense by an additional 50%.<br/></p>", "metacritic": null, "released": "2016-03-29", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/245/245c438647bfb08e18d87218f8063a45.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 173, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Aegix Drakan"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}