{"id": 108037, "slug": "knifey-spoony", "name": "Knifey Spoony", "name_original": "Knifey Spoony", "description": "Knifey Spoony\r\n<p> - A game for PICO-8 by Jonic and Ribbon Black</p>\r\n\r\nI see you've played Knifey Spoony before!<br/>\n<p>Knifey Spoony is a game in which the player must identify knives and spoons within an ever-decreasing time limit.</p>\n<ul>\n<li>Concept and code by Jonic Linley</li>\n<li>Artwork by Ribbon Black</li>\n</ul>\r\nWhy does this exist?\r\n<p>Why not? Also this: https://youtu.be/mcE0aAhbVFc</p>\r\nWhat is PICO-8?\r\n<p>This game is built in PICO-8, a fantasy game console with a very restricted set of tools, and a focus on simplicity.</p>\n<p>I've tried making games in the past, but have often felt my ideas getting too complex, or that I get bogged down by the learning curve of a whole game engine. PICO-8 forces developers to keep things simple by only providing an incredibly limited set of tools with which to author a game.</p>\n<p>One of my favorite things about PICO-8 is that an entire game is just small enough that the entire mental model can fit in your head as you're developing it. I also find myself continually delighted while working on this game, because it's so easy to make things happen. PICO-8 includes:</p>\n<ul>\n<li>An API</li>\n<li>A code editor (optional)</li>\n<li>A sprite editor</li>\n<li>A map editor</li>\n<li>A sound effect editor</li>\n<li>A music sequencer</li>\n</ul>\n<p>...and that's it. The engine itself is left to you. PICO-8 gives you functions to _update and _draw your game at 30FPS (60 is optional), and leaves everything else to you.</p>\n<p>Need a text engine? Write one. Need a sprite animation library? That's on you. Want to apply physics to your sprites? You need to sit under a tree and have an apple hit you on the head and then you go and write the code.</p>\n<p>If you're looking for an introductory platform for game development, then PICO-8 is definitely worth a look.</p>Source code<p>You can find the source code for this game on Github. You're free to do whatever you want with it, so long as you don't use it to make money. Basically, be nice. It's meant to be a learning resource, so if you learn something from it then please try to pass that knowledge on!</p><p>https://github.com/Jonic/knifey-spoony</p>\r\nAny questions?\r\n<p>I can't help you write your game, but I can help explain how this one works if you need help understanding what's going on here. Get in touch with me on Twitter and I'll see what I can do.</p>\r\nContributions welcome!\r\n<p>If you think you can help improve this game, or if you spot a bug, please let me know! I'd love this game to be a well commented source for beginners to get to grips with PICO-8 (despite being a beginner myself when I wrote it), so help with that is also welcome.</p>", "metacritic": null, "released": "2018-06-15", "tba": false, "updated": "2019-08-28T23:24:34", "background_image": "https://media.rawg.io/media/screenshots/d9a/d9a1274a2282a4128821db629eff515d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 7, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Web"], "developers": ["Jonic"], "genres": [], "publishers": [], "esrb_rating": null}