{"id": 108090, "slug": "humans-vs-aliens-vs-robots-war", "name": "Humans vs Aliens vs Robots: War", "name_original": "Humans vs Aliens vs Robots: War", "description": "<p>\n<strong>Overview<br/></strong>\r\n\tA Turn Based 4X war game set in a cluster of stars. Keep your home system safe while attempting to take over enemy home worlds. Build fleets of enormous ships and use them to colonize other systems, take over enemy territory and defend your own. Upgrade your civilizations capabilities through research and development and build a tough defensive position. Or build up an armada and eliminate the enemy from your stars\r\n</p>\n<strong>Instructions<br/>\n</strong>Mouse or touch driven. Scrollable or double click on a system to focus on it.\r\n\t\t\t\t<p>\r\n\t\t\t\t\t/ chat<br/>\r\n\t\t\t\t\t/h whisper to humans<br/>\r\n\t\t\t\t\t/a whisper to aliens<br/>\r\n\t\t\t\t\t/r whisper to robots<br/>\r\n\t\t\t\t\t/l talk to the lobby from in-game\r\n\t\t\t\t</p>\n<p>\r\n\t\t\t\t\t-/= zoom out / in<br/>\r\n\t\t\t\t\th to focus on home system<br/>\r\n\t\t\t\t\tarrow keys to move map</p>\n<p>c to commission a fleet</p>\n<strong>Tips</strong><br/>\n<p>\r\n\t\t\t\t\tPay close attention to the expansion tree during the first few rounds of your game. Upgrading certain technologies first, can make your expansion super efficient.</p><p>An overview of the tech trees is available at </p>\n<p>\r\n\t\t\t\t\tSend fleets to other systems. Once there, they will begin colonizing that system. After a few turns, the system will be brought under your control (unless contested by an enemy). Once under your control, you can upgrade that system with various platforms and increase its economic and military productivity, as well as its defensive capabilities. Send Missile barrages and plant mines for enemy fleets.\r\n\t\t\t\t</p>\n<p>\r\n\t\t\t\t\tBuild enormous fleets to take over neutral and enemy systems, defend friendly systems and engage in battle with enemy fleets.  You can choose to lead individual battles or concentrate on the overall strategy and leave the fighting to your military.\r\n\t\t\t\t</p>\n<p>This game is in beta. To report any problems or provide feedback, please send an email to info@humansaliensrobots.com</p>", "metacritic": null, "released": "2015-01-28", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/138/1380502579cedd94f4871743189993b0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 134, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["hohmann"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}