{"id": 10817, "slug": "bridge-constructor-playground", "name": "Bridge Constructor Playground", "name_original": "Bridge Constructor Playground", "description": "Bridge Constructor Playground offers people of all ages an introduction to the topic of “bridge building”. This game gives you the freedom to let your creative side run riot – nothing is impossible. Across 30 innovative levels you have to build bridges over deep valleys, canals or rivers. Following this your bridges will be subjected to a stress test to see whether they can support the weight of the cars and/or trucks which drive across them.<br/><br/>In comparison to the #1 hit Bridge Constructor, Bridge Constructor Playground offers an even easier entry to the game including an extensive tutorial. With no fixed budget, and next to no limitations on building materials, there are almost no limits: you can build and construct to your heart’s desire. Here you are free to do as you please and let the time fly by with creative bridge building. Experienced players will enjoy the challenges of the new badge system: for every bridge there are 5 badges to be won for which you must fulfill certain requirements. For example, building a bridge that can carry no more than a certain load limit. All of this, paired with a bright and friendly look, makes Bridge Constructor Playground an exciting and also educational experience for the whole family, offering hours of gaming fun.Key Features<ul><li>32 Levels<br/></li><li>5 Settings: City, Canyon, Beach, Mountains, Rolling hills<br/></li><li>Survey map with unlocked worlds / levels<br/></li><li>Extensive tutorial for easy entry to the game<br/></li><li>New badge system for beginners and pros<br/></li><li>4 different building materials: wood, steel, steel cable, concrete piles<br/></li><li>Percentages and colored visualization of building material’s stress loads<br/></li><li>Two different stress levels: car and truck<br/></li><li>High score per Level<br/></li><li>Steam Achievements and Leaderboards</li></ul>", "metacritic": null, "released": "2012-12-20", "tba": false, "updated": "2023-09-02T00:53:11", "background_image": "https://media.rawg.io/media/screenshots/957/9575ef30b113e0f3f4d629a64474212d.jpg", "website": "http://www.bridgeconstructor.com", "rating": 3.45, "rating_top": 4, "added_by_status": {"yet": 29, "owned": 411, "beaten": 5, "toplay": 2, "dropped": 10, "playing": 1}, "playtime": 1, "achievements_count": 21, "ratings_count": 20, "suggestions_count": 271, "game_series_count": 0, "reviews_count": 20, "platforms": ["Wii U", "macOS", "Linux", "PC", "Android", "iOS"], "developers": ["Headup Games", "ClockStone", "Joindots"], "genres": ["RPG", "Simulation", "Casual", "Indie", "Puzzle"], "publishers": ["Headup Games", "Joindots"], "esrb_rating": null}