{"id": 10821, "slug": "grab-the-bottle", "name": "Grab the Bottle", "name_original": "Grab the Bottle", "description": "Grab the Bottle is a quirky puzzle game in which you solve puzzles by stretching your arm through the level. <br/><br/>You need to maneuver an ever-extending arm to grab the goal bottle, avoiding anything hazardous on the way. To make things more tricky, Grab the Bottle brings physics and puzzles to the mix. You must grab, pull and drop objects to get to the goal bottle. On the way you will find different kinds of obstacles that need to be dealt with.  <br/><br/><br/>The story of the game begins in the 50s, somewhere in rural America, where one particularly strong minded baby is taking his first steps and discovers that anything is possible. Especially as he seems to have an infinitely stretchy arm.<br/><br/>Grab the Bottle follows the life of this boy, from cradle to grave, solving many levels of puzzles inspired by “real life problems” on the way. Central element to the story is the specific graving for bottles the main character has and the scenarios include stuff like finding precious antique bottle from an attic or just grabbing a bottle of cold beer after a hard workday.<br/><br/><br/><br/><ul><li>Innovative, twisted way of solving puzzles by stretching and retracting your arm<br/></li><li>Story mode with dozens of levels set in locations ranging from attics to amusement parks, around 7 to 10 hours total.<br/></li><li>Colorful vintage comig -style graphics <br/></li><li>Awesome soundtrack featuring various styles of music, reflecting different life-phases of the main character.<br/></li><li>Trading cards and Achievements! Grab them all!</li></ul>", "metacritic": null, "released": "2016-12-19", "tba": false, "updated": "2019-08-28T22:14:13", "background_image": "https://media.rawg.io/media/screenshots/986/986a9e83ac57e615ffee0ab4971989c3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 6, "owned": 96, "toplay": 1, "dropped": 1}, "playtime": 3, "achievements_count": 31, "ratings_count": 1, "suggestions_count": 188, "game_series_count": 0, "reviews_count": 1, "platforms": ["Xbox One", "Nintendo Switch", "PlayStation 4", "macOS", "PC", "Linux"], "developers": ["Sometimes You", "Evgeniy Kolpakov t/a Sometimes You", "Kamina Dimension"], "genres": ["Action", "Casual", "Indie", "Puzzle"], "publishers": ["Sometimes You", "Kamina Dimension"], "esrb_rating": "Everyone"}