{"id": 10822, "slug": "battlezone-98-redux", "name": "Battlezone 98 Redux", "name_original": "Battlezone 98 Redux", "description": "<p>One of the greatest sci-fi strategy games of all time returns Spring 2016 with remastered visuals, online multiplayer, and near unlimited mod content from Steam Workshop.<br />\nEnter an alternate vision of the 1960s where the “space race” is nothing more than a cover for an interplanetary war between the US and Soviet Russia over mysterious alien bio-metal.<br />\nTake command of an army of sleek heavy assault tanks, strike cruisers, APCs and more, and wreak havoc with super-heated projectiles in your mission to blast your enemy from the face of the Moon, Mars, Venus, Titan, Io and Europa.</p>\n<p>Scavenge the battlefields for crucial bio-metal, deploy powerful defenses, construct advanced facilities and escalate each battle to an epic confrontation.<br />\nRevolutionary, revitalised and remastered, Battlezone 98 Redux’s blend of thrilling first person action and tense RTS gameplay is as essential now as it ever was.FEATURES<br />\nCritically Acclaimed RTS:<br />\nCommand the battlefield and fight vehicle-to-vehicle from the immersive first person cockpit view.<br />\nUnleash mechanized devastation with a huge tactical arsenal including Howitzers, MAG Cannons, Cold Fusion Lasers, Day Wrecker Artillery, and more.<br />\nCustomise and fortify your bases from the ground-up with production factories, power plants, barracks, armouries, command towers and deadly defensive turrets.<br />\nTwo Explosive Campaigns:<br />\nPlay as American or Soviet forces in two separate singleplayer campaigns, with 29 missions across 7 different planetary environments.</p>\n<p>Sleek Remastered Visuals:<br />\nPlay Battlezone 98 as it should have been, in HD with completely remodelled vehicles and buildings, enhanced lighting and shadows, improved particle effects, upgraded animations, upscaled terrain, and more.</p>\n<p>Online Multiplayer for 2-8 players:<br />\nExperience the classic rush of &quot;Deathmatch&quot;, or test your skills in a pulse-pounding battle of wits in &quot;Strategy&quot; mode.</p>\n<p>Steam Workshop Mods:<br />\nTap into a community nearly two decades in the making, and enjoy near limitless new content with support for mods, such as new singleplayer and multiplayer maps, new vehicles, new HUDs, custom scripts and much more.</p>\n<p>Map Editor:<br />\nNot a modder yet? Create your own custom multiplayer arenas with the in-built map editing tool.</p>", "metacritic": 75, "released": "1998-02-28", "tba": false, "updated": "2023-07-22T00:03:27", "background_image": "https://media.rawg.io/media/screenshots/e42/e42e419343786fcb048019422115e3f4.jpg", "website": "http://www.battlezone98.com", "rating": 3.0, "rating_top": 4, "added_by_status": {"yet": 10, "owned": 142, "beaten": 2, "toplay": 4, "dropped": 9, "playing": 1}, "playtime": 3, "achievements_count": 50, "ratings_count": 17, "suggestions_count": 432, "game_series_count": 0, "reviews_count": 17, "platforms": ["PC", "macOS"], "developers": ["Big Boat Interactive"], "genres": ["Action", "Strategy"], "publishers": ["Rebellion"], "esrb_rating": null}