{"id": 108200, "slug": "ice-89-black-ice-demake", "name": "ICE '89: Black Ice demake", "name_original": "ICE '89: Black Ice demake", "description": "<p>This is a demake of @superdupergc's Tron-inspired hacking FPS, Black Ice, made because he was threating to sell floppies at @GaymerX with nothing actually \r\n\t<strong>stored</strong> on them.</p><p>\r\n\tYou can get the real version here, which is worth checking out (and it's also on Steam!): \r\n\thttp://superdupergc.itch.io/blackice</p><p>\r\n\tYes, I actually have his permission to release this on my page.</p><p>\r\n\tNote, this game is for \r\n\tMS-DOS, <strong>OR</strong> an IBM-compatible with the 320x200 256-colour VGA/MCGA mode and some way to boot off a floppy or floppy image (El-Torito, anyone?).</p><p>\r\n\tIt has been confirmed to work in \r\n\tFreeDOS (bootloader not tested on real hardware yet due to lack of floppies on my end @superdupergc tested it himself and confirmed that it <strong>does</strong> work on real hardware).</p><p>\r\n\tThe platforms listed are just platforms I know which have a version of \r\n\tDOSBox (which also works). QEMU also works just fine (it uses the bootloader).</p><p>\r\n\tThis game is Open Source! Like, really! I'm not just saying there's source code, it's actually MIT-licensed! So, here's some suggestions.</p><ul>\n<li>Get it under the 4KB mark! That 760-byte font can be squeezed down to 190 bytes, and that 736-byte line_grid* stuff can be generated in less than 50 bytes of code! <strong>All without using a cruncher!</strong></li>\n<li>Add sound!</li>\n<li>Add music!</li>\n<li>Add mouse support!</li>\n<li>Add joystick/gamepad support! (I really have no clue how to do this! Except maybe you could find some docs on MPU-401. Don't bother with USB, that's just suicide.)</li>\n<li>Increase the framerate from 18.22fps to something higher!</li>\n<li>Draw an RLE-compressed Black Ice logo!</li>\n<li>Manage to still keep it under the 4KB mark!</li>\n<li>Stick a proper \"Game Over\" screen in!</li>\n<li>Split the source into several files instead of leaving it as one long 1778-line mess!</li>\n<li><em><strong>Make it actually resemble Black Ice!</strong></em></li></ul><p>\r\n\tBut of course, what you \r\n\t<strong>really</strong> want to do is just steal the bootloader, because that took about 2 hours of fiddling and swearing just to get working. It loads the first *.CO* file it finds in the root directory and runs it, although currently it's limited to 16KB. (TIP: If you increment ES instead of DI, you can raise this limit to nearly 600KB.)</p><p>\r\n\tIf you would like your game demade, contact me! More info on my main page: https://fanzyflani.itch.io/</p>", "metacritic": null, "released": "2014-07-14", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/f66/f66edc94bf6aadadeecc7528a4169ddb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 6, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["fanzyflani"], "genres": ["Action"], "publishers": [], "esrb_rating": null}