{"id": 10832, "slug": "armed-with-wings-rearmed", "name": "Armed with Wings: Rearmed", "name_original": "Armed with Wings: Rearmed", "description": "<p>You are the sword; cut down your foes with steel and thunder. You are the wings; explore the skies and uncover unreachable mysteries. Embark on a journey through a vicious world ruled by darkness and imperial tyranny – the lands of Blackmist.<br />\nArmed with Wings: Rearmed is a 2D Action / Platformer rebirth of the original 2008 Flash Game where you command both samurai warrior and eagle.<br />\nDarkness continues to plague the world of Blackmist. The Rebel Army is crushed, the war for freedom is lost and the Tyrant King Vandheer continues to rule with his cold, iron fist. However, the cries of the perished have not been ignored by the divine ones who seek to save the world from darkness. So by their hands the strongest of the fallen is resurrected, wielding celestial power and a sacred title, Armed with Wings.The SwordYour blade summons the power of lightning and thunder. Strike your foes and reduce them to mist.The EagleYour Eagle companion will aid you in solving puzzles on your journey. Discover what lies ahead, distract guards, move objects and collect unreachable items.The WorldThe dark world of Blackmist is a dilapidated ruin full of monsters, mercenaries and mysteries. Journey through 40 hand crafted levels brimming with thoughtful puzzles and challenging adversaries.The KingKing Vandheer resides in his palace waiting for your arrival. Execute the divine order and destroy Vandheer.<br />\nElectrifying combat across 40 handcrafted levels.<br />\nPlay as both warrior and eagle.<br />\nMultiple modes including survival and multiplayer.<br />\nStriking art style and fluid animation.<br />\nXbox gamepad support<br />\nUnlockable characters, weapons and more!<br />\nTry the Free Survival Demo: Rearmed Trials</p>", "metacritic": null, "released": "2015-05-28", "tba": false, "updated": "2023-06-03T20:09:18", "background_image": "https://media.rawg.io/media/screenshots/c0e/c0e2c2b9ebed23d86bef47de47350c33.jpg", "website": "http://www.armedwithwings.com", "rating": 3.29, "rating_top": 4, "added_by_status": {"yet": 3, "owned": 176, "beaten": 3, "toplay": 2, "dropped": 3, "playing": 1}, "playtime": 4, "achievements_count": 20, "ratings_count": 7, "suggestions_count": 221, "game_series_count": 0, "reviews_count": 7, "platforms": ["PC"], "developers": ["Sun-Studios"], "genres": ["Action", "Arcade", "Indie", "Puzzle"], "publishers": ["Sun-Studios"], "esrb_rating": null}