{"id": 108353, "slug": "spacetris", "name": "Spacetris", "name_original": "Spacetris", "description": "<p><em>This game is in development. Expect major bugs and unfinished features.</em><br/></p>\n<p>Spacetris is an arcade 2D space shooter where you build your spaceship from blocks. You can fly around, shoot enemies, use different weapons and fight your way to the next space station to upgrade and rebuild your ship.<br/></p>\n<p>Each block has a different function, and you can build your ship accordingly. From versatile ships through all-rounders to ships with massive firepower. And you choose which way to go.</p>\n<p>Defeat waves of enemies to get to the boss, and rebuild your ship after each boss fight. You can buy new blocks for money you earn by destroying enemies.</p>\n<p>Be careful! Any block you lose during combat is lost forever. You must retain most of your blocks after each fight if you want to stand a chance against the final boss.</p>\r\nBuild\r\n<p>Build the ship you want to fly. Quick action or massive firepower — it's entirely <strong>up to you! </strong>You can upgrade shields, engines, different types of weapons or even your hull to withstand massive amounts of damage.</p>\r\nFight\r\n<p>Fight with what you build. Shoot through hordes of enemies and defeat the boss! Do you prefer sniping from a distance or close-range destruction?</p>\r\nAdapt\r\n<p>Protect your precious ship. Receiving minimal damage and keeping most of your blocks is vital. Enemies know what you have installed in your ship and will adapt their behavior for even greater challenge.</p>\n\n<p>More about the creators of Spacetris at eof-studios.com</p>\n<p>Spacetris is supported by the Slovak Arts Council. The Slovak Arts Council is also the main partner of Spacetris.</p>", "metacritic": null, "released": "2018-05-31", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/f84/f84432b6e48ee19786d49559c8e54dd9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 91, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["eof studios"], "genres": ["Action"], "publishers": [], "esrb_rating": null}