{"id": 10837, "slug": "heroes-of-dire", "name": "Heroes of Dire", "name_original": "Heroes of Dire", "description": "<strong>Heroes of Dire</strong> is a new massively-multiplayer tactical role-playing game from Spellbook!<br/><br/>You are a powerful hero with an army of fighters battling through strategic turn-based combat to win treasure, fame, and glory for your guild!<br/><br/>Join with friends to defeat challenging deity boss raids, take up quests for epic treasure, invade enemy guild halls, and fight in brutal gladiator arenas as crowd favorites live and die for your amusement!<br/><br/>Cross-platform servers bring together thousands of players on desktop and mobile devices with support for Windows, Mac, Linux, Android, and iPhone!<br/><br/>The New Player Guide is available at https://dire.wiki/guide<br/><br/><br/><br/><br/><strong>Heroes of Dire</strong> is all about assembling squads of fighters to make war with other guilds, monsters, and players! <br/><br/>Fighters come in many fantasy archetypes such as Mages, Paladins, and Healers. No two are ever the same, with unique names, races, stories, stats, titles, and equipment constructed by procedural generation with impressive and hilarious results that will always keep the game fresh.<br/><br/><br/><br/>The One-Eyed Knight, Two-Fingered Pete, The Laughing Horror, Georgia the Peach, or Screaming Ethel are just a few examples of the trillions of possibilities. For a few Silvers (the in-game currency) players can randomly roll for new fighter names to discover the perfect moniker, or work with a live Dungeon Master to create the perfect name!<br/><br/><br/><br/>Fighters have four gear slots: Weapon, Offhand, Armor, and Trinket. <br/><br/>Different items help determine what role a fighter plays, such as holy wands and flasks for Healers, or poisoned dual-wielded daggers for Rogues to maximize backstabs. <br/><br/>A robust crafting system allows heroes to build the perfect gear sets, with the most skilled players able to construct ultra-rare Masterwork items!<br/><br/><br/><br/>Almost all items in <strong>Heroes of Dire</strong> are procedurally generated with no two ever the same. Dungeon Masters will regularly appear in the world as traveling magicians or blacksmiths who can enhance your gear, or as merchants offering unique treasures.<br/><br/><br/><br/><br/>When in combat, fighters take turns moving and attacking with actions having a time cost that determines round order. <br/><br/>More expensive actions, such as splitting an enemy archer in half with a greatsword, might push your fighter to the bottom of the action list for 14 rounds, while moving would only cost 3 or 4. This turn-based combat system creates an incredibly rich strategy simulation where each decision has a direct and immediate impact on who wins or loses. <br/><br/>Skilled players won't waste a single round -- One move in the wrong direction or an attack at the wrong time can immediately swing your massive lead into a crippling loss.<br/><br/><br/>Every battle is part of a greater narrative, such as a guild war or a quest chain, and players can have multiple squads involved in many fights at the same time. <br/><br/>Need to pause the game for a moment?<br/><br/>Exiting a battle puts the AI in control of your squad until you're ready to return. Utilizing this AI system you can deploy multiple squads to wage multiple battles across the world map simultaneously. This system creates a truly massive multiplayer experience as guild wars can pull in hundreds or thousands of players! <br/><br/><br/><br/>Partner up with friends and follow them into combat for hours of quests, guild wars, and special Dungeon Master events! Battles can involve up to 48 fighters, with as many as 12 players in a single fight!<br/><br/>Make sure to flag your friends as \"FRIEND\" to enter battle on the same team and share world map vision, or simply join the same guild.<br/><br/><br/><br/>Guilds play an integral role driving the story and action in <strong>Heroes of Dire</strong>! Besides social and organizational hubs, they will <strong>wage war for dominance of the world map</strong>, with members winning prizes and benefits for capturing resources, such as an ancient relic or metal ore node.<br/><br/><br/><br/><br/><strong>Quests</strong> are a series of battles against NPC factions in the world of Dire, with <strong>powerful items</strong> and <strong>precious Silvers</strong> at stake. Loot can then be sold on the player-driven open market, or scrapped for extra Silvers.<br/><br/>Large-scale Community Quests are available for every hero to join, as well as Solo and Guild quests. Some quests also have<br/><br/><br/><br/>Each player will have a custom player title. In addition to looking cool, these titles help inform us of who is who in the community. Players sporting powerful or unique titles will stand apart from the crowd, lending weight to their obviously superior opinions and impressive physiques. Everyone will have the chance to earn new titles when taking part in special Dungeon Master events, and are also randomly generated after 1,700 battle wins.", "metacritic": null, "released": "2017-03-15", "tba": false, "updated": "2019-08-28T22:14:13", "background_image": "https://media.rawg.io/media/screenshots/65c/65c9ff5883638df82d8a0def121a212f.jpg", "website": "http://www.dire.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 147, "toplay": 1, "dropped": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 3, "suggestions_count": 574, "game_series_count": 0, "reviews_count": 3, "platforms": ["macOS", "PC", "Linux"], "developers": ["Spellbook"], "genres": ["Adventure", "RPG", "Strategy", "Massively Multiplayer", "Indie"], "publishers": ["www.Spellbook.com"], "esrb_rating": null}