{"id": 10836, "slug": "source-filmmaker", "name": "Source Filmmaker", "name_original": "Source Filmmaker", "description": "<p>Source Filmmaker is a video creation program developed by Valve on Source game engine.</p>\n<h3>Usage</h3>\n<p>Valve uses Source Filmmaker to create trailers and short movies on their games. The most notable video series made to date is Meet the Team and several Team Fortress 2, Left 4 Dead and Left 4 Dead 2 videos. Usually, Source Filmmaker is used in cases when the creators need to dynamically change the character&#39;s facial expressions or much more cinematic movement animations. </p>\n<p>The capture process is fairly easy - the creators have to record the movement of each character present in the scene, record their animations, add camera movement, sounds, and only after that, it is possible to properly record the facial animations, change the lighting, and add special effects. All these things can be done directly throught Source Filmmaker without resorting to any other software.</p>\n<p>Source Filmmaker supports a wide range of cinematic special effects and post-processing filters. The creators can use any assets of Valve games that are made on Source free of charge. It is also possible to use the resources of the community-made Source mods that are published on Steam, or add their own ones directly into the Source Filmmaker.</p>\n<h3>Support</h3>\n<p>Valve puts a heavy emphasis on the educational value of Source Filmmaker, as the company helps out the animators, by publishing the source files for their videos, and holds the annual Saxxy Awards, where the most notable SFM works are given awards from Valve.</p>", "metacritic": null, "released": "2012-07-10", "tba": false, "updated": "2024-04-09T13:35:14", "background_image": "https://media.rawg.io/media/screenshots/ecd/ecd0aa2f94b4165ad6c7a4cb63bbe877.jpg", "website": "http://www.sourcefilmmaker.com/", "rating": 3.05, "rating_top": 4, "added_by_status": {"yet": 52, "owned": 1441, "beaten": 15, "toplay": 2, "dropped": 74, "playing": 7}, "playtime": 1, "achievements_count": 0, "ratings_count": 198, "suggestions_count": 206, "game_series_count": 0, "reviews_count": 198, "platforms": ["PC"], "developers": ["Valve Software"], "genres": [], "publishers": ["Valve"], "esrb_rating": null}