{"id": 108315, "slug": "the-gallows-frequency", "name": "The Gallows Frequency", "name_original": "The Gallows Frequency", "description": "<p> </p><p>The player awakes in a mysterious maze with a bizarre feeling behind there eyes and with only a flashlight and a strange voice coming from a radio. That instructs them its time to play the game.</p><p> </p><p>The name of the game is simple \"find the key, find the door and oh yeah dont die\" the voice instructs the player.</p><p> </p><p>In The Gallows Frequency player have to navigate a dark maze all the while being hunted by a lumbering monster and suffering from the effects of the gallows frequency itself.</p><p> </p><p>Controls </p><p>wasd – movement</p><p>mouse controlled look</p><p>esc – exit the game</p><p> </p><p>simply download the game it can be installed or run from the exe I would recommend playing in windowed mode for convenience.</p><p> </p><p> </p><p> </p><p>Side Note about me: </p><p> </p><p>This is the first game I have released in a long time, I have been making games as a \"job\" for about 7 years now and went through a dark patch the last couple years where I didnt think anything I did was good enough so I stuck to mostly contract work for other peoples projects.</p><p> </p><p>Thank you so much to everyone I have interacted with in the last few months for giving me the confidence to make games again I can never repay you.</p><p> </p><p>Special thanks to pink0monster for helping me design this game</p><p> </p><p>twitter.com/pink0monster</p><p> </p><p>The bit where I beg for money:</p><p> </p><p>This game is set to pay what you want money is not required but if you would like and have a spare dollar or two it would be greatly apprecated. </p><p> </p><p>I also have a patreon which if you would like to continue to support my game development you can check it out here.</p><p> </p><p>https://www.patreon.com/PodunkStudioz</p><p> </p>", "metacritic": null, "released": "2017-03-22", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/09f/09f11f434282ab51324070e04c130e32.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 24, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["DustyofPodunk"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}