{"id": 108512, "slug": "singed-dirt", "name": "Singed Dirt", "name_original": "Singed Dirt", "description": "<p>Welcome to a future where contestants take control of tanks to shoot each other for the enjoyment of the audience!</p>\n<p>Play via hot-seat on the same computer, across the LAN for old school fun, or search for others online via match making!  The last one will be more effective if you tell your friends to get on there to play too. ;)</p>\n<p>Customize your tanks for a mismatch of different looks, hats and a unicorn horn included.</p>\n<p>Snarky comments from the tanks built in.</p>\n<p>Made with the help of the fine folks at http://gamkedo.club:</p>\n<p><strong>Jeremy Kenyon:</strong>  Project Lead, general sound manager (programming), main menu, artillery shell (model), and sharktooth cluster bomb (model and code), unicorn horn style hat model, pillar shot model,  writing one-liners, other random programming jobs too</p>\n<p><strong>Tylor Allison:</strong>  Network code, Lobby UI and code, loot box model and code, game chat, player listing in game (UI and whos turn it is), ammo lister (UI and which one you have selected plus custom name mapping), voronoi player spawn location generation and voronoi terrain generation, player model customization, and probably something else I forgot</p>\n<p><strong>JL Evans:</strong>  Awesome voice overs!  BarkManager (code to add specific VOs for specific ammo and to ensure they are random and don't repeat until all are done), MushBoom and Beet Missiles (particle effects, model, and code for handling special effects for both), arena sand textures, writing one-liners</p>\n<p><strong>Christer 'McFunkyPants' Kaitila:</strong>  Awesome voice overs!  Arena model, banners and flags, tank models, 3D Singed Dirt model logo, clouds, hats, writing one-liners</p>\n<p><strong>Caspar Dunant:</strong>  Acorn model, trailing particle effects for heated air effect behind projectiles</p>\n<p><strong>Trenton Pegeas:</strong>  Pillar shot idea and terrain deformation template</p>\n<p><strong>Micky Turner:</strong>  Select and back menu sound effects, tank shot effects</p>\n<p><strong>Dedrick Sarzaba:</strong>  UI tank select and turn sounds, projectile explosion and tank hit sounds (also hooked up in code), power up/down sounds, tank rotating/aiming sounds, nuke sequence sound effects</p>\n<p><strong>Nicholas Polchies:</strong>  UI health bar and power bar fixes, UI ammo model display fixes</p>\n<p><strong>Michael \"Misha\" Fewkes:</strong>  Gameplay Music</p>\n<p><strong>Mark Brown: </strong> Lobby Music</p>\n<p><strong>Tim Waskett: </strong> Terrain deformation</p>\n<p><strong>Lou Herard:</strong>  Radius damage calculation and tank knock back</p>", "metacritic": null, "released": "2017-05-30", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/184/18422e50f0152159e7b897038e62db0b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 174, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["lanthos", "Gamkedo Club"], "genres": ["Action"], "publishers": [], "esrb_rating": null}