{"id": 10862, "slug": "luckless-seven", "name": "Luckless Seven", "name_original": "Luckless Seven", "description": "Luckless Seven is the story of Mark Vesco’s coming of age. Once an inspired youngster, Mark finds himself living a listless, dutiful existence just two years out of high school. When a group of old friends contacts Mark about reuniting with them, the stars align to allow him to join his old friends in a nationwide competitive tournament.<br/><br/>Take control of Mark as he and six friends set out to compete in Arithia’s most popular game, Ekosi. This fast and fun card game is inspired by KOTOR’s Pazaak, and the stakes couldn’t be higher. With a little experience, money, and luck, take Mark from a modest amateur to an Ekosi champion!<br/><br/>Which card to play won’t be the only difficult choice for Mark, though. Along his journey, Mark will have to make several decisions that will challenge him morally, ethically, and socially. More than just a card game, Luckless Seven invites you to take control of the whole person. Who will Mark be on his quest for glory?<br/><br/><br/><br/><ul><li>A story-rich experience that uses choice to explore identity formation and social relationships.<br/></li><li>An intuitive, straight-forward quest structure that offers a wealth of enriching sidequests for the player to discover.<br/></li><li>Exciting, strategic gameplay in a fast-paced card battle system inspired by Pazaak.<br/></li><li>Customize your deck! Visit card shops to turn match victories into new cards as you upgrade your deck.<br/></li><li>Complex dialogue trees that allow you to control the direction of dialogues both serious and playful.<br/></li><li>An immersive 3D world - explore a diverse set of isometric environments, both in urban and natural settings<br/></li><li>Original Soundtrack full of energetic battle music and ambient world music.</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T22:14:12", "background_image": "https://media.rawg.io/media/screenshots/5b3/5b328ffa3f7ee65a668e2483723a01e1.jpg", "website": "http://www.deckpointstudio.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 337, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "Linux", "PC"], "developers": ["Deckpoint Studio"], "genres": ["Adventure", "RPG", "Strategy", "Indie"], "publishers": ["Deckpoint Studio"], "esrb_rating": null}