{"id": 108798, "slug": "falling-out-of-place", "name": "Falling Out Of Place", "name_original": "Falling Out Of Place", "description": "<p><em> All the right pieces. <br/>All the wrong pieces. <br/>All the right things. <br/>All the wrong things. <br/>All the strange pieces... <br/>...falling out of place.</em> </p><p>Customize your appearance and choose between male or female in this slice-of-life visual novel. Play as an average college student, just trying to navigate your daily schedule, making choices between going to classes and being with friends. As you get settled in, and you've got a good hold on who you are, how choices are made, and how they affect your day-to-day activities, take solace in your routine. </p><p>Don't get too comfortable however, as one night you go to bed and wake up in the morning, finding that you are now the opposite gender. Your clothes, your room, your body have changed, but not your mind. What was once male, is now female. What was once female, is now male. </p><p>With this new found discovery, knowing that you already have a set schedule and way of doing things, how do you navigate a world where nothing is how you remember it? ...What do you do now?<br/><br/>-Team Mismatched; 404</p><p>@RiversOblivion (Team Leader) <br/>#FallingOutOfPlace #FooP #Mismatched404</p><p><strong>Notes:<br/></strong>As of the conclusion of Global Game Jam 2015, only half of the male story-line has been implemented. We plan on continuing work on this game, pulling it into #JamForLeelah. I will make regular updates to this page when we have progress.</p><p>Update: 2/18/15 <br/>We have almost all of the male story line in the game, we just need to fix a few graphic and audio bugs. The female story is also getting implemented. Also, please please PLEASE comment on #JamForLeelah what you think about the game, or what we could do to make it better, or find me on Twitter @RiversOblivion!<br/></p><p>Update: 2/21/15<br/>A MAJOR update was just uploaded here! It has almost ALL of the male story-line in it, and near all of the FEMALE story-line as well! There are some bugs, and formatting errors that need to be fixed, but this is just a content push so you guys can see where we're at in narrative, and where we're going. The team would also LOVE feedback from all of you guys! Thanks!<br/>@RiversOblivion</p><p>We also want to continue to include the following in our game:<br/></p><strong>This is How it Feels: </strong>The game raises awareness of how hate speech or unfair accusations feel, and what kind of effect they have on their targets.<br/><br/><strong>Stephen Hawking Can Play This: </strong>In the game everything (including any menus) can be navigated with one button, without any need for quick / precisely timed presses.<br/><br/><strong>Hyper-Local:</strong> The game is set in your town/city and contains elements locals can identify, while still being entertaining for a global audience.<br/><br/><br/><br/><br/><br/><br/><br/><br/>", "metacritic": null, "released": "2015-02-06", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/3f9/3f95279dce49ce7cb2410b2c5597ce3e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 76, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["RiversOblivion"], "genres": [], "publishers": [], "esrb_rating": null}