{"id": 108810, "slug": "meow-mechanized-engineered-open-warfare", "name": "M.E.O.W. (Mechanized Engineered Open Warfare)", "name_original": "M.E.O.W. (Mechanized Engineered Open Warfare)", "description": "<p>MEOW is a hybrid of a match three style puzzle game and a versus fighting game. Successfully matching tiles of the same color causes your fighter to execute moves that depend on which type of tile was matched. The first player to deplete their enemy's health bar wins.  </p><p>Tile Types</p><p>Punch - Punch that other jerk </p><p>Kick - Kick that other jerk </p><p>Block - Gives your player a block. Blocks are used automatically when your opponent punches or kicks from in front. </p><p>Dodge - Dodges to the other side of your opponent this causes either your next attack to be unblockable or your opponents next attack to miss, depending on who attacks next. </p><p>Powerup - Fills up a chunk of the powerup meter. When the meter is full a powerful and unblockable attack is unleashed.</p><p>Controls</p><p>The game can be played with either the mouse or a gamepad for single player and with either two controllers or one controller and the mouse for two players. </p><p>Mouse - Click on the tile you would like to move and drag to the tile you would like to swap with.</p><p>Gamepad - Highlight the tile you'd like to move using the left stick and then flick the right stick in the direction of the tile you would like to swap with. Alternatively you can swap tiles by pressing any face button and pushing the left stick in the direction of the tile you would like to swap with.</p><p>Other - </p><p>Esc (in game) - return to title screen</p><p>Esc (In title screen) - exit game </p><p>R (in game) - restart match </p><p>Start Button (in game) - restart match </p><p>Gamepad controls are configured for Xbox360 controllers however the buttons can be remapped in the Input tab of the launch dialogue box. Control fields ending with a '0' are for player while and those ending with a '1' are for player two.<br/></p><p>MEOW was created during TOJam12 by Jay Edry (@Janimator0), Kenneth Yeung(@Capy_Ken), and Dave Hill (@FooBargle) </p>", "metacritic": null, "released": "2017-05-16", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/e4e/e4ed3663146d26b0ae0cb89cfae8c39d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 39, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["FooBargle", "janimator0", "capy_ken"], "genres": ["Fighting", "Puzzle"], "publishers": [], "esrb_rating": null}