{"id": 108865, "slug": "shifting-sands", "name": "Shifting Sands", "name_original": "Shifting Sands", "description": "<p>Shifting Sands is a 4X game where you manage a single city sprawling across the sands of a desert that changes shape when you don't keep your eyes (or city) on it. It's mostly a prototype to test this mechanic at this time, so there's no goal yet, and very few repercussions for a failing economy.</p>\n<p><strong>Alt-F4 to quit; No in-game quit button implemented yet.</strong><br/></p>\n<p>The game can be played with only the mouse, and most of the controls are described in-game. Actions consist primarily of left-clicking on units, buildings, buttons and right-clicking to order units to move or placing buildings. Instructions are given at the top and can be toggled on and off.</p>\n<p>Information not described well in-game: </p>\n<ul><li>Stone, Wood, and Tech resources do not stockpile and are automatically spent each turn. Tech is unused at this time.</li><li>Stone and Wood are both used to construct buildings by assigning them to buildings under construction. Use the \"Assign Wood/Stone\" buttons in the bottom right, when they're not assigned they'll automatically be assigned to a newly placed building.</li><li>Most buildings require both Stone and Wood to be built, but Wood can be used instead of Stone, whereas Stone cannot be used instead of Wood.</li><li>The Water icon with an outline are considered water sources, and water sources cause water to be harvested on adjacent tiles (equal to the water source minus one).</li><li>Units cannot move onto mountains or water tiles, although buildings can be placed on these tiles, including roads.</li></ul>\n<p>Please feel free to leave any feedback, but any feedback regarding the exploration being reset is most sought after.</p>", "metacritic": null, "released": "2018-03-11", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/1ed/1ed6a1463fd408be5a528cb48cf7b8ab.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 49, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Web"], "developers": ["Ramperkash"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}