{"id": 108956, "slug": "seasonal-soccer-itch", "name": "Seasonal Soccer (itch)", "name_original": "Seasonal Soccer (itch)", "description": "<p>Seasonal Soccer is pixel stylished game, which respects the traditions of good old style soccers. Your mission is to get the football into the opponent's goal and defend your own goal (as usual). This game may cause happy moments, frustration, nostalgic memories and more. Choose your team from 4 different choices and play on single player mode against CPU.. and beat the opponent AI team! <br/></p>\n\n<p>Remember good old times soccer games with easy controls and amazing pixel graphics? Have you ever wanted to dive into those memories again and enjoy 100% pixel style and simple gameplay? With no need to follow the complicate plot? Looking for a time to relax and let your mind wander? Or perhaps a game with simple game controls and amazing pixel graphics? Or a game that includes speed and requires accuracy? Well, believed it or not, this game have it all. Seek no more, you have found what you have searched (perhaps).<br/></p>\n\n<p>Original idea for Seasonal Soccer has started and inspired by the passion of football in a town of Myllykoski. That village, located in the final frontier Finland, surrounded by a thick forests and fertile oat fields, has a truly passion for football. Together with legendary worldwide paper industry pioneer Myllykoski Paper decision to build a a football pitch with spectator stands in 1947 and continuous support, football club Myllykosken Pallo −47 (or MYPA, formerly MyPa) did many miracles in football history. In addition to regular football, the village was also in the fashion of playing legendary Amiga soccer games. Inspired by this spectacular passion to the football, Seasonal Soccer is here for you to play. And we also hope that we can \"ignite the candle\" and inspire people all around the world to start a career in football.</p>\n\n\n<p>You can  play against CPU by selecting one of these teams: Finland, Switzerland, Spain or Honduras. If you win (or lose..), you can choose new opponent. On this Early Access version you can't win World Cup tournament, but you can win the match against CPU and have fun! You can also let AI play your team players and only \"manager\" a team, but in hard situations you will need to take control. Of course you can also play all time with 100% control of your players.</p>\n\n<p>This is a pixel-style retro AAA-game (graphically). The game does not take the whole screen, so it is easy to play also at the work place, school etc (of course at a break time). You can choose from 3 different screen size: 320x240, 640x480 and 800x600. </p>\n\n<p>Seasonal Soccer is single-player soccer game and incredible fun to play. Play against challenging CPU! You can also let AI play your team players and \"manager\" your team. And take full control when situation goes tricky! Or play all time with 100% control of your players.</p>\n<ul><li>You can only play against CPU (We promise that it is challenging.)</li></ul>\n<ul><li>You can choose from 4 different teams (Finland, Switzerland, Spain or Honduras.)</li></ul>\n<ul><li>You can change your team and opponent from the options menu.</li></ul>\n<ul><li>Each team has its strengths and weaknesses</li></ul>\n<ul><li>How long will you play, it is up to you. We believe that this game can entertain you as many hours as you wan't, because if your moves are different so will be every match. So you can spend minutes or even hours by playing this game without getting bored. How much gameplay will this game give you, it is up to you.</li></ul>\n<ul><li>This game does not include any music, but you can listen applauses and cheers yells from the audience while playing against opponent team.</li></ul>\n<ul><li>On this stage on Early Access, you can play only in one football field, but as it is said every match can be different..</li></ul>\n<ul><li>There is no referee in the football field, so this game might not be totally realistic in every aspect.</li></ul>\n\n<p>Former football player have been used to test play &amp; consult to plan opponent team strategies and movements, strengths and weaknesses, in order to offer players the most genuine experience.</p>\n<p><strong>Available for PC</strong></p>\n<p>This game is available for PC. We are planning to release Mac-version too, but exact day is not clear yet. </p>\n\n<p><strong><em>Where does my money go? </em></strong></p>\n<p>30% of every purchase goes to itch.io to support their amazing work! And 70% is going to this game development!</p>\n<p><em><strong>Why In Development? </strong></em></p>\n<p><em>“We want to make a good game, hear community voice and therefore we wan't to bring game to In Development. And by listening to the community’s voice we can try to shape our game exactly to the gamers’ liking.”</em></p>\n<p><em><strong>Approximately how long will this game be In Development?</strong></em></p>\n<p><em>“Two to six months.”</em><br/></p>\n<p><em><strong>How is the full version planned to differ from the In Development version?</strong></em></p>\n<p><em>“In sports terms :D, our goal is that full version will going to have more improved graphics, more graphic details and effects (player movements, kicks and tackles for example).</em><br/><em>As these colors on the game name may predict, our plan is that the football fields have a seasonal colors; september, august, even winter fields in the final version. When the grass is yellowing on the ground.. it's the best time to play.. </em><em>Also our goal is to add these countries to the final version of the game (in addition to existing ones): Russia, Germany, Argentina, Netherlands, Brazil, Colombia, Belgium, Costa Rica, Chile, Mexico Uruguay, Greece, Algeria, United States, Nigeria, Portugal and countries which where eliminated in the group stage on World Cup 2014. By \"adding these countries\" we mean that player will be able to play a game which have team named by country on above. Also we wan't to underline, that we can't add players which were playing on those teams on year 2014, but we can try to implement some weaknesses and strengths of those teams to the final game. Adding players by using their names is not possible because player names are copyrighted and we don't hold rights to add them. </em><em>Plan is also that final game have improvements to AI (enemy and player).\"</em></p>\n<p><em><strong>What is the current state of the In Development version?</strong></em></p>\n<p><em>“Game is ready and the heat is on! Game is ready to play and everything is working perfectly. Currently version is very stable. Playing against an A.I (CPU) is challenging, playable and fun.</em><strong> Player does not need to control every player in the field, because even player team have AI and player can take control from the team members when desired. </strong><em>Player can play a game against CPU by selecting one of these teams: Finland, Switzerland, Spain or Honduras. If you win (or lose..), you can choose new opponent. On this Early Access version you can't win World Cup tournament, but you can win the match against CPU and have fun :) How much gameplay will this game give you, it is up to you. You can spend minutes or even hours by playing this game.. if your moves are different so will be every match :)\"</em></p>\n<p><em><strong>Will the game be priced differently during and after In Development?</strong></em></p>\n<p><em>“It is possible that we increase price even during the Early Access, or after leaving out the In Development, or both. Reason for the price increase will then be new features.\"</em></p>\n<p><em><strong>How are you planning on involving the Community in your development process?</strong></em></p>\n<p><em>“If players wan't they can give us feedback and we do our best to add their ideas to the game development process. We think that best feedback is constructive feedback, but of course all kind of feedback is welcome and we carefully read all the feedback from players. We also hope to hear detailed introductions or tips what players would like to see in the game in future. Giving feedback is by no means compulsory. You can just buy the game and enjoy. We also hope that players understand that this is not AAA-game.”</em></p>\n<p><strong>System Requirements</strong></p>\n<p><strong>Minimum:</strong></p>\n<ul>\n<ul><li>OS: Minimum Windows XP SP3 Operating System. Supports Vista, 7 and 8 (works perfectly also in win 10.).</li><li>Processor: 200 Mhz Pentium processor or higher</li><li>Memory: 256 MB RAM</li><li>Graphics: Must support minimum of Direct X9</li><li>DirectX: Version 9.0</li><li>Storage: 5 MB available space</li></ul></ul>\n<p>In order to download this game you must purchase it at or above the minimum price of $7.90 USD. Your purchase comes with a Steam key. You will get access to the game files.<br/></p>", "metacritic": null, "released": "2018-04-02", "tba": false, "updated": "2019-08-28T23:24:30", "background_image": "https://media.rawg.io/media/screenshots/faf/faf148ac1a77bd010f61eda6652699fe.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 100, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["IcanY"], "genres": ["Sports"], "publishers": [], "esrb_rating": null}