{"id": 10897, "slug": "bounty-train", "name": "Bounty Train", "name_original": "Bounty Train", "description": "Be prepared to conquer the Wild West on rails! Mount and design your very own train with plenty of detailed equipment, hire a loyal, bold and selfless crew and travel through the dangerous Wild West. Find your way by cleverly using your resources and by shipping goods and passengers. Solve problems your own way, either through diplomacy, violence or bribery.<br/><br/>Explore the dangerous life, the accurate historic events and contemporary inventions of the North American/US 19th century.  Acquire one of the most legendary steam machines and transform it into a fortress on rails. Fulfill surprising quests and face notorious bandits, vengeful Natives and even more enemies. You can only achieve this journey of your life, if you pay attention to all these thrilling factors.<br/><br/><br/><ul><li>Control true to original locomotives, expand and design them in various ways<br/></li><li>Assort an efficient crew and overcome the challenges of North America together<br/></li><li>Prove yourself by handling chase-fights and ambushes, but be careful and inventive: resources are scarce and technology isn't always reliable<br/></li><li>Explore the America of the 19th century, visit real-life cities, trade and provide goods<br/></li><li>Experience an exciting, non-linear story – reunite with your family and prevent the forced removal of the Natives<br/></li><li>Influence real historical events and inventions, and change the course of history<br/></li><li>Choose one of four huge factions – or switch sides in the game process</li></ul>", "metacritic": 66, "released": "2015-08-25", "tba": false, "updated": "2023-05-15T19:49:56", "background_image": "https://media.rawg.io/media/screenshots/db1/db1210219be7981486c3f6557f3aaecf.jpg", "website": "http://bountytrain.com/", "rating": 3.03, "rating_top": 4, "added_by_status": {"yet": 18, "owned": 384, "beaten": 11, "dropped": 12}, "playtime": 3, "achievements_count": 30, "ratings_count": 29, "suggestions_count": 559, "game_series_count": 0, "reviews_count": 29, "platforms": ["macOS", "PC"], "developers": ["Corbie Games"], "genres": ["Strategy", "Simulation", "Indie"], "publishers": ["Daedalic Entertainment"], "esrb_rating": null}