{"id": 109068, "slug": "minesweeper-go-itch", "name": "Minesweeper GO (itch)", "name_original": "Minesweeper GO (itch)", "description": "<p>Minesweeper GO easily trains your brain and increase the speed of your thinking. At the same time it is fun and challenging logic puzzle.<br/></p>\n<p>The objective of the game is to clear a board full of hidden mines without detonating any of them.<br/></p>\n<p>There are three levels of difficulty: Beginner has 10 mines, Intermediate has 40 mines, and Expert has 99 mines. It is also possible to create Custom levels.<br/></p>\n<p>Unique features: magic wand of luck, guess free boards and smart hints<br/></p>\n<p>Some key features:<br/></p>\n<ol><li>Game allows players to track their skill and board solving efficiency progress by calculating metrics that heavily used within minesweeper communities such as 3BV/s, Taps/s, RQP, IOE, IOS, etc.</li><li>Players can take advantage of chord recursion options. Chord recursion helps to solve minefields at maximum speed.</li><li>Every play is recorded. Players at any time can prove theirs best records by just playback recorded games. Other players can learn how to solve boards fast just by looking recordings of the best players.</li><li>Personal score board is designed to collect data by accounting different player game styles - Flagging and Non-Flagging (NF).</li><li>Minesweeper GO introduces advanced minefield generation capabilities.</li><li>Online World and Live Ranking tables keeps competitive spirit among players. Each player can publish personal records and compare them with another players.</li><li>Impatient player will find some use of cheat options that can be enabled within settings.</li><li>Every aspect of tap control can be tuned in options. Handling taps is very easy and fluent.</li></ol>", "metacritic": null, "released": "2017-06-22", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/93a/93a457f6e51dd4cff343d98c81230191.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 69, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["evolvegames"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}