{"id": 10900, "slug": "project-zomboid", "name": "Project Zomboid", "name_original": "Project Zomboid", "description": "<p>The game combines the genres of survival horror and role-playing game. The main theme of the game - survival during a zombie apocalypse.</p>\n<p>It has an open and changing world, many opportunities for the manufacture of useful things and cooperation with other characters, to fight hunger, injuries, depression and paranoia.</p>\n<h3>Plot</h3>\n<p>The game takes place in Knox County, Kentucky, USA.</p>\n<p>As a result of the epidemic, a huge part of the population of the district became infected with an unknown virus and turned into a zombie. The few survivors will have to fight for survival.</p>\n<p>The player plays as one of the survivors. The game does not have any definite ending, it cannot be won and it will end when the player’s character dies - and it depends only on him how late it will happen.</p>\n<h3>Gameplay</h3>\n<p>The game begins with the creation of a character.</p>\n<p>The player can choose the name, gender, race, hairstyle, initial clothing, as well as the presence of a beard and chest hair in a male character.</p>\n<p>Then begins the creation of character and part of the background of the character. You can choose the character&#39;s profession before the apocalypse. Subsequently, this will affect some of the skills (for example, a former policeman shoots better, a builder builds defenses better, nurses heal wounds more successfully, cooks cook better, etc.).</p>\n<p>You can then choose the positive and negative traits of the character. The negative ones include obesity, laziness, poor eyesight, chronic fatigue, constant thirst, etc. For the chosen negative traits you get points - these points can be spent on the positive traits of this character, such as agility, strength, high disease resistance and even luck.</p>\n<p>After creating a character, you (or rather, a character) find yourself in a randomly selected house on a game map. The zombie apocalypse has already begun, and your character has to look for a way to survive. In the game, not even very moral ways are allowed to do this: you can loot and rob, you can create a group of honest people and resist both zombies and bandits.</p>\n<p>In addition to winning battles, the hero needs food, water, sleep, rest, and fellowship to survive - constant loneliness can lead to depression.</p>\n<p>The complexity of the game increases constantly and gradually - the activity of zombies increases, electricity and water supply are turned off, and the products deteriorate. However, the player is able to provide a lot for himself - to cook food on a fire, collect rainwater, grow food.</p>\n<p>However, no action can ensure eternal survival - sooner or later the character dies. The slogan at the beginning of each new game is pessimistic: “This is the story of your death.”</p>", "metacritic": null, "released": "2013-11-08", "tba": false, "updated": "2024-04-21T00:50:48", "background_image": "https://media.rawg.io/media/screenshots/243/2436b84b99f1121c302367f0c5901b84.jpg", "website": "http://www.projectzomboid.com", "rating": 3.9, "rating_top": 4, "added_by_status": {"yet": 78, "owned": 2814, "beaten": 97, "toplay": 61, "dropped": 280, "playing": 80}, "playtime": 5, "achievements_count": 0, "ratings_count": 413, "suggestions_count": 423, "game_series_count": 0, "reviews_count": 416, "platforms": ["Linux", "PC", "macOS"], "developers": ["The Indie Stone"], "genres": ["RPG", "Indie"], "publishers": ["The Indie Stone"], "esrb_rating": null}