{"id": 109007, "slug": "dilating-destiny", "name": "Dilating Destiny", "name_original": "Dilating Destiny", "description": "<p>What are AAA games good for? Healing from transgender surgery! Killing 60 hours is nothing when you need to kill 12 weeks.</p><p> <em>Dilating Destiny</em> is a Twine game that weaves together language from the game Destiny with the experience of recovering from Genital Reassignment Surgery, during the Baltimore Uprising. The game focuses on blending the language of action, sci-fi and fantasy games with the experience of care after gender related surgery. I hope to shift the image of who gamers are and why we play games.</p><p>Dilating Destiny is an art game, as I am an artist. I made this game for the Devs with Ferguson bundle to raise funds for the Baltimore Algebra Project, part of the Baltimore United for Change coalition, to support ongoing efforts to end racism and racial violence in Baltimore. Now, I'm releasing it here as a standalone game, and the funds will go to my own survival and future game development. </p><p>I am an artist/theorist who works in media art, performance art and poetry. While I have made game interventions as art in the past, this is my third game I made from scratch. I have always played games intensely, from Metroid to Counter-strike to AD&amp;D to Destiny. I find my art practice moving towards making more games, because I love creating experiences for people to play.<br/></p><p>More info about me, and other games and art I've made is at http://michacardenas.org</p>", "metacritic": null, "released": "2015-05-07", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/526/526471da44430b1708621cbd0a2e4f7a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 61, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["micharoja"], "genres": [], "publishers": [], "esrb_rating": null}