{"id": 109192, "slug": "the-bountyclassic", "name": "The Bounty:Classic", "name_original": "The Bounty:Classic", "description": "<p>The Bounty:Deluxe Edition is coming soon! </p><p>\r\n\tEnter The Bounty.</p><p>\r\n\tIt's a retro-inspired competitive RPG, with an East meets West approach, deviously combined with an arcade high score sensibility. An experience that will challenge your wits as you push to survive, uncover a multitude of secrets, and earn the high score.</p><p>\r\n\tInteract with players around the world- share your scores, and find out who is the best in official high score and specialized competitions.</p><p>\r\n\tThe Bounty is unapologetically old school. No level grinding. No place to hide. Death is permanent. Even saving your game subtracts from your score. Your victory is in your own hands. Develop your own strategies, power your character the way you want to, and eventually conquer the game... if you can.</p><p>\r\n\tRemember- there is a secret, a trap, or a monster at every turn. Even some of the levels, creatures and treasures may not stay the same from play to play. Can you survive The Bounty?</p><p>The full version of The Bounty is only $5, and <strong>10% of all sales go to Operation:Supply Drop! To learn more about OSD's mission to bring fun to US and NATO troops, head over to http://www.operationsupplydrop.org/.</strong></p><p>Check out the New Official Trailer! </p><p>Want to try it for free? Then just snag the Shareware Edition!</p>", "metacritic": null, "released": "2014-07-01", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/e0c/e0c2cb9836969d10d31f6767666c1ae1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 96, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["ludicrousda3ve"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}