{"id": 10915, "slug": "deep-sixed", "name": "Deep Sixed", "name_original": "Deep Sixed", "description": "We're not alone here.<br/>A secretive corporation that holds a monopoly on the technology necessary to \"fold space\", travelling light-years in mere moments, has shown an obsessive interest in a large uncharted nebula in a distant arm of the galaxy.<br/>​<br/>The Pilot is working off the remainder of her sentence as an involuntary stellar cartographer for this corporation. She has been issued a small spacecraft that is equipped with a finicky deep space scanner and the support of an infantile Artificial Intelligence unit, and given orders to map as much as possible and report back with her findings.<br/>​<br/>What she discovers out there will change her life forever, if she can get back home in one piece.<br/><br/><strong>Features</strong><br/><br/><ul><li>Life without an \"undo\" button.  Your ship stays with you from start to finish.  If something breaks, it'll stay broken until you figure out how to fix it. <br/></li><li>A universe of procedurally generated mysteries for the ambitious explorer.<br/></li><li>A diverse ecosystem of intergalactic fauna with their own predator, prey and scavenger roles to play.<br/></li><li>A steep difficulty-curve that will push your ability to stay calm under pressure to the limits.<br/></li><li>A compelling story of friendship and compassion that promises to surprise and entertain.</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2022-07-30T15:58:19", "background_image": "https://media.rawg.io/media/screenshots/37e/37e8bf23895352df69446d9bcc7d1eb0.jpg", "website": "https://www.littlereddoggames.com/deep-sixed", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 54, "beaten": 1, "dropped": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 246, "game_series_count": 0, "reviews_count": 2, "platforms": ["macOS", "Linux", "PC"], "developers": ["LRDGames"], "genres": ["Action", "Adventure", "Strategy", "Simulation", "Indie"], "publishers": [], "esrb_rating": null}