{"id": 10917, "slug": "rite-of-life", "name": "Rite of Life", "name_original": "Rite of Life", "description": "Rite of Life is a life-sim RPG being developed for PC, Mac and Linux. It is heavily inspired by games such as Harvest Moon, Pokémon, Dark Cloud and Monster Hunter. It features a player-driven open world where you start with a small encampment. Through exploring, battling and gathering resources you can turn your home into a prospering town.Key Features<br/><ul><li><strong>Player-Driven Open World</strong> - Progression throughout the game is defined by you. Whether you want to focus on developing your home, helping the villagers become masters of their craft, levelling up your character so that you can take on anything or exploring the vast world of Rite of Life. You set your own objectives.<br/><br/></li><li><strong>Influence The Economy of Your Home</strong> - Bring materials back to your village and watch as your home develops from a small encampment into a prospering town.<br/><br/></li><li><strong>Level Up Villagers</strong> - Bring relevant materials back to your home to help the villagers train in their specialised craft. As they improve, more will unlock in their shops.<br/><br/></li><li><strong>The Spectrum System</strong> - A unique levelling up system inspired from Final Fantasy X's Sphere Grid. Allows you to level up your character how you want to in order to suit your playing style.<br/><br/></li><li><strong>Innovative Town Editor Mode</strong> - Customise the look and feel of your home with an in-game editor mode. Also complete unique quests only possible using the town editor.<br/><br/></li><li><strong>Interior Editor Mode</strong> - Decorate your house with numerous items you find, craft or buy.<br/><br/></li><li><strong>Seasons, Dynamic Weather and Day &amp; Night Cycles</strong> - Fully immerse yourself in the world of Rite of Life. Encounter different enemies, explore secret areas and experience new things as the seasons, variety of weather and time of day alter the world and how you can explore it.<br/><br/></li><li><strong>Unique Turn-Based Combat</strong> - A tried and tested turn-based combat system that allows you to choose how to attack your enemy, exploiting their weaknesses. Watch as the season, weather and time of day affect the strength and behaviour of the enemy you're fighting. Is the enemy more feral at night? Are they weakened in the snow? Can't they handle the summer heat? Discover when best to hunt certain enemies. Also includes a huge selection of skills, attack animations and fully animated boss battles!<br/><br/></li><li><strong>Ever-Changing Environments</strong> - A new adventure awaits you each day as the surrounding environments change offering new challenges and resources to gather.<br/><br/></li><li><strong>And Much More!</strong> - Full Controller Support, Localised in over 5 Languages, Steam Achievements, Available on PC, Mac and Linux!</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T22:14:10", "background_image": "https://media.rawg.io/media/screenshots/90a/90a07414debf777797b9cfd37245dbd8.jpg", "website": "http://www.rebournestudios.com/pre-purchase", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 177, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 541, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC", "Linux"], "developers": ["Rebourne Studios"], "genres": ["Adventure", "RPG", "Simulation", "Indie"], "publishers": ["Rebourne Studios"], "esrb_rating": null}