{"id": 10928, "slug": "leviathan-warships", "name": "Leviathan: Warships", "name_original": "Leviathan: Warships", "description": "<p>Leviathan: Warships is a turn-based strategy game developed by Pieces Interactive.</p>\n<h3>Plot</h3>\n<p>In a distant future, the Marauder fleet wreaks chaos upon the law-abiding citizens. The army establishes a new warship division to combat the new threat. The players have to build a new fleet and win the fight with the Marauders.</p>\n<h3>Gameplay</h3>\n<p>Leviathan: Warships is a strategy game in which the players take turns on commanding their own warship fleets. It is possible to play in a cooperative campaign against the Marauder fleet, fight in numerous Special Challenges missions, which put special requirements on the player&#39;s play style or compete with each other in a Player versus Player mode.</p>\n<p>The game puts a heavy emphasis on the fleet editor. This feature allows the players to create a completely new fleet with multiple ships and weapon types that can be used to create limitless combinations. The fleets usually contain less than six ships to balance the game correctly. The ships of the fleet are initially spawned bundled together.</p>\n<p>The players have to plan their actions ahead and execute them carefully as any misplanned attempt on damaging the enemy may result in complete annihilation of your own fleet. It is essential to be careful, as most of the map is covered by the fog of war in which your enemies hide.</p>", "metacritic": null, "released": "2013-04-28", "tba": false, "updated": "2024-04-06T12:25:20", "background_image": "https://media.rawg.io/media/screenshots/bf7/bf73f2f33579309375a8cc0a78fb3daf.jpg", "website": "http://www.leviathanwarships.com/", "rating": 2.37, "rating_top": 3, "added_by_status": {"yet": 43, "owned": 806, "beaten": 1, "toplay": 4, "dropped": 18}, "playtime": 1, "achievements_count": 20, "ratings_count": 30, "suggestions_count": 344, "game_series_count": 0, "reviews_count": 30, "platforms": ["macOS", "PC"], "developers": ["Pieces Interactive"], "genres": ["Action", "Strategy"], "publishers": ["Paradox Interactive"], "esrb_rating": null}