{"id": 109277, "slug": "jaded-jacks", "name": "Jaded Jacks", "name_original": "Jaded Jacks", "description": "<p>\r\n\tRunning around in a dungeon, looting chests, killing orks and goblins; this is but a normal day in the life of a Jack. Being a rogue, a mage or a knight seems fun at first, but it gets boring quite fast...\r\n</p>\n<p>\r\n\tWell, how about a way to spice things up for a change ? What if every single of your actions was a polar choice, either do it or don't ? What if your life could only be controlled by agreeing or denying to a sequence of actions that goes around right before your eyes ?\r\n</p>\n<p>\n<br/>\r\n\tReach the end, it only requires a single fingertip.\r\n\t<br/>\r\n\tWelcome to Jaded Jacks !\r\n</p>\n<p>\r\n\tHow to play: Exploration phase\r\n</p>\n<p>\r\n\tDuring the exploration phase, holding down a key will make you move in the direction pointed by the arrow circling your character.\r\n</p>\n<p>\r\n\tItems are automatically picked up and used if using it would not result in wasting its effects.\r\n</p>\n<p>\r\n\tTo open up golden chests, you will need a golden key.\r\n</p>\n<p>\r\n\tTo open up doors, you will need a blue key.\r\n</p>\n<p>\r\n\tTo open up red doors, you will need a red key.\r\n\t<br/>\n</p>\n<p>\r\n\tHow to play: Battle phase\r\n</p>\n<p>\r\n\tBattles are turn-based, but choosing a skill to perform is a time-based action.\r\n</p>\n<p>\r\n\tWhen it is your character's turn to play, press any button to start filling the casting gauge at the bottom-left of your screen. Holding any button down while the gage fills past a bar will mark a DOWN input, while not holding anything will mark an UP input.\r\n</p>\n<p>\r\n\tOnce a skill has been selected, an arrow will start pointing toward the potential targets of your skill. Simply press the button when the arrow is in front of the desired target.\r\n</p>\n<p>\r\n\tThe bottom-right of the battle screen displays the skill available for the current character. Try matching them to execute a skill!\r\n</p>\n<p>Items and their effects</p>\n<p>There are three types of items you can stumble upon.</p>\n<p>- Equipments are associated with each of your player's characters and will provide a boost in one of four stats: attack, defence, magic or speed. They will also boost your maximum health and mana by a small amount.</p>\n<p>- Regenerative items can either heal you or restore part of your mana. IF a character's health or mana is already at its maximum, it will increase a little bit. Finding a phoenix's feather will bring your defeated allies back to your party, even stronger than before!</p>\n<p>- Keys are used to unlock chests and doors. Each colour of key unlocks a different set of things.<br/></p>", "metacritic": null, "released": "2016-08-21", "tba": false, "updated": "2019-08-28T23:24:29", "background_image": "https://media.rawg.io/media/screenshots/b63/b633b0e4fac33fc296943235b1fd0845.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 21, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["Delca", "Thomas Chassin"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}