{"id": 109485, "slug": "gacu-brawl", "name": "Gacu Brawl", "name_original": "Gacu Brawl", "description": "<p>\n<br/>\r\nEngage in fast-paced bone shattering 4-player Kaiju combat. Show no mercy to the other mini-kaiju battling for supremacy as you shatter their bones and attack their insecurities to become a full-fledged Kaiju. Will you be the apex kaiju or just become another kaiju's lunch. You know, after you shatter their bones and stuff.\r\n</p><p>\n</p><p>\r\n\tGacu Brawl was created during a 10 day development cycle for \r\n\tGacucon. Due to its very short development time, there are bugs, and certain things may not be in the game. Looking at you, <strong>pause menu</strong>! If the game bugs out, best bet is to restart.<br/>\n</p><p>\r\n\tWe hope you enjoy the ride!\r\n</p><ul>\n<li>Only 2-4 players are able to get the match going. Single player not allowed.</li>\n<li>Game only supports game pads, no keyboards.</li>\n<li>Game will send you back to level select after victory screen on its own. (It didn't freeze)</li>\n</ul><p>\n<strong>Known Bugs:</strong>\n</p><ul>\n<li>Each character is tied to a specific controller: Red 1, yellow 2, blue 3 purple 4. if you try to do something like this Red and Blue it will default to Red and Yellow because of how controller pairing is currently being done.</li>\n<li>Sometimes there's a rare bug of stunned rates causing you to stay perma stunned. Doesn't happen often but I've seen it happen 1 out of 10 play tests. Goes away after getting hit or knocked out.</li>\n<li>Fireball will launch you in opposite direction sometimes.</li>\n<li>If you're hit by the fireball and you are still on stage, you might fall through stage.</li>\n<li>Camera wonks out every now and then.</li>\n</ul>", "metacritic": null, "released": "2017-02-13", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/f2d/f2d8c5b9e9cfb476f91bf113615f13a7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 23, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["goodwargames"], "genres": ["Action", "Fighting"], "publishers": [], "esrb_rating": null}