{"id": 109404, "slug": "big-bad-bounty", "name": "Big Bad Bounty", "name_original": "Big Bad Bounty", "description": "<p>Tired of the weaklings on your planet of rainbow land you and your demonic unicorn hood go to planet ODIUM, a place that contains the biggest baddest outlaws in the galaxy. <br/>Armed with a rusted blade and your demonic sidekick you explore the shifting frontier in search of alien weaponry, rainbow tonics and worthy opponents. The bounty on your head represents your status within society, the more outlaws you slay the higher your bounty will grow giving you access to more weaponry and items, but the higher your bounty is the more enemies will begin to hunt you down trying to claim the bounty on your head.<br/>Besides the piles of whoop ass you can dish out with your trusty blade you also have, Your demonic friend can possess various alien weaponry to support you at range, a collection of grenades and other items of destruction, and alien mods that you can find scattered around the frontier.<br/>After a long day of Bounty Hunting head back to Bubbas Saloon kick off your shoes and have a nice cold glass of RainbowTonic. Here is where you can purchase various weapons to take into the field with you, tonics that can add permanent gains, and new edges for your piece of crap sword. The higher your bounty the more prestigious artillery you will have access to.<br/><br/>Check out the current Landing page:<br/>https://www.facebook.com/Big-Bad-Bounty-1731589070236037/</p>\n\n\n<p><strong>My main Character \"Crimson Unicorn\"</strong><br/><br/><br/><br/><br/><br/><strong>Here are some early weapon concepts of what ranged weapons might look like</strong><br/><br/><br/><br/><br/><br/><strong>Here are some enemy concepts, Many gangs will roam the land some lone drifters</strong><br/><br/><br/><br/><br/><br/><br/><br/><strong>others part of a gang like the tumbleweed gang</strong><br/><br/><br/><br/><br/><br/><br/></p>", "metacritic": null, "released": "2018-05-23", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/a77/a77f34bf4366f59efb4c838ce3be2f90.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 352, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Shills"], "genres": ["Action", "Platformer"], "publishers": [], "esrb_rating": null}