{"id": 109471, "slug": "console-cowboy", "name": "CONSOLE COWBOY", "name_original": "CONSOLE COWBOY", "description": "<p>CONSOLE COWBOY is a cyberpunk stealth / action game</p><p>The objective of the game is to breach the corporate building and hack their computers for valuable intel, can you get out alive?</p><p>Made for #Cyberpunkjam2014 by Goro &amp; Bag.</p><p>Everything was made from scratch for this project :)</p><p>Gameplay isn't quite finished, as we have lots of ideas we want to implement. Bugs are sure to be found.</p><p>Game contains mild sexual themes and some strong language.</p><p>------------------------------------------------</p><p>Explanation of hacking:<br/><br/>F starts the hack, first it will detect if a firewall exists. If it exists, run the appropriate program ;) after that, select program to breach the computer.<br/>This will give you a few options, format, shutdown and hijack etc. Hijack increases your score by a small amount.</p><p>------------------------------------------------</p><p>What do you do in the game?</p><p>The idea is simply that you should infiltrate the building in the middle (the tallest one around, you can't really miss it) and inside that building are patrolling guards and stuff but the most important thing that you should keep an eye out for are the computers that are scattered around inside the building, some of these are hackable(see hacking explanation above) and some are not powered on. And you get points (that are hidden but change the ending) by hijacking them so other hackers can use them as gateways or gathering intel from them.</p><p>And you can complete the game by heading back to where you started out from.</p><p>------------------------------------------------</p><p>Quick recap:</p><p>* You start off, facing the big building in the center of the map.</p><p>* Infiltrate that building and head inside, sneaking will do you good since the guards inside are quite jumpy.</p><p>* Find computers that you can switch on by pressing 'F' while facing them and hack them in one of the four ways that the character is able to. Some computers have a firewall and this needs to be shut down before you can successfully hack something.</p><p>* Once a computer is successfully hacked you gain points that change the ending a little.</p><p>* PLEASE NOTE: The ending IS the place where you start off, and while it's possible to head in there when you first start off the guy there won't like that too much. :)</p><p>* PLEASE ALSO NOTE: Keep the rest of the controls and keyboard-layout in mind... F10 restarts the game.</p><p>------------------------------------------------</p><p>update:</p><p>v1.4: More fixes, AI has audible footsteps, AI targets you vertically also + other stuff.</p><p>v1.1: fixed enemy AI, enemies can now hear sounds you make properly + lots of other stuff</p>", "metacritic": null, "released": "2014-03-12", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/e9e/e9ea4937cee5a9da4926cfc27ab5127d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 69, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ODS"], "genres": ["Action"], "publishers": [], "esrb_rating": null}