{"id": 109428, "slug": "star-cycle", "name": "Star Cycle", "name_original": "Star Cycle", "description": "<p><strong>In 5 Billion years our planet is going to be absorbed by the sun..</strong></p>\n<p>This was the pitch that gave me the idea for this game.</p>\n<p>The idea was to make a game in a personnal game jam, 48hours, over a weekend.</p>\n<p>It's a metaphor of the entropy, by clicking to level up a planet, you add energy in your solar system, creating a disorder and making the sun grow bigger. This game is here to question how big things are in our universe and talk about the fear of feeling small.</p>\n<p>I went for a planet simulation, looking at the work of \"Daniel Linssen\" on \"Planetarium\". I also got inspired by \"Mining Station\", an android idle game.</p>\n\n<p><strong>How to play :</strong><br/></p>\n<p>Drag around and click. Slide from left to right the solar system and interact with it.</p>\n<p>Once you unlock a planet, click on it to generate life on this planet.</p>\n\n<p><strong>Goal :</strong><br/></p>\n<p>Reach the last level of the last planet to get the end animation.</p>\n\n<p><strong>Features :</strong><br/></p>\n<ul><li>You can create life by clicking on the planet, it adds a life form on the planet and multiplies your income.</li><li>Sun growing and eating up planets.</li><li>Randomly generated planets, moons, asteroid feilds, clouds.</li><li>Randomly generated names.</li><li>Planet dying when too close to the sun.</li><li>Confort zone of the solar system, if a planet is too close, it dries up and no water can be find on the surface, if it's too far, water just covers allmost the whole planet.</li><li>Quote generator to make you smarter ;) .</li><li>Used fibonatchi numbers to create all the game, ratios, idle mecanics.</li><li>END animation ! Will you reach it ?</li></ul>\n\n<p><strong>Missing :</strong><br/></p>\n<ul><li>I tried during the last moment of the game jam to add a saving system, unfortunatly it doesn't work proprelly sometimes..</li><li>The sun grows but sometimes doesn't grow as fast as wanted..</li><li>The planet should not reset after dying but they could..</li><li>Once you finish the game, it should restart with a new cycle but sometimes it turns out to have some unpredicted behavior..</li><li>Sounds..</li></ul>", "metacritic": null, "released": "2018-08-26", "tba": false, "updated": "2019-08-28T23:24:28", "background_image": "https://media.rawg.io/media/screenshots/0ee/0eec56631d09774faaa85c84f1d97a42.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 43, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["AntoineFauville"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}