{"id": 10955, "slug": "kursk-battle-at-prochorovka-indie", "name": "Kursk - Battle at Prochorovka", "name_original": "Kursk - Battle at Prochorovka", "description": "A fan of the old Avalon Hill/SPI WW2 strategy war games? Like to think about your next move rather than having quick reaction times? Battle Series Eastern Front - Kursk - Battle at Prochorovka is the game for you.<br/><br/>Battle Series Eastern Front - Kursk - Battle at Prochorovka, covers one of largest single tank battle in the history of warfare. Approximately 1000 tanks and assault guns met head to head near the town of Prochorovka, in a battle that became a desperate close range shoot-out which would decide the ultimate success or failure of Operation Zitadelle.<br/><br/>The 2nd SS Panzer Korps began it's attack on July 3rd, and spent the next 8 days breaking through the dense Russian defensive positions. During the late afternoon and evening of the 11th, they broke through and repulsed a counterattack by the Russian 31st Tank Corps. Reorganizing during the night, the panzers struck northward before dawn on the 12th. As dawn broke, the lead German elements ran head-on into the lead elements of the Soviet 5th Guards Tank Army and the battle was on. It was to last all day, in confused and savage fighting at close ranges. <br/><br/>This game recreates that day with the player being able to play both as the Russians and Germans or against the AI. Go to yobowargames.com for the latest news and support.Key Features:<ul><li>Turn Based with each turn having a Move and Attack phase<br/></li><li>Units are at battalion level and represent the units present on the day of the battle <br/></li><li>Units have an Attack, Defense and Movement Allowance<br/></li><li>Artillery units also have a Range allowance<br/></li><li>Map represents the key features at the time with the embanked railway line and river causing the fighting to be fought almost as three separate battles<br/></li><li>Play as the Germans against the Computer AI<br/></li><li>Three scenario variants</li></ul>", "metacritic": null, "released": "2017-03-09", "tba": false, "updated": "2019-08-28T22:14:09", "background_image": "https://media.rawg.io/media/screenshots/680/680c85bff7bc2512904d590a607f9dfb.jpg", "website": "http://kursk.yoboeargames.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 5}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 315, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC", "iOS"], "developers": ["Slitherine Software", "Yobowargames", "Lance Craner"], "genres": ["Strategy", "Indie"], "publishers": ["Slitherine", "Yobowargames", "Lance Craner"], "esrb_rating": null}