{"id": 109528, "slug": "a-quiet-space", "name": "A Quiet Space", "name_original": "A Quiet Space", "description": "<p>Angela is an introverted book-loving deep-sea angler fish. She delights in the reading lamp that grows out of her head. Help her find some space apart from her roommates in their crowded home, so that she can finally read in peace. The challenge is that her roommates are attracted to her reading lamp.<br/></p>\n<p>Made for #DragonJam: GameDevNetwork: Dragon Jam. The game jam's theme was: \"sea and space\". I made it about deep sea creatures not having enough space, and juxtaposing space aesthetics with deep sea phosphorescence.</p>\n<p><strong>What's with this strange art style? </strong>I used Tilt Brush (drawing program that lets you draw in virtual reality on HTC Vive or Oculus) to draw all the models, cleaned them up and rigged/animated them in Blender, and then imported them into Unity.<br/></p>\n<p><strong>Instructions:</strong><br/></p>\n<ul><li>Find books and read them while keeping your serenity.</li><li>Point and click to move.</li><li>When near enough to a book, you will see the text above the book. Type the text on your keyboard to \"read\" them. You will gain some serenity for each correct letter typed. When you've completed \"reading\" the book, it will disappear in a whirlpool. </li><li>Your many roommates will wander towards you. They will start draining your serenity if they are close to you. The closer they are, the faster they drain you. Stay away from them as much as you can.</li><li><strong>Victory</strong>: you read all 10 books.</li><li><strong>Loss</strong>: you lose all your serenity.</li><li><strong>Cheat Key:</strong> backslash to skip the current typing line. You don't get the serenity bonus for typing though.</li></ul>\n<p><strong>Tools</strong>: Unity, TiltBrush (the models were all drawn in Tiltbrush and imported into Unity!), Blender, GarageBand on iPad, Audacity.</p>", "metacritic": null, "released": "2017-09-10", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/040/0402ba71886edc40b21600bf41229ed9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 137, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["andyman404"], "genres": ["Action"], "publishers": [], "esrb_rating": null}