{"id": 109571, "slug": "mechanical-workshop-zeta-plus", "name": "Mechanical Workshop Zeta PLUS", "name_original": "Mechanical Workshop Zeta PLUS", "description": "<p>Mechanical Workshop Zeta PLUS is finally here!<br/></p>\n<p>Part visual novel, part paper doll, and part turn based combat, this game is ALL catboy mecha action! Create your custom pilot, build your custom mech, and fight your enemies how you want!</p>\n<p>In the 7th Mecha Cup Tournament, only one team will emerge victorious! Customize your own super fighting robot using over 52 custom parts, and face off against four unique enemy combatants before going up against the reigning champ! </p>\n<p>Mechanical Workshop Zeta Plus is a story-oriented game and may contain catboys. Please check with your doctor to see if Mechanical Workshop Zeta Plus is right for you or your loved one.</p>\n<p>Originally conceived as a game jam for the 2018 Dogpit Jam, MWZ was created in under ten days, and was released as a buggy mess.<br/></p>\n<p>A few months later, the game has been completely redone, with tons of extra features!</p>\n<ul><li>Character Creator</li><li>New Battle System</li><li>Redrawn Mecha Art</li><li>New Characters</li><li>Mewtype Mode</li><li>Dialogue System</li><li>Catboys Whomst Say Swear Words</li><li>Animations</li><li>Sound Effects by 2Mello</li><li>Over 50%(?) Less Bugs</li></ul>\n\n<p>A few tips</p>\n<ul><li>Stick around until the end of the credits</li><li>Let the text finish displaying before clicking the next button. Clicking too quickly may cause some animations not to play.</li><li>If you keep losing, try playing on Mewtype Mode from the main menu's settings page!</li><li>Run in default resolution (1024x728, Windowed)</li><li>I have no idea if it actually works on Mac/Linux; I have no devices to test this. If you want to try, be my guest!</li></ul>", "metacritic": null, "released": "2018-08-03", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/6f8/6f886587b8e35aabbfac2824326a8871.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 140, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Jamie Geist"], "genres": [], "publishers": [], "esrb_rating": null}