{"id": 10952, "slug": "guild-quest", "name": "Guild Quest", "name_original": "Guild Quest", "description": "You’ve just bought yourself a new island with a derelict Guildhall and it’s time to fill it up with <strong>QUESTS</strong>!<br/><br/><br/>In fact, it turns out that first island is just the start of many, and soon your quest empire will grow. Fill each island along the way, and unleash your guildians onto your own custom quest lines. You pick the types of quests you want and then reap the rewards. <br/><br/>Want to take it slow and safe? Create a bunch of adventure quests. Want to indulge in the thrill of battle for higher danger but higher rewards? Build battle quests and reap in the XP to level up your guildians. Collect cards and equip them to gain permanent boosts, earn star points and invest them to even change the look of your guildians!<br/><br/><br/>Collect different guildian classes and equip them to whatever islands you have. Swap them out and find the best combinations for the job. Having trouble with some nasty orcs? Make sure you have some Knights to help protect the others, or maybe a Cleric will do the job and keep everyone healed. It's up to you! <br/><br/>Once you conquer an island and move onto another one, you can either leave your guildians behind or bring them with you to tackle new challenges. <br/><br/><br/>Luckily, your guildians are smart enough to do your job without question, even when you're not around! So come back later, collect your rewards, and expand further. Guild Quest has been designed to be much more of a Second Screen kind of game you can run on the side (even while playing other games). <br/><br/>The challenge curve is up to you. Build the world you want to see then sit back and watch your Guildians go!", "metacritic": null, "released": "2017-01-26", "tba": false, "updated": "2023-10-28T05:47:44", "background_image": "https://media.rawg.io/media/screenshots/073/0737def014367b4fc3e566cdb9439642.jpg", "website": "http://hyperhippo.ca/games/guild-quest/", "rating": 2.34, "rating_top": 3, "added_by_status": {"yet": 11, "owned": 384, "beaten": 3, "toplay": 1, "dropped": 25, "playing": 1}, "playtime": 1, "achievements_count": 104, "ratings_count": 29, "suggestions_count": 220, "game_series_count": 0, "reviews_count": 29, "platforms": ["macOS", "PC"], "developers": ["Hyper Hippo Games"], "genres": ["RPG", "Strategy", "Simulation", "Casual", "Indie"], "publishers": ["Hyper Hippo Games"], "esrb_rating": null}