{"id": 109610, "slug": "frizzy-itch", "name": "Frizzy (itch)", "name_original": "Frizzy (itch)", "description": "Update 10/12/15 - The game has been officially released on Steam!  Download the Early Access version here:http://store.steampowered.com/app/391100?beta=0<p>\n<br/>\n</p><p>\r\n\tThank you for your support!\r\n</p><br/>\r\nHere's a Frizzy trailer<p>\n</p>and here's another,and another,and here's a video of a boss Fight against the evil Doof!The game<p>\r\n\tFrizzy is a platformer filled with awesome action. The main plot is that you are a frizzy ball of fur who can latch onto static balls launch himself around the levels.\r\n</p>Gameplay<p>\r\n\tThe most important thing about Frizzy's gameplay, to us, is the way the\r\n\tcontrols feel. We believe that in a platformer the controls must be absolutely perfect.\r\n</p><p>\r\n\tThe gameplay is based on solving puzzles. You'll find locked doors, crazy enemies, wacky obstacles, destroyable boxes and more.\r\n</p><p>\n</p>Somewhere on Fuzz Island…<p>\r\n\tFrizzy was minding his own business. He worked in the fuzzball factory on Fuzz Island. One day he noticed something in the clouds, something he had never seen before. It was a ball of static energy, and he could tell from it's magnificence that only he could see it.\r\n</p>Forlorn, he thought of how he would never reach those clouds. They're so high! And he is so small.<p>\r\n\tFor years Frizzy's Village on Fuzz Island had been tortured by an Evil Dragon. His name was Doof, and once a year he would come to the island and attempt to blow all the pretty Fuzzballs away. This day was known as the \"Great Green Sneeze\" on Fuzz Island, and every year all the fuzzy families would hide out and latch on for safety, or be gusted into eternity.\r\n</p><p>\r\n\tBut one year something glorious happened. Frizzy was dutifully working in the fuzz factory when he saw a bunny playing outside his window.\r\n</p>Hop.<p>\r\n\tHop.\r\n</p>Hop Hop.<p>\r\n\tSo he followed it. But he had forgotten that today was the day of the great sneeze! By the time he had remembered, it was too late. He saw the green fog coming in and was swept away.\r\n</p><p>\r\n\tThe Great Green Sneeze came and with its mighty wind Frizzy was blown high into the air. From up in the air he could see further and clearer than any Fuzzball before him could. Then he remembered!\r\n</p>\"I must fuzzyfloat my way towards the ball of static energy!\"<p>\r\n\tLike any other ball of dirt and hair, Frizzy is fully in control of how he maneuvers through the air. He floated and spun and twisted and paddled. Through the air he went, and he floated his way towards the ball. Finally he reached it, and he found something amazing!\r\n</p>Frizzy could magically attach to the ball!<p>\r\n\tHe looked down and gazed upon Fuzzy Island. He wondered if any of the other fuzzballs had forgotten to hide indoors during the Great Green Sneeze. For a moment he pictured his fuzzy family, and his little brother Lint.\r\n</p><p>\r\n\tThe moment was interrupted by the foulest of laughter.\r\n</p><p>\r\n\t\"Heauheauheuaheuhaeuau\" yelled Doof the Dragon.\r\n</p>\"You have discovered your power, but I have discoveredyou!\" howled Doof.<p>\r\n\t\"Who… who are you??\" Frizzy whimpered.\r\n</p>\"I am Doof. And you… ARE MINE!\"<p>\r\n\tFrizzy felt the second sneeze only for an instant, and blacked out. It blew him further from his family than he could ever possibly have imagined. He woke up on a platform covered in grass.\r\n</p>\"This is the furthest from home I've ever been.\" Frizzy said.<p>\r\n\tPress start.\r\n</p><p>\n<strong>Brendan Rivers</strong> – Brendan is a software engineer from Long Island who studied Computer Science. He worked doing web design and database administration. He worked with Major League Baseball statistics for Player Arbitration. Brendan enjoys making music and loves to tinker with instruments. His music can be found at his soundcloud and Frizzy's soundcloud.\r\n</p><p>\n<strong>Patrick Collins</strong> – Patrick is a software engineer from Long Island with a Degree in Computer Engineering. He works on graphics software for major television networks. Some of the tools he makes were used during the world cup. You've probably seen his work! Patrick loves video games and their history.\r\n</p><p>\n<strong>Trevor Hock </strong>– Trevor is a graphic designer from New York City with a BFA from Purchase University. He works doing graphic design for a company that creates educational software. Trevor is a music fanatic. He loves RiFF RAFF.\r\n</p><p>\n<strong>Maggie Collins </strong>– Maggie is Team Frizz's Office Manager. She handles all the paperwork, and makes sure we don't say anything inappropriate on social media. She is an avid dog lover.\r\n</p><p>\n<strong>Lukaz Guzman – </strong>Lukaz is the main animator and 3D modeler involved with Frizzy the game. He is an amazing artist and his art can be found at http://www.furiouspoly.com/\r\n</p><p>\n<strong>Jessie Richards</strong> – Jessie is a concept artist and helped us bring Frizzy to life.\r\n</p>", "metacritic": null, "released": "2015-07-16", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/09d/09d100826bbf59d0bee4210bb51e29e5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 81, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["TeamFrizz"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}