{"id": 109656, "slug": "littler-inferno", "name": "Littler Inferno (itch)", "name_original": "Littler Inferno (itch)", "description": "<p>A PICO-8 demake of Tomorrow Corporation&#39;s Little Inferno for #DemakeJam.<br />\nLife got in the way with this one so it&#39;s basically only half-finished. The core of the game is in there and working,  but there&#39;s no story or way to &#39;win&#39; (aside from unlocking all the objects).<br />\nThings that made it in:<br />\nBurning objects!Collecting coins and Tomorrow Stamps.Purchasing stuff from the catalogs with coins. The catalogs are all &#39;unlocked&#39; from the start, but you&#39;ll still have to work your way through them by burning things.Using Tomorrow Stamps to speed up delivery. Unlike the original, you only use one stamp at a time, and there&#39;s no option to confirm so careful not to waste them!Four catalogs and 48 products to burn! Includes returning favourites from the original game as well as some new swag.<br />\nThis is more than I originally expected to get done, but there&#39;s still a bunch of stuff missing. There&#39;ll probably be at least one post-jam update which adds stuff, but I&#39;m already close to the PICO-8 token limit so some things might not fit in.<br />\nThings that didn&#39;t make it in:<br />\nThe story! Specifically the envelopes and endgame section (the story was /is going to take place after the one in the original)The different burning effects for different objects (explosions, freezing, movement etc.)The coin spiders on the wallAll the music and most of the sound effectsObjects leaving ashes when they burnBurning objects setting other objects alight when close togetherBetter gravity/physicsSome graphics and animations are still missing (like the catalog covers)Anything else I missed (there&#39;s bound to be something!)<br />\nThanks to Kronbits for hosting the jam, and Tomorrow Corporation for making the original Little Inferno. Also, Tomorrow Corporation have just released their new game 7 Billion Humans which looks really cool, so check it out!<br />\n(and now... I sleep!)<br />\nUPDATE: Fixed a bug where the game crashed when you unlocked everything. Sorry if you were caught by it!</p>", "metacritic": null, "released": "2018-08-24", "tba": false, "updated": "2020-11-02T10:54:09", "background_image": "https://media.rawg.io/media/screenshots/365/3650e7ffcbf62258422d1f96f19a2038.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 47, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Harder You Fools"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}