{"id": 109744, "slug": "power-master-1-a-strange-journey", "name": "Power Master 1: A Strange Journey", "name_original": "Power Master 1: A Strange Journey", "description": "<p><strong>150 Downloads! Thank you everyone!</strong><br/><strong> </strong></p>\n<p><strong>Synopsis<br/></strong></p><p><strong>A demo of the remake of this game is available here: https://powermaster.itch.io/power-master-1-a-strange-journey-mv-demo</strong></p>\n<p>Begin the adventure of a new journey. Take control of your party and save the world as it is once again under attack from the revived wizard, Exitilus. His goal: Obtain all 26 of the wish-granting Gems that reside in the land of Moneo. Collect them all before he does and then take the fight to him! Journey through towns in any order, which consists of forests, large buildings, volcanoes, everlasting mazes, deserts, spaceships, alternate dimensions, mountains, and more! Choose your path wisely, as some towns are higher in difficulty than others. Level up by defeating enemies to get stronger and learn new skills, and equip the strongest weapons and armor to get stronger still! </p>\n<p>You'll encounter enemies such as swordsmen, witches, giant clocks, aliens, and even yourself!</p>\n<p>Though that remains your main goal, there are many people who need your help. Take on quests given by the residents of Moneo and receive a reward for the detour. Many secrets are hidden away in Moneo, as well. Burn trees and blow up mountainsides to uncover rare treasure and maybe even a new dungeon! </p>\n<p>You are the descendant of the original heroes who defeated Exitilus a thousand years ago. Live up to your lineage, but you don't have to go it alone. Three others will join you when you find them: a warrior, a digger, and your cousin. Explore this new world and learn everything there is to know about it! Both you and your character are seeing this world for the first time, so gain knowledge, friends, experience, and soon nothing will stand in your way.</p>\n<p>The game plays and takes inspiration from older role-playing games, such as Dragon Warrior and Final Fantasy. It contains many fantasy-like elements, such as swords, dragons, an expansive overworld, quirky dialogue, and learning how to navigate on your own. Learn new skills to get the edge on your foes and gather Info Cards to learn more about the enemies you've faced! If you need to get around faster, use the Gems you collect for a quick warp to its respective town. </p>\n<p>Travel a new world, make new friends, and live the start of a long and strange journey.</p>\n<p><strong>Characters</strong></p>\n<p>These characters can be swapped around based on the player's beginning decision, which slightly affects the game and story.</p>\n<ul><li>Stephan: The \"Boy 1\" option. Cannot use magic, so he relies mainly on offensive tactics. Uses swords, shields, bows, and axes.</li><li>Jennifer: The \"Girl 1\" option. The quickest in the game and has both offensive and status inducing/recovery skills. Uses swords, shields, bows, and magic.</li><li>Hamilton: The \"Boy 2\" option. The strongest in the game and is capable of wielding two weapons instead of one. Uses swords, axes, and magic.</li><li>Helen: The \"Girl 2\" option. Not the strongest character, so she relies mainly on defensive and helpful skills. Uses whips, magic, bows, and shields.</li></ul>\n<p><strong>Controls</strong></p>\n<p>Arrow Keys – Move character/highlight command/etc.</p>\n<p>Z Key – Select/Activate/Open/Talk/etc.</p>\n<p>X Key – Menu (when in the field)/Cancel (when in menus)</p>\n<p>Shift Key – Hold to run</p>\n<p>Alt+Enter – Full Screen<br/></p>\n<p><strong>Information</strong></p>\n<p>The game was made using the RPG Maker VX Ace engine, with some added components, such as music and sprites, from the XP and MV engines. Custom sprite work was also made by me and my brother. The game uses both computer-drawn and hand-drawn sprites, so it may look a little off. But it fits the title.</p>\n<p>The game is made specifically for Windows systems. If you want to play the game on a MAC or another system, conversion by an external program is needed. </p>\n<p>The game is only in English.</p>\n<p><strong>Rating</strong></p>\n<p>By ESRB standards, the game would be rated E for Everyone. Contains Fantasy Violence and Comic Mischief.  <br/></p>\n<p><strong>History</strong></p>\n<p>Power Master 1: A Strange Journey spent almost eight years in the making. The original idea was planned out in 2008 and was finalized on paper in 2011. Since then, it went through several designs in different programs, such as Unity, before being developed for the RPG Maker VX Ace engine. This game was made with the original plans in mind and was kept as true to the source material as possible. Within this time-frame, Power Masters 2 and 3 were also finalized on paper, and development on Power Master 2 will start soon.</p>\n<p>This is kind of a bittersweet moment for me, really. I spent a good portion of my life working on this first game of mine, and now it is done! I feel proud, accomplished, and upset all at the same time. I no longer have to work on this game anymore, but that doesn't mean I'm done. I still have many more ideas…</p>\n<p><strong>Credits</strong><br/></p>\n<p> Game Design, Character Concepts, &amp; Dialogue </p>\n<p>Alexander Bodine </p>\n<p> Custom Portraits &amp; Title Screen Art </p>\n<p>   Geoffrey Bodine </p>\n<p> Battlers </p>\n<p>   Geoffrey &amp; Alexander Bodine </p>\n<p> Beta Testers </p>\n<p>  Zachary Etherington </p>\n<p>    Spencer Bodine </p>\n<p> Scott Smith </p>\n<p> Special Thanks </p>\n<p>  Pam Kuhn </p>\n<p>    Doug Bodine </p>\n<p>    Michelle Bodine </p>\n<p> And all the rest of my friends, family, and the fantastic people on the RPG Maker forums who helped and supported me to make this game. </p>\n<p> This game was created using assets, such as music and sprites, created by the engines RPG Maker XP, VX Ace, and MV. </p>\n<p> (c)2004-2016 Enterbrain/Degica/Kadokawa Games </p>\n<p> Program created by ASCII </p>\n<p> The land Andrabax and the characters therein are creations of Geoffrey Bodine and the character Marceus is a creation of Edgar Gobo. </p>\n<p> The Party-Based Graphics script was created by Hime. </p>\n<p> The large tree used for Tora Tree was created by Celianna. </p>\n<p> The Basic Side-view Battle script was created by Fomar0153. </p>\n<p> All other properties are properties of their respective owners. </p>\n<p> (c) 2016 Fictional Dungeon Productions </p>\n<p> POWER MASTER 1: A STRANGE JOURNEY </p>\n<p> http://www.facebook.com/PowerMasterRPG</p>\n<p>https://www.youtube.com/channel/UCjVWZUnwwKliQDcqV2iLFZQ<br/> </p>\n<p> http://www.rpgmakerweb.com </p>\n<p><strong>Update Info</strong></p>\n<p><strong>V. 1.1</strong></p>\n<ul><li>Fixed bug where Moneo does not appear</li><li>Included the RPG Maker VX Ace project data</li><li>Removed unneeded and unused graphics/events/music</li><li>Various cosmetic changes</li></ul>\n<p><strong>V 1.2</strong></p>\n<ul><li>Fixed Heat Pack event in Aora Avalanche</li><li>Corrected enemy ranges in Moneo</li><li>Various cosmetic changes and typo fixes</li></ul>", "metacritic": null, "released": "2016-03-12", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/154/1548651412867d6b236f29367fdda7f2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 221, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["PowerMaster"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}