{"id": 10977, "slug": "another-adventure", "name": "Another Adventure", "name_original": "Another Adventure", "description": "Another Adventure is a narrative video game.<br/>Adventures come and go.<br/>Maybe this is just another stupid adventure game.<br/>Maybe it's not.<br/><br/>There are 4 chapters in this game. Each of them tells a separate and distinct story with interactivity.<br/>Jonny is an ambitious college student and he has a dream. Every night he sets the alarm to 6:00 am the following morning.  \"The college lessons have been obsolete for years\" Jonny thinks. But another productive day down the drain, he just  managed to \"learn a lot on Twitter and Quora\".<br/>Jack is a programmer who dreams of changing the world. He doesn't like the company he works for very much. His current plan is to gain experience at a big company, and gather the strength to change the world in the future.<br/>Robert finds work really boring. He quit his job and sets out on his enlightening journey to Tibet<br/>Kevin believes he's an artist. He thinks great art is seldom easy to understand but art is our only chance to achieve immortality.In fact, most people would call him a game developer. But Kevin believes that games are the \"Ninth Art\",  it's more accurate to just call him an artist.<br/><br/><strong>\"He was longing for tomorrow, whereas everything in him ought to reject it.  That revolt of the flesh is the absurd. \"</strong><br/><br/>Play time between 50 – 60 minutes.", "metacritic": null, "released": "2017-03-10", "tba": false, "updated": "2021-05-21T04:48:05", "background_image": "https://media.rawg.io/media/screenshots/6f6/6f68de964435f0a8ca187f35947362d8.jpg", "website": "http://another.thankcreate.com", "rating": 3.7, "rating_top": 4, "added_by_status": {"yet": 5, "owned": 79, "beaten": 9, "toplay": 1, "dropped": 4}, "playtime": 2, "achievements_count": 5, "ratings_count": 10, "suggestions_count": 84, "game_series_count": 0, "reviews_count": 10, "platforms": ["macOS", "PC", "iOS"], "developers": ["Chuang Xie", "ThankCreate Studio"], "genres": ["Adventure", "Indie", "Puzzle"], "publishers": ["Chuang Xie", "ThankCreate Studio"], "esrb_rating": "Everyone 10+"}