{"id": 109798, "slug": "black-lung", "name": "Black Lung", "name_original": "Black Lung", "description": "<p>If the game installer does not work on Windows, please try running it as admin.</p>\n<p>The game is a narrative adventure set in 1930, Pennsylvania; during the Great Depression. The player enters the world of a coal miner, John Childs; who must work 30 days in an abandoned coal mine in order to pay for his health, as well as his family's health back at home. <br/><br/>The player will need to collect coal in order to be paid from the company in scrip. Scrip will be used as the currency to purchase items and upgrades. However, the player needs to look after their family outside the mines, and the way of doing this is by sending them cash every day. They will not accept scrip, so the player must convert their scrip into cash (at unreasonable prices) in order to keep their family alive. The game is going to be an emotional experience giving the player the feeling of being alone and having all odds against them. Working in a coal mine is dangerous, the company treats you like dirt and your family is poor and sick and needs your help. <br/><br/>Coal miners work together, but John is being sent into an old, abandoned coal mine on his own to mine out any remaining coal that the miners prior had left behind. He has been signed on for 30 days and given his own small underground cabin to reside in after a hard days work. This is where John can clean himself up, rest and receive letters from his family to see how they are going back at home. John also has a portrait of his family in his cabin to always remind him why he's risking his own life down in the mines. This portrait will not always look the same, as the portrait represents the current state of Johns family, so John knows how much attention to pay them in the upcoming days.</p>\n<p>All characters and concept conceived by the creators, any similarities are purely coincidental. <br/></p>\n<p>This game is a work in process and was submitted as a student game for JMC Academy Brisbane. We are planning to continue work on this project if we receive generally positive feedback. All feedback is welcome and we encourage it as it will help shape this game into something much more.</p>\n\n<p>For more information, please visit the official website:</p>\n<p>http://blacklunggame.weebly.com/<br/></p>", "metacritic": null, "released": "2015-02-18", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/72d/72deaa286efcbeb49ea9f071f47bbfbe.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 287, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Scar Games"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}