{"id": 109854, "slug": "spaloosh", "name": "Spaloosh!", "name_original": "Spaloosh!", "description": "<p>Two game modes are available as well as online mulitplayer play.<br/></p>\n<p><strong>Timed Attack: </strong></p>\n<p>30 seconds to destroy 3 monsters placed by the cunning Nure-Onna with two difficulty settings changing the number of bombs you are given. If you run out of bombs or time then the Nure-Onna gets a lovely snack!</p>\n<ul><li>Easy Mode: 24 bombs</li><li>Hard Mode: 15 bombs</li></ul>\n<p><strong>Monster Battle:</strong></p>\n<p>Place 4 monsters of various sizes on a grid based board and try to destroy your opponent's monsters before they destroy yours. Choose between 3 different characters and battle against the Nure-Onna!</p>\n<p><strong>Multiplayer:</strong></p>\n<p>Opponents face off against each other in a game of <strong>Monster Battle</strong>. Pick between 4 characters including the Nure-Onna herself! </p><p>Games can be played either via direct IP connections or by connecting to a server (download available below).</p><p><strong> Note:</strong> This may require the hosting player to open port forwarding for their router using the chosen port number (port 5555 is default). </p>\n<p><strong>Additional Info:</strong></p>\n<p>This game was written in the Go programming language using this library: Ebiten by Hajime Hoshi. Source code is available on my Github page. Please let me know if there are any issues you experience! :)</p>", "metacritic": null, "released": "2017-12-01", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/e31/e31678acc95fb3db88c8372a43586bd9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 45, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["atolVerderben"], "genres": [], "publishers": [], "esrb_rating": null}