{"id": 109855, "slug": "nameless-behind-the-shadow", "name": "Nameless \"Behind the Shadow\"", "name_original": "Nameless \"Behind the Shadow\"", "description": "<p><strong>Trabajo Universitario</strong></p>\n<p>Nameless “Behind the Shadow” o en su origen End of Days, nació como una<br/>idea ambiciosa de sigilo enorme y sin límites. Motivados por crear algo que<br/>representase todos nuestros gustos, el sigilo y la narrativa de un Metal Gear<br/>Solid, la fluided de Uncharted, la gráfica de Overwatch, boss épicos como<br/>Shadow of the Colossus, un mundo futurista a lo Blade Runner y un equipo de<br/>cazarrecompensas como Cowboy Bebop. Grandes objetivos que propiciaban<br/>un gran batacazo.<br/>Toda esta motivación llega por la “decadencia” del genero a algo secundario y<br/>opcional. Por otro lado, queríamos exprimir lo máximo de nosotros mismos y lo<br/>hemos hecho. Este es un proyecto hecho por nosotros mismos para nosotros<br/>mismos.<br/>Al final todo quedaría a un juego centrado en el puro sigilo, recogiendo la<br/>esencia de antaño por estos juegos el cual tiene un público muy definido pero<br/>fiel a este tipo de juegos.<br/>Por otro lado, la idea del 3D dentro del motor Unreal Engine 4 no se fue del<br/>proyecto, generando un gran reto en la resolución de este mismo. Así pues,<br/>aunque hemos reducido mucho la ratio del juego, aun nos quedaba un proyecto<br/>bastante ambicioso.<br/>El grupo está compuesto por dos diseñadores, un programador y un artista que<br/>llegaría al final del proyecto de ESNE. Por otro lado, dada la ambición del<br/>juego, necesitamos ayuda externa, consiguiendo un artista, una guionista y un<br/>diseñador gráfico y de sonido de fuera de la universidad.</p>\n<p>Aunque el proceso de creación fue duro, al final dio sus resultados, con un nivel<br/>jugable y todo un conocimiento del medio y de nosotros mismos como<br/>profesionales que nunca hubiéramos conocido si no hubiéramos tomado este<br/>proyecto de grandes dimensiones.</p>\n<p>/////////////////////////////////////////////////////////////////////////////////////////////////////////////////</p>\n<p><strong>University Work</strong><br/></p>\n<p>Nameless \"Behind the Shadow\", originally conceived as End of Days, was an<br/>ambitiously big idea about stealth without limits. Motivated to create something<br/>according to everyone's tastes, stealth and a Metal Gear Solid-like narrative,<br/>Uncharted's seamless flow, Overwatch's graphic, epic bosses like in Shadow of<br/>the Colossus, a futuristic world similar to Blade Runner and a bounty hunter<br/>crew akin to Cowboy Bebop. Goals way too big that would have ended in<br/>catastrophe. All this motivation came thanks to the decline of the genre into<br/>something secondary or optional. On the other hand, we wanted to give the<br/>best of ourselves and that's what we've done. This project was made by<br/>ourselves, for ourselves.<br/>In the end we wanted a game purely focused in stealth which gathered the<br/>classical essence of the genre since it has a very specific, yet defined, target<br/>consumer who is loyal to these types of games.<br/>Moreover, the idea of using 3D with Unreal Engine 4 gave us a challenge but it<br/>didn't get out of hand and we managed to finish it. Thus, even having reduced<br/>the size of the game, we still completed a quite ambitious project.</p>\n<p>The group consists of two designers, one programmer and one artist from<br/>ESNE. However, given the proportions of the game, we needed external help,<br/>so we gathered another artist, a writer and a graphic &amp; sound designer from<br/>outside the university.<br/>Though the process was harsh, it gave us results in the form of a playable level<br/>and an increased knowledge about the means of production and ourselves as<br/>professionals that we would have never known had we not taken up the task of<br/>fulfilling this grand project.</p>\n<p>/////////////////////////////////////////////////////////////////////////////////////////////////////////////</p>\n<p><strong>Ambientación</strong><br/>Un futuro donde la humanidad viaja libremente por el espacio, y ha logrado colonizar<br/>otros planetas. El desarrollo será en un planeta tenebroso, dominado por la<br/>corrupción y las mafias: Callejones oscuros, bares misteriosos, luces de neón que<br/>resaltan la suciedad y el mal estado de anuncios y calles.<br/>La falta de cuidado por el planeta y la sobrepoblación de máquinas han dado lugar a<br/>un ambiente contaminado y neblinoso. Los que tenían dinero huyeron del planeta<br/>cuando comenzó su deterioro, por lo que las viviendas de lujo son escasas y ahora<br/>en manos de gente poco honorable; el resto de la población vive hacinada en<br/>rascacielos deteriorados, que incluso tienen parte de la estructura derribada porque<br/>nadie se preocupa por mantenerlos.</p>\n<p><strong>Historia</strong><br/>Kim, hija de unos renombrados ladrones, trabaja para Latius, líder de la mafia que<br/>domina el planeta Vesta. Pero un suceso desencadenará que dependa de nuestra<br/>protagonista la oportunidad de acabar con el dominio de Latius; a riesgo de cómo<br/>pueda afectar al planeta (luchar tribales para ganar la corona) o al grupo (se quedan<br/>sin jefe y “protector”).</p>\n<p><strong>Créditos</strong><br/></p>\n<p><strong>Guillermo Garaizabal Arjona</strong><br/>Game Designer/Producer<br/>guiller.g@hotmail.com<br/>Linkedin: Guillermo Garaizabal Arjona</p>\n<p><strong>Eduardo Cortejoso López</strong><br/>Programmer<br/>eduardo_goin@hotmail.com</p>\n<p><strong>Ruben Carpintero Familiar</strong><br/>Concept Artist/ 3D Artist<br/>wowdissidia@gmail.com<br/>ArtStation: darknaruga.artstation.com</p>\n<p><strong>Gonzalo Martín Álvarez</strong><br/>Game Designer<br/>goncho_7@hotmail.es<br/>Twitter: @gonbiju<br/>Linkedin: Gonzalo Martin Alvarez<br/><br/><strong>Alex González Mata</strong><br/>Sound and Graphic Designer<br/>alexrivas4@gmail.com<br/>Linkedin: Alejandro González Mata</p>\n<p><strong>Alicia Murillo Martínez</strong><br/>Scriptwriter<br/>alimurillomartinez@gmail.com<br/>Twitter: @AliciaMurilloM<br/>Linkedin: Alicia Murillo Martinez</p>", "metacritic": null, "released": "2017-10-23", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/296/296307cc7d430760f3ab2a6495b6ec4b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 143, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Dream Architects"], "genres": ["Action"], "publishers": [], "esrb_rating": null}