{"id": 109938, "slug": "diluvium", "name": "Diluvium", "name_original": "Diluvium", "description": "<p><strong>Diluvium</strong> is a game made by Renaud, Devine, Henk and Dom2D as <em>Les Collégiennes </em>over the course of TOJam The Sevening, a 48h game jam (though we had a ~8h headstart on that) which took place between May 11th and 13th 2012.</p><p>Diluvium is a versus typing tactics game.</p><p>There are two summoners on the battlefield, and you are one of them. Type animal names to summon them, and they will attack the enemy’s spawns and ultimately the enemy summoner himself. The first to kill the other one wins, as these things usually are.</p><p>You can type up to three animal names in a row, which spawns a totem of these three animals. Each animal has its own stats : speed, attack power, health and intelligence. The totem is as intelligent as its most intelligent member, and health is summed up, but movement speed is averaged.</p><p>If someone spawns a dog on the playfield, nobody can spawn another dog until it dies. No duplicate animal! Thankfully you have 284 animal names to choose from, 100 of which are illustrated differently.</p>\n<p>The game has a half-assed single-player mode that you can access by typing “LOCAL” in the connection screen. Otherwise, the game should work fine in LAN and over the Internet, as long as you open up the server’s port 10000 (I’m not sure whether Unity networking uses TCP or UDP, so go for both). The connection screen lets you know your LAN and WAN IPs as you host the game.</p><p>Things you can also enter at the connection prompt : “MUTE” to kill the music, “IDDQD” for degreelessness mode, and one other secret code which will be revealed elsewhere on the interwebs!</p><p>For more information about the commands you can enter on the splash screen, see Devine’s wiki page on Diluvium.</p>", "metacritic": null, "released": "2013-10-16", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/f99/f99cf7e08faf148ee271a06fd1b17c07.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 77, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Renaud Bédard"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}