{"id": 109953, "slug": "tempus-denique", "name": "tempus denique", "name_original": "tempus denique", "description": "<p>Headphones highly recommended.</p><p><em>And when things start looking up for you, you start thinking that you'll die from something irrelevant at 20, like being hit by a car or something.</em></p><p><em>You look at your list of tasks in your planner and then you look at your google calendar, while also checking this blue flashcard you did a while back with five goals for that month, in an attempt to boil down what *really* needs to be done but there's too much everywhere and you've taken up five different projects so that when you get bored by one you can get to the other but none of them seem appealing when you're frantically looking at your list of tasks, at your planner, at your google list of planner of projects-</em></p><p><em>Time. It all boils down to time, and the fact that you're always getting conflicting advice: some people tell you to try out all the things you can while you can because you'll wake up tomorrow and you'll be 40 and I'll stop here because you've heard this all before, but others tell you that you should probably slow down and enjoy existing and life and uni years are the best and you'll wake up tomorrow and you'll be 50-</em></p><p><em>Tempus denique. Denique is short, tempus is time. It should be tempus breve est if we wanted to be very correct but it sounded nicer as tempus denique, it sounds so final, like a proper statement, like you were adding some profound thought to it because you used latin but truth is you dropped it after a year and now you're reminded of your high school and of the time that is not short, but simply passed.</em></p><p><em>There's only twenty seconds of this left and you're starting to get a bit anxious but then you think back again and this time instead of it being all the bad moments and all the things you won't get to do again it's about all the things you won't get to do again but that were so. Fucking. Great. That it's impossible for it to be two occurrences of the same awesomeness and so you breathe in, and out. And in, and out. Tempus denique. The end.</em></p>", "metacritic": null, "released": "2016-09-18", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/532/532b02a8076839e2a3042fd9488de107.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 2, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Vaida"], "genres": [], "publishers": [], "esrb_rating": null}