{"id": 109997, "slug": "phozox", "name": "Phozox", "name_original": "Phozox", "description": "Phozox - Alpha DemoA challenging puzzle platformer in a beautiful and relaxing world<p><em>Phozox </em>is a <strong>puzzle platformer</strong> with a strong emphasis on bright fun platforming combined with <strong>challenging physics based puzzles</strong>. The game is heavilly inspired by classic games like Spyro on the PS1 and aims to give a nostalgic and relaxing platformer feeling. While the first levels will be very simple matters of jumping around, later levels will require complicated solutions, involving moving blocks and other objects to trigger events or get past a seemingly insurmountable obstacles. </p><p>The story revolves around Phoz - the guardian of the gravity crystals which hold all of existence together (who just so happens to have misplaced ALL OF THEM), and his quest for the gravity crystals that will stop the world being pulled apart and save the world. </p><p>Key Planned features: <br/>+ 4 worlds each with around 12 levels including a detailed large and interesting HUB world<br/>+ Many physics interactions and puzzles including many classic platforming elements along with some modern rigidbody physics ones<br/>+ A splitscreen coop world<br/><br/></p><p>I work on this project alone in my spare time between school work and would greatly appreciate you following the project and supporting me in it's continued development by providing feedback.</p><p>Development Stream: www.twitch.tv/resinresin</p><p>Dev Youtube: https://www.youtube.com/user/ResinresinOffical</p><p>Twitter: https://twitter.com/Phozox<br/></p>", "metacritic": null, "released": "2015-09-29", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/bab/bab78e105849d334d230d406c092d68c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 59, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Resin"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}