{"id": 10998, "slug": "heliborne", "name": "Heliborne", "name_original": "Heliborne", "description": "Get behind the cockpits of the best helicopters in the world – from the classic machines of the 1950s to the modern gunships of the 21st century. Play missions with your friends and compete with players from all around the world in various multiplayer modes! You will be able to take part in a dynamic battlefield where you'll support the movement of ground forces that fortify positions and create supply lines.THE RETURN OF HELICOPTER COMBAT GAMESHeliborne marks the great return of a nearly forgotten genre - helicopter action games! Here you'll get to dive into historical conflicts, explore maps inspired by real-world locations and engage in ruthless air-to-air and air-to-ground combat. <br/><br/><br/><br/><br/>By flying over 40 helicopters distributed over 3 different classes you'll fight other pilots as well as tanks, troops, and anti-aircraft artillery. You will test your skill in multiplayer modes, such as Skirmish (King-of-the-Hill style mode) or Frontline (as bases are captured by players, ground vehicles spawn in convoys and move across the map to fortify bases and positions), or play alone the new single player missions. <br/><br/><br/><br/>In Heliborne we wanted to to faithfully recreate the realities of armed conflicts and produce a gameplay model that is both dynamic and realistic. You will also get the chance to learn more about the development of rotary-wing aircraft. The game shows different historical periods, focusing on the technological innovation which changed helicopter combat over the years. For example, the load-outs for each helicopter are based entirely on weapons systems that ware or would have been employed in active combat theaters and operations. <strong>You won't see a weapons load-out on our helicopters that is not historically accurate!</strong>PLAY HELIBORNE TO:<ul><li><strong>NEW! Battle the AI in the new single-player mode!</strong> <br/></li><li>lose yourself in a dynamic combat flying game<br/></li><li>fly over 40 legendary helicopters, including models from 1955 to 2000's<br/></li><li>use over 100 possible payload variants<br/></li><li>wide open maps, including The Gulf of Tonkin (Vietnam), Operation Nguyen Hue (Vietnam), Badakhshan Province (Afghanistan), Khost Region (Afghanistan), and Kosovo<br/></li><li>test your skills in single player, co-op, and competitive multiplayer for up to 16 players<br/></li><li>play your way: fully supports gamepads, flight sticks, and keyboard &amp; mouse!</li></ul>", "metacritic": null, "released": "2016-02-15", "tba": false, "updated": "2023-09-27T18:30:57", "background_image": "https://media.rawg.io/media/screenshots/e38/e38d822738dc40119970866c35383559.jpg", "website": "http://www.helibornegame.com/", "rating": 2.29, "rating_top": 1, "added_by_status": {"yet": 5, "owned": 192, "toplay": 1, "dropped": 4, "playing": 3}, "playtime": 3, "achievements_count": 50, "ratings_count": 6, "suggestions_count": 564, "game_series_count": 0, "reviews_count": 7, "platforms": ["macOS", "Linux", "PC", "Xbox One"], "developers": ["JetCat Games"], "genres": ["Action", "Massively Multiplayer", "Indie"], "publishers": ["Klabater"], "esrb_rating": null}