{"id": 109960, "slug": "adventurers-ring-a-one-bit-game", "name": "Adventurer's Ring: A One-Bit Game", "name_original": "Adventurer's Ring: A One-Bit Game", "description": "<p>You are a magic ring that Adventurer is using to find Grail from deep in Dungeon. Use your powers of detection to avoid danger and lead Adventurer to glory!</p><p>Game for Daniel Linssen's April 2016 Bit Jam. This game has only one bit of bandwidth to the user, its UI is a single pixel and its audio output matches the UI. Best played with a controller for analog dowsing.<br/></p><p><strong>Three taps</strong> - Adventurer is asking you for directions.<br/><strong>Two taps, then two more taps</strong> - Adventurer can hear a monster nearby. Avoid it to keep Adventurer safe!<br/><strong>Three strikes, then three more strikes</strong> - Adventurer fought a monster and is now wounded. Find a healing potion!<br/><strong>Screaming, followed by three taps</strong> - Adventurer walked into a trap and is now wounded. Find a healing potion!<br/><strong>Three long taps</strong> - Adventurer found a healing potion and drank it.<br/><strong>Musical fanfare</strong> - Adventurer found Grail. Your quest is over!<br/><strong>Three seconds of screaming</strong> - Adventurer died.</p><p><strong>XBox Controls: (You might need to click on the viewport, it needs focus for controller input.)</strong><br/><strong>X + Left Joystick: </strong>Tell Adventurer to start walking in a direction. You can tell whether Adventurer is wounded by listening to the footsteps. Tap X, A, or B again to stop.<br/><strong>B + Left Joystick: </strong>Dowse in a direction for monsters and traps. Monsters make staccato noises. Traps make long noises.<br/><strong>A + Left Joystick: </strong>Dowse in a direction for healing potions and Grail. Healing potions make long pulsing noises. Grail you need to finish your quest makes three quick noises.<br/><strong>Start:</strong> Restart the game</p><p><strong>Keyboard Controls</strong><br/><strong>1 + Arrow Keys:</strong> Tell Adventurer to start walking in a direction. You can tell whether Adventurer is wounded by listening to the footsteps. Tap 1, 2, or 3 again to stop moving.<br/><strong>2 + Arrow Keys:</strong> Dowse in a direction for monsters and traps. Monsters make staccato noises. Traps make long noises.<br/><strong>3 + Arrow Keys:</strong> Dowse in a direction for healing potions and Grail. Healing potions make long pulsing noises. Grail you need to finish your quest makes three quick noises.<br/><strong>Escape:</strong> Restart the game.<br/></p>", "metacritic": null, "released": "2016-04-30", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/bbd/bbd445e434372ef6fb3e55fdf6355540.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 14, "game_series_count": 0, "reviews_count": 0, "platforms": [], "developers": ["koboldskeep"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}