{"id": 11006, "slug": "copter-and-sky", "name": "Copter and Sky", "name_original": "Copter and Sky", "description": "Welcome to Copter and Sky, a brand new, hexacopter RC simulation! <br/>\n<br/>\r\nYou will control a modern RC hexacopter in different gamemodes, levels and more! You will fight against the wind to fly, monitor the battery charge and avoid crashing into objects to prevent damage which could lead your copter to failure. Currently, the game has many features such as - going fishing, racing, golf, shooting cannon balls into the goal and carrying objects from A to B all while controlling your drone! The game is built within Unreal Engine 4, which brings excellent physics which makes drone control more difficult, and brings a nice touch to realism as you play. In it's current state, the game is ready for release. Updates are not guaranteed, but if the game becomes popular enough we plan to add customisation options to your drone and possibly more levels, gamemodes and more. <br/>\n<br/>\r\nHere is a simplified list of what Copter and Sky has to offer currently:- <br/>\n<br/>\r\n1. Real input controls with gamepad support. <br/>\r\n2. Custom camera; Third person, first person, cinematic. <br/>\r\n3. Golf, Fishing, Racing, Obstacle Courses, Shooting and more. <br/>\r\n4. Lovely graphics and realistic lighting and maps; day and night cycle. <br/>\r\n5. Friendly support. <br/>\r\n6. Guarantee for fun if you enjoy flying drones.", "metacritic": null, "released": "2016-07-21", "tba": false, "updated": "2019-08-28T22:14:07", "background_image": "https://media.rawg.io/media/screenshots/15b/15b3394d08e8dddbba485956d76dcfac.jpg", "website": "http://flydreamdev.com/projects/copter-and-sky/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 49}, "playtime": 1, "achievements_count": 43, "ratings_count": 2, "suggestions_count": 490, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Kopnin Pavel", "Kopnina Ksenia"], "genres": ["Action", "Simulation", "Casual", "Indie"], "publishers": ["Kopnin Pavel"], "esrb_rating": null}