{"id": 110003, "slug": "press-bird-to-play", "name": "Press Bird To Play", "name_original": "Press Bird To Play", "description": "<p>\r\n\tThe Bird stole the Pirates Cutlass - find the bird and get the Cutlass back!<br/>\r\n\tA short adventure with mini-games bringing you into the game with Oculus Rift DK2 support and the Leap Motion (desk position!).<br/>\n<br/>\r\n\tEverything in the game is scaled 1:15, so it's like playing with a gigantic dolls house ... of a factory.<br/>\n<br/>\r\n\tThis game lets you interact with your environment in all 3 dimensions, which works very well with the depth perception inside the Oculus Rift.<br/>\r\n\tWith a Leap Motion on your desk (not mounted to the OR!) you put your hands into Virtual Reality. But thanks to scaling your reach is amplified and you can precisely navigate objects through the room.<br/>\n<br/>\r\n\tWhat you can do ...<br/>\r\n\t... guide floating coins by push or pull<br/>\r\n\t... move wooden boxes and barrels around<br/>\r\n\t... hold a tiny version of your hands in front of your eyes<br/>\r\n\t... shot bottles with a magic ball<br/>\r\n\t... turn on or play with lights<br/>\r\n\t... play with fire<br/>\n<br/>\n<br/>\r\n\tPress Bird To Play is a one man project created in Unity. <br/>\n<br/>\r\n\tHow To Play:<br/>\n<br/>Press \"r\" at any time to center the camera (usually it is needed once when you start).<br/><br/>\r\n\tYou can touch the pirates head to turn on or off his following of your hand when it gets close. If he is activated the candle on his hat is lit.<br/>\r\n\tThe rest is just experimentation and riddle solving - and having fun.<br/>\n<br/>\r\n\tThe Pirate and the game world are build upon the same assets I am using to create \"VR Adventure - The Sorcerer's Labyrinth\", a modern interpretation of classic roleplaying games and adventures like Chrono Trigger and Monkey Island in VR. <br/>\r\n\tMost artwork, models, sfx and music used in my games have been created by great artists all over the world. They were either free or purchased. I want to say thank you to all these artists enabling small indie game developers to create nice looking and fun experiences.<br/></p>", "metacritic": null, "released": "2014-12-01", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/958/958aeeba70a23670f28a8ff3d69baa87.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 251, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["gterveen"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}