{"id": 110193, "slug": "silent-notice", "name": "Silent Notice", "name_original": "Silent Notice", "description": "<p>You are a transfer student of X Highschool, starting 12th grade,  where you meet 5 wonderful women, one of which you share a dorm with.  Does love occur or is their a fatal ending?</p>\n<p><strong>Trigger Warning</strong><strong>s</strong>:  Contains sensored swearing. eg. B**ch.</p>\n<p><strong>CHARACTERS</strong></p>\n<p><strong>Beatrice. </strong>A brash, hard-headed girl with British parents, who moved to japan just before she was born.  She tends to get into trouble a lot.</p>\n<p><strong>Chizuki.</strong> A cool, kuudere type girl who doesn't seem to pay attention to her surroundings and is often aloof.<br/></p>\n<p><strong>Dia.</strong> A diligent and hardworking girl who always studies, she is quite kind and wont mind lending notes to friends.</p>\n<p><strong>Noriko.</strong> A girl who seems needy for attention, she likes playing a big sister role.</p>\n<p><strong>Toru. </strong>A tomboyish girl who enjoys sports and video games, she wasn't originally at X Highschool until a year ago, when her parents moved from the country into the city.</p>\n<p><strong>NOTICE</strong></p>\n<p>This game is under development, anyone who volunteers/contributes towards making the game will be credited. There is currently no art for the game, We will continue updating the game every month, the next update is planned to be August 14th 2018. <br/></p>\n<p>Any feedback on improving the game is very appriciated, espially pointing out grammar errors, bugs or just suggestions for the game. Thank you for downloading</p>\n<p><strong>Updates</strong></p>\n<p>Ver 0.1 13 July: Prologue added, with 5 girls. with a very basic gui system.</p>", "metacritic": null, "released": "2018-07-14", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/fa5/fa50efec0906924744506923f4c25f9c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 1, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Chui-Rii"], "genres": [], "publishers": [], "esrb_rating": null}