{"id": 110183, "slug": "leather-jacket-gaiden-iv", "name": "Leather Jacket Gaiden IV", "name_original": "Leather Jacket Gaiden IV", "description": "<p>\r\n\tDoes Li have what it takes to infiltrate the XXL Amazon Warehouse, retrieve the 18 Power Jackets, and escape with their life?</p><p>\r\n\tPlay the role of Li, a trained Leather Operative, as they navigate the dangerous obstacles of The Largest Amazon Warehouse in the universe. Navigate the hard platformer obstacles and collect all the boxes to save the power jackets from falling into Enemy Hands.</p><p>\r\n\tCollect the notes left behind in Power Jacket Pockets to unravel The Mystery of the Deep, and rid the world of unleathering.</p><p>Wield never-before-seen* Amazing Powers after retrieving all 18 power jackets.</p>With revolutionary features, like:<ul>\n<li><strong>Don't fall!</strong> — If you fall into a pit in this game, you will die!</li> <li><strong>Don't get hit!</strong> — If a drone or worker hits you, you'll also die! Don't let that happen!</li> <li><strong>Jump to evade!</strong> — You can use your very powerful legs and leather boots to jump over things sometimes!</li> <li><strong>Revolutionary Physics</strong> — You can jump while falling, ya dingus.</li> <li><strong>Feign death!</strong> — Much like evading bears, some drones won't hit you if you pretend to be dead!</li> <li><strong>Hide in closets!</strong> — Just like how I spent gym class! Hide in closets and crevices throughout the facility to evade workers!</li></ul><p>* May have-been-seen-before in Sonic the Hedgehog, Kill la Kill, Dragonball Z, and other media.</p>", "metacritic": null, "released": "2014-04-12", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/0b9/0b9dc9cfaddfde1b80931349dd95ca50.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 67, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["devFluid"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}