{"id": 110145, "slug": "hey-roncabilly-the-game-of-healthy-sleep", "name": "Hey Roncabilly! The game of healthy sleep", "name_original": "Hey Roncabilly! The game of healthy sleep", "description": "<p>Hey, Roncabilly! The game of healthy sleep is a Brazilian educational game developed by Sabiarts in the demand of Dr. Fernando César Mariano,  otolaryngologist and sleep surgeon, with the objective of informing children, adolescents and interested people about apnea (snoring) and healthy habits of sleep.<br/><br/>Play and find out more about healthy sleep!</p>\n\n\n<p>Hey, Roncabilly! O game do sono saudável é um jogo educacional brasileiro desenvolvido pela Sabiarts em demanda do Dr. Fernando César Mariano, médico otorrinolaringologista e especialista em medicina do sono, com o objetivo de informar crianças, adolescentes e interessados sobre apneia (ronco) e hábitos saudáveis do sono.<br/></p>\n<p>Jogue e descubra mais sobre sono saudável!</p>\n\n\n<p>¡Hey, Roncabilly! El juego del sueño saludable es un juego educativo brasileño desarrollado por Sabiarts en la demanda de Dr. Fernando César Mariano, otorrinolaringólogo y cirujano del sueño, con el objetivo de informar a los niños, adolescentes y personas interesadas sobre la apnea (ronquido) y hábitos saludables de sueño.</p>\n<p>¡Juega y descubre más sobre el sueño saludable!</p>", "metacritic": null, "released": "2018-02-22", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/0ba/0baddeffdb607d480a12a0fbb608bdb3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 25, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Android", "Web"], "developers": ["Sabiarts"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}