{"id": 110171, "slug": "samuraii", "name": "Samuraii", "name_original": "Samuraii", "description": "Samuraii<p>Idea, design &amp; code by Torsten Hartmann, Animations by Eduard Anton, Music by Fearing</p><p><strong>How to Play<br/></strong>- Wait for the signal to turn green, otherwise you will kill yourself!<br/>- Try to hit your action key fast. Player one's action key is \"X\", player two's is \"M\".<br/>- The first to hit his/her action key is the attacker.<br/>- The opponent now only can defend using his/her action key and very precise timing.<br/>- If the attack is parried: REPEAT!</p><p><strong>Thoughts<br/></strong>I really don't know if this is going to work out. I mean: A flash game for two players on one keyboard? Come on! Yeah. But hey, let's give it a try. Oh, and I know what you're thinking: Samurai Gunn! I have yet to play Samurai Gunn when it's going to be released on Playstation 4 and I already think that I will love it. And yeah, I got my inspiration from Samurai Gunn as well as from countless matches of Samurai Shodown with my pals on the Neo-Geo. So, no offense. Regarding the western music by Fearing: I have a thing for games like \"Samurai Western\" and movies like \"Tsukiyaki Western Django\", mixing the styles of Spaghetti Western and Japanese culture. Consider this game my two cents. And yes, I also ripped off the double \"i\" from Nintendo Wii for the two player aspect. Shame on me. This is the second flash game I did with the help of Eduard Anton. Be sure to check out his page.</p><p>I'm thinking about adding more stuff in the future. If this is going to work out.</p>", "metacritic": null, "released": "2014-04-02", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/7b5/7b5561a7ae89133c0d0768887ca51630.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 17, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Torsten Hartmann"], "genres": ["Action"], "publishers": [], "esrb_rating": null}