{"id": 110144, "slug": "madness-at-monster-manor-2d", "name": "Madness at Monster Manor: 2D!", "name_original": "Madness at Monster Manor: 2D!", "description": "Madness at Monster Manor: 2D!<p>\r\n\tMadness at Monster Manor: 2D! is an asymmetric local-multiplayer survival horror game that was designed to be played using modified anaglyph 3D glasses. It was created as part of XMG Studio's first annual \"Game Marmalade\" game jam in Oct 2014.\r\n</p><p>\n<strong>**The game requires 4 gamepads to play**</strong><br/>\n</p><p>\n<strong>*** PLEASE NOTE: The modified anaglyph 3D glasses are not required to play, however they are highly recommended! (Makes the game x100 more spooky) Scroll down for instructions on how to make your own modified anaglyph 3D glasses! ***<br/>\n<br/>\n</strong>\n</p><p>MaMM: 2D! stars a trio of mystery teens attempting to escape Monster Manor and evade the horrors lurking inside.</p><p>The 3 teen players need to evade the monster player and escape Monster Manor. The teens' goal is to activate 3 switches to open the exit portal and escape. The monster's goal is to kill the teens before they have a chance to escape!</p><p>The 3 teen players (wearing blue glasses) can't see the monster, and the monster player (wearing red glasses) can't see the teen's switches. Any spectators who are watching the game without glasses can see the whole picture!</p><p>\n</p><br/>\r\nHow to make your very own modified anaglyph 3D glasses\r\n<p>\n<br/>\r\n\tStep 1: Get multiple pairs of Anaglyph 3D glasses (red/blue 3D glasses). You can \r\n\tbuy them online or check out your local dollar store to pick up a few pairs.\r\n</p><p>\r\n\tStep 2: Cut em in half.\r\n</p><p>\r\n\tStep 3: For blue glasses, tape two blue halves together (you'll need 3 of these to play the game). For red glasses, tape two red halves together (you'll only need 1 of these).\r\n</p><p>\n<br/>\n<br/>\n</p><p>\n<br/>\n</p>Questions?<p>\tQuestions about Madness at Monster Manor: 2D? Contact us: contact@xmgstudio.com</p>", "metacritic": null, "released": "2014-12-05", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/947/947c80a8d7e9fdd045fa0cce0913bd8f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 125, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["XMG Studio"], "genres": ["Action"], "publishers": [], "esrb_rating": null}