{"id": 11010, "slug": "the-light-empire", "name": "The Light Empire", "name_original": "The Light Empire", "description": "Welcome to TLE, you will be taking control of a spaceship as it's commander. Your goal will be to locate and destroy an enemy military platform. <br/>You must manage a crew who have specific needs and make decisions quickly! What will you do if your O² generator is damaged and it no longer produces enough oxygen for all of your crew? It is up to you to make the right decisions. All this in an open world with RPG elements. You are free to do what you want in a completely randomly generated universe, full of events that will benefit you or not ....Main Characteristics : <br/><ul><li> <strong>Evolved in a completely random world : - </strong>The world is randomly generated for each game and every game. Nothing is planned in advance, any events are generated as you choose your journey. Once you have selected a destination there is no turning back. <br/></li><li> <strong>RPG system : - </strong>Each ship will have different basic statistics with the ability to grow in power as you level. <br/></li><li> <strong>A living crew  : - </strong>You need to meet the needs of your crew Food, oxygen and not to mention their salary. Each crew member that can not be paid, will desert your ship. Every crewmember will have a special skill to improve your ship.<br/></li><li> <strong>Total freedom  : - </strong>Once in your new ship, you are free to advance in the game as you want. You will be hired or fired, but know that your ship will require improvements for you to survive, and therefore need money! <br/></li><li> <strong>Random events  : - </strong>Each new destination will bring new challenges. Will you meet an enemy ship? Or a merchant ship? Pay attention and react accordingly! <br/></li><li> <strong>A slow and painful death  : - </strong>Remember one thing. Once you are dead, it's over. No turning back, The slightest mistake or a bad decision and you will have to start over again! </li></ul>Upcoming Features : <br/><ul><li> <strong>Planetary exploration  : - </strong>You have the chance to get down on planets and explore randomly generated worlds. <br/>You must adjust depending on the gravity, atmosphere , monsters and NPC's that will be present. <br/></li><li> <strong>Additional events  : - </strong>The space is unpredictable, other random events to come out over time.<br/></li><li> <strong>Dynamic events  : - </strong>Once the game is \"stable\", you will have updates that will include dynamic events, the occurence of flagship, or an enemy commander, for example, that will save a lot of resources if you can defeat him. It is very hard to survive in the world of TLE, and through these events you are going to be a big help, which can eventually make you win the game! To you to keep you informed, announcements will be made in advance so that you can prepare.<br/></li><li> <strong>Other surprises await you  : - </strong>I will not reveal the rest, but know that other additions are planned for the longer term[/ list]</li></ul>", "metacritic": null, "released": "2015-12-02", "tba": false, "updated": "2019-08-28T22:14:07", "background_image": "https://media.rawg.io/media/screenshots/9fe/9fe7f02aa983378e17fa13635c31f1d9.jpg", "website": "http://jemyjan01.wixsite.com/thelightempire", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 20}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 202, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Jemy"], "genres": ["RPG", "Simulation", "Indie"], "publishers": ["Jemy"], "esrb_rating": null}