{"id": 110200, "slug": "sokoban", "name": "SOKOBAN (itch)", "name_original": "SOKOBAN (itch)", "description": "# English\r\n<p><strong>SOKOBAN</strong> was made for the Gamecodeur Jam #12 with the following theme in mind: sokoban.</p>\n<p>The goal is to push all the boxes on the designated locations.</p>\r\n# Français\r\n<p>Le but est de pousser toutes les boîtes sur les emplacements désignés.</p>\r\nPost-jam\r\n<ul><li>Sauvegarde et récupération des niveaux créés</li><li>Sauvegarde de la langue sélectionnée</li><li>Changements dans l'interface graphique:<ul><li>Ajout de flèches pour faire défiler les niveaux dans l'écran de sélection</li><li>Ajout de boutons <em>Editer</em> et <em>Suppr.</em> dans l'écran de sélection pour les niveaux créés par le joueur</li><li>Changement du curseur au survol de la souris sur des éléments cliquables</li><li>Changement dans l'affichage du message de fin de niveau</li><li>Traduction du message lors du chargement</li><li>Désactive le bouton de sauvegarde dans l'éditeur juste après avoir sauvegardé et le temps que le message de confirmation ne disparaisse</li></ul></li><li>Ajout de 6 niveaux, portant le total à 9 niveaux pré-intégrés</li><li>Correction d'un bug dans l'enchaînement des niveaux (merci Asthegor)</li></ul>\n<ul><li><strong>Élève Premium de Gamecodeur</strong><ul><li>oui</li></ul></li><li><strong>Langage et Framework utilisés</strong><ul><li>JavaScript (ES6) avec Phaser CE</li></ul></li><li><strong>Code par ... / Graphismes par ... (peut être \"téléchargés sur xxx\") / Musique et sons par ...</strong><ul><li><strong>Code:</strong> moi</li><li><strong>Assets:</strong> Kenney</li><li><strong>Musique:</strong> Barry \"Ishara\" Peddycord</li></ul></li><li><strong>Utilisation de librairies et codes externes</strong><ul><li>Rien à part Phaser CE et un <em>plugin</em> que j'avais fait pour UP UP UP! afin de gérer le <em>swipe</em></li></ul></li><li><strong>Temps passé</strong><ul><li>Une semaine à raison d'environs 2/3h par jour et de deux derniers jours de <em>rush</em></li></ul></li><li><strong>Comment as-tu (ou pas) abordé la contrainte du thème</strong><ul><li>Je m'étais lancé sur une idée de \"Sokoban Maker\" qui aurait comporté une sauvegarde en ligne des niveaux créées et qui auraient pu être partagées avec les autres joueurs</li><li>A la mi-chemin, j'ai décidé de me débarrasser de tout ça et de focus sur le minimum syndical fonctionnel (ce qui a finalement déjà pris pas mal de temps en soi)</li></ul></li><li><strong>Petit postmortem (avis sur le langage/framework utilisés, difficultés, succès, choix, bilan personnel rapide, etc...)</strong><ul><li>Petite déception sur le fait d'avoir laissé tombé le côté \"Sokoban Maker\", mais c'était oublier ça ou ne rien sortir pour la jam</li><li>Je suis un peu parti dans tous les sens au départ, avec l'implémentation de fonctions pour gérer les formats de levels \"officiaux\" qui, au final, ne m'aura servi à rien et m'aura forcé à faire quelques <em>hacks</em> ça et là pour ne pas réécrire toute cette partie</li><li>Vestige du maker: j'ai un petit éditeur qui permet de créer des niveaux ou de remixer ceux qui existent</li><li>Pas mal de lutte avec Phaser et, surtout, ses tilemaps (vivement la v3 qui devrait sortir bientôt, histoire de voir si c'est mieux)</li><li>Le jeu est fait pour une utilisation sur mobile (de part le format de l'écran ainsi que la gestion du <em>swipe</em>), mais gère aussi le clavier et la souris pour les <em>desktops</em></li><li>Jeu multilingue \\o/</li><li>J'aime à penser que je me rapproche toujours un peu plus du jeu que je pourrais vendre, mais ça manque encore et toujours de <em>polish</em>; ça reste quand même le jeu le plus complet que j'ai fait pour le moment (plusieurs écrans, éditeurs, etc.)</li></ul></li></ul>", "metacritic": null, "released": "2018-01-28", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/ddf/ddf71e97138235d3c013bc2451b02e06.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"beaten": 1, "toplay": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 36, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Mickawesomesque"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}