{"id": 110216, "slug": "economia-en-una-arepa-jam-edition", "name": "Economía en una arepa [Jam Edition]", "name_original": "Economía en una arepa [Jam Edition]", "description": "<p><strong>NOTA: esta es la versión para el #VzlaCrisisJam, se harán nuevos release en otra página. https://teamvictorious.itch.io<br/></strong>\n<strong>NOTE: This is the version for #VzlaCrisisJam, new releases will be made on another page. https://teamvictorious.itch.io</strong></p><p>Eres el gobernante, y debes tomar decisiones con precaución, ya que las mismas afectarán la vida de Esteban, un destacado empresario dueño de su propia Arepera</p>\n<p>Adaptación del libro “La economía en una lección” bajo el estilo de una novela visual, donde se busca tomar algunas de las decisiones que han llevado a Venezuela a la crisis en este aspecto; Mostrando consecuencias de las mismas y de cómo sería la realidad en casos alternos, de manera tal de educar y romper con esas falacias económicas en la sociedad, y evitar a que se vuelvan a tomar en el futuro.<br/></p>\n<p><strong>Resumen del libro</strong></p>\n<p>Mediante un lenguaje sencillo (Por estar dirigido al público en general y no sólo para economistas) el autor toma varias creencias comunes sobre el tema económico y las cuestiona, quedando claro no sólo que dicho conocimiento popular es mentira, sino además explicando las futuras consecuencias de tomar decisiones en base a cada una ellas. (disponible en: https://goo.gl/d9pvbk )</p><br/>", "metacritic": null, "released": "2017-05-27", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/233/2337426e52f05cc1de90e147cd495b42.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 40, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Team Victorious"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}