{"id": 110266, "slug": "lantern-of-worlds-itch", "name": "Lantern of Worlds (itch)", "name_original": "Lantern of Worlds (itch)", "description": "<p><strong>Lantern of Worlds</strong> is a computer game based on Arabian mythology and the tales of 1001 Nights. It is inspired by older games like the Quest for Glory series, Eye of the Beholder and Lands of Lore.</p>\n\n<p>In Lantern of Worlds you are one of the\r\nroyal adventurers of king Valdemar of Idunia. You are send on a\r\ndiplomatic mission to the courts of Sultan Mehmet the Magnificent.\r\nOn\r\nyour way there, however, dark forces plot your undoing, and you are\r\nleft in the middle of the ocean, in a small lifeboat, with nothing\r\nbut your wits and your determination to survive. <br/></p>\n<p>Luckily, you\r\nspot an island in the distance...a desert island, where many\r\nadventures await you! <br/></p>\n<p>\r\nBut during during your adventures,\r\nyou will find that great events have been set in motion, and that you\r\nhave a grand role to play in the undoing, or salvation, of the\r\nkingdom of Idunia, and indeed, the world.</p>\n\n<p><strong>- 6 different voice-actors!</strong><br/><strong>- Various random locations &amp;\r\nencounters!</strong><br/></p>\n<p><strong>- More then 40 different stories!</strong></p>\n<p>One of the aims of the game is to\r\nintroduce especially younger players to the mythologies and folk\r\ntales of the world, and create for them an atmosphere of storytelling\r\nand wonder! <br/><br/>As Lantern of Worlds is largely based on text and reading, we\r\nhope that it may contribute to the reading skills and text\r\ncomprehension of younger players, and show them a bit of the magic of old\r\ntales and stories, read from a dusty old book! </p>\n\n<p><strong>Lantern of Worlds</strong> is the first of what\r\nwill be a series of games, each based on a different world mythology.\r\nStart on an epic journey that will take you to faraway lands,\r\nenchanted islands, castles in the clouds, and places of such beauty\r\nand wonder that defy imagining! <br/></p>\n<p>Who knows where you will end\r\nup, and what great adventures will await you! <br/></p>\n<p>The first game is available on<strong> Steam</strong> now!<br/></p>", "metacritic": null, "released": "2017-03-13", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/63c/63c29c502fe833d2b8ae237e2377caf9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 208, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Fasold"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}