{"id": 110204, "slug": "lucky-days", "name": "Lucky Days", "name_original": "Lucky Days", "description": "<p>Originally released Feb 2014</p><p><strong>Synopsis:</strong><br/>Maya's life hasn't been going too well lately. Dead parents, laid-off, and now her uncle has suddenly dumped a $5,000 debt and a 30 day deadline on her! Her luck seems to take a turn for the better though when she winds up at Lucky Cafe which offers her a job. Will she be able to make up $5,000 in a month or let herself enjoy life a little with the help of her co-workers?<br/><br/><strong>Info:</strong><br/>Art, Writing, and Coding by Vagrant-Muffin (Jen)<br/>There are a total of 4 character paths and 3 endings + A bonus \"date\" scene unlocked with all endings<br/>(A completed character path leads to special dialogue for each ending, this dialogue isn't needed to unlock the bonus)<br/>There are 5 CGs, one for each character path and one from the bonus<br/>Involves a job scenario system, where you can pick the job Maya will do for the day<br/>Word count: 24,547 words<br/>File size: About 170 Mb<br/>(I'm sorry, it's a really big file!)<br/></p><p><strong>Notes:</strong><br/>This is my first visual novel, so there are many aspects of the game that would need more polish. Please point out any problems you encounter (I've only been able to test the Windows version) and feel free to critique! I know I need the help…In essence though, this was a fun project (a labor of two months putting it together and a month of planning) and I hope to improve on my next game.<br/><br/>I'm not sure if this final note is necessary, but Lucky Days is not an accurate depiction of being a waitress/server. You definitely wouldn't find so many customers who'd generously tip $20…On that note though, remember to always tip!</p><p><strong>Hints:</strong><br/>The three endings are a Friendship ending, Runaway ending, and Paid-off ending. The friendship ending includes all the characters and is triggered on day 15. Serving tables gives the most tips. Also be careful about the choices, the choices are locked when scrolling back!</p>", "metacritic": null, "released": "2016-11-20", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/3d2/3d21bc085bfd9d56b402720db092f094.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 61, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["vagrant-muffin"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}