{"id": 110267, "slug": "security-guard-simulator", "name": "Security Guard Simulator", "name_original": "Security Guard Simulator", "description": "<p><em><strong>I</strong></em><em><strong>t's your first day on your new job as a security guard for a truck agency. You hope you'll last longer in this job as you try to keep your small dreams alive in a security state built on surveillance and tracking its citizens' behavior.</strong></em></p><p><em>Security Guard Simulator </em>is an exploration of the state of a mind living under surveillance while being a critique on the popular and formalist aspects of games that need to be \"fun\" and to give player \"choice and agency\" with a definite \"victory/goal\" and a failure/game over\" state.</p><p>It attempts to evoke a feeling of living under a heavy state of hidden oppression when under surveillance and robbing player of choice and agency. By doing that, the game also attempts to emphasize on simulating the boredom inherent in the job of a security guard, which often boils down to finding ways to kill time.</p><p>In doing so, <em>Security Guard Simulator </em>functions both as a simulation of an experience of boredom in a dystopian world that's not very different from ours and also as a critique of conventional game aspects like choice, agency and goal. In other words, it's intended to be a slap and a mockery of the idea that all games should be \"fun\".</p><p><strong><em>Any sign of a goal is purely coincidental and is most likely an illusion.</em></strong><br/></p><p><em>Security Guard Simulator </em>is the first entry in the six-part conceptual series \"Agency?\", with a new game releasing every Sunday.</p><p><strong>Credits:</strong><br/></p>Most of the 3D assets were taken from TurboSquid.<p>Contact about the game or any issues with it to lightnarcissus at gmail dot com</p><p>Visit my site for other games and written work.</p><p>Or follow me on Twitter: @lightnarcissus</p>", "metacritic": null, "released": "2015-02-23", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/940/940112bc356c60f6ddd00e04684baff2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 64, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Ansh"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}