{"id": 110215, "slug": "final-voyage", "name": "Final Voyage", "name_original": "Final Voyage", "description": "<p><strong>What is \"Final Voyage?\"</strong><br/>In Final Voyage a catastrophic breach has occurred on your space ship and you are tasked with containing it until you reach the base. In this fast phased **RTS** you juggle macro oriented building and resource management with micro heavy combat. It is highly recommended that you take your time and read this page, specially if you are new to the RTS-genre.</p>\n<p><strong> [Controls]</strong></p>\n<ul><li> Scroll wheel = Zoom in or out.¨</li><li> Arrow keys / mouse movement = Move camera</li><li> Left Click + Drag = Select</li><li>Right Click = Issue move command (Won't stop to shoot enemies until destination reached)</li><li><strong>[A]</strong> - Attack move (Stop to attack if enemies enter the units range)</li><li> <strong>[R]</strong> - Restart the game.</li><li><strong>[E]</strong> - Start the engine of the ship when you are ready for the first wave of enemies.</li><li> <strong>[S]</strong> - Issue a stop command.</li><li><strong>[B] </strong>- Open the Build menu</li><li><strong>[M]</strong> - Minimize the Minimap</li></ul>\n<p><strong>[3 Quick tips]</strong></p>\n<ol><li>Watch the mini map for breaches.</li><li> Researchers generate currency when on Alien occupied tiles.</li><li> A good plan B is to build a new base and Defend that rather than trying to contain the enemies.</li></ol>\n<p><strong>[Strategy]</strong></p>\n<p><strong>[Early game]</strong></p>\n<p>The key to the early game is to keep an eye on the mini-map in order to quickly see when your walls break. Build new walls as soon as possible. Focus on building a lot of units and ignore researching. Keep it simple, but effective. If you mess up you can always press [R] to restart and try again.</p>\n<p><strong>[Mid game]</strong></p>\n<p>Try to get a few researchers on enemy soil. Their resource gathering is key to keeping up with the growing strength of the Alien. Keep producing units and repairing the walls. If things are under control spend some currency on upgrading your units. This will come very handy later on.</p>\n<p><strong>[Late game]</strong></p>\n<p>At some point you will lose control of the alien and he will successfully breach your walls. Stop trying to contain him at this point as it is just a waste of resources. Pick a part of the map that is far away and construct a new base there. The goal is no longer to contain the Alien but to fight tooth and nail for survival and hope that you reach your destination before your last defenses fall.</p>", "metacritic": null, "released": "2018-08-14", "tba": false, "updated": "2019-08-28T23:24:25", "background_image": "https://media.rawg.io/media/screenshots/f88/f888fb85bfd6637aab8aad3075f36dbc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 29, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Windmill Games"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}