{"id": 110300, "slug": "bowmen", "name": "BowMen (itch)", "name_original": "BowMen (itch)", "description": "<p>It is a medieval themed RPG game, where bow and arrow are the primary weapon for Aziath, the hero. Aziath is supposed to go through all the four stages and end the Gwaunnas, the enemy race and safegaurd the kingdom of Peria. This stunning game is availble for PC too and is filled with more thank 4 hours of exciting game play.</p><p>Story:<br/>Kingdom of Peria is one of the wonderful and peaceful places. Peria has got one of the strongest armies in the world. The kingdom is surrounded by thick woods and denser forests. The motherland is being ruled by The Lord Croesus, who is known for his wealth and love towards his people. The forests around are filled with most cruel race of cannibals and half men. The race is locally called as Gwaunnas. Gwaunnas gradually got stronger and started attacking the civilians of Peria. It has become a difficult task for the king to handle the situation and decided to send the army to call an end to the notorious race in woods. The kingdom's army in chief Aziath has different thing in mind, he do not want to waste the valuable lives of army for the cruel race and he want to handle the situation alone. King was surprised for the decision of Aziath and asks Necromancer to guide Aziath and help him out in his adventure.</p><p>Four Stages:<br/>Four different stages of the game include 1. Wastelands of Peria, 2. Land of White Reigns 3. Perian Coast 4. The Dark Woods</p><p>Enemies:<br/>Gwaunnas, the enemies are of 12 kinds that the Aziath will face as he move across all the 4 stages of thegame</p><p>Shop:<br/>As the Aziath moves across and collects the wealth he can use it across in buying the new arrow sets and upgrade them to fire arrow and lightning arrows.</p><p>Achievements:<br/>Aziath has got various achievements that he can achieve to display his adventure skills.</p>", "metacritic": null, "released": "2015-11-10", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/b12/b125595149e119ebaea2700d190e584d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 230, "game_series_count": 0, "reviews_count": 1, "platforms": ["Linux", "PC", "macOS"], "developers": ["The Red & Black"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}