{"id": 110304, "slug": "dungeon-junkie", "name": "Dungeon Junkie", "name_original": "Dungeon Junkie", "description": "<p>==-What Even Is This?-==<br/></p>\n<p>Dungeon Junkie is a small Dungeon Crawler inspired by games like Shadowgate and The Legend of Zelda. You are tasked with exploring the 4-level Dungeon, with 21 rooms each and unique paths. After collecting the Artifacts and Gold, you must defeat the Final Boss (Sweaty Steve). We're always adding secret rooms, NPCs, and items too, so keep your eyes peeled! [^-^]</p>\n<p>This game was made using Bitsy and Beepbox. The newest release will always be updated here and then added to the official GitHub repository. This game originated as a small text adventure, which you can check out and play on our website. This is a constantly changing game, so make sure to check the devlogs to see what's new! If you have any questions, email me or get in touch with us with one of the many methods on our website.<br/></p>\n<p>We hope you enjoy this little project as much as we do.</p>\n<p>~SmickyG and the Gang</p>\n<p>Controls -  WASD to move. Run into things to interact with them. Touch Screen controls are also available. Swipe and hold to move, and tap to click.<br/></p>\n<p>==-A quick note on the Point System-==</p>\n<p>When you finish the game and proceed to the final room to view the stats, your final score is a string of several numbers with length depending on how many items you collected. Each 50 represents an item you collected. Say your final score has all 8 items, it would look like this:</p>\n<p>Final Score: 5050505050505050</p>\n<p>Simply adding these will give you your final score.  Please, feel free to post your score, gold count, and time (a thread has been created for each) in the comments below!</p>\n<p>==-Important Links-==<br/></p>\n<p>Check out our website here!<br/></p>\n<p>OST here!</p>\n<p>BeepBox online music tool here!</p>\n<p>HTML source files can be downloaded from this project's GitHub repository here or you can get the newest release directly from this page.  This game is open for modding! Make sure to upload the mod here on itch (with a new name, of course) and comment a link below. There's a tutorial video on our website that goes over uploading the game to the Bitsy editor if you do wish to do this.</p>", "metacritic": null, "released": "2017-12-15", "tba": false, "updated": "2019-08-28T23:24:25", "background_image": "https://media.rawg.io/media/screenshots/f38/f381f24f4ecb3c6c104b7a6a8c85f41d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 67, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["SmickyG"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}