{"id": 110479, "slug": "blogger", "name": "Blogger", "name_original": "Blogger", "description": "<p><strong>PLEASE NOTE: </strong>If there is some text at the bottom that seems to be cut off, just scroll down to the rest of it <em>(</em>Works best with middle mouse button<em>)</em></p><p><em>Blogger - Developed by ThePCGamer101 using the twine Engine by Chris Klimas</em></p>Key Features :-<ul><li>A short interactive story</li><li>An interactive story where you choose and see the consequences</li><li>For MAC and Linux Users, you can play the game also!</li><li>For Mobile Users, you can play the game also!</li><li>Updates to polish the game and make it better</li><li>Best of all, it's FREE!</li></ul>Description :-<p>My friend and I have known each other for years. We always used to meet up and have fun, we always used to gossip and share our secrets. We also used to message each other whenever we were sick and help each other out whenever we had problems...</p><p>Until she met this new guy... now I have become a person who needs to express his feelings</p><p>Be careful what you post on Blogger</p>Reviews and Comments :-<p>There are no reviews or comments yet :(</p>Extras :- Song<p>The official song to the Twine game Blogger, developed by ThePCGamer101 and published by CityMayor Games. You can download the song for free from Bandcamp <em>(</em>www.citymayorgames.bandcamp.com/releases<em>)</em></p>Extras :- Book<p>The official book to the Twine game Blogger, developed by ThePCGamer101 and published by CityMayor Games. You can read the book for free from Wattpad <em>(</em>www.wattpad.com/user/ThePCGamer101<em>)</em></p>Extras :- Support<br/><p>If you encounter technical problems with the game, you can contact our CMG Support Team by visiting CMG Support <em>(</em>www.citymayorgames.wix.com/cmgsupport<em>)</em></p>Extras :- Other Games<p>If you enjoyed Blogger, then why not visit CityMayor Games and play the other games developed by ThePCGamer101 and his one-man indie company CityMayor Games <em>(</em>www.citymayorgames.wix.com/home<em>)</em></p>Content Rating :-<p>The developer has provided the following content rating for this item:</p><p><strong>ADULT CONTENT: </strong>Intense Realistic Violence, Sexual Violence, Alcohol Use, Drug Reference, Tobacco Reference, Strong Sexual Themes, Intense Language</p><p><em>Blogger - (C) CityMayor Games</em></p><p><em>twine - (C) Chris Klimas</em></p>Licence :-<p>Game/App EULA</p><p>You may not modify or redistribute this content</p>", "metacritic": null, "released": "2015-05-09", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/d54/d5461af1784423b3a28e4a28c5a6ca35.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 188, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["CityMayor Games"], "genres": [], "publishers": [], "esrb_rating": null}