{"id": 11047, "slug": "heroes-of-soulcraft-arcade-moba", "name": "Heroes of SoulCraft - Arcade MOBA", "name_original": "Heroes of SoulCraft - Arcade MOBA", "description": "Heroes of SoulCraft (HoS) is the best Arcade MOBA. Play a great MOBA in max 5 or 15 minutes on your PC, mobile phone or tablet against each other with mouse, gamepad or mouse/keyboard. <br/><br/>Heroes of SoulCraft (HoS) is an Arcade MOBA in which 2 teams fight against each other in fast-paced, tactical matches full of action and fun.<br/><ul><li>Angels vs. Demons team battles in quick, tactical games full of action and fun<br/></li><li>If you like our previous games SoulCraft 1 &amp; 2 you will love Heroes of SoulCraft<br/></li><li>Play 5 or 15 minutes with instant matchmaking.<br/></li><li>Need to leave the game early? No problem - we will join a new player into the running game.</li></ul><br/>Choose your hero<br/><ul><li>Select one of 12+ heroes: play the melee dwarf \"furious axe\" Grimnor, the range fighter \"loose cannon\" Keely, the mage supporter \"flower princess\" Dalia or many more.</li></ul><br/>Easy to learn<br/><ul><li>Heroes of SoulCraft makes it very easy to learn the basics within a minute. Over time you can choose to do more things manually like skilling or item-buying for the full MOBA experience.</li></ul><br/>Unleash your titan<br/><ul><li>Ever wanted to take a huge fire dragon or a big rock golem into the battle? Now you can! Choose your titan to accompany you and customize your Hero by pre-configuring your item-deck.</li></ul><br/>Heroes of SoulCraft is now available as a first Alpha Version. Download now for free on Android or Windows and help us improve the game by giving us feedback in the forums.", "metacritic": null, "released": "2015-07-20", "tba": false, "updated": "2019-09-17T09:52:49", "background_image": "https://media.rawg.io/media/screenshots/bf7/bf76b85d5b60a83b8d899014c7a2f013.jpg", "website": "http://hosgame.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 268}, "playtime": 1, "achievements_count": 17, "ratings_count": 2, "suggestions_count": 338, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["MobileBits"], "genres": ["Action", "RPG", "Strategy", "Casual", "Indie"], "publishers": ["MobileBits"], "esrb_rating": null}