{"id": 110692, "slug": "10000-dragons-flash-version", "name": "10,000 Dragons Flash Version", "name_original": "10,000 Dragons Flash Version", "description": "10,000 Dragons Web Demo<br/><p><em>NOTE: You will likely need to zoom your browser window out to see the whole game screen.</em><br/></p><p>Inspired by games like Legend of Zelda and Diablo II, this desktop action RPG draws its themes and story from a mixture of Japanese folklore and Norse mythology. The game is in early development right now.</p><p>This is a shortened version of the full demo of the game. We had to trim it down quite a bit to get it to run on flash, and it still has some minor performance issues, but it will give you sense of the game's style and themes. (If you want to play the final scene in the demo, you'll need to download the full version.)</p><p>Find the full version here: https://crovaxus17.itch.io/10000-dragons<br/></p>Let us know what you think in the comments.<p>Happy Gaming!</p><p>- The E Bros Team</p>Lore<em>Henceforth do I swear upon my soul:<br/>I am no more a man of my own will,<br/>But am become a blade in my lord's hand;<br/>And sure as I seek freedom from this world,<br/>I pledge my blood to defend and to serve;<br/>To watch upon his walls, to guard his keep,<br/>To stand between his people and the Dark,<br/>Though fire and flood and terrors of the night<br/>Assail us—still my sword shall bravely sing.<br/>The Sen-Shî knows no fear, but would face<br/>Ten thousand dragons to defend the realm.<br/>Until Death take me, this do I avow.<br/></em><p>- Oath of the Sen-Shî</p><p>Long ago, before the very oldest annals of history recall, mankind lived at peace, knowing not the arts of war and magic. </p><p>Until the Giants came.</p><p>Sailing across Endless Sea, the Kyo-Jîn, as they are called in the ancient tongues of men, quickly conquered all the land of Skai and enslaved the people.<br/><br/>It is not known how long the Kyo-Jîn Empire reigned, for no written records survive. But it is known that 7,000 years ago, the slaves rebelled. As the old songs tell it, the legendary hero Raen was the first Sen-Shî, and it was he who first taught men the arts of war. With bitter struggle, inch by inch they reclaimed the lands of Skai and freed the people.</p><p>But the Kyo-Jîn Emperor, Akum the Cruel, would not yield. According to legend, he commanded an army of 10,000 dragons, enslaved by Shadow Magic. None could stand against him; all seemed lost. It was in this final hour that Raen and his Sen-Shî made their stand.<br/></p><p>On the fields of Unmei, they met the mighty Kyo-Jîn King and faced his hoard, 100 men against 10,000 Dragons. And by grace of the Kai, they did not fail. The blades of Raen and his band sang true, and one by one the cursèd beasts of Akum fell.<br/></p><p>When the sun set on the field of battle, not one dragon stirred. But Raen had received a mortal wound, and only seven of his Sen-Shî had survived the fighting. He died at sunrise and was buried on the field of victory. The seven Sen-Shî who remained went on to lead the people; in time, they would found the Seven Schools of the Sword.<br/></p><p>And so the war was won. The Giants were massacred, their cities razed to the ground. The Kyo-Jîn that survived fled to the frozen mountains of the North, or took to their ships across the Sea.</p><p>But victory comes always at a price. The Shadow Magic of the Kyo-Jîn, used mercilessly by both sides in the conflict, corrupts the Earth Spirits. Thus, the war had shattered the land. Many of the Spirits fled the world of Skai, it is said, and founded a new and purer realm across the sea. But others stayed, and some were twisted out of recognition. </p><p>So the Demons were born.</p><p>The race of men found themselves freed into a world of darkness. The wilds, once peaceful and full of life, now played host to monsters and evil spirits.</p><p>After a chaotic period of fighting amongst themselves, the people eventually seized the ruined remnants of the Kyo-Jîn dominion and divided the land into small kingdoms and fiefdoms. The strongest and luckiest became chieftains, while those less fortunate labored to sustain the warrior class. The Sen-Shî, guardians of the sacred legacy of Raen, upon whom the safety of the people depended in this brave new world, became feared for their power.<br/><br/>The chieftains met at Koromai, which would become a great city, and signed the Covenant of Koromai. The Covenant abolished the practice of Shadow Magic and bound the powerful Sen-Shî by sacred oath to obey their lords.<br/><br/>Now, you are a mighty Sen-Shî, cast out by your lord. Without a master, you are Ronin, a lost warrior, feared and mistrusted. What new future will you forge?</p>", "metacritic": null, "released": "2016-09-16", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/a73/a73db27985960b127ab10020c08b077f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 21, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["E Bros Entertainment"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}