{"id": 110657, "slug": "helleton", "name": "Helleton", "name_original": "Helleton", "description": "<p>Demo Day 12 is here!</p><p>XInput gamepad supported (I have not done a lot of testing with it).</p><p>Controls are arrow keys, Z, and X for keyboard. DPad and face buttons for gamepad. Sub weapon is up+attack.</p><p>This game uses placeholders from Castlevania and Castlevania II: Simon's Quest. All placeholder assets belong to Konami. This game is not affiliated with Konami in any way.</p><p>Thanks to AGDG for support and VampireDev for the player's base sprite.</p><p><strong>Current Version Changelog</strong></p><p>Demo Day 12</p><ul><li>Second stage complete along with boss and music</li><li>Bug fixes</li><li>Sprite work</li><li>Stairs feel more fluid</li><li>Pause menu</li><li>Main menu</li><li>Options menu</li><li>Crappy scanline shader</li><li>.ini handling to save options</li><li>Continue option</li><li>Attack speed increased a little to feel more snappy</li><li>Music touched up a little (mostly bass reducing due to old bad headphones)</li><li>Credits</li><li>Others that I am probably forgetting</li></ul><p>Known issues<br/></p><ul><li>Possible to fall through the wall on the climbing area of the second stage. I have been unable to reproduce this. However it is not game breaking since you will just die and respawn in the same room. Still working on a fix</li><li>Cannot attack on stairs while holding up, since that is reserved for sub weapon functionality. I did not have time to implement sub weapons on stairs however so the attack will simply not happen. To attack while moving up, hold one of the side directions rather than up.</li><li>Minor graphical glitches in full screen.</li><li>Game speed is dependent on framerate (I am so sorry).</li><li>VSync can cause the game to lock at 30fps which will half the speed. Also recording software can sometimes half the framerate for no discernible reason. Am looking into.</li><li>Walking towards the edge of a staircase that has no end (like the start of a room where you are on stairs) causes stuttering. Does not affect gameplay (I think).</li><li>Bats can sometimes spawn during the first boss before the half health point. Reported to me, but am unable to reproduce.</li><li>First boss still has the placeholder sprite for the death animation.</li><li>Door sprite is too tall.</li><li>Boss 2 projectile colors can blend into the background or be mistaken for magic orbs.</li><li>Many placeholders remain.</li></ul><p><strong>Older Version Changelog</strong></p><p>Demo Day 11 Hotfix 2</p><ul><li>Fixed bug where landing while attacking and jumping before the animation finished freezes the player.</li><li>Fixed bug where attacking the same frame as moving on the stairs freezes the player.</li><li>Shortened the intro by a single second because I am impatient.</li></ul><p>Demo Day 11 Hotfix 1</p><ul><li>Fixed issue of being knocked outside the level forcing a restart</li><li>Added kill floors in case of incidents where a hole in the level may be found. Will result in death rather than a forced restart.</li><li>Made the boss's weakspot more clear since the placeholder art was not.</li><li>Fixed instances of being placed halfway into a tile if knocked upwards into it.</li></ul><p>Demo Day 11</p><ul><li>First playable version.</li></ul>", "metacritic": null, "released": "2016-11-10", "tba": false, "updated": "2019-08-23T11:31:37", "background_image": "https://media.rawg.io/media/screenshots/adf/adf030864c2b7d638367c2b530d41a50.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 133, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MuscularHair"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}