{"id": 110719, "slug": "bounce-itch", "name": "Bounce (itch)", "name_original": "Bounce (itch)", "description": "<p>- Elève Premium de Gamecodeur : Oui depuis février</p><p>- Langage et Framework utilisé: C# Monogame<br/></p><p>- Code / Graphismes / Musique et sons : J'ai codé la base du jeu en m'aidant des ateliers de David. J'ai réalisé les graphismes avec Pyxel Edit et Krita. Les musiques proviennent de la chaine Youtube \"NoCopyrightSounds\".</p><p>- Utilisation de librairies et codes externes : TiledSharp</p><p>- Temps passé : Je ne peux pas dire exactement le nombre d'heures mais depuis 3 semaines j'ai passé chaque jour du temps à coder, me documenter et à débugger !</p><p>- Comment as-tu (ou pas) abordé la contrainte du thème : Je voulais au départ trouver quelque chose qui soit fun et rapide à jouer en ciblant un youtuber. Mais voilà, le temps à passé vite et j'ai dû faire au mieux pour finir dans les temps. </p><p>- Petit postmortem (avis sur le langage/framework utilisés, difficultés, succès, choix, bilan personnel rapide, etc...)</p><p>C'est mon 1er jeu en C# Monogame donc des difficultés au départ et j'ai passé du temps à essayer de comprendre la programmation objet. Au final je ne l'ai pas utiliser pour faire simple. Sinon excellent langage, Visual Studio c'est le top, je ne regrette pas d'avoir persévéré.</p><p>Concernant mon jeu, le but est simple, il suffit de cliquer sur l'écran pour indiquer l'endroit où la balle doit rebondir sans qu'elle ne touche un piège. Puisqu'elle rebondi sur toutes les parois elle peut parfois rester bloquée et il faudra lui indiquer une autre cible. <br/></p>", "metacritic": null, "released": "2017-04-21", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/b55/b55ed515436a5975a7d7f7a479211a59.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 27, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Fab08"], "genres": ["Action"], "publishers": [], "esrb_rating": null}