{"id": 110713, "slug": "el-camino-de-kioni", "name": "El camino de Kioni", "name_original": "El camino de Kioni", "description": "DESCRIPCIÓN\n<p>Kioni es una niña de 8 años, que vive con su familia en  una zona rural de Kenia. Hoy, deberá recorrer 15 kilómetros de trayecto para lograr su sueño, ser ingeniera informática. Las altas temperaturas de la sabana africana y un sinfín de riesgos como el ataque de los temidos elefantes, harán que Kioni tenga que<strong> gestionar el agua y sus niveles de hidratación, así como  resolver puzzles y enfrentarse a los diferentes peligros</strong> que la acechan en el camino.<br/></p>\n\r\nHISTORIA\r\n\n<p>La vida de Kioni transcurre ayudando a su familia atrabajar las tierras y en las duras tareas del hogar. <strong>Cadadía sueña con ser ingeniera informática como su referente, Dorcas Muthoni</strong> (Muthoni (1979) es una ingeniera y emprendedora keniata, fundadora de la organización AfChix. Desde el año 2004, ha facilitado las carreras de computación y la formación continua a mujeres y niñas, convirtiéndose en un modelo a seguir).</p>\n<p>El Camino de Kioni, nos pone en el lugar de una niña <strong>fuerte, valiente, decidida, </strong>con capacidad de tomar decisiones y resolver conflictos adultos a pesar de su corta edad. Una niña que <strong>se enfrenta a sus miedos</strong> y obstáculos reales, en un entorno donde situaciones cotidianas se convierten en verdaderos actos de <strong>heroicidad.</strong><br/></p>", "metacritic": null, "released": "2018-06-01", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/f26/f267e64b1a280a22164c1a4733fddcae.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 142, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["elcaminodekioni"], "genres": ["Adventure", "Educational"], "publishers": [], "esrb_rating": null}