{"id": 110862, "slug": "apoptosis", "name": "Apoptosis", "name_original": "Apoptosis", "description": "<p>Apoptosis is a short narrative experience that explores the effect of a grave illness on the relationship between two people. Sickness does not only affect the sick and we wanted to explore the feelings of someone close to the diseased, and especially the unspeakable ones in those situations.</p><p>The player's objective is to expand the illness on an organ. We chose this particular position because we wanted to provoke a feeling of uneasiness in order to attain empathy for the characters. The narrative progresses as the disease expands and thus the player feels trapped between wanting to know what comes next and witnessing the effect of his actions.</p><p>We chose to have one of the most simple interaction possible (a mouse click) to emphasize this \"uneasiness\". The question the game asks to the player is whether he wants to continue or not, without proposing any alternative solution. Even though the expansion of the disease can be graphically pleasant to watch, the interaction has to be practically uninteresting in order to have meaning. It had to be the opposite of fun. </p><p>We didn't conceive the game with a specific target audience in mind. This game is a school project we made in 3 months during our first year at Enjmin (France) and we were told not to think about a target and just create something that would touch us. We had total freedom and went for it.</p><p>The game uses a custom made engine developed specifically for the game. It uses voxels (marching cubes) and cellular automata to attain this special organic feel we wanted for the disease. We did try to implement marching cubes in Unity first but it wasn't fast enough to support per-frame automaton updating.</p><p><strong>The Team</strong> (all French):<br/>Lucien Catonnet (@LucienCatonnet) – Programmer<br/>Gaspard Morel (@SoundingG) – Sound Design and music<br/>Marjolaine Paz (@Linheha) – Artistic direction<br/>François Rizzo (@Cuv_8) – Game Design and narration</p><p><strong>Special thanks</strong>:<br/>Alice Kudlak - French voice actress<br/>Marie Short - English voice actress</p>", "metacritic": null, "released": "2015-07-14", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/dfa/dfa5180a40367b7e0af7fd6ab8a30a5d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 70, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Lucien Catonnet", "Linheha"], "genres": [], "publishers": [], "esrb_rating": null}