{"id": 110806, "slug": "overclocked-itch", "name": "Overclocked (itch)", "name_original": "Overclocked (itch)", "description": "<p>Super Meat Boy meets Mega Man in <strong>Overclocked</strong>, a free-flowing action-platformer that mixes combat and fluid movement. Overclocked follows Amber, a glass-cannon vigilante who is fighting to protect her home from an enigmatic computer virus that is causing people to lose control of their bodies and minds. As tension mounts and new villains capitalize on the chaos, Amber must rely on her strength and her friends to protect her home.</p>\n<p>In Overclocked, one hit means death. Gameplay is divided into short levels that constantly throw new obstacles at the player. In order to survive, you must learn to constantly adapt to these challenges. To thrive, you must master the controls and your ability to fight.</p>\n<p>Thanks for getting us Greenlit!</p>\r\nDemo\r\n\r\n<p>This public alpha provides access to the first two Episodes of the full game ahead of it's release. In this demo, you can expect to find:</p>\n<p>* 20 unique levels spanning five locales</p>\n<p>* 3 challenge levels for those seeking the ultimate skill test</p>\n<p>* A gripping introduction to a story that will span the entire game</p>\n<p>* Somewhere between 30 to 120 minutes of gameplay, depending on your skill level</p>\r\nFeedback\r\n\r\n<p>We hope you enjoy this preview of Overclocked! We'd love to hear any and all feedback that you have for us. Your support will help make the final game even better.<br/></p>\n<p>If you're interested in following this game's development, make sure to follow us on Twitter or Tumblr! We update frequently with sneak previews of our progress on the game.</p>", "metacritic": null, "released": "2017-03-03", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/932/932064f5aaf1be989a203658fa70129c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 106, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Magnesium Ninja"], "genres": ["Action"], "publishers": [], "esrb_rating": null}