{"id": 110898, "slug": "celerity", "name": "Celerity (itch)", "name_original": "Celerity (itch)", "description": "Celerity\r\n\r\nPitch :   \r\n \r\n\r\n<p>You're playing Orsha, waking up in a futuristic complex. On your way to escape, you find a strange gun that allows you to teleport yourself.<br/><br/>Will you find out a way to the exit through the complex with the gun ?<br/></p>\n\n<p>\n<br/></p>\n<p>Vous contrôlez Orsha qui se réveille dans un complexe scientifique. En tentant de vous enfuir, vous trouverez une étrange arme vous permettant de vous téléporter.\r\n  </p>\n<p>Réussirez-vous à aider Orsha à quitter ce complexe grâce à cette arme ?  \r\n</p>\n\r\nScenario :\r\n\n<p>You're waking up in the Pulse Legacy complex, a strange place where new technologies are being made. While your fate seemed reduced to  a laboratory rat, a technical malfunction occurs, and allows you to escape. In your way out, you find the Looper, a gun that seems to ignore some physical laws and allows you to teleport and triggers remotely objects.<br/>Armed of this new tool, it's your chance to escape the gigantic underground building in perdition, before you're trapped.<br/><br/>The story starts way far under the ground, at the -240th floor of Pulse Legacy. Through the levels, the player will evolve in several distinct poles within the complex.<br/></p>\n\n\n<p>Vous vous réveillez dans un étrange complexe futuriste. Alors que votre sort semblait réduit à celui d’un rat de laboratoire, une défaillance technique survient et vous donne une chance de vous échapper. Peu après, vous trouverez une étrange arme qui semble ignorer certaines lois de la physique et vous rend capable de vous téléporter. Armé de ce nouvel outil, c’est à vous de vous échapper de ce bâtiment gigantesque avant que vous vous y retrouviez piégé. </p>\n<p>L’aventure débute alors sous la terre, au niveau -240 du complexe souterrain de Pulse Legacy, une société de recherches technologiques futuristes. Au fil des niveaux, le joueur évoluera dans plusieurs pôles distincts au sein du bâtiment.</p>\n\r\nControls : \r\n\n\n\n\n\r\nComplimentary informations :\r\n\n<p>Celerity has been entirely developed in a single month by 7 students  in their first year of the Video Game Section , part of the Aries Lyon School.</p>\n<p>If you liked the game, or have question to ask the Team, don't hesitate to let your feedback on the commentary section of this page !<br/><br/>And YES, we're planning to update  Celerity and add more content !<br/></p>\n\n\n<p>Celerity a été intégralement développé en 1 mois par un groupe de 7 étudiants de 1ère année à l'école Aries Lyon. <br/>Si notre jeu vous a plu, ou si vous avez des questions à poser à l'équipe n'hésitez pas à nous laisser un commentaire sur cette page !</p>\n<p>Et oui, nous avons prévu de continuer a mettre à jour Celerity pour ajouter plus de contenu !<br/></p>", "metacritic": null, "released": "2018-06-15", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/70e/70efa55f2cf6b7458284bb8133fe2b71.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 267, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Akamis"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}