{"id": 11080, "slug": "realms-of-arkania-star-trail", "name": "Realms of Arkania: Star Trail", "name_original": "Realms of Arkania: Star Trail", "description": "The united orc tribes attempted to invade the region of Thorwal, but a group of valiant adventurers thwarted their plans during their previous quest. Now the orcs have regrouped and attacked other, more vulnerable areas – <strong>Lowangen</strong> is occupied and half the <strong>Svellt Valley</strong> lies in ashes. An elf ambassador summons the party to the city of <strong>Kvirasim</strong>. To unite the races of the elves and the dwarves in the struggle against a common enemy, they must recover an artifact known as the <strong>Salamander Stone</strong>.<br/><br/>Yet not all is as simple as it seems: As the party approaches an abandoned dwarven mine that may hold the answers to their questions, someone else makes it clear that not everyone in the country favors a cooperation between the two races.<br/><br/><strong>Star Trail</strong> is a faithful remake of <strong>Realms of Arkania’s</strong> classic sequel. This hardcore RPG features dozens of talents and spells, distinct races and character classes as well as a challenging isometric turn-based combat system. Obey your orders and succeed in your quest to retrieve the Salamander stone – the peace between elves and dwarves depends on it!KEY FEATURES:<ul><li>Hardcore RPG with isometric turn-based tactical fights<br/></li><li>Hand-crafted cities and dungeons to explore in first person view<br/></li><li>Master dozens  of talents including fighting and magical skills<br/></li><li>Meet countless endearing characters within the lovingly detailed cities and villages<br/></li><li>Create your characters and manage your party<br/></li><li>Plan your extensive  travels through the realm in detail<br/></li><li>Based on the TDE ruleset as a hybrid between v3 and v4</li></ul>", "metacritic": null, "released": "2016-11-11", "tba": false, "updated": "2019-09-17T12:02:03", "background_image": "https://media.rawg.io/media/screenshots/e66/e660925ca626f9ffe5f0366771189258.jpg", "website": "http://www.sternenschweif.com/", "rating": 1.57, "rating_top": 1, "added_by_status": {"yet": 22, "owned": 188, "beaten": 1, "toplay": 4, "dropped": 1}, "playtime": 6, "achievements_count": 89, "ratings_count": 7, "suggestions_count": 454, "game_series_count": 0, "reviews_count": 7, "platforms": ["PC", "PlayStation 4", "Linux", "macOS"], "developers": ["United Independent Entertainment", "Crafty Studios"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["United Independent Entertainment"], "esrb_rating": "Teen"}