{"id": 110968, "slug": "colorfall-second-demo", "name": "ColorFall (Second Demo)", "name_original": "ColorFall (Second Demo)", "description": "<p>This is the second demo release of <strong>ColorFall</strong>. In this simple but addictive game, you control the 'square wheel' in the center of the screen. </p><p>Not much has changed since the first demo actually, mostly tweaking the UI and other minor stuff. I did addd acouple of things (still WIP though): bigger balls that give more points if caught but occupy more space if dropped, and a basic combo meter (though for now it doesn't effect the score and is only visual).</p><p>As you can see, each corner of the 'square wheel' has a different color. You will have to <strong>spin the wheel</strong> so that the color of the corner matches that of the ball that's falling down from the top of the screen. If you do match the color, the ball will disppear. If you don't,  the ball will fall down to the pit at the bottom. As the game goes on, <strong>if too many balls fall to the pit, you will lose.</strong> </p><p>In this demo there are three modes:</p><p>- <strong>ColorFall</strong>: It's kind of an introduction to the game. 4 colors so the objective is to rack up as many points as possible and of course avoid the game over. I will expand this mode in the future with more and different levels and objectives.</p><p>- <strong>RainBow</strong>: This mode, as the name implies, is more color-full. Both the wheel and the falling balls have EIGHT colors instead of the regular four. It's almost impossible to land combos in this mode (I'm still tweaking the level of difficulty).</p><p>- <strong>DoubleDrop</strong>: Four colors, but TWO different positions from where the balls fall down, one on the right and one on the left. Balls will fall alternatively from one and then from the other (no RNG here). I might change this mode adding a third drop point and randomizing them but I'm still not sure.</p><p>To control the spinning wheel, touch the left side of the screen to make it spin counter-clockwise, and right to make it spin clockwise. In the PC version, you control the wheel with the W/A and S/D keys, or by clicking the left and right sides of the screen (though this last control scheme is more for testing touch controls and not suited for the PC version).</p><p> <br/></p>", "metacritic": null, "released": "2016-03-03", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/a1b/a1b884704b21944097ce7ed4e89004f4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 36, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Android"], "developers": ["SquareDev"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}