{"id": 11092, "slug": "rogue-singularity", "name": "Rogue Singularity", "name_original": "Rogue Singularity", "description": "<p>Rogue Singularity is a high-speed infinite obstacle course.<br />\nNavigate the perils at the edge of a rogue singularity as it tears worlds apart.<br />\nCustomise your robot and face infinite challenges, fighting to survive. Traverse universes to discover what lies beyond the void.<br />\nSurvive on the wreckage of worlds and prove yourself in this precision platformer for PC, Mac and Linux.<br />\nRogue Singularity is a third person precision platformer ideal for speedrunning.<br />\nThe hazards of space and the singularity are many and ever-present, as you race to the end of each level in the fastest time possible.Take on the expanses of space alone, or race the ghosts of the best players in the world.<br />\nNo level will be the same twice - each location in Rogue Singularity is procedurally generated for ­infinite replayability. Attain mastery and your name could be on the top of every leaderboard - your name will take pride of place at the start of every new level you complete. Your achievement will unlock the level for the online community1<br />\nRogue Singularity Weekly Challenges give you one chance to finish the level and top the leaderboard. Are you the fastest robot survivor?<br />\nCustomise your robot, and challenge your dexterity by traversing through a rogue singularity as it tears everything apart<br />\nPrecision 3D platforming, refined to give you perfect control<br />\nProcedural generation: every level is unique, every run of the game is different<br />\nInside Rogue Singularity’s Black Hole you will discover new levels to complete that are unique to your playthrough. Make your mark as a trailblazer, and share your discoveries with the community! (Being developed during the Early Access period)<br />\nA chiptune electronic hybrid soundtrack composed by Derris-Kharlan (Time Surfer)<br />\nCustomisable and unlockable characters, weekly challenges, speed run ghosts, and fastest time leaderboards to challenge your friends and the whole Early Access community!</p>", "metacritic": null, "released": "2016-10-19", "tba": false, "updated": "2019-11-19T18:42:27", "background_image": "https://media.rawg.io/media/screenshots/fdd/fdd7113236dc62ec84eaf532978ede9e.jpg", "website": "http://www.roguesingularity.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 4, "toplay": 2}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 248, "game_series_count": 0, "reviews_count": 0, "platforms": ["Nintendo Switch", "PC", "macOS", "Linux"], "developers": ["Considerable Content"], "genres": ["Action", "Indie"], "publishers": ["Nnooo", "Considerable Content"], "esrb_rating": "Everyone 10+"}