{"id": 111016, "slug": "dash-mob", "name": "Dash Mob", "name_original": "Dash Mob", "description": "<p>Dash Mob is a local multiplayer dash arena where you score points by dashing into your enemies.</p><p>Be careful though, dashing at the wrong time causes you to be vulnerable. Dashing into someone who is also dashing will bounce both of you around.</p><p>Dash mob has 8 game modes and team options for each!</p>Currently supports the following controllers:<ul><li>Xbox 360, Xbox One controllers on Windows.</li><li>Xbox 360, PS4, PS3 controllers on Mac.</li><li>Keyboard (Left/Right to Move, Z to Jump, X to Dash) on all platforms.</li></ul><p>Requires Adobe Air on Mac/Linux.</p><p>Tell me what you think: iopred (at) gmail.com<br/>Sometimes I stream development at: http://www.twitch.tv/turncalliope</p><p>Update 5/27/2015</p><ul><li>Added Bots: They are completely random, but are enough to have some fun.</li></ul><p>Update 5/22/2015</p><ul><li>Respawn points can be affected by gravity, so they can be placed above destructable blocks.</li><li>Destructable blocks now spawn particles when broken.</li><li>Added the ability to flip position when wrapping.</li><li>Changed the way tile collisions are done, they are now much more accurate and won't miss collisions with destructable blocks or lava.</li><li>Added new map: Slava [Normal, Football].</li><li>Added new map: The Wave [Normal, Football] (Thanks beanu!).</li></ul>Update 5/21/2015<ul><li>Added destructable blocks.</li><li>Added new tiles.</li><li>Added new map: Rockslide [Normal, Football].</li><li>Adden new map: Gridge [Normal, Football].</li></ul><p>Update 5/19/2015</p><ul><li>Updated some rendering code to support tile variations.</li><li>All maps updated with subtle scattered rocks.</li></ul>Update 5/19/2015<ul><li>Added a small arrow below each player at the start of the game so you can find your player easier.</li><li>Player respawn arrow is more visible now.</li><li>Respawns in Football Mode are faster (same as King of the Hill).</li><li>Football Mode and King of the Hill mode respawn locations are randomized instead of using the furthest distance from the players.</li></ul>Update 5/18/201<ul><li>Rules text for the current mode appears at the start of the game.</li><li>Football and King of the Hill Modes now show scores as seconds instead of frames.</li></ul>Update 5/17/2015<ul><li>Fixed a bug with the scoring screen on Stockwave Mode.</li><li>Added application icon.</li></ul><p>Update 5/14/2015<br/></p><ul><li>Added Stockwave Mode - A mix of stock and wave mode (similar to Gang Beasts scoring).</li><li>Updated most of the maps for balance and flow.</li><li>Removed Football Mode from maps that wrapped in both directions.</li><li>Outside-of-screen arrow now shows when you leave the screen horizontally.</li><li>Added a grass tile.</li><li>Started a Single Player mode, only has a temporary map at the moment.</li><li>Removed Small and Cardiac maps.</li></ul>Update 5/7/2015<ul><li>Added new map: Petri [Normal, Football].</li><li>If you hold the ball in Football Mode, you can no longer dash and only have 2 jumps.</li><li>Gatherer Mode kill detection radius is now twice as large. This means if you kill mobs around your zone you get the same bonus as if you were inside it.</li><li>A small arrow will appear when you respawn to direct your eye to your new location.</li><li>A small arrow will appear when you are above the screen in Final Destination to show your position and height.</li><li>Respawns are instantaneous during King of the Hill Mode.</li><li>Map selection now filters Football Mode maps correctly.</li><li>Fixed a bug where the pause menu caused the screen to turn white.</li></ul>Update 5/6/2015<ul><li>Added Football Mode - Score points while you hold the football. If you kill the mob holding the football you will grab it from them.</li><li>Gatherer Mode is a little faster - Killing an enemy while in your controlled zone adds time. Being killed while in your controlled zone removes time. If you kill a zone controller and the timer is reduced to 0, you instantly gain control of the zone.</li></ul>", "metacritic": null, "released": "2014-12-29", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/8bd/8bdd438cc38fd678db4a07c503f395a6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 124, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["iopred"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}