{"id": 11101, "slug": "spacetours-vr-ep1-the-solar-system", "name": "Spacetours VR - Ep1 The Solar System", "name_original": "Spacetours VR - Ep1 The Solar System", "description": "Indulge in our fully hipster-style compatible travel pod, taking you to your favoured destinations in the blink of an eye. Our ambition as the galaxies finest travel agency is to provide you with the experiences YOU want to see, so the path of your journey can be shaped by your desires. SPACETOURS VR also offers an -optional- entertainment program at various locations, included in this package. <br/><br/>As companions during your stay, the mechanical pioneers of the respective planets have been fully restored and relaunched. Earth orbit for example offers the largest space station men have ever build, known in history books as the \"International Space Station\", equipped with several vista spots conveniently accessible from your base platform. In the unlikely event of a troublesome encounter with Deimos, your beam can also be used to call in armed support. Please be aware that SPACETOURS VR does not cover any damage caused by customers on their travels. <br/><br/>So leave the world outside behind and join SPACETOURS VR right now!<br/><br/>Included features of package EP1 The Solar System:<br/><br/><ul><li>Interactive lobby with amenities<br/>Lights, sound, music and exploding logo. What more can you expect? Ah yes and don't sit on the chairs.</li></ul><ul><li>Luxurious travel capsule<br/>Your retractable shell offers shelter from the empty space for the light-hearted, and of course - travel in style.</li></ul><ul><li>Lower Earth Orbit<br/>Check out the first man-made object in space SPUTNIK and see the amazing vista points around the ISS.</li></ul><ul><li>Mars<br/>Meet MAVEN, one of the top photographers when it comes to Mars. Avoid DEIMOS, the unstable moon of Mars. If you can't, well you read about armed support earlier didn't you?</li></ul><ul><li>Saturn<br/>Nobody does Saturn like CASSINI-HUYGENS does. For the ultimate dust-ring-sparkle-action, just point your beam at her.</li></ul><ul><li>Jupiter<br/>Don't miss out on Jupiter with all the moons around. (He's on the right.)</li></ul><ul><li>Mercury<br/>You thought the Caribbean was the ultimate place to worship the sun? Wait till you've been on mercury! A sunscreen with UV-factor not less then 7e³ is highly recommended.</li></ul><ul><li>Venus<br/>That's not the Venus I know! See what's really under Venus' cloudy cloths - MAGELLAN is the man.</li></ul><ul><li>Neptune<br/>Wait what?! NEW HORIZONS on Neptune?! Well, where else can you go when your home got revoked planetary status.</li></ul><ul><li>Uranus<br/>[ˈju(ə)rənəs] is how it is pronounced.</li></ul><br/>*destinations sorted by visitor popularity.", "metacritic": null, "released": "2017-03-08", "tba": false, "updated": "2019-08-28T22:14:04", "background_image": "https://media.rawg.io/media/screenshots/1f7/1f7b2192fe4605a1c78b952220e5c203.jpg", "website": "http://www.spacetoursvr.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 268, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Vibrant Visuals - Christian Klötzel"], "genres": ["Adventure", "Simulation", "Casual", "Indie"], "publishers": ["Vibrant Visuals - Christian Klötzel"], "esrb_rating": null}