{"id": 11104, "slug": "doodle-mafia", "name": "Doodle Mafia", "name_original": "Doodle Mafia", "description": "Doodle Mafia is the biggest “Doodle” game ever!<br />\nOver 500 puzzles to solve and items to create as you play the role of Crime Boss or Cop. You decide how you want to play as you play through multiple hard-nosed storylines &amp; play modes.<br />\nAs you build your Gang and make your fortune you must evade the Cops as well as fight off rival games in order to become the “Big Boss” of the City. In the “City” mode watch your Crime City come alive as you successfully pull off heists, escape the Cops or beat-off rival gangs. But you gotta watch your back because behind every corner there is a good Cop trying to make a name for himself or a rival Gangster trying to take your turf!<br />\nIn the “Campaign” mode, nab the bad guys or pull off heists to build your fortune. Can you successfully rob the bank and escape the Cops? Are you tough enough to defeat the rival boss and be the Crime Big Boss of the City? We shall see how good you are…&quot;<br />\nRemember: Crime Does Pay!<br />\nThe biggest “Doodle” game ever!<br />\nOVER 500 Puzzles to Solve &amp; Items to Create.<br />\nPlay as a Gangers or Cop.<br />\nWatch your Crime City come alive as you play.<br />\nMultiple Game Modes and Storylines to play through.<br />\nAvailable in 6 languages: English, German, French, Russian, Chinese &amp; Portuguese.</p>", "metacritic": null, "released": "2016-06-22", "tba": false, "updated": "2023-08-16T20:58:22", "background_image": "https://media.rawg.io/media/screenshots/c32/c32ee25215396a9836f53b0267eb1916.jpg", "website": "http://doodlegod.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 93, "beaten": 3, "toplay": 1}, "playtime": 4, "achievements_count": 14, "ratings_count": 4, "suggestions_count": 186, "game_series_count": 8, "reviews_count": 4, "platforms": ["iOS", "PC", "macOS", "Linux", "Android"], "developers": ["JoyBits"], "genres": ["Simulation", "Board Games", "Casual", "Indie", "Puzzle"], "publishers": ["JoyBits Co", "JoyBits"], "esrb_rating": null}