{"id": 111039, "slug": "catch-that-kid-gm48-17", "name": "Catch That Kid! (GM48 #17)", "name_original": "Catch That Kid! (GM48 #17)", "description": "<p>Mom is taking her time with a conversation in the check-out line...</p>Let's fill the cart with toys!<p>Sneak around, grab loot, and fill your mother's grocery cart with it. Use the other lame and boring stuff to avoid, distract, and hide from the store employees! If they catch you, they'll tell on you. Lame. Can you collect all 7 toys in the store?</p><p>This game was created in 48 hours for the 17th gm48 competition. It won <strong>second place</strong>!</p>Controls<ul><li><strong>Run</strong> using the arrow keys / WASD keys / left analog stick</li><li><strong>Sneak</strong> by holding the shift key / B button</li><li><strong>I</strong><strong>nteract</strong> with items by approaching them and holding the spacebar / A button</li><li>Play at fullscreen with F4 or press Escape to quit</li></ul>Tips &amp; TricksGeneral<ul><li>Keep an eye on the timer! Make sure you **and** the cart are back near Mom when she's done talking!</li><li>Running is awfully loud! Remember to sneak when you can. It helps.</li></ul>Employees<ul><li>If an employee doesn't see you enter a cart, they won't know you're in there... Unless they bump in to you by accident.</li><li>Employees only look right in front of themselves, but they'll turn to look at something if it makes enough noise.</li><li>If an employee starts chasing you, try to lose them around corners. If they can't find you, they'll stop chasing you.</li></ul>Toys &amp; Items<ul><li>Throw toys you've found into Mom's cart for safe keeping. After all, they're worth points.</li><li>Toys are heavy. You can't run and make a lot of noise while carrying them.</li><li>You don't have to collect every toy to win, but you do if you want to get the highest score and start playing for fastest time!</li><li>Those small cans make for great distractions. Just pick them up and throw them!</li></ul>Carts<ul><li>You can scoot a cart along while you're inside, but only along the axis the cart is facing. Hopping in to a cart will also carry some momentum.</li><li>Mom's cart can be moved just like every other cart in the</li></ul>Credits<p>Programming by<br/>Vinnie_V</p><p>Graphics by<br/>BaconBoy123</p><p>Music by<br/>Buttons</p>", "metacritic": null, "released": "2016-02-01", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/89a/89aa2ea44a82056c55bb75d154e2ee34.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 75, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["justin"], "genres": ["Action"], "publishers": [], "esrb_rating": null}