{"id": 111137, "slug": "card-odyssey", "name": "Card Odyssey", "name_original": "Card Odyssey", "description": "<p>Card Odyssey is a 54-card based rougelike strategy game. Unlike the normal \"kill monsters, level up and become stronger\" RPGs, Card Odyssey is a game where you need to fight and grow with the monster, and wait until the correct time to kill it.</p>\n<p>Made by Vivi Yu and Shiyun Liu in 2018 TrainJam.</p>\n<p><strong>The option</strong> in Card Odyssey is quite simple: you just need to use mouse to drag the active card up and down to preview the card effect, and release to play it.</p>\n<p><strong>The goal</strong> of the game is to keep yourself and the monster alive until you get the Red Joker card, and then kill the monster at that moment. If you kill the monster too soon, or you die too soon, or you fail to kill the monster at that moment, you lose the game.</p>\n<p>As a solitary game, you need to take care of your status and monster's status at the same time. There will be <strong>four cards</strong> for you to use each round. You <strong>MUST use</strong> them all, but you can choose where the cards go. Generally speaking, if you drag the active card to the monster, it has effect on the monster; if you drag the active card to yourself, it has the effect on you.</p>\n<p>There're several types of card: </p>\n<p><strong>Heart cards</strong>: all heart cards will help to recover the health</p>\n<p><strong>Spade cards</strong>: some of the spade cards are attack card, when you drag to monster, you will attack monster, otherwise it means monster attack you. Some of the spade cards are disaster cards, they do damage to both you and the monster.</p>\n<p><strong>Club cards: </strong>some of the club cards are shield cards, you can drag to equip the shield. The newly equipped shield will replace the existing one. Some of the spade cards are switch shield card, which means if you use them, you need to switch shield with the monster.</p>\n<p><strong>Diamond cards: </strong>some of the diamond cards are weapon cards, you can drag to equip the weapon, just like the shield cards. Some of the diamond cards are switch weapon cards, by using them you need to switch weapons with the monster.</p>\n<p><strong>Joker cards: </strong>both joker cards coercion you and monster to attack with each other. However only when the Red Joker card appears, it's the correct time to kill the monster.</p>\n<p><strong>Attack: </strong>When you use the attack card,  say you drag to monster, it means you try to attack monster with your weapon. At that time, your weapon will attack the shield first, if the monster has shield. <strong>No matter how much value the shield has, it will disappear after undertaking the attack</strong>. However it will reduce the damage to the monster.</p>", "metacritic": null, "released": "2018-03-18", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/cc8/cc8b12784067a49e93b44365ff60cb63.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 19, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["viviyu"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}