{"id": 111187, "slug": "corgi-snow-day", "name": "Corgi Snow Day", "name_original": "Corgi Snow Day", "description": "<p><strong>Corgi Snow Day</strong></p><p>Hang out in your house and stay warm with all the corgis who are wayyyyyyyyyy too short to go out into the deep, deep snow with their tiny little cute adorable stubs.</p><p>*Butttt you can still imagine what they would look like in very cute, ugly XXXXLong sweaters for their weirdo long bodies.</p><p><strong>How to Play!</strong></p><p>* walk around with the arrow keys <br/>* talk to sprites by walking up to them <br/></p><p><strong>Note</strong>: This game has no ending! You can just keep cuddling pups until you are all cuddled out. But really can you ever have enough cuddles? Hint: The answer is no. No, you can't.<br/></p><p><strong>Features!</strong><br/></p><ul><li>Five dogs you can cuddle who are all very cute and smart and cute and cuddly and cute.</li></ul><ul><li>Gratuitous use of the words butt, cutie, cuddle and fluff.</li></ul><ul><li>Hypnotic fire simulation** that will cure your insomnia and simulate the feeling of a puppy cuddle pile.<ul><ul><li>**Imagination or maybe a real fire required.</li></ul></ul></li></ul><ul><li>Happy feelings induced by thoughts of snow days with lots of corgis <ul><ul><li>**If that's your thing.</li></ul></ul></li></ul><ul><li>Knowing that making this game really cheered me up and made me happy** thinking about cuddling dogs. <ul><ul><li>**I really hope it makes you happy too &lt;3</li></ul></ul></li></ul><ul><li>Dogs that definitely speak English. Just be patient. Patience is a feature.</li></ul><p><strong>Have fun cuddling corgis by the fire! Happy Corgi Snow Day!</strong></p><p><strong>ANOTHER VERY IMPORTANT NOTE</strong>: This game was made with Bitsy Game Maker which was made by @adamledoux, who is awesome for making this! It is incredibly easy to use and I highly recommend it to make games that are quick and fun as a nice stress reliever!</p>", "metacritic": null, "released": "2017-01-26", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/251/25123b2b2dae99f3d8b2a65b59da6b95.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 47, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["mutantcassidy"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}