{"id": 11111, "slug": "i-am-weapon-revival", "name": "I am Weapon: Revival", "name_original": "I am Weapon: Revival", "description": "<strong>Have you ever faced your worst nightmare?</strong><br/>What if you cannot wake up from it? What if you have no choice but to move on and see what’s behind it? Then you’d better arm yourself with a couple of big guns, stock up on ammo and show them all what a real nightmare is! <br/><br/>You along with the main character will delve into a strange and frightening world of horror, explore its distant corners, find out how you ended up here and, most importantly, how to get out of this hell. What can save you from this madness? Only your lost memories which you’ll have to put together piece by piece. Whatever’s living in this world is luring you inside. Those creatures who are meant to bring you joy and happiness will only cause death and suffering! The bloody bastards will do whatever it takes to make you stay... And they are not alone in this: it seems the world itself wants to crush and swallow you, with its traps and pitfalls everywhere... Will you dare to sneak inside? Then welcome... But mind you, whatever path you take, there’ll be no mercy! <br/><br/><strong>Main features: </strong><br/>- Mysterious world full of dark secrets <br/>- Hordes of fiendish enemies  <br/>- Wide range of opponents <br/>- Intriguing story <br/>- Big guns... Loads of ‘em! <br/>- Abilities, turrets, drones, swords and axes <br/>- Side quests to suit all tastes<br/>- Exciting battles <br/>- Full gamepad support", "metacritic": null, "released": "2015-10-23", "tba": false, "updated": "2022-10-26T15:02:51", "background_image": "https://media.rawg.io/media/screenshots/2fd/2fdee9666b0fe831e14adff33a916a63.jpg", "website": "", "rating": 2.64, "rating_top": 1, "added_by_status": {"yet": 3, "owned": 176, "beaten": 1, "toplay": 3, "dropped": 1}, "playtime": 4, "achievements_count": 34, "ratings_count": 11, "suggestions_count": 582, "game_series_count": 0, "reviews_count": 11, "platforms": ["PC"], "developers": ["Krealit"], "genres": ["Action", "RPG", "Indie"], "publishers": ["Krealit"], "esrb_rating": null}