{"id": 11112, "slug": "double-action-boogaloo", "name": "Double Action: Boogaloo", "name_original": "Double Action: Boogaloo", "description": "<p>Double Action: Boogaloo is a comedic free-to-play multiplayer shooter developed by Double Action Factory.</p>\n<h3>Gameplay</h3>\n<p>The game features a sophisticated movement system that allows for diving, flipping, and sliding. The game is heavily inspired by the classic action flicks, such as The Matrix, and movies by John Woo.</p>\n<p>Double Action is a third-person shooter which revolves around fast-paced combat and fluid movement, which can be found in Max Payne. Influenced by Max Payne, the game features the bullet time system which slows down the in-game passage of time that helps the players land much more precise shots. </p>\n<p>The objective in the match of the game is to become the most stylish player with the highest number of style points. The style points are awarded for killing enemies while diving, doing flips, attempting slides and attempting such tricks. Slow-motion seconds are also awarded for stylish gameplay.</p>\n<p>The game does not feature objective-driven matches, yet from time to time a special objective may be activated, such as Capture the Briefcase, Kill the Wanted One, Race to the Finish. Should a player complete the special objective, they are allowed to execute a special style move that acts as all the style moves combined. That adds a whole another layer to the gameplay.</p>\n<p>There are nine weapons present in the game: two pistols, several SMGs, a shotgun, two rifles, your own fists, and a grenade. The pistols can be dual-wielded.</p>", "metacritic": null, "released": "2014-10-23", "tba": false, "updated": "2023-12-13T00:51:16", "background_image": "https://media.rawg.io/media/screenshots/9a2/9a2f6de94df289b7bb446af002540818.jpg", "website": "http://doubleactiongame.com/", "rating": 2.99, "rating_top": 4, "added_by_status": {"yet": 66, "owned": 1406, "beaten": 22, "toplay": 3, "dropped": 95, "playing": 2}, "playtime": 1, "achievements_count": 0, "ratings_count": 142, "suggestions_count": 229, "game_series_count": 0, "reviews_count": 142, "platforms": ["PC", "Linux"], "developers": ["Double Action Factory"], "genres": ["Action", "Indie"], "publishers": ["Double Action Factory"], "esrb_rating": null}