{"id": 11113, "slug": "starpoint-gemini-warlords", "name": "Starpoint Gemini Warlords", "name_original": "Starpoint Gemini Warlords", "description": "Control your ship directly to show off your battle prowess. Aim and fire manually or command your gunners to do the job for you while you execute unique skills. Choose your companions to follow you into battle and if you need an extra hand, have your fleets join you in glorious combat. Battles in Warlords can vary from duels and small skirmishes to clashes of massive fleets in planetary orbits.<br/><br/><br/>Construct ships and assemble your mighty war fleets to pitch them against the other war-mongering factions of Gemini, but be mindful of the situation you're sending them into. A seemingly weaker fleet can be accompanied by warmasters, well-trained specialists that can sway the battle in their favor, but fear not, you can have your fleet follow you so you can lead them to victory!<br/><br/><br/>Upgrade your headquarters with additional modules to produce more advanced weapons and enhancements, develop new ships leading up to the station-size Proxima, unlock new structures and activate various bonuses that influence all of your territory. You are the leader of your people and a powerful leader deserves a stronghold.<br/><br/><br/>Spread your influence and increase your resources by expanding your territory, but don't stretch your defenses too thin or your enemies might take advantage. Territory can be fortified and improved by building various resource and defense structures. Expand the T-Gate network to make your fleets travel across your ever-growing empire faster. A timely arrival can make all the difference.<br/><br/><br/>Begin your adventure on a small, agile gunship and work your way up to a massive carrier class capable of deploying numerous fighter wings. Upgrade your chosen vessel of destruction with a plethora of weapons and enhancements. And to finish it all off, throw a coat of paint on it to get that perfect vessel you always wanted.KEY FEATURES:<ul><li>Massive game world, populated by over 60 diverse factions, ready to face your war fleets.<br/></li><li>Campaign mode – Play through the story of the “exiles”, who settled on the barren planet of Phaeneros on the outskirts of Gemini, after escaping the alien invasion of the Sol system.<br/></li><li>Five free roam scenarios with distinct start setup.<br/></li><li>Choose among nearly 90 different ships, from gunships and corvettes to bulky carriers.<br/></li><li>Build your own personal headquarters to boost your economic and military power.<br/></li><li>Procedurally generated freelance jobs offer a great way to earn Credits that you can use to pump upgrades into your ship.<br/></li><li>Procedurally generated encounters can creep up on you when you least expect them.<br/></li><li>Choose one of three unique character classes or whip up a hybrid class of your own.<br/></li><li>Conduct research on a multitude of different tech that affects everything from your own ship to the global scheme of things.<br/></li><li>Construct ships, assemble war fleets and send them in all directions to conquer for the glory of the Solari Concord.<br/></li><li>Build and upgrade infrastructure across the star system to improve resource gathering and strengthen your dominion.<br/></li><li>Engage in diplomatic relations and sign trade deals to get that boost you need.<br/></li><li>Mod support that greatly surpasses that of its predecessor, Starpoint Gemini 2.</li></ul><br/>For more information, check out the official Starpoint Gemini Wiki on Gamepedia.", "metacritic": 74, "released": "2016-04-13", "tba": false, "updated": "2024-04-06T12:03:44", "background_image": "https://media.rawg.io/media/screenshots/6bb/6bb551be86adf1668df4cdc795ee521a.jpg", "website": "http://www.starpointgemini.com", "rating": 2.07, "rating_top": 1, "added_by_status": {"yet": 15, "owned": 277, "toplay": 7, "dropped": 5, "playing": 1}, "playtime": 2, "achievements_count": 100, "ratings_count": 14, "suggestions_count": 579, "game_series_count": 0, "reviews_count": 14, "platforms": ["Xbox One", "PC"], "developers": ["Little Green Men Games"], "genres": ["Action", "RPG", "Strategy", "Simulation"], "publishers": ["Iceberg Interactive"], "esrb_rating": null}