{"id": 11121, "slug": "systemhack", "name": ">//:System.Hack", "name_original": ">//:System.Hack", "description": "The year is 2049. Technology and capitalism have kept plodding forward unabated. Today almost every business in the world is owned by one of five mega-corporations or one of their many subsidiaries. Robotics have streamlined and automated every production industry. The divide between the rich and the poor has turned into a vast expanse, with unemployment rates at an all time high. Why pay a man when a robot can do the job better, faster, and cheaper? <br/>Almost every piece of electronics and machinery from phones, cars, street lights, vending machines, door locks, to entire buildings and businesses are now tied-in and controlled via the internet, which has evolved into The Net. <br/>The Net is a virtual world, layered over and intertwined with our own. Machines known as NetDiver Rigs, allow users to project their consciousness into the Net and control virtual Avatars as if they were their own bodies. The world within the Net isn't bound by the laws of physics, but can be shaped and controlled through constructs and programs. A steel wall blocking your path? In reality it's simply a line of code, and with the right tools and know-how it's easy to re-write a couple lines of code.<br/><br/>&gt;//:System.Hack is a sim-rpg set in a dystopian future. Take the role of a programmer-turned-hacker as they begin their criminal career. While hacking, enter a virtual world, delving the digital dungeons of Systems for wealth and experience. Use the money you earn to upgrade your hardware and software, or possibly pay off some debts...Features<ul><li>You Career, Your Way: Start the game indentured to your sponsor company. Stay with the company and work your way up the ranks, earning perks &amp; bonuses, while being sheltered under their protection. However as an employee you will be paying a steep commission on all money earned, and have to meet daily quotas. Or you can choose to buy-out your contract and go freelance, allowing you to earn more money per job and live your life with no obligations. Once you've gone freelance and banked some serious creds, you could even start your own company and hire other hackers to do the work for you!</li></ul><br/><ul><li>Work Generator: In addition to story jobs and special jobs, players will take regular hacking jobs to earn money and experience. These regular hacking jobs are generated dynamically. You could work forever.</li></ul><br/><ul><li>Open-Ended Character Growth: Software ratings and Skill ratings have no upper limit. The game uses formula based calculations instead of a fixed graph. There are no real limits in the virtual world.</li></ul><br/><ul><li>Semi-Scaled Difficulty: As you grow in skill and power, the regular generated jobs will increase in difficulty in order to always provide a challenge, and the rewards required to fuel higher level growth. Story and special missions will have a static difficulty, which means you could either dominate... or get crushed. If you fail, you can always try again later.</li></ul><br/><ul><li>Epic Level Challenges: The answer to \"why bother getting my character insanely powerful?\". These challenges could add content, story, or maybe alternate endings. I won't spoil it, but I will say the rewards will be for the Player, not for the Character. *Not currently implemented*</li></ul><br/><ul><li>A Branching Story with Alternate Endings: This won't be a \"choose an ending\" type game, but instead the ending(s) will be based off of a series of smaller choices throughout the entire game. *Not fully implemented*</li></ul><br/><ul><li>*NEW*Overwatch: Join a team of mercenaries as the resident hacker, and help them complete dangerous runs. Do legwork, and prep-work beforehand, and then chaperone your team as they infiltrate secure facilities to commit a variety of crimes.</li></ul>", "metacritic": null, "released": "2017-05-11", "tba": false, "updated": "2019-08-28T22:14:03", "background_image": "https://media.rawg.io/media/screenshots/e03/e035e48a4a5f3653206e0fabd2ec28ce.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 295, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Nullray Gaming"], "genres": ["RPG", "Simulation", "Indie"], "publishers": ["Nullray Gaming"], "esrb_rating": null}