{"id": 111289, "slug": "trunk", "name": "Trunk", "name_original": "Trunk", "description": "Inspiration<p>Have you seen that part in Sneakers? Where they remake an abduction by sound? I mean, if you haven't, here you go:https://www.youtube.com/watch?v=KuIheGaiFLM</p>What it does<p>Trunk (tentatively named) is a game for 2 players; the first player plays on a VR headset and is the unfortunate victim in an abduction by unknown assailants. They must contact the other player, an emergency response operator, and work with them to pinpoint their location in a giant procedurally generated city using every tool at their disposal; audio cues from the environment, tools within the trunk, pings from local law enforcement, or visual hints for helicopter dispatches to identify. Time is of the essence though; should the captors drive outside of city limits, it's game over!</p>Key Features<p>We have some things that we're pretty proud of! Hopefully after the jam, we can take some time to discuss how we tackled some of them, but for the time being here's what we hope to be shipping with:</p><ul><li>Procedurally generated city with driving AI</li><li>Puzzles which focus on keen observation and teamwork</li><li>Synchronous networked gameplay, with asymmetric mechanics that encourage teamwork and communication</li></ul><p>Submission for Global Archiact Jam</p>Revisions<p>Version 1.1</p><ul><li>Optimizations on the hostage end to allow for higher framerate</li><li>Fixing bug where EOG wouldn't trigger</li><li>Fixing bug where Pre game -&gt; In game wouldn't unlock operator controls</li><li>Mapping newspapers to an icon</li></ul>", "metacritic": null, "released": "2016-04-25", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/1a6/1a6aa4d353b95df3fc98e56c6258a681.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 115, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Android"], "developers": ["belbeeno"], "genres": [], "publishers": [], "esrb_rating": null}