{"id": 111346, "slug": "they-whisper-softly-to-me-demo", "name": "they whisper softly to me DEMO", "name_original": "they whisper softly to me DEMO", "description": "<p>they whisper softly to me is a horror game in development by Pie On A Plate Productions.  You take upon the persona of an unnamed character, and must transverse the abstract landscape of their unconscious mind in order discover the root of their irrational fear of the dark.</p><p><strong>Controls</strong><br/></p><p><em>WASD</em> - move</p><p><em>Left click</em> - flashlight toggle</p><p><em>M</em> - map</p><p><em>E</em> - interact</p><p><em>Shift</em> - sprint</p><p>Estimated running time: 30-45 minutes</p><p><strong>To install:</strong></p><ol><li>Extract the .exe and data file to the same location. This may take up to a minute or two, depending on your computer speed.</li><li>Run the .exe file. (they whisper softly to me_demo.exe)</li></ol><p><strong>Hardware Requirements(Estimated):</strong><br/></p><p><strong>Minimum:</strong></p><p>i3 processor or 3.0ghz equivalent</p><p>Dedicated graphics card (VRAM 1GB) <em>**If no graphics card, expect ~30fps**</em></p><p>4GB RAM</p><p>1.5GB hard drive space</p><p><strong>Recommended:</strong></p><p>i5 processor or 3.5ghz equivalent</p><p>2GB VRAM or more</p><p>6GB RAM</p><p>1.5GB hard drive space</p><p><em>**Please note that Mac and Linux are not yet supported**</em> </p><p><strong>Final Game Release Date: </strong>October 2017</p><p><strong>KNOWN BUGS:</strong></p><p>-Save lamp does not display \"Save successful\" (It still saves though)</p><p>-Inescapable corner between tree and car in the second \"area\" of the big, outside courtyard level (If you get stuck here, just reload the game and you will appear at your last save lamp)</p><p>-Snow particle effect causing significant lag</p><p>-Current in game settings do little to reduce lag when turned down (In order to get around this, simply relaunch the game, and choose a lower setting on the launch menu rather than from within the game itself)</p><p><strong>Developer's Note</strong></p><p>Because this is a free demo, I only ask that you share your feedback once you have completed it. Please answer things like: \"What did you enjoy?\", \"What did you dislike?\", \"What do you wish was included?\" and so on. Also, while I did my best to rid the game of all the bugs I could, please report any you may have found and what you were doing when it occurred.<br/></p><p>Keep in mind that this is just a demo, and what is shown does not necessarily represent the finished product. Some issues you may encounter are known and all levels are subject to improvement.</p><p>This is my first game, so please be gentle ;) </p><p>Thank you so much for playing, and I hope you enjoy!</p><p>-Pie On A Plate Productions </p><p>(Just David Campbell III for now.)</p><p>PS.</p><p>If the game stutters or lags too much, turn down the settings. This can be achieved in the launcher that appears right when the .exe is clicked, or in the options menu in the game itself by hitting the ESC key.</p><p>This is a puzzle game as well as a horror game. Use your surroundings for clues.</p><p><em>**Donations are greatly appreciated and allow me to continue to learn, grow, and create games like this one (and hopefully even better!)**</em></p><p><strong>Contact with bugs, suggestions, or anything in between at: </strong><br/></p><p>pieonaplateproductions@gmail.com</p>", "metacritic": null, "released": "2017-04-09", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/6f9/6f9e9ab0d00c4a7962b1d0da4e85d410.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 148, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Pie On A Plate Productions"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}