{"id": 111357, "slug": "jigsaw-puzzles-world", "name": "Jigsaw Puzzles World", "name_original": "Jigsaw Puzzles World", "description": "<p>Our new free puzzles will give you some wonderful time of matching beautiful pictures right on you android device!</p><p>Choose one of our puzzle pets, nature, landscapes, animal puzzle and others, and match as many pieces as you want! </p><p>No piece is going to be lost in our free puzzles jigsaw! Try it and you'll get:</p><p>- A block puzzle free game for your tablet</p><p>- Option quantity of jigsaw pieces from 28 to 384</p><p>- Piece rotation option!</p><p>- Great choice of breathtaking pictures from different categories</p><p>If you still can't find animal puzzle games or childrens puzzle, you'll be really surprised to find them and even more right here in one game! Do you want to match an awesome image of a cat, dog or a car? Does your son or a daughter prefer to have a picture of a dragon, dinosaur or a sweet candy? There is no need to search for puzzle games for adults or puzzle games for kids separately when you can install free New puzzles for all ages right now!</p><p>Try and pass this puzzle quest, and you'll probably prefer it to all other android games.</p><p>There's nothing easier than to play our new puzzle english:</p><p>- Choose one of the various pictures from the magic puzzle free</p><p>- Choose the quantity of the pieces (9 options) from 28 to 384</p><p>- Choose the type of the pieces (with or without rotation)</p><p>- To rotate a piece just click on it!</p><p>- When you match puzzle blocks right you'll see them blink and joined together. The cannot be detached anymore. But you still can rotate the blocks!</p><p>You've never enjoyed puzzle apps so much before! Take your choice among epic pictures, set the parameters and match stunning landscapes, cute animals and pets, delicious food, seas, countries, christmas themes and many other pictures on your tablet! </p><p>For everybody who loves puzzle games free New Puzzles will become the favourite one. More pictures, more options, more fun!</p><p>Are you looking for hard jigsaw puzzles? Make yourself a gift!</p><p>It doesn't matter if you search for free puzzle games for adults or for children, for boys or for girls, New Puzzles contains a huge range of picture to all ages, tastes or individual preferences. Hurry up and install one of the most excellent free puzzle games!</p>", "metacritic": null, "released": "2016-06-07", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/31c/31c3d61adbbacef4bcd433765dd4beac.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 178, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["sweetgamesbox"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}