{"id": 111303, "slug": "oxland-matematicas", "name": "OxLand Matemáticas", "name_original": "OxLand Matemáticas", "description": "<p>\r\n\tOxLand es un set de actividades interactivas enfocadas en diferentes áreas orientadas al aprendizaje de chicos de jardín de infantes y primaria. Busca trabajar con numeración, cálculos simples y situaciones problemáticas. El primer capítulo se concentra en el área de matemática, y se puede jugar tanto en Español como en Inglés.\r\n</p><p>\r\n\tOxLand contiene minijuegos con interfaces amigables para el usuario, ayudando a que el proceso de aprendizaje sea una experiencia rica y dinámica.\r\n</p><p>Pueden descargar el manual de actividades complementarias en: http://oxed.com.ar/resources/ManualOxlandMatematica.pdf</p><p>\r\n\tEsta es una aplicación en desarrollo, tu apoyo mediante el testeo y feedback es muy importante para nosotros. Para más información y actualizaciones puedes seguirnos en Facebook, Twitter e Instagram.\r\n</p><p>\r\n\tFacebook: https://www.facebook.com/oxeducation\r\n</p><p>\r\n\tTwitter: @oxeducation\r\n</p><p>\r\n\tInstagram: @oxeducation\r\n</p><p>\r\n\t______________________________________________________________<br/>\n</p><p>OxLand is a group of interactive activities aimed to work on different learning areas of children in kindergarden and primary school. It counts with friendly minigames that help children in their learning process, making it a more dinamic an enriching experience.<br/></p><p>\r\n\tThe first chapter works around math contents and can be played in Spanish or English. It aims to work on numbering, simple calculations and problematic situations.\r\n</p><p>\r\n\tIt is an app in development, therefore, your support by testing and feedback is very important for us. For more information and updates you can follow us on Facebook, Twitter and Instagram.<br/>\n</p><p>OxLand has a metrics system that records the user's learning curve throughout time. Based on the feedback of multiple teachers, we determined to record the following data:</p><ul>\n<li>Obtained score</li>\n<li>Time needed to complete the games</li>\n<li>Number of correct answers</li>\n<li>Number of incorrect answers</li>\n<li>Number of used hints</li>\n<li>Timestamp for each played game</li>\n<li>Number of times each game was played</li>\n</ul><p>\n<br/>\n</p><p>\r\n\tFacebook: /OXeducation\r\n</p><p>\r\n\tTwitter: @OXeducation\r\n</p><p>\r\n\tInstagram: @oxeducation\r\n</p><p>\n<br/>\n</p>", "metacritic": null, "released": "2015-12-23", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/581/58114147f39178f7dfd5e0ceb7c905f9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 74, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["OXEducation"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}