{"id": 11149, "slug": "buildanauts", "name": "Buildanauts", "name_original": "Buildanauts", "description": "Build a town from the ground up in this open-world construction simulator. <br/><br/>In BUILDANAUTS, you’re the foreman, the planner, and the mayor. Plan your town and bring it to life with the help of your construction crew. Build a town that your townsfolk, the Buildanites, will be proud to call home! <br/><br/><strong>EXPLORE AND DESIGN</strong><br/><br/>Survey a vast open landscape just waiting for your construction crew. Terraform the terrain, or run around looking for resources. Then design your structures by drawing them and choosing paint colors, textures, details, and building materials. Then watch as your skilled construction workers turn your vision into a reality! <br/><br/><strong>BUILD AND MANAGE</strong><br/><br/>Build your town from the ground up just the way you want it! Use a variety of construction tools to place city props, lay down roads, and much, much more. Then keep your resident Buildanites happy! Attract more townsfolk by keeping your town in top shape, but be careful: too much neglect and your Buildanites won't be happy!<br/><br/><strong>FEATURES</strong><br/><ul><li>Design and build a town from the ground up! Create homes, stores, offices, roads, sidewalks and much more!<br/></li><li>Manage a living town that fills up with residents as you build! Keep your residents happy by building the amenities they need and keeping your city running smoothly!<br/></li><li>Explore a vast open world and shape it to your liking with a selection of tools. </li></ul>", "metacritic": null, "released": "2017-05-04", "tba": false, "updated": "2019-08-28T22:14:02", "background_image": "https://media.rawg.io/media/screenshots/2f4/2f46bf865714ae0031a7849931e85711.jpg", "website": "http://www.buildanauts.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 9}, "playtime": 4, "achievements_count": 16, "ratings_count": 0, "suggestions_count": 292, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["TouchTilt Games"], "genres": ["Simulation", "Casual", "Indie"], "publishers": ["Octopus Tree"], "esrb_rating": null}