{"id": 11148, "slug": "the-lab", "name": "The Lab", "name_original": "The Lab", "description": "Set in a pocket universe of Aperture Science, The Lab offers a wide range of ways to enjoy VR, all in one application. <br/><br/><strong>Slingshot</strong><br/>Begin your career as a Calibration Trainee by recklessly destroying everything in the Aperture Storage Annex using the Core Calibration slingshot.<br/><br/><strong>Longbow</strong><br/>Use your archery skills to defend your noble castle gate from a rampaging but adorable and equally noble horde of attackers.<br/><br/><strong>Xortex</strong><br/>Are you a bad enough dude to become a Xortex ace? Relive the golden era of gaming -- only this time, it's all around you.<br/><br/><strong>Postcards</strong><br/>Visit exotic, far-off locales from the comfort of your own head.<br/><br/><strong>Human Medical Scan</strong><br/>Explore the intricate beauty of the human body through a highly detailed model created from a series of CT medical scans.<br/><br/><strong>Solar System</strong><br/>Why watch shows about the vast majesty of space when you can jump in and see it for yourself? Have educational space-fun while putting Neil Degrasse-Tyson out of business.<br/><br/><strong>Robot Repair</strong><br/>Can you repair a robot? Good, because Aperture Science's Human Diversity Outreach Program is now hiring.<br/><br/><strong>Secret Shop</strong><br/>The fantasy equivalent of a twenty-four-hour convenience store is now open for business! Peruse artifacts, shop for familiars and cast a spell or two at Dota's Secret Shop!", "metacritic": null, "released": "2016-04-05", "tba": false, "updated": "2024-03-16T18:51:37", "background_image": "https://media.rawg.io/media/screenshots/d33/d331d95adf10b44ee3678129020bc31f.jpg", "website": "", "rating": 3.06, "rating_top": 4, "added_by_status": {"yet": 175, "owned": 3017, "beaten": 79, "toplay": 7, "dropped": 69, "playing": 5}, "playtime": 1, "achievements_count": 0, "ratings_count": 174, "suggestions_count": 353, "game_series_count": 0, "reviews_count": 175, "platforms": ["PC"], "developers": ["Valve Software"], "genres": [], "publishers": ["Valve"], "esrb_rating": null}