{"id": 111440, "slug": "going-for-a-nice-walk-the-videogame", "name": "Going for a Nice Walk: The Videogame", "name_original": "Going for a Nice Walk: The Videogame", "description": "<p><em>Going for a Nice Walk: The Videogame </em>is a videogame in which you go for a nice walk. It was developed of the Slow Game Jam in 2017. Designed to provide a relaxed, meditative experience, players can stroll along and examine the various things they come across in their walk.</p><p><em>Going for a Nice Walk: The Videogame</em> is a <strong>live project. </strong>I'm planning on adding in new objects to the game on a weekly basis, with updates to the game once a month. I'd like to take suggestions from players, which I'll draw and add into the game as updates; if you'd like to suggest something to include in the walk, you can do it in the comments section below or on Twitter using the hashtag #nicewalkVG. Nothing is too outlandish to feature, so let me know you <em>you'd </em>like to see whilst out on a nice walk.<br/></p><p><strong>Controls: </strong>use the <strong>arrow keys </strong>to speed up, slow down, or sit on the ground. <strong>Click</strong> on objects you pass to examine them.<br/></p><p>Update 09/04/17: <em>We got some extra time on the game jam, so I've made a few system updates to the game. Time now cycles through day and night; different sights will appear depending on the time of day. I've also updated the text to look a lot nicer, and there are an extra bunch of availalbe sights based on people's suggestions!</em></p>", "metacritic": null, "released": "2017-03-29", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/ca7/ca7d4a57e5e33a401bb328cd24af38e1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 38, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["TomBattey"], "genres": [], "publishers": [], "esrb_rating": null}