{"id": 111523, "slug": "oh-boy-its-summer", "name": "Oh Boy! It's Summer", "name_original": "Oh Boy! It's Summer", "description": "<p>Hello, everyone. This is my prototype of my game \"Oh boy! It's summer\". This game is a story based first person 3D farming simulator. The story revolves around a Dylan, a 20's something man who has been sent to his grandfathers barn to help him out in his farm help by planting crops, feeding the animals and then selling them at his home shop. The more the quality of his crops are the better amount he receives eventually leading to shorter amount of work he has to do. </p>\n<p>The factors affecting the quality of crops will be depended upon the time at which they are watered and fertilizers and spray are used at the right time which is depended on an algorithm that is individual to each plant.</p>\n<p>What I envision is to port this game into VR. Heavy optimizations are required to do so. I am certain that this will be done in a month or under. I have completed making almost 70% of the game. This is the first prototype I built.I have 2 more levels which are essential to the story and hope you will enjoy it whenever it's made  and make you happy just as it made me when I thought about it.</p>\n<p>As you know VR development is quite expensive, any donation will help. If it receives enough amount of support I will make it my top priority and finish it at soon as possible. Thank you for viewing. :)</p>\n\n<p>Since, there is no UI specifying the controls, I will state it here.</p>\n<p>To pick up a tool : Go near It and press \"E\".</p>\n<p>To Use a tool: Press G + Left Mouse Button.</p>\n<p>To Drop a Tool : Press \"F\".</p>\n<p>To open Inventory: Press \"I\".</p>\n<p>To Close Inventory: Press \"F\".</p>\n<p>To farm:</p>\n<p>1. Go to the land and start raking it from the top.</p>\n<p>2. After raking the land Start hoeing it from the top.</p>\n<p>3. after the whole land is hoed. Drop the hoe and press \"E\".</p>\n<p>There should be a hole in the ground.</p>\n<p>4. Now open inventory go to seeds option( only 3 as of now wheat, corn, oats ) and select the desire seed.</p>\n<p>5. The seed will appear in the hole.</p>\n<p>6. Now Press F to close the hole.</p>\n<p>7.The plant will grow after an interval of 5 sec which can be set in the next versions. :)</p>\n\n<p>You can check out the second phase at https://aks97.itch.io/oh-boy-its-summer-phase-ii </p>\n<p>Thanks you for visiting.</p>", "metacritic": null, "released": "2017-08-15", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/a50/a50ba8925da3e3113c293ecad88fa7ab.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 29, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["aks97"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}