{"id": 11150, "slug": "malavision-the-origin", "name": "Malavision: The Origin", "name_original": "Malavision: The Origin", "description": "<strong>Malavisión</strong> is a Guarani legend spread throughout South America. According to the native, witnesses and victims, it’s about a woman that shows up screaming harmfully in estuaries and hills in seek of outlanders who have gotten in her territories without permission. She’s capable of disturbing reality as she pleases.<br/><br/>The legend mentions a woman who killed her husband for jealousy and that seven days after, her husband showed up as a ghost to do justice as a way to put his soul in peace. This is how he transferred his curse to her.<br/>Yet maybe the reality was very different, and much, much worse…<br/><br/><br/><br/>Year 2013. Location: Chaco - Paraguay <br/><br/>A politician runs away upon sued corruption acts against him were proved. He gets in a private property located in the Paraguayan Chaco. As his assistant disappears, he decides to go into his quest. What is awaiting him to live has existed only in the imagination, myth and superstition. He must overcome any kind of obstacles as a way to survive in a hostile environment, disturbed in time and space.<br/><br/>Malavision: The Origin will offer the most terrible origins of so many ones which are related to this guarani myth and the basis of its existence.<br/><br/><br/><br/><br/><br/>Talks about the social reality of Paraguay, a mediterranean country in South America. Politics corruption, violence against women and mental problems are an essential part of this game.<br/><br/><br/>The game is not only is a conceptual mixture of others from the old school. It also adopts current concepts and mechanics. Among the main features in playability are:<br/><ul><li>Lenguage Subtitle: Spanish, English, Portuguese.<br/></li><li>Rechargeable flashlight.<br/></li><li>Puzzles solving to keep going on the game.<br/></li><li>Real time kinematics.<br/></li><li>Agonizing chases.<br/></li><li>Life Recovered taking pills.<br/></li><li>From 4 to 5 hours in the first try.<br/></li><li>Notes spoken.<br/></li><li>Constant updates.</li></ul><br/>", "metacritic": null, "released": "2016-10-17", "tba": false, "updated": "2023-06-27T16:16:25", "background_image": "https://media.rawg.io/media/screenshots/322/322d6c3b808c8b8b0ba62b88f3e4c462.jpg", "website": "http://malavision.waranistudios.com//", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 64, "beaten": 1}, "playtime": 6, "achievements_count": 8, "ratings_count": 1, "suggestions_count": 225, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Waraní Studios", "Ismael Pozzo", "Eduardo Benitez"], "genres": ["Adventure", "Indie"], "publishers": ["Ismael Pozzo"], "esrb_rating": null}