{"id": 11162, "slug": "pavilion", "name": "Pavilion", "name_original": "Pavilion", "description": "Pavilion, the fourth-person puzzling adventure from Visiontrick Media, throws you directly into its mysterious and atmospheric world without any text tutorials or beginning explanations. <br/><br/>Interact with the environment - sounds, lights, physical objects - in order to guide the unknown main character towards his impending fate.<br/><br/><ul><li>28 atmospheric and puzzling levels in a surreal dream-like place where reality clash with fantasy. Fully realized in beautiful hand-crafted 2D artwork and otherworldly music that makes for an unforgettable audio-visual experience.<br/><br/></li><li>Dreamy ambient tunes from space-music pioneer Tony Gerber whose music sets a beautiful atmosphere and brings a great contemplative mood to the experience of Pavilion.<br/><br/></li><li>A game in two chapters; Chapter 1 out now(this). Chapter 2 out in 2017 as dlc.<br/><br/></li><li>Featuring Eye-Tracker support for Tobii EyeX Eye-Tracker – With the power of simple gaze interaction you move around, observe and interact with the puzzling world and the unknown hero in order to guide him towards his impending fate.<br/><br/>Extending the already omnipresence aesthetic the Eye-Tracking adds to the fourth-person sentiment both on a narrative level and through the indirect gameplay itself.</li></ul><br/>Extras also includes:<br/><ul><li>\"The Early and Unseen Art of PAVILION PDF.<br/></li><li>High-definition wallpapers.<br/></li><li>Sample song of Tony Gerbers Soundtrack.</li></ul>", "metacritic": null, "released": "2016-09-23", "tba": false, "updated": "2023-03-29T03:11:58", "background_image": "https://media.rawg.io/media/screenshots/eb4/eb4bb26d64d135e6deec434246a95b88.jpg", "website": "http://www.inthepavilion.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 5, "owned": 55, "beaten": 4, "toplay": 5, "dropped": 3}, "playtime": 1, "achievements_count": 0, "ratings_count": 3, "suggestions_count": 447, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC", "Linux", "Android", "macOS"], "developers": ["NVIDIA Lightspeed Studios", "Visiontrick Media"], "genres": ["Adventure", "Indie", "Puzzle"], "publishers": ["Visiontrick Media"], "esrb_rating": "Everyone 10+"}