{"id": 111797, "slug": "dark-lord-of-the-nice-castle", "name": "Dark Lord of the Nice Castle", "name_original": "Dark Lord of the Nice Castle", "description": "<p>Jeu disponible gratuitement en français / Free game available in english </p>\n<p>WINDOWS 10 - IMPORTANT :</p>\n<p>FR : On nous a prévenu que certaines personnes sous windows 10 n'arrivaient pas à lancer la version click-to-play. On a donc ajouté une version à installer classique et combiné les deux dans un fichier winrar.</p>\n<p>EN : We've been warned some people on windows  couldn't start the click-to-play version. So we added a more classical version with an installer and combined the two of them in a winrar file.</p>\n<p>---FRANCAIS---<br/></p>\n<p>Petit jeu d'exploration / plate-forme faità la base pour la game jam des Utopiales 2017. Le thème était la procrastination. L'équipe étant motivée, le jeu a été ensuite retravaillé afin qu'il soit \"fini\" et ainsi offrir une expérience complète et sans bug.<br/></p>\n<p> Pitch : Le boss final est à portée d’épée ! Mais ceci-dit, le château et ses environs sont plein d’attraits, alors autant prendre le temps de visiter, le vile dragon peut bien attendre ! </p>\n<p>---ENGLISH---</p>\n<p>Exploration / platform game made originally for the Utopiale GameJam 2017. Main theme was procrastination. The team being motivated, the game was then reworked so that it was \"finished\" and thus offer a complete and bug-free experience.</p>\n<p>Pitch : Final boss is at the tip of your sword ! But that said, the castle and its surroundings are full of wonders, so take the time to visit, the vile dragon can wait!</p>\n<p>---CREDITS---</p>\n<p>Animations : Romain Le Leydour</p>\n<p>Background : Noé Capian</p>\n<p>Character Design : Pierre Leguennec</p>\n<p>Development &amp; Game Design : Yann Le Saint </p>\n<p>Sound Design : Louis Godart</p>\n<p><em>V 1.01 :</em></p>\n<p>- corrected a crash when trying to interact with the locked room.</p>\n<p>- corrected a bug where the special dialogue would not pop.</p>\n<p>- corrected a bug when hitted while starting a text at the same time</p>\n<p>- corrected a bug allowing to reset the boss during his death animation</p>", "metacritic": null, "released": "2017-11-17", "tba": false, "updated": "2019-08-28T23:24:19", "background_image": "https://media.rawg.io/media/screenshots/1de/1de6d84f078e946ad507bea6a8dcf9fc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 65, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["yannlesaint", "Pirate Bear", "Osbern"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}