{"id": 111749, "slug": "avoxture", "name": "AVOXTURE", "name_original": "AVOXTURE", "description": "<p><em>La version française suit...</em></p>\n<p><strong><em>«</em></strong><strong><em>Imagine waking up feeling dizzy. You don't know where you are, or what is happening to you. Then you focus on the surrounding noises. You notice some birds around you. You feel as if your salvation depends upon them. Especially this owl which seems to be calling you. Could it be the Acalopultoz owl, the messenger bird from the low-lying limbos, whose sacred writings bring back to existence?</em></strong></p>\n<p><strong><em>Well, then the situation is serious. If you are really in the low-lying limbos, you must have had an accident, and your spirit must presently be separated from your body. </em></strong></p>\n<p><strong><em>Where do the writings bring back from? The low-lying limbos… A terrifying and hostile desert where spirits disintegrate before sinking into oblivion. The messenger birds enable the spirits to buy some time in this hostile environment and fight off psychic exhaustion, which ultimately leads to oblivion. And this particular owl is supposed to know the way out and be your ticket to freedom. You must act fast however...</em></strong></p>\n<p><strong><em>You have to hit the road and be on the lookout for the surrounding birds in this frozen desert.»</em></strong></p>\n<p><strong>AVOXTURE</strong> is a ten level exploration sound game playable on PC (Windows XP, 7, 8 and 10). You control a spirit in the low-lying limbos with the arrow keys on your keyboard or the control pad of your joystick. You move your character like you would move a cursor on a grid, which essentially means that each of the four arrow keys correspond to a moving direction. The bottom arrow key does not make your character return but advance towards the south.</p>\n<p>The messenger birds are there to help you in your journey. The owl allows you to move from one level to the next one until you beat the game. The other birds allow you to fight off psychic exhaustion by expanding your listening ability with regard to the environment. The more birds you encounter, the more your character will be able to hear the barriers that stand around his way. Each bird allows you to hear barriers in a new direction to the point of expanding these listening abilities all around the character.</p>\n<p><strong>AVOXTURE</strong> offers an automatic saving system. Exit with the escape key and when you return to the game, you will find yourself where you left off. Your character's psychic exhaustion is expressed through mood music. The exhaustion makes you lose one of the directions of your listening abilities when it comes to an end. You will need to find another bird in order to recover this ability. If your character is exhausted without anymore listening ability as a spare, you will have lost and the game will restart from the first level. It is normal to lose frequently at first. The layout of <strong>AVOXTURE</strong>'s environments change throughout different parts of the game, however the levels have at least one pathway linking your character to the owl. It's up to you master your character's listening abilities so you can get him to escape these dead ends.</p>\n<p><strong><em>«The low-lying limbos are thus, always shifting in order to better snatch its lost explorers.</em></strong><strong><em>»</em></strong><br/></p>\n<p>«<strong><em>Vous vous réveillez avec une sensation de vertige. Où êtes-vous? Que se passe-t-il ici? Vous vous concentrez sur les bruits environnants. Des oiseaux, là, autour de vous. Vous sentez que votre salut en dépend. Et en particulier, une chouette, qui semble vous appeler. Serait-ce la chouette d'Acalopultoz, l'oiseau messager des basses limbes dont les écrits sacrés rapportent l'existence?</em></strong></p>\n<p><strong><em>Dans ce cas, la situation est sérieuse. Si vous êtes bien dans les basses limbes, il a dû vous arriver un accident, votre esprit doit actuellement se trouver séparé de votre corps. </em></strong></p>\n<p><strong><em>Que rapportent les écrits déjà? Les basses limbes… Un désert terrifiant, hostile, où les esprits se délitent pour sombrer dans l'oubli. Les oiseaux messagers permettent de gagner un peu de temps dans cet enfer en luttant contre l'épuisement psychique qui menace de vous faire sombrer. Et la chouette en particulier, est censée connaître le chemin de sortie, elle peut vous sortir de là. Il vous faut faire vite.</em></strong></p>\n<p><strong><em>Vous vous mettez en route, à l'affût des oiseaux autour de vous, dans ce désert glacé...»</em></strong></p>\n<p><strong>AVOXTURE</strong> est un jeu sonore d'exploration et d'aventure sur dix niveaux (PC Windows XP, 7, 8 et 10). Vous êtes un esprit dans les basses limbes. Vous vous déplacez avec les touches fléchées de votre clavier ou la croix directionnelle de votre manette de jeu. Vous bougez à la façon d'un curseur sur une grille, c'est-à-dire que chacune des quatre touches fléchées correspond à une direction de déplacement. La touche bas ne fait pas reculer, elle vous fait progresser vers le sud.<br/></p>\n<p>Les oiseaux messagers sont là pour vous aider dans votre périple. La chouette vous permet de passer d'un niveau au suivant pour battre le jeu. Les autres oiseaux vous permettent de lutter contre l'épuisement psychique en augmentant vos capacités d'écoute de l'environnement. Plus vous rencontrerez d'oiseaux, plus vous serez capable d'entendre les obstacles se dressant autour de lui. Chaque oiseau permet d'entendre les obstacles dans une nouvelle direction, dans le but d'étendre vos capacités d'écoute tout autour de vous.</p>\n<p><strong>AVOXTURE</strong> propose un système de sauvegarde automatique. Quittez avec la touche échappement, vous reprendrez le jeu la prochaine fois automatiquement là où vous l'aurez laissé. Votre épuisement psychique se manifestera par une musique d'ambiance. Arrivé à son terme, l'épuisement vous fait perdre une des directions de vos capacités d'écoute. Il vous faudra retrouver un oiseau pour retrouver cette capacité. Si vous êtes épuisé sans capacité d'écoute en réserve, vous perdez la partie et le jeu redémarrera au premier niveau. Il est normal de perdre souvent les premières fois. La configuration des environnements d'<strong>AVOXTURE</strong> change d'une partie sur l'autre, mais les niveaux comportent toujours au moins un chemin vous reliant à la chouette. </p>\n<p><em><strong>«Les basses limbes sont ainsi, toujours mouvantes, pour mieux happer ses explorateurs égarés.»</strong></em></p>", "metacritic": null, "released": "2017-02-23", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/ade/ade00ebdbac748fa735e2831624ae63b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 69, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ludocielspourtous"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}