{"id": 111889, "slug": "dreaming-mummy", "name": "Dreaming Mummy", "name_original": "Dreaming Mummy", "description": "<p>\n<strong><em>\"Don't let the mummy wake up\"</em></strong> is the phrase you had just deciphered from the hieroglyphs right before you saw it rising from his it's sarcophagus.  Also, you are feeling as if it had been given you the power to influence the world of dreams, in order to guide the mummy on his way out of the pyramid.  Now, <strong>would you dare to disobey what the ancient writings say?</strong>\n</p><p>\n<strong>Dreaming Mummy</strong> is a game in which you have to match the floor level in the dream world in the right time just like the floor in the real world, so the creepy mummy won't fall or trip over the objects and wake up from its sacred sleep.</p><p>It's missing some features and the art is just a draft, but we intend to finish the game after the Jam.<br/></p><p><strong>Thanks for playing!</strong> If you have something to tell about the game, please get in contact at twitter.com/juliobastos<br/></p><p>\n<strong>\"Não deixe a múmia acordar\"</strong> é a frase que você tinha acabado de decifrar dos hieróglifos, quando você a viu levantando de seu sarcófago. Além disso, você está se sentindo como se tivesse sido dado a você o poder de influenciar o mundo dos sonhos, a fim de orientar a múmia em seu caminho para sair da pirâmide. Agora, <strong>você ousaria desobedecer o que os escritos antigos dizem?</strong>\n</p><p>\n<strong>Dreaming Mummy</strong> é um jogo no qual você deve combinar o nível do chão no mundo dos sonhos no tempo certo exatamente como o chão no mundo real, para que a assustadora múmia não caia ou tropece nos objetos e acorde de seu sono sagrado.\r\n</p><p>Faltam algumas funcionalidades e a arte é apenas um rascunho, mas pretendemos finalizar o jogo após a Jam.<br/></p><p><strong>Obrigado por jogar!</strong> Se você tem algo a dizer sobre o jogo, por favor, entre in contato no twitter.com/juliobastos  <br/></p>", "metacritic": null, "released": "2016-07-23", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/c0d/c0d2457650c7bc860b562d185cfefc70.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 86, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Jotabhe"], "genres": [], "publishers": [], "esrb_rating": null}