{"id": 11189, "slug": "immortal-redneck", "name": "Immortal Redneck", "name_original": "Immortal Redneck", "description": "Immortal Redneck is an FPS set in Egypt with rogue-lite elements. The game mixes old-school first-person shooter action with a rogue-lite mechanics. Frantic gameplay, twitch controls and an arcade-style feel meet randomly generated dungeons, a complete skill tree, permanent death and 9 classes with different traits.<br/><br/><br/><br/>The game revolves around a redneck tourist who wakes up mummified in ancient Egypt after an accident. Why is he here? How did he survive the accident? And why the hell is he mummified?!<br/><br/>The answer lies within the three danger-filled pyramids of Giza, all protected by an army of monsters and huge bosses. Obviously, your mission is to get inside the pyramids, kill all the enemies and discover what's going on!<br/><br/><br/><br/><ul><li>Old School FPS: frantic gameplay, twitch controls and an arcade-style<br/></li><li>RogueLite mechanics: randomly generated dungeons, classes, skills, permanent death but with gameplay progression<br/></li><li>Nine playable classes: all with different skill sets. Players can switch classes between each play through, selecting the one most suitable for their current run<br/></li><li>Complete skill tree: evolve your character, buying equipment and weapons, upgrading and acquiring new skills<br/></li><li>Over 50 different weapons: traditional firearms, magical, mythological, futuristic or just plain weird weapons including a Potato Launcher. You name it, this game has it<br/></li><li>Over 100 scroll modifiers: Each scroll picked up in-game changes your current run, for good (convert your enemies in to chickens) or for bad (reduces your speed of movement) and everything in between!<br/></li><li>Over 35 enemies: mummies, sarcophagus, flying skulls, humanoid snakes, big fat warriors... All willing to kill you<br/></li><li>Huge bosses: two in each pyramid with unique gameplay<br/></li><li>Merchant: Buy equipment and supplies that will be maintained between different games, even when you die<br/></li><li>Skill Rooms: hone your skills in rooms focused on platforming and avoiding a variety of traps<br/></li><li>Twitch Quest: special mode for streamers, your community will vote on what happens next</li></ul>", "metacritic": 69, "released": "2017-04-24", "tba": false, "updated": "2024-03-28T18:19:46", "background_image": "https://media.rawg.io/media/screenshots/871/87114f517a29b1e45ac062ddcae8aef0.jpg", "website": "http://www.immortalredneck.com", "rating": 3.55, "rating_top": 4, "added_by_status": {"yet": 120, "owned": 1632, "beaten": 21, "toplay": 15, "dropped": 43, "playing": 3}, "playtime": 4, "achievements_count": 123, "ratings_count": 93, "suggestions_count": 525, "game_series_count": 0, "reviews_count": 95, "platforms": ["Xbox One", "PlayStation 4", "Nintendo Switch", "macOS", "PC", "Linux"], "developers": ["Crema", "Crema Games", "CremaGames"], "genres": ["Action", "Indie"], "publishers": ["Crema", "Crema Games"], "esrb_rating": "Teen"}