{"id": 11185, "slug": "bounty-killer", "name": "Bounty Killer", "name_original": "Bounty Killer", "description": "“Bounty Killer” is a FPS (or switch TPS) game. You can play on PC using the HTC vive and Oculus Rift.<strong> the Game Will Include:  </strong><br/><strong> Score Mode (will Be In Test Version): </strong><br/><ul><li> In the score mode, you will be a bounty hunter, fighting with bandits in towns and wilds.<br/></li><li> When you meet the leader of bandits, you will duel as a western cowboy.<br/></li><li> Kill more bandits, to collect more weapons.<br/></li><li> In score mode, the bullets are limited, so you must increase your hit rate to kill more bandits (of course, killing bandits will get you more bullets).<br/></li><li>  Get higher score to get promotion of your rank in the player rank list.</li></ul><strong> Play the game alone? Don’t worry, you can play the duel with other player in internet. Believe me, It will be exciting. </strong><br/><br/><strong> Survival mode (Will be in official version): </strong><br/><ul><li> In this mode, you will live in the old western town.<br/></li><li> You must search for food and water.<br/></li><li> You must search for weapons by yourself (produce, buy, or get it from the bodies of players or npcs)<br/></li><li> You will collect materials, building blueprints, buy the land and hire construction workers to build your home.<br/></li><li> You have many ways to earn the money, including:<br/><ul class=\"bb_ul\"><li> Completing tasks.<br/></li><li> Managing the paddock and farm.<br/></li><li> Getting the bandit’s head. (of course, they are dangerous)</li></ul></li><li> Of course, you can be bandit.(Will be included with DLC)<br/></li><li> Online, you can live the western life with your friend. (will be included in future)</li></ul>", "metacritic": null, "released": "2017-04-17", "tba": false, "updated": "2019-08-28T22:14:01", "background_image": "https://media.rawg.io/media/screenshots/26f/26f0a765b44602f99b7613cfe7007af1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 355, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Galaxy Game Studio"], "genres": ["Action", "RPG", "Indie"], "publishers": ["Galaxy Game Studio"], "esrb_rating": null}