{"id": 11192, "slug": "shelter", "name": "Shelter", "name_original": "Shelter", "description": "<p>Shelter is a game where the main character is a badger who takes his cubs from one place to another.</p>\n<h3>Gameplay</h3>\n<p>On the way the cubs need to be fed - five cubs regularly want to eat. Food for them can be obtained by hunting or finding - if it&#39;s fruits and vegetables.</p>\n<p>Cubs need to be protected from dangers. Difficulties and threats along the way are numerous - these are predatory birds, other predators, forest fires.</p>\n<p>The goal of the game is to lose as little cubs as possible on the way to a new place to live.</p>\n<h3>Episodes</h3>\n<p>The game consists of several episodes. In each episode, the conditions differ from those of other episodes.</p>\n<p>For example, in the first and last episodes, the badger and her cubs have to go through open spaces. In these open spaces, they are threatened by birds of prey that can dive down and take someone away if the badgers stay long in the open.</p>\n<p>The action of one of the episodes occurs at night, when visibility is limited. In this darkness, badgers can get frightened of sudden calls and run away in different directions, disappear from the mother&#39;s field of visibility, they will have to be looked for.</p>\n<p>Another episode is a river crossing.</p>\n<h3>Sequel</h3>\n<p>The game has a sequel, where you need to play for a female lynx. Unlike the first game, in the sequel it is possible to grow those who can be brought to a new shelter, and then they will become the next generation operating in the game.</p>", "metacritic": 69, "released": "2013-08-27", "tba": false, "updated": "2024-03-14T10:02:09", "background_image": "https://media.rawg.io/media/screenshots/eb7/eb70b94188815efea35b95222561e37e.jpg", "website": "http://www.shelterthegame.com/", "rating": 3.59, "rating_top": 4, "added_by_status": {"yet": 80, "owned": 1054, "beaten": 91, "toplay": 19, "dropped": 40}, "playtime": 2, "achievements_count": 0, "ratings_count": 126, "suggestions_count": 448, "game_series_count": 2, "reviews_count": 128, "platforms": ["iOS", "macOS", "PC"], "developers": ["Might and Delight", "Maksimilians Maksimovs"], "genres": ["Adventure", "Simulation", "Board Games", "Card", "Indie"], "publishers": ["4EversGames", "Might and Delight", "Maksimilians Maksimovs"], "esrb_rating": "Everyone 10+"}