{"id": 111917, "slug": "take-the-dream-ix-itch", "name": "Take the Dream IX (itch)", "name_original": "Take the Dream IX (itch)", "description": "<p>\"<strong>While all deception requires secrecy, all secrecy is not meant to deceive.</strong>\" - Sissela Bok</p><p><em>There are tales of a mystical land, known as, \"Mothresia.\" A land that's long since been forgotten. The Goddess Saturna once presided over Mothresia, blessing the people with Sacred Stones that granted good will, luxuriant crops, and an era of peace.</em></p><p><em>However, this time of peace did not last. For the Darkness, that once had ruled in times of old, grew stronger in the dark corners of the land. And one day, a new Demon King was born. The Demon King, apathetic to the happiness of mankind, went and corrupted the Sacred Stones... Ravaging the land and casting doubt into the minds of men. The Goddess tried her best to cast the Demon King away with her blessing, but alas, the Darkness had grown too strong. The Demon King overtook the Goddess, sealing her into a Cursed Amulet, hiding it deep in his Lair of Darkness.</em></p><p><em>At first, the people were overcome by despair. But soon, as time passed, the Goddess began to be forgotten. Worries became mundane, and the life ruled by the Demon King became ordinary. Only legends remained to speak of the blessing Saturna had once passed onto the people. The Sacred Stones became but a myth. These same legends told that one day, an unlikely hero would rise, and would change the world. But stories were all they were to the people; fairy tales. Until one day...</em></p><p>This all seems fake...</p><p>Take the Dream IX is a pseudo-RPG/Adventure/Horror game made in RPG Maker MV during a week-long Halloween community stream. Follow the journey of a woman named Gwen, out to save her girlfriend, Flora, from a strange depressed phantom know as ArKun. Featuring deceptive gameplay, a slow-building atmosphere, adventure game exploration and puzzles, RPG tropes ahoy, along with some original artwork and music, a short &amp; horrific descent.</p><p>-A free experience for anyone to take the dive into on PC &amp; Mac.</p><p>-Featuring some original music &amp; artwork past the layers of deception.</p><p>-Truly a horror game that aims to make one shiver rather than startle.</p><p>-A number of secrets and some post-release support for additional content.</p><p>-RPG &amp; Adventure tropes collide to create a varied experience.</p><p><strong>What would you do for the person you love?</strong></p>", "metacritic": null, "released": "2016-04-02", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/a08/a080af0afc65242d3eba58c49ae590e7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 160, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["AestheticGamer"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}