{"id": 112073, "slug": "super-black-friday-sweep", "name": "Super Black Friday Sweep", "name_original": "Super Black Friday Sweep", "description": "<p><em>\"Super Black Friday Sweep captures the consumerist frenzy with a trolley and a punch button.\"<strong> </strong></em><strong>- PC GAMER</strong></p><p><em>\"a game about the constant struggle for great deals. Grab the red-price items for the best value! Beat down other customers who have the things you want! Accrue so much credit card debt it will take you seventeen years just to pay for these few moments of consumer bliss!\"</em> <strong>- IndieGames.com</strong></p><p><em>\"Experience the Horror of Black Friday With This 'First Person Shopper' Game\"</em> <strong>- Motherboard, Vice</strong></p><p>The object is to save vast sums of money by spending even vaster sums. Smack the other shoppers out of your way and fill up your trolley with luxury goods in order to rack up the biggest credit card bill you can. </p><p> More screen shots and info here!<br/> http://www.thesorethumb.co.uk/sorethumbsinfo/ <br/> <br/> I made a trailer here <br/> https://youtu.be/owbkxD-wMyg <br/> <br/> And you can play the full thing (for free, no sign ups) here as well<br/> http://www.thesorethumb.co.uk/ <br/> </p><p><strong>Hope you like it! And if you really like it and want to see more a donation would make my day. THANKS!</strong></p><p> <em>\"TheSoreThumb.co.uk features the gaming masterwork of Jim Bending. Jim started making websites as a teenager, driven by a desire to share his Final Fantasy obsession with gamers around the world. Then, having studied animation, he spent eight years with Frontier Developments, most recently as Lead Animator. Now, Jim is back to doing what he does best: making silly things for the internet. \"</em><strong><em> </em>- my wife Rosie </strong><br/> <br/> Thanks very much! </p>", "metacritic": null, "released": "2015-11-27", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/777/7777ab48a26772cfa6611354daeb3187.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 92, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["sorethumb"], "genres": [], "publishers": [], "esrb_rating": null}