{"id": 112092, "slug": "rcz-the-lost-part", "name": "RCZ - The Lost Part", "name_original": "RCZ - The Lost Part", "description": "RCZ - THE LOST PART\r\nI am back with a whole new game.\r\n<p>Support it on - Patreon</p>\n<p>In the game you are the player and a friend. Your friend has got a severe wound which could lead to his death and in order to save him you need a medicine. There the game</p>\n<p>begins, the land where they were stuck was full of zombies and they have killed each and every person and you need to find the medicine in that land. I am providing you<br/>a hint that the medicine is a medical room in the land but you won't be able to see the medicine by just entering the place but you need to find it somehow. You are allowed<br/>to destruct almost everything in the game. There is a timer going on which would give a limited time to find the medicine and I have put a timer so that you get to know the<br/>time till what your friend will be alive. But make sure you are able to see or if possible reach to the medical room while the light is there as if the light is gone you<br/>won't be able to see anything and the changes of dying increase by 99%. I feel you must have understood the benifit of being in the light. You are the only one to save<br/>your friend. Beware of the zombies. You are made to follow the most difficult way as that's is the only way. Keep an eye on the time as time waits for none. Each and every<br/>one has to die one or the other day but I feel you are not meant to die today. The game a lot of time, a lot of coding and lots and lots of creativity.</p>\n<p>NOTE - THE PLAYER HAS WEAK EYESIGHT SO HE SEE EVERYTHING A BIT BLURRED.</p>\n<p>First I thought of keeping the paid as it biggest game I have ever made after the maze game. But then I made it free.</p>\n<p>I would appreciate if you support the games on Patreon</p>\n<p>If you like it make sure to comment down below. If you don't have an itch account you can use the poll below to rate the game.</p>\n<p>Poll - Rate it</p>\n<p>Download the game as soon as possible and when you clear it tell me about your experience below or on ykgupta2411@gmail.com.</p>\n<p>Waiting for your reply. See you all soon with a new game.</p>\n<p>Choose topic for another game as well.</p>\n<p>Poll - Topic for next game</p>\n<p>See the results of the poll on :- </p>\n<p>1 - Result (Game)</p>\n<p>2 - Result (Topic)</p>\n<p>Items used - </p>\n<p>UNITY - 2018.1<br/>BLENDER - 2.79<br/>ADOBE AUDITION CC<br/>VISUAL STUDIO 2017<br/>MAKE HUMAN<br/>ADOBE PHOTOSHOP CC</p>", "metacritic": null, "released": "2018-06-07", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/6dc/6dce9860837de6db12a81554e407a905.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 187, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Yash Kumar Gupta"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}