{"id": 112065, "slug": "placid-trip", "name": "Placid Trip", "name_original": "Placid Trip", "description": "<p><strong>NOW ON CARDBOARD!</strong><br/><br/>All you need to play now is google <strong>cardboard 2.0</strong>.</p><p>Embark on a journey to bring back the shape to a colorful, ever-shifting world of Placid Trip.<br/>The material world has lost its shape save for your camp held together by your spirit. Brave the ever-shifting, undulating Soul Realm chasing the Sun, to restore the shapes it holds. Find out what happened, fix the broken world and save it for ages to come.<br/></p><p>• colorful dynamic worlds assemble before your very eyes, reflecting your progress; <br/>• enhance the totem abilities with soul shards to brave this path of most resistance;<br/>• the world will test you with numerous traps and obstacles.</p><p><strong>0.4.7.0</strong> - is the current cardboard version<br/></p><p>Controls:<br/></p><p>Once you launch the game, you're in the camp. Yo may pick an ability on a totem to the right by looking at ithe animal and pressing the button. Once you pick an ability, turn to the gates and press and hold the Cardboard button for a few seconds.<br/><br/>Now in the Soul Realm, you should collect blue orbs (soul shards) that fuel your progress. Green arrows speed you up, red slow you down. Red spikes hamper your progress.</p><p><strong>Old Gameplay:</strong></p><p>Collect colored orbs. They modify the corresponding stats. Red is your damage modifier, blue regulates your armor, green regulates the distance you may run without losing your breath and an amount of mid-air jumps.<br/></p><p>When the sum of your stats reaches a certain threshold, you'll see biomes changing. There's 5 of them. Just keep on gathering orbs.<br/></p><p>You may heal by using small round cacti. Watch out for spikes.</p><p>Sometimes you will find enemies guarding orbs. Use lemons or grape soda to fight them off.<br/> </p><p><strong>Cardboard Controls: </strong></p><ul><li>press and holt the button to walk, </li><li>release to stop, </li><li>double press to attack.</li></ul><p><strong>Flat android controls:</strong> check the screenshots.<br/></p><p><strong>PC controls:</strong></p><ul><li>Switch weapons using 1 &amp; 2 number keys, 1 for lemons, 2 for soda.</li><li>Shift - run</li><li>LMB - attack, if you point GRAPE soda under yourself and shoot, you'll fly</li><li>Space - jump,</li><li>Space mid-air - mid-air jump</li><li>Q - quit the game.</li></ul>", "metacritic": null, "released": "2016-04-16", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/cc4/cc4919dc5fa3790d16afaa5f58766580.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 161, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Android"], "developers": ["PlacidTripDev"], "genres": [], "publishers": [], "esrb_rating": null}