{"id": 11207, "slug": "tales-from-the-void", "name": "Tales from the Void", "name_original": "Tales from the Void", "description": "Tales from the Void is an atmospheric real time tactics game inspired by early 20th century sci fi adventure stories. Prepare yourself for a novel gameplay experience, with squad-based tactical combat, resource management and an epic story.<br/>\n<br/>\r\nTravel back to a time of adventure, heroism and mystery as Edwin Albert Taylor Bragg, the British captain of the HMS E18 - on a secret mission to obliterate the Germans and win the war for the allies.  When a secret weapon misfires, you and your crew are warped into space. Struggling for survival, you venture out into the asteroid field to scavenge resources and fight off hostile aliens. Food is scarce, air supply is low and time is running out. Can you escape the void and find a way home?<br/>\n<br/>\r\nFeatures<br/>\n<br/>\r\n-Customize and control your marines to explore asteroids and fight the alien enemy.<br/>\r\n-Third person-RTS hybrid with low-G physics movement and combat <br/>\r\n-Play real-time or pause to plan your movements and make coordinated attacks.<br/>\r\n-Complete missions and gather supplies before your run out of air.<br/>\r\n-Play a extensive single-player campaign with an ongoing narrative.<br/>\r\n-Rogue-inspired structure with semi-random mission selection and permadeath. -try, fail, unlock equipment, retry and improve, until you find a way home.<br/>\r\n-Steam Achievements and trading cards.<br/>\n<br/>\n<br/>\r\nIn June 1916, in the midst of WWI, the English submarine HMS E18 mysteriously disappeared in the Baltic Sea to be found again as wreckage in 2009. What really happened to the crew of HMS E18? Embark on an exciting journey, inspired by a true story. <br/>\r\n\"R.C. Halahan, commander of HMS E18 had his future told by a local woman prior to this last patrol. She told him he was in grave danger, this affected the superstitious Halahan\" -Francis Goodhart, commander of HMS E8 (Wikipedia)", "metacritic": null, "released": "2016-05-20", "tba": false, "updated": "2023-05-08T14:04:30", "background_image": "https://media.rawg.io/media/screenshots/f0f/f0fcd5c9725ef687b3088fbeb6d6aa9d.jpg", "website": "http://talesfromthevoidgame.com", "rating": 2.17, "rating_top": 1, "added_by_status": {"yet": 1, "owned": 134, "dropped": 2}, "playtime": 3, "achievements_count": 23, "ratings_count": 6, "suggestions_count": 412, "game_series_count": 0, "reviews_count": 6, "platforms": ["macOS", "PC"], "developers": ["PortaPlay"], "genres": ["Action", "Adventure", "Strategy", "Indie"], "publishers": ["Black Dog"], "esrb_rating": null}