{"id": 112064, "slug": "jet-buster-itch", "name": "Jet Buster (itch)", "name_original": "Jet Buster (itch)", "description": "<p>LAUNCH OF PRICE of $6.99 applies until November 1!<br/></p>\n<p>Jet Buster is a 90s-styled anthromorphic shmup, going back to the unusual <br/>shmups of the early 90s that were going against the standard spaceship <br/>fare at the time.</p>\n<p>STORY:</p>\n<p>The year is 2182, it's been almost a decade since the Zeno Wars have <br/>ended, with the threat no more, civlizations all across the galaxy have <br/>begun to rebuild their society. One such civlization, are the weird <br/>humanoid animals living on what humans named, Earth \"J\", the home planet<br/> of none other than Makoto Kitsune, the rather odd Fox woman who helped <br/>win the Zeno Wars. And she's... a J-Pop idol?</p>\n<p>However, peace didn't last long as... some mean-spirited animals clearly<br/> don't want her singing! Her tours being constantly ruined by some angry<br/> people, Makoto got mad, so mad, she became a crimesweeper, going on a <br/>personal vendetta against those who ruined her musical tours. This <br/>musical, is gonna be full of bullets.</p>\n<p>GAMEPLAY:</p>\n<p>Jet Buster is a more accessible shoot-em'up compared to the previous <br/>Grybanser Fox titles, where Normal is 100% serious about being Normal. <br/>Of course, there's always an Expert mode for those who are looking <br/>forward for a bigger challenge.</p>\n<p>So simply, pick a character, shoot things, pick up coins OR transform <br/>coins into gold for those juicy EXTRA POINTS! And collect gold, to <br/>unlock more content.</p>\n<p>FEATURES:</p>\n<p>- 7 stages full of cute, explosive, anthro action!</p>\n<p>- Unlockables!</p>\n<p>- An early 90s game soundtrack by HeavyViper composed on the YM2151 (That's CPS-1/X68000 for those unaware :D)</p>\n<p>- Early 90s game visuals, taking some notes from certain developers of that era.</p>\n<p>Jet Buster (c) Team Grybanser Fox 2017 <br/> <br/></p>", "metacritic": null, "released": "2017-10-19", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/0bc/0bcd782b44caf260f23d64a6af2bd4d1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 190, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["JackDarx"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}