{"id": 1120, "slug": "rise-of-the-tomb-raider-20-year-celebration", "name": "Rise of the Tomb Raider: 20 Year Celebration", "name_original": "Rise of the Tomb Raider: 20 Year Celebration", "description": "<p>In Rise of the Tomb Raider, Lara Croft becomes more than a survivor as she embarks on her first Tomb Raiding expedition to the most treacherous and remote regions of Siberia.<br />\nRise of the Tomb Raider: 20 Year Celebration is PS4™ Pro Enhanced and offers three modes to customize your gaming experience: 4K Resolution for unprecedented fidelity, High Framerate for even smoother gameplay, or Enriched Visuals for the lushest and most realistic graphics possible.<br />\nThe game includes the new “Blood Ties” single player content, PSVR support for “Blood Ties”, new &#39;Lara&#39;s Nightmare&#39; zombie combat mode, new Co-op play for Endurance mode, new “Extreme Survivor” difficulty setting for the main campaign, 20 Year Celebration outfit and gun, and 5 classic Lara skins. It also includes all previously released downloadable content. With over 50 hours of gameplay, and nominated for more than 85 awards, this is the most comprehensive version of the critically-acclaimed experience.<br />\nVR games may cause some players to experience motion sickness<br />\n1 player<br />\nDUALSHOCK®4<br />\nPlayStation®VR Compatible<br />\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service &amp; playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.<br />\nRISE OF THE TOMB RAIDER, TOMB RAIDER, CRYSTAL DYNAMICS, the CRYSTAL DYNAMICS logo, EIDOS, the EIDOS logo and LARA CROFT are registered trademarks or trademarks of Square Enix, Ltd. SQUARE ENIX and the SQUARE ENIX logo are registered trademarks or trademarks of Square Enix Holdings Co., Ltd. All other trademarks are the property of their respective owners.PlayStation®Camera Required<br />\nVR games may cause some players to experience motion sickness</p>", "metacritic": 88, "released": "2016-10-11", "tba": false, "updated": "2024-04-18T20:16:53", "background_image": "https://media.rawg.io/media/games/451/451e5c6d5420d4862b9de70441cdc11a.jpg", "website": "", "rating": 4.17, "rating_top": 4, "added_by_status": {"yet": 95, "owned": 58, "beaten": 154, "toplay": 28, "dropped": 25, "playing": 14}, "playtime": 0, "achievements_count": 0, "ratings_count": 134, "suggestions_count": 640, "game_series_count": 0, "reviews_count": 137, "platforms": ["Xbox One", "PC", "PlayStation 3", "PlayStation 4"], "developers": ["Crystal Dynamics"], "genres": ["Action", "Adventure"], "publishers": ["Square Enix", "Microsoft Studios"], "esrb_rating": "Adults Only"}