{"id": 11216, "slug": "captain-kaon", "name": "Captain Kaon", "name_original": "Captain Kaon", "description": "Captain Kaon is a retro twin-stick gravity shooter inspired by 1980s classics such as Thrust and Gravitar. Captain Kaon brings the vector graphics of old right 'up-to-date’ with vibrant Amiga-style pixel art and a tight twin-stick control mechanic.Features<br/><ul><li>Enjoy classic sci-fi, tilt/thrust gravity-based gameplay</li></ul><ul><li>Battle enemies with twin-stick or 360° mouse aim</li></ul><ul><li>Explore vibrant Amiga-style pixel art environments</li></ul><ul><li>Manage resources and carefully select missions in Campaign Mode</li></ul><ul><li>Relive this forgotten shmup sub-genre!</li></ul>Story<br/>The overcrowded Earth has found a new home among the stars, a clutch of habitable worlds in the Regulus sector. But this new paradise did not last long as a strange alien force began a relentless assault on their colonies. This threat to human expansion could not go unchallenged.<br/><br/>In response the Earth has sent the finest ships in the Interstellar Navy to defend the colonists and protect its interests. Left behind are the old and the out of date, led by the flagship Argus. A small fleet of relics to defend our only home.<br/><br/>Hot headed and insubordinate, Captain Talia ‘Kaon’ was facing a court martial when war broken out. Hoping this new conflict would give her the chance for salvation, she instead found herself left behind. With the Argus operating on a skeleton crew, she has been assigned as its sole gunship pilot.<br/><br/>In the midst of this uncertainty the miners of Ceres revolt against Earth rule, refusing to supply the fleet with the deuterium fuel it sorely needs. Without it the fleet in Regulus will be unable to fight and the Earth will become vulnerable. Only Captain Kaon can fly her gunship through the twisting tunnels beneath Ceres surface and fight the revolt.", "metacritic": null, "released": "2016-11-16", "tba": false, "updated": "2019-08-28T22:14:00", "background_image": "https://media.rawg.io/media/screenshots/f3e/f3eadb1d2bc2a37a843212f7f9206d76.jpg", "website": "http://engagepixel.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 47}, "playtime": 4, "achievements_count": 20, "ratings_count": 1, "suggestions_count": 343, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Engage Pixel"], "genres": ["Action", "Indie"], "publishers": ["Engage Pixel"], "esrb_rating": null}