{"id": 112121, "slug": "save-point", "name": "Save Point", "name_original": "Save Point", "description": "Presentation\r\n<p>Save Point is a short RPG with a simple story that features a unique battle system. Made in a month for a contest in 2014, this game is actually the first one I ever made. Yay. It is mainly a game showcasing an idea I had for a long time for a battle system for jRPGs, so don't expect an amazing story, and keep in mind it is short (~1 hour should be enough to finish it).</p>\r\nStory\r\n<p>A group of young hunters are trying to go back home after hunting a rabbear. Sadly for them, a terrifying beast blocks their path and kill them. Well, that's what they thought anyway; they don't seem to be able to die. Trapped in the forest, they decide to look for another path.</p>\r\nGameplay\r\n<p>Save Point introduces a dynamic battle system mixed with a classic ATB system. The player has to choose an Auto Action, which will automatically cast itself repeatedly until the player changes it. This Auto Action can be any skill the player has learned before, but are slightly different than when they're casted as a normal Action.<br/> Each character can have a maximum of 4 Auto Actions equipped. That includes enemies, who will use them as well. They won't target anybody though, as each party member generates anger towards enemies whenever they perform any kind of action.<br/> It is worth noting that the game supports controllers (I only have an Xbox 360 one though, but it should work with others as well). </p>\n<p>Default keys are:</p>\n<p>Enter/A: Confirm<br/> Escape/B: Cancel<br/> Shift/X: Special (used in battles to change Auto Actions)<br/> Control/Y: Menu<br/> If you don't like the default controls for the keyboard, please feel free to change them in the options menu. </p>", "metacritic": null, "released": "2015-11-20", "tba": false, "updated": "2019-08-28T23:24:18", "background_image": "https://media.rawg.io/media/screenshots/2be/2be5324dda0499a215bbb4f4d0009cf9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 182, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ylzor"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}