{"id": 112149, "slug": "lost-island-2", "name": "Lost Island (itch)", "name_original": "Lost Island (itch)", "description": "<p>This project is a small part of my very first game made around 2007.  The remake has been created by one person in 7 days  for the #RemakeJam 2017, using Unity 5 engine, so you may encounter bugs and problems while playing.<br/></p>\n<p>This prototype represents only a small part of the game and is a walking simulator (literally) with no puzzles and with very simple mechanics. This project has been made just for fun.<br/></p>\n<p>The original title was \"Devil's Sea\" and is based on the legends of this place near Japan (more info here). Unfortunately I don't have the original game but I have some images to compare with the remake.<br/></p>\n<p>Now the title is \"Lost Island\", I think is more friendly and mysterious (but nothing original, hahaha) and the story is the same:</p>\n<p><strong>STORY:</strong><br/><em>1942, Pacific Ocean. 100 km south of Tokyo.<br/><br/>World War II is in full swing, the different sides struggle without cease. We belong to the Imperial Japanese Army Air Force and we are one of the best pilots, that is why we have been entrusted with a very important mission that can unbalance the balance in favor of the Axis Powers: destroy the Midway Atoll where Americans have a military base.<br/><br/>We go along with our squadron to the atoll when suddenly a thick fog out of nowhere surrounds us leaving us without visibility. The radio stops working and the electrical devices start to go crazy... After a few minutes of panic we lose the consciousness.<br/><br/>When we wake up we are in a strange beach surrounded by mountains that we had never seen...</em><br/><br/>I hope you enjoy!<br/></p>", "metacritic": null, "released": "2017-06-25", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/c55/c55e6883b126b3350dc03b0b58d742d3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 100, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["BlurredGames"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}