{"id": 112290, "slug": "techkoban", "name": "Techkoban", "name_original": "Techkoban", "description": "<p>Techkoban est un jeu reprenant les concepts du célèbre jeu sokoban dans son univers à lui. Il ne s'agit plus de déplacer des caisses comme bon nous semble, mais de les déplacer en prenant bien soin de ses déplacements. En effet, le jeu ajoute une fonctionnalité innovante, chaque déplacement crée un mur artificiel à sa dernière position ce qui rend le retour impossible.</p>\n<p>Dans le monde de TechKoban vous devrez déplacer des blocs pour les amener sur des capteurs et réussir le niveau. Le jeu est composé de 5 niveaux du plus facile au plus dur.<br/></p>\n<p>Attention, il n'y a pas d'aller-retour envisageable :)</p>\n\n<p>------------------------------------#-Commandes du jeu-#-----------------------------------------</p>\n<p>flèche du haut , flèche du bas, flèche de droite, flèche de gauche  pour se déplacer ou bien cliquer sur les flèches qui sont à droite de l'écran.</p>\n<p>échappe pour sortir des menus et entrée pour recommencer le niveau.<br/></p>\n\n<p>- Elève Premium de Gamecodeur  :  depuis la création de Gamecodeur.<br/></p>\n<p>- Langage et Framework utilisé : j'ai utilisé le langage lua et le framework love2d.<br/></p>\n<p>- Code par Pringles_Zombie sur ZeroBraneStudio / Graphismes par Pringles_Zombie  sur Gimp/ Musique et sons par Oursvince.</p>\n<p>- Utilisation de librairies et codes externes : Aucun<br/></p>\n<p>- Temps passé :  1 semaine, a peu près 48h de travail répartit dans la semaine.<br/></p>\n<p>- Comment as-tu (ou pas) abordé la contrainte du thème :  j'ai découpé le thème en grande partie :</p>\n<p>- Déplacer le joueur de manière fluide (avec une impression de mouvement, et pas de téléportation)  de case en case.</p>\n<p>- Afficher la map 32*32 en chargeant des fichiers textes.</p>\n<p>- Gérer la collision avec la map.<br/></p>\n<p>- Gérer la collision avec les caisses et les capteurs .<br/></p>\n<p>- Gérer les niveaux et les sons.<br/><br/></p>\n<p>- Petit postmortem : <br/></p>\n\n<p>   </p>\n<p>À la suite d'un laborieux et pénible travail, j'ai réussi la collision ce qui ma permis de trouver une fonctionnalité de mon jeu innovant par le fruit du hasard, tel que créer un bloc artificiel solide après le déplacement du personnage. Le bilan est qu'encore une fois grâce à cette GAMEJAM j'ai pu pratiquer mon code et les concepts que j'avais appris durant la formation de Gamecodeur, alors qu'au départ je n'étais pas du tout inspirer par ce thème dont je n'avais jamais joué. Je remarque qu'au fil des gamejams, je réalise le jeu de plus en plus vite et de mieux en mieux niveau code.</p>\n<p>La route pour devenir programmeur de jeux-vidéo se dessine de plus en plus ;)</p>\n<p>Merci Gamecodeur !</p>", "metacritic": null, "released": "2018-01-26", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/af6/af6ed9d19f83d4fe00eba73bc9dafa01.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 29, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["Pringles_zombie"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}