{"id": 112256, "slug": "blent-in-me", "name": "Blent in Me", "name_original": "Blent in Me", "description": "<p><em>it's for windows desktop only (for now). </em></p>\n<p><strong>Blent in Me</strong> is a short slow peace game made as submission for the Slime JAM. (<em>if you are going to rate this submission for the Slime JAM, please, download the v0.1 version since this was the version uploaded during the JAM. The v0.2 version was upload after the end of submissions, so it must not be considered for the JAM</em>)</p>\n<p>You are a micro-sized Slime who's trying to find its <em>Mother.</em></p>\n<p>You must collect cells around the map in order to keep yourself alive.</p>\n<p>It's simple like that.</p>\n<p>Use the arrows to move, but be careful, because there's almost no inertia to your movement and you may lost the chance to survive. Sometimes, though, you will want to be as fast as possible.</p>\n<p>There are 10 stages and a tutorial stage.</p>\n<p>If you die, you go back to the current stage you died. </p>\n<p>Please, give your feedback. It's very important for us.</p>\n<p>This is our third published game and personally the one I feel like is more well finished so far. Our main game Particles Hunter is the greatest and far more complex, but it's far from being considered \"finished\". I hope you enjoy and come back to see our next games.</p>\n<p>Credits:<br/></p>\n<p>Richallyson Lima - Level Design and Title Menu Design</p>\n<p>David Oliveira - Programming and Credits Design</p>\n<p>Maemi no Yume - Music and SFX</p>", "metacritic": null, "released": "2018-04-15", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/282/28239ae414bfa5a86fe92e870fde0995.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 5, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["PG311"], "genres": [], "publishers": [], "esrb_rating": null}