{"id": 112299, "slug": "scatter", "name": "Scatter (itch)", "name_original": "Scatter (itch)", "description": "<p>This game was created by kanatakkun and PyuPyu for the event McBacon Jam 4 in the rmnet~ Kanatakkun do the program thing and graphics, while PyuPyu did the world backing story and dialogues.) </p><p>==========</p><p><strong>BEFORE PLAYING <br/>Make sure you already install this font: C&amp;C Red Alert so the texts would appear normally.</strong></p><p><strong>-Story-</strong> <br/>____ is a nameless girl. She dreams of various stories, which she calls 'the flawless tales', and she had a 'happy' life in her 'room', doing nothing but dreaming and checking things inside her 'room'. <br/>However, slowly, the 'peace' is broken when some things appeared in her 'room', showing her the 'flaws' of her tales... <br/>Who on earth is ____? And what is the reason behind her 'room'?</p><p><strong>Warning: This game isn't recommended for those who are unable to make a clear distinction between reality and fantasy. </strong><br/></p><strong>-In this game...-</strong> <ol><li>Short duration (10-15 minutes, or even less) </li><li>Unique graphics, green-and-white being the only color in-game (but with some surprises...?) </li><li>Dark backstory </li><li>No hard puzzles </li><li>No battle processing </li><li>Blood + Body Horror (in sprite-sized and with mosaic, nothing too scary) </li><li>Not too many maps/area </li><li>Mentions and a scene about death </li><li>...A small room.</li></ol><p><strong>-Controls-</strong> <br/>Similar with other VX Ace games. <br/>Move: Arrow keys <br/>Confirm: Z/Enter/Space <br/>Cancel/Menu: X/Backspace *in this game, the menu is used only for saving purpose. There are no items, equips, or others. <br/>To title: Alt+F12</p><p>======== <br/>This game is inspired by many, many things. Some of them are folk tales, fairy tales, Kamisu Reina short novel series, Yume Nikki, Matryona's Last Night, my own games, and many more. Though this game is very short... Even so, I would like to say thanks (indirectly) to the awesome peoples who made them all!</p>", "metacritic": null, "released": "2017-05-01", "tba": false, "updated": "2019-08-28T23:24:17", "background_image": "https://media.rawg.io/media/screenshots/a59/a593dab2d0a3a7565621efd1efc96d10.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 59, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["kanatakkun"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}