{"id": 112318, "slug": "electric-rogue", "name": "Electric Rogue", "name_original": "Electric Rogue", "description": "<p><em>Electric Rogue</em> is a minimal first-person roguelike with 2.5D graphics and an abstract cyberpunk theme. There are 10 \r\nlevels, that can be completed in half an hour. The user interface is \r\nmade for touchscreen devices, and scales to any screen size, \r\nthough it's best viewed in 800x600 or so.</p>\r\nHow to play\r\n<p>On each level, retrieve the three keycards and bump into the \r\ncorresponding terminals to activate them. When you're done, return to \r\nthe transfer pad to continue. Don't waste moves! Once you're out of \r\ncycles, your noise starts growing. You can only tolerate up to 100 times\r\n the level you're on.</p>\n<p>On each level you're going to run into viruses that have infected \r\nthe system. Bump into them to fight; they're extra vulnerable when their\r\n lights are off. Overall, avoid them if you can. A useful tactical move \r\nis pressing the [X] button (or the spacebar) to wait a turn.</p>\n<p>Last but not least, every time you pick up a keycard, for the next \r\n15 moves or so you can chase down and kill viruses with impunity. But \r\ndon't go out of your way to do it unless you can spare the CPU cycles!</p>\r\nKeys\r\n<p>If you have a keyboard, the following work:</p>\n<ul>\n<li>WASD or the arrow keys for movement;</li>\n<li>Enter for the [O] (circle) button;</li>\n<li>Space for the [X] (cross) button.</li>\n<li>Escape for the menu button.</li></ul>\n<p>At the title screen, press left/right or up/down to toggle the \r\ncredits. During the game, the circle button toggles a statistics pane.</p>\r\nCredits\r\n<p>Font: Effects Eighty, by Peter Hull, available under the Open Font License.</p>\n<p>Music by TheWzzard, via Open Game Art.</p>\n<p>Sound effects by Little Robot Sound Factory.</p>", "metacritic": null, "released": "2017-12-15", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/6aa/6aa943f88bb0bbd163f0caf5b441f89a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 37, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["No Time To Play"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}