{"id": 112391, "slug": "patricks-cyberpunk-challenge", "name": "Patrick's Cyberpunk Challenge", "name_original": "Patrick's Cyberpunk Challenge", "description": "<p>Remove all 28 squares from the board in a neverending series of calm, randomized puzzles set in a dystopian, cyberpunk world.<br/></p>\n<p><em>Patrick’s Cyberpunk Challenge</em> is fun for all ages. Are you ready for the challenge? Feel free to leave your high scores in the comments below.<br/></p>\r\nInstructions\r\n<p>The object of the game is to move Patrick around the board and remove all 28 squares. Squares with coloured balls will remove extra squares and can make the puzzles trickier.<br/></p>\n<p>The puzzles are randomly generated, but you can also create your own puzzles or input puzzle codes made by others.<br/></p>\r\nControls<br/>\n<p>Move Patrick to available squares (highlighted in dark gray) by using the arrow keys or the mouse. Press Z (or C or N) or click the mouse to move him there and destroy the square you were on previously.</p>\r\nPuzzle codes\r\n<p>Puzzles are represented by the seven numbers in the top left corner. You can write down codes from interesting random puzzles you encounter, or make your own puzzles in the \"Custom\" mode and share the codes with your friends.<br/></p>\n<p>The codes are compatible with <em>Patrick's Challenge II</em>. You can also go to Reldni's<em> </em>website to find more codes and play hand-crafted Reldni puzzles.</p>\n<p> You currently have to use the mouse to place the objects in the correct squares manually, but I hope to have keyboard support soon so you can type in the codes. I also plan to add support for saving puzzles, so you can make your own (limited) run of puzzles to get a high score in.</p>\r\nCredits\r\n<p>This is a fanmade sequel to the 1998 freeware sensation <em>Patrick's Challenge II</em> by Reldni Productions, for the Cyberpunk-themed \"So bad it's good\" Jam 2018.</p>\n<p>The story is loosely based on events in Reldni's more famous game, Vinnie's Tomb, since the third part of the Vinnie's Tomb trilogy (which was never released) was going to feature Patrick in a supporting role. Read more in the devlog.</p>\n<p>The theme song is also very loosely based on the Vinnie's Tomb theme.<br/></p>\n<p>Website background image by GumballForAPenny.<br/></p>", "metacritic": null, "released": "2018-08-01", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/3ac/3acd2695dda6abe06d5f0c63a909aa1b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 110, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Web"], "developers": ["tobiasvl"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}