{"id": 112410, "slug": "troll-song-verse-one-completely-stoned", "name": "Troll Song: Verse One - Completely Stoned", "name_original": "Troll Song: Verse One - Completely Stoned", "description": "<p>\"Troll Song aims to tell the story of trolls as a people, a culture, a society. The trolls are under threat of extermination, but although they're big and strong, these trolls are no mindless brutes - they are a simple but honourable people with their own sense of morality and honour; a people who have feelings, who develop friendships; even a people who make music. Well, a sort of music... </p>\n<p>For the four trolls who manage to survive the attempted trollicide, it's not simply a matter of staying alive, or even a matter of revenge - for you see, to find out what their future can be, they first have to learn about their history - the very origin of their race. </p>\n<p>You play as Clod, one of the trolls who manages to escape. Using your trollish abilities, you must also help your remaining friends to escape. Before your journey continues you will find an unlikely ally, and along your path of discovery, you will find out that Clod is not just an ordinary troll... he has a destiny.\" </p>\n<p><strong>Game features:</strong></p>\n<p> -A very retro adventure game with some very modern features </p>\n<p>- Full voice acting </p>\n<p>- Full orchestral music score </p>\n<p>- An intriguing story split into 5 \"verses\" </p>\n<p>- A complete retelling of the origin story of the Troll race </p>\n<p>- Large variety of puzzle types </p>\n<p>- In-game hint system </p>\n<p>- Detailed animation with thousands of sprites </p>\n<p>-Lovingly crafted backgrounds </p>\n\n<p><strong><em>Sadly the big plans I had for the full game with the story of the trolls never came to completion.  I hope anyone who does play this first \"verse\" still enjoys it though!</em></strong></p>", "metacritic": null, "released": "2015-02-06", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/3cc/3ccfca31f4325066dad58ce6e5d49845.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 190, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["CaptainD"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}