{"id": 11255, "slug": "divided-we-fall", "name": "Divided We Fall", "name_original": "Divided We Fall", "description": "<strong>Divided We Fall</strong> is a <strong>close-combat multiplayer</strong> game with <strong>team-driven</strong> strategy at its core set in various battlefields of the Second World War.<br/><br/>Command your squad through <strong>WW2</strong>, form well thought-out <strong>battlefield tactics</strong> and execute them effectively to ensure your path to victory. <br/><br/>Hone your skills in fast paced 1 vs 1 <strong>real-time battles</strong>, or join battles with up to 15 soldiers per side (bringing 120 soldiers in total), each will require a great amount of planning, co-operation and teamwork. <br/><br/>Become a <strong>commander</strong> by being the highest ranked player of a team, devise an overall battle plan for your team and assign weapons to your soldiers through an <strong>in-game board interface</strong>. <br/><br/>To achieve victory as a commander on the battlefield, you must make effective use of terrain to provide cover for your troops, create deadly kill zones and ambush the enemy. Success hinges on the tactics formed during the planning phase, the effective teamwork between each other and the  individual execution of the chosen tactics during combat. <br/><br/>Forge strong bonds of brotherhood in this intense multiplayer combat, for Divided We Fall…<br/><br/><strong>Key Features</strong>:<br/>●\tIntense real-time battles where teamwork is the key to victory<br/>●\tClose quarter combat with tactical manoeuvring and ambushes<br/>●\tSquad-based action combined with team play that has a clear military chain of command<br/>●\tCompete with your clan via ranking systems, leaderboards and competitions<br/>●\tCommand your fire team successfully and strive to become a general<br/>●\tUse the World War II terrain to your advantage; provide cover for your troops and create deadly kill zones and ambushes.<br/><br/>Make sure to follow us on  Twitter @Kava_GameStudio and talk with us via Discord", "metacritic": null, "released": "2014-10-17", "tba": false, "updated": "2019-11-22T05:09:44", "background_image": "https://media.rawg.io/media/screenshots/b9f/b9fd0c7aa245ebd635efc0c072e9bcad.jpg", "website": "http://dividedwefall.co", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 121}, "playtime": 1, "achievements_count": 11, "ratings_count": 3, "suggestions_count": 478, "game_series_count": 0, "reviews_count": 3, "platforms": ["iOS", "macOS", "PC", "Linux"], "developers": ["Hosted Games", "KAVA Game Studio"], "genres": ["Action", "Adventure", "RPG", "Strategy", "Indie"], "publishers": ["Hosted Games", "KAVA Game Studio"], "esrb_rating": "Teen"}