{"id": 112676, "slug": "ghost-knight-victis-agdg-demo-day-18", "name": "Ghost Knight Victis - AGDG Demo Day 18", "name_original": "Ghost Knight Victis - AGDG Demo Day 18", "description": "<p><em>Ghost Knight Victis is an action RPG about a terminally-ill superhero fighting against an invasion of Lovecraftian horrors.</em></p>\n<p><em>The catch is that his health deteriorates every time he uses his powers. As the player, you need to ensure the main character stays alive until the end of the year, when the final boss appears.\r\n</em></p>\n<p><em>Inspired by the henshin hero genre (Karas, Kamen Rider, Garo, etc.), you play as a guy whose terminal disease awakens dormant powers, letting him transform into magical armors and fight monsters.\r\n</em></p>\n<p><em>You'll also need to maintain your secret identity to prevent endangering your friends. But standing with you are individuals who are in the same predicament.</em></p>\n<p><strong>This is only the combat prototype for now. </strong><strong>Please try it out and leave feedback!</strong></p>\n<p>This is a <strong>minor update</strong> since I slowed down the pace of development during the holidays. If you've already tested the previous Demo Day 17 build, you won't notice much different.<br/></p><p>Changes (since last AGDG Demo Day release):</p>\n<ol><li>Added improved targeting controls for those using keyboard &amp; mouse: Q and E cycles through targets (E for next target, Q for previous target). F will release target lock. If your mouse has back and forward buttons, those work as well for cycling targets. Note: these are only intended as the default controls. There will be control bindings customization in the future.</li><li>Updated the art for the player's health and stamina bars in the GUI.</li><li>Attacking through walls is now prevented. This is for both enemy and player.</li></ol>\n<p>Notes:</p>\n<ol><li>Monitor switching in-game currently doesn't work since it was relying on an undocumented feature that broke (technical details here). For now, to change the monitor used, you'll have to pass the command line argument \"‑adapter N\", where N is the monitor number, to the game's exe file (note: this only works in Windows).</li><li>Gamepad is recommended! But keyboard and mouse works too.</li><li>There are no optimizations yet. There are toggles for the graphical effects, but they are there more for your personal preference. If you're running the game on a toaster, consider yourself warned. Try running the game in a low resolution (640x480 if need be).</li><li>There's nothing much to do yet except kill the enemies. This is only a test for the combat part.</li><li>There are no unique combo strings. Attacks in this game work more similar to Dark Souls, and not God of War.</li><li>I know the impression right now is that there are not a lot of attacks. There will be more variety of attacks you can perform in future versions of the game, as I implement more features (more spells, a 2nd armor type with its own set of weapons).</li><li>Some people do not understand how the stamina bar works. In the future I may add a simple tutorial to explain this.</li><li>You will die quickly if you allow yourself to be surrounded. This is intentional.</li><li>Can't customize control bindings yet, but it will be added.</li><li>There are no sounds yet.</li><li>The difficulty right now is not yet representative of the final goal. Attack animation speeds, enemy AI, damage values, and stamina costs are continually subject to tweaks/balancing.</li></ol>\n<p>Follow latest updates on my dev blog: http://hypertensiongamedev.tumblr.com/</p>", "metacritic": null, "released": "2018-01-06", "tba": false, "updated": "2022-12-17T09:20:35", "background_image": "https://media.rawg.io/media/screenshots/293/2934b3718139ea5e7462bbbf9bc5df87.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 215, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "macOS", "Linux"], "developers": ["Anomalous Underdog"], "genres": ["Action"], "publishers": [], "esrb_rating": null}