{"id": 112675, "slug": "polyomi", "name": "polyomi", "name_original": "polyomi", "description": "<p>Polyomi is a procedurally generated puzzle game with a modular music soundtrack ...<br/></p>\n<p>... It's like Minesweeper, using shapes and colors.</p><p>It's written in Flash (AS3). Play directly in your browser, above.</p>\n<p>This began as a small experiment for Ludum Dare 19 (\"Discovery\"), and after the compo, it evolved into something more complex. Most of the development happened over a few months in 2011, but then I got distracted by other things in life, and the game sat neglected at 95% done for years.</p>\n<p>4 years later ... I still like the game design, so I thought I'd take to 100% and publish it before Flash dies off entirely. For the impatient, the Konami code will unlock all the levels, but the game is less confusing if you follow the normal unlock order.</p>\n<p>My brother designed the music to fit within 10 MB and the limitations of the Flash sound system. We went through many failed experiments before finding something that works. Some of the music has low-frequency (50 Hz) synth beats that may not be audible on some speakers, so use good headphones.</p>\n<p>The mp3 download below has two albums:</p>\n<ul><li>parts from polyomi (13 tracks, 11:15). This is the tracks that are embedded into the game.</li><li>music from polyomi (22 tracks, 20:27). This is a recreation of the music synthesized by the game from the parts, plus two bonus tracks from earlier music experiments. The music in the game loops seamlessly, but the mp3s won't without a special player.</li></ul>\n<p>I might rewrite Polyomi for mobile sometime. I suspect this will work better as a mobile game, because one unit of playtime is just a few minutes, but earning all the medals will take hours, and there are still things to do beyond that. But at the moment I feel, \"done, yay!\" and I should move on to something else.<br/></p>", "metacritic": null, "released": "2015-08-25", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/a2e/a2e93a4950e6e5486db31a7916fec6e6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 28, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["dognebula"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}