{"id": 11263, "slug": "fortresscraft-evolved", "name": "FortressCraft Evolved!", "name_original": "FortressCraft Evolved!", "description": "\"In a world where early access and indie usually means abandoned, unfinished garbage, this game's post launch development is outpacing many AAA titles and companies.\"<br/><br/>\"This really isn't the same game that I originally purchased anymore. With all the changes that have been made over that duration the game is so much more fun <br/>now that there are machines to alleviate almost every large build annoyance that used to exist.  The FALCORs, thieves, excavators, drills etc.. all did so much for <br/>automation it's almost hard to believe I ever did that stuff manually before.\"A Whole New Survival Experience...<br/><br/><br/><strong>FortressCraft has undergone a radical visual alteration, completely reworking the surface, along with a brand-new rendering system. On top of that, there is an enormous amount of work to make the game more understandable and accessible for new players. The combination of these two things should work towards making it feel like a fresh, new experience.  Prepare for a new exploration and survival experience!<strong><br/><br/><strong>FortressCraft Evolved’s Survival Mode</strong> is a unique-blend of Voxel Landscapes, Tower Defense, Crafting, Logistics, Exploration, Combat and Assembly lines. Players begin by crash-landing on a strange alien world, left with only a small handful of starting machines. Using hand-held scanners they must locate ore resources, place down Ore Extractors and Conveyors to automate the raw material back to the Smelter; take the fresh ingots through multi-machine assembly lines, followed by researching new technologies that help them explore thousands of meters below the planet's surface. <br/><br/>An advanced HoloBase allows players to keep an eye on their factory which they must defend against waves of alien attacks with multiple tiers of missile and energy turrets. To survive they must continue to develop new and unique power systems, from solar energy to Jet Turbines, culminating in crafting an Orbital Energy Transmitter thousands of cubic meters in size, to beam power off-planet, and start the next phase of the game. <br/><br/>And all this with an enormous draw-distance, scalable gameplay engine that is equally at home on high-end or low-end computers, and full multiplayer support! This does not even factor in all that you can do in the Creative Mode whose only limits are your time and imagination. With an array of Super Build Tools and a high-resolution Custom Detail Block Workshop players can build anything and on a massive scale unseen in other games.<br/><br/><ul class=\"bb_ul\"><li>Experience the largest worlds ever seen in any computer game - ever! <br/></li><li>Create a futuristic mining operation consisting of thousands of huge machines. <br/></li><li>Full Tower-Defense style combat in a voxel universe. <br/></li><li>Use hi-tech machinery to locate and process resources from thousands of meters away. <br/></li><li>Explore thousands of metres vertically, overcoming ever-more difficult challenges.<br/></li><li>Official Texture Pack and Mod Pack support<br/></li><li>State of the art lighting and shadowing, utilising high resolution maps for machinery and environment<br/></li><li>Innovative“Build to Me” Feature to facilitate rapid, accurate building<br/></li><li>Shareable Creative Schematics<br/></li><li>Super Build Tools  allowing instant creation of primitive shapes </li></ul></strong></strong>", "metacritic": null, "released": "2015-11-09", "tba": false, "updated": "2023-04-27T16:20:50", "background_image": "https://media.rawg.io/media/screenshots/436/436209118fd9fc8dbc3942dcc5373834.jpg", "website": "http://fortresscraft.com", "rating": 2.88, "rating_top": 3, "added_by_status": {"yet": 7, "owned": 291, "toplay": 1, "dropped": 11}, "playtime": 3, "achievements_count": 86, "ratings_count": 17, "suggestions_count": 444, "game_series_count": 0, "reviews_count": 17, "platforms": ["macOS", "PC", "Linux"], "developers": ["ProjectorGames"], "genres": ["Adventure", "RPG", "Strategy", "Simulation", "Casual", "Indie"], "publishers": ["Digital Tribe"], "esrb_rating": null}