{"id": 112630, "slug": "space-rush", "name": "Space Rush", "name_original": "Space Rush", "description": "<p>Build your space base! Defend it against the pirates that want to steal your minerals.</p><p>Start with nothing, but a Solar Station, build your base and fill the entire universe with structures!</p><p>Features:</p><p>Wave Mode-the universe is blessed with an infinite asteroid, which you can mine and defend your base at the same time.</p><p>Survival Mode is the basic survival that we know. Just hold on as long as you can!</p><p>Missions mode is like a campaign, you will be given different types of missions, can be to mine an asteroid, repair a ship, destroy an enemy pirate ship, and more.</p><p>The video shown is outdated.</p><p>Structures</p><p>Randomly generated universe.</p><p>There are 10 different structures.</p><p><strong>Energy Link</strong> - used to link energy from one place to another.</p><p><strong>Mineral Extractor</strong> - used to extract minerals from nearby asteroids.</p><p><strong>Repair Station</strong> - repairs nearby structures, can spawn drones if you have the research.</p><p><strong>Energy Plant</strong> - must be built near Solar Station, boosts energy production.</p><p><strong>Turret, Laser DT, Sentry, Missile Launcher</strong> are defensive structures.</p><p><strong>Mineral Storage</strong> - increases your maximum capacity of minerals.</p><p><strong>Generator </strong>- splits the energy at the generator, all structures will be linked to this structure, this works like a second Solar Station.</p><p>Details:</p><p>Keyboard shortcuts:</p><p>B-open build menu</p><p>M-open ingame menu to save,load etc.</p><p>Mouse drag-move the camera</p><p>left click-select a structure</p><p>0-9 =&gt; select structures</p><p>Mouse wheel- zoom up and down</p><p>Dragging a structure up in the build menu will select all the structures of that type.</p><p>Right click - cancels current structure build</p><p>There is a demo version. It is very limited, you can't play Wave Mode or missions, you can't build all the structures or upgrade/research them. Buy the full version and support, to take this game to the next level!</p>", "metacritic": null, "released": "2015-03-01", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/322/3228166530e7bbd0fc0e82a6c9d3082d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 44, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Morseton"], "genres": [], "publishers": [], "esrb_rating": null}