{"id": 112792, "slug": "you-blink-you-lose", "name": "You Blink You Lose", "name_original": "You Blink You Lose", "description": "<p>http://thechosengames.com<br/></p>\n<p>Build  different towers and upgrade them and escalate their platforms to create a strategical defanse against enemies. Do whatever it takes to kill them because trust me, you don't want them to summon their leader.<br/><br/>Controls:<br/>WASD for camera movement, Hold LMB to look around, ctrl to go down, space to go up and double click on platforms to build towers, upgrade them, escalate towers and change their aggro.<br/><br/>****Attention****<br/>We received a feedback about a bug where clicking \"play again\" when the game is over may \"break\" the game. So please restart the game if that happens. Thank you for playing our game and your patience.<br/>******************<br/><br/>Game Instructions:<br/>Double click on blue platforms to build your towers and defend against the waves. Double click on platform with turret again to upgrade your towers as the waves will get stronger each wave. You can also change tower aggros from there.  Spawn point will change on certain waves so escalate your towers to adjust your defence.<br/><br/>Trello link to see our progress throughout the jam. We will continue to develop this game and you can see changes to be made in the future here. Feel free to share your thoughts and ideas with us.<br/>https://trello.com/b/bnJ7YVJl<br/><br/><br/></p>\n<p>Team Name<br/>The Chosen Games</p>\n<p>Team Members</p>\n<p>Doğa Uysal <br/>Deniz Can Erdem Yılmaz<br/>Azmi Utku Sezgin<br/>Barış Şahin<br/>Mustafa Bahadır Kara</p>\n<p>Used Assets:<br/>Particle Effects are from InfinityBlade Effects<br/>Crystal Image -&gt; StarCraft2<br/>All the Sound effects are from Soundly</p>\n\n<p>Feel free to contact us about anything :)<br/>support@thechosengames.com</p>", "metacritic": null, "released": "2018-08-21", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/112/112b689700ac2e51d7e479b4a4e7387e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 15, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Layso", "Apocarteresis", "GODcha"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}