{"id": 112871, "slug": "concave-shooter", "name": "Concave Shooter", "name_original": "Concave Shooter", "description": "<p>\r\n\t Basically a twin stick shooter, with some weapon options and different enemies. It gets harder and harder until you die, so there is no end goal except getting higher scores. (and unlocking the last gun- currently ricochet gun) <br/>\n<br/>\r\n\tWhy \"concave\" in the name? Because I am trying lots of different difficulty curve functions with most of them being concave. \r\n</p><p>\n<br/>\n</p><p>\n</p><p>\n<br/>\n</p><p>\n<strong>Instructions</strong>\n</p><p>\n<strong><br/>\n</strong>\n</p><p>\n<strong>Basic</strong>\n</p><p>\r\n\tWASD to move<br/>\r\n\tMouse Wheel or 1-2-3-4-5 to change weapons.<br/>\r\n\tLeft click to shoot, right click to teleport to mouse's location.\r\n</p><p>\n<strong>Goal</strong>\n</p><p>\r\n\tYou cant win this game. But maybe unlocking the last weapon -currently ricochet gun- is a good target to reach. You will hear a pickup sound when you unlock a new weapon by killing enemies. The enemies gets a bit faster and more numerous with each enemy you kill, so surviving until eternity is not possible.\r\n</p><p>\r\n\tDifficulty and weapon unlocks only got updated with the enemies you kill, not by environmental hazards (e.g explosions). With that in mind, try to increase your high score.\r\n</p><p>\r\n\tCurrent highscore is 25000, from my friend Nactuam. Let me know if you can beat him.\r\n</p><p>\n<strong>Weapons</strong>\n</p><p>\r\n\tThe only interesting weapon is sword when it comes to usage. Ever played fruit ninja on mobile? Sword works exactly like that. Click and drag to swing. You cant swing all day long, so release after a while. The harder you swing, the bigger your swing's trail will be.\r\n</p><p>\r\n\tShotgun is a low range weapon. It is an old shotgun, so it is heavy.\r\n</p><p>\r\n\tMachine gun is a conventional gun, that lets you take full control of topdown shooting mechanisms.\r\n</p><p>\r\n\tPlasma gun has piercing ammo. But the weapon itself is really heavy.\r\n</p><p>\r\n\tRicochet bullets can kill you. Be careful.\r\n</p><p>\n<strong>Credits</strong>\n</p><p>\r\n\tArt: Me &amp; Seyacim\r\n</p><p>\r\n\tProgramming: Me\r\n</p><p>\r\n\tMusic: Replay</p>", "metacritic": null, "released": "2016-11-04", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/2b9/2b93b98e4ea8f6d8dd2662dcd0f1f463.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 41, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["zulmetefza"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}