{"id": 1129, "slug": "100ft-robot-golf", "name": "100ft Robot Golf", "name_original": "100ft Robot Golf", "description": "Never get your ball stuck behind a pesky tree or skyscraper ever again! 100ft Robot Golf is a fast-paced arcade golf game where you get to control impossibly large robots on their quest for par. Just swing your golf club to smash even the tallest buildings out of the way - or into the way of your robot golfing buddies.<br/><br/>Up to four players can hit the greens, cities, mountains and orbiting moons that comprise the Robot Golf Tour Circuit. Either split-screen or online, budding robot golf pilots can play frantic real-time golf, classic turn based action, or even custom rulesets crafted for your own custom Robot Golf round!<br/><br/>Looking for something solo? 100ft Robot Golf's unique campaign mode reveals the real stories and experiences of today's robot golf pilots. Experience the excitement, romance, and thrills of controlling one hundred feet of raw golfing power through some of the cheapest '90s-inspired mecha animation ever committed to screen.<br/><br/>GAME FEATURES<br/><ul><li>It's 100 foot robots playing golf.<br/></li><li>Play with up to four robot golfers, either split screen or online, in real time.<br/></li><li>Fully voiced in-game commentary from \"My Brother, My Brother and Me\" hosts Justin McElroy, Travis McElroy, and Griffin McElroy.<br/></li><li>Destroy any obstacle to clear a path to par - or hinder your opponents shot.<br/></li><li>Unique solo campaign mode tells the excitement, love, and intrigue of the Pro Robot Golf circuit through '90s-style budget cutscenes.<br/></li><li>Play in cities, on the moon, under the ocean, and more!</li></ul>", "metacritic": null, "released": "2016-10-10", "tba": false, "updated": "2022-09-30T00:42:24", "background_image": "https://media.rawg.io/media/screenshots/568/5688d054db7fe497a2107ddfa4d05594.jpg", "website": "http://100ftrobot.golf", "rating": 3.08, "rating_top": 4, "added_by_status": {"yet": 1, "owned": 102, "beaten": 2, "dropped": 10, "playing": 1}, "playtime": 2, "achievements_count": 56, "ratings_count": 12, "suggestions_count": 446, "game_series_count": 0, "reviews_count": 12, "platforms": ["PlayStation 4", "PC"], "developers": ["No Goblin"], "genres": ["Action", "Sports", "Fighting", "Indie"], "publishers": ["No Goblin"], "esrb_rating": "Everyone 10+"}