{"id": 112920, "slug": "mr-cando-5-minute-exorcist", "name": "Mr. Cando: 5-Minute Exorcist", "name_original": "Mr. Cando: 5-Minute Exorcist", "description": "<p><strong>Mr. CanDo: 5 Minute Exorcist </strong>is a two-player, asymmetrical multiplayer game where you play either as Mr. CanDo, the most affordable exorcist, or his ghostly rival Old Man CanNot.The twist? Neither player can see the other. Both players look for clues to their rival's presence whilst also carrying out their objective.As Mr. CanDo, use your flashlight and homemade traps to weaken Old Man CanNot's hold on his lifelong home and ultimately capture the poor soul in a device totally not ripped from Ghostbusters. As Old Man CanNot, defend your home and precious collection of taxidermy from the heartless menace known as Mr. CanDo. Scare the two-bit exorcist out of your humble abode with your arsenal of taxidermy-themed traps and copious amounts of ghostly goo. Mr. CanDo: 5 Minute Exorcist is an exciting and silly experience for anyone who enjoys whimsy and wonder.</p><p><strong>Team story:</strong> Student projects often never come to fruition. They start out strong, full of enthusiasm, but, as time goes on, team members lose interest in the project or simply get bogged down by course work. Fortunately, the minds of Legendary Bonbons did not fall victim to this phenomena. Six DePaul seniors set out to create something quirky. Something…spoopy. 20-odd weeks later and many late nights filled with caffeinated beverages, Mr. CanDo: 5 Minute Exorcist emerged from the depths of a Frankensteinien laboratory (one of our horrendously tiny apartments) and, to this day, never fails to elicit childish laughter and the high-pitched cries of \"God Darnit, [Insert Friend's Name Here]!\"</p><p><strong>Created by: </strong>Legendary Bonbons<br/></p><ul><li>Ray Bach: Art</li><li>Jack Campbell: Sound</li><li>Lukas Nicola: Design</li><li>Tommy Tomsovic: Code</li><li>David Wales: Code</li><li>Ruth Williams: Art &amp; Producer</li></ul>", "metacritic": null, "released": "2016-05-28", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/269/269245baf1aa3ea310222bf1564bb01e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 94, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["legendarybonbons"], "genres": [], "publishers": [], "esrb_rating": null}