{"id": 113030, "slug": "project-zed", "name": "Project Zed", "name_original": "Project Zed", "description": "Hell is on earth! A gateway from hell has opened killing off 90% of humanity and forced to walk the earth, the others like me have found a way to harness hell's wraith and summon different wraith abilities. Its up to you to survive and stop this nightmare, how long will you survive.<br/><p>---------------------------------------------------------------------------------------------------------- </p><p>Welcome to my testing grounds! This project is being created in Unreal Engine 4 using very basic assets and very minimal gameplay right now. Files are big due to management issues so have to use google to upload the game to sorry but I insure its safe, will fix this soon.</p>Current Features<p>Fight the dead with different spells, level up to gain new powers, eat and drink to stay alive but watch out if you get infected you'll lose condition so stay by the campfire when that happens to gain back.  <br/></p><p><strong>Changed and added alot which changes combat and feels alot better. Please goto main site listed below to see News.</strong></p>Controls<p>W/A/S/D = Walk and Strife</p><p>Mouse = Look Up/Down/Left/Right</p><p>Tab = Inventory (If you exit inventory and get stuck press right click on screen)</p><p>Left Shift = When held sprint, drains stamina</p><p>Q = When held while sprinting you drain mana and double max run speed. Must be level 4 to enable Mana Sprint</p><p>Spacebar = Jump, drains stamina jump higher while sprinting</p><p>Left CTRL = Toggles  drains stamina as a crouch stealth footsteps</p><p>E = Interact, pickup, search</p><p>F = Toggles flashlight on/off set intensity when battery drains to low flashlight dims.</p><p>Left Mouse Button Click = Cast magic abilities which does damage and drains mana, fire weapon</p><p>P = Pause Menu - Pause, Quit, Video options</p><p>B = Level, EXP, Ammo Pool Hud </p><p>Q = Drop Weapon</p><p>Right Click = Zoom with Weapon</p><p>R = Reload</p><p>C = Kick - This is a basic attack</p><p>Middle Mouse Button = Pistol Whip - Pistol must be equipped </p><p>Mouse Scroll Up&amp;Down = Power Ability Switch ( Levels 3+ Fireball  -  Levels 5+ Life Drain  -  Levels 8+ Heal ) Must be appropriate levels to switch powers. Icons appear on bottom left. </p><p>If you stand next to campfire you regain condition.</p><p>Note: If  trying to heal you must first use Life Drain first to Leech life from Zed then you have 30 seconds to use heal for a small amount of health. Ammo added now spawn in world, each case has different amounts of ammo, Only pistol ammo exists as of now. </p><p>Updated May-8-2017</p>For more details please see website http://oldhammichael.wix.com/onivisionstudios <p>Very proud to announce that the problem has seemed to fixed itself and I can now package project once again. These updates that are there are very old and I have much to do to make so much better. While this stopped woring I did not and contin</p>----------------------------------------------------------------------------------------------------------Note: Also this is not a game just my own testing project and any assets or tutorials used are not credited yet. Any questions or comments please feel free and pm me. Donations are greatly appreciated and go towards Assets, content, and anything I can get to improve gameplay<br/> <br/>", "metacritic": null, "released": "2015-07-27", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/de9/de91509d8420a618563e396020016963.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 453, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["onimike"], "genres": ["Action"], "publishers": [], "esrb_rating": null}