{"id": 113024, "slug": "the-putting-challenge", "name": "The Putting Challenge", "name_original": "The Putting Challenge", "description": "Background\r\n<p>Made for a university project I recreated the popular mini golf games currently popular on steam.</p>\n<p>The game uploaded is about 90% similar to the game I handed in for my assignment, the only difference was removing references to my personal information and added controller support which the original didn't contain.</p>\n<p>Because the game is mostly a proof of concept created under limited time, I wasn't able to get everything done a full game would such as game settings and a decent UI.</p>\n<p>I will potentially further development on this project in the future.</p>\r\nFeatures\r\n<ul><li>Four holes</li><li>Controller Support (Tested and works on Xbox One Controllers)</li><li>Birds eye view camera</li><li>A windmill</li><li>You get cheered at for a good score</li><li>You get booed at for a bad score</li></ul>\r\nKnown Bugs\r\n<ul><li>Terrible UI (Not necessarily a bug just a warning)</li><li>Length of the line for aiming can bug</li><li>Problems when you switch inputs in the middle of a shot</li><li>No game settings (Again more of a warning than a bug)</li></ul>\r\nFuture Plans\r\n<p>The Putting Challenge was a concept mini golf game I created in a short span of time the project was intended to be only developed in a 12 weeks.</p>\n<p>I have more plans and ideas to develop this project into a full game such as multiple 18 hole courses and more game modes other than golf.</p>\n<p>However, for now I have to move on.</p>\r\nFinal words\r\n<p>If you decide to play this game it would be very appreciated if you were to give constructive criticism in the comments, this is dire as it will make me a better developer in the future.</p>\n<p>If you come across any bugs please tell me so I know what needs to be fixed.</p>\n<p>Thank you for looking at my page, this is my second fully playable game I've released out onto the world and I hope you consider giving the game a try.</p>\n<p>Website<br/>Youtube<br/>Discord</p>\r\nMore from TweekPC\r\n<p>Desert Intelligence</p>", "metacritic": null, "released": "2018-05-15", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/481/481b5f0d3ef032e0581d3387d05f3837.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 89, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["TweekPC"], "genres": ["Sports"], "publishers": [], "esrb_rating": null}