{"id": 113045, "slug": "horrogue", "name": "horrogue", "name_original": "horrogue", "description": "Ver1.10: Added the Boss Fight and Win screen.<br/>Ver1.06: Fixed the bug about gate of hell.<br/>Ver1.05: Added the VIT, INT, LUK, SPD and VIS.<br/>Ver1.04: You can morph into a wolf girl.<br/>Ver1.03: Added the Item \"Rosario\".<br/>Ver1.02: Added the Trap \"Tomb Stone\".<br/>Ver1.01: Changed the BGM.\r\nhorrogue is a casual roguelite action game.\r\n<p>The dungeons are made with the procedural generation.<br/>You can play the different maps every times.<br/>If you get the crystals or items, you will be able to strengthen the character.<br/>Go to the gate of hell. Defeat the boss monster!<br/>Now it's beta.<br/>I will develop more. I want to improve this game.<br/>Please let me know what you think.</p>\r\nDodge the ghosts, avoid the traps and pick a key.<br/>If you have a key, you can open the door to the next floor.<br/>On the full moon of the night, you can defeat the ghosts.<br/>Get the crystals and items and strengthen your character.<br/>Go to the gate of hell. Defeat the boss monster!\r\nHow to play\r\n<p>You can't attack the enemies. You can only run away.<br/>But on the full moon night, you morph into a wolf girl.<br/>The wolf girl can eat the normal ghosts.<br/>You can strengthen your character.<br/>If your health bar become zero, game is over.</p>\n<p>Move: Arrow Keys or ASWD keys.<br/>Pause: P Key.<br/>Back to Menu: L Key.<br/>Some Buttons(Start, back to menu, pause): Mouse Click. </p>\r\nKey and Door\r\n<p>There is one key and one door in each floor.<br/></p>\r\nEnemy\r\n<p>RedGhost: Normal enemy. <br/>If you get close to it, you will be attacked. <br/>If you are attacked, your health bar will decrease and your field of view will decrease temporarily.<br/>If you reach more floors, they will increase.<br/><br/>YellowGhost: Normal enemy. <br/>If you get close to it, you will be attacked. <br/>If you are attacked, your health bar will decrease and your field of view will decrease temporarily and your walk speed will decrease temporarily.<br/>If you reach more floors, they will increase.<br/><br/>PurpleGhost: Normal enemy. <br/>If you get close to it, you will be attacked. <br/>If you are attacked, your health bar will decrease and your field of view will decrease temporarily and poisoned temporarily.<br/>If you reach more floors, they will increase.</p>\n<p>Zombie: Normal enemy.<br/>If you get close to it, you will be attacked and zombie will disappear.<br/>If you are attacked, your health bar will decrease and your field of view will decrease temporarily.</p>\n<p>BigSkelton: Boss enemy. <br/>If you dawdle away your time, it will come.<br/>If you are attacked, your health bar will decrease and your field of view will decrease temporarily.<br/>If you reach more floors, it will come sooner.</p>\r\nTrap\r\n<p>Spears: If you touch them, your health bar will decrease.<br/>Poisons:If you touch them, your health bar will decrease slowly.<br/>Tomb Stone:If you touch them, it will spawn a zombie.<br/>Electric: If you touch them, your speed will decrease temporarily.</p>\r\nTreasure Box\r\n<p>You can open the treasure box. There is one treasure box in each floor.<br/>Heal potion: Your health bar will increase.<br/>Cure potion: Your health bar will increase and detoxicate.<br/>Lantern: Your field of view will increase in the floor. But if you are attacked by enemies, your field of view will decrease.<br/>Rosario:  You will be invincible temporarily.<br/>Moon Fragment: The age of the moon will advance.<br/></p>\r\nMorph\r\n<p>You can morph into a wolf girl on the full moon. The wolf girl can eat normal ghosts.<br/>If you go to next floor, the age of the moon will advance. And if you get a moon fragment from the treasure box, the age of the moon will advance.</p>\r\nStatus\r\n<p>You can get a VIT crystal or INT crystal or LUK crystal at the church every floor.<br/>You can get a SPD shoes or VIS  glasses in the well every floor.<br/>VIT: Decrease the damage, increase recovery amount of the potion etc.<br/>INT: Decrease the time of poisoned and numbass. Increase the time of invincible.<br/>LUK: Increase the chance of the moon fragment from the treasure box. Delay the boss skelton appear.<br/>SPD: Increase the speed.<br/>VIS: Decrease the time of darkness when attacked. etc.</p>\r\nBoss Fight\r\n<p>If you enter the gate of hell, you can't return till you defeat the boss monster.</p>", "metacritic": null, "released": "2017-09-05", "tba": false, "updated": "2019-08-28T23:24:14", "background_image": "https://media.rawg.io/media/screenshots/eb9/eb92e71c40f9a0405c21304b8f1dcc05.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 133, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["UMINEKO STUDIO"], "genres": ["Action"], "publishers": [], "esrb_rating": null}