{"id": 11313, "slug": "grav", "name": "GRAV", "name_original": "GRAV", "description": "<p>GRAV is an indie action sandbox exploration title developed by BitMonster, Inc.</p>\n<h3>Gameplay</h3>\n<p>The game does not feature any plot whatsoever. The players start the game by creating their own character, after which they are put onto a procedurally generated planet. The in-game worlds are highly dependent on environmental events.</p>\n<p>The game does not have any objectives, as the developers focused on creating a true sandbox experience. The players are given the opportunities to do whatever they like. Using these opportunities, the players can create their own stories and even characters to role play.</p>\n<p>The game features a sophisticated crafting system. Anything the player finds or kills can be used as a crafting material. There is no need to know the recipe, as they are suggested to the players by the game itself. Anything can be crafted, from armor and weapons to vehicles and buildings. GRAV features an advanced building system, which allows the players to use a basic base they are spawned next to as a starting point to expand on and build massive cities.</p>\n<p>The players can come into the game&#39;s dungeons, which are also procedurally generated, where they can find new crafting materials, weapons, or even vehicles. </p>\n<h3>Multiplayer</h3>\n<p>The game supports up to 64 players per server. The players can create alliances between themselves or engage in an all-out war. The game is highly moddable, and a number of community created mods are up and running on several game servers.</p>", "metacritic": null, "released": "2015-01-08", "tba": false, "updated": "2023-06-20T14:53:26", "background_image": "https://media.rawg.io/media/screenshots/74c/74cee7e8901db389e699454964207719.jpg", "website": "http://bitmonstergames.com/?page_id=1004", "rating": 2.4, "rating_top": 1, "added_by_status": {"yet": 62, "owned": 1045, "beaten": 6, "toplay": 2, "dropped": 40}, "playtime": 2, "achievements_count": 0, "ratings_count": 47, "suggestions_count": 428, "game_series_count": 0, "reviews_count": 47, "platforms": ["PC"], "developers": ["BitMonster"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["BitMonster"], "esrb_rating": null}