{"id": 11310, "slug": "overfall", "name": "Overfall", "name_original": "Overfall", "description": "Overfall is a fantasy role-playing game of rough diplomacy and tough action. Explore, negotiate, and fight your way across the high seas! <br/><br/>You will lead two heroes on a journey across the high seas in search of their lost king. You will encounter people of all breeds and all creeds; ally with them or crush them without mercy. You will face many dangers; survive them and you may unlock new characters, weapons and skills. In a world where death is permanent, you must return to the beginning and make a fresh start. The heroes you choose, the weapons you unlock and a world that is randomized mean that no two adventures will ever be the same. Key Features <ul><li> A huge, dynamic world to explore, ruled by a number of races in constant conflict - it’s up to you to help or betray them<br/></li><li> Challenging and addictive turn-based combat - careful strategy and cunning skill combinations are the key to victory against your foes!<br/></li><li> Permanent hero death, procedural world generation, and high replay inspired by classic roguelikes<br/></li><li> Interactive story encounters where the choices you make and the allies you recruit ensure no two journeys are quite the same<br/></li><li> Unlock new classes, weapons, trinkets and skills as you progress in the game<br/></li><li> Beautiful hand-drawn art of of 9 player characters, 36 combat companions, 80+ enemies, 80+ NPCs, and 100+ locations</li></ul>", "metacritic": 71, "released": "2016-05-16", "tba": false, "updated": "2019-09-17T08:49:04", "background_image": "https://media.rawg.io/media/screenshots/6b2/6b2dfb9913b612f0731d95432f2bcd48_I9t0LqX.jpg", "website": "http://overfallthegame.com/", "rating": 2.78, "rating_top": 4, "added_by_status": {"yet": 8, "owned": 214, "beaten": 1, "toplay": 2, "dropped": 4, "playing": 2}, "playtime": 5, "achievements_count": 50, "ratings_count": 9, "suggestions_count": 511, "game_series_count": 0, "reviews_count": 9, "platforms": ["macOS", "PC", "Linux"], "developers": ["Pera Games"], "genres": ["RPG", "Strategy", "Indie"], "publishers": ["Pera Games"], "esrb_rating": null}