{"id": 113148, "slug": "iktomis-web", "name": "Iktomi's Web", "name_original": "Iktomi's Web", "description": "<p>Iktomi's Web is a form of interactive art rather than what is considered a traditional video game. It was created within two months for the Senior BFA Exhibition at Towson University where it will be on display in the gallery during April 2017.</p>\n<p>In Lakota Sioux mythology, Iktomi is a spider trickster and shape shifter spirit. He wears red, yellow, and white paint with black rings around his eyes. It is said that Iktomi wove the first dreamcatcher and gave it to the people to protect them. He is also known as the patron of technology. </p>\n<p>In Iktomi's Web, the player takes on the role of Iktomi who sits atop a dreamcatcher floating in the cosmos. Good dreams pass through the web, but bad dreams become tangled in it. Iktomi neutralizes the bad dreams by eating them, which causes him to have the experience of the dreamer. He must successfully navigate the dream to take back control. </p>\n<p>Because it was created for a gallery setting, graphic and lighting effects have been kept to a minimum so that it would run smoothly on the gallery Mac. It also has a reset timer that will start the game over after a short period of inactivity. The gameplay is purposefully not challenging, because it needed to be accessible to an audience that is not familiar with video games. </p>\n<p>This is my first solo game project. The models and animations were all made by scratch in Maya. The main theme music was created by Raymond Ha, a fellow student at Towson University. </p>", "metacritic": null, "released": "2017-04-13", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/086/08637c1ce5eb19b68b9e142e82aca879.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 192, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["katrinaschmelter"], "genres": [], "publishers": [], "esrb_rating": null}