{"id": 113188, "slug": "avantasia-the-game", "name": "Avantasia: the Game", "name_original": "Avantasia: the Game", "description": "<p><em>¿Buscas la versión en español?</em><br/></p><p>A novice in times of Inquisition questions his morals when he finds out the church will condemn his sister for heresy. A strange man shows him the door to a world where he will be able to find all the answers he seeks and save his beloved sister. Based on the metal opera of the same name. </p><p>Facebook: http://www.facebook.com/pages/Avantasia-El-Juego/118591401535403<br/><br/>Trailer: http://www.youtube.com/watch?v=Es-2k745e1A</p><p>Wiki: http://rpgmaker.wikia.com/wiki/Avantasia:_The_Game</p><p>Here are the full features of the game: <br/><br/>-Classic look <br/>-High quality visuals <br/>-Enthralling plot<br/>-Comedy and adventure <br/>-Optional quests <br/>-Dynamic alignment and character class system <br/>-Secret missions, maps, quests, enemies and items <br/>-New Game Plus <br/><br/>-RTA (Real Time Action) Battle System based on the d20 system <br/>-Combination of two or more spells to make more powerful spells <br/>-Ability to learn skills from enemies <br/>-Overdrive/limit break skills unique for each character <br/>-GUTS system to avoid sudden deaths in an epic way <br/>-Intelligent enemies <br/>-Oversoul system for enemies <br/>-Animations <br/>-Zoom control <br/><br/>-Caterpillar system <br/>-Reflective surfaces <br/>-Graphic notifications <br/>-Cutscenes <br/>-Minigames and puzzles <br/>-Global volume control <br/><br/>-Double weapons <br/>-Items divided and sorted according to usability <br/>-Items that multiply experience and money obtained in combat <br/>-Alchemy system to create custom weapons, armors, potions and compounds</p>", "metacritic": null, "released": "2014-05-22", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/c01/c014f4182c88b97d113ae26df27c6cdb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 149, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Bahamut20"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}