{"id": 1132, "slug": "air-supply-infinite", "name": "Air Supply - Infinite", "name_original": "Air Supply - Infinite", "description": "**Your Air Supply is running out! Again!**<br/>A new spin on the infinite runner that melds out of this world retro music and graphics with modern gameplay!<br/><br/>Armed with a limited supply of Smart Bombs, and dwindling air, Sam must jump over enemies, avoid UFO tractor beams and handle asteroids as he searches for the legendary Infinity Cups!<br/><br/>The eight cups remain hidden across seven planets and one black hole, their strange inscriptions long since forgotten and their locations reverently protected.<br/><br/>Watch time and space bend around you as you run onwards towards The Void at each location. Once there, you have a chance at grabbing an Infinity Cup for yourself, and a swift teleport to the next planet!<br/> <br/>Use your skill to outwit and avoid your enemies! When it gets too much, a single Smart Bomb will destroy all Sam&amp;#39;s enemies and fill his air supply up to half. <br/><br/>Careful use of Smart Bombs is essential when exploring the 8 locations that are host to the Infinity Cups…<br/><br/>Can you find all the cups? Will you see the future? <br/><br/>Get ready for your new addiction! :D<br/><br/>**Please Note: Though the game will run on original iPads/iphone4, it is recommended you please play on iPad2/iPhone4s and upwards.**<br/><br/><br/>Features:<br/><br/>*The most amazing retro soundtrack by Yerzmyey, composed on 8bit ZX Spectrum computers!<br/>*Beautifully animated retina retro graphics!<br/>*Unlock new characters, planets, music and even colours as you run around the universe! Over 4,600 possible combinations!<br/>*Run around entire planets!<br/>*Collect 8 Infinity Cups to reveal the future!<br/>*Avoid hazards like Aliens, UFOs and Asteroids!<br/>*Retro look and feel - modern gameplay and Game Center achievements/leaderboards!<br/>*Simple one button gameplay with configurable controls and layers of depth!<br/>*No IAP or Ads at all! :D<br/>*Universal build - play on iPhone or iPad!<br/>*Adjustable Scanlines for that true retro look!<br/>*Play a while… play… FOREVER!!!", "metacritic": null, "released": "2013-11-15", "tba": false, "updated": "2019-10-22T14:27:38", "background_image": "https://media.rawg.io/media/screenshots/496/4960cec9e7630b18eb0b7f9a5f5b6ac5.jpeg", "website": "http://www.quantum-sheep.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 80, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Quantum Sheep"], "genres": ["Action", "Arcade"], "publishers": ["Quantum Sheep"], "esrb_rating": "Everyone 10+"}