{"id": 113288, "slug": "a-skin-of-others", "name": "A Skin of Others", "name_original": "A Skin of Others", "description": "<p>A roguelike game where you take control of an adventurer fighting to defend their home from invading monsters from the horrific plane of Vita. To do this you must delve down into the depths of Melet mountain, through the forgotten remains of ancient cultures, now infested with bloodthirsty monstrosities, and enter the very realm of the horror itself.</p><p>Features:</p><ul><li>Turn based gameplay, letting you control the pace.</li><li>Procedurally generated levels so each run is unique.</li><li>Quest and encounter system, letting each run build a personal narrative based on the choices you make.</li><li>Mouse control optimised, requiring no keyboard command memorisation. </li><li>Extensive ability system. Find and equip 18 different unique skills that can be leveled up and mutated into a further 36 forms.</li><li>7 Zones, each with diverse tilesets and layouts.</li><li>7 Enemy factions, each with a myriad of creatures to fight within.</li><li>Extensive item generation system, creating a vast variety of different enchantments to power you up in your battles.</li></ul><p>Future Roadmap:</p><ul><li>The story</li><li>More Quests</li></ul><p>Patch notes:</p><p>27/02/16</p><ul><li>Added keyboard support to most of the menus. You can now move around them with the arrow keys, and click the selected button with enter.</li><li>Added blood splashed when hitting / killing enemies.</li><li>Ranged weapons now have a slight chance to miss and hit a surrounding tile instead.</li><li>Enemies will no longer leave a tile until the animations on it are complete.</li><li>Fixed some bugs</li></ul><p>20/02/2016:</p><ul><li>Made the hero stronger in the early game, to help players get started.</li><li>Removed a lot of the more powerful monsters from the early levels, now encountering them later on should be more of a surprise.</li></ul><p>13/02/2016</p><ul><li>Added a starting town. You can upgrade this via completing certain quests out in the world. Upgrades include new classes to unlock, gear to buy, spells to acquire etc etc.</li><li>Added a load of new quests to do with upgrading the town.</li><li>Added the farmer class.</li></ul>", "metacritic": null, "released": "2016-01-21", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/249/249bcfcd46acaf4fd0865f19f6e745fa.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 124, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["lyeeedar"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}