{"id": 113265, "slug": "game-447", "name": "486 (itch)", "name_original": "486 (itch)", "description": "<p><strong>[INTRO]</strong><br/></p>\n<p>As a white square on an large ASCII map, your only job is to get the high score, anyway you want: Drinking, dancing, robot fights. </p>\n<p>It's based on a very simple, text-only  random integer-based challenge RPG I made on a TI-83 in 2003. (Talk about uber n3rd.) I also was inspired by BASICA's \"Pimp Quest\" made decades ago.      <br/></p>\n<p><strong>[GAMEPLAY]</strong><br/><br/>\"486\"  (pronounced four eighty-six )is named after the popular processors of the mid 1990s.  It's why the tagline for the game is \"play like it's 1994.\" I consider the game to be something like a classic arcade-style RPG. I blend a lot of gameplay elements from games I love like Dragion Warrior, GTA, Adventure, Defender, MYST and \"Pimps Quest\".   </p>\n<p><strong>[CONTROLS]</strong><br/></p>\n<p>Arrow keys move the player<br/>Hitting I accesses inventory <br/>ESC for menu and to quit<br/>The rest is self explanatory and indicated on screen.</p>\n<p><strong>[RULES / GAME PLAY]</strong></p>\n<p><strong>1) The goal is simple: get the Global High Score.<br/></strong>What makes it unique is how you go about that. You could drink at the bar to gain rep, go dance at BEAT BEAT EVOLUTION or beat up everyone you run into. Entirely up to you. Yes, the SCORES ARE GLOBAL so challenge your buddies across the country!   </p>\n<p>2)Just like traditional arcades, time is always against you. You constantly need energy to maintain top speed and food / supplies to stay alive. <br/></p>\n<p>3)Rep is your leveling system and allows you access to new areas and makes you stronger. </p>\n<p>4)The world is full of dangers, travel smart and well prepared. <br/>Stores with X over the doors mean they are not accessible. </p>\n<p><strong>[HINTS ]<br/></strong>It's a good idea to watch the credits. </p>\n<p><strong>[CODING]</strong></p>\n<p>The entire game is hand-coded in QBASIC64 and all the models <br/>were made in UNITY, then exported out as image sequences for QB64 to handle. It's why the game is so big for such a simple GFX-style game! </p>\n<p>THANKS!<br/>Jared \"JBONZE\" Hoffa</p>", "metacritic": null, "released": "2017-12-01", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/ec4/ec44f722f3c3a2269c76696597c333d5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 118, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["runningonjava"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}