{"id": 113239, "slug": "rave-heart", "name": "Rave Heart (itch)", "name_original": "Rave Heart (itch)", "description": "<p>It is the year 212 AXW: the Great War that ravaged the galaxy of Xerxes has given way to contentious peace. One of the legendary heroes of the war, Arcturo Rave, now presides over Xerxes as the High King. His influence, though considerable, is barely containing a galaxy divided.</p>\n<p>Much of the conflict stems from two age-old adversaries: the humanoid Aryans of House Rave in Sector 4, and the lizard-like Draconians in Sector 1. To defuse the tension, Draconian Count Vorakia Estuuban wishes to merge two of the most influential houses from Sector 1 and Sector 4 through the marriage of Princess Ellemine Rave (daughter of the High King) and Prince Chad Zephyr (son of Lord Falric Zephyr). The High King approves of this union between the Aryans of House Rave in Sector 4 and the Humans of House Zephyr in Sector 1. However, the Count may have an agenda of his own for this marriage, and may not have the best interest of the galaxy in mind. Could House Zephyr simply be a puppet of the Draconian Count in this union?</p>\n<p>Story:<br/>Klein Cryoz, the personal bodyguard of Princess Ellemine Rave, finds himself caught up in a twist of unfavorable events. Journey into the galaxy of Xerxes and enter Klein's life, as he finds himself caught up in a galactic feud. Along the way, the fragments of his long-forgotten dark past surface, piece by piece. Will he be able to do his duty, withstand the pressure of a brewing war, all the while having his past haunt him?</p>\n<p>Features:</p>\n<p>- Rich background story and varieties of alien planets to explore.<br/>- A Cast of colorful characters who each have their own interesting background stories.<br/>- Semi-linear gameplay that rewards exploration.<br/>- Discover different extraterrestrial races and their cultures.<br/>- Emotionally involving story-line with interesting twists.<br/>- Immersive Sci-fi setting.<br/>- Gameplay that seeks to bring out the love of nostalgia from RPG gamers.<br/>- ATB Side-view Battle System.<br/>- Fast-paced gameplay.</p>\n<p>Let's Plays + Video Reviews:</p>\n<p>Nikorasu's Let's Play+Video Review (Demo version 2.0):<br/></p>\n<br/>\n<p>Driftwood Gaming's First Impression video  (Demo version 2.0):</p>\n\n\n<p>NOTE:</p>\n<p>You must first download the RPG maker VX ace run-time package to play the demo,  here:</p>\n<p>http://www.rpgmakerweb.com/download/additional/run-time-packages</p>\n<p>just choose RPG maker VX ace, download and install the run-time package.</p>\n<p>Now extract Rave Heart demo and execute the game.exe to play. :)</p>", "metacritic": null, "released": "2018-03-03", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/d72/d7201aea6ead92cc00448115be7b18a4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 219, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Starmage"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}