{"id": 113365, "slug": "procrastinaire-solitairy-confinement", "name": "PROCRASTINAIRE: Solitairy Confinement", "name_original": "PROCRASTINAIRE: Solitairy Confinement", "description": "<p>Made in 48 hours for the Alakajam Game Jam! </p>\r\nTHE GAME\r\n<p>You are an office employee tasked with the everyday struggle of endless paperwork. Stamp this, staple that, shred those, clip these, sign here…<br/></p>\n<p>The pile of work is <strong>always growing</strong>. To catch a break every so often, you turn to your one solace: PC Solitaire.</p>\r\nTHE OBJECTIVE\r\n<p>It's 5 minutes to 5PM. Your work day is almost over. Complete your paperwork as it comes in and play a little Solitaire on the side. The more tasks you complete, the higher your salary at the end of the day. Due to an accounting error in your favor, doing well at Solitaire also increases your pay.<br/></p>\n<p>Remember, you only need do <em>enough</em> paperwork to keep your employer happy. Try not to make too many mistakes either. If the pile of work reaches the angry devil sticker, the game is over and your boss will have words with you. Depending on your particular locale's employer protections, this may mean anything from a citation to termination.</p>\r\nHOW TO PLAY\r\n<p><strong>Procrastinaire: Solitairy Confinement</strong> is a balancing act of two activities; paperwork and Solitaire.<br/></p>\n<p><em>PAPERWORK</em></p>\n<p>New tasks appear in the 'IN' box. Click and drag the sheet to the center of your desk and perform the actions indicated in the attached note. If your task list does not include shredding, click and drag the sheet into the OUT pile and move onto the next one. Sheets that need shredding do not go to the OUT pile.</p>\n<p>NOTE: if your tasks include shredding, make sure to do that last! Any unfinished tasks on a shredder sheet will lose you points.</p>\n<p><em>SOLITAIRE</em></p>\n<p>Solitaire follows the rules of standard PC Solitaire. Make piles for each suit at the top of the screen in ascending order, starting with Aces. You can manipulate cards into stacks of alternating colors sequentially from highest to lowest, in order to uncover hidden cards.</p>", "metacritic": null, "released": "2018-06-24", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/354/354320a3cbd68df1e9c92dd86682e487.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 4, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["cloakedninjas"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}