{"id": 11333, "slug": "audioshield", "name": "Audioshield", "name_original": "Audioshield", "description": "<p>&quot;Audioshield: Feels like music-melee Missile Command-and we love it&quot; (Ars Technica)<br />\n&quot;AudioShield -- a rhythm game -- is HTC Vive&#39;s killer app&quot; (Jeff Grubb, VentureBeat)<br />\n&quot;Let&#39;s punch the hell out of music in virtual reality with Audioshield&quot; (Polygon)<br />\n&quot;Audioshield found some neuroreceptor in the deepest cavern of my brain—one that can only be stimulated by an incredible combination of sight, sound, and motion—and flooded it with a sensation that has left me reeling for days.&quot; (Ars Technica)<br />\nExperience your entire music collection in VR. Audioshield puts you at the point of impact for every hit in your music. Beats glide in slowly for mellow parts of songs, then ramp up for intense parts of songs with cross-body, double-shield, and high-altitude hits.<br />\nAudioshield uses an advanced version of Audiosurf 2&#39;s music analysis system to sync with any song from your collection  - and also with online streaming from Youtube.<br />\nEvery song has its own online leaderboard. Audioshield also supports local leaderboards to easily compete with friends during look-at-my-awesome-new-VR-system parties.<br />\n&quot;Fighting Music in VR. This is the coolest sh** ever.&quot; (Jericho)<br />\n&quot;VR Missile Command inside a neon rave, set to your own music.&quot; (PC Gamer)<br />\n&quot;The physicality of standing in place to fend off incoming orbs feels powerful&quot; (IGN)<br />\n&quot;...felt like we were being pulled into a futuristic trance-like state with sparks of orange and blue splattering about&quot; (Maximum PC)<br />\n&quot;...your music library comes to life as a fully immersive gaming experience&quot; (UploadVR)</p>", "metacritic": 81, "released": "2016-04-05", "tba": false, "updated": "2023-04-21T16:10:12", "background_image": "https://media.rawg.io/media/screenshots/cc6/cc65d17c109bb1df9616f3774c13c4eb.jpg", "website": "http://audio-shield.com", "rating": 3.7, "rating_top": 4, "added_by_status": {"yet": 4, "owned": 185, "beaten": 10, "toplay": 1, "dropped": 9, "playing": 1}, "playtime": 3, "achievements_count": 0, "ratings_count": 20, "suggestions_count": 311, "game_series_count": 0, "reviews_count": 20, "platforms": ["PC"], "developers": ["Dylan Fitterer"], "genres": ["Indie"], "publishers": ["Dylan Fitterer"], "esrb_rating": null}