{"id": 113367, "slug": "get-out-2", "name": "Get Out.", "name_original": "Get Out.", "description": "What is Get Out ?\r\n<p>It's a small Labyrinth like Game in the Early stages of Development. It takes place in a forest in which you wake up in a tent without knowing why you're there. When you first enter the Labyrinth, you'll notice there are coins that needed to be collected. So you need to pick them up and get through that Labyrinth in order to Get Out. As the Game title Describes.</p>\r\n/ Note that this Game is in the Early Stages of Alpha Development.\r\nControls\r\nKeyboard and Mouse :W, A, S, D-  To MoveShift-  To RunMouse-  To Look Around\r\n/ Controller support may be coming soon.\r\nRecommended Specs\r\n<p>If you're not running this Game on a Potato, you should be ready to go!            Get Out has a Settings Menu in which you can set different Quality Settings that fit to your Computer Specifications.  You can set them to the following Presets:</p>\n<ul><li>Ultra</li><li>High</li><li>Medium</li><li>Low</li></ul>\n<p>As well as customizing  separate Quality Settings yourself. </p>\r\nCurrent Status and Future\r\n<p>Get Out is in the very Early beginnings of Alpha Development. I'm constantly working on the Game and bringing new Ideas to Reality. If you got any Suggestions or Questions you can gladly  write to me or others in the Community Sections at the bottom of the Page. I'll read and answer the Post with joy as soon as I notice them. I'm going to use the Devlog as well and write News and Updates to it.  Ah and don't worry, Get Out is going to be prettier.</p>\n<p>Look at how the Game changed with the new Update in the DevLog.</p>\r\nSupport Me\r\n<p>If you want to Support me and help the Game grow, you can set an amount of money you want to donate when you click on Download. Any Amount is helpful and I'm very thankful for it! And eventually, you'll be mentioned in the Game at a later time!</p>\r\nTip:\r\n<p>Get the Official itch.io App to install this and other Games easier! It's not only for Game Installation. It also keeps your games up to date if an update comes out. So you're going to be one of the first Players  and don't have to bother about downloading a new zip file over and over again!</p>\r\nSome more Information ↓", "metacritic": null, "released": "2018-03-24", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/c0e/c0e30641d590a725ff09e62afa8218c5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 50, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["NiclzzK"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}