{"id": 113426, "slug": "ship-adventure", "name": "Ship Adventure", "name_original": "Ship Adventure", "description": "<p><strong>- Elève Premium de Gamecodeur  : </strong>22/10/2017, mon pseudo est HydroGene</p>\n<p><strong>- Langage et Framework utilisé : </strong>Haxe / Haxeflixel</p>\n<p><strong>- Code et Musique/sons par :</strong> Moi même (+ des sons du Gamecodeur pack)</p>\n<p><strong>- Graphismes :</strong>  Voir le fichier credits.txt dans le lien de téléchargement! </p>\n<p><strong>- Utilisation de librairies et codes externes :</strong> Non</p>\n<p><strong>- Temps passé : </strong>4-5 jours (En enlevant le temps passé en cours, à réviser, etc...)</p>\n<p><strong>- Comment as-tu (ou pas) abordé la contrainte du thème : </strong>J'avais déjà réaliser un shooter (vertical) quelques temps avant le début de la Jam. Je voulais créer un jeu pour cette jam qui se baserais dans le même univers que mon shooter précédent. Au final, ce jeu aura donc été une préquel à mon autre jeu <em>Stars Traveller</em>, sauf que celui-ci à été bien plus aboutit que l'autre qui à été fait en Love2D.</p>\n<p><strong>- Petit postmortem (avis sur le langage/framework utilisés, difficultés, succès, choix, bilan personnel rapide, etc...) :</strong></p>\n<p>Haxe et Haxeflixel sont tout simplement GE-NIAL ! Je me suis éclaté comme jamais, je me suis vraiment donné à fond. Ce jeu déborde de passion (J'espère que vous vous en rendrez compte, je me suis donner à fond que ce soit pour le gameplay ou les musiques du jeu.)</p>\n<p>Je vois très rarement des jeux réalisé avec Haxeflixel dans les jams de Gamecodeur, je me suis lancé là dedans en espérant remonter un peu sa popularité et attraper d'autres personnes qui serait tenter de l'utiliser plus tard pour les futures jams (Pour ça, il me fallait quand même un beau jeu, j'ai fais ce que j'ai pu avec les moyens du bord :) )</p>\n<p>Je suis vraiment très satisfait de ce que j'ai produit pour cette jam, c'est sûrement le jeu dont lequel je suis le plus fier à l'heure actuelle.  J'ai eu un peu peur au début car j'avais fait que du Love2D depuis mes débuts, et puis au final Haxe/Haxeflixel à été digéré tout seul. J'ai l'impression d'avoir gagné en flexibilité, j'ai eu aucun mal à switcher de l'un à l'autre. Au final, ce ne sont pas les outils qui sont important mais ce sont les concepts ! (Même si parfois je trouve que Haxeflixel est vraiment trop fort et mâche un peu le travail sur certains aspect, mais ce sont des choses que j'ai bossé et re-bosser grâce à la formation, que j'ai l'esprit tranquille en utilisant ces fonctions, car je sais comment ça marche !)</p>\n<p>J'ai également pu constater des progrès conséquent grâce à la formation. La méthode d'apprentissage de David fonctionne réellement c'est pas des conneries !! j'avance à mon rythme certes, mais je sens que je deviens programmeur jour après jour. De plus, la communauté est toujours là pour aider, elle ne nous juge pas lorsque l'on bloque un concept, ce qui permet de toujours avancer. Je ne regrette absolument rien, si vous lisez ce message et que vous souhaitez aussi être programmeur de jeux-vidéo, foncez chez Gamecodeur sans hésitation, je ne me suis jamais autant amuser à Apprendre. Aujourd'hui lorsque je code, je ne dis plus que je \"travail\", car c'est plus profond que ça,  je dis simplement, je retourne \"m'amuser\", parce qu'à ce niveau,  je suis désolé, c'est pas un fardeau, c'est l'éclate totale d'apprendre dans cette formation qui est à un niveau bien au-delà  de ce que je pensais ! :)</p>\n\n<p>-----------------------------------------------------------------------------------------</p>\n<p>Allez-y jusqu'au bout vous ne serez pas déçu, j'ai créer un jeu complet avec une histoire, un début, une fin (avec un boss final à affronter). Il n'y a que 3 niveaux, le jeu est très court, mais au moins, j'en ai fini un ! :D (Merci aux heures supplémentaires pour la jam, sinon je n'aurais pas pu le terminer à temps)</p>\r\nHow to play \r\n<p>- <strong>ENTER</strong> to validate your action/choice in the menu</p>\n<p>- <strong>Arrow Keys</strong> to move</p>\n<p>- <strong>SPACE BAR</strong> to shoot</p>\n<p><em>New : Ultimate Laser Beam-X !</em></p>\n<p>Press <strong>ENTER</strong> when it's ready to be used and destroy everything!</p>", "metacritic": null, "released": "2018-03-06", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/716/71647c7560572c09c169c70f9815d793.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 64, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["HydroGene"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}