{"id": 113516, "slug": "john-henry-steel-driver", "name": "John Henry - Steel Driver", "name_original": "John Henry - Steel Driver", "description": "<p>Your name is <strong>John Henry</strong> and you're a steel driving man.</p><p>You were born with a hammer, a twenty pound hammer, a hammer right in your hand.</p><p>Some guy came by the old railroad site saying he could beat you in a race with this new fangled <em>steam drill</em> or something and you can't believe it. Who is this guy? Didn't he know that once upon a time your mom liked to sew at night, so you <em>pulled the moon down to give her light?</em></p><p>But he's hired some crooked cops to delay you getting to the race in time! We gotta get there!</p><p><strong>Features Include:</strong></p><ul>\n<li><strong>Beautiful 2D Sprite Work: </strong>Done by James Wine, now you too can see John Henry as he was meant to be seen, in pixels!</li><li><strong>Jumping!: </strong>Hey John, you can jump! Press <em>space bar</em> to do that!</li><li><strong>Feats of Strength!:</strong> You're a big man with a big hammer, John. That adds some weight. What? Hit the cops? That's murder, John. Jump on their heads to knock them out and get some lift!</li><li><strong>A Rap Sheet: </strong>John, we know we're not supposed to point out you used to be in prison, but the cops are aiming to arrest you! Don't let them touch you, man!</li></ul><p><em>This is a very rough prototype of a prototype made for The Public Domain Jam (#pdjam). Further developments and actual fleshing out are on the way!</em></p>", "metacritic": null, "released": "2014-05-24", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/443/4431e60b1508a9e021039cf479c00232.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 105, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Bloody B. Honey"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}