{"id": 113564, "slug": "gamshal-the-forsaken-monk", "name": "Gamshal: The Forsaken Monk", "name_original": "Gamshal: The Forsaken Monk", "description": "<p><strong>Gamshal: The Forsaken Monk is a 3D puzzle / exploration third person videogame where the player takes the role of Manjiri, a mysterious girl with a very special ability. The player will venture into an abandoned temple and solve several puzzles that will allow them to delve deeper into it. To overcome these challenges, the player must use their wits and Manjiri's meditation powers that allow her to step into the astral realm and interact with the temple's guardians. Only this way will the player reach the depths of the temple and uncover the secrets laying there...</strong></p>\n<p><strong>---</strong></p>\n<p><strong>Gamshal: The Forsaken Monk</strong> se trata de un videojuego tridimensional de <strong>puzles y exploración</strong> en el que el jugador, desde una perspectiva en tercera persona, controla a <strong>Manjiri. </strong>El jugador se adentrará en un templo y resolverá los distintos rompecabezas que le esperarán en cada sala y que le permitirán progresar hacia nuevas zonas. Para superarlos, el jugador deberá hacer uso de su <strong>ingenio </strong>y de la <strong>habilidad de Manjiri</strong> que le permitirá interactuar con los distintos enemigos que protegen el templo. Solo así el jugador podrá alcanzar las <strong>profundidades del templo</strong> y descubrir el secreto que allí le aguarda.</p>", "metacritic": null, "released": "2018-05-03", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/4fc/4fce9660384008d06e03a2ed9bad58c4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 374, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["YakGames"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}