{"id": 113549, "slug": "bangy-adventures-in-egypt", "name": "Bangy: Adventures in Egypt", "name_original": "Bangy: Adventures in Egypt", "description": "Story<p>\r\n\tRumour has it that there are innumerable treasures in the mysterious ancient pyramids. Our hero Bangy wants to check these rumours out. Being a handyman at blasting works, he thought he was no worse than an archaeologist. Why would anyone dig the ground for a long long time instead of speeding up the process with a great big directed explosion?\r\n\t<br/>\r\n\t Having spent some time on preparations, having armed himself with his loyal grenade launcher, having saddled his camel, Bangy hit the road. It was quite easy to find the pyramids, but what's inside there? It's adventure time for our hero!\r\n\t<br/>\n</p>\n<br/>\r\nKey Features\r\n<ul>\n<li>Rooms with riddles. It won't be easy, but...</li>\n<li>...any trouble can be handled with wit... or a good old GRENADE LAUNCHER!</li>\n<li>Pave your way with bombs so that nothing stops you on the way to treasures...</li>\n<li>...except for mummies! Oh yes, mummies! There are creatures that don't like to be disturbed by EXPLOSIONS - be ready to face the ill-tempered pyramid dwellers!</li>\n<li>Getting out of this place is hell of a task! Gather achievements, grab all the treasures, and show everyone that you are a real adventurer!</li>\n</ul>\n<br/>\r\nGame Play\r\n<ul>\n<li> Ancient means fragile: when you are inside a pyramid, blow up the blocks that hinder your way to treasures and new levels.</li>\n<li>Blow up wisely: Bangy has a limited number of mines, plan your moves beforehand. It's cool to blow up everything around you, but don't end up blowing up the treasures or even yourself! However, Bangy is an expert in this business! His mines have indicators that show the direction of explosion, so you know whether you should make it or not.</li>\n<li>Any treasure has its weight, literally. So however tempting it may be, beware before you start to catch it falling from a considerable height. </li>\n<li>Bangy is a tough guy, but don't rely too much on it. Beware of falling! </li>\n</ul>\n<br/>\r\nFollow Me\r\n<p>\n<br/>\n<br/>\n</p>", "metacritic": null, "released": "2015-05-23", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/94f/94f6231eabd8655180e730fcb3d80d31.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 109, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Sergey"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}