{"id": 11354, "slug": "guardians-of-orion", "name": "Guardians of Orion", "name_original": "Guardians of Orion", "description": "[ THE ULTIMATE SCI-FI RPG ]Guardians of Orion is a Sci-Fi MMORPG Shooter featuring Cooperative, Competitive, Social and Dog-fighting Gameplay!<br/>[ THE LORE ]Guardians of Orion takes place half a century from now and allows you to explore The New Solar System.  Rich with an unlimited and renewable clean energy source, Ion Crystals generated by the star of Rigel help power your Guardian using the most advanced technology and weaponry ever created.  <br/>https://www.youtube.com/watch?v=VFopklaUqvg<br/><br/>· EXPLORATIONTravel across multiple Planets &amp; Moons with your friends!· SURVIVALFight against devastating enemies including ROBOTS &amp; DINOSAURS in cooperative gameplay!· BATTLE YOUR FRIENDSA variety of competitive PvP modes with Kills granting store credits and experience!· PLAY YOUR WAY!Swap between First-Person, Third-Person and Top-Down perspectives at ANY time during Cooperative gameplay! <br/><br/>· GATHER WITH YOUR FRIENDSSocialize in beautiful hubs including Space Command Centers, Elemental Moons, Complex Cave Systems and Sprawling Cities!· INVENTORYCollect Loot &amp; Gear along your journeys!· CRAFTINGForge Resources into Gear and other items.<br/><br/>· COMPLETE MISSIONSA variety of Side Objectives, Weekly Challenges and Daily Challenges to earn store credits, unlock loot crates and earn new gear!· STATISTICSTrack your accomplishments with detailed player statistics and overviews!· LEADERBOARDSCompete with others across a variety of ranks and skills! <br/><br/>· CUSTOMIZATIONMillions of possibilities, including: Armors, Hats, Helmets, Weapon Skins, Shaders, Tracers, Effects, and more!· GIBS &amp; GOREDecimate your enemies and experience over-the-top violence, gore and gibs! (Can be disabled via gameplay settings).· EXECUTIONS &amp; FATALITIESTake the violence to another level with extreme finishing moves and fatalities! <br/><br/>· LOCAL CO-OPWe will continue to add additional Local Co-Op experiences as ORION continues to grow and evolve!· PLAY or PAY!The majority of Trek Store items can either be bought outright or played for as a variety of in-game systems grant you store credits, including the resources you collect, all PvP kills and bonus missions, achievements, daily challenges, weekly challenges and more! Our store is cosmetic-focused with no pay-2-win! <br/><br/>· COMPANIONSPets help assist you in collecting resources, items and gear! Acquire a PET and never be alone again.· WARGAMESBecome the best Pilot and challenge your friends and foes in a free-for-all dog-fighting game mode which rewards store credits and experience for a variety of gameplay and objectives!<br/><br/>· LOADOUTSCustomize your Weapon Loadout per characters, including Primary Weapons, Secondary Weapons, Item Kit and Grenade Type!DevNoteWe fully fund all of our prototypes and early access versions of our games/products. ORION is scheduled for official release on December 20, 2016.  We use crowdfunding campaigns to grow these projects past our original ambitions and expectations through community feedback and interaction, the same as we did with our first title: 'ORION: Prelude'  We'd love to make our new game \"ORION\" even more massive so please spread the word! The more we receive the more we can support YOU!", "metacritic": null, "released": "2015-12-01", "tba": false, "updated": "2023-11-26T05:27:12", "background_image": "https://media.rawg.io/media/screenshots/120/120539996c2cdaef469c594fc96b8e72.jpg", "website": "http://www.trek-industries.com", "rating": 2.27, "rating_top": 1, "added_by_status": {"yet": 15, "owned": 503, "beaten": 3, "toplay": 5, "dropped": 23}, "playtime": 3, "achievements_count": 10, "ratings_count": 33, "suggestions_count": 578, "game_series_count": 0, "reviews_count": 33, "platforms": ["PC"], "developers": ["Trek Industries"], "genres": ["Action", "RPG", "Indie"], "publishers": ["Trek Industries"], "esrb_rating": null}