{"id": 1136, "slug": "hustle-kings-vr", "name": "Hustle Kings VR", "name_original": "Hustle Kings VR", "description": "VR games may cause some players to experience motion sickness.<br/><br/>It’s game ball. Sink it and you’ve won. But the shot is tricky. You need a precise angle, exact power… it has to be perfect. And a perfect shot needs a perfect view – the kind you can only get table-side.<br/><br/>Step inside the pool hall with Hustle Kings™ VR and play US 8-Ball, Black Ball, Killer, Cut Throat, Snooker and many more cue sports as they were meant to be played. Measure the angles and line up your shots exactly as you would in real life.<br/><br/>Control the cue with your DUALSHOCK®4 or with the new dual PlayStation Move control system for an absolutely immersive experience.<br/><br/><br/>VR Games may cause some players to experience motion sickness.<br/><br/>Use of PSN and SEN account are subject to the Terms of Service and User Agreement and applicable privacy policy (see terms at sonyentertainmentnetwork.com/terms-of-service &amp; sonyentertainmentnetwork.com/privacy-policy). <br/>Online features may be terminated at any time.<br/>*Online multiplayer requires a PlayStation®Plus membership.<br/><br/>Online Play (Optional)<br/>PlayStation®VR Required<br/>PlayStation®Camera Required<br/>Enhanced play with 2 PS Move controllers<br/><br/>  Software subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service &amp; playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.<br/><br/>", "metacritic": null, "released": "2016-10-10", "tba": false, "updated": "2019-09-12T06:40:55", "background_image": "https://media.rawg.io/media/screenshots/e80/e8085bc37eba69663eabfc400b62dd73.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 14}, "playtime": 0, "achievements_count": 31, "ratings_count": 0, "suggestions_count": 103, "game_series_count": 0, "reviews_count": 0, "platforms": ["PlayStation 4"], "developers": ["Sony Interactive Entertainment"], "genres": [], "publishers": [], "esrb_rating": "Everyone 10+"}