{"id": 113644, "slug": "amour-ou-patrie", "name": "Amour ou Patrie", "name_original": "Amour ou Patrie", "description": "<p><strong>Amour ou Patrie</strong> </p><p>Deux amants traversent la guerre qui oppose leur clan respectif, choisiront-ils l'amour ou la patrie? </p><p>Comme Aida et Radamès, les joueurs sont pris dans un dilemme cornélien: Ils doivent choisir entre l'amour et la patrie. </p><p>Ils peuvent tenter de détruire l'armée adverse ou bien tenter une ultime rencontre pour consommer leur amour dans l'éternité. </p><p>Comme dans le célèbre Opéra, la situation commande au joueur de choisir la patrie. En effet, la forme du jeu vidéo et tout le poids symbolique guerrier qu'il transporte poussent les joueurs à adopter une attitude compétitive pour écraser leur adversaire. </p><p>Ainsi, chacun des protagonistes doit se rendre au centre pour apporter la victoire totale de leur patrie sur les étrangers. Radamès, l'élu de la déesse Isis, et Aida, fille du roi d'Éthiopie, sont tous deux la clé d'une bataille à en finir. </p><p>À l'inverse, choisir l'amour est une affaire de désir, le désir de découvrir ce qu'il arrive si ces deux corps libres se rencontrent. Dans cette perspective, le rapport symbolique se transforme. Les protagonistes ne sont plus des armes, mais des amants que tout sépare. </p><p>L'aspect compétitif du jeu s'évanouit pour devenir un jeu coopératif où prime la communication. Comme autant de musiciens attentifs au jeu des chanteurs, les joueurs devront juger du rythme des deux protagonistes pour s'assurer que leur progression respecte une parfaite harmonie. C'est donc une coordination mesurée qui permettra cette rencontre ultime.</p><p>De plus, Il faudra qu'une relation de confiance s'établisse entre ces passants inconnus. En effet, laisser passer le protagoniste adverse sur son territoire pourrait mener à la catastrophe si les intentions des joueurs ne sont pas concordantes. </p><p>Comme dans la tragédie de Verdi, les héros sont condamnés d'avance. Qu'ils suivent leurs instincts ou qu'ils se conforment à ce qu'on attend d'eux, le malheur s'abattra sur leur tête. L'acteur principal est plutôt le système humain, fait de règles rigides et d'intentions perfides. </p><p>C'est pourquoi les joueurs ne personnifient pas les protagonistes, qui eux sont toujours en marche vers leur destin. Ils prennent plutôt le contrôle de soldats impersonnels, comme autant de représentants d'une machine impitoyable. </p><p>Cette machine d'apparence figée n'est pas complètement immuable. Il est possible de s'y infiltrer pour y créer de l'espace, et, avec une volonté commune, la guerre pourra peut-être trouver le chemin de l'amour. </p>", "metacritic": null, "released": "2016-06-05", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/34f/34f1646adb6c785bcf4d3ade7733cc31.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 117, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Simonstre", "TarfmagougouGames", "lechyprien"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}