{"id": 113722, "slug": "ycpu-emulator", "name": "YCPU Emulator", "name_original": "YCPU Emulator", "description": "<p>Write ASM like it's 1979 with the YCPU, a processor inspired by the golden age of microcomputing! The download package on this page includes an open source emulator and assembler for the YCPU. You'll be running an example program seconds after unzipping the package. It's <em>that</em> easy.\r\n</p><p>\r\n\tThe YCPU combines the best features of processors from the late 70's and early 80's: an exhaustive instruction set, a complete set of addressing modes, memory segmentation and protection, user/supervisor modes, and dead simple hardware IO. Beginners will appreciate that you can begin programming for the YCPU after a quick study of the instruction list (Section 2 of Documentation/ycpu.txt). Enthusiasts will appreciate the YCPU's user/supervisor divide and memory segmentation - features that make development of compilers, operating systems, and complicated programs much easier.\r\n</p><p>\r\n\tThis emulator is designed to be used as a fully programmable CPU in a video game - and because it is written as an open-source, permissively licensed DLL, you can include it in your video game with a minimum of effort. It could also be used by programming enthusiasts, arduino aficionados, educators, and DCPU hobbyists who are ready to move to a more powerful architecture.<br/>\n</p><p>The YCPU was inspired by notch's DCPU, the processor that controlled space ships in the game 0x10c. One day, I'd like to use this processor in game of my own - something inspired by Escape Velocity and Faster Than Light. But I also want to help you get started programming as well, or include this in your own game. Post your questions on Reddit at r/ycpu, and let's get started!\r\n</p>Getting Started<p>\r\n\tYou can launch the YCPU Emulator by running YLauncher.exe, or from the command line by running App\\YCPUXNA.exe. Make sure you have the .NET 4.0 Client Runtime and the XNA 4.0 Runtime installed (you'll find links to these on the itch.io download and in the readme.txt file).\r\n</p><p>\r\n\tTo get started programming, you should read Documentation/ycpu.txt - start with the instruction set, and come back to the other features as you start to expand your familiarity with the processor. For your first program, you can edit the included assembly program in the Examples folder.\r\n</p>Source Code<p>\r\n\tThe YCPU Emulator is 100% open source (MIT license) and hosted on Github at github.com/ZaneDubya/YCPU.\r\n</p>", "metacritic": null, "released": "2016-03-18", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/ed1/ed1bd516f3385c5c414236f692d7e733.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 25, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ZaneDubya"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}