{"id": 113730, "slug": "the-black-tome", "name": "The Black Tome", "name_original": "The Black Tome", "description": "<p><strong>The Black Tome</strong> is a dark and unforgiving top-down survival horror game that features an in-depth sanity system, puzzles with procedurally generated solutions, and a limited field of vision that keeps the player guessing what lurks behind every corner. In the game you play as a private investigator trying to get to the bottom of a mysterious case concerning the disappearance of a forbidden grimoire, once held in the vaults of the esteemed Miskatonic University. As reports of cult activity begin to increase, you gain a destination. But in those wretched depths, dark things are known to dwell, and the frailty of the human mind is inescapable.<br/></p><p><strong>The Alpha 1.5 Update</strong> has arrived, bringing many changes, fixes and additions to the game. Our focus this time around was on refining some of the key elements surrounding gameplay, which sometimes meant making some big decisions. Perhaps most notably, we decided that all bullet projectiles should have instant travel times. Being able to sidestep a shotgun blast felt cheap and unrealistic, but with the introduction of this new system we expect firefights to be taken a whole lot more seriously. Other highlights from this update include: <br/>- The addition of difficulty settings, Easy, Normal, Hard and Unspeakable<br/>- Opening the Inventory no longer pauses the game on difficulties above Easy<br/>- Interacting with items on the ground has been reworked so that in order to pick up an item you must first select it via your cursor<br/>- A redesigned boss fight, aimed to be much more engaging and challenging than before<br/>- Some quality of life changes, including a skip dialogue button [Z], hotkeys for a couple of actions, and the ability to close any UI by pressing ESC</p><p>But we've only scratched the surface here, to see the rest be sure to check out the full changelog!</p>", "metacritic": null, "released": "2016-08-03", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/b6e/b6e62b1fd0a1410420880bc9985245d3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 35, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["JTR"], "genres": ["Action"], "publishers": [], "esrb_rating": null}