{"id": 113884, "slug": "friday-the-2013th", "name": "Friday The 2013th", "name_original": "Friday The 2013th", "description": "<p>The ultimate goal of Friday The 2013th is to defeat Jason three times, there is an additional goal to prevent children from being killed in their cabins. The player starts in a state where everything is 'fine' but they get a warning telling them that jason is going to strike somewhere. Using their maps, they must navigate to the right cabin and fight the boss enemy until he loses all of his health, then they must do the same thing on two more days, where he gets stronger weapons and trickier attacks. While not hunting and fighting Jason, the player must find Lighters to light fireplaces in order to get hints about ways to become stronger, he can also obtain items from enemies.</p><p>Each player can play one of the six 'iconic' camp counselors from the original game - each with different statistics. The statistics are split between Strength, Perception, Luck and Speed. Each character also starts somewhere different on the map. On the subject of the map, I've added a small path between the two inner loops as to make travel easier in this area of the world. Players upgrade their weapons, defeat hidden bosses - like Jason's Mom - and find hidden cabins in the woods in order to grow their arsenal against their mortal enemy. Multiple people can play in the same 'world', in that case, Jason's health and location is shared amongst them, so one player nearby can go fight instead of others.</p><p>That being said, in single player mode, if the player dies, it's game over. In the original game, you could switch between each counsellor almost at will in order to cover more ground and keep your health high enough. To compensate for this, movements across the whole map are reasonably timed for a single character and Healing items are more common and more efficient. I've also removed any kind of jumping-based item spawning, everything is now dropping from enemies. The cave is also not a maze anymore and the forest is a randomly-generated maze. The day/night cycle is now more understandable with a little picture of time passing at the top of the screen.</p><p>Another important point of the game is the necessity to light fireplaces; they actually unlock the possibility for items to drop, so they are not just cryptic hints like in the original game.</p>", "metacritic": null, "released": "2015-08-28", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/ff7/ff7c81a40eb0551c536945575b4eef44.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 150, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["poik007"], "genres": ["Action"], "publishers": [], "esrb_rating": null}