{"id": 113896, "slug": "fastcrawl-itch", "name": "FastCrawl (itch)", "name_original": "FastCrawl (itch)", "description": "<p>FastCrawl is a complete dungeon crawl in 30 minutes.  Your party of heroes and the dungeon you explore are randomly generated each game, so the game is highly replayable.</p>\n<p>Your objective is to explore the dungeon in a quest to find and kill an evil villain.  You control a randomly generated party of 3-5 characters, and an additional character may join you in some games.  As you descend through each level of the dungeon, your characters gain enhancements and specializations.  <br/></p>\n<p>Your actions cost supplies.  You can sometimes come across more as you explore, and using your remaining supplies wisely is key to surviving long enough to finish your quest.<br/></p>\n<p>Entering a room that has monsters in it starts a combat round.  At the start of combat you position your characters on a grid with a front row and a rear row.  Each character acts in initiative order and can carry out one of two actions depending on their class and equipment.  For example, a cleric on the front row can typically melee attack with a left-click and heal a fellow party member with a right-click.  Defeated monsters drop treasure and equipment for your characters.</p>\n<p>At the end of each game you will be awarded a score.  See how close you can get to the mythical perfect score on Insane difficulty.</p>\n\n<p><em>FastCrawl was written and published in 2006, before focusing on a non-gamedev career.  I'm uploading it here for free for anyone who is interested in trying it out, but I am no longer actively developing it or supporting it.  I have recently returned to gamedev and am working on Star Dynasties; a scifi feudal society simulator / rpg which plays like a cross between a turn based strategy game and a choose-your-own-adventure game.  If that sounds interesting, check out it's devlog.</em></p>", "metacritic": null, "released": "2017-07-13", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/d3e/d3e9b2408edf20d0609e4c44f5d76e21.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 165, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["gpawley"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}