{"id": 113980, "slug": "cat-at-lukamore", "name": "cat at lukamore", "name_original": "cat at lukamore", "description": "<p><strong>Ruslan and Lyudmila by Alexander Pushkin (translated by Roger Clarke)</strong><br/></p>\n<p><em>PROLOGUE</em><br/>By an arc of sea a green oak stands;<br/>to the oak a chain of gold is tied;<br/>and at the chain's end night and day<br/>a learned cat walks round and round.<br/>Rightwards he goes, and sings a song;<br/>leftwards, a fairy tale he tells.</p>\n<p>There's magic! It's a wood sprite's haunt-<br/>a rusalka sits among the boughs-<br/>on footpaths no one has explored<br/>are tracks of beasts no one has seen-<br/>a hut stands there on chicken's legs,<br/>no windows in its walls, nor doors-<br/>unumbered wraiths stalk wood and dale-<br/>at dawn the ocean waves roll in<br/>and surge across the empty sands,<br/>while from the limpid waters strides<br/>a troop of thirty champions,<br/>fine men, and their sea-tutor too-<br/>a kind's son passing by the way<br/>takes prisoner an awesome tsar-<br/>up in the clouds for all to see<br/>above the sweep of woods and waves<br/>a wizard hauls a warrior brave-<br/>a princess pines in prison there,<br/>a brown-haired wold her loyal page-<br/>a mortar in a witch's form<br/>moves to and fro as if alive-<br/>frail Tsar Kashchey wilts by his gold.<br/>The place breathes Russia... recks of Rus!</p>\n<p>I was there once: I sipped some mead;<br/>I saw the green oak by the sea;<br/>I sat beneath it, while the cat,<br/>that learned cat, told me his tales.<br/>Once of those tales I still recall,<br/>and this I'll share now with you all...</p>\n\n<p>bitsy hacks by Sean S. LeBlanc</p>", "metacritic": null, "released": "2018-04-29", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/71f/71f480626f35963db47dd080fa313c31.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 16, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["onion"], "genres": [], "publishers": [], "esrb_rating": null}