{"id": 11394, "slug": "expect-the-unexpected", "name": "Expect The Unexpected", "name_original": "Expect The Unexpected", "description": "Story<br/>In the lands of Lorhaven, the Gods chose you to carry out the hardest and dangerous task, you must collect the 12 Runes of Power to restore the order.<br/><br/>As the chosen Hero you will embark on an unexpected journey, travelling from place to place, fight monsters, deal with bandits, encounter feral creatures, loot items to equip or sell, trade goods in towns to get better equipment and profit, accept jobs for money and reputation, face numerous unique events! Gain experience from skirmishes to learn/upgrade spells and abilities.Main Features<br/><ul><li>Explore 5 Character Classes (Fighter, Archer, Wizard, Druid and Necromancer) <br/></li><li>Unlock their specific skill sets, abilities/spells<br/></li><li>New events will happen each time you travel <br/></li><li>Factions will be either your enemy, friend or neutral, depending on the choices you make throughout the game<br/></li><li>More than 100 unique events filled with action, comedy and suspense <br/></li><li>Customize your hero<br/></li><li>Hire party to help you on the journey<br/></li><li>Reputation system based on your actions and choices<br/></li><li>Every time you begin a new game, the world will be different <br/></li><li>Freedom of choice, you can be either the \"hero\" or the \"villain\"<br/></li><li>If you die, you are sent to afterlife (playable)<br/></li><li>Travel from city to city through many pathways fill with life, different random events, deal with pirates, raiders, assassins, animals, traders asking for help, beggars, traps, ambushes, choose faction's sides in battle and much more!<br/><br/></li></ul>", "metacritic": null, "released": "2016-12-08", "tba": false, "updated": "2019-10-22T14:07:07", "background_image": "https://media.rawg.io/media/screenshots/168/1680d56a17de5cf746fdabf52f64a686.jpg", "website": "http://www.etugame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 31}, "playtime": 4, "achievements_count": 32, "ratings_count": 1, "suggestions_count": 433, "game_series_count": 0, "reviews_count": 1, "platforms": ["macOS", "PC"], "developers": ["GoldenGod Games", "GoldenGod Games, Lda"], "genres": ["RPG", "Strategy", "Casual", "Indie"], "publishers": ["GoldenGod Games", "GoldenGod Games, Lda"], "esrb_rating": "Everyone 10+"}