{"id": 113975, "slug": "pimp-sim", "name": "Pimp Sim", "name_original": "Pimp Sim", "description": "PimpSim\r\n<p>Ludum Dare 40 entry. Topic: The more you have, the worse it is. Created in 2,5 days in a team of 5 people. This is slightly fixed version of the game (several minor bugs + end screen with score).</p>\r\nControls: SPACE + ASWD / ARROWS\r\n<p><strong>Goal: During one night earn as much money as possible, gain respect and hire girls.</strong><br/></p><p>One bitch won't make you rich, but with more hoes your troubles grows...so start pimpin'!</p>\n<p>You're in a role of a pimp, trying to generate biggest amount of cash through the night. Grow your harem of female employees and collect your share of their hard earned cash. But you'll have to keep your RESPECT high if you want to keep your shares high as well. Hoes will face common difficulties which you'll have to tend to, otherwise your respect will fade away as well as your earnings from each money collection.<br/></p>\r\nYour responsibilities are:\r\n<p>- employing new girls (for a starting bribe)<br/>- collecting the cash<br/>- curing your hoes' STDs<br/>- watching out for competitive pimps as they'll want to transfer your girls to their neighborhood<br/>- watching out for priests as they'll try to talk the girls out of their current employment<br/>- regaining respect when some miserable soul won't think you're worthy of some<br/></p>\n<p>Each proper pimp knows, there's nothing insoluble with a proper slap. <br/>So go make some CASH!</p>", "metacritic": null, "released": "2017-12-05", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/bfa/bfaa5c8a26ab02a699131cc712ce729e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 102, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["Jaacob"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}