{"id": 114, "slug": "football-heroes-2015", "name": "Football Heroes 2015", "name_original": "Football Heroes 2015", "description": "Football Heroes 2015 is here with an all new season of over-the-top arcade football action! Fight your way to the end zone using skill, strategy, and special moves to smash the competition and bring home the win. Power up your players and customize your roster to build the ultimate football team in the universe. You have never seen a football game quite like this!<br/><br/>“Football Heroes is without question the best American sports portrayal on the app store.” - Touch Arcade<br/><br/>\"…the feel of the game is fantastic. The movement is fluid and easy and the gestures make sense. Hilariously, this over-the-top football game is the best controlling football game we've ever played on iOS.\" - Touch Arcade<br/><br/>\"Players move and perform with lots of personality and swagger, especially with the special moves.\" - Slide To Play<br/><br/>\"The Return Of Arcade Football\" - Game Informer<br/><br/>- FEATURES - <br/><br/>FREE TO PLAY<br/>&gt; No paywalls or timers.<br/><br/>FULL CONTROL<br/>&gt; Simple touch-screen controls let you control the action on the field: run, pass, spin and tackle -- all at the touch of your fingertips.<br/><br/>CHALLENGING GAME MODES<br/>&gt; Game modes that will keep you coming back for more: Cup Mode, Quick Match, Sudden Death, and the NEW Coin Battle Mode.<br/><br/>MULTIPLAYER<br/>&gt; Play Head to Head via Bluetooth or Wi-Fi.<br/><br/>LEVEL UP<br/>&gt; Level up your players abilities by catching passes, making tackles, and scoring touchdowns.<br/><br/>CUSTOMIZE<br/>&gt; Customize your Team and Players - upload a logo and customize team colors. <br/><br/>COLLECT<br/>&gt; Collect powerful Hero Cards with unique abilities -  Bronze, Silver and NEW Gold cards.<br/><br/>INCREDIBLE SUPER POWERS<br/>&gt; Lock-On Tackle, Rocket Shoes, Bullet Pass, Teleport, Crushing Tackle, Ground Pound, and many more! <br/><br/>FIGHT FIGHT FIGHT!<br/>&gt; Deep fighting game system with special moves and counters.<br/><br/>MANAGE YOUR TEAM<br/>&gt; Team Management, buy and sell Hero Cards, sub players in and out.<br/><br/>CROSS DEVICE PLAY<br/>&gt; Cross device syncing: play with the same team on your smartphone or tablet.<br/><br/>Already a fan of Football Heroes? Like us on Facebook and follow us on twitter:<br/><br/>https://www.facebook.com/FootballHeroesTheGame<br/>https://twitter.com/FootballHeroes_<br/><br/>For technical issues or if you require support please email:<br/>support@run-games.com<br/><br/>Football Heroes® is a registered trademark of Run Games LLC. All Rights Reserved. <br/><br/>This product includes software developed by the OpenSSL Project for use in the OpenSSL Toolkit.(http://www.openssl.org/).<br/><br/>This product includes cryptographic software written by Eric Young (eay@cryptsoft.com).", "metacritic": null, "released": "2013-11-07", "tba": false, "updated": "2019-10-22T14:27:24", "background_image": "https://media.rawg.io/media/screenshots/9dd/9dde86380b5c5c2dd9433e330f81a0b7.jpg", "website": "http://run-games.com/footballheroes/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 236, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["Run Games"], "genres": ["Sports", "Arcade", "Casual"], "publishers": ["Run Games"], "esrb_rating": null}