{"id": 114024, "slug": "shattered-realms-mortal-tale", "name": "Shattered Realms: Mortal Tale", "name_original": "Shattered Realms: Mortal Tale", "description": "<p>Shattered Realms: Mortal Tale is a fantasy turn based rpg built in RPG Maker XP that pits you, the protagonist against the Lord of Death himself, and puts you on a path to not only save the world, but also your own soul. The game is in an alpha/beta state, with Chapter 1 undergoing several polish sweeps and Chapter 2 in development. The game is being developed by DracoWyrm Media, a group of developers aimed at high quality fantasy rpg development, with Shattered Realms: Mortal Tale being their flagship title.</p>\n<p>The game encourages exploration across a large overworld, and for you to think about your choices, as the story progresses, the choices you made in the previous parts of the game slowly begin to build into an ever increasing web of causality that will dynamically change the very course of the in game universe's history and future.</p>\n<p>Any feedback, comments, or concerns should be forwarded to the main developer, AoDLegacy either on the site or by email at blake@dracowyrm.com. </p>\n<p><strong>Developers:</strong></p>\n<ul><li>AoDLegacy - Artist, Main Writer, Map Designer, Secondary Composer</li><li>Brooke Verel - Character and Cutscene Artist</li><li>Zephyr - Monster Designer and Battle Background Artist, UI </li><li>Eric Matyas - Primary Composer</li></ul>\n<p>If you do not download the RPG Maker XP RTP (Run Time Package) prior to downloading the game <strong>it will not run.</strong> Please make sure to download it (here) before starting your download.</p>", "metacritic": null, "released": "2018-01-30", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/2f9/2f984abe71c2762917b9145a72c8625e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 167, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["AoDLegacy"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}