{"id": 114011, "slug": "eat-all-the-ice-cream-ever-web", "name": "Eat All The Ice Cream Ever! (Web)", "name_original": "Eat All The Ice Cream Ever! (Web)", "description": "<p>Control with ARROW KEYS or WASD. Use ENTER or SPACEBAR for menus.<br/></p><p>Play as Poppy, a girl who has had to face negativity from many people around her about the way she looks. Because of this, she thought she had to abandon one of life's greatest pleasures... ice cream. Well, she doesn't want to listen to other people's opinions about her body anymore. She won't feel guilty about enjoying ice cream because she knows that no matter what she weighs, she looks beautiful!</p><p>This game includes fat shaming phrases, play with caution if you are sensitive to such content.</p><p>Note: We are not saying that you should literally eat a bunch of ice cream at once in real life. The game is exaggerated for humor and as an homage to the silliness of classic arcade games. We of course support a balanced diet and proper exercise, but we also feel that you can enjoy dessert without feeling ashamed, even if you don't fit the beauty standard. We want to encourage people to remember that they don't have to look a certain way to be beautiful.</p><p>Help greenlight this game on Steam: http://steamcommunity.com/sharedfiles/filedetails/?id=461848374<br/></p><p>---</p><p>Designed and programmed by Josh Borge</p><p>Illustrated and animated by Chantal Moosher</p>seafoamgames.com<p>---<br/></p><p>Technical notes:<br/></p><p>We recommend the downloadable Windows version for best performance.<br/></p><p>Sound may not work properly in Internet Explorer. We recommend Chrome or Firefox.</p><p>If you are experiencing any issues, please contact us at contact@seafoamgames.com.<br/></p>", "metacritic": null, "released": "2015-06-14", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/f00/f00dd3a41f8a530bbd3ffae1231d3d97.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 118, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["Seafoam Games"], "genres": [], "publishers": [], "esrb_rating": null}