{"id": 114164, "slug": "looteratum", "name": "Looteratum", "name_original": "Looteratum", "description": "<p><strong><br/>\n<br/>\n</strong>\n</p>\n<strong><em>For 20$ You can get the game, support the developer AND get your name in the game. :)</em><br/>\n<strong><em><br/>\r\n\tNOTE: The game is made to run at 1024 x 768. The UI may be weird in other resolutions, but some should still work. :)\r\n\t<br/>\r\n\tI personally run it at 1024 x 768 windowed. \r\n\t<br/>\r\n\tI will of course try to make the UI so it works for all resolutions.\r\n\t<br/>\n<br/>\n<br/>\n<br/>\n</em></strong><br/>\n</strong>\n<p>\n<strong>UPDATES:</strong>\n</p>\n<p><strong>24th March 2017: V0.9B:</strong></p>\n<p>The Island:</p>\n<ul><li>* NEW LOCATION: GATE OF PASSAGE</li><li>* NEW LOCATION: DINEROS COW FARM</li><li>* NEW LOCATION: DERELICT SHRINE</li><li>* The tops of the tallest mountains now has snow.</li></ul>\n<p>GENERAL: </p>\n<ul><li>* ADJUSTMENT: Dialog UI has been resized a bit, to allow for more text. + A tiny bit of design change.</li><li>* BUGFIX: Apparently the dialogs were only working inside the editor. They should now actually work in the build. </li></ul>\n<p><strong>22nd March 2017: V0.9A:</strong></p>\n<ul><li>* FEATURE: NPCs talk! Sort of. Press E to talk to them. There are currently 5 different things they \"say\" when you talk to them. Randomly selected each time ofc.</li><li>* ADDED: Captain Smash, a NPC whose armor can also be found in the game, now stands guard near the spawnvillage on the island.</li><li>* TWEAK: Adjusted colliders on cow/pig enclosures, so now they hopefully cant escape! (muhahaha)</li><li>* BUGFIX: NPC's had some issues with arms &amp; heads clipping and generally doing weird stuff. They don't any more:)</li><li>* BUGFIX: UI now works on the island.</li><li>* BUGFIX: Jumping can no longer be used to fly . Sorry:(</li><li>* TEMP BUGFIX: Main menu button, messed with the saves. The buttons has temporarily been removed, until the save system has been looked over.</li></ul>\n<p><strong>17th March 2017: V0.9 !<br/></strong></p>\n<ul><li>* HEALTH BARS! All enemies now have healthbars that appear when you get close to them. Making it a bit easier to determine how powerful and enemy you're up against.</li><li>* BLOCKING!!! Attacks can now be blocked (if you time your blocks..) by right clicking ! which will temporarily decrease your damage taken by 2/3 if you time it right.</li><li>An icon appearing on the UI shows you when you are blocking. It might look like you can attack while blocking, but YOU CAN'T Deal damage while you do.</li><li>* JUMPING! Yes, you read it! You can now jump using the spacebar</li><li>* THE ISLAND ! Players can now take a new portal from their village, to...well a Very large island, with villages aswell as enemies and places to explore.</li><li>Enemies here are harder than in the void portal, and they can see you from further away.</li><li>Look for the portal in your village:)</li><li>* TONS of new items added! Game now has 101 unique items!</li><li>* Buildables now have different icons depending on type in buildmenu.</li><li>* Added a lil' thank you in menu to those doing early access!:)</li></ul>\n<p><strong>2nd March 2017: V0.8A!:</strong></p>\n<ul><li> Added lvl 18!</li><li>Added 3 new weapons - All of them 1H spears! Steel Spear, Guards Spear &amp; Golden Spear. </li><li>Added 1 new wearable: The metal mask! 8% Protection + 25% Fire protection</li><li> Added the 3 NPC faces to faces to choose for your player. Making the total of available faces for player 19!</li><li> Added 2 more buildables: Tiny House, and Brazier Light</li><li>BUGFIX: Buildings should no longer be able to build on top of each other.</li></ul>\n<p><strong>28th Febuary 2017: V0.8 !:</strong></p>\n<ul><li>* VENDOR!  A vendor, named Mr. Mox can be built in town, allowing you to purchase 16 randomly selected objects.<br/>The 10 objects will change each time you come back to your village. HE DOES NOT SELL ARMOR THO, Buuhuuu.:(</li><li>* PIGS AND COWS! You can now build a cow or pig enclosure in your village.</li><li>* Portal skill does no longer work in town.</li><li>* Saving has been tinkered with so game saves when you step INTO the portal, and again a couple seconds after you've portaled back.</li><li>* Building Icons, are temporarily set to same icon. Read texts on buttons to know what is what.</li><li>* Reduced Size of NPC names</li><li>* Added Alot of new names, 3 new Faces, and 2 new bodies for NPC's</li><li>* BUGFIX: The deathfields that make the player die when he falls off the level has been killing players at random, when entering a level. I've added a 5 second delay, to prevent them from triggering before the player has been moved to the level start.</li></ul>\n<p><strong>23rd Febuary 2017: V0.7F:</strong></p>\n<ul><li>* Level names now appear on UI - top right corner</li><li>* EXP bar has been moved to bottom of UI, instead of the top of the screen.</li><li>* Lvl 17 Has been added!</li><li>* Monne now appears in the later levels also, instead of only the first couple ones.</li><li>* Revamped the buildmenu. Changed window position to bottom of screen, and buttons now shot price and name of object.</li><li>* Enemies now all have corpses. (Except devil. He vanishes. Cause.. hes the devil.)</li></ul>\n<p><strong>22nd Febuary 2017: V0.7E:</strong></p>\n<ul><li>* New RANGED enemy! Flower, that shoots magic.</li><li>* New MAGIC IMMUNE enemy! Ralph Monne is his name, is a mob that only believes in science and biology, so magic wont work on him! and he plays the harmonica!</li><li>* Added some buttons to UI and hotbar, to remind you of some of the keys.</li><li>* Added visual aid on lootmachine, to show if you've won or lost. Happy smiley for a win, angry smiley for a loss.</li><li>* Purplar, Hotdawger, Squildar &amp; Ralph Monne mobs now leave corpses. The rest will have them in the next update!</li><li>*BUGFIX : Lighting was f'ed in lvl 14. Its been fixed.</li><li>*BUGFIX : Sounds for lootmachine wheren't playing. They are now.</li></ul>\n\n<p><strong>20th Febuary 2017: V0.7D:<br/></strong></p>\n\n<ul><li>* I have chosen to force the game to windowed at 1024x768 for the time being. Only temporary tho.</li><li>* BUG FIXED: LVL 14 Had no end portal, making it impossible to progress. Portal has been added</li><li>*BUG FIXED: Portal into dungeon was broken after loading a save. It should now work normally again.</li><li>*BUG FIXED: Main Menu button in pause menu, apparently didn't work. It works now.</li></ul>\n<p><strong>16th Febuary 2017: V0.7C:</strong></p>\n<ul><li>NPCs now have names, and are randomised in their appearence. The names are all in a .txt file in your saves folder, so you can add your own!:)</li><li>LOOT MACHINE! A machine can now be built in town, where you pay 50 gold to take a chance and win random loot. :)</li></ul>\n<p>\n<strong>\r\n\t15th Febuary 2017: V0.7B\r\n\t</strong>\n</p>\n<ul>\n<li>BASIC NPC'S! Building a house in village, gets you a npc that walks around.</li>\n<li>2 New Levels! Making it a total of 16 levels!</li>\n<li>Removed the return portal from village. Making it a harder decision to portal home, since it will make you have go again from level 1.</li>\n<li>BUGFIX: There was a bug with the loading of your built buildings, so they were in the wrong places. It is now fixed.</li>\n<li>BUGFIX: The portal home button was gone somehow. Don't know why, but its been returned!</li>\n</ul>", "metacritic": null, "released": "2017-02-15", "tba": false, "updated": "2019-08-28T23:24:10", "background_image": "https://media.rawg.io/media/screenshots/4fe/4fe65189c83ce8184a5f61fbea16e1ba.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 238, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Lassebmann"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}