{"id": 11414, "slug": "articydraft-3", "name": "articy:draft 3", "name_original": "articy:draft 3", "description": "<strong>Features</strong><br/><ul><li>Plan non-linear stories<br/></li><li>Write branching conversations<br/></li><li>Control game logic with variables and conditions<br/></li><li>Simulate your story content to find problems early on<br/></li><li>Manage large amounts of game objects (characters, items, ...) <br/></li><li>Sketch locations and communicate level ideas<br/></li><li>Document your game in detail<br/></li><li>Export to Word<br/></li><li>Export &amp;amp; Import to Excel for localization<br/></li><li>Export to JSON or XML to integrate your content <br/></li><li>Integrate your content in Unity easily<br/></li><li>and more…</li></ul><br/><strong>Story, Mission &amp; Quest Design</strong><br/>articy:draft makes the creation of interactive, branching content easy. It’s perfect for your narrative structure design. Each node in your story or mission flowchart can contain an inner flowchart. For example, you can start with a top-level chapter-like structure and break it down into further and further until reaching single lines of dialogue. This nested approach ensures clean and organized flowcharts.<br/><br/>Finally, use the simulation mode to test your flow logic before you export it. By using variables, conditions and instructions you can control the flow your game. For instance, if you want a line of dialogue only to show up when certain conditions are fulfilled.<br/><br/><strong>Unity Integration</strong><br/>Boost your iteration process. Our comprehensive Unity plugin gets your content ready to use to Unity with just a few clicks.<br/><br/><strong>Game Object Database</strong><br/>articy:draft includes a powerful game object database with a flexible template system. Build everything, from characters, items, spells to weapons and skills. Create your objects as templates and use them wherever you need them.<br/><br/><strong>Use And Create Plugins</strong><br/>Automate tasks and customize workflows by using custom plugins. The Macro Devkit enables you to develop your own plugins fast and easily.<br/><br/><strong>Location Planning</strong><br/>With its build-in location editor, a vector-based 2D drawing tool, you can easily plan your game world and single levels. This editor is an iteration-friendly sketching tool for maps and scenarios. You can place story events, spawn points and trigger zones on the map for planning purposes. For some game genres, the location editor can even produce the actual game output. For example 2D layer-based backgrounds for point’n’click adventures or hidden object games.", "metacritic": null, "released": "2017-02-16", "tba": false, "updated": "2019-08-28T22:13:53", "background_image": "https://media.rawg.io/media/screenshots/8f6/8f63eb207739df62ce59451a8b0fc34d.jpg", "website": "http://www.nevigo.com/en/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 21, "dropped": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 347, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["ByteRockers' Games"], "genres": ["Educational"], "publishers": ["articy Software"], "esrb_rating": null}