{"id": 11415, "slug": "strikers-edge", "name": "Strikers Edge", "name_original": "Strikers Edge", "description": "<strong>DODGEBRAWL</strong>: Strikers Edge is a game of dodgebrawl! Use whatever means it takes to bring your foe down from your side of the rift.<br/><br/><strong>GIT GUD</strong>: Get your accuracy on point, anticipate your enemies’ trajectories and get the psychological upper hand to annihilate the opposition! <br/><br/><strong>ONLINE AND LOCAL</strong>: Fight online or locally as one of 8 unique strikers across 4 different arenas. Achieve greatness in 2v2 with a friend or become the top striker in 1v1!<br/><br/><strong>PICK UP &amp; MASTER</strong>: Each striker has its own set of abilities, weapon, stats and playstyles. Which one will you choose and master?<br/><br/><br/><br/><br/><ul><li>Choose among<strong> 8 unique strikers</strong>, each with it's set of abilities, play style and strategies.<br/></li><li>Play <strong>1vs1</strong> and <strong>2vs2</strong> matches, obliterate the opposition in online and local sessions.<br/></li><li>Select between <strong>4 different arenas</strong> with distinct layouts, obstacles and hazards to add to your strategy.<br/></li><li><strong>Easy to learn, hard to master</strong>: pick your favorite striker and get ready to discover all his hidden mechanics, combos and nuances.<br/></li><li>Strikers Edge puts <strong>mind games</strong> front and center. Predict your opponents moves and surprise them with yours!<br/></li><li><strong>Twitch Integration</strong>: Streamers will be able to interact with their audience when playing: viewers can become a member of the crowd inside the game, throw cheer or boo at the players, vote for match modifiers and more!</li></ul><br/>", "metacritic": null, "released": "2017-01-30", "tba": false, "updated": "2022-10-01T23:43:55", "background_image": "https://media.rawg.io/media/screenshots/c6a/c6a9dd5871c7f9975e73421044290d33.jpg", "website": "http://strikersedgegame.com", "rating": 3.0, "rating_top": 4, "added_by_status": {"yet": 6, "owned": 206, "beaten": 2, "toplay": 1, "dropped": 3}, "playtime": 1, "achievements_count": 69, "ratings_count": 7, "suggestions_count": 203, "game_series_count": 0, "reviews_count": 7, "platforms": ["PlayStation 4", "PC"], "developers": ["Plug In Digital", "Fun Punch Games"], "genres": ["Action", "Indie"], "publishers": ["Plug In Digital", "Playdius", "Plug In Digital Label"], "esrb_rating": null}