{"id": 114274, "slug": "arlington-apple-in-an-interplanetary-pickle-nes-ro", "name": "Arlington Apple in an Interplanetary Pickle - NES Rom", "name_original": "Arlington Apple in an Interplanetary Pickle - NES Rom", "description": "Welcome to Team Disposables' third Ludum Dare release! <p>Our second release for the Nintendo Entertainment System, Arlington Apple in an Interplanetary Pickle*,  a short gravity defying platformer. Stuck on a small asteroid, prepare to  frantically scramble over every available surface searching for the three crystals to power up your car and get off this rock.  <br/></p>Install instructions<p>Download the rom and use it on a NES or  in an NES emulator of your choice<br/></p><p>ONLINE</p><p>You can play the game online here (uses flash):</p><p>https://crunchpress.co.uk/nesbox/<br/></p><p>Please note this is the post-ld version! Should you end up playing Mario, rate the emotions you feel. Should you play something by LJN, rate the opposite. We're working on a trust system here, people.</p><p>WINDOWS<br/></p><p>You're awesome, thanks for trying our game. Here's the best NES emulator around for Windows:<br/></p><p>http://www.fceux.com/web/download.html<br/></p><p>Download the ROM file below and run it in this.<br/></p><p>LINUX<br/></p><p>You're the best. Hope you're using TOR too, champ. For NES emulators, you've either already got one, or: http://www.zophar.net/linux/nes/fce-ultra.html<br/></p><p>*was originally called \"A Small World before we decided on a title<br/></p><p>changelog since LD deadline:<br/></p><p>RC3 - bug fix on jump and platform collision</p><p>RC4 to RC7a - more bugfixes, most found courtesy of the lovely people on forums.nesdev.com.  <br/></p><p>post-ludum dare1 - disabled coins</p><p>post-ludum dare 2 - fixed side entrance for anyone who went out the exit before collecting the crystals. fixed unintentional level warp.</p><p>post-ludum dare 3 - coins now collectable. changed crystals  posted the wrong file<br/></p><p>post-ludum dare 4 - corrected file, coins now collecatble and changed crystals<br/></p><p>comments on the game<br/></p><p>the game currently has no sound or music. this may or may not be rectified.<br/></p><p>In the LD version, the coins cannot be collected. They can in the post-LD version, but do not yet do anything. More soon!<br/></p>", "metacritic": null, "released": "2017-04-25", "tba": false, "updated": "2019-08-28T23:24:09", "background_image": "https://media.rawg.io/media/screenshots/e95/e95af3e6ac06d7e876e37997ff5c9da0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 68, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["team_disposable"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}