{"id": 114202, "slug": "santas-christmassy-village", "name": "Santa's Christmassy Village", "name_original": "Santa's Christmassy Village", "description": "<p>\n<strong>Ride along with Rudolph and friends as you fly over and through Santa's Christmas Wonderland from young to old celebrate the sights and sounds of Christmas in stunning VR. Half of all profits will be donated to charity to support those in need this christmas and beyond. Thanks you very much for taking your time to look :)</strong></p><p>Paseo junto con Rudolph y amigos a medida que vuelan a través de Santa's Christmas Wonderland de joven a viejo celebrar las vistas y los sonidos de la Navidad en VR impresionante. La mitad de todos los beneficios serán donados a la caridad para apoyar a los necesitados esta Navidad y más allá. Muchas gracias por tomarse su tiempo para mirar :)<br/></p><p>Ride avec Rudolph et amis que vous survoler et à travers Santa's Christmas Wonderland de jeunes à vieux célébrer les images et les sons de Noël dans VR magnifique. La moitié de tous les bénéfices seront donnés à la charité pour soutenir ceux qui en ont besoin ce Noël et au-delà. Merci beaucoup pour prendre votre temps à regarder :)<br/></p><p>Reiten Sie zusammen mit Rudolph und Freunden, wie Sie fliegen über und durch Santa's Christmas Wonderland von jung bis alt feiern die Sehenswürdigkeiten und Töne von Weihnachten in atemberaubenden VR. Die Hälfte aller Gewinne werden für wohltätige Zwecke an die bedürftigen in diesem Weihnachten und darüber hinaus gespendet werden. Vielen Dank für Ihre Zeit, um zu sehen :)<br/></p><p>Guidare con Rodolfo e gli amici come si vola sopra e attraverso di Babbo Natale Christmas Wonderland dai giovani agli anziani celebrare le immagini ei suoni del Natale in una splendida VR. La metà di tutti i profitti saranno devoluti in beneficenza per sostenere chi ha bisogno questo Natale e oltre. Grazie mille per aver dedicato tempo a guardare :)<br/></p>", "metacritic": null, "released": "2016-11-23", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/92e/92e01bfe34e404d3d56a9ea29d853d19.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 51, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["BNC Entertainment"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}