{"id": 114221, "slug": "the-a-list-in-development", "name": "The A-List (In Development)", "name_original": "The A-List (In Development)", "description": "<p><strong>For now, please don't stream this game or play it on Youtube! I want it to be more finished first.</strong></p>\n<p>The A-List is a short visual novel about a newly formed squad of asexual teen superheroes with \"useless\" powers having their turn to save the day. The prologue of this game was created for the October Rainbow Jam, whose theme was \"combat without violence.\" I intended on working on this during Ace Jam, but didn't do much of anything. Still submitting it to add it to the collection of ace games.</p>\n<p>More about the plot: Our heroine Julia Estevez, a.k.a. The Gray Lady, is just starting her Junior year at Astra Central High School for Metahumans. But, oh no! Not only is she placed into the lowest ranking squad and assigned to community service, but there's some trouble brewing in the school's Gay-Straight Alliance. And what's this about a new villain in town?!</p>\n<p>Every one of the four main characters is on the asexual spectrum and their identities are explicitly named and discussed! There's POC and trans representation! Asexual jokes!</p>\n<p>Right now this is just a super short demo. It's pretty much linear and gives the intro to the story. It should only take about 5 minutes to finish. ~1,600 words.</p>\n<p>Please give feedback in the comments about what you liked and didn't like and what you'd like to see! This is a side project for me though as I work on my Yuri Jam 2017 project, so I may not get to your concerns immediately.</p>\n<p>Note: Reworking a few things about this prologue, so I've removed the download link for now.</p>", "metacritic": null, "released": "2017-10-16", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/c09/c09ce3fc3aa2980cb92fdafe3ab3060e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 84, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Metaparadox"], "genres": [], "publishers": [], "esrb_rating": null}