{"id": 114212, "slug": "lost-cove", "name": "Lost cove", "name_original": "Lost cove", "description": "<p>This game is the final game made for my unity class. I was inspired to make this by my second project 'Blaze tour' I liked the setting of this project but I felt like I could do more with it, I wanted 'Blaze tour' to have a story and a darker atmosphere. The brief for our final project was to expand on a game we had made previously so I decided to try and use the skills I learned through my other games to improve 'Blaze tour'. </p><p>Originally I was planning on making a horror game but when I finished making the world of 'Lost cove' I felt like horror didn't really fit so I decided on mystery. I tried to include elements from my other games like the inclusion of fungus (A unity plugin used for mainly stories). </p><p>I learned a lot from this project both technically and creatively. Technically speaking I learned how to use unity terrain and how how to deal with fps problems, this is definitely going to help me in the future with bigger projects. Creatively I learned a lot about story, I made a good few mistakes in this regard, mainly it was creating a world for a horror story then changing my mind so late into the project, next time I do something like this I'm going to try write the story then create the world around it. If I had done this I think the world would have come out better.</p><p> Despite this I did really enjoy making this game, I made a conscious effort to try not stress over it but to enjoy the work and I feel like that really helped the overall feel of the game. I'm not entirely happy with the project but I do think I achieved what I set out to do, the atmosphere is what I wanted but I would have liked to add more small details to the island to make it feel more alive. Hopefully someday I'll come back to this game and remake it again using new skills. </p><p><strong>Lost cove takes about 5 minutes to complete and is a walking simulator style story game.</strong> Thanks for reading this and let me know what you think of the game!         <br/></p>", "metacritic": null, "released": "2016-05-08", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/86c/86cdc93d6b51d99d571c0afd47ac4bef.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 65, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Kate McNamara"], "genres": [], "publishers": [], "esrb_rating": null}