{"id": 114205, "slug": "ultimate-siege-ball", "name": "Ultimate Siege-Ball", "name_original": "Ultimate Siege-Ball", "description": "<p><strong>[ Update | 03:58PM | 18/07/2017 ] <em>uploaded the Mac and Linux build!</em></strong> </p>\n<p><strong>Ultimate Siege-Ball</strong> is a competitive two player strategy game where the objective is to get the ball in the opponents goal zone at the end of the pitch.</p>\n<p>The ground will rise up wherever your units move creating walls and spires that can be used to fortify your goal zone or lay siege to your opponents. your typical <strong>Siege-Ball</strong> player can't climb more than one unit high<br/></p>\n<p><strong>Siege-Ball</strong> is at its heart, a full-contact sport so feel free to intercept and tackle any opposing (or friendly) units, doing so will send both back to their respective goal zones (it's a useful way to make a hasty retreat) leaving the ball where it is on the pitch.</p>\n<p>Players near the ball will also earn their team more movement points so get stuck-in! Hanging back and building walls is only one side of the game. (sadly as is the nature of a 48-hour game schedule this feature was cut last minute) ;(<br/></p>\n<p><em><strong>-----------CONTROLS-----------</strong><br/></em></p>\n<ul><li>Each unit is associated with a number (1-4).</li><li>Select a unit by holding down its number on the keyboard (it'll change colour).</li><li>Whilst holding its number, move the unit using the arrow keys.</li><li>Each move takes one of your movement points.</li><li>Once all your move points have been used your turn ends and it's your opponents turn.</li></ul>\n<p>--------- have fun y'all ---------<br/></p>\n<p><strong><em>Ultimate Siege-Ball</em></strong><em> in relation to the GDTK theme of dual design:<br/></em></p>\n<p><em>there are only 2 components to <strong>US-B</strong></em><em> and it was my goal to give each as much interconnecting depth as possible.</em></p>\n<p><strong> <em>The Units movement: </em></strong></p>\n<p><strong><em>Moves the ball: </em> </strong>fulfils a key role in the point scoring <em>system. </em></p>\n<p><strong><em>Tackles other players: </em></strong>give the player an extra level of control and strategy by allowing limited control of opposing units (sending them back to their side of the pitch) and the ball.</p>\n<p><em><strong>Creates walls: </strong></em>plays a huge role in the fortify/siege system as the only way to create and remove obstacles that hinder the progress of the base game.</p>\n\n<p><em><strong>The Seige-Ball: </strong></em><br/></p>\n<p><em> <strong>balancing mechanic: </strong></em>by giving more movement points to teams based on their proximity to the ball it allows players under siege more points to build walls and tackle the invading units.</p>\n<p><em> <strong>Scoring system:</strong> </em> by taking the S-ball to the opponents end of the pitch it registers a point.</p>\n<p><em><strong>messes up the neutral-zone:</strong></em> to prevent players from being encouraged to spend too long making neat forts that extended up to the halfway mark (trench warfare isn't very fast paced or fun) a point of contest in the centre of the pitch ensures that the ensuing fighting functions as an effective random map generator that the players then have to fortify as best as possible (also you can't complain about the map seed when you're the one generating it).</p>\n\n<p>Third party resources: Unity 3D</p>\n<p><strong>Contributors:</strong> South_paw (that's me and also the reason I didn't have enough time to put any graphics in the game).</p>", "metacritic": null, "released": "2017-07-16", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/bc0/bc0e1eeb2ccae827f506eee84b6e3d04.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 84, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["south_paw"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}