{"id": 114399, "slug": "night-of-the-living-memes", "name": "Night of the Living Memes", "name_original": "Night of the Living Memes", "description": "<p><em>Night of the Living Memes</em> is an original role-playing game based on my dissertation project.  It was made using <em>RPG Maker Ace VX </em>with the support of the Department of English at the University of Illinois at Urbana-Champaign</p><p>It can be played on any Windows system (you don't need any special software to play). Simply download the zipped file and extract its contents to your Desktop. Then, open the folder and double-click on the Game File with the little dragon logo to begin playing!</p><p>The game is not encrypted, so those of you who own <em>RPG Maker Ace VX </em>and are interested in game development can get inside see how it was made or adapt it to your liking (and if you have any suggestions to make the game better, please feel free to share them).</p><p>For experienced gamers, it will take about 1 1/2 to 2 1/2 hours to complete. Those who are new to turn-based RPGs might take a little longer.</p><p>I welcome suggestions, comments, and bug reports at megancondis@gmail.com</p><p>I plan on creating an optional tutorial and a PDF game manual soon, and so I am especially interested in feedback from people who don't think of themselves as experienced \"gamers.\" What additional information do you need?</p><p>For now here are some answers to frequently asked questions:</p><p><strong>What are the controls?</strong></p><p>Move your character and make selections using the arrow keys. Hold down the shift key to run.</p><p>Make menu selections or interact with objects in the environment using either the space bar or the Enter key.</p><p>Bring up the menu by pressing the Escape key.</p><p>The Escape key will also allow you to cancel out of an interaction or to exit the menu.</p><p><strong>What is HP?</strong></p><p>HP stands for either \"Health Points\" or \"Hit Points.\" They represent the toughness of your character. When your Hit Points fall below zero, your character will collapse. If all the characters in your party collapse, it is Game Over! Health points can be restored by drinking Potions, energy drinks, or coffee, using first aid kits, or casting magic healing spells.</p><p><strong>What is MP?</strong></p><p>Mp stands for \"Magic Points.\" They represent the energy required to cast magic spells. Spells cost different amounts of Magic Points depending on their power. Magic points can be restored by drinking Magic Water, energy drinks, or coffee or using first aid kits.</p><p><strong>What is TP?</strong></p><p>TP stands for \"Technical Points.\" They represent the energy required to execute physical feats. The more difficult the feat, the more technical points will be required to attempt it. Technical points are accumulated in battle when a character successfully performs an action or is on the receiving end of an attack.</p><p><strong>I got a new weapon or a piece of armor. What do I do with it?</strong></p><p>Open up the menu and select Equip. Choose the character that you want to use your new item. Choose the slot where the item belongs and scroll down to replace the currently equipped item with the new one. Make sure that the new item affects your character's abilities positively by looking at the stats screen to the left.</p><p>In this example, equipping a spear will increase Stephanie's attack power, but will slightly decrease her agility.</p><p><strong>What are statistics?</strong></p><p>These numbers represent your character's battle abilities. Different characters begin the game with different base ability sets. You can augment your statistics by earning experience in battle or by equipping weapons and armor.</p><p>Attack (ATK) = physical attack strength</p><p>Defense (DEF) = ability to resist physical attacks from enemies</p><p>Magic Attack (MAT) = the strength of one's magical abilities</p><p>Magic Defense (MDF) = ability to resist magical attacks from enemies</p><p>Agility (AGI) = speed of action, ability to dodge attacks – the more weight you are carrying, the less agile you will be</p><p>Luck (LUK) = the \"X factor\" – occasionally good things will happen to lucky characters and bad things will happen to unlucky ones</p><p>***</p><p>My name is Megan Condis and I am an Assistant Professor in the English Department at Stephen F. Austin State University in Nacogdoches, Texas, where I am the coordinator of the Technical Writing Minor.</p><p>My dissertation project is titled \"The Politics of Gamers: Bodies and Identity in the Age of Digital Media.\"  I am currently working on turning it into a book manuscript.</p><p>I am also serving as a member of the Editorial Board for <em>Resilience: A Journal of the Environmental Humanities</em> published by the University of Nebraska Press.</p><p>I am available for freelance writing projects, technical writing consultations, and speaking appearances upon request. </p><p>Any donations will be put towards my next game projects: Manic Pixie Digital Girl: A Dating Sim About Consent and Respect<br/></p>", "metacritic": null, "released": "2015-09-15", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/1c7/1c7e6afe88fc0e5fee59a3b24ace9aff.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 65, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Megan Condis"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}