{"id": 114306, "slug": "when-the-outsiders-come-in-demo", "name": "When The Outsiders Come In (Demo)", "name_original": "When The Outsiders Come In (Demo)", "description": "<p>Important Note: Right now the game is only available for Windows, I'm working on trying to release it for Mac and maybe even mobile as well. I'll keep you guys updated on that!</p>\n<p>When The Outsiders Come In is a free survival horror game where characters must survive home invasions. In the demo you play as Carter, a normal guy who finds himself trapped in his own house with an intruder. Injured and scared, Carter must use his head to stay alive. You must stay hidden and listen carefully to make sure that the intruder does not find you, pick up items that can be thrown at the intruder just in case he does spot you and give yourself time to run and hide.</p>\n<p>Tips:<br/>-Hiding under beds and in closets will help you lose the intruder but don't stay there for too long.<br/>-Move slowly and listen carefully to make sure that you are safe.<br/>-Keep track of your resources, you don't want to run out.</p>\n<p>A personal note from me:<br/>I started working on this game in 2015 when I was 17 years old and after 3 years of working on it, I have finally made it to this point. As a 20 year old, I still love working on this game and I will continue to support it once the full release comes out. I wanted to thank you for even taking the time to look at the game and thank you even more for downloading and playing it. There's still a lot more to come from this game and I still want to make this game the best it can be so I'm always open to feedback.</p>\n<p>Made in Unreal Engine 4</p>", "metacritic": null, "released": "2018-04-20", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/047/047ad76040d4b220478d1efaa163fd07.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 37, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Younggamer123"], "genres": [], "publishers": [], "esrb_rating": null}