{"id": 114319, "slug": "enclavetd", "name": "EnclaveTD", "name_original": "EnclaveTD", "description": "<p>The Man</p>\n<p>I've just started using Unity for my University studies, and wanted to get some practice building a game from start to finish so this will be my first non-tutorial attempt at a game. Every Ludum Dare I'm amazed at the work that is produced in such a short amount of time, I hope one day I can create something to a similar quality.</p>\n<p>The Game</p>\n<p>My concept is a hex tile based tower defence game where the player has to protect the central city. The building space starts off large and for every tick an enemy is alive, the approaching horde (the map boundary) ever so slightly shrinks. Towers are consumed by the horde if the boundary shrinks past it.</p>\n<p>Starting your build from the center of the map will mean you will lose vital map space early in the game, but invest in towers that will help you for the entire game. Outer rim towers will help kill enemies quickly to slow down the approaching horde, but will be consumed before central towers.</p>\n<p>The Execution</p>\n<p>As my first game I've created, I think I did a fairly decent job. There was still so many things missing: menus, mouse navigation, explosions (the list goes on and on. And on and on...) But it has been an amazing journey and an eye-opening experience. In such a short period of time I have learnt so much and hope to come back for Ludum Dare 43 with a little more knowledge and experience.</p>", "metacritic": null, "released": "2018-08-14", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/810/810c23546ba57f2dc3c9a782f93fb866.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 19, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["DionysusJake"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}