{"id": 114366, "slug": "vr-wand-experiment", "name": "VR Wand Experiment", "name_original": "VR Wand Experiment", "description": "<p>This is a VR experiment, there is no goal or gameplay. You just have a wand, and can do some gestures with it using the trigger. It's not about drawing things in the air, the whole movement needs to be reproduced in order (scale and velocity shouldn't matter too much). The position of the wand doesn't matter in world space, but matters in the spell space (like rotating the wand on its axis). Since I'm right-handed, I don't know if someone left-handed can use the spells, let me know in the comments.</p><p>Available spells:</p><ul><li>summon a pyramid (do a triangle move, top-left-right-top)</li><li>launch a ball (the balls don't do anything, this is a projectile accuracy test, do a circle counter-clockwise move)</li><li>repulse objects (crack the air, top left to bottom right)</li><li>reverse gravity (counter-clockwise spiral from the center, 3 rings will be more accurate)</li><li>wipe objects (\"z\" move, top-left to bottom-right)</li></ul><p>Some spells are more difficult to do, you will need to place correctly your wand while doing it, and sometimes you will do another one instead. That's being a wizard, use your wand not carefully and weird things happen.</p><p>Watch this video to see the movements in action : </p><p>The display on the wand show you the spell index and the accuracy of your movement. If the background of the display is blue (because you pressed the APP button), re-press the APP button of the controller to reswitch in play mode.</p>", "metacritic": null, "released": "2017-01-01", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/16a/16ab0cebe65a4d67d2924ceede161109.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 21, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Archzenvald"], "genres": [], "publishers": [], "esrb_rating": null}