{"id": 11455, "slug": "hellhunter", "name": "Hellhunter", "name_original": "Hellhunter", "description": "<strong>Hunt your nightmares</strong><br/>You're a Hellhunter, the last line of defense between our world and the savage creatures that lurk just outside. By investigating the world around you and reading the evidence you’ll learn more about what you’re hunting and how to kill it. <br/>Use your wits, your experience and your arsenal of monster-hunting tools to rid the world of ghouls, ghosts, demons and everything that goes bump in the night - for the right price of course.Story<br/>You've been tracking a bloody trail across rural Australia for almost a decade, following the beast that took your family. Your hunt has led you to the small town of Windsor Heights. Ever since the reopening of Ravenhall Manor, townspeople have started to go missing and strange sightings have been recorded around the town. From spectral women beckoning people into the fog, to spiders as large as wolves -  Australia is a dangerous place to live. <br/><strong>Become a Hellhunter</strong><ul><li>Tricks of the tradeStart your journey with a flickering torch, rusty gun and a whole lot of guts. Complete jobs to develop your skills and learn more about the monsters that haunt the night. Develop your character and build your arsenal through a detailed RPG and job system. Become an elite hunter and get your revenge.<br/><br/></li><li>Choose your contractsThere are all manner of creatures prowling the streets, from ghosts to hellhounds, monstrous spiders and demons. Which order you take your contracts is up to you, but each monster you slay brings you closer to unearthing the dark truth.<br/><br/></li><li>Hunt, or be huntedHow you clear the town is up to you. You can go in guns blazing and let your shotgun do the talking, or you can plan and research your targets to use their weaknesses against them.<br/><br/></li><li>Study your preyAs a Hellhunter, knowledge is one of your greatest weapons. By reading your environment and uncovering the weaknesses of the creatures you're hunting, you can make it a little easier to slay them. The Cryptonomicon is your Hellhunter guidebook, tracking the creatures you’ve slain and the clues you’ve collected.<br/><br/></li><li>Use your toolsFrom shotguns and booby traps, to silver nitrate rounds and high tech gadgets - there are many tools in your arsenal that can help you fight the darkness. Choosing what to bring with you, and when to use it can be the difference between victory and a grizzly defeat.</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2023-12-08T02:07:52", "background_image": "https://media.rawg.io/media/screenshots/08d/08dc13ca4f82ffaa870abd17a43cf7e5.jpg", "website": "http://www.hellhuntergame.com", "rating": 2.6, "rating_top": 3, "added_by_status": {"yet": 6, "owned": 115, "beaten": 1, "dropped": 2}, "playtime": 2, "achievements_count": 13, "ratings_count": 10, "suggestions_count": 215, "game_series_count": 0, "reviews_count": 10, "platforms": ["PC", "macOS"], "developers": ["Ballistic Interactive"], "genres": ["Action", "Adventure", "RPG"], "publishers": ["Ballistic Interactive"], "esrb_rating": null}