{"id": 114576, "slug": "zero-expectations", "name": "Zero Expectations", "name_original": "Zero Expectations", "description": "<p>Hello! Thanks for looking a little closer at my game</p>\n<p><strong><strong>Updated to version 1.1</strong></strong></p>\n<strong><strong>- Zero Expectations -</strong></strong>\n<p>... exactly what you should play with!<br/></p>\n\n<p>I put this game together as a personal 3 day game dev challenge. Also to work on as a side project while I make my other game - Inhabit. Sometimes its good to take a break. Mostly I just wanted to see if I could stick to the deadline and actually finish a project. Feels pretty good having finished it, and I'm fairly happy with the end result. It has everything I had originally written down as must haves, plus a few extras I thought of - that list keeps growing!</p>\n<p>The sound effects are either curtesy of my daughter (the enemy death pop!), or my violin. Oh and there are a few piano keys in there too! <strong>Zero</strong> background music... no expectations remember!<br/></p>\n<p><strong>Controls:</strong></p>\n<p><strong>W</strong>: Thrusters<br/><strong>A, D</strong>: Rotate left/right<br/><strong>Alternate: W, A, S, D</strong> - Directional movement (also arrow buttons)<br/><strong>Left Shift</strong>: Adds a boost to thrusters<br/><strong>E</strong>: Transfer energy to shields<br/><strong>LMB</strong>: Fire VioBolt (as in violin bolt)<br/><strong>RMD</strong>: Fire VioMissile</p>\n<p>The <strong>ABORT</strong> button in the lower right corner will take you back to the main menu.</p>\n<p>There is currently only one pickup item - what were you expecting?! Sometimes enemies will drop little yellow diamonds which will repower your ships energy, which you can then use to repower your shields - '<strong>E</strong>'.</p>\n<p>Firing weapons (especially VioMissiles),  and using the boost drains the ships energy. Running out of energy will leave your ship unable to fire weapons or use the thruster boost. Make sure you don't run out!!!</p>\n<p>Enemies come in waves, but there is zero respite between waves. There is a sort of knack to defeating them, but it does get trickier as numbers increase. Technically you can't get past wave 50, but I've never made it that far, so who knows what will actually happen?!</p>\n<p>I will continue to add more features and updates to this game - it will probably never be finished - as I have loads of ideas, including adding some proper sprites for ships, adding some random obstacles, and eventually utilising a super awesome light weight galaxy generator I once made many moons ago.</p>\n<p>The next features to be added will be:<br/></p>\n<ul><li>Some sort of wait between waves</li><li>Auto save... or manual save... definitely some sort of save!</li></ul>\n<p>There are lots of features I would like to add to expand the game, but I hope you enjoy playing it as much as I enjoyed making it.<br/></p>", "metacritic": null, "released": "2018-07-10", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/b93/b938eed30146ceb60771f49857114233.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 23, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["42 Pixels"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}