{"id": 114522, "slug": "voices-of-the-past-tasjam-2015", "name": "Voices of the Past (TasJam 2015)", "name_original": "Voices of the Past (TasJam 2015)", "description": "<p><strong>Note:</strong> We had planned to release an updated version of Voices of the Past with VR support and additional music on the 13th of February 2016, but a family loss has slowed that down. The updated version will hopefully be available before the end of the month. Thank you for your understanding.</p><p><strong>Thematic Interpretation</strong><br/></p><p>Voices of the Past attempts to interpret the TasJam theme of voices by framing an elderly person's fragmented memories as a series of narratives or voices that build to create her identity.</p><p>We also believe that elderly people are often the victim of dismissiveness and hope to highlight that rich and full lives hide behind every aged face.</p><p><strong>Post-Mortem</strong></p><p>A retrospective write-up of TasJam and Voices of the Past's development can be found here, along with some notes on items that didn't make it into the game.</p><p>An update to the game was also released on Saturday the 14th of November 2015, to coincide with the start of the second TasJam event. This update includes implementation of unused assets, some typo fixes and writing updates, and some background imagery for interactive objects.<br/></p><p><strong>How To Play</strong></p><p>Use the mouse to navigate scenes from a static viewpoint, using a compass, vertical orientation indicator, colour cues and positional audio as reference points.</p><p>At the beginning of the game, the story's protagonist finds herself is a small room filled with objects that remind her of moments from her life. Click on any object with a \"footprint\" icon to travel into that memory and explore that aspect of her life.</p><p><strong>Third Party Assets</strong></p><p>The game makes use of a number of third party audio files, though music has been composed specifically for this project. Details can be found in the doc folder.<br/><br/></p>", "metacritic": null, "released": "2015-09-13", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/5fc/5fc27d38827b499609d14cc58eec38ae.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 13, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Cheeseness"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}