{"id": 114773, "slug": "verge-edocreate", "name": "Verge (EdoCreate)", "name_original": "Verge (EdoCreate)", "description": "<p>Verge - free simple puzzle game with 30 levels. Goal of the game is lead your figure to Red Star, bypassing or destroying hostile figures. Each level - a specific task in which you have to calculate your steps on the way to the goal. In the first phase you have to arrange the figures on the board, and then put a plan into action.</p><p>Destroy hostile figure, change the position of obstacles as you need, sacrifice some of your figures to one of them reached the goal!</p><p>Management directly at the level:</p><p>1) First you need to choose the type of figures that you want to put on the green square on the playing field. Counter figures to the right of the image shows how much is left of this type of figures</p><p>2) Once all the figures are placed, you need to press the triangle to start the game. To restart the level, press the button with the curved arrow</p><p>3) To select the figure that you want to move, click on it the left mouse button. Then the squares into which you can put this figure will light up green. To move through obstacles and other figures is not possible. Each type of shape has its own rules of movement</p><p>4) As soon as the move made, the hostile figures attack, if your figure is in the area of their ??movement. Sometimes it can be used</p><p>5) To destroy hostile figure, move in its place your figure</p><p>6) To move the yellow wall, move in its place your figure. Pink obstacles walls can not be moved</p><p>7) To finish the level, move your figure to place Red Star</p><p>You can download full game for FREE.</p><p>If you don't want to pay for this game, but you like it and want support me you can download other FREE full version with advertising when start of game:</p><p>Game with advertising:</p><p>https://drive.google.com/open?id=0B96qo-dOesSKNWQx...<br/></p><p>Torrent with advertising:</p><p>https://drive.google.com/open?id=0B96qo-dOesSKc0ZQ...<br/></p><p>Or you can download free full version WITHOUT ADVERTISING, by ordinary way:</p>", "metacritic": null, "released": "2016-11-16", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/462/462684c2a5103c98d5479e1cf890d823.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 16, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["EdoCreate"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}