{"id": 114896, "slug": "whetlands", "name": "Whetlands", "name_original": "Whetlands", "description": "<p>[THIS IS AN INDEV, PRE-ALPHA BUILD}</p><p>Whetlands is a game based on the post apocalyptic fenlands of East Anglia, England. The player leads a band of survivors as they collect food, water, meds and other supplies. Evade and fight bandits, raid other settlements and send survivors into the wastes. This is a turn-based game of strategy that requires to weigh the risk and reward of each choice.</p><p>AUTHOR'S NOTE:<br/>The game IS currently playable and fairly stable but it is missing features that we hope to be adding in the coming months.</p><p>The game also has a very steep learning curve at the moment and other than this guide below, there's is no infomation on how to play.</p><p>The game does have online leaderboard functionality already implemented for V3.1.2 and higher(please note: the server is being run from a raspberry pi and is liable to crash/overheat/ other bad stuff at any time)</p><p>Bugs:<br/>Bug: when continuing a game with no previous save file game may crash.</p><p>QUICK START GUIDE:<br/>(First time)<br/>1: to start the game extract the folder and run Survivor 3.0 alpha.jar;<br/>2: the game should launch, the game will load and show the soko logo, then you will be asked to \"enter name\" you can use only non caps letters(eg: no numbers). once you have entered your name press enter to get to the menu.<br/>3: at the menu you can see the last saves stats(on the left), on the right is the options currently only new and continue work( if you press the exit button it will simply freeze the game).<br/>4: once you press the new game or continue button it will give you a second prompt screen ( just press start) then it will load you into the game.</p><p>How To Play Guide:<br/>Conditions:<br/>There are 5 environmental conditions.<br/>1:Clear Skies: this is the has no positive or negative effects on the survivors.<br/>2: Acid Rain: this has a massive negative effect for the survivors as they can not go outside with out a coat on otherwise they will get ill.<br/>3: Raid: this is where at the start of the turn the Survivors where raided look in the message box to see what happened.<br/>4: Heatwave: this has no effect as yet (coming soon);<br/>5: Flood: this means that there has been a flood at the start of the turn and it will deal 100 damage to flood defences then and damage not absorbed by the flood defence will then damage the Base protection.</p><p>Resources:<br/>FOOD;<br/>Food is one of the two main resources that end the game if the player runs out of them, the survivors need one food ration per-day. food can be searched for or found in raids, in later versions of the game food will be buyable at the market.</p><p>WATER;<br/>Water is one of the two main resources that end the game if the player runs out of them, the survivors need one water ration per-day, water can be searched for or found in raids in later versions of the game water will be buyable from the market.</p><p>MEDS;<br/>Meds are needed to heal any sick survivors, it takes one med for 3 days to heal the sick survivor. if the survivor does not get the medicine for 3 days they will die. meds can be searched for or found in raids in later versions of the game meds will be buyable from the market.</p><p>MATERIALS;<br/>Materials are needed to build defences in the game, they are not used daily but instead are a one time investment. there are 4 things (so far) that can be built using materials Sandbags(increase the flood defence of the base), bored windows( increase the flood defence and over all defence of the base), blockades(increase the flood defence and over all defence of the base), traps( these only increases the defence of the base). materials can be searched for or found in raids in later versions of the game materials will be buyable from the market.</p><p>GUNS;<br/>Guns are rare tools in the Whetlands. Before the events of 'The Storm', the country did not allow most people to have guns. The number of guns will help your team of survivors to raid and defend getting raided. for the gun to be any use the survivors must have ammo for the gun to function. Guns can found in raids and in later versions of the game guns will be buyable from the market.</p><p>AMMO;<br/>Ammo is also very rare in the Whetlands, it is needed to fuel the guns and is used in raids and random events. it can be found in raids and in later versions of the game it will be purchasable from the market and travelling caravans.</p><p>COATS;<br/>Coats are another rare item in the Whetlands as they are needed to prevent survivors getting sick when out in the rain, due to the acid in the rain the coat is destroyed after one use, coats can be found when searching raiding and will be buyable from the market(when added);</p><p>Layout:<br/>Once in the game you will see 6 screens at the top (you will start on the overview screen) these are currently locked as these tabs are still being worked upon.</p><p>Unnamed tab (the chunk of info at the top of the overview screen);<br/>On the top left there is the name of the Base e.g. BASE-SMALL URBAN HOUSE. each of houses have differing benefits.</p><p>Below the base name is the number of actions left. the number of actions that can be taken in a day depend on how many survivors are at the base. when the number of actions left equals 0 it will proceed to the next day/turn</p><p>On the far right of the base name is the day counter this tells you how many days you have survived below the day counter is a next turn/day button( you can use this if you feel that there is nothing left to do that day (e.g. if it is raining and you don't want to risk getting sick you can skip the turn/day).</p><p>ACTIONS COLUMN<br/>In the actions column there is a list of all the things that the player can do. Most of the actions take one action point to complete.</p><p>To carry out the action, click on the action/location (e.g. for searching for food I would click on the word 'Street 20%' that is next to the 'for Food' section) - the % shows the probability of an action being succesfully carried out.</p><p>There are 4 types of actions that can be taken;</p><p>1: SEARCH, this is where the survivor go out to find food, water, meds, other survivors, new places to search and building materials.<br/>for each resource there is 4 places to search these are the shop, the base, hospital and street. the hospital and shop require being scouted for before they can have there resources taken.<br/>next to the location there is a % this indicates how likely you are to find the resource there this % drops each time the location is successively searched and looted.</p><p>2: RAID, this is where the survivors can go and raid a location that has other survivors in, there are 2 types of raid location raids that raid other survivors or nearby houses that have other survivors in them.<br/>The nearby houses are less defended than the Raiders bases but have less loot to be taken.<br/><em>Locations to raid are found randomly when searching for anything</em></p><p>3: BUILD, this is where you can use materials to improve the base that you are currently in by adding sandbags, blockades, bored windows and traps. Next to each build option is a number that tells you how many materials it will cost to make the upgrade.</p><p>4: MOVE, this is the locations that the survivors can move to, it will cost 1/2 the action points to complete and you will lose a set amount of each resource. You may need to move if you run out of storage space, or have looted all the nearby locations.</p><p>HOW TO SAVE:<br/>To save press ESC and click the Save and exit button this will take you to the main menu where you can then continue.</p><p>NOTE: The save is locked to the profile name and to load it again you will need to load the same profile name and press continue.</p><p>The game is developed by Oliver Coe and Craig Macbeth-Hornett. The game's development started in the summer of 2015.</p>", "metacritic": null, "released": "2017-05-08", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/247/247eb53cbac1a9c24e8f1f9c0406ff61.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 64, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["coe"], "genres": [], "publishers": [], "esrb_rating": null}