{"id": 11498, "slug": "legend-of-heroes-trails-in-the-sky-sc", "name": "The Legend of Heroes: Trails in the Sky SC", "name_original": "The Legend of Heroes: Trails in the Sky SC", "description": "<p>The coup d’état that threatened to shake the foundation of the Liberl Kingdom has now come to a close and Her Majesty the Queen’s birthday celebrations are in full swing throughout the streets of Grancel. During that same night, a boy who vowed to make amends for his past disappeared before the girl he loved. Clutched in the girl’s hand was the one thing he left for her to remember him by: a harmonica. Now her journey to find him begins…<br />\nThe Legend of Heroes Series Continues…<br />\nThe tale of Estelle and Joshua concludes in this engaging narrative twice the size of its predecessor. Partner up with either Schera or Agate on over 70 hours of core gameplay to thwart the growing evil that threatens Liberl.<br />\nAn Immersive Adventure<br />\nThe meticulously detailed land of Liberl awaits your return with new quests, new mini-games, new collectibles, and new and familiar locations to explore populated by hundreds of unique NPCs with their own stories to tell.<br />\nExpanded Combat System<br />\nThe series’ staple strategic turn-based system with unmatchable customization has been taken even further with all new arts, crafts, upgraded orbments, and combo attacks.<br />\nAcclaimed Soundtrack<br />\nFalcom’s celebrated Sound Team jdk returns with 44 tracks to underscore the tumultuous resolution of one of the most moving and expansive JRPGs ever created.<br />\nThe Hunter of Love<br />\nMore Olivier than ever.</p>", "metacritic": 80, "released": "2015-10-28", "tba": false, "updated": "2024-04-09T14:30:17", "background_image": "https://media.rawg.io/media/games/a6e/a6e684d3bba3ea0efff95d9d8b1af3ad.jpg", "website": "http://trailsinthesky.com/sc/", "rating": 4.42, "rating_top": 5, "added_by_status": {"yet": 46, "owned": 231, "beaten": 64, "toplay": 29, "dropped": 3, "playing": 10}, "playtime": 11, "achievements_count": 23, "ratings_count": 65, "suggestions_count": 413, "game_series_count": 0, "reviews_count": 65, "platforms": ["PC", "PSP"], "developers": ["Nihon Falcom", "XSEED Games"], "genres": ["RPG"], "publishers": ["XSEED Games", "Marvelous USA"], "esrb_rating": null}