{"id": 114972, "slug": "boxed", "name": "Boxed", "name_original": "Boxed", "description": "<p>For my first ever entry to Ludum Dare, I present to you my submission for Ludum Dare #42! </p>\n<p>Boxed is a very simple game where you rush around trying to deliver parcels to impatient customers before they leave or your warehouse runs out of space!</p>\n<p>I am not a 3D modeller or artist by any rate so the whole game was made as best as I can with the tools and knowledge I had. The art style is very basic but I think it turned out well. I think i \"Might\" have deviated from the initial theme a bit, but I will admit I got carried away haha!</p>\n<p>The controls are very basic and honestly could use work. All controls are listed in the game but I will quickly go over them now!</p>\n<p>Left click: Move<br/>Right-click: Pick up box / Give the box</p>\n<p>To Give a box, Simply right click on the customer in front of the queue (You need to be close enough to interact with them)</p>\n<p>The story of the game is, your colleagues have gone out for coffee during a quiet hour, and you have been left on your own with your friend Dodger Jammie. Out of nowhere many customers started to pour in, so Dodger rushed into the back and started passing you boxes gently to help with the incoming horde of unruly postal office users.</p>\n<p>I do not expect to go far in my first entry, But I hold good expectations with my project just because of its quirkiness. </p>\n<p>I hope you enjoy playing my game, as I enjoyed making it! </p>\n<p>I hope to continue the development of this project when the comp is over! So stay tuned for that! </p>\n<p>Have a good day, My name is Mark Dearman (Devio) and enjoy!!!!!</p>", "metacritic": null, "released": "2018-08-11", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/873/8733ad8bb11a0b08e352748cb37d2632.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 27, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Devio"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}