{"id": 115095, "slug": "apokalypsis-itch", "name": "Apokalypsis (itch)", "name_original": "Apokalypsis (itch)", "description": "<p><strong>DESCRIPTION</strong>:</p><p>The Alpha-Draconian army to which you belong is one of the most powerful of the Galaxy, and you are one of the most capable pilots of this army having fought in countless battles. <br/>But through time, something inside you started changing... <br/>Yet another attack against one of the many unlucky planets is to break out, planet Earth this time. While the targets are getting locked in the crosshairs of your army, you decided to rebel. <br/>You're on your private one-man retaliation mission now, killing your fellow pilots on the planet, destroy the mother ship and free the galaxy forever from this unstoppable threat, hitting directly to the heart, in the underground base on the home planet. <br/>You are however disadvantaged, not only because you alone are up to face an army of millions, but also because your robot was partially damaged in a previous fight and cannot face long periods of battle without overheating in a fatal way for your mission and for you! <br/>Can you defeat the enemy troops and cleanse your conscience?</p><p><strong>TECH SPECS:</strong></p><p>- Genre: Action <br/>- Category: Arcade, Scrolling shoot 'em up <br/>- Perspective: Side view <br/>- Setting: Sci-Fi / Futuristic <br/>- Supported Input Devices: Keyboard + mouse <br/>- Supported Number of Players: 1 Player</p><p><strong>KEY FEATURES:</strong><br/></p><p>- Random levels <br/>- Random Enemies <br/>- 3 difficulty levels (Normal, Hard, Apocalypse) <br/>- 40 levels in total, divided in 4 areas of 10 levels each: Earth, Space, Mothership, Underground Base <br/>- After the completion of an area you'll enter a boss fight before moving on to the new area. There are 4 boss fights in total. <br/>- Shoot and destroy enemies to gather resources for healing your robot <br/>- Upgrade possibilities for your robot by catching random bonus drops. Do not shoot random bonus drops, this will destroy them giving you nothing. Examples of upgrades are increasing your resistance level or your rate of fire, or you can get assisted by pods with random skills.</p><p><strong>CONTROL:</strong><br/>Keyboard: <br/>- Use the WASD keys to move your robot. <br/>- During battle your robot will get damaged. In order to heal the affected area of your damaged robot use the 1-2-3 keys. These healing options are only available after you've gathered enough resources by destroying your enemies.</p><p>Mouse: <br/>- accurately aiming.<br/><br/></p><p><em><strong>Minimum Requirements:</strong></em></p><p><em>CPU: 2.4 GHz Pentium 4 processor or equivalent<br/>RAM: 1.5 to 2.0 GB RAM<br/>OS: Vista SP1, Win7 and up<br/>Video Card: Nvidia GeForce 6 series or better<br/>ATI Radeon series card 9500 series or better<br/>Sound Card: Yes<br/>Free Disk Space: 130Mb</em></p><p><em><strong>Recommended Requirements:</strong></em></p><p><em>CPU: Intel Core i5-750 or AMD Athlon X4<br/>RAM: 4 GB<br/>OS: 64 Bit Windows 7 or up<br/>Video Card: NVIDIA GeForce GTX 650 or better<br/>Sound Card: Yes<br/></em><em>Free Disk Space: 130Mb<br/><br/><strong>Note:</strong> If you buy the game from Itch.io you cannot ask for a Steam key.</em></p>", "metacritic": null, "released": "2016-10-12", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/654/654894745ad4292a18c89f42b04daf7d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 128, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Quantum Entanglement Games"], "genres": ["Action"], "publishers": [], "esrb_rating": null}