{"id": 115066, "slug": "demon-gods-tower", "name": "Demon God's Tower", "name_original": "Demon God's Tower", "description": "<p><strong>The game starts off with the intro. You are a Death Knight who has fought in a few wars. You suddenly hear a voice that tells you about whats happening. The Demon God has awoken and you have to defeat him. You must travel the world and gather the other chosen ones, and make your way to his tower. There are a few playable characters as of now. There are secret characters. The Beta holds the largest cave in the game, maybe. I have fixed allot of things from the Alpha version. If you have played it then thank you for playing. There are a few things I completely forgot to fix, but they aren't major. I used Yanfly's Scripts and i used RPGMaker.net free music file.</strong> <strong>The Logo will be done most likely this weekend. My buddy is making it for me because I have no artistic qualities in my bones.</strong></p>\n\n<p>~I just found out that RPG Maker MV was the most recent application and not VX Ace. So I am smart. I have converted the game over to MV now and am working on it as you read this. The game will be completely different, but also the same. I am working hard on this. I really hope you will give this game a chance. If you like it please share this with your friends. The Demo of this game will probably be out within the next few months. I will get halfway into the game's storyline and end it there for the Demo. If you have any feedback, suggestions, bug reports, or anything that i can do better on please tell me. I am a noob at this and will love any kind of feedback.  The editor for the title screen is working hard on it as well. Once he gets that done I will be setting that as the Main image for the post. It will be wonderful, he is a tattoo artist as well. If you have played the game then thank you and I hope you enjoyed. Stay tuned for more in the future.</p><p>The demo of the game is still underway. I do not know when it will be done. Once it is close to being done I will update this page. Stay tuned for more updates.</p>", "metacritic": null, "released": "2018-05-24", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/950/950f2cc705a59ce2b63690db4af432e3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 140, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["DragonnPanda"], "genres": ["Action", "Adventure", "RPG"], "publishers": [], "esrb_rating": null}