{"id": 11503, "slug": "lost-sector-online-europe", "name": "Lost Sector Online Europe", "name_original": "Lost Sector Online Europe", "description": "Lost Sector Online is a free to play strategy game that combines tactical battles and MMORPG in real time. Action takes place in the streets of Broxton and is centered around team play. Broxton is a huge megacity submerged in a violent civil war, caused by humanity's technological progress.<br/>\n<br/>\r\nLost Sector Online is a 3D online strategy games with great graphics that don't require high-end PC's. Take into account the array of strategies you can carry out, thanks to free movement in battle with which you can skirt around buildings, rooftops &amp; all sort of other obstacles. <br/>\n<br/>\r\nYou can find accurate simulations of projectile trajectories' and their interaction with the environment. Use the environment as cover to defend against enemy fire.<br/>\n<br/>\r\nThe story takes place in the abandoned city of Broxton in the year 2035. The player's character enlisted in the army and abandoned the city when war broke out. Now, back home, even though war is said to be over, a different situation might be found in Broxton. <br/>\n<br/>\r\nPlayers can play through Story mode in co-op mode, and fight in PvP or PvE battles against enemy teams. The game also features a Conquest mode, where the cities map is divided and contested amongst different clans that want to take over the city.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-23T12:12:42", "background_image": "https://media.rawg.io/media/screenshots/a41/a415f2bc1a56192c5d0c965e2a18d230.jpg", "website": "http://lost-sector.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 343, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Lost Sector Technlogies"], "genres": ["RPG", "Strategy", "Massively Multiplayer", "Indie"], "publishers": ["IDC/Games"], "esrb_rating": null}