{"id": 11509, "slug": "ecchi-sketch-draw-cute-girls-every-day", "name": "Ecchi Sketch: Draw Cute Girls Every Day!", "name_original": "Ecchi Sketch: Draw Cute Girls Every Day!", "description": "<strong>Story description</strong><br/><br/>Ecchi Sketch: Draw Cute Girls Every Day follows the story of Yume Akiyama, a girl in her mid twenties who works at a real 'dead-end' job - at a funeral company. Her real passion, however, is anything girl x girl - manga, anime, videogames; if it has cute girls romancing other cute girls, then she's a fan.<br/><br/>A talented amateur artist, Yume is suddenly given the opportunity of a lifetime - to be a mangaka at a manga studio! But with so many other attractive girls at the office... will she be able to concentrate?<br/><br/><strong>Characters</strong><br/><br/><strong>Yume Akiyama</strong><br/>Yume Akiyama, the heroine of our story, is a graphic designer at a funeral company. She’s also a highly talented manga artist and is a superfan of anything girl x girl, be it manga, anime or video games. <br/><br/>Yume’s mother died while she was young, so now she lives with her Dad, a high powered executive at Miyuhara Industries.<br/><br/><br/><strong>Kyoko Miyuhara</strong><br/>Kyoko Miyuhara is heir to the Miyuhara fortune. Her father is the president of Miyuhara Industries, a national company on the Nikkei stock exchange. <br/><br/>After a chance meeting with Yume, Kyoko reveals she runs her own company - Shirayuri Media who create girl x girl manga and doujinshi.<br/><br/><br/><strong>Rin</strong><br/>Rin is the jack of all trades at Shirayuri Media. From shading, to cleaning and colouring, Rin handles the odd jobs. Obsessed with pink, magical girls, and all things cute, Rin often comes across bratty and immature. Underneath, however, she hides a heart of gold.<br/><br/><br/><strong>Megumi</strong><br/>Megumi is a talented storyteller, a hobbyist musician and deep thinker. She often loses herself in her own thoughts... sometimes in the midst of conversation. <br/><br/>She often questions her place in the world, and can come across a little abrasive. Her personal life is a closely guarded secret.<br/><strong>Features</strong><br/>Partial voice acting across 3 major routes.<br/>An original soundtrack.<br/>20+ unique CGs", "metacritic": null, "released": "2017-03-17", "tba": false, "updated": "2019-08-28T22:13:50", "background_image": "https://media.rawg.io/media/screenshots/3d7/3d7e9a7cf7776f78e842dd9b2b02475d.jpg", "website": "http://www.patreon.com/newwestgames", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 4, "owned": 63, "beaten": 2, "dropped": 1}, "playtime": 5, "achievements_count": 4, "ratings_count": 2, "suggestions_count": 195, "game_series_count": 0, "reviews_count": 2, "platforms": ["macOS", "PC", "Linux"], "developers": ["NewWestGames"], "genres": ["Indie"], "publishers": ["NewWestGames"], "esrb_rating": null}