{"id": 115093, "slug": "potatoed-encryption", "name": "Potatoed Encryption", "name_original": "Potatoed Encryption", "description": "<p>A simple (not)addicting, (not)fun edugame in which you must prepare potato salads factorizing number.</p><p>Improve your math skill and impress friends factorizing number with as much as 10 digits.</p><p>The game is fast paced, don't waste time dividing by the wrong number, think about what prime number can divide the product number [and please, don't try to cheat, it's pointless].</p><p>Wonderful music by potato-tan, outstanding and high resolution ascii art made using jp2a, high quality SFX made by me using sfxr and seconds and seconds of time spent pressing the randomize button, state of the art (for the 1970) interface built using the latest version of PDCurses [on *nix ncurses] and code written using the latest industry standard.</p><p>The game is under the CC NC-BY-SA 4.0 INT or equivalent, build your own version if you want [and if you dare to go modifying the code].</p><p><strong>Some comments</strong></p><p><em><strong>-</strong><strong> Pretty cool idea. I like the music a lot... too bad I can't rate it.\r\n<br/>The game is pretty fun too. Could use an explanation of what the goal is but I figured it out pretty quick.</strong></em></p><p>@OinkIguana </p><p><em><strong>- Wasnt really sure what to do.</strong></em></p><p>@Jupiter_Hadley</p><p><em><strong>- This game should not be fun, if you find this fun you encountered a bug.</strong></em></p><p>@MonoS94</p><p><em><strong>- I tried it and i must be honest, it's fun like crazy and very challenging after a while! It'd be perfect as an edugame!</strong></em></p><p>@KosmoKomic</p>", "metacritic": null, "released": "2015-02-01", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/daa/daa7a3c959493abb7bfc7146d177dbb8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 33, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["MonoS"], "genres": ["Educational", "Puzzle"], "publishers": [], "esrb_rating": null}