{"id": 115177, "slug": "beelzebox", "name": "Beelzebox", "name_original": "Beelzebox", "description": "<p>Beelzebox the demon threw you into a small dungeon. Now he sends armies of his most trusted minions down there just to vanquish you. Even if you won't survive, you'll keep fighting wave after wave of hellish bastards, the more you'll take with you the better.\r\n  </p>\n\n<p>Beelzebox is a Diablo- inspired action RPG. Currently in alpha stages, with many intended features implemented, but still requiring a lot of polish, tweaking, balancing and FEEDBACK to be fun and challenging.\r\n  </p>\n<p>The lastest demo build includes a single level and an endless torrent of spawning enemies you'll have to look for around the dungeon.\r\n  </p>\n<p>Anyone who played an ARPG should know how to play the game but you should still keep these tips in mind:\r\n  </p>\n<ul><li>The purple bar on the bottom of the screen indicates your XP. When you gain a level you'll receive a skill point that you can use to upgrade on of the two available skills.\r\n  </li><li>Unfortunately the only equipment pieces that have working stats are weapons. Be on the lookout for better arms.\r\n  </li><li>Remember - the longer the name, the better the weapon. Look at their stats and choose the one that will most effectively kill your foes.\r\n  </li><li>Health potions and mana potions will help you survive. Use them in inventory with the right mouse button or add them to your belt, either through dragging them there or shift+clicking. Potions in the belt can be activated with keys 1 through 5.\r\n  </li><li>After you add points to the meteor skill, choose your skills by clicking on the skill icon next to the mana globe to the right.</li></ul>\n<p>Keybindings:\r\n Left click – attack/move </p>\n<p> Right click – activate skill </p>\n<p> C – skill screen </p>\n<p> I – inventory screen </p>\n<p> Alt – highlight all items\r\n  </p>\n<p>\n</p>\n<p>The original prototype was made for the 1roomRPGjam, our first ever entry in a game jam. The project started a bit late (17th of February) but we keep developing it! We plan to add more skills, items and overall fun (perhaps through the inclusion of multiplayer). Two jam prototype versions are available, for either 64-bit or 32-bit Windows users.\r\n  </p>\n<p>\n</p>\n\n<p>Main credits:\r\n  </p>\n<p>Shodanon - design, coding, art and sound\r\n  </p>\n<p>JackKm - systems coding\r\n  </p>\n<p>Jabsley - composer\r\n  </p>\n<p>WoJiaoAnna - ideawife\r\n  </p>\n<p>All our love goes to friends that supported this project during all the crunch time we poured into it, especially our idea guys and constructive critics: Zlug, Anarchizer, Thrudgel and Szyszek. Shout outs to /agdg/</p>", "metacritic": null, "released": "2017-02-20", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/d44/d44ee00a030f2d9bfdc57fe95152567f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 257, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Shodanon"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}