{"id": 1151, "slug": "gemini-strike-space-shooter-rpg", "name": "Gemini Strike: Space Shooter RPG", "name_original": "Gemini Strike: Space Shooter RPG", "description": "Blast your way through enemy ships, evade fiery asteroids, sneak through blockades and face off against epic bosses in this action packed space shooter! Then when the blasting is done, raid cargo ships to find procedurally generated items to customise your fighter. <br/><br/>With a zillion different modules to mix and match (shields, missiles, lasers, beams, healing, EMPs) you are never short of ways to turn squads of enemies into beautiful cosmic fireworks.\u2028<br/><br/>* Destructive physics - enemy ships spin out of control and smash into each other!\u2028<br/>* BIG boss fights!\u2028<br/>* BIG explosions!\u2028<br/>* RPG Hybrid - tons of procedurally generated items!\u2028<br/>* Secret boss and cargo missions appear on the map!<br/>\u2028* Engrossing characters and storyline!<br/>\u2028* 100 sectors of glorious destruction!<br/>* Classic space shooter gameplay with a twist.<br/><br/>*** UPDATE 1.1.0 ***<br/>Now updated with brand new bosses, enemies, ships and story!<br/><br/>*** THE GEMINI STRIKE GUARANTEE ***<br/>Gemini Strike is a game with a high skill cap. All levels and bosses can be beaten with normal ships, items, and without using Credits to revive. If there is an especially difficult boss or level that you think cannot be beaten, please post it to us on the Gemini Strike Facebook page! We love a challenge and will attempt to beat it on video with a standard ship and items!<br/><br/>Visit our page: facebook.com/GeminiStrikeGlobal<br/>Join us! We&amp;#39;d love to chat and hear your feedback. Tell us what you&amp;#39;d like to see added or removed!<br/><br/><br/>--- LOST DATA? WE CAN HELP!  ---<br/>After updating, if you seem to lose your online account, or the data seems &amp;#39;reset&amp;#39; do not worry! The data is safe, but due to some changes in the way the game finds your ID, it may not be able to find the account at first. It happens to very few users, but if you experience this problem please drop us a message on our support page, or email me at Krin@ArmorGames.com and we can help you get it back.", "metacritic": null, "released": "2014-09-04", "tba": false, "updated": "2019-10-22T14:27:38", "background_image": "https://media.rawg.io/media/screenshots/c5e/c5efd3ae68abdda7b8f5997826097388.jpeg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 94, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["Armor Games"], "genres": ["Action", "RPG"], "publishers": ["Armor Games"], "esrb_rating": "Teen"}