{"id": 115128, "slug": "boink-zoink-hoink", "name": "Boink Zoink Hoink", "name_original": "Boink Zoink Hoink", "description": "<p><strong>Match them All!<br/></strong></p>\n<p>Place <strong>fun pieces</strong> on the board to match similar ones and build new pieces or destroy others.</p>\n<p><strong>Think strategically</strong> where you place your pieces to make your matches at the right spot, and get higher-order pieces.</p>\n<p>Search for <strong>special items</strong> to help you beat harder levels.</p>\n<p><strong>Challenge your mind</strong> to complete carefully crafted puzzles.</p>\n<p><strong>Relax</strong> in a playful atmosphere that will make you feel at ease.</p>\n<p>Experience <strong>various gameplays</strong> of Match-2, Match-3 or Match-4, and other twists.</p>\n<p>Enjoy a diversity of playable sets by <strong>different artists</strong>, from cute little fuzzy animals to cartoon monsters, fashionable hats, yummy sweets, scrumptious cakes, legendary fantastic beasts, dragons and much more to come...</p>\n<p><strong>Keep your sanity:</strong></p>\n<ul><li>Play <strong>offline</strong> anytime anywhere (NO Internet connection required)</li><li>NO account, NO email, NO phone number required</li><li>NO in-game currency to artificially hamper your progress</li><li>NO ads! NO loot boxes! NO fine prints!</li></ul>\n<p>You can try it for free on Google Play (download here) to help you decide if you want to play Boink Zoink Hoink on Windows PC (Linux, Mac coming soon), and maybe go further and grant us your valuable support!</p>\n<p>itch.io gets a 50/50 split on every amount you can contribute.</p>\r\nMany ways you can help:\r\n<ul>\n<li>Buying the game, right here, right now, on itch.io</li>\n<li>Playing Boink Zoink Hoink on Google Play</li>\n<li>Subscribing to the BZH314 Youtube channel (100 subscribers needed to get the BZH314 vanity url for the channel! Pretty please :-)</li>\n<li>Following us on Twitter @BZH314</li>\n</ul>", "metacritic": null, "released": "2018-03-06", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/5c2/5c2a25bd8c047976f23193c48daa5ae0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 110, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["BZH314"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}