{"id": 115156, "slug": "woodlands-alpha", "name": "Woodlands Alpha", "name_original": "Woodlands Alpha", "description": "<p><strong>Woodlands Alpha</strong></p><p>An<em> Early Access Tech Demo</em> of a survival RPG based game. Full Description Below.</p><p><strong>IMPORTANT (PLEASE READ): </strong></p><p><strong><br/>This game is created solely by one guy</strong>. It has been a lot of work for him, and he puts what ever free time and money into it he can. The game is semi slow moving in the development, but it is getting better all the time. Any builds you download now are just a lightweight demo of the full game. <strong>IT IS NOT A COMPLETE GAME</strong>. So therefore you should not base full opinions on the game as if it were so. The creator of this game works hard every day with what he has, just to make this game. This page is solely to keep everyone up to date on the games development. I only release downloads to get help and constructive criticism from the community. If you are about to rate the game poorly, take a miniute, and think about what this game is, what it means, how it is created, and from what perspective it is being made. <strong>If you think a low rating is appropriate for this early work in progress, then give a reason behind why you think so in the comments.</strong> Do not just rate, and leave. It hurts the game, the developer, and pushes the game further from its full potential. Thank you for all your time and support.</p><p><em><strong>What is Woodlands? </strong></em></p><p>Woodlands is a first person survival-sandbox game! <strong>Hold on there! I know what you are thinking</strong>,<em> \"Oh just another Minecraft Remake\"</em>. That is absolutely wrong. This game is based around a completely different mechanic, the game is based on realism. This means there are no zombies, skeletons, or giant spiders! They <strong>DON'T</strong> exist! Woodlands is a game with a goal to bring a new reality to a more realistic sandbox. Get ready to immerse yourself into a virtual reality where real life challenges put you skills to the test. Whether you're freezing from hypothermia, or running from a Grizzly in the wild... it's entirely up to you. </p><p><em><strong>(Oculus Rift support coming as well!)</strong></em></p><p>Will you descend into the Woodlands?</p><p><strong>Current State: Alpha 1.0.2</strong></p><p><strong>Make sure to check out and like Winterlake Productions Facebook page:</strong>https://www.facebook.com/WinterlakeProductions</p><p>We keep an up to date blog there for more information as well as our website:</p><p><strong>http://www.winterlakeproductions.com (Currently Down)</strong></p><p>I always accept donations, it costs a lot to make games. If you want to help contribute to my dream, and my hard work, then please donate here any amount.</p><p>Thank you</p><p>-Seth Lead Dev</p>", "metacritic": null, "released": "2014-11-15", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/41b/41b7bb44d0ab9ad64e2a4dee2657cc17.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 109, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Winterlake Productions"], "genres": ["Adventure", "Fighting"], "publishers": [], "esrb_rating": null}