{"id": 115163, "slug": "evolution-planet-gold-edition-2", "name": "Evolution Planet - Gold Edition", "name_original": "Evolution Planet - Gold Edition", "description": "<p><strong>GAMEPLAY</strong></p><p>Combine creatures in groups of three so they turn into a single stronger creature and uncover new transformations while you face the dark side of evolution in battles that will put all your strategic skills to the test.</p><p>Evolution Planet Gold is a twist of the usual match-3-games. It is more tactics-focused, fairer and more challenging for the player. In Evolution Planet Gold you cannot just move without having a clear idea of where you are going. Planning ahead and being able to respond to any given set of circumstances are crucial. </p><p>It features two game modes, each of which takes advantage of the game mechanics in its own way. The objective on the Campaign mode is to make your way along the map overcoming the challenges on each level, unlocking new islands and bonus levels, and fighting battles against final bosses.\" The Survival mode is a potentially infinite game level with an unlimited number of creatures, where the most important thing is strategic freedom when it comes to facing the hordes of mutant enemies.</p><p><strong>KEY FEATURES:</strong></p> <ul><li>Each level offers a different challenge: eliminate enemies, set your allies free, defeat final bosses, evolve in a limited amount of time… </li> <li> </li> <li>Special items and power ups such as the DNA and the meteorites let you use alternative strategies to overcome the challenges.</li> <li> </li> <li>More than 90 levels on 6 islands which provide endless playing.</li> <li> </li> <li>Stunning audiovisuals with a great variety of animations, settings, atmospheric effects and music adapted to each situation. </li> <li> </li> <li>Two different game modes: Campaign and Survival.</li> <li> </li> <li>It is not a free-to-play game: once purchased, the game does not include any content requiring extra payment, blockings or ads. </li></ul>", "metacritic": null, "released": "2016-02-29", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/5af/5af7d4c39ab4c836117c9980bd597748.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 74, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Play Wireless"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}