{"id": 115133, "slug": "marshals-myrmidons-adventures-in-astrakhan-demo", "name": "Marshals & Myrmidons: Adventures in Astrakhan Demo", "name_original": "Marshals & Myrmidons: Adventures in Astrakhan Demo", "description": "<p>\nMarshals &amp; Myrmidons (M&amp;M) is an update to the way tabletop Role-Playing Games are played.\r\n</p><p>\n</p><p>\r\n\tMarshals &amp; Myrmidons is a new type of table-top RPG that incorpates the power of videos game with the flexability and continuing nature of a table-top game. It is built on what we call the Adventure Wheels Framework.\r\n</p>Support us on Steam Greenlight<p>\n</p><p>\r\n\tThe Adventure Wheels Framework allows for many different types of user generated content. Integrating those with the Steam Workshop would allow GMs to quickly and easily share content with each other and provide endless new experiences for players.\r\n</p>Key Features<ul>\n<li>Built-in map system that allows for the same scaleability as Google Maps\r\n\t<ul>\n<li>The  map system allows for near unlimited user-created map sizes by breaking down large maps into tiles and zoom levels.  </li>\n<li>Easily allow for a planet-wide map that can be zoomed all the way down to a city level.  </li>\n<li>The city level zoom can also be done as a linked map that has it's own zoom levels.</li>\n<li>The built-in markers allow the GM and players to keep track of where everyone is and any significant details on the map.  </li>\n<li>Markers can be assigned custom names that make keeping track of everything easy.  </li>\n<li>Each map has a built in scale and measuring tool to easily determine distances.</li>\n</ul>\n<br/>\n<br/>\n</li>\n<li>Built-in solar system tool to create whole a galaxy (Not in Demo)\r\n\t<ul>\n<li>The built-in solar system tool allows for easy dynamic creation of an inner solar system.  </li>\n<li>The planets orbit their sun or suns and can have moons as well.  </li>\n<li>Each planet and sun can be assigned data points that describe the planet's class, size, gravity, technology level and population.  </li>\n<li>The day and year length are calculated based on parameters set in the editor.  </li>\n<li>The suns can be assigned a type and luminosity / size class as well, as diameter, temperature, and gravity.</li>\n<li> All  parameters are optional, and are there to enhance game play.  </li>\n<li>The planets and suns can be linked directly to their manual entry and a map of the surface.  </li>\n<li>The editor can quickly generate a new system that is fully populated as a starting point for adding your own content.</li>\n</ul>\n<br/>\n<br/>\n</li>\n<li>Integrated HTML documentation\r\n\t<ul>\n<li>The HTML manual is simply HTML pages that are named for each topic in the game.  </li>\n<li>It  can be displayed at any time to share information with players or for the game master to look up details.  </li>\n<li>When designing your own game in the framework instead of using local HTML files, the framework can be redirect to a website of your choosing, like a wiki.</li>\n</ul>\n<br/>\n<br/>\n</li>\n<li>Adventure Wheel system that converts your lookup table into interactive wheels\r\n\t<ul>\n<li>Lookup tables can be replaced by the Adventure Wheel system.  </li>\n<li>Each wheel has 36 entries separated into 3 rings that will spin a randomized pairing.</li>\n<li> The wheels can be fully customized to include anything.  </li>\n<li>Each entry in the wheel can be linked to a page of the manual</li>\n<li>Inventory items can be assocated with each entry to allow sending to players quickly.</li>\n</ul>\n<br/>\n<br/>\n</li>\n<li>Wheel spin history\r\n\t<ul>\n<li>Each time the wheels are spun a record of it is made by the game.  </li>\n<li>This can make it easy to go back and review the results and end arguments about what was spun earlier.  </li>\n<li>This history can also be saved out to a file.  It is also sent to the connected clients as the wheels are spun.</li>\n<li>The history can also be used to open the associated manual entries from the wheel entry.</li>\n</ul>\n<br/>\n<br/>\n</li>\n<li>Fast character generation\r\n\t<ul>\n<li>A subset of the Adventure Wheel system is the character generation wheels specific to Marshals and Myrmidons.  </li>\n<li>A new character can be spun in less that 15 seconds, and with multiple options to generate the player's character sheet.\r\n\t\t<ul>\n<li>The game can send the character to our on-line tool that will generate a printable PDF file for the character with everything pre-filled in.  </li>\n<li>Or, if using the Character Exposition app, a quick code can be entered or sent by the game to pre-load the character into the app.</li>\n<li>Or the details can be copied by hand onto a printed Character Exposition sheet.</li>\n</ul>\n</li>\n</ul>\n<br/>\n<br/>\n<br/>\n<br/>\n</li>\n<li>Random NPC generation\r\n\t<ul>\n<li>From time to time, non-player characters need to be created by the game master.  While some might find this an easy task, it isn't for everyone.  </li>\n<li>This  tool  quickly generates a unique NPC with parameters to control where the NPC is from, what gender, race, and profession classes the NPC comes from.  </li>\n<li>There is also control over their spouse's gender and name.  </li>\n<li>Nearly every aspect of the generator can be customized, including the 7 generated stat names and ranges.  </li>\n<li>Finally the generated NPC can be exported to an HTML file for later reference or to be printed.</li>\n</ul>\n<br/>\n<br/>\n</li>\n<li>NPC / animal group generation\r\n\t<ul>\n<li>The group building tool is used to create a realistic group of NPC or animals.</li>\n<li>The framework includes a system that utilizes multiple parameters to generate a seemingly realistic groups.  </li>\n<li>Each type of entry has factors that affect it's rarity and the size of a typical group, so that for instance a group of NPC might only have 1 king or maybe 1 spy but a bunch of soldiers or peasants.\r\n\t\t<ul>\n<li>The same holds true for the animals.  </li>\n</ul>\n</li>\n<li>Each NPC can be filtered by technology levels or different classifications like royalty.\r\n\t\t<ul>\n<li>Animals can be filtered by the environments and climates.</li>\n</ul>\n</li>\n</ul>\n<br/>\n<br/>\n</li>\n<li>Transportation item group generation\r\n\t<ul>\n<li>The group building tool can also be used to create a realistic group of modes of transportation.  </li>\n<li>The framework includes a system that utilizes multiple parameters to generate a seemingly realistic group.</li>\n<li> Each type of entry has factors that affect it's rarity and the size of a typical group.  </li>\n<li>The modes of transportation can be filtered by their uses and technology levels.</li>\n</ul>\n<br/>\n<br/>\n</li>\n<li>Game Rooms for player clients to quickly send items and other game assets\r\n\t<ul>\n<li>The system can create a game room that others running the Character Exposition app can join.  </li>\n<li>When they join the room they can send text messages to the game or to other players.  </li>\n<li>Any wheel spins are automatically sent to the clients.</li>\n<li>When a new character is spun, the code to automatically add it to the client is sent to be used at any time.  </li>\n<li>Inventory items can be sent back and forth to any client, and if a wheel has items that might go into the inventory, they will be automatically added to the interface so they can be sent by the GM.</li>\n</ul>\n<br/>\n<br/>\n</li>\n<li>No paper or dice is required, just a laptop or tablet and smart phones </li>\n<li>Dungeon mini-games that bridge table-top and video games  (Not in Demo)\r\n\t<ul>\n<li>Allows up to 10 characters to explore a procedurally generated map.</li>\n<li>Includes a limited view radius so players can't see the whole map.\r\n\t\t<ul>\n<li>Can also fill in the fog as they move only allowing the immediate area to be visible.</li>\n<li>Removes player knowlege of the whole map so they are forced to discover it with their character.</li>\n</ul>\n</li>\n<li>Button puzzles can be included to set traps or control doors, or anything else.</li>\n<li> Included are tools to generate dungeons quickly and populate them with anything.</li>\n</ul>\n<br/>\n<br/>\n</li>\n<li>Puzzle mini-games that allow complex interactions  (Not in Demo)\r\n\t<ul>\n<li>The free form button puzzles that can be used to simulate traps, or consoles/panels, or any other type of interaction of that nature.</li>\n<li>Objects can be placed anywhere and connected together to perform actions</li>\n<li>Types of actions include\r\n\t\t<ul>\n<li>movement</li>\n<li>rotation</li>\n<li>scaling</li>\n<li>starting count downs</li>\n<li>touching other objects</li>\n<li>link to a map, wheel, or another mini-game</li>\n<li>play sounds</li>\n<li>move along a path</li>\n</ul>\n</li>\n</ul>\n<br/>\n<br/>\n</li>\n<li>Connect the pipes puzzles  (Not in Demo)\r\n\t<ul>\n<li>The “pipe\" style games similar to Pipe Dream where a series of tiles have to be aligned without leaks to connect points on the map.  </li>\n<li>They are not limited to just that, the tools from the button puzzles can be included to increase the interactions.  </li>\n<li>They come in four varieties to meet most needs:\r\n\t\t<ul>\n<li>Random queue mode where a never ending queue of randomly generated pieces are given to solve the puzzle.  </li>\n<li>Rotation mode where all the pieces are placed and must be correctly rotated.  </li>\n<li>Swap mode where each tile clicked with swap with the tile in the queue.</li>\n<li>Inventory puzzle where a predetermined inventory of pieces are given to solve the puzzle.</li>\n</ul>\n</li>\n</ul>\n<br/>\n<br/>\n</li>\n<li>Customizable mini-game graphics and all mini-games can interact with the other mini-games\r\n\t<ul>\n<li>All the mini-games can be extended with custom graphics and sounds to accommodate any look and feel required by the situation.  </li>\n<li>They can also be linked to other mini-games, maps, or wheels to increase the immersion.</li>\n<li>The results of one mini-game can be passed to affect another mini-game, like solve a puzzle will open a door in the dungeon.</li>\n</ul>\n</li>\n</ul>", "metacritic": null, "released": "2015-03-24", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/3f7/3f75be069aac17f205c2b5da22fcc6eb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 299, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux", "Android"], "developers": ["dalvis"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}