{"id": 11529, "slug": "tom-vs-the-armies-of-hell", "name": "Tom vs. The Armies of Hell", "name_original": "Tom vs. The Armies of Hell", "description": "Tom vs. the Armies of Hell is a challenging indie Action-Adventure game from Darkmire Entertainment. You play Tom, a down-trodden software-engineer turned reluctant half-demon hero when an experiment gone awry sends his entire office complex plummeting into Hell. <br/><br/>Armed with an experimental gun that turns captured souls into high-tech, multi-colored death, as well as his newly acquired demonic powers, Tom must not only survive, but also unravel the mystery of what caused this \"accident\", and how he can get home. Along the way Tom will be aided (or more accurately, bossed around) by Beezle, the purple imp that saved him from the initial demonic invasion. Together they'll face a horde of mindless ghouls, vicious demons, and an army of magically animated junk automatons, just for starters.<br/><br/>So grab your trusty Soul Blaster x9000, duct-tape some phone-books to your extremities, and blast your way through the plains of eternal damnation!Key Features<ul><li>Enjoy a story-driven single-player campaign -- just like mom used to make! <br/></li><li>Blast away with a dynamic gun system, where absorbed souls turn into rainbow-colored death.<br/></li><li>Laugh out loud with an original, humorous story revealed across six challenging levels.<br/></li><li>Stare at beautifully animated 2D and in-game cutscenes.<br/></li><li>Mow through hordes of procedurally placed enemies. No two playthroughs are exactly alike!</li></ul>", "metacritic": null, "released": "2016-07-27", "tba": false, "updated": "2019-08-28T22:13:49", "background_image": "https://media.rawg.io/media/screenshots/da9/da906d2bd09641f820104987639cbe8a.jpg", "website": "http://www.darkmire.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 4, "beaten": 1}, "playtime": 1, "achievements_count": 31, "ratings_count": 1, "suggestions_count": 377, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "macOS"], "developers": ["Darkmire Entertainment"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Burgoon Entertainment"], "esrb_rating": null}