{"id": 115206, "slug": "robbery", "name": "Robbery", "name_original": "Robbery", "description": "<p>'Robbery' Out Now -</p>\n<p>AHOT / Stream / Download: http://coldcut.lnk.to/robbery</p>\n<p>Taken from 'Outside The Echo Chamber' released 19th May via Ahead Of Our Time:</p>\n<p>http://CCxOnU.lnk.to/otec/</p>\n<p>Follow Coldcut -</p>\n<p>Facebook: http://found.ee/coldcut-fb</p>\n<p>Twitter: http://found.ee/coldcut-tw</p>\n<p>Soundcloud: http://found.ee/coldcut-sc</p>\n<p>Spotify: http://found.ee/coldcut-sp</p>\n\n\n<p>\r\n\tRobbery - the Coldcut Game</p>\n<p>'Heads will roll'</p>\n<p>Robbery feat. Rholin X is a new release from the Coldcut x On-U Sound album 'Outside The Echo Chamber'. The track is also available as a new format, this free videogame. </p>\n<p>\r\n\t'Robbery' is a 3D Virtual Surreality® game set in a world where the banks have stolen everyone's savings, the Gov let them get away with it, and people are left with the bill. Maybe not that surreal then. You're given the help of Coldcut who imprison the main Bankstr in a crystal ball. But it's down to you to deliver justice and save the world, overcoming many challenges to arrest, charge and jail the miscreant in three increasingly difficult levels of Marble Madness-style rolling action.\r\n</p>\n<p>\r\n\tTopical with recent revelations of the Bank of England and Tory government involvement in the huge LIBOR fixing scandal, the game is a satirical comment on probably the World's biggest crime of all time: the ongoing heist of the global economy by the Bankstr inner circle. With a trademark banging beat mixed by Adrian Sherwood (On-U Sound) and featuring JA vocalist Rholin Xs musing on who's really robbing who, each level has a different rub of the track to which your gameplay adds extra sounds. On completing the game, the user gets a bonus track. The cut'n' paste graphics nod to Terry Gilliam and sample Gillray, the leading caricaturist of the 18th Century. Ninja Tune co-founders Coldcut are again mashing up music, media and political satire in fine style. </p>\n<p>\r\n\tFor those wanting to dig deeper, the game has an info link to a coldcut.net Robbery knowledge page. Coldcut commented:\r\n</p>\n<p>\n<em>'The 2009 'financial crisis' was just one moment in a big global rip-off whereby the 1% continue to grab more of everything from the 99% (you) - here's how that actually works'</em>\n</p>\n<p>\r\n\tThe page contains documentaries, videos, books, journalism, campaigns to join, infographics and memes. A decent information library focused on Banking and Inequality. This is part of an ongoing Coldcut 'Infobone' MOOC project, a free online teaching resource to inform and inspire activists.\r\n</p>\n<p>\r\n\tWarning : The game is addictive, and tough. But getting the Bankstrs into jail was never going to be easy. Expect much phone twisting action, frustration and mirth on the Tube, esp. In the City of London area. How are your rolling skills?\r\n</p>\n<p>\r\n\tRobbery feat. Rholin X is taken from Coldcut x On-U Sound's 'Outside The Echo Chamber - released 19th May via Ahead Of Our Time - available digitally, on CD and as part of a limited 7\" box set.\r\n</p>\n<p>\n<br/>\n</p>\n<p>\n<br/>\n</p>", "metacritic": null, "released": "2017-04-25", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/40e/40e15c98726ad216515966781c8726c1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 121, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "Web"], "developers": ["Ninja Tune"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}