{"id": 11520, "slug": "albino-lullaby-episode-1", "name": "Albino Lullaby: Episode 1", "name_original": "Albino Lullaby: Episode 1", "description": "Albino Lullaby is a horror adventure game that doesn't rely on jump scares or gore. A Lynchian psychological nightmare where you play as yourself. Escape from a dark and surreal Victorian town that clings to the precipices of underground cliffs. The gamespace dynamically twists and contorts around you in real time, as you unravel an equally twisted narrative. Discover the hidden spaces haunted by 'The Grandchildren' as you uncover clues to understanding just where and what you are. Albino Lullaby is set for initial release on the PC and will be fully VR compatible.  <br/><br/><strong>Game Features</strong><ul><li><strong>The Next Gen of Adventure Games</strong> - Player driven pacing, no cutscenes.<br/></li><li><strong>Transforming Gamespace</strong> - Mechanical mansion deconstructs around you.<br/></li><li><strong>Environmental Storytelling</strong> - Deep background of characters and events, conveyed through the gamespace.<br/></li><li><strong>Different Play Styles</strong> - Sneak or gung ho!<br/></li><li><strong>Episodic Releases</strong> - Pay as you go or get a season pass.<br/></li><li><strong>VR Ready</strong> - Built from ground up to play great on the Oculus Rift, Vive and Morpheus.</li></ul><strong>Developed by Ape Law.</strong>To make game for to give to man! Ape Law exists to explore and experiment with games as the next great storytelling medium and was formed by Justin Pappas in the summer of 2013 in Cambridge, Mass. Justin has worked as a level designer on games like 'BioShock: Infinite' and the 'Tomb Raider' reboot and moved onto the indie scene in 2011 as the level design lead on 'Chivalry: Medieval Warfare' He is now the creative director and level builder/designer for 'Albino Lullaby'. The studio is comprised of other industry vets, who have worked on a myriad of games from 'Borderlands' to 'Lord of the Rings Online' and at studios like Warner Brothers, Hasbro and Harmonix. We are spread out over the north east coast of North America, from Toronto down to New Jersey and communicate primarily over Skype. http://apelaw.com<br/><br/><strong>Gameplay Captured On</strong><br/><br/>http://albinolullaby.com/digitalstorm", "metacritic": null, "released": "2015-09-14", "tba": false, "updated": "2019-09-17T13:37:39", "background_image": "https://media.rawg.io/media/screenshots/395/395af7da0a10f3603386d276e16b8d97.jpg", "website": "http://AlbinoLullaby.com", "rating": 0.0, "rating_top": 5, "added_by_status": {"yet": 7, "owned": 83, "beaten": 3, "toplay": 5, "dropped": 2, "playing": 1}, "playtime": 4, "achievements_count": 28, "ratings_count": 5, "suggestions_count": 530, "game_series_count": 0, "reviews_count": 5, "platforms": ["PC"], "developers": ["Ape Law"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Ape Law"], "esrb_rating": null}