{"id": 11536, "slug": "absoloot", "name": "Absoloot", "name_original": "Absoloot", "description": "<strong>Absoloot</strong> is a game with familiar game mechanics that will put you into fun confrontation of four warring sides (Archaeologists from Winfield, Hellocreeps, Kwade Bende, P.R.M.D.).<br/>The reason of confrontation is a treasure! Each team tries its best to leave others with no riches. You should attack and protect, run away and chase, explode and get blown up. <br/><br/><br/><br/>That game has few game modes (classic and special). You will face with deathmatch, treasure hunting, chasing the king and many other. All of that will be on tens of maps, each of them refers to team locations (saloon, castle, sheep, pyramid).<br/>Every fighting side has three heroes that can be chosen for game. Every hero has his own weapon and physical features (speed, health and other), so the choice of one hero or another can be the part of your tactics in different modes of competition. But don’t forget to watch your ammunition and level of health!<br/>That game was created for yours and your friends’ fun by playing on one computer the two, three or four of you. Please note that for three or four-players game on one computer you will need gamepads (one or two). Also game supports online-multiplayer to fight with other players remotely. <br/><br/><br/><br/><ul><li>5 dynamic game modes<br/></li><li>4 locations different by style and atmosphere<br/></li><li>40+ different maps full of mines and spikes<br/></li><li>12 unique characters<br/></li><li>12 types of weapon (machine-gun, shotgun, rifle, pumpkin-gun, sweet-gun and other)<br/></li><li>Bonuses that can affect on game<br/></li><li>Multiplayer for one computer (2-4 players)<br/></li><li> Beta Online-multiplayer (2 players)</li></ul>", "metacritic": null, "released": "2017-03-15", "tba": false, "updated": "2023-01-31T10:42:41", "background_image": "https://media.rawg.io/media/screenshots/0c1/0c16b854a8055902d856d5a7e6482d89.jpg", "website": "http://www.dagestantechnology.ru/", "rating": 1.83, "rating_top": 1, "added_by_status": {"yet": 3, "owned": 233, "beaten": 1, "dropped": 3}, "playtime": 3, "achievements_count": 0, "ratings_count": 12, "suggestions_count": 174, "game_series_count": 0, "reviews_count": 12, "platforms": ["PC"], "developers": ["Latinas Tomatos"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Dagestan Technology"], "esrb_rating": null}