{"id": 1153, "slug": "air-tycoon-2", "name": "Air Tycoon 2", "name_original": "Air Tycoon 2", "description": "Manage your own airline company in the world.<br/>Multi-language supported : English, Française, Deutsch, Español, 日本語, and 한국어.<br/><br/>Dedicated iPad version is also available now. <br/><br/>The traditional business simulation game returns with full upgrade - AIR TYCOON 2<br/><br/>- Worldwide 155 airports <br/>- 51 real airplane models <br/>- Passenger and cargo routes <br/>- Subsidiary business<br/>- Precise and brilliant simulation modeling <br/>- All new graphics and user interface <br/>- Use your own company logo from camera roll<br/>- Game center leaderboard<br/> <br/>You can make your own airline company which can buy airplanes and build routes for passenger and cargo over the 155 world wide cities. When you make a route you can control the schedule, fare, seat design, service level to create more profit. After that, hiring more employees is needed. You can invest for advertisement to pull up company's name value and check the employee's productivity for satisfaction of customers. If you need more money for managing, you can get a loan and pay off from the bank.<br/><br/>* When you have some crash problem,<br/>1. Keep your iOS up-to-date<br/>2. Remove all background apps (Double push Home button &amp; remove background apps)<br/>3. Check available free space is more than 1 Gbyte<br/>4. Power off and on your device(press and hold Home button &amp; sleep/wake button for 3 seconds)<br/><br/>________________________________________ <br/><br/>* Enjoy our other management simulation games. <br/><br/>- Hotel Tycoon 2 (New Game - Fully upgraded and new features. iPad version is also available.) <br/>- Touch Traffic (Brilliant traffic control game) <br/>- Cruise Tycoon (Cruise company management. iPad version is also available.) <br/>- Hotel Tycoon (Hotel chain management) <br/>________________________________________ <br/><br/>When you have any question or opinion about our game, please contact us. Thank you. <br/><br/>E-mail : support@tradegamelab.com <br/>Twitter : www.twitter.com/tradegamelab", "metacritic": null, "released": "2010-12-05", "tba": false, "updated": "2019-10-22T14:27:38", "background_image": "https://media.rawg.io/media/screenshots/5e2/5e25cd568e092aa4b321910a96b64df3.jpg", "website": "http://airtycoon2.blogspot.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 214, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["TRADEGAME Lab"], "genres": ["RPG", "Simulation"], "publishers": ["TRADEGAME Lab"], "esrb_rating": "Everyone 10+"}