{"id": 115368, "slug": "wasted-space", "name": "Wasted Space", "name_original": "Wasted Space", "description": "<p>Humanity as we know it, is gone. Earth's population failed to change their ways and stop polluting their planet. Reaching a point of no return, as a final attempt to save humanity, the Earth's pollution was released into Space. However, this plan failed and lead to the extinction of mankind, leaving all of their junk behind to float noiselessly into Space. </p>\n<p>Though as the old saying goes \"one person's junk is another person's treasure.\" A young curious mind has found settlement on the Earth’s moon. Discovering what was once and what might have been.<br/></p>\n<p>W<em>asted Space</em> is a 3D walking simulator exploration game, heavily driven by the games soundtrack and player exploration. Play as an unknown being who explores the vast landscapes of the moon, discovering and collecting junk left behind by humanity. There are several items scattered across the landscape, the player are able to use some very special items and others, well are just junk really.</p>\n<p>After this game, it is hoped that the player would feel empowered with the knowledge they have gained of a hypothetical scenario, showing what the damage of plastic and pollution could truly cause.</p>\n<p><em>Wasted Space</em> was made as a collaboration project between Audio and Games disciplines at SAE Institute Brisbane.</p>\n<p>Original Concept By: Breanna Pringle</p>\n<p>Team</p><p>Breanna Pringle: Creative Director &amp; Lead Audio Designer<br/></p><p>Seychelle Atkinson: Project Lead, Lead Game Designer, Lead Game Programming, 2D Artist, Visual Effects &amp;  UI Design.</p><p>Jenna Bramham: Game Design, 3D Artist &amp; UI Design</p><p>Assets: Low Poly Rock Pack,Scifi Stylised Modular Pack,  Real Stars Skybox , Camera, Sunglasses, Torch, Soft Drink Can, Plastic Water Bottle , Glove, Ring,Guitar, Rubix Cube, Dog, Space Helmet, Spaceship, Space Rover, Floppy Discs, Keg, Printing Calculator, Cinderblock, Bucket, Garbage Bin, Cooking Pot, Toothbrush, Backpack, Science Tubes, Typewriter, Toolbox.</p>\n<p>A SPECIAL THANKS TO:<br/>Ben Drury, Iain McManus, Ashley Muir &amp; Aaron Williams</p>", "metacritic": null, "released": "2018-07-13", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/510/5104dcdf8e3786ac9e1c0b46762827d3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 211, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Sey Atkinson", "Oracle Animosity"], "genres": ["Adventure", "Simulation"], "publishers": [], "esrb_rating": null}