{"id": 115411, "slug": "anathema-itch", "name": "Anathema (itch)", "name_original": "Anathema (itch)", "description": "<p>Anathema is a love-letter to classic action-platformer series' such as Castlevania, Mega Man X, Ninja Gaiden and Ghosts 'n Goblins. Presented in HD using modern technology to pre-render sprites as seen in the mid-90's with games such as Killer Instinct and Donkey Kong Country. Players will fight through 12 stages of a highly detailed world that is out to destroy them. Enemies will be varied, powerups will be plentiful, bosses will be challenging and the controls will be tight.</p>\n<ul><li>Run, double-jump, slide, climb walls and swing across chasms. Players have an extremely agile list of abilities to maneuver and explore environments.</li></ul>\n<ul><li>Explore a variety of levels ranging from haunted graveyards, living swamps, creaking shipwrecks, inner beasts and more. Each area brings new themes, challenges, enemies and threats.</li></ul>\n<ul><li>Motion comic styled cutscenes after each level to tell the story of Aurora and her quest with full voice acting.</li></ul>\n<ul><li>Permanently increase your maximum stats and abilities by exploring stages for powerups, relics, tomes and other secrets.</li></ul>\n<ul><li>Unleash an arsenal of abilities. Players can incinerate, mince, slash, blast and crush enemies in a variety of manners using various subweapons and special abilities. Players can also temporarily increase their stats to empower their attacks to even resurrect themselves should they die.</li></ul>", "metacritic": null, "released": "2017-07-15", "tba": false, "updated": "2019-08-23T11:31:37", "background_image": "https://media.rawg.io/media/screenshots/67f/67f1af31789a1fc8e21c05e1c8577d26.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 472, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["esperware"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}