{"id": 115506, "slug": "falling-plus", "name": "Falling Plus", "name_original": "Falling Plus", "description": "Peppy the Penguin was just minding his own business. Suddenly, Wally the Walrus is trying to get in, and he's making a big mess! Blocks of ice are dropping from the ceiling, and from time to time, Wally's dropping in too!  If Peppy doesn't match the colors carefully and work quickly, he'll be buried under a mountain of problems! Can Peppy clean up the mess and get rid of the intruder? It all depends on you and your reflexes!<br/>\n<br/>\r\nFalling Plus is a retro-style arcade game with an optional emulator-style presentation. You'll think you've traveled back in time! The fun gameplay is backed up with sharp, colorful graphics, and genuine classic-style music and sound effects, created on a Commodore 64! But you also get modern features such as customizable gamepad and keyboard controls, and full support for all resolutions!  Plus, compete for high scores on six different Steam Leaderboards!<br/>\n<br/>\r\nYou also get two additional bonus modes: Survival Challenge and Burning Igloo Challenge! In both, you get one life and must survive for as long as possible under difficult circumstances. Survival throws you into a challenging level that never ends, while Burning Igloo sends fire down along with the usual blocks and enemies!<br/>\n<br/>\r\nFalling Plus is a love letter to action-packed arcade puzzle games of the early-to-mid 1980s, and I hope you enjoy playing it as much as I enjoyed bringing it to you.  Please enjoy your time with Falling Plus!<br/>\n<br/>\r\nThis game locally supports 1 or 2 (alternating) players.", "metacritic": null, "released": "2017-06-22", "tba": false, "updated": "2019-08-28T21:54:01", "background_image": "https://media.rawg.io/media/screenshots/48e/48e6f0d81e8c58a2da54246f6db81ffe.jpg", "website": "http://yyrgames.com/?q=fallingplus", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 72, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["yyrGames", "yyr"], "genres": ["Action", "Casual", "Indie", "Puzzle"], "publishers": ["yyrGames"], "esrb_rating": null}