{"id": 115524, "slug": "scuffle-scoundrels-itch", "name": "Scuffle Scoundrels (itch)", "name_original": "Scuffle Scoundrels (itch)", "description": "<p>Scuffle Scoundrels is a wild 4-player pirate romp. Flank your rival captains, and let them taste the hot end of your cannons. Fierce high sea shootouts with explosive power-ups!</p>\n<ul>\n<li>Four fierce captains\r\n        </li><li>Deadly obstacles and power-ups\r\n\t</li><li>A swashbuckling soundtrack by Morten Gildberg\r\n</li></ul>\n<p>At $5 plus VAT, it is currently in early access, at half its eventual price.<br/>However, it's already fully playable, requiring two to four controllers connected to a PC. Purchasing now secures you all future updates.<br/><br/>Follow via the book of faces or by songbird to stay updated.</p>\n\n<p>UPDATE NOTES 0.6.3</p>\n<p>- New ship models are in!</p>\n<p>- Removed Bugs several bugs, Found other bugs, See bug notes for current bugs.</p>\n<p>- We have our first original musical composition in the game, the new in-game battle score, composed by Morten Gildberg. (Still lots of music by Kevin MacLoad, incompetech.com, licensed under Creative Commons )</p>\n<p>- Kelp patches now take on different shapes</p>\n\n<p>KNOWN BUGS IN 0.6.3<br/>'Tis here be the list of known bugs and crucial omissions in the currently available build. We encourage you to report any findings of your own.</p>\n<p>GAMEPLAY<br/>- You currently aren't awarded a doubloon for shooting a mine that destroys another player<br/>- You currently see the behind-the-scenes math from Sudden Death on the results screen<br/>- It is possible for people to get the same amount of points without Sudden Death launching<br/>- bad stuff can spawn under the timer-bomb<br/>- Sometimes an unused ship will be added to the battle</p>\n<p>MENUS<br/>- issues tracking amount of players when going back to main menu after player check in<br/>- cannot go back to main menu in the middle of a game</p>\n<p>GRAPHICS<br/>- You can on rare occasions be the winner, without being highlighted on the win screen<br/>- The gold doubloons signaling points now move way too fast!</p>", "metacritic": null, "released": "2016-10-27", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/e6d/e6d69fc4a2c2705e9d4c35c01857cd77.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 184, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Moped Games"], "genres": ["Action"], "publishers": [], "esrb_rating": null}