{"id": 11557, "slug": "recursion-deluxe", "name": "Recursion Deluxe", "name_original": "Recursion Deluxe", "description": "A crash landing on a world inhabited by bee-like lifeforms. Stranded, our hero must unravel the rules of this uncharted planet to find their way home.  <br/><br/>Puzzle Platforming inspired by many of the great classics of the past. Carefully designed levels intended to provide an enjoyable difficulty curve.  Meticulously-crafted pixel art creates a throwback to classic 16-bit aesthetics. <br/><br/>Based on a Flash game released in 2012, Recursion Deluxe has been rebuilt from the ground up in a new engine. This deluxe version features new puzzle mechanics, additional biomes, remastered original content, twice as many levels, new music and more!Features<ul><li><strong>Classic Platforming</strong> - Overcome puzzles and challenging obstacles! <br/></li><li><strong>Choose Your Hero</strong> - Choose between the two heroes and unlock more as you progress. <br/></li><li><strong>Full controller support</strong> - Playable in Big Picture mode.<br/></li><li><strong>Pixel-Perfect Rendering</strong> - No rotating pixels or sub-pixel movements here!  <br/></li><li><strong>Speed Running Love</strong> - Deterministic gameplay and ability to track the number of frames elapsed.<br/></li><li><strong>Level Editor</strong> - Design your own levels and share them with your friends!<br/></li><li><strong>Mod Support</strong> - Create and share your level packs with custom art and music assets.<br/></li><li><strong>Twitch Plays</strong> - Host the game on your Twitch account and have your followers control the game with chat commands.<br/></li><li><strong>Steam Integration</strong> - Achievements, Cloud Saves and Trading Cards!</li></ul>", "metacritic": null, "released": "2016-02-12", "tba": false, "updated": "2019-08-28T22:13:48", "background_image": "https://media.rawg.io/media/screenshots/78d/78d78b0f1b559dd1ccf1af5c3cc85997.jpg", "website": "http://www.2dheroes.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 93, "dropped": 1}, "playtime": 4, "achievements_count": 13, "ratings_count": 1, "suggestions_count": 162, "game_series_count": 0, "reviews_count": 1, "platforms": ["macOS", "PC", "Linux"], "developers": ["2D Heroes", "Ursa Games"], "genres": ["Action", "Casual", "Indie"], "publishers": ["2D Heroes"], "esrb_rating": null}