{"id": 115512, "slug": "2045-henkei-no-densetsu", "name": "2045 - Henkei no Densetsu", "name_original": "2045 - Henkei no Densetsu", "description": "<p>2045 - Henkei no Densetsu - (Legend of Deformation ) is a post-apocalyptic Run'n'Gun samurai game created by Rock Eaters during the Ludum Dare #35.</p><p> <strong>Story :</strong></p><p>2045, the third world war finished a few month ago but some places are still battle zone. The global and massiv use of biological weapons killed 90 percent of the humanity and definitly changed the face of nature and engendered mutations on many species. <br/>You play as a samurai recently bit by a mutant fish who will have to defend his village from a raid of punk leaded by their huge mutated green boss.</p><p><strong>Gameplay :</strong></p><p>Heinkei no Densetsu is a run'n'gun (top view), inspirated by great classic games like Ikari Warriors or Ninja commando .</p><p>You will have to find your way to the boss, slashing as many punks as you can and freeing your people from the cages.</p><p>Each time you hit someone, your anger gauge rise. When the \"anger gauge\" is full, the bite of the mutant fish reveal his power and you turn into an unbeatable big red monster. When the gauge comes back back to zero you comes back to your mortal samurai form.</p><p><strong>Ennemies :</strong></p><p>Classic punk : They will shoot singles bullets in your direction.</p><p>Gatling punk : They will shoot high cadenced gatling bursts in your direction.</p><p>Kamikaze punk : They will run on you and blow themselves when they are next to you.</p><p>Turret punk : they will shoot spray of bullet in one direction.</p><p>Big green boss : it's up to you find your way to him and discover it .</p><p><strong>Other things you can shoot at :</strong></p><p>Civilians : These are your village people, don't shoot them or you will lose some precious points.</p><p>Crabes : You don't exactly why but you hate them since you are a kid. Shooting them will provides great points.</p><p>Cages : Shooting at it,  you will increase you \"anger gauge\", destroying it you will free some of your people (and one of those sneaky crabes).</p><p><strong>Controls : </strong></p><p>8 directions</p><p>first button : shoot</p><p>second button : reboot level <br/></p><p>Most of the controllers should work with the downloadable version.</p><p>If you dont have a controller or if you play the html 5 version .</p><p>The keyboards keys are :</p><p>\"Arrows\" for the directions.</p><p>\"A\" for button 1</p><p>\"S\" for button 2</p><p>Hope you will enjoy the game as much as we had fun making it.</p><p><strong>Rock Eaters Team for this Game :</strong></p><p>Prog : Fabot</p><p>Graphism : VHS and Remon Jr</p><p>Music ans Sfx : Alix Pilot</p><p> <br/></p><p> <br/></p>", "metacritic": null, "released": "2016-04-27", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/03c/03c148733bbe957ff1f383d27f08ecb7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 204, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["Rock Eaters"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}