{"id": 115629, "slug": "mercand", "name": "Mercand", "name_original": "Mercand", "description": "<p><strong>Mercand is a Graduation Video Game Prototype - June, 2018<br/></strong></p>\n<p><strong>PITCH</strong></p>\n<p>Mercand is an economic management game which takes place the county of Forez (France) during the hundred years war.  The player will embody a merchant who will take economic control of the region with the goal of establishing his own business empire.\r\n    </p>\n<p>The player faces environmental challenges and natural hazards, either historically based or fictionalized, that affect his gameplay.    </p>\n<p>The main objective of the game is for the player to acquire a certain amount of money and a number of workshops in each of the five cities throughout Forez  county, which is currently known as the Loire region.\r\n   \r\n  <br/></p>\n<p>The game's context and environmental details are historically accurate. For this project, we are working with a number of iconic references and an history professor, who has been guiding us since the beginning.\r\n   \r\n   \r\n  <br/></p>\n<p><em>Spread your power and become a rich merchant by checking the county of Forèz at the time of the Hundred Years' War.</em></p>\n<p><em>C’est un jeu de gestion économique, historique, qui se déroule en France et plus précisément dans le comté de Forez qui correspond à l’actuel département de la Loire, dans un contexte de guerre de cent ans. Le joueur incarnera un marchant qui devra prendre le contrôle économique de la région et fonder son propre empire commercial.</em></p>\n<p><em>Le joueur affrontera l’environnement, que ce soit le désordre orchestré par le conflit ou par les aléas climatiques, historique ou non, qui viendront affecter sa partie.</em></p>\n<p><em>L’objectif principal du jeu va être pour le joueur d’acquérir une certaine somme d’argent et certain nombres d’ateliers dans chacune des villes, cinq au total, qui seront à sa disposition.</em></p>\n<p><em>Le jeu se veut réaliste, non pas dans les graphismes, mais dans le contexte et son environnement. Pour cela nous avons travaillé avec un certain nombre de références iconographiques mais surtout avec un professeur d’université, qui nous suit depuis le début du projet. </em></p>\n\n<p><strong>DETAILS</strong></p>\n<p><strong>Developer : </strong>Team Red Dwarves (student project) ArtFX - Montpellier (France) <br/></p>\n<p><strong>Release : </strong>June 2018</p>\n<p><strong>Game plateform : </strong>PC\r\n</p>\n<p><strong>Genre : </strong>Strategy</p>\n<p><strong>Language : </strong>English (menus) ; Game without text or voice\r\n<strong>-</strong></p>\n<p><strong>PEGI 7 </strong>(not officially rated)</p>\n\n<p><strong>CREDITS</strong></p>\n<p>Jean-Edouard MARCONNET - Project Manager/Game Artist<br/></p>\n<p>Vincent GAUTIER - Lead Artist/Game Artist</p>\n<p>Guillaume HUC - Game Artist</p>\n<p>Thomas CAYUELAS - Game Designer</p>\n<p>Sebastian VILLALBA - Game Artist</p>", "metacritic": null, "released": "2018-06-28", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/f30/f30fcdc815241ad08cb22e03777d33bd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 284, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ArtFX School"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}