{"id": 11561, "slug": "brawlout", "name": "Brawlout", "name_original": "Brawlout", "description": "<p>A new challenger has appeared in the platform fighter arena!<br />\nStriking the balance between the growing competitive scene and the genre’s party game roots, Brawlout hopes to cater to the veteran platform fighter, the casual fan and the newcomer looking to make their mark. Brawlout does away with shields and blocking, focusing heavily on the aggressive, fast-paced combat which has made platform fighters so fun to both play and watch.<br />\nEach character in Brawlout has their own unique playstyle, catering to specific character archetypes seen in other fighters. Whether you’re a die-hard grappler or a rushdown fiend, there is a fighter for you in Brawlout.<br />\nCombined with familiar movement techniques like wavedashing and airdodging, Brawlout adds some extra mechanics seen in other fighting games. The Rage Meter builds up as you both deal and take damage, allowing you either break combos with the Rage Burst or unleash hell with the Rage Mode. The Rage Burst pushes opponents back, breaking their combos and allowing players to create some breathing room at the cost of half their Rage Meter. If the meter fills, you can activate the Rage Mode, increasing the knockback you deal while reducing the amount you take.<br />\nAs for modes, Brawlout has all you’d expect from a normal platform fighter and then some. Up to four players can compete in local multiplayer in either timed, stock or team battles. AI opponents are also available if you want to practice your team combos with a friend, or if you need to fill out a free for all.<br />\nBrawlout’s online suite is suitably robust, with all of the following features:<br />\nA robust Ranked match system, complete with regional leaderboards<br />\n1v1 casual matches for low-stress competition<br />\n2-4 player private lobbies where players can practice or mess about to their heart’s content<br />\nThe Brawlout Network where players can check their fight stats, match history and replays<br />\nBrawlout TV which allows for live spectating and watching of specific player replays<br />\nWeekly competitive tournaments for those looking to prove their Brawlout skills<br />\nAdditional modes like the story campaign and single-player challenges are planned to be added during Early Access, along with more characters, gameplay features and other surprises!</p>", "metacritic": 62, "released": "2017-04-20", "tba": false, "updated": "2023-10-22T18:40:05", "background_image": "https://media.rawg.io/media/screenshots/4ed/4ed594f1f80fe79687c84fe36222e801.jpg", "website": "http://www.brawlout.com/", "rating": 3.06, "rating_top": 3, "added_by_status": {"yet": 8, "owned": 397, "beaten": 4, "toplay": 6, "dropped": 19, "playing": 6}, "playtime": 1, "achievements_count": 126, "ratings_count": 31, "suggestions_count": 223, "game_series_count": 0, "reviews_count": 32, "platforms": ["Nintendo Switch", "PC", "PlayStation 4", "Xbox One"], "developers": ["Angry Mob Games"], "genres": ["Action", "Casual", "Fighting", "Indie"], "publishers": ["Angry Mob Games"], "esrb_rating": "Everyone 10+"}