{"id": 115654, "slug": "fantasy-galaxy", "name": "Fantasy Galaxy", "name_original": "Fantasy Galaxy", "description": "<p>Fantasy Galaxy foi desenvolvido na 4ª Maratona da Academia de Produção de Jogos, a qual teve duração de doze semanas. Inspirado em antigos jogos do gênero Shoot'Em Up Horizontal (R-Type, Gradius, Darius, etc.) e mesclado com alguns elementos do gênero de RolePlayGame (progressão de nível, compra de upgrades, narrativa), Fantasy Galaxy trás uma experiência agradável tanto para jogadores experientes, os quais poderão finalizar o jogo em poucas partidas, quanto para jogadores mais causais, que irão se tornar mais fortes conforme aumentarão seu nível e adquirirão melhorias para sua nave. O jogo conta com um modo história, composto por quatro fases com mecânicas de jogo que favorecem tiros específicos, e um modo infinito, aonde o jogador pode adquirir experiência para progressão de nível, além de juntar \"Scrap Metal\" (moeda de troca) para comprar melhorias para sua nave.</p><p>História:</p><p>É o primeiro dia após a promoção de Lina Stargazer para Tenente da Federação Galática, e como prêmio por sua condecoração, ela recebe a permissão de testar a mais nova nave da frota, Swordbreaker, supervisionada por sua irmã, e capitã, Luna Stargazer. Durante o teste algo inesperado ocorre, as forças de defesa da Federação começam a atacar Swordbreaker, o que será que está acontecendo?</p><p>Controles:<br/></p><p>Moviventação: Direcionais / ASWD / L-Stick (Controle)</p><p>Atirar: Enter/ Espaço / A (Controle)</p><p>Aumentar a Velocidade : Pg.Up / LT - LB (Controle)</p><p>Diminuir a Velocidade : Pg.Dn / RT - RB (Controle)</p>", "metacritic": null, "released": "2016-11-26", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/1b2/1b263abcc8d92eac44c71928ca84bdae.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 114, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["mega256"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}