{"id": 115735, "slug": "clickbait", "name": "ClickBait", "name_original": "ClickBait", "description": "<p>You may get a \"This file may harm your computer\" type of warning, just ignore it. It's a limitation of my game engine.</p><p>You run a blog in the mid 1990's and need to be as successful as possible! <br/>If you can't tell, I modeled most of the game off of Window's 95 :3 <br/><br/>NOTE: If you have a 16:9 monitor, I'd suggest running this in Fullscreen for the best effect. <br/><br/>Most of the mechanics are listed in-game as you play, but I'll leave a list of what everything does here: <br/><br/>If you're not wanting to have any of the mechanics spoiled, don't read this! <br/></p><p><strong><em>~~&lt;[Blog Creation]&gt;~~ </em></strong><br/><strong>Money</strong>: Used to pay bills. <br/><strong>Time Speed</strong>: Time in the game matters. Every 24 hours you lose money and the time in-between posts influences how many views you'll get. <br/><strong>Blog Name</strong>: Doesn't matter what this is, just make it whatever you like (It'll change the fake URLs in the game). <br/><br/><strong><em>~~&lt;[Characters]&gt;~~ </em></strong><br/><strong>Webmaster</strong>: He owns the server your blog runs on. You pay him money and he helps you with your website. <br/><strong>Hackers</strong>: They'll try to hack your website to steal your Fans, Subscribers, and Money! The more Fans you have, the more likely you are to be threatened. <br/><strong>Fans</strong>: Fans have a 60% chance to view your posts. <br/><strong>Subscribers</strong>: Subscribers have a 90% chance to view your posts. They also pay you every time you post! <br/><br/><strong><em>~~&lt;[Posting]&gt;~~ </em></strong><br/><strong>Buzzwords</strong>: Attract new users to your blog. Fans won't like a ton of Buzzwords, though. <br/><strong>Length</strong>: The longer the post, the more likely Fans will want to stay Fans. Short posts will make Fans leave. <br/><strong>Quality</strong>: High Quality posts will make random visitors more likely to become Fans and Fans more likely to become Subscribers. <br/><strong>Time</strong>: If you don't wait and just constantly make new posts, they won't get many views and will most likely scare away Fans and Subscribers! The least amount of time you can wait for the maximum output is 2 in-game hours. <br/><strong>Views</strong>: You get money for every View. You can see a graph on the top right of the past 20 posts and how their view count compare to each other <br/><strong>Posts</strong>: You can go back and read through all of your posts whenever you like. <br/><br/><strong><em>~~&lt;[Skills]&gt;~~ </em></strong><br/><strong>Level/XP</strong>: You gain XP for every post you make. If you Level up, you gain a Skill Point. <br/><strong>Skill Points</strong>: It costs the current Level of any Skill in Skill Points <br/><strong>Advertising</strong>: You earn money off of advertising on your blog. The higher this is, the more money you make per View. <br/><strong>Posting Ability</strong>: This augments your Views as well as the chance you will gain more Fans and Subscribers. It also has a nice aesthetic affect that changes the font of new posts as well as allows pictures to appear for posts. <br/><strong>Bandwidth</strong>: This limits the number of views you can get per post. By raising this, you'll raise the number of possible views you can get for every post. <br/><strong>Security</strong>: Lowers the chance of being threatened by Hackers as well as lowering the chance that Hackers will be successful.<br/></p>", "metacritic": null, "released": "2015-08-24", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/d95/d9592f909c6910df8fd362a032c9f73f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 111, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["BtheDestroyer"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}