{"id": 115762, "slug": "gamma-bomber", "name": "Gamma Bomber", "name_original": "Gamma Bomber", "description": "<p><strong>HTML5 version available for the duration of  GBJAM 5</strong><strong> voting. Please see below for controls and thank you for checking my game out!</strong></p><p>Imagine that it is 1989 (or 1990 in Europe) and Nintendo's GameBoy has just been released. You want to play an exciting, fast-paced, hard-as-nails shoot 'em up. What game do you choose...?<br/></p><p><strong>GAMMA BOMBER!</strong></p><p>Or at least you could have, had this actually been a real game. Unfortunately for us all, this game did not exist in any way, shape or form until just over a week ago. It was created for GBJAM 5, where lots of developers tried to create games that would not have looked out of place on a GameBoy. Primarily this meant using a resolution of 160x144 and no more than 4 colours.</p><p>For my entry I have upscaled the resolution by x5 (my eyesight isn't what it used to be!) so the game runs at 800x720. I hope you enjoy it!</p><p><strong>GAMMA BOMBER!</strong></p><p>Get ready for 36 levels spread across six zones. Destroy 50 enemies in each level to move on to the next. Only by decimating the enemy forces in this way can you hope to make it to the final showdown with the boss ship and your chance to save the galaxy!</p><p>You can play the game with keyboard or with a joypad. If you're using a keyboard then the controls are:</p><ul><li>Cursor keys - Move</li><li>Space - Fire</li><li>Left Ctrl - Bomb</li><li>Enter - Start</li><li>Esc - Select</li></ul><p>The in-game control prompts refer to the joypad buttons and what would have been the buttons on a GameBoy. I didn't want to break the immersion by changing them to keyboard prompts, sorry!</p><p>To pause, press Start/Enter. To quit to the menu, press Select/Esc while paused. To quit the game, press Select/Esc while at the main menu.</p><p>UPDATE: Linux builds are now available. I have tested them on Ubuntu, please let me know if you have any issues.</p>", "metacritic": null, "released": "2016-10-09", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/5a0/5a08798cc45d75b698fa9d4ba960855f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 46, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux", "Web"], "developers": ["rsbrowndog"], "genres": ["Action"], "publishers": [], "esrb_rating": null}