{"id": 11571, "slug": "cypress-inheritance-the-beginning", "name": "Cypress Inheritance: The Beginning", "name_original": "Cypress Inheritance: The Beginning", "description": "Lorna Ritten, has learned of Alfred Cypress, her grandfather whom she has never known, her family past has always been somewhat of a mystery. She also learns of what she has inherited, of which she has no idea of just how important this actually is to her and others.  After being contacted by a stranger, this leads her into the beginning of a very unique situation. Regardless of what she is facing, she must continue forward to achieve what is needed for herself, and so much more! <br/><br/>Arriving at a secluded island, the setting is somewhat overwhelming. But, even with the vastness and mystery of the Island, and what dangers may lay ahead, she is still very intrigued. While knowing very little about Alfred Cypress, it is very obvious he has an eccentric nature, as well as brilliance in him. The technology discovered conveys all this in many ways. There is so much to do, not a lot of time, and the realization of the need to be extremely careful.<br/><br/>Overview for Cypress Inheritance: The Beginning<br/><br/>Cypress Inheritance: The Beginning will give you a unique gaming experience to enjoy.  We intended for this game to enable the player to have options, as well as objectives in an environment with an A.I. that is defending the area. Cypress Inheritance: The Beginning delivers a true-to-life, stealthy gaming experience set in multiple open worlds. As you experience our true cause and effect system while on the path to achieving your goals, the strategy you use will have consequences and those decisions will ultimately determine your success or failure. <br/><br/>Cypress Inheritance: The Beginning includes Chapters I and II, and III. Chapters II and III continue the story, giving more to encounter and discover. These three chapters complete the game.<br/><br/>Current Screenshots:<br/><br/>Chapter I Screenshots<br/><br/><br/><br/><br/><br/><br/><br/><br/><br/>Chapter II Screenshots<br/><br/><br/><br/><br/><br/><br/><br/><br/><br/>Chapter III<br/><br/>Below are a few screenshots from the two environments from Chapter III. Chapter III has very strong visuals which include two distinctly unique, detailed  environments. The game play in this chapter is also a little different from the first two chapters. There is more action, as well as more interaction within the environment. As you make your way through the environment you will need to be extremely vigilant, as Vonya is watching and waiting.<br/><br/><br/><br/><br/><br/><br/><br/>GAMEPLAY FEATURES<br/><br/>Single player, stealth based strategy gameplay<br/><br/>The Cypress Bloodline - Being adopted at birth, Lorna has never known anything about her birth parents and her true identity has always been somewhat of a mystery to her. After being approached by a stranger, Lorna discovers that she is part of the Cypress Bloodline and is finally given the chance to find the answers she has wanted to know for so long.<br/><br/>Open World - As Lorna, immerse yourself in a non-linear, open-world experience as you search to uncover the secrets of the Cypress family past. You will encounter hidden areas, outposts and vaults filled with secrets and challenges. From the endless forests to the dark shadows of the caves, there is so much to discover.<br/><br/>You only have one chance to complete your mission - On Cypress Island, every decision you make will have a consequence. The way in which you choose to use your resources will affect your chances of completing your mission in time and surviving the island. Choose wisely!<br/><br/>Locate – Collect valuable information and begin uncover the secrets that were kept from you for so long. Stealth technology will aid you on your mission by allowing you to search without being detected.<br/><br/>Protect – The secrets you uncover must be well protected. Remember, what you are about to discover could change the world!<br/><br/>Survive – You must learn to overcome obstacles while balancing your health and stamina. Having only 72 hours to accomplish your mission, you will need to combine strategy and patience. Stay strong to achieve your objectives.<br/><br/>The Enemy – Beware of Vonya and the A.I. that is there to assist her. She knows why you have come and is determined to capture you. Your strategy and the way in which you traverse the area are paramount in helping you gain the assets she is protecting.<br/><br/>Cause &amp; Effect Gameplay – Based on the choices you make throughout the game, there are multiple ways in which a game can end.<br/><br/>Replay-ability – Being that the locations of the Cypress Family Secrets are randomly generated by the engine, you can enjoy different situations every time you play. You will never play the same game twice!<br/><br/>Extended Gameplay – Chapter II and Chapter III continue the story and come at no additional cost, adding several hours of extra game-play and carrying you deeper into the story!<br/><br/>Family Friendly – Our game has no harsh violence, nudity or vulgar language.<br/><br/>Original Soundtrack – Enjoy an Original Soundtrack created by Award-Winning film composer and record producer Dani Donadi, as you journey through Cypress Inheritance: The Beginning.<br/><br/>Easy to Learn – Controls are very intuitive and interactive tutorials are available for each chapter.<br/><br/><br/><strong>NOTE:</strong><br/><br/>We are in the process of completely rebuilding in UE4. In our rebuild in UE4 we are also adding much more content with several changes to the game play. This will dramatically improve, with many additions and upgrades, along with adding achievements and trading cards. <br/><br/>You can view some of the current game screen shots in rebuild at the bottom of the page:<br/><br/>A few of the newer features will include: <br/>• 1st and 3rd person perspectives, your choice.<br/>• You will have choices on clothing and the ability to change while on the mission.<br/>• A very strong inventory system. <br/>• An in game map system with scrolling ability, as well will be upgrade-able. <br/>• Detailed weather system that does effect the character and achieving goals.<br/>• Rebuilt in UE4<br/>• Re-shot and new in-game cinematics<br/>• Complete overhaul of SFX and FX systems<br/>• Completely new assets including character, animations , and props<br/>• New Context based diegetic UI/UX<br/>• Redesigned AI for a more challenging and engaging experience <br/>• Additional localizations<br/>• HTC vive support<br/>• Oculus rift support<br/>• Steam controller Support  <br/>• Steam Achievement’s<br/>• Steam trading cards<br/>• Steam Cloud save<br/><br/>The NEW CITB game will update with the new engine as a demo and you will have access in December 2017. The production will still be in progress but you will have access and be able to enjoy some of the many features we will have in this  AAA title. The New CITB game will be completed in  Q1 of 2018. We want to make sure that this game from Cypress Inheritance is what it was intended to be which is an enjoyable AAA entertainment experience.<br/><br/>Additionally we will be offering FREE CSWS3 DLC to all purchases before the new CITB update in Q1 2018.<br/><br/>CSWS3 DLC Will Include:<br/>• New Swiss Alps Story mission<br/>• New Play areas<br/>• New Outfits<br/>• New Tools <br/>• New Vehicles<br/>• New Characters <br/><br/>The cost after the update is released will be $30.00 for CSWS3 DLC<br/><br/><strong>We have added a few screenshots of the work in progress.</strong><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/>", "metacritic": null, "released": "2014-03-10", "tba": false, "updated": "2019-08-28T22:13:48", "background_image": "https://media.rawg.io/media/screenshots/415/41537cd5e11ddde8ae3bbe30db8c3365.jpg", "website": "https://cypressinheritance.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 4}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 553, "game_series_count": 0, "reviews_count": 1, "platforms": ["macOS", "PC"], "developers": ["Cypress Inheritance"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["Cypress Inheritance"], "esrb_rating": null}