{"id": 115831, "slug": "walk-the-line", "name": "Walk The Line", "name_original": "Walk The Line", "description": "<p>\n<strong>Bug<br/></strong></p><p>If after starting game, the mouse will probably be inneffective. Just press escape and adjust mouse sensivity to your needs.</p><p><strong>Update #1</strong>\n</p><ul>\n<li>\r\n\tAdded builds for Linux and Mac (x86)</li>\n<li>Fixed a bug when stuck after creating planet<br/>\n</li>\n</ul><p>\n<strong>Description</strong><br/>\n</p><p>\r\n\tVoyez « Walk The Line » plus comme une balade contemplative plutôt qu'un jeu.\r\n</p><p>\r\n\tVous arrivez directement sur une petite plate-forme au milieu du vide. Cependant, vous voyez une autre plate-forme, vous marchez dessus, une autre plate-forme se dessine, vous incitant à marcher dessus. Le processus se répète, vous marchez vers le vide et un chemin se créé de façon procédurale sous vos pieds. Arrivé à un certain stade de progression, vous rencontrez une plate-forme avec un téléporteur marquant la fin du chemin. Vous n'avez d'autre choix que d'emprunter ce dernier.\r\n</p><p>\r\n\tVous arrivez donc dans un autre monde, différent, soit vous tombez dans une forêt, dans un désert, dans un paysage enneigé ou autre. Vous vous baladez et cherchez plus ou moins la raison d'être dans cette zone. Cette raison se traduit par quatre « orbes » d'énergie que vous pouvez collecter. Une fois cela fait, vous revenez dans la zone précédente hantée par le vide. Néanmoins, grâce aux orbes, vous avez obtenu un pouvoir temporaire : celui de créer. Plus précisément, lorsque vous effectuez une action (Viser et Tirer), une boule d'énergie se dirige en direction de votre regard vers l'infini.\r\n</p><p>\r\n\tAu bout de quelques secondes, la boule disparaît et vous assistez à la naissance d'une île volante représentant le monde précédemment visité. Une fois le processus achevé, vous reprenez le chemin habituel et répétez la même chose : Parcourir, Collecter, Créer.\r\n</p><p>\n<strong>Commandes</strong><br/>\n</p><p>\r\n\tTouches directionnelles ou ZQSD : Déplacement.\r\n\t<br/>\r\n\tSouris : Déplacement de la caméra\r\n\tClic gauche : Navigation menu ou Création (Si possibilité)\r\n\tTouche R : Revenir sur la terre ferme si vous tombez dans l'infini.\r\n</p>", "metacritic": null, "released": "2016-07-13", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/547/5477585e71b5c7d8a4e04b8c487b0f79.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 36, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Lethanov Merendhal Yllah"], "genres": [], "publishers": [], "esrb_rating": null}