{"id": 115830, "slug": "aeons-dawn", "name": "Aeon's Dawn", "name_original": "Aeon's Dawn", "description": "<p><strong>AEON'S DAWN<br/></strong></p>\n<p>A <strong>Tactical RPG</strong>:<br/></p>\n<p><em>Aeon's Dawn</em> a Tactical RPG inspired by Fire Emblem, Final Fantasy and  elements from XCom. Bringing the tactics gameplay to you. Observe the terrain, analyze the enemies and command your party to victory. Create a steady combat formation and be able to adapt and regroup to prevent enemies from attacking you from behind.<br/><br/>The <strong>story</strong>:<br/></p>\n<p><em>Aeon's Dawn </em>is build from the ground up to be able to tell a story through a combination of gameplay sequences and player choices (direct and indirect). The story progression will be similar to that of a Visual Novel, you will start in a \"common route\" where you'll get introduced to various elements of the lore. You'll get to know some of your party members and the world they're currently living in and the state it's currently in. From where the narrative will split into various 'branches' where you'll be able to either experience the story from another side or perhaps with completely different ending, your decisions, your story (more info on story progression under gameplay later).</p>\n<p>The <strong>world</strong>:<br/>Aeon's Dawn's world is one that is freshly filled with magic, it's origin is still a mystery mostly, but the people are finally adapting to their new powers and so is their society. Magic, once non-existant, now plays an important role in their everyday lives. Magic prowess and aptitude carries a certain influence that will be more deeply explored in the game.</p>\n<p>The <strong>gameplay:<br/></strong>Build and designed to be a 'Tactical RPG' Aeon's Dawn brings a myriad of ways to customize yourself and your party members to bring out their full potential no matter the fight or situation. Choose from a vast array of spells all with different effects, hit, crit and potencies. Use expensive AoE (area of effect) abilities to lay waste to enemies in large groups, but beware of friendly fire. Protect your healers as they go and heal the frontlines, assault the target's mind or even take control of them for a set amount of turns. Abilities can also be preemtively cast to lay various traps for any unlucky soul in it's vicinity upon execution. All of this is possible thanks to the extensive scripting language build into th game engine (a custom engine language and Lua for more advanced techniques).<br/>Every character will also have unique and shared classes to level up and gain new abilities with. Spend your points gained from levelling classes to unlock permanent abilities (heal for a warrior) or a new hybrid class (priest and warrior points to get Paladin class).<br/>Thanks to the extensive moddability of the game engine, the game uses a dynamic levelling system, a system designed to ensure you are never over or under levelled while still keeping levelling up fresh through various unlockables. This also enables the player to replay the game to experience other branches of the story without resetting their party, most of the party's experience will be able to be carried over cross save.</p>\n<p>The <strong>engine:<br/></strong>I build the engine myself using <strong>C#</strong>, <strong>Monogame </strong>(for the general editor) as well as a custom version of <strong>Nlua </strong>to allow for mods using LUA. The editor will come prepackaged (eventually) with the game and Lua tutorials will be available to fully mod the game. With the editor you can create your own abilities, classes, character, enemies and complete maps using visual editors without coding to create a completely customized map (not included in demo).<br/><br/>The <strong>Gameplay demo:<br/></strong>A small collosseum like demo designed to be a <em>teaser</em> for the game and actual story demo, after a year of work we are finally able to present a polished pre-alpha that is both fun to play  and to experience with. We show some of the basic functionalities like enemy spawning for combat, the general flow, the scripting system, decision making system and the general look of the game. Please keep in mind that this a <em><strong>pre-alpha </strong></em> and bugs will inevitably be in it, but please report them to me and I promise they'll be fixed in no time. This demo also doesn't showcase the story a whole lot although several nods to the general flow can be found if you go look. We did our best to keep the writing of our items and abilities in the general style of what we envision the end product to be.<br/><br/>Thanks for your interest and patience, but most important of all, have fun. Please let us know how you feel about this little demo, leave some feedback, the good the bad and even the ugly are very important to us.<br/><br/>This was Bernd Weckx, the main developer, designer and leader of the current project and I'd like to thank you once again and wish you a great time.<br/></p>", "metacritic": null, "released": "2017-05-21", "tba": false, "updated": "2019-08-28T23:24:03", "background_image": "https://media.rawg.io/media/screenshots/f28/f2842b49e7f19ebcc10758cab2bcc2aa.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 124, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Team Ant Mountain"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}