{"id": 115843, "slug": "singular-nerial", "name": "Singular (nerial)", "name_original": "Singular (nerial)", "description": "Singular\r\n<p>\r\n\tSingular is a puzzle game where you lead a terrified green cell through different traps. It's a story about isolation, love, sacrifice and the discovery of diversity...an epic adventure for one little cell. Every room is a variation around a really simple and satisfying mechanic (touch cells to make them explode to a certain radius). The story is an extension of the mechanic and vice-versa. The inspiration behind is to be found towards \r\n\t<em>Thomas was alone</em> or <em>World of Goo</em>.</p><p>\r\n\tFeatures : </p><ul>\n<li>60 levels full of puzzles and action, including 10 generated levels (different every time you play them)</li>\n<li>4 different breeds of cells x 7 different actions = many possibilities</li>\n<li>a unique \"Combo!\" mode, where you compete against the world to make the highest score</li></ul><p>\r\n\tI'm a French indie game developer working in London. Singular is a game originally made for Ludum Dare #28. Here is the original game. I also do other cool stuff with museums, robots and all sorts of things.</p><p><strong>Twitter : </strong>@nerial</p><p>\n<strong>\r\n\tThe game is available for a small price on </strong>Android<strong> and </strong>iOS<strong> (try it, it feels completely different to touch the cells !).</strong></p><p>\n</p><p>\r\n\tThe game is also available for Windows, Mac OSX and Linux. For that computer version I set the price at $3 but feel free to change that amount : try it for free, pay the asked price, support my work by paying more... it's up to you !</p>", "metacritic": null, "released": "2014-04-08", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/c8c/c8c7febe4f5e32f3d1a3af6ebd4c8555.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 65, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Nerial"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}