{"id": 115977, "slug": "anura", "name": "Anura", "name_original": "Anura", "description": "<p>Small game about the frog. Hungry frog.<br/></p>\n<p>Feed this frog, by control the tongue and catch as many flies as you can. But beware of red ones, they stinging. And do not ask me about the spiders.<br/>To have enough precision, you will control the tongue in the slow motion. This will help.</p>\n\n<p>The idea of this game came to me while walking around the city. After a few days I got bored, and decided to try to realize the idea. A few hours later there was a working prototype.<br/>If so, this game could be developed into something more, but I decided to finish as quickly as I started.</p>\n<p>The game is actually based on classic Snake game. But instead of controlling the snake, that grows with every meal, you control the tongue of the frog in slow motion.<br/></p>\n<p>To do this on pc, you can use Space-button to start and stop movement, and arrow keys to change direction.<br/>On mobile device you can press on frog's tummy to start and stop movement, and use swipe, to change directions.</p>\n\n<p>Speed of the tongue movement is linked to number of flies, that you eat. With more higher score come big troubles ;-)</p>\n<p>Red bugs, that is wasps. They will sting you, if you touch it. And your score will go down to zero. The same with spiders.<br/>And do not go to far from the screen with your tongue.<br/>Also, like in classic Snake game, if you hit your \"tail\", you lose. Your tongue will knotted in a knot and score will go zero.</p>\n<p>With all that, have fun and take highest score<br/></p>", "metacritic": null, "released": "2018-03-18", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/32f/32f0d0afef67d513b1cceddc612dbbc1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 41, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Android"], "developers": ["acvarium"], "genres": ["Action"], "publishers": [], "esrb_rating": null}