{"id": 11597, "slug": "holdfast-nations-at-war", "name": "Holdfast: Nations At War", "name_original": "Holdfast: Nations At War", "description": "<p>Holdfast: Nations At War is an online multiplayer first and third person shooter focusing on a combination of teamwork and individual skill. Take part in historic clashes on land and at sea waged by the most powerful nations during the great Napoleonic Era.<br />\nPlay the way you want!<br />\nCommand and crew historically inspired sailing vessels in powerful duels or within squadron operations where cooperation in running your vessels leads to victory. War at sea is an entirely different setting and these clashes will take place off the coast in a selection of beautiful arenas.<br />\nTake the King’s shilling or fight for the Emperor in glorious Napoleonic field battles. Join the ranks and keep the line steady or provide support from the rear with cannon fire as you strive for dominance over the battlefield.<br />\nJoin the Navy<br />\nExperience what it’s like to be a crew member on board a military sailing ship. Raise the sails, fire the cannons, test the water depths and cooperate to keep your vessel afloat!<br />\nEnlist in the Army<br />\nWork with your comrades to storm enemy fortifications or support the fight from the rear with artillery fire. Keep the line steady in open field battles and lead your men to victory!<br />\nPlay as a Captain, Sailor, Line Infantry and more! Every class comes with its own traits and roles which are crucial for your team’s survival.<br />\nHoldfast: NaW’s order-based system allows for intuitive cooperative play where your ability to work as part of a team matters just as much as your personal skill.<br />\nWhether you are manning a cannon, firing a musket or swinging a sword, Holdfast: NaW&#39;s combat mechanics are easy to learn but hard to master. The game rewards player skill via a precision and timing based directional melee system.<br />\nThere will be plenty of chances for you and your mates to take on other groups in tournaments and fierce competitive events. Hone your skills because you can be sure that your opponents will too!</p>", "metacritic": null, "released": "2020-03-05", "tba": false, "updated": "2023-06-02T12:13:12", "background_image": "https://media.rawg.io/media/screenshots/129/129d6a8af31f1fb4111bbb1063eddcd0.jpg", "website": "http://www.holdfastgame.com", "rating": 3.24, "rating_top": 4, "added_by_status": {"yet": 9, "owned": 175, "beaten": 2, "toplay": 7, "dropped": 12, "playing": 2}, "playtime": 3, "achievements_count": 55, "ratings_count": 21, "suggestions_count": 364, "game_series_count": 0, "reviews_count": 21, "platforms": ["PC"], "developers": ["Anvil Game Studios"], "genres": ["Action", "Indie"], "publishers": ["Anvil Game Studios"], "esrb_rating": null}