{"id": 115999, "slug": "dreamscapes", "name": "Dreamscapes", "name_original": "Dreamscapes", "description": "<p>\"Once upon a time, I dreamt that I was a butterfly, fluttering hither and thither, to all intents and purposes, a butterfly. Now I do not know whether I was then a man dreaming I am a butterfly, or whether I am now a butterfly dreaming I am a man.\"</p>\n<p>~Zhuangzi</p>\n<p>So, I have to say, I don't think this is a very good game.  I was never really invested in it to begin with.  I was only invested in the art I was making for it.  The fact is that A Most Inconvenient Evening, Dry Fate, and Vega Legacy are much, much better games and you will very likely enjoy them more.  You would also likely enjoy Alpaca Moon much better.</p><p>The world is ending and Arielle and her unicorn companion Mia have gone on a quest to save it, but the world keeps changing all around them.  Doors don't lead the same way twice, and they are attacked by creatures seemingly from their dreams.  They find themselves in realms that shouldn't exist, and doors that don't go the same way more than once.  All that they see around them is the impending death of the world.</p>\n<p>Or is it the birth of a new one?</p>\n<p>This is my first genuine effort in RPG Maker MV.  Because of the time limit, I've decided not to go overboard with custom graphics.  Though I am grabbing graphics from artists everywhere I can find them, I am using the RTP floor and wall tiles.  My main characters, including battlers, are custom, and my enemy battlers are made by Thalzon.  I am also, for the most part, using the default system, with some sprucing up using Yanfly plugins.  The big focus here is on the story.  Since this game is inspired by a recurring dream I used to have, the game will be written as if it is a dream, with surreal qualities such as non-linear travel between maps and creatures from all manner of myth.</p>", "metacritic": null, "released": "2017-11-04", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/1f8/1f8fbb73f053b99f59e36cc885fda710.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 225, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["pianotm"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}