{"id": 115910, "slug": "pumpkin-jumpin", "name": "Pumpkin Jumpin", "name_original": "Pumpkin Jumpin", "description": "<p>Bonjour,</p>\n<p>Je m'appelle Lucien, j'ai 9 ans et c'est ma première Gamejam. J'ai utilisé les ateliers sur le casse-brique, le shooter et le tuto des balles rebondissantes. L'écran de game over reprend le code du menu de l'atelier Tetris.</p>\n<p>Le but du jeu est de survivre aux citrouilles rebondissantes en tirant dessus et en les évitant. Pour terminer le jeu, il faut tuer 200 citrouilles. Il faut aussi ramasser le plus de bonbons possibles pour augmenter son score.</p>\n<p>Lancer le jeu: touche entrée<br/>Déplacement: flèches gauche et droite<br/>Tir: barre espace</p>\n<p>Si j'avais eu plus de temps et de connaissances, j'aurai essayé d'ajouter des bonus, des malus, des explosions et des levels avec un boss de fin.</p>\n<p>Merci à mon papa et à ma maman pour la traduction des textes en anglais et aussi la correction des fautes d'orthographe.</p>\n<p>- Élève Premium de Gamecodeur: depuis le 15/07/2017</p>\n<p>- Langage et Framework utilisé: Lua et Love2d</p>\n<p>- Code par: Lucien</p>\n<p>- Graphismes et sons par: ressources gratuites sur Internet</p>\n<p>- Utilisation de librairies et codes externes: Non</p>\n<p>- Temps passé: 40 heures</p>\n<p>- Comment as-tu (ou pas) abordé la contrainte du thème: Aucune</p>\n<p>- Petit postmortem: j'ai eu de gros problèmes pour faire les collisions et le déplacement des citrouilles, le code pourrait sûrement être plus propre. Merci David de m'avoir débloqué sur l'animation des citrouilles qui bloquaient sur les côtés de l'écran.</p>", "metacritic": null, "released": "2017-10-25", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/f3d/f3de189a0b28f8af88ce59de1c62a9b5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 25, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Lulu"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}