{"id": 11599, "slug": "castle-torgeath-descent-into-darkness", "name": "Castle Torgeath: Descent into Darkness", "name_original": "Castle Torgeath: Descent into Darkness", "description": "The darkest journeys often have the smallest beginnings…<br/><br/>Called upon by an old friend, you find yourself on a mission to discover the whereabouts of a missing Expedition sent to the ancient ruins of Castle Torgeath. Upon your arrival a cave in seals your exit, also sealing your fate. Knowing that no other option remains, you begin your descent into the depraved depths of Castle Torgeath.<br/><br/>The journey will not be easy, for Torgeath has a long and bloody history. Monsters, curses, and even starvation will impede your progress. Many who have ventured into the castle’s depths have never returned.<br/><br/>Along the way you will have to master the sword and the spell if you hope to survive. As you venture further into Castle Torgeath you will discover the story of the Expedition and the dark fate that befell the castle’s inhabitants.<br/><br/>Features <br/><br/><ul><li>Feel the retro experience come to life in modern form.<br/></li><li>Play an interesting mix of several genres that creates a unique dungeon crawler which rewards quick reactions, good stat management, and careful exploration.<br/></li><li>Experience an eerie ambiance that puts you on edge.<br/></li><li>Enhance yourself with a RPG system that allows you to choose what your character specializes in and how you approach combat.<br/></li><li>Enjoy the artistic style of a 3D free motion first-person dungeon adventure.<br/></li><li>Survive by scavenging food, potions, and other supplies.<br/></li><li>Combat a reanimation fog that morphs fallen enemies.<br/></li><li>Barter with the Phantom Trader for 3 different special power-ups.<br/></li><li>Challenge yourself in Rogue Mode where you only have one chance to live.<br/></li><li>Fight intense battles using up to 6 different weapons against over 20 types of enemies.<br/></li><li>Discover an in-depth story that explains the events that previously occurred in the castle.</li></ul><br/>Castle Torgeath was influenced by games such as Hexen and King’s Field and aims to maintain a dark and eerie ambiance. We’ve combined elements from past dungeon games along with a small brush of horror and our own design to bring you an exciting dungeon adventure.  Castle Torgeath is bringing back the 3D dungeon adventure and we hope you will come along for the ride!", "metacritic": null, "released": "2016-12-15", "tba": false, "updated": "2019-08-28T22:13:47", "background_image": "https://media.rawg.io/media/screenshots/55b/55bc2886db45e191a344cba670cf98da.jpg", "website": "http://dungeoneeringstudios.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 4, "owned": 52, "toplay": 1}, "playtime": 5, "achievements_count": 14, "ratings_count": 4, "suggestions_count": 532, "game_series_count": 0, "reviews_count": 4, "platforms": ["PC"], "developers": ["Dungeoneering Studios"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["Black Shell Media"], "esrb_rating": null}