{"id": 116029, "slug": "jens-monster-cafe", "name": "Jen's Monster Cafe", "name_original": "Jen's Monster Cafe", "description": "<p><strong>2/10/2018-</strong></p>\n<p>This is the Call It Quits Release of Jen's Monster Café.  This remains a very unfinished version of the game, but I had enough content ready that I felt I should do an update for those who like that sort of thing. You'll get some more pieces of the story by playing this release, but mostly unfinished fragments with a few contradictions I had not yet smoothed over before shelving this project. (Notably two party members' introduction events are incomplete and no endings are implemented.)</p>\n<p>I should really call it the Un-Release as this update is <strong>untested</strong>, <strong>unfinished</strong>, and <strong>unpolished</strong>, but you might still get some enjoyment out of it if you're the type who likes to wander around game worlds aimlessly as I do.</p>\n\n<p><strong>Original Description:</strong></p>\n<p>Work your way up from homeless, unemployed maid cafe drop out to a respectable proprietor of a monster grocery store &amp; cafe.</p>\n<p>In this demo version for the IGMC 2017 contest, you can play through the intro of Jen's Monster Cafe and stick around for freeplay and surprise events.</p>\n<p>(Not all events and features are available in this version, but check back for updates after the IGMC 2017 contest concludes for new and modified events, cooking system implementation, game endings, and more, )</p>\n<p>Created for IGMC 2017</p>", "metacritic": null, "released": "2017-11-06", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/42e/42e39a98a59a4be85f4026b5c9a62a64.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 193, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["LastEspresso"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}