{"id": 116037, "slug": "red-frontier", "name": "Red Frontier", "name_original": "Red Frontier", "description": "<p><strong>Please remember to vote the game in the jam from here: http://www.asylumjam.com/games/RedFrontier/295137</strong></p>\n<p><strong>\"The most important thing about a technology is how it changes people\".-JARON LANIER</strong></p>\n<ul><li><p>You're a mercenary. You are a miner. You are an old pirate. three people stuck on an alien planet. The only one will escape from the horrors of the red planet. But every try will make it stronger, faster, smarter...You've got only one chance at it. Good luck.</p></li><li><p>Red Frontier is an open world horror/action game where you need to use your available tools and strategies to confuse the monster and escape from the planet. You'll need to unlock four stations to escape. You have only one life, but three characters. each character is different from each other. if your first character dies, the monster becomes stronger. So the game becomes harder and harder.</p></li><li>Game time is around fifteen to thirty minutes depending on your gameplay style. The Game Does not have a full-fledged lore but there are some collectibles to give you a good far future feeling. Or in case players want a sequel.</li></ul>\n<p>Here are some tips for help. Zero, First and second tips are not an actual spoiler, but third and fourth ones are minor spoilers. You can still look at them.</p>\n<p><strong>Tips</strong></p>\n<ul><li>Tips 0 - There are mini safehouses near roads. You can use them to hide from the monster.</li><li>Tips 1 - Signaling other stations to confuse the monster is really important. But remember that the monster<br/>can be very fast.</li><li>Tips 2 - You can freely run once the monster is not around.</li><li>Tips 3 - At early times, you can outrun the monster if you start running early. But monster becomes faster<br/>once you start to unlock stations.</li><li>Tips 4 - at your first death monster start to track you down randomly times. At second death, the monster can cloak itself from the radar. if you're at your last character, it'll be the hardest for you.</li></ul>\n<p><strong>Controls:</strong></p>\n<p>WASD - Move</p>\n<p>Mouse left click - interaction</p>\n<p>Optimization is a little bad. Your fps might low in first 10 seconds of the game. If you're still having problems, try reducing your resolution.</p>\n<p>This game made for #asylumjam2017 in 4 days by Belaniax &amp; Wolderado</p>", "metacritic": null, "released": "2017-11-06", "tba": false, "updated": "2019-08-28T23:24:02", "background_image": "https://media.rawg.io/media/screenshots/ed3/ed35f8cd46c089f9e1ac0483626669fc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 144, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Wolderado"], "genres": [], "publishers": [], "esrb_rating": null}