{"id": 11611, "slug": "whiplash-crash-valley", "name": "Whiplash - Crash Valley", "name_original": "Whiplash - Crash Valley", "description": "Have you ever dreamed about being a crash test dummy? Fear not! Your chance is here!<br/>Step into the city of Crash Valley and test the limits! Crash into buildings, people and dart boards, among many other things. Or perhaps you want to be the test dummy inside the car? We’ve got you covered, buddy!<br/><br/>You play as a crash test dummy. He’s endured years of pain and torture in the crash test dummy lab. But he has had enough! It’s time for revenge! Kick people in the face and bring destruction upon Crash Valley and its citizens. It’s up to you to bring glory back to you and your kind as an orange plastic piece of art - a Crash Test Dummy!Key Features<ul><li> Super-premium-deluxe interactive Ragdoll simulation system.<br/></li><li> Play as a super good looking crash test dummy, orange and everything.<br/></li><li> Bugs in every piece of the game, but what does it matter when you're the best crash test dummy in the World?<br/></li><li> Drive different vehicles and other random objects, such as a toilet, shopping cart and a dumpster!<br/></li><li> Explore the wild and insane world of Crash Valley.<br/></li><li> Support the environment with ultra-digital wind turbines.<br/></li><li> Everything you can do ingame you can do in real life (if you’re a crash test dummy). </li></ul>", "metacritic": null, "released": "2016-12-07", "tba": false, "updated": "2019-08-28T22:13:46", "background_image": "https://media.rawg.io/media/screenshots/375/375be3946c3ce4fbc3d2c1a0479e5bdc.jpg", "website": "http://www.whiplashthegame.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 30}, "playtime": 2, "achievements_count": 26, "ratings_count": 0, "suggestions_count": 386, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Diagrammet"], "genres": ["Adventure", "Simulation", "Casual", "Indie"], "publishers": ["Diagrammet"], "esrb_rating": null}