{"id": 116178, "slug": "xoel", "name": "xoEl", "name_original": "xoEl", "description": "xoEl - an indie puzzle game<p>\r\n\tNow on\r\n\t<br/>\n</p><p>\r\n\t\tThe evil empire xoEl is spreading across the galaxy oppressing planets and capturing species to convert them into cubes. Their dark forces have just invaded Planet 8411 and taken all the members of a race called Yabbies as prisoners and locked them up. However, a very special Yabbie is able to roll his cube in order to escape from the platform that conform the modules of the prison.\r\n</p>\r\n\tAvailable on mobile markets\r\n<p>\n<br/>\r\n\tANDROID - https://play.google.com/store/apps/details?id=com.greyman.xoEl\r\n</p><p>\r\n\tIOS - https://itunes.apple.com/us/app/xoel/id1161362952\r\n</p>Demo release on PC<p>\r\n\txoEl is releasing on mobile platforms for free on December 1st 2016. Greyman Studios is now launching a \r\n\tKickstarter campaign looking for the support of the community to make PC version possible for 1Q 2017.\r\n</p><p>\r\n\tCurrent \r\n\t<strong>PC version is a beta</strong> that shows the state of the development:\r\n</p><ul>\n<li>Featuring 4 levels out of 30.</li>\n<li>Music in progress.</li>\n<li>Achievements not implemented yet</li>\n<li>UI under construction.</li>\n<li>Character animation in progress.</li>\n</ul>How to play<p>\r\n\t The gameplay is very simple. You play the rol of a \r\n\t<strong>Yabbie</strong>, whose race has been imprisoned by evil empire xoEl. Your mission is to escape from the prison formed by platforms, freeing as many partners as you can on the way. The aim is to roll and colour the box you are trapped in by stepping into special cells so you can get through the exit cell and fall onto the below platform.\r\n</p><p>\n</p><p>\r\n\tThere is a wide range of mechanics: colour the entire box, colour a single face, activate or deactivate bridges, set other partners free by matching face colours and evading any contact with sentinels... and many more.\r\n\t<br/>\n</p><p>\n</p><p>\r\n\tAt the end of each level, made up of 16 platforms, the yabbie will escape from the cube for a moment, but will be caught again for the next level.\r\n\t<br/>\n</p><p>\r\n\tThe score for the levels (all 16 platforms) will be calculated by adding the number of moves, the time spent and number of partners freed.\r\n\t\r\n</p>", "metacritic": null, "released": "2016-11-24", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/488/4886793c85dbf8e1c32f496abdb01d5a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 109, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Greyman Studios"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}