{"id": 116161, "slug": "at-last-alone-risen", "name": "At Last Alone: Risen", "name_original": "At Last Alone: Risen", "description": "<p>A report has reached the Kingdom of Laurentide that a terrible illness has spread within a fishing village in the western islands. Illness has been virtually wiped out due to advances in medicine, so the report is met with concern. <br/></p>\n<p>What befell the community if Ivy Cove? Can Shatter Team Alpha track down the survivors and provide assistance? And are forces at play in the Ivy Islands that suggest that this illness is part of a larger, insidious scheme?<br/></p>\n<p>****</p>\n<p>The annual Crab Festival of Ivy Cove is held every year to celebrate the fall harvest of this cornerstone of the Ivy Islands economy. Nearly all who live in Ivy Cove are tied to the crab fishery in one way or another and the Crab Festival is a time of community-wide celebration for a village perched on the edge of civilization.<br/></p>\n<p>But the celebration is short-lived. </p>\n<p>A medical team is put together and escorted to the community by the newly formed Shatter Team Alpha of the Laurentide army. However, when they arrive in the community, they find the village abandoned. Mysterious clues point to a wave of suicides, while other clues suggest survivors went to a nearby town for medical attention.</p>\n<p>****</p>\n<p><em>At Last Alone: Risen</em> tells an early story of Shatter Team Alpha, the top special forces team in the Laurentide ground forces. Led by newly-appointed captain Calista Strelley, the team includes and her companion direwolf, Georgie, Garrard Dwirisa, Brilavial Rowley, and Jonvrenn Glonn. General Niranda, commander of the Shatter Teams, also joins the mission.</p>\n<p>Take command of the Shatter Team and investigate the illness and the missing villagers! But watch out, the island is infested with a range of dangerous creatures who aim to stop you at every turn! </p>\n<p>****</p>\n<p>This game was made for the 2017 IGMC competition. It is set in the same world as my other game, At Last Alone: Rescue at Moranthia, but takes place about 6 years prior to that adventure. Many of the same characters are present.</p>\n<p>The game uses a tactical battle system patterned largely on Final Fantasy Tactics (as opposed to Advance Wars or Fire Emblem) and battles take place on a series of isometric maps. The game features an original battle theme and an original credits theme by O Colosso. Other original music was created by  me using ampermusic.com. It also takes place at night, so turn up that brightness and use those headphones for extra eeriness!</p>\n<p>Follow the devblog on instagram!<br/></p>", "metacritic": null, "released": "2017-11-02", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/ad2/ad2fb75860fd26ee875efa1f8d17f8dd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 174, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["djbeardo"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}