{"id": 116182, "slug": "team-therapy", "name": "Team Therapy", "name_original": "Team Therapy", "description": "<p>Are you in need of some serious \"TEAM BUILDING\"? Do you have trust issues? Is the weight of the world coming down un-abated on your shoulders like a thousand years of Atlas' torture? Then try the brand new TEAM THERAPY, and in just a few minutes both you and a friend will be feeling 100% better!* <br/><br/>TEAM THERAPY, is a 2 player game where each player has one room. They cannot directly interact, but will be shown puzzles in which they must work together to complete. Fun will be had. Tears will be shed. Expletives will be deleted. <br/><br/>BUT WAIT, what's that? Your an anti-social chump with no friends?(Just like the rest of us) That's okay, because you can be your OWN friend and YOU CAN PLAY SINGLE PLAYER BY LAUNCHING THE GAME IN TWO WINDOWS AND CONNECTING WITH YOURSELF! (Sorry I can't always control my voice) <br/><br/>Got Stuck? Read a few Motivational Quotes to help you through those dark times.</p><p>Music made in GarageBand. There are 3 tracks. You can press the '.' key to skip to the next track and hear them all! <br/><br/>Found a bug? We here at ACER want to ensure only the highest quality in team building exercises. Leave a comment below so we can keep improving your team building experience. <br/><br/>*there is absolutely no guarantee you will feel any better. You may even feel worse. Do not play TEAM THERAPY while drunk or on heavy medication or while operating heavy machinery. If no life-guard is present, play at your own risk. <br/>Time spent playing is non-refundable.</p><p>Inspired by: https://ndcisivegames.itch.io/you-solve-my-puzzle</p>", "metacritic": null, "released": "2017-03-13", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/d23/d237a36e0abda10429f637a1d44e67f0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 40, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Catwheel"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}