{"id": 116272, "slug": "otterfall", "name": "Otterfall", "name_original": "Otterfall", "description": "<p><strong>***This is a free demo, but if you like what you see and want to support future development of more levels, feel free to donate any amount you feel comfortable with. Thanks, everyone!***</strong><br/></p><p><strong>Otterfall is a fast-paced timed adventure where you must get to the bottom of a raging waterfall and to safety. You need to survive until the time runs out, but there are numerous enemies and obstacles in your way, from fierce gators and large fish, to rocks and broken trees. </strong></p><p><strong>This is the first two levels of the game. Future levels will include spooky ghost ridden wastelands, frozen tundras, and much more. </strong></p><p><strong>We will be adding updates and new levels frequently, as well as implementing any feedback we receive along the way. </strong></p><p><strong>We really want to know what you think of our game! Please tell us or share your questions or comments so we can make this the best otter based game it can be!</strong></p><p><strong>You can stay up to date with what's going on by following us on Twitter: </strong><strong>Corner Booth Games on Twitter</strong></p><p><strong>You can also read our development blog over at Tumblr: </strong></p><p><strong>Otterfall Development Blog</strong></p><p><strong>Please enjoy and let us know what you think! We want to make this the game you want to play, but we need your help. Thanks for your time. </strong></p><p><strong>Now go play Otterfall!</strong></p>", "metacritic": null, "released": "2015-02-04", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/6e3/6e3e90ce4069776db0fb2ea33945c4e8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 101, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Corner Booth Games"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}