{"id": 116297, "slug": "burden-park", "name": "Burden Park", "name_original": "Burden Park", "description": "<p>Welcome to the one and only Salem Fun Park's GRAND REOPENING!</p><p>Get ready to experience the most fun you've ever had in our funniest attraction: The Funhouse! Lots and lots of surprises are gonna await you here, so be sure to check it out!</p><p>Wanna experience the beautiful view of the infamous Salem landscape from up high? Then you might wanna visit our giant ferris wheel. From up there you'll be able to see anything. But watch out that you don't fall... accidentally...</p><p>And don't worry about anything! We have a nice security office with 15 nice officers who'll do anything to help you. We also always have a doctor ready, who fixes you if anything happens. Because safety is first!</p><p>But the most notorious of our attractions is of course Stampy's circus tent! Stampy the Clown himself will perform there every night! His performance is great for children AND for adults so don't miss out on him!</p><p>If that hasn't convinced you the next thing will: THERE IS NO ENTRANCE FEE because of our GRAND REOPENING! For the first week you'll be able to enjoy all of our attractions for free so be sure to come by to the one and only Salem Fun Park.</p><p>Burden Park is a first-person horror adventure where you have to explore and find your way out of the mysterious Salem Fun Park. Find out what dark secrets are hiding behind the happy facade of the Park and learn more about your own tragic past...</p><p>Credits:</p><p>Producers</p><p>Robert Vater - Programming, Modelling</p><p>Jana Höning - Music, Sounds, Story</p><p>Voice Actors</p><p>Will Wallace - Jana Höning</p><p>Jeff Jeferson - Jake Furtado</p><p>Cigaretteguy - Zero99i</p><p>Background #1 - Maja Höning</p><p>Background #2 - Dominique Uphues</p>", "metacritic": null, "released": "2016-10-31", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/962/962d44726612b407bb1dc1521cc72025.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 61, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Robert"], "genres": [], "publishers": [], "esrb_rating": null}