{"id": 116377, "slug": "a-dragons-freedom", "name": "A Dragon's Freedom", "name_original": "A Dragon's Freedom", "description": "<p>You are a sprite, a luminous being trapped in a cave. Thankfully, a dragon followed you and uses your light to find the flowers nearby. Make your way east, using the flowers as a means to influence your dragon and protect yourself from the Shadows...</p>\n<p>Control your sprite with arrow keys, dodge away from the shadows and progress til the end. (This game is very short)<br/><br/>This game was created over a period of 48 hours by a student team from Enseeiht, (Toulouse, France). around the theme \"Free Will\", for the IRX gamejam.</p>\n<p>More information about us here : https://www.facebook.com/7fault/.</p>\n\n<p>We couldn't put everything into the game in time, most notably the lines of narration we recorded. They're useful to understanding why the game plays as it does and what meaning we were going for in the ending we chose. All lines except the final ones are transcribed here.</p>\n<p>\"<br/></p>\n<p>Life flourished for thousands of years on Ashgan. Sprites roamed freely, following the wake of the tranquille dragons.The dragons fed off flowers and the sprites grew in the dragon's energy. The shadows floated like ethereal mists of fluff, feeding off the sun's rays. Then, the volcanoes burst. Ash filled the skies, shutting off the sun, as all life fled to the caves. The sprites' light kept up hope, guiding the way for the dragons to continue feeding. The shadows turned to that only light, too...</p>\n<p> The sprites' light grew as it progressed. As the light grew, the dragon ventured further and further away, while more and more shadows grew attracted. It was free to roam as it wished, and in its lust for freedom, it distanced itself from the light which enabled it to fly.</p>\n<p>///Something happens///<br/></p>\n<p> (This is the end of the game, by the way)\"</p>\n\n<p>Our team members : Rémi (aka the hobo), Olivier (aka menu dealer), Corentin (aka trapped by boolean), Jonathan (aka break taker), Florent (aka blind coding), Alexys (aka mouseless computer) , Leo (aka the forgotten) and Léa (aka the princess).</p>\n<p>Special thanks to many extras (Zadig, BNEI, Adrien, TVn7, Musik7)<br/></p>", "metacritic": null, "released": "2017-05-15", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/d99/d996feda4ff6384b7ca6253bb713019b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 22, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["7fault Dev Team"], "genres": [], "publishers": [], "esrb_rating": null}