{"id": 11637, "slug": "drizzlepath-genie", "name": "Drizzlepath: Genie", "name_original": "Drizzlepath: Genie", "description": "Lula lives a happy life in her seaside village. Until one night a mysterious wizard tells her in a dream that she must find a relic called the Genie. What is the Genie? Could it be a key to unlock the truth about life and the universe? Could it be the answer to all her questions?<br/><br/>Find out, when you walk as Lula, on the path you choose, as she journeys to discover the meaning of the Genie and fulfill her destiny. The path you choose will determine the fate of the world.<br/><br/>Giving you the opportunity to explore both paths, Drizzlepath: Genie promises at least around 4 hours of relaxing experience. A rich story combine with immersive graphics, fantasy style natural environments, and a calming, ambient soundtrack to make it a journey you may not soon forget.<strong>Key Features</strong><ul><li><strong>Rich and poetic story</strong> presented by a clear narration.<br/></li><li><strong>Subtitles</strong> with multiple language choices.<br/></li><li><strong>Gorgeous graphics</strong> powered by Unreal Engine 4. Wherever you look is nice scenery.<br/></li><li><strong>Calming ambient music</strong> of over an hour in total.<br/></li><li><strong>Things to explore</strong> including many surprising and hidden ones.<br/></li><li><strong>Replayability</strong>; as you choose your own path in the beginning of the game and both paths offer totally different atmospheres.<br/></li><li><strong>All new \"Gothic Vision\" mode</strong> in which you see the game's graphics in a whole new vision.</li></ul>", "metacritic": null, "released": "2016-02-22", "tba": false, "updated": "2019-08-28T22:13:45", "background_image": "https://media.rawg.io/media/screenshots/62e/62ee59a35a0698fd3ae617144756dc9f.jpg", "website": "http://tongucbodur.myportfolio.com/genie", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 66, "beaten": 2, "toplay": 5}, "playtime": 4, "achievements_count": 10, "ratings_count": 4, "suggestions_count": 525, "game_series_count": 0, "reviews_count": 4, "platforms": ["PC"], "developers": ["Tonguç Bodur"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Tonguç Bodur"], "esrb_rating": null}