{"id": 116376, "slug": "mozarts-name-day-halloween-stories-for-music-lover", "name": "Mozart's Name Day: Halloween Stories for Music Lovers", "name_original": "Mozart's Name Day: Halloween Stories for Music Lovers", "description": "<p>\n<em>Mozart's Name Day</em> is a series of five short horror stories by FMA3110, originally released for Android in 2012. They're no longer available on the Google Play Store, but since they were published under a Creative Commons license, I decided to port them to Ren'Py to share with other music lovers.\r\n</p>\n<p>\r\n\tIn FMA3110's own words:\r\n</p>\n<p>\n<em>Can horror stories be more than just entertainment?<br/>\r\n\tOf course they can, therefore, inspired by the fact that I'm born on the 31st October and I am a Mozart fan, whose name day is celebrated on the very same date, I wrote this story.<br/>\r\n\tIt's not just text: images and, above all, music are part of the experience.</em>\n</p>\n<p>\r\n\tThe Ren'Py version features text-to-speech support, including added captions for important text in the images of the first story. Press V to enable or disable self-voicing.\r\n</p>\n<p>\n<strong>Contents:</strong>\n</p>\n<ul>\n<li>First Name Day: Don Giovanni</li>\n<li>Second Name Day: Organ piece for a mechanical clock</li>\n<li>Third Name Day: Syncopes</li>\n<li>Fourth Name Day: Diggi, Daggi</li>\n<li>Last Name Day: Requiem</li>\n</ul>\n<p>In addition to some sound balance adjustments, I took the liberty of making minor changes to the text for grammar and clarity. Any typos remaining are probably my own. The Mac version has not been tested. Please report any errors or bugs in the comments below.</p><p>If you enjoy <em>Mozart's Name Day</em>, check out <em>Saint Wolfgang's Night </em>(<em>La notte di San Wolfgango</em>), FMA3110's theater project that grew from the same inspiration.</p>\n<p>Happy Halloween, and Happy Mozart's Name Day!</p>\n<p>\n<br/>\n</p>", "metacritic": null, "released": "2016-10-31", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/aaa/aaa525c827baf394148b89ea53d8d3ae.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 81, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Teatime"], "genres": [], "publishers": [], "esrb_rating": null}