{"id": 1164, "slug": "companions", "name": "Companions", "name_original": "Companions", "description": "- TOUCHARCADE REVIEW (****):<br/>\"It's pretty rare to see an iOS strategy game that not only has a captivating story, sound gameplay mechanics, and challenging difficulty, but also manages to accomplish all this while not being a tower defense derivative. Companions manages to achieve all this and more, and leads to a great experience for those iPad owners looking to try out a real strategy game.\"<br/><br/>- GAMERS TEMPLE (96%):<br/>Companions drags together the best of bigger console titles (story, character, length) and the best of the handheld world (touch-screen controls, single iPad multiplayer) into one cohesive, extremely fun game. No joke: If you don't like the game after level 1 or 2, you probably just hate fun games. Download this one soon.<br/><br/>- iPHONE LIFE:<br/>\"Companions makes good use of the iPad to give complete command over any melee situation, has a detailed storyline, and plenty of challenges to keep oneself immersed for hours!\"<br/><br/><br/>- FEATURES:<br/><br/>- PLAY the huge campaign with 10+ hours playtime<br/>- PLAY again with different party combinations<br/>- ENDLESS replay value (random drops, random enemies) <br/>- PLAY with 3 different classes for each race:<br/><br/>- Minotaur: Berserker, Gladiator, Bull<br/>- Elf:      Assassin, Ranger, Archer<br/>- Dwarf:    Miner, Draftsman, Engineer<br/>- Human:    Light, Matter, Void<br/><br/>- IMMERSE yourself into the deep story line<br/>- ENJOY the 40+ skills<br/>- BUILD bombard, crossbow and scythe towers<br/>- LAY spike traps, stone traps and decoy bombs<br/>- GATHER 100+ items<br/>- GAIN 30+ unique items<br/>- FIGHT brutal boss mobs<br/>- SURVIVE gigantic battles<br/>- USE the tactical pause (20 or 60 seconds)<br/>- LISTEN to philosophical pest zombies <br/>- DEFEAT the really BIG DRAGON RAARTAARK<br/>- LOOK upon the great artwork<br/>- CHOOSE from 3 difficulty settings<br/>- CONNECT to GameCenter<br/>- GET 41 achievements<br/>- SCORE on the 4 single maps with leaderboards<br/>- AUTO and MANUAL save<br/><br/><br/>- YOU ARE IN CONTROL! <br/><br/>Lead the four Companions to their destiny. Battles of epic magnitude await you on your way down towards the catacombs of Mentzel and the lava chambers of the volcano Eaneum.<br/>Hordes of evil and strange creatures with nothing but hatred and death in their minds will do everything in their power to stop the Companions! <br/><br/>Altland may well be thrown into another devastating war. You are the only one able to guide the Companions safely through the storm that threatens to engulf the world!<br/><br/>The dangers are potent and manyfold. MAY UROORG BE WITH YOU!<br/><br/>- SAVE ALTLAND!<br/><br/>Altland is in danger. The dark god Detexx is on the rise again, ready to plunge Altland into eternal darkness. <br/><br/>People are vanishing and rumour has it, that strange creatures roam the land. Unbeknown to each other our four heroes begin their quests in the catacombs of Mentzel. <br/><br/>You have to unriddle the evil plans of the dark god and do everything in your power to stop the \"Hordes of Nether\"!", "metacritic": null, "released": "2011-05-26", "tba": false, "updated": "2019-10-22T14:04:59", "background_image": "https://media.rawg.io/media/screenshots/b49/b49f01bd80c766ca31719905e1161824.jpg", "website": "http://www.companions-game.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 442, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["smuttlewerk interactive"], "genres": ["RPG", "Strategy"], "publishers": ["Smuttlewerk Interactive"], "esrb_rating": null}