{"id": 116478, "slug": "going-home-vroth", "name": "Going Home (vroth)", "name_original": "Going Home (vroth)", "description": "<p>You find yourself in the middle of an island surround by lava, all you have is your strength to destroy blocks and skills to create other<br/> types of blocks. Your objective is to go as high as possible building<br/> your tower, evading (and attacking) cute monsters that appear to hurt<br/> you and destroy everything on the way.<br/> <br/> Gameplay keys:<br/> - Enter to start game (hellooooo!?)<br/> - Arrow keys or WASD for movement<br/> - Left mouse key for destroy blocks and attacking (note: you can<br/> click and hold for everything!)<br/> - Right mouse key for placing blocks (you need to place a block near<br/> another - a ladder can be near another one)<br/> - Esc to end (it freezes when saving the map)<br/> - Keys 1 to 6: shopping for blocks (if you press shift you sell<br/> instead of buying)<br/> Other keys:<br/> - CTRL+N: generate a new map<br/> - CTRL+S: save the map<br/> - CTRL+L: load the map<br/> Debug keys:<br/> - F8 respawn a monster very close to you<br/> - F9 respawn a monster like the normal respawn<br/> - F10 display your range for building and destroying blocks<br/> - F11 makes you walk around the map without following the character<br/> - F12 display the physics<br/> Another notes:<br/> - You can resize and the game will adjust itself.<br/> - To get a better score you need to building castle-type blocks.<br/> <br/> This game has been make using kenney.nl assets. Victor R. coded (its<br/> me!) and L.A. and company helped testing and designing the game.<br/> Thanks!<br/> <br/> Hope you guys enjoy.<br/> <br/> P.S.: don't fall on the lava, you'll die</p><p>Technical notes: You need to have the latest Java version (http://www.java.com/en/download). The game contains no sound at the moment!<br/></p>", "metacritic": null, "released": "2016-02-19", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/8c1/8c1d5e0e0a6f83687d0d947f451bfd24.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 4, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["vroth"], "genres": [], "publishers": [], "esrb_rating": null}