{"id": 116575, "slug": "le-village", "name": "Le village", "name_original": "Le village", "description": "<p>Commandes :<br/>FLECHES DU CLAVIER , BAS pour faire une action</p>\n<p>Les habitants du village se donnent du mal pour subvenir à leurs besoins. Pour vivre ensemble il faut souvent faire des concessions et essayer de comprendre les autres, même s'ils sont parfois étranges.<br/>Quel personnage allez vous incarner? Comment allez vous influencer la vie locale?<br/></p>\n<p>Fait pour la French Game Jam #4 . Thème \" l'un pour l'autre\"<br/></p>\n<p>Que sommes nous les uns pour les autres ? Qu'est ce que nous pouvons nous apporter? Le bonheur des autres peut il faitre le notre? et inversement?\r\n</p>\n<p>Le but du jeu est de découvrir ce dont les autres personnages ont besoin , pour essayer de trouver l'objet dont le vous avez  besoin . le joueur peut échanger un objet qu'il possède contre celui d'un personnage si ce dernier en a besoin. </p>\n<p>Une fois la partie terminée le compteur de villageaois heureux apparait. Si vous recommencez , les objets seront redistribués et vous pourrez voir ce qui se passe selon les différents cas de figure.</p>\n<p>Le fichier source.</p>\n<p>http://kayugames.com/games/levillage/levillagesource.zip<br/></p>\n<p>SPOIL ( démarche ): \r\n<br/> Le score optenu à la fin de chaque partie n'est pas imputable au skill du joueur, ni à son intelligence , mais bien entierement au hazard. L'interêt serai la réaction du joueur face à la résolution finale. En effet les seuls véritables conséquences provoqués par le joueur sera le choix du personnage au depart, la distribution des objets / besoins se faisant aléatoirement.</p>\n<p>Vous est il arrivé de ne contenter qu'un seul vilageois ? et donc d'avoir gagné la partie en 1 coup ? Qu'avez vous ressenti alors? de la joie pour vous ? de la peine pour les autre villageois ? les deux ? rien ? en tout cas c'est dans cette direction que j'ai construit ce jeu. <br/></p><p>----------------------ENGLISH-----------------<br/></p><p>Controls :<br/>KEYBOARD ARROWS, DOWN to do an action</p><p>\n</p><p>The inhabitants of the village are trying to provide for their needs. To live together make concessions is fundamental, trying to understand others, even if they are sometimes weird.<br/>Which character are you going to play? How are you going to influence local life?</p>\n<p>Made for the French Game Jam # 4. Theme \"For each other\"</p>\n<p>What are we for each other? What can we bring? The happiness of others can it make ours? and vice versa?</p>\n<p>The goal of the game is to discover what other characters need, to try to find the object you need. The player can exchange an object he has against owned by another inhabitant if he need this one. <br/></p>\n<p>Once the party is over, the happyness counter appears. If you start again, the objects will be redistributed and you will be able to see what happens in different cases.</p>SPOIL (approach):<br/><p>The score reached at the end of each game is not attributable to the skill of the player, nor to his intelligence, but entirely at random. The interest will be the player's reaction to the final resolution. Indeed the only real consequences caused by the player will be the choice of the character at the start, the distribution of objects / needs being done randomly.</p>\n<p>Have you ever been satisfied with just one inhabitant? and so won the game in 1 shot? What did you feel then? joy for you? for the other villagers? both ? nothing ? in any case it is how i've built this game.</p><br/>", "metacritic": null, "released": "2018-01-26", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/244/244c6ea1fe76563ee901cbe04f75ccdf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 66, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Kayugames"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}