{"id": 11657, "slug": "frightshow-fighter", "name": "FrightShow Fighter", "name_original": "FrightShow Fighter", "description": "Have you ever seen a giant rabbit shoot lasers from its eyes or a 1-eyed lumberjack tossing \"Bite Bears\" from his bookbag?  That's just a small taste of the odd and unusual sights you'll see in FrightShow Fighter.<br/><br/>This is a fighting game like no other. There are 10 characters to choose from. Each has their own unique abilities, theme music, and bizarre levels!<br/><br/>At its heart, Frightshow Fighter has the feel of the fighting game classics, but with a fever dream twist that leaves you excited for more! <br/><br/><br/>FEATURES<br/><br/><ul><li><strong>Special PowerUps!</strong> Unlock PowerUps that can be used during battle for a temporary boost; like fireballs, poison flasks, slippery oil, or a giant rocket.  You can only bring three into each battle, so choose wisely!</li></ul><br/><br/><br/><br/><ul><li><strong>Story Mode</strong> will include multiple Maps to choose from, with each one offering a variety of different paths for tons of replayability. Each character has their own road to victory, with unique character endings.</li></ul><br/><br/><br/><br/><ul><li><strong>More control!</strong> We've created a unique Pose System that allows your fighters to hold positions to enable more controlled moves when needed.</li></ul><br/><ul><li><strong>FUTURE UPDATE: Global Ranking!</strong> Play against others in online multiplayer and see your ranking go up or down with every battle.</li></ul>STORY<br/>The FrightShow was never meant to be anything but entertaining. Every Thursday night at an old local theater you could come see the wonderful and amazing; the bizarre and obscure. However, this all went awry one night when a cloaked warlock came to see the show. During the final act, the warlock, known as Xonolox, performed an evil spell that was meant to steal the eyes of the entire audience. But the spell was too powerful, he couldn't control it! It backfired, ripped through space and time,  and created a multi-layered universe that left the performers of the FrightShow taking the side of good or evil.<br/><br/>Now trapped in the FrightVerse, where anything is possible, these FrightShow Fighters must do battle in hopes of finding a way out, and back to the normalcy they once knew.  The fighters must do all they can to defeat whomever chooses to go into battle against them.  Now YOU must prepare for FrightShow Fighter!", "metacritic": null, "released": "2016-11-14", "tba": false, "updated": "2019-08-28T22:13:45", "background_image": "https://media.rawg.io/media/screenshots/084/0847f7e51690f9df62efd325153bfe6c.jpg", "website": "http://frightshowfighter.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 57}, "playtime": 1, "achievements_count": 50, "ratings_count": 0, "suggestions_count": 446, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["3 Fright"], "genres": ["Action", "Indie"], "publishers": ["3 Fright"], "esrb_rating": null}