{"id": 116640, "slug": "owls-nest", "name": "Owl's Nest", "name_original": "Owl's Nest", "description": "Authors\r\n<p>Rafael Farinha<br/>Jo Seraph<br/></p>\r\nStory\r\n<p>Anake, Nish and their friends have lived on a small island with their caretaker since the day they were born. Having never seen anything beyond their home, everything changes when they're tasked with retrieving artifacts in hopes of aiding their sweet mother. Suddenly, they're faced with a strange world that seems fractured...</p>\r\nConcept\r\n<p>Owl's Nest is at heart a minimalistic dungeon crawler, where Anake, Nish and the friends they make along the way fend off twisted creatures, solve problems and unravel the mysteries of their weird world. <br/>It's an exploration-focused game, allowing you to travel to different places, all drastically different in both narrative and gameplay mechanics. Speaking of which, environmental interaction is big, and all characters can interact within the dungeons in different ways. </p>\r\nGameplay\r\n<p>As an exploration-based Dungeon Crawler, each character in Owl's Nest is befitted with an unique skillset both in battle and in the field. Using these skills to unlock secrets and items within the dungeons is a core part of the game's experience, as such the exploration of every corner of the world rewards the player with useful items, hints and pieces of lore that would be unobtainable in other ways. <br/>While Anake and Nish are always around for the adventure, they may take along a single additional guest, whose abilities may be key for acessing different locations they couldn't otherwise.</p>\n<p>We hope you enjoy both the battle and field mechanics!</p>\r\nStatus\r\n<p>The game is still in development, but there's already a demo ready for download!</p>", "metacritic": null, "released": "2018-05-14", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/6a0/6a0d3d3ce0ead7602b0f58147ec575cb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 80, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["rafaelzimrp"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}