{"id": 116655, "slug": "project-sandtree", "name": "Project sandtree", "name_original": "Project sandtree", "description": "<p>This game has been created for LD34: http://ludumdare.com/</p>\n<p>This game is about planting seeds in a deserted world. The world is barren and long forgotten, but you as a player have made it in there. You can grab seeds and plant them in the soil(plant them in the brown blocks) to grow the trees and to bring the world back to life.</p>\n<p>The controls for this game are as follows. The right mouse button is used to walk and the left button is used to move objects around in the world. The current movable objects are the white blocks at the start of the game and the seeds that can be found inside the structure; seeds also grow on trees.</p>\n<p>You can find three kind of seeds; one gives normal trees. The other two also have blocks growing on them. One has normal blocks and the other has jump blocks. Those two are movable with the left mouse button to access new areas in the game.<br/></p>\n<p>This game has a simple option menu it can be accessed by holding the \"q\" button. The options are as follows:</p>\n<p>* First slider: FieldOfView from 30 to 160 degrees;</p>\n<p>* Second slider: X mouse sensitivity;</p>\n<p>* Third slider: Y mouse sensitivity;</p>\n<p>* Checkbox: vSync;</p>\n<p>* First button: returns the player to the beginning (is used when you are stuck);</p>\n<p>* Second button: resets the level, thus it generates a new world;</p>\n<p>* Third button: exits the game;</p>\n\n<p>If you have any questions are have feedback on this game, than you can e-mail me at: rikhendriks@rocketmail.com</p>\n<p>Or you can find me on twitter: https://twitter.com/NotAGameCompany</p>", "metacritic": null, "released": "2015-12-14", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/a0a/a0ade94227f954399539a1b9b2d7ad74.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 38, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Rik Hendriks"], "genres": [], "publishers": [], "esrb_rating": null}