{"id": 116757, "slug": "tower-of-2-dimensions", "name": "Tower of 2 Dimensions", "name_original": "Tower of 2 Dimensions", "description": "<p>UNIVERSITY TEAM PROJECT<br/><br/>What is The Tower of Two Dimensions?</p>\n<p>-The Tower of Two Dimensions is a top down style dungeon game<br/>-The simplistic play-style lends itself to a large audience<br/>-A map creation tool is also available within the game<br/>-Different enemy types to challenge the player<br/><br/></p>\n<p>-Our game is focused primarily at the PC gaming community<br/> -People looking for a 3D dungeon crawler with random elements<br/> -The targeted age is 12+<br/><br/></p>\n<p>-The game was inspired by similar successful games, thought we gave ours a 3D  twist<br/> -Each adjacent room is spawned pseudo-randomly<br/> -The Room Creation Tool (RCT) allows users to build their own rooms with tiles<br/> -Assets for our game have been outsourced, though we have done some work to them<br/> -Our Game will be distributed for download on Itch.IO<br/><br/></p>\n<p>-Due to minimal artistic experience we switched to 3D assets and retained a 2D perspective. Downside of this was Unity’s palette Editor could not be used.<br/> -We also had to cut certain features out to ensure that our game was up to a good standard.<br/> -Features that have been cut out:<br/> <br/></p>\n<p>  - Roll / Dodge\r\n  </p>\n<p>  - Player spells\r\n  </p>\n<p>  - Items and armour\r\n  </p>\n<p>  - Puzzles\r\n  </p>\n<p>  - Skills\r\n  </p>\n<p>  - Scoring\r\n  </p>\n<p>-It would have been desirable to have had more time to have complete this module, with no other modules to distribute time to.<br/> -We could also have improved team management to some extent<br/><br/></p>\n<p>If we were to continue with the project, these would most likely be our course of actions;\r\n  </p>\n<p>-Implement features that we dropped to meet the deadline<br/> -Develop our own art style<br/> -Expand on current features to flesh the game out<br/> -Go over current game structure and optimise.<br/></p>", "metacritic": null, "released": "2018-04-30", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/cfd/cfd24b363d98e95a862e6ebe159038ae.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 96, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Musical-Phenix"], "genres": [], "publishers": [], "esrb_rating": null}