{"id": 116727, "slug": "pressure-run", "name": "Pressure Run", "name_original": "Pressure Run", "description": "Oh no! The factory caught on fire and it's your duty to help the workers reach the exit. But steam pipes and floor gaps threaten them on their way to safety, be sure to disarm those obstacles before the worker reaches the hazard. But beware: Holding a door platform or valve closed for too long will deplete your energy. \r\n\t<br/>\n<br/>\r\n\tHow many workers will you get to safety?\r\n<p>\r\n\tThis is a game made in 48hrs for the Ludum Dare #34 Compo adhering to the theme of \"Two-button controls\". After some fussing about I recalled how well those good old Game &amp; Watch handhelds from 30 years ago played with just two buttons. I always wanted to make one of those things anyway, so I took the chance to make it a reality this weekend.</p><p>\r\n\tThe game is a little challenging but once you got the hang of it it's quite fun. The trick is to hit and hold the platform/valve key before the worker reaches the obstacle. After the tick, you can release it. I've also made a little video if you just want to watch ;)\r\n</p>\r\nControls\r\n<ul><li>\r\n\t A and D. Hit either to start the game.\r\n</li><li>Esc to exit.\r\n</li></ul>\r\n\tNotes\r\n<ul><li>You can resize the window to your liking\r\n</li><li>5lives\r\n</li><li>The steam pipes activate after the first round after each miss</li><li>With each saved worker, the game gets faster\r\n</li><li>After a couple of saved workers, your energy energy bars increase\r\n</li><li>\r\n\t Also, the steam will get more intense the longer you play\r\n</li></ul>\r\n\tVideo\r\n<p>\n</p>", "metacritic": null, "released": "2015-12-14", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/1f9/1f974d0708f0851dfcdac72d21766929.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 12, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Pixel Prophecy"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}