{"id": 116709, "slug": "space-maze-itch", "name": "Space Maze (itch)", "name_original": "Space Maze (itch)", "description": "\"It's a place with high walls or hedges, where you wander around and get lost.\"\r\n<p>- Well, that would be your answer if someone ask you to play a maze game. In fact it's a lot more complicated than that. Have you ever travel to a strange city and get lost? or what is the shortest way to your favorite barber shop? Yes, every place around us is a Labyrinth, you won't recognize it because you are in its. Humanity has always enjoyed patterns.</p>\n<p>- Space Maze is a procedural 3D labyrinth. You get to navigate the way to higher level, collecting reward. There is no end level, so you can play until the game crash. Learn how to get out of the maze is one thing, Space Maze introduce to you a new mechanic that allow you to bet on every level you play. Use your money wisely or you will lose all of it. Also be careful with each movement in the maze, there are lots of obstacles trying to prevent you to reach the end. The maze is not design for impatient person, or you will learn it the hard way.<br/></p>\r\nDestination:\r\n<ul><li>Earn $1M to win special award in game.</li></ul>\r\nSpace Maze include:\r\n<ul><li> 3 Difference Map theme with story of its own.\r\n</li><li> 4 Drone to choose from but you must earn enough to unlock it.\r\n</li><li> Infinite level: play until your computer crash.\r\n</li><li> Money and risk management to advance to new level.</li><li>3 Difference game mode</li></ul>", "metacritic": null, "released": "2018-05-30", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/15f/15fc879474b54da6ad1dc19a77ffadc7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 304, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["HOH5HC"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}