{"id": 116817, "slug": "undercity-drop", "name": "Undercity Drop", "name_original": "Undercity Drop", "description": "<p><em>Undercity_Drop</em> is an endless action falling game where you are the hero without end, falling down into the Drop. Using your holy energy skin you throw yourself across the drop hoping to find any surface to recharge your ever depleting reserves. <br/></p><p>A motley selection of Undercity residents encircles this Drop. No railing or safeguards exists to prevent any person for a fall into heroism. The heroes who fall into the drop remain heroes forever in the history of the Undercity. The Drop has no end known, so each heroic journey is never ending.</p><p>The murmur of the crowd suggests the event that is about to take place. Word had spread of a willing hero, a person who would raise up the name of the Undercity and elevate it. The willing hero, the person whose name will soon be spoken in the suburbs above, steps forward. If the audience had not already known of the willing hero then the light crackle in the energy enriched air around their person is a sure sign. All eyes now face the willing.</p><p>The endless hero checks their energy skin one more time. It is known only friction from the walls of the Drop will charge it. The pressures of a world deeper than even the Undercity will be sap its resources through the endless quest. The Drop, not large across but infinitely deep is the future now. The hero takes one final look at the sprawl across and above, at the Undercity. Their home. Then taking a few more steps forward joins the great heroes on the endless quest, down into the Undercity Drop.</p><p><strong>Controls:</strong></p><p><strong>Left arrow</strong> - launch left</p><p><strong>Right arrow</strong> - launch right</p><p>Undercity Drop is the fourth Chalk In Jam, a prototype we completed during the 21st week of 2016 by Chalk In Rain. Unlike other Chalk in Jams to date, Undercity Drop was a prototype we were working on in 2015 for a couple of months. We decided to use one final week to see it completed and put out into the world</p><p>Chalk In Rain is:</p><ul><li>Emre Deniz - @Emre_C_Deniz</li><li>Gerard Delaney - @verbvirus</li></ul>", "metacritic": null, "released": "2016-05-31", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/d36/d361dacd69bb8cad5e1934909fd2e082.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 45, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Chalk In Rain"], "genres": ["Action"], "publishers": [], "esrb_rating": null}