{"id": 11683, "slug": "lemuria-lost-in-space", "name": "Lemuria: Lost in Space", "name_original": "Lemuria: Lost in Space", "description": "<strong>Lemuria: Lost in Space is a unique adventure, full of mysteries, puzzles and shocking discoveries. It's a combination of point 'n click adventure, RPG and survival game.</strong><br/><br/><ul><li><strong> Explore over 100 rooms</strong> of the spaceship, solve dozens of puzzles, find valuable resources and fight with security turrets and other enemies patrolling the ship;<br/></li><li><strong> Uncover the story</strong> of the lost crew of Lemuria 7. The ship has been missing for over 70 years - find out what exactly happened to them;<br/></li><li><strong> Acquire new skills</strong> allowing you to hack computer terminals or even the spaceship network to avoid fighting with patrolling robots;<br/></li><li><strong> Challenge yourself in demanding mini-games</strong> that will test your logical thinking and maths skills;<br/></li><li><strong> Feel the unique atmosphere</strong> of the abandoned spaceship with the original soundtrack, composed by Ree-D.<br/></li><li><strong> Play now</strong> - free demo available.</li></ul><br/><br/>The Lemuria 7 spaceship has been missing for over 70 years.<br/>Now it is back in the Solar System, however there are no crew members on it. It's also unclear how the Lemuria 7 has returned and why it has been seriously damaged.<br/><br/>In Lemuria: Lost in Space, you play as Abrix - the robot with AI that may operate in extreme temperatures, high levels of radiation and that yields weapon and hacking modules in order to explore the whole ship.<br/><br/><br/>Abrix has an ability to overrun security systems. The unique hacking mini-game will challenge your math, geographic and logical thinking skills. There is no time to check Wikipedia - every mistake costs you valuable resources!<br/><br/>Abrix has a special software that allows him to upgrade himself during the mission. You need to be very careful - if you run out of batteries or an anti-radiation cloak, the mission is aborted and the game is over.<br/><br/><br/>In order to explore over 100 rooms of the spaceship, you'll need to solve dozens of puzzles, find valuable resources for the robot and fight with security turrets and other enemies patrolling the ship.<br/><br/>Solving puzzles not only rewards you with priceless resources, but also uncovers the story of the lost crew of Lemuria 7. The level of challenge depends on difficulty - so choose wisely or you'll need to start from scratch.<br/><br/><strong>The game demo is available now!</strong>", "metacritic": null, "released": "2017-03-17", "tba": false, "updated": "2019-08-28T22:13:44", "background_image": "https://media.rawg.io/media/screenshots/6cb/6cbddcb5056c77afa3d390fa012560a3.jpg", "website": "http://ejr.com.pl", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 51}, "playtime": 5, "achievements_count": 23, "ratings_count": 1, "suggestions_count": 380, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["EJRGames"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["EJRGames"], "esrb_rating": null}