{"id": 11686, "slug": "postal-2", "name": "POSTAL 2", "name_original": "POSTAL 2", "description": "<p>Like original Postal, its sequel was specifically intended to spark controversy. The game is full of gross violence, black humor, obscenities, and biting satire of American life. The plot follows Postal Dude, a typical &quot;white trash&quot; and a small town trailer-park dweller, as he is given menial daily tasks, such as buying milk. The way he completes them, however, is what makes Postal 2 one of the most censored and offensive games ever. At the various points of the game, the player may piss over his opponents, use cats as gun silencers (by literally showing your gun up the cat&#39;s anus), burn dogs alive, blow up cars (but not drive them, in Postal 2 cars are simply four-wheeled explosives), shoot people and flip them a bird. The game, however, is just as violent as the player wants it to be. Most missions can be accomplished without killing, though it would have spoiled all the fun.<br />\nThe gameplay has changed since the previous part. Isometric view from the original was replaced with the first-person view. The world around Postal Dude is living by itself, regardless of the player’s presence, much like in Grand Theft Auto series. All the town inhabitants are programmed to walk, chat and even fight each other as if they were real people.</p>", "metacritic": 59, "released": "2003-04-13", "tba": false, "updated": "2024-04-21T07:23:14", "background_image": "https://media.rawg.io/media/games/2a2/2a2f9a0035544500e59a171c7038ec3a.jpg", "website": "http://www.runningwithscissors.com", "rating": 3.91, "rating_top": 4, "added_by_status": {"yet": 238, "owned": 4401, "beaten": 829, "toplay": 52, "dropped": 359, "playing": 25}, "playtime": 4, "achievements_count": 89, "ratings_count": 1019, "suggestions_count": 470, "game_series_count": 7, "reviews_count": 1027, "platforms": ["macOS", "PC", "Linux"], "developers": ["Running With Scissors"], "genres": ["Action", "Shooter", "Adventure", "Indie"], "publishers": ["Running With Scissors"], "esrb_rating": "Adults Only"}