{"id": 11685, "slug": "rogues-like-us", "name": "Rogues Like Us", "name_original": "Rogues Like Us", "description": "Dungeons are perilous and combat is fast-paced, forcing you to quickly react and adapt to whatever stands in your way. To help you fight, various weapons are scattered around the dungeons. These weapons can have powerful enchantments on them to help you on your way.<br/><br/>There are many mysteries to be uncovered about the world of Rogues Like Us, centering around the Hub, a rough and rugged city built atop the ruins of an ancient civilization.<br/><ul><li>FIGHT THROUGH PROCEDURALLY GENERATED DUNGEONSFight your way through an endless number of unique dungeons! Dungeons are created through a combination of hand-crafted design and procedural generation, providing a unique experience on each play-through.<br/></li><li>FIND YOUR COMBAT STYLEAll combat stats, such as speed, damage, slam damage, etc. are weapon specific. Giving each weapon that you find and use a unique feel and combat style.<br/></li><li>DISCOVER SECRETSExplore to find the secrets hidden within the dungeon. Learn about these wild lands and their connection to you and your home.<br/></li><li>EMPOWERED WEAPONSA vast number of enchantments can be found that give weapons unique effects. These effects vary from simple damage boosts to run changing passives like burning enemies with every slam attack.<br/></li><li>ANCIENT SHRINESMysterious and powerful shrines are scattered throughout the dungeons. Each one is different and \"most\" are there to help you on your way. <br/></li><li>EXPAND YOUR ARSENALNew weapons, armor, enchantments and more can be found in loot chests throughout the dungeons. Loot found in chests are kept safe at your base.<br/></li><li>BE ROGUISHLY HANDSOMEFully customize your look using armor and dyes you find throughout the dungeon.</li></ul>", "metacritic": null, "released": "2017-02-10", "tba": false, "updated": "2019-08-28T22:13:44", "background_image": "https://media.rawg.io/media/screenshots/ff4/ff464a91020080b95a5a9ce6e522f04b.jpg", "website": "http://www.oddbytegames.com/games/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 13, "dropped": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 312, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "macOS"], "developers": ["oddByte"], "genres": ["Action", "Indie"], "publishers": ["oddByte"], "esrb_rating": null}