{"id": 116800, "slug": "the-gobfather", "name": "The Gobfather", "name_original": "The Gobfather", "description": "<p>Are you ready for some extreme pun-ishment? Well then try out team VDs newest game The Gobfather. This game has everything you could ever want out of a top-down bullet HELL, such as Orcs to kill, bad puns and so... many... pizzas...</p>\n<p>Witness a collective of bad ideas such as an unhealthy obsession with pizza, puns and pills.</p>\n<p>The VD bar is one of the most unique features of the game, a mechanic wherein you have to work fast to keep your Vitamin D levels high for the best chance for premium loot!</p>\n<p>But if think popping a few pills is the only interesting thing in this game you would be mistaken, there is plenty to keep the mind occupied from table flipping for when the meal just wasn't good enough and it makes you mad to a Boss battle where he won't wait for you to come to him, he will surf the pizza all the way to you! And with the maps being procedurally generated you will have a new experience every time.</p>\n<p>Playing this game is like drinking a fine wine filled with interesting flavours but you might not know what colour it should be by the end. One of our games interesting 'flavours' is the unique aesthetic to the cell shaded art helping it to look crisp and sweet. Another 'flavour' would be the replayability that the weapons and other collectables provide giving a nice fruity twist, with the final few drops of the bottle providing a dash of competitiveness though the scoring system.</p>\n<p>Think your hard-core enough to take on the Orc Mafia? Only the pun-iest people have made it to the end and survived.</p>\n<p>---------------------------------------------------------------------------------------<br/></p>\n<p>Team VD:</p>\n<p>Art: Viktoria Nestorova, Samuel Tamblyn, Dominic Marriott</p>\n<p>Design: Jamie Crewdson, Benjamin Brackett</p>\n<p>Animation: Emma Glass</p>\n<p>Audio: Chris Delaney</p>\n<p>Writer: Lottie Anderson-Reed</p>\n<p>Programmers: Phil Sparkes, Nathan-David Coplestone</p>\n<p>---------------------------------------------------------------------------------------<br/></p>\n<p>Find us on social media: <br/></p>\n<p>Facebook</p>\n<p>Instagram</p>", "metacritic": null, "released": "2018-04-27", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/10c/10c6303a4c614ff868451926750af935.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 127, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Sparky439", "Nathan-David"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}