{"id": 116842, "slug": "a-pair-of-kings", "name": "A Pair of Kings", "name_original": "A Pair of Kings", "description": "<p><em>In the days of yore, when the Old Gods still walked among man...<br/></em>_____________________________________</p>\n<p>Long ago, the country of Tayz was divided into three regions: the western Elmme, the eastern Pyne, and the central Oakke. The king of the land, Udom the Wise, made a pact with the Leuce, Queen of all Witches. In exchange for the protection of her kind, his children would co-rule with magical consultants at their side. These consultants were Leuce's own daughters: Lydia, Maria, and Naomi. </p>\n<p>Udom lived long enough to see his two eldest sons, Louis and Edwin, take the thrones of Elmme and Pyne. Peace reigned, as Naomi watched over the duchy of Oakke until the birth of Udom's third child. Sadly, a tragic accident took the lives of the Queen Regnant and the unborn baby, a tiny girl. The pact unfinished, Leuce washed her hands of the matter and told her daughters to do as they saw fit. </p>\n<p>Both brothers agreed to divide the land equally, but soon came to qualms about what \"equal\" truly meant. Each sister sided with the kingdom she represented, with the youngest caught in the middle between the two. Now, it is up to Naomi to be the peacemaker. Easy in theory, but dangerous in reality: every choice could lead to either peaceful resolution, war, or even intervention of the Gods! <br/>_____________________________________</p>\n\n\n\n<p>_____________________________________<br/></p>\n<ul><li>Multiple endings: save the country, or destroy humanity? </li><li>Multiple pairings: who gets married? Or is there any love at all?</li><li>Open World: go where you want, see what you find... just be careful! </li></ul>\n<p>_____________________________________</p>\n<p>Coming Soon: </p>\n<ul><li>Full Open World</li><li>Full Romance Options</li><li>Full Ending Options</li><li>Class System</li><li>Magic System</li></ul>", "metacritic": null, "released": "2017-11-06", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/f3b/f3b2b1cfa3cd6f83317b001bddef4963.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 29, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Juju"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}