{"id": 116885, "slug": "super-power-frenzy", "name": "Super Power Frenzy", "name_original": "Super Power Frenzy", "description": "<p>An arcade style shooter with realistic physics and vast hordes of enemies! Made for Ludum Dare 39 as a jam entry. </p>\n<p>Quick gameplay run-down:</p>\n<p>The game is quite hard at first, but very rewarding if you last long enough. You can use the gravity from the planets (the boundary is marked with dotted lines) to recharge your ship. Pick up the pink boxes to increase max power and gain full power instantly, pick up the blue boxes to change to a random new weapon, but be careful, some weapons consume a lot of power (especially the super heavy auto shotgun), so use them wisely and make sure your max power is high enough! Also, you will eventually be overwhelmed and run out of power, just sayin'.<br/>\n</p>\n<p>Features:<br/>- Various guns<br/>- Hordes of enemies attacking from all sides<br/>- Explosive effects<br/>- Realistic gravity and movement<br/>- Lots and lots of death<br/>- Full XBox One / 360 controller support</p>\n<p>PS:<br/>I highly recommend a controller for this one!</p>\n<p>Controls:</p>\n<p>Mouse and Keyboard:<br/>Fire - Left Mouse Button or Space<br/>Throttle - W and S or Arrow Keys<br/>Look - Mouse</p>\n<p>XBox One Controller:<br/>Fire - Right Bumper (RB) or A Button<br/>Throttle - Right Trigger (RT) and Left Trigger (LT)<br/>Look - Right or Left Stick</p>\n<p>#LDJAM #LD39</p>", "metacritic": null, "released": "2017-08-01", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/c2e/c2ee82fec6bafc457366e5055c09278f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 49, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Alexander Thomas Haselton"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}