{"id": 116919, "slug": "robocycle", "name": "RoboCycle", "name_original": "RoboCycle", "description": "<p>RoboCycle was created for PotAuJeu Game Jam organise by At0mium's, which had the theme \"Make something new with old\"</p>\n<p>For this theme, I had a lot of differents ideas but I did not want something too advanced in the development to be able to create myself all the 3D meshes ...</p><p>So you will play a little robot whose role is to clean the city from pollution created by humans.</p>\n<p>For that you will have to recycle all the green objects.</p>\n<p>But be careful you have to manage your energy meter, to reduce its consumption you will have to recycle blue objects as well as to unlock capacities by recycling red objects ...</p>\n<p>The game is primarily intended to be relaxing and do not have a dynamic gameplay the goal being to convey a message to the player \"We have only one planet, with limited resources it is necessary to preserve and to monitor our consumption \".</p>\n<p>I realized solo this Game Jam using Unreal Engine 4 and Blender.<br/>All the development and modeling was done by me.</p>\n<p>Only music because it's something I do not mastery, the freesong author is credited in the game ...</p>\n<p>Small precision before you test the game, there are small problems with the object grab that I did not have time to perfect. However if you try to different position around the object this should work very quickly.</p>\n<p>Thank you for take the time to test my game and thanks to At0nium the creator of the Game Jam</p>", "metacritic": null, "released": "2018-07-22", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/ba4/ba4d0fa41189acab6effee463c80c5ce.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 59, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Tasaka"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}