{"id": 116998, "slug": "lorentz-factor", "name": "Lorentz Factor", "name_original": "Lorentz Factor", "description": "<p><strong>My entry of #fermijam</strong></p><p>Our ability as a species to explore the universe is severely limited in many ways: lifespan, energy availability, political will, etc.  Ultimately most of our limitations can be overcome, but the one limit we can never overcome is that of the speed of light.</p><p>Lorentz Factor gives you the opportunity to explore the universe with only that limitation, to visit other stars, find alien life, and discover distant civilizations with entirely different ways of communicating.</p><p>So go forth and explore!</p><p><strong>CONTROLS:</strong></p><ul><li>Place your mouse in the direction you want to move and hold LEFT MOUSE or SPACE to accelerate.</li><li>Hold LSHIFT or RIGHT MOUSE to accelerate faster</li><li>MOUSE WHEEL to zoom in and out</li></ul><p><strong>The Relatometer</strong><br/></p><p>Travelling at relativistic speeds requires some specialized instruments, which is where the relatometer finds its purpose.  </p><p>On the left and right are clocks that measure time in Years, Decades, Millenia, and Millions of Years.  The Left clock is your local time, and the Right clock is the time at your home star.</p><p>In the middle is a dial that shows your velocity relative to the center of the galaxy as a percentage of c, and below that is a meter that shows the Lorentz Factor, which determines Time Dilation and Length Contraction.</p><p>At the bottom is a small screen to display incoming messages from alien civilizations (or maybe just space noise)</p>", "metacritic": null, "released": "2016-09-12", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/5d1/5d19c1a0025001f42ce39a4d43ab601e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 24, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["DeltaDaedalus"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}