{"id": 116924, "slug": "ghost-knight-victis-agdg-demo-day-17", "name": "Ghost Knight Victis - AGDG Demo Day 17", "name_original": "Ghost Knight Victis - AGDG Demo Day 17", "description": "<p>Ghost Knight Victis is an action RPG about a terminally-ill superhero fighting against an invasion of Lovecraftian horrors.<br/></p>\n<p>The catch is that his health deteriorates every time he uses his powers. As the player, you need to ensure the main character stays alive until the end of the year, when the final boss appears.<br/></p>\n<p>Inspired by the <em>henshin</em> hero genre (Karas, Kamen Rider, Garo, etc.), you play as a guy whose terminal disease awakens dormant powers, letting him transform into magical armors and fight monsters.<br/></p>\n<p>You'll also need to maintain your secret identity to prevent endangering your friends. But standing with you are individuals who are in the same predicament.</p>\n<p><strong>This is only the combat protoype for now. </strong><strong>Please try it out and leave feedback!</strong></p>\n<p>Changes (since last AGDG Demo Day release):</p>\n<p>The main highlights in this release are the <strong>Spear Impale</strong> attack, and the <strong>Impaler's Sanctuary </strong>spell. Details below:</p>\n<ol><li>Added <strong>Spear Impale</strong> attack (hold the Spear attack button, then release when it fires up). Impaled enemies will break free once their stamina is full. Hitting them too much will break the impaling spear and free them sooner.</li><li>Added test implementation of first spell in the game: \"<strong>Impaler's Sanctuary</strong>\". It will create a spear wall around you in a circular formation to shield yourself from attacks, or cage anything inside (do a phase dash to leave the cage). This spell is cast by pressing either Up on the D-Pad for controllers, or 1 on the keyboard. <strong>You need to be holding the spear to do this.</strong> If you are not, attack with the spear, then <em>cancel</em> it into Impaler's Sanctuary.<br/>Note: Right now, <strong>spells do not cost anything</strong>, but they will have some form of cost in the future. So for now, you can go ahead and put dozens of spear walls like crazy until your framerate suffers.</li><li>Warhammer attack control binding is now moved to <strong>Middle Mouse Button</strong>, since the previous <strong>Simultaneous Left + Right Mouse Button</strong> was problematic; it would sometimes trigger Spear or Rapier attack instead, because you had to press Left + Right Mouse Buttons at the <em>exact </em>time, which was not convenient. Enemy targeting is moved to the back/forward buttons on the mouse (or you can still use old keybard binding for it, F). Meanwhile, gamepad controls for these are unchanged. Take note that in the future, the options screen will let you customize controls.</li><li>Player character now properly tracks targeted enemies vertically (when attacking). This means your character will now lean up or down if the enemy is above or below you. This should fix the problem with your attacks not connecting even if you are in range just because the enemy was in a sort of crouching position.</li></ol>\n<p>Notes:</p>\n<ol><li>Gamepad is recommended! But keyboard and mouse works too.</li><li>There are no optimizations yet. There are toggles for the graphical effects, but they are there more for your personal preference. If you're running the game on a toaster, consider yourself warned. Try running the game in a low resolution (800x600 if need be).</li><li>There's nothing much to do yet except kill the enemies. This is only a test for the combat part.</li><li>There are no unique combo strings. Attacks in this game work more similar to Dark Souls, and not God of War.</li><li>I know the impression right now is that there are not a lot of attacks. There will be more variety of attacks you can perform in future versions of the game, as I implement more features (more spells, a 2nd armor type with its own set of weapons).</li><li>As some of you have mentioned, you can hit enemies through fences/obstacles. You are not supposed to be able to do this, but I haven't fixed it yet.</li><li>Some of you suggested keyboard controls for switching/cycling through targets. I like that idea, but I have not implemented it yet.</li><li>Some people do not understand how the stamina bar works. In the future I may add a simple tutorial to explain this.</li><li>You will die quickly if you allow yourself to be surrounded. This is intentional.</li><li>Can't customize control bindings yet, but it will be added.</li><li>There are no sounds yet.</li><li>The difficulty right now is not yet representative of the final goal. Attack animation speeds, enemy AI, damage values, and stamina costs are continually subject to tweaks/balancing.</li></ol>\n<p>Follow latest updates on my dev blog: http://hypertensiongamedev.tumblr.com/</p>", "metacritic": null, "released": "2017-11-03", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/103/103e60023a68c5efb980e3107ea1be31.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 226, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Anomalous Underdog"], "genres": ["Action"], "publishers": [], "esrb_rating": null}