{"id": 117018, "slug": "mil-ocho-diecitantos", "name": "Mil ocho diecitantos", "name_original": "Mil ocho diecitantos", "description": "English\r\n<p>\n<em>Mil ocho diecitantos</em> is six minigames about the history of Argentina made for Museos Mutantes, a gathering of a wide range of artists that took place in the National Historical Museum of Argentina on November 26 of 2016.</p>\n<p>They're short and silly and a little historically inaccurate, but we had fun making them and people had fun playing them. The subject of each game, from left to right as they are placed in the menu, is:<br/></p>\n<ol>\n<li>The 1806 and 1807 British invasions of the River Plate.</li>\n<li>The distribution of Argentine cockades during the 1810 May Revolution.</li>\n<li>Mariano Moreno's Gazeta de Buenos Ayres published since June of 1810.</li>\n<li>The Jujuy Exodus in 1812.</li>\n<li>The Battle of San Lorenzo in 1813.<br/>\n</li>\n<li>The Crossing of the Andes in 1817.</li>\n<li>(There's a bonus game about President Fernando de la Rúa's helicopter escape in 2001.)</li>\n</ol>\n<p>The game was drawn by Mer Grazzini, sound designed by Fede Cardinale and put together in Construct 2 by me, David T. Marchand.</p>\n<p>Most songs in the game are Argentine patriotic songs, two are originally made for the game, and two are The Wolfe Tones' Admiral William Brown and León Gieco's  El ángel de la bicicleta.<br/></p>\r\nCastellano\r\n<p>\n<em>Mil ocho diecitantos</em> es seis minijuegos sobre la historia argentina hechos para Museos Mutantes, una reunión de una amplia gama de artistas que se organizó en el Museo Histórico Nacional argentino el 26 de noviembre de 2016.</p>\n<p>Son cortos y ridículos y un poco históricamente incorrectos, pero nos divertimos haciéndolos y la gente se divirtió jugándolos. El tema de cada juego, de izquierda a derecha como están ubicados en el menú, es:<br/></p>\n<ol>\n<li>Las invasiones inglesas al Río de la Plata de 1806 y 1807.</li>\n<li>La repartija de escarapelas por los chisperos durante la Revolución de Mayo en 1810.</li>\n<li>La Gazeta de Buenos Ayres de Mariano Moreno publicada desde junio de 1810.</li>\n<li>El Éxodo Jujeño en 1812.</li>\n<li>La Batalla de San Lorenzo en 1813.</li>\n<li>El Cruce de los Andes en 1817.</li>\n<li>(Hay un juego bonus sobre el escape en helicóptero del presidente Fernando de la Rúa en 2001.)</li>\n</ol>\n<p>El juego está ilustrado por Mer Grazzini, musicalizado por Fede Cardinale y armado en Construct 2 por mí, David T. Marchand.</p>\n<p>La mayoría de las canciones en el juego son canciones patrias argentinas, dos son originales del juego, y dos son Admiral William Brown de The Wolfe Tones y El ángel de la bicicleta de León Gieco.</p>", "metacritic": null, "released": "2016-10-10", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/9d5/9d5be40bb0ee0cf00bb44e12eb8a6fee.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 185, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["David T. Marchand", "Mer Grazzini"], "genres": ["Action"], "publishers": [], "esrb_rating": null}