{"id": 117008, "slug": "air-bogus-airport-check-in-simulation-rpg", "name": "Air Bogus: Airport Check-In Simulation RPG", "name_original": "Air Bogus: Airport Check-In Simulation RPG", "description": "<p>AIR BOGUS is a \"Airport Simulation RPG\" game. Combining the gameplay of Airport check-in simulation and story telling that of a RPG game.</p><p>Working as a airport check-in attendant is not easy. Rude passengers, favors, stress from co-workers and managers. You have to follow promo's in certain flights, handle luggage and special requests. </p><p>Your future depends on your performance AND your relationship with your co-workers and boss. Depending on your acts with co-workers, it will determine how you end your training year at Air Bogus.</p><p><strong>Characters</strong><br/><br/>Player - As the newest member of the airport check-in team, you learn the ropes and execute the check-in process. Be sure to always give excellent customer service at all cost.</p><p>Lili - Air Bogus Manager and your team leader. Lili demands highly of her subordinates, highly talented and valued by the company, Lili expects the best in her team.<br/><br/>Boss Wang - Founder and CEO of Air Bogus. Always watch your language when you are talking to him.</p><p><strong>Gameplay</strong><br/><br/>1) As a check-in attendant, you will be asked to check the passports of the passengers, and verify their identity.<br/>2) Give them the proper seat, and meal.<br/>3) Charge excess luggage.<br/>4) Check if there is something illegal in the luggage.<br/>5) Execute special flight promotions.<br/>6) Co-workers will ask for \"favors,\" depending on your actions, it will affect the ending of the game.<br/></p>Trailer Here", "metacritic": null, "released": "2016-08-23", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/de2/de201b33e0ec3b18c6a5b62e268f6c99.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 90, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["itoken"], "genres": ["RPG", "Simulation"], "publishers": [], "esrb_rating": null}