{"id": 117098, "slug": "dosminer", "name": "Dosminer", "name_original": "Dosminer", "description": "<p><strong>This is the world of Dosminer!</strong></p><p>Dosminer is a game, where you have to escape from a virtual world. You have to kill enemys to get items.</p><p>Dosminer is in the alpha phase and it is still in development and not done yet. But you can have a lot of fun with the game. You can play it with your friend to battle him, or to battle to other enemys. Actually, you can't escape from the world, yet. But you can kill enemys. You can hide under a tree. You can watch the time go. Explore the features of Dosminer by yourself!</p><p>Take a view on our homepages every day, if you want to see how Dosminer grows and gets bigger. Contact us, if you have any ideas for the game, or if you found a bug. Feel free to contact us, if you have questions.</p><p><strong>Features</strong><br/> 1. Graphical User Interface (GUI)<br/> 2. Random World Generator<br/> 3. 3 different Mobs<br/> 4. A few different Items<br/> 5. RPG fight style<br/> 6. Diffrent types of attacks<br/> 7. Animations<br/> 8. Day/Night<br/> 8.1 Diffrent Mobs at day/night</p><p> 9. Pause Mode<br/> 10. Nice Soundtracks<br/> 11. Level System<br/> 11.1 including xp etc<br/> 12. Eastereggs<br/> 13. Stamina System<br/> 14. Mana System<br/> 15. Autosave<br/> 16. Magic attack<br/> 17. Better Skill system</p><p>If you want more details, check out our blog. We explain a few things about the gameplay there.<br/></p>", "metacritic": null, "released": "2015-01-10", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/2af/2af6954704ceaa8c23ae2895b4f9dea5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 26, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["FRED games"], "genres": ["Adventure", "Fighting"], "publishers": [], "esrb_rating": null}