{"id": 11707, "slug": "buck", "name": "BUCK", "name_original": "BUCK", "description": "BUCK is a story-driven, 2D Action-Adventure game set in a post-apocalyptic wasteland. <br/>You play as Buck, a motorcycle garage mechanic who decides to leave everything he knows behind in order to find the truth behind a girl's disappearance; all while struggling to adjust himself to a world he doesn't fully understand.<br/>Traverse the wasteland while fighting and talking your way through junkyards, mountain passes, ghost towns and survivor outposts while trying to piece together the reasons that brought this world and its rugged inhabitants to their knees.<br/><br/><br/> <br/>Trained by his stepdad to fight, shoot and fix nearly anything, Buck can surprise the biggest of brutes by his speed and strength.<br/><br/><ul><li> Traverse the sands of Venganza: a carefully built 2D world with hidden passages, dark secrets and remorseless characters.<br/><br/></li><li> Destroy enemies with Buck's own hand crafted, upgradeable weapons.<br/><br/></li><li> Unlock new weapons and combos as you progress.<br/><br/></li><li> Explore unique levels with branching paths and hidden areas.<br/><br/></li><li> Earn Scraps and loot unique items to upgrade your arsenal, craft ammunition and improve healing items.<br/><br/></li><li> Negotiate with the salty denizens of Westown, wayward merchants and mysterious mercenaries, each with their own goal and agenda.<br/></li></ul><br/><br/>*BUCK is an Early Access title and shouldn't be considered a finished product. The game may or may not change significantly over the course of development. To learn more about Steam Early Access, please visit http://store.steampowered.com/earlyaccessfaq/", "metacritic": null, "released": "2017-03-17", "tba": false, "updated": "2019-08-28T22:13:43", "background_image": "https://media.rawg.io/media/screenshots/2cd/2cd3473e98d6734dc8dfc295b8e28013.jpg", "website": "http://www.buck-game.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 7, "toplay": 2}, "playtime": 2, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 503, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Wave Interactive"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["Wave Interactive"], "esrb_rating": null}