{"id": 117010, "slug": "2984-little-brothers", "name": "2984 Little Brothers", "name_original": "2984 Little Brothers", "description": "<p>\n<br/>\n</p>\n<p>\n<strong>[Goal of the game]<br/>\n</strong>\n</p>\n<p>\r\n\t- Vote for the world you live in.\r\n</p>\n<p>\r\n\t- Vote to make Utopia.\r\n</p>\n<p>\n<strong>[Key features]</strong>\n</p>\n<p>\r\n\t- Depending on your choice, the world changes every moment.\r\n</p>\n<p>\n<strong>[Story]</strong>\n</p>\n<p>\n</p>\n<p>\r\n\tThis is the story of a thousand years after George Orwell's &lt;1984&gt;. Since a long time ago, humans have repeatedly made and destroyed many of their civilizations against to social inequality, though the structure that 'being ruled and ruling others' as slaves and masters, and as workers and capitalists, has never disappeared.\r\n\t<br/>\n</p>\n<p>\r\n\tThere were continuous conflicts between people dissatisfied with the structure and people want to maintain it, and bleeding wars have continued over a long period.\r\n</p>\n<p>\r\n\tFinally, some who wanted to escape from this chaos tried to move out to other stars far away from Earth, and a plant called 'Utopia' accepted to accommodate them as refugees. The Utopia Unions already consists of the many races like the Doves, the Mantises, and minority races, and humans became a new race named themselves as 'Little brothers'.\r\n</p>\n<p>\n<br/>\n</p>\n<p>\n<strong>[Tribes of Utopia]</strong>\n</p>\n<p>\r\n\t- There are many races(tribes) in utopia, all of whom participate in direct democracy.\r\n\t<br/>\n</p>\n<p>\n</p>\n<p>\n<br/>\n</p>\n<p>\n<strong>[Broadcast Station]</strong>\n</p>\n<p>\r\n\t-There are 9 TV channels in room.\r\n</p>\n<p>\n</p>\n<p>\n<br/>\n</p>\n<p>\n<strong>[Multiple endings]</strong>\n</p>\n<p>\r\n\t-This game has multiple endings depending on your decision. Try it.<br/>\n</p>\n\n<p>\n<br/>\n</p>\n<p>\n<strong>[Behind Story]</strong>\n</p>\n<p>\n1. A memory of <old earth=\"\">\n</old></p>\n<p>\r\n\tHumans desired to be free from labor with their strong believe in liberty and equality, and they expected that robots would replace their suffering from labor. With their slogan 'Convenience, Fast, and complete liberation', they poured their all resources to produce robots. With improvement in robot technology, all their resources in Earth have exhausted and Earth suffered from severe contamination all over the world.\r\n</p>\n<p>\r\n\tThough, 'Robot revolution', the commercialization of human-level robots, caused many jobs of humans replaced by robots, and humans were forced to work harder in severe brain works called creation. Some are dominated by human-made robots and some are even used as Bio-energy, and this irony made humans to be doubt for their worth of existence, and they began to protest against to robot technology saying \"Robot revolution will deprive human's dignity!\"\r\n</p>\n<p>\r\n\tVarious United Nations were made to stop this chaos, the situation has worsened as they struggled only to seize power rather than solve common problems. Eventually, all the growing complaints leaded wars between robots and between capitals, so people have no option but to escape from Earth in out of control.\r\n</p>\n<p>\n<br/>\n</p>\n<p>\r\n\t2. History of <utopia>\n</utopia></p>\n<p>\r\n\tA long time ago, each race in utopia maintained a comparable numbers. They don't need to communicate with each other till there was an attack from alien outside as the resources were so abundant. This attack made them to cooperate against to the emergency, but it was so hard to make consensus as they have same level of power and no one want to lose. Therefore they had to choose 'Majority'.\r\n</p>\n<p>\r\n\tAfter the successful defense, the utopian union emerged because of the necessity of the union. The Utopian Union expanded its area not only in defense but to resource, territory and diplomacy. They selected their representative at first, though their cultural and genetic difference made it difficult to select one. Finally they adopted private voting machine. The Doves took advantage of their shortest reproductive cycle by co-parenting, and this made them to be the leading race and it has collapsed the balance in the Utopian Union gradually.\r\n</p>\n<p>\n<br/>\n</p>\n<p>\n<strong>[Meaning of 2984]</strong>\n</p>\n<p>\r\n\t - This game is aiming at the real world we live in at fictional times and places.\r\n</p>\n<p>\r\n\t - It deals with the political issues, such as growth &amp; distribution, race, economy, education\r\n\t.\r\n</p>\n<p>\r\n\t - It raises a question about media and democracy.\r\n\t<br/>\n</p>\n<p>\n<strong>[Team Credit]</strong></p>\n<p>\n</p>\n<p>Yongjoo Yoo / Producer, Graphic designer</p>\n<p>Ga-young, An / Artist</p>\n<p>Jaemin Park / Programmer</p>\n<p>Deokwon Kim / Programmer</p>\n<p>-</p>\n<p>Myung-jin, Yang / (in GAMEJAM) Team Leader<br/></p>\n<p>\n</p>\n<p>\n<br/>\n</p>\n<p>\n<br/>\n</p>", "metacritic": null, "released": "2017-01-22", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/5b7/5b786488db7e73451a75a5312bdf1131.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 207, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["littlebrother"], "genres": [], "publishers": [], "esrb_rating": null}