{"id": 117176, "slug": "agora", "name": "AGORA", "name_original": "AGORA", "description": "<strong>Rainbow Game Jam 16 entry - Team Chiminey</strong><br/>\n<p>\r\n\tOur Identity is an amalgam of elements that come from many different sources. The people, places, objects and experiences that create what we know as our world influence what we call \"ourselves\". In turn, we create the world around us through the lenses of our identity.\r\n</p><p>\n<br/>\n</p><p>\n</p><p>\n<br/>\n</p><p>\r\n\t\tYou play as you. Talk with the people around you to make your identity, represented by different shapes that make up your face: your eyes, your nose, your mouth.\r\n</p><p>\r\n\t\tEach shape has one of four colours, and each colour makes a different sound. To talk to another person, recreate the same sound patterns that they have in their face.\r\n</p><p>\r\n\t\tIf a person has a blue eye, a green nose and red lips, talk to them by making a blue sound, then a green one, and finally a red one.\r\n</p><p>\r\n\t\tAs you talk with different people the world will become larger and more complex, filling itself with color, objects and with your own experience. Each face, each world, and each experience is different in their own small way.\r\n</p><p>\n<br/>\n</p><p>\n<strong>Controller</strong>\n</p><ul>\n<li>Move your character with the Left Analog Stick</li>\n<li>Move the camera around you with the Right Analog Stick</li>\n</ul><p>The ABXY buttons each correspond to one of the shape in your face, use them to make a sound that matches with another character<br/></p><ul>\n<li>LEFT EYE: X</li>\n<li>NOSE: Y</li>\n<li>RIGHT EYE: B</li>\n<li>MOUTH: A</li>\n</ul><p>\n<strong>Mouse and Keypad</strong>\n</p><ul>\n<li>Move your character with the WASD keys</li>\n<li>Move the camera around you with the Mouse</li>\n</ul><p>\r\n\tThe Directional Arrows each correspond to one of the shape in your face, use them to make a sound that matches with another character<br/>\n</p><ul>\n<li>LEFT EYE: Left Arrow</li>\n<li>NOSE: Up Arrow</li>\n<li>RIGHT EYE: Right Arrow</li>\n<li>MOUTH: Down Arrow</li>\n</ul><p><strong>Press SELECT or R to restart the game</strong><br/></p><p>\n<br/>\n</p><p>\n<br/>\n</p><p>\r\n\tTeam Chiminey is a four person team. We all live in France, although not all of us come from there.\r\n</p><p>\n<strong>Antonio de Miguel Conde</strong><br/>\r\n\t2D/3D Artist\r\n\t<br/>\r\n\tArt Direction\r\n\t<br/>\n<em>really fond of dogs</em>\n</p><p>\n<strong>Anthony Sirac</strong><br/>\r\n\tProgrammer\r\n\t<br/>\r\n\t3D Artist\r\n\t<br/>\n<em>was into skate in high school</em>\n</p><p>\n<strong>Laurine Vire</strong><br/>\r\n\t3D Artist\r\n\t<br/>\r\n\tAnimator\r\n\t<br/>\n<em>has a 20 year old cat</em>\n</p><p>\n<strong>Jonathan Maugard</strong><br/>\r\n\tProgrammer\r\n\t<br/>\r\n\t3D Artist\r\n\t<br/>\n<em>worked at Disneyland for two summers</em>\n</p><p>\n<br/>\r\n\tAll 3D and 2D assets, as well as all the code in the game, was done by us. However, some of the animations were done using an mixamo.com base and then modifying it, we also did not make the sound effects (provided by Freesound.org and Universal Sound Bank), or the music (provided by Sirius Beat - The Cosmos\r\n\t), or the air we breathed, the fleeting days of our youth that we dedicated to this project, and the diet coke we ingested. We are not sure by whom those were provided by.\r\n</p><p>\r\n\tThis game was made for the Rainbow Game Jam 16, and we decided to spice it up with a funky \r\n\t<strong>Theme Diversifier</strong>:\r\n</p><ul>\n<li><strong>\"It is time... For you to lipsync... For your LIFE\"</strong><br/>\r\n\tYou game must feature audio as an input in some way.\r\n\t</li>\n</ul><p>\n<br/>\n</p><p>\r\n\tHope you like it!\r\n</p><p>\r\n\tTeam Chiminey\r\n</p>", "metacritic": null, "released": "2016-09-04", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/4ec/4ec303f0a9825d4b3f7a11da31bb6c7e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 9, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["ademiguelconde"], "genres": [], "publishers": [], "esrb_rating": null}