{"id": 11717, "slug": "jet-island", "name": "Jet Island", "name_original": "Jet Island", "description": "Jet Island is a giant land mass, floating in space. Nearly 16 km across, stone structures and ruins are scattered across this ancient land. Scientists are baffled as to why a long forgotten alien race created this place. However, for those who have made the journey to this world, one thing is clear... Jet Island is the sickest skate park the galaxy has ever seen.<br/><br/><strong>Gear</strong><br/><ul><li>Hoverboard - When riding on your hoverboard, you will slide on any surface- down hills, across terrain, off gnarly jumps. With skill and determination, it's possible to build momentum to up most extreme speeds.<br/><br/></li><li>Hand Jets - By placing high-thrust boosters directly on the hands, the user will have the highest precision control over acceleration. Traditional jet packs are bulky and hard to control. Hand Jets are designed to be used with a hoverboard to gain high speeds across all types of terrain.<br/><br/></li><li>Hook Shots - These are your most versatile tool. Quickly changing direction, wrapping around an obstacle- grab onto any ledge to recover from a fall, or simply enjoy the act of swinging and wrapping around obstacles like a human tether ball.<br/><br/></li><li>Wrist Mounted Holomap - The world of Jet Island is vast, it can be easy to get lost. By a click of a button, a holographic display of this land will appear directly in the user's hand for great reference as the exploration begins.</li></ul><br/><strong>Jet Island's Physics System</strong><br/>Jet Island is being developed in Unity with a completely custom physics system. Thanks to this system, it's very difficult to glitch through walls, even when moving at extreme speeds. The game does collision checks on the player's real body no matter where one is standing in the play space. All the movements in this game are based on Newton's Laws of Motion. Basic physical behaviors are applied to the game in replication of real life movement.<br/><br/><strong>Objective</strong><br/>Seek out Jet Island in search of new power ups, upgrades, and tools. Explore this world as far as the eye can see. Once mastering the way of the jet, rise to the challenge of reaching the highest point this game has to offer, Sky Mountain.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T22:13:43", "background_image": "https://media.rawg.io/media/screenshots/4ca/4ca7cbe3e88d13dffc0f54820ebe46d9.jpg", "website": "http://www.masterindie.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 56, "beaten": 1, "toplay": 1, "dropped": 1}, "playtime": 2, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 218, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Master Indie"], "genres": ["Adventure", "Simulation", "Sports", "Racing", "Casual"], "publishers": ["Master Indie"], "esrb_rating": null}