{"id": 1172, "slug": "growtopia", "name": "Growtopia", "name_original": "Growtopia", "description": "<p>Welcome to Growtopia, the world’s most creative sandbox! This is a 2D platformer MMO where everyone is a hero! Jump into a multiverse of unlimited pixel worlds – astonishing opportunities to Build, Punch, Break, and Grow await! Create mind-bending block masterpieces with friends and fill them with anything your heart desires!<br />\nThere are no rules, no limits for your fun – just countless worlds where you create whatever you want... with whomever you like!<br />\nBUILD literally anything – castles, dungeons, skyscrapers, artwork, puzzles - even your favorite movie scenes!<br />\nJOIN OUR ENORMOUS COMMUNITY - millions of players are waiting for you!<br />\nPLAY THOUSANDS OF MINI GAMES from parkour and races to PVP battles and ghost hunting!<br />\nUNIQUE crafting process! PLANT seeds, SPLICE seeds, GROW trees - find your own way to create rare items!<br />\nMONTHLY UPDATES! We do our best to entertain you with exciting monthly updates involving new items and events!<br />\nEXPLORE countless unique worlds - you can enter any of them!<br />\nCROSS PLATFORM! Play anywhere – on any of your mobile devices or using the desktop client, - the progress is shared!<br />\nBE AWARE! This is an online game about collecting items – make sure to keep them safe<br />\n<strong> Note: This is a freemium game that has optional In-App Purchases! </strong><br />\nNote: In-App Purchase, Chat, and Tapjoy Offer Wall options can be disabled in a Personal Controls area in the Options menu.<br />\nDidn&#39;t get your gems or having a problem? Check out our support FAQ at www.growtopiagame.com/faq !</p>", "metacritic": null, "released": "2013-01-11", "tba": false, "updated": "2024-04-07T23:29:16", "background_image": "https://media.rawg.io/media/games/028/028d3637cb10dae9bc79eeea2e776d74.jpg", "website": "http://growtopiagame.com", "rating": 2.12, "rating_top": 1, "added_by_status": {"yet": 3, "owned": 101, "toplay": 2, "dropped": 9, "playing": 1}, "playtime": 0, "achievements_count": 48, "ratings_count": 17, "suggestions_count": 347, "game_series_count": 0, "reviews_count": 17, "platforms": ["PC", "iOS", "Android", "PlayStation 4", "Nintendo Switch"], "developers": ["Ubisoft", "Ubisoft Abu Dhabi"], "genres": ["Action", "Adventure", "Strategy", "Simulation", "Casual", "Massively Multiplayer"], "publishers": ["Ubisoft Entertainment"], "esrb_rating": null}