{"id": 117258, "slug": "jello-expando", "name": "Jello Expando", "name_original": "Jello Expando", "description": "<p>\r\n\tPlay on Twitch<br/>\n</p><p>\r\n\tThis game is played exclusively via twitch chat (flows better with a group of people than playing solo). Follow the link to participate. #PROCJAM was the perfect opportunity for putting together a small experiment to test out some functionality for games like this, especially since I have another bigger project in the works. Let me know what you think! \r\n\t@davidblosser\r\n</p><p>\r\n\tThe room layout for each level, although small, is procedurally generated.\r\n</p><p>\r\n\tCommands:\r\n\t<br/>\n<strong>!start</strong> (to join the game)<br/>\n<strong>!move:1</strong> (move to room, in this case, room 1)<br/>\n<strong>!move:p2</strong> (move to platform, in this case, platform p2)<br/>\n<strong>!get</strong> (get an item from the room you're currently in)<br/>\n<strong>Kappa</strong> (use twitch emotes to see them above your character in game)\r\n</p><p>\r\n\tThe objective is to search for items to feed the Jelly Monster until he bursts. Grab items and move to one of the platforms to feed him. It requires teamwork to make sure that the feeding is balanced. If he gets too close to one side, he'll throw up and freeze you in place, then he won't eat anything else until you supply him with the item he wants from a specifiic side. Scores are added up at the end to determine who was the Jelly Monster's best friend!\r\n\t\r\n</p><p>\r\n\tWarning: There is about a 12-15 second delay from when you input your commands to when you'll see your action happening on stream. Anticipate what your character is doing for the best results!\r\n</p><p>\r\n\tMade by:\r\n\t<br/>\r\n\tDavid Blosser\r\n\t<br/>\r\n\tPamela Vargas</p><p><strong>Update (11/18/2016):</strong></p><ul><li>Fixed the bug where a player's score would go negative.</li><li>Made it so that the camera will swap between active players only (players become inactive after not inputting commands for 1 min).</li></ul><strong>Update (11/16/2016):</strong><ul><li>Fixed the flaw where a solo player would be stuck in the sludge until someone else came along to save them. Now, if no one else is playing or active, they'll lose their score and be released after 10 seconds.</li><li>Fixed the scoring bug that made players scores increase indefinitely.</li><li>Fixed the issue where players would turn white after being freed from the sludge. And now they start with random colors if they don't have a profile image :)</li></ul>", "metacritic": null, "released": "2016-11-14", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/e1b/e1bd6becedc2b00a7bbee5eaccd067a7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 73, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["David Blosser", "aaahMonsters"], "genres": ["Action"], "publishers": [], "esrb_rating": null}