{"id": 11721, "slug": "ohsir-the-hollywood-roast", "name": "Oh...Sir! The Hollywood Roast", "name_original": "Oh...Sir! The Hollywood Roast", "description": "<p>The boys &amp; girls are back, and they look better than ever! Oh…Sir! The Hollywood roast is a brand new spinoff to the surprise indie hit 0f 2016, Oh…Sir!! The Insult Simulator. This time around we’re taking tinsel town down a few notches, whilst classing up the joint. Play as one of many famous, but for legal purposes, slightly different pop culture icons and verbally spar with other Hollywood elitists using a deep battle system<br />\nVerbally joust by yourself or take you verbal skills on a global PR tour and battle friends and family from anywhere in the world.Game Features<br />\nUnleash the sickest burns on your opponents in a Hollywood-style roast<br />\nPlay alone, online or couch multiplayer<br />\nDeeper-than-you-think mechanics featuring combos, continuations and exploiting your rival’s weak spots<br />\nA star-studded new cast of crazy Hollywood characters<br />\nFree updates with new characters and scenes coming soon to a screen in your house<br />\nSet the scene with a slew of iconic film backdrops<br />\nWith the new Character Creation Mode powered by Steam Whatever, you can create your own formulaic celebrity clones in a lab-- just like they do in real Hollywood!<br />\nNew controller integration that critics everywhere are calling “gripping”<br />\nWith more than 2x the vocabulary of the original Oh...Sir!! The Insult Simulator, The Hollywood Roast is Bigger, ruder and insultier!<br />\nNew comeback mechanic: charge your anger and finish the sentence with a unique closure<br />\nExpanded career mode: master each scene to win Golden Parrots and use them to develop your character<br />\nRedesigned scoring system: more fair, more clear.</p>", "metacritic": 42, "released": "2017-05-31", "tba": false, "updated": "2021-06-22T19:29:41", "background_image": "https://media.rawg.io/media/screenshots/02a/02a4ca91deb1f9b9482257bb582f82c0.jpg", "website": "http://vilemonarch.com/", "rating": 3.04, "rating_top": 3, "added_by_status": {"yet": 18, "owned": 272, "beaten": 7, "toplay": 4, "dropped": 13}, "playtime": 2, "achievements_count": 82, "ratings_count": 24, "suggestions_count": 202, "game_series_count": 1, "reviews_count": 24, "platforms": ["Nintendo Switch", "Xbox One", "iOS", "PC", "macOS", "PlayStation 4", "Android"], "developers": ["Good Shepherd Entertainment", "Vile Monarch", "Artur \"ekhart\" Dębkowski"], "genres": ["Adventure", "Simulation", "Indie"], "publishers": ["Good Shepherd Entertainment", "Gambitious Digital Entertainment", "Gambitious"], "esrb_rating": null}