{"id": 117208, "slug": "viridescent-dragon-chapter-2", "name": "Viridescent Dragon: Chapter 2", "name_original": "Viridescent Dragon: Chapter 2", "description": "<p><strong><em>**EDIT** This game is now available as a .Zip file for those who would like to download it through the itch desktop app or if you don't use WinRAR.**</em></strong><br/></p>\n<p><strong>**EDIT 2** I also attempted to fix any problems that were present in the previous version.***</strong><br/></p>\n<p>If you haven't yet, please check out Chapter 1 here.</p>\n<p>This is the second of my very first Visual Novel series, Viridescent Dragon.</p>\n<p><em>(As this is a kinetic visual novel, it is straight-forward and you could just auto-play it like a movie if you'd like. I am considering adding choices in any future chapters/stand-alone novels.)</em><br/></p>\n<p>After meeting with Doctor Adam Cendrillon, Charlotte and Seleste head off to do a task to retrieve a rare plant with magical healing properties with a mysterious new ally: Dawn Ngo. With the Violean Royal Guard on their tails, how will they fare in the face of even more threats? Aye, the sea is a very dangerous place...</p>\n<p>This is the second of many humorous and drama-filled chapters to come. As a warning this game at the most has some foul language, a bit of blood, mild sexual themes and crude humor.</p>\n<p>Press the \"A\" key to Auto play the text.</p>\n<p>This game is in 1920 x 1080 resolution, in window mode and full screen mode.</p>\n<p>Again, this is Windows only.</p>\n<p>Also, be careful, as the game can crash when you close it, as Novelty, the program I used to create this game, is still in its Beta stages. Be sure to save often, just in case. This is the main reason I place this game under \"Unstable\"</p>\n<p><strong>Credits</strong></p>\n<p>Original Story and Character Art by me, Kassidie Butler (Viridea) 2015-2016</p>\n<p><strong>Music</strong> by Audionautix and AngelHeights</p>\n<p><strong>SFX</strong> by Freesound.org<br/></p>\n<p><strong>Backgrounds</strong> from Pixabay</p>\n<p><strong>Backgrounds edited</strong> with FotoSketcher</p>\n<p>and Adobe Photoshop CC 2015<br/></p>\n<p>Thank you very much, and I hope you enjoy the game!</p>", "metacritic": null, "released": "2016-01-22", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/4e8/4e8db852ac05f6722fd634ea668de6ec.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 158, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Viridea Productions"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}