{"id": 11732, "slug": "super-duper-party-pooper", "name": "Super Duper Party Pooper", "name_original": "Super Duper Party Pooper", "description": "Have you ever wanted to poop on party goers but were too socially awkward to just go for it? Well, Super Duper Party Pooper is about to change all that. In this follow up to the smash hit There’s Poop In My Soup by Rudder Games the player will find themselves in the middle of a raw human story of existential panic.<br/><br/><br/><br/>Visit exotic locations, travel from beijing to paris, from the polar ice caps to desert islands Sample the local delicacies, let them pile up inside until you couldn’t possibly take anymore, then, turn around, take aim, and drop a deuce or two on the party crowd. <br/><br/><br/><br/>Super Duper Party Pooper is a rhythm based party pooping simulator that has the player chomping down as much food as possible to the beat of the music. The more food you eat, the more poops you create, much like real life. The player then unleashes those poops onto the party crowd trying to rack up as many points as possible, allowing them to unlock new locations and bonus features. <br/><br/><br/><br/>But the fun doesn’t stop there, Players can add their own music to the game and poop to the beat of their favorite tunes, you can pinch a loaf to the beat of beyonce’s new hit single, drop a deuce to michael jackson's thriller or drop the kids off at the pool while listening to Adele’s relationship problems, the poosibilities are endless. The game also features Steam Workshop integration and the characters are completely customizable allowing the community to edit or create new characters, animations, pooping styles and more. <br/><br/>There are parties out there just begging to get pooped on, what are you waiting for?", "metacritic": 40, "released": "2016-06-06", "tba": false, "updated": "2023-07-15T06:57:50", "background_image": "https://media.rawg.io/media/screenshots/c6a/c6ad8dc2893b749fa42b197ac5e4b25d.jpg", "website": "http://www.kbrosinc.com", "rating": 0.0, "rating_top": 1, "added_by_status": {"yet": 6, "owned": 266, "beaten": 3, "toplay": 1, "dropped": 1}, "playtime": 5, "achievements_count": 26, "ratings_count": 5, "suggestions_count": 218, "game_series_count": 0, "reviews_count": 5, "platforms": ["macOS", "PC"], "developers": ["K Bros Games"], "genres": ["Strategy", "Simulation", "Casual", "Indie"], "publishers": ["K Bros Games"], "esrb_rating": null}