{"id": 11736, "slug": "wolfquest", "name": "WolfQuest", "name_original": "WolfQuest", "description": "<p>LIVE THE LIFE OF A WILD WOLF!WHAT IS IT?A wildlife simulation game about wolf ecology.EMBARK ON A QUEST FOR SURVIVAL!When the game begins, you are a two-year-old gray wolf born in the Northern Range of Yellowstone National Park. You learned the ways of the wolf in your birth pack. Now it&#39;s time for you to learn how to live on your own.Your quest begins on the slopes of Amethyst Mountain and eventually takes you across the Lamar Valley to Slough Creek. There, you and your mate will establish a territory and raise a litter of pups: training them, feeding them, defending them against predators, and finally taking them on a cross-country journey to a summer home. Ultimately, your success will depend on your ability to ensure the survival of your pack.PLAY ALONE OR WITH FRIENDS!!In single-player games, learn how to hunt elk, communicate with other wolves, find a mate, establish a den and territory, raise pups, and embark on a perilous journey to a summering site.<br />\nIn multiplayer games, explore the wilderness and hunt elk together, and now raise pups together! This new version features the entire Slough Creek mission arc, from choosing a den to raising pups and traveling to the rendezvous site. There are two types of multiplayer games:<br />\nPrivate games: Invite-only, featuring voice, text, and phrase chat.<br />\nPublic games: Anyone can join, phrase chat or (for players age 13 and up) text chat.WHAT&#39;S NEW?This new version improves and expands upon the original game, a grant-funded project that has been downloaded by over five million players around the world since its original release in 2008. Now, for this version 2.7, we&#39;ve refined gameplay and graphics, added a new player account system with achievements, friends lists, and more, and completely rewrote the animal AI system. We&#39;ve also added more wolf howls, over two dozen wolf customizations, and emotes -- accurate wolf behaviors to communicate with your packmates. And we created a mysterious new map to explore in single and multiplayer games. As always, there&#39;s also an active online community where you can discuss the game with other players and share artwork and stories about wolves.  Visit www.wolfquest.org to join in.<br />\nMORE NEW STUFF! We&#39;ve added cougars, moose, foxes, ravens, and a plethora of bird and insect life to the game, along with much richer and varied vegetation.NEW EPISODE IN DEVELOPMENT!We&#39;re making the long-awaited new episode, in which your pups continue to grow and eventually learn how to hunt! New map, new missions, and new multiplayer modes.  Read about it here.</p>\n<p>Is this new version worth buying? Find out what players say.</p>", "metacritic": null, "released": "2016-03-25", "tba": false, "updated": "2024-01-02T00:18:34", "background_image": "https://media.rawg.io/media/screenshots/a0c/a0c20a267d2f59fc9605749aba381f25.jpg", "website": "http://www.wolfquest.org", "rating": 3.71, "rating_top": 5, "added_by_status": {"yet": 2, "owned": 31, "beaten": 4, "toplay": 3, "dropped": 4, "playing": 1}, "playtime": 4, "achievements_count": 110, "ratings_count": 7, "suggestions_count": 331, "game_series_count": 0, "reviews_count": 7, "platforms": ["PC", "macOS"], "developers": ["eduweb"], "genres": ["RPG", "Simulation"], "publishers": ["eduweb"], "esrb_rating": null}