{"id": 11731, "slug": "albert-and-otto", "name": "Albert and Otto", "name_original": "Albert and Otto", "description": "Clues as to who she is and what happened to her are scattered throughout the game in the form of drawings left in post boxes and shards that the player must piece together.<br/><br/><br/><br/>However the player is not alone on this adventure, help comes in the form of the girl’s magical bunny, Otto.<br/><br/>The player must use both Albert and Otto in creative ways to traverse a haunting world. At the beginning of the story, Albert can shoot and jump, while Otto can fit through tight gaps and hold down power switches. But together, they unlock new skills such as a double jump, levitation, control of electrical currents, and more as the story unfolds.<br/><strong>Features</strong><br/><ul><li>Unique mechanic utilizing a little bunny which the player can carry around or leave and/or remotely control in order to solve puzzles<br/></li><li>A story that is inspired by dark events buried in our history and isn't spoon fed to the player but spans across 3 episodes and is told through a child's drawings and clues scattered throughout the game that force the player to think outside the box.<br/></li><li>Levitate sheep, use them as platforms to swim on, a torch to light a dark cave or as a distraction for wolves while you make a quick escape. (if your stomach can handle it)<br/></li><li>2.5 - 3 hours of unique puzzles that utilize a bunny, levitation, electrical switches, wolves, piranhas and more. <br/></li><li>Experience a mix of slow paced thought provoking puzzle design and fast unforgiving gauntlet sections.<br/></li><li>Come face to face with intimidating larger than life mechanical monsters and outsmart them.</li></ul>", "metacritic": 69, "released": "2015-10-28", "tba": false, "updated": "2023-03-28T16:39:14", "background_image": "https://media.rawg.io/media/screenshots/e13/e13e55fb183c484cf547c0afd6c5d413.jpg", "website": "http://www.kbrosinc.com", "rating": 3.2, "rating_top": 4, "added_by_status": {"yet": 16, "owned": 245, "beaten": 9, "toplay": 6, "dropped": 3}, "playtime": 5, "achievements_count": 24, "ratings_count": 14, "suggestions_count": 231, "game_series_count": 0, "reviews_count": 15, "platforms": ["PlayStation 4", "Xbox One", "iOS", "Android", "PC", "macOS"], "developers": ["Digerati Distribution", "K Bros Games", "K Bros Entertainment", "Mokuni"], "genres": ["Adventure", "Indie", "Puzzle"], "publishers": ["K Bros Games", "K Bros Entertainment"], "esrb_rating": null}