{"id": 117462, "slug": "fish-eat-fish-world", "name": "Fish Eat Fish World", "name_original": "Fish Eat Fish World", "description": "<p><strong>It's a fish eat fish world out there...</strong></p>\n<p><strong>...so you better eat or<em> be eaten.</em></strong></p>\n<p>Eat fish smaller than you to grow, and rise to the top of the food chain while avoiding obstacles and those who might eat you in this underwater action game. Complete with three challenging game modes, an endless mode just for fun.</p>\n<p>Other features include:</p>\n<ul><li>Animated sea creatures, with bubble trails and unique skeletons.</li><li>An upbeat nautical melody and chomping sound effects for when you eat fish.</li><li>High score and pause button.</li></ul>\n<p>The four game modes are as follows:</p>\n<ul><li><strong>Classic</strong>: play as a little red fish in a fish eat fish world. Eat small fish to score points and grow, while avoiding puffer fish and any fish larger than you; both will kill you instantly.</li><li><strong>Challenge</strong>: once you get the hang of classic, we introduce jellyfish and marine mines to avoid. Be careful!</li><li><strong>Puffer</strong>: play as a shark and eat puffer fish to score points and grow. They're edible while deflated, but will kill you when puffed up, so keep an eye out!</li><li><strong>Endless</strong>: play as a shark with the ability to eat everything, and without any way of dying, and <em>relax</em>. You will score points in this mode, but you won't grow.</li></ul>\n<p>Each mode has a 'how to play' page you can access by pressing the \"?\" icon next to each mode in the menu.</p>\n<p>Control your player by clicking and holding to make it swim in that direction. A short click will make the fish move just a little, and a longer hold will move it farther and faster. </p>\n<p>At any point, you can press \"C\" to change the controls and make the fish follow your mouse cursor at a constant rate, with no clicking or holding needed. This is a little unwieldy and a bit more difficult, and is included mostly for players who find pressing and holding the mouse button to be uncomfortable and painful after a few minutes.</p>\n<p>Press \"M\" to pause the music, and \"N\" to turn off the noises that play when you eat a fish. Pressing their respective keys will turn them back on, and can be done at any time.</p>\n<p>The escape key will take you back to the menu at any time, and the spacebar will pause your game.</p>\n<p>Feel free to e-mail <strong>mxcaseydanger@gmail.com </strong>at any time with bug reports, as well as any feedback, suggestions, or requests.</p>\n<p>---------------------------------------------------------------------------------------------------</p>\n<p><strong>The full game is being provided to you for free!</strong> There is a suggested donation of $10, and while you are not <em>required</em> to pay, we would definitely appreciate your support. If you're enjoying it, consider leaving a tip. Every bit helps! </p>\n<p><strong>If everyone who downloaded and enjoyed this game paid $1, or even $0.50, it would add up fast and help us to cover the cost of development. </strong>We definitely appreciate those who <strong>share</strong> the game on social media as well.</p>\n<p>Thanks for playing, and enjoy! </p>\n<p>&lt;3 Casey</p>\n<p>---------------------------------------------------------------------------------------------------</p>\n<p><strong>Note about the future of this game:</strong></p>\n<p>This game is <em>mostly</em> finished. It's fully featured, bug-free, and playable, but we had to put development on hold due to how much time and money it was taking to make. There's a lot more we wanted to do with it, but this was originally planned to be a small, short project, and exceeded our scope very quickly.</p>\n<p>If we do work on this game again, we may add in:</p>\n<ul><li>An options menu, with ways to control the volume or change controls.</li><li>A leaderboard, where players can compete and show off their high scores.</li><li>Animations for the marine mine, (we wanted it to explode and play a sound.)</li><li>Sound effects for when the player dies or is eaten.</li><li>Additional game modes.</li><li>Additional fish colors and designs.</li><li>Power ups that fall from above, and can be grabbed and activated by the player before it hits the ground.</li><li>Different backgrounds.</li><li>And much more!</li></ul>\n<p>We simply cannot afford to continue working on this game, since we are giving it away for free and it's already taken a few months. It was originally planned to take a week or two and have just one game mode and limited features. We went as far as we could, and way farther than we should have.</p>\n<p>If this is one of your favorite games and you are dying for an update, an <strong>email</strong> is a good way to get our attention and share your ideas, and a <strong>donation</strong> is a good way to show that this game has people who still enjoy it and help us afford to take breaks from paid work in order to add onto a free game.</p>\n<p>---------------------------------------------------------------------------------------------------</p>\n<p>Special thanks to Zapsplat for some of the chomping sound effects used!<br/></p>", "metacritic": null, "released": "2018-07-24", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/cbc/cbca4dd2034231aeaf5c7045a362903a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 78, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ca5ey"], "genres": ["Action"], "publishers": [], "esrb_rating": null}