{"id": 117430, "slug": "rocket-xeno", "name": "Rocket Xeno", "name_original": "Rocket Xeno", "description": "<p>Rocket Xeno is a mobile action game with controls that don't suck.</p>\n<p>Google play publication has been accepted! Those of you who skipped the android version before can now enjoy the easier installer by simply searching \"Rocket Xeno\" in the google play store. Note that even though the game is published this is still only initial release so I am open to suggestions for later revisions.<br/></p>\n<p>https://play.google.com/store/apps/details?id=com.companyname.Rocket_xeno<br/></p>\n<p> The gameplay is space action \"shmup\" with a twist: instead of controlling a character to dodge attacks, all enemy fire is destructible and can be intercepted by your rockets. Any enemies or attacks that  reach the bottom of the screen will damage you. Think a fusion of missile command and 2hu like games. The game was specifically designed to give a fun arcade game feel that actually feels comfortable in the hands of touch screen controls, something I felt many mobile games are lacking. <br/></p>\n\n\n<p>CHANGELOG: Beta 0.3 -&gt; v 1.0<br/></p>\n<p>I took a break from editing this game in public due to real life money issues, but in truth I have been working on it whenever I could get freetime. So good news! The game is actually now in a near complete state with only minor issues.   I plan to release this on Google play as soon as I receive enough feedback on the finished title. <br/></p>\n<p>MAJOR CHANGES:</p>\n<p>-Removed windows version because it's pointless.<br/></p>\n<p>-Ammo system changed to limiting number of active rockets at once. This turned out to be one of those \"small changes\" that actually changed the feel of gameplay a lot ( for the better )</p>\n<p>-Powerup system simplified due to Ammo system rework</p>\n<p>-All levels of the game are now complete.  Roughly three news bosses and 5 new enemy types have also been added in the new levels. <br/></p>\n<p>-The game now saves your personal best score, visible after death or completing the game. <br/></p>\n<p>-Artwork improvements</p>\n<p>-Pause system now grants access to game options ( So you can toggle music off whenever, etc ).<br/></p>\n<p>KNOWN ISSUES:</p>\n<p>-Tutorial system is hilariously outdated. This will be fixed before the Android release on Google Play.</p>\n<p>-Beating the game doesn't have a story yet. This will also be fixed for final release.<br/></p>\n<p>-Final boss is a jerk<br/></p>\n<p>A</p>", "metacritic": null, "released": "2016-07-10", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/61b/61b28f2b301a73fe9b40df7349d0b207.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 170, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Randallized"], "genres": ["Action"], "publishers": [], "esrb_rating": null}