{"id": 11752, "slug": "city-life-2008", "name": "City Life 2008", "name_original": "City Life 2008", "description": "<p>Construct the city of the 21st Century with City Life!<br />\nCity Life 2008 Edition is a next-generation City Builder. Its 3D game engine provides a level of detail and animation unprecedented in the City Builder genre, with total freedom of construction. From superb villas in residential neighbourhoods to imposing skyscrapers in the financial district, design, construct and develop the city of your dreams. Provide comfort and satisfaction for your citizens by offering them work, health care, entertainment facilities, and much more, and ensure that your city’s coffers are brimming. It’s up to you to manage your city efficiently, balancing booming development with the problems of pollution and traffic that this brings. Build a sense of community between the six unique subcultures, or pay the price if their relationships deteriorate into conflict or riots. You are the architect, mayor and business mogul!<br />\n2008 Edition<br />\nCity Life 2008 Edition contains all the content of the previous versions, adding a further 23 new maps and over 60 new buildings, including landmarks such as London’s Royal Opera House and St. Paul’s Cathedral. Over 360 buildings are at your disposal in this latest version. You now have the possibility to import satellite maps, heightmaps, and other user-generated terrain into the game. Use your imagination to create ever more spectacular towns, or recreate the exceptional cities of the real world!<br />\nFeatures<br />\nGigantic city building simulation with high performance 3D engine.<br />\nExplore 50 maps in five different environments.<br />\n360° camera rotation and zooming allows you to dive into the heart of your city and observe its inhabitants.<br />\nSix unique subcultures with specific expectations and needs.<br />\nPlay in Scenario or Free Mode.<br />\nNew import tool for satellite maps and heightmaps.<br />\nA powerful building creation tool based on a modular system. No technical skills required, only your imagination.</p>", "metacritic": 66, "released": "2007-11-01", "tba": false, "updated": "2022-07-10T19:09:42", "background_image": "https://media.rawg.io/media/games/862/86272bd863466c19680114e60b13c3e6.jpg", "website": "", "rating": 3.64, "rating_top": 4, "added_by_status": {"yet": 2, "owned": 87, "beaten": 8, "toplay": 2, "dropped": 6}, "playtime": 1, "achievements_count": 0, "ratings_count": 11, "suggestions_count": 457, "game_series_count": 0, "reviews_count": 11, "platforms": ["PC"], "developers": ["Monte Cristo"], "genres": ["Strategy", "Simulation"], "publishers": ["Focus Home Interactive", "Monte Cristo"], "esrb_rating": null}