{"id": 117673, "slug": "warrab-veteran", "name": "WarRab: Veteran", "name_original": "WarRab: Veteran", "description": "<p>\n<br/>\n</p><p>\n</p><p>\r\n\tBefore there was Chadrick, Tredun or even Wit-Bacun... There was the WarRab\r\n</p><p>\r\n\tWarRab: Veteran is a 2D, Fantasy RPG containing real-time strategy and platforming elements. You take on the role of Flappy, a young sailor who is fighting to save his kind from being hunted by the ruthless Howler Warriors. Through this very raw and original story, you travel the developing world of Andoran meeting new friends, foes and choice-driven fates. The music and artwork, completely composed and designed by Chadrick Evans, merges together to express the perfect blend of emotional empathy. Diving into new areas will fill you with a sense of curiosity as the soundtrack builds up and attracts your attention.\r\n</p><p>\r\n\tThe Final Fantasy inspired real-time battle system is present in this game. The time it takes to attack is much faster and transitions have also improved. The best part about the new battle system is that a dodge feature has been added to give the player a better chance of survival.\r\n</p><p>\n</p><p>\r\n\t-Colorful, vibrant world full of appealing dialogue.\r\n</p><p>\r\n\t-Character \"Keepsake\" feature to hold skill boosting items.\r\n</p><p>\r\n\t-Up to four party members with a unique set of skills.\r\n</p><p>\r\n\t-Intense real-time strategy battles inspired by classic RPG titles.\r\n</p><p>\r\n\t-Beautifully composed soundtrack to evoke emotion within every scene.\r\n</p><p>\n<br/>\n</p><p>\n</p><p>\r\n\tYou can download the demo version of the game below!\r\n</p>", "metacritic": null, "released": "2015-01-18", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/20c/20c6eed19615c2bce46ab020a19ceb4b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 42, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["One Man Army Games"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}