{"id": 11764, "slug": "the-kindred", "name": "The Kindred", "name_original": "The Kindred", "description": "<strong>Welcome to the The Kindred - a creative sandbox game set in a vibrant voxel world.</strong><br/><br/>Start with the bare essentials and lead the Kin’s upstart civilization to peace and prosperity.  Explore new lands, discover resources, grow plants and raise animals to grow your village. Survive through the harsh winters, devastating diseases, sweltering heat, and myriad other challenges posed by an unforgiving procedural world. <br/><br/>Build, craft and farm your way towards civilization as you help the Kin to survive and thrive.<br/><br/><strong>Current Features</strong><br/><br/><ul><li><strong>The Industrial Evolution:</strong> Power your village with wind turbines and design an efficient electrical network.<br/></li><li><strong>Hunter Gatherer:</strong> Hunt and herd animals into paddocks to supply your people with meat, eggs and milk.<br/></li><li><strong>Breed &amp; Feed:</strong> Manage farms with crops, breed and care for your animals and balance production to keep your Kin fed.</li></ul><br/><strong>Development Roadmap</strong><br/><br/><ul><li><strong>The Circle of Life:</strong> Create the ideal environment for families to form and flourish - a complete lifecycle.<br/></li><li><strong>The Modern Trade:</strong> Modern tool upgrades for experienced craftsmen, including chainsaws, jackhammers, and nail guns.<br/></li><li><strong>Climate &amp; Seasons:</strong> Construct heaters and air conditioning units to combat the effects of hypothermia and heat exhaustion.<br/></li><li><strong>Unique Biomes:</strong> An ever-expanding world, with woodlands, desert, alpine and more to come.<br/></li><li><strong>Energy: </strong>Power your cities with solar panels, coal power plants and other ways both green and dangerous.<br/></li><li><strong>Health and diseases:</strong> Craft medicines to heal sickness like influenza or food poisoning.<br/></li><li><strong>Hydration and Water: </strong>One of the most basic needs of life.<br/></li><li><strong>Predator and Prey:</strong> Protect your livestock from foxes, and encounter dangerous beasts.</li></ul><br/><strong>The Kindred is available on Windows, Mac and Linux.</strong>", "metacritic": null, "released": "2016-02-24", "tba": false, "updated": "2019-08-28T22:13:41", "background_image": "https://media.rawg.io/media/screenshots/ea9/ea9726447066313de46643e1474f313e.jpg", "website": "http://thekindred.net/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 14, "dropped": 1}, "playtime": 5, "achievements_count": 11, "ratings_count": 1, "suggestions_count": 368, "game_series_count": 0, "reviews_count": 1, "platforms": ["macOS", "PC", "Linux"], "developers": ["Persistent Studios"], "genres": ["Strategy", "Simulation", "Indie"], "publishers": ["Nkidu Games"], "esrb_rating": null}