{"id": 117651, "slug": "frostle", "name": "Frostle", "name_original": "Frostle", "description": "<p>There is a PC and an Android version of this game.<br/></p>\n<p>Frostle is a 2D Pixel Art Android Video Game about a blue water frost bubble surviving in a world full of danger. No help, just you, Frostle and the desire to live.</p>\n\n<p><em>Gameplay</em><br/></p>\n<p>Using one finger, or more if the game demand it, the objective is to \r\nfinish with all the enemies on the field and defeat the final boss in \r\nevery stage whith the abilities obtained during the journey. The Demo \r\nonly includes one boss, but further there will be at least 5, all of \r\nthem with diferent abilities and challenging movements.</p>\n\n<p><em>Controllers</em> <br/></p>\n<p>\r\nAs an Android game, the gameplay has to be related to the controller, \r\nand to do it as simple and intuitive as posible, it´s only needed one \r\ntouch at a time to play the game.\r\nWith one touch on the screen you wil make Frostle to move till he reach that exact point.\r\nBy touching another point of the screen, Frostle will chage his path in order tu reach the new position.\r\nRandomly on screen will appear little pieces of ice. Frostle need to \r\ncollect them as soon as he can. This way, once he gets the little ice \r\nand stop moving, he freezes and can´t move in a while, but by this time \r\nhe can throw a snow ball to any point in the map as long as he keeps \r\nfreezed.\r\nThis way he can encounter all enemies in the game.</p>\n\n<p><em>Abilities</em> <br/></p>\n<p>There will be five abilities, a big Ice Falling from sky that will make \r\ndamage in the collision area, a ice wall that stop the enemies from \r\nmoving to you, a barrier that give you invulnerabilty during a time, a \r\nbig snow ball that crosses all the enemies in his way damaging them and a\r\n Blue Hole that atracts all the enemies to a specific point. The \r\nabilities will be available on the Full Game.</p>\n\n<p><em>Collectables</em> <br/></p>\n<p>Along the stages you will gather little snowflakes before they melt down\r\n and disappear and with them you will be able to upgrade your abilities,\r\n unlock new enemies that will appear randomly and defy you and also get \r\nnew wearable customizables objects if they are unlocked. This feature \r\nwill be available on the Full Game.</p>\n\n<p><em>Score</em> <br/></p>\n<p>There is a Score in the game wich also count, specialy if you are a \r\ncompetitive player. You recieve more puntuation by finishing multiple \r\nenemies with one Freezed. And by getting a higer score you can unlock \r\nnew wearable customizables objects. This last feature will be available \r\non  the Full Game.</p>", "metacritic": null, "released": "2017-08-20", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/d5d/d5d31785cc1c50df16a2bad5ebd58132.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 29, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Android"], "developers": ["Gazbriel"], "genres": ["Action"], "publishers": [], "esrb_rating": null}