{"id": 117642, "slug": "drink-beer-neglect-family", "name": "Drink Beer, Neglect Family", "name_original": "Drink Beer, Neglect Family", "description": "<p>ALSO AVAILABLE ON ANDROID:<br/>https://play.google.com/store/apps/details?id=com.suhail.dbnf</p><p>---</p><p>A small note for people who have played the original:<br/></p><p>Hi! I wanted to port Drink Beer, Neglect Family to Android. I rewrote the game from scratch, and decided to draw new graphics/animations and to redesign several elements of the gameplay (some of the effects, for example, are different, and there is a boss of sorts).</p><p>It felt a bit like \"Drink Beer, Neglect Family 2\", so I decided to port the new DBNF to flash. I hope you enjoy it! :)</p><p>---</p><p>GAME DESCRIPTION:</p><p>You are a depressed father who spends most of his time drinking beer and avoiding his family. How long can you avoid them, and at what cost?<br/>Every beer you drink increases your score, and applies a different effect. Some beers make you unable to jump, some make you fall off of bridges, some make you throw up every few seconds, and so on.</p><p>On top of that, pictures of your family pop up everywhere. You need to avoid them, so they don't remind you of your duties as a father and a husband.</p><p>Features:<br/>+ Arcade platform gameplay<br/>+ 8 unique beer effects - ranging from mandatory puking to inability to climb ladders<br/>+ Retro Pixel graphics<br/>+ Dark humor<br/>+ Interesting story and characters<br/>+ Multiple endings</p><p>---</p><p>DIFFERENCES FROM THE MOBILE VERSION:</p><p>0) No ads in web version.<br/>1) Some sounds are different.<br/>2) Some of the pictures move faster because it's slightly harder to control the player character on mobile, and using the keyboard I felt it was too easy.<br/>3) The game has local highscores as opposed to global highscores for the mobile version.<br/>4) No achievements/medals for this version :( sadly I didn't have the time to integrate medals due to IRL obligations, so it was either release it without or not at all. Maybe I will add some in the future.</p><p>---</p><p>As always,<br/>CHEERS!</p>", "metacritic": null, "released": "2016-05-07", "tba": false, "updated": "2019-08-28T23:23:57", "background_image": "https://media.rawg.io/media/screenshots/25e/25e51de19d69eec9617d71a2175aa821.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 13, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Suhail Habib"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}