{"id": 117625, "slug": "a-shine-in-the-dark", "name": "A shine in the dark", "name_original": "A shine in the dark", "description": "<p>A tale of hope and despair about a human bird having to face the departure ofher kind to the south, despite being unable to fly. Will she ever find a way to fix her broken self?<br/></p><p><strong>Reviews</strong><strong>:</strong> </p><p><em>\"I wasn't expecting that.\"</em> The all-doing-in this-vn girl about her writer's work. </p><p><em>\"Meow!</em><em>\" </em>Caliixte, the production cat, while trying to catch the birds on-screen. </p><p><em>\"Pleaz I wana kooki</em><em>\"</em> The writer, suffering from a severe lack of fuel after all this work.</p><p><em>\"Life is tough.\"</em> Elwing, the main character of this game. </p><p><strong>Some facts about this game</strong><strong>:</strong> </p><p>It's violent, sad and involving pretty serious topic, such as <em>depression, bullying, </em><em>death and suicide</em>. Despair is deep on this one.That said, there is no graphic violence. </p><p>This game contains <em>8 bad endings</em> <em>and </em><em>5 </em><em>different ends</em><em>,</em> though only one is the true. </p><p>Depending on the end you're satisfied with, it can be pretty long. Hours of gameplay guaranteed and a high replay value, I guess. </p><p>Included with the unique feature to jump back to the previous choice, offered gracefully by the all-doing-in-this-vn girl. </p><p>Made for the TyranoBuilder Sping Game 2017. It's finished story-wise but might have an updated version for some things. It's also our first game ever.</p><p>To conclude this presentation: We love you all!</p><p>Now we're gonna sleep. Like a forever sleep.</p><p>Wish you a good game! </p><p><strong>Credits: </strong></p><p>Thanks to Ross Bugden - Music &amp; Ross Bugden - Composer (Solstice, Still, No Winners),  Whitesand (Forever, Drops, Reflection), Mattia Cupelli (Touch), Jonny Easton (Morning walk), Lucas King (Abandoned, Hurt, Tears in the rain, The mirror, The last leaf falls), http://www.bensound.com/ (Piano Moment), TheRedlightDot.musicfan (Daydreamin) &amp; the youtube channel FreeSoundsMusic (Old Love) to support creativity by making some wonderful songs available for others works.</p><p>Check the playlist on the bottom to listen to all the songs used in the game!</p><p>Thanks also to the artists who did the same with their drawing, having used some for the base art of our backgrounds.</p><p><strong>Special thanks to:</strong> </p><p>Markiplier (Bitch, he's fabulous!) </p><p>LittleJayneyCakes (For making such beautiful original songs) </p><p>Sugar (For helping us going through the good and the bad times) </p><p>Caliixte (The production cat, our everyday inspiration)</p><p>The playlist with all the songs used in order of play (I highly suggest listening to them after the completion of the game):</p><p>https://www.youtube.com/playlist?list=PLweSm-VwHvThWYCUhAx2rLjngxZeOuUlm</p><p>For any inquiries, you can reach us on caliixtedream@gmail.com anytime.</p>", "metacritic": null, "released": "2017-05-08", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/f93/f9308b99e4747b30ec3575032a63254f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 41, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["CALIIXTE"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}