{"id": 11779, "slug": "postcollapse", "name": "PostCollapse", "name_original": "PostCollapse", "description": "After civilization has collapsed and only left ruins, surviving in this environment is a particularly difficult challenge. <br/><br/>As single player, you have to gather useful items from buildings, cars and the environment, construct tools, grow your own food, go hunting and fishing.Game Features<br/><ul><li>Huge, open world: The environment including buildings is procedurally generated, a 120 square km wide area (= about 75 square miles). <br/></li><li>Bow hunting: Construct a bow and you will be able to go hunting. You can create arrows of various properties to achieve different effects. <br/></li><li>Grow your own food: You can create your own farm, and grow potatoes, carrots and other food. <br/></li><li>Winter / Summer cylce: Due to the tremendous side effects of the war causing the collapse, summer and winter both only last a few days. You have to adapt to this and gather enough food during summer to survive each winter. <br/></li><li>Head Quarter: Choose any building in the world and make it your headquarter. You can store items there, and bug in during the winter. <br/></li><li>Dynamic day / night cycle: Temperature, amount of sight and behavior of wildlife significantly depends on this. <br/></li><li>Chop down trees and harvest wood, for keeping warm during the winter, constructing tools or creating fires. <br/></li><li>Light sources: You can use match sticks, torches and lamps (if you can find batteries) during the night. Or build a camp fire. <br/></li><li>Fishing: Construct a fishing rod and you will be able to go fishing. <br/></li><li>Tasks to solve which guide you through the game play and show how everything is being done. Currently, there are 16 tasks impemented.</li></ul><br/><br/>The game is single player only and was designed like this, so that no other player is able to ruin your experience. This game also doesn't include any zombies.", "metacritic": null, "released": "2016-10-13", "tba": false, "updated": "2019-08-28T22:13:41", "background_image": "https://media.rawg.io/media/screenshots/027/02734f9c5bbdccfa2ff9118b622af85a.jpg", "website": "http://www.postcollapse-game.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 8, "toplay": 1}, "playtime": 2, "achievements_count": 13, "ratings_count": 0, "suggestions_count": 363, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ambiera"], "genres": ["Adventure", "Simulation", "Indie"], "publishers": ["Ambiera"], "esrb_rating": null}