{"id": 11787, "slug": "hyper-jam", "name": "Hyper Jam", "name_original": "Hyper Jam", "description": "Hyper Jam is a neon-soaked bloodbath for 2-4 players with a focus on satisfying combat and replayability.<br/><br/>With a hard hitting combination of lethal weapons, stackable powerups (perks), furious combat and a killer synthwave soundtrack by Dance With The Dead and Vulta, Hyper Jam is a local multiplayer title that will always have you coming back for more.GameplayHyper Jam features fast-paced multiplayer arena gameplay - annihilate your friends round after round with rocket launchers, crossbows, hammers, katanas and more.<br/><br/><br/>After every round each player chooses a new perk, which stays with them for the rest of the game, stacking and combining with their existing ones to create more powerful effects.Features<ul><li>Beautiful and dangerous arenas to play on, ranging from a Miami hotel rooftop to a Neo-Tokyo subway<br/></li><li>A strong selection of 80s inspired characters to play as<br/></li><li>A deadly range of weapons to wreak havoc with, plus laser strikes once you've been eliminated<br/></li><li>A wide pool of unique perks, ensuring no two games are ever the same<br/></li><li>Custom game rules to tweak or spice up the experience (Hammers only anyone?)</li></ul>MusicHyper Jam has an addictive synthwave soundtrack with music by Dance With The Dead and Vulta.", "metacritic": null, "released": "2019-02-12", "tba": false, "updated": "2023-05-02T07:10:42", "background_image": "https://media.rawg.io/media/screenshots/dd1/dd1ed0a02f9c27ba1dc065567910b43c.jpg", "website": "http://hyperjamgame.com/", "rating": 3.88, "rating_top": 4, "added_by_status": {"yet": 3, "owned": 44, "toplay": 7, "dropped": 5, "playing": 1}, "playtime": 3, "achievements_count": 36, "ratings_count": 8, "suggestions_count": 313, "game_series_count": 0, "reviews_count": 8, "platforms": ["Nintendo Switch", "PlayStation 4", "Xbox One", "PC"], "developers": ["Bit Dragon"], "genres": ["Action", "Indie"], "publishers": ["Bit Dragon"], "esrb_rating": "Teen"}