{"id": 11782, "slug": "hashtag-dungeon", "name": "Hashtag Dungeon", "name_original": "Hashtag Dungeon", "description": "Something evil is stirring in the depths of the world. The great sigils that once protected this land are failing, and the legendary Hashtag Dungeons are reopening. Will you be brave enough to enter the dungeons and face the horrors that lie within? Or will you join the dark forces yourself and become an expert Dungeon Master?Features<ul><li>Challenging gameplay reminiscent of the classic Legend of Zelda and The Binding of Isaac. Will you be able to overcome the devilish traps, monsters and challenges that await?<br/></li><li>Creative collaboration is key: every dungeon in the game is made by players and published to Twitter. Everyone can add rooms, enemies, traps and treasures to dungeons with the help of our in-game ‘Dungeon Master’ editor.<br/></li><li>Six characters to unlock and play as, each with their own unique gameplay and tactics: The Magician, The Paladin, The Blood Mage, The Ninja, The Huntress and The Robot!</li></ul>Acknowledgements<br/>Hashtag Dungeon is an experimental game designed to assess how a game might use Twitter to store levels. It was originally developed as part of a third year dissertation at The University of Lincoln. We would like to thank Dr Patrick Dickinson, Dr Ben Kirman, Dr Kathrin Gerling, Dr John Shearer and Dr Oliver Szymanezyk for their support during the lengthy development process. We would also like to thank Robin French for her work on the Steam trading cards, Barney Oram for his sound design, Alex Saye for his work on several enemies, and Liz Rainsberry for her musical talents.", "metacritic": null, "released": "2016-06-01", "tba": false, "updated": "2019-08-28T22:13:41", "background_image": "https://media.rawg.io/media/screenshots/9b2/9b28740325f24e079e3823d5ad5ea645.jpg", "website": "http://www.hashtagdungeon.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 66}, "playtime": 4, "achievements_count": 20, "ratings_count": 1, "suggestions_count": 334, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Hitpoint Games"], "genres": ["Action", "RPG", "Indie"], "publishers": ["Hitpoint Games"], "esrb_rating": null}