{"id": 117961, "slug": "tunnelers-unified", "name": "Tunnelers: Unified", "name_original": "Tunnelers: Unified", "description": "<p><strong>You probably don't want to play this game right now.</strong> It's in a <strong>very</strong> early stage of development. Just bookmark it and come back in a couple of months.</p><p>The game <em>is</em> playable, but it's only fun when there's a big group of you voice-chatting. It's here mainly for testing purposes.</p><p>In it's current state it contains only the bare minimum of features, which however provide a good base to build upon.</p><p>All of the fun features are coming in the next release, namely AI, a new and very cool UI, mobile support and new physics based shaders.</p><p>Also, it looks <strong>horrible</strong>, but that will hopefully be fixed in the next release too. You have been warned though.<br/></p><p>This game is a remake (or resurrection) of a discontinued remake I loved called Tunnelers of an old DOS game I loved called Tunneler. It's a top-down tank shooter in set in a diggable terrain (hence the name) which I unfortunately hadn't had time to implement.<br/></p><p>\r\n\tThe game is open-source on \r\n\tGitHub. I'll be very happy if you report any issues you find there. I'm open to all ideas, and you're welcome to create a pull request.\r\n</p><p>\r\n\tEven if it looks like I'm not working on this anymore, even if the last commit is a few months old, I am. I'm a student, and I can't work on this full time. Heck, sometimes I can't work on this in my free time. But I will always come back. This game has got a special place deep in my heart.\r\n\t<br/>\n</p>", "metacritic": null, "released": "2014-07-24", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/fa2/fa297eab561e082876f8f83c13e8482a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 7, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Juraj Fiala"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}