{"id": 11799, "slug": "audiosurf-2", "name": "Audiosurf 2", "name_original": "Audiosurf 2", "description": "<p>By blending gameplay with music visualization, Audiosurf puts you inside your music in a way nothing else can. Use your own music to create your own experience. The shape, the speed, and the mood of each ride is determined by the song you choose.<br />\nWhat are the biggest improvements from Audiosurf 1?<br />\nEver-expanding new ways to play with over 500 and counting player-created mods and skins on Workshop.. Additional layers of strategy tied to the song’s biggest moments. In-game leaderboards let you compare your score moment to moment against your friends and rivals even when they’re not online. Enhanced graphics quality. Ability to search for music (including online music). Available on Mac and Linux!<br />\nWhat’s new about Mono mode in Audiosurf 2?<br />\nIn Audiosurf 2 your timing in mono mode is more important than ever. You’ve got to strategize to get your grid full at the most intense moments of songs to get the most points. Look ahead in the distance for corkscrew loops with powerups to know when these moments will occur.<br />\nWhat do I get in the demo?<br />\nThe demo allows players to play any song they want, for their first 3 songs. After that, they can play the Song of the Day, everyday, as many times as they want.<br />\nIs there a mode that focuses on dodging blocks?<br />\nYes, there&#39;s a new Ninja mode. It has a big bonus for hitting no spikes and creates intense spike fields to weave through. It’s faster than regular Mono and the second-to-second challenge of avoiding spikes is harder. For even more challenge there’s ninja turbo. It’s too fast for you.<br />\nWhat’s new about the Puzzle modes in Audiosurf 2:<br />\nJust as with Mono mode, your timing on Puzzle modes is now more important than ever. Push, Shuffle, Erase, or Scoop blocks at the just the right moments to take full advantage of multiplier powerups that come at the most intense moments of songs.<br />\nCan players make their own mods and skins to share on Steam Workshop?<br />\nYes! There’s detailed documentation on making Audiosurf 2 skins available here: http://steamcommunity.com/sharedfiles/filedetails/?id=413812198<br />\nAlso, every mode and skin in the games comes with the script source code and assets. Players can use any of the official modes/skins as a starting place.</p>", "metacritic": 76, "released": "2015-05-26", "tba": false, "updated": "2024-04-06T12:09:14", "background_image": "https://media.rawg.io/media/screenshots/216/21604ad1b0ad028ace5bee1c14e7ee12.jpg", "website": "http://audiosurf2.com", "rating": 3.8, "rating_top": 4, "added_by_status": {"yet": 20, "owned": 762, "beaten": 57, "toplay": 6, "dropped": 82, "playing": 12}, "playtime": 3, "achievements_count": 14, "ratings_count": 182, "suggestions_count": 373, "game_series_count": 0, "reviews_count": 183, "platforms": ["PC", "macOS", "Linux"], "developers": ["Dylan Fitterer"], "genres": ["Indie"], "publishers": ["Dylan Fitterer"], "esrb_rating": null}