{"id": 11794, "slug": "age-of-rivals", "name": "Age of Rivals", "name_original": "Age of Rivals", "description": "Deep civilization-building strategy in a fast-paced card game.<br/>You know those games where you spend 10 hours building up a huge civilization with a carefully balanced economy, military, culture and defense so you can prove that you are the greatest ruler ever?  Age of Rivals is like a 10 minute version of that.  With cards.<br/><br/>There are many paths to victory in this competitive card drafting game featuring 12 unique characters and hundreds of cards ranging from great pyramids and war elephants to sneaky spies and crafty merchants.  <br/><br/>Age of Rivals was inspired by boardgames like 7 Wonders and Dominion and CCGs like Hearthstone.  We designed it to be ideal for 2 players to play in 10 minutes, and we emphasized depth and replayability.  <br/><br/>And unlike many CCGs, all cards unlock at a constant pace, and you never get duplicate cards you don't need.  There are no in-app purchases.The anti-deck building CCG.<br/>Having only minimal control over your deck encourages endless variety in each game and puts the focus on in-the-moment tactical decision-making.  You may go heavily offensive one game with an arsenal of war machines and in the next game find yourself emphasizing artistic achievement and burglary.  It’s all about trying to put together clever card combinations to counter what you think your opponent might do.  <br/><br/>Perfectly balance your city’s culture, military, defense and economy to outwit your opponent and win!Key Features<ul><li>Play offline or online - no account necessary for single-player<br/></li><li>Play as 12 unique characters<br/></li><li>Unlock over 200 cards with unique special abilities<br/></li><li>Ranked public matchmaking (requires registering a free account)<br/></li><li>Private friend matches<br/></li><li>Alliances with other players<br/></li><li>Daily missions<br/></li><li>Monthly tournaments<br/></li><li>Single player challenge levels</li></ul>What Players Are Saying<ul><li>“this game is intoxicating ... in the best possible meaning. the balancing is close to perfect and the card exchanging rule makes every game different and never unbalanced. 10/10 magna cum laude. “ - Lobbod<br/></li><li>“I think this is a great card game that also incorporates a nice board game style to it” - narayan999<br/></li><li>“A very dynamic game with different ways to achieve victory. No best strategy to win, no grinding required, luck factor is not so relevant: you just have to be smarter than your opponent :) Definitely worth your free time.” - crodino<br/></li><li>“What separates this brilliant game from 7 wonders is its emphasis on military, which is closer to civilizations in real life. This game carefully balances economy, military, and growth elements well and deserves 5 stars.” - SuperBigDay<br/></li><li>“Well designed game, excellent card system.” - Zalgocomes</li></ul>Will I like Age of Rivals?<ul><li>If you like the idea of a fast-paced card game version of Civilization, then yes!<br/></li><li>If you like board games like 7 Wonders and Dominion, then yes!<br/></li><li>If you like like the part of a CCG where you try to tactically outwit your opponent more than you like the part where you have to build a 30 card deck, then yes!</li></ul>", "metacritic": null, "released": "2017-03-14", "tba": false, "updated": "2019-08-28T22:13:40", "background_image": "https://media.rawg.io/media/screenshots/b5c/b5ceab79eb463dd04e8b9ae0ab1c755f.jpeg", "website": "http://robotogames.com/age-of-rivals", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 16, "toplay": 3, "dropped": 2}, "playtime": 5, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 277, "game_series_count": 0, "reviews_count": 1, "platforms": ["Android", "PC", "macOS", "iOS"], "developers": ["Roboto Games"], "genres": ["Strategy", "Board Games", "Card", "Indie"], "publishers": ["Roboto Games"], "esrb_rating": null}