{"id": 11790, "slug": "ascender", "name": "Ascender", "name_original": "Ascender", "description": "Ascender is a 2D explorative puzzle platformer. The game is set in the open world of GOA's districts, and the player will face many unique puzzles to solve. Warning!! This game will truly challenge your puzzle and platforming skill :D<br/><br/><br/>The story follows the enigmatic journey of Sky, an explorative artificial intelligence made by Professor Toro Hudo who lives in GOA, the world below. Sky was created to help Professor Toro Hudo in constructing a kinetic system for his foster daughter, Ocean Hudo, a forsaken limbless child who fell from the clouds when she was an infant. Observe the mystical GOA, experience its astonishing adventure with formidable puzzles, swiveling plot, and bizarre habitat.<br/><br/><br/><ul><li>Enjoy the incredible story of Ascender. Get to know more about Ocean, her dad and the GOA's civilization.<br/></li><li>Explore the various districts of GOA, the underground civilization in the world of Ascender. The game uses an open world approach with metroidvania vibe that is very focused on puzzle.<br/></li><li>Creatively combine power-up to meet your need. Sky can equip itself with various types of onyx runes. Each onyx rune grants Sky with a new power-up. Combining different runes may also yield a new power up.</li></ul>", "metacritic": null, "released": "2017-03-17", "tba": false, "updated": "2022-10-17T08:39:44", "background_image": "https://media.rawg.io/media/screenshots/334/334708a480e489c57c4c56d582bd18be.jpg", "website": "http://www.ascenderthegame.com/main/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 38, "beaten": 1, "toplay": 2}, "playtime": 4, "achievements_count": 32, "ratings_count": 2, "suggestions_count": 554, "game_series_count": 0, "reviews_count": 2, "platforms": ["iOS", "Linux", "PC", "macOS"], "developers": ["GameChanger Studio", "Peter Moyle"], "genres": ["Action", "Adventure", "Strategy", "Indie"], "publishers": ["GameChanger Studio", "Peter Moyle"], "esrb_rating": "Everyone 10+"}