{"id": 117969, "slug": "wheres-masky", "name": "Where's Masky?", "name_original": "Where's Masky?", "description": "<p><strong>Note: I didn't realize I forgot to add in the read more before I compressed and uploaded everything so please download it separately from the game because they include more specifics about warnings and other things!     </strong></p>\n<p><strong>「読んでください」のメセージは大事なので、ぜひそれもダウンロードしてください。ファイルに入れるのが忘れました。</strong></p>\n<p><strong>    Sorry for the trouble!!</strong></p>\n<p>    Where's Masky is an April Fools Vocaloid RPG fangame with some horror elements. It's made using RPG Maker VX Ace and is based in exploration and story. It is heavily inspired by games like Ib and End Roll. </p>\n<p>    Things to know: This game is not recommended if you have no interest in Vocaloid or have little to no background in it.  This game is based around the ask blogs askspiritfukase and askfukasevocaloid, both of which are AUs of Vocaloid Fukase, but it can still be enjoyed without prior knowledge of these two.</p>\n<p>    Installation: For both Japanese and English versions, there's a With and Without RTP version. If you don't know if you need RTP or not, if you don't already own RPG Maker VX Ace or if you've never played an RPG Maker VX Ace game before, assume you don't have it and download the with RTP version. </p>\n<p>    I apologize for those who don't own Windows computers but I don't think this game is available on your systems...With Mac, you may be able to use Winebottler or a similar program but I can't help anyone with mobile devices or Linux. </p>\n<p>This game features:</p>\n<ul><li>Original music</li><li>10-30 minutes of gameplay</li><li>Original art assets (With only a couple of outside resources which are listed in the end credits)</li><li>Multiple Endings</li><li>Humor</li><li>One battle scene </li></ul>\n<p>Plot:</p>\n<p>    \"Spirit\", a being who helps spirits, lives with its best friend \"Masky\". When it comes home one day to find him nowhere in sight, it embarks on a mini-adventure through his house to look. Will it succeed? Or will it find more than it bargained for?</p>\n<p>Controls:</p>\n<p>    Arrow keys--Move character</p>\n<p>    Esc--Menu (The save button is included in this menu. It's highly recommended to save often)</p>\n<p>    Enter key: Inspect/confirm/talk</p>\n<p>    Shift: Run</p>\n<p>Warnings:</p>\n<p>    There is one very very minor jumpscare (as minor as a bump) that shouldn't be too much to handle unless you're extremely jumpy. Past a certain point, there will be blood and some horror elements. Please proceed with caution.</p>\n<p>Team: </p>\n<p>    Artist #1/Programmer/Writer--Eddie</p>\n<p>    Artist #2/Writer--Moon</p>\n<p>    Musician--Magi</p>\n<p>    Translator--Hanata</p>\n<p>Contacts:</p>\n<p>　For anything you want to ask about, please contact me at ollieollienishiteageru@gmail.com, Edlinklover on twitter, Edlinklover or askspiritfukase on tumblr</p>\n<p>何があったらollieollienishiteageru@gmail.comやTwitterで＠EdlinkloverやTumblrでEdlinkloverやAskspiritfukase連絡してください</p>", "metacritic": null, "released": "2018-04-01", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/7bc/7bc3006c16c78e09b5d423b6b20527a7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 90, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Eddie"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}