{"id": 11808, "slug": "spud-cricket-vr", "name": "Spud Cricket VR", "name_original": "Spud Cricket VR", "description": "Born from 2 mates drinking beers, watching cricket, and believing they could do better than the spuds currently doing the rounds in world cricket, Spud Cricket VR is a Virtual Reality cricket game for the HTC Vive. Play 5,10 OR 20 overs against a mate, 1 innings at a time. Simple fun, slog it hard, casual cricket game. You will love smacking the bowler over the fence as you try to be the next Davey Warner! But you wont. Your a spud.<br/>\n<br/>\r\nFeatures include: <br/>\n<br/>\r\n- Single or local multiplayer modes<br/>\r\n- 3 types of matches - 5, 10 or 20 over match.<br/>\r\n- 3 difficulty levels.<br/>\r\n- Use of the HTC Vive hand controller for realistic batting action.<br/>\r\n- Bat either left or right handed.<br/>\r\n- The bat has a sweet spot. Time those shots for the runs. Haptic feedback will tell the story.<br/>\r\n- AI fielders that adjust to your big shots.<br/>\r\n- Not all batters were born equal. As you go down the batting list, so does the skill of your batters.<br/>\r\n- Customisable line, length and speed for the bowler player in local multiplayer - Suprise your friend batting with a sudden slower delivery or a yorker.<br/>\r\n- Double up with fielding customisation in local multiplayer - dont just bowl it different, plan your fielding setup as well and entice the batter into the big hit, only to get caught.<br/>\r\n- In game crowd noise and reaction to shots, wickets and other moments. <br/>\r\n- Scoreboards both in game and for the desktop with detailed batter information.<br/>\r\n- Multiple views for Batter and bowler.<br/>\r\n- Action replays! You can repeatedly watch the big 6 you just smashed off your friends bowling!", "metacritic": null, "released": "2017-05-01", "tba": false, "updated": "2019-08-28T22:13:40", "background_image": "https://media.rawg.io/media/screenshots/f77/f775353ef21b0e7865d97aabfccff9fa.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 218, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Hairy Man Games"], "genres": ["Sports", "Casual"], "publishers": ["Hairy Man Games"], "esrb_rating": null}