{"id": 11809, "slug": "demise-of-nations", "name": "Demise of Nations", "name_original": "Demise of Nations", "description": "Demise of Nations is a 4X turn-based grand strategy wargame covering the rise of Rome till the fall of modern civilization. Command your armies in one of the many ancient and modern countries including the Roman Empire, British Islands, Germany, Japan or the United States. From Rome to modern nations, you create your own warring experience. Wage colossal wars solo, against the AI, or take on your gaming friends in cross-platform multiplayer games. Form alliances and fight co-op style with the AI and other players for ultimate victory.<br/><br/>Range of functionality is comprised of trading, diplomacy, expansion, conducting research, exploration, managing resources, building, food distribution, governing and city management. Units at your disposal are Scouts, Swordsmen, Spearmen, Archers, War Elephants, Galleys and Longboats amongst others. Demise of Nations incorporates changing weather patterns such as shifting climates and storms. Rain during summer providing much needed humidity for your crops, while snowy winters will proof if you are ready for the challenge. Assemble your armies and take on the world and achieve greatness in this epic historical strategy game.<br/><br/><ul><li>Turn-Based Grand Strategy covering Ancient to Modern Times.<br/></li><li>4X Strategy: eXplore, eXpand, eXploit, and eXterminate.<br/></li><li>Challenging AI based on Genetic Algorithm.<br/></li><li>Weather and Seasons including Snow, Rain and Storms.<br/></li><li>Diplomacy, Research, Trade and City-Building.<br/></li><li>Cross-Platform Multiplayer/Hotseat-Play including co-op team games.<br/></li><li>Random Map Generator.<br/></li><li>Nations: Roman Empire, Gaul, Germany, Japan and the United States amongst others.<br/></li><li>Troops: Swordsmen, Archers, Horsemen, Tanks and Fighter Planes amongst others.<br/></li><li>Ships: Galleys, Aircraft Carriers, Battleships and Submarines amongst others.<br/></li><li>Played as WE-GO Turn-Based Game allowing for an Unlimited Number of Players.<br/></li><li>High Scores, Playing Statistics and Achievements.<br/></li><li>Engaging Music and Sound Effects.</li></ul><br/>The game includes one map for FREE. Other maps are available for download and cost $3.99+ for single maps or $19.99 for all maps. Multiplayer games are generally free to join. Hosting multiplayer games costs 5 cents/game. There is no subscriptions. This game is NOT pay-to-win.<br/><br/>If you like this game, please also try our other strategy games. You should be able to find the games in the same marketplace!<br/><br/>Thanks &amp; Enjoy the Game!<br/>noblemaster ]:-D", "metacritic": null, "released": "2015-04-21", "tba": false, "updated": "2019-09-17T09:19:05", "background_image": "https://media.rawg.io/media/screenshots/601/601b0624999cf6edc575d7359d7a30c2.jpg", "website": "http://www.demiseofnations.com/", "rating": 2.7, "rating_top": 3, "added_by_status": {"yet": 3, "owned": 314, "beaten": 1, "dropped": 3, "playing": 1}, "playtime": 1, "achievements_count": 21, "ratings_count": 10, "suggestions_count": 420, "game_series_count": 0, "reviews_count": 10, "platforms": ["Android", "macOS", "PC", "iOS", "Linux"], "developers": ["Noble Master", "Noble Master Games"], "genres": ["Strategy", "Simulation", "Indie"], "publishers": ["Noble Master"], "esrb_rating": "Teen"}