{"id": 118039, "slug": "kotoran-shadow", "name": "Kotoran Shadow", "name_original": "Kotoran Shadow", "description": "<p>TRAILER</p><p>https://www.youtube.com/watch?v=VBCmeW-E4sI</p><p>ENGLISH</p><p>Kotoran Shadow is about the history of the region of Fur, which in the past was reigned by a evil king called Kotoran. The king abused and exploited his people as a slaves, and he planned conquest other territories and create an empire. But, other kingdoms joined together to make an alliance against Kotoran, and then the war burst in this region. But this war finished with the king defeated and the freedom of furian people. The game is situated many years after this events. In the village where the castle of ancient king is situated, we will play as Kedi, a young mercenary that has traveled along Fur region, working for a group of merchant caravans. As a good adventurer, you won't go before investigate the village and enter in the castle. And.. who knows... maybe find a treasure.<br/></p><p>This game is the final project of degree by a little group of students. By this reason, you won't find a professional result, besides, the game is only in spanish language for now, so we apologize if this doesn't let you enjoy your game experience. But, for us this game has been a enriching experience to learn and we only want to share the result with the world. All constructive opinions are welcome and we hope that with its attributes and imperfections, you will enjoy our work. Thanks for playing ;)</p><p>SPANISH</p><p>Kotoran Shadow cuenta la historia de la región de Fur, antaño gobernada por un malvado rey llamado Kotoran. El mismo maltrataba y explotaba a su pueblo como esclavos, y planeaba extender su territorio hasta otros reinos para formar un imperio. Sin embargo, los otros reinos llevaron a cabo una alianza contra Kotoran, y así se produjo una gran guerra en esta región, que terminó con la derrota del rey y la liberación del pueblo furiano. El juego se sitúa muchos años después de estos sucesos. En el pueblo donde se sitúa el castillo del antiguo rey, encarnaremos a Kedi, un joven mercenaro que ha viajado por Fur ofreciendo sus servicios a un grupo de caravanas mercantiles. Como buen aventurero, no querrás irte sin antes haber investigado el pueblo y entrar al castillo. Y ...quién sabe... conseguir algún tesoro.<br/></p><p>Este juego es el proyecto final de carrera the in pequeño grupo de estudiantes. Por esta razón, no encontrarás un trabajo profesional, para nosotros ha sido una experiencia de apredizaje enriquecedora y queríamos compartir el resultado. Todas las opiniones constructivas son bienvenidas y esperamos que con sus atributos y defectos, disfrutéis de nuestro trabajo. Gracias por jugar ;)</p>", "metacritic": null, "released": "2015-08-02", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/3ae/3aecbe40d2cbb0e22d7da3b00ca6bed1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 264, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Fiuras"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}