{"id": 118105, "slug": "megamax-the-1st-game", "name": "MegaMax-The 1st Game", "name_original": "MegaMax-The 1st Game", "description": "<p>Maximilian Dood has been an inspiration to me, aside from offering his opinion on video games and sharing his passion for it, he is also retweeting my fanart, which has allowed me to see people appreciate my art, something im not used to seeing, so one day i decided to make Megaman inspired sprites, when i finished those i decided to make this small prototype, i know i need to change the enemies, but due that i cant really afford Clickteam Fusion, i cant really finish this, maybe one day i will buy it and polish it more and complete it.</p>\n\n<p>NOTE: There are several bugs im aware of here are a few,  1)Loading the game doesnt always seem to work, refreshing the page and clicking \"Click to Start\" again seems to fix it 2) if an enemy hits you while your near any of the stages walls or ceiling, there is a high chance you will get stuck inside of it, if this happens please press \"ENTER\" to get pulled out. 3) pressing against the wall and jumping, aside from constantly looping the jump sound you may also get stuck or be able to jump further up. 4) Enemies are actually constantly shoting at you, though there is an object limit, eventually you will run towards an enemy and previously shot bullets will just load and fly towards you. </p>\n<p>thats all of the bugs im personally aware of, keep in mind this is just a prototype, im new to programming and using only the \"Free\" version of Clickteam limits my options, but in the end i hope i made something enjoyable, any donations will probably be used to donate it back to Maximilian and to possibly allow me to buy Clickteam fusion, you dont need to Donate, a feedback or any comments would be appreciated, take care and have fun playing, Latz!</p>", "metacritic": null, "released": "2017-03-12", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/d3d/d3d6ad9c0a6adfd49e48ce1b783cd527.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 52, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["RetroSerpentGames"], "genres": ["Shooter", "Platformer"], "publishers": [], "esrb_rating": null}