{"id": 11828, "slug": "dinosystem", "name": "DinoSystem", "name_original": "DinoSystem", "description": "<strong>### NOTE FOR LAPTOP USERS ###</strong>If you have a decent graphics card and still have bad performance, it's possible your card is not being used to run the game. Try enabling your graphics card for <strong>run_game.exe</strong> (the game launcher), here's a guide for NVIDIA and ATI.<br/><br/>-------------------------------------------<strong>What is DinoSystem?</strong>DinoSystem is a 2D, top-down ecosystem and survival simulation that allows players to either manage the ecology of an evolving island (inhabited by dinosaurs), or survive in it as a human, dealing with realistic survival mechanics, and with a deep character progression system that tracks how your character's body adapts over time.<strong>An emergent, living world:</strong>Everything on the island is subject to biological and physical rules, and nothing comes from nothing: will you hunt the last dinosaur of its species for a steak, or will you protect it from extinction and make sure its eggs hatch? These are the dilemmas you'll face in the game, as long as YOU don't get extinct.<strong>Development:</strong>To see all the features planned for the full release and the ideas we are considering, please check the development roadmap, and feel free to join the discussion and make suggestions!<strong>Game Modes:</strong><ul><li><strong>God</strong>: Manage the island ecology, change the weather, trigger devastating events, and see how the ecosystem adapts. NOTE: God mode still lacks a proper GUI and tools to fully interact with the world; expect it to be expanded throughout the Early Access phase.<br/></li><li><strong>Survival</strong>: Join the island as a stranded human, see how long you can survive as part of it, and how your body changes in the process; the game offers the option to play either with \"casual\" or \"hardcore\" difficulty. NOTE: there is no story yet as a background for the Survival mode, we're still working on it, and you can help us find a good one!</li></ul><strong>World Features:</strong><ul><li><strong>Ecology simulation</strong>: the game simulates a Cretaceous ecosystem populated mainly by dinosaurs, animals and plants don't \"spawn\"; they are born, then grow, reproduce and die.<br/></li><li><strong>DinoSystem uses a complex seasonal model</strong> that calculates day/night length, relative position of the sun, and influences the weather. Seasons transition is gradual, no sudden change between two seasons.<br/></li><li><strong>Realistic weather model</strong> that takes into account variables like time of day, humidity, temperature, and pressure; generating weather conditions like rain, snow, wind, sand/snowstorms, thunderstorm and fog.<br/></li><li><strong>Thunders can trigger huge wildfires</strong>, burning down entire forests.<br/></li><li><strong>Realistic water cycle</strong>: rain creates puddles that can either evaporate or grow into ponds and lakes. Evaporation takes into account air humidity, temperature and sun exposure.<br/></li><li><strong>Terrain changes according to factors like presence of water, weather, vegetation, and location</strong>. Any area can become fertile or arid, new forest or grasslands may form or disappear over time.<br/></li><li><strong>Fire</strong> (from torches to campfires and wildfires) <strong>consumes available fuel</strong>, releasing heat and light, and it's influenced by air humidity and wind; you body and all objects near a fire are heated up. Fire can spread to nearby vegetation and trigger a wildfire, if ambient conditions are favourable.<br/></li><li><strong>Animals AI</strong> allows them to survive in their world and adapt; they'll reproduce, care for their youngs, look for protection or compete for food and mating.<br/></li><li><strong>Each new island is randomized at game start</strong>, based on parameters set by the player.<br/></li><li><strong>Everything</strong>, from dead animals to branches, <strong>decomposes</strong> based on factors like temperature, humidity, and location. There is no \"timer\" after which an item or a carcass disappears.</li></ul><strong>Survival Features:</strong><ul><li><strong>Deep, complex and rewarding character progression system</strong>: metabolism, body muscles and fat change according to your lifestyle, and even your character's sprite changes in appearance to reflect this. Get fat to survive winter, get slim to be lighter and swifter, or get muscular to be stronger in combat and more capable of hard work, but make sure to eat enough proteins...<br/></li><li><strong>Needs like thirst and hunger are not just bars that drop at a constant rate</strong>: everything, from performing actions to metabolism and body weight, influence the rate at which you burn calories, consume water or get tired. For example, high temperature or intense activity make you sweat, requiring you to drink more water. <br/></li><li><strong>Dozens of skills, both mental and physical, that raise as you perform a particular action</strong>; but can also decay if you don't use them for a long time (only in \"hard\" difficulty!).<br/></li><li><strong>Crafting system allowing you to create items and weapons</strong>, advancing in technology at each step. NOTE: few items are craftable in the current Early Access build; expect many more to be added throughout the development!<br/></li><li><strong>Foods with different nutrition values</strong>: meat is valuable because of proteins, but make sure you cook it...</li></ul><br/>Many more features will be added throughout the development! Again, check the development roadmap, and feel free to get involved and suggest new features.<br/><br/><br/>", "metacritic": null, "released": "2015-06-25", "tba": false, "updated": "2019-08-28T22:13:39", "background_image": "https://media.rawg.io/media/screenshots/f47/f47321adba1ce3b45df721a2142fd967.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 4, "owned": 89, "beaten": 1, "toplay": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 3, "suggestions_count": 381, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC"], "developers": ["Capribyte Studios"], "genres": ["Action", "RPG", "Simulation", "Indie"], "publishers": ["Black Shell Media"], "esrb_rating": null}