{"id": 118294, "slug": "multirotor-sim", "name": "Multirotor Sim", "name_original": "Multirotor Sim", "description": "<p>Realistic behaviour of three kinds of drones. In the game we have previewed such physical factors as workpiece weight, wind speed, engine power, frame square, inertia, light free flight standfast, and that was fulfilled on the technology Nvidia Physx.</p>\n<p>Multicopter workpieces are prone to physical damage. Frame, engine and other workpieces will be destroyed or removed when falling. The repair of each workpiece will cost you some coin's amount.</p>\n<p>Earn coins in missions or free flight. You can also buy necessary coins through Google Play.</p>\n<p>Purchase and upgrade of different workpieces:</p>\n<p>* Batteries - Iincrease the flight time</p>\n<p>* Frame Kits - Choice of three frame types (tricopter, quadcopter, hexacopter)</p>\n<p>* Motors - Increase speed and power</p>\n<p>* GPS Module - Enable to fight the wind drift automatically</p>\n<p>* Telemetry Kit - Visualizing the Telemetry screen with parameters' display (speed, height, wind, battery charge, signal, strength level)</p>\n<p>* Ultrasonic sensor - Reduce incidence of accidental crashes on the low height</p>\n<p>* GoPro - camera by default, fixed</p>\n<p>* Brushless Gimbal 2D - Suspension for camera that make drone movement smooth.</p>\n<p>Three game modes:</p>\n<p>1. Free flight in the city. Collect coins. Perform acrobatic tricks and cartwheels in all sides and earn bonus coins.</p>\n<p>2. Racing on the crowded city streets. Collect time at every checkpoint. Gained time will turn into coins on the finishing point.</p>\n<p>3. Kill zombies in various ways. Make a trap on the roof edge and the road. Kill them with artillery attack.</p>\n<p>Large-scaled, highly detailed urban landscape with realistic cars movement. You can interact with citizens.</p>\n<p>You can change the maximum tilt angle of fish-tailing in game options. Choose type of control. Also it is possible to select control for left-hand or right-hand players.</p>\n<p>Integration with Facebook. Share the status Multirotor Sim, recommend it to friends, write your story and you'll get free coins.</p>\n<p>https://www.youtube.com/watch?v=Aw84YgQ538o<br/></p>\n<p>Minimal system requirements:</p>\n<p>Core - 2</p>\n<p>Ram - 1 Gb</p>\n<p>Screen - 800*400</p>\n<p>Open GL - ES 2.0</p>", "metacritic": null, "released": "2015-10-24", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/b2a/b2abd4ee6852a0d368eaf021de4e93ea.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 200, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["VadimSilver"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}