{"id": 118351, "slug": "sumo-revise-2", "name": "Sumo Revise!", "name_original": "Sumo Revise!", "description": "<p>Let's talk about the Sumo!</p><p><strong>CHECK OUT SUMO ON GREENLIGHT:</strong></p><p><strong>http://steamcommunity.com/sharedfiles/filedetails/?id=334556319</strong><br/></p><p> </p><p>GET THE SOUNDTRACK HERE: <br/>https://davidszymanski.bandcamp.com/album/sumo-revise-ost</p><p>TRY OUT THE SUMO DEMO ON GAMEJOLT HERE: <br/>http://gamejolt.com/games/action/sumo-revise/48134/</p><p> <br/>Sumo Revise is a 2d comedy fighting game that seeks to bring back the quirky retro glory of old school local multiplayer games like Super Smash Brothers and Goldeneye 64. Lightning quick rounds are supported by heavy amounts of customization, letting you and your friends play around in a strange fighting game toybox. <br/> <br/>Made with a collection of bizarre powerups, glitches polished to function as gameplay mechanics, and an incredible depth of customization options, Sumo Revise is a gotta-look-that-one-up-when-I-get-home for anyone who wants to have a fun chaotic time with friends. <br/> <br/> <br/>Let's examine the Sumo Features! <br/> <br/></p><ul><li>2 to 8 local players simultaneous, via keyboard, mouse, and gamepads. <br/> <br/></li><li>Quick, instantly-resetting rounds. No extra menu time needed! <br/> <br/></li><li>Powerups that are all both helpful and disastrous <br/> <br/></li><li>Modifiers and modes to vary up gameplay <br/> <br/></li><li>Robust level editor and mode/modifier editor allow you to create whatever gametype you wish <br/> <br/></li><li>Large variety of modes and levels (Free For All! Race! Team Free For All! Bacon! and more!) <br/> <br/></li><li>Low-res graphics and catchy electronic soundtrack by David Szymanski <br/> <br/></li><li>Space squid and secret lizard. </li></ul> <br/> <br/>Let's be more serious about the Sumo! <br/> <br/>Man, I really miss local multiplayer. I almost feel like local multiplayer is a dying art; it's been replaced by online and often highly competitive experiences instead. These online games and online multiplayers definitely have their place, but do you remember sitting down on the '64, Gamecube, or and older system like that and finding out that Random Joe game #45 had multiplayer? If you were like me, I would plop my brothers down in front of our bubble TV and we'd all have a great time playing against each other in games that often weren't really developed with multiplayer in mind. There was that certain charm, that certain excitement from those games, and that excitement is something I often find I have to look back to them to find. Maybe it's nostalgia, but I feel like we've all forgotten what good, not-neccessarily-competetive multiplayer truly is. <br/> <br/>Sumo! Revise is a multiplayer game made by someone who loves local multiplayer made for people who love local multiplayer. This is a start-up, goof around in and hopefully-break sort of game. There is no online, and I don't think there will be any online - this game is made for you and your close-knit video-gamer people to play.<p>Published by Black Shell Media LLC.</p>", "metacritic": null, "released": "2015-02-07", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/aba/aba0c3ba57c37637c1f7974c3e735099.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 128, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["cr2crstudios"], "genres": ["Action", "Fighting"], "publishers": [], "esrb_rating": null}