{"id": 118343, "slug": "we-live-in-texas-a-realistic-simulation", "name": "We Live in Texas: A Realistic Simulation", "name_original": "We Live in Texas: A Realistic Simulation", "description": "<p>Hooray for living in Texas during the summer! Please read this post for instructions on how to play.</p><p><strong>HOW TO LIVE</strong><br/></p><p>There are three bars to watch:</p><p><strong>Heat</strong>: If your heat bar maxes out, you die.</p><p><strong>Hydration</strong>: The lower your hydration, the faster you overheat.</p><p><strong>Exhaustion</strong>: The higher your exhaustion, the slower you move.</p><p><strong>MOVEMENT</strong><br/></p><p>Use the <strong>arrow keys</strong> to move.<br/></p><p>Press <strong>Space</strong> to sprint. It will increase heat, lower hydration, and increase exhaustion. But your speed is not limited while sprinting.</p><p>Run over water bottles to collect them. You can store two. Press <strong>Tab</strong> to drink your water bottle.</p><p>Collide into <strong>Fire Hydrants</strong> to increase your hydration and lower your heat! You're <em><strong>desperate! </strong></em><em>Be careful: Fire Hydrants reduce your heat gauge and increase your hydration, but does nothing for exhaustion. I mean, you're drinking out of a fire hydrant in the Texas sun. What do you expect.</em><br/></p><p>Blue squares are pool squares. Stop and cool off!</p><p>Grey squares are the parking lot. Everything is terrible in a parking lot in Texas. Bring water bottles.</p><p>When in dark green squares (or the <strong>shade</strong>, if you prefer), your exhaustion reduces and your heat reduces, but cannot go below a certain point. It's still hot outside.<br/></p><p><strong>GOAL</strong><br/></p><p><em><strong>Find and collect the three Texas-based items, and return them to Yeehaw Block back at the beginning. Be sure to bring them all together, or he won't accept them. Yeehaw Block is kind of stubborn. </strong></em></p><p><em><strong>Your score is displayed upon returning the Holy Texas Trinity to Yeehaw Block.</strong></em></p><p><em>This game was made for One Game A Month (#1GAM).</em> <br/></p>", "metacritic": null, "released": "2015-07-30", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/7f1/7f1c8be829d9cbf1c39ae1d78b12fd69.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 10, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Maestro Light"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}