{"id": 118369, "slug": "rainbow-quest-sheeps-in-the-sky-with-diamonds", "name": "Rainbow Quest: sheeps in the sky with diamonds", "name_original": "Rainbow Quest: sheeps in the sky with diamonds", "description": "<p><em><em>Sans dessus dessous</em> / Upside down  </em>or  <em>without top and bottom</em></p><p>Game made in 40h during the #VGJ2015 of the <em>Virtual Association</em>, based on the theme \"sans dessus dessous\".</p><p>This game was designed to be played with a virtual reality device, and developped with <strong>Unreal Engine 4</strong> and an <strong>Oculus Rift</strong>. </p><p>The point of the game is to make your way across various linear levels which contains (or not!) puzzles and mini-games you have to complete in order to succeed.  Sometimes, you have multiples ways (including tricky ones) to succeed. We wanted our puzzles to be very <em>Antichamber</em>-like, and have an easy solution you wouldn't think about the first time.  <br/></p><p>We choose to work on the \"<em>meta</em>\" aspect of the subject. It's not the levels which are <em>sans dessus dessous</em> (well... sometimes...), but the world itself abandons logic. Level after level, the world is drastically changing, always in a very different atmosphere from the previous one.</p><p>And having a linear succession of linear levels doesn't means that the end of the game is at the end of the levels... Every puzzle was designed to be reversible, because you may have to go back <em>somewhere </em>at <em>some point</em>. </p><p>The published projet is sadly not the full project we have planned to make. It's far from our goal in term of gameplay, storyline, and design. But still, it fits, somehow, to the theme. </p><p>Even if you can't go back in the level-line in this demo, it is upside down in the way we mainly wanted the project to. The world is upside down, transitions have no logic, and you may think the team was probably some weirdos on drugs who loves Wonderland.   </p>", "metacritic": null, "released": "2015-11-22", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/81f/81f22466cc80b00bc3ab9f11dd4f138c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 64, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ponyhypetrain"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}