{"id": 118377, "slug": "awakening-vr-jam-dk2-build", "name": "Awakening VR Jam DK2 Build", "name_original": "Awakening VR Jam DK2 Build", "description": "<p>http://vrjam.challengepost.com/submissions/36355-awakening-working-title<br/></p><p>Awakening is a single player virtual reality top down action role playing game inspired by Diablo, Path of Exile, and Zelda. It makes use of head tracking to allow the hero to target vulnerable spots in monsters. Awakening also makes use of head tracking to cast neat spells and order minions.</p> Innovations <p>Head tracking targeting - both locking on and unlocked<br/> Head tracking ordering your minion.<br/> Fixed follow camera view minimizes motion sickness for a great VR top down view experience. (Out of testing with 10 or so people.)<br/> Attempted Graphics Optimization: Only rendering close objects(instead of geometry) in stereo (Did not make the cut due to a confirmed Unity 5 bug - https://forums.oculus.com/viewtopic.php?f=37&amp;t=22762 ) </p> Controls <p>Moga Pro Controller Gamepad (Xbox360 supported):</p><p>Left Stick - Move around<br/> Right Bumper - Lock on/Unlock<br/> A - Jump<br/> B - Cast spell<br/> X - Scythe Attack<br/> Y - Summon &amp; order undead </p> Hints <p>You can target the wings on the Dragon. If you deal enough damage to it you will injure its wings so it can no longer fly. The dragon may be a lot easier to deal with on the ground.</p><p>Ancient tales tell of a complicated ritual where you have to move up and down and left and right a lot. Performing this sacred dance is supposed to unlock the powers of the universe. </p> Development Hardware <p>Game was developed and tested on an Exynos Note 4 Lollipop 5.0.1. The game was tested using a Moga Pro Controller set on B mode. http://www.mogaanywhere.com/controllers/propower</p> Credits <p>Randy Martinez - Founder/CEO, Lead Engineer<br/> Melvin Tan - Engineer<br/> Eric Covarrubias - Level Design<br/> Jeffrey Clark - Additional Design </p><p>The game is made by Incendiary Games Inc., an independent startup virtual reality video game company.</p>", "metacritic": null, "released": "2015-05-11", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Randy Martinez"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}