{"id": 118460, "slug": "modern-zombie", "name": "Modern Zombie", "name_original": "Modern Zombie", "description": "<p>Website: http://modernzombie.net</p><p>Download: http://modernzombie.net/download</p><p>Tweet Us: @ModernZombieUK</p><p>Like Us: /ModernZombieUK</p><p>Watch Us: /c/ModernZombieNet</p><p>Greetings Survivor,</p><p>Modern Zombie is a new, exciting, massively multiplayer, horror-survival game available to download on windows PC. The game is based on players enduring the hardships of a post-apocalyptic, zombie-infested world… By collaborating with other players and by finding/looting weapons and items the players increase their chances of survival. The game incorporates survival elements like hunger and thirst, which gradually grow over time. Supplies such as food and water can be found to battle the hunger and thirst. If the player fails to properly quench their hunger and thirst, the player's character will eventually die thus, continuing the cycle of life and death in the game. Unlike other similar projects there is no plan to add player vs player (PvP) combat.</p><p>The game is currently in a stable release but still in early development with many features yet to come and current features to be further developed. Upcoming features include driveable vehicles, character customisation, global-inventory and more.</p><p>SIDE NOTE: Please keep in mind I'm a solo, C# programmer by trade and not an artist working on a tight budget in my free time, so please excuse the sometimes crude animation and 3d modelling, I always strive to create whatever I can myself, however in some circumstances this just is not possible or time/cost effective and so I will occasionally buy pre-made or contracted assets as is the case with the buildings, roads and pavements seen in-game (thanks sinister).</p><p>I hope you enjoy the game and feel free to leave any feedback in the comments/forum or email me at survive@modernzombie.net</p><p>Controls</p><p>W,A,S,D – Movement</p><p>LMB – Fire</p><p>RMB – Aim Down Sights</p><p>E – Interact / Pickup</p><p>E - Eat Food (at Vending Machines)</p><p>R – Reload</p><p>Enter – Open/Send Text Chat</p><p>1 – Primary</p><p>2 – Secondary</p>", "metacritic": null, "released": "2016-10-09", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/95a/95ad71d4bb5dd9947ab03b91e51e1cfc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 176, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Violated Creations"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}