{"id": 11840, "slug": "notch-the-innocent-luna-eclipsed-sinners", "name": "Notch - The Innocent LunA: Eclipsed SinnerS", "name_original": "Notch - The Innocent LunA: Eclipsed SinnerS", "description": "Are my memories reality, or just a dream?<br/>This is an isolated town, a town of memories that have been forgotten by the people.<br/>However, this small town has not been quiet and peaceful since the murders began. <br/>Old memories have been awoken by the tragedy that began this summer, <br/>People are being forced to face the difference between illusion and reality. <br/>These people sometimes escape their daily lives in dreams of the ruin and rebirth, <br/>Only to awaken from dreams to their beloved is gone forever.<br/><strong>Alpha Episode</strong><br/>No matter what the world changes into...<br/>No matter what our lives become of...<br/>I am by your side, and rise to the bloodbath.<br/>Time passes by, <br/>Where are the sinful spirits going? <br/>Whose life are they calling for? <br/><strong>Omega Episode</strong><br/>What is goodness? What is evil?<br/>What is love? What is hatred?<br/>You, have already become a shadow in my dream upon the uncovered reality. <br/>After suffering while searching for you, <br/>I understand how important you are to me. <br/>If I could hold your hand again, I would never let you go despite anything that happens. <br/>My dream is as real as a deep decayed abyss. <br/>The flower blossomed by evil is called redemption.<br/><strong>Game Features</strong><br/><ul> <li>Play through 10+ hours of story with multiple branching routes and 14 unique endings.<br/> </li><li>Over 50 songs created by the most talented composers and musical organizations.<br/> </li><li>A vibrant world brought to life by the artwork of talented artists.</li></ul>", "metacritic": null, "released": "2012-02-17", "tba": false, "updated": "2023-03-03T14:59:43", "background_image": "https://media.rawg.io/media/screenshots/159/1598d842cead51b97026ae7b53cf5c8b.jpg", "website": "http://www.angelsblue.org/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 4, "owned": 41, "beaten": 1, "toplay": 1, "dropped": 1}, "playtime": 4, "achievements_count": 16, "ratings_count": 3, "suggestions_count": 411, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC"], "developers": ["DigitalEZ", "Angels Blue Digital Entertainment"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["DigitalEZ"], "esrb_rating": "Mature"}