{"id": 118550, "slug": "two-minutes", "name": "Two Minutes", "name_original": "Two Minutes", "description": "<p>(TRIGGER WARNING: Suicide)<br/></p>\n<p><em>\"Two Minutes</em>, a short narrative based experience made for the Global Game Jam 2018, allows you to relive the last few moments of the end of the world – chatting to other and seeing how they’re reacting to what is the end of humanity.</p>\n<p>The world is ending – there is only two minutes left. You can see the sun rising quickly on the horizon – an announcement came over the radio to head to a shelter. Yet, you are outside, in the desert, watching the world end. There are a few like you; not yet in a shelter. You can go and talk to them to see why they are sitting here as the world ends.</p>\n<p>These other people will react to you depending on who you talk to first and what you decide in the world. There are short stories of why the world ending doesn’t scare these people or why they are with each other. Each one is meaningful and personal, yet short because you are running out of time. The world is ending, after all. There isn’t any way to stop it.</p>\n<p>It’s an interesting game that gives you a little time to contemplate as you experience the final two minutes of a dying world. A short yet meaningful game at the end of the world.\"</p>\n<p>Jupiter Hadley (Alpha Beta Gamer)</p>\n\n<p>Credits: </p>\n<p>Writing by Greg Buchanan (@gregbuchanan)</p>\n<p>Programming and Sound by Bogdan Vera (@BogdanVera)</p>\n<p>Art by Richard Tongeman (@animtree)</p>\n<p>Sound by Jon Kelliher (@bjornadventures)</p>", "metacritic": null, "released": "2018-06-04", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/183/183265a783ffdaa6258559606853c83e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 114, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["far few giants"], "genres": [], "publishers": [], "esrb_rating": null}