{"id": 11857, "slug": "exoplanet-first-contact", "name": "Exoplanet: First Contact", "name_original": "Exoplanet: First Contact", "description": "Exoplanet: First Contact is a singleplayer, story-driven third person action RPG with survival elements set in a Space Western universe. Here, real and fictional technologies meet the cruel and unforgiving, yet romantic reality of the Wild West. You are Jack Sharp, a daring adventurer, stranded on a dangerous, wild planet known as K’Tharsis. In this hellhole of a world, the local population of both human colonists and native aborigines are oppressed by the soulless Terraform corporation who uses slaves to mine a valuable mineral known as Antigravium. The player can choose either side, a mercenary working for the corporation or as an ally with the oppressed population of K'Tharsis.<br/><br/>Several games, movies and fictional worlds helped to inspire the Exoplanet team’s vision of the RPG experience. Sources include, a space western TV series known as Firefly, the universe of Dune, charismatic characters of Sergio Leone and rich dialogues of Quentin Tarantino's films. The core game design values of Exoplanet were partly derived from best-working principles behind the classic RPG titles such as a living and breathing world of Gothic 2: Night of the Raven, Fallout, TES III: Morrowind, Red Dead Redemption and Borderlands.<br/><br/><br/><br/><ul><li>Explore a dangerous planet where no one can be trusted</li></ul><br/>Exoplanet: First Contact is set in an open world that does not revolve around the protagonist, where each character has his own interests, and each choice has its own consequence. Your decisions will affect the game world on many levels, like start a war between major factions, cause a local store to go out of business, or help a struggling local alcoholic defeat his demons. Go after a huge profit or make a moral stand — the choice is yours.<br/><br/><ul><li>Develop a unique character to match your own playstyle</li></ul><br/>The RPG system of Exoplanet opens up a lot of options for the player. Become a long-distance sniper or a silent assassin who combines camouflage and close-range weapons. Become a charismatic silver-tongued devil or a skillful craftsman that can utilize the full potential of the crafting system.<br/><br/><ul><li>A captivating story stoked by ambitions, greed, treachery and moral choices</li></ul><br/>Pursuing his personal goals our hero gets himself involved with a new Gold Rush, meets people with big dreams and ambitions, hits huge scores and witnesses subsequent bloody developments. The personal quest of Jack Sharp leads him deep into the grim history of Exoplanet. Find out why a flourishing native civilization collapsed, by exploring old ruins that hint at a scale of lost glory. Dig out the hidden reports of Terraform Corporation's inhumane genetic experiments. And that's just a taste of things that a curious player might uncover.<br/><br/><ul><li>Craft your own weapons and gadgets</li></ul><br/><ul><li>Complete 24 hour day / night cycle</li></ul>", "metacritic": null, "released": "2016-12-09", "tba": false, "updated": "2023-02-07T02:24:59", "background_image": "https://media.rawg.io/media/screenshots/1d6/1d6030e5e65b3810b06d6a948ce870a6.jpg", "website": "http://alersteam.com", "rating": 0.0, "rating_top": 1, "added_by_status": {"yet": 5, "owned": 78, "beaten": 1, "toplay": 5, "dropped": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 5, "suggestions_count": 508, "game_series_count": 0, "reviews_count": 5, "platforms": ["PC"], "developers": ["Alersteam"], "genres": ["Action", "RPG", "Indie"], "publishers": ["GrabTheGames"], "esrb_rating": null}