{"id": 118519, "slug": "procedural-generation-in-four-seasons", "name": "Procedural Generation in Four Seasons", "name_original": "Procedural Generation in Four Seasons", "description": "<p>Procedural Generation in Four Seasons is a Score Attack bullet hell inspired by the characters of the Touhou Project. Here, you fight one of four seasonally-themed bullet patterns and attempt to rack up the most points as possible before losing all of your health.</p>\n<p>Controls:</p>\n<ul><li>Arrow Keys to move</li><li>Z (hold) to shoot</li><li>X (press) to bomb (3-second bullet clear)</li><li>Shift (hold) to focus (slow movement and show hitbox, also reduces number of player shots.</li><li>Esc (press) to pause (and view score)</li><li>Left Mouse Button (click) to select which pattern you will play against.</li><li>R (press) go back to the menu</li></ul>\n<p>You get points for shooting at and hitting the boss during each attack. You lose points (and health!) if you get hit by a bullet (but this will also clear away other nearby bullets).</p>\n<p>On the menu, you can move your player around the screen to select a difficulty. This ranges from the very left (Easy) to the right (Lunatic).</p>\n<p>As of right now, only three of the four planned attacks have been implemented.</p>\n<p>This game was created with Game Maker Studio Pro 1.4.1772 and will work on Windows and Wine 2.20 (for macOS Sierra).</p><p>Ghostly Meadow ~ \"Creeping Spring\" uses a rule-based procedural generation algorithm that helps the bullets shape clusters of vines and flowers across the screen.</p><p>Frost Arcanum ~ \"Winter Labyrinth\" uses the randomization of parameters to create complex spirals of bullets (and lasers when playing on Lunatic mode).</p><p>Living Dance ~ \"Pulse of Autumn\" uses an evolutionary procedural algorithm to adjust bullets to aim in a way that changes each wave's aiming behavior depending on how the player has dodged the previous waves.</p>", "metacritic": null, "released": "2017-11-13", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/f62/f62649b50bc40826930608a84f26505d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 209, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Joe Crimi"], "genres": ["Action"], "publishers": [], "esrb_rating": null}