{"id": 11852, "slug": "wakfu", "name": "WAKFU", "name_original": "WAKFU", "description": "<p>Wakfu is a turn-based MMORPG developed by Ankama games. This is an indirect sequel to 2004 game Dofus. </p>\n<h3>Setting</h3>\n<p>The game takes places in the same universe as Dofus but in 1000 years after the events of the previous game. The player must defeat an ogre named “Ogrest” which presumably made the world flood. </p>\n<h3>Gameplay</h3>\n<p>The game follows a player-created avatar, which can choose one of eighteen classes available in the game. Each one has several unique abilities not available to other classes. Unlike other MMO RPGs, the player gets all of the classes’ abilities from the start and can only strengthen them as they progress. After completing early sections of the game, the player can also join one of many in-game nations. The nations control parts of the world and are ruled by the real-player governor. The governor can appoint up to seven other players to run his administration. Each nation has its laws that can be changed by the governor. Players that break the law become outlaws and can be killed by other players without any penalty. <br />\nLike in other MMORPG, character progression depends on the experience they get. To get new levels, players can complete the quest, fight mobs and explore the dungeons. The combat in Wakfu is turn-based and incorporates some elements of tactical role-playing games.</p>", "metacritic": 76, "released": "2014-09-18", "tba": false, "updated": "2024-04-06T13:10:07", "background_image": "https://media.rawg.io/media/screenshots/0a2/0a290bb05ca0d2d0621e70f231a86335.jpg", "website": "http://www.wakfu.com", "rating": 2.97, "rating_top": 4, "added_by_status": {"yet": 49, "owned": 1341, "beaten": 7, "toplay": 4, "dropped": 99, "playing": 6}, "playtime": 2, "achievements_count": 154, "ratings_count": 123, "suggestions_count": 331, "game_series_count": 0, "reviews_count": 123, "platforms": ["PC", "macOS", "Linux"], "developers": ["Ankama Studio"], "genres": ["Adventure", "RPG", "Strategy", "Massively Multiplayer"], "publishers": ["Ankama Games"], "esrb_rating": null}