{"id": 11868, "slug": "nancy-drew-last-train-to-blue-moon-canyon", "name": "Nancy Drew: Last Train to Blue Moon Canyon", "name_original": "Nancy Drew: Last Train to Blue Moon Canyon", "description": "<p>Nancy Drew®: Last Train to Blue Moon Canyon is a first-person perspective, point-and-click adventure game.  The player is Nancy Drew and has to solve a mystery. Explore rich environments for clues, interrogate suspects, and solve puzzles and mini-games.<br />\nThe Hardy Boys have invited you, as Nancy Drew, on a train ride out West hosted by beautiful and prominent socialite, Lori Girard.  Lori has gathered the greatest minds in mystery to solve a century-old secret and the haunted train is their best clue.  The luxurious train once belonged to Jake Hurley, who set out long ago to find the mother lode during mining mania.  Years later, Jake&#39;s train was found in Blue Moon Canyon with the engineer slumped over in the car - dead.  Jake had mysteriously vanished... Climb aboard as Nancy Drew and see if you can uncover the truth at the end of the line!  Dare to Play.™<br />\nMeet the Hardy Boys® as they ride the rails of adventure.<br />\nFind secrets in the train’s caboose, dining car, master suite.<br />\nPlay pachinko, sort heirloom dolls, and be a short order cook.<br />\nExplore a crypt, mining museum, and Jake’s mine.<br />\nUse the camera cell phone to take pictures and call for hints.<br />\nErase mistakes by using the ‘Second Chance’ feature.</p>\n<p>About The Nancy Drew Adventure Series<br />\nThe original #1 selling PC adventure series.<br />\nSee a comparison of the Dossier and Adventure Series</p>", "metacritic": 77, "released": "2005-09-15", "tba": false, "updated": "2024-03-23T11:29:55", "background_image": "https://media.rawg.io/media/games/fe2/fe23435cc2072519574e3cd732e948a6.jpg", "website": "https://www.herinteractive.com/shop-games/nancy-drew-last-train-to-blue-moon-canyon/", "rating": 4.12, "rating_top": 4, "added_by_status": {"yet": 3, "owned": 63, "beaten": 25, "toplay": 3, "dropped": 5}, "playtime": 5, "achievements_count": 0, "ratings_count": 17, "suggestions_count": 507, "game_series_count": 0, "reviews_count": 17, "platforms": ["PC"], "developers": ["HeR Interactive"], "genres": ["Adventure"], "publishers": ["HeR Interactive"], "esrb_rating": "Everyone"}