{"id": 118658, "slug": "defial", "name": "DEFIAL", "name_original": "DEFIAL", "description": "<p><strong>DEFIAL</strong> is a fast-paced, high difficulty, first person experience. Mechanics are inspired by the classic shooters of the old days but have been designed to be more skillfully demanding of you.  Use double jumps, dashes,  and obliterating weaponry against a merciless enemy onslaught. Shoot, Dodge, Defy, or DIE in this unforgiving fast-action combat shooter.<br/></p>\n<p>You volunteered to test out the brand new Hyper Carbon Battle Suit aboard Orbital Research Vessel 7, and you're put to sleep allowing the suit to synchronize with your neurological system. After the 12 hour process, you awaken to an unexplained emergency lock down. Someone has gained unauthorized control over the entire ship and its AI, and there's no one around to explain to you how or why. Find out what happened and deal with the enemy accordingly. An Army of combat drones stands between you and the vessel's command control room, and you're lucky to be the only one strong enough to get there. </p>\n<p><strong>FEATURES </strong></p>\n<p>*Fast-action gun play and movement, think fast or DIE </p>\n<p>*Tougher enemy combatants, be relentless or FAIL </p>\n<p>*Handful of powerful weaponry, each one serving a PURPOSE </p>\n<p>*No limit on max ammo, find it; TAKE IT </p>\n<p>*Unforgiving battle scenarios, make every decision COUNT</p>\n<p><strong>GOODIES </strong></p>\n<p>*Secrets </p>\n<p>*Infinite ONSLAUGHT mode</p>\n<p>*Original metal soundtrack</p>", "metacritic": null, "released": "2017-11-24", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/8da/8da5b99cdc72e4016f0bf254d7129fc5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 171, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["EyeBladeStudios"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}