{"id": 118656, "slug": "soar", "name": "Soar", "name_original": "Soar", "description": "Soar<p>Soar is one of my old projects I never released outside one finnish Game Maker forum. It was made in one week for a christmas game contest a year ago (which it won.)</p><p>Inspiration for this project was that I wanted to make something \"deep\", so I ended up with a dialogue based puzzle platformer. It really doesn't even try to accomplish anything new with it's genre but it has nice atmosphere and (sometimes? : D) interesting dialogue.</p><p>The game itself takes probably from 10 minutes to one hour to beat (based on for how long you happen to get stuck while solving puzzles.) It could be counted as an game prototype, but I'm never going to continue developing this game.</p><p>You move with arrow keys and toggle between fullscreen and windowed with F.<br/> Also you can get stuck in some levels which include dynamic boxes and you restart level with R.<br/> Also you can't save so you must beat this game on one sitting. Still keep in mind it's super easy to get back to certain level after you have solved those levels for once (my personal record beating this game is 3 minutes.)</p><p>Feedback is always appreciated but keep in mind this game is what is it and will not be improved. I would have liked to remaster this game with some tweaking,<br/> Unfortunately, I have lost my project files so that is not possible.</p><p>The song featured in this game (Crystal Waters) is copyright free and downloaded from purple-planet.com <br/> Also that vector tree is downloaded from https://clipartfox.com/download/e1708fbe4f97675cbcd57ee35ae0c7a84e374982.html<br/></p>", "metacritic": null, "released": "2017-03-03", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/196/196daef58553c82504e761b2126775a5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 11, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Igno"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}