{"id": 118638, "slug": "genesis-itch", "name": "Genesis (itch)", "name_original": "Genesis (itch)", "description": "<p>Genesis - The Dawn of Humanity is an Intellivision-inspired retro survival game. You are a caveman struggling to survive the harsh ice age world. You must explore the world, find supplies, avoid dangerous animals, invent the technology that built civilization and raise a family.</p>\n<p>Survival is not easy: you must find food for your family, discover and maintain fire to survive the winter, hunt animals for food and clothing, avoid poison and care for your children. Before civilization there is no medicine to heal you, all damage is permanent and lives are too easily cut short. You need patience and smarts to avoid dying of exposure, hunger or injury.</p>\n<p>Done in the style of an Intellivision game the dawn of humanity is explored through the lens of a console from the dawn of videogames. There is no save function and any map transfer resets the map data. Many players will find this game very difficult, but a Training Mode exists to let people explore and learn without taking damage. The manual provides a lot of information, no in-game tutorials exist, the game functions almost exactly how original Intellivision games did, just bigger.</p>\n<p>The Manual and Keypad Overlays documents provide you with a lot of information. It is highly recommended to give them a read before playing to learn the controls and learn some of the context needed to survive the paleolithic era.</p>\n<p>As standard for the era, no music is included in the game, but sound effects can provide important gameplay information. The world starts shrouded in darkness. You must explore and discover the world to find the inspiration and resources you need to survive. Dangerous animals roam the land, but sound clues can help alert you to the danger.</p>", "metacritic": null, "released": "2017-01-27", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/8eb/8ebff32f058f05cb4a470d3e11a72b11.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 102, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["KHConcepts"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}