{"id": 11877, "slug": "xfield-paintball-3", "name": "XField Paintball 3", "name_original": "XField Paintball 3", "description": "Please read this before buyingXFP3 is a game in early stage and permanent development with the community. <br/>We want to inform you that the gameplay is not yet completly balanced: We continue to change it according to the community feedback.<br/>The list of features already included in the game is discribed below. It is still short, because our priority is to focus on the gameplay. We will add more features step by step, but our purpose is to create - first - a super cool gameplay highlighting the natural strategical and tactical aspects of paintball.<br/>Since the game has been released recently, you may not find enough players on the servers at every hour of the day, but the community is still growing.<br/>The game is playable in Europe and North America with a good latency. Other areas are not yet playable with a good gaming experience.<br/><br/><strong>Your support is essential but this brings us to advise those who do not want a game in development to wait before joining our community. </strong>Why buy the game now? This said, we work hard to give an exciting paintball gaming experience to those who buy the game at this stage. You will be part of our adventure, participating to a brand new game development, with regular updates.<br/><br/><strong>By buying the game now, you help our indie studio to go ahead, financing the dev and giving your opinion on what must be done to make the game you really want.</strong>What is now included in XFP3? - A very realistic paintball physics engine reproducing the unique paintball shooting lines (air friction simulation).<br/><br/>- Quick play mode (real time multiplayer): 1v1 to 5v5 (adjusted by the dev team to reduce waiting time on servers).<br/>- Walk in the Field – WIF (solo mode): For tutorial purpose, or IRL competition paintballers training.<br/>- A two phases Gameplay, before and during each round:<br/><br/> <strong>1. Before each round - Strategy time: </strong><br/> <ul> <li>The captain builds a team strategy and shares it using dedicated communication tools.<br/> </li><li>3 different performance profiles are available:<br/> <ul class=\"bb_ul\"> <li>Tactician with special communication power<br/> </li><li>Rusher with run boost<br/> </li><li>Shooter with accuracy boost<br/> </li></ul> </li><li>The Captain gives directions to each teammate: where to go and where to shoot…<br/> </li></ul><br/> <strong>2. During each round – Tactical and play time:</strong><br/> <ul> <li>Each player uses an original cover mode, with offensive paintball moves (snap, lean, hand switching) while accuracy is boosted vs when running.<br/> </li><li>Each player can use a communication tool for tactics sharing. The tactician is, as IRL, the player who informs the team about opponents’ position. An exclusive power let him do that once a round for a few sec.<br/> </li></ul><br/>- Fire rate of 10.5 shots/second and per player (up to 200 simultaneous trajectories).<br/>- Official layouts of all international leagues (NXL, Millennium, PALS, CXBL, UWL, SARPL) before the IRL events for training purpose.<br/>- Scenario map SC Village.<br/>- Progressive low latency servers deployment in USA then in Europe first. <br/><br/>To learn more about the game, please read our Guide: http://steamcommunity.com/sharedfiles/filedetails/?id=938763797<br/><br/>To chat with the team (we have to dev a game, so we are not 24/24 on it ;-): https://discord.gg/mTHTAcTWhat is coming next in matter of days/weeks? - On the first line: Gameplay improvement until community satisfaction.<br/>- Continuous bug fixing.<br/>- Server browser (real time multiplayer) : Play 5v5 with friends on your favorite maps.- LAN.<br/>- New animation set.<br/>- New maps and layouts.What is coming next? - Competitive mode.<br/>- Team management.<br/>- Field Configurator.<br/>- Other community whishes ;-)Why did we make a paintball videogame? Paintball is an amazing sport, offering intense competition and strong team experiences. On the surface it may appear to be a straightforward shooting game, but it is not—strategy is essential for success. Your team’s strategy, tactics and coordination may not be obvious at first sight but make all the difference between mindless shooting and truly playing the sport of paintball.<br/><br/>There are two more ingredients that make our paintball game unique. The first is realistic ballistics and the second is the maps, or layouts, designed by pros for competitions. The quality of those layouts relies on their real life “level design” that makes them suitable for international competition. We don’t forget the fun of playing on scenario maps with friends where strategy and tactics are also essential.<br/><br/>The XField Paintball Studio Team wants to create a new video game experience, based on the most realistic and immersive simulation possible of the sport of paintball, including features that reveal the depth and natural gameplay of this sport. The game is developed with pro players to address both the paintball community and the PC player without paintball experience.<br/><br/>In a nutshell, we want to create the Official Paintball Video Game, based on:<br/><ul><li>\tA fully immersive technical and design environment.<br/></li><li>\tGameplay based on team strategy, tactics and communication.<br/></li><li>\tAnd a strong, community-driven update plan.</li></ul>The TeamXField Paintball 3 is a small team, devoted to the development of the game. We have now 2 devs and 2 designers, 3 of theme are part time-teachers in a video game school. <br/>XFP3 is powered by one of their creations, a custom designed FPS-Sport multiplayer hybrid engine and a new concept of gameplay. <br/>We are four others to regularly contribute to the project, in communication or marketing (website, Facebook, store, Discord, mailing, press, …) or to go to meet the community at many paintball events, to find partners. Two of us are highly invested in the paintball community for many years, like Gael Chauvet in the media or Loic Voulot (Tonton captain or National Technical Director of the Paintball French Federation).<br/>And Rachel who helps us a lot for accounting and legal points.<br/>Most of us have part time job outside of the studio to make this project possible. We also had some support of pro animator or young devs. We want to thank them! We hope to be able to have them in the team again.<br/>We also thank all those who help the project, like CS Paintball, leagues or brands.<br/><br/>Our expectation is to create a new and exciting paintball experience on PC, for paintball fans first, and maybe tomorrow to contribute to the paintball promotion out of its community.<br/>Thank you for your support and your contribution to XField Paintball Studio.<br/>Help us share our passion for the game.<br/><br/>The XFP3 Team.", "metacritic": null, "released": "2017-05-30", "tba": false, "updated": "2019-08-23T12:12:41", "background_image": "https://media.rawg.io/media/screenshots/491/4919568a5168a30ff6e673584bd2ca03.jpg", "website": "http://www.xfield-paintball.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 13}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 196, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["XField Paintball SAS"], "genres": ["Action", "Simulation", "Sports", "Indie"], "publishers": ["XField Paintball SAS"], "esrb_rating": null}