{"id": 11889, "slug": "nightfall-horror", "name": "Nightfall Horror", "name_original": "Nightfall Horror", "description": "Nightfall: Escape puts you in the shoes of a field journalist who is on a mission to investigate the mysterious disappearances in a remote area. Explore the place, search for leads and use your wits to survive the hidden terrors of the cursed place. Tread carefully, for curiosity may come at a price.<br/><br/><strong>Synopsis:</strong><br/>Ara Cruz, a field journalist finds herself trapped in an old mansion rumored to be a place where people suddenly disappear to. As she struggles to find her way out, she must face the perils that lurk inside the said place. Will she be able to get the scoop she went there for and live to tell the tale, or will the missing victims count increase by one?<br/><br/><strong>Features:</strong><br/><ul><li>Past meets present. Experience classic horror elements that meet modern survival gameplay. <br/></li><li>Fear the unknown. Survive creatures of terror you've never seen before.<br/></li><li>Observation is key. Collect clues and solve puzzles to uncover the mysteries of the mansion.<br/></li><li>Connect the dots. Immerse in the actual tragic events that occurred in the past through haunting visions.<br/></li><li>Fortune favors the brave. Have a closer look at the game's unique art style through the gallery, unlocked by collecting silver coins.</li></ul>", "metacritic": null, "released": "2016-06-28", "tba": false, "updated": "2019-08-28T22:13:37", "background_image": "https://media.rawg.io/media/screenshots/439/439755b80e5e92c9b01a87e8e4ddc1cc.jpg", "website": "http://www.nightfallhorror.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 77}, "playtime": 5, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 433, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC", "Linux"], "developers": ["7 Seals", "Zeenoh"], "genres": ["Adventure", "Simulation", "Indie"], "publishers": ["Zeenoh"], "esrb_rating": null}