{"id": 11882, "slug": "in-the-shadows", "name": "In The Shadows", "name_original": "In The Shadows", "description": "Embark on a short yet captivating journey in \"In The Shadows.\" In this game, players are tasked with manipulating abstract objects, harnessing the power of light and shadow, to cast silhouettes that form familiar shapes and objects.<h3>The Game</h3>The game was crafted as part of a school project in a month and a half with no prior experience in Unreal Engine 5. Every element was created by me, utilizing free assets, and the voice lines were graciously provided by my sister (thanks, sis). Should you encounter any bugs or crashes, please don't hesitate to report them in the discussion section. If you enjoyed this brief adventure, you can support me by purchasing the short soundtrack as a DLC.<h3>Gameplay</h3>Navigate through the game's world using the WASD keys for movement. The mouse allows you to look around and examine your surroundings. When engaging with puzzles, the mouse movement is crucial for rotating them. For additional interaction, right-click and drag the mouse to move puzzles along the last axis of rotation. Interaction with puzzles is made simple by holding 'E'. A hint will be displayed to help you figure out what shape to look for. Press 'Esc' to access the in-game menu. Within this menu, you'll find options to rebind movement keys according to your preferences and adjust various graphic settings to enhance or optimize your visual experience.<h3>Source code</h3>In the spirit of learning and sharing, the source code for \"In The Shadows\" is available on my GitHub, which can be found in the game's information section on the right.", "metacritic": null, "released": "2017-09-28", "tba": false, "updated": "2024-02-02T06:34:40", "background_image": "https://media.rawg.io/media/screenshots/42b/42ba66874aca39a9fef42d8370c6604f.jpg", "website": "http://www.intheshadowsgame.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 25, "toplay": 1, "dropped": 3}, "playtime": 1, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 151, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC", "macOS", "Linux"], "developers": ["Colorspace Studio", "Vakant"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Colorspace Studio", "Vakant"], "esrb_rating": null}