{"id": 11897, "slug": "genius-greedy-mouse", "name": "Genius Greedy Mouse", "name_original": "Genius Greedy Mouse", "description": "<strong>GENIUS GREEDY MOUSE is a clay based puzzle game featuring a host of fun and challenging levels.</strong><br/><br/> <strong>Are you a Genius Greedy Mouse?</strong><br/> You are a mouse, a very, very hungry mouse, living in a large underground world. Luckily, your world is filled with the delightful cheeses that you so desire. If only you could just reach out and eat to your hearts content.<br/><br/> Unfortunately, the life of a mouse is not quite so simple. The cheese is not easy to obtain and many traps and puzzles will hamper your endeavours. Using all your cunning mouse skills, like all crafty mice can, you must find your way to the cleverly located cheeses. Can you eat all the cheeses ‘Greedy Mouse’?<br/><br/> The game plays through a variety of themed levels, encompassing both ingenious puzzles, and amusing diversions. Each level is played a move at a time, giving the player time to plan ahead and oversee the result, step by step. Play as fast or as careful as suits.<br/><br/>Features: More than 110+ regular levels, spread in 12 villages.<br/> Nore than 50+ random generated mazes from a map setup for causel players.<br/> 3 difficulties: Light, Normal and Genius for all regular levels.<br/> High quality clay besed graphics.<br/> Many fun items to push, pull, prod, collect, and run from.<br/> Smash your way thought the puzzled mazes.<br/> Bonus scoring ‘Plump Mouse’.<br/> XOR (A old BBC Micro Game) style gameplay, but with unique pieces and design.<br/> The game does not using timed limit (except some water levels) puzzle design.<br/> Steam Trading cards &amp; Badges to collect (see Badges above, the foil badge is secret here).<br/><br/><strong>Get ready to play the genius created puzzle mazes and try eat some genius placed cheeses!</strong><br/><br/>", "metacritic": null, "released": "2016-08-12", "tba": false, "updated": "2022-09-30T00:42:57", "background_image": "https://media.rawg.io/media/screenshots/0ce/0ce6f20c3d302a83389d66d330efebb1.jpg", "website": "http://studio.otakumaker.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 165}, "playtime": 4, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 128, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Space Fractal", "TempleTiger"], "genres": ["Action", "Adventure", "Strategy", "Casual", "Indie"], "publishers": ["OtakuMaker.com"], "esrb_rating": null}