{"id": 119, "slug": "kona", "name": "Kona", "name_original": "Kona", "description": "<p>Northern Canada, 1970. A strange blizzard ravages Atamipek Lake. Step into the shoes of a detective to explore the eerie village, investigate surreal events, and battle the elements to survive. Kona is a chilly, narrative-driven interactive tale you won&#39;t soon forget.<br />\n&quot;Parabole has created a stunning game of duality, effortlessly blending survivalism with detective work and well-researched history with dying folklore.&quot;<br />\n- Stephen Turner, Destructoid<br />\n&quot;It’s tremendous at creating its distinct atmosphere and then drawing you deeper in. It’s witty, spooky, and achieves an ideal sense of urgency. Weird, clamant and intriguing, this is well worth a look.&quot;<br />\n- John Walker, Rock, Paper, ShotgunSettingOctober 1970. W. Hamilton, a rich industrialist who owns a hunting manor in Northern Canada, reports several cases of vandalism perpetrated against his property. Unable to find out who dared to commit these acts, Hamilton calls Carl Faubert, a renowned private detective to handle the affair.<br />\nIn Kona, Carl becomes trapped up in the deep north, engulfed in an unexpected snowstorm, and is unable to find his client —or any other living inhabitant for that matter. The player incarnated detective Faubert, who must shed light on the mysterious events befalling the area.Key Features Step into a surreal interactive tale of mystery and investigate the perplexing quietness in the entire town<br />\nExplore a vast, frigid Northern environment and battle the elements to survive<br />\nEnjoy the atmospheric soundtrack featuring music by Quebec folk band CuréLabel<br />\nExperience the tale through the omniscient, third-person storyteller<br />\nGo back in time with a vintage look and feel reminiscent of 1970s rural communities</p>", "metacritic": 73, "released": "2017-03-16", "tba": false, "updated": "2024-03-27T15:46:56", "background_image": "https://media.rawg.io/media/screenshots/9ab/9ab4630464e41947a2cef77b2b6263dc.jpg", "website": "http://www.konagame.com", "rating": 3.32, "rating_top": 4, "added_by_status": {"yet": 132, "owned": 1228, "beaten": 71, "toplay": 41, "dropped": 43, "playing": 8}, "playtime": 2, "achievements_count": 148, "ratings_count": 127, "suggestions_count": 364, "game_series_count": 0, "reviews_count": 133, "platforms": ["Linux", "macOS", "PC", "Xbox One", "PlayStation 4", "Nintendo Switch"], "developers": ["Deep Silver", "Parabole"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Deep Silver", "Koch Media", "Ravenscourt", "Parabole"], "esrb_rating": "Teen"}