{"id": 119097, "slug": "blood-slave", "name": "Blood Slave", "name_original": "Blood Slave", "description": "<p>\r\n\tBlood Slave es un juego de acción, sigilo y aventura (Stealth, aventure), en donde debes encarnar a Leonard, un hombre felizmente casado y con dos bellos hijos. Debido a su gusto por el ocultismo, conoce a Melina, una misteriosa mujer con quien tiene encuentros secretos. En una de sus citas clandestinas, Leonard despierta junto a su esposa, quien yace muerta en la habitación de un hotel abandonado, desconociendo el paradero de sus hijos, huye de la policía e inicia la búsqueda de los responsables de la desaparición de sus hijos y el asesinato de su esposa.\r\n</p><p>\n<br/>\n</p><p>\r\n\tEnglish\r\n</p><p>\r\n\tBlood Slave is an action, stealth and adventure game, where you take the rol of Leonard a happily married man with two beautiful children. Due to his likes he meets Melina a mysterious woman with whom he has secret meetings, in one of their underground dates leonard wakes up next to his wife who lies dead on an abandoned and rusty hotel room, unaware of his children's Whereabouts, flees from police and begins a hunt of the responsible for reckoning.\r\n</p><p>\n<br/>\n</p>VideosBlood Slave: Comic<br/>\n<p>\n<br/>\n</p>RakoonsFreddy Giovanni Parra Acuña<p>\r\n\tArtista 2D. Tecnólogo en diseño y desarrollo de vídeo juegos con experiencia en Photoshop e Illustrator. Creador del comic y los menus.\r\n</p><p>Email: freddygpa@gmail.com </p><p>\n<br/>\n</p>Holman Leonardo Alvarez Morales<p>\r\n\tIngeniero de sistemas con 8 años de experiencia en desarrollo de software, tecnólogo en diseño y desarrollo de vídeo juegos con 3 años de experiencia en Unity. Creador del guión del juego y la historia, programador de la IA (Inteligencia artificial), la interfaz de usuario y el HUD (Heads-up display).\r\n</p><p>\r\n\tEmail: holmanl7899@hotmail.com\r\n\t<br/>\r\n\tTeléfono: (57) 3204288498\r\n\t<br/>\r\n\tBogotá, Colombia\r\n</p><p>\n<br/>\n</p>Jair Andres Castro Cuesta<p>\r\n\tLicenciado en física,  tecnólogo en diseño y desarrollo de vídeo juegos con experiencia en Unity, diseñador y modelador en 2D y 3D, diseñador y modelador de niveles y accesorios.\r\n\t\r\n</p><p>Email: jairandresc@gmail.com </p><p>\n<br/>\n</p>Ramón Andres Cuellar<p>\r\n\tArtista 2D, 3D. Tecnólogo en diseño y desarrollo de vídeo juegos con experiencia en Photoshop e Illustrator. Programador Unity. Diseñador de las tarjetas de poderes y el HUD. Modelador de personaje SWAT.\r\n</p><p>Email: andrescuellar1212@gmail.com </p><p>\n<br/>\n</p>William A. Perez<p>\r\n\tArtista 3D. Tecnólogo en diseño y desarrollo de vídeo juegos. Programador Unity con experiencia en Shaders. Modelador y animador del personaje principal, programador de mecánicas del personaje y pluggin Stepper desarrollado para la IA.\r\n</p><p>Email: williamzeus91@gmail.com \r\n</p>", "metacritic": null, "released": "2015-06-25", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/7d3/7d30e28c9362924e120a0c7bb70fd85b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 311, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["RakoonGamesColombia"], "genres": ["Action"], "publishers": [], "esrb_rating": null}