{"id": 119187, "slug": "towa-towa", "name": "Towa Towa", "name_original": "Towa Towa", "description": "<p>\n<em>\"Towa Towa isn't a minigame with a bird racing theme pasted on. This is you literally counting the chirps these birds make as you judge this contest. That's GREAT. That's all there is. That's enough.\"</em> - <strong>Rock, Paper, Shotgun</strong></p>\n<p>\r\n\tThis is a videogame created using documentary process based on time I spent with the Guyanese bird-racing community in New York.\r\n</p>\n<p>\r\n\tBird Racing is a sport played in Guyana and Trinidad as well as in the immigrant communities in Queens. It is actually more like bird-debating, as they sit two birds next to each other and see which one can tweet the fastest and angriest. Male Towa Towa finches, when placed facing each other, chirp aggressively. A number is chosen and bets are made as to which bird will reach the chosen number of chirps first. It's a weird, macho subculture centered around tiny birds. Some people say that raising racing birds for them is like a drug, and in the Georgetown, Guyana, marketplace you can find CD's filled with the sounds of birds chirping to train the birds to chirps louder, longer and faster. People smuggle birds into the country in hair curlers, so the FBI is after them and if you try to hang out with them in Phil Rizzuto Park in Jamaica, New York, they'll tell you to fuck off.</p>\n<p>Featured in the 2014 <em>FILE Media Art</em> exhibition, part of the 15th Electronic Language International Festival, São Paolo, Brazil, as well as Fonlad 2014's <em>Web Art Show Room, </em>Maryland Artist Registry Juried Exhibition, and <em>The New River</em>: a journal of digital writing and art.</p>\n<p>Play on GameJolt or Kongregate.</p>", "metacritic": null, "released": "2015-03-02", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/b56/b56f3fb5be6febdf0da9cdaedc9a0e60.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 63, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["AaronOldenburg"], "genres": ["Sports"], "publishers": [], "esrb_rating": null}