{"id": 11915, "slug": "a-demons-game-episode-1", "name": "A Demon's Game - Episode 1", "name_original": "A Demon's Game - Episode 1", "description": "Sometimes you have to commit yourself to achieve something in life,you need to sacrifice yourself for the greater good, and triumph over all barriers between you and that goal. My name is Daniel. I used to live a normal life... I had a decent job, a beautiful wife... but everything changed, and now I have to get her back and save myself in the process. I'm ready to go to the deepest corners of hell if I have to, if it means I get to see her again.<br/>The plot may seem to be simple and somewhat cliché, however we ensure you that there will be a level of depth beyond the generic indie horror game story. For fans of games with deep, well thought out stories, you will not be disappointed.<br/><br/><br/> <ul><li><strong>Areas</strong><br/>You will explore a variety of areas, each one vast and full of its own secrets. Each enemy you encounter is unique in its traits and tendencies. You will be forced to be quick on your feet and to outsmart and defeat the scourge separating you and your goal.<br/>\"A Demon's Game\" puts an emphasis on the importance of exploration in an atmospheric game. Players will be rewarded for taking time to venture off the beaten path, slowly uncovering the details of your situation.<br/><br/> </li><li><strong>Demons</strong><br/>Each demon you face in game behaves differently, having its own strengths and weaknesses to consider in fighting it. You will need to discover the intricacies of each in order to progress further through the story.<br/><br/> </li><li><strong>Player Choice</strong><br/>In \"A Demon's Game\" you can make your own choices, which will affect your future like you'd expect, but the choices are all unique in a way that not only changes where you go and what you do but the end to your journey as well, the game currently has over 18 endings for you to discover. From something as big as refusing to kill a demon or something as small as not going through a specific area, everything will be taken into account when you play the game.<br/><br/> </li><li><strong>Branching Paths</strong><br/>Long gone are the days of going from point A to point B, in \"A Demon's Game\" you'll often find yourself with multiple exits, each of them leading to a different area, where you want to go...is up to you.</li></ul>", "metacritic": null, "released": "2016-12-08", "tba": false, "updated": "2023-12-18T17:40:18", "background_image": "https://media.rawg.io/media/screenshots/c9a/c9a5cfb16acbe14cb683e33afadda0fc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 51}, "playtime": 2, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 277, "game_series_count": 0, "reviews_count": 1, "platforms": ["Linux", "PC"], "developers": ["RP Studios", "Firebal69"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["RP Studios"], "esrb_rating": null}