{"id": 11928, "slug": "the-moonstone-equation", "name": "The Moonstone Equation", "name_original": "The Moonstone Equation", "description": "Scientists love a good mystery<br/>The Moonstone Equation is a single player puzzle/platform game about science and curiosity presented in a modern pixel art style. It's set in and around a remote hilltop research facility built specifically to investigate some mysterious inscriptions carved into pieces of moon rock found buried within the hillside. The player guides our protagonist Alice as she arrives at the facility and starts to live and work with the various scientists theorists and oddballs that already call this place home. The Moonstone equation draws its design inspiration from games like Fez, Monument Valley, The Talos Principle and Ico. The Player is free to explore and investigate a world full of puzzles as they like, discovering (and shaping) the narrative as they go. With very little threat and no 'enemies'. It's the perfect game for those inquisitive people who enjoy a good puzzle and the time and space to crack it.Features<br/><strong>Hand-crafted modern pixel-art</strong><br/>The game is created using bespoke tools running within a custom engine designed to present a crisp high definition pixel-art world using modern rendering technology.<br/><br/><strong>Puzzles, lot of them</strong><br/>You'll find lots of things to solve. Some more obvious than others. Each created using nearly 20 years of game and puzzle making experience<br/><br/><strong>Persistent living world</strong><br/>The Moonstone Equation is a puzzle solving adventure within a world that changes and responds to when (and how often) you choose to play. If it's night where you are, then it's night at the facility. This responsiveness also extends to the colourful characters that populate the game world. Don't worry you don't have to get up at midnight just to solve bits of it, but you might discover something interesting if you do.<br/><br/><strong>Duration: 12+ hours</strong>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T22:13:35", "background_image": "https://media.rawg.io/media/screenshots/2ae/2ae9151667d17659e3d94ff6535fa8fc.jpg", "website": "http://moonstoneequation.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 21, "ratings_count": 0, "suggestions_count": 149, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Andy Buck"], "genres": ["Indie"], "publishers": ["Hippy Lizard"], "esrb_rating": null}