{"id": 11920, "slug": "racket-fury-table-tennis-vr", "name": "Racket Fury: Table Tennis VR", "name_original": "Racket Fury: Table Tennis VR", "description": "After an all-out war that took almost 2 millennia and claimed many lives of the Zen - Racket Fury Tournament emerged as the remedy to maintain peace in the Crown Galaxy. A fast-paced, strategic game that became an interplanetary phenomenon, bringing all the Zen together. As an aspiring Zen, you are challenged to join the most prestigious team that dominated the entire competition - the Division of Steel. Are you up for the challenge?<br/><br/><ul><li>SINGLEPLAYER EXPERIENCE: You’re about to face 4 members of the infamous Division of Steel per Cup. Beware! The higher the Cup, the more demanding and troublesome it gets!<br/><br/></li><li>CHALLENGING AI: Thanks to a particularly advanced Artificial Intelligence in singleplayer, every opponent you’re going to play against will have their own temper and an utterly unique style of play.<br/><br/></li><li>EVER-GROWING CHARACTER: Enhance your skills and become stronger with every match to be able to challenge the most renowned and agile representatives of the Division of Steel. <br/><br/></li><li>MOCAP ANIMATIONS: To deliver the most realistic characters’ movements,  we relied upon motion capture data for our animations. The actors participating in the recording were in fact professional table tennis players, which translates each player’s swing into one, fluid motion and makes the rivalry as realistic as possible.<br/><br/></li><li>ADVANCED PHYSICS: As expected in VR, our aim was to address the simulation aspect of the game to provide the real table tennis experience. We spent countless hours on developing our own physics from scratch. Based on scientific research, it’s extremely realistic and translates your moves in the most accurate manner.<br/><br/></li><li>MULTIPLAYER: Racket Fury offers up not only singleplayer campaigns but also multiplayer mode that allows you to challenge the players from every corner of the world and defeat them with your smart strategy and unbeatable technique.<br/><br/></li><li>WORKSHOP: Each victory provides you with valuable assets that allow you to develop your unique character. The more skillful you become, the more admirable in your rivals’ eyes you become.</li></ul>", "metacritic": null, "released": "2017-07-27", "tba": false, "updated": "2019-08-28T22:13:36", "background_image": "https://media.rawg.io/media/screenshots/271/2719036809e10b96ced1ab0e75f92229.jpg", "website": "http://10antshill.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 34, "beaten": 2, "toplay": 1, "dropped": 2, "playing": 1}, "playtime": 1, "achievements_count": 21, "ratings_count": 4, "suggestions_count": 210, "game_series_count": 0, "reviews_count": 4, "platforms": ["PC"], "developers": ["10Ants Hill"], "genres": ["Simulation", "Sports", "Casual", "Indie"], "publishers": ["10Ants Hill"], "esrb_rating": null}