{"id": 119340, "slug": "clunk-blipbloop", "name": "CLUNK (BlipBloop)", "name_original": "CLUNK (BlipBloop)", "description": "<p><strong>OVERVIEW</strong></p>\n<p>Clunk is a simplistic multiplayer shooter, where your goal is to survive endless waves of blobby foes by building bases and filling your enemies with blazing lead.<br/></p>\n\n<p><strong>INSTRUCTIONS<br/></strong></p>\n<p>Use W A S D to move and your mouse to aim and shoot, R will reload the currently selected weapon. Pressing right click on a building unit or shop will open an interact menu. Pressing right click while armed will zoom out the weapon. It is also highly recommended that you look over this page to understand the basics of this game.<br/></p>\n\n<p><strong>The Enemy<br/></strong></p>\n\n<p>These are, early on, the primary source of money in Clunk. Killing them will award you blobs which you can sell at shops to make money. Touching them will award you a slow and painful death. They only spawn during night.<br/></p>\n\n<p><strong>The Player</strong></p>\n\n<p>These greedy bastards will stop at nothing to steal your money, blobs, or life. But on the other hand, killing one will instantly reward you their blobs, money, and if you can pick them up before anyone else, weapons.<br/></p>\n\n<p><strong>The Shop</strong></p>\n\n<p>Ah the shop, your best friend and worst nightmare. One one hand the shop has a protective field around it, stopping enemies from slaughter you. It can even give you items, such as health, guns, guns, more guns, and building units. But on the other hand it also charges money. (Confused with the UI or having issues buying and selling? Head down to \"The Shop UI\")<br/></p>\n\n<p><strong>The Resource</strong><br/></p>\n\n<p>Known as resources, and only as resources, the resource is your second path to profit town (granted its a slower journey); shooting one will award you blobs to sell at shops. Setting up a Harvester near one will constantly award revenue!</p>\n\n<p><strong>The Flag</strong><br/></p>\n\n<p>The flag is hugely important, as it generates a force field around it stopping enemies from entering. Not only that, it also allows you to purchase and place building units such as turrets and harvesters within its range (Placed through the space menu).</p>\n\n<p><strong>The Buildings</strong></p>\n<br/>\n<p>Buildings can be purchased in shops and are often undeniably useful and come in 4 basic types (As of now there are only 8, this will be expanded upon later updates).</p>\n\n<p><strong>The Harvester Unit</strong><br/></p>\n<br/>\n<p>Harvesters mine blobs from near by resources. Upgradable.</p>\n\n<p><strong>The Healer Unit</strong><br/></p>\n<br/>\n<p>Healers heal all players with in its radius. Upgradable.</p>\n\n<p><strong>The Turret Units</strong><br/></p>\n\n<p>Turrets are tracking, automatic, deployable, sentries that target either players or bots. They will require reloads which cost money. Not upgradable.</p>\n\n<p><strong>The Shield Generator </strong></p>\n\n<p>This magical spiny unit spawn a bubble around it, preventing enemies from entering. This also allows for the extended placement of other units.</p>\n\n<p><strong>The Harvester Manager <br/></strong></p>\n<br/>\n<p>This unit allows for a massive boost in harvester effectivity by combining the revenue of all scanned units with in its range.<br/></p>\n\n<p><strong>The HUD</strong></p>\n<p><em>\n</em></p>\n\n<p><strong>The Shop UI<br/></strong></p>\n\n<p>The shop UI appears to be the natural enemy of all well meaning newbies, here are some tips to help you on your way. First things first, <strong>click and drag</strong> to scroll threw the shops items. Second, pressing \"Sell Blobs\" in the upper left is how money is made and a crucial step in any attempts to purchase an item. Finally to exit the shop UI, either click outside the UI box or move your player out of the shops range.</p>\n\n<p><strong>The Quick UI<br/></strong></p>\n\n<p>The Quick UI, activated by holding space, allows you too do two main things. Its first function (Upper) is to place down a flag, allowing for the purchase and placement of units. While its second function is to allow the player to teleport to there flag (Lower), after pressing the teleport button you must hold still for 5 seconds to jump to your flag.<br/></p>\n<p><strong>Please note that this game was created in 30 days for a game jam and likely has some bugs, other than that please enjoy! (More units coming soon!)<br/></strong></p>\n\n<p>A quick note on the sounds used in Clunk, the vast majority were found from numerous royalty free sources; however if you are legal owner and have proof of ownership and would like your sound removed from the game do not hesitate to contact me at blipbloopdev@gmail.com<br/></p>", "metacritic": null, "released": "2018-05-12", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/922/9227d215d684a772f58308dcd07e2c67.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 37, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["BlipBloop"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}