{"id": 119303, "slug": "puppynauts-catsteroids", "name": "Puppynauts & Catsteroids!", "name_original": "Puppynauts & Catsteroids!", "description": "<p><strong><em>Puppynauts &amp; Catsteroids</em></strong> is an action-packed space adventure in which you join the <em>Protectors of the</em> <em>Union of Planets </em>(P.U.P.) or the <em>Confederacy of Asteroid Termination</em> (C.A.T.) in a race to mine riches from the bountiful asteroid belt between Mars and Jupiter. </p><p>Mine asteroids such as:</p><ul><li>Carbone - one of the most plentiful materials in the universe and essential for building P.U.P.'s fleet of Dogships.</li><li>Iyarn - Central to the feline Armada of C.A.T., Iyarn is another abundant element necessary to build Yarn Frigates and Capsules. </li><li>Purridium - a rare element and a form of currency in the solar system. </li><li>Paw-lladium - a component used in fuel cells for Dogships.</li></ul><p>Will you join forces with Admiral Felina on her quest to build the galaxy's most powerful armada? Or will you help Captain Barker procure materials to clean up their homeworld?</p><p>HOW TO PLAY (NOTE: This build only works with an XBOX controller that works with Windows.)</p><p>OBJECTIVE: Players most work together to reach a common goal by mining the certain amount of resources from asteroids within the time limit. Once they reach the goal, they can compete against each other to see who can mine the most resources before time runs out.</p><ul><li>Move with Left Joystick</li><li>Boost with Left Bumper</li><li>Attach to asteroids by landing on it (without going too fast!)</li><li>Press A to \"mine\" the asteroid</li><li>Detach with B</li><li>PROTIP: Bump into other players as they're mining asteroids to knock them off!</li></ul>", "metacritic": null, "released": "2016-09-18", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/728/72820ff5f057be7c916bcd2f6d9d7d69.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 60, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["thedonz"], "genres": ["Action"], "publishers": [], "esrb_rating": null}