{"id": 119482, "slug": "super-ultimate-cyberpunk-assassin", "name": "Super Ultimate Cyberpunk Assassin", "name_original": "Super Ultimate Cyberpunk Assassin", "description": "<p>Super Ultimate Cyberpunk Assassin is a fast-paced top-down shooter that asks you to make tactical decisions under pressure. Against the tick of the clock, you can take gambles to try and finish the game faster but if you fail you'll be dead, and the timer will be that much further along. </p>\n<p>It's also the first time i've programmed anything, a prototype with rough art and off the shelf sound to get a feel for it, and I think the game play itself is fun and robust. I'd love to hear feedback on the game, and you can just tweet it at me on @_Jaketucker</p>\n<p>The game is free, however the suggested donation is going towards getting some cash to pay for sound and art for a new, bigger version of the game to launch next year. If you like what you play, or you want to support that, I appreciate you chucking in so I can sling artists/sound people some cash. </p>\n<p>ALSO I'm running a competition. The first person to tweet me a finishing screen with less than 210 seconds will win a prize. Just tweet me a screenshot of your finished time to @_Jaketucker and we'll organise a mystery prize. </p>\n<p><strong>Some notes: </strong></p>\n<p>You have four rounds in your magazine. It's a design choice to hide this in game because you have to count your shots, but if you pull the trigger four times you'll need to reload. </p>\n<p>The game goes full screen with alt+enter, but it will look terrible as the art isn't scaled right. Sorry. </p>\n<p>If you die on the first level, the timer will reset. On every other level, the timer continues. This is because I want to give you a space to learn the combat and feel confident to mess up a few times. </p><p>I used all of these sounds enough to download/work with them. Click here.</p>", "metacritic": null, "released": "2017-12-05", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/49a/49adad5979c25b71b7e1d13fb05d942f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 14, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Jake Tucker"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}