{"id": 119504, "slug": "thiefs-treasure", "name": "Thief's Treasure", "name_original": "Thief's Treasure", "description": "<p><strong>Description:</strong></p>\n<p>Done in under 72 hours as a Glitch Jam 1 project; the theme was \"Hidden Forces\".</p>\n<p>We felt that metroidvania as a genre perfectly suits the theme as most metroidvanias are about finding some \"forces\"/abilities/power-ups hidden all over the game worlds to get somewhere you couldn't get to before. Of course, completing a real metroidvania in just 72 hours is impossible, so we've created just a portion of the world we envisioned - the first planet from the galaxy the game takes place in.</p>\n<p>There's also a second theme-related element in the game's core gameplay: stealth. Our hero himself became a \"hidden force\" to be reckoned with.</p>\n<p>Truno is a small thief with big ambitions in a huge world. And he doesn't want to slowly move up the normal career ladder - why bother when he could just steal all the ability-enhancing relics from the legendary thief, Phantomia? Onward, to her vault!</p>\n<p><strong>Controls:</strong></p>\n<p>Left/Right arrows - Move</p>\n<p>Space/Up arrow - Jump</p>\n<p>Q - Emit a hypnotizing wave; enemies fall asleep on touch. Some enemies are immune!</p>\n<p>W - Stealth. Enemies won't notice you while it's active. However, movement sensors aren't affected by your visibility.</p>\n<p>E - Place a physical platform in front of yourself.</p>\n<p>Enter - Selection in menus/finish reading dialogue pop-up</p>\n<p>Escape - In-game pause</p>", "metacritic": null, "released": "2018-05-06", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/408/4088b9c753661a9688192c7aae24c4a2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 103, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Gil4"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}