{"id": 119579, "slug": "police-robbert", "name": "Police & Robbert", "name_original": "Police & Robbert", "description": "<p>Police and Robbert is a short, but challenging top down maze game.</p><p>In this game you play as Robbert the robber, and you have to strategize and sneak your way around the police. Robbert is robbing a tall apartment building. Help him get to the top without getting caught for an epic and sweet escape!</p><p>Depending on your Cash Mouney Flow at the end of the game your ranking will change. Will you be a beggar, pimp, mafia or king? Only you will know. Find out, and best your friends with your pro thieving skills~!</p><p><em>----------------<em>-----------------</em>------------------------------------------------------------<em>--------------</em>--------------------------</em></p><p><strong>Game features:</strong></p><ul><li>Top- down action and puzzle maze game</li><li>Arcade game inspired with a 256 x 192 resolution</li><li>10 levels</li><li>16-bit colour game palette</li><li>Avoid the police by crouching, hiding and sneaking around</li><li>Deceive the police with donuts</li><li>Stun the police with pepper spray</li><li>Steal money to get rich and famous!</li><li>Become a beggar, pimp, mafia or king!</li><li>Beat your friends' highscore</li><li>Crouch and hide</li></ul><p><em>-----------------------------------------------------------------<em>--------------</em>--------------------<em>-------------</em>--------------------</em></p><p><strong>Controls:</strong><br/><br/>Space to crouch<br/>Tab to pepperspray (if you have pepper spray)<br/>Space AND tab to put down a donut ( if you have donuts)<br/><br/>Tip! You can only use pepperspray when you are standing up, and only use donuts when you are crouching. Only the fat, stationary blue police man will be affected by donuts. If you run out of them before you manage to solve the puzzle, you have to start over again. <br/><br/>If you don't care about the highscore you can quickly choose the level select to quickly take you back to the room you got caught in.</p><p><em><em>-----------------------------------------------------------------<em>--------------</em>--------------------<em>-------------</em>--------------------</em><br/></em></p><p><em>I made this game in GameMaker as a school project from August to November 2016. It's the first game I've ever made. It was challenging to do the programming myself, but it was interesting. This game can be played on both arcade machines and windows.<br/>Pay what you want to, as this game is free to play.<br/>kozie@hotmail.no<br/>Ann Helen Lorentsen at Media Design School 2016. Auckland, New Zealand(C)</em></p>", "metacritic": null, "released": "2016-11-16", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/da1/da1b5adecf2d662156a29e5a48cc398f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 77, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ann Helen"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}