{"id": 119651, "slug": "off-road-cargo-truck-driving-simulator", "name": "off road cargo truck driving simulator", "name_original": "off road cargo truck driving simulator", "description": "<p>Here is the off road driving game simulator with the most realistic hilly graphics. Driver has to transport cargo truck of goods from the extreme hill climb roads in the mountain to the parking garage simulation.in this off road simulator transporter feels the drive of real graphics of the mountain. Truck has the extreme powerful engine to carry the load of the cargo from roads so that the driver can manage to transport wooden barrels to the parking simulation in the top of the mountain. While driving through hill climb areas driver has to perform real technical skills to drive through extreme off road simulator because transporter does not feel it simple simulation game he has to transport all cargo barrels and should not let them fall in the road.in this real transporter game you can drive with different controls and can feel the real sounds of truck. For this driving simulator the driver has the parking mission to drive truck off road so he has to be very careful so that the truck should not fall from the hilly mountain. Cargo transporter has to keep the balance while driving on the hill climb roads for parking the extreme powerful vehicle. While on the mission driver has to limited time to transport cargo. This simulation game has special features to drive truck in the hill climb roads in the mountain. Driving this parking off road simulator will be extreme fun to transport wooden barrels. There are different hurdles on the roads of the hill climb transporter simulation.</p>", "metacritic": null, "released": "2017-06-11", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/90f/90f24afd89fd338dd64cc5721b30a465.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 140, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["codesandplay"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}