{"id": 119646, "slug": "into-oblivion-black-label-edition", "name": "Into Oblivion - Black Label Edition", "name_original": "Into Oblivion - Black Label Edition", "description": "<p><strong>Into Oblivion is a drinking contest</strong><strong> of ridiculous proportion.</strong> Each player is dealt five item cards each round and attempts to make one of many mixed drinks for themselves or their opponents. Some drinks have additional status effects, some will make you puke instantly, while others just leave a funny taste in your mouth.</p>\n<p><strong>The Black Label Edition</strong> contains both the main game and the Private Reserve DLC (available as a download here and a Steam key e-mailed to you).<br/></p>\n\n<p><strong>Legend has it</strong> that this mysterious marvel of engineering known as the Pocket Brewer was invented by Dr. Cyrus Stansfield as a means of keeping the homeless away from his dental office's parking lot. Some say it was crafted by the government to subdue the masses of Starkham. Others say some highly motivated drunks cobbled it together when the Noose &amp; Rafter briefly shut down for the summer. Regardless of how it happened, it has allowed the denizens of the town to easily make dangerous alcoholic drinks and hold all-too frequently drinking contents.</p>\n<p><strong>The game takes place</strong> in various seedy locations through the city of Starkham (prominently featured in our previous games) and against some of it's better known inhabitants. Players can customize their character as well as challenge friends online or via LAN. Bet on your matches to gain money to buy upgrade, cosmetic skins, and items from the local Shady Merchant.</p>\n<p><strong>The Into Oblivion - Private Reserve DLC</strong> contains such goodies as the soundtrack, wallpapers, and printable card game. As we release content updates for the game, we will pack more things into it as well. Read on for details and content lists.<br/></p>\n\n<p><strong>The game has the following features</strong> best laid out in list format with snappy phrases like:</p>\n<ul><li>Face off against five different characters in story mode</li><li>Various outfits, hair styles, and accessories</li><li>Soundtrack by Macabre Gandhi and David Totten</li><li>Online and LAN multiplayer</li><li>Personal and global statistics on debauchery</li><li>Our favorite half-time mini-game Midnight</li><li>A leaderboard system of true alcoholics</li><li>52 item cards to mix, match, and drink</li><li>191 mixed drink recipes</li><li>30 temporary buffs to save your hide or sabotage you</li><li>Drink in various locations around Starkham</li><li>Bet against friends and foes to acquire coins</li><li>Upgrade and unlock gear at the Shady Merchant's shop</li><li>29 achievements to obtain</li></ul>\n<p><strong>Currently, the DLC pack</strong> has inside:</p>\n<ul><li>The game soundtrack with music from Macabre Gandhi and David Totten</li><li>Nine wallpapers of characters from the game</li><li>A printable version of the card game to play at home</li><li>A thank you note from CoaguCo</li></ul>\n<p><strong>Into Oblivion: The Card Game</strong><br/>A printable PDF of all the games cards. It includes some unique cards not found in the computer version, as well as modified versions of others for home use. The PDF also has a list of all needed materials (like dice and a pen), the official rules, and a score sheet to keep track of your points. It can be played with or without legal beverages for your country and age.<br/><br/><strong>Into Oblivion: Soundtrack</strong><br/>The full soundtrack includes the following tracks:</p>\n<ul><li>1 - Mould Menu (Judas is Carrion Redux 2)</li><li>2 - Alcoholic Affair (ForAbsolutelyNoReasonAtAll)</li><li>3 - Beer Brawl (Go Ahead)</li><li>4 - Cognac Crisis (NowThatsThatBullshssh)</li><li>5 - Drambuie Deathmatch (Visceral00)</li><li>6 - Ethanol Event (Profound Footage)</li><li>7 - Firewater Fight (Depends On The Situation)</li></ul>\n\n<p><strong>The game features online and LAN cross-platform multiplayer</strong> for Linux and Windows so you can drink your buddies under the table no matter what operating system they use... as long as it's not a Mac.<br/></p>\n<p><strong>Similar to the \"Street Loyalty\"</strong> features of our last game, The Dope Game, there are some small bonuses for players of our other games. Mostly of the cosmetic variety.  Each game played unlocks a different skin set to mix and match with the ones you have already.  If you haven't played any of our previous games, fear not, you'll only have to spend a little coin to get them as well.</p>\n<p><strong>Additionally, we have some content</strong> updates coming as well mostly in the way of additional skins, items, recipes, and game modes.  As per usual.</p>", "metacritic": null, "released": "2016-10-19", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/572/572a5c1891c413c752fd8aedab0dcbdf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 135, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["CoaguCo Industries"], "genres": [], "publishers": [], "esrb_rating": null}