{"id": 11971, "slug": "space-rangers-hd-a-war-apart", "name": "Space Rangers HD: A War Apart", "name_original": "Space Rangers HD: A War Apart", "description": "<h3>The reimagined classic</h3>\n<p>A remastered version of the classic space strategy in real time from three studios: SNK Games, Katauri Interactive and original developers from Elemental Games. The first game of the series was released in 2002 but almost did not find fans outside of its region of release. The gameplay is often compared to games like Elite and Star Control 2. Space Rangers HD: A War Apart is an improved version of the second part of the Space Rangers, which includes all the additional content for the game, and a completely new one. The publisher of the game was the company 1C.</p>\n<h3>Key features</h3>\n<p>The player takes control of the pirate ship, which occupies the lowest step in the hierarchy of space bandits. The main task is to get to the top. To do this, you will have to carry out missions and learn new details about the mysterious leader of the organization. He is the enemy of the Coalition of sentient species. All actions of the player influence the virtual world and the decisions made change the ending of the game. In the updated version of the game, new graphics are available: players now have the ability to play in resolution up to 1920x1200. Developers also added new storylines and fifteen new tracks to the music library of the game. Like the original game, Space Rangers HD, it was positively received both by longtime fans of the series and by new players. Critics also spoke positively.</p>", "metacritic": 68, "released": "2013-03-15", "tba": false, "updated": "2024-04-09T09:54:28", "background_image": "https://media.rawg.io/media/screenshots/668/668f9447327be622f82dc90ef9d24ac8.jpg", "website": "http://spacerangershd.com/", "rating": 4.38, "rating_top": 5, "added_by_status": {"yet": 57, "owned": 1353, "beaten": 137, "toplay": 24, "dropped": 32, "playing": 18}, "playtime": 5, "achievements_count": 82, "ratings_count": 263, "suggestions_count": 420, "game_series_count": 0, "reviews_count": 264, "platforms": ["PC"], "developers": ["SNK", "Katauri Interactive", "Elemental Games"], "genres": ["Adventure", "RPG", "Strategy", "Simulation"], "publishers": ["1C-SoftClub", "1C Company"], "esrb_rating": null}