{"id": 11986, "slug": "soldier-sortie-vr-agent-006", "name": "Soldier Sortie :VR Agent 006", "name_original": "Soldier Sortie :VR Agent 006", "description": "Soldier Sortie:VR Agent 006  is a shooting adventure game developed with HTC VIVE. The game will bring you exciting experience of VR technology. Breaking through the virtuality and reality, experience the intense gunfight and puzzle adventure in the virtual world.<br/>\n<br/>\r\n   Game Introduction<br/>\n<br/>\r\n    STORY<br/>\n<br/>\r\n    VR world is trying to break through the border and enter the real world. All the countries have entered special alert conditions and have sent special agents to sneak on theVR world and gain information. However, all the special agents have failed their mission and got captured.<br/>\r\n   Under the critical situation, S-level special agent 006 is entrusted with the mission to enter the VR world and save the imprisoned comrades.<br/>\r\n   There are various dangers in the VR world and a cruel war will be ignited soon. Are you ready now?<br/>\n<br/>\r\n   Story Mode<br/>\n<br/>\r\n    -Audio and text instructions provide you quick and convenient guidance. <br/>\r\n    -Fierce gunfight and flying knives bring you wonderful combat experience. <br/>\r\n    -Reasoning and puzzle-solving, and overcome all the difficulties with clairvoyance to save your comrades . <br/>\r\n    -Be courageous and wise, and step on the heart-quake path to gather intelligence in the virtual world.<br/>\n<br/>\r\n   Endless Mode<br/>\r\n   Fight bravely in the endless night even though there is unknown danger. The song of victory is won with blood.<br/>\n<br/>\r\n    -Various game levels: Common Level, Gold Enemy Level, Gold Target Level, BOSS Level...<br/>\r\n    -Upgrading, call for friendly forces, throw grenades, all bring you exciting fighting experience.<br/>\r\n    -The bunker can be broken and be repaired, and there is randomly appeared explodable oil bucket... providing you diversified scenes.<br/>\r\n    -Golden pistol with gorgeous appearance, enhanced assaulting property... It’s an excellent tactical game.<br/>\r\n    -Small space defense, running flexibly among the bunkers, just like the real battle. <br/>\n<br/>\r\n Welcome to discuss together, share your experience !", "metacritic": null, "released": "2016-12-16", "tba": false, "updated": "2019-08-28T22:13:34", "background_image": "https://media.rawg.io/media/screenshots/d3f/d3f153142d8def7ece1e60278290349c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 542, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Shandong Jerei Digital Technology Co.,LTD."], "genres": ["Action", "Adventure", "Strategy"], "publishers": ["Shandong Jerei Digital Technology Co.,LTD."], "esrb_rating": "Mature"}