{"id": 119991, "slug": "devine-world-of-shadows-2", "name": "DeVine: World of Shadows", "name_original": "DeVine: World of Shadows", "description": "<p><strong>De'Vine: World of Shadows</strong></p><p>Features of the story system:</p>\n<p>The Ancients were beings of enormous power each created on their own accord. Negative energy that lies dormant for too<br/>long within varying dimensions finds a host and thereby creating an ancient. <br/>These Ancients threatened both Heaven and Hell. For the first and only time in all existance, Angels and Demons came together<br/>to create a trinket so strong that they only allowed those with human blood to possess it.</p>\n<p>That is when Amos, being obsessed with the Ancients, created a blood ritual and had 2 sons of his own.<br/>Both half-demon and half-human. They were able to wield this powerful amulet and do his bidding to seal the Ancients.</p>\n<p>But alas, Amos' plan to sacrifice Kuan was revealed and instead Chung gave his own life to save him.<br/>Nevertheless a portal was opened to the mortal realm and an invasion of demons scourged the land.</p>\n<p>-----------</p>\n<p>1000 years later, Kuan awoke from his sealed prison after Master Sage Tenoch's seal shattered. Priestess Audie and<br/>Master Sage Oat quickly but with great caution take him in and hope that he can be the new \"Hero\" of this age.</p>\n<p>For just as it does every 1000 years, Lucifer sends an invasion of demons to try and reclaim the mortal realm as a stepping stone<br/>to Heaven.<br/> <br/>From here on, it is up to Kuan to stop the invasion and put an end to malevolence once and for all!</p>\n<p>Features of the battle system:</p>\n<ul><li>Fast paced battle system with over 20 playable characters. All having their own sets of skills and classes.</li><li>Not turn-based. React quickly with 6 preset skills that are hotkeys into your controller or keyboard. 1-6... 6 being alchemy bag for all characters.</li><li>No resources aside from TP which only parents one ultimate skill. The other 4 are all situational. So think before you act!!!</li><li>Customize your character by changing their class, a well balanced equipment system with major perks for all big 3 armor types, flasks to increase parameters.</li><li>Armor system has varying potentials. For example, any class can wear any armor. Give your DPS heavy armor to keep them alive longer in combat!</li><li>Buffs mean everything. Without them hard difficulties are essentially impossible.<br/>4 Difficulty settings including a super easy that allows for the Battle System to be turn-based.</li><li>Random encounters... They can be turned completely OFF. Aside from dungeons and even there they are limited to 2-3 per floor.</li></ul>\n<p> Features of the CARD battle system:</p>\n<ul><li>Collect essences from rare versions of World Map monsters.</li><li>Forge the essences into cards using the Cardcrafting station in your Headquarters.</li><li>Take those said cards into a battle with 1 of the over 100 battles throughout the world.</li><li>Select up to 7 cards per battle. With a limiting power of 25. Better qualities cards use MOREpower.</li><li>Defeat 7 Card Hubs throughout the world to face up against the Card Champions in Tarn.</li><li>Rewards after each victory and the NPC's even talk smack during the battle!</li></ul>\n<p>Features of the Farming System:</p>\n<ul><li>Till the land anywhere in farm area of your Headquarters.</li><li>Plant a seed of one of more than 33 different crops! Water them and watch them  grow. Will take patience... Of course.</li><li>Excellent yield that can make you quite a bit of Mola!</li><li>A chicken coop where you can raise chickens. Get Eggs or if the ratio is right, get more hens and roosters!</li><li>A livestock farm where you can raise cows and sheep! Get wool or milk, and again, if the ratio is right more animals!</li></ul>", "metacritic": null, "released": "2018-06-16", "tba": false, "updated": "2019-08-28T23:23:47", "background_image": "https://media.rawg.io/media/screenshots/d46/d46054fe8a89b4cb6dbda49753c33868.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 357, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Stapleton"], "genres": ["Adventure", "RPG", "Puzzle"], "publishers": [], "esrb_rating": null}