{"id": 120096, "slug": "revolucimon", "name": "Revolucimon", "name_original": "Revolucimon", "description": "<p>Hello there! Welcome to the world of Portamon! This world is inhabited by creatures called Portamon. Super-powered monsters that are used as pets, or to complete tasks, or for competitive sport battling. Today the Portamon company is ready to unveil their newest technology, a breakthrough in human control over these amazing beasts. But what's that? One of the test subjects has escaped...oh...This may be a problem...</p>\n<p>When a group of monsters tired of being collected and traded like goods rise up against human control, who will win? Fire breathing, mind controlling, lightning bolt firing monsters or human civilization? The world of Portamon will never be the same.</p>\n<p>Revolucimon is a turn-based RPG inspired by monster collecting games and the style of 8-bit sprite art. At its heart, Revolucimon is my take on a type of game that I love from a narrative angle that hasn't been explored enough in the genre. I want Revolucimon to be a throwback to Pokemon style gameplay for PC gamers while exploring more subtle plot possibilities than just being the best and catching them all.</p>\n<p>Current version works with controller support or with Mouse and Keyboard. </p>\n<p>Keyboard:</p>\n<p>WASD - Movement</p>\n<p>Esc - Pause/Cancel</p>\n<p>Space - Confirm</p>\n<p>Gamepad:</p>\n<p>Left stick - Movement</p>\n<p>A Button - Confirm</p>\n<p>B Button - Cancel</p>\n<p>Start - Pause</p>\n<p>L Shoulder - Run</p>\n\n<p>Current known bugs:</p>\n<p>- Occasionally at the edge of a battle area, a battle will start but the UI won't load. Very sporatic, but I'm addressing it in the next patch.</p>\n<p>-Users with older processors/video cards may have an issue with the animation frames occasionally sticking. If this happens, walk in the same direction again and it should unstick or wait for 5 seconds for the idle animation to clear the frames. The optimization is being addressed in the next patch as well.</p>\n<p>-Grindstones level a character up when used outside of battle, but don't force a Metamorphosis. The Metamorphosis will occur after the next battle.</p>", "metacritic": null, "released": "2017-05-02", "tba": false, "updated": "2019-08-28T23:23:47", "background_image": "https://media.rawg.io/media/screenshots/211/21180b23d85e2f0b11a22c08fa7d0a15.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 240, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["kcla3d"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}