{"id": 120069, "slug": "shadow-crawl", "name": "Shadow Crawl", "name_original": "Shadow Crawl", "description": "<p>Thanks all for playing my Ludum Dare 39 Entry.</p>\n<p>Rate the game here: https://ldjam.com/events/ludum-dare/39/shadow-crawl</p>\n<p><strong>I removed the web version due to really bad performance, sorry.</strong><br/></p>\n<p>Video walkthrough can be found here if you need help:</p>\n<p>Tips and Tricks:</p>\n<p>Level 1: First door is in the top left. Conserve your batteries and open it. Go through it. Next door is in the top left. Make your way through the bushes spamming your gun and run as fast as you can to the door.</p>\n<p>Level 2: Burst down the boss as fast as you can. He will absorb other moths, increasing his speed and size. If you don't kill him fast you will get overwhelmed.</p>\n<p>Level 3: Try not to let your sanity get too low or moths will overwhelm you. Go out of your way to grab batteries and ammo because you are going to need it. Feel free to go into the dark a little bit, but be on your toes.</p>\n<p>Level 4: Stay close to the light, but also try to stay out of the snake statues range. If you are getting close to the end but are getting overwhelmed run past the light and into the last room. Once the light reaches it, it will kill all enemies touching the light.</p>\n<p>Level 5: The Snake statue in this room is extra powerful, and will drain your sanity fast making the boss move at incredible speeds. Take advantage of the lights in the front of the room to regain your sanity, and try to make every shot count as you can run out of ammo altogether.</p>\n<p>Level 6: Be on your toes as the enemies hide in the statues. Feel free to use batteries liberally as there are plenty of them laying around.</p>\n<p>Level 7: Stay on the move, try to grab every ammo and battery you can safely. Just survive for 60 seconds.</p>\n<p>Level 8: Spam shots when he is in his projectile phase to damage him, stay on the move if you can't find him but be careful you don't run out of batteries.</p>", "metacritic": null, "released": "2017-07-31", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/e47/e477d7c71be4fdf8978bdc6e05e01b88.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 16, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["nihilbug"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}