{"id": 12006, "slug": "judgment", "name": "Judgment: Apocalypse Survival Simulation", "name_original": "Judgment: Apocalypse Survival Simulation", "description": "Rebuild society. Survive the Apocalypse.<br/><br/>Judgment: Apocalypse Survival Simulation is a <strong>colony simulation</strong> game with <strong>tactical combat</strong> that takes place in the midst of a <strong>demon apocalypse</strong>. The gates of hell have opened and unleashed relentless demons into the world -- but you can fight back! Guide a group of survivors through the mayhem -- hiding from hellspawn and <strong>building</strong> a sanctuary. Survive by gathering resources, <strong>crafting</strong> equipment, defending your base and sending teams to <strong>scavenge</strong> for supplies. Research human technologies and practice the dark arts to find a way and send the demons back to hell.<br/><br/>To survive is to prevail. Will you survive Judgment day?Features<ul><li><strong>Build</strong> your base in the midst of a demon <strong>apocalypse</strong><br/></li><li><strong>Explore</strong> a randomly generated world overrun with hellspawn and <strong>scavenge</strong> essential resources<br/></li><li>Fight creatures of the abyss in <strong>real-time tactical combat</strong> with pause<br/></li><li><strong>Level up</strong> and <strong>customize</strong> your survivors<br/></li><li><strong>Craft</strong> your own equipment, tools and weapons<br/></li><li><strong>Research</strong> lost technologies to unlock new structures and equipment<br/></li><li>Practice the <strong>occult</strong> and use the demons own <strong>dark magic</strong> against them</li></ul>Early AccessJudgment is in early access because we believe that great games are made through cooperation between fans and developers. The game is fully funded and we are not counting on Early Access sales to fund the development.StoryIt's the Apocalypse, the end of the world. You were camping with some friends when an evil shadow, a huge demon, appeared out of nowhere and viciously ripped one of them apart. Somehow as your survival instincts took hold, you managed to kill the creature and flee. Soon, however, you found that you were a few of the lucky ones. Your demon encounter was not an isolated incident. The town was aflame, it was Judgment day. <br/><br/><br/>But you and your friends vow to fight back. You find an isolated valley and build a base, a shelter for yourselves and other survivors you may find. The Apocalypse may be here, but your hope is still strong. As long as you're alive, mankind has yet to be judged. You will find a way to save the world, send the demons back.", "metacritic": null, "released": "2015-11-01", "tba": false, "updated": "2023-05-07T08:02:34", "background_image": "https://media.rawg.io/media/screenshots/f59/f5909e6fbc718b7e45e5e23ef532ba57.jpg", "website": "http://www.judgmentgame.com", "rating": 3.41, "rating_top": 5, "added_by_status": {"yet": 8, "owned": 214, "beaten": 5, "toplay": 8, "dropped": 7, "playing": 1}, "playtime": 2, "achievements_count": 83, "ratings_count": 27, "suggestions_count": 331, "game_series_count": 0, "reviews_count": 27, "platforms": ["PC", "PlayStation 4"], "developers": ["SEGA", "Suncrash"], "genres": ["Strategy", "Simulation", "Indie"], "publishers": ["Suncrash"], "esrb_rating": null}