{"id": 12014, "slug": "americas-army-3", "name": "America's Army 3", "name_original": "America's Army 3", "description": "Check Out the latest installment \"America's Army: Proving Grounds\"<br/><br/><strong>Download AA3 Today and Become a Member of the elite America's Army Team! </strong><br/>\t\t\t\t\t America's Army fans and new players alike can now experience America's Army 3, the official U.S. Army game, which has more authentic military elements including training, technology, weapons, and audio than any other military game.  <br/>\t\t\t\t\tBuilt on Unreal Engine 3, AA3 delivers stunningly realistic characters, environments, lighting effects, animations, and team-based experiences. In the game where Every Detail Counts™, players are bound by Rules of Engagement (ROE) and gain experience as you navigate challenges in team-based, multiplayer, force-on-force operations. With 15 different map/mission combinations and exclusive advanced training that allows you to unlock new abilities and customize your gear, you'll experience Soldiering in the U.S. Army like never before.   <br/>\t\t\t\t\tFind strength like no other in a game like no other. Start your mission now! <br/>\t\t\t\t\tWhen you play AA3 on Steam, you'll earn Steam Achievements, ranking up among your friends as you earn distinguished status, badges, medals and ribbons. With AA3 on Steam, you can also save your keyboard bindings to the Steam Cloud - just login to your Steam account and fire up AA3 on any PC to utilize your custom settings.", "metacritic": 70, "released": "2009-06-17", "tba": false, "updated": "2023-11-30T07:02:43", "background_image": "https://media.rawg.io/media/screenshots/d63/d63d705c9179900754788602acfd8cb1.jpg", "website": "http://www.americasarmy.com", "rating": 2.03, "rating_top": 1, "added_by_status": {"yet": 22, "owned": 739, "beaten": 1, "toplay": 3, "dropped": 13}, "playtime": 1, "achievements_count": 71, "ratings_count": 34, "suggestions_count": 547, "game_series_count": 0, "reviews_count": 34, "platforms": ["PC"], "developers": ["U.S. Army"], "genres": ["Action"], "publishers": ["U.S. Army"], "esrb_rating": null}