{"id": 120172, "slug": "midnight-mia", "name": "Midnight Mia", "name_original": "Midnight Mia", "description": "<p>How much hype does one game deserve?</p>\n<p>On the eve of the New Millenium, the world celebrates as legendary videogame Peace Pao releases at midnight, promising a new era of Heaven on Earth. The demand is so high, even preordered purchases that are not claimed immediately are taken just as fast. Dalliers beware; Whoever misses the line, misses the ride.</p>\n<p>Enter Mia, who's day could have ended in tragedy if she had any foresight whatsoever. </p>\n<p>Alone, weak, facing against all odds, Mia has only her health, wits and a golden trident that can blow stuff up.</p>\n<p>--------------------</p>\n<p>HOW TO PLAY:</p>\n<p>Collect hearts to move on. Other than that, do what you want! You have unlimited access to Mia's abilities. Save the day your way!</p>\n<p>Be sure to take advantage of the Info HUD, which you can access by holding P on your keyboard or dpad-up on your controller. There's a lot of stuff you can do in this game, master the basics!</p>\n<p>Zoom in and out of Mia on command! In large levels, you always have full view of the action.</p>\n<p>Do you like to play games in new ways? Then check out Adventures+! The included modes skip the main story and award their own endings.</p>\n<p>--------------------\r\n</p>\n<p>NOTES:</p>\n<p>Tested on Windows 7 Dell Inspirion 620. These computer specs are the currently known minimum requirements. \r\n</p>\n<p>Controller inputs are based on Xbox and Playstation buttons.  </p>\n<p>If there is interest in this game, a Kickstarter will be made to maximize Midnight Mia's full potential and it will release on home consoles and the Nintendo Switch.</p>\n<p>Enjoy!</p>", "metacritic": null, "released": "2018-01-02", "tba": false, "updated": "2019-08-28T23:23:47", "background_image": "https://media.rawg.io/media/screenshots/fdb/fdb1863255dc0cf4c8cbe72e31a4ead9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 234, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Roden"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}