{"id": 120178, "slug": "world-destroyers-itch", "name": "World Destroyers (itch)", "name_original": "World Destroyers (itch)", "description": "The ULTIMATE homage to retro space shooters!<p>World Destroyers is a fast-paced, skill-testing, multiplayer space shooter that pays homage to classic games such as Asteroids.</p><p>Up to four players can team up to save Earth in Story mode, or see how far they can get in the endless Horde and Retro modes.  And of course, bring out the trash talk in fully customizable Battle mode. </p><p>When an unusually large cluster of asteroids heads towards Earth, command sends a small fleet of spacecraft to shoot them down.  It quickly becomes clear that not all is as it seems. An alien species with sinister intentions threatens to destroy our solar system.  </p><p>It’s up to you to defend Earth from the dreaded World Destroyers. Huge alien space stations that harvest planets for their resources, leaving destruction in their wake.  The aliens have superior weaponry, but perhaps mankind’s remarkable ingenuity can stop their plans.</p>Features<ul><li>1 to 4 player mayhem, team up or compete with your friends!</li><li>Diverse story campaign featuring 40 levels, bonus mini games, and an EPIC final boss.</li><li>5 difficulty modes, from relaxed casual fun, to pulse pounding pull your hair out insane!</li><li>Arcade modes such as Horde, Battle, Race and Retro.</li><li>Fully realized mobius levels. Wrap-around edges that both enemies and SKILLED players can take advantage of.</li><li>An armory of 15 distinct weapons, including 3 super weapons. The Nuke, Deathflower and Vortex Bomb.</li><li>Master the use of 4 special abilities. The Shield, Repulsor, Auto-Turret, and Warp Drive.</li><li>Viciously smart enemies, including fighters, UFOs, armored space stations with custom armaments, and of course asteroids!</li><li>10 unique destroyer armaments, including hangars, missile launchers, shield generators and laser cannons.</li><li>Rousing original soundtrack to blow stuff up to!</li></ul>\n<p><em>For press and other inquiries, please send an email to hardheadgames (at) gmail (dot) com, find us on twitter </em>@HardHeadGames<em>, or check out </em><em>our press kit!</em></p>", "metacritic": null, "released": "2014-03-15", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/211/211142ed878c0a4291551349361bf5db.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 118, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["HardHead Games"], "genres": ["Action"], "publishers": [], "esrb_rating": null}