{"id": 12026, "slug": "cyberlink-photodirector-8-deluxe", "name": "CyberLink PhotoDirector 8 Deluxe", "name_original": "CyberLink PhotoDirector 8 Deluxe", "description": "PhotoDirector Deluxe brings the all the tools you need to manage, adjust, and edit your photo collection. Enhanced face and body beautifying tools help retouch facial features and body contours in photos. Unwanted objects are quickly removed from photos with content-aware brushing. And even more smart, intuitive tools enable you to identify and choose the best face from a set of group photos so you can effortlessly create perfect group shots.<strong>Content-Aware Removal</strong>Remove objects or people from photos simply by brushing over them. PhotoDirector instantly fills spaces using an intelligent algorithm that blends perfectly with the surrounding background.<br/><strong>Stunning photos from video</strong><strong>Capture razor-sharp still images from your videos and use them to create panoramic vistas, perfect group photos or impressive multi-exposure images.</strong><strong>Capture Stills with Video-to-Photo</strong>Now you can take the perfect picture from your videos. With just a click you can capture a razor-sharp still image that you can use to create you own perfect panorama, group photo, multi-exposure image or layered image.<strong>Perfect Photos with Face Swap</strong>Finally, an easy way to get everyone's eyes open and smiling in photos. Simply take a video of the group then use Video-to-Photo Face Swap to instantly create a single, perfect photo.<br/><strong>Perfect portraits</strong><strong>Easy-to-use retouching tools make pro-like enhancements of portraits, selfies, and group shots achievable for even complete beginners.</strong><br/><br/><ul><li><strong>Face &amp;amp; Body Beautification</strong><br/>The broad collection of easy-to-use touch-up tools in the new PhotoDirector make it easy to professionally remove imperfections from your portraits, selfies, and group shots.<br/><br/>Intelligently adjust skin tone in your portraits for the look you are after. Give your subjects healthier looking skin or a perfect tan in moments.</li></ul><strong>Filters, effects &amp; blurs</strong> <strong>Get that unique look and feel you're after with PhotoDirector's unmatched library of photo adjustments.</strong><br/><br/><ul><li><strong>Global &amp;amp; Regional Adjustment</strong><br/>A full suite of tools that let you improve your whole image, or even touch-up a specific region for the perfect picture.<br/></li><li><strong>40+ Overlay Templates</strong> <br/>Experiment with an incredible assortment of overlays that will instantly give your photos an edge.<br/></li><li><strong>Color Splash </strong> <br/>Quickly add drama and focus to your images by turning them to black and white while retaining selected parts of the photo in color. A great way to draw the viewers eye and create memorable photos.</li></ul><strong>Photography essentials</strong> <strong>For the advanced photographers PhotoDirector offers extensive support for a vast selection of commercial camera lenses, bodies and RAW formats that streamlines the editing process.</strong><br/><ul><li><strong>More Lens Profiles</strong><br/>PhotoDirector supports an ever-growing collection of more than 100 lens profiles that allows it to quickly and accurately fix common lens flaws like barrel distortion, vignetting and chromatic aberration.<br/><br/></li><li><strong>More Raw Format Support</strong><br/>PhotoDirector not only supports JPEG and TIF files, but also a broad range of popular and proprietary RAW file formats from the world’s leading digital camera manufacturers.</li></ul>", "metacritic": null, "released": "2017-03-13", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/c3f/c3f615b749982d45b960e498176de285.jpg", "website": "http://www.cyberlink.com/products/photodirector-ultra/features_en_US.html", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 171, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["CyberLink"], "genres": [], "publishers": ["Koch Media", "CyberLink"], "esrb_rating": null}