{"id": 120201, "slug": "reberth", "name": "r.e.B.E.R.t.h.", "name_original": "r.e.B.E.R.t.h.", "description": "<p>r.e.B.E.R.t.h. is a story driven, side-scrolling, musical shooter led by a small team of former developers and artists from Harmonix (Guitar Hero and Rock Band), iNiS (Elite Beat Agents and LIPS), and Fire Hose Games (co-developers of Rock Band Blitz). With them is composer Larry Hong, a student at Berklee College of Music, and Evan Quinlan, an accomplished software developer. Together, with the help of Sonic Bloom's Koreographer tech, they are building their vision of a truly interactive musical experience: a game where the music actively drives the game, and the game changes the music.</p><p>The team is creating a truly unique game experience where just about every aspect of the game synchronizes to the and the music is altered by game events. The music score becomes a driver for all in-game events allowing Composer Larry Hong to simultaneously design levels. Percussion becomes laser fire, melodies pace the action, and tempo changes shift the game dynamics; all in real time. Think; \"Game linked to its music score\" and think less like \"rhythm game.\"</p><p>In r.e.B.E.R.t.h., you play Mel, a refugee seeking escape from her home planet as it falls to a controlling, galactic order. Mel narrowly escapes the destruction of her planet, armed only with her ship, and an inherited ability to see the Background Energy of Reality: an energy that stems from the threads of The Universe itself and manifests to those who can perceive it as music. Mel is on a path to discover the root of the devastation that befell her homeworld and reunite with her family.</p>", "metacritic": null, "released": "2016-05-25", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/314/3147fdb6c82b5ca2bb02d017b1b32026.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 157, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["jstaniz"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}