{"id": 120240, "slug": "stupid-man-explodes-the-aliens-heads", "name": "Stupid Man Explodes The Aliens' Heads", "name_original": "Stupid Man Explodes The Aliens' Heads", "description": "<p> <br/>\n</p>Only Stupidity can stop the Aliens now.<p>A slapstick comedy game featuring no words whatsoever! *<br/>\n</p><p>After being abducted by aliens, the only way to escape is to be stupider than they can comprehend (making their heads explode) <em>(see scientific explanation below)</em></p><p>Drive a tank, fly a spaceship and fall in love - do whatever it takes to escape the aliens and get back to Earth! <br/></p><p> My 4th and funniest comedy game yet, 15-20 minutes full of comedy, mayhem and explosions! <br/></p><p><em>*Except alien words. **</em></p><p>\n</p><p>\n<strong><em>Scientific Explanation: </em></strong>Stupidity is caused in humans when signals from the 'decision-making center' (in the very center of the brain) get short-circuited into a similar neural circuit in the  'Reptilian' or 'Mammallian' parts of the brain (around the center) instead of being processed by the intelligent 'neocortical brain' (on the very 'outside' of our brain), making us act like animals rather than sensible humans.\r\n</p><p>\r\n\tThe alien's brain, however, evolved in a different way - the 'intelligent' part is directly around the 'decision-making center', so the chances of a 'prehistoric', 'animal-like' response to an unexpected event (due to a circuit firing in the 'animal' part of the brain) is vastly reduced due to the distance that the circuit needs to travel to get where it's going.\r\n</p><p>\r\n\tIn general, when a neural circuit fires, that circuit becomes 're-wired' and new connections are created between those neurons and their neighbours. If the unexpected stimulus  is big enough, it can even cause nearby connections to be destroyed.\r\n</p><p>\r\n\tWhen an alien sees you do something not just stupid (which doesn't *quite* fire the Reptilian brain's circuits), but RIDICULOUSLY stupid, a giant circuit is lit up between their decision-making and 'reptilian' brain. Like a lightning bolt, this circuit fires through their entire brain, breaking and creating connections all throughout it.\r\n</p><p>\r\n\tA typical response to needing to process some new information is to pump more blood into the brain, to warm it up and provide more oxygen. After the lightning bolt, more and more blood is pumped through to 'help' the brain process all the neurons that are firing.\r\n</p><p>\r\n\tThis heats up the small air pockets in the alien's head, which eventually becomes so hot it has enough pressure to burst through the alien's skull, like a kettle. The air rushes out, creating a vacuum between the brain and the head, magnifying the force by approximately 1,000 times, eventually sucking the brain out and forcing it through the skull.\r\n</p><p>\r\n\tSo that's why the alien's heads explode when you do something stupid.</p><p>** Speaking of alien words, I should *probably* tell you the first 3 options that appear when you start the game are:</p><ul><li>New Game</li><li>Continue (greyed out until you save the game)</li><li>Options</li></ul><p>(Apologies to everyone who got stuck in the Options screen earlier! Right click or push <esc> to get out of it!)</esc></p>", "metacritic": null, "released": "2016-04-08", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/f70/f7019214ead6d63fee47b473fe540c45.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 44, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["qualifiedbadger"], "genres": [], "publishers": [], "esrb_rating": null}