{"id": 120222, "slug": "descent-loot-grounds", "name": "Descent (Loot Grounds)", "name_original": "Descent (Loot Grounds)", "description": "<p><strong>Ancient evil lurks in the depths of temple catacombs. Fight your way to the chamber with the black obelisks and defeat the mage twins. </strong></p>\r\n---CONTROLS--- \r\n<p>Arrow keys/WASD: Move <br/>Left click: Attack</p>\n<p>Second left click: Second Attack </p>\r\n---DESCRIPTION--- \r\n<p>You'll get 3 levels: <br/>1. Intro <br/>2. Catacombs <br/>3. Chamber with the black obelisks <br/><br/>And two types of enemies: <br/>1. Mage (range) <br/>2. Spider (melee) </p>---CREDITS---<p>First level is just intro (go straight up). To enter level 3 you have to defeat the black mage on the second level and run through the ruined portal (see screenshots). When (and if) the mage twins are defeated it's the end of the game. Mages also spawn minions. <br/>There is no health bar, but as you get more damage the screen will gradually get noisier. If you're hit the red vignetting will appear. At the start of each level you health is replenished. When you die you restart at level 2. <br/><br/><br/>---ALL THE REST--- <br/>The game is super hard, it's basically 10 or so hits and you're dead. But with some practice and craft it is possible to win. It's hard to tell when you get hit for the most part because the attack animations are messy so rely on vignetting. <br/><br/>---ACKNOWLEDGEMENTS--- <br/>Thank you all for playing and for your feedback. We trully appreciate it. Special thanks to BuKaneerz and TomboFry for streaming our game on Twitch. <br/><br/>---UP1--- <br/>Wow, it's fantastic how many of you have interest in our entry. Thanks again for feedback and criticism. We are aware of all the bugs mentioned but unfortunately we had no time to fix them during the jam. <br/>We will publish a fixed version when judging is done and we hope to make it a full feature or something else based on similar mechanics.</p>", "metacritic": null, "released": "2017-01-02", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/5ab/5abc9aa08aa74cf1b643cfc83724760f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 83, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "Web"], "developers": ["Loot Grounds"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}