{"id": 12022, "slug": "kings-bounty-the-legend", "name": "King's Bounty: The Legend", "name_original": "King's Bounty: The Legend", "description": "<p>This spiritual successor to the 1990 King&#39;s Bounty revived the franchise and spawned a series of sequels. The plot is set in a fantasy world of Endoria, in the kingdom of Darion, and does not continue King’s Bounty. The protagonist is a rookie hero who offers his services to Mark, the king of Darion, and is to become his Royal Treasure Searcher. The player’s goal is to complete quests that will earn his or her character the titular king’s bounty, be it gold or a rank in nobility. <br />\nUnlike the original TBS game, The Legend combines tactical gameplay with role-playing elements, such as character classes, experience, and a tree of skills. Your class (warrior, paladin, or magician) is assigned automatically based on your actions in the tutorial mission. There are also dialogues, character interaction, and even romance options than allow your character to marry and have children. The player explores the world’s map in real time, like in most RPGs. The combat system, however, is completely different. During battles, the player controls not the hero, but the hero&#39;s units, the number of which depends on the character’s “Leadership”. Battles are turn-based and are fought on a grid of hexagonal tiles, just like in the related Heroes of Might &amp; Magic series.</p>", "metacritic": 79, "released": "2008-04-24", "tba": false, "updated": "2024-01-20T13:19:05", "background_image": "https://media.rawg.io/media/games/1aa/1aa082df2dbde6940e9ccbee4aac0feb.jpg", "website": "http://www.kingsbountygame.com", "rating": 4.18, "rating_top": 5, "added_by_status": {"yet": 130, "owned": 2130, "beaten": 265, "toplay": 34, "dropped": 97, "playing": 11}, "playtime": 3, "achievements_count": 0, "ratings_count": 354, "suggestions_count": 622, "game_series_count": 7, "reviews_count": 361, "platforms": ["PC", "macOS"], "developers": ["1C Company", "Katauri Interactive"], "genres": ["RPG", "Strategy"], "publishers": ["1C-SoftClub", "1C Company"], "esrb_rating": "Teen"}