{"id": 12032, "slug": "kings-bounty-crossworlds", "name": "King's Bounty: Crossworlds", "name_original": "King's Bounty: Crossworlds", "description": "<h3>The king’s heroes</h3>\n<p>The Russian approach to the game King&#39;s Bounty released on the largest platforms back in the 1990s. The series is often compared with the universe of Heroes of Might and Magic, but the gameplay and other differences (for example, the lack of a turn-based movement around the game world). But games have one publisher - New World Computing.</p>\n<h3>The Russian way</h3>\n<p>In March 2007, the Russian company 1C bought the rights to use the trademark and game universe of King&#39;s Bounty. The development was entrusted to the Vladivostok studio Katauri Interactive, which are known for the series of games Space Rangers. The game takes place in the fictional world of Endoria. In 2009, there was an add-on for the main game under the name of Armored Princess, and apparently, because of the love of Russian to matryoshka, the company decided to release another add-on to the add-on of the original game.</p>\n<h3>The plot</h3>\n<p>The action of Crossworlds takes place in the world of Teana. The player takes control of Princess Amelie, as in the previous game, and guides her through two independent story campaigns. One of them is “Orcs on the March” - the remastered version of the campaign from the previous part, and two other absolutely new stories in the virtual universe. In addition to developer’s created campaigns, players are able to create their own adventures in the built-in editor. The play is possible only in a single mode, and multiplayer is not available in the game.</p>", "metacritic": 78, "released": "2010-09-17", "tba": false, "updated": "2024-03-05T14:14:52", "background_image": "https://media.rawg.io/media/games/639/6397bb4efeaef93416b35e905a3a18c1.jpg", "website": "http://www.kingsbountygame.com", "rating": 3.87, "rating_top": 4, "added_by_status": {"yet": 97, "owned": 1537, "beaten": 89, "toplay": 9, "dropped": 34, "playing": 4}, "playtime": 2, "achievements_count": 0, "ratings_count": 150, "suggestions_count": 644, "game_series_count": 7, "reviews_count": 152, "platforms": ["PC"], "developers": ["Katauri Interactive"], "genres": ["RPG", "Strategy"], "publishers": ["1C-SoftClub", "1C Company"], "esrb_rating": null}