{"id": 120321, "slug": "yours", "name": "Yours", "name_original": "Yours", "description": "<p>28/04/2017 - Finished work for the weekend so spent an hour just fixing two issues. </p><p>- Fixed clipping/people floating issue.</p><p>- Fixed placement bug. </p><p>- Left original submissions in case people want to check those :D </p><p>25/04/2017</p><p>- Added WebGL version.</p><p>- Added Linux and Mac build. These are untested as my linux laptop is at work, and I don't have a Mac. </p><p>- These are the same as the original submission, just it was early in the morning when I was submitting and didn't think to do a webgl version.</p><p>LD38 Entry here </p><p>Sculpt your world, and place your tribe. Watch them spread as they build new houses, and boats to explore your small world. </p><p>Created by @binaryferret</p><p>Music by @MrJoshuaMcLean </p><p>Special thanks for @MrJoshuaMcLean for creating such a beautiful bit of music. Especially as my relevant input on it was pretty much please make me 'happy space music'.</p><p>A vastly different game to the original idea. Unfortunately due to some real life issues I lost a good chunk of time. Also a particular Vector2 masquerading within a bunch of Vector3.Distance calls left me banging my head against a wall for a long time....Lessons learned. </p><p>I set out to make a warlike tribe v tribe but due to time limits I swerved madly in another direction. Limited, but I've really enjoyed working on this Ludum Dare! I've also learned a lot. </p><p>I hope you enjoy this submission. I will defo be updating it in the future.</p><p>Also I'm aware they float..it was a cheap last minute hack to get around a clipping issue that threw them into space and then they bounce around the planet. :D</p><p>Instructions</p><p>Mostly all information is provided on the UI. </p><p>Please note the little people will learn the map as they explore, as at first they only see around their first building</p><p>Clicking P or S (or pushing keys P or S) will put you in sculpt or place mode. </p><p>Left clicking in sculpt mode will raise land</p><p>Right clicking in sculpt mode will lower land.</p><p>Left clicking in place mode will place the tribe (can only do once unless reset)</p><p>Right click in place mode will plonk down a tree. </p><p>Placing people in water will cause them to go nuts. </p><p>mouse scroll zooms in camera.</p><p>Arrow keys rotate camera. </p><p>Backspace resets world.</p><p>Escape - Quits.</p>", "metacritic": null, "released": "2017-04-25", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/f81/f816f19dca0cbdcaee47656edd3be355.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 5, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Web"], "developers": ["binaryferret"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}