{"id": 12035, "slug": "steamhammervr-the-rogue-apprentice-london-1892", "name": "SteamHammerVR - The Rogue Apprentice - London 1892", "name_original": "SteamHammerVR - The Rogue Apprentice - London 1892", "description": "Story Mode 'The Rogue Apprentice' contains <strong>Eleven Missions</strong> which take you on a story based adventure staged in some of the most iconic locations around Victorian London, including, The Tower of London, Limehouse Warehouse, Trafalgar Square, Westminster, St Pauls and even the famous London Sewers. It's a hugely engaging and immersive experience with several types of challenging gameplay.<br/>As the narrative unravels you will unlock each mission. more of the story and more powerful weapons, there are plenty of twists and surprises to enjoy as you discover the truth about your recruitment as 'The SteamHammer'Seek &amp; Destroy Mode Seek &amp; Destroy mode gives you <strong>Four</strong> full on 'Arcade Wave Shooting' versions of SteamHammerVR, with a mass of combos to boost your score, see how far you can battle your way to the top of the Global Leaderboards! Try your hand at 'Panic on the Streets of London' , Have a pint in the Skillington Arms for the hilarious 'Bar Room Brawl', keep an eye on the time in Westminster for the 'Big Ben Bash' or go to the Tower of London for a 'Kick in the Crown Jewels'!Exceptionally Community Driven Features<ul><li>Unique VR Combat: With six different weapons and two hands you have over 36 weapon combinations with an amazing amount of physics to master.</li></ul><ul><li>Voice Commands: Want to keep you finger securely on the tigger? No problem, you can use several one word voice commands to instantly switch your weapon load out mid battle</li></ul><ul><li>4 Camera Angles and Auto Camera Switch for Monitors: See all the action from several angles or just let 'auto cam' switch between them</li></ul><ul><li>Challenging and Not so Challenging: Easy, Medium and Hard settings available for all modes</li></ul><ul><li>Testing Range: Before you go into the fray you can test all the functionality of your Exo-Suit and weapons</li></ul><ul><li>An Amazing Original Soundtrack album from Polish sound Magician Przemek Kasperski is included with the game</li></ul>SynopsisYour adventure takes place in Victorian London 1892, but dark deeds are afoot, aside from the distant cries for help in the fog, the streets seem eerily quiet but you are soon to realise why, the dastardly Professor Rattwurm is attempting to enslave the fine English folk with his army of clockwork automatons raging havoc all over town.<br/><br/>Using this new-fangled steam power, some ingenious state of the art 19th century gadgetry along with the guidance and expertise of Doctor Obadiah Springhorn you should be more than capable of victory.<br/><br/>From the safety of Springhorn's elaborately furnished command centre in the Airship 'Horndenburg' the story unfolds as you plan your strategy and practise with the all the weapons which will be at your disposal.  Your steam powered Exo-Suit has only two hands but your load out contains six unique and upgradable weapons which you can switch between during battle:- The Steam Hammer, The Steam Cannon, The Magnet Beam, The Rotor Saw, The Tesla Ray and The Rail Gun!<br/><br/>With some experimentation, a little strategy and a modicum of skill you should be able to complete all the missions and reveal the full story of 'The Rogue Apprentice'...if not you will be hauled back into the 'Hordenburg' for essential suit repairs and you can try again!", "metacritic": null, "released": "2017-01-20", "tba": false, "updated": "2019-08-28T22:13:32", "background_image": "https://media.rawg.io/media/screenshots/837/837fd18b73bb33d11e9f3196cea87a4c.jpg", "website": "http://www.steamhammervr.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 8}, "playtime": 7, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 508, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["GamestormVR"], "genres": ["Action", "Adventure", "Strategy", "Indie"], "publishers": ["Showstorm"], "esrb_rating": null}