{"id": 12033, "slug": "subsiege", "name": "Subsiege", "name_original": "Subsiege", "description": "In 2063, the world we know has ended. The climatic disaster, overpopulation and extensive consumption have resulted in the depletion of all natural resources on the continents. Now, the last resources on earth lie 30.000ft below the ocean surface.<br/><br/>An underwater resource war has broken out – with you as commanding officer right in the middle. Your mission: Secure the earth’s last resources in the embattled deep-sea.<br/><br/><br/><br/>Subsiege is an intense real-time tactic game with main focus on massive 12 player battles. In a grasping deep sea world, you command a hand-picked squad of hero-like units to contend merciless sea monsters and teams of fierce competitors while your oxygen runs out with every breath. Can you stand the pressure?<br/><br/><br/><br/><strong>Hero-like squads</strong><br/>Freely assemble your squad’s ability loadout and snipe your opponents’ ability casters to foil their strategy. Coordinate the squad set ups in your team and freely define team roles which work for you!<br/><br/><strong>Merciless struggle for oxygen</strong><br/>Survive unstoppable oxygen depletion and hunt down your foes to steal their vital oxygen. No hiding, no defensive play – fast-paced struggle for survival action only!<br/><br/><strong>Teamwork above all</strong><br/>Team up with a friend, contrive your unique battle plan and outplay your enemies. With shared oxygen reservoirs, resources and bases, seamless coordination and team work is crucial.<br/><br/><strong>Massive 12 player battles </strong><br/>Dominate the 12-player mosh pit, master your squad composition and ability timing and crush multiple rivals in one ingenious strike.<br/><br/><strong>Deadly environment</strong><br/>Counter surprise attacks of insidious sea creatures and trap your enemies above merciless deep sea worms. Watching your foes being badly ripped apart never felt better!<br/><br/><strong>Underwater paradise</strong><br/>Submerge into a fantastic underwater scenery, fight in between stunning illuminated corals and experience a lively underwater world with huge fish swarms, colorful reefs, thick black smoker clouds and steep cliffs.", "metacritic": null, "released": "2017-03-08", "tba": false, "updated": "2019-08-23T12:12:40", "background_image": "https://media.rawg.io/media/screenshots/7da/7da476fbeb8a19e6643cfac16f1d1133.jpg", "website": "http://subsiege-game.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 12, "beaten": 1}, "playtime": 2, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 378, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Aesir Interactive", "Icebird Studios"], "genres": ["Strategy", "Massively Multiplayer"], "publishers": ["Headup Games"], "esrb_rating": null}