{"id": 120366, "slug": "tower-slam", "name": "TOWER SLAM", "name_original": "TOWER SLAM", "description": "<p><strong>- - - - - I M P O R T A N T    N O T E - - - - -</strong></p>\n<p>There are two versions of this game. One contains the version for the game jam, the other has more than 48 hours of work put into it. To avoid breaking the honor rule, but still make the game in it's improved version available to others, this version is labeled \"NON_GAME_JAM\". If you are downloading to play the game yourself, use this version.</p>\n<p><strong>- - - - - C O N T R O L S - - - - -</strong></p>\n<p>A,D or Left and Right Arrow Keys <strong>-&gt;</strong> Move<br/>Spaaaaaace<strong> -&gt; </strong>Shoot</p>\n<p><strong>- - - - - D E S C R I P T I O N - - - - -</strong></p>\n<p>Use the different blocks to your advantage as you attempt to build a tower as high as possible!<br/>The blocks will come flying in from the sides while you shoot them to drop them into place.<br/>Combine blocks of the same color to connect them for more points and increased stability!<br/>If you want to change a block's color, shoot it again to make it switch. Watch out though!<br/>You only have a limited number of these shots available.<br/>Once you have reached a certain number of points, the blocks placed previously will harden and become immobile.<br/>This will also refill your color shots.<br/>If a block falls onto the ground, it will shatter and take points and one of your lives with it.<br/>Every time you lose a life, the blocks move faster, take care!<br/>If you run out of lives, it's an instant game over, so be careful.</p>\n<p><strong>- - - - - T H E M E - - - - -</strong></p>\n<p>This game fits the theme of the first GMTK jam, which was the dual purpose of mechanics, in multiple areas.<br/>First, shooting both makes blocks fall onto the structure and also changes their color.<br/>Second, the blocks connecting both gives you more points (making the next solidification grow closer) and makes the structure more stable.<br/>A block hitting the ground makes you lose points and drops one of your lives (making the blocks move faster).<br/>A solidification stabilizes the strucutre and refills the player's color shots.</p>\n<p><strong>- - - - - P L A T F O R M - - - - -</strong></p>\n<p>This game is intended to run on 32-bit or 64-bit Windows Operating Systems.</p>\n<p><strong>- - - - - T O O L S   &amp;   R E S O U R C E S - - - - -</strong></p>\n<p>Engine - Unity<br/>Font - Futura Renner (https://fontlibrary.org/en/font/futura-renner#FuturaRenner-Regular)<br/> [OFL License: http://scripts.sil.org/cms/scripts/page.php?site_id=nrsi&amp;id=OFL]<br/>Sprites - GIMP<br/>Sound Effects - Bfxr &amp; Audacity</p>\n<p><strong>- - - - - C O N T R I B U T O R S - - - - -</strong></p>\n<p>Backgrounds - LucasLislo<br/>Music - James Wilkinson (Overkillius)<br/>Testing - Ramkey</p>", "metacritic": null, "released": "2017-07-16", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/c16/c16e801f2075e681bb18bc50a7c0735f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 32, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Soul"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}