{"id": 12038, "slug": "child-of-ault", "name": "Child Of Ault", "name_original": "Child Of Ault", "description": "Game features:Toy system:<br/><strong>If you want to succeed in battle, simply being the \"best shot\" is not enough, you will also need a good strategy to manage your military forces. aka your ever expanding toy set.<br/><br/>Thankfully, you're not alone. Use your set of magic toys to defend against monsters’ attacks. Each  toy has a specific skill, opening up multiple strategies to take on waves of monster attackers.<br/><br/>Place your cute but deadly arsenal along the paths, between the monsters and your town crystal, and watch as they fight with you to eliminate your enemies.<br/><br/>At the end of each stage, you'll recieve a new monster busting toy to weild in the next zone. By the time you've mastered a few levels, you'll likely have a strong selection of adorable, albeit deadly little allies to help you in battle. </strong>Weapon System:<br/><strong>You're armed with a projectile launching sceptor which can fire magic missiles or use up to three additional special skills, which burn , freeze, or electrocute the monster hordes. Gain energy for these special shots by nailing the enemies in their tracks.</strong>Choose from multiple vantage points:<br/><strong>Teleport between towers, in order to get a better shot at the monsters and increase your chances of victory. Sometimes the best defense is a good offence, and sometimes that means taking the shot from a better vantage point.</strong>Playing instructions:<br/><strong>The magic sceptor works much like a bow and arrow. Hold the business end with your left hand and pull back with your right. Pull back further to fire the projectiles with increased speed and power. <br/><br/>Additionally, headshots count. Aim for the heads to gain maximum damage.<br/>Special elemental shots are managed with the thumb pad on the left Vive controller. Press up, down, left, or right, to choose from the four different elemental shots </strong><br/><br/><strong>Go forth and protect your lands.</strong>", "metacritic": null, "released": "2017-01-24", "tba": false, "updated": "2019-08-28T22:13:32", "background_image": "https://media.rawg.io/media/screenshots/b1c/b1cb16377466c7a0330772611d8f02fb.jpg", "website": "http://www.nezhagames.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 44}, "playtime": 4, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 456, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Hangzhou NezhaGames"], "genres": ["Action", "Adventure"], "publishers": ["Hangzhou NezhaGames"], "esrb_rating": null}