{"id": 120453, "slug": "searching-for-mother", "name": "Searching for Mother", "name_original": "Searching for Mother", "description": "INTRODUCTION\r\n<p>Hello there, PHLiM2 here. Way back in 2006, I started developing a game in RPG Maker XP which was to become <strong>Searching for Mother</strong>.</p><p>\r\n Over the years, I have improved my skills in game creation,\r\n art, and music composition. As a result, I have shifted the game from RPG Maker XP to VX, and finally to VX Ace, improving everything as I developed.</p><p>However, between 2015 and 2017,\r\n there were some major bumps in the road, which left me to release a messy, yet playable demo. Miraculously, I have managed to recover from these troubles, and have now buckled down to re-building everything the way I've envisioned it. (I haven't moved the project to RPG Maker MV, as the updates keep breaking things.)</p><p>So, I hope that this game will develop into something memorable that you can recommend to others!</p><p>~ PHLiM2</p>\nSTORY\r\n<p>In the land of Gaia, everything was in a state of peace and harmony,\r\n and life was good. That is, until a strange object fell to the planet with a loud explosion...</p><p>People from the nearby village came to investigate this strange object. As they peered inside, they saw a young girl holding a baby. They were injured and unconscious.</p><p>The people did not know what to do, until a young boy stepped in and suggested that his family nursed them back to health. The village folk were unsure at first, but soon gave in to the boy's request.</p><p>Years passed, and the young girls had fully recovered, but neither of them had memories of their past lives. All they could recall were their names.</p><p>As they grew up, the young boy who had taken them in had become a seasoned hunter, and was willing to show the eldest of the two girls, Michiro, the tricks of the trade in order to survive. They stay in an unoccupied residence in the middle of a forest as their new home.</p><p>As Michiro and her younger sibling Miho grow up, Michiro suddenly begins to have strange dreams...</p><p><em>What are these dreams, and why is Michiro the only one experiencing them...?</em></p><p>Coincidentally, strange things begin to happen in Gaia as creatures increase in size and become vicious. Just what is going on...?</p>MAIN CHARACTERS\r\n\r\n\r\n\r\nMICHIRO CHIHARA<br/><strong>VA:</strong> Rasuka\r\n\r\n\r\n\r\n<strong>AGE:</strong> 17<br/>\n<strong>SPECIES:</strong> Elf<br/>\n<strong>ELEMENT:</strong> Water<br/>\n<strong>WEAPON TYPE:</strong> Bows<p>Michiro was one of the two girls who was found in the strange object 12 years ago. She's a little bit scatterbrained, and is often oversleeping. Luckily, she has her sister Miho to make sure she doesn't oversleep often!</p>\r\n\r\n\r\n\r\n\r\nMIHO CHIHARA<br/><strong>VA:</strong> Tomoyo Ichijouji\r\n\r\n\r\n\r\n<strong>AGE:</strong> 13<br/>\n<strong>SPECIES:</strong> Elf<br/>\n<strong>ELEMENT:</strong> Water<br/>\n<strong>WEAPON TYPE:</strong> Magic Rod<p>When Miho was found with her sister, she was only a year old. Now, she is an adept healer at a young age, and has a twisted sense of humor (especially when Michiro is involved.)</p>\nVOLUNTEERS WANTED!\r\nIf you,\r\n or anyone else, has any experience in the following fields, and don't mind helping out with this lengthy project, please feel free to let me know in the comments!\r\n<ul><li>Musician</li><li>Sprite Artist</li><li>Monster Concept Artist</li><li>Background Artist</li><li>Voice Actor/Actress</li></ul>\n\r\n\r\nDOWNLOADING THE DEMO<p>Click on the latest demo's download in the section below, and save to your computer.</p>\nINSTALLING\r\n\r\n<ul><li>Open up the downloaded executable.</li><li>Extract to a folder of your choice</li><li>Create a shortcut to the demo for ease of access.</li></ul>\nRMVX ACE RTP REQUIRED\r\n\r\n<p>Requires the RPG Maker VX Ace Runtime Package. This usually comes pre-installed with all releases of RPG Maker VX Ace.</p><p>If you do not have RPG Maker VX Ace installed, or have never installed the Runtime Package before, click here to download it.</p>\r\nDISCORD?\r\n\r\n<p>Yes, this game does have a Discord. Here you'll be updated on progess as I make it.</p><p>Also, if you're interested in helping out with the game, this would be a great place to ask me.</p><p>Just click on the Discord logo below:<br/></p>", "metacritic": null, "released": "2018-02-26", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/9c3/9c305d68ea6276e5a258d30f0e20fc29.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 93, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["PHLiM2 Games"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}