{"id": 12040, "slug": "il-2-sturmovik-battle-of-stalingrad", "name": "IL-2 Sturmovik: Battle of Stalingrad", "name_original": "IL-2 Sturmovik: Battle of Stalingrad", "description": "<strong>IL-2 Sturmovik: Battle of Stalingrad</strong> is the continuation of the <strong>legendary IL-2 Sturmovik series</strong> that has set the standard for PC combat flight games for more than ten years. This new entry into the series will offer virtual pilots an even more accurate simulation of the most famous air battles of World War II. Better quality of content, bigger scale , new physics, more realistic aerodynamics and new game elements set this title apart from all which came before. We have only one goal - To give you a New Higher Level of Immersion!<br/><br/><strong>Key Features:</strong><br/><br/><strong>PLAY:</strong><br/><ul><li> Robust Single-Player Campaign that features a challenging and innovative AI system. Includes an extensive in-game achievement system that allows players to unlock historically based airplane modifications and upgrades as your campaign progresses.<br/></li><li> Realistic graphics and unique visual effects: clouds, lightning, tracers, explosions and huge smoke plumes - all of them fully realized to recreate the aerial combat scenerey of war time Stalingrad.<br/></li><li> Flexible Quick Mission mode that allows you to create your own custom combat scenario in just a couple of minutes.<br/></li><li> Classic Multiplayer gameplay with dedicated player controlled servers with your favorite settings for team battles and dogfight duels. </li></ul><br/><strong>FLY:</strong><br/><ul><li> Realistic sounds and physics, detailed aircraft systems modeling, advanced aerodynamics and state-of-the-art flight modeling gives you a real sensation of flight.<br/></li><li> Become an ace fighter pilot or try your hand at flying attack planes and bombers where you can destroy tanks, trucks, AAA batteries, artillery units and even armoured trains.<br/></li><li> Control your plane with either joystick or mouse keeping a highest level of simulation fidelity and accuracy.<br/></li><li> For those that won’t make it back to base, each plane comes equipped with a handy parachute!</li></ul><br/><strong>COMBAT:</strong><br/><ul><li> Hone your skills versus AI or join multiplayer where you can fight in the air or on the ground, manning T-34-76 or Pz III Ausf L tanks.<br/></li><li> Control a plane or tank all by yourself or have your friend aim a tank gun or a bomber turret.<br/></li><li> Unique and detailed damage model lets you use the pros and cons of various aircraft and tanks to your advantage.<br/></li><li> Adjust the tank aiming sights for distance and view the tank interior just as a plane cockpit!</li></ul><br/><strong>LEARN:</strong><br/><ul><li> Action takes place on a 358 х 230 km map - The largest and most detailed recreation of the Battle of Stalingrad theatre ever modeled in a flight simulation with unique structures, buildings and landscapes.<br/></li><li> Single-Player Campaign scenario follows the real chronology of the battle starting with Operation Uranus on November 19th, 1942 and continues to the complete liberation of the city on February 2nd, 1943.<br/></li><li> Ten Legendary aircraft of the era have been thoroughly re-created using original drawings and blueprints from the Central archive of the Russian Ministry of Defence.<br/></li><li> Precise simulation of the flight model allows everyone to learn the special character and limits of each and every plane in the game. Use each of their special abilities and performance characteristics to complete your mission and survive the brutal fight.</li></ul><br/> <br/><br/> <br/><br/> <br/><br/><br/><br/>", "metacritic": 74, "released": "2014-09-23", "tba": false, "updated": "2022-09-27T13:43:47", "background_image": "https://media.rawg.io/media/screenshots/bba/bba05750402df32e81e0adad7809dd75.jpg", "website": "http://il2sturmovik.com/", "rating": 3.5, "rating_top": 5, "added_by_status": {"yet": 6, "owned": 127, "beaten": 3, "toplay": 9, "dropped": 4, "playing": 1}, "playtime": 2, "achievements_count": 0, "ratings_count": 8, "suggestions_count": 485, "game_series_count": 8, "reviews_count": 8, "platforms": ["PC"], "developers": ["777 Studios", "1C Game Studios"], "genres": ["Simulation"], "publishers": ["1C Company"], "esrb_rating": null}