{"id": 120439, "slug": "neon-genesis-quaternion", "name": "Neon Genesis Quaternion", "name_original": "Neon Genesis Quaternion", "description": "<p>Neon Genesis Quaternion (or NGQ) is a game about navigating space monoliths with Newtonian physics.</p><p>This project is indefinitely on hold, but there's enough done that you might find it interesting.</p><ul><li><strong>I effectively wrote a microcontroller for the rotational thrusters.</strong><ul><li>Use the mouse to aim around. This will feed a \"desired rotation speed\" to the microcontroller, relative to the cursor's current location. It will then input rotational thrust (with a maximum value based on what i thought would be realistic) to rotationally-accelerate your suit until it hits the desired rotation speed.</li><li>There's a maximum rotation speed within this system, but you can exceed it via collisions. The suit will automatically detect this and apply thrust to correct it.</li></ul></li><li>Currently 2 of the 3 navigational tools are implemented (grappling hook and turn anchor).<ul><li>The blue beam coming from your \"gun\" is the hook's aimpoint. Click when it intersects something in order to connect to it. There's no beam implemented, but a pink cube will appear on the surface you're connected to. The beam has a maximum range of 1km.</li></ul></li><li>Only one grab-bag environment, but it's got a damn-snazzy spacescape.</li><li>Full sound and 80% of the \"animation\" done.</li><li>Full microgravity physics.<ul><li>Mild collision problems might occur if you drag across moving surfaces; unknown collision problems if you let yourself get pinched in this one particular moving environmental piece...</li></ul></li><li>I've only tested it in Windows. OSX and Linux builds are untested, but if Unity's export function works it should work fine...</li></ul><p><strong>The game is now free</strong>, because I think it's a good portfolio piece, and it's not really much of a game. Still, the CAD-USD exchange rate is ridiculous and Devs Deserve To Be Paid, so I would be thrilled if you play this and decide it's worth your cash (any amount of cash!)</p><p>For more information, see the development blog here: http://toddsusser.tumblr.com/tagged/ngq</p>", "metacritic": null, "released": "2016-02-03", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/c26/c266ddcce467e22ec0eac2473e1c096a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 34, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["NetSalvage"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}