{"id": 12043, "slug": "polyball", "name": "Polyball", "name_original": "Polyball", "description": "GET READY TO ENTER A NEW ERA OF PHYSICS PLATFORMING Polyball is a modern take on classic ball rolling games such as Super Monkey Ball, Marble Madness, and Marble Blast - while taking cues from games such as the Sonic series, Trials, and Mario Kart.A BIT ABOUT US...The first full release from digital design practice Studio Monolith, Polyball is an experiment in low-poly visuals and open-ended game design. Our approach with the project was to make the kind of game we used to play, something that had both casual appeal and a limitless competitive ceiling. It was also a genre that we felt hasn't been adequately adapted to the modern world of game design. Our vision was simple: build a game that's easy to pick up, hard to master, and fun both on and off screen....AND A BIT ABOUT POLYBALLThere's a lot to do in Polyball -- Challenge yourself or a friend to one of over 60 levels included in the initial release, with plans for many more levels via <strong>free</strong> DLC. If you've got some friends over and are looking for something to play, <strong>Polyball's</strong> splitscreen multiplayer promises a good time. With classic modes like <strong>Battle</strong> and <strong>Circuit Race</strong>, as well as a multiplayer version of the single-player experience, Polyball promises to be a must-have party game.CASUAL, COMPETITIVE, OR BOTHWith global leaderboards built right into the level select menu and pregame screen, you can see where you stand among the worlds best and race against their ghosts. If you're more interested in beating your friends, check out the friends-only leaderboards. Collecting shards during your single-player journey will unlock a vast array of customization options, from different ball models to particle effects. This customization carries over into online multiplayer matches as well as your high-score ghost, with local multiplayer having its own version of the customization system designed for split-screen play.FOR THE PEOPLE, BY THE PEOPLEIf you've mastered every challenge we put into the game, take a look at the Steam Workshop content to face a whole new set of challenges. Community made content, from multiplayer battle maps and circuit tracks to customization options and single-player levels, will bridge the gap between developer and player as well as provide a steady stream of new content for you to experience. Steam Workshop gives the players a voice, allowing for the mechanics and level designs of Polyball to stretch far beyond what we had initially put into the game.FEATURES<br/><ul><li> 60+ levels and free DLC<br/></li><li> Powerful customization system<br/></li><li> Full controller support<br/></li><li> Extensive multiplayer support - online/splitscreen<br/></li><li> Global/Friends Leaderboards<br/></li><li> Full soundtrack made by independent artists<br/></li><li> Steam Workshop<br/></li><li> Tuned mechanics and balanced levels based on community feedback<br/></li><li> Mac/Windows/Linux support<br/></li><li> Alternate language localization<br/></li><li> Ghosts<br/></li><li> Steam Cloud Saves</li></ul>MULTIPLAYER MODES<br/><ul><li> Trails<br/></li><li> Battle<br/></li><li> Circuit Race<br/></li><li> Tower Climb<br/></li><li> Split-Screen + Online Story Mode<br/></li><li> Many more!</li></ul><br/>Please be sure to check the Early Access tab to see the current state of the game.", "metacritic": null, "released": "2015-06-04", "tba": false, "updated": "2024-03-09T08:24:03", "background_image": "https://media.rawg.io/media/screenshots/e84/e84f6ed350f1efc4a8fbd7881d9cbebb.jpg", "website": "http://polyball.studiomonolith.ca", "rating": 2.17, "rating_top": 1, "added_by_status": {"yet": 86, "owned": 1726, "beaten": 5, "toplay": 2, "dropped": 18, "playing": 2}, "playtime": 1, "achievements_count": 33, "ratings_count": 66, "suggestions_count": 237, "game_series_count": 0, "reviews_count": 66, "platforms": ["macOS", "Linux", "PC"], "developers": ["Studio Monolith"], "genres": ["Action", "Simulation", "Racing", "Indie"], "publishers": ["Studio Monolith"], "esrb_rating": null}