{"id": 120628, "slug": "bait-line", "name": "Bait Line", "name_original": "Bait Line", "description": "<p>Welcome to Bait Line! One of the most popular radio-shows in all the ocean! The experienced Dr. Gill is ready to answer your calls and help you solve all your issues, with his unique charm for transmitting kindness to all fish through the sea! </p>\n<p>Become Dr. Gill and aid six different sea creatures with all their unique issues, problems and personality waiting to be solved! Pick between three different answers and help spread kindness (or not) to their lives. Depending on the way you interact with the different fish, the program’s ratings will increase and decrease. </p>\n<p>Will you help these sea creatures find their way and reach the top of the ratings? Or will you lead Dr. Gill into a completely different direction?</p>\n<p>Created for Global Game Jam 2018<br/></p>\n<strong>Features</strong>\n<ul><li>Hear and help solve the personal issues of six different sea creatures, including a sassy octopus, a rebel clown fish and a panicking swordfish!</li><li>Pick from three different replies to each of the creature's problems or questions! Each of the answers has a different tone from the others.</li><li>Depending on your pick, and how the audience finds your answers, your program's ratings will go up and down! Will you reach the top of the radio-show list, or will you sink it to the bottom?</li></ul>\n<strong>Controls</strong>\n<ul><li>Use a Mouse to click, or your Touch Screen to tap to advance messages and pick from the choice bubbles.</li><li>Alternatively, use the Space-bar in the Keyboard to advance text, and use the 1, 2 and 3 keys to pick one of the choice bubbles from left to right.</li><li>Quit the game by pressing Escape (Desktop) or the Back Arrow (Android).</li></ul>\n<strong>Credits</strong>\n<ul><li>Development Team<ul><li>Graphics Artist - Diana Gomes (Midreky)</li></ul><ul><li>Programming - Jorge Carvalho (JorgeGameDev)</li></ul><ul><li>Audio and Writing - Henry Smith (Henforth)</li></ul></li></ul>\n<ul><li>Special Thanks:<ul><li>Fonts (Chelsea Market) - Tart Workshop</li><li>Rewired Unity Input Wrapper - Guavaman Enterprises</li><li>Text Mesh Pro - Unity Technologies (Stephan Bouchard)</li><li>Looperman and Freesound.org - Royalty Free Loops and Sound Effects</li><li>Universidade Europeia (IADE) - Jam Site</li></ul></li></ul>", "metacritic": null, "released": "2018-02-03", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/e2d/e2d7915cfe978e3393001f2c1b384cf7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 63, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Android", "Web"], "developers": ["JorgeGameDev", "MIDREKY", "Henforth"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}