{"id": 120668, "slug": "linuxer", "name": "Linuxer", "name_original": "Linuxer", "description": "<p>Challenge yourself using linux commands to discover, protect, and install software packages in your virtual machine. It about several stages and each stage has its tasks that you have to complete.</p><p>The aim of game is to teach you how to use linux commands to control your linux-based operating system, currently the game has few stages and it has be increased no future.</p><p><strong>Features:</strong></p><ul><li>Learn how to use linux commands: learning linux commands that used to move between directories, knowing current path, executing programs (linux commands like pwd, ls, cd, cat, exit, …)</li><li>Give you basic introduction to networking: how to know your machine's IP address, what is a network and how to connect to a network.</li><li>Learn how to protect your machine: establishing firewall for your machine, how to deal with 'iptables' command-based tool.</li><li>Practice 'learn by doing' methodology when you finished each stage of game: user or player has to finished each task by using linux commands to open next stage, he/she has to learn little about commands that should be use by using documentation provided in game.</li><li>Each task provided documentation of linux commands: useful documentation if you don't know how to use special linux command, or which command is specialized for finishing a single task.</li></ul><p><strong>Availability:</strong></p><p>iOS &amp; macOS platforms.</p><p><strong>For more information, check my blog post about the game:</strong></p><p>http://smalldigits.com/blog/linuxer-explore-linux-behind-the-scenes<br/></p>", "metacritic": null, "released": "2016-08-12", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/263/263614b0469b6f40f139b2bd3767d02c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 70, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "Android"], "developers": ["Small Digits"], "genres": ["Simulation", "Educational"], "publishers": [], "esrb_rating": null}