{"id": 120794, "slug": "combat-chopper", "name": "Combat Chopper", "name_original": "Combat Chopper", "description": "<p>A fast-paced action arcade game where you control a helicopter and fight against a terrorist organisation, accomplishing different mission objectives such as destroying enemy armor, buildings, bridges, helicopters, rescuing hostages, destroying escaping convoys and even preventing a nuclear catastrophe!</p><p>Every time you're promoted in rank you'll be granted a special permanent upgrade for your helicopter. Do you have what it takes to reach the highest rank?</p><p>Features:</p><ul><li>17 missions of increasing difficulty</li><li>A varied arsenal, with a vulcan rapid-firing cannon, dumbfire rockets, guided hellfire bombs (using TADS system) and flares (to divert incoming enemy homing missiles). All weapons can be upgraded</li><li>A wide range of mission objectives</li><li>Rank-based system (if you do things right, you get points and can be promoted; if you mess up - e.g. destroy civilian targets - you lose points and may even be demoted!)</li><li>Ability to land back at base to refit your helicopter in the middle of a mission (resupplying costs points - if you're quick, accurate and agile, you'll save points which add to your rank-o-meter!)</li><li>Weapon and system upgrades with each rank promotion</li><li>2 sets of unlockable content (beat game/reach highest rank to unlock each!)</li></ul><p>Ratings and comments are welcome!</p>", "metacritic": null, "released": "2017-02-25", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/67c/67cdfd20f6e9d3a89a532d8597fe1f59.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 97, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["AlejandroG"], "genres": ["Action", "Simulation"], "publishers": [], "esrb_rating": null}