{"id": 120735, "slug": "penguin-deliveries", "name": "Penguin Deliveries", "name_original": "Penguin Deliveries", "description": "<p>Initially created in 72 hours for Ludum Dare 38, the game takes the jam's theme of \"Small world\" far too literally. </p>\n<p>Inspired by fight-the-inevitable-force-of-gravity games of old such as Lunar Lander, <em>Penguin Deliveries </em>tasks you to navigate between planets across a variety of levels; dodging asteroids, struggling against planetary gravity and admiring the attractive assortment of foliage and buildings, all presented in a bright and colourful art style.</p>\n<p><em>Penguin Deliveries</em> will be showcasing at the Norwich Gaming Festival on the 2nd and 3rd of June.</p>\n\r\nPRESSKIT\r\nGame:\r\n<p><strong>Name: </strong>Penguin Deliveries<br/><strong>Genre:</strong> Platformer<br/><strong>Platforms: </strong>Windows, MacOS, Linux, HTML5</p>\r\nDescription:\r\n<p><em>Penguin Deliveries</em> is a 2D physics-based platforming game where you pilot between planets, overcoming gravity and obstacles to reach your destination whilst racing against the clock across bright and colourful levels.</p>\r\nHistory:\r\n<p><em>Penguin Deliveries</em> was originally built in three days for the 38th Ludum Dare game jam using the theme \"Small world\". Since then, it has been refactored, added to, refactored again and has had many nuts and bolts attached to it over the last year.</p>\r\nFeatures:\r\n<p>- Gravity-based platforming gameplay as a love-letter to games like Lunar Lander and Gravity Force.<br/>- Bright and colourful art style, using flat illustration.<br/>- Increasingly challenging levels with par timers and scoring.<br/>- Penguin astronauts.<br/>- Lovely music from BoxCat Games' Nameless OST.<br/>- Infinite replayability</p>\r\nDeveloper:\r\n<p><strong>Name:</strong> Shaun Wall<br/><strong>Email: </strong>shaunlewiswall@gmail.com<br/><strong>Twitter: </strong>@nomaki</p>\r\nBio:\r\n<p>Primarily a web developer, Shaun wears an assortment of attractive hats in his various roles in the games industry. In addition to co-owning and writing for gaming review and news site Big Boss Battle, he develops games in his spare time and works with small indie studios to assist with community and marketing efforts.<br/></p>", "metacritic": null, "released": "2017-04-24", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/527/527dfa48f41f372bf5b73a53d22db90b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 34, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Web"], "developers": ["Nomaki"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}