{"id": 12077, "slug": "spiritsphere", "name": "SpiritSphere", "name_original": "SpiritSphere", "description": "<strong>NOTE: This game is build around a local multiplayer setting. There is no online multiplayer.<br/>The game does feature a singleplayer mode, but the main meat of the game is the local multiplayer mode!</strong><br/><br/>SpiritSphere is a competitive local multiplayer game that draws inspiration from classics like Zelda and Windjammers and mashes it together with the nostalgic feel of playing air hockey at your local arcade. The game is easy to pick up, but hard hard to master and can quickly lead to heated one-versus-one battles of wits and reflexes as you fight for each point.<br/><br/>Take a pick from multiple characters with their own unique abilities and battle it out in a variety of arenas set in a classic RPG world. Stay on your toes as there are power-ups to collect that can help you or your opponent to suddenly turn the tide and take home the victory!<br/><br/>The game features an 8-bit art style that sticks closely to the NES color palette and associated restrictions. The electrifying soundtrack is by the hands of Gas1312.Features<ul><li> Competitive local multiplayer action<br/></li><li> Fast paced arcade style gameplay<br/></li><li> Multiple stages, characters and balls to play with<br/></li><li> Retro flavored graphics and sound<br/></li><li> Easy to pick up, hard to master</li></ul>", "metacritic": 64, "released": "2017-01-23", "tba": false, "updated": "2019-08-28T22:13:30", "background_image": "https://media.rawg.io/media/screenshots/6f9/6f9d5f213b4f2f49009fc33e72b5118d.jpg", "website": "http://eendhoorngames.com/press/sheet.php?p=SpiritSphere", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 33}, "playtime": 3, "achievements_count": 15, "ratings_count": 1, "suggestions_count": 154, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Eendhoorn Games"], "genres": ["Action", "Sports", "Casual", "Indie"], "publishers": ["Eendhoorn Games"], "esrb_rating": null}