{"id": 12071, "slug": "lucidity", "name": "Lucidity", "name_original": "Lucidity", "description": "From the team that re-imagined The Secret of Monkey Island™, comes Lucidity, an addictive puzzle platformer set in the surreal childlike dreamscapes of the little girl Sofi. In this challenging puzzler, it’s your task to keep Sofi safe as she drifts deeper into the strange new world of her dreams. Featuring stunning hand-illustrated visuals, a spell-binding original score and unique puzzle platformer gameplay, Lucidity will challenge your wits, test your reflexes and mesmerize your senses.<br/>\t\t\tTake a trip into the surreal childlike dreamscapes of Sofi, a little girl filled with a persistent desire to explore new worlds and overcome all obstacles in her way. Test your skills in this addictive puzzle platformer where through quick reactions and placement of unique puzzle pieces, you create a path to help Sofi traverse safely through 27 visually stunning, hand-illustrated dreamscapes. <br/> <ul><li><strong>A Surreal Fantasy</strong> - Take a fantastic journey with little Sofi as she drifts into a vivid dream world where, beckoned by the kind words of her grandmother, she learns to overcome her fears.<br/> </li><li><strong>Mesmerizing Dreamscapes</strong> - Like a children’s storybook come to life, get lost in mesmerizing dreamscapes detailed with beautiful hand-drawn contemporary art.<br/> </li><li><strong>Spell-binding Original Score</strong> - Featuring a lush original score that will draw you into Sofi’s dream world.<br/> </li><li><strong>Addictive Puzzle-Platformer Gameplay</strong> - Skillfully place unique puzzle pieces designed to propel Sofi to and from suspended platforms, or over and under obstacles, in an effort to maintain her state of perpetual motion.<br/> </li><li><strong>Unlockable Steam Achievements</strong> - Collect fireflies on your adventures to unlock additional bonus levels and achievements to make it to the top of the leaderboards.<br/> </li></ul>", "metacritic": 59, "released": "2009-10-07", "tba": false, "updated": "2023-04-14T13:44:20", "background_image": "https://media.rawg.io/media/screenshots/bc8/bc84427869bdc5a596b2b1718117482f.jpg", "website": "http://www.lucasartsworkshop.com/", "rating": 2.56, "rating_top": 1, "added_by_status": {"yet": 7, "owned": 123, "beaten": 4, "toplay": 1, "dropped": 1}, "playtime": 1, "achievements_count": 15, "ratings_count": 9, "suggestions_count": 410, "game_series_count": 0, "reviews_count": 9, "platforms": ["Xbox 360", "PC"], "developers": ["LucasArts Entertainment"], "genres": ["Action", "Casual", "Platformer"], "publishers": ["Disney Interactive", "LucasArts Entertainment"], "esrb_rating": "Everyone"}