{"id": 12083, "slug": "resfort", "name": "Resfort", "name_original": "Resfort", "description": "Your story was started one autumn night. You and group of friends falls asleep in your tents, dying campfire flicks outside when night descended on forest with scary sounds. When you closed your eyes you heard terrifying loud cry that drove away dreams caused you to check out friends. You find that your friends are gone and next to their tent were footprints leading into the forest. Through fear of the unknown, you must go deep into the forest and to understand all secrets of this place.<br/><br/> <ul> <li>Storyline - Complete 9 wonderful chapters and solve the mysteries of this world.  (Soon)<br/></li><li>Co-op for 4 players - Create you own puzzles and solve it with your friends. <br/></li><li>Map editor - The map editor will allow you to enjoy all the delights of creating levels. <br/></li><li>Fascinating story - You will remember our story for a long time. <br/></li><li>Steam WorkShop - Make, upload, download and complete community levels. <br/></li><li>Achievements - Find all the secrets. <br/></li><li>Graphic - Surrealistic art with a hint of abstract.</li></ul><br/>Main genre of out game - platformer. You have to pass different obstacles with climbing, crawling, jumping or running. If you want to stay alive you have to use all that comes to hand and not only that.<br/><br/>It isn't ready:<br/>Full line of a plot.<br/>Achievements.", "metacritic": null, "released": "2017-08-25", "tba": false, "updated": "2019-08-28T22:13:30", "background_image": "https://media.rawg.io/media/screenshots/61f/61f4218887b9274b5b0400ad3e332155.jpg", "website": "http://www.fourinonunion.com/resfort", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 15}, "playtime": 4, "achievements_count": 6, "ratings_count": 0, "suggestions_count": 223, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Nuked Games"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Fourinon union", "Mushrooms Group"], "esrb_rating": null}