{"id": 120800, "slug": "hold-on-itch", "name": "Hold On! (itch)", "name_original": "Hold On! (itch)", "description": "<p>\r\n\tHold On! is an endless high score based arcade game with a unique, simple and extendable control method.\r\n</p><p>\r\n\tIt's simple because the core control method is set to pressing or holding keys that show up on screen. Simple right? But when we add up to 12 letters you can imagine why it's considered a finger bending experience! Based on my experience taking Hold On! to local conventions, people who don't always see themselves as gamers can pick up the basics quickly.\r\n</p><p>\r\n\tWhat makes this unique is its core mechanic introduces a hardware limitation. No it doesn't need multiple graphics cards and the latest CPU with the most cores, it needs a keyboard that can register up to 12 keys at a time (this is called N-Key Rollover or KNRO):\r\n\t<br/>\n</p><p>\n<em>- Normal keyboards have 2-3 NKRO</em>\n</p><p>\n<em>- 'Gaming' keyboard have 5-8 NKRO</em>\n</p><p>\n<em>- Mechanical / Fake mechanical keyboards have full NKRO (all the keys will be picked up by the computer!)</em>\n</p><p>\r\n\tTo play Hold On! without it seeming like its unresponsive you'd need a mechanical/fake mechanical keyboard, although you can still get the feel of the game with other keyboards.\r\n</p><p>\r\n\tGiven Hold On!s simple base mechanic it can be modified in many different ways to create interesting and fun gameplay. As shown in the GIFs the letters can turn invisible, move or spin around. In later versions of the game there will be more mod types to play with and even the functionality to combine mods (I find invisible and moving letters to be very VERY difficult!). The core 'holding' method can be changed as well, an example of this is a 'Tapper' type in which the player only needs to press the key rather than hold it. Having this extendable structure allows endless potential future updates to Hold On!\r\n</p><p>\n</p><p>\r\n\tKeep up to date by following on Twitter:\r\n\t<br/>\r\n\t@OriginalHussain\r\n\t<br/>\r\n\t@HoldOnGame\r\n\t<br/>\n<br/>\r\n\tLike the game on Facebook:\r\n\t<br/>\r\n\tfacebook.com/HoldOnGame\r\n\t<br/>\n<br/>\r\n\tIf you want to contact me directly send me an email:\r\n\t<br/>\r\n\thussainpatel@hotmail.co.uk </p><p>\r\n\tThe name generation would not have been possible without the help of Emily! Check out her site: \r\n\thttp://fantasynamegenerators.com/\r\n</p><p>\r\n\tThis game is best experieneced on a keyboard with an NKRO equal or higher than 10 (either mechanical or equivalent). To test your NKRO go \r\n\there and hold down multiple different keys (or try the widget below!).\r\n</p><p>\n</p>", "metacritic": null, "released": "2015-09-11", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/de8/de8b123910ac956856ecf6435ee2deef.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 88, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Hussain"], "genres": [], "publishers": [], "esrb_rating": null}