{"id": 120888, "slug": "city-mineral-the-way-to-find-mineral", "name": "City Mineral: The way to find mineral", "name_original": "City Mineral: The way to find mineral", "description": "<p>What is the city mineral?</p>\n<p>City mineral is minerals extracted from used objects.</p>\n<p>For instance, a used bottle. Plastic can extract from the bottle by melting it. The achieved plastic can reuse to make a new bottle. Used cellphone? yes. will get battery, wire, PCB, glass, plastics.</p>\n<p>City mineral will high-value industry for future or sooner.</p>\n<p>As we know, mineral resources are limited where buried the earth and it will be going out soon. Have you ever heard that the plastic island wherein pacific? Trash is everywhere, and it makes trouble. People need a plastic cup but the plastic material is already exhausted. A few remaining plastic price going higher and higher. If you know how to get a plastic, you will get money!</p>\n<p>This is the motivation of this app.</p>\n<p>This app developed one man by myself. I know that game quality is low, the scenario is not ready. To make the better app, I have planned to update by weekly.  If somebody downloads this app, please playing once and give me any suggestion or find the bug or something.</p>\n<p>Your feedback encouraging me and keep working on this project.</p>\n<p>[Facebook]</p>\n<p>https://www.facebook.com/groups/cityminer/</p>\n<p>[Twitter]<br/></p>\n<p>https://twitter.com/JiseobRyu</p>\n<p>[Blog]</p>\n<p>http://happyryu.com/</p>\n<p>[Email]<br/></p>\n<p>Jiseob.RYU@gmail.com</p>", "metacritic": null, "released": "2017-12-26", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/509/509a57909eeb249af66ddbe28ffd6e21.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 269, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Jiseob.RYU"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}