{"id": 120892, "slug": "danmakoid", "name": "Danmakoid", "name_original": "Danmakoid", "description": "<p>Hello and thank you for picking and playing Danmakoïd!<br/>It is a solo gamejam project made for LD41, in 48 hours.<br/>Jam theme was \"Combine two uncompatible genres\". I went with a mix between a metroidvania and a danmaku (bullet hell), hence the portmanteau name!</p>\n<p>HOW TO PLAY<br/>==========<br/>wasd/arrow keys - move<br/>space - shoot (you need the upgrade first), you cannot turn around when shooting</p>\n<p>WHAT DO I DO?<br/>=============<br/>explore, grab any ship upgrade you find and hunt the alien queen down!<br/>Your weakpoint/hitbox is located on your cockpit. If you clear a midboss room you will regenerate one life!<br/>The game is VERY HARD and might take you several tries. Figure out which route is the safest for you and you might be lucky enough to meet her majesty :)</p>\n<p>HOW WAS THE JAM?<br/>================<br/>I tried using an upside down workflow in order to evaluate how much time asset creation takes me. Assets first, risky and weird but fun!<br/>Needless to say I got late on schedule, as planned :p<br/>As you will have noticed, some stuff is missing: no music, lack of a good looking background and UI, and sound effect volume is all over the place!<br/>I am happy with what I got though, lots of content for a 48h solo game!<br/>I hope you will enjoy the game besides its flaws!</p>\n<p>WHO ARE YOU?<br/>===========<br/>My nickname is Talops, I am a belgian technical artist student (jack of all trades with shader magic!), currently in the 3rd year of my Bachelor and undergoing an internship.<br/>I love hard games in general, and especially input/movement-heavy ones. My adoration for the metroidvania and bullet hell genres are what inspired me to make this one!<br/>Drop me a tweet! @talopsit<br/><br/></p>", "metacritic": null, "released": "2018-04-23", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/2e8/2e8e0faa173e43f780fdd48caacb1551.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 38, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Talops"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}