{"id": 120941, "slug": "strike-demo", "name": "Strike DEMO", "name_original": "Strike DEMO", "description": "<p>Full game available at</p><p>http://frank-griffin.itch.io/strike-of-the-centuri...<br/></p><p>for 4.99.</p><p>2015-9-26 Updated the graphics and optimized the code to handle the more resource hungry routines. I added a graphics level item to lower the graphics for very slow machines.</p><p>The game at it's core is an asteroids style game.</p><p>I wanted the game to be clear and concise.</p><p>I made the scoring system based on resources but you need to use some or all of the resources to upgrade your ship.</p><p>It is explained in the game but unspent resources grow at about 10% each round like interest in a bank.</p><p>To maximize score and to live longer, the player must not spend all resources every turn or they will suffer the consequences later in the game.</p><p>There are 60 discrete levels to the mission aspect of the game.</p><p>A story about the aliens is revealed as you progress through the levels.</p><p>There are also warnings and data about enemies between levels.</p><p>Your ship starts out incredibly weak but at the end of each level you can purchase equipment to beef it up.</p><p>You are allowed to sell most equipment at no cost and reconfigure your ship as desired.</p><p>Some upgrades must be unlocked first before you can buy them.</p><p>Crew members and timed power ups would be the examples of this.</p><p>A few crew members can be trained to be able to repair the ship or operate tracker beams and such.</p><p>The game has a survival mode that throws asteroids and enemies at you until you die.</p><p>Like in the mission levels you start out weak but a continuous stream of permanent power ups are released to improve your ship.</p><p>They are released at about one every 10 seconds.</p><p>The upgrades you get are mostly random in survival mode.</p><p>There are a few check points to correct the next upgrade if there is a large imbalance in upgrades.</p><p>There are four levels of difficulty (super easy, easy, normal and hard).</p><p>The default difficulty is normal and it is fairly difficult.</p><p>The easier modes start up with slightly more money and the power of your weapon doubles with each lowering of the difficulty level.</p><p>Objects are 8 time harder to kill in hard versus super easy.</p><p>I added a rogue mode to the game.</p><p>You can save your game but if you ever die during rogue mode your save game will be deleted.</p><p>There is an options area that allows players to change the keyboard commands and test for bad combinations of keys.</p><p>fdg@y12.doe.gov if you have any questions.</p><p>I have worked on this game for about 10 years in my spare time.</p><p>Game requirements.</p><p>XP-win7-win8</p><p>1 gig minimum memory<br/></p><p>2 gigs of ram or more is best</p>", "metacritic": null, "released": "2015-06-12", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/b00/b002ed8ac43bfd126fb9363a261a4a5f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 295, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Frank Griffin"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}