{"id": 121, "slug": "street-fighter-4", "name": "Street Fighter IV", "name_original": "Street Fighter IV", "description": "<p>STREET FIGHTER IV is a fighting game, the fourth main installment in Capcom’s Street Fighter series.  </p>\n<h3>Plot</h3>\n<p>Storywise the game is a sequel to Street Fighter II and prequel to Street Fighter III. The S.I.N corporation begins a new tournament for the best fighters from all over the world. Although each participant has its reason to take part in the tournament, the S.I.N’s motivation behind it is to collect necessary data from fighters to complete a bio-weapon project BLECE.  </p>\n<h3>Gameplay</h3>\n<p>Like most other games in series, Street Fighter IV is a 2D fighting with one-on-one fights between various characters with unique fighting styles and supernatural abilities. The core gameplay is very reminiscent to that of the Street Fighter II, but the game adds many new mechanics, gameplay elements as well as new characters, stages, game modes. The two main gameplay innovations in SFIV are Focus Attacks and Ultra Combos. Focus Attacks are chargeable attacks that can knock down an opponent. It can also absorb one opponent’s strike which gives a new layer to the game combat and makes gameplay less combo-based and more focused on reading the opponent’s moves and fast reactions. Super Combo gauge returns for previous games and allows the player to perform more powerful versions of character’s special attacks. The new Ultra Combo system fills a special Ultra Combo gauge with each hit laid on your character and allows you to unleash a string of powerful attacks on the enemy.</p>", "metacritic": 91, "released": "2009-02-12", "tba": false, "updated": "2023-11-26T08:38:47", "background_image": "https://media.rawg.io/media/games/0a2/0a2ee705109a6d8d94e28bef03f6d598.jpg", "website": "http://www.streetfighter.com", "rating": 3.78, "rating_top": 4, "added_by_status": {"yet": 28, "owned": 784, "beaten": 153, "toplay": 16, "dropped": 141, "playing": 6}, "playtime": 3, "achievements_count": 96, "ratings_count": 209, "suggestions_count": 866, "game_series_count": 14, "reviews_count": 210, "platforms": ["PC", "iOS", "Xbox One", "PlayStation 3", "Xbox 360"], "developers": ["Capcom", "Capcom U.S.A", "DIMPS"], "genres": ["Action", "Arcade", "Fighting"], "publishers": ["Capcom"], "esrb_rating": "Mature"}