{"id": 12108, "slug": "distraint", "name": "DISTRAINT", "name_original": "DISTRAINT", "description": "<p>DISTRAINT is a two-dimensional adventure horror indie game developed by Jessee Makkonen.</p>\n<h3>Setting</h3>\n<p>You play as a man named Price. Price is a repo man who is tasked with repossessing a house of an old woman in order to save his partnership with a big corporation. Rather than scaring the player using jumpscares, the game uses it&#39;s own atmosphere and explores the everyday horrors people encounter. The game explores the themes of greed, regret, and quilt. </p>\n<h3>Gameplay</h3>\n<p>Being developed in only 77 days, the game is described as a speed project by its creator. It will take you 2 hours to complete the game&#39;s story. DISTRAINT is a pixel art-inspired narrative-driven experience. The players can only move left and right and use their flashlight. Button prompts for different actions appear on-screen. All the graphics in the game is hand drawn and also animated by hand. No asset in the game is used twice, as stated by the game&#39;s developer. “No cheap tricks!” as he puts it.</p>\n<p>No HUD is present in the game. This was made to distract the player from the game as less as possible. </p>\n<h3>Deluxe edition</h3>\n<p>The Deluxe edition of the game features dynamic coloring, which adds to the game&#39;s depressive gray palette. Enhanced environmental lighting and graphical effects were also added to the game with the addition of a refined user interface.</p>", "metacritic": 76, "released": "2015-10-21", "tba": false, "updated": "2024-04-09T01:20:52", "background_image": "https://media.rawg.io/media/screenshots/b4c/b4c8dd2f639bf2e8b84b2f1c365406e0.jpg", "website": "http://www.jessemakkonen.com", "rating": 3.06, "rating_top": 4, "added_by_status": {"yet": 164, "owned": 2451, "beaten": 115, "toplay": 14, "dropped": 36, "playing": 3}, "playtime": 3, "achievements_count": 16, "ratings_count": 238, "suggestions_count": 187, "game_series_count": 1, "reviews_count": 239, "platforms": ["PC"], "developers": ["Jesse Makkonen"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Jesse Makkonen"], "esrb_rating": null}