{"id": 121196, "slug": "globe-clicker-2-early-access", "name": "Globe Clicker 2 - Early Access", "name_original": "Globe Clicker 2 - Early Access", "description": "Globe Clicker 2 : in-development Early Access<p>This is a very early version of the sequel to the Xbox360 geographic quizz Globe Clicker. The features currently implemented are as follow :</p><ul><li>Flat world map from NASA satellite photos.</li><li>The player is prompted a location, and can point anywhere on the map.</li><li>The distance between the prompt and the answer is measured in miles or kilometers.</li><li>The player can choose the location list to be Per-Continent, or Capitals only, or Unesco World Heritage sites only.</li></ul>Planned features coming soon :<ul><li>The map will be presented on a 3D globe that the player can rotate and zoom.</li><li>Night satellite photos, with big cities highly visible among the countryside with their lights.</li><li>Country borders, with a setting to show or hide them.</li><li>The player answer will be rated on distance and time, with points awarded, and a points threshold to reach for the next level.</li><li>High-score list.</li><li>Better visual feedback when the player chooses an answer.</li><li>Sound effects.</li><li>Full gamepad support and key rebinding.</li></ul>Development philosophy<p>I will regularly push new versions of the game. You can expect 2 to 3 new builds per-week, with a rapid development schedule. I expect the development to be finished by mid February.</p><p>With this Early Access release, I am looking for player feedback, and showcasing the development in an open manner.</p>ChangeLogBeta 2 - 2017-27-01<p>Better performance on graphic cards with less than 2GB of ram with compressed textures.</p><p>Textures are now baked from a lossless PNG source rather than a lossy JPG one.</p><p>Removed obsolete and irrelevant settings.<br/></p>Beta 3 - 2017-28-01<p>Allow higher zoom level.</p><p>Higher resolution for satellite textures : now 2400 pixels per 30 latitude/longitude degrees.</p><p>Flags textured are baked as DDS RGBA for faster loading.</p><p>Removed obsolete and irrelevant shipped files.<br/></p>Beta 3.1 - 2017-30-01<p>Fixed a bug where the first launch with an Intel GPU would crash.</p><p>Fixed a bug where the random prompted location in mode World Cities was always Los Angeles.<br/></p>Beta 4 - 2017-30-01<p>Setup.exe creates a shortcut to Configurator.exe used to launch the debug-enabled version or the fail-safe settings.</p><p>Removed the level-of-details feature of the satellite textures because they already are mip-mapped.<br/></p><p>Country borders now rendered as textures baked with custom 8-bit/pixel format.</p>Beta 5 - 2017-31-01<p>Alternate satellite textures : night mode.<br/></p><p>Special inter-state borders for map type \"USA\".</p><p>Flag textures are now loaded on-demand rather than at start-time, which makes for a faster load time, and fewer VRAM load.</p><p>Default position for the location prompt is now bottom-left corner.<br/></p>Beta 6 - 2017-02-08<p>Full support for the 3-dimensional Globe mode.</p><p>Projection mode can be changed on the fly during gameplay, from Flat Map to/from Globe.<br/></p><p>New technique for rendering the path from the user choice to the correct answer.<br/></p>Beta 6.4 - 2017-02-21<p>The path from the user choice to the prompted location is now the shortest path (interpolating on the globe projection rather than interpolating latitude-longitude coordinates).</p><p>Fixed a crash on initial load that happened with CPU i7-4700MQ and GPU Intel(R) HD Graphics 4600 - 4.0.0 - Build 9.18.10.3204<br/></p>", "metacritic": null, "released": "2017-01-24", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/e96/e968ef6b5dbc38c8a5a8b3d4d34e8d13.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 307, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Maximinus"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}