{"id": 121191, "slug": "apocalypse-z", "name": "Apocalypse Z", "name_original": "Apocalypse Z", "description": "Backstory\r\n<p>It's months into a zombie outbreak, there are a million reasons circling as to why or how zombies came to be, but you know it’s a virus that was accidentally developed in a lab which destroys specific parts of the brain making people extremely aggressive as well as ‘eating’ the flesh off of their very bones. Touching a zombie can mean you also get infected but usually results in you being bitten, killed, and eaten. Nasty.<br/> <br/>You don’t really know how you’ve survived the zombie outbreak so far - other people far more suited to it than yourself haven't made it this far. You tell yourself it’s probably luck. You've realised if you move from house to house then a single street can have enough supplies to last for over a month; too bad a large horde of zombies drove you out of your ‘comfy’ suburbia and into an industrial estate. Currently, you’re holding up in one of the large buildings there.<br/><br/>All the doors and windows are barricaded shut, but with enough time any zombie could break in if they want to. That means the only things between you being alive, and you being zombie lunch, are your guns… I suggest you use them…</p>\r\n'The Gist'\r\n<ul><li>You're trapped inside an empty building</li><li>Zombies are coming in from all directions</li><li>They can break into the building but you cannot escape out</li><li>Kills zombies to live as well as to increase your score</li><li>This can be spent directly on:<ul><li>Barricading zombie entry points</li><li>Unlocking doors to gain access to other rooms</li><li>Buying new guns</li><li>Restoring your health</li></ul></li><li>Leaderboard positions are ranked by length of time survived (and number of kills to tiebreak)</li></ul>\r\nCore Features\r\n<ul><li>Arcade style: survive as long as possible</li><li>Adjust options like volume, graphics, and controls</li><li>Save the best scores in the leaderboard</li><li>Random weapons means luck factors as well as skill</li><li>Zombies get trickier as time progresses</li><li>Time-based scoring</li></ul>\r\nControls\r\n<p>The controls of the game can be changed in the options page via the main menu, by default they are:</p>\n<ul><li>Look: Mouse Axis</li><li>Fire: Mouse 0</li><li>Move North: W</li><li>Move West: A</li><li>Move South: S</li><li>Move East: D</li><li>Sprint: Shift</li><li>Melee: Q</li><li>Interact: E</li><li>Reload: R</li></ul>\n<ul><li>Cycle Fire-mode: F</li><li>Single-shot: X</li><li>Burst-fire: C</li><li>Full-auto: V</li><li>Pause: Esc.</li><li>Weapon Pickup: G</li><li>Weapon Slot 1: 1</li><li>Weapon Slot 2: 2</li><li>Weapon Slot 3: 3</li></ul>\n<p>Note that 'Sprint' and 'Interact' need to be held down.</p>", "metacritic": null, "released": "2017-05-25", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/08b/08bb2eb226a066239157dcddbbe53dfd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 109, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Toby Smith"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}