{"id": 12128, "slug": "axe-bow-staff", "name": "Axe, Bow & Staff", "name_original": "Axe, Bow & Staff", "description": "<ul><li><br/><br/><br/>Literally born under a rock, <strong>Axe</strong> is the tallest dwarf in his mining clan, a giant of a dwarf at five feet, towering a head above the others. He's so tall he could be mistaken for a very short human! Because Axe's height made him unsuitable for mining, he set off to seek his fortune in the lands above. Away from familiar tunnels and dank caves, Axe often gets lost on the surface world, but doesn't like to admit it. When he is not busy searching for his fortune, he likes skipping rocks on a stream and eating hot dogs on a stick. He thinks that they are made of real dogs and has never learned how to tie his shoelaces.<br/><br/><strong>Bow</strong> is, regretably, the shortest member of her elfin village. She left her home in shame because she was only ever tall enough to gather berries with the elfin children. Bow did not want to be a babysitter in the bushes for the rest of her life, so she ran away from home when she was sixty (which is like sixteen in human years) to train as an ninja so that she could one day return home a glorious hero and bring glory to short elves everywhere. To this day, she still has not found a Ninja Sensei to teach her the proper art of Nenjootsoo, the elven translation of ninjutsu. This also means that she and Axe are about the same height...<br/><br/><strong>Staff</strong> has been called many things, amongst them hypochondriac and sniffles are probably the nicer terms that people have used. As a hypo-sensitive wizard with extensive allergies, he prefers to hide behind much bulkier heroes and fold origami on his days off. Staff is mildly allergic to magic, nature, rodents, goblins, rats, leaves, twigs, stones, dead goblins, rocks, dirt, air, water, lightning, thunder, undead goblins, and likes cats. He is also allergic to cats.</li></ul>", "metacritic": null, "released": "2016-09-29", "tba": false, "updated": "2019-08-28T22:13:28", "background_image": "https://media.rawg.io/media/screenshots/1ae/1ae6a5129c714d538724b420b0fef30d.jpg", "website": "http://axebowstaff.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 6}, "playtime": 3, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 203, "game_series_count": 0, "reviews_count": 1, "platforms": ["macOS", "PC", "Linux"], "developers": ["Clewcat Games"], "genres": ["Action", "RPG", "Indie"], "publishers": ["Clewcat Games"], "esrb_rating": null}