{"id": 12122, "slug": "super-stone-legacy", "name": "Super Stone Legacy", "name_original": "Super Stone Legacy", "description": "<strong>Super Stone Legacy</strong> is <strong>fast, flashy and exciting to play</strong>. Dash at enemies, slay bosses, dodge fireballs, power up and unleash huge \"SUPER\" attacks! Fight through an <strong>ever changing</strong> dungeon as the forces of darkness grow more powerful with each passing room, or invite some friends over for <strong>couch co-op</strong> and take on the challenge together! Fast paced, exciting, and <strong>plenty of replayability</strong>, <strong>Super Stone Legacy is awesome value</strong> for fans of Action, Adventures, or RPGs!Key Features<ul><li> <strong>Six Classic RPG Classes</strong> - Knight, Wizard, Archer, Fighter, Cleric and Duelist. Each with their own unique abilities, strengths and weaknesses.<br/></li><li> <strong>Be The Whole Party</strong> -  Swap mid-combat between heroes and combine their strengths! But, if a hero should die... they stay dead forever. Forever.<br/></li><li> <strong>Difficult Arcade Gameplay</strong> - Swarms of angry minions. Big fat bosses at the end of each stage. Difficult skill based gameplay. Groovy arcade tunes. Game over screens. The whole lot!<br/></li><li><strong> Local Co-op Multiplayer</strong> - Up to 3 players can join the havoc in white-knuckled cooperative play. Unite or fall!<br/></li><li> <strong>Procedurally Generated Zones</strong> - Experience a new fight each time you play with different enemies, bosses and locations to explore!<br/></li><li> <strong>\"Twin-Stick\" Controls</strong> - Play with a keyboard &amp; mouse or Xbox 360 controllers.<br/></li><li> <strong>Death</strong> - You and your companions are going to die. But with each death you'll be a little wiser. A little tougher. A little closer to victory!</li></ul>", "metacritic": null, "released": "2017-01-19", "tba": false, "updated": "2019-08-28T22:13:29", "background_image": "https://media.rawg.io/media/screenshots/ffd/ffd7b9fe0a49dcc74a114e7cd5bc35b0.jpg", "website": "http://www.superstonelegacy.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 17}, "playtime": 2, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 234, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Garden Shed Studios"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["Garden Shed Studios"], "esrb_rating": null}