{"id": 121246, "slug": "steampunk-dress-up", "name": "Steampunk Dress up", "name_original": "Steampunk Dress up", "description": "<p>Steampunk dressing can be broken down into a few basic archetypes. One \r\ngood place to begin is to decide what sort of character you are \r\nportraying, in other words: who are you? Are you an aristocrat, \r\nmechanic, aviator, pirate, explorer, or zombie hunter? Many of these \r\narchetypes do overlap, but it gives you a basis for your outfit. Think \r\nof what it would make the most sense to wear. If you are a mechanic, \r\nmaybe a skirt would be silly. Would your character really wear goggles? \r\nLet’s face it, they have become cliche in steampunk. But a cliche comes \r\nabout because it is recognizable and iconic. So, if they make sense, why\r\n not wear goggles.\r\n</p><p>★★★Features★★★</p><p>★ Enjoy two interesting mode:<br/>-\r\n Try the classic mode and freely dress-up for Victoria according to your\r\n taste. Tap on  the icon Leaf on the screen and keep in 2 seconds to \r\nchange background from gallery. You can pinch, zoom, rotate and move \r\nmodel and background to have the best photos.<br/>- Play the Time mode \r\nwhere you will have to dress up the girl in the same way as you see it \r\nin the picture to get the highest score<br/>★ Attractive make-up styles for eyes and lips like 19th-century girls.<br/>★ Different unique accessories<br/>★ Lots of colorful hairstyles <br/>★ Sexy or cute steampunk clothes: outfits, dresses and shoes <br/>★ Take nice photos and share with people over Facebook, Twitter.. or save in gallery</p>", "metacritic": null, "released": "2014-05-29", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/983/9830431f396f0882d7176c798138a4de.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 88, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["geckolor"], "genres": [], "publishers": [], "esrb_rating": null}