{"id": 12138, "slug": "slice-dice-rice", "name": "Slice, Dice & Rice", "name_original": "Slice, Dice & Rice", "description": "<strong>Slice Dice &amp; Rice</strong> is an indie fighting game with no health bars. Inspired by Bushido Blade, it revolves around the idea of finding an opening in opponents defense and ending the round with a single, clean hit. Gone are the tedious hit points – each scratch impairs your movement, every wound might be your last.<br/><br/><br/><br/><strong>Gameplay</strong><br/>Our goal was to make fighting games accessible to anyone. An intuitive set of basic abilities allowed us to remove the need for memorizing inputs and move-lists, while retaining the complexity. Moves can be canceled to feint an attack, hits can be parried or dodged, and they can clash with one another. This creates a mind-game heavy gameplay, one that mimics real samurai showdowns <br/><br/><br/><br/><strong>Characters and Stages</strong><br/>You can play as one of 8 characters, all with their own stories and unique fighting styles. Game’s cast offers many variations of gameplay, from a swift monk using only his fists in battle, to a muscular lady with a giant sword that compensates speed and mobility with endurance during her attacks.<br/><br/><br/><br/>Fights take place in alternative version of Japanese underworld and features 6 unique stages with hand-drawn textures.<br/><br/><br/><br/><br/><br/><br/><br/>", "metacritic": null, "released": "2017-04-27", "tba": false, "updated": "2024-01-20T16:23:35", "background_image": "https://media.rawg.io/media/screenshots/739/7393f23d69fd5551957e1dac986fd001.jpg", "website": "http://dojogames.pl/", "rating": 3.36, "rating_top": 4, "added_by_status": {"yet": 7, "owned": 158, "beaten": 4, "toplay": 4, "dropped": 5}, "playtime": 1, "achievements_count": 0, "ratings_count": 9, "suggestions_count": 493, "game_series_count": 0, "reviews_count": 11, "platforms": ["PlayStation 4", "Nintendo Switch", "PC"], "developers": ["Arc System Works", "Dojo Games"], "genres": ["Action", "Fighting"], "publishers": ["Arc System Works Co."], "esrb_rating": "Mature"}