{"id": 12130, "slug": "rimworld", "name": "RimWorld", "name_original": "RimWorld", "description": "<p>RimWorld is a sci-fi colony sim driven by an intelligent AI storyteller. Inspired by Dwarf Fortress, Firefly, and Dune.<br />\nYou begin with three survivors of a shipwreck on a distant world.<br />\nManage colonists&#39; moods, needs, wounds, and illnesses.<br />\nFashion structures, weapons, and apparel from metal, wood, stone, cloth, or futuristic materials.<br />\nTame and train cute pets, productive farm animals, and deadly attack beasts.<br />\nWatch colonists develop and break relationships with family members, lovers, and spouses.<br />\nFight pirate raiders, hostile tribes, rampaging animals, giant tunnelling insects and ancient killing machines.<br />\nTrade with passing ships and trade caravans.<br />\nDecorate your colony to make it into a pleasurable space.<br />\nDig through snow, weather storms, and fight fires.<br />\nCapture refugees or prisoners and turn them to your side or sell them into slavery.<br />\nDiscover a new generated world each time you play.<br />\nBuild colonies in the desert, jungle, tundra, and more.<br />\nLearn to play easily with the help of an intelligent and unobtrusive AI tutor.<br />\nRimWorld is a story generator. It’s designed to co-author tragic, twisted, and triumphant stories about imprisoned pirates, desperate colonists, starvation and survival. It works by controlling the “random” events that the world throws at you. Every thunderstorm, pirate raid, and traveling salesman is a card dealt into your story by the AI Storyteller. There are several storytellers to choose from. Randy Random does crazy stuff, Cassandra Classic goes for rising tension, and Phoebe Chillax likes to relax.<br />\nYour colonists are not professional settlers – they’re crash-landed survivors from a passenger liner destroyed in orbit. You can end up with a nobleman, an accountant, and a housewife. You’ll acquire more colonists by capturing them in combat and turning them to your side, buying them from slave traders, or taking in refugees. So your colony will always be a motley crew.<br />\nEach person’s background is tracked and affects how they play. A nobleman will be great at social skills (recruiting prisoners, negotiating trade prices), but refuse to do physical work. A farm oaf knows how to grow food by long experience, but cannot do research. A nerdy scientist is great at research, but cannot do social tasks at all. A genetically engineered assassin can do nothing but kill – but he does that very well.<br />\nColonists develop - and destroy - relationships. Each has an opinion of the others, which determines whether they&#39;ll become lovers, marry, cheat, or fight. Perhaps your two best colonists are happily married - until one of them falls for the dashing surgeon who saved her from a gunshot wound.<br />\nThe game generates a whole planet from pole to equator. You choose whether to land your crash pods in a cold northern tundra, a parched desert plain, a temperate forest, or a steaming equatorial jungle. Different areas have different animals, plants, diseases, temperatures, rainfall, mineral resources, and terrain. These challenges of surviving in a disease-infested, choking jungle are very different from those in a parched desert wasteland or a frozen tundra with a two-month growing season.<br />\nYou can tame and train animals. Lovable pets will cheer up sad colonists. Farm animals can be worked, milked, and sheared. Attack beasts can be released upon your enemies. There are many animals - cats, labrador retrievers, grizzly bears, camels, cougars, chinchillas, chickens, and exotic alien-like lifeforms.<br />\nPeople in RimWorld constantly observe their situation and surroundings in order to decide how to feel at any given moment. They respond to hunger and fatigue, witnessing death, disrespectfully unburied corpses, being wounded, being left in darkness, getting packed into cramped environments, sleeping outside or in the same room as others, and many other situations. If they&#39;re too stressed, they might lash out or break down.<br />\nWounds, infections, prosthetics, and chronic conditions are tracked on each body part and affect characters&#39; capacities. Eye injuries make it hard to shoot or do surgery. Wounded legs slow people down. Hands, brain, mouth, heart, liver, kidneys, stomach, feet, fingers, toes, and more can all be wounded, diseased, or missing, and all have logical in-game effects. And other species have their own body layouts - take off a deer&#39;s leg, and it can still hobble on the other three. Take off a rhino&#39;s horn, and it&#39;s much less dangerous.<br />\nYou can repair body parts with prosthetics ranging from primitive to transcendent. A peg leg will get Joe Colonist walking after an unfortunate incident with a rhinoceros, but he&#39;ll still be quite slow. Buy an expensive bionic leg from a trader the next year, and Joe becomes a superhuman runner. You can even extract, sell, buy, and transplant internal organs.<br />\nAnd there&#39;s much more than that! The game is easy to mod and has an active mod community. Read more at http://rimworldgame.com.<br />\n(All non-English translations are made by fans.)</p>", "metacritic": 87, "released": "2016-07-15", "tba": false, "updated": "2024-04-20T06:19:10", "background_image": "https://media.rawg.io/media/screenshots/4d8/4d85fbe90066fdbef295a618640c4a82.jpg", "website": "https://ludeon.com", "rating": 4.36, "rating_top": 5, "added_by_status": {"yet": 104, "owned": 1935, "beaten": 182, "toplay": 131, "dropped": 240, "playing": 123}, "playtime": 19, "achievements_count": 0, "ratings_count": 562, "suggestions_count": 353, "game_series_count": 0, "reviews_count": 565, "platforms": ["macOS", "PC", "Linux"], "developers": ["Ludeon Studios"], "genres": ["Strategy", "Simulation", "Indie"], "publishers": ["Ludeon Studios"], "esrb_rating": null}