{"id": 121343, "slug": "the-matter-of-the-great-red-dragon", "name": "The Matter of the Great Red Dragon", "name_original": "The Matter of the Great Red Dragon", "description": "<p>As is written in the Book of the Carvings of Narm, every one hundred years the Great Red Dragon rises from his lair in the Clawed Mountain, and descends with terrible fire on all the people of the Land of Plenty; and there is no hope of peace unless the beast is defeated by seven brave champions, to be banished once more into the unholy darkness of the Abyss, where the Darkest of All Evils dwells in eternal, writhing hatred.</p><p>Nearly a century has passed since seven heroes last gathered at the Gate of the Burned Trees, and soon the dragon will rise again.</p><p>A tale from the Lands of Dream.<br/></p>Reviews<p>Delightful.<br/> – Steven Brust</p><p>The Matter of the Great Red Dragon is clever and thoughtful, and more than worth the time it will take you to journey through it…. whatever the outcome.<br/> – Jay is Games</p><p>Sumptuous<br/> – PC Gamer</p><p>My favorite has to be The Matter of the Great Red Dragon, a quiet, philosophical story about the choices you make and the lives you do and don't lead.<br/> – (The) Absolute</p><p>A thoughtful examination of traditional values and contemporary malaise.<br/> – Game Bias</p><p>Medieval in execution, with a cool little character development bar on the side, it had the lushness of a historical backdrop without burdening the player with exposition sandbags.<br/> – Path of Least Efficiency</p><p>Both examines and revels in the save-the-world fantasy tale.<br/> – The Ludi Bin</p>", "metacritic": null, "released": "2016-03-22", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/0a5/0a57b4854dff0d342cfeefb725d6fd7a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 29, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Jonas Kyratzes"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}