{"id": 121404, "slug": "eris", "name": "Eris", "name_original": "Eris", "description": "<p>I've always wanted to explore the idea of AI-heavy games, and this is six weeks into the project.</p><p><strong>Concept</strong><br/></p><p>The theory behind Eris is that the player customizes AI, which controls their allies.</p><p>This feature is the main focus of development right now, and soon the options to intricately control each AI's learning method is going to be implemented - some sort of interface that controls an underlying genetic algorithm, instead of manually changing each AI's preferred tactics. I'm hoping to make this as user friendly as possible, so any feedback is greatly appreciated.</p><p><strong>Content</strong></p><p>10Unique ships</p><p>13 Turret types</p><p>6    Biomes</p><p>14 Planets</p><p>3 Stars<br/></p><p>As far as adding content goes, players easily have access the the .csv files in the Data folder. Want to create a ship with  a Quad-Laser instead of a wimpy gatling gun? Just open excel and then change a few fields! You can even generate brand new ship art, and create new ships to add to your fleet:</p>All of the ship art is generated by this application: https://github.com/proceduro/spaceship-2d which is open-source, but Rye Terrell still deserves some credit. Be sure to check out his other stuff!<p>I'll be trying to implement a similar generation technique in the game itself, just to see where it takes things, but that's for the future..</p><p>Also, if that's too hard, just make a request for something to be added, whether a mechanic or a new type of turret.<br/></p><p><strong>Controls:</strong></p><p>WASD to control rotation and acceleration</p><p>Space to shoot<br/></p><p>Q and E to strafe left and right, respectively</p><p>X to open planet and station menus</p><p>C to switch ammo types</p><p>V to switch turret types</p><p>Shift to warp</p><p><strong>Feel free to post any suggestions </strong>- That's why I'm uploading the game!<br/></p>", "metacritic": null, "released": "2015-12-15", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/0b8/0b8391ad163de91baf72bbd6daae97ea.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 93, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MarethyuSky"], "genres": ["Shooter", "Simulation"], "publishers": [], "esrb_rating": null}