{"id": 121419, "slug": "adrenaline-rush-retro-racing-game", "name": "Adrenaline Rush - Retro Racing Game", "name_original": "Adrenaline Rush - Retro Racing Game", "description": "<p>\r\n\tFor fans who love the old arcade racing games and wants to relive that feeling of what the old 90’s car games had given them, well than Adrenaline Rush is surely one arcade game that you would love.</p><p>\r\n\tWith effects that simulates the CRT screen of old TV’s a simple gameplay, Adrenaline Rush is surely one of the 2D scrolling game that you would love playing.</p><p>\r\n\tFREE to play online we believe that simplicity is the secret for success. Despite of the simple graphics, we’ve added plenty of features that encourage the players to play and also give them a fun and entertaining experience for how long they chose to play.</p><p>\r\n\tHere are just some of the features we believe you’ll enjoy:</p><li>8 Achievements to complete;</li><li>Awesome old cars including a police car which you can unlock;</li><li>High score saving utility so you can show your friends how much you’ve manage to score and also challenge them to score better;</li><li>Easy gameplay, you’ll just have to tap left or right for the car to move;</li><li>Fun effects like explosions;</li><li>Music and sound effects which mimics the ones that we’re used in retro fun games;</li><li>is FREE to play!</li><p>Adrenaline Rush is surely a game that will put your blood in a rush. Join the race now and let us know how much you can score!</p>", "metacritic": null, "released": "2014-07-19", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/7e0/7e06534ddec81fb1b10ceb46fe8a354c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 62, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["theandroidgalaxy"], "genres": ["Racing"], "publishers": [], "esrb_rating": null}