{"id": 121499, "slug": "catpocalypse-miau", "name": "Catpocalypse Miau", "name_original": "Catpocalypse Miau", "description": "<p>Hey everyone! This is the proyect that made us discover itch.io in a gamejam some time ago (MalagaJam 4, if memory serves). The theme of the jam was <strong>X loves Y</strong> and we had 4 colors and 48 hours to do the job.</p>\n<p>Naturally, the theme had to be <strong>Zombies love Cats</strong>, I mean, everyone knows that! So we made an endless survival 2D shooter where the Hero, <strong>Angus Lovelauncher</strong>, roams through an apocalyptic wasteland shooting cats at zombies and curing their illness with the power of love (no cats where harmed in the making of this game, it's a very confy and secure cat-launcher)!<br/></p>\n<p>And that's pretty much it, shoot the right colored cat at the right type of zombie and you're golden! But after some time, the team wanted to do a bit more with such a wacky setting, so we're developing a full game out of this prototype that we're hoping will be a <strong>run &amp; gun contra-like through the eyes of a 10 year old kid that loves cats</strong>, saturday morning cartoons and cheesy movies. <br/><br/>We're currently spinning up development on it, and if you're interested, we hear there's some cat related content happening around<strong> these parts</strong> and <strong>these other parts</strong>. Oh, and also<strong> </strong><strong>over here</strong>! But in the meantime, tell us what you think of our prototype! The whole thing's gonna change, but we're keeping the artstyle and doubling down on the fact that all the game will happen on the notebook (and in the mind) of our Hero. A bit like a Calvin and Hobbes situation. Hopefully it will make a lot more sense once we finish a demo we're working on!<br/></p>\n<p>Anyway, we hope you like it and tell us what you think of the art!</p>", "metacritic": null, "released": "2016-07-10", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/e11/e11f5b4989816d3084ee0904f4b3d60b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 50, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["FraxelGames"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}