{"id": 121460, "slug": "humantale-a-historia-entre-hunters-the-history-of-", "name": "Humantale-A História entre Hunters (The History of Hunters)", "name_original": "Humantale-A História entre Hunters (The History of Hunters)", "description": "<p>Have you seen a Visual Novel x RPG hybrid? Me neither.</p>\n<p>Você já viu um híbrido de Visual Novel com RPG? Nem eu.</p>\n<p><strong>PT-BR:</strong><br/>Uma visual novel simples feita na engine CloudNovel que eu fiz pra AU da minha irmã. Eu sei lá...mas eu acho a AU dela tão criativa que eu fiz um presentinho pra ela. Mesmo sendo uma novel, contém batalhas. Bem simples mas eficaz.</p>\n<p>Humantale (antigamente nomeado de \"Huntale\") é uma AU de Undertale criada por NinjaNight no SpiritFanfics (minha irmã). E ela conta a história de duas irmãs, Frisk e Chara. Frisk contém poderes de fênix e Chara, poderes de lobo. Durante a jornada das duas...muita coisa pode acontecer.</p>\n<p><strong>Ps</strong>: Por favor esteja ciente que o jogo pode ter alguns bugs. Alguns eu posso até conseguir corrigir mas outros eu não vou conseguir de jeito nenhum. Depende do bug.</p>\n<p><strong>Ps²</strong>: Isto é apenas um universo alternativo e não tem nada á ver com a obra original. Sem brigas por causa de coisas infiéis á obra original.</p>\n<p><strong>ENG</strong><br/>A simple visual novel made on the CloudNovel engine that i made for my sister. I don't know...but i think her AU is so creative that i made a gift for her. Even that it's a novel, it has battle. Simple but works fine.</p>\n<p>Humantale (previously named \"Huntale\") is an Undertale AU created by NinjaNight on SpiritFanfics (my sister). And it tells the history of two sisters, Frisk and Chara. Frisk haves phoenyx powers and Chara, wolf powers. On the journey...alot of stuff can happen.</p>\n<p><strong>Ps:</strong>: Please be careful because the game will might have some bugs. Some i can even fix but others i'll not fix because there's no way. depends of the bug.</p>\n<p><strong>Ps:</strong>:This is just an alternative universe and has almost nothing to do with the original work. So no fights because of no canon stuff.</p>\n<p><strong>Credits/Créditos</strong>:</p>\n<p>Humantale, artes de menu e conceito de personagens por NinjaNight no Spirit Fanfics (minha irmã =D)<br/>Arte de personagens por: Eu.<br/>Undertale por: Toby Fox<br/>Backgrounds por:<br/>jikookachu<br/>Konett<br/>Idk<br/>Angelgames731<br/>Chocolate Berry<br/>Bassnovel</p>\n<p>Humantale, menu art and character concepts by: NinjaNight on Spirit Fanfics (my sister =D)<br/>Character artwork by: Me.<br/>Undertale by: Toby Fox<br/>Backgrounds by:<br/>jikookachu<br/>Konett<br/>Idk<br/>Angelgames731<br/>Chocolate Berry<br/>Bassnovel</p>", "metacritic": null, "released": "2018-02-05", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/b3e/b3ecd8b070ea35ff5cd0c2bd60465218.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 57, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Luci"], "genres": ["Fighting"], "publishers": [], "esrb_rating": null}