{"id": 12145, "slug": "huenison", "name": "Huenison", "name_original": "Huenison", "description": "<strong>ANOTHER VISITOR... PLAY A WHILE, GO MAD FOREVER!</strong><br/><br/><br/><br/>And so you think you will succeed where everybody else has failed. I, <strong>Huenison</strong>, the Evil Master in charge of the conquest of your world, will see to it that you fail miserably.<br/>Yes, conquest.<br/>Why? Because.<br/>Unfair? Who cares. But enough, I am not wasting further time here. Go away. Or, if you're really serious about it, come down into my deep Mind Control Wells and... die.<br/><br/><strong>WHAT IS THIS?</strong><br/><br/><strong>Huenison</strong> is an innovative arcade shooter that takes various elements from <strong>Arkanoid</strong>, <strong>BOH</strong>, <strong>Decathlon</strong>, <strong>Dyna Blaster</strong>, <strong>Impossible Mission</strong>, <strong>Oil's Well</strong>, <strong>Pac-Man</strong>, <strong>Pang</strong>, <strong>Qix</strong>, <strong>Slam Tilt</strong>, <strong>Space Invaders</strong>, <strong>Tetris</strong>, and <strong>Vital Light</strong>, and puts them together in a hectic mix. All in retro visuals and synthetic sonorities that recall the revered <strong>Commodore 64</strong>'s <strong>SID</strong> chip.<br/><br/><br/><br/>You shoot at falling bricks with a cannon at the bottom of a well (and no, you haven't ever seen anything like this before). Your beams hit bricks only when they are of the same color. Hitting a brick produces a specific effect depending on the type of the brick. Missing bricks will let them accumulate at the bottom of the well, raising the ground where the cannon rests - and, on top of that, bringing the deadly zapper down, closer to the cannon.<br/><br/><br/><br/>But this is just the beginning: each level plays differently, more and more brick types are introduced along the way, occasional disturbances will suddenly bring some more chaos, and lots of bonuses will help catch a breath (and score more points)!<br/>It's a unique experience that can't be described with words. Just dive into <strong>Huenison</strong>'s Mind Control Wells, defeat him, and save the world!<br/><br/><br/><br/><strong>FEATURES</strong><br/><br/>immediate and addictive gameplay · 25 levels · 9 game modes · huge variety of bricks and bonuses · <strong>C64</strong>-style music, speech, and sounds · many cool graphic modes · exciting prog-SID soundtrack · online hiscores<br/><br/><strong>DISCOVER MORE</strong><br/><br/><br/><br/>Follow Huenison on Facebook<br/>Check the online hiscores<br/><br/><strong>THE SAGA</strong><br/><br/><strong>Huenison</strong> is part of a saga that, as of writing, includes five different games.<br/><strong>BOH</strong> opens the story, with the <strong>Evil Masters</strong> bringing chaos to <strong>Earth</strong>. <strong>Huenison</strong> focuses on the fight against one of them, the eponymous character. Eventually the Evil Masters were repelled, but, as seen in <strong>QUOD INIT EXIT IIm</strong>, during their retreat, Huenison and his companions happened to pass by planet <strong>Suinio</strong> and decided to cause trouble there as well. In <strong>MAH</strong>, years later, the danger came from the <strong>Apocalypser</strong>, the weapon that had been developed against the Evil Masters and that the <strong>Purifiers</strong> activated to destroy the Earth. Finally, <strong>KOG</strong> assigns a new task to the hero who turned the Apocalypser off.", "metacritic": null, "released": "2016-02-26", "tba": false, "updated": "2019-08-28T22:13:28", "background_image": "https://media.rawg.io/media/screenshots/a37/a37b4b53dbd81d72809f998a2039db45.jpg", "website": "https://www.retream.com/Huenison", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 7}, "playtime": 4, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 123, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["RETREAM"], "genres": ["Action", "Casual", "Indie"], "publishers": ["RGCD.DEV"], "esrb_rating": null}