{"id": 121465, "slug": "atlas-warriors", "name": "Atlas Warriors", "name_original": "Atlas Warriors", "description": "<p>A short, minimalist, kind of unique roguelike. </p><p><strong>Short</strong><br/></p><p>Atlas Warriors is beatable in 20-30 minutes - if not less. It's only 10 levels long - and they're not big. The game actively punishes grindy tactics.</p><p><strong>Minimalist</strong><br/></p><p>Inspired by Brogue, every type of monster and weapon must be in some way unique to justify its existence. This leads to gameplay beyond 'Hold the arrow down'.</p><p><strong>Kind of Unique</strong><br/></p><p>Yep - it's another fantasy roguelike. It's only kind of unique.</p><p>It does have unique features. Firstly, it has some cool ASCII animations and fire effects if you find yourself fighting the horrid Dragon. Secondly, it has cramped small levels. Finally, it has a fun Kill Or Be Killed mechanic where instead of instantly dying, you get a few turns to make a kill and be returned to life. Beware though - your character never has too much health, and the only ways they can regain it are through Kill Or Be Killed, exploring new parts of the dungeon or levelling up.</p><p><strong>Roguelike</strong><br/></p><p>Randomly generated, turn based RPG with permadeath. When you're dead - you're dead.</p><p><strong>Current Status</strong><br/></p><p>Atlas Warriors is playable, and winnable - but it is still considered to be in Alpha status. It is close to content complete, and is even occasionally fun.</p><p>It is also open sourced - and you can contribute or view the project on GitHub.</p><p>The project started as an exercise to learn Python, and became an exercise to be able to bring a game to completion. It is never going to be the worlds greatest roguelike - but it does do some unique things. When I have finished it, I intend on moving on rather then developing it in perpetuity. It is open source, and hopefully will be a good stepping stone for future projects by me and by others.</p>", "metacritic": null, "released": "2015-01-12", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/210/210df9f56cd9a7e5c956447dce8880ab.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 13, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Lachlan Kingsford"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}