{"id": 121438, "slug": "bouncing-betty", "name": "Bouncing Betty", "name_original": "Bouncing Betty", "description": "<p>Bouncing Betty is a platform puzzle game.<br/>Made for the GMTK Game Jam 2017 by Atlantic Divide Games<br/> <br/> <br/>Betty is trying to escape!</p>\n<p>Use grenades to push Betty over obstacles, blow yourself up for extra damage, and jump.</p>\n<p>The automated robot creation factory is lonely.<br/>There’s no visitors or technicians around anymore.<br/>She’s getting cabin fever, and that makes her want to explode!<br/>Betty feels trapped! It seems like whoever designed this factory wanted to keep her in.<br/>They underestimated her resolve – and the power of her explosives. </p>\n<p>Betty can’t jump, and switches are in some pretty inconvenient places! But, by using the propulsion of her grenades, she has learned how to get up high.<br/>Pushing through cardboard boxes, using her grenades to knock over metal crates, and self-destructing to get through extra strong walls, Betty will not be held captive!<br/>She doesn’t know where she’s trying to go, but she’s not staying here!<br/>Not even destruction can stop her. That’s the convenient thing about being an AI, consciousness is transferable.</p>\n<p><strong><em>Betty is ready to bounce.</em></strong><br/> <br/> <br/>Move with A/D</p><p>Grenade (jump, blow stuff up, suicide) with G</p><p>Drop grenade down with S</p><p>Throw sticky grenade straight up with W</p><p>Pause with ESC</p><p> <br/>Created with Unity, Blender, Photoshop and Audition.</p>", "metacritic": null, "released": "2017-07-16", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/eda/edace571f02534d237bd8e82e2afaaeb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 21, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["dotfortun3"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}