{"id": 121543, "slug": "deeply-absurd-chain-itch", "name": "Deeply Absurd Chain (itch)", "name_original": "Deeply Absurd Chain (itch)", "description": "<p>- Time Magazine (March 2, 2015):</p><p>\"I am immediately fond of any game that embraces its own absurdity on the most superficial level. At first, this plays like most match games—the basic principle of which is to line up as many similar items in a row. But in Deeply Absurd Chain, matching items only reveals the next link in the chain, allowing for far more complicated moves. It's a game that sends you down a rabbit hole of cartoonish puzzling with an archeological theme.\"</p><p>- Daily Mail UK:</p><p>\"I admit I started playing this purely because of the beguiling title, but it's a pretty fun little puzzle game, devoid of the usual Candy Crush moments where the game rudely asks for your credit card. You draw lines to connect together blobs, and slowly 'evolve' prehistoric creatures. Little brain power is required, but it has a serene, hypnotic quality.\"</p><p>- JayIsGames:</p><p>\"The longest chain is not necessarily the best move. You need to keep in mind your surroundings. Maybe you want that big patch of rocks to become three warm-blooded rocks instead of just one so you can combine those three into the next part of the chain. Where you end your match is important as well because the upgraded item will land there. Speed isn't a factor, so take your time to plan the best moves... Deeply Absurd Chain has a surprising amount of strategy for something so easy to pick up, and it will keep you playing for quite awhile.\"</p>", "metacritic": null, "released": "2015-05-16", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/eb9/eb9e747c832a5e2ce76a5747d051ce6c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 90, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "Web"], "developers": ["Lumarama"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}