{"id": 121675, "slug": "mini-dungeon-adventures", "name": "Mini Dungeon Adventures", "name_original": "Mini Dungeon Adventures", "description": "<p>Mini Dungeon Adventures is a hastily thrown together prototype for the 1-Bit Clicker Jam, in about 20 hours.</p>\n<p>It is a little Roguelike, where you have to descend into a dungeon for profit!<br/>Whack the beasties, bring back the loot and equipment, for fame and fortune!</p>\n<p>Basic Tutorial:<br/></p>\n<p>On starting, you'll want to just descend into the Dungeon to get a feel for things yourself. You'll come up against Giant Rats in the first few levels, but they should be easy enough to beat.</p>\n<p>You need to wait until your active bar has filled and you're marked Ready before you can do *any* action - be that open a chest, move room, hit a rat, equip/unequip an item or take an item from the room.</p>\n<p>Same goes for the enemies, they can't do anything to you until their active bars are filled and they're marked as ready. If multiple things are marked as ready, they wait for whoever was ready before them to act.</p>\n<p>You can only hold ten items in your inventory, but can click on them to drop them in the room, or climb out the dungeon to sell back at the Tavern.</p>\n<p>You can only get back to the Tavern from going up the stairs on the first floor - but luckily, you can jump to any room on a dungeon level, not just ones you're adjacent to.. helpful if you've left a giant spider sitting around after nicking it's treasure and want to get around it.</p>\n<p>In the Tavern, you can sell items and buy others by clicking on them. Items in your inventory will automatically be sold ( or equipped if there's space, so be careful with that ) and items from the Tavern ( on the right ) will be purchased.</p>\n\n<p>Known Issues:</p>\n<p>HTML5 version seems to have gray progress bars.. Windows version is white.<br/></p>\n<p>Bug Fixes:</p>\n<p>15th April 2017<br/></p>\n<p>Fixed HTML5 version not working ( randomise/randomize )</p>\n<p>18th April 2017</p>\n<p>Losing Gold each return to the Tavern.. silly me.<br/>Fixed issue with level up code - would check specifically for reaching 0, and once you reached level 5, you generally had a big enough sword that you were smacking things for enough damage to go past 0.<br/>And uploading the actual updated versions seem to help...</p>\n<p>25th April 2017</p>\n<p>Added a 720p Windows version.. so people can actually *see* things...</p><p>19th May 2018</p>\n<p>Window can be resized and game will scale accordingly, so removed the 720p version.</p>", "metacritic": null, "released": "2017-04-14", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/b2e/b2e7efdebf4249305c4025b323803eb1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 36, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["Arcade Badgers"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}