{"id": 121678, "slug": "snow-fort-defence", "name": "Snow Fort Defence", "name_original": "Snow Fort Defence", "description": "<p>//Controls// <br/>Click-Hold on snow tiles inside circle range to pack them into snowballs <br/>Mouse inside reach-range - pack snow tiles or select snowball to push <br/>Mouse outside reach-range - move or throw a snowball (leftClick) <br/>Scroll - zoom <br/>Press Scroll button - reset to 2X zoom <br/>V - set reach-range to 40 (2X norm) <br/>B - set reach-range to 20 (default) <br/>G - spawn huge snowballs used as walls <br/>P - take picture (used for last minute photos for this post) <br/>Space - start spawning enemies </p><p>//Instructions// <br/>press left mouse button on snow tiles to pack snowballs, either click on the snowball to begin pushing it into a larger snowball or run into it to keep it for throwing at enemies. <br/>roll snow and build an awesome snow fort, one room please. <br/>Or just use G, ya... . . . . . . <br/>Once your fort is built press space to begin the enemy invasion. </p><p>//About// <br/>This is my first Ludum Dare challenge (37th Ludum Dare). It's a good alpha, but it's not really a game. I procrastinated the sound and image but I can update some stuffs later once I get sleep, SWEET SLEEP. </p><p>Basically you build a snow fort with the snow tilegrid on the ground by selecting and holding down the left mouse button on a snow tile and creating snowballs. You can roll snowballs to make denser snowballs or pick them up for ammo. </p><p>I didn't get around to enemies until the final hour of the challenge so they just follow the player and take 1 hit to die. Snowballs are a little buggy and don't always collide with enemies because of how fast they are going, will fix this with sleep+time. </p><p>//Ideal game// <br/>enemies have a* pathfinding, but can also brute force into fort; <br/>enemies + player look cooler or textured instead of using SVG; <br/>more player upgrades + options; <br/>waves + menu and normal game stuffs; <br/>music + soundFX; </p><p>made in Processing 3 with JBox2d (and hopefully a* path-finding with an update) </p>", "metacritic": null, "released": "2016-12-12", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/b80/b80695dbf110973f1a13bf8535e91eeb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 26, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["PotatoMasha"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}