{"id": 121604, "slug": "memes-io-itch", "name": "Memes Io (itch)", "name_original": "Memes Io (itch)", "description": "<p>Memes, mazes, emoji ... What is it? If you played at least once in the life in iо games, you will solve this puzzle!This is fun network retro arcade, where your favorite trollface running around on confusing maze! Now you and the millions of fans of IO games from around the world will meet on the same playing field.</p><p>ONLINE BATTLE OF THE VIRTUAL WORLD</p><p>Your task is to eat everything in your way and win virtual crown of power. How to do it? It's simple!</p><p>PLAY IN REAL TIME</p><p>You are quick smile and you freely move on maze of the game. Collecting stars and your trollface increases in size! The bigger the size of star, the more points you get!</p><p>You become ruler of the maze and run with the Crown?! PFFT .... not so simple, at any time, you can fall into the trap and become lunch of spiteful troll!</p><p>The more you in size, the more you get the thrill of the game!</p><p>In the game you will receive free pac skins.</p><p>MAZES</p><p>Intricate mazes, where scattered stars and boosts with superpowers, it's all for you, hurry up to pick them up! Green cube- it is super toilet where you're invincible. While there, you gradually lose everything that you have eaten in the game. Do not sit long in the toilet, otherwise you will become a small meme!</p><p>Play this classic retro arcade game online. Only the fastest and agile will win Memes.io arcade</p><p>Download online free game and win your friends!The game was inspired by such a project as agar and diep.</p><p>For all questions and suggestions please contact us at support@abeex.ru</p>", "metacritic": null, "released": "2017-02-13", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/8a3/8a38966cb4a840b919d491a12ca8375d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 37, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["game.aria"], "genres": [], "publishers": [], "esrb_rating": null}