{"id": 12164, "slug": "little-triangle", "name": "Little Triangle", "name_original": "Little Triangle", "description": "The game is a platformer that many players feel very challenging, and some feel the difficulty is just right. Do not be confused by the funny art style and those interesting animations, this is definitely a hardcore game. In the game, a player need to jump over dangerous levels to save hostages and collect diamonds.<br/>\n<br/>\r\nYes, we focus only on jump rather than shooting or puzzle solving elements. By holding longer, you can jump further. And it supports double-jump in the air. You can also jump right onto a goblin, a bomb or a boss to attack. Players need to control precisely to pass the levels. In the game, there are many hidden areas to explore, simply passing the levels is far from finishing the game. As for the art style, many players can tell from the first sight that this is a CottonGame product. Those various animations, styled characters and interesting graffities all make this game unique among countless platformers.<br/>\n<br/>\r\nDuring the early access, we would like to get as many feedbacks as we can, and we will update the game actively while designing new levels to get ready for the release within half a year.<br/>\n<br/>\r\nWe support keyboard, Xbox One and PS4 controllers at the moment. A few other controllers will also be supported shortly in the future.", "metacritic": null, "released": "2017-01-20", "tba": false, "updated": "2019-08-28T22:13:27", "background_image": "https://media.rawg.io/media/screenshots/0ac/0acf306581d992b2c20b7a6ba6871f13.jpg", "website": "http://www.mechanicarms.com/software/littletriangle_e.html", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 28, "dropped": 3}, "playtime": 4, "achievements_count": 64, "ratings_count": 1, "suggestions_count": 248, "game_series_count": 0, "reviews_count": 1, "platforms": ["Xbox One", "Nintendo Switch", "macOS", "PC"], "developers": ["Cotton Game", "CottonGame"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Dreamoji", "KONANDENKI"], "esrb_rating": "Teen"}