{"id": 121747, "slug": "insect-adventure-dd16", "name": "Insect Adventure DD16", "name_original": "Insect Adventure DD16", "description": "<p>In Insect Adventure, you take the role of Bugsy, an alien bug who had his beloved friend Mayo kidnapped by a monsterous Lizardman. Cast into a dark cavern, he finds a hammer and starts a quest for revenge, smashing any other bug that stands in his way.<br/></p><p><strong>--NEW UPDATE!!--<br/></strong></p><p>-Added mouse control for menus, including the title screen. Changed around some text to make it a little easier to tell what buttons to press for menus. As a rule of thumb, left clicking on something highlighted will confirm your selection, while right clicking will take you to the previous menu. You can also change menus while paused by hovering the mouse over the names of the menu to the left and right of the current selected menu.<br/></p><p>-Should you end up in a situation where you can't control your character, you'll be able to use the mouse to pause the game, navigate to the controls menu, and rebind whatever keys necessary.<br/></p><p>-Rebinding controls should work much better now, the menu now displays the buttons for joypad controls next to the keyboard key binds. Binding keys to things that share the Pause, Quit, and Menu Decline buttons shouldn't take you out of the menu anymore, and rebinding the Jump and Menu Confirm buttons shouldn't instantly force you to rebind another key. Mouse navigation makes this a lot less painful as well.<br/></p><p>-Changed Bugsy's running acceleration speed, and greatly reduced the speed drop when he lands from a jump.</p><p>-Added instructions for the shop menu.</p><br/>", "metacritic": null, "released": "2017-09-09", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/d85/d8565822932c27198c21e19352e2a2be.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 94, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Mayo"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}