{"id": 121727, "slug": "night-terrors", "name": "Night Terrors (itch)", "name_original": "Night Terrors (itch)", "description": "<p>Every night you are plagued by nightmares, causing you to miss out on restful sleep. Learn to navigate your dreaming mind to avoid the nightmarish creatures and sleep fully through the night.</p><p>Use ARROWS or WASD to move. Mouse over enemies or the interface for more information.</p><p>Monsters are spawned with a random behavior (color) and type (picture). Their behavior determines how they move in relation to you, and their type adds a little personality.</p><p>You have always been mildly lucid in your dreams, and so you are partially aware of your upcoming thoughts. Use this awareness to decide where they will be added to your dream. When new thoughts are added, time passes. The amount of time that passes is directly related to the number of monsters that exist in your dream. Will you try to pass time slowly and safely with only a few monsters around, or can you navigate a dozen monsters expertly to pass time quickly?</p><p>You may defeat monsters by walking into them or forcing monsters to walk into each other. But, be careful, because if a monster walks into you, you will force yourself awake and lose out on the restful sleep you long for. </p><p>This game was made for the 2016 7-Day Roguelike Challenge (7DRL). As such, it is a very small game without much polish. The design intent was to have a small, deterministic 1-hp puzzle roguelike where the player has some control over the procedural generation, and also have a nightmare theme with an abstract horror feel. I also hope to release mobile and browser versions, so the game and UI couldn't be too complex. </p><p>I would appreciate all feedback on this project. Currently there is only a Windows version, but I soon hope to add support for other platforms. If the game has a generally positive reception, I may expand upon it and give it a facelift. If you are an artist who would like to do some art to overhaul the graphics, please contact me. </p><p>Thanks!</p><p>Try to get some sleep...</p>", "metacritic": null, "released": "2016-03-16", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/f2f/f2fb97ab99240babb0c43edc236ad574.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 61, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["High Sodium Games"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}