{"id": 121762, "slug": "vaporwave-pizza-co", "name": "Vaporwave Pizza Co", "name_original": "Vaporwave Pizza Co", "description": "<p>VaporwavePizzaCo!<br/></p>\n<p>You are working for Chef making pizzas. Grab ingredients and put them on the pizza. Oh, grabbing also slows time, regardless if you have something in your hand or not. PROTIP: You move slightly faster in slow down, but time is money!</p>\n<p>Made for the #GMTKjam in July 2017, this 48-hour game jam theme was \"dual purpose\", thus the dual purpose of grabbing items and slowing time.</p>\n<p>CONTROLS:</p>\n<p>Arrow Keys / LStick: Move Hand<br/>SPACEBAR / (A) Button / JOY Button 1: Grab</p>\n<p>(sorry d-pad support wasn't working and I needed to turn this in. Stick or keyboard arrows only.)</p>\n<p>3rd Party Stuff:</p>\n<p>Picture of chef is this: https://www.pexels.com/photo/food-kitchen-eat-cooking-33614/<br/></p>\n<p>Font is PC Senior: http://www.1001fonts.com/pc-senior-font.html</p>\n<p>Libraries:<br/>* SDL used for lots of stuff. (render, sound, events) https://www.libsdl.org<br/>* LZ4 for compression.  https://github.com/lz4/lz4/</p>\n<p>LEGAL STUFF:</p>\n<p>SDL2 LICENSE:</p>\r\n\r\nThis software is provided 'as-is', without any express or implied\r\nwarranty.  In no event will the authors be held liable for any damages\r\narising from the use of this software.\r\nPermission is granted to anyone to use this software for any purpose,\r\nincluding commercial applications, and to alter it and redistribute it\r\nfreely, subject to the following restrictions:\r\n1. The origin of this software must not be misrepresented; you must not\r\n   claim that you wrote the original software. If you use this software\r\n   in a product, an acknowledgment in the product documentation would be\r\n   appreciated but is not required.\r\n2. Altered source versions must be plainly marked as such, and must not be\r\n   misrepresented as being the original software.\r\n3. This notice may not be removed or altered from any source distribution.\r\n<p>LZ4 License:</p>\r\nLZ4 Library\r\nCopyright (c) 2011-2016, Yann Collet\r\nAll rights reserved.\r\nRedistribution and use in source and binary forms, with or without modification,\r\nare permitted provided that the following conditions are met:\r\n* Redistributions of source code must retain the above copyright notice, this\r\n  list of conditions and the following disclaimer.\r\n* Redistributions in binary form must reproduce the above copyright notice, this\r\n  list of conditions and the following disclaimer in the documentation and/or\r\n  other materials provided with the distribution.\r\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\" AND\r\nANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED\r\nWARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE\r\nDISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR\r\nANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES\r\n(INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;\r\nLOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON\r\nANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT\r\n(INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS\r\nSOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.", "metacritic": null, "released": "2017-07-17", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/80a/80a559b3b5c644f34a32bfae29222cdf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 12, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Ryan Alyea"], "genres": ["Action"], "publishers": [], "esrb_rating": null}