{"id": 121725, "slug": "third-party-2d", "name": "Third Party 2D", "name_original": "Third Party 2D", "description": "<p>English:<br/></p><p>Welcome to \"Third Party\", a strategy simulation set in a fantasy medieval era, where you try to influence the actions of kings and their realms by all means necessary. Depending on which kingdom you are targeting, you can change the outcome of a war. Your goal is to change everything that happens into something that helps your plans. This can only be done step by step, patience and the right amount of gold. After choosing your preferred kingdom you cannot leave it and have to work with what is happening in it.</p><p>- Living world, where the kingdoms fight, trade and fight again. Actually, they can even be friends. Every time you start you have a new beginning and the kingdoms might react totally different</p><p>- Pull some strings behind the scenes or send your own small detachment of soldiers or undead.</p><p>- Beautiful pixel art for the entire game<br/></p><p>- My very own saving system created for this game. You have one save slot, use it carefully<br/></p><p>- No game destroying decisions for your character: You chose the wrong starting skill? Well, it may be more difficult but not impossible. But you better be careful about choosing your talents ingame.</p><p>-The entire game can be translated into other languages by the push of a button even ingame. Currently only german and english are present. My latin is a bit rusty<br/></p><p>- And whatever you do, the world will react to you: Too much magic in the air? The Church will take care of it. Too many bandits raiding the traders? That's what the city watch is for. No wars happening? Just bribe your way to be the kings advisor and start to change things!<br/></p><p>This is the first public version with some bug fixing and balancing done. To have a proper version, it needs much more of this, that is why I am offering it to the public. </p><p>If you encounter any bugs or glitches or want to help balance this game, please send me an email (info@night-of-the-undead.de) and tell me what happened. Even if you don't know, why the game stopped, please tell me so I can do some testing on my own. But of course: Every bit of information helps.</p><p>Deutsch:<br/></p><p>Willkommen bei meinem Spiel, Third Party, einer Strategiesimulation in einer fantastischen, mittelalterlichen Ära, in der du versuchst Könige und ihre Königreiche zu beeinflussen, koste es was es wolle. Je nachdem gegen welches Königreich du momentan vorgehst, kannst du sogar Kriege beeinflussen.</p><p>Dein Ziel: Alles was passiert beeinflussen damit es dir bei deinen eigenen Plänen hilft. Dies kannst du aber nur Schritt für Schritt machen, du benötigst Geduld und einen Haufen Gold. Nachdem du dich für ein Startkönigreich entschieden hast, kannst du dieses nicht mehr verlassen und du musst mit dem Arbeiten, was dir gegeben wird.</p><p>- Du bist eine einzelne Person in einer lebendigen Welt, welche sich weiterentwickelt, wo Königreiche miteinander handeln und Kriege führen, selbst, wenn du nichts dazu beiträgst.</p><p>- Zieh die Fäden hinter den Kulissen oder sende einfach eine kleine Gruppe Soldaten aus .. oder Untote.</p><p>- Bau dir deinen Charakter wie es zu deiner Strategie am besten passt: Gold anhäufen als großer Händler, durch mächtige Magie die Bauern des Landes töten oder ein paar Grenzkonflikte vom Zaun brechen die sich zu einem Krieg entwickeln können.</p><p>- Je nachdem was du machst, wird das Königreich auf deine Anwesenheit reagieren und es kann geschehen, dass du im Kerker der Stadtwache landest oder, wenn du es wahrhaftig übertrieben hast als bösartiger Magier, verbrannt wirst durch die Kirche.</p><p>- Wenn du mal keine Lust hast immer nur von deutschen Texten umgeben zu sein, ändere einfach die Sprache in Englisch um. Dies kann auch mitten im Spiel gemacht werden, also kein unnötiges Neustarten.</p><p>Das hier ist meine erste, öffentliche Version und sie wird noch einige Fehler enthalten und ich muss auch noch die Balance hinkriegen, damit es rund läuft. Damit dies möglich ist, brauche ich die Hilfe von euch, damit ich erfahre, was noch fehlt und was besser fehlen sollte.</p><p>Wenn du also einen Fehler findest, egal welcher Art, schicke mir einfach eine Email (info@night-of-the-undead.de), damit ich etwas dagegen tun kann. Selbst wenn du mal nicht weißt, warum das Spiel stoppte oder was gerade falsch läuft, so ist jede Information wichtig und kann viel helfen.</p>Rackhim", "metacritic": null, "released": "2016-12-16", "tba": false, "updated": "2019-08-28T23:23:41", "background_image": "https://media.rawg.io/media/screenshots/e98/e989ae9267ce285920bdbb5f0a893efb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 77, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Rackhim"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}