{"id": 121830, "slug": "boom-boots", "name": "BOOM BOOTS", "name_original": "BOOM BOOTS", "description": "<p><strong>Controls:<br/>Left/Right - Arrow Keys<br/>Jump - Space Bar (hold to jump higher)<br/>Enter Door - Arrow Key Up</strong></p>\n<p>Marvin wears some pretty wicked Boom Boots™ that allow him to jump; unfortunately every jump causes some of the ground to be destroyed. While Marvin's goal is to descend into the cave, it might be in his best interest to explore the top parts of the cave, but beware: too much jumping can hurt his ability to reach the top floor, where the best goodies are.<br/></p>\n<p>Around the levels are Iron Deposits. Destroying these with his Boom Boots™ allows Marvin to acquire currency. In general, a greater number of Iron Deposits spawn in the higher areas of each stage.<br/>There are two ways to finish a Stage: Exit through the Door or Fall through the Floor. If Marvin reaches a door, he safely visits the next stage. If he can't make it to the door, that's okay; he can still fall down through the bottom. This will still take him to the next level, but it will damage him for 1 health and make him drop 50% of his cash. Sad!<br/>Every now and then, Marvin faces a boss. Perhaps a boss will require you to be extra careful with how much ground you destroy, while another will require you to be as destructive as possible. One thing's for certain: Every boss will require you to jump. Put those Boom Boots™ to work!</p>\n\n<p>Paxx - Programmer, Artist<br/>What's With Games - Lead Designer, Artist<br/>ShinyZigzagoon - Touch-Up Artist<br/></p>", "metacritic": null, "released": "2017-07-16", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/054/0540bb3232f1d908c1ac4631c8f73113.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 19, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["PixelCrate"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}