{"id": 121896, "slug": "harvestthowback", "name": "Harvest&Thowback", "name_original": "Harvest&Thowback", "description": "<p>Well this is a manager wanna be, so keep track of your resources, production, and pay attention to your round's final score, try to keep it always higher than when you started.</p>\n<p><strong>Spring/Market</strong>: is the first screen, is when you can hire, fire workers, sell and buy machines and sign contracts to raise money.<br/></p>\n<p><strong>Summer/Company: </strong>is the second screen, make your decisions on the events (strikes, layoffs and inspections) they don't always happen, so no panic if this screen is just a cute starfish/crab generator.<br/></p>\n<p><strong>Fall/Harvest:</strong> is the third and most important screen, here you prepare your field for production and try to fulfill contracts. I tried to make a supply x demand mechanic, which is not working good...so...we will have to deal with it later<br/></p>\n<p><strong>Winter/Receipt: </strong>a passive screen, nothing else to do here other than see your money being robbed by taxes, receive your contract payments and pay your workers. Here you will know if you broke or can still go back to the market.<br/></p>\r\nWin/Lose Conditions\r\n<p>The game is simple, if you ended with less than 0 in the <strong>Receipt</strong> screen, you broke, game over, else you can keep trying. You win when you successfully survive through 5 rounds and established a company in the market, well done, pay attention to the win screen message I made it with love ♥</p>\r\nRefining\r\n<p>What about we keep this game being upgraded, refining it and polishing it? As said before you can fork it which means you can have your own version, no ties. You can even sell it if you want to. But what about you help with some contributions to the official repo? Github Gameoff is a jam about learning Github, so why not use what we learned to pratical examples? :)</p>\n<p>That's it, thank you for playing, I hope you enjoyed! <em>Keep developing and until the next time.  </em><br/></p>", "metacritic": null, "released": "2017-12-01", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/1f3/1f302eb85a3e3052979dfbb47d8aa733.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 50, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["Pigdev Studio"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}