{"id": 12183, "slug": "warhammer-40000-sanctus-reach", "name": "Warhammer 40,000: Sanctus Reach", "name_original": "Warhammer 40,000: Sanctus Reach", "description": "<p>Warhammer 40,000: Sanctus Reach brings you to a dark era of carnage and endless war. There is no peace among the stars: the Imperium of Man is beset on all sides by all kinds of threats. Among them is the Orks, a barbaric and warlike xeno race. One of their fiercest leaders, Grukk Face-Rippa, leads his Red Waaagh! in the Sanctus Reach system. Worlds after worlds fall to billions of Orks, until only one last planet resists the green tide: the Knight World of Alaric Prime. This is where a brave company of Space Wolves makes its stand to defend the last bastion of mankind in the system…<br />\nWarhammer 40,000: Sanctus Reach is a 3D turn-based strategy game like you’ve never seen before: fast, immediate, deep, impressive to look at and incredibly fun! Lead the Space Wolves in their struggle against the Orks through two uncompromising and long story-driven campaigns: Stormclaw and Hour of the Wolf. Command several dozen different authentically crafted units and heroes, with unique and extremely detailed 3D models that bring the universe of Warhammer 40,000 to life.<br />\nThe gameplay is rich and varied: spend your points, make your list, choose your deployment, and fight! Units at your disposal have different abilities, strengths and weaknesses, can level up and are carried over between scenarios. Choose among many different types of weapons, watch your flanks and make a wise use of the terrain: any tactical choice will be vital.<br />\nWith a campaign system, a skirmish mode, a map generator and multiplayer PBEM++ support the game offers endless replaybility.</p>\n<p>Features:<br />\n•   Lead either the Space Wolves Space Marines in the campaign or the green tide of the Orks in skirmish battles!<br />\n•   Two campaigns: Stormclaw (over 20 missions and skirmishes!) and Hour of the Wolf (over 25 missions and skirmishes!)<br />\n•   Play as the mighty Space Wolf heroes Krom Dragongaze, Ragnar Blackmane and their Jarl, the High King of Fenris, Logan Grimnar as well as the Ork Warbosses Grukk FaceRippa and Mogrok da Mangla<br />\n•   30 Space Wolf units from packs of Blood Claws to the fearsome Predator – And lead the legendary Imperial Knight Gerantius!<br />\n•   30 Ork Goff units including the formidable Gorkonaut!<br />\n•   Unit experience level progression though campaigns which unlock new abilities and tactical options<br />\n•   Generated skirmish maps on many different types of terrain and environment<br />\n•   Addictive multiplayer modes using Slitherine’s online PBEM++ server</p>", "metacritic": 68, "released": "2017-01-18", "tba": false, "updated": "2023-11-02T02:48:31", "background_image": "https://media.rawg.io/media/games/5cc/5ccbf77a49a31d3064bd600965223447.jpg", "website": "", "rating": 2.5, "rating_top": 3, "added_by_status": {"yet": 18, "owned": 279, "beaten": 2, "toplay": 8, "dropped": 11}, "playtime": 3, "achievements_count": 12, "ratings_count": 21, "suggestions_count": 619, "game_series_count": 39, "reviews_count": 22, "platforms": ["PC"], "developers": ["Straylight Entertainment"], "genres": ["Strategy"], "publishers": ["Slitherine"], "esrb_rating": null}