{"id": 12190, "slug": "bird-of-light", "name": "Bird of Light", "name_original": "Bird of Light", "description": "WHAT IS THE BIRD OF LIGHT?Finding the answer to this question will take skill, strategy, intelligence and insight. You will need to become One with the Path.  <br/><br/>Bird of Light is an action-strategy platformer with a twist. Place bridge tiles to create paths through levels in the sky, then run through avoiding obstacles in your path. Leap over vast chasms, collect loot, and discover new lands on your journey.THE STORY OF TARA <br/>Tara, an eight-year-old girl, is something of a loner whose family moves to a farm from the city to improve the quality of their lives. Once in the country, Tara soon makes friends with all the animals on the farm. Everything goes well until one day, her animal friends start mysteriously disappearing one at a time. Tara struggles to understand what's going on, but luckily, Tara and the animals have a friend and guide in the Bird of Light, who talks to them and helps to make sense of it all.<br/><br/>The gameplay is an abstract representation of Tara's search for The Truth.<br/><strong>GAME FEATURES</strong><br/><ul><li>2D level design puzzle transforms into 3rd person action.<br/></li><li>Multiple level solutions and multiple pathways within each solution. <br/></li><li>21 Hand-crafted levels with three unique missions and two leaderboards in each level.<br/></li><li>33 unique Achievements <br/></li><li>Over 10 hours of gameplay. <br/></li><li>Unique mode of storytelling; interactive story scenes unlocked as you progress. <br/></li><li>Subjective Difficulty Design engages players of all skill levels.<br/></li><li>New abilities and mechanics unlocked as the game progresses: The Leap, Teleportation, Moving pickups.<br/></li><li>Pause screen serves as a path finding map.<br/></li><li>Intuitive and efficient controls.</li></ul>", "metacritic": null, "released": "2016-07-15", "tba": false, "updated": "2019-08-28T22:13:26", "background_image": "https://media.rawg.io/media/screenshots/0de/0de6393f2762b0d47cf78117f2536143.jpg", "website": "http://www.roachinteractive.com/birdoflight.html", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 56, "beaten": 1}, "playtime": 5, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 250, "game_series_count": 0, "reviews_count": 1, "platforms": ["macOS", "PC", "Linux"], "developers": ["Roach Interactive"], "genres": ["Action", "Adventure", "Strategy", "Casual", "Indie"], "publishers": ["Zen Labs"], "esrb_rating": null}