{"id": 1219, "slug": "cardinal-quest-2", "name": "Cardinal Quest 2", "name_original": "Cardinal Quest 2", "description": "First the Minotaur conquered the Castle and wrecked the Forests, bellowing laughter and ruin. Then the Dragon returned to the Mountain, bathing its ancient halls in searing flame. Now behind them both a creature unspoken pulls the strings, orchestrating this world's extinction from a strange darkness...<br/><br/>They've taken everything from you. Now it's time to take them down.<br/><br/><strong>TURN-BASED TACTICAL SLAUGHTER</strong><br/><br/>Use your wits and strategy to overcome all obstacles! Every decision is permanent and death creeps closer with every step... but even death is just an opportunity for the fun to start again, as every restart creates an entirely new adventure!<br/><br/><ul><li>Three story campaigns to play, plus a remix Endless mode: The Tower<br/></li><li>Random levels and game-changing Legendary items keep every game fresh<br/></li><li>Smart, no-fuss character building systems keep the action moving<br/></li><li>Seven massively unique heroes to master, each with fearsome strengths and skills</li></ul><br/><strong>CHOOSE YOUR COMBAT STYLE</strong><br/><br/>Be <strong>The Thief</strong>, a backstabbing scoundrel who lurks in the shadows and leaps from bushes to strike unwary targets<br/><br/>...<strong>The Alchemist</strong>, a daydreamer with the skills to craft incredible potions and a penchant for building custom firearms from scavenged parts<br/><br/>...<strong>The Ranger</strong>, an archer with a heart of gold who raises a trusty Dog companion to fight at their side<br/><br/>...<strong>The Wizard</strong>, a spell-slinging exile who was too quick with a good Fireball for the Academy's bureaucrats<br/><br/>...<strong>The Fighter</strong>, a veteran sword-and-steel mercenary who's seen too much bloodshed to let this war crush any more<br/><br/>...<strong>The Paladin</strong>, a holy monk who swore to strike down evil in its many forms—and who sees a great deal of evil<br/><br/>...or be <strong>The Pugilist</strong>, a human wrecking ball who lives to find an enemy they can't finish with a fist to the face!<br/><br/><strong>IT'S GOING TO GET MESSY</strong><br/><br/>Between bloodthirsty Bandits, deadly Ogres, vulgar Werewolves, the cruelest Cockatrices, ancient unknown Horrors and much much more... there's so much out there that wants you dead. You can't let them have their way. Cardinal Quest II's many challenges await you!", "metacritic": null, "released": "2014-03-19", "tba": false, "updated": "2019-10-22T14:27:39", "background_image": "https://media.rawg.io/media/screenshots/1ce/1ce3eb75a07cfc63c3ce866084f38493.jpeg", "website": "http://cardinalquest2.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 12, "dropped": 1}, "playtime": 4, "achievements_count": 169, "ratings_count": 3, "suggestions_count": 253, "game_series_count": 0, "reviews_count": 3, "platforms": ["Android", "Linux", "iOS", "macOS", "PC"], "developers": ["Kongregate", "randomnine"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["Kongregate", "Randomnine"], "esrb_rating": null}