{"id": 12203, "slug": "pocket-kingdom", "name": "Pocket Kingdom", "name_original": "Pocket Kingdom", "description": "Certain rumors persist among air travelers. Rumors about mysterious islands that sometimes appear up there in the clouds out of the blue. According to the legend, the Old Gods withdraw to those islands, casting spells of oblivion and serenity on them. <br/><br/>The chief editor of a well-known newspaper made me an unusual offer. He promised to reward me for bringing photographs of one of those peculiar islands and the God resting there. <br/><br/>A strange offer, to say the least. One I could not refuse however: at that time, creditors were incessantly banging at my door. When they threatened to seize my beloved airship to pay off the debts, I didn’t think twice and immediately left on my quest. <br/> <br/><br/><strong>Pocket Kingdom</strong> is an authentic throwback to Amiga era. Signature steampunk pixel art, winsome chiptune soundtrack and retro-inspired gameplay with modern twists make <strong>Pocket Kingdom</strong> an unparalleled journey. <br/><br/>Wander around the island's enchanted districts. Unlock access to new areas by collecting objects scattered here and there. Trick gravity, discover helpful devices and listen to the weird stories told by the locals. Getting out of the Pocket Kingdom depends on it. So does unveiling the place's mysteries.", "metacritic": null, "released": "2016-12-08", "tba": false, "updated": "2019-09-17T11:51:46", "background_image": "https://media.rawg.io/media/screenshots/70d/70d787b34e4592c26ac16f8a9c6772df.jpg", "website": "https://twitter.com/mypocketkingdom", "rating": 4.5, "rating_top": 5, "added_by_status": {"yet": 4, "owned": 182, "beaten": 3, "toplay": 5, "dropped": 2, "playing": 1}, "playtime": 4, "achievements_count": 16, "ratings_count": 6, "suggestions_count": 280, "game_series_count": 0, "reviews_count": 6, "platforms": ["macOS", "PC", "Linux"], "developers": ["08 Games"], "genres": ["Adventure", "Indie"], "publishers": ["Plug In Digital", "WhisperGames"], "esrb_rating": null}