{"id": 122035, "slug": "desperate-vessel", "name": "Desperate Vessel", "name_original": "Desperate Vessel", "description": "<p>Want to play the latest post-Ludum Dare version? Skip all this and just download \"<strong>DesperateVessel-PostLD-r0-all.zip</strong>\" at the bottom.</p><p>---</p><p>A briefly-made 2-button game about surviving a hail of rubbish.**</p><p>It's kinda mean, but perhaps that makes the struggle more meaningful? <br/></p><p>There's no instructions, so please bear with me: <br/><br/><br/>INSTRUCTIONS: <br/><br/>You are the little pink-ish cube. <br/><br/>Your controls: <br/><br/>- left-arrow / \"a\" key thrusts you forward and spins you left-ward, in a spiral-y fashion. <br/>- right-arrow / \"d\" key thrusts you forward and spins you right-ward, in a spiral-y fashion. <br/><br/>N.B. Press both keys to move forward without spinning. <br/><br/><br/>Your objective: <br/><br/>- Touch the little spinning circle-things before they disappear to increase your score. <br/>- Score high enough to win. <br/>- Move outside the screen for too long to lose. <br/><br/>Other bits: <br/><br/>1. Rubbish rains from above. Knocking into it won't kill you, but may knock you off-course. <br/><br/>2. You fire forward constantly and messily. Your fire can break down the rubbish. <br/><br/>3. Gravity drags you down. Keep thrusting against gravity to avoid falling off the screen. <br/><br/>4. The big drunken circle-thing in the background indicates which way you are pointing. You can look at this when you're offscreen to try to navigate back onto the screen. Watch for your fire entering from offscreen, too, for an extra clue to your position. </p><p>5. When you lose, click the unremarkable bit of text that says \"Retry?\" if you want to retry.</p><p>6. There is no pause button. I am sorry about this.<br/><br/><br/>END OF INSTRUCTIONS <br/><br/></p><p>Made for the Ludum Dare 34 \"Jam,\" in small anxious spurts over a weekend and the following Monday night. The theme for LD34 was a tie: \"Two Button Controls\" and \"Growth.\" The latter's relationship may not be obvious, so feel free to have fun with it. (Freebie #1: Rubbish is a common byproduct of growth, one way or another. Freebie #2: The lack of a pause button introduces a growing pain in the wrist if you continue to play, etc.)</p><p>Credits:</p><p>Textures/icons are all from default Unity packages; I just tinted &amp; scaled them. Not that it makes much of a difference.</p><p>**The game is also about having been knocked out of a time-stream and being rescued by your compatriots, but I'm afraid you'll have to use your imagination for that one.<br/></p>", "metacritic": null, "released": "2015-12-15", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/4f9/4f9159458fcdd6d9c96222c6de0ac909.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 78, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["mr. a"], "genres": [], "publishers": [], "esrb_rating": null}