{"id": 122077, "slug": "cellular-mecanica", "name": "Cellular Mecanica", "name_original": "Cellular Mecanica", "description": "<p><strong>Quick overview</strong>:</p><p>A prototype about building contraptions using cell-like units. There's only a small sandbox area to build with no objectives or limitations. If you make anything cool with this I would love to see it!</p><p><strong>Controls</strong>:</p><p>Left click to add a new cell. The type you are creating is displayed at the top left corner of the screen and you can change the type using the scroll wheel. The mouse cursor radius tells you which connections to other cells the new placement will have.</p><p>To add a cell without connecting to anything use right click instead.</p><p>To create connections left click and drag from cell to cell. If you drag to empty space it will create new cell.</p><p>Middle mouse button to move cells around.</p><ul><li>S - pauses and resumes the simulation.</li><li>L - toggles lines on and off. EXTREMELY slow! it's the dumbest implementation of a line renderer ever conceived. So turn it off when your contraption starts to lag.</li><li>F - switch between air and fluid.</li><li>R - resets everything.</li><li>ESC - closes the game.</li></ul><p>NOTE: there is no way to delete cells or connections at the moment.</p><p><strong>Types of cells</strong>:</p><ul><li>Soft tissue. Think world of goo. Or cartilage They hold together but not very solidly.</li><li>Hard tissue. Think bridge building games. Or bones.</li><li>Muscle cells. They contract whenever they get a signal.</li><li>Neuron (spacebar). Emits a signal through the network whenever you press space bar.</li><li>Neuron (touch sensitive). Emits a signal whenever it touches something.</li><li>Fix. Just an anchor point.</li></ul><p>NOTE: you can see the signal strength by the light of the cell. Every cell so far let's 50% of the signal through, so the range is not infinite. At the moment, the muscle cells contract the same amount independently of the signal strentgh.</p>", "metacritic": null, "released": "2016-07-07", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/f81/f817faf6c16104c21021c3cfebca3fbe.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 12, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["diegzumillo"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}