{"id": 12202, "slug": "spellstone", "name": "Spellstone", "name_original": "Spellstone", "description": "Spellstone is a fantasy card game with beautiful hand-drawn art and rich lore! Collect hundreds of striking cards to battle through a compelling story to unravel the mystery of the Void. <br/><br/>Heroes, creatures, monsters, demons, animals, and more are brought to life with a stunning hand-painted style.<br/><br/><br/><br/>Capture Spellstones to unleash ancient and powerful creatures! However, there is dark magic at work on the island. Will you become a Hero or be consumed by the Void?<br/><br/><br/><br/>Designed for desktop players, Live Multiplayer PVP adds a new layer of competition to the world of Spellstone! And follow the world of Spellstone through a series of special stories and other events too, with branching tales and powerful treasures.<br/><br/><br/><br/>Do you have what it takes to rise to the top of the Bounty Hunter charts? Battle players around the world for huge bonuses, powerful unlocks, and bragging rights.<br/><br/><br/><br/><ul><li>Three factions of heroes and creatures to battle and control. Do you favor the Powerful Wyld, Nimble Aether, or Fiery Chaos?<br/></li><li>Hundreds different creatures to collect, upgrade and fuse!<br/></li><li>Master powerful card skills to win an edge over your opponents.<br/></li><li>Battle thousands of other users around the world to prove who is the best!<br/></li><li>96 levels and 7 levels of mastery with endless player rewards for each.<br/></li><li>Hundreds of hand-drawn character cards that evolve as they become more powerful!</li></ul>", "metacritic": null, "released": "2015-09-16", "tba": false, "updated": "2023-05-02T07:30:37", "background_image": "https://media.rawg.io/media/screenshots/513/513fe2c410a2c5af7033d43543fd8930.jpg", "website": "", "rating": 3.29, "rating_top": 4, "added_by_status": {"owned": 197, "dropped": 5, "playing": 2}, "playtime": 1, "achievements_count": 29, "ratings_count": 7, "suggestions_count": 235, "game_series_count": 0, "reviews_count": 7, "platforms": ["macOS", "PC", "iOS", "Android"], "developers": ["Kongregate", "Synapse Games"], "genres": ["Adventure", "RPG", "Strategy"], "publishers": ["Kongregate"], "esrb_rating": "Everyone 10+"}