{"id": 122047, "slug": "against-the-godds", "name": "Against the Godds", "name_original": "Against the Godds", "description": "<p><strong>The game was far too ambitious for one developer. It is abandoned and incomplete. The game is still playable, it can take a few hours to get the best gear and defeat all bosses.</strong></p><p>Against the Godds is a 2d top-down tile-based action combat game. You discover, build, craft and fight your way to victory against two Godds - god-like creatures hiding inside dungeons and evil lairs.</p>\n<p>AtG takes place in a fantasy world. The map is proceduraly generated and you can watch it appear. There are several biomes - grasslands with villages, dungeons with maze-like rooms...</p>\n<p>There are many weapons and armors to craft, materials to gather typically from corpses of your enemies, and spells to weave.</p>\n<p>You can build a house, cave, village or whatever you want. AtG features various tiles and biomes in similar fashion to Minecraft or Terraria.</p>\n<p>The combat is really fast-paced and tactical. In many cases running around swinging your sword will only get you killed. Bait monsters into killing each-other, or dode their attack by covering behind a wall.</p>\n<p>Spell-casting uses an innovative system, where you can use any spell you crafted in conjunction with any other to combine their effects. This results in combos such us Fire-Guard-Fly, which blocks an enemy spell, flies in a straight line and burns enemies. When casting a spell, symbols appear over a character, making it possible to predict its effects and quickly cast a counter-spell.</p>\n<p>AtG also has multiplayer features. You can start a game and let your friends join you on your adventures. Or kill them, that is on you. The multiplayer works best over local network, but public servers can also be created.</p>\n<p>Blog about the development: https://againstthegodds.wordpr...</p>\n<p>In latest version:</p>\n<ul><li>Building, mining, farming</li><li>Various animals, enemies, two bosses</li><li>Map generation</li><li>Combat with spells and swords</li></ul>\n<p>But:</p>\n<ul><li>Many sounds are missing</li><li>Multiplayer is disabled</li></ul>\n<p><strong>How to play:</strong></p>\n<ul><li>First fill in character name and generate a map in generation menu</li><li>WSAD to walk, SHIFT to run</li><li>X to open inventory, click to equip items, alphanumeric keys to bind spells</li><li>TAB to switch between combat and build mode</li><li>Fight or build with mouse and alphanumeric keys</li><li>E to use activable blocks</li><li>Escape to open menu</li><li>Debug keys(sorry): Q to spawn a mob, P to pathfind to mouse</li></ul>\n<p>Source code is under CC BY 4.0 license, you may use my work commercially, if you give credit for my part.</p>", "metacritic": null, "released": "2017-09-02", "tba": false, "updated": "2019-08-28T23:23:40", "background_image": "https://media.rawg.io/media/screenshots/8f0/8f094bc84f5ee2688d08fdf0784e3701.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 65, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Pagi"], "genres": ["Action"], "publishers": [], "esrb_rating": null}