{"id": 122025, "slug": "save-yourself-amaxang-games", "name": "Save Yourself (AMAXANG GAMES)", "name_original": "Save Yourself (AMAXANG GAMES)", "description": "<p><strong>GAME STORY</strong><br/></p><p>The Army of HRU have arrived in order to destroy the Earth. All the people of the Earth knew that, one day, they would be attacked by HRU Army but they never expected that HRU would attack them so early. Though they have prepared themselves for fighting against HRU Army. The General Army Commander of HRU proposed, \" We will never give up and we will definitely destroy the people of the Earth. We will fight against them till we die!!\". The people of the Earth have seriously looked into the matter. Dr. Ter assured the people of their safety. Many robots have been created to cope up with the HRU Army forces but those had no match for HRU army forces. But one question arises in the minds of the people. Though their safety have been assured but who will fight against HRU Army? A man within the crowd wearing a 'Yellow Hat' shouted, \" I, I want to protect the people and this beautiful world and I will fight against the HRU Army forces whatever they are.\" Dr. Ter refused to accept his proposal and he had also withdrawn any kind of support to him including weapons supply, food and other privileges. But the man had never given up. He proceeded towards enemy's territory. The journey begins.....</p><p><strong>FEATURES OF FULL VERSION GAME</strong>:<br/></p><ul><li><strong>Large Levels.</strong></li><li><strong>Large Number of Enemies</strong></li><li><strong>Magical Crystals</strong></li><li><strong>Vanishing player</strong></li><li><strong>Collecting Killer Machines</strong></li><li><strong>Collect Energy cubes.</strong></li><li><strong>Boss Battles(Including Spider Bot).</strong></li></ul><p>Please don't hesitate to contact me if you have any problem. I will reply to you as soon as possible.<br/></p><p>If you have any problem, contact me through my website:</p><p>http://www.amaxang-games.com/p/blog-page.html</p><p><strong>Enjoy!</strong><br/></p>", "metacritic": null, "released": "2015-01-18", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/a46/a466161398b6618263cac376a905dcc6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 113, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["AMAXANG GAMES"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}