{"id": 122182, "slug": "happy-bot-mess", "name": "Happy Bot Mess", "name_original": "Happy Bot Mess", "description": "<p>Created for Ludum Dare 40 Compo with the theme \"The more you have, the worse it is\".<br/>Happy Bot Mess is a turn based tactics game. You control two  \r\nmilitary happy  killing bots that have a serious bug: their attack and \r\nmovement are bound to the number of bullets in their weapon.</p>\n<p>For \r\nexample, if they have 1/4 bullets in the weapon their movement range is \r\nfour tiles and they make four damage. If they have a full clip of 4 \r\nbullets they can only move one tile and make one damage. Every move also\r\n costs a bullet because the Happy Bots are rocket jumping. Choose your \r\nmoves wisely.\r\nBy the way these gameplay rules do not apply to the enemies.</p>\n<p><strong>Gameplay Basics</strong></p>\n<p>Your units have <em>one move</em> and <em>one action</em>\r\n per turn. The action can be used for attacking enemies, healing a \r\nfriend and the unit itself or reloading. Using the action ends the units\r\n turn. Use the buttons on the units UI or the number keys 1-4 to select \r\nan action. Reloading is done instantly on clicking the button. For \r\nattacking and healing you have to select the action. Then all targets in\r\n the skill range are highlighted. If no unit is highlighted, you can not\r\n use the skill. But that is poorly communicated. When both units actions\r\n are used you have to end the turn via enter or the button at the top.</p><p>Created by Sören Hoffstedt. I'm looking forward to hear your feedback.</p>", "metacritic": null, "released": "2017-12-03", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/b28/b281d89aa140f86cdc026a52643e647c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 24, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Yellow Hat Games"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}