{"id": 122134, "slug": "the-mcmurdo-experiment", "name": "The McMurdo Experiment", "name_original": "The McMurdo Experiment", "description": "<p>The McMurdo Experiment is a 1-3 hour turn-based RPG that puts you in the role of Greeter, a mysterious individual who wakes up in a room shrouded in darkness.  Greeter must travel through Forests, Temples, and more, all while fighting horrific abominations and being lead by a curious, shadowy figure. <br/></p>\n<p>What is Greeter’s connection to the McMurdo Experiment?</p>\n<p>You’ll have to play the game to find out!</p>\n<p> </p>\n<p>\r\nThe McMurdo Experiment’s main themes are loosely borrowed from the Psychological and Supernatural writings of Psychiatrist, Carl Jung and inspired by the works of Katsuhiro Otomo, Hideo Kojima, Chris Avellone, and H.P. Lovecraft.</p>\n<p>The McMurdo Experiment is part fully realized video game and part short film, with the length of the experience decided by how the player chooses to approach the situations presented to them. The game may seem straightforward, but many secrets are hidden in each map. When choices are presented to The Greeter, they matter. </p>\n<p>The McMurdo Experiment is the first game ever made by creator, Aaron Margolin. So, if there are any bugs or issues with the game, please reach out and tell him because, well, let's be honest, making a game is super detail oriented and it's hard for just one person to catch every issue. Especially a first-time game maker. </p>\n<p>Additionally, based on response, updates will be made to the game and new content may be added in different versions.  </p>", "metacritic": null, "released": "2018-05-22", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/748/7480f212bb322c5dad287b27d28a0312.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 60, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Armzaaron"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}