{"id": 122139, "slug": "truehackie-premium", "name": "TrueHackie Premium", "name_original": "TrueHackie Premium", "description": "<p>Ever wanted to become a Hollywood hacker - randomly type on the keyboard and somehow magically hacked into someone account?</p><p>Well, now you do! Just open TrueHackie Premium, crack your fingers and ... smash your keyboard and enjoy being a professional hacker! For some laugh, you can read the default hacking dialogs.</p><p>Default? Did you say default? Yeah, I say default. You can create your own dialog and simulate yourself hacking anything and everything. Write a dialog with your friend email address and troll them hard!</p><p>Dialog writing is as easy as one two three. Check out the readme.txt file for more information. Ask any question you have here. If you want to see something new (new command for dialog for example), just shout it out loud here - with a hackie style to increase the chances of it being added to the core game!</p><p>#IRXJam17</p><p>It's the first game jam that I ever participated. TrueHackie Premium is also the first close-to-complete game I made and released to the public.</p><p>The theme for the jam is \"Free Will\". I've always wanted to create a hacker simulator and I made it through this game jam in less than 48 hours. This game allows anyone to create their own screen dialogs and simulate hacking anything so I guess it fit well for the theme \"Free Will\"*.</p><p>* Though I guess that \"Free Will\" means that we can create any type of game.</p><p>-&gt; -playgame \"TrueHackie Premium\" -mode \"haveFun\", \"crazySmashing\" -enjoy true<br/><br/></p>", "metacritic": null, "released": "2017-05-14", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/30b/30b2f7775e8996e4e2173efc1d3be09f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 17, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["inTech"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}