{"id": 12211, "slug": "a-room-beyond", "name": "A Room Beyond", "name_original": "A Room Beyond", "description": "A ROOM BEYOND, is fantasy point and click adventure based on essential subjects of human existence. This novel game draws the drama around the “Fog Wanderer”, a murderous apparition scaring a small village in a Lovecraftian world. Help the villagers to solve the murder mystery and discover your own fate which seems to be oddly woven into the entire drama.<br/> <br/>A philosophical story is built upon inspiration coming from the book The Top Five Regrets of the Dying. Videogames such as Alone in the Dark 1, The Last Door and the famous Lucas Arts games significantly influenced the general tone and coloring of the game, as well as the art of H.P. Lovecraft and E.A. Poe. The game’s innovative mix of pixelart and low-poly rendering has attracted a lot of interest among players and artists.<br/> <br/><br/><br/><br/>Synopsis<br/>When you awake, you find yourself trapped in a gloomy cave. Dim candle light reveals strange symbols and cult objects all over this place. You can’t remember what happened, but this place gives you shivers. There is a tiny ray of light in the distance which might lead to a room beyond this darkness. <br/><br/>Outside the cave you find yourself in a forest which is surrounded by deep gorges and thick layers of fog. A crowd of people lives here in fear of an ominous apparition that creeps through the fog for manhunt. <br/><br/>Help the villagers to solve the mystery of the murderous fog wanderer and uncover the fate that brings you to this place.<br/><br/><br/><br/>Gameplay<br/>Simplified control of the game can be learned fast and allows a quick start. No strong prior experiences with computer games are needed for playing A Room Beyond. All interactions can be accomplished by clicking or dragging the mouse pointer. The game does not define specific timing so that players can take their time to explore the virtual world. Additonal game features are unlocked gradually while progressing storyline.<br/><br/><br/><br/><br/>Technology &amp; Style<br/>2.5D Perspective: The game’s visual perspective is known as 2.5D, which describes a combination of 3D effects in a general 2D stage design. Both types bring their own benefits to the game: Interaction and navigation is easy in a 2D scenery, but visual perception of depth is increased by using 3D objects. <br/><br/>Pixel Style: Manual and procedural processing steps create a mosaic-like pixel effect which results in a graphical abstraction that increases the scope of visual interpretation and stimulates players’ imagination. Combination of both, smooth animations brought by modern technology and the look and feel of retro pixel game design leads to a fresh  contemporary graphic style.<br/><br/><br/><br/>", "metacritic": null, "released": "2016-03-17", "tba": false, "updated": "2019-08-28T22:13:25", "background_image": "https://media.rawg.io/media/screenshots/12d/12de809a8d94cfd76026a8f5a068b74b.jpg", "website": "http://www.aroombeyond.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 7}, "playtime": 2, "achievements_count": 29, "ratings_count": 0, "suggestions_count": 522, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["René Bühling"], "genres": ["Adventure", "Indie"], "publishers": ["René Bühling"], "esrb_rating": null}