{"id": 1222, "slug": "motorsport-manager", "name": "Motorsport Manager", "name_original": "Motorsport Manager", "description": "The ultimate management game for fans of motorsport.<br />\nFeel the thrill of race day.  React in real-time and make split-second decisions to gain the edge on your rivals.<br />\nMaster advanced technology to customise every aspect of your car’s performance.<br />\nCreate a top racing team composed of drivers, managers, mechanics and designers.<br />\nStep into a living, breathing world of motorsport with you at the centre.<br />\nHave you got what it takes to become the manager of a high-performance motorsport team?<br />\nMotorsport Manager is a highly detailed, best-in-class management game for fans of motorsport. You’ll hire the drivers, build the cars and embed yourself in the dynamic world of racing.<br />\nEvery single detail will need to be considered in order to push your way to the championship title. Split second decisions on the race track combine with carefully laid pre-race plans; everything from building and customising your car to race-day tactics will affect your path to either ultimate victory or epic failure.<br />\nStop watching, start winning and take control as the manager of your own motorsport team.<br />\nThe Drivers. Your drivers have unique personality types, sparking drama within the team. Will you get the best out of them with tough love, or an arm around the shoulder?<br />\nLocation, Location, Location. The location of your HQ is all-important in this globe-spanning sport. Some drivers might find it hard to resist joining an Italian team...<br />\nPick the right people. Scouring the world for hidden gems is all the more satisfying when you find a young mechanic who can shave seconds off your pit stop times.<br />\nThe Factory.  Build new cars and parts from scratch, then evolve the technology over multiple seasons to create the perfect driving machine.<br />\nThinking Ahead.  Make the call on every part that goes into next season’s car. Get it right, and you’ll be in the perfect position come pre-season testing.<br />\nHone your expertise.  Make detailed mechanical tweaks or choose your team’s recommendations.<br />\nThe Race Weekend.  Set initial strategy across practice, qualifying and race – and adjust your tactics according to on-track developments.<br />\nMaster the Pitstop.  Risk it all with a high speed pit stop that could put you out in front of your rivals.<br />\nWeather Systems.  Dynamic and game-changing weather.  Will you pit for intermediate tyres or hold out on slicks for as long as possible?</p>", "metacritic": 81, "released": "2014-08-21", "tba": false, "updated": "2023-11-18T09:40:42", "background_image": "https://media.rawg.io/media/games/733/733ad3aa67a63f7441c687c041953dd0.jpeg", "website": "", "rating": 3.82, "rating_top": 4, "added_by_status": {"yet": 23, "owned": 669, "beaten": 26, "toplay": 6, "dropped": 28, "playing": 13}, "playtime": 7, "achievements_count": 73, "ratings_count": 92, "suggestions_count": 445, "game_series_count": 0, "reviews_count": 92, "platforms": ["iOS", "PC", "Android"], "developers": ["Playsport Games", "Christian West"], "genres": ["Strategy", "Simulation", "Sports", "Racing"], "publishers": ["SEGA", "Christian West"], "esrb_rating": "Everyone 10+"}