{"id": 12222, "slug": "just-beneath-the-skin-2d", "name": "Just Beneath The Skin 2D", "name_original": "Just Beneath The Skin 2D", "description": "Just Beneath The Skin is a story driven action/puzzle RPG revolving around Shyla, whom unknowingly and unwillingly is forced into battling for her life and for the lives of many others.Synopsis<br/>Shyla lives with her father and brother in the woods, her mother disappeared when she was ten years old and never returned. Seven years later a stranger comes to her father from the woods, soon Shyla will begin a journey that will take her into a world she never could have imagined, a world far beyond her comprehension and far beyond limiting conceptions. <br/><br/>For Shyla, there is a long road ahead, for those who have been watching her since birth, there is a long wait ahead and for the God that is living inside of her body, well for him, his long wait is over.<br/><br/>He will use Shyla to be re-birthed into existence and once again try to rule the universe. The question is…. <br/><br/>Will Shyla be able to stand up to the tests that are coming her way? <br/><br/>Will she fulfill her destiny? <br/><br/>Or will she be consumed by the darkness...?<br/><br/>In due time all the answers will fall into place...Features:<br/><ul><li>Story Driven Gameplay Style<br/></li><li>Complicated puzzles<br/></li><li>SBS (Sideview Battle System) and ATB (Active Time Battle System)<br/></li><li>Stage Select<br/></li><li>Animated Characters (Dialogue)<br/></li><li>8 Directional Movement<br/></li><li>Manual Stat boosting capability<br/></li><li>Spirit Alignment System<br/></li><li>Journal<br/></li><li>Side-Quests<br/></li><li>Quick save (for saving on the go when it’s dire)<br/></li><li>3 different storylines to discover, 3 different lives to live<br/></li><li>30+ stages to explore and conquer (for starters)<br/></li><li>Console window responds to game such as: Full console window shakes/moves<br/></li><li>Fishing Feature<br/></li><li>Mining Feature</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T22:13:25", "background_image": "https://media.rawg.io/media/screenshots/17a/17a90f4aef48c1cb942c2534710b714b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 203, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Dizzy Media"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["Dizzy Media"], "esrb_rating": null}