{"id": 12232, "slug": "barony", "name": "Barony", "name_original": "Barony", "description": "Barony is a 3D, first-person roguelike <strong>with cooperative multiplayer</strong> that brings back the cryptic and intricate designs of classic roguelikes such as Nethack and melds them with RPGs like Ultima Underworld, System Shock, and Daggerfall. Challenge is the calling card of this hard-boiled dungeon-crawler.Features<br/><ul><li>Gameplay inspired by RPG classics like Ultima Underworld, System Shock, &amp; Daggerfall <br/></li><li>Roguelike mechanics such as perma-death, random dungeons, cryptic messages, and more <br/></li><li>Meticulously narrated action that mimics the insane events one could expect to find in games like Nethack <br/></li><li>A complex yet intuitive drag &amp; drop interface to manage items and character stats <br/></li><li>Cooperative multiplayer for up to 4 players over internet or LAN (includes Steam and direct-IP connections)<br/></li><li>Hundreds of unique collectible items and loot, including several rare and mystical artifacts <br/></li><li>Chock-full of secret areas, special levels, developer easter eggs, and more <br/></li><li>Bundled level editor, exposed assets, and simple file formats for easy hacking, modding &amp; tinkering</li></ul>The Story So Far<br/>Barony tells the story of an undead lich named Baron Herx, who terrorized the town of Hamlet in a previous life and is now holding out in a vast subterranean complex known as the Devil's Bastion. As a single hero or a group of adventurers, it is your mission to descend the depths of his abode, confront him in his hellish lair, and destroy him forever. Whether you will simply meet your doom in the dungeons as many have before you or rise to victory against the Baron and his hellspawn is ultimately up to you.", "metacritic": null, "released": "2015-06-23", "tba": false, "updated": "2023-12-19T12:22:14", "background_image": "https://media.rawg.io/media/screenshots/cfb/cfb0716214f400cecb6dc988e1795ad9.jpg", "website": "http://www.baronygame.com/", "rating": 2.95, "rating_top": 4, "added_by_status": {"yet": 77, "owned": 402, "beaten": 6, "toplay": 9, "dropped": 30, "playing": 4}, "playtime": 3, "achievements_count": 203, "ratings_count": 37, "suggestions_count": 296, "game_series_count": 0, "reviews_count": 37, "platforms": ["PC", "macOS", "Linux"], "developers": ["Turning Wheel"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["Turning Wheel"], "esrb_rating": null}