{"id": 122304, "slug": "tiny-alien-invader", "name": "Tiny Alien Invader", "name_original": "Tiny Alien Invader", "description": "<p>\r\n\t Tiny Alien Invader was made in 12 hours for the Low Rez Jam, and was originally released in May 2014. It's a platformer where you get to play as the bad guy. You control a tiny one-alien army intent on wiping out the human fleet. You spend your time finding and boarding human spaceships, and then destroying them from the inside.\r\n\t<br/>\n</p><p>\n<strong>WHY WE MADE IT</strong><br/>\r\n\t The Low Rez jam was a challenge to make a game with a native resolution of 32x32, which is ridiculously small by modern standard (about 2.5 times the size of your mouse cursor!). It seemed like a fun challenge, especially to get any character out of the tiny animations.\r\n\t<br/>\n</p><p>\n<strong>CONTROLS &amp; HELP</strong><br/>\r\n\t Press X to start the game. Use the arrows to move your ship and then press X to attack a bigger ship when you find one. When you're aboard a ship, use arrows to move and X to shoot. Hold Z and then press a direction arrow to teleport.\r\n</p><p>\r\n\tWhen you first start out, there is a small red dot pointing in the direction of the nearest ship. Fly close to a ship and press X to board it. Once on board try to stay out of sight and then teleport behind an astronaut when they are facing the other way, then X to zap them.\r\n</p>\n<strong>EDGE</strong>\r\n\t\r\n\t\r\n\t\r\n\r\n\r\n\t\r\n\t\r\n\t\r\n\t\tGameplay, Graphics,\r\n\t\t<br/>\r\n\t\tSound &amp; Music", "metacritic": null, "released": "2016-11-08", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/e63/e630249dea80a195e4b08a58862d1bc2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 17, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Second Dimension Games"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}