{"id": 122465, "slug": "raft-itch", "name": "Raft (itch)", "name_original": "Raft (itch)", "description": "<p>\n<strong>DESCRIPTION</strong>\n</p>\n<p>All New Raft is now out on Steam!</p>\n<p>By yourself or with friends, your mission is to survive an epic oceanic adventure across a perilous sea! Gather debris to survive, expand your raft and be wary of the dangers of the ocean!</p><p>\n</p><p>Trapped on a small raft with nothing but a hook made of old plastic, players awake on a vast, blue ocean totally alone and with no land in sight! With a dry throat and an empty stomach, survival will not be easy!</p>\n<p>Raft throws you and your friends into an epic adventure out on the big open sea, with the</p>\n<p>objective to stay alive, gather resources and build yourself a floating home worthy of survival.</p>\n<p>Resources are tough to come by at sea: Players will have to make sure to catch whatever debris floats by using their trusty hook and when possible, scavenge the reefs beneath the waves and the islands above. However, thirst and hunger is not the only danger in the ocean… watch out for the man-eating shark determined to end your voyage!</p>\n<p>Features:</p>\n<p>● Multiplayer! Survive by yourself or with friends in online co-op!</p>\n<p>● Hook! Use your hook to catch debris floating by.</p>\n<p>● Craft! Build survival equipment, weapons, crop plots and more to help you stay alive!</p>\n<p>● Build! Expand your raft from a simple wreckage to a buoyant mansion.</p>\n<p>● Research! Learn new things to craft in the research table.</p>\n<p>● Navigate! Sail your raft towards new places!</p>\n<p>● Dive! Drop anchor and explore the depths for more resources.</p>\n<p>● Fight! Defend your raft from the dangers of the ocean.</p>\n<p>You can also follow us on several other platforms.</p>\n<ul>\n<li><strong>Facebook<br/>\n</strong></li>\n<li><strong>Twitter</strong></li>\n<li><strong>Instagram</strong></li>\n<li><strong>Join our newsletter</strong></li>\n<li><strong>Blog</strong></li></ul>\n<p>\n<strong>Developers</strong>\n</p>\n<p>\n<strong>Semih Parlayan</strong> - Programmer<br/>\n<strong>Ellen Mellåker</strong> - Artist<br/>\n<strong>André Bengtsson</strong> - Artist\r\n</p>", "metacritic": null, "released": "2016-12-16", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/068/0684238eb5f8facbc085fd7d3af5946b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 188, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "macOS", "Linux"], "developers": ["Redbeet Interactive"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}