{"id": 122414, "slug": "lanes-of-triumph", "name": "Lanes of Triumph", "name_original": "Lanes of Triumph", "description": "<p>Lanes of Triumph</p><p>This is a single player top-down RTS game in which the player must build units to defend against and attack the enemy base.</p><p>Controls:</p><p>The game is controlled almost entirely with the mouse.</p><p>left click.......select a building or hero</p><p>scroll wheel..zoom the camera</p><p>mmb............hold to pan the camera with the mouse</p><p>GamePlay:</p><p>To win the game, you must send enough units to overwhelm your opponent and destroy their base. </p><p>In order to build units, click on the 'build menu' button in the lower right, and select which lane you want to build for, then a unit type.</p><p>Units will automatically advance to the enemy base, destroying any enemies in their way.</p><p>Units:</p><p>There are 3 types of units in the game:</p><p>Laser unit - A short ranged cheap unit with slightly higher health. These units will always be at the front of a battle, and are great for soaking up damage</p><p>Rocket Unit - These units fire medium range homing missiles at their targets. Though weaker, these units do the highest single target damage of all.</p><p>Sheller Unit - These units rain explosive shells down on the opposition from high in the air. Though each shell doesn't do a great deal of damage, they do inflict splash damage to surrounding units. These units have the longest range by far,</p>", "metacritic": null, "released": "2015-05-12", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/151/151e597c59961732ce6791f5b2b40d72.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 26, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["FinnMarGames"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}