{"id": 122449, "slug": "shipwreck-itch", "name": "Shipwreck (itch)", "name_original": "Shipwreck (itch)", "description": "<p>Your ship had to make an emergency landing and you are now shipwrecked! The goal of the game is to repair your ship but also survive on your new planet. You must collect resources to progress further. The game doesn't end when you finally repair your ship but has another goal. How will you play shipwreck?</p>\n\n<p>Shipwreck has drop in / drop out style multiplayer. Doesn't require a registration, no personal information is collected, and compliances with GDPR. Create a new game, supply the name you want to be in the game and done. When creating a new game, you could choose your old name OR could create a new name.</p>\n\r\nThe current state of the game?\r\n<p>The current state of the game has the main core features of building, crafting, and destroying tiles. </p>\n<p>Shipwreck has procedural map generation. Each map will generate different from player to player. The map will slowly grow over time and the longer you play, the more you can build. The game will try to keep a large amount of tiles so you can always build.</p>\n<p>In order to harvest resources, or gain research will need workers in those buildings.  Supplying more villagers in a building will increase the amount you could gain from that building.</p>\n<p>The game will be different every time you play! One game may have lots of combat as another game may have lots of floods and fires. The ai event director will try to balance the events over a long period of gameplay.</p>\n<p>The game has over 20+ types of things to research. Those types of research could be new housing, factories, or new resources.</p>\n<p>The game has multiplayer features too! Can interact with other players and can create, cancel, or purchase from the in-game auction system. This gives the ability to purchase or sell items of your choosing. The game has an open style currency system. You could sell auctions based on coins but you can also sell auctions based on another resource.</p>\n\r\nPlans for this year?\r\n<p>The game will have many styles of combat. Instead of sending large amount of combat ships, could send raid or slave ships. A raid ship will go after resources and a slave ship will go after colonists.</p>\n<p>The game will have ping ships to find other planets or life forms. When a solar system is pinged, will have the ability to send research ships to find other players and gain planet research. Planet research can sold in the auction or be used to migrate to that planet.</p>\n<p>Trade routes will have another aspect of trade. Trade routes will give the ability to accept trade licenses. Those licenses require a resource as the licensee will give a resource in return. Not all trade licenses will be player controlled but they could be faction controlled.</p>\n<p>Planet research is required to live on other planets. It is not the best idea to land on an unknown planet with a different atmosphere. Research points can be sold auction or can be used for building types of that planet. Will contain over five planet types that will be randomly chosen when generating a new map.</p>\n<p>More multiplayer interactions and multiplayer features. The shipwreck universe can be controlled by other factions and those ares will have large amounts of resources or research that cannot be found elsewhere. Not only areas of space can be controlled but planets can be controlled too!</p>\n<p>Shipwreck will have two different types of contacts; player contacts and faction contacts. The player contacts can set up new trade routes to that player. Faction have the same abilities as player contacts but done differently. You don't directly contact the leaders of that faction instead you are pointed to a representative of that faction.</p>\n<p>Factions are similar to a guild but with more. Any player can create a faction but only a few will survive in shipwreck because of faction disputes, faction vs faction, or spy/sabotage. When creating a faction, you are able to create your own faction logo. That logo is a 32x32 drawable pixel grid of your own faction logo. The faction will have the ability to create faction ranks of leadership and leadership control within those ranks. Not all factions are based on one group but factions can align their faction to other faction.</p>\r\nFeedback!\r\n<p>All feedback is very important. Currently gained lots of feedback to improve the game. I am welcome to all feedback so everyone can enjoy the game.</p>", "metacritic": null, "released": "2018-03-07", "tba": false, "updated": "2019-08-28T23:23:39", "background_image": "https://media.rawg.io/media/screenshots/bdb/bdb5083135910e609bc5d5b23c36ecd5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 90, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Shmellyorc"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}