{"id": 12246, "slug": "one-way-heroics", "name": "One Way Heroics", "name_original": "One Way Heroics", "description": "In One Way Heroics, you take on the role of an intrepid adventurer who must travel across the land and face the Demon Lord before a mysterious shadow engulfs everything.<br/><br/>Darkness always approaches from the left, and with each movement or action you take, the void creeps ever closer. Forced to run right, you'll encounter any number of monsters, allies, thieves and shops on your desperate journey to stop the end of everything.<br/><br/>The good news is that you don't just have access to one world. You have access to all of them. <br/><br/><br/><br/><ul><li>A nearly infinite number of worlds to save and explore!<br/></li><li>Multiple classes to unlock, each with different skills and advantages.<br/></li><li>Dimensional Vault: Don't waste extra valuables! Lock away your inventory and save it for your next run!<br/></li><li>Time control: when the going gets tough, the tough freeze time and work out a new strategy.<br/></li><li>Steam goodies: trading cards, emoticons and wallpapers that proudly broadcast your OWH finesse!</li></ul><br/>Every world is different and unique. Lust forests or corrupted hellscapes, adorable animals or cunning thieves, each departure is a roll of the die. You might find likeminded heroes willing to journey with you, or you might meet no one and be forced to venture into the unknown alone.<br/><br/>Like a dimension you previously visited? Simply input the name at the Dimensional selection screen before you begin your journey. Want to try your luck with a random reality? Type any word that pops into your head, and watch as One Way Heroics builds you a world based on the name you chose.<br/><br/>Infinite permutations. Infinite worlds. Infinite adventure.<br/><br/>*This game supports Cloud Saves for most system data including clear data and unlockables, however mid-game saves do not carry over.", "metacritic": null, "released": "2014-02-28", "tba": false, "updated": "2023-11-13T17:55:39", "background_image": "https://media.rawg.io/media/screenshots/93f/93fd408badb90ecfb28094c9ea966455.jpg", "website": "", "rating": 3.09, "rating_top": 4, "added_by_status": {"yet": 49, "owned": 995, "beaten": 10, "toplay": 2, "dropped": 26}, "playtime": 2, "achievements_count": 59, "ratings_count": 45, "suggestions_count": 308, "game_series_count": 0, "reviews_count": 45, "platforms": ["PC"], "developers": ["Smoking WOLF"], "genres": ["RPG", "Indie"], "publishers": ["AGM PLAYISM"], "esrb_rating": null}