{"id": 122578, "slug": "the-deep-itch", "name": "The Deep (itch)", "name_original": "The Deep (itch)", "description": "<p><strong>THE DEEP</strong></p>\n<p><strong>SECTION A: SYNOPSIS</strong><br/></p>\n<ul><li>This is my first game ever, and I have put my all into it for IGMC 2017. This is a learning experience for me and I can not wait to finish this game! The game is based on traditional old-school tabletop D&amp;D. The world is covered mostly by water with one large continent and several smaller, the game takes place on the largest continent and it's outer islands. This world is connected by a vast series of underground tunnels where humans used to live as slaves to monsters. Forbidden from using magic or weapons of any kind humans learned to develop their bodies and minds to fight back against their slavers and break free to the surface world. Upon settling on the surface humans discovered quickly that the surface world was dominated by xenophobic elves that had absolutely no tolerance for any other races and attempted to wipe out humanity. Humanity managed to survive and settled mostly on the outer islands. 200 years later humans and elves are still no closer to peace but humans have developed much in magic and technology,  martial arts were only passed down from single masters to their students and were all but lost to the times. The game play is the focus, with each character representing an archetype and their class fulfilling a primary role. As an experienced dungeon master I want to make a game that creates a typical fantasy RPG experience with fun mechanics. As this is my first game ever, I need as much feedback as I can possibly get so I can become better at this!</li></ul>\n\n<p><strong>SECTION B: CHARACTERS</strong><br/></p>\n<ul><li>There are 6 characters and each has a unique class. They are: Monk, Shadow Knight, Battlemage, Weapon Master, Hunter, and Rogue. There are no cloth wearers. </li><li><strong>Allan</strong> - Monk </li><li>A Student of one of the last remaining monks in the world, sent by his master on a pilgrimage. Allan uses healing magic and Ki attacks. </li><li><strong>Ashley</strong> - Battlemage </li><li>A seemly friendly and charismatic young woman with little known about her past other than a missing brother. Ashley uses healing and offensive magic as well as heavy armor and weapons.</li><li><strong>Marcus</strong> - Weapon Master </li><li>A narcoleptic old man with unbelievable combat prowess. Able to equip any weapon, and with skills that are based on the weapons currently equipped. </li><li><strong>Meiji</strong> - Shadow Knight</li><li> A Dark Elf scout loyal to his empire. Dark Elves are among the good races of this world. Meiji can take the most damage, using life draining skills and heavy armor. </li><li><strong>Rachael</strong> - Hunter </li><li>Hated by humans and elves alike, Rachael is a Half-Elf, so uncommon that she has never and may never meet another like herself. Rachael uses ranged weapons with elemental attacks. </li><li><strong>Rand</strong> - Rogue</li><li>A legitimate businessman. Rand uses skills such as steal, backstab, and status inflicting attacks.</li></ul>\n\n<p><strong>SECTION C: SETTING AND/OR WORLD DEVELOPMENT</strong><br/><br/></p>\n<ul><li>The world is rather big although the players will only be on the primary continent and it's immediate surrounding islands. The political atmosphere surrounding the ongoing war with the elves creates a racial tension between the protagonists. Elves in this world are pompous to the extent that they do not believe mortal races even deserve the right to live. While Dark Elves have sworn to fight against the monster hordes that spawn within the Deep. The title \"The Deep RPG\" refers to the cavernous system of tunnels that cover the entire planet, much like forgotten realm's underdark.</li></ul>", "metacritic": null, "released": "2017-11-02", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/9b1/9b1b033bdd8a450de2f4b0a2e1de07d7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 203, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Allan Bays"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}