{"id": 122521, "slug": "beacon-itch-ladty", "name": "Beacon (itch) (LadTy)", "name_original": "Beacon (itch) (LadTy)", "description": "<p>Made for the GMTK Game Jam</p>\n<p><strong>Description<br/></strong>An Infinite Runner type of game, made with focus on mood and pleasurable time passing (after one gets used to the controls etc). The game has no explicit goal, any scoring system was discarded, you just play as you please.</p>\n<p>The 'track' is formed in a Möbius strip shape, which doubles the perceived length of it. You are running in this infinite loop while the obstacles change before you. The 'running along the same track' in form of the Möbius strip was chosen so you can interact with yourself, which is used in form of leaving 'powerups' behind you as a secondary effect of your jump after you reach a certain speed of phase in the game.</p>\n<p><strong>How my submission matches the theme<br/></strong>[space/enter] = jump (with small speed boost) + doublejump<br/>Fastest phase (glowing 'goblet') = by jumping, you leave yourself powerups on the Mobius strip for your next lap<br/>Powerup = boost + remove obstacles nearby<br/>Highlighted stairs = your 'progress'/'speed', you gradually speed up until you reach the top, you slow down when you hit an obstacle<br/>Obstacles = block path (if you run into them) or boost you (if you jump on top of them)<br/>Goal = relaxation... No score, no ending, no external rewards. Sorry to those who seek that in a game ;)</p><p>I tried to give more functionality to the one input in the game, not only by incorporating classic speed boost + doublejump, but also connecting it with the weirdness of Mobius strip in the later phase, were you also drop powerups for yourself (your next lap) by jumping. You can also use the objects that block your path to your adventage, by using them as trampoline. Plus some additional information is encomposed in the 'environment' by highlights, as well as height encoded in the colors (so you know when going down or uphill which varies the speed) - so that every part of the presentation has some use to it.</p>\n<p>As an ultimate multipurpose-designed game, this game can also function as a great screensaver! [Added ScreenSaver build after the Game Jam ended as a bonus]</p>\n<p><strong>The game's executable package or binary<br/></strong>Windows executable - simply extract the downloaded .zip and run the extracted .exe</p>\n<p><strong>Intended platform<br/></strong>PC Windows</p>\n<p><strong>Resources used<br/></strong>Unity 3D<br/>  - ProBuilder - editor plugin for modelling directly inside Unity<br/>  - ShaderForge - editor plugin, a node based shader editor for quick shader prototyping<br/>  - MasterAudio - for including sound and music to the game<br/>  - FXPro - postprocess effects which I had to use, since built-in Unity postprocesses had visual glitches in the resulting image :( Used mainly for bloom+vignette effects/color tweaks<br/>  - SFX (due to not enough remaining time) were picked from the pack \"Gamemaster Audio - Pro Sound Collection\" (not the ingame music though)</p>\n<p><strong>Contributors<br/></strong>Apart from the aforementioned used resources, everything in the game (shaders, models, code, music) was made for this jam by myself.</p>\n<p><strong>Notes<br/></strong>The algorithm for generating obstacles could use an iteration or two more, as well as the tightness of controls probably or general readibility, plus more interactions with the track itself.<br/>But the game was made for GMTK Jam, which means 48h time limit, so I hope it will suit at least some of you and won't prevent you from entering the flow state to enjoy the display.</p>", "metacritic": null, "released": "2017-07-16", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/e91/e912d9c8b85c369fb4d79ae680fb3b75.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 49, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["LadTy"], "genres": [], "publishers": [], "esrb_rating": null}