{"id": 122533, "slug": "navigator-itch", "name": "Navigator (itch)", "name_original": "Navigator (itch)", "description": "<p><em><strong>Welcome back to the next generation in block puzzle games!</strong> </em></p>\n<p><em>The hit from 2012 that you've never heard of is finally back, now at its new home on itch.io!</em></p>\n<p><strong>[THE DEVELOPMENT OF <em>NAVIGATOR</em>]</strong></p>\n<p><em><strong>Navigator</strong></em> is a fast-paced puzzle game that combines precision platforming and strategic block placement, layered with a fresh, energetic soundtrack and a unique flavor.</p>\n<p>Test your ability by controlling both your Block Cannon to lay colored blocks into the field, matching colors and causing colorful combo chains, while controlling Nav, your Navigator, through the field, jumping over gaps, pushing blocks into holes, and avoiding the very top of the field-- if Nav gets smashed between the blocks and the ceiling, it's game over.</p>\n<p><em>Navigator</em> is a unique game that is easy to learn and looks simple on the surface, but also has its own small learning curve that takes a few plays to really master!</p>\n<p><strong>o</strong> please note: <em>Navigator</em> is made in XNA. as such, you will need a Windows PC, and the .net Framework 4.x and XNA Framework 4.x installed in order to run the game. </p>\n<p><strong>o</strong> also, this game is very old (from a director's experience standpoint) and has very minimal in the ways of option settings, nor is there gamepad support.</p>\n<p><em>Navigator</em> is the first game of developer tj thomas of alpha six productions. this re-release is to honor the small, simple game that eventually allowed the creation of <em>The Joylancer: Legendary Motor Knight</em><em>, </em>as well as other experimental works such as <em>solaris</em><em>.</em></p>\n<p><strong>NOTE: This game is no longer supported.</strong></p>\n<p>Looking to get more BANG for your BUCK? check out some of these special bundles!</p>\n<p><strong>NAVIGATOR - THE NOVA BUNDLE</strong> is a $10 bundle; this will get you Navigator, the 2-disc soundtrack (official OST + remix album), and a pre-purchase for <em>Navigator ReVision</em>!</p>\n<p><strong>NAVIGATOR - THE ENERGY BUNDLE </strong>is $20 and will get you The Nova Bundle and a couple exclusive alphas that are only available here! see some of the projects that led to and sprouted from the creation of <em>Navigator!</em></p>\n<ul>\n<li><em>Reach For the Top </em>alpha (w/ @SuperBlizzard)\r\n<ul>\n<li>a parkour-inspired action-platformer</li></ul></li><li><em>Flightless </em>beta (DIGITAL HAVEN ENT.)\r\n<ul>\n<li>a colorful platformer about a girl raised by birds</li></ul></li><li><em>Gearbeasts: Endless Blitz</em> alpha (a6productions)<br/>\n<ul>\n<li>a side-view action shooter with giant robots and explosions</li></ul></li><li>SUBSISTENCE Arcade alpha (a6productions)\r\n<ul>\n<li>a survival-themed action game with endless enemies</li></ul></li></ul>\n<p><strong>THE SIX COLLECTION</strong>, originally only on the page for The Joylancer, is also available here! purchasing the six collection will get you the following games for $30 (and you can download the other 2 bundles on top):</p>\n<ul>\n<li><em>PULSECHASER</em>\n<ul>\n<li>a colorful top-down shooter (sequel coming soon)</li></ul></li><li><em>solaris</em>\n<ul>\n<li>an experiment in interaction, ambience and light</li></ul></li><li><em>VIRALWIPEOUT: VR Defender</em>\n<ul>\n<li>an arcade-style shooter where you clean computers</li></ul></li><li><em>The Joylancer: Legendary Motor Knight </em>(latest stable vrsn)\r\n<ul>\n<li>The Greatest Thing Ever Made, Ever, Seriously</li></ul></li><li>[audio] TRON MAXIMUM - Overdriven Disaster Journey\r\n<ul>\n<li>noise metal, electronica, grindcore and footwork walk into a bar,</li></ul></li></ul>", "metacritic": null, "released": "2014-04-29", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/578/57825e1d99c718da3191da2feabfdbe7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 160, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["alpha six productions"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}