{"id": 122530, "slug": "pilgrim-itch", "name": "Pilgrim (itch)", "name_original": "Pilgrim (itch)", "description": "<p><strong>Pilgrim</strong> -</p>\n<p>Created for Adventure Jam 2018 #AdvJam2018 <strong>over the course of 2 weeks</strong></p>\n<p><strong>(IMPORTANT NOTE: Xbox 360 controllers are supported, but apparently the Xbox One Controller has different mappings than it does.. I have yet to fix this, but I am pretty sure you can edit/configure the buttons yourself with the games launcher. Don't forget this game was made in two weeks by a team of three! One of which the one who did the \"programming\" is NOT a programmer in the slightest.. =)..</strong></p>\n<p><strong>Genre: </strong>Adventure game.. like Myst..<br/><strong><br/>Controls:</strong><br/></p>\n<p>W,A,S,D - Movement,<br/>\"E\" to interact/pickstuff up/select/ or use Mouse<br/>TAB for inventory.</p>\n<p><em>Pilgrim is partially inspired/influenced by the artist Moebius &amp; his graphic novels. It has esoteric and spiritual undertones relating to the origins of creation, sacred geometry and ancient beliefs. The game is meant to have a sense of mystery to it and whether you know anything about sacred geometry, platonic solids, the flower of life, or metatrons cube.. I hope you will still appreciate it for what it is.</em> The art style is meant to look like a drawing or one of moebius's artworks, but also has it's own thing going for it too. </p>\n<p><strong>Background:</strong><br/>In an unspecified time far into the future humankind's origins have become obscured and mystified. We have spread out into the galaxy and we now inhabit various planets &amp; space stations through out the universe. Technology has become completely integrated with every aspect of our lives and now seems more natural to us than the cells in our own bodies. Something that is created naturally/organically without enhancement, alteration or without the use of technology or science is now considered strange and unnatural to us... as all sustenance is either now genetically altered or created artificially in factories and labs.. We have lost touch with ourselves, our origins, with nature, and human spirituality is now a thing of the past. The Earth is now thought of as a mythical place and natural life is a thing not only completely foreign to us, but something that seems unnatural due to our lives being so technologically and scientifically based.</p>\n<p><strong>Premise:</strong><br/>You awake from your long induced cryo-sleep. Your ship has been severely damaged by a strange energy source that has originated from a nearby planet. Your ship is on a collision course with this strange planet and your only hope is to get to an escape pod to hopefully land safely on the planet's surface below.</p>\n<p>Lost and alone on the planet's surface you begin to discover something ancient.., something spiritual, and something esoteric.. something that all ancient human cultures shared in their beliefs about the origin of life and the creation of the universe.</p>\n<p>If you'd like to learn more about the game's premise &amp; sacred geometry please watch this video: https://www.youtube.com/watch?v=RHuvW7YaGjQ&amp;t=2s</p>\n<p><strong>CREDITS:</strong><br/><strong>Brian T. Callahan III - @futuristteletex -</strong><br/>story, design, \"programming\", 3d models, 2d &amp; 3d animation</p>\n<p><strong>Alex Bertram Powell - @AlexBPArt -</strong><br/>3d Models, Music, Sfx, and 2d Art</p>\n<p><strong>Pat M. Fish - @xXNekoYujiXx -</strong><br/>3d Models, Textures, 3d Animation</p>\n<p>Thanks to:<br/>Credit correction: <strong>Cocis Vadim Tudor</strong> - Flower of Life/Platonic Solid Animations<br/><strong>IEOIE.nl</strong> - Final Platonic Solid Animation</p>", "metacritic": null, "released": "2018-06-07", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/00f/00fcbd45d04d2c2bb40d37f9a7ce451b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 110, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ghostlygurustudios"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}