{"id": 122542, "slug": "grow-itch-sokuaisushi", "name": "grOw (itch) (Sokuaisushi)", "name_original": "grOw (itch) (Sokuaisushi)", "description": "<p>grOw is a puzzle game where you are constantly running out of space. As you move your orb will gather energy and grow until it can contain no more and it bursts.<br/></p>\n<p>Avoid red lasers and orbs at all cost! They grow you until you burst!<br/></p>\n<p>Use arrow keys, WASD, or the left thumbstick on a 360 controller to move. Change Player Orbs (if more than one alive) by pressing space/shift or the left and right bumpers of the controller.<br/></p>\n<p>I planned on making more levels, but ran out of time for the compo. (I will be adding more levels after Ludum Dare, and polishing everything up, adding sounds, etc.)</p>\n<p>There is no sound, as I'm not good at making music or sounds (plus I ran out of time).<br/></p>\n<p>Note: The extended version was done after the Ludum Dare 42 submission time, and as such should not be the version you rate the game on.</p><p>Change Log:</p>\n<p>Version 1.1 (Extended Version):<br/> - Rebalanced several levels and completely changed the fifth level</p>\n<p> - Added 5 more levels</p>\n<p> - Added sounds to menu and player death</p>\n<p> - Fixed the settings menu to actually work now</p>\n<p> - Removed second Play button</p>\n<p> - Fixed the Pause Menu render order</p>\n<p> - Fixed deltaTime issue with the laser rotation</p>\n<p> - Lots of small bug fixes<br/></p>\n<p>Version 1.0<br/> - Fixed web build (hide non-functional Quit buttons in web build)<br/></p>", "metacritic": null, "released": "2018-08-12", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/3df/3df238f693d87cb34daf72b924c3edd8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 13, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["Sokuaisushi"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}