{"id": 122599, "slug": "outside-itch", "name": "Outside (itch)", "name_original": "Outside (itch)", "description": "<p><strong>/!\\ THIS GAME IS A STUDENT PROJECT /!\\</strong></p>\n<p><strong>/!\\ CE JEU EST UN PROJET D'ÉTUDIANT</strong><strong>S</strong> /!\\</p>\n\n<p><strong><em> ENGLISH:</em></strong></p>\n<p>Hello there ! </p>\n<p>We're french students at Objectif 3D, a game creation school based in Montpellier.</p>\n<p>We're about to finish this year and our teachers asked us to create a game in 3 months with those constraints :</p>\n\n<p>- It must take place in an underground <strong>military base</strong></p>\n<p>- It must talk about an <strong>artefact</strong></p>\n\n<p>So we decided to create a sidescroller game named <strong>Outside </strong>where we take the control of a child who suffered from experiences which gave him some surnatural powers :</p>\n\n<p>- He can move some objects with the strength of his mind (<strong>Telekinesis</strong>)</p>\n<p>- He can focus to charge a jump and propel himself (<strong>Charged Jump</strong>)</p>\n<p>- He can teleport himself forward a few meters away (<strong>Teleportation</strong>)</p>\n\n<p>It was made with <strong>Unreal Engine 4</strong> and was our first experience with this engine. We learn a lot from it and we now know what we did wrong.</p>\n<p>We realize our game isn't perfect at all and after 3 months working on it we only see his problems (bugs, errors in programmation logic, ...)</p>\n<p>It's more like a demo than a real game.</p>\n<p>And yes, it was inspired by Inside... :)</p>\n\n<p>Anyway, we hope you'll have a good time. Have fun ! ;)</p>\n\n<p>_______________________________________________</p>\n\n<p><strong><em>FRANÇAIS:</em></strong></p>\n<p>Bonjour  à tous ! </p>\n<p>Nous sommes des étudiants français d'Objectif 3D,  une école de création de jeux-vidéo située à Montpellier.</p>\n<p>Nous sommes sur le point de terminer cette année riche en apprentissage mais avant cela nos professeurs respectifs nous ont demandé de créer un jeu en 3 mois avec les contraintes suivantes :</p>\n<p>- L'histoire doit se dérouler dans une <strong>base militaire</strong></p>\n<p>- Celle-ci doit avoir un lien avec un <strong>artefact</strong></p>\n<p>Nous avons donc décidé de créer un sidescroller nommé <strong>Outside </strong>dans lequel nous prenons le contrôle d'un enfant ayant subis des expériences scientifiques. Cependant ces-dernière lui ont donné quelques pouvoirs surnaturels :</p>\n<p>- Il peut déplacer certains objets par la seule force de sa pensée (<strong>Télékinésie</strong>)</p>\n<p>- Il peut charger un saut lui permettant de se propulser dans les airs (<strong>Saut Chargé</strong>)</p>\n<p>- Il peut se téléporter à quelques mètres devant lui (<strong>Téléportation</strong>)</p>\n\n<p>Pour créer ce jeu nous avons utilisé le moteur <strong>Unreal Engine 4 </strong>que nous n'avions jamais utilisé auparavant. Nous avons beaucoup appris et nous rendons maintenant compte des erreurs à ne pas reproduire dans nos futures productions.</p>\n\n<p>Nous réalisons que notre jeu est loin d'être parfait et après 3 mois de travail acharné nous ne voyons que ses problèmes (bugs, erreurs de logique de programmation, ...)</p>\n\n<p><strong>Outside </strong>est plus une démo qu'un jeu complet.</p>\n\n<p>Et oui, nous nous sommes grandement inspiré d'Inside :)</p>\n\n<p>Nous espérons que vous passerez un bon moment. À la prochaine ! ;)</p>", "metacritic": null, "released": "2017-06-07", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/38f/38fd18cf551ab84eba568978fc7f20de.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 86, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Outside-dev"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}