{"id": 12253, "slug": "along-the-edge", "name": "Along the Edge", "name_original": "Along the Edge", "description": "Along the Edge is a visual novel set in the European countryside, where your choices impact the main character's personality and appearance.Story<br/>Daphné is at a dead-end. She's unsatisfied by her personal and professional life. So, when she inherits an old family house in a remote part of the country, she jumps at the opportunity to start anew.<br/><br/>Does she decide to embrace her legacy or does she hang on to her old way of life?Features<br/><ul><li>An adult and slightly occult universe painted with the vibrant colors of the European countryside.<br/><br/></li><li>Each of your choices impact the main character personality, mood and appearance.<br/><br/></li><li>A huge amount of content, enough to fill a two years compendium of a comic-book series:<br/>    — Over 450 hand-made full-screen illustrations and 20 characters with over 400 different variants and attitudes (including 38 possible appearance evolutions of the main character, Daphné),<br/>    — 80.000 words in English and in French (which would translate into a 400 pages novel).<br/><br/></li><li>60 different endings, 28 achievements to unlock. Throughout the story, your choices will impact:<br/>    — how the plot ends (6 possibilities),<br/>    — the destiny of the main character (4 possibilities),<br/>    — the romantic relationships of the main character (3 possibilities),<br/>    — several smaller plot points (such as the life or death of some supporting characters).</li></ul>", "metacritic": null, "released": "2016-10-12", "tba": false, "updated": "2023-02-07T21:11:25", "background_image": "https://media.rawg.io/media/screenshots/281/281abf325bbf4832e890d705de4fc759.jpg", "website": "http://alongtheedge-game.com", "rating": 3.0, "rating_top": 3, "added_by_status": {"yet": 20, "owned": 33, "beaten": 4, "toplay": 2, "dropped": 1}, "playtime": 3, "achievements_count": 20, "ratings_count": 6, "suggestions_count": 240, "game_series_count": 0, "reviews_count": 6, "platforms": ["macOS", "PC", "Linux"], "developers": ["Nova-box"], "genres": ["Indie"], "publishers": ["Plug In Digital", "Nova-box"], "esrb_rating": null}