{"id": 122631, "slug": "stack-itch", "name": "Stack (itch)", "name_original": "Stack (itch)", "description": "Empilhar peças não é só uma brincadeira, mas um verdadeiro desafio!\r\n<p>Você já viu alguém brincando com blocos de montar? Coloridos e fofos, eles são usados por crianças do mundo todo para divertir-se em longas tardes de verão. E caso você não pise neles por engano, eles não vão despertar nenhum tipo de perigo — e nem instigar a sua criatividade... <strong>até agora!</strong></p>\n<p><strong>Stack</strong> é um jogo de puzzle 3D cujo objetivo é conectar blocos de montar em linhas e fazer com que eles não sejam empilhados demais. Quando uma linha fica completa com a mesma cor, ela some e suas pilha abaixa. Clique nos blocos e mude-os de posição para formar estas linhas. Tome cuidado para não estourar sua pilha!</p>\n<ul><li><strong>Mecânica exclusiva de puzzle </strong>com blocos de montar</li><li><strong>Vários níveis de desafios </strong>para te desafiar</li><li><strong>Novas cores de blocos </strong>para tornar a sua pilha ainda mais intrigante</li><li><strong>Consiga altas pontuações </strong>e torne-se o rei da pilha</li></ul>\n<p>Para movimentar a câmera e ver outras partes da sua pilha, use o <strong>botão esquerdo do mouse</strong>. Clique em um conjunto de blocos com o mesmo botão para selecioná-lo e, após encontrar sua nova posição, clique novamente para confirmar a nova posição. Use o <strong>botão direito do mouse</strong> para cancelar qualquer ação.</p>\n<p><em><strong>Stack</strong> foi feito para ser apresentado na Semana da Computação (Semcomp) do ICMC-USP, na 20ª edição do evento, em 2017, usando Unity. Ele está disponível<strong> </strong>para Windows, Linux e Mac OS X apenas em Inglês.</em></p>\r\n\r\nPremiações\r\n\n<p>O <strong>Stack </strong>foi selecionado para o Simpósio Brasileiro de Games e Entretenimento Digital (<strong>SBGames</strong>) 2017, na categoria \"Jogos de Estudantes\"! Ele foi um dos 90 jogos selecionados dentro de 274 submissões desta categoria e será apresentado ao público durante o simpósio nos dias 2 a 4 de novembro de 2017 na PUC-PR, Curitiba/PR, Brasil.</p>\r\n\r\nIn English\r\n<p><strong>STACKING PIECES IS NOT A PUZZLE, IT'S A TRUE CHALLENGE! </strong>Use your mouse to move bricks, make lines from a single color to make the bricks disappear. Be aware: don't overflow your stack! <strong>Stack </strong>is available for Windows, Linux and Mac OS X in English.</p>\r\n\r\nCréditos (Credits)\r\n<ul><li><strong>Design de Jogo (Game Design): </strong>Anayã Ferreira &amp; Rafael Gallo</li><li><strong>Programação (Programming): </strong>Rafael Gallo</li><li><strong>Desenvolvimento Visual (Visual Development): </strong>Anayã Gimenes Ferreira &amp; Rafael Gallo</li><li><strong>Som &amp; Música (Sound &amp; Music): </strong>Gil Barbosa Reis</li><li><strong>Integração Web (Web Integration)</strong> Jefferson Boldrin Cardozo</li></ul>", "metacritic": null, "released": "2017-08-07", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/415/4154379c52c4ec5ff6a9db6d78b5d0b0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 30, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Web"], "developers": ["Fellowship of the Game", "Gallo", "Anayã Gimenes Ferreira", "gilzoide"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}