{"id": 122776, "slug": "the-box-itch-nuclear-banana", "name": "The Box (itch) (Nuclear Banana)", "name_original": "The Box (itch) (Nuclear Banana)", "description": "<p>This is a preview version, the full version is still under development. Any and all feedback is hugely appreciated!</p><p>\"One night, Karen awakes from the draft from a window, and discovers an intruder in her home. Dragging a large chain around her living room, but not stealing anything or hurting her. After a series of other similarly bizarre incidents in their small, countryside town, Karen and a group of friends uncovers something unsettling at the bottom of a derelict mine: A box of gargantuan proportions. With seemingly no defining features aside from a thick, impenetrable, deep green exterior and a slow, faint humming from within, Karen and her friends sets out to reveal what's in the box, and maybe even figure out what's been happening around town lately.\"</p><p>\"The Box\" is a visual novel in the horror and science fiction genres. It features branching story lines, multiple endings, hours of game play and an involving story. It draws inspiration from such works as Steins;Gate and Chaos;Head by 5pb. x Nitro+ and other science fiction and horror epics.</p><p>This game requires no special permissions, has no advertisements or in-app purchases. </p><p>16+ years recommended due to adult themes.</p><p>Changelog</p><p> v1.08<br/># Script<br/>- Fixed grammar error in chapter 1 (\"says\" -&gt; \"say\")</p><p># UI<br/>- Added sound to chapter transitions<br/>- Added shake effect to chapter transitions</p>", "metacritic": null, "released": "2015-12-14", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/905/9057bb048a908c1a5433357b64cd3d57.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 67, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Nuclear Banana"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}