{"id": 122782, "slug": "evolution-itch-vin", "name": "Evolution (itch) (Vin)", "name_original": "Evolution (itch) (Vin)", "description": "<p>Created during Global Game Jam 2018. \r\n</p>\n<p>Guide your species through the twists and turns of evolution as it spreads around the globe in this single player computer card game.</p>\n<p>The game consists of 3 phases:\r\n1 - Biome choice - choose one of the three biome cards, which decide how many events you will have to face and how much population is at stake should you succeed or fail.\r\n2 - Genepool draft - build your deck from several hands of 5 cards. The top part of the card represents a genepool card, the bottom half an event card. By choosing a card, you draft the top part into your genepool deck, and ensure that the bottom part will not make it into the event deck you will face next. From each hand of 5 you can choose 3 cards, the other two will go into the event deck.\r\n3 - Event resolution - you draw one event card from the event deck and three cards from the genepool deck. Your goal is to match the symbol requirements on the event card by using genepool cards that add up to an equal or greater amount of each symbol. From the 3 cards in your hand, you choose one to use on the event card, then choose one to discard. The remaining card will stay in your hand, and 2 additional cards will be drawn. This repeats until you clear a number of events that corresponds to the biome you chose, which means you have succeeded and your species' population increases, or until your genepool deck runs out, in which case you have failed, and the population decreases.</p>\n<p>You can win the game by amassing a population of 10000, and you lose when your population reaches 0, or when you have finished 10 biomes without winning.</p>\n<p>Credits:\r\nDesign &amp; hotfixes: Łukasz \"Vin\" Winkler\r\nBugs: Patryk \"Huginn\" Woźnicki\r\nArt: artyna \"Lisza\" Wasiluk</p>", "metacritic": null, "released": "2018-03-18", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/a9c/a9ce6bc401dcc799924d0e6c4a0bcd58.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 34, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Vin"], "genres": [], "publishers": [], "esrb_rating": null}