{"id": 122812, "slug": "stranded-itch-davesilver", "name": "Stranded (itch) (DaveSilver)", "name_original": "Stranded (itch) (DaveSilver)", "description": "<p>I made this game for the Indie Mix Tape 3 on the r/indiedev subreddit. </p><p>In this game, you're stranded on a randomly-generated desert island. With very little resources, and almost no hope for rescue, you must survive as long as possible, and keep your strength up until you can find a way off the island. </p><p>The game is very much a work in progress, however any feedback would be appreciated, and I'd be grateful if you gave the game a shot. I will continue updating throughout June 2015, but if I decide to return to the project, or keep going even after that point, I will make sure to update it here.</p><p><strong>Update 6/23/15 6:34 PM</strong></p><p>Okay so this is gonna be my last consistent update for a while. Sadly I still wasn't able to get to crafting or combat, but other priorities are quickly approaching, and I need to focus on them for a week or two at least. I will be attempting to work on this every few days, and update it here as I do, but I can't make any guarantees. I hope you've enjoyed watching the progress so far, and keep an eye on the page for the next update in a week or so.</p><p><strong><strong>Update 6/21/15 9:09 PM</strong></strong></p><p>I've just uploaded a new version of the game. While the gameplay is basically unchanged from the previous release, it now generates a much larger map than it did before. On my system it takes about a minute to generate the full map, but results may vary. Enjoy, and hopefully tomorrow I can put out a release with a crafting system or combat added in.</p><p><strong><strong>Update 6/17/15 11:33 PM</strong><br/></strong></p><p>I just uploaded version 0.25, so feel free to download it. While this version doesn't have any extra features compared to the previous version, it is substantially more optimized than the last version and runs much more smoothly. Before I was having noticeable hiccups even when I was supposedly getting good frame-rates, but now it's practically butter on my machine. On top of that, I was able to optimize the island generation algorithm, and increased the island size.</p><p>Hopefully these updates will allow even mroe people to enjoy the game/</p><p><strong>Update 6/17/15 12:04 AM</strong></p><p>So apparently I made some mistakes when exporting my executable in the initial version. Thankfully someone on reddit pointed out the issues he was having and i was able to correct it. If you tried playing and had issues with freezing or not seeing the instructions screen, I'm sorry, btu this new version should be much better. Please give it another shot, or a first one if you didn't already, and enjoy.</p><p><strong>Update 6/16/15 11:30 PM:</strong></p><p>This update brings with it a few changes. First, while the enemies don't attack you, they do now roam the island instead of just standing in place. I'm almost at the point where they can attack you though, and that update should come tomorrow. On top of that, the lighting system now works better than it did in the first upload. While the lighting itself is the same, the game starts closer to mid-day so it's initially brighter, and the area around the player which is lit decreases as it gets darker to make it feel more like you can't see as far around you. It's a small touch, but in game it feels much more natural. Finally, I updated the graphics for the trees, so that there is a bit more depth to them, and added a graphic to make it clear when you hit enemies.</p><p>Tomorrow I will continue working on enemies, and hopefully get to crafting.</p>", "metacritic": null, "released": "2015-06-16", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/b21/b211499e642c3602c5b0976fc1cbe3a9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 43, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["DaveSilver"], "genres": [], "publishers": [], "esrb_rating": null}