{"id": 122840, "slug": "breathe-itch-covetedpeacock", "name": "Breathe (itch) (CovetedPeacock)", "name_original": "Breathe (itch) (CovetedPeacock)", "description": "<p>“Social anxiety is the fear of being judged and evaluated negatively by other people, leading to feelings of inadequacy, inferiority, self-consciousness, embarrassment, humiliation, and depression. If a person usually becomes (irrationally) anxious in social situations, but seems better when they are alone, then \"social anxiety\" may be the problem.” - <em>Thomas A. Richards, Ph.D., Psychologist/Director, The Social Anxiety Institute</em></p>\n<p>Social anxiety is the irrational fear of being judged and evaluated negatively by other people, leading to feelings of inadequacy, inferiority, self-consciousness, embarrassment, humiliation, and depression.</p>\n<p>Social anxiety is the third largest psychological disorder in the United States. It is estimated that 7% of the population suffers from social anxiety - that’s almost twenty-three million Americans.  Further, the lifetime prevalence is 14%. That means that fifty-five million will suffer from social anxiety at some point during their lives - more than the populations of Florida and Texas combined.</p>\n<p>Breathe was designed not for people who suffer from social anxiety, but for the people around them. Social anxiety is a difficult sensation to put into words, and can be challenging to explain to someone who hasn't experienced it. With Breathe, people who deal with social anxiety will have a means of expressing their experience without having to use words.</p>\n<p>Credits:</p>\n<ul><li>Production/Sound Design: Connor Peacock</li><li>Programming: Pablo Bernal</li><li>Design/Logo: Brian Compton</li></ul>\n<p><em>(Designed as part of the 2018 MeGa Health Jam in Orlando, FL.)</em><br/></p>", "metacritic": null, "released": "2018-04-15", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/dc6/dc6841f3e733c184a24a5b557c2ffa48.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 23, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["CovetedPeacock"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}