{"id": 122955, "slug": "moonlight-itch-6", "name": "Moonlight (itch) (6↓)", "name_original": "Moonlight (itch) (6↓)", "description": "<p>In the first scene of H.G. Wells' <em>The Time Machine, </em>the Time Traveller demonstrates his new invention by using a tiny scale model.  The model is a fully functioning time machine, but too small for anyone more than half a foot tall.  He sends it unmanned into the future... but what became of it?  </p><p>In my story, Wells' time machine found it's way to the land of Lilliput, described in Jonathan  Swift's Gulliver's Travels.  Lilliputians are \"Less\"-er folks to be sure; not only are they 1/12th-scale, but they're also a bit too prone to conflict.  Their use of the time machine lands them in a temporal catastrophe, a future where the Earth is tidally locked to the Sun, and there is no cycle of day and night, just a world in sunlight and one in shadow.  </p><p>Strange after-images and phantom lights show that the time distortion is still ongoing, even while the machine is off.  In a last-ditch attempt to escape the Dark Side of the Earth, the Lilliputian scientist tangles another timeline into his timeless purgatory, that of Sir Arthur Conan Doyle's Sherlock Holmes.  </p><p>Holmes must drop his investigation of the man with the watches, and instead discover where (or rather, <em>when</em>) he is.<br/></p><br/><p><strong>Reassembled Scientist's Log</strong>(Spoilers!)</p><p><strong>Gameplay Video</strong><br/></p><p>- press X to start playing -<br/></p><p><strong>ARROWS</strong> : Walk</p><p><strong>CTRL</strong> <strong>+</strong> <strong>ARROWS</strong> : Run ( you can't collect clues while running)</p><p><strong>X</strong>: find/collect Clues (a Clue can be picked up an exclamation point is overhead), <strong>SHIFT</strong> to view after finding to enter <strong>Review Mode</strong> (<strong>Mouse/WASD</strong>, see below)</p><p><strong>C</strong>: light Match</p><p><strong>Z</strong>: arm(1st press) or fire(2nd press) Holmes' Webley Revolver.</p><p>NOTE: You only get 5 bullets, so use them wisely!<br/></p><p><strong>R to reset</strong> if you get stuck.</p><p>as you collect Clues, you can review and sort them by holding <strong>SHIFT </strong>to enter <strong>Review</strong> <strong>Mode</strong>.</p><p>While in <strong>Review Mode</strong> (holding <strong>SHIFT</strong>), you can <strong>Mouseover</strong> a Clue and press <strong>WASD</strong> to move that Clue around. If Clues get stacked atop another, <strong>Left-Clicking</strong> with the mouse will scatter them. If you move a Clue too far from the center or run out of room for Clues, you can hold <strong>SPACE</strong> with <strong>WASD </strong>to shift the entire Review screen.<br/></p><p>Note on Review Mode frustration: I did mean for it to be difficult to arrange the notes (they are after all bits of pages from a journal written by a man less than 6 inches tall!), but it turned out to be harder than I expected.  I'd thought using the mouse to drag and drop would be too easy, so I went with the WASD nudge system. I must remember that repetitive playtesting can give a dev distorted impressions of difficulty.</p><p>Also, there is a bug in Review Mode which makes it tough to sort notes unless you're standing in the Moonlight.  Fortunately, the Moonlight is where you want to be sorting, since it's the only place safe from the Morlocks! </p><p>If you've just picked up Clues and can't see them when you hold <strong>SHIFT</strong>, hold <strong>SPACE</strong> as well and pan left/right with <strong>A</strong> and <strong>D</strong><br/></p>", "metacritic": null, "released": null, "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/471/471d042f27ce52c4cd8ab5b33a41a6e7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 18, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["6↓"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}