{"id": 122999, "slug": "carsteroids-itch", "name": "CARSTEROIDS (itch)", "name_original": "CARSTEROIDS (itch)", "description": "<p><strong>A \"2D car-combat retro shooter scifi game\" with rogue-like elements. </strong></p>\n<p>Carsteroids is a challenging top-down shooter where the protagonist will need to win the final prize for getting out from his sudden troubles. <br/>Inspired by the 90's arcade machines and the 16-bit era machines, the game is concentrated on the player's skills to win the impossible tournament and to proceed with the story:<br/>- - - - - <br/>418 years after our planet's death the man entered into its darkest age... <br/>The asteroid belt was the final frontier for the search of the resources. Now, it is the biggest spaceport ever known, the asteroids are almost drained and the inhabitants are raging civil war for the independence from the Earth dominion.<br/>The governor of Vesta created a combat game show to avoid the war, the game was called Carsteroids:</p>\n<p>\"<em>We have the greatest show in the Solar System! Are you looking for glory? Money? Are you smuggling some goods? Are you seeking for revenge? Maybe you are a slave with no choices, so fight for freedom! Or simply wanna have fun? Make your own destiny in the Carsteroids arenas!</em>\"<br/></p>\n<p><em><br/>Featuring:<br/>- 60 fps<br/>- single player story mode<br/>- challenge mode<br/>- multiplayer fun (versus mode, co-op mode, capture the flag mode)<br/>- random arenas and crazy enemies<br/>- fast and challenging old school car combat<br/>- powerups!<br/>- loot and collect items<br/>- unlockables<br/>- bonus levels<br/>- hidden areas<br/>- keyboard/gamepad control<br/>... and more!!<br/>___________________________________<br/>[version 0.99L]<br/></em></p>\n\n<p><em><strong>Twitter page</strong></em></p><p><em><strong>STEAM</strong></em></p>\n<p><em><strong><em><em><strong><em><strong>Facebook page</strong></em></strong></em><br/></em></strong></em></p>\n\n<p><em><strong>NOTE:</strong></em> The game is a <strong>WORK IN PROGRESS</strong> - Please make sure that your PC is webGL compatible and browser writing permissions are enabled.</p>", "metacritic": null, "released": "2017-03-04", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/c36/c36f0cf109faddaab801508eb183886f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 183, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["bkdove"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}