{"id": 122995, "slug": "in-the-dark-itch-teamfirestorm", "name": "In The Dark (itch) (TeamFireStorm)", "name_original": "In The Dark (itch) (TeamFireStorm)", "description": "<p>Please visit our steam Greenlight page, The steam page will be up soon.</p>\n<p>http://steamcommunity.com/sharedfiles/filedetails/...<br/><br/>You awake in a hospital, no sight, no memory, only pain fills your mind. However, the sound and smell of fire does not give you the time to contemplate the situation. Danger drives you out into the world, cold, and deadly darkness surrounding you. However, into the oblivion of your existence comes Ester. A small girl who serves as the eyes for the blind man and your connection to the world. Her words serve as your sight, painting the world into a horrific image filled with peril. Even this friendship is tenuous... distant memories haunt you. Your doomed past chases your dreams and threatens your desperate journey in search of safety and help.</p>\n<p>\n</p>\n<p>\tFor regular screenshots and info, please visit and like our Facebook page: \t<br/>\twww.facebook.com/InTheDarkTheGame<br/> <br/>\tThis is an indie developed project using overhead sprite art. This game is over world adventure style, requiring the player to discover the world not through the character's sight, but through feeling, sound, smell, and your companion, Ester's, insight. Monsters emerge from the darkness to attack, requiring real-time combat. (Although running from all enemies you find will keep you and your companion alive).</p>\n<p>\n</p>\n<p>\tBecause you can not depend on your sight, for all maps, you must explore a mostly black screen, slowly filling it in as you feel around.</p>\n<p>\n</p>\n<p>\tEventually, you fill the map as you discover more and more.</p>\n<p>\n</p>\n<p>\tUsing both Esters guidance, sounds, and other cues, you will navigate, while avoiding monsters and other dangers.</p>\n<p>\n</p>\n<p>\n</p>\n<p>\tThis project was first conceived about 4 years ago. Since that time, we have formed a group of artists and consultants and ultimately have gotten it to the point we feel comfortable with presenting it with the intention to release.</p>\n<p>\n<br/>\n</p>\n<p>\tOur current timeline puts us releasing this game late Summer 2017. Our intention is to get the game greenlit on Steam, and we will be publishing our Steam Greenlight page within a few days. Alternatively, if Steam Direct has gone live before we can be greenlit, we will aim to be released on there. \t\r\n</p>\n<p>\n</p>\n<p>\tBefore this we had a kick starter which reached over double our goal. As such, now that we have delivered the demo to all of the backers, and now that the campaign is over, we are now releasing the demo to the public. We hope everyone enjoys it<br/>\n</p>\n<p>\n</p>", "metacritic": null, "released": "2017-04-21", "tba": false, "updated": "2019-08-28T23:23:37", "background_image": "https://media.rawg.io/media/screenshots/8e4/8e441d255493849816aabe208327a4da.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 118, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["TeamFireStorm"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}