{"id": 123017, "slug": "pockeyio", "name": "Pockey.io", "name_original": "Pockey.io", "description": "<p><strong>Pockey.io</strong><br/></p>\n<p>Have you ever been at an arcade and couldn’t decide between playing pool or air hockey? Well, neither have we - cause you can bet your bottom coin we played both. So it only makes sense to combine these two beloved games to make an incredibly fun and addicting experience.</p>\n<p>Pockey is a 1v1 online pool game that is playable on PC or mobile via internet browser (with an ios/android app in the works), allowing you to compete against friends or strangers in this original twist on the classic 8-ball pool game. Whether you’re looking to kill some time or reach the highest ranks of the leaderboard, Pockey is the perfect casual meets hardcore game.</p>\n<p><strong>Features</strong></p>\n<ul><li>Ranking and matchmaking system</li><li>All-time leaderboard listing the best players in Pockey</li><li>Permanent level system with rewards and achievements</li><li>Inventory - hundreds of cosmetic item rewards and in-game currency earned by just by playing</li><li>Invite friends across platforms and play against them</li><li>Compete against other players in a high stakes round-robin tournament</li><li>Keep track of your player stats, earn special badges for completing difficult achievements</li></ul>\n<p><strong>Get in touch!</strong></p>\n<p>Twitter: https://twitter.com/starcadeio<br/>Facebook: https://www.facebook.com/starcade.io/<br/>E-mail: contact@starcade.io</p>", "metacritic": null, "released": "2018-01-18", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/211/2118b6349999c0f5f7b3221de2cd2560.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 5, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Starcade.io"], "genres": ["Action", "Simulation", "Sports"], "publishers": [], "esrb_rating": null}