{"id": 123076, "slug": "food-face", "name": "FOOD FACE", "name_original": "FOOD FACE", "description": "<p> Sometimes in life you have to choose if you just are gonna throw stuff around and have fun or play by the rules and maybe gain some numbers. In this case you are the caretaker of a very picky cyborg head. It needs feeding and it needs the right combination of food and goo to stay happy and healthy. It´s name is Food Face and this is the story of your life together.</p>\n<p>Controls:<br/>Arrows  Left &amp; Right - Control Goo Bottles<br/>Z: Ketchup<br/>X: Mustard<br/>C: Toothpaste</p>\n<p>Backspace: Restart Game<br/>Escape: Flee this reality</p>\n<p>Made together with Nordloef for LOWREZJAM2016!<br/>There are tons of stuff we would like to add to the game but we must first consider our mental and physical health. Maybe in the future we will add luxurious stuff like a Title Screen or maybe a High Score screen. More blinking colors? Music? A decent ending to the game. But we are quite happy with it´s current state so we figured it is ok. =)<br/>Enjoy!</p>\n<p>SAID ABOUT THE GAME: <br/></p>\n<p>Mighty CheBo :</p>\n<p>A purely fun, original interactive aesthetic experience. I thoroughly enjoyed playing and would recommend others try it.</p>\n<p>I'm not sure of how to suggest improvements. It feels almost perfect as it is, though I suppose there's not that much to it.</p>\n<p>clemonades </p>\n<p>Very wacky! Make me laugh lol =D</p>\n<p>Jupiter_Hadley <br/></p><p>Really chaotic, interesting game! I included it in my compilation video series of the Low Rez Jam games, if you would like to take a look :) </p>\n<p>https://youtu.be/hqqcDmlAGZY<br/></p>", "metacritic": null, "released": "2016-04-16", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/75a/75abd8a38a8daa3eb427d9dcfddd0632.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 11, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["salkinitzor"], "genres": ["Action"], "publishers": [], "esrb_rating": null}