{"id": 12326, "slug": "metamorphic", "name": "Metamorphic", "name_original": "Metamorphic", "description": "Darkness. Falling. Light. A metallic, geometric cavern surrounds you. A single source of light beckons you forward, up – towards the only exit. <br/><br/>Inspired by Portal and Minecraft, Metamorphic is an atmospheric, first person physics-based puzzle game, which lets the player absorb, configure and then morph non-gravity, gravity and antigravity cubes to complete each level.<br/><br/><strong>Key Features:</strong><br/><ul><li><strong>Procedural voxel, physics-based gameplay </strong><br/>Metamorphic's core mechanic is the first of its kind. Each puzzle requires the player to assemble configurations of static cubes, select and then transform them into physics-affected objects. Any three dimensional arrangement you can conceive will then be accurately influenced by gravity and friction. <br/><br/></li><li><strong>It's about solving puzzles </strong><br/>Most first person platformers require the player to execute moves with pinpoint accuracy and timing such that solving the puzzle is rarely the hardest part, Metamorphic requires nothing of the sort. Despite the fact that the game is physics based, each puzzle simply requires the player correctly arrange and transform voxels to progress. <br/><br/></li><li><strong>Skill development based </strong><br/>Metamorphic will test your understanding of physics unlike any other game. While levels can be completed quickly if their solutions are known, each section of every puzzle requires the player to make a leap in their comprehension of the underlying system keeping the game from feeling repetitive or tedious. <br/><br/></li><li><strong>Atmospheric Environment </strong><br/>Beautiful lighting, reflections and sounds immerse you in each intricately designed chamber.</li></ul>", "metacritic": null, "released": "2016-07-06", "tba": false, "updated": "2019-08-28T22:13:21", "background_image": "https://media.rawg.io/media/screenshots/3ad/3adbdf73c95bbca45d0828b53a51bf53.jpg", "website": "http://metamorphic-game.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 7, "dropped": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 213, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux", "macOS"], "developers": ["Jeremy Slavitz"], "genres": ["Simulation", "Indie"], "publishers": ["Jeremy Slavitz"], "esrb_rating": null}