{"id": 1233, "slug": "pirate-legends-td", "name": "Pirate Legends TD", "name_original": "Pirate Legends TD", "description": "&amp;quot;If you&amp;#39;re looking for a respectable tower defense game that is challenging and looks great, then Pirate Legends TD is the game for you&amp;quot; Pocket Gamer<br/><br/>Navigate your pirate ship through the deadly waters of the Caribbean as you defend yourself from the evil Imperial Navy, hungry Cannibals, and the restless Undead Horde. Pirate Legends is a tower defense game, with stunning visuals and hours of fun for free!<br/><br/>FEATURES<br/>- 20 unique towers with special abilities and 2 upgrade paths<br/>- 5 heroes with unique skills!<br/>- Defend your ship against against 30+ different enemies and 4 terrifying bosses<br/>- 3 difficulty modes and for the bravest pirates: epic challenges!<br/>- Stunning visuals and animations<br/>- Awesome unique soundtracks and character voice-overs<br/>- In-game encyclopedia, 36 achievements, easter eggs... hours of action-defense gameplay await you mateys!<br/><br/>Internet connection NOT required to play, only during the installation of the game<br/><br/>Press Reviews:<br/>- &amp;quot;Pirate Legends is a terrifically fun game&amp;quot; - Touch Arcade<br/>- &amp;quot;Pirate Legends TD is worth a spot on any tower defense fans’ screen&amp;quot; - Cult of Mac<br/>- &amp;quot;There’s just so much to do at any given time in Pirate Legends TD that it breathes a bit of new life into a somewhat stagnant tower defense genre.&amp;quot; – 148Apps<br/>- &amp;quot;The result is Pirate Legends TD, a game full of interesting twists on the action-defense genre&amp;quot; – Slide to Play<br/><br/>User Reviews:<br/>&amp;quot;So addicted. Funiest,coolest tower defense game ever !!&amp;quot;<br/>&amp;quot;ROCKIN&amp;#39; COOL This is one of the best TD games that are new to the android market. I hope you continue to fix bugs and improve the awesomeness of the game. Devs rock...!&amp;quot;<br/><br/>For the latest updates, news and tips about our games:<br/>https://www.facebook.com/PirateLegendsTD<br/>https://twitter.com/superhippogames<br/><br/>Send us your feedback at contact@superhippo.com", "metacritic": null, "released": "2013-08-15", "tba": false, "updated": "2019-10-22T14:27:40", "background_image": "https://media.rawg.io/media/screenshots/dca/dcad5033cdce19687935424ee6e3a1e9.jpeg", "website": "http://www.piratelegendsTD.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 242, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Super Hippo Studios"], "genres": ["Action", "Strategy"], "publishers": ["Super Hippo Studios"], "esrb_rating": "Everyone 10+"}