{"id": 123410, "slug": "futility-goetworks", "name": "futility (goetworks)", "name_original": "futility (goetworks)", "description": "<p>What drives a man of God to wash away the sins of his past, only to blacken his heart with a multitude more? How far can a freedom fighter be pushed before virtue and righteousness are replaced by a lust for vengeance? What does a privileged society do when the foundation of its prosperity is shaken? futility dares to explore these heady themes and many more, giving you glimpses at just how the seemingly smallest of decisions can forever alter our realities, and our hearts. As a young person, your actions bring turmoil and strife to an ostensibly idyllic landscape. It's immensely fun to stir up trouble, and even more engaging to see how boldly futility portrays a society torn asunder. You'll be haunted by this thematically devastating adventure, and indeed, its phenomenal final minutes, which are bound to be discussed and dissected for some time to come.<br/></p><p>In this <em>raisin d'étour </em>you will be asked to face the real consequences of being alive. The l<em>a vie pon pon </em>is withing your grasp, if you dare to touch it. THIs is a <strong>B</strong>old and <strong>E</strong>xperimental game, that is not afraid to the big \"\"questions. futility is a short art game \"\"\"\"\"\"\"project\"\"\"\"\"\"\" made by a small team of 1 in the span of one weekend for the second AGDG weekend jam.</p><p>Controls:</p><ul><li>WASD to move</li><li>LeftMouse to pick up</li><li>RightMouse to throw</li><li>Escape to quit</li></ul><p>Music is from ventla's \"fansubbed last words\"</p><p>http://ventla.tumblr.com/post/37416362465/ventla-fansubbed-last-words<br/></p>", "metacritic": null, "released": "2017-04-09", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/765/7655a35c9c2e9424cc26dce8c13ffae6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 16, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["goetworks"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}