{"id": 12348, "slug": "defense-zone-3-ultra-hd", "name": "Defense Zone 3 Ultra HD", "name_original": "Defense Zone 3 Ultra HD", "description": "Welcome to the long-awaited sequel to the popular action/strategy game! New weapons, landscapes, and options galore! Every game session is now even more dynamic and amazing.<br/>\n<br/>\r\nThe core of the game is still the same: entire armies of enemies rush at your defenses, trying to destroy them by any means necessary. But now they’re even more powerful and madder than ever.<br/>\n<br/>\r\nYou’ll have access to older, time-tested turrets, as well as completely new types of weapons. It’s up to you to decide how to spend your available budget. Should you build new towers or upgrade and fortify the ones you already have? Turrets vary in terms of their attack range, firing speed, and damage type. The only way to win is to combine them so that they complement and strengthen one another.<br/>\n<br/>\r\nThe flexible difficulty settings will allow every player to get as much enjoyment out of the game as possible. If you’re an experienced commander, you’ll love the merciless, intense battles where the countdown where even a fraction of a second is vital to success and everything hinges on your ability to choose and arrange your turrets wisely. If you’re a new player, you’ll easily be able to train and prepare yourself for serious battles.<br/>\n<br/>\r\nEither way, the thoughtfully designed maps and wide range of available turrets will provide you with virtually endless tactical options. Thanks to the stunning, detailed landscapes, painstakingly drawn towers, and incredible special effect, you won’t be able to take your eyes off the screen.<br/>\n<br/>\r\nAll aspects of the game have been meticulously balanced, including tower statistics, enemy strength, terrain characteristics, and special weapons. You’ll never get bored by too-easy gameplay. Every level will challenge you. Are you ready to accept the challenge?<br/>\n<br/>\r\nFeatures:<br/>\r\n• Four difficulty levels<br/>\r\n• Eight kinds of turrets<br/>\r\n• Eight special abilities, from Air Strikes to Nuclear Bombs<br/>\r\n• Varied seasons and types of landscapes<br/>\r\n• Support for over 20 languages", "metacritic": null, "released": "2016-12-14", "tba": false, "updated": "2024-01-05T20:32:15", "background_image": "https://media.rawg.io/media/screenshots/900/900a0f28e881e855e2fd7b307908f66e.jpg", "website": "https://defensezone.net", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 18, "dropped": 1}, "playtime": 1, "achievements_count": 101, "ratings_count": 1, "suggestions_count": 398, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "Linux", "Android", "iOS", "macOS"], "developers": ["Artem Kotov"], "genres": ["Action", "Strategy", "Indie"], "publishers": ["Artem Kotov"], "esrb_rating": "Teen"}