{"id": 12350, "slug": "formula-fusion", "name": "Pacer", "name_original": "Pacer", "description": "<p>Formula Fusion is an anti-gravity racing game which pits your racing pedigree up against the rest of the world. Tackle the single player campaign and become the best pilot against the AI over leagues and championships, or play against the world in multiplayer and compete in a sports league where you can take either yourself or your team to the top step.<br />\nTrack Technology<br />\nTracks are made up of magnetic superconductors that suspend the craft within a gravitational field using super-cells, cooled by liquid nitrogen. This Quantum Levitation effect allows the craft to skim along the track at incredibly high speeds whilst remaining suspended above the track surface. Magnetic side buffers create an invisible barrier to dampen impact at high speeds whilst holographic digital elements serve to update your HUD with visual feedback.<br />\nWeapon Technology<br />\nYou are able to research new technology to add to craft weapon slots, which you can activate during race-time. Weapons and counter-measures in Formula Fusion are all digital. Once you use one you will need to re-charge them to reactivate them again. This will allow the player to choose to be either aggressive or defensive and as you progress through the craft stages more slots will be made available.<br />\nHandling and Features<br />\nWith enhancements to the traditional way of AG craft handling we have developed our own hybrid, a mixture of physics and spline control. In addition to the craft technology we have developed, we will create a garage system that allows you to fine tune your craft to your own specification. Tracks will be designed with many track themes and dynamic track surfaces. Track features will include corkscrews, twists, banks, jumps, and more.<br />\nGameplay<br />\nGameplay includes a layer of technology research and craft customization through the team garage facility, along with competitive ‘edge of your seat’ style racing in the various classes working your way from FF4000 Racing Class through to the aerodynamic FX1000 Hyper Sports leagues. Along with the base game modes we also aim to bring you visceral ‘in-cockpit’ F1 style action and synchronous eSports Racing Leagues. The game will have features such as ghost mode, collaborative F1 style team play, races, and leagues.<br />\nMotivation<br />\nThe game represents not only a next generation reboot of the classic AG Racing genre, but also a drive to bring back the core tried and tested elements from the most successful and most cherished AG Racing titles ever made including a thumping soundtrack, The Designers Republic inspired art, fast paced gameplay, fun tracks, and addictive gameplay.<br />\nGame Setting<br />\nThe game is set in and around New York State 50 years after the cataclysmic events of an all-out global nuclear war rendering most areas uninhabitable. Redevelopment on a vast scale has all but papered over the cracks, with many districts almost unrecognisable. The division between rich and poor is the greatest it has ever been with Favela style slums and make-shift buildings forming poverty stricken rings around affluent commercial districts.<br />\nThe year is 2075. 177 years since man first got behind the wheel of a car and raced against a competitor. Through the years, advances in science and technology have pushed the field of Quantum Levitation to a degree that allows modern transportation to be suspended within artificially created gravity fields above magnetic super-conducted highways. Along with transportation, this technology became embedded in motor sport racing; the pomp and celebration of what was Formula 1, evolved to become FORMULA FUSION – QUANTUM RACING LEAGUES.<br />\nThe racing calendar is now established as a global sporting event that brings technology and science together like never before. Because of the high level of technical competition and the huge levels of investment the race attracts - the traditional corporate backed race teams have given way to huge University based research facilities, and each team is now represented on a national level by these huge schools of excellence. These Mega-Universities are often the size of large cities with their own economies and laws.<br />\nWith competition for research funding high, each race season is as much about showcasing the skills of the pilots as it is the performance of the craft. Competition to attract the best researchers and engineers to these institutions is fierce with big money headhunting common place. Craft pilots are nurtured from birth and conditioned into becoming perfect testing machines to support this drive for success.<br />\nUniversities regularly publish their standings in the global research tables and this in turn allows them to achieve greater funding and expansion. Formula Fusion is a perfect testing grounds for the latest in hardware and science innovations. To support the research surrounding the event, Universities have focused their research into 4 key areas of innovation. These are represented in the Garage Technology Trees:<br />\n- Weapon Systems<br />\n- Propulsion Systems<br />\n- Craft Materials<br />\n- Quantum Physics<br />\nPlanned Game Features<br />\n- 7 themed zones: each containing 3 tracks and a final championship track resulting in 22 variations<br />\n- 10 National racing teams / research institutes: each with different research specialties<br />\n- Branding and graphic design from The Designers Republic – A perfect marriage of style and content<br />\n- Customisable Race Settings<br />\n- New weapon technology: research new technology and adapt your own style of play<br />\n- New game modes and meta-games: including an integrated Zone style mode and garage missions<br />\n- Local split screen and synchronous multiplayer aspect with Replay Ghost<br />\n- Team research garage: craft upgrade mechanic and race analytics through the front end<br />\n- Records, awards and eSPORTS racing leagues (format to be confirmed): through our eSports partner ESL<br />\n- 5 unlockable Craft Classes available at key upgrade/advance stages: including a team specific X-Technology craft<br />\n- Potential VR Integration: for visceral cockpit action</p>", "metacritic": 75, "released": "2015-08-03", "tba": false, "updated": "2023-09-18T14:52:43", "background_image": "https://media.rawg.io/media/games/683/683ae18647ac27d66954739c17548bf3.jpg", "website": "http://formulafusion.co.uk", "rating": 2.92, "rating_top": 4, "added_by_status": {"yet": 4, "owned": 116, "toplay": 3, "dropped": 8, "playing": 1}, "playtime": 2, "achievements_count": 145, "ratings_count": 12, "suggestions_count": 461, "game_series_count": 0, "reviews_count": 12, "platforms": ["PlayStation 4", "Xbox One", "PC"], "developers": ["R8 Games"], "genres": ["Simulation", "Sports", "Racing"], "publishers": ["R8 Games"], "esrb_rating": null}