{"id": 12357, "slug": "age-of-defense", "name": "Age of Defense", "name_original": "Age of Defense", "description": "Ancient world is really dangerous. You must protect your women and food from any misfortunes. In this reality dinosaurs have evolved differently. They can think, speak, make war! You are the ruler of an ancient tribe. Your people are hungry and scared. You must protect them from scaleskins' threat.Features<ul> <li>The path is blockable. You can put obstacles on the road to gather enemies and kill them with one lethal ability<br/> </li><li>No buildfields! You can place towers anywhere you want<br/> </li><li>Marvelous mix of fantasy, humour and history<br/> </li><li>24 unique towers with 68 buyable upgrades<br/> </li><li>Over 100 enemies with various abilities</li></ul>GameplayAoD is tower defense game with some new features. First of all, real size monsters cannot go through each other. Don't let your enemy achieve his goal by building towers and creating obstacles on the path. In addition, there is an extensive choice of towers with incredible abilities. What do you prefer? A big monkey with bouncing poison bones or a belligerent woman who throws exploding flowers while balancing on a huge rainbow toad? Choose your favorites, make important upgrades in the skills tree and lead your wildmen to the enemy land in order to reveal the secret of scaleskin hostility!", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T22:13:20", "background_image": "https://media.rawg.io/media/screenshots/d31/d3154b75c19aa70b6d5926cac7256388.jpg", "website": "http://battlecruiser-games.com/aod.php", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 38}, "playtime": 3, "achievements_count": 71, "ratings_count": 1, "suggestions_count": 214, "game_series_count": 0, "reviews_count": 1, "platforms": ["macOS", "PC", "Linux"], "developers": ["Battlecruiser Games"], "genres": ["Strategy", "Indie"], "publishers": ["Battlecruiser Games"], "esrb_rating": null}