{"id": 123552, "slug": "the-adventures-of-captain-fox", "name": "The Adventures of Captain Fox", "name_original": "The Adventures of Captain Fox", "description": "<p>A demake of StarFox (SNES) made for GBJam 6. Shoot down enemy ships, collect powerups, and defeat the boss to complete your objective! I tried to imagine what StarFox would have been like had it been made for the GameBoy first; I figured the name would have been totally different too.<br/><br/>Controls:<br/>\n</p>\n<ul>\n<li><strong>Arrow Keys:</strong> D-Pad; move the ship. Double-tap left or right to roll and deflect enemy blaster bolts.</li>\n<li><strong>X:</strong> A button; fire blasters.</li>\n<li><strong>Z:</strong> B button; launch bomb. Press while bomb is in flight to detonate it early.</li>\n<li><strong>Spacebar:</strong> Start button; pause.</li>\n<li><strong>0 - 9:</strong> Choose color palette.</li></ul><p>I added some palettes like the ones you get when playing a GB game on the GameBoy Advance, for a little fun and because the original GB palette I found had poor contrast between the two lightest colors. I used WebAudio to generate the sound effects, and I couldn't figure out how to imigate the GameBoy's noise generator, so I just stuck with oscillators for everything.</p><p>This one really came down to the wire. I ran out of time to write any music, and I haven't tested it in any browsers apart from Firefox. I almost had to scrap the second level, but I opted to shorten it so I didn't have to abandon the second boss I'd designed.<br/></p>", "metacritic": null, "released": "2018-08-25", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/0cd/0cdafc5d894bdaf9883bc62e71954b9c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 28, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Peter Wood"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}