{"id": 12353, "slug": "advanced-tactics-gold", "name": "Advanced Tactics Gold", "name_original": "Advanced Tactics Gold", "description": "Based on the award winning game engine by the same name, Advanced Tactics: Gold offers a unique and infinitely replayable wargaming experience for any strategy fan. Building off of the enormous success of Advanced Tactics: World War II, the Gold edition gives players a more powerful game editor, much improved random game engine, many new features and abilities, and more. Advanced Tactics: Gold also comes with an updated manual and ever-changing and expanding wiki, a freshly revamped scenario bank, new graphics throughout the game, more troop types, as well as some new scenarios. VR Designs has also been hard at working listening to player feedback, so Advanced Tactics: Gold also comes with many incremental changes and improvements based on community feedback!<br/><br/>But perhaps the most exciting feature in Advanced Tactics: Gold is the near limitless potential for replayability. The strong mod community will be able to create engaging, rich scenarios with the vastly improved editor, and players looking to hop straight into the action can enjoy a much improved random game experience that comes with many new rules, actions, and gameplay mechanics.Features<ul><li>Versatile Engine - The Advanced Tactics: Gold engine is capable of modeling a wide variety of warfare from modern battles to conflicts in fantasy realms!<br/></li><li>Improved Scenario Editor - The scenario editor is very powerful and allows the player to edit almost any aspect of the game in great detail.<br/></li><li>Expanded Random Game Mode - Many new features and game mechanics like more unit types, unit fuel, climates and seasons, and more.<br/></li><li>Form alliances with other players where you can share recon information and support allies in combat in addition to giving units, hexes, and research to allies as well!<br/></li><li>Loading and saving scenarios are faster as is the AI when calculating and executing its turn.<br/></li><li>3 Even-Steven scenarios for play against a human or AI opponent, 3 Tom Weber scenarios: World at War 39-45 (human-human only), pacific war 41-45 (human-human only), East Front 41-45 on top of the already 25+ existing scenarios packed with Advanced Tactics WWII that have also been included.<br/></li><li>A large and continually growing scenario bank allows you to find dozens of excellent scenarios ready for download and easy install.<br/></li><li>Easy scenario import from .zip and export to .zip functions to make scenario sharing easier<br/></li><li>A combat detail screen for those who like to study exactly how each modifier was used.<br/></li><li>GUI improvements in the form of extra information on landscapes, location types, peoples and subformation types.<br/></li><li>Watch the AIs turn to study its moves and attacks as they're made.<br/></li><li>Rule additions include more intense and grognard-like rules like movement delays in hex caused by combat, less predictable air intercepts and persistent battlestack counters.</li></ul>", "metacritic": null, "released": "2014-08-15", "tba": false, "updated": "2019-08-28T22:13:20", "background_image": "https://media.rawg.io/media/screenshots/bc3/bc37ad27f1c4fc52e1f5e05f9cc8d3ca.jpg", "website": "http://www.matrixgames.com/products/405/details/Advanced.Tactics:.Gold", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 30, "beaten": 1}, "playtime": 2, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 370, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["VR Designs"], "genres": ["Strategy", "Simulation"], "publishers": ["Slitherine"], "esrb_rating": null}