{"id": 123596, "slug": "fallin-snowy-christmas-fun", "name": "Fallin - Snowy Christmas Fun", "name_original": "Fallin - Snowy Christmas Fun", "description": "<p><strong>Fallin - Snowy Christmas Fun</strong><br/></p>Fallin X-Mas Edition. Enjoy the peaceful time around and before Christmas. Shorten your waiting period until Christmas eve with Fallin.<p>Navigate through endless obstacles like circles, squares or more difficult and imaginatively elements in front of a contemplative winter landscape.<br/>Fallin is an addictive, demanding, falling, casual, skill and concentration game. Train your reaction time!</p><p><strong>Features</strong></p><ul><li>Snowy, christmastime theme for the Christmas time</li><li>Two different game modes: endless and level based story mode</li><li>Easy control with one or two fingers</li><li>Global leaderboard for sharing and comparing your highscore</li><li>Tons of awards and achievements for your increasing performance</li><li>Over 150 different obstacles like circles, stars, squares, curves, rings, rectangles and other interesting and creative shapes</li><li>Five different color schemes (orange, blue, gray, green, purple)</li><li>Collect bonus items for a game variation</li><li>Collect continue icons to reach far in the endless mode</li><li>Unique pop music by IN PRISMA</li><li>Frequent holiday and special editions (e.g. on Christmas or Halloween)</li></ul><p><strong>Description:</strong><br/>The simple, arcade, fun and intuitive game concept is a perfect time filler and killer and will entertain you at the bus stop, in the train, on a flight, during lecture and whenever you are bored.<br/>Fallin will challenge you in an endless or level based story mode. <br/><br/>The endless mode features various bonus items, over 150 different elements and increases its difficulty continuously. Train your skill and concentration through directing the obstacles past your avatar. Improve your results, play with increasing difficulty and pave the way for your avatar and pass more and more complicated obstacles and collect all achievements. Try to fall down as far as you can.<br/>The Story mode features 20 different and varied levels. Each level has another level objective. Face all game variations to end with real difficult missions. Start easy, fulfill all tasks and become the Fallin master and King of the Hill. <br/><br/>Are you better than your friends? Discover your skill in the global leaderboard and compare your results.<br/><br/>Fallin is an endless fun experience!</p>", "metacritic": null, "released": "2016-10-29", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/af9/af9f0f5ab0acc76206bfcfd6f98f10dc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 31, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["I WANT AN ELEPHANT"], "genres": [], "publishers": [], "esrb_rating": null}