{"id": 123670, "slug": "the-adventures-of-stanley-frankfurter-jones", "name": "The Adventures of Stanley \"Frankfurter\" Jones", "name_original": "The Adventures of Stanley \"Frankfurter\" Jones", "description": "<p><strong>Update:  It has recently been brought to my attention that this game was not downloading correctly, and that the version that was available would display an error message when loading.  The issue turns out to have been that an older, corrupted build of the game was uploaded by mistake.  The issue has since been corrected, and the version currently available should work without any difficulties.  If you have downloaded this game recently and were unable to play it due to this difficulty, I apologize for the issue.  The issue has been corrected and tested, and  if you download the game again, it should run just fine.</strong><br/></p><p>A point and click adventure in the style of the old LucasArts and Sierra games.</p>Story: <p>Our story begins in the peaceful town of North Weenus, Ohio, in 2009. A burglary at the local historical society, seemingly a low-profile case, has caught the attention of the bureau, and Agent Jones is on the case. The McCulloghs seem like a perfectly average, lower middle class suburban family, but Jones knows from experience that things are never as simple as they appear… Join Stanley as he probes deeper and deeper into a world of sex, violence, intrigue, mystery and possibly a tasteful amount of bestiality, as he gradually uncovers an occult mystery that will shock you to the core of your very being. Take heed: your puny mind cannot possibly fathom the depths of awesomeness that is: The Adventures of Stanley \"Frankfurter\" Jones.</p> Features: <ul><li>Nostalgic point and click interface!</li><li>Original 3D graphics rendered as 2D stills, at a glorious 320×200 resolution!</li><li>Original soundtrack composed by Styop Quoons!</li><li>Mildly addictive arcade-style minigame!</li><li>So many easter eggs you won't know which orifice to shove them in first!</li></ul>WARNING: <p><strong>This game contains mature themes. Well, not exactly 'mature', but…in any case, this game was designed for adults. Although it has not been rated by the ESRB, it is the assessment of its creator that if it were to be rated, it would receive a rating of 'M' or higher. Parental discretion is advised.</strong></p>", "metacritic": null, "released": "2015-11-24", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/5dd/5ddd8e8e1d85b1e4b54401884a5df9b6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 100, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Muffin Entertainment"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}