{"id": 12379, "slug": "x-17", "name": "X-17", "name_original": "X-17", "description": "X-17 is a 3rd/FPS action shooter game with multiplayer on its way!<br/><br/><br/>Since Mark's last adventure, he created what is known as an Obelisk. With the power the Obelisk has to offer it is only natural another species would want to steal the power it posses. Or that is what is lead to believe, little does Mark Faroh know the Obelisk is not what he thinks it is, and once the truth is revealed all hell will break loose. Come along and meet new characters, explore creative levels, including exploring different universes. Engage with Awesome cut scene's  and interact with characters along the way, learn how to master weapons and power ups, and above all stay alive through this Epic Adventure. <br/><br/>X-17 is a hard core FPS/3rd person gameplay were the action never seems to stop. With a complete Story in game and already done, along with all the level design finished, this game is virtually done, and is just mostly in Early Access to to work out a few bugs that the user may experience, and finish off the multiplayer before going live with it. <br/><br/><br/><br/>MULTIPLAYER<br/><br/>Multiplayer is currently being incorporated at this time. It will feature Death Matches, Team Death Matches, and capture the flag. If you guys like Halo, and other death match shooters, this is a game I would highly recommend for the multiplayer alone.", "metacritic": null, "released": "2016-03-02", "tba": false, "updated": "2019-08-28T22:13:19", "background_image": "https://media.rawg.io/media/screenshots/192/19284a69a6de0688852561509bcb36de.jpg", "website": "https://www.facebook.com/PanzerStudios/?ref=hl", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 55, "dropped": 3}, "playtime": 4, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 548, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Panzer Gaming Studios"], "genres": ["Action", "Indie"], "publishers": ["Panzer Gaming Studios"], "esrb_rating": null}