{"id": 123797, "slug": "jam-jar-juggling", "name": "Jam Jar Juggling", "name_original": "Jam Jar Juggling", "description": "<p>A game about a jelly and his quest to juggle as many jars of jam as physically possible.<br/></p>\n<p>Use the mouse to control Jelly George! Use Jelly George's gelatinous body to juggle jars of jam and generate profit from Jelly George's amazing juggling skill.</p>\n<p>This game was made for the GDL July JiggleJam by 3  students. The main focus of this game was \"bouncing\", but when we realized that juggling was more satisfying we changed out design to emphasise that aspect of the game. We tried our best to create an engaging experience and hope you will enjoy it!</p>\n<p>\"I’d say to be honest, we didn’t expect it to be this fun, but it happened. Sometimes the ideas of gameplay might sound boring, but you just need to give it a shot. The hardest part for me was to design and draw the background and logo, which is basically most of what i did. I still would like to thank my teammates for forgiving my horrible drawing skill.\" -Eric C.</p>\n<p>\"The hardest part for me is all the drawing and character design stuff. As the designer of the main character and the illustrator of all the sprites of the game, I found the game development process quite difficult. But somehow I still managed to make nice looking sprites (hopefully) and that looks great in the game (apart from a few bugs). Before this game jam, our full team (with about 3 more members) tried to make a platformer couple of months ago. That game consisted of six levels which took us around four months to make, although that was partly because of we also had to do our schoolwork. When Ryan told me about this game jam, I told him that there is no way that we can make a game in 72 hours. I tried to convince him into participating another game jam, but I failed so we participated in this game jam anyways.\" - Arthur W.</p>\n<p>\"My teammates were absolutely clueless.\" - Ryan J.</p>", "metacritic": null, "released": "2017-07-02", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/0c2/0c29532215739f725c794aa7486b4411.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 27, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "Web"], "developers": ["Ryan Jung"], "genres": ["Action"], "publishers": [], "esrb_rating": null}