{"id": 123702, "slug": "sfas-2017-graph-flyer", "name": "SFAS 2017 - Graph Flyer", "name_original": "SFAS 2017 - Graph Flyer", "description": "<p><strong><em>Graph flyer is a challenging infinite flyer where you must swap between three shapes as you progress and try not to crash:</em></strong></p><ul><li>The triangle: Your go to bread and butter, the triangle can fly upwards and is the only shape that can do so!</li><li>The circle: Can't fly but can roll along the ground, good for those tight spots!</li><li>The square: Also can't fly but also won't die enemy triangles and lasers (anything that is red!)</li></ul><p><strong>Controls:</strong><br/></p><ul><li>'<strong>Left Mouse Button</strong>' or '<strong>Space</strong>' - Fly upwards as the triangle (I'd recommend left mouse button, it will help with the extra precision needed).</li><li>'<strong>W</strong>' - Turn into the triangle</li><li>'<strong>Q</strong>' - Turn into the circle</li><li>'<strong>E</strong>' - Turn into the square</li></ul><p><strong>Design Notes</strong></p><p>The initial structure to the game was retained - the scene loader system and user interface have all been used and handled in the same way, the UI was added extra functionality as extra scenes and screens were added to view controls, a tutorial, results screen upon dying, etc.</p><p>The initial scripts such as the game manager were used and refactored somewhat. </p><p>The magnetization script was used and slightly modified to provide the behavior of the enemy triangles that fly towards you.</p><p>The player controller script was clearly changed to fit the design of the game and provide slightly tighter controls.</p><p>An <strong>important note</strong> regarding what is and isn't mine within the game:</p><ul><li>Everything in the game was created by me from the assets to the scripts to the scene layout and level/section design, excluding the following:</li><li>The music was made by my <strong>Lomy Minch</strong>er, I don't have much musical expertise, so my housemate offered to make music and sound effects to my specification.</li><li>The use of a few of <strong>unity's standard assets</strong> - I used a few image effects that are provided within the unity standard assets to help create the aesthetic I was looking for, I was trying to create a flat looking 2D-esque game with some shading and shadows. So I used varying scene lights and orthographic camera and the following image effects to achieve this:<ul><li>I used sobel-depth <strong>edge detection </strong>script to provide the continuous outlines to my 3D models.</li></ul><ul><li>An anti-aliasing script to smooth edges slightly.</li><li>Finally a <strong>bloom </strong>script to give the brighter sections more vibrancy.</li></ul></li></ul>", "metacritic": null, "released": "2017-03-02", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/3e9/3e9f3327be9fa552fdba2588a57a1dbd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 35, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["AlexWhaley94"], "genres": ["Action"], "publishers": [], "esrb_rating": null}