{"id": 123865, "slug": "murder-of-crows-demo", "name": "Murder of Crows Demo", "name_original": "Murder of Crows Demo", "description": "<p>\r\n\tMurder of Crows is a 2D, story-driven action game about unethical crows, warmongering cats, and ancient all-consuming evil!\r\n</p>Story<br/>\n<p>\r\n\tSpectra, a recently resurrected bat, has a urgent warning for Director Bertram, the benevolent leader of the land.  Unfortunately, Bertram is missing, and in his absence the world has fallen into chaos.  Bertram's crow compatriots and a rag-tag cat rebellion have begun fighting for control, and neither side will listen to Spectra until the war is over.  Can she bring an end to the conflict and find Bertram before it's too late?\r\n</p>Gameplay<br/><p>\r\n\t  Explore an open Metroidvania-inspired world finding new weapons/upgrades, hidden items and areas, and battling dangerous enemies and bosses.  Combat in Murder of Crows is somewhere between a platforming shooter and a bullet-hell.  Some games let you double jump, or even triple jump.  Well, we've got INFINITE jumping (also known as flying).  You'll have to be fast on your feet/wings to outmaneuver enemies and their projectiles while also getting your own shots in.\r\n</p><p>\r\n\tThis demo was created over the course of about a year in my spare time.  It contains mostly complete (and hopefully polished) gameplay from the beginning of the game up until the first major boss battle.  The art reflects the art style of the final game and, while the sound currently consists of royalty-free music and sound effects, I hope to eventually create custom audio.  All feedback and constructive criticism is greatly appreciated and will help make sure that the final game is as fun and polished as possible.\r\n</p><p>\n<br/>\n</p>Controls (Viewable in-game):<p>\r\n\tAD - Move left/right\r\n</p><p>\r\n\tW - Fly (tap or hold)\r\n</p><p>\r\n\tE - Interact\r\n</p><p>Arrows - Shoot (hold)<br/></p><p>\r\n\tTab - Menu / Skip cutscene (hold)\r\n</p><p>\r\n\tEsc - Quit<br/>\n</p><p>\n<br/>\n</p>", "metacritic": null, "released": "2017-04-20", "tba": false, "updated": "2019-08-28T23:23:34", "background_image": "https://media.rawg.io/media/screenshots/610/610a334c2c637db139f7e5666d41055c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 114, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Montanker"], "genres": ["Action"], "publishers": [], "esrb_rating": null}