{"id": 12388, "slug": "slap-the-fly", "name": "Slap The Fly", "name_original": "Slap The Fly", "description": "You will embody a fly, a spider, a bee or a human. Your mission thus is to survive or to <strong>\"slap the fly\" !</strong><br/>You can play solo or multiplayer online. You have several characters to choose. You can choose either humans or insects. <br/>The goal for humans is kicking each insect 3 times before the end of the game. If humans manage to hit three times every insect before the end of the game, they will win. If not, insects will win.<br/><br/>There are 3 humans skins and 4 Insects : fly, bee, spider and rat. Each of these characters has specific skills. Each of the humans has a secondary weapon. Each of the insects have particularities : The fly and the bee can fly, the spider can move weaving webs, the rat can bite humans. <br/><br/>Players will have the possibility to create their own insect. There are various options like head, body, sting… <br/><br/>Various objects will spawn during each game : the mouse trap, the lamp fly swatter, the x ray glasses and the firethrower. Each of this weapons will help humans to kill Insects. <br/><br/>You can interact with several elements of the map such as windows, doors, PNJ’s to add more fun to the game. <br/><br/>Main features of the game: <br/>- Solo and multiplayer mode<br/>- Insects controls <br/>- Human controls : Slap, Objects Drag on Drop <br/>- Entire physics replication <br/>- 8 Maps (two maps added since the trailer) <br/>- Up to 6 players<br/><br/>The game is in alpha version.", "metacritic": null, "released": "2016-11-02", "tba": false, "updated": "2019-08-28T22:13:19", "background_image": "https://media.rawg.io/media/screenshots/403/403756a1897c6576ad066158d6c3cc54.jpg", "website": "http://www.forceight.com/slap-the-fly/", "rating": 4.17, "rating_top": 5, "added_by_status": {"yet": 1, "owned": 60, "toplay": 2, "dropped": 1, "playing": 2}, "playtime": 1, "achievements_count": 0, "ratings_count": 5, "suggestions_count": 251, "game_series_count": 0, "reviews_count": 6, "platforms": ["PC"], "developers": ["Forceight"], "genres": ["Simulation", "Indie"], "publishers": ["Forceight"], "esrb_rating": null}