{"id": 123820, "slug": "alicio-en-la-kurioza-kongreso", "name": "Alicio en la Kurioza Kongreso", "name_original": "Alicio en la Kurioza Kongreso", "description": "<p>Ĉu vi memoras vian unuan kongreson? Alicio neniam forgesos la sian.</p><p>Estas la inaŭgura Kurioza Kongreso de Esperanto, kaj neniu scias, kion atendi. Kiam la ĉeforganizanto enfalas skatolon dum la solena malfermo kaj vanuas, iĝas klare, ke la titolo de la kongreso ne estas simple ŝerco. Kvazaŭ tio ne estus tro, duono de la organiza teamo malaperis, la maŝino en la manĝejo ne permesas al homoj manĝi, kaj estas arbo en la ĝardeno kiu ploras senĉese. Eble la UK estintus pli bona elekto!</p><p>En ĉi tiu interaga fikciaĵo, VI estas la ĉefrolulo. Viaj elektoj decidos, ĉu la kongreso estos sukceso, aŭ ĉu ĝi kabeigos ĉiun partoprenanton. Uzu viajn saĝon kaj kuraĝon por trovi la malaperintajn organizantojn, kolekti la misterajn elementojn, kaj malkovri la fonton de la magio, kiu kaŭzas la kaoson. Aŭ ignoru la problemojn, kaj vidu, kio okazos…</p><p>Elŝutu Alicio en la Kurioza Kongreso hodiaŭ, kaj spertu la plej frenezan Esperanto-aranĝon de via vivo!</p><p>Alicio en la Kurioza Kongreso estis farita per Twine, programo por krei interagan fikcion. La dosiero estas en formato HTML kaj malfermiĝos en via retumilo. Ne estas fiksita prezo por la ludo, sed se vi volas subteni min, mi estus tre danka je iu ajn elspezo.</p>", "metacritic": null, "released": "2016-12-08", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/dee/dee4bf702834bf8a2eba9207a24effde.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 16, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ariel Bonkorpa"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}