{"id": 12390, "slug": "hide-hold-out-h2o", "name": "Hide & Hold Out - H2o", "name_original": "Hide & Hold Out - H2o", "description": "First of all, you should keep in mind that the game is still a work in progress and so that many things are still missing before starting to see the original idea into its entirety.<br/>If you're waiting for instant fun, maybe you should consider keeping an eye on the game and wait for a more advanced state before going any further.<br/><br/><br/><br/>In the world of Hide &amp; Hold Out, you are one of the survivors of the cataclysm which happened near the end of the 20th century.<br/>This cataclysm has led to a brutal elevation of the sea level all around the globe. Today, you don't really know if there is still a true \"land\" somewhere, but you know that this reef saved you after the disaster. Well... not only you, actually, and that's more of the problem.<br/><br/>You will have to find by yourself something to eat, materials and fuel to stay alive, to build yourself a home and to start building boats and weapons.<br/>The other players can be a curse in H2o, but they can also be a blessing as working with other survivors will give you the key to both safety and power.<br/><br/>H2o is still far from its final form, but we really wants to give a specific importance to the interactions between the players. Giving you the means to deploy large ships to fight as a team, merchant boats to trade...<br/>We plan to add a skill tree in the near future, so that each player in a group can choose a specific role. Such as scout, driver, gunner, or even a kind of doctor who could craft specific drugs to cure diseases and poisonings.<br/><br/>We want to develop this part of the game with the community, once that the classical structure of a survival game will be properly set, balanced and stable.<br/><br/><br/><br/><ul>PRESENT:<li>Multiplayer<br/></li><li>Open world<br/></li><li>Player Constructions<br/></li><li>Fuel &amp; Electricity<br/></li><li>Crafting &amp; Resource processing<br/></li><li>Fishing, Farming, Gathering<br/></li><li>In-game map<br/></li><li>VoIP<br/></li><li>Clan system<br/></li><li>Vehicles<br/></li><li>Aircrafts<br/></li><li>Ships<br/></li><li>Modular TurretsCOMING DURING EARLY ACCESS:</li><li>Advanced exploration (especially underwater)<br/></li><li>a bigger map (sized for 80 players and not ~40 as currently)<br/></li><li>More wild life, Gathering and advanced farming<br/></li><li>Ghosting &amp; Random events<br/></li><li>Skills &amp; Specialisation<br/></li><li>Diseases &amp; Injuries management<br/></li><li>Bounty system<br/></li><li>Battle Mode (coming as a free update at the end of the early access)<br/></li><li>And many others... (Check Trello!)</li></ul>Follow the development:https://trello.com/b/kDBzUl9h/hide-hold-out-h2o-dev", "metacritic": null, "released": "2016-04-09", "tba": false, "updated": "2019-08-23T12:12:39", "background_image": "https://media.rawg.io/media/screenshots/524/52467189dad71aa8b6a19ef870265917.jpg", "website": "http://h2o-game.net/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 5}, "playtime": 14, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 451, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux", "macOS"], "developers": ["Red Abyss Software"], "genres": ["Action", "Adventure", "Simulation", "Massively Multiplayer", "Indie"], "publishers": ["Red Abyss Software"], "esrb_rating": null}