{"id": 12398, "slug": "street-of-sanctuary-vr", "name": "Street of Sanctuary VR", "name_original": "Street of Sanctuary VR", "description": "BackgroundSince several months ago, an insurgent group called “Futealer” have made a lot attacks on federal facilities. Your squad is sent to Sanctuary Street to stop them from approaching a crucial science facility called Neb Lab. This won’t be a difficult task for seasoned soldiers like you. But as closer as they approach, you notice an unknown power within them. In the same time, you find what you are protecting is no simple but a secret project, leading you to a place where you’ve never heard about…FeaturesHave you already tired of the typical VR shooting games in which you just stand still to defense endless enemies? Street of Sanctuary will give you a more exciting mobile shooting experience on VR.<br/><br/>In the game, you need to find a proper place to give your enemy a critical attack. You also need to find obstacles to hide behind to get a temporary recovering under fierce battle. You can turn things around by placing obstacles wisely to protect you or block enemy.<br/><br/>Some valuable pickups and strategic points are helpful for your victory. They may allocate where fierce battle occurs. Pick them up under that circumstance would be a proof for your courage and agility.<br/><br/>In multi-player games (Cooperate PVE or PVP), you got your friends besides. You can hear their clear voices, cover them when they rush and heal them from injuries. It is a kind of reality you never imaged.<br/><br/><ul><li>Guns and grenades simulate real experience.</li></ul><br/><ul><li>No more turret defense, we provide you real mobile shooting now. (by a mechanism called ‘remote movement’, which brings you no side effects like dizzy)</li></ul><br/><ul><li>Various shapes of terrain in battlefield, you can even build your own barricade.</li></ul><br/><ul><li>Various mission objects: street fighting, convoy, and in the future, capturing flag, etc.</li></ul><br/><ul><li>As Valve announced that the SteamVR would support Mac &amp; Linux in few months, we will add supports for those platforms as well.</li></ul>", "metacritic": null, "released": "2017-01-14", "tba": false, "updated": "2019-08-28T22:13:18", "background_image": "https://media.rawg.io/media/screenshots/f18/f187d986cc2d087a67185fd6516a0603.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 263, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MoyeVR"], "genres": ["Action", "Indie"], "publishers": ["MoyeVR"], "esrb_rating": null}