{"id": 124032, "slug": "jesus-and-legion-the-dead-scrolls", "name": "Jesus And Legion, The Dead Scrolls", "name_original": "Jesus And Legion, The Dead Scrolls", "description": "<p><strong>Created this game over the weekend after the PDJam was extended, hope you enjoy it!</strong></p><p><strong>The Gospel of Mark</strong> describes the following encounter in the country of the Gadarenes:</p><p>Two demon-possessed men coming from the tombs met him. They were so violent that no one could pass that way. “<em>What do you want with us, Son of God?</em>” they shouted. “<em>Have you come here to torture us before the appointed time?</em>”</p><p>And Jesus asked the man, \"<em>What is thy name?</em>\" </p><p>And he answered, saying, \"<em>My name is <strong>LEGION</strong> for we are many.</em>\"</p><p>After it's extended exile in the lands or mortals, LEGION had grown weak, and feared the glory of Jesus. Thus LEGION asked for forgiveness from the son of God, and begged to be spared and sent back to the Abyss. Jesus casts the demons out of the man, granting their request, and allowed them to poses a herd of pigs. The pigs then drowned themselves in the Sea of Galilee.</p><p>...but that was not the last Jesus would see of LEGION...</p><p>... In a forgotten part of The Dead sea scrolls, it talks about their second impact ...</p><p>When Jesus was on his way to Jerusalem, Jesus traveled along the border between Samaria and Galilee. As he was going into a village, ten men who had leprosy met him. They stood at a distance and called out in a loud voice, “<em>Jesus, Master, have pity on us!</em>”</p><p>At that time the ground shook and roared </p><p><strong>\"<em>Legio mihi nomen est, quia multi sumus.</em>\"</strong></p><p>Follow @gk_xtactics for Updates and news!</p><p>(* This is An Android Game, will submit to GooglePlay and AppStore (iOS) soon)</p>", "metacritic": null, "released": "2014-05-26", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/3b2/3b200360529c88b4b57281051f0ca72d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 44, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["FugueNation"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}