{"id": 12408, "slug": "satellite-rush", "name": "Satellite Rush", "name_original": "Satellite Rush", "description": "WELCOME TO THE SATELLITE!<br/><strong>Your life now depends on how much of a good show you can put up!</strong><br/><br/>Satellite Rush is a fast-paced sci-fi top-down shooter with pixel art graphics and Roguelike elements.<br/><br/>Take control of an abducted office worker and blast through Satellite Moebius, an intergalactic space arena/Reality TV stage filled with vicious aliens, robots programmed to clean (or kill), and a (not always so) cheery audience.<br/><br/>Can you survive the worst day of your life and find your way back home?PLEASE THE AUDIENCE!<br/>To survive in this vicious arena, you better make the crowd happy. Keep shooting stuff and giving them the bloodbath they've paid to see! They will throw valuable weapons for you if they enjoy the show.FEATURES<br/><br/><ul><li>Randomized corridor generation, because nobody would buy tickets for the same bloodlust twice;<br/></li><li>Permadeath, with a few persistent effects to trick you into thinking you have a chance - yes, we mean unlockables;<br/></li><li>A demanding audience and a lax security. They can throw stuff to you. Will you be able to keep them entertained?<br/></li><li>Boss fights and Upgrades, because what sort of entertainment wouldn't involve blowing up bosses and getting neat rewards?</li></ul>", "metacritic": null, "released": "2016-11-16", "tba": false, "updated": "2019-08-28T22:13:18", "background_image": "https://media.rawg.io/media/screenshots/fdf/fdfe675d8f333a9d43ea744ed651f85e.jpg", "website": "http://www.kimericlabs.com/SatelliteRush/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 116, "dropped": 1}, "playtime": 4, "achievements_count": 10, "ratings_count": 1, "suggestions_count": 361, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "Linux", "macOS"], "developers": ["Kimeric Labs"], "genres": ["Action", "Indie"], "publishers": ["Plug In Digital"], "esrb_rating": null}