{"id": 124029, "slug": "supermarket-madness", "name": "Supermarket Madness", "name_original": "Supermarket Madness", "description": "<p>Supermarket Madness is opening a new center in town, the same day as the black friday! And to celebrate that day, they are opening the inscriptions to their new contest.<br/></p>\n<p>Saving madness is their new brand contest, where 2-4 will be fighting to get as many sales as they can.</p>\n<p>One item at a time will be presented to the contestants, and they will have to find it and take it to the checkout. They only have 5 minutes to get as many sales as they can.</p>\n<p>Once the time is over the participant that has saved the most, will be the winner.</p>\n<p>HAPPY BLACK FRIDAY AND GOOD LUCK TO ALL OF YOU!</p>\n\n<p>This is my entry for the <strong>Search for a star Code Challenge</strong> by Grads in games.<br/></p>\n\n\n\n\n<p>The main objective of the game is to pick up the item sales and get them to the checkout, in your way to the checkout you will have to be careful with the other contestants as they can punch you to get your item.</p>\n\n\n<p>Once the sale is active, get close to an item and smash the  button until the green bar is full.</p>\n\n\n<p>During the game you will be able to knock out the other contestants by pressing  button, take advantage of your competitors by punching them!</p>\n\n<p>If you see someone that has taken the discounted item, just punch him and pick up the item.</p>\n<p>BE CAREFUL! When you are carrying an item, you cannot punch others!</p>\n\n<p>Once all the contestants are presented, you will have sometime to look at the supermarket.</p>\n\n<p>Then the next sale will be presented to the contestants and the discount will be applied to the item.</p>\n\n<p>Now is time for the contestants to search the item around the map, and once they find it get it.</p>\n<p>Once you get  it, TIME TO RUN TO THE CHECKOUT.</p>\n\n<p>Find the checkout, avoid other contestants, and just approaching the checkout the item fill be paid, and the money you have saved will be added to your score!</p>\n\n<p>The player who saves the most money, will be the winner!</p>\n\n<p>Twitter: https://twitter.com/Quemagalletas</p>\n<p>Webpage: http://www.mgonzalezal.com</p>\n<p>Linkedin: https://www.linkedin.com/in/mgonzalezal/</p>", "metacritic": null, "released": "2018-01-28", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/271/2717c61daf3d5552b6636793753ca7d7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 106, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Mikel"], "genres": ["Fighting"], "publishers": [], "esrb_rating": null}