{"id": 124138, "slug": "bribables-story-based-rpg", "name": "Bribables - Story Based RPG", "name_original": "Bribables - Story Based RPG", "description": "Welcome adventurers!!!\r\nBribables will be released early 2018 \r\n(Game is currently in Alpha early access)\r\nBribables is a story about corruption and good.  It is a single player, third person style computer game.  It is based on true stories and fantasy.\r\n<ul><li>An adventure based on real life corrupt politicians and some of the top leaders in our world.</li><li>Defeat or join <em>King Donald Dump</em> and bribable <em>King ‘Enrique Ñetas´ in their evil plans</em>.</li><li>Help build or destroy a wall between kingdoms.</li><li>Stop some leaders from destroying families and deporting our fellow travelers or help them out!!!</li></ul>\n<ul><li>Story rich game play, based on true stories and fantasy</li><li>Open world 3D environments (some levels are modeled off real world terrain)</li><li>Alternate ending based on player’s decisions</li><li>55 Story related quests (some unrelated quests and tasks)</li><li>Comedy</li></ul>\n\n\n<p>\r\n\tWe really need your feedback!!!  Please give us some of your time and tell us about any ideas, recommendations, likes and dislikes.\r\n</p>\n<p>\r\n\tThis is the only way that we can make this game better for you all.,,\r\n</p>\n<p>Bribables is now in Alpha and early access.  This version will be 60% off its final price and we will release updates every 10 to 15 days.  </p>\n<p>There is also a FREE DEMO version available at www.indiedb.com/games/bribable... </p>\n<p> </p>\n<p>   or at www.bribables.com/downloads if you want to try our game first.  The demo version showcases the first chapter of the story and some unrelated quests.  It has a lot of unexplored areas and does not include any of the main characters, like King Donald Dump, who is in the Early Access version.   </p>\n<p>\r\n\tIf you enjoy our game, please support us to make this game a reality. Stay tuned and subscribe to our newsletter in our website for information about us.  </p>\n<p>\n<br/>\n</p>", "metacritic": null, "released": "2017-05-06", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/621/621ab7fc3c54f6af5c38cfe916e96f3d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 272, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["rochasgames"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}