{"id": 12413, "slug": "scs-deorbit", "name": "SCS deORBIT", "name_original": "SCS deORBIT", "description": "<strong>The slow paced, depressing, hardcore, survival experience you've always wanted!</strong><br/><br/>SCS deORBIT is a non-linear, non-combat first person game with heavy reliance on exploration, a slight horror vibe, permadeath,  limited  saves and some puzzles. You wake up in a semi-destroyed space colony, power is out, oxygen is running low and you must make your way out by smashing, repairing, discovering alternate paths and improvising on the spot. Four story lines are intertwined but it is only up to you to discover what brought you here, and only up to you to get out alive.<br/><br/><strong>Key features</strong><br/><br/><strong>Organic:</strong> Every solution is the right solution!<br/><strong>Challenging:</strong> Navigate, repair, survive an extremely complex environment filled with tools that can help you, and paths that can doom you.<br/><strong>No hand holding:</strong> The tutorial will tell you everything you need to know, but after that you are on your own.<br/><strong>Just right:</strong> 3 difficulty modes, each changing the game drastically.The small print:Physics based smoke and destruction on ALL platforms from HD3000 , R9 280x to gtx 980.<br/>You can adjust the FOV without opening a menu.<br/>No mouse acceleration or smoothing.<br/>It is FPS unlocked so 30, 144 or 900, it's up to you.<br/>The HUD in surround/eyefinity stays in the center of the screen.<br/>Reduced HUD  mode for more immerse experience.<br/>Free updates, forever!", "metacritic": null, "released": "2015-08-17", "tba": false, "updated": "2019-08-28T22:13:18", "background_image": "https://media.rawg.io/media/screenshots/327/327c00373dadd8500282ec36633e998f.jpg", "website": "http://steamcommunity.com/app/337700", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 5}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 328, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["Zero Dollarz"], "genres": ["Action", "Adventure", "Simulation", "Indie"], "publishers": ["Zero Dollarz"], "esrb_rating": null}