{"id": 124368, "slug": "botengineer", "name": "BotEngineer", "name_original": "BotEngineer", "description": "<p>BotEngineer is a game about building and programming bots. You can either let them battle fully automatic if you give them some more advanced programs, or just control them yourself using a few basic programs. This game was inspired by Robocraft and Gladiabots</p>\r\nEditor\r\n<ul>\n<li>select bots by left clicking at their holograms on the side of the editor</li>\n<li>right click on holograms to rename them</li>\n<li>select an empty slot to create a new bot</li>\n<li>you can move the bot around with the arrow keys and [ , ][ . ]</li>\n<li>Q to select the block you want to place</li>\n<li>scroll wheel to rotate the block you have selected</li>\n<li>press P while aiming at an attachment to open its program</li>\n<li>press T to enter the test world</li>\n<li>press C to select a color (hold left control to select the glow color)</li>\n<li>press left control + middle mouse to pick a color from an already colored block</li>\n<li>middle mouse click to color a block or attachment</li>\n</ul>\r\nProgramming\r\n<ul>\n<li>\n<p>press alt to create a new node</p>\n</li>\n<li>\n<p>you can enter any math expression into one node</p>\n</li>\n<li>\n<p>available variables:</p>\n<ul>\n<li>speed (current speed in m/s)</li>\n<li>time (time since start of the game in s)</li>\n<li>moveX, moveY, moveZ (current direction the bot moves)</li>\n<li>currentX, currentY, currentZ (position of the current attachment relative to the bot)</li>\n<li>enemyX, enemyY, enemyZ (position of the next enemy)</li>\n<li>health (current health, range from 0 to 1)</li>\n<li>k1, k2, ... k9 (either 0 or 1 depending on if the key is currently pressed. Including number keys and numpad)</li>\n<li>mouseR, mouseL (0 or 1 representing the mouse buttons)</li>\n<li>mouseX, mouseY, mouseZ (current target of the mouse)</li>\n<li>controlling (1 if the bot is being controlled over third person, else 0)</li>\n<li>kw, ka, ks, kd, kq, ke, kspace, kshift, kctrl (only available if the bot is being controlled over third person or stationary camera)</li>\n</ul>\n</li>\n<li>\n<p>there are also functions to make some things easier, including functions of the math library (full list below)</p>\n</li>\n<li>\n<p>to allow a node to control a variable of the attachment, you need to define the output.     to do that, click on the desired output on the right, then click on the desired node. it should automatically update the id on the output name.</p>\n</li>\n<li>\n<p>to delete nodes, click on them and press delete</p>\n</li>\n</ul>\r\nList of available math functions\r\n\r\nsin         floor       round       log10\r\ncos         ceil        atan2       tanh\r\ntan         max         atan        cosh\r\nabs         min         acos        exp\r\nasin        sinh        sqrt        log\r\nsign\r\n\r\nadvanced functions\r\n<ul>\n<li>\n<p>equals, greater, smaller</p>\n<p>functions for comparing two values, they return 1 if the condition is met</p>\n</li>\n<li>\n<p>set</p>\n<p>takes two numbers as parameter and creates or sets global variables.\r\nfor example: set(3,10) sets the variable v3 to 10.\r\nthis works with any numbers. those variables will be accessible on any other attachment of the current bot</p>\n</li>\n</ul>\r\nTest World\r\n<ul>\n<li>press R while aiming at a bot to select it for remote control</li>\n<li>press V to switch between third person control and free camera (only works if there is a bot selected for remote control)</li>\n<li>press C to fix the camera's position and let it follow the current bot</li>\n<li>Go to the central building in the test world and select the bot you want to spawn just like in the garage</li>\n<li>click on the selected bot again to spawn it</li></ul>", "metacritic": null, "released": "2017-12-31", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/1eb/1ebedc92a03ac1f0b79b2dea50bdc6f9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 13, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["TimoHo"], "genres": [], "publishers": [], "esrb_rating": null}