{"id": 124326, "slug": "lost-faith-last-dairy", "name": "Lost Faith: Last Dairy", "name_original": "Lost Faith: Last Dairy", "description": "<p>Lost Faith is story about group of friend have fun with their life. But there always imposter and enemies attack them. At same time inside the group there have a lot of scenario for fighting to betraying own friend. After long way they start to lost their faith on everyone. Someone have to find the truth and end it!<br/></p>\r\nthe main character of Lost Faith\r\n<p>Lost Faith : Last Dairy is main event future You or Zahir have to help Mqrsh Squad find their friend or leader back with solving, find and fight for the secret.<br/>At same time discover secret story of other character<br/></p>\r\nthe main character of Lost Faith\r\n<p>And learn what happen to them or seek deep into darkness of their past!<br/><br/><br/>Take every chance of choice for knowing some secret and story, It can lead to good or bad decision!<br/><br/><br/>Secret are everywhere! learn all of it and understand the reason behind it!<br/></p>\n\n<p>60 % story in the game is real conversation through the internet (Chat conversation) base on experience </p>\n<p>i'm faeiz 16 y/o have dream making story and games... And now it here... My family have problem so i'm making this as study/work... But enjoy the game.  only thing i want is people read and understand my artwork and story freely. </p>\n<p>here link to my Patreon (In-case want to donate me)</p>\n<p>My Patreon<br/></p>", "metacritic": null, "released": "2017-12-14", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/879/879ed8f72b2662e2496781d6cec71cf7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 123, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["fqeiz"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}