{"id": 124451, "slug": "bit-pilot-itch", "name": "Bit Pilot (itch)", "name_original": "Bit Pilot (itch)", "description": "<p>BIT PILOT</p><p>---</p><p> by Cat Butt Games</p><p>keegan@catbuttgames.com</p><p>---</p><p>Summary</p><p>---</p><p>Bit Pilot is a Google Cardboard game. You will get the most realistic experience from Bit Pilot by using a Google Cardboard viewer. However, due to the low-fidelity nature of Bit Pilot's graphics, you can also just hold the phone up near your face and rotate it, if you want.</p><p>You are an ace freighter pilot operating a spacecraft in the asteroid belt. Your goal is to traverse the asteroid belt without colliding with any asteroids. Your ship is equipped with state-of-the-art Cold War-era radar technology. Your ship moves in the direction that you are currently facing, at a rate that increases with time. Your state-of-the-art radar display will flash to indicate your proximity to an obstacle in the forward direction: more rapid flashes mean an obstacle is closer to you.</p><p>You are scored by straight-line distance travelled from your starting point. When your ship collides with an asteroid, the screen will flash rapidly, and then blink out the digits of your score. (One long flash indicates a zero, otherwise the number of short flashes corresponds to the value of the digit.) </p><p>Tap the screen to begin, or to play again after your score has been displayed.</p><p>---</p><p>Installation</p><p>---</p><p>The game can be installed on any Android phone running Android 5.0 or greater. Just install the .apk file. (Your phone may need to be set to allow packages from unknown sources in order to do this, unless you've somehow downloaded this game from the Google Play Store.)</p><p>---</p><p>Notes</p><p>---</p><p>This game was created for the Bit-Jam (https://itch.io/jam/bit-jam). Rules alllowed for a 1x1 pixel display (scaled to any resolution) and two-colors. We hope that, while Bit Pilot is a virtual reality game (and thus a little more complicated than just 1x1 discrete pixels), it is still in line with both the spirit and rules of the game jam. If you disagree, or have any other thoughts about Bit Pilot, please feel free to send us an e-mail at keegan@catbuttgames.com.</p><p>-----</p>", "metacritic": null, "released": "2016-04-25", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/bd3/bd3752e264b2a88f53a75cabd2ee5112.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 2, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Cat Butt Games"], "genres": ["Action"], "publishers": [], "esrb_rating": null}