{"id": 124505, "slug": "bloody-wicked", "name": "Bloody Wicked", "name_original": "Bloody Wicked", "description": "<p>You step into the shoes of a female-protagonist who really is a amalgamation of Snowwhite's \"Wicked Queen\", Oz's \"Wicked Witch\" and the folklore figure \"Bloody Mary\". This should turn out (once it's done) to be a classic FPS-powertrip with puzzles an mechanics revolving around Mirrors.</p>\n<p>The current prototype is Linux only, since that's where I am at. It's also at such an early stage, that my time is probably better spent with actual development, than with building and dependency-management.</p>\n<p>There will be Windows and Mac versions, once a real milestone comes along - feel free to follow me, to get notifications when that happens.</p>\n<p>This has been originally made for Mirrorgamejam. I'm in the process of rebuilding the original core and expanding on the concept.</p>\n<p><strong>Instructions</strong>:<br/></p>\n<p>WASD for directional controls, Space for jump, numbers activate different spells, which are fired by pressing the left MouseButton. At the moment, there is only 1, which throws a \"Placeholderball\"  There seems to be a glitch with correctly reading the number-keys. Until that's fixed, \"Q\" activates the \"Placeholderball\".</p><p> Right MouseButton interacts with things. Interactable things are indicated via a cyan/blue frame that shows up when you're close enough. At the moment the only interactable things are \"Mana-potions\" around the landscape.</p><p>Escape quits to desktop immediately; there are no real failstates yet.</p>", "metacritic": null, "released": "2017-06-23", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/a77/a779d221747759c1d26da3bb60b61f95.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 109, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux"], "developers": ["Markus Glanzer"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}