{"id": 124697, "slug": "escape_", "name": "Escape_", "name_original": "Escape_", "description": "<p>BE SURE TO READ ALL OF THE DESCRIPTION! :D\r\n</p>\n<p>You’re trapped in a room with only one visual way out; The door.. But it’s locked.. How will you escape?\r\nAll you see in the room is a computer, some desks, random objects, a note, and a safe..\r\nYou resort to the computer and try your hardest.. After your escape you stumble upon something unexpected..</p>\r\nGame Information\r\n<p>[MORE IMPORTANT INFO BELOW THIS IMAGE, READ CAREFULLY!]\r\n</p>\r\nTime\r\n<p>Time is VERY important in this game, since you only have until the end of Day 3 to complete your objective, you must be very careful and quick.</p>\r\nPower System + PowerBox Mini-Game\r\n<p>The powerbox is located next to the newspapers, it has a green light when its on, and a red light when its off.\r\nWhen the power goes out, you will have to do a mini-game to turn it back on. In this mini-game you must type the code you see on screen EXACTLY as you see it. When the power is out, you cannot use the computer. You will lose a lot of time if you aren’t quick!</p>\r\nCompile Error Mini-Game\r\n<p>The Compile Errors show as Dark Green in the Compile Error Minigame, click the X next to all the dark green “code”. This mini-game happens randomly when cracking a hash, be quick! You have a very small amount of time to complete it! Losing this mini-game will cause you to lose <strong>4 hours</strong>.</p>\r\nCracking a Hash\r\n<p>If a crack “fails”, you either typed the hash wrong, OR that was a fake hash and not one of the real ones. the strings of random numbers &amp; letters are the hashes, You want to crack these.\r\n<strong>example hash: 77gh46f</strong>\r\nthis means nothing, but in the computer if you type “crack HASH” it will crack it, revealing its real value, replace HASH with the random string of numbers &amp; letters, <strong>this example you’d type: “crack 77gh46f”</strong></p>\r\nHash info and the Code List\r\n<p>an actual hash &amp; it’s actual value will be added to the code list once you crack it(The code list shows only when you’re in the Computer or Safe menu, it’s at the bottom left of the screen and will display all the hashes you have found along with their actual value), once you get them all, put them together to open the safe using the 4-digit code you got. they are formatted like this in the code list:</p>\n<p><strong>ORDERNUMBER - HASH - ACTUALVALUE</strong></p>\n<p>The Database hash will show the same way once you find the notepad that has the hash on it, except it will be slightly different;</p>\n<p><strong>DB - HASH (example: DB - y675hgghf)</strong></p>\n<p>then, once you crack it, it will show like; </p>\n<p><strong>DB - HASH - ACTUALPASSWORD (example: DB - y675hgghf - Password123)</strong></p>\r\nExample Hashes\r\n<p>(the database hash DOES NOT count towards the safe, that’s only to login to the database to get the hashes for the safe)</p>\n<p><strong>1 - 86ht6f3 - 3</strong></p>\n<p><strong>4 - 88gh5fs - 1</strong></p>\n<p><strong>2 - 7gns43f - 6</strong></p>\n<p><strong>3 - 90ng6sf - 0</strong></p>\n<p>you’d put these together by their ORDERNUMBER, so this example would be: 3601 to unlock the safe</p>\n<p>Sorry for such a long description, I didn’t have time to implement a tutorial into the game, so I used the description to explain everything you should know about the game. Enjoy!!</p>\r\nTools Used:\r\n<ul><li>Unity</li><li>Aseprite</li><li>Paint.NET</li><li>Visual Studio</li><li>Notepad++</li><li>Language used: C#</li></ul>", "metacritic": null, "released": "2018-04-24", "tba": false, "updated": "2019-08-28T23:23:30", "background_image": "https://media.rawg.io/media/screenshots/284/284c30eb7dcbf873a609d50253d5e99f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 104, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Web"], "developers": ["Steel_Dev"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}