{"id": 12468, "slug": "greenwood-the-last-ritual", "name": "Greenwood the Last Ritual", "name_original": "Greenwood the Last Ritual", "description": "Greenwood The Last Ritual is an adventure game with isometric viewpoint where you will play as an envoy of Vatican. Use magic of pentagrams to break the Curse on the Valley. At the same time you will have to try to resist that Curse yourself and make it out alive.<br/>\n<br/>\r\nThe game takes place in alternate medieval Europe. It has been more than five hundred years since the end of the Age of Darkness and creation of the Barrier. The horrors of the war with demons are long forgotten, the order of Paladins has become a great legend and the Inquisition, that has cleared Europe from evil, is now the head the Church.<br/>\n<br/>\r\nGreenwood Valley is one of those numerous distant counties living far away from rowdy central highlands. However, the sudden illness of a young Countess disturbs the peace of the mountain valley. During her treatment it turns out that she is possessed by an unknown demon. The Inquisitor of the Valley attempts to help the Countess and performs an exorcism ritual that resulted in failure.  Now Greenwood is cursed with death and madness. <br/>\n<br/>\r\nYou play as an envoy of Vatican that is trying to break the curse. Explore the county, communicate with the spirit world, exorcise evil and discover the secrets of the Valley. Don’t forget about your own survival and state of mind. The magic of pentagrams and light are your only protection against the Curse<br/>\n<br/>\r\nKey features:<br/>\r\n- A mystical adventure into the valley’s open world;<br/>\r\n- Explore the world, collect items, solve puzzles;<br/>\r\n- Learn and use the magic of pentagrams; <br/>\r\n- Communicate with spirits;<br/>\r\n- Exorcise the Evil;<br/>\r\n- Survive from the ancient curse;<br/>\r\n- Use light to protect yourself from the Curse;<br/>\r\n- Find a way to complete the exorcism.", "metacritic": null, "released": "2017-01-19", "tba": false, "updated": "2019-09-17T11:52:17", "background_image": "https://media.rawg.io/media/screenshots/9ec/9ec035bf18d556239bd636d81f464f20.jpg", "website": "https://www.facebook.com/greenwoodgame/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 123, "toplay": 1, "dropped": 1}, "playtime": 3, "achievements_count": 11, "ratings_count": 1, "suggestions_count": 410, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "macOS", "Linux"], "developers": ["AO2Game"], "genres": ["Adventure", "Indie"], "publishers": ["AO2Game"], "esrb_rating": null}