{"id": 12464, "slug": "yore-vr", "name": "Yore VR", "name_original": "Yore VR", "description": "<strong>DISCLAIMER:</strong> THIS GAME IS IN EARLY ACCESS AND REQUIRES A HTC VIVE TO PLAY. PLEASE DO NOT PURCHASE IT UNLESS YOU HAVE A VIVE AND WANT TO ACTIVELY SUPPORT THE DEVELOPMENT OF THE GAME AND ARE PREPARED TO HANDLE A FEW ISSUES. <br/><br/>Yore VR is an open world sandbox game built from the ground up in VR for the HTC Vive. If you enjoy resource gathering, hunting, crafting and a simpler time, you will find plenty to do in Yore VR. With two game modes, you can practice forging or start in the open world with nothing but the clothes on your back. Blacksmithing fans will find over 40 different components, blades, hilts, crossguards and pommels to use for crafting. <br/><br/>Before you can get to work in the shop, you'll have to find wood for your fire and ore for the smelter so pick up your trusty pick-axe and venture out in search of iron. <br/><br/>If weapons are your thing, earn gold to unlock a virtual arsenal of medieval weapons.  Starting with 4 unique crossbows and a bow we will be introducing dozens of different weapons. Hone your skills in the shooting range or a variety of other areas meant to test your skill.  <br/><br/>~It’s not about escaping your life, it’s about rediscovering a simpler time.<strong>Key Features:</strong> <br/><ul><li> Open world room-scale experience designed for the HTC Vive<br/> </li><li> Custom locomotion systems offering three options for movement (Teleport, Point and Walk, D-Pad movement with VR \"Sick No More\" feature)<br/> </li><li> Simulations of hewing trees and collecting wood<br/> </li><li> Deer Hunting of responsive AI<br/> </li><li> Blacksmithing, smelting, mining and collecting ore<br/> </li><li> Archery range with 4 types of Medieval Crossbows and 1 Bow<br/> </li><li> Archery games ranging from simple shooting gallery to archery juggling<br/> </li><li> Tool belt for resource gathering <br/> </li><li> Potential future activities such as Co-op MP, herb gathering, alchemy, melee combat, dungeons and more!</li></ul>", "metacritic": null, "released": "2016-10-24", "tba": false, "updated": "2019-08-28T22:13:16", "background_image": "https://media.rawg.io/media/screenshots/232/23295e71a2b12682e4c56f59ffbf8d09.jpg", "website": "http://www.playyore.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 117}, "playtime": 1, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 497, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Tectonic VR"], "genres": ["Action", "Adventure", "RPG", "Simulation", "Indie"], "publishers": ["Tectonic VR"], "esrb_rating": null}