{"id": 12465, "slug": "blade-bones", "name": "Blade & Bones", "name_original": "Blade & Bones", "description": "<strong>Discover a tale long lost in our past. Seven swords need to be found in this Metroidvania adventure where you will discover ancient secrets and fight with an intense combat system that rewards players for their skills and knowledge.</strong><br/><br/><ul><li> <strong>Lore</strong> – First, Niro cried and it created this world. Then he cried again and created the Orins. They defy him once and, with furious anger, he then took their voices away.This was the great sin and now the first seven swords are forever lost in this world. It’s necessary to find them in order to defy him again. Such a task can only be completed by the last seven Orins though, who still search for them.<br/><br/></li><li> <strong>Dynamic Combat</strong> – Using light and heavy attacks with great precision and six different styles, the combat system heavily relies on timing and patience. This intensive skill based system is supported by the procedural generation of swords and by a diverse range of enemies and bosses. Attacks can be combined with roll movements and the use of ancient relics, as well as dynamic body transformations called Kuros, allow even more diverse gameplay.<br/><br/></li><li> <strong>Exploration Elements</strong> – Ancient relics allow the player to uncover secret weapons and life fragments to better support player combat capabilities. Many relics, secrets and locations are totally optional and can only be found by extensive search into the game lore. After a brief introduction, the player is free to approach any of the seven legendary swords through the way that seems to fit best. The entire map is open for him to unravel. The map is created with many hidden shortcuts and secret passages to forbidden lands that can only be used in a right time of the day or with the correct Kuro.</li></ul>", "metacritic": null, "released": "2016-11-29", "tba": false, "updated": "2019-09-17T11:04:00", "background_image": "https://media.rawg.io/media/screenshots/d5d/d5d48d9814538f06de44362c81e02e28.jpg", "website": "http://bladebones.coffeeaddictstudio.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 9, "owned": 165, "toplay": 1, "dropped": 1}, "playtime": 3, "achievements_count": 33, "ratings_count": 3, "suggestions_count": 439, "game_series_count": 0, "reviews_count": 3, "platforms": ["PlayStation 4", "PC"], "developers": ["Coffee Addict Studio", "COFFEE ADDICT STUDIO DESENVOLVIMENTO DE PROGRAMAS DE COMPUTADOR"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["Coffee Addict Studio"], "esrb_rating": null}