{"id": 124733, "slug": "bun-dun", "name": "Bun-Dun", "name_original": "Bun-Dun", "description": "<p>Your name is Bun-Dun. You are a robot. You are God.<br/></p><p>You have one task. You need to create the universe. <br/><br/>In <em>Bun-Dun</em>, players take control of an adorable little robot as they fly across the universe, building everything from the ground up. In the game, you will play through seven stages, collecting good energy while avoiding the bad. It sounds easy, but there's a catch: You have a time limit. <br/><br/>When you complete Story Mode, you will unlock two new game modes: Creation and Time Trial. In Creation Mode, you collect good and bad energies to form the world the way you want it. There are 7 endings to discover. In Time Trial, you race against time to rack up the highest score possible. <br/><br/><strong>Controls: </strong></p><p>Arrow keys move Bun-Dun <br/>M button mutes and unmutes the music <br/><br/><strong>FAQ</strong>:</p><p>http://magnesiumninja.wordpress.com/2011/02/15/bun-dun-faq/ <br/><br/>Thanks for supporting our game! We hope to see you in the future!</p><p><em>Original release date: February 13, 2011</em></p><p><strong>Post-mortem Commentary:</strong></p><p><em>Bun-Dun</em> was developed for the <em>Game Jolt Invention Contest, </em>where it placed 2nd of 13 entries. We wanted to evoke the feeling of reading a children's novel, implementing the <em>Invention</em> theme with the invention of the universe.</p><p>It was the first game we developed with the current team members (Chris Klassen, Avash Islam and Justin Wang), and it was made in about two weeks. Special thanks to <strong>Alexandr Goncharuk </strong>at https://soundcloud.com/darkcloudmusic for composing the soundtrack!</p>", "metacritic": null, "released": "2014-12-24", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/4c8/4c86a393e67a528b0678634b966b5513.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 36, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Magnesium Ninja"], "genres": ["Action"], "publishers": [], "esrb_rating": null}