{"id": 124838, "slug": "blue-itch", "name": "blue. (itch)", "name_original": "blue. (itch)", "description": "<p><em>blue.</em> is the part puzzle game, part visual novel, story of Violet, a young Cubie. Cubies and full grown Cubes live in a colorful, gem-like, world mined out of pink and blue stones. You play as Violet grows up in the Commons with the rest of the Cubies, overlooked by a Matron. As time goes on you learn when it means to grow up and about the world around you. Sometimes growing up isn't easy, and sometimes figuring out what being a Cube isn't as straightforward as you thought.<br/></p>\n<p>Features:<br/><br/></p>\n<ul><li>A Bright and Intricate World</li></ul>\n<p>Navigate the bright and varied mined out world of Cubes and Cubies. Start in the rich pink landscape of the Commons, but slowly discover the world outside your home – the multicolored Market, and beyond, the blue landscape of the Centre. What else can you find around the next corner?</p>\n\n<ul><li>A Varied Cast of Characters – Friends and Foe</li></ul>\n<p>From your childhood friends to your caretaker, Matron Merry, from the shop owner Melrose to the gruff Cobalt, it seems like everyone in your world will have an opinion on what you do or say. Navigate this social world and figure out who you can trust; who do you go to when you need help the most?</p>\n<ul><li>Ever Changing Mechanics</li></ul>\n<p>Just when you think you’ve gotten used to how to navigate the world, things can change. Can you persevere and complete your goals no matter how difficult it gets?</p>\n<ul><li>A Fun, if a Bit Random, Minigame</li></ul>\n<p>Advance in the game by playing a simple but compelling mini game that keeps things interesting with a heavy randomized factor. It’s never quite the same game twice.</p>", "metacritic": null, "released": "2018-03-21", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/e51/e5172e227ba313e6280f366c83cb56ef.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 18, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["J. Appallonia Hardner"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}