{"id": 124984, "slug": "mimic-ludum-dare-35", "name": "Mimic - Ludum Dare 35", "name_original": "Mimic - Ludum Dare 35", "description": "<p>Mimic is a game inspired by the real life sea creature, the Mimic Octopus! The Mimic Octopus literally shape-shifts in real life to take on the appearance of other sea creatures.</p><p>Tools Used:</p><p> - Eclipse + Java</p><p> - My own Game Engine, Retrojump</p><p> - Photoshop</p><p> - Audacity</p><p>This game was made initially for the Compo, but I had technical difficulties at the last second. The file was initially 300 megabytes, and it wasn't playtested yet. Also, it wasn't the easiest to run. I've fixed those problems.</p><p>For the most part.</p><p>I haven't tested the game on OS/X or Linux. This is because I only have Windows computers, so had no way to test it on any other OS. Also, some Windows computers are having a problem where they're getting an exception.</p><p>Because of this, please, please tell me which OS you're on when commenting. If you have an error, please let me know.</p><p>Now on to everything else...</p><p>This game was made by one person, from scratch (except for a self-made game engine and fonts). The game itself took 40 hours to make, and it's proven to be incredibly difficult. I challenge you to play through the whole thing.</p><p>Good luck.</p><p>If you, for some reason, don't want to have the full incredibly incredible, awesomely awesome, amazingly amazing, stunningly stunning experience of Mimic, please, at least look at the soundtrack and skim through it. My better tracks were later in the game.</p><p>You can contact me through Twitter (@chaseplays_)</p><p>I hope you enjoy!</p>", "metacritic": null, "released": "2016-04-21", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/7a6/7a6d54d90871f5ad2b6e0b8f0861fd4f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 5, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC", "macOS"], "developers": ["Chaseplays"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}