{"id": 12492, "slug": "pristine-world", "name": "Pristine world", "name_original": "Pristine world", "description": "Pristine world is a tower defense game which takes place in a magic world where only player stays between precious magical crystals and darkness.<br/>\n<br/>\r\nIn the Galaxy far far away existed one world. It was reach with magic and resources, it was wonderful and beautiful. Many different creatures lived there: dwarves and elves, elementals and giants. There lived an undead race also because of high magical activity.<br/>\n<br/>\r\nAll was good and everybody lived in harmony. And with undead too. But once appeared one crazy ruler and his name was Alastor. He wanted to destroy all undead and began The Great Crusade. He owned secrets of powerful defensive structures, that allowed to create fortresses everywhere he wanted for hours. Alastor and his armies nearly won this war, but in the last battle one of the greatest undead mages, Ancient Lich, opened portal to the world of Darkness. Dark creatures rushed into bright new world and owned many souls of mortals, including mages, warriors, generals. Number of simple citizens they enslaved was impossible to count.<br/>\r\nThere wasn't many people who rescued. They went into another world: grey and poor for resources and magic. <br/>\n<br/>\r\nAfter 20 years of attempts to survive heirs of Alastor decided to return to their homeworld and to check what happens there. Maybe dark spirits faded away and people freed from their slavery?<br/>\n<br/>\r\nYou are one of this heirs and it depends on you if your people can survive and return home or it will be lost in the Grey world. But you are not alone. Ancient knowledge is with you and sorceress Irele and her familiars Shincy will help you in you travel. <br/>\n<br/>\r\nChoose a race, use towers according to your play style and modify them. Take abilities that you want. Save Pristine World from Hordes of Darkness.<br/>\n<br/>\r\nYou will have access to:<br/>\r\n-Building labyrinths of towers<br/>\r\n-Several races<br/>\r\n-Many neutral towers, which you can build playing with any race<br/>\r\n-More than 30 tower modificators with different rarity and power<br/>\r\n-Many different spells<br/>\r\n-Level modificators which make levels that were already passed new and challengeable<br/>\r\n-Cute familiars Shincy who won't let you get bored.<br/>\r\n-Active development team who will communicate with game society. <br/>\n<br/>\r\nDefend The Pristine World and give all races an opportunity to return to their home.", "metacritic": null, "released": "2016-07-09", "tba": false, "updated": "2019-09-17T10:18:18", "background_image": "https://media.rawg.io/media/screenshots/242/2428f8b3671734fd2bacb2330f353b64.jpg", "website": "http://lunisky.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 97, "toplay": 1}, "playtime": 3, "achievements_count": 26, "ratings_count": 4, "suggestions_count": 247, "game_series_count": 0, "reviews_count": 4, "platforms": ["PC"], "developers": ["Lunisky studio"], "genres": ["Action", "Strategy", "Casual", "Indie"], "publishers": ["Cubic Pie"], "esrb_rating": null}