{"id": 125075, "slug": "chaos-shell", "name": "Chaos Shell", "name_original": "Chaos Shell", "description": "<p>\r\n\t\t\t\t\tIn Chaos Shell, a top-down shooter, you are in a constant struggle \r\nto maintain possession of the single weapon in the game: the Battle \r\nBall. The Battle Ball will allow you to defeat your enemies, but without\r\n it you are powerless. Skilled players will find ways to use the Battle \r\nBall to inflict the most damage possible, to as many enemies as \r\npossible. Chaos Shell features several characters, each with unique \r\nabilities which will affect the behaviour of the Battle Ball.</p><p>\r\n\t\t\t\t\tChaos Shell has three game modes:<br/>\r\n                                        - Single-Player Campaign<br/>\r\n                                        - Multiplayer Mode<br/>\r\n                                        - Survival Mode\r\n\t\t\t\t<br/>\n</p><p>\r\n\t\t\t\t\tIn the Single-Player Campaign, you will come up against a variety \r\nof enemies which require very different strategies to defeat. Destroy \r\nall the enemies in one level to progress to the next - this mode is \r\nabout knowing your environment and using it to your advantage.\r\n\t\t\t\t</p><p>\r\n\t\t\t\t\tMultiplayer Mode is fast-paced, tactical, and skill-intensive. \r\nAfter selecting from the roster of unique characters, up to four players\r\n will fight for control of the Battle Ball. Wreck havoc on your \r\nopponents with your character's special abilities!</p><p>\r\n\t\t\t\t\tSurvival Mode features procedural-generated levels, so it's new \r\nevery time you play it. You'll need to defeat as many enemies as you can\r\n before you find yourself overwhelmed. This mode is difficult and will \r\nrequire the skill of an advanced player to master.\r\n\t\t\t\t</p>", "metacritic": null, "released": "2014-03-08", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/324/3241c36fc37fdd0bcc08e284a4b05949.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 37, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Virtual Escape Games"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}