{"id": 125054, "slug": "rest-in-beer", "name": "Rest In Beer", "name_original": "Rest In Beer", "description": "<p><strong>[TO PLAY WITH TWO PLAYERS : PRESS START]</strong><br/></p><p>You're Beer Bob, and your job is to keep the brewery at night. But some annoying customers really won't leave the place -worse, they even try to steal your barrel!</p><p>Get rid of them by pushing them in the pool of beer down the platform, using your beer-gun, beer-grenades, beer-rockets or other various weapons you're randomly given when you launch the game!</p><p>You can play with a friend:</p><p>- Player 1 plays with keyboard + mouse. (ESDF or arrows to move, mouse to direct, left click for main weapon, right click for secondary weapon)<br/>- Player 2 plays with controller (LB or A for main weapon, RB or X for secondary weapon, left joystick to move and aim)</p><p>You have two types of enemies so far: some that only try to grip you, and some won't move when you're looking at them, but are very fast when you're not facing them, so be careful  </p><p>This game is a prototype made during our second <strong>Unexpected Game Jam</strong>, which lasted 48 hours with the theme \"<strong>Beer brewery</strong>\".</p><p>We received help from most of our fans, but we would especially like to <strong>thank our Drawing-Gnome Maxime for the barrel!</strong></p><p><strong>Don't hesitate to play and then give us feedback by e-mail (triiiniteam@gmail.com) or on Twitter @triiiniteam or Facebook ! :)</strong></p><p>Elly, Armin, Tom and Lia<br/>Triiiniteam Studio</p><p><strong>______________________________________</strong></p><p><strong>[DEUXIEME JOUEUR : APPUYEZ SUR START]</strong></p><p>Vous êtes <strong>Beer Bob</strong>, et votre boulot est de garder la brasserie la nuit. Mais des clients pénibles refusent de partir même après la fermeture. Pire : ils tentent de voler votre tonneau !</p><p><strong>Débarassez-vous d'eux en les poussant </strong>dans la cuve de bière sous la plateforme, en utilisant votre pistolet à bière, vos grenades à bière ou toute autre arme que vous recevrez de manière aléatoire au lancement du jeu !</p><p>Vous pouvez jouer avec un ami :</p><p>-Le premier joueur joue au clavier + souris (<strong>ESDF ou flêches pour bouger, souris pour diriger le tir, clic gauche pour l'arme principale, clic droit pour l'arme secondaire</strong>)</p><p>-Le deuxième joueur joue à la manette (<strong>LB ou A pour l'arme principale, RB ou X pour l'arme secondaire, joystick gauche pour bouger et viser</strong>)</p><p>Vous avez deux types d'ennemis à combattre : ceux qui tentent de s'accrocher à vous, et ceux qui ne bougent pas quand vous les regardez, mais se déplacent très rapidement dès que vous n'êtes plus en face d'eux. Soyez attentifs !</p><p>Ce jeu est un prototype fait durant notre deuxième <strong>Unexpected Game Jam </strong>de 48 heures, suivant le thème « <strong>la brasserie de bière</strong> ».</p><p>Nous avons reçu de l'aide de la plupart de nos fans, mais nous souhaiterions en particulier remercier notre <strong>Drawing-Gnome Maxime</strong> pour le tonneau !</p><p>N'hésitez pas à tester et nous faire vos retours par e-mail <strong>(triiiniteam@gmail.com) ou sur Twitter</strong> <strong>@triiiniteam</strong> <strong>ou</strong> <strong>Facebook</strong> <strong>! :)</strong></p><p>Elly, Armin, Tom et Lia<br/>La Triiiniteam<br/></p>", "metacritic": null, "released": "2015-07-19", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/674/674774832256d04fcddcd0301972c54e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 14, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Triiiniteam"], "genres": ["Action"], "publishers": [], "esrb_rating": null}