{"id": 125003, "slug": "blackwhite-renegade", "name": "Black/White Renegade", "name_original": "Black/White Renegade", "description": "<p> There is something peculiar about this game. </p><p>The world is blocky and colourless, robotic martinets roam the streets, NPCs have no faces or features to speak of, and a plague of strange,abstract monstrosities have washed over the unused, abandoned parts of the game. </p><p>In this world, an omniscient voice speaks to you through a screen on the wall and tells you that you have a job and that you are to do it. He claims to be the Narrator, and that what he says is absolutely true, no matter what. </p><p>But there is a deeper level to the game that you don't notice at first. Some NPCs are rising up against the Narrator and his Admins. The code of the game itself seems to be falling apart. Was this how the game was always meant to be? Or is something else going on here? </p><p>This game encourages you to try and go against the game itself. Level direction is often times misleading, puzzles don't always have clear solutions, and not everything is as it seems. </p><p>Dive into this surreal, 1984-inspired take on game development and discover that not everything is as black and white as you would be lead to believe. </p><p>This game features: </p><p>-Unique character illustrations<br/>-A surreal adventure with two possible endings<br/>-Open level layout with multiple possible routes<br/>-A number of abstract and unusual puzzles<br/>-Many hidden secrets within each section</p><p>Black and White Renegade will be priced at $1 and is developed by Jaypalooza and is being published by RPGVideo</p>", "metacritic": null, "released": "2017-02-11", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/4d0/4d0139f90154ce53ccc1630e124787dd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 46, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["RPGVideo"], "genres": [], "publishers": [], "esrb_rating": null}