{"id": 125161, "slug": "in-my-friend-carries-car", "name": "In My Friend Carrie's Car", "name_original": "In My Friend Carrie's Car", "description": "<p>\"In My Friend Carrie's Car\" is an autobiographical text-based game.</p>\n<p><strong>Content warnings: eating disorders, obsessive-compulsive disorder, intrusive thoughts, depression, reference to sex via discussion of birth control.</strong></p>\n<p>This game discusses some of my experiences being mentally ill. Everybody experiences mental illness differently. This game is representative of some of my experiences, and no one else's.</p>\n<p>Press the highlighted keys to choose your routes. You can press ESC or Q to quit at any time. Please play the game with a screen resolution of 1280x720. You can play it windowed, or not. The game is best played with sound. I prefer it with headphones in. It's up to you, though.</p>\n\n<p>This game is part of an on-going 6-month-long research project that looks at the autobiographical representation of experiences of mental illness in games. If you're interested in learning more, here's a link to my website, and to my blog, where I talk more about the project!</p>\n\n<p>Here are some nice resources that have helped me. Maybe they'll help you, too.</p>\n<ul><li>body positive activist Megan Jayne Crabbe</li><li>information on the symptoms and triggers of misophonia</li><li>OCD Center of Los Angeles, which has a website with some descriptions of manifestations of OCD that I've found really helpful on a few occasions</li><li>International OCD Foundation, which has done some pretty great activism and education work over the years</li><li>bedroom pop band Adult Mom, which I reference in the game and just generally love</li></ul>", "metacritic": null, "released": "2018-02-16", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/dbc/dbc2d30e40e1bb207556b6dee402157f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 6, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Violet Elder"], "genres": [], "publishers": [], "esrb_rating": null}