{"id": 12519, "slug": "tomoyo-after-its-a-wonderful-life-english-edition", "name": "Tomoyo After ~It's a Wonderful Life~", "name_original": "Tomoyo After ~It's a Wonderful Life~", "description": "<p>A visual novel developed by KeyStory<br />\nThis is a sequel to CLANNAD, following Tomoyo&#39;s ending.<br />\nTomoya, the protagonist, has started to work at a waste collection company in the outskirts of town. He recently begun living on his own, and enjoys a calm and happy life with his girlfriend Tomoyo.<br />\nOne day Tomoyo&#39;s brother, Takafumi, brings his father&#39;s illegitimate child, Tomo, to Tomoya&#39;s apartment.<br />\nTomo had been abandoned by her mother, and Tomoya and Tomoyo reluctantly decide they would look after her.<br />\nFurthermore, Takafumi&#39;s ex-girlfriend, Kanako, ran away from her home just before the start of summer vacation.<br />\nShe too ends up staying in Tomoya&#39;s room.<br />\nTomoya, Tomoyo, Tomo, Takafumi, Kanako.<br />\nAnd so begins the first and the last summer these five people will spend together.Characters<br />\n&quot;A never ending love does exist, I know it...&quot;<br />\nTomoyo<br />\nThe homely heroine who supports Tomoya, who has just joined the workforce out of high school.<br />\nShe is actually very good at fighting and would win even against a group of people ganging up on her.<br />\n&quot;It&#39;s like a curse born of my mistake...&quot;<br />\nTakafumi<br />\nTomoyo&#39;s brother. He is very well-versed with computers.<br />\nAgainst Tomoya&#39;s wishes, he set up a computer in the room and visits to sue it frequently.<br />\n&quot;If something like that doesn&#39;t exist... It&#39;s better to enjoy life as much as you can.&quot;<br />\nKanako<br />\nA girl who ran away from home, unhappy with her mother&#39;s upcoming remarriage.<br />\nShe apparently used to date Takafumi and has a foul mouth.<br />\n&quot;Then make up with a kiss.&quot;<br />\nTomo<br />\nThe illegitimate child of Tomoyo&#39;s father. An innocent young girl who would believe in anything.FeaturesFully voiced story<br />\nTomoyo After features a fully voiced story and stars the phenomenal voice talents of Hikaru Isshiki (Little Busters!, The Fruit of Grisaia) and Yuichi Nakamura (CLANNAD anime)<br />\nDungeon &amp; Takafumis<br />\nFeaturing the characters of the main story in a fantasy setting, &quot;Dungeon &amp; Takafumis&quot; is a fully-featured, comedic strategy RPG that will add hours to your experience<br />\nTomopedia<br />\nNewly added to the English Edition, Tomopedia provides insight into Japanese culture and explanations for cultural references that you may come across in the story.Staff<br />\nGame Brand: Key<br />\nGame Design: Jun Maeda<br />\nScenario: Jun Maeda, Leo Kashida<br />\nIllustration: Fumio<br />\nMusic: Shinji Orito, Magome Togoshi, Jun MaedaTheme song<br />\nTitle: &quot;Light colors&quot;<br />\nLyrics: Jun Maeda<br />\nComposition: Shinji Orito<br />\nArrangement: Kazuya Takase (I&#39;ve)<br />\nVocals: Lia</p>", "metacritic": null, "released": "2006-11-25", "tba": false, "updated": "2023-11-05T05:51:36", "background_image": "https://media.rawg.io/media/screenshots/a2a/a2a6a9176a34376c42758242513ad6f9.jpg", "website": "http://key.visualarts.gr.jp/product/tomoyo/", "rating": 3.67, "rating_top": 4, "added_by_status": {"yet": 25, "owned": 122, "beaten": 3, "toplay": 4, "dropped": 1}, "playtime": 5, "achievements_count": 27, "ratings_count": 12, "suggestions_count": 483, "game_series_count": 2, "reviews_count": 12, "platforms": ["PC", "PSP", "Xbox 360", "PlayStation 2", "PlayStation 3", "Android", "Nintendo Switch"], "developers": ["VisualArts/Key"], "genres": ["Adventure", "RPG", "Strategy", "Casual"], "publishers": ["VisualArts"], "esrb_rating": "Teen"}