{"id": 125127, "slug": "brink-of-escape-vr", "name": "Brink Of Escape VR", "name_original": "Brink Of Escape VR", "description": "<p><strong><em>Brink Of Escape VR: </em></strong><br/>Is a previously made project of mine that has been ported exclusively to virtual reality, it can't be played without it. The game was ported and only tested on HTC Vive so any feedback regarding it's use with Oculus Rifts would be fantastic.<br/>To play the game, you must own not only a VR headset but two Motion Controllers as well. <br/></p>\n<p>The game has had major improvements made to it technically, the movement and interaction system has been rebuilt to incorporate moving in VR as I have attempted to make non-nauseating natural locomotion but there is the ability to use teleportation as movement too if natural movement makes you feel queasy. <br/></p>\n<p>The main menu has been re-made for a VR environment and there have been various bug fixes and performance improvements.</p>\n<p>It runs on UE4 high settings with a resolution rendering of 1.2x the scale. <br/>On my i5 + 970, it reaches an average 90 fps.<br/></p>\n<p><strong>Original Description for Brink of Escape is below:</strong><br/></p>\n<p>Brink of Escape is a low poly first person style escape the room game. \r\nYou,\r\n the player, have been kidnapped and are locked in an apartment. Shortly\r\n afterwards, the kidnapper leaves the apartment and you wake up in your \r\nnew environment. You must use the tools and objects found in the \r\napartment to escape, which can be out in the open or locked away in \r\ncupboards and tables. </p>\n<p>Please note that this Demo is <br/>intended more as a personal learning project than a game. Thus it <br/>is missing things I would otherwise like to have added such as sound and<br/> a story.</p>", "metacritic": null, "released": "2017-12-21", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/15f/15fd4ea9155fa3f80a5b3cb879289f2e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 92, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Sam Jones"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}