{"id": 125175, "slug": "ninja-boy-returns", "name": "Ninja Boy Returns", "name_original": "Ninja Boy Returns", "description": "<p><strong>Controls:</strong></p>\n<ul><li><strong>Arrow keys - move</strong></li><li><strong>Z - jump</strong></li><li><strong>X - dash</strong></li></ul>\n<p><strong>Ninja Boy Returns is an action platformer built around a compelling core mechanic: dashing - a power which can be used to cross great gaps and eliminate enemies!</strong></p>\n<p>The Kingdom is endangered once again by a calamitous coalition of fiendish forces, who threaten to bring chaos and anarchy to the peaceful land! Ninja Boy must return to face these foes, lest the Kingdom fall into the clutches of evil!</p>\n<p>Features include:</p>\n<ul><li>An exciting and innovative dash mechanic at the core of the game.</li><li>20 tricky levels to test your skills.</li><li>Rankings on every level - go for gold!</li><li>A 2 player co op mode so that you can enjoy the game with a friend!</li><li>A speed run mode to try for the fastest time!</li></ul>\n<p>Still not sold? Ninja Boy Returns is based on Ninja Boy, created for the GMTKJam, where it won an honourable mention. You can try it right here on itch.io. Ninja Boy Returns features vast improvements over the jam version, including tighter controls, more refined levels, a greater breadth of content, and a range of technical modifications. Additionally, you can try out the demo available on this very site before downloading the full game, featuring 3 of the levels of the full game! (However, the performance of this demo does not necessarily reflect that of the final game!)</p>", "metacritic": null, "released": "2017-08-19", "tba": false, "updated": "2019-08-28T23:23:28", "background_image": "https://media.rawg.io/media/screenshots/f34/f34e6c8d1394d390ba96eb146f410361.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 42, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["Morgan Brown"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}