{"id": 125120, "slug": "hard-aether", "name": "Hard Aether", "name_original": "Hard Aether", "description": "<p>Made for the TIGSource Cockpit Compo 2009</p><p>Soundtrack released under Creative Commons license here:</p><p>https://soundbutt.com/nihilocrat/minimal-aether<br/></p><p>https://soundbutt.com/nihilocrat/raw-aether<br/></p><p>You are a pilot of a massive Battlecruiser (crewed only by yourself, remember, it's The Future) under the command of the Earth Union, and you must defeat opposing craft commanded by the People's Republic of Mars as part of a \"peacekeeping operation\" in the Mars/Phobos/Deimos system. The weapons of the day are nuclear missiles and lasers. Target your victim with the TGT+ and TGT- buttons, and ARM and FIRE XRSSM-9 missiles at them (range: 400km) to destroy them. You can also destroy them with your M301 laser at 200km or under. However, you're more likely to use your lasers to shoot down missiles shot by the enemy. Press \"MISL\" by the target screen to target missiles. The enemy can't use its lasers, I am going to playtest whether it's really fun or not to turn them on, because it might just turn into a boring process of flinging missiles at each other but never hitting anything.<br/><br/>It might be kind of hard to orient yourself. Try pitching up and down, and then left or right, and notice what happens to your heading and ANG (angular velocity), and you can probably figure out how the headings work.<br/><br/>Known issues:<br/>* When ships start traveling very quickly in different directions, missiles will fail to reach their targets. You can always go in laser range and blow up enemies with guns.<br/>* Occasionally, missiles will repeatedly flip, and create a sort of cool looking pinwheel effect. If they don't move at all, they tend to wise up after a few seconds and start heading towards the target.<br/>* If you fly several hundred km from 0,0,0, you will notice the cockpit shaking. This is probably due to floating point imprecision because the cockpit is actually treated as a part of the scene, and the vertices, stored as floats, are being rendered... imprecisely.<br/></p>", "metacritic": null, "released": "2016-06-12", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/b2d/b2da2e99a5c6d0467bab35786cf8f585.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 30, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["nihilocrat"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}