{"id": 125190, "slug": "the-prisonmaster-alpha", "name": "The Prisonmaster | Alpha", "name_original": "The Prisonmaster | Alpha", "description": "What the hell is this?\r\n<p>This is a tactical, magic-heavy fantasy RPG. The graphics, gameplay, and story are all works in progress, but you might already have a blast with it. Try it out, and see for yourself .) </p><p><strong>The Prisonmaster</strong> is a story driven fantasy RPG with square grid turn based combat, heavily reliant on magical abilities. You start as a fragile being, standing against hordes of evil creatures. You are hopelessly outmatched and outnumbered... and then you start blasting them to kingdom come, using lightning, exorcism, and more.<br/></p>\n<p>The level progression is hasted now. Leveling is fast now, but should be slower in the final version.</p>\n<p>Currently, there's up to hour and half of gameplay in this<em> alpha version</em> (might be less, or more - depends on how fast you are in resolving combat situations).</p>\n<em><strong>The texts were not revised, so there might be and will be typos and errors. </strong></em>\r\nWhy is it here (on itch.io)?\r\n<ul><li>For honor and glory!</li><li>I'd love to hear your opinion on the gameplay as it is now, especially if you liked original Fallout and Baldur's gate series.<strong><em> Also any ideas for improvement or any feedback at all are most welcome.</em></strong></li><li>You can also support the development by any donation, if you feel like it.<em> </em> But hey, no pressure whatsoever. I'm very happy for every download and/or comment!</li></ul>\r\nWill I like it?\r\n<p>I'm hoping you will. I wish you'd have at least as much fun playing it as I'm having working on it.<br/></p>\r\n                      \r\nHow do I control it?\r\n<p>As of now, there is no proper in-game tutorial, so that's what this section is for. </p>\n<p>The game controls like many RPGs, although there are some extra options, that might take some time to figure out. I recommend referring to this section after you played around with the game for a while. Here's a summary:</p>\n<ul><li><strong>Shifting form:</strong><ul><li> After reading second obelisk (or right away, if you select save slot 2 or 3), hold down the right mouse button. This allows you to shift form, and enter another dimension. You can only do this while standing on specific blocks. These are hilighted by yellow color when you move the mouse cursor over them, and also stay non-transparent, when you try to switch on a block where this is not allowed.</li><li>To restore your human form, click the right mouse button. You can only switch back on certain blocks (same ones where you are able to switch from your human form). If you want to find the blocks you can switch back at while standing on one where this is not possible, hold down the right mouse button. Switchable blocks will be hilighted with yellow \"reality shards\".</li></ul></li><li><strong>Combat controls:</strong> <ul><li>Don't forget to equip weapons or armor you find or receive from NPCs.</li><li>Click an enemy on an adjecent block to attack. Movement, attacking, and casting spends you APs ( standard stuff).</li><li>Defense: Clicking your character lets you choose a die to use for defense. Choosing numbers one or two yields greater bonuses, and sets all your attacks to critical for the rest of the turn.  </li><li>Toggle attack type (UI button): Lets you choose a die for melee attacks. The number you choose gets added to the normal attack damage.</li></ul></li><li><strong>Setting up your deck:</strong> Once you get your first spell card, a head icon will appear on the UI panel. Clicking it opens the deck builder window.</li><li><strong>Spell casting:</strong> left click a card to pick it for casting. You can fuel this spell either with a die, and / or with another card of same or higher level, if you previously set focus for this card in the deck builder. Right click to cast it instantly from hand (this can be turned off in settings - press ESC to display the settings menu).</li></ul>\n\n<em>If there's anything in the game you can't figure out, please let me know in the comments. It'll help me fix it, or clarify it in the tutorials.</em>\r\nHow do I read the cards?\r\n<ul><li><strong>d6</strong> - a random number between 1 and 6</li><li><strong>Spell Power (SP) - GREEN</strong> - The number of cards used to fuel the main card.</li><li><strong>Selected Die (SD) - RED</strong> - Value of a combat die used to fuel the main card.</li></ul>\n<strong><em>Please let me know what you liked, what you didn't like, what you'd improve or add into the game, or anything that comes to your mind, in the comment section. </em></strong>\n<strong><em>Enjoy if possible .)</em></strong>", "metacritic": null, "released": "2018-04-07", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/e6e/e6e1f3ecd390a48431f06428ae5575d6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 183, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Dizztal"], "genres": ["RPG", "Strategy"], "publishers": [], "esrb_rating": null}