{"id": 125211, "slug": "super-dynapogo", "name": "Super Dynapogo", "name_original": "Super Dynapogo", "description": "<p>Explosive pogo a-gogo!</p><p>The city of Dynaster is in ruins - an erupted volcano has flooded it with lava, and as a result, an evil government corporation has bought the land to level it into a hellish lava-moat-surrounded fortress.</p><p>But it's okay. You have a pogo stick. Not just any pogo stick, either: it's a Dynapogo! It has a stick of dynamite attached that remains intact when it explodes, allowing for infinite reuse. It explodes on contact with anything, so make sure you're pointed the way you want to go when you land!</p><p>Get as far as you can by exploding your way across the doomed Dynaster cityscape's rooftops. Watch as the final helpless and stranded Dynasterians are torn apart by the government's leveller, making sure you aren't killed by itself. And for the love of god, avoid the lava!</p>\"I played the original Dynapogo. What's new?!\"<p>Good question! This is an upgrade, not a sequel, so the core gameplay is the same. But Super Dynapogo has these upgrades on Dynapogo:</p><p>+ Game runs at 1080p and is fullscreen now - clearer graphics and no accidental clicking off-screen!<br/>+ Game contains proper HUD elements - original was for a game jam with \"no in-game text\" as a restriction, so that's now rectified<br/>+ HUD graphics have been polished<br/>+ Everything's got a shadow now, because shadows are for cool people<br/>+ Several new building types added, and tile variety added to new and previous buildings<br/>+ Changed music<br/></p>", "metacritic": null, "released": "2015-10-01", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/c56/c56a068eac8bcb6ee489c7da0fb1a82f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 72, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Chequered Ink"], "genres": ["Action"], "publishers": [], "esrb_rating": null}