{"id": 1252, "slug": "apocalypse-max-better-dead-than-undead", "name": "Apocalypse Max: Better Dead Than Undead", "name_original": "Apocalypse Max: Better Dead Than Undead", "description": "148apps: &amp;quot;For fans of the side-scrolling shoot-em-up, Apocalypse Max delivers quite a lot in a fairly compact package. Requiring a fair amount of concentration, but never overly harsh, it wants you to be a survivor and will equip you with the appropriate weapon to do so.&amp;quot; TheVerge: &amp;quot;With the zombie shooter, Wandake Game Studios reminds us why we love killing undead, by doing what everyone else has done. Just better.&amp;quot; TouchArcade: &amp;quot;We&amp;#39;re digging Max. The production elements are off the wall good, which helps. But more importantly, we&amp;#39;re clicking with its action. Solid pacing keeps you moving, while sharp level design keeps introducing interesting choices.&amp;quot; PocketGamer: &amp;quot;Enter the no-nonsense star of Wandake&amp;#39;s new blood splattered side-scroller Apocalypse Max: Better Dead Than Undead. He&amp;#39;s got guns. He&amp;#39;s got knives. He&amp;#39;s called Max.&amp;quot; Modojo: &amp;quot;When it comes to iPhone and iPad, 2D graphics don&amp;#39;t get much better than Apocalypse Max: Better Dead Than Undead, a side-scrolling zombie shooter from Wandake Studios.&amp;quot; The iPhone App Review: &amp;quot;The overall graphics and images of Apocalypse Max are pretty stellar. Animation is also spot on.&amp;quot; Apptudes: &amp;quot;“…Max is an high quality action title for any iPhone or iPad user looking for some run and gun gameplay.” Overrun by a mysterious strain of mutant zombies, Hellthroat Island has never been more in need of a real hero. You, Apocalypse Max, are the lone survivor of this zombie apocalypse. Journey through 20 levels of heart-thumping, adrenaline-pumping action spread out over 9 perilous worlds! Master in-air maneuvers as you find your way around precarious platforms. Discover secret treasures and collect gold as you overcome more than 16 wacky types of zombies. Unlock over 18 insane weapons and find crazy ways to blast past your enemies. Don&amp;#39;t like guns? Wanna get up close and personal? No problem! Rip apart your foes with your oversized, battle-hardy combat knife. For the first time ever on iOS, Wandake Studios present to you the re-invention of the classic retro platforming experience. Apocalypse Max combines timeless zombie slaying fun with free roaming, acrobatic platforming awesomeness to create an action packed, hack-n-slash, shoot-em-up adventure like the world has never seen before! Engage in the epic and timeless battle of man against zombie in this fast action, 2D adventure with Apocalypse Max! FEATURES VAST WORLDS-- Explore rich and deep content. Lead Max through 20 unique levels across 9 distinct regions for hours of gaming entertainment. UNIQUE HAND-DRAWN ARTWORK-- See beautifully designed and stylized 2D artwork within each level of the game, along with fast and lively animations. WIDE ARRAY OF ENEMIES-- Test your hand-to-hand combat skills with a variety of enemies, and eliminate 16 different and creepy zombie types  ADVANCED WEAPONRY-- Select from a variety of over 20 different types of weapons and ammo that you can use to slice, shoot, and blow up zombies. <br/><br/>UNIVERSAL APP-- Enjoy on your iPod, iPhone or iPad! OFFICIAL TRAILER-- bit.ly/amax2012 CONTACT WANDAKE STUDIOS-- Twitter: @wandakegames Facebook: facebook.com/ApocalypseMax2012 Web: wandake.com Email: support@wandake.com We hope you enjoy our latest game! Please rate Apocalypse Max.", "metacritic": null, "released": "2012-09-14", "tba": false, "updated": "2019-10-22T14:27:40", "background_image": "https://media.rawg.io/media/screenshots/988/9887a778a9f6e46d2613fc2c1e4e61d5.jpeg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 234, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Wandake"], "genres": ["Action", "Arcade"], "publishers": ["Wandake"], "esrb_rating": "Mature"}