{"id": 125233, "slug": "displacer", "name": "Displacer", "name_original": "Displacer", "description": "<p>Welcome to Displacer, my first attempt at Ludum Dare!<br/></p>\n<p>This is for the Ludum Dare 42 Jam competition, with the theme \"Running out of space.\"</p>\n<p>This was a solo effort, with everything made during the 72 hour period. I wanted to stick to the \"true spirit of Ludum Dare,\" that is, the compo, but I ran overtime and didn't want to put out a half-baked game.</p>\n<p>Though, it probably could have benefited from some 3rd party music instead of my out-of-time humming. Don't worry, I put volume sliders in the settings.</p>\n<p>In Displacer, you're a scavenger trying to survive by finding the treasure within the trash. The pawn shop is very picky though, and only ever wants a specific item. Don't get the item, and you're on the shop keeper's bad side for life (game over). Worse yet, the shop keeper is impatient too! Try to keep up with his demands as the trash you have to look through turns into literal mountains.</p>\n<p>WASD for left, right, jump, and fast-fall. Left click to pick up the item under the cursor (cursor dot can only move a limited distance from the player), right click to throw the item under the cursor behind the player. 1, 2, and 3 along the top row of the keyboard will toss whatever item is in the associated inventory slot behind the player. All of these keys can be rebound.</p>\n<p>Good luck, and please don't be afraid to criticize! While I'm limited to what I can produce in 72 hours alone, knowing what to improve on helps greatly the next time around.</p>", "metacritic": null, "released": "2018-08-13", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/fe2/fe20d234d5e2477e3c210ddae7835386.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 17, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["JesterSeraph"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}