{"id": 125207, "slug": "alice-and-the-galactic-traveller", "name": "Alice and the Galactic Traveller", "name_original": "Alice and the Galactic Traveller", "description": "<p>An hour-long adventure in the spirit of retro point-and-clicks. An engaging story with characters to love and puzzles to stump you.</p>Alice and the Galactic Traveller\r\n<p>\r\n\tAfter an accident separates Alice from her parents, all she wants is to find them, and... maybe cause some trouble along the way.\r\n\t<br/>\n</p><p>\r\n\tNow only you can help best the Giant Vines and tame the hordes of Angry Quirl which stand in her way. Only you can unlock the secrets of the Ship's Heart, save the Ship's Hart, help Alice reunite with her family, and change the course of an entire galactic civilization.\r\n</p>Preview Edition\r\n<p>\r\n  The preview edition contains Chapter 2 of the full game. Total play time ranges from half an hour to an hour and a half.\r\n\t\r\n</p><p>\r\n  We want to use this version to share a significant milestone, get some feedback, and generate some enthusiasm. We're currently working on a way to raise funds and complete the full game. </p><p>\r\n  While completely playable, this version may be still be a bit rough around the edges. There are none of the planned mini-games, there is no audio (yet!), and some of the dialog and place descriptions need polishing.</p><p>\r\n  Please let us know what you think!\r\n</p>Open Source\r\n<p>\r\n  This version of the game was built using open source assets. While eventually Alice will have some art of her own, this part of Alice's adventures would not have happened without the community of people who have contributed their work via open source projects and the creative commons.\r\n</p><p>\r\n  In that same spirit, the source code for both the JavaScript client (aka. \r\n\tsushi) and the Golang interactive fiction engine (aka. sashimi) are available on Github under the MIT license.\r\n</p><p>\r\n  We hope the tools can help people make their own adventures.</p>", "metacritic": null, "released": "2016-09-27", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/bf1/bf1f56e7b9cb115111177762b9f93025.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 45, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["everMany games"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}