{"id": 125330, "slug": "arrigato-pretty-sensei", "name": "Arrigato Pretty Sensei", "name_original": "Arrigato Pretty Sensei", "description": "<p>Life is tough on the streets of cybercity. Being an energy based lifeform with a cool sword makes things not much easier.<br/></p>\n<p>The drones are onto you. Someone filed a report. You are apparently the most prettiest of senseis and therefor worth a lot of money.<br/>Mercenary Drones are trying to capture you. But you are not one to be easily messed with.</p>\n<p>Go out and blast through those darned drones with your sword. We thank you for your service.<br/>Arrigato, Pretty Sensei</p>\n<p><strong>How to play:</strong><br/></p>\n<p>Your goal is to destroy all the drones in each level. To do that, you need to dash through or into them. You can aim your dash by holding down the left mouse button and dragging the mouse.</p>\n<p>If you dash somewhere without solid ground under your feet, don't worry. You can dash once while not standing on a platform. However after that one dash you will fall to you doom.</p>\n<p>Whenever you are not moving time moves at a much slower rate, to give you time to think and plan your next move. If you hold down the right mouse button, time will move at a normal pace.</p>\n<p>Now you know everything that's needed to kick some drone behinds!</p>\n<p><strong>Disclaimer:</strong><br/></p>\n<p>This game was made in under 48 hours for the first ever #extragamejam.</p>\n<p>Code: @AndideBob</p>\n<p>Art: @ToastiChron</p>\n<p>Music: @DJBBone</p>\n<p>Font: @somepx</p>", "metacritic": null, "released": "2018-08-19", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/5d4/5d4c534ea107ec77871d1b2671d95ec0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 104, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["andidebob"], "genres": ["Action"], "publishers": [], "esrb_rating": null}