{"id": 12530, "slug": "mind-path-to-thalamus-enhanced-edition", "name": "MIND: Path to Thalamus Enhanced Edition", "name_original": "MIND: Path to Thalamus Enhanced Edition", "description": "Change the entire environment!Wrapped in a mind-bending tale, the gameplay of “MIND” focuses on<strong> changing the very weather in order to solve puzzles</strong>: the player will cycle between day and night, modify the levels of fog and rain and even travel in time between seasons, changing the environment to advance the gameplay-driven story —indeed, the mechanics are directly related to who the protagonist is, what has happened to him and everything he is doing: a man trapped in his own mind, he must use all the tools at his disposition to escape to reality. Accompanied by the snarky yet heartfelt narration of this comatose patient, the player will guide him through fantastical forests, dark caverns and deceptive worlds of water and ice that directly relate to his emotional state at each point in his journey.Enhanced Edition Features<ul><li>Play the game in Virtual Reality for a full immersive experience. VR support only for motion controllers (HTC VIVE and Oculus Rift + Oculus Touch).<br/></li><li>Powerfull new Unreal Engine 4 engine gaining even 70% more performance in almost every level. <br/></li><li>Steam controller, keyboard, gamepad and VR controllers 100% supported and configurable.<br/></li><li>4 secret levels, redesigned interactive ending, narration and also an alternative ending.<br/></li><li>More than 40 different, creative puzzles seamlessly integrated into the environment.<br/></li><li>6 ways to affect the environment in order to solve the puzzles.<br/></li><li>More than 25 distinct landscapes into with which you will be able to interact.<br/></li><li>Turn day to night, make it so everything is covered by a blinding fog, summon incredible storms, travel to the past and make use of even more as of yet unknown mechanics.<br/></li><li>More than an hour of voice acting that, while integrated into the gameplay itself, will tell you a whole story that is not about saving the world but about living through the pain of a father broken by his mistakes.<br/></li><li>Face down imposing enemies by using your creativity and everything you have learnt along the way.<br/></li><li>22 achievements full of Easter eggs and references.<br/></li><li>OST and Artbook included.</li></ul>Who are we?<br/>Developed by Carlos Coronado  Carlos Coronado, Dani Navarro y  Luka Nieto. Aditional code by Jose Ladislao. Voice by Greg Nugent.", "metacritic": 75, "released": "2014-08-05", "tba": false, "updated": "2024-04-16T19:19:35", "background_image": "https://media.rawg.io/media/screenshots/cc2/cc2e32ab67c6fe2909464d376b1c4be7.jpg", "website": "http://mindpathtothalamus.com/", "rating": 3.03, "rating_top": 3, "added_by_status": {"yet": 25, "owned": 603, "beaten": 17, "toplay": 3, "dropped": 17, "playing": 4}, "playtime": 5, "achievements_count": 23, "ratings_count": 37, "suggestions_count": 439, "game_series_count": 0, "reviews_count": 37, "platforms": ["Linux", "macOS", "PC"], "developers": ["Pantumaca Barcelona", "@CarlosGameDev", "Dani Navarro", "Luka Nieto"], "genres": ["Adventure", "Strategy", "Indie"], "publishers": ["Talking About Media"], "esrb_rating": null}