{"id": 12549, "slug": "beastiarium", "name": "Beastiarium", "name_original": "Beastiarium", "description": "<strong>Beastiarium</strong> — plunge into the mysterious world full of secrets and monsters, its atmosphere will keep you in suspense throughout the story. <br/>The action takes place in underground Petersburg in the beginning of 20th century, one hundred years later since the monsters invaded the planet. Survivors were forced to move underground and build a \"new world\". Next generations fully adapted to their new life and never again came to the surface. Underground hideaways were developed into full-fledged cities with complex infrastructure and life-support systems. However, the escape plan wasn't perfect: the underground cities were infiltrated by the monsters again and again, and people had to always be on guard. To control the situation, they established the Guard. But why are people afraid to leave their homes, and who is the true danger here? <br/><br/>Features of the game: <br/><ul><li>Combination of plot-driven quest and action-horror. <br/></li><li>Seamless game world with sandbox elements. <br/></li><li>Unique monster species and mysteries that you can cope with only if you find out their weaknesses. <br/></li><li>Charismatic characters — each one with its own personality and background. <br/></li><li>Developed using Unreal Engine 4 — the next generation engine.</li></ul>", "metacritic": null, "released": "2016-12-05", "tba": false, "updated": "2022-09-30T00:42:36", "background_image": "https://media.rawg.io/media/screenshots/91b/91b057a6aeb68fcde92ea84c4497194f.jpg", "website": "", "rating": 0.0, "rating_top": 3, "added_by_status": {"yet": 3, "owned": 114, "beaten": 4, "dropped": 2}, "playtime": 4, "achievements_count": 0, "ratings_count": 5, "suggestions_count": 248, "game_series_count": 0, "reviews_count": 5, "platforms": ["PC"], "developers": ["Fazan"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Fazan"], "esrb_rating": null}