{"id": 125450, "slug": "gnomes-homebrewing-adventure", "name": "Gnome's Homebrewing Adventure", "name_original": "Gnome's Homebrewing Adventure", "description": "<p><strong>Gnome's Homebrewing Adventure</strong> is a short point&amp;click game which will guide you through the fun hobby of brewing beer at home. <br/><br/>The game has been created to try out the Adventure Game Studio framework, and to give a simple visual guide for brewing beer at home.<br/>And it was a lot of fun to make!</p>\n<p>The controls are simple: use your mouse to control the Gnome. By right-clicking your mouse, you can change the cursor to perform different actions: walk (boot), use / pick up (hand) and look at (eyes).</p>\n<p>By hovering the cursor at the top of the screen, the control bar will appear. There you can see a chest where you can see all the items you've picked up. Some of the items can be used with each other, and some can be used on parts of the room.</p>\n<p>You can walk into the storage room on the right side of the kitchen.</p>\n<p>When stuck, I suggest searching the web for homebrewing topics, but you can also ask the Wise Cat, lurking behind the window. Just click it and see. :)<br/><br/>The control bar also contains a MENU button, which you can use to Save, Load etc...</p>\n<p>Feel free to leave comments about the game, and I hope you'll have some fun playing it!</p>\n<p><strong>Note:</strong> some antivirus programs give notifications about this game, saying it is a potential risk/virus. That's probably because the file is not (yet) known worldwide (and does not have a digital signature). It's smart to let your antivirus scan the file and then decide whether to run it, as a general rule. In my experience, Avast antivirus uploads it somewhere, scans it, and then declares it's safe. </p>\n<p>Cheers,<br/>The Evil Gnome</p>", "metacritic": null, "released": "2018-02-13", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/ba2/ba243bd4da7f6512607552865a130e4d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 22, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["gnomix"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}