{"id": 125552, "slug": "bit1mon", "name": "Bit1Mon", "name_original": "Bit1Mon", "description": "<p>A one bit game made for #1BitJam bitjam<br/></p><p>Bit1mon are 1 bit monsters you have to capture in your bitibox. You are cinder a young bit1mon trainer with dreams of being a champion. To do that you must capture the 32 bit1mon that are in this game. </p><p>WARNING </p><p>Warning game features flashing screens that may trigger epilepsy or other photosensitive conditions. If you suffer from these i advise against playing this game.</p><p>Movement </p><p>The forest you hunt bit1mon is a 10x10 grid you can navigate by using arrow keys.</p><p>You enter the forest at the top left square, and the forest wraps around on itself so the left edge wraps to right and top wraps to bottom. The screen will flicker after you move to indicate the change of grid square.</p><p>Hunting </p><p>If there is a bit1mon in your grid square the screen will be black. Otherwise a white screen indicates a empty square. </p><p>Combat</p><p>When you find a bit1mon you can attempt to capture it by tossing your bitibox at it.press SPACE to initiate combat. The screen will then rapidly flash white and black then stop at white if you capture the pokem.... I mean bit1mon or black if it was a failure.the screen will then turn white and the bit1mon will escape to another empty grid square.</p><p>Combat in bit1mon is 1 bit. Result will be either 0 or 1. Capture or fail. </p><p>Winning</p><p>When you capture the final bit1mon the screen will repeatedly flash 32 times to indicate your victory.</p><p>Exit the game at any time by pressing Q on keyboard.</p><p>This 1 bit game may have been inspired by a certain japanese series of games &amp; cartoons and is simply a parody for this jam.</p>", "metacritic": null, "released": "2016-05-01", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/1a4/1a4f69d2bb8e490ceec001cb18b929ad.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 11, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Retro Gerry"], "genres": [], "publishers": [], "esrb_rating": null}