{"id": 125683, "slug": "elys", "name": "ELYS", "name_original": "ELYS", "description": "<p><strong>THIS GAME CONTAINS</strong>:</p>\n<p>Horror scenes; Implied abuse;</p>\n<p>Grotesque Imagery; Implied and explicit violence;</p>\n<p>Blood; Murder; Death; Self-Harm.</p>\n<p><strong>----------------------------------------------------------------------------------</strong></p>\n<p><strong>Elys</strong> is a young girl with a troubled past. As soon as the game starts, we see her motionless, unconscious, while her body is sinking into a static void. Everything is quiet. When she re-opens her eyes, a path in a forest leads the way to somewhere. With no reaction on her part, she decides to follow it, probably aware of what she will find ahead.</p>\n<p> <strong>Plot and collectibles.</strong><br/> Although there's a backstory around the main character, the game doesn't explicitely narrate them. However, I preferred to give a meaning to every single element that makes up the game maps. Every situation, every single pixel wants to be a clue and tell about the protagonist and her past, as well as the reason that led her to the place where the story starts. I have also introduced collectibles called \"memories\". As such, they aren't mandatory to be found. They focus on short sentences that give an additional input to the plot. Every memory introduces a keyword that wants to give further hints about the protagonist and what lead to the events of the game. Collecting or NOT collecting memories can influence on the endings. There are 10 memories in total, but they aren't the only findable items by the player. The two \"keys of the void\" are among them; one is necessary to unlock one of the four possible endings. Taking a key of the void will, however, exclude the possibility of reaching a particular memory.<br/> <br/> <strong>The playable routes</strong><br/> The game offers a mandatory route that leads to the end of Elys' story, but at the same time there are alternative routes and optional maps. The idea was and still is to make the game \"replayable\", allowing the player to make different choices and to decide whether or not to take more challenges. Some maps are indeed accessible by finding certain items. However, the player may not care about the secondary events and thus can experience the game more quickly.<br/> <br/> <strong>The game mechanics</strong><br/> The game follows the mechanics of point and click games. The player collects items, which can be combined, can solve puzzles or open locked doors. Elys is powerless in front of her enemies, but there will be times where she will be able to deal with them. Our main character will have the opportunity to acquire a particular ability to deal with some enemies with only the power of the mind.<br/> <br/><strong>Death Scenes</strong>.The game features some bloody scenes where the protagonist dies. Between decapitations and dismemberments, our poor Elys has surely seen better days.</p>\n<p> <br/>The final paragraph is dedicated to the <strong>Cheshire Cat</strong>. He only appears to the protagonist a couple of times, besides telepathically inviting her to make certain actions, but he no doubt wins the role of spiritual guide.</p>", "metacritic": null, "released": "2017-05-10", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/96c/96c2ccdd244c1b608bbe073e4358cf2a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 122, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["RyokuDD"], "genres": [], "publishers": [], "esrb_rating": null}