{"id": 12566, "slug": "satellite-command", "name": "Satellite Command", "name_original": "Satellite Command", "description": "Satellite Command takes you into orbit around a stunning representation of our home planet, Earth. Take command of your own space agency, complete real contracts, research advanced technology and carefully manage your resources and reputation to learn more about the wonders of the Universe.<br/><br/>A simulation / arcade hybrid designed to make astrophysics approachable, with over 150 contracts based on real mission data. An RNG system and an ever expanding list of missions ensures that no two games will ever be the same!<br/><br/>Developed in tandem with space-industry experts, Satellite Command features a realistic astrophysics simulation and harnesses the graphical power of Unreal Engine 4 for a truly out-of-world experience.<br/><br/><strong>Features of Satellite Command:</strong><br/>• Realistic astrophysics simulation, plan and change your orbits to get as close or far from Earth as you dare! <br/>• RNG system that ensures no two play-throughs will ever be the same!<br/>• Hundreds of contracts to complete, based on real mission data. Learn about the wonders of the Universe.<br/>• Player progression system and stats tracking, with an elite Achievement and Leaderboard integration.<br/>• Special Events weekends and a regularly updated list of mission data!<br/>• Unforgiving gameplay designed to encourage learning by doing - the same way we did in reality.<br/>• Procedurally generated technology tree to explore.<br/>• Fully remappable keybindings, a host of graphical options, 4K and Steam Cloud support.", "metacritic": null, "released": "2016-12-16", "tba": false, "updated": "2019-08-28T22:13:12", "background_image": "https://media.rawg.io/media/screenshots/c17/c171d679e8f31bbb44eb3b95ad6ef7db.jpg", "website": "http://stormtide.co.uk/satellite-command/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 13}, "playtime": 2, "achievements_count": 50, "ratings_count": 0, "suggestions_count": 323, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Stormtide"], "genres": ["Simulation", "Indie"], "publishers": ["Stormtide"], "esrb_rating": null}