{"id": 125728, "slug": "battle-of-eltnoq", "name": "Battle of Eltnoq", "name_original": "Battle of Eltnoq", "description": "Deskripsi Game\r\nAdalah sebuah game mobile aksi yang dimainkan oleh 2 orang pemain secara bergantian. Pemain akan saling membunuh karakter lawan dengan senjata yang digunakan.\r\n<br/>Story\r\nPada tahun 1869, merupakan tahun yang sangat penuh dengan peperangan dimana peperangan tersebut ditujukan untuk mendapatkan suatu wilayah kekuasan.<br/><br/> Dalam masa peperangan tersebut ,terdapat seseorang nahkoda kapal bernama \"Elt\" yang bertugas mengantar barang barang keperluan untuk peperangan melalui laut dengan menggunakan kapal kepunyaan dia sendiri, bersama dengan beberapa kru kapal beliau. Dalam perjalanan dalam mengantar barang tersebut tanpa disengaja kapal tersebut diharuskan menepi di sebuah pulau karna keadaan sudah malam dan para kru juga sudah kelelahan. Akhirnya mereka menepi di sebuah pulau antah berantah, tanpa basa basi pun mereka beristirahat di pulau itu.<br/><br/>  Pagi hari pun tiba disaat para kru kapal bangun, mereka pun ingin mencari bahan bahan untuk berlayar di pulau tersbut. Para kru dan Elt pun terkejut dengan melihat banyaknya sumberdaya dalam pulau itu dan yang lebih anehnya tidak ada orang di pulau itu sama sekali dan tidak ada bekas jejak manusia di pulau itu. <br/><br/>Banyak sekali sumber air yang jernih, berbagai sumberdaya alam seperti buah buah yang melimpah, dan satu lagi yang paling penting terdapat tambang emas dan perak yang berlimpah  Tetapi karena tugas utama mereka adalah untuk mengantar barang barang peperangan maka mereka terpaksa meninggalkan pulau tersebut Tapi Elt pun tidak ingin kehilangan pulau tersebut sehingga Elt menandai pulau tersebut pada peta dan elt pun memberi nama pulau itu \"Eltnoq\" Lalu mereka pun pergi ke tempat tujuan mereka. <br/><br/>Setelah mereka mengantar bahan bahan peperangan tersebut akhirnya Elt pun berencana untuk kembali lagi ke pulau tersebut untuk mengambil alih pulau tersebut bersama kru kapalnya. Akhirnya mereka pun pergi kembali ke pulau \"Eltnoq\". Rasa kaget pun tak terbendung kala Elt dan kru nya sampai di pulau \"Eltnoq\" ketika melihat ada kapal besar seperti kapal mereka yang sedang menepi di pulau \"Eltnoq\". Tanpa berpikir panjang kru Elt dan Elt pun turun dari kapalnya, dan mulai menjelajahi pulau tersebut untuk menemukan kru dari kapal lawan.<br/><br/> Akhirnya mereka pun menemukan kru lawan ternyata sedang mengambil emas dan perak dari tambang yang ada di pulau itu. Saat Elt dan kru nya ingin menyerang kru lawan, mereka baru tersadar bahwa tempat tambang emas tersebut berada di sisi pulau yang di batasi oleh jurang, awalnya tempat itu di hubungkan dengan jembatan tetapi saat kru lawan melihat Elt dan pasukannya datang mereka langsung merubuhkan jembatan tersebut.<br/><br/>   Elt dan kru nya pun berhenti, dan mulai berbicara dengan kru lawan itu. Dari kedua belah pihak tidak ada yang mau mengalah, dan akhirnya didapatkan konklusi bahwa mereka akan menurunkan 1 orang terbaik dari tiap kru nya untuk maju 1 lawan 1, ini dikarenakan mereka tidak mau membahayakan banyak jiwa yang gugur dalam serangan ini. Mereka pun sepakat untuk menurunkan pemanah terbaik dalam tim mereka untuk saling bertarung, dan disitu lah lahirnya “Battle of Eltnoq”\r\nMade with ❤ by Slathem Studio.\r\n<p>Slathem Studio :</p>\n<ul><li><strong>Abdurrahman Prawira</strong><ul><li>. /155150200111129</li><li>. / Programmer</li></ul></li><li><strong>Ade Darmawan</strong> <ul><li>. /155150200111106</li><li>. / Designer</li></ul></li><li><strong>Andhi Indra Lestya Wicaksono</strong><ul><li>. /155150207111079</li><li>. / Artist</li></ul></li><li><strong>Arda Satata</strong><ul><li>. /155150200111216</li><li>. / Programmer</li></ul></li><li><strong>Ary Muhammad Prayoga </strong><ul><li>. /155150200111118</li><li>. / Programmer</li></ul></li><li><strong>Bagus Santoso </strong><ul><li>. /155150201111154</li><li>. / Artist</li></ul></li><li><strong>Mayovio A. M.</strong><ul><li>. /155150200111209</li><li>. / Artist</li></ul></li><li><strong>Muadz Askarul Muslim </strong><ul><li>. /155150201111157</li><li>. / Programmer</li></ul></li><li><strong>Ricky Irfandi </strong><ul><li>. /155150201111274</li><li>. / Artist</li></ul></li><li><strong>Yosua</strong><ul><li>. /155150207111078</li><li>. / Designer</li></ul></li></ul>", "metacritic": null, "released": "2017-12-20", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/1f4/1f492d94e7934b08af0f40f8fc76eae1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 49, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Slathem Studio"], "genres": ["Action"], "publishers": [], "esrb_rating": null}