{"id": 125751, "slug": "wheelless", "name": "Wheelless", "name_original": "Wheelless", "description": "<p>Wheelless is a top-down race game. Think Micromachines meets F-Zero!</p><p>Manage your speed, torque and handle, stay in the tracks! The real challenge is keeping your ship from drifting off road. Wheelless has tracks with jump pads, interactive scenery, and even hyperspace!</p><p>There are six differents equipments to attach to your ship : Armor, Shield, Main Thrusters, Manoevring Thrusters, Colling System and Fuel Tank. Every equipment changes the stats and unlock certain features!<br/></p><p>Eleven competitors race against you on alien planets, derelict factories or even in deep space!</p><p>Wheelless also features a multi layered scenario splitted in six paths.<br/>Each faction's campain shows their own version of the main story, of course centered around racing.</p>This is the third millena, and the Milky Way is dying. The biggest factions refused to found their legacy on genocide: they, instead, established a fair way for every individual to win the remaining healthy stars.<br/><strong>The Race for Glory</strong> was suggested to settle the conflict: six factions will compete near-deadly races for the control of the whole new galaxy. Each faction has its own champion, and a second freelance competitor under contract. That is where you intervene!<p>The campaign will feature a lot of different characters, dialogues, choices and even 2D cutscenes!</p><p>The game is currently in early Alpha. During this development period, all builds are free to download! The current build features 7 spaceships, 2 to 3 pieces of equipments of each and 1 circuit.</p><p>What is the near and far future for this game? As the first Alpha iteration rolls out, we have started working on <strong>Alpha 2.0</strong>. It will contain more contents (new spaceships and circuits), some gameplay features (hyperspace, scenery interactions, NPCs) and a lot of bugfixes and reworks (espetially new AIs behaviors). Player customisation, shops and competitors conversation system should be in as the development of the campain starts.</p><p>Then: <strong>Alpha 3.0</strong>. It will have a lot more content and bugfixe. We will focus on the campain and work on a test campain path. It should be feature complete and have a lot of unpolished contents.</p><p>We will then aim for to <strong>Beta 1.0</strong> where bugs are smashed and things polished, producing cutscenes, final graphics, audio and scenario lines.</p><p><strong>Beta 2.0</strong> will be near completion state. Then <strong>GOLD</strong>.</p><p>Greenligh entry should start in the near future. Stay tuned!</p><p>In the meantime, follow us on twitter and on our dev blog!<br/></p>", "metacritic": null, "released": "2016-05-09", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/09f/09ffc1e77f4a9491b5d9c106c19e8b2c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 98, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ony"], "genres": ["Sports", "Racing"], "publishers": [], "esrb_rating": null}