{"id": 125795, "slug": "moly-run", "name": "Moly Run", "name_original": "Moly Run", "description": "<p><strong>MolyRun</strong> is a \"dreamlike\" endless runner based on the difficult relation between Peter Molyneux and a bavarian sausage, developed for MolyJam 2013 and inspired by the quote: \"<em>I still have nightmares about holding German sausages over my head</em>\".</p><p>Accordingly, in this parody game you will find yourself in one of the most recurring nightmares of the famous game designer, in which he keeps running while trying to keep a fragile, antropomorphic sausage balanced over his head. All of this was made using <strong>HTML5 </strong>nd is therefore playable via browser on any platform (PC/Mac/Linux).</p><p>As soon as Peter will fall asleep your endless run will begin: in this imaginary world you will have to both jump in order to avoid pits (by pressing \"<strong>Space</strong>\") and keep the sausage in balance (by pressing \"<strong>A</strong>\" and \"<strong>D</strong>\") without letting it slip off of your hands.<br/>By gathering MolyCubes (from the famous videogame Curiosity) scattered through the level it will also be possible to communicate with the sausage: during the dramatic confrontations it will be possible to score some additional bonus points by repeatedly pressing the \"<strong>D</strong>\"<strong> </strong>button.</p><p>The goal of the game is to score as much points as possible in order to stimulate Peter's creativity and, upon his awakening, to make him come up with a new brilliant game concept.</p><p>Have fun with this little RisingPixel production and if you happen to find the game overly difficult you can always call a friend/relative to play with and split the tasks of jumping and balancing the sausage. After all, another Peter Molyneux's famous quote reads: \"<em>When you're doing it in multiplayer, it feels incredible. I love that.</em>\" :)</p><p>The game \"<strong>MolyRun</strong>\" is not in any way meant as either offensive or discrediting toward the image of neither Peter Molyneux nor of bavarian sausages (especially the antropomorphic ones) as it just tries to be an affecionate parody of a funny quote in occasion of the \"MolyJam\" event (not affiliated with the real Peter Molyneux®).</p>", "metacritic": null, "released": "2015-08-14", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/d2d/d2d4fdb06145ebdd3f297b584990fb8a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 25, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Web"], "developers": ["RisingPixel"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}