{"id": 12579, "slug": "super-puzzle-sisters", "name": "Super Puzzle Sisters", "name_original": "Super Puzzle Sisters", "description": "<strong>Super Puzzle Sisters is a brand new ‘Action Puzzle’ game with a twist. Players are able to move and punch blocks to create crazy combos in up to 4 player Local Multiplayer Battles!!</strong><br/><br/><strong>Overview</strong><br/>Designed like Old School Arcade Puzzle Games, Super Puzzle Sisters encourages players to stack Blocks to create crazy combo chains in order to destroy their opponents.<br/><br/>The Big Twist in Super Puzzle Sisters is that Blocks don’t pop on their own, instead Players are given full control to destroy the Blocks when they want to, this allows Players to create huge Combo chains and activate them at just the right time!<br/><br/>On top of that Players can also use Special Moves, these can damage your opponents by giving them more Blocks, Reversing their controls and even covering their screen with Clouds. Though the best offence is a good defense and you can also use Special Moves to save yourself by getting rid of every Block of a certain colour or by throwing exploding Water Balloons to get rid of a bunch of them in one go!<br/><br/><strong>Cast</strong><br/>Super Puzzle Sisters has a cast of 6 Cute Characters, each with their own Special Moves<br/>and Strategies, do you pick the reliable and easy Pulse or mix things up with the glass cannon of Persimmon? And to top it all off, the Sisters are fully voiced and are brimming with personalities.<br/><br/><strong>Game Modes</strong><br/>There are 4 Main Multiplayer modes…<br/><ul> <li>Standard Mode - Where Players make Combo Chains while Battling Opponents<br/> </li><li>Rush Mode - Where Combos don’t grant rewards and the Fastest Player with the Quickest Reflexes will win the day<br/> </li><li>Bomb Mode - Where Bombs are falling and stuff gets really crazy so get ready for some Big Combos!<br/> </li><li>And Wide Mode - All Players are on one Giant Grid! Try and work together to get a high Score but remember last Sister standing Wins</li></ul><br/>And there is also 3 Single Player Modes...<br/><ul> <li>Time Attack - where you can aim for the best score in 2 minutes <br/> </li><li>And Endless Mode - where you can test your metal and see how long you can survive!<br/> </li><li>Wide Mode - The Gird is Giant! What kind of crazy combos can you make?</li></ul> <ul><li>All of which have in game Leaderboards to Drive you to get better!</li></ul><br/><strong>Get ready for some Super Puzzle Action!</strong>", "metacritic": null, "released": "2016-10-17", "tba": false, "updated": "2019-08-28T22:13:12", "background_image": "https://media.rawg.io/media/screenshots/e47/e475dd1e4deef7dd83a277d208095148.jpg", "website": "https://www.facebook.com/superpuzzlesisters/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 5, "toplay": 1}, "playtime": 6, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 191, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Super Puzzle Studios"], "genres": ["Strategy", "Indie"], "publishers": ["Super Puzzle Studios"], "esrb_rating": null}