{"id": 12587, "slug": "principia-master-of-science", "name": "PRINCIPIA: Master of Science", "name_original": "PRINCIPIA: Master of Science", "description": "<strong>Principia:Master of Science</strong> is a simulation game with the theme of European science in 17th century. <br/><br/>Choose one of 12 real scientists from the era of Isaac Newton and proceed with your research. <br/>There are six research topics: \"Astronomy\", \"Physics\", \"Thermodynamics\", \"Biology\", \"Optics\", \"Mathematics\". <br/>Choose one (or more), perform experiments, make discoveries and submit your findings to the Royal Society of Sciences.<br/>It's even possible to belittle your rivals.<br/><br/>Fill and complete your own encyclopedia with inventions like \"Pendulum clock\" or \"Reflecting telescope\", or sketches like \"Enlarged view of a cork\" or \"Enlarged view of a flea\"!<br/><br/>It is the time even the word \"Science\" did not exist. <br/>Who can be the master of science?<br/><br/>Isaac Newton (1642〜1727)<br/><br/>A British physicist and mathematician. He is hailed as one of the Three Great Mathematicians. His first great discovery (the spectrum of light) was finding that white light was an amalgam of monochromatic light. Next, using his Universal Law of Gravitation, he successfully mathematically proved that planets move along elliptical orbits. The significance of this was explaining the movement of celestial and terrestial bodies under one law. The manuscript of his collective theories, 'Principia', took the world by storm, and Newton went on to obtain immutable fame. In 1705 he was knighted and known henceforth as 'Sir Isaac Newton'<br/><br/><strong>Renowned invention: Newtonian telescope</strong><br/>Christiaan Huygens (1629〜1695)<br/><br/>A Dutch physicist and astronomer. His father was a government official affording him the highest standard of education. In 1655 he conceptualised a method of polishing lenses, which he demonstrated in action with the production of a high fidelity refracting telescope. Huygens valued quantitative observation leading him to invent the 'pendulum clock' in 1656, and the 'minimeter', capable of making measurements accurate within seconds, increasing the precision of observations. In the field of optics he opposed Newton's particle theory of light, asserting that it was instead a wave, but he went unacknowledged.<br/><br/><strong>Renowned invention: Pendulum Clock</strong><br/>Gottfried Leibniz (1646〜1716)<br/><br/>A German mathematician and politician. It was said that he demonstrated talent in mathematics from a young age and was unparalleled in mental arithmetic. He advanced Pascal's calculator design, conceptualising one capable of multiplication and division. Additionally, he developed infinitesimal calculus during the same period as Newton did. There was severe discord between him and Newton et al. over priority rights for calculus. The notations for calculus used today are those Leibniz himself once used. In 1700 the Berlin Academy of Sciences was founded at the behest of Fredrick I of Prussia. Leibniz became its first president.<br/><br/><strong>Renowned invention: Stepped reckoner</strong><br/><br/><br/>...and more characters!<br/><br/><br/><br/>This game is developed originally for the software contest held in 2000 as \"PRINCIPIA\". <br/>Since then, all aspects of the game are improved including the system, graphics and sound. Also the current version has \"Final theme\", \"Order of merit\" and more. It is completely different to the original version. <br/><br/>The game follows actual history very closely, so you can also learn the history of science while you play the game. <br/><br/>All six songs were recorded in the studio by a real string quartet. These live performances suit the 17th century aesthetic very well. <br/><br/>If you are interested in Science, this will be a fun game for you!", "metacritic": null, "released": "2016-09-09", "tba": false, "updated": "2022-05-20T11:39:35", "background_image": "https://media.rawg.io/media/screenshots/31b/31be8eb3a8ee21eb752a6c48a37c7bfe.jpg", "website": "http://tomeapp.jp/principia-mos", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 23, "dropped": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 3, "suggestions_count": 281, "game_series_count": 0, "reviews_count": 3, "platforms": ["iOS", "macOS", "PC"], "developers": ["tomeapp", "Shin Hirota"], "genres": ["Strategy", "Simulation", "Educational", "Indie"], "publishers": ["AGM PLAYISM", "Shin Hirota"], "esrb_rating": "Everyone 10+"}