{"id": 125834, "slug": "alfire", "name": "A.L.F.I.R.E.", "name_original": "A.L.F.I.R.E.", "description": "<p>Anti Lizard Flying Improvised Row of Explosives (A.L.F.I.R.E.) is an arcade game in which you need to quickly set fireworks up to defeat the green dragons that are attacking you and the blue dragons that are attacking the city!</p><p>Use the <strong>arrow keys</strong> to control the character and the <strong>'Z' button</strong> to get paper, stick and powder to build a firework. Press 'Z' again to place fireworks where the red arrows indicate. You can also use the <strong>'X' button</strong> after placing a firework to aim those rockets at the background and hit the blue dragons.</p><p>Developed for Ludum Dare 36.</p><p>Team:</p><ul><li>Vinícius \"Vinnie\" N. - Art, Music, Sound Design, Game Design</li><li>Emerson Roseiro Filho - Lead programmer, Game Design</li><li>Jun Moriyama - Assistant programmer</li><li>Lucas Capucho \"Kpucho\" de Araujo  - UI programmer, Programmer, Game Design</li><li>Lucas Takashi Ito - Sound Design</li></ul><p>_______________________________________________________</p><p>Anti Lizard Flying Improvised Row of Explosives (A.L.F.I.R.E.) é um jogo arcade no qual você deve montar fogos de artifício rapidamente para derrotar os dragões verdes que estão te atacando e dragões azuis que estão atacando a cidade!<br/></p><p>Use as <strong>teclas de setas </strong>para controlar o personagem e a <strong>tecla</strong> <strong>'Z' </strong>para pegar papel, vara e pólvora para fazer um fogo de artifício. Pressione 'Z' novamente para posicionar os fogos de artifício onde as setas vermelhas indicam. Você também pode pressionar a <strong>tecla 'X' </strong><strong> </strong>depois de posicionar um fogo de artifício para lançá-lo para o fundo e acertar os dragões azuis.<br/></p><p>Desenvolvido para Ludum Dare 36.</p>", "metacritic": null, "released": "2016-08-30", "tba": false, "updated": "2019-08-28T23:23:26", "background_image": "https://media.rawg.io/media/screenshots/35b/35b15c10e03f5aa3052f42c726d06288.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 45, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MvP Studios"], "genres": ["Action"], "publishers": [], "esrb_rating": null}