{"id": 125969, "slug": "stock-game", "name": "Stock Game", "name_original": "Stock Game", "description": "[Tactic Series]\r\nTactical game, with realistic stock market simulation\r\n<p>\r\n\tThe first game of the tactic series, please do look forward to the next game of the series! Make sure to look out for new games in the Tactic Series!\r\n</p>\n<p>\r\n\tTypical MONEY WARS! A realistic simulator of stock market. With special financial events, like financial crises, financial tsunamis and many more! Monitor the virtual stock market and don't miss the chance to invest or withdraw. Every event is controlled by a set of algorithm generated by a self-learning AIs using real stock market price as training data.</p>\n<p>\r\n\tComes along with two gamemodes: Casual mode and real-time mode! Casual mode allows you to play a quick game while real-time mode allows you to play a game that lasts for all day long and with special financial events.\r\n</p>\n<p>\r\n\tPlease report bugs and glitches or give ideas to me at ccheukka@gmail.com!\r\n\t<br/>\n</p>\n<p>Click here to check out the timelapse of me programming this game!</p>\r\n****This is a re-creation of Stock Game 2(by s0921040 (also known as tobylam092) ), please do check out his original game!\r\n\r\nHow to play:\r\n<p>\r\n\tMonitor the trend and make sensible decisions. You can choose whether to buy or sell stock, do long-term investments or short-term investments. You can even make loan from banks or set up time deposit accounts. The game rule is simple: You go bankrupt, you lose the game. Compete high score with your friends!</p>\r\n\r\n\r\n\tChangelog:\r\n\r\n<p>\r\n\talpha--------------------------------------------------------------------------------</p>\n<p>v0.0.0 --Added entry on itch.io</p>\n<p>v0.0.1 --Added casual mode basic gameplay</p>\n<p>release------------------------------------------------------------------------------<br/></p>\n<p>v0.0.0 --Added loans; fixed crashes due to analytics and stock prices changing; refined stock buying and selling system; many bugs fixed</p>\n<p>v0.0.1 --Added further analytics; updated user GUI; added admin mode; fixed a crash when a player tries to type invalid inputs (not recommended to do so)</p>\n<p>v0.1.0 --Added stats when you go bankrupt</p>\n<p>v0.2.0 --Added special event: financial crisis; added bankruptcy mechanics; added tax policy; added difficulty options</p>\n<p>v0.2.1 --Fixed a fatal issue where the game would instantly crash when you try to run it</p>\n<p>v0.3.0 --Added special events: financial recession, economic boom; added stats output; updated assistant; refined event creator system; credits given to s0921040 (also known as tobylam092) for providing special events ideas; slight change on the colour settings panel</p>", "metacritic": null, "released": "2017-03-11", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/5d2/5d28403024f2f9eae14c14602e98f7a1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 37, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["CCheukKa"], "genres": ["Strategy", "Simulation"], "publishers": [], "esrb_rating": null}