{"id": 126163, "slug": "coast-defense-force", "name": "Coast Defense Force", "name_original": "Coast Defense Force", "description": "<p><strong>You are commander of CDF - special unit activated in response to a sea monsters invasion.<br/></strong></p><p>Your task is simple - evacuate civilians from coastal cities, before monsters overrun them. You will get full control over units taking part in this operation - infantry, tanks, aircrafts and nuclear weapon. Use them as you will, but mind the casualties. </p><p>Your actions will affect the panic level, among people. More casualties, or usage of nuclear weapon results in increase of panic. Higher panic level affects badly your forces morale, as they will be more likely to avoid combat situation.</p><p>Your mission won't be over, until there are still civilians at area. </p><p>Our hopes and prayers are with you, commander!</p><p><strong>Good luck!</strong><br/></p><p>Coast Defense Force is mix of real time strategy and tower defence, where your main objective is not to conquer enemy, but protect your cities.</p><p>Produce <strong>infantry</strong>, to place them in city zones - that will begin evacuation.</p><p>Use <strong>armored units</strong>, to hold monsters off the evacuation routes.</p><p>Send <strong>special forces </strong>to lure enemies in traps, and to make your airstrikes more effective.</p><p>Use <strong>airstrikes </strong>and <strong>helicopters</strong>, to support units on ground.</p><p>And as last resort - make use of <strong>nuclear weapon</strong>, to destroy cities overruned by monsters, to stop them from breeding. But be adviced - that will produce nuclear fallout, and increase panic level!</p><p>The game is still in development. Right now it's more or less - proof of concept. So any advices, or feedback (even that harsh) will be appreciated. <br/></p>", "metacritic": null, "released": "2016-11-12", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/100/100c80bbaade03081839a844e4d627f8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 19, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["damoch"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}