{"id": 1261, "slug": "hero-mages", "name": "Hero Mages", "name_original": "Hero Mages", "description": "Hero Mages is a turn-based tactical strategy fantasy game that combines the fun of role playing games (RPGs) with competitive and cooperative cross-platform multiplayer gameplay. Designed and developed by a single individual driven to share his passion for gaming with the world, Hero Mages also blends the best elements of tabletop miniature and collectible card games. <br/><br/>*** GAME PLAY *** <br/><br/>Hero Mages is played from a top-down perspective allowing the player full visibility over the battlefield. Each player commands a party of three fantasy heroes, including a powerful mage. Equipped with a set of dice and a hand of cards representing magical spells, players take turns commanding their party of heroes. With the power to unleash the wrath of the elements, summon heinous creatures, and manipulate the world itself, the player&amp;#39;s mage is their ultimate hero as they leverage skill, politics, and luck to eliminate their enemies and emerge victorious! <br/><br/>*** GAME FEATURES *** <br/>&amp;gt;Multiplayer: Cross-platform, realtime, and asynchronous turn-based multiplayer are supported! Play free for all, team, and cooperative games with up to 8 players per game from all over the world!<br/>&amp;gt;Six campaign missions entertain your sense of fantasy RPG humor as the precocious characters of Papillion teach you how to play this simple yet compelling game <br/>&amp;gt;Over 80 diverse spells and abilities offer limitless opportunities for creative strategies and intense, climatic struggles <br/>&amp;gt;6 unique playable character classes to build your offline and multiplayer battle party (Sorceress, Fighter Mage, Warrior, Paladin, Rogue, and Bard) as well as special characters encountered in the single player campaign and used by the computer. <br/>&amp;gt;Expand your playable character roster and create custom levels via In-App purchases<br/>&amp;gt;Quick Battle – An offline, single player mode that pits the player in a randomly generated battle against the computer. <br/>&amp;gt;Custom Battle – An offline, single player mode that allows you to create custom battle scenarios against the computer <br/>&amp;gt;Robust multiplayer statistics tracking and leaderboards <br/>&amp;gt;Play on any device! Hero Mages automatically adapts to fill the screen of your iPhone and iPad. <br/>&amp;gt;Rejoin Live Games – Spectate live games or rejoin a game if you lose your connection <br/><br/>*** SHARE YOUR THOUGHTS *** <br/><br/>I am serious about my commitment to evolving this game and I take all player feedback to heart. If you have any issues with the game, please contact me using the support website before writing a negative review (I typically respond within the hour- seriously). Your positive reviews and encouragement are what keeps me motivated to continue producing quality content. Let me hear what you have to say! <br/><br/>***ABOUT D20STUDIOS AND CREATOR ROSS PRZYBYLSKI*** <br/><br/>D20Studios is a one-man team: it&amp;#39;s just me, Ross! I am a passionate indie developer seeking to bring together the best elements of collectible card games (CCGs) like Magic the Gathering, tabletop war games like Warhammer and Warhammer 40k, and role playing games (RPGs) like Hero Quest, Dungeons and Dragons, and Final Fantasy Tactics. <br/><br/>Hero Mages is the culmination of a vision I began nearly six years ago as a physical board game incarnation with hand-painted miniatures, custom-made cards, and a bag full of D20&amp;#39;s. With the support and encouragement of my friends and family, I took my passion to the digital realm to bring the characters of Papillion to life and deliver a unique game that can be instantly enjoyed on your favorite mobile device. <br/><br/>Thanks for checking out my game! See you on the battlefield!", "metacritic": null, "released": "2012-04-11", "tba": false, "updated": "2019-10-25T04:45:26", "background_image": "https://media.rawg.io/media/screenshots/11b/11bab98278967a646a93552d04b39292.jpg", "website": "http://www.heromages.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 248, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "Android"], "developers": ["D20Studios"], "genres": ["RPG", "Strategy", "Arcade"], "publishers": ["D20Studios"], "esrb_rating": "Everyone 10+"}