{"id": 126298, "slug": "reviva-early-alpha", "name": "Reviva (Early Alpha)", "name_original": "Reviva (Early Alpha)", "description": "<p><em>\"Memories can never be destroyed… at least not memories worth keeping.\" </em></p>\n<p>Reviva is a narrative-based interactive adventure. The player takes flight as Bailey, a spunky older sister who prides herself in looking after her mischievous younger brother, Chase. One day, Chase accidentally causes the end of the world as we know it, and then disappears - leaving Bailey left behind. By restoring the landscape with her magic wand and taking pictures of the newly revived world, Bailey remembers her brother's life and the patchwork of memories making up all the good (and bad) things that have happened along the way. Explore the ruined world and bring it back to life.</p>\n<ul><li>Customizable movement settings to keep all players comfortable (including those sensitive to VR experiences)</li><li>Take pictures of your discoveries and uncover the secrets of the world</li></ul>\n<p>Reviva is in early alpha. The video is taken from a <strong>Gear VR</strong> build. You may download a PC version for Oculus Rift of the alpha below. </p>\n<p>Download the zip file, unzip everything into a folder. Execute reviva.exe and allow permissions to run.  Use arrow keys to move around on PC, press B to start/stop flying, press A to continue screens or text, or press X to take a picture. Requires controller, or keyboard.</p>\n<p>Reviva was a winner of the <strong>Oculus  Launchpad Scholarship!</strong><br/></p>\n<p>Fly around, revive the world!</p>", "metacritic": null, "released": "2016-08-19", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/934/93488b1a51b9743e4f88bf44ae728805.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 234, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Intropy Games"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}