{"id": 12627, "slug": "into-the-void", "name": "Into the Void", "name_original": "Into the Void", "description": "Into the Void is a strategy RPG and exploration sci-fi game with an epic story and intense battles. Travel through space and discover the origin of a cosmic threat which destroyed Earth centuries ago. Fight or cooperate with the different factions; be a leader !<br/><br/><br/>Fully command your faction. Build your fleet, arm it with tons of weapons and make all of your enemies’ burn.<br/>You are responsible as a leader of all your choices, your people count on you.<br/><br/><br/>Perform expeditions to outer space; gather ressources and take care of your crew's morale as it greatly influences your power.<br/>You will choose the path through the stars and will discover many surprises.<br/><br/><br/>Research tons of techs. You can't open all of them in one play-through, as there are lots of combinations. Choose your style of combat, adapt your strategy to your ennemies and arm your fleet.<br/><br/><br/>Fight with different opponents. Each faction has its own tactics and technology stack, so you should plan your fleet equipment carefully.<br/>Don't underestime the factions : En Eire, Kalthem, Auslia or The Brigadier's of Armageddon.<br/><br/><br/>Space is a serious business. In space, there's no place to mistakes. So choose your options wisely, as turn-based system fully allows that.<br/>There are no \"good\" or \"bad\" choices, only consequences.<br/><br/><br/><ul><li>great Rpg/tbs Mix With Unique Depth.<br/></li><li>Randomly generated universe - each mission is unique every time you play it.<br/></li><li>Long and interesting storyline.<br/></li><li>Battle against 4 different factions.<br/></li><li>Epic space turn-based battles.<br/></li><li>Laser, Kinetic, Plasma and Explosive weapons: each with unique pros and cons.<br/></li><li>16 main missions<br/></li><li>20 sub-missions<br/></li><li>Lots of battle ships with modifications<br/></li><li>Over 100 technologies in 4 different branches - choose them wisely.<br/></li><li>Tons of different items, from engines and shields to drones and infiltration squads.<br/></li><li>Great visuals</li></ul>", "metacritic": null, "released": "2015-12-04", "tba": false, "updated": "2019-09-17T12:12:23", "background_image": "https://media.rawg.io/media/screenshots/1e4/1e40e4efc378cb6b13e40c6e9d0ea32b.jpg", "website": "https://www.facebook.com/MozgLabs/", "rating": 0.0, "rating_top": 4, "added_by_status": {"yet": 3, "owned": 121, "dropped": 1}, "playtime": 5, "achievements_count": 19, "ratings_count": 5, "suggestions_count": 347, "game_series_count": 0, "reviews_count": 5, "platforms": ["PC", "Linux", "Android", "macOS"], "developers": ["Mozg Labs"], "genres": ["Adventure", "RPG", "Strategy", "Indie"], "publishers": ["Mozg Labs"], "esrb_rating": "Teen"}