{"id": 126212, "slug": "moderate-cuddlefish", "name": "Moderate Cuddlefish", "name_original": "Moderate Cuddlefish", "description": "Moderate Cuddlefish \r\ncuttlefish (eng.) = Tintenfisch (z.B. Oktopus); cuddle (eng.) = knuddeln\r\n<p>Die offizielle Website von Moderate Cuddlefish ist http://moderate-cuddlefish.de.</p><p>In Moderate Cuddlefish bewertest du als Moderierende*r eines fiktiven Microblogs die Beiträge (cuddles) der User*innen mit dem Ziel, anhand von vorgegebenen AGB Aggression und Gewaltpotential zu filtern. Aufgrund der rasanten Geschwindigkeit der User*innen-Beiträge — von seriösen Beiträgen bis hin zu hate speech — werden im übertragenen Sinn wie bei einem Tintenfisch mehrere Arme benötigt, um in Cuddlefishs Newsfeed demokratische und faire Kommunikation zu gewährleisten. Aber pass auf: Löschst du Beiträge, die viele Likes (Tintenflecke) haben oder radikalisieren sich Einzelne, verlassen User*innen die Cuddlefish-Plattform...</p>\n\n\n<p><strong>Hintergrund des Spiels:</strong><br/></p>\n<p>Die spielende Person soll authentisch den Entscheidungsdruck eines Moderierenden im Kontext von Social Media zur aktuellen Flüchtlingsdebatte nachspielen und nachempfinden. Hierzu gehört die unmittelbare Konfrontation mit Gesprächsgeschwindigkeit und Diskussionsüberschneidungen in einem Microblog. Entscheidungen werden durch news und Userverluste/ -gewinne und Zeit beeinflusst. Die individuelle demokratische Urteilsbildung soll kritisch angeregt werden. </p>\n<p>Eine Visualisierung am Ende eines jeweiligen Levels ermöglicht, die eigenen Entscheidungen noch einmal kurz bewusst zu reflektieren. Zur Spielhandlung gehört der Umgang mit Reizwörtern, die Grenzbestimmung von Ironie und Verletzung und die Moderationsfertigkeit sich überkreuzende Gesprächsverläufe konstruktiv zu ordnen. Dieses Spiel beabsichtigt, den Perspektivwechsel vom Diskursteilnehmer auf Social-Media-Ebene auf den Verantwortungsbereich eines Moderator*in zu übertragen.</p>\n\n\n<p><strong>Ausblick:</strong></p>\n<p>Wir würden das Spiel gerne in andere Kontexte einbringen, wie zum Beispiel in den Unterricht an Schulen oder  tatsächliche Online-Communities.</p>\n\n\n<p><strong>Making Of / Credits:</strong></p>\n<p>Moderate Cuddlefish ist einer der entstandenen Beiträge zum Gamejam 'Flucht und Vertreibung' der Bundeszentrale für politische Bildung.</p>\n<p>Die Konzeption des Games entstand im Teamdialog, ein erster Papier-Prototyp wurde mit nanDeck hergestellt und mit Testspielerinnen verfeinert. Die Cuddle-Texte und AGB recherchierten und schrieben Elise Maureen Merkel, August von Gehren und Sebastian Staack, den Prototyp programmierten Manuel Manhard und Isabel Paehr. Die Gestaltung übernahm Isabel Paehr, das Sounddesign August von Gehren. Das Besondere bei der Teamarbeit waren die unterschiedlichen Hintergründe der Teammitglieder: Soziale Arbeit, Geschichte und Philosophie, Visuelle Kommunikation, Game Development.</p>", "metacritic": null, "released": "2016-08-21", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/3db/3dbda00f80522dfc51f3d8bfba30c2d5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 62, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "Web"], "developers": ["Cuddlefish"], "genres": ["Simulation", "Educational"], "publishers": [], "esrb_rating": null}