{"id": 126329, "slug": "the-imitation-game", "name": "The Imitation Game", "name_original": "The Imitation Game", "description": "Description\r\n<p>The Imitation Game is a multiplayer game based around a variation called the Imitation Game of the Turing test by Alan Turing. There are 2 players and 1 bot in every game. You either play as a detective or deceiver, and as a detective, your role is to decipher and name who the bot is by asking a limited amount of questions, whereas the deceiver's role is to fool the detective into thinking you're the bot.</p>\r\nGameplay Mechanics\r\n<p>The game features a single multiplayer mode, with various difficulties (from Easy to Hard), and an optional singleplayer mode should there be no players available. There is a fully-fledged ranking system and EXP which you can gain by winning as the detective and/or deceiver. You can either be a Master Detective or Master Deceptor, with winning/losing as the opposite role costing you your rank.<br/>Each match supports up to 2 human players, and features and intelligently coded bot, which behaves similarly to a human.</p>\r\nFeatures\r\n<ul><li>Fully-fledged multiplayer, with singleplayer bots if no one is available to play with</li><li>Rank/EXP system</li><li>Intelligent bot trained to talk like a human, and ask questions like a human in singleplayer</li><li>Multiple difficulties</li></ul>\r\nCredits\r\n<p><strong>Carnage [CarnageGames] </strong>- Developer, ideas, and everything else<br/><strong>FreeSound </strong>- Sound effects</p>\r\nDeveloper's Notes\r\n<p>This game was made back in 2016, and I did up to about 80% of it, before moving onto projects. I've recently picked it up and finished it off, seeing the potential for the game. It is <em>completely</em> free to play, but I would <em>sincerely </em>appreciate a donation, no matter how small or big, for the work I've put into the game. Thanks for playing!</p>", "metacritic": null, "released": "2017-08-12", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/291/291eead472c49724bcb4e9af040fc0fe.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 56, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["CarnageGames"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}