{"id": 126427, "slug": "dungeon-driver-early-access", "name": "Dungeon Driver (EARLY ACCESS)", "name_original": "Dungeon Driver (EARLY ACCESS)", "description": "<p><strong><em>THIS GAME IS NOW BEING DEVELOPED BY #JEFFDEV, THE CREATOR OF GRIDLOCKED AND THE SOON TO BE EXISTING, MICRO.</em></strong><br/></p>\n<p>Dungeon Driver is @King109_109Dev 's next title.</p>\n<p>Dungeon Driver is a hectic arcade top down shooter dungeon crawler inspired by the likes of Binding of Isaac, Nuclear Throne, and Geometry Wars.</p>\n<p>The current state of this game is a fully playable arcade mode and a WIP normal mode but is still in development. The game is VERY early access, so expect a few bugs and blunders!</p>\n<p>Dungeon Driver's future is a fully complete dungeon crawler mode and arcade mode. The game will have TONS of crazy weapons, and tons of ridiculous car based enemies, ready for you to kill. I am hoping to make Dungeon Driver as high quality of an experience as possible, while still being fun and insane.</p>\n<p>The itchio download will be updated of course, adding new features ( and bugs ) to make the play more interesting and fun!</p>\n<p>I hope you have a grand ol' time with this and can't wait to keep working on it!</p>\n<p>NOTE FROM #JEFFDEV: Hey guys, I'm #jeffdev, the creator of gridlocked and not very soon to be released micro! King decided to hand over development of this game to me, so that it wouldn't be abandoned which was his original plan. I have big plans for this game and hope to fully finish it, to give you guys Dungeon Driver Completed! Thanks for sticking around everyone if you have!</p>\n<p>Developer: King109 (now #jeffdev)</p>\n<p>Publisher: 109Dev</p>\n<p>CONTROLS:</p>\n<p>Arrow keys and space to control menu</p>\n<p>WASD to move</p>\n<p>Arrow keys to shoot</p>\n<p>CHANGELOG:</p>\n<p>- Frost Cannon should no longer crash the game</p>\n<p>- the TNT AR player should no longer be immortal</p>\n<p>- you can now toggle fullscreen in the Tier 2 results screen</p>", "metacritic": null, "released": "2016-07-30", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/971/9718a6f975522bde9da627231a3acfed.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 9, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["109Dev"], "genres": ["Action"], "publishers": [], "esrb_rating": null}