{"id": 126473, "slug": "square-roots", "name": "Square Roots", "name_original": "Square Roots", "description": "<p>Created in 72 hours for Ludum Dare 37 (Theme: One Room)<br/><br/><br/>You play as a human lost in space, trying to keep the a seed of a plant from his home planet alive with some \"advice\" from your helpful AI. </p><p>ALL YOU NEED TO KNOW: <br/><br/>Drag the Tetris-like pieces onto the monitor in the middle to play. </p><p>Left and Right click are the only buttons pretty much. </p><p>Hint: Try dropping minerals on the radar to use them later with right click.<br/><br/><br/><br/><br/><br/>We won't give much more instruction than that-- we think you're all smart enough to figure it out. </p><p>We did succeed to some small degree in a goal of ours: developing rudimentary procedurally generated puzzles. However, the concept for the game was what it is now plus an explore the universe meta-game that would influence the main puzzles. </p><p>What we had in mind was something like FTL (interact or trade with aliens, explore broken space junkers to gain power-ups and more minerals) combined with the mini-game mechanic from the combat in Undertale (Oh no! An asteroid best, use WASD to maneuver through it on this drop down screen!). Unfortunately, we had only half of our team this weekend so we came nowhere close to fitting in everything we wanted in 72 hours. We did get to tell the main story we wanted to though through the dialogue cues. <br/><br/><br/><br/><br/><br/></p>", "metacritic": null, "released": "2016-12-16", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/591/591753337a2cb23a46c3b22123deefbb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 34, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["HeartLamp"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}