{"id": 12643, "slug": "90-minute-fever", "name": "90 Minute Fever", "name_original": "90 Minute Fever", "description": "Our mission statement is to create the best football management MMO ever whilst giving proper respect to the sport of football and the fans of this genre. That's why we started from a blank canvas and designed from the ground up what we thought an online football manager game should be all about - a fair, competitive and long-term game play experience with the perfect balance between realism and fun. We see ourselves as innovators and pioneers creating an experience for our users that no other game on the market is able to offer them.  We are football.  We are MMO.  We are 90 Minute Fever!<br/><br/><strong>True MMO</strong><br/>A vibrant and thriving online community with all users in a single, persistent online world. Frequent and meaningful interaction between users, and a robust user-driven economy. <br/><br/><strong>Live Matches Against Real People</strong><br/>Play matches using our live interactive match simulator. Make substitutions and tactical changes during the game and watch how these affect the match. 90MF will put you head to head in a battle of wits against other users to see who has superior tactical nous!<br/><br/><strong>Create Your Own Football Club</strong><br/>Fully customise your team’s appearance and stand out from the crowd. Design a logo and strip for your team using the 90MF Club Creation Kit. Build upon an initial squad of players to make you competitive and create the tactics that get the most out of them.<br/><br/><strong>Real Players from all of Football History</strong><br/>90MF's innovative Reborn Legends system brings real players from all era's of football history into the present.  Now YOU can finally settle the age old argument of who are the greatest players of all-time!<br/><br/><strong>Compete with Experienced Users</strong><br/>In other online football management games you simply cannot hope to compete with experienced users.  90MF is designed so that a new user, with skill and good decision making, can catch up with more experienced managers.<br/><br/><strong>Perfect Balance Between Realism and Fun</strong><br/>With over 50 attributes separately rated, each footballer in 90MF is totally unique. A highly active transfer market that fully leverages the fact 90MF is an MMO. A realistic financial model where prudent planning yields long term results. In 90MF you are immersed into a fun and realistic online football world that will constantly challenge and leave you striving to improve yourself as a football manager.<br/><br/><strong>Skill Based Gameplay</strong><br/>Enjoy a fair, competitive and realistic game play experience with no need to worry about having to 'pay-to-win' in order to compete. Achieving success in 90MF requires skill and dedication, not a bottomless wallet!Message from the Dev Team\"90MF is a proper MMO, with a real online community. It is a competitive skill based game that requires long term planning in order to achieve success.  90 Minute Fever is all about enjoying the experience and fully immersing yourself into the football management world that’s been created for you, rather than subjecting yourself to a mundane daily routine to grind your way up a never-ending pyramid.  It is being developed by people who genuinely love football and football management games, and wanted to design and build a game for users to enjoy, rather than to bleed money out of them.  It is philosophically the polar opposite of the browser and mobile based online football management games that saturate the market today.\"<br/><br/><strong>Important note:</strong> This is an Early Access title that is still in development.  Please be aware that a number of features are currently still being developed and not implemented in the game yet. Before deciding to buy this product we strongly suggest that you read the Early Access Game information on the store page so that you are fully aware of the current state of the game and ensure that it isn't missing any features you consider to be critical in order for you to be able to enjoy a football management game.", "metacritic": null, "released": "2016-07-12", "tba": false, "updated": "2019-07-25T12:13:21", "background_image": "https://media.rawg.io/media/screenshots/064/06492486b07f602dc68b1022f20cb2a7.jpg", "website": "http://90minutefever.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 129, "dropped": 2}, "playtime": 40, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 356, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "macOS"], "developers": ["Isokron"], "genres": ["Simulation", "Sports", "Massively Multiplayer"], "publishers": ["Isokron"], "esrb_rating": null}