{"id": 126499, "slug": "beat-street-itch", "name": "Beat Street (itch)", "name_original": "Beat Street (itch)", "description": "<p>A rhythm city building game. Build a sustainable city by managing the needs of each building, pollution, crime, happiness, fires, and more! Every building you add creates a new note on the rhythm bar that you must upkeep. Missing notes will mean that building won't do its job that day. You'll need a good city planning strategy, quick fingers, and superior rhythm to build the biggest city you can.</p>\n<p><strong>Controls</strong></p>\n<ul><li>Q, W, E, R - Plays the corresponding note on the rhythm bar</li><li>Space - Toggles pause mode</li><li>Mouse - Use to choose and place buildings</li><li>Numbers 1-9 - Toggles the different overlays (supplied electricity, water, etc)</li></ul>\n<p><strong>The Buildings</strong></p>\n<ul><li>Residential - Increased population and generates income, pollution, and crime</li><li>Fire Station - Fights fires that occur nearby</li><li>Police Station - Lowers crime nearby</li><li>Generator - Supplies power buildings that need electricity</li><li>Pumping Station - Supplies water to buildings that need water</li><li>Waste Disposal - Lowers pollution nearby</li><li>Entertainment - Increased happiness nearby</li></ul>\n<p><strong>How to play</strong></p>\n<ul><li>The goal of the game is to maintain the highest population and happiness you can.</li><li>When you place a building it will be added to the rhythm bar as a note. This note will repeat once a day.</li><li>If you don't play a buildings corresponding note it won't function that day. For example, missing a fire station's note means it won't fight fires on that day!</li><li>Happiness is determined by how well you control pollution and crime around these residential buildings. You can use entertainment buildings to increase it as well.</li><li>Watch out for fires! If you don't put them out they will burn down the building and spread!</li><li>You can use space bar to pause the game and take a breather if you are getting overwhelmed. While paused you can look at the overlays and switch you selected building but not place buildings.</li><li>Each note you play costs a small amount of money. Be wary of spamming the notes when there are no building notes to play!</li><li>Try and play each note when it is close to within the light blue lines on the rhythm bar.</li><li>You can track each day using the clock in the bottom corner or the yellow new day line on the rhythm bar. New days mean income from your residential buildings and the reset of all your buildings notes.</li><li>Try and time your building placements on the rhythm bar to create consistent beats that you can play without looking.</li></ul>\n<p><strong>How big can you make YOUR beat street become?</strong></p>", "metacritic": null, "released": "2018-04-24", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/023/023cf5d18ac1ec82a35e98353c8e527e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 45, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Solluxx"], "genres": ["Simulation", "Puzzle"], "publishers": [], "esrb_rating": null}