{"id": 12658, "slug": "dark-forester", "name": "Dark Forester", "name_original": "Dark Forester", "description": "Dark Forester is a Hardcore Forest Management Game that employs your best aspects of the RPG, RTS, Crossplatforming MMO and god game genres. Create your own forest, customize it like your heart's wishes, set magic and physical traps. Protect your land from enemy waves! I would be thrilled to have you join Dark Forester! I would like to improve game based upon your feedback! <br/><br/>Dark Forester is in continuous development! Dark Forester is made by a single, obsessed developer. You can always contact me at sergey@morozovsergey.com<br/><br/><strong>Beta 2.0 (18.02.2017)</strong><br/>Mix of RPG/Strategy and God game.<br/>Summon units, traps, buildings, trees, mushrooms and more to protect your forest.<br/>Maximal character level 7. The game difficulty was increased pretty high.<br/>Infinity enemy waves. First 61 Waves made by Author.<br/>Hardcore<br/>Primary and Secondary skills<br/>30 different enemies, 60 different enemy specifications, 5 Bosses and<br/>Werewolf - first monster in the game who will profit from werewolf neural network.<br/>Three magic schools<br/>Live forest with animals, birds, butterflies and magic trees.<br/>Complete 3d World where weather and daytime influence some aspect of the game.<br/>Upgrade System.<br/>Almost all objects can be destroyed. <br/>PvE Rating System.<br/>PvE Season<br/>Sessional Inventar<br/><br/><br/><strong>Release:</strong><br/>History involve all aspects of the game inclusive PvP.<br/>PvP destroy enemy forests.<br/>Maximal character level 20. <br/>More Buildings, traps, enemies and so on.<br/>Portals - Part of the game (more about portals comes later. It is something like Dungeon Keeper with hack and slash elements). <br/>Garnisons<br/>Neural network<br/>Sandbox elements<br/>PvP and PvE Seasons<br/>Five magic schools<br/>Dailys <br/><br/>\"Rodina is in continuous development! Please try the free demo before buying!<br/>Rodina is made mostly by a single, obsessed developer - a 10-year veteran of the games industry who previously worked at Bethesda Softworks on Oblivion and Fallout 3. You can always contact me at brendan@elliptic-games.com\"", "metacritic": null, "released": "2015-02-09", "tba": false, "updated": "2019-08-28T22:13:09", "background_image": "https://media.rawg.io/media/screenshots/d43/d43d2bf351029fdfadd05695b14d1f2a.jpg", "website": "http://www.darkforester.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 14}, "playtime": 6, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 343, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Morozov Sergey"], "genres": ["RPG", "Strategy", "Massively Multiplayer", "Indie"], "publishers": ["Morozov Sergey"], "esrb_rating": null}