{"id": 12664, "slug": "dwarf-tower", "name": "Dwarf Tower", "name_original": "Dwarf Tower", "description": "Dwarf Tower is a turn-based tactics game of tower building and spellcasting. Each turn you develop your tower by placing blocks, constructing rooms, and play various spells. Your tower can have Libraries (store spells), Crystals (generate mana), Dwarf Dwellings (give you dwarves to repair the tower) and some other rooms. The crucial room is Archmage's Chamber. It's position is hidden from enemy and you must protect it at all costs, or you will lose. Room scheme is very important: the higher you place it, the more powerful it gets. Higher tower gets tremendous advantage over the lower one. But beware of Lightning strike! It can start a fire that will destroy the whole tower in several turns, so keep Dwarf Firefighters ready. Some rooms work much better underground, but there is a risk of flood! The overall goal of the game match is to destroy the enemy's Archmage's Chambers by crushing, burning or flooding it. It's not that simple however, because enemy will do his best to destroy your Archmage at the same time! <br/>\n<br/>\r\nThe game features single player mode against the computer as well as multiplayer mode. You can challenge your friends right now. <br/>\n<br/>\r\nThink of Sea Battle, mixed with some Worms fun, and Faster Than Light room management. Add beautiful pixel-art graphics, animation, and wonderful music from Kevin MacLeod.", "metacritic": null, "released": "2014-12-23", "tba": false, "updated": "2023-12-18T23:30:48", "background_image": "https://media.rawg.io/media/screenshots/ba0/ba06ba9a4866a0b34ecd5bd0e99609e6.jpg", "website": "http://www.palmkingdoms.com", "rating": 2.5, "rating_top": 3, "added_by_status": {"yet": 1, "owned": 118, "beaten": 2, "toplay": 1, "dropped": 2}, "playtime": 3, "achievements_count": 45, "ratings_count": 6, "suggestions_count": 74, "game_series_count": 0, "reviews_count": 6, "platforms": ["Android", "PC", "macOS"], "developers": ["iosoftware", "Super Clean Solutions"], "genres": ["Strategy", "Indie"], "publishers": ["iosoftware"], "esrb_rating": null}