{"id": 12667, "slug": "dark-shores", "name": "Dark Shores", "name_original": "Dark Shores", "description": "<strong>An experimental horror game with perma-death, branching narratives, and dynamically adapting terror. A new game from LABS, a one-man studio.</strong>Game DescriptionExplore and survive on the Dark Shores, a survival horror game that explores concepts of perma-death, branching storylines, and unscripted horror.<br/><br/><br/>A luxury cruise containing five young tourists crashes on a remote island, deep within the South Pacific. As the tourists struggle to survive on the island, they soon realize that keeping themselves fed and sheltered is the least of their worries. There’s something else on this island. Hunting them.Key Features<ul><li>Permanent DeathIn most games, when the player dies, they would respawn at a checkpoint. This however makes death less meaningful, as the player knows that if they get caught, they can just start again. This essentially means that any scary moments lose their appeal instantly. But in Dark Shores, the severe consequences elevate the tension.</li></ul><ul><li>Branching NarrativeWhen the player dies as one character, the story continues as another. This makes for a branching storyline, where the outcome is entirely dependent on who lives, and who dies.</li></ul><ul><li>Unscripted FearLABS focused on an un-scripted hunter in an attempt to create fear that isn’t linear. Once the player becomes aware of the scripted nature planned jump scares, the metaphorical curtain is pulled back, and horror games can lose their impact. To avoid being just a simple haunted house, a level of unpredictability has been added.</li></ul>", "metacritic": null, "released": "2017-02-13", "tba": false, "updated": "2019-08-28T22:13:09", "background_image": "https://media.rawg.io/media/screenshots/851/851e72c5f9cb3f3cd24da5fba36a070d.jpg", "website": "http://darkshores.tumblr.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 24}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 305, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["LABS Games"], "genres": ["Indie"], "publishers": ["LABS"], "esrb_rating": null}