{"id": 126693, "slug": "warlock-v-wizards", "name": "Warlock v Wizards", "name_original": "Warlock v Wizards", "description": "<p>Research project from FamSquatSquad: https://famsquatsquadblog.wordpress.com/</p>\n<p>Check out the  research papers:<br/></p>\n<ol><li>https://famsquatsquadblog.wordpress.com/2017/08/04/rethinking-sociality/</li><li>https://famsquatsquadblog.wordpress.com/2017/08/15/social-virtual-reality/</li></ol>\r\nConcept\r\n<p>The evil Warlock has turned the forest into his fortress, leaving nothing but death and destruction. The task is now for the great wizards to restore the peace and beauty of the forest by destroying the Warlock, but beware. The warlock does not intend to give up on his deathly stronghold.</p>\r\nObject\r\n<p>You win the game by being the last player/team standing. This is achieved by killing the opponent(s) with spells that are produced by the wands (controllers). So, either the Warlock wins or the Wizards win.</p>\r\nSetup\r\n<p>This game consists at least 3 players. One evil warlock and at least two great wizards. The wizards must be in possession of a smartphone each. Before entering the game, the Wizards must connect their smartphones to the VR headset, so interaction can happen.</p>\n<p>The player with the VR headset (Warlock) is placed in the center of the arena, while the other players (wizards) are gathering around the warlock within the arena.</p>\r\nPlaying the game\r\n<p>As the game begins, the Warlock is located in the middle of the dark forest, unable to see anyone of the opponents at this point. The wizards are possessed with different spells, but none of the spells can be used at the beginning of the game. The wizards have invisibility spells cast upon them, but the effect of the invisibility is stirred by movement and sound. To redeem the spells, each player has to walk around in the arena to create energy enough to complete the spell. Every movement will increase the power of the wand, but at the same time, every movement can be visualized in the virtual world, if it is not performed silently. At the same time the energy of the wand can be visualized in the virtual world, so do not hesitate casting the spell, before the invisibility repeals. The question is now, when is the right time for the wizards to throw their spells? A powerless spell will only decrease the Warlock’s life by a bit, so teamwork and non-verbal communication are keywords for the wizards, if they want to succeed in this battle. And beware, the warlock is in possession of a powerful wand that kills the opponent with only one strike.</p>", "metacritic": null, "released": "2017-12-30", "tba": false, "updated": "2019-08-23T11:27:41", "background_image": "https://media.rawg.io/media/screenshots/c8d/c8dbe7b253a0c70dce612f645b0b3579.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 44, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Erik Hoyjor"], "genres": [], "publishers": [], "esrb_rating": null}