{"id": 126714, "slug": "rebound-itch", "name": "Rebound (itch)", "name_original": "Rebound (itch)", "description": "<p><strong>16K ZX81 - 2014</strong></p>\n<p>My interpretation of a Breakout / Arkanoid game, with 32 unique levels, 16 ball directions, multiple balls, and power-ups.</p>\n<p>Breakout has been a popular game now for over 30 years, and was probably one of the first games I typed into a ZX81 from a book of BASIC listings. I realised recently that it was a game genre which I hadn't revisited since then, and also that there didn't seem to be proper modern version of the game for the '81 - so I thought I should give it a go, as every platform should have one.<br/> <br/> Breakout - as Atari originally did it - is a reasonably straight-forward game to program, but the addition of bonus bricks, weapons, and multiple balls (etc) make it more difficult to code, but much more interesting and addictive to play than the original, which can frankly get somewhat boring after a while. Again I've kept to the low-res display, which can make some of the 16 possible ball directions appear a little jerky in movement, but I don't think it detracts from the overall playability of the game.<br/> <br/> This game is also the first I've written to utilise the colour facilities of the Chroma 81 interface, which provides a non-intrusive way of connecting any ZX81 to a modern TV (via a SCART cable), along with a ROM cartridge slot, reset switch, and also - and most importantly for this game - a method of adding colour to the machine, and in a way which is actually better than the Spectrum!<br/> <br/> More details on the interface can be found here.</p>", "metacritic": null, "released": "2017-12-21", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/744/744b86b3eacb59112f220d79dc35bfea.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 52, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Bob's Stuff"], "genres": ["Action"], "publishers": [], "esrb_rating": null}