{"id": 126871, "slug": "inhouse-baristas", "name": "Inhouse Baristas", "name_original": "Inhouse Baristas", "description": "<p><strong>Inhouse Baristas</strong> lets you dive into the daily work of a <strong>barista</strong> in an office full of software developers! Fill their power up <strong>with some coffee</strong> in lots of variations! But hurry up, because their power is running out!<br/></p>\n<p>Deliver as much coffee as you can in 3 minutes and get tips from your happy customers.</p>\n<p>You can play in <strong>three modes</strong>:</p>\n<ul><li><strong>Single Player</strong></li><li><strong>Two Player Co-Op</strong></li><li><strong>Two Player VS</strong> </li></ul>\n<p><strong>How to play</strong></p><p>Please look closely at the gif on top of this site. It explains how to brew a coffee, step by step.</p>\n<p>1) Your first look goes to the customers at the counter, see their coffee wishes. The amount of beans indicates, how many beans you have to fill in the coffeemill. Does the costumer have a glass milk over his head he wishes his coffee with milk. Sometimes he wants a cup of pure milk.</p>\n<p>2) So you put the amount of beans in the coffeemill, pay attention that the coffeemill tray is in the coffeemill. Then you press 5x shift to get the beans milled. Yaay your first selfmade ground coffee! Get the stuff out of the mill by pressing enter and put them into the coffeemachine.</p>\n<p>3) In the next step you get water for the coffee. Go to the water glass on the left, grab it by pressing enter and put it in the coffee machine.</p>\n<p>4) Activate the coffee machine by pressing shift and wait for the coffee to brew. While waiting you can set up other things e.g. get a coffee cup or put new beans to the mill.</p>\n<p>5) Wait for the coffee to get brewed. Meanwhile you can set up other things e.g. grab a cup or put new beans to the mill.</p>\n<p>6) Get the coffee from the coffeemachine, go to the cup and press shift to fill it.</p>\n<p>7) Put the coffeepot back to the coffee machine.</p>\n<p>8) Customer is happy and spend you a tip </p>\n<p>The ludum dare version lacks of telling you exactly what to do and how to brew coffee. We are sorry for that  We try to deliver you a better experience of the game in the next few weeks.</p>", "metacritic": null, "released": "2017-07-31", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/b94/b9477c2b84e14eb3a19bc271f025a239.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 56, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MarinWin"], "genres": [], "publishers": [], "esrb_rating": null}