{"id": 126944, "slug": "el-autentico-brujo-del-norte", "name": "El Autentico Brujo del Norte", "name_original": "El Autentico Brujo del Norte", "description": "<p>Somos 3 locos que gustan de los unicornios, gatos, pizza, energizantes y desarrollo de videojuegos. Andamos de vacaciones y el tiempo libre nos está volviendo locos ... así que vamos a desarrollar un juego.</p>\n<p>Para hacerlo mas divertido, pedimos la participación de nuestra gente en redes. Como funciona:\r\n</p>\n<p>- Cualquiera puede participar, solo tienes que comentar esta publicación con el tema que usaremos para el videojuego.</p>\n<p>- Hasta 2 palabras por tema (puede ser una palabra, por ejm: Infidelidad o Efecto Colateral).</p>\n<p>- Abstenerse de vulgaridades (sean creativos!).</p>\n<p>- El ganador sera escogido este Domingo 15 de Julio en la noche.</p>\n<p>- Nos pondremos en contacto con el ganador para pedirle varios datos (foto, como quiere que lo personifiquemos, etc).</p>\n<p>- El videojuego lo publicaremos este Miércoles 18 de Julio en itch.io de forma gratuita para que lo puedas jugar en la PC.</p>\n<p>________________________________________________________________________________________________________________________________________\r\n</p>\n<p>We are 3 crazy duces who like unicorns, cats, pizza, energizers and video game development. We are 3 crazy duces who like unicorns, cats, pizza, energizers and video game development. We are on vacations and the free time is making us insane..so we are going to develop a game. </p>\n<p>To make it more fun, we ask for the participation of our people in networks. How does it work:\r\n</p>\n<p>- Anyone can participate, you just have to comment on this publication with the theme that we will use for the videogame.</p>\n<p>- Up to 2 words per subject (can be a word, for example: Infidelity or Collateral Effect).</p>\n<p>- Abstain from vulgarities (be creative!).</p>\n<p>- The winner will be chosen this Sunday, July 15 at night.</p>\n<p>- We will get in touch with the winner to ask for various information (photo, how you want us to personify it, etc).</p>", "metacritic": null, "released": "2018-07-19", "tba": false, "updated": "2019-08-28T23:23:22", "background_image": "https://media.rawg.io/media/screenshots/381/3818bf7d3e05901b81fbfa289b20b7d7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 120, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["LordalZero"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}