{"id": 127097, "slug": "my-missing-skin-demo", "name": "My Missing Skin Demo", "name_original": "My Missing Skin Demo", "description": "<p>My missing skin is an Oculus Rift role playing game currently ported for the PC via Itch.io there is a future concept plan to port my missing skin to PlayStation VR. You play as Garett, a revived skeleton form a wizard who tells you that you need to dungeon keepers to get parts of your skin back. He gives you a sword and tell you to slay all the goblins and escape from the castle to go find him. Upon leaving the castle you pass by a little village where you will a small store with vendor that sells Armor and Weapons, the village announcer will also give you a key and the location for your next destination.</p><p>After every realm (Zone) there will always be another village, allowing the player to restock on items and buy higher levelled equipment to continue through your game. Each level you come across will have elaborate path ways in which the player can explore and find the realm key to exit the level, facing more powerful enemies with different attacks that you could use to take advantage of newer enemies. </p><p>While Garett fights new enemies, he collects coins from killing them, the coins range from bronze, silver and gold depending on the type of enemy and Garett's current level, along the way Garett can find chests that contain random items for the player to discover but these chests will not regenerate. One of the examples of the type of items that can be found in the chest are elixirs, gold or other mystery items.</p><p>In every Realm there is a Guardian (Boss), the guardian will represent the Alpha of the realm. An Example of this can be found in style of level where there is usually low levelled mobs of enemies or monsters and the Alpha (Boss) will be a much larger and more powerful version of that type.</p>", "metacritic": null, "released": "2016-04-18", "tba": false, "updated": "2019-08-28T23:23:21", "background_image": "https://media.rawg.io/media/screenshots/55e/55eb05afc3e6177c34ca830fb9ba5052.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 63, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["BenjaminPlays1080P"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}