{"id": 127018, "slug": "mushroom-bounce", "name": "MushRoom Bounce!", "name_original": "MushRoom Bounce!", "description": "<p>MushRoom Bounce! is a unique, addictive, 2D physics game where you spin, bop, and ricochet Mushrooms into various holes to clear each level. </p><p>Kino Koichi is the Mushroom Bouncer, a bodybuilding mushroom whose job it is to \"bounce\" unruly mushrooms that are invading human territory! To keep the peace between mushroom and human kind, Koichi is on a mission to get the mushroom outbreak under control. Under ground, above ground, and back in time -- the mushroom madness is spreading in this addictive, crazy, retro, mushroom-bopping adventure!</p><p>Mushrooms abound out of bounds in this wacky mushroom-bopping adventure, set in a myriad of different locations... including some that might leave you scratching your cap. A cafe, the city streets, a desert island, a haunted house -- You never know where the little shrooms might pop up next! </p><p>Cute as they may be, this fungal frenzy is getting out of hand. Time to put these cute little guys back in their place. Like the bouncer at any exclusive club, it's time to bum-rush these mushrooms down whatever convenient hole you can find!</p><p>Join Koichi in level after level of mushroom bouncing fun -- put on your sunglasses and get bouncing today!</p><p>MushRoom Bounce! Features:</p><p>* Realistic, 2D Physics Action </p><p>* Like in Basketball or Billiards, a Mushroom's \"spin\" affects how it bounces</p><p>* Available for Android, Windows, Mac, and Linux</p><p>* Gamepad Support</p><p>* Also supports Keyboard input</p><p>* Leaderboards and Personal High Scores saved to server</p><p>* 33 Unique Areas</p><p>* High Quality 28-song Soundtrack</p><p>* FREE Desktop version includes 26 Levels! (41 Levels in the ad-supported Android version)</p><p>* Tons of Variety -- Each level has its own funny details and surprises</p><p>* (Desktop version) Up to 2 simultaneous players (split-screen competitive mode)</p><p>* (Android version) You can also play using touch controls: fling/swipe action and/or on-screen joystick &amp; buttons</p><p>* (Android version) Supports keyboard input, including joysticks that behave like a mini keyboard</p><p>* (Android version) Optimized for MOGA Controllers</p><p>P.S. Kinoko = \"mushroom\" in Japanese. And ichi means \"one\" so I guess you could say the Bouncer's name is \"Mushroom One\".</p>", "metacritic": null, "released": "2013-12-13", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/9ce/9cefb364b4e076fedde2b1fb43dc5817.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 170, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Android"], "developers": ["TwoSquidGames"], "genres": ["Action"], "publishers": [], "esrb_rating": null}