{"id": 127134, "slug": "refugeeemigrant", "name": "Refugee/EMigrant", "name_original": "Refugee/EMigrant", "description": "<p><strong><strong><strong>A game created in Mexico City as a part of the Gr8ArtGames gamejam series by Goethe-Institute and Maschinen-Mensch</strong></strong></strong><br/></p><p><strong>Video: www.youtube.com/watch?v=6ATd8Blo7AE</strong></p><p><strong>Short:</strong></p><p>El propósito de este juego es ayudar a erradicar temores y prejuicios así como los estereotipos originados por la migración, como pueden ser: el empleo/desempleo, choques culturales, por mencionar algunos.</p><p><strong>Long:</strong></p><p>High Concept Statement: El propósito de este juego es ayudar a erradicar temores y prejuicios así como los estereotipos originados por la migración, como pueden ser: el empleo/desempleo, choques culturales, por mencionar algunos. En la mayoría de las ocasiones los desplazamientos son forzosos, motivados, como hemos señalado, por causas sociales, económicas, políticas o naturales que obligan a adoptar una relocalización social. Features: El jugador leerá la necesidad/fortaleza del migrante (idioma del migrante) mientras tanto tendrá que escribir palabras clave (idioma del jugador) Las palabras claves que escriba el jugador tienen como objetivo sintetizar y empatizar con la situación del migrante. Overview: Player motivation: el objetivo del jugador es escribir/leer las frases y situaciones reales que llegan a vivir los migrantes.Genre: Visual ,Target Customer: Migrantes/No migrantes Competition: NA Unique points: El jugador logrará empatizar y concientizar acerca de la migración, dejando en claro que la diversidad en un país puede traer beneficio para todos. Target Hardware: Mobiles y PC Design Goals: El juego es un buen medio para aprender. El objetivo es permitir al jugador que aprenda y se sensibilice con los problemas reales en diferentes perspectivas Se incorpora mùsica </p><p><strong>Credits:</strong></p><p>Luis Castrejón, Producer &amp; Programming, Karina Almazán- Illustrator, Moisés Campos - Storyteller &amp; Researcher, Diana Rodriguez - Designer &amp; Co-producer<br/></p><p><strong>Additional credits:</strong></p><p>Audio- Freesound.org<br/></p><p><strong>Special thanks:</strong></p><p>Johannes Kristmann<br/></p>", "metacritic": null, "released": "2016-11-23", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/ac0/ac071956ef50f4be377c0e57e2f888ef.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 186, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Android"], "developers": ["goethejam013"], "genres": [], "publishers": [], "esrb_rating": null}