{"id": 12725, "slug": "rush", "name": "RUSH", "name_original": "RUSH", "description": "<p>RUSH is a 3D puzzle game developed by Two Tribes. It is a remake of WiiWare title Rubik&#39;s Puzzle Galaxy: Rush. </p>\n<h3>Art-style</h3>\n<p>The game’s art-style is very reminiscent of other Two Tribes title – Edge. It is extremely minimalistic. The levels themselves are mainly made of white cubes, and the other object is simplistic and colorful, and are mostly just geometrical shapes. </p>\n<h3>Gameplay</h3>\n<p>The game consists of more than 70 levels. Your goal is to guide multicolored cubes to a certain spot on the level throughout the multi-layered levels; the game world is fully 3D.<br />\nTo do so, you have to place individual tiles over the cubes’ course. They affect cubes’ direction and speed. There are also special tiles such as teleports. Each level has several entrance point and exits for the cubes of different colors. Some of them can have special objects like conveyor belts that affect cubes’ behavior. After the player places the tiles, they can press the button to start the movement of the cube. From this point, the player cannot affect them, and if any cubes collide or fall from the edge of the level, the stage restarts.<br />\nThe main concern for the developers was the maximum simplification of the controls so the player can focus on the puzzles alone, so all the movements in the game may be performed with the sole mouse.</p>", "metacritic": 73, "released": "2010-12-03", "tba": false, "updated": "2024-01-28T16:12:27", "background_image": "https://media.rawg.io/media/screenshots/0da/0dab7553a533264235d77719bd83a5b2.jpg", "website": "http://www.twotribes.com/rush", "rating": 2.58, "rating_top": 3, "added_by_status": {"yet": 53, "owned": 1242, "beaten": 19, "toplay": 4, "dropped": 27, "playing": 1}, "playtime": 1, "achievements_count": 37, "ratings_count": 86, "suggestions_count": 130, "game_series_count": 0, "reviews_count": 86, "platforms": ["PC", "Wii U", "Android", "macOS", "Linux", "iOS"], "developers": ["Two Tribes", "Ketchapp", "The Binary Mill", "rush"], "genres": ["Action", "Strategy", "Simulation", "Sports", "Racing", "Arcade", "Casual", "Indie"], "publishers": ["Two Tribes Publishing", "Ketchapp", "The Binary Mill", "rush"], "esrb_rating": "Everyone 10+"}