{"id": 127268, "slug": "beyaz-dag-7drl", "name": "Beyaz Dag 7drl", "name_original": "Beyaz Dag 7drl", "description": "<p>It is not far from Navekat and Suyab to the lake they call the Eye of the World. But the visions you sought there carried you much farther, across mountains, deserts, marshes, across the Mother River to the lonely Mount Beyaz. Here, perhaps, you can convince the merciful goddess who lives above the clouds to save your people from the plague.</p><p>Beyaz Dag towers solitary above the deserts. No rival peak dares rear itself nearby, though a desultory range of hills stretches southwards. The mountain's western slopes fall off steeply into a deep blue lake; north lie the marshes that fringe the Mother River.</p><p>You never mastered sword and lance, like your brothers, but can shoot, ride, and wrestle as well as any of them.</p><p>Beyaz Dag teems with life: hyenas and gazelles in the desert scrub, deer, wolves, bear in the forests. Travelers you met on the Northern Road tell of other, darker things here: ruins, abandoned quarries, sunken grottoes...</p><p>Now you're almost through the marshes; the mountain rises to the southwest.</p>Combat Model<p>If you are unfortunate enough to get into a fight, you'll see messages in your log like:</p><p>&gt; Player (40) attacks hyena (10) for 4 wounds.</p><p>&gt; Hyena (16) attacks player (20) but misses.</p><p>The numbers in parentheses are the participants' effective attack and defense skills. Equal skills provide a 50% chance of success; a 2:1 ratio in skills provides a 75% chance of success, a 3:1 ratio an 85% chance of success. All attack success chances depend on the weapon used; melee defense depends on shield skill if a shield is equipped, plus half of weapon skill. Missile defense depends on the distance between the combatants, plus half of shield skill if a shield is equipped.</p><p>All effective skills are reduced by: exhaustion, wounds, bleeding, intoxication.</p><p>Exhaustion accumulates as you walk, climb, or fight; it can be reduced by food and drink.</p><p>Wounds accumulate from combat; if wounds ever exceed your maximum hit points (36), you fall unconscious - and since you have no companions it's assumed you die.</p><p>Bleeding sometimes occurs during combat; once you're bleeding, you'll continuously lose hit points until they reach 0 and you die. First aid skill and the application of bandages are necessary to stop bleeding.</p><p>Intoxication is a side effect of some beverages or other events in the world.</p>Strategy Notes<ul><li>Fighting is dangerous and rarely beneficial.<br/>\n<ul><li>Archery is deadly, but arrows are in short supply.</li><li>If you get out of sight of your enemies, they're not likely to pursue very far.</li></ul></li><li>Melee weapon skills also influence defense.<br/>\n<ul><li>To be effective, have a skill of at least 40 in any weapon you use.</li></ul></li><li>Choices are hard.<ul><li>Fighting the wrong enemy without a shield (and shield skill) may be fatal.</li><li>Fighting the wrong enemy in melee instead of with a bow may be fatal.</li><li>Switching between bow and shield at a bad time may be fatal.</li></ul></li></ul>Spoilers<ul><li>Grinding can yield more than 400 skill points, but a successful playthrough may only need half that.</li><li>AI pathing is really, really poor; (in the current build) you are expected to exploit this.</li><li>A fully spoiled win is possible in less than 2000 turns and 20 minutes.</li></ul><p>Built in Python on top of libtcod, Jotaf's tutorial, and other open-source components. Source code at https://github.com/Naburimannu/beyaz-dag.</p>", "metacritic": null, "released": "2016-03-14", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/90d/90da1e904e75aa719e08ab14f4f6ca04.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 6, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["naburimannu"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}