{"id": 12720, "slug": "teeworlds", "name": "Teeworlds", "name_original": "Teeworlds", "description": "Play together with your friends and have a fun time! In Teeworlds you can play in three gamemodes (Deathmatch, Team-Deathmatch and Capture The Flag) and tons more of community-made modifications with up to 16 players!<br/><br/>Customize your own player character, your personal tee, to your liking. With hundreds of possible combinations, you will always look unique!<br/><br/>Teeworlds is a game that gives you a lot of freedom and plenty of gameplay mechanics to use or abuse. With a full focus on multiplayer games you will never be bored.<br/><br/>And the best thing: It's open-source! Anyone can help to develop this game, create new game types, skins or brand new maps via the built-in map editor!<br/><br/>Key Features:<br/><ul><li>Easy to learn, hard to master. You will never stop learning new tricks while playing Teeworlds, no matter how long you play. At the same time it's easy for new players to just pick it up and have a blast.<br/><br/></li><li>Engaging and motivated community. Teeworlds' one-of-a-kind community is the thing keeping the game alive. Be it the community servers or maps or all the other innovative content.<br/><br/></li><li>Play with your friends for free. Teeworlds has been free since the very start and will stay that way forever. With up to 16 players in a match, challenge your friends - the fun is only a mouseclick away!</li></ul>", "metacritic": null, "released": "2015-08-24", "tba": false, "updated": "2023-10-24T10:41:12", "background_image": "https://media.rawg.io/media/screenshots/ed3/ed334c8c5cdb92cf0c9dae4d5c1cebb5.jpg", "website": "https://www.teeworlds.com/", "rating": 3.34, "rating_top": 4, "added_by_status": {"yet": 19, "owned": 827, "beaten": 12, "toplay": 1, "dropped": 58, "playing": 3}, "playtime": 1, "achievements_count": 0, "ratings_count": 82, "suggestions_count": 74, "game_series_count": 0, "reviews_count": 82, "platforms": ["PC", "macOS", "Linux"], "developers": ["Teeworlds Team"], "genres": ["Action", "Indie"], "publishers": ["Teeworlds Team"], "esrb_rating": null}