{"id": 127324, "slug": "the-blind-swordsman", "name": "The Blind Swordsman", "name_original": "The Blind Swordsman", "description": "<p>You are a blind swordsman, haunted by the spirits of your past. Purge the Sacred Realm of these wayward souls and grant them eternal sleep.</p>\n<p>A survival-horror game for HTC Vive (Windows).</p>\n<br/>\n<p>In <em>The Blind Swordsman</em>, players wield dual katanas to defend themselves against waves of incoming spirits. Given limited visibility, players must remain alert and plan ahead in order to ensure their survival.</p>\n<p><em>The Blind Swordsman</em> was created as a project for Global Game Jam '17. I took on the role of designer and programmer on the project, being primarily responsible for enemy behavior and human-enemy interactions.</p>\n<p>The game was built in Unreal Engine 4 using the Blueprint scripting system.</p><p>Developed by: AB Biswas, Adam Barnett, Christian Guzman, Justin Camden, Lex Rhodes, Maura Perlow, Maureen Wang, Yoshita Sharma<br/></p>\n<p><strong>Controls</strong><br/></p>\n<p>In the Main Menu, walk up to and touch the \"Play Game\" button to start the game.</p>\n<p>Turn your head to view the game environment, limiting your movement to the defined play area.</p>\n<p>Use the Vive motion controllers to wield your swords.</p>\n<p>The triggers on the motion controllers may be used to swing your sword as an optional control alternative.<br/></p>\n<p>Note that teleport controls are disabled during gameplay.</p>", "metacritic": null, "released": "2017-05-28", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/04d/04d16ca2a119f3036f37b5ee9a7f5b42.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 50, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Arya Biswas"], "genres": ["Action"], "publishers": [], "esrb_rating": null}