{"id": 12737, "slug": "viscera-cleanup-detail", "name": "Viscera Cleanup Detail", "name_original": "Viscera Cleanup Detail", "description": "<p>Disaster! An alien invasion and subsequent infestation have decimated this facility. Many lives were lost, the facility was ruined and the aliens were unstoppable. All hope was lost until one survivor found the courage to fight back and put the aliens in their place!<br />\nIt was a long and horrific battle as the survivor dueled with all manner of terrifying life-forms and alien mutations, but our hero won out in the end and destroyed the alien menace! Humanity was saved!<br />\nUnfortunately, the alien infestation and the heroic efforts of the courageous survivors have left rather a mess throughout the facility. As the janitor, it is your duty to get this place cleaned up.<br />\nSo grab your mop and roll up your sleeves, this is gonna be one messy job.<br />\nToday, you&#39;re on Viscera Cleanup Detail!<br />\nKey Features:<br />\nJanitorial Simulation - Step into the boots of a space-station sanitation technician and deal with the horrific aftermath of a sci-fi horror event. Blood, viscera, spent cartridges, worker bodies and other messes litter the facilities.<br />\nClean - It&#39;s your job to clean up the mess, so clean it up you shall! Use your trusty mop, gloves, dispenser machines, plasma laser and sniffer tool to help you get all that blood out of the floor and off the ceiling! You can even try and punch-out if you think you&#39;ve done your job.<br />\nSandbox Gameplay - Don&#39;t want to clean? Just want to make more of a mess and play around with the physics? Go ahead! You can save your game as well; that&#39;s kind of us!<br />\nMultiplayer - You can even enlist some friends/coworkers to come and help you clean up (or make even more mess). Split-screen co-op is available too!Important: Buying Viscera Cleanup Detail also gets you our spin-off titles, &#39;VCD: Shadow Warrior&#39; and &#39;Santa&#39;s Rampage&#39; free!<br />\nSanta&#39;s Rampage comes included in the main game download AND as a standalone copy you can use to connect with others who only own Santa&#39;s Rampage.</p>", "metacritic": null, "released": "2015-10-23", "tba": false, "updated": "2024-04-09T16:35:06", "background_image": "https://media.rawg.io/media/screenshots/a64/a64f58684478a9057873e370a0b7e5af.jpg", "website": "http://www.runestorm.com/viscera", "rating": 3.83, "rating_top": 4, "added_by_status": {"yet": 62, "owned": 1048, "beaten": 64, "toplay": 15, "dropped": 88, "playing": 12}, "playtime": 5, "achievements_count": 85, "ratings_count": 147, "suggestions_count": 520, "game_series_count": 0, "reviews_count": 149, "platforms": ["PC", "macOS"], "developers": ["RuneStorm"], "genres": ["Simulation", "Indie"], "publishers": ["RuneStorm"], "esrb_rating": null}