{"id": 127434, "slug": "headlands", "name": "Headlands", "name_original": "Headlands", "description": "<p>Memorial scene/environment made for Remember The Dead Game Jam 2017. Unfinished (I, uh, missed the deadline by 24 hours...). Thanks for downloading!</p>\r\nBackstory\r\n<em>Growing up, my family and I used to visit my grandmother's house in mendocino, California. We would travel from New York City to San Francisco, and drive up the coast to spend a week or two, vacations permitting, with Grandma B in her house on the cliff by the sea. She had a beautiful garden that smelled like lavender where the snails lived, raspberry bushes, and a brambly deer path in her back yard that lead to an abandoned greenhouse in the middle of a wild thicket.<br/></em>\n<em>After my mother passed on, my brother Chris and I would travel to Mendo with our aunt Sally and uncle Dean, and cousins Barbara and Margaret. Once Grandma B passed, we would spend Thanksgiving all together there, tidepooling along the chilly northern beaches.</em>\n<em>We scattered Grandma B's ashes together in Headlands State Park, near downtown Mendocino and not far from her house.</em>\n<em>Dean, and then his wife Sally, have also passed in the years since. My happiest memories have always been of foggy mornings in Mendocino, and for me Grandma B, Sally, and Dean are inseparable from that place.</em>\n<em>\"Headlands\" is an attempt to recreate - crudely, at best - the place where I keep these memories.</em>\n<em>-- Alec</em>\r\nCredits\r\n<p>\"Ambience, Seaside Waves, Close, A.wav\" by InspectorJ of Freesound.org</p>\n<p>\"beachhouse wind outside.wav\" sound from http://www.freesound.org/people/klankbeeld/</p>", "metacritic": null, "released": "2017-11-04", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/a89/a89a1c24b02ca0a78bd89d732837363e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 69, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["snerg"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}