{"id": 12741, "slug": "empire-total-war", "name": "Empire: Total War", "name_original": "Empire: Total War", "description": "<p>The fifth part in the Total War series, Empire is set in the 18th century. The player controls over one of the powerful empires of the era, such as Great Britain, Spain or Russia. There are more than 50 factions in the game overall, although only the major civilizations are playable, while the rest are campaign-specific minor states and colonies. The factions are not static, as colonies can claim independence, and within empires, the government can change, even in the one controlled by the player. <br />\nUnlike its predecessors, Empire: Total War puts a stronger emphasis on the empire-building in the vein of Civilization series. The game combines turn-based global strategy with an RTS-style warfare. On the strategic map, you control your empire’s diplomacy, economy, religion, colonization, government, and other aspects. The battles, however, are fought as real-time wargames. The warfare is very realistic and includes a variety of units and battle movements based on military history. The units react like real people, shoot orders, and panic if they lose. Empire was also the first game in the series to introduce fully realized naval battles, which allow you to set enemy ships on fire or to board and capture them in real-time.</p>", "metacritic": 90, "released": "2009-03-03", "tba": false, "updated": "2024-04-18T15:03:44", "background_image": "https://media.rawg.io/media/games/b28/b2813f31d36b83d2e8d4e246a2cfcbe2.jpg", "website": "http://www.totalwar.com", "rating": 3.76, "rating_top": 4, "added_by_status": {"yet": 118, "owned": 1883, "beaten": 156, "toplay": 25, "dropped": 127, "playing": 11}, "playtime": 4, "achievements_count": 30, "ratings_count": 257, "suggestions_count": 525, "game_series_count": 17, "reviews_count": 257, "platforms": ["PC", "Linux", "macOS"], "developers": ["Feral Interactive", "Creative Assembly"], "genres": ["Strategy"], "publishers": ["SEGA", "Feral Interactive"], "esrb_rating": null}