{"id": 127561, "slug": "vidar-demo", "name": "Vidar (demo)", "name_original": "Vidar (demo)", "description": "<p><em>Vidar </em>is an RPG Puzzler focused on random story-telling and random puzzles. You play as the Stranger, a character who was lost in a snowstorm and made it into town at a time when no one can leave. Now trapped, the Stranger fights alongside the remaining townsfolk to stop the Beast before it kills every last person. Each night, another citizen is killed - you'll have only 24 days before Vidar is gone.</p><p><strong>RANDOM STORY-TELLING</strong></p><p>Each resident has their own stories to tell, their own quests to give the player, and their own relationships with each other. As their neighbors, lovers, friends, and family die, each is deeply affected by the loss - and their story arcs diverge accordingly. As the game progresses, the stories of the living change in response not just to what the player has done, but to who has died as well. Because the order of deaths in <em>Vidar</em>is random each playthrough,<strong>every game is a new story</strong>. In one playthrough, thepriest may die the first night; in the next,he'll invite the remaining townsfolk to barricade themselves in the Church as a last effort to survive; in the next, he'll grieve the loss of a close friend and give up the clothfor good.</p><p><strong>PUZZLE-DRIVEN EXPLORATION</strong></p><p>To stop the Beastyou will explore its den, filled with vast and varied environments. From frigid layers of ice to dusty boulders, each layer of this dungeon reveals more about <em>Vidar</em>'s past as a once-thriving capital. You'll hear stories of a Boy King who went mad and abdicated the throne, or see ghosts trapped in reenacting the same war over and over until the end of time. You'll meet a lady-of-the-lake who has spent a millennium trying (and failing) to cultivatea religion around her persona. And of course, your mind will be put to the test in a series of challenging environmental puzzles.</p><p>The cave blends nostalgic dungeon-exploration mechanics (like frictionless ice, mirrors which reflect light, adjustable water levels, and more) with new twists. Your path through the dungeon is chosen at random, the rooms you explore are chosen at random, and each puzzle in each room is chosen at random from a bank of several hundred. If you want to come back and see a brand new story unfold, you won't be stuck playing puzzles you've already solved.</p><p><strong>PRESS</strong></p><p><strong>Boston Festival of Indie Games Digital Showcase 2014</strong></p><p>A Pixelated View</p><p>Indie Hangover</p><p>Scarlet-Rhapsody</p><p><strong>LINKS</strong></p><p>Website</p><p>Twitter</p><p>Facebook</p><p>Youtube</p><p>Indie DB</p>", "metacritic": null, "released": "2014-11-18", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/866/866ea43ed18d0bd8c19cc0136c371f50.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 145, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["mhaus"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}