{"id": 127540, "slug": "orbital-racer-itch", "name": "Orbital Racer (itch)", "name_original": "Orbital Racer (itch)", "description": "Orbital Racer\r\n<p>A unique combination of space and racing sims. Choose between fast-paced, explosive action or more realistic simulation where drifting around every corner becomes more than just a gimmick - it's a necessity. Race around distinct locations such as the rings of Saturn or orbital city on Venus.\r\n  </p>\n<p>In space no one can hear you drift...\r\n  </p>\n<p>Orbital Racer is a single-player racing simulator set in space. It combines the freedom of movement of 6DOF space simulators with the thrills of racing. \r\n  </p>\n<p>The game offers two distinct game modes:\r\n  </p>\r\nACTION\r\n<p>This mode is all about fast, satisfying gameplay. Just jump into the cockpit and use your speed and available powerups, including explosive missiles and mines to beat your opponents.\r\n  </p>\r\nSIMULATION\r\n<p>This mode puts much more emphasis on realism. All ships behave according to Newtonian laws of physics with plausible thruster forces. This makes flying much more challenging but also uniquely satisfying as you'll be sliding sideways at the limits of controls most of the time.\r\n  </p>\n<p>Other main features of the game:\r\n  </p>\n<ul><li>fully customizable controls\r\n  </li><li>8 distinct locations, all based on real places in our Solar System\r\n  </li><li>a total of 24 tracks\r\n  </li><li>a full, playable flight school for Simulation mode.\r\n  </li><li>3 different ship models, each with additional 3 variants\r\n  </li><li>a challenging yet flexible AI\r\n  </li><li>custimizable races\r\n  </li><li>a compelling career mode\r\n</li></ul>", "metacritic": null, "released": "2018-07-11", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/bdc/bdc07825f04b7e8a6ff8f2fd277ab845.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 220, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Plug In Digital"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}