{"id": 12763, "slug": "dungeon-kingdom-sign-of-the-moon", "name": "Dungeon Kingdom: Sign of the Moon", "name_original": "Dungeon Kingdom: Sign of the Moon", "description": "&amp;quot;A very accessible dungeon RPG... for newbies and for pros.&amp;quot; - Denis Remute<br/><br/>Dungeon Kingdom: Sign of the Moon is a modern real-time dungeon crawling RPG. Immerse yourself in a fantastic adventure in the lands of Pohe Fakesys and investigate the cause of the returning chaos and darkness.<br/><br/>At the dawn of the Fourth Age... You, a poor young man struggling to make ends meet, have been summoned by a strange man claiming to be a member of the prestigious Mages’ Guild, to join him on a great quest. In the hope for a better future, you accept his request, for who could refuse to follow such a seemingly eminent member of the Mages’ Guild? A feeling in the back of your mind tells you that this is related to the strange symbol of a moon on you hand... <br/><br/>Your quest will require you to explore the Dungeon Kingdom world, to uncover hidden treasures, solve puzzles and battle dangerous creatures in many areas, from dark dungeons to snowy mountains.Features:<br/><ul><li><strong>Story Rich:</strong> You won't wander into dungeons without experiencing the epic story. You take part in it through interacting with the environment, books, scrolls and NPCs.<br/></li><li><strong>Continuous Gameplay:</strong> Dungeon Kingdom's world is made of continuous levels, there's no fading or loading between levels, except for major environment changes.<br/></li><li><strong>Character Customisation:</strong> Create and recruit new adventurers onto your team of four. Increase their experience according to your actions throughout the game.<br/></li><li><strong>Enemy Variety:</strong> Battle with many kinds of enemies and monsters that have differing behaviours and capabilities.<br/></li><li><strong>Advanced AI:</strong> Unlike many crawlers, Dungeon Kingdom utilizes an advanced Artificial Intelligence system. This makes the gameplay more challenging as your enemies are smart and will not merely stand still and attack you.<br/></li><li><strong>Multiple Difficulty Levels:</strong> Three difficulty modes are available to best fit any player’s experience of dungeon crawler style games.<br/></li><li><strong>Controlled Randomisation:</strong> Certain areas will change with each play-through, along with the locations of items and their stats. This will allow for a higher level of replayablity.<br/></li><li><strong>Physics Engine:</strong> Dungeon Kingdom uses a real-time physics engine powered by PhysX, enhancing gameplay with unique puzzles.<br/></li><li><strong>Dynamic Environments:</strong> Perform immersive interactions with dynamic environments, such as setting fire to objects and watching the fire spread realistically.</li></ul>The Team:Hydro Games is a group of experienced game developers based in France, aiming to develop great games that players will love.", "metacritic": null, "released": "2015-11-19", "tba": false, "updated": "2019-08-28T22:13:06", "background_image": "https://media.rawg.io/media/screenshots/283/283570a320073f023dca3221922dd44f.jpg", "website": "http://www.dungeon-kingdom.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 6, "toplay": 1}, "playtime": 7, "achievements_count": 102, "ratings_count": 0, "suggestions_count": 447, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC", "Linux"], "developers": ["Hydro Games"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["Hydro Games"], "esrb_rating": null}