{"id": 127645, "slug": "dungeons-are-boring", "name": "Dungeons are Boring", "name_original": "Dungeons are Boring", "description": "<p>When a well renown and powerful hero, who's tired of his daily dungeon-clearing, evil-smiting routine finds a forbidden tome full of monsters sealed by the gods themselves, it's only a matter of time before chaos ensues!</p><p>You'll play the role of The Hero, who've seen almost everything in his career, and your main goal as the player is to clear the dungeon without boring him.</p><p>You will be fighting huge monsters and deadly bosses - well, deadly for everyone else, not for our hero, of course - while you fight The Hero's boredom: if he's tired enough by those enemies, the hero will self-impose challenges to increase difficulty, and to find again the long lost fighting spirit.</p><p>Defeating his challenges will trigger his interest for sure, but not for too long: the real deal is to handle his tedium while you defeat the boss!</p><p>If you are unable to entertain The Hero by controlling him, when his Boredom Bar hits the completion, he will himself take control of the fight, and one-hit-kill the enemy: the dungeon would then be cleared, but you would have lost the game.</p><ul><li>The real enemy is The Hero! - Fight The Hero's boredom by completing his challenges. Don't let The Hero reach 100% boredom, or you will lose!</li><li>Over 30 unique challenges! Who knows what boredom could suggest The Hero?</li><li>No more boring dungeons! Immediately jump to the final boss fight.. because boss fights should be the fun part, right?</li><li>100% Sarcastic Hero! The Hero will have something to say about almost everything that happens in-game. </li></ul>", "metacritic": null, "released": "2017-02-15", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/587/587c16dd1f2462a5937ef6bfa9833423.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 70, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["POLIMI Game Collective"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}