{"id": 127679, "slug": "soviet-shoot-the-space-and-controllers", "name": "Soviet Shoot the Space and Controllers!", "name_original": "Soviet Shoot the Space and Controllers!", "description": "<p><strong>Soviet Shoot the Space and Controllers is a fast paced arcade shooter based on the early 90's Mega Drive era. </strong><strong>This is the early access version 1 build.</strong><br/></p><p>In 1983 a Soviet Galaxy Fighter IV Space ship launched from Kazakhstan to begin a 4000 year journey across the Milky Way Galaxy. Waking from their cryogenic sleep the brave crew of the Feoktistov Fighter find themselves surrounding by enemy space bots. </p><p>Destroy everything that moves and make the Soviet Union proud as you conquer the galaxy!</p><p><strong>YouTube gamers:</strong> All sound effects are <strong>free to use</strong> and sourced from free-sounds.org. The background music (all 3 tracks) have been purchased and licences obtained. We encourage you to make some videos of <strong>Soviet Shoot the Space and Controllers</strong>, you'd be really helping us out! There is no online leader board so the only way to prove your high-score is by sharing it with others!</p><p><strong>Controls:<br/></strong></p><p><strong>Keyboard: </strong>Arrows for movement. Space to shoot. Escape to pause/quit. <strong>NOTE: </strong>If your keyboard can not handle more than 2 key presses simultaneously you can use your left mouse button to fire, whilst using WSAD. </p><p><strong>Controller: </strong>D-Pad or Analogue stick to rotate. A to shoot. R1/R2 for throttle.  L1/L2 for Reverse. START to pause. B to share score to Twitter.</p><p>Tested on Xbox Controller on PC.</p><p>Credit must go to Wuhu of OpenGameArt for his free space ship sprites which we edited a bit to animation: http://opengameart.org/users/wuhu</p><p><strong>Desert Pixel Games is a two person development team, making indie games in their spare time. Thanks for your support. </strong></p>", "metacritic": null, "released": "2017-01-27", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/7e7/7e7186261e384fcb44ab3d7d122e167c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 96, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Desert Pixel Games"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}