{"id": 12760, "slug": "dawn-of-war-ii-chaos-rising", "name": "Warhammer 40,000: Dawn of War II Chaos Rising", "name_original": "Warhammer 40,000: Dawn of War II Chaos Rising", "description": "<p>Warhammer 40,000: Dawn of War II Chaos Rising is the second expansion of Warhammer 40,000: Dawn of War II. It offers new characters Chaos Space Marines and adds new units to all other races. The game takes place in the Blood Ravens work which is in Aurelia. It seems, that Aurelia was lost to the Warp a long time ago, but now it has reappeared. 10 years have passed since the events of Dawn of War II, in invasion of Tyranid is already defeated and Blood Raven heroes from the previous game have returned as well as Chaos Lord Eliphas, Derona and Vandis.<br />\nThe game for the first time presented the Corruption System. Through multiple objectives during missions, player decides how much corrupted he wants to be. Too much corruption will lead into becoming Chaos, which will lead into betraying the Imperium of man. This choice will affect one of the several games’ ending. <br />\nAlso, Chaos Rising offers two new environments for players to explore. Three environments from the previous game didn’t disappear so with Chaos Rising players have an opportunity to explore five different locations.</p>", "metacritic": 85, "released": "2010-03-11", "tba": false, "updated": "2024-03-13T15:06:43", "background_image": "https://media.rawg.io/media/screenshots/6f3/6f3855fc42784a7da7bdc4cf325b0d30.jpg", "website": "http://www.dawnofwar.com", "rating": 3.94, "rating_top": 4, "added_by_status": {"yet": 100, "owned": 2032, "beaten": 177, "toplay": 13, "dropped": 52, "playing": 4}, "playtime": 4, "achievements_count": 73, "ratings_count": 232, "suggestions_count": 632, "game_series_count": 0, "reviews_count": 233, "platforms": ["PC", "macOS", "Linux"], "developers": ["Feral Interactive", "Relic Entertainment"], "genres": ["RPG", "Strategy"], "publishers": ["SEGA", "Feral Interactive", "THQ"], "esrb_rating": "Mature"}