{"id": 127774, "slug": "clear-the-river", "name": "Clear the River!", "name_original": "Clear the River!", "description": "<p>Clear the River!</p>\n<p>You are a waterproof robot who gets its power from hydroelectricity. However, you are running out of power. Pesky humans have polluted your river, clogging the dam, and now it is your job to clear it out so the stream will be clear and you can get your electricity once more. However, the humans' consumption rate is increasing, and more and more rubbish is appearing on the stream.  However, you are not alone. You have three bots to help with your task, power them up if you need help. Collect shopping to send the humans shopping, taking up their time. The stakes are even higher than you thought, though. All of Robotkind share a single, huge battery. They get power from this, through coils on their heads.  This means that if you fail, all robots will power down. Can you unclog the dam, and stop yourself running out of power?<br/></p>\n<p>How to Play:</p>\n<p>WASD to move around. To pick up items, walk towards them. Then go to the bin below the river while holding an item to get rid of that item. Above the river, near the dam, is a charger. Step onto it to increase your energy, but if any items are clogging the dam, the charger won't work. Click the '+Speed' button to increase your speed. Beware, though. This will also increase your energy consumption rate, making you need to charge up more. Click the '+Bot' button to give hire a bot, but this also increases your energy consumption. You can only have up to three bots.</p>\n\n<p>Made for Ludum Dare 39!</p>", "metacritic": null, "released": "2017-07-31", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/d11/d116fd29f499a2e520829e493505ac60.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 47, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SpeedySloth"], "genres": [], "publishers": [], "esrb_rating": null}