{"id": 127860, "slug": "bellerophon-wielder-of-missiles", "name": "Bellerophon: Wielder of Missiles", "name_original": "Bellerophon: Wielder of Missiles", "description": "<p>The planet Olympus has been the proud innovator of many space heroes, adventurers that battled once deemed mythical creatures across the reaches of the universe. This reputation sadly has spurned an ego among many that hunger the recognition of being a hero in the eyes of Olympus, including one young ranger named Bellerophon.</p><p>Despite his many acts from the conquest of the Galactic Chimera to the liberation of Andromeda from a race of warrior space women, Bellerophon's ego felt unsatisfied. Frustrated by the growing irrelevance of his achievements and his unrewarded feats where his peers paraded many blessed armaments, Bellerophon decided to fly straight for Olympus itself and demand his just recognition. This would cause Olympus' military to strike, spearheaded by the warship, Gadfly.</p><p>As Bellerophon, you must fly your way through space, firing and slicing down any adversarial fleets from the basic Pterippi to the larger Orthrus ships with your Doru missiles and anti-projectile Xiphos defenses until you face the leading warship Gadfly with its multi-faceted defence force.</p><p>This game was developed within the confides of \"My First Game Jam: Summer Edition\" including their optional theme of \"<strong>a spin on a popular story/myth!</strong>\" The project was created alongside Evan Thaxter with his programming and \"Luneria\" with thier art.</p>", "metacritic": null, "released": "2016-07-22", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/0b9/0b95b81c31a436b8e03d7d57372ba301.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 30, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Greg Baxter"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}