{"id": 12785, "slug": "the-book-of-commands-lost-symbol", "name": "The book of commands: Lost Symbol", "name_original": "The book of commands: Lost Symbol", "description": "...I'm lost in a dark place...<br/>...I don't have any memories...<br/>...I don't know anything...<br/>...I want to get out of this place...<br/>...What should I do?....<br/><br/>It's story about one girl who lost in unknown places. She just a small girl, But with the power of something like a miracle. The weak girl turned into a brave warrior. Now she needs to find a way to survive from here.<br/><br/><strong>Overview</strong><br/>2D Action RPG Game from Limpage. \"The book of commands : Lost symbol\"<br/>The player can level up, change class, change equipment, upgrade, craft item, setting skills. Do anything to finding a way to survive from the large dungeon and strong enemies. <br/><br/>Features<br/>- One large dungeon - All maps in this game are connected. You will found a lot of things in the dungeon.<br/><br/>- Leveling - Defeat the enemies, gain EXP and get stronger!.<br/><br/>- Light beads - It's something you will see when to defeat an enemies. The little girl called it as \"Soul\". This thing will help you to survive this dungeon.<br/>    Red soul - use for craft item, upgrade EMBLEM, unlock skills or abilities.<br/>    Green soul - recovery life point (HP).<br/>    Blue soul - recovery mystic point (MP).<br/>    Yellow soul - recovery stamina point (EP).<br/>    Special soul - recovery HP,MP,EP<br/><br/>- The EMBLEM - a mysterious stone. Turn the weak girl into the warrior. Each EMBLEM has different power.<br/><br/>- Emblem upgrade - upgrade, unlock skill, ability of the EMBLEM for getting stronger.<br/><br/>- Item -  You can get an item by craft, find treasure or drop from the enemies.<br/>This game has 4 types of item Tool, Equipment, Material, Special (Key, EMBLEMs).<br/><br/>- Craft - you can craft items at the save point.<br/><br/>- Ending - this game doesn't have one ending... and after end will unlock something.", "metacritic": null, "released": "2016-06-16", "tba": false, "updated": "2019-08-28T22:13:05", "background_image": "https://media.rawg.io/media/screenshots/9da/9da27e8c4f8077c8fbb5b88ee65f9c46.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 209, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Limpage"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["Limpage"], "esrb_rating": null}