{"id": 12781, "slug": "half-life-a-place-in-the-west", "name": "Half-Life: A Place in the West", "name_original": "Half-Life: A Place in the West", "description": "<strong>What is A Place in the West?</strong>Half-Life: A Place in the West is a fan-made comic book set within Valve's acclaimed Half-Life universe, in which Earth has fallen under the grip of the totalitarian Combine empire following a scientific experiment gone very wrong.<br/> <br/>As a group of military commandos sweep across the American wasteland kidnapping children, a troubled father, an intrepid young scientist, and an ancient alien warrior are drawn to the strange city from which the attackers sprung: New Franklin. Once inside, they discover a powerful secret, but the city holds many dangers, and deceptive temptations. Faced with warring clans, diabolical experiments, a treacherous conspiracy, and the growing shadow of the Combine, they must unlock New Franklin’s mysteries before it’s too late - and the lives of everyone in the city hang in the balance.<br/> <br/>A Place in the West delivers a compelling story, and a complex and intriguing cast of all-new characters, drawing on the rich mythology of the Half-Life universe in an entirely new medium for the series.<br/> <br/>The comic will run for a total of thirteen chapters, the first of which, Following Portents, is available for free to download and comes to a total of 38 pages. The remaining chapters will be released sequentially as paid-DLC, and will vary between 25-30 pages in length.<br/><br/><strong>Do I need to be Familiar with Half-Life?</strong>Nope! The first chapter features a three-page prologue designed to bring new readers up to speed with the world of Half-Life. A Place in the West is also set in the interim between Half-Life and Half-Life 2, which means that you needn't be familiar with Valve's later games anyway. That isn't to say, however, that you won't find exciting things to enjoy if you are familiar with the series.<br/><br/><strong>What Other Features Are There?</strong>The comic is displayed and presented in an app designed by ourselves for the best possible reading experience. Through a fully-animated menu screen, derived in style from the menus of Half-Life 2, you can quickly and easily navigate between the comic pages and chapters, adjusting zoom &amp; language options, the credits, and the extras section. The extras section will be continuously updated over the course of the comic's production, and will include a series of three-to-five-page comic 'shorts' that further develop the world of New Franklin and its occupants, as well as \"Behind the Scenes\" commentary videos for each central chapter!", "metacritic": null, "released": "2016-09-29", "tba": false, "updated": "2023-01-02T18:36:33", "background_image": "https://media.rawg.io/media/screenshots/504/504dcb8d81d81248c2e7818de268bb85.jpg", "website": "http://www.aplaceinthewest.net", "rating": 3.33, "rating_top": 4, "added_by_status": {"yet": 18, "owned": 494, "beaten": 12, "toplay": 1, "dropped": 7, "playing": 2}, "playtime": 1, "achievements_count": 11, "ratings_count": 27, "suggestions_count": 231, "game_series_count": 0, "reviews_count": 27, "platforms": ["macOS", "PC", "Linux"], "developers": ["Ross Joseph Gardner", "Michael Pelletier"], "genres": ["Indie"], "publishers": ["Michael Pelletier", "Ross Joseph Gardner"], "esrb_rating": null}