{"id": 127917, "slug": "core-that-indie-studio", "name": "Core (That Indie Studio)", "name_original": "Core (That Indie Studio)", "description": "<p>Submission for the Github itch.io 2017 Game Jam. A base defender with a text adventure. As a player you will help build defenses to protect your mining asteroid, but things seems to constantly gets worse as time progresses. How will you survive? How will you escape?</p>\r\nSpace.  There was a time, when humanity considered it to be the final frontier.  The days when mankind dreamed about the mysteries of the stars have long since passed.  Rather than the grand and mysterious adventure oft dreamed of, space has become the key to humanity's salvation.  Through science man had finally tamed one of life's final mysteries.\r\n\tOf course, life has a way of always providing one last mystery.  So it came to pass that by conquering the stars mankind found that they were not the first to do so.  Unfortunately, the aliens they encountered regarded them not as brothers in exploration, but as invaders. Thus began the Solar war.  After twenty years of fighting there is no end in sight, however we are running low on essential resources.  That is where you come in Commander.  We have discovered an asteroid field that our scanners show to be rich in Titanium, an essential component in the manufacture of our fleet.  You will be assigned a small contingent of operatives, and we wish you to gather as much as you can and return to us.  \r\n<p>Can you survive the core? Gather resource, protect your goods and make your way through the core. Will you survive?</p>\n<p>----</p>\n<p>We would love to hear what you think. Please leave any comments or questions below or contact us via our site ThatIndieStudio.com or on twitter. If there is enough interest we could make a larger more polished version of the game as we really did like the concept of what we made.</p>\n<p>Thank you for trying out our submission we really appreciate it!</p>", "metacritic": null, "released": "2017-11-16", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/12f/12ffeadd3ccab1798915711b5296592a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 25, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["That Indie Studio"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}