{"id": 127988, "slug": "b-r-1", "name": "b r 1", "name_original": "b r 1", "description": "<p><em>A room! A trunk! A tube! A bed! A radiator! A light! A landscape! A darkness! A separation! A floating in air! A doubling! An intersection! And more! And more!</em></p>\n<p><em>b r 1</em> (Bitsy Realty 1) is a remake of my earlier game <em>v r 1</em> which was itself an attempt to \"remake\" Gregor Schneider's <em>u r 1</em> from his The Haus u r project. Where <em>v r 1</em> was created in Unity, <em>b r 1</em> is created in Bitsy, leading to important differences between the two games, including moving from 3D to 2D, physic-simulation to none, high resolution to 8x8 tile-based graphics, sounds versus silence, a first-person experience to a third-person experience, real-time versus turn-based, and on and on. It's in these differences that I'm trying to explore how Unity and Bitsy and both different and, in important ways, the same. What does it mean to try to create the 'same' experience in two radically different engines? What are the two engines good at? Bad at? Ignorant of? Emphatic about? This 'translation' throws these ideas into relief.</p>\n<p><em>Want to know more?</em></p>\n<p>Read the Closing Statement, a short essay about the project.<br/></p>\n<p>Read the Process Documentation for process journal entries, to dos, and manifestos.</p>\n<p>Read the Commit History for detailed, moment-to-moment insights into the development process.</p><p>Read the Press Kit for press-oriented information.</p>", "metacritic": null, "released": "2018-05-23", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/c22/c2298337a8ea4a281e2abe5caf6e6477.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 43, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["pippinbarr"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}