{"id": 127969, "slug": "sting-quest", "name": "Sting Quest", "name_original": "Sting Quest", "description": "<p>\r\n\tDropbox mirror for when Itch.io uploading occasionally fails: https://dl.dropboxusercontent.com/u/29071079/StingQuest.zip<br/>\n</p>\n<p>\r\n\tSting Quest is a simple Roguelike game that  I made for the 2015 7DRL challenge. I had fun making it, and while it's pretty bare bones and the graphics are still rather bad, I figured I'd at least release it into the wild for people to mess with. I plan on updating it semi-frequently (I'm trying to go for at least one minor update a day for at least one month, but don't quote me on that...). Please leave constructive criticism in the comments, as they help me out immensely (I can't even count how many times comments on my Ludum Dare games have helped me improve future projects)!\r\n</p>\n<p>\r\n\tAnyways, as a basic guide to the classes, snails are tanks with low speed and attack, stings are well balanced in all stats but defense, drakonians are sweepers, with good attack and speed, and grom are glass tanks with the highest attack in the game, but low everything else. There is currently no ending, with the enemies simply getting stronger and stronger as you delve deeper, for later versions I'd like to have some sort of end game, but I didn't have much time, especially with me starting 7DRL late.\r\n</p>\n<p>\r\n\tUpdate #1 (Hotfix):\r\n</p>\n<p>\r\n\tThis quick bugfix fixes several issues:\r\n</p>\n<p>\r\n\tMultiple OS Support: No longer needs the .bat file to run, and should now run on Linux and possibly Mac. However, this is untested, but I'm currently installing the JRE on my new Ubuntu instalation (reinstalled a couple of days ago on my old PC). If it doesn't work now, it should for the next update!\r\n</p>\n<p>\r\n\tBetter movement: Now you can hold the arrow buttons to move rather than tap for each tile. This major annoyance came up during playtesting and was quickly changed.\r\n</p>\n<p>\r\n\tNo more \"empty\" rooms: Another thing that came up during playtesting that was considered a tad annoying. All rooms now contain either items or monsters. Also fixed a rare bug where the player could spawn in a room with items or monsters in it.\r\n</p>\r\nEnemy movement now accounts for items being on spaces.\r\n<p>\n<br/>\n</p>\n<p>\r\n\tUpdate #2:\r\n</p>\r\nSorry for update #2 being a day late. I had originally wanted to add a lot more, but I worked on the Textureless game jam instead. However, I did manage to get accessory items in as well as fixing the speed stat.\r\n<p>\r\n\tNew items: Adds \"accessory\" items, as well as a new slot in the inventory for them.<br/>\n</p>\r\nSpeed now has an effect on enemy movement.\r\n<p>\n<br/>\n</p>\n<p>\r\n\tUpdate #3:\r\n</p>\n<p>\r\n\tUpdate #3 includes minor stability fixes and extra features.\r\n</p>\n<p>\r\n\tFixed bug with wait function introduced with speed fix.\r\n</p>\n<p>\r\n\tAdded bare bones Main Menu.\r\n</p>\n<p>\r\n\tAdded basic story.\r\n</p>\n<p>\r\n\tRemoved character select background (will be replaced with something else later, it caused a bug).\r\n</p>\n<p>\r\n\tDying in-game now gives a prompt to restart, rather than an intentional crash.<br/>\n</p>", "metacritic": null, "released": "2015-03-16", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/b58/b58fc8dfa0287d169a39bae244c7736a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 16, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "macOS", "Linux"], "developers": ["Impossible Realms"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}