{"id": 128077, "slug": "quick-die", "name": "Quick, Die", "name_original": "Quick, Die", "description": "<p>Control a killer tank named... uhm.. i don't know... \"Carl\". and survive for as long as your fingers can keep up in this fast-paced arcade shmup.<br/></p>\n<p>WASD - move</p>\n<p>Arrows - shoot<br/></p>\n<p>R - restart</p>\n<p>Esc - exit<br/></p>\n<p>M - toggle music<br/></p>\n<p>Any feedback would be amazing, If you have any opinions or ideas to share, contact me at: <br/>elismerenianu@gmail.com <br/></p>\n<p>Twitter:\r\n          @N_Aplicabl\r\n        </p>\n<p>V1 Well... this was fun. \"Quick, die\" is not something anyone should be proud of but I learned quite a lot making it. For example, what a pain in the rearal area resolutions and aspect ratios are, how collision boxes work, how simple it is to write shitty code and that details don't matter as much as people think, Tom Francis (@<strong>Pentadact</strong>) said it best \"It's easy to stop polishing the silverware when you realize how much of the house is on fire.\". In a way I feel like a half-proud dad of an autistic kid that just started going to school, like \"Yea it's cool that he finnaly attended first grade... but he's still fucked up\"... That sounds awful, and it is but... I don't have anything against mentally challenged people.. Anyways, before I completely become a jeopardy to the construct of society, I'll say this:</p>\n<p>\"Quick, die\" is shit, but the first step is twice as important as the next one and when I'll start making good games (*if) \"Quick, die\" will always be that fucked up autistic kid that I love.</p>\n<p>P.S. also a HHUUGGEE thanks to the few friends that played \"QD\" and helped during the \"\"development\"\" with moral and technical support &lt;3<br/></p>", "metacritic": null, "released": "2017-07-29", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/a70/a70e8fe5787a4b90d2dda0fa714c9e14.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 47, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Not Λpplicable"], "genres": ["Action"], "publishers": [], "esrb_rating": null}