{"id": 12806, "slug": "political-animals", "name": "Political Animals", "name_original": "Political Animals", "description": "Political Animals is an election simulation game set within a world populated by corrupt crocodiles and meritocratic mice. In a political contest where corruption is always around the corner, find out just how incorruptible you really are. Do you have the integrity of Mousey or the ruthlessness of Croccy? Will you fight your campaign on issues and in the best interests of the people, or will you succumb to the easier path of bribery and intimidation? Will you win votes...or will you buy them? <br/><br/><br/>Each turn you spend logistics to move your candidate and their staff around the political landscape to whip up popular support. Your choice of staff affects your strategy!  A lawyer can settle your scandals, but a preacher can energize the population. Raise funds from the wealthy, give gifts to political patrons, or hold rallies to build grass-roots support from the electorate. Along the way, expect to encounter scandals both real and fabricated as well as random events that test your moral mettle.<br/><br/><br/>This new turn-based strategy game is developed by Philippines-based studio Squeaky Wheel and published by Democracy-3 developers Positech Games. Political Animals features a large and continuously increasing set of playable characters, eight different maps and and infinite strategies you can employ to win over the population, district by district.<br/><br/><ul><li>A bite-sized yet deep turn-based strategy game that you can play in 1-2 hour campaigns</li></ul><ul><li>Eight beautifully designed maps based on countries around the world</li></ul><ul><li>Numerous animal candidates to choose from and customize</li></ul><ul><li>Eight different staff types with special abilities to suit your campaign style</li></ul><ul><li>Political Events that draw inspiration from world politics</li></ul>", "metacritic": null, "released": "2016-11-01", "tba": false, "updated": "2022-08-10T14:38:35", "background_image": "https://media.rawg.io/media/screenshots/be3/be31257f9edffb8d226a328441fc503e.jpg", "website": "http://www.politicalanimalsgame.com", "rating": 0.0, "rating_top": 4, "added_by_status": {"yet": 5, "owned": 75, "toplay": 2, "dropped": 5}, "playtime": 1, "achievements_count": 28, "ratings_count": 5, "suggestions_count": 271, "game_series_count": 0, "reviews_count": 5, "platforms": ["macOS", "PC", "Linux"], "developers": ["Squeaky Wheel"], "genres": ["Strategy", "Simulation", "Indie"], "publishers": ["Positech Games"], "esrb_rating": null}