{"id": 12809, "slug": "mindball-play", "name": "Mindball Play", "name_original": "Mindball Play", "description": "Welcome to Mindball Play - when gaming hits a new level!  <br/><br/>This game isn’t an ordinary race game, it’s a completely new generation type of game. <br/><br/>Mindball Play is a fast challenging race game. Rule the Race and race your rivals’ online and multiplayer mode. Who will be first through the finishing line? <br/>Compete against the AI along different tracks while sorting obstacles such as bars, blocks, hurdles and hitches. <br/>Use power ups to craft your racing strategy. Hazard ahead! Watch out for oil slicks, spiked pendulums and winding tracks as they hinder your rivals… and you! <br/>Take the podium top spot! As you perfect your race tactics win medals and set high scores.<br/><br/>Play Mindball Play with your key board or control as any other game. OR steer the ball just by being focused using the wireless headband- *purchased at our web site. <br/><br/>Millions of people have, for years, wished for their own Mindball - a game where you move a ball with your brain waves - alone, no hands! Now it's finally the time to make their wish come true! <br/><br/>Have fun while you train your brain - prove your focus skills and practice your ability to achieve a calm mind with fun, engaging and challenging races.Playing with your brain - no hands! How does it work? Your brain sends out electrical signals, all the time, without interruption. The technique used for reading (and presenting) the electrical signals from the brain is called EEG, (electroencephalography). Scientists have identified that you are focused when you produce a great amount of electrical signals with a high amplitude, within a specified frequency band. We use this technique and that knowledge in our Mindball Products.<br/><br/>The headband we use for moving the ball in Mindball Play picks up the electrical signals from your brain and forwards them via Bluetooth to this app on your smart device. Your device then forwards it to Mindball Play on your PC. The output from our algorithm gives to what extent you are focused and relaxed. We use that value to steer the ball; on track, off track, slow or fast. <br/>You will also get feedback from the combined focus/speedometer placed down to the right. The waves coming from behind the meter tells you to what extent you are relaxed - green waves are good, red ones not. The size of the ball (that is given your player color) tells you to what extent you are focused - big ball is good small, ball is not.  <br/><br/>You can actually extend the interaction with the ball by tilting your head to the sides and thus affect the path of the ball. This is controlled by the gyro built in the headband. <br/>You can also bite your jaws to put a brake on the ball. Or blink (steadily) in order to make the ball jump. Biting and blinking generates electrical signals that are possible to distinguish from the ones generated by the brain. <br/>When identifying a certain state of mind, such as focus, you exclude these “muscle” signals. But instead of just “throwing them away” we use them to do additional cool stuff in the game. <br/><br/>NB! The first time you use Mindball Play with a headband you will be asked to insert a key. You will get hat key if you purchase the headband at our web site (only). <br/>If you already own a compatible headband you need to buy a headband key from our web site. The 2014 version of the Muse headband is not compatible with Mindball Play. <br/><br/>Download the (free) companion app \"Mindball Play Bridge\" from Google Play or App Store which manages the Bluetooth communication between the headband and your PC. <br/><br/>Go Focus!", "metacritic": null, "released": "2016-12-01", "tba": false, "updated": "2019-08-28T22:13:04", "background_image": "https://media.rawg.io/media/screenshots/67a/67aa0e64adced688774706a527f08c70.jpg", "website": "http://www.mindballplay.com/play/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 8, "owned": 105, "beaten": 1, "toplay": 2, "dropped": 1}, "playtime": 4, "achievements_count": 30, "ratings_count": 2, "suggestions_count": 498, "game_series_count": 0, "reviews_count": 2, "platforms": ["Nintendo Switch", "PC"], "developers": ["Interactive Productline Team"], "genres": ["Action", "Simulation", "Racing", "Indie"], "publishers": ["Interactive Productline IP", "Interactive IP"], "esrb_rating": null}