{"id": 128170, "slug": "hangthere", "name": "#HangThere", "name_original": "#HangThere", "description": "<p>You are a little square breaking his chains and trying to escape the devilish dungeon.<br/><br/>Your only hope of survival is to hang in there as long as you can, using those same chains.<br/><br/>Grapple your way through the obstacles and defy gravity  constantly pulling you down.<br/><br/>Swing\r\n to gain momentum when you are attached to a block, and deploy the \r\nanchor to the next block before you fall down : there is no ground.<br/><br/>You don't gain enough momentum : game over !<br/>You are not precise enough and miss the next block : game over !<br/>your fingers tire and release the touch before the right moment : game over !<br/><br/>you hang in there too long and the death spikes catch you : game over !<br/><br/>But nothing is impossible for the little hero !<br/><br/>With enough practice, your skills become your best weapon against the adversity and ever increasing challenges.<br/><br/>A challenging free to play game for all ages, ideal for short gameplay sessions, and frequent updates to come.<br/><br/>With a unique take on popular genres : <br/><br/>A PROCEDURAL DUNGEON RUNNER PLATFORMER WITHOUT GROUND !<br/><br/>first version features : <br/><br/>* Scores, high scores.<br/>* Google Play games leaderboards.<br/>* Facebook score sharing.<br/>* Random obstacles : every play session is different each time you play !<br/><br/>And more challenges and features to come in the next updates !<br/><br/>This app is respectful of your privacy : <br/><br/>* Internet connection is only requested for ads display and social networks/game center score sharing in the game over screen.<br/><br/>Have Fun and thank you for playing :)<br/><br/>This game is made by one man, based in a one man shop in Casablanca, Morocco.<br/>With the help of the awesome Indie community providing free assets for your enjoyment.<br/><br/>If you like this tiny game, please take a moment to rate and review it.<br/><br/>It is 1000% pure Indie :)<br/><br/>Thank you !<br/><br/>Feel free to follow/contact me on Twitter : <br/><br/>@KhalilArafan<br/>@PalmGroveSoft<br/>@HangThereGame</p>", "metacritic": null, "released": "2014-08-01", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/693/69341e2e22f054bf87b0e0ef4f9a7dc2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 57, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Palm Grove Software"], "genres": ["Adventure", "Platformer"], "publishers": [], "esrb_rating": null}