{"id": 128218, "slug": "goat-murderer", "name": "Goat Murderer", "name_original": "Goat Murderer", "description": "<p><strong>Synopsis</strong><br/></p>\n<p>You are a robot</p>\n<p>You have been dispatched by anti ghost HQ to eliminate the evil goat infestation inside the shitty dance party for some reason.</p>\n<p>Fight back endless waves of... Goat... Ghosts? GhostyGoats kill you by touching you, so keep them at distance by sprinting around the map and shooting them with your... Anti-Ghost, matter-rayizozor</p>\n<p><strong>Features</strong><br/></p>\n<ul><li>Endless waves! Or well. Really until your computer can't handle the glowing goats</li><li>Glowing goats!</li><li>Imagination! Stimulate your imagination by pretending like the goats don't look like beavers</li><li>Flashing lights.. Actually, maybe if you're epileptic, you shouldn't play this...</li><li>Options menu! (It's just a bunch of static buttons shh)</li><li>Controller support! (Except for menus... Menus are tricky.)</li><li>One <strong>whole</strong> level!</li></ul>\n<p><strong>Reviews</strong></p>\n<p>\"It hurts my eyes\" - Just about everyone over the age of 40</p>\n<p><strong>Disclaimer</strong></p>\n<p>I didn't really get into working on this until Saturday. We're going to pretend like the glowing white globs of poop look like goats, because I just couldn't make it happen on time. I'm no artist. And I don't pretend to be! But especially with zero time to actually make anything, this is what we get. :D</p>", "metacritic": null, "released": "2017-05-28", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/865/865ddd4b7d71040a31af5bd446000441.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 69, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Aaron Karras"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}