{"id": 128289, "slug": "quasar-itch", "name": "Quasar (itch)", "name_original": "Quasar (itch)", "description": "<p>Quasar is a new vision from two games, one is Dreadnought Factor and Truxton.</p>\n\n<p>In the year 2056, earth was facing several problems with superpopulation and hunger.<br/><br/></p>\n<p>Technology have evolved in a way that our civilization had already reached the stars, but we still lack the main force that could not only solve all our planets problems but also could lead us to a new form of travel and to be able to colonize the deep space and go far beyond.<br/><br/></p>\n<p>The main force was energy, and the solution was Quasar.</p>\n<p>Quasar is a energy source that exist in our universe that ha potential to have a galaxy inside its core, it was always controversial to try to create this type of energy also to be able to harvest.<br/><br/>But when mankind was able to create a Quasar in a controlled environment, it was natural that others civilizations that was always watching us but never interfere, to make a stand and try to remove that type of power from our hands.<br/><br/>So they obliterated mankind listening post at alpha centaury, on they way to reach our solar system.</p>\n<p>Not everything was lost, a small cruiser with a prototype ship that has a new type of hull that can change became our only hope, this ship was not designed for combat, but is the ony that has a early prototype power source, that is Quasar based.<br/><br/>Even not being a military post this ship was target, and now not only we have to adapt the new reality but also survive to make a stand, and prevent our civilization of total destruction.<br/><br/>And now, you are here.</p>\n<p>You are the pilot.</p>\n<p>You hold the Quasar power.</p>", "metacritic": null, "released": "2017-05-22", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/e21/e21b0af055d8287ce6965c3de0eac2e3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 50, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Gameorb"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}