{"id": 128217, "slug": "supertone", "name": "Supertone", "name_original": "Supertone", "description": "<p>My submission for #MusicGameJam!</p>\n<p>This is  a musical puzzle, where you'll try to guess and play the melody on a giant synth pad! I didn't have much time so currently there are only a few levels and the image hints could be improved, but I hope you'll manage :)</p>\n<p>There is also a free mode, that let's you dance like on a dancefloor and compose your own music in a given tonality. See instructions in game.</p>\n<p>Hope you'll have fun!</p><p><strong>Puzzle Mode Instructions</strong></p><p>1. on each level you'll need to play a given melody by stepping on the pads </p><p>2. the hint about the melody is the image in the back (and maybe other stuff if I upgrade the game)</p><p>3. The pink crystal indicates you where you should/could begin </p><p>4. The blue crystal will play the rythm of the melody, which might help you in guessing the melody. </p><p>5. The blue crystal will play the melody. You'll then need to play it by yourself to clear the puzzle.</p><p>6. It's the order of the notes you play that is important. Not the order of the pads. </p><p>7. The melody does not need to be played in rythm.</p><p>8. sometimes it might  be necessary to step on a pad twice.</p><p>9. One you've cleared the puzzle the portal on the other side will open (there will be some fog appearing from it and a \"whoa\" sound will play ) </p><p>I admit the hints for the melodies are a bit rough, I'll need to add a sort of 2-3 steps hints in a later version!</p>", "metacritic": null, "released": "2017-09-25", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/cb5/cb54efabf2f8ac901f6bcaded9590ed1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 26, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["axoona"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}