{"id": 128328, "slug": "roy-g-beats", "name": "Roy G Beats", "name_original": "Roy G Beats", "description": "<p><strong>Musical Action Tower Defense with special sauce!</strong></p><p>The year is 1994 and you're upgrading your 486 system with the new music-based visual operating system - <em>Roy G Beats</em>. It is time to move on from the boring text based operating systems like TenaciOS. Problem is, TenaciOS is jealous of Roy and plants a subroutine that lurks deep within your system and is creating bugs. Defend Roy and retake control of your system using the Sonic File Deletion system to destroy TenaciOS's bugs.</p><p><strong>Features:</strong></p><ul>\n<li>Action-Based Tower Defense: you'll find no \"set it and forget it\" play here. You're going to have to act quickly and engage the system to emerge victorious. Use the Sonic Destructo Pads to fight back against the TenaciOS bugs. Upgrade your pads, launch guided missiles, and use actions such as Health Recover and Force Shield.</li><li>Dynamic Environments: Things may start out simple and preidictable, but as with most systems, the deeper you get the more complex things are. Compound the use of your actions, pads, missiles, and pad upgrades to deal with the constantly changing challenges. No two games are the same.</li><li>Procedurally Created Music: The music for each levels is created by your game play.</li><li>Resource Points, Upgrades, &amp; Actions: Earn Resource points when you kill bugs. Use these to upgrade your pads, launch missiles, use Actions and apply permanent System Upgrades.</li><li>Actions: These become unlocked throughout the game. They include the ability to activate additional pads, regain some health, use a force shield, and fire an AOE blast. When a new Action becomes available you choose which one to make active at that time. Chose wisely and try a different combination on the next save game to challenge your strategy.</li><li>System Upgrades: These are permanent upgrades that augment existing Actions. You can upgrade the speed, damage, and reload time of your misiles, the strength of your force sield, and the damage, range, and reload time for your blast.</li><li>Pad Upgrades: Applied to individual Destructo Pads, these are different for each pad color. Red pads discombobulate enemies, Orange pads increase their range, Green pads deal more damage, and an upgraded Yellow pad fires twice as often. Be careful when upgrading pads, though, as they lose their upgrade when deactivated.</li><li>Secondary and tertiary play modes: Traverse through tube portals to go deeper into the virtual system to get to the lowest layer. There you can eradicate the last of the bugs and remove the annoying (and boring) TenaciOS for good. Perform well on the memory game between levels to gain bonus Resource Points.</li><li>Emblems: Unlock and collect Emblems when you achieve a miles stone in the game. Emblems are available for bugs kills, completing all levels in a layer, pads upgraded, missiles launched, memory game streaks, and more.</li><li>Recursive Resource Points: Need more Resource points to complete a tough level? Go back through your History and play earlier levels to save up more Resource Points. They'll be available for all levels after the one replayed.</li></ul>", "metacritic": null, "released": "2014-04-24", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/4e1/4e17f3e9edbf1c04c4a8daf985ae24df.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 39, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["@devjana"], "genres": [], "publishers": [], "esrb_rating": null}