{"id": 12837, "slug": "polygod", "name": "Polygod", "name_original": "Polygod", "description": "<strong>Description</strong><br/>Polygod is a rogue-like, randomly generated FPS where you are an assassin known only as \"Faceless the Blessed\". You must battle the minions of malignant Gods and their Holy Champions in an epic event known as the Trial of the Gods. Each level is randomly generated and features successive Altars of Worship where you exchange your Souls for Blessings (which are like power ups). Blessings combine and stack to create unique effects which will help you survive the brutal challenges in your quest to attain Godhood. In the PolyGod universe, death is necessarily permanent but with each new game comes a unique first-time experience. The art style is inspired by the meta-physical surrealist artist Giorgio de Chirico who is famously revered for his eerie mood and strange artificiality of cityscapes.<br/><br/>Polygod also features Arena Shooter multi-player with randomly generated maps and a variety of planned game modes. Currently in Early Access, players can play free for all matches on randomly generated maps where the first person to a set number of kills is the victor. Future planned game modes include team death-match and a variation of capture the flag, involving altars and blessings.<br/><br/><strong>Features</strong><br/><ul><li>Randomly generated levels<br/></li><li>5 Unique enemies per level with unique designs and behaviours<br/></li><li>Rogue-like permanent death<br/></li><li>75 Unique blessings that combine and stack to create thousands of unique effects<br/></li><li>Randomly generated multiplayer maps for versus combat<br/></li><li>5 Epic boss fights!</li></ul>", "metacritic": null, "released": "2016-10-13", "tba": false, "updated": "2019-08-28T22:13:03", "background_image": "https://media.rawg.io/media/screenshots/f35/f35939a5b29be9cc9b877427dbd9d0ae.jpg", "website": "http://amplifygames.co/polygod/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 28, "toplay": 1, "dropped": 1}, "playtime": 5, "achievements_count": 42, "ratings_count": 1, "suggestions_count": 247, "game_series_count": 0, "reviews_count": 2, "platforms": ["Nintendo Switch", "Xbox One", "PC", "Linux", "macOS"], "developers": ["Krafted Games"], "genres": ["Action", "Strategy", "Indie"], "publishers": ["Krafted Games"], "esrb_rating": null}