{"id": 12833, "slug": "shoot-mania-vr-fun-zombies", "name": "Shoot Mania VR: Fun Zombies", "name_original": "Shoot Mania VR: Fun Zombies", "description": "In this exciting and dynamic game you have to protect your harvest from pumpkin-eating zombies who got into the habit to visit your garden!<br/><br/>The game has 3 difficulty levels: Easy, Medium and Difficult, as well as 3 modes of play: \"Defence\", \"Wave\" and \"Survive\"<br/><br/>In the mode \"Defence\" you have to protect your pumpkins for 3 minutes from the hungry, but funny zombies.<br/>In the mode \"Wave\", as well as in the \"Defence\" mode, you protect your pumpkins from the zombies, but now you have to survive 3 waves of zombies  for 5 minutes, the number of zombies increases in each successive wave.<br/>In the mode \"Survive\" zombies are attacking you - hang on for 3 minutes and fend off the zombies with the help of bullets and a strong butt.<br/><br/>The game is available in two levels of \"Farm\" and \"City\", to start the level - shoot the screen where it is displayed.<br/><br/>On the easy level of difficulty in the mode of \"Defence\" and \"Wave\", you need to protect 6 pumpkins from pumpkin-eating  zombies, on the average - 4 and on the difficult - 2 pumpkins respectively.<br/>In the \"Survival\" mode the number of attacking you zombies will increase upon increasing the levels of difficulty.<br/><br/>The game has different weapons, which can be unlocked for credits. To select a weapon,  if it is available to you, shoot the target that appears  under the weapon.<br/>Not all the weapons are equally effective in different modes! Choose the weapons individually for a specific mode.<br/>For example, a gun will be less effective in \"Survival\" than a shotgun.  And the shotgun, in turn, is less effective in \"Defence\" mode.<br/>With Akimbo you will feel comfortable in almost any mode!<br/>Each weapon has its specific type of damage when hits in the head or body. Each weapon has its own bullets spread, accuracy, reloading speed and shooting, as well as ammunition.<br/><br/>You'll get more points and credits in more complicated modes (such as \"Survival\"), and at the higher levels of difficulty.<br/>In the \"Survival\" mode, at the highest level of difficulty, you can get the maximum number of points and credits.<br/>But there is one nuance, you do not get points and credits for killing zombies with the bare hands - use your weapon!<br/><br/>Also do not forget the birds - they bring more points than the zombies!<br/><br/>You will receive your points and credits only if you win the round - at a loss the points and credits are not charged!<br/><br/>For your credits you can unlock new weapons in the Main Menu, for using it afterwards in the game.<br/><br/><ul><li> Tactics is everything for us! In the \"Defence\" mode, sometimes it is more profitable to give a pumpkin to one zombie for shooting then all the zombies that will pass by you!<br/></li><li> Do not forget to recharge on time, on every moment:  sometimes the correct recharge can decide the outcome of the round.<br/></li><li> Use the weapons at its destination - it makes no sense to fire a shotgun at a target which is far away from you, only if it is not a \"Crusher\" in your hands, of course!<br/></li><li> Or it makes no sense to try to play the \"Survival\" at a high level of difficulty with a gun, if, of course, you're planning to win.<br/></li><li> Use a few seconds at the beginning of each round, when the time had already started, but the zombies have not appeared yet, to shoot as many birds as possible, because during the attack of zombies it is much more difficult to do it!<br/></li><li> Try to shoot zombies in the head - so you can kill them faster!</li></ul>", "metacritic": null, "released": "2017-02-17", "tba": false, "updated": "2019-08-28T22:13:03", "background_image": "https://media.rawg.io/media/screenshots/d00/d00116783f97fe27e0b674803f875e1f.jpg", "website": "http://funnytwins.ru/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3}, "playtime": 8, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 431, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Funny Twins"], "genres": ["Action", "Casual", "Indie"], "publishers": ["Funny Twins"], "esrb_rating": null}