{"id": 128337, "slug": "cryospace-online", "name": "Cryospace Online", "name_original": "Cryospace Online", "description": "<p><strong>Notice</strong>: Cryospace Online is currently a <strong>prototype</strong>.   Most things are either place holders or not yet finished. Expect content and features to change as development progresses. See the <em>roadmap</em> for details. <br/></p>\n<p>Explore the galaxy looking for resources and parts to repair and <br/>upgrade your starbase or ship. The more systems you repair the more <br/>people you can awake from cryo-sleep. Each one can unlock new abilities<br/> and crafting recipes. Then assign them to crew limited seats on your <br/>ship providing unique combinations of abilities. Each crew member is a <br/>unique character with their own skills and level. Instead of a <br/>traditional single player character, you level all your crew. Want to <br/>change your play style? Just assign a different combination of crew <br/>before starting a mission.<br/></p>\n<p>Starting out your starbase and ship systems are old and run down.  \r\nYou can repair or upgrade them from scavenge equipment  parts.  \r\nAdditionally, taking damage during a mission may damage or destroy \r\ncomponents.  This requires you to carefully evaluate the risks vs \r\nrewards of each engagement.</p>\n\n<p><strong>TLDR;</strong> a Sci-Fi themed PvE <strong>MMORPG</strong> with space combat, resource gathering, crafting,  and persistent damage system that is currently in the <strong>prototype</strong> stage.</p>\n<p>What I need at this point is more play testers that will <strong>report bugs</strong> and <strong>give feedback</strong>.\r\n  There is an in-game system that makes it easy.  Just press F8 or use \r\nthe escape (ESC) menu.  What you'll get in return is exclusive access to\r\n a unique new game before anyone else.  And you'll be providing critical\r\n feedback that contributes to making the game better.  I'll be looking \r\nto name new enemies and system after some of the people who provide the \r\nbest feedback.  If all this sounds like fun to you, then don't wait and sign up today!</p>\n\r\nSystem requirements\r\n<ul><li>Windows 7+ 64bit / Linux 32 or 64bit\r\n</li><li>Direct X11+ / OpenGL 4+\r\n</li><li>Shader Model 3 Card (usually anything newer than 10 years)\r\n</li><li>250 MBytes disk space\r\n</li><li>Internet connection\r\n</li><li>Free account (register here)</li></ul>", "metacritic": null, "released": "2017-11-01", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/645/6454960f589b073b851dd1b8b41ed3ee.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 109, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["Astral Byte"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}