{"id": 128332, "slug": "super-space-shmurp", "name": "Super Space Shmurp", "name_original": "Super Space Shmurp", "description": "<p>*UPDATE* The great Ulydev has created a website that allows for love games to be played in browser. This is still experimental so it may lead to issues but I tried it out and it seems pretty functional. If you would like to play Super Space Shmurp in your browser the link has been added below.</p><p>Play In Browser: <br/>http://love.ulydev.com/game/ShmurpV0111-4ToMs</p><p>Super Space Shmurp is a very minimalist and retro styled shoot em up. Unlike most games of this genre, you only have 6 bullets against 20 levels of increasingly fast enemies. SSS is a balance between attacking and twitch based dodging as you try to survive and pick up more ammo. A great game to practice your reflexes.<br/></p><p>This game is my first foray into creating a game entirely myself. I have done art work for some Ludum Dare games that a friend of mine programmed, but this game is all my own work. It is a fairly simple game but I hope people get a little bit of enjoyment from it.<br/></p><p>I consider this to be more or less finished, however I may update it with new functionality and features should the inspiration come. If you have any ideas of things you would like to see me add feel free to leave a comment. Also if you find any bugs be sure to let me know.</p><p>Controls // Arrow Keys or WASD to move // Spacebar to shoot</p><p>* Gamepads not supported. If people really want this feature I may add it in a future update.</p><p>* Fullscreen is not supported due to the game being designed for a portrait resolution and because the way in which Love 2D handles fullscreen.</p><p>Game was created with the Love2D engine which is a free engine and great to learn with. There are also many great tutorials that very much assisted me when making this game.</p><p>https://love2d.org/ // http://www.osmstudios.com/page/tutorials<br/></p>", "metacritic": null, "released": "2016-08-19", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/c1c/c1c796f27dc53cd21dfaf39e87ffd4c3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 18, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["thelasttankmage"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}