{"id": 128563, "slug": "home-md", "name": "Home MD", "name_original": "Home MD", "description": "<p>This game was made in three days by a sole developer for the Unreal Engine 4 game jam for September 2016, themed 'YOU DON'T KNOW WHAT YOU GOT UNTIL IT'S GONE'.</p><p>Summation:<br/><br/>In diagnostic medicine, you typically know exactly what you've got before you can treat it through a battery of tests and treatments...at least, if you follow the rules.<br/><br/>In Home M.D.'s practice, treatment is the only test, and the wrong treatment will kill your patient.<br/><br/>Take the role of Home MD's new protege, diagnose and treat your patients before they flatline and die. You'll know they've been cured when you haven't killed them!<br/><br/><br/>How to play:<br/>EACH PATIENT HAS EXPRESSLY UNIQUE SYMPTOMS AND PRE-EXISTING CONDITIONS (save for the first level, where all patients have the same pre-existing condition). You will need to solve which patient has which disease through logic and intuition.<br/><br/>Left click and hold to pick up medicines and shock paddles.<br/><br/>Left click to read the charts, which give valuable information required to diagnose your patients. Left click again to put the charts down.<br/><br/>Hit 'E' in front of the white board to use it to take notes (this is very useful!)<br/><br/>Hit 'E' next to a patient to use whatever is in your hands on them.<br/></p><p>version 1.2 update: performance issues corrected, white board should function correctly now.</p>", "metacritic": null, "released": "2016-09-12", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/a4b/a4bfec78c53133fd9ba8cbce42f60d84.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 29, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["crackpotgumption"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}