{"id": 12855, "slug": "chester-one", "name": "Chester One", "name_original": "Chester One", "description": "Key Features<ul><li><strong>8 Gameplay Changing Styles</strong> to switch up the look of the entire world around you<br/></li><li><strong>Over 200 Achievements</strong> to, umm, achieve!<br/></li><li><strong>10+ Playable Characters</strong> with special attacks to level up<br/></li><li><strong>40 Levels</strong> across <strong>7 Planets</strong> to explore<br/></li><li>An <strong>amazing original soundtrack with 20+ tracks</strong> by Reina Lamour<br/></li><li>Simple element system adds depth to platforming combat<br/></li><li>Unlock <strong>nearly 100 Bestiary pages to learn about the weird world of Chester</strong><br/></li><li>Steam Trading Cards and Cloud Saves</li></ul>Do you have what it takes to save the world you ruined? <br/>You'll have to think fast and move even faster if you hope to save this world!<br/>After an ill-advised prank by Chester, The Bad Guy has been pushed over the edge and driven on an absolute rampage. Buildings have been burned, realities shattered, and most importantly of all: <strong>CUPCAKES STOLEN</strong>.<br/>It's not going to be easy putting this world back together, but for some unknown reason only Chester can do it!  Get ready to fight through over 40 levels finding cupcakes, killing baddies, and collecting stamps to spend on the many unlockables of CHESTER!Now with over 200 Achievements!Over 200 Achievements broken up into multiple categories ranging from standard progression and collect-o-thon achievements to adding extreme challenge, completely unnecessary stat tracking of everything, and more! <br/><br/>Achievements are still in an early stage and while all achievements are functional many still need their unique icons.  These are being updated with every patch.Control the style of the world!<strong>8 game changing styles to unlock!</strong><br/>As you progress through Chester you'll unlock new <strong>Styles</strong> that you can use to change the look of the entire world around you.  Each style changes gameplay up in unique ways.That's a lotta characters! <strong>Over 10 unique characters to unlock!</strong><br/>You won't just be unlocking new Styles as you play, but completely new Chesters to play as as well!  With The Bad Guy destroying realities like he did, Chesters from other universes can help Chester out on his quest.  Unlockable Chesters range from classy gentlement, to tanks, and spaceships, and weird slug things.Featuring an amazing <strong>20+ Song</strong> soundtrack by ReinaLamour    <br/>Over 20 original songs that capture the fun quirkiness of classic video game music with a modern vibe that will keep you grooving through all 40 levels.Rock Paper Scissors style elemental system!Every Chester and enemy you encounter is either a FIRE, WATER, or GRASS elemental, forcing you to react quickly to make sure you’re using the right Chester for the job.Learn about the weird world of Chester! Every Chester, enemy, style, and item in the game has an unlockable Bestiary page that gives you a small glimpse into the world of Chester.What's new in Chester One?Chester One is an enhanced version of the original game, featuring Steam integration (Trading Cards, Achievements, Cloud Saves), enhanced graphical features, improved keyboard controls, rebalanced gameplay and more.<br/>The game is also seeing regular free updates that are transforming it into a complete remaster of the original.", "metacritic": null, "released": "2017-02-20", "tba": false, "updated": "2022-10-09T23:48:38", "background_image": "https://media.rawg.io/media/screenshots/4f6/4f69089df5a2c4e46fe60a993c862733.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 157}, "playtime": 4, "achievements_count": 241, "ratings_count": 4, "suggestions_count": 417, "game_series_count": 0, "reviews_count": 4, "platforms": ["PC"], "developers": ["Brilliant Blue-G"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Brilliant Blue-G"], "esrb_rating": null}