{"id": 128513, "slug": "ascension-adventure-2", "name": "Ascension Adventure 2", "name_original": "Ascension Adventure 2", "description": "<p><em>On xcvgsystems.com</em><br/></p><p><strong>Game not working? Try refreshing the page or switch to another browser. Or download the desktop or mobile version and play offline!</strong></p>\n<p><em>You were a great adventurer, and now you stand an anachronism. The world has changed around you more rapidly than you could have ever imagined. Still, there are parts of the world unexplored. Off the Phalaen coast, on a mysterious island, lies the enigmatic Forge. It promises riches and danger to those who cannot resist its allure. You grab your cloak and trusty stick. One last adventure. One last score.</em><br/></p>\n\n<p>Ascension Adventure 2 puts you back in the boots of The Adventurer on a brand new and massively improved adventure.</p>\n<p>It's a retro-styled, first-person dungeon crawl with elements of fantasy and sci-fi, now with a bigger and more detailed world to explore. The all-new battle system forces you to make choices, and you'll now face a greater variety of enemies with elemental strengths and weaknesses. New gameplay elements like elevators and changing floors switch things up, and a deeper storyline ties it all together.</p>\n<p><em>Can you survive where others have broken and unlock the secrets of the Forge?</em><br/></p>\n<p>Ascension Adventure 2 is a retro fantasy/sci-fi dungeon crawler based on the Heroine Dusk codebase. It is the direct sequel to Ascension: Adventure but does not require you to play both. It is open-source with the code licensed GPLv3 and most art license CC-BY-SA. You can grab the source code on GitHub.<br/></p>", "metacritic": null, "released": "2017-03-05", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/c08/c085d9b3cabe9b22ad8d5e8145989ecf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 48, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Android", "Web"], "developers": ["XCVG"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}