{"id": 128555, "slug": "the-r314y-project", "name": "The R314Y Project", "name_original": "The R314Y Project", "description": "<p><strong><em>The R314Y Project</em></strong> is a Real Time Strategy,<em> focused on capturing enemy relays</em> by <em>making an efficient build</em>. </p>\n<p><em><strong>With each structure you build, your Stats will rise, better stats improve the efficiency of units. </strong></em> Place buildings on the ground to <strong><em>alter it's base parameters</em></strong>. <em>Hold the enemy back</em> by using a <em>variety of defensive and offensive structures</em>. Or just <strong>upgrade your economy</strong>, because<em> if they don't have resources - they can't build</em>. And don't forget to <em>build energy generators</em>: they can really  increase your construction speed.</p>\n\r\nHOW TO PLAY\r\n<p>The goal of this game is to <em><strong>capture all enemy Constructs</strong></em>. To do that, you <em>must capture all the relays, that connect you to your enemies</em>. </p>\n<p> Select a building by moving your cursor over it and press <strong>Left Mouse Button</strong>. </p>\n<p>First and furemost, <strong><em>you can only build on the Relays, that are neutral, as well as connected to your energy network</em></strong>. When you can build, a <em>three buttons with + signs</em> will appear. Those buttons represent all the buildings you already have. </p>\n<p>Click on one of them to initiate the<em> construction mode</em>. Then choose the type of the building you wish to construct. After that, if you have enough resources, you can place the building<em> on the ground</em>, or on <em>one of free platforms on Relay</em>. Move your mouse to Relay if you want to install it there. Otherwise, just place your building on the ground in the range of selected relay. You can also cancel the construction, by pressing Right Mouse Button.</p>\n<p>Your building will start constructing. Clicking on that button again will <em>cancel the construction</em>.  If you want to sell this building later, when it's finished, <em>click on Sell button, below the unit's icon</em>.</p>\n<p>And here's the <em><strong>important part</strong></em>. <strong><em>Each Relay has a defensive mechanism, that will put it into lockdown, once all the buildings are destroyed and all production processes are cancelled. </em></strong>Selling or cancelling the production of all your buildings will bring <em>Relay </em>into a lockdown. But be careful, if the enemy is controlling another <em>Relay</em>, connected to it - he may capture it faster, than you. <strong><em>The one, who successfully order and place the building, will capture the Relay.</em></strong> If it wasn't you - then you must<em> D</em><em>estroy all the buildings on the relay</em>, so it can go into lockdown again. </p>\n<p>To win the game, you must capture all enemy <em>Constructs</em>. For that, you must <em>capture all the rela</em>ys,<em> that's connected to it</em>, and <strong><em>destroy all buildings on the Construct.</em></strong> Then - you will drain all the resource Units <strong>(U)</strong>. And when your enemy doesn't have any - he is defeated. </p>\n<p>Pay close attention to your<strong><em> Resource Units (U)</em></strong>  and<strong><em> Voltage (V)</em></strong> counters, located above the minimap. Resources are generating automatically each n seconds, <em>different for each fraction</em>. You construct your buildings with those.<strong><em>  Higher Conduction allows you yo build faster</em></strong>. If it gets low - you-ll spend much more time waiting for your buildings to be finished. Construct energy generators to increase the Conduction.</p>\n<p><strong><em>Your stats affect all of your structures efficiency. </em></strong>To see your stats, <em>click on the small button in the middle left of your screen or press  <strong>Backspace key</strong>. </em>There are some stats, that affect only certain type of structures, and some that affect them all. It's generally a good idea to commit to few of them and improve the best stats</p>\n<p>Also,<em><strong> mind the position of the offensive units</strong></em>. For example, <em>Beam weapons are powerful</em>, but <em>they can only shoot at the target directly in their vicinity</em>, and if there is something on their way - they will become useless.</p>\n<p><strong><em>That's about it. Good luck!</em></strong></p>\n\r\nCONTROLS\r\n<strong><em>GENERAL</em></strong><strong>WASD/Cursor keys</strong>Camera movement<strong>Tab<br/>Shift+Tab</strong>Select your Construct<br/>Select the Omega<strong>1/2/3</strong><br/><br/><br/><strong>(Shift)+1/2/3</strong>Build for that slot(if no building is installed) <br/>Select construction (if the building is installed)<br/>Cancel construction (if the building In production<br/>Sell building on that slot<strong>F1-F10</strong>Quickly select one of your Relays<strong>Backspace</strong>Open / Close your Parameters window<strong>Spacebar</strong>Focus on the recently attacked Relay<strong><em>WHEN CONSTRUCTION OR RELAY ARE SELECTED</em></strong><strong>F</strong>Focus on selected object<strong>T</strong>Force attack target<strong>H</strong>Hold Fire. <strong>L</strong>Put selected Relay into a long lockdown<strong>E</strong>Power down selected building / Relay", "metacritic": null, "released": "2018-02-03", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/61f/61f782c27115826b39c6882f1b611115.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 109, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Phirenor"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}