{"id": 128738, "slug": "beet-farmer", "name": "Beet Farmer", "name_original": "Beet Farmer", "description": "<p><strong>Avoid starvation. Avoid bankruptcy. Plan well.<br/></strong></p>\n<p><strong>Select an action. Then start doing. Bounce ball on paddle. Harvest beet to sell. Grab beet to harvest. Tip: Water field before planting.</strong></p>\n<p><strong>Multitasking required.</strong> Think of a task as a ball you're  juggling on the paddle. You can juggle up to 3 balls in this game, so you can carry out up to 3 tasks at a time.</p>\n<p><strong>Controls</strong></p>\n<ul><li><strong>[W] [S]</strong> to select</li><li><strong> [A] [D] </strong>to move </li><li><strong>[SPACE]</strong> to launch </li><li><strong>[ESC]</strong> for menu</li></ul>\n<p><strong>Gameplay Video</strong></p>\n<p>It’s a farm sim + Pong/Breakout mashup.</p>\n<p><strong>3 actions</strong> to select from: </p>\n<ol><li>WATER</li><li>HAND with SEED (to plant a seed)</li><li>HAND (to harvest a beet)</li></ol>\n<p>After an action is selected, launch the “ball” and start farming.</p>\n<p>You can only do up to <strong>3 actions at a time (3 “balls” to juggle at a time)</strong>.</p>\n<p>Decide which 3 actions are you going to do at any time.</p>\n<p>Drop off an action (literally, drop off the ball) that you don’t need to make space for an action that you do need.</p>\n<ol><li>Water costs money. </li><li>Planting a seed costs money and makes you hungry. </li><li>Harvesting a beet makes you hungry.</li></ol>\n<p>Using a hand with seed to plant a seed, once the seed is planted, it will turn into just a hand for harvesting a beet.</p>\n<p>So if you want to harvest a fully grown beet, instead of using just a hand, you can launch a hand with seed to plant a seed, then it'll turn into just a hand that can pick up the grown beet too. Doing this saves you a little from hunger.</p>\n<p>You need to water your seeds so that they’ll grow. They’ll also wilt if they lose all their moisture.</p>\n<p>Tiles too, dry up gradually, and moisture can be maintained in the tiles by constantly watering them.</p>\n<p>Tiles with plants on them dry up faster then tiles without.</p>\n<p>When your beet are fully grown, you can harvest them.</p>\n<ol><li><strong>Juggling a harvested beet to the bowl at the bottom left corner would fill your hunger.</strong></li><li><strong>Juggling it to the shipment box at the bottom right corner would sell it for money.</strong></li></ol>\n<p>You also have to pay your ever increasing tax dues every 30 in-game months (seconds in real life).</p>", "metacritic": null, "released": "2018-04-22", "tba": false, "updated": "2019-08-28T23:23:16", "background_image": "https://media.rawg.io/media/screenshots/3dd/3dd0d5aa912532f84db4a6d2c204c4a4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 26, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "Linux", "Web"], "developers": ["One Seed Fruit"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}