{"id": 1288, "slug": "doctor-who-legacy", "name": "Doctor Who: Legacy", "name_original": "Doctor Who: Legacy", "description": "Named Best Puzzle Game for the last two years by BestAppEver, don’t miss out on the new 3.0 release of the game that Kotaku called “one of the very best examples of free to play”. Incredibly fun and engaging, you will gem match your way through over 100 HOURS of Doctor Who brand-approved story featuring every single Doctor from the history of the show, over 160 allies and companions. Battle Cybermen, Daleks, Judoon, Sontarans, The Master, and so many more! This is the Doctor Who adventure of a lifetime and beloved by 2 million fans around the world. What are you waiting for? Join our amazing Whovian community <br/>( http://goo.gl/rGo0oY )!<br/><br/>LIVE SUPPORT with WEEKLY updates of new content including weekly releases alongside episodes of the show!<br/><br/>UNLOCK THE FAN AREA for dozens of exclusive levels with amazing rewards!<br/><br/>UNLOCK THE SONIC ADVENTURES for 30 brand-new levels, a set of Rank 5 allies, and gather up all of the Sonic devices from the Doctor Who series to add to your team!<br/><br/>UNLOCK DOCTOR WHO KIDS for the littlest Whovians and let them collect for you a dozen lovely new costumes while they play this simple, streamlined area of the game with 20 levels!<br/><br/>MIX AND MATCH your team from the modern series as well as favorites from Classic Who, Big Finish, Engines of War, and Titan Comics!<br/><br/>Twitter: @DoctorWhoLegacy<br/>Facebook: doctorwholegacy <br/>Weekly Twitch: www.twitch.tv/theadiposetv (Thursdays, 12 noon pacific)<br/><br/>For more info on Doctor Who, visit www.doctorwho.tv and facebook.com/doctorwho!", "metacritic": null, "released": "2013-11-27", "tba": false, "updated": "2019-10-22T14:27:41", "background_image": "https://media.rawg.io/media/screenshots/90e/90e87ea888eccf91a691ea4ab236f822.jpg", "website": "http://www.doctorwholegacygame.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3, "dropped": 1, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 327, "game_series_count": 14, "reviews_count": 1, "platforms": ["iOS", "Android"], "developers": ["Tiny Rebel Games"], "genres": ["RPG", "Puzzle"], "publishers": ["Tiny Rebel Games"], "esrb_rating": "Everyone 10+"}