{"id": 128985, "slug": "spookie-boogie", "name": "Spookie Boogie", "name_original": "Spookie Boogie", "description": "<p>\n</p><p>\n<strong>Spookie Boogie</strong> is a game in which you help the ghost of Sir Clockengurch, who was a saxofon player, to kick some teens out of his Manor when they summon him from hell using a Ouija board.\r\n</p><p>\r\n\tIf you manage to scare the teens out of Sir Clockengurch home, you win.</p><p><strong>How to Play</strong><br/></p><p>Tap the furniture to interact with it and scare the teens, but take care, they arent all scared equally by every object in game.<br/></p><p>The mobile version has some hidden tricks: activate the furniture shaking the phone or blowing air at them!</p><p>\r\n\tFill the Spook-O-Meter to win in classic mode, or play endless mode in Time Attack, where successful spooks give you more time and more points!\r\n</p><p>\r\n\tShare your score by typing your name in and playing Time attack to enter the Leaderboard.</p><p>Available for Android, Windows and web browsers (WebGL).</p><p>Translated to English, Spanish, Catalan and Japanese.</p><p><strong>Credits</strong><br/></p><p>Spookie Boogie was developed during the 2016 Global Game Jam at Gandia (Spain) and during the following weeks, by the Jumble! Devs team. Check the in-game credits for more info!</p><p><strong>Support</strong></p><p>The game's web version has been tested on Firefox, Chrome, Edge and Chromium, under Windows, Mac OS X and Linux. The Android version has been tested under several devices with Android 5 and 6. If it doesn't work for you, please tell us!</p>", "metacritic": null, "released": "2016-06-08", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/6cf/6cfe73112a3aa78e82ca319f77f6557d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 105, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Android", "Web"], "developers": ["Jumble! Devs"], "genres": ["Action"], "publishers": [], "esrb_rating": null}