{"id": 128989, "slug": "crypto-traders", "name": "Crypto Traders", "name_original": "Crypto Traders", "description": "<p>Want to experience the thrill of trading crypto-currencies without any of the financial risk?<br/></p>\n<p><em>Crypto Traders</em> is a crypto-currency exchange simulation game, focused entirely on the trading aspect. No mining or repetitive clicking -- just use your brain to trade coins and make a profit. Buy low and sell high!</p>\n<p>With a small initial investment of 0.005 BTC, you intend to repay your massive student loan debt by getting into new coins and getting out of exit scams at just the right times. Can you do one better and pay off your mortgage, too?</p>\n<p>This game was made as an entry for the Crypto Game Jam. Due to the short time limit, it's still a big work in progress, but there's enough to play around with for now. I just thought this kind of game would be fun and decided to attempt making it, that's all. So enjoy!</p><p><strong>Updates</strong>:</p><p>04/06/2018 - Saving/loading, ends after 30 days, other minor fixes<br/></p>\n<p><strong>To-Do List:</strong></p>\n<p>- Prices change based on more realistic factors (right now it is random and very small changes, needs to be relative to the current price)</p>\n<p>- Buy/sell orders should not be immediately fulfilled, but based on supply and demand<br/></p><p>- Transaction fees for placing orders<br/></p>\n<p>- Order history and other market data</p>\n<p>- Candlestick charts<br/></p><p>- Probably a lot more<br/></p>", "metacritic": null, "released": "2018-04-04", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/e4a/e4a51d350eea054bfb74b7b99fca8e24.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 26, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Kinjo Goldbar"], "genres": ["Strategy", "Simulation"], "publishers": [], "esrb_rating": null}