{"id": 12909, "slug": "trackmania2-valley", "name": "TrackMania² Valley", "name_original": "TrackMania² Valley", "description": "TrackMania² Valley is the third environment of TrackMania², the sequel to Nadeo Studio’s online racing phenomenon TrackMania, already enjoyed by millions of players.<br/> <br/>Valley is a new take on the classic arcade rally racing genre. Flirting between arcade and simulation, Valley marks a new checkpoint in the history of racing games.<br/><br/>As with all TrackMania² games, Valley comes with a solo campaign, deep multiplayer experience and a world of possibilities in user-generated content thanks to the upgraded ManiaPlanet system.Key Features<ul><li><strong>INCREDIBLE NEW GRAPHICS:</strong> Race in a stunning Valley environment with infinite possibilities and optimized to run on most PC’s<br/></li><li><strong>UNIQUE THRILLING RACING EXPERIENCE:</strong> The car feels more realistic and the handling is more precise than ever.<br/></li><li><strong>INTUITIVE AND ACCESSIBLE GAMEPLAY</strong> in both solo and multiplayer modes. TrackMania² Valley brings back the ease in gameplay that was seen in the TrackMania series and intuitive creative instruments.<br/></li><li><strong>ENHANCED CREATIVE FREEDOM</strong> on tracks, cars and scripts. More design elements and programmable parameters than ever before.<br/></li><li><strong>EMBEDDED COMMUNITY INSTRUMENTS:</strong> Share amazing creations and video highlights with people from all over the world.<br/></li><li><strong>IN-GAME VIDEO STUDIO:</strong> Edit TV-quality highlights of your best races.<br/></li><li><strong>A VERY ACTIVE COMMUNITY</strong> which provides incredibly numerous and diverse user generated activities.  TrackMania 2 Valley offers in-depth customization and distribution system.<br/></li><li><strong>FUN AND CRAZY MULTIPLAYER:</strong> 100+ players can challenge each other at once on the same track!<br/></li><li><strong>OFFICIAL RANKINGS</strong> in both solo and multiplayer modes.</li></ul>", "metacritic": 79, "released": "2013-07-04", "tba": false, "updated": "2022-09-18T23:47:10", "background_image": "https://media.rawg.io/media/screenshots/d21/d212cd995fc288cdec81fee0c6005780.jpg", "website": "http://www.maniaplanet.com/trackmania/valley", "rating": 3.62, "rating_top": 4, "added_by_status": {"yet": 16, "owned": 274, "beaten": 14, "toplay": 3, "dropped": 12, "playing": 2}, "playtime": 1, "achievements_count": 0, "ratings_count": 26, "suggestions_count": 256, "game_series_count": 14, "reviews_count": 26, "platforms": ["PC"], "developers": ["Nadeo"], "genres": ["Sports", "Racing"], "publishers": ["Ubisoft Entertainment"], "esrb_rating": null}