{"id": 12905, "slug": "super-blackjack-battle-2-turbo-edition-the-card-wa", "name": "Super Blackjack Battle 2 Turbo Edition - The Card Warriors", "name_original": "Super Blackjack Battle 2 Turbo Edition - The Card Warriors", "description": "<p>Super Blackjack Battle II Turbo Edition introduces a roster of 12 very different characters all competing to become the greatest Blackjack player of all time.</p>\n<p>Following an invitation by the owner of the largest Casino in Las Vegas and Godfather of the local most influential crime family, each character will face the other participants in a face-off game of cards.<br />\nOnly the best of them will fly to Vegas to challenge the Godfather himself in a final match, not knowing that the tournament itself is nothing more than a charade to hide a ruthless master plan to defeat the competing clan family...<br />\nSo what&#39;s the deal with this game?<br />\nIt&#39;s Blackjack!<br />\nIt tributes to a well-known arcade fighting game from the &#39;90s<br />\nA roster with 12 characters from all around the World such as Mark, an undercover FBI Agent, Kamiko from Japan, seeking revenge for her Uncles death or Gregor, a South African warlord.<br />\nTen different story lines with individual endings and dialogues in an epic Single player campaign<br />\nUp to four-player online matches where people can freely drop in and out<br />\nRanked online PvP mode with online leaderboards<br />\nCross-platform online multiplayer for up to four players (once we have released the game to the other systems)</p>", "metacritic": null, "released": "2017-03-03", "tba": false, "updated": "2023-02-07T02:24:17", "background_image": "https://media.rawg.io/media/screenshots/365/3659cbf4f9450feabccc14e68dfa5913.jpg", "website": "http://www.headupgames.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 27}, "playtime": 6, "achievements_count": 26, "ratings_count": 1, "suggestions_count": 277, "game_series_count": 0, "reviews_count": 1, "platforms": ["Nintendo Switch", "PC"], "developers": ["Stage Clear Studios"], "genres": ["Sports", "Casual"], "publishers": ["Headup Games"], "esrb_rating": null}