{"id": 129054, "slug": "time-dungeon-steven-miller", "name": "Time Dungeon (Steven Miller)", "name_original": "Time Dungeon (Steven Miller)", "description": "<p> Update #1!</p><p>PLEASE NOTE: This game is very incomplete, but this is a miniLD, so I figured I would upload and continue work on it.</p><p>In this build, you can use the left and right arrow keys to switch between levels.</p><p>At the end, there are some boss fights and previews of all ten classes that are currently in the game. Eventually, you will be able to choose which units you bring, and the dungeons will have multiple battles (health will be persistent between battles in the same dungeon).</p><p>The game has no audio or story (or quality) yet, but there will be more content soon.</p><p>Time Dungeon is a real-time version of a turn-based strategy game.</p><p>Tutorial:<br/>Click on a unit to select it.<br/>Each unit has four skills. Click on a skill to select it. Then click on a unit to use it (there will be a red indicator under units you can use it with).<br/>The red bars are health and the black bars show how long until the unit's next turn.<br/>Buffs and debuffs last one turn.<br/>Stun: the unit loses one turn<br/>Damage buff: damage is doubled<br/>Damage debuff: damage in halved<br/>Defense buff: unit takes half damage<br/>Defense debuff: unit takes double damage<br/>Buffs and debuffs of the same type don't stack and go away when the unit uses its turn.<br/>Click on the door to continue to the next level after defeating all enemies.</p><p>Updates coming soon.</p>", "metacritic": null, "released": "2016-04-03", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/bad/bad73a57e3c8f47636efa40105f93abc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 23, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Steven Miller"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}