{"id": 129098, "slug": "just-some-fun-games", "name": "Just Some Fun Games", "name_original": "Just Some Fun Games", "description": "<p><em><strong>WARNING: THIS GAME MAKES USE OF FLASHING COLOURS</strong></em></p><p><em><em>Just Some Fun Games</em> is about the experience of playing fun games on a camp. <br/></em></p><p>The Post-Mortem for this game can be found here.</p><p><em>Just Some Fun Games</em> was created for a student project titled \"<em>Make It Personal</em>\". The goal of the project was to create a game with meaningful emotional design about a particularly significant moment in your life that you feel defines you. We were given a week to complete the task but otherwise had no constraints. All mini-games were made using frameworks available on the GameMaker Studio store. The music used is Bleeps Galore by RoccoW, which can be found here for free download. It is highly recommend you experience the game for yourself first before reading the <em>Artist Statement</em> below. </p><p><em>Artist Statement:</em></p><p>The intention with <em>Just Some Fun Games</em> was to portray the experience of going on a Christian camp. By juxtaposing the high speed excitement of simple to understand classic arcade games with distorted, unnerving yet positively reinforcing messages I wanted to create a sense of confusion in the player with what they were experiencing. For me, the the significant moment this is based upon was a critical moment in my life which began a large amount of contemplation on the nature of religion, my place in it (or lack thereof) and my understanding on what brings me joy.</p><p>Background and Banner created using desi.gn by Lantana Games. </p>", "metacritic": null, "released": "2017-02-16", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/474/474584f7ad3ae4bc8c0ff88c66ca8826.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 20, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Harrison Metcalfe"], "genres": [], "publishers": [], "esrb_rating": null}