{"id": 129034, "slug": "cl-snake", "name": "cl-snake", "name_original": "cl-snake", "description": "<p>cl-snake is a small game, supposed to be a clone of the classic Snake game for cellphones. The main goal was to reproduce the game using the Common Lisp language.</p>\n<p>Currently, this game does not have any levels, and may be prone to bugs.</p>\n<p>The game is compiled as a standalone image of SBCL, created using Buildapp. Running it requires:</p>\n<ul><li>A 64-bit Linux machine, running X11</li><li>SDL2</li><li>OpenGL 2.x support</li></ul>\n<p><strong>NOTE: </strong>As a precaution, attempting to run this game on an ordinary x86 (32-bit) Linux environment will simply display an incompatibility notice on your notifications. I've taken this measure since I couldn't compile a x86 version of the game at the time.<br/></p>\n<p>This game also runs fine on Windows and I'm providing a build, though I'm not sure it works!<br/></p>\n<p>You're also free to go ahead and take a look at the source code. (I've tested it using SBCL back in 2013, but the relevant code hasn't changed a single bit). You'll need to setup SBCL with Quicklisp and acquire SDL2's runtime libraries in order to run it, though.<br/></p>\r\nChangelog\r\nv2 (04/05/18)\r\n<ul><li>Some Linux users were reporting a \"file not found\" issue when trying to execute the binary. Precautions were taken to try and fix that. Please leave your feedback in case of similar or other issues.</li></ul>", "metacritic": null, "released": "2018-04-05", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/048/0489747e2a1887dba136f32b52440588.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 25, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["Lucas Vieira"], "genres": ["Action"], "publishers": [], "esrb_rating": null}