{"id": 129090, "slug": "keep-the-flow", "name": "Keep The Flow", "name_original": "Keep The Flow", "description": "<p>Keep the Flow est, dans l'idée ... un petit jeu de plomberie. :D<br/></p>\n<p>Non, le personnage n'est pas un gars en salopette rouge du nom de Mario puisque c'est vous et que vous devrez relier ensemble des éléments de tuyauterie afin de permettre l'irrigation d'un réseau.<br/>Pour se faire, vous disposerez d'un nombre de pièces définit que vous pourrez tourner et déplacer mais que vous devrez utiliser en totalité, a vous de trouver la combinaison idéale.<br/>Plus la difficulté grandit, plus il y aura de pièces a assembler.<br/>Certains bonus pourraient, de temps a autre, vous aider dans votre mission.<br/>Vos temps seront archivés et comparés a ceux de vos amis, si vous le souhaitez.</p>\n<p>----------- Annotations ------------</p>\n<p>- Elève Premium de Gamecodeur :<br/>Oui Depuis  10 jours (7 juin 2017).</p>\n<p>- Langage et Framework utilisé<br/>Lua avec Love2D</p>\n<p>- Code par Mokudjinn / Graphismes par Mokudjinn (+ Ressource pack Gamecodeur).</p>\n<p>- Musique par Jessica</p>\n<p>- Utilisation de librairies et codes externes : Non</p>\n<p>- Temps passé, un peu plus de 40 heures réparties sur 4 jours, apprentissage inclu.</p>\n<p>- Comment as-tu (ou pas) abordé la contrainte du thème<br/>Avec joie, en fait je commençais juste a travailler sur les grilles 2D, cela a donné du sens a mes exercices.<br/>C'est même ce qui a déterminé mon choix de participer a cette jam alors qu'il ne restait que 4 jours avant la fin de cette dernière. Du coup, ma très modeste contribution pour ma toute première game jam me laisse une bonne marge de progression pour les prochaines, :D</p>\n<p>- Petit postmortem (avis sur le langage/framework utilisés, difficultés, succès, choix, bilan personnel rapide, etc...)<br/>J'ai rencontré des difficultés et la plupart d'entre elles sont toujours présentes mais elles me font progresser.<br/>J'ai suivi en accéléré les cours sur les tilemaps pour être a même d'en gérer une dans ce prototype.<br/>J'ai d'hors et déjà une liste de choses a faire pour pouvoir poursuivre dans cette voie et transformer l'essai en un petit jeu jouable.<br/>David avait insisté sur les bienfaits de participer.<br/>Même si le résultat peut difficilement être incroyable lorsque l'on débute, je dois dire que je suis ravi d'avoir choisi de l'écouter, au lieu de la petite voix intérieure qui trouvait cela inutile de montrer que je ne savais quasiment rien faire.<br/>Ce projet est clairement trop complexe pour un débutant comme moi pour être réalisé en 4 jours mais, grâce a cette Jam #7 ... il prend vie :D<br/>Participez aux jams sans retenue, c'est assez libérateur et plutôt fun !<br/>A suivre ...</p>", "metacritic": null, "released": "2017-06-17", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/b84/b849acd6aef44e2a94a1005f56d7d289.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 24, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Mokudjinn"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}