{"id": 129240, "slug": "soul-seeker-itch", "name": "Soul Seeker (itch)", "name_original": "Soul Seeker (itch)", "description": "<p><strong>IPCA Game Jam 2017 Art Prize Winner</strong></p><p>SoulSeeker is a rogue-like, boss-run, pixel styled game, made for Windows.</p><p>You play as Seeker, a man who was cursed by Keeper, the guardian of time and seasons. Keeper broke it's essence in 5 pieces and stored them on the 4 seasons.</p><p>It all starts in a tutorial area, where the player learns to fight with a minion. Seeker must defeat Keeper 5 times, in all it's different stages in order to regain his essence. Each season matches an element and in each season, Keeper changes his appearance and powers. The final battle is between you and a Keeper with all the elements combined.</p><p>Seeker: Protagonist. After being cursed by the guardian of time and seasons, he began to deform and loose himself. He started to be obcessed by chasing the golem that took his life. (has a horn and has his eyes blindfolded due to his deformities)</p><p>Keeper: A Golem, guardian of time and seasons that keeps the world's timeline in balance. Capable of changing his appearance to better match his surroundings.</p><p>The game does not contain dialogue. Contains background music and sound effects.</p><p>Keeper would originally have more powers. In his original state, he would have resistance to 2 elements, wich would change during combat (ex. water air, earth fire). This would make the player change his spells in order to have type advantage. The player would obtain runes for each victory. These runes would have parts of the characters backstory written in an unknown language that would be deciphered at the end of the game. The player would also be able to choose wich element to face first, and with each victory, he would gain the power of that season in order to have an advantage on his next fight.</p><p><strong>Controls:</strong><br/>Input - Keyboard and Mouse<br/>WASD - Walk<br/>E - Interact with the portal<br/>Spacebar - Dash / close menu<br/>left mouse button - Attack</p>", "metacritic": null, "released": "2017-04-11", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/b83/b83c66b7aaadeb28e72c6a51cb40123c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 34, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["IPCAGameJam"], "genres": [], "publishers": [], "esrb_rating": null}