{"id": 129345, "slug": "forma-vitae", "name": "Forma Vitae", "name_original": "Forma Vitae", "description": "Description\r\n<p>You control a cell in a broth full of corrupted entities. The goals is to cure them as long as possible.</p>\n<p>In order to cure the infected cells, you have to change your shape until it fits with the target cell's one. Then you have to overlap the target : then it is automatically cured and you can focus on the next corrupted cell.</p>\n<p>Be careful, overlaping the target is not enough to cure : you also have to make your cell rotate in order to fit the shape in a better way.<br/></p>\n<p>You can play from 1 to 6 players locally. If you miss some infected cells before they pass through the whole screen, you lose some life points until, you reach zero, the end of the game.</p>\n<p>For each cell cured, you increase your score. <br/></p>\n<p>This game was performed during the Global Game Jam 2018 event. Enjoy !</p>\r\n\r\nControls\r\n<p>All controls are performed with a gamepad. The gamepad configuration is based on Microsoft controllers such as XBox controllers.</p>\n<p>You move your cell using the analog stick. The A button is used to change your shape. The LEFT_and RIGHT_1 buttons are used to make your cell rotate.</p>\n<p>The START button must be used at the start screen, in order to access the player selection page. For the player selection, just press any button of your controller to register. Then any registered player can press START to begin the game.<br/>\n</p>\r\n\r\nDownload\r\n<p>\n</p>\r\n\r\nGFX\r\n<p>\r\nThis game contains original graphics made from watercolor paintings. You can see some other cool creations in the website of this amazing artist : Cédric BABOUCHE. <br/>\n</p>\r\n\r\nREPOSITORY\r\n<p>\r\nThe Mercurial(hg) software management repository is available here.<br/>\n</p>\r\n\r\nLicence\r\n<p>\r\nCreative Commons BY-NC-SA 3.0 (Attribution-NonCommercial-ShareAlike 3.0 Unported) - 2018 - RPH Studio.<br/>\n</p>", "metacritic": null, "released": "2018-01-29", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/139/1393e9976784821c547dd01df282a14a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 178, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["RPH Studio"], "genres": ["Action"], "publishers": [], "esrb_rating": null}