{"id": 12936, "slug": "cash_out", "name": "Cash_Out", "name_original": "Cash_Out", "description": "Cash_Out is a randomly generated top down shooter that blends stealth and action to keep the gameplay moving. Build up your character with career mode, or jump right into the game with quickplay. Choose your class, stats and skills to customize your character to your playstyle. While in raids pick up items, weapons and clothing to give yourself the edge while raiding!<ul><li>over 90 Skills Across 6 Unique Classes.<br/></li><li>Over 45 unique and randomized weapons to suit your playstyle.<br/></li><li>Over 54 pieces of clothing with interesting bonuses applied!<br/></li><li>Over 19 items to find and use in raids! <br/></li><li>18 perks that can change how you play instantly!<br/></li><li>3 game modes that change the way you progress!<br/></li><li>Scripting system allows you to make level sets, workshop support included!<br/></li><li>Play together with up to 4 players with the co-op mode.</li></ul><br/><br/>Cash_Out currently features a scripting system to allow you to make and upload unique room sets to the steam workshop, bundled with development tools to help you make levels. Along with that, the scripting language included allows you to go beyond basic level design, and add logic to your levels!<br/><br/><br/><br/><br/>Co-Op for Cash_Out is currently in beta! Join up with up to 4 different players though TCP connection to raid a building together! It won't be easy though, the more players, the harder the raid is, so build up a character with 4 new class types to help you in the raid!<br/><br/><br/><br/><br/>Cash_Out will be cheaper during early access, so if you're interested, now would be the best time to try it!<br/>", "metacritic": null, "released": "2015-05-27", "tba": false, "updated": "2019-08-28T22:12:59", "background_image": "https://media.rawg.io/media/screenshots/1b9/1b9b84096afea1eff9d4031477265765.jpg", "website": "http://cashoutgame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 17, "toplay": 1}, "playtime": 4, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 127, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Untouch"], "genres": ["Action"], "publishers": ["Untouch"], "esrb_rating": null}