{"id": 129319, "slug": "snowkoban", "name": "Snowkoban", "name_original": "Snowkoban", "description": "<p>Instructions: </p>\n<p>-Utilisez les flèches pour vous déplacer.</p>\n<p>-Mettez les blocs de glace sur les pointillés.</p>\n<p>-Vous pouvez pousser plusieurs blocs à la fois.</p>\n<p>-Attention à ne pas rester bloqué en poussant un bloc contre une paroi. Vous ne pouvez tirer les blocs.</p>\n<p>-Vous pouvez recommencer en cliquant sur la flèche en rond.</p>\n\n\n<p>Élève de Gamecodeur depuis décembre 2017.</p>\n<p>Je l'ai programmé en Java. Je sais que les règles stipulent que je doive programmer dans un language enseigné à Gamecodeur, mais j'ai lu cette règle au moment de publier. J'espère que ça ne dérange pas. Je vais programmer dans ces languages lors des prochaines Jam.<br/></p>\n<p>Pour ce qui est du Framework, j'ai utilisé les classes de base de java.<br/>Pour ce qui est de la librairie,  j'ai utilisé le Shivur engine que j'ai entièrement programmé depuis 5 ans. Elle comprend un moteur physique et une gestion des inverses kinematics.<br/><br/>Code et Graphismes par moi-même</p>\n<p>La musique est prise dans la librairie de Gamecodeur.</p>\n<p>J'ai passé environ 100 heures.<br/><br/>J'ai abordé la contrainte du thème en faisant un sokoban un peu plus physique plutôt que case par case. Le gameplay est très similaire excepté qu'il est possible de déplacer plusieurs blocs à la fois.<br/><br/>Post-mortem:<br/>J'avais déjà fait plusieurs Ludum Dare avant cette jam. J'ai expérimenté l'effet de dilatation du temps. J'aurais pu le terminer en 3 jours comme un Ludum Dare, mais il n'aurait pas été aussi paufiné. Je suis donc fier d'avoir disposé de plus de temps. Je vais donc probablement continuer à faire certaines jams de Gamecodeur.  <br/>J'avais déjà 5 ans d'apprentissage autonome de la programmation derrière moi, mais j'ai tout de même continué d'apprendre.<br/> Par exemple, j'ai expérimenté avec les murs qui se connectent aux murs adjacents.  Il se trouve que c'est d'avantage une question de graphisme que de programmation.<br/><br/>J'ai aussi travaillé pour jouer des sons. C'était un sujet que je n'avais pas beaucoup abordé avec mon jeu et les Ludums Dare.<br/><br/>Bon jeu!<br/>Shivur</p>", "metacritic": null, "released": "2018-01-16", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/066/0661e85608b0c93e14b52eaddeb9a814.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 57, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Shivur"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}