{"id": 129351, "slug": "key-shovel-treasure", "name": "Key, Shovel, Treasure", "name_original": "Key, Shovel, Treasure", "description": "<p>Sail off in search for a treasure that lies buried and locked somewhere on a tropical island. Key, Shovel, Treasure is a small pirate-themed game originally designed as a board game. It's aimed at children, but grown-ups have been known to enjoy it as well :).</p>\n<p>Ask your friends to join you in a game of Key, Shovel Treasure, or play against the computer. You can also pay in teams.<br/></p>\n<p>You can steer your ship across the sea with keyboard or mouse. Make landfall often to look for a key, a shovel and, of course, the treasure.</p>\n<p>Key, Shovel, Treasure started as a board game designed by one of us, Willem, together with his son (aged six). His kids liked the game, so he made a digital version for them. Which they liked so much that we decided it was worth the time to polish up the game and make it available to the world.<br/><br/>The default language for Key, Shovel, Treasure is English. Other than that, it can be set to Dutch. We're not brave enough to try our hand at any other translations, but adding in extra languages in the future is possible.<br/><br/>So here it is. Key, Shovel, Treasure really is a small game, so we've set the price at pay what you want, starting at free. Simply download the files for your system (Windows, Linux or Mac), unzip them and you're ready to give it a try. We'd love to hear what you think of it!</p>\n<p>Key, Shovel, Treasure is a Wee Free Studio side project. We've also made Powargrid, a turn-based strategy game that plays like a board game. With explosions! You can get Powargrid here, on itch!</p>\n<p>Visit the Wee Free Studio website and follow us on Twitter to see what we're up to.<br/></p>", "metacritic": null, "released": "2017-11-09", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/c24/c242cff2015e266a2b4b65294caad849.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 76, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Wee Free Studio"], "genres": [], "publishers": [], "esrb_rating": null}