{"id": 12944, "slug": "crash-drive-2", "name": "Crash Drive 2", "name_original": "Crash Drive 2", "description": "Get ready for ridiculous fun in this multiplayer free-roaming stunting game. Drive a bus, tank or  monster truck, speed across huge open worlds and participate in random events. Stunt across outrageous maps packed with plenty of bizarre terrain for an intense experience. Collect coins, level up your ride, and WIN the offroad race. Crash Drive 2 will drive you mad!<br/><br/>Crash Drive 2 features include:<br/><ul><li>  4 vast open worlds to explore; Can you find all the secret areas…?<br/></li><li> 6 random competitive events: Coin Collect, King of the Crown, Race, Tag, Stunt and Find the Ring<br/></li><li> RPG-inspired car-leveling system; 35 unique upgradable vehicles to unlock<br/></li><li> 5 devastating customizable tanks in a special tank battle game mode; Destroy your opponents’ tanks and level up your Battle rating<br/></li><li> Team up with your friends: Every purchase grants an extra copy that you can gift a friend!<br/></li><li> Cross platform multiplayer and single-player (PC &amp; mobile): No matter which platform you play on, you can always play with your buddies or take on the AI</li></ul><br/><br/><br/>Crash Drive 2 is best played with friends. In order to have the best experience, we’re rewarding every buyer with the following; when purchasing this game an extra Crash Drive 2 copy is added to your steam inventory to gift to a friend for free! Please review the following guide for instructions on how to do so: http://steamcommunity.com/sharedfiles/filedetails/?id=448954967<br/><br/><br/>We at M2H love games with a lot of freedom. It’s no surprise that this is the very core of Crash Drive 2. Drive around freely and explore the open world at your leisure. Find the best areas to score points, discover secret areas and search for the shady dealer. <br/>Random events offer fun challenges to any player that wishes to participate. This allows you to  <br/>unlock new levels and earn cash to buy new cars. <br/><br/>These random events include:<br/><br/><ul><li>Coin Collect: Coins fall from the sky: pickup the most valuable coins!<br/></li><li>King of the Crown: Hold the crown for 60 seconds while other players try to steal it. Guaranteed adrenaline rushes when 7 players are on your tail trying to crash into you.<br/></li><li>Race: Be the first to finish on various racing tracks.<br/></li><li>Tag: Tag the most objects by claiming them via stunts. Make sure you score enough points otherwise someone else can steal your tag.<br/></li><li>Stunt: Score the most points in a limited time, discover the best places to stunt.<br/></li><li>Find the Ring: Be the first to pass through a specific ring.</li></ul><br/><br/>When starting a game of Crash Drive 2 you will be automatically matched while playing. This guarantees populated matches and saving you the hassle of finding an active match. All game “rooms” reserve extra friend slots (10 players per game) so that your friends can ALWAYS join you through the Steam friend join feature.<br/><br/>Whenever an online connection is not available, the game smoothly transitions into a fully playable singleplayer version. Connectivity is never a problem!<br/><br/><br/>Ready for a car RPG leveling system that we’ve gone crazy?!<br/>Every car has four statistics: top speed, nitro, acceleration and grip. By using nitro, you increase this car’s nitro capacity, by driving at top speed you increase your top speed...you get the drift? When a car has all of it’s four statistics raised to 10/10, you will gain an overall level which allows you to buy a new car and earns you prestige on the in-game scoreboard and the Steam leaderboard.<br/><br/><br/>Since the tank is such a popular vehicle in the main game modes, we decided to dedicate one entire game mode to it. In CD2: Tank Battles you choose one of five unique tanks and strive to dominate the arena. Shoot or bump opponents off this sky arena to score points, extra points are awarded for special achievements such as multi kills, revenge, air shots and so on.<br/>When playing this game mode offline, bots(A.I.) will fill the opponent slots. This way the singleplayer is also fully playable.<br/><br/><br/>Crash Drive 2 originally started as a tablet game. The following features set the Steam version apart from the original:<br/><ul><li> The steam version does not have advertisements nor \"in-app\" purchases<br/></li><li> A big starting cash boost of 200,000 extra cash (would’ve cost over $5 in the original tablet game)<br/></li><li> Optimized for PC, Mac and Linux; better graphics, performance and controller support<br/></li><li> Further fixes and small tweaks to the game<br/></li><li> Steam integration (including friend joining, achievements and leaderboard)<br/></li><li> Includes a free giftable copy of the game to share with a friend<br/></li><li> Cross Platform multiplayer between PC,WEB and Mobile/Tablet</li></ul>", "metacritic": null, "released": "2013-11-23", "tba": false, "updated": "2022-09-29T23:04:02", "background_image": "https://media.rawg.io/media/screenshots/caa/caa4b8de38ce90eda43edac6df5bce6a.jpg", "website": "http://www.m2h.nl/crashdrive-2/", "rating": 2.5, "rating_top": 3, "added_by_status": {"yet": 4, "owned": 311, "beaten": 1, "dropped": 1}, "playtime": 4, "achievements_count": 32, "ratings_count": 10, "suggestions_count": 276, "game_series_count": 0, "reviews_count": 10, "platforms": ["Nintendo Switch", "macOS", "PC", "Linux", "iOS"], "developers": ["M2H", "SPIL GAMES"], "genres": ["Action", "Simulation", "Racing", "Casual", "Indie"], "publishers": ["M2H", "SPIL Games"], "esrb_rating": null}