{"id": 129699, "slug": "the-awakening-itch-racso", "name": "The Awakening (itch) (Racso)", "name_original": "The Awakening (itch) (Racso)", "description": "<p><em>    Wits and speed. Do you have both? Good. You won't die today, then.</em><br/></p>\n<p>The Awakening is a fast-paced puzzle game. Use your quick thinking to collect food while avoiding the Awaken: reanimated death who appeared in the world and caused the society to collapse.</p>\n<ul><li>Procedural levels. Try different paths and tactics and improve your scavenging skills with time.</li><li>Do you prefer surprises? There are random levels, too.</li><li>Quick survivalism and Exploration modes. Collect food as quick as you can, or take your time to explore the place while avoiding danger.</li><li>Online scoreboards.</li></ul>\n<p><strong>Versions</strong></p>\n<p>The game is available for PC and Android.</p>\n<p>The HELP version is kept available for the \"HELP: War Child\" game jam, as it meets the jam constraints.</p>\n<p><strong>How to play</strong></p>\n<ol><li>There are 4 types of tile in the board: health, food, obstacles and Awaken (enemies).</li><li>Each turn, pick a tile. You'll hit that tile plus every tile of the same type directly connected with it in any direction (vertical, horizontal, diagonal).</li><li>Tiles you hit are removed from the board, and their effect is applied: health tiles heal you, and food tiles add score. Obstacles do nothing; you remove them to clean the board.</li><li>After each of your moves, remaining enemies attack you.</li><li>Try to maximize your score before time runs out! Don't get killed!</li></ol>", "metacritic": null, "released": "2017-09-17", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/69a/69aefddabea9ecc8f42c98cb98359fb7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 71, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Android", "Web"], "developers": ["Racso"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}