{"id": 129652, "slug": "neon-force", "name": "Neon Force", "name_original": "Neon Force", "description": "<p>EN:Master your Motorcycle and destroy your opponents!, Ccompete against IA or other players.<br/>Use the 90 degree turns to do amazing plays and destroy the others to become a legend of the Battle Arena.</p><p>* Become a legend of Neon force.<br/>* Compete against up to 3 AI opponents.<br/>* Faces with players from around the world and destroy them all.<br/>* Play with your friends in LAN.<br/>* Try different ways to surprise your opponents.<br/>* Run and capture your enemy's flag.<br/>* Think you already are a legend from the Battle Arena?<br/>* Test yourself in the online race mode i wich your pilot skills are the ones that allow you the win.</p><p>ES: Domina tu moto y destruye a tus oponentes! Compite contra la IA u otros jugadores, <br/>Usa los giros de 90 grados para realizar maniobras increíbles y destruye a los demás para convertirte en una leyenda de la arena.</p><p>*Conviértete en una leyenda de Neon Force.<br/>*Compite en contra de hasta 3 oponentes o IA.<br/>*Enfrenta a jugadores de todo el mundo y destruyelos a todos.<br/>*Juega en LAN con tus amigos<br/>*Prueba diferentes maniobras para sorprender a tus oponentes.<br/>*Juega y captura la bandera de tu enemigo.<br/>*Crees que ya eres la leyenda de la arena?, ponte a prueba en el modo Online, una carrera de obstáculos en la cual tus habilidades como piloto son las únicas que te permitirán conseguir la victoria.</p>", "metacritic": null, "released": "2015-09-02", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/5a9/5a949f81bf1d96d63925640cf19ade92.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 127, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["NeoTwo"], "genres": ["Action"], "publishers": [], "esrb_rating": null}