{"id": 129766, "slug": "zombie-portals", "name": "Zombie Portals", "name_original": "Zombie Portals", "description": "<p><strong>SINOPSI</strong><br/><br/>Not everyone knows but in 1977 our dear planet has suffered an alien violent attack.<br/>Luckily they were not super-intelligent extraterrestrials (otherwise we would not be here talking about it), but a kind of alien stupid zombies.<br/>Five Heroes defended the peoples of all the Earth and these annoying smelly greenish pieces of meat.<br/>Now, it’s up to you try those emotions.<br/><br/><strong>HINTS</strong><br/><br/>Resist as much as long as possible and take out your brain from the hell.<br/>Take care your hearth! Never to have over 200 BPM.<br/>You will have the best weapons born from terrestrial technology and make use of the famous UV Shield that will protect you from the Sun.<br/>Always give him an yet, ‘cause your life depends on the charge of this interesting.<br/><br/><strong>FEATURES</strong><br/><br/>Zombie Portals is an old school endless 2D game.<br/>An exciting survival game that sees hordes of zombies that invade the Earth to eat brains and characters ready to do anything to save their beloved land and kill an unquantifiable number of zombies just for fun.<br/><br/><strong><em>- 5 HEROES<br/>- 10 GENRES OF ZOMBIE<br/>- OVER 15 DIFFERENT WEAPONS UNLOCKABLE<br/>- ONE SINGLE LIFE<br/>- WORLDWIDE LEADERBOARD</em></strong><br/><br/><em><strong>No Flappy Birds inside!!</strong></em></p>", "metacritic": null, "released": "2014-02-17", "tba": false, "updated": "2019-08-28T23:28:13", "background_image": "https://media.rawg.io/media/screenshots/c3f/c3fb76c4943c2c16eb6ac1965fb432cf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 67, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["BornLuckyStudio"], "genres": ["Action"], "publishers": [], "esrb_rating": null}