{"id": 129722, "slug": "cga-jam-sweethearts", "name": "[CGA JAM] Sweethearts", "name_original": "[CGA JAM] Sweethearts", "description": "<p><strong>Sweethearts (2 player card game)</strong></p>\n<p><strong>WIP</strong></p>\n<p>Sweethearts is my first attempt at a card game, set in an old western casino.</p>\n<p>To score points you either have to work with your 'sweetheart' or cheat and bet with<br/>the house (stealing points from your partner if successful).</p>\n<p>You want to match up with someone's cards - your partner or the \"house cards\" (dice)</p>\n\n<p><strong>Instructions</strong></p>\n<p>I will admit... this game can be confusing. Here are the instructions:</p>\n<p>The first person to 15 chips wins - so you don't want to just match with house or with your partner, you have to play strategically.</p>\n<p>Every round will consist of 5 phases:<br/><strong>Deal:</strong> Click the decks to deal three cards and sort them into one of your slots.<br/><strong>Roll</strong><strong>:</strong> Click the decks once more to get a hidden roll for each of your slots. (Will be   revealed later).<br/><strong>Bet: </strong>Reveal rolls by clicking on the cup then drag chips onto the card you that will match with your partner, or the dice that matches one of your cards.<br/><strong>Change: </strong>Click on the decks once. Each card will be changed according to the dice. A 1 of hearts with a 1 on the dice will become a 2 of hearts.<br/><strong>Score:</strong>  Click on the deck again - The game will now give chips accordingly. (See <em><strong>Scoring </strong></em>)</p>\n<p><strong>Scoring</strong></p>\n<p>Once the die have been rolled all the cards will be changed accordingly (sum of the card and the dice). Then matching will determine how chips are distributed.</p>\n<p><strong>YOU CAN'T BET ON A CARD AND ITS DICE</strong><br/></p>\n<p>If <strong>you</strong> bet on a <strong>card</strong> in slot 1 (slot with one line) that matches with your <strong>partner</strong><br/>- You and your partner will receive 1 chip from the house. (If both of you bet on this, you will each receive 2).</p>\n<p>If <strong>you</strong> bet on a <strong>dice</strong> in slot 1 that matched with the <strong>card</strong> in slot 1<br/>- You will receive 1 chip from your partner and house will receive 1 chip from your partner</p>\n<p><strong>Still don't understand? That's okay.. just play around a bit.</strong></p>\n\n<p><strong>M</strong><strong>usic from http://www.trachtman.org/ragti...</strong></p>", "metacritic": null, "released": "2017-06-07", "tba": false, "updated": "2019-08-23T11:39:07", "background_image": "https://media.rawg.io/media/screenshots/ab1/ab1cb4c62957e032b6629471ad461887.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 13, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["okkie"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}