{"id": 1297, "slug": "angry-birds-epic-rpg", "name": "Angry Birds Epic RPG", "name_original": "Angry Birds Epic RPG", "description": "Unleash the Angry Birds flock in a free turn-based RPG, and join a community of more than 85 MILLION players around the world!<br/><br/>Angry Birds Epic sends you on a sprawling adventure across the tropical beaches, frosty mountains, and deep dungeons of Piggy Island in hundreds of challenging levels. Collect and craft a huge arsenal of weapons, and wield powerful magic to defeat fearsome boss pigs and their many minions. Crush troublesome pigs in battle to win epic loot, craft ever more powerful weapons and level up your party. To victory!<br/><br/><br/>---------------//---------------<br/><br/>FEATURES:<br/><br/>● FIGHT hordes of enemies in turn-based battles. Use the powerful skills of your birds to lead your flock to victory!<br/><br/>● PLAY as heroic knight, mighty wizard, or helpful druid, and assemble the perfect party!<br/><br/>● LEVEL UP and master your birds to defeat mighty boss villains like King Pig, Prince Porky or Wiz Pig.<br/><br/>● CRAFT hundreds of weapons and magical potions! Improve your best equipment even further through powerful enchantments. <br/><br/>● COMPLETE rare equipment sets, and use them to unleash devastating power-effects in battle.<br/><br/>● CHALLENGE real players from around the world in the arena. Progress from wood to diamond league and carve your place at the top the leaderboards.<br/><br/><br/>● JOIN limited time events to earn valuable upgrades and rewards! Follow the flock on Facebook and Twitter for news on upcoming events.<br/><br/>---------------//---------------<br/>FOLLOW THE FLOCK<br/>https://www.facebook.com/angrybirdsepic<br/>https://twitter.com/ABEpic<br/>---------------//---------------<br/><br/>PLEASE NOTE: Logging into Game Center does not save your game data. To save your game progress in Angry Birds Epic, please sign up for a Rovio account or log into an existing one.<br/><br/>Angry Birds Epic is free to play, optional in-app purchases are available.<br/><br/>This game may include:<br/>- Direct links to social networking websites that are intended for an audience over the age of 13.<br/>- Direct links to the internet that can take players away from the game with the potential to browse to any web page<br/>- Advertising of Rovio products and also products from selected partners<br/><br/>This game may require internet connectivity and subsequent data transfer charges may apply.<br/><br/>Terms of Use: http://www.rovio.com/eula<br/>Privacy Policy: http://www.rovio.com/privacy<br/>Support: https://support.rovio.com/hc/en", "metacritic": null, "released": "2014-06-12", "tba": false, "updated": "2022-07-21T11:56:40", "background_image": "https://media.rawg.io/media/screenshots/f4d/f4d9fea48b84292abe597ee036fcbd4b.jpg", "website": "http://www.rovio.com", "rating": 3.82, "rating_top": 3, "added_by_status": {"owned": 4, "beaten": 3, "toplay": 2, "dropped": 9, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 10, "suggestions_count": 257, "game_series_count": 0, "reviews_count": 11, "platforms": ["Android", "iOS"], "developers": ["Rovio Entertainment", "Rovio Entertainment Oyj"], "genres": ["Adventure", "RPG"], "publishers": ["Rovio Entertainment", "Rovio Entertainment Oyj"], "esrb_rating": null}