{"id": 129756, "slug": "chickens", "name": "Chickens", "name_original": "Chickens", "description": "<p>Chickens is a level-based puzzle-game that gives players a chance to \r\nsolve problems in a new way. It presents bizarre problems that require \r\nbizarre solutions.\r\n</p>\n<p>\r\nThe chickens must negotiate their way through a series of complicated \r\nspaghetti junctions of pipes (which are controlled by the player) in \r\norder to reach the end of the game. Not only do they have to deal with \r\nthe threat of the <em>evil</em> ducks who are out to get the chickens, \r\nbut the layout of the pipes also poses a puzzle. The game is divided up \r\ninto levels, which are subsets of the pipe system. Each level consists \r\nof a series of pipes with obstacles, a certain number of chickens at the\r\n start, a target (number of chickens that have to reach the exit), and a\r\n time limit. The player must solve a problem by sending the target \r\nnumber of chickens to the end of the level within the time limit in \r\norder to be allowed access to the next level.\r\n</p>\n<p>\r\nA chicken will die if it encounters a duck and attempts to fight it (and\r\n so will the duck it's fighting), or come across a bomb or a dead end. \r\nHowever, they can reproduce by laying eggs, and sending the eggs to the \r\nincubators to hatch. To make things difficult, the chickens' eggs come \r\nin four different colours (green, red, blue and yellow), and must be \r\nguided through the same system of pipes to the correct incubator for \r\nthat colour in order to hatch. Any egg of the wrong colour trying to \r\nenter will be destroyed, along with one egg in the incubator waiting to \r\nhatch. The ducks can lay eggs too, and if enough ducks' eggs try to \r\nenter the incubator, it will be taken over and become a ducks' eggs \r\nincubator. Of course, it can be re-taken by the chickens by sending \r\nenough chickens' eggs to the incubator to destroy any remaining ducks' \r\neggs.\r\n</p>\n<p>\r\nChickens spawn from the entrances on the left (that look like taps), and\r\n must reach exit on right. Ducks are placed in the level by the level \r\ndesigner. Additionally, there are ducks' eggs taps at the top that can \r\nmaintain a constant and steady stream of ducks' eggs (ducks are Mean \r\nGreen Egg-laying Machines). These are a nuisance, but can sometimes come\r\n in handy.\r\n</p>\n<p>\r\nThe junctions consist of ordinary pipes, interchanges, command blocks \r\n(eg. \"Lay Egg\"), and other obstacles. The main control the player has \r\nover the game is the ability to switch the paths of some of the pipe \r\ninterchanges by moving the cursor over the interchange and pressing a \r\nbutton, so that the player can guide everything to where they want it to\r\n go. The player can also release eggs that are being delayed.\r\n</p>\n<p>\r\nSome of the interchanges have a red pipe running underneath them. If at \r\nleast one object is passing through this red pipe, the state of the \r\njunction changes to it's changed state and does not revert to it's \r\nunchanged state until the red pipe is empty again. This makes it \r\npossible to construct things like logic-gates out of pipes 'powered' by a\r\n stream of ducks' eggs (usually supplied from the ducks' eggs taps). \r\nThese can be combined to create computational logic circuits such as \r\nAND/OR/NOT gates, adding-machines, flip-flops, stack-based calculators, \r\nand even a fully fledged Turing-complete machine <em>(although the last two have yet to be implemented)</em>, so it should be possible to build a virtual computer that runs entirely off duck's eggs.\r\n</p>\n<p>\r\nThere are also a few obstacles (pick-ups) within the level, including \r\nbombs, radioactive chicken-feed (which will sterilise any chickens or \r\nducks that eat it), and superhero-costumes (leather jacket and \r\nsunglasses) that turn your fowl into SUPERCHICKEN or SUPERDUCK who can \r\nthen win all fights.\r\n</p>\n<p>\r\nThe game comes with an integrated construction-set (level-editor) so you\r\n can create and play your own levels, and share them with others. <br/></p>\n<p>Chickens is available for Windows, DOS, Linux (the Linux version is a bit out of date). Mac version coming soon.</p>\n<p>The game can be downloaded for free, but you can leave a small donation if you want (or a not-so-small donation if you really want).<br/></p>\n<p>\n<em>Note that this is more of an on-going pet-project than a finished \r\ngame, so it may still be a bit rough and unpolished in places. But you \r\ncan download it now for free, and enjoy what there is.</em>\n</p>\n<p>\r\nHappy egg-laying...\r\n</p>", "metacritic": null, "released": "2017-07-03", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/cb2/cb279a628861b6db1e6ba3793f7b9c9d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 189, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["Wacko Software"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}