{"id": 12987, "slug": "ira", "name": "Ira", "name_original": "Ira", "description": "<h3>Embrace the Beauty of Bullet Hell!</h3>High up in the heavens, the ancient crystal known as Ira maintains the peace of an entire world... until a mysterious figure shatters the crystal, allowing Chaos to return. As malevolent creatures suddenly appear across the land, a young girl is chosen by an ancient god to collect the fragments of Ira and restore order, assisted by the apostles who once served Ira’s creator.<br/><br/><br/><br/><h3>Find the Remnants of Ira and Save the World!</h3>A character-based shooter with roguelike elements, IRA celebrates the artistry of what shooter fans call “bullet hell”: enemy projectiles that weave intricate, geometric patterns across the screen and force you to seek out the precarious safe spaces between them. Set in an Eastern-influenced fantasy world marked by ethereal beauty as well as grave danger, it’s a procedurally generated action game that requires skill, inspires strategy and rewards patience.<br/><br/><br/><br/><h3>FEATURES</h3>• Shoot arrows from 166 different bows<br/><br/>• Choose three special “perks” (power-ups) each time you level up<br/>• 150 unique relics (passive buff items)<br/>• 43 different synergies from bow + relic combinations<br/>• 5 different Apostles that can be conjured for special ultimate skills and passive perks<br/>• Procedurally generated maps across more than six different stages<br/>• Boss battles with exceptionally devious projectile patterns<br/><br/><br/><br/><br/>", "metacritic": null, "released": "2023-10-03", "tba": false, "updated": "2023-10-06T04:15:32", "background_image": "https://media.rawg.io/media/screenshots/d47/d475cdc33cb41e19af2bcee429731579.jpg", "website": "http://www.iragame.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "toplay": 2}, "playtime": 2, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 139, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Ore Creative", "ABShot"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Nicalis", "Ore Creative"], "esrb_rating": null}