{"id": 13001, "slug": "super-cat-herding-totally-awesome-edition", "name": "Super Cat Herding: Totally Awesome Edition", "name_original": "Super Cat Herding: Totally Awesome Edition", "description": "SummaryWelcome to Super Cat Herding: Totally Awesome Edition!  Guide your cute, chaotic, invulnerable, furballs with a range of insane tools and abilities!  For what nefarious purpose, you ask?  That's for you to discover!Features<ul><li>Adorable kittens: <br/><br/>Cute, highly destructive, yet oddly indestructible... <br/></li><li>Over-the-top tools and abilities: <br/><br/>Choose from the mundane like laser pointers, the slightly absurd like highly caffeinated treats, to the insane like fire breathing… <br/></li><li>Highly destructible world: <br/><br/>If you can get your cats to actually do what you want... <br/></li><li>Play your way: <br/><br/>Typical keyboard and mouse work great, or get even closer to your menacing balls of chaotic fur in your Vive headset!<br/></li><li>Herd the developers: <br/><br/>Post and vote for new features. There is a lot of hilarious potential, and we would love to hear from you!</li></ul>Totally Awesome Karma<br/>This game would not have been possible without the existence of our kitten overlords, so one dollar of each sale goes towards a charity of the community's choice. Get your karma while you get your mayhem!  Visit our Reddit community for details.Why is this the Totally Awesome Edition? Where can I get the regular edition?Umm… it’s a game about destructive cats. So it’s totally awesome by definition! There is no “regular edition” when invulnerable cats are involved.", "metacritic": null, "released": "2017-02-18", "tba": false, "updated": "2019-08-28T22:12:57", "background_image": "https://media.rawg.io/media/screenshots/261/26179148e96d272bee1be4e86247d315.jpg", "website": "http://zooptek.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 32}, "playtime": 6, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 233, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ZoopTEK"], "genres": ["Adventure", "Strategy", "Simulation", "Casual", "Indie"], "publishers": ["ZoopTEK"], "esrb_rating": null}