{"id": 130001, "slug": "gingerbread-mans-adventure", "name": "Gingerbread Man's Adventure", "name_original": "Gingerbread Man's Adventure", "description": "<p><strong>DISCLAIMER: </strong>THIS GAME IS IN EARLY ACCESS. PLEASE DO NOT PURCHASE IT UNLESS YOU WANT TO ACTIVELY SUPPORT THE DEVELOPMENT OF THE GAME AND ARE PREPARED TO HANDLE SERIOUS ISSUES AND POSSIBLE INTERRUPTIONS OF INTENDED GAMEPLAY FUNCTIONALITY.<br/></p><p><strong>\"An Eater!!!\"</strong> screamed the gingerbread man, named Paul, as he saw the huge mouth biting and snarling towards villagers. You do not have to think long about it, why they are called eater, its simpy because they eat everything that tastest good, and gingerbread is delicious. Especially the villagers! He ran like he never did in his life, to get out of the village and away from the eaters. Many followed him, many left behind. He felt like he needed to do something about this. About those eaters destroying his home and taking away his loved ones. So he build a weapon out of a candy cane to defeat the evil.</p>Features in the current alpha version<ul><li>upgrading your weapon to deal more damage</li><li>earning money through defeating enemys and bosses</li><li>a functional character</li><li>first- and thirdperson</li><li>basic shooter-mechanics</li><li>a small level</li></ul>Future planning and ideas<ul><li>implementing all the necessary 3D models</li><li>creating a costum story in form of a comic</li><li>more upgrades and turrets or other characters</li><li>costum weapons and projectiles</li><li>costum outfits for the character</li><li>coop-mode</li></ul>Changelog:<p>0.0.6</p><ul><li>added some life to the game</li><li>added model for \"eater\" (WIP)</li><li>added vegetation</li><li>added paul's house</li><li>added texture to ground (WIP)</li><li>added option to close the game in the buy menu (not final)</li><li>adjusted visual settings</li><li>adjusted global light</li></ul>FAQ:<p>Q: Will this game be free to play?<br/>A: Yes totally. But if you want to support us for working on the game and got some spare money on your paypal account you can buy it.</p><p>Q: Will there be support for VR or other platforms?<br/>A: First let's see how well the game comes across the community. So if there is big excitement about it, possibly yes.</p><p>Q: Can i help develop the game?<br/>A: Yes! Just send me a message at kruemelgames@gmail.com, with some references, if you worked on games before. If you don't have any you've got to show me that you are willing to learn.</p><p>Q: Can i be a tester for the game?<br/>A: Of course. Just download the game and play around. If you find bugs, glitches or something else, post it in the discussion board.</p><p>Q: How big will be the game if released?<br/>A: As new content is added the game grows. But we try to make the game as small as possible so you don't have to download so much.</p>", "metacritic": null, "released": "2017-03-06", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/550/5503e8715862af3f044b63d2a95151ea.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 92, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["KruemelGames"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}