{"id": 130390, "slug": "miami-tank-mayhem-prototype", "name": "Miami Tank Mayhem - PROTOTYPE", "name_original": "Miami Tank Mayhem - PROTOTYPE", "description": "<p><em><strong>Miami, Florida</strong>, in an alternate timeline where the T<strong>hird Reich never gained much traction and the Cold War never happened</strong>, humanity has achieved perfect harmony... a global utopia. A <strong>New World Government </strong>is formed, and mankind finally knows peace, <strong>but at a terrible price...</strong></em><br/><em><strong>War and poverty</strong> are a thing of the past and nobody gives a damn about celebrities' personal lives outside of their movies, Hollywood films are <strong>deep</strong> and <strong>insightful</strong>, pop music is <strong>complex </strong>and <strong>melodic</strong>, and <strong>E.T. the video game was 1982's Game of the Year.</strong></em><br/><em>Truly it seemed that the world was <strong>perfect </strong><strong>in every way</strong>, but in reality it was <strong>much, much darker</strong>. With nothing interesting happening, physical print media died out in the year <strong>1984</strong>, with TV news seemingly on the way out the door - until a shifty news anchor from the <strong>Miami News Network</strong> hatched a <strong>brilliant, diabolical plan</strong> to save the network, and his job...<br/></em></p>\n<p><em>An <strong>aging, nameless </strong><strong>mercenary</strong> who's been out of a job since the <strong>Last War</strong> ended in <strong>1955 </strong>receives a <strong>mysterious letter with no return address</strong>, written on MNN stationery.</em></p>\n<p><em>\"I have a job for you. Our station's ratings have been <strong>down the toilet for 10 years</strong> now and we're about to get the axe, but I have a plan. A contact I have at the <strong>Florida Army Research Technology Syndicate </strong>recently shared with me some soon-to-be declassified information regarding a <strong>prototype super tank. </strong>I want you to <strong>steal it</strong> and <strong>take it on a joyride</strong> through <strong>downtown Miami, FL</strong>, destroying everything in your path. You will be compensated for your efforts, based on the amount of destruction left in your wake... the more <strong>mayhem</strong> you cause, the more <strong>viewers </strong>we'll get, and the more <strong>advertising revenue</strong> we'll bring in; it's a <strong>win/win</strong> situation for both of us. I will begin to wire you the money as soon as our cameras start rolling.\"</em></p>\n<p><strong>Miami Tank Mayhem </strong>is a prototype of an idea we had for a game jam back in January that we were too late to enter and still have time to put together a decent game, but we still ended up making it for fun, anyway. Development began on February 1st and continued sporadically through mid March. Things started out pretty damn smoothly, but towards the end of February we had ended up working further than we had planned to, and the game started to take a really weird shape. In the end we decided we'd rather move on to other projects, so we're releasing a hastily thrown together prototype to show what we managed to put together. Lots of ideas were scrapped due to us not really knowing exactly what we wanted out of this game, but a fair bit of them made the cut.</p>\n<p>You play a mercenary, hired by a news anchor from the failing Miami News Network (MNN) to cause mayhem and destruction for them to cover to boost their ratings. You're paid half your score at the end of every round whenever you die or quit back to the menu. You can upgrade your HEALTH, RATE OF FIRE, and DAMAGE from the main menu. The more you upgrade your tank, the more the army sends at you to take you out.</p>\n<p>CONTROLS:</p>\n<ul><li>WASD - Tank movement</li><li>MOUSE CURSOR - Aim the cannon</li><li>LEFT CLICK/HOLD - Fire cannon</li><li>Q - Shield (When unlocked)</li><li>RIGHT CLICK - Giant freakin' laser (When unlocked)</li></ul>\n<p>Made in UNITY3D<br/></p>\n<p>TWO GLASS HAMS is:</p>\n<p>Joolean - 3D artist, music composer</p>\n<p>VladiMatt - Code monkey</p>", "metacritic": null, "released": "2016-03-14", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/a11/a1109e28e333f48b6d78219fc63bd25d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 102, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["TwoGlassHams"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}