{"id": 13030, "slug": "the-mims-beginning", "name": "The Mims Beginning", "name_original": "The Mims Beginning", "description": "“The Mims Beginning” is a god-like strategy game with a dose of cosmic humor. The story takes place in an unknown space and time. In this galaxy mythical floating islands give shelter to all kinds of unusual and dangerous creatures. The game combines elements of fantasy and sci-fi genres. <br/><br/>Build interesting structures, plant vegetation, breed animals, take care of your minions, use divine PSI powers, triumph in face of natural disasters, fight monsters, predict the future, reveal secrets and much more. Assume the lead over Mims as they journey across the galaxy in their epic quest!<br/><br/>During their intergalactic voyage Mims are hit by an asteroid - their spaceship reduced to debris and the crew forced to evacuate onto nearby planets, which hold their own share of surprises.<br/><br/><br/><br/>The player's goal, among others, is to perform various tasks necessary to repair the spaceship. You begin by properly expanding your new colonies. Every mission takes place on a different planet, where isolated groups of castaways face their own fate.<br/><br/>The game combines numerous elements of gameplay: Your colonists act on their own most of the time, going about their duties without orders issued by the player. However, you can control them directly by issuing simple commands.<br/><br/>As the leader of the colony you have psionic power at your disposal, altering the fauna and flora of your planet, as well as the environment which they inhabit.<br/>The main focus of the game lies in expanding and defending the colony. Every building or plant placement counts, nevertheless the game falls more into a light-strategy genre.<br/><br/>The basic resource crucial to the colony's survival and development is energy. It is also essential to Mims’ vitality - used while performing work, as well as for maintaining proper functioning of the infrastructure. Vitality is obtained in generators using Bio Mass - derived, in turn, from special fruits processed in the Extractor. Part of the energy can also be obtained from wind flow thanks to correct placement of Wind Turbines.<br/><br/>The tasks performed by the Mims should include the expansion of the colony and picking up Bio fruits.Some of the Mims act as a protection against various and dangerous creatures attracted by the scent of fruit and animals.<br/><br/>The Mims’ knowledge allows them to breed animals that feed on different types of fruit. Grown animals can be traded with native tribes and exchanged for crystals essential in further expansion of the colony.<br/><br/>In order to grow fruit for animals, Mims will also need to sow seeds from various plant species, such as exploding plant that hurls fruits around. Choosing good sites for sowing seeds has a strategic element to it.<br/><br/>A clever leader is able to use the topography of the map to their advantage, thereby avoiding excessive scattering of fruit all over the planet. In case of a bad placement, fruit crop can be lost due to fruit rolling off the edge of the planet.<br/><br/>If the crops fail to be harvested on time, they will soon rot away, resulting in a loss of a precious resource.<br/><br/>Along the way you shall also gain access to new buildings, plants, acquire new Psi powers, as well as invent new skills for your Mims.<br/><br/><br/><br/>Badly governed colony expansion may result in a crisis and chaos on your planet, in which case you might be forced to restart the scenario.<br/><br/>As the story progresses, Mims will find themselves facing threats from outer space. One of them is a meteor storm that can wreak havoc among your colonists. In order to be prepared, you can invent technology that allows you to predict such future events.<br/><br/>Help Mims survive the numerous perils of the galaxy in their bid to reach their final destination!<br/><br/>", "metacritic": null, "released": "2016-05-18", "tba": false, "updated": "2019-11-19T17:54:03", "background_image": "https://media.rawg.io/media/screenshots/98e/98ef59abda4674c6048cb7a77906e5b9.jpg", "website": "http://www.mimsthegame.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 6, "owned": 145, "toplay": 1}, "playtime": 2, "achievements_count": 35, "ratings_count": 2, "suggestions_count": 504, "game_series_count": 0, "reviews_count": 2, "platforms": ["Nintendo Switch", "PC", "macOS", "Linux"], "developers": ["Squatting Penguins"], "genres": ["Strategy", "Simulation", "Indie"], "publishers": ["Ultimate Games", "Squatting Penguins"], "esrb_rating": "Everyone 10+"}