{"id": 13041, "slug": "kronos", "name": "Kronos", "name_original": "Kronos", "description": "Kronos is an Action, RPG, Indie game with lots of combats, customization and puzzle interaction. Explore the castle and its more than 30 areas and discovers his dark secrets hidden in it. More than 50 unique enemies, and 8 powerful and challenging bosses. Dozens of items for customize your hero: swords, axes, maces, bows, explosive arrows, poison arrows, rings, armor, helmets, shields...<br/><br/>And 33 unique talents to define your own play style. Kill enemies and loot items while leveling up. Craft useful potions, special arrows, and enchant your weapons with alchemy. Cast 20 powerful spells of Fire, Ice, Earth and Electric elements. Fireballs, Ice Nova, Stone Skin, Chain Lightning, and many more. Logical puzzles wich requires item searching and combining them to create the item you need.<br/><br/><strong>Features</strong><br/><ul><li>An entire castle to explore with 30+ huge areas.<br/></li><li>More than 50 different enemies, and 8 powerful and challenging bosses.<br/></li><li>Dozens of items for customize your hero. Swords, Axes, Maces, Bows, Arrows, Rings...<br/></li><li>Level up your hero with 33 unique talents and improve every aspect of him.<br/></li><li>Craft useful potions, special arrows, and enchant your weapons with alchemy.<br/></li><li>Cast 20 powerful spells of Fire, Ice, Earth and Electric elements.<br/></li><li>Hero Difficulty for who wants a more challenging gameplay.<br/></li><li>Logical puzzles wich requires item and hint searching.<br/></li><li>Puzzle solutions are random and change every new game.<br/></li><li>Colorful elemental enviroments of Fire, Ice, Earth and Electric themes.<br/></li><li>Epic original soundtrack by José Ramón 'Bibiki' García.</li></ul>", "metacritic": null, "released": "2017-02-03", "tba": false, "updated": "2019-08-28T22:12:56", "background_image": "https://media.rawg.io/media/screenshots/ef4/ef4d3bbe576979e89a1b5522aee9d1bd.jpg", "website": "http://www.uroborostudio.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 66, "beaten": 1}, "playtime": 1, "achievements_count": 51, "ratings_count": 4, "suggestions_count": 285, "game_series_count": 0, "reviews_count": 4, "platforms": ["PC"], "developers": ["UroboroStudio"], "genres": ["Action", "RPG", "Indie"], "publishers": ["UroboroStudio"], "esrb_rating": null}