{"id": 130456, "slug": "the-crash-storm-clouds-of-the-mind", "name": "The Crash: Storm Clouds of the Mind", "name_original": "The Crash: Storm Clouds of the Mind", "description": "<p>(EDIT: The Windows version is now live. I had to put it on another page, but it should work. Get it here: https://strung-up-starlight.itch.io/the-crash-storm-clouds-of-the-mind-windows)</p><p>(A note before you download: this was my first time completing a game, completing a game jam, making my own graphics for it, parallax mapping, using Photoshop, using Audacity, trying pixel art, using music that isn't included in the RTP, and uploading it to the Internet. So, naturally, it's not going to be great. In fact, I know it's not great: it's still too large after trimming down files, I could only host one file on this page so the Windows version is elsewhere, and the load times are garbage.)</p>\n<p>(But do you know what? I finished it. And for that much, I'm happy. Thank you for the experience, and I can't wait to improve and do something considerably better for next year.)</p>\n<p>(You play as Elizabeth, a college student in the 1960s who's troubled by weird dreams. There are three effects, a few  mostly-story-related events, and a few other things to collect. There are three overworlds, seven side worlds, and only two endings. Please let me know if the game isn't working. It worked fine on my desktop, but I can see it running into issues elsewhere.)</p>\n<p>(I'll be back to upload a windows version later, possibly in a different game page altogether.)</p>", "metacritic": null, "released": "2018-06-25", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/8d4/8d44c8035adfa9ab9189ca8c72e3dd29.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 6, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS"], "developers": ["Strung Up Starlight"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}