{"id": 130423, "slug": "mana-stream", "name": "Mana stream", "name_original": "Mana stream", "description": "<p>A youth reads a book about his favorite heroes of the past, dreaming of becoming one himself one day. What he didn't expect was that fate would play an unexpected hand and launch him into an epic beyond what he could emagine!</p>\n\n<p>the Intro to the game is complete, offering roughly an hour or two worth<br/> of content and growing rapidly, I hope to deliver weekly updates to <br/>grow the world, the content, and the fanbase all at once.</p>\n<p>The game is in the works and I wanted to release it early to get some feedback from the world on how the game should possibly evolve, i've never done an Itch.io page before so I hope i can represent my game well. <br/></p>\n<p>Content:</p>\n<p>RPG Maker MV:</p>\n<p>The game is made by using RPG maker MV, all my content is of course allowed for commercial resale, however, being that I am a low budget man working on a low budget project, of course the resources for the game will suffer in that regard, being stuck with the content provided by the program itself, However, thanks to it's character generator, and a few lil loopholes i know with the software, I can push it that little bit further, for example, having characters with various facial expressions, and having unique characters that are not stock characters, this allows me to massively expand the worlds peoples to some extent, and in the end, thats my focus, The people as you cannot have a living world without living people and that is what I am seeking to emulate as best I can.<br/></p>\n<p>-UNIQUE CLASS SYSTEM:</p>\n<p>rather then be a simple pick your class and go, you start as any would start in a living world, as a person, in this case, a student of a teacher, these two classes are not that great, but make sense in the long run, you'll get the option to Opt out of your starting class and really start to grow as a character. each character will have unique stats that will determine what class is best suited to them, and at some point in the game, you will be able to freely change someones class.<br/></p>\n<p>-JRPG STYLE GAMEPLAY:</p>\n<p>this game as a side view combat system that is similar to FF, you have select actions you can take, a variety of spells, and techniques for everyone to use.<br/></p>\n<p>-CHOICES you make in game, and actions you take can have consequences and rewards</p>\n<p>[will alister live or die?] is an example of a choice made not directed at the player, but can be a consequence of his actions in game</p>\n<p>[what class will your character be?]  is another example where your actions can lead to a long lasting change to the games story arch.</p>\n<p>STORY:</p>\n<p>Our hero closes a book he reads one stormy night of his favorite heroes, the next morning his teacher shows him abit about history, what follows is the discovery of a lifetime and  a threat that seeks to destroy the mana stream, the very heart of their world! Join Calem as he travels the world, trying to slow the tide of a rising threat from days long past.  Help to gather heroes in the making and to have them write a whole new chapter in the history of the world!<br/></p>\n<p>The story in the game is being written and done by me, I am a D&amp;D/Pathfinder system fan and a long standing DM for my groups. That being said, many of my ideas, story elements, and characters may very well come from my groups worlds and peoples. If your in one of my gaming circles, you may find your character lurking in the dark :P</p>\n<p>That being said, This is a story I hope to make very rich and full of interesting lore for players to enjoy.</p>\n\n<p>The donation build will only be available up to halfway through the story, from there a full version will be a paid product. Donators will get a free copy! ;)<br/></p>\n\n<p>Credits:</p>\n<p>Graphics:</p>\n<p>Avery - https://forums.rpgmakerweb.com/index.php?threads/birthday-special-avys-mv-stuff....</p>\n<p>RPG Maker MV staff and program</p>\n\n<p>Music/sound</p>\n<p>RPG Maker MV staff and program</p>\n\n<p>Story and concept:</p>\n<p>Auron Dragonfire</p>\n\n<p>game coding:</p>\n<p>Auron Dragonfire</p>\n<p>Special Thanks:</p>\n<p>My D&amp;D / Pathfinder groups that are my inspiration and muse</p>\n<p>All who donate to help me support my dream of eventually hiring proper coders and designers to realize a whole game to call it's own unique thing!<br/></p>", "metacritic": null, "released": "2017-09-07", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/854/854e2785e49ee75a550bd53ff3d2f9d2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 153, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["aurondragon"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}