{"id": 130432, "slug": "incognito-itch", "name": "Incognito (itch)", "name_original": "Incognito (itch)", "description": "<p>E3 DEMO SCRIPT -VERY IMPORTANT!!!!!!!- </p><p>-GOTTA GET THAT HIGH AUDIENCE SCORE!!!!-</p><p>Alright, so we've got our big E3 demo coming up and I know we've practiced this endlessly but</p><p>we need everyone 100% on everything. Since the audience votes on every demo everything needs</p><p>top be perfect.</p><p>Controls:</p><p>The left analog Stick moves you around (obviously)</p><p>A will advance text and switch masks on the switch points.</p><p>X will acitvate your smoke bomb. (Should only work when it needs to)</p><p>Y will reset the demo (ONLY USE THIS FOR PRACTICE)</p><p>Start will quit the practice and move onto the real show.</p><p>Press F to toggle fullscreen</p><p>(IF YOU NEED THE KEYBOARD)</p><p>The arrow keys will move you</p><p>S will advance text and switch masks on the switch points.</p><p>A will acitvate your smoke bomb. (Should only work when it needs to)</p><p>Y will reset the demo (ONLY USE THIS FOR PRACTICE)</p><p>Enterwill quit the practice and move onto the real show.<br/></p><p>As for the demo itself, you'll be running it while I'm talking. We only have a small indie slot and a lot to fit in so I'm just gonna stick to the script and you're gonna need to keep up with me. It shouldn't be too hard. But just in case here's the outline.</p><p>-Intro</p><p>After the camera pan you'll have a bit of free time to just wander around and look at the city. Make sure not to run into the guards or change masks.</p><p>-Attempt to break in</p><p>After I finish describing Nia I'll move onto the mission description so try and walk past the guards at this point.</p><p>-Changing Masks</p><p>While I'm commenting on the security, make your way in front of the ad to change Masks. Don't worry about actually picking one, the A button will just switch to one and make it look like you chose one. Just a little dev magic for em!</p><p>-Breaking in</p><p>While I'm talking about the Masks feel free to break into the building. This is the main hook to our game so I've left plenty of room to fully explain it while you walk around. This point to the end will actually be generic Mask talk so you can move at your own pace.</p><p>Just don't go too slow because we only have a small amount of time!</p><p>The last things you need to do to finish the demo are</p><p>1. Go to the top room.</p><p>2. Activate the smoke bomb when the laser sights come out.</p><p>3. Swap Masks again behind the bottom right pillar.</p><p>4. Leave out the bottom exit.</p><p>Remember to be quick on the smoke bomb since, for the sake of simplicity, (and because it's just not done yet) the game doesn't actually have combat and it'll look dumb if you stand there and nothing happens. BUT if you nail the smoke bomb right away it'll look like we have cool dynamic combat options and noone'll have to know. It's available as soon as the guard turn to face you.</p><p>-THE WRAP UP</p><p>At the very least make sure you do everything by the time I start wrapping up. You'll know it by me saying \"However you choose to resist is up to you.\"</p><p>Just make sure to get you're practice in, this is our big break! If we put on a great demo and get A good audience score we'll be set!</p><p>~~YOUR BOSS~~</p><p>Music by DST</p>", "metacritic": null, "released": "2016-08-15", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/6cf/6cf9103fc597f450009c0f83a9035880.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 49, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["PIZZAPRANKS"], "genres": [], "publishers": [], "esrb_rating": null}