{"id": 130430, "slug": "the-ghost-engorger", "name": "The Ghost Engorger", "name_original": "The Ghost Engorger", "description": "<p>My first Ludum Dare and first published game. It's... Interesting.</p><p>Link to Ludum Dare page: http://ludumdare.com/compo/ludum-dare-34/?action=p...</p><p><strong>Description:</strong><br/>You're a thing-dude who likes to eat ghost-dudes, and you GROW bigger as you eat more ghosts. You can only eat ghosts that are smaller than yourself, however, and bigger ghosts will kill you! </p><p>Become big enough to eat the gate-keeper dude at the top of the level, and you can start the game over with a brand-spankling new SCORE POINT! The game gets harder as you go, so see how many points you can get.</p><p>But don't become so big that you get stuck in the level. A ghost could totally come over and kill you, and you wouldn't be able to move. That would suck.</p><p><strong>2-Button-Controls:</strong></p><p>Turn Left = Left Arrow / A</p><p>Turn Right = Right Arrow / B</p><p>Turn Around = Left + Right Arrow / A+B<br/></p><p><strong>Issues:</strong></p><p>Oh Boy, I REEAAALLY should have done the warm-up. Most of my time was spent trying to figure out how to do things that I had never done before, since I only started learning how to make games a few months ago. If I had had more time, I would have added and fixed all this stuff. Oh well, you live and learn. This wasn't bad for a first-time-jam, I don't think.</p><p><strong>Missing Features:</strong><br/></p><ul><li>Sound and Music :(</li><li>Proper window sizing (I'm sorry if the 800x800 window goes off your screen :( )</li><li>More levels and a transition between them</li><li>Overhauled the graphics to make the player character a guy on a skateboard with a vacuum on his back, sucking up all of the ghosts while the vacuum bag gets bigger, and given the ghosts different, better sprites.</li><li>Main Menu</li><li>Pause Menu</li><li>Mini-map, so you know which direction you're facing, and an arrow pointing to the GateKeeper when you're big enough to eat him.</li><li>Countdown to Start when the level starts</li><li>Smoother turns for player and enemies</li><li>Better-Reading text (one of the last things I added was text on screen :/ )</li></ul><p><strong>Bugs:</strong><br/></p><ul><li>Enemy AI not working quite right/displacing enemies</li><li>Probably a lot I haven't seen. I programmed right down to the wire.</li></ul>", "metacritic": null, "released": "2015-12-14", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/d14/d141d84c46c809375d77b70e341f07ed.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 23, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Rys0n"], "genres": ["Action"], "publishers": [], "esrb_rating": null}