{"id": 130559, "slug": "little-mermaid-princess", "name": "Little Mermaid Princess", "name_original": "Little Mermaid Princess", "description": "<p>Mermaids are the ones that fascinate most! Meet the Mermaid Princess, \r\ngirls, and check her angelic features and magnetizing charm! Today she’s\r\n inviting you to discover her steps of glamor. Her facial makeover with \r\nits refreshing masks transform her from a pretty mermaid into a \r\nsparkling little princess! Her professional make up kit and stunning \r\nlittle wardrobe are also at your disposal today so you can feel free to \r\npick your favorite items when creating her the stunning look for today! \r\nEnjoy this new makeover game, make her up, dress her up and transform \r\nher into the perfect Mermaid Princess that she is!\r\n</p><p>★★★Features★★★</p><p>★ Only in “Little Mermaid Dress Up”: Enjoy two interesting mode<br/>-\r\n Classic mode: Dress baby up to be cute, sweet or style up to you. Tap \r\nand keep in 2 seconds, you can choose vary of backgrounds from gallery \r\nto suit outfit. You can pinch, zoom, rotate and move model and \r\nbackground and have the most beautiful photos.<br/>- Time mode: Try your memory to make her look like the model to get the highest score<br/>★ A lot of make-up styles.<br/>★ Difference accessories: earrings, necklaces, and bracelets<br/>★ Many cute hair styles<br/>★ Pretty color clothes: outfits, dresses, T-shirts and shoes..<br/>★ Take nice photos and share with people over Facebook, Twitter.. or save in gallery.</p>", "metacritic": null, "released": "2014-05-29", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/6e6/6e60b2651132f39ade5882bcc263d194.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 128, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["geckolor"], "genres": [], "publishers": [], "esrb_rating": null}