{"id": 130542, "slug": "factory-daze", "name": "Factory Daze", "name_original": "Factory Daze", "description": "<p><strong>48K ZX Spectrum - 2009</strong></p>\n<p>In the midst of a global economic slowdown, families across the country are shunning more expensive restaurants in favour of cheaper fast-food outlets. The major producer of bio-degradable toys which come with the children's meals has never had it so good, and so to keep up with the increased demand has installed an automated production line to produce everything quickly &amp; efficiently.</p>\n<p>But one night the machine mysteriously starts making the wrong toys - all mis-formed &amp; broken - so you've been hired to keep an eye on the machines to ensure each part of each toy is stamped correctly into shape...</p>\n\n<p>A simple and colourful game - easy to get the hang of, but difficult to master - becoming a frantic battle of concentration as you try to juggle the settings of up to four stamping machines at once so each toy is correct and ready for shipping.</p>\n\n<p><strong>MicroMart</strong> - \"<em>There is very little to complain about with Factory Daze. The pace of the game varies from sedate to frantic, but even as you get through some of the more pedestrian stages, you get a metal work out. This is one of the best Spectrum releases that you'll see this year</em>\" - 9/10</p>\n<p><strong>RetroGamer</strong> - <strong>Sizzler</strong> - \"<em>Factory Daze is almost worryingly cute. The in-game music is cheerful to a degree that could get a job presenting children's television, and the little toys working their way through the production process includes delightful robots of various descriptions, floppy disks, Space Invaders-inspired aliens, assorted kitchen utensils, and even the fast food itself</em>\" - 92%</p>", "metacritic": null, "released": "2017-12-21", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/480/48026e3735937d9fe36ed5f775e8f615.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 131, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Bob's Stuff"], "genres": ["Action"], "publishers": [], "esrb_rating": null}