{"id": 13057, "slug": "rc-airsim-rc-model-airplane-flight-simulator", "name": "RC-AirSim - RC Model Airplane Flight Simulator", "name_original": "RC-AirSim - RC Model Airplane Flight Simulator", "description": "<strong>Learn to fly r/c model airplanes with this realistic flight simulator! </strong><br/><br/>RC-AirSim has been used successfully by many r/c pilots to learn how to fly a model airplane. RC-AirSim has more realistic flight dynamics and ground handling than most of the much more expensive r/c flight sims. RC-AirSim was one of the first big hits on Xbox Live Indie Games (XBLIG), where it held the #1 ranking position for many weeks.Features<br/><ul><li> 9 model airplanes to fly including: F-15 Fighter Jet, WWI Biplane, Glider, Electric Parkflyer, Aerobatic Planes, and a Trainer. <br/></li><li> Realistic r/c model airplane flight aerodynamics based on NASA flight simulation technology. <br/></li><li> Fly with Mouse, Keyboard, or Game or USB Controller. <br/></li><li> Powerful controller remapping and calibration feature so almost any controller is compatible.<br/></li><li> Awesome crashes! Planes break apart in a realistic physics-based manner. <br/></li><li> Accurate landings and ground handling. <br/></li><li> 3 view options - R/C, Following (Chase cam), and Onboard camera (FPV). <br/></li><li> 4 channel controls - aileron, elevator, rudder, throttle. <br/></li><li> Optional on-screen Transmitter Sticks. <br/></li><li> 3 control modes: Mode 2 (default), Mode 1, and 3 Channel. Customizable.<br/></li><li> Field objects to avoid and fly behind. <br/></li><li> Doppler-correct sound. <br/></li><li> Get flying quickly! No slow, tedious menus or multiple load screens.</li></ul><br/>RC-AirSim is a R/C Model Airplane Flight Simulator that excels where it matters most: realistic flight dynamics and aerodynamics! <br/><br/>Tired of \"simulators\" that feel unrealistic and fly like an arcade game? Try RC-AirSim! Experienced R/C pilots say that RC-AirSim feels and flies like an actual r/c model airplane! R/C pilots, don't let your skills get rusty when you are away from the flying field: practice with RC-AirSim. New to the hobby of r/c model airplanes? Learn on RC-AirSim first and make the maiden flight of your first r/c plane a successful one.R/C Aircraft<br/><ul><li> F-15 Regal Eagle </li></ul>Large gas powered ducted fan military jet. 4 Channel control. <br/><br/><ul><li> WWI Flying Ace </li></ul>Electric scale biplane based on the historic World War I Fokker D.VII. Moving control surfaces and spinning prop. Comes with two paint schemes: Red/White or Blue/Green Lozenge. 4 Channel control. <br/><br/><ul><li> Back 40 Trainer </li></ul>Classic 4 channel high-wing trainer with plenty of dihedral for beginners. Powered by a .40 size gas engine. <br/><br/><ul><li> Slowmowatt </li></ul>Electric park flyer. Flies very slow so there is plenty of time to react. Easiest to fly! Perfect for beginners using the 3 Channel control scheme. 4 channel control available. <br/><br/><ul><li> Double Helix </li></ul>Low wing electric sport plane. A great choice for beginning aerobatics. 4 Channel control. <br/><br/><ul><li> Madster EDF </li></ul>Small sport scale electric ducted fan military jet. 4 Channel control. <br/><br/><ul><li> Super Dee </li></ul>Large high wing tail-dragger aerobatic sport plane. Gas powered. Great for low inverted passes! 4 Channel control. <br/><br/><ul><li> Emerald Glider </li></ul>Classic 2-meter wingspan glider. 4 Channels - use the 'throttle' channel to adjust your drag. For rudder/elevator controls only (no ailerons), fly using 3 Channel control scheme.", "metacritic": null, "released": "2015-06-02", "tba": false, "updated": "2019-10-22T13:48:54", "background_image": "https://media.rawg.io/media/screenshots/75f/75f41350a0bf0a621853a02691977de9.jpg", "website": "http://rc-airsim.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 204, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "PC", "macOS"], "developers": ["Fabricated Reality Software", "Fabricated Reality"], "genres": ["Simulation", "Racing", "Educational", "Indie"], "publishers": ["Fabricated Reality Software", "Tim Eichor"], "esrb_rating": null}