{"id": 130546, "slug": "wip-shmup-demo", "name": "WIP shmup demo", "name_original": "WIP shmup demo", "description": "<p>\r\n\tControls:\r\n</p><p>\r\n\tPoint &amp; click with the mouse to navigate menus.  Move the ship with the arrow keys or WASD.  Mouse can also move the ship, but this feature can be turned off in the Options menu if you like.</p><p>\r\nPress P or Esc to pause and unpause.\r\n</p>Play it now.  Tell me what to do better.<p>I'm not gonna sit here and try to tell you it's innovative or retro or a metaphor for humanity or whatever. It's a shmup. You fly along in one direction and blow stuff up. What more do you want? It's free. Just play it.  Then tell me what's wrong with it so I can make it better. It's the only way I'll learn.</p><p>\r\n\tRight now, it's in a web browser, and the eventual goal is to release it on Android. Why Android? Because believe it or not, right now there's a gap on Android between shooters that are popular and shooters that are fun to play.\r\n</p><p>\r\n\tNaturally, I wanna add bosses and upgrades and gameplay modes and long-term replay value before doing anything even remotely commercial with this game. You can Phillip J. Fry me if you want, but right now I don't expect that. The best possible way you could help me is by ripping my baby apart savagely \r\n\tin the comments section so I can completely rebuild it from the ground up to suck less.\r\n</p><p>\r\n\tFeatures:\r\n</p><p>\r\n\t- No inexplicably flying anime characters. You play as a bright red spaceship as god intended.\r\n</p><p>\r\n\t- Reasonably modern 3D graphics. Bump maps and specular maps are all good. I draw the line at expensive shaders. I'm fill-rate limited as it is. Speaking of which…\r\n</p><p>\r\n\t- …but not so modern that you can't tell the good guys from the bad guys. If this was on a next-gen console, you just know all the ships and backgrounds would be pitch black with muddy brown highlights.\r\n</p><p>\r\n\t- Fly around and blow shit up. Seriously. Why else would you even be looking at a shmup?\r\n</p><p>\r\n\t- Not (currently) a Danmaku/Curtain-fire/Bullet Hell game. If I were to add this at some later date, it would be something late-game that you build up to, probably a New Game + mode of some sort. I want regular folks to be able to just pick up the game and get better at it as they play, without feeling like there's this huge barrier to entry just because a bullet pattern looks impossible.\r\n</p><p>\r\n\t- Not an Ikaruga clone. I'll admit there's some inspiration here and there, but it's superficial stuff like camera angles. (Which, frankly, everyone should be using, because it's just plain better.) Honestly the aesthetics owe a lot more to Gunlock or Raiden or the like than Ikaruga. This game does not have a two-color polarity system.\r\n</p><p>\r\n\t- Upgradable weapons from the in-game shop. The first version of the weapons system is finally working.  It's still in the early stages, and it's definitely not balanced yet.  Lots more work on this coming soon, but I finally feel like you can get a general feel for the direction the game is going.\r\n</p>", "metacritic": null, "released": "2014-12-08", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/b9d/b9de08dc64755bd5d28fd43feec4a565.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 55, "game_series_count": 0, "reviews_count": 0, "platforms": [], "developers": ["FailFaster"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}