{"id": 130563, "slug": "power-struggle-spyros-kyriazos", "name": "Power Struggle (Spyros Kyriazos)", "name_original": "Power Struggle (Spyros Kyriazos)", "description": "<p>This game was created for Ludum Dare 39 - Compo in 48 hours. The theme was \"Running out of Power\".</p>\n<p>Power Struggle is a digital board game for one to four players.</p>\n<p>You play as the lord of a medieval family trying to gain more power over the neighboring families. The goal of the game is to gain the most power while sabotaging your opponents.</p>\n<p>At the home screen select which houses are controlled by a player and which by the computer and press Start. Each player takes a turn and after all players are done you move to the next round. The game is over after 20 rounds or if only one player is left with power above zero.</p>\n<p>Each turn the player rolls the dice and then distributes them on the resources by dragging the dice. After all the dice are placed the player selects Apply to end the turn.</p>\n<p>There are 4 different resources to distribure your dice. Each resource has value, cost, power and a total.</p>\n<ul><li>Value: The total amount of the dice values assigned.</li><li>Cost: The amount required for a unit of this resource.</li><li>Power: It is multiplied by the value to calculate the amount of power gained.</li><li>Total: The amount of units gained.</li></ul>\n<p>The resources are:</p>\n<ul><li>Approval: Only used for gaining power.</li><li>Military: Each military unit gained lowers the cost of the saboteurs.</li><li>Food: Each food unit increases the power gain of approval.</li><li>Saboteurs: Lowers the power of an opponent. You must select the target player from the red box.</li></ul>\n<p>Versions for macOS and Linux are not tested</p>", "metacritic": null, "released": "2017-07-30", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/16e/16e77df3b2ddd12e8db03db6768e1a3e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 36, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Spyros Kyriazos"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}