{"id": 130613, "slug": "history-205-exam", "name": "History 205 Exam", "name_original": "History 205 Exam", "description": "<p>History Exam 205 has you time traveling through a museum to collect specific Items for the exam.  But you'll need to collect enough time crystals to keep a hold of your items.  Jumps happen every 90 seconds.</p><p><strong>Submit Art to be include in museum at </strong>https://goo.gl/forms/dgKsSJNNersOpY1C3 </p><p><strong>Made at Extra Life Game Jam</strong></p><p>To Raise Money for the UCSF Benioff Children's Hospitals.</p><p>https://www.eventbrite.com/e/playcrafting-extra-life-24-hour-game-fest-tickets-33350827222 </p><p><strong>Diversifiers used: </strong>Elephant, Science(Natural history), Colors(Cyan, Red), Set in UK (inspired by KelvinGrove Museum, Glasgow, Scotland)</p><p><strong>Developers Bios:</strong></p><p><strong>BDK (Brian David Kane):</strong></p><p>BDK is the software developer for History 205 Exam. He has previously published 3 mobile apps, please check out BDKCreate.com. His company BDKCreate published the latest game Drug Blaster! A fun way to kill some time. He accepts contract work and is available to hire.</p><p><strong>Megan Kane:</strong></p><p>Most importantly, Megan Kane is going to Mars, she is a finalist for Mars One. Secondarily, Megan is doing the art and the voice acting for History 205 exam. She has previously done the art work for HexagonApp, and the Math Quizer apps. She has Truthian, Inc which publishes children books and various art pieces. Please check out Truthian.com.</p><p>Versions</p><ul><li><strong>Demo 002: </strong>Made for the game Jam within the 48 hour limit.<ul><li><strong>Single Player Exam Mode:</strong> Choose to be a Boy or a Girl and find 3 time objects(Bronze Spheres). 90 seconds per jump need 3 items to win.</li></ul></li><li><strong>Demo 003:</strong> Made for the Game Fest Live Stream Charity Event, 5 days after the game jam.<ul><li><strong>Single Player Exam Mode:</strong> Choose to be Jack or Jill to complete ether exam.  Time object are random exhibits or furnishings. 90 seconds per jump need 3 items.</li><li><strong>Multiplayer Race Mode:</strong> Jack and Jill square off to see who can get the most points. Time crystals are worth 1 and the time object is worth 25. when the time object is seized the game ends. Local Split Screen Multiplayer.</li><li><strong>Tour Mode:</strong> Casually stroll around the museum without guards or working about time jumps or losing.</li></ul></li></ul><p>Assest Credits</p><p>Built in Unity3D.</p><p>Credits for assets, and tools used are in the below google sheet.<br/></p><p>https://docs.google.com/a/megankane.com/spreadsheets/d/19StKPCW4EDGPYd0opgqPUmhIROLyC34uRJqUdBnbKu8/edit?usp=sharing<br/></p><p><strong>Legal Info</strong></p><p>This game is a work in progress provided as a demo free of charge.</p><p>The asset acknowledgement page and final touches have yet to be incorporated. For information on any assets or if you would like to use any of the assets please contact BDKCreate LLC for a license to do so. BDKCreate does not have the authority to re-license all assets used. In such cases BDKCreate may refer you to the licensing authority.</p><p>BDKCreate, LLC</p><p>BDK@BDKCreate.com </p>", "metacritic": null, "released": "2017-05-07", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/ccd/ccda49761352e21a77377fae1693d257.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 96, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["BDK"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}