{"id": 13079, "slug": "everlasting-summer", "name": "Everlasting Summer", "name_original": "Everlasting Summer", "description": "<p>Everlasting Summer is a visual novel about a man named Semyon who is teleported from modern Russia into summer camp somewhere in Soviet Union. He is a 25-year old person who is living in an apartment and keeps in-touch with the world through his computer with which he also makes money for a living, but one day he goes somewhere via bus and accidentally falls to sleep. When he wakes up he finds himself in a Pioneer Soviet camp at summer. Now he is back to his 17-year old self. He starts to develop relations with people in the camp. The main mission is to discover what the heck happened and how to escape from this semi-reality but not less important objective is to find your true love. The game is similar to Japanese visual novel games as it uses sprites as characters and text similar to those games from Japan of the same genre. At several points player must to choose from different options in order to progress the story which will affect the ending of the game which also are several and different, ones of those are happy while others are bad, depending on what the player selected during the game. <br />\nEverlasting Summer is known of its adult-only content which was removed in the Steam version but later on (in 2015) there was an online release of the game with all the missing content from Steam version.</p>", "metacritic": null, "released": "2013-12-12", "tba": false, "updated": "2024-04-22T22:20:34", "background_image": "https://media.rawg.io/media/games/3b5/3b56220d6038b8b1ad66c4d05ef95215.jpg", "website": "http://everlastingsummer.su/", "rating": 3.97, "rating_top": 4, "added_by_status": {"yet": 119, "owned": 2801, "beaten": 853, "toplay": 33, "dropped": 150, "playing": 24}, "playtime": 5, "achievements_count": 14, "ratings_count": 888, "suggestions_count": 477, "game_series_count": 1, "reviews_count": 902, "platforms": ["Android", "iOS", "PC", "macOS", "Linux"], "developers": ["Soviet Games"], "genres": ["Indie"], "publishers": ["Soviet Games"], "esrb_rating": null}