{"id": 130878, "slug": "flake-news", "name": "F(l)ake News", "name_original": "F(l)ake News", "description": "<p>Welcome to Flake News!</p><p>This is a tower defense game about extremists and media. A bunch of extremists are about to rush a peaceful demonstration in the city center. As the godfather of media, it's your job to convince them to not be as extreme anymore by strategically placing media guys on their way. The game was built during the Resist Jam 2017.</p><p><strong>How to play: </strong>Left extremists are coming to town from the bottom left, right extremists - you guessed it - from the bottom right. Place your first towers by clicking the building grounds and choose the tower to build. Then, click \"I'm ready\".</p><p><strong>Tips:</strong><br/></p><ul><li>For each convinced protester you'll get a small reward to reinvest into your tower setup</li><li>If a protester gets to the demonstration (top exit of the map), you'll lose one life (top right corner)</li><li>Click a tower to upgrade. There are towers that are more effective against a particular group</li><li>Hover a tower with your mouse in order to see its action radius</li><li>Click and hold right mouse button to scroll</li><li>Hover the little figures on the left side of the screen in order to get to know their properties</li></ul><p><strong>Hint:</strong><br/></p><ul><li>This game is still in development. There are no sound effects yadi yadi yada*.</li></ul><p>*other things are odd as well. But you'll see that. Just ignore it, we're on it!</p>", "metacritic": null, "released": "2017-03-09", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/5ac/5ac34635a2e1fc881255d500bdcea405.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 39, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["LeFayGames", "tbureck", "Kattywampus", "MollocH"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}