{"id": 130903, "slug": "shadowrun-kromn", "name": "Shadowrun Kromn", "name_original": "Shadowrun Kromn", "description": "<p>ShadowRun – Kromn is a super smash adventure and legendary 2D side scrolling platformer. In this one of a kind Action platformer, you play as Superhero “Kromn” ( Chibi Version ), a Indian legendary shadow who fights his way through the corrupted world to save his Mumbai City from the hand of the local Thugs, Terrorists and Mumbai Mafia’s. With superior acrobatic and deadly weapon, kromn is ready to face menacing traps and enemies. ShadowRun – Kromn features unique yet addicting gameplay, giving you thrilling moments and an unexpected experience. You also play as a Cute little Crow ( Raiba ) with flying mechanics and easy controls. You can unlock exciting New Costumes using Kro-Mudras collected from saving people and from beautiful Mumbai’s surroundings. HD Graphics, Intense Action, Multiple gameplays from chasing, motorbikes, jeep, helicopters, to saving pets, kittens and protecting civilians in distress. Maneuver through traps, defeat enemies who try to stop you and save your city.<br/><br/>FEATURES:<br/><br/>▶ Run, Chase, Fly, Protect, Throw, Push,<br/>Break and loads of action. <br/>▶ Ability to double jump<br/>▶ 3 different story based missions with<br/>multiple game play &amp; levels &amp; to play<br/>▶ Easy and intuitive controls<br/>▶ Discover the beauty of high quality<br/>graphics and lively environment<br/>▶ Purchase or Unlock new exciting costumes<br/>▶ Challenge yourself with tough battles<br/>▶ Become a master shadow and Protect your city!<br/>▶ Suitable for all ages<br/><br/>What are you waiting for!<br/>Dive into the Action Now !<br/>Unleash The Hero Within You !<br/><br/>Get \"Kromn Shadowrun\" for free today !<br/><br/>Remember that we're always reading your feedback and try to create new characters, features, levels, and also fixing any issues you may find. Contact us on <br/>' yogeshron@gmail.com ' if you need any help!<br/><br/>-Thankyou.</p>", "metacritic": null, "released": "2017-10-16", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/111/111de54f9a50c49c11854f76935b5190.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 253, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["yogeshron"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}