{"id": 131032, "slug": "octavia-five", "name": "Octavia Five", "name_original": "Octavia Five", "description": "<p>What brought you here?<br/></p><p>Who are you?</p><p>Search this strange crystal memoryscape and discover what brought you to this world. Uncover memories buried deep down and find the secret of Octavia 5</p><p>The creation of Octavia 5 changed a lot throughout the creation of the project. My original idea for Octavia 5 was for it to be a strange planet with five separate layers. Each layer would be a different landscape with the final one being an alien civilisation. But with the time constraints of this project and my ability to use unity this was far too ambitious. My plan shifted a lot from there going from creating a world following the five stages of grief until finally landing on some sort of memory scape. I knew i wanted to use the crystal landscape i created so from there it was just finding something to fit it. I w was after reading a very interesting article about memory palaces and using them to fight depression that my idea became clear. I wanted to create a story about a person finding themselves in such a memory scape and discovering what brought them there. As I was creating the game it became very personal to me as I drew from my experiences of memory palaces and depression to create the game.</p><p>The reason I chose to make a game using a given place name was the fact that In previous projects i found that the topics were very constraining. With the place name I was able to create an entire world and fill it with whatever i wanted too. It is these kind of projects that excite me the most. My favourite projects before this one would have been the area creation and also the fungus story creation. I love creating worlds and stories and with this final project I hoped that I made both a compelling and interesting game that was interesting and immersive. </p><p>http://i.dailymail.co.uk/i/pix/2016/01/01/11/2FB702AC00000578-3381098-image-a-3_1451648731163.jpg</p><p>https://encrypted-tbn3.gstatic.com/images?q=tbn:ANd9GcSPTcCkKITXIONPZOYnPyUI5smJ6JPot84VF5FMmOMJNZiiozWm</p><p>\n<br/>These two images inspired me the most to create the landscape. The ice gives off a distorted reflection that I felt added to the world and story which I was trying to portray. It is a world created by someone's own<br/></p><p>\"This game hit me right in the feels\" Liam Coneely</p><p>\"A breath taking landscape and A truly touching story\" Evin Nelson</p>", "metacritic": null, "released": "2016-05-08", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/967/967a7ef27b1292277fdbbc252762f2c1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 30, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["NathanGn"], "genres": [], "publishers": [], "esrb_rating": null}