{"id": 13112, "slug": "jenny-leclue-detectivu", "name": "Jenny LeClue - Detectivu", "name_original": "Jenny LeClue - Detectivu", "description": "<p>Jenny LeClue is a handcrafted adventure with memorable characters, a unique aesthetic, and an epic tangled mystery. It’s also a coming-of-age story about the blurred lines between right and wrong.<br />\nThis is a game about your choices and how they affect Jenny and the author’s story. It’s a rich metanarrative with delightful surprises and interactions. Jenny LeClue also explores mature themes, complex characters, and an epic tangled mystery.<br />\nYou play as Jenny, a brilliant young detective, living in the idyllic college town of Arthurton. Jenny is a sharp-eyed, relentless pursuer of the truth. But nothing exciting happens in Arthurton, and Jenny longs for real adventure.<br />\nJenny gets more than she bargains for when her mother is accused of murder, and begins an unexpected journey to find the truth.<br />\nShe soon discovers every cloud has a dark lining, and nothing in Arthurton is what it seems. Unseen forces will stop at nothing to keep Jenny from the truth. And she will have to use all her skills of deduction to find the real killer.FeaturesBeautiful handmade Art StyleSleek and gorgeous hand drawn style with vintage midcentury aesthetics.A Living WorldThe goal is for everything to be interactive, to reward players who poke and prod at every last item and object with insight, secrets, and humor.Choosiness On A Massive ScalePlayers will make choices in their individual game, and some of those choices will be tallied to permanently influence subsequent chapters, essentially &quot;writing&quot; the story collaboratively. The choice players make about the cliffhanger ending of episode one determines the beginning of episode two.Female ProtagonistJenny is a brilliant young detective, sharp eyed, intuitive and a ruthless pursuer of the truth.Dialogue With A TwistJenny is able to move the camera around during dialogue scenes and observe the subject for visible clues that might reveal their guilt or innocence that would otherwise go undetected.Story Within A storyJenny LeClue weaves a rich metanarrative. The &quot;author&quot; of Jenny&#39;s adventures, Arthur K Finklestein, acts as narrator and guide, but his presence also allows you to change the way Jenny&#39;s story is written. Players choices will also affect Finklestein’s own story.Not Just For KidsComplex relationships will be explored with themes of family, loss, and identity influenced by horror, sci-fi, and mystery genres.A Diverse Cast Of Characters &amp; LocationsExplore Arthurton’s expansive world including the abandoned mines, the forgotten graveyard, the misty mountains, the old observatory, the police station, the shops and eateries on Main Street, and Gumboldt University&#39;s Library. You will meet many intriguing and suspicious characters, in a town whose population is representative of the US Census demographics.</p>", "metacritic": null, "released": "2019-09-19", "tba": false, "updated": "2023-11-19T23:41:36", "background_image": "https://media.rawg.io/media/screenshots/6fa/6fafff4b9b2843c7b038df1a82b0cdce.jpg", "website": "http://www.jennyleclue.com", "rating": 3.91, "rating_top": 4, "added_by_status": {"yet": 23, "owned": 135, "beaten": 27, "toplay": 29, "dropped": 8, "playing": 4}, "playtime": 3, "achievements_count": 0, "ratings_count": 35, "suggestions_count": 228, "game_series_count": 0, "reviews_count": 35, "platforms": ["iOS", "macOS", "Linux", "PC"], "developers": ["Mografi"], "genres": ["Action", "Adventure", "Casual", "Indie"], "publishers": ["Mografi"], "esrb_rating": null}