{"id": 13130, "slug": "vintage-vr", "name": "Vintage VR", "name_original": "Vintage VR", "description": "In the 19th century, when people had no HTC Vives to play with, they resorted to using primitive stereoscopes to see stereoscopic images in 3D!  This free VR experience allows you to view a collection of over 700 such images from that era and enjoy them as people saw them over a century ago, using your VR headset.  Stand atop the pyramids, view the battlefields of France in WWI, go alligator hunting, and see the world as people once did from the comfort of their Victorian homes!<br/><br/>The VR experience is set in a single room, decorated to look like one you might find in the Victorian era.  But the focus of the game is not the room, it is the old photographs, which have been carefully selected for the best 3D effect.  Use the trigger of your Vive controllers to move between images, giving your eyes time to adjust and focus between each image.  These photos are from the late 19th and early 20th century, when stereographic capture was rather crude and done with bulky cameras, so viewing these images will probably not be as comfortable for your eyes as modern stereo images typically are.<br/><br/>This game is being made available free to help promote VR adoption as well as to allow people to learn more about this remarkable art form that led to the development of the virtual reality headsets we enjoy today.<br/><br/>", "metacritic": null, "released": "2016-05-02", "tba": false, "updated": "2019-09-17T13:18:38", "background_image": "https://media.rawg.io/media/screenshots/358/358463cbe6c2b7f11aca0924966f2e9c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 175, "beaten": 3, "dropped": 1}, "playtime": 1, "achievements_count": 7, "ratings_count": 2, "suggestions_count": 194, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Dunderware"], "genres": ["Casual"], "publishers": ["MuseumSyndicate.com"], "esrb_rating": null}