{"id": 131452, "slug": "206-seconds", "name": "206 Seconds", "name_original": "206 Seconds", "description": "<p>Hold out against an absurd onslaught of thousands of palette shifting enemies, and survive for as long as you can. The landscape makes no pretense of realism, and the enemies are infinite.</p><p><strong>Controls</strong></p><ul><li>Movement: WASD/Arrow Keys</li><li>Shooting: Left Click</li><li>Sprinting: Shift</li><li>Exit: Esc</li><li>Restart: R</li></ul><p><strong>Tips</strong></p><ol><li>You won't heal while sprinting, be sure to give yourself a chance to slow down and recover.</li><li>Stay at the front, you need your friends, and your friends need you.</li><li>Stay cool, the battle is long, and you only have to die once.</li></ol><p><strong>Background</strong></p><p>Everything was made by Walter Verburg in the excellent Gamemaker: Studio, with the exception of the music, \"Ouroboros\", which is public domain and available here. I reserve all rights on my part of the game, save those required for hosting on itch.io.</p><p>Every six months or so, I make a little experimental game around the general concept of a large scale battle with one side composed of as many swarmers as I can get on screen without crashing my computer. This is the most recent one.The biggest lesson from this iteration is that more polish effects are not better. Halfway through development it became clear that this game did not need or benefit from any sort of screenshake art. A lot of the time went into balancing all of the numbers so that the behavior would work out the way I had intended, and give the player the desired experiences and choices. The end result ended up working far better than I had anticipated, and allowed me to slip subtle stories and ideas into the gameplay.</p>", "metacritic": null, "released": "2015-02-04", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/bed/bed9f478abc5a59a7800a40383a69705.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 55, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Mister Walter"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}