{"id": 13142, "slug": "radical-heroes-crimson-city-crisis", "name": "Radical Heroes: Crimson City Crisis", "name_original": "Radical Heroes: Crimson City Crisis", "description": "<strong>Radical Heroes</strong> brings a fresh take on the tried and true beat ’em up formula. Imagine a full blend of everything that was fun about the 1980's and 1990's (The video games, action figures, cartoons, arcades, etc.) Then, jam pack all of this awesomeness in to one experience bursting at the seams with retro goodness!<br/><br/>The story of Radical Heroes: Crimson City Crisis begins with Diesel, an average dude who wakes up to find the city he loves under attack by a mysterious evil force. Determined to defend everything he holds dear, Diesel must face his destiny, overcome the darkest of foes, and embark on a Radical quest to stop the evil from fully engulfing Crimson City before it’s too late!<br/><br/>* QUESTIFIED! Explore a vast, brand new universe filled to the brim with nostalgic flavor! Play it your way, or play it with your friends for ultimate chaos.<br/><br/>* PEW PEW! Tons of Weapons! Set out on an epic quest to save your city from evil using everything you can find as a tool of punishment! There's over 40 to unlock!<br/><br/>* LEGENDARY! Six massive playsets to unlock and explore!<br/><br/>* TUBULAR! Exotic locations like Tropical Islands, Spooky Graveyards, a City under Invasion, plus so much more!<br/><br/>* EPIC! Tons of secrets and unlockables!<br/><br/>* COWABUNGA! Over 40 action figures to collect and unlock! Plus, each playable figure comes complete with their own unique weapon!<br/><br/>* SKILL-TASTIC! Upgrade your figure's Speed, Strength and Defense to combat the ever growing threat of evil! <br/><br/>* POWERFUL-NESS! Special power moves add a layer of sweet chaos only dreamed about in other beat 'em ups!", "metacritic": null, "released": "2016-10-04", "tba": false, "updated": "2019-08-28T22:12:52", "background_image": "https://media.rawg.io/media/screenshots/d9d/d9d36850c70226dfa2cb9ad65bf6c170.jpg", "website": "http://madunicorngames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 37, "toplay": 1}, "playtime": 1, "achievements_count": 12, "ratings_count": 0, "suggestions_count": 443, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Mad Unicorn Games"], "genres": ["Action", "Adventure", "Casual", "Indie"], "publishers": ["Apogee Software"], "esrb_rating": null}