{"id": 13145, "slug": "slap-village-reality-slap", "name": "Slap Village: Reality Slap", "name_original": "Slap Village: Reality Slap", "description": "Slap Village is a point and click adventure game inspired by the classics of this genre merging the topics of the Wild West with nowadays concepts. The story, which is starred by the young town girl Lurditas, is set in an anachronistic universe with scenarios and characters typically from that historical period, yet blended with technologies and characteristics of the modern life.<br/><br/><br/><br/><strong>Resolve mysteries</strong><br/><br/>Contact with aliens, revelation of conspiracies, or shamanic practices are just some of the mysteries with which Lurditas will be confronted during her long journey. Discover all the hidden secrets in this paranormal Western. <br/><br/><strong>Uncover this Wild and Modern West</strong><br/><br/>A young girl by herself against the Wild West that challenges her bravery and her skills. A world filled with eccentric characters and completely different settings such as a Native American town of film-makers, a steam locomotive with WIFI or a karaoke Saloon. These summer holidays have turned into a defiance that will determine the evolution of humanity.<br/><strong>Main characteristics</strong><br/><br/><ul><li> Graphic adventure game packed with humour and features that resemble to the classics of this genre. <br/></li><li> Carefully and entirely handmade Cartoon art style, with eccentric characters and vivid colours.<br/></li><li> Exploration, multitude of dialogues and demanding jigsaw puzzles.<br/></li><li> A unique world and completely original.<br/></li><li> Entertaining minigames that will be unblocked as the adventure goes on.</li></ul><br/>", "metacritic": null, "released": "2016-07-21", "tba": false, "updated": "2023-06-06T16:16:10", "background_image": "https://media.rawg.io/media/screenshots/873/873c285157a0f9d0baa98560bca77a86.jpg", "website": "http://www.monkeytoons.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 25, "beaten": 2}, "playtime": 2, "achievements_count": 24, "ratings_count": 4, "suggestions_count": 309, "game_series_count": 0, "reviews_count": 4, "platforms": ["macOS", "PC"], "developers": ["MonkeyToons"], "genres": ["Adventure", "Indie"], "publishers": ["MonkeyToons"], "esrb_rating": null}