{"id": 131657, "slug": "a-maze-in-game", "name": "A Maze in Game", "name_original": "A Maze in Game", "description": "<p> Se existisse um mundo no qual magia fosse algo factível, as tarefas mais complexas se tornariam mundanas. A vida perderia seu encanto. As pessoas deixariam de explorar seus sonhos. Bem, na realidade, esse mundo existe. E para evitar um surto de depressão, foi criado o Torneio Mágico! No qual qualquer um habilidoso e corajoso (ou estúpido) o suficiente pode disputar por fama, riqueza e diversão. E você, pelo que competirá? </p><p> O jogador utiliza setas do teclado para escolher para qual casa irá se movimentar. É possível utilizar o scroll do mouse para rotacionar as casas adjacentes à qual ele está e formar novos caminhos. Haverá casas especiais com símbolos referentes aos efeitos delas: pode ser uma mola, a qual fará o jogador que parar em cima dela pular para uma das cartas ao redor dele, uma que faz o jogador perder um turno, etc. Após um jogador se mover ou rotacionar  será o turno do próximo. Se passados 20 segundos e um jogador não fizer uma ação, passa para o próximo. É possível um jogador \"morrer\" e ele será retornado ao seu ponto de saída.</p><p>[2015] Trabalho de conclusão do curso Superior de Tecnologia em Jogos Digitais da PUC-SP intitulado \"A Maze in Game\". Visite o site.</p><p><strong>Desenvolvedores:</strong></p><ul><li><strong>Bruno Ribeiro de Mello | contato</strong></li><li><strong>Mayara Gomes </strong><strong> | contato</strong></li><li><strong>Pedro Orlando Fernandes Júnior</strong><strong> | contato</strong></li><li><strong>Tales Mariano </strong><strong>| <strong>contato</strong></strong></li></ul>", "metacritic": null, "released": "2015-11-29", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/2c5/2c547901185eac3bb6f5fac929a335b7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 128, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Jogos Digitais PUC-SP"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}