{"id": 131604, "slug": "clairvoyant", "name": "Clairvoyant", "name_original": "Clairvoyant", "description": "<p>Clairvoyant is a stealth game in which the player is a blind thief named Clair, who uses echolocation to traverse locales in order to reach her goal and steal prized items. She is able to detect objects in the vicinity, similar to the methods of Daniel Kish, a blind hiker and an expert in human echolocation. </p><p>Due to Clair's impairment, she is forced to overcome obstacles using her other senses. Clair's perception of the world is visualized in two ways: under normal conditions, when Clair is not using echolocation, the on-screen visuals are limited and the environment is mostly grayscale; when Clair uses echolocation, the on-screen visuals are expanded, and the environment becomes vibrant. The vibrance of the environment is a visual metaphor for how much information Clair has.</p><p>The music is a reflection of the locales that Clair is currently in. Given Clair's line of work, the music is tense and suspenseful. However, the sound effects are always placed first. Sound effects are given priority due to them being navigation cues for Clair. </p><p>Clair's goal is to travel the world and experience new things while increasing her infamy and also proving herself as an accomplished thief. She chose the path as a thief because she felt that it was the only way to obtain the freedom that she never had as a child and to live by her own rules. As her infamy increases, people learn of her exploits through increasingly widespread news outlets, which represents her overcoming her obstacles. </p>", "metacritic": null, "released": "2016-02-10", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/347/34755c04400314746df384aeb944d415.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 27, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["NyokaxX"], "genres": [], "publishers": [], "esrb_rating": null}