{"id": 13162, "slug": "putt-putt-saves-the-zoo", "name": "Putt-Putt Saves the Zoo", "name_original": "Putt-Putt Saves the Zoo", "description": "<p>Humongous Tees Now Available!Official Humongous Entertainment T-shirts featuring Pajama Sam, Spy Fox, Freddi Fish, and Putt-Putt are now available on Amazon.</p>\n<p>About the GameThings have gone wild at the Cartown Zoo!<br />\nToday&#39;s the grand opening of the Cartown Zoo, and there&#39;s still so much to do: zoo chow is running low, and all the baby animals are missing. Putt-Putt® and Pep need your child&#39;s help to reunite the little ones with their parents before Outback Al can open the gates. Along the way, they&#39;ll swing across alligator-infested rivers, play ice hockey with a polar bear, build a bridge out of icebergs, bop with dancing penguins, and enjoy other adventures. This zoo is full of loyal friends and captivating challenges that are sure to run wild through your child&#39;s imagination.<br />\nTake breaks from the action to play games, sing songs, paint Putt-Putt® or learn about the animals you find in the zoo.<br />\nClick Points reveal hundreds and hundreds of hidden surprises.<br />\nUse Putt-Putt&#39;s® special camera to take picture of your favorite zoo animals and print them out.<br />\nOut of time? You can save the game and finish it later.<br />\nThis product uses ScummVM across Windows, Mac and Linux which is released under the GNU GPL v2.<br />\nFor more information, please visit - http://www.scummvm.org<br />\nThe GNU GPL can be viewed here - https://www.gnu.org/licenses/gpl-2.0.html</p>", "metacritic": null, "released": "1995-03-30", "tba": false, "updated": "2024-01-15T09:38:18", "background_image": "https://media.rawg.io/media/screenshots/1a1/1a15084d6e6be398d2239a46826d0ca7.jpg", "website": "http://www.humongous.com", "rating": 4.16, "rating_top": 4, "added_by_status": {"yet": 7, "owned": 152, "beaten": 26, "toplay": 2, "dropped": 2}, "playtime": 3, "achievements_count": 0, "ratings_count": 17, "suggestions_count": 191, "game_series_count": 0, "reviews_count": 19, "platforms": ["iOS", "PC", "macOS", "Linux", "Android"], "developers": ["Humongous Entertainment"], "genres": ["Adventure", "Casual", "Educational"], "publishers": ["Nightdive Studios", "Humongous Entertainment", "Tommo"], "esrb_rating": null}