{"id": 131662, "slug": "velocity-stream-practice-mode-demo", "name": "Velocity Stream [Practice Mode Demo]", "name_original": "Velocity Stream [Practice Mode Demo]", "description": "<p>\n<strong>Velocity Stream</strong> is a new take on the racing genre, where one player takes control over a Paver, a spacecraft that flies through the game world, leaving a trail of energy in its wake. It's on this trail that the other players race eachother with the goal of being the first to catch up with the Paver.\r\n</p><p>\r\n\tThis \r\n\t<strong><em>practice mode</em></strong><em><strong> demo </strong></em>allows players to compete against an AI controlled Paver and experience the unique core mechanic.\r\n</p><p>\nThe demo features a <strong>config file</strong>, allowing downloaders to adapt vehicle handling to their own preferences. We encourage players to\r\n</p><p>\r\n\tVelocity Stream is currently active on Steam Greenlight. We would very much appreciate if you could support us through your votes.\r\n</p><p>\n<br/>\n</p><p>\r\n\tSoftpedia says:\r\n</p><p>\n<em>\"Velocity Stream not only brings forth a new kind of random that benefits everyone, but it also looks really good even in it's early stages of life.</em>\"\r\n</p><p>\r\n\tHooked Gamers says:\r\n</p><p><em>\"Staple of gaming parties to come\"</em></p><p>\n<br/>\n</p><p>\n<em><strong>This is not a final product</strong>. Velocity Stream is still in its early stages of development. This early alpha demo is intended to give a general impression of the game's intent but should not be considered at all representative of the final product. Modes, music, graphics, gameplay, and all other facets of this product are subject to change.</em>\n</p>", "metacritic": null, "released": "2015-01-22", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/116/116ceee49b296d0e825ebcc690fa44fe.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 101, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Cavelight Entertainment"], "genres": ["Action", "Racing"], "publishers": [], "esrb_rating": null}