{"id": 131747, "slug": "milano-social-housing", "name": "milano social housing", "name_original": "milano social housing", "description": "<p><strong>Online Demo Version </strong></p><p><strong>System Requirements:</strong></p><p><strong>Browser: </strong>Firefox, Safari (currently not working on Chrome)</p><p><strong>Memory (RAM): </strong>at least 1GB of ram</p><p><strong>Use with keyboard keys (W,A,S,D) and mouse (for looking)</strong></p><p>WASD (W: move forward, A: move left, S: move backwards, D: move right)</p><p><strong>architectural visualisation and naked structure - </strong><strong>for a social housing project developed at the Politecnico di Milano.</strong></p><p><strong>with Maghenzani Paola Elena, Safaryan Ani and <strong>Messios Marios</strong></strong></p><p>The proposal envisions total demolition of the existing buildings of one of the sectors not because they do not have any significant architectural value, identity or spatial quality but for this form of energy and structural study it is suffice to do so.</p><p>On the thus vacant site we propose a complex of buildings with a configuration, which reminds somehow the previous urban texture of the area, but at the same time allows to improve the traffic problem on the adjacent crossroad, opens passages and views to the park, and increases density of the dwellings.</p><p>The provided dwellings differ in size, type and configuration, thus stimulating the diversity among the inhabitants (students sharing apartments, persons living alone, small and big families, artists living in their workplace, etc.).</p><p>On the east side of the design is the result of <strong>two twin buildings</strong>, twisting in front of each other, thus creating a communal courtyard of an interesting shape, adapted for undisturbed coexistence of various activities. For the programmatic distribution the gallery-system is chosen (as a reference to the previously existing typology on site, but also due to the economical and functional advantages of the gallery distribution).</p><p>The ground floor of the buildings is used for various shops and services. the rest of the building is solidly residential. the height of the building varies from five to four storeys, the roof is foreseen to be livable (duplex apartments and mansards).</p><p>The west side is composed of two linear elements.<br/>The primary one is designed as a <strong>series of workshops &amp; laboratories</strong> (a function that already existed on that same place) with an attic level and compact facilities block for living.<br/>The second element consists of a platform with stores and services, and a <strong>residential tower</strong> of four floors with a habitable roof.</p><p>For both blocks an underground parking on one level is foreseen.</p><p>Photovoltaic panels are placed on the sloped roofs of both the blocks, oriented to south &amp; southwest, in order to provide the energy needed, to classify the buildings to the label a/b.</p><p>The structure is made out of steel, with concrete cores and shear walls. for the facades, metal panelling combined with steel framed windows.<br/></p><p>THe steel chosen is IPE 300 for primary beams and HEA 200 for secondary beams. Reinforced concrete for the cores and the blind shear walls. Calculations shown in the document on my website.</p><p>for the full project go to:</p><p><strong>http://messiosmarios.com/hybrid-revitalization.htm...</strong><br/></p><p>m. a. arch marios messios<br/></p>", "metacritic": null, "released": "2017-01-19", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/6f7/6f76d547bd4ea6a23a722c09c5f7c2ee.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 6, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "PC", "macOS"], "developers": ["messiosmarios"], "genres": [], "publishers": [], "esrb_rating": null}