{"id": 13178, "slug": "life-in-bunker", "name": "Life in Bunker", "name_original": "Life in Bunker", "description": "<strong>Life in Bunker</strong> is a sandbox bunker-building simulator. <br/><br/>You've been elected as the new Bunker Warden! Now you must take control over a group of fellow bunker residents and try to make them last until the surface becomes habitable. The task however is not trivial. The underground life is difficult, full of danger and the residents will heavily rely on your wise, sometimes not so wise, decisions. One wrong step can put the entire Bunker on the brink of extinction.<br/><br/>So, manage wisely, spend you resources carefully and your bunker will prosper.<br/><br/> <br/><br/><ul><li><strong>Procedural world</strong> - every new game, it will be a new world.<br/></li><li><strong>4 levels</strong> - the underground world consists of 4 levels, so the bunker can grow not only wide but deep as well.<br/></li><li><strong>Residents management</strong> - there are six occupations the residents can take. But every resident is unique and can be assigned only to certain tasks.<br/></li><li><strong>Events system</strong> - diseases, infections, sudden outages and breaks will always mangle your plans.<br/></li><li><strong>Research and upgrades</strong> - open new structures and upgrade the old ones.<br/></li><li><strong>Ageing</strong> - the residents grow old, it's a natural course of life. You'll need a constant flow of young residents to replace the retired. <br/></li><li><strong>Resources management</strong> - water, power, clean air, ore, building material, garbage and several types of food each of them plays important role in the bunker and    you'll need to manage them carefully.</li></ul>", "metacritic": null, "released": "2016-02-25", "tba": false, "updated": "2019-08-28T22:12:51", "background_image": "https://media.rawg.io/media/screenshots/522/5225d2b726733329fb689a8228445aad.jpg", "website": "http://lifeinbunker.com", "rating": 2.33, "rating_top": 1, "added_by_status": {"owned": 27, "beaten": 1, "toplay": 2, "dropped": 3}, "playtime": 2, "achievements_count": 20, "ratings_count": 5, "suggestions_count": 420, "game_series_count": 0, "reviews_count": 6, "platforms": ["PC", "macOS", "Linux"], "developers": ["Flox Studios"], "genres": ["Strategy", "Simulation", "Indie"], "publishers": ["Flox Studios"], "esrb_rating": null}