{"id": 131981, "slug": "zurich-memory-database", "name": "Zürich Memory Database", "name_original": "Zürich Memory Database", "description": "<p>The <strong>Zurich Memory Database</strong> is an unofficial<em> choose-your-own-adventure</em>style fangame based off of the hit MOBA game <em>Overwatch</em>, which is developed by, and belongs to Blizzard Entertainment. The game follows closely to the story’s lore, but branches off into original territory to explore facets of characters that haven't been officially elaborated upon in the canon story.<br/></p>\n<p><em>This fan-game, while utilizing assets from the official game for the sake of visual storytelling, is entirely unaffiliated with Blizzard Entertainment and in no way claims to represent the official story of Overwatch as told by Blizzard.</em></p>\n<p>The main game is played out in <strong><em>Mission </em></strong>mode, is a chronological story mode that takes place after the “Recall” animated short, following field medic Angela “Mercy” Ziegler as she answers the Overwatch recall sent out by Winston. The new Overwatch is different from what it was years ago, and she has her reservations about it. Some familiar faces from the old Overwatch make their way back, and some new help from around the globe is recruited as they go.</p>\n<p>This new group must work discreetly in order to avoid the consequences of acting against the PETRAS Act, enstated to ban all Overwatch activity, while still negotiating global affairs in order to prevent and control a second Omnic crisis. Along the way, alliances are formed, interpersonal relationships develop, past memories are revisited, and you, the player, have a say in how this world’s history will play out.</p>\n<p><strong>The version of the game available for download now is currently a very early demo, with extremely limited features. You can play through excerpts of plotlines that will be strung together and lengthened in the final release, and see a few previews of other features and content that will also be available in the final.</strong></p>\n<p><strong>As an early demo, it is not to be considered representative of the final product, and everything is subject to change!</strong></p>\n<p>Any and all feedback is greatly appreciated, and more information about the game can be found on my personal website, Kyzorai.com.</p>\n<p><strong>Credits</strong></p>\n<p>Kevin MacLeod (incompetech.com)<br/>Licensed under Creative Commons: By Attribution 3.0<br/>http://creativecommons.org/licenses/by/3.0/</p>", "metacritic": null, "released": "2018-04-12", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/789/7894d664df704097b17d9b63fdc99deb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 293, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Kyzorai"], "genres": [], "publishers": [], "esrb_rating": null}