{"id": 132095, "slug": "verge-of-heroes-v10", "name": "Verge of Heroes v1.0", "name_original": "Verge of Heroes v1.0", "description": "<p>After months of development, the first edition of Verge of Heroes is now officially released!</p><p><strong>History:</strong></p><p>Verge of Heroes started off with a humble alpha game two years ago, called Rage. This game was a humble one, with simple moves and mechanics. It also featured music produced by Harrison Hall. It had original sprites created by George Antash and maps created by a collaboration between Harrison and George. Jacky Wong (LavaScribe) put together these resources and did a bulk of the programing for the game.</p><p>After Horry County Schools's 2014 Technology Fair, Harrison left the project and George and Jacky created Verge of Heroes. The duo implemented the skills they learned while creating Rage and created a refined fighting game. After a year of work, the two entered Verge of Heroes in the 2015 Horry County Schools Technology Fair and won second place in their respective category.</p><p>After a short hiatus from updating the game, George and Jacky decided to completely rebuild their fighting game from the ground up. The two decided that their new version should be the best one yet, and created a gameplan. This consisted of completely overhauled graphics, more complex moves, additional characters, and better-performing game.</p><p>After a few months of working on the game, the two picked up artist Jackie Doan in order to help design the updated user interface, design a custom font, and create a special stage. One of the first major decisions the three made was to differentiate 2015's Verge of Heroes from 2016's; they decided to reach out to the internet and real-life friends in order to have voice lines for each character. By mid-April 2016, the trio entered their new game into the 2016 Horry County Schools Technology Fair. They won second place, yet again.</p><p><strong>New Features (found in Version 1.0):</strong></p><ul><li>Five original characters, each with two moves</li><li>Three unique stages</li><li>Voice lines</li><li>PS3/Xbox 360 controller support</li></ul><p><strong>Characters:</strong></p><ul><li>Jaw Dropper - A Psycopath Out for Blood, voiced by zajakin</li><li>Disco - The God of Funk, voiced by Michael Burgess</li><li>Sharky - King of Crappy Shark Movies, voiced by RagingPorkers</li><li>Hocus - An Arrogant Magician, voiced by Mysticpoisen</li><li>Minister Sinister - A Reborn Anti-Hero Priest, voiced by Connaugh</li></ul>", "metacritic": null, "released": "2016-04-16", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/e22/e22062f166467142d8a5c9a8c35a4dda.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 54, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["LavaScribe"], "genres": ["Action", "Fighting"], "publishers": [], "esrb_rating": null}