{"id": 13200, "slug": "northern-regime", "name": "Northern Regime", "name_original": "Northern Regime", "description": "<strong>Please Note: that not every piece of interface text has been translated. Around 85 percent has been translated.</strong><br/><strong> Please Note: that Northern Regime is in Early Access, it will include bugs, errors, and a lack of content compared to the full version.<br/><br/><br/> WE ASK THAT THE REASON YOU BUY NORTHERN REGIME IS TO SUPPORT THE DEVELOPMENT PROCESS AND NOT TO PLAY A WELL ROUNDED GAME</strong><br/><br/><br/>Northern Regime: 1862 is a hardcore survival game set against the backdrop of the American Civil War, in the frozen and frigid landscape of Northern Dakota. It’s you against the environment and all its inherent dangers as you tackle Confederate soldiers, aggressive wildlife and cold itself to keep yourself alive. HARDCORE SANDBOX SURVIVAL <br/>Hunger in Northern Regime is an important aspect in the wild. You can find food and water in enemy camps which is sometimes a rarity, as well, it is very risky. The most common way to maintain an appropriate hunger level is by hunting with your trusty rifle. Killing deer will give you in between 1-3 pieces of meat. The difficult part is not exerting too much energy. The more energy you waste by running and firing your rifle will cause increased hunger. If you fail to kill a buck you've been hunting for could cause death. Hunting and hunger will require a unique strategy for your survival. REAL-WORLD ENVIRONMENT<br/>Using real-world geographical data, we have developed a living, breathing representation of the Fargo region of North Dakota for you to explore. Be careful not to get sucked in by the environment’s beauty, though, as danger lurks around every corner. CONSTANT DANGER! <br/>In addition to sustaining yourself with food and water, you’ll have to keep your wits about you to fend off the attention of bears, Confederate soldiers and later on in development, many more potential aggressors. You’ll need to craft weapons and ammunition to repel these threats where necessary!<br/><br/><strong> Trading and Coercing is Planned but not officially in Nothern Regime</strong> CRAFT, TRADE &amp; COERCE <br/>Northern Dakota is filled with NPCs who will react to you in a specific way based on your reputation. You’ll need to increase your standings with individual factions through crafting and trading with them in order to bring them round to your way of thinking! With travelers, traders and refugees wandering the environment and numerous settlements to find, you’ll have ample opportunities to make friends…or enemies.", "metacritic": null, "released": "2017-02-17", "tba": false, "updated": "2019-08-28T22:12:50", "background_image": "https://media.rawg.io/media/screenshots/fc6/fc6123a0b6d643027f84ee32dd248bc4.jpg", "website": "http://www.northernregime.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 25}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 223, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Axel Anderson"], "genres": ["Action", "Adventure", "Strategy", "Simulation", "Casual", "Indie"], "publishers": ["Axel Anderson"], "esrb_rating": null}