{"id": 132019, "slug": "conte-ifure", "name": "Conte-Ifure", "name_original": "Conte-Ifure", "description": "<p>Jeu d'aventure pour la GameJam Pot-au-jeu sur 60h\r\n</p>\n<p>\r\nDéplacez les personnages avec les touches flêches du clavier</p>\n<p>CTRL+J : Configurer / jouer a la manette</p>\n<p>ALT + ENTREE : Mettre le jeu en plein écran</p>\n<p>------------------------------------------------------</p>\n<p>Samedi j'ai vraiment dégrossie le principale \" : </p>\n<p>-Sprites des personnages principaux</p>\n<p>-Décores \" d'abord les décores les plus importans : le sol, l'eau, les murs.</p>\n<p>J'ai ensuite par petites touche rajouté de la déco pour essayer de rendre ça moins vide et plus sympa : quelques lampes, des lucioles animés, des papillons avec un trajet pré-determiné .</p>\n<p>J'ai vraiment essayé de construire le jeu en pensant a ce qui serait indispensable et j'ai uniquement rajouté le superflu / esthétique  dès que je sentais que le temps me le permettait.\r\n</p>\n<p>Vers Dimanche  : J'ai commencé quelques musiques, je me suis permis de faire quelques dessins papiers pour illustrer certains cinématiques ce qui ma permis de me reposer tout en continuant sur papier a rester concentré sur le projet.</p>\n<p>J'ai fait pas mal de pauses / quelques séances assez tendues ou j'ai vraiment essayé de stopper pour ne pas trop fatiguer inutilement.</p>\n<p>Le bruitage du chat viens d'un site avec des sons gratuits \" universalsoundbank\" rien de fou mais ça suffisait pour avoir quelque chose de drôle.\r\n</p>\n<p>23H J'ai commencé a fatiguer :) j'ai quand même essayé de rajouter vite fait un niveaux supplémentaire parceque j'étais un peu frustré de voir le jeu si cours. Ca aurait été dommage de ne pas un peu profiter des dernières heures pour tenter quelques petites rajouts.\r\n</p>\n<p>------------------</p>\n<p>Intentions et essais pour respecter un minimum le thème :</p>\n<p>Avec le thème faire du neuf avec du vieux je suis partie du principe qu'il avait sans doute encore pleins de jeux sympas a inventer avec des ressources restreintes j'ai fait du coup le choix de composer quelques musiques en Midi comme le faisait des jeux comme Monkey Island 1 &amp; 2 par exemple. Je pense que ma contributions au thème ne sera pas hyper originale par contre j'ai essayé de garder a l'esprit le côté \" ressources restreintes \" pas de sons Wav, MP3, Un rendu dessin animé au trait pour donner un aspect cartoon et plutôt \"ancien\"</p>", "metacritic": null, "released": "2018-07-22", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/43d/43d6bc481c12eb5cf62b65216c50f949.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 30, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["exodraw217"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}