{"id": 132148, "slug": "miruda-les-pierres-de-ruulna", "name": "Miruda: Les Pierres de Ruulna", "name_original": "Miruda: Les Pierres de Ruulna", "description": "<p><em>Jeu en version Beta      -    Durée de vie : entre 1h30 et 4h      -   Langue : Français    -  Gratuit</em></p>\n<p><strong>Histoire et univers</strong></p>\n<p>Miruda est un monde qui se divise en deux régions distinctes. Au nord, Miruda Pyior, dit simplement Miruda, est le plus gros continent, le second Vixories, au sud est peuplé par les Vixos qui contrôlent un ensemble de terres pauvres, sans grandes ressources vivant en autarcie bien loin des règles imposées par <em>« La Cité Mirudienne »</em> et son Général Alexandre 1er du nom. Les deux régions vivent néanmoins en paix et se respectent parfaitement. Miruda possède un régime exclusivement militaire, \"La Cité\" est dirigée par un Général des Armées, toujours associé à un Mage et un Alchimiste. Sous l’autorité du Général, on retrouve les Seigneurs de Guerre, ayant chacun un contrôle de leur région. (au nombre de trois, Morvlan, Palermys et Beogar)</p>\n<p>Miruda est en proie à un conflit qui débuta quand une étrange onde magique, parcouru l’entièreté du monde et que des portails magiques firent soudainement leur apparition dans des contrées éloignées et peu peuplée. Par de-la ces vortex ont surgit des guerriers du peuple Ayens. Des créatures fantasques qui commencèrent à attaquer le peuple Mirudien.</p>\n<p>Null ne sait, à ce jour,  ce qui a créé ces vortex, ni pourquoi le peuple Ayens s’attaque à eux, (cela sera détaillé tout au long de l’histoire) ils sont emplis d’une folie meurtrière, tuant et pillant sans ménagement et sans pitié. Le Général de « La Cité » de l’époque, le grand Guerrier Kael aidé de son demi frère de sang, Fael, un puissant magicien ainsi que de l’alchimiste Ruulna mirent en place un mouvement de résistance pour lutter et repousser les Ayens dans leur monde. Mais ce peuple est tenace, bien préparé et puissant, et semble surtout avoir une infinité de ressources à lancer dans la bataille, les opérations militaires de « La Cité » sont tous des échecs cuisants.</p>\n<p>Kael et Fael portés au titre de Héros et de Légende les premières années du conflit, furent tués en tentant de pénétrer dans ce monde d’hostilité en traversant l’un des vortex en compagnie de Ruulna.\r\nCe dernier, sombra dans la folie peu de temps après avoir ramené de son voyage en terrain Ayens, un minerai possédant d’étranges facultés magiques.</p>\n<p>Cela fait maintenant près de 50 ans que le conflit dure. Miruda est aujourd’hui affaibli, appauvri, les Vixos ont été les premiers à être exterminé par les Ayens. Les batailles se font de plus en rare, faute de combattants…la population de Miruda ne se limite plus qu’à un petit millier d’individus, des paysans pour la plupart, et des femmes veuves et vieillissantes. Le sexe fort, qui fût jadis le fer de lance des armées, ne sont plus qu'une minorité. La Cité est actuellement le dernier retranchement connu et plus ou moins sécurisé du vieux continent.</p>\n<p>Le joueur incarne Kitty (pseudo, le joueur pourra modifier son nom en cours d'aventure), une jeune Mirudienne, issu des Bas fonds de « La Cité ». Elle s’éveille dans le village d'Opina, en ruine, récemment attaqué par les Ayens, entourée de cadavres, elle semble la seule survivante, sa mémoire à court terme semble déficiente, probablement dû au choc de l’attaque, elle est quelque peu désorientée.  Elle tentera néanmoins de regagner « La Cité » en traversant le bois d’Opin, seule et pratiquement sans arme.</p>\n<p>Elle fait rapidement la rencontre dans le Bois d'Opin, de Tachibana, une guerrière, chef des forces armées Mirudienne envoyée par La Cité pour retrouver son sous lieutenant, Négolan, parti pour une étrange mission et dont les rapports indiquaient qu’il risquait de tomber dans une embuscade. Après un petit échange, Kitty commence à se souvenir qu’elle faisait partie de cette expédition … Mais pas de temps de discuter, une patrouille Ayens présente dans le bois, leur tombe dessus …</p>\n\n<p>Youtube : https://www.youtube.com/channel/UCTX6H1wwYOuF7w1rMa_mdEg?view_as=subscriber<br/></p>\n\n\n<p><strong><em>!!! Important pour ceux qui testeront la démo  !!!</em></strong></p>\n<p>-&gt; Un moment la tenancière du pub vous apportera son aide pour trouver un personnage, vous pouvez soit la payer, soit insister pour qu'elle vous donne une mini quête en échange. La mini quête fait planter le jeu, à ce moment la, payez la tenancier pour poursuivre, je sortirai un correctif rapidement dans quelques jours sitôt que j'aurai reçu les retours d'autres testeurs... Désolé</p>", "metacritic": null, "released": "2018-08-18", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/86c/86c91fa45411ece966f0631ee92cfa41.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 279, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Le-Mirudien"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}