{"id": 132157, "slug": "crystal-hunters", "name": "Crystal Hunters", "name_original": "Crystal Hunters", "description": "<p><strong>CRYSTAL HUNTERS</strong><br/></p><p>Crystal Hunters is a puzzle game inspired by classics like The Adventures of Lolo and Chip's Challenge. Take on 45 levels of mindbending puzzles as you go on a journey to collect the crystals scattered around the land.</p><p>Play as Thomas or Amelia, guided by Grandpa Buckley, and go get those crystals!</p><p>First released in 2011 for PC, and 2012 for Xbox 360. It's been a while since Crystal Hunters has been available for purchase anywhere, so we're re-releasing it now!</p><p><strong>REVIEWS</strong><br/></p><p>\"DreamRoot Studios first entry into the gaming scene is a successful and fun one…Crystal Hunters is absolutely worth exploring.\" – Jason Arriola – 8bitfix - 8.5/10</p><p>\"If you like mind benders, this sucker will go all origami on your brain.\" –<strong>IndieGamerChick</strong></p><p><strong>NOTES</strong><br/></p><p>Crystal Hunters was made in XNA, and XNA has a fun side effect of not obfuscating its XML files, which are used for all of our tilemaps in the game. This gave me some caution initially on releasing the game, but the more I think about it, the more I'd rather put it out this way than not at all.</p><p>The truth is, I first learned to love programming by hacking into old game code on my Dad's Tandy. From there, I modded parts of obscure Half Life mods like Gunman Chronicles, and that came from a bored day of me flipping through game directories looking for human readable assets.</p><p>So, if you want to chop and screw with the levels in Crystal Hunters, feel free! You can always reinstall if you totally break things! And if you end up making a cool level, I'd love to hear about it!</p>", "metacritic": null, "released": "2016-12-10", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/cca/cca998042bc7ffa396272ac0c23555ed.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 142, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Xotig"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}