{"id": 132141, "slug": "sankofa-jfc3", "name": "Sankofa (jfc3)", "name_original": "Sankofa (jfc3)", "description": "Overview<p>Sankofa is a 3D exploration adventure game that teaches players about the history and mythology of the Akan people of Ghana. \"Sankofa\" translates to \"go back and get it\" and is often associated with not forgetting the past and remembering your roots. This is traditionally done in the form of stories, and like any good story, this game has some elements that are factual and others that are more fantastical and mysterious. This yam game demo serves as a way to introduce the player to Anansi the spider, a fabled trickster, who always has a good story to tell (and a trick up his sleeve).</p>My Contribution<p>I worked on this for a paid internship with the Institute of Virtual Environments and Computer Games at UC Irvine. I was one of the lead programmers for the project. Some of the elements I developed: much of the UI, scene management and transitions, physics-based character controller, villager AI, and various game mechanics. The game is still currently in development and hopes to be one day presented in classrooms and museums to help remember and celebrate this vibrant and interesting culture.</p>What I Learned<p>I learned a lot about what being on a large team is like. At peak times we had around 15 different people working on the project at once. So knowing who to go to for what and everyone's roles was very important to keep working well. I also learned much about organizing and optimizing large complicated projects and scenes. This was the first game I worked on that had tons of high quality art, animations, and sounds, so it definitely gave me a taste for the complexity and scale of games made by large studios.</p>Video DemosElmina<p>I also helped restore an older project which explores the history of the Elmina slave castle. I was responsible for cleaning up files and scenes, syncing it to our perforce server, implementing a new UI system, adding Tobii Eye tracker support, adding functionility in some areas to switch between old world appearance and modern times.</p>", "metacritic": null, "released": "2016-10-12", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/f19/f1988955a59ab6dbd5b015833e1a43ea.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 150, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["jfc3"], "genres": [], "publishers": [], "esrb_rating": null}