{"id": 132250, "slug": "broken-halloween", "name": "Broken Halloween", "name_original": "Broken Halloween", "description": "<p>Jeu réalisé pour la Game Jam Gamecodeur n°10.</p>\n<p>Elève Premium de Gamecodeur :  Micka élève depuis 2 mois.</p>\n<p>\r\nLangage et Framework utilisé : Lua / Love2D.</p>\n<p>Code par moi-même en m'inspirant fortement des premiers ateliers Lua de la formation gamecodeur.</p>\n<p>Les graphismes proviennent du site www.pixabay.fr. </p>\n<p>Les musiques et sons proviennent du gamecodeur pack</p>\n<p>Utilisation de librairies et codes externes : Love2D et pour certaines parties de mon jeu j'ai réutilisé du code appris dans l'atelier casse brique de la formation gamecodeur.</p>\n<p>Temps passé : environ 20h</p>\n<p>Pour ce thème j'avais pensé à un jeu plus original mais aussi plus complexe en terme de programmation. J'ai donc revu mes ambitions à la baisse. J'avais envie de délivrer un jeu complet et donc je me suis tourné vers un gameplay type casse brique.</p>\n<p>Cette game jam a été l'occasion pour moi de mettre en pratique tout ce que j'ai pu apprendre dans les premiers ateliers LUA. J'ai voulu apporter un peu plus d'originalité au jeu en codant des fonctionnalités complémentaires comme l'effet d'explosion de bonbons. Le duo LUA / LOVE2D est très bien pour ce type de projet mais il faut bien organiser son code sinon on a vite fait d'être perdu. J'ai trouvé également que la manipulation des listes en LUA n'était pas très évidente.</p>", "metacritic": null, "released": "2017-10-26", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/383/3832fb15c1a78c4ee7636a2213eb18c1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 46, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MickGames"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}