{"id": 132243, "slug": "cosmic-chaos-2-unwelcome", "name": "Cosmic Chaos 2: Unwelcome", "name_original": "Cosmic Chaos 2: Unwelcome", "description": "<p><strong>I Recommend Playing This Game with an Xbox Controller</strong></p>\n<p><strong>Cosmic Chaos 2: Unwelcome</strong></p>\n<p>Nearly 2 years after the release of the initial Cosmic Chaos game, a new sequel is out now to start the story.</p>\n<p><strong>So what's new?</strong></p>\n<p>The previous game was an arcade shooter. Not this game. This game has a story to start the series. Instead of playing as an ion cannon, you now play as Zeldekogar, a space wandering man who has drifted across space onto another space ship, and soon to figure out he was not welcome aboard. Fix the ship and fight your way through the enemies to escape the space ship. </p>\n<p><strong>Will there be updates?</strong></p>\n<p>I planned this game to be released all at once. Updates may occur if needed to fix bugs or to nerf/strengthen enemies or weapons. This is the start of a series, so there will be more games for the series coming out in the future.</p>\n<p><strong>How do I contact you guys?</strong></p>\n<p>Leave a comment below or PM me if you have any questions or statements.</p>\n<p><strong>Where's your website?</strong></p>\n<p>Here it is, www.archeantus.net. I'm working with other people on projects, so you can find all that there.</p>\n<p><strong>I want to give you a suggestion for the game!</strong></p>\n<p>Great! Get in contact with me to inform me about it. *NOTE* It is totally up to me to decide whether or not a suggestion or idea gets put into the game. If you want to be paid for the idea/suggestion please tell me with the suggestion.</p>\n<p><strong>So new series? When's the next game coming out?</strong></p>\n<p>Good question! I will be on a 2.5 year break (because college and stuff). So it will take some time for the next game. However, the time it will take to develop the game will be shorter because I already have the code and game structure put together so all I'll need is art.</p>", "metacritic": null, "released": "2017-04-25", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/00d/00d2fcf59e6425eb54c541673c77904c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 115, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["CJX Games"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}