{"id": 13250, "slug": "featherpunk-prime", "name": "Featherpunk Prime", "name_original": "Featherpunk Prime", "description": "Featherpunk Prime is a vibrant and explosive twin-stick shooter-platformer, set in a neon-soaked mechanical world. You play as a badass Cyber-Flamingo with the agility and firepower to take down Cybirdroid, the evil corporation that has captured your fellow flamingos. A horde of avian warbots stand in your way, deploying a range of attacks and battle tactics to stop you. Make it past them, and the Guardians await; brutal boss fights that will throw as much destruction at you as possible. To reach the summit of the tower you’ll need to keep your claws on the move and finger on the trigger!<strong>Key Features:</strong><ul><li><strong>Challenging Combat</strong><br/>Combat grows more intense as you ascend the tower, yet more rewarding as you hone your skills and learn strategies to eliminate enemies. Use your surroundings wisely and make sure you prioritise the right foes. Find space between bullets, dodge projectiles and be wary of warbots hunting you down!<br/><br/></li><li><strong>Super agile Cyber-Flamingo</strong><br/>Tight and responsive controls are combined with a range of moves; you can boost through the air, slide under projectiles, cling to walls, dodge attacks, crawl through ducts and… stand on one leg.<br/><br/></li><li><strong>Brutal Boss Battles</strong><br/>The Cybirdroid Guardians are programmed to kill! They’ll unleash relentless waves of attacks; you’ll need to stay on your claws and use all you have learnt to take them down. Eliminate these brutal bosses to unlock checkpoints and upgrades, such as the Shockwave attack or Overdrive mode!<br/><br/></li><li><strong>Weaponry and Upgrades</strong><br/>Every floor gives you a new weapon from the ultimate arsenal. Wield classics such as the shotgun, minigun and crossbow, or unleash bouncing bullets, remote mines and heat seeking rockets. Collect Tekcells from bio-eggs and defeated enemies and use them to buy upgrades including more firepower, faster reloads and increased critical hit damage. <br/><br/></li><li><strong>Unpredictable Tower Configuration</strong><br/>Each time you enter the configuration is new, offering fresh routes to the exit. The Cybirdroid tower is constructed from carefully hand crafted sections, connected together differently each time you enter (procedurally generated). You'll also encounter various traps and hazards, so stay alert! <br/><br/></li><li><strong>Killer Avian Disco Soundtrack</strong><br/>Storm the tower to the sound of pumping beats from Wing Cap Audio!</li></ul><br/>Full support of gamepads and keyboard/mouse, with fully customisable controls.<br/><br/>Fully animated cutscenes tell the story with style!<br/><br/>Collect the 20 missing Dataspheres hidden in the tower<br/><br/><strong>Lock... Load.. Flamingooo!</strong>", "metacritic": null, "released": "2016-09-01", "tba": false, "updated": "2019-08-28T22:12:48", "background_image": "https://media.rawg.io/media/screenshots/7f5/7f5b9667f6ddb6477e1291e26b710fa7.jpg", "website": "http://www.superhatchgames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 30, "dropped": 1}, "playtime": 4, "achievements_count": 23, "ratings_count": 3, "suggestions_count": 422, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC", "Linux"], "developers": ["Super Hatch Games"], "genres": ["Action", "Indie"], "publishers": ["Super Hatch Games"], "esrb_rating": null}