{"id": 132525, "slug": "handle-that", "name": "Handle That", "name_original": "Handle That", "description": "A Message From The Boss\r\n \"Welcome to Walnut Self Storage. Before I give you your first day's task, I would like to point out that on the job application, there was no slot for your name. That's because I don't care. You can keep your name to yourself, I really don't care. Because this is your first day, all you have to do is familiarize yourself with the place. Because of this, I'm not paying you for today. I don't care how long you work today, or so called \"work\" just familiarizing yourself, but, I'm not paying you.\r\n\t<br/>\r\nTo work here effectively, there are a few things you first must know. First of all, this place has no running water, so, um... If you go into the main lobby and you see, like, a little floor board with, like, I think you have a check mark for yours. If you go into the lobby and see a floor board with a check mark on it, lift that up, and there should be a hole. That is your specific bathroom, okay? Now, if you catch someone else using your bathroom, you have permission to, um, \"take care of bushiness\" on top of them... if needed. Because, I mean, they could report it if they want to, but, do you think I care? NO! I don't!\r\n\t<br/>\r\nSecond. Because of budget cuts, we were deemed a little too low budget to have mice and raccoons. Like, you know, most self storage's. So, um, we kinda have an over sized kidney bean, and it's kinda misshapen, but, um, while I'm on that, it's kinda old, so it's kinda discolored and often changes color. Um... We aren't exactly sure why, but I think it has something to do with the almost 140 years that that kidney bean has \"worked\" here as, um... What do you call that? Our pest? And, um, while I'm on that subject, don't get too close to him because he's a little... You know. He's kinda loosing it in his old age, and he can easily get mad. He may or may not try to eat you, but if he does, just... Just calmly walk away, and just like you didn't see it, okay? And, um, I guess I would wish you good luck, but, I don't care... so, um, do your duty's. That's all I've gotta say. Um, I probably will never see you again because I don't care, um... You will probably never receive payment for this job.\"\r\nDescription<p>\r\nHandle That isn't just a game. It's an experience.\r\n</p><p>\r\n... Okay, that might hold some truth, but for the most part, I'm just messing with you. Handle That is mostly a large joke all wrapped up in a game. This is basically my first game in the Unity engine (aside from downloading the tutorial project and messing with the lighting) so it isn't going to be Triple A status. I'm only one person, jeez. That being said, this game is coming along a whole lot better than what I expected my first game in Unity to be like. Anyways, let's get down to bushiness.\r\n</p>Object<p>\r\nThe object is mostly to survive your first day of work. Although that kidney bean the boss mentioned is older than that one teacher you had that you could've sworn they were going to turn to dust during a lesson, that bean is fast. What's it's secret? It's powered by beats. Not just any beats. It has to be the highest quality beats. On this particular day, it happens to be listening to none other than \r\n\tB00tleggerz Beats, the best beat maker around. However this isn't all bad. At least you'll be able to whiteness the fire before it eats you.\r\n</p>Controls<p>\r\nThe controls are pretty simple, but just in case you can't find the help menu, I'll spell it out here.\r\n</p><p>\n<strong>W</strong> - Walk FORWARD <br/>\n<strong>A</strong> - Walk LEFT <br/>\n<strong>S</strong> - Walk BACKWARD <br/>\n<strong>D</strong> - Walk RIGHT <br/>\n<br/>\n<strong>LSHIFT</strong> - RUN <br/>\n<br/>\n<strong>LEFTMOUSEBUTTON</strong> - FIRE <br/>\n</p><p>\r\n\tPlease take a moment to \r\n\tPROVIDE US WITH SOME FEEDBACK!\r\n</p>Changelog<p>\n<strong>ALPHA 0.10 - </strong>Fixed lag without decreasing amount of enemies<br/>\n<strong>ALPHA 0.10 - </strong>Added developer mode that can be accessed through a cheat (mainly for testing purposes)<br/>\n<strong>ALPHA 0.10 - </strong>Changed the cheat code used to make other cheats available<br/>\n<strong>ALPHA 0.10 - </strong>Added a separate time bender cheat code<br/>\n<strong>BETA 0.09 - </strong>Fixed lag by removing all but one enemy making it just a slightly slimier yet more complicated version of BETA 0.07<br/>\n<strong>BETA 0.08 - </strong>Added cheats<br/>\n<strong>BETA 0.08 - </strong>Added multiple enemies<br/>\n<strong>BETA 0.07 - </strong>First version to be released to public<br/>\n<strong>BETA 0.07 - </strong>Complete overhaul of the game<br/>\n</p>", "metacritic": null, "released": "2017-02-13", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/9f2/9f21ea0cb1bbb00a9f559ef7d3174af2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 42, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["GreenBallStudios"], "genres": ["Action"], "publishers": [], "esrb_rating": null}