{"id": 132560, "slug": "solar-warden-itch", "name": "Solar Warden (itch)", "name_original": "Solar Warden (itch)", "description": "<p>Solar Warden started at the close of the Second World War II. Remnants of the Nazi high command escaped into the hollow inner earth through the openings at the pole using advanced alien technology craft they had been developing at the end of World War II. Decades later and the Nazi's have been busy further developing their technology to the point where they finally emerged from their secret base to conquer the whole world in a surprise, blitzkrieg style attack using their fleets of UFOs. A small remnant of human forces were not captured and unbeknownst to the Nazi's, these humans had been developing their own advanced technology on a secret moon base to prepare for just such an eventuality. The humans have selected you as the Supreme High Commando of War, it is your role to strategies and push back the Nazi's to the depths of the pole. </p><p>The Game uses Real time strategy (RTS) to command your fleet in the attempt to combat the Nazi hoards. You start off the game inside a small room which is the control centre of the Solar Wardens satellite from where you must take remote control of all moon based technology. The goal of the game is to destroy the Nazi satellite sending them back to the pole, however you must do so whilst defending your own or else the last remaining human remnants are left to the cold surface of the moon with no hope of escaping the Nazi control.</p>", "metacritic": null, "released": "2017-04-04", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/312/3125d36b355d5ad8f181dbc754e0a822.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 194, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["5amGames"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}