{"id": 132677, "slug": "trouble-in-tokyo", "name": "Trouble in Tokyo", "name_original": "Trouble in Tokyo", "description": "<p>Game by Jayleena Rosario</p><p>Terror hits this artists' sketchbook, as they pin their OC against themselves in this PvP arcade match.</p><p>Play as Enarbie. A current senior year student at Jadeite Academy High School, not that she ever shows up. Enarbie Fukui is the leader of the notorious rookie Sukeban gang known as GuroGirls, entirely comprised of dangerous highschool girl members. Thanks to her recently gained demon counterpart, she has taken Japan's islands by storm. Seen as a hero to girl's all over the world, and a menace to pretty much everyone else. She takes the trope of japanese magical girl to an unprecedented level.</p><p>Trouble in Tokyo has actually come a long way. The story and it's characters have come through several changes, just to fit the different settings. When I first started, I had wanted it to be a kind of tower climbing game. The only character that didn't completely change from the revision is Enarbie, a female yakuza high-school girl. She was from another series of mine so she was pretty much a finished character.Originally there was two characters I wanted to add, sadly the program Im part of only gave me a limited amount of time. There was going to be cinematics, dialogue, More than SINGLE frame animations, the good stuff. The background was also going to be animated, although of course that had to be cut out too. Hopefully'll get time to work on this so I can actually turn this into a proper arcade fighter.</p>", "metacritic": null, "released": "2017-05-15", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/326/32678c31b953441ccdf23f6fd85fff16.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 28, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS"], "developers": ["Enarbie"], "genres": [], "publishers": [], "esrb_rating": null}