{"id": 132616, "slug": "the-fairy-tale-revamped", "name": "The Fairy Tale REVAMPED", "name_original": "The Fairy Tale REVAMPED", "description": "<p>Report any bugs you may find on my issue tracker<br/></p>\n<p>Long ago, I wrote an RPG game named \"The Fairy Tale\".<br/>This game was the start of \"The Phantasar Chronicles\". Now these series have taken a lot different curve than I had in mind back when I set up the story for this game, but still as this is the story that began it all, I have revamped this game.<br/>The original game, may also be published later.</p>\n\n<p>Delisto, one of the greatest continents of Phantasar is at war. The big racial war. Elves, Dwarves, Fairies and humans fight each other for dominion, and nobody remembers how the war began. But then Marrilona and Jake, a Fairy and a human get magically bond by the Fairy love bond. An unbreakable bond of love and bound the two together forever, while they were supposed to be enemies. Not only that, their relationship would wake the all destroying Black Dragon, or at least, that is what the myths say. Feeling guilty and responsible the young couple ventures out on a quest to find out if the myth about the Black Dragon is true, and if it is, how to defeat it. But things do not seem right. Scripts and books are inconsistent and eventually the quest appears to lead to many great and dark secrets that Phantasar has kept secret for 10,000 years. Are you up for it to discover the truth?</p>\n\n\n\r\nJake Daniel Werrington\r\n<p>A young human warrior who just completed his training as a warrior. He has a very strong sense of duty and his biggest fear is to be ever unable to help those in need.<br/>Fate brings Jake in trouble when he falls in love with Marrilona, and since nothing can break a fairy bond of love, but there is still a war between the two races, he forced to treason, which upsets him greatly.</p>\r\nDataValueFull Name:Jake Daniël WerringtonAge:21Race:HumanGender:MaleWeapon:SwordArmor:Leather ArmorLikes:Helping peopleHates:Watching people die without being able to do something about it.Favorite Food:Roasted stagVoiced by:Wicky77\r\n\r\nMarrilona, daughter of Fandalora\r\n<p>A young girl, who just turned 200 years old, which is for fairies the year of coming of age. Marrilona is always cheerful and optimistic, but has the bad tendency to act first and think later getting herself into trouble time after time. She easily cries when people scold her for that, but sorts things out pretty quickly and always accepts the blame for her errors. Marrilona never runs away from her responsibilities and shows a great love for her little sister, Yannee.</p>\r\nDataValueFull Name:Marrilona, daughter of FandaloraAge:200Race:FairyGender:FemaleWeapon:Magic WandArmor:Short dressesLikes:AdventureHates:BoredomFavorite Food:Apples and berriesVoice by:Pachelle\r\n\r\nDandor\r\n<p>A Dwarf always busy to do that what he thinks he must. Dandor has a strong sense of duty and courage. He hates nothing more than cowards and does not make any effort to hide that. Dandor is a man of a few words, but when he takes in an opinion he stands firm for it.</p>\r\nDataValueFull Name:DandorAge:6Race:DwarfGender:MaleWeapon:AxeArmor:NoneLikes:Protecting peopleHates:CowardsFavorite Food:Doesn't care as long as it's edible.Voice by:Tricky\r\n\r\nHando Stillor\r\n<p>Record holder of being the oldest Elf alive (not counting the Elves of the first and second generations). Hando Stillor is the high-priest in the order of Weniaria (the Goddess of Healing) and will therefore act as your party's main healer. Not only does he provide the party with healing, but also with wisdom, and therefore he can often act as the party's mentor. His biggest wish is to live to see the day the big racial war dividing the four great races of Delisto comes to an end, although he does realise this is a wish against better judgment.<br/>In the new version of the game, he will also serve as the game's narrator.</p>\r\nDataValueFull Name:Hando StillorAge:1024Race:ElfGender:MaleWeapon:StaffArmor:Priest shirtLikes:Research. Friendship. The hope for peace.Hates:People being mean to each otherFavorite Food:Vegetarian dishesVoice by:Tricky\r\n\n<ul><li>Playable in Englsh and Dutch</li><li>Available for Window and Mac</li><li>Mouse control</li><li>Earn achievements and log them onto Game Jolt and/or Anna</li><li>Very expanded character development system</li><li>Strong storyline with a lot of Lore about Phantasar</li><li>Tons of boss fights and optional bosses</li><li>When you're done play the game in the \"New Game+\" mode for even more content.</li><li>Three difficulty settings. So beginners, casual gamers and no life gamers should all be happy.</li><li>Github bugtracker is present, so in the case you find one report it and I shall fix it asap.</li></ul>\n\r\nActorReal nameCharactersWicky 77W.K. ChanJakePachelleEvelyn Klein-HulseMarrilonaTrickyJeroen P. BroksHando Stillor..Harry..Krandar..Fairy Elder..DandorFOMMariekeFeenalaria..Sasha FundaWout66Wouter WershkullChief Werrington..Fandalora..Fighting masterLinvalaAngela NagtzaamSandraHuKeHung Kee ChanGhost of Hando Stillor's father\r\nBasic controls\r\nMouse\r\n<ul><li>Point and left click anywhere in the dungeon = Walk to the spot. Don't worry about obstacles, due to the pathfinder routine, the characters will walk around all obstacles.</li><li>Point and left click an NPC or any other object you can use = Walk to the person/object and talk to him or her/use it.</li><li>Left click any character in the menu below = Open/Close the menu (in the field only)</li><li>Point any icon in the menu = Select / Use = that item</li><li>Right mouse button = Cancel<br/>(These controls are pretty similar to Star Story).</li></ul>\r\nMinimal system specs\r\n<ul><li>Windows users: Windows XP or later is required. Windows 7 or 10 (Not 8!) is recommended.</li><li>Mac users: Snow Leopard or later should run the game, although audio may not work unless you have Mountain Lion or later. Recommended is El Capitan or later.</li><li>CPU: 2,5 GHz Intel Core i5 or better recommended</li><li>RAM: 4GB or more recommended 2GB minimally recommended.</li><li>OpenGL version 1.2 or better is required (DirectX is NOT supported).</li></ul>\r\nPreventing Lags\r\n<p>The game can be a bit demanding. If the game lags there are a few things you can try to make it run faster.</p>\n<ul><li>Play full screen</li><li>Or use a smaller screen mode</li><li>Close other applications. In particular web browsers, torrent clients and e-mail clients are known for slowing down a system.</li><li>And of course make sure you fit in the specifications set above.</li></ul>\n<p>Official support for Linux is not given, nor is this planned. Since the engine is open-source, Linux users are free to see if they can get the engine to work in Linux. However as the call to Anna and the Game Jolt API are both closed-sourced (for security reasons) the Linux version will NOT support either of them. (The Windows version SHOULD run with Wine, but please note that I will not give official support for running the game in Wine).</p>\n\n\n\n<p>I tried to do by myself as much as I could but I could not do stuff completely alone.<br/>So some 3rd party stuff is implemented. Please note stuff depicting characters and stuff from the story line are my property, and if a different name shows to their files those people did those pictures for me at my request. Other stuff may be from the CC or the Public Domain. Full license information is provided in the game files.</p>\n<p>Well honor to whom honor is due, so click here to see all people either directly or indirectly involved</p>", "metacritic": null, "released": "2017-11-14", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/359/3592c720631eb4568af8848bb2fa19fc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 141, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Phantasar Productions"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}