{"id": 132765, "slug": "ping-itch-ho-weng-yew", "name": "Ping (itch) (Ho Weng Yew)", "name_original": "Ping (itch) (Ho Weng Yew)", "description": "<p><strong>Overview</strong><br/></p><p><em>Ping</em> is a local multiplayer action game made with Unity. This game focuses on multitasking and prioritizing multiple simple tasks. Two players are put in a park where they need WiFi to play Pong, but the WiFi is unstable and moves from time to time.</p><p>You play as one of two characters playing Pong in a park, except this version of Pong requires WiFi which will affect the input lag of your paddle in Pong. Push your opponents away from the WiFi while staying close to it in an attempt to win at a simple game of Pong!</p><p>This game was made during the KDU x LHU Student Game Jam in KDU University College.<br/></p><strong>Platform</strong>Windows PC<strong>Engine</strong>Unity<strong>Language</strong>C#<strong>Duration</strong>24 hours<strong>Completion</strong>2016<strong>Team Size</strong>3<strong>Role</strong>Programmer\n<p>This project was absolutely fun to work on! There were only very few moments when my team ran into problems during the process of making this game. I was tasked to work on the top half of the game (where the players bump into each other while trying to get close to the WiFi) and simulating lag for Pong. With proper planning and excellent execution, we were even able to go out for meals and head home to sleep during the game jam! (the game jam lasted for only 24 hours)</p>\n\n<p>More Projects by Ho Weng Yew</p>", "metacritic": null, "released": "2016-10-04", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/fc4/fc47daff31de1a92efd95e29d67a3ed3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 17, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ho Weng Yew"], "genres": ["Action"], "publishers": [], "esrb_rating": null}