{"id": 13272, "slug": "guardians-of-arcadia-episode-i", "name": "Guardians of Arcadia - Episode I", "name_original": "Guardians of Arcadia - Episode I", "description": "A truly nostalgic JRPG experience, Guardians of Arcadia® tells the story of General Nero of Baikal, whose highly advanced weapons have been terrorizing kingdoms around the world. With their homeland destroyed, Hikaru, his sister Aki, and a group of unlikely characters embark to a journey to end the evil general's campaign of terror. <br/> <br/>As they find themselves drawn into General Nero's increasingly sinister plot, Hikaru and Aki realise they have an opportunity not simply to face their destiny, but to shape it. <br/> <br/>Guardians of Arcadia® harks back to classic RPGs of the 1990s, with chibi character design, random battles, a strategic turn-based combat system, and a fully 3D explorable world. <br/><br/><strong>Features </strong><br/><br/><ul><li>Experience full control in battle! Create flexible strategies by exploiting enemies’ weaknesses without time limits <br/></li><li> A fully 3D explorable world! You have access to the entire world map, and unique vehicles in which to explore it. The sky is your limit! <br/></li><li>  Now barriers to entry! Explore the beautiful fantasy world of Arcadia with low hardware requirements and simple controls, just like the old days. Compatible with gamepads.   <br/></li><li> Multi-language support! Play Guardians of Arcadia® in English, Japanese, Spanish and Portuguese at launch! </li></ul><br/><strong>Guardians of Arcardia will deliver you a best nostalgic experience ever! </strong>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T22:12:48", "background_image": "https://media.rawg.io/media/screenshots/62e/62e084a8a9490436953afcfb0aca00a8.jpg", "website": "http://guardiansofarcadia.com/episode1/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 325, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["FABULA EPICA"], "genres": ["Adventure", "RPG", "Strategy", "Indie"], "publishers": ["FABULA EPICA"], "esrb_rating": null}