{"id": 132864, "slug": "empathy-swap", "name": "Empathy Swap", "name_original": "Empathy Swap", "description": "<p>This game was made as a solo project for Ludum Dare 38. The theme for the game jams was \"Small World\".</p><p><strong>How To Play</strong></p><p>Start with no resources. Plant mines to mine your planet for resources. Resources allow you to shoot missiles. Resources are also your health. Your health is reflected by the size of your planet. Get pickups to increase your health. Your paddle can shoot and can deflect missiles. You die when your health reaches zero. Last planet standing wins.</p><p>At random times throughout the game, an <em>Empathy Swap</em> will occur. Players swap planets. For a fun meta-game add-on you can also swap controllers at this point.<br/></p><p><strong>Backstory</strong></p><p>Mine resources in order to shoot missiles, gradually undermine your own defence in order to have a strong offence - a reflection of how we treat each other and our planet. A fast-paced, razzle-dazzle arcade game, or a sideways glance at the human condition? You decide!</p><p>I used Unity 5 for dev, Adobe Illustrator CC for art and https://soundation.com/ for the music. I used http://www.bfxr.net/ for sound effects.</p><p><strong>Critique</strong></p><p>The game is an arena battle crossed with pong with a bit of RTS thrown in. As a game it definitely struggles with the \"too much going on\" side of game design, but the content was fun to make (particularly the sounds and voice acting) and I guess it could be quite strategic if you really got into it. It needs balancing too :\\</p><p><strong>Requirements</strong></p><p>Requires a controller and a keyboard. <br/></p><p>Only works on screen res 16:9.</p><p>Only tested on Windows 10, Intel I5, Nvidia GTX 960, 16gb RAM.</p><p><strong>UPDATE: Version 1.1 allows two players to play on keyboard (WASD and Arrow Keys)</strong></p><p><em>Keyboard controls</em></p><p>A/D or Left/Right: Move orbit paddle</p><p>W or Up: Shoot</p><p>S or Down: Plant mine</p><p><em>Gamepad controls (e.g. Xbox Controller)</em></p><p>Left Analogue: Move orbit paddle</p><p>A: Shoot</p><p>B: Plant mine</p>", "metacritic": null, "released": "2017-04-23", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/8c8/8c87a12a49963c4eeae6b8b05bfd8b69.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 80, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Andrew Sargeant"], "genres": ["Action"], "publishers": [], "esrb_rating": null}