{"id": 132872, "slug": "touitch-simulator", "name": "Touitch simulator", "name_original": "Touitch simulator", "description": "<p>Jeu réalisé pendant le Challenge OneGameAMonth d'avril 2018.  Il s'agit de ma première participation au challenge. L'objectif du challenge est de réaliser un jeu par mois. Chaque mois, un nouveau thème est proposé.<br/></p>\n<p>Vous trouverez plus d'informations sur le processus créatif dans mon journal de bord vidéo.\r\n</p>\r\nIntroduction\r\n<p>Le thème du mois était \"<strong>Quality</strong>\". Après un brainstorming en live avec la communauté. Je suis parti dans l'idée de créer un jeu de gestion d'une plateforme de streaming. L'idée de base était de gérer la qualité de notre service pour attirer plus de streamer que la concurrence.<br/></p>\r\nTechniques\r\n<p>Le jeu a été développé à l'aide du moteur Godot Engine.<br/></p>\n<p>Je suis en plein apprentissage de ce moteur, ce jeu m'a permis d'apprendre pas mal d'aspect de celui-ci.</p>\n<ul><li><strong>Interface générale : </strong>J'ai pris en main l'interface de Godot dans un premier projet réel, ce que me permettra de lancer plus rapidement les prochains projets.</li><li><strong>UI et Drag'n'Drop </strong>: Ce jeu est uniquement un jeu d'interface, j'ai du me familiariser avec les différents éléments d'UI. Notamment comprendre comment utiliser la fonctionnalité du Drag'n'Drop.</li><li><strong>Signals </strong>: Je comprends mieux comment envoyer et recevoir des signaux dans Godot.</li><li><strong>Pixel Art </strong>: Les divers éléments visuels ont été réalisé en pixel art à l'aide du logiciel Aseprite</li></ul>\r\nAméliorations possibles\r\n<ul><li><strong>Menu</strong> : Je n'ai pas eu le temps de crée un menu au début du jeu.</li><li><strong>Afficher le score au Game Over : </strong>Je n'ai pas compris comment passer une valeur d'une scène à une autre. Je n'ai donc pas réussi à afficher le score à la fin de la partie.</li><li><strong>Équilibrage</strong>:  Les valeurs en jeu sont pour l'instant totalement arbitraire.</li><li><strong>UI et Feedback : </strong>Un travail d'interface doit encore être réalisé. Au début d'une partie, on ne comprend pas très bien les différents éléments (combien coûte un serveur, fin d'une journée, etc...) </li></ul>\r\nLiens\r\n<p>Code source du jeu : Github\r\nJournal de bord en vidéo : Youtube\r\n</p>\n<p>\n</p>", "metacritic": null, "released": "2018-05-05", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/b65/b65dec9f0b2f9919814466d3d5f7c00f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 23, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Greaby"], "genres": [], "publishers": [], "esrb_rating": null}