{"id": 132901, "slug": "mary-go-around", "name": "Mary Go Around", "name_original": "Mary Go Around", "description": "<p><strong>Spin through the level and reach the target area without hitting the shapes – but watch out for the heads!</strong></p>\n<p> You are constantly moving, so set the next rotation point quick enough. In some situations, you might have to change the direction or even cut your connection to  make it – but be sure to catch yourself again before you get shattered to pieces. The giant heads will block your path, therefore you will need some skillful maneuvering to get them out of the way.</p>\n<p>The game was made during the second semester of the Game Design bachelor program at HTW Berlin.</p>\n\n<p><strong>Download instructions:</strong><br/></p>\n<p>This game was developed for Android tablets. It also runs on Android smartphones, but the interaction will be harder because of the size of the elements.<br/></p>\n<p>To install the game, execute the apk file on your android device. Be sure to enable the installation of apps from unknown sources in your security settings.</p>\n<p><strong>Installations-Anleitung:<br/></strong></p>\n<p>Dieses Spiel wurde für Android-Tablets entwickelt. Es läuft auch auf Android-Smartphones, jedoch ist es aufgrund des kleinen Bildschirms wesentlich schwerer zu spielen.<br/></p>\n<p>Um das Spiel zu installieren führen sie die apk-Datei auf ihrem Android-Gerät aus. Möglicherweise muss zuerst die Installation von Apps aus unbekannten Quellen in den Einstellungen aktiviert werden.</p>\n\n<p><strong>Credits:</strong></p>\n<p>Rebecca Zimmer<br/>Uliana Schöller<br/>Mikka Wild<br/>We want to thank our professors Susanne Brandhorst and Thomas Bremer for their professional supervision and support.<br/></p>", "metacritic": null, "released": "2017-11-09", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/83e/83eabfdba0b2565f0ca800466a8e8a78.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 48, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Mary Go Around"], "genres": ["Action"], "publishers": [], "esrb_rating": null}