{"id": 13328, "slug": "spy-fox-in-dry-cereal", "name": "Spy Fox in \"Dry Cereal\"", "name_original": "Spy Fox in \"Dry Cereal\"", "description": "<p>Humongous Tees Now Available!Official Humongous Entertainment T-shirts featuring Pajama Sam, Spy Fox, Freddi Fish, and Putt-Putt are now available on Amazon.</p>\n<p>About the GameWill kids be forced to endure a fate worse than eating dry cereal!?<br />\nThe Plot: William the Kid has nearly completed his dastardly plan to cow-nap all the worlds supply of milk!<br />\nThe Mission: The super-suave agent, SPY Fox, must find Mr. Udderly, rescue all the cows, and stop William the Kid from depleting the worlds supply of milk. Using ingenious SPY gadgets, keen wits, and daring moves, SPY Fox, jumps out on an udderly exhilarating adventure!<br />\nInnovative new tools like Talk Balloons allow kids to investigate in a whole new way<br />\nUse top secret SPY gadgets to solve puzzles that test logic<br />\nEarn clues with fun games and activities<br />\nClues change every time you play, and the game just might end differently<br />\nSPY Fox in Dry Cereal challenges and inspires kids to observe details and solve problems in creative and flexible ways. Kids play with faithful, lovable friends as they discover and explore captivating worlds where they direct the journey at their own pace.<br />\nThis product uses ScummVM across Windows, Mac and Linux which is released under the GNU GPL v2.<br />\nFor more information, please visit - http://www.scummvm.org<br />\nThe GNU GPL can be viewed here - https://www.gnu.org/licenses/gpl-2.0.html</p>", "metacritic": null, "released": "1997-09-02", "tba": false, "updated": "2023-12-05T16:06:58", "background_image": "https://media.rawg.io/media/screenshots/f92/f9256904e43f756ccb2cbd8c43d1fcaf.jpg", "website": "http://www.humongous.com", "rating": 4.19, "rating_top": 4, "added_by_status": {"yet": 10, "owned": 218, "beaten": 26, "toplay": 3, "dropped": 1, "playing": 1}, "playtime": 4, "achievements_count": 0, "ratings_count": 16, "suggestions_count": 276, "game_series_count": 0, "reviews_count": 16, "platforms": ["iOS", "PC", "Wii", "Android", "macOS", "Linux"], "developers": ["Humongous Entertainment"], "genres": ["Adventure", "Casual", "Educational"], "publishers": ["Nightdive Studios", "Majesco Entertainment", "Humongous Entertainment", "Tommo"], "esrb_rating": null}