{"id": 13326, "slug": "fish-or-die", "name": "Fish or Die", "name_original": "Fish or Die", "description": "Select from variety of Lakes with increasing size.<br/>Define your strategy by selecting a combination of equipment, tackle, and power ups.<br/>Plays like a real time strategy( RTS ) game. Plays like a board game with simultaneous turns.<br/><br/><br/>Tournament mode allows all your friends to play on the same Lake. All Players compete to catch the five biggest Bass by end of Tournament day.<br/><br/>Everyone plays their turn’s action points simultaneously. When everybody is through with the turn, turn end timer is reset and all action points are restored. You must return to the Marina to weigh in your Bass before the end of Tournament. Only live Bass count toward your total.<br/><br/><ul><li>Sell fish when running low on cash. Use cash to upgrade and replace equipment.</li></ul><br/><ul><li>Encounter hungry creatures begging for food. Take your chances by ignoring their demands. Treat them right, they will help you out.</li></ul><br/><ul><li>Game starts with buying gear with a fixed allowance of points. Tackle Store has large selection gear. Buy items to upgrade tech, help detect fish, travel faster, cheat and land bigger fish.<br/></li><li>You can visit the Tackle Store during play to replace expendables like lost lures or unanticipated events needing a repair kit.</li></ul><br/><br/><br/><ul><li>Game Warden - Patrol Lake for regulation violations.<br/></li><li>Psychedelic Fish - catch this fish and you will have difficulty casting correctly due to visual effects.<br/></li><li>Outboard Motor - travel far distances quickly on large Lakes.<br/></li><li>Fish Finder V2 - Detect size and level of fish.<br/></li><li>GPS Navigation - Show mini map and location of fishing holes.<br/></li><li>License - Catch rare fish. Can fish without but Warden may fine you.</li></ul>", "metacritic": null, "released": "2015-08-31", "tba": false, "updated": "2019-08-28T22:12:46", "background_image": "https://media.rawg.io/media/screenshots/87c/87c97220ba0f3ea5f0d6e30fc5a696c8.jpg", "website": "http://www.fishordiethegame.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 4}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 345, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Thirsten Studios"], "genres": ["Strategy", "Sports", "Casual", "Indie"], "publishers": ["Thirsten Studios"], "esrb_rating": null}