{"id": 13339, "slug": "they-bleed-pixels", "name": "They Bleed Pixels", "name_original": "They Bleed Pixels", "description": "<p>They Bleed Pixels is a 2D hardcore platformer featuring pixel art stylistics borrowed from Lovecraft compositions. This is the only title within the franchise.</p>\n<h3>Gameplay</h3>\n<p>The game incorporates the hard elements from the titles like Super Meat Boy — not only the battle sections here are difficult due to the one-button attack system, but the platforming is challenging too as there are a number of regions where the blocks are covered by ice, and the player is required to perform a high-accuracy jumps while sliding. The death is common here as there are numerous ghastly obstacles along the level. Although the game features checkpoints they are only created when enough enemies&#39; blood is accumulated within the heroine. So, the location without encounters means the place without checkpoints as well.</p>\n<h3>Plot</h3>\n<p>The story examines the adventures of a little teenager who enters a special school for girls only — Lafcadio Academy for Troubled Young Ladies. The only difference is — the action takes place within her nightmares where she is forced to fight numerous squads of demons. After every level, the girl wakes up and through the course of the plot she begins noticing changes occurring to her real self, which are gained from her nightmares. She is fully transformed at the end of the game and finds out it was all set for the dark ritual.</p>", "metacritic": 74, "released": "2012-08-29", "tba": false, "updated": "2024-01-16T19:35:45", "background_image": "https://media.rawg.io/media/screenshots/316/316f5c1d64b1b73dc1d39b6a6e8ce3f0.jpg", "website": "http://www.theybleedpixels.com/", "rating": 3.35, "rating_top": 4, "added_by_status": {"yet": 60, "owned": 976, "beaten": 29, "toplay": 5, "dropped": 46, "playing": 5}, "playtime": 3, "achievements_count": 150, "ratings_count": 91, "suggestions_count": 313, "game_series_count": 0, "reviews_count": 92, "platforms": ["macOS", "PC", "Linux"], "developers": ["Spooky Squid Games"], "genres": ["Action", "Indie"], "publishers": ["Spooky Squid Games"], "esrb_rating": null}