{"id": 133482, "slug": "shogi-in-julia", "name": "Shogi - in Julia", "name_original": "Shogi - in Julia", "description": "<p>From Wikipedia:<br/><em>Shogi , also known as Japanese chess or the Generals' Game, is a two-player strategy board game in the same family as Western (international) chess, chaturanga, makruk, shatranj, janggi and xiangqi, and is the most popular of a family of chess variants native to Japan. Shōgi means general's (sho) board game (gi).</em></p><p><em>NOTE: This is NOT a full game, the source code is freely available to anyone who would like to use it! A donation would be very much appreciated though, even just a single cent!<br/></em></p><p>This source code of shogi, handfully crafted by a team of 6 people, contains many variants of shogi, such as chu shogi, minishogi, tenjiku shogi, and an original variant aptly named \"hell shogi\". </p><p>This source is able to play intense two-player local matches with various settings, as well as play with a Monte-Carlo powered artificial intelligence. Players are able to battle against AI with varying difficulties and strategies that will test even the toughest and most avid shogi fans. </p><p>Netplay is another great feature of this program, allowing you to play against any player in the world at any time. With our simple hosting procedure, you can quickly join or create a game with others! You may also use an AI to battle others if you'd like!</p><p>If you are the busy type, you may also choose to play e-mail games where you can send your save files to others and make a move whenever you so choose.</p><p>This game is currently in-development, and many more features will be added! Thank you for your support!</p><p>NOTE: This is NOT a full game, the source code is freely available to anyone who would like to use it! A donation would be very much appreciated though, even just a single cent!<br/></p>", "metacritic": null, "released": "2016-12-02", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/e46/e4676408409bbf40911dcef5780934ef.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 15, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["the-xmas-k"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}