{"id": 133483, "slug": "the-lost-office", "name": "The Lost Office", "name_original": "The Lost Office", "description": "<p><em>This is a prototype. We wanted to see if people were interested in seeing this project brought to fruition.</em></p><p>The Lost Office presents you with an array of challenges. The best candidates can solve all of them within 60 seconds. Those who don't, well, let's just say those candidates didn't \"make the cut.\" Be warned, Deja Vu may be the case here as each challenge differs only slightly from the last.</p>Are you the best candidate?Solve the vaguely clued puzzles in each room before the timer runs out.<p>Unfortunately, we can only offer you one try at proving you are the best candidate. As it turns out, you might just be the one we are looking for! There have been so many come before you, that we were beginning to give up hope that we can find the best candidate for the job! But, beware, unsuccessful candidates will be blacklisted, and some haven't been heard from since they tried out.</p>Do you have a great eye for detail?<p>We certainly hope so, as each challenge is setup in almost the same way. Paying attention to detail might just give you the advantage you need over the previous candidates.</p>How do you feel about change?<p>We hope you thrive on it, because your challenges were randomly chosen from our array of tests. We feel we can better learn about our candidates through randomness.</p>Would you call yourself an acheiver?<p>We hope to reward those who achieve with Steam acheivements. Improve your candidacy for future applications.</p>", "metacritic": null, "released": "2016-03-14", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/c2c/c2c20a73b3f1055889b1efedcfc85159.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 54, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Sub-Zero Squirrel"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}