{"id": 1334, "slug": "smash-cops", "name": "Smash Cops", "name_original": "Smash Cops", "description": "Join over 4 million players worldwide who are raving about the hit game, Smash Cops.<br/><br/>With over 30 missions to play, 8 vehicles to collect and 7 mini games, Smash Cops is an intense action racing game which pits your driving skills against felons desperate to outrun you in wild chases.<br/><br/>“Great-looking police-pursuit game”, “innovative“ &amp; “refreshing”  4.5/5 TouchArcade<br/>“A cool action racer”,  “a real joy”, “excellent graphics, innovative controls and intense action”  4/5 Touchgen  8/10 Pocket Gamer <br/><br/>Play Smash Cops though your HD TV.  Smash Cops supports Apple’s great Airplay technology so you can now play it through your HD TV via an Apple TV.<br/><br/>--- <br/><br/>BE THE POLICE IN AMERICA'S WILDEST TV CHASES<br/><br/>- PURSUE<br/>Take down runaway felons whilst avoiding civilian traffic and buddy police as you chase and weave through traffic. <br/><br/>- ESCAPE<br/>Escape under time pressure from felon attack and get to a call out location as quickly as possible. <br/><br/>- CHALLENGE<br/>7 different mini games: smash a load of cars illegally parked in a car park, weave through a course laid out by cones, dodge traffic on a highway and collect evidence throughout the city.<br/><br/>- GROUND BREAKING CONTROLS<br/>By placing your finger behind the car you can steer, weave, defend and attack runaway felons with full control of your vehicle, never before used in touch racing games.<br/><br/>- LARGE DRIVABLE CITY<br/>Huge city with high quality visuals creates a fun and rich environment for different attack and escape routes spread over 30 missions and 8 vehicles.<br/><br/>- CHAOS AND MAYHEM<br/>Smash, crush and flip felon vehicles. Obliterate the street scenery.<br/><br/>---<br/><br/>- iPhone 3GS AND iPod Touch 3 USERS<br/>Smash Cops will play but will be slower in parts as it uses extensive physics optimised for more powerful iOS devices.<br/><br/>- OPTIMISED FOR iPhone 4 AND iPad 1<br/><br/>- ENHANCED FOR iPhone 4S AND iPad 2<br/>Enjoy more physics and more visual FX that take advantage of that extra power!<br/><br/>---<br/><br/>Facebook: facebook.com/HutchGames<br/>Twitter: @HutchGames<br/>YouTube: youtube.com/user/HutchGames<br/>Web: www.hutchgames.com", "metacritic": null, "released": "2012-01-12", "tba": false, "updated": "2019-07-29T10:57:58", "background_image": "https://media.rawg.io/media/screenshots/a76/a7682a7b2150d87181005679f0e46f03.jpeg", "website": "http://www.smashcops.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 205, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Hutch Games"], "genres": ["Action", "Racing"], "publishers": ["Hutch Games"], "esrb_rating": "Everyone 10+"}