{"id": 133544, "slug": "fabric-demo", "name": "Fabric - Demo", "name_original": "Fabric - Demo", "description": "<p>\n<strong>VOTE FOR US! FABRIC IS ON GREENLIGHT!!</strong>\n</p><p>\n<strong>Greenlight Page</strong>\n</p><p>\n<strong>Website</strong>\n</p><p>\n<strong>Facebook</strong><br/>\n</p><p>\n<strong>Twitter</strong>\n</p><p>\r\n\tOverview<br/>\n</p><p>Fabric is a First Person Puzzle Game with bending and squeezing mechanic to solve the challenging puzzles and complete the glitchy voxel-based levels.</p><p>\n<br/>\r\n\tYour goal is, basically, to reach the end of the level. To achieve this goal, you won't need to collect numerous of items, won't craft anything absurd or won't try to persuade any chatty AI: In Fabric, you will change the shape of voxel-based levels and physics with your gun. This gun allows you to bend space, squeeze the world, separate tiles from each others and bring them together.\r\n</p><p>\r\n\tKey Features\r\n</p><ul>\n<li>Bend the Environment: When you select two tiles with your gun, everything between them will disappear, and the world will squeeze according to these two tiles. </li>\n<li>Defy The Laws of Physics: Fabric is a platform puzzle, so you can change physic to bend level as you want. E.g. changing gravity upside down lets you to walk on upper floor. </li>\n<li>Mess With Your Brain: Puzzles are levels themselves. Bend the half of level vertically or horizontally, bring separate parts together and re-separate them to create a path which you can move on. </li>\n<li>And More: Electric cables, power fields, more glitches...</li>\n</ul>", "metacritic": null, "released": "2015-11-18", "tba": false, "updated": "2019-08-28T23:22:59", "background_image": "https://media.rawg.io/media/screenshots/d67/d671a67c01f1cc581e23d3cb445ada42.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 66, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Torreng Labs"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}