{"id": 13365, "slug": "subspace-continuum", "name": "Subspace Continuum", "name_original": "Subspace Continuum", "description": "<strong>Subspace Continuum</strong> is one of the longest-running multiplayer action games in the world. Entirely player-managed and supported, its dedicated community continues to play this game year after year for its responsive, nuanced controls and instantly-addictive combat.<br/><br/>What makes this game so special?<br/><ul><li><strong>Customized zones</strong> each with their own unique ship settings<br/></li><li><strong>Automated leagues</strong> with detailed stat tracking<br/></li><li>Wide array of <strong>weapons</strong> and <strong>tools</strong>, including: bullets, bombs, mines, repels, bursts, decoys, temporary walls, and more<br/></li><li>A variety of<strong> play modes</strong>: CTF, turf, deathmatch, ball games, team deathmatch, base assault, and hundreds of special events<br/></li><li><strong>Oldschool ambiance</strong>, a nice contrast to new games with all style and no substance<br/></li><li>A <strong>community </strong>glad to welcome newcomers, and with real personality<br/></li><li><strong>Netcode </strong>so optimized that you can run smoothly from almost any connection or location</li></ul><br/>It's hard to describe why people love this game so much. Like any classic, even today, it still feels fresh. But it's not without its faults; it has an older interface that can be confusing at first. <strong>New players have to first set up a profile</strong> by clicking the Profile button, and then typing in a Player Name and Password at the top right. This name must be unique to the network. The only way to check is by pressing OK, choosing a zone from the list, and then pressing Play to see if your name is already in use. (Hint: it probably is, so try something unusual!)<br/><br/>Once you're in the game, you can access the menu by pressing Escape. Change to a new ship by pressing 1-8, or choose S to spectate. By default, Ctrl fires your guns, Tab will Bomb, and Shift is your afterburner. To talk to other players, just start typing.<br/><br/>If you can handle a few quirks, you might discover why Subspace Continuum has such incredible lasting appeal. Come on in, try a few different zones, and see for yourself! You might just find it's your new favorite game.", "metacritic": null, "released": "2015-07-03", "tba": false, "updated": "2022-09-29T23:55:07", "background_image": "https://media.rawg.io/media/screenshots/cdf/cdfad9e3171de689568f7c203060d6e0.jpg", "website": "http://www.subspace-continuum.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 314, "toplay": 1, "dropped": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 4, "suggestions_count": 279, "game_series_count": 0, "reviews_count": 4, "platforms": ["PC"], "developers": ["Virgin Interactive Entertainment", "PriitK"], "genres": ["Action", "Casual", "Massively Multiplayer"], "publishers": ["Subspace Continuum"], "esrb_rating": null}