{"id": 133690, "slug": "kill-the-last-alien", "name": "Kill The Last Alien", "name_original": "Kill The Last Alien", "description": "<p>My submission to the Wizard Jam 5!</p>\n<p>In Kill the Last Alien, you and 3 other friends are enjoying a few rounds of alien mochi in space.  As the rounds come to a close, you'll have to fight over the last aliens to score points.</p>\n<p>Each round starts with a Decision portion, where each player locks in their first choice to pounce on.  The first person to lock into a specific mochi nabs it.  If multiple players choose the same one, any players that locked in after the first player will return with nothing!</p>\n<p>After the initial decision portion, any remaining mochi that were not selected are up for grabs.  Any player that didn't succeed in the first portion can grab the leftovers immediately. When all the mochi are eaten, the round ends and the scores are shown. Best of 5 rounds wins the game!</p>\n<p>Scoring is as follows:</p>\n<p>2pts if you successfully grab a mochi during the decision portion.</p>\n<p>1pt for any leftovers.</p>\n<p>Controls for each player and a recap of the rules can be found in the last slide of the \"How To Play\" section of the menu.</p>\n<p>Huge thanks to James Palermo( @JamesisAsian) for cranking out the art assets and helping design this thing, Nick Kornek (@nkornek) for introducing me to this wonderful jam and providing moral support throughout the weeks, and lastly Aaron San Filippo (@AeornFlippout) for some critical last minute bug solving minutes before I finished the game.  Looking forward to this week's Showcase!</p>", "metacritic": null, "released": "2017-06-19", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/5e5/5e592c5f0e494b67cd56e4704def7b44.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 98, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Justin Terry"], "genres": [], "publishers": [], "esrb_rating": null}