{"id": 133633, "slug": "gunfighter-death-wish", "name": "Gunfighter: Death Wish", "name_original": "Gunfighter: Death Wish", "description": "<p>Gunfighter: Death Wish is a non-stop action top-down shooter game. In the game the player character engages in a lone assault, shooting large numbers of enemies while dodging their attacks. Thus, the player’s goal is to take out as much hostiles as possible. This game calls for fast reactions and for the player to memorize levels and enemies’ attack patterns.</p>\n<p>\n</p>\n<p>You will have an entire arsenal at your disposal from simple handguns to deadly rocket-launchers and fire-throwers. Also, in order to survive the player will have to collect separate power-ups and character upgrades dropping from the hostiles. Powers-ups add extra abilities to the player’s character. For instance, a riot shield, an ATV vehicle, a mech vehicle, etc.\r\n  </p>\n<p>\n</p>\n<p>You will be faced with the smart, armed to the teeth hostiles. There are eight kinds of the enemies in the game. Enemies try to avoid bullets of the player character, take cover while reloading their weapons, etc. They can also hear a sound of gunshots, a thunder of explosions, a clatter of glass windows having been shattered. However, not all kinds of enemies follow this behavior pattern. Each of them acts in conformity with their own behavior patterns, so, you will have to learn you enemies’ behaviors and figure out their strengths and weaknesses. \r\n  </p>\n<p>\n</p>\n<p>– Fight your own way through three arena-like levels filled with the armed to the teeth enemies to achieve the best score.\r\n  </p>\n<p>– Use your constant slow-motion ability if you are trapped in the difficult to survive situation.\r\n  </p>\n<p>– Collect the power-ups and use it with the different weapons to find the most powerful combinations.\r\n  </p>\n<p>– Learn your enemies and figure out their strengths and weaknesses. </p>\n\n<p>Tips for the player:\r\n  </p>\n<p>1. Before playing, go to ‘Options’ to learn about the controls.\r\n  </p>\n<p>2. Don’t forget to use your slow-mo ability. That’s the key to survive in the game.\r\n  </p>\n<p>3. In order to throw a grenade press right-mouse button. The longer you holding it down (up to two seconds) the longer will be a throw’ distance. \r\n  </p><p>4. How do power-ups work? When power-up is active, each kill increase the time of its duration. \r\n</p>\n<p>\n</p>\n<p>Note that it isn’t a full game but rather a demo version.</p>\n<p>What does a demo-version hold:\r\n  </p>\n<p>1. Five types of enemies (there are eight types of enemies in the full version).\r\n  </p>\n<p>2. Nine types of weapons (there are twelve types of weapons in the full version). \r\n  </p>\n<p>3. Three power-ups (there are six power-ups in the full version).\r\n  </p>\n<p>4. One level (there are three levels in the full version).</p>\n\n<p>\n</p>\n<p>If you like this game, please vote for the full version of it:\r\n  </p>\n<p>http://steamcommunity.com/shar...\r\n  </p>\n<p>\n</p>\n<p>Any feedback is welcome.</p>", "metacritic": null, "released": "2017-06-02", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/199/199ed6d3eefdf95ef965d02a6d22cb95.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 98, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ashmor"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}