{"id": 133726, "slug": "race-plant", "name": "Race Plant", "name_original": "Race Plant", "description": "Try the game, See the code, and Donate or Pay what you want :)\r\nGame\r\n<p>Race Plant is a game I made solo during CIGA Game Jam 2017 in Shenzhen, China. It's 48 hours game jam.</p>\n<p>The theme is </p>\r\nGame jam theme\r\n<p>thus this game idea revolves around that.</p>\n<p>Race Plant is <strong>not</strong> complete, but might have additional feature in the future. As of now, the game can offer complete playable gameplay with two players competing each other in a match to plant tree, water it, and collect its fruits for score. Who gets higher score within match's limited time wins!</p>\n<p>See Code? section below if you want to see the code.</p>\n<p><strong>BEWARE: </strong>The game needs two XBox360 controllers to play in case of two players, or one controller in case you play alone (but the game is aimed for 2 players). The game doesn't support playing with keyboard on the same machine.</p>\r\nKey Control\r\nXBox360 controller\r\n<ul><li>B button to place down item on the ground, or if another player is nearby that item will be threw into hands of another player.</li><li>A button to restart the match when the current match is over</li></ul>\r\nKeyboard\r\n<ul><li>Z button to immediately restart the match even during the game</li></ul>\n\r\nCode?\r\n<p>The amount you have paid to support this project will be to support my intention as I open sourced this project. So if you're developer, you can learn more about it in code level.</p>\n<p>The tools I use are as follows</p>\n<ul><li>libgdx with kotlin as programming language</li><li>Android Studio 2.3.3</li><li>Aseprite - for pixel art and animation</li><li>tiled - for tile-based map editor</li><li>Bfxr - for sound effect (background music, and some of sfx I downloaded them from Internet)</li></ul>\n<p>If the tools or technology to create this game are not aligned with your tech stack, you're still free to support the project!</p>\n<p>Go to https://github.com/haxpor/race... to grab and see the code.</p>\r\nMore Information\r\n<p>I wrote postmortem post about this project here included with dev process, iteration strategy, main artistic references, lots of gifs, what went right and wrong.</p>", "metacritic": null, "released": "2017-06-22", "tba": false, "updated": "2019-08-28T23:22:59", "background_image": "https://media.rawg.io/media/screenshots/b3d/b3d52a1b93ea251b12ae36dc16141106.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 114, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Angry Baozi"], "genres": [], "publishers": [], "esrb_rating": null}