{"id": 133771, "slug": "chain-of-debt", "name": "Chain Of Debt", "name_original": "Chain Of Debt", "description": "<p>Chain of debt is a submission for Butterscotch ShenaniJam 2018. The theme of this game is inspired from the \"Burn it down\" prod-cast, and the technical debt to be specific; It's a blockchain parody based on the debt/jubilee concepts.</p>\n<p>The extra constrains thrown in this game are Blockchain, Just shapes, One Punch Man and Maverick.</p>\n<p>The 12x12 map presents a block of data in a blockchain. The hashing process of a block is composed of two actions:</p>\n<ol><li>Generating a random number of steps by clicking the \"Dice\" button.</li><li>Choosing one of the possible pieces to move the cursor to.</li></ol>\n<p>These actions are repeated 6 times to hash a block. The first block doesn't contain the hash of the previous one, so it's a genesis block with a full map. However, the next block's map will contain holes. These holes present the hash of the previous block, meaning that the pieces you land on in the current block, will be removed with the four surrounding pieces of each of them from the map of the next block. This is a manifestation of the technical debt, you're in debt to your previous choices.</p>\n<p>The gaps in the map will continue to increase with every hashed block, but a manifestation of the jubilee concept also exists; every 5 blocks you hash, you'll have a genesis block with a full map, burning down all the debt to your previous steps.</p>\n<p>The goal of the game is simple, hashing as much blocks as you can. The two losing conditions are:</p>\n<ol><li>The six steps of the hashing process are over and the cursor didn't reach the last line of the block (You didn't parse the whole data of the block).</li><li>A random number is generated but no piece on the map is highlighted, meaning that there's no possible piece that the cursor can move to sor you're stuck.</li></ol>\n<p><strong>TIPS:</strong></p>\n<p>When I first had the idea, I didn't think it's going to be this difficult. The game is really hard, I can barely hash five blocks. But there's a certain game logic you can follow:</p>\n<ul><li>The last line on the block's map is the most important, when you choose a piece to land on, think carefully of the next block's map and how you can move on it.</li><li>Don't rush to the last line of the block, you'll have no choice but to move horizontally on that line until hashing process ends, meaning that most of it will be gone in the next block.</li></ul>", "metacritic": null, "released": "2018-06-11", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/aae/aae168b5a30de601e9e35dcdcea261a6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 58, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["AyoubKhammassi"], "genres": [], "publishers": [], "esrb_rating": null}