{"id": 133781, "slug": "annotation-of-love-itch", "name": "Annotation of Love (itch)", "name_original": "Annotation of Love (itch)", "description": "<p><strong>Annotation of Love</strong> is a set of three mini-games and three original Czech songs. While listening to songs you will experience particular stages of love and critical points of relationships. The main protagonist He experiences phases of being in love with She step by step. They look for things they have in common, get to know each other, and in the end…? <br/></p>\n<p><strong>Three mini-games</strong> based on earning the highest score will push you to improve and thus examine your reflexes and brain. Games have time limit, which is the length of the song. You can compare your score from each mini-game with other players. The game will also attract you by its overall atmosphere.\r\n  </p>\n<p>The game is available in PC and mobile phones in standard stores such as <strong>Apple App Store</strong>, <strong>Google Play</strong> or <strong>Steam (Win, Mac, Lin)</strong>.\r\n  </p>\n<p>We will appreciate any kind of support and feedback. Regards: <br/>- <strong>Tomáš Basovník / TombasOnly </strong>(Fb, Tw, Ig) – I’m an independent game developer. My mission is producing real fun digitally. <br/>- <strong>Martin Hoferek / Hofinband </strong>(Yt) – I’m an amateur graphic designer and musician. I hope you will enjoy the game at least as much as I did while creating it. <br/></p>\n<p><strong>System requirements<br/></strong>OS: <strong>Windows </strong>7. 8, 10  // <strong>Mac OS X</strong> v10.9+ (64bit) // <strong>Linux </strong>(64bit)<br/>Processor: 1.8 GHz<br/>Memory: 2 GB RAM<br/>Graphics: 256 MB Video Memory<br/>Storage: 200 MB avalible space<br/></p>", "metacritic": null, "released": "2018-03-28", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/a40/a40ed3227b56359079a15d5e26d6d1e7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 99, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Web"], "developers": ["Tombas Tomáš Basovník"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}