{"id": 13370, "slug": "red-rope-dont-fall-behind", "name": "Red Rope: Don't Fall Behind", "name_original": "Red Rope: Don't Fall Behind", "description": "<strong>Red Rope: Don’t Fall Behind</strong> is an allegorical local co-op game: the two protagonists are the archetypal couple, united by a rope that represents their bond.<br/>Their link has a double meaning: it surely is a restriction, a promise, a limit to their liberty, but it is also an alliance, a pact, a synergy. <br/>Without their link, the rope, they wouldn’t be able to survive the insidious labyrinth in which they move, they would be defenceless facing the macabre presences that torment them, they would be indiscernible from the roaming shadows they themselves sacrifice to strengthen their bond.<br/>The labyrinth is a cosmological representation, a mandala, where every area, every enemy, every value and every geometry has an intentional symbolic placement.<br/>What the players have to face is an initiatory journey in search of the key that opens the exit door.<br/>An arduous and difficult challenge, a cathartic ritual, that only the most valiant players will be able to carry out, players with a special elective affinity.<strong>Key Features:</strong><br/><ul><li>Play with a friend or try alone. It won’t be easy either way.<br/></li><li>You are trapped in a labyrinth: more than 100 hand-designed levels full of tension, action and mystery separate you from the exit.<br/></li><li>The rope is the only weapon at your disposal.<br/></li><li>Battle dozens of unpredictable enemies, learn their moves and plan yours. No tactics means death.<br/></li><li>Solve puzzles: carefully observe and exploit the many mechanisms.<br/></li><li>Discover a world packed with symbols to decipher and bizarre inhabitants.<br/></li><li>Defeat 4 minibosses and 5 bosses on the path to triumph.<br/></li><li>Climb the global chart but beware: every action has consequences.<br/></li><li>The game continues beyond the screen: communication and complicity are paramount.<br/></li><li>At least 10 hours of gameplay. Or 100 if you are not up to the challenge.<br/></li><li>A true hardcore experience: only a few will succeed.</li></ul>", "metacritic": null, "released": "2016-07-21", "tba": false, "updated": "2022-09-16T20:46:43", "background_image": "https://media.rawg.io/media/screenshots/d7a/d7a2868f795d3edfb0b8f7eb20963e67.jpg", "website": "http://www.fromyonder.net", "rating": 4.5, "rating_top": 5, "added_by_status": {"yet": 3, "owned": 41, "beaten": 2, "toplay": 1, "dropped": 3}, "playtime": 4, "achievements_count": 47, "ratings_count": 8, "suggestions_count": 126, "game_series_count": 0, "reviews_count": 8, "platforms": ["PC", "Linux", "macOS"], "developers": ["Yonder"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["IndieGala"], "esrb_rating": null}