{"id": 133932, "slug": "koru-bt", "name": "Koru BT", "name_original": "Koru BT", "description": "<p> Please support the game on Steam and vote on Greenlight.<br/>http://steamcommunity.com/sharedfiles/filedetails/?id=689057708</p><p>The natural world of the enlightened Tu-rama Forest serves as an intuitive connector to the Divine Spirit of Life, and as the characters develop their awareness, they learn to listen to nature's oracles and trust their inner gifts. Through the journey across the Kauwhanga, sacred passageway, the characters enter the magical world of intuition and imagination, where they find the empowering answers to their quest, gaining wisdom, confidence and hope. </p><p>The journey will take the characters across a mythological and imagined world of primeval New Zealand (Aotearoa),an imaginary Aoturoa - land of light, from the southern fjordlands of Te-Anau to the extreme point of the north island Cape Reinga, The Leaping Place of Spirits, where the spirits bid farewell to the enduring world, and where death and life annihilate into the eternal flow of being. The landscapes change dramatically and reality itself shifts when last expected: the characters will develop the ability to sense when the ground is about to transform and act accordingly. They will learn to listen and to take swift decisions against the forces of Whe-uriuri, the darkness that is devouring their world. </p><p>The main characters, Tane and Korihi will develop the necessary awareness to choose, fight and free their people from Whiro, the hatana - satanic tyrant who is reducing their people in slavery. Tane and Korihi belong to the Patupaiarehe people, a colored fair-skinned mythical beings of human form, and live in the Whakarewa Valley - the floating valley at the centre of the Tu-rama Forest: a volcanic valley where the magnetic energies of the soil and its secrets, allow entire islands and rocks and hills to float above this green and fertile valley.</p>", "metacritic": null, "released": "2015-09-21", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/680/68050870f9e073074636a30007450a7d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 275, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Fellowplayer"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}