{"id": 133925, "slug": "travelling-to-dover-simulator-2016", "name": "Travelling to Dover Simulator 2016", "name_original": "Travelling to Dover Simulator 2016", "description": "<p>This game is made for the Great British Summer Jam 2016, and my first real game I've made (apart from little dabbles in RPGMaker), and the first thing I have made using Inform7, which does take some getting used to. I was inspired to make this after hearing about the awful delays holiday makers had this year when travelling to Dover, and who in Britain hasn't had a holiday either ruined, or almost ruined, but our terrible traffic? It may not be what you'd stereotypically think as British, but it's an institution (even if it is an unwanted one).<br/><br/>I hope you have \"fun\" (this game is a traffic simulator, 'fun' isn't really the aim of the game).<br/><br/>The game itself is more of an artsy game, in the sense that in real life you can't clear traffic (unless you're one of those super important people) so you just have to hope everything turns out all right. In terms of game balance, it should be pretty close each time, but it IS possible to \"win\".</p><p>You can interact with things in the car, although not too abstractly; unfortunately I didn't have enough time to sit down and think of everything under the sun that you can do with objects. Use, Touch, Drink, and Eat are the main options you have. You even have a radio you could 'turn on'. If worse comes to worse, you can just wait for an hour and half and hope for the best...<br/></p><p>Anyway, thank you again for trying out my game! Any feedback is welcome! : )</p>", "metacritic": null, "released": "2016-08-17", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/77d/77ded9eb967152fa51a6b5d9fc556e6b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 26, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Valkyrie-Lemons"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}