{"id": 13402, "slug": "cars-2-the-video-game", "name": "Disney•Pixar Cars 2: The Video Game", "name_original": "Disney•Pixar Cars 2: The Video Game", "description": "<p>Inspired by the Disney•Pixar animated film, Cars 2: The Video Game lets players jump into the Cars 2 universe with some of their favorite Cars personalities in exotic locations around the globe.<br />\nContinuing the storyline from the upcoming film, players can choose to play as Mater and Lightning McQueen, as well as some brand new characters, as they train in the international training center - CHROME (Command Headquarters for Recon Operations and Motorized Espionage) to become world-class spies. They’ll take on dangerous missions, compete to become the fastest racecar in the world, or use their spy skills in exciting, action-packed combat racing and battle arenas. Players can race against friends and family in either single or multiplayer modes with up to four players to unlock challenging new tracks, characters, events and thrilling spy missions. The DS version will also include exclusive global locations not seen in the film.<br />\nGame Features:<br />\nCars 2: The Video Game introduces the international training center - CHROME (Command Headquarters for Recon Operations and Motorized Espionage) that expands upon the film storyline<br />\nChoose from more than 20 different characters, such as Mater, Lightning McQueen and the newly introduced Finn McMissile and Holley Shiftwell, and train to become world class spies<br />\nParticipate in simulated hazardous missions using high-tech gadgets to evade and impede adversaries<br />\nPerform maneuvers only Cars characters can do, such as backwards driving, air tricks, sidestepping to avoid obstacles, two wheel driving and more<br />\nConnect with World of Cars Online, a free-to-play browser-based virtual world based on the Cars universe, to gain rewards in the video game and then use them to unlock new items  in the virtual world</p>", "metacritic": 67, "released": "2011-06-21", "tba": false, "updated": "2023-11-09T14:43:05", "background_image": "https://media.rawg.io/media/games/62b/62baa570e57ff6d05386b93e71faae6a.jpg", "website": "http://games.disney.com/cars-2-video-game", "rating": 2.95, "rating_top": 3, "added_by_status": {"yet": 13, "owned": 107, "beaten": 22, "toplay": 5, "dropped": 9, "playing": 2}, "playtime": 1, "achievements_count": 0, "ratings_count": 19, "suggestions_count": 578, "game_series_count": 0, "reviews_count": 19, "platforms": ["PS Vita", "PSP", "PlayStation 3", "Xbox 360", "Wii", "Nintendo DS", "Nintendo 3DS", "macOS", "PC"], "developers": ["Sony Interactive Entertainment", "Disney Interactive Studios", "Avalanche Software"], "genres": ["Action", "Adventure", "Racing", "Arcade"], "publishers": ["Disney Interactive"], "esrb_rating": "Everyone"}