{"id": 13400, "slug": "princess-maker-2-refine", "name": "Princess Maker 2 Refine", "name_original": "Princess Maker 2 Refine", "description": "The star grants you the shining dream<br/><br/>The Heaven sends a Devil’s army to the ground, commanding them to destroy the corrupted city. It was the wandering knight who saved the city that was on verge of destruction. On one night, with the star so bright in the sky, the knight was guided outside by a mysterious voice. The voice that called to the knight was known as the God of a Star, and the God bestowed a pure girl in his care. From then on, the wandering knight decides to settle down in the city, and start a new life as a father of the girl. <br/><br/><br/><br/>Various Dreams, Unpredictable Future, but only one life.<br/><br/>「Princess Maker 2 Refine」is a life simulation game which you play as a father of a girl, who had descended from the star. You have 8 years to raise your daughter from age 10 to 18 – your daughter will grow into her adulthood through various experiences. The future awaits for her depending on your choices. What kind of future do you dream of creating with your beloved daughter?<br/><br/><br/><br/>Princess Maker 2 Refine comes back with all new Graphic / Voice over<br/><br/> [Princess Maker 2 refine] has been reborn with full colored high resolution graphics, noticeable upgrade compare to the original 1994 edition. In addition to the visual update, all characters have been given a full Japanese voice over, including your daughter. Experience a true masterpiece in full color and full voice over where wonderful life with your daughter awaits you.", "metacritic": null, "released": "2016-09-28", "tba": false, "updated": "2023-09-26T20:15:46", "background_image": "https://media.rawg.io/media/screenshots/bc5/bc519ff89ddc10c8893ae32f8cbdcf0d.jpg", "website": "http://www.cfk.kr/pm2rf", "rating": 4.18, "rating_top": 5, "added_by_status": {"yet": 5, "owned": 72, "beaten": 14, "toplay": 1, "dropped": 2}, "playtime": 5, "achievements_count": 88, "ratings_count": 16, "suggestions_count": 332, "game_series_count": 0, "reviews_count": 17, "platforms": ["PC"], "developers": ["CFK CO"], "genres": ["Simulation"], "publishers": ["CFK Co"], "esrb_rating": null}