{"id": 13404, "slug": "va-11-hall-a", "name": "VA-11 Hall-A: Cyberpunk Bartender Action", "name_original": "VA-11 Hall-A: Cyberpunk Bartender Action", "description": "<p>VA-11 HALL-A: Cyberpunk Bartender Action is a booze em&#39; up about waifus, technology, and post-dystopia life.<br />\nIn this world, corporations reign supreme, all human life is infected with nanomachines designed to oppress them, and the terrifying White Knights ensure that everyone obeys the laws.<br />\nBut, this is not about those people.<br />\nYou are a bartender at VA-11 HALL-A, affectionately nicknamed &quot;Valhalla.&quot; Although it is just a small bar downtown, it attracts the most fascinating people this side of dystopia. Keep your clients lubricated and you will be made privy to the most interesting stories.</p>\n<hr />\n<p>&quot;Although there aren&#39;t dialogue options, VA-11 HALL-A creates a storytelling experience that&#39;s grippingly personal. If, like many game theorists argue, story should always act as a supporter to mechanics, then VA-11 HALL-A is the exception that makes the rule.&quot; - Kill Screen<br />\n&quot;Never falls into the trap of simply alternating “gameplay” and “story” as so many narrative-based games do; rather, everything you do feels relevant to what is unfolding in front of you.&quot; - Moe Gamer<br />\n&quot;It&#39;s through these brief, unguarded conversations that the cyberpunk bartending sim slowly unfolds its story; not of a dystopian world, but of the people living in it.&quot; - PC Gamer</p>\n<hr />\n<p>Learn about daily life in the cyberpunk dystopia of Glitch City.<br />\nA branching storyline where your decisions do not depend on traditional choices, but through the drinks you prepare.<br />\nVisuals inspired by old Japanese adventure games for the PC-98, with a modern touch for an otherworldly experience.<br />\nGet to know your clients, their tastes, and prepare the drink that will change their lives.</p>", "metacritic": 81, "released": "2016-06-21", "tba": false, "updated": "2024-04-21T22:58:37", "background_image": "https://media.rawg.io/media/games/c57/c57c9f8ea28b148cf991ac49c1e920f4.jpg", "website": "http://waifubartending.com", "rating": 4.37, "rating_top": 5, "added_by_status": {"yet": 163, "owned": 1358, "beaten": 330, "toplay": 147, "dropped": 108, "playing": 85}, "playtime": 5, "achievements_count": 160, "ratings_count": 424, "suggestions_count": 277, "game_series_count": 0, "reviews_count": 435, "platforms": ["Nintendo Switch", "PC", "macOS", "Linux", "PlayStation 4", "PS Vita"], "developers": ["Sukeban Games", "Ysbryd Games Worldwide", "Wolfgame"], "genres": ["Adventure", "Simulation"], "publishers": ["Ysbryd Games", "Limited Run Games"], "esrb_rating": "Mature"}