{"id": 134159, "slug": "fuzzy-road", "name": "Fuzzy Road", "name_original": "Fuzzy Road", "description": "<p><strong>FUZZY ROAD</strong></p><p>After an apocalypse caused by a global cotton famine wipes off 90% of the population, the strongest warriors will compete for the last resources available. The competition is called \"Ricochet Rally\" and is held only once a year. Who will grab the grand prize and who will be needing stitches will be determined on… The FUZZY ROAD!</p><p>Fuzzy Road is a third person multiplayer vehicular combat demolition game in which players battle each other with armored/weaponized vehicles. The weapons attached to these vehicles are used to destroy enemy players. Bonus items include a bomb pick up, a shield power up, and a health power up which are placed throughout the map for players to grab and enhance their battle amongst other competitors</p><p>HOW TO PLAY</p><ul><li>Press square to select buttons in the main menu (analog to cycle through)</li> <li>Choose vehicle (square to initiate vehicle choosing and square again to pick a specific vehicle. Analog to cycle through) </li> <li>Once selections have been made game will begin shortly once player 1 has selected the \"Begin\" button in the character selection screen. (square)</li> <li>Once \"GO!\" has appeared on screen, move your vehicle with the left joystick on your controller. Move up to proceed forward, move down to reverse. </li> <li>Fire at enemies with the \"Square\" button.</li> <li>One kill is 1 point, one flag capture is 3 points.</li> <li>Flags can be planted at any base</li> <li>Players respawn at bases</li> <li>Person with the most points at the end of the timer wins the match.</li></ul><p>REQUIRES PS4 CONTROLLER</p>", "metacritic": null, "released": "2016-05-04", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/b60/b60766b297b8b286b4e042fe4fe66deb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 152, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["leopold"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}