{"id": 13422, "slug": "signs-of-life", "name": "Signs of Life", "name_original": "Signs of Life", "description": "Signs of Life is a sci-fi survival sandbox platformer with a combination of procedurally generated and hand-crafted content. You'll explore mysterious locations, Mine blocks for resources, and meet strange (and some familiar) creatures, some of which don't even want to kill you and eat your corpse. Along the way, you'll be able to craft armor, weapons, gadgets and more to assist you in surviving in an inhospitable environment.StorySensing that an apocalyptic war was imminent, the United Nations executed a last ditch plan to save what they could of the human race. 2 crafts were launched, a massive colony ship called the Hephaestus and a smaller, faster scout ship called the Hermes. The destination was a recently discovered earth-like planet with the potential to harbor life located roughly 18 light years away. The Hermes reached the planet first in order to establish a presence in anticipation of the arrival of the Hephaestus.<br/><br/>4 years later, as the Hephaestus approached its destination a faint signal was detected from a nearby asteroid. Against their better judgement, the crew of the Hephaestus decided to investigate, and in doing so set in motion a chain of events that would ultimately lead to their destruction. <br/><br/>The good news is, you managed to survive by hitching a ride on a small escape pod just in the nick of time. The bad news is, everyone you knew and loved is dead, you have nothing but the clothes on your back, a standard issue multi-function wrist laser and a faulty artificial intelligence companion named AGIS. Oh, and the human race is probably doomed. <br/><br/>Probably.Features<ul><li>An expansive world with procedurally generated and hand-crafted content.<br/></li><li>Online Co-Op Multiplayer<br/></li><li>A bunch of weird alien creatures.<br/></li><li>Some familiar creatures.<br/></li><li>Chickens.<br/></li><li>Mining, hunting, gathering.<br/></li><li>Gobs of ores, materials and animal organs you can use to...<br/></li><li>Craft all kinds of weapons, armor, gadgets, furniture, etc. <br/></li><li>A bit of story and lore to hold the whole thing together.<br/></li><li>Eggs.<br/></li><li>All spiritual content in this game has been assessed by Dr. Halamkah, advisor to the stars.</li></ul>Current State of DevelopmentSigns of Life is currently in Alpha. We feel like we've put together a fun, satisfying experience that will allow us to get wider feedback while we complete the rest of the game.<br/><br/>Right now our first priority is making sure that the content we have in-game is as bug-free, balanced, polished and fun as possible based on feedback from you folks. We have a significant prologue/tutorial planned, as well as significant content beyond what is currently playable, so the sooner you get involved the more of an effect you'll have on the final game.  We deal in hard science, and in working very closely with our personal science advisor at Sweet Dog Studios, that tends to lead to results.<br/><br/>We are still very much in development, and we would like you to join us in shaping the game from here on out. Your feedback is vital to us, so don't be shy =)Caveats/Issues<ul><li>Some sound effects are missing, but we are actively working on filling them in.</li></ul>", "metacritic": null, "released": "2014-01-27", "tba": false, "updated": "2019-09-17T11:52:51", "background_image": "https://media.rawg.io/media/screenshots/c64/c64b182fb1d0e90f1fa5451bd4fe5df4.jpg", "website": "http://www.playsignsoflife.com", "rating": 3.17, "rating_top": 3, "added_by_status": {"yet": 7, "owned": 130, "beaten": 1, "toplay": 3, "dropped": 1, "playing": 1}, "playtime": 3, "achievements_count": 14, "ratings_count": 6, "suggestions_count": 334, "game_series_count": 0, "reviews_count": 6, "platforms": ["Linux", "PC"], "developers": ["Sweet Dog Studios"], "genres": ["Action", "Adventure", "RPG", "Casual", "Indie"], "publishers": ["Sweet Dog Studios"], "esrb_rating": null}