{"id": 134347, "slug": "wayward-balloon", "name": "Wayward Balloon", "name_original": "Wayward Balloon", "description": "<p>For the latest version download version 2.5. </p><p>A game by Angelica Anatra</p><p>Have you ever wondered what happens to lost balloons? </p><p>Story Summary: </p><p>Celeste had recently played a trick on her father Zephyros during an important ceremony in front of the entire court. She hid a whoopee cushion she found in the human world under the pillow laid upon his throne. Zephyros, knowing full well Celeste, his most mischievous child, was responsible decided to teach her a lesson. Later that day he told her that Aura who sin are cursed to become horrible ugly monsters who plague the land of the humans and unless Celeste can commit 1,000,000 acts of true kindness before her next birthday she was destined to become a monster. What he neglected to tell her was that only the worst of sins can taint the soul of an Aura. </p><p>The next day while Celeste was fretting on her favorite cloud she met Red Balloon, a balloon from the human world. Red tells her he has been separated from the child he was destined to guard for all eternity. He wants to search for her but he has one major problem, he can't move on his own. Since Celeste needs 1,000,000 acts of true kindness to break her curse she decides to help Red get safely back to his child.</p><p>Creative Journey:</p><p>Wayward Balloon started from an idea I had while watching a commercial with a balloon in it. I thought to myself, what happens to balloons after they float away? That's when I created the first version of Wayward Balloon. I really wanted this game to feel like a living painting with a touch of <em>Flappy Bird</em>. I love watercolors so I decided to make the art using a watercolor technique. I think the imagery of watercolor fits nicely with the concept of wind. I came up with a unique movement mechanic for this game which uses physics to apply a force to the balloon depending on the rotation of the sprite connected to it. This mechanic is one of my most original and unique mechanics out of all the games I've made to date. I also didn't have much of a story developed for my first version of this game. Originally the balloon was being guided by a goddess of wind who wanted to help children who lost their balloons. Now the characters and the story are a lot more developed and I hope to add some narrative to the game in future iterations. </p><p>Refinement Journey Description: </p><p>Wayward Balloon was the first game I ever made. When given the choice to refine one of my old projects for a two week game jam at The New York Film Academy I decided to choose Wayward Balloon because of the unique movement mechanic. I also knew I could make this game look and feel a lot better now that I am more experienced. For the second version I decided to revamp the level design to make it more dynamic and engaging with the unique movement mechanic. Before the level felt very linear and I wanted to force players to really have to move around. I also wanted to give the graphic design a little more depth and life to it. I fixed the color of the trees to add depth, added hills for height, fixed the motion parallax for a better feel for movement, and added some more obstacles for content. I adjusted the color palette to give the game more warmth. </p><p> I really focused on the gameplay and the player feedback in this version. The most common feedback I received from play testers was that they needed more feedback from the game. They also didn't seem to understand the shield mechanic I had in place. I tried to make this more clear by adding a particle effect when you lose a shield. I also tried to organize the level in a way that would teach the player how to play as they played. This game has come a long way from the first version and still has a lot of potential to be an even greater game. I hope to work on Wayward Balloon some more in the future. </p><p>Controls:</p><p>Use the mouse to move around the balloon and the left mouse button to apply a force towards the direction you want the balloon to move. </p><p>Credits:</p><p>Amazing music by (and special thanks to) Lionel Cohen</p><p>http://www.lionelcohen.com<br/></p>", "metacritic": null, "released": "2016-11-23", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/94a/94a14b578a0fd5c999d11999bcb0d6c6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 266, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Angelica Anatra"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}