{"id": 134341, "slug": "meromy-abandoned", "name": "Meromy (Abandoned)", "name_original": "Meromy (Abandoned)", "description": "<p>Meromy was initially inspired by anomic aphasia, a mental disorder where the brain's ability to connect language with concepts makes it difficult to remember names. The idea that you could be perfectly aware and intelligent but unable to find the words to communicate fascinated and horrified me. We've all experienced being unable to find the right word on occasion; extrapolating that was unsettling.</p><p><strong>Playing the game</strong></p><p>The controls are simple: click where you want to go and the character ( represented by a rectangle in the prototype) will walk there. I spent some effort getting the movement to feel the way I wanted it. I was into one-button interfaces and trying to find concepts that would work well in the then-hot mobile market, so I designed it with that in mind.</p><p>I didn't want the character's walking speed to be the thing that slowed you down, so I used a lerping speed adjustment. Eventually, the plan was to replace the box with a character that used a dynamic walk cycle to match the speed.</p><p>The original plan was to have NPCs in the world who would task you with finding specific objects. As you walk through the mostly featureless world, you'll see boxes fall and land on the ground. These are the quest objects. The plan was to use a large library of object silhouettes.</p><p>When you click on one of the boxes, the name-selection interface pops up. Hold the button down and drag the cursor to the word you think is the correct name. The basic idea is that the correct name will run away from the cursor while the random words, pulled from a list of hundreds of thousands of nouns, will be attracted to it. Whatever name gets picked will be what that object is called from now on.</p><p>As the game continues, the idea was that it would be gradually more difficult to remember the assigned names. The NPCs would use the assigned name and giving them the wrong object would make them glitch and start swapping other words. Eventually, the background art and silhouettes would start glitching too.</p><p><strong>Postmortem</strong></p><p>In the end, the only parts that got implemented were the character's movement and the name picking. </p><p>The name picking turned out rather well. I really like the obscure randomness of the words it finds. I've used a little bit of this on other procedural generation projects, but looking this over again makes me think I should revisit that concept. There's a number of tools and APIs that can be used to get more semantic meaning out of random words. Exploring that is right up my alley.</p><p>I also like the look of the game, given its unfinished state. Obviously, it needs a lot more polish to really nail it, but the concept of cut-out animation viewed through dirty magnifying lenses in a dusty space is fairly striking. </p><p>The typography on the title worked out nicely too. If you do nothing else, just load the game up and walk to one side. That's something I'll probably revisit in a future project. I love the look of parallax and with more sophisticated camera shaders there's some nice tricks I can do next time.</p><p><strong>Why I stopped working on it</strong></p><p>One of the things that pushed me away from working on the project was discussion with people who have been affected by aphasia. Talking with actual patients made it clear that the mechanics I was trying to implement didn't feel to them like the disorder they were dealing with. After those conversations it felt disrespectful to use the aphasia label, which eliminated part of my motivation for making it. <br/></p><p>I kept working on the project for a bit under the new name of Meromy. In the end, other personal tragedies killed the rest of my interest in the project. There's still some good ideas in there, and I really liked playing with the random word selection, but these days I've got other things that I'd much rather spend my time making.</p>", "metacritic": null, "released": "2016-06-22", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/aa5/aa5b5113c863ec3a977bacf97e5541ab.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 40, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ikarth"], "genres": [], "publishers": [], "esrb_rating": null}