{"id": 134345, "slug": "scream-house", "name": "Scream House", "name_original": "Scream House", "description": "<p>You play as The Scarer in a Haunted House during a Halloween event. Your goal is to bring up the visitors' Scare Meter to as close to maximum as possible and Scare them! Beware however, if you scare them too early, the vistors' spotted you, or if you touch the visitors, they will consider you unprofessional and leave... leaving you no points!<br/></p>\n<p>If you don't scare them when their Scare Meter fill up completely, they will suffer a heart attack and faint. Your goal is to get as high a score as possible!</p>\n<p>Build the thrill-seekers Scare Meters by being near them (indicated by the circle around you)... and press SPACE to scream when the bar becomes green.</p>\n<p>The fuller the bar, the more points you reap. Being nearer to them when you scream also multiplies the amount of points you get!</p>\n<p>Chain combos to beat other people's high scores, which are saved in your own computer!</p>\n<p>The game uses W, A, S, D on the keyboard as directional controls and Spacebar as the Scream button.</p>\n<p>Link to Theme</p>\n<p>Taking the theme of Close Enough in terms of physical space and temporal time, we set a game in which player have to make use of special element and timing to score as high as possible.</p>\n<p>As for making a game set during Halloween was given that we are currently at the month of December, Halloween feels like it was the \"close enough\" holiday that we had just celebrated before everyone switches to Christmas mood for the rest of the year.</p>\n<p>TL:DR: WASD to move, SPACE to scream, build their fear by being near but DONT TOUCH THEM</p>\n<p>Group Name: Hex</p>\n<p>Members: Merlin Cheng, Baron Chan</p>\n<p>Source Code - https://github.com/Dartteon/scream-house.git</p>", "metacritic": null, "released": "2016-12-03", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/d94/d94a0969b4a943682b7683f828e3a5bd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 70, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Dartteon"], "genres": ["Action"], "publishers": [], "esrb_rating": null}