{"id": 134414, "slug": "michi", "name": "MICHI (itch)", "name_original": "MICHI (itch)", "description": "<p>“Michi, your training is now complete. If you kill these seven people, I will let you go.”</p>\n<p>The Masters words echoed in Michis head.</p>\n<p>It's early evening and the city is still buzzing with life. If one happened to look up at the right moment, one could see a silhouette of a person clad in dark clothes and a white bandana standing on a rooftop. Soon, without anyone of the people knowing, something will happen. Some would call it a tragedy, others would see it as an act of justice. This person, standing alone and observing the lives of the unsuspecting people, is Michi, an orphan sold into the service of a ninja academy in 16th century Japan. What will become of the orphan? Will Michi become free? </p>\n<p>“The time has finally come, the time when I can become free. Seven targets. Seven people in my way of freedom.”</p>\n<p><strong>Sequence of play</strong><br/></p>\n<p>The objective of the game is to assassinate the given targets without raising too much suspicion. As a side quest you can also collect letters in order to gain a better ending. </p>\n<p>The game is a side-scrolling platformer. The player stays on the rooftops of the houses and all the enemies and mobs stay on the ground level, which the player can’t access. </p>\n<p>There are different weapons, a firecracker and a kunai. The player can strategize which weapons to use in order to raise the suspicion bar as little as possible. When the player wants to use a weapon, he/she has to time it correctly based on an arrow that swings back and forth in a 180° motion and will appear under the player.</p>\n<p>After the first level you will have risen the attention of a competing ninja academy and there will be enemies that try to kill you. </p>\n<p>At the end of the game there is different outcomes for the main character depending on how many letters you have collected.</p>", "metacritic": null, "released": "2018-05-22", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/ac2/ac2b0e4ebd7ddbbbd0e964d124d16a24.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 38, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["joloyolo"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}