{"id": 13441, "slug": "vidar", "name": "Vidar", "name_original": "Vidar", "description": "Vidar is DyingIn the middle of a blizzard, a community's remaining citizens are forced to confront their impending deaths. Every night, a villager is killed, and the survivors are forced to alter their course in response. Chart a path through always-changing, challenging environmental puzzles, and explore the stories and grief of these townsfolk before Vidar is lost forever.A Random Story Every TimeIn Vidar, every villager has heavily interdependent relationships with the others. When one person dies, everyone else’s stories change - if the blacksmith loses her apprentice, she’ll give you different quests; if the blacksmith loses her supplier, still different; and if she predeceases both, then those two will respond accordingly, etc. Because the order of deaths is random, the story and quests you receive will be different every time you play.New Challenges to OvercomeTo stop the killings you’ll need to enter a puzzle dungeon. Use your tools and your environment to help navigate to the center of the cave before everyone in town is dead. These puzzles are also randomly chosen from a bank of hundreds, so that when you come back to see a new story unfold, you’ll also face a new challenge.<br/><br/><br/>Key Features<ul><li>Explore themes of grief, community, nostalgia, loss<br/></li><li>Quests, rewards, and story determined by who lives and who dies<br/></li><li>Town events reflect the state of Vidar, as jobs go untended<br/></li><li>Four unique puzzle biomes, each with new takes on classic mechanics</li></ul>", "metacritic": null, "released": "2017-01-31", "tba": false, "updated": "2019-08-28T22:12:42", "background_image": "https://media.rawg.io/media/screenshots/204/20473ea6fc1988369c9147edcdca9b0f.jpg", "website": "http://www.vidarthegame.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 29, "toplay": 1}, "playtime": 4, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 147, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Razbury Games"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["Razbury Games"], "esrb_rating": null}