{"id": 134508, "slug": "doombringer", "name": "DOOMBRINGER (itch)", "name_original": "DOOMBRINGER (itch)", "description": "What is Doombringer?\r\n<p>Doombringer is a game project aimed to create a single player game experience with inspirations taken from (though not exclusively) predominantly two sources of previous games. Quake Live and Doom 2.</p>\n<p>The game aims to be an amalgamation of the best things from both games, thus creating a chaotic and crazy, but most importantly of all, FUN action/strategy FPS game.</p>\r\nDoom 2?\r\n<p>Doom 2 is by my (Kristus) opinion, by far the pinnacle of Single player FPS gaming ever created. While the game is very simple in it’s presentation, this simplicity allows the game to be very skillful in it’s execution. The beastiary of enemies create a lot of variation of game play possibilities, and the straight forward weapons that all add their own usefulness creates a toolbox for the player to find ways to overcome the odds set out by the game, or level designer.</p>\n<p>The movement speed being fast and by a lot of players likened to rollerblading allows the player to move through the map based on what he or she wants to do, rather than what the game tells them to do.</p>\n<p>This is the kind of philosophy I want to bring into making Doombringer into a new great single player experience. Monsters will have attacks that are simple enough that you know why you are damaged. But also potent enough that they are dangerous for you.</p>\r\nQuake Live?\r\n<p>Quake live is a game that shares a lot of the strengths of Doom 2, though taking them in a different direction.</p>\n<p>Weapons are simple, but potent and complete each other as a useful toolbox for the player.\r\nThe way the armors work is more intuitive to players coming into the game, and the game play in competitive multiplayer is more strategic than most other FPS games.</p>\n<p>The way the additional weapons, like lightning shaft and rail works with the toolbox adds a lot of exciting possibilities for the player in a potential single player setting as well.</p>\r\nMovement in maps\r\n<p>Movement in games like Doom and Quake are all very important. There are a lot of variations to this. Where you have different methods of speeding up your character in Doom, as you do in the different Quake games. The ways to do this differ from game to game. Which offers a cornucopia different styles of movement.</p>\n<p>The movement system in Doombringer is based on action. Where you got a lot of freedom to move, not at all the most difficult to use. But it’s fast, like Doom 2, slightly complex, like Quake Live and Doom 2.</p>\n<p> </p>\n<strong>Credits</strong>\n<p>Doombringer is made by:</p>\r\nKristian ‘Kristus’ Käll\r\n<p>Project director.\r\nArt and Design.\r\nProgramming.\r\nLevel design.</p>\r\nMatthew ‘Mtrop’ Tropiano\r\n<p>Sound design.</p>\r\nCarson ‘Kronosaurus’ Stacy\r\n<p>Programming.</p>\n<p>Former members:</p>\r\nAndrew Apted\r\n<p>Former Lead Programming.</p>\r\nNon original maps by:\r\n<p>Toxicity is used with permission by the author, made by\r\nAlexander ‘thefury’ Mader</p>\n<p>Fuse is used with permission under GPL, made by\r\nFerdinand ‘cityy’ List</p>\n<p>Aerowalk is a recreation of Aerowalk Remix. Copyright: Preacher.\r\nNot used with permission.</p>\r\nWith help from:\r\n<p>CrazyAl – Administration and community assistance </p>\n<p>GMT – Administration and community assistance </p>\n<p>Primeval – Menu Music </p>\n<p>shpuld – Programming help. </p>\n<p>Forest Hale – Technical advice. </p>\n<p>People in #qc at irc.anynet.org – Programming help.</p>", "metacritic": null, "released": "2018-06-26", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/3a3/3a39365d93b891462d040a7b4d45c255.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 198, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Kristus"], "genres": ["Action"], "publishers": [], "esrb_rating": null}