{"id": 134501, "slug": "procedure-itch-whaleplanestudios", "name": "PROCEDURE (itch) (WhaleplaneStudios)", "name_original": "PROCEDURE (itch) (WhaleplaneStudios)", "description": "<p><strong>INTRO</strong></p>A robot awakens. He has no idea who or what he is, or why he is there. Suddenly, he starts moving forward. He knows he can jump, so he jumps over something in front of him that looks very dangerous. He passes through a blue square, and feels a weird electrical tingle. Is it a sense of accomplishment? He then sees a pillar in front of him, so he temporarily stops hovering to skid under the pillar. He does not know when, or if, this pattern will end, but he does know that he must jump and duck. <p><strong>GAMEPLAY</strong></p>PROCEDURE is a game about jumping and ducking. As you jump and duck, obstacles will continue to be endlessly generated. The more obstacles you pass, the faster the level will become. The faster the level becomes, the harder it is for you to pass these obstacles. Compete for the highest score in three difficulty modes in this easy to learn but hard to master endless platformer. <p><strong>DEVELOPMENT</strong></p>Developed by only two brothers; one creating the game and the other creating the music,PROCEDURE was meant to have simple gameplay. The goal is to have as many people as possible catch onto the gameplay easily, while still providing an infinite challenge to any and all gamers. The game was developed using Unreal Engine 4, and if the game ever makes it on Steam, anyone who has bought it externally will receive a free Steam Key. An OSX and Linux version is also currently in development.<p><em>Visit http://www.whaleplanestudios.net/procedure for more information!</em><br/></p><p><strong>MINIMUM REQUIREMENTS</strong></p>CPU: 2.4 Ghz <br/>RAM: 2GB <br/>GPU: DirectX 10 capable <br/>VRAM: 512MB <br/>HARD DRIVE: 900MB<p><strong>RECOMMENDED REQUIREMENTS</strong></p>CPU: Intel i5 3rd Gen or AMD Equivalent <br/>RAM: 4GB <br/>GPU: GTX 660 or Radeon 7870 <br/>VRAM: 1GB <br/>HARD DRIVE: 900MB", "metacritic": null, "released": "2015-10-18", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/cfd/cfdd75b210eeb228b76596e8f171f95a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 59, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["WhaleplaneStudios"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}