{"id": 13450, "slug": "perpetuum", "name": "Perpetuum", "name_original": "Perpetuum", "description": "Main Features<br/><ul><li><strong>No Monthly Fees</strong> – Buy once, play forever. Enjoy a constantly evolving world with periodic feature upgrades.<br/></li><li><strong>Sci-Fi Setting</strong> – Perpetuum is set in a unique sci-fi environment inhabited by robots and alien technology.<br/></li><li><strong>Persistent Game World</strong> – Perpetuum features a large, persistent, single shard online game world. Players all play on the same server together. Changes made to the game world by players are permanent.<br/></li><li><strong>Industry</strong> – Perpetuum features a complex, multi-tier industrial system that enables players to have both small and large scale industrial operations.<br/></li><li><strong>Economy</strong> – The economy is completely player driven. Other than basic items, everything on the market is manufactured by players, the prices dictated by supply and demand.<br/></li><li><strong>Player-Built Infrastructure</strong> – Players are able to raise their own settlements in the unoccupied areas of the Perpetuum world, where they are able to enforce their own rules as they see fit.<br/></li><li><strong>Terraforming</strong> – Players are able to form the world of Nia as they see fit to aid their goals. The terrain can be raised or lowered in certain areas and thus settlements can be protected by intricate strongholds, and temporary shelters can be created in the heat of battle to protect vulnerable allies. It's all up to the player's imagination.<br/></li><li><strong>Character Progression</strong> – Time-based character progression requires no grind and provides a level playing field for casual and hardcore players alike.<br/></li><li><strong>Large Scale PvP</strong> – Players are able to clash in huge battles for control of territory and resources. Formable terrain, destructible scenery and player built infrastructure all play key roles in the course of war.<br/></li><li><strong>High Customizability</strong> – Players of Perpetuum have a large number of ways to customize their robots for the various goals they strive towards.<br/></li><li><strong>Natural Processes</strong> – The Perpetuum game world always changes through natural processes. Destroyed plants grow back and spread, and outmined resources replenish over time.</li></ul>", "metacritic": null, "released": "2014-10-17", "tba": false, "updated": "2019-07-25T12:58:21", "background_image": "https://media.rawg.io/media/screenshots/b14/b14a0eed60e8e90dfd7b0d77bcc8d7cd.jpg", "website": "http://www.perpetuum-online.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 189}, "playtime": 4, "achievements_count": 34, "ratings_count": 2, "suggestions_count": 317, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Avatar Creations"], "genres": ["RPG", "Massively Multiplayer", "Indie"], "publishers": ["Avatar Creations"], "esrb_rating": null}