{"id": 134661, "slug": "egyptian-block-breaker", "name": "Egyptian Block Breaker", "name_original": "Egyptian Block Breaker", "description": "<p>Uncover the mysteries of Egypt and defeat Apophis, the Serpent of Chaos!<br/></p><p>This is an ancient Egyptian themed block breaker game, it has fairly standard mechanics but I think it has a good theme and atmosphere.</p><p>The game can be played in the browser (should work on all modern browsers) or as a Windows x86 application. To play the Windows version, download the EgyptianBlockBreaker_v1.0.zip file, extract the contents to a location, then run the EgyptianBlockBreaker_v1.0 executable.</p><p>Fair warning, the last level is a bit brutal, but there are plenty of extra lives to collect!</p><p>Have fun!</p><p>Credits:</p><p>Egyptian Block Breaker developed by Peter Gambell, licensed under Creative Commons Attribution-NonCommercial-ShareAlike 3.0 license<br/></p><p>Based on material in the Block Breaker section of the Complete Unity Developer course by Ben Tristem</p><p>Music:<br/>Mystery of the Dark Forest by Amaduesz Bartos, used under Creative Commons Attribution 3.0 license</p><p>Sound Effects:<br/>boink 0006.wav by davepape, used under Creative Commons 0 1.0 Universal license<br/>Rock-various hits.wav by ra_gun, used under Creative Commons 0 1.0 Universal license<br/>Bonfire Being Lit by samararaine, used under Creative Commons 0 1.0 Universal license<br/>Collected Item by limetoe, used under Creative Commons 0 1.0 Universal license<br/></p><p>Images:<br/>God Anubis sourced from inter-pix.com, image is Public Domain<br/> BD Weighing of the Heart.jpg, sourced from commons.wikimedia.org, image is Public Domain<br/>Ancient Egyptian Music and Dancing by Jan van der Crabben, used under Creative Commons Attribution-NonCommercial-ShareAlike 3.0 license<br/>Book of Gates Bardue of Ra.jpg sourced from commons.wikimedia.org, image is Public Domain<br/>SFEC 2009 POT-0010.JPG by S F-E-Cameron, used under Creative Commons Attribution-ShareAlike 3.0 license<br/> IN0L.jpg by André Fabié, sourced from egypte-eternelle.org, used under Creative Commons Attribution-NonCommercial-ShareAlike 2.0 license<br/></p><p>Font:<br/>JSL Ancient by Jeffrey S. Lee, Copyright (c) 1997 by Jeffrey S. Lee   <br/></p>", "metacritic": null, "released": "2016-08-12", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/f3b/f3befca7af360989ef1a98bd936ea75f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 166, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["petergambell"], "genres": [], "publishers": [], "esrb_rating": null}