{"id": 134629, "slug": "the-book-of-paradoxia-whispers", "name": "The Book of Paradoxia Whispers", "name_original": "The Book of Paradoxia Whispers", "description": "<p><em>The Book of Paradoxia Whispers - Developed by ThePCGamer101 using the RPG Maker MV Engine by KADOKAWA and published by Degica</em></p>Key Features :-<ul><li>A brand new indie game from the creators of 'Where's my Mom?' and 'The Story of a Ball named Ball'</li><li>A singleplayer story driven visual novel game</li><li>Listen to fantastic music by Greg Atkinson</li><li>For Mac Users, you can play the game also!</li><li>For the first time, Android users can play the game also!</li><li>Updates to polish the game and make it better</li><li>Best of all, it's FREE!</li></ul>Description :-<p>Long ago, in an unknown distant land, a book was written, a book that contained many secrets. That anyone, in any part of the globe, planet or galaxy can read, luring people into it's stories of other lives in other places. It can never be said when and where this book will end, it can take anyone into a whole world of possibilities, and one of them, is the key to the neverending story</p><p>Just remember, that Curiosity killed the Cat...</p><p>A digital adaptation of ThePCGamer's children's book 'The Book of Paradoxia Whispers'</p>Reviews and Comments :-<p>There are no reviews or comments yet :(</p>System Requirements :-<p>Minimum Specs:</p>Windows<ul><li>CPU Cores: Single Core</li><li>Processor: Intel Core2 Duo or better </li><li>Memory: 2 GB RAM </li><li>Graphics: DirectX 9/OpenGL 4.1 capable GPU </li><li>Storage: 1 GB available space </li><li>Additional Notes: 1280x768 or better Display</li><li>Operating System: Windows XP (32/64-bit). Windows Vista (32/64-bit). Windows 7 (32/64-bit). Windows 8/8.1 (32/64-bit). Windows 10 (32/64-bit).</li></ul><p><strong>RECOMMENDED: </strong><em>Graphics: OpenGL ES 2.0 hardware driver support required for WebGL acceleration. (AMD Catalyst 10.9, nVidia 358.50), iOS 8.0, Android 4.4.4*</em></p>Macintosh<ul><li>Processor: Intel Core2 Duo or better </li><li>Graphics: Compatible OpenGLR </li><li>Additional Notes: 1280x768 or better Display</li><li>Operating System: Mac OS X 10.10 or later.</li></ul><p>PLEASE NOTE: <em>The Macintosh version has not been properly tested because the original game was developed on a Windows PC and not a Macintosh computer, so you may experience compatibility issues!</em></p>Extras :- Soundtrack<p>The official soundtrack to the RPG Maker MV game The Book of Paradoxia Whispers, developed by ThePCGamer101 and published by CityMayor Games. Featuring music from RPG Maker MV and Greg Atkinson. You can download the OST for free from Bandcamp <em>(</em>www.citymayorgames.bandcamp.com/releases<em>)</em><br/></p>Extras :- Book<p>The official book to the RPG Maker MV game The Book of Paradoxia Whispers, developed by ThePCGamer101 and published by CityMayor Games. You can read the book for free from Wattpad <em>(</em>www.wattpad.com/user/ThePCGamer101<em>)</em></p>Extras :- Support<p>If you encounter technical problems with the game, you can contact our CMG Support Team by visiting CMG Support <em>(</em>www.citymayorgames.wix.com/cmgsupport<em>)</em></p>Extras :- Other Games<p>If you enjoyed The Book of Paradoxia Whispers, then why not visit CityMayor Games and play the other games developed by ThePCGamer101 and his one-man indie company CityMayor Games <em>(</em>www.citymayorgames.wix.com/home<em>)</em></p>Content Rating :-<p>The developer has provided the following content rating for this item:</p><p><strong>ALL AGES: </strong>Cartoon Violence, Mild Fantasy Violence, Mild Language</p><p><em>The Book of Paradoxia Whispers - (C) CityMayor Games</em></p><p><em>RPG Maker MV - (C) KADOKAWA and Degica</em></p>Licence :-<p>Game/App EULA</p><p>You may not modify or redistribute this content</p>", "metacritic": null, "released": "2017-01-04", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/20a/20af53ca545c44f6c85867a306f16ee3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 111, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["CityMayor Games"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}