{"id": 13464, "slug": "locks-quest", "name": "Lock's Quest", "name_original": "Lock's Quest", "description": "<p>Build defenses and battle against the Clockwork horde in the next generation remake of the critically acclaimed 2008 Nintendo DS title, Lock’s Quest! You play as Lock, a boy who stumbles upon an invasion of his Village, which triggers a wider war between Kingdom Force and a revived Clockwork Army, led by the nefarious Lord Agony. A gripping story unfolds as you progress through 75 Days of warfare, across a dozen unique maps, aided by a collection of turrets, traps and special attacks. Experience the game as it was meant to be, with a high-quality soundtrack, new high resolution portraits, and revised gameplay with support for both Keyboard / Mouse and Gamepad!<br />\nPlace Kingdom Force units to defend your capitol in a brand new Endless Mode - Antonia Defense!<br />\nBuild up your fortifications each day to defend against a timed Clockwork assault. Use dozens of Turrets, Traps and Helpers to stop the advance.<br />\nFight alongside your defenses, using context sensitive Special Attacks, and devastating Super Attacks, which impact a wide range of enemies.<br />\nUnlock the secrets of Kingdom Force and the Archineers via an engrossing story with a multi character cast, told via hand drawn cinematics and cutscenes.<br />\nRemaster Features:<br />\nAll music remastered in high definition, with orchestrated introduction and ending<br />\nPlayer controls remapped for keyboard/mouse and gamepad input<br />\nCute pixel characters and maps brilliantly enhanced in high resolution, a new revamped User Interface, customized for increased PC and consoles resolution, including all new GUI Art.<br />\nBrand new Antonia Defense Battles featuring a new map<br />\nNew progression system automatically unlocks new turrets at specific story plot points<br />\nEndless Mode: Place Kingdom Force units to defend Antonia in this new and special mode</p>", "metacritic": null, "released": "2008-09-08", "tba": false, "updated": "2022-08-12T12:57:02", "background_image": "https://media.rawg.io/media/screenshots/bfd/bfd281101850dfe95af70ba9258d7430.jpg", "website": "https://handy-games.com/", "rating": 3.12, "rating_top": 3, "added_by_status": {"yet": 5, "owned": 102, "beaten": 2, "toplay": 5, "dropped": 4}, "playtime": 3, "achievements_count": 70, "ratings_count": 8, "suggestions_count": 430, "game_series_count": 0, "reviews_count": 8, "platforms": ["PlayStation 4", "Nintendo DS", "Android", "iOS", "PC", "macOS", "Linux", "Xbox One"], "developers": ["THQ Nordic", "Handy Games", "5TH Cell", "Digital Continue"], "genres": ["Action", "Adventure", "RPG", "Strategy", "Indie"], "publishers": ["THQ Nordic", "THQ", "www.handy-games.com", "HandyGames"], "esrb_rating": null}