{"id": 13488, "slug": "lil-big-invasion", "name": "Lil Big Invasion", "name_original": "Lil Big Invasion", "description": "Those silly green guys got lost in tricky dungeons! Find them, keep them together and lure them with your light to the exit - a giant vacuum cleaner - in order to suck them back home. <br/><br/><br/><br/>Outsmart winds, spider webs and glowing flowers. Find secret paths and meet helpful creatures. Activate switches and win epic boss fights with the power of your light. But be aware that flying consumes light energy. So keep your light recharged, rescue those silly guys and become a firefly hero! <br/><br/>Plot<br/>You are a rescuer who has been trained since youth to protect these guys from getting lost in tricky dungeons. Sounds easy but trust me it's a hard job. Especially for an aged firefly like yourself. You've been sleeping for just one second and yep, they've invaded every dungeon. It's a 'Lil Big Invasion'. Now you have to remember your rescuer training and save those poor little creatures.<br/><br/>Compete<br/>After getting to know a dungeon you can try beating the clock and other players as well. Every dungeon in the main game has its own leaderboard. The quicker you get through the more points you will get. But be aware that the number of rescued guys counts as a multiplier. So make sure to catch them all when you go for that high score.<br/><br/>Leaderboards can be accessed from the overworld by clicking on the panel showing your points (Steam Overlay has to be enabled).<br/><br/>Features<br/><ul><li>Win 5 unique boss fights<br/></li><li>Explore 40 handcrafted dungeons<br/></li><li>Rescue over 400 crazy little creatures<br/></li><li>Throughout 5 different and exotic worlds<br/></li><li>Unique dungeon puzzle solving mechanics<br/></li><li>Charming but also challenging (100% challenge + bonus content)</li></ul>Input<br/>This game is designed for mouse input and touch devices running Windows 7, 8 or 10. Trackpads do work but are not recommended.<br/><br/>Note from the developer<br/>Hi, I'm the developer of \"Lil Big Invasion\". Creating this game was a lot of fun - especially the sound recording sessions :D But due to the fact that this is my first game there was a lot of frustration as well. I developed this game in my spare time and it took me about two years. I hope you will enjoy it :)<br/>", "metacritic": null, "released": "2016-08-04", "tba": false, "updated": "2019-08-28T22:12:40", "background_image": "https://media.rawg.io/media/screenshots/3ef/3efcea9222cc1c47470c34fba442c25e.jpg", "website": "http://andreas-britten.de/games/lbi/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 33, "toplay": 1}, "playtime": 4, "achievements_count": 45, "ratings_count": 0, "suggestions_count": 319, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Andreas Britten"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Andreas Britten"], "esrb_rating": null}