{"id": 134867, "slug": "super-key-world", "name": "Super Key World", "name_original": "Super Key World", "description": "<p><strong>Note: Currently, audio is working, but there is possible performance issues. The best experience with this game is one of the downloads.</strong></p>\n<p><strong>You have been cursed by a wizard!</strong> You probably should have given him his lawnmower back ages ago, to be honest. You kinda deserve it. Use the left and right arrow keys to move, well, left and right, press up or X to jump, and either down or C is a dash!</p>\n<p>Super Key World is a super short, retro-inspired platformer, made for the Watch + Jam, using Pixel Vision 8! The game is currently feature-complete, but with your feedback, the level and (especially) the music can change! Please tell me to fix the music. Please.<br/></p>\n<p><strong>Note:</strong> This game has not been tested on Linux or Mac. They should work fine, but...<br/></p>\n<p>Credits:<br/></p>\n<ul><li>Most of the game: Me! Anthony \"FurthestChunk\" Vernon!</li><li>Cave background texture: squaredotcube</li><li>Micro platformer code: Matt Hughson</li><li>macOS and sound-enabled WebGL builds, and also the person who made Pixel Vision 8: </li>Jesse Freeman<li>Playtesters: Cal Alaera, Martijn Wouterse, plus a few others I need to credit! Please contact me to tell me what you want to be credited as, if you helped test this mess! Within reason. Yes, that means you. You know who you are.</li></ul>", "metacritic": null, "released": "2018-07-08", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/093/093133e7f0b40bf555c4e014b64651fa.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 29, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Web"], "developers": ["FurthestChunk"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}