{"id": 1348, "slug": "bug-princess-2-black-label", "name": "Bug Princess 2 Black Label", "name_original": "Bug Princess 2 Black Label", "description": "≪ Game Overview ≫<br/>Introducing an alternate  version of the highly-rated series \"Bug Princess\"!<br/>Bringing \"\"Bug Princess 2 BLACK LABEL\"\" straight from the arcade!<br/>Major upgrade from \"\"Bug Princess 2\"!<br/>Featuring newly implemented \"\"GOD\"\" mode and ”BOSS RUSH MODE”!<br/><br/>≪ Full Version ≫<br/>● An alternate version of “Bug Princess 2”,<br/>the “BLACK LABEL” version can now be played <br/>on iPhone/iPod touch/iPad!<br/><br/>● Additional mode: \"BOSS RUSH MODE\"!<br/>You are going to battle bosses from \"Bug Princess\" and \"Bus Princess 2\".<br/>Test your skills in Grade Examination!<br/>Defeat the bosses and earn the highest grade!<br/>You can post your results on Twitter.<br/><br/>* Use of the additional mode is subject to additional fees.<br/>* With the purchase of the additional mode, you can  play unlimited times and save your progress.<br/>* If both \"Bug Princess\" and \"Bus Princess 2\" are installed in the same iPhone, you can play once a day for free.<br/><br/>● 3 different game modes with 4 levels of difficulty.<br/>Original Mode: Not too many bullets.<br/>Maniac Mode: Relatively large number of bullets.<br/>God Mode: Maximum bullets! Everything is out of the ordinary!<br/>Try all the game modes!<br/>You can choose from 4 difficulty levels: Novice, Normal, Hard, and Hell.<br/><br/>● A universal app with high resolution graphics!<br/><br/>● PRACTICE MODE is available for all game modes to help all players from beginners to veterans improve their skills. Brush up your skills and become the best shooter!<br/><br/>● \"\"Smart\"\" touchscreen controls<br/>Control is as intuitive as ever with touchscreen on your smartphone! You are now able to precisely move your character exactly where you want it!<br/><br/>● Compatible with Game Center! <br/>Online scoreboards and achievements are fully implemented!<br/>Scores are recorded for each modes and stages.<br/>Compete with players from around the world!<br/>Accomplish certain tasks within game to unlock achievements! Complete all achievements!<br/><br/>### Important ### : Please read the following before purchase.<br/>● Compatible with iPhone 3GS and later, iPod touch 3rd gen. and later, iPad (iOS 4.3 and later). Not compatible with any other devices.<br/>● This application uses a lot of memory. It may not run or may shutdown when there's not enough memory. Please see our support page for more details.<br/>● Enabling the zoom funtion in the accessibility settings may have undesired effects on gameplay.", "metacritic": null, "released": "2012-06-23", "tba": false, "updated": "2023-10-27T16:15:05", "background_image": "https://media.rawg.io/media/screenshots/192/1921a896deafc46f8e72a7da8acc0402.jpeg", "website": "http://www.cave.co.jp/en/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 368, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["CAVE CO.,LTD."], "genres": ["Action", "Arcade", "Casual"], "publishers": ["CAVE Co"], "esrb_rating": null}