{"id": 13487, "slug": "world-of-darkness-preludes-vampire-and-mage", "name": "World of Darkness Preludes: Vampire and Mage", "name_original": "World of Darkness Preludes: Vampire and Mage", "description": "<p>The classic roleplaying games Vampire: The Masquerade and Mage: The Ascension enter the digital present with a dual-pack of interactive fiction by a few of today’s most interesting fantasy writers.<br />\nVampire: The Masquerade: We Eat Blood And All Our Friends Are Dead is a chilling story written and illustrated by award- winning authors Zak Smith and Sarah Horrocks.<br />\nTold entirely from a mobile messaging perspective, We Eat Blood is a sharp, mature and often terrifying story about your first nights as unwilling predator and prey. Hunted by unknown enemies and driven by an alien hunger, will you sever your ties with the mortal world or try to cling to your former life? Will you join ancient conspiracies, or turn the tables on forces older than the written word? Terrible power lies within your grasp, but there is always a price to pay.<br />\n— The temptation is real.<br />\nSet in modern-day Sweden, Mage: The Ascension: Refuge by critically-acclaimed author Karin Tidbeck, lets you experience today&#39;s social and political upheavals while awakening to the power of True Magick - the ability to shape reality itself through your force of belief. Many will try to recruit you into a secret war where human consensus itself is the battlefield. Your actions and choices will have profound consequences on the world and people around you... assuming madness and paradox doesn&#39;t claim you first.<br />\n— Safety or sacrifice - the choice is yours.</p>", "metacritic": null, "released": "2017-02-15", "tba": false, "updated": "2023-03-25T09:02:07", "background_image": "https://media.rawg.io/media/games/cf8/cf8e40db4be6dc10896949a7b3b8db14.jpg", "website": "http://www.white-wolf.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 20, "beaten": 1, "toplay": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 4, "suggestions_count": 267, "game_series_count": 0, "reviews_count": 4, "platforms": ["macOS", "Linux", "PC"], "developers": ["4EversGames", "Fula Fisken", "White Wolf Entertainment"], "genres": ["Adventure", "RPG"], "publishers": ["White Wolf Entertainment"], "esrb_rating": null}