{"id": 134804, "slug": "just-in-time-for-christmas", "name": "Just in Time for Christmas", "name_original": "Just in Time for Christmas", "description": "<p><em>Just i</em><em>n Time For Christmas?</em> is a completely free indie adventure game made by the four hosts of The InRetroSpect Show.</p><p>It's an experiment in game design to try to better understand the creative process behind producing a PC game, and an attempt at trying to create a very different kind of Christmas title to those usually produced – your objective is to guide your character home, using nothing but audio to guide your path.</p><p>We'd love to hear what critics, bloggers, and YouTubers make of our experiment, do feel free to get in touch if you have any additional requests or questions.<br/></p><p>TrueType font display uses ALFont by Javier Gonzalez and the Freetype project. Distributed under the terms of the FreeType project license.</p><p>OGG player is alogg by Javier Gonzalez, using the Ogg Vorbis decoder, which is available from http://www.xiph.org/ Copyright (c) 2002-2008, Xiph.org Foundation</p><p>MP3 player is almp3, by Javier Gonzalez and the FreeAmp team. It uses the mpg123 MP3 decoder, and is distributed under the terms of the GNU Lesser General Public License version 2.1</p>CREDITS FOR IN TIME FOR CHRISTMAS<p>Kris Darby – Programming and Design<br/>Dan Frost – Art and Design<br/>Sam Turner – Sound and Design<br/>Peter Willington – Production and Design<br/>Jesse Lowther – Voice: Phineus – Jesselowther.com</p><p><em>In Time For Christmas</em> was made in Adventure Game Studio, and made extensive use of its excellent community. Casting of Phineus was made through the Voice Acting Alliance forums.</p>REVIEWS AND ARTICLES<p>We'll be linking to any and all reviews and articles about <em>In Time For Christmas?</em> right here on this page, regardless of the opinions expressed. We'd love to hear what critics, bloggers, and YouTubers make of our experiment, do feel free to get in touch if you have any additional requests or questions.</p>", "metacritic": null, "released": "2015-01-25", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/e46/e46bb94ff98bce63fd0013d127a48718.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 7, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["InRetroSpect"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}