{"id": 13481, "slug": "lumini", "name": "Lumini", "name_original": "Lumini", "description": "A long-forgotten species, a hostile planet and a journey of discovery – welcome to the world of Lumini...<br/><br/>Having vanished without trace for thousands of years, an innocent race of creatures known as the Lumini have returned to their home world. Sadly, time has not been kind and the balance of the planet has shifted, turning the once gentle environment into a hostile landscape. Only the Lumini themselves can restore balance and help revive their long-dormant race, before adapting to preserve the future for generations to come.<br/><br/>Explore the Lumini home world in this relaxing flow-style adventure, overcoming obstacles and keeping your swarm safe while collecting the planet’s energy to bring back your fallen comrades. Split and reform your swarm, evolve and discover new abilities to bring the Lumini back to their former glory...<br/><br/><ul><li><strong>Go With The Flow</strong> – Designed to be one of the most relaxing games ever made, with laid-back gameplay and a soothing soundtrack.<br/></li><li><strong>Better Together</strong> – Collect energy and use it grow your Lumini swarm, then split into two swarms to solve puzzles and overcome obstacles in your way.<br/></li><li><strong>Natural Selection</strong> – The bigger your swarm gets, the more your Lumini evolve and gain more abilities; sonar, boosting, defensive moves and more.<br/></li><li><strong>Illumination</strong> – A Special Edition bundle comes with the entire Lumini soundtrack and a extensive art book showing off the wonderful visual charm of the Lumini world.</li></ul>", "metacritic": 69, "released": "2015-09-03", "tba": false, "updated": "2023-04-28T19:44:08", "background_image": "https://media.rawg.io/media/screenshots/7bd/7bd753d2ec6f6cba3f16af161e3b6891.jpg", "website": "http://www.lumini-game.com", "rating": 0.0, "rating_top": 3, "added_by_status": {"yet": 5, "owned": 109, "beaten": 3, "toplay": 1, "dropped": 2}, "playtime": 4, "achievements_count": 13, "ratings_count": 4, "suggestions_count": 277, "game_series_count": 0, "reviews_count": 5, "platforms": ["PlayStation 4", "Xbox One", "Nintendo Switch", "macOS", "PC", "Linux"], "developers": ["Speelbaars"], "genres": ["Action", "Adventure", "Arcade", "Indie"], "publishers": ["Rising Star Games", "2Awesome Studio"], "esrb_rating": "Everyone 10+"}