{"id": 134915, "slug": "hexahedron", "name": "Hexahedron", "name_original": "Hexahedron", "description": "<p>Have fun exploring everyone's worlds! A new one should appear every 1-4 minutes, so stick around. ;) </p><p>Originally, you were going to be able to go to other worlds and DO things, like fight baddies or something, and then unlock new building materials to use. The unlocking functionality actually still exists in the code, but we didn't get the time to hook it up or think up unlock requirements. </p><p>Please note that this game requires XNA Game Studio 4.0 Refresh (http://bit.ly/1ubmn4I) and .NET 4.0 (http://bit.ly/1gGliNl) <br/>If the game crashes immediately or does not run at all, 99 times out of 100 you're missing the XNA redistributable (the first link); practically all modern Windows systems have .NET 4.0 installed already.</p><p>Controls: </p><p>WASD/arrow keys to move <br/>Right-click to open editor </p><p>In editor: click icon to place object; click placed object to move/delete it (pre-generated objects can't be moved or deleted) <br/>While placing: <br/>R - rotate <br/>Right click - cancel/delete <br/>Click - place <br/>Shift+Click - place multiple <br/>Mouse Wheel - scale object (post-compo version only)</p><p>Currently known bugs and things: <br/>Jumping in a certain direction is less powerful <br/>Scaling of objects was not implemented in time <br/>The player clips through certain objects slightly <br/>The framerate gets low when there are several worlds connected </p><p>A post-compo version is included as LD30-post-compo.exe and fixes and adds the following features:<br/>Fixed weird jumping problems<br/>When the character is behind objects, they will fade out much more reliably<br/>Fixed and added scaling (scale with the mouse wheel, not mentioned in instructions)<br/>Camera rotation with the E key (although it's not mentioned in the instructions)<br/>Worlds can be connected to worlds besides the host, allowing for interesting branching<br/>Because of the above point, an infinite number of worlds can be connected<br/>Bridges are much more correctly placed and nearer to the center (although still placed a little wrong sometimes)<br/>Bridges are placed between all adjacent worlds<br/>Massive performance improvements; it's unlikely that you'll experience slowdown unless there are lots of worlds onscreen, even when ten or more worlds have been connected</p><p>Most of these features were almost finished (namely, scaling and the world connections, as well as part of the camera rotation) but had to be cut in favor of more important features instead of fixed. </p><p>Additionally, all of the uploaded worlds can be seen at http://pastebin.com/u/ld30worldbot. To view a particular world, copy the raw paste into [paste_name].wld and save it in %appdata%/ld30, and it'll appear as a world in the world selection. Only the first five worlds by alphabetical title will be shown in-game, though. </p><p>You're welcome to download the source from the GitHub link provided, but if you use any of it, it would be nice to credit the programmer (Alex Van Liew) or the artist (Jonathan Fischer) for it. Thanks! </p><p>We encourage you to comment and send us screenshots of your world by posting a link in the comment section, or by finding us on Twitter: @_snoozbuster (Alex Van Liew) and @jon_fisch (Jon Fischer)</p><p>https://github.com/snoozbuster/ld30</p><p>You can get the soundtrack, made by Luminescent Breakfast, here: </p><p>https://luminescentbreakfast.bandcamp.com/album/hexahedron-soundtrack</p>", "metacritic": null, "released": "2014-08-26", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/17d/17d5ea546b656ceafb3a25e008ab1942.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 95, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Jonathan Fischer"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}