{"id": 134968, "slug": "gabriel-is-trapped", "name": "Gabriel Is Trapped", "name_original": "Gabriel Is Trapped", "description": "<p>You, as Gabriel, lived your own life with your father - the King and your friends. When you were allowed to walk outside of the palace, you started to speak with strangers and explore the territory. But you can't walk wherever you want because your father told you not to go to The Endless Forest.<br/></p>\n<p>The more you explore the territory, the more strange it seems... You will need to open your mind to discover the truth...<br/></p>\n<p>The game has 2 endings + 1 secret ending.<br/></p>\n<p>Built by Unity. All except music and sound effects was made by me (including art, story and coding).<br/></p>\n<p>/*Little history of the project (you can just skip it, though)<br/></p>\n<p>The game was planned to be part of the One Game Per Month Challenge: http://www.onegameamonth.com/. But then I saw the the project is too big, so my one month expanded to three.*/<br/></p>\n<p>Even though I chose \"Released\" it will probably be changed still. If you'll notice any bug, please let me know in the comments section! Especially if you'll notice grammatically incorrect sentence in the dialogues (My English isn't perfect yet). BUT! I will probably ignore comments like 'Your character said \"yes\", but we would know more about him if he'd say \"Yes - indeed\"'. The tips I'm looking for are more about English grammar, like 'Your character said \"My nam be Gabriel\", while the correct way to say that would be \"My name is Gabriel\"' :)<br/></p>\n<p>Languages:</p>\n<p>-English</p>\n<p>-Russian</p>", "metacritic": null, "released": "2018-01-23", "tba": false, "updated": "2019-08-28T23:22:55", "background_image": "https://media.rawg.io/media/screenshots/c44/c441b900ed1903568467152d9d0cd6c5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 83, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ValentGameDesigner"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}