{"id": 135041, "slug": "ten-thousand-bees", "name": "Ten Thousand Bees", "name_original": "Ten Thousand Bees", "description": "<p><strong>Ten Thousand Bees</strong></p><p><strong>BZZZZZZZZZZZZZZZZZZZZZZZZZZZZZZZZZZZZZZZZZ</strong></p><p>You are Bee Mom, and you must feed your babies by collecting pollen from the flowers and delivering it to the honeycombs where your larvae reside. Your butt can only hold so much pollen at a time, so always remember when you're out collecting. Once you feed your babies, you can go back out and collect more. <strong><em>You have to hold down the interact button for two seconds in order to do anything.</em></strong></p><p>There are upgrades that can turn you into Hella Bee Mom if you collect three of them. This allows you to have a bigger butt which can carry more pollen at a time. </p><p>Once you feed a honeycomb, your score goes up one point toward the max. <strong>Level one your goal is to feed 5 honeycombs. Level two is 6, and Level three is 8</strong>. However, after a little while, the honeycomb will spawn a bee, which will go off and decide to start a family of its own. Now you have to provide for your grandchildren, because for every honeycomb your children create, your goal score to complete the level goes up by one. If you're fast enough, you can feed them all. If not, and the level goal reaches a certain amount, it's all over. <em><strong>Hint: If things aren't working for you, devise a plan of action before you feed your first honeycomb because once they're fed, the breeding cycle begins. You have all the time in the world up until you feed the first honeycomb.</strong></em></p><p><strong>You can spit on your children and kill them if you hit them three times.</strong> This can buy you some time if you cut down the reproduction of your family. But it will cost you. If you kill enough of your children, you become evil. Evil Bee Mom is granted faster speed but less butt room for pollen. You also lose your upgrade and become ineligible for new upgrades. <strong>The only way you can do this is by repenting at Reverand Beezus' shrine if you pay him two pollen.</strong><br/></p><p><strong>Good luck haha happy spring</strong></p><p><em>Disclaimer: The pollen is <strong>attached to</strong> the fuzzy bee fur of Bee Mom's butt, not <strong>transported inside of it</strong>. I just re-read this and realized how bad this all sounds. Real bees actually carry pollen by sticking it to their legs. </em></p><p><em>Thank you </em><br/></p><p><strong>Controls:</strong></p><p>WASD- Flight pitch</p><p>Spacebar- Accelerate flight speed</p><p>E (Hold down for 2 seconds)- Interact with objects </p><p>P (Hold down)- Check status of butt cargo, offspring murdered, and amount of honeycombs fed </p>", "metacritic": null, "released": "2017-04-03", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/15a/15a8618a5633e9af0db51a32df6d672c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 13, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["thenegaverse"], "genres": ["Action"], "publishers": [], "esrb_rating": null}