{"id": 13503, "slug": "golden-krone-hotel", "name": "Golden Krone Hotel", "name_original": "Golden Krone Hotel", "description": "Golden Krone Hotel is a gothic horror roguelike. Fight vampires with sunlight or become a vampire yourself and sneak in the shadows.Your mission<br/>You play as Sorina Arobase, a human general made famous for hunting vampires. You're on a mission of revenge to kill Fane, the exiled vampire prince. Armed with your sword, revolver, and spell book, you must battle hordes of blood sucking foes. But first you'll be picking one of 10 disguises that will help you on your journey.Features<br/><ul><li>It's a roguelike, really! Turn-based combat, permadeath, and tough as nails gameplay<br/></li><li>Fully dynamic lighting. Use sunlight as a weapon or snuff out torches to conceal yourself<br/></li><li>A groundbreaking potion identification system that encourages risk taking<br/></li><li>Each run requires you to play as both human and vampire, each with different strengths and weaknesses. Humans are frail spellcasters. Vampires are brawlers with super human speed and strength.<br/></li><li>Leaderboard and shareable morgue files</li></ul>Content<br/><ul><li>10 floors, 9 branches, and 6 bosses<br/></li><li>Dozens of unique monsters<br/></li><li>40 potions<br/></li><li>20 spells<br/></li><li>10 classes</li></ul>Game lengthGolden Krone Hotel is what's known as a coffee-break roguelike. A pickup and play style allows for short sessions and the save system lets you stop at any time. Winning runs take about 1-2 hours. Want a longer run? No problem! Just crank up the difficulty setting and attempt to clear all the optional branches.Amenities<br/>Traditional roguelikes are a ton of fun, but usually come with an alphabet-soup of commands that make them tedious and unintuitive. Golden Krone Hotel has a modern, streamlined interface:<br/><br/><ul><li>A very small number of controls, all of which are rebindable<br/></li><li>Completely playable with either mouse or keyboard<br/></li><li>Keypress hints on all buttons to help you learn shortcuts<br/></li><li>Tooltips on everything<br/></li><li>No inventory management! <br/></li><li>Items are picked up automatically and gear is auto-equipped</li></ul><br/>All of which results in less downtime and faster gameplay.Before you buy....<br/>Please be aware that, being an Early Access title, <strong>Golden Krone Hotel is not finished</strong>! It's lacking some of the the content, balance, and polish that will be in the full release. If, however, you're willing to play a game that's still in development and has the occasional bug, then buckle up. It'll be a fun ride.", "metacritic": null, "released": "2016-10-25", "tba": false, "updated": "2023-10-30T05:27:07", "background_image": "https://media.rawg.io/media/screenshots/3b7/3b74a30792320c8f00a0b6132bc3ad75.jpg", "website": "http://www.goldenkronehotel.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 5, "owned": 60, "dropped": 2, "playing": 1}, "playtime": 1, "achievements_count": 45, "ratings_count": 3, "suggestions_count": 319, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC"], "developers": ["Vulgat"], "genres": ["Adventure", "RPG", "Strategy", "Indie"], "publishers": ["Vulgat"], "esrb_rating": null}