{"id": 135113, "slug": "jeu-de-nains-jeu-de-vilains", "name": "Jeu de nains, jeu de vilains", "name_original": "Jeu de nains, jeu de vilains", "description": "<p><strong>English description after the french one</strong><br/></p>\n<p>Jeu cree dans le cadre de la Ludijam (la Game Jam du festival Ludinam 2018 a Besancon).</p>\n<p>Khazdin, Gibli, Berhof et Magnus n'arrivent pas a se mettre d'accord. Le probleme ? Peu importe ! L'important c'est la baston !</p>\n<p>Encastrez vos amis dans la roche ou faites leur couler de la lave dessus, le dernier survivant remporte la partie.</p>\n\n<p>Le theme de la Game Jam etait \"il est interdit d'interdire\". Il est donc interdit de refuser les regles toujours changeantes de cette bataille a quatre joueurs. Le quator barbu devra s'adapter a l'interdiction de tourner a droite, ou encore a l'intervention de tonneaux destructeurs.</p>\n\n<p>Les controles des joueurs sont affiches dans le jeu. Les quatre lurons doivent se partager un seul clavier.</p>\n<p>Vous pouvez meme le tester directement ici : https://anelosimus.info/nain/</p>\n<p>Changelog 19.04.18 :</p>\n<ul>\n<li>Correction d'un bug de collision avec les tonneaux</li>\n<li>Ajout du support manette dynamique</li>\n<li>Ajout d'un indicateur du nombre de caillou porte</li>\n</ul>\n<p><strong>English description:</strong></p>\n<p>Game made during the Ludijam, in Besancon (France).</p>\n<p>Khazdin, Gibli, Berhof and Magnus can't find an agreement. The problem ? We don't care, let's fight !</p>\n<p>Crush your friends in the ground or melt them with lava, the last dwarf alive is the winner.</p>\n\n<p>The theme for this gamejam was \"It is forbidden to forbid\". Then it's prohibited to refuse the ever changing rules of this 4 player battle. The bearded quatuor shall adapt to changes such as the prohibition of going to the right or the flamming barrels rain.</p>\n<p>Controls are found in the game. The four dudes must share a single keyboard.</p>\n<p>All the texts in the game are in french, but are used only for joke and credit purpose. You can fully comprehend the game without knowing a single word in la langue de Moliere.</p>\n<p>You can even try it right there : https://anelosimus.info/nain/<br/></p>", "metacritic": null, "released": "2018-04-08", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/da6/da6650afc796aba407d06c8ee36d7e14.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 39, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["Zebu", "Bealydan", "Solipse", "Thöbe"], "genres": ["Action"], "publishers": [], "esrb_rating": null}