{"id": 135216, "slug": "the-questionable-nine", "name": "The Questionable Nine", "name_original": "The Questionable Nine", "description": "<p><strong>The Questionable Nine</strong></p><p>A minimalistic, interrogation game where you have to find the perpetrator among the 9 suspects. Made for 1 bit jam hosted by Daniel Linssen.</p><p><em>[WARNING] This game contains rapidly flashing screens potentially triggering seizures for people with photosensitive epilepsy. Don't maximize the window if not needed or toggle between palettes using the up and down arrow keys to find one that suits you.</em></p><p><strong>Command list</strong><br/></p><ul><li>1 - 9: toggle between suspects</li><li>A - Z: your questions with which you interrogate the suspects</li><li>Enter: Pick the current suspect as your perpetrator</li><li>Arrow up/down: toggle between palettes</li><li>Space bar: toggle audio on/off</li><li>Tab: toggle debug mode (password required)</li></ul><p><strong>The game</strong><br/></p><p>There has been a murder! Luckily, 9 suspects have been rounded up. You can toggle between the 9 suspects using your number keys 1 to 9. Each letter on your keyboard is a question, which the innocent suspects will answer truthfully and exactly the same. The perpetrator, however, will not always be able to answer truthfully and exactly the same.</p><p>If you think you found the liar, press 'Enter'! The game will blink rapidly if you're correct, or slowly if you're wrong. Good luck!</p><p><strong>Audio</strong></p><p>The game is designed without the use of sound (in keeping with the rules of the jam). For the visually impaired, however, you can toggle the sound on using the 'Space bar'.</p><p>Cheers and let me know what you think in the comments section or on Twitter,<br/></p><p>Woes</p>", "metacritic": null, "released": "2016-04-30", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/e0d/e0dbab3f312e5b8b05c871b7b21b6ebe.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 22, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Woes"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}