{"id": 135349, "slug": "triggers", "name": "(Triggers)", "name_original": "(Triggers)", "description": "(Triggers)\r\n<p><strong>created by Jules De Guzman (Pronouns: they, them, theirs) using Inform7.</strong></p>\n<p>Dec 5, 2017</p>\n<p><em><strong>CW: Suggestions of self harm and suicide.</strong></em></p>\n<p>This piece aims to push a certain perspective that might not necessarily align with the player's own personal experiences. The environment is intentionally surreal, pulling elements inspired by Alice in Wonderland, Twilight Zone, and a little bit of Black Mirror.  Poetry is also incorporated in order to reflect on intense experiences. </p>\n\r\ntaken in 2016, Nikon D3100 by Jules D.\r\n<p><strong>In order to navigate the space:</strong></p>\n<p>Use North, South, East, and West directions (which can be abbreviated to N, S, E, W) to explore different areas of the environment. </p>\n<p>Think of various verbs (eg. look, examine, touch, take, break etc.) to interact with a noun relative to the game (eg. scenery, body, object, etc). </p>\n<p>Lastly,</p>\n<p><em>get lost. explore. search for whatever feels missing.</em></p>\n<p>_________________________________________________________________</p>\n<p>(note: Images are created by Jules De Guzman Photography)</p>\n<p>(extra note: I plan on expanding on this because there's so much detail to explore myself, so if you as a player feel as though the experience is missing something vital, pls feel free to comment any concerns or suggestions. Thank you for trying this out!)</p>\n<p>(last and final extra note: Donate to me by Venmo if you can pls: @jusdeguz)</p>", "metacritic": null, "released": "2017-12-05", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/b61/b61534f9a42a27b40eb0e1515fd35b31.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 42, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Web"], "developers": ["Jules D."], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}