{"id": 13533, "slug": "mothergunship", "name": "Mothergunship", "name_original": "Mothergunship", "description": "<p>Our mission is clear, our determination strong, and our guns are very, very big. Terrible Posture Games, in partnership with Grip Digital, is proud to announce MOTHERGUNSHIP, a bullet-hell FPS hybrid for PC and consoles that pits you, Earth’s last hope, against the armadas of data-hoarding robotic alien invaders.<br />\nMOTHERGUNSHIP mixes bullet-hell intensity with the shooting, gun customization, and traversal of the first-person genre. Fight your way through the alien fleets, facing randomized enemy and level mayhem as you clear rooms and take out some of the biggest bosses seen in the FPS genre.<br />\nFIGHT<br />\nFace off against overwhelming odds in brutal, non-stop combat where thinking on your feet is the only way to survive. Dodge hundreds of bullets with unique FPS/Bullet-hell hybrid gameplay. Each ship hosts hordes of alien machines, deadly traps, and intimidating bosses, all set on preventing you from saving humanity. Go get ‘em.<br />\nCRAFT<br />\nTo take down the MOTHERGUNSHIP, you’ll need your very own personalized arsenal of destruction. Luckily, in MOTHERGUNSHIP you can create the gun of your dreams with one of the most modular gun-crafting systems ever seen in a videogame. Want to have twelve-barrel gun that shoots homing rockets? Or do you prefer a lightning shotgun? And what gun wouldn’t look better with a fishtank afixed to the top?  Go for it! The design of your destructive arsenal is in your hands.<br />\nRESIST<br />\nJoin the ranks of global resistance movement and take back Earth together with your friends. Fight together with a friend in a full CO-OP experience, or participate with the community while you work together to cut through the alien fleet and reach that ultimate goal – bringing down the MOTHERGUNSHIP.</p>", "metacritic": 76, "released": "2018-07-16", "tba": false, "updated": "2023-12-19T12:22:22", "background_image": "https://media.rawg.io/media/games/254/25460145a8ad267b1c8f91345e5c8092.jpg", "website": "http://www.mothergunship.com", "rating": 3.17, "rating_top": 4, "added_by_status": {"yet": 114, "owned": 866, "beaten": 11, "toplay": 17, "dropped": 39}, "playtime": 3, "achievements_count": 82, "ratings_count": 52, "suggestions_count": 260, "game_series_count": 0, "reviews_count": 53, "platforms": ["PlayStation 4", "PC", "Xbox One"], "developers": ["Grip Digital", "Terrible Posture Games"], "genres": ["Action"], "publishers": ["Versus Evil", "Grip Digital"], "esrb_rating": "Teen"}