{"id": 135428, "slug": "hinata-online-le-jeu", "name": "Hinata Online - Le jeu !", "name_original": "Hinata Online - Le jeu !", "description": "Et oui, vous avez bien lu, Hinata Online Community<strong> sort un jeu exclusif</strong> pour fêter les<strong> 10 ans du site et de sa communauté !!</strong>\r\nPrésentation\r\n<p>Le jeu est un <em><strong>Visual Novel</strong> (ビジュアルノベル)</em>. C'est un type de jeu populaire au Japon qui se rapproche d'un livre interactif. Vous serez amené à lire, réfléchir et faire des choix qui influenceront la manière dont se déroule l'histoire. Nous avons apporté dans notre jeu une dimension de \"Puzzle\" assez nouvelle pour le genre, avec une histoire non linéaire.</p>\n<p>Vous aurez souvent cette impression de revenir régulièrement sur vos pas, c'est normal ne vous inquiétez pas il vous faut un temps d'adaptation afin de comprendre au mieux l'histoire !</p>\n<br/>\r\nRésumé<strong>\n</strong>\n<p>Vous êtes le héro de l'histoire, dans laquelle, en tant que membre du site, pourrez venir nous rejoindre à Tokyo pour célébrer avec nous cette<strong> grande fête d'anniversaire</strong> !</p>\n<p>Mais attention, car <strong>Tokyo</strong> est une grande ville et il n'est pas simple de s'y déplacer sans un bon guide...</p>\n<p>Découvrez <strong>les membres du Staff blog et du forum</strong> dans une aventure ou votre sens de l'orientation sera mis à l'épreuve !</p>\n<p>Explorez tous les recoins de Tokyo pour obtenir <strong>les deux fins du jeu !</strong></p>\n<p>Hinata Online le jeu c'est <strong>plus de 15 000 mots</strong> pour une histoire inédite et un <strong>concept jamais vu</strong> sur un autre site de streaming !</p>\n\n\r\nFiche technique\r\n<p><strong>Titre</strong> : Hinata Online, le jeu !</p>\n<p><strong>Date de sortie</strong> : 25 Décembre 2017</p>\n<p><strong>Type de jeu</strong> : Visual Novel</p>\n<p><strong>Genre </strong>: Humoristique - Exploration</p>\n<p><strong>Temps de jeu estimé </strong>: 1 a 2 heures</p>\n<p><strong>Plateforme</strong> : Windows - Mac - Linux - Android</p>\n<p><strong>Version</strong> : 1.0<br/></p>\n\n\r\nAperçu du jeu\n\n\n\r\nComment jouer ?\r\n<p><strong>Pour vous rendre la lecture et ce jeu agréable, nous vous avons ajouté des outils qui vous permettent de naviguer plus facilement dans le jeu :</strong></p>\n<p><strong>Le clic gauche de la souris </strong>vous sert à faire défiler le texte et avancer l'histoire</p>\n<p><strong>Le clic droit de la souris </strong>vous permet d'ouvrir n'importe quand le menu du jeu pour sauvegarder ou quitter le jeu</p>\n<p><strong>La touche CTRL </strong>vous permet de passer les textes jusqu'au prochain choix que vous avez à faire <em>(Pratique quand on passe plusieurs fois au même endroit)</em></p>\n<p><strong>La molette de la souris </strong>vous permet d'avancer ou de reculer dans l'histoire, ceci vous permet facilement de changer d'avis juste après avoir fait un choix. Nous vous conseillons de jouer la première fois sans cette fonction, mais elle sera pratique pour ceux qui veulent explorer toutes les scènes du jeu facilement.</p>\n\n<p>  </p>\n\n\n<p>Découvrez la grande famille d'Hinata Online Community sur notre site : https://hinata-online-community.fr/<br/></p>", "metacritic": null, "released": "2018-06-28", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/147/14795c3c889e06fd63179615919ddb46.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 32, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Android"], "developers": ["Akamis"], "genres": [], "publishers": [], "esrb_rating": null}