{"id": 135448, "slug": "labo", "name": "Labo", "name_original": "Labo", "description": "<p><strong>Take control of two lab rats… and save them ! <br/></strong><em>Solo, versus, cooperation</em></p>\n<p>In Labo, the player controls two rats. What's your goal ? Get them out of the maze before the timer reaches the fateful 0. What's the danger ? Relentless mechanic foes, aggressive spiders, doors, electric barriers, spikes, buzzsaws…</p>\n<p>What's the catch ? You will have to handle both rats simultaneously, whether with your keyboard or your gamepad, in order to make them both reach the finish line without harm. But each rat has its specificities ! One is lithe and fast, can outrun his enemies and protect the other, who is bigger and slower, but capable of triggering mechanisms thanks to its weight.</p>\n<p>So it's a permanent <strong>cooperation</strong> you'll have to reach between the two rats, mixed with good coordination in order to control them simultaneously, all for an adventure stretching on more than a hundred levels, <strong>solo</strong> or <strong>multiplayer.</strong></p>\n<p>Indeed, to spice things up, why not play with another player on the same screen ? Plug a second gamepad, or share the keyboard, and the coop and versus modes await ! Four rats on screen (two per player) means even more challenges, mechanisms, more enemies to avoid… </p>\n<p><strong>Other spécifications<br/></strong><br/>• PLATFORM : Windows<br/>• SYSTEM REQUIREMENTS : a DX9 capable computer, basically something manufactured within the last few years.<br/>• CONTROLS : Gamepad / Keyboard / Mouse<br/>• AVERAGE RUNTIME : 3 hours. If you're really good and focused.</p>\n<p><strong>Watch some videos!</strong></p>", "metacritic": null, "released": "2015-06-18", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/c2f/c2f40d73f26ef2d0119ee28c3b4fa6be.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 42, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Hadrien Games"], "genres": ["Action"], "publishers": [], "esrb_rating": null}