{"id": 135508, "slug": "ghosts-masters", "name": "Ghosts Masters!", "name_original": "Ghosts Masters!", "description": "<p>The game is a local versus based on unique mechanics - you have to use your sixth sense to find your opponent's ghosts team! You don't see them, but you feel the energy they emit. The pad vibration will lead you to localization of the lost soul where you have to capture it. The more souls you capture the better chance you win!</p>\n<p>The game consists of two phases:</p>\n<p>Phase 1 is placing your ghosts in the game area. You and your opponent do it at the same time. You do not see the ghosts in this phase - even the ones from your team.  You can place 3 weak ghosts (press X), 2 medium (press A) and 1 strong ghost (press B). If you run out of ghosts, you will feel the pad vibration. There is no other confirmation of placing the ghosts, so that the players do not know the positions of the opponents' teams. Place the ghosts  wisely, so that the opponent has got a harder task to do in phase 2!</p>\n<p>Phase 2's aim is to take over your opponent's ghosts. The player with the most ghosts wins. The pad will vibrate giving you the location of the nearest ghost - left vibration means go to the left, right - go to the right, both - go to the front. The more the pad vibrates, the closer the ghost is. Once you are near, press RT to target it. The ghost will reveal itself. Now you start listening only to this single ghost and its energetic pattern. You have to repeat it to take it over to your team! If you feel a vibration, e.g. \"left - left - right\" you have to press corresponding buttons to succeed (X - X - B). The stronger ghosts have longer patterns.</p>\n<p>Feel the dark energy of the lost souls and capture them to doom your opponent!</p><p>Authors:</p><p>Dariusz Malec, Marcin Cecot, Zofia Domaradzka</p>", "metacritic": null, "released": "2017-09-19", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/5b8/5b8dd47a1252464466c519a2e38f3362.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 90, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Sophia"], "genres": ["Action"], "publishers": [], "esrb_rating": null}