{"id": 135578, "slug": "super-ball-breaker", "name": "Super Ball Breaker", "name_original": "Super Ball Breaker", "description": "<p>From the maker of that other terrible game overnight sensation Paint Heroes comes something more closely resembling a game: Super Ball Breaker - a new take on the classic brick-breaking genre. Instead of smashing bricks, you're shattering balls!</p><p>But wait, there's more! Instead of a bottomless pit at the bottom of the screen, you're protecting your own ball from falling into the center of the screen, while being surrounded on all sides by easily shattered balls.</p><p>On top of that, occasional power-up capsules will appear from the shattered remains of a ball. If you touch one with your paddle, one of several effects can occur:</p><p>- Multi Ball: Just like classic brick breakers, you will be given extra projectiles to smash balls with.</p><p>- Super Ball: Increase the size of your projectiles to increase their smashing ability.</p><p>- Power Ball: For a short duration your projectiles will pierce through the heavens other balls instead of bouncing off of them.</p><p>- Laser Beam: An overpowered beam of energy briefly shoots from your paddle, damaging anything you point it at.</p><p>- Extended Play: You get an extra shot at things.</p><p>- Defense Wall: For a short time, you can give your fingers a break, as the center of the screen will be defended by a wall that repels your projectiles from falling into it.</p><p>Controls are simple: Use the arrow keys to rotate the paddle, [SPACE] to launch a projectile, [ENTER] to pause the game. The mouse can be used to access options and credits on the main screen.</p><p>This game was designed from scratch in 72 hours for the Brick Breaker Jam, sponsored by Game Development League. You can check them out here:<br/>http://beta.gamedevleague.com/<br/>For more info on the jam, check it out here:<br/>http://beta.gamedevleague.com/category/42/submissi...</p><p>GLHF!<br/></p>", "metacritic": null, "released": "2016-03-27", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/a09/a091840d76452253d9037d65013ddd3c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 49, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["thebitingcat"], "genres": [], "publishers": [], "esrb_rating": null}