{"id": 13568, "slug": "guardian-of-december", "name": "Guardian Of December", "name_original": "Guardian Of December", "description": "A long time ago people lived peacefully; they lived and died, they improved, explored, and discovered, but they wanted more.<br/>They became greedy, they wanted to be kings and rule the world. <br/>Unnecessary fights, murders, wars... Gods decided to stop this. <br/>At the end of every year, during December, they opened gates to Hell so demons could freely punish, torture and kill. <br/>The world began to become part of hell. People stopped fighting each other, they united, but that was not enough to defend themselves.<br/>One demon was different, much stronger than everyone else, who once was a man, an assassin, who killed others to live, which in turn landed him in Hell.<br/>But after some time in Hell, he had grown weary and regretted his past life and wanted to help the humans.<br/>He became a guardian, and at the end of each year he fought off the demons.<br/>The people called him Guardian of December.<br/>The Devil noticed that his armies were being slain, so he offered a deal: no demon will ever come to Earth again, <br/>but the Guardian of December must return to hell.<br/>The people were saved and the guardian's soul was trapped in hell once again.<br/>After a year, when the gates of Hell were opened again, the people were hoping that no demons would come out again... <br/>But the Devil broke his deal and demons started crawling out...<br/><br/>The Guardian must return...<br/><br/><br/><br/>Gods give you the power to fight your way out of the hell prison and save the world. After getting out you reach the Arano village, where its leader Taru explains their plan on how to reach the Devil and kill him. The Devil's Medallion will take you to the Devil, but you need to collect its pieces first. Villagers along with other creatures built portal that can transport to the medallion fragments, but the humans are too weak for such missions. So Guardian's assistance is necessary.<br/><br/><br/><br/>Go through ice cave, dungeon, temple, darkness collection, castle, swamp, fight the witch, vampires, monsters, undead creatures, magic animals and many more, get stronger, unlock new skills, get new weapons, customize your Guardian with helmets and wings you get from battles, get to know about different creatures, their stories... In Guardian Of December!<br/><br/><br/><br/>RPG style turn based battles<br/>Customization<br/>Many different enemies, battles, skills<br/>Various weapons<br/>Melee and magic attacks<br/>Warning - jumpscares!<br/><br/>The full game is here, and even more stories are coming soon (includes fighting as different characters!) in the next update!<br/><br/><br/><br/>#horror #indie<br/>-<br/>See everything I've made on:<br/>VidasGames.com", "metacritic": null, "released": "2016-11-30", "tba": false, "updated": "2019-08-28T22:12:38", "background_image": "https://media.rawg.io/media/screenshots/4c6/4c6ec13943e20b183d8548b6f5c06702.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 24}, "playtime": 6, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 264, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Vidas Salavejus"], "genres": ["Adventure", "RPG", "Strategy", "Casual", "Indie"], "publishers": ["Vidas Salavejus"], "esrb_rating": null}