{"id": 135622, "slug": "ousted", "name": "Ousted", "name_original": "Ousted", "description": "<p><strong>Description</strong></p>\n<p>You're the dictator of the DPRE. Ensure that your people are fed and happy, whilst making sure that your council of four ministers doesn't overthrow you in the process.</p>\n<p><strong>Gameplay</strong></p>\n<p>Your regime has <strong>might</strong> and <strong>resources</strong>. You spend <strong>resources</strong> for basically everything - bribing officials, asking for their specific items.<br/>The population has <strong>happiness</strong>, <strong>satiation </strong>(how not hungry they are) and <strong>faith</strong> (their faith in your regime). They all affect how fast rebellions occur slightly differently. In general, try to keep all their values high to avoid rebellions.</p>\n<p>Each <strong>minister</strong> has an opinion of you (<strong>approval</strong>) and an <strong>opinion</strong> of every other minister. These opinions evolve in the course of the game, from simple rules. For example, an enemy's enemy will tend to become a friend. Each minister also has a <strong>strength</strong>. Stronger ministers can more easily assassinate other ministers, or assassinate you. You can use the Minister of Intelligence to assassinate other ministers, but only if he likes you more than he likes them. You can also ask for a specific action from each of them, for instance the minister of production will use resources to provide satiation. This action will also decrease their approval of you.</p>\n<p>Be careful if all the ministers have positive opinions with each other, as they may gang up to defeat you.</p>\n<p>Events may occur throughout the game, and you must respond to them in order to move on to the next turn/week.<br/>Essentially everything in the game has a tooltip, so hover over things if you're not sure.</p>\n<p><strong>Theme</strong><br/>The theme was running out of power, so I chose to interpret that as a dictatorship running out of (political) power. No dictators were harmed in the making of this game.</p>\n<p><strong>Notes</strong><br/>Unfortunately, I didn't have time (have school) or skill to make audio, so this is a soundless game for now. It's my fifth Ludum Dare, and my first time making a game entirely with web (without using Phaser or any game library). Didn't really have time to make a tutorial either. Runs best in Google Chrome. Also my first time trying out a vector art style; all my previous LD games have been (pretty bad) pixel \"art\".</p>\n<p><strong>Controls</strong><br/>Mouse only.</p>\n<p><strong>Details</strong><br/>Made with HTML, JS, svg.js, tippy.js, jQuery.<br/>Graphics made in Adobe Illustrator.<br/>Fonts used - Molot.</p>\n<p>To see the source... just use developer tools.</p>", "metacritic": null, "released": "2017-07-30", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/5de/5ded224a907f66723dcf3f67f4e2c852.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 4, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["btwj"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}