{"id": 135674, "slug": "qed-nights", "name": "QED Nights", "name_original": "QED Nights", "description": "<p>\r\n\tThis was a very short game made for a QED Comedy Show on 2/9/2015, where we forced local Knoxville comedians to play through increasingly bizarre games while making commentary before a live audience. No video of the night exists to my knowledge, but it was a good time! I got to make people play Enviro Bear 2000, I Wanna Be The Guy Gaiden and Bubsy 3D: Bubsy Visits the James Turrell Retrospective all while sitting back and feasting on their suffering to help sustain my powers for a short while longer. I'm basically the worst vampire that has ever existed. I don't even glow in sunlight. I turn bright red, though. That's called \"sunburn\".</p><p>Ahem. Anyway.</p><p>I wanted to finish the experience with a group interaction with an unique game made solely for the event... Which is why I made this in Renpy mere hours before the event happened. The result is a very short thing (Thing is rapidly approaching \"in-quotes\" territory) with the idea was to make the crowd interact with the choices as well as to remind them that QED is every week.   I completed the project but we ran short on time and sanity, so it had to be cut out of the show. However, I released it right afterwards and now I'm releasing it here just in case anyone was bored and wanted to play through a visual novel in five actual minutes! You can do that now! Thanks, technology!<br/><br/>There's also a nonsensical final battle that was made because it was 5 AM and I was so tired. I apologize in advance.<br/></p><p>QED used to happen every Monday Night in Knoxville at the Pilot Light @ 7:30 PM EST with a new bizarre and amazing theme every week. It no longer does, but a new show is taking its place! You should come to it at as well.</p><p>Thanks to Matt Chadourne for running QED and everyone who participated!<br/></p>", "metacritic": null, "released": "2016-07-12", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/959/9594457a5e8547837b9fc74afa3da850.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 77, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Doc Isaac"], "genres": [], "publishers": [], "esrb_rating": null}