{"id": 135686, "slug": "paper-rift", "name": "Paper Rift", "name_original": "Paper Rift", "description": "<p>\r\n\tPaper Rift (temporary title) is a experimental game made when I was learning Vue.js framework. Concept of this game is loosely based on Hereos 3 gameplay. There is campaign map where you can travel through land searching for enemies. When you find it, the battle begins on hexagonal board. Between battles you can upgrade your camp (recruting new units or upgrade existing)</p><p>Because game is only a experiment of framework, it may have some bugs. I tried to eliminate all of then, but I could miss something. If you find one, please post comment here or contact me directly.</p>Features<ul>\n<li>Campaign map allowing you travel through kingdom</li>\n<li>Build structures in camp (up to 16 slots for buildings)</li>\n<li>Upgrading units (5 units: Archers, Cavalry, Swordmen, Axemen and King)</li>\n<li>Battles with enemies</li>\n<li>Earning gold for winning battle</li><li>Random events (for now it's only one)</li>\n</ul>Possible Features<p>I don't exclude that it will do following features:</p><ul><li>Build the city/castle on campaign map</li><li>Developing city (in Heroes 3 style or like camp in game)</li><li>Siege of the city/castle</li><li>Random events on campaign map and in the battle</li><li>Treasures</li><li>Bandits camp's</li><li>More units</li></ul><p>It's mostly depends on how many players will play the game and want to me continuing development.</p>", "metacritic": null, "released": "2016-10-06", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/f76/f7633464218a99802c2de10ecca57070.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 100, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["karboosx"], "genres": ["Strategy", "Fighting"], "publishers": [], "esrb_rating": null}