{"id": 13579, "slug": "iron-armada", "name": "Iron Armada", "name_original": "Iron Armada", "description": "Iron Armada is a multiplayer, team-based, multi-crew, ship-to-ship action game. Harvest resources while defending your team's mothership. Construct frigates, fighters, and stations to fight against hostile forces. Play as a key part of your team, board enemy cruisers, kill their crew, and commandeer enemy craft. Wage all out war until your faction emerges victorious. With multiple ways to play, no two rounds are ever the same.<br/><br/><strong>PLAY IN DIFFERENT WAYS:</strong><br/><br/><ul><li>Fully multiplayer, build and crew massive ships with your friends.<br/></li><li>Lead assault squads and board enemy vessels.<br/></li><li>Commandeer enemy ships and take them out from the inside.<br/></li><li>Command large capital ships and fight in epic fleet battles.<br/></li><li>Choose from multiple player classes, from pilot to marine.<br/></li><li>Mine resources and power your faction's war machine.</li></ul><br/><strong>SIMPLE TO GRASP, EASY TO PLAY, HARD TO MASTER:</strong><br/><br/><ul><li>Low system requirements and multi-platform support.<br/></li><li>Simple to learn mechanics keep the accessibility high.<br/></li><li>Minimal keyboard commands keeps the control scheme intuitive.<br/></li><li>Use tactics to your advantage, coordinate assaults and ambushes.</li></ul><br/>Iron Armada's influences include games such as Faster Than Light, Battlevoid, Starsector, and Space Engineers. Iron Armada includes developers from the Shiprekt modification, which we take great inspiration from. <br/><br/>We hope you enjoy our game, and please feel free to ask any questions on our Steam community forums! The game is constantly under development, so new features, changes, and expansions are regularly released!", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-23T12:12:36", "background_image": "https://media.rawg.io/media/screenshots/368/368312563109579efef2dac4d0d9e141.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 74, "toplay": 1, "dropped": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 176, "game_series_count": 0, "reviews_count": 2, "platforms": ["macOS", "PC", "Linux"], "developers": ["Drakeling Labs"], "genres": ["Action", "Strategy", "Casual"], "publishers": ["Drakeling Labs"], "esrb_rating": null}