{"id": 135727, "slug": "a-prisioneira-da-noite-the-prisoner-of-the-night-d", "name": "A prisioneira da Noite - The prisoner of the Night (demo)", "name_original": "A prisioneira da Noite - The prisoner of the Night (demo)", "description": "<p>Cruviana is the cold wind of the night.</p><p>Use your blanket or Cruviana will come and imprison you in the darkest night for all eternity.</p><p>Escape, find your light and most of all, survive!</p> Or else... you will be trapped forever in the prison of the night!<p>Story</p><p>Nartide used to live with her parents in a big house. One night, she ignores her mother's advice and sleeps without the protection of her blanket. That night, the cold wind of the night, called Cruviana, enters through the window and takes little Nartide as her prisoner.</p><p>Nartide must find her light so that she can find her way home!</p><p>Mechanics</p><p>- A platform game, full of traps, puzzles and enigmas.</p><p>- 12 outfits, each one giving Nartide a different skill to help her along</p><p>the way.</p><p>The characters</p><p>Nartide is a small girl and, as any child, is mischievous and has a beautiful</p><p>creativity. Her creativity, vitality and the agility of a child, as well as the magic around her, will be her tools in this big adventure.</p><p>Cruviana is a force of nature. She's the cold wind of the night. That way, she will be</p><p>sometimes tender and sometimes scary, and not necessarily a villain.</p><p>Cruviana has a brother called Simum, the hot wind of the day.</p><p>Nartide is going to get the help of many awesome characters, like the Handsome Dragon and the ghosts of dead children.</p><p>Other character cameos</p><p>This isn't the first time Nartide appears on a videogame. She's a heroin on THE GREAT SPACE MESS, the niece of the main hero Waldisglédson. She flies on a paper airplane and her special power is called CRUVIANA WIND.</p><p>Cruviana also appears onTHE BIG SPACE MESS, in some stages and as a collectible card.</p> <p>Captain Goast and Alien Mechanical Slingshot are two other heroes of THE BIG SPACE MESS that are in THE PRISONER OF THE NIGHT as supporting characters.</p>", "metacritic": null, "released": "2017-04-13", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/bde/bde01d7fa968e5d8b6511767e0691bb7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 408, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["RMAL"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}