{"id": 135882, "slug": "la-nuit-tous-les-chats-sont-gris", "name": "La nuit, tous les chats sont gris", "name_original": "La nuit, tous les chats sont gris", "description": "<p>\"La nuit, tous les chats sont gris\" is a 3D platformer in which you play Mist, a young cat lost in the city. You will need to explore the city and overcome many obstacles in order to find your way home. Tought home might not be were you expect it to be…</p>\n\n<p>This game was my final project for my Game Design program at the University of Montreal. I worked on this project with two wonderful colleagues for about four months. As we are no artists, no assets were made by us, except for those that are UI related. However, we did all the game design, level design and programming by ourselves. </p>\n<p>While this project may be a cute 3D-platformer, the goal was also to raise awareness about a subject that is dear to us and really moved us when we did our research about it. Indeed, this project is more serious than it first seems, but I won't say more in order to keep this text spoiler free. However, you can download the game, look at the video (which is the complete walkthrough of the game), or simply scroll down to the end of this page if you wish to know more!</p>\n\n<p>A game by : </p>\n<ul><li>Félix Leblanc (game design, C# scripting, UI design, sound implementation)</li><li>Maude Roussin (game design, C# scripting, level design for the first level, creative director)</li><li>Cristelle Sinnett (game design, C# scripting, level design for the second level)</li></ul>\n\n<p>Music by: </p>\n<ul><li>David Boucher Dagenais</li></ul>\n\n\n<p><strong>* Spoiler alert *</strong></p>\n<p>Here is an explanation of the message that is hidden in our game:</p>\n<p>Mist awakens outside, in an unfamiliar environment. Lost in the midst of the city, he searches for his home following a red cardinal which seems to put him back on track. Yet, when he thinks he has found home, everything has changed. When approaching Mist’s house, the music fades to a sadder tone and the player can spot a \"On Sale\" sign near the entrance. Mist then enters his home, but all that was there slowly fade away, as if thoses were only memories. Mist then understand the truth : he’s been abandonned and has no home to go back too. His family left without him and will not come back for him. Wandering in the city, he begins his quest for a new home. Meanwhile, he will do his best to survive on his own.\r\n</p>\n<p>Through Mist’s story, we are trying to sensitize players to the harsh reality of abandonned pets. Our goal was to make the player feel alone and abandonned as only a cat (or any abandonned pet) can. In Québec, near 575 000 animals are left on the streets each year, and the majority of them will be cats. Out of these 575 000, 80% will end up being euthanized, lacking a family to adopt them. In recognition of these alarming statistics, we have used the opportunity that making that game represented and tried to make an amusing experience as much as a sensitizing medium in order to transmit our message and, let’s hope, make the player confront this reality which is sadly much more frequent than what we want to believe.\r\n</p>", "metacritic": null, "released": "2018-05-15", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/7cf/7cfd7bc26e4ab0a3a8ef4325d43d6386.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 230, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["maudev"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}