{"id": 135993, "slug": "opium-afghanistan", "name": "Opium Afghanistan", "name_original": "Opium Afghanistan", "description": "<p>Rencontres licites et illicites aux pays de l’opium<br/></p>\n<p>Mots : commerce ; drogue ; médicament opiacé ; secteur pharmaceutique ; Afghanistan ;<br/>Suisse ; pavot ; économie politique</p>\n<p>Pour comprendre cette controverse, nous avons cartographié la transformation d’une ressource naturelle et sa commercialisation en nous appuyant sur le cas de l’opium et de sa production. Comment certains gouvernements monopolisent-ils la définition illicite de la chaîne de production de l’opium ?<br/>Le débat public international qui en découle s’organise autour de deux régimes de vérité. Le premier suit le chemin parcouru par le pavot afghan pour produire une drogue illicite et le second la production de médicaments opiacés licites.<br/> Cette démarcation renvoie aux dispositifs répressifs mis en place pour réguler le trafic international de drogues illicites et aux normes de productions du secteur pharmaceutique. Le paradoxe de cette controverse provient du fait que ce trafic est lui-même alimenté par cette distinction entre productions licite et illicite. La politisation de l’opium s’opère au fur et à mesure de son parcours tout au long de la chaîne d’acteurs impliqués dans sa production et sa distribution.<br/> La cartographie s’apparente ici à une seule économie politique de réseaux interdépendants entre producteurs, intermédiaires et consommateurs malgré la démarcation licite/illicite.<br/></p>\n<p>La visualisation enquête sur la transformation du pavot en opium via les deux réseaux licite et illicite. Cette controverse se construit autour d’une multitude de protagonistes dont la multiplicité des points de vue permet de se détacher de considérations parfois ethnocentrées à l’égard des réseaux illicites. Les rencontres que vous ferez sur le chemin de l’opium décrivent un marché mondialisé d’une ressource bien plus politique que naturelle.<br/>Réalisation de la cartographie de la controverse [ULB]<br/>Gaëtane Bes de Berc, Arthur De Halleux, Thibault Flandrois, Laura Karam, <br/>Florence Mirel et Michele Turzi, coordonnés  par Laura Karam<br/>Réalisation de la visualisation graphique [ESA St-Luc]<br/>Quentin Fernandez, Pauline Infantino et Derek Spanier</p>", "metacritic": null, "released": "2017-11-03", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/fd0/fd03ed9c16936f768d74c2afdea8d1cc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 64, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Apossi"], "genres": [], "publishers": [], "esrb_rating": null}