{"id": 1361, "slug": "transport-tycoon", "name": "Transport Tycoon", "name_original": "Transport Tycoon", "description": "<p>Build the ultimate transport empire!<br />\nTake control of your own fledgling transport company, and use your engineering skill and business acumen to keep cargo and passengers moving - and keep the money rolling in!<br />\nTransport Tycoon contains everything that made the original PC game an all-time classic, plus a whole host of brilliant new features - bigger, richer worlds, deeper simulation and a huge variety of land, sea and air vehicles. The intuitive new touch screen interface makes it easier than ever to build and maintain your transport network.<br />\nWhether you&#39;re planning and constructing ambitious engineering projects, or simply exploring the intricately simulated workings of the game&#39;s world, Transport Tycoon is your ticket to many hours of absorbing and rewarding entertainment.<br />\nTRANSPORT TYCOON is the definitive version of the classic simulation game, created by 31x and Origin8 Technologies in collaboration with Chris Sawyer, the original designer and developer of the TRANSPORT TYCOON and ROLLERCOASTER TYCOON franchises.<br />\nBUILD<br />\n• Deploy bus and tram networks to grow sleepy towns into bustling cities.<br />\n• Lay cross-country railroads to keep industries supplied with precious resources.<br />\n• Construct massive bridges, dig tunnels and deploy earth-moving tools to carve a path through mountainous terrain.<br />\n• Build air and sea ports to transport cargo and passengers further and faster in an accelerating world.<br />\nEXPLORE</p>\n<p>• A wide range of beautiful landscapes including deserts, forests, mountains, valleys and islands.<br />\n• Several ‘real-world’ scenarios modelled on regions of North America and Europe at different periods in the 20th century.<br />\n• A richly simulated world with changing seasons and working industries, farms and towns.<br />\n• An all-new interface puts everything you need to explore and interact with the world at your fingertips.<br />\nDESIGN<br />\n• Over 150 vehicle types allowing you to choose the ideal transport solution for every situation.<br />\n• Use railway junctions and signals to allow multiple trains to share your rail routes.<br />\n• Modify vehicles and stations and assign new routes to adapt your business in real time.<br />\n• Upgrade and replace old vehicles as new and better ones are invented – all the way to supersonic jets and bullet trains!</p>\n<p>COMPETE<br />\n• Play through 49 scenarios expertly designed to suit all skill levels and playing styles.<br />\n• Try to stay one step ahead of advanced A.I.-driven competitor&#39;s companies.<br />\n• Track your progress and troubleshoot your business with in-depth company statistics.<br />\n• Prove yourself worthy of the title of Transport Tycoon and take on the life-consuming 100 Year Challenges!<br />\nLike Transport Tycoon on Facebook: http://www.facebook.com/tycoonsim<br />\nFollow Transport Tycoon on Twitter: @TransportTycoon<br />\nWWW.TRANSPORTTYCOON.COM<br />\nTransport Tycoon © 1994, 2013 31X Ltd. Created by Chris Sawyer. Transport Tycoon ® 31X Ltd. All rights reserved.<br />\nTransport Tycoon is a Universal App compatible with iPhone 4 and newer, iPod touch 4th generation and newer, and iPad 2 and newer including iPad Mini. iOS 6.0 or above recommended.<br />\nAll content and features are included with no additional purchases required.</p>", "metacritic": 81, "released": "1994-01-01", "tba": false, "updated": "2023-08-17T07:38:43", "background_image": "https://media.rawg.io/media/screenshots/404/404e1ccbe6b0e4b572d92ff798e44f9e.jpeg", "website": "http://www.transporttycoon.com", "rating": 4.23, "rating_top": 5, "added_by_status": {"yet": 6, "owned": 17, "beaten": 18, "toplay": 6, "dropped": 9, "playing": 1}, "playtime": 38, "achievements_count": 0, "ratings_count": 25, "suggestions_count": 353, "game_series_count": 0, "reviews_count": 26, "platforms": ["Android", "iOS", "PlayStation", "PC"], "developers": ["MicroProse Software", "Chris Sawyer Productions", "Chris Sawyer", "31X"], "genres": ["Strategy", "Simulation"], "publishers": ["MicroProse", "31x"], "esrb_rating": null}