{"id": 13618, "slug": "agricola-all-creatures-big-and-small", "name": "Agricola: All Creatures Big and Small", "name_original": "Agricola: All Creatures Big and Small", "description": "<p>Includes the first expansion More Buildings Big and Small!<br />\nAgricola: All Creatures Big &amp; Small is a digital adaptation of Uwe Rosenberg&#39;s award-winning two-player board game featuring farming and livestock breeding.<br />\nYou’re in charge of growing a farm from its simple beginnings -- just a hut and some fields. Send your workers to the village market to barter for goods and livestock. Breed different animals. Eventually, with your ever-growing animal population and special buildings, you’ll compete against your neighbors to see who has the best farm!<br />\nYou only have three workers in each of the eight rounds, so make your decisions count. Play against AI, or claim your plot on a worldwide leaderboard and become a strategy game legend.<br />\nKEY FEATURES:<br />\n1. Experience another faithful boardgame conversion from the studio behind Le Havre: The Inland Port and Patchwork.<br />\n2. Engage in exciting 1v1 cross-platform multiplayer matches against players from all over the world.<br />\n3. Focus on breeding the largest and most varied livestock.<br />\n4. Use the Playback feature to review your best games and learn new tricks from the pros.<br />\n5. Stay on your toes with challenging AI.</p>", "metacritic": null, "released": "2017-02-14", "tba": false, "updated": "2023-02-18T22:12:29", "background_image": "https://media.rawg.io/media/screenshots/d6d/d6da753bec15c8e7b3ced3772848f5e2.jpg", "website": "http://digidiced.com/agricola-creatures-big-small/", "rating": 2.17, "rating_top": 1, "added_by_status": {"yet": 15, "owned": 138, "beaten": 2, "toplay": 1, "dropped": 1}, "playtime": 2, "achievements_count": 14, "ratings_count": 6, "suggestions_count": 226, "game_series_count": 0, "reviews_count": 6, "platforms": ["iOS", "Android", "PC", "Linux", "macOS"], "developers": ["DIGIDICED"], "genres": ["Strategy", "Indie"], "publishers": ["Asmodee Digital", "DIGIDICED"], "esrb_rating": null}