{"id": 13628, "slug": "dear-esther-landmark-edition", "name": "Dear Esther: Landmark Edition", "name_original": "Dear Esther: Landmark Edition", "description": "<p>One of the earliest &quot;walking simulators&quot; made by the same team that developed Everybody’s Gone To The Rapture, Dear Esther is an art piece rather than a regular game. There&#39;s very little interactivity and zero action; you just walk around a rocky Scottish island in autumn. The major events of the plot are set in the past, and we only learn about them through the voice of the unseen narrator - the only voice in the game – who will read a certain letter from his past when he approaches a certain place. The letters slowly unfurl the mystery around him as you visit various locations on an island: the lighthouse, the cave, and others. The world of Dear Esther is far from open, and you can only follow the restricted pathways. To unlock all the achievements and find every audio clip, however, may require several walkthroughs.</p>\n<p>The Landmark Edition is based on the Unity 5 engine and contains better graphics, minor interface improvements and a system of achievements. It also includes the creators’ commentaries that provide additional insight into their narrative intentions.</p>", "metacritic": null, "released": "2017-02-14", "tba": false, "updated": "2024-04-18T21:19:32", "background_image": "https://media.rawg.io/media/screenshots/b20/b20a20205954f9765e82298dbd41e48a.jpg", "website": "http://www.thechineseroom.co.uk/games/dear-esther/", "rating": 3.31, "rating_top": 4, "added_by_status": {"yet": 331, "owned": 4559, "beaten": 341, "toplay": 54, "dropped": 63, "playing": 4}, "playtime": 1, "achievements_count": 44, "ratings_count": 424, "suggestions_count": 367, "game_series_count": 0, "reviews_count": 427, "platforms": ["PlayStation 4", "Xbox One", "PC", "macOS"], "developers": ["The Chinese Room", "Robert Briscoe"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["The Chinese Room"], "esrb_rating": null}