{"id": 136229, "slug": "square-samurai-platformer", "name": "Square Samurai Platformer", "name_original": "Square Samurai Platformer", "description": "<p>My submission for the Game Maker's Toolkit Gam Jam. I wanted to take the Klonoa approach where enemies are simultaneously useful tools for the player as well as adversaries. I ran out of time though so the enemies in this demo are neither useful nor adversarial. </p>\n\n<p>Pretend like the red square is actually a cool samurai who slices through foes in one clean sweep. The beige squares are evil ninja who are plaguing your hometown by being absolutely stationary in odd and inconvenient places I guess?</p>\n\n<p>Although I did not make nearly as much progress as I hoped for, I am still rather pleased with what I made. It was fun to knock the rust off and get back into video game programming for the first time in years. I appreciate having the opportunity to participate in this game jam and the motivation it gave me to create something. I plan to continue working on this, so maybe one day it can be played without having to pretend like there are samurai and ninja slicing up one another. Thanks.</p>\n\n<p>Programmed using GameMaker Studio. I have the square tool in GraphicsGale to thank for the immaculate squares.</p>\n\n<p>By the way, I was in such a hurry to hammer a few levels before the closing bell to submit the game that I didn't have time to really test them so good luck LOL</p>", "metacritic": null, "released": "2017-07-17", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/644/644f0a66e83dfba7ff991f962235b597.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 7, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["megadid"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}