{"id": 136309, "slug": "duckling-hunt", "name": "Duckling Hunt", "name_original": "Duckling Hunt", "description": "<p>Duckling Hunt is a short platformer I made, and my first completed game. That sentence summarizes the entire purpose of the project. It was just intended to be a short game I could make quickly and have released something before focusing on bigger projects. Every part of creating a game is a learning process, and while I've learned a lot of the basics with earlier games, never before have I gone through the process of putting finished pieces into a game and being comfortable with releasing it as is. That is the point of this project. To create a thing, and put it out there. It is not a great game, it probably isn't a good game, it is adequate. </p>\n<p>I used to always get frustrated when artists of any kind would say their work isn't good, when it seems pretty damn good to me. I've always known there are plenty of legitimate reasons for people to feel this way. They're comparing themselves to the greats. They see all of the little flaws. They're trying to emotionally protect themselves from people saying it isn't good. Or maybe the more manipulative artists are trying to encourage more people to complement them. Whatever their reasons, I now sympathize with them much more than before. Because I am now doing the same thing, even if we're doing it for different reasons.</p>\n<p>Here I am releasing this thing, and I cannot bring myself to do it without prefacing that the game is not good. It is likely not worth your time. A small piece of fan art takes seconds to consume. Someone's first youtube video or song is a few minutes. To experience this game you will have to download it and play it, giving it your full attention for some amount of time. I'm not entirely sure how much time that will be, your first playthrough will be less than ten minutes, seeing the full game may take longer depending on whether or not I've horribly misjudged the difficulty of the game. So I can't bring myself to confidently tell people to put the time and effort into playing this without at least warning them that it likely won't be worth it. Hopefully you find something of value, and I look forward to any feedback.</p>\n<p>If you are still interested in giving this little game a go, give it a download. I have also written up a page with all of my thoughts on the game's individual pieces. It is intended to be read after people have played the game, because it will leave (mostly) nothing left to be discovered. http://ninto55.tumblr.com/DucklingHunt</p>", "metacritic": null, "released": "2018-02-05", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/5fe/5fe745d37b14aeec30d57788162e2679.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 46, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ninto55"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}