{"id": 13637, "slug": "rogue-wizards", "name": "Rogue Wizards", "name_original": "Rogue Wizards", "description": "The Council oversees the elam families, aristocrats who are descended from the first humans in Rilfanor, and the banlits, who were originally people born without magical abilities. The Guild has never admitted banlits because of their lack of magical capacity; and they've never admitted women because they believed women were too weak-minded to control such power.<br/><br/>Now, many generations later, the elam magic is weakening, and latent magic talent has reappeared among the banlit population. Many of the elam are in denial, but some of them want to take the radical step of allowing banlits, including women, into the Guild.<br/><br/><br/><br/>In your quest you'll explore randomly generated dungeons, collect treasures, master magic, avoid traps, solve puzzles, and of course cleanse the dungeons of all the evil minions within.  Every dungeon is unique, no two locations will ever be the same.<br/><br/><br/><br/>It's not all dungeon-crawl.  Feel at home in your very own Wizard Tower where you can enhance and customize the way you play by building a thriving town, brewing your own reagents, crafting or buying your own gear, powering up your magic, and recruiting help.<br/><br/><br/><br/><br/><br/><strong>\"A smart blend of town building and dungeon crawling to create one of the most promising RPGs in years\"</strong> Dave Brevik - CEO Gazillion Entertainment, Creator of Diablo Series, Marvel Heroes<br/><br/><strong>\"Spellbind's Rogue Wizards is taking procedural roguelikes in an exciting and thoroughly charming direction\"</strong> Mike Booth -  Game Director at Blizzard Entertainment, Creator and Designer of Nox and Left 4 Dead, Founder of Turtle Rock Studios<br/><br/><strong>\"Spellbind is making exactly the kind of game I would make for mobile &amp; desktop.  I'm jealous, and I want to play!\"</strong> Erich Schaefer - President Double Damage Games, Designer Diablo 1 &amp; 2, Torchlight 1 &amp; 2<br/><br/><br/><br/><br/><strong>Every minion has a unique ability</strong> with a carefully balanced interplay of <strong>strengths</strong> and <strong>weaknesses</strong>.<br/><br/><br/><br/><strong>Six schools of magic</strong> each with a complete set of upgradable spells to bring doom upon your enemies.<br/><br/><br/><br/>Discover tons of <strong>randomized magic items</strong>, providing a nearly unlimited variety of ways to slay your foes.<br/><br/><br/><br/><strong>Randomly generated environments</strong>, no two dungeons are alike.<br/><br/><br/><br/><strong>Upgrade vendors</strong> around your tower and gain instant access to a bounty of new items and enchantments.<br/><br/><br/><br/><strong>Enchant your items</strong> and change the very nature of the magic they harbor inside, breathing new life into your favorites so you can slay more powerful enemies.<br/><br/><br/><br/><strong>Craft materials</strong> and items at your cauldron so you always have the right amount of magical essences and potions at your fingertips.", "metacritic": 67, "released": "2016-09-26", "tba": false, "updated": "2022-07-12T11:44:56", "background_image": "https://media.rawg.io/media/screenshots/cfa/cfaf4505e9f7b7e4d191a869598dd36a.jpeg", "website": "http://roguewizards.com", "rating": 2.22, "rating_top": 3, "added_by_status": {"yet": 4, "owned": 131, "beaten": 5, "toplay": 4, "dropped": 3}, "playtime": 3, "achievements_count": 18, "ratings_count": 8, "suggestions_count": 465, "game_series_count": 0, "reviews_count": 9, "platforms": ["macOS", "PC", "iOS", "Xbox One"], "developers": ["Spellbind Studios"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["Spellbind Studios"], "esrb_rating": null}