{"id": 136403, "slug": "cathedra", "name": "CATHEDRA", "name_original": "CATHEDRA", "description": "<p>Cathedra: Can I Wear Your Butt Edition, is a complete collection of the best 3 levels of the Cathedra game franchise, ever since its completion as a 7-day game-jam game. Now with an new controls menu, you now can gaze at the wonderful non-rebind-able keys, like never before! In HD*!<br/><br/>With this new edition, players can jump, punch, stack, and throw their way in the vast open-world of Cathedra's 3 arena-style levels, fully remastered for current-gen systems (just PC right now)! The gameplay was deemed hard, but rewarding, with reviewers often comparing Cathedra: Can I Wear Your Butt Edition with other titles:<br/><br/><em>\"Wow, this new game is so brutal, it's like the Cathedra: Can I Wear Your Butt Edition of walking simulators!\" - A. Reviewer.</em><br/><br/>Reports from retailers across the country have been supportive of the success of Cathedra: CIWRBE thus far. One was even quoted as saying that NOWHERE has any more copies of it available for sale! Luckily a few septillion copies of the game is available through a private auction house called \"the internet\", where many similar priceless artifacts can be acquired for a price. A hacker by the name of \"itch.io\" seemed to have somehow acquired copies of the game, and have been distributing it to the public for the price of their souls. He or she is still at large to this day<br/><br/><em>*(1600x900)</em><br/><br/>Game Features:<br/>- Two-player arena fighting-platformer!<br/>- Stack civilians on your head to gain extra power!<br/>- Jump to the top of each arena, and ring the bell to win!<br/>- Or knock the other player down to hell!<br/></p>", "metacritic": null, "released": "2017-12-20", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/692/69266e4e1f46511bff5168ce147eeecc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 21, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["GameKiwi"], "genres": ["Fighting", "Platformer"], "publishers": [], "esrb_rating": null}