{"id": 136448, "slug": "triangulo-ao-quadrado", "name": "Triângulo ao Quadrado", "name_original": "Triângulo ao Quadrado", "description": "Fuja da fábrica dominada pelos triângulos... usando seu martelo da sorte!\r\n<p>Em <strong>Triângulo ao Quadrado</strong>, você entra na pele de um quadrado trabalhador em uma fábrica de triângulos, controlada pela burguesia triangular. Num fatídico dia, você descobre o terrível segredo dessa fábrica: os triângulos são produzidos a partir de partes de quadrados inocentes, como você. Revoltado com o seu destino fatal, e armado com seu poderoso martelo e um roubado jetpack, você deve destruir a fábrica e salvar a sua espécie!</p>\n<p>Passe por níveis desafiadores, elimine os guardas da fábrica, desvie de pregos soltos e espinhos giratórios e derrote o gerente e o porteiro para fugir da fábrica a se despedaçar. Seja um quadradão, embarque nessa aventura geométrica!</p>\n<ul><li><strong>Seis níveis intrigantes </strong>para testar sua agilidade</li><li><strong>Use o seu jetpack </strong>e alcance lugares mais altos</li><li><strong>Dois chefões para enfrentar </strong>e derrotar na martelada!</li></ul>\n<p><em><strong>Triângulo ao Quadrado </strong>foi feito no processo de treinamento de novos membros, em 2017, usando GameMaker Studio 2. Ele está disponível para Windows, apenas em português, e precisa da engine instalada, gratuitamente, para ser jogado. A</em><em>lém disso, o código-fonte do jogo também está disponível.<br/></em></p>\r\n\r\nIn English\r\n<p><strong>Escape from the factory dominated by the triangles... with your lucky hammer! </strong>Here, you are a square working in a triangle factory, who discovers its terrible secret: the triangles are made from innocent squares, just like you. Outraged with its fatal fate, and equipped with its powerful hammer and a stolen jetpack<em>, </em> you must destroy the factory and save your species!</p>\n<p>Walk through challenging levels, kill the guards, divert from loose nails and spinning spikes and defeat the manager and the gatekeeper to run away from the building before it tears apart!</p>\n<p><strong>Triângulo ao Quadrado </strong>is available for Windows only in Brazilian Portuguese, and it needs the GameMaker Studio 2 engine installed to be played. The source is also available.</p>\r\n\r\nCréditos (Credits) \r\n<ul><li><strong>Programação e Arte (Programming &amp; Art): </strong>Eleazar Fernando Braga, Fabiana Dalacqua Mendes, Gabriel Silveira Pupo</li><li><strong>Som (Sound): </strong>Augusto Sanches</li><li><strong>Design de Níveis (Level Design): </strong>Eleazar Fernando Braga, Fabiana Dalacqua Mendes, Gabriel Silveira Pupo</li><li><strong>Tutoria (Tutorship): </strong>William Quelho Ferreira</li></ul>", "metacritic": null, "released": "2017-09-19", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/74e/74ec9672bbc8523af099817245ec4e1c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 83, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Fellowship of the Game"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}