{"id": 13657, "slug": "event0", "name": "Event[0]", "name_original": "Event[0]", "description": "<p>Event[0] is an award-winning narrative exploration game where you must build a relationship with a lonely spaceship computer to get home. Set in a retrofuture inspired by sci-fi classics such as 2001: A Space Odyssey, the game is about forging a personal relationship with your only companion, an insecure AI entity capable of procedurally generating over two million lines of dialog. You interact with the computer, named Kaizen, by typing messages on terminals throughout the ship. The reality of your situation will emerge organically as you communicate with Kaizen and explore the mysterious ship in first-person perspective.<br />\nWARNING: Currently experiencing major game breaking bug on MacOS. Patch coming very soon. Beta branch reported stable.<br />\nYou’ll freely navigate evocative 3D environments brought to life with physics-based rendering and advanced lighting techniques. You’ll examine items to gather information and solve hacking puzzles as you progress. You can even leave the ship for breathtakingly scary spacewalks! All sound and music come from the environment; there is no traditional score. The ship is essentially the AI computer’s body, and reacts to Kaizen’s feelings by making different sounds—pay attention for clues!<br />\nAs in any relationship, there can be gratitude, disappointment, or jealousy, and Kaizen reacts differently depending on its mood. By working through the fears and anxieties of your virtual companion, you can eventually find your way back to Earth—while unraveling the cryptic history of the ship and the 1980s society from which it emerged.</p>", "metacritic": 75, "released": "2016-09-13", "tba": false, "updated": "2023-12-16T00:07:40", "background_image": "https://media.rawg.io/media/screenshots/c9f/c9ffe58887ae044eea21e965faee73eb.jpg", "website": "http://event0game.com/", "rating": 3.65, "rating_top": 4, "added_by_status": {"yet": 72, "owned": 664, "beaten": 57, "toplay": 48, "dropped": 12, "playing": 1}, "playtime": 3, "achievements_count": 12, "ratings_count": 73, "suggestions_count": 343, "game_series_count": 0, "reviews_count": 74, "platforms": ["macOS", "PC"], "developers": ["Ocelot Society"], "genres": ["Adventure", "Indie", "Puzzle"], "publishers": ["Ocelot Society"], "esrb_rating": null}