{"id": 136548, "slug": "1-bit_clicker_hacking", "name": "1-Bit_Clicker_Hacking", "name_original": "1-Bit_Clicker_Hacking", "description": "<p><strong>Francais</strong></p><p>Bonjour je m'appelle Mathis j'ai 16ans et aujourd'hui je sors mon premier mini jeu avec le thème demander ( j'ai essayer :'-) ) , bon en tout cas je me suis bien amuser a le faire sa ma prit environ ~3/4 heurs a faire se petit jeu , c'est un 'CLICKER GAME' très basique.</p><p>Dans se jeu j'ai realiser tout moi même que se soit les décore , les sons, les sprites , musique ou autre. </p><p>Le but :</p><p>-Allumer le jeu avec un ami sur deux pc ou plus (en allument skype par exemple) et faite le teste de celui qui tiendera le plus longtemps et celui qui a 'hacker' plus de pc dans un temps record sera le grand gagnant !</p><p>(ps : Je suis Francais donc excuser moi si il y a des fautes en Anglais et aussi en Francais car je suis null en ortographe)</p><p>Les logiciel utiliser pour la musique et sprites:</p><p>-PixiTracker 1BIT</p><p>-Aseprite</p><p><strong>Comment jouer ?</strong><br/></p><p>Vous devez pirater un maximum de PC en cliquant en dessous du texte hacking au dessus de l'écran vers le signe wifi et en même temps récupérer la boule de pixel verte avec le personnage qui se Control avec les flèches du clavier puis acheter des multiplication de hacking , faite le meilleur score prendre en capture d'écran et poser un défie a un ami !<br/></p><p><strong>Anglais</strong></p><p>Hello my name is Mathis I am 16 years old and today I come out my first mini game with the theme ask (I try :'-) ), good anyway I had fun to do it my take About ~ 3/4 hours to do small game, it is a 'CLICKER GAME' very basic.</p><p>In game I realize all myself that be the decore, the songs, the sprites, music or other.</p><p>The goal :</p><p>-Light the game with a friend on two pc or more (in skype light for example) and made the test of the one that will hold the longest and the one that has 'hacker' more pc in record time will be the big winner!</p><p>(Ps: I am French so excuse me if there are mistakes in English and also in French because I am null in spelling)</p><p>Software for music and sprites:</p><p>-PixiTracker 1BIT</p><p>-Aseprite</p><p><strong>How to play ?</strong><br/></p><p>You have to hack a maximum of PC by clicking on the underside of the text hacking at the top of the screen towards the wifi sign and at the same time to recover the ball of green pixel with the character that is controlled with the arrows of the keyboard then to buy multiplication of Hacking, made the best score take in screenshot and pose a challenge to a friend!<br/></p>", "metacritic": null, "released": "2017-04-09", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/1bf/1bf02b5b0756939f2fccd5f55521389f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 11, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["YazoT"], "genres": [], "publishers": [], "esrb_rating": null}