{"id": 136512, "slug": "avocado-go-home", "name": "Avocado Go Home", "name_original": "Avocado Go Home", "description": "<p>Avocado Go Home is a game about the divide on issues younger generations face and the views from older generations of those younger generations. The game is a two player competitive side scroller game which has a clear unbalance between the two players. This is to represent the different environments older and younger generations have grown up in and the struggles younger generations are going through that older generations have never experienced growing up. Because there experiences are so different, there’s a misunderstanding from older generations of the issues younger generations go through.</p>\n<p>In the game, the player on the left represents a younger person currently facing issues like house affordability, mental health, climate change and job availability and security. While the player on the right represents an exaggerated view of an older person that has enjoyed certain luxuries in life. As for the avocado, it represents the recent comments from older generations where they say '<em>if millennials didn’t spend all their money on smashed avo on toast they would be able to afford a house'</em>. This is proven to be a pretty ignorant view and it’s the message this game aims to challenge.</p>\n<p><strong>Controls:</strong></p>\n<p>Press \"start\" on gamepad or \"escape\" on keyboard at anytime to exit the game</p>\n<p><strong>Gamepad:</strong></p>\n<ul><li>Jump - \"A\"</li><li>Move left or right - \"left joystick\"</li></ul>\n<p><strong>Keyboard:</strong></p>\n<ul><li>Jump - \"w\" for player 1, \"up arrow\" for player 2</li><li>Move left or right - \"a and d\" for player 1, \"left and right arrow\" for player 2</li></ul>\n<p><strong>Requirements:</strong></p>\n<p>2 x Xbox 360 USB gamepad OR</p>\n<p>1 x gamepad and 1 x keyboard</p>\n<p>Will run on most Windows 10 computers</p>\n<p><strong>(Note: there's a known bug where you can't start the game without a gamepad so you need at least one gamepad to play . A fix for this will be coming shortly)</strong></p>", "metacritic": null, "released": "2018-08-25", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/008/00828979a81511c3392ee0382df0e718.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 27, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Brady Johnston"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}