{"id": 136646, "slug": "shape-wars", "name": "Shape Wars", "name_original": "Shape Wars", "description": "Updated 9.16.2017\r\n-List of changes below-\r\nA short platformer created for the Mechanic Mix Jam\r\nAbout the Mechanic Mix Jam--\r\n<p>    This jam's idea was to make a game with several different mechanics that can all work together. The rules were to use 3 different mechanics, work with any amount of team members, and you could not copy the games entirely.</p>\n<p>My 3 mechanics were: Stats draining over time(I kinda came up with this, see the note below), collectables in each level to unlock extra gameplay(This is just something that occurs in a lot of games in general), and the jump height being altered dependent on how long you hold the jump button(Same deal as before)</p>\n<p>Note: because of how I got these mechanics, they aren't from one single game or anything, I truthfully don't know if this qualifies as a game for this jam, since the jam rules were kinda vague.</p>\n\r\nThe Story--\r\n<p>    A war between the Squares and the Octagons broke out, and the Squares were too weak to fight them off. Over time, only a few octagons survived due to natural causes, and these are known to be the most terrifying shape existent. These octagons have been hiding out in their lairs for a while, and this one square decides to pursue them to end the hatred towards his kind.</p>\n\r\nMechanics and Features--\r\n<p>    Shape Wars is a platformer with unique mechanics to make gameplay interesting. Features include 8 bizarre magic spells, and 4 action packed levels with awesome music by TeknoAxe.<br/></p>\n<p>    When you play Shape Wars, your stats will always be decreasing, but you do have control over them. If you move, your health will decrease, if you stand still, your attack will decrease. So think twice before you run like crazy. Each hit towards an enemy will drop a gem, these gems will boost either one of your stats slightly.</p>\n<p>Each level has a collectable hidden within it, collect these to unlock new magic spells to use!</p>\n\n<p>Side Note:</p>\n<p>Shape Wars is a temporary name, and I'll probably name it something different. Due to this, I didn't put much work into the title on the main menu.</p>\n<p>Future Development is still unknown about this project after V0.2.</p>\n<p>Controls:</p>\n<p>A/D/S to move and fall Space to jump  Mouse/LMB to aim and use magic</p>\n<p>Thanks in advance for checking this out!</p>\n<p>-ZSG<br/></p>", "metacritic": null, "released": "2017-08-07", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/412/41284ed68a8ee3a4da45bedd7229bc46.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 80, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ZaffreSheep"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}