{"id": 136661, "slug": "cursed-ascention", "name": "Cursed Ascention", "name_original": "Cursed Ascention", "description": "<p><em>I lost track of time a long-long time ago. Days, months, years and I still cannot leave this cursed place. Some people may say that it’s a price I must pay for my pride, my ambitions...for craving too much power that a simple human can possess, but these are the words of fools! I will seize the might of this Tower! I will not perish in this abandoned place! I will consume the souls of my jailers and ascend to immortality!</em></p>\n<p><strong>Note</strong>: Hello everyone! In this game we tried to combine Platformer and Tower Defense genres. The idea was to make the player move around the map as in platformer type game, but the rules of the game were similar to Tower Defense games. Later on we decided to put the game in an Egyptian setting primarily from a color scheme perspective. Whether we succeed or not it is up to you :)</p>\r\nControls\r\n<ul><li>WASD / ARROWS - movement</li><li>Space - jump</li><li>E - Open Building menu</li><li>Enter - Select turret (in building menu)</li><li>R - Rotate directional turret</li><li>Q - Sell turret</li></ul>\r\nHow to play\r\n<p>You must protect the sandclock on top of the turret from the enemies coming from desert. Turrets can only be placed on flat surfaces. Most of the turrets are directional which means that they shoot only one way, but you can rotate them by pressing R. Set’s Boiler is not firing automatically and will fire only you will press “Enter” near the turret.</p>\n<p>This game was originally created for Ludum Dare #41 game jam.</p>", "metacritic": null, "released": "2018-04-29", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/50e/50e5950434664f1d3e0a21ab356faf19.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 70, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux", "Web"], "developers": ["shide"], "genres": ["Action", "Platformer"], "publishers": [], "esrb_rating": null}