{"id": 136765, "slug": "the-tale-of-mr-fuzzy-hour-of-the-flower", "name": "The Tale of Mr. Fuzzy: Hour of the Flower", "name_original": "The Tale of Mr. Fuzzy: Hour of the Flower", "description": "<p>Join Mr. Fuzzy™ and Mr. Sloshy™, the groundhog and waterblob duo, as they work around their own little neighborhood, bringing beauty and joy in the forms of flora and art! What will your garden become?</p>\n<ul><li>Fill your garden with a variety of flowers</li><li>Go on an expedition for rare rocks</li><li>Decorate your neighborhood with sculptures</li><li>Relive the snowy tale of your past</li><li>Work towards growing and mastering the Rare Blue Flower</li></ul>\n<p>Mr. Fuzzy - a groundhog who simply loves tending his garden. He is inspired by his endearing wife Mrs. Fuzzy, a Hokkaido Red-Backed Vole, and their two young children, Peach Fuzz and Lil' Fuzz. When the rest of the neighborhood sees Mr. Fuzzy at work they tend to get inspired to help in whatever ways they can!</p>\n<p>Mr. Sloshy - a animated blob of water that one day found himself in good company with Mr. Fuzzy. Technically speaking Mr. Sloshy is genderless as he is a blob of water, but he prefers to go by male pronouns, most likely because the title had a nice ring alongside his furry companion. Peach Fuzz is very interested in his backstory...</p>\n<p>The concept of this game was originally to be a whimsical take on Groundhog Day and the thoughts and dreams that may or may not pass through the mind of a groundhog. Since initial development it has expanded and become a look into the daily life of little woodland creatures prospering in a carefree yet relatively productive environment. Lots of imagination residing in this neck of the woods...</p>\n<p>This is the author's first game to be officially released to the general public. Game and all assets including audio and art created by Christopher W. Palmer of Tyrannosounds Productions - www.chrispmusic.net</p>", "metacritic": null, "released": "2018-02-23", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/ec9/ec9d1262b8cefee6e452d4821a420251.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 61, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["tyrannosounds"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}