{"id": 13675, "slug": "wacky-spores-the-chase", "name": "Wacky Spores: The Chase", "name_original": "Wacky Spores: The Chase", "description": "Wacky Spores: The Chase is a colorful RPG runner which combines the strategy of turn-based battles with the taste of directly aiming your shots in an endless runner style.StoryA story? Let's see...<br/><br/>It looks like Roland, the King of the Bugs, has just stolen one of the Keeper of the Warmth from the Mushrooms. Be a hero, do hero stuff and get that artifact back!<br/>How does it sound?GameplayEach area of the game is an endless turn-based battle in which you'll have to defeat dozens of enemies instead of the standard handful, and try to go as far as possible. <br/><br/><br/><strong>In Wacky Spores: The Chase you don't just select your targets like other turn-based games, you manually aim weapons and abilities so that you can maximize the enemies hit and the damage done.</strong><br/>Winning a battle requires simple tactical choices like deciding which character to bring in the battlefield, choosing the right weapon for the right monster, deciding when to disable enemies and when to just attack, using items and abilities, etc.<br/>When it's the enemies turn they will move, attack and cast in real time and you'll move the three characters together to dodge bullets.<br/><br/>In every battle you collect coins by picking them up or by completing quests. The more coins you get the faster you level up unlocking more characters, weapons, artifacts etc, which in turn will push you further in every battle.What you get<ul><li>Easy to pick up but deep gameplay: just pick a weapon and start running.<br/></li><li>Tactical depth and manual aiming: move enemies around the battlefield to arrange them for the perfect shot, disable some of them or just obliterate them!<br/></li><li>Unlock a buckton of stuff : over 20 different enemies and bosses, 10 different characters, 12 weapons, 12 artifacts and 10 items that drastically change the way you play.<br/></li><li>Complete quests and pick up coins: how else would you unlock those goodies?<br/></li><li>Move your party in real time: position them for the next turn and dodge bullets.<br/></li><li>Play in a nice, colorful world, full of humour, popular culture references and supercute characters.<br/></li><li>Full 7 tracks original soundtrack by me!</li></ul>", "metacritic": null, "released": "2017-02-10", "tba": false, "updated": "2019-08-28T22:12:34", "background_image": "https://media.rawg.io/media/screenshots/dd4/dd412012c340be727147414daf4a7d70.jpg", "website": "http://www.wackyspores.com/games/wacky-spores-the-chase.php", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 6}, "playtime": 6, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 213, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Lorenzo Bellincampi"], "genres": ["RPG", "Strategy", "Casual"], "publishers": ["Lorenzo Bellincampi"], "esrb_rating": null}