{"id": 136778, "slug": "black-wolf", "name": "Black Wolf", "name_original": "Black Wolf", "description": "<p>You have been sent to a hidden Nazi base, there are rumours of a powerful super weapon being developed, you need to get inside, find out what's going on and destroy this experiment.</p><p>In this preview you can blast your way through 10 action packed levels fighting hordes of enemies who want nothing more than to make you a pool of blood. Don't forget!, there is also an epic boss fight. </p><p>Controls:<br/>WASD to move</p><p>Click and hold left click to fire your current weapon<br/>Use the mouse wheel or Q/E to switch weapons</p><p>Note:<br/>This game in no way condones the actions of the nazis.</p><p><strong>THIS VERSION IS 100% FREE HOWEVER YOU MAY PAY FOR IT IF YOU WANT TO LEAVE A TIP :)</strong><br/></p><p>In the future:<br/>This is only the start of the game, the game is going to divided into 5 episodes, this build only includes episode 1, Stay tuned for more crazyness and carnage.</p><p><strong>Changelog<br/></strong></p><p>1.2.0 <br/>-The game now runs in 800x600 instead of 640x480<br/>-All fonts should be a lot clearer now and easier to read.<br/>-Text now supports colours, So I'm throwing some more colour into some of the UI.<br/>-Weapons now drop from chests instead of just being collected<br/>-Chests are now in the game, you can get cool Items from them.<br/>-Many tweaks to different levels.<br/>-New Graphics for bullets<br/>-New Mechanics for splashing text on the screen<br/>-New sounds for, shooting, collecting and the shotgun<br/>-Some rooms will now require you to defeat a certain amount of enemies.<br/>-New Options.ini file for future use in the options screen (can be found in %appdata%/BlackWolf/)<br/>*The first 5 levels of Episode 2 are finished<br/>*The game can technically support many resolutions now (good for when the options screen will be added)<br/>*Enemies can't shoot through furniture anymore(neither can you)<br/>*Guns no longer render upside down when pointing left (finally)</p>", "metacritic": null, "released": "2016-08-29", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/c23/c2332697121da3ff33cdabcd3b21cffe.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 106, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["RedDash16"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}