{"id": 136841, "slug": "dominati-strategy-puzzle-game", "name": "Dominati - Strategy Puzzle Game", "name_original": "Dominati - Strategy Puzzle Game", "description": "<p>Welcome! Dominati is a new strategy puzzle game from Alivesoft. This is a quick tutorial on how to play the demo version of the game.</p><p><strong>Dominati </strong>has simple rules and it is the type of game that it is easy to learn but difficult to master as you move on to higher levels of difficulty.</p><p>From the <strong>main menu</strong> you can select the game characters. such as: Cats vs dogs, and Romans vs. Egyptians. The full game promises many more characters and music.<br/>First you enter your name if not already done so. There a few other buttons: Switch to Fullscreen vs Windowed, Game Settings, Help, High Scores, Select a Level and Exit the game, .</p><p>There are two ways to place your character on the board. You can either point to the target location and the character just moves there. Or you can grab the character and drop it there - whichever you prefer. On the bottom of the screen you see the remaining cards and the next character to be moved.</p><p><strong>Rule #1:</strong> The left side is your board. Try to match 3, 4, or 5 in row characters on your board, just like a typical tic-tac-toe game. Only matches made on this board count towards your score. You get 100 points for 3, 150 for 4 and 250 for 5 matches in a row.</p><p><strong>Rule # 2.</strong> The right side is your opponent's board. Try to block your opponent (the computer), from making matches especially longer ones, 4 or 5 in a row by placing your characters there.</p><p><strong>Rule # 3.</strong> There is a special character that block (usually a stone, a column, a box). Try to place this in your opponent's board to block its matches</p><p><strong>Rule # 4.</strong> There is another special character, a fire. Try to burn an opponent's character either on your board or the opponent's board to create a new opportunity for scoring.</p><p><strong>Rule # 5</strong> Whoever has the higher score of matches at the end of the round, wins the round.</p><p><strong>Winning strategy:</strong> As you play the game more and more, you will learn when it is better to match on your side or to block your opponent's side. You can also pay attention on how your opponent plays to learn what is the best strategy.</p><p><strong>Levels:</strong> Dominati has a total of 500 levels of difficulty and therefore the game play has the promise of very long journey of game excitement.</p><p><strong>Advanced mode Characters:</strong> You can select Romans, Egyptian, Vikings, Pirates, Spartans, Persians, Macedonians and Babylonians.<br/><strong>Easy mode Characters:</strong> Cats, Dogs, Jungle animals, Polar animals, Princes, Princesses, Fruits and Vegetables.</p>", "metacritic": null, "released": "2016-10-23", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/0e0/0e0de331bdbd928a25ceec49cc06d9a6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 78, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Alivesoft"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}