{"id": 13680, "slug": "cyberthreat", "name": "CyberThreat", "name_original": "CyberThreat", "description": "A rogue AI has broken loose and threatens to spread globally. The hard lines have been cut. An EM blanket has been lowered, but the AI is building a force to break out. You are a veteran of the elite Cyber Threat Task Force. Your mission: take it down.<br/><br/><br/><br/>Explore the streets, buildings, and rooftops of a 14 block urban warzone with no limitations. Locomotion options include teleportation, touchpad sliding, arm running, jumping, climbing, and even flying.<br/><br/><br/><br/><br/>CyberThreat is a city-sized playground full of intelligent war machines with their own goals<br/>and agendas. Here are just a few things you can do:<br/><br/><ul><li>Shoot ATMs and roll around in the money.<br/></li><li> Use parkour moves to climb and jump around the city like a superhero!<br/></li><li> Pick up a car, use it as a shield, then throw it at the enemy!<br/></li><li> Fight alongside a team of allies or hide and let them do all the work!<br/></li><li> Slow down time and dodge bullets!<br/></li><li> Fly over the city and fire rockets from 20,000 feet!<br/></li><li> Watch the city burn! Blow up vehicles! Shatter glass! Rain debris!<br/></li><li> Jump into Ouroboros and watch battle simulations.<br/></li><li> 11 types of mechanical fire-breathing killing machines to play with.<br/></li><li> Coming soon: More everything, plus multiplayer!</li></ul>", "metacritic": null, "released": "2016-08-18", "tba": false, "updated": "2019-08-28T22:12:34", "background_image": "https://media.rawg.io/media/screenshots/285/2850b5fd219190a278b675670fbe5fcf.jpg", "website": "http://enigmatic.global", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 9}, "playtime": 1, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 297, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Enigmatic"], "genres": ["Action", "Indie"], "publishers": ["Enigmatic", "Leading Role"], "esrb_rating": null}