{"id": 136829, "slug": "the-patriot-act", "name": "The Patriot Act", "name_original": "The Patriot Act", "description": "<p><em>The Patriot Act </em>is a fast paced co-op twin stick shooter within which the players fight together against incoming waves of demonic creatures in an effort to defend their home town. The objective is to survive through each level and defeat the Boss demons. To do this players must use a the select few weapons at their disposal to defend themselves. Once the players reach the end of a level they will encounter a Boss demon, the player must then work together to defeat the boss and complete the level. </p>\n<p>Game Features:</p>\n<p>- Use the weapons at your disposal to dispatch each and every demon that has the audacity to invade your home town.</p>\n<p>- Outmaneuver the hell-spawn using your Dash.</p>\n<p>- Hit enemies that hide from your rain of lead using your lasso to fire around tight corners. </p>\n<p>Story:</p>\n<p>Douglass Slate and his good friend Richard Johnson are relaxing at the bar after a hard day on Richards family stead when suddenly strange rifts begin to open around them. Shocked and awed Douglass and Richard grab the nearest firearm and ready themselves to fight back the oncoming horde.</p>\n<p>Characters:</p>\n<p>Douglas Slate is a cattle rancher on Richards farm and considers. He has known Richard since they were young. As lifelong friends, Douglas would give his life for his Richard.</p>\n<p>The Farmer - Richard is the owner of the farm that Douglas works on. Much like Douglas, Richard would give his life to protect his good friend. </p>", "metacritic": null, "released": "2017-11-13", "tba": false, "updated": "2019-08-28T23:22:49", "background_image": "https://media.rawg.io/media/screenshots/409/4096ce201ebdcf88d987494c2a5e90e8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 55, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Sub-Digital"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}