{"id": 136903, "slug": "promenade", "name": "Promenade (itch)", "name_original": "Promenade (itch)", "description": "<p><em>Promenade</em> est une expérience ludique qui allie la création visuelle, la collaboration dans l'espace public et la découverte auditive.</p><p>Conçu dans le cadre du hackathon \"Ludifier la ville\" du Quartier des Specatcles de Montréal, <em>Promenade</em> inviter les passants à s'amuser avec des éléments généralement réservés à la signalétique et aux restrictions routières.</p><p>Des bornes interactives et lumineuses - qui ne sont pas sans rappeler les bornes piétonnières - prennent place sur la Promenade des artistes, ainsi qu'à des lieux choisis du Quartier des Spectacles (et pourquoi pas, ailleurs dans la ville de Montréal?!). Chacune d'entre elles réserve une surprise : elle s'illumine, oui!, mais ce n'est pas tout. Restez attentif à votre environnement, chaque borne modifie aussi le mobilier urbain. Imaginez, par exemple, choisir la couleur de l'éclairage du parc Émilie-Gamelin tout simplement en vous assoyant sur un banc.</p><p>De plus, toutes les bornes, lorsque vous les touchez diffusent en direct des chaînes radio de Radio-Canada. Faites le tour pour découvrir celles qui vont proposent de la musique, des nouvelles de l'actualité . Vous pourriez même (re)vivre le passé en interceptant du contenu d'archive autrement inaccessible!</p><p>L'installation principale est un véritable jeu pour tous. Les bornes sont pensées pour être invitantes et accessibles au plus grand nombre. </p><p>- Des contrôles intuitifs et faciles à saisir.</p><p>- Une mécanique qui engage même les plus introvertis.</p><p>- Les projections lumineuses feront plaisir aux yeux et les diffusions en direct de Radio-Canada viendront combler vos oreilles.</p><p>Les plus curieux observerons que les bornes secondaires marquent en fait le chemin vers le grand jeu!</p><p>--</p><p><strong>Le jeu</strong></p><p>Des lucioles voyagent dans l'espace de la Promenade des artistes, teintez-les de vos couleurs favorites!</p><p>Activez une borne pour projeter sa couleur dans la place. Si la luciole la traverse, observez-la se transformer sous vos yeux. À la fin de son parcours, voyez comme elle aura diffusé sa lumière colorée dans l'environnement : lampadaires, colonnes et même le trottoir prennent sa couleur.</p><p>Vous remarquerez peut-être que les lucioles portent déjà une couleur. C'est leur préférence. Faites-lui plaisir pour provoquer un spectacle grandiose.</p><p>Partagez vos impressions avec toute l'assistance! Les bornes sont à votre écoute et diffusent vos plus belles paroles à même la projection.</p><p>Quelques interactions différentes</p><p>- Touchez une borne pour activer sa couleur</p><p>- Si deux bornes adjacentes sont activées au même moment, observez une couleur intermédiaire s'illuminer et monter vers le ciel.</p><p>- Si plusieurs personnes touchent une même borne, l'intensité du volume audio augmente. L'ambience est bien meilleure quand on s'assemble.</p><p>--</p><p><strong>Respect des contraintes</strong></p><p>Quartier des Spectacles</p><p>- Un jeu pour tous qui prend place dans une installation ludique accessible, facile de prise en main.</p><p>- D'une part, une expérience créative lumineuse pour personnaliser la luciole Lumina et l'environnement urbain dans lequel on se trouve.</p><p>D'autre part, un jeu de couleur et de précision, avec un objectif non restrictif, pour ceux qui veulent un peu plus de défi.</p><p>- Découvrez de nouveaux lieux de la ville dans votre recherche des bornes.</p><p>- Rangez vos cellulaires, levez les yeux en l'air! Vous jouez avec la ville et avec les gens qui se trouvent autour de vous.</p><p>UQAM</p><p>- La Promenade des artistes est déjà égayée d'une projection. Les piétons et les automobilistes l'observent quand ils y passent. Le jeu <em>Promenade</em> vous donne de nouvelles raisons de vous y rendre et d'y rester.</p><p>Radio-Canada</p><p>- Tous les contenus audio proviennent des chaînes radio de Radio-Canada. L'occasion toute indiquée de faire entendre du contenu normalement peu ou pas accessible à la population : contenu d'archive, mais aussi des chaînes localisées d'autres villes à travers le pays.</p><p>- Tous les sons entendus dans le prototype sont issus du contenu de Radio-Canada en attente de l'accès aux API, tel que discuté avec le représentant.</p><p>IBM</p><p>- Watson, l'outil Speech to text Bluemix d'IBM, enregistre vos impressions et les diffuse localement.</p><p>- Un filtre permet de sélectionner les meilleurs mots et d'afficher directement dans la projection de jeu, mais aussi sur les écrans de la Place des Arts, les abribus de la ville. Votre voix résonne dans toute la ville. Watson pourra même nous dire quel est l'émotion de la ville jour après jour grâce à l'outil Tone Analyzer. </p><p>--</p><p><strong>L'équipe</strong></p><p>Véronique Bouffard</p><p>Ugo Cloutier</p><p>Jamie Dorval Caya</p><p>Elaine Gusella</p><p>Jean-François Morin</p><p>Myriam Noël-Martel</p><p>--</p><p>Tous les contenus jeu, art, animation, programmation, installation, lumières et technologies ont été conçu par l'équipe lors du hackathon, à l'exception des contenu des partenaires faisant partie des contraintes (audio de Radio-Canada et SDK Bluemix d'IBM).</p>", "metacritic": null, "released": "2017-02-12", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/261/261b24f4278dd27dfe888d51f875b69f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 251, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Muselle"], "genres": [], "publishers": [], "esrb_rating": null}