{"id": 13697, "slug": "battle-fleet-2", "name": "Battle Fleet 2", "name_original": "Battle Fleet 2", "description": "<strong>Battle Fleet 2</strong> is the radically improved sequel to the original and has kept the “Worms” / “Scorched Earth” style angle+power mechanic, but now features full 3D modeling of terrain, ships, and ship hit locations. Hit the the engines and cripple the enemy's maneuverability, or aim for the command center and disable the ship for an entire turn. Ships are more realistic in which weapon compliments they can carry, and aiming/firing, as well as moving, is more intuitive. <strong>Battle Fleet 2</strong> also now features Fog of War, allowing for stealth tactics and surprise attacks to be a viable strategy as well as adding the importance of using ships and aircraft for recon as well as attacks. With a full featured campaign and a variety of single play scenarios, <strong>Battle Fleet 2</strong> will keep even the saltiest of sea-dogs satisfied. <br/><br/><strong>Feature List</strong><br/><ul><li>Build your fleet from 7 different ship classes each with different hardpoint locations for mounting different weapons, different mobility, and different hit locations. <br/></li><li>Use small caliber guns to pinpoint your shot and switch to devastating salvo mode, forcing all available guns in range and firing arc to fire at the same location. <br/></li><li>Equip your ships with a wide variety of weapons including AA guns, torpedoes, and a plethora of different caliber naval artillery. <br/></li><li>Utilize or neutralize a variety of aircraft, including recon planes, fighters, and bombers, launched from island bases, aircraft carriers, or cruisers. <br/></li><li>Ship captains gain experience with each Campaign battle.<br/></li><li>Play the strategic single player campaigns, random skirmish mode, full cross-platform multiplayer, or even hotseat multiplayer. <br/></li><li>Pacific and Atlantic campaigns with historical and clean slate modes for each.<br/></li><li>Use recon to clear Fog of War and defeat enemy ground based airfields and coastal artillery. <br/></li><li>Deploy Strategic Command Cards to surprise your enemies with special actions like deploying mines, sabotage, enhanced aiming, airstrikes and more! <br/></li><li>Battle Fleet 2 features full 3D models of WW2 era ships.<br/></li><li>VR Support for HTC Vive and Oculus Rift</li></ul><br/><strong>VR Support</strong><br/>Battle Fleet 2 has full VR support allowing you to play the entire game in VR and even battle against friends who are playing on desktop. The VR support is experimental so please report any issues you find and we will continue to improve the VR interactions and features.", "metacritic": null, "released": "2014-11-20", "tba": false, "updated": "2019-08-28T22:12:33", "background_image": "https://media.rawg.io/media/screenshots/db9/db971e3f77626c9fe9f8ba12dbd49d6c.jpg", "website": "http://www.battlefleetgame.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 51}, "playtime": 2, "achievements_count": 17, "ratings_count": 1, "suggestions_count": 348, "game_series_count": 0, "reviews_count": 1, "platforms": ["Android", "PC", "macOS"], "developers": ["Mythical City Games"], "genres": ["Strategy", "Simulation"], "publishers": ["Mythical City Games"], "esrb_rating": null}