{"id": 137006, "slug": "natural-hazard", "name": "Natural Hazard", "name_original": "Natural Hazard", "description": "<p><strong>Fearsome events are threatening millions of people in many cities. Can you take the role of nature to stop this from happening? Build rivers, mountains, plains and other biomes to create your ultimate nature protected from fires, floods or sandstorms.<br/>Your creativity can save the world.<br/></strong><strong>Prove it.</strong></p>\n<p>tldr: Just download it below and read \"How to play\" section in menu</p>\n<p>You're the nature, but you control/<strong>own</strong> only some parts of the landscape. Those give you your life force, the mighty <strong>mana</strong>. With your mana-fueled awesomeness, you can gain control over more of the area. <strong>Tiles</strong> in the area you control can be <strong>transformed</strong> between <strong>plains</strong>, <strong>woods</strong> and <strong>water</strong>. Their <strong>elevation</strong> can also be changed.</p>\n\n<p>With these powers you must fight a <strong>disaster</strong>, that pops up in each level and suppress them before they get to the <strong>city</strong> and cause damage. The type, elevation and presence of disaster control tile's <strong>humidity</strong> and <strong>temperature</strong>, which in turn influence mana generation or strength of the disaster. You can gain overview of this in different views of the map.</p>\n\n\n<p>More details are in menu under \"How to play\".</p>\n<p>So what are you waiting for? Look at those poor sheeps! Go save them!</p>\n\n<p>This project was made by 4 students for \"PV255 Digital games development\" course on Faculty of Informatics Masaryk University in Brno</p>", "metacritic": null, "released": "2018-02-19", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/13a/13a055ce301106d7dd7c56cfa8fa56c7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 75, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Thran Maru"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}