{"id": 137080, "slug": "combo-battle-club", "name": "Combo Battle Club", "name_original": "Combo Battle Club", "description": "Welcome to Battle Area !Game Description<p>Combo Battle Club is a 3D action game. When the game starts, player will be randomly placed on a random map with some deadly traps. Player has to cast magic skills to destroy other players (AI bot and real player) and become the last one standing in the battle area. To defeat the enemies, player can cast different magic skills by the combine button system (dragging the button to the dragging area). Player moves with a dynamic joystick in the left screen and drag the skill button to the dragging are in right screen. </p>Game Story<p>In this world, there is a god addicted into battle. He had beat down all the enemies he ever faced. He is waiting a person who can defeat him but no one success. Therefore, he creates some battle areas which have lots of monster and traps and throws people into the area. He want those people can be stronger by facing dangers until they have the quality to challenge the god and beat him. First of all, they are fighting with zombie monsters. Some of them success to against with monster and the others fail to keep their live. When the monsters are not strong enough to give danger to those people, the god try to put some of them into one battle area and only one of them can stand at the last……<br/></p>Game Features<ul><li>Random Map System: Generate map (Battle area) in each game. Let the game have different content (Number and position of the traps or blocks). There are always static map in action game in Android. It is unique in action game. It can give player different feelings to play the game again and give player a chance to make different strategies.</li><li>Combine button system: Offering player a chance to creating their own skill set. And also make a new button system. Player may drag one or more skills to use. If player dragged more than one skill, the skills will combine or become a new skill. Not only the control method is different, but also the skill combinations. It gives player new feeling on battle game.</li></ul>", "metacritic": null, "released": "2015-04-26", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/8a3/8a3d19afe10904a1640ab6dca39d5fee.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 128, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SImonChan"], "genres": ["Action"], "publishers": [], "esrb_rating": null}