{"id": 137061, "slug": "victorian-combat", "name": "Victorian Combat", "name_original": "Victorian Combat", "description": "<p>Simple hotseat Victorian Combat made for the simple game jam.  Had a coworker die so this kinda became a low priority for a long time :(  But I think I managed to get the basic idea across, of sniper taking out small units, machine guns taking out large units, and snipers taking out machine guns.  But there are no victory conditions and it's buggy and the gameplay hasn't been balanced properly and the UX needs tweaking, like changing the color of the top bar would make it easier to tell when team's placement has changed, and I wanted to have tree cover to add extra strategy to light infantry v heavy v snipers v machine guns.  And add artillery.</p><p>In the final game the red player would get to move first but the blue player gets to play defense, but has to \"hold the pass\" so to speak and gets points for how many units can still fire into the center, and both get points for kills.</p><p>We were limited to 5 simple rules but I think I'm under that because it's so unfinished :)</p><p>1. Blue player places all their units then red player.</p><p>2. Units can move a max of their speed.</p><p>3. Units can fire a max of their range.</p><p>4. Damage is dealt based on a formula where \"spread\" damages a certain percentage of the enemy per soldier in the unit and added to that a random number of straight kills averaging the same as the \"critical\" stat.</p><p>5. Tell me what you liked about this game.  Tell me what annoyed you the most, and any additional comments.  It's thrown together with duct tape so any comments help me prioritize what to fix next.</p><p>The game is pretty simple left to select, right to move or shoot.</p><p>My main project is located at http://newgaia.azurewebsites.net/</p>", "metacritic": null, "released": "2016-06-27", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/802/802976c53e70aec8a613c6a108b3aeb4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 9, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ccwscott"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}