{"id": 13701, "slug": "second-coming", "name": "Second Coming", "name_original": "Second Coming", "description": "Second Coming is a sci-fi cartoon gamebook with turn-based 3D battles (xcom-style). It is a sci-fi adventure where you and your team explore an alien ship and uncovers its secrets. This game will appeal to both gamebook enthusiasts as more traditional gamers - extending the gamebook format with digital effects and narration. The story explores the concept of origin of life and alien civilizations. <br/><br/><br/><br/><br/>They Have Waited As an alien ships approaches and make landfall on earth - prophets are interpreting a signal from the ship as \"I am Messiah\". Linking the ship to the Second Coming of the Messiah. Proclaiming salvation to be at hand in a time when the earth’s resources are running scarce and the earth most need it.The Origin Of Life The task force assembled to investigate the alien ship however makes frightening discoveries that links the ship to the origin of life - believing it to be some kind of ark that carries life across the universe to seed worlds. As the enter they ship they encounter a sign that reads \"Eden\" written in ancient script. But what are the alien’s intention and are they really linked to creation? Or are they just sinister beings that collect lifeforms for their own entertainment?Revelations What awaits them are not like anything they have ever seen before. It will be a thought provoking journey through alien environments - searching for the beings that control the alien ship and a secret far older than mankind.", "metacritic": null, "released": "2017-02-09", "tba": false, "updated": "2019-08-28T22:12:33", "background_image": "https://media.rawg.io/media/screenshots/a04/a046421ee9c88573f7ff0cc87ccf785e.jpg", "website": "http://seeninadream.net/second_coming_gamebook.html", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 314, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Seen in a Dream", "KLURA Design"], "genres": ["Adventure", "RPG", "Strategy", "Indie"], "publishers": ["Seen in a Dream"], "esrb_rating": null}