{"id": 13719, "slug": "gary-grigsbys-war-in-the-east", "name": "Gary Grigsby's War in the East", "name_original": "Gary Grigsby's War in the East", "description": "War on an Epic scale from Moscow to Berlin – this is War in the East!<br/><br/>Gary Grigsby’s War in the East: The German-Soviet War 1941-1945is the spiritual heir to the great Eastern Front board and computer wargames of the past; a turn-based World War II strategy game down to the division and brigade level, stretching across the entire Eastern Front at a 10 mile per hex scale.  Gamers can engage in massive, dramatic campaigns, including intense battles involving thousands of units with realistic and historical terrain, weather, orders of battle, logistics and combat results.  As with all the award-winning titles made by the 2by3 Games team, factors such as supply, fatigue, experience, morale and the skill of your divisional, corps and army leaders all play an important part in determining the results at the front line. Gary Grigsby’s War in the East comes with 4 massive campaigns as well as many smaller scenarios all with different strategic and operational challenges.<br/><br/>Gary Grigsby’s War in the East represents a truly epic representation of the Second World War on the Eastern Front and is unparalleled in its scale, detail, and ambition!<br/><br/><strong>Features</strong><br/><ul><li>5 major campaigns starting at 1941, 1942, 1943, 1944, 1941 (Alternate victory) all extending to Summer 1945<br/></li><li>11 scenarios range in length from 10 turns to 25 turns<br/></li><li>Map stretches from 100 miles west of Berlin to Ural mountains and from 150 miles north of Leningrad in the north to Bulgaria and Baku in the south<br/></li><li>10 miles per hex with weekly IGOUGO turns<br/></li><li>Play against the AI (either side) or watch the AI simulate the war by itself, with 5 categories of help levels for each side to adjust the difficulty level<br/></li><li>Includes traditional Play by Email and Server based PBEM+ systems<br/></li><li>Full service scenario and data editor with CSV export/import functionality<br/></li><li>Detailed stats of ground elements and aircraft affecting in game performance<br/></li><li>Up to roughly 4000 units in the game database with the ability to create many more! Division sized maneuver units with thousands of battalion and regiment sized support units<br/></li><li>Many different classes of support units like artillery, engineer, ski, anti-tank, pioneer, tank destroyer, and much more<br/></li><li>German Corps/Army/Army Group HQ's and Soviet Army/Front HQ's <br/></li><li>Air units are generally organized as groups and can run both night and day air missions, complete with night fighters<br/></li><li>Manually upgrade aircraft within units or automate new aircraft allocation<br/></li><li>Detailed production with Russian factory evacuations realistically modeled with production penalties and rebuilding delays<br/></li><li>Extensive spreadsheets and reports representing tons of data and information<br/></li><li>Detailed yet automated accounting for support personnel and supplies/fuel/ammunition Losses in individual vehicles and squads Display of the various modifiers affecting how efficiently units receive what they need<br/></li><li>More than 500 historical commanders with a detailed promotion and rating system<br/></li><li>Leaders can be dismissed, executed, fired, killed in action 8 rating fields measuring different attributes from combat skill to political rating<br/></li><li>Very detailed system to account for troops/vehicles that are disrupted, disabled and fatigued Accurate modeling of the need for training units before entering combat<br/></li><li>Detailed weather zones and ice levels for rivers with the option to randomize or fix weather patterns for each scenario<br/></li><li>Intricate Fog of War rules and unit detection levels - units are rated based on their ability to conceal themselves and their ability to recon other units<br/></li><li>Includes two major optional rules allowing you to adjust the First Winter Blizzard Effect and the Soviet Combat Doctrine.</li></ul>", "metacritic": null, "released": "2010-12-06", "tba": false, "updated": "2019-08-28T22:12:33", "background_image": "https://media.rawg.io/media/screenshots/ca3/ca36d7e11652d9be4725ae82558c0226.jpg", "website": "http://matrixgames.com/products/372/details/Gary.Grigsby%27s.War.in.the.East:.The.German-Soviet.War.1941-1945", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 16, "toplay": 1, "dropped": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 177, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["2by3 Games"], "genres": ["Strategy", "Simulation"], "publishers": ["Slitherine"], "esrb_rating": null}