{"id": 13713, "slug": "puzzle-island-vr", "name": "Puzzle Island VR", "name_original": "Puzzle Island VR", "description": "Welcome to Puzzle Island, a beautiful place where time stands still and there's nowhere you need to go. It's just you, the sand, the palm trees and of course the lovely ocean.<br/><br/>But we wouldn't want you to get bored while you're here, so how about some puzzles to solve while the sun sets?<br/><br/>In each level of Puzzle Island VR you're given various objects such as crates, buckets, balls or planks. Equipped with some of the most realistic ropes you've ever seen in a game, you'll need to somehow stack those objects to touch the glowing orb. Sounds easy, right? Well it isn't always. Sometimes the wind will blow your boxes away or the force-field prevents you putting that create exactly where you need it and often the solution is more challenging than simply stacking objects.<br/><br/>The puzzles will require you to think like an engineer, keep cool like a martial arts grand-master, have a steady hand like a marksman and also think outside of the box like an inventor.<br/><br/>But sometimes it does get a bit lonely on this beach, that's why Puzzle Islands automatic matchmaking will find other players that are working on the same level as you and match you up in a multiplayer session. But all levels in Puzzle Island are designed to work in single- and multiplayer.Features<ul><li><strong>Beautiful and realistic island</strong>: Perfect for presenting the capabilities of VR<br/></li><li><strong>Super cool rope physics</strong>: Swing them and fling them, pretty amazing.<br/></li><li><strong>Seamless Multiplayer</strong>: No searching or waiting, just play and maybe others will join.<br/></li><li><strong>No time limits</strong>: Relax, become one with Puzzle Island and take as long as you need to solve the puzzles.</li></ul>Future features<ul><li>We have a lot more planned, please take a look at the early access description to see what's still to come.</li></ul>", "metacritic": null, "released": "2017-01-17", "tba": false, "updated": "2019-08-28T22:12:33", "background_image": "https://media.rawg.io/media/screenshots/f20/f202995952c34bd5e546bdd70ca061b7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 5, "dropped": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 153, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Interaction Ideas"], "genres": ["Casual"], "publishers": ["Interaction Ideas"], "esrb_rating": null}