{"id": 13718, "slug": "seabed", "name": "SeaBed", "name_original": "SeaBed", "description": "<strong>SeaBed</strong> is a critically acclaimed yuri-themed mystery visual novel told through the perspectives of three separate characters: Mizuno Sachiko, a designer plagued by hallucinations of her past lover; Narasaki Hibiki, Sachiko's friend and a psychiatrist researching the workings of human memories; and Takako, Sachiko's former lover who has been rapidly forgetting her past, including how or why the two women drifted apart despite being together since childhood. <br/><br/>All three live in different worlds, but seek the same goal. To separate truth from illusion. To make sense of their own lives.<br/><br/>The Steam version of SeaBed has been updated to natively support 1440x1080 resolution.Characters:<br/>\"At times, I'd wake up at night and hear all the sounds around me as if they were amplified. I'd feel like my head could burst at any second.\" <br/><br/>Although she moved to Tokyo straight after graduating university in order to seek employment, Mizuno Sachiko soon quit her job to establish Clover Design with her childhood friend Takako, becoming its young CEO. <br/><br/>Her main hobby is reading, but only because nothing else manages to interest her. Although Sachiko used to be quite an avid reader during her school years, finding a job means she now only opens a book every once in a while, whenever her schedule allows it. <br/><br/>After meeting Takako – an inexhaustible source of enthusiasm, as well as a stark contrast to her own personality – during her childhood years, Sachiko’s interests began to shift to whatever the other woman was doing at a given time.<br/><br/><br/>\"This is as good a time as any, so let's check it out.\" <br/><br/>Endlessly interested in and enthusiastic about the world, Takako gives the impression of a woman perpetually stuck in her childhood. <br/><br/>She fell in love with Sachiko at first sight back when they first met at the age of five. However, she does not identify as a homosexual, stressing that Sachiko simply happened to be a woman. <br/><br/>Takako discovers that she suffers from developmental amnesia, a condition that severely impairs her ability to recall many of her memories.<br/><br/><br/>\"I just like observing people.\" <br/><br/>A psychiatrist at Narasaki Mental Clinic. She was Sachiko's classmate and friend during her elementary school years, but the two drifted apart as they enrolled in different middle schools. After learning that Sachiko has been experiencing hallucinations, she takes it upon herself to treat her. <br/><br/>She is extremely picky about her brand of coffee, perhaps because the beverage serves as her sole companion during those long hours spent immersed in research. <br/><br/>Though not religious, she is a strong believer that everything happens for a reason, and all things have their place and order in the grand scheme of the world.<br/><br/>", "metacritic": null, "released": "2020-03-19", "tba": false, "updated": "2020-12-16T14:43:58", "background_image": "https://media.rawg.io/media/screenshots/3da/3da527c8120fdff3aa467dc40e2ba4f7.jpg", "website": "http://fruitbatfactory.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 4, "owned": 27, "beaten": 1, "toplay": 2, "playing": 1}, "playtime": 2, "achievements_count": 1, "ratings_count": 2, "suggestions_count": 299, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC", "Nintendo Switch"], "developers": ["Paleontology"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Fruitbat Factory"], "esrb_rating": "Teen"}