{"id": 137282, "slug": "walls-pathealy", "name": "Walls (PatHealy)", "name_original": "Walls (PatHealy)", "description": "<p>Walls is a short, avant-garde, puzzle runner game meant to capture the complex social concept of intersectionality, as coined by black feminist theorist, Kimberlé Crenshaw. </p><p>This was a student project and mostly a proof of concept to show that games can be used artistically to show complex concepts through gameplay systems alone, without need for things like cinematic cutscenes. Though it is extremely simple, the gameplay of walls creates ludo-narrative and this on its own can function as allegory or social commentary. <br/></p><p>Controls:</p><p>WASD to move</p><p>R to restart game, L to restart level</p><p>Hold G to enter slow motion (only as a white cube)</p><p>An artistic statement on Walls:</p><p>\"The goal of my game, 'Walls', is to demonstrate, through allegory, the concept of intersectionality. Given games', as a medium, capacity to encourage empathy, I thought that making a game about the complex concept of intersectionality had potential for effectively communicating (at an obviously minor level) the frustrating experience of living through discrimination.</p><p> My audience is difficult to precisely identify. As with other 'Games for Change' of this kind that try to advocate for some form of social justice, they require a very specific type of open-minded player who would be interested in playing a game they aren't familiar with. In theory, the perfect situation for this game would be if someone who doesn't understand the concept of intersectionality plays the game without being told what the game's about, experiences the frustration the game exhibits, and then is told what the game is depicting; this would hopefully function as a great learning experience. </p><p>Though the game has several bugs that irritate me immensely as someone critical of their own work, the game is largely successful, in so far as it is a functioning game whose mechanics form a theme on discrimination. It is a little too easy, if anything; I am worried that it shows discrimination to be more of a mere annoyance than the overwhelming, challenging, terrible force that it can be. Altogether, though, the game properly demonstrates inequality and unfairness. </p><p>Like any work of art, I think this game largely expanded past my original intentions to say more than I originally intended; this both comes from features I decided to add late in the development of the game (often discovered as bugs in my code that actually fit thematically) and unintended thematic suggestions of my game mechanics.</p><p> The basic mechanics of the game are as follows; the player character, of a certain shape and color, is constantly moving forward and being greeted by rows of walls of varying colors and heights. Based on the character's attributes, they can go through some walls and not through others. So, cylinders can only go through short walls; cubes don't have to worry about wall height. Orange shapes can only go through orange walls; blue shapes can go through blue or orange walls; white shapes don't have to worry about color of walls. The game randomly iterates through each type of player.</p><p> The walls function as an allegory for boundaries between someone and 'success'; it's obviously very vague, but that can give the allegory flexibility. Since certain player characters can go through fewer walls than others, based on physical characteristics, it shows that certain people have fewer options than other people, displaying a vague form of discrimination that could be institutional or personal. Since this discrimination is based on multiple features, both color and shape, if functions as allegory for intersectionality, as if color and shape were allegory for race and gender, for example.</p><p> There are three main features of the game I later found that I didn't fully plan for. The first two pertain to the white cube character, specifically. The white cube is unaffected by any of the walls, simply bursting through every wall without effort; since forward movement is automatic, the game literally plays itself if you are a white cube (if we follow my allegories, this character is a Caucasian man). Yet, when you play it, the game feels very satisfying and fun; breaking through the walls feels like you are really doing something challenging, it made me feel almost proud of myself. Yet when compared with the other characters, the white cube's struggle is nothing; I think this is a great illustration of privilege. The white cube could not possibly understand the struggles of the orange cylinder, for example; they experience completely different types of struggles, though the white cube may think it understands, since it does experience breaking through walls. I added the function of slow-motion to the white cube to extend this; if you hold down 'G', only as the white cube, the game goes in slow motion. This adds an extra privileged mechanic to the white cube that is completely unnecessary for the character to overcome its struggles, similar to an excessive concentration of wealth in demographics that don't need it. </p><p> Finally, when characters get to a wall that they cannot pass, for example, a blue cube gets to a white wall, they cannot pass the wall and will lose the game, however, they still break the wall. This mostly came out of how I handled creating the logic of when a character loses on the coding side; however, I felt it fit the theme of the game. It makes the game hopeful; even though the character has failed, the wall is now broken down for future characters of that type to get through, like how Moses Walker paved the way for future black men in Major League Baseball or some other forgotten hero who broke a glass ceiling. I didn't fully extend this so that this wall would stay broken down for future characters (out of technical limitations), but the allegory still stands, within those instances.\"</p>", "metacritic": null, "released": "2017-05-08", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/bb0/bb0d08f0b26565abf1ef067d6a756fb1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 15, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS"], "developers": ["PatHealy"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}