{"id": 13724, "slug": "fleet-defender-the-f-14-tomcat-simulation", "name": "Fleet Defender: The F-14 Tomcat Simulation", "name_original": "Fleet Defender: The F-14 Tomcat Simulation", "description": "<strong>THE F-14 TOMCAT SIMULATION</strong><br/>\"Launch the Ready-Five, Launch the Ready-Five.\"<br/><br/>The catapult officer calls for full afterburner. 50,000 pounds of thrust spools behind you as your F-14 strains for release. Less than three seconds later your Tomcat screams through the air at 150 knots. You climb to meet your wingman, then head off to join the fight.<br/><br/>Fleet Defender is the first flight simulator to accurately recreate carrier-based operations. Experience all the excitement of a catapult launch, realistic air-to-air combat and the challenge of landing on a pitching deck. You'll be drawn into the high-stakes world of Navy's top guns.<br/><br/>Start your career the same way as a real F-14 crew: training at Oceania Naval Air Station, Virginia, home of the Atlantic Fleet Tomcats. From there, you're bound for duty in the Arctic waters of Norway's North Capa or in the southern Mediterranean, of the Libyan cost. You'll need razor-sharp piloting skills to defeat hostile aircraft using state-of-the-art fighter tactics.<br/><br/><ul><li>Accurate cockpit representations.<br/></li><li>Realistic enemy AI. New artificial intelligence is patterned after Soviet and Third world military doctrine.<br/></li><li>Expanded Player-Wingman interaction. As flight leader, a wide range of interactive commands allow you to exercise complete tactical control of your wingman.<br/></li><li>Terrain graphics. The latest 3-D terrain generating technology produces a vivid, detailed world based on digitized data from the U.S.G.S (United States Geological Survey)<br/></li><li>Strike packages. Each mission requires you to integrate your F-14 with a variety of modern naval aircraft.<br/></li><li>New enemy aircraft. Face the latest in Soviet fighter technology, the Su-27 and MiG-31. Use your Tomcat to hunt down \"Bears\", \"Badgers\" and \"Backfires\".</li></ul>", "metacritic": null, "released": "1994-04-17", "tba": false, "updated": "2023-02-08T10:42:29", "background_image": "https://media.rawg.io/media/screenshots/820/820d83de30ed930aa2246dfaa5502775.jpg", "website": "http://www.retroism.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 54, "dropped": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 330, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "Linux"], "developers": ["MicroProse Software"], "genres": ["Simulation"], "publishers": ["Nightdive Studios", "Retroism"], "esrb_rating": null}