{"id": 137305, "slug": "snow-wolf-and-dog-fc_jam-edition", "name": "Snow Wolf and Dog (#FC_JAM Edition)", "name_original": "Snow Wolf and Dog (#FC_JAM Edition)", "description": "<p><strong>You are not the hero. You are dog.</strong></p>\n<p>This is a <em>souls-like</em> PICO-8 console game, playable in your browser or on the PICO-8 Fantasy Console. </p>\n<p><strong>A must for fans of Bloodborne, Dark Souls and Nioh.</strong></p>\n<p>The legendary matagi hero Snow Wolf is once again called for help, in order to rescue the mayor's children from the Yakuza, taken under dubious circumstances. A blizzard blows, and visibility is weak. Snow  wolf sets out, with a sidekick, dog, in order to save the children and bring justice to the evil-doers. But by kami-sama is he so damned tired of all of this.</p>\n<p>Snow Wolf is powerful. Snow wolf can kill his foes in a few blasts of his trusty rifle. But dog is just dog. Good dog :-)</p>\n<p><strong>Game features:</strong></p>\n<p>* Souls-like gameplay<br/>* Stamina management<br/>* Rest and resume at bonfires<br/>* Different enemy types with various attacks and personalities<br/>* Challenging gameplay<br/>* Sound</p>\n\n<p><strong>***HINTS***</strong></p>\n<p>Always wait for Snow Dog, don't rush ahead too far, or Snow Dog won't be able to shoot the enemies for you. Take your time.</p>\n<p>Invincible Dash through enemy attacks - they are telegraphed, so make sure you dash at the right time or you will be hit.</p>\n<p>Don't be afraid to walk back or away from enemies - but don't run away the wrong way or you'll bring in more enemies!</p>\n<p>If you are low in health, go to Snow Dog and let him know.</p>\n<p>Rest at bonfires or you will lose your progress!</p>\n<p><strong>(This is my first time coding in a Game Jam, and coding for the PICO-8, and also first time coding in LUA!)</strong></p>", "metacritic": null, "released": "2017-11-05", "tba": false, "updated": "2019-08-23T11:30:55", "background_image": "https://media.rawg.io/media/screenshots/4ce/4ce0ced9b86dfa6951daf94ffc907c9c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 200, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Web"], "developers": ["Gymcrash"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}