{"id": 137329, "slug": "yell-fighter", "name": "Yell Fighter", "name_original": "Yell Fighter", "description": "<p>A Tasjam 2015 entry by Team Konami Code. We decided to take the theme of voices quite literally by implementing a game with voice controls.</p><p>Yell Fighter is a modern take on the classic beat 'em up. Instead of mashing buttons, you and a friend can yell your commands at your character, causing them to punch, kick, jump and throw fireballs at each other. Or not as the case may be most of the time. In addition scores are routed out via an arduino to a physical life meter, complete with a 'bell' that rings at the start and end of the round.</p><p>So it turns out that building a networked multi player game with voice controls and a physical hardware interface is a bit of a challenge to pull of in 32 hours. So what we've got here is a very rough first prototype of the game. Voice controls are mostly implemented, the hardware interface works too and in theory the network part works on a local host. But we've not had time to test any of these features, there are bugs galore and the game may not work in it's uploaded state. We've submitted really just to show we did something across the weekend, but the game is probably unplayable in its current state. Hey - we would rather fail running at full speed than succeed walking slowly.</p><p>With some luck and a bit of spare time we're keen to finish the game off - or atleast get it to a point where is plays as an actual game. Yelling at a screen in the wee hours of the morning is surprisingly relaxing, so we think we're onto something here.</p><p>Team Konami Code is : Troy Merritt, Cameron Yates, Chris Lawrence, John Kendall and Ryder Boynton. All trusted professionals.</p>", "metacritic": null, "released": "2015-09-13", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/9b6/9b630ceb4d80fe4aa91386b7a7621564.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 51, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["dangertroy"], "genres": ["Action"], "publishers": [], "esrb_rating": null}