{"id": 13734, "slug": "spaceport-hope", "name": "Spaceport Hope", "name_original": "Spaceport Hope", "description": "Spaceport Hope is a 2D action platform shooter featuring a retro-style pixel world.<br/>Packed with 13 unique bosses and tons of enemies, Spaceport Hope is ready to challenge every aspect of your gaming abilities!<br/>Collect items, unlock achievements, and fight till the end through a well crafted world.<br/><br/>The game is about planetary government trading with an advanced alien race, which goes bad.<br/>You play as a badass courier who takes a government job, but is soon sucked in the events of an upcoming assault by the Cilarian alien race. He does what he can to save his own skin as well as the world he's living in.<br/><br/><br/><br/><br/><br/>Travel to all 10 planets and explore a wide variety of levels, each one with its own unique enemies and gameplay features.<br/>Meet aliens, pirates, hackers and more in your epic journey!<br/><br/><br/><br/><br/><br/>They'll just keep coming at you! With more than 60 enemies, each one with its own special abilities, you will be challenged till the very end. Make your way through all the bosses and reach the epic final fight, where your victory will determine the fate of the world!<br/><br/><br/><br/><br/><br/>Fighting all those enemies and bosses without cool guns would be so boring.<br/>That's why we have those 12 awesome guns for you. Make sure not to leave any enemies behind!<br/><br/><br/><br/><br/><br/>While playing the game you will be accompanied by both an amazing soundtrack, with songs for every different area, and the best sound effects possible!", "metacritic": null, "released": "2016-04-15", "tba": false, "updated": "2023-01-09T03:39:26", "background_image": "https://media.rawg.io/media/screenshots/a10/a1007ffbf780343f1afb8935b4b2328a.jpg", "website": "", "rating": 1.81, "rating_top": 1, "added_by_status": {"yet": 17, "owned": 610, "toplay": 1, "dropped": 7}, "playtime": 4, "achievements_count": 24, "ratings_count": 20, "suggestions_count": 277, "game_series_count": 0, "reviews_count": 21, "platforms": ["PC"], "developers": ["team BitClub"], "genres": ["Action", "Adventure", "RPG", "Strategy", "Simulation", "Sports", "Racing", "Casual", "Indie"], "publishers": ["team BitClub , Sunken Treasure Games"], "esrb_rating": null}