{"id": 137334, "slug": "square-chainz", "name": "Square Chainz", "name_original": "Square Chainz", "description": "<p>If you thought counting was easy... think again!</p><p>Square Chainz is an addictive free indie game born from an actual dream. Choose either the next number up or down from the middle row – sounds easy, except the columns shift at an increasingly fast pace as you race to create chains of numbers against the clock. Just don't miss...</p><p>Inspired by the most difficult retro puzzle games we love, Square Chainz tests your reaction speed to the limit in quick, brain-melting rounds packed with delicious visuals and a unique 15-piece soundtrack.</p><p>Exercise ninja reflexes with zen focus as you cut through 30-second levels filled with dazzling colours and gripping music. Play with super rhythm and epic chains will flow – panic, and one mistaken clash of numbers could crush even the most determined gamer.</p><p>★Enjoyed the game? Want to support us and get some stylish wallpapers? Buy them below.<br/></p><p>★Love the music? Our soundtrack includes 11 amazing variations of the Square Chainz music, buy it below or check it out here: https://squarechainz.bandcamp.com</p><p>A few reviews from our android version -</p><p>\"<strong>Simple concept designed to perfection</strong> Great rhythm to the gameplay, wonderful presentation, and fantastic core concept.\"</p><p>\"<strong>Instantly in Love</strong> It only took me 5 minutes to fall in love with this game. The vibrance and saturation of the game draws you in, but the fast paced and addictive gameplay keeps your fingers tapping away. Easy to play and difficult to master, Square Chainz is a winner.\"</p><p>\"<strong>I can't count...</strong> Great game! Well polished, addictive, rage-inducing, loving it!\"</p>Credits &amp; Thanks<p>Square Chainz was created by: James Scaman, Matt Taghioff and Simon Bevis.</p><p>With special thanks to the following people without which we couldn't have made Square Chainz: Caroline Jack, Milo the Dog, Zelda the Cat.</p><p>Also thanks to Austin Anderson for letting us use his font \"Blocked\" (get it here), MadPixel Designs (Ashley Denham) for giving his font Minecrafter 3 away for free for us to use (get it here) and Captain Falcon for creating his font Jet Set (get it here).</p><p>Our testers: Danny Williamson, Jonny Stoten, Adam Walker, Phil Mower, Tom Jones, Matt Taylor, Amy Josie Smith, Tim Peterson, Vilhem Zouhar, @RedWarp @NoakseyV1, @ManicNorth, @TCherryGames, @xAC7ION_CRYSISx, @omgtumbleweed</p>", "metacritic": null, "released": "2015-07-29", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/086/086105b7444ac4b1e51d01886534851e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 60, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["squaregamez"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}