{"id": 1374, "slug": "sky-force-anniversary", "name": "Sky Force Anniversary", "name_original": "Sky Force Anniversary", "description": "<p>Sky Force Anniversary is a vertical shoot-em-up game developed by Infinite Drems Inc. It is heavily inspired by the old Japanese arcade machines, like the ones made by Capcom.</p>\n<h3>Gameplay</h3>\n<p>The players have a plane that they use to attack their enemies head-on, evading return fire. Multiple planes are present in the game, with each one of them having their own stats and gameplay. Every player will be able to find their favorite pick. </p>\n<p>The primary objective of each level is to get to its end without getting blown up by enemy planes, as most enemy shots are fatal. The levels consist of a mix of challenging and easy moments with the difficulty rising with each encounter. There are several boss fights present in the game. There are also several side objectives. Usually, there are four of them: destroying 70% of the enemies, 100% of the enemies, saving all the people present on the level, completing the level without getting any damage.</p>\n<p>Sky Force Anniversary features a very balanced economic system. The players are awarded stars upon destroying an enemy plane. These stars serve as an in-game currency. It is used for upgrading your plane or purchasing new ones. The amount of stars awarded to the player depends on the chosen level difficulty.</p>\n<p>Unlike the previous title, Sky Force 2014, Sky Force Anniversary is not a free-to-play title. Thus it does not rely on microtransactions in its gameplay.</p>", "metacritic": null, "released": "2015-04-29", "tba": false, "updated": "2023-12-05T14:47:38", "background_image": "https://media.rawg.io/media/screenshots/eec/eec2814d3b70f84c35714d9e2faa3656.jpg", "website": "http://www.idreams.pl/our-products/show/product/76-Sky-Force-2014", "rating": 3.5, "rating_top": 4, "added_by_status": {"yet": 41, "owned": 1087, "beaten": 59, "toplay": 12, "dropped": 80, "playing": 13}, "playtime": 4, "achievements_count": 89, "ratings_count": 241, "suggestions_count": 529, "game_series_count": 1, "reviews_count": 242, "platforms": ["macOS", "Wii U", "Linux", "PlayStation 3", "PlayStation 4", "PS Vita", "iOS", "PC", "Nintendo Switch", "Xbox One", "Android"], "developers": ["Crunching Koalas", "Infinite Dreams"], "genres": ["Action", "Arcade", "Casual", "Indie"], "publishers": ["Infinite Dreams"], "esrb_rating": "Everyone 10+"}