{"id": 137430, "slug": "birds-of-steel-itch", "name": "Birds of Steel (itch)", "name_original": "Birds of Steel (itch)", "description": "BIRDS OF STEEL\r\n<br/>    A failed 7DRL, by Escada Games<br/><br/>\r\nCONTEXT AND OBJECTIVE\r\n<p> The country of Jandira is on the verge of breaking: attacks from the beligerant country of Pina, known for their skilled airplane pilots, left Jandira with only one airport left.</p>\n<p> All the pilots of Jandira deserted, except for one: Jao, a rookie full of courage. In Birds of Steel, you play as him, trying to overcome the odds against a much bigger power.</p>\n<p> The objective of the game, then, is find enemy airports and attack them, converting them into property of Jandira.</p>\n\r\nMOVEMENT MECHANICS\r\n<p> As a airplane pilot, you have a diferenciated moveset than the usual.</p>\n<p> First, every turn you will move a tile foward: just like a real airplane, you may not stand still on a same tile. The same applies to your enemies. Moving a tile will cost one unit of fuel (except one special cases; see below). If you don't have fuel anymore, your plane will crash and you will die. <br/></p>\n<p> Also, you cannot choose a direction and immediatly move towards such direction; you must slowly turn towards such direction. There is one exception thought: you may at any moment do a U-Turn, changing move direction by 180º.   <br/></p>\n<p> There is one last move: the Aileron Roll. Doing a Aileron Roll will give you a major defense boost, at the cost ofusing five times (5x) more fuel.</p>\n<p> To aid the search for enemy bases (and allied bases as well, for when necessary to find one ASAP), there is an arrow that indicates the closest enemy base (and another that indicates the closest allied base).</p>\r\nCOMBAT MECHANICS\r\n<p> Your plane comes with two machine guns, that have the ability to lock-on your enemies. Once a enemy passes in front of the plane, they will lock onto him; however, they will change focus if anotherenemy passes in front of you. To prevent this from happening, you always can permalock the guns on a enemy: this way, the targetwill only change again when the enemy is dead or the permalock<br/>is desactivated.</p>\n<p> Attacking must me manually inquired and costs ammo and one turn. Permalocking costs no turns. If there are no bullets left, youwill not be able to attack.</p>\n<p> Destroying enemies and enemy bases allow you to buy new upgrades<br/>at allied bases.</p>\r\nALLIED AIRPORTS AND UPGRADES\r\n<p> Landing on allied airports will fix your plane, also filling fuel and ammo. You are able to make upgrades as well, using credits obtained from destroying your enemies.</p>\r\nCONTROLS\r\n<ul><li>NUMPAD 9 / E - Turn right;</li><li>NUMPAD 7 / Q - Turn left;</li><li>NUMPAD 8 / W - Go foward;</li><li>NUMPAD 5 / S - U-Turn;</li><li>NUMPAD 1 / Z - Shoot;</li><li>NUMPAD 2 / X - Enable/disable Aileron Roll;</li><li>NUMPAD 3 / C - Enable/disable permalock;</li><li>NUMPAD , / V - Open/Close upgrade menu, when possible;</li><li>NUMPAD + / R - Zoom In;</li><li>NUMPAD - / F - Zoom Out;</li><li>Number keys  - Select upgrade when possible.</li></ul>", "metacritic": null, "released": "2018-03-12", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/148/1487d7555bdc0db4b6e079737a6ce38c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 7, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["Delta Key", "Sklaiser"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}