{"id": 13749, "slug": "oozi-earth-adventure", "name": "Oozi: Earth Adventure", "name_original": "Oozi: Earth Adventure", "description": "Oozi: Earth Adventure is a classic 2D platformer with old school gameplay -  no puzzles, no punishment, just 100% pure classic platforming fun! Its most prominent features are HD visuals and beautiful hand-drawn art, but despite its visual style, it’s a good fit for all kinds of gamers. The variety of difficulty levels – from Kid to Hardcore – allows everyone to enjoy the game regardless of their skill level. It tells the story of Oozi - an alien spaceship pilot who crashed on planet Earth, lost his space suit and needs to find his way home. <br/><br/><br/><br/>The game heavily utilizes Steam integration, including Achievements, Leaderboards, Cloud Save, Trading Cards and special feature – Quantum Ghosts, holographic recordings of players from alternative universes.<br/><br/><br/><br/><ul><li>Relive an <strong>old-school</strong> platformer experience - this time with beautiful, <strong>high-definition visuals</strong>.<br/></li><li>Four difficulty levels, including Kid difficulty - made specifically for the youngest gamers<br/></li><li>Quantum Ghosts - watch how players from alternative universes played through the game<br/></li><li>Challenge mode - additional 44 short, but extremely difficult levels with various objectives <br/></li><li>Fight <strong>various enemies</strong> and discover new gameplay mechanics in <strong>distinct worlds</strong> - jungle, cave, lab or even an alien planet.<br/></li><li>5 hours of story mode – 20 levels and 4 boss fights <br/></li><li>Steam Achievements, Leaderboards, Cloud Save, Trading Cards and Full Controller Support</li></ul><br/><br/><br/><ul><li>Oozi Earth Adventure offers an addicting platformer experience that hearkens back to the days when \"scrolling parallax backgrounds\" were super hip and the entire summer's agenda was to set a new high score. - Impulsegamer<br/></li><li>Fantastic visuals and tight platforming - extraguy.com<br/></li><li> Oozi: Earth Adventure feels like it deserves pride of place in a SEGA Mega Drive compilation - dealspwn.com<br/></li><li> ... absolutely stunning to see... , with a lush array of colors... impressive 2D artwork as the lush environments and bright world look fantastic... - armlessoctopus.com<br/></li><li> ...provides a solid platforming experience, complete with lush visuals and challenging gameplay... worth playing for any fan of 2D side-scrollers... - extraguy.com<br/></li><li> ... fun platforming game with magnificent visuals ... - gamerdork.net<br/></li><li> ... it’s strong in every department, and it’s an absolute must buy ... - writingsofmassdeduction.com</li></ul>", "metacritic": 66, "released": "2013-12-05", "tba": false, "updated": "2023-07-03T20:40:11", "background_image": "https://media.rawg.io/media/screenshots/349/3493604e42f2086ba838d8eb62d746e0.jpg", "website": "", "rating": 2.9, "rating_top": 3, "added_by_status": {"yet": 7, "owned": 475, "beaten": 6, "dropped": 2}, "playtime": 3, "achievements_count": 35, "ratings_count": 19, "suggestions_count": 237, "game_series_count": 0, "reviews_count": 20, "platforms": ["PC"], "developers": ["Awesome Games Studio"], "genres": ["Casual", "Indie"], "publishers": ["Awesome Games Studio"], "esrb_rating": null}