{"id": 137531, "slug": "2-cubes-1-ball", "name": "2 Cubes 1 Ball", "name_original": "2 Cubes 1 Ball", "description": "<p><em>Is this my first game? Well no. Everybody starts with their massive masterpiece of a game, including me, and then stops because it will take over a thousand hours to finish.</em></p>\n<p><strong>Description</strong><br/></p>\n<p>2 Cubes 1 Ball is about two cubes and one ball bouncing between them. There are three different modes: Special, Singleplayer and Multiplayer. In special you control both of the cubes, but you can only control one at a time. In singleplayer you play against the computer and in multiplayer you play against a friend.</p>\n<p>In special the highscore refers to the amount of bounces without missing, while in singleplayer it refers to the amount of times you didn't miss in a row (not interrupted by missing of the computer). The little red cube is where the computer things the ball will be.</p>\n<p><strong>Controls</strong><br/></p>\n<p>The controls are displayed in the game, but for reference:</p>\n<ul><li>In special, singleplayer and multiplayer, the left cube moves up with Q or W and down with Z or X.</li><li>In special the right cube is moved using the same buttons as the left cube.</li><li>In multiplayer the right cube moves up with O or arrow up and down with M or arrow down.</li></ul>\n<p><strong>Updates</strong><br/></p>\n<p>I plan to add a pause function to the game and further improve the AI, because it acts like a nervous little girl. Perhaps a little theme song could be fun aswell, but that might get annoying after a while. Feedback from you will also be taken into account, so please leave a comment if you wish to provide feedback.</p>\n<p>In update 1.1 I added sound effects and fixed some buggs and in update 1.2 the AI was improved and more buggs were fixed. If you want to play againts to old AI, turn down the difficulty to the lowest setting.</p>\n<p><em>Total development time: 33 hours</em><br/></p>", "metacritic": null, "released": "2018-08-19", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/8d0/8d017e889e83a42f21211563cb76c51b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 10, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Mika la Grand"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}