{"id": 13760, "slug": "camtasia-subscription", "name": "Camtasia - Subscription", "name_original": "Camtasia - Subscription", "description": "Looking to edit and share your most epic gaming moments but not sure where to start? Camtasia’s powerful, yet easy-to-use, video editor allows you to make amazing game recordings and videos that will engage your viewer with ready-to-use themes, animated backgrounds, graphics, callouts, and more. <br/><br/>Our behaviors will allow you to quickly add engaging animations to images, video and text. Drag and drop or edit content directly within the preview window for precise control over the final look of your video. You’ll also enjoy the ability arrange video, audio, images, callouts, animated content, and more on an unlimited number of tracks. Once you are done editing your content or adding interactive elements into your montage you can share your videos anywhere, or even build your own YouTube channel of content.<br/><br/><strong>Additional Features </strong><br/>• Import video from 3rd party recorders (OBS, Fraps, Win10 Game DVR, and more...) or use Camtasia’s built-in recorder<br/>• Add behaviors to quickly animate images, video or text<br/>• Add callouts to highlight action <br/>• Include text, transitions, and title screens <br/>• Adjust clip speed <br/>• Use zoom and pan to focus attention <br/>• Show macros/keystrokes <br/>• Output directly to YouTube or a variety of other outputs", "metacritic": null, "released": "2015-08-29", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/988/9881d24d6a3638549e742c0e6ccb6498.jpg", "website": "http://www.techsmith.com/camtasia.html", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 112, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["TechSmith"], "genres": ["Educational"], "publishers": ["TechSmith"], "esrb_rating": null}