{"id": 137756, "slug": "the-resurrection-of-cthulhu", "name": "The Resurrection Of Cthulhu", "name_original": "The Resurrection Of Cthulhu", "description": "Team members:\r\n<p>–Art and Game Design: Yingyan Li. (Great Artist and Game Designer!)</p>\n<p>–Programming and Game Design: Xiaoxiao Ma (That is Me!)</p>\n<p>–Programming and Assets Integration: Ahmed Ahres (Helped a lot for the progress)<br/>Music and Sound Effects by Eric Matyas http://soundimage.org/</p>\r\nJunction 2016 Project \r\nSteps to pass the game.\r\n<p>**Don't read it before you play!!!!**</p>\n<p>**Don't read it before you play!!!!**</p>\n<p>**Don't read it before you play!!!!**</p>\n<p>**You need to find 8 tentacles and take them to the Cthulhu**</p>\n<p>1. There is a hidden tentacle behind a rock. Drag it up multiple times to get it.<br/>2. Click on the boxes. Find the box with a ghost on it. double click on it to find the tentacle.<br/>3. use a small rock to hit on the wall 3 times. A box will show up. Click on the ward to get it. Use the ward to burn the box. Before it is burned up, use a water bottle to put out the fire and get the tentacle.<br/>4. Use the ward in the darkness to see where the tentacle is.<br/>5. use the ash from the burned box on the big monster to get it.<br/>6. Feed the Cthulhu 4 fish. It will grow a tentacle itself.<br/>7. A poop appear after you feed the Cthulhu. use it on the seagrass to the left. Then go up, drag the ship down twice. A ghost captain appears. Click on the tentacle on that captain.<br/>8. Drag the 7th tentacle on Cthulhu several times, it will fall apart. Take it to the person to the most right. A new tentacle shows up and take both of them back to Cthulhu.</p>", "metacritic": null, "released": "2016-11-28", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/ce7/ce7324db1f48e83302aa3046ea83a3f7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 14, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["tcmxx"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}