{"id": 13776, "slug": "whos-your-daddy", "name": "Who's Your Daddy", "name_original": "Who's Your Daddy", "description": "DescriptionWho's Your Daddy is a casual 1 on 1 video game featuring a clueless father attempting to prevent his infant son from certain death.Current Features<ul><li> A beautiful home for you to watch over your son in<br/></li><li> Physics based game play allowing you to move small objects as you please<br/></li><li> Beautiful compositions to be played on your baby's piano<br/></li><li> Two unique character types to play as<br/></li><li> Randomized locations of crucial items<br/></li><li> Awesome power ups for being able to do chores<br/></li><li> Available for PC, Mac and Linux/Steam OS</li></ul>The CharactersWho's Your Daddy features two different characters to play as, the daddy and the baby. DaddyThe daddy's goal is to prevent the baby from dying. He has a number of items that can be found inside the house to help him complete this task such as:<br/><ul> <li> Power Outlet Covers<br/></li><li> Cabinet Locks<br/></li><li> Pills</li></ul>The father player also has the option to do various chores around the house, such as cleaning up toys or changing a smoke alarm battery. Doing these side activities rewards the father player with a power up to help him watch over his son. Some examples of these are:<br/><ul> <li> Peek-A-Boo: Makes the daddy invisible<br/></li><li> Bat Dad: Daddy can see baby's health and location through walls<br/></li><li> Say Momma: Daddy can see the location of important objects through walls</li></ul>The daddy player faces a number of challenges, due to needing the knowledge of how to approach any danger his baby may be in. He needs to be alert, fast moving and prepared for anything if he wants to keep his son safe.BabyThe baby's goal is to take his own life using whatever objects within the house he can get his little hands on. This includes actions such as:<br/><ul> <li> Shoving forks into power outlets<br/></li><li> Chugging various cleaning products<br/></li><li> Scuba diving unsupervised in the tub</li></ul> The baby player has minimal responsibility and this allows for a simple, yet erratic play style.", "metacritic": null, "released": "2016-05-13", "tba": false, "updated": "2024-01-31T21:25:39", "background_image": "https://media.rawg.io/media/screenshots/d40/d4016a4fe0348b6ec91c9345c4fdf816.jpg", "website": "", "rating": 2.88, "rating_top": 3, "added_by_status": {"yet": 22, "owned": 663, "beaten": 27, "toplay": 3, "dropped": 59, "playing": 4}, "playtime": 1, "achievements_count": 31, "ratings_count": 84, "suggestions_count": 138, "game_series_count": 0, "reviews_count": 84, "platforms": ["PC", "macOS", "Linux"], "developers": ["Evil Tortilla Games"], "genres": ["Action", "Casual", "Indie"], "publishers": ["Evil Tortilla Games"], "esrb_rating": null}