{"id": 137775, "slug": "qdsdanse", "name": "QDSDanse", "name_original": "QDSDanse", "description": "<p>=== QDS_Danse ===<br/><br/>Créé par : TEAM DESSTROY<br/><br/>Vincent Brunet-Dupont<br/>Léandre Leblanc-Martinet<br/>Olivier Leclair<br/>Dany Ayoub<br/>Guillaume Duquesne<br/>Alexandre Pernot Lopes<br/><br/>== INSTRUCTIONS DE LANCEMENT ==<br/><br/>Pour fonctionner, la partie Danse nécessite : <br/>- Deux webcams<br/>- Des hauts parleurs<br/>- Un projecteur pour un rendu optimal<br/><br/>La partie Borne Interactive nécessite : <br/>- Un microphone<br/>- Des hauts parleurs<br/>- Il faut maintenir la touche ESPACE pendant 1 seconde, parler, attendre 1 seconde et relâcher pour une prise de son optimale.<br/><br/>Le jeu peut être lancé soit sur un seul ordinateur avec le :<br/><br/>QDS_Dance.exe<br/><br/>Soit sur deux ordinateurs différents avec les deux éxécutables indépendants :<br/><br/>DanceStandalone.exe<br/>GiseleStandalone.exe<br/><br/>NB : Lancer les deux séparément retire la retransmission de l'intensité de l'activité de Danse sur la carte interactive.<br/><br/>== PRECISIONS SUR LA BORNE INTERACTIVE ==<br/><br/>Vous devez avoir un micro fonctionnel et branché dans votre ordinateur.<br/>Le micro d'un ordinateur portable peut faire l'affaire.<br/><br/>Une fois l'application lancée, vous devez appuyer et tenir enfoncée la barre d'espace afin d'envoyer une communication<br/>vocale à l'assistante Gisèle. Lorsque vous lâchez la barre d'espace, votre message est envoyé. La réponse de Gisèle peut<br/>prendre environ 5 secondes avant d'apparaître à l'écris et à l'oral dans vos hauts-parleurs.<br/><br/>Attention: Il y a un délai d'une seconde avant que l'enregistrement démarre en appuyant sur \"espace\", attendez donc<br/>un instant avant de parler ou poser une question.<br/><br/>Gisèle peut vous parler:<br/><br/>-D'événements ou d'activités dans le quartier des spectacles, plus précisément de QDS danse si vous avez envie de bouger!<br/>-D'actualité ou de nouvelles. Branchée sur le flux RSS de Radio-Canada (simulation), elle peut vous parler de différents types de nouvelles, sports, économie, environnement, etc.<br/>-Informations utiles dans le Quartier des spectacles: dernier métro, météo, repères géographiques, restaurants, etc.<br/></p>", "metacritic": null, "released": "2017-02-12", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/758/7588f468612cc6fd554aabf247803dcb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 60, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Dukes", "Alexandre Pernot Lopes", "LLM"], "genres": [], "publishers": [], "esrb_rating": null}