{"id": 13789, "slug": "city-of-fools", "name": "City of Fools", "name_original": "City of Fools", "description": "Tundel has three evils – fools, roads and the mayor, who hides a UFO from the public. You are a successful journalist of a famous magazine. The Editor in Chief sends you to the town of Tundel on a mission to write about the mysterious incident. In order to complete the mission you'll need all your patience, wits and communication skills.<br/>\n<br/>\r\nHow to find the mayor in an unfamiliar city? First of all, find the City Hall! How to get to the City Hall? We'll have to find a special pass, which is hidden no one knows where! In order to get the access you'll need to get acquainted with almost all the inhabitants of the city and each of them is eager to give you a completely ridiculous task. As a result, even in the first minutes of the game you'll find yourself deep in troubles with lots of incomprehensible stuff and a strong desire to escape from this crazy city! But the job should be done. Pull yourself together and start to organize information you have. Remember the street names and house numbers. When you fulfill any request you'll get a reward from grateful citizens. Find the mayor and complete your quest for laughs in the funniest hidden object quest ever!<br/>\n<br/>\r\nCity of Fools has a completely nonlinear storyline, and a plethora of interesting details. The game features about 500 amusing locations, numerous hidden object scenes, 10 incredibly fun mini-games, more than 100 hours of gameplay in Expert mode and a comic plot.<br/>\n<br/>\r\nFeatures:<br/>\n<br/>\r\n♦ Play as you wish – a complete freedom of choice <br/>\r\n♦ Enjoy original comic storyline<br/>\r\n♦ Play through 500 locations and dozens of hidden object scenes<br/>\r\n♦ Addictive gameplay and beautiful music <br/>\r\n♦ Become a hero and discover the truth!", "metacritic": null, "released": "2015-07-10", "tba": false, "updated": "2023-07-09T07:51:16", "background_image": "https://media.rawg.io/media/screenshots/919/9198c166a1354550114453e7e7f2a45b.jpg", "website": "http://city-of-fools.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 75, "beaten": 1, "dropped": 1}, "playtime": 4, "achievements_count": 6, "ratings_count": 2, "suggestions_count": 298, "game_series_count": 0, "reviews_count": 2, "platforms": ["macOS", "PC"], "developers": ["Absolutist"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Absolutist"], "esrb_rating": null}