{"id": 137835, "slug": "pongy-in-the-middle", "name": "Pongy in the Middle", "name_original": "Pongy in the Middle", "description": "<p>\r\n\t“super cool!\"<br/>—@mftb\r\n</p><p>\r\n\t“pretty neat\"<br/>—@Chrysterious\r\n</p>Story<p>\r\n\tIn a world ravaged by war, our only hopes are placed in a magical ball that legends say can bring about world peace. The only problem is, the only thing keeping that ball from being flung off into the vast expanses of space are two seemingly autonomous tennis paddles. Luckily you — yes, you — have been granted the power of magnetism and are able to control the ball's vertical coordinate. Despite the futility of this ordeal, you have taken up the challenge to save the ball from being lost in space. We believe in you, brave warrior!\r\n</p>Controls<ul>\n<li>Move your mouse to move the ball.</li>\n<li>If you get a Game Over, click to restart.</li>\n<li>Press the F key on your keyboard to toggle fullscreen.</li>\n</ul>Source<p>Full source code is available over at GitHub!<br/></p><p>\r\n\tThis program is free software: you can redistribute it and/or modify it under the terms of the \r\n\tGNU General Public License as published by the Free Software Foundation, either version 3 of the License, or (at your option) any later version.\r\n</p><p>\r\n\tThis program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the \r\n\tGNU General Public License for more details.\r\n</p>", "metacritic": null, "released": "2015-03-30", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/092/092bd0c7773a33744883681cdad0dc13.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 2, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "Web"], "developers": ["Leon Byford"], "genres": ["Action"], "publishers": [], "esrb_rating": null}