{"id": 13780, "slug": "sid-meiers-civilization-iv", "name": "Sid Meier's Civilization IV", "name_original": "Sid Meier's Civilization IV", "description": "<p>As with the rest of Sid Meier’s Civilization series, the player controls a real historical civilization and leads it from the stone age to the space era. The goal is to develop its culture, science, and economy and to conquer the neighboring countries if you feel like it. There are eighteen playable civilizations in the game with some of them having multiple leaders to choose from. Each PC-controlled leader is based on an actual historical figure and has his or her unique personality traits, such as being diplomatic or aggressive.</p>\n<p>Civilization IV was the first to introduce different religions rather than an abstract &quot;religion&quot; as a concept. There are seven available religions that can be founded during the game and spread across the map, increasing their founder&#39;s influence and boosting his citizens&#39; happiness. The fourth part also introduced the idea of Great People, such as scientists, artists, and prophets, who are also based on actual persons. Corruption mechanic was removed and replaced with expensive building maintenance. Barbarians, who used to be just random enemy units, now can build cities that, however, will not contact with the player via diplomacy and should only be eliminated.</p>", "metacritic": 94, "released": "2005-10-25", "tba": false, "updated": "2024-02-12T11:21:26", "background_image": "https://media.rawg.io/media/screenshots/85c/85c91c5064d2cdd56a949c8008868318.jpg", "website": "http://www.2kgames.com/civ4/home.htm", "rating": 4.1, "rating_top": 4, "added_by_status": {"yet": 108, "owned": 2234, "beaten": 285, "toplay": 23, "dropped": 137, "playing": 18}, "playtime": 2, "achievements_count": 0, "ratings_count": 359, "suggestions_count": 543, "game_series_count": 5, "reviews_count": 359, "platforms": ["PC", "macOS"], "developers": ["Firaxis"], "genres": ["Strategy"], "publishers": ["2K Games", "Aspyr"], "esrb_rating": "Everyone 10+"}