{"id": 13791, "slug": "quote", "name": "Quote", "name_original": "Quote", "description": "Burn every book. Kill every author.<br/>Quote is a beautifully twisted action role-playing game about cleansing the world of knowledge.<br/><br/>You are the chief inquisitor of Bliss, God of Ignorance, sent to eradicate all wisdom, science and culture. Let nothing survive the purge.<br/><br/>Hunt down those who would impose the tyranny of knowledge upon the world. Destroy their works. Bludgeon the very thoughts from their wicked heads with a wide array of explosive combat powers.  <br/><br/>Only you can bring forth an age of blissful ignorance. Only you can save the world from facts and truth.<br/><br/><br/><br/><ul><li>Explore a beautifully hand-drawn world, built from the ashes of a lost culture.</li></ul><br/><ul><li>Feed sacrilegious books to your bizarre birdman sidekick Tatters to upgrade and unlock your powers and abilities.</li></ul><br/><ul><li>Uncover the mysteries of a lavishly-narrated, twisted and darkly witty story.</li></ul><br/><ul><li>Dish out divine retribution in style, with a frenetic, varied but accessible fighting system.</li></ul><br/><ul><li>Take a break from the story to battle through Quote’s procedurally-generated Infinite Library mode. Find over 40 persistent unlocks, including new combat finishers, bonus stories and alternative costumes.</li></ul><br/><ul><li>Inspired by traditional isometric action-adventure games, the works of Vonnegut, Carter, Bradbury, Eco, Huxley and many more, and the surrealist art of Hieronymus Bosch.</li></ul><br/><ul><li>An ongoing, evolving tale: This release includes the first three chapters of the campaign. The remaining chapters will be added over the Early Access period.</li></ul><br/>", "metacritic": null, "released": "2017-01-31", "tba": false, "updated": "2019-08-28T22:12:30", "background_image": "https://media.rawg.io/media/screenshots/8a3/8a3b7cc61b65423dd6dd6fefdaee61cd.jpg", "website": "http://quote-game.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3}, "playtime": 2, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 539, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Vindit"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["Vindit"], "esrb_rating": null}