{"id": 13794, "slug": "radial-g-racing-revolved", "name": "Radial-G: Racing Revolved", "name_original": "Radial-G: Racing Revolved", "description": "Intense futuristic anti-gravity arcade racer for the new VR generation!<br/><br/>Climb into the cockpit of a futuristic race craft and tear up the anti-gravity track as battle commences with over 15 real and AI opponents. Offering single and multiplayer action, Radial-G delivers full immersion combative racing on tubular tracks featuring gut-wrenching twists, jumps, splits and unique inverted racing.Full Release FeaturesThe Full Release version includes the following features:<br/><br/><ul><li>A new environment set in the depths of space with three regions in and around a derelict asteroid mining station.<br/></li><li>Nine courses offering insanely fast racing around tracks including dizzying splits and twists, crazy stomach-defying jumps and inverted tunnel sections<br/></li><li>A thumping EDM soundtrack<br/></li><li>Gruelling Single Player Career mode to work through earning trophies in-game<br/></li><li>A choice of seven race craft, one only unlockable by reaching ranks in multiplayer, the others through completing Single Player Career mode tiers<br/></li><li>16-player online multiplayer support<br/></li><li>Offline and single player modes against 15 AI opponents<br/></li><li>Combat gameplay modes with five weapons to blow away your opponents<br/></li><li>Balance the risk and reward of converting your shield to additional user-controlled boost<br/></li><li>Enhanced ship physics - each ship has unique handling characteristics<br/></li><li>Cockpit and 3rd-person camera views (VR supports only for cockpit view)<br/></li><li>Steam achievements<br/></li><li>Steam stats<br/></li><li>Leaderboards<br/></li><li>Support for Oculus Rift, Oculus DK2 (with latest Runtime or 0.8), HTC Vive and OSVR</li></ul>", "metacritic": null, "released": "2016-03-28", "tba": false, "updated": "2019-08-28T22:12:30", "background_image": "https://media.rawg.io/media/screenshots/f6a/f6adc40a5d7462d5f8824147bd6c6d1b.jpg", "website": "http://www.radial-g.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 27, "toplay": 1, "dropped": 2}, "playtime": 1, "achievements_count": 64, "ratings_count": 2, "suggestions_count": 570, "game_series_count": 0, "reviews_count": 2, "platforms": ["PlayStation 4", "PC"], "developers": ["Tammeka Games", "Tammeka"], "genres": ["Action", "Racing", "Indie"], "publishers": ["Tammeka Games"], "esrb_rating": "Everyone 10+"}