{"id": 13803, "slug": "b-17-flying-fortress-the-mighty-8th", "name": "B-17 Flying Fortress: The Mighty 8th", "name_original": "B-17 Flying Fortress: The Mighty 8th", "description": "Feel the power of really flying a B-17! See what it was like to be part of the 10-man crew on dangerous bombing missions over occupied Europe. Outstanding graphics, animations, and sounds realistically recreate every aspect of the strategic air war in WWII.<br/><br/>Fly a variety of aircraft from the legendary B-17 to the rugged escort fighters - you can even fight \"The Mighty Eight\" in the role of a German Luftwaffe pilot!<br/><br/>Take to the skies in any one of ten B-17 Flying fortress crew positions:<br/><br/>Pilot, Co-Pilot, Navigator, Bombadier/Chin Turret Gunner, Radio Operator, Engineer/Top Turret Gunner, Port Waist Gunner, Starboard Waist Gunner, Ball Gunner and Tail Gunner!<br/><br/><strong>Strap yourself in, fire up the engines and get ready for high-flying adventure!</strong><br/><br/>Features:<br/><ul><li>All aircraft are beautifully rendered and astoundingly real<br/></li><li>Fly highly detailed flight models of the American B-17G bomber, P-38 Lightning, P-51 Mustang, P-47 Thunderbolt and the German Bf 109, Fw 190 and ME 262 fighters<br/></li><li>Take to the skies in \"Quick Start\" missions with available Instant Action mode<br/></li><li>Carry out a realistic 25-mission tour of duty based on historically accurate scenarios and targets<br/></li><li>Plan real missions, select authentic flying formations and manage both crews and bombers<br/></li><li>Experience breathtaking air combat sequences using a myriad of special views<br/></li><li>Take total control: Take-off and land massive bombers, shoot from various crew positions, navigate across a realistically mapped Europe, operate the radio, line up the bomb run, release the bombs and bail out if necessary<br/></li><li>Assess you crew's strengths and skills to effectively re-position member to cope with wounded aircrew</li></ul>", "metacritic": 82, "released": "2000-01-01", "tba": false, "updated": "2022-10-14T03:22:27", "background_image": "https://media.rawg.io/media/screenshots/06c/06cdc7fe2e34480aad5c64e7e06ff368.jpg", "website": "http://www.retroism.com", "rating": 3.17, "rating_top": 5, "added_by_status": {"yet": 3, "owned": 91, "beaten": 2, "toplay": 3, "dropped": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 6, "suggestions_count": 407, "game_series_count": 0, "reviews_count": 6, "platforms": ["PC"], "developers": ["Wayward Design"], "genres": ["Simulation"], "publishers": ["Nightdive Studios", "Retroism", "MicroProse"], "esrb_rating": "Mature"}