{"id": 138071, "slug": "flying-fruits-balloon-for-kids", "name": "Flying fruits balloon for kids", "name_original": "Flying fruits balloon for kids", "description": "<p>\"Fruits and Vegetables for Kids\" is a free educational game for children between 1 and 4 years of age. This is a shortened version of the \"Nature for Tots\" app.</p><p>Together with your child, you can watch wonderful flying of fruits and vegetables, all while learning their appearance!</p><p>After the child tap all the flying of fruits and vegetables , he or she take prize. Regardless of the number of correct taps, the child's developing skills will be fostered by enthusiastic applause and fireworks!</p><p>This educational application contains full set of \"Fruits\" and \"Vegetables\". In addition, it includes of the following groups of educational objects: \"Berries\"</p><p>Does the youngster have an older brother or sister in grade school? They can also use this educational game! Besides English, this app also supports the Russian and Ukrainian languages.</p><p>While playing with flashcards in a foreign language, a school-age child can effortlessly see many new fruits and vegetables with which to surprise their friends and classmates. An A+ is sure to follow!</p><p>In order to use this educational app, the youngster does not need to be able to read. The simple interface allow even the youngest of children to play and learn independently!</p><p>Experience has shown that children love to look through a series of colorful pictures with sounds, and they will ask to see them again and again. According to Glenn Doman, an American physical therapist and the founder of The Institutes for the Achievement of Human Potential, participating in these kinds of educational activities (for 5-10 minutes a day) stimulates the development of various regions in the brain. As a result, the child's photographic memory takes shape, the child develops much faster than his or her peers, and, beginning at infancy, the child gains access to a world of encyclopedic knowledge.</p><p>The main point, in which Doman is undoubtedly correct, is that the younger a child, the more easily he or she can absorb new knowledge. It's important to make use of this ability while it's available!</p><p>If you like our game please rate it and visit our website http://pixiegames.info</p>", "metacritic": null, "released": null, "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/3ad/3ade2b1de4add90c2c6c2d1d7910c3f3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 35, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["PixieGames"], "genres": [], "publishers": [], "esrb_rating": null}