{"id": 13817, "slug": "horizon", "name": "Horizon", "name_original": "Horizon", "description": "Horizon is a turn-based space strategy game of galactic exploration and conquest in which you are in control of humanity’s destiny. <br/><br/>You will explore deep space, find new frontiers and discover alien artifacts hidden on long-abandoned planets. You will also learn more about the galaxy as you come into contact with ten other species, each with their own unique culture, history and schemes. <br/><br/>A fully interactive galaxy allows you to navigate open space between stars and planets. Patrol your borders and, when the need arises, defend your territory by engaging in ship-to-ship tactical combat. Develop new colonies and then watch them become galactic centers for trade, industry and science - and of course military bases, outposts and shipyards to build your battle ships. Push your empire to its limits and go beyond the known horizon!<br/>_Key Features<br/><ul><li> Advanced turn-based tactical combat which many 4X fans have been requesting for years<br/></li><li> Full Tactical ship control includes managing movement, weapons and more.  Board other ships, attack from planetary and orbital defenses<br/></li><li> A Distinct open world system, where ships can explore without artificial limits and where combat can span many turns before concluding<br/></li><li> Interact with alien races of different levels, including ancient civilizations featuring their own unique storyline, schemes, ships and technology<br/></li><li> An immersive galaxy storyline with open-ended missions that add another layer of gameplay over classic 4x mode which is also available<br/></li><li> Engage in meaningful diplomacy choices that will impact the game outcome, includes coordinated actions with your allies against your enemies<br/></li><li> Discover more than 80 technologies each with 10 levels of upgrades. Conduct planetary surveys and dig for artifacts<br/></li><li> Design and customize your ships’ weapons and systems based on available technology<br/></li><li> A detailed economy and colony management system with different types and levels of colonies based on your build choices<br/></li><li> Play in different galaxy configurations from a few dozen stars to over a hundred star systems containing more than a thousand planets<br/></li><li> Fully Customize your race or play as one of eight original races (NEW: Includes a mod that unlocks 3 additional ancient races now playable)<br/></li><li> Extended Modding support with the ability to create your own races and even write your own scripted quests</li></ul>", "metacritic": null, "released": "2013-11-15", "tba": false, "updated": "2023-12-05T14:53:56", "background_image": "https://media.rawg.io/media/screenshots/c2f/c2f2e5e44665c9fe29f9105334fcc5d3.jpg", "website": "http://www.HorizonGame.com", "rating": 0.0, "rating_top": 3, "added_by_status": {"yet": 5, "owned": 152, "toplay": 2, "dropped": 2}, "playtime": 2, "achievements_count": 30, "ratings_count": 5, "suggestions_count": 514, "game_series_count": 0, "reviews_count": 5, "platforms": ["Android", "PC"], "developers": ["Ketchapp", "Scholastic", "L3O Interactive"], "genres": ["Action", "Strategy", "Arcade", "Indie"], "publishers": ["Iceberg Interactive"], "esrb_rating": null}