{"id": 138137, "slug": "deathlection", "name": "DEATHLECTION", "name_original": "DEATHLECTION", "description": "<p>Remember those fond childhood memories of skimming stones across the pond? Well now we've all grown up and play video games, so this is DEATHLECTION. Hurl your handgun across the pond, then let the recoil of firing your weapon shoot it across the surface (whilst sending out a hail of bullets in the opposite direction). Blow your opponents away to win. Don't shoot yourself in the face.<br/></p><p>CONTROLS</p><p>PINK - A &amp; D to move player / Rotate Gun</p><p>S to Launch Gun / Shoot</p><p>GREEN - Left and Right arrow keys to move player / Rotate Gun</p><p>Down to Launch Gun / Shoot</p><p>ORIGINS</p><p>The night before a talk I was doing, sleeping on a friends sofa, this idea popped into my head (and spent the entire talk craving to work on it). I blasted out the core mechanics and took it to a couple of festivals. Depending on the reception, this will be my next major project after Narcissus.</p><p>GUNTROLLERS</p><p>BEFORE<br/></p><p>AFTER</p><p>I built some ridiculous controllers for Deathlection using the Makey Makey and a buttload of cardboard. Each player has a pistol and two buttons (Left/Right). After testing the polystyrene prototypes (and those prototypes proceeding to be thrown away by my flatmate -_-), with the help of Katy Marshall, we built a pair of awesome replacement laser cut cardboard pistols. Since then, we've taken it to a couple of events.</p><p>Check the video to see the fully documented construction video I put together for AMAZE (BUILD YOUR OWN).<br/></p><p>Check this video to see the new controllers looking rather snazzy at Super Warehouse Gaming Party<br/></p><p>Check the footage of Deathlection at Feral Vector</p><p>POTENTIAL AVENUES FOR FURTHER DEVELOPMENT<br/></p><p>MORE GUNS</p><p>I've got a bunch of different designed weapons that effect how gameplay works, but for now I'll be just keeping it to pistols to get the rest of the mechanics fleshed out.</p><p>MORE PLAYERS</p><p>I want at the very least the option for 4 players in the final game, though the simple input means it could be more.</p><p>CONTROLLER SUPPORT?</p><p>Depending on what engine I start building this properly within, I'll be looking to add controller support. This would allow for the characters to move more freely in motion (360 rather than left and right/up and down) and the movement of the gun provide slicker handling. There's also the fact that I could get people to double up on controllers (One analogue stick/trigger each).</p><p>UGLY ANIMATIONS</p><p>I've been doing a lot of weird weird illustrations for articles as of recently (and people keep asking me why I don't use them for more of my games), so I want to step a little bit out of my comfort zone with this project and get some lovely cartoon doodles in.</p><p>SOME KIND OF BENEFIT FOR USING THE SAME GUN OVER AND OVER<br/></p><p>It is possible in game to throw the same gun out and bring it back to you, so I want to make the player to benefit somehow if they manage to repeat this process (longer clips, laser sights, higher recoil). I'll keep you updated on that one.</p><p>Stay tuned as there will likely be things-a-changing on here!</p>", "metacritic": null, "released": "2015-02-16", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/5f7/5f7f0c08a2a84dabe3cb535b95c94e62.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 6, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Alex Johansson"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}