{"id": 138157, "slug": "minuto-batalla-aerea", "name": "Minuto: Batalla Aerea", "name_original": "Minuto: Batalla Aerea", "description": "<p>\r\n\tEstas corriendo de una invasión alienigena y te escondes en un hangar.<br/>\n</p><p>\r\n\tDe pronto te ordenan despegar. ¡Pero no eres un piloto!\r\n</p><p>\r\n\tNo importa eso, estas a bordo de una nave casi completamente automatizada.\r\n</p><p>\r\n\tAsi es como \r\n\tMinuto: Batalla Aerea comienza, un Shoot-Em-Up de Scroll Lateral con toques de RPG donde tienes el deber de liberar la Tierra mientras aprendes a controlar la nave.\r\n</p>\r\nCONTROLES\r\n<ul>\n<li> W y S o Flechas arriba y Abajo (en PC)</li>\n</ul>\r\nCOMO JUGAR\r\n<ul>\n<li> Derriba a tus rivales antes que ellos a ti, mientras evitas chocar contra los que no evadas.</li>\n</ul>\r\nACERCA DE\r\n<p>\r\n\tMinuto: Batalla Aerea es un juego realizado para el Proyecto Final de la carrera Tecnicatura en Diseño y Programación de Videojuegos de la Universidad Nacional del Litoral.\r\n</p>\r\nBUILD\r\n<ul>\n<li>v 0.5.16<ul><li>Se modificó el tiempo que la nave del player puede estar en Peligro.</li><li>Se cambió el gráfico de las balas para que destaque más ante el fondo.</li><li>Se realizaron cambios al modo en que se visualizan las barras de escudo y estructura de las naves rivales y finales.</li><li>Se agregó la barra de escudo para los rivales finales que no se visualizaba hasta ahora.</li><li>Se realizaron cambios menores en la programación</li></ul></li><li>v 0.5.9<ul><li>Se agregó un gráfico para cuando la nave abandona rapidamente la pantalla.</li><li>Se creó un gráfico nuevo para el primer rival.</li><li>Se modificó la dificultad de los rivales finales.</li><li>Se agregan distribuibles para Windows y Windows + Neko.</li><li>Se realizaron correcciones menores.</li></ul></li><li>v 0.5.4<ul><li>Se corrigió un error en los disparos.</li><li>Se realizaron cambios menores.</li></ul></li><li>v 0.4.38\r\n\t<ul>\n<li>Se implementaron cambios para extender la duración del juego.</li>\n<li>Se agregaron mensajes nuevos en el juego.</li>\n<li>Se implementó los nuevos tipos de disparo junto con la forma de activarlo.</li>\n<li>Se unificó el idioma del juego.</li>\n<li>Se agregó un menú dentro de la partida que explica el HUD.</li>\n<li>Se realizaron cambios menores.</li>\n</ul>\n</li>\n<li>v 0.4.30\r\n\t<ul>\n<li>Se implementó la aparición de distintos tipos de rivales según la distancia recorrida en el juego y el nivel del piloto</li>\n<li>Se implementó un mensaje que avisa con cuanto se pega o le pegan a la nave o si se falla el disparo.</li>\n<li>Se balanceo la dificultad de los rivales.</li>\n<li>Se implementó la aparición de nuevos obstaculos según el nivel del piloto y la distancia recorrida en el juego.</li>\n<li>Se balanceo la escala para subir de nivel.</li>\n<li>Se realizaron cambios menores.</li>\n</ul>\n</li>\n<li>v 0.4.21\r\n\t<ul>\n<li>La nave ahora recarga el escudo y refuerza su estructura.</li>\n<li>Se corrigieron defectos de sonido, salvado incorrecto de la vida y el escudo, de los disparos de la nave.</li>\n<li>Se modifico el HUD para que el color de la barra de escudo se corresponda con los colores usados en los rivales.</li>\n<li>Se agrego un dialogo para dar la pista sobre como eliminar a los rivales finales.</li>\n<li>Se verificó el correcto funcionamiento de los rivales finales.</li>\n<li>Se corrigió en esta lista el versionado.</li>\n</ul>\n</li>\n<li>v 0.4.13\r\n\t<ul>\n<li>Se agrego una introducción.</li>\n<li>Se corrigió el movimiento de la nave para que saliera de pantalla más rápido tras eliminar a los rivales.</li>\n<li>Se corrigió la tecla para salir de la pantalla Stats.</li>\n<li>Se corrigió la pantalla de Stats.</li>\n<li>Se modificó el Sonido de la Alarma para que no sea tan alto.</li>\n<li>Se realizaron cambios menores.</li>\n</ul>\n</li>\n<li> v 0.4.3\r\n\t<ul>\n<li>  Primera distribución publica.</li>\n</ul>\n</li>\n</ul>\r\nCARACTERISTICAS\r\n<ul>\n<li> Juego de 7 niveles y varias etapas por nivel.</li>\n<li> Rivales con diferentes estrategias de movimiento y diferentes armas (Desarrollado, no implementado aún)</li>\n<li> Jefes Finales</li>\n<li> Avance y disparo automatico. Solo deberá moverse hacia arriba y hacia abajo.</li>\n<li> Distintos tipos de disparos.</li>\n<li> Upgrades planificados.</li>\n</ul>\r\nCREDITOS\r\n<ul>\n<li> Conceptualmente este juego esta inspirado en la serie de juegos de Mitsuhiro Okada (@moitititi)</li>\n<li> Musica, Sonidos y Graficos de Kenney Game Assets y Kenney Game Assets 2 por @KenneyNL</li>\n<li> Musica de Jefes finales de Joe Reynolds (professorlamp) http://opengameart.org/users/professorlamp</li>\n<li> Basado en el tutorial de Sergio Barrio http://www.strandedsoft.com/haxeflixel-tutorial-building-your-first-2d-shoot-em-up-part-i/</li>\n<li> Basado en el demo de HaxeFlixel http://haxeflixel.com/demos/Flixius/</li><li>Basado en el demo de Samuel Batista https://github.com/HaxeFlixel/flixel-demos/blob/dev/Editors/TiledEditor/source/TiledLevel.hx</li>\n<li>Explosiones de Luis Zuno http://opengameart.org/users/ansimuz</li>\n</ul>", "metacritic": null, "released": "2016-12-27", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/a63/a635642cb5307b1ba834b135b566027c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 88, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["Gonzalo Cifaldi"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}