{"id": 13815, "slug": "sorcerer-king", "name": "Sorcerer King", "name_original": "Sorcerer King", "description": "In Stardock’s newest fantasy strategy game, your existence is threatened by the evil Sorcerer King who is hell-bent on ascending to Godhood. The problem is, Godhood comes with the price of your entire world’s destruction, which is a bit of a bummer. The clock is ticking down to Doomsday and you must raise your army as you explore the land and take on hundreds of quests in your efforts to stop the Sorcerer King before it’s too late. Expand your kingdom, learn powerful new spells, and choose your allies and enemies carefully. You will need every bit of help you can get when you finally bring the fight to the Sorcerer King’s doorstep. After all...how do you kill a God?Key Features:<ul><li> <strong>The Sorcerer King -</strong> This is not a fair fight. Your opponent is more powerful and his onslaught against the Shards you must protect is unending. Maintain diplomatic relations with your enemy and then strike when the time is right.<br/><br/></li><li> <strong>Doomsday Counter -</strong> This unique mechanic serves as a reminder that your time to put down the Sorcerer King is limited. If he fills the counter and completes his spell, your world is doomed.<br/><br/></li><li> <strong>Crafting -</strong> Through battles and quests, players must discover recipes and gather components in order to craft powerful items.<br/><br/></li><li> <strong>Enchanting -</strong> Imbue equipment with magical properties that customize your forces’ capabilities far beyond anything you’ve seen in a fantasy strategy game to date.<br/><br/></li><li> <strong>Unique Skills -</strong> 6 different playable Sovereigns, each with their own unique set of skills and abilities, will allow the player to experiment with different styles of gameplay.<br/><br/></li><li> <strong>Adventure -</strong> Hundreds of unique, individually written questlines bring a touch of humor to the impending doom of the apocalypse.<br/><br/></li><li> <strong>Rivals -</strong> The remains of once-powerful factions cling to life in the Sorcerer King’s world, but they cannot hope to defy him alone. Ally with them and they will grant you their Champion...or, wipe them out to claim their land and treasures all for yourself. </li></ul>", "metacritic": 75, "released": "2015-06-15", "tba": false, "updated": "2019-09-17T13:18:52", "background_image": "https://media.rawg.io/media/screenshots/8b5/8b5e71a2a593b9d43d009805d3c24b1a_Sv9Vd7G.jpg", "website": "http://sorcererking.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 4, "owned": 80, "beaten": 1}, "playtime": 5, "achievements_count": 40, "ratings_count": 3, "suggestions_count": 541, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC"], "developers": ["Stardock Entertainment"], "genres": ["RPG", "Strategy", "Indie"], "publishers": ["Stardock Entertainment"], "esrb_rating": null}