{"id": 13813, "slug": "warhammer-vermintide-vr-hero-trials", "name": "Warhammer: Vermintide VR - Hero Trials", "name_original": "Warhammer: Vermintide VR - Hero Trials", "description": "<strong>Please note: This title is made for HTC Vive only and is a short, free VR experience.</strong> <br/><br/>Skaven beware - there’s a new hero in town! <br/><br/>Take on the role of an aspiring hero proving yourself to join the ranks of the legendary Heroes of Ubersreik. In order to do so you must show off your fighting skills when faced against the vile Skaven in short but intense missions. Simply pick up your weapon of choice from the rack and kill some rat-men. Or if you need backup, have a friend join you in your quest to become heroes!<br/><br/>Battle the Skaven forces in the <strong>Hall of the Poison Feast</strong> mission or simply hang with the heroes in the <strong>Red Moon Inn</strong> in the FREE Version of Vermintide VR.KEY FEATURES<br/><strong>LEVEL 1 | Red Moon Inn:</strong> Take a moment to relax with your favourite heroes from Vermintide in the Red Moon Inn, explore the various items you can pick up and move around the room. <br/><br/><br/><strong>LEVEL 2 | Hall of the Poison Feast:</strong> Stand your ground in the cold and ancient halls of Castle Drachenfels.<br/><br/><br/><strong>TEAM UP | 2 Player Co-op: </strong>Join forces with a friend to prevent the Skaven from completing their evil plans<br/><br/><br/><strong>EXPLORE | Warhammer Fantasy like never before: </strong>Step into the Warhammer Fantasy world and take on the life-sized Skaven. Or pick up one of the miniatures  in the Red Moon in and chuck them around the room<br/><br/><br/><strong>WEAPON OF CHOICE | How should the Skaven die?: </strong>Choose your weapon and pierce, burn, stab or shoot the vile rat-men<br/><br/><br/><strong>THE CANDLE | Time is Ticking: </strong>The candle will slowly burn down during the course of your mission, marking time until victory or defeat.For the full VR experience:Owners of Warhammer: End Times - Vermintide will receive two exciting new VR missions - <strong>Reikwald</strong> and <strong>Ungdrin Rail</strong>. <br/><br/><br/><strong>LEVEL 3 | Reikwald: </strong>Take down the vile rat-men in the weathered forest outside of Ubersreik. <br/><br/><br/><strong>LEVEL 4 | Ungdrin Rail: </strong>Survive the oncoming Skaven as you travel through the mine tunnel in search of the exit.", "metacritic": null, "released": "2016-12-20", "tba": false, "updated": "2023-12-18T17:44:54", "background_image": "https://media.rawg.io/media/screenshots/d84/d84f40d59a568fa32097f8c427d17ebd.jpg", "website": "http://www.vermintide.com", "rating": 2.14, "rating_top": 3, "added_by_status": {"yet": 4, "owned": 191, "beaten": 2, "toplay": 2, "dropped": 3}, "playtime": 1, "achievements_count": 0, "ratings_count": 7, "suggestions_count": 667, "game_series_count": 0, "reviews_count": 7, "platforms": ["PC"], "developers": ["Fatshark"], "genres": ["Action"], "publishers": ["Fatshark"], "esrb_rating": null}