{"id": 13824, "slug": "derail-valley", "name": "Derail Valley", "name_original": "Derail Valley", "description": "Derail Valley is a train simulation made for VR. Tasked to reposition cars on a tight schedule, you might find yourself grabbing the controls in panic. The thought of running off the rails will run through your mind, and in all likeliness that's exactly what will happen. No worries - next time you'll do better!<br/><br/>While still early in development by a three-people team, Derail Valley already brings some key advancements to the train simulation genre:<br/><ul><li>Made for VR<br/>You can drive a train with your own hands! Derail Valley lets you move freely in the cab, being embraced by nature and then derailing off a cliff. It is designed right from the start for VR in terms of optimizations, controls and UI.<br/></li><li>Fun and dynamic gameplay<br/>Getting a train to move in Derail Valley is simple, but to accomplish complex maneuvers on time requires a lot of skill. You will plan your route, switch junctions and move cars between trainyards, all while racing through corners on the edge of derailment. The game is aimed to be fun and challenging to both hardcore train veterans and players new to the genre and VR in general.<br/></li><li>Decayed railway simulation<br/>Rails aren't just perfect mathematical lines. They are pieces of metal that are imperfect, sometimes buckled by temperature changes, jointed together with wood and rolled over by other pieces of metal. We want players to really feel the track and be able to adjust their driving according to that feeling.<br/></li><li>Derailment physics<br/>Derailments are serious. They are unpredictable, massive, and sometimes oddly spectacular. We want them to feel as realistic as possible, and as such the whole game revolves around that concept.<br/></li><li>Immersive audio<br/>Sound effects are not just recordings that play in the background. They are individual bits and pieces, set in specific positions, that each react to some stress or force. Train wheels in Derail Valley will squeal differently depending on the force they endure, and passing every track joint will cause the cabin to shake.<br/></li><li>Abandoned natural environment<br/>The world of rail transport is imperfect and in Derail Valley we want to let players experience that imperfection - be it through old rusty tracks, worn-out rolling stock set in beautiful nature, or a bunch of paperwork on your desk.</li></ul>Future plans:<br/><br/>Our goal with Derail Valley is to bring something new to train sim and VR games simultaneously. Many upcoming additions are planned to significantly differentiate the release version from the free demo, such as procedural shunting missions, NPC traffic and more car variety! These and more updates will be regularly showcased as they come, so stay tuned for more news as we get closer to the release! Please see Early Access information for more details.<br/><br/>In the meantime, you can try the demo which comes with one multi-trainyard 4km² map and one fictional diesel-electric shunter locomotive. If you have any questions, comments and feedback about the game please feel free to post on our Steam forum!", "metacritic": null, "released": null, "tba": false, "updated": "2023-12-05T23:41:52", "background_image": "https://media.rawg.io/media/screenshots/87b/87b857552c376d98d95f70ea48b7e0c8.jpg", "website": "http://www.derailvalley.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 23, "toplay": 1, "dropped": 2}, "playtime": 5, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 453, "game_series_count": 0, "reviews_count": 4, "platforms": ["PC"], "developers": ["Altfuture"], "genres": ["Simulation"], "publishers": ["Altfuture"], "esrb_rating": null}