{"id": 13823, "slug": "dark-gates", "name": "Dark Gates", "name_original": "Dark Gates", "description": "Dark Gates is a game which tries to capture classic tabletop RPG experience. As a player you need to assemble a party of six heroes, select spells for them and send them on the quest to the labyrinth. Somewhere in that maze an evil mage created Dark Gates and now gates are open. Your party have to find and destroy those gates as darkness pours into this world through them.<br/><br/>  Task is not easy, labyrinth is different every time you start a new adventure. As you play a map unfolds before you and is never the same. In the maze you will find monsters which you can negotiate with, fight or try to bribe it with gold. There is also many items hidden in the depths of the labyrinth. Some can help you in your quest while others are there just to hurt your team.<br/><br/>  An evil mage, Unnamed have hidden Dark Gates behind mirrors. Party needs to find a pair of them to reveal the gates. In order to do so, party have to explore chambers. Each chamber is locked and entering into a chamber is always dangerous. Traps are everywhere. Remember to have in your party someone who can pick locks and disarm traps.<br/><br/>  Talking about skills. Who you chose into a party is important. Balanced team is a key to make sure you will survive. Remember that if hero dies only a Resurrection spell can bring him/her back if you are quick enough. Don?t despair though, even if all party dies, you can continue current adventure with a new party?assuming you still got some heroes alive.<br/><br/>What to expect from Dark Gates?<br/><br/><ul><li>Classic tabletop experience<br/></li><li>Turn based combat<br/></li><li>Truly unique labyrinth<br/></li><li>Permadeath</li></ul>", "metacritic": null, "released": "2015-01-26", "tba": false, "updated": "2019-08-28T22:12:29", "background_image": "https://media.rawg.io/media/screenshots/ec1/ec125aeb7a9e25131e94a3e26fa0ea30.jpg", "website": "http://darkgates.dfourgames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 61}, "playtime": 3, "achievements_count": 20, "ratings_count": 0, "suggestions_count": 206, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["DFour Games"], "genres": ["RPG", "Indie"], "publishers": ["DFour Games"], "esrb_rating": null}