{"id": 138231, "slug": "light_piercer", "name": "Light_Piercer", "name_original": "Light_Piercer", "description": "<p>Light Piercer is a classic Ikanoid action game, bounce the sharur wrecking ball into satellites to destroy them.</p>\n<p>Background</p>\n<p>In the far distant future Year 1997 global warming put mankind on the edge of extinction. The governments of the world decided to build a space sunshade named \"Light Dam\". Which is over 900 satellites placed in a giant rectangle in front of the Sun, which filters down the light to Earth reducing global warming. </p>\n<p>Apate the Artificial Intelligence controlling light dam began to cut the light to customers who couldn't pay the extortionate light tax. </p>\n<p>Without light from the sun all life on earth began to freeze to death. </p>\n<p>Operation Light Piercer was launched it is your mission to destroy the \"Light Dam\" using Sharur Wrecking Ball before mankind is doomed.</p>\n<p>Instruction</p>\n<p>Space Hawk</p>\n<p>Top secret operation Light Piercer was now implemented. The Spaceship called Space Hawk fitted with plasma force shields repeatedly bounce a nuclear powered plasma wrecking ball called \"Sharur\" into the satellites destroying them one by one. </p>\n<p>Controls</p>\n<p>Move space Hawk left or right, by using the mouse.</p>\n<p>Power Ball</p>\n<p>Space Hawk also was fitted with Power Ball advanced weapon system. When activating Power Ball it would propel the Sharur Wrecking Ball vertically from any direction. Which is useful for accessing isolated satellites, or if a Sharur Wrecking Ball is about to be lost. But be aware every time you use Power Ball the price increases by £1000. There is only one Sharur Wrecking Ball if it drops below the screen everybody dies. </p>\n<p>Controls</p>\n<p>When the Powerball text turns red. Press the right mouse button to launch the Sharur Wrecking Ball vertically</p>\n<p>Space Canaries</p>\n<p>Space Hawk is Supported by spaceships called Space Canaries which can take a limited amount of damage. The Space Canaries will be piloted by death row prisoners, if the mission is successful, they will receive a full pardon.</p>\n<p>Four levels</p>\n<p>The more you ascend the Light Dam, the harder is to damage the satellites. The Light Dam is made up of four levels, each one tougher than the last. Each level contains a brick wall made up of satellites. Satellites have been deliberately set to garish colours to make it harder for you to concentrate on them. </p>\n<p>The satellites can only be destroyed by the Sharur Wrecking Ball. Each level contains a timer once the timer reaches zero, Earth will freeze solid and everybody will die. </p>\n<p>Boss judge Apate</p>\n<p>The very top of Light Dam is where Boss Judge Apate lives.</p>\n<p>Boss Judge Apate Artificial intelligence program is stored in the Satellites. </p>\n<p>Boss Judge Apate which is protected by extreme gold plasma force Shields. This fight is not going to be easy It will test your skill endurance and accuracy to the Max. If you fail the whole life on earth will be extinct!</p>\n<p>Hi guys this is my first game, I would like some Constructive feedback and bug reports.</p>\n<p>I hope you all enjoy it.</p>\n<p> </p>", "metacritic": null, "released": "2017-03-03", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/49e/49e33c35ccf86c79a5002c25c2dffeda.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 74, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Rorschach_Digital"], "genres": ["Action"], "publishers": [], "esrb_rating": null}