{"id": 138229, "slug": "gaijin-heroes-save-japan", "name": "Gaijin Heroes save Japan", "name_original": "Gaijin Heroes save Japan", "description": "<p>In Gaijin Heroes some otakus arrive in Japan to save manga, anime and videogames. Evil ninjas have taken over the country. They have banned all kinds of leisure and have forced the Japanese to work 24 hours a day. All Japanese artist are in danger. Video Games companys are replaced by pachinko factories... Sounds like a joke, right? ^ ^´´ </p>\n<p>Gaijin Heroes is a beat´m up project made by a otaku to otakus. I want to tell you the story of Alex (Spain), Michael (Usa) and Khristeen (Russia) (Gaijin = forengeiner). The plot of many beat 'em up is suggested or left to the imagination of the player. However, in this game I would like to tell a funny story through dialogues and geeky situations, as if the game were a Jrpg. Our heroes do not know each other, they are not the strongest or the most \"normal\" in the eyes of some people, but this is their game; A tribute to those otakus who dreamed of traveling to Japan or meet their favorite mangaka.<br/></p>\n<p>Read here the full story of the game</p>\n<p>This solo-dev game project and failed on kickstarted, so... Well, i put the idea here to obtain some love for the game, if  people like the idea here, i will try to make a indiegogo campaing or something similar to make the game. </p>\n<p>Thank you very much for your support! Doomo arigatoo gozaimasu!   どうもありがとうございます！</p>", "metacritic": null, "released": "2018-07-16", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/fd4/fd4887e02417a3f33418456b8f98e510.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 171, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["rafaturtle"], "genres": ["Action"], "publishers": [], "esrb_rating": null}