{"id": 13834, "slug": "epistory", "name": "Epistory - Typing Chronicles", "name_original": "Epistory - Typing Chronicles", "description": "<p>Epistory - Typing Chronicles is an action-adventure with a heavy focus on a typing mechanics. This is the only game within the IP.</p>\n<h3>Gameplay</h3>\n<p>Every action in the game is tied with the typing words on the keyboard. Thus, the game cannot be ported onto consoles. Unlike the games similar to this genre, Typing Chronicles utilize every adventure-game mechanics to be adapted to typing words.<br />\nFor example, enemies may not die from one hit, so there are several words above their heads. The meaning of the written information often corresponds to the situation on the screen.<br />\nApart from battles, the protagonist may solve puzzles and explore the world. <br />\nThe gameplay is the main attraction of the game — however, it turned its back on the players when it comes to the replayability. The title is monotonous with no gameplay sections without having to type the words.</p>\n<h3>Story</h3>\n<p>The plot tells a story of a poet who sent his muse into the world of unfinished tales to seek for ideas to the next story. The text of the ultimate masterpiece unravels, as Muse proceeds through the levels on her three-tailed fox, changing the environment around her. Somewhere in-between the levels, the semantic idea of interconnecting the meaning with the object faints a little, but the ending is set to explain this minor inconvenience.</p>", "metacritic": 74, "released": "2016-03-29", "tba": false, "updated": "2024-04-22T21:11:25", "background_image": "https://media.rawg.io/media/screenshots/007/00769c75b7c44b5974d20204a27e9293.jpg", "website": "http://www.epistorygame.com", "rating": 3.59, "rating_top": 4, "added_by_status": {"yet": 131, "owned": 1348, "beaten": 58, "toplay": 13, "dropped": 57, "playing": 5}, "playtime": 4, "achievements_count": 55, "ratings_count": 127, "suggestions_count": 543, "game_series_count": 0, "reviews_count": 128, "platforms": ["PC", "macOS", "Linux"], "developers": ["Plug In Digital", "Fishing Cactus"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Plug In Digital", "Fishing Cactus"], "esrb_rating": null}