{"id": 13853, "slug": "robot-city-stadium", "name": "Robot City Stadium", "name_original": "Robot City Stadium", "description": "Robot City Stadium is a competitive multiplayer disc-combat sport focused on skill, nuance, and mastery.<br/><br/><strong>Competitive:</strong> Online multiplayer against friends, enemies, strangers, casual acquaintances, romantic interests, and even people from elementary school who for some reason just sent you a Steam friend request!<br/><br/><strong>Natural:</strong> You'll jump and dodge, block and throw, score points, and annihilate your friends with the natural effortlessness of \"being there\".  No obscure or uncomfortable teleport mechanics here- RCS was built from the ground up to take full advantage of room-scale VR.<br/><br/><strong>Finessed:</strong> RCS is a competitive game, so when you throw your weapon it has to go exactly where you expect, just like throwing a frisbee.  That's different than \"goes where you want\"- there's no aim-assist here.  The precision of the amazing Vive controllers means that what you throw is what you get.  It's up to you to bring the skill.<br/><br/><strong>Nuanced:</strong> Twist your wrist as you release a throw to add some spin for curving trick shots.  Collect and expend \"spark energy\" to give it an in-flight nudge and edge past a barrier or sneak in a hit out of left field.<br/><br/><strong>Varied:</strong> A selection of unique arena layouts and features keeps the action fresh and interesting.<br/><br/><strong>Not-really-all-that-intimidating:</strong> Experienced players are going to beat inexperienced players: that's just the nature of a skill-based game.  Fortunately, we've got friendly AI bots who are happy to train you without the attitudes and platitudes :) :)", "metacritic": null, "released": "2016-12-21", "tba": false, "updated": "2019-08-28T22:12:28", "background_image": "https://media.rawg.io/media/screenshots/b02/b02a611d908fb1ab39089bd28dc973dc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 339, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Virtual Vengeance"], "genres": ["Action", "Sports", "Casual", "Indie"], "publishers": ["Virtual Vengeance"], "esrb_rating": null}