{"id": 138529, "slug": "the-dream-killer", "name": "The Dream Killer", "name_original": "The Dream Killer", "description": "<p>The Dream Killer is a \"Seek and Destroy\" game where the player can just sit back and destroy whoever comes ahead with a Red HP bar. The more player advances in destroying the enemies, the more gold and experience player will get.<br/><br/>The <strong>Gold </strong>will allow players to auto-heal himself when the <strong>HP</strong> is low, <strong>upgrade</strong> the player's ability,<strong> unlock new skills</strong>, and even <strong>summon</strong> support characters to aid in fight.<br/>The <strong>EXP</strong> will help player with leveling. Each<strong> Level Up </strong>will slightly enhance player's maximum <strong>HP </strong>and <strong>Mana</strong>-regenration speed, which is useful in the later stage (which requires player to make multiple attacks at the same time to eliminate the enemies).</p><p>The Game was initially designed to be a 1 hour game where players can spend his/ her office tea-break or lunch-break to smash some monsters before get back to work. However, I decided to make it more playable by adding in multiple skills set and some \"<strong>unlockable character/ ultimate skills</strong>\" where player can choose to replay the game with different combination of skills or abilities upgrade.</p><p>I hope you enjoy this idea and support me so I can make more games like this.<br/><br/>Sorry for the bad English .Here're some Potatoes for you \"O.o\".<br/></p>", "metacritic": null, "released": "2016-04-10", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/21f/21f8eb4ccfb736d4dee486d90f731007.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 190, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["johnooich"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}