{"id": 138652, "slug": "blooprent", "name": "Blooprent", "name_original": "Blooprent", "description": "<p>\n<br/>\r\n\t Blooprent is my take on the puzzle physics genre. There are many challenges to face as the game slowly teaches you how to use each new block type.<br/>\r\n\t The objective is to move the cluster of dots over to a button using a combination of solid blocks, ice, conveyor belts, fans, moving hydraulic parts, and much more.</p><p>\n<br/>\n</p><p>\n<br/>\n<br/>\r\n\t Beating a level once doesn't mean you've truly beaten it. You are scored on your performance according to three categories: the amount of time it takes for the dots to get to the goal, how efficiently you got them there, and the number of entities used.<br/>\n<br/>\r\n\t As you progress through the game you will be introduced to increasingly complex entities. Hydraulics can move blocks, wires can send a signal across them, and so much more. You can even build complex logic circuits and simulate parts of a computer. There is also a built-in map editor that allows you to create your own levels and upload them for others to play.\r\n</p><p>\n<br/>\n</p><p>\n<br/>\n<br/>\r\n\t Blooprent is completely free, give it a try!<br/>\r\n\t You're even allowed to monetize videos that you make playing it. If you enjoy it and would like to fund future indie game development feel free to donate. If I receive a significant amount of donations I'll put together a free expansion pack with new features and levels as a way to thank those who have supported me.\r\n</p><p>\n<br/>\n</p>", "metacritic": null, "released": "2014-12-24", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/2e2/2e29b5e5bd714a557ccd5c7833c68075.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 48, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["djoslin"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}