{"id": 138618, "slug": "square-pegs-round-holes", "name": "Square Pegs Round Holes", "name_original": "Square Pegs Round Holes", "description": "<p>Square Pegs Round Holes is a 2D puzzle game set to test your reflexes as you try and collect the falling shapes in the correct boxes. Use speed boosts and rockets to keep on top of the shapes as they fall. Watch out for shapes that explode or those that are camouflaged. Fail to collect the shape in the right box or miss it entirely and it'll be junk - too much junk and it's game over! Set the highest score you possibly can and complete 10 achievements to become a master of the factory!</p><p>Platforms: The game is currently available on Windows and Mac OS X. I haven't been able to test it properly on Linux so do not feel confident releasing on that platform. If you are a Linux user and would like to play and provide some test feedback, please get in touch. If I can make sure it works on Linux OK, I'll release a version for that platform too.</p><p>Controls: You just need a mouse to play this game.</p><p>This is my first game, completed in my spare time over the past 4 months. I have spent the last couple of years teaching myself to code with GameMaker and I have a couple of other projects in the pipeline. You can find out more on my website www.michael-bateman.com, please feel free to leave a comment below or email me at contact@michael-bateman.com to get in touch. If you find any bugs or have any constructive feedback, please let me know :)</p>", "metacritic": null, "released": "2016-08-26", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/89a/89a56973a7c8cc8c7cec6bde6f4ebcf9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 46, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Michael Bateman"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}