{"id": 138697, "slug": "frogario-frog-eater-io-game", "name": "Frogar.io: Frog Eater IO Game", "name_original": "Frogar.io: Frog Eater IO Game", "description": "<p>Frogar.io is <strong>the ultimate Frog Eater IO game</strong>. It is a frogtastic fun-filled mobile online multiplayer game where you <strong>play against hundreds of other players</strong> all competing to be the biggest and baddest frog in the world!</p>\n<p>In Frogar.io, you will enjoy:</p>\n<ul><li><strong>Global leaderboards</strong>, along with your own personal \"friends\" leaderboard. <strong>Add and compete against your friends</strong>!</li><li><strong>Play against hundreds of other players</strong> from all over the world, on your mobile device!</li><li><strong>NO LAG!</strong></li><li><strong>Easy &amp; rewarding gameplay</strong> with deep meta-game. Play casually whenever you want, or master the game to become the best! Earn daily rewards from completing quests.</li><li><strong>Unlock loads of beautiful frogs</strong>. New frogs are added regularly!</li></ul>\n<p>Frogar.io is not only the best Frog Eater IO game ever, with hundreds of players from all over the world playing right now; It is also super easy to play. The intuitive controls allow you to play the game with just one finger!</p>\n<p>There is a surprising level of depth in the gameplay. On the face of it, Frogar.io is a simple game where you tap the screen to jump your frog, collect flies, kill frogs, all in the attempt to earn the biggest score. However, looking a little deeper there is a lot that you can do in this little game! <br/></p>\n<p>There are plenty of different strategies that you can use. Whether you want to play passively, jumping around the edges of the world as far away from danger as possible, or whether you want to dive straight into the action, there is a play-style that will suit every type of player. Ultimately, there is always something that you can do to improve your score and you will never be bored!</p>\n<p>Frogar.io is a truly beautiful game. Although simplistic, the relaxing sound-track mixed in with the subtle glow and beautiful detail of the frogs make this game a real joy to play. If you haven't played this game yet, what are you waiting for!?</p>\n<p>Frogar.io, the ultimate Frog Eater IO and mobile multiplayer online game can also be found on:<br/></p>\n<ul><li>Facebook: https://www.facebook.com/frogario/</li><li>Twitter: https://twitter.com/Frogariogame</li><li>Instagram: https://www.instagram.com/frogario/</li></ul>", "metacritic": null, "released": "2017-07-18", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/f5b/f5b7ad5e86c7e98ec9df594fc8eb0a75.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 101, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Jadoku"], "genres": ["Action"], "publishers": [], "esrb_rating": null}