{"id": 13870, "slug": "space-colony", "name": "Space Colony", "name_original": "Space Colony", "description": "Half way across the galaxy with limited resources, a mega corporation looking over your shoulder and a ragtag crew expecting a pay cheque, it's up to you to survive and turn a profit. You have a base to build and hostile alien threats to neutralise, but ignore your crew and the colony is doomed. Each colonist has a mind of their own, so keeping them safe, happy and alive is no easy feat. Nurture your crew and they’ll team up to protect your intergalactic empire, forget to pay them and you’d better post a guard at the reactor!<br/><br/>As a commander of military and commercial installations on Earth, Blackwater Industries wants to see how you handle the rest of the galaxy. In Space Colony your career is in the hands of an unruly crew, all looking to escape life back on Earth. Choosing from more than 100 different buildings, it’s up to you to design and build a colony that meets their needs. Before you shell out your credits on iron extraction and lucrative space chicken production remember that without laser defences, a sauna and a half-decent restaurant nobody is going to want to work for you.<br/><br/>Steam Edition<br/>Created exclusively for Steam, this remastered version of Space Colony features a new Galaxy mode 'Obar' mini-campaign, Steam Workshop support, achievements, trading cards and Steam Cloud for saved games. Space Colony: Steam Edition is the definitive version of the sci-fi base builder for fans of the original, the builder genre and the Stronghold series, with which it shares DNA in both gameplay and an irreverent sense of humour.<br/><br/>Also supported are settings for HD graphics unavailable in the original version, allowing players to view their entire base on a single screen! Detect alien life forms early and counter-attack before they get near your crew, keep an eye on all workers at once or harvest resources off-base while making sure everyone visits the colony psychologist.<br/><br/>Features<br/><ul><li><strong>Remastered for Steam</strong> - New 'Obar' mini-campaign, Achievements, Trading Cards, Steam Workshop, Steam Cloud support and a re-balanced Easy Mode.<br/></li><li><strong>Construct a Colony</strong> - Design a base for cosmic warfare or interplanetary tourism with military and civilian campaigns.<br/></li><li><strong>Defend Your Crew</strong> - Protect your colonists from alien life forms with Hovermines, laser turrets and the fearsome Dogbot.<br/></li><li><strong>Train Specialists</strong> - Select your crew from a cast of 20 unique characters and train them in cybernetics, mining, lasers and more.<br/></li><li><strong>Explore the Planet</strong> - Increase your wealth and standing with Blackwater Industries by mining minerals and expanding your colony with over 100 different structures.<br/></li><li><strong>HD Upgrade</strong> - High resolution graphics allow you to view your entire colony on a single screen.</li></ul>", "metacritic": 74, "released": "2015-04-30", "tba": false, "updated": "2022-12-20T11:24:46", "background_image": "https://media.rawg.io/media/screenshots/45f/45f5daf75350dc85e183c6353c76e5a8.jpg", "website": "http://www.spacecolonyhd.com", "rating": 3.93, "rating_top": 4, "added_by_status": {"yet": 14, "owned": 223, "beaten": 3, "toplay": 1, "dropped": 7}, "playtime": 3, "achievements_count": 26, "ratings_count": 14, "suggestions_count": 569, "game_series_count": 0, "reviews_count": 14, "platforms": ["PC", "macOS"], "developers": ["FireFly Studios"], "genres": ["Strategy", "Simulation"], "publishers": ["FireFly Studios"], "esrb_rating": null}