{"id": 13879, "slug": "hearthlands", "name": "Hearthlands", "name_original": "Hearthlands", "description": "Hearthlands is a medieval/fantasy city-building real time strategy game in which you take a role of a king in a procedurally generated world. You can not control your subjects directly; instead you focus on city-building, resource management, diplomacy, heroes, magic and other things a <br/>typical king deals with on a daily basis.<br/>The game is very flexible: you can build up a powerful realm and rule the lands with an iron grip, or establish a humble fishermen village. Or create a trading empire. Or found a small, but well-defended outpost or raider's camp. Or become a host of a wizard's manor.<br/>All characters, from a hauler to a hero have their own minds and behavior patterns. Sometimes it is interesting just to watch people scurry about minding their own business.Features:<ul><li>Build a medieval city;<br/></li><li>Play the game the way you like it: experiment with sandbox settings or play a campaign mode (ex. Polish localization);<br/></li><li>Keep your people happy by providing them with necessary resources and services;<br/></li><li>Gather resources, produce goods and build industries;<br/></li><li>See reports and tune up your economy;<br/></li><li>Build an army and protect your city from monsters and invasions;<br/></li><li>Trade and conduct diplomacy with neighbor realms, or go to war with them;<br/></li><li>Research technologies and cast spells;<br/></li><li>Challenge yourself by going after one of the achievements.</li></ul>", "metacritic": null, "released": "2014-12-12", "tba": false, "updated": "2023-05-25T12:03:20", "background_image": "https://media.rawg.io/media/screenshots/2ce/2ce3abf1324a5386a37624b5502e743d.jpg", "website": "http://hearthlands.com", "rating": 3.44, "rating_top": 4, "added_by_status": {"yet": 10, "owned": 170, "toplay": 3, "dropped": 5}, "playtime": 2, "achievements_count": 50, "ratings_count": 9, "suggestions_count": 439, "game_series_count": 0, "reviews_count": 9, "platforms": ["macOS", "Linux", "PC"], "developers": ["Sergio", "Simon", "Sergio & Simon"], "genres": ["Strategy", "Simulation", "Indie"], "publishers": ["Sergio & Simon", "Simon", "Sergio"], "esrb_rating": null}