{"id": 13882, "slug": "shepherds-of-the-abyss", "name": "Shepherds of the Abyss", "name_original": "Shepherds of the Abyss", "description": "Shepherds of the Abyss is an action-packed, multiplayer tower defense game - one inspired by some of the best tower defense mods for Warcraft 3. Some of its key features include:\"mazing\"\"Mazing\" is the art of filling a wide-open space in a tower defense game with your towers to build the longest possible path (the maze) that the enemy's units must travel before reaching your throne. \"Mazing\" is a core skill in Shepherds of the Abyss, and it's put to the test with random obstacles and waypoints spawned each game to prevent you from memorizing the strongest maze setup.unique Unit BuffsEvery unit in Shepherds of the Abyss is granted various buffs with significant strengths, such as making them heavily armored, increasing their movement speed, granting them high regeneration, or giving them shields.  The towers all provide hard counters to these buffs, so building the correct towers in optimal locations is key to success.empowering towers Shepherds of the Abyss is a dual resource tower defense game.  Gold is used to build and upgrade, while the power of souls you've collected from dying units is used to empower towers on a wave to wave basis.  Empowering towers unleashes additional strength and functionality to help them overcome the units' buffs.  For example, some towers gain damage over time while others snare units they attack.round SeparationGameplay is separated into multiple phases - Preparation Phase, where all building, upgrading, and empowering is done, and then Combat Phase, where units attack all players at once and souls are harvested.Incoming Wave ManipulationAll of the buffs possessed by the incoming wave of units appear in a grid during Preparation Phase (see screenshots above).  Buffs that are adjacent multiply each other's strength, so it's important to move matching buffs apart.  However, the movements of these buffs are limited, so you must study the entire grid and make your moves carefully.included Game Modes:<ul><li>Single-player Survival - survive as many waves as possible.<br/></li><li>Cooperative Survival - survive as many waves as possible with the help of a friend.<br/></li><li>Head-to-Head - play against another player in a 1v1 battle.</li></ul>", "metacritic": null, "released": "2016-11-18", "tba": false, "updated": "2019-08-28T22:12:27", "background_image": "https://media.rawg.io/media/screenshots/9af/9af84fa5e766f78055d1ede4aec8026d.jpg", "website": "http://www.shepherdsoftheabyss.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 6}, "playtime": 1, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 361, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Impulse Games"], "genres": ["Action", "RPG", "Strategy", "Indie"], "publishers": ["Impulse Games"], "esrb_rating": null}