{"id": 138922, "slug": "jelly-monster-sweet-mania", "name": "Jelly Monster - Sweet Mania", "name_original": "Jelly Monster - Sweet Mania", "description": "<p>Welcome to the amazing sweet land in one of the best matching games in the world!</p><p>Little candy paradise in little match game with cupcake and donut galaxy, immaculate lollipop space, mountains of jellies, other and other sweet things! This sweetygame will make you happy!</p><p>- 100+ levels waiting for you in Jelly Monsters - Sweet Trip<br/>- Beautiful crush, blast and splash of jelly monsters<br/>- Nice HD graphics for tablet and smartphone<br/>- Pop this jelly monsters for your pleasure<br/>- Deluxe sweet jellies land, candies space and lollipops adventure!<br/>- Amazing sweet journey with story line in this match 3 quest game</p><p>Enjoy each and every sweet world with entertaining challenges.</p><p>HOW TO PLAY:</p><p>1. When you match three or more Jelly Monsters of the same color together, they are cleared from the play field.</p><p>2. Match five or more sweet monsters to have a combo!</p><p>3. Create combos, sweet bombs and jelly blasts to get more scores and share it to your friends!</p><p>Blast and splash nice jelly monsters, crush candy or cookie, pop magic bubble and sweet bomb! You can lay one of the best 3 match games without internet connection! Start of sweet journey is easy, but things get more and more interesting and challenging. </p><p>Bring this top casual game with candy island, jumping jellies, nice sweet monsters and share your progress with your friends on your page in facebook. Nice Jelly jump and pop on your device!</p><p>3 matching puzzle with jellies, lots of levels, fun time together with splashing jelly animation. Free Match 3 games with bonuses is here! You can find it on Jelly Monster - Sweet Mania!</p>", "metacritic": null, "released": "2016-03-01", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/95c/95c963607b2b27a8e7dfd74ba2630b88.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 45, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["sweetgamesbox"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}