{"id": 139098, "slug": "qwoptopus", "name": "QWOPTOPUS", "name_original": "QWOPTOPUS", "description": "<p>This is a SplashJam16 game, check out the other games here: https://itch.io/jam/splash16!</p><p>From legends we know that since the beginning of time a being twisted and immense -- known to Northern folk as the Ox of Death, as Tursas, the Bearded Liver-on-the-Brink, Rancid Planter of the Great Oak, or simply as the Kraken  -- has roamed the seas as sovereign... but the beginning of the Age of Oil is about to change everything. </p><p>Can you help the shrunken rusty-limbed grouchy oldster outrun an oil spill in arctic waters? </p><p>A game made during SplashJam 2016 for our custom triple-wheel force feedback controller.*</p><p>*http://aipanic.com/projects/rotator</p><p>If a triple-wheel force feedback controller is unavailable on your shores, don't worry! Just use QWEASD in an effort to control the Qwoptopus and see how far you can get before oil catches up (or come check it out at Alt.Ctrl.GDC). The limb controls change on each play-through. <br/></p>This humble underwater homage crafted on arctic waves<p>by</p><p>Petri Autio - Code! Music!</p><p>Robin Baumgarten - Code! Hardware Guru!<br/></p><p>Wendy Browne - Art!</p><p>Kristín Guðmundsdóttir - Art! </p><p>\"From the ocean rose a giant,<br/> Mighty Tursas, tall and hardy,<br/> Pressed compactly all the grasses,<br/> That the maidens had been raking,<br/> When a fire within them kindles,<br/> And the flames shot up to heaven,<br/> Till the windrows burned to ashes,<br/> Only ashes now remaining<br/> Of the grasses raked together.<br/> In the ashes of the windrows,<br/> Tender leaves the giant places,<br/> In the leaves he plants an acorn,<br/> From the acorn, quickly sprouting,<br/> Grows the oak-tree, tall and stately,<br/> From the ground enriched by ashes,<br/> Newly raked by water-maidens;<br/> Spread the oak-tree's many branches,<br/> Rounds itself a broad corona,<br/> Raises it above the storm-clouds;<br/> Far it stretches out its branches,<br/> Stops the white-clouds in their courses,<br/> With its branches hides the sunlight,<br/> With its many leaves, the moonbeams,<br/> And the starlight dies in heaven.\"</p><p>- Kalevala, Rune II<br/></p><p>Things we wanted to implement in the jam but aren't in the game yet:</p><p>- Jellyfish to sting limbs</p><p>- More varied terrain, big rocks, tunnels and gorges</p><p>- Qwoptopus dragging a cruise liner<br/></p><p>- A win condition...<br/></p>", "metacritic": null, "released": "2016-02-28", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/c4b/c4bd9e0cf0d4964cd74e5f25fc8383e3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 92, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["ArchBang"], "genres": ["Action"], "publishers": [], "esrb_rating": null}