{"id": 13901, "slug": "super-lovely-planet", "name": "Super Lovely Planet", "name_original": "Super Lovely Planet", "description": "<ul><li>Jump to dodge bullets and defeat baddies<br/></li><li>Discover shortcuts and find secrets<br/></li><li>Talk to NPCs and revisit iconic locations<br/></li><li>Journey to Lovely Planet one last time!</li></ul><br/><br/><br/><br/><ul><li>It's not a shooter game. You can't shoot in this game. There's no gun<br/></li><li>You don't unlock any skills or abilities. There is only the jump button<br/></li><li>That other 3D platform game you know from the 90's? Super Lovely Planet is probably not like that game at all<br/></li><li>One thing it does have in common with other 3D platformers? Collectibles<br/></li><li>There's plenty of shortcuts to discover<br/></li><li>Is the game difficult? Yes, only if you're not good at it<br/></li><li>\"Simple\" as in straightforward. Later levels in the game can be quite challenging<br/></li><li>There's a story but it's not shoved in your face<br/></li><li>NPCs don't keep you for too long. They don't beat around the bush or waste your time trying to be funny<br/></li><li>Some NPCs have a line of dialogue. Others might even be wearing hats.<br/></li><li>There are a total of four achievements to unlock<br/></li><li>You don't defeat an \"evil mastermind\". There's no boss fights<br/></li><li>I have ideas for Lovely Planet 2. I also have a prototype ready<br/></li><li>Look, I can't really explain why it's not a shooter game. I wanted to make a platformer, so I made a platformer. Okay?<br/></li><li>You're still reading this? Pro tip - there is in fact a second jump button the game never tells you about<br/></li><li>Here's the solution to level 32 - Jump straight down, hang a right and carefully crawl along the passage till you hit a left turn. From there, carefully drop to your right and go straight till you reach the end of the beam. Drop down to the platform below and follow the path to your left. You'll find an NPC there who will show you the rest of the way.<br/></li><li>Don't look for the Mad Wizard in the forest, the NPCs, they're lying to you</li></ul><br/>", "metacritic": null, "released": "2017-07-28", "tba": false, "updated": "2019-08-28T22:12:27", "background_image": "https://media.rawg.io/media/screenshots/f04/f047b607f1b3cec4d6ca2c731f1af162.jpg", "website": "http://quicktequila.com/superlovelyplanet", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 30, "beaten": 1, "toplay": 1, "dropped": 1, "playing": 1}, "playtime": 1, "achievements_count": 3, "ratings_count": 2, "suggestions_count": 49, "game_series_count": 0, "reviews_count": 2, "platforms": ["macOS", "PC"], "developers": ["QUICKTEQUILA"], "genres": ["Indie"], "publishers": ["QUICKTEQUILA"], "esrb_rating": null}