{"id": 139254, "slug": "ritual-of-day", "name": "Ritual Of Day", "name_original": "Ritual Of Day", "description": "<p>\r\n\t==EN==\r\n</p><p>\r\n\t Wife is sending us for a shopping exactly in the moment when our city is being attacked by huge earthworm.\r\n</p><p>Everyone knows the game, where You were monstrous centipede which devastates whole city and eats people everywhere in which army tries to stop us. Obviously a copy of this type of game would be boring as hell, but what if situation is changed? Main element is reversed situation where YOU are a guy who lives in this type of city? Also in parallel our missus is giving us stupid tasks to do when oversized centipede is destroying city! Main task is to run through city to get things for wife and gaining money to buy these things. Our hero have to earn money, buy stuff and avoid to be eaten by a centipede! Everything in limited time.<br/></p><p>Left Arrow - move left or get money<br/> Right Arrow - move right or get money<br/> Up Arrow - jump<br/> Down Arrow - use building<br/> Enter - reset (only when you die)</p><p>\r\n\t==PL==\r\n</p><p>\r\n\tŻona wysyła nas po zakupy, podczas gdy nasze miasto jest atakowane przez wielkiego podziemnego robaka.\r\n</p><p>Każdy chyba kojarzy gry, w których wcielamy się w wielkiego robaka pożerającego ludzi w mieście oraz wojsko próbujące go powstrzymać. Oczywiście zrobienie czegoś takiego było by kolejnym kotletem z mikrofali, ale co by było gdyby sytuacja się odwróciła, a ty miałbyś mieszkać w takim mieście. Generalnie nie było by tak źle, gdyby żona jeszcze na nas nie wrzeszczała, że mamy iść po zakupy, podczas gdy każde wyjście z budynku może się równać pożarciu przez przerośniętą glizdę. Biegamy za zachciankami naszej staruszki w między czasie zahaczając o pracę bo oczywiście wszystko kosztuje, a staremu dupsku nie chce się ruszyć tyłka z domu. Nasz biedny bohater musi biegać po całym mieście i kupować rzeczy zarabiać pieniądze i unikać zjedzenia, a to jeszcze w ograniczonym czasie.<br/>\n</p><p>Left Arrow - bieg w lewo oraz zarabianie pieniędzy<br/>\r\n\tRight Arrow - bieg w prawo oraz zarabianie pieniędzy<br/>\r\n\tUp Arrow - skok<br/>\r\n\tDown Arrow - użyj budynku<br/>\r\n\tEnter - zacznij od nowa (tylko po śmierci)<br/>\n<br/>\n</p>", "metacritic": null, "released": "2016-01-31", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/241/24135ecda71e73cff68d0cfb613df68b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 45, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["OnionMilk"], "genres": [], "publishers": [], "esrb_rating": null}