{"id": 139331, "slug": "private-investigation", "name": "Private Investigation", "name_original": "Private Investigation", "description": "<p>Je suis élève Premium de Gamecodeur  de puis le 25 aout, mon pseudo c'est <strong>JackBauer. J</strong>e suis au début de la formation et au niveau Shoot'em'up, donc j'ai utilisé le langage LUA et Framework LOVE2D</p>\n<p>J'ai codé tout seul, avec l'aide des vidéos de David et les graphismes se sont des photos trouvées sur Google. La musique de fond c'est tiré d'une vieille série de mon époque :-) \"Mike Hammer\". J'ai travaillé 1h par jour sauf le week_end et les derniers jours car ce n'est pas évident avec la vie de famille.</p>\n<p>Mon postmortem : Ce jeu d'aventure est un pur prototype, je n'ai pas eu le temps de terminer tout ce que je voulais réaliser. On peut juste se balader et prendre les objets. Mon inspiration vient de différent jeu d’enquête des années 80 mais surtout le jeu \"Affaire Vera Cruz\".</p>\n\n<p>J'ai bien appris avec les vidéos de David et ce jeu m'a permis de mieux comprendre les possibilités des variables tableaux et la logique des fonctions. J'ai voulu aussi mettre en pratique les modules que j'ai réussi à faire mais en galérant un peu.</p>\n<p>Mes points à améliorer leur de la prochaine GJ; <br/></p>\n<p>- j'essaierai d'utiliser le conseil de David, et de faire la Game Jam dans un temps limité 48 ou 72h ce qui est parfois pas évident.</p>\n<p>- ne pas avoir des ambitions trop élevées car pour ce jeu je voulais créer une interface avec le PC Portable et interagir avec mes indices.</p>", "metacritic": null, "released": "2018-07-08", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/c33/c337fe99ea4f7ccd9f99db600da48baa.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 14, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["jackbauer"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}