{"id": 139375, "slug": "kids-coloring-fun", "name": "Kids Coloring Fun", "name_original": "Kids Coloring Fun", "description": "<p>- Set your child's imagination on a prehistoric journey with our kids coloring fun. This interactive coloring book allows your child to select from a wide variety of images creating a never ending coloring book. Allow children to color their favorite characters like Oggy, Pooh over and over with easy to change colors allows your child to create different variations of their masterpiece. Share your child's creation or save to your device to show their adventure later.</p><p>.- An app can be used at the playschool, preschool, for fun as an educational drawing game. For girls we have Princesses, Mermaids,and flowers we prepared. Coloring book for boys are diggers, vehicles , dinosaurs and blank page doodling. The biggest attraction though is colouring animals, that make real sounds!</p><p>- As parents, we know how important it is to have the right applications installed for our kids to use. Before we started working on Kids Coloring Book, we were using many different applications but nothing we found fully met our expectations. Our application helps kids develop motor skills and learn color combinations. It can also help your kids learn words such as animal names.</p><p>- How to play:<br/>- Navigate through all available animated coloring books. Pick one to begin coloring, including:<br/>* Boys Book: Contains some sketch : Monsters, vehicles, ...........<br/>* Animals Book: Contains some sketch: Dogs, Cats, Horses, dinosaurs.................<br/>* Girls Book: Contains some hearts, dresses, Mermaids, Princesses like Cindrella and aurora...........</p><p>kids coloring fun features:<br/>● Realistic finger colouring book for kids that requires precision and practice.<br/>● Possibility of coloring the images included or free drawing painting with finger on white canvas.<br/>● Several categories coloring: fantasy, animals, alphabet, buildings, plants, food, space, transport, sports, people, landscapes and more.<br/>● 17 predefined color pencils and color palette so you can select any other color.<br/>● Select the pencil size 1-100.<br/>● 6 different effects for the stroke.<br/>● Eraser.<br/>● Undo and Redo functions in free drawing.<br/>● You can share the pictures via mail, Google+, Facebook, Twitter, WhatsApp, ...<br/>● Very easy to play and use.<br/>● Adapted to mobile or tablet.<br/>● Completely free!!.<br/>● Age Level: 1+<br/>● Colouring book HD - the app adjusts to screen sizes of all devices including tablet<br/>● Free updates</p><p>- We have another collection having 200 pictures of various kinds, including girls, boys, cars, animals, dinosaurs, and Christmas etc. just enter in our store and will find it.</p><p>- Enjoy!<br/>For any comments or suggestions, please send an e-mail. Thanks!.</p>", "metacritic": null, "released": "2016-11-10", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/27b/27b313e07de5d2301d488d3a880b4f99.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 56, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["midooow"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}