{"id": 139469, "slug": "route-66-ghost-stories", "name": "Route 66 Ghost Stories", "name_original": "Route 66 Ghost Stories", "description": "<p>The Southwest United States is a mysterious place indeed. Amongst the stereotypical cacti, tumbleweeds, and dust lay fables and urban legends of ghosts and supernatural phenomena, waiting for their next victim in abandoned hospitals, waterways, and even theaters. </p>\n<p>Albuquerque is no exception to these hauntings; in fact, it is one of the most haunted cities in the entire Southwest. Travel around Albuquerque and explore some of its most well known haunted places, discovering their histories and learning more about the city's legends. But be careful that their denizens don't catch up to you...</p>\n<p><em>This game is a class project for UHON401 - Local Games in Albuquerque, taught at the University of New Mexico's Honors College by Prof. Chris Holden. What you are downloading is a tech demo that may or may not reflect the final design of the game. </em></p>\n<p>This game includes sound, and is recommended for players 13 and up, due to the nature of the horror in game. </p>\n<p><strong>To Run the Game:</strong></p>\n<ol><li>Download the attached .zip file.</li><li>Click on the .html file. This will launch the game in your default web browser. Do not open any of the folders in the .zip file, otherwise the game will break.</li><li>After beating the game, please fill out the attached Word document and send it to the included email address.</li></ol>", "metacritic": null, "released": "2017-10-25", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/411/411ab77fd96d0e190cdacab385b6979f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 3, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["beseng"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}