{"id": 139480, "slug": "a-tempest-in-the-abyss", "name": "a tempest in the abyss", "name_original": "a tempest in the abyss", "description": "<p><strong><em>a tempest in the abyss</em> </strong>is a <strong>short</strong> interactive audiovisual experience which <strong>contemplates</strong> on the causes and effects of the emotion of<strong> hatred</strong>.</p><p>This is the first project for my Game Environments class at Parsons School of Design. As a creative challenge we were assigned a emotion and asked to make a game on that emotion only through traversing a space in a first person perspective, without any characters or dialogue. </p><p>The emotion I was assigned was hatred. Since the assignment's constraints would not allow the usage of words or characters, I would have to solely rely on the space or the architecture to communicate with whoever decides to engage with it. Like the gradual transformation of the wallpaper in the yellow wallpaper became a symbol for the protagonist's depression, anxiety and subsequently her insanity, the space in my \"game\" would be constructed as a \"mindscape\" to serve as a symbol for the emotion of hatred and its effects on the psyche. This is illustrated with the use of the singular colour of red against a black landscape to which slowly distorts as the player goes along, along with a music piece remixed from John Luther Adam's Become Ocean which grows in intensity as time passes.</p><p>While this project is not perfect by any means, I was happy to take up the challenge given to me and try my best to create a game which would be a foundation for my future process.<br/><br/></p><p>Controls-</p><p>Use Mouse to look around.</p><p>Use W,A,S,D or arrow keys to move.</p>", "metacritic": null, "released": "2017-02-13", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/e32/e3212d76260783f876ebad47eb3ebd17.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 33, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Tanish Karmakar"], "genres": [], "publishers": [], "esrb_rating": null}