{"id": 13969, "slug": "evolvation", "name": "Evolvation", "name_original": "Evolvation", "description": "EvolvationEvolvation is a class based and fast paced multiplayer arena space flying shooter with multiple game modes which can be played solo as well as team-based gameplay.DevelopersThis indie game is created by a two man team stationed in the Netherlands, Amsterdam!Reclaim the galaxy and evolve or die fightingEvolvation is a project that HyperReuts started over a year ago with the ambition to create a fast paced multiplayer spaceshooter with a lot of action. By making use of Unreal Engine 4 we want to provide our users with an AAA quality game that can still be played on low-end devices.Amazingly fun to play, instant multiplayer action!Most spacegames do not support multiplayer. We do support multiplayer! Multiplayer is awesome! If multiplayer is supported in a game, we miss actual player to player interaction. It feels like a major world where you play a single player game with the occasional greeting of an other player.Do you dare to enter the arena?Evolvation in an arena based multiplayer game like Unreal Tournament, Call of Duty (multiplayer), Quake, etc.. This means that a continuous player to player interaction is inevitable. Other players are the central game elements! In some games it is just traveling from one location to another location (We have read that some journeys wherein nothing happens take more than 20 minutes!). Since it is an arena based multiplayer game, the players are restricted with level bounds. All maps are designed for optimal interaction, it is nearly impossible to not have an interaction within 30 seconds!A new breed of class based multiplayer actionEvolvation is a class based multiplayer game! With classes such as: Highspeed, Fighter, Stealth, Support and Tank. Each class has its own special abilities which provides a dynamic and balanced gameplay.\"Finally a game that I can play, no pay to win!\"Some games give players advantages if they invest more real-life money. We think it ruins the gameplay for a lot of people. It is simply not fair! So no, we are not going to do this. We think it is not fair for other players when some players invest more money than others. We may gain more revenue with these options. But our main goal is to develop a fun multiplayer game. We refuse to ruin the gameplay for our own winnings. Our motto: We win if you think the game is fun to play!\"Great dynamics! Perfect for casual and intense gaming.\"It is common in other games that you can not play with your friends that invest a lot more time than you because they have significantly better stats. In Evolvation, you can! We understand that you might have a job and cannot play for 40 hours per week. Of course, with our extensive upgrading system you can get advantages over other players. But we aim to let these gaps in advantages to be “just right” so that people who can not or do not want to play for 40 hours a week, it will still be fun to play the game.Key Features<br/><ul><li> Fast paced multiplayer game<br/></li><li>    AAA visuals<br/></li><li>    Class based multiplayer game with classes such as: Highspeed, Fighter, Stealth, Support and Tank. Each class has its own special abilities which provides a dynamic and balanced gameplay.<br/></li><li>    Multiple camera modes including 1st and 3rd person modes<br/></li><li>    Several input types such as console controllers<br/></li><li>    In-depth upgrade and leveling system<br/></li><li>    Movement system with six degrees of freedom<br/></li><li>    Customizable spaceships<br/></li><li>    PC-platform</li></ul>Currency is changedIn the late future, the currency that we now take as granted, is no more. The evolving need of data in the future has become so important that is has become a currency. Gain data in Evolvation and buy, repair and upgrade your spaceship with your collected data!Millions of possibilitiesYou have the option to buy new spaceships, weapons, engines, computers and much more! You are able to configure your very own spaceship to your liking. Thousands of configurations are possible, so you can make your spaceship unique. But be aware, in order to buy an upgrade, you are required to have sufficient in-game currency. This currency can be acquired with several in game methods.", "metacritic": null, "released": "2017-02-06", "tba": false, "updated": "2023-12-18T17:35:02", "background_image": "https://media.rawg.io/media/screenshots/cf8/cf83a9cb3c6c66588d928784c2c0e39a.jpg", "website": "https://www.evolvationthegame.com", "rating": 1.94, "rating_top": 1, "added_by_status": {"yet": 77, "owned": 1160, "beaten": 2, "toplay": 2, "dropped": 10}, "playtime": 3, "achievements_count": 133, "ratings_count": 82, "suggestions_count": 448, "game_series_count": 0, "reviews_count": 83, "platforms": ["PC", "Linux"], "developers": ["HyperReuts"], "genres": ["Action", "Simulation", "Casual", "Massively Multiplayer", "Indie"], "publishers": ["HyperReuts"], "esrb_rating": null}