{"id": 139698, "slug": "hitman-the-floor-is-lava", "name": "HITMAN: The Floor Is Lava", "name_original": "HITMAN: The Floor Is Lava", "description": "<p><strong>HITMAN: The Floor Is Lava</strong> is a tile-based puzzle game where you must eliminate your targets without backtracking, stepping on tiles that you've already been on, or being shot in the face by guards!</p>\n<p>This is my second submission for the Ludum Dare, and lemme tell you: it was just as exciting to create as the first! I was really lost with the theme in this one. *Running Out of Space* gave me ideas about making some kind of illness-infested village where the player gradually gets overcrowded by sick villagers and it's a struggle to survive. Meanwhile, my friend suggested a runner game where the player would be trying to escape a collapsing mine: also running out of space. Lots of ideas were thrown around, but eventually I came up with a 2D hitman game where you could never step where you've already been, slightly inspired by HITMAN GO, and obviously by the HITMAN series of games. At first the game was meant to include the ability to poison your targets and set up traps, but after realizing the time constraints I chose to focus the game entirely around a simplified range of mechanics, and I think working within the limits of my own game when designing the levels was a very fun challenge on its own!</p>\n<p>I really hope you enjoy the game as much as I loved making it, and can leave me some feedback while you're at it. Enjoy Ludum Dare 42, everyone!</p>", "metacritic": null, "released": "2018-08-12", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/48c/48c20d871998a7e85b1d450b51e00856.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 119, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Niker107"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}