{"id": 13977, "slug": "airscape-the-fall-of-gravity", "name": "Airscape - The Fall of Gravity", "name_original": "Airscape - The Fall of Gravity", "description": "<p>Airscape - The Fall of Gravity is an indie platformer developed by Cross-Product.</p>\n<h3>Plot</h3>\n<p>A small octopus family falls victims to an unknown alien force and are captured by it. The youngest octopus sets out to find his family in an unfamiliar world in which it is possible to manipulate gravity.</p>\n<h3>Gameplay</h3>\n<p>Airscape - The Fall of Gravity is a fast-paced action platformer with the addition of gravity shifting mechanics. The players have to traverse an environment consisting out of floating islands, water bodies, and robots. Five playable characters are available to the player, with every character having their own ups and downs.</p>\n<p>It is essential to get used to the octopus movement, as it is realistically simulated. The players will experience a smooth transition between moving on land and swimming through numerous water bodies that are present in the game.</p>\n<p>It is not possible to attack the enemies in Airscape - The Fall of Gravity. The players have to rely on their skills and intellect to outmaneuver and run away from their enemies. It is necessary to dodge bullets, avoid mines and outwit the enemy seekers. A hardcore difficulty option is available to the most dedicated players.</p>\n<p>The game features 60 levels which are divided into 18 different zones, that vary in both their environments and gameplay.</p>", "metacritic": null, "released": "2015-08-11", "tba": false, "updated": "2023-07-29T14:58:32", "background_image": "https://media.rawg.io/media/screenshots/a69/a69f2cb01d957a457cf887632a5387da.jpg", "website": "", "rating": 2.03, "rating_top": 1, "added_by_status": {"yet": 45, "owned": 1043, "beaten": 4, "toplay": 1, "dropped": 17, "playing": 1}, "playtime": 3, "achievements_count": 23, "ratings_count": 58, "suggestions_count": 283, "game_series_count": 0, "reviews_count": 58, "platforms": ["macOS", "PC", "Linux"], "developers": ["Cross-Product"], "genres": ["Action", "Adventure", "RPG", "Strategy", "Simulation", "Sports", "Racing", "Arcade", "Casual", "Indie"], "publishers": ["Cross-Product"], "esrb_rating": null}