{"id": 139748, "slug": "colors-on-canvas", "name": "Colors on Canvas", "name_original": "Colors on Canvas", "description": "<p>Colors on Canvas is an educational game; it represents a foray into the wonderful world of paintings. You will get to examine famous paintings (all of them from public domain) and learn interesting things about them.</p>\n<p><strong>Game Modes:</strong></p>\n<p>'Analysis &amp; Interpretation' game mode. In this mode, you will examine various elements from the painting and you will receive a description that will represent an analysis of each particular element from the painting. These descriptions could be related to the painter's style or to the story depicted in the painting, etc. In this game mode you can also simply enjoy the paintings while you explore/examine it.</p>\n<p>'Test Your Knowledge' as its name implies, will put your knowledge of famous paintings to the test. This game mode is very similar to hidden objects games, in that each painting has added (or missing) elements that you will have to spot. There is a score system included (clicking on a listed objects awards you points based on the time it took you to find it; clicking outside a listed object will deduct points from your score) but also a hint system.</p>\n<p>The 'Jigsaw Puzzle' game mode is just that. The painting is broken into 35 puzzle pieces. You will have to assemble the pieces in order to form the painting. I am thinking about adding a score system in the future, so feedback is appreciated.<br/></p>", "metacritic": null, "released": "2016-01-12", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/9a0/9a0714e2c049a540a1da0bdf14987083.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 111, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Mihai Puiu Cernea"], "genres": ["Educational", "Puzzle"], "publishers": [], "esrb_rating": null}