{"id": 139889, "slug": "dungeon-drifter-tkindanight-piegamesde", "name": "Dungeon Drifter (tkindanight, piegamesde)", "name_original": "Dungeon Drifter (tkindanight, piegamesde)", "description": "Introduction\r\n<p>For our second participation in LD we came up with the idea of a <strong>roguelike racing game</strong>,  <br/>with an art concept inspired by steampunk (\"gearpunk\" might describe this even better).<br/>It features:  <br/>- Only handmade textures / animations  / music / gameplay<br/>- A fully random dungeon generator  <br/>- Multiple enemies and objectives in each room  <br/>- Slippery wheels and high movement speed</p>\n<p>You steer a racing vehicle with slippy wheels in a narrow dungeon.  <br/>Go through the rooms, kill all the enemies and get to the flag without dying!</p>\r\nHOW TO PLAY:\r\n<p>You start out in a room and your objective is to get to the finish flag. Unfortunately the flag is somewhere in the maze and you don't know where. The flag is guarded by monsters. They will lock you in a room until you beat all of them or die (or collect all the coins). You always drive at full speed, and your brake is limited to 15 seconds for the whole game!</p>\n<p>Hitting the wall will kill you instantly.</p>\r\nCONTROLS:\r\n<p>- Use <strong>A</strong> and <strong>D</strong> or the <strong>arrow keys</strong> to move left or right<br/>- <strong>S</strong> to use the brake<br/>- <strong>W</strong> to go even faster (Post LD version)<br/>- <strong>Space </strong> or <strong>click</strong> to shoot<br/>- <strong>Escape</strong> or <strong>P</strong> to pause<br/>- <strong>R</strong> to quickly restart when you died (You’ll need it)</p>\n<p>Be conservative about your brake time! <br/>15 seconds is not much, and you might need a lot of it in coin rooms. Hitting the button for a very short amount of time will slow you down enough most of the time without eating up a lot of your brake time. Try to go around corners without it. Drifting will slow you down too, so use that instead if there is enough space.</p>\r\nCHANGELOG:<p>- Fixed bugs when entering and leaving rooms<br/>- Fixed flickering doors<br/>- Fixed wall textures has wrong rotation<br/>- Fixed coins spawning too close to walls<br/>- New door texture (PostLD)<br/>- Fixed car front wheels rotation (PostLD)<br/>- Accelerate with W (PostLD)<br/>- A lot of balancing: Mob sizes, count, health, speed, etc. The game should be a lot easier now. Increased braking to 20 seconds (PostLD)</p><p>- Randomized shooting mobs (PostLD)<br/>- Fixed car front wheels rotation (PostLD)<br/>- Accelerate with W (PostLD)</p>POST LUDUM DARE VERSION:<p>A Post LD version of the game is available in the downloads section.  It got a lot of balancing that we didn't have the time to include in the official release, so it is a lot easier.</p>\r\nMade by\r\n<p><strong>saibotk, piegames, Jidbo, AloTron, Himusoka, Triceraptodactyl, sommerlilie.  </strong></p>", "metacritic": null, "released": "2018-04-24", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/812/81213965e418792ca289bc993e7b418d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 18, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux", "Web"], "developers": ["tkindanight", "piegamesde"], "genres": ["Action"], "publishers": [], "esrb_rating": null}