{"id": 139855, "slug": "the-curse-of-the-weeping-woman", "name": "The Curse Of The Weeping Woman", "name_original": "The Curse Of The Weeping Woman", "description": "<p>My final project is a very short 2.5D Horror Platformer inspired by games such as Detention, Limbo, and Inside. The game takes place in an old surreal Spanish school. You’ll be able to run, jump, hide, read notes and pick up objects to solve puzzles. There will be a persistent malicious spirit that will hunt you as you go through the levels and learn why you were trapped in this surreal school or manage to escape. The platforming will use school objects such as desks, lockers to run and jump on with traps often triggering because the main character is trapped in a nightmare. </p>\n<p><strong>Story:</strong></p>\n<p>You're an ambiguous spirit stuck in a looping nightmare created by a malicious spirit. You are drawn towards a building by another spirit that wants to cause you harm. This spirit just wants to find her missing children who's bodies were lost in body of water. But it was her who lost control and caused her children to perish by her own hands. Her sanity lost, she continues to search for her children among any who she sees that could be  her own in the world. The weeping woman is most active in dark places near bodies of water.</p>\n<p><strong>Development Process: </strong></p>\n<p>I love the horror genre and decided to try and make a game inspired by an old Spanish folktale about a woman who drowned her own kids  because she was driven mad.  Making this game a 2.5D Platformer allowed for me to create  and capture the aesthetic  I was going for while keeping the scope of the project at a completed size.  Since I was a 1 man team I decided to make this game very short but tried to pack so many small features in a limited amount of space.  Most of my mechanics worked minus the hiding mechanic which doesn't work properly in the build.  I used a few assets packages to help me decorate my world. Concept art of the evil spirit was created beforehand by my friend Steve Carcamo. Unfortunately lack of time and additional team members  didn't allow for character models to be fully created and implemented into the final build. This project did teach me a lot and with it a new possible way of reiterating this project to be even better.</p>\n<p><strong>Known Bugs:</strong></p>\n<p>Spirit still can target the player even when hiding.</p>\n<p><strong>Future Updates:</strong></p>\n<p>As I was developing this project, I came across the idea of making this as a  full 3D first person horror puzzle platformer. Being able to explore the school and its rooms while also being pursued in first person would feel and play a lot better than this build of the project. So I'm going to try to convert this project into a first person game using this build as a base to start off on. </p>\n<p><strong>Credits:</strong><br/></p>\n\n<p><strong>Concept Art by Steve Carcamo </strong></p>\n\n<p>Unity Particle Pack 1.4 Asset Package</p>\n<p>Unity Post Processing Package</p>\n<p>Probuilder</p>\n<p>School House Model by MP House</p>\n<p>Locker Model by razor605</p>\n<p>School Chair model by 3v3r</p>\n<p><em><strong>models acquired from turbosquid website</strong></em></p>\n<p>Outline effect asset</p>\n<p>Medieval Desert City asset package</p>\n<p>Rainmaker Asset Package</p>\n<p>Simple Fade asset </p>\n<p> <br/></p>", "metacritic": null, "released": "2018-05-24", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/047/0473c5e0a01259767bdc45223dc05a2d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 86, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Georgie94"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}