{"id": 139809, "slug": "tomb-of-thesh", "name": "Tomb of Thesh", "name_original": "Tomb of Thesh", "description": "<p><em>\"Chap with a whip got as far as the big sharp spikes last week,\" said the low priest.</em></p><p>- Reaper Man, Terry Pratchett</p><p>You are a loyal servant of the late pharoah Thesh. The last couple of millenia you have been locked in his tomb, which has been rather uneventful to say the least. But now everything has changed, the outside world has found the tomb. And it wants to put all the precious treaure in a \"museum\", whatever that may be. You must stop these defilers, pillagers, bandits and \"archeologists\".</p><p>The tomb that the player has to defend has 16 rooms that the invading adventurers have to traverse one by one. The gameplay consists of two phases, first the player places traps in all of the empty rooms. The second phase is turn based, the adventurers will move deeper into the tomb each turn and the player has to stop them by activating traps.</p><p>Rules:</p><ul><li>If any adventurer reaches the end (room 16) the player loses</li><li>If all adventurers are dead the player wins</li><li>The player can only activate 1 trap per turn</li><li>When a trap is activated it becomes disabled, disabled traps become activatable again at the end of the turn but only if no adventurers are in the room</li><li>There are 4 adventurers: Acrobat (Green), Fighter (Red), Mage (Purple) and Scholar (Blue)</li><li>Each type of adventurer has a number of traps they can disable or are immune to</li><li>Traps that kill will be disabled as soon as the corresponding adventurer enters the room. For example the Curse trap will be dispelled as soon as the Mage encounters it.</li></ul><p>When the adventurers are together they can disable all traps that kill so the player has to first split up the group with the other traps. There are 2 rooms that are occupied from the start, one of them summons a new party of adventurers when it's reached, the other is a fountain that speeds up all the adventurers. The fountain is a bit finicky at the moment. The functioning of each room is described in-game, mouseover rooms to see it.</p><strong>Note: the traps that can kill all adventurers in the room are disabled by a scholar OR one of the other 3 types. Dart Trap, Guardian and Curse<p>Icons by the lovely http://game-icons.net/</p></strong>", "metacritic": null, "released": "2016-11-27", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/ef2/ef23d2dc12fa16774f8d24d8cffce867.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 28, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Erfeo"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}