{"id": 13994, "slug": "dino-run-dx", "name": "Dino Run DX", "name_original": "Dino Run DX", "description": "<strong>DINO RUN DX</strong> is an ongoing evolution of the classic prehistoric multiplayer racing game. Control your iconic raptor through an endless assortment of procedurally generated landscapes and outrun the ever-approaching WALL OF DOOM.  Will you end up one of the millions of doomsday casualties, or will you ESCAPE EXTINCTION?<br/><br/><strong>Featuring:</strong><br/>-A unique experience every time you play... no two levels are ever the same.<br/>-3 major single player gameplay modes:  CHALLENGE, PLANET D and SPEEDRUN (currently 24 speedruns with more coming soon).<br/>-Realtime multiplayer with chat, matchmaking and more unique levels to race in.  Climb the ranks and show your dominance!<br/>-Choose from a staggering number of hat and color combinations to hone your look... unlock even more hats by completing game milestones.<br/>-FREERUN MODE: turn off the doom, chat with other players during actual gameplay, spawn boulders and npc dinos, roleplay.... do what you want!<br/><br/><strong>How is DX different than previous versions of the game?</strong><br/>If you've only played the web version from years ago, you'll find DX is a dramatic improvement with more levels, hats and gameplay options.  If you've played Dino Run SE, the major differences right now are completely redone backgrounds and an extra layer of polish, true fullscreen mode, controller support, steamworks integration, improved multiplayer security, and a few more hats and colors to choose from.  We are also currently working on even more improvements to the game and will continue to roll out new features as long as there is interest and support. This is our pledge to you! More info on upcoming features can be found at http://www.pixeljam.com/dinorun.<br/><br/><strong>Fun Facts:</strong><br/>-The original web version has been played over 100 million times (source: Mochibot)<br/>-Pixeljam, the creators of Dino Run, have made over 20 games since 2006.<br/>-Dino Run helped pioneer the \"runner\" genre of games, before it was popularized on mobile and started to truly suck.<br/>-Dinosaurs did not actually wear hats, but there are tiny traces of them in the plastic tightening straps on all baseball caps.", "metacritic": null, "released": "2015-09-29", "tba": false, "updated": "2024-04-09T09:37:26", "background_image": "https://media.rawg.io/media/screenshots/8ae/8ae04040b033c4e16875b34f7d796ac4.jpg", "website": "http://www.pixeljam.com/dinorun", "rating": 3.16, "rating_top": 4, "added_by_status": {"yet": 12, "owned": 440, "beaten": 8, "toplay": 1, "dropped": 10, "playing": 2}, "playtime": 4, "achievements_count": 49, "ratings_count": 18, "suggestions_count": 168, "game_series_count": 0, "reviews_count": 19, "platforms": ["macOS", "PC", "iOS"], "developers": ["Pixeljam"], "genres": ["Action", "Racing", "Arcade", "Casual", "Indie"], "publishers": ["Pixeljam"], "esrb_rating": null}