{"id": 139949, "slug": "jaybot", "name": "JayBot", "name_original": "JayBot", "description": "<p>JayBot is a (relatively) hard top-down puzzle game that requires quick thinking and speedy reflexes. Your goal is to help JayBot escape the laboratory while collecting all colored screws. You'll need to find all 12 screws in order to gain access to the Boss room. There are some secrets hidden about as well.<br/><br/>Remember that the more you die in the game, the more likely you are to start stressing and making even more mistakes. Keep calm and you can do it! Try to beat the game and find all secrets!<br/><br/>The game will ask if you're 18+, this option will only affect the blood in the game. Choose \"Under 18\" if you're sensitive to blood. Or, you know, if you're under 18.<br/><br/><strong>NOTE</strong>: There is no save function in this game, returning to the main menu at any point will reset all your progress.<br/><br/></p><p><strong><br/>Controls:</strong><br/></p><p>Arrow keys / WASD - Move around<br/>Enter - Select/Confirm &amp; more<br/>Escape - Return to level select/main menu<br/>F4 - Toggle between Fullscreen &amp; Windowed</p><p><strong>Credits:</strong><br/><br/>This game was made by me, Hassan \"JayDrink\" Adilsohn, and is my very first attempt at programming. It took me exactly 2 weeks to complete this project and was made entirely in Gamemaker.<br/>I can be reached at: HassanAdilsohn@hotmail.com<br/><br/>All music was taken from vgmusic.com, check out the Credits screen at the end for specific song credits.<br/><br/>Special thanks to my brother, Ali \"DarksideX\" Mustafa, for introducing me to Gamemaker (and programming in general) and for giving me helpful hints whenever I'd get stuck.<br/><br/></p><p>Don't hesitate to leave me any feedback, be it positive or negative. I'm very happy with how the game turned out, but I would love to hear what other people have to say about it!<br/><br/>Thank you for playing my very first programming creation. Please let me know if you liked it, and have fun! :)</p>", "metacritic": null, "released": "2015-10-31", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/c87/c87a62db56229e46f4f14ba06f85c08c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 45, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["JayDrink"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}