{"id": 1399, "slug": "coaster-crazy", "name": "Coaster Crazy", "name_original": "Coaster Crazy", "description": "Coasters! Pandas! Zombies! Cheerleaders! Explosions! From the creators of RollerCoaster Tycoon® 3 and LostWinds® comes a rollercoaster game unlike any other, starring little old ladies, mad scientists, the undead, accountants, queasy guys, extra-terrestrial visitors, and …er… sheep.<br/><br/>Simply trace your finger over the touchscreen to build and tweak any coaster you can imagine, in glorious 3D. Its so easy to do that anyone can build them, ride them, crash them - tall, short, long and fast; modern, wooden &amp;amp; crazy. The physics simulation is easy and fun to use, yet rewards each bit of care put into improving your coasters with ever higher scores.<br/><br/>Coaster Crazy takes you on a journey around the world (and to the moon) to build a cash-making coaster empire with ever-more insane creations. Unlock more special pieces, coaster cars and track types that let you earn even more cash and gems, and meet the fiendish challenges posed by the Crazy characters in the game.<br/><br/>They are demanding customers:<br/>- Can you make your coaster fast enough to get the speed freak surfing with delight?<br/>- Can you keep G-forces low enough to  prevent the Professor’s Nitro Glycerin from exploding? <br/>- Can you beat a coaster score before the zombie starts infecting other passengers?<br/>- Can you do that all at the same time?<br/>- And what will happen to the little old lady if your ride is too intense?<br/>- And then there’s the Mayor.  Alien. King. Policeman. Queasy guy. Accountant. And sheep..<br/><br/>Thread your coasters through themed scenery and design custom paint-jobs to create the ride of a lifetime – and then upload to share with your friends and the world! See how your creations stack up on the Coaster Crazy global leaderboards, and earn achievements. When yours are downloaded by others, you’ll earn in-game currency.<br/><br/>Or you could just mess around to your heart’s content in the coaster-building ‘sandbox’.<br/><br/>And if Coaster Crazy’s oodles of gameplay isn’t enough for you, each day there’s a fresh challenge that you can take part in to earn worldwide kudos - and gems!<br/><br/>No sheep were harmed in the making of this game. But the queasy guy really wasn’t happy.<br/><br/>Coaster Crazy offers in-app purchase of gems and cash, which can be used to unlock content and accelerate gameplay.", "metacritic": null, "released": "2012-11-15", "tba": false, "updated": "2019-10-22T14:27:42", "background_image": "https://media.rawg.io/media/screenshots/f06/f06ed231d13954dd498e5b0ed610c8e3.jpeg", "website": "http://www.frontier.co.uk/coastercrazy", "rating": 0.0, "rating_top": 0, "added_by_status": {"beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 190, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Frontier Developments"], "genres": ["Simulation", "Puzzle"], "publishers": ["Frontier Developments"], "esrb_rating": "Everyone 10+"}