{"id": 14008, "slug": "zamb-biomutant-extermination", "name": "ZAMB! Biomutant Extermination", "name_original": "ZAMB! Biomutant Extermination", "description": "Play as two special operatives and fight your way through a mad scientist's secret asteroid base whilst defending yourself against his army of evil mutants. The amazing brawler Cye is trained in melee combat and uses powerful gadgets of mass destruction; or out-smart the enemy with the master tactician Chrome, an agent of ranged warfare and master of AI turret defence systems. <br/><br/>Develop the skills of your Agent, increase their power and overcome 24 uniquely challenging levels which get harder as you progress. Will you use a “punch now, ask questions later” approach? Or are you a tactical genius that tricks the enemy into bottle necks, melting them down with a devastating turret barrage?<br/><br/>Play solo, or draft in a loyal friend for epic Co-op action. Use everything at your disposal in order to eliminate the mutant army and put a stop to their evil before it spreads across the universe.<br/><strong>Final Game Features</strong> <strong>24 Scientific Labs to Dominate and 3 Environments to Conquer</strong> – Hack the power cells in 24 action packed levels and take over the mad scientist’s asteroid base.<br/><br/><strong>14 Powers and Turrets</strong> – Combining your strategic mind with a Brawling skill set you will have to use everything at your disposal to defeat the waves of mutants.<br/><br/><strong>Over 200 upgrades for each character</strong> – Increase your range, power up your damage, or upgrade your AoE radius to better dispose of the vile mutants.<br/><br/><strong>17 Unique Enemies</strong> – Defend against mutant Wasps, Scorpions with blasters, exploding Ticks and the titanic Crusher Bugs.<br/><br/><strong>3 Challenging Bosses</strong> – Face off against the most destructive scientific experiments created by the mad scientist<br/><br/><strong>Replayability</strong> – Unlock achievements and star related challenges through every level, adding extensive replayability and bragging rights!", "metacritic": null, "released": "2014-06-20", "tba": false, "updated": "2019-08-28T22:12:23", "background_image": "https://media.rawg.io/media/screenshots/ab7/ab7ef05523493ee8acc85769316e0275.jpg", "website": "http://www.nano-games.com/games/zamb-biomutant-extermination/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 28, "dropped": 2}, "playtime": 1, "achievements_count": 46, "ratings_count": 3, "suggestions_count": 467, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC"], "developers": ["Nano Games"], "genres": ["Action", "Strategy", "Indie"], "publishers": ["Kalypso Media", "Kasedo Games"], "esrb_rating": null}