{"id": 1401, "slug": "bears-cant-drift", "name": "Bears Can't Drift!?", "name_original": "Bears Can't Drift!?", "description": "<strong>Bears Can't Drift!?</strong> is an action packed Kart Racer set in a beautifully stylised world. Race across a variety of tracks and game modes with up to four player split-screen. Time to find out if Bears really can Drift!Game modesTime Trial<br/>Put your skills to the test in a drive only, infinite time trial. Use the action button to quick restart if things go wrong and try to beat the top times and friends with four player splitscreen.<br/><br/>Single Race<br/>Race against up to 8 AI opponents and 3 friends (with 4 player splitscreen) over three laps in this hectic battle for first place. Use the pickups found throughout the track to give you the edge.<br/><br/>Picnic<br/>This twist on the battle arena will have you and your friends dashing back and forth between picnic baskets in a fun filled fight for food. Use the pickups to hit other players and steal their food but be careful not to get hit yourself!Pickups<strong>Its time to get tactical</strong>, there are four different weapons to choose from. The Salmon (Forward attack), Bee (Rear attack), Hedgehog (Shield) or Bird (Boost). But it doesn't stop there, either use your pickup or combine it to make an even more powerful attack!. In total their are 8 different weapons to choose from.Hub worldThe hub world is where it all starts. From here you can add players, change bear, difficulty, track and game mode, but only the <strong>flag \"bear\"er</strong> gets to choose what you play.ControlsGamepad<br/>R1/R2 - Accelerate<br/>L1/L2 - Reverse/Break<br/>B - Drift <br/>A - Action Button (use pickup)<br/>Y - Look back<br/>Left Analogue stick/ Dpad - Turn<br/>Right Analogue stick - Look around<br/>Start - Pause", "metacritic": null, "released": "2016-08-08", "tba": false, "updated": "2019-08-28T22:15:56", "background_image": "https://media.rawg.io/media/screenshots/bee/bee49e8105da83a7581629c9f57557ac.jpg", "website": "http://www.strangelynamed.com/#bcd-01", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 10, "beaten": 1, "dropped": 1}, "playtime": 1, "achievements_count": 28, "ratings_count": 3, "suggestions_count": 447, "game_series_count": 0, "reviews_count": 3, "platforms": ["PlayStation 4", "PC"], "developers": ["STRANGELY NAMED", "Arran Langmead"], "genres": ["Racing", "Indie"], "publishers": ["Strangely Named Studio"], "esrb_rating": "Everyone 10+"}