{"id": 14027, "slug": "airline-tycoon-2", "name": "Airline Tycoon 2", "name_original": "Airline Tycoon 2", "description": "A decade after the best-selling Airline Tycoon comes the long awaited sequel to the legendary tongue-in-cheek economic simulation that puts players in the role of CEO of an international airline! Airline Tycoon 2 will challenge players to run a modern airline, design unique airplanes and grow a run-down carrier into a globally recognized company that passengers practically beg to fly. Airports worldwide are waiting to be explored, but beware– your rivals never rest! Crafty opponents are also working to dominate the skies… and they won’t let anything stand in the way of their goals!<br/><br/>\t\t\t\t\t\tKey Features: \t\t\t\t\t\t<ul><li>Explore real world airports, from Moscow to New York, with realistic travel conditions and passenger volumes<br/> </li><li>Build your ideal fleet of planes – use the in-game editor to craft inexpensive mass-transportation „Greyhounds in the sky“ or unique, luxury jets that spoil the elite <br/> </li><li>Jump into the action as one of four playable avatars with unique strengths<br/> </li><li>Explore your home airport in full 3D, while bossing your employees around and expanding your blossoming airline; you might even meet VIPs at the airport lounge<br/> </li><li>Test your management mettle in a challenging business environment as you schedule flight plans, coordinate arrivals and departures and balance income and expenses – all to grow profit and enhance your airline’s global reputation<br/> </li><li>Random events bring variety to the game -- The Pope wants a special flight? Civil war in Russia? Volcanic ash clouds above Europe? If you act quickly, you can profit from these events!<br/> </li><li>Sabotage – annoy and slow down your opponents with devious actions. But beware; your adversaries may just pay you back in kind!<br/> </li></ul>", "metacritic": 57, "released": "2011-10-04", "tba": false, "updated": "2023-01-24T05:41:45", "background_image": "https://media.rawg.io/media/screenshots/c93/c935f425ec67458c23569ce99af31a3a.jpg", "website": "http://www.airline-tycoon2.com/us/index.php", "rating": 1.4, "rating_top": 1, "added_by_status": {"yet": 7, "owned": 264, "beaten": 1, "toplay": 2, "dropped": 5}, "playtime": 1, "achievements_count": 0, "ratings_count": 10, "suggestions_count": 476, "game_series_count": 0, "reviews_count": 10, "platforms": ["PC"], "developers": ["b-Alive"], "genres": ["Strategy", "Simulation"], "publishers": ["Kalypso Media"], "esrb_rating": null}