{"id": 140316, "slug": "makin-bacon-pancakes", "name": "Makin' Bacon Pancakes", "name_original": "Makin' Bacon Pancakes", "description": "<p>Time management game where Jack, the pug, has to take the ingridients and make as much Bacon Pancakes as he can, Finn, the human, is eating them because he is so hungry! Made for the #BaconGameJam.</p><p>To make a bacon pancake you must first mix the ingredients in the bowl:</p><ul><li>1 Egg.</li><li>1 Flour.</li><li>1 Milk.</li></ul><p>Then, put the bacon in the frying pan, wait for it to be ready to put the pancake mix</p><ol><li>BMO will show his screen green when the bacon is ready.</li><li>There will be a bar in the bottom of the frying pan, if it gets to red, the bacon is burned, you must put another bacon in the pan.</li><li>Click the mixing bowl when it has the pancake mix and the bacon is ready.</li><li>The timer will start again, this time cooking the pancacke alongside with the bacon.</li><li>Click the pan when it's ready (green bar and BMO show his screen green)</li><li>Feed Finn!</li></ol><p>Each bacon pancake worth 100 points and +10 seconds</p><p>Each consecutive successful bacon pancake worth 100*consecutive pancakes.</p><p>You can dispose non useful or not needed items to BMO, he will consume them for 5points and +1 second.</p><p>Try to make as much points as you can! this is a never ending game if you do it right, with time, items will appear each time faster, making it harder to catch them.</p><p>Enjoy my game!!</p><p><strong>(All characters have all rights reserved to Cartoon Network. The sole purpose of the use of the characters and this game is educational only).</strong></p><p>Check out my other games!</p>", "metacritic": null, "released": "2014-03-23", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/4a4/4a4483f2cb5a41c659b8bcb886246990.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 12, "game_series_count": 0, "reviews_count": 0, "platforms": [], "developers": ["nOsmircK"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}