{"id": 140375, "slug": "grav-2", "name": "Grav!", "name_original": "Grav!", "description": "<p><strong>Hey peeps!</strong></p><p>Here is a prototype of a short, week long prototype project that me and @Timothy worked on. (Taking a short break from a larger scale project Linked, more info soon).</p><p>The story:<br/>In the not so distant future, you are a individual with the power to control gravity. This, of coarse, makes you very dangerous, and also a little grumpy! On this particular day, you were being transported to a maximum security facility on a distant planet when your prison transport is destroyed in a asteroid field! Stuck in the middle of the asteroid field, you have to use your powers to survive, dodging asteroids and keeping your oxygen and health levels up!</p><p>The controls:<br/>Left-click moves the center of gravity to which all objects move, allowing you to move asteroids around in order to not be squashed by them.<br/>Right-clicking on any object pulls it towards yourself.</p><p>Credits:<br/>I did the programming. The awesome pixel art was made by @Timothy!</p><p>Please enjoy and hit us with some feedback!<br/></p><p>Some technical stuff:<br/>Grav was built in the HaxeFlixel cross-platform game engine, which uses the Haxe language. From working with HaxeFlixel on this project I would definitely say that it is quite an epic engine, and it is extremely well documented. Has anyone else used it? I would like to hear some opinions!</p><p>Disclaimer: It is still a bit lean on the sound side, hopefully we can fix that soon!</p><p>Kind regards!<br/>stofStorm</p>", "metacritic": null, "released": "2017-02-07", "tba": false, "updated": "2019-08-28T23:22:38", "background_image": "https://media.rawg.io/media/screenshots/ee1/ee1f898382a76ca4e514b550be151957.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 9, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["stofStorm"], "genres": [], "publishers": [], "esrb_rating": null}