{"id": 14065, "slug": "hegemony-rome-the-rise-of-caesar", "name": "Hegemony Rome: The Rise of Caesar", "name_original": "Hegemony Rome: The Rise of Caesar", "description": "Hegemony Rome: The Rise of Caesar takes you to the plains and forests of ancient Gaul where Julius Caesar wages a decade long war to subjugate the barbarian hordes. <br/><br/>Hegemony Rome will immerse you in the history like no other real time strategy game ever before, forcing you to pay close attention to the changing seasons and rapidly changing military situation. Unfolding across an epic satellite-accurate map stretching from the Mediterranean coast to the British Isles, the game utilizes the Hegemony series' trademark zoom to seamlessly take you from a grand strategic view of your empire right down to the battlefield at any time.<br/><br/>Hegemony Rome: The Rise of Caesar brings the past to life as you manage your armies and manipulate your enemies in a beautifully drawn simulation of 1st century BC warfare. Bring all of Gaul under the rule of the Senate and People of Rome. Or, unite the Gallic tribes in the expanded sandbox mode and end the threat of Roman rule forever.<br/><br/><br/><ul> <strong>Direct from the hand of Caesar</strong> – Four campaigns follow the conquests of Julius Caesar as he wrote them in Commentarii de Bello Gallico. Bridge the Rhine, invade Britannia and conquer the Gauls in over 100 objectives or choose from over 20 factions in the epic sandbox mode.</ul><ul> <strong>All new map</strong> – Explore over one million square kilometers that are seamlessly zoomable, from the Mediterranean coast to the shores of Britannia.</ul><ul> <strong>Improved graphics engine</strong> – Hegemony Rome supports 10x the terrain detail over previous installments and features a diverse and immersive landscape to explore.</ul><ul> <strong>Build an empire</strong> – The construction system allows players to build forts, walls, and bridges at thousands of sites across the map to cement Roman control over the barbarian kingdoms.</ul><ul> <strong>Promote your legions</strong> – Players can train officers to augment their unit’s skills as well as appoint governors and construct buildings to expand and improve their cities.</ul><ul> <strong>Starve your enemies</strong> – Supply camps and logistics system makes sieges and supply lines more intuitive and more important than ever.</ul>", "metacritic": null, "released": "2014-05-15", "tba": false, "updated": "2019-09-17T10:36:07", "background_image": "https://media.rawg.io/media/screenshots/6d0/6d067616272b2c83597c59845a77d3c4.jpg", "website": "http://www.kasedogames.com/us/products2.html", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 4, "owned": 149, "beaten": 1, "toplay": 4, "dropped": 1}, "playtime": 3, "achievements_count": 53, "ratings_count": 4, "suggestions_count": 440, "game_series_count": 0, "reviews_count": 4, "platforms": ["PC"], "developers": ["Longbow Games"], "genres": ["RPG", "Strategy", "Simulation", "Indie"], "publishers": ["Kalypso Media", "Kasedo Games"], "esrb_rating": null}