{"id": 14063, "slug": "supreme-pizza-empire", "name": "Supreme: Pizza Empire", "name_original": "Supreme: Pizza Empire", "description": "Welcome to Supreme, your guide into the euphoric world of pizza! Who doesn't love pizza? You? No need to lie. Supreme takes you to a world in which you own and operate your own delivery business. You decide how it all plays out and the game changes at every turn!<br/><br/>In Supreme, you will take your pizza shop from cesspool to empire. You'll start out as an individual, making and delivering the pizzas all on your own. You'll manage things like inventory, eventually earning enough capital to upgrade your shop and start hiring employees! However, it’s not all fun and full of pepperoni. The world is cruel, and will throw problems your way at every turn. Mobsters will demand protection money, corrupt government officials will turn to you for help, the competition may even rob you blind..  The world will either bend to your will or take your corporation down... how you handle them is entirely up to you. The choices you make will alter the very dough of reality.<br/><br/>You can stay in one measly shop, sure. But where's the fun in that? You could expand in your region to dominate sales and front your company as the best around. Expand your business to be worldwide and crush all the competition. Buy them out and put their employees to work for YOU. Supreme will help you acheese the greatest Pizza Empire never before seen on this planet! (It's been seen on the moon though.. you know.. since it's made of cheese..)<br/><br/>The best part is? It all belongs to you! The big cheese, the top pepperoni, the head chef, the SUPREME Overlord of the world! Whatever title you may want to go by, it is all in your hands. (And our stomachs.)<br/><br/><br/>Things you might face on your journey include but are not limited to:<br/><br/><ul><li>Corrupt governments<br/></li><li>Angry employees<br/></li><li>Theft<br/></li><li>Mobsters<br/></li><li>Car flipping goodness<br/></li><li>Bankruptcy<br/></li><li>And much much more..</li></ul><br/>We are always expanding on the events in the game and the way in which they effect your corporation and your world domination plans, so you can never quite tell what will head your way next!", "metacritic": null, "released": "2015-01-09", "tba": false, "updated": "2019-08-28T22:12:21", "background_image": "https://media.rawg.io/media/screenshots/0d7/0d75d6525fc72c37068ad4a32ac22146.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 16, "toplay": 1}, "playtime": 6, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 180, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC", "macOS"], "developers": ["Nexeon Studios"], "genres": ["Simulation", "Casual", "Indie"], "publishers": ["Nexeon Studios"], "esrb_rating": null}