{"id": 140656, "slug": "probe", "name": "P.R.O.B.E", "name_original": "P.R.O.B.E", "description": "<p>\"Commander, I have an important task for you!</p><p>The science team has put together a new pioneer P.R.O.B.E prototype to serve us in our struggle against the aliens. When ready, it will be capable of infiltrating the aliens' nests even through the smallest tunnels, and reach places where no man or other craft can go!</p><p>But, before we can move forward with the build, we need the basic flight capabilities thoroughly tested! We entrust you with this job. Safe flight, good luck!\"</p><p>P.R.O.B.E is a fast-paced, unforgiving \"tunnel-runner\", loosely set in our Ultimate Space Commando universe. You are tasked with the field testing of a recently prototyped reconnaissance unit, the Pioneering Remote Orb, with which you enter the tunnels of an alien-infested mining facility, both to evaluate the P.R.O.B.E's capabilities and your own skills...</p><p>It is a \"classic\", deliberately minimalist arcade game, where your only goal (at least currently) is to earn the most score and reach the furthest level. On your run you will encounter obstacles, dangers and also useful stuff--everything has its role or purpose. Energy balls grant some energy for your shields, but give a speed boost that may be lethal if you're not careful. You may attempt to crack special crates for a bonus, but doing so you may die if your skills fail. You need to carefully manage your health and energy to reach far.</p><p>You can also collect crystals to upgrade your P.R.O.B.E between levels or to retry a level--spend them wisely!</p><p>The game will be free-to-play and is complete in its current state, but we also have a lot of ideas (new obstacles, level types, bosses, etc.) to add in the future. Steam Achievements and Leaderboards (along with Trading Cards) will be an integral part of the game if it gets released on Steam, and it will be available on PC (including UX capability), Linux and Mac. It will be also integrated with the USC Server for some cross-game action--details later ;-). Please vote for us if you like retro arcade action fun!</p><p>This is a massively overhauled PC-exclusive version of the game, with advanced effects, a new difficulty level, revised difficulty balance, an optional \"retro-display mode\", and online Global Rankings at Probe.angrycatstudios.com.</p><p>KEY FEATURES</p><p>— Easy-to-learn, but hard-to-master tight controls</p><p>— Randomized levels</p><p>— Energy shield system to protect yourself and get past obstacles in one piece</p><p>— Statistics after each stage</p><p>— Model USC RD-2X Golden Duckies</p><p>Updated version</p><p>-- lots of new features and improvements, such as:</p><p>-- Greatly optimized performance, general bug fixes</p><p>-- New and revised obstacle types (falling worms, crates, etc.)</p><p>-- Rebalanced and graphically varied levels</p><p>-- Collect Crystals to upgrade your P.R.O.B.E between levels or retry one</p><p>Do not forget to vote on Steam Greenlight! Thank you in advance! ;)<br/></p><p>Have fun! :P</p>", "metacritic": null, "released": "2017-02-25", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/d3e/d3eebe0673a71a5c62a204768f6f0549.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 198, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Angry Cat Studios"], "genres": [], "publishers": [], "esrb_rating": null}