{"id": 140664, "slug": "escape-from-paradise-itch", "name": "Escape from Paradise (itch)", "name_original": "Escape from Paradise (itch)", "description": "<p><strong>Hint:</strong> You need to click on the game screen before it will recognize your keystrokes.<br/></p><p>You are a castaway, lost and alone on a deserted island. Though this island is a nearly perfect paradise, you need to escape the island in time to file your taxes! Paddle your raft off the island and attempt to escape through the dangerous waves! Watch out for deadly rocks while, maybe, trying to save your best friend, Nelson! Friends, after all, are helpful for passing the time.</p><p>Use the \"Left\" and \"Right\" Arrow keys to paddle your raft past or through the oncoming waves. Press the \"R\" key to restart the game.<br/></p><p>This game was done with what we called an \"alt team.\" That is, each person took a role they aren't very confident in. We think the results turned out pretty good, and we all learned a lot!</p><p>http://globalgamejam.org/2017/games/escape-paradis...<br/></p>Credits <p><strong>Programming</strong> - Bryan Tenorio<br/><strong>Art &amp; Animation</strong> - John Harger<br/><strong>Music &amp; Sound, Game Concept</strong> - Ben Hanken<br/><strong>Game Design, Programming Mentor</strong> - Matt Jernigan<br/><strong>Producer</strong> - Shandiin Woodward</p>Versions<p>This is a GameMaker game so I can build it for many other systems, should anyone want me to.  I just can't test those systems myself at the moment.</p><p>The latest version has been wrapped and  polished a bit from the game jam release.  It's not a full game yet -- it needs more levels and/or puzzle solving for that -- but it might qualify as a minigame now.<br/></p>", "metacritic": null, "released": "2017-01-24", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/60e/60e6a01e036030d09aa2f5db9f1b7ebe.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 38, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["mj.Jernigan"], "genres": ["Action"], "publishers": [], "esrb_rating": null}