{"id": 14067, "slug": "pole-position-2012", "name": "Pole Position 2012", "name_original": "Pole Position 2012", "description": "Pole Position 2012 will put your manager skills to the test by putting you in charge of your Formula 1 racing team. It’s your responsibility not only to buy spare parts, but also to design the car and to recruit the members of your team. And then, you have to decide which training sessions are the most appropriate for your pilots. <br/><br/>Pole Position 2012 offers you more features than ever in a Formula 1 racing team management simulation. The whole technology tree was revised from the ground up and you have to pick your own research from over 100 new technology projects. The team management system is easier to use and is even more interesting.Key Features:<ul><li>Take control of an existing racing team or create your very own team.\u2028<br/></li><li>Create your very own driver<br/></li><li>Research more than 100 new car improvements<br/></li><li>The new team management system is easier and more fun to use. <br/></li><li>Build different structures such as a wind tunnel or a fitness center<br/></li><li>Make your dreams come true and live a life of luxury: get a villa or even a private jet plane <br/></li><li>Decide on the individual training sessions of your pilots to help them improve their skills<br/></li><li>Rebuild your cars from scratch to improve their performance on each specific racetrack</li></ul>", "metacritic": null, "released": "2012-04-20", "tba": false, "updated": "2022-09-26T22:00:35", "background_image": "https://media.rawg.io/media/screenshots/8d4/8d4ea3ff8c13f4f48681c4c28ad4680f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 71, "dropped": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 194, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "macOS", "iOS"], "developers": ["Kalypso Media", "Destrax Games"], "genres": ["Action", "Strategy", "Simulation", "Sports", "Racing"], "publishers": ["Kalypso Media", "Assemble Entertainment"], "esrb_rating": null}