{"id": 14061, "slug": "vox-l", "name": "Vox-L", "name_original": "Vox-L", "description": "Vox-L is not a game.  It's a customizable virtual reality playground.<br/><br/>By default, Vox-L is just an infinite white terrain.  There's nothing there.  You can't do anything fun.  Sounds boring, I know...<br/><br/>But here are some reasons we think you'll enjoy it.<br/><br/><br/>Reason 1: <br/><br/>It has free multiplayer.  You can invite your friends.  (If you have troubles starting a multiplayer game, we have a forum topic where we are discussing the multiplayer feature.  See the Basic Info section for a link to our forum.)<br/><br/><br/>Reason 2: <br/><br/>It is customizable.  With free in-game apps, you can transform your playground into whatever you want.  Apps let you change the terrain, spawn toys, load dynamic content, launch mini-games, etc.<br/><br/><br/>Reason 3: <br/><br/>We've already added several apps for you to customize your experience.<br/><br/><ul><li> Builder app: Gives you tools to deform the voxel terrain by placing/removing blocks (like in Minecraft).  Lets you spawn physical objects in the world.<br/></li><li> Multiplayer app: Host a server and invite your friends.  Or find and join a server. (NOTE: This feature is still in development.  If it doesn't work for you, please post on our support forum.)<br/></li><li> Worlds app: Choose from various pre-built worlds.  We currently have 3 voxel worlds.  We'll be adding over 100 more in early 2017.<br/></li><li> Flashlight app: Turn your tablet into a flashlight.  Control the color and brightness.  It's surprisingly fun.<br/></li><li> Sky app: Change the time of day, add fog, add clouds.  </li></ul><br/><br/>Reason 4: <br/><br/>We are adding new apps constantly.  In fact, if you want to, you can make your own.  (NOTE: If you want to develop apps for Vox-L, contact us to be part of our developer Beta.  Anyone who knows JavaScript, HTML, and CSS can do it.)", "metacritic": null, "released": "2016-12-12", "tba": false, "updated": "2019-07-25T12:01:14", "background_image": "https://media.rawg.io/media/screenshots/fcd/fcd3936a5792df80af79b83d77ff0ed3.jpg", "website": "http://vox-l.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 63, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Multi-Dimensional Games"], "genres": ["Casual"], "publishers": ["Multi-Dimensional Games"], "esrb_rating": null}