{"id": 14060, "slug": "blessed-ones-the-magic-wolves", "name": "Blessed Ones: The Magic Wolves", "name_original": "Blessed Ones: The Magic Wolves", "description": "<strong>Blessed Ones: The Magic Wolves</strong> is a silly little fairy tale about wolves (magic ones, obviously) and pigs and adventurers, coming in the form of a Japanese-style RPG focused on strategic turn-based combat and party building. It is goofy, flexible, emergent, and open, in more ways than you might expect! Build your party as you explore rural Sleeping Owl Island, finding treasures, making new friends, saving the day--or just ignoring all the problems and gunning straight for the final boss!<br/><br/>The story centers on a group of new adventurers, hired by the cutthroat businesspig Higgeldy Piggeldy to rid his property of a tribe of evil Magic Wolves, who banded together from several packs to elect their leader Mayor, and thus the ruler of rural Sleeping Owl Island, putting them in complete control! Everywhere they go there is trouble to be found, usually in the form of a carefully constructed boss encounter to provide an experience unique from every other in the game. The story is broken up into a series of interlocking vignettes, finishing one of which has ramifications for other ones, meaning every route causes the experience to change in unexpected ways. Sleeping Owl Island is loaded with more minor troubles, as well--you can help Mirra become the greatest witch of all by finding a mentor, you can show little Kendra the world's a lot bigger than her tiny town, you can help Emma Wolf learn to change her ways (or not) even late in life, heck, you can even help Higgeldy become a megalomaniacal land baron of the entire island, if your heart's really in the wrong place.<br/><br/>The game's built in a custom engine, allowing for a huge number of possible skills with both really subtle, nuanced differences, and huge gigantic differences. There's over 140 skills in the game, each with two different possible versions to learn, and each character gets to learn about 27 of them. There are also six unique classes instead of boring stuff like Knight and Thief. Why be a Knight when you can be a grave digging Peacebringer, who can drop half their HP to damage everyone, which increases if using the move kills you? Why be a Thief when you can be an Artificer, and cast your spells from items, saving MP, but also allowing you to fill up your inventory with special items that have unique effects? Why be anything the heck else when you can worship the dead and roll with a bunch of ghosts as a Venerant? Or cook delicious pastries as a Chef? There's no reason.<br/><br/>Also, you can play a pig named Bernard, or Samuel, or any other weird thing that comes into your head. And one of your characters is a princess! Or she can be. I mean, you don't have to pick either of them.", "metacritic": null, "released": "2015-12-04", "tba": false, "updated": "2019-08-28T22:12:21", "background_image": "https://media.rawg.io/media/screenshots/dcf/dcf5e082b99be1d2a1ca9fe89ff3ddaf.jpg", "website": "http://wolfraystudios.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 269, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Wolf Ray Studios"], "genres": ["RPG", "Indie"], "publishers": ["Wolf Ray Studios"], "esrb_rating": null}