{"id": 140709, "slug": "mowermadness", "name": "MOWERMADNESS", "name_original": "MOWERMADNESS", "description": "<p>Enter this action packed humor filled game as a lawnmower wanting revenge. You feel that people that you for granted, everyone has a lawnmower. You've been tossed, taken apart and even put on Ebay. THIS IS THE END. If you break all the other lawnmowers, <strong>for sure</strong> everyone will have to choice but to use you and keep you in good shape. Say goodbye to your lawnmower friends 'cause they just became your enemies....<br/></p><p>This game has been made by <em>Unity3d</em> and was coded using aspects of <em>UFPS</em> and Photon multiplayer cloud. All models and textures are originally made. Thank you to the game testers who helped make this game a \"game\". Also a big thanks to Julien, our model creator. For instructions on how to play the game, read the .txt file in the game folder. This is a freetoplay <strong>BETA</strong> of this game. This version of game is only meant to help create a full paid-for version. All beta players will have a chance to get the full game for free. <strong>Any</strong> ideas, input or feedback is greatly appreciated. Please if you have any ideas for new weapons, maps, lawnmowers or even story line, email us at hj398646@gnspes.ca. This game was created by four people in class 802 at Rocky Lake Junior High in Nova Scotia, Canada as a school project. Therefore take it easy on us, this game isn't perfect :).</p>", "metacritic": null, "released": "2016-05-30", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/904/9049d1ec2d066ea6703fc64c83689dd0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 16, "game_series_count": 0, "reviews_count": 0, "platforms": [], "developers": ["PlayGame"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}