{"id": 14079, "slug": "haimrik", "name": "Haimrik", "name_original": "Haimrik", "description": "This <strong>unique action adventure game</strong> lets you become Haimrik, a young scribe trying to make a living in a medieval town full of warriors, sorcerers, dragons and dragon-riding sorcerer-warriors. But one book changes his whole life. With the help of Masamba, a hungry lioness who will protect him while constantly trying to eat him, he’ll venture out to take on the evil king and his elite generals, the Word Warriors.<br/><br/><br/><br/>Fortunately, Haimrik commands the Power of the Words! These are the stones in the path Haimrik walks, and he brings them to life as he steps on each one, willingly or not. Haimrik will need to activate the right words to defeat the various enemies that challenge him across numerous Word Worlds, with new puzzles appearing constantly throughout the game. <br/><br/>In an added touch, Haimrik will undoubtedly die many horrific deaths, leaving pools of red blood contrasting with the otherwise plain monochromatic sepia world. Be part of a medieval revolution against the Word King and his elite warriors, and change the way you see words and stories forever.Features<br/><ul><li>Unique action adventure built upon interactive words.<br/></li><li>Medieval comedy full of dark humor and over-the-top cartoon violence.<br/></li><li>Rare sepia view of a medieval fantasy world.<br/></li><li>Eccentric characters like the lioness Masamba who will protect Haimrik from harm... when she’s not trying to eat him.</li></ul><br/><br/>", "metacritic": null, "released": "2017-05-11", "tba": false, "updated": "2023-02-28T03:42:01", "background_image": "https://media.rawg.io/media/screenshots/a7e/a7e9e65f461bf49ab0c1aa29896b1756.jpg", "website": "", "rating": 2.93, "rating_top": 4, "added_by_status": {"yet": 17, "owned": 324, "beaten": 4, "toplay": 5, "dropped": 6, "playing": 1}, "playtime": 1, "achievements_count": 74, "ratings_count": 14, "suggestions_count": 346, "game_series_count": 0, "reviews_count": 15, "platforms": ["PC", "PlayStation 4", "Xbox One"], "developers": ["1C Publishing EU", "Below the Game"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["1C Company"], "esrb_rating": null}