{"id": 140749, "slug": "rock-your-workout", "name": "Rock Your Workout", "name_original": "Rock Your Workout", "description": "<p>Welcome to Rock Your Workout.</p><p>This is a game built for all of us who love to workout to music and play rhythm games.  Listen to some of the best rock songs out there and follow along to the workout routine.</p><p>Most songs in this game are copyright protected and cannot be included in the game itself with the exception of the two tracks by Andy Rey. The rest of the songs must be purchased to be used with the game.</p><p>This is my first build of Rock Your Workout for distribution to others so any feedback you may have is greatly appreciated. I want to make this workout game as much fun as possible so please send any suggestions.</p><p>Right now I am concentrating on filling out the song library but will begin developing different aspects of the game again to make it look better.</p><p>The download is free but if you want to help me purchase better animations, fonts, a new instructor please feel free to donate to the cause! I will add rewards such as sponsoring a song and any users that donate will get a spot on the credits.</p><p><strong>The current list of songs is:</strong></p><p>Finger Eleven - Paralyzer</p><p>Halestorm - I am the Fire</p><p>Foo Fighters - The Pretender</p><p>Jasmine Cain - Coming in Hot</p><p>Metallica - Enter Sandman</p><p>Rob Zombie - Scum of the Earth</p><p>Staind - Now</p><p>Survivor - I Can't Hold Back</p><p><strong>Coming Soon:</strong></p><p>Halestorm - Mayhem</p><p><strong>A couple of notes on the early release:</strong></p><p>When starting up click the Get Music button first. This will search your My Music directory in Windows. For now I don't have a file selection screen but this is one of my higher priorities.</p><p>You will need to match the workout routines I've created to the music in your library. Click the workout routine in the left window and match it to your music file in the right.</p><p>Once you're done you're ready to go! Click 'Start Your Workout' and select the songs you want to workout to.</p><p>Press the Escape key to bring up the pause menu which will allow you to Skip to the next song, Return to the Main Menu or continue the workout.</p>", "metacritic": null, "released": "2017-02-24", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/19c/19cd480e52de33f51ca39bc21fea8156.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 61, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["RockYourWO"], "genres": ["Action"], "publishers": [], "esrb_rating": null}