{"id": 140870, "slug": "grief-itch-tmahon", "name": "Grief (itch) (tmahon)", "name_original": "Grief (itch) (tmahon)", "description": "<p>The purpose of Grief is to help players that are dealing with grief know that they are not alone, to see their feelings in a tangible way through game mechanics that help them be understood, and to see how they can all be tools to navigate the occlusive and confusing path they are on in their real lives. Grief is a single player 2D platformer mechanically designed to personify the 5 stages of grief. The player is dropped in an occlusive and confusing world where they must use their powers of color to illuminate the puzzle and trap-ridden path of Grief. There are 5 levels, each with their own painting mechanic symbolic to its stage of grief and subsequent puzzles that utilize those mechanics. To succeed in each level, the player must harness the full power of understanding each paint; it’s uses, and its detriments.\r\n  </p>\n<ul><li>“Denial” – Green paint that simply illuminates the path.\r\n  </li><li>“Anger” – Red paint that kills enemies and hurts the player\r\n  </li><li>“Bargaining” – Blue paint that causes the player to bounce trading force for height. However, like in bargaining, the traded force diminishes in time.\r\n  </li><li>“Depression” – Black paint that eliminates the floor causing the player to fall deeper into the void of depression.\r\n  </li><li>“Acceptance” – White paint that allows the player to paint areas in the non-occlusive final level.\r\n</li></ul>", "metacritic": null, "released": "2017-05-03", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/c03/c03ad83f2b82f46003438df432c6f3e0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 18, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["tmahon"], "genres": ["Educational", "Platformer"], "publishers": [], "esrb_rating": null}