{"id": 140948, "slug": "city-invaders", "name": "City Invaders", "name_original": "City Invaders", "description": "<p><strong>!! Beware, this is an alpha version of the game !!</strong></p>\n<p>Take the lead of a group  of survivors during the zombie apocalypse, and fight to conquer real venues next to you. But be careful, other players and zombies could try to take your beloved places away from you !</p>\n<ul><li>Tactical gameplay: recruit, train and equip your characters</li><li>10 character classes with specifics skills and weapons</li><li>Battle other players or the AI in ferocious tactical battles </li><li>Geolocalized: capture places next to you, or use perks to conquer places hundreds of kilometers away !</li><li>MMO: create alliances and fight other alliances next to you</li></ul>\n\n<p><strong>!! Attention, ceci est une version Alpha !!<br/></strong><br/>Prends le contrôle d'une équipe de survivants pendant l'apocalypse zombie, et pars à la conquête de lieux réels proches de toi. Mais prends garde aux autres joueurs, qui pourraient bien tenter de te voler tes lieux !<br/><br/></p>\n<ul><li>Jeu de rôle tactique: recrute, entraine et équipe tes personnages parmis 10 classes différentes</li><li>Tactique à 100%: tour après tour, utilise les compétences de tes personnages le mieux possible pour triompher lors de combats endiablés</li><li>Géolocalisé: capture les lieux proches de toi, ou utilise des bonus pour attaquer à des centaines de kilomètres de toi !</li><li>Massivement multijoueurs: forme une alliance et combat les autres alliances autour de toi</li></ul>", "metacritic": null, "released": "2018-08-16", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/73d/73d349d2304b1d17a9e5eb2491354484.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 113, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Lone Stone Studio"], "genres": ["RPG", "Strategy"], "publishers": [], "esrb_rating": null}