{"id": 140938, "slug": "pathtothecity", "name": "PathToTheCity", "name_original": "PathToTheCity", "description": "Path To The City\r\n<p>   This 3D virtual environment was built from my imagination rather than an experience in real life. In creating this environment, I focused more on aesthetics than technicalities. I wanted this environment to have this eerie sci-fi feel, but the player to be kept curious as to what is going on. Concerning creating this environment for my project, many focused on a place they have been to in the past. However, I wanted to go a different route and create something from my imagination. With that in mind, I wanted to create something that would be visually interesting as a player to walk through and experience.  </p>\n<p>   In designing this, I was at first inspired by a floating city my teacher showed during class. I then researched some designs of floating cities to help me in what theme I would do. It was during that process I decided to go this eerie sci-fi void where everything would sit. I made the decision the city would be an empty one covered in grass and large buildings. Then I thought how the player would get there, so I decided the player would follow a path to get to this empty city. However, the path I made was not an obvious one, but more of a leap of faith. </p>\n<p>   In creating this path towards this city, I wanted the beginning of it to start in this empty cave only hearing the sound of your footsteps and water dripping adding reverb to accentuate the emptiness enhancing the visual appeal of the game. Then as they leave the cave, they enter this land sitting in this black void. Using base colors blue and white, I created this visually appealing scene. It is a tranquil scene with ambient noises to let a player feel somewhat comfortable in this space. However, when the player, begins to walk up the stairs. The sound of emptiness is once again accentuated with the reverb playing on each step to build up sensation for the player. The hue of the stairs and blue orbs in the trees give the scene an eerie feel as they walk up. The design of the trees is strange futuristic style, emitting light inside this void to build a bit of atmosphere inside. Upon reaching the top, the players jump falling into space landing on this grassy terrain fill with debris with a gigantic glowing cube glowing rotating around in an attempt to draw the player towards it. As the player walks towards it something will happen to the player which is more like a trick, but in this environment, the player cannot always reach the end. </p>\n<p>   In designing this game, I hope for the player to enjoy yet find this environment a bit eerie and empty but intrigued at the same time. The purpose of creating this is to explore my imagination and how I imagined this in my mind and to bring it to life. Visually it is not precisely as I imagined, but this 3D virtual environment is still appealing and reflects what imagined. </p>", "metacritic": null, "released": "2018-05-25", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/7cc/7cc33182ac425b0a00cf37589d71fc0b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 118, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["s3521661"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}