{"id": 140956, "slug": "dark-zeta-vol-1-surreal-menace", "name": "Dark Zeta Vol 1: Surreal Menace!!", "name_original": "Dark Zeta Vol 1: Surreal Menace!!", "description": "<p>Dark, a creature from the world of Somniumus (Somnium as in dream in Latin) saw the king sprite guardian of dreams shatter into pieces by an unknown force. This nightmare has then overtook the central cortex of Somniumus, where all life energy emits. Into the depths of Somniumus lies the shimmering layer of light that fills the void with radiant energy for life. This is Dark's home. But the place has been overtaken by chaotic beings. Dream demons spawn and take Dark's love ones away. It is up to you to help Dark collect the sprite piceces to amend the guardian of dreams, rescue his love ones from the SURREAL MENACE! </p><p>--------- A little more behind the scenes of development -----------</p><p>This game project has been in production since November of 2011, but the initial start of it all was back in 1996, yet I would officially express 1998 to be when I was truly manifesting my first draft. Fast forward now into 2013 and life has started really getting difficult for me in continuing my project. I started to pull away from production on my birthday in may 2013 as then is when my father had a double stroke. Since I had been trying to, from time to time, work on it. The demo I supply in this website isn't up to snuff from the Android TV/Ouya version, but is much more stable to try out. I went off a bit so I can research and learn new techniques to better my developments.</p><p>As I gained more in other businesses and helped out my family, more and more I have been drifting away from Dark Zeta production. This until December of 2013 I then deviated to do a special complimentary project – but got way too sidetracked with it. This is when I made the statue of DARK ALPHA, an idea akin to Skylanders and Disney Infinity toy-to-games. But as time went on, early in 2014, my family business went bankrupt. In despair, I pushed into making something new and set aside DARK ZETA until further notice. I put all my focus on mobile as I wanted to establish my creative group an economic base to supplement future projects. Sadly that didn't happen.</p><p>Right now I'm in a \"in-between\" stage of getting back up again – in other words, we are strap for cash and can't really focus on the things we love because of necessity. This is when I decided to open up many funding fronts and establish a base to finally get this project finished with the help of others.</p><p>Previously I wished for Dark Zeta Vol 1 to be an exclusive for Ouya but the market has changed drastically since I decided to do so. So my plan is to have it for Windows and Android TV devices when I finish with it. There were features I was going to dedicate to the android TV platform but decided to focus generally in getting the overall game done. I also decided to stick the game back into 1 version than have two separated ones. So now dev on it will be just simply DARK ZETA.</p><p>You'll find in this demo that you'll be able to choose between picking up the sword or not. These actually change the game as you progress.</p><p>There is a lot of secrets in this demo. I hope you find them all.</p><p>Thank you and enjoy!</p>", "metacritic": null, "released": "2014-07-24", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/fa6/fa6218121080ea50a5ddf0ad255386f7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 130, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Gerardo Valerio"], "genres": ["Action", "Adventure", "RPG"], "publishers": [], "esrb_rating": null}