{"id": 140901, "slug": "the-sacred-cavern", "name": "The Sacred Cavern", "name_original": "The Sacred Cavern", "description": "<p><strong>The Sacred Cavern</strong> is a simple narrative-based puzzle game where you play as a human and help a variety of forest dwellers in order to earn the trust of a stubborn golem and gain entrance to the Sacred Cavern.</p>\n<p>It was created by a team of 2 in one week, and uses free Unity assets as well as the Unity package \"Dreamscapes.\"</p>\n<p>My partner is the talented Jaden Davis - Go check out his itch page, which has several of his personal games!  <strong>https://jetaluskipro.itch.io/</strong></p>\n<p>Jaden and I worked side-by-side throughout the entirety of <em>The Sacred Cavern</em>'s creation, from conception to completion. My primary roles were level, puzzle, and narrative designer. I designed both the level and visual style of the game, and created the entire environment in Unity, from the particle systems, to collision boxes, to placing each tree and bush and crystal by hand. I also played a large part in puzzle design, conceptualizing the puzzles with my partner and conceiving them in Unity. Furthermore, I played a usability role, playtesting the game and making changes based on players' needs in order to create the best player experience possible.</p>\n\n<p>Music: Faron Woods, from The Legend of Zelda: Skyward Sword and Aurora by Hans Zimmer</p>\n<p>All trees, rocks, crystals, mushrooms, textures, skyboxes, and particle effects were from the asset package Dreamscapes. All other assets were free on the asset store.</p>", "metacritic": null, "released": "2017-12-16", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/d1c/d1c2518ed0e9f5df3824d07b166031df.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 98, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["JetaluskiPro", "Eva Wierzbicki"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}