{"id": 140939, "slug": "mage-runner", "name": "Mage Runner", "name_original": "Mage Runner", "description": "<p>Welcome to the Magical World of Elvis. Like Elvis have you also ever dreamt of being a magician? Like Elvis have you ever stuck in your magical world? Elvis has got stuck and needs your help.</p><p>Before that lets introduce Elvis!</p><p>Elvis is a mediocre kid and has always dreamt of becoming a magician. He loves magic and finds things around him magical. One fine night while he was asleep he dreamt of a magical world where unfortunately he got stuck in his own imagination. He landed up in a maze and is struggling to come out of it. All he needs is some specified number of keys to come out of the maze. Not just keys he has to face the monsters on his way. Elvis has to beat the monsters and collect the keys to get out of this maze. Trembled and terrified Elvis has only magic with him.</p><p>Do you think you can help Elvis come out form this Maze?</p><p>Just download \"Mage Runner\" to help Elvis. Full of fun and challenges this is a magical app. With this amazing app, you can live the life of a magician and show the world your magic. Develop the Magic Power and use the spells to defeat the blockers in your way. During your journey of the Magical World and coming out of this Maze \"Mage Runner\" also features different Points. Collect maximum number of Points to improve your skills, Magical Power, Healing capacity and many more. This is a complete magical fun game where age is not a barrier. Use your strength, intelligence and Magical Ability to live your magical dream of Elvis.</p>", "metacritic": null, "released": "2016-06-03", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/6b2/6b2fbf32d524aa5c8a26dd6689250d60.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 198, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["DevilzStudio"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}