{"id": 14101, "slug": "sakura-clicker", "name": "Sakura Clicker", "name_original": "Sakura Clicker", "description": "<p>Sakura Clicker is a free-to-play incremental game, a spin-off of the visual novels series Sakura developed by Winged Cloud.</p>\n<h3>Gameplay</h3>\n<p>Unlike previous games in the Sakura series, Sakura Clicker does not have any storyline or premise. Its connection to the rest of the franchise comes down to the similar anime art-style and some characters and highly sexualized character design. Your goal is to defeat a never-ending string of enemies which the game calls the ‘Monsters Girls.’ They appear as explicitly dressed young women with some animal or mystic creatures features such as cat ears, dragon tails or owl wings. You fight Monster Girls primarily by clicking on them with the left mouse button. They do not attack you so you cannot die in the game. Killing enemies gives you gold coins. They are the main currency in the game. You spend gold to level up your character which increases your stats and makes you either deal more damage or hire the allies. The Allies are special characters that help you defeat enemies. Each of them has its scale of progression and comes with several passive abilities. These abelites can increase the amount of gold you get from each, the damage you deal with each click or improve automatic damage the deal themselves. The game is free-to-play and offers some paid DLCs in the form of costumes for your main hero. You can also customize your character’s outfit using gold coins.</p>", "metacritic": null, "released": "2015-07-29", "tba": false, "updated": "2023-12-26T20:31:34", "background_image": "https://media.rawg.io/media/screenshots/2c3/2c3a799964d6cc311f022e0e0896a1e8.jpg", "website": "", "rating": 2.55, "rating_top": 1, "added_by_status": {"yet": 26, "owned": 1215, "beaten": 23, "toplay": 5, "dropped": 82, "playing": 4}, "playtime": 1, "achievements_count": 0, "ratings_count": 125, "suggestions_count": 352, "game_series_count": 0, "reviews_count": 125, "platforms": ["PC"], "developers": ["Winged Cloud"], "genres": ["Casual", "Indie"], "publishers": ["Winged Cloud"], "esrb_rating": null}