{"id": 14117, "slug": "revelations-2012", "name": "Revelations 2012", "name_original": "Revelations 2012", "description": "Armageddon. Apocalypse. The end of days.  Mayan prophecy foretells the beginning of a new world age on December 21, 2012 when the road to the stars will descend from the sky and civilization as we know it will come to a tumultuous end.  That date has arrived and with it the awakening of a most formidable enemy.  Galactic alignment has enabled an artifact which opened a portal allowing villainous Gods access to our universe.  Fate has chosen 4 characters to teleport through this portal into another dimension and battle against all odds to rescue mankind from destruction and enslavement.  Using teamwork and strategy, can the four heroes save humanity by defeating these evil foes?<br/><br/>In Revelations 2012 players progress through an alternate dimension in a sweltering jungle environment heavily influenced by ancient Mayan culture.  First-person shooter action is combined with puzzle solving requiring methodical yet quick-thinking team play in a captivating campaign that can be played with up to four players in co-op mode.  Players navigate their way through this perilous maze in 15 different maps gathering \"suki-tok\" to advance themselves all the while fighting hordes of demonic minions.  At the end of each level, the characters are faced with their greatest challenge yet, the Gods themselves!!!  As each God is defeated players acquire a crystal to increase the capability of their weapon.  Players must use each successive crystal in the next trial that awaits them.  Gather all the crystals and overpower the Gods to be victorious in this epic journey.<br/><br/>In addition, multi-player modes let you compete four-on-four with friends playing as either heroes or demons in stasis tag or team death match.  Revelations 2012 also boasts the premiere of battlegrounds multi-player maps.  This unique mode allows unit selection mind control in a 4 vs. 4 setting to advance in force upon your opponent and infiltrate the enemy base to destroy their boss.Key Features:<br/><ul><li>FPS 4 player co-op<br/></li><li>Epic boss fights<br/></li><li>Hordes of powerful minions<br/></li><li>4 vs 4 multi-player game play with an all new battlegrounds mode<br/></li><li>Modular alien weapon system<br/></li><li>Teamwork strategy to solve puzzles<br/></li><li>Old world Mayan city setting<br/></li><li>Use of AI director for unique game experiences<br/></li><li>Matchmaking, stats, rankings, and awards systems<br/></li><li>Powered by Source and Steam</li></ul>", "metacritic": null, "released": "2012-04-23", "tba": false, "updated": "2019-09-17T10:21:41", "background_image": "https://media.rawg.io/media/screenshots/a8a/a8a4cd1cbee63a613d81159837eb750c.jpg", "website": "http://www.darkartzentertainment.com/", "rating": 1.88, "rating_top": 1, "added_by_status": {"yet": 3, "owned": 249, "beaten": 4, "dropped": 3}, "playtime": 1, "achievements_count": 47, "ratings_count": 7, "suggestions_count": 621, "game_series_count": 0, "reviews_count": 8, "platforms": ["PC"], "developers": ["Dark Artz Entertainment"], "genres": ["Action", "Strategy", "Indie"], "publishers": ["Dark Artz Entertainment"], "esrb_rating": null}