{"id": 14126, "slug": "learn-japanese-to-survive-katakana-war", "name": "Learn Japanese To Survive! Katakana War", "name_original": "Learn Japanese To Survive! Katakana War", "description": "<p>Learn Japanese To Survive! Katakana War is an educational game that is the ideal introductory course to the Japanese language! It&#39;s the sequel to the smash-hit Hiragana Battle – but you don&#39;t need to have played that!<br />\nThis new game teaches you a separate part of Japanese: the Katakana writing system.<br />\nCompatible with PC &amp; Mac, Learn Japanese To Survive! Katakana War launches you into a journey full of learning, action, adventure and intrigue. All you need to start learning Japanese is contained within the game!<br />\nJapanese is an exciting and interesting language. It looks a bit complicated to learn, right? After all, there&#39;s all those weird and wonderful written characters to memorize. Where do you even start to learn them? How do you remember which is which? If you&#39;re asking yourself those questions, don&#39;t worry – that&#39;s completely normal!<br />\nThe best way to learn a new language is with a learning tool that&#39;s going to keep you interested, challenge you at the right pace, and most importantly, keep you coming back for more. Learn Japanese To Survive! Katakana War is your ticket to easy Japanese learning!What is Katakana?<br />\nThe Japanese language combines 3 different sets of characters to form written works: Hiragana, Katakana and Kanji.<br />\nThis game focuses solely on Katakana, which is frequently used to write words with a foreign origin, as well as names of people, places and things. That makes it incredibly useful!<br />\nWith this game, you&#39;ll learn to read and write every single Katakana character! You&#39;ll master pronunciation and be able to write words in no time at all.How does the game work?<br />\nAt the start of each of the game&#39;s chapters, you&#39;ll learn a new set of Katakana characters. Following that, you&#39;re free to go on adventures and explore.<br />\nYou&#39;ll encounter dangerous enemies that have taken the shape of Katakana. To defeat them, you&#39;ll need to correctly translate them! If you give the wrong answer, you won&#39;t deal any damage. It&#39;s a learn &amp; live situation!<br />\nOn your adventures, you&#39;ll also learn Japanese vocabulary! You&#39;ll see how Japanese words are constructed with Katakana, and the translations of useful words and phrases.<br />\nLuckily, you&#39;re not alone on your adventure. You&#39;ll make friends who will study with you and join you in battle. If you bring them along on lots of adventures, your friendship will strengthen and they&#39;ll unlock powerful abilities.Game features<br />\nAn exciting story based around the concept of learning Japanese. Save Japan from an invasion of shape-shifting monsters!<br />\nLearn every single Katakana character, with detailed instructions on how to read and write each character.<br />\nVisual animations display how to write each character.<br />\nAudio speech examples demonstrate how to pronounce each character.<br />\nExciting gameplay with familiar RPG elements – collect items, complete quests, engage in battles!<br />\nForm new friendships and get to know each character with unlockable story sequences.<br />\nEarn experience points and level up your characters.<br />\nReview completed lessons to brush up on your knowledge.<br />\nIn-game quizzes to test what you&#39;re learning.<br />\nReady to learn Japanese? You bet you are!</p>", "metacritic": null, "released": "2017-01-30", "tba": false, "updated": "2023-11-01T10:04:18", "background_image": "https://media.rawg.io/media/games/4d9/4d93ce9b79d6e99dfe82221366d0a15d.jpg", "website": "http://www.study-japanese.net", "rating": 2.6, "rating_top": 4, "added_by_status": {"yet": 32, "owned": 417, "toplay": 2, "dropped": 6}, "playtime": 4, "achievements_count": 13, "ratings_count": 10, "suggestions_count": 221, "game_series_count": 0, "reviews_count": 10, "platforms": ["PC", "macOS"], "developers": ["Sleepy Duck"], "genres": ["Adventure", "RPG", "Strategy", "Indie"], "publishers": ["Sleepy Duck"], "esrb_rating": null}