{"id": 141250, "slug": "skele_ton", "name": "Skele_Ton", "name_original": "Skele_Ton", "description": "<p>This is a project developed for my last trimester involving state machines.</p>\n<p>Before I begin, huge shoutout to Unity3D as I made this game with their completely awesome engine and I have spent the last 3 years learning the in's and out's of the Unity API. May there be many bugfixes and awesome updates in the future.<br/></p>\n<p>We were assigned to create a simple turn based game, and this is the result of about a week's work.</p>\n<p>So the aim of the game is to move your character on your turn. Each turn you get 100 action points. Moving consumes action points and attacking consumes 50 action points per attack.</p>\n<p>Stay out of sight of enemies and try to capture the diamond and bring it back to the capture plate without being detected. Detection results in game over and you will restart the level.</p>\n<p>There are also two color coded doors in the level. You will need to stand on the pressure plate for each one to open that door.<br/></p>\n<p>This game is pretty basic and I did not intend it to be a full release, so there is no scoring system or anything like that, although if enough people play it I will add more features and bug fixes for some minor issues.</p>\n<p>Sometimes the AI might glitch out or not move and there might be some small bugs, but I've ironed most of them out.<br/></p>\n<p>Leave some comments below for improvements or changes that you want to see or if you have any questions, feel free to fire away.</p>\n<p>Anyways, as always, have fun!<br/></p>", "metacritic": null, "released": "2017-07-20", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/f5f/f5fa03148aaaed1420a5590184ef754c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 58, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["CausticLasagne"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}