{"id": 141287, "slug": "game-487", "name": "2018", "name_original": "2018", "description": "<p>This is my entry for the Global Game Jam 2018.</p>\n<p>In the fictional country of  Harmonia, two factions, the people who like red and the people who like blue, really dislike each other. To prevent the hate from spreading, the Harmonian government introduced a new law that forces social media sites to delete illegal content within 24 hours (7 days for content that's not obviously illegal) or face astronomic fines. Your job is to decide which reported posts are kept and which are deleted.</p>\n<p>So yeah, it's a thinly veiled parody of Germany's NetzDG law, which went into effect January 2018. I read an article about the experiences of someone working on the content monitoring team (you can read it here) and since it seemed like a real-life \"Papers, Please\", I thought it would make a fine game (at least in theory). Especially the part where, time-wise, three posts have to be evaluated in a single minute struck me as absurd and kinda gamey. Obviously the game would have been better with a more full-fledged system and some ways to check the context of a post, but alas, time is limited during a jam.<br/></p>\n<p>So to sum it up:<strong> 2018 is one of my silly smaller games</strong>, so please <strong>don't go in expecting something grand or well-researched</strong>, ok?<br/></p>\n\n<p><strong>Controls:</strong></p>\n<ul><li>Advance text - Left mouse button / A</li><li>Skip text - Enter</li><li>Select \"Delete\" - Left mouse button / A</li><li>Select \"Keep\" - Left mouse button / S</li></ul>", "metacritic": null, "released": "2018-01-29", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/9e6/9e676e4b6a7af3341fdee7f4795a28ae.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 39, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Captain Dreamcast"], "genres": ["Simulation", "Educational"], "publishers": [], "esrb_rating": null}