{"id": 14122, "slug": "escapevr-the-basement", "name": "Escape!VR -The Basement", "name_original": "Escape!VR -The Basement", "description": "<strong>Escape!VR -The Basement-</strong> is an 'Escape The Room' genre game which was inspired by real-life escape games and written from the ground up as a room-scale virtual reality experience for the HTC Vive and Oculus Rift+Touch (360° setup).<br/><br/>Can you escape? Explore the environment, solve puzzles, discover useful items, investigate clues, and find your way through a total of seven rooms in three areas to -hopefully- <strong>escape the basement</strong>!<br/><br/>Features<br/><ul><li>Solve over a dozen puzzles, which includes smaller ones like finding keys or codes up to large ones which involve complex interactions with daunting machinery. Look, feel, and ambience are based on corresponding real-life environments.<br/></li><li>Explore three distinct areas with seven rooms, a total of 130 square meters, and more than 200 items to interact with. The game is designed for room scale and features a teleporting system similar to “The Lab”.<br/></li><li>In case you get stuck, a built-in hint system provides you with clues. You’ll also get in-game statistics about your performance, and there are Steam achievements to unlock!</li></ul><br/>Will you take on the challenge? <strong>Will you manage to escape the basement?</strong><br/><br/>Requirements<br/><ul><li> This game requires an HTC Vive - or an Oculus Rift with Touch and 360° setup (3 cameras).<br/></li><li> You can play standing (teleport only) or room-scale (move and teleport).<br/></li><li> You need to be able to reach up to 1.9m.<br/></li><li> You need to be able to duck (headset below 1m).</li></ul>", "metacritic": null, "released": "2016-11-07", "tba": false, "updated": "2019-08-28T22:12:19", "background_image": "https://media.rawg.io/media/screenshots/f1f/f1f74cb24d5e3d4a5b9ff1832d1f09cd.jpg", "website": "http://www.sourcenity.com/index.php/escapevr/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 14, "beaten": 1}, "playtime": 1, "achievements_count": 9, "ratings_count": 2, "suggestions_count": 173, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Sourcenity"], "genres": ["Adventure", "Indie"], "publishers": ["Sourcenity"], "esrb_rating": null}