{"id": 141270, "slug": "foreigner-on-earth", "name": "Foreigner on Earth", "name_original": "Foreigner on Earth", "description": "Prototipo desarrollado para el Panama Game Jam 2017.\r\n<p>La tierra está deshabitada luego de haber sido sumida en la basura. Alien, el protagonista de esta aventura, llega a la tierra y no entiende por qué hay tantos materiales en el suelo en lugar de ser reciclados.</p>\n<p>Alien desconoce el concepto de \"basura\" porque en su planeta todo es reutilizado o se le da una nueva vida por medio del reciclaje. Al encontrar tantas cosas que para nosotros son \"basura\" en el suelo, él lo ve como materiales que han sido abandonados.</p>\n<p>En vista de ver tantos materiales a su disposición, Alien empieza a recogerlos para reparar su nave y, quién sabe, incluso construirse un hogar en este nuevo planeta.</p>\n<p>¿Podrá Alien además encontrar vida inteligente?</p>\n<p><strong>Instrucciones</strong></p>\n<p>Moverse: WASD</p>\n<p>Recoger objetos: E</p>\n<p>Abrir inventario: I</p>\n<p>Abrir panel de reciclaje: K<br/></p>\n<p>Soltar un objeto del inventario en el piso: arrastrar el objeto desde el panel de inventario hacia afuera y soltar el click<br/></p>\n<p>Reciclar libros para convertirlos en una silla: <br/></p>\n<ol><li>recoger dos libros (E)</li><li>Abrir el inventario (I)</li><li>Abrir el panel de reciclaje (K)</li><li>Arrastrar los dos libros del panel de inventario al primer slot del panel de reciclaje</li><li>Hacer click derecho sobre la silla que aparecen en el slot inferior del panel de reciclaje para moverla al inventario</li><li>Ahora puedes arrastrar la silla desde el panel de inventario hacia afuera del panel para poner la silla en el piso</li></ol>\n<p>Por ahora solo se pueden reciclar los libros para convertirlos en sillas.<br/></p>\n<p><strong>Assets utilizados</strong></p>\n<ul><li>RPGTalk para los diálogos</li><li>Inventory Master para el sistema de inventario y crafting/reciclaje</li><li>Modular Spaceship 1: StarSparrow para la nave destruida</li><li>Standard Assets usamos el Third Person Controller llamado Ethan como nuestro personaje principal. Solo lo customizamos con colores.</li><li>Varios modelos del asset store para crear el ambiente</li></ul>\n<p><strong>Créditos</strong></p>\n<p>César Arturo Patiño, María Luisa Carrión y Rogelio Moreno<br/></p>", "metacritic": null, "released": "2017-12-17", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/db9/db933a9101e02c9b39d987db2a6f5165.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 39, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["marilu597"], "genres": [], "publishers": [], "esrb_rating": null}