{"id": 141366, "slug": "danyiri-rescue", "name": "Danyiri Rescue", "name_original": "Danyiri Rescue", "description": "<p>\r\n\tThe Danyiri were happily living on a distant planet when they spotted something strange happening on Earth.  The pets were being abducted by those nasty Squiggles. They have made it their mission to stop this but they need the help of the Earthlings. Will you help them?\r\n</p>\n<p>\r\n\t Your task is to place the Danyiri on the right spot of this route so that they can intercept the boxed pets but avoid the Squiggles.\r\n</p>\n<ul>\n<li> Full instructions and an interactive tutorial included.</li>\n<li> Includes a story (can be skipped but is short &amp; fun).</li>\n<li> Game starts off easy with only 1 Danyiri and becomes very challenging as more routes, Danyiri and Squiggles are added.</li>\n<li> See an image of the pet you rescued at the end of every level.</li>\n<li> As the game progresses you get devices to help you intercept the pets like portals, pause, speed-up and slow-down.</li>\n<li> There are interactive hints that will give you as much help as you want - choose out of the 3 options or use them together to get 95% of the solution (100% in some cases). In most cases there's a variety of ways to solve the puzzles. The hints are just 1 option.\r\n\t<ul>\n<li>Hint 1: Shows you where to place the Danyiri</li>\n<li> Hint 2: Shows you what devices to use</li>\n<li> Hint 3: Shows you where to place the devices.</li>\n</ul>\n</li>\n<li> Two modes - casual &amp; expert mode and you can switch between them at any stage and as often as you like.\r\n\t<ul>\n<li> In casual mode the boxed-pets will keep circling on their routes until they're intercepted.</li>\n<li> In expert mode you have to intercept them before they stop circling - large numbers indicate your target. Warning: Expert mode can be very tricky!</li>\n</ul>\n</li>\n<li>Collect 3 treats to get gold. A treat is collected when the Danyiri touches it.</li>\n<li>There is no time limit - take as long as you want to decide where to place the Danyiri - try a few things, have a look at the board and use that restart button. Nothing starts moving or counting down until you click START.</li>\n<li>Duration: If you work out the puzzles yourself then this is a very long game + - 10 hours at least.<br/>\n</li>\n</ul>\n<p>\n<strong>Danyiri Rescue is a puzzle game with unique game play.</strong><br/>\n</p>\n<p>\n</p>\n<p>\r\n\tDanyiri Rescue - Casual Game from Evolutionary Games on Vimeo.\r\n</p>\n<p>\n<strong>System Requirements:</strong>\n</p>\n<p>\r\n\tRecommended: 1.80GHZ 2 Gig Ram\r\n</p>\n<p>\r\n\tThis game was tested to work on Windows 10.\r\n</p>\n<p>\r\n\tThis game is written in the resolution 1920 x 1080 and will be that size if played in window mode on a monitor larger than that. It will stretch to fill your screen if played full-screen. It will stretch to fill your screen on a square monitor as well. <em>(Should you prefer it doesn't stretch and want the black bars top and bottom instead, feel free to ask - it's a press of a button from my side to give you a version like that.)</em>\n</p>\n<p>\r\n\tThis game was also tested and working on Windows XP, 504mb Ram 1.73 GHZ.\r\n</p>\n<p>\n<br/>\n</p>\n<p>\n<br/>\n</p>\n<p>\n<strong><br/>\n</strong>\n</p>\n<p>\n<br/>\n<br/>\n</p>", "metacritic": null, "released": "2016-07-12", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/40d/40d91fa3428e3da4b4a9d0c9bc55ad59.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 85, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Evolutionary Games"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}