{"id": 141317, "slug": "bgp-level-builder-mars-lander-edition", "name": "BGP Level Builder: Mars Lander Edition", "name_original": "BGP Level Builder: Mars Lander Edition", "description": "<p>\r\n\tBGP Level Builder: Mars Lander Edition</p><p>\n</p><ul>\n<li><strong>Integrated Builder / Runner</strong>: Build and test your levels all within one unified interface! The BGP Level Builder features an interface which you can use to build and play your level. There is no need for loading or compiling, you can easily switch between modes on the fly.</li> <li><strong>Auto-tiling:</strong> Programming magic makes terrain placement lightning fast! Click and move the mouse and watch as the <em>terrain automatically aligns</em> to create a seamless looking level. You can, of course, still manually place tiles if you are so inclined.</li> <li><strong>Level Codes</strong>: <em>Share your levels</em> with others using a simple text code! All the levels you make with the BGP Level Builder are saved as plain text strings which you can share with ease. The codes can be posted on <em>any </em>social media site.</li></ul><p>\n</p><ul>\n<li><strong>Implied game-modes</strong>: The game <em>objective changes</em> to fit however you make it! Don't place an objective and the game will automatically switch to a Collection game-type where you must collect all the point-scoring objects to win.</li></ul><p>\n</p><p>\n<em>Functions are i</em><em>n order from top-left side down, then left to right</em></p>Functions:<ul>\n<li>Place Object: Click this button to bring up the Objects Window and pick which Object you will place.</li> <li>Play Toggle: Start and stop your level on the fly! No need to wait for compilation.</li> <li>Add / Remove Toggle: Toggle the function of the Primary and Secondary Mouse Buttons to accommodate users of a single-button mouse.</li> <li>Gird Toggle: Used for alignment.</li> <li>Undo / Redo: 32 iterations of your level are saved in memory should you decide you want to go back on any changes you've made.</li> <li>Save: Opens the Save Menu which allows you to save the level locally or get the text-code of the level you've made to share with the world!</li> <li>Load: Opens the Load Menu which allows you to Paste Level Codes, open internally saved levels, or open Included Levels created by Bluish-Green Productions.</li> <li>New: Clears the current level to give you a clean slate. Hit it by accident? Don't worry, it CAN be undone!</li> <li>View Mode Toggle: Switch between the utility and preview view mode.</li> <li>Open URL: Opens the level you've created in the Online Runner, ready to share!</li> <li>Menu Bar Functions:\r\n\t<ul>\n<li>Edge Toggle: Switch between straight and slanted edges</li> <li>Control Modifier: Replace Objects and disable the auto-tiling system</li> <li>Alt Shortcut: Swap between similar Objects</li> </ul></li></ul><p>\n</p>Mars Lander Builder Original:<ul>\n<li>The Original Mars Lander Builder is included as part of the download along with <strong>100 Level codes</strong>!\r\n\t<ul>\n<li>(These Level Codes are not cross compatible with the new BGP Level Builder: Mars Lander Edition)</li> </ul></li></ul><p>\n</p>", "metacritic": null, "released": "2014-04-20", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/2ba/2ba745e4800951322df478466934c65d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 89, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["BluishGreenPro"], "genres": [], "publishers": [], "esrb_rating": null}