{"id": 141345, "slug": "driving64", "name": "Driving64", "name_original": "Driving64", "description": "<p>A small driving (and shooting) game, made with Unity, targeting a 64x64 frame buffer, for #LowRezJam 2016: https://itch.io/jam/lowrezjam2016</p><p>Instructions: Drive around, shoot some enemy cars. Maybe they're bad guys?<br/></p> Attributions: <ul> <li>Inspiration, Techniques - Jake Gordon's 'Code inComplete' blog : Much of the inspiration for this project came from reading Jake's \"How to build a racing game\" tutorial. In five posts, he lays out how to rebuild a game like OutRun in the browser. I have structured my game differently than he did, but a lot of his stuff was directly useful. Frequently, I'd have to re-tune the numbers used to get something that feels right, as he was working with a specific resolution, and the resolution I was working at was very different. With software rendering approaches like these, and especially scan-line techniques, you need to do a fair amount of tinkering to get something that feels good, rather than expecting fidelity to some ideal model.</li> <li>Deeper Insights: 'Lou's Pseudo 3d Page' by Louis Gorenfeld  : Jake refers to Lou's page, and there's some good material here. To really wrap your head around this kind of stuff, it's good to start here, and maybe go back and forth.</li> <li>Tangent: Physics of Racing : this wasn't even something I looked at for the past decade, but if you want to make a physically accurate racing game, it's worth reading through this stuff. Especially if reading stuff about physics of racing is your thing.</li> <li>#LowRezJam 2016 : Game jams are funny things - I've had jams catch my attention and I ended up dropping all sorts of stuff to get something working in a short period of time. That describes this project, certainly. Jay (below) posted about this jam, and before I knew it, I had a little tech demo, and I was off to the races. Heh.</li> <li>The challenge: Jay Barnson's \"Rampant Games\" Blog : In particular this post. I don't know Jay except as a friend of a friend. Or an ex-co-worker of an ex-co-worker. Or semething. Still, I've been following his blog more than probably any other over the years. Back in 2012, he posted about NaGaDeMo 2013, the \"National Game Developer Month\", echoing \"National Novel Writing Month\". I thought that was an interesting idea, and I made an RPG using PlayN, a thing I was investing some amout of time and energy into at the time. Later, he mentioned taking this idea of making a game in a month, and holding on to it over the span of a year, making one game every month throughout 2013. So I did that, too. And then, most recently, this LowRezJam thing. So, Jay has indirectly inspired me to make 14 games so far. That's not bad. I should buy him dinner, or something.</li> <li>The Framework: Unity3d, running on Ubuntu Linux : Did you know that Unity's editor runs on Linux? It totally does, except when it hangs, freezes, and crashes. Or, if you want a debugger. Still, if you've decided that you want to use Unity, the current build is reasonably stable.</li> <li>The Only IDE you really need: emacs : Somebody at work was trying to make a point, saying that in the worst of all possible worlds, they could edit a file using Notepad++. Well, or you could use Notepad. Presumably, that would be even worse than Notepad++. Or, you could use emacs, which does what it needs to do. Back when I started using it, people sneered at it for being big and bloaty. I guess it probably still is in an absolute sense, but the reference points have moved. Even vi isn't vi anymore, now the cool kids are using \"vim\".</li> <li>Legally mandated artistic attributions Those smears on the screen of unrecognizable pixels actually came from CC-BY licensed artwork in several cases. So, buried at the bottom of this locked filing cabinet, behind the \"beware the leopard\" sign, here are some artists I need to acknowledge (because if I didn't say so here, they wouldn't recognize their work). <ul> <li>Albany Matt H. Wade</li> <li>New York City Photographed by: Jnn13 Stitched by: LiveChocolate</li> <li>Sea of Tranquility Neil Armstrong</li> <li>Philadelphia Parent5446</li> <li>Darnestown, MD farm Jeff Turner Grafton</li> <li>Washington, D.C. Tidal Basin Daniel J Simanek</li><li><li>Trees Enlight Software's \"Seven Kingdoms\" tree art on OpenGameArt.org</li>\n<li>Cars from http://www.pixelcarart.com/    </li> </li></ul> </li><li>Origin Systems' \"Autoduel\", by Lord British and Chuckles : This game's been in my head for decades. This is the biggest project I've made nearby this work, but my imagination's never very far away from it.</li></ul>", "metacritic": null, "released": "2016-04-18", "tba": false, "updated": "2019-08-28T23:22:36", "background_image": "https://media.rawg.io/media/screenshots/d88/d8897661c7c38911ca34ef34d686cfae.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 5, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["BigDiceDave"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}