{"id": 141479, "slug": "shadowspear-knights-quest", "name": "Shadowspear Knight's Quest", "name_original": "Shadowspear Knight's Quest", "description": "<p>Shadowspear Knight's Quest is an addictive mobile adventure game with simple and easy game play for single player. It is a game casual offline which is available anytime, anywhere, absolutely a YES to busy gamers, who want to play a high-quality fun game but don't have time for long, stamina- and time-consuming ones.<br/></p><p>Shadowspear Knight's Quest brings you to ancient time background with brick castles, drained deserts, or deadly volcanic island, where you are a bright and brave hero that stands against the armies of his enemies to defend his land. With difficulty level increased after each stage, this is going to be a tricky yet interesting game, which helps you relax after a stressful day at work. In addition to the entertainment for players, Shadowspear Knight's Quest is designed with cartoonish art, bright colours, lovely shapes, which is believed to tempt not only adults, but also children.</p><p>As a hero, you will have to maximize your logical thinking to figure out a way to eliminate the enemies. Only with super simple up-and-down finger gesture, players themselves will have to pass each challenge without losing a life. After each stage, you will learn analytic skills and foreseeing the situation, which you will find come in handy in your real life!</p><p>Main features of Shadowspear Knight's Quest</p><p>- Highly challenging adventure game with simple gameplay for single player.</p><p>- Attractive graphic designs which are suitable for both adults and children.</p><p>- Free-to-play and fun game without conditions</p><p>Let's be a part of this interesting tricky game arcade for a good day-end relaxation!</p>", "metacritic": null, "released": "2017-02-11", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/b33/b33696fa75dd5ad5c64a57411b3aed9d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 58, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["updeito"], "genres": ["Fighting", "Puzzle"], "publishers": [], "esrb_rating": null}