{"id": 141495, "slug": "eggscape-the-fridge", "name": "Eggscape the Fridge", "name_original": "Eggscape the Fridge", "description": "<p>This was a submission for \"<strong>Weekly Game Jam</strong> - Week 48\", the theme was '<strong>Escape the Room</strong>'.</p><p><strong>Story:</strong></p>\n<p>There once was an egg who so badly wanted to be on the menu, but all the food agreed that only the most delicious can be served to their master, the Wizard.</p>\n<p> Tonight Pizza is the main course! Luckily, Pizza has agreed that if Egg can become more delicious, then they can trade places on the Plate of Destiny and Egg may escape the fridge. Sadly, the Wizard doesn’t like eggs unless paired with other food items.</p>\n<p> You need to impress the other food items in the fridge by dancing your little eggy butt off. Watch out for the Wizard though! You will have to hide behind other food items, or else he will throw you out!</p>\n<p> The Wizard will eat at the stroke of 3, so make sure to become delicious as quickly as possible!</p>\n<p> <strong>Controls</strong>:</p><ul><li>Arrow keys to move and to dance</li><li>Space Bar - Start Dancing (only when in front of a food)</li><li>P - Pause &amp; Dance Moves </li></ul>\n<p>There are 3 types of dances, which you can see when opening the pause menu (P). Each food has a dance that they like best. Try to impress the foods with each dance until you add them to your team!</p>\n<p> You have 3 minutes until the Wizard decides what to do with your food creation.</p><p><strong>Tips:</strong></p>\n<ul><li>*Tip 1* Click \"Escape the Fridge\" to begin the game </li><li>*Tip 2* The Wizard hates eggs alone, so if he sees you when he opens the fridge, he will throw you out. You can hide behind other food, and the eye on the top left will be closed if you are hidden</li><li>*Tip 3* If one dance does not impress a food, try one of the other 2!</li><li>*Tip 4* You only have until the stroke of 3 to become delicious enough. If you aren't, then you'll be thrown in the trash :,(</li><li>*Tip 5* If you become delicious enough before the stroke of 3, you can talk to Pizza and he will switch spots with  you. Ending the game early.</li></ul>\n<p><strong> Credits:</strong></p>\n<p>Art, Design - Chelsea<br/>Music, Sounds, Development, Design - Yanni</p>", "metacritic": null, "released": "2018-06-14", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/1fb/1fb362715755240f5e6fc390374a6503.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 108, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Yanni"], "genres": [], "publishers": [], "esrb_rating": null}