{"id": 141558, "slug": "teaching-asl", "name": "Teaching ASL", "name_original": "Teaching ASL", "description": "<p>Welcome to the Quiet Lands, our fantastical town inhabited by Wisps. As anyone who knows things will tell you, Wisps cannot speak, on account of not having a mouth (Do not ask how they eat, it is considered quite rude). As a traveler to these lands, you must of course meet our Wizard. He will help you learn how to communicate with our kind, and his magic of subtitles will help you learn our signing language. Once you can communicate with us, we will gladly show you our town, and all of its fun little secrets. We may need your help though, it is quite a busy town, and there is always work to be done.</p>\n<p>Teaching ASL is a game built with the intention to teach first year students the basics of American Sign Language. Designed to be approachable regardless of age, this game takes you through a series of mini games and areas, teaching the player the basics of ASL including letters, numbers, descriptions, directions, and others. Using motion capture technology, this game uses words, phrases and concepts that are expected from people learning the beginning ASL concepts. Whether as part of a class or on your own, we invite you to come join us.<br/><br/>This is  developed at FIEA, the game development masters program at UCF. Started as a research project, the intention of this project was to experiment with a new and unique way to teach students American Sign Language. This is a work in progress that will be continued to be developed, until it is made available to schools and other ASL learning students. The scale and scope of the project is currently based on our funding and the ability of our motion capture technology, but current experiments have been successful, and we are hoping to expand outward. </p>\n<p>Because this is still in development, this survey tells us how we are doing:</p>\n\n<p>https://docs.google.com/forms/d/e/1FAIpQLSd02mDPgIr1n8K5pbWNLDRNxVbnCFf8_r4DbN_G...</p>\n\n<p>Enjoy learning ASL</p>", "metacritic": null, "released": "2018-04-20", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/efd/efdd2bbee66a2fe00f118954646b86d0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 187, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["TeamFireStorm"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}