{"id": 1415, "slug": "adventure-to-fate-quest-to-the-future-jrpg", "name": "Adventure To Fate: Quest To The Future JRPG", "name_original": "Adventure To Fate: Quest To The Future JRPG", "description": "&gt;&gt;A 2016 RPG of the YEAR! -TouchArcade&lt;&lt;<br/><br/>Adventure To Fate : Quest To The Future - is an JRPG style dungeon crawler game<br/>-Tons of character creation possibles (8 Classes, 20+ Pets, 6 Professions)<br/>-450+ items to loot, craft, buy and find.<br/>-170 unique monsters to fight<br/>-Fully accessible to the blind using Voiceover <br/><br/><br/>Quest To The Future Story<br/><br/>Our biggest fears have come to fruition, the defenses of the dimensional ports have failed. An evil force has laid to waste our guards and now pours through the portals without resistance.<br/><br/>We've brought you here as our last chance at stopping this evil. You're one of the select few that have used the portals before, to come here for a better life, but in our darkest hour we turn to you one last time, to go back and triumph where we failed.<br/><br/>With our guards and roads destroyed, getting back to the portals will not be easy, as this invasion has crippled our ability to send forces en masse to clear a path. You'll be forced down, through the sewers that run underground to the ruins, into the crypt where the portal to the future lies. You must make haste we don't have much time!<br/><br/><br/>- Customize Your Hero -<br/>8 Classes - Mercenary, Assassin, Cultist, Mutant, Priestess, Ranger, Time Guardian, Arcane Archer<br/>6 Professions - Weaponsmith, Armorsmith, Leatherworker, Tailor, Jeweler, Alchemist <br/>20+ Pets to accompany you in battle<br/>Leveling system that goes up to 27 levels<br/><br/><br/>- Crafting System -<br/>6 Professions - Weaponsmith, Armorsmith, Leatherworker, Tailor, Jeweler, Alchemist <br/>200+ Items to craft<br/>30+ Materials to work with<br/>Share Items between characters using the Account Vault<br/><br/><br/>- Explore Time -<br/>5 Themed Areas from the Past and Future (Sewers, Ruins, Crypt, Frozen Wastelands, Earth Core)<br/>Over 2100 rooms to explore, search, and loot.<br/>Each area has its own unique enemies, spells, shops, treasures, items and much more!<br/><br/><br/>- In Depth Stat &amp; Skill System -<br/>Featuring 200+ Spells/Skills<br/>Damaging skills - These are direct physical attacks that damage the enemy<br/>Damaging spells - These are direct magical attacks that damage the enemy<br/>Damaging All spells (AOE) - These are direct magical attacks that damage ALL enemies<br/>Summoning spells - Allows certain enemies to summon others to help<br/>Healing HP spells - These are spells that heal the casters life/hitpoints (HP)<br/>Healing SP spells - These are spells that heal the casters skill points (SP)<br/>Buffing skills - A skill that user casts on itself to raise some stats<br/>Debuffing skills - A skill the caster casts on enemies to lower some stats<br/>Mimicking skills - Use the enemies skills against them <br/>Taunts - Enemies you must attack first<br/>Death Spawns - Enemies that spawn others upon death<br/>Confusing Skills - Enemies that are confused might attack themselves or other monsters<br/><br/><br/>- Endless Loot &amp; Treasures -<br/>500+ unique items<br/>12 equipment slots to to fully customize your characters - (Weapon, Shield, Helmet, Chest, Gloves, Legs, Boots, Belt, Bracelet, Necklace, 2x Rings)<br/>Randomized drops on all monsters<br/>Item rarity color system (Common, Uncommon, Rare, Epic, Legendary)<br/>*Share* all your items with the Account Vault System.<br/><br/><br/>- Other Features -<br/>Game Center Leaderboard enabled.<br/>Indie created game built for the people!<br/>100s of hours of game play between all classes!<br/>Autosave feature - Easy to pick up and play at any time!<br/>Unlimited character slots so you can try every combination possible.<br/>Retro Pixel Art<br/>8Bit sound/music<br/>Library system that explains general game, character, skills and combat systems.<br/>Fully accessible for the vision impaired using Voice Over.<br/><br/><br/>Thanks for taking a look!", "metacritic": null, "released": "2016-03-02", "tba": false, "updated": "2019-10-22T14:27:43", "background_image": "https://media.rawg.io/media/screenshots/b64/b644cc30b9634337b6c9515a94dd4d35.jpeg", "website": "http://adventuretofate.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 186, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["TouchMint"], "genres": ["Adventure", "RPG"], "publishers": ["TouchMint"], "esrb_rating": null}