{"id": 14166, "slug": "detour", "name": "DETOUR", "name_original": "DETOUR", "description": "<p>DETOUR is a real-time strategy game developed by Sandswept Studios. </p>\n<h3>Gameplay</h3>\n<p>DETOUR is a competitive multiplayer game, that can either be played against AI or with three other players. The main objective of DETOUR is to get your trucks to your destination safely. The other players will prevent you from doing so by placing turrets, placing obstacles or destroying the roads.</p>\n<p>DETOUR has several elements of tower defense games. In order to get your truck to the finish, you will have to build new roads to avoid your opponents, use shops to distract their truck drivers, blow up rocks to build tunnels through the mountains and build up your offensive turrets to destroy the enemy trucks.</p>\n<p>The players have a wide range of weapons at their disposal: air, land, and sea turrets, electromagnetic pulses, or the basic physics objects. There is still one condition present in the game - the players can&#39;t put any turrets too close to the enemy trucks, adding to the game&#39;s difficulty.</p>\n<p>Should the players start a solo game, five difficulty levels will be available to them. The game features a number of maps with different scenarios. How about a map, where there are four lines with each one of them belonging to a different player? How will you build your defense and offense? Who is going to take up all the available space first and deliver their cargo?</p>", "metacritic": null, "released": "2011-05-16", "tba": false, "updated": "2023-11-13T18:08:16", "background_image": "https://media.rawg.io/media/screenshots/cec/cecdb3d3d184693448eaf02918a34c64.jpg", "website": "", "rating": 1.68, "rating_top": 1, "added_by_status": {"yet": 35, "owned": 1183, "beaten": 1, "dropped": 20}, "playtime": 3, "achievements_count": 26, "ratings_count": 60, "suggestions_count": 459, "game_series_count": 0, "reviews_count": 60, "platforms": ["PC"], "developers": ["Sandswept Studios"], "genres": ["Action", "Adventure", "RPG", "Strategy", "Simulation", "Sports", "Racing", "Casual", "Indie"], "publishers": ["Epic Quest Games"], "esrb_rating": null}