{"id": 141716, "slug": "lexcavator", "name": "Lexcavator", "name_original": "Lexcavator", "description": "Word game meets platformer in this hybrid action/puzzle game.Familar mechanics with a twist<ul><li>Platformer controls meet word game puzzles. Your goal: Guide @ as deep as you can into an infinite well of letters by clearing words from the board.</li><li>Don't have every obscure three-letter word memorized? No problem! Lexcavator's fluid level generation algorithm keeps the board filled with longer, more satisfying words.</li><li>Power-ups (like * Blast, ? Alchemize, and _ Erode) can help or hinder your progress. Use them strategically!</li></ul>Three game modes to please all kinds of gamers<ul><li>Arcade: Dig deep and fast while the screen scrolls upwards.</li><li>Time Trial: Pick an interval (ninety seconds or four minutes) and get as many points as possible before time's up.</li><li>Quest Mode: Dozens of challenges designed to test your lexcavation skills. No time limit in this mode—play at your own pace!</li></ul>Keep tabs on your progress<ul><li>Lexcavator keeps detailed records of your highest scoring games across all modes.</li><li>Want to know how your skills stack up? Compare your scores against the global leaderboard!</li><li>Visit the Hall of Lexcellence to see a list of your all-time highest scoring words.</li></ul>Don't take our word for it...<p>\"Smart blend of genres... it all fits together so naturally... clever and exciting\"—Chris Donlan, Edge Online</p><p>\"Exciting and hectic... Words With Friends as an action game\"—Bitmob</p><p>\"Works wonders\"—Jayisgames.com</p><p>\"...if you like word-games and/or retro arcade games you MUST try Lexcavator\"—@keithcalder</p><p>Also featured on... Metafilter · indiegames.com · Free Indie Games ·Superlevel · Kill Screen Daily</p>", "metacritic": null, "released": "2014-12-11", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/c29/c299f18001ebb264d77f243b1e64c70b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 28, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["aparrish"], "genres": ["Action"], "publishers": [], "esrb_rating": null}