{"id": 14203, "slug": "seinarukana-the-spirit-of-eternity-sword-2", "name": "Seinarukana -The Spirit of Eternity Sword 2", "name_original": "Seinarukana -The Spirit of Eternity Sword 2", "description": "StoryA journey across infinite worlds.<br/><br/>The Time Tree. Countless branches extending through space, each a world of its own.<br/><br/>In one such world, a boy holds within him the soul of an ancient god yearning to break free. He tries to live a normal life, but must constantly struggle against the destructive urges threatening to overwhelm him. Little does he know that his closest friends also carry the burdens of an age long forgotten. With this destiny comes power; Eternity Swords with incredible might and Guardian Spirits manifested from their very souls.<br/><br/>The gods are reborn, friend turns on friend, and an ancient war erupts once more. Thrown into a world not his own, Nozomu must fight to bring his friends home. He must also discover the true nature of the being within him before it consumes him utterly. Thus begins a journey that will shake the very foundation of the universe.Features<ul><li>An epic fantasy story that spans an infinite multiverse.<br/></li><li>Over 50 Hours of tactical RPG game-play.<br/></li><li>Six unique endings to unlock.<br/></li><li>Three difficulty levels to test your skill.<br/></li><li>Deep combat that challenges you to find the right path to victory.<br/></li><li>Build an army from 19 playable characters with hundreds of diverse skills.<br/></li><li>Conquer over 100 strongholds and build powerful Artifacts to aid you in battle.</li></ul>", "metacritic": null, "released": "2017-01-26", "tba": false, "updated": "2019-08-28T22:12:16", "background_image": "https://media.rawg.io/media/screenshots/991/991e8a80861e20756fa789ce2eef5610.jpg", "website": "http://seinarukana.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 9, "toplay": 3}, "playtime": 11, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 443, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Xuse"], "genres": ["RPG", "Strategy"], "publishers": ["JAST USA"], "esrb_rating": null}