{"id": 14218, "slug": "cdf-starfighter-vr", "name": "CDF Starfighter VR", "name_original": "CDF Starfighter VR", "description": "<strong>**** THIS GAME IS FOR VR ONLY! ****</strong><br/><br/>350 years in the future, we must unite and prepare to defeat a darkness which is about to consume our Galaxy.  The extinction of the entire human race is almost upon us.  We will depend on brave and skilled fighter pilots who have what it takes to join our elite forces and become a CDF Starfighter.<strong>GAMEPLAY</strong><br/>CDF Starfighter is an exciting, fun, and beautifully detailed VR space combat simulator immersing players into the experience of a star fighter pilot.  Inspired by games such as Freespace, wing commander and star wars, CDF Starfighter focuses purely on space combat with a pick up and play control system.  Concentrating on space combat sims as they used to be, expect not only dog-fighting, but capital ships and a variety of diverse and fun missions and hours of VR fun.<strong>Key Features :</strong><br/><ul><li>Six degrees of freedom with a unique pick up and play control system.<br/></li><li>Dog-fighting, space battles and much more with 70 missions between game modes.<br/></li><li>Free flight mode for VR explorers.<br/></li><li>Designed for VR from the ground up.<br/></li><li>Build to real scale for a more immersive and believable universe.<br/></li><li>Perks, Ship upgrades and much more in campaign mode<br/></li><li>4 Single player game modes with a challenging and story driven Campaign.<br/></li><li>Designed for VR from the ground up for comfort, fun and an immersive experience.<br/></li><li>6 Different unique  role-specific playable Ships.<br/></li><li>Full HOTAS Support and full controls customisation<br/></li><li>Vast and beautiful locations from the CDF Universe.<br/></li><li>Challenging game-play.<br/></li><li>Prove your worth with player rankings, stats, medals and more in scramble mode.<br/></li><li>CDF Database offering lore and information on Colonial defence force and its enemies.</li></ul><br/>CDF Starfighter gives you the opportunity to become an elite starfighter pilot on an epic single player adventure in the CDF universe.   Play through a variety of training simulations, battle simulations and challenges.  Each of the 4 game modes offers a huge amount of content and fun.Campaign Mode<br/>The Pirate War Campaign offers a story driven and challenging 13 mission campaign.  You take on the role of Lieutenant Rodgers who is posted to the CDF Churchill as the Pirate War starts.  The campaign offers perks and fighter upgrades which can also be used in other game modes.Simulation Mode<br/>Simulation mode offers simulations and challenges and are designed to teach you the basics and give you practice in space battles and 7 diverse challenges.  The Basic Training simulation must be completed in order to start a campaign.Free Flight Mode<br/>Free flight offers a no pressure flight with no enemies or objectives.  You can use any of the 6 playable ships and pick any location from the CDF universe (14 maps).  This mode is ideally suited for VR explorers and to try out and get practice in all the playable ships.Scramble Mode<br/>Scramble mode is instant action with stats, ranking and unlock-able ships.  With just over 30 different missions you must get kills and win missions to rank up, gain perks for Campaign mode and earn medals.  As you progress through the ranks the missions will get harder and turn into bigger space battles.", "metacritic": null, "released": "2016-04-05", "tba": false, "updated": "2019-08-28T22:12:15", "background_image": "https://media.rawg.io/media/screenshots/caf/cafdb5fdb3623071befa15e29c59663b.jpg", "website": "http://www.cdfstarfighter.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 7, "dropped": 1}, "playtime": 3, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 520, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": [], "genres": ["Action", "Adventure", "Simulation", "Casual", "Indie"], "publishers": ["MAG Studios", "ShaunWilliams"], "esrb_rating": null}