{"id": 14226, "slug": "meridian-new-world", "name": "Meridian: New World", "name_original": "Meridian: New World", "description": "An accomplished, old-school, indie, futuristic Sci-fi RTS with RPG elements!!<br/>Play as Daniel Hanson, commander of the first expedition to planet Meridian and uncover the dark secrets it holds! Shape the world around you with every decision you make and through every dialogue with your crew. Meridian: New World offers countless options to devise your own strategy, including various equipment options for your units and special abilities for you to rely upon. Use your abilities anywhere on the battlefield and turn the tide of battle by weakening the enemy troops. Alternatively take the covert approach and sabotage the enemy power supply to shut down their production. You can rely entirely on researching superior weapons or special abilities. Or you can risk building a large economy, constructing a massive army from your enormous resources. The strategy you use and how many troops you sacrifice to reach your goal will influence the attitude of your crew towards you. Are you ready to shape the history of galactic colonization?<br/><br/>http://store.steampowered.com/app/312330<br/><br/>Brought to you as the brainchild of Ede Tarsoly - the sole man behind Elder Games - Meridian: New World was mostly received with disbelief and awe at the fact that it's a one-man production. While it remains true that Ede is the source of every detail of the game, some assets were created by his friends Balázs Bodnár, Tamás Gyermán and Gábor Menyhárt, who are credited with their contribution.<br/><br/><strong>Engaging and original story with varied missions </strong><br/><ul><li>A single player game <br/></li><li>Polished, dynamic and fluid unit control <br/></li><li>Beautiful graphics; realistic environments <br/></li><li>Amazing immersive music </li></ul><br/>Steam Workshop<br/>Share the maps you create in the editor with the Community.", "metacritic": 43, "released": "2014-04-04", "tba": false, "updated": "2023-02-03T17:24:37", "background_image": "https://media.rawg.io/media/screenshots/cf3/cf32196b5122000f9b48979488c96753.jpg", "website": "http://meridian-game.com/", "rating": 2.12, "rating_top": 1, "added_by_status": {"yet": 8, "owned": 338, "beaten": 1, "toplay": 1, "dropped": 4}, "playtime": 4, "achievements_count": 83, "ratings_count": 8, "suggestions_count": 512, "game_series_count": 0, "reviews_count": 8, "platforms": ["PC"], "developers": ["Elder Games"], "genres": ["Strategy", "Indie"], "publishers": ["Headup Games", "Merge Games"], "esrb_rating": null}