{"id": 14246, "slug": "rpg-in-a-box", "name": "RPG in a Box", "name_original": "RPG in a Box", "description": "Please be aware that <strong>RPG in a Box</strong> is still in alpha and many of the planned features are yet to be implemented! Before purchasing Early Access, please try out the free demo to get a feel for the current state of the engine.<br/><br/><br/><br/><strong>RPG in a Box</strong> lets you easily create 3D grid-based, voxel-style RPGs and adventure games! As its name suggests, it will contain every tool necessary for turning your ideas into games, all packaged together \"in a box\". The software is designed with a beginner-friendly approach as to not require any programming or modelling knowledge while still providing a wide range of customization and openness.<br/><br/><h3>Voxel Editor</h3>Build tiles, objects, and characters from 3D pixel blocks (i.e. voxels) and easily animate them with the editor's frame-based/stop-motion animation system. Importing from MagicaVoxel (.vox) or PNG sprites is also supported.<h3>Map Editor</h3>Create grid-based worlds with the tiles you've built, then bring them to life by adding interactive NPCs and objects using the editor's intuitive navigation and interaction system.<h3>Scripting</h3>Set up and trigger in-game events with the visual, node-based script editor. Simply drag and drop the desired actions (no programming knowledge required), or manually code \"quick scripts\" using the custom, Lua-like scripting language.<h3>Dialogue</h3>Write conversations for your NPCs using a visual, flowchart approach similar to that of the script editor. Branching dialogue is supported via player choices and condition checking.<h3>Camera System</h3>Choose from three available camera types for your game: standard, first-person, and isometric. Stage dynamic cutscenes using the engine’s flexible camera scripting system.<h3>UI Customization</h3>Design one or more dialogue box themes and customize the appearance of many other interface elements such as the inventory, main menu, and credits roll.<h3>Basic Items</h3>Define basic items for the player to find in containers or earn through the completion of tasks. Attach scripts to trigger effects for potions and other consumable items.<h3>Sound FX Generator</h3>Generate fun, retro-style sound effects using the built-in tool based on Dr. Petter’s SFXR.", "metacritic": null, "released": null, "tba": false, "updated": "2022-12-01T17:57:17", "background_image": "https://media.rawg.io/media/screenshots/187/187aca4eedfda313c83bc3f4ef6b60bc.jpg", "website": "http://www.rpginabox.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 35, "owned": 33, "dropped": 1}, "playtime": 1, "achievements_count": 3, "ratings_count": 0, "suggestions_count": 241, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC", "Linux"], "developers": ["Justin Arnold"], "genres": [], "publishers": ["Justin Arnold"], "esrb_rating": null}