{"id": 14253, "slug": "drone-hunter-vr", "name": "Drone Hunter VR", "name_original": "Drone Hunter VR", "description": "<strong>The Story</strong><br/>In 2016, The NASA New Horizons space probe identified a fleet of alien ships heading towards Earth. Having tracked the many previous sightings and abductions taking place over the years, world leaders have determined that the approaching fleet are sinister in nature. It is projected that their fleet will arrive sometime in late 2017.<br/> <br/>In response to this global crisis, the US military was forced to disclose a top secret military project they had created during the Cold War. The DH125 is a military defense robot that was secretly deployed into orbit during the US Star Wars Initiative. The DH125 is unique in that it contains alien components retrieved from the Roswell crash in 1947 and is the only weapon we have to defend our planet.<br/> <br/>The DH125 was secretly retrieved and modernized to prepare us to defend our planet. It is the only defense we have and can only be remotely operated by one person. Now the global leaders of the world have declared a world emergency and have initiated a program to find the one person capable of manning the DH125. World leaders have called upon VR Visio to create a simulation designed to test a person’s skills, reflexes and precision.<br/> <br/>Are you the one who will lead us to victory? Do you have the skills to defend our planet? Download the game on Steam now and find out if you are the one.<br/><br/><br/><strong>Key features:</strong><br/><ul><li>Deadly bosses <br/></li><li>Hordes of enemies<br/></li><li>Dynamic, highly immersive gameplay<br/></li><li>Interesting plot<br/></li><li>Lot’s of fun!</li></ul>", "metacritic": null, "released": "2016-12-20", "tba": false, "updated": "2019-08-28T22:12:14", "background_image": "https://media.rawg.io/media/screenshots/35d/35dbaec0be2a92775857951b58e6acdf.jpg", "website": "http://dronehuntervr.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 36, "beaten": 1}, "playtime": 1, "achievements_count": 38, "ratings_count": 3, "suggestions_count": 236, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC"], "developers": ["VR VISIO"], "genres": ["Action", "Adventure", "Simulation", "Casual", "Indie"], "publishers": ["Forever Entertainment", "VR VISIO"], "esrb_rating": null}