{"id": 14252, "slug": "cant-drive-this", "name": "Can't Drive This", "name_original": "Can't Drive This", "description": "<p>Drive your car WHILE your friend builds the road in front of you! Oh, and don&#39;t go below 20mph OR YOU&#39;LL EXPLODE! Like in that Sandra Bullock movie, in which she kinda does the same thing, but on a bus. Also, she doesn&#39;t explode (Spoiler alert). Also, Keanu Reeves was in the movie.Co-Op Multiplayer GoodnessPlay local face-to-face couch co-op, with your best frenemy! Don&#39;t have two controllers? No worries, one keyboard and one mouse serves two players! Don&#39;t have keyboard and mouse? Well, that&#39;s weird. (Warning: Can&#39;t Drive This may cause you to erratically scream at your friend.)<br />\nOr, if you don&#39;t have actual real-life friends, find some random internet-person to play! That&#39;s right, we&#39;ve got cross-platform online multiplayer! Experience the joy of playing Can&#39;t Drive This without that annoying smelly friend next to you. You know who I&#39;m talking about.Customization!Where&#39;s the fun in online multiplayer if there&#39;s no customization, you ask? You&#39;re very correct, which is why Can&#39;t Drive This features a gazillion<em> unlockable parts and a vehicle editor so you can show off your awesomeness to everybody on the interweb! But as we all know, only one player gets to drive a car at a time. The other player builds the track. That&#39;s why we also included a track editor! Create your custom track and have your friends race on a gold-plated yellow brick road, if you so wish!Feature List Racing Game (What the game is)<br />\nLevel-Editor (The game is this, too!)<br />\nCustomizable Vehicles<br />\nCustomizable Race Tracks<br />\nCross-Platform Online Multiplayer<br />\nLocal Multiplayer<br />\n</em>Not actually a gazillion parts. Not actually sure if gazillion is even a real number.</p>", "metacritic": 70, "released": "2016-09-25", "tba": false, "updated": "2023-11-30T00:09:54", "background_image": "https://media.rawg.io/media/games/f9e/f9e3d21bebb0fe8afbca98282624a085.jpg", "website": "http://www.cantdrivethis.com", "rating": 2.75, "rating_top": 3, "added_by_status": {"yet": 2, "owned": 58, "beaten": 1, "toplay": 2, "dropped": 2, "playing": 2}, "playtime": 1, "achievements_count": 68, "ratings_count": 8, "suggestions_count": 272, "game_series_count": 0, "reviews_count": 8, "platforms": ["PlayStation 4", "Xbox One", "Nintendo Switch", "PlayStation 5", "macOS", "PC", "Linux"], "developers": ["Pixel Maniacs"], "genres": ["Racing", "Casual", "Indie", "Puzzle"], "publishers": ["Pixel Maniacs"], "esrb_rating": null}