{"id": 1427, "slug": "puzzle-craft-2", "name": "Puzzle Craft 2", "name_original": "Puzzle Craft 2", "description": "The ultimate puzzle adventure is back!<br/><br/>\"BEST OF 25, APP STORE GAMES OF 2015\"<br/><br/>Shore up and build your empire on a legendary, magical new land in Puzzle Craft 2. Farm crops, excavate mines, scour the seas and transform emerging settlements into bustling towns for your workers. <br/><br/>With an entire empire at your fingertips, there’s always something to do!<br/><br/>Mine, craft, build! – match tiles, collect valuable resources, craft tools and build up your towns. Use your influence and magical runes to control weather, summon villagers and more!<br/><br/>Land, air and sea – discover new species and resources as you explore this magical island. Venture out to sea in search of more supplies and discover long lost treasures.<br/><br/>Rule them all! – journey across a massive empire, rule over many settlements at once and grow a mighty empire in the biggest Puzzle Craft yet!<br/><br/>Puzzle Craft 2 features:<br/>•\t Rule over an entire empire in the ultimate puzzle adventure sequel<br/>•\t Match tiles to farm, mine, scavenge, craft and build settlements into bustling cities for your workers<br/>•\t Explore the seas in search of resources and lost treasures<br/>•\t Over 50 puzzles to unlock and discover new resources waiting to be crafted into useful tools<br/>•\t Tons of quests, challenges, treasures, trophies and more to find and complete<br/>•\t Rank your empire with your friends and compete in Royal Quests via Game Center<br/><br/>Important Consumer Information. This app: Requires acceptance of EA’s User Agreement.<br/>EA’s Privacy &amp; Cookie Policy applies. Includes in-game advertising. Collects data through third party ad serving and analytics technology (see Privacy &amp; Cookie Policy for details). Contains direct links to the Internet and social networking sites intended for an audience over 13. Allows players to communicate via Facebook notifications. To disable see the settings in-game. <br/><br/>User Agreement : http://terms.ea.com/en<br/>Privacy &amp; Cookie Policy : http://privacy.ea.com/en<br/>Visit https://help.ea.com/en-gb/puzzle-craft/puzzle-craft-2 for assistance or inquiries.<br/><br/>EA may retire online features and services after 30 days notice posted on www.ea.com/1/service-updates", "metacritic": null, "released": "2015-09-09", "tba": false, "updated": "2019-07-30T03:25:47", "background_image": "https://media.rawg.io/media/screenshots/35d/35d97d810525c04e08a0ef3d12a14e67.jpg", "website": "https://chillingosupport.zendesk.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 171, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["Electronic Arts Chillingo"], "genres": ["Simulation", "Puzzle"], "publishers": ["Chillingo"], "esrb_rating": null}