{"id": 1429, "slug": "another-case-solved", "name": "Another Case Solved", "name_original": "Another Case Solved", "description": "Become a famous detective and get to the bottom of a curious candy conspiracy in Another Case Solved, the latest game from the makers of Puzzle Craft.<br/><br/>This app offers in-app purchases.  You may restrict in-app purchasing using your device settings. <br/><br/>APPLE EDITOR'S CHOICE in the US, UK, Canada, Russia, Australia and more!<br/>- FEATURED on the App Store in more than 100 countries<br/>- FEATURED in 25 BEST FREE GAMES on the App Store<br/><br/>\"Fantastic on so many levels\" – Capsule Computers, 85%<br/><br/>\"A stellar follow-up to Puzzle Craft that manages to feel both familiar and fresh\" – Gamezebo, 4/5<br/><br/>\"A brilliant change of pace for puzzle games\" – Apple 'N' Apps, 4/5<br/><br/>\"A perfect mix of mini-games with a detective atmosphere\" – Apptual Gamer.<br/><br/>This city is clamping down on candy cravings by outlawing sweet snacks! Solve a series of quirky cases by gathering clues, tracking down witnesses, and questioning suspects to reveal the truth behind this city’s sugarcoated secret.<br/><br/>This is a case too sweet to turn down!<br/><br/>Awesome Features<br/>• Create your own personalized detective and customize their look with outfits, props, and more.<br/>• Match clues, identify suspects, track down hidden items – Another Case Solved features multiple styles of gameplay to keep detectives on their toes.<br/>• Tons of story-driven cases to keep you hooked into this sugary sweet mystery.  <br/>• Take on minor cases in your spare time to keep yourself in business.<br/>• Transform your humble office into a vibrant workplace with new furniture that will increase your detective skills.<br/>• Join the Detective Club and share your progress and achievements with friends via Facebook.<br/><br/>Visit the Chillingo room on the App Store to see more of our great games: appstore.com/chillingo<br/><br/>Important Consumer Information. This app: Requires acceptance of EA’s User Agreement.<br/>EA’s Privacy &amp; Cookie Policy applies. Collects data through third party ad serving and analytics technology (see Privacy &amp; Cookie Policy for details). Contains direct links to the Internet and social networking sites intended for an audience over 13. Allows players to communicate via Facebook notifications and gifting. To disable see the settings in-game.<br/><br/>Terms of Service : http://terms.ea.com/en<br/>Privacy &amp; Cookie Policy : http://privacy.ea.com/en<br/>EULA : http://tos.ea.com/legalapp/mobileeula/US/en/OTHER/<br/>Visit https://help.ea.com/en-gb/another-case-solved/another-case-solved for assistance or inquiries.<br/><br/>EA may retire online features and services after 30 days notice posted on www.ea.com/1/service-updates", "metacritic": null, "released": "2014-02-20", "tba": false, "updated": "2019-07-30T03:24:38", "background_image": "https://media.rawg.io/media/screenshots/2f5/2f5f89b68bbc14d151b0a129c1fd0b04.jpg", "website": "https://chillingosupport.zendesk.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 183, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "Android"], "developers": ["Noodlecake Studios", "Electronic Arts Chillingo"], "genres": ["Adventure", "Puzzle"], "publishers": ["Chillingo"], "esrb_rating": "Everyone 10+"}