{"id": 14296, "slug": "lucid-trips", "name": "Lucid Trips", "name_original": "Lucid Trips", "description": "Lucid Trips is a VR experience which takes places in planetary dream worlds. You explore an artistically designed surrounding with a completely new concept, defining and navigating your avatar in a distinctive way, using hand motion controllers. You float and fly as a bodyless consciousness with two ghost-like arms.<br/><br/><strong>Current content</strong><br/>● Unique  locomotion - No teleport nor room scale<br/>● Immersive feeling of weightlessness and flying (Jetpack like)<br/>● Tutorial &amp; trainings &amp; exploration<br/>● Physically based climbing locomotion<br/>● One planetary game world to explore (more will come)<br/>● Asynchronous multiplayer (Hide, leave trace, seek...) <br/>● An artwork from DAIM to discover<br/>● Speed flight user challenge (Arcade)<br/><br/><strong>Near future content</strong><br/>● At least two more planets to explore<br/>● More stuff to play around with<br/>● Swimming locomotion<br/>● +-10 singleplayer missions on each planet<br/>● More power ups for flying<br/>● Artworks from artist like Low Bros, Neo Rauch, Gero Doll...<br/><br/><strong>Far future content</strong> (probably not within Early Access)<br/>● More planets <br/>● Level editor<br/>● Different game modes<br/><br/><strong>Press:</strong><br/>Ben Lang from Road to VR:<br/>“The Fearless Creativity of ‘Lucid Trips’ is Exactly What VR Needs to Thrive”<br/><br/>Joe Durbin from Upload VR<br/>“Lucid Trips’ Provides The Most Freedom I’ve Ever Felt In VR”<br/><br/>----------------------------------------------------------------------------------------------<br/>Warning:<br/>1.) Lucid Trips is based on an experimental locomotion concept which can cause discomfort for some people. There is a comfort level which you can turn up and down by clicking right and left on the touchpad. 7 is maximum comfort with max particles in your view and vignette reaction. If you use Rift please steer to either site and press the thumb button to change the comfort level. Max recommended playtime for beginners 15 min.<br/><br/>2.) Since this is a 'sitting experience' Steam VR will fade out the Chaperone automatically after some seconds.Please be aware of this when playing standing.<br/>----------------------------------------------------------------------------------------------<br/><br/>v.06<br/><br/>Known bugs:<br/><br/>When creating challenges for other players this mode still has some bugs. Hiding gems sometimes won’t work properly. (f.e. No gems in Inventory, no “place here” area projected) <br/><br/>If you haven’t recentered yourself with pressing and holding the menu button the game menu sometimes shows up with a wrong orientation to you. Please always recenter first. <br/><br/>Slightly decreased performance when using Oculus Rift &amp; Touch via Steam compared to HTC Vive.<br/><br/>Some physic bugs/anomalies.<br/><br/>Occasionally crashes in SteamVR menu if Vive camera is activated.<br/><br/>The Chaperone disappears when using Vive with a sitting or standing experience. We show a warning every time you recenter so you remember and make sure you avoid hurting yourself or your hardware. (This is not a bug)", "metacritic": null, "released": "2017-01-12", "tba": false, "updated": "2019-08-28T22:12:13", "background_image": "https://media.rawg.io/media/screenshots/665/665c22452a9ead230367eaaddae68db9.jpg", "website": "http://www.lucidtrips.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 12, "beaten": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 314, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["VR Nerds", "Nico Uthe, Sara Lisa Vogl, Julian Heinken"], "genres": ["Adventure", "Indie"], "publishers": ["VR Nerds", "Sara Lisa Vogl"], "esrb_rating": null}