{"id": 1430, "slug": "the-final-station", "name": "The Final Station", "name_original": "The Final Station", "description": "<p>The Final Station is an action-adventure game developed by Do My Best Games.</p>\n<h3>Plot</h3>\n<p>It is 2059, 134 years after the First Visitation when UFOs crashed on Earth and began infecting humans creating zombies. With many countries destroyed, humankind was able to repel the attack at a large price. A united government is formed, migration to unaffected regions takes place. Life slowly comes back to normal. Railroads become the main transportation method, connecting the last remaining cities. The unnamed main character works as a train driver. After he finished the delivery of special cargo, the Second Visitation begins. </p>\n<h3>Gameplay</h3>\n<p>The Final Station is a two-dimensional pixelated game that focuses on survival and resource management. The main objective of The Conductor is to reach his home to protect his daughter. The players arrive at numerous stations on their journey to look for fuel, food, and ammunition. The survivors of the Visitation can also be found at the station and be taken with you on the train.</p>\n<p>While the players travel to other stations, they can interact with the survivors they had picked up. They may request food, medicine or offer a quest upon talking to them. These survivors will walk off your train when they reach their destination. </p>\n<h3>The Only Traitor DLC</h3>\n<p>A DLC was released for the game. It offered a different plot perspective, new enemies and instead of driving a train, the main character drives a car.</p>", "metacritic": 76, "released": "2016-08-29", "tba": false, "updated": "2024-03-13T20:18:47", "background_image": "https://media.rawg.io/media/screenshots/acb/acb4f324aeb126cf5816ea0f4a9d8325.jpg", "website": "http://thefinalstation.com", "rating": 3.85, "rating_top": 4, "added_by_status": {"yet": 97, "owned": 1600, "beaten": 243, "toplay": 53, "dropped": 61, "playing": 8}, "playtime": 4, "achievements_count": 67, "ratings_count": 327, "suggestions_count": 262, "game_series_count": 0, "reviews_count": 331, "platforms": ["Xbox One", "PlayStation 4", "Nintendo Switch", "PC", "Linux", "macOS"], "developers": ["tinyBuild", "Do My Best", "Andrey Rumak", "Oleg Sergeev"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["tinyBuild"], "esrb_rating": null}