{"id": 14318, "slug": "demented-pixie", "name": "Demented Pixie", "name_original": "Demented Pixie", "description": "Fairies, Pixies, Sprites… many names have been given to the Fair Folk. Born of magic, and magic themselves, they raised the greatest of civilizations, the City of the Wailing Lights. But even with almost limitless power they fear one thing above anything else: Madness.<br/>Demented Pixie is a blend between twin-stick shooters and roguelikes with unique visuals and ambientation, packed with content, in which nothing is what it looks like…<br/><br/><br/>Explore the randomly generated dungeons in search of the keys and portals that will allow you to advance, carefully evading the myriad of traps and enemies that surround you. Make use of every magical item you find to your own advantage and make your magical powers evolve by equiping marked pieces. Fight bosses in an spectacle of ever-shifting light and darkness.<br/><br/><br/>Fairies, Pixies, Sprites… many names have been given to the Fair Folk. Born of magic, and magic themselves, they raised the greatest of civilizations, the City of the Wailing Lights. But even with almost limitless power they fear one thing above anything else: Madness.<br/>A Pixie with a shattered mind has unrestrained, chaotic powers, and so any one of them showing the slightest hint of insanity would be locked away for an eternity. Legend has it that in the deepest, darkest dungeon lies the most powerful one.<br/>Now it tries to escape again, with sanity as its guide, and madness as its weapon.<br/><br/><br/><ul><li>Unique light-centric crystal-like graphic style.<br/></li><li>Haunting music by Audioboy.<br/></li><li>Explore ever-changing levels.<br/></li><li>Permadeath is always active, do anything to survive!<br/></li><li>Use esoteric items and powers.<br/></li><li>Your powers change with any combination of marks you happen to find. Endless possibilities!<br/></li><li>Bend your mind as you try to make the best out of your equipment in its unique jigsaw-like equipment menu.<br/></li><li>Fight large amounts of pixies hell bent on stopping the demented one… or other insane inmates rampaging around.<br/></li><li>Lots of powerful bosses randomly chosen for each level.<br/></li><li>Discover more about this magical world by collecting library entries.<br/></li><li>Unlock more content as you complete multiple different, branching levels and endings.<br/></li><li>Can play with keyboard and mouse, keyboard alone, or gamepad.<br/></li><li>Find secrets that will push you to your limit…</li></ul><br/><br/>This game won't hold your hand. Sometimes a shrine will curse your equipment, some mark combinations prove less effective than their separate components, sometimes you get trapped in a room full of enemies or a unidentified magic scroll halves your remaining health. There are secret paths with strange requeriments and you have to choose your perks wisely. There's always a way out, but sometimes it won't be evident. Enjoy the madness.", "metacritic": null, "released": "2016-12-14", "tba": false, "updated": "2019-08-28T22:12:12", "background_image": "https://media.rawg.io/media/screenshots/5fd/5fda513b233e58b2ed812e3b1de7113f.jpg", "website": "http://molegato.com/demented_pixie/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 38, "toplay": 1, "dropped": 1}, "playtime": 4, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 223, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "Linux"], "developers": ["Molegato"], "genres": ["RPG", "Strategy", "Indie"], "publishers": ["Molegato"], "esrb_rating": null}