{"id": 14324, "slug": "shout-of-survival", "name": "Shout Of Survival", "name_original": "Shout Of Survival", "description": "What is Shout Of Survival?<br/>A multi-player SHOUTING (not Shooting) game where 2 monsters hunt down 2 humans that are trying to reunite.<br/><br/><br/><br/>In the darkness with minimum vision, Humans shout out to each other. They will know their corresponding location by hearing and following the sound direction.<br/><br/>However! The monsters will also hear them and will run to the humans before they reunite as they can also hear them.<br/><br/>The Monsters have a constant scary sound ongoing, so humans will be able to hear monsters incoming and will be able to also assess the direction from their scary sound.<br/><br/>The Monsters have a special ability where they can HIDE their voice for few seconds, AND THIS IS WHERE IT IS FUN for the monsters. As soon as they think they are approaching a human, they can hide their sound and close in to the humans to give them the scare (and death) or their lives!Where did this project come from?<br/>Shout of Survival is based on our critically acclaimed game jam winner (Reunion). Even YouTubers like Markiplier played our original game and had positive feedback.  After observing the positive vibe that Reunion generated, it was clear that a game about hearing works very well.  As a result, we decided to take it to the next step.<br/><br/><br/><br/>Shout Of Survival Features<ul><li>Unique gameplay that focuses on sound. Better use your headphones!<br/></li><li>Different playstyles as a human and a monster. Being the hunter is always different than being hunted!<br/></li><li>Easy to learn gameplay. Learn the controls and start playing right away!<br/></li><li>Online Multiplayer: Play with random people from all over the world.<br/></li><li>Play with friends: Or you can play with your friends by inviting them to your matches.</li></ul>Quotes\"Unprecedented experience! This game could easily start a new addictive, fun, and rewarding genre\"<br/>- Joseph Shomali @josephshomali Co-founder at Play 3arabi (Game Publisher)<br/><br/>“I can’t remember the last time I enjoyed a party game this much. It made me laugh so hard.”<br/>- Moayad Taibah @MoayadT (Gamer)<br/><br/>“It is one of those just-one-more-round game.”<br/>- Ahmad Al-Saleh @Ams680 (Gamer)<br/><br/>“Hilariously unsettling.”<br/>- Feras Al-Haidari @AlhaidariFeras (Gamer)", "metacritic": null, "released": "2016-07-20", "tba": false, "updated": "2019-08-23T12:12:35", "background_image": "https://media.rawg.io/media/screenshots/750/75007de7c75d330d9327d201f2a3ea59.jpg", "website": "http://www.shoutofsurvival.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 19}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 329, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Hako Games"], "genres": ["Strategy", "Casual", "Indie"], "publishers": ["Hako Games"], "esrb_rating": null}