{"id": 14327, "slug": "potions-a-curious-tale", "name": "Potions: A Curious Tale", "name_original": "Potions: A Curious Tale", "description": "Growing up is hard, and it’s even harder when you’re a witch! As Luna, you’ll solve devious puzzles and battle monsters with your arsenal of mystical potions. With a little help from your grandmother (a powerful witch in her own right) and Helios, your sharp-tongued cat familiar, you’ll explore enchanted lands inspired by your favorite fairy tales – often with an unexpected twist! <br/><br/>As powerful as your potions are, you’ll find yourself up against monsters that can shrug off your most powerful attacks. You’ll have to think on your feet and act quickly to sidestep danger. Manage your resources carefully, or you may find yourself with an empty satchel when you need your elixirs most.Key Features•\tQuirky storyline <br/>•\tDeep crafting system that rewards experimentation <br/>•\tConflict resolution that goes beyond pure combat<br/>•\tStrategic combat—use potions, the environment, and even other monsters to defeat your enemies<br/>•\tRich characters from folklore around the world – all with a unique spin<br/>•\tCountless environments to adventure and search for rare ingredients<br/>•\tResource management, with a vast number of potions and ingredients<br/>•\tLuna—Your resident witch-in-training and strong, female lead<br/>•\tBeautiful, illustrated art style reminiscent of your favorite storybooks and animated tales", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T22:12:12", "background_image": "https://media.rawg.io/media/screenshots/5c9/5c94822d66c44e58ee1a42f58c5d9964.jpg", "website": "http://www.potionsacurioustale.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 240, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Stumbling Cat"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["Stumbling Cat"], "esrb_rating": null}