{"id": 14348, "slug": "dying-light-the-following-enhanced-edition", "name": "Dying Light: The Following - Enhanced Edition", "name_original": "Dying Light: The Following - Enhanced Edition", "description": "<p>Dying Light series introduces a world that was hit by a zombie virus outbreak. Under the daylight, zombies are weak and slow, but after the sunset, they become fast, strong and hungry for human flesh. You play as Kyle Crane, a special operative sent to the Harran city, which became a quarantined zone after the outbreak. In the expansion pack The Following, he learns about a cure for the plague, supposedly invented by a sect, and sets off to find out more about it. Crane will travel the countryside open world that is twice the size of the original game’s map. To fight off zombies, Crane will use not only a variety of weapons but also parkour movements, which are the definitive feature in Dying Light gameplay.<br />\nThe Following introduces new weapons, several new game modes, such as bounty hunting which gives the player a new mission every day. The expansion allows the player to drive a buggy to run zombies over. There is a four-person multiplayer mode, and also the “Be the Zombie” mode, in which players can assume the role of a huge, powerful zombie. The Enhanced Edition includes the original game, the expansion pack, and all the available DLCs, such as Cuisine &amp; Cargo and The Bozak Horde.</p>", "metacritic": 87, "released": "2015-01-26", "tba": false, "updated": "2024-04-18T17:36:22", "background_image": "https://media.rawg.io/media/games/c11/c11a0b92b4c28f2e0db489f430142653.jpg", "website": "http://www.dyinglightgame.com/", "rating": 4.13, "rating_top": 4, "added_by_status": {"yet": 241, "owned": 4868, "beaten": 802, "toplay": 109, "dropped": 269, "playing": 77}, "playtime": 17, "achievements_count": 67, "ratings_count": 1034, "suggestions_count": 686, "game_series_count": 0, "reviews_count": 1041, "platforms": ["macOS", "Xbox One", "PlayStation 4", "PC", "Linux"], "developers": ["Techland"], "genres": ["Action", "RPG"], "publishers": ["Techland Publishing", "Techland"], "esrb_rating": null}