{"id": 1434, "slug": "air-supply-1bit-run", "name": "Air Supply - 1bit Run", "name_original": "Air Supply - 1bit Run", "description": "*** Your AIR is running out! ***<br/>Ambushed on a standard trade journey between Lave and Diso, Spaceman Sam is shot down by pirates!<br/><br/>Now, stranded on an alien Moon, Sam must run for his life, avoiding meteorites, fearsome UFOs and enemies such as robots, aliens, and Space Monkey Zombie Pirate Cyborgs(!), hoping in vain to stay alive long enough to be rescued!<br/><br/>Featured in &amp;quot;What we&amp;#39;re Playing&amp;quot; in 10 stores worldwide including the US! :D<br/><br/>Featured in New and Noteworthy - overall games! <br/><br/>Also featured in New and Noteworthy Arcade/Action!<br/><br/>Pocketgamer.co.uk says: <br/>&amp;quot;It&amp;#39;s fast, familiar, and fun, giving you everything you want in an endless runner... Air Supply has enough charm and good content to make stand with the best endless running games&amp;quot;<br/><br/>allaboutthegames.co.uk says:<br/>&amp;quot;For a game that&amp;#39;s supposed to represent a quick ten minute blast, it&amp;#39;s surprising how easy it is to soak up hour after hour playing Air Supply.&amp;quot;<br/><br/>arcadelife.co.uk says:<br/>&amp;quot;Air Supply gets it SO right it’s frightening! [...] It’s your new favourite running game – you just don’t know it yet.&amp;quot;<br/><br/>technobrains.com says:<br/>&amp;quot;If you do not own this gem yet, go out and buy it now.&amp;quot;<br/><br/>iPhoneGamerUK says:<br/>&amp;quot;Fun,addictive with supercool retro music and grafix with plenty of that one more go gameplay&amp;quot;<br/><br/>Killscreen says:<br/>&amp;quot;This is a just game. You can jam on it.&amp;quot;<br/><br/><br/>How awesome is that? Thank you! :D<br/><br/>Features:<br/><br/>*Pure awesome gameplay: Run, jump, shoot, collect!<br/>*Air Supply game mechanic - your air is constantly going down - pickup 02 canisters to increase it and keep yourself alive!<br/>*Gorgeous Retina Display 1bit graphics in glorious black and white!<br/>*Cosmic 1bit music by Mr. Beep, made using a ZX Spectrum! Eight tracks to unlock! <br/>*GameCentre Leaderboards! How far can you run? :D<br/>*Grab powerups! Slow down your speed, grab a full tank of air, or protect yourself with shields!<br/>*Gain ranks based on kills - from &amp;#39;Harmless&amp;#39; to the coveted title of &amp;#39;Elite&amp;#39;.<br/>*Unlock everything! Play the game to unlock new characters, backgrounds, enemies, music and even colour!<br/>*Special Guest appearances!<br/>*18 Achievements to attain!<br/>*NO IAP or Adverts! :D<br/>*Amazingly addictive - just ask our players, or those that have reviewed the game! :D<br/><br/><br/>**How long will you last before your Air Supply runs out???**<br/><br/><br/>*note - this game is recommended for iphone 3GS and above, as well as 3rd gen ipods and above. While the game runs fine on older devices, load times are sometimes very long :( We&amp;#39;ll try and address this issue in an update. Thank you for your patience and support!*", "metacritic": null, "released": "2011-03-04", "tba": false, "updated": "2019-10-22T14:27:43", "background_image": "https://media.rawg.io/media/screenshots/75f/75f6cc5660b625a7fc9b5264a58e6c95.jpeg", "website": "http://quantum-sheep.com/iphone-games/air-supply/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 68, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Quantum Sheep"], "genres": ["Action", "Arcade"], "publishers": ["Quantum Sheep"], "esrb_rating": "Everyone 10+"}