{"id": 14346, "slug": "simcity-4-deluxe-edition", "name": "SimCity 4 Deluxe Edition", "name_original": "SimCity 4 Deluxe Edition", "description": "<p>SimCity 4: Deluxe Edition is a city building simulator developed by Maxis.</p>\n<h3>Deluxe Edition features</h3>\n<p>Deluxe Edition features the base game and Rush Hour expansion pack.</p>\n<h3>Gameplay</h3>\n<p>The player becomes the mayor of a small town. Use terraforming to create a convenient building area or a unique landscape. Players are able to divide the town&#39;s areas into special areas: commercial, industrial, and residential. You also have to create a social policy, a transportation system and improve the quality of life for your residents. </p>\n<p>The players are able to choose any area available for building a new city. It is possible to create several cities near each other. </p>\n<h3>Game modes</h3>\n<p>There are three game modes present in the game: God Mode, Mayor Mode, and Sim Mode.</p>\n<p>In God Mode, the players build a new city and are able to inflict natural disasters upon it such as earthquakes or volcano eruptions. It is possible to choose the exact spot where the disaster will take place. </p>\n<p>Mayor mode is endless. You take part in creating a city, maintaining it, and facing the typical city problems, such as the migration of its population or the drop in income per household. The game emulates the world&#39;s economy, financing, and city development.</p>\n<p>While in Sim Mode, the player creates a sim, which will live in a player-built city. You can&#39;t control the sim apart from choosing where will they live. The sims go through their whole life. After death, their relatives will take their place.</p>", "metacritic": null, "released": "2010-07-20", "tba": false, "updated": "2023-09-02T12:54:24", "background_image": "https://media.rawg.io/media/screenshots/238/23827608952b34ed8f69c6bc3e4f6678.jpg", "website": "http://www.simcity.com/product/simcity4", "rating": 3.9, "rating_top": 4, "added_by_status": {"yet": 67, "owned": 1716, "beaten": 91, "toplay": 13, "dropped": 80, "playing": 5}, "playtime": 2, "achievements_count": 0, "ratings_count": 162, "suggestions_count": 457, "game_series_count": 0, "reviews_count": 164, "platforms": ["iOS", "PC", "macOS"], "developers": ["Aspyr Media", "Electronic Arts Maxis"], "genres": ["Strategy", "Simulation"], "publishers": ["Electronic Arts", "Aspyr"], "esrb_rating": "Everyone"}