{"id": 14358, "slug": "wobbly-jungle", "name": "Wobbly Jungle", "name_original": "Wobbly Jungle", "description": "Wobbly Jungle looks incredibly sweet, but it will drive you to the brink of insanity! That's because in Wobbly Jungle the wolf's in sheep's clothing – erm, sorry... in Sina's enemies!<br/>You have to survive 60 challenging levels that will demand everything from you. The sweet look is actually crystal clear camouflage, as a variety of enemies and obstacles lie in wait. Are you ready to face this challenge? Only those who demonstrate perfect timing and fast fingers stand any chance at all – true to the motto <strong>\"SURVIVAL OF THE FITTEST!\"</strong><br/>In addition to the 60 increasingly difficult and varied levels, lots of challenging enemy types await you, as well as a rewarding \"surprise\" at the end. Some enemies can be defeated; others you're probably better off avoiding – preferably without stumbling right into the next trap.<br/><br/><ul><li><strong>Varied and exciting:</strong> 60 challenging levels await you<br/></li><li><strong>Gleeful:</strong> See where other players died and leave them behind you<br/></li><li><strong>Challenging:</strong> Whether or not you finish the level is entirely in your hands<br/></li><li><strong>Smart and forward-looking:</strong> Many enemies lie in wait – it's probably best to avoid them.<br/></li><li><strong>Confrontational:</strong> Compare your skills with those of your friends with the level summary</li></ul>", "metacritic": null, "released": "2016-04-14", "tba": false, "updated": "2019-08-28T22:12:11", "background_image": "https://media.rawg.io/media/screenshots/f49/f4914723e27b9a802b20d125c8ebfef9.jpg", "website": "http://www.wobblyjungle.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 53}, "playtime": 4, "achievements_count": 12, "ratings_count": 0, "suggestions_count": 186, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Sourena Game Studio"], "genres": ["Indie"], "publishers": ["bitComposer Interactive"], "esrb_rating": null}