{"id": 14367, "slug": "den-vanstra-handens-stig", "name": "Den vänstra handens stig", "name_original": "Den vänstra handens stig", "description": "Den vänstra handens stig is a videogame with an experimental narrative that focuses on courage, determination and sacrifice.<br/><br/>Den vänstra handens stig challenges the players preconceived notion of narrative in videogames. Featuring a one-button controller that takes a sacrifice upon interaction (controller available separately), Den vänstra handens stig is an age-old tale born anew in digital form.Features<br/><ul><li>Experience the journey of an AI on it’s mission to complete one last quest.<br/></li><li>Experimental narrative<br/></li><li>Sacrificial interactions<br/></li><li>Black metal soundtrack</li></ul>Videogame<br/><ul><li>Witness ultimate courage and perseverance as the protagonist conquers insurmountable challenges to find the ultimate freedom.<br/></li><li>Adventures will take the protagonist through multiple routes and precarious routes. Destiny awaits those that don’t give up.<br/></li><li>Take control of the protagonists destiny and deny them free will.</li></ul>Soundtrack<br/>Black metal stimulus guides the narrative through dense textures of despair, solitude and ultimately – hope.Controller<br/><ul><li>Bear the weight of the protagonist and perform your own sacrifice<br/></li><li>Can you stop the inevitable from occurring? Do you have what it takes?<br/></li><li>Please note: Controller available separately. Game also supports XBOX 360, XBOX ONE, and all XInput and DirectInput gamepads</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T22:12:10", "background_image": "https://media.rawg.io/media/screenshots/aeb/aeb7bfd9d3543314f2ea4cdc97403b3b.jpg", "website": "http://denvänstrahandensstig.se", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 87, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Newmark Software"], "genres": ["Adventure", "Indie"], "publishers": ["Newmark Software"], "esrb_rating": null}