{"id": 14379, "slug": "jips", "name": "JiPS", "name_original": "JiPS", "description": "<strong>Cool Game for the whole Family!</strong><br/>Classic Jigsaw Puzzle Game with 30 stunning pictures of sea scenery with sailing warships of various ages and countries - from state-of-the-art Western Frigates and Ships-of-the-line to legendary Korean Kobuksons (turtle ships) and Chinese War Junks. Each scene can be solved in 3 different modes, suitable for all puzzle-lovers. Moreover, the game comes with a backstory - an impressive visual novel about risky journey of a Venetian adventurer for the lost treasure.Backstory<br/>From the letter of one Venetian adventurer... <br/><br/>\"After many years of perilous travels full of hardships and dangers, I was comforted with the knowledge that I was returning home with priceless cargo...but now we are all prisoners and are at the mercy of hateful Pirates. My priceless cargo, that to them is nothing but a pile of worthless papers, unfortunately caught their leader’s attention. All my attempts to explain the value of my scrolls were met with jeers and laughter from these uneducated Barbarians. For the sake of sadistic enjoyment derived from my torments, they cut into pieces all of my precious papers.\" <br/><br/>The note continues... <br/><br/>\"Praise Be to the Lord, it had not occurred to anyone setting fire to them in the process. Even in such disarray, I take comfort from knowing the scrolls are not lost to me until the end of time. Reflecting on all those ordeals that I had to undergo in order to collect each of these gems, and to think that in the blink of an eye these savages could have easily destroyed them all.\" <br/><br/>And then the letter concludes... <br/><br/>\"I have managed to gather all of the scraps with the hope of preserving them for future generations. If you are reading this message, it makes my heart glad that they have made it to the safety of your keep. Please restore these records as I have indicated, and share their vast knowledge with the world...\"", "metacritic": null, "released": "2016-04-19", "tba": false, "updated": "2019-08-28T22:12:10", "background_image": "https://media.rawg.io/media/screenshots/949/949a0e617c0f3ef70ba624c775015b9e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 38, "playing": 1}, "playtime": 4, "achievements_count": 7, "ratings_count": 1, "suggestions_count": 248, "game_series_count": 0, "reviews_count": 1, "platforms": ["macOS", "PC"], "developers": ["Trazzy Entertainment"], "genres": ["Simulation", "Casual", "Indie"], "publishers": ["Trazzy Entertainment"], "esrb_rating": null}