{"id": 14380, "slug": "revenge-of-roger-rouge", "name": "Revenge of Roger Rouge", "name_original": "Revenge of Roger Rouge", "description": "Navigate a tale as unpredictable as the seas in this shoot-em-up arcade that will blow you away! Vibrant visuals and oldschool gameplay collide to provide a shoot em’ and loot em’ adventure you won’t want to miss. Pursue a legendary adversary across Caribbean waves, Asian thunderstorms and the deceptive calm of the Sargasso Sea. Can you send hordes of skeleton boats, turtle ships and great warships to Davey Jones while chasing visions of riches and revenge?<br/><br/><br/><strong>Key features:</strong> <br/><strong>Dynamic gameplay </strong>– shoot’em, loot’em and don’t forget to keep maneuvering! <br/><strong>Simple control </strong>– just move and fire, no complicated combinations and menus. <br/><strong>Storyline</strong> - Vivid storyline with unexpected twists and turns. <br/><strong>Lots of various enemies</strong> - you will encounter very different enemies, from whaleboats to turtle ships, from tiny junks to most massive sailing warships ever built. <br/><strong>Bosses</strong> - Three completely different “bosses” present intense challenges. <br/><br/>Twelve wonderful seas in three regions – from the azure Caribbean waves to harsh northern waters, from the Asian thunderstorms to deceptive calm of the Sargasso Sea.", "metacritic": null, "released": "2016-04-22", "tba": false, "updated": "2019-08-28T22:12:10", "background_image": "https://media.rawg.io/media/screenshots/a7d/a7d40479750c82f66a4a5d8da3d89d69.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 51}, "playtime": 4, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 273, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Trazzy Entertainment"], "genres": ["Action", "Simulation", "Casual", "Indie"], "publishers": ["Trazzy Entertainment"], "esrb_rating": null}