{"id": 14393, "slug": "rotation-phonology-break", "name": "Rotation Phonology: Break", "name_original": "Rotation Phonology: Break", "description": "<strong>Rotation Phonology: Break</strong> is a simple RPG game, telling a story about overturn the government’s wrong decision.StoryHeroes receive a request from another dimension, someone in a world called Break Kingdom asking for help. The quest is simple, helps those citizens to overthrow the draconian laws. It is simple for anyone, right? Anyway our heroes begin the journey to solve the issues for goodwill.StageStory divided in stage and section, the team walk through map to reach the destination.<br/>During In the map, choose the path with advantage, collect resources, raise status bonus and fight with who standing in front of the way, those evil force.BattleAs evil stands on the way, heroes have no choice but fight.<br/>Enemies stand in the battlefield and they are numerous, but our heroes are full of experience, three is enough. Control three members in the battle to overcome all challenge, which are<br/><ul><li>Attacker: Stand in front of the battlefield to fight the enemies directly.<br/></li><li>Defense line: A leader with a group of helpers hold the defense line for continuous fight.<br/></li><li>Supporter: Stand in the back and casting spell for battle advantages.</li></ul>ManagementAfter each section, power up the team from the resources collected from map, and be prepared well for next adventure. You can use the collection as:<br/><ul><li>Level up heroes.<br/></li><li>Power up collections and bring to the battle for status boost.<br/></li><li>Adjust members’ attribute, take advantage status in combat.<br/></li><li>Raise skills level and train up with additional strength.</li></ul><br/>Prepared well, go to the destination, find out the root of the trouble, and finish the quest in heroic way.", "metacritic": null, "released": "2017-01-22", "tba": false, "updated": "2019-08-28T22:12:10", "background_image": "https://media.rawg.io/media/screenshots/a63/a6308ed3599bb9fa71eb2384d531c240.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 302, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ButterChain"], "genres": ["RPG"], "publishers": ["ButterChain"], "esrb_rating": null}