{"id": 143933, "slug": "reverie-itch-rodolink", "name": "Reverie (itch) (Rodolink)", "name_original": "Reverie (itch) (Rodolink)", "description": "Premise\r\n<p>The final project for my Master thesis in the Cologne Game Lab an institute from the THKöln.</p>\n<p>More than a game is an immersive digital experience which works as a metaphorical representation of the inner workings of the concept of nostalgia in our minds.</p>\n<p>The game views the emotional relationship between the player and the environment, trying to elicit nostalgia through a socio-psychological and neuro-scientifical standpoint.</p>\n<p>For more information please don't be afraid to contact me.</p>\n\r\nThe \"game\"\r\n\n<p>A first-person perspective experience where you explore a land that works as a metaphor for the emotional state of the mind during a nostalgic reverie. The land is in turmoil until you find \"temples of time\" that can be activated using personal memories, thus turning the environment into a calm pleasant one no longer in turmoil.</p>\n<p>Explore the land and try to find the temples, inside you will find various elements that might trigger your imagination and memories.<br/></p>\n\n<p>Also in the end you might be able to find some extra secrets ;)<br/></p>\n<em>Disclaimer: It is important in order to enjoy the experience the best way that when you are prompted to write  a \"nostalgic memory\", to bring this\r\nnostalgic events to mind, and immerse yourself trying to think for a\r\ncouple of minutes on how it makes you feel</em>.\r\n\r\nControls\r\n<p>w,a,s,d - movement.</p>\n<p>mouse - camera look.</p>\n<p>shift - move faster.</p>\n<p>c - crouch.</p>\n<p>mouse click - interact with certain objects.</p>\n<p>keyboard - you will be prompted to write somewhere using your real keyboard, to finish texting, press the enter key.<br/></p>\n<p>Esc - Will open the controls window in-game.</p>\n<p>EXTRA: not recommended the first play-through but you can activate a \"debug-mode\" when pressing the F12 key.</p>\n\n<p><strong>If you try it and enjoy it, I thank you in advance.<br/></strong></p>\n\n<p>All external assets rights are documented in the readme file. <br/></p>", "metacritic": null, "released": "2018-08-20", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/543/543fa01ff3700acc1d56fe27cdf516f8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 206, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Rodolink"], "genres": [], "publishers": [], "esrb_rating": null}