{"id": 14391, "slug": "nuclear-dawn", "name": "Nuclear Dawn", "name_original": "Nuclear Dawn", "description": "<p>Nuclear Dawn is a multiplayer first-person shooter developed by InterWave Studios. It was initially announced as a Source Engine mod but was later made as a separate game.</p>\n<h3>Plot</h3>\n<p>World War 3 broke out on January, 22nd 2040. The war was fought with the devastating nuclear armament of the 20th century. Nanoviruses annihilated whole cities and machines roamed their streets. It is 2049, the war still continues, and those who survived are now parts of the Consortium or the Empire.</p>\n<h3>Gameplay</h3>\n<p>The players compete with each other in 16 versus 16 matches. There is one commander chosen in both of these teams. A commander places objective for their team on the map, places checkpoints, builds up defenses and supports their team by calling in a scout UAV.</p>\n<p>All the other players are usual soldiers. There are four soldier classes available to the players with each class having its own purpose.</p>\n<h3>Classes</h3>\n<p>Assaults serve as perfect middlemen, who are capable of everything but are not perfect in it. They can be seen carrying an AR, a grenade launcher or a DMR.</p>\n<p>Exos are slow-moving but deadly. They can lock their exosuits down in place in order to drastically improve their accuracy. They&#39;re fond of chainguns.</p>\n<p>Stealths are fast, agile, but have almost to none armor and ammo. They use SMGs and sniper rifles.</p>\n<p>Supports are a must on the battlefield. Although they are lightly armored, they can revive downed soldiers and do repairs. SMGs are their pick.</p>", "metacritic": 71, "released": "2011-09-25", "tba": false, "updated": "2024-01-28T10:47:22", "background_image": "https://media.rawg.io/media/screenshots/ef3/ef39987b6340de4215f229852b832bdd.jpg", "website": "http://www.gameconnect.net/projects", "rating": 2.72, "rating_top": 3, "added_by_status": {"yet": 43, "owned": 1136, "beaten": 12, "toplay": 6, "dropped": 31, "playing": 2}, "playtime": 3, "achievements_count": 58, "ratings_count": 61, "suggestions_count": 494, "game_series_count": 0, "reviews_count": 61, "platforms": ["PC", "Linux", "macOS"], "developers": ["InterWave Studios", "GameConnect"], "genres": ["Action", "Strategy"], "publishers": ["Iceberg Interactive"], "esrb_rating": null}