{"id": 1440, "slug": "midnight-star", "name": "Midnight Star", "name_original": "Midnight Star", "description": "The most anticipated mobile shooter is here!<br/><br/>Midnight Star is an epic sci-fi shooter designed from the ground up for mobile. Build your arsenal, develop your skills and compete against thousands of other players online! ***Supports iPhone 4s+ and iPad 2+.***<br/>______________________________________________<br/><br/>Set 120 years into our future, Midnight Star takes players aboard the MSRV-Joplin, a research vessel newly outfitted with military weaponry to explore a mysterious signal coming from within our Solar System. When disaster strikes, they&amp;#39;re transported across the universe to take part in an epic war whose outcome will determine the fate of humanity... <br/><br/><br/>&amp;quot;A sci-fi mobile shooter that is light years ahead of its competition.&amp;quot; - Gamezebo<br/>&amp;quot;A fast-paced and engaging shooter that looks stunning.&amp;quot; - Pocket Gamer<br/>&amp;quot;An incredibly satisfying experience.&amp;quot; - GamesBeat<br/>&amp;quot;This, folks, is how you make a shooter for mobile devices.&amp;quot; - GrabIt Magazine<br/>&amp;quot;It&amp;#39;s first-person shooting boiled down to the tastiest morsels&amp;quot; - Polygon<br/><br/>As 2nd Lt. Charles Campbell, players will encounter deep space, a strange alien landscape and a war that has long since been lost. Using the clues left to him, the crew that supports him, and a TON of awesome guns, Charlie must develop from modest exocommunications specialist to the one human being left with the chops to take down the bad guys!<br/><br/>==FEATURES==<br/>• MASTER the most dizzyingly intense action shooter for mobile devices ever!<br/>• UPGRADE everything - guns, skills, your ship, even your luck!<br/>• UNCOVER ancient races whose fates are woven together with ours!<br/>• LOSE your mind as you experience stunning graphics from the Unreal Engine!<br/>• COMPETE with players worldwide in multiplayer Challenges and open Events!<br/>• WIN TROPHIES that transfer from P2P daily, weekly and monthly!<br/>______________________________________________<br/><br/>Play online to gain access to the latest content and features, and keep your sound on to experience music legend Serj Tankian&amp;#39;s awesome soundtrack! <br/><br/>Midnight Star is not compatible with iPhone 4, iPad Touch 4th Gen, iPhone 3GS, iPad 1 or earlier devices. Requires iOS 6 or later.<br/><br/>Problems? Suggestions? Favorite color? We would love to hear from you! You can reach us at makersof@industrialtoys.com<br/><br/>Visit our FORUMS: forums.midnightstargame.com<br/>Like us on FACEBOOK: facebook.com/industrialtoys<br/>Follow us on TWITTER: @mstargame<br/>Watch us on TWITCH: twitch.tv/industrialtoys<br/>Catch up on YOUTUBE: youtube.com/industrialtoysgames<br/><br/>To learn more about the Midnight Star universe, download MIDNIGHT RISES, the interactive graphic novel experience written by John Scalzi and illustrated by former Marvel/DC superstar Mike Choi. Experience the alien signal that kicks off the mysterious Morning Star Protocol, discover the conspiracy against the GMSC and make choices that directly impact the game.<br/><br/>Please Note: Midnight Star is completely free to play - however, some in-game items can also be purchased for real money. You can turn-off this feature by disabling in-app purchases in your device&amp;#39;s settings.<br/>______________________________________________<br/><br/>Use of this application is governed by Industrial Toys&amp;#39; Terms of Service. In addition, please note that Industrial Toys respects your privacy and asks you to review the Industrial Toys Privacy Policy. The Industrial Toys Terms of Service and Privacy Policy can be found in the Legal section below as well as https://www.midnightstargame.com/privacy-policy", "metacritic": null, "released": "2015-02-05", "tba": false, "updated": "2019-10-22T14:27:43", "background_image": "https://media.rawg.io/media/screenshots/554/554045ec7953bc7f2f1e70d8f6b82006.jpeg", "website": "http://www.midnightstargame.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 268, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Industrial Toys"], "genres": ["Action", "Arcade"], "publishers": ["Industrial Toys"], "esrb_rating": "Teen"}