{"id": 144026, "slug": "shiny-earth", "name": "Shiny Earth", "name_original": "Shiny Earth", "description": "<p>I'm attempting a futuristic character generation type project which I then hope to shape a simple game around for the upcoming #cyberpunkjam2 - I'm always coming up with dystopian game ideas but the theme of \"solarpunk\" is stretching my brain cells nicely. Stay tuned!</p><p>Update:</p><p>With only a few minutes left of the jam I just got done learning how to actually compile my code as an .exe in GameMaker - I will upload source soon after the end of the jam, or maybe next day - and would LOVE LOVE LOVE any and all comments... please help!</p><p>This ended up being more of an \"experience\" than a game but I am pleased with what I was able to get done and I learned a lot - I do not think I should have handled /anything/ the way I did handle it but now I know for the future - if you peek at the source you will see that the GameMaker package is so full of junk I never ended up using and so messy - I really need to learn about project management - time management as well - I had an eye injury a few days before the jam ended and was going to give up - deadline got pushed back and eye healed and here we are: Shiny Earth!</p><p>I wanted to create a futuristic city where you could custom generate your body - I was going to have other \"doors\" in the city where you could go and generate weapons, food, or other things - I do not think I really captured the cyberpunk theme very well, and even less-so the solarpunk idea but - you get what you get!</p><p>I had a lot of fun with this!</p><p>Enjoy.</p>", "metacritic": null, "released": "2016-07-23", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/239/239e005f83c739aef5e68376f45945e2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 82, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["OhGoodShepherd"], "genres": [], "publishers": [], "esrb_rating": null}