{"id": 144057, "slug": "epic-prose-special-edition", "name": "Epic Prose Special Edition", "name_original": "Epic Prose Special Edition", "description": "<p>This is a RPG/Text adventure made in C#, it has a retro look, but many advanced features. You can steal, attack and kill NPCs turning you evil! Or you can try to avoid violence and talk your way out of fights to walk the path of good. You are the sole survivor of your village after a horrific dragon attack! Everyone you ever knew is dead. You swear to seek vengeance and slay the dragon!</p>\n<p>Epic Prose Special Edition is a remake of a C/C++ game I made I traslated it to C# and added a lot to it. It follows the same story but is much more advanced it has one and 2 word input as well as many things I wasn't able to include in the original including: attacking and killing NPCs, talking to bosses, more advanced inventory system, more advanced stat system - no character xp/level system, it uses a stat based system instead.</p>\n<p>New things I have added already include ASCII art text, animated text and menus, there is a main menu and a battle menu, charisma is used for buying and selling and characters have alignment and gender now, also carrying capacity, multiple characters in one location,  and saving and loading. I redid the whole map added in new locations, terrain based areas, more monsters, terrain based encounters and an ASCII art map.</p>\n<p>I'm still working on the Ai system which may take a bit, and I have to add in more story and characters, and then it will be a complete game. Please feel free to try it out and let me know what you think, also let me know if you find any bugs or typos. Thanks!</p>\n<p>#textadventure #text #adventure #textgame #fantasy #rpg #textbased #retro #interactivefiction #quest #ascii #epicprose #logicandchaos </p>\n<p>- Version 6.0 will have a complete NPC conversation system.<br/>- Version 7.0 will be the complete game.</p>\n<p>*I believe that the standard console width is 80 characters, I tried to keep this in mind with my graphic text, however it's not 80 for all systems, on my computer I have 120 characters and on other systems it's less, if you have any problems viewing the title or other graphic text, you may have to change your console settings, just open Epic Prose and right click on the widow's title bar and go to the layout tab, go to the screen buffer size and increase the width. Hope this helps!</p>\n<p>***latest version 5.2</p>", "metacritic": null, "released": "2017-08-02", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/390/3909e593e122c172bc3dd442029811b5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 142, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["logicandchaos"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}