{"id": 144098, "slug": "week2-extraction", "name": "WEEK2: EXTRACTION", "name_original": "WEEK2: EXTRACTION", "description": "<p>This game started out as a ambitious socio-economic strategy game and, just like the real games industry, ended up as a shooter.<br/><br/>The premise was you were responsible for maintaining the happiness of space colonists in remote mining colonies. If their happiness went too low they would rebel and you had to send in the police. I had colonies spawning colonists who would become rebels when touched. Police could then be dispatched to kill rebels. Initially It was all done by simple distance checks just to get the core components in.<br/><br/>It was interesting to watch the colonists as you would see dissent tear through the ranks and then hundreds of rebels would come charging at you. This got me to thinking maybe they were infected space colonists.<br/><br/>I was struggling with what the game actually was, and as an interim measure, decided to add manual control to the cops. Mainly this was thanks to watching the Tom Francis tutorial series. </p><p> I messed about with procedurally generating the levels, but in the end had to just settle for randomly placing the colonists and adding a percentage chance of infection.<br/><br/>This is what I mean about bad gamedev habits. It gets to about Thursday and I start thinking ok, lock it off and polish it up. I think I probably turned it into a shooter because I didn't want to end up with nothing to show when instead maybe I should have pushed on ? Idk. I think there is an argument for completing simple games with complete core gameplay systems this early on. This project was really useful as the high colonist count forced me to learn about object instances and parenting.</p>", "metacritic": null, "released": "2015-01-18", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/edb/edb72a3ebecc50f69f010c32841451aa.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 13, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["HK UdP"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}