{"id": 144164, "slug": "ld35-edge-shift-blackhole", "name": "[LD35] Edge Shift - Blackhole", "name_original": "[LD35] Edge Shift - Blackhole", "description": "<p>LD35 Entry: http://ludumdare.com/compo/ludum-dare-35/?action=p...</p><p>Edge Shift. <br/>----------------- <br/>The player must shift gravity and shape to match the particles from the black depths of another realm emitted from the aperture of a black hole. If the player doesn't reflect the shape, they will pulled into the darkness and pushed into another dimension. <br/><br/>Just touching elements from this other place triggers scenes from beyond space time. <br/><br/>Beware some shapes may look similar when rotating at high velocities. Don't be tricked! <br/><br/>----------------- <br/><br/>Controls: <br/>- W/S - Shape Shift <br/>- A/D - Control Orbit Speed / Direction <br/>- Mouse touch position to control camera <br/>- C - Credits on Screen <br/>- T - Next Dimensional Shader <br/><br/>----------------- <br/><br/>Made by me, Dan Rosser, individually and coded in C++ with majority of the work being spent on OpenGL ES shaders and for the visual aesthetic. I used my iPhone as my main test device so this was a super-multi platform project from it's start. <br/>Game works amazing with touch controls however I can't release that here so ported best I could for WebGL / keyboard / mouse. <br/>I did create sound effects and a background track myself as well, however ran out of time to properly master the sound quality / distortion effects, so I've left that out. <br/>Everything in the game is made programmatically. No 3d models, textures (aside from a Font) or sounds. <br/><br/>Core Framework used: http://openFrameworks.cc <br/>My Twitter: https://twitter.com/danoli3 - @danoli3 for more info. <br/><br/>--- <br/><br/>Technical Web playing problems: <br/>- Gray Screen? - Try and use the Web URL rather than the embedded if you see a gray screen on LD site / clear browser cache / incognito tab may fix as well. Another fix add or remove www. from the url, seen this fix it! <br/>- No Keyboard command working? Try clicking on the center of the Game Window (click on the Black Hole), try again. <br/><br/>Tags: <br/>#space #openFrameworks #c++ #opengles2.0 #webgl #ios #blackhole #sydney #australia <br/>#planets #time #html5 #emscripten #pretty #opengles #shaders #raymarch #tracing #bendlight #browser #canvas #js #psychedelic #trippy #black hole #black hole simulator 2016<br/></p>", "metacritic": null, "released": "2016-04-20", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/94b/94b4346499702cee6bc8c298e5216618.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 39, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Danoli3"], "genres": [], "publishers": [], "esrb_rating": null}