{"id": 14415, "slug": "3030-deathwar-redux", "name": "3030 Deathwar Redux", "name_original": "3030 Deathwar Redux", "description": "3030 Deathwar Redux is an Open World Space Adventure with a twist!<br/>\n<br/>\r\nA dead body is found by his crew, then his new ship gets impounded by the cops, something is going on... probably related to a missing freighter with a large cargo of gold bars.  Now, John Falcon, a freewheeling space pilot, tries to get back on his feet. But where to start? <br/>\n<br/>\r\n* Take on some local delivery jobs and get a better ship? <br/>\r\n* Downsize to a Jetsuit and go shooting space-junk for quick money? <br/>\r\n* Focus on finding the missing gold shipment before the local gangs and salvage teams?<br/>\r\n* Go punch that damn mechanic who sold you a stolen ship? <br/>\r\n              ...and what is this mysterious 'Taoist' group you keep hearing about?<br/>\n<br/>\r\nMaybe just take a break and go travelling inter-stellar, in an Open World of more than 30 star systems.  <br/>\n<br/>\r\nFeatures <br/>\r\n* Open world space exploration and frantic combat with afterburners blazing <br/>\r\n* Board Stations, visit the bars and talk to an array of space scum<br/>\r\n* Ghostly Derelict Ships to find on your Star-Map, spacewalk into, and salvage valuables<br/>\r\n* Large variety of fun Jobs and Missions, with exciting Side Quests<br/>\r\n* Diverse ships to buy and upgrade for Performance, Defence and Combat<br/>\r\n* Get a fuel-scoop and refuel from the corona of a sun without frying yourself!<br/>\r\n* Find Pirate Stations &amp; begin a life of crime, attack innocent traders, steal cargo from traffic<br/>\r\n* Get a large cargo ship and go Asteroid Mining for metals, or haul Goods between systems <br/>\r\n* Hidden wormhole shortcuts, Comets, Unique Stations and other secrets to find<br/>\r\n* An intriguing Main Plot Line...  and much, much more!<br/>\n<br/>\r\nThe Redux version adds: an extended adventure, with more characters and content, graphical enhancements, balancing and gameplay changes, a smoother experience and tons of other improvements!<br/>\n<br/>\r\nCredits <br/>\r\nDeveloped by Matt Griffiths &amp; Mic Newsam <br/>\r\nAdditional Design by Max Dohme <br/>\r\nPublished by Crunchy Leaf Games", "metacritic": null, "released": "2016-04-28", "tba": false, "updated": "2023-02-21T23:59:45", "background_image": "https://media.rawg.io/media/screenshots/2b4/2b41c07f637d5e55bcae8e386fc94b2e.jpg", "website": "http://www.crunchyleafgames.com", "rating": 2.67, "rating_top": 3, "added_by_status": {"yet": 2, "owned": 123, "beaten": 1, "toplay": 1, "dropped": 1}, "playtime": 4, "achievements_count": 38, "ratings_count": 5, "suggestions_count": 371, "game_series_count": 0, "reviews_count": 6, "platforms": ["PC"], "developers": ["Bird in Sky"], "genres": ["Action", "Adventure", "RPG", "Simulation", "Indie"], "publishers": ["Crunchy Leaf Games"], "esrb_rating": null}