{"id": 144344, "slug": "phosphorus-dating", "name": "Phosphorus Dating", "name_original": "Phosphorus Dating", "description": "<p><strong>Phosphorus Dating</strong> is a game about Technology and Relationships. </p>\n<p>Set in 1996, a lot of people is amazed by Internet and want to try to find someone to date online. <strong>Phosphorus Dating</strong> website has a very smart algorithm to find a match for anybody based on their <strong>gender</strong>, <strong>sexual orientation</strong>, <strong>age </strong>and <strong>interests</strong>, but for some reason this algorithm is not working as expected.</p>\n<p>You are Cecilia Dent and have to find the right matches for these people while the algorithm is being fixed.</p>\n<p><strong>HOW TO PLAY</strong></p>\n<p>You have 5 weeks, until our system is fixed, to match couples based on their <strong>gender</strong>, <strong>sexual orientation</strong>, <strong>age </strong>and <strong>interests</strong>. Every week you will have to find a good couple for the people in the left list of the Phosphorus Dating program. Pick the right person on the right and match the couple. If you can't find a good match, you can dismiss anybody on the right list, but it uses <strong>Hearts ❤</strong>, which you only get when you make a successful couple. You will also need <strong>Hearts ❤</strong> to go to the next week.</p>\n<p>When you match a couple, they will go out on a date and you can keep up with the progress on the lower left date list on the program. After that finishes you'll get a report.<br/></p>\n<p><strong>MORE INFO</strong></p>\n<p>This game was created by Bruno Croci for the #js13k competition.</p>\n<p>http://crocidb.com</p>", "metacritic": null, "released": "2016-09-11", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/b89/b89d466ada9130fdec7fa3b850dba07a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 68, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["CrociDB"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}