{"id": 144349, "slug": "jumping-ball", "name": "Jumping Ball", "name_original": "Jumping Ball", "description": "<p>Jumping Ball – Arcade game is the most vibrant addictive jumping game! This game will let you think ahead before you make any jump with the ball while playing the game levels.</p><p>The objective of this game is to let the ball move and jump over bars and reach the final point. But, remember that each bar has a different color and your ball should take the color of bar before jumping on it. Sounds easy, but can you do it and reach the finish point of each level to complete it and go to the following one without falling out of platform? </p><p>Why you need to download and install Jumping Ball – Arcade game on your android smartphone or tablet for Free instead of other jumping games?</p><p>Nice:</p><p>✓ The game has been selected to give the best user experience and make it an addictive jumping game. </p><p>✓ Nice interface. </p><p>✓ The game become harder as your progress on. But, don't give up and try to score the complete all levels.</p><p>Easy:</p><p>✓ We care about you and that's why we made our gameplay very easy to play, you need just to use the buttons in the screen to move the ball and let it jump. </p><p>✓ Each bar has a different color, but keep in mind that you should change the color of ball to the color of bar by collecting the color ball.</p><p>Free :</p><p>✓ Jumping Ball is FREE and it will stay Free for life, so there is No hidden fees, no special memberships and no annual subscription fees to challenge your brain. </p><p>Many levels:</p><p>✓ We created 40 levels inside our addictive game. We guarantee that you will play for hours non stop!</p><p>Brain Challenging:</p><p>✓ This game is for intelligent people who want to challenge their brain playing a fun game. </p><p>✓ Perfect for time killing, brain training, brain challenging, bonding with family and friends. Good for kids too.</p><p>Have fun with friends and others! </p><p>What are you waiting for ? Download Jumping Ball – Arcade game Now and Enjoy jumping with the ball!.</p><p>We are always striving to provide the best user experience for our players. We are also looking for your suggestion or recommendation. Please, feel free to email us at \"pir4t94@gmail.com\" and let us know from you so we can continue to bring you the best experiences and updates.</p><p>jump, jumping ball, ball, jumping, jumping game, free, arcade game, arcade, brain challenging, brain challenge, addictive, color</p>", "metacritic": null, "released": "2017-02-17", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/1fb/1fbbb21f4793c09f2175d910d1768bfa.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 15, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["w00t12345"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}