{"id": 144492, "slug": "profit-margins", "name": "Profit Margins", "name_original": "Profit Margins", "description": "<p>This game is my submission for the Ludum Dare 42 Jam.<br/></p>\n<p>If I'm being honest, I'm not incredibly proud of this game. I wish I had more time to it, but I ended up scrapping my first idea after 24 hours, and that really set me back. In the end it's not terrible, but it's not what I wanted it to be. However, I'm still submitting it because I don't like the idea of putting in ~40 hours of work into something and not ending up submitting it.\r\n</p>\n<p>-------------</p>\n<p>You have just been hired to manage a paper sales company, but unfortunately it's losing money. Fast. Even though every two months you'll have one less job to fill (made worse by the fact that you didn't have much space as it was), your boss still expects you to make more money than you spend.</p>\n<p>\"The MOMENT you start to slip under, you'll be asked to leave the company. I expect great things from you.\"</p>\n<p>Yikes.</p>\n<p>You get $1000 to start off, but you're on your own from there. If you want to hire someone, you set the amount you're willing to pay and you get three options based on that amount. More money = more skill.</p>\n<p>Work Ethic = How much they work<br/>Productivity = How much they get done when they work<br/>Charisma = How well other employees work with them</p>\n<p>Careful though, employees' happiness and energy starts going down as soon as you hire them. If they start to do too poorly, it might be best that you find someone else to take their place.</p>\n<p>---------------</p>\n<p>[F11] to fullscreen</p>\n<p>Mouse for everything else</p>", "metacritic": null, "released": "2018-08-13", "tba": false, "updated": "2019-08-28T23:22:26", "background_image": "https://media.rawg.io/media/screenshots/167/1674717609ae068b22ffffb8a43c9746.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 43, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["RubiksJr"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}