{"id": 144427, "slug": "the-birthday-dungeon", "name": "The Birthday Dungeon", "name_original": "The Birthday Dungeon", "description": "<p>Today is your birthday. You have inherited the keys to a dungeon. This won’t end well.</p>\n<p>The birthday dungeon combines the sensibilities of lovecraftian horror with the strategy of the rougelike genre and the thrills of a reading comprehension test. It is a fast-paced text-based roguelike riddled with mystery and intrigue. </p>\n<p>The game is easy to learn (you click on things and try not to die) but hard to master (you need to click on the right things to not die.) You will fail. Repeatedly. However, each attempt will help you learn develop new strategies for survival.</p>\n<p>The Birthday Dungeon would make a great birthday present for somebody you don't like very much. It would also make a great Christmas present for anybody whose birthday happens to fall on Christmas. </p>\n<p>This is an early access title. Further expansions to the dungeon are underway, bugs are being squished, polish is being applied. However, there is already a lot of content to explore.  You yourself could spend a lot of your leisure time in the birthday dungeon, if you're into that sort of thing. </p>\n<p><strong>Features:</strong><br/></p>\n<ul><li>Hundreds of unique encounters</li><li>Fast-paced strategic gameplay that combines the strategy of roguelike games and reading comprehension tests</li><li>Over 30,000 words of prose</li><li>Over 30 original chiptune melodies</li><li>Hundreds of works of 16x16 pixel art, lovingly crafted in MS paint </li><li>Includes the FREE Sergespansion!</li></ul>", "metacritic": null, "released": "2017-12-18", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/69a/69a8a2a177281fc268e266df53320a21.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 29, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Green Giraffe"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}