{"id": 144694, "slug": "karlbord-his-ethereal-pal", "name": "Karlbord & His Ethereal Pal", "name_original": "Karlbord & His Ethereal Pal", "description": "The Technology\r\n<p><strong>Artwork:</strong> Cardboard found behind a taqueria and cut out by hand<br/><strong>Photo editing:</strong> Photoshop<br/><strong>Music / SFX:</strong> Beatboxed on an iPhone using Voice Record</p>\r\nThe Story\r\n<p>Now this is a story~ All about how Karlbord’s life got flipped upside down And I’d like to take a minute just to sit right here I’ll tell you how he met his Ethereal friend In an Amazon box, born and raised At the doorstep he spent most of his days Waiting for someone to open that door Just to be received with joy and fervor When a couple of hands who were up to no good Started cutting cardboard in his neighborhood He got one little cut and his momma got scared She said, \"You're moving with your pal leaving blocks through the air\"!</p>\r\nThe Game\r\n<p>You Could Say It's a Recycled Game -- Karlbord &amp; His Ethereal Pal is a game crafted out of cardboard boxes which have been cut up to create all the graphics in the game. This might lead you to questions like - is that an egg carton in the background? Did that used to be a box full of soda cans? It's all possible - we chose our cardboard indiscriminately, from the back of a taqueria late at night.</p>\n<p>Style of Play -- Karlbord is a 2D side-scrolling game ala old-school Mario games. The objective is simple - collect the coins, get as far as you can in the level. The catch? The levels are incomplete! Only with the help of your Ethereal Pal (Player #2) - who can place blocks for you to build the level in real-time - can you keep going. How far can you go? Score comes from how far you've made it + points from coins collected.</p>\n\n<p>Originally made in 48 hours with ❤ &amp; very little sleep in San Jose, California</p>\n<p>Credits:</p>\n<p>Dani Casadevall Pino - code<br/>Daniel Chamberlin - tech art, animation, cardboard procurement<br/>Dave Heefner - production, teamwork<br/>Scott Looze - code<br/>Chris Seguritan - art, cardboard art</p>", "metacritic": null, "released": "2018-07-22", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/979/97999a7d4346ee352f03bd1ef98aeea9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 79, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["yamslayer"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}