{"id": 144794, "slug": "elevating-experience", "name": "Elevating Experience", "name_original": "Elevating Experience", "description": "<p>I know you click buttons. You always do. Every time there is a button, you click it, even if it doesn't do anything. You have already called the elevator, but you keep clicking, like it's going to arrive faster because of that. But there is, indeed, a way out of this predicament.</p>\n<p>WIth this magnificent game you can click, while you're waiting, without damaging public property! Just open up the app, select your level of choice and experience the Experience. But wait, there's more! For only a low additional price of zero, you get:</p>\n<p> - Seven unique, exquisitly crafted, stylistically perfect levels! Each level represents anything you want it to represent! Unlock them, play them, enjoy them!<br/> - Points! Every time you click, you get more points. Does that happen in real life? Probably not!<br/> - Achievements! Get achievements for everything! Got a hundred points? Achievement! Played the game three times? Achievement! Clicked the button for ten minutes? You guessed it - achievement! And each achievement has a uniquie witty flavor text!<br/> - Music! Each level has its own music, masterfully composed by random people and provided for free, just for you to enjoy!</p>\n<p>Get the game now and experience the Elevator Experience!</p>\n<p>Epilepsy warning! This game contains flashing, dashing and bedazzling images that may indeed cause seizures. Please don't play this if you are prone to seizures.</p>\n<p>This game features different themes, like steampunk and futurisitc neon, and has an appearance stylized towards old VHS tape recordings and CRT screens. This psychedelic collage is not for everyone, but its minimalistic clicker gameplay will not in any way stop you from enjoying the music and the visuals. This is not an idle clicker, but if you want, you can just let it run and listen to music. Achievements are overloaded with below average jokes and puns, and some pop culture references. Important fact: you get the full game! No ads, no in-app purchases, nothing. Just the game itself.</p>", "metacritic": null, "released": "2018-07-01", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/359/359b3759ea591a8a172982900084fc70.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 82, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Kurokitsukami"], "genres": [], "publishers": [], "esrb_rating": null}