{"id": 144717, "slug": "antibody-greg-squire", "name": "Antibody (Greg Squire)", "name_original": "Antibody (Greg Squire)", "description": "<p>Antibody was an idea I had for a more casual / cute shmup type game where you had to fly around inside a human body and destroy deadly diseases. I had quite a number of body themed levels planned as well as tons of cute / humorous enemies like Mad Cow Disease (shaped like a cow) and Chickenpox (shaped like a chicken).</p><p>I never got too far for a number of reasons, but one reason was I got too distracted by different shiny game engines. I started building a prototype in Torque 2D (later called Torque Game Builder), but the engine, which was very new at the time, was riddled with bugs and I didn't like bumping into walls constantly where I wasn't doing something the way the engine wanted it to be done. Also much of this info was not documented anywhere and was a hassle to find.</p><p>I then ported the project over to the BlitzMax engine, which was also a new engine, but I had more success with it. I also used the awesome Gray Alien Framework that helped with the UI stuff. However I never got beyond having one level in infinite loop. BlitzMax didn't have any kind of level editor and I started working on integrating the game with a generic level editor, but never got that really working.</p><p>Later some multi-platform game engines started coming on the scene, so I started experimenting with porting it to Monkey (an engine by the BlitzMax folks, but with the promise of creating multiple versions for different OSes with the same code base. I didn't get too far with that one. Also I did some experiments porting it to GameMaker:Studio as it was becoming a viable engine at the time.</p><p>Ultimately I shelved the project, but I still love the concept and I may return to this again someday.</p><p>This is a mouse driven shmup so use the mouse to move and the left button to shoot. Also the arrow keys and the space bar to shoot also works. It also has gamepad/controller support too.</p>", "metacritic": null, "released": "2016-06-22", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/d38/d387a6efa470e31faf15c9fa584c953f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 134, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Greg Squire"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}