{"id": 14476, "slug": "zombie-estate-2", "name": "Zombie Estate 2", "name_original": "Zombie Estate 2", "description": "<strong>One of the highest rated Xbox Indie Games is now available for PC!</strong><br/><br/>How long can you survive in this co-op wave based shooter? Featuring 35 characters with unique stats, over 100 weapons, 30 stat-boosting hats, and 6 unique levels, Zombie Estate 2 is a frantically fun experience to share with friends! Where else could you be a duck wielding a shotgun or a robot with his favorite flame thrower?<br/><br/><br/><br/><br/><br/>Featuring both online and local co-op! Play unlimited wave mode to see how many waves you can survive!<br/><br/><br/><br/><br/><br/>Purchase weapons in between waves to help tip the odds in your favor. The store has been stocked with new weapons such as the Nuke Gun and Welding Torch. Zombie Estate classics return like the Bubble Launcher and Card Shuffler!<br/><br/><br/><br/><br/><br/>Face 13 unique zombie enemies! Randomized wave generation ensures every play-through is fraught with new challenges!<br/><br/><br/><br/><br/><br/>Unlock new characters with Zombie Points earned at the end of each round! Want to be a duck? No problem. Sheep? Sure, why not? A sentient piece of broccoli? Why...? But sure!<br/><br/><br/><br/><br/><br/>Balance your team's stats to create the optimal zombie-killing strategy. Want to be a beefy tank? A medic? A master of robot minions? Or how about dealing the most damage you can? Augment your character with accessories to boost their stats, customizing the character to your liking.<br/><br/><br/><br/><strong>\"Guys, I'm broccoli shooting cows at clowns.\"</strong>", "metacritic": null, "released": "2017-01-13", "tba": false, "updated": "2019-08-28T22:12:07", "background_image": "https://media.rawg.io/media/screenshots/22a/22a5faa941da448fa344e408afb7845b.jpg", "website": "http://www.zombieestate.com/#ze2", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 23}, "playtime": 2, "achievements_count": 18, "ratings_count": 1, "suggestions_count": 348, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Sad Spaghetti Entertainment"], "genres": ["Action", "Indie"], "publishers": ["Sad Spaghetti Entertainment"], "esrb_rating": null}