{"id": 1448, "slug": "clash-of-clans", "name": "Clash of Clans", "name_original": "Clash of Clans", "description": "<p>From rage-­filled Barbarians with glorious mustaches to pyromaniac wizards, raise your own army and lead your clan to victory! Build your village to fend off raiders, battle against millions of players worldwide, and forge a powerful clan with others to destroy enemy clans.</p>\n<p>PLEASE NOTE!  Clash of Clans is free to download and play, however, some game items can also be purchased for real money. If you don&#39;t want to use this feature, please disable in-app purchases in your device&#39;s settings.  Also, under our Terms of Service and Privacy Policy, you must be at least 13 years of age to play or download Clash of Clans.<br />\nA network connection is also required.<br />\nFEATURES<br />\n●   Build your village into an unbeatable fortress<br />\n●   Raise your own army of Barbarians, Archers, Hog Riders, Wizards, Dragons and other mighty fighters<br />\n●   Battle with players worldwide and take their Trophies<br />\n●   Join together with other players to form the ultimate Clan<br />\n●   Fight against rival Clans in epic Clan Wars<br />\n●   Build 18 unique units with multiple levels of upgrades<br />\n●   Discover your favorite attacking army from countless combinations of troops, spells, Heroes and Clan reinforcements<br />\n●   Defend your village with a multitude of Cannons, Towers, Mortars, Bombs, Traps  and Walls<br />\n●   Fight against the Goblin King in a campaign through the realm<br />\nPLAYER REVIEWS<br />\nClash of Clans proudly announces over one million five star reviews on the App Store.<br />\nSUPPORT<br />\nChief, are you having problems?  Visit http://supercell.helpshift.com/a/clash-of-clans/ or http://supr.cl/ClashForum or contact us in game by going to Settings &gt; Help and Support.<br />\nPrivacy Policy:<br />\nhttp://www.supercell.net/privacy-policy/<br />\nTerms of Service:<br />\nhttp://www.supercell.net/terms-of-service/<br />\nParent’s Guide:<br />\nhttp://www.supercell.net/parents</p>", "metacritic": null, "released": "2012-08-02", "tba": false, "updated": "2024-03-20T13:29:52", "background_image": "https://media.rawg.io/media/screenshots/761/76129e9a98953bd17583f2a8cb776214.jpeg", "website": "", "rating": 3.44, "rating_top": 4, "added_by_status": {"yet": 1, "owned": 36, "beaten": 32, "toplay": 9, "dropped": 110, "playing": 25}, "playtime": 6, "achievements_count": 0, "ratings_count": 116, "suggestions_count": 60, "game_series_count": 5, "reviews_count": 120, "platforms": ["Android", "iOS"], "developers": ["Supercell"], "genres": ["Action", "Strategy"], "publishers": ["Supercell Oy"], "esrb_rating": "Everyone 10+"}