{"id": 144854, "slug": "via", "name": "Via", "name_original": "Via", "description": "The concept of Via came firstly from a personal challenge: “create a puzzle game that would be played with just one button”.\r\n\r\nOne unit (of random type) will be proposed by regular intervals on each line of the level.\r\n\r\nThe player can, either send the unit that will attack the enemy’s units and advance to the enemy base in order to take off one of its life, or will wait (that will have the effect of upgrading the unit).\r\n\r\nThe game affords you to play alone or more on just one smartphone; the rapid parts follow each other, testing your capacity of adaptation and strategy in the short term.\r\n\r\nIn order to test the game even without smartphone. You can create a unit thanks to the “A” Key (player1) or the “P” Key (player2).\r\n\r\n------------------------------------------------------------------------------------------\r\n\r\nFrensh description:\r\nLe concept de Via est d'abord parti d'un défi \"créer un jeu de réflexion qui serait jouable avec un seul bouton\". \r\n\r\nUne unité (de type aléatoire) sera proposée par intervalle régulier sur chaque ligne du niveau. Le joueur peut soit envoyer l'unité, qui attaquera les unités ennemies et avancera jusqu'à la base ennemie pour lui enlever une vie, soit attendre (ce qui aura pour effet d'améliorer l'unité). \r\n\r\n Ce jeu vous permet de jouer tout seul ou à plusieurs sur un seul smartphone, les parties rapide s'enchaînent, mettant à l'épreuve votre capacité d'adaptation et de stratégie à court terme.\r\n\r\nPour tester le jeu même sans smartphone. Vous pouvez créer une unité grâce à la touche A (joueur 1) ou P (joueur 2).", "metacritic": null, "released": "2018-05-06", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/5b7/5b7eaea4289d89b09369ed9968395041.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 16, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "Android", "Web"], "developers": ["ElVago"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}