{"id": 14489, "slug": "tumbleweed-express", "name": "Tumbleweed Express", "name_original": "Tumbleweed Express", "description": "The year is 1885, the height of the Age of Steam in the United States of America. But something is not quite right in the land of destiny and the free market: Dirigibaus, a ruthless entrepreneur, has monopolized trade in the West with a fleet of airships! Dirigibles and zeppelins dot the skies as agents of an oppressive business regime.<br/><br/>Someone still fights for the little people, though. The venerable Tumbleweed Express Steam Engine, long-thought to be obsolete and scrapped, is set to saddle up and ride again. The Tumbleweed is about to spearhead a logistics campaign meant to compete with the Dirigibaus, bringing support to those who have been downtrodden and forgotten. Dirigibaus doesn't take kindly to competition, however, so the Tumbleweed has armed herself for war...<br/><br/><strong>Do you have what it takes to beat the Baus?</strong>Features<ul><li> Race against the clock to collect stars in 12 levels. <br/></li><li> Engage in combat directly by manning the caboose and controlling the action.<br/></li><li> Upgrade your train defense systems and crew in your company Warehouse. <br/></li><li> Complete shipping contracts that increase level difficulty.<br/></li><li> Do battle with a variety of enemies and bosses. <br/></li><li> Pick up mail to learn more about the Tumbleweed Express.</li></ul><br/>", "metacritic": null, "released": "2016-05-31", "tba": false, "updated": "2019-08-28T22:12:06", "background_image": "https://media.rawg.io/media/screenshots/0d7/0d729de87cf8a01a9eb4ed8f6766d43c.jpg", "website": "http://www.dirigiballers.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 12}, "playtime": 2, "achievements_count": 19, "ratings_count": 1, "suggestions_count": 573, "game_series_count": 0, "reviews_count": 1, "platforms": ["macOS", "Linux", "PC"], "developers": ["The Dirigiballers"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["The Dirigiballers"], "esrb_rating": null}