{"id": 14485, "slug": "mirrormoon-ep", "name": "MirrorMoon EP", "name_original": "MirrorMoon EP", "description": "<strong>MirrorMoon EP is a game about mystery and exploration set in outer space. </strong><br/>These space travels begin on a red planet and its unique moon and extend across galaxies. <br/>The <strong>single player</strong> part of MirrorMoon EP blends adventure and exploration with navigation-based puzzle solving.  The <strong>multiplayer</strong> of MirrorMoon EP lets players share Galaxy Maps with other players: the first explorers to land on a planet will be able to name its Star System and that name will be forever bound to the star for any other fellow traveler who encounters it. <br/><br/>Each Galaxy consists of a thousand Systems: it will be possible to fully discover the mysteries of MirrorMoon EP only while collaborating with other players.<br/>Through the apparently indecipherable cockpit of an unknown spacecraft, players will be able to locate and travel to mysterious planets. Each planet has artifacts, buildings, and puzzles on its surface, hidden in astonishing low-poly sceneries. <br/><br/><br/><br/>MirrorMoon was nominated for the Nuovo Award for innovation in games at Independent Game Festival 2013 and was also part of the Official IndieCade and Fantastic Arcade 2012 selections. Since then, MirrorMoon has grown considerably.  EP stands for Extended Play, representing all the new content that we added for the official release.", "metacritic": 73, "released": "2013-09-04", "tba": false, "updated": "2019-09-17T06:14:17", "background_image": "https://media.rawg.io/media/screenshots/a55/a552a4660ec049c305633077c1e0239b.jpg", "website": "http://www.mirrormoongame.com/", "rating": 2.64, "rating_top": 3, "added_by_status": {"yet": 38, "owned": 628, "beaten": 8, "toplay": 1, "dropped": 16}, "playtime": 2, "achievements_count": 10, "ratings_count": 22, "suggestions_count": 140, "game_series_count": 0, "reviews_count": 22, "platforms": ["Linux", "macOS", "PC"], "developers": ["Santa Ragione"], "genres": ["Adventure", "Indie"], "publishers": ["Santa Ragione"], "esrb_rating": null}