{"id": 144958, "slug": "salvando-mi-destino-alpha-v1", "name": "Salvando Mi Destino Alpha v1", "name_original": "Salvando Mi Destino Alpha v1", "description": "<p><strong><em>Salvando mi destino.</em></strong></p><p>Es Un videojuego DESARROLLADO POR Juegos Apocalipsis Estudios equipo independiente de la ONU, el videojuego es de genero: Acción, terror psicológico.</p><p>En Tercera Persona, podriamos Definir Como un videojuego de aventura, USTED Mismo Florerias del fijarse en el Entorno Que Ofrece el alfa.</p><p>Hacemos El solitario alfa Es Una Pequeña Demostración de lo Que, si USTED Descarga el contenido observara Que solo es El Escenario del videojuego, tambien Trae personaje pequeño un, ESE PERSONAJE sin Que Nada Tiene ver con el juego, Porque el personaje esta en Desarrollo, Pero con el aleta De Que USTED pruebe aceleramos el Entorno Que ofrecemos Poco ONU El Proceso Poniendo Una ONU personaje X.</p><p>El Escenario Tiene Un ambiente caluroso con algo de vegetación Como Si fuese abandonado Lugar ONU. https: //www.facebook.com/pages/Sobreviviendo-al-te ...</p><p>NECESITAMOS Críticos del videojuego Que Prueben our de contenido gratuitamente Hasta lanzarlo vapor de un, USTED Florerias Que hacer el videojuego mejore Cada Vez Mas Como Debe Ser, Parr ESO USTED Dębe uniRSE, Florerias Hacerlo aquí:    https://www.facebook.com/groups / 539256259444188 /</p><p>Si d es critico del videojuego, tendra la Posibilidad de Obtener El Primer capitulo gratis, y salir en los creditos del vdeiojuego.</p>Ahorro de mi destino.", "metacritic": null, "released": "2014-12-06", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/a7a/a7a8964bef563c441da77582e00cc453.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 270, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["alexiszarate"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}