{"id": 145075, "slug": "20-000-cogs-under-the-sea-2", "name": "20 000 Cogs under the Sea", "name_original": "20 000 Cogs under the Sea", "description": "<p>Start your awesome underwater steampunk adventure. Build underwater factory, connect the cogwheels ⚙ for the most efficient work in the idle game 🎮 mode. Tap volcanoes 🌋 for oxygen, drill the seabed and mine ⛏ the ore.<br/><br/>Employ octopuses 🐙 and whales 🐳, explore the world with mechanical crabs 🦀, fish 🐟 and submarines! Even the squirrels will help you, if you supply them with oxygen. Upgrade your incredible contraptions to become the ultimate sea tycoon. <br/><br/></p>\r\n\r\nFeatures\r\n<ul>\n<li>Various mad science 🔬 contraptions, which can be connected in multiple fun ways</li>\n<li>You start in a small research station at the bottom of an ocean 🌊, but then you expand down, up, left and right</li>\n<li>Tutorial gives you the basic concepts, but to ultimately succeed you must be a real researcher and uncover hidden gameplay mechanics</li>\n<li>Engines will work while you are away, producing you idle cash 💰</li>\n<li>Big community in facebook: share your creation to 7500 group members</li>\n<li>Contains only rewarded ads, which are launched by the player to increase earnings</li>\n<li>Works in offline mode without internet 📶 connection</li>\n<li>Receive your daily reward 💲 by catching a FB submarine</li>\n</ul>\r\n\r\nHistory\r\n<p>This is the fifth, Underwater, world of Steampunk Idle Spinner series. The first version of idle game with spinning cogwheels was made in June 2017 during a 3-days gamejam. As the concept proved to be interesting for the players, the development continued. The development of the game is screencast and then published as 1:60 timelapse video. Some development phases are broadcast to the players as live videos and often the players' suggestions are implemented online.<br/><br/>The primary source of inspiration for the overall concept were the mechanisms of interconnected cogs, which the developer liked to assemble and disassemble in his school years. The current underwater setting was inspired by Joules Verne's \"20 000 Leagues under the Sea\", Disney's \"Atlantis\" dieselpunk cartoon and Brian Kesinger's \"Walking Your Octopus\" illustrations. Also the Underwater world was most demanded, according to the players' vote in the game's facebook group. Work started in March 2018, public alpha was launched in May 2018, beta in July 2018.<br/><br/>This world introduces many new concepts unique to the series. They are: <br/> </p>\n<ul>\n<li>Reworked game engine with LEGO-like \"pins\" concept, which let design even the most bizarre machines interactions;</li>\n<li>Resources production chains. Money💵 is produced from air, various gases can be combined to create new substances;</li>\n<li>Playable area expansion. Sideways expansion is performed with clockwork crabs and submarines, upwards expansion: with main base upgrades and downwards: by drilling the seabed;</li>\n<li>Wide usage of taps together with spins for interaction with machines;</li>\n<li>New objects are not only bought, but also discovered (treasure chests, more underwater volcanoes, ore deposits);</li>\n<li>Machines purchase interface is the most convenient here.</li>\n</ul>\n<p>Players continue giving new suggestions, which eventually appear in the game. <br/> <br/> </p>\n<strong>Main trailer:</strong>", "metacritic": null, "released": "2018-07-26", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/590/590838abfb0869ad59ce6c2e880e54bd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 57, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Android"], "developers": ["Airapport"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}