{"id": 14511, "slug": "16bit-trader", "name": "16bit Trader", "name_original": "16bit Trader", "description": "16bit Trader is an casual brother of our other trading game: Merchants of Kaidan.<br/>\n<br/>\r\nTake revenge on your father’s killer, and become the richest merchant in the kingdom! Immerse yourself in this old-school nostalgia-inducing trading experience.<br/>\n<br/>\r\nStep into the shoes of a medieval traveling merchant, whose life boils down to one simple sentence: you got to buy cheap, and you got to sell high. Travel between the cities and villages of the realm in search of cheap goods to acquire, various quests to accomplish and wealth to accumulate. Visit local taverns for latest local gossip. Gain influential friends who may help you along the way. Hire companions to assist you if you run into vile bandits or unpredictable events. Pursue rumors of great harvest and goods shortages to find the best deals. Search for local people in need and they may reward you handsomely for your help. Expand your company, invest in it, and get rich in no time! And if you’re for a bit of a thrill, visit ancient landmark and search for valuable artifacts. Take the challenge and become the richest merchantman in the world and get revenge!<br/>\n<br/>\r\nPlay at your own pace. Casually travel through the realm if you want to relax. Monitor every price change, pursue every rumor, manage every detail if you want to achieve best results!<br/>\n<br/>\r\n- Dozens of different cities and villages<br/>\r\n- Tens of various quests to accomplish<br/>\r\n- Great graphics with an old-school 16-bit vibe<br/>\r\n- Easy to get to know, hard to master<br/>\r\n- Random encounters", "metacritic": null, "released": "2012-07-31", "tba": false, "updated": "2023-12-18T17:46:23", "background_image": "https://media.rawg.io/media/screenshots/9cc/9cc770fbf82183b1158ed4d3ca5ed828.jpg", "website": "http://games.forever-entertainment.com/", "rating": 1.75, "rating_top": 1, "added_by_status": {"yet": 31, "owned": 922, "beaten": 4, "toplay": 1, "dropped": 21}, "playtime": 5, "achievements_count": 16, "ratings_count": 40, "suggestions_count": 335, "game_series_count": 0, "reviews_count": 40, "platforms": ["PC", "Android", "Linux", "iOS", "macOS"], "developers": ["Forever Entertainment", "Forever Entertainment S. A."], "genres": ["Adventure", "RPG", "Strategy", "Simulation", "Casual", "Indie"], "publishers": ["Forever Entertainment"], "esrb_rating": "Everyone"}