{"id": 145264, "slug": "play-with-me-itch", "name": "Play With Me (itch)", "name_original": "Play With Me (itch)", "description": "<p><strong>Investigative journalist Robert Hawk and his wife Sara mysteriously disappear</strong>. The investigating officers immediately suspect a man known as “Illusion” – a serial killer Hawk had been writing articles about, close to discovering “Illusion’s” true identity. But now Hawk finds himself in the “Illusion” and must conquer a maze of puzzles to survive.</p>\n\n<p>Become completely immersed and even use objects from your real-world surroundings to outsmart the kidnapper. Blow into your microphone to extinguish some candles, use a hand gesture to light a match, shake a box, open a jar, or attack someone with a hammer. Use a mirror, a piece of paper or your own hands to cover part of the screen and solve the puzzles. You can be sure of one thing – these are just a few of the unique gameplay solutions and original ideas you’ll need during the game.</p>\n\n<p>Enter the world of a dangerous psychopath and discover how it feels to descend into madness, thanks to the unique system designed to reveal the mental state of your character. Take advantage of some of the additional activities – record your diary using a virtual telephone, read text messages or play games – do whatever you can to stay sane. Random events will affect parts of the game, from the puzzles and item locations, to the dialogues you have – each time you play, the game will have changed. </p>\n<p>And if you feel the need for an even greater challenge, you can test your skills using different modes, including “exceptional survival” mode. And, in the end, you’ll need to test your own human nature with moral choices and secondary quests, which will all lead to many different conclusions.</p>", "metacritic": null, "released": "2018-01-26", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/9e6/9e65c13c7c04df93ca8db90cc12cb99e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 447, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Libredia"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}