{"id": 145252, "slug": "nightmare-boy-itch", "name": "Nightmare Boy (itch)", "name_original": "Nightmare Boy (itch)", "description": "<p>Nightmare Boy is a metroidvania style, action/adventure 2D game.</p>\n<p>It takes place in a diverse world, full of enemies from your worst Nightmares! \r\n  </p>\n<p>In your quest to save the Noctum from a self-proclaimed ruler, you'll meet weird and unique friends and foes. But tread carefully when talking or interacting with NPCs: Quirky characters and their reactions can have game-changing consequences. Fast reflexes and a taste for exploration are key if you intend to collect rare items, vanquish enemies, and eventually face your deepest fears.\r\n  </p>\n<p> <strong>Story</strong></p>\n<p>This story takes place in Donorok, in the state of Noctum. After the King of Noctum, Aster, disappears, chaos rules over the world. The relationships between Monsters, Mongos and Dreamers are completely unstable, and Donorok - the land so heavily affected by the chaos - slowly absorbs terrain from the surrounding regions.\r\n  </p>\n<p>Balder has taken over and has ordered the monsters to retain any child who falls into the Nightmare. The key to continuing his rule is with the Nightmare Boy, Billy.\r\n  </p>\n<p> <strong>Gameplay</strong></p>\n<ul><li>Character control is responsive and dynamic. As you progress through the story you will discover new abilities such as double jump, triple jump and hanging on walls. Powerful spells, explosives, and friends along the way will aid you in untraveled paths.\r\n  </li><li>As the player exploring every corner that forms the Nightmare World, you will slowly complete your map.\r\n  </li><li>There are many collectibles throughout the World that will decide which of the different endings the story concludes with.\r\n  </li><li>Characters on your journey will offer advice, but it's up to you to take it - or not!\r\n</li></ul>", "metacritic": null, "released": "2017-10-23", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/311/311edefd3c2c7501be140c19dbe329fa.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 292, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Plug In Digital"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}