{"id": 145305, "slug": "colur", "name": "COLUR", "name_original": "COLUR", "description": "<p>Since birth I have not been able to see colors as many people around me are able too, therefore I have had to adapt various aspects of my life to fit my unique situation.  I have been a software developer for many years and have recently grown quite fond of the ideal of shifting my attention towards completing a game that speaks to peoples creativity.</p>\n\n<p>COLUR was initially designed to be a game I could just start up and look at and enjoy the various colors of nature &amp; earth.  However, as with most games my ideal has evolved into something that I feel can be a thing of true beauty.  Now, I am ready to share my creation to the world to see if there is a want for such a game.</p>\n\n<p>Please keep in mind this is a <strong>VERY EARLY PROTOTYPE</strong> and I am posting here to mainly gain a foothold on the game as well as to see what the community might want from the game.  I am <strong>VERY OPEN</strong> to suggestions such as gameplay techniques, mechanics, artwork, etc.  I really want the communities help to polish my game and get a release out to the world.</p>\n\n<p>Thank you all for your consideration and your time, I truly cherish every moment that I have been able to work on this game and pour so much of my soul into it.</p>\n\n<p><strong>CONTROLS</strong></p>\n<p>Move the RGB values up by left-clicking (holding) on the palette of the selected node.  Move the RGB values down by right-clicking (holding) on the palette of the selected node.  Once you have cleared a board you will have to ALT+F4 the game as I have yet to implement a system that loads an incremental map.<br/></p>", "metacritic": null, "released": "2018-01-04", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/150/150421bb2cac0fa673b8ee89374c1ec9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 43, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["sumosoft"], "genres": ["Strategy", "Puzzle"], "publishers": [], "esrb_rating": null}