{"id": 145465, "slug": "dragonscript-arena-a-coding-game-beta", "name": "DragonScript Arena - a coding game (beta)", "name_original": "DragonScript Arena - a coding game (beta)", "description": "<p>Welcome to DragonScript Arena – the programming strategy game and coding club. Level up your Javascript &amp; Software Engineering as you play!</p>\n<p>dragonscriptarena.com</p>\n\n<p><em>Design your Dragons' Artificial Intelligence (A.I.) by writing real code</em></p>\n<ul><li><strong>Code your own A.I.</strong> – enjoy 100% freedom to craft your Dragon A.I. using real code. Our unique <em>A.T.H.E.N.A. battle-system </em>technology lets you run your Dragon A.I. against other A.I. in the Arena. Watch your Dragons grow stronger as your coding skills improve</li><li><strong>Solo Quests</strong> – lead your Dragons through a series of increasingly challenging puzzle quests. Each quest comes with a step-by-step coding lesson</li><li><strong>PVP Arena</strong> – challenge friends to decide who has the craftiest Dragons in all the lands</li><li><strong>Free-to-Play &amp; Free-to-Learn</strong> – the full game is forever free to play. Curious students may also join our free coding club. Unlike other games, the skills you earn here can help you win in real life too!</li><li><strong>Coding Club</strong> – get coding lessons and 1-on-1 mentorship with a Silicon Valley Software Engineer. Our Coding Club is inspired by traditional apprenticeships, like how swordmakers or sushi chefs pass down their craft to the next generation</li></ul>\n\n<p><em>Level up your coding skills to get your Dragons to work together against enemy A.I.</em></p>\r\n\"This silly game teaches you some serious coding skills\"\r\n<p>You and your Dragons will be met with challenges... similar to ones you might find in a professional software engineering project. You will develop hands-on skills as you solve these puzzles and lead your Dragons to victory. All the code you'll write to control your Dragons will be real Javascript + HTML. The experience you get playing this game will give you a taste of real-world software development. In other words, when you get good in this game, you automatically get good in real life too.<br/></p>\n\n<p><em>Guide your Dragons through puzzle quests like \"Capture the Orb\"</em></p>\r\nLearn Javascript + HTML as you play\r\n<p>We picked Javascript (JS) and HTML because they give you a fast track from newbie to your first paying gig in the world of tech. You can think of JS+HTML as a 1-2 punch combo. HTML lets you build a web frontend, while JS lets you code everything from a slick modern UI to a mission-critical backend server. This means you can take the JS+HTML skills you develop here to explore a new career in software, complement your existing tech toolbox, or even build a webapp you can sell. While this might not guarantee you'll be the next Elon Musk, it's a rocketship into the world of code.<br/></p>\n\n<p><em>Learn Javascript + HTML as you play. Test your A.I. in our A.T.H.E.N.A. \"Live Simulator\" before entering the Arena.</em><br/></p>\r\nUnlock a new adventure in your life\r\n<p>Knowing how to code today can sometimes be the secret <em>\"Open Sesame\"</em> password to unlock opportunities otherwise hidden from the average person. Plus, it's the only skill in the world where you can create something valuable out of nothing – from anywhere in the world, with nothing but a computer. Even if you don't plan to code for cash, it's still a valuable skill to learn because technology is now everywhere and everything runs on code. <br/><br/>I originally made this game as a way to introduce my kids to Computer Science. But someone pointed out that this might be helpful for others too. So... since I enjoy teaching (and I don't get to do it much), I made this game and coding club for you, my new internet friend. If you're looking for a new and fun way to start coding... c'mon in! Let me be your humble guide into the magical world of code :)</p>\n<p>Start playing: dragonscriptarena.com<br/>Discord chat: discord.gg/5nuEXxK<br/>Subreddit: /r/dragonscriptarena<br/>Made by: aaron@dragonscriptarena.com<br/>Special thanks to: Melisa N, J+j, David K, Chris P, Harry M, Jim McG</p>\n<p><strong>Recommended system requirements: </strong><br/>Google Chrome web browser, computer + keyboard</p>\n<p><strong>Recommended age: </strong><br/>10+ with any wee bit of programming experience (even Scratch is good)</p>", "metacritic": null, "released": "2018-07-16", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/1f6/1f6cb1a28099dff95577e388d1b19f52.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 173, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["secretsciencelab"], "genres": ["Strategy", "Simulation", "Educational"], "publishers": [], "esrb_rating": null}