{"id": 14551, "slug": "grotesque-tactics-evil-heroes", "name": "Grotesque Tactics: Evil Heroes", "name_original": "Grotesque Tactics: Evil Heroes", "description": "<strong>Grotesque Tactics</strong> is a story driven, satirical RPG with a strategic combat system. A party of 10 anti-heroes are fighting in a grotesque world that combines the features and clichés of Western and Asian Strategy RPGs like Final Fantasy Tactics, Heroes of Might &amp; Magic and Fire Emblem.<br/> <strong>Grotesque Tactics</strong> weaves a humorous storyline and plenty of amusing dialogue, poking fun at some of the most successful RPGs, such as Oblivion, Gothic and Lord of the Rings.<br/>\t\t\t\t\t\tTo protect the kingdom from the merciless cult \"The Dark Church\" which has murdered all of the kingdom’s heroes and knights, you will have to hire dubious soldiers and rescue jealous maidens who will follow you into combat as your groupies.<br/>\t\t\t\t\t\tFeatures\t\t\t\t\t\t<ul><li>Turn based tactical battles with humorous animations not seen in any RPG <br/> </li><li>Distinctive party members such as the arrogant Holy Avatar, the blood thirsty Vampire Solitaire, the sweet but hot-tempered Angel Angelina and many more <br/> </li><li>Gorgeous village landscapes and dark, sinister dungeons <br/> </li><li>Scantily dressed maidens to be freed from the grasp of merciless monsters <br/> </li><li>Enormous, highly detailed and very angry end bosses <br/> </li><li>Classical RPG elements: quests, treasures, trade, leveling up and out¬fitting a party of unique heroes<br/> </li><li>Enjoyable multiple choice dialogues and conversation puzzles in the style of classic adventure games, such as Monkey Island or Maniac Mansion<br/> </li></ul>*In chess, a <strong>Grotesque</strong> is a problem or endgame study which features a particularly unlikely initial position, especially one in which White fights with a very small force against a much larger black army. Grotesques are generally intended to be humorous.", "metacritic": 65, "released": "2010-02-22", "tba": false, "updated": "2023-11-13T18:08:34", "background_image": "https://media.rawg.io/media/screenshots/798/7987e4fe35f947059e077a220f0e8cd2.jpg", "website": "http://www.grotesque-game.com/", "rating": 2.04, "rating_top": 1, "added_by_status": {"yet": 19, "owned": 590, "beaten": 9, "toplay": 1, "dropped": 8}, "playtime": 1, "achievements_count": 10, "ratings_count": 24, "suggestions_count": 610, "game_series_count": 0, "reviews_count": 24, "platforms": ["PC"], "developers": ["Headup Games", "Silent Dreams"], "genres": ["RPG", "Strategy", "Indie"], "publishers": ["Headup Games"], "esrb_rating": null}