{"id": 145649, "slug": "gamepops-2-sega-generation-version", "name": "GamePops 2: Sega Generation Version", "name_original": "GamePops 2: Sega Generation Version", "description": "<p><strong>GamePops 2: Sega Generation Version</strong> is a video game music quiz: you listen to a music and writes the name of the game it belongs. You need to write the entire name to make a 100% score. If you are almost remembering the game name, hold CTRL and you will see a tip. Try to end the game without any tip to be the Supreme Sega Gamer!</p>Challenge yourself to remember which game the music you are listening on GamePops belong to! You have to remember the game name with just about 20 seconds of each music. Easy? I dare you find all the games!<p>If you label yourself as a <strong>Sega Gamer</strong> you must pass through the Ultimate Music Challenge: the<strong>GamePops 2: Sega Generation Version</strong>!</p><p>This is the second version of the GamePops and is about games that was released to Sega consoles. Not necessarily exclusive to Sega consoles, but games that made great times on those consoles. If you had (or still has) a sega console you will love this game!</p><p>Visit the official game page, the Google+ fanpage and GamePops series Facebook fanpage.</p><p>If you like this game try the Original and Classics too!</p><p><strong>Disclaimer</strong>: This game is a tribute to all video game developers, specially the music designers. The intention of this game is to bring memories to gamers and make them remember good games that made their childhood. All the credits for the musics on this game are inside the “Credits\" screen. I couldn't find some of the credits, but if you know and it's missing, please let me know. If you have the rights of some musics inside the GamePops and you don't want they appears on the game, please send me a message and I'll remove them as soon as possible.</p><p>For the ones who are struggling to find all the answers, here they are:<br/>http://kleber-swf.com/app/gamepops2/<br/>(keep in mind that this can spoil the game for you).</p><p>Thanks for playing!</p>", "metacritic": null, "released": "2014-07-24", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/51e/51eb930d3b70267f688f847f2e1fa819.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 26, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Kleber"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}