{"id": 145623, "slug": "mourning-paradise", "name": "Mourning Paradise", "name_original": "Mourning Paradise", "description": "<p>\r\n\t Dream is the window into our unconscious. Dreams sometimes hint at us about those painful matters that demands our attention that we can't afford to acknowledge consciously. 'Mourning Paradise' is about taking that hint from your dream and working towards acknowledging that elephant in the room, however painful the truth might be.\r\n</p><p>\r\n\t 'Mourning Paradise' is also about drawing attention to the pain and hardships that goes unacknowledged by others. While some hardships like broken hearts and death of a loved one are acknowledged universally, there are some that goes unnoticed by the wide public. Even those who have experienced it themselves sometimes deny their own feelings because it is not compatible with most other people's experiences. One such case of pain that only recently came into the eyes of the public is 'Boarding School Syndrome'.\r\n</p><p>\r\n\t Young children who just became able to manage their bodily functions are taken from the arms of the mothers and fathers and into a strict institution which does not conform to the child's need but conversely requires the child to conform to them. In conforming to the institution where its stringent rule are incomprehensible, the children hide a part of themselves, their innocent selves away from themselves, smother them, and acquire a tough persona that allows them to survive.\r\n</p><p>\n<br/>\r\n\t Yet a lot of these pains are concealed from them by the mask of privilege. It costs the parents a significant amount of money to send the child to a boarding school and neither parents nor teachers allow the child to forget that. To the child it is without question that the boarding school is not the problem. Then the child loses the ability, the words to talk about the problem. Without the words that allows the child to talk about the problem, it cannot be resolved and mourned and learned from like any other hardships.<br/>\r\n\tFor me, finding the words has been reading the book 'Boarding School Syndrome', acknowledging and mourning the child in me that I smothered. 'Mourning Paradise' in this sense is my diary of my process that I invite everyone to take part in, to spread the word that comes spinkled, hidden in our dreams.\r\n</p>", "metacritic": null, "released": "2017-01-05", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/920/92074fbf817e103968d8da947142f532.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 73, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS"], "developers": ["moonmudpie"], "genres": [], "publishers": [], "esrb_rating": null}