{"id": 145751, "slug": "aliens-eat-cats", "name": "Aliens eat cats", "name_original": "Aliens eat cats", "description": "<p>Slide puzzle game with interesting twist and outstandingly interesting gameplay!<br/></p><p>Aliens landed on Earth and they are hungry. Lovely slide puzzle game cats vs aliens!</p><p><strong>Interesting STORYLINE</strong></p><p>The aliens are hungry. Feed them before the time runs up. Their favorite food? Cats! Explore the city backstreet to find kittens with the support of their meow-bot to cook some delicious meals. Block puzzle alike game with great animations, graphics and artwork!</p><p><strong>SLIDE puzzle</strong></p><p>Aliens eat cats is a puzzle-like board game about feeding three aliens with the delicious cat they adore so much. Swipe into the direction you want them to slide. The lesser movements they do, the better the score. Slide puzzle game with easy controls!</p><p><strong>Block puzzle game FEATURES and rules</strong></p><p>- The Aliens Store: Collect coins and buy better aliens. Do the right trio of aliens to improve speed and luck...</p><p>- Meow-bot: Level Up and get new recipes with more extra time.</p><p>- Collecting coins, cat, meal give precious bonus time.</p><p>- Don't take too long to catch cats. Sliding games need fast reaction and reflexes.</p><p>- If you move around too much, cats won't give extra time.</p><p>- Pay attention to the timer, if it times out, you lose the game. </p><p>- Compete against your friends in the Leaderboard. </p><p>- Earn achievements as you get better!</p><p>- Enjoy amazing graphics and unique artwork!</p><p><strong>It can get under your SKIN</strong></p><p>The slide puzzle game and its features are making it irresistible and addictive. It will easily get under your skin and you will require to enjoy it each moment</p><p><strong>Free to PLAY</strong></p><p>Aliens eat cats is completely free-to-play sliding block puzzle with in-app advertisements.</p>", "metacritic": null, "released": "2016-08-09", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/26c/26c570c1a061880ee121ee7cc3340fc7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 149, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Android"], "developers": ["Yablio"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}