{"id": 145703, "slug": "nwa", "name": "NWA", "name_original": "NWA", "description": "<p>You can only have 3 torpedoes alive at any given time. That's why you have a <em>Detonate Torpedoes</em> command so you can \"have them back\" whenever you want. (Sometimes an wandering torpedoe is perfect to surprise your enemies... Or yourself! Watch out!)</p>\r\nWhere do We Go from Here?\r\n<p>This beta can probably get a lot better with a lot of tweaks, some sounds, gamepad support, more animations etc.</p>\n<p>I will try to make it happen if there any players out there asking for it. =P</p>\r\nMaking the Game\r\n<p>This is my first game. (Actually, second...) It is beta (alpha perhaps) and I decided to publish it to find out if it is fun. Fun to someone else I mean. =P</p>\n<p>I played a similar game for years with friends on Windows. It was called <strong>Duel! v2.0</strong>, and it was awesome!</p>\n<p>Eventually I found out the creator, Guy Gervais, was inspired by a great book called The Tinkertoy computer and other machinations, by Alexander Dewdney.</p>\n<p>On chapter 8 of his book, named <em>Star Tek Dynamics</em>, Dewdney writes about a game called <strong>Star Trek</strong> or <strong>Space War</strong> that students used to play close to his office in the early seventies and goes on about how to implement a similar game.</p>\n<p>I eventually concluded that <strong>Star Trek</strong> is probably a later version of <em><strong>Spacewar!</strong></em> from 1962. (With a different Sci-Fi universe inspiration.)</p>\n<p>The gist being, that straightforward Windows game I used to play for hours with friends had a cool backstory going all the way back to the beginning of Video Games History!</p>\n<p>I had to do something about it. So I did this. =)</p>\n<p>And I hope other people will have the opportunity to find it and have fun. I don't know any friends that still gather in front of a computer to play something but I hope they still exist somewhere.</p>\n<p>It is also great to have what was previously a executable program and turn it into a web application that you can play immediately on most machines.</p>\n<p>There some fancy (and awesome) projects recreating the original <strong><em>Spacewar!</em></strong> and although they are impressive, I did not find them very fun. They lack the fast pace of <strong>Duel! v2.0</strong> and that's what I went for with <strong>NWA</strong>. Each round can take from a few seconds to one or two minutes.</p>\n<p>If read all this, thank you very much for your time. Hope you have fun!<br/></p>\r\nContact\r\n<p>Ask me anything or say anything writing to slacktracer@gmail.com.</p>", "metacritic": null, "released": "2016-05-06", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/bdb/bdb1a23470ecacc87e5b3454f473ee9a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 53, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["slacktracer"], "genres": ["Action"], "publishers": [], "esrb_rating": null}