{"id": 14595, "slug": "the-table-at-war-vr", "name": "The table at war VR", "name_original": "The table at war VR", "description": "Fantastic cards, abundant kinds of force, dazzles magics, and thrilling battles. \"the table at war VR\"  creates a new era and new Gaming model which will let people have different gaming experiences. That is “The Table War VR”, an exciting and tense trading card VR game.<br/>It was a peace world of cards,  three races lived together peacefully.  Until one day, an evil power invaded this world and soon, the peace world was replaced by wars. You are the savior of this world, you will bring the peace to this world.<br/> You will be in a fantastic magical world, you need to control the situation of war and use your magic cards to summon armies and cast the spell to defeat the enemy. Here, players will meet some formidable enemies, and experience many dangerous and perilous circumstances. If they want to be the savior and save the world players should incessant experience to get new cards and skills, challenge powerful enemies to go the higher levels. Finally, you will be the strongest in the magic world.<strong>GamePlay</strong>When you put your cards on the table, magical warriors will appear and they are courageous and unstoppable. They will kill all of the enemy and destroy their military bases.<strong>Force cards</strong>Every card will summons a lovely fighting unit and put them on the table, a living soldier will appear, they have their different images, movements and methods of attack. but , the only one common characteristic they have is fighting for you!<strong>Magic card </strong>When your army in an extremely unfavorable situation, how do you do? Powerful magics! They  will help you to turn the tide of the battle.<strong>Game Mode</strong>Story Mode: Help this card world eradicate the evil from my beloved the world and bring the peace back.<br/>Survival Mode:  The ranks of formidable enemy beat in our army. You should summon you forces to defend.<br/>PVP: Fighting with other players, they will know who is the strongest saviour.", "metacritic": null, "released": "2017-01-16", "tba": false, "updated": "2019-08-28T22:12:02", "background_image": "https://media.rawg.io/media/screenshots/d44/d448c0e34eaa8e53b0816212ede012fd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 286, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["KudaiGame"], "genres": ["Strategy", "Simulation", "Casual"], "publishers": ["KudaiGame"], "esrb_rating": null}