{"id": 14593, "slug": "redirection", "name": "Redirection", "name_original": "Redirection", "description": "“Captain's Log: All of our Robots are missing! An unknown force has scattered them across the sector! Without them, we are adrift. Their only hope of rescue lies with S.A.M, our ship's computer. But I have so many questions: Who is responsible for this? What do they want with our Robots? And will S.A.M’s advanced puzzle-solving intelligence be enough to save us?”<br/>- Captain Elisha Baley of the Starship Redirection, 2168<br/><br/>Redirection is a challenging 3D puzzle game set in Outer Space. As the Computer of an Interstellar Starship, only you can rescue it’s missing Robot crew from the perils of an unexplored asteroid belt. Across 45 hazard-filled levels, you must use the ship's teleporter to influence the paths of stranded Robots, and \"redirect\" them back to safety. As you progress through the game, you’ll discover new twists and mechanics, and uncover an exciting science fiction mystery story.Key Features<ul><li>Play through 45 puzzling levels, filled with unique challenges and evolving mechanics.<br/></li><li>Unravel the mystery of the Starship Redirection, and discover the origins of a mysterious signal.<br/></li><li>Extend your game by downloading extra levels from the Steam Workshop, or create your own using the built-in Mod Editor.<br/></li><li>Unlock exciting arcade mini-games and play them in the Robot Arcade!</li></ul>", "metacritic": null, "released": "2016-10-24", "tba": false, "updated": "2019-08-28T22:12:02", "background_image": "https://media.rawg.io/media/screenshots/4aa/4aa9d5d997203b4691b78706062b0808.jpg", "website": "http://www.redirectiongame.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 75}, "playtime": 3, "achievements_count": 21, "ratings_count": 1, "suggestions_count": 143, "game_series_count": 0, "reviews_count": 1, "platforms": ["macOS", "PC", "Linux"], "developers": ["Daniel Ratcliffe"], "genres": ["Casual", "Indie"], "publishers": ["Daniel Ratcliffe"], "esrb_rating": null}