{"id": 146060, "slug": "usa-soccer-vs-world-soccer", "name": "USA Soccer Vs World Soccer", "name_original": "USA Soccer Vs World Soccer", "description": "<p>Enjoy the tense moments of the penalty shots as if you were playing in a Football final, competing against the best teams, making the most spectacular goals and saves and along with graphics that will make you feel as if you were actually in the match. Perfect your special shots!</p><p>◉ THE MOST REALISTIC GRAPHICS</p><p>Simply amazing right from the first minute. With slow-motion replays to watch the best goals from all possible angles, so as not to lose a single detail.</p><p>◉ SIMPLE AND INTUITIVE CONTROLS</p><p>Without complicated virtual controls: Shoot the ball with your finger. Playing could not be any simpler, but mastering the game is only within reach of champions of football.</p><p>◉ 20 LOCAL OFFLINE TOURNAMENTS</p><p>These are for you to play against 100 of the best teams of the moment without internet connection.</p><p>◉ CUSTOMISE YOUR TEAM</p><p>Create the team of your dreams by customising every detail of your players, and train them in order to continue improving their skills and make increasingly spectacular goals.</p><p>◉ TOURNAMENTS WITH PRIZES</p><p>There is a new free tournament every weekend for you to measure your skills against the world, and win prizes if you are among the top 100.</p><p>◉ No Ad Spamming</p><p>Enjoy the game with complete peace of mind without and Ad spamming or cheesy in-App purchases as in most games touted as Free Game. Just the plain old paid game paying a small fee upfront and enjoying for life-time. What are you waiting for? Get it. There are spectacular goals for you to make.</p>", "metacritic": null, "released": "2015-02-12", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/b2c/b2cf4d4334f5a6f6686b4b2701ca3beb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 119, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["AQToor Software"], "genres": ["Sports"], "publishers": [], "esrb_rating": null}