{"id": 146030, "slug": "the-walk-itch-samthesomebody", "name": "The Walk (itch) (SamTheSomebody)", "name_original": "The Walk (itch) (SamTheSomebody)", "description": "<p><strong>What is The Walk?</strong><br/></p>\n<p><em>The Walk </em>is an interactive soundscape, designed to position the player within the world space though the use of sound alone. The player undertakes a condensed journey through five distinctly different areas.</p>\n\n<p><strong>Post Development Comments</strong></p>\n<p><em>This game was made as an experiment with sound design. </em></p>\n<p>A large focus toward creating this game was dedicated to generating each space and attempting to smoothly transition between them through the use of appropriate sounds. The elements considered most prominently for each zone were:</p>\n<ul><li>Ambiance: what the space would sound like if there was no interaction with it.</li><li>Player interaction: what the space would sound like due the player’s movements.</li><li>Distance: determining which sounds would the player be able to hear when they moved further away from its source.</li></ul>\n<p>Having developed this understanding, the next step was to record and acquire the sounds for each respective space. Due to each space requiring distinctly different sounds and needing to be heavily influenced by referential listening, I was limited to the amount of Foley I could record myself and therefore focused on the learning how to reuse these sounds through manipulation. An example of this is that each area has only three footsteps sounds, which are cued at random with slight changes to their dynamic quality and pitch. In order to further fill the scenes, I sourced sounds for those which I was unable to record or manipulate.</p>\n<p>In an attempt to add depth and meet the aforementioned focus points, I heavily layered each scene and began progressively removing elements so that each space seemed more natural and the player interaction could be heard more clearly. Doing this also assisted in providing a sense of progression through the space as sounds were triggered more sparsely.</p>\n<p>Finally, I added effects within the game engine to areas which I felt benefited from it, such as the tunnel reverb in the traffic area and the door echo when entering the house.</p>\n<p>One of the most disorienting elements within the game is the use of sounds within a 3D space being presented through a 2D output. This was because the game was designed in 2D, with the intention of the left and right directions relating to the respective stereo channels. However, due to an attempt to add another level of depth to certain sound effects through the alteration of their stereo properties, this problem arose. The most prominent example of this is the footstep sound effect, which has a subtle transition between the left and right stereo channels after each occurrence so as to imply the left and right feet. Because the output is only two dimensional, every sounds is presented along the X axis, which for the player is forward and back, rather than the Z axis or left and right.<br/></p>\n<p>To overcome this I could have added a dynamic difference between the left and right steps, however due to the already random changes in dynamics it seemed likely that it would not have as impactful of an effect.<br/></p>\n<p>I was also not fond of my decision for the sound used to signal the edges of the world as I felt that it broke away from the immersion of the world. Whilst this was the case, I did not change this as I felt that there was a possibility that the player might assume that it was an interaction leading to further progression. Upon reflection, making the space loop around would have been an interesting solution.</p>\n<p>Overall, the process was very educational as this was the first time I had worked on audio within the engine to such depth and detail. Whilst I am confident my coding and understanding of the engine there were a number of areas upon which I needed to expand my knowledge or simply learn. I found a new passion for recording sounds as I thought that the process humorous; parading my shoes around my desk with my hands to name one example. Furthermore I now have a firm basis upon which to bring such skills to my other projects and already have the beginning of a collection of audio assets.</p>", "metacritic": null, "released": "2017-09-22", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/3fd/3fd84eb1d2dcdfe281bc8b717b0b9320.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 10, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["SamTheSomebody"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}