{"id": 146098, "slug": "bit-2", "name": "BIT", "name_original": "BIT", "description": "<p>The world of ValGal exists on physical media, servers, to which all inhabitants of the earth who chose life after the repressions conducted in 2163 are connected.<br/></p>\n<p>Initially, it arose as an ambitious project for people in a coma and people with disabilities. But as it turned out this idea was liked by many healthy earthlings, who soon began to move into virtuality. But not everyone was ready to abandon the earthly litigation in favor of the infinite, as it seemed at that time, virtual reality. The point in the full transition to the new world was the depleting resources of the earth, the consumption of humanity reached such a scale that the earth became unable to feed everyone, so the only solution was not to kill all the infidels, no. It was transportation of people to Mars, immersion in virtuality or death. All who could afford to flew off the ground. Some people were shot, the rest were included in the network, nevertheless someone managed to hide. It is interesting that the rush forced people to connect to the network regardless of age, sex, religion, health ...<br/>In principle, people are free to choose activities in a new world, some warriors have access to drones monitoring the surface of the earth and catching fugitives. Meanwhile, while in the real world there is a war for the choice of reality in the internal, a utopia is being built ... at least so say the creators of \"Poohliashi\".</p>", "metacritic": null, "released": "2017-08-27", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/331/331b77719e05f155b2069160b50c2231.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 112, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["devnem0y"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}