{"id": 146227, "slug": "pizz-a-ween", "name": "Pizz-a-ween", "name_original": "Pizz-a-ween", "description": "<p><strong>Objetivos</strong></p><p>Debes recolectar 12 pedazos de pizza que hay ocultos en el nivel para recuperar tu forma humana.<br/></p><p>Si pasas mucho tiempo sin comer 1 pedazo te convertirás definitivamente en monstruo.</p><p><strong>Controles</strong><br/></p><p>Mover al personaje: teclas direccionales o teclas (aswd)</p><p>Saltar: barra espaciadora</p><p><strong>Pizz-a-ween</strong><br/></p><p>Era noche de brujas, yo caminaba por las calles viendo a los niños con su disfraz. De repente me encontraba en una calle oscura y solitaria, pero había un pequeño local que parecía funcionar. </p><p>Llevado por mi curiosidad decidí entrar a lo que sería una de las tiendas más antiguas de la ciudad, en la que encontré un montón de máscaras envueltas entre telarañas y opacadas por el polvo del lugar, pero 3 de ellas resplandecían en una vitrina con la luz de la luna.</p><p>Comencé a probarme una a una, tomándome fotos con el celular. Sin embargo, con la tercera mascara, algo inusual iba a pasar. No podía quitármela y al despertar estaba en un misterioso lugar que ningún ser humano podía ver jamás.</p><p>Algo dentro de mí ya no era igual, habían cambiado mis manos, mis pies y todo mi cuerpo, ahora estaba cubierto de pelo, era más alto y más musculoso, con garras y colmillos…mejor dicho, era un monstruo. ¡Qué voy a hacer!</p><p>Encontré un cartel, parecía que estaba escrito por antiguos habitantes de la isla…</p><p>\"Cuenta la leyenda que un antiguo y malvado ser había atacado el lugar, la única forma de detenerlo era atraerlo con trozos de pizza para atrapar su espíritu dentro de una máscara. Quien la utilice lo revivirá.\"</p><p><strong>Este solo es un Demo del juego final, esta diseñado para el Pizza+Halloween Jam</strong><br/></p><p><strong>Por implementar</strong></p><ul><li>Ventanas de navegacion</li><li>GUI del juego</li><li>Movimiento del personaje</li><li>Pickups y Hazards</li><li>Enemigos</li><li>Level Design</li><li>Personaje principal</li><li>Audio</li><li>Cinematica</li><li>Pros</li></ul>", "metacritic": null, "released": "2016-10-20", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/e96/e966afcd8f21fc26cf85cbe7d5de165c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 41, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["YuSe"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}