{"id": 146286, "slug": "stressfull-way-datatron", "name": "Stressfull Way Datatron", "name_original": "Stressfull Way Datatron", "description": "<p>StressFull Way Datatron</p><br/>ALPHA 1.0 at this time !<p>\"StressFull way Datatron\" is an action / arcade game where your nerves and mind will be put to the test.</p><p>Welcome to the world of \"Datatron\". You're going to become a somewhat special hacker.In this action / arcade game you will have to hack computer systems, or program, without arousing suspicions of system defenses. To get to your end you will have an arsenal for you défendres. Your skills will also evolve over time.<br/>All this of course in a world TOTALLY randomly generated.</p><p>The main features available : </p><ul><li>World generated randomly at each level, even the tutorial. Neither party will be the same !</li><li>Shop system to improve your character (or hacking program)</li><li>A growing difficulty to learn and understand the mechanics of the game.</li><li>All the blocks present in the game are destructible. You are free to make your way as you wish.</li></ul><br/>Not to arouse suspicion of the defense program you have to make your way in the system as discreetly as possible. No backtracking possible. Be careful!<p>Key features to come : </p><ul><li>Bonuses and penalties before each launch hacking which will further add to challenge of advantage and diversity in every parts.</li><li>Even more complicated levels and diversity in the blocks used.</li><li>Bonus levels and surprises ...</li><li>An endless game mode to be able to improve you and beat back with friends!</li></ul><br/>You'll understand, Datatron is a relaxing game. Everyone can play there, but be careful because the challenge is there!<p>Go to steam Greenlight to leave a positive vote.</p><p>http://steamcommunity.com/sharedfiles/filedetails/?id=888323136<br/></p>", "metacritic": null, "released": "2017-03-21", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/1cc/1cc9ac1458bc113cb89af6887638b0b3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 52, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["JemyJan"], "genres": ["Action"], "publishers": [], "esrb_rating": null}