{"id": 14638, "slug": "destiny-warriors-rpg", "name": "Destiny Warriors RPG", "name_original": "Destiny Warriors RPG", "description": "Destiny Warriors is an epic <strong>12 hour</strong> JRPG.  <br/><br/>Thirteen years ago, your village's leader set off to confront the spirit beasts that threatened to invade and destroy your home.  <br/><br/>Among these spirit beasts was a fire dragon that burned everything to ashes, a sea serpent with great healing abilities and a lightning bird that could attack faster than light itself.  While the village leader was a powerful warrior, trained in both hand-to-hand combat and magic, he could not overpower them.  <br/><br/>Ultimately, he had no choice but to sacrifice his own life by casting a powerful sealing spell on the beasts.  This trapped the beasts in the souls of three human children.  Unfortunately no one in the village, including the children themselves, knew which children's souls contained the trapped spirit beasts.  <br/><br/>Thirteen years later, as you enter the village's elite warrior academy, the spirit beasts have become restless and threaten to break free from their hosts.  As student after student goes missing, it's up to you and three friends to abandon your training and set out into the unknown world.  Use magic, might, and cunning in order to find the missing students and defeat the spirit beasts in this amazing JRPG.", "metacritic": null, "released": "2015-09-11", "tba": false, "updated": "2023-07-25T15:14:25", "background_image": "https://media.rawg.io/media/screenshots/e19/e195e5d651d6f1eb386cf732b172d42c.jpg", "website": "", "rating": 1.59, "rating_top": 1, "added_by_status": {"yet": 21, "owned": 901, "beaten": 1, "dropped": 6}, "playtime": 4, "achievements_count": 6, "ratings_count": 34, "suggestions_count": 221, "game_series_count": 0, "reviews_count": 34, "platforms": ["PC"], "developers": ["ninjalex"], "genres": ["Action", "Adventure", "RPG", "Strategy", "Simulation", "Sports", "Racing", "Casual", "Indie"], "publishers": ["EpicQuest Games"], "esrb_rating": null}