{"id": 146355, "slug": "mini-mel", "name": "Mini-Mel", "name_original": "Mini-Mel", "description": "<p>Mini Mel is a minimalistic 2D puzzle game. Mel is a small, square block tasked with moving up a tower, level by level. Activate every switch in a level by attaching a power block of the same color to power the elevator and move up to the next floor.</p>\n<p>This was made for the Minimalistic Jam 3, in the spirit of low-resolution 8- and 16-bit games. I was a little rushed, having started the jam a few days late, so I only finished four levels.</p><p>Requirements:<br/>A computer with keyboard (sorry mobile users). I recommend Chrome, Firefox, or Opera; Safari probably works, and I recommend against using IE or Edge: keyboard inputs may not work, and you'll probably have no sound/music.<br/></p><p>Technology:<br/>I created a very basic engine using the HTML5 Canvas API and WebAudio. I simulated a low-resolution by manually rendering 4x4 pixel squares, because using CSS to scale up the canvas would produce something like bilinear scaling rather than the nearest-neighbor scaling I'd need.<br/></p>\n<p>Music:<br/>I composed the music for the first and last levels, got lazy, and used the Tip Top Polka and Bach Two-Part Invention #8 in F Major for the other two.</p>\n<p>Given enough time, I'd like to flesh out the concept a little more, add more levels and music, and implement a rating system to compel the player to use the least amount of moves per level possible.<br/></p>", "metacritic": null, "released": "2018-07-16", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/b30/b30a96b5714dc83b480a09737d0b3720.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 22, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Peter Wood"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}