{"id": 1465, "slug": "vendetta-online", "name": "Vendetta Online", "name_original": "Vendetta Online", "description": "Explore the galaxy and carve out your own destiny in this free-to-play 3D MMORPG. This truly cross-platform game enables thousands of players to interact as the pilots of spaceships in a vast online universe. Players may build their characters in any direction they desire, becoming rich captains of industry, military heroes, or outlaws. A fast-paced, realtime &amp;quot;twitch&amp;quot; style combat model gives intense action, coupled with the backdrop of RPG gameplay in a massive online galaxy. Three major player factions form a delicate balance of power, with several NPC sub-factions creating situations of economic struggle, political intrigue and conflict. The completely persistent universe and detailed storyline add to the depth of immersion, resulting in a unique online experience.<br/><br/>Support for multiple platforms across desktop and mobile, all of which play together in a single unified game world. Pilots may seamlessly switch from one platform to another.<br/><br/>The game supports Extended (dual-analog) MFi game controllers, and features cross-platform voice chat, as well as voice-recognition text chat for hands-free typing, text-to-speech for reading mission and other game updates, and many other features.<br/><br/>Although the game can be played quite casually, this is a &amp;quot;real&amp;quot; PC-grade MMORPG, and is not a watered-down &amp;quot;mobile&amp;quot; game experience. Our native iOS version has exactly the same capabilities as the PC versions, with a different interface.<br/><br/>This is a very hardware-intensive game, and we recommend closing all background applications on your device to get the best performance. Vendetta Online is about a 400MB download, but will use about 800MB on your device.<br/><br/>The game is updated frequently, usually every week or two, with the developers and userbase actively discussing the future of the game on the Vendetta Online forums. Some users even choose to become directly involved, joining the volunteer &amp;quot;Player Contribution Corps&amp;quot; and creating new missions to tell stories of their own. Many frequent updates are server-side and will not result in a visible &amp;quot;iOS app&amp;quot; update.<br/><br/>If you have any problems or concerns, please contact us via email, or (preferred) by creating a Support Ticket on vendetta-online.com (more secure, and it proves the account in question is yours). We are a small indie developer, but we respond quickly. Leaving reviews is not a very effective way to reach us about problems.<br/><br/>If you are looking to try out your game iOS account on another platform, be sure to &amp;quot;Convert&amp;quot; your account with email verification. You can do this in the Options area, after logging into the game. This will change you from an auto-created account to fully custom user account with your own personal password, which you may then access from any other platform (some platforms may have additional purchase requirements).", "metacritic": null, "released": "2004-11-04", "tba": false, "updated": "2019-10-22T14:27:44", "background_image": "https://media.rawg.io/media/screenshots/730/7301e8678ef5877dd382911420cdb5b2.jpeg", "website": "http://www.vendetta-online.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "toplay": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 376, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "iOS"], "developers": ["Guild Software"], "genres": ["Action", "RPG", "Simulation", "Massively Multiplayer"], "publishers": ["Strategy First", "Guild Software"], "esrb_rating": "Teen"}