{"id": 146528, "slug": "wunjun-ai-poc", "name": "WunJun AI PoC", "name_original": "WunJun AI PoC", "description": "<p>I'm making a one-dimensional dungeon crawler or WunJun for short. This is the proof of concept for the AI. It runs off of a Finite State Machine and will try to kill you if it notices you.</p>\n<p>It has basic self preservation built in and, if it decides you're dangerous, it will change its tactics from reckless to a more careful aproach. It will adapt to the range and timings of your attacks, staying out of your range when its health is low. <br/></p>\n\n<p>In this proof of concept, you both have the same attacks and similar attributes (you are slightly faster and have slightly higher health)<br/></p>\n\n<p>The controls are:</p>\n<p>w = up</p>\n<p>s = down</p>\n<p>q = block (must be timed properly)</p>\n<p>a = counter (a block that also does a small amount of damage but takes longer to prepare)<br/></p>\n<p>e = lunge (longest range, most damaging  frontal attack)</p>\n<p>d = backstab ( short range, most damaging back attack. Does minimal  damage from the front)<br/></p>\n<p>space = dash  (can be used to travel through enemies to get behind them. Needs time to recharge.)</p>\n<p>shift (hold) = run</p><p>Tips:</p><ul><li>The attacks are colour coded. Each attack is preceeded by a particle swirling around the attacker, a specific particle for each attack.</li><li>Before engaging the AI, press all the buttons to see what each attack looks like and how much range they have. Remember, both you and the AI have the same attacks.</li><li>The square floating behind you indicates whether you can dash or not.</li><li>The triangle floating ahead of you indicates whether you can attack or not. Each attack has it's own recovery time. Try to stay out of your opponent's range while you can't attack.</li><li>Dashing behind the enemy will take them  by surprise, especially if they are preparing to attack you. Use this delay to your advantage.</li><li>Your dash takes a few seconds to recover so don't spam dash.</li><li>The AI will not notice you at first. If you're careful, you can sneak up on them to land the first strike.</li></ul>", "metacritic": null, "released": "2018-04-28", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/aca/acac7c1144e1b5ad521fdd2b44ddf693.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 5, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["igd"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}