{"id": 146632, "slug": "reality-incognita-alpha", "name": "Reality Incognita (Alpha)", "name_original": "Reality Incognita (Alpha)", "description": "<p>Reality Incognita is a first person adventure game, done in a style of old adventure games: with static screens and basic animation, it has both horror and comedy elements, full voiceover, and many comic style cutscenes.<br/><br/>THIS IN AN EARLY ACCESS VERSION WITH LIMITED CONTENT:<br/>CURRENTLY GAME HAS 3 STORY ARCS, ON 14 GAME SCREENS.</p>\n<p>THOSE WHO BUY EARLY ACCESS ARE ELIGIBLE FOR FULL VERSION WITH NO ADDITIONAL COST<br/>-----------------------<br/>Peri Res has woken up unexpectedly in a place that resembles anything but her daily routine. Upon closer inspection she discovers it’s an eerie space vessel bound for the unknown. Finding out why her current predicament is happening sets out to be our protagonist primary goal. The quest to determine and discover forthcoming events is unfortunately riddled with suspense and many dangers wait. To make matters worse the ship is constantly being sabotaged and her efforts are proving ever more difficult. Time is not on her side as she races to find out why she has been brought to this strange and vast spacefaring vessel.<br/><br/>Our story will dabble in humor at times, with many twists and turns that are sure to keep even the most demanding adventures satisfied. Be prepared for a thrilling experience that is sure to keep you guessing with an engaging narrative and tons of surprises. You are going to be on the edge of your seat from start to finish.</p>", "metacritic": null, "released": "2017-11-14", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/26c/26c1e7f90eca9b97a15ac19c15524751.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 139, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["DireBoarGames"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}