{"id": 14668, "slug": "last-dream", "name": "Last Dream", "name_original": "Last Dream", "description": "Last Dream incorporates the best features of classic RPGs: replayability and complete immersion into a vast world, rich with detail.<br/><br/><ul><li>    40+ hours of dynamic gameplay<br/></li><li>    15+ additional hours of immersive side quests<br/></li><li>    1+ hours of interspersed flashbacks<br/></li><li>    200+ compositions from talented, independent artists<br/></li><li>    50 mind-bending puzzles<br/></li><li>    200+ tracked achievements<br/></li><li>    500+ unique paths by virtue of the non-linear gameplay<br/></li><li>    701-page comprehensive Strategy Guide and walkthrough</li></ul><br/><br/><br/>Key Features<br/>Follow the rise of your modest protagonists to epic heights in a sprawling RPG packed with a vast set of challenging puzzles, hundreds of original compositions, myriad side quests, and interspersed cutscenes within an in-depth, captivating storyline.<br/><br/><ul><li>    Thoughtfully-crafted storyline with memorable characters<br/></li><li>    Classic turn-based battle system and graphics<br/></li><li>    Adjustable difficulty level and custom scripts<br/></li><li>    4-character party selected from 8 unique classes<br/></li><li>    Unlock a wide diversity of class skills<br/></li><li>    Build each character's attributes as you see fit<br/></li><li>    Leaderboards! (visit our website at http://WhiteGiantRPG.com)</li></ul><br/><br/><br/>A Deep Storyline Focus<br/>Experience a highly non-linear RPG from an independent development studio with a sprawling storyline. You commence as a modest protagonist, lost in an unfamiliar world... As you struggle to find a way back home, you uncover an increasingly malevolent and time-twisted plot to devour the ancient creatures of Terra. You must confront this corrupted power to save Terra and ultimately, yourself.<br/><br/><strong>Complex Role Playing</strong> – Explore a vast RPG where the decisions you make change the world around you. Will you gather and trade the Ancient Elven Relics for a Dorian ship, or trek through the uncharted depths of the Woods of Despair? By virtue of the choices available in Last Dream, there are over five hundred unique paths in your journey through the mystical land of Terra.<br/><br/><strong>Tremendous Replayability</strong> – Last Dream allows the freedom to choose any 4-character party you wish from 8 distinctive character classes. With over 4,000 party variations, you’ll never run out of new experiences. In addition to myriad party combinations and various selectable difficulty levels, you can also build each character as you see fit, so the possibilities are nearly endless.<br/><br/><strong>Side Quests Galore</strong> – Whether you love the rush of gambling at Lucky’s Casino, the sensation of adrenaline pumping through your gauntlet-covered veins as you stare down your opponents at Cecil’s Arena, or even the feeling of frantically racing your giant flightless bird to win first place, Last Dream is packed with gameplay enhancements.<br/><br/><br/><br/>Development<br/>Our development team is comprised of people who deeply cherish the RPGs of our childhoods.<br/><br/>We began developing Last Dream to be the central element of our decades-running annual RPG Tournament among physics graduates. That is, we started with the sole desire to craft an enduring game that we would personally enjoy.<br/><br/>As Last Dream progressed and over 50 creative individuals became involved, we realized that other people might enjoy our game as well. Now, after investing thousands of collective hours in game development and testing, and after receiving such generous support from the Kickstarter and Steam communities (<strong>thank you!!</strong>), we present you with Last Dream - the first in a trilogy.<br/><br/>The Last Dream Expansion and Last Dream II are currently in development. Our progress can be viewed here: Last Dream Expansion and here: Last Dream II<br/><br/>Creator Interview<br/><br/><br/><strong>- - - Download Episode!</strong><br/><br/>", "metacritic": null, "released": "2014-03-13", "tba": false, "updated": "2019-09-17T10:02:33", "background_image": "https://media.rawg.io/media/screenshots/f3f/f3f2803c7ee4a2a837799774623c539b.jpg", "website": "http://www.whitegiantrpg.com", "rating": 0.0, "rating_top": 3, "added_by_status": {"yet": 11, "owned": 208, "toplay": 1, "dropped": 2}, "playtime": 3, "achievements_count": 236, "ratings_count": 5, "suggestions_count": 320, "game_series_count": 0, "reviews_count": 5, "platforms": ["macOS", "Linux", "PC"], "developers": ["White Giant RPG Studios"], "genres": ["RPG", "Indie"], "publishers": ["White Giant RPG Studios"], "esrb_rating": null}