{"id": 146664, "slug": "color-blind", "name": "Color Blind", "name_original": "Color Blind", "description": "<p><strong>GBJAM5 disclaimer:</strong><br/>A game originally made for Game Boy Jam 5.</p><p>It was made under limited conditions, so it's an unfinished game. I also tried to make the game look the most like a Game Boy game as possible, so no advanced effects XD</p><p>Whether i get a good feedback or not, updates should be made to the game, like more stages, challenges and mobile input support, still keeping the Gameboy feel. For now, enjoy and thanks for playing!<br/></p><p><strong>Gameplay:</strong></p><p>You control a squid-slug-like character in 4 directions, but with one rule: the background color blends with some objects in scene.</p><p>Your character has the power of switching the background color, and then spotting \"hidden\" objects and obstacles, and in trade losing sight to the previous ones. Switching background colors is essential for a good performance in your adventure.</p><p><strong>Controls:</strong></p><ul><li>Arrow keys = Move</li><li>C (action) = Switch background colors/confirm</li><li>P = pause</li></ul><p><strong>Supporting the Project</strong></p><p>This is a free-to-play game and donations are not required. But it's much appreciated and sure helps a developer to keep improving projects and creating brand new ones! </p><p>You can also support by giving precious feedback or simply spreading the project if you like it. </p><p>Thanks in advance :)</p>", "metacritic": null, "released": "2016-10-10", "tba": false, "updated": "2019-08-28T23:22:20", "background_image": "https://media.rawg.io/media/screenshots/784/78468a8047c57c7a253e677063e6ed91.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 28, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Chroma"], "genres": ["Action", "Puzzle"], "publishers": [], "esrb_rating": null}