{"id": 146604, "slug": "survival-cannon", "name": "Survival Cannon", "name_original": "Survival Cannon", "description": "<p>Created for Ludum Dare 41 - <em>Incompatible Genres</em></p>\n<p>https://ldjam.com/events/ludum-dare/41/survival-cannon</p>\n<p>A survival game where the only way to collect resources is to Angry Birds.</p>\n<p>Beware black crates.</p>\n<p>Press the little green run button to go to a new level, and try not to starve!</p>\n<p>Wood and stone ones give wood and stone, red ones explode, black ones produce smoke monsters - which take away health - and green ones have whatever is on the picture. </p>\n<p>You can click on the crafting menu in the middle right of the screen to combine resources a la Terraria/Minecraft. Some of the resources in the upper right hand corner are clickable as well. So food will fill you up, medicine heals you, and torches are placed in the level for lighting the way at night time. Torches also are used for cooking in the crafting menu, so it’s good to have a lot of them! They’ll burn out 15 seconds after placing.</p>\n<p>You need to keep crafting cannon balls to shoot, and building a kiln will let you craft cooler cannons. If you run out of cannons, you can still shoot, but it’ll cost you health and you won’t get a trajectory indicator.</p>\n<p>You don’t have to clear a level to proceed - just blast the crates you want and try not to break the black crates. Pressing the little green runner button will go to a new area and advance time a bit, but cost food (travel works up an appetite). The idea is to survive as long as possible, but the game doesn’t currently get harder as you go.</p>\n<p>Planned additions:</p>\n<ul><li>More level configurations</li><li>Difficulty ramp (basically just dropping more black crates)</li><li>Time-based hunger</li><li>A day counter so you can say “I got to day 5!” or whatever</li></ul><p>Check out the post-jam version here!<br/>https://robotinker.itch.io/super-survival-cannon</p>", "metacritic": null, "released": "2018-04-28", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/241/241fb6978410a923a270ab5f7a6cf9e4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 58, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["robotinker"], "genres": [], "publishers": [], "esrb_rating": null}