{"id": 146631, "slug": "outrun-your-nightmares", "name": "Outrun Your Nightmares", "name_original": "Outrun Your Nightmares", "description": "<p><em><strong>OUTRUN YOUR NIGHTMARES</strong><br/></em></p>\n<p><em>Important Note: This game was intended to be played with the cloud setting enabled. Unfortunately the effect was too taxing on integrated graphic processors and has been disabled by default. However, if you have a dedicated graphics processor and can get 60+ fps with the setting enabled I highly recommend it.<br/></em></p>\n<p><strong>Can you outrun your nightmares?</strong></p>\n<p>Inspired by the nightmares in which you try frantically to run away from something but just can't get anywhere. Only by facing your nightmare time and time again and enduring the pain will you be able to get a reasonable score.</p>\n<p><strong>Don't Get Blocked In!<br/></strong></p>\n<p>Is there a cracked wall blocking you from progressing? Equip your gun and shoot like crazy! Don't keep your gun equipped for too long though, it'll slow you down. You can also shoot pesky boulders until the break.        <br/></p>\n<p>  <em>  Enjoy semi-automatic weaponry in shooter games? Use this game to train your trigger finger to click in fast bursts!</em><br/></p>\n<p><strong>Speed Control<br/></strong></p>\n<p>Remember how your gun will slow you down? Use this to your advantage: toggling your gun in midair can increase or decrease your horizontal flight speed. This will make the seemingly-impossible obstacles possible with proper speed management<strong>. </strong>If a boulder has stopped you from progressing don't worry: you can jump over it from a standstill. You'll want to put your weapon away to get enough speed to roll up and over it though.<br/></p>\n<p><strong>Default Controls (Don't like the controls? Rebind them!)<br/></strong></p>\n<p>Jump - Space</p>\n<p>Toggle Weapon - F</p>\n<p>Shoot Weapon - Mouse0</p>\n<p>Pause - E</p>\n<p><strong>Controller Support:</strong> Most controllers should be supported, unfortunately the game currently only supports buttons and not joystick axes (no triggers, thumb sticks, etc)<br/></p>\n<p><em>Developed during the BitGem Game Jam #10 </em><br/></p>", "metacritic": null, "released": "2018-06-17", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/e56/e566f373dc8bf9b51e440e9474b2ecef.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 35, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["HellJefe"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}