{"id": 14666, "slug": "black-hat-cooperative", "name": "Black Hat Cooperative", "name_original": "Black Hat Cooperative", "description": "“Listen carefully to my directions. Look to your right. There are two agents behind that door and they will reach you in 5 seconds. They just heard you. RUN!” <br/><br/>Black Hat Cooperative is an award-winning stealth game that pits you and an ally against robot agents that seek to remove you from the system. Explore complex levels filled with hidden dangers and work together to survive.<strong>Couch Co-op + Local Multiplayer</strong>Play with your friends on one computer. Choose Hammer and sneak past agents, collecting treasure, keys, and passwords along the way. Or choose Spice to get the bird’s eye view and guide your partner to treasure and safety. Information in the world and on the map must be pieced together to beat the levels. At this point there’s no support for online play.<strong>Hacking Superpowers</strong>Spice can use a hacking terminal to unlock special doors and freeze or blind enemies. But these superpowers require teamwork. Hammer must collect in-world “bits” and scan enemies to enable hacking.<strong>12 Challenging Levels</strong>Each level is crawling with robot agents including the grunt, captain, king, or the hunter, who can sniff out your trail and chase you down. Environment challenges like laser traps and sound-detecting alarms keep you on your toes.<strong>Technology</strong>Black Hat Cooperative can be played with the Oculus Rift, HTC Vive, or with dual monitors. Hammer is in VR and plays with a gamepad or Vive controllers, while the other player uses the computer's display, mouse, and keyboard.<strong>Awards</strong>Mass Digi 2015: People’s Choice<br/>Boston FIG 2014: Best Technical Quality and Best Multiplayer Awards<br/>Exhibitor at PAX East, GDC, Engadget Live<strong>Background</strong>Black Hat Cooperative started as a weekend game jam project during the 2014 Global Game Jam. Since then, we successfully funded a Kickstarter campaign and created a company, Team Future, to publish the game. Many thanks to our Kickstarter supporters, thousands of people came to our demos, and our friends who gave their time and encouragement. We hope you enjoy the game!", "metacritic": null, "released": "2016-07-29", "tba": false, "updated": "2019-08-28T17:06:19", "background_image": "https://media.rawg.io/media/screenshots/976/97667620caccda8b21068c56deb60f48.jpg", "website": "http://www.teamfuturegames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 26, "toplay": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 77, "game_series_count": 0, "reviews_count": 0, "platforms": ["PlayStation 4", "PC"], "developers": ["Team Future"], "genres": ["Action", "Strategy", "Casual", "Indie"], "publishers": ["Team Future"], "esrb_rating": "Teen"}