{"id": 14662, "slug": "the-legends-of-owlia", "name": "The Legends of Owlia", "name_original": "The Legends of Owlia", "description": "The Legends of Owlia is Gradual Games' second release for the NES, now ported for your PC! It is an action-adventure game inspired by StarTropics, Crystalis, and the Legend of Zelda. <br/>\n<br/>\r\nOnce upon a time. On a world far beyond imagining. Six great owls brought forth a land called Owlia. Together, they reigned in peace and wisdom for eighty thousand years. However, their pride in the beautiful land and sky of Owlia led them to forget the vast vast seas... Mermon, King of the Mermen, oft rose to the surface to view the Land of Owlia. His desire for sunlight, sky, and green forests grew until he decided the seas were not enough for him. He endeavored to summon the six great owls one by one. He began sapping their powers of flight, empowering his minions to float towards the Land of Owlia to claim it for his own. However, one great owl eluded him.. Silmaran, the White King. Soaring high above the Land of Owlia, as Mermon's forces grew in power, he searched for one who might heed his call to rescue the great owls and restore the Land of Owlia. <br/>\n<br/>\r\nGuide heroine Adlanniel and her owl friend Tyto to free the great owls and defeat Mermon king of the Mermen!! <br/>\n<br/>\r\n12 enemy types and 5 fierce bosses! <br/>\r\n7 full scrolling overworld maps! <br/>\r\n5 screen by screen dungeons filled with puzzles! <br/>\r\n8 cool techniques for your Owl Tyto to perform! <br/>\r\nSlash enemies with your trusty sword! <br/>\r\nPassword system to save your progress!", "metacritic": null, "released": "2017-01-11", "tba": false, "updated": "2022-04-14T16:13:13", "background_image": "https://media.rawg.io/media/screenshots/ea9/ea9339e1006234ca6b905595e9a57975.jpg", "website": "http://www.gradualgames.com/p/the-legends-of-owlia_1.html", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 7}, "playtime": 1, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 232, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["gradualgames", "Gradual Games"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Gradual Games"], "esrb_rating": null}