{"id": 14669, "slug": "tank-defense-division", "name": "Tank Defense Division", "name_original": "Tank Defense Division", "description": "<strong>Tank Defense Division</strong> is an arcade-like strategy game in which the player is a part of the Fallhearth Federation's Tank Defense Division. The player's responsible for testing out prototype tanks against foreign enemies to show their viability on the battlefield. The game comes with both single player campaigns and co-op. Along with a diverse selection of Levels, Enemies, and Game modes to Explore, Battle, Build upon, and Share. <br/><br/><br/><br/><ul><li><strong>Level editor:</strong> Allows the community to build, play and share levels with both friends and strangers.<br/><br/></li><li><strong>Campaign mode:</strong> The player battles dynamic AI through a 100 unique levels in both co-op and single player. <br/><br/></li><li><strong>Battle mode:</strong> Battle friends, strangers, and AI alike in premade levels or ones fellow players have created.<br/><br/></li><li><strong>Dynamic AI:</strong> Various types of enemies that change throughout gameplay each having their own specific abilities and weaknesses.<br/><br/></li><li><strong>Multiplayer:</strong> Play with friends and strangers against AI, together, or in an all-out firefight.  </li></ul><br/><strong>Note:</strong> UI must be navigated with the mouse and keyboard.", "metacritic": null, "released": "2016-09-09", "tba": false, "updated": "2019-08-28T22:12:00", "background_image": "https://media.rawg.io/media/screenshots/3eb/3ebd84959498c3ef76c39fa7d8dd7385.jpg", "website": "http://www.redtreestudios.net/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 6}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 143, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Christian Hooper", "Caleb Hooper"], "genres": ["Action", "Strategy", "Indie"], "publishers": ["Red Tree Studios"], "esrb_rating": null}