{"id": 14674, "slug": "oh-my-gore", "name": "Oh My Gore!", "name_original": "Oh My Gore!", "description": "You’re tired of keep fighting against the Powers of Light from within square shaped, piddling Dungeons?<br/><br/>You never really understood why you should make the effort to run after your stupid minions while being a mighty, powerful Overlord?<br/><br/>You want to be more than just a third-class theme park for obsolete do-gooders and self-proclaimed Knights of Justice?<br/><br/>Welcome to “Oh My Gore!”, the alternative in the subgenre of Evil-Overlord-Simulations!<br/><br/>In this mixture of Tower Defense, RTS and Reverse Tower Defense, you’re taking control of the revived God of War Raelius and pursue a path full of sweet revenge and bloody footprints.<br/>Command your inferior servants who will bring death and ruin to your enemies with their evil forces and powerful spells. Build up your Towers of Defense to hold against the “Heroes” of Light and send out your swarm of deadly henchmen at the same time to conquer and enslave the whole empire of Eridia.<br/><br/><ul><li>A campaign with 20 unique levels in 3 challenging difficulties<br/></li><li>6 unique Heroes with different spells and their own elite units<br/></li><li>Detailed death animations which were made with the high-tech GoreCap technology.<br/></li><li>Over 9000 liters of blood!</li></ul>", "metacritic": null, "released": "2016-10-20", "tba": false, "updated": "2022-09-16T04:24:41", "background_image": "https://media.rawg.io/media/screenshots/e93/e93b0c2606da1535263a8436013afe31.jpg", "website": "http://www.bumblebee-games.com/", "rating": 2.33, "rating_top": 1, "added_by_status": {"yet": 2, "owned": 227, "toplay": 2, "dropped": 1}, "playtime": 4, "achievements_count": 41, "ratings_count": 6, "suggestions_count": 231, "game_series_count": 0, "reviews_count": 6, "platforms": ["PC"], "developers": ["bumblebee."], "genres": ["Strategy", "Indie"], "publishers": ["Daedalic Entertainment"], "esrb_rating": null}