{"id": 147030, "slug": "evangelism-of-hexagons", "name": "Evangelism of Hexagons", "name_original": "Evangelism of Hexagons", "description": "<p>In the future human is an extinct species. Thanks to advanced tech it was possible to store our consciousness in synthetic brains and human-like bodies. Not everyone can afford them. You are just a simple soldier. Your consciousness is stored in a few cubes of your tank.  Fight artificial intelligence cubes and one day you will be able to afford a synthetic human body.  Everyone's dream is to join the elite.<br/></p>\n<p>A.I. cubes want to take other our cities and destroy our human ways by replacing our humanity with their cold robotic way of life. Soldiers like you fight to stop that. Fight for what is left of us.</p>\n<p>- Very simple and easy to start<br/>- Fight using 3 tactic settings.<br/>- Harvest cubes with various abilities and build your units. <br/>-  6 missions so far with progressing difficulty.<br/>- Easy to learn but ways to win are countless!</p>\n<p> Each mission has its own leader board so you can play competing forever, discovering new tactics, building units without opening the assembler just by using keyboard shortcuts and finding a perfect way to wage your evangelism.  You could be the best because you can memorize 3D layouts and shortcuts or because you can plan a great strategy or maybe because you are great at navigating your units. Find your way to beat the leader boards. </p>\n<p>Leave your comments to influence this game in creation. More missions are planned with developing story, puzzle levels where cubes can be used in new ways and more leader boards. Game too hard? Let us know which mission! We will post more tips but the core game play will stay the same to keep the leader board fair.</p>\n<p>Start your evangelism now, hexagonal soldier!<br/><br/>Also check out cool, different and sometimes a bit mad Android games by Zoopa Big:</p>\n<p>https://play.google.com/store/apps/dev?id=8237743763392121948&amp;hl=en<br/>https://www.youtube.com/channel/UChcT-ZNvqujfq9rGbIVBTOw</p>", "metacritic": null, "released": "2017-08-31", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/679/679b3496fc26823a93f2cc06b8a539bb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 125, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Zoopa Big"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}