{"id": 147021, "slug": "brazzaville", "name": "Brazzaville", "name_original": "Brazzaville", "description": "<p><strong> Congo explosion  </strong></p><p>L’Etat congolais face à l’explosion de Mpila et la réhabilitation du quartier</p><p>Mots : militaire ; nettoyage ; dédommagement ; collectif de victimes ; pollution ; accident ;</p><p>légitimité ; Etat ; ONG </p><p>Suite à l’explosion d’un dépôt de munition militaire dans le quartier de Mpila à Brazzaville,<br/>l’Etat congolais a dû faire appel à la communauté internationale pour réhabiliter le quartier contaminé. Cet appel a entrainé une controverse portant sur les actions de nettoyage du site pollué par l’explosion, l’existence de ce dépôt dans ce quartier populaire de Brazzaville et les dédommagement et retour des victimes. Comment cette zone militaire s’est-elle transformée en une controverse internationale ?<br/>Les acteurs présents dans la controverse proviennent d’horizons très variés, incluant l’Union Européenne, DEMETER et Mines Advisory Group et des collectifs de citoyens créés suite à l’explosion. Tous ces acteurs convergent vers la problématique du déficit de légitimité de l’Etat congolais en matière de réaction suite à l’accident. La cartographie de cette controverse illustre les manquements de l’Etat avant, pendant et après l’accident pour protéger sa population provisoirement installée dans des quartiers informels. </p><p>Elle souligne par ailleurs son déficit de légitimité et l’émergence d’acteurs internationaux ayant comblé l’Etat sur des enjeux politiques, juridiques, éthiques et environnementaux. L’expertise inexistante en matière de dépollution et déblaiement des résidus des munitions et le procès de la société civile à l’encontre de hauts gradés ont transformé un accident local en une controverse internationale.</p><p>La visualisation suit le trajet d’un enfant du quartier à trois moments de la reconstruction.<br/>L’environnement se présente comme un enjeu transversal de la controverse. Il s’agit là<br/>d’une tentative des étudiants de se démarquer des regards croisés des acteurs de la<br/>controverse et de concentrer notre attention sur la matérialité de la pollution du quartier de<br/>Mpila.</p><p><strong>Crédits</strong></p><p><strong><br/>Réalisation de la cartographie de la controverse</strong> par Antoine Leloup, Elena Giorgiana Lupu,<br/>Adrien Rousse et Eleftheris Vigne de l’ULB coordonnés par Samar Skaiki.</p><p><strong>Réalisation de la visualisation graphique</strong> par Pablo Serbeto et Maxime Baumann de l’ESA</p>", "metacritic": null, "released": "2017-11-05", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/f3a/f3abb9fd8d149e34468bcdf53f9f5a6d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 315, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Kouille"], "genres": [], "publishers": [], "esrb_rating": null}