{"id": 14712, "slug": "battle-knights", "name": "Battle Knights", "name_original": "Battle Knights", "description": "Play as the blue knight, Wonder, who is on a quest to unite the colored realms.<br/>\n<br/>\r\nBattle Knights is the kind of game your remember playing back in the days of the NES and SNES. It's an easy to play yet challenging platformer. The game may seem trivial with Wonder only being able to attack, block, and jump but, rest assured, that Battle Knights is not for the faint of heart.<br/>\n<br/>\r\nFeaturing 4 game modes (Story, Versus, Dungeon Run, and Survival) and unlockable content, you're sure to find something that suits you.<br/>\n<br/>\r\nStory Mode:<br/>\n<br/>\r\nBattle Knights contains a story mode that consists of six realms that the player must clear in order to beat the game. The realms area playable in any order the player wishes, with a boss being unlocked after the completion of each realm.<br/>\n<br/>\r\nStory mode can also be played cooperatively. All realms feature a challenge level that will unlock a bonus mode once all are beaten.<br/>\n<br/>\r\nSix Realms to clear<br/>\r\nCoop (Up to 2 players)<br/>\r\nChallenge levels<br/>\r\nBosses<br/>\r\nUnlockable content<br/>\r\nVersus Mode:<br/>\n<br/>\r\nBattle Knights also contains a versus component containing 14 stages that can be played with up to six players locally. Versus Mode can be played in any team combination (2v2, 3v3, 2v2v2, 1v3, etc) or free for all. Knights of the same color are automatically placed on the same team. This means that to play a free for all match, all players must select differing knight colors.<br/>\n<br/>\r\nUnlike Story Mode, Versus Mode has items that drop and, upon pickup, give the player a temporary ability. The frequency at which the items drop can be changed or removed completely if the players are wanting a more skill-based match.<br/>\n<br/>\r\n2-6 player competitive mode<br/>\r\nTeams in any combination (3v3, 2v2, 1v2, 1v3, etc) or free for all<br/>\r\nSame colored knights are automatically grouped into the same team<br/>\r\nLast man/team standing wins<br/>\r\nItem spawns (frequency can be changed or disabled entirely)<br/>\n<br/>\r\nBonus Modes:<br/>\r\nSome available at the start<br/>\r\nOthers must be unlocked through story mode<br/>\r\nIncludes 1-6 player coop modes", "metacritic": null, "released": "2016-08-31", "tba": false, "updated": "2019-08-28T22:11:58", "background_image": "https://media.rawg.io/media/screenshots/b78/b78089323a56504434026495928f6ccf.jpg", "website": "http://www.mirestudios.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 7}, "playtime": 0, "achievements_count": 20, "ratings_count": 0, "suggestions_count": 183, "game_series_count": 0, "reviews_count": 0, "platforms": ["Xbox One", "Linux", "PC"], "developers": ["Mire Studios"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Mire Studios"], "esrb_rating": "Everyone"}