{"id": 14721, "slug": "lilys-day-off", "name": "Lily's Day Off", "name_original": "Lily's Day Off", "description": "<strong>You just ran into the famous idol, Lilypad Lily! Will you help her or hurt her?</strong><br/><br/>You wake up on the side of the road. Upon opening your eyes, you find yourself looking directly at the famous pop idol, Lilypad Lily! But something is amiss. With each decision you make, personalities, histories, and outcomes take dramatic and wild turns. Will you help Lily find her home? Maybe you'll become her stalker? (Or perhaps she will become yours!?)<br/><br/>Try to uncover the true ending to figure out what is behind all of these strange happenings. <br/><br/><br/>Lily's Day Off is a visual novel which puts the player in the position of the main character. You will play through the game and make choices as you interact with Lily, the famous pop idol sensation.<br/><br/>However, this is not your typical visual novel where each route gives you new information on solid character personalities. As you make choices and progress in this game, your actions drastically change the character personalities, experiences, and outcomes.<br/><br/>There are 16 endings in total, each with a completely different theme.<br/><br/><strong>This is a comedy visual novel. There are no explicit scenes. There is, however, some violence and scary scenes.</strong><br/><br/><br/><ul><li>Lily has 6 different outfits she can wear!<br/></li><li>Listen to all the music in the menu!<br/></li><li>Experience endings again directly through the menu!<br/></li><li>There are secret menus to be found!</li></ul><br/><br/>I just want to say thank you to everyone who has helped me get to where I am now. I really appreciate your encouragement, and I wouldn't have gotten this far without you all.", "metacritic": null, "released": "2017-01-06", "tba": false, "updated": "2019-08-28T22:11:58", "background_image": "https://media.rawg.io/media/screenshots/336/336f7ca9d9ce1d96494c6ead9ad02742.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 25, "beaten": 1}, "playtime": 3, "achievements_count": 19, "ratings_count": 1, "suggestions_count": 216, "game_series_count": 0, "reviews_count": 2, "platforms": ["macOS", "PC", "Linux"], "developers": ["Kyuppin"], "genres": ["Adventure"], "publishers": ["Kyuppin"], "esrb_rating": null}