{"id": 147209, "slug": "misslcom64", "name": "MISSLCOM64", "name_original": "MISSLCOM64", "description": "<p>\r\n\tIn MISSLCOM64, you control the missile defence system for a small town that's under attack. Move the cursor with the arrows and send bullets up to destroy the missiles with Z.\r\n</p><p>Link to cart on Lexaloffle BBS: http://www.lexaloffle.com/bbs/?tid=3237</p><p>\r\n\tMade in 2-3 hours for LOWREZJAM. Hinged on the realisation late the night before submission that I could hack my own sprite function to make PICO-8 effectively 64x64 (by stretching EVERY sprite*2). Unfortunately this meant to stay within the 64x64 grid, I had to do a lot of manual drawing of text and write a custom function to draw numbers based on sprites too. Still, I think it came out pretty well. If I'd come up with a way to do text without drawing it in the spritesheet, I would have had an easier time I think. (And given how quickly I did the numbers rendering function, it would have been well worth the time invested.) But it would've meant either custom sprite sizes for text, or having a lot less text onscreen. So whatever. I'm pretty sure it conforms to the 64x64 grid at all times, since I don't do any drawing without the SPR64 function below, and that function should snap to the grid.\r\n</p><p>\r\n\tFor those interested, the function to 'convert' PICO-8 to 64x64 is this:\r\n</p><p>\r\n\tFUNCTION SPR64(S,X,Y) \r\n\t<br/>\r\n\tSSPR((S%16)*8,(S/16)*8,8,8,X*2,Y*2,16,16) \r\n\t<br/>\r\n\tEND</p><p>\r\n\tIf you replace all your SPR() calls with that, and keep your coordinates inside (64, 64), it should 'just work'.</p><p>EDIT: You can also just do POKE(0x5F2C,3) to achieve the same effect without all the messing about. &gt;.&lt; Oh well. It was a fun hack.<br/></p><p>\r\n\tAnyway, enjoy!\r\n</p>", "metacritic": null, "released": "2016-04-18", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/6e9/6e9ac6c8be5b9529a1e8f4fb6fc60fcf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 8, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["PROGRAM_IX"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}