{"id": 147261, "slug": "invasion-of-the-body-watchers", "name": "Invasion of the Body Watchers", "name_original": "Invasion of the Body Watchers", "description": "<p>The game<br/>is my personal remake of the classic xcom ufo defense, xcom apocalipse and the<br/>non released xcom alliance but instead of a futuristic setting, the whole<br/>premise of the game is a hybrid between the past and the present, where the sci<br/>elements are more pointed to the invasion of the body snatchers ( therefore the<br/>title homage also ) and the thing from john carpenter mixed with some<br/>lovecraftian elements. The plot baseline is that the ecosystem of the human<br/>player is beeing invaded by stealth by an unknown force, that the gameplay will<br/>reveal, each level adding one more piece of the puzzle, until the final<br/>revelation. Gameplay wise, its a two player multiplayer game, where the<br/>cityscape and battlescape provide two layers of strategy, one beeing covert and<br/>the other overt. In the cityscape each player can feel the city becoming alive,<br/>where day and night reveal the routines of its citizens, where the strategy of<br/>assimilation and counter assimilation is plotted. in the battlescape both<br/>players confront themselves in a squad tactical turn based strategy where<br/>victory will grant rewards to be applyed on the first strategic layer, the macro<br/>view of the game.Id like to point out that the present demo, is a showcase of<br/>the atmosphere that the game aims to portrait, its one of the terror missions<br/>map, therefore the strategy part is not yet present.</p>", "metacritic": null, "released": "2017-07-03", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/9ea/9ea35241817ecd3a4c1f334dadbda508.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 290, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["htmlsam"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}