{"id": 14728, "slug": "hearts-of-iron-iii-semper-fi", "name": "Hearts of Iron III: Semper Fi", "name_original": "Hearts of Iron III: Semper Fi", "description": "<p>It’s time to dust off the field marshal's baton and take command of any nation in World War II; the largest conflict in history. The first expansion to the critically acclaimed Hearts of Iron III lets you take charge - or delegate - at any level, from division to nation, through a variety of scenarios. Guide your country to glory from 1936 to 1948 - wage war on the battlefields, in the factories, and at the negotiating table, in the grandest of all World War II strategy games ever made.</p>\n<p><strong>Features:</strong></p>\n<ul>\n<li>Players can now define their own Theatres with a simple dragbox system</li>\n<li>The new Order of Battle Browser allows quick and easy reorganization of the entire Command Hierarchy</li>\n<li>The Command Hierarchy is now directly represented on the map</li>\n<li>A new Air Superiority map mode makes strategic air warfare easy</li>\n<li>At game start, each country now gets to choose its own hidden Victory Conditions. Can your enemies guess your secret agenda? </li>\n<li>HQs under AI control now have separate aggressiveness stances for Land, Air and Naval operations</li>\n<li>Countries can request specific actions from their allies for unprecedented cooperation</li>\n<li>Technological progress can now be shared with your allies</li>\n<li>Brigades can now be upgraded to more advanced types (e.g. Infantry to Motorized, or Artillery to Self Propelled Artillery) </li>\n<li>New 1940 scenario fills a gap in the game's timeline</li>\n<li>Hundreds of new events added to immerse players in their own versions of World War II, comparing the unfolding alternate timeline to real history</li>\n<li>Mighty warships can be designated the Pride of the Fleet, which is both an opportunity and a risk</li>\n<li>The AI has been improved in all areas, at all levels. It will defend in depth, marshal big naval taskforces and launch multi-stage invasions. It will perform more historical diplomacy and pursue a strategic production strategy</li>\n</ul>", "metacritic": 65, "released": "2010-06-06", "tba": false, "updated": "2023-03-13T20:00:51", "background_image": "https://media.rawg.io/media/screenshots/c1a/c1a16f42c5b5536cc12f03142356944c.jpg", "website": "http://www.heartsofirongame.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 3, "toplay": 2, "dropped": 1, "playing": 1}, "playtime": 5, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 503, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Paradox Development Studio"], "genres": ["Strategy"], "publishers": ["Paradox Interactive"], "esrb_rating": null}