{"id": 14733, "slug": "pharaoh-rebirth", "name": "Pharaoh Rebirth+", "name_original": "Pharaoh Rebirth+", "description": "<p>Dr. Jonathan Banfield, renowned treasure hunter and rabbit has finally discovered the legendary oasis of Egypt: Amshear. Brimming with archaeological artifacts, Jonathan sets out to uncover all that he can amongst the fabled ruins. However, his expedition is cut short when his ex-companion Andre Betancourt shows up to pillage the sacred site.<br />\nArmed with only his wits and his ears, Jonathan puts an end to Andre&#39;s illegal digging, and continues on his way to discovering the secrets of Amshear. With the aid of his friend, Jack, hacker extraordinaire, Jonathan finds an ancient sarcophagus in the depths of the ruins. But before he can decipher whose sarcophagus it is, Andre shows up and hastily opens it, unleashing an ancient evil, and cursing both himself and Jonathan to die in 7 days.<br />\nJonathan must now collect seven holy grails from around all of Egypt to cleanse himself of the curse of Sehur the first.<br />\nBe delighted by the quirky humor, charming characters, and the beautifully designed world, in Pharaoh Rebirth+!<br />\nFeatures<br />\nOver 80 collectible treasures scattered throughout the game.<br />\nOver 10 sub-weapons to use in your adventures.<br />\nStat boosting and ability increasing treasures that will make you the greatest treasure hunter in the world.<br />\nChoice between English or the original Japanese.<br />\nEasy, Normal, and Hard modes to customize your experience.<br />\nNever before seen extra stage, featuring new enemies and a new boss.<br />\nBoss rush mode.<br />\nA quirky sense of humor, brimming with character.<br />\nA charming cast of characters.</p>", "metacritic": null, "released": "2016-03-17", "tba": false, "updated": "2023-10-16T11:43:54", "background_image": "https://media.rawg.io/media/screenshots/3c6/3c6d08ab6a20a43d842d39d1a862d2df.jpg", "website": "http://nicoindie.degigames.com/pharaoh/", "rating": 4.17, "rating_top": 4, "added_by_status": {"yet": 4, "owned": 74, "beaten": 5, "toplay": 1, "dropped": 4, "playing": 1}, "playtime": 3, "achievements_count": 30, "ratings_count": 6, "suggestions_count": 487, "game_series_count": 1, "reviews_count": 6, "platforms": ["PC"], "developers": ["Team Ladybug", "Den-fami Nico Game Magazine", "KROBON station"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Degica"], "esrb_rating": null}