{"id": 147455, "slug": "cute-invaders", "name": "Cute invaders (itch)", "name_original": "Cute invaders (itch)", "description": "Cute Invaders\r\n<p>Grow your cute little chickens to have the cutest farm in the world! Featuring the awesome and critically acclaimed game system of loot boxes!</p>\n<p>This game is part of the LudumDare 40, fitting to the theme \"The more you have, the worse it is.\"</p>\n\r\nGame design\r\n<p>You are the owner of a little farm, growing cute chicken. Each chicken is a little tamagochi: the more you have, the more you will have to take care. On top of that, loot boxes appearing so often that you will have to open it, if only to see the screen. The more you have unopened loot boxes, the harder it is to take care of your chickens. As loot boxes drop new chickens, you are rapidly overwhelmed.</p>\n<p>An interesting fact about the game design of this game is that it sets no goal. You cannot lose, you cannot win, there is not even any scoring. Yet, the overwhelming number of actions to do puts the player in a rush for self stated goals (mainly keeping the chickens alive).</p>\r\nTechnical performances\r\n<p>To move, chickens implement <strong>steering behaviors</strong>. It is a simple system to implement (great for game jams) featuring nice organic movements. For the chickens to not cross the fence, it is as simple as implementing a steering behavior pushing them away from it when they are near. To know how far a chicken is from a fence, the game solves the fence as a line equation of the form \"ax + by + c = 0\", then compute the distance of the chicken using this formula.</p>\n<p>When we started the project, we did not though we would <strong>use maths to reduce a fence to an equation</strong>! It is quite challenging, and we are now better at mathematics :)</p>\r\nUsed tools\r\n<p>We gone for a <strong>100% Free and open source</strong> stack for this jam. Thanks to our artist's Windows that crashed two days before the jam. So we used:</p>\n<ul><li><strong>Ubuntu</strong> and <strong>Archlinux</strong> as operating systems</li><li><strong>Krita</strong>, <strong>The Gimp</strong> and <strong>Image Magick</strong> for graphics</li><li><strong>Sfxr</strong> and <strong>Audacity</strong> for sound authoring</li><li><strong>Vim</strong> for code edition</li><li><strong>RTGE</strong> (home-made game engine) as the game engine</li></ul>\r\nMore, elsewhere\r\n<p>Follow @MargaritaGadrat, <strong>the artist</strong>, on twitter</p>\n<p>Follow @RogerBidon, <strong>the nerd</strong>, on twitter</p>\n<p>Read the source code on github</p>", "metacritic": null, "released": "2017-12-04", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/20f/20f6ed81bd95750353ee7973607cd748.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 51, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["sgadrat"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}