{"id": 14740, "slug": "the-last-door-season-2-collectors-edition-2", "name": "The Last Door: Season 2 - Collector's Edition", "name_original": "The Last Door: Season 2 - Collector's Edition", "description": "In Season 2 of the award-winning hit The Last Door, delve further into the madness of the Veil as Dr. John Wakefield, psychiatrist to Season 1’s protagonist Jeremiah Devitt. Setting out in search of his client who has mysteriously vanished, Wakefield is soon drawn into the haunting web of forbidden knowledge, madness, and a much deeper conspiracy hiding it all than he ever could have imagined. As his search takes him beyond England, will he find his missing client? Or will he merely find that he, too, is about to become lost in the search for the Last Door? <br/><br/>The Last Door Season 2: Collector’s Edition brings four new episodes and exclusive extras with more mysteries, more locations, more characters and more chilling otherworldly horrors than the first Season. Journey back to Victorian England, through mental asylums, abandoned manors, opium dens and beyond in this fascinating conclusion!<br/><br/><strong>Features:</strong><br/><ul><li>Sequel to the award-winning point-and-click Victorian era horror adventure, The Last Door<br/></li><li>Search for and uncover forbidden knowledge that may be driving you mad<br/></li><li>Guide Dr. Wakefield through new locations, characters, scenes, and puzzles in a new compelling mystery<br/></li><li>Four episodes and exclusive extras and bonus content in one limited-edition set<br/></li><li>A brand new haunting, original musical score by Carlos Viola<br/></li><li>Inspired by the works of H.P. Lovecraft and Edgar Allan Poe<br/></li><li>Available now on Steam Early Access at a discounted price</li></ul>", "metacritic": 85, "released": "2016-03-29", "tba": false, "updated": "2023-08-31T08:17:10", "background_image": "https://media.rawg.io/media/screenshots/a8f/a8f2bae0d8d8aeaa79293620a4d9aa18.jpeg", "website": "http://www.postudios.com/company/games/lastdoor/index.php", "rating": 3.5, "rating_top": 4, "added_by_status": {"yet": 24, "owned": 375, "beaten": 19, "toplay": 7, "dropped": 5}, "playtime": 4, "achievements_count": 16, "ratings_count": 32, "suggestions_count": 277, "game_series_count": 0, "reviews_count": 32, "platforms": ["iOS", "PC", "Linux", "macOS"], "developers": ["The Game Kitchen", "Phoenix Online Studios"], "genres": ["Adventure", "Puzzle"], "publishers": ["Phoenix Online Publishing", "Phoenix Online Studios"], "esrb_rating": "Teen"}