{"id": 14746, "slug": "i-cant-escape-darkness", "name": "I Can't Escape: Darkness", "name_original": "I Can't Escape: Darkness", "description": "I Can’t Escape: Darkness is an atmospheric horror adventure game that pulls you into a living dungeon where everything conspires against your escape. It is an immersive journey into the unknown, personified by the Darkness itself. Your odds of escape are slim, and when you fail, the dungeon will change before you can try again. Defend yourself from the Darkness with whatever light you can find; once your light burns out, the Darkness will consume you.What You Get:<ul><li><strong>An Infinitely Replayable Living, Breathing Dungeon</strong> - Experience dim hallways and caves carved out for unknown purposes and designed to trap all who dare enter. One false step, and you will fall into darkness forever; and when you return, nothing will be exactly as you remembered.<br/></li><li><strong>The Truth About The Darkness</strong> - Discover clues about the tomb and the story of The Darkness as you try to make your escape.<br/></li><li><strong>A Guaranteed Uneasy Feeling in the Pit of Your Stomach</strong> - The very walls want you to stay; they will try everything to keep you trapped in the dark. Your eyes and ears will mislead you - you’ll want to get the hell out of the dungeon as fast as you can.<br/></li><li><strong>The More You Explore, The More You Will Find</strong> - Secrets, surprises, and special rooms are hidden on every floor.<br/></li><li><strong>Tweet Your Escape… Or Your Death</strong> - When you die, you can let your Twitter followers know how far you made it and what killed you, or perhaps if you're lucky, how long it took you to escape!</li></ul>What We Get:<ul><li><strong>The Sadistic Pleasure of Seeing You Die on Twitter</strong> - We’re watching, and every time you don’t escape, and even when you do, it brightens our day.<br/></li><li><strong>More “I Can’t Escape!”</strong> - Fancy Fish Games is a small studio; we appreciate your support, and we look forward to challenging, trapping and tricking you in more games to come!</li></ul>The Follow-Up:I Can't Escape: Darkness is the spiritual successor to our popular 2013 game \"I Can't Escape,\" which we developed in just one month, and which spooked and thrilled over 250,000 players. We decided to take the simple concept of \"I Can't Escape\" - a creepy, immersive, and expectation-challenging dungeon experience - and flesh it out into a full game while retaining the fundamental spirit of the original. I Can't Escape: Darkness is designed to invoke feelings of being lost and alone, encouraging player's imaginations to run wild while providing subtle hints of terror (rather than in-your-face savagery). What will you see and hear in the Darkness? Unpleasant things which we - the developers - intentionally placed, or terrors from your own imagination?<br/><br/> Reaction compilation for the original I Can’t Escape (click to play)", "metacritic": 40, "released": "2015-09-17", "tba": false, "updated": "2019-08-28T22:11:57", "background_image": "https://media.rawg.io/media/screenshots/07c/07cda12a93855cbe33a48ea7d1513c89.jpg", "website": "http://icantescape.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 57, "beaten": 1, "toplay": 1}, "playtime": 3, "achievements_count": 12, "ratings_count": 2, "suggestions_count": 356, "game_series_count": 0, "reviews_count": 2, "platforms": ["macOS", "PC", "Linux"], "developers": ["Fancy Fish Games"], "genres": ["Adventure", "Indie"], "publishers": ["Fancy Fish Games"], "esrb_rating": null}