{"id": 14759, "slug": "giant-machines-2017", "name": "Giant Machines 2017", "name_original": "Giant Machines 2017", "description": "Unlike contemporary simulators, the 14 main missions are all part of one story. The goal is to send a space shuttle to the International Space Station. Your tasks will be, among others:<br/>•\tTo crush mountains,<br/>•\tTo move tons of earth,<br/>•\tTo cut metal constructions<br/>•\tTo mine radioactive ores,<br/>•\tAnd to transport (rock, ore, machines… and even a space shuttle!!)<br/><br/>Our machines have the following features:<br/>•\tAccurately recreated cockpits and models,<br/>•\tCompletely analog controls of actuators and cranes,<br/>•\tFull physics simulation (no cutting corners!).<br/><br/>Your campaign takes place in 6 different geographical localizations: Greenland, Canada, Wyoming, Missouri and Florida. Thanks to a detailed depiction of the machines, you will be able to appreciate the magnitude of those beasts (compared to a human, a car and buildings placed on the map). You can also explore the machine in first person perspective; the wide view from the cockpit will immerse you in the world of really heavy machinery.<br/><br/>An alternate gameplay mode is Time Attack. It is unlocked after you complete the story mode (campaign), and is comprised of selected missions. The rewards for completing a mission in a set time are bronze, silver and gold medals, and your entry into the high scores.<br/><br/>Your hunger for knowledge will be satiated by the Machine Library. This small encyclopedia with 3D models will broaden your knowledge of the biggest machines man has ever built. Technical parameters and performance data included.<br/><br/>Machines available in Giant Machines 2017:<br/>•\tBagger – a giant among giants – a machine capable of tearing down mountainsides<br/>•\tCrawler – a standard transport platform… for space shuttles<br/>•\tDemolition – a demolition machine – for cutting steel pipes and massive scaffoldings<br/>•\tBulldozer – indispensable when you have a couple tons of earth/snow or minor objects to move<br/>•\tDumper – good for those times when you need to move a whole week’s worth of mine output<br/>•\tDigger – as the name implies, it digs in rocks – both horizontally and vertically<br/>•\tCar crane – moving several tons of containers was never this easy!<br/><br/>CHECK OUT UPDATES AND NEWS:<br/>https://www.facebook.com/PlayWayGames<br/>https://twitter.com/Play_Way<br/>http://www.playway.com", "metacritic": null, "released": "2016-09-29", "tba": false, "updated": "2019-08-28T22:11:57", "background_image": "https://media.rawg.io/media/screenshots/56f/56f5ea5a6418dc2d15d6f1a8d22a35ae.jpg", "website": "http://giantmachines2017.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 97, "toplay": 1, "dropped": 5}, "playtime": 4, "achievements_count": 14, "ratings_count": 4, "suggestions_count": 513, "game_series_count": 0, "reviews_count": 4, "platforms": ["macOS", "PC", "Linux"], "developers": ["Code Horizon"], "genres": ["Simulation", "Indie"], "publishers": ["PlayWay"], "esrb_rating": null}