{"id": 14757, "slug": "murasaki", "name": "Murasaki", "name_original": "Murasaki", "description": "A mystical world on the edge of destruction. Unlikely saviors joined by fate and duty. A mission driven by music, magic...and survival.<br/><br/>Murasaki is a hybrid shmup and puzzle game that creates intense and high-speed gameplay against a serene landscape with gorgeous music. With the ability to only fire a single bullet at a time, you must use cunning, angles and timing to survive. <br/>Random shapes will appear as the levels progress: these designs will trigger massive explosions when shot. If you can bounce corresponding shapes off of each other, they'll create a chain reaction that, with a little luck, will wipe the screen. Don't wait too long, because the enemies will overwhelm you in a second!<br/>If you can't get a clear shot, each character has a special attack with limited uses. Use them wisely to get out of a tight situation or to put the finishing blow on one of several bosses!<br/><br/><strong>Characters</strong><br/><br/>Kairi<br/>The older of the heroes, Kairi acts as a big brother, though he's not related to Satsuki. His movements are slow, but his long range shot can reach anywhere on the screen, perfect for ricochet combinations.  This however, also means that you don't have rapid shots.<br/>Kairi's special attack is a spiraling explosion that reaches most of the screen. This bomb can absorb enemy's bullets and destroy multiple targets. Use it wisely.<br/><br/><br/><br/>Satsuki<br/>The younger hero, Satsuki is impetuous and headstrong, and it shows in her attack formation. Satsuki can move across the screen quickly, but the range of her shots is very short. Sometimes they won't reach the enemy.<br/>However, using her speedy shots, you can bounce the explosive blocks farther than Kairi, which makes it easier to create a chain attack with other blocks. Just be careful not to bounce them too far, or the explosion won't reach the enemy!<br/>Her special attack is a cross-formation energy wave. It hits harder than Kairi's, but could easily miss if the timing is off. Use it wisely.<br/><br/><br/><br/>Find your center and get into a flowing rhythm of evading and exploding. If you can master the mechanics, Murasaki is insanely satisfying, mixing the mayhem and the tranquil music in a beautiful dissonant clash. Failure means death, swift and painful. Don't look at where the bullets in front of you go: plan for where the explosions will happen afterwards.<br/><br/><br/><br/><br/>There is a long and tragic story within Murasaki: each successful (and even unsuccessful) chapter unlocks new information, history, bios and even musical tracks. To truly understand the full game, you must become an expert with both Kairi AND Satsuki. It's daunting, it's hard, but the satisfaction of a full unlock is unmatched.ConfigYou can start a config tool from \"Launch Configuration Tool\" when you start the game.<br/><br/>Here, you can configure the screen size, BGM/SE ratio, key bindings, etc.<br/><br/><strong>The death of an empire. The rise of darkness. And two heroes alone combat a broken soul.</strong>", "metacritic": null, "released": "2016-05-12", "tba": false, "updated": "2019-08-28T22:11:57", "background_image": "https://media.rawg.io/media/screenshots/54c/54c6c996551d533070e828b777163281.jpg", "website": "http://members.jcom.home.ne.jp/wtetsu/mu/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 42, "beaten": 1, "toplay": 3, "dropped": 1}, "playtime": 4, "achievements_count": 48, "ratings_count": 2, "suggestions_count": 376, "game_series_count": 1, "reviews_count": 2, "platforms": ["PC"], "developers": ["Katatema"], "genres": ["Action", "Indie"], "publishers": ["AGM PLAYISM"], "esrb_rating": null}