{"id": 14768, "slug": "king-arthur-ii-the-role-playing-wargame", "name": "King Arthur II: The Role-Playing Wargame", "name_original": "King Arthur II: The Role-Playing Wargame", "description": "Critically praised by reviewers and gamers alike, King Arthur was received as one of the biggest surprises to emerge on the gaming scene in 2010. Now the Fantasy/Roleplaying RTS returns in a sequel set to push the boundaries of the genre even further. <br/>\t\t\t\t\t\tOur story begins long after young Arthur pulled the enchanted sword out of the stone, united the war-torn land of Britannia, gathered the Knights of the Round Table and secured peace in Camelot aided by the might of the Holy Grail. Where legends normally end, King Arthur II begins on its own gruesome tale... <br/>\t\t\t\t\t\tKey Features\t\t\t\t\t\t<ul><li>Dark fantasy setting. King Arthur is now the Maimed King, trying to mend a land torn asunder as he strives to heal himself.<br/> </li><li>Intense boss fights, where the hero’s forces are pitted against unique and terrifying foes.<br/> </li><li>Lose yourself in a stunning story that unfolds over a huge 3D campaign map featuring knightly quests and other special events<br/> </li><li>Wide range of camera control options, a revised animations and an extensive tutorial creating a more accessible and visually stunning experience<br/> </li><li>Experience huge real-time battles featuring thousands of soldiers and flying fantasy monsters <br/> </li><li>Battle enemies which employ unique war tactics and cast fantastic spells<br/> </li><li>Your choices will unlock special content, spells and units with plenty of new and unique possibilities with every choice<br/> </li><li>Lead major heroes who possess extraordinary powers<br/> </li></ul>", "metacritic": 66, "released": "2012-01-27", "tba": false, "updated": "2024-01-06T09:01:14", "background_image": "https://media.rawg.io/media/screenshots/ab8/ab837b3bfb452cf6217c29e50943c206.jpg", "website": "http://www.kingarthurii.com", "rating": 2.81, "rating_top": 3, "added_by_status": {"yet": 24, "owned": 449, "beaten": 4, "toplay": 7, "dropped": 3}, "playtime": 1, "achievements_count": 23, "ratings_count": 16, "suggestions_count": 531, "game_series_count": 11, "reviews_count": 16, "platforms": ["PC"], "developers": ["Neocore Games"], "genres": ["RPG", "Strategy"], "publishers": ["Paradox Interactive"], "esrb_rating": null}