{"id": 147762, "slug": "500-days-of-twilight", "name": "500 Days of Twilight", "name_original": "500 Days of Twilight", "description": "<p>*GAME IS 75% OFF IN ALPHA, WILL BE 50% OFF IN BETA*</p><p>Enter the forest of Naun, a mysterious amazonian wasteland full of creatures, both vile and beautiful. Can you survive in a place you will never truly understand?</p><p>We are Xavier Games. A fresh out of university development company consisting of three people. Our favourite games (and inspritations!) include Dark Souls, Discworld, Okami and Ico. We also like naps.</p><p>Features:</p><p>-A huge, spanning open-world area full of secrets to discover.</p><p>-An in-depth crafting system, including building creation and weapon modification.</p><p>-Friendly wildlife for you to hunt or befriend.</p><p>-A deep lore crafted by our talented writers at Xavier games, we will not tell you the story straight off, you must hunt for clues and read item descriptions (similar to Dark Souls)</p><p>-A vast number of completely unique creatures and monsters.</p><p>-Online multi-player with support for up to 250 players.</p><p>-RPG mechanics and skill system.</p><p>-Dynamic weather and terrain deformation.</p><p>-Building destruction.</p><p>Features in the technical alpha (available NOW if you buy the game):</p><p>-A large landmass for you to explore.</p><p>-Churches, landfill sites and more.</p><p>-Weapons that include a bow and medieval mace.</p><p>-A first look at our hazy art-style and lore for the game.</p><p>Expect bugs and crashes, the usual early access stuff. Please suggest new features that we can add and any bugs you come across!</p>", "metacritic": null, "released": "2015-07-08", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/691/691c19801616dc3ff5526421b7cb9e58.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 135, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["XavierGames"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}