{"id": 147777, "slug": "mystic-cats-invasion", "name": "Mystic Cats: Invasion", "name_original": "Mystic Cats: Invasion", "description": "<p><strong><em>[German]</em></strong></p>\n<p><strong>Geschichte:</strong><br/></p>\n<p>Eine unbekannte Alienrasse, startet eine Invasion auf Cafutopia, der Heimat der Katzen. Mit Hilfe eines Transformationsstrahls, wollen die Eindringlinge sämtliches Gemüse befreien und daraus eine Armee aufbauen. Nur die Mystic Cats und ein geheimes Artefakt, können diese Bedrohung abwehren.</p>\n<p><strong>Allgemeine Informationen:</strong></p>\n<p>Mystic Cats – Invasion ist eine richtige Premiere für uns! Es ist nämlich unser erstes, in Unity entwickeltes Spiel. Und als 2D-Plattformer, ist es eine kleine Hommage an die Genre Klassiker, der 90er Jahre.<br/></p>\n<p><strong>Information zur Demo:</strong><br/>Das Spiel befindet sich in einem sehr frühen Entwicklungsstadium. Wir möchten allerdings bereits in dieser Phase, so viel Feedback wie möglich einholen und eure Meinung darüber hören. Einfach einen Kommentar, unten im Post \"Feedback\" hinterlassen. Es ist unser Ziel, dieses Spiel gemeinsam mit euch zu entwickeln.<br/></p>\n<p>Die Demo besteht derzeit aus 4 spielbaren Level. Sammle Münzen und tausche sie anschließend im \"Furshop\" gegen Extras ein.<br/></p>\n<p>Anmerkung: Der \"Furshop\" befindet sich ebenfalls auf der Weltenkarte. Allerdings ist dieser in der ersten Demo noch nicht vorhanden.</p>\n<p><strong>Informationen zur Steuerung (Keyboard)</strong><br/></p>\n<p><em>Allgemein:</em><br/>Spiel beenden - Esc <br/>     <br/><em>Karte:</em><br/>Rauf - Pfeil Rauf<br/>Runter - Pfeil Runter<br/>Links - Pfeil Links<br/>Rechts - Pfeil Rechts<br/>Level starten - Space <br/>          <em><br/>Level:</em><br/>Links - Linker Pfeil<br/>Rechts - Rechter Pfeil<br/>Springen - Space<br/>Sprint - Linke Shift + Links/Rechts <br/></p>\n<p>Wir freuen uns auf Feedback von euch und viel Spaß beim Ausprobieren.</p>\n<p><strong><em>[English]</em></strong></p>\n<p><strong>Story:</strong><br/>An unknown alien race, starts an invasion on Cafutopia, the home of the cats. With the help of a transformation beam, the invaders want to free all vegetables and build an army from them. Only the Mystic Cats and a secret artefact can ward off this threat.</p>\n<p><strong>General information:</strong><br/>Mystic Cats - Invasion is a real premiere for us! It is our first game developed in Unity. And as a 2D platformer, it is a small tribute to the genre classics of the 90s.</p>\n<p><strong>Information about demo:</strong><br/>The game is in a very early stage of development. However, in this phase, we want to get as much feedback as possible and hear your opinion about it. Just leave a comment in the post \"feedback\" below. It is our goal to develop this game together with you.</p>\n<p>The demo currently consists of 4 playable levels. Collect coins and then exchange them for goodies in the \"Furshop\".<br/></p>\n<p>Note: The \"Furshop\" is also on the world map. However, this is not yet available in the first demo.</p>\n<p><strong>Information about gameplay (keyboard)</strong><br/></p>\n<p><em>General:</em><br/>Exit game - Esc  <br/>          <br/><em>Map:</em><br/>Up - Up arrow<br/>Down - Down arrow<br/>Left - Left arrow<br/>Right - Right arrow      <br/>Start level - Space <br/>           <br/><em>Level:</em><br/>Left - Left arrow<br/>Right - Right arrow<br/>Jump - Space<br/>Sprint - Left shift + left/right</p>\n<p>We are looking forward to your feedback and have fun with the demo.</p>", "metacritic": null, "released": "2017-06-30", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/250/2501406f9096a6766dd3f519bb5cbfca.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 30, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ENiEX"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}