{"id": 1478, "slug": "final-fantasy-all-the-bravest", "name": "FINAL FANTASY ALL THE BRAVEST", "name_original": "FINAL FANTASY ALL THE BRAVEST", "description": "FINAL FANTASY ALL THE BRAVEST—A pick-up-and-go game with massive battles!<br/><br/>■Take part in intense combat with the largest parties in FINAL FANTASY history!<br/>FINAL FANTASY ALL THE BRAVEST is a casual and light-hearted game in which you continuously battle enemies to advance through the many available stages. Defeat foes to level up, which in turn grants you character slots to add more and more members to your party.<br/>Simply tap or drag your finger over a character to unleash an attack. Touch multiple characters in quick succession to experience exhilarating and fast-paced battle unlike anything you’ve ever played before!<br/>Once every three hours, the Fever option will appear. Once activated, you will be able to attack without waiting for ATB gauges to refill as long as the chocobo-themed music is playing. Deal as much damage as you can before the battle fever ends!<br/><br/>■Featuring nostalgic pixel art and music from throughout the FINAL FANTASY series!<br/>Progress through the game to unlock over 20 different classic jobs, including warrior, monk, red mage, and more! Each job brings its own special abilities to the battleground, where you will encounter timeless FINAL FANTASY foes such as behemoths, bombs, and cactuars. At the end of each stage waits a harrowing encounter with a fiendish FINAL FANTASY boss!<br/>The game’s musical library comes packed with over 30 songs from the series, the majority of which are themes from battle. The perfect soundtrack to listen to as you crush your enemies and see them driven before you!<br/><br/>■Track your collection of every character, enemy, and item with in-game catalogs!<br/>The game’s three catalogs will keep a record of every character that joins your ranks, every enemy you encounter, and every item you obtain. Collect them all and open the catalogs to flip through the nostalgia whenever you like!<br/><br/>■Take part in leaderboards and social networking features!<br/>Global leaderboards will rank players based on stats such as the amount of damage dealt in the course of a single Fever. You will also be able to track progress and other feats using the game’s achievement system. Social networking features allow you to post directly to Twitter, and reward you for doing so by granting additional member slots. Tweet away to increase the size of your party for an even more exhilarating experience!<br/><br/>■Purchase premium characters and new game worlds!<br/>The in-game shop offers access to 35 famous characters from a number of FINAL FANTASY titles. Each purchase ensures you will receive a new, random character, and FINAL FANTASY characters who before existed only as polygons have been redrawn here in original pixel art form! Which powerful favorites will join your party? You are also able to purchase additional game stages from FINAL FANTASY VII, FINAL FANTASY X, and FINAL FANTASY XIII. Board airships bound for these new worlds and expand your adventures and collections!", "metacritic": null, "released": "2013-01-16", "tba": false, "updated": "2019-07-29T18:35:57", "background_image": "https://media.rawg.io/media/screenshots/a04/a04e38c3b2b79abb19ceed0c7e986c4f.jpg", "website": "http://www.jp.square-enix.com/ff_atb/en/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 5, "owned": 3, "beaten": 2, "dropped": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 4, "suggestions_count": 198, "game_series_count": 0, "reviews_count": 4, "platforms": ["Android", "iOS"], "developers": ["Square Enix"], "genres": ["RPG", "Arcade", "Casual"], "publishers": ["Square Enix"], "esrb_rating": "Everyone 10+"}