{"id": 14787, "slug": "debugger-316-hacknrun", "name": "Debugger 3.16: Hack'n'Run", "name_original": "Debugger 3.16: Hack'n'Run", "description": "Your keyboard is the strongest weapon in this puzzle/action platformer while you're helping the Debugger 3.16 to find and delete all errors and bugs in the latest game of its developer. Use program code to manipulate objects, foes and even the Debugger 3.16 itself.<br/><br/>Hello human user!<br/><br/>My name is Debugger 3.16, I’m a debug program and I need YOUR HELP to find and delete all BUGS in the newest game of my developer, Mr. Schaefer. PLEASE HELP!<br/><br/>I’m the 316th version of debug functions created by Mr. Schaefer. However, my predecessors had been lost in the endless scripts of Mr. Schaefers program or MUTANTED TO BUGS… :(<br/><br/>I don’t want to be tranformed in such a brainless creature - that’s the reason I’m asking you today to help me. A scan of your Steam achievements showed me that you have enough experience to guide me through the DARK CYBERSPACE and the different game worlds Mr. Schaefer created. <br/><br/>I’ll show you some tricks of my world - we’ll hack objects and delete our foes with program code! Don’t worry, you don’t need any programming skills, I’ll teach you everything you have to know step by step. <br/><br/>My developer is not the best programmer in the world so we have to deal with thousands of bugs, but with such a talented gamer like you we should be able to do it.<br/><br/>PLEASE…. HELP! I… WANT… TO… L I V E !!!<br/><br/><ul><li><strong>Experience twisted puzzle action in a huge, dangerous cyberworld!</strong><br/><br/>Discover different game worlds and save all the 315 predecessor of the Debugger 3.16 which mutanted to bugs or got trapped<br/><br/></li><li><strong>Thousands of bugs to deal with!</strong><br/><br/>Fight against small bugs, big bugs, shooting bugs, intelligent bugs, not so intelligent bugs, spewing bugs, bugs with one eye, bugs with more then one eye, king bugs, queen bugs and even evil boss bugs<br/><br/></li><li><strong>Learn and use program code to overcome your foes and stay alive!</strong><br/><br/>You don't need any coding skills, the Debugger 3.16 will show you everything you need to know step by step<br/><br/></li><li><strong>Meet the developer of the game!</strong><br/><br/>Yes, that's right, from time to time you will see the developer and you will also hear his voice (don't know if this a good thing x°)<br/><br/></li><li><strong>Use the learned things to program your own game!</strong><br/><br/>You’ll get access to a step-by-step tutorial which shows you how to program a small game right from the start. Most functions used in that tutorial are similar to the ones in the main game so it’s much easier for you to master them</li></ul><br/>Here're the thoughts of some Steam users:<br/><br/>\"I LOVE the command input! Wonderful, will buy!\"<br/><br/>\"I like the art style keep it going!\"<br/><br/>\"Computer Themed with some comedy. :) Epic Throw in some easter eggs. Reminds me of ole school gaming :) \" <br/><br/>\"Oh excellent! As a web developer I want it! Just fun to debug in a game, but in a shooter game! I ever wanted shot my bugs with a gun! :)\"<br/> <br/>\"This is such a great concept. I have a feeling this will instill a curiousity for programming in people or children who have never tried it.\"<br/><br/>\"Watched the video, now wantwantwantwantwant.\"This game is made...<br/><ul><li>... for all who want to play a puzzle-platformer of the other kind<br/></li><li>... for all who want an easy access into the world of game programming (you don't need previous knowledge)<br/></li><li>... for all developer and programmer in this world who hate bugs and want to get revenge</li></ul>", "metacritic": null, "released": "2017-06-20", "tba": false, "updated": "2019-08-28T22:11:56", "background_image": "https://media.rawg.io/media/screenshots/cd7/cd7ea32144ff87f8731179fbf38991a0.jpg", "website": "http://www.spiderwork-games.com/debugger.htm", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 16}, "playtime": 4, "achievements_count": 8, "ratings_count": 0, "suggestions_count": 424, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Spiderwork Games"], "genres": ["Indie"], "publishers": ["Spiderwork Games"], "esrb_rating": null}