{"id": 148066, "slug": "hungry-hal-zombie-infinite-runner", "name": "Hungry Hal - Zombie Infinite Runner", "name_original": "Hungry Hal - Zombie Infinite Runner", "description": "<p>Hal has become infected with a zombie virus, and is now one of the undead. It's not his fault, and now he is trying to survive. Help Hal stay alive by consuming human brains so he can keep on running and possibly get to the end of this crazy adventure.</p><p>Do you have what it takes to help Hal in this free zombie game? Go on a full zombie assault as you move Hal between one of 3 paths to help him avoid obstacles and collect bones to buy new upgrades. Compete for high score in 3 different leaderboards, and be the first of your friends to unlock all of the achievements. Hungry Hal may be undead and have a craving for brains, but at the end of the day, he just wants to survive the apocalypse just like everyone else. Help the friendliest zombie you ever met reach the end. Hal is no stupid zombie, he wants to live.</p><p>Gameplay:</p><p>Hungry Hal is a fun, 2d endless runner game. It could also be called a 2d path runner. Either way, you help Hal avoid obstacles by dashing him between 3 paths. Along the way your brain meter will start to dwindle so you need to constantly be munching on brains to stay alive. Hal is a hungry zombie after all. </p><p>Features:</p><p>- Addictive Gameplay</p><p>- 5 Increasingly Difficult Levels. (Including a Farm, Forest and Highway)</p><p>- Collect bones to buy power ups</p><p>- 4 powerups to help aid your adventure</p><p>- Cool, funny and humorous graphics and sounds.</p><p>- Full Gamecenter support to keep track of your high scores and you can compete in one of 3 leaderboards.</p><p>- Game center achievements. Future upgrades will expand on Achievements.</p><p>- Actually a free game, f2p (Free to play)</p><p>- Great zombie game for kids and the rest of the family too. Making it a great game to play together and try to top one another high scores.</p>", "metacritic": null, "released": "2014-10-25", "tba": false, "updated": "2019-10-22T14:13:26", "background_image": "https://media.rawg.io/media/screenshots/e9b/e9b1c11f567014326456ac0fd519dc69.jpg", "website": "http://www.elf-games.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 172, "game_series_count": 0, "reviews_count": 1, "platforms": ["Web", "iOS"], "developers": ["arcadEd", "Edward Farias"], "genres": ["Action", "Racing", "Arcade"], "publishers": ["Edward Farias"], "esrb_rating": "Teen"}