{"id": 14835, "slug": "quick-slick-deadly", "name": "Quick Slick Deadly", "name_original": "Quick Slick Deadly", "description": "<strong>Word of Caution:</strong><ul><li>Quick Slick Deadly is designed to be played with a mouse. If you are not comfortable with using a mouse for skillful play, you will most likely not enjoy this game.</li><li>Quick Slick Deadly is all about learning the game's mechanics and mastering them for reaching high scores. Compared to other Shoot 'em Ups, the mechanics are plenty. They are explained via short text+voice messages at the start of every mission. It is essential to pay attention to these pieces of information, or else you will not understand how to play. If you do not have the patience for this, this game is not for you.</li></ul><br/><br/><strong>Game Summary</strong><br/><br/>Fly through space and overcome a variety of enemies and obstacles as one of three different classes.<br/><br/>As the Fighter, you'll fire a weapon that although very weak covers an increasingly larger area if you continue to destroy your enemies. You'll also be able to copy the attacks of your enemies by destroying three of a kind in a row!<br/><br/>As the Survivor, you'll gain energy by daring to get close to enemy attacks. You could use this energy to either block attacks or wait for maximum energy to perform a screen-filling attack. If you manage to reach a high speed, your ship enters ghost-mode and becomes invincible!<br/><br/>As the Trickster, you'll be able to perform various risky maneuvers to unleash powerful attacks. Wield a boomerang that is deadly to your enemies but takes away your control over your ship. Use energy to inflict great damage that returns enemy attack damage right back at them! If you have enough speed you'll be able to destroy your foes by simply crashing into them!<br/><br/>Learn to master Quick Slick Deadly through step-by-step missions and then show off the hardcore gamer within you with your perfected high-scores and excellent completion times. Are you ready to face a challenge?<br/><br/>For more information, check out the in-depth guide at: http://cdn.akamai.steamstatic.com/steam/apps/399270/manuals/In-Depth_Guide_to_Quick_Slick_Deadly.pdf?t=1450297586<br/><br/><strong>Key Features</strong><br/><br/><ul><li>Play as three completely different classes: Fighter; Survivor; and Trickster.<br/></li><li>Probably the only scrolling shooter where the scrolling speed of the screen is not fixed, but can be manipulated by the player, adding the possibility to do time trials besides the usual score hunting.<br/></li><li>While mostly side-scrolling, the view occasionally switches to top-view to enable more interesting gameplay situations.<br/></li><li>It’s not all about shooting, but also about maneuvering. The various environmental hazards underline this feature, which are not only deadly to you, but also to your enemies.</li></ul>", "metacritic": null, "released": "2015-09-21", "tba": false, "updated": "2022-09-29T23:50:05", "background_image": "https://media.rawg.io/media/screenshots/0cc/0cc4d6d64105d67d10563eaf4e008259.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 135, "dropped": 3}, "playtime": 4, "achievements_count": 120, "ratings_count": 3, "suggestions_count": 300, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC"], "developers": ["Adventurous Productions"], "genres": ["Action", "RPG", "Indie"], "publishers": [], "esrb_rating": null}