{"id": 14858, "slug": "ecco-the-tides-of-time", "name": "Ecco: The Tides of Time", "name_original": "Ecco: The Tides of Time", "description": "<p>The Vortex, the nearly invincible, secret, yet supremely dangerous enemy, now seems so far away.<br />\nIt’s only been a short time since this monster tore Ecco’s family from Home Bay. Then Ecco braved the unknown waters to find and defeat this menace that fed on the creatures of the sea.<br />\nThe Vortex Queen, though weakened, was not destroyed. She followed Ecco from her hive in deep space back to this new, nourishing planet. Now, plunging into the warm waters of Earth, she seeks out a deep chasm and sinks into the abyss, where she feeds upon the Earth as she spawns streams of Vortex young.<br />\nHer feeding builds in strength, creating a downward current against which small fish struggle in vain. She is creating a new Vortex race, and her presence on Earth bodes doom for all its creatures!<br />\nEcco must rid the world of this engulfing evil. Even as he tumbles in the waves, the future is unfolding. But must it be a dark future ruled by the Vortex and – lifeless, miserable and cold? Does Earth stand a chance<br />\nEcco must stop the Vortex! He is “the stone that splits the stream of time.” He now faces his most dangerous quest yet. For it is not just his dolphin pod at stake, but the Earth and all living beings!</p>", "metacritic": null, "released": "2007-07-02", "tba": false, "updated": "2020-01-28T05:28:04", "background_image": "https://media.rawg.io/media/screenshots/615/615a29b26081cf3d553d4d5ae5bf2b6e.jpg", "website": "http://www.sega.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 4, "beaten": 2, "dropped": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 293, "game_series_count": 0, "reviews_count": 2, "platforms": ["Genesis", "PC", "Wii"], "developers": ["SEGA"], "genres": ["Adventure"], "publishers": ["SEGA"], "esrb_rating": null}