{"id": 14852, "slug": "mr-makeshifter", "name": "Mr Makeshifter", "name_original": "Mr Makeshifter", "description": "To play the game 'straight' you would reach each successive exit until you surmount a final challenge. Action-driven puzzle elements encourage exploration and backtracking, and could lead you to alternative routes, or simply spice up the game world based on your choices.<br/><br/><br/><strong>Tools and 'Crafting'</strong><br/>Tools are strewn across the levels, and are sometimes tied to narrative outcomes. Activate two tools simultaneously to 'combine' them at the touch of a button, on-the-fly, to maintain the momentum of play.<br/><br/>For example: while wielding a pole, activate your spring as well to instantly have a pogo stick, then also activate a spike to have a pogo-drill that destroys terrain as you bounce.<br/><br/><br/><strong>Food</strong><br/>Food works in much the same way. For example: combine a sprig of death-fern with a haunch of fresh meat for a somewhat... nourishing morsel.<br/><br/><br/><strong>Player-Driven Endings</strong><br/>Uncover narrative threads that mutate the game world and on occasion lead you to alternative routes.<br/><br/>For example: you may choose to help a creature. They may lay an egg. The egg may hatch. The hatchling may follow you. A few events down the line and this creature could influence a unique ending for you. It may simply add flavour to the usual route. The point is that you make action-based decisions that mutate the game world.<br/><br/><br/><strong>Facebook</strong>: http://www.facebook.com/arborealgames<br/><strong>Twitter</strong>: http://www.twitter.com/arborealgames<br/><br/><br/><strong>Features</strong><br/><ul><li>Randomly generated levels<br/></li><li>Combine tools for varied on-use effects and movement styles<br/></li><li>Action-driven narrative choice<br/></li><li>Real-time 2D shadows make the experience much more tactical (which is a lot more important than it sounds)<br/></li><li>Extensive tutorial<br/></li><li>Playable with an X-Box gamepad (Recommended actually)</li></ul><br/><br/><strong>Design Goals</strong><br/><ul><li>Ultimate replay value.<br/></li><li>Loads of possible equipment combinations.<br/></li><li>To utilise the core mechanics of picking up, dropping, combining, storing, using, and consuming tools for as many aspects of play as possible, to prevent a disjointed experience.<br/></li><li>Multiple methods for tackling multiple potential goals. To an extent, you loosely define these goals yourself.<br/></li><li>Through mastery of the game's mechanics and equipment combinations, moment-to-moment gameplay decisions and goals shift from simple wanderlust to deliberate strategy.</li></ul>", "metacritic": null, "released": "2015-08-21", "tba": false, "updated": "2019-08-28T22:11:53", "background_image": "https://media.rawg.io/media/screenshots/7c0/7c046e160413b82c146f98d59a1784b6.jpg", "website": "http://arborealgames.com/Games/MrMakeshifter/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 24}, "playtime": 4, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 181, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux", "macOS"], "developers": ["Arboreal Games"], "genres": ["Action", "Adventure", "Casual", "Indie"], "publishers": ["Arboreal Games"], "esrb_rating": null}