{"id": 14855, "slug": "nestalgia", "name": "NEStalgia", "name_original": "NEStalgia", "description": "\"With a ton of content and a charming 8-bit world, you just can't go wrong\" - <strong>The Escapist</strong><br/>\"NEStalgia is exactly what you'd expect if the original Final Fantasy and Dragon Warrior games were shared worlds. Fantastic.\" - <strong>1UP</strong><br/><br/><br/><strong>NEStalgia</strong> is an original multiplayer RPG inspired by the glory days of traditional console RPGs. Essentially \"Dragon Warrior 3 meets World of Warcraft\", NEStalgia is an amalgam of the best generations of RPG gaming.<br/><br/>Players wage classic turn based battles in multiplayer parties while enjoying modern trappings such as a full-featured quest system. Those who prefer to go solo can recruit almost any monster in the game to fight alongside them as they explore every nook and cranny of NEStalgia's expansive 8-bit world.<br/><br/><br/>NEStalgia can be played locally in single player mode or in small private games with friends. Where the game really shines, however, is on larger dedicated servers with 50+ online players. On dedicated servers you can test your might in NEStalgia's balanced and competitive PvP battles, or get 8-bit rich by selling rare loot on the player auction house. If you're looking to make new friends to adventure with then you can always join or create a custom guild. In order to tackle NEStalgia's difficult end-game content you're going to need every bit of help that you can get.<br/><br/><br/>NEStalgia is constantly evolving and expanding, ensuring that players will constantly have new updates to look forward to. Purchasing NEStalgia guarantees full access to all future updates and content expansions at no additional charge.<br/><br/>Players can keep tabs on what's in the works for future NEStalgia updates by checking out the Silk Games development blog: http://silkgames.com/blog/<br/><br/><br/>A \"New Indie Hero\", one of the best entries in the 2012 Independent Games Festival - <strong>PC Gamer</strong><br/>\"Takes the MMO Beautifully Back to 1987\" - <strong>Kotaku</strong>", "metacritic": null, "released": "2014-04-15", "tba": false, "updated": "2024-04-06T13:13:47", "background_image": "https://media.rawg.io/media/screenshots/125/12595c8257badb5a1262533cdaef195f.jpg", "website": "http://silkgames.com/nestalgia/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 62}, "playtime": 1, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 265, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Silk Games"], "genres": ["RPG", "Massively Multiplayer", "Indie"], "publishers": ["Silk Games"], "esrb_rating": null}