{"id": 14850, "slug": "rpg-tycoon", "name": "RPG Tycoon", "name_original": "RPG Tycoon", "description": "A CLASSIC TYCOON GAME WITH A UNIQUE TWIST<br/><br/>RPG Tycoon aims to create a familiar yet original experience for players of all ages by combining classic tycoon gameplay with the unique theme of Kingdom management.<br/><br/>Can you generate enough money to keep your struggling kingdom alive? Will you be able to keep the settlements you're protecting free from danger? Do you think you have what it takes to win the award for \"Greatest Kingdom in All of the Land?\"<br/><br/><ul><li>START FROM NOTHING</li></ul>Start with just a single plot of land and choose from a plethora of Heroes to send on quests in order to steadily grow the fame of your Kingdom. As popularity increases you'll attract settlers from the surrounding towns to spend money on shops and services you provide.<br/><br/>Choose from over 60 unique buildings and decoration styles to design your ideal kingdom!<br/><br/><ul><li>EXPLORE AND EXPAND</li></ul>Complete different quest combinations to keep the Settlements you protect happy and send your Heroes on Epic Adventures with multiple choice events inspired by tabletop RPG's!<br/><br/>Choose from over 30 different Quick Quest combinations &amp; over 60 unique Epic Quests to unlock new content!<br/><br/><ul><li>BE THE GREATEST KINGDOM IN ALL OF THE LAND</li></ul>You won't be alone in your ventures. You'll have to prove yourself against the other Kingdom leaders as you compete in order to attain the title of \"Greatest Kingdom in All of the Land\".<br/><br/>Score points with every action you make and compete against AI's of varying difficulty to get the high-score and win!<br/><br/><ul><li>EASILY EXTENDABLE</li></ul>As most of the data for RPG Tycoon is loaded from simple XML files and Spritesheets when the game starts it's hugely extendable with ease.<br/><br/>With a basic knowledge of XML or image editing software you can create an endless amount of additional content for RPG Tycoon with ease. Add new Quests, Buildings, Heroes, Items and more in no time at all.<br/><br/>Share and get feedback on your mods with other users on the Steam Workshop!<strong>FEATURES</strong><br/><ul><li> Over 60 unique buildings and decorations to design your Kingdom.<br/></li><li> Over 60 unique choose-your-own Adventure style Quests.<br/></li><li> 30 different Supply and Quick Quest combinations.<br/></li><li> Multiple Heroes and styles to choose from.<br/></li><li> 3 different game difficulties for those that want more of a challenge.<br/></li><li> 3 different game lengths to suit your playstyle.<br/></li><li> Choose from four different terrain types to establish your Kingdom!<br/></li><li> Different AI difficulties to compete against.<br/></li><li> Steam Workshop Support.<br/></li><li> In-Game Quest Editor, export your quests directly to the workshop!<br/></li><li> Pop-Culture references and Easter Eggs!<br/></li><li> Achievements!</li></ul>", "metacritic": null, "released": "2016-02-12", "tba": false, "updated": "2019-08-28T22:11:53", "background_image": "https://media.rawg.io/media/screenshots/402/40270889a9b1a4878c10c276c03aea73.jpg", "website": "http://skatanicstudios.co.uk", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 81, "toplay": 1, "dropped": 1}, "playtime": 3, "achievements_count": 73, "ratings_count": 3, "suggestions_count": 214, "game_series_count": 0, "reviews_count": 3, "platforms": ["macOS", "PC"], "developers": ["Skatanic Studios"], "genres": ["Adventure", "RPG", "Strategy", "Simulation", "Indie"], "publishers": ["GSProductions"], "esrb_rating": null}