{"id": 148880, "slug": "chick-flick-simulator", "name": "Chick Flick Simulator", "name_original": "Chick Flick Simulator", "description": "<p>Due to technical difficulties I lost a lot of work on this project. This is a re-done version of it that I had to pull together at the last minute. I'm sorry for any spelling mistakes or grammar errors, and for the unpolished look of the game.</p><p>This project was done for my Alternative Media class. Some of the research I've done has shown that alternative media practices can be found in games made by private developers, namely in the Indie game industry. In addition, there's a constant comparison academically between cinema and games. The primary difference with games is the interactivity, which is some level of agency given to the player to make some sort of choice.</p><p>In this game I chose to deal with women stereotypes in film. The game is a \"simulator\", where for the four different movie genres of horror, crime drama, romantic comedy, and action, you can simulate the situation of one of three different female characters. Throughout their stories you have points where you can make a choice. The catch is, however, no matter what choice you make, your path ends up being the same, either because the situation forces it upon you, or its not in your character's stereotypical nature.</p><p>The game is supposed to make the player question the situation of typical female characters in movies by putting them in their point of view in the most ridiculous situations. Movies don't change each time you watch them; the characters in them have no agency, and the audience can't change the events that occur any more than the characters can.</p><p>The point of the game is not to be preachy, but to bring to light the situation we still find ourselves in as movie goers. In addition, I acknowledge that women are not always portrayed in the presented stereotypical ways, but also that there are many other stereotypes I didn't get the chance to cover.</p><p>This project has been a very interesting one for me, allowing for my imagination to go wild, and for my sassy comedic side to come out.</p><p>I hope you enjoy your experience. :)</p>", "metacritic": null, "released": "2015-12-08", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["peppypenguin"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}