{"id": 14885, "slug": "shiplord", "name": "ShipLord", "name_original": "ShipLord", "description": "<p>ShipLord as an indie space shoot-em-up survival game developed by Just1337 Studio.</p>\n<p>There is not much plot present in the game, apart from several dialogue lines on several levels, that are not connected with each other.</p>\n<h3>Gameplay</h3>\n<p>ShipLord resembles a typical bullet hell shoot-em-up game. The players fly on their ship on the screen from left to right, avoiding fire from the enemy vessels that go in similar patterns, and firing back as much as they can.</p>\n<p>ShipLord tries to expand upon this concept, as there is a bit of player customization present in the game. The players have access to several space vessels and over 100 upgrades for them, such as decreased shield cooldown, increased shield duration, force field improvements, reduced energy collection time.</p>\n<p>The players can use three special abilities to get them out of trouble: a shield that lasts a little while and saves you from the enemy fire; an energy tractor, that drains energy from the opposing force ships; a force field that merely destroys enemy ships and deflects any projectiles fired at you.</p>\n<p>To unlock a boss level, the players have to complete four asteroid levels. Such levels differ in their environment, enemy types, and difficulty. There are fifteen levels total in the game.</p>\n<p>The game also tracks the player&#39;s performance with its built-in medal system. The better you play - the more you get.</p>", "metacritic": null, "released": "2015-12-02", "tba": false, "updated": "2023-05-07T06:31:34", "background_image": "https://media.rawg.io/media/screenshots/51f/51f5e927c57e139f5d7d3ee8d0757c6b.jpg", "website": "http://www.shiplord.net/", "rating": 1.96, "rating_top": 1, "added_by_status": {"yet": 27, "owned": 1047, "beaten": 1, "dropped": 7}, "playtime": 5, "achievements_count": 9, "ratings_count": 45, "suggestions_count": 244, "game_series_count": 0, "reviews_count": 45, "platforms": ["macOS", "PC", "Linux"], "developers": ["Just1337 Studio"], "genres": ["Action", "Adventure", "Casual", "Indie"], "publishers": ["Just1337 Publisher"], "esrb_rating": null}