{"id": 14880, "slug": "the-last-federation", "name": "The Last Federation", "name_original": "The Last Federation", "description": "<strong>From the creators of AI War: Fleet Command.</strong><br/><br/> <ul><li> Turn-based tactical combat, with up to 5 factions competing at once.<br/> </li><li> Extremely deep simulation of an entire solar system and its billions of inhabitants.  Even just watching everything unfold in Observer mode is entertaining, as nations rise and fall.<br/> </li><li> New-player-friendly ramp-up of complexity as you play, which you can disable if you're already a veteran.<br/> </li><li> Eight races each have very distinct personalities and attributes.  Each one even has its own completely unique political system.<br/> </li><li> Difficulty levels split between the grand strategy and turn-based combat portions of the game, both ranging from quite casual to incredibly hardcore.<br/> </li><li> Save and reload your game with ease any time, or tough it out in ironman mode.<br/> </li><li> Composer Pablo Vega's best soundtrack to date, featuring 54 minutes of music and the vocal finale \"Lay Down Your Arms.\"<br/><br/><br/><br/><br/><br/><br/><br/>More Details<br/>Greetings, Hydral.  I will be your computer for this \"grand strategy campaign with turn-based tactical combat.\"  I think that's code for \"we're going to die.\"<br/><br/>Our solar system is vast and complicated, and I sense you are a little dimwitted -- so I tell you what, let's start with the simple stuff.  Like escaping with this flagship you just hijacked from a bunch of angry robots.  That seems important.<br/><br/>Please excuse my impertinence, but I believe you are the last of a murdered race, yes?  My records note you Hydrals were the dictators of the solar system, so basically you had it coming.  And by \"it,\" I mean the moon that smacked into your homeworld.  Hmm.  So people really aren't going to like you until they get to know you.  Well, only you can use the scattered remnants of advanced Hydral technology, so that's something.<br/><br/>Look, I'm not going to tell you what to do.  My understanding is that you're trying to form the solar system's first-and-last unified federation, and that's noble enough.  But right now nobody wants that except you, and you've got 8 very diverse, very angry races to either unify or exterminate.  So... good luck with that.  I'll help how I can.</li></ul>", "metacritic": 72, "released": "2014-04-17", "tba": false, "updated": "2024-04-06T11:49:17", "background_image": "https://media.rawg.io/media/screenshots/32c/32c3d3a8d24103e8565ed8801f9ee5f3.jpg", "website": "http://arcengames.com/the-last-federation/", "rating": 2.5, "rating_top": 1, "added_by_status": {"yet": 20, "owned": 335, "beaten": 2, "toplay": 2, "dropped": 5, "playing": 1}, "playtime": 3, "achievements_count": 79, "ratings_count": 10, "suggestions_count": 411, "game_series_count": 0, "reviews_count": 10, "platforms": ["PC", "macOS", "Linux"], "developers": ["Arcen Games"], "genres": ["Strategy", "Simulation", "Indie"], "publishers": ["Arcen Games"], "esrb_rating": null}