{"id": 148800, "slug": "shipshape", "name": "Shipshape", "name_original": "Shipshape", "description": "<p><strong>UPDATE 12/1/2015 </strong>- The source for Shipshape is now available on GitHub! Enjoy!</p><p>Shipshape was originally made for the large touchscreen table housed in the children's section of the Iowa City Public Library and planned to be updated based on the gameplay metrics and feedback from said children. Of course, we got busy with other projects and never returned to Shipshape, but that's okay because we made a whole new game for the library called Tune It Up!</p><p>Of course, Shipshape is still an important part of V-Comp history, so I've made it available here in all its underwhelming glory. Enjoy!</p><p>So what's the story behind Shipshape? Well, the greedy pirate, Greenbeard, has claimed an island all to himself, just so he can show off his giant, colorful gems and…wait, aren't those <em>your</em> giant, colorful gems? Unfortunately for Greenbeard, you and your friends aren't keen on sharing, so you do what any mature pirate would do in this situation: you load up the canons and start blasting what's rightfully yours! If you can't have them, no one can!</p><p>Now, I know what you're thinking: \"This sounds like a terrible game for kids. Aren't you just teaching them that sharing is bad*?!\" Well, what if I told you that the only way they can maximize their destruction of personal property** is by <em>taking turns</em> destroying it? That's right, the only way you can truly stick it to Greenbeard*** is by inviting your friends to help out. Play by yourself too long and you'll run out of things to destroy! If you want to keep that score up, you'll have to share the action with a friend (or three) and maybe even work together at times when Greenbeard gets smart and starts putting up shields to keep you out. Come on, Greenbeard, why are you such a jerk? It's not like you you made the gems yourself or anything.</p><p><strong>*Disclaimer:</strong> Virtually Competent is not responsible for any poor sharing habits your child may develop from playing Shipshape. They were like that when they got here.</p><p><strong>**</strong>Virtually Competent does not condone the destruction of personal property, but in this case it's totally okay because that's just how pirates roll.</p><p><strong>***</strong>Bullying is also way uncool. Don't do it, kids. I mean, unless the person you're bullying started it first. Then go for it.</p>Credits:<p>Programming by Eric Neuhaus (@donkeyspaceman)<br/>Art by Colin Greenhalgh (@CuddlyColin)<br/></p><p>Created with Scirra Construct 2<br/>Sound effects made with Bfxr</p>", "metacritic": null, "released": "2015-02-24", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/962/962921b5f17c11e993867be3536f9634.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 26, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Virtually Competent"], "genres": [], "publishers": [], "esrb_rating": null}