{"id": 14886, "slug": "survive-in-space", "name": "Survive in Space", "name_original": "Survive in Space", "description": "“We thought they were our friends and benefactors, but instead they are our masters. The Chronicles didn’t liberate us from our primitive ways – they conquered and destroyed us. The others don’t know, their heads are still full of the melodious voices of our alien masters. But that will change. I will change it!” – Sasaki<br/><br/>Survive in Space is a skill-based space shooter with a hardcore focus on gameplay mechanics. You take on the role of Sasaki, a young soldier who discovers the horrible truth of humanity’s enslavement at the hands of the alien Chronicles during a routine mission. His deep anguish leads him to spiral into depression, and in the darkest depths he finds The Shadow, a primal being full of hate that grants him the power to confront the Chronicles.<br/><br/><strong>FEATURES</strong><br/><br/><ul><li> Over 50 different levels<br/></li><li> 5 powerful bosses that you will encounter at the end of each sector – every nine levels. Each boss is a skill puzzle of his own, with shifting mechanics and environments that will keep you on your toes.<br/></li><li> Over 20 types of enemies split into three different categories: defensive, offensive and supportive.<br/></li><li> 4 different difficulty levels<br/></li><li> Game modes: Additional enemies, Planet fortresses and Asteroids. Active them to make game more interesting.<br/></li><li> 5 differenet player ships – each with its own strengths and weaknesses. Find the one that best suits your play style.<br/></li><li> Dual Mode. Dual Mode allows Sasaki to toggle his ships into Offensive and Defensive configurations, sacrificing firepower for durability and vice versa.<br/></li><li> No player level limit cap.<br/></li><li> 9 different abilities upgrades<br/></li><li> Full controller and mouse support, customizable keyboard keybindings<br/></li><li> Music player with over 90 songs. You can add your own music too.</li></ul>", "metacritic": null, "released": "2016-05-20", "tba": false, "updated": "2019-09-17T06:09:03", "background_image": "https://media.rawg.io/media/screenshots/29c/29c0128ad4993f1c0dffd0e92a81f610.jpg", "website": "http://www.just1337.com/games/", "rating": 2.05, "rating_top": 1, "added_by_status": {"yet": 12, "owned": 490, "beaten": 1, "toplay": 1, "dropped": 5}, "playtime": 4, "achievements_count": 42, "ratings_count": 21, "suggestions_count": 351, "game_series_count": 0, "reviews_count": 21, "platforms": ["macOS", "PC"], "developers": ["Just1337 Studio"], "genres": ["Action", "Adventure", "RPG", "Casual", "Indie"], "publishers": ["Just1337 Publisher"], "esrb_rating": null}