{"id": 149022, "slug": "space-investigators-sid-force", "name": "Space Investigators: Sid Force", "name_original": "Space Investigators: Sid Force", "description": "<p>A 3/4-View Shooter made with Gamemaker Studio.\r\n</p>\n<p>Help the Space Investigator Sid Force to remove the rogue A.I. that has taken over Space Station Citadel 3.</p>\n<p>Search the enviroment for more Ammo, Weapons and Keycards.</p>\n<p>You have one life per stage, so watch out.</p>\n<p>Music converted from C64 SID files.</p>\n<p>CONTROLS<br/>--------</p>\n<p>You move Sid with W,A,S,D</p>\n<p>hold LEFT MOUSEBUTTON to shoot</p>\n<p>click MIDDLE MOUSEBUTTON to interact (When the Crosshair changes and you are in range)</p>\n<p>Q and E switch your abilities (Sprint/Zoom)</p>\n<p>hold RIGHT MOUSEBUTTON to use the ability</p>\n<p>M turns the music off and on</p>\n<p>scroll MOUSEWHEEL or use the NUMBER KEYS to switch Weapons</p>\n<p>push SPACEBAR to skip dialog or scenes</p>\n<p>ALT + F4 to exit (Yes, seriously - see notes below)</p>\n\n\n<p>DEVELOPER NOTES</p>\n<p> -------------------------</p>\n<p>This was my very first project with Gamemaker Studio. I basically learned the program and coding language as this project went on.<br/></p>\n<p>I now revisited it shortly and decided to release it since it is, after all, a complete game. It has a story, beginning and end, and all game mechanics work.</p>\n<p>But codingwise this game is a mess and i decided against polishing it to save my sanity.<br/>No menus or even proper options to exit the game (Things that are a given for any new project i make these days).</p>\n<p>This also resulted in the game being quite EVIL.<br/>You have one life per stage, but unlimited continues.</p><p>If you like 90s style challenge though, this is your game.</p>\n\n<p>CREDITS<br/>-----------</p>\n<p>Music converted from c64 SID files.</p>\n<p>Graphics partially original, partially taken from \"The Chaos Engine\" (Amiga), \"Doom\" (PC) and others</p>\n<p>Sound Effects taken from the \"Atari Sound Collection\"</p>\n<p>All coding and original graphics done by Sinnesloeschen Games</p>\n\n<p>Stay tuned for more, better coded and optimized, Games. ;)</p>\n<p>If you run across game-breaking bugs or want to leave feedback, feel free to comment below.<br/></p>", "metacritic": null, "released": "2018-04-11", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/520/520c50bd59c694a21f54fde4ecab466a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 118, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Sinnesloeschen Games"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}