{"id": 149049, "slug": "lian-yu", "name": "Lian Yu", "name_original": "Lian Yu", "description": "<p>This game is about a prison island!!</p><p>Its a first person shooter game where you can explore the Island of Lian Yu and rescue the survivers of the island.</p><p>Lian Yu, a prison island in northern China Sea, was experimenting with the prisoners to try produce cures for certain diseases. One of the scientists who made these experiences was called Carl and was close to find a cure for cancer.</p><p>But one of his experiments went wrong and the prisoner got an infection and started having a strange and aggressive behavior to the point of attacking the other prisoners like a cannibal and, in doing so, these same prisoners were also infected.</p><p>With all this confusion the apocalypse of infected in Lian Yu as started.</p><p>A few days later the Chinese government has learned of this infestation and realized that there was no cure for this disease and that the only solution would be to remove Lian Yu from the map so that the infection doesn't spread throughout the country.</p><p>But before they exterminate the island they sent their best soldiers to check if there were anysurvivors in Lian Yu. One of those soldiers is the \"player\", which was transported to the island by a ship.</p><p>But then an accident occurred, the ship had crashed and ended up shipwrecking, having just survived \"the player\" despite losing all his weapons during the sinking.</p><p>The soldier manages to reach the island and tries to find a safe place to stay. Then he went tohighest place on the island and found an abandoned house where he could stay. </p><p>From this home is where the game starts, and the goal is to look for survivors of Lian Yu and escape as fast as possible.</p>", "metacritic": null, "released": "2015-07-03", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/0ea/0eab23f65a465aa2199b017a5799409f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 156, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Folheiro"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}