{"id": 149031, "slug": "ne-touchez-pas-4", "name": "Ne Touchez Pas 4", "name_original": "Ne Touchez Pas 4", "description": "<p><strong>Ne Touchez Pas 4</strong> is a game which compiles many variants of don't-touch-the-walls games (including two from my past - Rockit and NAL's Jet Pod).</p>\n<p>There are 50 levels, playable with six separate characters:<br/><strong>Bird</strong> will be familiar to anyone that's played Messhof's Flywrench or any of the previous NTP games. New to NTP4, Bird has an autoflap button as well as a manual flap. Left/Right make the bird strafe, Z is for manual flap and Up for autoflap. Down can be used for the level start if you want to start with a freefall, not an upwards movement.<br/><strong>Jetpod</strong> is the only character unaltered from NTP3. It's basically a slower, easier version of the bird with smooth upward thrusting and strafing.<br/><strong>Missile</strong> is a redesigned version of NTP3's \"Rockit\". Since mouse controls are disallowed from Competition 05 entries I had to alter the controls. The D-pad now makes the missile hurtle in whichever direction is pressed. It's at one set speed and is unaffected by gravity.<br/><strong>Spaceman</strong> has been changed from NTP3 significantly. He's still unaffected by gravity and friction, but now the entire screen rotates as he does and you have to keep control of him and track of the level as it turns before you. Pretty good at inducing dizziness.<br/><strong>Vehicle</strong>, first of two new characters, is a small, speedy car in which you use up to accelerate, down to decelerate/reverse and left/right to turn. This is a fairly easy one to do since you can be patient with it and it's nippy and agile enough to get through the tightest of gaps.<br/><strong>Square</strong> is named to reflect its simplicity. Direction keys simply move it in whichever direction is pressed. It stops instantly when you let go. It's fairly slow (though holding Z will double its speed), but small enough to get through super-tight gaps. Designed to be similar to <em>World's Hardest Game</em>, though is much easier.</p>\n<p>The menu system has been redesigned also. It's incomplete (if you play the build you can only access The Grid and Quit Game on the main menu) but getting there. What exists is pretty much fully functional. Controls for the menus are given so I needn't go in-depth into them.</p>", "metacritic": null, "released": "2017-06-16", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/ddc/ddc1a07ead7e6638d43e54645a604290.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 51, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["NAL"], "genres": ["Action"], "publishers": [], "esrb_rating": null}