{"id": 14919, "slug": "sentry-knight-tactics", "name": "Sentry Knight Tactics", "name_original": "Sentry Knight Tactics", "description": "Big on charm and challenge in equal measure, the hit Sentry Knight series comes to Steam with Sentry Knight Tactics. In this bright and colourful real-time strategic RPG adventure, a land under siege by a transdimensional evil calls upon you and your team of soon-to-be legendary heroes. Together with the surly Marksman, wise Priestess, and the others who will join along the way, lead the valiant Knight throughout a host of dazzling and dangerous realms as you slaughter enemy hordes, complete quests, discover powerful new gear, and, ultimately, save the world.  <br/><br/>Sentry Knight Tactics is for players who love vibrant and cute games but don't want to compromise on strategy. Direct your party around the battlefield to attack and defend against waves of enemies with unique abilities in every battle. Giant slime beasts? Vicious vampire bats? Marauding goblin kings? They won't know what hit them.Key Features<br/><br/><ul><li>Devastate enemies in challenging real-time, strategic combat scenarios. <br/></li><li>Explore a huge world of castles, towns, temples and other sprawling, side scrolling levels.<br/></li><li>Both passive and active skills to power up your party. <br/></li><li>Tons of quests to complete as you adventure.<br/></li><li>A formidable array of loot to find and equip from across the land.<br/></li><li>Join forces with new characters to customise your party with their distinctive talents.<br/></li><li>Character-specific skill trees with spells and abilities to unlock and master.<br/></li><li>Steam Achievements and Trading Cards.</li></ul>", "metacritic": null, "released": "2016-10-03", "tba": false, "updated": "2019-08-28T22:11:51", "background_image": "https://media.rawg.io/media/screenshots/fbb/fbb7ff35b9d570c9c9dab19fe3e10cf4.jpg", "website": "http://www.sentryknightgame.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 13, "toplay": 1}, "playtime": 5, "achievements_count": 38, "ratings_count": 1, "suggestions_count": 276, "game_series_count": 0, "reviews_count": 1, "platforms": ["macOS", "PC"], "developers": ["Justin Wolf", "Tyler Myers"], "genres": ["Action", "Adventure", "RPG", "Strategy", "Indie"], "publishers": ["Armor Games"], "esrb_rating": null}