{"id": 14921, "slug": "2-youre-the-only-one", "name": "遊魂2 -you're the only one", "name_original": "遊魂2 -you're the only one", "description": "introduction<br/><strong>In order to respond to English GALGAME/Novel players’ expectations, HIKARI FIELD and Lump of Sugar are now cooperating to publish the English version of the well-known serial works《Tayutama》. The first release《Tayutama 2 -you’re the only one-》 is coming soon in the summer of 2017. Then others in the series will come later.<br/><br/>English website of 《Tayutama 2 -you’re the only one-》 is already open, please visit:<br/>http://www.hikarifield.com/tayutama2_en/<br/><br/>You can follow us on STEAM to get more information, and also welcome to our Twitter: @hikari_field.</strong><br/><br/>In the mountain town far away the ashihara chou，a BRAND-NEW story about the coexistence of “humans”and “ tayutai“ is about to start.<br/><br/>To be with you    this is the only oath   and my everything<br/><br/>Leading GALGAME developer LUMP OF SUGAR’s signature work ’s sequel. <br/><br/>As the 10TH ANNIVERSARY WORK of the brand,  bing together a large number of fans looking forward to it.  <br/><br/>The stage of the story is the world after 50 years of the prequel, and a large number of NEW pretty young girls show up.  Prequel’s POPULAR character 泉戸ましろ and other forever young girls continue to play on the stage.<br/><br/>Although new players can totally absorb in the new game, but if you can experience prequel you will find MORE FUN here.  <br/><br/>Game type is LOVE AVG, and this is an amazing kind of game. Playing this game is like reading a book, meanwhile it has abundant illustrations and lifelike characters, and wonderful professional character voices and melodious background music make you personally “BE THERE”. Players can through interacting with many different kinds of beautiful girls promote the development of the plot of the game, and need to be in the key link of the game branch to make the right decision , so that they can reach the perfect ending.", "metacritic": null, "released": "2016-12-09", "tba": false, "updated": "2019-08-28T22:11:51", "background_image": "https://media.rawg.io/media/screenshots/f6c/f6c2cbeccce6748bd6bbc74bd39fe6d4.jpg", "website": "http://www.hikarifield.com/tayutama2", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 23}, "playtime": 5, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 306, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Lump of Sugar", "HIKARI FIELD"], "genres": ["Adventure"], "publishers": ["HIKARI FIELD"], "esrb_rating": "Mature"}