{"id": 1492, "slug": "leos-fortune", "name": "Leo's Fortune", "name_original": "Leo's Fortune", "description": "<p>App Store Best of 2014 and 2014 WWDC Apple Design Award winner!<br />\nLeo’s Fortune is a platform adventure game where you hunt down the cunning and mysterious thief that stole your gold. Beautifully hand-crafted levels bring the story of Leo to life in this epic adventure.<br />\n“Virtually flawless…could be called the best game on the platform” – 5 out of 5 Apple’N’Apps<br />\n“Every level is meticulously detailed...Every scene looks simply spectacular” 5 out of 5 stars – Toucharcade<br />\n“One of the most beautiful iOS games I’ve seen in a while…It will make you smile the instant you pick it up” 5 out of 5 stars Cult of Mac<br />\n“I just returned home to find all my gold has been stolen! For some devious purpose, the thief has dropped pieces of my gold like breadcrumbs through the woods. Despite this pickle of a trap, I am left with no choice but to follow the trail. Whatever lies ahead, I must recover my fortune.” -Leopold</p>\n<p>VOYAGE through lush environments from mossy forests and arid deserts, to pirate cities and snowy mountains.<br />\nSURVIVE vicious traps and solve physics-based puzzles through 24 levels of treacherous adventure.</p>\n<p>FOLLOW the trail of gold and uncover the truth behind Leo’s stolen fortune.<br />\nFinish Leo’s Fortune to unlock Hard-core Mode: try to beat the whole game without dying to unlock a special prize! Compete with your Game Center friends to beat as many levels as you can in the fastest time possible.<br />\nLeo’s Fortune supports iCloud game saves and Game Controllers made for iPhone, iPad, and iPod Touch. Game Controller support requires iOS 7 or later and is compatible with iPhone 5, iPhone 5s, iPhone 5c, iPad 2 or later, and iPod touch (5th generation).<em><br />\nAn internet connection prior to the start of level 7 will be necessary to complete the download of app data for Leo’s Fortune.<br />\nJoin Leo’s community at<br />\nhttp://facebook.com/LeosFortune<br />\nhttp://twitter.com/LeosFortune<br />\nhttp://youtube.com/LeosFortune<br />\nQuestions or feedback?<br />\nsupport@leosfortune.com<br />\n</em>Certain Game Controllers have specific minimum device requirements. Check compatibility with your controller manufacturer.<br />\nPrivacy Policy: http://www.leosfortune.com/privacy<br />\nEULA: http://www.leosfortune.com/eula</p>", "metacritic": 74, "released": "2014-04-23", "tba": false, "updated": "2023-09-02T10:00:47", "background_image": "https://media.rawg.io/media/screenshots/369/369d405dd5facada8c63decb4be091ea.jpeg", "website": "http://www.leosfortune.com", "rating": 3.86, "rating_top": 4, "added_by_status": {"yet": 5, "owned": 104, "beaten": 41, "toplay": 4, "dropped": 10, "playing": 3}, "playtime": 2, "achievements_count": 79, "ratings_count": 42, "suggestions_count": 551, "game_series_count": 0, "reviews_count": 43, "platforms": ["PC", "iOS", "PlayStation 4", "Android", "Xbox One"], "developers": ["1337 & Senri"], "genres": ["Action", "Adventure", "Arcade"], "publishers": ["Tilting Point", "1337 & Senri"], "esrb_rating": "Everyone"}