{"id": 149340, "slug": "not-in-my-farm", "name": "Not In My Farm", "name_original": "Not In My Farm", "description": "<p><strong>Commands: ASDW and Mouse to aim and shot</strong></p>\n<p>Hello everyone!<br/><br/>I'm the developer and artist of \"Not in my farm\" game pack (https://telles0808.itch.io/shot-run-platform-adventure) and I'm looking for an pixel artist to join me in the final version of the game.<br/><br/>\"Not in my farm\" is a platform game composed by two main parts of ten stages.<br/><br/>The first ten stages are about defending the farm against the alien kidnaps and the next ten stages are about the alien mother ship pursuit.<br/><br/>While in the first stages, you're able to kill aliens and at the end, you'll confront a mini boss, who drops parts of his spaceship and you will use it to build your own rocket in your water tower.<br/><br/>The last boss of this part will give you the fuel to launch.<br/><br/>The second part of this adventure will be where you have the control of the rocket and you should pursuit the alien mother-ship, avoiding or fighting the aliens and obstacles, plus, you'll have the ability to get out the rocket and take control of damaged alien spaceships or to take debris to improve your own rocket.<br/><br/>Achievements will be given for who finish the adventure without any upgrade, and so on for who take all of them.<br/><br/>While going up, the scenario will be changing with its altitude, you will also have control of your engine and fuel consumption.<br/><br/>The final boss will be pretty similar to the independence day mother-ship.<br/><br/>So, if you liked the idea and wanna join me in this game, sharing any future earns with ads and/or upgrades (it's all about how much we will work on it), feel free to reply this topic or send me a message.</p>", "metacritic": null, "released": "2017-12-13", "tba": false, "updated": "2019-08-28T23:22:13", "background_image": "https://media.rawg.io/media/screenshots/d45/d45baa8f7dd0f8a92c7416c7cacac0b1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 19, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["KinGabe"], "genres": [], "publishers": [], "esrb_rating": null}