{"id": 1493, "slug": "i-keep-having-this-dream", "name": "I Keep Having This Dream", "name_original": "I Keep Having This Dream", "description": "\"There are times during the game where it feels truly great\"<br/>- Touch Arcade<br/><br/>\"It's an entertaining, thoughtfully put together game of cat, mouse, architect, adventurer, and all manner of other roles\"<br/>- Pocket Gamer<br/><br/>\"It’s challenging, colorful, and built perfectly for a mobile game\"<br/>- Gamezebo<br/><br/>In this innovative puzzle RPG, build a path of tiles to escape each successive cycle of your dreamscape. A cycle gets more dangerous the longer you stay, so plan your route carefully, and make the most of the challenges and opportunities you meet along the way.<br/><br/>Place tiles to boost your attack and defence, defeat enemies to level up your character, and upgrade the right perks to stay safe as your enemies grow stronger. Take a detour off the direct pathway to discover the items that may give you an edge, but watch out for the powerful special enemies that grow more frequent as you near the exit - if left untended, their unique abilities will quickly spell your doom.<br/><br/>- 25+ upgradeable perks augment and focus your strategy<br/>- 150+ items to collect and boost your stats<br/>- 110+ special enemies to encounter and overcome<br/>- 80+ one-off events to choose from for a temporary boost<br/>- 50 achievements to earn<br/>- Unlock more enemies, events and cosmetics over multiple playthroughs", "metacritic": null, "released": "2016-02-22", "tba": false, "updated": "2019-08-02T04:07:26", "background_image": "https://media.rawg.io/media/screenshots/c43/c43b96504fe8e39da1606bbe0bdcc065.jpeg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 93, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Fireflame Games"], "genres": ["RPG", "Puzzle"], "publishers": ["Alex Kuptsov"], "esrb_rating": null}