{"id": 14935, "slug": "total-war-shogun-2-fall-of-the-samurai", "name": "Total War: Shogun 2 - Fall of the Samurai", "name_original": "Total War: Shogun 2 - Fall of the Samurai", "description": "\t\t\t\t\t\tGuide ancient Japan into the modern age, as the arrival of America, Britain and France incites a ferocious civil war which will decide the future of a nation.<br/> <ul><li><strong>Dramatic 19th century Japan setting</strong><br/><br/>\t\t\t\t\t\tBased on the backdrop of the Boshin War period, the new campaign starts in 1864, a time of growing resentment against Western colonial power and influence. As Japan begins to modernise and industrialise, the inevitable social and economic changes lead to increasingly militant nationalism and antipathy towards the Shogunate.<br/> </li><li><strong>6 new playable clans</strong><br/><br/>\t\t\t\t\t\tPlay as a clan supporting the Imperial throne, or the last Shogunate:<ul class='\"bb_ul\"'><li>Shogunate clans: Aizu, Nagaoka, Jozai<br/> </li><li>Imperial clans: Choshu, Satsuma, Tosa</li></ul></li><li><strong>New foreign powers</strong><br/><br/>\t\t\t\t\t\tThe American, British and French nations play an important part in the story of the Boshin war, and your relations with these foreign powers will be integral to unit recruitment and to advancing your technology trees.<br/> </li><li><strong>New 19th century Japan campaign map</strong><br/><ul class='\"bb_ul\"'><li>The new island of Ezo extends the SHOGUN 2 campaign map northwards.<br/> </li><li>Fully refreshed towns and other campaign map features reflect the new time period, with railways making their first appearance in a Total War title.</li></ul></li><li><strong>Campaign map railways</strong><br/><ul class='\"bb_ul\"'><li>Develop your own railway network to move armies and agents between your regions.<br/> </li><li>Railways can be sabotaged and transport can be blocked by enemy armies who take control of parts of the line or stations.</li></ul></li><li><strong>39 new land units</strong><br/><ul class='\"bb_ul\"'><li>Including modern ranged units - such as the Gatling gun and Armstrong gun - controllable in a new third-person mode.<br/> </li><li>New units can also be recruited from foreign powers, including the British Royal Marines, US Marine Corps and French Marines.</li></ul></li><li><strong>10 new naval unit types with a total of 21 ships</strong><br/><ul class='\"bb_ul\"'><li>New steam-powered warships, heavily armed with modern artillery.<br/> </li><li>Foreign ironclad ships can also be purchased, including the Warrior-class ironclad.</li></ul></li><li><strong>New port siege battle type</strong><br/><ul class='\"bb_ul\"'><li>This new battle type triggers when attempting a naval assault on an occupied enemy port.<br/> </li><li>The attacking fleet must sail into the harbour and capture the port, running the gauntlet of coastal gun defences.</li></ul></li><li><strong>New land and sea unit interactions</strong><br/><ul class='\"bb_ul\"'><li>During a land battle, armies can call in offshore artillery support barrages.<br/> </li><li>Conversely, costal gun emplacements can target enemy ships during port siege battles, when ending their turn within the range of upgraded coastal defences.<br/> </li><li>Campaign map bombardments: offshore naval units can bombard armies and cities in adjacent coastal areas on the campaign map itself. </li></ul></li><li><strong>3 new agent types </strong><br/><ul class='\"bb_ul\"'><li>The Foreign Veteran, the Ishin Shishi and the Shinshengumi.<br/> </li><li>Each new agent has its own skill tree, and Ninja and Geisha agents have had their skill trees updated with new abilities.</li></ul></li><li><strong>Improved siege battle mechanics</strong><br/><ul class='\"bb_ul\"'><li>New upgradable tower defences can be built with a specific defence specialty: archery, matchlock or Gatling gun.</li></ul></li><li><strong>Multiplayer 2.0</strong><br/><ul class='\"bb_ul\"'><li>New Conquest map reflecting the 19th century setting<br/> </li><li>Brand-new Fall of the Samurai avatar, including:<ul class='\"bb_ul\"'><li>Over 40 new retainers<br/> </li><li>Over 30 new armour pieces<br/> </li><li>New 19th century avatar skill tree</li></ul></li><li>Multiple avatars: players can enjoy multiple careers and progression across Shogun 2 and Fall of The Samurai</li></ul></li></ul>", "metacritic": 86, "released": "2012-03-22", "tba": false, "updated": "2023-11-28T17:56:57", "background_image": "https://media.rawg.io/media/screenshots/e25/e25ff373d74e3dc79fb60db550881aad.jpeg", "website": "http://www.totalwar.com/shogun2", "rating": 4.29, "rating_top": 4, "added_by_status": {"yet": 7, "owned": 17, "beaten": 16, "toplay": 5, "dropped": 5, "playing": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 14, "suggestions_count": 584, "game_series_count": 0, "reviews_count": 14, "platforms": ["PC", "macOS"], "developers": ["Feral Interactive", "Creative Assembly"], "genres": ["Strategy"], "publishers": ["SEGA"], "esrb_rating": null}