{"id": 149449, "slug": "dual-nature", "name": "Dual Nature", "name_original": "Dual Nature", "description": "<p>Final Project Game for EECS 290 - Group 7</p>\n<p><strong>Developers</strong>: Anna Burkhart, John Donnelly, Noah Friedman, Kyle Pham</p>\n<p><strong>Instructions to play the game:</strong> </p>\n<p>- Level 1: Press Left Arrow and Right Arrow to move the bottom cloud to the left and the right, respectively. The top cloud, however, will move in the opposite direction. </p>\n<p>- Level 2: Press Up Arrow and Down Arrow to move the moon (left side of the screen) up and down, respectively. The sun, which is on the right side of the screen, however, will move in the opposite direction.</p>\n<p>- Level 3: Press Left Arrow and Right Arrow to move the bottom black hole to the left and the right, respectively. The top black hole, however, will move in the opposite direction. </p>\n<p>- Press Q to perform Tidal Wave attack in Level 1, Storms in Level 2, and Random Attack in Level 3 </p>\n<p>- Press E to perform Tornado attack in Level 1, Fire and Ice attack in Level 2, and Black Hole Attack in Level 3</p>\n<p>- Press F to perform Lightning attack in Level 1 and Dual Lightning attack in Level 2.<br/></p>\n<p><strong>Notes about the attacks:</strong></p>\n<ul><li><em>Ice</em>: Freezes enemies in place.  DOWNSIDE: doesn’t kill, so can cause enemy build up.</li><li><em>Fire</em>: Kills enemies in an explosion of fire.  DOWNSIDE: Also affects the player.  This is the most basic attack.</li><li><em>Lightning</em>: Hits enemies and connects to nearby ones for fast kills and possible large group kills.  DOWNSIDE: If the enemies are too close the character the lightning can connect to and hurt him too.</li><li><em>Tidal Wave</em>: Launches a massive Tidal Wave across the map.  Has a lethal zone where enemies within it will die (that the player is aiming).  DOWNSIDE: The wave leaves behind a splash that blocks enemies and can push the player which can make things chaotic.</li><li><em> Tornado</em>: Creates a vortex that moves somewhat randomly killing and flinging enemies around.  DOWNSIDE: The tornado can not only run into the player if placed poorly but can also fling enemies closer to the player.</li><li><em> Elemental Storms</em>: Two slow moving storms of fire and ice that decimate enemies.  DOWNSIDE: If they come in contact with the player the player gets heavily pushed aside and takes heavy damage.</li><li><em>Black Hole</em>: Sucks enemies towards the center of the black hole, smashing them together and killing them.  DOWNSIDE: Also affects the player.</li></ul>\n<ul><li><em>Random Attack</em>: Quickly fires a random elemental attack with a short cooldown.  Attacks move at the same speed to help players aim. DOWNSIDE: The player doesn’t know what attack will fire.</li></ul>\n<p>Control the clouds, the sun, and the moon and perform elemental attacks to protect the main character (the king) from the enemies (the zombie-like creatures). Be careful, the elemental attacks can hurt not only the enemies, but also the main character.</p>\n<p>If the main character gets to the end of the path and reaches the black and pink portal, you win the level.</p>\n<p>There are three levels in this game. If you pass the third level, you will win the game.</p>\n<p>Music from freesound.org</p>\n<p>Have fun playing the game!</p>", "metacritic": null, "released": "2018-05-02", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/30b/30b8d45227d2f69123eff863ee747bd0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 75, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Web"], "developers": ["cwru-eecs290"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}