{"id": 14954, "slug": "kof2002um", "name": "THE KING OF FIGHTERS 2002 UNLIMITED MATCH", "name_original": "THE KING OF FIGHTERS 2002 UNLIMITED MATCH", "description": "<p>KOF 2002 UM,<br />\nfully upgraded version of KOF 2002 &amp; 2nd title in the UM series,<br />\njoins the battle on STEAM!ABOUT THE GAMEThe second title in the UM series is a fully upgraded version of KOF 2002, a masterpiece of the KOF series deserving of a place honor along with KOF ’98. Based on THE NESTS CHRONICLES, this title includes the most characters of any title in KOF history. All graphics and background music have been completely redone and the game balance has also been extensively redesigned. New moves have been added and others have been brought back, meaning that players can enjoy battling it out for longer than ever.</p>\n<p>・66 characters in all – the most playable characters ever in the KOF series:<br />\nWith DNA from Kyo and K’, this title’s original character Nameless is ready for action!<br />\nIn addition to characters that appeared in the original KOF 2002, formidable fighters from THE NESTS CHRONICLES as well as additional characters and hidden characters keep popping up to fight!<br />\n・Don’t miss the updated graphics and production:<br />\n・Updated game sounds:<br />\nThe demo screens, cut-scenes, and winning screens are worth a look:[/b]<br />\nWhat’s more, all background music has been updated for more intense matches!<br />\nTons of new moves and old moves that have been brought back are found in this title only!<br />\nFeel the heat of the upgraded MAX2!!<br />\n・Fully upgraded and redesigned system and game balance for all characters:<br />\nEach character’s special and extra-special moves are former moves and power-changing moves from past series as well as many new moves created for this title only.<br />\nThe MAX2 move for all characters is even more impressive than ever. Now easier to use in real matches for a show of supreme power!!<br />\n・Includes many game modes:<br />\nNot only can 50 different moves be practiced in both “normal” and “expert” difficulties in Challenge Mode, players can also create original combos in “Practice Mode”. There is also “Endless Mode”, where players can battle against the CPU for as long as their endurance will allow.</p>", "metacritic": null, "released": "2010-11-17", "tba": false, "updated": "2023-03-16T11:45:59", "background_image": "https://media.rawg.io/media/screenshots/82a/82a10cd9723ebc119694b30abe7715c7.jpg", "website": "https://www.facebook.com/SNK.KOFWORLD/", "rating": 3.94, "rating_top": 5, "added_by_status": {"yet": 38, "owned": 430, "beaten": 14, "toplay": 3, "dropped": 13, "playing": 5}, "playtime": 4, "achievements_count": 58, "ratings_count": 32, "suggestions_count": 820, "game_series_count": 0, "reviews_count": 32, "platforms": ["PlayStation 4", "PC", "Xbox 360"], "developers": ["SNK", "Code Mystics"], "genres": ["Action", "Fighting"], "publishers": ["SNK"], "esrb_rating": null}