{"id": 149516, "slug": "the-rainbow-machine-itch", "name": "The Rainbow Machine (itch)", "name_original": "The Rainbow Machine (itch)", "description": "<p>Tobi needs your help! 140 colorful and phyisically-based puzzles lie ahead! The Rainbow Machine has been stolen by the evil Klepto Rats and now Tobi is embarked on an awesome adventure to recover it! The Klepto Rats have hidden the pieces of the Rainbow Machine in treasure chests distributed throughout the game's fun levels, and you have to use a special Blue Sphere to open these treasure chests. Show that you are an incredible player, and complete each level on your first try! Finally, a caution notice: these Klepto Rats are no easy foes, and they are awaiting for you at the end of each island! Utterly defeat them and recover The Rainbow Machine! Good luck!</p><p><strong>Story</strong></p><p>Troubles! The mischievous Klepto Rats have stolen The Rainbow Machine following the orders of their wicked leader, the perverse and merciless Big Boss! Even more, they plan to sell the machine and have hidden its pieces and materials in treasure chests distributed throughout several islands full of colorful and fun puzzles! Now you must help the brave Tobi in his puzzle-packed mission to recover The Rainbow Machine! Good luck!</p><p><strong>Special Features</strong></p><ul><li>The game includes incredible puzzles based on bouncing marshmallows, breaking blocks with bombs, avoiding saws and monsters, bouncing off moving platforms and oranges, sliding ice blocks, and many more game actions.</li><li>Colorful and fantastic story scenes.</li><li>Collect coins! The Rainbow Machine includes a Store, and you will need plenty of coins to buy Extra Rebounders, Initial Impulse and other wonderful items that might prove really useful to reach treasure chests.</li><li>When you finish a level, you will see a Stars rating of your play. Open the treasure chests on your first try! That way, you'll get the maximum rating of 5 stars!</li><li>Find 16 pieces and materials of The Rainbow Machine.</li><li>Find 6 hidden trophies and show that you are an authority on The Rainbow Machine!</li><li>Mischievous bosses are awaiting for you at the end of each island!</li><li>Unlock islands by defeating bosses or rising your score.</li><li>Play a fun Jackpot stage at the end of some levels and win extra coins.</li></ul><p><strong>Controls</strong></p><p>Mouse control:</p><p>Left-click - Grab/drop a Rebounder's end (inside a level). Grab a Rebounder's end and move your mouse to change the Rebounder length and position.</p><p>Keyboard control:</p><p>Enter/Spacebar - Play/resume the game (inside a level)</p><p>R - Retry level (inside a level)</p><p>Alt + F4 - Close the game</p>", "metacritic": null, "released": "2014-08-02", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/07f/07f82e7c666c566209466a824a38a9e9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 53, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Android"], "developers": ["IKIGames"], "genres": ["Action", "Puzzle"], "publishers": [], "esrb_rating": null}