{"id": 149559, "slug": "zerwol-the-wizard", "name": "Zerwol the Wizard", "name_original": "Zerwol the Wizard", "description": "<p>\r\n\tZerwol the Wizard was made in 1 week for the Low Rez Jam, and was originally released in April 2016. It's a tiny action game where you play as a wizard. The idea is to collect a key, which unlocks a temple, meaning you can get the treasure and win. We are embarrassed at how videogamey this is and apologise unreservedly. Zerwol is also LowRez backwards, we really are so sorry.\r\n</p><p>\n<strong>WHY WE MADE IT</strong><br/>\r\n\t The Low Rez jam was a challenge to make a game with a native resolution of 64x64. We're not going to lie to you, we didn't have the time to make this particularly interesting, as we were doing Ludum Dare at the same time. The main aim with this was to get pathfinding working, as it's something we haven't been very good at implementing in the past. The game works OK on that front, the player and the enemies both do what you'd expect, so let's call that a win! The most fun we had play testing it was setting all the trees on fire with the special attack. We actually quite like trees, so we're not sure why we made a game about burning them, answers on a postcard please.\r\n</p><p>\n<strong>CONTROLS &amp; HELP</strong><br/>\r\n\t Left-click on the map to move to a spot, and right-click to shoot towards the crosshair. Hold down right mouse until the 4 corners of the crosshair go blue, then let go of right mouse to use your special weapon.\r\n\t<br/>\n</p><p>\r\n\tIt's very easy to get lost, so you need to head to the middle right of the map to find the key. Once you have the key, go towards the middle left of the map to find the temple with treasure in.\r\n\t<br/>\r\n\t If you can see a section of the map, you can click to move there even if you can't see a path. The little wizard will figure it out for you and you can just use the right button to blast stuff.\r\n</p>\n<strong>EDGE</strong>\r\n\t\r\n\t\r\n\t\r\n\r\n\r\n\t\r\n\t\r\n\t\r\n\t\tGameplay, Graphics,\r\n\t\t<br/>\r\n\t\tSound &amp; Music", "metacritic": null, "released": "2016-04-18", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/730/7304f2e70b0fd0fd9a4718e20af8a838.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 31, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Second Dimension Games"], "genres": ["Action"], "publishers": [], "esrb_rating": null}