{"id": 14963, "slug": "circuit-breakers", "name": "Circuit Breakers", "name_original": "Circuit Breakers", "description": "Circuit Breakers is a fast-paced multi-player top down shoot 'em up. Get together with five of your friends and fight to rid the universe of an intergalactic robot army or compete against them and rid the universe of each other! <br/><br/><br/><br/>Far in the future, advances in artificial intelligence have created the first truly sapient AI, FIRST- short for First Intelligent Robotic System model Two- system. Fearing for it's safety in a galaxy of savage humans, FIRST escaped to the depths of space. On a distant planet it finally landed, building an army for their inevitable return...Features:<ul><li>Easy-to-learn and hard-to-master chaotic shooter gameplay suitable for players of any skill level!<br/></li><li>Chew through hordes of enemies with four unique characters and additional unlockable characters<br/></li><li>Local multi-player for up to six players!<br/></li><li>Classic endless top-down action in Arcade mode!<br/></li><li>Play through specific courses and compete for the highest score in Score Attack!<br/></li><li>An enormous Challenge Board full of secrets to unlock!<br/></li><li>Customize your game with the Core System and fight things like super-armored lightning-fast matrix-dodging death robots!</li></ul><br/><br/><strong>Weapon type: Machine Gun</strong><br/>You’ve probably never met a man more full of himself than Aldo. He is the leader of the circuit breakers but his drive and confidence is unmatched and encourages the rest of the team to bring their A game. I mean, who wouldn’t want to wipe that smile off his face by sporting a bigger robot body count than him? Aldo's machine gun strikes a solid balance between range and power for an all-around great weapon.<br/> <br/><br/><strong>Weapon Type: Shotgun</strong><br/>There are few that rival Shelbys straightforward attitude. She is often mistaken as cold, but if you have a plan you want to set in motion, Shelby’s the girl who can follow through. Her weapon of choice, the shotgun allows Shelby to get up close and personal. Every other member of the team keeps their distance from the robots but Shelby thrives when close to the enemy.<br/> <br/><br/><strong>Weapon Type: Missile</strong><br/>There are many things you can say about Samson, but clever isn’t one of them. He is the team’s explosive guy, delivering a tremendous amount of damage with his signature missile launcher. Samson loves explosions and if you give him a recipe for a bomb, he will tell you the exact size of the explosion with 100% accuracy. So what Samson lacks in general knowledge he more than makes up for in explosive know-how.<br/> <br/><br/><strong>Weapon type: Laser</strong><br/>Aldo would never openly admit it, but Tay is the real brains of the operation. She is responsible for creating the weapons that the Circuit Breakers team uses today.  Her weapon of choice, the laser gun matches her interest in engineering. There are many scientific teams requesting her knowledge in the field of engineering, but she prefers the application instead of the theory.Other titles from Excalibur Games<br/>", "metacritic": null, "released": "2015-11-17", "tba": false, "updated": "2022-09-29T23:51:23", "background_image": "https://media.rawg.io/media/screenshots/cea/cea2db705b7d51f01da1e20a731a71db.jpg", "website": "http://www.excalibur-publishing.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 8, "owned": 195, "dropped": 3}, "playtime": 6, "achievements_count": 12, "ratings_count": 3, "suggestions_count": 273, "game_series_count": 0, "reviews_count": 3, "platforms": ["PlayStation 4", "Xbox One", "PC", "Linux", "macOS"], "developers": ["Excalibur Games", "Triverske"], "genres": ["Action"], "publishers": ["Excalibur Games", "Triverske"], "esrb_rating": "Everyone 10+"}