{"id": 14962, "slug": "dark-souls-prepare-to-die-edition", "name": "Dark Souls: Prepare To Die Edition", "name_original": "Dark Souls: Prepare To Die Edition", "description": "<p>Dark Souls: Prepare To Die Edition is an RPG set in the grim landscapes of Lordran, bringing the series for the first time on PCs. An open, seamless world, which spans from the top of the mountains to the lowest depths, offers players a new experience in the form of constant dangers and easily overpowering enemies.<br />\nThe main character of the game is the Chosen Undead, whose features and background are customizable by the player, following a steep path of fate, death, and life after death. The time is running short in the world, and only you can decide, will it hold fast or expire. The evergreen hills and the thick forests, the dark dungeons and the burning lakes of lava underneath the earth, all shall welcome the Chosen Undead with a deadly embrace. The outstanding soundtrack lets all the players immerse in the world of Dark Souls. <br />\nThe game features a well-crafted fighting system, with various weapons and armor, magical enchantments and handy tools to help the player on their journey. Another point of interest would be the multiplayer mode, allowing players to invade each other’s worlds, and fight to the death or cooperate and take on the strongest in-game bosses.</p>", "metacritic": 85, "released": "2012-08-23", "tba": false, "updated": "2024-04-18T17:46:12", "background_image": "https://media.rawg.io/media/games/511/5116b4524cea34c6b3f12e0ca027d850.jpg", "website": "http://www.preparetodie.com/", "rating": 4.36, "rating_top": 5, "added_by_status": {"yet": 178, "owned": 4040, "beaten": 889, "toplay": 96, "dropped": 331, "playing": 60}, "playtime": 14, "achievements_count": 41, "ratings_count": 1221, "suggestions_count": 669, "game_series_count": 0, "reviews_count": 1227, "platforms": ["Xbox 360", "PlayStation 3", "PC"], "developers": ["FromSoftware"], "genres": ["Action", "RPG"], "publishers": ["Bandai Namco Entertainment"], "esrb_rating": "Mature"}