{"id": 149763, "slug": "neo-gun-combat", "name": "Neo Gun Combat", "name_original": "Neo Gun Combat", "description": "<p><em>Shoot your opponent down in this game where bullets travel in waves!</em><br/></p><p>Fire your guns to hit the other player 5 times in order to win. However, your bullets travel in waves and if you're not careful, they might come around and hit you instead! Dodge the waves of bullets or try to hit the other player's bullets with your own and see what happens.</p>\n<p>This 2D local multiplayer shooter game was developed in Unity within 48 hours during the 2017 Global Game Jam to fit the theme 'Waves'. It was a team of 1 designer/artist and 2 programmers.</p>\n<p>In this project, I used trigonometry for the first time for the bullet movement. It took a while for me to understand the factors involved but the team got it to work as intended. This project was also well-scoped to fit the time constraints and we were able to deliver a polished game in the end.</p>\n<p><strong>This game is available to download at the bottom of this page.</strong><br/></p>\n<p> &lt;-- Back to Chan Yuen Theng's portfolio</p>\n\n<p><strong>Role</strong><br/></p>\n<p>Game Programmer</p>\n<p><strong>Contributions</strong><br/></p>\n<p>Below are the details and my thoughts on my contributions to this project.</p>\n<p><em>Gameplay</em></p>\n<ul><li>Bullet firing system\r\n<ul><li>The bullet trajectory is determined by the angle of the gun when it is fired.</li></ul></li></ul>\n<p><em>Visual Effects</em></p>\n<ul><li>Player particle system<ul><li>When the players move, a trail of particles is emitted behind them.</li><li>Players also die in a puff of particles.</li></ul></li><li>Bullet particle system<ul><li>A trail of particles follow bullets as they travel and are coloured based on the player that fired them.</li><li>Bullets also emit particles when they collide with a player.</li></ul></li></ul>", "metacritic": null, "released": "2017-08-02", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/1da/1da74f186c7371e6b1e71f801a8effa1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 124, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Chan Yuen Theng"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}