{"id": 149783, "slug": "philosophy-face-off", "name": "Philosophy Face-off!", "name_original": "Philosophy Face-off!", "description": "<p>Philosophy Face-Off! is a 2D top-down multi-player arena style game initially developed during OrcaJam 2013 by myself (Chris Tihor), Jonathon Cobb, Lantana Turundu, and Max Loy. I was game and level designer on this project.</p>\r\nOBJECTIVE:\r\n<p>Players compete to see who can be the first to achieve their philosophical goal. Each player has a different outlook on life and therefore a different goal. See how quickly you can achieve your own goal while interfering with the efforts of your opponents! The goals are as follows:</p>\n<ul><li>Neutralist – “Good things come to those who wait” – The player wins if their timer runs out before another player wins.</li><li>Philanthropist – “It is better to give than to receive” – The player wins by collecting x coins and giving them to other players.</li><li>Misanthropist – “Nasty, brutish &amp; short” – The player wins by stealing x coins from other players.</li><li>Capitalist – “A penny saved is a penny earned” – The player wins by collecting x coins and depositing them in their bank.</li></ul>\r\nGAMEPLAY:\r\n\n<p>The game can be played with up to four controllers (most XBox-like controllers are supported) or with the following keys:</p>\n<p>Player 1: W A S D</p>\n<p>Player 2: T F G H</p>\n<p>Player 3: I J K L</p>\n<p>Player 4: ↑ ← ↓ →</p>\n<p>All players play simultaneously on the same screen in one of a number of pre-designed levels. Each player has a predominant colour in their palette: red, green, blue, etc. Players can only interact with items that glow with the same colour as them. If a player cannot interact with an object, it remains greyed out and part of the background. Players have a limited range of vision represented by a glowing aura. Any items outside of this aura are invisible. Other players and walls are visible to everyone. (Invisible walls that need to be illuminated to be seen may be a future addition)</p>\r\nLINKS\r\n<p>Global Game Jam Page</p>", "metacritic": null, "released": "2018-05-17", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/4be/4beab80ace93c188bf07605d7c3f91d4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 44, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ironic Iconic Studios"], "genres": ["Action"], "publishers": [], "esrb_rating": null}