{"id": 149708, "slug": "bubble-hunter", "name": "Bubble Hunter", "name_original": "Bubble Hunter", "description": "<p>The Capcom classic that everyone loved is now back.</p><p>We combined Pang - Buster Bros - Bubble Trouble - Bubble Struggle to create Bubble Pang.</p><p>What makes Bubble Hunterdifferent ?</p><p>- Bubble Hunter was built on Buster Bros and Pang's bubble popping mechanics with many twists such as the addition of RPG elements </p><p>- Persistent Hero Levelling System: Level up your heroes and unlock their full abilities. Every round brings you closer to the next unlock.</p><p>- 4 Unique Heroes to unlock: Join Freddy, Mario, Limbo and Ninja in their fight and popping bubbles journey. </p><p>- HD Graphics and visual effects for maximum eye candy.</p><p>- Awesome Music by Jimecide who is the composer behind Only One</p><p>- Shoot and Blast your way through 40+ levels and an endless mode</p><p>- Bubble Bouncing mechanics based on Physics</p><p>- Tons of achievements to unlock</p><p>- Bubble Hunter is here to continue the Saga of the previously known classics such as: Bubble Shooter, Bubble Trouble, Buster Bros, Pang, Bubble Blast and Bubble Breaker</p><p>- Encounter unique enemies and bosses ( Look out for Easter Eggs: psst! you might see some candy and flappy birds crash your party ! ^-^ )</p><p>-------------------</p><p>Target Audience</p><p>-------------------</p><p>Bubble Hunter is suitable for everyone of all ages.</p><p>For those who didn't have the chance to enjoy the old Pang, Buster Bros, Bubble Trouble, Bubble Shooter or Bubble Breaker game back in days, now is the time to give it a try and experience the fun of bubble popping.</p><p>-------------------</p><p>Feedback and Support</p><p>-------------------</p><p>We always want to hear your feedback: </p><p>hi@runjumpfall.com</p><p>Please do not post your questions in the reviews. We answer all emails.</p>", "metacritic": null, "released": "2016-07-23", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/b84/b847323e4e99429d0c232bba4b5c1568.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 104, "game_series_count": 0, "reviews_count": 0, "platforms": [], "developers": ["RunJumpFall"], "genres": ["Action"], "publishers": [], "esrb_rating": null}