{"id": 149904, "slug": "their-lives", "name": "Their lives", "name_original": "Their lives", "description": "<p>This game was our submission for IGC2017.<br/></p>\n<p>The International Game Camp was created to encourage the exchange between Italian and international game designers and Italian experts in cultural heritage. </p>\n<p>All game developers were welcome to participate and create new worlds themed around cultural heritage.</p>\n<p>The event was produced by Streamcolors, Bookrepublic and iC-Innovazione Culturale by Fondazione Cariplo in association with IED Milano, George Brown College (Toronto, Canada), Politecnico di Milano and IVIPRO.</p>\n<p>https://www.internationalgamecamp.com</p>\n<p><strong>Genre</strong>: adventure game</p>\n<p><strong>Gameplay mechanics</strong>: Point-and-Click, drag-and-drop, quicktime-event</p>\r\nTeam name\r\n<p>Outside In</p>\r\nTeam members\r\n\n<ul><li><strong>Game Designer</strong>: Sofia Abatangelo</li><li><strong>Game Coders</strong>: Mario A. Di Bernardo - Bardh Shabani</li><li><strong>Game Artists</strong>: Joseph Zettler - Shyamli Verma</li><li><strong>Heritage Researcher</strong>: Rossella Genovese</li><li><strong>Film Makers</strong>:  Marco Frascarelli - Ruoshi Yang</li></ul>\r\nHigh concept and a brief overview of the game\r\n<p>Art represents, in our opinion, a glimpse of the extraordinary, a way to escape from the boredom and the repetitiveness of our ordinary lives. But what if we can look into the lives of the characters of our beloved and idealized painting? In this game we explore the lives of the main characters of iconic paintings, follow their struggle and witness their dissatisfaction. Each character wishes for a change: they all look at other paintings as they represent the solution to their problem, but as their protagonist comes to life we can see they all have struggles. Perfect happiness is possible only in the stillness of their dreams.</p>\n<p>The player transitions from one painting to another after the completion of some small tasks that reveal the personality and the struggle of the protagonist of that painting. The connection to a painting and the next is the ambition of the protagonist to become something that the next painting represents.</p>\r\nInspirational work of art used\r\n<p><strong>Maid (simpleness):</strong> The Milkmaid, Johannes Vermeer, 1660, Riksmuseum</p>\n<p><strong>Rich woman (Wealth): </strong>Andrea Mantegna, Camera Picta, 1471-1474, Palazzo Ducale di Mandova</p>\n<p><strong>Horse (Freedom): </strong>Paard uit Zuid-Italië (Appulus), Hieronymus Wierix, after Jan van der Straet, c. 1578 - c. 1582</p>\n<p><strong>Knight (Control): </strong>Cassone of the Three Ducks Lombard workshop, 1479-1494, Castello Sforzesco</p>\n<p><strong>Shepherd (peace):</strong> Giuseppe Raggio, mountain pasture, 1883, Museo Nazionale della Scienza e della Tecnologia (Milano)</p>\n<p><strong>Party person (Company): </strong>Frans Francken the Younger [?], Fr Vredemans De Vries Dance party in a Flemish room mid-eighteenth century, Galleria Sabauda, Musei Reali di Torino</p>", "metacritic": null, "released": "2017-10-20", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/581/58114225ab86f6517f24ab945963f0e3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 115, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS"], "developers": ["Sofia Abatangelo", "Madiber"], "genres": [], "publishers": [], "esrb_rating": null}