{"id": 150002, "slug": "mini-aliens", "name": "Mini Aliens", "name_original": "Mini Aliens", "description": "<p><strong>Mini Aliens</strong></p>\n<p>Help the small aliens survive through multiple levels and waves of dangerous everyday objects that are looking to destroy them. </p>\n\n<p><strong>Story</strong><br/></p>\n<p>The Mini Aliens have started their invasion on Earth. Unfortunately (for them), they accidentally activated Earth's ancient defense mechanism, which made object in Earth alive. Now, it wouldn't be such a bad thing to be attacked by a bottle of wine or a garden hose... but it's deadly if you're smaller than they are! Now, in order for the aliens to survive, it is <strong>you</strong><strong>r</strong> duty to help the aliens defend their space ship long enough for them to complete their invasion.</p>\n\n<p><strong>Game</strong></p>\n<p>3D vertical tower defense game. </p>\n<ul><li>8 levels (2 level types, kitchen and garden), all with unique waves of monsters, including a secret boss fight against an ancient enemy of the aliens</li><li>12 aliens, all with unique stats that will help with against the enemy</li><li>Some might say it's a difficult game - we say games nowadays are too easy. This should keep you busy and entertained for couple hours at least!</li></ul>\n\n<p><strong>Also included</strong><br/></p>\n<ul><li>Four desktop background pictures so that all your friends can see how much you like our game (1920x1080)</li><li>Two phone background pictures that show your eternal love to us (tested on iPhone6, and iPhone 5S - looks awesome!)</li></ul>\n\n<p><strong>Us</strong><br/></p>\n<p>Two blokes living abroad in other sides of the world that decided to go ahead and become game devs. All music (except main menu music) done by \"spinningmerkaba\". Everything else is done by us from scratch. </p>", "metacritic": null, "released": "2017-07-04", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/38b/38b04385ec961356980db4388e0da472.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 29, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Wombatindy"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}