{"id": 15015, "slug": "quell-4d", "name": "Quell 4D", "name_original": "Quell 4D", "description": "You are Murderman, a bad-ass veteran who lost his legs and now rides around on Mucus, his trusty slime beast friend. Together with Rooster, you have been sent on a top secret mission to The Lagoreatory to investigate a massive outbreak of mutated gene experiments. Mr. President has given you full authority in this matter; you are to kill anything that moves. Good luck, Murderman. Your country depends on you.<br/><br/>Spread terror among the Ratfox Army. Lay waste to the Drone Queen's Brood, and disrupt the dark rituals of the Ancient Triple Trunked Necro Order. Wreak havoc on the Double-Trunked Elephant population, cook the Necro Beefcakes and waste Space Slugs by shooting them off your face.<br/><br/>Live up to your name, Murderman, and quell your enemies with an arsenal of six unique weapons. Face off against three intricate bosses with unique mechanics, strengths and weaknesses. Prepare yourself for intense firefights in proper bullet hell fashion where you have to keep moving and firing to stay alive. Just like in the good old days!<br/><br/><br/>Quell 4D features free-roam movement to allow for unbounded exploration in VR.<br/>To get around, you ride Mucus, an omnidirectional Slime Mount lead around by a carrot on a stick. Simply point your carrot stick controller in the direction you want to go and hold the trigger to move. <strong>Classic touchpad movement is also available.</strong><br/><br/><br/>Blast your way through The Lagoreatory in a single player campaign of 10 hand-crafted levels of increasing difficulty. Get the key-cards, find the guns, grab the helmets. Eat the health bars. Drink the blood bags. Get from the Office Complex to the Laboratory Sector and Biome 32. Scale the Rooftops, explore the Redhall Temple and battle Necronomicus in the Rift World... It gets pretty wild.<br/><br/><br/>Enter the inter-dimensional portal that is the HTC Vive and experience a retro-shooter in Virtual Reality like never before. Be Murderman™ in True 4D.<br/><br/>“Wow man!!! It’s like I’m actually there!”<br/>- Abraham Washingtron XControls:<br/>", "metacritic": null, "released": "2016-10-14", "tba": false, "updated": "2019-08-28T22:11:47", "background_image": "https://media.rawg.io/media/screenshots/96c/96c5022b9c340ed29a224c0db9dfd9d8.jpg", "website": "http://quell4d.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 15, "dropped": 1}, "playtime": 1, "achievements_count": 15, "ratings_count": 0, "suggestions_count": 119, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Rubycone"], "genres": ["Action", "Indie"], "publishers": ["Rubycone"], "esrb_rating": null}