{"id": 15046, "slug": "dark-storm-vr-missions", "name": "Dark Storm: VR Missions", "name_original": "Dark Storm: VR Missions", "description": "<strong>Dark Storm: VR Missions</strong> is a single-player stealth/action title developed by Fenrir Studios and inspired by classic games such as Metal Gear Solid and Deus Ex.<br/><br/>Discord and Dev Community Server (All are welcome!)<br/>What we're trying to do by opening up a public discord for people that are interested in the game to talk to devs and follow news and to make a hub for our patreon to talk with us. If your supporter or pateron message a dev or post in the chat so we can verify it and give you the proper tag.<br/> Join our Dev Discord. We want to hear what you have to say!<br/><br/>We are currently developing <strong>Dark Storm: VR Missions</strong> as a stand-alone module to test and fine-tune the core game mechanics that will be in our upcoming full release title, Dark Storm: Ascension, as well as introduce players to the world of Dark Storm. Purchasers of <strong>Dark Storm: VR Missions</strong> will receive a discount to <strong>Dark Storm: Ascension</strong> upon its release. <br/><br/>People who purchase Dark Storm: VR Missions should understand that this is a proof of concept, and independent module of Dark Storm Ascension, and is being used for the time being as a way for those who are interested in Dark Storm Ascension to help fund, and support us, while watching development of both VR Missions, and Ascension. Dark Storm: VR Missions is in no way complete, and the following things listed below are our final aim for both VR Missions, and Ascension. <br/><br/>For more information about <strong>Dark Storm: Ascension</strong> please check out our Patreon page, where you can also further support the development.<br/><br/><strong>*NOTE: You do not need a VR Headset to play this game*</strong> <br/><br/>Complete Advanced Training in a Virtual Reality World<br/>Players take control of Amber Kingsley, a former U.S. Special Forces officer hired by Ancile, the world’s leading private military corporation. Tasked to protect the Irving Apex Research Facility in Alaska, Amber must first undergo advanced training within Irving’s next-generation VR simulator.Control the Engagement...<br/>Choose your preferred playstyle to tackle the game’s different scenarios, be it gripping stealth or intense action; you have the power to be as covert or as gung-ho as you desire....But Prepare to be Matched<br/>Play how you want and the AI will match it. The game’s Dynamic AI enemies are programmed to react intelligently to the player’s every move; flanking, calling in reinforcements or even tactically retreating depending on the situation.Utilise Future Technology<br/>Dark Storm takes place in the near future, the year 2034, and the tools you have access to in the game reflect that. Alongside various unique weapons, you can also pilot a deployable drone to pinpoint enemy patrols, hidden positions, or a faster route to reach your objective and take advantage of the Sya Enhanced Projection system to view real time information about your enemy.Intuitive Camera Perspectives<br/>The game features an immersive true first-person perspective that pulls you into the action in a believable way. And, if first-person isn’t your thing, you can also experience Dark Storm in an equally immersive dynamic third-person perspective, featuring a shoulder-switching camera.Discover an Original and Immersive Narrative<br/>Dark Storm isn’t just a video game, it’s an experience. As you progress through the game you will discover hidden text and audio logs that add depth to the storyline and breathe life into the Dark Storm world.Fully Voice Acted<br/>The story features professional voice acting for cutscenes, AI and characters. Voice actors include Danielle McRae (World of Warcraft and League of Legends) and River Kanoff (Heroes of Newerth and Dust: An Elysian Tale), as well as a number of up-and-coming indie talents.Open and Honest Development Team<br/>Dark Storm is developed by Fenrir Studios, an independent game development studio founded by a small group of game design enthusiasts in 2012. We pride ourselves on three key principles: ambition, quality and honesty.<br/><br/>We welcome comments and feedback on our Steam Forums or via Twitter, where you can also receive regular updates about the development process. Team members also regularly stream what they’re currently working on via Twitch. Be sure to also check out our Patreon page if you want to support us further.", "metacritic": null, "released": "2015-08-19", "tba": false, "updated": "2019-08-28T22:11:46", "background_image": "https://media.rawg.io/media/screenshots/eae/eae485bd5cc00c53c1b14f18e5eb0e6f.jpg", "website": "http://www.adarkstormiscoming.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 35, "dropped": 1}, "playtime": 4, "achievements_count": 0, "ratings_count": 3, "suggestions_count": 283, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC", "macOS"], "developers": ["Fenrir Studios"], "genres": ["Action", "Adventure", "Strategy", "Indie"], "publishers": ["Fenrir Studios"], "esrb_rating": null}