{"id": 150467, "slug": "pontaises-all-about-the-player", "name": "Pontaise's All About The Player", "name_original": "Pontaise's All About The Player", "description": "<p>\r\n\tThe successful mobile game is finally available for free on PC! All About the Player is one of Alexandre Pontaise's finest works. A game in which he decided to give to the player only what they wanted: \r\n\t<strong>gameplay</strong>, and <strong>agency</strong>.\r\n</p><p>\n<em>All About the Player</em> allows you to press buttons in any order you want. \r\n\t<strong>Billions of different possibilities! </strong>It won't try to distract you with a story or fancy visuals: what matter is what <em>you </em>do! You are the only hero of your own story. <em>All About The Player</em> also offer you a <strong>real challenge </strong>so that you can finally feel important.</p><p><em>Use your keyboard or mouse to interact with the game.</em>\n</p><p>\r\n\tThis PC version also come with some extra content! If you are a challenger, you can unlock the \r\n\t<strong>Pure Gameplay Mode</strong>, and see if you are a <em>Real Gamer</em>.\r\n</p>A WORD FROM ALEXANDRE PONTAISE<p><em>All About The Player is an absolutely unique gaming experience, as well in term of fun than in its game-design. It is the culmination of years of video-game studies, and it gives a precise definition of video-game. It's not about art, it's not about stories or poetic fluff, it's a game mostly made of Gameplay. You most certainly never have played a game with as much focus on the player. And isn't what all games should be made for? My only goal here was to maximize player's satisfaction. But as proud as I am to be the author of one of the most important game of this decade, it is also my duty to remain humble. All About The Player has always had two purposes: the first, already proven successful, is to be absolutely exciting to the player. But the second is to inspire other game-designers. It is now no doubt that my game marks a new age for the video game industry, and that there will be discussions about it for generations. I hope my work will help future game creators to make games as powerful as mine, in which all players will be able to relate. Never forget: the most important part of every game is the Gamers. If you are a game developer and remember that rule, one day, you might be able to say “I've made a game that would make Alexandre Pontaise proud”!</em></p><p><em>There is a long way for us game-designers before we fully understand video-game. Therefore, I will always be grateful toward the people that have accepted me as their intellectual lighthouse.</em></p><p><em>But of course, most of my thanks go to you, the players. You are the only actor in the industry that matter, don't ever forget that. I you want to have an even bigger impact, I can't recommend you enough to buy my other games! It would be a true honor for me, really.</em></p>WHAT THE PRESS SAID<p>\n<em>(quotes from 2013 on the mobile game)</em>\n</p><ul>\n<li><em>“An essential lesson of game-design. […] Pontaise teaches us brilliantly how the player should always be in the center of any game.\" -</em> Ludogamer Journal</li>\n<li><em>“Never have I experienced so much gameplay in a single game. All About The Player gets rid of all the useless to focus on what matters the most!\" </em>- Playing On Bits<br/>\n</li>\n<li><em>“I'm discovering something new on each session! The amount of possibilities this game offers is amazing.\" </em>- Journal des Jeux Électroniques<br/>\n</li>\n<li><em>“This is what elegant design coupled with empathy toward players leads to.\"</em> - Diego Mitchell<br/>\n</li>\n<li><em>“I can't stop playing Pure Gameplay Mode! Every game should have this option.\" </em>- @gamingscienceofficer<br/>\n</li>\n<li><em>“All About the Player is life changing. I'm feeling like a better person.\"</em> - Helen F. Sight</li>\n</ul><p>\n<strong><em>Note from Itooh:</em></strong><em> Please be aware that I am not affiliated  </em><em>with Alexandre Pontaise. My job here was only to port his game. If you want to contact with M. Pontaise, you can send me your message, and I'll try to make him acknowledge it. However I can't guarantee anything, and quite frankly it's unlikely he'll bother to answer. Last time he has been confronted to criticism, well, let's just say some twitter accounts got banned. Don't worry though: I'm certain he won't ever open this page, and he has probably never read himself players' feedback. I'll just answer your questions as much as I can, it's for the best.</em>\n</p><p>\n<em>Game made with Superpowers</em>\n</p><p>\n<em>The font used is Pier Sans</em>\n</p><p>\n<em>Source code \r\n\t</em><em>available on github</em>\n</p>", "metacritic": null, "released": "2016-08-30", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/ded/ded6a041c7cfdf76dda14b37c017027d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 6, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Itooh"], "genres": [], "publishers": [], "esrb_rating": null}