{"id": 150449, "slug": "wars-across-the-world-expanded-edition", "name": "Wars Across The World - Expanded Edition", "name_original": "Wars Across The World - Expanded Edition", "description": "<p>WAW is a unique game concept which aims at simulating in one single system ALL conflicts throughout the world (and beyond) from Prehistoric times to nowadays, from grand massive wars to asymmetrical conflicts. And it will work also on non-historical, alternate history, fantastic or SF titles. The key is the use of a single system of rules and situations which works in all cases. </p><p>Why? Because we want players to learn rules only once, get confident and at ease with them, and then spend all their time with the titles in the collection in a speedy and effortless manner ... for example, the battle screen will be similar throughout the games, and thus will require almost no adaptation for enjoying it in a new game! </p><p>Practically, a few minutes are required to read about the specific properties and content of a new scenario and you can jump right in!</p><p>The Main Game Features includes:<br/></p><ul><li>Game is turn-based, using the I GO U GO system, each player taking one side (sides involve sometimes more than one nation).</li><li>The map is divided into numerous regions, with various terrains and sometimes structures (ports, fortresses, airports ...), and potentially sources of income when necessary.</li><li>When maintenance and purchase of forces is needed, or to acquire new event cards, a simple income system is activated.</li><li>Combat units may be from the land, naval or air domains. You will find different types, such as infantry, cavalry, artillery, guerrillas, submarines, flat tops, fighters, elephants, anti-aircraft batteries, etc ... All of which can be combined into different stacks for easy handling.</li><li>Leaders are crucial in the game, as they have three main usages: first they give bonus to the base combat values of their stacks, second their morale values are use to check victory or defeat levels, and lastly they are necessary to launch attacks on the enemy.</li><li>Two opposing stacks in the same region generate a battle, which is resolved in a semi-tactical way in two successive rounds. The game automatically calculates the various bonus and penalties of sides, their respective morale levels, allows for event cards play, and they each combat unit of each side shoots simultaneously (in most cases) at the enemy. Losses are taken in terms of hits and panics. The moral level of the initial army affected by the losses and panics suffered, which in turn may lead to rout, pursuit and breakthroughs.</li><li>Multiple Events Cards packs are granted to each side, that they will use to influence all aspects of the game, such as alliances, income, movement, weather, leadership, number and quality of troops and finally many tactical aspects for the battles. This ensures both a real uncertainty in the game and a great replayability potential.</li></ul><br/> <br/><p>The scale changes according to scenarios. A ground combat unit could be only a simple battalion or a whole army. A region may represent a few square miles or a whole country. And similarly, a game turn could be just a few hours or up to many years! </p><p>Game allows for coverage of different 'spaces' of play, such as land, sea, air or outer space…! </p><p>Basically, all titles in the Classic collection have a reasonable playing time and a limited number of units and cards, making them both fun and fast to play. </p><p>The Expanded collection is more ambitious, usually doubling the scope of the Classic one. <br/> <br/> <br/></p><p>WAW essentially offers two collections, the <strong>Classic </strong>(short game play time, a hundred or so units, three dozens of event cards, a game map equivalent to about 2 game screens) and the <strong>Expanded </strong>(double size more or less from the Classic). Each collection will require a <strong>base pack</strong> to run (giving the engine, 3 games and the editor), and you will be able to get also thematic packs (4 games on the same topic / region) in addition to the independent game scenarios. <br/> </p><p><strong>The base pack, WAW 'CLASSIC'</strong> is delivered with 3 different themes (and then dozens of DLCs): <br/></p><ul><li>HASTINGS 1066, opposing Normans, Vikings ands Saxons to claim the crown of England.</li><li>SARATOGA 1777, the battle that changed the course of the War of Independence. </li><li>NORMANDIE 1944, the most famous landing operation on the beaches of France.</li></ul><br/><strong>The advanced pack, WAW 'EXPANDED'</strong> version of the engine offers larger maps, more units, generals, playing cards and events. It is delivered also with 3 themes: <br/>AUSTERLITZ 1805, Napoleon's most famous campaign; <br/>BERLIN 1945, the fall of the Nazis against the Soviets; <br/>and KOREA 1950, the hottest conflict of the 'Cold' war! <p> <br/></p><p>WAW will work in French, English, Spanishh, German and Russian. Other languages following according to demand. </p><p>First version is in solo mode and hot seat; email and multiplayer should be coming late 2017. </p><p><strong>Each month, a new scenario will be released!<br/></strong></p>", "metacritic": null, "released": "2017-05-03", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/1de/1de2f7aab0027108567b584e962ea7fc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 238, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Plug In Digital"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}