{"id": 15056, "slug": "police-stories", "name": "Police Stories", "name_original": "Police Stories", "description": "<p>The game is in the development. Visuals and mechanics will be improved.<br />\nPolice Stories is a novelty top-down shooter, where advanced AI of enemies, tactical elements and random occurrences create thousands of unique situations in each level. Never before the pixel game was this realistic and fun.<br />\nYou’re on the side of the lawYou can’t go in guns blazing. Surprise the perps and make them surrender. Keep a close eye on those who yield and don’t forget to cuff them or you may get your back full of holes. Beat the information out of those bastards but don’t overdo that - you need them alive.<br />\nRick Bronx, your trusted partnerKeep your fellow operative close at all times and point him in right directions - this will improve your chance of success and you will less likely be killed. Rick has wide array of special equipment: peek through doors, blast them, blind your enemies and much more.<br />\nEach time is a new timeBe careful - you will never know where the enemy will be and how he will react. It will make each playthrough of levels unique and will provide new challenges.</p>", "metacritic": 71, "released": "2019-09-18", "tba": false, "updated": "2024-04-08T23:16:28", "background_image": "https://media.rawg.io/media/screenshots/9e1/9e11b9a8958de594c9e294fd0e569c7e.jpg", "website": "http://policestoriesgame.com/", "rating": 3.49, "rating_top": 4, "added_by_status": {"yet": 37, "owned": 946, "beaten": 52, "toplay": 32, "dropped": 26, "playing": 4}, "playtime": 2, "achievements_count": 87, "ratings_count": 69, "suggestions_count": 174, "game_series_count": 0, "reviews_count": 70, "platforms": ["Nintendo Switch", "Linux", "macOS", "PC", "PlayStation 4", "Xbox One"], "developers": ["Morgan Games", "Mighty Morgan"], "genres": ["Action", "Shooter", "Strategy", "Simulation", "Indie"], "publishers": ["HypeTrain Digital"], "esrb_rating": null}