{"id": 150639, "slug": "lines-itch-plug-in-digital", "name": "Lines (itch) (Plug In Digital)", "name_original": "Lines (itch) (Plug In Digital)", "description": "<p>Lines is an abstract ‘zen’ game puzzle experience where form is just as important as function. Place or remove dots to initiate a colourful race that fills a drawing. The colour that dominates the race wins. This apparently simple concept becomes intricate quickly with 6 game modes: Point, Eraser, Rope, Knife, Mixed and Infinite.</p>\n<p>For the PC/Steam edition, we have increased the difficulty level and added an extra challenge: Infinite mode. On top of that, players are able to create and share their own levels in the level editor, which is connected to Steam Workshop. This opens up opportunities for an infinite amount of levels and creativity from and for the community. Finally, we added full Twitch integration. Allowing streamers to play Lines together with their viewers and viewers to take on each other.<br/><br/>Lines is perfect for short game sessions. Play a single session in a matter of seconds or find yourself making a winning streak of 20 games in a row. Or create your own perfect level for the community to play. <br/><br/><strong>Features</strong></p>\n<ul><li>250 levels in the core game. Endless more in the Steam Workshop.</li><li>A Level Editor with Steam Workshop integration.</li><li>6 game modes: Point, Eraser, Rope, Knife, Mixed and Infinite mode.</li><li>Set a winning streak. Earn trophies and achievements.</li><li>Play under pressure in the Daily Challenge, in which you only get one chance!</li><li>Full Twitch integration.</li><li>Fully localized in English, German, Russian, Brazilian Portuguese, Chinese, Italian, Spanish, French and Dutch.</li></ul><p>Developper : Gamious</p>", "metacritic": null, "released": "2017-06-06", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/823/82348fa2f96e0f58a0fd411c3b37ef69.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 48, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Plug In Digital"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}