{"id": 150692, "slug": "crumbling-dungeon", "name": "Crumbling Dungeon", "name_original": "Crumbling Dungeon", "description": "<p>This is my entry for the Ludum Dare 42 Compo, following the theme \"Running out of space\".</p>\n<p>Even before voting began, I wanted make a game with a Game Boy-like graphical style (4 tones of gray, a resolution of 160x144, the works). I feel the limitations of such a style would make for an interesting challenge, and would give me some direction when drawing the graphics.  \r\n<br/>\r\nOne interesting feature I wanted to implement, that would go hand-in-hand with the graphical style, was to allow the player to change the palette used by the game - so one could choose tones of gray or the greenish tones of the Game Boy screen, for example. Unfortunately, technical difficulties meant I had to drop that last idea (read: I didn't have quite enough time to implement it).</p>\n<p>Once the theme was reveled, the idea of exploring a dungeon where each step you make would create a hole quickly came to mind, and seemed like a good fit for the graphic style. I took inspiration from \"The Legend of Zelda: Link's Awakening\" (and other 2D Zelda titles) when designing the crumbling dungeon, giving each gameplay feature (the holes, the attack, the teleporters, etc...) some interesting scenarios to play with. The crumbling floor, however, made balancing very difficult - any required backtracking would represent an incredible spike in difficulty.  \r\n<br/>\r\nDesigning a Zelda dungeon in two days (when it probably takes weeks or months for a team of professionals to do the same) was very intimidating, but given the restraints, I am happy with how it came out.</p>\n<p>This time, I also composed the music for the game (rather than tweaking an AI to do it for me) and, while the tunes are short, I am happy with how they came to be. If possible, do give a moment to listen to Agharamish's Battle theme - depending now how long it takes you to beat him, you might not hear the actual melody.</p>\n<p>Finally, I'm happy I was able to give the game a proper introduction, title screen, main menu, ending, and even some scripted events! These little details really do make the game feel much more polished.</p>\n<p>Still, some things were left out: the game has no sound effects, no ending music, the player gets no upgrades, there's no pause function (oops! This was half implemented, but I forgot about finishing it), the dungeon only has one floor. I though of doing an introductory sequence where the player would approach the castle, but that too was cut.</p>\n<p>Overall, I'm glad with the final result. I hope you enjoy it too!</p>\n<p>Game Engine: GameMaker Studio 2 \r\n<br/> \r\nGraphics: Paint.net, Paint  \r\n<br/>\r\nMusic: Bosca Ceoil</p>", "metacritic": null, "released": "2018-08-12", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/5cc/5ccd382660f4b0d25df478da5f4b524a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 34, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["JSMCAG"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}