{"id": 1507, "slug": "the-living-dungeon", "name": "The Living Dungeon", "name_original": "The Living Dungeon", "description": "Play a tactical dungeon tournament board game adventure, and not have to clean it up afterwards. There really is nothing quite like The Living Dungeon.<br/>Up to 9 players can take part in a battle of wits, luck, and skulduggery. Survive other adventurers, monsters, and the dungeon itself through combat, agility or dungeon manipulation. Only the strongest, fastest and smartest survive.<br/><br/>Each player has only 5 actions per turn. They then have only 2 fretful minutes to decide what to do with those 5 actions. Panic will set in. The possibilities and threats will become overwhelming. Your mind will freeze up! Your time is running out for you to complete your objective, but one wrong move could be fatal! There are just so many ways to die in The Living Dungeon.<br/><br/>Features<br/><br/><ul><li>Lots to Do: a thirty hour story mode, 4 multiplayer modes including Assassination, Head Hunter, Random Assassination, and Escape mode. All of that and you only need one controller.<br/></li><li>Unique Gameplay: Mix Tactics, luck and wit to outplan and out manoeuvre your enemies. Kill them, or help them kill themselves.<br/></li><li>Replay Value: The board layouts are generated randomly, so with A.I. biases and dice involved, no two games will ever be the same.<br/></li><li>Drop In/Out Multiplayer: Oh no! Phone call in the middle of an epic game with 8 players! It’s ok. You can switch your character onto A.I. mode temporarily. You don’t have to stop the game.<br/></li><li>Double Style: Play the game in a nasty evil dungeon, or a friendlier board game in a tavern. Two visual stylings to suit your mood.<br/></li><li>Control The Dungeon: Your little sister came in and wants to join in right in the middle of an epic match. Why not let her take over the dungeon. That way you can bribe her to ensure your victory.<br/></li><li>That’s Enough: You don’t need any more bullet points because this is a totally different experience and great fun. It’s also quite pretty.</li></ul>", "metacritic": null, "released": "2015-11-02", "tba": false, "updated": "2019-09-17T13:42:22", "background_image": "https://media.rawg.io/media/screenshots/a47/a473fdb64b7b5bac6c7fe4eedf4d6e2c.jpg", "website": "http://www.thelivingdungeon.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 82}, "playtime": 6, "achievements_count": 42, "ratings_count": 0, "suggestions_count": 412, "game_series_count": 0, "reviews_count": 0, "platforms": ["Xbox One", "Linux", "PC"], "developers": ["RadiationBurn"], "genres": ["Adventure", "Strategy", "Simulation", "Indie"], "publishers": ["RadiationBurn"], "esrb_rating": "Teen"}