{"id": 150728, "slug": "sam-snow-ld40", "name": "Sam Snow - LD40", "name_original": "Sam Snow - LD40", "description": "Sam Snow and the icy wizard\r\nThe more (higher) you get, the worse it gets.\r\n\n<p>You\r\n are a young boy (Sam).\r\nYou lived a happy live in the sunny kingdom. One day a evil wizard \r\nappeared that transformed your kingdom into an icy landscape. Now you \r\nhave been chosen by the omniscient oracle to drive the evil wizard out \r\nof sunny kingdom. To free it from its icy occupator and to let the sun \r\nshine again. To fight the evil wizard you have to climb to the top of \r\nthe dusty mountain and challenge him for a fight.\r\nBut be aware the higher you get the less you will be able to see. And if\r\n you fall … just don’t fall.</p>\r\nControls:\r\n<p>Control\r\n Sam with A-D-keys or the left- and right-arrow keys. To be able to \r\nclimb the mountain you sometimes have to use Sams super power: Jump 2 \r\nTimes in a row. </p>\n<p>Use the space-bar-key to jump (up to 2 times in a row) and the F-key to throw fireballs. </p>\r\nThe servants of the evil wizard are:\r\nThe evil Snowman:\r\n<p>\r\nHe throws icy snowballs at you that will hurt you.</p>\r\nThe gruesome Snowghost:\r\n<p>\r\nHe is not bound to a body, which makes him extremely dangerous. If you \r\ncome too close to him he will hunt you down and suck the life out of \r\nyou. </p>\n<p>In the first level you have to climb to the top and find a \r\ngolden key that will teleport you to the mountain of the evil wizard. \r\nThere you will challenge him and his servants to fight you. \r\nHe looks like an ordinary oversized snowman … but be aware!</p>\n<p>–</p>\n<p>The higher you get the smaller your field of view becomes:\r\n</p>\n<p>–</p>\r\nTools used:\r\n<ul>\n<li>Unity, Inkscape, Audacity for Sound editing (Sounds recorded by me).</li><li>Everything was done on a Macbook Air with a Touchpad.</li><li>Snow sounds were recorded with an Iphone6S Plus.</li><li>Wind sounds were recorded with the Internal Macbook Microphone.</li></ul>\r\nThis is my first GameJam and my first Ludum Dare.\r\n<ul>\n<li><p>I definitely plan too continue working on Sam Snow. </p></li><li><p>Let me know what do you think about the mechanics and the art style.</p></li><li><p>Thank you for playing Sam Snow :) </p></li></ul>\n<p>Matze (Matthias) Schedel\r\n</p>", "metacritic": null, "released": "2017-12-04", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/3eb/3ebe1515368a6e93e2a6b36b500dc054.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 53, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["matthiasSchedel"], "genres": [], "publishers": [], "esrb_rating": null}