{"id": 150863, "slug": "epic-trucker-rampage", "name": "Epic Trucker Rampage", "name_original": "Epic Trucker Rampage", "description": "<p><strong>Epic Trucker Rampage</strong></p><p>Kurt the Trucker was hammered last night and now have to go on a quest to retrieve his lost wife! Come abord this journey to the darkest place in town and in the life of the craziest trucker in the video game world! </p><p>-Top down shooter with<strong> 5 levels</strong>, an adaptative AI and 2 gameplay mode.</p><p>-Play and follow a <strong>funny scenario</strong> or play the highscore in the rampage mode!</p><p>-Laught and enjoy funny dialogues between all levels!</p><p><strong>Instructions: Aim and shoot with the mouse and move with your keyboard arrows.</strong></p><p>If you like the game please help us by supporting the studio and making a donation with the <strong>Support this game</strong> button. Your help is very precious and much appreciated!</p><p>Visit our website at <strong>www.simiusgamestudio.com</strong>, and follow us on Facebook for news and exciting future release!</p><p>-------------------------------------<br/></p><p>Kurt le routier a un peu trop bu hier soir, et il doit maintenant se résoudre a retrouver sa bien-aimée disparue. Embarquer dans une aventure folle et haute en couleur dans les endroits les plus mal famées de la ville et dans la vie du routier le plus fou de l'univers des jeux vidéos. </p><p>Instructions: Viser et tirer avec la souris, et déplacez-vous avec le clavier.</p><p>Si vous aimez le jeu, merci de supporter le studio en faisant une donation via le bouton <strong>Support this game</strong>. Votre aide est extrêmement précieuse et infiniment appréciée.</p><p>Visitez notre site web à l'adresse suivante: www.simiusgamestudio.com, et suivez nous sur Facebook et suivez notre actualité!</p>", "metacritic": null, "released": "2015-03-02", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/934/934beacad978fe427c35cf3ecfb1f9bf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 47, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Simius Game Studio"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}