{"id": 150865, "slug": "berlin-1989", "name": "Berlin 1989", "name_original": "Berlin 1989", "description": "<p>L’automne 1989 est rempli de tensions et amène tranquillement la chute de l’URSS. Les citoyens de Berlin Est vivent dans l’incertitude et dans la peur. Ils ne peuvent quitter leur coin du pays. Ils sont surveillés et séquestrés. L’URSS ne fournit plus assez de nourriture à ses occupants. Ainsi, des manifestations se déclarent pour en finir avec la peur, la surveillance et le manque de nourriture. Berlin 1989 s’inspire de ces événements afin de donner le pouvoir au joueur d’être une rebelle de Berlin Est. Le personnage d'Anke se faufile dans les bureaux des gardes de l’URSS, de la Stasi et du KGB pour récupérer des documents qui mèneront à la chute du mur de Berlin. Elle doit se cacher des gardes, ainsi que les faire se déplacer en ouvrant et en fermant les lumières. Elle doit résoudre des puzzles pour récupérer les documents et s’enfuir avec ceux-ci. Par contre, elle ne peut pas se battre contre les gardes puisqu’ils sont armés. Dès que les gardes détectent Anke, elle doit recommencer sa mission du début.</p><p>Un prototype réalisé par Marie Gabrielle Plante, Constantin Beauviche et Myriam Boisvenue St-Jean. </p><p>Sound design par Maxime Carpentier, David Prévost-Brisson, Jérémie Ricard et Charles-Antoine Morin.</p>", "metacritic": null, "released": "2018-08-15", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/0a4/0a45c1a5065fcc95cb664f70c3b2c361.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 150, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["myri"], "genres": [], "publishers": [], "esrb_rating": null}