{"id": 150931, "slug": "push-the-ball", "name": "Push The Ball", "name_original": "Push The Ball", "description": "<p>Our first game, Push The Ball, is now available on \r\nitch.io. Push The Ball is a 2D arcade game in which the player must \r\nguide balls into a hole while avoiding obstacles or falling into the \r\nhole. The game features four boards, each with its own art and music. \r\nThere are three sizes of balls, spawning continuously around each board.\r\n Each ball is equipped with a slightly different physics behavior.</p><p>  The player is represented by a simple wooden \r\npaddle. Using this paddle, the player will attempt to catch the balls \r\nand guide them into the hole.</p><p>Gutter Board</p><p>  In Gutter Board, balls drop from near the top of \r\nthe board. The player must race to grab the balls before they fall into \r\nthe \"gutter\" at the bottom of the screen.</p><p>Brick Board </p><p>  Brick Board features a grid of blocks near the top \r\ncenter of the board. The balls will tend to get entangled in these \r\nblocks, and the paddle will only fit through some of the gaps. On this \r\nboard, the hole will scroll from the top to the bottom of the screen.</p><p>Funnel Board </p><p>  In Funnel Board, balls will drop through a funnel \r\nlike structure into a narrow space bellow. Between the player and the \r\nhole, there is a \"negative hole.\" This hole will block the player and \r\nthe balls, leaving only a narrow gap to slip by as it rides up and down \r\nwithin a narrow pathway.</p><p>Avoidance Board </p><p>  Avoidance Board has a very large \"negative hole\" \r\nthat occupies most of the center of the screen. It will slide back and \r\nforth across the screen. Along the bottom boarder of the screen is the \r\nobjective. This hole is much smaller and will also slide across the \r\nscreen.</p><p>  twitter: @yellowDotGames</p><p>website: </p><p>http://yellowdotgames.wix.com/yellowdotgames</p><p>Demo: </p><p>http://www.indiedb.com/games/push-the-ball/downloads/avoidance-board-demo</p>", "metacritic": null, "released": "2014-03-06", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/38b/38be9c0ade897856fec0e7cca3202fff.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 155, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["yellowdotgames"], "genres": ["Action"], "publishers": [], "esrb_rating": null}