{"id": 15109, "slug": "shuffle", "name": "Shuffle!", "name_original": "Shuffle!", "description": "“Shuffle!” was originally released by Navel in 2004, at the same time when “Fate/Stay Night” and “CLANNAD” were gaining popularity. With the “Shuffle!” TV animation and a console release which followed the initial release, it has managed to sell over 200,000 copies making it an incredible popular visual novel.<br/><br/>Now, YumeHaven is releasing the console version of “Shuffle!” in English on Steam. <br/><br/>In addition to the 5 girls’ routes which were originally available in the console version, 2 more playable routes have been added, “Kareha” and “Mayumi Thyme”.<br/><br/>NerineCalled “Rina” for short, she is the only daughter of the King of the Demons. Just like Lisianthus, she came to the human world with the memory of Rin held close to her heart.<br/>She is extremely polite, and somewhat timid and shy, but she doesn’t hesitate to release her demonic magic upon anyone who makes fun of Rin. She also has a beautiful singing voice that’s known as the “Angel’s Bell”, but she hates singing.<br/><br/>LisianthusCalled “Sia” for short, she is the only daughter of the King of the Gods. Unable to forget the time she met Rin as a young girl, she moved to the human world. Her personality is very bright and energetic. She’s personable and is the mood-maker, able to easily speak with anyone. While she’s very good at housework and sports, she hates studying. She’s also been known to beat her father with a chair when he gets out of control.<br/><br/>Kaede FuyouA childhood friend of Rin’s, as well as his roommate. She lost her mother in the same accident that took Rin’s parents. She attends the National Verbena Academy and is one of Rin’s classmates.<br/>Clear-headed, athletic, beautiful, and great at housework, she’s basically perfect, and is considered to be the school’s idol. However, her habit of making Rin her priority often causes her to neglect herself.<br/><br/>Asa ShigureAn upperclassman in the cooking club, of which Kaeda used to be a member of. This led to her current love-hate relationship with Rin (they’re basically a bad influence on each other).<br/>She’s very serious and hardworking, yet also very lively and fun at the same time. Behind her grown-up personality, she’s also very good at having people spoil her. Her favorite things are cake and hard work. She also hates magic for some reason.<br/><br/>PrimulaCalled “Rimu” for short. She is an artificial life-form developed in a joint venture between the Gods and Demons. Having heard so much about Rin from the others, she decided to come to the human world to see what all the fuss was about.<br/>She doesn’t speak much, and really dislikes socializing. She lacks fundamental likes, dislikes, and interests (although she is apparently interested in cats). Since meeting Rin, this has slowly, but surely, started to change.<br/><br/>KarehaA girl from the world of Gods. Close friends with Asa, they belong to the same cooking club. The two are so good at cooking that they’re referred to as the “Queens of the National Verbena Academy Cooking Club”.<br/>A hardcore romanticist, she also has quite a rich imagination. Quick to put together imaginary love stories in her mind from random words in conversations, she’s quick to turn away, blushing inexplicably. She tends to develop these mental romantic stories and spout “My my my!” in embarrassment.<br/><br/>Mayumi ThymeFriend and classmate of Rin and Kaede. Half-human and half-demon, her eyes are two different colors.<br/>Full of curiosity, she constantly carries a camera and is quick to get herself involved in even the smallest incidents. Quite lively and fun, she has somewhat of a “loud” personality. Having given up on ever developing breasts, she often makes fun of her own chest size.<br/><br/>Rin TsuchimiHe is a student at Verbana Academy, a school where various races attend. His parents died when he was young and currently lives with his childhood friend, Kaede. Rin is very patient, but hates seeing people suffer. Although his life was always peaceful, the sudden appearance of Lisianthus and Nerine has made him the center of attention in school.<br/><br/><br/><br/><br/>In a certain ancient ruin, two doors were discovered, then accidentally opened. Through these doors were two different worlds: the World of the Gods, and the World of Demons. The three worlds from then on out became interconnected, bringing drastic changes to the human world...<br/><br/>The story takes place in an average town in an average country.<br/>Two different families moved in either side of a boy who was living in peace and quiet. These were the families of the King of the Gods and the King of the Demons, the rulers of their respective worlds. Both of these Kings had moved upon the wishes of their daughters, who had been in love with the boy since they were young. <br/><br/>Years ago, the two girls met the boy only for a moment and neither of them could forget that fateful encounter as they continued to hold him close in their hearts.<br/>Now, with the boy’s friends and roommates and all sorts of other people getting mixed up in their story, they begin their new lives―full of trouble, despair, and maybe a little bit of hope.<br/><br/>“The man who can become either God, Demon, or Human.”<br/>As his friends jokingly call him this, packed with a bit of both sarcasm and envy, the story begins…<br/><br/><br/><ul><li>Total Play Time: 10 to 30 hours<br/></li><li>Seven Character Routes! <br/></li><li>Fully voiced<br/></li><li>Heart-moving story!</li></ul><br/><br/>Today, we have announced that the PS3 version of \"Shuffle!\" will be ported to Steam with an official English localization. This is not the newest title from us, but we are certain that it will provide you with the best experience. We wish the splendid story of Shuffle! will spread throughout the world.<br/>from Navel", "metacritic": null, "released": "2016-11-22", "tba": false, "updated": "2019-08-28T22:11:44", "background_image": "https://media.rawg.io/media/screenshots/936/936ee4d21a81ae21e23b9258ea31998a.jpg", "website": "http://yumehaven.com/", "rating": 0.0, "rating_top": 5, "added_by_status": {"yet": 3, "owned": 29, "beaten": 2, "toplay": 4, "dropped": 2, "playing": 1}, "playtime": 6, "achievements_count": 12, "ratings_count": 6, "suggestions_count": 512, "game_series_count": 0, "reviews_count": 5, "platforms": ["PC"], "developers": ["Navel"], "genres": ["Adventure", "Simulation", "Casual"], "publishers": ["YumeHaven"], "esrb_rating": null}