{"id": 15119, "slug": "andoran-skye-xd", "name": "Andoran Skye XD", "name_original": "Andoran Skye XD", "description": "In Andoran Skye XD you play as Chadrick, a teenage jokester, dragged into a vast new world. Due to a shortage of real warriors, your goal is to tame the entity that harbors itself within the center of your planet. These entities are known as Skyes: youthful beings in dire need of guidance and protection. As you explore the world, you will face many obstacles and, in time, the evil tyrant who is ready to steal control of the Skye before you do. Forget what you know about the traditional turn-based RPG--these intense battles allow you to be in control 100% of the time. Whether you are using Chain Techniques to cut an enemy off or deflecting attacks entirely in real-time, expect to be kept on your toes. In addition to the 2.5D world, the game is packed with comedic dialogue and unexpected outcomes. Every character and situation you come across will change the way you look at hero quests and give you a thrilling sense of change. Experience the hardships, obstacles and refreshing bit of self-awareness in a story you don't want to miss!<br/><br/><br/>Enduring manipulation and forceful submission, Skyes have fallen one by one. Without their life force, the planet slowly deteriorates, and within time, it will cease to exist. Your story begins in the world of Andoran where an evil disturbance is making its way toward your Skye. Only the one who tames the Skye can control it but have no fear, the planet can sense who is worthy. The chosen warrior will come forth and bring balance to the world. It's up to you now! Take on the role of the Staff Wielder and protect your Skye. Ensure the life force never dies down! This is the-- <strong>wait, what!?</strong> What do you mean we don't have any warriors left?<br/><br/><br/><ul><li>Turn-based RPG? It's ALWAYS your turn in Andoran Skye XD if you're fast enough. Take control of each battle 100% of the time.<br/></li><li>The most unique story you will EVER experience filled with twists, turns and one tough bunny.<br/></li><li>Comedic dialogue and colorful characters that are a little too self-aware.<br/></li><li>All new Keepsake items that allow you to boost your stats in battle.<br/></li><li>Two different game modes that allow you to play the game as it appeared in 2013 and now.<br/></li><li>A new approach to your typical RPG: fusion between platformer, realtime strategy and side-scrolling games.</li></ul>", "metacritic": null, "released": "2016-11-25", "tba": false, "updated": "2019-08-28T22:11:44", "background_image": "https://media.rawg.io/media/screenshots/f88/f883c9e516216018e884712b82da2fc0.jpg", "website": "http://www.ChadrickEvans.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 48}, "playtime": 1, "achievements_count": 30, "ratings_count": 1, "suggestions_count": 373, "game_series_count": 0, "reviews_count": 1, "platforms": ["macOS", "PC"], "developers": ["Chadrick Evans"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["OMAG"], "esrb_rating": null}