{"id": 15123, "slug": "tomb-joe", "name": "Tomb Joe", "name_original": "Tomb Joe", "description": "The Sceptre of Gods - a primeval symbol of power wielded only by the greatest leaders of the most dominant ancient civilizations in Central America. Legends state that whoever possessed the artifact would be granted divine wisdom and eternal life. Scolars even claim that without it, the Aztec Empire would have never came to flourish. <br/>\r\nWhile most academics considered it to be a myth, a world famous archeologist Tomb Jack recognized there could be some authenticity to the story. After years of research, shrouded in secrecy, he led an expedition to prove the artifact's existance and bring it back to the civilized world. He was able to discover an ancient crypt which led him and his companions to a place none of them could have imagined, even in their wildest dreams. Unfortunately, after many months, none of them returned and soon, all were proclaimed dead. <br/>\r\nYears later, Tomb Joe, renowned archelogist and a fearless adventurer recieved a mysterious letter adressed to his long lost father. It only contained two things - an ancient map and a golden medallion engraved with the symbol of the Sceptre. While the medallion piqued his interest, it was the map that made him act. For the first time, he learned the destination of his father's expedition. There was no time to waste. Not an hour later, Joe was already on his way to Central America... <br/>\n<br/>\r\nEmbark on a journey to unravel the mystery of the Sceptre of Gods and Tomb Joe's father's disappearance. Armed only with his sharp wit and his trusty whip, Joe will have to face deadly traps, dangerous wildlife, and the best soldiers of the Reich to reach his goal and bring fame to his father's name once again. If he allows the Sceptre to fall into the wrong hands, whole humanity could be doomed. Travel through exotic environments, explore long forgotten tombs, fight or sneak your way past vicious enemies, solve puzzles and try to discover the secret behind the mysterious artifact in this thrilling action-adventure parody platformer.", "metacritic": null, "released": "2017-02-20", "tba": false, "updated": "2023-07-29T14:52:59", "background_image": "https://media.rawg.io/media/screenshots/0ec/0eccdd980cdef675602c2f470bb35dab.jpg", "website": "https://amaterasusoftware.com/", "rating": 1.67, "rating_top": 1, "added_by_status": {"yet": 5, "owned": 194, "beaten": 1}, "playtime": 3, "achievements_count": 3, "ratings_count": 6, "suggestions_count": 31, "game_series_count": 0, "reviews_count": 6, "platforms": ["PC"], "developers": ["Amaterasu Software"], "genres": ["Action", "Adventure", "Casual", "Indie"], "publishers": ["Amaterasu Software"], "esrb_rating": null}