{"id": 151327, "slug": "iced-a-one-street-adventure", "name": "ICED - A One Street Adventure", "name_original": "ICED - A One Street Adventure", "description": "<p><strong><em>ICED - A ONE STREET ADVENTURE</em></strong><br/>--------------------------------------------------------</p>\n<p>You have one goal. Walk down the street to the ice cream parlor. This should be simple. Should being the key word here. Somehow, someone is dumping loads of heavy things that are completely willing to bonk you on the head and stop you in your tracks. The other issue is that the doors aren't always open. Simply use the arrow keys to navigate left and right as you make your way down the road, and enter the building while the doors are open. The more obstacles you dodge while making your way, the more points you earn. Look out for items that reward you with extra score. Try and beat your best scores.<br/>--------------------------------------------------------<br/>This game in entirely free-to-play. There are no ads, and there are no micro-transactions. There isn't even an intrusive popup asking you to rate the game. All I ask is that if you liked what you played, is to simply tell a friend about this game.<strong><em>UPDATES:<br/></em></strong></p>\n<p><em><strong>8/15/18</strong> -</em> Tweaks to make the new instructions screens more easily read. Also a minor bugfix that'll eventually come to the mobile version.</p>\n<p><strong><em>8/13/18 -</em></strong>Massive update to UI to make the game keyboard controlled only again, parity with the mobile version.<strong><em><br/>5/30/18 -</em> </strong>Removed the leftover down button from the mobile version. I apologize for missing something so obvious.</p>", "metacritic": null, "released": "2018-05-29", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/ed2/ed248b1bf61b1730b695460ca8271904.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 86, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["THE SCSI POSM"], "genres": ["Action"], "publishers": [], "esrb_rating": null}