{"id": 151421, "slug": "escape-to-the-stars", "name": "Escape To The Stars", "name_original": "Escape To The Stars", "description": "<p>==========</p><p>When you live on such a small planet, you'd want to leave to see what the universe has to offer. Repair your spacecraft and reach the stars!</p><p>==========</p><p>How to Play:</p><p>Movement<br/>Left and right arrow keys<br/>Tap on the bottom left and bottom right of the screen</p><p>Attack<br/>Up or down arrow keys<br/>Tap on the player</p><p>- Shooting takes up energy, but recharges slowly<br/>- Kill enemies to pick up their loot!<br/>- Items that you obtained can be used<br/>    &gt; Slime cores heal 1 HP<br/>    &gt; Lightning gems recover up to 3 energy<br/>    &gt; Spore dust turns you invulnerable for 3 seconds<br/>- Talk to NPCs and give them materials to craft better items!<br/>    &gt; Red potions heal you to 7/5 health<br/>    &gt; Batteries boost your energy to 10/3<br/>    &gt; Blue potions turn you into a speedy ghost for 10 seconds<br/>- Deposit your items at the ship to repair it and progress through the game!<br/><br/>========</p><p>This game was made as an entry for Ludum Dare 38. The game was completed on time, but in a rather un-fun state. Updates soon to follow for polishing!<br/><br/>This game is mobile friendly!</p><p>Programs used:<br/>- Game Maker Studio<br/>- GraphicsGale<br/>- bfxr.net<br/>- GXSCC<br/>- Audacity<br/>- www.fakemusicgenerator.com</p><p>========</p><p>Changelog:</p><p>Update 1</p><p>- Enemy animations updated to properly reflect which way they're facing<br/>- Enemies given new AI<br/>    &gt; Slimes now jump periodically<br/>    &gt; Mush now dig underground and can be safely walked over.<br/>    &gt; Robots now randomly patrol and change directions. Amazing.<br/>- Added item functionality for the base materials (Slime cores, lightning gems, spore dust)<br/>- Crafted items buffed<br/>    &gt; Red potions heal you fully instead of only giving 1 HP<br/>    &gt; Batteries now give 20 energy instead of refilling your energy to 10<br/>    &gt; Blue potions also make you invulnerable in addition to making you fast<br/>- Fixed timer not working<br/>- You can now talk to NPCs while in your inventory menu<br/>- NPCs now only require 3 materials instead of 5<br/>- The ship now takes only what it needs, not clearing your inventory.<br/>- The ship now only requires 10 of each material for the first phase, and 3 of each crafted item in the second phase.<br/>- Map is now randomly generated<br/>- Added missing sound effects</p><p>Update 2</p><p>- Enemy AI slightly altered<br/>&gt; Slimes jump at constant, shorter intervals<br/>&gt; Robots now move in one direction, and can go into a defensive mode. Bullets don't damage it, but you can walk through it. Will defend itself when shot.<br/>- Max energy lowered to 3, but recharge rate increased<br/>- Spore dust now makes you invulnerable for 3 seconds<br/>- Crafted items changed<br/>&gt; Red potions heal you up to 7 HP<br/>&gt; Blue potions restores your energy to 10<br/>- Enemy spawning rate increased<br/>- Enemies will now spawn in a way to avoid hitting the player on spawn<br/>- Enemy and player hitboxes lowered to make it easier to avoid getting hit<br/>- Bullet is now faster<br/>- NPCs now take enough materials from your inventory at one go to make a full item, if possible.<br/>- Small graphical fixes</p><p>Update 3<br/></p><p>- Added splash screen, starting menu, proper lose and win feedback, and a help screen<br/>- Minor graphical fixes, like slimes jumping in front of the UI</p><p>=======</p>", "metacritic": null, "released": "2017-04-24", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/22a/22a7fe2466a0df08fdb372cb14e2eee0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 99, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["JunoStriker"], "genres": ["Action"], "publishers": [], "esrb_rating": null}