{"id": 151413, "slug": "a-hopeful-end", "name": "A Hopeful End", "name_original": "A Hopeful End", "description": "<p><strong>A Hopeful End (AHE) </strong>is a Serious Pedagogical Game that puts the player in the shoes of a Grand-Father &amp; Grand-Daughter family from Syria: Samir Al-Saeed and Fatima Al-Saeed.  The game starts in the war-torn village of Al-Kalaseh. </p>\n<p>The player then, needs to help Samir and Fatima flee from an oppressive regime, trough the perils of War in order to deliver them safely, trough desert and sea, to a refugee camp in the coast of Italy.</p>\n<p>It’s pedagogical objective is to attempt to teach children in a lighthearted and engaging way (appealing to compassion and empathy), that refugees from the middle-east are equal to us.</p>\n<p>I want the target audience to leave the play-session enriched with the idea, that multiculturalism can complement our society for the best and contributes positively towards a better future.</p>\n<p><strong>AHE</strong> inserts itself in any scenario that has children supervised by adults. </p>\n<p>Although the game is not violent it is best used as a pedagogical tool with an adult supervising the child of the target audience, so the more complex topics can be explained to the child, and the more controversial aspects can be seen trough the eyes of the child. In order to create a healthy discussion, hopefully compelling a more prejudiced adult to reflect on its cultural bias gained trough a lifetime of misinformation. </p>\n<p>At the end of the Play-session they both learn from the experience.</p>", "metacritic": null, "released": "2018-07-09", "tba": false, "updated": "2019-08-28T23:22:08", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Fernando Soares"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}