{"id": 1515, "slug": "panzer-corps", "name": "Panzer Corps", "name_original": "Panzer Corps", "description": "<strong>Classic gameplay. New experience.</strong><br/>Panzer Corps Wehrmacht is the award-winning turn-based strategy game that the press has called “…nothing short of brilliant” and “the spiritual successor to the Panzer General series”, with high rankings and praise around the world. Brought to fruition by a team of experts and a community of hundreds of fans, Panzer Corps - Wehrmacht has evolved into the ultimate strategy classic that will find a home on any wargamer’s shelf! <br/><br/>Set in World War II, Panzer Corps - Wehrmacht puts players in the general’s tent in charge of the Axis armies, across 26 scenarios in one large campaign tree, carrying core forces through the war. This core force can gain experience and upgrade to new weaponry as it becomes available. With over 800 unit types, divided into 20 unit classes there is a huge amount to explore. Make use of your unit’s strengths and your enemy’s weaknesses and seize victory. <br/><br/>Looking for a more ‘human’ challenge? Panzer Corps’ multiplayer is deservedly popular, with thousands of games running on the server at any given time. Find an opponent online quickly and easily throughout the world with Slitherine’s award-winning PBEM++ asynchronous multiplayer system. Play historical battles or balanced scenarios created specifically for multiplayer, where both sides have equal chances to win. Panzer Corps supports cross platform multiplayer, so you can even battle owners of the iPad version of the game!<br/><br/>Developed by Flashback Games and The Lordz Games Studio, Panzer Corps - Wehrmacht replicates a classic wargame and upgrades it to 21st century standards for a new generation of wargamers. <br/><br/><br/><strong>Main Features</strong><br/>• 800 unit types, divided into 20 unit classes with 20 detailed parameters to identify unit’s abilities, 24 terrain types affecting gameplay in various ways. Panzer Corps will celebrate the glory days of strategy gaming with the aim of attracting new players to the genre; <br/>• Campaign: all 26 scenarios are combined into a large campaign tree with several entry points at various stages of the war. Depending on the outcome of each battle (decisive victory, marginal victory or defeat), the player will be faced with different challenges and a progress along different parts of the campaign tree; <br/>• More than 30 nations represented in the game: Germany, Italy, Poland, France, Great Britain, USA, USSR, Norway, Belgium, Netherlands, Albania, Romania, Greece and more. <br/>• Core units that travel with you throughout the campaign gaining experience and that can be upgraded as new weapon technologies become available. <br/><br/><br/><strong>Additional content </strong><br/>For players who enjoy the game, there is a lot of quality content which will keep them busy for months. <br/><br/>The Grand Campaign consists of 10 campaigns that bolt together to create a staggering 150 scenario Grand Campaign which cover the entire war from 1939 to 1945 in great detail. You can play them all linked together or each as a standalone campaign. <br/><br/>The Afrika Korps expansion consists of 24 scenarios, new terrain and units and explores Rommel’s North Africa campaign. <br/><br/>Panzer Corps: Allied Corps is an expansion for Panzer Corps. Allied Corps includes more than 25 new scenarios, over 50 new regular and special elite units, and modified version of existing units to cover the entire war in detail from the Western Allies perspective.  <br/><br/>And if this is not enough, Panzer Corps comes with a bunch of modding options and a powerful editor (PC only), and there are dozens of free user-made campaigns readily available for download from the Internet. <br/><br/>All Panzer Corps content is also available on iPad, so this strategy gem can be played everywhere! <br/><br/><strong>Reviews</strong><br/>96% - GamersHall.de <br/>Panzer Corps is a solid and loving overhaul of the classic Panzer General. Technical implementation and graphic design leave little room for any criticism. <br/><br/>93% - GamerTell.com <br/>Easy to learn, simple interface, hard to stop playing once you start, you don't have to be a serious wargamer to appreciate. <br/><br/>9/10 - CPU Gamer <br/>When it comes to being Panzer General, Panzer Corps beats the pants off the competition. <br/><br/>90% - Armchair General <br/>Overall, PanzerCorps is one of the best “beer and pretzels” turn based wargame releases in years. The game is very polished and stable. It is fun to play. <br/><br/>90% - PelipPlaneeta.net <br/>...nothing short of brilliant. <br/><br/>9/10 - RTSguru <br/>This was seriously one of the best games that we have ever played. If you do not pick this up, you are missing out. <br/><br/>9/10 - Onet.pl <br/>If one asked how would Panzer General be like if it was released today? The answer is simple - it would be Panzer Corps. <br/><br/>9/10 - EntDepot <br/>Panzer Corps has me dreaming in hexagons nowadays. <br/><br/>A- - GameShark.com <br/>Now that the official review is complete, if this were any other game it would go on the shelf next to other games that have been “finished” but I have every intention of firing it up again.ລ", "metacritic": 80, "released": "2010-07-09", "tba": false, "updated": "2023-04-10T16:31:28", "background_image": "https://media.rawg.io/media/screenshots/bcb/bcbd5c48672981716878cf419cbf3f96.jpeg", "website": "http://slitherine.com/products/product.asp?gid=399", "rating": 3.74, "rating_top": 5, "added_by_status": {"yet": 16, "owned": 343, "beaten": 5, "toplay": 3, "dropped": 4, "playing": 1}, "playtime": 2, "achievements_count": 80, "ratings_count": 23, "suggestions_count": 465, "game_series_count": 0, "reviews_count": 23, "platforms": ["PC", "iOS", "macOS"], "developers": ["Slitherine Software", "Flashback Games", "The Lordz Games Studio"], "genres": ["Strategy", "Board Games", "Educational"], "publishers": ["Slitherine"], "esrb_rating": null}