{"id": 151664, "slug": "gates-of-the-cryptocoils", "name": "Gates of the Cryptocoils", "name_original": "Gates of the Cryptocoils", "description": "<p>The Gates, Structures left all over the universe by an ancient race of beings known as the Creators. With the power to link any two places in the universe through hyperspace no life is left untouched by their influence. Connecting different races and technologies the Gates have brought commerce, cultural exchange and, of course, war. Some cursed the Creators for plugging their lives into the intergalactic turmoil, while other worshiped their advanced technology which no one has yet to decipher. The prayers of the universe were seemingly answered 100 years ago when a race of completely robotic being known as the Cryptocoils emerged from the Gates far away from civilization. They claimed to be intelligent lifeforms not only designed by the Creators but operated by one of them through a shared consciousness. The technology the Cryptocoil's possessed matched that of Creator relics so they were allowed to take power. War subsided and trade exploded. However, the Cryptocoils began imposing strict restrictions on all transport between the Gates, snuffing out popular trade routes. Some believed this to be the rightful will of the Creators, and the others dared not start a war for fear of resistance among the masses. Now, a company known as HG has come forward and said they know the location of the Cryptocoil's supposed controller. They're raising a small rebellious force in the hopes of making their way to this location, destroying the controller, and thus incapacitating the Cryptocoil's army. You are their commander.</p><p><strong>Gates of the Cryptocoils is a turn-based strategy roguelike with simplistic movement and combat. Much like chess, each ship has its own unique movement pattern. Each enemies also has a unique movement and firing pattern. You'll have to manage your ships carefully as they only can kill a single Cryptocoil per encounter. This means if you want to destroy all the enemies you'll need to recruit as many ships as possible. </strong></p><p><strong>However, each additional ship costs you maximum energy and therefore limits your movement options. If you want to avoid the Cryptocoils and speed towards the exit, you'll need to sacrifice a few ships along the way to lower your energy usage. I don't think your ships will like that solution, though. </strong></p><p>Each run of the game gives you random ships who all have their own stories to tell. Slowly unlock the plot as you play through multiple times and reach the boss with characters who might know a thing or two about why the Cryptocoils are here. </p>", "metacritic": null, "released": "2017-12-08", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/5a1/5a17f0d7404283438180dac7eca5a5f2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 157, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ChristopherPoole"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}