{"id": 151639, "slug": "colorise-challenge", "name": "ColoRise Challenge", "name_original": "ColoRise Challenge", "description": "<p>\r\n\tOur game came from a concept depicted in Rick and Morty. This \r\n\tclip in particular.\r\n</p><p>\r\n\t Do you enjoy creative twists on games? Do you like challenging games that make you feel incredible when you finally beat them?\r\n</p><p>\n<strong>COLORISE CHALLENGE</strong> is a platform jumper with a very colorful twist: not only do you have to move your character to land on top of platforms to keep <strong>RISING</strong>, you also have to pay attention to the <strong>COLOR</strong> of the platform and <strong>CHANGE</strong> your own color to <strong>MATCH</strong> the platform, or you will fall right through it!\r\n</p><p>\r\n\t Collect \r\n\t<strong>COLOR DROPS</strong> to use as coins and unlock different <strong>CHARACTERS</strong>. Try the 22 designed <strong>STAGES</strong> (2 worlds with 11 stages each) with a <strong>BOSS FIGHT</strong> at the end of each world, or play in one of the 3 difficulty options in <strong>ENDLESS MODE</strong>.\r\n</p>HOW TO PLAY<br/><p>You can try the <strong>TUTORIAL</strong> in-game... but here are the basics.</p><ul><li>To control you character, <strong>TILT</strong> your device.</li></ul><ul><li>To change the color of your character, <strong>PRESS ANYWHERE</strong> on top of each color button at the bottom of the screen (Blue, Red and Yellow). Think of it as three invisible columns that reach the top of the screen. Press wherever you feel more comfortable. You can <strong>KEEP PRESSING</strong> to maintain the color.</li></ul><ul><li>The twist is, sometimes the platforms won't be <strong>BLUE</strong>, <strong>RED</strong> or <strong>YELLOW</strong>. When that happens, you have to <strong>MIX COLORS</strong> to form the correct one. </li></ul><ul><li> There's only 3 possible combinations to keep in mind:</li></ul><p><strong> RED + BLUE = PURPLE<br/></strong></p><p><strong><strong> RED + YELLOW = ORANGE </strong><br/></strong></p><p><strong> YELLOW + BLUE = GREEN </strong></p><ul><li>Finally, if you change your color <strong>JUST BEFORE LANDING</strong> on the platform, you will perform a <strong>COLOR BOOST</strong>, reaching higher!</li></ul><ul><li>Watch out for different kinds of platforms: <strong>MOVING</strong>, <strong>FALLING</strong> and <strong>CHANGING COLOR</strong> when you bounce on them. If you encounter a colored <strong>WALL</strong>, by similar logic as the platforms, you have to be the <strong>SAME COLOR</strong> to pass through it </li></ul>", "metacritic": null, "released": "2017-01-26", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/ae3/ae3323cc30fad6562daea3a5cb64175f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 22, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Frisson Games"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}