{"id": 151656, "slug": "vivarium-aergia", "name": "Vivarium (Aergia)", "name_original": "Vivarium (Aergia)", "description": "<p>Prototype framework for making procedurally generated stylized plants. Part of the PROCJAM 2017.</p>\n<p>Click to generate new trees. That's it.<br/></p>\n<p>This is the first steps towards a (hopefully) ongoing project of making tiny procedurally generated gardens or terrariums. Instead of focusing on making something that is realistic or fully procedurally generated I wanted something that could create plants (or other things) in a recognizable stylized way from a simple set of rules and shapes. The scene above was an attempt to recreate the trees from this short scene from the movie Coraline:</p><p>It's basically just stringing a few simple Bezier curves together and generating a cylinder mesh along those paths. (The leaves are just flat, colored planes here). There's quite a bit more going on under the hood than shown here, so I hope to add more scenes soon. Maybe start a devlog.<br/></p><p>The core of the generator is a combination of what I learned from two different tutorials: <br/></p><ul><li>Curves and Splines, Catlike Coding</li><li>Modelling by numbers, Jayelinda Suridge</li></ul><p>After watching the great introduction to grammar systems by Rachel Hwang in this years procjam talks I'm thinking that might be a logical next step. In addition I'm hoping to add more stuff over time:</p><ul><li>Custom shaders for colors and textures to be generated from the ground up and reacting on the space around them.<ul><li>Vertex shaders for animating wind and other movement.</li></ul></li><li>Animating growth/generation</li><li>Some sort of simple voxel based 'aether' system to give plants more awareness of their surroundings and affecting them. </li></ul>", "metacritic": null, "released": "2017-11-13", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/7f2/7f253fa7c81aa1664a2e1ecf1917c819.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 16, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Aergia"], "genres": [], "publishers": [], "esrb_rating": null}