{"id": 151941, "slug": "survive-the-walls", "name": "Survive The Walls", "name_original": "Survive The Walls", "description": "<p>I thought that I would just mention that I am a 3rd year software engineering student with a passion for game development. I am very new to the Unity game engine as well as to the process of developing games. Everyone has to start somewhere in life and I thought this may be that time for me to start. If you enjoy the title please let me know as well as anything you would like to see moving forward and any constructive criticism is welcomed. </p><p>Also feel free to check out my other project: Fruit Slicer (HTC Vive)</p><p><strong>Current Version and release notes (The two most recent notes will be shown here):</strong></p><ul><li>Version: Pre-Alpha 1.7 (Windows)</li><ul><li>Added a new level </li><li>Added a basic how to play page</li><li>Rewrote the player movement logic as well as the Wall logic. The newest level utilizes them. The next release will have all previous levels updated to the new logic. (The rewrite was simply done as I have learned a lot over the last couple of weeks which allowed me to modularise my logic which will allow for quicker and easier level additions in the future)  </li></ul></ul><ul><li>Version: Pre-Alpha 1.65 (Windows)<ul><li>Fixed a Xbox 360 controller bug where the RB, LB, A, and  B  buttons would remain active even when the controller is not enabled.</li></ul></li><li>Version: Pre-Alpha 1.65 (Mac)<ul><li>Fixed Xbox 360 controller Support </li></ul><ul><li>Fixed a Xbox 360 controller bug where the RB, LB, A, and B buttons would remain active even when the controller is not enabled.</li><li>In order to use a xbox 360 controller on a mac you must first install a driver for it (I used the one that can be found here: https://github.com/360Controller/360Controller/rel...</li></ul></li></ul>", "metacritic": null, "released": "2016-08-17", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/ba6/ba60de837b71de7ee7da1a1599806795.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 45, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["ModdoStudio"], "genres": [], "publishers": [], "esrb_rating": null}