{"id": 15191, "slug": "babel-tower-to-the-gods", "name": "Babel: Tower to the Gods", "name_original": "Babel: Tower to the Gods", "description": "<strong>What Is Babel: tower to the Gods?</strong>It's a charming physics based puzzle game designed around room-scale VR for the HTC Vive, which will test your coordination and wits, as you battle physics while working out how to de-construct part of a tower (to the gods).<br/><br/>You'll have to approach the towers from every angle walk, crouch, and even possibly jump, using a range of divine tools &amp; weaponry to carefully disassemble &amp; thoroughly check the stability of each unique and bizarre monument built before you, all while protecting the sacred totem, to ensure it's safety for it's worshippers!<br/><br/>There's a variety of different types of puzzles in it, requiring a range of different skills - precision, logic, speed &amp; more!<br/>Examples:<br/><ul><li><strong>Precision </strong>- Using careful movements of your Vive controllers, slide a sword between blocks and push out blocks whilst narrowly avoiding the volatile and explosive bomb blocks, which will detonate with the slightest of your touch!<br/></li><li><strong>Logic </strong>- Work out the correct order &amp; method of deconstruction! Knock out blocks simultaneously to keep the tower balance! Or, is there a large amount of blocks ontop of a slippery ice block? Give it a fast &amp; hard whack from the side to sent it quickly sliding out of the tower without the blocks ontop falling off!<br/></li><li><strong>Speed </strong>- Some towers may contain blocks that are being burnt away! Once these blocks finish burning, they'll be reduced to ash &amp; disappear! Solve the tower fast enough that these burning blocks don't cause it to topple!</li></ul><br/>We'll be adding more block types, features &amp; even new game-modes in the future! So an eye on those change logs to see what's new!", "metacritic": null, "released": "2016-04-05", "tba": false, "updated": "2019-08-28T22:11:42", "background_image": "https://media.rawg.io/media/screenshots/5b5/5b5f144674e52a3a6a54bb68477ecdca.jpg", "website": "http://www.ruce.uk", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3}, "playtime": 1, "achievements_count": 10, "ratings_count": 0, "suggestions_count": 161, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ruce"], "genres": ["Indie"], "publishers": ["Ruce"], "esrb_rating": null}