{"id": 151946, "slug": "ludum-party", "name": "Ludum Party", "name_original": "Ludum Party", "description": "<p><em>Ludum Party!</em> is a game I created for Ludum Dare 34 where the theme was a tie between <em>Two Button Controls</em> and <em>Growing</em>. It was created with:</p><ul><li>snow</li><li>tusk (an engine I've been working on which rests atop snow)</li><li>PyxelEdit</li><li>Photoshop</li><li>Bosca Ceoil</li><li>Bfxr</li><li>Audacity</li><li>Sublime Text 3</li></ul>in the space of [less than] 48 hours in December of 2015. This time, I was able to come up with a lot of ideas, but none of them seemed to really stand out or be feasible in the short timeframe. Eventually, I ended up at a Warioware type game, aiming only for the <em>Two Button Controls</em> theme.<p>Thankfully, I was able to keep the games relatively simple and managed to knock out 4 complete minigames in the weekend! As a result, I did pretty well in the scoring, receiving a #53 in fun overall!</p>Mini Post-Mortem<p>I've been meaning to start doing post-mortems for my games, so here's a short one that I put up rather late.</p>What Went Wrong<ul><li>Using My Not-Ready-Yet-Homegrown-Game-Engine: in the weeks before this LD, I had been working on a personal game engine, built on top of snow (similar to how Luxe is built on top of snow). The engine is far from ready, and isn't anywhere near being \"battletested\", so working with it got a little kludgey at times, and I think started to complicate things a bit.</li><li>Making Space Invaders Instead of Something More Unique: the Space Invaders minigame was the last game I started and worked on, a few hours before the deadline. I had several ideas to try to make into short little games, but ended up with Space Invaders because it was so simple I would be able to bang it out in a couple of hours. I was able to do this, but I think this was by far the most boring game and I probably should have at least tried for something more interesting.</li><li>AI Difficulty: I tried to make the AI neither too difficult nor too boring, and spent a fair amount of time testing it. Unfortunately, I tested only against myself (the architect of it all), and I think I got rather skilled at the games I was making (no surprise!). When I finished with the AIs I was rather proud that I thought I had found that balance, but one of the most common criticisms of the game was that the AI was too difficult. I probably should have tested with more people, and/or included some sort of AI difficulty setting.</li><li>The Flags in the Sledding Game: I made these to make another obstacle for people; most people tried to drive into them thinking they were powerups instead.</li></ul>What Went Right<ul><li>Using My Not-Ready-Yet-Homegrown-Game-Engine: although the engine is far from finished, it was capable of making this game—telling me that its at least something to continue effort in. I'm a big fan of entity-component systems, and this engine tries to take that to it's furthest, with entities being composed purely of data, and the game providing a series of processors to operate on that data. It's a little bit awkward how it is now, but I think with a bit of re-tooling (utilizing a lot of experience from building this game), it could be really elegant, powerful, and easy to use. Right now, it's mostly just powerful and moderately difficult to use.</li><li>Time Management: despite working with the new engine (and having to fix some things in the engine as I was going), I was able to build 4 minigames, each complete with their own graphics, sound, and gameplay (simple as they were). I even managed to be \"finished\" a full 45 minutes before the submission deadline! I could have maybe used this time to polish a smidgeon, but I was pretty burnt out and happy to just submit, go make dinner, and come back in time to start playing other people's games.</li><li>AI / Computer Player: A party game would be horribly boring without other people to play with. Unfortunately, almost all Ludum Dare participants are going to be playing games solo (as they developed solo, at least for the compo). Thus, an AI to play against is certainly</li><li>[Some of] the Graphics: I'm generally pretty horrible at art. I'm actually better much at 3D art than pixel art, and one of these days I'm going to migrate to making these prototypes in 3D; for now however the rest of the game development side is easier if I stick to 2D art. That said, this time around I was VERY happy with the aesthetics of the coloured backgrounds for the the trivia game, and the animations for the scarfs flapping in the wind and the ship explosions.</li><li>Music: I managed to create unique music for each of the minigames that didn't sound horribly terrible like most of my previous attempts. The music isn't amazing, and can definitely get annoying if you listen to it for too long, but overall I'm quite happy with how it turned out.</li></ul>", "metacritic": null, "released": "2017-03-17", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/627/62754722485b0cd8bbe8b37992d6fa77.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 52, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["BlazingMammothGames"], "genres": [], "publishers": [], "esrb_rating": null}