{"id": 15203, "slug": "pixelman", "name": "PIXELMAN", "name_original": "PIXELMAN", "description": "<strong>PIXELMAN</strong> is a retro styled action-filled, endless-flyer, high-score chaser, where you control the title character in his mission to rescue the citizens of Pixville from the evil Baron Von Pixel and his contraptions.<br/>In <strong>PIXELMAN</strong> you need to keep your combos going to be able to make it into the online leaderboards!<br/><br/>The citizens of Pixville are counting on you!How to PlayControlling <strong>PIXELMAN</strong> is very simple: you press and hold to go up, release to go down, and you can also use the pad to move faster (but with less accuracy!) Your goal is to rescue the citizens (humans and their pets!) to keep your heroic energy up, and also avoid crashing into buildings, traffic, and Von Pixel’s weapons and traps. <br/>If you don’t rescue anyone for a while, your heroic energy will go down; and if it reaches zero, you´ll lose your powers and fall! <br/><br/>XBox 360 Controllers, Mouse and Keyboards supported (We truly recommend the controller).<br/>CombosEvery time you rescue a Pixelian, your combo meter will go up. Once you’ve rescued 5 in a row, your score will start to multiply! BUT, if you fail to rescue a single soul, you meter will deplete, and you’ll have to start all over again. Keep the combos going for maximum high-scorage!<br/>Power UpsFrom time to time, you’ll come across a present box. If you grab it, you’ll activate the power up mode! In this mode, your score and combo meter multiply, your speed goes up, and you can’t get hurt! The bad thing is, it only lasts for one hit, so you better watch out! <br/>PIXELMANHe’s Pixville’s senior superhero, his superpowers are flying and untying knots really fast. He also loves podiums! His main weaknesses are buildings, bombs, lasers and missiles… nothing that a good power up can’t fix! <br/>PIXELGIRLShe’s Pixville’s new superhero! She’s pretty much like <strong>PIXELMAN</strong>, but faster and cooler! Once you learn her quirks, she’ll start racking up points like nothing! <br/>Baron Von PixelPIXELMAN’s main antagonist is a mustache twirling villain who hates everyone in Pixville. He managed to buy a few rusty WWI weapons on Craigslist, and he’s not afraid to use them! His main hobby is to tie people up and leave them on top of buildings, trees and cars. Only <strong>PIXELMAN</strong> can stop his devious schemes! <br/>PodiumsWhat’s a superhero without a podium to stand on? In <strong>PIXELMAN</strong> you start on top of a sad soapbox, but to show their gratitude after being rescued, the Pixelians will start building new podiums for you! Can you unlock them all? Are you the hero Pixville needs? Or the hero Pixville deserves? How much wood would a woodchuck chuck if a woodchuck could chuck wood? <br/>Online LeaderboardsThe game doesn’t have an ending. You can play until your eyes bleed or the speed goes so far up that you can’t control your hero anymore! The goal of the game is to make it to the online leaderboards. And in order to achieve that, you need to maintain your combos going. If you have a high combo and you manage to get a power up, you can make over 1000 points for just one rescue! <br/>AchievementsCan you slalom between 50 rockets? Can you survive over 5 minutes in one gameplay? Can you reach over NINE THOUSAND!!!™ points in one game? If the answer is YES, this is the game for you! We have 20 achievements ready for the hardcore <strong>PIXELMAN</strong> players to show their skills! <br/>Trading Cards, Badges, Profile Backgrounds and Emoticons<strong>PIXELMAN</strong> fully supports all Steam features, you're going to love our Pixelart emoticons!<br/><br/><br/><strong>PIXELMAN</strong> Features:<br/><br/><ul><li>State-of-the-art graphics! (by 1987 standards)<br/></li><li>Catchy music! (that you can turn off, just in case)<br/></li><li>Incredible cape physics!<br/></li><li>Awesome pixel explosions!<br/></li><li>Mesmerizing animated light shows!<br/></li><li>LASERS!<br/></li><li>PLANES!<br/></li><li>TANKS!<br/></li><li>ROCKETS!<br/></li><li>BOMBS!<br/></li><li>DOGS!<br/></li><li>CATS!</li></ul>", "metacritic": null, "released": "2016-02-23", "tba": false, "updated": "2024-01-20T13:26:31", "background_image": "https://media.rawg.io/media/screenshots/310/310c9fd05a2c81a7421ecc4064d55c75.jpg", "website": "http://www.kindermanncorp.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 115, "beaten": 1, "toplay": 1}, "playtime": 3, "achievements_count": 28, "ratings_count": 2, "suggestions_count": 231, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Kindermann"], "genres": ["Action", "Casual", "Indie"], "publishers": ["Kindermann"], "esrb_rating": null}