{"id": 152039, "slug": "puppies-out", "name": "Puppies Out", "name_original": "Puppies Out", "description": "<p>Puppies Out! The Cutest, Fun and Original Free 3D Endless Runner games!<br/><br/>Attention all fun and puppy lovers out there!<br/><br/>Puppies Out! is a free Running games for kids featuring lovely cute pets – named “Buddy Lab” – alongside with some of its adorable puppy friends including “Amigo“, “Rocky“, “Sir Beagle“, “Posh Pup” , “Super Hero“, “Bandit” and “Valentine“. <br/><br/>They live in a happy, fantasy dog world where running is the key to success! Tough obstacles and challenges await them, but the puppies are ready for it! <br/><br/>Explore 3d Infinite Runner Game Great Features:<br/><br/>•\tExplore Fun-Tasy Puppy Worlds!<br/>•\tEnjoy Gorgeous Graphics while collecting life-saving Silver Bones.<br/>•\t23 cute and legendary puppies as playable characters to choose from !<br/>•\tPersonalize and style your pet game and collect amazing Paw-Ur-Ups!<br/>•\tPuppies include Labrador, Beagle, Bulldog, Husky and Doge.<br/>•\tRun through a colorful, lively 3D landscape.<br/>•\tGet rewarded with Lives as you win or via sharing the App on social media.<br/>•\tUpgrades available as you play: Shields, Mystery Boxes, Magnetic Collars, Frisbee and Jet Packs.<br/>•\tIncrease mission levels and difficulty: run and slide through residential areas, garden areas, bridges, construction areas and parks.<br/>•\tShare the fun of 3D Infinite Runner on Facebook and on Game center Services.<br/><br/>This top exciting dogs games for kids, girls, and adults just need you to bring them to life.<br/><br/>In this new, free play and best puppy game every level is an adventure and every mission is a discovery. Make sure you win and never stop running! <br/><br/>Let the puppies out in this pets game! &amp; start playing! Make the most of the running, racing, jumping and chasing! In this lovely kids game Puppy Dog does it all!</p>", "metacritic": null, "released": "2017-10-30", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/d65/d65f3067df1fa1c438a22243bfbd97f7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 74, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["zatun"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}