{"id": 15226, "slug": "nanobots", "name": "Nanobots", "name_original": "Nanobots", "description": "Nanobots is a fast-paced casual game about destroying self-replicating nanotechnology robots. <br/><br/>You have to reduce the standing population to zero in order to advance to the next level, as even one overlooked Nanobot can replicate itself and bring you back to square one in a matter of seconds.Lore<br/>The world was devastated by a dreadful war against intelligent machines. You are a survivor, and your greatest skill is to hack into machine cores and destroy them. But something unexpected happens. A sentient software named ADNA trespasses your local security, only to ask for your help.<br/><br/>Your mission is to exploit a newly discovered vulnerability. Machines use Nanobots (nanotechnology self-replicating robots) to repair themselves and keep their temperature low. By destroying them, a chain reaction causes entire systems to halt, even before they can identify the cause of the failure. It is your greatest chance to end the war.<br/><br/>Are you up to this task? Can you move fast enough without sacrificing precision and strategic decisions? If so, the world needs you!Gameplay<br/>Your main ability is a small Magnetic Pulse that instantly destroys closeby Nanobots. Move the cursor as fast and precise as you can to obliterate all on its path.<br/><br/>Secondary abilities are: <br/><br/>- Static Charge (right click): Disrupts a small area with a permanent electric field that prevents Nanobots from replicating. <br/>- Electric Surge (alphanumeric 1): Increases the area of effect of Magnetic Pulse (your main ability) for a few seconds. <br/>- Malware (alphanumeric 2): Injects a malicious code that causes every newly replicated Nanobot to be destroyed after a few cycles.<br/>- Discharge (alphanumeric 3): Drains the energy from nearby power plants, causing all cycles to be delayed.<br/>- Prismatic Beam (alphanumeric 4): Places a vertical and horizontal high-energy stream that divides the area temporarily.<br/><br/>There are <strong>60 levels</strong> available!Controls<br/>- Move the camera: WASD, Arrow Keys or middle click and drag <br/>- Zoom in/out: Mouse Wheel or Q/Z <br/>- Abilities: Mouse left and right, and alphanumeric keys <br/><br/>All keys can be remapped.<br/><br/>Music by: Mark Sparling - www.marksparling.com", "metacritic": null, "released": "2016-03-15", "tba": false, "updated": "2019-08-28T22:11:41", "background_image": "https://media.rawg.io/media/screenshots/773/7738e2216e1ef87e139b03e4ab537baf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 28}, "playtime": 4, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 142, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Diego Rodrigues"], "genres": ["Action", "Strategy", "Casual", "Indie"], "publishers": ["Diego Rodrigues"], "esrb_rating": null}