{"id": 152500, "slug": "the-strike-master-official-demo", "name": "The Strike Master Official Demo", "name_original": "The Strike Master Official Demo", "description": "<p><strong>The Strike Master Official Demo</strong></p>\n<p>The Strike Master is a 2D pixelated action video game developed by GamerDiamondRyanB/Diamond Gamez. It features a cool 8 bit soundtrack used by  Spike Productions. The first version of the game was released on Microsoft Windows at gamejolt.com on May 21, 2018. The game is set in a fictional futuristic universe in which a evil twin adopted brother with a dark hidden past clones himself into millions and millions of copies. One boy by the name of Bluie has been chosen to defeat his wicked brother in many different magical worlds. For example a forest, the pits of hell, and so so much more. But it is not only his brother who Bluie has to go after and defeat, he also has to defeat all the other bounty hunters that The Wicked One hired to \"Finish the Job\". So won't you the almighty player download this FREE game and help Bluie defeat his brother and avenge his dead mother.</p>\n<p>Note: If the user wants to download this game they have to have Windows (sorry).</p>\n<p>Note 2: This game is my GamerDiamondRyanB/Diamond Gamez's idea so do not try to steal or use the artwork or ideas used in this game.</p>\n<p>Note 3: Your computer should be pretty strong for a good game experience.</p>\n<p>ALSO IF YOU HAVE A PROBLEM WITH THE GAME EMAIL ME AT diamondgamez78@gmail.com.</p>\n<p>Controls:<br/>\r\na to move left<br/>\r\nd to move right<br/>\r\nspace bar to jump<br/>\r\n← arrow key to move left<br/>\r\n→  arrow key to move right<br/>\r\nTo Shoot Hold down the left side of the mouse<br/>\r\nTo start the game on the main menu screen you can click enter or use the mouse to click the button.<br/>\r\nUse a mouse if you have one or a laptop touchpad to aim the scope of the gun</p>\n<p>FAQ:<br/>\r\nWill the game come to other operating systems?: Probably not. It will be Too buggy and to complicated for me, the creator.<br/>\r\nIf the game's slow. What should I do you may ask? Close/shutdown things in the background that you do not need like your web browser or other cpu consuming Less stuff.</p>\n<p>Just note this is a spoiler towards the game so if you do not want the whole game ruined just avoid this part of the text</p><p><strong>HERE IS THE LINK TO THIS GAME PAGE ON GAMEJOLT</strong></p><p>https://gamejolt.com/games/TheStrikeMasterOfficalDemo/341766</p>", "metacritic": null, "released": "2018-05-29", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/d43/d430b17b49b4c77e091d8f4dc3c11ff4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 101, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["GamerDiamondRyanB"], "genres": ["Action", "Adventure"], "publishers": [], "esrb_rating": null}