{"id": 152605, "slug": "nightcap", "name": "NightCap", "name_original": "NightCap", "description": "<p>In NightCap (aka Drunk Hipster), ShuddaHaddaLottaFun's first Ludum Dare entry, you assume the inebriated identity of a wayward Portland hipster named Chuck as he attempts to drunkenly navigate his way home from a night of boozing. However, this proves more difficult than it should be. Along the way you will encounter angry dogs, terrifying cliffs, and a bevy of other obstacles hell bent on keeping you from your warm, cozy, hipstery pad. What are you to do? Drink more, of course! As you down drink after drink you begin to see things differently, lighting the pathway home toward your coveted porcelain throne. But be careful, because in NightCap (aka Drunk Hipster) too much of a good thing really can be too much! <br/><br/>CONTROLS - Left/Right arrow keys to move, Up arrow to jump, Z to drink <br/><br/>(plus a secret action button!) <br/><br/><br/>We tried to do something different with the theme of Minimalism. Our idea was that drinking simplified things, making things more pixelated, and finally a simple minimalistic style. This simplifying changed the way you interacted with the world. <br/><br/>This was a first for us in so many ways. First jam. First Game. First time using Stencyl. First time doing Pixel Art. <br/><br/><br/>Our scope was a little big Art wise, which lead to filler art being used in a lot of places. Having only one artist without a drawing tablet made it tough to complete a lot of detailed pixel art in one weekend. But there is some really good stuff in there. <br/><br/><br/>Guns Up!</p>", "metacritic": null, "released": "2017-01-10", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/12a/12a17bf28cc012bf89f24e2e70c9e70d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 12, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["ShuddaHaddaLottaFun"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}