{"id": 15288, "slug": "fracture-the-flag", "name": "Fracture the Flag", "name_original": "Fracture the Flag", "description": "Fracture the Flag is a PvP oriented RTS, but has a growing single player set of features.  The primary goal is to expand your territory and conquer your opponent's. Do this by planting flags to add to your area of control or taking out an opponents flag and erasing their influence, not to mention their buildings. Some territory is rich in resources other has tactical and strategic value.<br/><br/>Or you could just peacefully use the nearby trees for target practice... Can't promise that's a winning strategy, but all to their own!<br/><br/>Use siege weapons and hand delivered bombs to destroy opponents walls, flags, and maybe most importantly their economy. Stop a player's economy and you've got them by the tender bits.A Few More Details<br/>Each battle starts with a clean slate. All units, structures and weapons can be upgraded from a base level giving no in game advantage to more experienced players - other than of course their personal experience. <br/><br/>The early part of each game will be based around resource collection in order to build more weapons, add more workers and plant flags to expand. Resources are also used to upgrade effectiveness of all in game units. Siege weapons will become more accurate and more powerful with upgrades allowing longer range bombardments. Workers will move faster allowing quicker bomb delivery and faster resource collection. Upgrade also also access to more buildings and military units.<br/><br/>As players' territory expands the conflict will begin... <br/><br/>Flags? What's the Deal? <br/>Flags are the mechanism by which a player controls land. A player may only build and place units within territory that they currently control. Need to add a mine? Better plant a flag. Want to be able to place siege weapons on top of a hill? Better plant a flag! Need another upgrade faster? Yeah, you better plant another flag.<br/><br/>If a flag is destroyed any buildings left without a flag nearby will burn to the ground. Flags can be destroyed by bombs or by siege weapons.Workers <br/>Workers take on many roles. There are no specialized NPCs. The worker that loads the catapults will just as happily deliver a bomb to the gates of you foe or gather lumber from the local forest. Each role is largely based around one or more buildings.Buildings:<br/><ul><li>Warehouse - the Center and Hub Of the Economy<br/></li><li>Construction Yard - Builds Siege Weapons<br/></li><li>Ammo Depot - stores Supplies For Siege Weapons<br/></li><li>Bomb Depot - Creates and store Bombs<br/></li><li>Lumber Mill - processes collected trees into usable wood<br/></li><li>Mine - supplies minerals <br/></li><li>Quarry - supplies stone<br/></li><li>Fire trap - explosive defense<br/></li><li>Plague trap - slow acting but long last defense </li></ul>Multiplayer<br/>Players will be able to use a matchmaking service to connect with other players around the world - a broadband connection is required for multiplayer. Global leader-boards will track players progress and ranking.", "metacritic": null, "released": "2016-12-07", "tba": false, "updated": "2019-08-28T22:11:39", "background_image": "https://media.rawg.io/media/screenshots/685/6854f6ede39263fe09be9bef2e361b27.jpg", "website": "http://www.fracturetheflag.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 8, "toplay": 1}, "playtime": 5, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 238, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["One Wheel Studio"], "genres": ["Strategy", "Indie"], "publishers": ["One Wheel Studio"], "esrb_rating": null}