{"id": 152927, "slug": "demented-itch-visualtech48", "name": "Demented (itch) (VisualTech48)", "name_original": "Demented (itch) (VisualTech48)", "description": "<p>\r\n\tDemented Official Page\r\n</p>Have you ever been <strong>frightened</strong>? Or felt the <strong>\n<strong>terror</strong></strong> while you were going home at night, that someone maybe is following and stalking you?<p>\r\n\tYou perhaps have, and that is what the game is about. Its not just about the fear, its about playing with your sweet mind. Demented is packed with all of it.\r\n</p><p>\n<quote=you>Just like every gamedeveloper says! How do we know then?\r\n</quote=you></p><p>\r\n\tI will put it this way. Even me, the developer making the game am terrified although I know what is going to happen next. So can you image the <strong>fear</strong> now?\r\n</p><p>\r\n\tTo make this possible I will introduce games system <strong>WCD</strong>, which stand for <strong>World Changing Disorder</strong>.\r\n</p><p>\n<quote=you>How interesting! But... What does that do :( \r\n</quote=you></p><p>\r\n\tTo simplify WCD is the \"<strong>brain</strong>\" of the Demented world. However it depends entirely on the players <strong>Health</strong> and Sanity (We will get to that in a moment). Now what does WCD do? It:\r\n</p><p>\n<list>\n</list></p><li>Changes the world (A wall was there buddy? Well now it isn't.)</li><li>Changes the perception of many things</li><li>Spawns <strong>Critters</strong> (Critters are the \"monsters\")</li><li>Adds \"corruption\" to the world</li><li>Plays trick with your mind</li><li>Controls the power system</li><li> More to come\tAlso we have System Shutdown or SS which shutdowns the power and brings it back at random intervals\t Random.Range(45, 210);\tAll of this is to made it as much as random as possible. Now, back to Sanity our core Gameplay element.Sanity:\t<quote=you>Sanity... I've heard about that a bunch of time, what is <strong>unique</strong> here?</quote=you>\tSanity <strong>controls you</strong>. It will decide many things, and you can even use it to your <strong>advantage</strong>. But what is it actually?\tThe main character is <strong>Bennet Helms</strong> has a brain tumor on the cerebral part of the brain (The part which controls communication, feelings, sense of reality, etc.). The tumor however can be contained with <strong>constant taking pills</strong>.\tNow, the <strong>effects</strong> of the Sanity:<ul>\n<li>Makes the player <strong>hallucinate</strong> things.\r\n\t</li><li>Spawns critters (\"They can, and they will hurt you\", the lower the sanity the more critters will come to hunt you)\r\n\t</li><li>Decreased vision field. (Depends on the %(percentage) of the players sanity)\r\n\t</li><li>Lowers your mental condition (Highlighting of things will be drastically decreased)\r\n\t</li><li><strong>45%</strong> Critters starts start spawning\r\n\t</li><li><strong>25%</strong> - Walk/Sprint slower\r\n\t</li><li><strong>15%</strong> - Disabling the ability to sprint\r\n\t</li><li><strong>10%</strong> - Black/White picture\r\n\t</li><li><strong>5%</strong> - \"<strong>C-Condition</strong>\" - You will be very fast, you will ignore pain of the critters (This means you won't be effected if a critter pushes you, for example but you will receive damage), ability to see far objects, medication will be highlighted.\r\n\r\n\t</li><li>*By hurting yourself you can go down to <strong>15% of your HP</strong> (hitpoints). Every <strong>self-injury</strong> gives the sanity bar 20% sanity but you lose 7-12% of your HP, but the lower your HP is, the slower you walk, and sprint. \r\n</li></ul></li><li>You cannot injure yourself if you have more then 75% of sanity.Radiation:\t<quote=you>Radiation in a horror game! Wow, but... how does that work?...</quote=you> <strong>Radiation</strong> is also a strong part of the game, as it can be <strong>rewarding</strong> but can be quite <strong>opposite</strong> as well. Also it can stop decaying of Sanity but as the Radiation is higher it will hurt you too! Since it is a big part we cannot reveal all of the effects of the radiation.\tSome <strong>effects</strong> of Radiation are:\t<list></list></li><li><strong>Slows</strong>, or stops sanity from decaying. Depends on the percentage of the radiation. If you are irradiated with more then 75 REMs of radiation your sanity doesn't decay anymore.\tEven with little radiation you lose bits of health. It depends on the percentage of the radiation. If the player, for example has <strong>100REMs</strong> he will lose 0,715 HP per second. (Radiation ÷ (60seconds * 2,33)).</li><li><strong>40+ REMs</strong> - Occasionally image blurring, and noises in head.</li><li><strong>85+REMs</strong> - Walk/Sprint a lot slower, bad reflexes, decreased hearing.\tThis is all for now, if you have any questions <strong>fell free to ask us </strong>;)\t<quote=bennet>Demented - \"Every corner, every corridor, every wall, they all have their stories. It is just the fear of the unknow that is frightening\"</quote=bennet></li>", "metacritic": null, "released": null, "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/0be/0bec24621dc460af58dbf8bf02128987.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 124, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["VisualTech48"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}