{"id": 153041, "slug": "alien-artifact-ld36-entry", "name": "Alien Artifact (LD36 Entry)", "name_original": "Alien Artifact (LD36 Entry)", "description": "<p>First let me start by saying I think I have a good idea in the works here but this is VERY MUCH A PROTOTYPE. Life just got in the way of this event unfortunately and I've only worked on it for maybe a total of 10 hours. But enough with excuses, here it is, Alien Artifact... <br/><br/>The premise of the game is that you've been searching the globe and finding odd tablets with Glyphs on them (cards). You then find an ancient alien artifact with all kinds of sockets on it. <br/><br/>That's about as far as I got with any kind of story... <br/><br/>Object of game: <br/>You have a deck of 51 cards and are dealt 3 cards each turn. With 5 Player Points (PP). <br/><br/>From the three cards, chose one of them to place in a socket (the grey circles) by clicking on a card and then clicking on a socket. The other two cards will be removed from the game. <br/><br/>Each card has a PP cost associated with it which is the number in the upper right corner of the card. <br/><br/>After placing a card in a socket. The mechanic on the card you used will apply. Some will give you a flat amount (#) of Energy (E) or Player Points (PP). Some will give you +/- E/PP per turn. <br/><br/>If you run out of PP, the game is over. If you get 100 energy built up, you will activate the artifact and win the game. <br/><br/>4 sockets will be randomly chosen with a semi random bonus applied. The Orange ones give you either a flat amount of PP or will increase your PP per turn. The Blue sockets do the same but for Energy instead. I initially intended for the bonus socket to have to match the type of card but wasn't able to get to that. It would also likely have applied the bonus as multiplier of the card inserted. <br/><br/>That is pretty much it. It does have a win condition (100 energy) and you can lose so from that perspective I suppose it is complete. I like the concept here and may built on it later. Other items I'd like to add/fix: <br/><br/>1) UI is not properly anchoring as the resolution is changed (so play it in 1024x768 for best results). <br/>2) There should be a hover feature on the sockets that have glyphs on them so you can see what the glyph does <br/>3) More cards. There were going to be bad cards in the deck as well such as randomly destroy a glyph but gain a good bonus <br/>4) Adjacency bonuses. All those connectors you see were suppose to be a way to deliver energy to the artifact at the center and also apply certain bonuses to sockets along the same connectors. <br/>5) Make it so that it isn't so easy to win :)</p><p>In any case, most of this is with the compo rules applied. I'm not 100% that a couple of the sounds I used were originally made by me but I think so. <br/><br/>There is a slight click sound at the end of the background music, I think this might be some sort of playback issue in HTML5 as it doesn't exist in the desktop version.<br/><br/>Engine: Unity <br/></p><p>Art (if you can call it that): Paint.NET </p>", "metacritic": null, "released": "2016-08-29", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/4ee/4eec9933f5b7282309bca28a9c1378e9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 35, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Simple Potential"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}