{"id": 15303, "slug": "heaven-forest-vr-mmo", "name": "Heaven Forest - VR MMO", "name_original": "Heaven Forest - VR MMO", "description": "What is the meaning of life? <br/>Where are we heading for and why?<br/><br/>It seems like an absurd and pretentious notion. Yet deep inside us these are the questions we ask.<br/><br/>This game aims to give the player a series of hidden clues in its world in order to lead him to ponder.<br/><br/>You're not alone in your journey, in fact the spirits you see in the forest are real players exploring the game with you.<br/><br/><strong>The VR device is not required in order to play the game.<br/>VIVE and Oculus are the supported devices you can use.</strong>_______<br/><br/><br/>You will discover that the answer to many of life's most profound questions is right within you.<br/><br/><br/>Are we just complicated collections of matter moving in patterns <br/>and obeying to impersonal laws of physics? Or are we part of a great and significant plan? <br/><br/>We ofter feel connected to the universe in some way that trascends the merely physical, whether it's the sense of awe when <br/>we contemplate the sea or the sky, or the love we feel when we're close to someone we care about.<br/><br/><br/>You might feel insignificant in the vastness of the cosmos, and perhaps you become alienated by thinking that your atoms <br/>obey to impersonal laws of physics, but all in all you are personally creating the world at every moment, just by looking at it.<br/><br/><br/>Is there a plan designed by a superior being? Or is it all casual?<br/><br/>We don't know exactly how the universe began, or if it's the only universe.<br/>We don't know the ultimate laws of physics. We don't know how life began or how consciousness arose.<br/><br/><br/>Since our mind is limited and conditioned, our eyes see only a fraction of reality.<br/><br/>Knowledge, like most other things in life, is never perfect. <br/>The problem is that our observations could well be mistaken. <br/>So, are we sure that the world we perceive with our senses is all there is? Or is there something else?<br/><br/>Is there something beyond the physical?<br/>Our most direct and tangible connection to the world around us is through our senses. Though sight and touch we come to understand.<br/>But there are times when we experience reality at a deeper level, without the intermediation of our senses. How are we to account for such experiences?<br/><br/><br/>Everyone has his own story and his own vision about life and it changes over time, <br/>but we are all connected to the whole universe.", "metacritic": null, "released": "2016-12-14", "tba": false, "updated": "2023-12-18T17:42:59", "background_image": "https://media.rawg.io/media/screenshots/322/32228d15c82a02a899654331ec4770d9.jpg", "website": "http://www.chubbypixel.com", "rating": 1.8, "rating_top": 1, "added_by_status": {"yet": 8, "owned": 352, "beaten": 3, "dropped": 1}, "playtime": 5, "achievements_count": 24, "ratings_count": 10, "suggestions_count": 361, "game_series_count": 0, "reviews_count": 10, "platforms": ["PC", "Linux", "macOS"], "developers": ["Fabio Ferrara", "MalboM"], "genres": ["Adventure", "Massively Multiplayer"], "publishers": ["Chubby Pixel"], "esrb_rating": null}