{"id": 153008, "slug": "average-work-week", "name": "Average Work Week", "name_original": "Average Work Week", "description": "<p>Can you survive an average working week?  In this maze game you have to stay calm while taking the kids to school, going to work, performing tasks etc. The maze and tasks are different on every day but they follow a set pattern from Monday to Friday. </p><p>The weekends are fun but first you have to survive Monday to Friday. (Why does that sound so familiar?) On Saturday and Sunday you'll do different things -with some fun twists and turns built in.</p><p>On each level there are people or cars that will try to stop you from remaining calm. They'll either take your stuff send you back to start. You have to avoid them at all costs.</p><p><strong>Difficulty:  </strong>It's not easy to stay calm and avoid all the obstacles that you'll encounter. You might also struggle to find all the objects on some of the levels. If you play timed then you also have a limited amount of time to complete the tasks and exit the level. You do receive bonus objects if you can find them. They will assist you to complete the maze easier.</p><p><strong>Duration:</strong> This is a long game and will take you many hours to complete. There are 70 levels. You can also click on a flag to replay any level.</p><p><strong>Game Saves:</strong> The game saves automatically at the start / end of a level but not in the middle of a level. It also allows up to 9 different saves. </p><p><strong> Timed Mode:</strong> If you're playing the game timed mode there's an additional feature. You can replay the game up to 5 times and each time you'll get just a little less time to complete the level. You can take up the challenge to see if you can beat the game with very little time left at the end. You can also replay any level to try and get gold.  (Gold is only possible in timed mode.)</p><p><strong>Full Screen / Window: </strong>This game was written in the dimensions 850 x 640 (because I started writing it many years ago). Window mode is recommended and it will always load in window mode. However, there is an option to switch to full screen mode under options. </p><p><strong>Keyboard: </strong>This game is played using the arrow keys on your keyboard.<br/></p><p><strong>Tested and working on Windows 10.</strong> </p>", "metacritic": null, "released": "2016-08-27", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/46c/46ccdefdd666ac27ff8cc51ff873fcdd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 117, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Evolutionary Games"], "genres": [], "publishers": [], "esrb_rating": null}