{"id": 153113, "slug": "dahri-dragons-wish-factory", "name": "Dahri Dragon's Wish Factory", "name_original": "Dahri Dragon's Wish Factory", "description": "<p>Dahri Dragon had run out of money for his wish factory when he recalled that people wish upon falling stars. He created a magic ball that when it hits a star will cause the star to fall. He can then collect that star and use it in his factory to create more wishes. <br/> <br/>Shoot the star with the magic ball, if you hit the star it will fall. Catch the falling star before it lands. Watch out for the comets, if you shoot them they will fall down and if they land on you, you will lose 5 stars. If a part of the comet breaks off and hits you, you will lose 1 star. </p><p>Collect all the stars needed before the time runs out or you'll have to start all over again. Be careful if a comet hits you in the last few seconds! Collect more stars and use the star money for 4 upgrades - two to make the balls go faster, two to make Dahri Dragon faster. </p><p>Type of Game: Shoot then catch.</p><p>Levels: 10</p><p>Difficulty Settings: Three, ranging from relatively easy to quite difficult.</p><p>Time per level: You can choose to play 3, 5 or 10 minutes per level. This has no impact on anything except for how long you'd like to play the game. The stars you need to collect are adjusted pro rata for your time choice. (These are game minutes - a little less than actual minutes.)</p><p>Music: 2 different tracks can be turned off from the menu.</p><p>Sound Effects: Yes, can be turned off from the menu.</p><p>Game Saves: No, but if you go to the menu or lose a game you can restart from that level.  If you exit the game all progress is lost and you have to start over.</p>", "metacritic": null, "released": "2016-08-20", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/045/04528398298e00d9d7e4e3bb3c204ef5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 107, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Evolutionary Games"], "genres": [], "publishers": [], "esrb_rating": null}