{"id": 153272, "slug": "intellectual-dark-web", "name": "INTELLECTUAL DARK WEB", "name_original": "INTELLECTUAL DARK WEB", "description": "<p>For years I've followed Sam Harris and Joe Rogan, not least because they provide content at length for my commute - Sam's at close to 2 hours, Joe regularly hits 3 hours.</p>\n<p>But during the past year I also started to get familiar with some other characters in their orbit, a diverse bunch unified by a willingness to discuss difficult issues at length with people across the political spectrum. They also seemed to be brought together in solidarity around victims of censorship. Many; Bret Weinstein, Charles Murray, Jordan Peterson, James Damore, Ben Shapiro had faced censorship due to public outrage about the topics on which they chose to focus.</p>\n<p>In May a term coined by Eric Weinstein during an interview became the title for the NY Times article Intellectual Dark Web . There I discovered this group, so derisive of identity politics, had found its identity. The article is an adequate primer so I won't seek to elaborate on what the IDW is. Rather I will explain in short the simulation and give one concern I have for the future of this misfit group of hashtags.</p>\n<p>I thought this was great material to try a data-vis project: A self-organising 3D nodal web for visualising relationships.<br/></p>\n<p><strong><em>Control the rotation and zoom with the arrow keys<br/></em></strong><strong><em>and rotate other axes with the W, A, S and D keys.</em></strong></p>\n<p>The methodology was simple; a simple google image search of each pair of public intellectuals would provide me the number of photos taken of each pair at public events (duplicate photos at the same event were not counted). That number then dictated the pull between those name nodes in the map. I've chosen to focus on players I'm familiar with, and also some outliers like Alex Jones to put the movement in perspective.</p>\n<p>Part of my reason for visualising this data was to flesh out a feeling I had about the proximity of Libertarianism to the IDK. </p>\n<p>As for conclusions that come from this (admittedly un-scientific) experiment, my fears have not been allayed that the group and its following of millions, are not being politicised towards Libertarianism.</p>\n\n<p>What we see in the group is the combination of non-political classical liberal thinkers like Sam Harris, Bret Weinstein, Steven Pinker, and the incredibly open-minded Joe Rogan, with politically-motivated libertarians such as Ben Shapiro, Dave Rubin, Douglas Murray, Jordan Peterson and Claire Lehmann.</p>\n<p>Libertarians have liberal social values, and preference liberties in general over rights (\"liberties\" being your freedom to act rather than your \"rights\" to be protected from other people's free actions).<br/><br/>So, listening to a Jordan Peterson at length, you can find yourself agreeing with the much of what he says.<br/></p>\n<p>Then couple this with someone from the left like Sam Harris - a fellow victim of the \"Regressive Left\", having faced similar public censorship to his ideas, and you find allegiance in a common enemy. And there is nothing wrong with criticising the left for silencing opposing views, it is anti-liberal, not to mention against the constitution.</p>\n<p>Enter politics. Now the perjorative of the \"Regressive Left\" (a term coined by Sam's friend and collaborator Maajid Nawaz) emboldens the right-wing inclinations of libertarians who hope to extend liberal principles to areas unrelated to freedom of speech; free-market economics, lax regulation and lower taxes - small government. </p>\n\n<p>You can see below Dave Rubin's attempt to solidify this pathway from liberal-intellectual to libertarian.</p>\n<p>THE PARTICULAR FLAWED LOGIC OF LIBERTARIANISM IN THIS CASE</p>\n<p>This group has bandied around people who have faced \"censorship\" in the form of institutions bowing to pressure from small public groups. But this censorship has not come from big government, quite the opposite, this is the free market allowing lobby groups to pressure institutions to protect themselves from public disapproval. Google weren't protecting themselves against big government when they fired James Damore, they were signaling principles consistent with a market that values a particular view of diversity.<br/><br/>Now, while Rubin is shoe-horning liberal economics in with liberal social policy, Shapiro and Peterson seem to have only discovered socially liberal views at the moment when middle-aged white men are having their rights to criticise historically marginalised groups challenged.</p>\n<p>There is some push back, for instance Joe Rogan's response to Dave Rubin's Laissez-faire building regulation position is 10 minutes of brilliant argument.<br/><br/>Don't get me wrong, I came to this group because they provided what I was craving; long form discussion of modern philosophical and political ideas. Shows like Rubin's and Rogan's do something for public debate the mainstream couldn't hope to achieve.<br/><br/>But I do feel as though the libertarian wedge is a real issue and it hasn't really been illuminated for what it is. I would hate to see my fellow liberal armchair intellectuals lead over the fence by a group of middle-aged white men essentially lamenting the privileged status of racial minorities and gender diversity.<br/><br/>Bret Weinstein's tweet quoted in the NY Times piece sums up my concern pretty aptly “Smart, skeptical people are often surprisingly susceptible to being conned if a ruse is tailored to their prejudices.”</p>", "metacritic": null, "released": "2018-07-02", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/a82/a828ce90e9d6dca3cd635b45d7fe01ef.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 23, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["nonzerosum"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}