{"id": 153237, "slug": "tiny-force-deluxe-itch", "name": "Tiny Force Deluxe (itch)", "name_original": "Tiny Force Deluxe (itch)", "description": "Tiny Force Deluxe\r\n\n<p>Tiny Force Deluxe is a turn-based battle game to free the world from evil forces.</p>\n<p>Create your own Tiny Force team and go to the fight. Evolve your characters with the magical crystals to make them stronger, faster and more resilient.</p>\n<p>Each character has a special attack ability, play with various characters like Robots, Ninjas, Dragons, Vikings, Zombies and more.</p>\n\n<p><strong>CAMPAIGN </strong>| Advance through the various game worlds, each with their specific enemies and bosses. Build your best team and beat the enemies.</p>\n<p><strong>ONLINE MULTIPLAYER </strong>| Play online with your friends and unlock unique special characters in this mode.</p>\n<p><strong>LOCAL MULTIPLAYER </strong>| Play locally with another player with your unlocked characters.</p>\n\n<p><strong>IN GAME:</strong><br/>- Build the best team to defeat your opponents and level up;<br/>- Five different worlds to fight through and win the game;<br/>- Thirty unlockable characters, of different types and skills,  such as Forest Counter, Fire Slice, Dark Beam monsters and more;<br/>- Destroy crystals and acquire jewels so your characters can evolve;<br/>- Excellent character and scenario artwork;<br/>- Several items to improve your gaming experience;<br/>- Bonus stages to get Energies, Ultras, Lives, and much more.<br/>- Amazing boss battles;<br/>- When you finish a challenge, you will get your Rewards.</p>", "metacritic": null, "released": "2018-01-09", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/13c/13c3219469edce360980a80f4d407235.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 150, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Sinergia Studios"], "genres": ["Action"], "publishers": [], "esrb_rating": null}