{"id": 153404, "slug": "the-little-worlds-project", "name": "The Little Worlds Project", "name_original": "The Little Worlds Project", "description": "<p><strong>High Level Concept: </strong><br/>A mysterious event has caused widespread amnesia leaving the people of Little Worlds in a state of disarray! Befriend characters, help them rebuild and discover why everyone suddenly lost their memories!</p>\n<p><strong>PC Controls:</strong><br/></p>\n<ul><li>Move - Left/Right arrow keys</li><li>Enter world portals (black circles) - Up arrow key</li><li>Press any key to progress NPC dialogue</li></ul>\n<p><strong>Mobile Controls:</strong></p>\n<ul><li>Move - Screen is split into 2 left and right buttons where you can press down anywhere to move your character</li><li>Enter world portals - press down on both sides of the screen</li></ul>\n<p>This was a project I did across 2 university units simultaneously (one focused on the art and story development, while the other on the game engine and implementing what I had scoped out in my game docs) over a period of 1 semester back in mid-late 2012. Because there were other things like writing long project proposals and other such documentation, not to mention trying to show the lecturers I had done some research, actual development time was much, much less than that. A somewhat fleshed out idea; about a cluster of little planetoids filled with people trying to start a new life after a mysterious event that caused global memory loss, had to get cut down to a simple prototype to demonstrate the game engine and some of the game mechanics with whatever original art I could put together.</p>\n<p>This prototype is a custom 2D JavaScript/HTML5 Canvas game engine I wrote from scratch as a way to highlight my studies in web development at the time (my university had no game development course so I had to find ways to make my projects about games and convince my lecturers I was doing something worth grading). It demonstrates loading multiple \"little\" worlds on the HTML5 Canvas, which can be navigated between using the circular black portals. The camera is always centred on the player as they move around the circumference of the worlds.</p>\n<p>There's also a sample of an NPC character with its own behaviour loop who will prompt a short piece of dialogue when the player gets close enough (and is facing the same direction). This NPC owned a shop, but he isn't able to remember what he actually sold, the idea here was that he would ask the player to suggest what he should start selling when he reopens, resulting in multiple paths the player could take to progress the narrative.</p>\n<p>At the time I was also building a level and animation editor to speed up the content creation process, which I did get to a point where I could modify variables and stuff but fell to the wayside after I reached the end of the semester and had other things to focus on.</p>", "metacritic": null, "released": "2017-06-07", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/48f/48fa10a78df49b51b975bf7c3c6f1259.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 47, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["lowlines"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}