{"id": 15341, "slug": "king-lucas", "name": "King Lucas", "name_original": "King Lucas", "description": "After an affair King Lucas had with the Witch of Sausan, the Queen left him and remarried in an adjacent kingdom, and now his daughters are the only ones left at his side. Due to his love for them, each and every time they get lost in the castle, he moves heaven and earth to get them back and he only resorts to the most intrepid knights in order to find them. Will you be one of those knights?<br/><br/>Play for the favour of King Lucas and the three princesses' love. A castle will be randomly built and you must find them inside a little area of it. You can move horizontally and vertically through the rooms until you reach your goal. Once you succeed, the castle will become a little bit more difficult: a larger area will be unlocked... and the experience will become more hardcore when the princess becomes lost inside a fully unlocked castle with more than 1,000 rooms.<br/><br/><strong>Features: </strong><br/><br/><ul><li>Get money and buy upgrades such us compasses and crystal balls, more weapons such us magical sticks and swords, or harder shields to protect yourself from the giant spiders, the armored rats, the piranhas and the many other haunted beings in the castle.<br/><br/></li><li>Enroll for collective multiplayer searches where you will be able to compete with your friends or with other unknown players. It’s simple: one princess, one winner... the first to find her. <br/><br/></li><li>Talk and interact with a lot of NPCs who will play different funny and unexpected roles through your quest (yes, there's some hidden story underneath the arcade!). </li></ul><br/>We absolutely love retro gaming and this has been engrained in King Lucas's DNA. This is a metroidvania game with 2.5D graphics and classic game mechanics for the delight of platform, action and adventure games lovers as well as you who didn't live the 80's and 90's; this is an opportunity for you to taste a bit of that classic feeling with the graphics and sound quality of today.<br/><br/>King Lucas' castle is made up of hundreds of interconnected rooms, which are reconfigured every time a new search begins. These rooms have been hand designed one by one (we don´t use procedural level design!) and there's no two equal gameplays. Lava pits, water tunnels, ladders, traps... this castle has become a deadly place since the queen left.", "metacritic": null, "released": "2016-12-01", "tba": false, "updated": "2020-12-16T14:31:23", "background_image": "https://media.rawg.io/media/screenshots/fae/faeea9a36ca27da629e0a867332be42c.jpg", "website": "http://www.kinglucas.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 108, "toplay": 1, "dropped": 1}, "playtime": 3, "achievements_count": 20, "ratings_count": 1, "suggestions_count": 315, "game_series_count": 0, "reviews_count": 1, "platforms": ["Nintendo Switch", "Linux", "macOS", "PC"], "developers": ["DevilishGames"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["DevilishGames", "Hidden Trap"], "esrb_rating": "Everyone 10+"}