{"id": 153442, "slug": "my-colouring-book", "name": "My Colouring book", "name_original": "My Colouring book", "description": "<p>★★ My Colouring Book is a coloring application, an easy to use, fun and creative powerful app for children for 1 years and up ★★</p><p>★ Play one of the easiest coloring book game for children! With plenty of pictures to color, from various categories like animals, fairy tale princess characters, mermaids and babies, you'll have an awesome time giving our drawings life, with colours.</p><p>★ As parents, Set your child's imagination on a prehistoric journey with our Coloring App. This interactive colouring book allows your child to select from a wide variety of images creating a never ending coloring book. Allow your kids to color their favorite characters like Oggy, Pooh over and over with easy to change colors allows your child to create different variations of their masterpiece. Share your child's creation or save to your device to show their adventure later.</p><p>★ All colouring pages are amusing, but we know that all girls love princesses and fairy tales, so we designed coloring catigorie content animated princess and mermaids, hearts, dresses ....... especially for baby girls, toddlers and older girls who enjoy princess painting games! Get our app princess colouring pages free and see for yourself how much your kids will love this kids colouring app!</p><p>★ features ★<br/>✓ Realistic finger colouring book for kids that requires precision and practice. <br/>✓ Develops fine kids motor skills in creative way.<br/>✓ Many Coloring Book: Halloween, colouring book for boys, colouring book for girls, animals, number &amp; letters, shapes, christmas, Fruits, dinosaurs, Aliens, robot, fairy tale.<br/>✓ Available for all screen resolutions and devices, including tablet device as kindle and samsung !<br/>✓ Simple and intuitive, your kid will have lots of fun for hours!<br/>✓ Multiple brushes and paint bucket<br/>✓ Colouring book free contains over 100 illustrations as free colouring pages <br/>✓ Kids Engaging, age-appropriate and skill-appropriate topics<br/>✓ Colouring book HD - the app adjusts to screen sizes of all devices including tablet<br/>✓ Free updates</p><p>★ Discover all the amazing benefits of colouring – don't hesitate and download this free colouring game right now and give your kids a fantastic colouring and painting experience!</p><p>★ Please tell us your opinion about it and if you like please rate it !</p>", "metacritic": null, "released": "2016-12-15", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/371/3710963f223e74be4e33f25a3ee0925f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 85, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["midooow"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}