{"id": 153577, "slug": "trigave-project", "name": "Trigave Project", "name_original": "Trigave Project", "description": "-&gt; Features\r\n<p>You fight human warriors by controlling an army that can be from 1 to 9 mutants in size,  you also have a number of energy points.</p>\n<p>In each arm, the mutants have a weapon. You can spend energy points when you select the mutants and choose the weapons from the left or right side, after that they shoot continually until you decide to change the attack.</p>\r\n- &gt; Input\r\n<p>- Drag the mouse over the mutants to select the ones you want to use.</p>\n<p>- Press Q to choose Left weapons, press W to choose Right weapons.</p>\n<p>- Click on humans to select a Target for the ability.</p>\r\n- &gt; Development Story\r\n<p>So to give you a little bit of context about this project, this was my FIRST functioning game project, I started this project in June 2015 and ended in October 2016. </p>\n<p>I started by learning Unity and created a prototype just to test the mechanics of the game. After that, a team was created to develop the game, a programmer, 2D artist, sound designer, animator and game designer formed the development team.</p>\n<p>In  March of 2016, we created a group for playtesters try our game.</p>\n<p>Link: https://www.facebook.com/groups/playtesting.trigave/</p>\n<p>On the first Monday of every month, we sent a build for our developers to test the current state of the game. </p>\n<p>We also created a character account to give the players a way to see what the world is about.</p>\n<p>Twitter: https://twitter.com/AteginaLusis</p>\n<p>Tumblr: https://www.tumblr.com/blog/trigave</p>\n<p>On October of 2016 I decided to halt the development of the game due to two major problems:</p>\n<p>- We over scoped the game, which means it would take a long time to finish it on the current skill of the team.</p>\n<p>- We also had a lot of fights about how the game should be developed. </p>\r\n-&gt; Special Thanks\r\n<p>- Henrique Póvoa,  programmer</p>\n<p>- João Vento, 2D artist</p>\n<p>- Manel Bello, animator</p>\n<p>- João Garcia, sound designer</p>\r\n-&gt; Personal Note\r\n<p>I was CRAZY during this game! Created so many unnecessary content, lore, characters, cities on a planet that wasn't going to be used in-game at all! Yet I loved making this game with the people that I did, awesome guys 😊.</p>", "metacritic": null, "released": "2018-06-22", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/189/1896eb077e4e63a938d7a1a4d2b9fd12.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 144, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["jerg33"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}