{"id": 153654, "slug": "explorations-in-anonymous-history", "name": "Explorations in Anonymous History", "name_original": "Explorations in Anonymous History", "description": "<p><strong>Explorations in Anonymous History</strong><br/></p>\n<p>This interactive media artwork is a companion piece to a program of research headed by Janine Marchessault and Michael Darroch that examines the innovative interdisciplinary journal ‘Explorations’ published in Toronto between1953 and 1959. This series of eight publications edited by Marshall McLuhan and Edmund Carpenter along with urban planner Jaqueline Tyrwhitt, political economist Thomas Easterbrook, and psychologist D. Carleton Williams, represents a landmark in Interdisciplinary Studies bringing together a publication of unusual intellectual diversity for its time, including anthropological studies of media effects, experimental poetry, scientific studies, and urban studies.</p>\n<p>The work animates a text entitled \"Five Sovereign Fingers Taxed the Breath\" that was published anonymously in Explorations 4. It has been also attributed to Marshall McLuhan in later publicatins. This interactive artwork transposes the graphic and conceptual experiments with collage and juxtaposition that were characteristic of the Explorations publications to the interactive and expansive realms of today’s digital technology. It poises new examinations of the potential of archival and database-centered experiences in the age of the internet. The work presents of model, championed by the Explorations project, of a scholarship that is experimental in nature and aware of the effects of contemporary media.</p>", "metacritic": null, "released": "2018-05-09", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/75a/75ae26f8a1e70619c3fa36ebcf60f79f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 7, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["David Clark 5"], "genres": [], "publishers": [], "esrb_rating": null}