{"id": 153749, "slug": "gladadation", "name": "Gladadation", "name_original": "Gladadation", "description": "<p><strong>&lt;&lt; Use fullscreen button in lower right! &gt;&gt;</strong></p>\n<p><strong>Left Click</strong> - choose an attack</p>\n<p><strong>Parry</strong> Button - <em>If used when opponent Slashes deal 10 base damage, if opponent Stabs take 30% of your current health as damage, if opponent Parries deal no damage.</em></p>\n<p><strong>Stab</strong> Button - <em>If used when opponent Slashes deal 5% of their current health and take 10 base damage, if used when opponent Stabs take 10% of your health as damage and deal 10% of your opponent's health, if used when opponent Parries deal 10% of your opponent's health.</em> </p>\n<p><strong>Slash</strong> Button - <em>If used when your opponents Slashes deal no damage, if used when your opponent Stabs take 5% of your health as damage and deal 10 base damage. If used when your opponent Parries take 10 damage.</em></p>\n<p><strong>R</strong> - <em>Restarts the game</em></p>\n<p><strong><em> by Wes Wafer , </em></strong><strong><em>Mark Whittingham, Brandon Shin</em></strong></p>\n<p><em>\"You’re a gladiator fighting against another gladiator, you have three attacks parry, stab, slash. If you win a duel you have the choice to upgrade three stats there are Dexterity, Agility, and Strength. After you win you duel you have five upgrades, you must buy your upgrades at the shop. You keep dueling until you die. Dexterity increases your slash damage, Agility increases your stab damage, and Strength increases your parry damage.\"</em></p>", "metacritic": null, "released": "2017-08-04", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/218/218fce7bb547c81843de7b05ae156592.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 59, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["NYU Game Center - High School Programs"], "genres": [], "publishers": [], "esrb_rating": null}