{"id": 15373, "slug": "the-count-of-monster-disco", "name": "The Count of Monster Disco", "name_original": "The Count of Monster Disco", "description": "PLEASE NOTE: Train Simulator is not required to play this game. <br/><br/>The people of New Town are totally unaware,<br/>Of a place you imagine only if you dare,<br/>Trainsylvania is a spooky and frightful land,<br/>In which the Count of Monster Disco has a mansion so grand.<br/><br/>He is holding a party for his frightful friends,<br/>But something’s not right as dusk nears an end,<br/>Not a pumpkin, decoration or nibble in sight,<br/>Will everyone be disappointed this party night?<br/><br/>You are the monstrous driver of a ghoulish steam train,<br/>But will getting the supplies be a complete pain?<br/>Capture the cobwebs and gather the snacks,<br/><br/>But beware…..<br/><br/>The sight of the guests will make your bones CLICKETY-CLACK!<br/><br/>It’s Halloween, and the vampire owner of Trainsylvania Mansion, the Count of Monster Disco, is looking forward to the Halloween Party he holds every year for his frightful friends.<br/><br/>But, there’s a problem! It’s dusk already and his mansion isn’t ready for the party. As Frankie, the monstrous driver of ‘The Spirit of Halloween’ steam train, help our horrible host organise his fright night. Through a series of frighteningly exciting tasks, explore the spooky town of Trainsylvania to pick up Halloween decorations, wagons filled with monster snacks and carriages of ghoulish passengers.<br/><br/>Then, deliver them to Trainsylvania Mansion and make this a Halloween party to remember!<br/><br/>But only if you dare……", "metacritic": null, "released": "2014-10-24", "tba": false, "updated": "2019-08-28T22:11:36", "background_image": "https://media.rawg.io/media/screenshots/854/854856f2a5e1b89d12db6cdf3244c7c9.jpg", "website": "http://www.train-simulator.com", "rating": 0.0, "rating_top": 0, "added_by_status": {}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 387, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Dovetail Games", "Skyhook Games"], "genres": ["Simulation"], "publishers": ["Dovetail Games - Trains"], "esrb_rating": null}