{"id": 15382, "slug": "vr-swing-table-tennis-oculus", "name": "VR Swing Table Tennis Oculus", "name_original": "VR Swing Table Tennis Oculus", "description": "This Game do not need a Oculus touch or X-box controller, because your daily use smartphone device will turn into your special “My-Racket!!”. A simple skill of timing and some spirit is all you need to conquer this game. Shoot the Special Smash by shouting into your device. But don’t get too excited and let go your Racket, because we do not have warrant for it ;-). <br/><br/>- Setup -<br/>1. Download the game (table) from Steam to your PC<br/>2. Download the game (racket) from google play store [https://play.google.com/store/apps/details?id=com.vrbuddy.vrsttoculus] to your Android smart phone<br/>3. Install and launch the game on your PC<br/>4. Launch the app on your Android device<br/>5. Enjoy VR Table Tennis :D<br/>Note: First, launch the game on your PC, than launch racket app on your Android device. You must follow this order to play the game properly.<br/><br/>- How to Play -<br/>- Game will start automatically when you launch the racket app. (Launch the racket after you start the game on your PC)<br/>- Swing your Android device to start the match<br/>- Shout into your Android device to hit special smash. (Red balls on top of the screen indicate the number of special smash you can hit)<br/>- Tap the Android screen to open the menu<br/>- Swipe the Android screen to navigate through the menu<br/>- You can select 3 different location to play table tennis<br/><br/>Note: We only support Android Device for Racket at the moment. iOS will be out shortly. <br/>VR Swing Table Tennis is exploring it’s potential turning smart phone devices into an input device for VR games. We will continue to develop more exciting games with the same concept, and we would love to hear feedback from game players like you.", "metacritic": null, "released": "2016-12-16", "tba": false, "updated": "2019-08-28T22:11:35", "background_image": "https://media.rawg.io/media/screenshots/fad/fad52141986add62f900b7d4a42a57a2.jpg", "website": "https://twitter.com/vr_buddy", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 121, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["VR Buddy"], "genres": ["Sports"], "publishers": ["VR Buddy"], "esrb_rating": null}