{"id": 15399, "slug": "score", "name": "SCORE", "name_original": "SCORE", "description": "SCORE, is a mix between an Open World Multiplayer Game and a Football Simulation where players compete for fame, glory and wealth on a global scale on and off the pitch. Besides the Football aspect of the game players take on professions to help run the city like police officer, medic, firefighter but also jobs on the other side of the law like assassins, drug dealer and many many more.<br/>\n<br/>\r\nSCORE immerses the player in a realistic environment that tests the player's ability to function as a member on a football team as well as their adeptness at surviving the swift streets of Legend City intermixed with the shady dealings of the city's underworld. <br/>\n<br/>\r\nBy choosing a profession - police officer, firefighter, drug dealer, taxi driver, judge, politician, etc. - the player experiences the dark side of fame. Buy apartments, cars, guns, clothes, furniture. Race downtown. Order a hit. Blackmail a politician. <br/>\n<br/>\r\nReputation, money, glory - it's all on the line. <br/>\n<br/>\r\nJust like in soccer leagues, players can be traded and bought by either AI or Player coaches of other clubs - if the price is right. Imagine starting your soccer career in Spain and finishing it in Brazil. Teams will be able to play a fully featured soccer game in \"Club Mode\", and other tourneys, like National and International Tournaments, custom games and play locally with up to 8 players. <br/>\n<br/>\r\nChoose your profession wisely. <br/>\n<br/>\r\nPlay with passion. <br/>\n<br/>\r\nGet it all.", "metacritic": null, "released": "2016-07-05", "tba": false, "updated": "2019-08-23T12:12:33", "background_image": "https://media.rawg.io/media/screenshots/ec7/ec70d7e5c8ff4243c3539c36c0dbce3d.jpg", "website": "http://www.score-thegame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 4, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 350, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["True Illusion Software"], "genres": ["Action", "Adventure", "Simulation", "Sports", "Racing", "Massively Multiplayer", "Indie"], "publishers": ["True Illusion Software"], "esrb_rating": null}