{"id": 15405, "slug": "ratz-instagib", "name": "Ratz Instagib", "name_original": "Ratz Instagib", "description": "Fast, frantic and full of blasting fun – take to the rat-tlefield and join the Ratz Instagib revolution!<br/><br/>Duke it out as a railgun-toting rat in household-themed arenas, with every shot being a potential kill – no shooting opponents repeatedly to little effect or suffering cheap deaths at the hands of people with an unfair advantage. It's every rat for themselves!<br/><br/><ul><li><strong>One Gun, One Shot</strong> – An even playing field means almost anyone can immediately pick up Ratz and start having fun, no matter what their FPS skill level.<br/></li><li><strong>Rocket Jumping</strong> – Use the dedicated 'Rocket Jump' button to mix up your movement; moving targets are harder to hit!<br/></li><li><strong>Maps</strong> – Enjoy 13 different maps based on real-world household environments, plus tonnes of user-created arenas!<br/></li><li><strong>Customisation</strong> – Unlock loads of customisation items to jazz up your Ratz, then choose from loads of beam and frag types to really show off your style.<br/></li><li><strong>Modes</strong> – The best that FPS action has to offer: Deathmatch, Team Deathmatch, Capture The Flag and the almighty Freeze Tag!<br/></li><li><strong>Stats and Leaderboards</strong> – Fully integrated stat-tracking and leaderboards to help keep track of your progress… can you become the best rat around?<br/></li><li><strong>RatzEd Map Editor</strong> – Create your own stages and share them with the community via Steam Workshop – easy to use, but incredibly versatile</li></ul>", "metacritic": null, "released": "2016-07-27", "tba": false, "updated": "2023-07-29T14:40:05", "background_image": "https://media.rawg.io/media/screenshots/f02/f026678b20a8ce9b132b01a619c242cd.jpg", "website": "http://www.ratzinstagib.com", "rating": 3.71, "rating_top": 4, "added_by_status": {"yet": 5, "owned": 323, "beaten": 9, "dropped": 14, "playing": 2}, "playtime": 2, "achievements_count": 13, "ratings_count": 21, "suggestions_count": 313, "game_series_count": 0, "reviews_count": 21, "platforms": ["PC", "macOS"], "developers": ["Lino Slahuschek"], "genres": ["Action", "Indie"], "publishers": ["Rising Star Games"], "esrb_rating": null}