{"id": 154083, "slug": "galaxy-knights-super-target-striker", "name": "Galaxy Knights: Super Target Striker", "name_original": "Galaxy Knights: Super Target Striker", "description": "<p>A small FPS based on the webcomic Super Galaxy Knights Deluxe R.</p>\n<p>One day, an evil witch used her magic to take over the kingdom with her army of living scarecrows. You, Green Archer, were hired by the military to take care of the situation.<br/></p>\n<p>Take out all the scarecrows as quickly as possible, then get to the goals!</p>\n<p>As Green Archer, you have a multitude of techniques to aid you in this mission:</p>\n<p><em>Arrows</em> - Charge up with <strong>left click</strong> and release to shoot an arrow. Aim for the head for maximum damage!</p>\n<p><em>Rapid-Fire Shot</em> - Hold <strong>right click</strong> to shoot out a barrage of short-range arrows. Watch your energy!</p>\n<p><em>Homing Arrow</em> - Press and release <strong>E</strong> to select an enemy, then use left click to shoot an arrow that automatically homes in on your target!</p>\n<p><em>Chain Arrow</em> - Press <strong>left shift </strong>to activate your chain arrow technique, then use left click to grapple to a platform, building, or even an enemy!</p>\n<p><em>Explosive Arrow</em> - Defeat enemies to fill this technique's meter. Then, once the meter is full, press <strong>Q</strong> to activate your explosive arrow technique. Aim for groups of enemies!</p>\n<p><em>Quick Attack</em> - If you're completely out of options, press <strong>F</strong> to perform a melee attack that doesn't use up energy.</p>", "metacritic": null, "released": "2017-12-12", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/bf8/bf81208c66b29b7224e19f473f4d5193.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 71, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["snuffysam"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}