{"id": 154059, "slug": "reversicards", "name": "ReversiCards", "name_original": "ReversiCards", "description": "<p>This is a new kind of TCG with fantasy story. The match will take place on a 4×4 square board. The player hold more grids will have the final victory.</p><p> The basic rules of the game similar to triple triad. There are different points on the 4 sides of the cards. Your card whose point is greater than his own on the side that is in contact, can capture opponent's cards and turn it into your background after placed. Your goal is to capture your opponent's card in grids. Very easy, isn't it?</p><p> There are hundreds of cards in the game. Different skills of cards can form a variety of combinations. According to the order and position of different cards, the process change unpredictably, lead a person to endless aftertastes. Try it at once!</p><p>****THE GAME FEATURE****</p><p>**Match the other players in the network, have a real-time battle.</p><p>**Players need to collect cards, develop tactics to create their own characteristics of the deck.</p><p>**Hundreds of cards, in addition to different points, but also have a variety of skills.</p><p>**There are 4 camps in the game. the card's camp same to the grid, the card more powerful.</p><p>**The Trick Card can not be seen by opponent. It's an important strategic confrontation.</p><p>**You can add friends, and play with them.</p><p>A game of 5 minutes, anytime, anywhere can play! </p><p>Intense stimulation of the war process. Instant reversal! </p>", "metacritic": null, "released": "2017-04-13", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/bbe/bbe34d0fecf5b96539b5ebe6c7149846.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 130, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["sexy batman"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}