{"id": 154026, "slug": "reverse-desertification-cyprus", "name": "Reverse Desertification - Cyprus", "name_original": "Reverse Desertification - Cyprus", "description": "<p><strong>Online Demo Version</strong></p>\n<p><strong>System Requirements:</strong></p>\n<p><strong>Browser: </strong>Firefox, Safari (currently not working on Chrome)</p>\n<p><strong>Memory (RAM): </strong>at least 1GB of ram</p>\n<p><strong>Use with keyboard keys (W,A,S,D) and mouse (for looking)</strong></p>\n<p>WASD (W: move forward, A: move left, S: move backwards, D: move right)</p>\n<p>The island of Cyprus is suffering with desertification. During the summer times the temperatures reach 45 degrees and during the the whole span of a year the rainwater accumulation is far from sufficient for the hierarchical distribution. It can be resolved if new theories are proposed, visualised and applied. It is the accumulation of rain and it's distribution that can define and revitalise the island. At this stage of the project we are focusing on the agriculture need for water.<br/><br/>This ongoing project is currently at the stage of visualisation of GIS-data into an informative and communicative way to bring awareness to non-experts on desertification effective layers. The aim is to later introduce guidance and proposals on the matter of rainwater collection, saving and distribution. <br/><br/>The geoportal website of the Cypriot Government provides a great amount of GIS data and all are open-source. It is from there that we take initiative and on the way to developing a software that brings awareness on environmental issues concerning Cyprus.<br/></p>\n<p>Το νησί της Κύπρου υποφέρει από απερήμωση. Κατά τη διάρκεια των καλοκαιρινών χρόνων οι θερμοκρασίες φθάνουν στους 45 βαθμούς και κατά τη διάρκεια ενός έτους η συσσώρευση των ομβρίων δεν επαρκεί για την ιεραρχική κατανομή. Μπορεί να επιλυθεί εάν προταθούν, οπτικοποιηθούν και εφαρμοστούν νέες θεωρίες. Είναι η συσσώρευση βροχής και η διανομή που μπορεί να καθορίσει και να αναζωογονήσει το νησί. Σε αυτό το στάδιο του έργου εστιάζουμε στη γεωργική ανάγκη για νερό.<br/><br/>Αυτό το συνεχιζόμενο έργο βρίσκεται σήμερα στο στάδιο της απεικόνισης των δεδομένων GIS σε ένα ενημερωτικό και επικοινωνιακό τρόπο για να φέρει την ευαισθητοποίηση σε μη εμπειρογνώμονες σχετικά με τα αποτελεσματικά επίπεδα απερήμωσης. Στόχος είναι αργότερα να εισαχθούν οδηγίες και προτάσεις για το θέμα της συλλογής, αποθήκευσης και διανομής των ομβρίων υδάτων.<br/><br/>Ο δικτυακός τόπος της κυπριακής κυβέρνησης για τα διανυσματικά αρχεία παρέχει ένα μεγάλο μέρος των δεδομένων GIS και όλα αυτά είναι ανοικτού κώδικα. Είναι από εκεί που αναλαμβάνουμε πρωτοβουλία και στο δρόμο για την ανάπτυξη ενός λογισμικού που θα φέρει επίγνωση του περιβαλλοντικού ζητήματος που αφορά την Κύπρο.<br/></p>", "metacritic": null, "released": "2017-07-06", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/fc9/fc9aa63d47ecc223b45451e7f42da8e3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 144, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["messiosmarios"], "genres": [], "publishers": [], "esrb_rating": null}