{"id": 154053, "slug": "hopa-mini-test-quest", "name": "HOPA: Mini test Quest", "name_original": "HOPA: Mini test Quest", "description": "<p>I was sorting out the work with Phaser, it turned out to be a game engine for the genre HOPA, to debug the engine I needed an example that turned into this mini game. I would like to finish it.</p>\n<p><strong>Description:</strong><br/>Every year, we are reminded of the end of the world, what would you do, in order to avoid the end of the world? In this little demo story there lives a guy who found a way, and when that very end came, he decided to use his own way to save his life. There are three little endings in the game.</p>\n\n<p><strong>Rules of the game:</strong><br/>We pass between locations in search of useful things, which we immediately select and put into inventory, find clues, read and put in a magazine, just interact with everything that can be on the location.</p>\n<ul><li><strong>Diary </strong>, in which there are records, a map and tips that were picked up during the game</li><li><strong>Inventory </strong>with items. In the inventory, you can disassemble items (a calculator = a calculator button + a calculator without a button) or combine two items (a flashlight + batteries = a work flashlight)</li><li><strong>Hint </strong>that can prompt where to return, where to look, what to pick up, where to apply. In general, all that you have missed will tell you. The hint is only available when charged.</li><li><strong>Skip</strong>, with this button you can skip a mini-game that you do not want to pass because it does not like or is not understandable. The button also becomes available only after it is charged.</li></ul>\n<p><em>Sorry for the rude performance. This is still a demo.</em><br/></p>\n<p>I need the help of an artist and a screenwriter.<br/>Мне нужна помощь художника и сценариста.</p>\n<p><strong>Thanks for the feedback!</strong><br/></p>", "metacritic": null, "released": "2018-03-19", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/9fe/9fecff9e643bf9ad1135cd4262738e2f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 68, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["VitDev"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}