{"id": 154194, "slug": "count-arrow-hit", "name": "Count! Arrow Hit", "name_original": "Count! Arrow Hit", "description": "<p>(enable video sound for full experience)</p><p><strong>Download on Google Play</strong><br/></p>\r\nThe Story\r\n<p>Bows, arrows, numbers. What do they all have in common? </p>\n<p>They stand at the cornerstone of our evolution. They mark the transition into humanness, the next stage in physical and mental skills, as they changed the course of history. </p>\n<p>But <em>fast-forward </em>into the present. <em>I mean real fast.</em></p>\n<p>Numbers are everywhere, they're in our pockets, in the light, in our radio waves. Primitive hunting tools have been replaced by autonomous machines and lasers.  </p>\n<p><strong>Have we forgotten how to hunt? Do we even remember how to count?</strong></p>\n<p>Keep this feeling with you when you go out on this experience, and don't be afraid to fail. It's hard, like everything today, but <em>it will get easier</em>, with <em>perseverance</em>.</p>\r\nThe Guy\r\n<p>I'm always looking at ways to mix mediums. </p>\n<p>That's why I've always been interested in cinematography, making music, programming, and I want more.</p>\n<p> My road in game development and design is very young, but opens up a lot of colorful ways to mix those other things together and present them into something new.</p>\r\nThe Ask\r\n<p>You can follow my progress on Facebook.</p>\n<p>Feedback is very welcome. There's a lot more to do here, but I hope it's a start for a challenging experience as is. </p>\n<p>Please take time to get a feel for it, and then leave a rating in the Play Store as well. It's more than welcome and needed for a little game just coming out of its shell.</p>\n<p>But most of all, have fun. </p>\n<p>Best,</p>\n<p>Robert</p>", "metacritic": null, "released": "2018-07-10", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/289/289769c9accc287d5757856ba8c31b9d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 38, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["rvrds"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}