{"id": 154146, "slug": "the-quarter-game-itch", "name": "The Quarter Game (itch)", "name_original": "The Quarter Game (itch)", "description": "Meet Mayu Shirokawa! You can call her Mashiro! Today is her chance to grab the title as the CEO of the company she works for! How? Simple! Her CEO has been kidnapped. All she has to do is to save her CEO. Maybe the CEO will be convinced to give away the title at the end. But here's the catch. She's up against the deadliest black market dealers in the world. This means she'll have to fight crazy people with guns, mutated crab heads, and bio-engineered wolves! Players will be presented with a strange mixture of top-down hack 'n slash, beat 'em up, and bullet hell elements in this fast paced speedrunnable game.\r\n<p>What can spending four quarters in this game make you do:</p>\n<ul><li>Get a cooler quarter and make it shine to reflect enemy projectiles!</li><li>Play as a cute grill named Mashiro.</li><li>Become a CEO of a company.</li><li>Perform massive combos with your sword!</li><li>An awesome original soundtrack!</li><li>Wavedashing!</li><li>Fight against people!</li><li>Fight against people who permanently replaced their heads with crabs!</li><li>Fight against friendly spiders!</li><li>Learn how drinking milk everyday makes your bones stronger!</li><li>Learn how donuts can bring your friends closer!</li><li>Unlimited continues unlike arcade machines (but they're obviously cooler games!)</li><li>Have a little sister who supports you in anything you do!</li></ul>\n<p>What you can't do in this game:</p>\n<ul><li>I lied. You can only help Mashiro become the CEO of a company.</li><li>You can't become a CEO IRL (but if you know how to do it IRL, tell us!)</li><li>Kill people (I mean everyone explodes, but please assume you only knock them out.)</li><li>Adopt a cat (Sorry. In the span of the game's 24 hour development cycle, we played with someone's cat instead of making this feature. We are fools.)</li></ul>", "metacritic": null, "released": "2017-12-09", "tba": false, "updated": "2019-08-28T23:22:00", "background_image": "https://media.rawg.io/media/screenshots/0c6/0c681078a2c0deb04e4778c78fef57f8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 120, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ChairGTables"], "genres": ["Action"], "publishers": [], "esrb_rating": null}