{"id": 15457, "slug": "cities-in-motion-2", "name": "Cities in Motion 2", "name_original": "Cities in Motion 2", "description": "<p>Continuation of the game Cities in Motion.<br />\nThe essence of the game is the construction of profitable transport networks in large cities. The player is the director of the company that manages all the transport of the city.<br />\nThere are five types of transport: a bus, a tram, a metro, a river tram and a trolleybus (in the first game there was a helicopter instead of a trolleybus).<br />\nYou can manage:<br />\n- creating routes,<br />\n- selection of models of vehicles,<br />\n- salaries of drivers and other employees,<br />\n- expenses for the maintenance of transport,<br />\n- fare for different areas and categories of the population,<br />\nThe reputation of the company also matters, it affects the preferences of passengers and, accordingly, on revenue and profits.<br />\nThe route of each type of transport is constructed under certain conditions: for the tram rails are needed, for the metro you need a tunnel, a different number of stops for different areas. Residents are also divided into six classes, differing in income, needs and transport preferences.<br />\nThe second game differs from the first by the absence of a helicopter as a mode of transport, the ability to build roads, the change of day and night, the introduction of depots instead of simple ring lines, and also the presence of a multi-player mode.<br />\nThe player is provided with a data collection system that informs about people&#39;s places of residence and work, the functions of buildings, the number of stowaways and so on.<br />\nThe &quot;sandbox&quot; mode allows you to operate with unlimited resources and the ability to arbitrarily change any parameter, cancel all restrictions. Campaign class modes have specific tasks, even a few, and only the execution of tasks opens the next campaign. Each campaign corresponds to a separate city, there are only six of them.</p>", "metacritic": 72, "released": "2013-04-02", "tba": false, "updated": "2024-04-06T12:33:06", "background_image": "https://media.rawg.io/media/games/ce6/ce6c9b58be2ca76688a768cffcb043d1.jpg", "website": "http://www.citiesinmotion2.com", "rating": 2.78, "rating_top": 3, "added_by_status": {"yet": 107, "owned": 1780, "beaten": 18, "toplay": 10, "dropped": 55}, "playtime": 2, "achievements_count": 51, "ratings_count": 95, "suggestions_count": 398, "game_series_count": 0, "reviews_count": 96, "platforms": ["macOS", "PC", "Linux"], "developers": ["Colossal Order"], "genres": ["Strategy", "Simulation"], "publishers": ["Paradox Interactive"], "esrb_rating": null}