{"id": 154638, "slug": "garden-game-prototype", "name": "Garden Game Prototype", "name_original": "Garden Game Prototype", "description": "<p>A test prototype for a garden tile based puzzle pusher game thing.</p>\n\n<p>Breakdown of the objects in game:</p>\n<p>Player, <strong>move with the arrow keys</strong>, they will turn if pressing a direction they are not facing, and move forward if pressing the direction they are facing. <strong>You can also undo any action with Z and restart a level with R.</strong></p>\n<p> Tile, you can <strong>flip it by facing the tile, and pressing the action button</strong> (space or x) which moves it forward and changes the side facing up</p>\n<p>Start and End Tiles, they are marked with I and II, the player can walk on them, but the tiles cannot be flipped on them. The goal is to make a path from I to II in the same color tiles.</p>\n<p>Neutral tile, they can be part of either a yellow or pink path, but they cannot be moved.<br/></p>\n<p>Wheelbarrow, they can be pushed back and forth but not turned, and tiles can be flipped into the wheelbarrows and pushed. You must have all wheelbarrows off the path to complete the level.</p>\n<p>Water, the player and wheelbarrows cannot go on water, but tiles can, and then the player and wheelbarrows can go over those tiles.</p>\n<p>Here's my latest dev log!</p>\n\n\n\n<p>This prototype was built in the wonderful Puzzle Script, but I have plans on making it better, and updating the graphics. If you'd like to support this project, donate on this page with the Support This Game button! I don't have a hard timeline for the development yet since my time is limited, but if you donate at least $10, I'll send you a copy when it's finished!<br/></p>\n<p>You can also keep up to date on this and other game projects with my newsletter https://tinyletter.com/alexwcolby</p>", "metacritic": null, "released": "2018-06-10", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/cdf/cdf701ffa928f50f245232c3839a3ca6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 27, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["boomboombap"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}