{"id": 15479, "slug": "overture", "name": "Overture", "name_original": "Overture", "description": "<p>Overture is a rogue-like 2D action game developed by Black Shell Games.  </p>\n<h3>Gameplay</h3>\n<p>The game shares many similarities with other rogue-like games. In Overture, you take a role of one of 24 characters and explore the randomly-generated dungeons for loot slaying hordes of monsters and fearsome bosses.<br />\nThere are four types of characters in the game: warriors, rogues, mages, and shamans. At first, you only have one character per type. Like most other games in the genre, Overture uses a permadeath system which means that there is no way to respawn and after you die battling in a dungeon you start next run from the beginning. After game over you gain some amount of money depending on how well you made this time. You can spend it to unlock new characters or upgrade the ones that you already have.  <br />\nYou control your character using mouse and keyboard. The control scheme reminds of twin-stick shooters. You walk with WASD, aim with mouse and attack with mouse buttons. You can also use magic spells and special abilities. The most notable gameplay mechanic in Overture is running away from enemies. To do so, you have to stop attacking and start going in the direction of the mouse pointer. Mastering this mechanic is essential for surviving in the dungeons. Throughout the dungeons, you can find various useful weapons and items that can boost your stats.</p>", "metacritic": 76, "released": "2015-02-02", "tba": false, "updated": "2023-12-18T17:47:32", "background_image": "https://media.rawg.io/media/screenshots/851/851e812422c3d989508cb594596a8984.jpg", "website": "http://blackshellgames.itch.io/overture", "rating": 1.95, "rating_top": 1, "added_by_status": {"yet": 44, "owned": 927, "beaten": 3, "toplay": 1, "dropped": 10}, "playtime": 4, "achievements_count": 4, "ratings_count": 22, "suggestions_count": 269, "game_series_count": 0, "reviews_count": 22, "platforms": ["PC"], "developers": ["Black Shell Games"], "genres": ["Action", "Adventure", "RPG", "Strategy", "Casual", "Indie"], "publishers": ["Black Shell Media"], "esrb_rating": null}