{"id": 15481, "slug": "incognito", "name": "Incognito", "name_original": "Incognito", "description": "John is a middle-aged investment banker down on his luck. He has no family, no real friends, and his portfolio is in dire straits. Resolving to commit suicide, he jumps off the roof of his office building and at the last minute is saved by an immensely powerful alien entity named HEIDI. HEIDI is dying, and requires help in order to survive. Discovering that the protagonist has lost all purpose in his life, HEIDI offers him a new reason to live in exchange for saving her.<br/><br/>Incognito aims to mix elements from different gaming genres and bring them together into a game that’s vast in scale and requires different genre skills, but easy enough for the average gamer to jump into and play from beginning to end.<br/><br/>These genres change at each “zoom level” of the game:<br/><ul><li>When the player's on foot, Incognito is an FPS with RPG elements<br/></li><li>When the player's in the orbit of a planet, Incognito takes the form of a simple RTS game<br/></li><li>When the player's in their vehicle, the game turns into a Tank Combat game</li></ul><br/>In order to progress through each Episode, you’ll have to conquer challenges at each level, gathering information on foot, exploring in your ship, landing on uninhabited planets and mining elements, and on hostile planets, invading a planet’s surface defenses in the hover-tank.", "metacritic": null, "released": "2015-03-23", "tba": false, "updated": "2019-09-17T12:58:37", "background_image": "https://media.rawg.io/media/screenshots/f68/f68ac0e47201d3e2a1b404095540adb7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 111, "dropped": 1}, "playtime": 4, "achievements_count": 21, "ratings_count": 1, "suggestions_count": 415, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Fox", "Maxwolf"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Fox", "Maxwolf"], "esrb_rating": null}