{"id": 154953, "slug": "nightmarish-spawns", "name": "Nightmarish Spawns", "name_original": "Nightmarish Spawns", "description": "<p>Enter The Known Realm and defeat the Nightmarish Spawns that are plaguing the land. Use weapon upgrades, shields, spells and potions to turn the odds to your favor. Crawl inside the treacherous dungeons and discover treasures or, sometimes, your own doom.</p><p>STORY<br/>For centuries, The Realm has endured chaos at the hands of half-crazed kings, corrupted commanders and unrepentant sinners. But it was during the last war that unprecedented madness and a darker form of sorcery came to be. Using the blood sacrifice of many, maleficent sorcerers managed to open the gates of hell and Nightmarish Spawns swarmed the land of man. It is believed that a Hellmouth of gigantic proportions is hidden in this land and serves as the passageway between hell and earth.<br/><br/>Legend says, one day a brave soul wielding a mighty sword will fight his way to the gates of hell and seal off the entrance forever.<br/><br/><br/>FEATURES<br/><br/>100 unique creatures to battle.<br/>10 distinct locations to discover.<br/>A fleshed out animated story.<br/>An arsenal of upgradable weapons and shields.<br/>Magic spells and potions to turn the odds in your favor.<br/>A rotating unique puzzle type board.<br/>UI Animations and fantastic hand-drawn art.<br/>Rich Soundtrack and fx. <br/>Dungeons crawling Russian roulette events that either uncovers hidden treasures or nightmarish spawns.<br/>Creature battle system.<br/>Location unlock mechanism.<br/></p>", "metacritic": null, "released": "2018-06-28", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/a32/a324d7ed0645a769d5654ffcc4f79903.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 54, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["doubletongamestudio"], "genres": ["Adventure", "RPG", "Puzzle"], "publishers": [], "esrb_rating": null}