{"id": 154971, "slug": "soul-proprietor-q", "name": "Soul Proprietor Q", "name_original": "Soul Proprietor Q", "description": "<p>This is a project that started for a university project to develop a multiplataform game. We started using Marmalade Engine focusing on the mobile plataform (Android).<br/></p>\n<p>However, even though the engine was very powerful, it was too low level for our needs and we ended up just finishing the prototype of the game for our college assignment, which can be found here.</p>\n<p>The game concept is based on CAPCOM's One Piece Mansion game for PSX. We felt that the game had a lot to improve and we couldn't find anything similar with this game out there. So why not make our own spiritual successor with new mechanics and plot?</p>\n<p>Soul Proprietor Q is a revamp of our first prototype, now using Phaser.</p>\n<p>This game is at a prototype level but we love this idea and project and we hoped we can finish it in a near future.</p>\n<p>-----</p>\n<p>Commands and How to Play: </p>\n<p>This game uses only the mouse and left click to interact with stuff.  You can drag an drop the tenants to rearrange them. </p>\n<p>You can buy new tenants by click the menu icon at the top left of the screen, and then clicking in the desired tenant and dragging then to an empty apartment.</p>\n<p>The objective of the game is to make most money, you can do that by having a lot of simultaneous tenants. Each tenant has a stress bar below them. If it becomes totally red, they will leave your apartment. Each tenant can stress or aliviate stress of their neighbors. You can check the directions of their influence by hovering the mouse over them.</p>\n\n<p>-----</p>\n<p>If you have problems with the screensize of the game, click the fullscreen button on the bottom right, press start and then inside the game click the fullscreen button on the top right.</p>\n<p>Developers:</p>\n<ul><li>Fahrenheit: Code, 2D Art</li><li>Kydrang: Code, 2D Art</li><li>Milkshanks: Code</li></ul>", "metacritic": null, "released": "2017-09-12", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/56f/56fcf85a4984f3d2f2e13355676b066c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 74, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Fahrenheit"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}