{"id": 155006, "slug": "memory-match-animals", "name": "Memory Match Animals", "name_original": "Memory Match Animals", "description": "<p>Memory Match Animals is a fun memory and concentration game to exercise and train the brain!</p><p>Your memory will be challenged as you concentrate on memorizing where the cards in order to match up pairs of cards. Memorize the cards and train your brain to find the pairs!</p><p>Would you like to improve your memory and concentration? Then Memory Match Animals is the game for you! Memory Match Animals is both a fun and educational game of memory and matching. Logical scoring encourages repeat play for improvement to train your brain and develop memory. The more you play, the better your memory becomes!</p><p>Many difficulty levels, suitable for kids and children of all ages as well as adults of any age. High-quality graphics </p><p>and configurable levels of detail to allow customizing the display to suit varying preferences.</p><p>Features:</p><p>* Many difficulty levels to progress through</p><p>* High-quality animated graphics, with many customizations possible</p><p>* Attractive awards and detailed stats</p><p>* Simple, intuitive controls</p><p>* Non-blocking touch interface (no \"forced wait\" after reveal, clicking next card will immediately continue)</p><p>* Logical non-timer-based scoring to encourage repeat play and improvement</p><p>* Auto-adjusts to fit any device</p><p>* Educational memory and concentration game, suitable for all ages</p>", "metacritic": null, "released": "2017-04-06", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/313/313b89934995182567d3c76a5e1067d2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 233, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["danisobo"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}