{"id": 1550, "slug": "touchgrind-skate-2", "name": "Touchgrind Skate 2", "name_original": "Touchgrind Skate 2", "description": "“Touchgrind Skate 2 is one of the best touch gaming experiences around that is a must buy for hours of action packed fun.” - Apple'N'Apps<br/><br/>“Touchgrind Skate 2 blossoms into a world of enjoyment [..] Illusion Labs does it again!” - TouchArcade <br/><br/>“The fingerboard sensation is back with an improved feeling!” - AppAdvice<br/><br/>---<br/><br/>Skate like a pro in the most realistic multi-touch skateboarding game ever!<br/><br/>Just like in real skateboarding or fingerboarding, Touchgrind Skate 2 is a game of skill that takes 10 minutes to understand but a lifetime to master. Learn the tricks, complete challenges, and unlock new skateboard parts.<br/><br/>Get the highest score in time-limited Competition mode, rip freely and complete challenges in Jam Session mode, challenge your friends in the turn-based multiplayer Game of S.K.A.T.E or export video clips and show off your best lines.<br/><br/>True innovative finger controls together with real physics simulation let you pull off tricks like ollies, pop shuvits, kickflips, heelflips, impossibles, powerslides, lip tricks, stalls, drops, 5-0’s, 50-50’s, crooks, tailslides, bluntslides, darkslides etc in endless combinations, or why not do them in nollie, fakie or switch? - Only your skill and imagination set the limit!<br/><br/>Get a maximized experience with a real skateboarding feeling - Skate like in real life on your iOS device!<br/><br/>FEATURES<br/>- Realistic physics and stunning 3D graphics<br/>- 4 free roam game modes: Training, Competition, Jam Session, Game of S.K.A.T.E turn-based multiplayer<br/>- Tutorial videos - watch and try yourself!<br/>- Natural multi-touch controls, evolved from Touchgrind and Touchgrind BMX<br/>- Tilted camera view, similar to Touchgrind BMX<br/>- Three different skateparks with bowls, ramps, curbs, boxes and over 2.000 meters of rails<br/>- Complete the 100 challenges to unlock all skateparks, game modes, decks, wheels, grip tapes and stickers<br/>- Record your runs and create replay videos to impress your friends<br/>- True skating experience <br/>- Game Center achievements and leaderboards<br/>- Trick name detection<br/>- Advanced OpenGL ES 3.0 effects<br/><br/>Follow @illusionlabs on Twitter<br/>Like us at www.facebook.com/illusionlabs1", "metacritic": null, "released": "2013-11-21", "tba": false, "updated": "2019-07-30T20:33:27", "background_image": "https://media.rawg.io/media/screenshots/4ff/4ffbc663fe62069905ff97c307507515.jpg", "website": "http://www.touchgrind.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "beaten": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 315, "game_series_count": 0, "reviews_count": 1, "platforms": ["Android", "iOS"], "developers": ["Illusion Labs"], "genres": ["Sports", "Arcade", "Casual"], "publishers": ["Illusion Labs"], "esrb_rating": null}