{"id": 15508, "slug": "leisure-suit-larry-in-the-land-of-the-lounge-lizar", "name": "Leisure Suit Larry in the Land of the Lounge Lizards: Reloaded", "name_original": "Leisure Suit Larry in the Land of the Lounge Lizards: Reloaded", "description": "It’s not just the funniest game you've ever played…<br/>\n<br/>\r\n…it’s also the most infamous video game of all time!<br/>\n<br/>\r\nLeisure Suit Larry in the Land of the Lounge Lizards was first released by Sierra On-Line in 1987 and be-came an international phenomenon. The lovable loser Larry Laffer -- a 40-year-old virgin in pursuit of losing his vir….um, finding true love -- and risqué humor were unlike anything anyone had ever seen or played.<br/>\n<br/>\r\nNow Larry’s original creator, the world-famous game designer Al Lowe, has teamed up with Sierra Veteran Josh Mandel, to bring this amazing, perverted game back to life – updated and expanded in every way imaginable! All we kept from the original game is the plot. EVERYTHING else is fresh and new including:<br/>\n<br/>\r\n•Incredibly lush new high-res graphics! Explore all the seedy sights and sounds of Lost Wages, where fortunes and reputations go to die!<br/>\r\n•A brand new musical score by Grammy-nominated and BAFTA Award-winning composer Austin Wintory! Fresh from completing the musical score to Journey (available for download on the PS3), Austin composed the best music Leisure Suit Larry has ever heard!<br/>\r\n•Everything in the game was rebuilt from the ground up, including all hand-painted backgrounds, characters, and state-of-the-art 2D animation!<br/>\r\n•Thousands of hilarious new lines, gags, jokes, and dialogues, written by Al’s old Sierra partner, Josh Mandel (aka the voice of King Graham from King’s Quest)!<br/>\r\n•New characters, new locations, new puzzles, and a major new love interest for Larry!<br/>\n<br/>\r\nWhat’s more, Leisure Suit Larry: Reloaded is the first major game to be released with funding by Kick-starter! Over 14,000 fans chipped in to bring Larry back to life!<br/>\n<br/>\r\nWill Larry find true love? Will Lost Wages ever be the same? And will YOU want to play any other comedy adventure once you've played Leisure Suit Larry: Reloaded?<br/>\n<br/>\r\nThere’s only one way to find out!<br/>\n<br/>\r\nWow, even more people keep chiming in:<br/>\n<br/>\r\n“This is indeed Larry 1 at its best.”<br/>\r\n–Richard Cobbett, Rock, Paper, Shotgun<br/>\n<br/>\r\n“The city of Lost Wages has never looked, sounded, or played so good, and the additions are mostly huge improvements.”<br/>\r\n–Shane Roberts, Gamezebo<br/>\n<br/>\r\n“Fans who haven’t played the original in decades will smile, chuckle and, above all, be happy to see a character as well-designed and beloved as Larry return.”<br/>\r\n–Alan Danzis, Mashable<br/>\n<br/>\r\n“Just as filthy, funny, and heartwarming as it ever was.\"<br/>\r\n–Suzanne Keller, Slide to Play Score: 4 out of 4<br/>\n<br/>\r\n“You might find Leisure Suit Larry: Reloaded the funniest thing you've ever seen and certainly a bit risque.”<br/>\r\n–Karl Burnett, TouchArcade Score: 4 out of 5<br/>\n<br/>\r\n“Larry’s back (in more ways than one) and arguably better than ever.”<br/>\r\n–Rob Rich, 148Apps Score: 4 out of 5<br/>\n<br/>\r\n“This is a worthy remake that improves upon the original in every conceivable fashion.”<br/>\r\n–Nikola Suprak, Hardcore Gamer Score: 4 out of 5<br/>\n<br/>\r\n“Prepare yourself for something very unique and wholly unforgettable.”<br/>\r\n–Mark Smith, Game Chronicles Score: 4 out of 5", "metacritic": null, "released": "2013-06-27", "tba": false, "updated": "2022-09-29T23:04:24", "background_image": "https://media.rawg.io/media/screenshots/2c0/2c0f72e354d10172a62d3daaa0902e08.jpg", "website": "https://www.replaygamesinc.com/", "rating": 3.29, "rating_top": 4, "added_by_status": {"yet": 13, "owned": 324, "beaten": 13, "toplay": 7, "dropped": 5}, "playtime": 2, "achievements_count": 40, "ratings_count": 24, "suggestions_count": 267, "game_series_count": 0, "reviews_count": 24, "platforms": ["macOS", "PC", "Linux"], "developers": ["nFusion Interactive"], "genres": ["Action", "Adventure", "Casual"], "publishers": ["Replay Games"], "esrb_rating": null}