{"id": 15513, "slug": "equin-the-lantern", "name": "Equin: The Lantern", "name_original": "Equin: The Lantern", "description": "A randomly generated deal, each game is different! <br/>\n<br/>\r\nStory: <br/>\n<br/>\r\nYou're a kid. Who's gray. With rabbit ears. <br/>\n<br/>\r\nPeople have been grumbling about the goings-on below town. Seems there's some sort of magic lantern that's throwing the whole joint into chaos. Yeah, that's what I said too! Full of it, they gotta' be, right? Turns out- not so much.. <br/>\n<br/>\r\nSo.. What's it you do again, kid? Warrior? Thief? Wizard? Cleric??!<br/>\r\nOH! A lawyer!? <br/>\n<br/>\r\nHahaha, well you sure had me fooled there for a while.. little jerk.. <br/>\n<br/>\r\nHere's what you're gonna' do: Head below town, JUST FOR ME, and see what the hell that Lantern's on about. They tell me it turns all kinds of colors, and each color changes the rules. <br/>\n<br/>\r\nHow so!? What am I, an electrician?!? <br/>\r\nThat's up to you to find out! <br/>\n<br/>\r\nAnd so you did! <br/>\n<br/>\r\n--- <br/>\n<br/>\r\nEquin: The Lantern is my fun little roguelike with some wholly original ideas. Conquer the 50 floor dungeon and its evil inhabitants in a quest to the bottom of the joint to find the mysterious lantern itself. With features like a turn-based 1st person battle system, Auto Killing weaker enemies, an XP Hit Streak bonus, hundreds of weapons and armor to find, diabolical floor events to shake things up, a lantern who screws with the rules, and oh yeah- PERMADEATH BABY, this is the game for those who like a good challenge. <br/>\n<br/>\r\nSTRATEGERIZE by slamming doors in your enemy's face to lock them in a room, or lead them into a web and trap their stank @sses. Watch out for stronger champ versions though and much stronger bosses at every turn! <br/>\n<br/>\r\nNOTE: This time around I got some help from the fantasic Rocco W and his sick 8-bit tunes! They were so good I decided to scrap all my own music except for the title theme.", "metacritic": null, "released": "2016-10-27", "tba": false, "updated": "2019-08-28T22:11:30", "background_image": "https://media.rawg.io/media/screenshots/38a/38a46ab399c1434c7c7a94a929828d26.jpg", "website": "http://dxfgames.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 12}, "playtime": 2, "achievements_count": 33, "ratings_count": 2, "suggestions_count": 253, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["DXF Games"], "genres": ["RPG", "Strategy", "Indie"], "publishers": ["DXF Games"], "esrb_rating": null}