{"id": 1551, "slug": "the-end-the-mayan-apocalypse", "name": "The End: The Mayan Apocalypse", "name_original": "The End: The Mayan Apocalypse", "description": "The End has just began! <br/><br/>The world has come to an end; run like hell, dash over and dodge obstacles, collect duct tape, and buy goodies to develop your survival camp, and eventually rebuild the civilisation - if you care!<br/><br/>The streets are deserted, everything is covered in lava, and you are alone. Yet, you hear the call… and even in the middle of the Collapse, you know it is time to run, to survive!<br/><br/>RUN!<br/><br/>The End App challenges your reflexes and offers lightning fast infinite game play with progressive level design and multiple environments. Jump over the burned down police car and reach the hidden duct tape while running through the deserted city. You will have to survive 28 days and deal with 5 challenges each day. Practice with free-runs for a challenge or buy boosters to get an edge, but never-ever take your eyes off the duct tape; collect them!<br/><br/><br/>‣‣ Awesome, diverse HD 3D graphics, with vivid, rich colors<br/>‣‣ Action-packed endless gameplay<br/>‣‣ Easy to use, intuitive swipe and tilt controls<br/>‣‣ Lightning fast performance even on older devices<br/>‣‣ The story of the Mayan apocalypse told from a unique perspective<br/>‣‣ Unleash crazy Power Ups, complete Master and London achievements<br/>‣‣ Two huge cities to explore with a bunch of different environments<br/>‣‣ More than 100 uniquely designed and generated levels<br/>‣‣ Original music, sound effects, and cool voiceovers<br/>‣‣ 5 characters with unique animation and original voiceovers<br/>‣‣ Facebook and Twitter share integration<br/>‣‣ Original water and lava effects<br/><br/><br/>Download TheEndApp and get lost in the madness! There is more action than you can handle! RUN!", "metacritic": null, "released": "2012-07-05", "tba": false, "updated": "2019-07-30T11:01:12", "background_image": "https://media.rawg.io/media/screenshots/50c/50c47187c4dc9a539cf936de801451d6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 212, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["POSSIBLE GAMES Kft.", "POSSIBLE Games"], "genres": ["Action", "Arcade", "Casual"], "publishers": ["POSSIBLE GAMES Kft."], "esrb_rating": "Everyone 10+"}