{"id": 155262, "slug": "army-commando-city-attack", "name": "Army Commando City Attack", "name_original": "Army Commando City Attack", "description": "<p>Army Commando City Attack is a First Person shooting and an elite commando shooter game. Get ready to face the enemy inside a city with no one around to help. You have to kill terrorists on the each level; the only survival is to kill all the enemies. You have to face a group of terrorists, and you are alone in this mission. </p>\n<p>So be ready to show your skills on the battlefield and take the city back from these terrorists. Your only mission is to clean the area and bring back peace in the region.  In Army Commando City Attack game, you got map where you have to track terrorist using your mini map and take them before they hurt you. You got different weapons to select from and to use. The 3D shooting graphics are amazing and you will enjoy playing it on this map.</p>\n<p>Army Commando City Attack got 5 different levels to complete; more levels will be added soon. These missions include: Arena23, Aftermath, The Hunt, Karcho and Destroy City. All missions contain different amount of enemies and these terrorists are well trained and well equipped. Be careful about the suicide bombers, as they can attack you at any time. In the start, you got 2 weapons to take on these terrorists, but you can pick weapons from the ground as well as you can pick one which was used by the enemy. You can jump, run and kill these terrorists as elite commando use to do.</p>\n<p>Features:<br/>• 5 different levels to become an elite commando.<br/>• Amazing selection of weapons.<br/>• Amazing 3D City environment.<br/>• Smooth and easy controllers.<br/>• Totally Free Commando shooter game.</p>\n<p>Download this Army Commando City Attack game and show your skills to shoot out terrorists and become one of the best elite commando shooters.</p>", "metacritic": null, "released": "2017-10-10", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/a7d/a7d2c840db46a85a6497f9d926e9373b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 262, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Sohail Mumtaz"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}