{"id": 15538, "slug": "a-train-9-v40-japan-rail-simulator", "name": "A-Train 9 V4.0: Japan Rail Simulator", "name_original": "A-Train 9 V4.0: Japan Rail Simulator", "description": "A-Train 9 - Better Than Ever<br/>A-Train 9 has had many major upgrades to the feature set and gameplay options over the years, with this version, Japan Rail Simulator, being the new pinnacle of the game.What Is A-Train 9?The biggest and best city builder, transport simulation game returns with a host of new features. <br/><ul><li>Drive a train! Actually step inside the cab and take control. <br/></li><li>New control options. <br/></li><li>Speed restricted track ensure your trains arrive when they are supposed to <br/></li><li>Vehicle groups give you the vision you need to control up to 200 trains <br/></li><li>New track layout options. The offset X junction, very handy for your marshalling yards and control of the entrance to sprawling muti-platform stations <br/></li><li>New road flexibility. City blocks and roads that run at 45 degrees to add greater flexibility to your cities and allow more realistic city-scapes to be built.</li></ul>With more trains, buildings, trackside objects than ever!What’s New in A-Train 9 V4.0 : Japan Rail Simulator<br/>The new version of A-Train has a stack of new features that focus on the two most important aspects of gameplay: realism and control.<br/><br/><strong>Enhanced Realism</strong><br/><br/>A-Train is about creating working, profitable cities built around a strong transport network. Over the years we have seen our players create some fantastic cities, the scale and scope of which is staggering. <br/><br/>Whether it is the painstaking re-creation of 100 km² real-life cities, or imaginative sprawling utopias, A-Train has always allowed the player to use their imagination. The latest version increases the scale and scope of the game 100%. Twice as many vehicles can be placed on landscapes with twice as many art assets. More road and track-side features with new levels of flexibility in the way that road and rail are built. <br/><br/>The player can now use these tools to create more realistic and involved cities either from real-life or from their imagination. This extra realism is balanced by some great new control options which work at both the individual vehicle level and the management control level of the game.<br/><br/><strong>Become the Driver</strong><br/><br/>Have you ever wondered what it might be like to actually drive one of your trains? To actually experience the challenges the engineers may face in keeping to the speed limit, providing a comfortable ride, and delivering the goods and passengers on time? Well, in A-Train 9 V4 Japan Rail Simulator, it's now possible to step on the footplate and take control. Either from the first-person engineers point of view, or from a bird’s-eye 3rd person viewpoint, experience your cities like never before. <br/><br/>It’s not just trains. Jump on board a car or boat and see your creations from whole new perspectives. Ever wondered what it would be like to be a citizen or a worker in your city? While now you can find out.<br/><br/><strong>Double the Vehicles</strong><br/><br/>Doubling the number of vehicles in the game adds a massive amount of scope and scale to the game, and that brings with it its own challenges. It might be overwhelming to have 200 trains running simultaneously. Understanding what they are all doing and how to optimize their timetables and routes with so much going on would be a challenge for anyone. <br/><br/><strong>Plan Your Routes</strong><br/><br/>A-Train 9 V4 Japan Rail Simulator adds new features that bring you control from the transport planner level. <br/><br/>It's now possible to sort and filter your vehicle by type and group them into color-coded teams. How you use these features is up to the player. You may want to group your trains by the routes they travel, or perhaps separate them into long distance and commuter trains. It might certainly be a good idea to colour code passenger and freight trains separately, but that choice is yours and with the filter and sort options it’s very easy to set up. <br/><br/>The control is there, and the choices are yours. Experiment and develop your own system using the new tools provided, and then see at a glance how your network is operating. <br/><br/><strong>Precise Layout Control</strong><br/><br/>The new version of A-Train offers more control than ever. Track laying has been improved, trains can now have their own custom consist and speed settings, land can be raised and flattened within the game itself (at a cost).<br/><br/>It's your world, creating the perfect rail and road transport system has never been more satisfying.<br/><br/><strong>Assets to Create Realistic Environments</strong><br/><br/>Hundreds of new art assets are included in the game. From roadside elements such as post boxes and bus stands right up to suspension bridges, landmarks airports. You can now create detailed and interesting worlds alive with detail.<br/><br/><strong>Realistic or Model Scaling</strong><br/><br/>Massive areas of land to expand in to. View it all in 4K resolution (with a suitable monitor) and decide whether you want to use the new 1:1 scale modelling in the game which adds a new level of realism. Whether it's the big image or the fine details, A-Train 9 V4 Japan Rail Simulator has scale covered.<br/><br/><strong>Degica – Here To Support You</strong><br/><br/>Degica brings a new level of support to the worldwide release of A-Train. With effort spent on localization before launch and our commitment to continue to support the game with updates, and improvements after launch, you can feel confident that this is the definitive version of A-Train.Massive Train and Rolling Stock Update<br/><strong>More Than 40 New Trains!</strong><br/><br/>The world of A-Train moves up a step with the introduction of our free DLC pack. <br/>Adding more than 40 new trains, you can now create worlds more diverse than ever. Each train has its own strengths and weaknesses. <br/>Should you choose the slow powerful work-horse capable of pulling large numbers of carriages over long distances economically? Or is the light nimble local commuter the right tool for the job?<br/><br/><strong>Did We Mention – This is Free?</strong><br/><br/>This huge update is completely free to existing owners of the game! It will be added to your Steam account automatically on release day.<br/><br/><strong>Highlights from this DLC include:</strong><br/><br/>303 Series Commuter <br/>A passenger friendly local commuter built to cope with a shortage of trains. Cheap to operate <br/><br/>415-1500 Series <br/>A light stainless steel engine designed for passenger comfort <br/><br/>485 Krishima <br/>With re-introduced green livery. The work horse of the Nippo Main Line <br/><br/>721 Commuter <br/>Efficient and temperature regulated. A short stop sprinter for the busy Sapporo suburbs <br/><br/>883 “Renewal” Livery <br/>A tilting EMU. Handling sharp curves and rapid but comfortable acceleration and deceleration are the strong points of this light, fun vehicle.<strong>A-Train 9 Japan Rail Simulator. The Ultimate A-Train 9 Experience</strong><br/>A-Train 9 V4 Japan Rail Simulator is the latest and greatest version of the game, having all the benefits of all previous versions and these great new features added here. <br/><br/>Whether you are new to the game, or a returning player, there has never been a better time to ride the A-Train.", "metacritic": null, "released": "2015-10-21", "tba": false, "updated": "2019-08-28T22:11:30", "background_image": "https://media.rawg.io/media/screenshots/65c/65c03a6b436aa40506fadd216940600e.jpg", "website": "http://www.railwaysims.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 6, "dropped": 1}, "playtime": 6, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 283, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ARTDINK"], "genres": ["Simulation"], "publishers": ["Plug In Digital", "Degica"], "esrb_rating": null}