{"id": 15544, "slug": "trials-of-azra", "name": "Trials of Azra", "name_original": "Trials of Azra", "description": "<strong>Play as Sam, a kid that controls the dead! Defeat your enemies with magic and control their bodies to solve challenging puzzles!</strong><br/><br/>Sam, a regular kid whose life usually consists of drinking chocolate milk and playing with his dog, finds himself trapped in a dark realm with newly found necromancy abilities, and a strange man who claims to be his guide. <br/>Help this young boy find his way through the Trials of Azra for his own survival. Will you be able to set him free and unveil the truth behind the mysterious ordeal forced upon him?<br/><br/><br/><br/><ul><li>20+ enemies to defeat and control <br/></li><li>60+ rooms filled with puzzles <br/></li><li>Challenging Boss fights <br/></li><li>Upgrade your basic attack and learn new spells <br/></li><li>Several areas with diverse environments <br/></li><li>Local co-op <br/></li><li>Full compatibility with Xbox Controller</li></ul><br/><br/><br/>The gameplay is mainly about defeating and controlling your enemies, then using them to solve increasingly difficult puzzles. <br/><br/>Once you control an enemy, you can switch back and forth between it and Sam. This ends either when the controlled enemy dies, or you start controlling another enemy (you can control just one at a time). <br/><br/>The game features local co-op, which will probably (if you and your buddy get along) make things a little faster and more fun. Careful though, now there are 2 players who can mess up a puzzle or get killed by a deadly trap! <br/><br/>The main way to deal with Sam's foes is by using magic. Aside from the basic projectile, there is a number of spells to learn. Spells consume mana, so you should keep an eye on that blue bar. Health and mana regenerate with food, which sometimes can be found served on a table, but really, is there anything better than eating it straight from the floor of a room inhabited by giant rats? We don't think so. <br/><br/>Trials of Azra intends to challenge the player's wits and skills with increasingly difficult puzzles, and keep introducing new content as the game advances, mixing it with the already adquired knowledge in order to make it more complex the closer it gets to the end.", "metacritic": null, "released": "2016-09-15", "tba": false, "updated": "2019-08-28T22:11:30", "background_image": "https://media.rawg.io/media/screenshots/a1f/a1f96869efc74c590a5ef31a07e5adb2.jpg", "website": "http://onion-core.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 49, "beaten": 1}, "playtime": 4, "achievements_count": 14, "ratings_count": 2, "suggestions_count": 259, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC", "Linux", "macOS"], "developers": ["Onion Core"], "genres": ["Adventure", "Indie"], "publishers": ["Onion Core"], "esrb_rating": null}