{"id": 155529, "slug": "all-hail-glarglop", "name": "All Hail Glarglop", "name_original": "All Hail Glarglop", "description": "EARLY ACCESS:\r\n<p>All Hail Glarglop is a sci-fi visual novel in EARLY ACCESS (v0.0.7). Chapter 1 is currently available.\r\nI’ll try to add a new chapter each month. The total story will be around 5-7 chapters (~275 pages). I have the main story outlined, but I’ll be making changes based on your feedback. So let me know which plotlines you like the most! </p>\n\r\nSTORY:\r\n<p>Tension between Humans and Va’Xarins has always been strenuous, but when Coalition settlements expanded further north, the Va’Xarin Council declared war.\r\n  </p>\n<p>The conflict has been on-going for nearly three decades. Hundreds of thousands have died.</p>\n<p>Despite Va’Xarins’ superior technology, they are outnumbered by humans 15 to 1 and unable to claim victory. Up to now, battles have remained isolated and limited to the frontier.</p>\n<p>Unfortunately, Va’Xarin technology continues to advance. Within a year their new, superior weaponry could bring the war to an end. Humans are desperate to prevent such an outcome.</p>\n<p>Ambassador Kira Nikova has been representing the Human Coalition during the recent Peace Talks. Captain Graydin and his crew have been tasked with helping her.</p>\n<p>As Captain Graydin’s first officer, your primary objective is to secure peace. Your choices could end the war ...or prolong the bloodshed. The fate of humanity is in your hands. </p>\n\r\nFEATURES (v0.0.7):\r\n<ul><li>Chapter 1 is complete</li><li>65 total pages\r\n  </li><li>20-25 pages in a single read-through\r\n  </li><li>Quest system works\r\n  </li><li>save/load system works*</li><li>17 achievements</li></ul>\n\n<p>*NOTE: Saving/loading does <strong><em>NOT</em></strong> work in the WEBGL build.  To access the full set of features, download the PC build.</p>", "metacritic": null, "released": "2018-08-08", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/0e1/0e1e1c94c5c380d98a8d706b374728f8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 120, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["Cloud Buchholz"], "genres": [], "publishers": [], "esrb_rating": null}