{"id": 155582, "slug": "morty-adventure-story-of-diving-cat", "name": "Morty Adventure: Story of Diving Cat", "name_original": "Morty Adventure: Story of Diving Cat", "description": "<p>Sebuah game platformer dengan 3 set lokasi berbeda, mengumpulkan ikan untuk menyelamatkan keluarga dari kelaparan, selamatkan diri dari monster laut dan hewan buas lainnya.</p>\n<p>Morty adalah seekor kucing penyelam yang berusaha mengumpulkan ikan-ikan di laut untuk menyelamatkan keluarganya yang sedang kelaparan karena dunia mengalami kekeringan parah akibat perang dunia ketiga yang menyebabkan nuklir. Sehingga, rantai makan mulai terganggu. Keberadaan ikan hidup yang tidak terkontaminasi hanya ada di laut Kalimantan dan ikan hidup tersebut akan dikumpulkan untuk dikembang biakkan. Perjalanan Morty untuk sampai ke sana tidaklah mudah, banyak rintangan yang harus dilaluinya mulai dari perjalanan darat, udara, hingga laut. Akhirnya Morty menggunakan keahliannya menyelam untuk mengumpulkan ikan-ikan hidup dan menyelamatkan keluarganya dari kelaparan. Sesampainya di daratan Kalimantan, pergolakan batin pun menghantui Morty. Ternyata, kucing-kucing di sana pun butuh bantuan karena mengalami kelaparan, sedangkan hanya Morty yang bisa menyelam. Akhir cerita pada Morty Adventure: Story of Diving Cat akan berakhir di sana. Kelanjutan cerita akan diteruskan pada episode setelahnya. Akankah Morty kembali menyelam untuk menyelamatkan penghuni Kalimantan? <br/> </p>", "metacritic": null, "released": "2018-07-17", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/eda/eda1dc03d2c2b1d3f2bcc0d69213b380.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 17, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["fadelsawi"], "genres": ["Adventure", "Platformer"], "publishers": [], "esrb_rating": null}