{"id": 155534, "slug": "bunny-flood", "name": "Bunny Flood", "name_original": "Bunny Flood", "description": "<p>You have angered the Great Lunar Rabbit, and now they have decided to curse you with a great flood! Quickly, you must build your town up to the moon so that you might plead your case to the god before your people are wiped out!</p>\n<p>Bunny Flood is a time-trial tycoon where the player must accumulate resources and build buildings in order to ascend faster than the oncoming flood, but be warned, costs rise as you build higher and higher!</p>\n<p>A game made by Team Brun:<br/>-Julien Lafontaine<br/>-Justin Loranger-Ahluwalia<br/>-Xavier Nolet<br/>-Caroline Prenoveau</p>\n<p>HOW TO PLAY</p>\n<ol><li>Build buildings by dragging them onto the map. Each building produces something different:<ol><li>Housing converts Carrots into Bunnies</li><li>Garden convert Bunnies into Carrots</li><li>Workshop converts Bunnies into Money</li><li>Market converts Carrots into Money</li><li>Temple converts Bunnies into Stay of Execution (pauses the flood timer)</li><li>Extensions are cheap but do nothing except increase your altitude</li></ol></li><li>Tap on a building to use the building's production menu. Tap on the input button to spend your resources and tap on the accumulated tokens to collect them</li><li>The water level rises every minute, disabling any buildings below the tide. If you have no buildings above water, it's game over! Your score is based on how high you get before the flood reaches you.</li></ol>\n<p>PRO TIPS</p>\n<ul><li>Buildings cost more the higher you place them!</li><li>Extensions are good for increasing your altitude without wasting resources on flooded buildings</li><li>Buildings have a capacity for how much they can hold; collect from them regularly so that they don’t get jammed!</li><li>Similar buildings stacked on top of each other give a capacity bonus!</li><li>When you build on top of a building, anything in the lower building gets locked; collect from a building before building on top of it!</li></ul>", "metacritic": null, "released": "2018-08-12", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/ecd/ecd886c7b8bb8a56db7d1fe19b594f7e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 20, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Trichotome"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}