{"id": 155586, "slug": "starlightriders", "name": "StarLightRiders", "name_original": "StarLightRiders", "description": "<p>StarLightRiders<br/></p>\n<br/>\n<p>【Features】<br/><br/>* 15 Action packed levels each with its own leaderboards.<br/>* 3 different Ships. Pick your favorite, with its unique features and play style.<br/>* Full ship upgrade system<br/>* Endless mode, How long can you last?<br/>* incredible electronic soundtrack.<br/><br/>【GamePlay Mechanics】<br/><br/>Slowdown - Remove your finger from the screen to enter Bullet time, good for planning where to move next or where to warp<br/><br/>Warp - Double tap on the screen to activate warp, warp will instantly move you to the tapped position, Each ship has 3 warps by default that can be upgraded.<br/><br/>Sheild - Activates Shield, Default is 6 seconds and can be upgraded.<br/><br/>Beam - Activates Beam, Default is 6 seconds and can be upgraded, Beam Ship doesnt have this secondary fire button.<br/><br/>Bomb - Only for the Beam Ship, You get 3 bombs that destory both enemies and bullets<br/><br/>Hyper - Collect Falling reactors (Green Squares) to charge the Hyperbar in the bottom left, once charged the enemies will enter a frenzy state and start shooting double bullets.<br/><br/>AutoFire - The ships shoot when the user is touching the screen by default, when autofire is turned off the graze mechanic is activated.<br/><br/>Graze Mechanic - Graze 100 Bullets to recharge Sheild.<br/><br/>Reactors - Green Squares, Reactors Will charge the Hyper Bar and Increase the score Multiplier, if a reactor is missed the multiplier is reset back to zero, Reactors will also be stored and can be spent on Ship Upgrades:</p>", "metacritic": null, "released": "2018-01-08", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/840/840b976939a09d5b9b68da90508ba93f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 160, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["LunarCitySeven"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}