{"id": 15567, "slug": "leviathan-starblade", "name": "Leviathan Starblade", "name_original": "Leviathan Starblade", "description": "Choose one of three Leviathan fighters and battle your way through hordes of murderous aliens!<br/><br/>Leviathan Starblade is a vertical scrolling shmups (shoot’em up), but along with the standard forward facing guns each player ship also comes equipped with a turret.  This turret can fire or swing your Starblade in any direction.  The Starblade can be used to cut down most enemy projectiles. Switch between guns and blades to combat your enemies, but you can’t activate both at once.  Use your weapons wisely because if you let too many enemies slip past then you lose the mission.  While using the Starblade might keep you from getting hit, it will also stop you from shooting down the aliens who are trying to invade the earth.  Choose your weapons and tactics wisely.<br/><br/><br/><br/><br/>- Choose between 5 different Starblades, each with different advantages  <br/>- Customize your weapon loadout by picking two of 9 guns with unique firing patterns and damages.  Switch between your guns at will.<br/>- 3 different ship designs with 76 different colors and patterns to chose from<br/>- 18 challenging missions and bosses<br/>- 18 custom music tracks that you can switch between<br/>- Controller support<br/>- There are no extra lives or drops, but you do heal slightly between missions<br/>- You cannot collide with normal enemies, but bumping into a boss and energy ships will cause damage<br/>- Some enemy ships can only be destroyed with your Starblade<br/>- All sprite, particle effects and music were made in-house <br/><br/><br/><br/><br/>        It is said that the old gods flew across the skies on fantastic beasts.  Whether they called them phoenix, anzu, bennu, simurgh,seraphim, suzaku,  anka, or dragons, every culture in the world had stories of flaming creatures soaring through the heavens.  Only they weren’t stories.  These were spacecraft.  And they were not driven by deities but by ancient beings caught up in an endless war.  For thousands of years these cosmic lords have fought each other in the great abyss of space with their fire breathing leviathans.  Now the balance has shifted.  The so-called gods who championed our sector have been dealt a terrible blow.  They cannot protect us any longer.  Now again as in ages past the conflict spirals towards Earth.  Once more our world is about to become the front line in the eternal struggle.  The dark horrors of myth and lore are coming.  <br/> <br/>        Once they found us easy prey, but this time we are ready.  No longer will man cower before the ancient evils who threatened our ancestors.  Never again will humanity be enslaved to the will of false deities so that we might be the fodder for their wars.  Now is our time.  We will take this fight to the heavens.  We will show the eldritch beasts and beings from all the hells of our religions and fables what has become of humanity in their absence.   And before we’re through space itself will boil with the blood of titans and demons.  <br/><br/>        Sons and daughters of Earth, prepare yourselves.  The gods and devils of your forefathers have returned to pass judgement.  Let's go kill them.", "metacritic": null, "released": "2016-11-03", "tba": false, "updated": "2019-09-17T13:24:55", "background_image": "https://media.rawg.io/media/screenshots/e3d/e3d45fab29570f0ac3aa25631f1601a9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 93}, "playtime": 3, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 208, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Drahcir"], "genres": ["Action"], "publishers": ["Drahcir"], "esrb_rating": null}