{"id": 15568, "slug": "last-hope-tower-defense", "name": "Last Hope - Tower Defense", "name_original": "Last Hope - Tower Defense", "description": "Zombie Tower Defense: Join the ongoing war, in an open world, against the zombie horde, scavenging raiders and other threats roaming the wasteland! Choose between multiple powerful heroes all with unique epic gear and skills! With the wide variety of towers you can create your own perfect strategy. Enjoy a visually stunning  tower defense game in full 3D!Game Features<ul><li>Over 140 levels which will challenge your defense and strategy. Find the reason behind the zombie invasion, take out the raider leader scavanging the land or fight in the arena for coins and glory!<br/></li><li>8 Special Heroes to choose between, the precious Princess, mighty Barbarian, mysterious Scout, gun crazy Mechanic, support Soldier, Mech warrior, experimenting Scientist or the righteous Sheriff. <br/></li><li>12 Different Towers to defend yourself with, each with a unique research tree to make them even more powerful! Pierce the zombies with arrows from an Arrow Tower, blow them to pieces with a Mortar Tower or electrify them with a Tesla Tower.<br/></li><li>Explore the wasteland and encounter over 50 types of enemies. If that's not enough,  go up against 5 Boss monsters that are scattered across the map waiting to rush you!<br/></li><li>Mighty Hero skills and Epic god skills, destroy the undead with one heavenly strike or shake the zombies by moving the earth.<br/></li><li>Monster Tome, useful for finding your enemies weaknesses!<br/></li><li>Many hours of gameplay including ingame Achievements with rewards and also unique rewards for completing levels and different challenges.<br/></li><li>Three different difficulty settings: Normal, Hard &amp; Nightmare! Challenge yourself and earn extra coins and XP by doing so! Good Luck!<br/></li><li>Endless mode, Time to show the world who is the greatest!</li></ul>", "metacritic": null, "released": "2016-04-13", "tba": false, "updated": "2022-09-11T06:08:15", "background_image": "https://media.rawg.io/media/screenshots/270/2706930af34ec2288910a078b4f79608.jpg", "website": "https://www.jesoftware.se", "rating": 1.0, "rating_top": 1, "added_by_status": {"yet": 4, "owned": 113, "toplay": 1, "dropped": 1}, "playtime": 2, "achievements_count": 27, "ratings_count": 6, "suggestions_count": 330, "game_series_count": 0, "reviews_count": 6, "platforms": ["PC"], "developers": ["JE Software"], "genres": ["Adventure", "Strategy", "Indie"], "publishers": ["JE Software"], "esrb_rating": null}