{"id": 155604, "slug": "penny-and-pauls-adventures", "name": "Penny and Paul's Adventures", "name_original": "Penny and Paul's Adventures", "description": "<p>Join Penny the Penguin and her good friend Paul the Polar Bear on a puzzling adventure through the Antarctic. It might start as a simple fishing trip but there will be calamities to conquer and devious traps to defeat all orchestrated by the arch fiend himself, Doktor Diabolik.</p>\r\nWhat's it like?\r\n<p>You know that bit in a JRPGs where you go to the ice temple and you have to get across the room by sliding around and bumping into stuff?  It's like that.  To the Max. <em><strong>Extreme</strong></em>.  Every variety of possible thing that could change your direction or block your path has been chucked in.  And there's plenty of banter between the two main characters.  Bit of 4th wall breaking here and there.  It's good.  It's good.  I like it.</p>\n<p>A bit slow to get going in terms of difficulty but it really ramps up by the end.  The challenge mode, where you have to complete levels whilst being restricted in the number of times you can move in a particular direction is, dare I say it, pretty <em>hardcore </em>as puzzle challenges go.</p>\n<p>It's good.  I'd play it.</p>\n<p>Oh yeah last thing, the inter-story art is done by award winning comic book artist Will Pickering.  The art is  really good and they are all in a easy to find folder if you want some desktop backgrounds or something.</p>\n\r\nHistory\r\n<p>I wrote this cute little puzzle game about nine years ago.  I'd started reworking the game to take advantage of everything I'd learnt since then, both in terms of game design and technology, but a catastrophic hard disk crash and improper use of version control means I've lost too much (in particular the level editor and level solver) so I've decided to re-release the original  as pay as you like.</p>\n<p>This was only ever tested on Windows XP but it seems to run fine on my Windows 7 machine so hopefully everything will be grand.</p>", "metacritic": null, "released": "2017-11-25", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/b03/b03685f13e1c5f6303a99605e70f79cc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 7, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["geometric-games"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}