{"id": 155741, "slug": "ipong-the-game", "name": "iPong: The Game", "name_original": "iPong: The Game", "description": "<p>Space, deep space. On Earth would be the year 2750 but planet Earth is \r\nno longer a liveable place since at least 5 centuries ago when the \r\nremaining of humanity started to explore the Universe to find new \r\npossibilities and new chances of surviving. Universe is now populated \r\nwith several kinds, the most notables:<br/><br/>- Humanoids: was the first\r\n breed born as a result of a mix between the first human who left Earth \r\nand the Novars, an already extinct kind. They are more evolved than \r\nhumans but as slow as humans.<br/>- Trolls: always sneaky and unreliable \r\nthe troll kind is often trying to reach what they want using any kind of\r\n shortcut, they are quite fast but they have limited intelligence.<br/>- \r\nManimals: this kind was born hundred years before humanoids and they are\r\n a mix between terrestrial animals (they left way before humans \r\nfollowing their better instinct) and an unknown kind. They are strong, \r\nfast and peaceful as long as you don’t step in their territory.<br/>- \r\nSkulls: the worse of the space breeds but also the strongest. They are \r\nbad, angry, powerful and they pretend to be immortal and they are, \r\nunfortunately, the current leaders of the Universe. They visited Earth \r\n4000 years ago by the ancient Egypt but they didn’t find it lucrative \r\nenough and they left.<br/><br/>The hierarchy between all these kinds is \r\ngiven in only one way: throughout the mighty Game of iPong. Since 2200 \r\niPong determines who is the strongest in space and who’s going to lead \r\nthe Universe. iPong is a space game who developed in time as well as the\r\n video game Pong developed on Earth in the video game era: the two \r\ncompetitors command a flying paddle hooked to a rail at the side of a \r\nspace arena where a small comet is waiting for them: the comet bounces \r\naround the arena and the competitor needs to protect his side of the \r\narena and, at the same time, scoring the comet at the other side where \r\nthe opponent plays. The arena is full of special gas clouds and \r\nasteroids and these objects give the competitor the chance to improve \r\nhis flying paddle in terms of size, speed and weapons. An iPong game can\r\n be a very cruel game and it is no surprise at all, in the end the \r\nleading role of the Universe is what iPong is played for.</p>", "metacritic": null, "released": "2014-08-19", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/7b1/7b167cd6369c0a3095dda743d0b2d104.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 110, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["solowebnv"], "genres": ["Action"], "publishers": [], "esrb_rating": null}