{"id": 155706, "slug": "fox-project-orange-raposa-projeto-laranja", "name": "Fox: Project Orange (Raposa: Projeto Laranja)", "name_original": "Fox: Project Orange (Raposa: Projeto Laranja)", "description": "<p>(Text in english below /Texto em inglês abaixo)</p>\n<p>Production start date: August 20, 2016</p>\n<p>Available game languages:</p>\n<p>Synopsis</p>\n<p>         A great old power, initiated from a group of human beings of the metal era, came once again to try to dominate the world, it dominated 2 countries and now wants to dominate Brazil! A modified and magical fox next to some friends will Try to defeat this villain once and for all.</p>\n<p>(The plot of the game can be modified during the time in the state of development of it, but, will always have the same concept)</p>\n<p>Things I want to put in the game</p>\n<p>- Graphics: The scenery will be a mix of 3D graphics and handmade drawings.</p>\n<p>- You can: walk, run, jump, crouch, crouch, lie down, eat, fly, swim up and under water, attack, push, pull, squeeze, cut and dig.</p>\n<p>- You will have 4 'powers' that will be improved with points of the game.</p>\n<p>Agility: You can make your moves faster.</p>\n<p>Strength: You can give stronger attacks and your body will be heavy to use in some puzzle.</p>\n<p>Eagle: You have created wings and can fly and give air attacks.</p>\n<p>Machine: Your wounds will heal for a while and your resistance will double.</p>\n<p>- Have to eat and drink to recover life, will have several types of food (some give something special or bad), example: Fruits, soft drinks, beer, meat ...... alcoholic drinks have left you drunk.</p>\n<p>- The character's vision will be in a 2D type, but the character would move like a 3D. During the game in some scenarios the camera changes completely.</p>\n<p>- You will have an inventory to organize and a skill tree to enhance your fox.</p>\n<p>- There is interest in adding a small destruction of scenery and graphic violence.</p>\n<p>- Your fox will have feelings, will feel anger, sadness, anxiety and other emotions, each will benefit or worsen the state of your fox during the game, example: Feeling angry, will increase your attack damage and energy to jump and run, feel sadness will cause the opposite.</p>\n<p>(Over time I will modify these ideas, add new ones or delete them)</p>\n<p>(Texto em português abaixo/Text in portuguese below)</p>\n<p>Começo de produção: 20 de Agosto de 2016</p>\n<p>Linguagens do jogo disponíveis: PT-BR</p>\n<p>Sinopse</p>\n<p>         Uma grande potencia antiga,iniciada de um grupo de seres-humanos da era do metal,voltou mais uma vez para tentar dominar o mundo,ela dominou 2 países e agora quer dominar o Brasil!.Uma raposa modificada e mágica junto a alguns amigos irão tentar derrotar esse vilão de uma vez por todas.</p>\n<p>(O enredo do jogo pode ser modificado durante o tempo no estado de desenvolvimento dele,mas,sempre terá o mesmo conceito)</p>\n<p>Coisas que quero colocar no jogo</p>\n<p>- Gráficos: O cenário será uma mistura de Gráfico 3D e desenhos feitos a mão.</p>\n<p>- Você poderá: andar,correr,pular,agachar,andar agachado,deitar,comer,voar,nadar em cima e em baixo d'água,atacar,empurrar,puxar,apertar,cortar e cavar.</p>\n<p>- Você terá 4 'poderes' que serão melhorados com pontos do jogo.</p>\n<p>Agilidade: Você poderá fazer seus movimentos com mais velocidade.</p>\n<p>Força: Você poderá dar ataques mais fortes e seu corpo ficara pesado para usar em algum puzzle.</p>\n<p>Águia: Você criara asas e poderá voar e dar ataques aéreos.</p>\n<p>Maquina: Seus ferimentos iram se curar por um tempo e sua resistência ira dobrar.</p>\n<p>- Precisara comer e beber para recuperar vida,vai ter vários tipos de alimentos(alguns dão algo de especial ou ruim),exemplo: Frutas,refrigerantes,cerveja,carnes......bebidas alcoólicas deixaram você bêbado.</p>\n<p>- A visão do personagem será em um tipo 2D,mas o personagem se movimentara como um 3D. Durante o jogo em alguns cenários a câmera muda totalmente.</p>\n<p>- Você vai ter um inventario para organizar e uma arvore de habilidades para aprimorar a sua raposa.</p>\n<p>- Há interesse em adicionar uma pequena destruição de cenário e violência gráfica.</p>\n<p>- Sua raposa vai ter sentimentos,irá sentir raiva,tristeza,ansiedade e outras emoções,cada uma vai beneficiar ou piorar o estado de sua raposa durante o jogo,exemplo: Sentir raiva,vai aumentar o seu dano de ataque e energia para pular e correr,sentir tristeza vai causar o ao contrario.</p>\n<p>(Durante o tempo irei modificar essas ideias,adicionar novas ou exclui-las)</p>", "metacritic": null, "released": "2018-07-30", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/c01/c0171552c7e116dad67fa72782146969.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 178, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ericksantossouza"], "genres": ["Adventure", "Platformer"], "publishers": [], "esrb_rating": null}