{"id": 15586, "slug": "ostrich-island", "name": "Ostrich Island", "name_original": "Ostrich Island", "description": "Volcano erupts! All archipelago residents have been evacuated, but one ostrich had his head in the sand. Can you help him escape and rejoin his family?<br/><br/>The game is the unique adventure/exploration/RPG mix where you are playing as an Ostrich! Walk into tropical paradise, rush through storm madness, explore the deepness of the ocean and behold the darkness of underground. <br/><br/><br/><br/>Each island contains many secret achievements, collectibles and bonuses needed to be discovered! Wear hats, find the photo camera and take photos, catch butterflies, kick all the stuff around you, discover secret islands alone or with your friend and much, much more. <br/><br/>Don't be an ostrich, play Ostrich!<br/><br/>Gain experience points, level up and unlock new skills and abilities! Finished it once? More challenging Game+ is waiting for you! Visit the Nest to stroll around the stuff you have discovered in your journey and learn some stories behind Ostrich's family! Play together with your friend, helping or kicking each other, stealing some score points! Your Ostrich journey starts now!<br/><br/>Feel creative?<br/><br/>We are hearing you! Create new skins for your ostrich or whole islands and share it with community using Workshop! Or download lots of new stuff created by other users to satisfy your passion for style! <br/><br/><br/><br/>", "metacritic": null, "released": "2015-01-08", "tba": false, "updated": "2024-03-14T10:16:48", "background_image": "https://media.rawg.io/media/screenshots/48d/48d2f6377c8a05b17acb588b450d532d.jpg", "website": "http://www.medungeon.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 99, "beaten": 1, "toplay": 3, "dropped": 3, "playing": 1}, "playtime": 3, "achievements_count": 84, "ratings_count": 4, "suggestions_count": 410, "game_series_count": 0, "reviews_count": 4, "platforms": ["macOS", "PC", "Linux"], "developers": ["MeDungeon"], "genres": ["Adventure", "RPG", "Casual", "Indie"], "publishers": ["MeDungeon"], "esrb_rating": null}