{"id": 155836, "slug": "feral-felines", "name": "Feral Felines", "name_original": "Feral Felines", "description": "<p>In Feral Felines you're shown a small part of a picture and you need to find where that part is in the larger picture and click it. </p>\n<p> The part of the picture you're shown gradually becomes smaller as the game progresses.\r\n  </p>\n<p> For an extra challenge you can play expert mode where the part of the picture you're shown can be flipped horizontally or vertically.\r\n  </p>\n<p>You're allowed a limited amount of wrong clicks, however, you can skip a particular image if you're struggling to find it - you can skip up to 5 images per level. </p>\n<p> There's a \"sliding squares\" games every 6th level.  Move the squares around until you complete the picture.   To make this game easier you're allowed 3 or 5 free swaps where you can choose any 2 squares anywhere and swap their positions. The amount of squares that make up the sliding picture gradually increase as the game progresses.  You can skip these games if you don't want to play them or if you want to play them later.    </p>\n<p>You can switch between casual and expert mode and continue where you left off. You can replay any level once you've played it or skipped it.\r\n   \r\n  </p>\n<p>The game consists of 120 levels of which there are 20 sliding square levels and 100 hidden object levels. There are 20 different background pictures.   The squares you must find and the layout of the sliding games will be different each time you play. <br/></p>\n<p><strong>System Requirements:</strong>  This game is windows 10 only.  It needs just the basics of system resources - worked fine on 504mb ram, 1.8 GHZ processor, 256mb graphics card.<br/></p>\n<p>This game is packages as a full installation that will install the game and create a desktop icon for you. There's also an uninstaller.<br/></p>", "metacritic": null, "released": "2018-04-10", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/899/8999e2a2719e27c022379ca93905958c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 267, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Evolutionary Games"], "genres": [], "publishers": [], "esrb_rating": null}