{"id": 155969, "slug": "children-coloring-book", "name": "Children Coloring Book", "name_original": "Children Coloring Book", "description": "<p>**** Children Coloring Book is a coloring application, an easy to use, fun and creative powerful app for children for 1 years and up ****</p><p>- Kids Coloring Book App allows kids to color shapes and objects and cartoon like tom and jerry &amp; mickey mouse . Its basic App for kids to learning how to color objects with different coloring options like pencil, paint brush, crayon colors and bucket fill to color whole area of the picture. Its a creative coloring activity. <br/><br/>.- An app can be used at the playschool, preschool, for fun as an educational drawing game. For girls we have hearts &amp; dresses &amp; Mermaids and flowers we prepared. Coloring book for boys are diggers, vehicles , dinosaurs and blank page doodling. The biggest attraction though is colouring animals, that make real sounds!</p><p>- As parents, we know how important it is to have the right applications installed for our kids to use. Before we started working on Kids Coloring Book, we were using many different applications but nothing we found fully met our expectations. Our application helps kids develop motor skills and learn color combinations. It can also help your kids learn words such as animal names.</p><p>- How to play:<br/>- Easy to learn and to control: choose the color to use from the left palette,<br/>choose the eraser to remove the colors, change the brush size.<br/>- Navigate through all available animated coloring books. Pick one to begin coloring, including:<br/>* Animals Book: Contains some Animal sketch Such as Dog &amp; Cat &amp; ...........<br/>* Transport Book: Contains some sketch: chuggington trains &amp; cars........<br/>* Alphabets Book: Contains some sketch of Alphabet A.B.C<br/>* Girls book : Contains some sketch of princesses and Mermaids like barbie and alice ..........<br/>and more books</p><p>Children Coloring Book features:<br/>★ Realistic finger colouring book for kids that requires precision and practice. <br/>★ Develops fine kids motor skills in creative way.<br/>★ 12 drawing categories: Halloween, colouring book for boys, colouring book for girls, animals, number &amp; letters, shapes, christmas, princess, dinosaurs, cosmos and potluck.<br/>★ Available for all screen resolutions and devices, including tablet device as kindle and samsung !<br/>★ Simple and intuitive, your baby will have lots of fun for hours!<br/>★ Multiple brushes and paint bucket<br/>★ Colouring book free contains over 100 illustrations as free colouring pages <br/>★ Kids Engaging, age-appropriate and skill-appropriate topics<br/>★ Store completed drawings in the kids colouring books gallery or share them as greeting card.<br/>★ Age Level: 1+<br/>★ Colouring book HD - the app adjusts to screen sizes of all devices including tablet<br/>★ Free updates</p><p>- We have another collection having 200 pictures of various kinds, including girls, flowers, animals, princess and Christmas etc. just enter in our store and will find it.</p><p>- Enjoy!<br/>For any comments or suggestions, please send an e-mail. Thanks!.</p>", "metacritic": null, "released": "2016-11-10", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/951/9518adc2c39f5342fe892476eff90d34.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 45, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["midooow"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}