{"id": 15595, "slug": "mad-father", "name": "Mad Father", "name_original": "Mad Father", "description": "<p>On the eve of the anniversary of her mother’s death, Aya reflects on the past. Sad, lonely, and desperate for something to help her relive happier times, Aya asks her father if they can do something special in memory of her lost mother. Aya’s father agrees and puts her to bed, promising to make tomorrow a better day. But this fleeting glimpse of light is quickly extinguished when Aya is jolted from her slumber by the sound of her father screaming. She jumps out of bed and runs to find her father, only to find the once-peaceful and somber home now littered with corpses and other horrors. Will Aya end up reuniting with her mother in the most horrific way imaginable at the hands of the undead hordes? Will she manage to escape the manor together with her father’s assistant, Maria? Or will she somehow manage to save her father from the unknown terrors awaiting her around every turn?<br />\nMad Father is an exploration-based horror-adventure game, created by Japanese developer sen.<br />\nAs Aya, the main character, explore your family’s sprawling manor while making use of the items you find along the way and doing whatever you can to survive the night.<br />\nAyaThe young heroine of the story. She consciously avoids getting too close to her father&#39;s &quot;research&quot;, and does her best to remain blissfully unaware of what her father’s work may entail...<br />\nFather Aya&#39;s father. Night after night, he performs horrific experiments in the basement of the family mansion.<br />\nMotherAya&#39;s late mother. She passed away exactly a year before the story begins.<br />\nMariaAssistant to Aya&#39;s father.<br />\nOgreA mysterious salesman who suddenly appears before Aya, seemingly out of nowhere...<br />\nBlonde-haired YouthA mysterious boy who guides Aya along.<br />\nChainsawCan be used to destroy objects made of wood, etc.<br />\nCommand-based actionInput the key/button commands displayed onscreen to perform various actions.<br />\nGemsCrucial items in the game which can be found hidden in various places.<br />\nFinding all of them will be tough, but well worth the effort...<br />\nMultiple endingsThere are three possible endings to the game.<br />\nThe ending you are shown will depend on your actions.<br />\nCorpsesUndead spirits out to attack Aya. If caught, she will gradually lose stamina, and the game will end.<br />\nCorpses armed with weapons can kill Aya with a single blow, so be careful.<br />\nI hope you enjoy this enhanced version of the original free game, featuring an array of new content, including:<br />\n-Enhanced graphics<br />\n-Newly added events, etc.<br />\nCheck the news for detailed info on updated content!<br />\nhttp://steamcommunity.com/games/483980/announcements/detail/990053830259306529</p>", "metacritic": null, "released": "2012-12-10", "tba": false, "updated": "2024-03-23T11:25:19", "background_image": "https://media.rawg.io/media/screenshots/600/60073741ea81d055761fb702743e95f7.jpg", "website": "", "rating": 3.91, "rating_top": 4, "added_by_status": {"yet": 18, "owned": 229, "beaten": 53, "toplay": 17, "dropped": 3, "playing": 2}, "playtime": 4, "achievements_count": 27, "ratings_count": 45, "suggestions_count": 289, "game_series_count": 0, "reviews_count": 46, "platforms": ["PC"], "developers": ["sen"], "genres": ["Adventure", "Indie"], "publishers": ["AGM PLAYISM"], "esrb_rating": null}