{"id": 15591, "slug": "lex-mortis", "name": "Lex Mortis", "name_original": "Lex Mortis", "description": "<strong>Lex Mortis</strong> is an open-world horror game set on a fully explorable island. <br/>The game’s atmosphere is directly affected by the time of day. During the daytime you will study the island and it’s mysteries. <br/>But at night the enemies reveal themselves, and the worst nightmare becomes real! <br/><br/><br/><br/><br/><br/>June 28, 2017, you return to your birthplace, Berdwood island, which is located in Northern Europe.<br/>After spending a night on the island, you will discover that there aren't any living people, despite the fact that the population of Berdwood is about 2000.<br/>You will stumble upon the frightening reality of what exactly happened to the inhabitants of Berdwood. <br/>Eventualy, you will get a difficult choice, which will influence on the fate of inhabitants of the island Berdwood. <br/>The game has two endings.<br/><br/><br/><br/><br/><br/>Berdwood island is a fictional island, which is located in Northern Europe. Berdwood island is the site of action of the game's story. <br/>And you don't need to pass the main story as quickly as possible. The island is completely open from the beginning of the game, and it's filled with the history of its inhabitants. This island is quite big. It contains: forests, fields, abandoned villages, mines, mountains and more. There are also working vehicles which will help you to navigate faster through the island. <br/><br/><br/>Berdwood island map:<br/>", "metacritic": null, "released": "2015-02-09", "tba": false, "updated": "2022-09-29T23:49:11", "background_image": "https://media.rawg.io/media/screenshots/4a7/4a77fa8af54d66c34329905b515b7585.jpg", "website": "", "rating": 1.67, "rating_top": 1, "added_by_status": {"yet": 1, "owned": 143, "beaten": 2, "dropped": 2}, "playtime": 3, "achievements_count": 0, "ratings_count": 9, "suggestions_count": 391, "game_series_count": 0, "reviews_count": 9, "platforms": ["PC"], "developers": ["Dennis Esie"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Dennis Esie"], "esrb_rating": null}