{"id": 15600, "slug": "grandpas-table", "name": "Grandpa's Table", "name_original": "Grandpa's Table", "description": "There is a room with an old table. You don’t remember who designed it and with what purpose, but you know that it hides a game - a game with a secret. A game that must be played to save memories from fading out… <br/>Sit comfortably and discover the mysterious world of Grandpa and his memories - solve relaxing puzzles, collect mementos and explore the history of Grandpa’s life. <br/><br/>Grandpa’s Table is a very atmospheric puzzle game where you need to group tokens of various colors. In every level there are three stars, which can be covered with tokens to unlock bonus puzzles. . These puzzles are a little harder to solve…  but if you solve them you will be awarded with a memento which will appear in the drawer. Each memento holds a very short story, a memorial from Grandpa’s life. Will you uncover his story?<br/><br/><br/><br/>* Relaxing classical logic game with beautiful 3d artwork<br/>* Solve 150 puzzles and collect memories to uncover the story of grandpa's life<br/>* Unique 3d interface, use the radio to turn off the music, click on the flags to change the language, open the drawer to check collected mementos (achievements).<br/>* Discover all the gameplay elements (keys, gates, traps, teleporters, etc.)<br/>* Enjoy beautiful music tracks<br/>* Find mini game that's hidden in the room<br/>* Each memento hides couple sentences with grandpa's story. (mementos are very similar to achievements).<br/><br/>---------------------<br/>Made using Blender, Gimp, Inkscape, libGDX, Ubuntu and Universal Tween Engine.<br/>---------------------", "metacritic": null, "released": "2016-05-24", "tba": false, "updated": "2019-08-28T22:11:28", "background_image": "https://media.rawg.io/media/screenshots/e37/e37a1e542c9d2bc59be5bcaaa83e2254.jpg", "website": "http://sulech.com/kivano/grandpas-table-3d/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 18, "beaten": 1}, "playtime": 2, "achievements_count": 37, "ratings_count": 1, "suggestions_count": 196, "game_series_count": 0, "reviews_count": 1, "platforms": ["macOS", "PC", "Linux"], "developers": ["Kivano"], "genres": ["Casual", "Indie"], "publishers": ["Kivano"], "esrb_rating": null}