{"id": 156022, "slug": "star-fall", "name": "Star Fall", "name_original": "Star Fall", "description": "<p>Star Fall is a lovely, relaxing game about catching stars as they fall from the night sky! Play as an adorable stuffed bear in a dreamy world where the stars are within your reach! Watch the spinning stars as they drift toward the clouds on which you stand, and score points by catching them in your net before they hit the cloud. Be careful, though! Some stars are large and magical, and if you miss these, it's game over!</p><p>CONTROLS:<br/>Move left and right with the left and right arrow buttons, and pick up falling stars with your net (they must land in your net to be caught; just hitting the bear isn't good enough!). They game gets faster over time, and the amount of points you earn per star increases over time, also. The goal is to get the highest score you can!</p><p>Star Fall was made over the month of June 2016, and is my my seventh game as part of the #1GAM event. This time, I decided to go in a different direction with the difficulty this game has to offer. Star Fall is an intentionally easy game that cares more about relaxing you than giving you a serious challenge. The game is simple and easy to control, and features lovely art by the wonderfully talented calmcalling that really brings the whole thing together! Check out her gallery in the link above and send some thanks her way for making this game possible! :)</p><p>If anyone out there enjoys the game, or if you get a great score and want to share it, post below in the comments! As always, I'm eager to hear from any players of my games :) Hope you enjoy Star Fall! See you next time!</p>", "metacritic": null, "released": "2016-06-29", "tba": false, "updated": "2019-08-28T23:21:57", "background_image": "https://media.rawg.io/media/screenshots/c7f/c7f67b3a4e0454dc89944ae62f3c19c3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 18, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["HellaMagellan"], "genres": [], "publishers": [], "esrb_rating": null}