{"id": 156171, "slug": "poppy-vs-the-night", "name": "Poppy vs the Night", "name_original": "Poppy vs the Night", "description": "<p>\r\n\tPoppy vs the Night was made in 72 hours for the Ludum Dare game jam, and was originally released in August 2013. It's a game about a little girl fighting back against here nightmares while she sleeps. You can ride your robot, shoot water cannons and build defences from Lego and teddy bears. Defeat the dream beast to wake up and end the nightmare.\r\n</p><p>\n<strong>WHY WE MADE IT</strong><br/>\r\n\t This game was made for Ludum Dare 27, and the theme was 10 Seconds. We took a very literal approach to this, and the game flips quickly between different gameplay types every 10 seconds, and includes a shooting section, defence section and boss section. You have to defeat the boss over multiple visits to win the game. We had fun creating characters in the dream based on all the items in Poppy's bedroom on the main title screen.<br/>\n</p><p>\n<strong>CONTROLS &amp; HELP</strong><br/>\r\n\t WASD Move, Mouse to Aim, Left-Click to Shoot. During the build phase, use Left-Click to place barriers and Right-Click to place Turrets.<br/>\n</p><p>\r\n\tYou just have to keep going round through the various sections until you wear down the health of the boss character. Try to grab the shotgun or the water cannon guns, and avoid the laser as we accidentally made it a bit rubbish. During the build phase the enemies will come from the left and right of the screen, try to create barriers around you but don't block the shot of the turrets\r\n</p>\n<strong>JAMES</strong>\n<strong>EDGE</strong>\n<strong>ADAM</strong>\r\n\t\r\n\t\r\n\t\t \r\n\t\r\n\r\n\r\n\t\r\n\t\t \r\n\t\r\n\t\tArt, Design<br/>\r\n\t\t &amp; Animation\r\n\t\r\n\t\r\n\t\tGameplay,<br/>\r\n\t\tSound &amp; Music\r\n\t\r\n\t\r\n\t\tArt, Design<br/>\r\n\t\t &amp; Animation", "metacritic": null, "released": "2016-11-09", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/532/532eeaa1c961104057f2438c13dd5756.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 17, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Second Dimension Games"], "genres": ["Action"], "publishers": [], "esrb_rating": null}