{"id": 15630, "slug": "brief-karate-foolish", "name": "Brief Karate Foolish", "name_original": "Brief Karate Foolish", "description": "<strong>Here comes a new epic of live action fighting game!!</strong><br/>With 60fps smooth action, sexy and deadly guys fly into air and bounces their flab!<br/><br/><br/><br/><strong>Legendary underwear \"Black Briefs\"... </strong><br/>It is said that the owner of the briefs rule the world.<br/><br/>Now, Brief Fighters from all over the world gathered and underground tournament for the Black Briefs has started.<br/>Defeat mighty enemies, and get the legendary briefs!<br/><br/><br/><strong>S.Tamade</strong><br/>A martial artist who pursuits strength.<br/>To fight with stronger enemies, he decided to join the tournament.<strong>Tamano Hikari</strong>　<br/>A wannabe sumo wrestler who always loses match after cheating.<br/>To achieve upset win, he joined the tournament.<strong>Nininga-Shimaru</strong>　<br/>A successor of the strongest school of Ninjitsu clan.<br/>He looks like a berserker who brandishes cooking knives, but in his mind, he is a pure susceptible man.<strong>Kuranado</strong>　<br/>A famous assassin who arrived to assassinate B.Zoro, who is organizer of the tournament.<br/>He can breeze light bullets from his mouth, but can’t control them(so wearing mask)<br/>Lover of anime figures and dolls.<strong>Stretch</strong>　<br/>A precocious boy whose policy is health 1st, and underwear 2nd. <br/>After trying various healthy items, he found briefs are the best(just became exhibitionist)<br/>He joined the tournament to display his beauty to the world.<strong>Garigari-kun</strong><br/>A examinee who studied too much and lost his sanity.<br/>He arrived at the tournament mistaking it examination(and still not noticed where it is)<strong>C.Gomadare</strong><br/>A suspicious person who call himself French and Japanese half.<br/>To display his beautiful(he thinks so) body, he joined the tournament.<strong>Bonsoir \"Nya\" Nekomimi</strong>　<br/>A wild boy who has superb athletic ability.<br/>Make a fetish of Nekomimi(cat ears) and participated the tournament to be a superstar of Nekomimi.<strong>B. Zoro</strong><br/>The emperor of the darkness who wears Black Briefs.<br/>He has extreme power and ruling over the world.<br/><br/><br/><br/><ul><li>9 characteristic, deadly,  and beautiful Brief fighters.<br/></li><li>Finish moves by command.<br/>Hands, Legs, breast, and Hips! In the brief Karate, every part of the body are weapons!<br/></li><li>Funny and stupid movement of the live action characters.<br/></li><li>Support (local) multi player.<br/></li><li><strong>Free for all Briefs Lovers!</strong><br/><br/><br/><br/><br/></li><li><strong>This game is optimized for good old Windows 98, and may have some compatibility issues running under Windows 8 or 10. <br/>Unfortunately we are not able to offer any official support for them. <br/>We apologise for the inconvenience.</strong></li></ul>", "metacritic": null, "released": "2016-11-18", "tba": false, "updated": "2019-09-17T10:23:49", "background_image": "https://media.rawg.io/media/screenshots/07f/07fc691f1ccd08c3da6e3ce18a74ff51.jpg", "website": "", "rating": 3.73, "rating_top": 5, "added_by_status": {"yet": 11, "owned": 313, "beaten": 5, "toplay": 2, "dropped": 8}, "playtime": 1, "achievements_count": 0, "ratings_count": 11, "suggestions_count": 364, "game_series_count": 0, "reviews_count": 11, "platforms": ["PC"], "developers": ["D.C.S"], "genres": ["Action", "Casual", "Indie"], "publishers": ["Henteko Doujin"], "esrb_rating": null}