{"id": 15645, "slug": "skyway", "name": "Skyway", "name_original": "Skyway", "description": "Skyway's Dash mechanic allows you to reach places not normally accessible with standard movement controls. For more height, you can grab ledges and climb your way to victory! Combining these two controls gives you total control over the movement of your character, and you'll be expected to use them in unexpected ways to score a fast time.<br/><br/>The world is somewhat hostile, and you'll be dodging missiles, avoiding turrets, and eliminating drones to reach the goal.<br/><br/><br/><ul><li> Challenge your brain with a series of puzzles designed to stump you<br/></li><li> Test your reflexes by avoiding enemies, timing jumps, and grabbing ledges<br/></li><li> Support for the XBox One and Playstation 4 Controllers<br/></li><li> Native versions for Mac OSX, Windows, and Linux<br/></li><li> 4k resolution support and runs over 60FPS<br/></li><li> A comprehensive statistics system allows you to compete for death-less runs, fastest runs, and any other self-imposed challenge</li></ul><br/><br/>You find yourself thrown into a strange world, where your only friend is a robotic companion who's quickly running out of battery. You must find a new power source to keep your drone, and your sanity, alive. A threatening presence lurks over the land, watching your every move. Defeat the menace and solve the mystery to discover your origin!", "metacritic": null, "released": "2016-12-02", "tba": false, "updated": "2019-08-28T22:11:26", "background_image": "https://media.rawg.io/media/screenshots/c28/c281372114eae12cbd5f21297adb2dde.jpg", "website": "http://www.indiedb.com/games/skyway1", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 156, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC", "Linux"], "developers": ["RobProductions"], "genres": ["Action", "Casual", "Indie"], "publishers": ["RobProductions"], "esrb_rating": null}