{"id": 15648, "slug": "action-alien", "name": "Action Alien", "name_original": "Action Alien", "description": "<strong>Jump into the action and battle your way through hordes of aliens from canyon deserts to tropical islands inside fully destructible environments !</strong><br/><br/>Complete the <strong>3 large open world maps</strong> guided by story lines set in different places to unlock upgraded weapons and perks for achieving the maximum fire-power, or play the survival mode in <strong>2 survival maps</strong> and try to resist against aliens for as long as possible !<br/><br/>Fight <strong>different species of aliens</strong> with bosses by using different tactics and weapons to defeat them in a <strong>fully destructible environment</strong> as much by the player as by the aliens.<br/><br/>Grab and upgrade the <strong>8 weapons</strong> of the game, ranging from the revolver, the tommy gun to the grenade launcher with each one having 2 levels of upgrade to increase their efficiencies. Take advantage of the <strong>perk system</strong> using credits points earned during playing to increase health, speed, jumps, melee kicks, etc...<br/><br/><strong>19 achievements</strong> to unlock, with support of <strong>Steam trading cards</strong> and Steam cloud to keep all progress available on any computer. Also playable with Xbox-like gamepads and in Ultra HD (4K).<br/><br/><strong>Action Alien</strong> was formely known as The Alien Wasteland, here is a blog post explaining the reasons of the change : http://steamcommunity.com/games/382080/announcements/detail/840296458592791633", "metacritic": null, "released": "2015-06-26", "tba": false, "updated": "2023-08-23T13:29:36", "background_image": "https://media.rawg.io/media/screenshots/5fc/5fc5c22e34d502858dfb80cdf9cdea29.jpg", "website": "http://actionalien.com", "rating": 1.25, "rating_top": 1, "added_by_status": {"yet": 4, "owned": 284, "beaten": 2, "dropped": 1}, "playtime": 3, "achievements_count": 19, "ratings_count": 8, "suggestions_count": 337, "game_series_count": 0, "reviews_count": 8, "platforms": ["PC"], "developers": ["Devdan Games"], "genres": ["Action", "Adventure", "Casual", "Indie"], "publishers": ["Devdan Games"], "esrb_rating": null}