{"id": 1565, "slug": "fancy-pants-adventures", "name": "Fancy Pants Adventures", "name_original": "Fancy Pants Adventures", "description": "<p>Race through dense forests, underwater caverns, and pirate ships in search of your kidnapped sister in this epic adventure. Stomp, kick, and slash your enemies with 40 melee weapons and an arsenal of moves. Battle Pirates, Ninjas, a Giant Penguin and more!<br />\nFeatures:<br />\n- Plenty of levels filled with secret rooms<br />\n- Parkour style gameplay<br />\n- Many challenges and races.<br />\n- Unlockables: hats, weapons and PANTS!<br />\n- World 1 and World 2 can also be unlocked.<br />\n&quot;Every last pixel of Fancy Pants feels as though it&#39;s dedicated to making its platforming as smooth and flawless as possible.&quot; — AppSpy, 5/5<br />\n&quot;Mind Blowing&quot; — AppCroc<br />\n&quot;Fancy Pants is platforming at its finest&quot; — Unbound Gamer, 95%<br />\n&quot;a high speed adventure with a silky smooth design for one of the best platforming experiences on iOS.&quot; — Apple N Apps<br />\n&quot;...there’ll never be a time when you feel that the game is either lacking in content or creativity.&quot; — iPhone Alley, 5/5<br />\n&quot;Fancy Pants Man is fun, fast and oozing with personality.&quot; — no dpad<br />\nJoin Fancy Pants Man in his first ever portable outing on the App Store as you help rescue his little sister, Cutie Pants, from the worst pirates ever.<br />\n• AN INCREDIBLE ADVENTURE<br />\nLeap, slide, sprint and smash your way through some of the most unique levels to be found in gaming.<br />\n• SO FANCY PANTS MAN…WHAT&#39;S NEW?<br />\nFancy Pants Man will wield new weapons, take on new enemies and use a ton of new tricks and abilities on his way to rescuing his beloved sister.<br />\n• LOOKS PRETTY FANCY<br />\nUnique hand-drawn artwork and gorgeous, colorful visual style.<br />\n• START A COLLECTION<br />\nCollect the squiggles and stars spread throughout each stage and use them to unlock new awards, costumes and accessories.<br />\nDeveloped by Brad Borne and Over the Top Games.</p>", "metacritic": null, "released": "2011-04-20", "tba": false, "updated": "2023-06-03T20:46:48", "background_image": "https://media.rawg.io/media/screenshots/062/06245ccfc3c239ae4db657ad182211b9.jpg", "website": "https://www.overthetopgames.com", "rating": 3.91, "rating_top": 4, "added_by_status": {"owned": 29, "beaten": 7, "toplay": 2, "dropped": 9}, "playtime": 1, "achievements_count": 4, "ratings_count": 11, "suggestions_count": 154, "game_series_count": 0, "reviews_count": 11, "platforms": ["Android", "Xbox 360", "PC", "iOS"], "developers": ["Over the Top Games"], "genres": ["Action", "Adventure", "Arcade"], "publishers": ["Chillingo", "Over The Top Games"], "esrb_rating": "Everyone 10+"}