{"id": 15654, "slug": "firma", "name": "FIRMA", "name_original": "FIRMA", "description": "It’s 2118, space is big business, and it doesn’t get much bigger than FIRMA: the corporation that has a monopoly on space exploration - and almost every other industry too. According to some, it’s time to bring them down, but they’re going to need help.<br/>\n<br/>\r\nYou’re a courier for Trans Luna Logistics with aspirations of leaving your life on the dust-ridden Moon for a promotion with FIRMA on Mars. Buckle up and sit tight because it’s going to be a bumpy ride - everything is not as it seems.<br/>\n<br/>\r\nNo space adventure is complete without an awesome space craft, yours is The Transit Lander - the fast and highly manoeuvrable craft that many can fly, but few can master. In order to fully exploit the VR gameplay, the core focus has been to perfect the controls. Handling your craft can be tricky at first, but with continued play and practice comes faster times and a pilot-pro status.<br/>\n<br/>\r\nFIRMA has been designed and built from the ground up for modern virtual reality systems. Look up as you clamber through obstacle-ridden dig sites, peer down as you make tricky deliveries and look all around whilst you seek and destroy enemy crafts.<br/>\n<br/>\r\nWhether you’re exploring terrain in search of crashed spacecraft parts or racing through open expanse to deliver vital supplies to scientific bases, there’s hours of flying fun to be had whilst discovering the dynamic and fully immersive world of FIRMA.", "metacritic": null, "released": "2016-11-18", "tba": false, "updated": "2019-08-28T22:11:26", "background_image": "https://media.rawg.io/media/screenshots/aaf/aafc23953fdabd2428ca23b47fcf3f53.jpg", "website": "http://firmagame.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 4}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 214, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Think Heavy"], "genres": ["Action", "Adventure", "Simulation", "Indie"], "publishers": ["Think Heavy"], "esrb_rating": null}