{"id": 15659, "slug": "super-mnc", "name": "Super MNC", "name_original": "Super MNC", "description": "<p>Super MNC is a free-to-play third-person MOBA game developed by Uber Entertainment. It serves as a direct sequel to Monday Night Combat. The game is not playable as of May 24th, 2018 due to GDPR.</p>\n<h3>Gameplay</h3>\n<p>The game puts two teams of 5 players against each other. A class-based mechanic is featured in the game. It heavily depends on teamwork as the players have to choose their character right after getting assigned to a team.</p>\n<p>The game features a mix of class-based combat, tower defense style game, and a typical MOBA. The main objective of either team is to destroy the so-called Moneyball of the opposing team. In order to complete the objective, the players have to get through the turret defense, which can only be destroyed by sending out bots on a specific lane. Once the bots get to the turrets, their shield goes down, and the turrets can be destroyed.</p>\n<p>The players are awarded money and experience for every kill they make. Experience is used to level the player&#39;s character up and unlock character-specific skills. The money can be used to summon new waves of bots or purchase temporary powerups at vending machines. </p>\n<p>The game also features a survival mode called Super Blitz which puts five players against the in-game announcer. The players have to defend their Moneyball as the Announcer sents waves of bots to destroy it. The Announcer takes a break every ten rounds which can be used to repair turrets, build new ones or upgrade your character.</p>", "metacritic": 76, "released": "2012-04-18", "tba": false, "updated": "2023-11-26T19:30:19", "background_image": "https://media.rawg.io/media/screenshots/4e0/4e0ea16d3362361791100bcbd7a1bf1b.jpg", "website": "http://www.supermnc.com/", "rating": 2.21, "rating_top": 1, "added_by_status": {"yet": 35, "owned": 1310, "beaten": 17, "toplay": 1, "dropped": 37}, "playtime": 1, "achievements_count": 4, "ratings_count": 84, "suggestions_count": 628, "game_series_count": 0, "reviews_count": 84, "platforms": ["PC"], "developers": ["Uber Entertainment"], "genres": ["Action", "Strategy", "Sports", "Indie"], "publishers": ["Uber Entertainment"], "esrb_rating": null}