{"id": 15661, "slug": "spy-bugs", "name": "Spy Bugs", "name_original": "Spy Bugs", "description": "Overview<br/>Spy_Bugs is a flying game in which the protagonists are cyborg insects upgraded with high tech weapons. They can fly, land, fire weapons and make special attacks, each insect is a different character with a specific weapon, special attack and specific role. The player fights other insects in closed battlefields, like a human's house.Background story<br/>The year: 2023 <br/>There is a major corporation aiming to become the most important player in information control in the world. With the latest technology they gather private and industrial data and then sell it to the highest bidder with absolutely no regards for privacy. They are known as Cyberius Corporation. <br/>On the other hand, former Cyberius employees created a group of freedom fighters and began a conflict to expose Cyberius for what they truly are and protect people's privacy. These brave people are known as Hexotech. <br/><br/>The immediate response of Cyberius was to create micro drones. Using real insects, they started to genetically modify them and then add weapons in order to infiltrate any kind of building, eliminate threats, gather information and get out undetected. <br/>When Hexotech learned of this technology they started to create their own micro drones in order to fight back, secure private data and sabotage Cyberius plans. <br/><br/>One of Hexotech's members managed to get the key to the insect modifications and they started to make their owns. However their goal is to secure all the data and sabotage Cyberius plans. <br/><br/>So the cold war for information beganFeatures<br/><ul><li>Insanely fast paced, action packed shooter.<br/></li><li>Be a bug and act like a bug! You can fly and land everywhere in the map!<br/></li><li>In-depth competitive multiplayer shooter with bugs that have specific roles!<br/></li><li>Incredible special attacks that will blow your mind!<br/></li><li>The only game in the world that a bug is actually a feature!</li></ul><br/>We have created the game but we want to include the features that are important to you, we will hear the community and update/improve the game following your feedback! Further development we have planned: <br/><br/><ul><li>Upgraded graphics and physics engine. <br/></li><li>Community Developed Characters/Skins <br/></li><li>New Maps Domestic &amp; Urban environment<br/></li><li>ELO Rating System<br/></li><li>Divison Tiers</li></ul><br/>Thank you guys for you support! <br/><br/><strong>Plans listed here are subject to change, we may add or remove features as seen fit during development process and accordingly to community feedback.</strong>", "metacritic": null, "released": "2015-06-26", "tba": false, "updated": "2019-07-25T16:42:39", "background_image": "https://media.rawg.io/media/screenshots/f14/f14963860af39d7efc83c29d9c6bd662.jpg", "website": "http://www.digitalsoulgames.org", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 39}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 182, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC", "Linux"], "developers": ["Digital Soul Games"], "genres": ["Action", "Massively Multiplayer"], "publishers": ["TheGameWall Studios"], "esrb_rating": null}