{"id": 156663, "slug": "the-little-llama", "name": "The Little Llama", "name_original": "The Little Llama", "description": "<p>The Little Llama was a game created for the Ludum Dare 38 game jam by a team of 3. You play as a llama on a journey to find itself by solving puzzles using its telekinetic abilities.<br/></p><p>FAQ:</p><p>1. Q. Why a llama?</p><p>1, A, Why not a llama?</p><p>2. Q. How long did you spend on this game?</p><p>2. A. We were supposed to spend 72 hours on it, but it was actually closer to 24.</p><p>3. Q. Did you guys model everything on one of those fancy 3D softwares like 3ds Max?</p><p>3. A. No. We used MagicaVoxel for everything. It's like Minecraft but we can export to Unity. </p><p>4. Q. The game sounds terrible. Couldn't you guys find better sound assets to use?</p><p>4. A. We personally made those sound assets with love and take offense to you saying that they sound terrible. </p><p>5. Q. How was the team structured?</p><p>5. A. We had one programmer, one artist, and one designer. The designer was fairly useless so he was turned into an artist. </p><p>6. Q. How does the game relate to the theme?</p><p>6. A. Well, you know how people say \"Wow it's a small world\" when they run into someone that knows someone they know? The idea behind this was that the llama you play as was off looking for itself. In the end, it found that it was itself all along and there was no need to look for it. </p><p>7. Q. Why is none of that explained in the game?</p><p>7. A. We had a lack of time/sleep/energy drinks. 'Nuff said. </p>", "metacritic": null, "released": "2017-04-24", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/513/513989f3151c0f89e0a6186113f2adfe.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 3, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Seyvaqs"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}