{"id": 15684, "slug": "radiator-2", "name": "Radiator 2", "name_original": "Radiator 2", "description": "A small threesome of experimental games about male sexuality (Hurt Me Plenty, Succulent, and Stick Shift) about punishing, eating, and driving.<br/><br/>These small short games attempt to expand eroticism in games beyond a cutscene and fade-to-black. What if sex in games was something we performed as players, instead of something we obtained? What might sex mechanics look like? How can we convey intimacy in games? That's what Radiator 2 tries to explore.<br/><br/><ul><li>GRAPHICS: This game certainly has a lot of them<br/></li><li>AVERAGE RUNTIME: 10-45 minutes total, it's up to you<br/></li><li>CONTROLS: Mouse or trackpad, most gamepads supported<br/></li><li>SUBTLETY: Not much<br/></li><li>MORE GAY STUFF BY ROBERT YANG: http://debacle.us/</li></ul><br/><strong>Hurt Me Plenty:</strong> a short game where you spank the heck out of a dude and learn about how BDSM communities formalize consent / caring. Progress through negotiation, play, and aftercare, with your AI-controlled partner. Music by Liz Ryerson.<br/><br/><strong>Succulent:</strong> a short interactive music video game thing where you help a hunk enjoy a delicious shapely treat. It's pretty straightforward, really. (Now featuring new stunning immersive \"cheek physics\" technology!) Music is \"Waste\" by Arca, used with permission.<br/><br/><strong>Stick Shift:</strong> an autoerotic night-driving game about pleasuring a gay car. This game is a bit difficult and requires some finesse with timing, but it has a huge video tutorial and cosplay community, just search \"how to drive stick shift\" on YouTube. Music is \"Crybaby\" by Davey and the Chains, used with permission.<br/><br/>**********<br/><br/>Q: I've played these games before. What's new?<br/>A: Hurt Me Plenty has been substantially re-designed. In general though, it's mostly improved shaders and HDR lighting with HD skin effects and hair physics. There's also gamepad support and text localization for several languages.<br/><br/>Q: How much nudity is in this game?<br/>A: It is possible to witness some bare butts, and sometimes the characters are in their underwear, but otherwise there is no \"full frontal\" or anything. If this were a movie, it would be rated PG-13.<br/><br/>Q: Will playing this game turn me gay?<br/>A: Yes.", "metacritic": null, "released": "2016-06-16", "tba": false, "updated": "2022-09-30T04:38:52", "background_image": "https://media.rawg.io/media/screenshots/4f4/4f43f55aaf6e6af8023360350cd8c2fe.jpg", "website": "http://www.radiator.debacle.us", "rating": 3.26, "rating_top": 4, "added_by_status": {"yet": 11, "owned": 404, "beaten": 21, "toplay": 5, "dropped": 7}, "playtime": 1, "achievements_count": 5, "ratings_count": 34, "suggestions_count": 353, "game_series_count": 0, "reviews_count": 34, "platforms": ["macOS", "PC", "Linux"], "developers": ["Robert Yang"], "genres": ["Action", "Simulation", "Casual", "Indie"], "publishers": [], "esrb_rating": null}