{"id": 15686, "slug": "clockwork-empires", "name": "Clockwork Empires", "name_original": "Clockwork Empires", "description": "Take on the role of a Colonial Bureaucrat sent forth by the Clockwork Empire to build a Frontier Colony. Design buildings and their contents from the ground-up to feed the Ravenous Maw of Industry, manage the uniquely unruly population, and make Important Decisions when the Occult Investigator shows up for a surprise inspection. It's up to you to ensure the success of a Frontier Colony populated by ambitious overseers, brave soldiers, and oppressed labourers who work and live in workshops, mines, scientific laboratories, lavishly decorated houses, farms, chapels, pubs, and more! <br/><br/>But be wary - every colonist is a unique simulated individual with their own personality, motivation, secrets, and peculiar desires which must be satisfied lest they invite Terrible Consequences ranging from occult rituals to delicious cannibalism.<br/><br/><strong>Features</strong><br/><ul><li>Colonists are simulated with individual personalities, memories, and will be happy or miserable depending on your management.<br/></li><li>Free-form building: Design your own floorplans &amp; arrange machines, furniture, and decorations as you see fit. (Or stuff everyone into dire bunkhouses.)<br/></li><li>Mine ore, chop trees, farm cabbage, brew beer, tin weird caviar and try to keep your people from eating one another!<br/></li><li>Beware weird horrible things: Menacing Fishpeople, cults, cannibalism, and more await your colonists.</li></ul>", "metacritic": 58, "released": "2016-10-26", "tba": false, "updated": "2019-08-28T22:11:25", "background_image": "https://media.rawg.io/media/screenshots/4d0/4d044ea72ba135337f3bb09a5ccbfb95.jpg", "website": "http://www.clockworkempires.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 25, "toplay": 1, "dropped": 4}, "playtime": 7, "achievements_count": 46, "ratings_count": 4, "suggestions_count": 601, "game_series_count": 0, "reviews_count": 4, "platforms": ["PC", "macOS"], "developers": ["Gaslamp Games"], "genres": ["Strategy", "Simulation", "Indie"], "publishers": ["Gaslamp Games"], "esrb_rating": null}