{"id": 15680, "slug": "drive-on-moscow", "name": "Drive on Moscow", "name_original": "Drive on Moscow", "description": "<strong>Drive on Moscow: War in the Snow</strong>, a strategy game from the award-winning makers of Battle of the Bulge, invites you to take command of the pivotal battle of World War II!<br/><br/>Defend the homeland as the Soviets, or lead a bold push to seize the Soviet capital as the Axis.<br/><br/>As commander, direct your troops across a detailed campaign map, capturing territory and planning strategies. You must overcome your opponent, vast distances, and extreme weather to achieve victory.<br/><br/>Thanks to the impulse based turn system, you'll activate individual sectors: choose wisely, time is of the essence and correct timing is crucial to win the campaign.<br/><br/>Featuring turn-based gameplay and an award-winning UI design, Drive on Moscow sports wonderfully direct gameplay. Play online, face-to-face or against challenging AI opponents. With accessible rules, Drive on Moscow is a great wargame experience for casual and veteran players alike.<br/><br/>Features:<br/><br/><ul><li>Play as the Soviets or the Axis across three scenarios and the full campaign Command tanks, cavalry, infantry, airborne and more<br/></li><li>Revolutionary impulse based turn and activation system<br/></li><li>Play against multiple distinct AI opponents tailored for each scenario<br/></li><li>Online play is better than ever with enhanced chat features, tournament system, Live PBEM and more opponent information<br/></li><li>Experience Russian winter on a dynamic map that changes with the weather <br/></li><li>Replay entire games to see every move and savor your triumphs<br/></li><li>New leaderboards and stats let you compete on a global scale<br/></li><li>Learn with the tutorial and quick start guide, or visit our online strategy forums to learn from other players<br/></li><li>Full rules are included for advanced players Includes extensive historical photos and commentary<br/></li><li>Designed by Ted Raicer, award-winning designer of Paths of Glory</li></ul>", "metacritic": null, "released": "2016-10-26", "tba": false, "updated": "2023-01-06T09:06:19", "background_image": "https://media.rawg.io/media/screenshots/d02/d02b2f645522a75a4d22c89b260f816e.jpg", "website": "http://www.shenandoah-studio.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 17, "toplay": 1}, "playtime": 9, "achievements_count": 59, "ratings_count": 1, "suggestions_count": 406, "game_series_count": 0, "reviews_count": 3, "platforms": ["PlayStation 4", "Xbox One", "iOS", "PC"], "developers": ["Slitherine Software", "Shenandoah Studio"], "genres": ["Action", "Strategy", "Board Games", "Educational"], "publishers": ["Slitherine"], "esrb_rating": null}