{"id": 156937, "slug": "crappy-bird-taylor-dale", "name": "Crappy Bird (Taylor Dale)", "name_original": "Crappy Bird (Taylor Dale)", "description": "<p>In an attempt to cash in on the success of a certain hit game based around a bird that flaps, the developers at elad studios have tossed together this god-awful excuse for a game and have attempted to add some childish, toilet level humor to increase the appeal to people who are more likely to click on in-game advertising to generate money to feed our graphics design artist, who currently survives on mere morsels and bread crumbs found outside in the garbage bin at his local bakery.<br/>Let's be honest. There are a lot of similar clones on the app store, what defines this one? The answer is, nothing. Why should you download it? You shouldn't. Leave this page right now, and go and do something useful with your life. Whatever you do, don't download this app.<br/><br/>However, if you do choose to download and accept the fact that your life is an abominable waste of resources, this poorly, undeveloped \"game\" offers the following \"features\" in turn for you wasting time and 10 megabytes of your data allowance:<br/>- No originality: almost the exact same concept as other similar games<br/>- Sounds and other resources that are close to breaking copyright laws<br/>- Poorly optimized for all phones. Does it look funny on your screen? Yeah it's meant to look like that it's all part of the challenge.<br/>- Next-gen fish that swim away from you!<br/>- Hardware-pushing visuals that will blow your mind (but hopefully not your phone)<br/><br/>By playing this game you will experience the most euphoria possibly comprehensible to the human mind. We are not liable for any damage you cause to yourself or others around you when you realize you have just played the best game you will ever play in your entire life.</p>", "metacritic": null, "released": "2017-02-12", "tba": false, "updated": "2019-08-28T23:21:55", "background_image": "https://media.rawg.io/media/screenshots/7b5/7b52bad8b92a28adc9e5a2f75b51f1f9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 5, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Taylor Dale"], "genres": ["Action", "Platformer"], "publishers": [], "esrb_rating": null}