{"id": 15700, "slug": "caffeine", "name": "Caffeine", "name_original": "Caffeine", "description": "Synopsis<br/>Caffeine is a quirky first person adventure game with environmental puzzles and a touch of psychological horror.<br/><br/>Set in the near future, the entire population of Earth is vigorously addicted to coffee. Massive space stations built by the biggest corporations roam the stars mining minerals to create a synthetic caffeine.<br/><br/>You awaken aboard one of these caffeine mining stations alone. Before long you realize that you are a young boy with no memory of what has transpired on this seemingly empty space station.<br/><br/>Naturally you set out to explore the depths of the huge structure to figure out what exactly is going on.<br/><br/>Caffeine is a collection of three episodes, the first of which will be released on October 5th 2015.<br/>Episode One is a 1 hour adventure which sets the story and tone of what is to come and be expanded upon in Episode Two and Three.<br/><br/>Episode Two and Three will be released as free updates to the Season Pass version of the Game in the not too distant future and will feature longer play times and challenging puzzles.Graphics<br/>Caffeine utilities various technologies like DirectX 12, Ray traced distance field shadowing and dynamic lighting to give players a visually stunning game which looks great on low and ultra settings.Audio<br/>Caffeine features stunning sound design from Jonathan Wachoru (Outlast) and a serene music score by Adam Klingman of Bay Drive Sound.Oculus Rift SupportOn release Caffeine will have full in-game Oculus Rift support by hitting alt+tab while in-game. The main menu and settings menus are currently displaying incorrectly while in stereo mode, this will be patched into the game later on in release week so we can iron out gameplay related issues first.", "metacritic": null, "released": "2015-10-12", "tba": false, "updated": "2023-10-08T20:30:41", "background_image": "https://media.rawg.io/media/screenshots/1e2/1e2631b2f97cd6ce974c86945cc52d49.jpg", "website": "http://www.incandescentimaging.net/about-caffeine/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 9, "owned": 204, "dropped": 3}, "playtime": 1, "achievements_count": 11, "ratings_count": 3, "suggestions_count": 251, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC", "macOS", "Linux"], "developers": ["Incandescent Imaging"], "genres": ["Adventure", "Indie"], "publishers": ["Incandescent Imaging"], "esrb_rating": null}