{"id": 157019, "slug": "subwaykillermilestone2", "name": "SubwayKiller(Milestone2)", "name_original": "SubwayKiller(Milestone2)", "description": "<p><strong>Subway Killer</strong> is a 2D action game created by Zaiyun Lin. In the game, players control a frantic assassin whose mission is to wipe out certain targets in the subway station.   Players have to exterminate their targets by pushing them into the track and smashed by the train. Also, players have to avoid the revenge of furious targets who just climb back to the platform and the patrolling policeman. Try to kill as many as possible, and survive as long as possible! <br/></p>\n\n<p><strong>How to play:</strong></p>\n<p>Kill <strong>RED </strong>guys. Those are your targets. </p>\n<p>Kill them with train's head will grant extra score. Kill them by kicking them multiple times will grant extra score.</p>\n<p>Civilian(BLUE guys) killed by train will make you lose the game. <strong>But </strong>you  kick them off the railroad and if they come back, you will grant extra score for adding chaos in the subway station.</p>\n\n<p><strong>Control:</strong></p>\n<p>Move: WASD </p>\n<p>Kick: W/A/S/D + Space bar</p>\n<p>The inspiration of such art style is from the animated science fiction series “Rick and Morty.” I really like series itself as well as the art style of them. And I think such art style is perfect for a 2D game, so I tried to implement it to my game.</p>\n\n<p><strong>How did you arrive with this particular visual (and audio) style for the game?</strong><br/></p>\n<p>The inspiration of this game's art style is from the animated science fiction series “Rick and Morty.” I really like series itself as well as the art style of it. And I think such art style is perfect for a 2D game, so I tried to implement it to my game. </p>\n<p>Screenshots from \"Rick and Morty\":</p>\n\n<p><strong>What does this style contribute to the gameplay?</strong><br/></p>\n<p>It make the game more casual rather than serious, which is exactly what I want. Also such art style may give the player a good first impression, because it is colorful and vivid . </p>\n<p><strong>Before</strong><em> </em>Audiovisual Phase:</p>\n\n<p><strong>After</strong> Audiovisual Phase:</p>\n\n<p><strong>What was the most challenging aspect of the audiovisual phase for you?</strong></p>\n<p>Most challenging part is to find the right sound effect. I have a hard time finding sound effects that sound same as those I imagined in my mind. Also, the editing and tuning the original sound effect is difficult. Because I barely know anything about audio editing. I have to spend many time to learning and exploring.</p>", "metacritic": null, "released": "2018-04-04", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/9d3/9d3474480849b51cb01be5e0390fbe1c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 52, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["linzaiyun"], "genres": [], "publishers": [], "esrb_rating": null}