{"id": 15707, "slug": "showdownvr", "name": "ShowdownVR", "name_original": "ShowdownVR", "description": "Test your limits in an atmospheric battle arena by dodging enemy projectiles, scoring points, earning action points with combos and using them to ultimately crush your foes with counter attacks. Enjoy the perks of slowing down time, teleporting around an open world, even taking over and steering a ship in the middle of a mighty ocean!<br/><br/>Choosing between five intensity difficulties and two playing styles offers a wide range of experience with a chance to gradually improve your skills. Compete as an individual while also representing your country and continent on the leaderboards.<br/><br/>ShowdownVR is shipping with some of the world’s first technologies used in VR: NVIDIA’s WaveWorks, Multi-Res Shading, Lens Matched Shading with dynamic versions of both (dynamic multires and dynamic lens matched shading), VR SLI. Everything built-in with an extended menu for full customization and benchmarking.Key features:<ul><li>Immersive virtual reality carnage<br/></li><li>2 × 2 km wide open world battle arena<br/></li><li>Five difficulty levels<br/></li><li>Two game modes: The One and Dodger<br/></li><li>Fully dynamic world<br/></li><li>Easy to play, hard to master. Comes with manual and master sheet.<br/></li><li>Leaderboards: Continent, Country, Individual<br/></li><li>NVIDIA WaveWorks for real-time ocean simulation<br/></li><li>NVIDIA Multi-Res Shading, Lens Matched Shading with dynamic shading options.<br/></li><li>NVIDIA VR SLI<br/></li><li>Benchmark</li></ul><br/>Heavily inspired by Matrix, Quake and Doom; fast, intensive, powerful, unforgiving.<br/><br/><strong>Specific inspirations</strong><ul><li>Matrix: bullet time, dodging, music style<br/></li><li>Quake: arena, competitive, fast twitch / accurate combat<br/></li><li>Doom: fast, intensive, bloody kills</li></ul>GameplayThere is a wide variety of approaches for players to use. The goal is very simple: score the largest amount of points possible in the time given to you. By dodging plasma projectiles you gain points and combos to earn action points. These can be used for the following perks: teleporting, attack, multi-attack, slowing down time. By killing your foes you gain additional time, which enables you to score more points. Enemies can be killed by your projectiles or can get run over by a ship that you can control at any time, even when you're not on it. They can also get knocked out and drown when hit by a larger wave. When you get hit, you don't gain a point and your combo progress decreases. This makes it harder to gain action points that enable the use of player's abilities - which in return enable player to gain more points.Showdown: Virtual reality carnageEvery copy of the game comes bundled with an accompanying piece of work in a form of a book \"Showdown: Virtual reality carnage\". A personalized white paper about the implementation, customization and usage of features in Unreal Engine 4 during the development of virtualy reality game ShowdownVR. It presents a strong practical case of why open source game engines are the future. You can find it in game's directory under \"Bonus content\" folder.GameworksQuick word on using NVIDIA's tech. The exact tech specifications are available in white paper  \"Showdown: Virtual reality carnage\", released with the game. There is a very fundemental, objective reason for using these features: it's the best performing piece of code out there. It's important to remember that most problems with GM come with bad implementations. Showdown's water takes about 1ms on CPU and about as much on GPU, no matter the GPU brand! Everything is controlled by us in Unreal's source code, there is no over-tesselation or any similar bottlenecks. Multi-Res Shading, Lens Matched Shading and SLI work only on NVIDIA and are a bonus option.<br/><br/><br/><br/>Nejc L.,<br/>Frontseat Studio", "metacritic": null, "released": "2016-09-19", "tba": false, "updated": "2019-08-28T22:11:24", "background_image": "https://media.rawg.io/media/screenshots/297/29720631f71b476254aa0d5aa2ec3a7d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 467, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Frontseat Studio"], "genres": ["Action"], "publishers": ["Frontseat Studio"], "esrb_rating": null}