{"id": 15714, "slug": "deponia-the-complete-journey", "name": "Deponia: The Complete Journey", "name_original": "Deponia: The Complete Journey", "description": "<p>Deponia: The Complete Journey is a remaster of an approved Deponia trilogy consisting of initial Deponia, Chaos on Deponia and Goodbye Deponia. There is also a fourth installment widely considered parallel and off-canon. Another feature of The Complete Journey — four hours worth of developers&#39; comments. </p>\n<h3>Gameplay</h3>\n<p>Deponia is a point-and-click adventure set on the planet of the same name. The game features 2,5D gameplay which means there are layers to the static background. As in the most games of this genre, the game includes interactions with the objects on the screen some of which are: pick up, combine, use for puzzle and talk to, if the object is animate.<br />\nThe title features multiple hints if the player finds himself stuck at the level. Hints can be turned off.</p>\n<h3>Story</h3>\n<p>The story derives from the planet Deponia, the population of which were forced to move to the city called Elysium leaving Deponia as dumpster behind them and considering all its inhabitants to be dead.<br />\nThe player follows a story of Rufus who is eager to follow the quest of his father&#39;s life and reach Deponia. Sadly, his ship brokes and he is forced to live on Organon ship — this is the organization responsible for dumping trash on Deponia&#39;s surface. Rufus is set to find out the truth about Deponia undoings.</p>", "metacritic": null, "released": "2014-06-03", "tba": false, "updated": "2024-04-06T13:01:20", "background_image": "https://media.rawg.io/media/games/99d/99d7fadd2342f575d238a4e1f5c542b6.jpg", "website": "http://www.deponia.de", "rating": 3.61, "rating_top": 4, "added_by_status": {"yet": 396, "owned": 3563, "beaten": 188, "toplay": 45, "dropped": 95, "playing": 26}, "playtime": 4, "achievements_count": 105, "ratings_count": 410, "suggestions_count": 519, "game_series_count": 0, "reviews_count": 410, "platforms": ["Linux", "PC", "macOS", "iOS"], "developers": ["Daedalic Entertainment"], "genres": ["Adventure", "RPG"], "publishers": ["Daedalic Entertainment"], "esrb_rating": "Teen"}