{"id": 15713, "slug": "chaos-on-deponia", "name": "Chaos on Deponia", "name_original": "Chaos on Deponia", "description": "<p>The second game in the Deponia series is set in a whimsically cartoonish future world and is defined by its emphasis on characters and humor. Once again, the player controls Rufus, a selfish yet loveable rogue, who tries to leave his home planet Deponia and move to the luxurious space station Elysium. His cyborg girlfriend Goal got into trouble because of Rufus’s faults, and he has to save her. The plot, character interactions, and many jokes rely on the assumption that the player is already familiar with most characters from Deponia. However, in case you didn’t play the original game, there’s an introduction to familiarize you.<br />\nChaos on Deponia uses point-and-click controls, which are usually better suited for mouses and keyboards. However, the developers claim to make sure that playing with a console’s controller is just as fluid and natural. The analog stick stands in for the mouse, while the buttons control various actions Rufus can do to objects and other characters. Like in most adventure games, the protagonist has to use various items to solve puzzles. Those are quite complex right from the start, and there’s no growing difficulty over the course of Chaos on Deponia.</p>", "metacritic": 78, "released": "2012-10-12", "tba": false, "updated": "2024-02-23T11:13:57", "background_image": "https://media.rawg.io/media/games/6bc/6bc337100b6f6b7afb638bc0806c0b6d.jpg", "website": "http://www.deponia.de/", "rating": 4.06, "rating_top": 4, "added_by_status": {"yet": 147, "owned": 1945, "beaten": 285, "toplay": 32, "dropped": 29, "playing": 7}, "playtime": 5, "achievements_count": 201, "ratings_count": 313, "suggestions_count": 487, "game_series_count": 3, "reviews_count": 313, "platforms": ["PlayStation 4", "Nintendo Switch", "Linux", "macOS", "PC", "iOS", "Xbox One"], "developers": ["Daedalic Entertainment"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["Daedalic Entertainment"], "esrb_rating": "Teen"}