{"id": 15718, "slug": "terror-lab", "name": "Terror Lab", "name_original": "Terror Lab", "description": "\" This game is in constant updates and improvments ( every 2 days ) with community , participate to it \"THE GAME<br/>You have just awoken in an abandoned laboratory. Who you are, how you got here, and why are you here all seem to be a mystery to you. Yet there is a more pressing matter at hand, is that it is obvious you are not alone. <br/>If you want to survive this encounter, and perhaps get out of this place, you must quickly adapt. Your priority in this battle is to keep the facility operational. To do this you'll need to use whatever you can find, be it a flashlight to illuminate the way or concussion grenade scare off any unsavory entities. Despite these grim circumstances there are still clues which may aid your memory, and there is a slight chance you may escape alive. <br/>Enough talk, time is running out! Your fate is in your own hands and it's now a battle of will!TIPS<br/>GENERATORS<br/>These generators seem to have been abandoned years ago, luckily they still seem to run. If you want to survive your priority should be to keep them running. Don't get too comfortable though, there's no saying which generator will fail next. <br/><br/>FLASH LIGHT ( Right-Click ) <br/>Use your flashlight conservatively, although it recharges there's no telling what will go bump in the night.<br/><br/>FLASH BANG ( Left-Click ) <br/>Although there are no ballistic or blunt weapons laying around the facility there seem to be a few scattered concussion flash bang grenades scattered about. Perhaps these will slow down any pursuers.  <br/><br/>OXYGEN <br/>Sealed off from civilization it seems the facility can only last so long with it's current oxygen levels. Any movements you take will deplete your supply so make your moves wisely. <br/><br/>DOCTOR <br/>This humanoid silently lurks through the halls looking for victims. A flash bang may stun him monumentally but it will in no way stop him. <br/><br/>MONKEY <br/>With seemingly random and spontaneous movements this feral beast will hunt you down. If you want to survive you'll need to use the movement detector to prepare your counter-attack, but in order for this to work the room must be silent.THE STYLE<br/>Terror Lab is simple-to-play independent horror game where players can quickly familiarize controls and jump right into the action. Taking inspiration from games such as 'FNAF', 'Boogeyman' or 'Emily want to Play' Terror Lab aims to create an ominous and terrifying setting for players of all skill level to endure.", "metacritic": null, "released": "2016-03-16", "tba": false, "updated": "2023-01-23T23:23:36", "background_image": "https://media.rawg.io/media/screenshots/7bc/7bcd9187d702dc2ee410b7724a9ac7ca.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 35}, "playtime": 1, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 214, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC", "Linux", "macOS"], "developers": ["Nicolas Bernard"], "genres": ["Adventure", "Indie"], "publishers": ["Microids Indie"], "esrb_rating": null}