{"id": 15720, "slug": "blue-revolver", "name": "BLUE REVOLVER", "name_original": "BLUE REVOLVER", "description": "<strong>Ever feel like the world doesn't understand your talents?</strong> Mae is a rabbit-eared genius programmer, able to manipulate reality with a few keystrokes or - the more fun option - blow up large swathes of reality in one of her custom-built Devices. However, genius is never understood in its own time, and she's provoked a severe response from the environmental group \"Blue Revolver\". Command her defiant counter-attack over 5 stages of manic struggle, blast through hordes of enemies and go face-to-face with fearsome bosses.<br/><br/>Features:<ul><li> 5 stages of heart-pounding struggle. Snowy mountains, hectic dockyards, nightmare bases and more...<br/></li><li> Two pilots with 3 gun types each, and 8 special weapons to choose from! Blocking bullets, clearing crowds, carving up bosses or milking points - the choice is yours.<br/></li><li> Adaptive difficulty system - the game tailors its difficulty on the fly to your skill level. Or if you're weird, pick <strong>Parallel</strong> mode for a glimpse of the most the game can throw at you, including a \"nice\" surprise at the end.<br/></li><li> Missions mode - 24 single-stage challenges allow you to build up your skills before going for the full clear! Take on strict survival and scoring challenges, or deal with slightly stranger things - experimental weapons, annoying giant bullets and more.<br/></li><li> Flourish for high scores! Build up short chains and finish them off with the special weapon for big points. Score BREAK bonuses by picking apart bosses and big enemies in difficult ways.<br/></li><li> Full original soundtrack by Qygen and Novaturtle - and tons of usable remix tracks by Exemia, Hyphen, MadDrift, Terranaut, Mitomoro, Blue Phoenix, ikaruga_nex and Aghast.<br/></li><li> Online leaderboards and replays. (Windows only)<br/></li><li> Unlock gallery art, remix tracks and other goodies as you play.<br/></li><li> Screen scaling options (including portrait mode), rebindable controls, \"kiosk mode\" for parties or events.</li></ul><br/>", "metacritic": null, "released": "2016-10-11", "tba": false, "updated": "2019-08-28T22:11:23", "background_image": "https://media.rawg.io/media/screenshots/c45/c45330e9340f45c6b689aa43472f0788.jpg", "website": "http://bluerevolvergame.com", "rating": 0.0, "rating_top": 4, "added_by_status": {"yet": 4, "owned": 49, "beaten": 3, "toplay": 1}, "playtime": 2, "achievements_count": 40, "ratings_count": 5, "suggestions_count": 279, "game_series_count": 0, "reviews_count": 5, "platforms": ["macOS", "PC", "Linux"], "developers": ["Stellar Circle"], "genres": ["Action", "Indie"], "publishers": ["Stellar Circle"], "esrb_rating": null}