{"id": 15723, "slug": "mad-combat-marines", "name": "Mad Combat Marines", "name_original": "Mad Combat Marines", "description": "Are you ready to eliminate hordes of enemies and have fun as you compete against people from all over the world? <strong>Mad Combat Marines</strong> is here for you and it delivers all of that in an incredibly action-packed challenge!<br/><br/>You have the ability to choose between multiple weapons, such as RPG, sniper, shotgun, machine gun and pistol. And, if you like the idea of driving cars in a shooter, with Mad Combat Marines you can do that and so much more!<br/><br/>Our game also allows you to eliminate enemies in a variety of multiplayer events, each one with its own set of challenges as well!<br/><br/><strong>Killer:</strong> This mode is basically normal deathmatch where you just have to eliminate the other marines on the map while still trying to fight for your life.<br/><br/><strong>Destroyer:</strong> In this mode you will need to destroy more cars than your competition!<br/><br/><strong>Wealthy:</strong> When you play the Wealthy mode, you will need to find as many gold coins as you can before the timer runs out.<br/><br/><strong>Driver:</strong> In the driver mode you will need to drive for as long as you can before the time runs out.<br/><br/>Each one of the game modes offers insane challenges and a very good gameplay experience that you do not want to miss. In fact, Mad Combat Marines seamlessly delivers a stellar shooting and driving experience in one tight and heavily immersive package. If you are a fan of high quality shooting with great game modes and plenty of insane ideas, Mad Combat Marines is here for you and it integrates all the stuff you want!<br/><br/>The gun play is very good and heavily immersive, you can have a lot of fun as you develop and use your own strategies in order to kill your enemies. Stealth is an option, but going guns blazing can help as well. It all comes down to you to choose the option you want but one thing is certain, the experience will certainly be well worth it at all times!<br/><br/><strong>Features:<br/>\t*\tMultiple weapons to choose from<br/>\t*\tImmersive gameplay<br/>\t*\tYou can drive sport cars<br/>\t*\tMultiple large city levels<br/>\t*\tAction packed multiplayer events</strong>", "metacritic": null, "released": "2016-07-13", "tba": false, "updated": "2022-09-30T00:42:26", "background_image": "https://media.rawg.io/media/screenshots/2e5/2e58e7ff38887b71319c67de97d07751.jpg", "website": "http://freezenova.com/", "rating": 0.0, "rating_top": 1, "added_by_status": {"yet": 1, "owned": 128, "beaten": 2}, "playtime": 4, "achievements_count": 7, "ratings_count": 5, "suggestions_count": 197, "game_series_count": 0, "reviews_count": 5, "platforms": ["macOS", "PC"], "developers": ["FreezeNova"], "genres": ["Action", "Casual", "Indie"], "publishers": ["FreezeNova"], "esrb_rating": null}