{"id": 157265, "slug": "coldridge", "name": "Coldridge", "name_original": "Coldridge", "description": "<p><em>The year is 2107. You are a Coldridge, one of the best. They're coming for you though, and they're coming through the walls. Grab your lazpistol. You might make it out of here alive. </em></p>\n<p><strong>Controls</strong>: <em>A &amp; D or Left &amp; Right to walk/run, mouse to aim</em></p>\n<p>You need to keep on your feet and roll with the punches. Instead of holding down a button to walk, you build up momentum in that direction- starting with a walk and then transitioning into a jog (tapping the opposite button slows that momentum if you want to walk again). This means you can slow down and aim without stopping, like the badass you are. I even reversed the aiming so it feels like you're slicing through stuff (and not just me being too lazy to hide the cursor). Don't worry about counting bullets, you can fry a circuit at about ten paces- but keep an eye on the light. Holding your laser out drains the battery, but it'll recharge if you put it away- so if you RUN OUT OF POWER, run. Because it only takes one touch, one lapse in concentration- and you're dead.</p>\n<p>There isn't really a victory condition here, just... Survive. If you make it all the way through the music without dying, that might give us enough time to trace who sent those things after you.</p>\n<p>Remember, every two seconds you're not killing something- more are coming. They're not smart, but they hunt in packs. Good luck, Coldridge.</p>\n<p>Made with Unity 4 and a lil bit o' photoshop cs4<br/>This is a lil rushed because I need to submit this early. This also is my first gamejam- but I hope I can compete with the other compo's! </p>", "metacritic": null, "released": "2017-07-29", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/229/2290bda2104bc0cc5c0b71534d23f6ff.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 40, "game_series_count": 0, "reviews_count": 0, "platforms": [], "developers": ["Unodus"], "genres": ["Action"], "publishers": [], "esrb_rating": null}