{"id": 1574, "slug": "vineking", "name": "VineKing", "name_original": "VineKing", "description": "4/5 stars - touchArcade.com<br/>“VineKing is very loveable, with charming art… a strikingly original game.”<br/><br/>4.5/5 Stars – iFanzine.com<br/>&amp;quot;If you’re seeking a truly fresh and fun gameplay experience, look no further than VineKing… buy it, play it, and relish its outlandish originality…”<br/><br/>4/5 stars - appspy.com<br/>“Vineking is unique and well made…Definitely worth a try…”<br/><br/>4/5 Stars – pauseUNpause.com<br/>“…a unique, fun and deceptively simple action puzzle.”<br/><br/>DRAW!  TAP!  GATHER! <br/>The VineKing is a great multitasker! Are you?<br/><br/>You are the last VineKing! Your planet has been destroyed by a cataclysmic event!  Use the power of the VineKing to bring life back to your planet!<br/><br/>Challenge yourself with the frantic and fun VineKing! DRAW! TAP! GATHER!  That&amp;#39;s what it&amp;#39;s all about! Sounds simple, right? It is! The challenge comes in Multitasking! The unique gameplay takes the simplest of tasks and combines them to create an extremely fun and challenging experience! As the last VineKing, experience heart pumping action as you travel through over 30 increasingly more challenging levels in a journey to bring life back to the entire planet! <br/><br/>DRAW!<br/>Draw lines to smash through the Lava Rock that has covered your planet so life can regrow and flourish!<br/><br/>TAP!<br/>Tap monsters to defeat them and protect the VineKing from danger! <br/><br/>GATHER!<br/>Gather seeds to help regrow the entire planet!<br/><br/>FEATURES:<br/><br/>~Fun, furious, and frantic gameplay!~<br/>Enjoy the rush of VineKing! Draw! Tap! Gather! A simple and frantic  game!  A quick pick up and play experience with a real challenge! <br/><br/>~Over 30 increasingly more challenging levels!~<br/>At first it might be easy, but each level gets progressively more challenging! Each level is a hand crafted experience!<br/><br/>~Game Center Support~<br/>Over 60 achievements to earn!<br/><br/>~Simple upgrade system with 18 levels of character enhancements!~<br/>As you play, invest rewards to reach new heights of power!<br/><br/>~Beautiful hand-drawn graphics~<br/>A mystical and magical world from the minds of the Pixel Vandals, this is a true visual delight!<br/><br/>~Unique Boss Levels!~<br/>Big bosses with big attitude! Can you stop them?<br/><br/>~A Host of Enemies!~<br/>Different enemy types with different abilities. Can you deal with them all?<br/><br/><br/>“My world was once a place of lush green, a kingdom of life and beauty. But now it lies as only a dark shadow of its once glorious splendor. Shattered by the comet that came from the heavens, its molten core burst upon on the lands and twisted the planet into a place of soot and darkness.<br/><br/>With the power of the VineKings, I must rebuild our kingdom. I will set forth against this unknown darkness and prevail over whatever forces may oppose me. I will regrow all the lands, and they will give birth to a new generation of Vinelings and eventually a new VineKing to take my place. I will reclaim our planet!<br/><br/>I am the last VineKing. My journey begins here.”<br/><br/>~the last VineKing", "metacritic": null, "released": "2011-06-08", "tba": false, "updated": "2019-10-22T14:27:46", "background_image": "https://media.rawg.io/media/screenshots/522/52292acf8605a3ab5af96bb6b73ab571.jpeg", "website": "http://pixelvandals.com/vineking", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 126, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Pixel Vandals"], "genres": ["Strategy", "Family"], "publishers": ["Pixel Vandals"], "esrb_rating": "Everyone 10+"}