{"id": 1575, "slug": "world-of-tanks-blitz", "name": "World of Tanks Blitz", "name_original": "World of Tanks Blitz", "description": "<p>World of Tanks Blitz is a cross-platform action game, aiming at fierce tank combat. </p>\n<h3>Gameplay&lt;h3/&gt;</h3>\n<p>The game allows 7v7 battles. The teams are forming randomly, so there can be tanks from different classes (light, medium, heavy and destroyers) and countries (German, UK, USA, and others).<br />\nThe player has to either destroy enemies’ units or capture the neutral base. The base is regarded as taken if your tank stays in a marked zone for a while without getting damaged. The capture proceeds faster as you place more tanks there. Also, there is a superiority mode, which requires the players to win, if they eliminate all foes’ vehicles and gain 1000 win points. Capturing points can earn these points and destroying enemy equipment. There is a possibility to form platoons for two people and to join clans. Many mechanics are taken from the PC-version, for instance, the physics of damage. While moving along the hilly terrain, you can also notice such mechanisms: you can do drift, driving a portable tank on a high-speed. Each map consists of two starting points of the teams. The battlefield itself has many objects and shelters: buildings, bridges, walls, trees.</p>\n<h3>Premium features</h3>\n<p>There are two currency systems in the game: credits and gold. You can earn credits from the battles. Both group and individual victories are rewarded. Gold can be purchased for real money, and also received in the course of various actions. Some features of the game become available only if paid in gold.</p>", "metacritic": 76, "released": "2014-06-28", "tba": false, "updated": "2024-03-13T21:07:56", "background_image": "https://media.rawg.io/media/screenshots/587/58785538b2d3a7226fa2c07d36e02b2b.jpeg", "website": "https://wotblitz.com/", "rating": 2.78, "rating_top": 3, "added_by_status": {"yet": 25, "owned": 1852, "beaten": 31, "toplay": 8, "dropped": 159, "playing": 31}, "playtime": 2, "achievements_count": 0, "ratings_count": 250, "suggestions_count": 818, "game_series_count": 2, "reviews_count": 254, "platforms": ["Android", "Nintendo Switch", "macOS", "iOS", "PC"], "developers": ["Wargaming Group"], "genres": ["Action", "Shooter", "Adventure", "Strategy", "Massively Multiplayer"], "publishers": ["Wargaming"], "esrb_rating": "Teen"}