{"id": 157660, "slug": "timey-blues", "name": "Timey Blues", "name_original": "Timey Blues", "description": "A Quick Intro:\r\n<p>You are a blinking ghost person and time moves forward and backwards with you. Your goal is to get the hat on the chair before the man picks it up.</p>\n<p>Use the left and right arrow keys to move forward and backwards.</p>\n<p>Some have said that this spoils the puzzle a little, so you can decide if you want to read the next line or not. Time will only move with you if your feet are touching the ground.</p>\r\nSome Background:\r\n<p>The game is a prototype I made for my Pixel Prototype Class. The prompt for that week was blue. I don't fully remember how I got to this game, but I was thinking about feelings associated with blue, and I eventually arrived at a lonely narrative that I made into a puzzle.</p>\n<p>The game is about someone outside our time and space, whom none of us can perceive. In their loneliness, this ghost person steals things people value so that their existence can have some effect on others—so that they are noticed in some way.</p>\n<p>When they take these objects, the ghost person pulls it out of space and time, permanently altering the timeline. For us now, the object taken basically never existed. In a sense the ghost person erases any evidence of their own presence, leaving people with only an odd feeling that something is gone, which they will eventually dismiss. </p>\n<br/><br/><br/>The Solution:\r\n<p>You're supposed to go up the elevator to the second floor, climb the diagonal staircase, then jump off. You can go either left or right while falling to make your position go out of sync with the elevator movement. You will have to do this fall twice.</p>\n<p>You can now fall though the elevator shaft and go left while falling. This will move you closer to the man. You then have the repeat the elevator fall (climb onto the elevator and then just go left) until you're able to get to the hat before the man. Usually two elevator falls are enough.</p>", "metacritic": null, "released": "2018-06-17", "tba": false, "updated": "2019-08-28T23:21:53", "background_image": "https://media.rawg.io/media/screenshots/011/01139a941dcca3e5a01e7579ee511fdd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 4, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Web"], "developers": ["RahulJoshi"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}