{"id": 15765, "slug": "gunjitsu", "name": "Gunjitsu", "name_original": "Gunjitsu", "description": "GunjitsuGunjitsu is a fast-paced 2.5D Multiplayer Platform Shooter, where players fight out hectic gunfights in fully destructible levels. Apart from a range of crazy weapons the game features a unique grappling hook mechanic and different styles of jumps that allows players to navigate the levels, dodge bullets and make insane headfirst assaults.<br/><br/>Gunjitsu is a game of skill and reflex, and all about keeping your cool. Learn to use the hook to assault and evade, learning to curve rockets, make precise shots, to cover your opponents in hails of well aimed bullets, or to make devastating fly-by attacks. Be the fastest on the trigger, the most acrobatic with the hook. Learn to aim and time your shots like a pro, or outmanoeuvre your opponents with lightning fast hit-and-run attacks. No matter how you choose to fight, these are all parts of mastering the art of Gunjitsu.<br/><br/>The game is heavily inspired by old platform shooters such as Soldat and Liero, and the feel and pace of these games. We wanted Gunjitsu to be all about fun, adrenaline and skill, and as such the focus is on creating an experience that rewards skill in a setting that is both hectic and nerve-racking. Gunjitsu is bringing a gun (or rocket launcher!) to a knife fight.<br/><br/>Challenge your friends or test your skills against the world.Key Features<ul><li> An awesome grappling hook - fly about the level like a true ninja <br/></li><li> 2 game modes: deathmatch and speed-run (solo and multiplayer)<br/></li><li> Custom game modes (eg. sniper only, rockets+guns, no-grenades)<br/></li><li> Fights against bots, or add them to your multiplayer games (both online and offline)<br/></li><li> 4 different and fully destructible levels<br/></li><li> 7 different weapons for combat to suit your fighting style<br/></li><li> Leaderboards</li></ul><br/>We have dedicated servers in the following regions: EU, US, JP, AU, ASIA", "metacritic": null, "released": "2015-07-31", "tba": false, "updated": "2019-07-25T16:42:49", "background_image": "https://media.rawg.io/media/screenshots/502/502a03786318b8564572dcb99883cb9f.jpg", "website": "http://gunjitsugame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 58}, "playtime": 6, "achievements_count": 19, "ratings_count": 1, "suggestions_count": 219, "game_series_count": 0, "reviews_count": 1, "platforms": ["macOS", "PC"], "developers": ["Decent Machine"], "genres": ["Action", "Indie"], "publishers": ["Beatnik Games"], "esrb_rating": null}