{"id": 1576, "slug": "gods-of-rome", "name": "Gods Of Rome", "name_original": "Gods Of Rome", "description": "An epic fighting game set in an age of myth and legend that shows you exactly what your mobile device is capable of!<br/><br/>The souls of the most powerful gods have been summoned to brutal battle. Fight to restore peace in the most graphically amazing game for mobile. A pantheon of champions is yours to train to new heights as you enter an epic story full of daily challenges, mystic prizes and PvP combat.<br/><br/>STUNNING NEXT-GEN 3D GRAPHICS &amp; ART<br/>Gods of Rome pushes the limits of the mobile platform by offering the best 3D graphics possible on a mobile device.<br/><br/>INTUITIVE TAP &amp; SWIPE CONTROLS <br/>Enjoy an experience tailored to the mobile platform – the entire screen is at your disposal, with fluid Tap &amp; Swipe controls that deliver merciless chain attacks!<br/><br/>SUMMON THE WORLD’S GREATEST WARRIORS<br/>- Join the high ranks of THE ASCENDERS – the supreme summoners of ancient legend!<br/>- As an Ascender, you can summon, upgrade and manage gods, monsters, heroes and other mythical warriors in the fight against a dark force that threatens to enslave them all!<br/>- Zeus, Hades, Vulcan, Atlas, Spartacus, Medusa and many more form the most powerful gathering of fighters the world has ever seen!<br/>- Undertake your journey through the most incredible locations of the ancient world – Mount Olympus, the ruins of Pompeii, the Coliseum, and many more!<br/>- Discover the unique Bonds shared by your fighters to unlock powerful bonuses.<br/><br/>FIGHT TO BECOME LEGEND<br/>- Explore exciting world maps where formidable new opponents wait to challenge your fighting skills…<br/>- Begin your quest to defeat the dark demon Tenebrous, an ancient evil who has unearthed the artifact known as the Chaos Vessel. As he threatens to enslave the world’s greatest warriors with its power, only the mighty summoners known as \"The Ascenders\" can rise up against his new regime!<br/><br/>RISE TO THE CHALLENGE <br/>Engage in PvP Events to conquer your challengers, win rewards, upgrade your pantheon with new abilities and special moves, and become the top-ranking Ascender!<br/><br/>UNLOCK MYSTIC PRIZES <br/>Win Spheres to discover the treasures within: rare fighters, valuable resources and other amazing rewards!<br/><br/>Find out more about the game on the official site -- http://www.godsofromegame.com/<br/>_____________________________________________<br/><br/>Visit our official site at http://gmlft.co/website_EN<br/>Check out the new blog at http://gmlft.co/central<br/><br/>Don't forget to follow us on social media:<br/><br/>Facebook: http://gmlft.co/SNS_FB_EN<br/>Twitter: http://gmlft.co/SNS_TW_EN<br/>Instagram: http://gmlft.co/GL_SNS_IG<br/>YouTube: http://gmlft.co/GL_SNS_YT<br/><br/>This app allows you to purchase virtual items within the app and may contain third-party advertisements that may redirect you to a third-party site.<br/><br/>Privacy Policy: http://www.gameloft.com/en/privacy-notice<br/>Terms of Use: http://www.gameloft.com/en/conditions-of-use<br/>End-User License Agreement: http://www.gameloft.com/en/eula", "metacritic": null, "released": "2015-12-16", "tba": false, "updated": "2019-07-29T12:52:05", "background_image": "https://media.rawg.io/media/screenshots/020/020c6a22f2985018580171fe3e2a0320.jpg", "website": "http://www.gameloft.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 562, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Gameloft"], "genres": ["Action", "Adventure"], "publishers": ["Gameloft"], "esrb_rating": "Teen"}