{"id": 157646, "slug": "apparatus-technology", "name": "Apparatus Technology", "name_original": "Apparatus Technology", "description": "<p><strong>APPARATUS TECHNOLOGY</strong></p>\n<p>Description - The protagonist worked for five years as an agent for the powerful company Apparatus Technology. It was decided to eliminate him, for the fact that he didn't support the views of the company. What is more important, personal revenge, or taking the company to expose? Alex, the protagonist, is striking back and raiding the important facilities of the company.<br/></p>\n<p>The player can fight himself, or call out an assault droid, a heal bot, and a stationary turret. During the game the upgrades are opened, player chooses what to improve: droid, bot, turret or his suit. You can completely enhance just one thing, or you can try on different levels to choose different upgrades for unusual and interesting gaming experience.<br/>Made with Game Maker.<br/>Controls:<br/>Keyboard (can be changed) - WASD-move, J-fire, K-jump, Q-droid, E-bot, F-turret, Space-medkits;<br/>Gamepad - Pad-move, X-fire, A-jump, LB-droid, RB-bot, RT-turret, Y-medkits.</p>\n<p><strong>UPGRADES</strong></p>\n<p>Tier 1<br/>ASSAULT DROID - Decrease recharge time<br/>HEAL BOT - Decrease recharge time<br/>TURRET - Decrease recharge time<br/>SUIT - Longer range</p>\n<p>Tier 2<br/>ASSAULT DROID - Increase attack power<br/>HEAL BOT - Improve healing<br/>TURRET - Increase attack power<br/>SUIT - Increase attack power</p>\n<p>Tier 3<br/>ASSAULT DROID - Increase duration<br/>HEAL BOT - Increase duration<br/>TURRET - Increase duration<br/>SUIT - Reinforce armor</p>\n<p>Tier 4<br/>ASSAULT DROID - More hp, explosive attack<br/>HEAL BOT - Transfer pain, hp pool refill<br/>TURRET - More hp, more usability<br/>SUIT - Berserk mode at low hp</p>", "metacritic": null, "released": "2018-07-01", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/891/891996b69b6940f52d2b38e623a0b8ba.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 101, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Mr_SMOKE"], "genres": ["Action", "Platformer"], "publishers": [], "esrb_rating": null}