{"id": 157720, "slug": "dispositif-dubiquite", "name": "Dispositif d'ubiquité", "name_original": "Dispositif d'ubiquité", "description": "<p>«Dispositif d’ubiquité» est une expérience de réalité virtuelle qui a pour but de<br/>désorienter les sens et les perceptions de l’utilisateur. Celui-ci va se retrouver avec un casque de réalité virtuelle devant les yeux, ce qui va le plonger dans le monde qui l’entoure sans aucune vue possible sur la réalité. Il va pouvoir se déplacer dans un monde où il doit habituer ses sens à de nouvelles règles s’il veut comprendre cet environnement.<br/>Ce projet amène à réfléchir sur la manière dont nous interagissons avec le virtuel et à quel point celui-ci peut nous impacter. En effet, le virtuel peut influencer le corps et l’esprit et cela est de plus en plus fort au fur et à mesure que les technologies évoluent. Avec l’arrivée de la réalité virtuelle et la réalité augmentée, l’immersion dans ces mondes virtuels est de plus en plus forte, «dispositif d’ubiquité» plonge  l’utilisateur dans un monde ressemblant au sien mais possédant des propriétés physiques différentes.</p>\n<p><strong>Installation : </strong></p>\n<p>Ce jeu nécessite le HTC Vive. Il faut paramétrer un espace de 2.5m².</p>\n<p>Il était initialement prévu pour être exposé avec une personne pouvant déplacer une chaise dans l'espace de jeu (Une des features principale était de pouvoir s'asseoir sur chaque chaise que l'on croisait dans le jeu). Si vous comptez le montrer à quelqu'un n'hésitez pas  à marquer au sol l'endroit où se situe chaque chaise et de la déplacer en fonction lors de l'expérience, celle-ci n'en sera que plus immersive. (Plusieurs actions n'interviennent que lorsque le joueur est assis)<br/></p>\n<p>Il est préférable d'avoir une webcam donnant sur le joueur ou d'avoir activé la webcam frontale du HTC VIVE. <br/><br/></p>\n<p><strong>Commandes :</strong></p>\n<p>Les deux boutons latéraux : Attraper un objet</p>\n<p>La gâchette arrière : Interaction</p><p>Vous pouvez trouver un peu plus d'informations à propos de ce projet sur cette page : http://pedatte.com/index.php/2017/06/29/jeu-vr-dispositif-dubiquite/<br/></p>", "metacritic": null, "released": "2017-06-29", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/c54/c544ccd1eae65fb2638eb682df242365.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 75, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Pedatte"], "genres": [], "publishers": [], "esrb_rating": null}