{"id": 157790, "slug": "a-shawn-story-itch", "name": "A Shawn Story (itch)", "name_original": "A Shawn Story (itch)", "description": "<p>A Shawn Story follows a morning in the life of Shawn, a 20-something office worker who is late for work, AGAIN! Enter the narrator, a sarcastic British man who <em>tries </em>to dictate Shawn's life, although depending on your choices as Shawn, the narrator may help or hinder you in this side-splitting 2D choice making game!<br/></p>\n<p>\"The hook for A Shawn Story - it's right there! 'You're late for work - AGAIN' - The Hard Croc (https://www.youtube.com/user/jtinker41)</p>\n<p>\"The true strength of the game is in its narration.  The sarcastic British narrator, for the trailer, tells the story in very few words, throwing a few jokes in at the same time\" - The W2 Report (http://thew2report.blogspot.co.uk/)</p>\n<p> \"A well-created, hilarious game with pleasing pixel art graphics\" - SirGoose http://steamcommunity.com/id/sirgoosie/</p>\n<p>\"A short game with loads of jokes and multiple endings\" - Divetic</p>\n<p>\"10/10. THE NARRATOR SOUNDS SMART AND HANDSOME!\" - The Narrator,  A Shawn Story.</p>\n<p>So what are YOU waiting for? Play today!</p>\n\n<p>If you spend 4 British Pounds (via the perks section) that The Narrator loves so much and get YOUR name in the credits of all our future games....<br/></p>\n<p>You'll get a shoutout in the description on our profile and games, you'll get all the games we've ever made (even ones that aren't published!) and a personal email.</p>\n\n<p>Or don't ... I don't give a fuuuuuuu</p>\n\n<p>I actually give many f's. Please, for The Narrator? SHAAAWWWN!</p>", "metacritic": null, "released": "2018-03-27", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/273/273e66f363020fc8c3e108b6439b5236.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 38, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Dawooskhe Games"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}