{"id": 1579, "slug": "traffic-racer", "name": "Traffic Racer", "name_original": "Traffic Racer", "description": "Traffic Racer is a milestone in the genre of endless arcade racing. Drive your car through highway traffic, earn cash, upgrade your car and buy new ones. Try to be one of the fastest drivers in the global leaderboards.<br/><br/>KEY FEATURES<br/>- Stunning 3D graphics<br/>- Smooth and realistic car handling<br/>- 35+ different cars to choose from<br/>- 5 detailed environments: suburb, desert, snowy, rainy and city night<br/>- 5 game modes: Endless, Two-Way, Time Trial, Police Chase and Free Ride<br/>- Basic customization through paint and wheels<br/>- Over 15 different models for traffic <br/>- Game Center Leaderboards and Achievements<br/>- iOS 7 MFi controller support<br/>- Rich language support<br/><br/>GAMEPLAY<br/>- Tilt or Touch to steer<br/>- Touch gas button to accelarate<br/>- Touch brake button to slow down<br/><br/>TIPS<br/>- The faster you go the more scores you get<br/>- When driving over 100 kmh, overtake cars closely to get bonus scores and cash<br/>- Driving in opposite direction in two-way mode gives extra score and cash<br/><br/>The game will be updated constantly. Please rate and give your feedback for further improvement of the game.<br/><br/>TRAILER<br/>* http://youtu.be/E4bpHZLRhPY<br/><br/>FOLLOW US<br/>* facebook.com/trafficracergame<br/>* twitter.com/TrafficRacer", "metacritic": null, "released": "2012-09-26", "tba": false, "updated": "2023-02-20T11:53:12", "background_image": "https://media.rawg.io/media/screenshots/05b/05b2c4cd9b9a2298b82ab25d75510027.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3, "beaten": 2, "dropped": 4}, "playtime": 0, "achievements_count": 0, "ratings_count": 4, "suggestions_count": 118, "game_series_count": 0, "reviews_count": 4, "platforms": ["Android", "iOS"], "developers": ["Soner Kara"], "genres": ["Racing", "Arcade", "Casual"], "publishers": ["Soner Kara"], "esrb_rating": null}