{"id": 158097, "slug": "cursed-castle-princess-shadow", "name": "Cursed Castle: Princess & Shadow", "name_original": "Cursed Castle: Princess & Shadow", "description": "<p>This is a 2d platformer adventure game with unique gameplay that you can switch between real world and shadow world.<br/></p>\n<p>This game tells the story of a princess who lives in a cursed castle.  Mysterious mystical thing always happen in this castle every 1000 years.  The princess will undergo an adventure to save the castle with the help of her strange ability.</p>\n\n<p><strong>Game Concept</strong></p>\n<p>In this game, player must be able to pass each level by collecting keys to unlock/pass through locked door, and defeating the monster. Levels in this game will be divided into 3 levels i.e easy, normal, and hard.  </p>\n<p>Each level has different levels of difficulty. Easy is the easiest level of difficulty, followed by normal, then hard. The obstacles and monsters that exist at each level are also adjusted to level. The more difficult the level, the obstacles, and the monsters that must be faced will be more harder. Especially on the last level, there will be a boss that must be faced to finish that level.  </p>\n<p>The player has a strange ability that can release his shadow from his body to find a way out and toward the dimensional shadow. In addition, player also bring arrows as weapon that will be used to defeat the monsters that exist on each level.  </p>\n<p>The screen will be divided into 2 parts, namely the top and bottom. The top screen contains player in real dimension, while the bottom screen contain the shadow of the player in the shadow dimension.</p>\n\n<p><strong>Gameplay</strong></p>\n<p>To be able to complete each level of the game, player are required to reach the finish line of each level. Players must also pass through various obstacles and defeat the monsters that exist on each level to get to the finish line. The obstacle are locked door / barrier wall.</p>\n<p>In the begining of the game, player will start with princess character. Player can switch to her shadow by pressing T, and press T again to switch back to princess character. If player stuck in obstacles (either in shadow or princess form) and there's a message that tell if it's a dead end, player need to change to another form to find a key or anything that can destroy the obstacles.</p>\n<p>Player only need to click with mouse to unlock chest, pull the lever, or etc.  Player doesn't need to be near with the lever, chest or etc. When you can see them, you also can click it.</p>", "metacritic": null, "released": "2018-05-30", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/47f/47f24b8e90dae04cb68c512e71ab4783.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 46, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["u2studio"], "genres": ["Action", "Adventure"], "publishers": [], "esrb_rating": null}