{"id": 158103, "slug": "una-aventura-oriental", "name": "Una Aventura Oriental", "name_original": "Una Aventura Oriental", "description": "<p><strong><em>Discover eastern art through this game</em></strong></p>\n<p>Being in period of exams and tired of studying, I came up with the idea of doing a simple game with RPG Maker VX Ace about one of the subjects: eastern art. The story was happening in my mind at the moment, and in the end I decided to add a few extra minigames.</p>\n<p><strong>The search of Genji</strong></p>\n<p>The name of Genji comes from Genji Monogatari, a Japanese story of the XI century. I called Genji to the protagonist of my story simply because it was the first name that came to mind at that time. I always try to put a playable female character in my games to make a choice, but in this case I was lazy, so as I was creating the first scenarios, the story was happening. I saw the image of the clown between the faces by default, and I thought about using it. All the dialogue with the clown occurred to me at that moment.</p>\n<p>Genji must search all three worlds for the Exquisite Tea, in order to save Yukika, the girl who is in an inaccessible place.\r\n  </p>\n<p><strong>India, China and Japan</strong></p>\n<p>These three cultures are what I had to study for the exam. I would have liked to add Korea, but I was so tired that I just wanted to finish with everything, but I do not forget Korea! When entering through the columns you access the world map, and you can go to different cities or periods in search of the Exquisite Tea.</p>\n<p>Next, I detail the cities and periods to which you can access in each world ordered chronologically. Each site may have more sites inside, and cities have inns and shops\r\n  </p>\n<p>India: Mohenjo Daro, Harappa, Pataliputra, Sanchi, Mathura, Amaravati, Ajanta, Sarnath, Nepal, Tibet, Ellora, Elephanta, Mamallapuram, Kanchipuram, Bhubaneshwar, Konarak, Khajuraho, Gwalior, Mount Abu, Tanjore, Madurai, Srirangam, Delhi, Agra, Bijapur, Amritsar, Sri Lanka, Indonesia, Cambodia\r\n  </p>\n<p>China: Neolithic, Xia, Shang, Zhou, Qin, Han, Three Kingdoms and Six Dynasties, Tang, Liao, Song, Yuan, Ming, Qing, Chang'an, Beijing, Thailand, Myanmar, Malaysia\r\n  </p>\n<p>Japan: Jomon, Yayoi, Kofun, Osaka (Asuka), Nara, Kyoto (Heian), Kamakura, Kyoto (Muromachi), Kyoto (Azuchi-Momoyama), Tokyo (Edo)\r\n  </p>\n<p> <strong>Collectibles and Minigames</strong></p>\n<p>In your search for the Exquisite Tea you can find various objects that have to do with the cultures and their period, with a brief description. Sometimes you can find explanatory posters, and some statues and ceramics have text even though there is no indicator. In some rooms there are books on a table that also contain text.</p>\n<p>The npcs give information, it is interesting to talk to them several times. In large cities, random characters are simply decorative.\r\n  </p>\n<p>As a curiosity, there are animals roaming around the zones, and they are different in each world. In India it is a snake, in China it is a rooster, and in Japan it is a cat. The flora is also different. In India there are palm trees, in China there are trees with green leaves, and in Japan, in addition to the latter, there are snowy trees, although the idea was to symbolize the cherry trees with pinkish leaves.\r\n  </p>\n<p>When the game is over, you can return to explore the worlds again. The stores will be opened, which sell typical food of each culture, and you can access to a combat minigame in a new open area in the Hall of Columns.\r\n  </p>\n<p> <strong>Credits</strong></p>\n<p> Thanks to Mack and Granny for their snake sprite. The rest of the material used is the default of the program.</p>\n<p>The music used in India, China and Japan is as follows:\r\n  </p>\n<p>India: Traditional Music of Ancient India, Taj Mahal\r\n  </p>\n<p>China: Don’t decorate your dreams, Huang Jiang Qin\r\n  </p>\n<p>Japan: Ancient Sage, Brandon Fiechter\r\n  </p>\n<p>The rest of the music is by default of the program.\r\n</p>\n<p><strong>IMPORTANT</strong></p>\n<p>The game is not in english, it is in spanish. I did it just for helping in the study, but I wanted to share it. Anyway, if hypothetically, it gets many positive comments and petitions for translation, I might consider to translate it into english.</p>", "metacritic": null, "released": "2018-05-30", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/23e/23eb38313103db9cdbf1fbfad7205ab1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 198, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["fegefeueranilmathiel"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}