{"id": 158153, "slug": "asteroid-challenge", "name": "Asteroid Challenge", "name_original": "Asteroid Challenge", "description": "<p>Asteroid Challenge is an attractive arcade space shooter, where you must defend your damaged spaceship from waves of asteroids. Your end goal is to escape the collapsing galaxy. In order to do that, you need to repair your spaceship. Energy packs keep coming. But asteroids keep coming too! And they are bigger than any time before! One asteroid impact and you are dead. For how long can you survive? Will you <strong>ever</strong> be able to escape?</p>\n<p>Visit us at: http://pavostudios.com/  or check the game at http://asteroidchallenge.pavostudios.com/<br/></p>\n\n<p><strong><em>DEVELOPING ASTEROID CHALLENGE</em></strong><em>\n</em><br/></p>\n<p><em><strong>The starting idea of the game</strong></em>\n<br/></p>\n<p><em>Asteroid Challenge is created to be an endless survival, combined with a skilled real time shooter. During the development we decided to add 3 different skills to challenge the player. The shield, a blast wave and a weapon upgrade. We were trying to achieve that the player had different strategies to survive, not only with the pressure of destroying the right asteroids, but also which special actions to use in different ways.\r\n  </em><br/></p>\n<p><em><strong>The final idea of the game</strong></em><br/></p>\n<p><em>During the development and internal playtests with friends, we realized that the blast wave and the shield were basically doing the same thing, so it lost all the fun. At this moment we decided what if we set a goal? What if the game has an end? What if we propose a challenge to the players? So the end goal of this challenge <strong>is</strong> to repair the ship and escape the galaxy. But the legend says, <strong>only one so far has seen the end. </strong></em>\n<br/></p>\n<p><em><strong>The final result</strong></em>\n<br/></p>\n<p><em>We playtested again with more friends, and they liked having many different strategies to play, combined with the real time shooting. It left them wondering what should be the best strategy to survive, repair the ship and escape the galaxy. What to do with energy first? Do they repair the spaceship as soon as possible? Do they improve the cannon or save energy for the shield? Or do they combine everything?\r\n  </em><br/></p>\n<p><em><strong>Learnings</strong></em>\n<br/></p>\n<p><em>Asteroid Challenge allows us to learn a lot about marketing, the release process, game design, psychology, art, UX, Unreal Engine and many other things. And that is the most valuable asset we take from this first experience, as that will allow us to make greater games in the future.\r\n  </em></p>", "metacritic": null, "released": "2017-09-22", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/e7e/e7ebe0b7b63d64cc4dfeb312d2448769.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 62, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["PavoStudios"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}