{"id": 15810, "slug": "take-thy-throne", "name": "Take Thy Throne", "name_original": "Take Thy Throne", "description": "Take Thy Throne is an online sidescrolling tower defense game.<br/>\n<br/>\r\nCurrently we allow up to 6 players per match to enter a variety of gamemodes, with more gamemodes coming after release as free DLC.<br/>\n<br/>\r\nThe main gamemode consists of taking down towers and barricades to make your way towards the enemy team's King which lies in the Throne room of the enemy's castle. You can pick up to 4 classes currently to play with, with more being added after the game's release. <br/>\n<br/>\r\nYou can use a variety of strategies to make your way towards the enemy Castle such as taking different routes, collecting gold and buying different items suitable for your class, or crafting buildables to help maintain your strongholds and barricades to ensure the enemy stays out of your Castle. The game is over once someone's King has been slain, and thus the Throne has been taken. <br/>\n<br/>\r\nThe game currently includes 3 gamemodes: Take Thy Throne, Capture The Flag, and Dragon Slayer, the latter being a single player/co-op mode. We're adding more gamemodes such as Deathmatch and a Village mode which consists of riding a Dragon and scorching down a Village, and more.<br/>\n<br/>\r\nWe currently support the Steam network, allowing you to easily host matches without port forwarding and to also join matches through both an in-game browser and through your Steam friends list. Right now the game is fully compatible with Windows Operating Systems, but we're working to put it on Linux as well, and quite possibly Mac in the future. We also would like to release another version of the game to support mobile devices at some point in the future.", "metacritic": null, "released": "2016-07-05", "tba": false, "updated": "2019-09-17T08:32:54", "background_image": "https://media.rawg.io/media/screenshots/2b2/2b22041592c5f097d3dfbf19d3a6ba9a.jpg", "website": "http://www.charyb.com", "rating": 1.0, "rating_top": 1, "added_by_status": {"yet": 8, "owned": 246, "beaten": 1, "dropped": 1}, "playtime": 4, "achievements_count": 11, "ratings_count": 6, "suggestions_count": 267, "game_series_count": 0, "reviews_count": 6, "platforms": ["PC"], "developers": ["Charyb Games"], "genres": ["Action", "Adventure", "Strategy", "Casual", "Massively Multiplayer", "Indie"], "publishers": ["Charyb Games"], "esrb_rating": null}