{"id": 1581, "slug": "the-silent-age", "name": "The Silent Age", "name_original": "The Silent Age", "description": "<h3>Point-and-click quest</h3>\n<p>The game is a typical representative of the point-and-click puzzle genre, developed and released in two episodes by the independent Danish studio House on Fire. The game uses the Unity graphics engine and was ported directly to several platforms. Including mobile devices running Android and iOS. The game also was released on Kindle Fire. The first episode was released in 2012, two years later, gamers were able to try out the second and last episode of the game.</p>\n<h3>The plot</h3>\n<p>The game takes place in 1972 and in 2012. The player takes control of the main character named Joe. After serving in the US Army, the protagonist changes several workplaces and eventually turns out to be a cleaner in the fictional multimillion corporation Archon. The employer turns out to be unclean, and Joe soon finds traces of blood that lead to test labs. To prevent the tragedy, which he involuntarily became a witness to, Joe is forced to use the time machine and correct mistakes of the past.</p>\n<h3>The plot</h3>\n<p>The main gameplay is tied to the solution of the puzzles of different complexity, scattered in ten story chapters. The part of them uses the plot “device” - the ability of the hero to travel in time. In the PC version, all game dialogs are voiced, the ability to use UltraHD textures is added, and for the version on Steam more than 20 achievements are available and the ability to save the game in the cloud.</p>", "metacritic": 84, "released": "2012-12-06", "tba": false, "updated": "2024-02-26T20:54:08", "background_image": "https://media.rawg.io/media/screenshots/b1e/b1ebb9c1d511bac55e4480ad422ea524.jpeg", "website": "http://thesilentage.com", "rating": 3.5, "rating_top": 4, "added_by_status": {"yet": 145, "owned": 1403, "beaten": 160, "toplay": 21, "dropped": 37, "playing": 4}, "playtime": 3, "achievements_count": 24, "ratings_count": 203, "suggestions_count": 212, "game_series_count": 0, "reviews_count": 204, "platforms": ["Android", "macOS", "PC", "iOS", "PS Vita"], "developers": ["House On Fire"], "genres": ["Adventure", "Indie", "Puzzle"], "publishers": ["Meridian4", "House on Fire ApS"], "esrb_rating": "Teen"}