{"id": 158119, "slug": "linkdefense", "name": "LinkDefense", "name_original": "LinkDefense", "description": "<p>It is a game to defend against attacks of zombies that start defense from the farm with simple puzzle-like manipulation and become stronger and stronger.</p>\n<p>Since the attack pattern is different depending on the type of ball, it is important to select and attack according to the situation.</p>\n<p><type and=\"\" ball=\"\" description=\"\" of=\"\"><br/>Blue Ball: Lightning attack zombies by the number of balls you drag. You can attack from the lower part where the zombie appears.<br/>Red Ball: Attacks a zombie by the number of balls you drag. The bottom part where zombies appear is excluded.<br/>Yellow Ball: Stuns a zombie by the number of balls you drag. The lower part where the zombie appears also applies. There is no attack damage by stopping the movement.<br/>Green Ball: The HP of your Castle increases by the number of balls you drag. Increases regardless of MaxHP.<br/>Dragonball: The dragon's automatic attack time increases by the number of dragged balls.</type></p>\n<p><description><br/>Combo: This is applied when there are more than 3 balls to be dragged, and if you remove 3 or more in a row, the number of combo increases. It is important to keep the number of consecutive combo because the amount of attack increases according to the number of combo in each attack. If you remove two pieces in the middle, the number of combo is reset to zero.</description></p>\n<p>Bonus Ball: There are bonus balls in all four colors and can be obtained by touching one by one. If you collect all four, you receive one stone to strengthen the castle.</p>\n<p>Character Level Up: Increases the attack power of Dragon, Axe, and Wizard according to the character's level up. Also reduces the attack time of the Axe and Wizard.</p>\n<p>Castle Level Up: The castle's HP increases with the castle's level up. When the defenses of the Castle fail, the repair costs of the walls also increase.</p>\n<p>Enhance Castle: Stones can be used to Enhance Castle, and depending on the level of fortification, you will have an Axe and a Wizard. You will also receive  the bonus HP on Castle.</p>\n<p>Achievements: Get to Gold, Gems, Attack, HP, etc. when you achieve each Achievement.</p>\n<p>Gem: If you succeed in  castle defense, you can get it at random.</p>\n<p>Stone: Used to fortify your castle, you can receive it at random or exchange it as a gem if you are successful in defending your castle. You can acquire all 4 bonus balls during the game.</p>\n<p>Gold: If you succeed in defending your castle, you will receive it, and you will gain experience and increase your casting cost.</p>\n<p>EXPERIENCE BENEFIT Button: Can be increased by using gold, and can be received in multiples of basic character,  castle experience.</p>\n<p>Receive Stones: You can get 1 stone every 12 hours without ending the game.</p>", "metacritic": null, "released": "2018-02-20", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/06a/06a6845810277b22e553543be16bf365.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 83, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["yemuwa88"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}