{"id": 15829, "slug": "pillars-of-eternity", "name": "Pillars of Eternity", "name_original": "Pillars of Eternity", "description": "<p>In the land of Dyrwood, which suffers from a supernatural and inexplicable misfortune: children in Dyrwood are become &quot;Hollowborn&quot;,  what means, without a soul. The main character gets into a storm, discovering the talent of the &quot;Watcher&quot;, which allows him to communicate directly with other people&#39;s souls and see other people&#39;s lives. During the game, he must reveal his purpose and find a way to solve the problem of &quot;Hollowborn&quot; children.</p>\n<p>You will need to travel around the world of Eora, performing tasks for different groups, the relationship with each of which determines a specific reputation system. Reputation is calculated separately for each group and depends on the actions of the player. Fights with opponents occur in real time with the ability to stop the time. Up to five characters-companions can accompany the hero, they not only help in combat but also reveal some important details of the plot.</p>\n<p>This game uses a unique role-playing system. A prominent place in it is given to the skills and abilities of the character, not related to the battles. The feature of this system is that the combat and non-combat skills of the character develop independently.</p>", "metacritic": 89, "released": "2015-03-26", "tba": false, "updated": "2024-03-20T02:21:26", "background_image": "https://media.rawg.io/media/games/789/7896837ec22a83e4007018ddd55e8c9a.jpg", "website": "https://eternity.obsidian.net/", "rating": 3.96, "rating_top": 4, "added_by_status": {"yet": 360, "owned": 3177, "beaten": 353, "toplay": 182, "dropped": 357, "playing": 95}, "playtime": 9, "achievements_count": 48, "ratings_count": 698, "suggestions_count": 596, "game_series_count": 1, "reviews_count": 706, "platforms": ["PlayStation 4", "Xbox One", "macOS", "PC", "Linux"], "developers": ["Obsidian Entertainment"], "genres": ["RPG"], "publishers": ["Paradox Interactive"], "esrb_rating": null}