{"id": 15834, "slug": "the-walking-dead-season-2", "name": "The Walking Dead: Season 2", "name_original": "The Walking Dead: Season 2", "description": "<p>The Walking Dead: Season 2 is an episodic adventure game based on eponymous comic book series. As it is a sequel to the previous game in the Walking Dead series, the further story progress depends on the events of the first part. The game is set in the world inhabited by walkers, as the story takes place after the zombie apocalypse. In the second season, players are offered to assume the role of Clementine, a young member of a group of survivors leaving Georgia and heading towards a large survivor camp in Michigan. The girl’s moves are controlled in a point-and-click way. The story progresses through short scenes including dialogues with other characters, which can impact upcoming events by selecting certain dialogue options, or short-term action events like defending the camp from walkers. The gameplay also features some sort of exploration and interaction with the environment that can give extra information or various collectible items. On the way through the game players are going to face dramatic turns of the plot caused by their own tough choice.</p>", "metacritic": 80, "released": "2013-12-16", "tba": false, "updated": "2024-04-06T13:37:24", "background_image": "https://media.rawg.io/media/games/471/4712c9ac591f556f553556b864a7e92b.jpg", "website": "http://www.telltalegames.com/walkingdead/", "rating": 4.06, "rating_top": 4, "added_by_status": {"yet": 249, "owned": 3956, "beaten": 1568, "toplay": 99, "dropped": 111, "playing": 18}, "playtime": 10, "achievements_count": 320, "ratings_count": 1420, "suggestions_count": 629, "game_series_count": 4, "reviews_count": 1428, "platforms": ["macOS", "PC", "iOS", "Android", "PS Vita", "PlayStation 3", "Xbox 360", "Nintendo Switch", "PlayStation 4", "Xbox One"], "developers": ["Telltale Games"], "genres": ["Action", "Adventure"], "publishers": ["Telltale Games", "Skybound Games"], "esrb_rating": "Mature"}