{"id": 158312, "slug": "shard-hero", "name": "Shard Hero", "name_original": "Shard Hero", "description": "Description\r\n<p>Shard Hero is a 2D action-platformer game, focused on replayability of content. The player is challenged to finish four different worlds - each of them having different enemies and obstacles. As players play through the worlds they will find better weapons and collectable items that will help them in achieving their final target.</p>\r\nStory\r\n<p>Years ago, our world was shattered into pieces. We call them \"shards\". To travel between them, we use portals. However, creating a stable portal is hard work and only the strongest of mages can achieve that. And even then, they sometimes make mistakes...<br/>That's what happened to Uvfora and her student, Kyrcy. Because of the mistake by the old wizard, they end up in the wrong shard, which eventually results in Kyrcy being taken captive by dwarves. The only person who can save her is you!<br/>But... that's just the beginning of the story.</p>\r\nWizard's Tower (Lobby)\r\n<p>Wizard's Tower is a place in which you can prepare for your attempt at one of the worlds. Using your collected gems you can unlock new weapons and upgrade items, like health potions or keys. You can also see progress on your collections, which reward you with special weapons. Once you are ready, step into the portals to start your adventure.</p>\r\nWorld Map\r\n<p>Each time you start the world you will see a map of shards that will lead you to the final target. Aside from special shards with bosses, most of the shards will be placed randomly on your way. Every time you go in, your experience will be different. On the map, you will be able to see target and collection items of every shard - you will be able to decide to pick a path that suits you the best.</p>\r\nShard targets\r\n<p>In every shard you will have to find and open portals. Opening portal will require you to do different actions, depending on target. It may be just finding crystals and transporting them to a portal, or it might be having to follow the crystal to stay in life-saving light.</p>\r\nList of features:\r\n<ul><li>Dynamic combat, allowing different playstyles and possibilities by various weapon combinations</li><li>Four different worlds</li><li>Five bosses on each of the worlds</li><li>A lot of levels, with few different possible targets</li><li>Many weapons, with different attacks and passive effects</li><li>Collections, that will challenge the player to explore every map of the worlds and rewards them with powerful items</li></ul>", "metacritic": null, "released": "2018-01-15", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/645/6452b9f962984e85dd973abb18d9d9e2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 92, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["secretStuffGames"], "genres": ["Action", "Platformer"], "publishers": [], "esrb_rating": null}