{"id": 15842, "slug": "header-goal-vr-being-axel-rix", "name": "Header Goal VR: Being Axel Rix", "name_original": "Header Goal VR: Being Axel Rix", "description": "<strong>HEADER GOAL VR</strong>INTRODUCTION<strong>Axel Rix</strong>, a young soccer player. Since being selected for the England National Football Team he was the center of attention. Nowadays, things are not going well for him. In his last couple of games, he was the main reason behind the loss especially with his inaccurate headers. The media and the supporters are started being so heavy on him. Increased pressure on his shoulders made him behave like a lunatic and lastly, he has been kicked out of the national team. His career has taken a serious damage. He can’t bring himself to this situation. To get back to his once successful days he starts to train really hard. While he keeps on working, extraordinary things start to happen around him, which will eventually lead him to become the hero of an another story.DESCRIPTIONHeader Goal VR is a physics based, action pumped, virtual reality sports game with a simulation like interaction dynamics. Through its story based levels you find yourself in the place of the character Axel Rix who is a young soccer player. Your main goal is to hit thrown balls by heading while targeting various objects in a soccer training field. Each stage has a unique level design. To achieve a better score, you should have a plan. Even hitting the targets in the right order makes a great difference. You will start feel like Axel within the immersive atmosphere of the game.<br/><br/>Being able to hit a virtual ball in the most natural and realistic way makes Header Goal VR the most entertaining way of heading a ball.FEATURES-\tStory Based Gameplay<br/>-\tPhysics based, natural and realistic heading dynamics<br/>-\tFully dynamic lighting<br/>-\tDestroyable, breakable objects<br/>-\tCombo Mechanism<br/>-\tUnique and challenging levels<br/>-\tEasy to Learn, difficult to master game dynamics<br/>-\tAchievements<br/>-\tLeaderboard<br/>-\tMulti-Language User Interface<br/>-\tHTC Vive &amp; Oculus Rift SupportPLANNED UPCOMING FEATURES-\t2 new episodes each including 10 different levels<br/>-\tEndless Mode<br/>and more…", "metacritic": null, "released": "2016-11-18", "tba": false, "updated": "2019-08-28T22:11:20", "background_image": "https://media.rawg.io/media/screenshots/3f6/3f6a4783de61776b4c0c99a32410e8bb.jpg", "website": "http://www.headergoalvr.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 4}, "playtime": 6, "achievements_count": 25, "ratings_count": 0, "suggestions_count": 255, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Codemodeon"], "genres": ["Action", "Simulation", "Sports", "Indie"], "publishers": ["Codemodeon"], "esrb_rating": null}