{"id": 15845, "slug": "marmoset-toolbag-2", "name": "Marmoset Toolbag 2", "name_original": "Marmoset Toolbag 2", "description": "Marmoset Toolbag™ is a full-featured, real-time material editor and renderer bundled in a tidy package. Toolbag provides a powerful and efficient workflow, bringing exemplary rendering quality to every stage of the 3D art pipeline. For R&amp;amp;D, from pre-production to post-production, Toolbag is an essential tool for every 3D artist. Use Toolbag as a final presentation tool for your artwork, a high fidelity viewer for asset sharing and internal reviews, or simply as a material and texture map previewer. Or just have fun with it - we think you'll like what you see.Dota 2 Support!With full shader support to match Dota 2's material setup, Toolbag 2 is a great visualization and final render tool for your Steam Workshop asset development. Directly import a Valve Material Type (.vmt) to get started quickly. Check out our Dota 2 Shader overview: http://vimeo.com/87235066.Export to WebToolbag 2 includes our very own <strong>Marmoset Viewer</strong>, a WebGL viewer that delivers a 3D web experience second to none - no plugin required. Construct your scene in Toolbag and export a high quality 3D presentation with the click of a button. Viewer runs on thousands of devices and a variety of browsers, with support for Windows, OS X, iOS and Android operating systems. Check out the Viewer intro video: http://vimeo.com/120704661Full Scene AheadToolbag has been greatly expanded to include a full suite of scene editing tools. Control multiple meshes, lights, cameras, and groups with a completely rebuilt user interface. The new, centralized Toolbag scene file (.tbscene) makes for simple and straightforward transferability, and dynamic mesh and texture reloading ensure a lossless workflow.Light Your WayThe new sky editor features instantaneous processing of background images and one-click light creation. Combined with directional, spot, and omni lights with gels and soft shadows, the new lighting system is ready to put your work in its best light.Get PhysicalToolbag 2 also brings rendering features for physically-based shading workflows. With options for energy conservation, &amp;quot;metalness&amp;quot;, realistic Fresnel, and self-occlusion, Toolbag is ready to meet the needs of modern art production. To have you up and running quickly, Toolbag 2 ships with a full set of physically-based preset materials, featuring PBR scan data.Material GoodsToolbag 2's modular material system makes a vast array of combinations possible. Choose the modules that work for you and your workflow from an expanded array of shaders. Alongside the basic albedo, specular, gloss, and normal settings, you will find:<br/><br/> <br/><ul><li>Dynamic Tessellation<br/></li><li>PN Triangle mesh smoothing<br/></li><li>Height &amp;amp; Vector Displacement modes<br/></li><li>Detail Normal Maps<br/></li><li>Parallax Occlusion Maps<br/></li><li>&amp;quot;Metalness&amp;quot; Maps<br/></li><li>GGX, Blinn-Phong, &amp;amp; Anisotropic Reflections<br/></li><li>Secondary Reflections<br/></li><li>Skin Diffusion<br/></li><li>Microfiber (&amp;quot;Fuzz&amp;quot;) Diffusion<br/></li><li>Occlusion and Cavity Maps<br/></li><li>Emissive Maps<br/></li><li>Dota 2 and Unreal 4 templates<br/></li><li>Allegorithmic Substances support<br/></li><li>Dithered Supersampled Transparency<br/></li><li>...and more on the way!</li></ul>", "metacritic": null, "released": "2015-08-17", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/14f/14f296b3ab9ba88b65a764625674d2e4.jpg", "website": "http://www.marmoset.co/toolbag", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3}, "playtime": 19, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 211, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Marmoset"], "genres": [], "publishers": ["Marmoset"], "esrb_rating": null}