{"id": 158496, "slug": "epic-zeds-tale", "name": "Epic Zed's Tale", "name_original": "Epic Zed's Tale", "description": "<p>Good Morning Ms. Holloway, or otherly playing user<br/>I hope you find this game in good use. <br/>Mind you, in this version of the development of EPIC ZED's TALE, The game is not complete.<br/>I have only included one artifact in this build of the game, and that is located somewhere on the map.<br/>When exploring as Zed, if you see the Interact Icon \"glowing\" above Zed's head, you can interact with an object.<br/>Interact looks like it would be the Enter Button, but due to unforeseen circumstances, it has been swapped to J.<br/>I will most likely change Interact to Enter, but for now it is J, so deal with it.<br/>Also, on Itch.io, the whole game panel is visible, you just need to scroll the screen til the whole game screen is on your computer. With smaller computers you may also need to zoom out?</p>\n<p>Now, controls:<br/> WASD or ARROW KEYS work to move Zed, or a joystick if you have one<br/> J is interact<br/> 1 - 5 is how to read or get out of reading the corresponding artifact.<br/> YOU MAY ONLY READ AN ARTIFACT ONCE THE ICON SHOWS ON THE TOP RIGHT HAND SIDE<br/> <br/> That's all for this build of the game, and more changes will follow soon (Hopefully)</p>\n<p>Thank you, Anshal Jain<br/><br/>P.S.</p>\n<p>I give full credit for the character sprites to Erbarlow, at https://opengameart.org/content/more-nes-style-rpg-characters<br/>Al chess sprites go to Clint Bellanger, at https://opengameart.org/content/chess-set-for-gbjam (COMING SOON)</p>", "metacritic": null, "released": "2018-04-18", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/9f7/9f7dc78e19dd98dfb8980209764ea56a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 18, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["ThunderCow"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}