{"id": 15844, "slug": "123-slaughter-me-street", "name": "123 Slaughter Me Street", "name_original": "123 Slaughter Me Street", "description": "Welcome everyone to 123 Slaughter Me Street! <br/>\n<br/>\r\nA criminal on the run, you find yourself evading police as you make your escape down an alley. You see an old fire escape and scramble up to the roof of an abandoned building; you are safe here. <br/>\n<br/>\r\nAs the patrol cars drive past, you slip into the shadows. The coast is clear, you just got away with it… or did you? <br/>\n<br/>\r\nOn your way back towards the fire escape, the roof gives out from under you and you plummet into darkness. You are wounded, and only equipped with a dying flashlight. Where are you? You must now escape this building. <br/>\n<br/>\r\nA twisted ankle, a busted flashlight, in the middle of one of man's great casualty of progress. <br/>\r\nThis is the price you pay for avoiding the police. <br/>\n<br/>\r\nIt smells of death here; the stench of frustration, success and the festering of old hopes. <br/>\r\nA shuffling rises up from the infinite darkness before you. <br/>\n<br/>\r\nRats? No, too big for rats. <br/>\n<br/>\r\nStray dogs? Squatters? <br/>\n<br/>\r\nWhat else? <br/>\n<br/>\r\nYou're not hoping to find out, but you must go forth. Determined, you enter the gaping maw of obsolescence. There must be an exit... Get to the exit. <br/>\n<br/>\r\nA heart pounding, anxiety inducing, paranoia paradise; 123 Slaughter Me Street is like no other. With a completely unique set of controls and limited mobility, players must have their wits about them. <br/>\n<br/>\r\nGet to the exit, and do so swiftly.", "metacritic": null, "released": "2015-09-25", "tba": false, "updated": "2022-09-29T23:48:06", "background_image": "https://media.rawg.io/media/screenshots/c19/c19d3ef3ee8497650009e31b501de488.jpg", "website": "http://www.impulsegamestudios.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 126, "beaten": 1, "toplay": 1, "dropped": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 3, "suggestions_count": 163, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC"], "developers": ["Nate Sanders", "John Kolbek"], "genres": ["Action", "Indie"], "publishers": ["Impulse Game Studios"], "esrb_rating": null}