{"id": 15854, "slug": "star-wars-x-wing-alliance", "name": "STAR WARS - X-Wing Alliance", "name_original": "STAR WARS - X-Wing Alliance", "description": "<p>A neutral family fights for its business - and its survival - and is swept up in the struggle against the encroaching Empire. You must defy the strong-arm tactics of a rival family who will stop at nothing to destroy your trading company. Ultimately, you will join the Rebel Alliance for a series of covert assignments and uncover information about the Empire&#39;s second Death Star project. The finale? You&#39;ll find yourself at the controls of the legendary Millennium Falcon , flying against the massive Imperial fleet in the Battle of Endor. Star Wars™: X-Wing Alliance™ puts you right in the middle of the epic Star Wars™ conflict - and takes space combat excitement to new heights.<br />\nKey features:<br />\nTake control of the &quot;fastest ship in the galaxy&quot; - the Millenium Falcon - as well as X-wings, A-wings, B-wings, Y-wings and Corellian transports<br />\nJoin the massive assault on the fully operational second Death Star in the epic Battle of Endor<br />\nFifty story-driven single player missions and flexible multi-player options<br />\nWith new &quot;skirmish&quot; mode, you set your own mission parameters (number of ships, types of ships, targets, and more) to create customized single and multi-player conflicts</p>", "metacritic": null, "released": "1999-02-28", "tba": false, "updated": "2023-09-23T18:55:15", "background_image": "https://media.rawg.io/media/screenshots/e22/e223324f42af56a3b4f5dd93444f78ec.jpg", "website": "", "rating": 2.87, "rating_top": 1, "added_by_status": {"yet": 60, "owned": 772, "beaten": 16, "toplay": 6, "dropped": 11}, "playtime": 1, "achievements_count": 0, "ratings_count": 38, "suggestions_count": 303, "game_series_count": 0, "reviews_count": 38, "platforms": ["PC"], "developers": ["Totally Games"], "genres": ["Action", "Shooter", "Simulation"], "publishers": ["LucasArts Entertainment"], "esrb_rating": null}