{"id": 15859, "slug": "star-wars-knights-of-the-old-republic-2", "name": "Star Wars: Knights of the Old Republic", "name_original": "Star Wars: Knights of the Old Republic", "description": "<p>The game takes place in the world of the epic &quot;Star Wars&quot;.<br />\nWhen creating a character, first select a class - Soldier, Scoundrel or Scout. Classes differ in the proportion of strength, health and cunning. Later, three more classes will open, each of which will be a Jedi: Jedi Guardian, Jedi Consular, and Jedi Sentinel. This will also be the choice in favour of different proportions of strength, intelligence and skills.<br />\nIn the world of &quot;Star Wars,&quot; there is a Force that can be vested both by the Jedi and by their enemies. There are Force Powers of three types: light, dark and neutral. They should be studied, this raises the level of skill. Forces are expended but are restored.<br />\nThe player can alternately lean toward both the Light and the Dark Side of the Force - this will affect the ending of the game and the use of Force Powers. For example, if the character belongs to the Light Side, then the use of the Dark Force will require more of this Force from him than using the Light.<br />\nThe hero will visit the underground metropolis, the desert planet, the planet-forest and the planet-ocean, caves with crystals for light swords, sand Tatooine, the planet-cemetery, space ships and stations.<br />\nThe hero will interact with sentient beings, droids of different classes and exotic animals.</p>", "metacritic": 88, "released": "2003-07-15", "tba": false, "updated": "2024-04-19T05:21:47", "background_image": "https://media.rawg.io/media/games/6e0/6e0c19bb111bd4fa20cf0eb72a049519.jpg", "website": "https://www.starwars.com/games-apps/knights-of-the-old-republic", "rating": 4.37, "rating_top": 5, "added_by_status": {"yet": 402, "owned": 4546, "beaten": 1049, "toplay": 211, "dropped": 335, "playing": 51}, "playtime": 2, "achievements_count": 0, "ratings_count": 1412, "suggestions_count": 512, "game_series_count": 2, "reviews_count": 1419, "platforms": ["Xbox 360", "Xbox", "Nintendo Switch", "Xbox One", "Android", "iOS", "PC", "macOS"], "developers": ["Aspyr Media", "BioWare", "Lucasfilm"], "genres": ["Action", "RPG"], "publishers": ["Aspyr", "LucasArts Entertainment"], "esrb_rating": "Mature"}