{"id": 158585, "slug": "nostragamus", "name": "Nostragamus", "name_original": "Nostragamus", "description": "<p><strong>Swipe to Predict</strong><br/></p>\n<p>Welcome to fantasy sports for the new age.  Unlike other free cricket games, just read the stats and predict events in live matches with a simple swipe.  That's all!<br/><b>Win Prizes Every Week</b><br/>Play weekly challenges in the English Premier League and Champions League, NBA,French Open,  IPL, Champions Trophy, India v Australia, New Zealand v South Africa, Sri Lanka v Bangladesh, Pakistan v West Indies.<br/>Get to know interesting stats about your favourite stars – Virat Kohli, R Ashwin, MS Dhoni, Ravindra Jadeja, Ben Stokes, Chris Gayle, Roger Federer, Rafael Nadal, Novak Djokovic Lionel Messi, Cristiano Ronaldo, Alexis Sanchez are all covered in the game.<br/>Weekly challenges, weekly prizes.  Maximum fun!</p>\n<p><strong>Tournaments Covered</strong><br/>Champions Trophy, the second biggest International tournament in Cricket after the World Cup, begins in less than a fortnight, and play our version of daily fantasy by predicting events every day.  All the matches played by India - the defending champions, Australia England, New Zealand, South Africa, Pakistan, Sri Lanka and Bangladesh will be covered. </p>\n<p>French Open, the second Grand Slam event of the year begins in less than a week, so start playing the challenges, predict the winners and stand a chance to win exciting prizes. All the matches played by the defending champion Novak Djokovic, Rafael Nadal, Andy Murray, defending champion Gabrine Muguruza, Angelique Kerber, Simona Halep and Caroline Wozniacki will be covered. </p>\n<p>Match scores in football &amp; cricket are just a click away.  We cover all matches played by India, Australia, Sri Lanka, Bangladesh, New Zealand, South Africa, West Indies, England and Pakistan.  In football, we cover matches played by Manchester United, Manchester City, Arsenal, Chelsea, Tottenham Hotspur, Liverpool, Barcelona, Real Madrid, Bayern Munich and much more.</p>\n<p>Check back whenever you need to see the match results and how many points you won.<br/>Follow all your favourite sports in a fun way, and win prizes by predicting matches correctly!</p>\n<p><strong>Play with Friends</strong></p>\n<p>Play in public leagues or create your own.  Win more points by inviting your friends to join the fun.  Compete with your friends or play against the best in the world.  Any sport, any match.  Win amazing prizes by simply swiping to predict.  </p>\n<p>Disclaimer: Nostragamus is a free-to-play just for fun game and is not a form of gambling. We take no responsibility for actions performed by its users outside of Nostragamus or on the sites of any of its advertised partners. Nostragamus does not condone gambling in any way.</p>\n<p>Check out http://nostragamus.in/ for more details.</p>", "metacritic": null, "released": "2017-05-24", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/872/872263dfd4c192543b189d634aaef96a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 47, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Sportscafe"], "genres": ["Sports"], "publishers": [], "esrb_rating": null}