{"id": 158665, "slug": "rebel-with-a-curse", "name": "Rebel With a Curse", "name_original": "Rebel With a Curse", "description": "<p>Thanks everyone for taking time to\r\ncheck out my project! First, a little about the game. Rebel With a\r\nCurse is a 2d role-playing game with an emphasis on story-telling.\r\nFollow Setvin, a navy captain turned pirate who is struggling to find\r\nhis place in life. Join his struggle to fight hopelessness and do\r\nwhat ever it takes to find freedom and purpose.</p>\n<p>My development of Rebel With a Curse\r\nwas inspired by an experience I had in 2015 when a severe alkali burn\r\ndamaged my left eye beyond repair. It mirrors my own struggle to find\r\nhope and purpose in a world that I thought had abandoned me. I've\r\nalways wanted to make a video game, but I never felt like what I made\r\nwas good enough to share – until I started on this project. It is\r\nsomething I have spent a lot of time developing off and on for the\r\npast few years and I have finally reached a point where I want to\r\nshare it with the world so I can receive criticism and help test some\r\nof the technical aspects. </p>\n<p>There is a lot of content already\r\navailable, but things like spelling errors and glitches may still\r\nexist. It can be hard to test a game of this size by myself, so If\r\nyou have any suggestions or encounter any spelling errors or\r\ntechnical errors I welcome you to share them with me so I can\r\nimmediately fix them. Please feel free to contact me at\r\nsightlesseyeentertainment@gmail.com</p>\n<p>I\r\nused to host this game on a personal website which I paid for, but\r\ndue to my economic status I am no longer able to afford to host my\r\nown website. Perhaps one day I will be able to re-upload my website,\r\nbut for now I will be using this website as my main hosting source. <br/></p>\n<p>Rebel With a Curse is completely free to play and there are no in\r\ngame advertisements or purchases. I do suggest, however, if you\r\nenjoyed your experience and if you believe in this game as much as I\r\ndo, please consider donating. Even a small contribution would go a\r\nlong way – but that being said, just playing the game and offering\r\nsuggestions or bug-fixes would help me a lot as well. Thank you for\r\nyour time.</p>\n<p> W A R N I N G:<br/></p>\n<p>“Rebel With a Curse” is an unrated\r\ntitle currently in development – those who are sensitive to foul\r\nlanguage, references to alcohol and crude humor should avoid this\r\ngame. This is meant to be a more mature, darker take on what one\r\nwould normally expect. I recommend an age of 18+  </p>", "metacritic": null, "released": "2018-08-22", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/cf7/cf7c1e897496dd539c6f98f61734fd8b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 77, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["sightlesseye"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}