{"id": 15860, "slug": "star-wars-the-force-unleashed-2", "name": "STAR WARS: The Force Unleashed II", "name_original": "STAR WARS: The Force Unleashed II", "description": "<p>STAR WARS: The Force Unleashed II is a third person action/adventure video game with elements of platforming. It is a sequel to STAR WARS: The Force Unleashed released in 2008. The game was created during nine months development cycle and despite some similarities to the first one, TFUII offered elements such as modified sound effects and gameplay. The main protagonist of TFUII is a clone of Starkiller, who has a secret history with Dart Vader. The main goal of a game is to find your true identity and find protagonist&#39;s love – Juno Eclipse. The game takes place about six months after the events of the first entry in the series and one year before the first Star Wars film. TFUII is known for its dark and much more personal story compared to the first game. There are two main weapons in the game – The Force itself and a famous lightsaber with which you can do various different combos. TFUII also adds another new element – puzzles, the ability to wield two lightsabers at a time and more Force powers then the original.</p>", "metacritic": 59, "released": "2010-10-25", "tba": false, "updated": "2024-03-14T10:05:27", "background_image": "https://media.rawg.io/media/games/693/693952316d4b90984a92e7ab0f5c9b81.jpg", "website": "http://www.theforceunleashed.com", "rating": 3.65, "rating_top": 4, "added_by_status": {"yet": 187, "owned": 2337, "beaten": 647, "toplay": 67, "dropped": 113, "playing": 8}, "playtime": 3, "achievements_count": 47, "ratings_count": 543, "suggestions_count": 653, "game_series_count": 57, "reviews_count": 544, "platforms": ["PlayStation 3", "Xbox One", "Nintendo DS", "Xbox 360", "PC", "Wii"], "developers": ["Aspyr Media", "LucasArts Entertainment", "Lucasfilm", "Red Fly Studio"], "genres": ["Action", "Adventure"], "publishers": ["Disney Interactive", "LucasArts Entertainment"], "esrb_rating": "Teen"}