{"id": 15862, "slug": "star-wars-x-wing-vs-tie-fighter-balance-of-power-c", "name": "STAR WARS X-Wing vs TIE Fighter - Balance of Power Campaigns", "name_original": "STAR WARS X-Wing vs TIE Fighter - Balance of Power Campaigns", "description": "Real-time against real pilots; this is Star Wars space combat as it was meant to be! Featuring challenging real-time dogfights of 2 to 8 players, <strong>Star Wars™: X-Wing vs. TIE Fighter</strong> is one of the most historically significant space combat simulators ever made. Never before were virtual pilots able to climb into the cockpit of an Empire or Rebellion starfighter and have the choice of flying alone or with others, cooperatively or competitively.<br/><br/>Fly over 50 combat missions in nine meticulously enhanced Star Wars starfighters with or against your friends. Or engage in melees, taking on all rivals, to determine once and for all who is the greatest starfighter pilot in the galaxy. The power of the Force™ resides in the most skilled and daring pilot.<br/><br/>Choose your craft and choose your weapons, but most of all, choose your wingmates very carefully. Your life may depend on it!<br/><br/><strong>Key features: </strong><br/><ul><li>Multiplayer modes supporting up to 8 players over LAN.<br/></li><li>Over 50 combat missions and nine iconic spacecrafts to choose from.</li></ul>", "metacritic": null, "released": "2015-04-28", "tba": false, "updated": "2023-09-23T18:42:28", "background_image": "https://media.rawg.io/media/screenshots/4e0/4e0798f6018b73c1c9cf9895ca896c77.jpg", "website": "", "rating": 3.21, "rating_top": 4, "added_by_status": {"yet": 48, "owned": 707, "beaten": 8, "toplay": 1, "dropped": 10}, "playtime": 1, "achievements_count": 0, "ratings_count": 29, "suggestions_count": 174, "game_series_count": 0, "reviews_count": 29, "platforms": ["PC"], "developers": ["Totally Games"], "genres": ["Action", "Simulation"], "publishers": ["Disney Interactive", "LucasArts Entertainment"], "esrb_rating": null}