{"id": 158638, "slug": "nest-defender-the-first-the-start-of-an-empire", "name": "Nest Defender The First: The Start Of An Empire", "name_original": "Nest Defender The First: The Start Of An Empire", "description": "<p>Built for My First Game Jam Summer 2018<br/></p>\n<p> Nest Defender The First is a bundle of nonsense that was built from an off the cuff game pitch suggested by my sister. The requirements were:</p>\n<ul><li>You play as a laser-eyed crow</li><li>you are defending your nest from humans trying to take your eggs</li><li><strong>SPOILERS</strong>Upon letting an egg get stolen, the finale of the game begins, where you chase down the offending human.<strong>SPOILERS</strong></li></ul>\n<p>With this short description, I decided to make the game for real as a surprise.</p>\n<p>According Gamemaker Studio 2's development timer, this game took me about 22 hours, in 5 or 6 sessions.<br/></p>\n<p>Thanks for playing!</p>\n<p><strong><em>HOW TO RUN: </em></strong>Extract the zip into a folder, make sure that both the exe and the data.win are in the same directory, Then double click the exe.<br/></p>\n<p>Apart from the inspiration provided by the game pitch, I was also largely inspired by Super Benbo Quest: Turbo Deluxe, which showed me that laughing at a game's completely slipshod construction is still laughter, and to Getting Over It With Bennett Foddy (and more specifically, the game talked about within, Sexy Hiking) for showing me that if you make it freeware, you can get away with a lot of asset ripping, which I really needed to finish in time. I was developing this game up until an hour before the deadline!</p>\n<p>Several stuff was ripped in the process of making this game. Here's some credits, as I don't claim to have created any of the assets listed below:</p>\n<p>Music: Rollergames (NES) stage 2 and 3, Street Fighter 2 Turbo opening theme, Contra: Hard Corps Briefing theme.</p>\n<p>Sprites: Image search result for \"crow,\" and Ray's sprite from Contra: Hard Corps, and some explosion sprites with the usage condition of not claiming you made them.<br/></p>", "metacritic": null, "released": "2018-07-28", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/b13/b13b8e864cce54fc46c154063d5d26cd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 62, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Tyclev"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}