{"id": 158617, "slug": "broc-en-stock", "name": "Broc' en Stock", "name_original": "Broc' en Stock", "description": "Description <br/><p>Broc en Stock is the first game that a friend and I made using Unity 4.x (so a while ago). I've imported the files in Unity 5.4 and decided to upload it on itchio.</p><p>This game looks a lot like a whac-a-mole but instead of hitting moles, you burn broccoli.</p>How To<br/><p>Although the menus are in french, there's nothing hard to understand :p. Each burner is controlled by a single input button, and press them at the right time, on the right broco :p (you should avoid the glitchy one)</p><p><strong>There are some trouble with the inputs : <br/></strong></p><ul><li>You should play with a <strong>xbox controller</strong> (using arrows and buttons)</li><li>If you don't have a controller, the keys are <strong>zqsd and arrows</strong> which is not covenient for english keyboard sorry).</li><li>If you use your keyboard, use zsqd to navigate the menus and the down arrow to validate<br/></li></ul><p>I won't update this game, but please share your highest score (13258 for me)</p><p>The score display can break, but at the end of your game you will have your true score.<br/></p>The Authors<p> Assets made by : The kinograph</p><p>Code and Unity Integration : Marc GIraud-telme<br/></p>Final word<p> We made this a game the year <strong>before</strong> I joined the 42 computing scool in Paris, so if you check the source code, please don't be too hard on me :p <br/></p>", "metacritic": null, "released": "2016-08-31", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/ccd/ccd450d05167eae7c4c0c6f74af56a06.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 29, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["eowindil"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}