{"id": 158806, "slug": "penguin-tales", "name": "Penguin Tales", "name_original": "Penguin Tales", "description": "<p>Penguin Tales is an EPIC 2D-Action \"endless-runner\" with multiple worlds to explore, coins to collect, and 21 challenging levels to conquer. You will play as a young penguin named Gills who is born with an odd-red pigment. Because of Gills different color, he is greatly bullied by his peers and deemed an outcast by the Blue and Fairy Colony. Determined to be accepted, he sets out on an epic journey to discover the \"Hidden Chest\".</p>\n<p>There is only one rule...DON'T DIE!</p>\n<p><strong>THE PENGUIN TALES STORY</strong></p>\n<p>A time ago, a young penguin was born with an odd-red pigment to young penguin couple Jack and Charlotte. He was given the name Gills due to his incredible feats of fish-like swimming abilities. He was raised in the Blue Fairy Colony located on the southern coasts of Phillip Island under the leadership of King Pogo the XXIII. Because of Gills different color, he is greatly bullied by his peers and deemed an outcast by the Blue Fairy Colony.</p>\n<p>Determined to be accepted, he sets out on an epic journey to discover the \"Hidden Chest\". The \"Hidden Chest\" is a prophecy about a 100 year old secret treasure chest located in the Amazon River Basin and whoever discovers it, would be the next \"High-King\" of all penguin colonies. Many penguins have launched epic quests to find this chest in hopes of becoming the next High-King, but only one penguin has lived</p>\n<p>Features</p>\n<p>- Story mode contains 21 impossible levels across multiples worlds - you travel through the Arctic, Amazon River, and the Pacific Ocean!</p>\n<p>- Simple yet addictive 1-click gameplay!</p>\n<p>- 8 Penguin Tales Original Soundtracks to create the mood for each world!</p>\n<p>- Each world presents its own unique set of obstacles, dangers, and creatures!</p>\n<p>- Almost every level includes a bonus area full of goodies and new challenges!</p>\n<p>- There are exactly 100 Collectibles strategically placed throughout the entire game!</p>\n<p>- Every 100th coin collected credits the player with an extra life!</p>", "metacritic": null, "released": "2017-04-25", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/18b/18bccde393a227174e05e3ae5a0706d1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 104, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["dabstudio7"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}