{"id": 158827, "slug": "spin-rush-itch", "name": "Spin Rush (itch)", "name_original": "Spin Rush (itch)", "description": "Game<p>As you play the game, you level up and unlock different fun modes that can be played and explored. There are many modes available to unlock and they are all different and challenging in their own way.</p>ModesThere are up to 6 modes that can be unlocked and played. All of the modes are combined when playing in normal mode. Fast mode: Dots fall faster as time progresses, so it's more challenging to progress far. <br/>Hexagon mode: Play with a hexagon cube and with two additional colors. <br/>Words mode: Words of various colors fall, while the dot is in another color to mix things up. <br/>Time mode: Don't stop the spinning cube or you'll lose. <br/>Trippy mode: Colors change over time, so you have to keep eye on right colors to mix. <br/>Flipped mode: Camera rotates and controls are reversed every time a dot falls.LevelsAs you play, you will level up over time and as you progress, you will unlock new surprises and modes. Over time, levelling up will become harder, but also more rewarding as more interested modes become unlocked at higher levels. The game responds to game music. Beats cause the screen to shake and the amazing sound effects give a better feeling to game. There are many soundtracks available for the<br/>different game modes in addition to soundtracks with voice overs. <br/>As well, there is an endless level, where all modes are combined together into one. That's <br/>more interesting and advanced, but also harder to keep on track since the game is randomly <br/>generated.", "metacritic": null, "released": "2017-03-02", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/2ee/2ee7453398c4a37c6538df5b540f2aa1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 87, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["CybeRoar"], "genres": ["Action"], "publishers": [], "esrb_rating": null}