{"id": 158841, "slug": "war-cannon", "name": "War Cannon", "name_original": "War Cannon", "description": "<p>• Informações<br/></p>\n<p>Engine: Construct2<br/>Plataforma: PC<br/>Ambientação: 2D<br/>Gênero: Ação/shooter<br/>SubGênero: Shoot’em Up</p>\n<p>• Historia</p>\n<p>O programa Seti, responsável por buscar inteligência extraterrestre usando um poderoso sinal de satélite lançado ao espaço, atrai a atenção de uma raça alienígena hostil que quer dominar o nosso planeta. Para proteger a humanidade, as maiores mentes do nosso mundo criam um novo tipo de tanque de guerra, apelidado de WARCAN, capaz de combater as hordas de naves alienígenas.</p>\n<p>• Objetivo</p>\n<p>Fazer a maior pontuação possível, sobrevivendo o máximo de tempo que conseguir, protegendo os prédios da cidade e  destruindo o máximo de naves e balas inimigas.</p>\n<p>Tem 3 tipos de naves e cada tipo dá uma pontuação diferente e aparecem a partir de uma certa pontuação, dessa forma, aumentando gradativamente a dificuldade do jogo; as balas inimigas também podem ser destruídas e dão pontos ao jogador, caso as balas inimigas acertem o jogador ou o chão, o jogador não ganha pontos pela destruição das mesmas; CUIDADO ao atirar, pois a cada 3 tiros o WARCAN (o tanque) superaquece e precisa de alguns segundos para resfriar, depois de uma certa pontuação o numero de tiros antes do superaquecimento é aumentado, durante o superaquecimento não é possível atirar; o tempo também dá pontos ao jogador e ao final do jogo é mostrado a pontuação total na partida, a pontuação máxima já feita e quantas balas e naves o jogador destruiu, além de mostrar o tempo total da partida. Bom Jogo!</p>", "metacritic": null, "released": "2018-06-23", "tba": false, "updated": "2019-08-28T23:21:51", "background_image": "https://media.rawg.io/media/screenshots/049/049497e5ce146b799319517df4f6fdff.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 41, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["TortugaGames"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}