{"id": 15885, "slug": "frontiers", "name": "FRONTIERS", "name_original": "FRONTIERS", "description": "FRONTIERS blends the feel of first-person RPG classics like Daggerfall with the relaxing tempo and simplicity of a point-and-click adventure. Discover ancient mysteries, live off the land and fight deadly creatures, all in a beautiful, massive open world.Is FRONTIERS for you?<br/>I can still remember the first time I played Daggerfall. Yes, it was uglier than a monkey's armpit and controlled worse than a bumper car on a frozen lake. But it also created the feeling of a world that lived on even after I'd stopped playing, and that feeling still sticks with me all these years later. A world where you could spend hours searching every pixelated nook and cranny. A world of potential. A world of exploration...<br/><br/>...and then a Dragonling would chomp my face because I hadn't spent ten hours grinding in the easy regions. Arg! So frustrating! <br/><br/>Other games have touched on that elusive feeling, especially Elder Scrolls and early Fallout games, but as fun as they are and as much as I love hardcore RPG mechanics, I've always dreamt of a game that emphasized exploration above all else.<br/><br/>If you feel the same way then yes - FRONTIERS is for you!Key Features:<ul><li>Massive open world - go anywhere, any time<br/></li><li>Unique relaxing pace and tone<br/></li><li>An exploration-focused main quest that spans an entire continent<br/></li><li>Simple gameplay - no stats or skill trees to memorize (It barely qualifies as an RPG, really)<br/></li><li>Live off the land - hunt, trap, fish and cook dozens of varieties of plantlife (including hallucinogens!) and a dozen varieties of animal<br/></li><li>Minecraft-style item crafting system<br/></li><li>Dozens of skills to discover and learn, including magic, survival and stealth skills<br/></li><li>Hundreds of shops, taverns, homes, caves, castles and other structures to explore<br/></li><li>A haunting soundtrack for every region<br/></li><li>Full mod support<br/></li><li>NEW: Oculus Rift support</li></ul><br/>NOTE: I recommend reading reviews &amp; forum posts before purchasing, especially concerning Linux support.", "metacritic": null, "released": "2014-12-15", "tba": false, "updated": "2024-04-06T13:14:01", "background_image": "https://media.rawg.io/media/screenshots/7b1/7b12d994bc30c05cd492e4bf102f48a1.jpg", "website": "http://explore-frontiers.com", "rating": 2.11, "rating_top": 3, "added_by_status": {"yet": 13, "owned": 269, "toplay": 2}, "playtime": 1, "achievements_count": 4, "ratings_count": 9, "suggestions_count": 532, "game_series_count": 0, "reviews_count": 9, "platforms": ["PC"], "developers": ["AAD Productions"], "genres": ["Adventure", "RPG", "Casual", "Indie"], "publishers": ["AAD Productions"], "esrb_rating": null}