{"id": 158848, "slug": "the-cubic-monkey-adventures-2", "name": "The Cubic Monkey Adventures 2", "name_original": "The Cubic Monkey Adventures 2", "description": "<p><strong>Description:</strong><br/>• Get ready for a whole new adventure! The Cubic Monkey Adventures 2 is an exciting action-arcade game in which your main objective is to collect delicious fruits that will appear throughout the game stage. You will also have to avoid getting hit by coconuts that will appear from both sides of the screen. Use the fruits that you gathered to purchase new cool skins from the shop (Press 'S' Key to open up the shop).</p>\n<p>• Each of the 10 unique skins will bring you different new features for the monkey! The skins act like power-ups, so you can use that in your advantage! Control the cute little monkey with the 'ARROW' Keys and jump by pressing either the 'UP' Arrow Key or the 'SPACE' Key. As you progress throughout the game, you will notice that everything starts to move much faster, this event will have to give you some hints that the game will become much harder and your moves will have to be much faster.</p>\n<p>• Buy new skins and see what works better for you, trust your reflexes. Some skins will help you to collect fruits much faster while other skins will give you a hand with avoiding the coconuts. If you lose all 3 lives, then don't panic, you can always get an extra heart after every run; you will however need to have at least 50 fruits collected. You can always return back to the main menu by pausing the game first (By pressing the 'P' Key) and then by pressing the 'M' Key. You can submit your final score after every game over. Don't forget to challenge your friends and see who is better at avoiding coconuts! Best of luck and have fun!</p>\n<p><strong>Instructions:</strong><br/>Move with Arrow Keys.<br/>Pause the game with 'P' key.<br/>Open the shop with 'S' key.</p>\n<p><strong>Game Dimensions:</strong> 650x400</p>\n<p><strong>Game Category:</strong> Action, Arcade, Adventure, Other</p>\n<p><strong>Movement:</strong> Arrow Keys<br/><strong>Fire / Action:</strong> Not Available<br/><strong>Jump:</strong> Up Arrow</p>", "metacritic": null, "released": "2018-02-24", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/964/9641b100faaf148a461c61d48c3a6618.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 38, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["3man7"], "genres": ["Action"], "publishers": [], "esrb_rating": null}