{"id": 15890, "slug": "angels-that-kill", "name": "Angels That Kill", "name_original": "Angels That Kill", "description": "Angels That Kill is a dark, first person adventure game. It tells the story of two men as they uncover the truth behind a murder that has shaken the city. Play through both sides of the story and discover the truth behind the murder.Play as Micheal Bickel, a Vietnam War veteran that now works as a Noll City detective, and play as James Baley, a drunk and drug-ridden retired boxer who has lost everything and moved to Noll City to start again. Go through the different days playing as both characters and work around the case, interact with the population and make decisions that could affect a number of people. Hide, run, investigate, explore, and discover while becoming a part in Noll City in this tragic time.<br/><br/><br/><strong>Play both sides of the story.</strong><br/>Go through both the suspects and the investigators story, to discover the truth and interact with the people of Noll City. Play through two different perspectives and have unique interactions based off of who you play as.<br/><br/><strong>Stay alive under a steel sky.</strong><br/>Keep a watch on and maintain your hunger level by scavenging through dumpsters to stay alive in this deserted time. Every scrap of food you take for one character is another lost for the other, so make sure you balance your portions carefully.<br/><br/><strong>Explore all your options.</strong><br/>Just because there is a story doesn't mean that you cant help make it, choose between right and wrong, make decisions you didn't mean to, and discover your own ending.<br/><br/><strong>Unlock and play through alternate game modes.</strong><br/>As you progress through the main campaign you will be able to unlock more game modes to play around in.<br/><br/><strong>Explore the world.</strong><br/>It might not be the biggest game ever made, but it is packed full of secrets and goodies waiting to be discovered.<br/><br/><strong>Immerse in a noire inspired world.</strong><br/>Every aspect of the game has been carefully detailed to appeal to any noire(or noir) lover.<br/><br/><strong>Change the world to your choosing.</strong><br/>You have the ability to change the amount of rainfall, the amount of fog, the lighting, and more.<br/><br/><strong>DRM Free</strong><br/>We wouldn't want to restrict how much you can play based off of using Steam.", "metacritic": null, "released": "2015-11-20", "tba": false, "updated": "2019-08-28T22:11:18", "background_image": "https://media.rawg.io/media/screenshots/ecc/ecc1c79ac27c4b13d7294b2f3d85210b.jpg", "website": "http://risingsuninteractive.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 49}, "playtime": 4, "achievements_count": 25, "ratings_count": 0, "suggestions_count": 137, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC", "Linux"], "developers": ["Rising Sun Interactive"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Rising Sun Interactive"], "esrb_rating": null}