{"id": 159082, "slug": "pufferfish", "name": "Pufferfish", "name_original": "Pufferfish", "description": "<p><strong>THE GAME</strong></p>\n\n<p>Pufferfish is a single player arcade game. Developed as a game aimed to younger audience. \r\n  </p>\n<p>The game consists in a series of levels, each level is a different fishbowl, where the player must catch and accumulate pufferfishes. They player catches the pufferfish with a fishing net, the net represents ‘lives’. Each level the player is given 3 lives to complete catching an x amount of pufferfish, after those 3 lives run out, the player has to restart the level. \r\n  </p>\n<p>The game has a very minimalist approach because it aims to entertain the player, it’s more for casual playing and a good stress relief activity.\r\n  </p>\n<p>The colorful UI and environment are especially designed to offer variety and fun while keeping a graphic design approach that makes the transition between level a cohesive experience.\r\n  </p>\n<p> \r\n  </p>\n<p><strong>Background</strong>\n</p>\n\n<p>NezMex studio started in 2018 when I joined MDS in Aucklad. And Pufferfish is the first game produced by the studio. The game started with a very simplistic high concept inspired by the patterns created in parametric design and architecture. </p>\n\n<p>Natures old geometric shape, a beehive made of hexagons. While the game was developed, we discovered the design and style of the game was really blocking any real game to emerge from the original idea. It was more style than substance. So, we decided to have a more open-minded approach and embraced the parametric design idea as a key part of the game but not the main story.\r\n  </p>\n<p>Using bees and a hive would have been way too predictable. Considering the type of animation we had developed already, it was decided to have an underwater theme. Then the whole idea of the game came very naturally, a pufferfish that would change in size (inflate and deflate) if it was small, the pufferfish could swim through the coral reef, represented by the parametric hexagonal grid, but if the fish was inflated, it would be too big to move through the gaps and that’s when the player would have a better chance of catching one.\r\n  </p>\n<p>Finally, the main purpose of the studio was the technical approach to develop all the graphics for the game. Initially we believed we had to create pixel art for the game considering the game engine we were using this time. However, we were reluctant to go in the pixel art direction, then we thought that even if we avoided the 90’s pixel style, we would still have to draw manually each environment and characters for the game. We had to try quite hard to find a practical way to produce the kind of game we wanted within the time frame we were given.\r\n  </p>\n<p>After much trial and error, all the level environments were designed, modeled and animated using only computer algorithms in Rhino/Grasshopper. We also developed a system to ‘render’ each animation frame in a way that was practical to import to Game Maker (our engine) and finally, all the characters including the pufferfish were also modelled and animated in Grasshopper. If this system delayed the development of the game at the initial stages, it gave us also a lot of creative freedom at the end and production stages, as it was very easy to change the patterns, colours and shapes for our animations, something that traditionally painted sprites would have made time prohibitive.\r\n  </p>\n\n<p>So, we were very pleased with the results of the game and hope the players can have a fun time exploring these levels while catching some Pufferfish.\r\n</p>\n<p>The state of the game is still a Beta version, we will keep working on in on the following weeks.</p>", "metacritic": null, "released": "2018-06-19", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/d27/d27632b07b9fce8506a4bf023f24dcbe.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 70, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Sotox11"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}