{"id": 15914, "slug": "elite-vs-freedom", "name": "Elite vs. Freedom", "name_original": "Elite vs. Freedom", "description": "Elite vs. Freedom is an action-packed Indie third-person shooter game. In the near future, the Earth is controlled by a global government. The Elite rule this new world order.<br/><br/>Executive power is enforced by the World Police Department. Few dare to resist this neo-feudalistic, corporatist, police state. Leading the insurgence, a group known as Freedom takes up the fight.<br/><br/><ul><li>Mission locations around the globe (Hollywood, Rio, Vegas, Monaco, Tokyo, Aspen, and Dubai).<br/></li><li>Both factions are playable on seven maps - four game modes in multiplayer (via Internet + LAN)<br/></li><li>and 14 distinct missions in single-player or co-op mode.</li></ul><br/><br/><br/>Story and mission briefings are told through 16 exciting motion comics. Fight using weapon combos specialized for melee and ranged attacks, including:<br/><br/><ul><li>Assault Rifle with Chainsaw Bayonet,<br/></li><li>Submachine Gun with Electroshock,<br/></li><li>Grenade Launcher with Flame Thrower,<br/></li><li>Bazooka with Toxin Spray,<br/></li><li>Shotgun with Knife Bayonet,<br/></li><li>Gatling Gun with Acid Spray,<br/></li><li>Sniper Rifle with Mace Club,<br/></li><li>Autocannon with Plasma Shock and Ballistic Shield.</li></ul><br/>Game Modes (Multiplayer)<br/><strong>Assassination</strong><br/>Freedom forces must locate a high-profile target on the map and eliminate the target within the designated timeframe. Elite forces fight to protect the target until time runs out. Freedom forces have a difficult mission ahead of them, as the target is heavily armed and dangerous.<br/> <br/><strong>Kidnapping</strong><br/>Freedom forces must capture and escort a high-profile Elite VIP to an evacuation point on the map. Elite forces fight to protect the target and prevent Freedom from successfully extracting the target.  Freedom forces must work quickly to complete the mission before time runs out.<br/> <br/><strong>Espionage</strong><br/>Freedom forces must locate a laptop containing special intelligence. Elite forces fight to protect this data at all cost. Freedom forces must acquire the laptop and return to the extraction point before time runs out.<br/> <br/><strong>Sabotage</strong><br/>Freedom forces must target and destroy a designated area on the map using a bomb. Elite forces fight to prevent the attack. Freedom forces must work together to protect the bomb carrier and complete the mission before time runs out.<br/><br/>Features<br/><ul><li>Indie Third-person shooter for PC, developed by a small remotely working team located in multiple countries.<br/></li><li>Fight using weapon combos specialized for melee and ranged attack.<br/></li><li>Two playable factions (Elite SWAT officers or Freedom insurgents) in single-player and two multiplayer modes (co-op and player vs. player).<br/></li><li>Mission locations around the globe (Hollywood, Rio, Vegas, Monaco, Tokyo, Aspen, and Dubai).</li></ul> <br/><strong>Single-Player</strong><br/><ul><li>Freedom and Elite campaigns.<br/></li><li>14 single-player missions.<br/></li><li>16 motion comic cut scenes (intro, outro, and mission briefings).<br/></li><li>AI (Artificial Intelligence) controlled human and drone combatants.<br/></li><li>AI allies.<br/></li><li>Cover system.</li></ul> <br/><strong>Co-Op Multiplayer (player vs. environment)</strong><br/><ul><li>up to four friends can play together in the Co-Op Multiplayer mode.<br/></li><li>14 missions playable online (via Internet + LAN) with friends.</li></ul> <br/><strong>Classic Multiplayer (player vs. player)</strong><br/><ul><li>four unique game modes (Assassination, Espionage, Kidnapping, and Sabotage).<br/></li><li>seven multiplayer (arena-like) maps.<br/></li><li>up to 20 players per map.<br/></li><li>play via Internet and LAN.</li></ul><br/>The Developers<br/>We're a team of freelance artists, designers, programmers and avid gamers who are working together remotely to create fun Indie games with meaningful stories. We're an independently funded start-up registered in the USA, using a virtual office. Besides making fun games, we do our best to ensure the highest levels of efficiency, flexibility and quality on a tight budget.<br/><br/>", "metacritic": null, "released": "2016-05-31", "tba": false, "updated": "2019-08-28T22:11:17", "background_image": "https://media.rawg.io/media/screenshots/031/03112edad46542cce96f0cc356491e3a.jpg", "website": "http://www.elitevsfreedom.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 40}, "playtime": 4, "achievements_count": 33, "ratings_count": 0, "suggestions_count": 520, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["AVE"], "genres": ["Action", "Indie"], "publishers": ["AVE"], "esrb_rating": null}