{"id": 159147, "slug": "manifest-sbethune81", "name": "Manifest (sbethune81)", "name_original": "Manifest (sbethune81)", "description": "<p><em>There exists a most curious and powerful race in the world of Ospes, able to manipulate and alter matter itself.</em></p><em>\n<p> Their numbers are few, and from the beginning they have lived as outcasts, perceived as a threat to the world and every living thing in it.</p>\n<p> They are called Theolar.</p>\n<p> Thymetians, the most dominant race on Ospes, have done all that they can to suppress the Theolar. For they, more than any, are afraid of them.</p>\n<p> Most Theolar are content to live in hiding and have abandoned the use of their abilities in hopes they would be forgotten. But among them there is a small group, known as the<br/> Andurim, who are unwilling to give up that part of themselves.</p>\n</em><p><em> Their sole purpose is to provide the Thymetians and the rest of the world with a glimpse of their greatness, now long overshadowed by what else they are capable of...</em></p><p>Thank you for taking enough interest in this project to view the thread. This project is a fulfillment of a childhood dream and it is very dear to me. I do hope you enjoy it.<br/> If you play it through to completion, I promise you that you will see a few things that have never been done before in Rpg Maker Vx.</p>\n<p> In the interest of quality, I encourage everyone who plays the game to leave feedback, comments, advice, or any questions if you have them.</p><p><strong>FEATURES:</strong></p><strong>\n</strong><p> - In-depth story, both serious and humorous</p>\n<p> - ATB Tankentai Battle System</p>\n<p> - Customize battle difficulty from the menu</p>\n<p> - Hundreds of unique skills including many with complex common events</p>\n<p> - A large, lag-free world map to explore</p>\n<p> - Challenging dungeons with varied and original puzzles like you've never seen in RPG Maker VX before</p>\n<p> - A huge number of mini-games, including gambling, accuracy, speed, timing, strategy, and more.</p>\n<p> - Optional puzzle-filled ruins with plenty of rewards</p>\n<p> - 99 hidden relics to find and trade in the world</p>\n<p> - Original and addictive lockpicking event system</p>\n<p> - Some dungeons involve sneaking past guards and enemies</p>\n<p> - Optional Quests/Hunts similar to Phantasy Star 4/Final Fantasy XII</p>\n<p> - Fully functional battle arena</p>\n<p> - A complex evented world mini-map with 3 different zoom perspectives</p>\n<p> Some of the mini-games you will encounter during your travels:</p>\n<p> (Screenshots for these are provided below)</p>\n<p> - A whack-a-mole type game<br/> - A fishing minigame based off a combination of the Fable 1 fishing system and the Guardian Force Boost system of FF8<br/> - A dodging minigame<br/> - My complex lockpicking system<br/> - A 3-Card Monty style game, but with 10 rabbits instead<br/> - A shooting gallery game, similar to the one found in Alundra<br/> - A blacksmithing minigame involving timing<br/> - A Slide puzzle w/ multiple images (I count it as a puzzle and a minigame). See screenshots below.<br/> - A shooting/defense game where you must keep monsters at bay<br/> - A single player memory card game with a unique twist<br/> - A fast-paced meteor dodging game</p><p><strong>What users from rpgmaker.net have said...</strong></p><strong>\n</strong><p> \"I've finished the game, and I have to say that I really enjoyed myself. I don't always keep the games, but this one is a must.<br/> Thanks for all your hard work.\" - littlebro</p>\n<p> \"All in all, you have certainly set a standard for vx games. I can't think of one that actually gripped me, and especially like this one did.<br/> At any rate, I'm just saying I loved the game. I can tell it had a huge amount of work placed into it.\" - demonlord5000</p>\n<p>What users from rpgmakervx.net have said...</p>\n<p> \"Whoa. This game is amazing. I can't recall the last time I enjoyed a game, commercial or otherwise, this much. You've managed to create a world that pulls the player in,<br/> makes him identify with teh characters and feel for them. A world that feels alive with lore and history. Every time I found one of the Nayrin relics...<br/> I really felt I was discovering bits and pieces of an ancient civilization, scattered all over the world.\" - Jeffrey</p>\n<p> If anyone wants to play arguably one of the best all around put-together RPGs available to RPG Maker VX, this is hereby on your must-do list.<br/> - goldenguy</p>\n<p> \"I will say that I liked the message and it was a brilliant adventure while it lasted. The plot was tight, the characters convincing and the puzzles<br/> were the best I've seen aside from Alundra. If you ever manifest another spectacular game, I'll be looking forward to it.\" - tom11</p>\n<p> \"Firstly you have a great imagination and a flair for writing, your game really drew me in and was a real \"key-presser\" right up until the final<br/> scenes. Your game was also very well balanced in terms of available money, EXP, etc. The inclusion of your excellent (occasionally challenging)<br/> puzzles and mini-games help to distract the player along the way. Also quite importantly the game runs practically bug free...\" - matt-tribal</p>\n<p> \"Bloody fantastic RPG. Minigames, optional quests, math puzzles. Love it all.\" - vitrous</p>\n<p> \"...there's so much that can be done, and the story and adventure just keep taking new turns and twists...It's been a long time since I've played a<br/> game that I have a hard time \"setting down\" after 2-3 hours, but this is doing that.\" - goldenguy</p>\n<p> \"...a brilliant game, you have clearly put a lot of thought into creating the world of Ospes and especially into its characters. I definitely<br/> appreciate the humorous dialogue too.\" - matt-tribal</p><p>Scripts:<br/> BigEd781<br/> Enu<br/> Kylock<br/> Mr. Bubble<br/> Moon Man<br/> Mr. Anonymous<br/> Modern Algebra<br/> Puppeto4<br/> Enelvon<br/> KGC Library<br/> Yanfly<br/> Synthesize<br/> Diakonos<br/> Woratana<br/> Moghunter<br/> Aranarther<br/> Tomy<br/> Ccoa<br/> Watermelon<br/> Hevendor<br/> Jens009<br/> Mac Malone (Dr. ?)<br/> OriginalWij</p>\n<p> Music:<br/> MaestroRage</p>\n<p> Sprites and Graphics:<br/> Tatanya<br/> Razavan Sedekiah<br/> Vibrato<br/> Antares<br/> Tentacles<br/> Final Fantasy (Square Enix)<br/> Ragnarok Online</p>", "metacritic": null, "released": "2017-07-07", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/cd8/cd8ed2c7d21d5aa3a649590e2984df44.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 178, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["sbethune81"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}