{"id": 15917, "slug": "door-to-door", "name": "Door To Door", "name_original": "Door To Door", "description": "Door to Door drops the player into the Lounge District of the Ministry of Order, an over-glorified bureaucratic metropolis full of Jazz and light. They will assume the role of an Agent named \"Bixby\", a detective whom works within the ministry in a department known as \"Correction Pending\". Bixby will be offered several cases involving a leisurely stroll through the dark but colorful and satirical setting the Ministry of Order offers. All you have to do is step outside your office to take a chaotic spin through a retro-future city inspired by Terry Gilliam's 1985 film, \"Brazil\".<br/><br/><strong>Key Features</strong><br/><br/><ul><li><strong>Welcome Back, Bixby:</strong> Play as Detective Bixby, Ministry Of Order's \"Correction Pending\" agent. Select from a varied list of \"Case-Files\" and experience something different every time.</li></ul><br/><ul><li><strong>Welcome to Lounge:</strong> Take your very own stroll through the Ministry Of Order's vibrant and bountiful Lounge District. Complete the objectives at your own pace and explore the environment to your leisure.</li></ul><br/><ul><li><strong>Pipe of A Different Color:</strong> The story of the Ministry Of Order only goes as deep as you want it to go. With various methods of exposition, you can unravel the truths that this place holds most dear.</li></ul><br/><ul><li><strong>My Pal, Charizmo:</strong> \"Charizmo\" is an assistance bot and friend of Bixby, whom when commanded from his respected station, can lead the player to several locations within the map.</li></ul><br/><ul><li><strong>The Synthetic Freeway:</strong> If you've had enough of the scenic route and want a little more versatility when completing objectives, all you have to do is step inside any of the few Bus Stations located throughout the map for instantaneous \"fast-travel\". </li></ul>", "metacritic": null, "released": "2016-08-02", "tba": false, "updated": "2019-08-28T22:11:17", "background_image": "https://media.rawg.io/media/screenshots/95e/95ef12869c601bb9f8d45f54d8c1857a.jpg", "website": "https://sites.google.com/site/novelistcdjones/door-to-door-game", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 78, "dropped": 1}, "playtime": 4, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 403, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["CD Jones"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["CD Jones"], "esrb_rating": null}