{"id": 15915, "slug": "grey-goo", "name": "Grey Goo", "name_original": "Grey Goo", "description": "<p>Grey Goo is a real-time strategy game developed by Petroglyph Games in collaboration with Weta Workshop.</p>\n<h3>Plot</h3>\n<p>On a distant habitable planet called Ecosystem Nine, three factions confront each other. Humans, Betas, and the Grey Goo nanobots. The humans arrive on the planet to investigate an unusual signal, as they thought to be to only intelligent beings in the planet system. Betas established a colony after escaping from their own planet. And the Goo used to be an old human-made surveillance system, which reprogrammed itself and tries to return to its creators while consuming everything on its way.</p>\n<h3>Gameplay</h3>\n<p>The players are free to choose any faction to play as both in singleplayer campaign and multiplayer PvP mode. Each faction has its own set of units, buildings and drastically differs in gameplay from every other one. For example, Betas rely on speed and mobility to outmaneuver their enemies, while humans can use teleportation devices to deploy their forces to the battlefield quickly and reconstruct their own base in a matter of seconds. </p>\n<p>The game&#39;s developers put a heavy emphasis on the preference of macro decisions instead of micromanagement. This being said, the player&#39;s strategy serves as a deciding factor in winning the game, not the speed with which they buy their units and build structures.</p>", "metacritic": 77, "released": "2015-01-23", "tba": false, "updated": "2023-10-13T19:28:42", "background_image": "https://media.rawg.io/media/screenshots/e37/e37cfceae9b2f79c29a1e9a8155c2d63.jpg", "website": "http://www.greybox.com/greygoo/en/", "rating": 3.24, "rating_top": 4, "added_by_status": {"yet": 71, "owned": 1211, "beaten": 20, "toplay": 7, "dropped": 35, "playing": 2}, "playtime": 5, "achievements_count": 35, "ratings_count": 84, "suggestions_count": 583, "game_series_count": 0, "reviews_count": 84, "platforms": ["PC"], "developers": ["Petroglyph"], "genres": ["Strategy"], "publishers": ["Grey Box"], "esrb_rating": null}