{"id": 159266, "slug": "exodus-itch-cic-studios", "name": "Exodus (itch) (CiC Studios)", "name_original": "Exodus (itch) (CiC Studios)", "description": "<p><strong>Hey there!</strong></p>\n<p>This is an <strong>unfinished</strong> project of mine, made in the cliche but powerful RPG Maker engine, VX Ace to be specific. </p>\n<p>I'm more or less uploading this for histories sake, as this was my first dip into game development.  If anything else, it'll be cool for me to see how I've grown as a developer as I complete more projects. Whenever that happens.</p>\n<p>In it's current state, it's no more than a proof of concept, and is far below what I was planning on when I was developing this game, but it is playable and a little bit of fun for maybe 10-20 minutes depending on your attention span, so I figured why not share it. :) If you'd like to read, there's some more below,  but that's all I've got for you. Hope you enjoy!</p>\n\n<p><strong><em>Development Notes:</em></strong><br/></p>\n<p>This game was born around 2009 and was a big pastime of mine between school and other kid stuff all the way until I stopped development around 2014. It began as my first project when I downloaded RPG Maker for the first time (I believe the current version was XP) and it fascinated me to my core. I've never felt so in control of creating something in my life up to that point, and it therefore became a huge outlet of creativity for me. </p>\n<p>Just as I felt I was halfway through finishing, I came across RPG Maker VX and immediately dropped XP to pick it up. This essentially set me back to square one, which came with some disappointment, but a lot of opportunity as well. I began experimenting with Java (the scripting language RPG Maker uses) to not a lot of success, and in searching out tutorials for Java, I came across a huge community of developers sharing base features that could be implemented to just about any project. </p>\n<p>This opened my mind and really had me shopping in a strange sort of way for features I think would fit what I was building. I guess in the end that's what most impresses me about this project, is my mind for general design. Considering I was about 12 or 13 at this point, my ability to implement these wildly different features and mechanics into one smooth experience does surprise me. I may be a bit biased but hey, what're you gonna do?</p>\n<p>Anyways, this was a bit of a poorly written ramble, if anything, so I'll cut it here. While I have decided to shelf this project simply because of the engine it's run off of (I am now favoring the Unity engine due to my experience with C#, and just the versatility of the engine in general) this will most likely not be the last time I explore this universe, as the stories and ideas that have grown in it have been a part of my identity since I was 10. Until then, enjoy this I suppose. :)</p>\n<p>It's cheesy, it's cliche, clunky and buggy, but I love it all the same. It's dear to my heart, and it will live here forever so I'll always be able to play it. :)</p>\n<p><strong>Jusqu'à notre prochaine réunion!</strong></p>\n<p><strong>-</strong><em>Tyrell</em></p>", "metacritic": null, "released": "2018-05-27", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/7fd/7fd89c3251cb652d02db266692b25887.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 75, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["CiC Studios"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}