{"id": 15949, "slug": "car-mechanic-simulator-2014", "name": "Car Mechanic Simulator 2014", "name_original": "Car Mechanic Simulator 2014", "description": "<p>Car Mechanic Simulator 2014 is a simulation game developed by Red Dot Games. It is the first installment in the Car Mechanic Simulator series.</p>\n<h3>Gameplay</h3>\n<p>The game is played from a first-person perspective. The players walk around freely in their shop. There are no levels present in the game. Instead, the player takes jobs from the customers. Each customer has a unique vehicle and a unique car problem which the players have to find and fix. </p>\n<p>When the client arrives with their car, the player takes the car apart, troubleshoots the issue, and replaces the required vehicle parts. Upon reassembly, the car can be taken for a test drive before handing it over to the client.</p>\n<p>It is also possible to play in endless mode, where there is no limit whatsoever to the number of jobs the player takes.</p>\n<h3>Expansion packs</h3>\n<p>Two expansion packs for the game were released.</p>\n<p>The 4x4 Expansion Pack adds 20 new jobs for the repair of 4x4 off-roading vehicles. It presents new challenges to the players, as off-road cars are much different from the regular ones present in the game. It is a separate body frame that is bolted on to the live axles. The pack was offered free of charge for the players that bought the game on steam.</p>\n<p>The 1/4 Mile Expansion Pack just added a single new test track, where the players could check the performance of their tuned out cars. It is basically a drag strip.</p>", "metacritic": null, "released": "2014-01-24", "tba": false, "updated": "2023-12-18T17:52:07", "background_image": "https://media.rawg.io/media/screenshots/1f8/1f88df2a4ac96e2ff626b6bedce43704.jpg", "website": "http://car.playway.com", "rating": 3.0, "rating_top": 3, "added_by_status": {"yet": 35, "owned": 1065, "beaten": 20, "toplay": 4, "dropped": 49, "playing": 3}, "playtime": 2, "achievements_count": 0, "ratings_count": 65, "suggestions_count": 424, "game_series_count": 0, "reviews_count": 65, "platforms": ["PC", "iOS", "macOS"], "developers": ["PlayWay", "Red Dot Games"], "genres": ["Simulation", "Racing", "Puzzle"], "publishers": ["PlayWay", "PLAYWAY SPOLKA AKCYJNA"], "esrb_rating": null}