{"id": 159592, "slug": "block-paper-puzzle", "name": "Block Paper Puzzle", "name_original": "Block Paper Puzzle", "description": "<p>Block Paper Puzzle, One of the best free games puzzle currently created.</p>\n<p>In block Paper Puzzle the paper Blocks are created with the errors and the small colored cubes of the pieces or the end of the game will be inmiente.</p>\n<p>You can also play in Run Mode in which you will have to eliminate obstacles that come at high speed and gradually increase in speed.</p>\n<p>Block Paper Puzzle is Free.</p>\n<p>Characteristics:</p>\n<p>Plastic block paper<br/>In the style of the best puzzle game in history, the pretigious tetris.</p>\n<p>-Mode Run<br/>Eliminate obstacles that come at high speed.</p>\n<p>-Mode Run Manual<br/>You have to press the piece in the image depending on the piece necessary to destroy the obstacle.</p>\n<p>Sliding Mode<br/>Slide the pieces towards the obstacles to destroy them.</p>\n<p>Manual Sliding Mode<br/>You have to press the piece in the image depending on the piece necessary to slide the piece and destroy the obstacle.</p>\n<p>-Addictive puzzle game.<br/>-You can last hours playing.<br/>-UI simple to understand.<br/>- Infinite games.</p>\n<p>How to play?</p>\n<p>In bloc block paper you have to eliminate the colored cubes obligatorily or the end of the game will be imminent, after that you will have to position the pieces in the place that suits you best.<br/>It can also be closed or any other type of paper that may interfere if the piece allows it.</p>\n<p>In Run Mode and Automatic Slider You have to eliminate the obtasculos pressing in the place of the missing piece and you will eliminate the obstacle.<br/>The Manual Manual will have to eliminate the obstacles by pressing on any of the images depending on which piece is missing in the obstacle to destroy it.</p>\n\n<p>Available only for android. For the moments.</p>", "metacritic": null, "released": "2018-07-06", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/8cd/8cde180961e788c387dd31c829ef2dc9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 35, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["WhiteMasterV"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}