{"id": 159623, "slug": "bobs-quest-red7projects", "name": "Bob's Quest (Red7Projects)", "name_original": "Bob's Quest (Red7Projects)", "description": "<p><strong>Help Bob Rescue his friends!</strong></p>\n<p>All Caveman Bob wanted was a quiet day out hunting. What he actually\r\ngot was a whole world of stress. While he was out, a rival tribe raided\r\nhis village and kidnapped everyone! They've only gone and stolen all\r\nof the gold and pinched all of the food too!</p>\n<p> The villagers have been put in jails and scattered all over the many\r\ndifferent lands in Bobs world. You must find them before they die of\r\nstarvation.</p>\n<p>Explore each land, retrieving the gold and food supplies, and rescuing\r\nany villagers you find. You will need to be careful, there are many\r\nthings out there, all of them out to get you!</p>\n<p>To leave a land you will need to find a number of golden keys to unlock\r\nthe door to the next land.</p>\n<p>Rotate blocks for a mystery prize by jumping into them from below.</p>\n<p>Hold down the jump button for higher jumps. </p>\n<p>The exit doors will only open when all keys on a level are collected.  The keys are eggs-tremely will hidden... </p>\n<p>You can add to your axes by killing enemies or from mystery boxes. Be  alert, as there are hidden mystery boxes on each level.</p>\n<p>Rescue all the captive villagers by breaking them out of jail. </p>\n<p>Beware, killed enemies may respawn after a short while.</p>\n<p>Bonus rooms can be accessed via the bonus doors.</p>\n<p>Press 'UP' to open any door that you are standing in front of.</p>\n<p>GOOD LUCK!\r\n</p>", "metacritic": null, "released": "2018-02-12", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/bc3/bc37c45939bce333bb138e011567ee00.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 133, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Red7Projects"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}