{"id": 159761, "slug": "magicats-builder-infinite-pack", "name": "MagiCats Builder - Infinite Pack", "name_original": "MagiCats Builder - Infinite Pack", "description": "<p><strong>MagiCats Builder Infinite Pack</strong></p>\n<p><strong>Your Game, Your Rules. </strong>\n</p>\n<p><strong>Take over the power of coding. Build and share your own worlds in a crazy game.</strong>\n</p>\n<p>Build your very own game world in MagiCats Builder – the ultimate sandbox platformer where only your imagination is the limit! Design levels, characters, objects, environments – anything your heart desires – using a simple visual coding engine. Craft your own experiences on the fly and share them with the community – or explore custom levels from around the world. \r\n  </p>\n<p> \r\n  </p>\n<p><strong>What epic CATStruction will you build?</strong>\n</p>\n<p> </p>\n<p><strong>Build YOUR levels with YOUR codes:</strong></p>\n<p>With intuitive magic coding-runes, you’ll be able to design your worlds. Add, remove, edit, everything is possible! In MagiCats Builder, you can design easy, hard, tricky and even crazy levels and create your own adventures! Backgrounds, bosses, craft and make your ideas come alive with all the different elements and items you will find in MagiCats Builder. \r\n  </p>\n<p><strong>Share YOUR creations:</strong>\n</p>\n<p>Share worlds you have created with a worldwide community. Challenge your friends in your levels and let the whole world try them out. \r\n  </p>\n<p><strong>Create YOUR hero:</strong>\n</p>\n<p>Customize your hero and play the way you are. With different skins, create your own MagiCat and clear all levels with style. In MagiCats Builder, you’ll be able to play with a hero who comes straight out of your imagination.\r\n  </p>\n<p><strong>YOUR party game:</strong>\n</p>\n<p>Up to 4 players can play simultaneously in a local multiplayer mode for even more fun! Challenge your friends the way you want in levels that you or other players have designed! Try to team up with your friends or beat them all, it’s up to you!</p>\n<p><strong>YOUR voice counts:</strong></p>\n<p>Share your feedback and your input with us and our community on Discord. We answer in real time and are waiting for your feedback to improve our game.\r\n  </p>\n<ul><li><strong>FEATURES:</strong>\n</li></ul>\n<ul><li>Join an epic 2D sandbox platformer adventure.\r\n  </li><li>Create custom levels where only your imagination is the limit.\r\n  </li><li>Customize anything and everything using a simple coding tool.\r\n  </li><li>Enjoy colorful, hand-drawn environments.\r\n  </li><li>Share your creations with the world and challenge friends.\r\n  </li><li>Explore infinite levels created by the community.\r\n  </li></ul>\n<p>·       Create and compete with friends in 2-4 multiplayer mode.\r\n</p>", "metacritic": null, "released": "2018-07-10", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/73e/73efd0f60d9a3d6036e3577690d6a3ba.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 320, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Plug In Digital"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}