{"id": 15970, "slug": "ys-the-ark-of-napishtim", "name": "Ys VI: The Ark of Napishtim", "name_original": "Ys VI: The Ark of Napishtim", "description": "<p>Red-haired adventurer extraordinaire Adol Christin has finally reunited with his best pal, Dogi, and is eager to set sail for new adventures in Afroca. It seems fate has other plans for him, however, as a pirate captain named Ladoc makes him an offer he simply can&#39;t refuse: a chance to explore a dangerous, uncharted archipelago in the Atlas Ocean that may hold treasures of heretofore unseen value.<br />\nNever ones to back away from a good mystery, Adol and Dogi both agree to join Ladoc on this expedition aboard his ship, the “Tres Mares” -- but no sooner does it weigh anchor than the Romuns, their sights set on the same curious islands of Canaan, attack the wayward pirates and ultimately knock Adol overboard, leaving him for dead.<br />\nSome time later, he washes ashore in Canaan itself, alive but weakened, rescued and resuscitated by two young girls named Isha and Olha who sport long ears and bushy tails. They are of the native “Rehda” tribe, and it seems Adol is not the first human to arrive here -- nor are humans particularly welcome...<br />\nCome experience the very first 3D Ys game as you&#39;ve never experienced it before! Already the foundation upon which Ys: The Oath in Felghana and Ys Origin would later be built, this version of Ys VI: The Ark of Napishtim comes equipped with an original translation and brand new, entirely unique gameplay features such as the addition of a super hardcore “Catastrophe Mode” for fans of the later titles, full widescreen support, map warping, Steam achievements and leaderboards, and even a full digital art book packed with concept sketches, hi-res character portraits and original production PSDs.<br />\nSee what you&#39;ve been missing with this definitive version of the game that brought Ys into the modern era!Key Features:<br />\nFast, real-time combat centered around elemental swords with unique magical abilities<br />\nEnormous screen-filling bosses set to quintessentially Ys rock music composed by the legendary Falcom Sound Team jdk<br />\nA deep and involving story that ties into Ys history and serves as a cornerstone of series lore<br />\nBrand new “Catastrophe Mode” where healing items can’t be purchased or stored, to create a gameplay experience more in line with later entries<br />\nAdjustable high-resolution PC graphics and gamepad support<br />\nNewly-added ability to warp among checkpoints<br />\nSteam achievements and leaderboards</p>", "metacritic": 74, "released": "2003-09-27", "tba": false, "updated": "2023-11-18T16:10:59", "background_image": "https://media.rawg.io/media/screenshots/c2c/c2c787f80b85c6230eec4b151e0fa38d.jpg", "website": "http://www.worldofys.com/ysvi/", "rating": 4.1, "rating_top": 4, "added_by_status": {"yet": 46, "owned": 308, "beaten": 40, "toplay": 17, "dropped": 5, "playing": 1}, "playtime": 4, "achievements_count": 16, "ratings_count": 39, "suggestions_count": 603, "game_series_count": 14, "reviews_count": 39, "platforms": ["PC", "PlayStation 2", "Android", "iOS", "PSP"], "developers": ["Konami Digital Entertainment", "Nihon Falcom", "Hudson Soft"], "genres": ["Action", "Adventure", "RPG"], "publishers": ["Konami", "XSEED Games", "Marvelous USA"], "esrb_rating": "Everyone 10+"}