{"id": 159757, "slug": "a-stitch-in-time-chained-lupine", "name": "A Stitch In Time (Chained Lupine)", "name_original": "A Stitch In Time (Chained Lupine)", "description": "<p>A Stitch in Time was created for the Ludum Dare Game Jam #22, theme of Alone.</p>\n\n<p><strong>Controls</strong></p>\n<p>Your ship flies to wherever the green circle is on the screen.  The primary mouse button fires your gun.</p>\n<p><strong>Instructions</strong></p>\n<p>Shoot everything!  Collect the cans of tuna in order to decrease your hunger.  If you completely empty the hunger bar, you will activate super-kitten mode for a short amount of time!</p>\n<p>If you reach a certain score, you will receive a fishbone, indicating you are a happy and well-fed kitten.  Gain all three to show you are the best time kitten of them all!</p>\n<p>Level progression works a bit like RayCrisis in that there is an incursion meter in the top right of the screen.  As long as you kill enemies, the meter will stay low and slowly build.  But if you die, it will jump up quite a lot.  It also goes up if an enemy flies off the screen.</p>\n<p>The trick to earning fishbones is to keep this meter as low as possible by killing enemies rapidly and not dying.  You also have a multiplier for killing enemies, which is increased by activating super-kitten mode.</p>\n<p><strong>History</strong></p>\n<p>The theme was Alone, but I wanted Kittens so I made a kitten game.  Take that, Ludum Dare theme voting.</p>\n<p>The game came out a lot harder than I meant it to be.  I tuned it for my shmup level of experience, and that was just a bit too much for the wider audience.  The game got high marks for audio/visual, but did poorly in the gameplay area.</p>", "metacritic": null, "released": "2017-10-05", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/44c/44c74b86030f6a4acabb37781e8249bd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 30, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Chained Lupine"], "genres": ["Shooter", "Adventure"], "publishers": [], "esrb_rating": null}