{"id": 159778, "slug": "sweeper-frenzy", "name": "Sweeper Frenzy", "name_original": "Sweeper Frenzy", "description": "<p>Sweeper Frenzy is Minesweeper with some additional mechanics that aim to not let the player think.</p>\n<p>New mines appear on the field every once in a while, so when you stop and think, the field will be flooded with mines in no time.</p>\n<p>And there are powerups that spawn randomly and fly through the screen. You have to be quick to catch them, but be careful not to click them on top of a close tile, because then you'll click both the powerup and the tile. It's not a bug, it's a feature! <strong>/s</strong></p>\n<p>I tried to use as much original content as possible. As far as I can remember, the only things I took from somewhere else are a bunch of animation code (from Our Lord and Savior Brackeys), and the font (from Microsoft).</p>\n<p>Below is the \"How to Play\" text I prepared earlier. It's a bit long, and the game is quite simple, but I'll still paste it, read it if you want: </p>\n\n\n<p>When you launch the game (it works best on 1920x1080 resolution because I'm still bad at resolution optimization), you'll see a few buttons.<br/>The one on the bottom right corner toggles the sound and music.<br/>The named buttons do what is written on them.<br/>When you press Play for the first time, you'll see the tutorial window.<br/>You should read it, but I'm still going to write its contents here:<br/> Controls:<br/> Tap/click a safe tile to open it. If it is safe, you get 20 points. If it is mined, you lose 100 points.<br/> Press &amp; hold on a mined tile to mark it with a flag. If you do this to a safe tile, you lose 15 points.<br/> Tap/click the powerups to acquire them, but when you tap/click on a powerup, you also tap/click on whatever is below it. So don't tap/click on a powerup on a closed tile.</p>\n<p> Powerups:<br/> There are four of them that do different stuff. I'm not going to write them here, just look at the tutorial.<br/> The ones labeled \"passive\" perform their effects automatically, and you don't need to think about where to use them.<br/> The one labeled \"active\" is used manually. You first acquire it, then you use it on a tile of your choice.</p>\n<p>When you're ready to play, you can press \"Don't show again\" if you don't want to see the tutorial again, of \"Proceed\" if you would like to look at it again when you press Play.<br/>Then, you can choose the level that you want to play.<br/>Keep in mind that the larger levels are hard to play on phones.<br/>When the level loads, choose the difficulty. They are explained on the choice screen.<br/>After that, you can open any tile to start the game. Before the game begins, all tiles are safe, so you don't open a mine on your first tap (just like the original Minesweeper).<br/>Most of the rules are the same as original. But unlike the original Minesweeper, you can't stop and think. <br/>Every once in a while (there is a timer for this on the upper right corner), a new mine is added to the field.<br/>And when you open a mined tile, it only deducts points from your score instead on ending the game.<br/>Also, a powerup spawns every once in a while, and goes from the left to the right of the screen.<br/>You can look at the Powerup indicator to see if you have an active powerup at the moment.<br/>When there are no closed safe tiles left, the game ends (this usually happens when a newly spawned mine fills the last safe spot, so don't worry when the game suddenly ends).<br/>When the game ends, your score gets multiplied with the difficulty multiplier (Easy: x0.5, Medium: x1, Hard: x1.5), and that is your final score. You can also see your high score on that level at the gameover screen.<br/>That's it.</p>", "metacritic": null, "released": "2018-06-02", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/2b1/2b1c51b89abe4f7de518c824e16ad863.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 52, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Android"], "developers": ["dogucan"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}