{"id": 1598, "slug": "kinghunt-the-next-generation-slicing-game", "name": "KingHunt - The Next Generation Slicing Game", "name_original": "KingHunt - The Next Generation Slicing Game", "description": "THE NEXT GENERATION OF THE SLICING GENRE IS HERE! It is brought to you by the indie studio that created Bike Baron, Ice Rage and Minigore.<br/><br/>#1 ARCADE GAME in 60 countries!<br/><br/>KingHunt delivers stunning console quality graphics at 60 fps, first time on mobile! But don't just take our word for it, see the trailer: https://www.youtube.com/watch?v=9mU-lcJnyvg<br/><br/>Featured by Apple as Editors' Choice!<br/><br/>“KingHunt is going to be your brand new addiction.” - AppAdvice.com<br/>“It looks absolutely gorgeous on a high-end device.” - TouchArcade.com<br/>“KingHunt is an enjoyable arcade blast.” - PocketGamer.co.uk<br/><br/><br/>STORY<br/><br/>    There was a chef who baked treats in his bakery <br/>    made them so tasty with magic and alchemy <br/><br/>    What happened next was a great travesty <br/>    the blinded chef disappeared in agony <br/><br/>    Now they call him Kingmaker; he bakes kings in his bakery <br/>    and breathes life into them with his hatred and misery <br/><br/>After centuries of silence Evil Kingmaker has returned. Together with his ten puppet kings he has invaded Heart Island and shattered the once beautiful place. Delicious but ruthless Muffin King has been placed in guard of the Southern Kingdom, the foul stench of Count Cheese in Castle Grave makes living in the surrounding forest unbearable. The most fearsome of them all, Dino King, keeps its lair on top of an infernal volcano. Slice Kingmaker's armies, unlock fantastic new worlds, and collect magical trinkets to become more powerful than any king! <br/><br/><br/>FEATURES: <br/>-Great powers at your fingertips: freeze time, chain explosives, and summon meteor showers. <br/>-200 different enemies: jumping, flying, swimming, and roping down at you! <br/>-12 fantastic worlds: to discover and claim back from Kingmaker's dominion. <br/>-100 magical trinkets: collect them to help you become the greatest KingHunter on Game Center! <br/>-110 challenges and 80 achievements: to beat and to brag about to your Game Center friends. <br/>-DST (Dynamic Slicing Technology): infinite slice variants through four degrees of freedom. <br/><br/>Like us on Facebook or follow us on Twitter for the latest news on KingHunt: <br/><br/>facebook.com/KingHuntGame <br/>twitter.com/minigore", "metacritic": null, "released": "2013-12-05", "tba": false, "updated": "2019-07-30T02:58:04", "background_image": "https://media.rawg.io/media/screenshots/043/0431126cefb2f90d88e4c869ba8e1536.jpg", "website": "http://www.mountainsheep.net", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 219, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Mountain Sheep"], "genres": ["Adventure", "Arcade", "Casual"], "publishers": ["Mountain Sheep"], "esrb_rating": null}