{"id": 159935, "slug": "the-tunnel-sparkes", "name": "The Tunnel (sparkes)", "name_original": "The Tunnel (sparkes)", "description": "Originally developed for the Global Archiact Jam on Dev Post.YouTube VideoInspiration<p>A few years back I sometimes cycled to and from work and I'd hit a quarter mile long tunnel next to a canal about 3 miles from home. The Tunnel has no lighting and is reputed to be haunted. What is clear is the atmosphere in the tunnel really does something to the human body and imagination even if it's not haunted. You feel like there are other people around, other creatures moving in the dark even on the other side of the canal where the footpath is closed to the public. That's not to say there aren't. It would be more odd if rats, water voles and other small mammals didn't call this tunnel home but it adds to an overall feeling of not quite knowing what's in the dark. Once I even bumped into another cyclist pushing their bike the other way because of the way sound moves in the tunnel we didn't become aware of each other until almost together in the middle. It's very odd.</p><p>Around the same time I was at a conference and saw how games had started to be used in medicine to reduce the amount of pain relief used. One game, a snowy scene with snow ball fights, was being used in burns wards with great success in lowering the pain felt by patients. Another was developed by a teenage cancer sufferer where they symbolically 'killed' the cancer while undergoing painful treatment that had met with good response from other users. With VR it seems you can take people to another place. A happier place.</p><p>At first I wanted to create something positive, something that made the player feel better about themselves but then I looked at the deadline and the amount of time I have available and had to choose an easier emotion to tape into. The one of the fear that comes with uncertainty. VR does fear very, very well because it's an unreal world and the mind is more ready to accept negative emotions than positive ones.</p><p>So I used the inspiration that came from seeing how well VR can elicit strong emotional responses combined with the uneasy feeling of being only a few hundred feet from being able to look up and see the sky in the tunnel by the canal to try and recreate that feeling of being there, somewhere slightly odd but so close to early evening skies and birdsong.</p>What it does<p>It will allow the user to undertake the short journey down a tunnel with a body of water to one side. Home is at one end, not getting home in time for an evening meal with the family is the other. The dark, the damp, the way you have to walk with your head bowed so you don't crack your skull open and the way sound travels in odd ways make the entire journey a little unnerving. Who knows what might be hiding in the shadows.</p>How I built it<p>It will be built in Unity for Google Cardboard. The only VR solution I can afford :)</p>Challenges I ran into<p>From even before the compo started I knew what my main problem would be. Time.</p><p>I work full-time, spend two hours commuting and have disabled children that rely on me in the evenings and weekends. At very best I can afford to put 40 hours into the project and that's if all the stars align and I'm awake enough when I'm free to put time in. In other words I'm probably going to have a similar amount of time to work on this project that a younger person can spend on a Ludum Dare Jam.</p>What I learned<p>That Cardboard is probably more suited to a flat shaded fantasy setting rather than one with realistic shading and that an elderly i5 laptop isn't much good at prerendering lightmaps :)<br/></p><p>Best played with quality headphones.</p>", "metacritic": null, "released": "2016-10-24", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["sparkes"], "genres": [], "publishers": [], "esrb_rating": null}