{"id": 15996, "slug": "tales-of-cosmos", "name": "Tales of Cosmos", "name_original": "Tales of Cosmos", "description": "<strong>Tales of Cosmos</strong> is an old-school point-and-click adventure game set in a huge open world planetary system. Pilot your rocket across space, land on planets and moons, solve puzzles, and unravel a cosmic mystery with the help of a genius monkey and a wondrous talking dog.<br/><br/><br/><br/>Take on the dual role of Perseus and Gagayev, intrepid animal astronauts who stumble into a dangerous space anomaly and get stranded on an uncharted planet named Chlorine Beach. Build your own spaceship, blast off into space, discover new planets, recruit the help of local lifeforms, and get ready for an extraordinary adventure!<br/><br/>Key Features<br/><ul><li>2D open world adventure game inspired by 90s classics<br/></li><li>Combines classic point-and-click gameplay with seamless space flight mechanics<br/></li><li>A massive planetary system with many celestial objects to explore<br/></li><li>Each planet has numerous characters and objects to interact with, as well as many puzzles to solve<br/></li><li>Oddly charming characters with an unusual sense of humor<br/></li><li>Beautiful hand-drawn environments<br/></li><li>A haunting soundtrack to set the right mood for cosmic exploration<br/></li><li>Interstellar puzzles - an item acquired on one planet may be useful on another<br/></li><li>Integrated hint system to aid with difficult puzzles when you need it<br/></li><li>Modding tools - level editor included with the game</li></ul>", "metacritic": null, "released": "2016-10-20", "tba": false, "updated": "2022-11-22T09:07:18", "background_image": "https://media.rawg.io/media/screenshots/57b/57b0ce75cdf49affc142b589dba81417.jpg", "website": "http://www.reddwarfgames.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 52, "beaten": 2, "toplay": 1}, "playtime": 13, "achievements_count": 14, "ratings_count": 4, "suggestions_count": 218, "game_series_count": 0, "reviews_count": 4, "platforms": ["macOS", "PC"], "developers": ["Red Dwarf Games"], "genres": ["Adventure", "Indie"], "publishers": ["Red Dwarf Games"], "esrb_rating": null}