{"id": 16, "slug": "cubikolor", "name": "Cubikolor", "name_original": "Cubikolor", "description": "Immerse yourself in the world of Cubikolor!<br/>Move your Kube by matching the kolors of the sides and the platform to complete each level.<br/><br/>Armed only with your logic and your Kube, move through the 150 levels outwitting the traps in the System, an evil, scheming entity, to confront the machine and pass the test!<br/><br/>Discover lots of special Kubes with some surprising effects, and advance through the different game backdrops in Classik or Hardkore mode.<br/><br/>In Cubikolor your logic will be severely tested against a formidable enemy. Roll, go up, go down and rewind time to explore all the options and reach the locks in each level. Keep an eye on the time and move limits!<br/><br/>Outsmart the System and use its traps to your advantage:<br/>Booby-trapped Kubes, multikolored Kubes and many more await you in this next-gen puzzle game.<br/><br/>Win all the medals and challenge yourself in Hardkore mode. Only the best will survive.<br/><br/><br/><strong>Will you achieve the highest score?</strong><br/><br/><ul><li>A puzzle game with innovative gameplay in full 3D<br/></li><li>50 levels, 2 game modes, numerous objectives and 450 medals to be won<br/></li><li>Discover lots of special Kubes<br/></li><li>A kolorful and twilight world with ever-changing levels<br/></li><li>Progressive and immersive music, turn on the sound!<br/></li><li>Over 20 hours of gameplay fun against a cunning and ruthless Program<br/></li><li>A Hardkore challenge even for the best among you!<br/></li><li>Will you achieve the best times? Share your results!</li></ul><br/>Cubikolor - Originality Award at the European Indie Game Days 2015<br/>Cubikolor is a co-production between independent studios Fractal Box and Moving Player<br/><br/>", "metacritic": null, "released": "2016-05-20", "tba": false, "updated": "2019-08-28T22:16:16", "background_image": "https://media.rawg.io/media/screenshots/1a9/1a9f734ca0f9524d3f42a796ee9c154a.jpg", "website": "http://www.cubikolor.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 32, "beaten": 1, "toplay": 1}, "playtime": 4, "achievements_count": 42, "ratings_count": 3, "suggestions_count": 178, "game_series_count": 0, "reviews_count": 3, "platforms": ["Xbox One", "PlayStation 4", "Nintendo Switch", "PC", "macOS"], "developers": ["Moving Player", "MOVING PLAYER SAS", "Fractal Box"], "genres": ["Casual", "Indie", "Puzzle"], "publishers": ["Plug In Digital", "Moving Player", "LIGHTMAZE"], "esrb_rating": null}