{"id": 16009, "slug": "caravan", "name": "Caravan", "name_original": "Caravan", "description": "Many myths and legends have been woven about the Arabian Peninsula. One of these legends tells of Iram, City of Pillars, and its exceptional destiny.<br/>Being the heir to the throne you lived a life of splendor and never worked one day of physical labor – until one day, the winds of fate turned.<br/><br/>Days passed and the storm did not fade, if anything its strength and ferocity only grew. You would do anything to bring back only a spark of your mother's joy. And so, one night, when the kingdom sleeps and the moon smiles, you embark on a journey …<br/><br/>Caravan combines strategy with RPG elements resulting in a trading and exploration game packed with suspense and challenges. In a pre-medieval Oriental setting players will send their caravan from town to town. On their way, they will experience dangerous, mystical adventures, embark on rewarding quests in towns, and fight against dangerous bandits, beasts, ghoulish creatures and djinns.<br/><br/><br/><ul><li>Genre-Mix: diverse gaming experience through a mix of strategy, trade, and RPG elements<br/></li><li>Players manage their own caravan<br/></li><li>Setting based on history and geography of the Orient  <br/></li><li>Cultural authenticity through regional folklore and stories of the ‘Arabian Nights’</li></ul>", "metacritic": null, "released": "2016-09-29", "tba": false, "updated": "2023-07-23T10:45:03", "background_image": "https://media.rawg.io/media/screenshots/6cf/6cf3a52c8c104624c1da433afb21f347.jpg", "website": "http://itmattersgames.com/", "rating": 2.75, "rating_top": 4, "added_by_status": {"yet": 34, "owned": 448, "beaten": 7, "toplay": 1, "dropped": 6, "playing": 1}, "playtime": 3, "achievements_count": 14, "ratings_count": 24, "suggestions_count": 206, "game_series_count": 0, "reviews_count": 24, "platforms": ["PC", "macOS", "Linux"], "developers": ["it Matters Games"], "genres": ["Adventure", "Strategy", "Simulation", "Indie"], "publishers": ["Daedalic Entertainment"], "esrb_rating": null}