{"id": 16003, "slug": "baldurs-gate-ii-ee", "name": "Baldur's Gate II: Enhanced Edition", "name_original": "Baldur's Gate II: Enhanced Edition", "description": "<p>Baldur&#39;s Gate II: Enhanced Edition is a role-playing game, a remake of 2000 title Baldur’s Gate II: Shadows of Amn and its expansion Throne of Bhaal.  </p>\n<h3>Setting and plot</h3>\n<p>The game takes place in Forgotten Realms, one of the most popular settings in Dungeons &amp; Dragons franchise. The game’s plot is almost identical to the original game; however, the remake adds a new character, new quests, and some new locations. The new characters from Baldur’s Gate: Enhanced Edition also appear in this game.  </p>\n<h3>Gameplay</h3>\n<p>The gameplay is based on 2nd Edition Advanced Dungeons &amp; Dragons. The game begins with character creation where the player can choose appearance, race, class, ability scores, and alignment. The game mostly consists of exploring the game world, interacting with NPCs, completing the quest and fighting with various enemies. The battle system in the game reconstitutes that of Dungeons and Dragons table. During the game, you can come across numerous characters that would like to join your party helping you in battles and with some quests. <br />\nThe Enhanced Edition brings some new features aside from new characters, quests, and locations. The game now supports wide-screens and high resolution. The cross-platform multiplayer allows up to six players on different platforms play cooperatively.</p>", "metacritic": 78, "released": "2013-11-15", "tba": false, "updated": "2024-01-24T08:44:34", "background_image": "https://media.rawg.io/media/screenshots/e0a/e0abaefbcc99ef995be57d857806f2d2.jpeg", "website": "http://www.baldursgateii.com", "rating": 4.25, "rating_top": 5, "added_by_status": {"yet": 251, "owned": 1846, "beaten": 116, "toplay": 91, "dropped": 66, "playing": 20}, "playtime": 4, "achievements_count": 93, "ratings_count": 224, "suggestions_count": 835, "game_series_count": 0, "reviews_count": 228, "platforms": ["Xbox One", "PlayStation 4", "Nintendo Switch", "macOS", "Linux", "iOS", "PC"], "developers": ["BioWare", "Beamdog", "Overhaul Games"], "genres": ["RPG", "Strategy"], "publishers": ["Beamdog", "Overhaul Games"], "esrb_rating": "Teen"}