{"id": 1601, "slug": "lumo", "name": "Lumo", "name_original": "Lumo", "description": "Witness the rebirth of a genre in Lumo – a classic isometric adventure with a modern twist for gamers young and old alike!<br/><br/>As a contemporary take on the long-lost isometric platform genre, Lumo can be enjoyed by anyone looking for an absorbing, challenging and rewarding adventure. But for those who lived through the golden age of videogames – the 80s and early 90s – or know about the games and culture from that time, layer upon layer of nods, winks and touches to those times help build upon an experience that’s as heart-warming as it is exciting!<br/><br/>With over 400 rooms across four unique zones, six hidden mini-games and all kinds of secrets to uncover, Lumo is a true voyage of discovery. How much you discover just depends on how hard you look…<br/><ul><li>Lumo revives the long-lost art of isometric platforming, while bringing a charm of all its own to the genre.<br/></li><li>Over 400 rooms will test your skill, each one a self-contained challenge to overcome.<br/></li><li>The more you look, the more you'll find – from a hugely absorbing adventure on the surface to all kinds of secrets to find underneath!<br/></li><li>A true love letter to the golden age of gaming… adventures don't get much more heart-warming than this!</li></ul>", "metacritic": 77, "released": "2016-05-23", "tba": false, "updated": "2023-10-25T23:03:40", "background_image": "https://media.rawg.io/media/screenshots/31a/31a598e802da34d983812913036dff84.jpg", "website": "http://play-lumo.com", "rating": 2.56, "rating_top": 3, "added_by_status": {"yet": 28, "owned": 560, "beaten": 13, "toplay": 4, "dropped": 63, "playing": 3}, "playtime": 5, "achievements_count": 174, "ratings_count": 115, "suggestions_count": 288, "game_series_count": 0, "reviews_count": 115, "platforms": ["Xbox One", "PS Vita", "PlayStation 4", "Nintendo Switch", "macOS", "Linux", "PC"], "developers": ["Rising Star Games", "Spiral House", "Triple Eh?"], "genres": ["Adventure", "Indie", "Puzzle", "Platformer"], "publishers": ["Rising Star Games"], "esrb_rating": "Everyone 10+"}