{"id": 16016, "slug": "cdf-ghostship", "name": "CDF Ghostship", "name_original": "CDF Ghostship", "description": "Over 350 years in the future mankind has embraced space travel and exploration. We have colonized many worlds and spread ourselves across the galaxy. The Colonial Defense Force (CDF) is responsible for the security of Earth and her colonies, and our only line of defense against the unknown.<br/><br/>On March 1st 2368 contact was lost with our most distant colony, located in the Icarus system. Two days later the Dreadnought class spaceship CDF Goliath was dispatched to investigate. Experience the events that transpire as a Marine on the boarding party to the Icarus 3 Space Station and as a pilot returning from another mission a few days later.<br/><br/>Discover what happened to the CDF Goliath and why nine days after entering the Icarus system it was finally declared a Ghostship.<br/><br/><strong>Features</strong><br/><br/>*5 Game Modes <br/>*Old Style FPS shooter with fluid gameplay <br/>*Random Narrative, game events and random enemies for a real FPS challenge <br/>*Open world space craft with a practical design <br/>*Over 20 different enemies ranging from zombies to aliens and armed survivors <br/>*Multiple endings and a story which evolves based on random events and the choices you make in each game <br/>*Fast-paced and challenging waves of enemies in onslaught mode <br/>*15 different weapons from 2 weapon types : Laser &amp; Plasma <br/>*Real Physics <br/>*A new type of AI which offers challenging and unpredictable gameplay <br/>*4k Ready <br/>*3d Enabled <br/><br/><br/><strong>GAME MODES </strong><br/><br/>Story Mode <br/><br/>Play the character Zak Thomas in an open world spacecraft and space station with random events and enemies, and a huge focus on atmosphere and immersion. <br/><br/>Skirmish Mode <br/><br/>You are one of the last survivors on the colony, you must survive for 25 minutes until the rescue ship arrives! Do you have what it takes? <br/><br/>Onslaught Mode <br/><br/>A wave based survival mode where you must kill as many enemies as you can. There are 4 different onslaught maps which are based on locations from the story mode. <br/><br/>Challenge Mode <br/><br/>Offers a variety of diverse challenges which will test your combat ability, agility, and problem solving skills. There are 4 different challenge maps which are based on locations from the story mode. <br/><br/>Simulation Mode <br/><br/>Consists of single missions based on historic CDF battles and simulations created for the Marines on the Goliath to hone their skills. <br/><br/><br/>*****WARNING: THIS GAME CONTAINS FLASHING LIGHTS &amp; LOTS OF BLOOD n` GUTS! ******", "metacritic": null, "released": "2015-06-26", "tba": false, "updated": "2019-08-28T22:11:14", "background_image": "https://media.rawg.io/media/screenshots/1bc/1bc41b6006fe2d57a94dcf32582d9b68.jpg", "website": "http://www.magstudios.co.uk", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 27}, "playtime": 5, "achievements_count": 40, "ratings_count": 0, "suggestions_count": 508, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MAG Studios"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["MAG Studios"], "esrb_rating": null}