{"id": 16029, "slug": "block-n-load", "name": "Block N Load", "name_original": "Block N Load", "description": "<p>Block N Load is a team-based multiplayer shooter game developed by Jagex. It is a spiritual successor to Ace of Spades and improves on the ideas that were first laid there. It was later made free-to-play.</p>\n<h3>Gameplay</h3>\n<p>Block N Load is a 5v5 multiplayer game that takes inspiration from Minecraft and Team Fortress. Each team build up their base and tries to destroy their enemies. Featuring a completely destroyable environment, it is possible to catapult over the enemy defenses, blow their walls up or simply dig under them. This results in a high degree of replayability as no match will play the same.</p>\n<p>In Block N Load, the players will put up buildings for offense or defense. The game features a class system - at the beginning of the match, you choose a character each of which has unique combat and tactical skills.</p>\n<h3>Characters</h3>\n<p>Block N Load features 12 characters which differ in their gameplay. For example, Sarge is a tank-type character, who pushes his enemies head-on to deal the most amount of damage possible, while Juan Shinobi is a stealth-based character that relies on his fast movement and teleportation skills to get behind his enemies, slice them up, and vanish.</p>\n<p>Each character is capable of building up defenses and is equipped with a shovel. The players are free to use blocks and build up something new or choose the pre-made buildings and put them up in a matter of seconds.</p>", "metacritic": 72, "released": "2015-04-30", "tba": false, "updated": "2023-10-24T10:34:18", "background_image": "https://media.rawg.io/media/screenshots/0a1/0a11da6832223c0a41b5307a9112c3e7.jpg", "website": "https://www.blocknload.com", "rating": 2.23, "rating_top": 1, "added_by_status": {"yet": 30, "owned": 1328, "beaten": 9, "toplay": 5, "dropped": 69, "playing": 3}, "playtime": 1, "achievements_count": 66, "ratings_count": 121, "suggestions_count": 420, "game_series_count": 0, "reviews_count": 121, "platforms": ["PC"], "developers": ["Jagex", "Artplant"], "genres": ["Action", "Strategy", "Massively Multiplayer"], "publishers": ["Jagex"], "esrb_rating": null}