{"id": 160380, "slug": "a-test", "name": "A Test", "name_original": "A Test", "description": "<p>I'm going to write a wall of text, because I feel like I should explain myself for this mess.</p>\n<p>So this started out as an attempt to try and program parallax scrolling by myself.  I figured it could help the player feel \"smol\" as a loose connection to the jam theme. With this planned, I dusted off Game Maker and resurrected an old project that went nowhere so I could bring it even further nowhere. <br/></p>\n<p>I had it figured out by the middle of the second week (more or less); however, this led to me drawing a blank. I tried improving the artwork, but after some polishing, it started feeling unsalvageable. I gave the character the ability to fly to make experimenting easier (you can thank Nights into Dreams for that idea), but it seemed impossible to perfect with the run and jump controls I had already set up for him. I slacked off during weeks three and four, lazily accepting that all I'd have to show would be an unimpressive tech demo.</p>\n<p>Then a little before the start of week five, I suddenly had a number of ideas that would have been nifty to have a little earlier. I figured that if I was going to turn in a demo, it could at least be a semi-well presented demo, and that I might as well get some practice in. So I created a new sprite (complete with it's own flying code), a fade in/ fade out transition, sound effects, and a menu screen + end screen. So this is the result.</p>\n<p>I also wrote a brief into, just to create some context. It's based off of a game concept I've been thinking about for a while (though the droid was incidental). Hope it's of some quality, despite the game itself.</p>", "metacritic": null, "released": "2018-01-21", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/59c/59c614e3c60e04289f9f21eb581d0bd3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 8, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["LittleFieryOne"], "genres": [], "publishers": [], "esrb_rating": null}