{"id": 16052, "slug": "reversion-the-meeting-2nd-chapter", "name": "Reversion - The Meeting (2nd Chapter)", "name_original": "Reversion - The Meeting (2nd Chapter)", "description": "Along your journey, you'll meet new friends that will help you. New, challenging riddles in different locations all around the well known city of Buenos Aires. Those places will get you closer and closer to meeting this special person that might hold the answers to your questions.                                                                                                                                                                                 <br/><br/>You need to remember who you are. <br/><br/>Reversion - The Meeting is the second chapter of a graphic science-fiction adventure in point’n’click developed by the indie 3f interactive. Inspired by classics of the genre from Lucas Arts, Sierra or yet Pendulo Studios, 3f interactive thought its game for the fans of old school adventure games. <br/><br/>You will be propelled to a desolate future, robbed of your memories and looking desperately for clues to understanding your predicament. <br/><br/>Play as Christian and find his way back to his memories, through numerous puzzles and dialogues with intriguing characters. Team up with Victoria and Pablo, a new friend, that will guide you through the city while you learn what happened and what you can do to, maybe, change the future… <br/><br/>Plunge in this fascinating adventure and reverse the disastrous events that left the city in ruins. <br/><br/>Take your chance to change history; it’s time for Reversion. This time, in the city.Features:<br/><ul><li> Charismatic and mysterious characters <br/></li><li> Deep and challenging puzzles to keep you hooked <br/></li><li> Wide variety of interactive objects through each scenery <br/></li><li> Classic 2D graphics, as in the golden age of the genre <br/></li><li> Hand drawn characters and locations, digitally colored, achieving a beautiful result that you can see for yourself <br/></li><li> Hints system to help you move forward</li></ul>Other Reviews<br/>http://www.ordinarygamer.co.uk/2013/04/02/reversion-review/", "metacritic": null, "released": "2014-07-08", "tba": false, "updated": "2019-09-17T09:25:39", "background_image": "https://media.rawg.io/media/screenshots/6e0/6e0173bcdc0f5f6ca47c5c0bdf667520.jpg", "website": "http://www.reversion-eljuego.com.ar/", "rating": 2.33, "rating_top": 1, "added_by_status": {"yet": 4, "owned": 235, "beaten": 4}, "playtime": 3, "achievements_count": 25, "ratings_count": 5, "suggestions_count": 347, "game_series_count": 0, "reviews_count": 6, "platforms": ["Linux", "macOS", "PC"], "developers": ["3f Interactive"], "genres": ["Adventure", "Indie"], "publishers": ["3f Interactive"], "esrb_rating": null}