{"id": 160654, "slug": "trophy-defense", "name": "Trophy Defense", "name_original": "Trophy Defense", "description": "<p>In the year XXXXXXX squared you win like the BIGGEST racing competition in the known galaxy with a generic looking car from the early 21 century. But your arch-rival Mr. I.D.G.A.F. was so bothered by this that he tries to steal your trophy with drones. Now you must defend your rightful trophy on your rightful private island on the alien-named planet Whocares, since this conflict even endangers your family honour. This may be THE most important task yet humanity and other unnamed extraterrestrials have EVER witnessed.<br/></p>\n<p>You control a blue car. Accelerate by pressing W, steer left and right with A and D, S stops you instantly. To shoot the drones press Space whilst targeting them with the turret, by pressing the Arrow Right and Arrow Left , or J and K Keys. If the drones manage to carry the trophy off of the island, you lose. You can touch the trophy if it as been dropped by a shot drone, to return it to its initial position. By pressing M you can mute the music, but not the soundeffects. If you manage to drive three laps whilst defending your trophy, you win the game and save the universe from total destruction. The whole universe.</p>\n\n<p>The game is the result of the Ludum Dare 41. I want to improve many mechanics though, so Ill post updates here from now on! </p>\n<p>The Ludum Dare 41 version differs from the version on this website!</p>\n<p>Features that will be added:  Turret will be controlled by mouse; Map will be completely redesigned ; Art hopefully improved;</p>", "metacritic": null, "released": "2018-04-24", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/462/462496985ac8476414e43aef263d2702.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 18, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["August1413"], "genres": ["Shooter", "Racing"], "publishers": [], "esrb_rating": null}