{"id": 1606, "slug": "rpg-fantasy-chronicle", "name": "RPG - Fantasy Chronicle", "name_original": "RPG - Fantasy Chronicle", "description": "Sound track also on sale! Search the iTunes Store for “Fantasy Chronicle!”<br/><br/>“Fantasy Chronicle,” the RPG for fighting and bonding with companions and guardian beasts, has been released!<br/><br/>The orphan Light grew up in the village of Selka. Realizing his dream of joining Holos Over, Light swore to protect his village. But while he was on his first mission, someone attacked and destroyed Selka. <br/>In his grief, Light hears the call of a legendary Guardian Beast. To obtain special abilities, Light accepts the call and makes a covenant with the powerful beast.  <br/><br/>■Bond with companions and guardian beasts<br/>You'll forge bonds with each companion and guardian beast. The stronger these bonds, the stronger the beast and the more effective your coordinated attacks with your companions will become. <br/>Additionally, the strength of your bonds may affect the unfolding of your story. <br/><br/>■Training and Strengthening<br/>In the field you'll find materials for training and strengthening your weapons and armor. <br/>Books of Training, found in the field or gained by completing Guild missions, allow expanded variations on your training and skills. You may also be able to create uniquely powerful weapons using these books.<br/><br/><br/>■Your little helper “Ham-ko” appears in the game!<br/>The little helper “Ham-ko,” makes it much easier to collect materials from the field. <br/><br/><br/>■Video of gameplay now showing!<br/>Video of Chronicle gameplay is available on the Youtube “KEMCO channel!”<br/>http://www.youtube.com/user/KemcoGames<br/><br/>Search for Kemco’s video with the keyword “KemcoGames”!<br/><br/>■Kemco’s Twitter is  below!<br/>@KEMCO_OFFICIAL<br/>http://twitter.com/KEMCO_OFFICIAL <br/><br/>■Search for Kemco’s game with the keyword “Kemco”!<br/><br/>==================================== <br/>KEMCO’s official Facebook page is below! <br/>http://www.facebook.com/kemco.global <br/>Sale information is available by pressing the “Like!” button. <br/>====================================", "metacritic": null, "released": "2011-06-07", "tba": false, "updated": "2019-08-02T03:27:51", "background_image": "https://media.rawg.io/media/screenshots/910/910538e8e0d2e58e2fd816697f1f2563.jpeg", "website": "http://www.kemco.jp/applipage/iphone/11_game/gc_a.html", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 344, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Kotobuki Solution Co"], "genres": ["Adventure", "RPG"], "publishers": ["Kotobuki Solution Co"], "esrb_rating": null}