{"id": 16064, "slug": "archaica-the-path-of-light", "name": "Archaica: The Path Of Light", "name_original": "Archaica: The Path Of Light", "description": "<p>Archaica: The Path Of Light is a visually stunning puzzle game with lasers and mirrors, that enraptures gamers not only with finely designed levels, but also with an interesting storyline. In this game we become the Chosen One from the nation that believes walking the legendary Path of Light will save the world from impending disaster. We revive ancient mechanisms, explore secrets of an ancient civilization, and discover the true destiny of The Path along the way through extraordinary realms. KEY FEATURES:Beautiful aesthetic and an extraordinary atmosphere of an ancient and unknown civilization<br />\nWe have put a lot of work to make Archaica’s world a beautiful and remarkable place. Every single place has its unique atmosphere and encourages further exploration.<br />\nInteresting and unique puzzles<br />\nWe have prototyped hundreds of puzzles, but selected only a few of them for the game, ensuring that each puzzle is unique and based on a separate idea.<br />\nIntriguing narrative<br />\nRevealing the storyline is optional, yet it is available to players who would like to delve into the game’s world. Individual themes are being excerpted to a player piece by piece, while uncovering hieroglyphs scattered on the board. Some themes will be discovered only on completion of the challenging levels.</p>", "metacritic": null, "released": "2017-09-08", "tba": false, "updated": "2022-09-19T08:14:25", "background_image": "https://media.rawg.io/media/screenshots/6dc/6dcf5901559fafd5818d01833b81fd21.jpg", "website": "http://twomammoths.com/archaica-the-path-of-light/", "rating": 4.14, "rating_top": 4, "added_by_status": {"yet": 4, "owned": 53, "beaten": 4, "toplay": 2, "dropped": 2}, "playtime": 4, "achievements_count": 36, "ratings_count": 7, "suggestions_count": 574, "game_series_count": 0, "reviews_count": 7, "platforms": ["iOS", "PlayStation 4", "Xbox One", "Nintendo Switch", "PC"], "developers": ["Virtual Programming", "Two Mammoths"], "genres": ["Adventure", "Casual", "Indie", "Puzzle"], "publishers": ["Drageus Games", "Virtual Programming", "Two Mammoths"], "esrb_rating": null}