{"id": 160991, "slug": "aaffiinniittii1", "name": "AAffiinniittii1", "name_original": "AAffiinniittii1", "description": "<p><strong>AAffiinniittii</strong>: match those shapes with precision and speed!</p>\n<p>In each round, a random shape is generated and appears twice on</p>\n<p>the screen. The red target shape and the current white shape.</p>\n<p>Your task is to match the white shape to the red shape.</p>\n<p>To score high, don't loose time and use the least number of moves.</p>\n<p>The moves can be shifts, rotations and reflections.</p>\n<p>To shift the white shape:</p>\n<p>- you hit the \"shift\" (for translation) button,</p>\n<p>- you touch and release a point where the shift should start and then </p>\n<p>- you touch the point where the shift should end.</p>\n<p>To rotate the white shape:</p>\n<p>- you hit the \"rot\" (for rotation) button,</p>\n<p>- you touch and release a point where the center of the rotation should be,</p>\n<p>- you touch the point where the rotation should start and then</p>\n<p>- you touch the point where the rotation should end.</p>\n<p>To relect the white shape, you imagine the line that is used as a mirror axis and</p>\n<p>- hit the \"flip\" button,</p>\n<p>- you touch and release a first point on the mirror axis and then</p>\n<p>- you touch a second point on the mirror axis.</p>\n<p>With these 3 moves you can always transform the white shape into the</p>\n<p>red shape.</p>\n<p>The score you get for a matching depends on:</p>\n<p>- the the largest distance between 2 corresponding points on the red and white shape</p>\n<p> (smaller is better).</p>\n<p>- the number of moves you need for the matching (less is better)</p>\n<p>- the time you need for the matching (faster is better)</p>\n<p>Difficulty is gradually increasing:</p>\n<p>- the number and type of moves needed increases</p>\n<p>- a matching has to be more precise to be accepted and</p>\n<p>- and at some point, some operations are not allowed..</p>\n<p>Sound effects can be turned off by touching</p>\n<p>\"Sound is on\", and vice-versa.</p>", "metacritic": null, "released": "2017-03-24", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/0a2/0a27e1c4782d62720133449155f071c5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 24, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["mreczko"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}