{"id": 16109, "slug": "space-drifters-2d", "name": "Space Drifters 2D", "name_original": "Space Drifters 2D", "description": "Space Drifters 2D is a top down space shooter with Newtonian physics style movement. <br/>Made in the Unity engine with graphics and controls reminiscent of Asteroids with the added benefit of a local co-op and multiple versus modes. <br/><br/>Demo build available for download here<br/>For information on available features and what is still to come click here.Game Modes:<br/>- Solo / Co-Op Endless<br/>The Universe is collapsing, space is shrinking and you are the last pilot(s) in the universe. Survive as long as you can against 3 types of enemies. As time goes by more and more enemies will get closer to you, and no matter where you move to because space is shrinking everything will always be getting closer.<br/><br/>- Versus<br/>Why does it seem the Universe is so Matter biased? Shouldn't matter and anti-matter be created equaly? ...What if Matter and Anti-Matter fought it out in the early Universe? <br/>Defeat your opposite to claim you position in the Universe! <br/><br/>- Hold The Flag<br/>Another way Matter and Anti-Matter could triumph is be gaining mass. Pick up the Higgs Boson (flag) and hold it until the timer runs out. Holding the Boson however stop you from being able to shoot, so you must focus on dodgeing you enemies fire as he tried to destroy you and claim the Higgs Boson.", "metacritic": null, "released": "2016-03-28", "tba": false, "updated": "2019-09-17T13:35:39", "background_image": "https://media.rawg.io/media/screenshots/55b/55b5fddfb734afab910e9b5b1c7abba3.jpg", "website": "http://www.rubberduckynetwork.com/games_SD2D.html", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 105}, "playtime": 5, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 127, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC", "Linux"], "developers": ["Matthew Coyle"], "genres": ["Indie"], "publishers": ["Matthew Coyle"], "esrb_rating": null}