{"id": 16124, "slug": "mcdroid-arcade-tower-defense", "name": "McDroid - Arcade Tower Defense", "name_original": "McDroid - Arcade Tower Defense", "description": "Story: McDROID returns home to Planet M and finds this message from SOMANTO corp...<br/><br/>Welcome back to your home planet. In your farming and survival pack you get: <br/><ul><li> One (1) Modular Combine Droid (McDROID)<br/></li><li> A story campaign where each level uncovers a new game mechanic and research blueprint, and where you heal a planet.<br/></li><li> Each level has 3 difficulty, CHALLENGE continues where you left off in NORMAL with all the turrets that survived.<br/></li><li> Enemies drop corpses which debuff and damage your turrets. Gotta clean up behind yourself! (for extra loot)<br/></li><li> Trees to heal the planet (and buff your weapons and crops production)<br/></li><li> A variety of researchable giant talking weapons that you can carry and shoot around like a 3rd person shooter. <br/></li><li> A multi weapon rail to turn into a very powerful machine of peace.<br/></li><li> One unicorn skin and one skull skin (find them scattered about)<br/></li><li> Deployable base mount<br/></li><li> Tesla turrets that you can chain together a-la CnC Red Alert<br/></li><li> Economy based on McDiamonds and giant strawberries because it's the future.<br/></li><li> Factories that builds robots (that buid miniatures of factories?)<br/></li><li> Mutators that will turn your crop into Bomb Trees (not good for harvest).<br/></li><li> Cute cartoony Borderland gfx <br/></li><li> Hand Crafted levels that change with how many trees your plant. <br/></li><li> Drop in/Drop out Co-Op: because that Mutatosaurus is just too much for you. Cloud save. Persistent base and other technologies from the 21st century.<br/></li><li> Hard as nail Survival Levels with persistence: your towers and economy stay with you from death to death, but also bomb trees, unfortunately.<br/></li><li> Persistent Research. Do you focus on improving your lasers first or branch out into bliss engine as you climb through the research trees?<br/></li><li> Drop in/Drop out Co-Op: if you're overwhelmed in single campaign, have some robot-buddies join you.<br/></li><li> Persistent base building: Complete a level on Normal and you can play on in Challenge and Nightmare modes. Your base and economy will carry over but will have to withstand much deadlier attacks!<br/></li><li> Not 40s, not 50s, not 80s but 60 rock!<br/></li><li> Achievements awarded for tasks ranging from silly to tricky.<br/></li><li> Supports Xbox 360 controller</li></ul>", "metacritic": null, "released": "2014-09-05", "tba": false, "updated": "2022-09-29T23:22:08", "background_image": "https://media.rawg.io/media/screenshots/374/374d30607dcb9ccb8a2eb595e964461e.jpg", "website": "http://mcdroidgame.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 106}, "playtime": 3, "achievements_count": 24, "ratings_count": 3, "suggestions_count": 532, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC", "Linux", "macOS"], "developers": ["Elefantopia"], "genres": ["Action", "Strategy", "Indie"], "publishers": ["Elefantopia"], "esrb_rating": null}