{"id": 16121, "slug": "waveform", "name": "Waveform", "name_original": "Waveform", "description": "<p>Waveform is a simple puzzle game in which the player controls the length and amplitude of a wave. The game is inspired by the particle physics and the wave-particle duality.</p>\n<h3>Style</h3>\n<p>Waveform is set to the background of space, filled with stars and nebulas. Occasionally, a familiar planet such as Earth will appear in the background, indicating that we are traveling through the Solar system. The game is accompanied by the electronic ambient music score.</p>\n<h3>Gameplay</h3>\n<p>The wave of light under player&#39;s control has a shape of a sinus curve. It serves as a route for a particle that flies forward through space. On its way, it will encounter other photons of varying colors that the player has to collect to set a higher score. </p>\n<p>The game has around 100 levels of varying difficulty. The player will encounter a number of level features that increase the complexity of the game as he or she progresses. The dark matter is an obstacle to avoid. Mirrors reflect the particle, making it bounce back on its way. Some obstacles may even eliminate the particle.</p>\n<h3>Controls</h3>\n<p>The player controls the wave with his or her mouse. Moving the mouse left or right changes the wavelength, while up and down movements influence the amplitude. The player has to adjust the wave to navigate the particle along the route. Increasing the amplitude will also speed up the particle as it moves up and down on the screen. Meanwhile, its horizontal speed stays the same, in full accordance with the Theory of relativity.</p>", "metacritic": 81, "released": "2012-03-20", "tba": false, "updated": "2024-04-06T12:39:05", "background_image": "https://media.rawg.io/media/screenshots/5e9/5e996586e4fe42611462193cafbaa75e.jpg", "website": "", "rating": 1.98, "rating_top": 1, "added_by_status": {"yet": 63, "owned": 1456, "beaten": 4, "toplay": 2, "dropped": 33, "playing": 2}, "playtime": 3, "achievements_count": 65, "ratings_count": 96, "suggestions_count": 335, "game_series_count": 0, "reviews_count": 96, "platforms": ["macOS", "PC", "Linux"], "developers": ["Eden Industries"], "genres": ["Action", "Adventure", "RPG", "Strategy", "Simulation", "Sports", "Racing", "Casual", "Indie"], "publishers": ["Eden Industries"], "esrb_rating": null}