{"id": 161261, "slug": "wirebirds", "name": "Wirebirds!", "name_original": "Wirebirds!", "description": "<p>Connect wires and try to keep transmissions going!</p>\n\n<p>Controls</p>\n<p>X Input Analog and D-Pad supported and recommended<br/></p>\n<p>Arrow Keys = Movement</p>\n<p>A = Connect Wires</p>\n\n\n<p>This game was made for Global Game Jam 2018. The theme of the jam was \"transmission\". Taking it in the more literal sense, we made a game about bird (To get one of the diversifiers) connecting generic transmission wires to keep a steady flow of transmissions going. Transmissions give the player a point for each station they cross and the more stations an individual transmission goes through the higher a combo bonus is applied. The only features working in this build is the ability to connect stations and score points.</p>\n<p>There are many ideas that were not able to be included. The transmissions are supposed to to be unable to go back on the wire they came in on and if they hit a dead end they would fizzle out.  There was also supposed to be an element where the more transmissions a station processed the higher the chance they would break; flashing red for a brief  amount of time giving the player an opportunity to fix them before the station would lose all connections attached to it. Another game play element was that the player would have to return to the broadcast center to get a wire before being able to make a connection. Of course there were many more ideas that were considered, including a two player mode that was axed pretty quickly, but those were going to be the core basics of the game.</p>\n\n<p>Programming: Christian Clements</p>\n<p>@ccAnima</p>\n<p>Art: Colin Davis</p>", "metacritic": null, "released": "2018-02-08", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/d1b/d1be0faaaea2e6f74bb0507baa5ae59d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 61, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["chrisclements"], "genres": ["Action"], "publishers": [], "esrb_rating": null}