{"id": 16136, "slug": "fairspace", "name": "Fairspace", "name_original": "Fairspace", "description": "Fairspace is an amateur developed open-ended space exploration, trading and combat game.   A full and rich persistent universe awaits your discovery.Key Features<br/><ul><li>Full 3D flight control, Go in any direction you want.<br/></li><li>A scripted adventure is Included to help introduce the universe to you.<br/></li><li>levelling system based on XP that can be gained by combat, exploration or mining.<br/></li><li>Twitch based combat.<br/></li><li>Trade, Loot, Piracy, Mining or Bounty hunter be whatever you want to be.<br/></li><li>Modify your ships load out with equipment purchased / traded or looted from other players .<br/></li><li>Hundreds of different ships with many different load-out combinations, Discover the best combination that suits you.<br/></li><li>There are many races and zones with allegiances to build or destroy. <br/></li><li>Take jobs to improve your reputation and of course get some credits.<br/></li><li>Persistent universe featuring planets, space stations, suns and nebula’s all available to explore.<br/></li><li>You can have Multiple Ships docked around the universe and teleport between them.<br/></li><li>Once the game is loaded you will never see another loading please wait screen.</li></ul>MMOAn experimental MMO server is available for players who want to engage with others, forming teams to take joint missions or just roaming the universe killing anything they see,  There are presently no safe zones or rules on the MMO server. This is an experimental server and has not been tested to capacity.  The MMO server is sparsley populated so If the Idea of playing the game single player doesn't appeal to you then this may not be the game for you.", "metacritic": null, "released": "2015-10-21", "tba": false, "updated": "2019-08-28T22:11:09", "background_image": "https://media.rawg.io/media/screenshots/7bf/7bf41410799ad7cfb4e3b18a31d8470d.jpg", "website": "http://www.ssisgame.co.uk/fairspace", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 27}, "playtime": 5, "achievements_count": 38, "ratings_count": 0, "suggestions_count": 420, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Sub Orbital Software"], "genres": ["Action", "Strategy", "Simulation", "Indie"], "publishers": ["Sub Orbital Software"], "esrb_rating": null}