{"id": 16179, "slug": "out-there-somewhere", "name": "Out There Somewhere", "name_original": "Out There Somewhere", "description": "<p>Out There Somewhere is where Portal puzzles meet retro platforming. It begins with a scrolling shooter level at which you pilot a spaceship, but the main part of the game is completely different. The player controls the protagonist named Yuri, who crash-landed on an alien planet and is searching for the villainous Grigori who destroyed his ship. Yuri is armed with a portal gun, a device that will teleport the character to where its projectile hits a wall. Unlike in Portal, you can teleport to almost any surface as long as it’s a solid object, the transportation is instant, and there are no lasting “doors”. <br />\nEach level in Out There Somewhere is a small puzzle maze with an exit on the other side, and the player’s goal is to figure out how to get here. Yuri can “shoot himself” across the lava pits toward the other shore, through narrow corridors, or away from the villains. Initially, it is all about reaction, but eventually, the game introduces more complex mechanics, such as laser beams that divert or alter Yuri’s shots, and a regular gun that allows you to fight enemies. Out There Somewhere is stylized as a nostalgic 8-bit NES game with pixel-art graphic and is accompanied by a chiptune soundtrack.</p>", "metacritic": null, "released": "2016-03-14", "tba": false, "updated": "2024-04-06T13:06:29", "background_image": "https://media.rawg.io/media/screenshots/ddb/ddbcf3f1330e146094b0ce211e33090a.jpg", "website": "", "rating": 2.64, "rating_top": 1, "added_by_status": {"yet": 120, "owned": 2053, "beaten": 50, "toplay": 8, "dropped": 47, "playing": 4}, "playtime": 3, "achievements_count": 36, "ratings_count": 143, "suggestions_count": 163, "game_series_count": 0, "reviews_count": 143, "platforms": ["PC", "macOS"], "developers": ["MiniBoss"], "genres": ["Action", "Adventure", "RPG", "Strategy", "Simulation", "Sports", "Racing", "Casual", "Indie"], "publishers": ["MiniBoss, EQGAMES"], "esrb_rating": null}