{"id": 16188, "slug": "space-pirates-and-zombies", "name": "Space Pirates and Zombies", "name_original": "Space Pirates and Zombies", "description": "<p>At its core, Space Pirates and Zombies is an action based, skill oriented, top down space combat game.  It’s similar to the ones we knew and loved in years past, but now using full physics simulation and modern graphics for those oh so pretty explosions.  But as you dig deeper, SPAZ becomes much more.<br />\nInstead of flying a single ship, you are in charge of an ever growing and evolving fleet, unlocking the rich tactical elements of SPAZ, all accessed at the touch of a button.  Issue orders, change ships, apply fleet AI settings, all on the fly.  At any moment the battle can change, and the Tactics Panel gives you the tools to make the battle turn in your favor.<br />\nAs a layer on top of the action and tactics, we have a detailed technology and levelup system akin to what you would expect from an RPG.  Learn to build new ships by destroying your enemies.  Explore the galaxy to find components, use your hard earned research points to unlock their potential, and then customize every aspect of your new fleet.<br />\nFinally, there is the universe in which all this strife and adventure takes place.  SPAZ features a persistent randomly generated Galaxy populated with story elements, factions, enemies, missions, items, to provide you with a unique experience each time you play.  While you are struggling to survive, uncover the secret of an ever expanding Zombie infestation that spreads by establishing its own real time multi-tiered ecosystem.<br />\nKey features:                       33 ships to research, build, outfit and pilot.<br />\n70 unique components to discover and customize your fleet’s performance.<br />\nTotally physics based combat system.<br />\nFight Zombie infestations, battling a full zombie ecosystem comprising four stages of un-life.<br />\nExplore a persistent randomly generated galaxy containing hundreds of star systems.<br />\nFreedom to explore the galaxy and take on challenges at your own pace.<br />\nAid, flee, or exploit the warring factions in each star system.<br />\nThe unique event system lets the player change the balance of power in any star system<br />\nCarefully spend your hard earned research points on hundreds of upgrades across 15 categories.</p>", "metacritic": 74, "released": "2011-08-14", "tba": false, "updated": "2024-04-06T11:48:45", "background_image": "https://media.rawg.io/media/screenshots/5f4/5f45c8ee8faa310b6acb8f2a7aa12c09_Cv3UmIa.jpg", "website": "http://www.spacepiratesandzombies.com", "rating": 3.13, "rating_top": 3, "added_by_status": {"yet": 79, "owned": 1655, "beaten": 18, "toplay": 9, "dropped": 41}, "playtime": 3, "achievements_count": 48, "ratings_count": 96, "suggestions_count": 357, "game_series_count": 1, "reviews_count": 97, "platforms": ["PC", "macOS", "Linux"], "developers": ["MinMax Games"], "genres": ["Action", "RPG", "Strategy", "Indie"], "publishers": ["MinMax Games"], "esrb_rating": null}