{"id": 1620, "slug": "infinity-runner", "name": "Infinity Runner", "name_original": "Infinity Runner", "description": "The Infinity is the largest spaceship ever built by man-kind; flung into the void of space to secure humanity a new home amongst the stars. However, instead of discovering paradise, the inhabitants of The Infinity unlocked the door to a long forgotten nightmare. <br/>\n<br/>\r\nDeep inside this leviathan something terrible hunts, out of myth and legend the last werewolf stalks the ship. Infinity Runner centres on a prisoner desperately trying to escape the decaying ship and the clutches of the terror within. It’s a sci-fi action running game for PC, Mac, and Linux that features 14 action packed levels, Oculus Rift DK1 &amp; DK2 (Runtime 4.4) support and online multi-player.<br/>\n<br/>\r\nIn Infinity Runner, the player controls the protagonist, the prisoner, from a first-person perspective as he is challenged to escape from the gargantuan spaceship. This is accomplished by use of techniques and movements inspired by the disciplines of parkour and mixed martial arts, the game-play conveys the players strain and physical contact with the environment whilst dealing with the constantly changing and expansive surroundings. As well as these evasive elements there’s also combat sections in the game where a dynamic targeting system is used which calls for fast reflex combinations.  The game supports the latest virtual reality technology as well as having multi-player mode which enables up to 32 people to play head to head. <br/>\n<br/>\r\nEven though it’s a slick action game the story is very important part of your journey, as well as being your call to action it will reveal revelations along your action packed ride. Some of the story is told at high pace but there are some slower paced transition sections at the end of each level where we develop the narrative for the player. Without giving too much away you have someone guiding you through the game who talks to you telepathically. Their role is not only to orientate you but to help unfold the story for the player as you find out who you are and why you’re on the ship.<br/>\n<br/>\r\nThe Oculus Rift mode literally transports you inside the Infinity spaceship to be totally immersed in the thick of the action. The game-play is designed to complement the VR mode so you get the best experience possible and it enhances the game by adding another dimension to the playing experience. <br/>\n<br/>\r\nThere is also another feature that transforms the game into a unique experience, the multi-player mode. This allows up to a 32 players to battle it out head to head to find out who’s the ultimate Infinity Runner.<br/>\n<br/>\r\nInfinity Runner packs a lot into one super slick sci-fi action game bundle and with it re-invents the running genre!<br/>\n<br/>\r\nFEATURES<br/>\r\n* WEREWOLVES IN SPACE!<br/>\r\n* 14 ACTION PACKED LEVELS<br/>\r\n* ARCADE MODE<br/>\r\n* STORY-MODE<br/>\r\n* OCULUS RIFT MODE (DK1 - DK2 Runtime 4.4)<br/>\r\n* WOLF LEVELLING SYSTEM<br/>\r\n* MULTI-PLAYER MODE WITH UP TO 32 PLAYERS<br/>\n<br/>\r\nSTARSHIP INFINITY SPECIFICATION<br/>\r\nOver 150 miles long and nearly 30 miles in diameter at its widest point, the progress of The Infinity's construction at the Tranquillity Ship yards on the Moon could clearly be seen from Earth. The revolutionary ship requires a crew of 5,000,000 people to keep it running and is designed to house another 10 million people as general population ready for the colonisation of new worlds. The Bio-domes, seen along the side of the ship, house forests that cover nearly 60,000 square miles in total, providing oxygen and a food source for the population and an environment for rest and relaxation. The greatest technological achievement can be found in the engine room, which houses the revolutionary Infinity Drive. It is vastly smaller than previous engines at a mere 10 miles long and far more powerful than traditional models which would take up to a third of the length of a starship, creating space for more brave colonists heading out into the unknown.", "metacritic": 56, "released": "2014-07-14", "tba": false, "updated": "2022-09-29T23:22:14", "background_image": "https://media.rawg.io/media/screenshots/fe0/fe094f3c57d849893cf332fcbc69fd0a.jpg", "website": "http://www.walesinteractive.com/#!infinity-runner/c1g7s", "rating": 2.89, "rating_top": 3, "added_by_status": {"yet": 3, "owned": 103, "beaten": 4, "toplay": 1, "dropped": 2, "playing": 1}, "playtime": 4, "achievements_count": 280, "ratings_count": 9, "suggestions_count": 400, "game_series_count": 0, "reviews_count": 9, "platforms": ["Xbox One", "Wii U", "PlayStation 4", "Linux", "PC", "macOS"], "developers": ["Wales Interactive"], "genres": ["Action", "Indie"], "publishers": ["Wales Interactive"], "esrb_rating": null}