{"id": 16207, "slug": "lantern", "name": "Lantern", "name_original": "Lantern", "description": "“Once upon a time, there was a very sad princess. She felt so unloved and unhappy, that everything around her became grey and lifeless and the entire land was deprived of its color and joy. Our fable begins when a single, lonely lantern was lit in a faraway village…”<br/><br/>Be the wind and guide a beautiful sky lantern that spreads the powerful message of everlasting love, by bringing life and color back to the world around you. Enjoy four beautiful Asian-inspired worlds, each with a different theme, nature and architecture. Spread vibrant, happy colors through grey and lifeless lands by flying over them as a red, light-emitting lantern.<br/><br/>The influence of the lantern’s light not only changes the color of the world, but also produces various additional effects, such as turning other lamps on, bringing animals to life, and making windmills start spinning. You’ll ultimately succeed once the kingdom is full of color and happiness has returned to the land.<br/><br/><ul><li>Bring the powerful message of everlasting love to four Asian-inspired worlds<br/></li><li>Create wonderful lantern festivals by spreading warmth and joy<br/></li><li>Restful music and peaceful sounds will accompany you on your journey towards happiness<br/></li><li>Immerse yourself in a relaxing experience, like a virtual coloring book with an aesthetic atmosphere<br/></li><li>Virtual reality support (Oculus Rift and HTC Vive)</li></ul>", "metacritic": null, "released": "2016-11-15", "tba": false, "updated": "2019-08-28T22:11:07", "background_image": "https://media.rawg.io/media/screenshots/5bd/5bdd6a1a046fe9c4c16e992c36d2bb8d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 21, "dropped": 1}, "playtime": 2, "achievements_count": 20, "ratings_count": 1, "suggestions_count": 524, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Storm in a Teacup"], "genres": ["Indie"], "publishers": ["1C Company"], "esrb_rating": null}