{"id": 16236, "slug": "why-is-the-princess-in-a-magic-forest", "name": "Why is the Princess in a Magic Forest?!", "name_original": "Why is the Princess in a Magic Forest?!", "description": "Max is on an epic quest to save the legendary princess in the fabled magic forest where anything is possible. The twist? Max is the weakest hero ever to exist! Help Max reach the goal through a legion of levels, all the while having to deal with magic experiments, explosive sheep, friendzoned specters, black-holes and much much more! Why? Because it's a MAGIC forest after all! Help Max survive all the dangerous hazards in order to find the princess...who may or may not even exist!<br/><br/>But that's not all! When you get this game, any content released in the future will be yours to play for free. That's right! <strong>No paid DLC!</strong> You buy it, you get everything! Right out of the box we will give you 20 puzzles to rattle your brain over, and we are already well on our way to add another 10 puzzles to the game!Features:<ul><li>20 head-scratching levels (with at least 10 more on the way!) <br/></li><li>Loads of enemies and hazards to avoid <br/></li><li>A variety of items to discover and use to help Max navigate through the Magic Forest <br/></li><li>Original soundtrack composed by <strong>Chris Porter</strong><br/></li><li>Custom sound effects crafted by <strong>Robert Brown</strong><br/></li><li>Featured in the Indie Games Area of <strong>Tokyo Game Show 2015</strong></li></ul>", "metacritic": null, "released": "2016-11-10", "tba": false, "updated": "2019-08-28T22:11:05", "background_image": "https://media.rawg.io/media/screenshots/159/15968a6223bd483613aec419673bac7d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 415, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Fat Walrus Games"], "genres": ["Indie"], "publishers": ["Fat Walrus Games"], "esrb_rating": null}