{"id": 162386, "slug": "dear-ronnie-demo-2", "name": "Dear Ronnie... (Demo 2)", "name_original": "Dear Ronnie... (Demo 2)", "description": "<p>     Hook: </p><p>\"Insight into the world of a recovering drug addict.\"</p><p>     Designer Name: </p><p>Jesse Von Paratore</p><p>     Story Summary: </p><p>Ronnie is a rockstar who lost it all. He takes action into his own hands while he is locked in a recovery facility, fighting to better himself and change his ways in the only ways he knows how.</p><p>     Personal Designer Journey Paragraph: </p><p>In this game, I wanted to address a well known, yet unaddressed or mocked topic. Celebrities who fall victim to drug addiction and struggle to rebuild their life and following. I decided that the best way to do that is to place players into their shoes.</p><p>     Refinement Journey Description: </p><p>In the original version of this game, I laid out the basics of what I wanted this game to become in the future. Due to the actual dev time being 4-5 days, I was only able to lay out the framework for a tutorial level and a vague introduction into the story I plan to take the players through.</p><p>In the revise of this project, lasting just shy of two weeks, I decided to not add much more. Instead, I spent my development time polishing and perfecting the foundation for my game. The mechanics were changed until they matched my initial design. I was able to add small narrative pieces into the level to make the player's mind start to assume what will happen in the future of the game. I also focused on perfecting the look and overall feel of the game, adding camera effects and small ambient sounds to set the mood I wanted. With these changes, I have a polished single level I hope to build on in the future on my own time without the crunch from timed game jams.</p>", "metacritic": null, "released": "2017-04-14", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/e19/e19023cf47e58b25c39e80833417dbcc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 5, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS"], "developers": ["jparatore"], "genres": [], "publishers": [], "esrb_rating": null}