{"id": 16244, "slug": "a-day-in-the-woods", "name": "A Day in the Woods", "name_original": "A Day in the Woods", "description": "Goodness, what big teeth you have, Grandma!<br/><br/>Sneak past the big bad wolf, avoid massive spiders and distract bears to solve each puzzling level and get Little Red Riding Hood safely to Granny’s house.<br/><br/>In A Day in the Woods – a stylish re-imagining of the traditional sliding puzzle game – you plays as Little Red Riding Hood’s wispy winged sprite friend. It’s up to you to solve each hexagon-tiled level in the shortest number of moves possible and get Little Miss Red safely to Granny’s house. You’ll be collecting flowers and berries and making friends with bunny rabbits, beehives and the local woodcutter along the way.<strong>60 Challenging Levels to Explore!</strong><br/>With each new hexagon-title swapping level you unlock, you’ll be progressively introduced to more interesting and difficult challenges in getting Miss Red across the board to Granny’s cottage. Adding an extra layer of difficulty is the “par” rating, indicating the minimum number of moves each level can be completed in.<strong>Unlock Levels, Seasons, Wings and More!</strong><br/>Deliver the piping hot basket of baked goods, flowers and berries to Granny’s cottage in as few moves as possible to earn a full star rating and unlock new levels. You’ll also be able to unlock season backgrounds for your game as well as loads of sprite upgrades. There are a host of different wings, trail details and flares for you to choose for your fairy sprite – in your favourite colour too!<strong>Beautiful Graphics!</strong><br/>The delightful wood-cut art style of A Day in the Woods adds to the storybook charm of the game and creates a wonderful world for adults and children alike to explore.", "metacritic": null, "released": "2016-10-26", "tba": false, "updated": "2019-08-28T22:11:05", "background_image": "https://media.rawg.io/media/screenshots/621/62109126c44c349212eacf4ebe0e946a_iOmwNQs.jpg", "website": "http://www.retroepic.com/our-games/a-day-in-the-woods/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 7}, "playtime": 4, "achievements_count": 6, "ratings_count": 0, "suggestions_count": 312, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["RetroEpic Software"], "genres": ["Strategy", "Casual", "Indie", "Puzzle"], "publishers": ["RetroEpic Software"], "esrb_rating": null}