{"id": 162515, "slug": "spectral-scramble", "name": "Spectral Scramble", "name_original": "Spectral Scramble", "description": "<p>Spectral Scramble is an asymmetric, competitive game where two players play as ghost hunters while a third player plays as the ghost. Each round, the players move around the board in an attempt to locate and capture the ghost while the ghost attempts to evade capture.</p>\n\n<p>The hunters win if they can capture the ghost by landing on the same square as them within six turns. The ghost wins if he can avoid being capture for six rounds.</p>\n<p>On a hunter's turn, they can move up to three spaces by tapping (or clicking) on each location between them and their destination so long as their path goes through the green doorways. They hunters also have a \"radar\" ability which - when used - checks all eight surrounding spaces to see if the goes is there or if he has been their in the past two turns. A green dot will appear if the ghost was there two turns ago. A red dot will appear if the ghost was there one turn ago. However, if the dot is purple, you have found the ghost.</p>\n<p>On the ghost's turn, they can move up to two spaces by tapping (or clicking) on each location between them and their destination so long as their path goes through the green doorways OR the ghost can move one space through a wall by tapping (or clicking) on their destination so long as their path does not go through the green doorways.</p>\n\n<p>For this project, I served as the designer and programmer for our five person team. This project was for our practicum class at Bradley University and we worked on it from January 17th, 2018 to April 25th, 2018. This was designed to be played on a Google Nexus 9, but there are PC builds as well. </p><p>If you would like to see more of my work, you can do so by clicking here.</p>", "metacritic": null, "released": "2018-05-03", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/aae/aaef19c3f3e6e4feff14e800a47908b6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 9, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Android"], "developers": ["Alex Cline"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}