{"id": 16252, "slug": "the-dark-eye-chains-of-satinav", "name": "The Dark Eye: Chains of Satinav", "name_original": "The Dark Eye: Chains of Satinav", "description": "<h3>Boardgames are fun!</h3>\n<p>The adventure game in the point-and-click genre from the German studio Daedalic Entertainment. It was highly appreciated by the players precisely because of the adventure games and quests. The game itself is a quest based on the very popular in Germany table game with the same name - The Dark Eye.</p>\n<h3>The story</h3>\n<p>In The Dark Eye: Chains of Satinav, player have to look at the world through the eyes of a young man named Geron. Geron is a hunter, and also a very unlucky young man. But this is not a natural evil rock, but someone carefully planned situation. Being the object of ridicule of the whole town, the boy does simply not despair, but, on the contrary, tries to overcome circumstances by the only possible weapon for this - smartness. And he unwittingly becomes part of a swirl of events.</p>\n<h3>Key features</h3>\n<p>In the classic for the genre manner (point the cursor, click on the button and something will happen or not) the player will have to plunge into the world that is perfectly worked, thanks to the extensive game universe. The plot is twisted so that you do not even need to be a quest lover in order to want to understand what will happen next - on the next screen. The game is designed in such a way that it will, on the one hand, win the confidence of newcomers, allowing them to retain them thanks to a system of tips, and on the other - not to frighten regulars of the genre with their simplicity. And of course - the balance between the comic and the seriousness of the events taking place will allow the player to go into the plot and feel the atmosphere.</p>", "metacritic": 75, "released": "2012-06-22", "tba": false, "updated": "2024-01-07T09:17:38", "background_image": "https://media.rawg.io/media/screenshots/a95/a95e293cd9403f3c99666addd3d76341_TkdqnQe.jpg", "website": "http://www.satinavs-ketten.de/?lang_new=de", "rating": 3.56, "rating_top": 4, "added_by_status": {"yet": 116, "owned": 1408, "beaten": 68, "toplay": 18, "dropped": 17, "playing": 2}, "playtime": 4, "achievements_count": 36, "ratings_count": 102, "suggestions_count": 681, "game_series_count": 3, "reviews_count": 102, "platforms": ["Xbox One", "PlayStation 5", "Xbox Series S/X", "Nintendo Switch", "PC", "PlayStation 4", "macOS"], "developers": ["Daedalic Entertainment"], "genres": ["Adventure", "Indie"], "publishers": ["Daedalic Entertainment"], "esrb_rating": null}