{"id": 162672, "slug": "subway-car-run", "name": "Subway Car Run", "name_original": "Subway Car Run", "description": "<p><strong>Subway Car Runner</strong></p>\n<p> Run game suitable for kids and adults to have fun with this amazing android game<br/>Car Runner dash and fast game, Subway Car Runner, this is a run as fast as possible! Subway Car Runner games hedgehog is an incredible free game running on the subway for the rider . Run along the Subway Car Runner from chaos traffic. - New Subway Car Runner scene with a wonderful city and underground forest .<br/>Subway Car Runner Adventure is a platform running game where you need to run your way over stunning environments and amazing graphics,<br/>collect as many rings as you can to earn points<br/>Subway Car Runner is a game destined to kids and adults as well. Do you like to take a part of your time in the challenging and thrilling adventure with soni boom ! so you don't hesitate and play this Game .you will like it I'm sure .<br/>your Subway Car Runner in his run mods world.<br/><br/>Incarnates Subway Car Runner and unleashes lightning speed in different zones.<br/>Subway Car Runner is an adventure game Climber in a world,<br/>Do you like to take a part of your time in the challenging and thrilling adventure with Subway Car Runner ! so you don't hesitate and play this Games .you will like it I'm sure<br/>while the real Subway Car Runner climbing in adventure world full of speed and run.<br/><br/>Subway Car Runner is totally one of the most addictive and entertaining free games ever made with great game quality, download now and experience the joy of jumping the hurdles through various shadow worlds! one of the most addictive and entertaining physics based running games ever made! And it's free game!<br/><br/>★★★FEATURES Of Subway Car Runner★★★<br/>★★★ Have a nice graphical style and the HD display.<br/>★★★ Has an excellent UI menu.<br/>★★★ Graphics Design and animation is very thorough.<br/>★★★ Fun and games for free.<br/>★★★ Has two control jumps and slides.<br/>★★★ Have a vibration force when something out of the ground.<br/>★★★ Visually pleasing to play in various environments<br/>★★★ Free &amp; easy to play, challenging to master</p>", "metacritic": null, "released": "2018-05-01", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/c2d/c2d056e30d512f54a13eec9bbcd7d9e3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 65, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ljlapps"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}