{"id": 162737, "slug": "the-jungle-hero", "name": "The Jungle Hero", "name_original": "The Jungle Hero", "description": "<p>The Jungle Hero : Tree Climber is a 2D platform adventure game where the character is a ninja monkey and he is after his random squirrels. While climbing watch out for obstacles like other ninjas, tree branches, and of course be sure to spot the squirrels on the clothes lines. The Jungle hero is ultra-active and super flexible: he can do amazing actions like jumping, and gliding to kill the squirrels! Help him to climb and best possible power ups to be more robust and invincible against enemy attack!</p><p>The Jungle Hero is designed with soothing sounds in mind, to experience the amazing game play.</p><p>The Jungle hero is an endless tree climbing game; its game play is very unique with new level of challenge and awesome dynamics. In the last level of each world the Jungle hero will have to defeat the trees branches and squirrels with different powers and abilities….help him to climb more.</p><p>With a great action, our jungle hero will provide you with countless fun, so don't hesitate and give Jungle Hero a try, you will be amazed with the great experience you will get from playing this game!</p><p>Instructions:</p><p>★ Tap to jump and hit the birds with blades.</p><p>★ Pass through obstacles.</p><p>★ Collect power-ups and make your High-Score a big challenge.</p><p>Game Features:</p><p>★ Endless play</p><p>★ Gorgeous environment.</p><p>★ Obstacle elements.</p><p>★ Score tracking</p><p>Play Jungle Hero now for free and enjoy hours of fun! How high can you get?</p><p>Check us out!</p><p>Games: https://play.google.com/store/apps/developer?id=Pug+Studio</p><p>Website: http://pugstudio.net/</p><p>Google+: http://google.com/+PugstudioNetgaming</p><p>Youtube: http://youtube.com/c/PugstudioNetgaming</p><p>Facebook: https://www.facebook.com/pugstudio/</p><p>While Jungle Hero is free to play and does not contain any microtransactions, the game is ad supported. The ad revenue helps pay for the development team and we're very grateful to have you as a player in our game supporting us. Thank you!</p>", "metacritic": null, "released": "2017-05-01", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/518/518bd8f748f9208061f75e9bf039c6d7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 57, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["PugStudio"], "genres": [], "publishers": [], "esrb_rating": null}