{"id": 163147, "slug": "noisy-smash", "name": "Noisy Smash", "name_original": "Noisy Smash", "description": "<p>1 week project for Prototype Studio class, Spring 2017. Prompt: Personal prompt for each student - mine: Make something messy.</p>\n<p>I'm not sure if I really followed the spirit of my prompt, but this game does use random noise, so hopefully that counts as messy. One idea I've been thinking about is the concept of asymmetry in competitive games. I think it makes for interesting dynamics when each player has different goals and is trying to pursue them while also having to think about what the other player is trying to do. The problem is that it doesn't feel good (in my opinion) to have a large, frontloaded decision at the beginning of each game that is disproportionately impactful on how the the game will play out. Additionally, there are inevitable balance issues where a archetype/character is at a significant disadvantage against another, making for a situation that can feel unfair and less interesting. One solution is to have the asymmetry emerge naturally over the course of the game, so that the dynamic of diverging styles &amp; goals still comes about, but in a way that gives players the power to decide, or at least react to, the current situation. </p>\n<p>This game operates like a simplified smash bros, where you attempt to knock the opponent off the stage while racking up damage that will cause them to get knocked back farther. The twist is that your size, power, and speed are in constant flux, changing smoothly according to a Perlin noise generator.  When you are small, you are fast but weak, and when you are large, you are slow but strong. This means you must adapt to the current situation and re-evaluate your strategy constantly. In practice, it's still probably unbalanced -  if you are small, you mostly just have to run away until you are bigger, but it does at least succeed in creating the desired changing dynamic.</p>", "metacritic": null, "released": "2017-06-19", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/2e2/2e2e82363f8f26c381f625c3ea004ec1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 2, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ben Costrell"], "genres": ["Action"], "publishers": [], "esrb_rating": null}