{"id": 163397, "slug": "my-car-sim", "name": "My Car Sim", "name_original": "My Car Sim", "description": "<p>English: </p>\n<p><strong>Welcome to public test of my car sim game</strong></p>\n<p>Before I begin, public test build won't be anything like the final game. It's combed together from few assets quick tech demo, treat it like a sandbox. Final game will have more things to it, like building your own car, and living your life in mid-90s Poland. Plans are big, but only time will tell what will become of this. For now, just enjoy this tech demo. </p>\n<p>In this version you can drive around fiatXD car, based on Fiat 126p. I've spent too much time on this model that I want to admit, but hey, at least I'm learning. There are also 5 cars in the game, that you can unlock by collecting + signs scattered around the place. Don't worry, they're not hidden that well. And car spawn points are even simpler to find. However, don't be scared when you find one particular portrait...</p>\n<p>Aside from driving around and finding signs, you can adjust your car parameters on the go. There are no limits, however you can break the game if you mess too much. You can also check the lighting by switching day/night cycle on demand. Additionaly, you can test your settings by doing lap times on a track, or using the drag strip.</p>\n<p><strong>Enjoy!</strong></p>\n<p><strong>Control Scheme: </strong></p>\n<p>WSAD - control character/vehicle<br/>Left CTRL - crouch<br/>V - Change FOV<br/>C - Change Camera (when car isn't available it'll show placeholder cam)<br/>MouseWheel - While in car and using outside camera, zooms the view<br/>R - Resets fiatXD car to it's nominal position<br/>X - Gear Up<br/>Z - Gear Down<br/>L - In car, changes lights Mode<br/>Q - Change pixel light count<br/>U - Change day/night<br/>J - reset lap time<br/>G - Zoom the view<br/>1 on main keyboard - Hides GUI</p><p>Enter - Get out of car<br/>Left Mouse Button - Get in the car (try to aim at the door/seat)<br/>Left Shift - Run (If I implemented this properly)<br/>Escape - Release cursor lock (left click anywhere to lock it again)<br/>Alt + F4 - Exit the game</p>\n<p>Numpad 2,8,4,6 - in car, adjusts seat down,up,left,right accordingly<br/>Numpad 1,3 - adjusts seats back, front<br/>Left Alt + P - shows debug screen (more info below)</p>\n<p><strong>Debug Mode: </strong></p>\n<p>Debug mode allows you to change many parameters of the car \"on the go\". Use this menu when you're in the car you want to play with. You can change things like max torque, gear ratio, suspension options and few others. You can't change ammount of gears at the moment. Debug mode also allows you to reload the scene if all goes wrong, or just restore the default values if only some of the things gone wrong (I think I disabled it for cars other than fiatXD). Suspension settings are scrollable, you just need to hold left mouse button and move it up and down in empty spot within Suspension rectangle. You can save debug data as a user-friendly txt file, and add annotations to your configs, however, you can't restore saved specs in game at the moment. Settings are saved in game when you exit the debug mode by pressing alt+p, and saved to txt file when you hit save. txt saves are in your ~/test_Data folder</p>\n<p><strong>Known Issues: </strong></p>\n<p>- Lighting/shadows problem. Some shadows are flickering due to unnatural and hastily combled together terrain. Possibly pixel light count can fix this, or lower graphic setting<br/>- FPS drops when there are too many cars. Possibly due to lack of quality and mesh control while importing some test cars into the this build<br/>- You can enter the car within the car. Didn't get any issues with it so I left it. <br/>- You can crash into invisible racetrack/drag strip checkpoints. I have no clue why is this even a thing, but it's not happening every time. </p>\n<p><strong>Minimum requirements:</strong></p>\n<p>Processor Intel i3</p>\n<p>Graphics Card GTX 650, with 1GB RAM</p>\n<p>4GB Ram</p>\n\n<p>Polski: </p>\n<p><strong>Witam w publicznym teście mojej gry. </strong></p>\n<p>Zanim zacznę, chciałem zaznaczyć, że testowa wersja nie będzie wyglądać ani trochę jak końcowy produkt. Jest to po prostu na szybko sklejone z gotowych assetów tech demo, można je traktować bardziej jako sandbox. Końcowa wersja będzie miała więcej rzeczy do roboty, jak tworzenie własnego auta, czy życie w Polsce lat 90. Plany są wielkie, ale tylko czas pokaże co z tego wyjdzie. </p>\n<p>W tej wersji możesz jeździć autem bazowanym oczywiście na maluchu. Spędziłem więcej czasu nad tym modelem niż bym sobie tego życzył, ale przynajmniej nauczyłem się sporo. Poza nim dostępne jest również 5 innych aut, które mozna odblokować zbierając pięć plusików rozsianych po planszy. Nie bójcie się, nie są pochowane tak dobrze. A same punkty spawnu pojazdów są jeszcze prostsze do odnalezienia. Jednakże, nie bójcie się, gdy znajdziecie pewien portret...</p>\n<p>Poza jazdą autem i szukaniem plusików możecie zmieniać w locie parametry pojazdów. Nie ustawiałem limitów, ale miejcie na uwadze, że można popsuć gre jeśli pokombinujecie za dużo. No i można sprawdzić jak zachowuje się oświetlenie poprzez zmianę cyklu dnia/nocy na żądanie. Dodatkowo, można sprawdzić swoje ustawienia robiąc czasówki na torze czy używając drag strip. </p>\n<p><strong>Miłej zabawy!</strong></p>\n<p>Sterowanie: <br/>WSAD - kontrolowanie postaci/auta<br/>Lewy CTRL - kucanie<br/>V - zmiana FOV<br/>C - zmiana kamery (jeśli nie odblokowałeś auta, kamery będą w statycznym miejscu na planszy)<br/>Kółko myszy - zmiana odległości zewnętrznej kamery auta<br/>R - resetuje malczana do oryginalnej pozycji<br/>X - bieg w górę<br/>Z - bieg w dół<br/>L - włączenie/wyłączenie świateł w aucie<br/>Q - zmiana ilości oświetlanych pixelów(pixel light count)<br/>U - zmiana cyklu dnia/nocy<br/>J - resetuje czas okrążenia<br/>G - przybliża widok<br/>1 na głównej klawiaturze - Chowanie GUI<br/>Enter - wysiadanie z auta<br/>Lewy Przycisk Myszy - Wchodzenie do auta (trzeba mierzyć w okolice siedzenia kierowcy/ drzwi)<br/>Lewy Shift - Bieg (jeśli dobrze to zaimplementowałem)<br/>Escape - \"Uwalnia\" Kursor (lewy klik gdziekolwiek by zablokować spowrotem)<br/>Alt + F4 - Wyłącza grę</p>\n<p>Klawisze numeryczne 2,8,4,6 - W aucie, zmiana ustawień siedzenia w dół, górę, lewo, prawo<br/>Klawisze numeryczne 1,3 - siedzenie do tyłu, przodu<br/>Lewy Alt + P - Pokazuje okno Debugowania (więcej info poniżej)</p>\n<p><strong>Okno Debugowania: </strong></p>\n<p>Tryb Debugu pozwala na zmianę wielu parametrów w locie. Używa się go będąc w aucie, którego ustawienia chcesz zmienić. Można zmieniać rzeczy jak moc silnika, przełożenie biegów, zawieszenie i kilka innych. Nie można zmieniać ilości biegów póki co. Okno debugu pozwala także na przeładowanie gry, jeśli coś pójdzie źle. Jeśli coś pójdzie mniej źle, można przy użyciu przycisku \"reload defaults\" przywrócić domyślne parametry auta (choć nie jestem pewien, ale chyba działa tylko dla malczana). Ustawienia zawieszenia można przewinąc, ale trzeba kliknąć w wolnym miejscu w obrębie okienka zawieszenia i przesunąć mysz. Możesz zapisać swoje ustawienia w łatwym do odczytania pliku txt, dodać adnotację, ale niestety, nie można jeszcze wczytać ich spowrotem. Ustawienia są zastosowane, gdy wyjdziesz z debug menu kombinacją alt+p, a plik txt gdy nacisniesz \"save data\". Znajdziesz go w folderze ~/test_Data</p>\n<p><strong>Znane błędy:</strong></p>\n<p>- Problem z oświetleniem/cieniami. Niektóre cienie błyskają, winie za to szybko zrobiony przeze mnie, nienaturalny teren. Dodałem opcję zmiany pixel light count, bo ta opcja może naprawić problem, albo zmniejszenie ustawień graficznych<br/>- Ilość klatek na sekundę spada, gdy w scenie jest zbyt wiele aut. Auta były importowane na szybko, przez co nie poprawiałem w nich żadnych geometrii, co prawdopodobnie prowadzi do nienaturalnego i niepotrzebnego zwiększenia wysiłku silnika graficznego. <br/>- Możesz wsiąść do auta będąc w nim. Nie zauważyłem żadnych błędów z tym związanych, więc tego nie ruszałem. <br/>- Możesz rozbić się o niewidzialne bramki na trasie/drag stripie. Nie mam pojęcia czemu tak się dzieje, ale na szczęście nie zdarza się często więc nie powinno mieć wpływu na twoje wyniki. <br/><br/></p>\n<p><strong>Minimalne wymagania (teoretycznie):</strong></p>\n<p>Procesor Intel i3</p>\n<p>Grafika na poziomie GTX 650, z 1GB pamięci VRAM</p>\n<p>4GB Ram</p>", "metacritic": null, "released": "2018-08-23", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/772/77265a3675ad37aaf91644a0a2c170d0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 21, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["niebezkrytyczny"], "genres": ["Simulation", "Racing"], "publishers": [], "esrb_rating": null}