{"id": 16343, "slug": "a-story-about-my-uncle", "name": "A Story About My Uncle", "name_original": "A Story About My Uncle", "description": "<p>A Story About My Uncle is a first-person adventure with a heavy focus on moving using a grappling hook and a non-violent approach thus making the plot and landscapes the critical focus of the gaming experience. There is no series of this game: it is the only title in the IP by Gone North also known as Goat Simulator creators. <br />\nThe core gameplay features are the energetic costume giving its owner the ability to jump higher and use the grappling hook, and various updates to this outfit, for example, jetpack boots. While mastering this Spider-Man-like potential, the hero encounters various non-hostile NPCs and environment, the only menacing obstacle in the game is a one-eyed worm, lurking in one of the caves. However, the worst scenario is that it blows you off the cliff. Worm likes to take a nap so getting over him is not a big deal.<br />\nThe plot follows a boy looking for his uncle, Freud. His nephew, after a little research in his flat, has discovered the super costume and traveled to another dimension. There are some optional collectibles scattered across the world. We shall also meet Maddy, who helps us find a missing character</p>", "metacritic": 73, "released": "2014-05-27", "tba": false, "updated": "2024-04-12T07:19:53", "background_image": "https://media.rawg.io/media/games/37a/37a9536e92cf8fe3b60045aa75dbd41f.jpg", "website": "http://gonenorthgames.com/games/a-story-about-my-uncle/", "rating": 3.17, "rating_top": 4, "added_by_status": {"yet": 447, "owned": 4783, "beaten": 390, "toplay": 64, "dropped": 175, "playing": 12}, "playtime": 3, "achievements_count": 15, "ratings_count": 628, "suggestions_count": 495, "game_series_count": 0, "reviews_count": 635, "platforms": ["PC", "macOS", "Linux"], "developers": ["Gone North Games"], "genres": ["Adventure", "Arcade", "Casual", "Indie", "Platformer"], "publishers": ["Coffee Stain Studios"], "esrb_rating": "Everyone 10+"}