{"id": 163701, "slug": "forest-hunter", "name": "Forest Hunter", "name_original": "Forest Hunter", "description": "<p>You can not use game content for sale or edit<br/></p>\n<p>You can not resell the game</p>\n\n<p>Story line.</p>\n<p>Awaken from a stupor surrounded by unknown streets I looked around in a complete confusion trying to remember how did I get here. The city was unknown to me and strange garments that were worn seemed exotic. Two men outfitted in military uniforms complete with strange weapons approached me. To my relieve they explained that I was a newcomer to the First City where outside the city walls laid the lands of the Wilds and the Demons. My escorts lead me across the Ring Land to a Japanese style castle where I was told the government was located. As we walked they showed me a marketplace where goods and artifacts could be sold for weapons, armor and hunting nets. As we passed farther I was shown a district of the city where rest and relaxation come easy to an eager seeker. I was told I could earn by hunting the Demons and the Wild which are used as a labor force, but those who abided by the rules were given a chance to become citizens of the First City. I learned that in the Hunter League you can develop your search and hunting skills and from the Government you can take on some missions and licenses granting higher profit and visibility skill. By the end of our journey I was given a house and from that moment on I was a Free Hunter.</p>\n<p>In the Hunters League you can develop your search and hunting skills.</p>\n<p>In the Government you can take some missions, licenses, which allow selling at a higher profit, and a visibility skill.</p>\n<p>To my surprise they gave me a house and I was sent back there. From that very moment I was a Free Hunter.</p>\n<p>News:<br/></p>\n<p>+ All the girls are covered.<br/>    Not to embarrass anyone.<br/>    No nudity.</p>\n<p>+ More picture<br/>+Location - mounts<br/><br/>Feature:</p>\n<p>- Dynamic events<br/>- Dynamic locations<br/>- Change the time of day<br/>-  Beautiful pictures<br/>-  No identical enemies</p>\n<p>- Lacalization: English, Japanese</p>\n<ul><li>CPU Cores: Dual Core</li><li>Minimum RAM: 512 MB</li><li>DirectX Version: 9.0c</li><li>Graphics Card RAM: 512 MB</li><li>Graphics Card: 9.0c</li><li>Graphics Card Shader Model: Not Required</li><li>Sound Card: None</li><li>CPU Speed: 2.6 GHz</li><li>Operating System: Windows 7/8/10 (32/64-bit).</li></ul>", "metacritic": null, "released": "2014-07-16", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/30b/30b09836a089f424404bc9347091f59a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 377, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["SAA GAME STUDIO"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}