{"id": 163840, "slug": "xong-2009", "name": "Xong (2009)", "name_original": "Xong (2009)", "description": "<p>\n<strong>Blast from the past! I'm re-releasing my 2009 puzzler \"Xong\" with updated builds for 64-bit Linux systems and a new Windows build that also runs on Wine. The original Mac build is included too.</strong></p><p>You may wish to <strong>check out the modern remake instead</strong>: http://dto.itch.io/1x0ng</p><p>\r\n\tXONG is a fast-moving procedurally-generated puzzle game for Linux, Mac OSX, and Microsoft Windows. XONG is for one player using a keyboard and mouse.\r\n</p><p>\n</p><p>\r\n\t XONG is pronounced \"zong\" and programmed entirely in the Common Lisp programming language.\r\n</p><p>\r\n\t You control a vulnerable white square attempting to infiltrate a semi-randomly generated abstract color-field environment infested with robots. You are armed with a paint-absorbent hockey puck that can pick up color and transfer it to other objects. If you lose your puck, you have to find another; these are scattered through the environment and look like the letter P. There are no hit points; any hit kills you, and completely ends your game. You cannot shoot enemies; instead you drop direction-changing arrows called \"chevrons\" to guide them to their doom in one of XONG's many black holes. But your puck will also follow the arrows, so be careful where you fire; otherwise you'll lose it down a black hole.\r\n</p><p>\r\n\t To clear a level, one must defeat all the enemies and use the paint to open the coded lock that blocks the exit to the next level. The game generates boards of increasing difficulty as one clears them, and there is no win-condition at all; you just keep playing until you die.\r\n</p>\r\n\tReviews of Xong from around the web:<p>http://www.rockpapershotgun.com/2010/07/20/king-of...</p><p>\r\n\thttp://www.gamesetwatch.com/2010/02/xong_combines_...\r\n</p><p>\r\n\t(Wayback Archived) Review at Playthisthing.com<br/></p>My own perspective:<br/><p>I think people enjoy XONG because it combines quick reactions (you only get ONE life, and ONE hit kills!) with a certain amount of pre-planning in how you will defeat each enemy. You have perfect information (you can see the entire game board and every object at any time) and most enemies behave in (roughly) predictable ways. </p><p><em><strong>Note: XONG is old (2009), and was one of my earliest game releases. As such it is a bit clunky and unpolished, and shows my design and programming skills as they existed at that time. Nonetheless it is still fun!   I</strong><strong> hope you will forgive the simplistic graphics, and enjoy my goofy little game! </strong></em></p><p><em><strong>Happy Xonging! ----Dave</strong></em><br/></p>", "metacritic": null, "released": "2015-12-03", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/cfc/cfc805b91d481afa7b83ad619ced24ad.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 7, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["dto"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}