{"id": 163880, "slug": "morticum", "name": "Morticum", "name_original": "Morticum", "description": "Hi there!\r\n<p><strong><em>Morticum</em> </strong>is a video game based on once popular flash game called \"Super amazing guitar maniac deluxe 4\". While playing it, I always wanted to make song levels myself. Fast forward a couple of years and here we are now!</p>\r\n\r\nGame structure:\r\nPlaying mode:\r\n<p>In <em>play mode</em> you can play your own song levels or shared by others (if you placed one in the \"SongMaps\" folder). While playing, the game tracks your score, accuracy and current combo variables. After you have completed the level, the game presents you with <em>play mode</em> statistics and saves your highscore and grade <strong>locally</strong>. (The game always overwrites worse scores or grades)</p>\r\nEditing mode:\r\n<p>Selecting <em>editing mode</em> will give you many options to modify your song level. You will be able to Play/Pause the song, jump to specific point in the song (by dragging the slider). Spawn keys with a button or by the \"N\" keyboard key.</p>\r\n\r\nControls:\r\n<ul><li>Ctrl + S = Save song level.</li><li>Ctrl + C = Copy key selection.</li><li>Ctrl + V = Paste key selection.</li><li>N = Spawn new key.</li><li>(In edit mode) Click and drag a key to move it.</li><li>(In edit mode) Hold and drag to make a \"box\" to select multiple keys, then move one of the selected to move the whole block.</li><li>(In edit mode) Double click a key to change it to a sliding key or to revert it back.</li></ul>\n<p>(If somehow you can't use \"Ctrl\" use \"Shift\" key instead)</p>\r\nOther remarks:\r\nSong level creation tutorial:\r\n<p>If you want to make a new song level, first go to the second screen (where song levels are presented), then click \"Create new\" button. Now a new song level will appear with a title \"New Song map\". Click \"Edit\". </p>\n<p>After you have entered <em>edit mode</em>, go to the game folder \"Morticum_Data\" (near the executable), then \"SongMaps\". There you will find your new song level folder data.(You can change the folder name <strong>ONLY </strong>when the game is <strong>NOT </strong>running) In this folder there will be a \"SongMapData.txt\" file ( <em>don't touch it! ;-)</em> ). There you can add a audio file (it <strong>MUST</strong> be .wav or .ogg. (preferably the latter)) If you don't have the right extension, please convert it to .ogg through a some kind of a web site. (Like this one) And if you so desire you can add a .jpg or .png picture to serve as an icon of your song level. (Name <strong>MUST</strong> be \"Icon\")</p>\n<p>When you go back to the game, your audio file name will be written on the left side. If on the slider's right side the number is not 00:00. Then it is all good! Please try playing the audio then. But if it is showing you \"00:00\" try changing the song name into something simpler or if it is a .wav file, converting it to .ogg and if it works <strong>RESTART</strong> the game.</p>\n<p>Now you can press the \"Create a new key\" button or the keyboard \"N\" key (it works while playing the audio file) to spawn a new key. (Don't forget to change the song level name, and save frequently!) :^)</p>\r\nPlay mode grading:\r\n<ul><li><strong>SS</strong> - if accuracy is 100%</li><li><strong>S</strong> - if accuracy above 95%</li><li><strong>A</strong> - if accuracy above 90%</li><li><strong>B</strong> - if accuracy above 80%</li><li><strong>C</strong> - if accuracy above 70%</li><li><strong>D</strong> - if accuracy above 60%</li><li><strong>F</strong> - if accuracy above 50%</li><li><strong>N/A</strong> - if accuracy below 50%</li></ul>\n<p>(Oh and you can press on a song level box to preview the song audio and some stats about the song level)</p>\n<p>(By the way, if you change the song level key position in any way the highscore and grade will be nullified)</p>\r\n\r\nProject team:\r\n<p>The only person who participated in creating this project was Dovydas Gudauskas.</p>", "metacritic": null, "released": "2018-07-01", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/649/649fcd506e2294452bcf9e7e609075b0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 23, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Game dream st."], "genres": [], "publishers": [], "esrb_rating": null}