{"id": 164028, "slug": "odyssian-void", "name": "Odyssian Void", "name_original": "Odyssian Void", "description": "<p>It is the year 6402.  After a brutal war with the Sluikan, Humanity stands on the brink of extinction after an unknown race interjects itself into the Seven Year war and overthrows Earth Alliance governments on countless worlds along with destroying Earth.  A handful of planets do not fall prey to the schemes of this alien race; some by by chance and others due to the actions of a brave few.  Your home, Al'Cot, is one such planet.</p>\n<p>The Earth Alliance Outer Space Military Command has issued a decree that all able bodied adult citizens be conscripted into the EAOSM for help combat the combined Sluikan/Unknown threat.  You are made a captain, put through intensive training, and are given a frigate with two directives:</p>\n<p>1. Accept orders from EAOSM Command</p>\n<p>2. Help to rebuild the Earth Alliance in any way possible</p>\n<p>There is also a secret, third directive:</p>\n<p>3. Find which race has done the unthinkable, destroyed a home world, and retaliate in kind.</p>\n<p>___________________</p>\n<p>In the universe of Odyssian Void there is much to be discovered and a number of ways in which you can become a part of it.  Dutifully follow the orders given to you by your commanders or strike out on your own to whatever end it may bring.</p>\n<p>In Odyssian Void you will find a rich ocean of lore, a vast and ever growing universe to explore, and a number of different roles for you to play as.  The main mission line is optional and side missions and entire story arcs related to what career you choose to be will be available.  Become a bounty hunter and search out the scum of the universe, or become a pirate and join a piracy sect or start one, join the Talirath the elite police force of the Galactic Government, start your own empire, enter into politics by running for a Galactic Parliament seat or even Galactic Magistrate.  If none of these is appealing there is also a more entrepreneurial route, start your own corporation and develop custom ship, weapon, or module designs or start your own trade conglomerate.</p>\n<p>Explore the undiscovered country, push the boundries of the known galaxy, and watch as your discoveries have an impact on the galaxy at large.  The possibilities are endless but so are the dangers.</p>", "metacritic": null, "released": "2014-06-18", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/ed1/ed1dd007b85a9e14714ac9c03dd8e5e0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 100, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Geowil"], "genres": ["RPG", "Simulation"], "publishers": [], "esrb_rating": null}