{"id": 164085, "slug": "fire-the-power-block-shooting-game", "name": "Fire The Power - Block Shooting Game", "name_original": "Fire The Power - Block Shooting Game", "description": "<p>Fire The Power is fully offline endless and challenging block shooting game. Fire The Power has random incoming blocks every time and control of tank is very easy so playing this game is really having more comfortless then other block shooter games.\r\n  </p>\n<p>Into the game shoot, the blocks are very simple just take the tank in straight down the block and shooting balls destroy it in seconds. Continuously on fire will help you to make more score by destroying blocks.\r\n  </p>\n<p>In this absurd region of the space, face the flint walls blocking your way. Deny the existence of flint walls &amp; face them head-on. Chose the wrong flint in hurry in this nonstop environment &amp; you’ll be doomed.\r\n  </p>\n<p>Hold and drag the tank for shooting blocks. Fire The Power is block shooter game with amazing sound and graphics. Fire up balls and destroy blocks for score higher. Fire The Power is top block shooting game ever.\r\n  </p>\n<p>Shoot the blocks with balls and don’t stop until you beat your own score. Update your tank by taking power-ups points. Block shooter games are most funny and positive for anyone that plays other shooting games.\r\n  </p>\n<p>Hold the tank and hit em up the fire blocks that reached nearby. Take power up points and get ride out and destroy different color blocks as you can.\r\n  </p>\n<p>Challenge your friends to beat your score and have fun with buddies.\r\n  </p>\n<p>A game gets exciting when you progress, your uneven ride will pick up the pace, and get ready to face the stronger flint walls with a limited firearm. Yes!!! Further, you go, higher the difficulty.\r\n  </p>\n<p> \r\n  </p>\n<p>HOW IT WORKS –   </p>\n<p>• Simple starting button of the game.\r\n  </p>\n<p>• Find and Destroy weakest block form upcoming blocks.\r\n  </p>\n<p>• Fire until the block will not destroy.\r\n  </p>\n<p>• Collect power-ups to upgrade tank.\r\n  </p>\n<p> \r\n  </p>\n<p>FEATURES –\r\n  </p>\n<p>• Simple intuitive design and animations.\r\n  </p>\n<p>• Spawn your 2nd run, continuing 1st run’s records.\r\n  </p>\n<p>• Pick up power-ups in the game. Increase your power &amp; defense.\r\n  </p>\n<p>• Share your high score in one click.\r\n  </p>\n<p>• Easily share with your friends.\r\n  </p>\n<p> \r\n  Download today and challenge your friends for the beat you.</p>", "metacritic": null, "released": "2018-06-22", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/c29/c296eb63d42683f30dfe3334d30e85c8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 51, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "Android"], "developers": ["maxgentech"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}