{"id": 164070, "slug": "pilgrimage-itch-samthesomebody", "name": "Pilgrimage (itch) (SamTheSomebody)", "name_original": "Pilgrimage (itch) (SamTheSomebody)", "description": "<p><strong>What is Pilgrimage?</strong></p>\n<p><em>Pilgrimage</em> is an aesthetically pleasing non-game. I couldn't get it's core mechanic, saving, to work so it's a not a hip thing but its got some visual assets which might validate a download. If you choose to, imagine it as a game you would open every day and play, slowly amassing more pilgrims.</p>\n<p><strong>Post Development Comments</strong>\n</p>\n<p>Ritual; that was the theme for the third Game A Week. It's very board when you actually think about it. Take, for instance, the route I took; a game you play ritually. A cool idea, which has been done here and there. Of course, knowing me, I went on tangent about all of the cool things I could do to with it and didn't get anywhere at all. Instead I hit a roadblock; saving.</p>\n<p>Originally the game was called <em>Siege</em> (you might find a few hints that point to that when you run the game) and you would amass an army, day by literal day, until you decide to attack the wall. I had a bunch of different character designs which I never got a chance to implement, each having a rock, paper, scissors type of relationship to the wall but as the week began to draw to a close I pulled back from that and reassessed. Even then I couldn't get saving to work.</p>\n<p><strong>Where To From Here</strong></p>\n<p>Back to <em>Siege</em>! If I honestly was going to return to this, it would only be to develop my understanding of saving. The original idea was nice but onward and upwards, this isn't worth looking back on.</p>", "metacritic": null, "released": "2017-08-28", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/e97/e975c66f30dcd4fd1caadacc1f9e5408.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 22, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SamTheSomebody"], "genres": [], "publishers": [], "esrb_rating": null}