{"id": 164274, "slug": "jumping-jacksons", "name": "Jumping Jacksons", "name_original": "Jumping Jacksons", "description": "<p>Jumping Jacksons is a side-scrolling platforming game that simulates the feel of many classic games. Explore diverse regions and levels and collect treasures to unlock secrets. Experience new enemies and remember how they function, it may come in handy in ways that you may not expect. </p>\n<p>The objective to Jumping Jacksons is to clear a stage, usually by traveling from the left side of the stage to the right.</p>\n<p>There are a variety of enemies that work in different ways. Among those enemies are there are different colored species that will act in a slightly different manner than others of their species. Make mental notes of how each enemy works and how you can use that knowledge to overcome them and progress.</p>\n<p>There is a collectible coin in each stage. These coins will be harder to obtain than normal coins and may take some time to find and/or a show of skill to obtain them. Find all the collectible coins may unlock something nice for the player.</p>\n<p>Each world has new terrain, enemies, mechanics and challenges.</p>\n<p>If you're ready to dive into the world of Jumping Jacksons down load the demo today.</p>\n<p>Note: Some of the stages are only part of the sample version of the game and will not appear in the full release.<br/></p>\n<p>Final release TBA.</p>\n<p>New version coming soon; follow social media to keep up with the updates.</p>\n<p>Official Site: http://newbenland.com/</p>\n<p>Twitter: https://twitter.com/New_Benland</p>\n<p>Facebook: https://www.facebook.com/newbenland/</p>\n<p>[This version does not support key remapping]</p>\n<p>Controls:</p>\n<p>A - Left</p>\n<p>D - Right</p>\n<p>Space_bar - Jump</p>\n<p>Hold down Shift - Run</p>\n<p>L or Enter_Key - Shoot fire (with powerup)</p>\n<p>S - Crouch or climb down vines</p>\n<p>W - Interact with doors or climb up vines</p>\n<p>Escape - pause</p>\n<p>Backspace - select </p>\n<p>Tab - view controls</p>\n<p>Menus are controlled by W - up, S - down, Enter input choice.</p>\n\n<p>Game-pad Compatible.</p>\n<p>left stick (left) - Left</p>\n<p>left stick (right) - Right</p>\n<p>'A' (xbox) - Jump</p>\n<p>Hold down right trigger - Run</p>\n<p>'X' (xbox)  - Shoot fire (with powerup)</p>\n<p>left stick (down)- Crouch or climb down vines</p>\n<p>left stick (up) - Interact with doors or climb up vines</p>\n<p>Menus are controlled by left stick (up) - up, left stick (down) - down, Enter input choice.</p>\n<p>Start(xbox) - pause</p>\n<p>Select(xbox) - select </p>\n<p>Left button(xbox) - view controls</p>\n<p>[Game supports other game-pads, use your brand of game-pad's equivalent to xbox's to play with those brands.]</p>", "metacritic": null, "released": "2018-05-11", "tba": false, "updated": "2019-08-28T23:21:43", "background_image": "https://media.rawg.io/media/screenshots/9cb/9cb9a642576828c5391bf77adaf86c10.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 102, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ziberteck"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}