{"id": 16427, "slug": "red-johnsons-chronicles-12", "name": "Red Johnson's Chronicles - 1+2", "name_original": "Red Johnson's Chronicles - 1+2", "description": "<strong>Steam Exclusive Offer - 2 Games in 1! </strong><br/>Enjoy both <strong>Red Johnson's Chronicles</strong> and <strong>Red Johnson's Chronicles: One Against All</strong> in one exclusive pack!Red Johnson's Chronicles<br/><strong>Try to stay alive… at least long enough to finish this investigation!</strong><br/><br/>You play the role of Red Johnson, a private detective who is trying to find his place in the corrupted city of Metropolis. You are taken on by the police who want you to solve a murder with no corpse.<br/>Discover Metropolis, its unique atmosphere and get to know the rules quickly if you want to survive! It's up to you to look for clues, interrogate the witnesses and put the evidence together in order to find the perpetrator.You'll also have to use your logic to solve the different enigmas, and occasionally, you'll have to use your fists.<br/><br/><ul><li>Solve various puzzles to advance through the game<br/></li><li>Analyze the clues and use your logic to complete your investigation successfully<br/></li><li>Know the right way to speak to witnesses and sort out the truth from the lies<br/></li><li>An adventure game in a brutal world where you'll need to learn how to fight </li></ul><strong>Red Johnson's Chronicles: One Against All</strong><br/><strong>Darker, more complex, but especially more personal!</strong><br/><br/>Red Johnson is a private detective who knows how to make himself popular. When you solved your last case, you got the Mafia's attention… and they put a contract out on you. Your new friends are going to do everything they can to find you!<br/>While you are trying to keep your head down in the role of Red, you learn that your brother has vanished when you receive a finger as proof that he is still alive. If you want to find your brother in one piece, you'll have to go looking for him and lead the investigation into his disappearance.<br/>Solve various enigmas, interrogate the witnesses you meet and collect the clues that will help you advance the investigation and discover the truth about this kidnapping.<br/><br/><ul><li>Collect the clues that will lead you to your brother<br/></li><li>Lots of even more varied and original enigmas to solve <br/></li><li>Tough characters in a dark world<br/></li><li>Carefully constructed dialogues with a touch of humor</li></ul>", "metacritic": null, "released": "2014-09-05", "tba": false, "updated": "2023-05-01T14:07:20", "background_image": "https://media.rawg.io/media/screenshots/6e5/6e5ad128cfa106a788a94064b0fab228.jpg", "website": "http://www.microids.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 4, "owned": 158, "dropped": 1}, "playtime": 1, "achievements_count": 12, "ratings_count": 3, "suggestions_count": 577, "game_series_count": 2, "reviews_count": 3, "platforms": ["PC"], "developers": ["Lexis Numérique"], "genres": ["Action", "Adventure"], "publishers": [], "esrb_rating": null}