{"id": 1643, "slug": "darklings", "name": "Darklings", "name_original": "Darklings", "description": "Editor's Choice - Develop Brighton<br/>4th game of the year - SlideDB <br/>Indie Prize Awards Best Art Finalist - Casual Connect <br/>Best Action Game Nominee - BestAppEver <br/>Most Innovative Game Nominee - PocketGamer Awards <br/>Game of the Year Nominee - Gaming Illustrated<br/><br/>\"An astoundingly innovative &amp; gorgeous game!\" -Appoday<br/>\"An extraordinarily unique and exciting game with a thrilling concept\" - 148Apps (4.5/5)<br/>\"A fun and clever action game, Darklings shows how much can be accomplished with a touchscreen control system\" - PocketGamer Silver Award (8/10)<br/>\"Darklings is a fun and creative little game that uses its darkly cute atmosphere to great effect\" - SlideToPlay (4/4 Must Have)<br/>\"Unique adventure game that is driven entirely by gestures.\"- AppAdvice (5/5) ( Game Of The Week ) <br/>\"Boasting a minimalistic design style and simple controls, Darklings is a delightful affair that pulls you in further each time you play.\" - MacLife (4.5/5)<br/><br/>Darklings stole all the stars from the world which is an essence of light and brought Darkness. Join Lum to purge the Darklings. Experience unique gesture driven gameplay blended with awesome noire artwork carrying the touch based games to a whole new level.  Save the stars, save the world.  Darkness is coming!.<br/><br/>Darklings is an epic endless adventure through magical worlds. Lum, face of light, tries to save the world by purging the darklings and retrieve the stars. Play as the face of light, Lum, only piece of hope left on the universe, and purge all the Darklings to their pits, and begin to save the world!..<br/><br/>Available only on iOS.<br/><br/>GAME FEATURES<br/><br/>* Unique Gesture Driven Gameplay<br/>  - Addictive, fun and natural gameplay like you never seen before,<br/>  - Draw the shapes on creatures to possess and kill them.<br/>  - No D-Pads, additional controls, just you and your fingers on the stage.<br/><br/>* Addictive, endless survival with various environments, settings<br/>  - Battle in the Dark Forest, Caverns and Floating Islands, more incoming...<br/>  - Never ending survival with a huge content, lots of different game sets.<br/><br/>* Sweet artwork<br/>   - Featured on top notch visual design websites,<br/>   - Noire artistic style, a delicate taste to your eyes.<br/><br/>* Lovely customisations,<br/>   - Customise your main character, Lum, over 10 customisations,<br/>   - Be a Monk or a Crow,<br/>   - Wizard or a Wrestler,<br/>   - Choose what you like and purge the darkness.<br/><br/>* Over 40 creatures, 3 families and counting,<br/>   - Crawlers of the Dark Forest,<br/>   - Hollows of the Caverns,<br/>   - Furies of the Floating Islands<br/>   - 3 difference families with whole different styles.<br/>   - Impressive Boss Fights,<br/>   - Epic Bossfights with different tactical strategy for each boss<br/><br/>* Breathtaking soundtracks,<br/>   - You never heard something like this unless you go to the Batman movie!!<br/><br/>* Challenging Objectives, Game Center Achievements<br/>   - Lots of objectives to reach higher scores.<br/>   - Challenging achievements for unyielding players.<br/><br/>* Supports iCloud<br/>   - Your progress will be automatically saved, you can restore from iCloud in any device any time!..<br/><br/>* Beat your friends<br/>   - HighScore based, endless adventures<br/><br/>* Sweet Chilli Sauce.<br/>   - An awesome sauce to complete the tasty Darklings recipe!..<br/><br/><br/>For best experience play with iPad2, iPad Mini, iPhone 5, iPod5th Gen or newer generations.<br/>iPhone4 and iPod4th Gen can get laggy while playing.<br/><br/>Follow Us<br/>Facebook : http://facebook.com/darklingsgame<br/>Twitter : http://twitter.com/MildManiaStudio<br/>WebPage : http://mildmania.com<br/>Have Fun!!", "metacritic": null, "released": "2013-11-27", "tba": false, "updated": "2019-10-22T14:27:47", "background_image": "https://media.rawg.io/media/screenshots/5de/5de085d1976bff652690614ae7c1d763.jpg", "website": "http://mildmania.com/darklings/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3, "beaten": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 211, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["MildMania"], "genres": ["Action", "Arcade", "Casual"], "publishers": ["MILDMANIA OYUN BILISIM LTD STI"], "esrb_rating": null}