{"id": 164489, "slug": "gospel-of-the-land-cleared-by-fire", "name": "Gospel of the Land Cleared by Fire", "name_original": "Gospel of the Land Cleared by Fire", "description": "<p>Ever since the beginning of the first age of memory there have been three types of creatures.                                                                                                                                                                 The Humans the only creatures who posses sentience, souls, and Magic, Gods power in the hands of man.                                                                                                                                Animals, creatures that only follow their instincts.                                                                          And Monsters cruel perversions of life who exist only to destroy and who posses a twisted and dark form of the Magic possessed by Humans...</p>\n<p>At least that is what Humanity honestly believed... Until the year 2064 of the First Age, when a young man named Gospel hailing from a small island near the Calamity Storm, a never-ending storm that surrounds the edge of the planet, claimed that Monsters possessed sentience as well as Humans, and were able to think, feel, and even learn Human language, his claims created a great unrest, and so the five greatest Kings of the time confronted him and offered him tremendous wealth if he'd admit it was a lie and move somewhere far away... He refused them, so the Kings sent an army to kill him, but the Monsters and some of the Humans who believed in him rose up to try and protect him and a war broke out, during all the fighting a great hero rose up from among the Humans and seemingly killed Gospel in what became one of the last battles of the war... Now in the wake of that war, a young mage who believes he's lost everything and everyone he cared about finds himself  suddenly reunited with  his Wife and  blackmailed by someone who's discovered a secret from his past.</p>", "metacritic": null, "released": "2017-11-04", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/85b/85b1ec3cab163bfdd36aba93427053d3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 37, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["TriceratopsX"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}