{"id": 16455, "slug": "nyxquest-kindred-spirits", "name": "NyxQuest: Kindred Spirits", "name_original": "NyxQuest: Kindred Spirits", "description": "Fly with Nyx across the ruins of the ancient Greece in her dangerous search for her dearest friend Icarus. Use the powers of Zeus and the Gods from Olympus and use them wisely in order to help Nyx to complete her epic adventure.<br/>\t\t\t\t\t\tCast rays, command the winds, control the fire, fight the Hydra, surf the blazing sands and modify the environment as you have never experienced before.<br/>\t\t\t\t\t\tKey Features\t\t\t\t\t\t<ul><li>Innovative and unique gameplay. You will be able to invoke the powers of the gods for interacting with the environment as you have never done before.<br/> </li><li>12 challenging levels, carefully designed, completely filled with puzzles, beautiful scenarios and action.<br/> </li><li>Real physics based puzzles and interactive scenery.<br/> </li><li>Play against the clock. Try to beat the best times from the developers and get all the Steam Achievements!<br/> </li><li>Stunning graphics specially enhanced for the computer version. Impressive visual effects such as bloom, depth of field and heat distortion.<br/> </li><li>Find your way to the Arcadia, the secret bonus level.<br/> </li><li>20 ancient relics hidden by the Gods to be found within the levels.<br/> </li><li>A fascinating story. Will you be able to help Nyx discover what happened to her friend Icarus?<br/> </li><li>Beautiful soundtrack composed by film composer Steven Gutheinz.<br/> </li></ul>", "metacritic": null, "released": "2009-08-10", "tba": false, "updated": "2023-01-30T16:17:40", "background_image": "https://media.rawg.io/media/screenshots/348/348f5189a5b260e1c1c42d1c0311ca1e.jpg", "website": "http://www.nyxquest.com", "rating": 2.9, "rating_top": 3, "added_by_status": {"yet": 7, "owned": 124, "beaten": 4, "toplay": 2, "dropped": 5}, "playtime": 1, "achievements_count": 20, "ratings_count": 9, "suggestions_count": 345, "game_series_count": 0, "reviews_count": 10, "platforms": ["Wii", "PC", "macOS"], "developers": ["Over the Top Games"], "genres": ["Action", "Adventure"], "publishers": ["Over The Top Games"], "esrb_rating": null}