{"id": 16454, "slug": "sniper-elite-nazi-zombie-army-2", "name": "Sniper Elite: Nazi Zombie Army 2", "name_original": "Sniper Elite: Nazi Zombie Army 2", "description": "<p><strong> Please note: a remastered and improved edition of this game is now available in Zombie Army Trilogy.</strong><br />\nExperience a terrifyingly intense co-op campaign for up to four players in this gut-wrenching sequel to Steam best-seller, Sniper Elite: Nazi Zombie Army.<br />\nWith World War 2 Europe overrun by legions of the undead, you must find mankind’s salvation deep in the twisted bowels of Berlin by securing the sacred artefacts that unleashed this damnation. Every step must be paid in blood as players work together against impossible odds and descend further into the demon-infested city and the terrifying Führerbunker itself.<br />\nTackle the campaign online in co-op for up to four players, or embark on the twisted missions alone if you’ve got the bottle.<br />\nFeaturing new enemies, new environments, blood curdling surprises and the return of the infamous X-ray kill cam, Sniper Elite: Nazi Zombie Army 2 will satisfy even the most bloodthirsty of zombie hunters.Key Features<br />\nNew campaign. New terrors<br />\nSurvive an all new stand-alone campaign for up to four players.<br />\nEndure increasingly hellish new locations and oppressive environments.<br />\nConfront blood-chilling new enemies including the Fire Demon, and Summoner.<br />\nNerve-shredding third-person combat<br />\nExperience the trademark sniping, blood-pumping sieges and co-op team play that made the original Nazi Zombie Army a Steam best-seller.<br />\nRevel in the return of the infamous X-ray kill cam as your bullets purify the putrid insides of the undead in slow motion.<br />\nDefy the odds and survive against overwhelming hordes with traps, explosives and powerful new machine-gun turrets.<br />\nMore thrills. More blood spilled<br />\nRecoil at grotesque new enemies, effects and tense new cinematics.<br />\nSavour the all-new Carpenter-esque soundtrack inspired by slasher-horror cinema.NotesThis is a stand alone game. It does not require Sniper Elite V2 or Sniper Elite: Nazi Zombie Army to play!<br />\nSteam keys will not activate in Germany</p>", "metacritic": 53, "released": "2013-10-30", "tba": false, "updated": "2024-03-13T20:30:08", "background_image": "https://media.rawg.io/media/games/0d0/0d0d6363d25e0c1d5bf0cb372c00396b.jpg", "website": "http://www.rebellion.co.uk/nza2", "rating": 3.2, "rating_top": 3, "added_by_status": {"yet": 12, "owned": 523, "beaten": 31, "toplay": 8, "dropped": 16}, "playtime": 4, "achievements_count": 36, "ratings_count": 49, "suggestions_count": 608, "game_series_count": 3, "reviews_count": 49, "platforms": ["PC"], "developers": [], "genres": ["Action", "Adventure"], "publishers": ["Rebellion"], "esrb_rating": null}