{"id": 164681, "slug": "skycastles-over-atlantis", "name": "Skycastles over Atlantis", "name_original": "Skycastles over Atlantis", "description": "<p>For just the release information, scroll over down below past all the rambling.</p><p><strong>RAMBLING</strong></p><p>I almost did not participate in this game jam, I wasted the whole of September doing who knows what, and I even missed Epic's game jam in early October.  So all in all the total development time would be around 22 days.  But I prefer  smaller jams since they're not overcrowded with games, leaving some with zero players invested in them.</p><p> I had to do this since I was able to force myself to learn quickly to implement the core functionality for this other 3D anime RPG game I am working on.</p><p>This game though doesn't have any RPG elements, just a rudimentary battle system (if you can even call it that), nor 2D event scenes, but at least I know now how to put a long game together instead of test levels.</p><p>In the beginning I wasn't sure what sort of theme to do so I just winged it and got out all my parts bins, from the asset store stuff to the old Unity projects and anything I had on hand.  Ironically this means this is probably the cheapest game yet, essentially zero cost to me since everything is either royalty free or bought and paid for already.  It's the 2D graphics of my ongoing projects which are consuming most of my resources nowadays.  This one is just a sloppily-put-together game so it can make do with scribbles.</p><p>Hopefully Mixamo will still remain in its promo period since I was able to dig through all the free mocap.  The problem is that I was only able to reuse a few and they're limited to humanoids, so not sure what to do with more interesting creatures.</p><p>Another problem is that UE4 is extremely finicky with models, if the UV has even a small overlapping problem into the trash it goes.  But the good thing is that I can tweak and reassign the materials so they will be unified.  That's why I don't go for stylized look since you would not have enough asset store stuff to add to your parts bin, just go for the conventional texture and you can adjust the material properties later.</p><p>This is only my second UE4 release so hopefully it doesn't suck too much.</p><p>Also many many thanks to whomever convinced the organizers to extend the deadline by a week!<br/></p><p><strong>KNOWN ISSUES</strong><br/></p><p>I tested using a Playstation Dualshock 3 using the SCP driver (for some reason Motioninjoy didn't work for me so couldn't recommend it), so I can only recall gamepad commands using Playstation symbols, if you have an Xbox controller or general Windows gamepad it should work right out of the box and refer to the equivalent mappings.  I only used the two analog sticks and the right face buttons anyway.<br/></p><p>You will still need a mouse since for some reason the dialogue engine I'm using has broken gamepad support in UE4 4.9, so you will need to use conventional mouse button clicks for those.</p><p>Climbing animations are borked. Will not fix since the root motion of the mocap is hard to guess.<br/></p><p>I also don't know if it's something in the code but the gameplay bogs down after extended playtime, good thing I made the levels really small.</p><p>If you have a toaster or bad laptop with built-in graphics I probably won't need to tell you this game won't run, but a decent PC can be built for less than an iPad, just get an i3 with an Nvidia GTX series card and you're set.</p><p><strong><strong><em>Controls:  WASD and mouse to move (or two gamepad analog sticks)</em></strong></strong></p><p><strong><strong><em>Left-click: Attack/Interact (or Square and Triangle buttons respectively)</em></strong></strong></p><p><strong><strong><em>Right-click: Block/Climb [depends on character] (or Circle button)</em></strong></strong></p><p><strong><strong><em>Space-bar: Jump (or X button)</em></strong></strong></p><p><strong><strong><em>P:  Pause with option to quit (no gamepad mapped)</em></strong></strong></p><p><strong><strong><em>Conversation boxes use Left-click only</em></strong></strong></p><p><strong><strong><strong>RELEASE</strong></strong></strong></p><p>IMPORTANT:  The path to launch is this one:</p><p><strong>SkycastlesOverAtlantis\\Story\\Binaries\\Win64</strong><strong>\\Story.exe</strong></p><p>Because the executable right inside the folder gives error \"<em>Couldn't start:{path} CreateProcess() returned 2.</em>\"  The only solutions I've seen in forums is the workaround mentioned above.</p><p>You may or may not need to run SkycastlesOverAtlantis\\Engine\\Extras\\Redist\\en-us\\UE4PrereqSetup_x64.exe, depends if you've been running lots of games or dev setup on your computer already.</p><p>Game uses Auto-save (there used to be indicator in Debug mode oh well) basically in certain levels you just walk through the flashing blue cones and after quitting you can continue from that level.<br/></p><p>You've reached the end of the game if you have completed the apple quest.  I'm sorry that's it, not much combat, not much story really.  If I put more text to explain things I'll have to make more levels, this is only something to flex my muscles so I can get cracking on making 3D anime JRPGs with better graphics and H-scenes.</p><p>CREDITS:</p><p>Too many to list, if you need to know the source of something I'll gladly tell you.  Once again this is all from my parts bins, which consists of asset store stuff and old failed projects.  Rest assured I have commissioned/paid/licensed all the items or they're royalty-free.<br/></p>", "metacritic": null, "released": "2015-10-29", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/0a3/0a32c74c52673db83374fc4e1c2702c7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 224, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["gdidoujins"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}