{"id": 164942, "slug": "hotwriting", "name": "Hotwriting", "name_original": "Hotwriting", "description": "<p><strong><strong>A book of playable poems by Todd Anderson, published by Instar Books</strong><br/></strong></p><p>\"I would describe Hotwriting as a collection of short computer games and interactive films built out of poetry. Even as you influence and control the pieces yourself, Anderson's personality and voice shine through. It's playful, at times genuinely moving, and an exciting reminder of the endless possibilities for new media literature and for art-making in general.\" <br/>    —<strong>Steve Roggenbuck</strong>, YouTube poet and author of IF U DONT LOVE THE MOON YOUR AN ASS HOLE</p><p>FROM THE PUBLISHER:</p><p>\r\n\tTodd Anderson, impresario of Manhattan's digital art performance WordHack, creates poetic experiences using Javascript, sound design, and a wireless USB keyboard that he wears around his neck. He calls this \"hotwriting.\" And here in this collection that erases the line between book, instrument, and game (as well as between author and audience), Anderson presents the first collection of hotwriting pieces, curated experiments in language, form, interactivity, and multimedia synaesthesia.\r\n</p><p>\r\n\t\tEarworm loops of popular music combine with Steve Ballmer screams, with VCR apotheosis, with investigations into the interplay between alchemy and Dungeons and Dragons mechanics. This is human connection in a repressive regime, this is Lyndon Johnson's 1948 Senate race, this is the struggle to remain vulnerable to beauty in an increasingly cluttered media world. The reader is invited to rewind, erase, distort, and to dismantle each of these sentiments and narratives, or simply to experience them as they proceed.\r\n</p><p>\r\n\t\tThe reader is invited to make a bear explode.\r\n</p><p>\r\n\t\tThis collection is an executable file that plays the digital code poems, in addition to mundane texts, now to be forever known as \"coldwriting.\"\r\n</p><p>\r\n\t\tAlso included in this collection is a set of full instructions for remixing the included text, as well as instructions for the reader to create and disseminate her own Hotwritten experiments.\r\n</p><p>---</p><p>MORE THINGS PEOPLE ARE SAYING: </p><p>\"Hotwriting provides the definitive answer to Agent Smith's question \"But how can you communicate multimedia performances to an audience, Mr. Anderson, if you cannot speak?\" This ebook gives new access to Todd Anderson's compelling digital writing, hilarious as well as hot writing which was originally developed for live presentation. The software remaps the reader's keyboard to produce phrases, sound, and graphics, letting the reader play these texts as Anderson does.\"<br/>          —<strong>Nick Montfort</strong>, author of Ten Mobile Texts and Racing the Beam <br/></p><p>\"A blue sign on the walls of spring.\" <br/>                                                   —<strong>Ross Goodwin</strong>'s neural network </p>", "metacritic": null, "released": "2016-11-28", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/7ab/7ab29f5ddd48b5f49b341e7125cbd9ab.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 87, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Todd Anderson"], "genres": [], "publishers": [], "esrb_rating": null}