{"id": 165217, "slug": "bee-vs-other-bee", "name": "Bee Vs Other Bee", "name_original": "Bee Vs Other Bee", "description": "<p>For the 2013 WTF Game Jam website, I asked Travis to make some placeholder fake games for our games page, so it wouldn't be blank before the jam itself. He made up some great absurd concepts and by the time 2014 rolled around, we were still laughing at Bee Vs Other Bee. So we decided to make it ¯\\_(ツ)_/¯<br/></p>\n<p>All we had to go on was the title &amp; the piece of key art which is now the title screen, seen above. The rest, which admittedly isn't much, mostly came out of us trying to get the other person to laugh during the 2014 WTF Game Jam.</p>\n<p>You cannot actually fight the other bee. You just harmlessly bounce off each other. Combat never actually got implemented before the jam ended.</p>\n<p>The intent was for it to be a reverse fighting game. You'd be trying to goad/trick/whatever the other bee into stinging you. You'd lose 10% of your health and then after a few seconds, the other bee would die.</p>\n<p>This fit with honey bees in general, but I also found it funny to make a fighting game where your goal is to not hit the other player and get them to hit you.</p>\n<p>Caution for younger bees: This game totally contains cursing, because we left our placeholder audio files in. Sorry about that.<br/></p>\r\nControls\r\n<p>Bee One: W to thrust, A &amp; D to rotate, S to go in reverse<br/>Bee Two: Up Arrow to thrust, Left &amp; Right to rotate, Down to go in reverse</p>\r\nCredits\r\n<p>Art, Sound, &amp; Concept by Travis Fishbein<br/>Code &amp; Voice Acting by Andrew Ferguson<br/>Music by Mike Levens<br/>Voice Acting by Michael Cawston-Stewart</p>", "metacritic": null, "released": "2018-01-27", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/655/655fdb369cad590a55a4eb6706249d20.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 33, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Andrew Ferguson"], "genres": ["Fighting"], "publishers": [], "esrb_rating": null}