{"id": 165210, "slug": "crossyrift", "name": "CrossyRift", "name_original": "CrossyRift", "description": "CrossyRift<p><strong>CrossyRift</strong> started as a school project made by a group of 6 people in 10 weeks. It dreams to be the Crossy Road for pc, featuring VR support, a completely custom made art style, and much more to come. <em><strong>It's not just crossyroad, it's only based on the concept.</strong></em></p><p><em>CrossyRift is build in the Unreal engine, so we don't have to worry about any power needed for development.</em></p><p>The ongoing development of the game is not specified yet, but we'll let you know as soon as we know :)</p>Let us know what you think, what you would like to see, what you don't like at all, the bugs, EVERYTHING. Trust me, we need it.Some Important Stuff<br/><ul><li><strong>CROSSYRIFT IS NOT FINISHED! </strong>You will encounter bugs, game crashes and some unexpected stuff. The game does not have any finished form of gameplay, but we're working on it. Meanwhile, just hop around a bit and have fun, that's the most important.</li></ul>Controls<p>-Use the <strong>mouse</strong> or your <strong>oculus rift</strong> to look around, and press<strong> W </strong>to move in that direction. You are tied to a grid, so moving diagonally is not possible.</p><p>-Press <strong>P</strong> to go to the main menu. <strong>WARNING: </strong>there is no pauze feature yet, so you will lose your score.</p><p>-Press <strong>Q</strong> to quit the game.</p><p>EDIT:</p><p>As of 20-2-2016, the development of crossyrift has been paused. This because I am working on a new project which I hope to release a demo of shortly.</p><p>Thanks to al the supporters of this game. I love you guys!</p>", "metacritic": null, "released": "2015-11-20", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/37c/37c352ecd43a6fbaa5014a534305243e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 92, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Bram Korsten"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}