{"id": 165357, "slug": "killer-vs-killer", "name": "Killer Vs Killer", "name_original": "Killer Vs Killer", "description": "<p>Desafie seus amigos neste jogo mortal de raciocínio e estratégia!</p>\n<p>Se situe no tabuleiro, descubra quem é o seu verdadeiro alvo e lute para ser o primeiro a pegar uma das poucas balas disponíveis. Você só tem uma chance de disparar sua arma antes de assustar a multidão e o seu alvo fugir, então seja cauteloso.</p>\n<p>Controles:<br/>- Um jogador será o número 0 e o outro o número 1.<br/>- Use as setas do teclado para andar uma casa por vez. Se duas teclas de movimentação forem pressionadas na mesma vez, apenas a última entrada será considerado;<br/>- Após declarar sua movimentação, aperte o Enter para terminar a sua jogada no turno;<br/>- Para pegar uma bala, você deve se mexer até a casa da mesma;<br/>- Para atirar a bala, aperte espaço e depois declare em qual direção o disparo será feito.<br/></p>\n<p>---------------------<br/></p>\n<p>Take on your friends in this tactical, deadly cat-n'-mouse game!</p>\n<p>Find yourself on the board, figure out who your target really is and and race it to one of the bullets. You only got one shot before everybody scatters, chaos settles in and your chances at taking your target are lost, so be careful.</p><p>Controls:<br/>- One player shall be Player 0, the other one shall be Player 1;<br/>- Use the arrow keys to walk, one spot per turn. If two or more arrow keys are pressed on the same turn, only the last input shall be read;<br/>- After declaring your move, use Enter to finish your turn;<br/>- In order to grab a bullet, you must walk to it and land on its spot;<br/>- In order to shoot your shot, press the SPACEBAR and then declare in which direction the shot will be shot.<br/></p>\n<p>---------------------</p>\n<p>Game Designer:  Gabriel Raposo</p>\n<p>Programadores: Gabriel Raposo, Pedro Nascimento<br/></p>\n<p>Artistas: Gabriel Raposo, Horácio Macêdo<br/></p>", "metacritic": null, "released": "2018-03-11", "tba": false, "updated": "2019-08-28T23:21:42", "background_image": "https://media.rawg.io/media/screenshots/5f4/5f43f8b0553c3faddf80f6790119b8d1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 22, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Game Dev. Project"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}