{"id": 165388, "slug": "ultimate-football-soccer-2018", "name": "Ultimate Football Soccer 2018", "name_original": "Ultimate Football Soccer 2018", "description": "Ultimate Football Soccer\r\nGAME INFO:\r\n<p>Ultimate Football Soccer is REALISTIC, IMMERSIVE, ADDICTIVE. Ultimate Football – Soccer offers the purest football to their fun with fast paced game-play, most realistic physics, astonishing atmosphere and tons of replay value!</p>\n<p>Build the best squad on the planet and lead them all the way to win the league of champions or world cup Ultimate football soccer is definitive the best mobile football simulation, featuring simple controls, smooth animations and insane actions.</p>\n<p><strong>The game </strong>offers the purest football for the real fans of <strong>soccer games</strong> for free. With fun &amp; fast paced game-play, most realistic physics, astonishing atmosphere and tons of replay value, you will have hard time turning off this free soccer game for Android.</p>\n<p>Build the best squad on the planet and lead them all the way to win the league of champions or world cup. Be the player of the season and champion of this football galaxy. </p>\n<p><strong>TRUE COMPETITIVENESS</strong><br/>With simple game-play and great physics, ultimate football – soccer offers the purest football for the real fans of <strong>soccer games</strong> for free.</p>\n<p>With fun &amp; fast paced game-play, most realistic physics, astonishing atmosphere and tons of replay value, you will have hard ti is easy to pick up and fun to play! In true competitive style, challenge your opponents all over the world for online table soccer matches!</p>\r\nMORE <strong>TRUE COMPETITIVENESS</strong>\n<p>You can also customize your Ultimate Football – Soccer dream hero experience by collecting the different teams! Show off your style and score! and defend your nation’s star colors! Do you have what it takes to become the best in one of the all-time best cool soccer games for android.</p>\n<p><strong>PLAY SOCCER GAME ONLINE</strong><br/>Compete in different tiers, from different countries!</p>\n<p>Play online against people from all over the world or against your friends and be a star! Login with your Facebook account and challenge your friends to show them what it means to be a Soccer Legend and take the cup home! Oh, and you can also play offline against a friend in the same device!</p>\r\nFEATURES\r\n<p>– Simple to play, tough to master addiction.<br/>– Win awards, win trophies, score goals, change clubs, represent your country and go for glory!<br/>– New Score! Engine that allows more freedom and strategic play than ever before!<br/>– Intelligent AI adapts to your passes, and shots making each play through different<br/>– Connect with Facebook to compete against your closest friends!<br/>– Stunning 3D graphics, cut scenes and animations<br/>– Customize your Hero player for a unique look and feel<br/>– Google Play achievements &amp; leader-boards to see who ranks on top!<br/>– Sync progress between devices with Google Play Cloud!<br/>– Engaging Story charting your rise from an aspiring teen to a player making it big!</p>\n<p>For more games and free downloads go to this LINK</p>", "metacritic": null, "released": "2018-06-15", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/7f3/7f3468ad26ffe18e5cae7260d0a7b3f1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 126, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["carlosvega2607"], "genres": ["Sports"], "publishers": [], "esrb_rating": null}