{"id": 165463, "slug": "skatefevr", "name": "SkatefeVR", "name_original": "SkatefeVR", "description": "<p>As I was cleaning up my attic I discovered the old Wii (R) Fit Balance Board and thought about how awesome this would be as an input device for Virtual Reality Locomotion.  I imagined that instead of teleporting you would simply enter your vehicle and lean your body to control it. For many RPGs you use your horse or something comparable to reach places, so why not have something comparable being controlled with your weight?</p>\n<p>So now is the time for you to clean up your attics/search for the board and to put on your VR HMDs to enjoy a new level of immersion (and probably nausea ;))<br/></p>\n<p>If you try out the game, please make sure you also provide some feedback on this project's forums, because I am curious how other people perceive this input method. I do not want comments on how this is no fun or the graphics cannot compare to Half-Life 3, because please understand that it's not meant to be a consumer game.</p>\n<p>Even though it's best consumed using a Virtual Reality Headset (Only the HTC Vive is supported currently), the game should also run flawless without any headset connected, it just won't feel as immersive ;)</p>\n<p>Be advised that this prototype has a minimum price of 0$, but any cent will go into the development of my unannounced main title and probably into other prototypes, If I get other ideas like these. Or Alcohol. No, just kidding :P<br/></p>\n<p><strong>Note: </strong>This is only a prototype to judge how well using a Wii (R) Fit Board works as an input device for immersive VR Gameplay. As such the game is a really technical demo, doesn't look polished and you might experience bugs. This is the reason why the game is released for free and why the community is welcomed to mod additional levels into the game.</p><p><strong>Warning:</strong> Due to a bug in the Microsoft Bluetooth Stack it could be possible that the Board does not communicate with lower Versions than Windows 10<br/></p>", "metacritic": null, "released": "2017-07-01", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/77d/77ddb97ac1bb713fd31b1227d3438339.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 28, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Darkigames"], "genres": ["Sports", "Racing"], "publishers": [], "esrb_rating": null}