{"id": 165439, "slug": "fragmented-space", "name": "Fragmented Space", "name_original": "Fragmented Space", "description": "<p>Fragmented Space is a 4X Persistent MMO with player hosted servers and accommodates a wide variety of play styles by exposing internal variables to server hosts, with an end game goal.<br/></p>\n<ul><li>At the start of each new Era a new galaxy is procedurally generated.</li><li>3 Resources: Minerals, Energy &amp; Population.</li><li>Resources are only produced by Sectors and a static starting amount of resources.</li><li>The end goal is to conquer the 10 \"Titan Sectors\" , once a federation conquers all 10 and holds them for 50 ticks, they will be declared the winner of the Era(round) and a new Era will start.</li><li>Based on a Tick system, where X amount of minutes = 1 Tick(Turn).</li><li>Conquer other players and earn a percentage of their income.</li><li>Servers can be hosted by players on dedicated servers, servers allow players to heavily change internal variables which allows for a wide variety of play styles.</li><li>Unit cost is scaled to your current amount of recruited units.</li><li>Units are automatically placed into fleets and can only be recruited from your own station.</li><li>Build outposts and upgrade them to teleportation gates, this allows quick navigation across the galaxy.</li><li>Basic mechanics with an emphasis on social aspects.</li><li>&amp; much more more, for a detailed overview please visit the guide</li></ul>\n<p>Players will be able to host their own game servers, this opens up a vast amount of possibilities where the core game play can be changed via modifying some of the variables.<br/><br/>The game works with a tick based system, every X amount of minutes, a tick passes and all player actions are processed, players will conquer other players, defend their allies, decimate their enemies, accumulate resources, backstab their former allies, etc,.<br/><br/><br/>Want a slow Era(\"round\") ? Change the amount of time a tick takes to 1 day.<br/>Want a fast era ? Change the amount of time a tick takes to 30 seconds.<br/>Want to limit the number of federations? Change the federation limit to 2.<br/>Want to set the maximum amount of members in a federation? Change the member limit to 1,000<br/>Want to change the amount of resources generated by Sectors? Change the minimum/maximum limits<br/><br/>At the start of each new Era(\"round\"), a new galaxy/map is procedurally generated, at the start only sectors will be on the map, sectors generate Y amount of Resources for their owner, the only other method to currently increase your own resource generation per Tick is too conquer another player and receive a % of their own resource generation every tick.<br/><br/>10 Sectors will randomly be chosen to be the Titan sectors, the federation which takes control of all 10 sectors and manages to keep control of them for 50 ticks will be declared the winners of the Era, this will end the current Era and start a new one.<br/><br/>Players can recruit 3 different ships which make up fleets, these are:<br/>Corvettes, Destroyers and Battleships, it takes time to recruit ships and the cost to recruit these ships increases as your amount of units increases, this creates balance for long term games where new players can easily join in on the fun.<br/><br/>Corvettes do more damage to Battleships and less damage to Destroyers.<br/>Destroyers do more damage to Corvettes and less to Battleships.<br/>Battleships do more damage to Destroyers and less to Corvettes.<br/><br/>Fleets have 2 options to get around the galaxy, they can move to the target manually, which takes a longer time but is free, or the Fleets can be teleported via Gates to other gates/friendly stations.<br/><br/>Fleets will not be able to teleport to non-federation members gates or player stations, but the player can still use nearby gates to the enemy in order to shorten the amount of time to attack, or better yet, just take over the enemy's gate network.<br/><br/>Gates are built via upgrading outposts, which are placed by the player for a resource cost, upgrading outposts is not instant and takes time.<br/><br/>Diplomacy takes place via messaging the other Federation and taking notes of your agreements in order to remember them ( you don't have too  ).<br/><br/>The end goal is to support as many players as possible(minimum 1000), at the end of the day server hosts can decide to have as many players on their server as they want.<br/><br/>The game currently has the basic systems in place, but the social interaction coupled with the basic systems can make for some great fun, especially since there is an end goal in place and your time commitment can either be Long term or short term, just join the server which suits your taste.</p>\n\n<p>The demo of the game can be played at my website for free, the limitation is that the demo is playable in the browser only, by buying the game, you:</p>\n<ul><li>Will be able to download the Standalone player for windows.</li><li>Show your interest in the game.</li><li>Get the game at a reduced price.</li><li>Support me financially.</li></ul>\n\n<p>Fragmented space has been in development for 4+ years by me alone, any feedback/ideas/criticism is welcomed and appreciated. The game will be buy to play with no in game microtransactions.</p>", "metacritic": null, "released": "2018-05-15", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/312/31272e8693d1fea189988db4e37dd435.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 70, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["104105"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}