{"id": 165603, "slug": "gift-grab-christmas-quandary", "name": "Gift Grab: Christmas Quandary", "name_original": "Gift Grab: Christmas Quandary", "description": "<p>Ho Ho Oh No! Its a Christmas Quandry and Santa's Christmas Elves are here to save the day in a brand new Christmas game for kids from the good folks at Moosader.</p>\n<p>Christmas time is here and Santas off to deliver gifts and presents to all the good little boys and the good little girls across the world. However, there were SO MANY presents this year that Santa accidentally overpacked his sleigh - dropping the childrens' gifts as he unwittingly soars across the sky..</p>\n<p>Play as one of Santa's loyal Christmas Elves as you chase after Santa, rescuing gifts from being destroyed or stolen by wild animals and other wild bad guys as you run, jump, and dodge through 15 levels across 3 worlds of Christmas chaos!</p>\n\n<p>FEATURES:</p>\n<p>☆ Santa's Elves stay fashionable! Earn and trade in-game points for new clothes for your elf to wear - elf attire, Christmas sweaters, penguin suit, yeti costume, peppermint dress, santa outfit, and more!</p>\n<p>★ Elf Yourself! Customize your elf's hair and skin color to match your own - or create a new elf from your own imagination!</p>\n<p>☆ Race across the North Pole, speed through the Snowy Village, and soar across the Night Sky in 15 levels and 3 worlds!</p>\n<p>★ Fun for Everyone! Difficulty level increases as you progress, with easy-to-learn controls and challenges that will keep gamers of all skill levels entertained.</p>\n<p>☆ Avoid angry snowmen, sliding penguins, sleepy reindeer, flying pigs, and more!</p>\n<p>★ Collect gingerbread treats for powering up!</p>\n<p>☆ Play in English, Spanish, or Esperanto!</p>\n<p>Questions or comments? Email Rachel@Moosader.com !<br/><br/>FOLLOW US!<br/>https://www.facebook.com/Moosader/<br/>https://twitter.com/moosader</p>\n<p>Listen to the game's soundtrack here!</p>\n<p>Kristnaska tago alvenos! Donaca dilemo okazis kaj la kristnaskaj elfoj devas serĉi por la perditaj donacoj! Santa bezonas vian helpon!<br/></p><p>Kuru kaj saltu, dum via veturo tra la Nordpolo! Ludu en 3 mondoj kaj 15 niveloj, kaj savu kristnaskan tagon!</p>\n<p>En la vendejo, vi povas aĉeti novajn vestojn per viaj (en-ludaj) poentoj! Ŝanĝu vian hararon kaj haŭtkoloro ankaŭ!</p>\n<p>Ludu facilajn nivelojn kaj malfacilajn nivelojn, en ĉiu mondo!<br/><br/>Evitu kolerajn neĝhomojn, ludantajn pingvenojn, kaj pliajn 'malamikojn'!<br/><br/>Uzeblaj lingvoj: Esperanto, la Angla, kaj la Hispana!</p>", "metacritic": null, "released": "2015-11-07", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/112/1128c22e2181194d82c92dfaf8e2e74e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 103, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Moosader"], "genres": ["Action"], "publishers": [], "esrb_rating": null}