{"id": 165691, "slug": "2048-kingdoms", "name": "2048 Kingdoms", "name_original": "2048 Kingdoms", "description": "<p>Greetings Sire,<br/> <br/>Your sword has been sharpened, your horse is ready and your knights are prepared for battle. There's no time to lose, we have to defend our castle from the invaders.<br/> <br/>These are dangerous times, our efforts must be doubled. Luckly we are in the possesion of a few rare artifacts which might be able to turn the tides of battle. Krapoo's Shield is rumored to have magical powers and Radoi's Sword was wielded by some of the best warriors in this land.<br/> <br/>The war horn boomed and in a few moments we will face our enemies. We cannot let them win! To battle!<br/> <br/>Choose <strong>War Mode</strong> if you want to face a limited amount of time given to prepare for war. Seven different factions will try to conquer your lands. You will have a few minutes to gather a great army and stand against your foes. Or you can choose <strong>Peace Mode</strong> for a relaxing game, without time limits. Take as much time as you need to build the greatest kingdom people have ever heard of. Are you a Squire or a Sire?<br/> <br/>You will be awarded medals after each battle. These are used to upgrade your soldiers. There is also a <strong>\"First win of the day\"</strong> bonus, for extra medals.<br/> <br/>★ Classic 2048 gameplay<br/>★ Isometric layout<br/>★ Two game modes<br/>★ Achievements<br/>★ Leaderboards<br/>★ First win of the day bonus<br/></p>", "metacritic": null, "released": "2016-06-07", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/3cf/3cf518b5a9426e31cb3883c5a8a79ed8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 90, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["DMike"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}