{"id": 165683, "slug": "budgeridoo-austerite-de-la-sante", "name": "Budgéridoo - Austérité de la santé", "name_original": "Budgéridoo - Austérité de la santé", "description": "<p><strong>L’ÉQUILIBRE DU BUDGET vs L’ÉQUILIBRE DE LA STRUCTURE</strong></p>\n<p>En cette période d’incertitude, de surspécialisation horizontale et de budget équilibré, on a besoin d’une nouvelle catégorie d’être humain pour gérer le nouveau Centre Hospitalier de l’Université de Métropolis.</p>\n<p>Un être capable de gérer les lits et d’assurer la stabilité de la structure même du bâtiment tout en respectant le budget alloué et les aléas qui viennent immanquablement entraver le bon fonctionnement de toute entreprise conséquente.</p>\n<p>Cette personne, c’est vous!</p>\n<p>---</p>\n<p><strong>THÈME ÉQUILIBRE :</strong></p>\n<p>Nous avons attaqué le thème par deux fronts. L’équilibre du budget influence directement l’équilibre de la structure du bâtiment car des personnages, représentant nos dirigeants ainsi que l’opinion publique, provoquent des coupures qui se traduisent par le retrait de certains morceaux de l’hôpital. Quand il faut couper, il faut couper!</p>\n\n<p><strong>COMMENT JOUER :</strong><br/></p>\n<p>Il faut construire un hôpital avec les morceaux disponibles afin d’y accueillir les nombreux patients. </p>\n<p>- Il ne doit jamais y avoir plus de 3 camions en attentes pendant plus de 5 secondes sous peine de se prendre une contravention de parking.<br/>- Un patient dans une ambulance ne doit jamais attendre plus de 5 secondes avant d’être inséré dans l’hôpital et comme dans la vraie vie, celui-ci peut se situer dans un corridor ou à l’extérieur sans problème.<br/>- Il ne faut pas échapper une poutre sur un patient et le tuer car c’est inversement proportionnel à l’objectif du système de santé.<br/>- Lors d’une coupure budgétaire, il faut retirer le nombre de morceaux demandés sans compromettre l’équilibre de la structure de l’hôpital.<br/><br/></p>\n<p><strong>BONUS :</strong></p>\n<p>- Les carrés peuvent solidifier un ensemble de poutres!</p>\n\n<p><strong>CONTRÔLES :</strong></p>\n<p>Clique gauche – Prendre un objet ou un lit avec un patient<br/>Roulette – Rotation d’un objet<br/>Clique droit – Retirer un objet (seulement lors des coupures budgétaires)</p>\n\n<p><strong>TEAM OUTERMINDS OMEGA :</strong></p>\n<p>Guiz de Pessemier – Audio / Art Caméra<br/>Tommy Gaudet – Scénario<br/>Alexandre Caron – Programmeur<br/>Dalin Son – Programmeur<br/>Marie-Claude Richer – Art</p>\n\n<p><strong>LES PHOTOS :</strong></p>\n<p>Dalin: Directeur de l'hôpital<br/>Marie-Claude: Journaliste<br/>Guiz: Douche-Meute<br/>Caron: Ministre de la Santé<br/>Tommy: Constructeur<br/>Cassie: Mairesse de Metropolis<br/>Sylvain Racine: PM Fédéral<br/>Jean-Baptiste: PM Provincial<br/>Kevin: Hippie Végétalien</p>\n\n<p><strong>LES VOIX : </strong></p>\n<p>Tommy <br/>Guiz<br/>Matthieu </p>\n\n<p><strong>L’ACCESSIBILITÉ :</strong></p>\n<p>Moteur :<br/>- Le jeu se joue avec une seule main avec une souris<br/>- Les boutons et les éléments du UI sont bien espacés</p>\n<p>Visuel :<br/>- Il y a un seul motif par type d’événement (Ambulance ou Camion de Construction)<br/>- Il y a une description audio dans toutes les étapes importantes<br/>- Les renseignements importants sont en plein centre et interrompent le jeu</p>\n<p>Cognitif :<br/>- Le jeu est presque 100% visuel et les blagues sont sous-titrées en plus de la narration<br/>- La police est très grosse et les décomptes sont clairs pour annoncer une mort possible<br/>- Il y a un tutoriel qui explique le jeu avec le directeur de l’hôpital</p>\n<p>Auditif et Verbal :<br/>- Il y a des sous-titres en français et en anglais pour 100% du jeu<br/>- Le volume de la musique est réduit lors des narrations<br/>- On voit le visage du personnage qui parle et son rôle à chaque moment</p>\n<p>#OneWebDay :<br/>- Une version browser de notre jeu est disponible.</p>\n\n<p>======================================</p>\n<p><strong>BUDGETARY BALANCE vs STRUCTURE BALANCE</strong><br/> <br/>In this period of uncertainty, overqualification and budget cut, we need a new kind of person to run the new Centre Hospitalier de l’Université de Métropolis.</p>\n<p>Someone who can manage the hospital bed and make sure that the building’s structure is stable. Meanwhile, that person still gonna have to do everything with the allowed budget and the unexpected turn of events (because when something can go wrong…). </p>\n<p>And this person is YOU !</p>\n\n<p><strong>THEME: THE BALANCE</strong></p>\n<p>In the game, the theme of balance is seen two ways; the budgetary balance and the physical balance. The balance of budgeting is translated by the building structure which is influenced by our leader and the public opinion. Sometimes, they have complains or requests and we have to adjust, which means we have to withdraw some pieces due to the cut in the budget. We gotta do what we gotta do.<br/> </p>\n<p><strong>HOW TO PLAY:</strong></p>\n<p>We have to build an hospital to welcome the patient with the pieces available. </p>\n<p>- Three (3) construction trucks waiting more than five (5) seconds will cause you to get parking tickets.<br/>- A patient that arrive in an ambulance should never wait more than five (5) seconds before being put in the hospital, and just like in real life, there’s no problem with him being in a corridor or outside.<br/>- A pillar cannot fall on a patient because that’s gonna kill him. And that’s not the point of health system !<br/>- When there’s a budget cut, we have to remove what they ask without jeopardizing the structure.</p>\n\n<p><strong>BONUS:</strong></p>\n<p>- The square can reenforce the solidity of the pillars. </p>\n<p> <br/><strong>CONTROLS:</strong></p>\n<p>Left click - Pick up object or hospital bed<br/>Scroll wheel - Rotate the object<br/>Right click - Remove an object (only when there is budget cut)<br/> <br/> <br/><strong>TEAM OUTERMINDS OMEGA :</strong></p>\n<p>Guiz de Pessemier – Audio / Art Camera<br/>Tommy Gaudet – Script<br/>Alexandre Caron – Programmer<br/>Dalin Son – Programmer<br/>Marie-Claude Richer – Art<br/> </p>\n<p><strong>PHOTOS :</strong></p>\n<p>Dalin: Director of the Hospital<br/>Marie-Claude: Journalist<br/>Guiz: Douche-Meute<br/>Caron: Health Minister<br/>Tommy: Construction worker<br/>Cassie: Mayor of Metropolis<br/>Sylvain Racine: Federal Prime Minister<br/>Jean-Baptiste: Provincial Prime Minister<br/>Kevin: Vegan hippy<br/> </p>\n<p><strong>VOICES:</strong></p>\n<p>Tommy<br/>Guiz<br/>Matthieu<br/> </p>\n<p><strong>ACCESSIBILITY:</strong></p>\n<p>Motor: <br/>- The game is played with one hand on the mouse.<br/>- The buttons and the elements of the UI is well spaced.</p>\n<p>Visual:<br/>- There is only one pattern by type of events (Ambulance or construction truck)<br/>- There is a audio description for all of the important steps.<br/>- The important information is in the center of the screen and pauses the game.</p>\n<p>Cognitive :<br/>- The game is almost 100% visual and the jokes are subtitled, in addition to be narrated.<br/>- The font is big and countdowns are clear to announce a possible death.<br/>- The director of the hospital gives you a tutorial to explain the game.</p>\n<p>Auditory and Verbal :<br/>- 100% of the game is subtitled in french and in english.<br/>-  Music volume is lowered when there is narration.<br/>-  We see the face and the role of the character at all time when they talk.</p>\n<p>#OneWebDay :<br/>-  Browser version of the game is available.</p>\n<p>DEMO: </p>", "metacritic": null, "released": "2017-09-26", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/ee2/ee27270abe93685fb1b6f9e1fbc36bf3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 85, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["Outerminds Omega"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}