{"id": 165796, "slug": "the-mystery-of-the-blood-fountains", "name": "The Mystery of the Blood Fountains", "name_original": "The Mystery of the Blood Fountains", "description": "<p>Your friend Doc has a problem: his fountains have dried up or worse \r\nstill, their water has turned blood-red. Doc is concerned and scared.  \r\nHow can you help him? Repair the fountains and discover who or what is the cause of this strange phenomenon.  Be careful: you'll encounter <strong>enemies </strong>and you don't have weapons! Flee, if you value your life, if they catch you, you're dead!</p>\n<p>Loot the levels for score points and beat your friends with best \r\nhighscore! The repaired fountains don't give points, but if you don't <strong>repair them all</strong> you cannot proceed to the next level.</p>\n<p>Game has different endings with different choices and takes about 40 minutes to complete.  Have fun!\r\n</p>\n<p><strong>Controls</strong></p>\n<p>Move with <strong>keyboard arrows</strong> (up, down, right, left) and interact with NPC, monsters and objects by <strong>colliding </strong>with them. Leave with <strong>escape</strong>. The game <strong>saves automatically</strong> as soon as you have completed a level. For more info see <strong>Help </strong>on the first screen or call with F1. \r\n</p>\n\n<p><strong>Versione italiana (original version):</strong></p>\n<p>Il tuo amico Doc ha un problema: le sue fontane sono o secche o ne esce un liquido rosso che assomiglia a sangue. Doc è molto turbato da questi avvenimenti. Aiutalo riparando le fontane e scoprendo chi ha provocato questo strano fenomeno e perché.</p>\n<p>Incontrerai <strong>nemici </strong>e ostacoli: evitali, se ti è cara la pelle! Sei disarmato e non li puoi uccidere, se ti toccano, muori.</p>\n<p>Fai incetta di bottino: ogni oggetto raccolto dà <strong>punti </strong>(Highscore!). Le fontane riparate non danno punti, ma se non le ripari tutte, non si aprirà la porta per il prossimo livello.</p>\n<p>Il gioco dura circa 40 minuti, ma ha fine diversa a seconda delle tue scelte.</p>\n<p><strong>Controlli</strong></p>\n<p>Puoi controllare il tuo personaggio con le <strong>frecce </strong>della tastiera e interagire con persone, oggetti o creature <strong>collidendo </strong>con essi. Puoi uscire da ogni schermo con <strong>escape</strong>. Il gioco <strong>salva </strong>automaticamente dopo ogni livello completato.<br/></p>\n\n<p><strong>Credits:</strong></p>\n<p>The banner \"wizardtower painting\" was made by JAP(23.1.2011)  . You'll find his work on https://opengameart.org/content/oil-painting-landscapes; license Public Domain CC0.  All other credits are in the game (press F1 and scroll).<br/></p>\n<p>This game was made with Game Maker 8.1.</p>\n<p>All translations were \"handmade\",  no computer babbling!<br/></p>", "metacritic": null, "released": "2017-09-18", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/719/7196ecb3eba910d891a05ea983c55e55.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 117, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["criacuervos"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}