{"id": 165764, "slug": "virtual-ball", "name": "Virtual Ball", "name_original": "Virtual Ball", "description": "<p><strong>Please note - this is an early prototype, there may be bugs.</strong></p>\n<p>Virtual Ball is a virtual reality paintball simulation that supports the HTC Vive.</p>\r\nInstallation\r\n<p>After downloading, extract the file and run the executable contained within.</p>\n<p><strong>NB:</strong> You must have SteamVR installed and running, as well as a connected HTC Vive and a PC with recommended minimum specs.</p>\r\nPlaying\r\nMovement\r\n<p>Virtual Ball utilizes what is commonly referred to as 'artificial locomotion'.</p>\n<p>Touching anywhere on either of the Vive controller's touchpads will cause you to move at a constant velocity in the direction of touch, relative to where you are looking.</p>\n<p>The reason for the constant speed is to eliminate linear acceleration of any kind, thereby minimizing nausea. You can change directions while moving, but this is inadvisable because it is another kind of acceleration that may cause nausea.</p>\n<p><strong>If you ever feel nauseous, take the HTC Vive headset off and don't enter VR again for at least 30 minutes</strong></p>\r\nInteracting with the paintball gun (marker)\r\n<p>When the game is started, there will be a red paintball gun floating close to you. In order to pick it up, move one of the Vive controllers close to the grip of the paintball gun and squeeze the grip buttons on the controller. This will anchor the paintball gun to your controller.</p>\n<p>When you have picked up the paintball gun, you can shoot by simply pulling the trigger. Currently the gun is set to fire on every pull and release of the trigger. Note that the first time you shoot, the game will begin.</p>\r\nGameplay\r\n<p>Upon shooting your first paintball, the first opposing computer player will spawn down range. If they see you, they will shoot at you, so be ready to dodge, or hide behind a bunker! You will have approximately 1.5 seconds to try to shoot them before they disappear and respawn in a different, random location, again trying to shoot you. The game will be over after 45 seconds, and a display will pop up to let you know how you did. Stats will include:</p>\n<ul><li>Number of paintballs used</li><li>Number of targets hit</li><li>Number of targets spawned</li><li>Your score (calculated based on your targets hit and paintballs used)</li><li>The local high score</li></ul>\n<p>Check out the code if you're interested.</p>", "metacritic": null, "released": "2016-10-26", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/f67/f673111e6e4d6fb1f1a66f8802d500a5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 15, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["osharp"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}