{"id": 16598, "slug": "atonement-2-ruptured-by-despair", "name": "Atonement 2: Ruptured by Despair", "name_original": "Atonement 2: Ruptured by Despair", "description": "The highly anticipated sequel to Atonement: Scourge of Time finally comes to Steam! <br/><br/>General Features:<br/><ul> <li>Direct sequel to Atonement: Scourge of Time. <br/></li><li>Explore the alternate timeline, where the final outcome of the first game took a grimmer turn. Characters you’ve known already will not be the same. Friends will become enemies, and enemies will become friends. <br/></li><li>Regenerating energy battle mechanic is back! Carefully manage how you spend your energy as some skills can leave you dry very fast! <br/></li><li>No level ups or experience points! Similar character progression to City of Chains – gain skill points upon completing quests and choose which battle skills or passive abilities to learn. <br/></li><li>Non-linear gear progression. Equipment system now consists of enchantments that you can find all over the world. Use these to customize your character’s offensive and defensive bonuses to your liking. <br/></li><li>All enemy encounters are visible, so you can tackle them when you’re ready. Some passive abilities will allow you to bypass battles without needing to fight. <br/></li><li>In addition to the main party’s story arc, witness flashbacks from a distant past, where you get to control a second party of characters. Any decisions you make during these scenes will have an impact on the present.</li></ul>Story: <br/><br/>Three weeks have passed since the events of Atonement: Scourge of Time. The world was saved… or so it seemed. Whilst keeping a low profile, Elleria began to notice strange occurrences – ominous dreams, a persistent weakness, and mysterious portals coming out of nowhere. <br/><br/>Before long, she and her allies find themselves in an alternate timeline – a timeline where events took a grimmer and more depressing turn, with familiar characters no longer being the same, and Elleria herself being at the centre of it all. <br/><br/>Wanting nothing more than to simply return to her home timeline, Elleria will have to face her fears, her lineage, and herself, in order to overcome treacherous hazards, eldritch secrets, fallen angels, overwhelming odds, and maybe, just maybe, save others in the process. <br/><br/>To check out the original Atonement title, please head on over to the existing store page: http://store.steampowered.com/app/385070/", "metacritic": null, "released": "2016-10-18", "tba": false, "updated": "2019-09-17T06:54:02", "background_image": "https://media.rawg.io/media/screenshots/d45/d4547085e475bd136f8c80449f22fbdc.jpg", "website": "http://www.newrealitygames.co.uk", "rating": 2.11, "rating_top": 1, "added_by_status": {"yet": 11, "owned": 366, "toplay": 1, "dropped": 3}, "playtime": 4, "achievements_count": 34, "ratings_count": 9, "suggestions_count": 337, "game_series_count": 0, "reviews_count": 9, "platforms": ["PC"], "developers": ["Astronomic Games"], "genres": ["RPG"], "publishers": ["New Reality Games"], "esrb_rating": null}