{"id": 166051, "slug": "the-bounty-deluxe-edition-demo", "name": "The Bounty: Deluxe Edition Demo", "name_original": "The Bounty: Deluxe Edition Demo", "description": "<p>This demo is a work-in-progress prototype, and is not necessarily representative of the quality of the final product.</p><p>The Bounty:Deluxe Edition is coming soon on PC via Steam.</p><p><strong>Enter The Bounty.</strong></p><p>It's a 4th wall breaking, retro-inspired competitive RPG, JRPG meets Roguelike deviously combined with an arcade high score sensibility. An experience that will challenge your wits as you push to survive, uncover a multitude of secrets, and earn the high score.</p><p>Indie Game Studio X was on a mission. A mission to create the world's ultimate high score chasing video game. They thought that the only way to do it, was to go all the way- and pull knowledge from the most knowledgable man on the subject. They needed Walter Day.</p><p>So the team coerced Day to their studio. They hooked him up to their AI machine to read his brainwaves while they asked questions, but the machine glitched.</p><p>It pulled the intelligence and left the humanity behind; creating a sinister, devious AI with the world's knowledge of high score gaming.</p><p>This is where you come in, Player! <br/>Enter The Bounty, and defeat the game.<br/>Get the high score to beat the AI,<br/>and set Walter Day free!</p><p>The Bounty is unapologetically old school. No level grinding. No place to hide. Death is permanent. Even saving your game subtracts from your score. Your victory is in your own hands. Develop your own strategies, power your character the way you want to, and eventually conquer the game... if you can.</p><p>Remember- there is a secret, a trap, or a monster at every turn. Even some of the levels, creatures and treasures may not stay the same from play to play. Can you survive The Bounty?</p><p>If you enjoy the Shareware Episode, be sure to purchase the full game for the complete experience!</p><p>Learn more at www.ludicrousones.com</p>", "metacritic": null, "released": "2014-06-19", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/ea1/ea17389a72f8609d3eb7a9cd102dcf1e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 181, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["ludicrousda3ve"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}