{"id": 16616, "slug": "captain-forever-remix", "name": "Captain Forever Remix", "name_original": "Captain Forever Remix", "description": "You built your spaceship out of Plasma Cannons, bulkheads, and a couple of Twin Thrusters. Just ahead there's a massive enemy vessel bristling with MegaBoom Missiles. You want those missiles. You  need  those missiles. You dart forward and maneuver deftly between the spinning RipSaw blades on the front of the enemy craft and blast away at the Command Core. BOOM! It explodes leaving behind a haul of weapons and thrusters. Those MegaBoom Missiles are free for the taking. You quickly attach them to the front of your own ship, making it much larger and more powerful...<br/><br/><strong>Can you create the raddest spaceship?</strong> Captain Forever Remix is the spaceship builder roguelike. Voyage across the Solar System and blast apart randomly-generated enemies for spare parts.<br/><br/>You better build a pretty tough ship, because you're gonna need it. Your little brother turned into a bubblegum mutant and is being a total butthead. He froze the Sun, poked out Jupiter's eye, drank Neptune's oceans, and cracked Earth like an egg! Set off across a messed-up Solar System to put a stop to the big jerkface once and for all! <br/><br/>Captain Forever Remix is an officially-licensed re-imagining of the indie classic Captain Forever.Build your ship bit-by-bitProtect your Command Core with bulkheads, weapons, &amp; boosters to customize your ship. Every piece you add affects movement, combat capabilities, and armor.Plunder enemies for new partsEvery enemy ship is randomly generated and presents a unique combat challenge. Go in guns blazing or pick them apart carefully so that the leftover Ship Bits can be grafted to your ship!Choose your toolsObliterate your enemies with ScatterBlasters and MegaBoom Rockets or shred them to pieces with the RipSaw. Make the fastest ship in the Solar System with Uniboosters and Twin Thrusters, protect it with Bubble Shields, Repair Bulkheads, and tons more!Captain Forever - RemixedExperience all-new gameplay that wasn't in the original cult-hit Captain Forever. Collect rare Power Bulkheads to access special abilities, unlock new starter kits, discover new Ship Bits, and avoid deadly traps laid by King Kevin!A new look, a new universeRemix features a completely new art style that draws inspiration from the 1990's heyday of amazing &amp; weird cartoons. Tour a Solar System in disarray as you set out to put a stop to the insane shenanigans of your mutant little brother &amp; get payback!", "metacritic": null, "released": "2016-06-03", "tba": false, "updated": "2023-08-10T01:09:48", "background_image": "https://media.rawg.io/media/screenshots/fc9/fc97a996a971434559927d9a468fabf4.jpg", "website": "http://captainforeverremix.com/", "rating": 3.08, "rating_top": 4, "added_by_status": {"yet": 4, "owned": 110, "dropped": 3}, "playtime": 1, "achievements_count": 31, "ratings_count": 12, "suggestions_count": 409, "game_series_count": 0, "reviews_count": 12, "platforms": ["macOS", "PC", "Linux"], "developers": ["Pixelsaurus Games", "Future Crayon"], "genres": ["Action", "Indie"], "publishers": ["Pixelsaurus Games"], "esrb_rating": null}