{"id": 166187, "slug": "who-eludes-me-chapter-ii-demo", "name": "Who Eludes Me? Chapter II demo", "name_original": "Who Eludes Me? Chapter II demo", "description": "<p><strong>\"Like what you see, buddy boy?\"</strong></p><p>Tristan's home for summer vacation. He's got an interview in the morning for an internship, but his friends just wanna party. Tristan struggles to fit in back home and can't find balance. He needs 8 hours of sleep but unfortunately just finds himself in endless turn-based battles against high school jocks, townie hooligan adults, and enraged stoners. What a horrible night for a curse, buddy boy.</p><p>It's like Super Bad mixed with Fellini Satyricon lol</p><p>Originally developed: around 2013<br/>Play time: two hours?<br/>Dungeons: 2 dungeons<br/>Party Members: 4<br/>Secret Bosses: 1 secret boss<br/>Requirements: Windows XP and up</p><p>'Who Eludes Me?' is a screenplay I wrote as a sophomore in college (it was part of a series of screenplays - Who Eludes Me?, Who Touches Me? [a Dragon Warrior allusion], and Who Repulses Me? [a rip of Repulsion, basically, that ended up being more Albee than anything]). The 'chapter II' is because this section takes place in the middle of the story, and I originally had planned on having four chapters for the whole thing. The screenplay is alright, but if ever revisited, I'd have to change its unbearable (and unfair) ending.</p><p>The graphics are mostly hand drawn, on graph paper, inspired by Charlie Brown and Halloween decorations. My passions are EarthBound, Space Funeral, and Dragon Quest. The dungeons in this demo are actually ripped from Dragon Warrior 1 and 2, of which I have an undying passion for 4ever.</p><p>Hopefully I caught all the bugs, but know this was made several years ago by a novice. Email me with complaints, passwords, and cartoon spells.</p><p>Last updated: June 29, 2016</p>", "metacritic": null, "released": "2016-06-29", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/8b3/8b3b16b537648cda6abcf317a73508c8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 82, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["nilson"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}