{"id": 16626, "slug": "quanero-vr", "name": "Quanero VR", "name_original": "Quanero VR", "description": "Quanero is an experimental VR experience for the <strong>HTC Vive</strong> and the <strong>Oculus Rift</strong>. Your goal is to figure out what caused a violent incident in a futuristic bar by manipulating the time. You can slow down time, reverse it or bring it to a halt. Explore the scene, unlock the story's branch points and unravel the mystery. There's also an explosion. Quanero was created with Unreal Engine 4 and can be downloaded for free.Background InformationThe possibility of experiencing stories in virtual reality offers completely new challenges to the art of storytelling. The traditional work of directing and the function of the cameraman have to be reconsidered completely, as the player is able to choose his point of view and position. <br/>We have tackled this challenge in our final bachelor project Quanero and even went one step further: in this experience, we also give the player complete control over the time. Thus, it is possible to move forward and backwards in time, to stop it or to view the action in slowmotion from every perspective in the room. We're offering the player a new and extremely immersive experience. The goal of the experience is to find the source of the devastating chain reaction which climaxes in an explosion. <br/>Quanero was developed specifically for HTC Vive. VR technology enables you to feel like you're in this futuristic bar, partaking in a brawl or a drug deal and finding yourself in a spectacular explosion with debris raining down on you.<br/><br/>This project was created by students from the University of Applied Sciences Salzburg's MultiMediaArt and MultiMediaTechnology degree program. The content was created with several 3D applications and textured with the help of substance painter and designer. Body and facial expressions were acted out by professional actors and digitized with a motion capture system.", "metacritic": null, "released": "2016-08-12", "tba": false, "updated": "2019-09-17T10:40:19", "background_image": "https://media.rawg.io/media/screenshots/9b5/9b550b44b32862907f12db23c2c5a26c.jpg", "website": "http://www.quanero.com", "rating": 2.8, "rating_top": 3, "added_by_status": {"yet": 5, "owned": 238, "beaten": 6, "dropped": 2}, "playtime": 1, "achievements_count": 0, "ratings_count": 10, "suggestions_count": 383, "game_series_count": 0, "reviews_count": 10, "platforms": ["PC"], "developers": ["Laserboys3000"], "genres": [], "publishers": ["Laserboys3000"], "esrb_rating": null}