{"id": 166383, "slug": "ark-gdidoujins", "name": "Ark (gdidoujins)", "name_original": "Ark (gdidoujins)", "description": "<p>Alright, the download has caught up for this Waifujam entry.</p><p>This is my first game with 2 months experience with UE4 blueprints.</p><p>Apparently even though I had removed a lot of the shared folders (I like to spill all the lego bricks on the floor when constructing stuff, even virtually) a lot of starter content was still packaged in, hence the bloated filesize.  Apologies... next time I will be very particular about making local copies of textures.</p><p>Other assets especially the mech enemies were taken from Turbosquid (credit their respective modellers), one music track was released in public domain, the other my composition.  Also my own drawings and sound effects out of my parts bin.<br/></p><p>Also for bugs and incompleteness, mainly the hit colliding boxes, gaps in the levels, rendering distance, GUI not exiting viewport properly, etc.  Also the game has easy hitpoints if it weren't merely bumping causing damage as well, so level collision is hit or miss, though the city level is supposed to have a shallow killz volume.</p><p>I was going to make a final cutscene but it was cut due to time constraints (*ba-dum-tish) so you just have two open-ended levels.</p><p>I will probably not work any further on this game.  However the theme is intriguing.  Recently with Kojima not being in active game development since his exit from Konami, it's very tempting to attempt to tackle something in the spirit of Zone of the Enders or Xenosaga.  However this game, though attempting to be sci-fi, is not that fast-paced enough, and was more inspired by Descent in the nineties.  I need to work on missiles which I read tend to be very challenging since you need to update the particle trail to follow the flight path.<br/></p>", "metacritic": null, "released": "2015-05-11", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/a41/a41d2f79028929317aaf24d64b0835dd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 97, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["gdidoujins"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}