{"id": 166320, "slug": "tuuli", "name": "Tuuli", "name_original": "Tuuli", "description": "<p><em>The old witch, your teacher Mákke, is dead. If you want to save your village you'll have to destroy the raiding fleet that's coming. Can you do it, young Lenne-who-would-be-the-witch?</em></p>\n<p>--------------------</p>\n<p><em>Mákke, la vieja bruja del pueblo y tu maestra, ha muerto.</em></p>\n<p><em>Si quieres salvar a tu aldea vas a tener que destruir la flotilla que se acerca por el mar. ¿Podrás, joven Lenne-que-quiere-ser-bruja?</em></p>\r\n\r\nDaurmith: story, writing, additional programming.<br/><br/>Ruber Eaglenest: programming, additional story, additional writing.<br/><br/>Benjamin Sloth Lindgreen: Cover photo.<br/><br/>Made during June 2017 for the JAM 'Canciones del desierto, la tormenta y el mar'. The game is inspired by the song 'Tuuli' from the Swedish/Finnish group Hedningarna.<br/><br/>Polished, extended and translated for the 2017 IF Comp.<br/><br/>The current version of May 2018 has six months of additional work as a post-competition version, hopefully final.<br/><br/>Many thanks to all the people who reported bugs and mistakes and who suggested improvements to the game: Baltasar el Arquero, Johan Paz, No-nonsense, Comely, Chaky, Mariela Scullywen, Pseudavid, Verity Virtue, Joey Jones, Dan Fabulich, Craiglocke, Catacalypto and Jack Welch.<br/><br/>You may find the authors on Twitter: @Daurmith and @RuberEaglenest.<br/><br/><strong>Content warning:</strong> Tuuli is a short work of fantasy with horror elements: graphic imagery and witchcraft. The game has around thirty minutes of play. There no need to make a map, but saving your progress is wise.\"<br/><br/>To learn how to play Interactive Fiction, check this guide: http://pr-if.org/doc/play-if-card/Nota\r\n<p>Daurmith: Historia, letras y programación adicional.<br/></p>\n<p>Ruber Eaglenest: Programación, historia adicional y letras adicionales.</p>\n<p>Benjamin Sloth Lindgreen: Foto de portada.</p>\n<p>Producida durante el mes de Junio de 2017 para la JAM Canciones del desierto la tormenta y el mar. El juego está inspirado en la canción Tuuli, del grupo escandinavo Hedningarna.</p>\n<p>Se ha mejorado y traducido durante tres meses más de trabajo para la IF Comp del 2017.<br/></p><p>La  versión de mayo de 2018 tiene seis meses de trabajo como versión post-competición, esperamos que definitiva.</p><p>Agradecimientos a las personas que han comunicado sugerencias o errores para mejorar el juego: Baltasar el Arquero, Johan Paz, No-nonsense, Comely, Chaky, Mariela Scullywen, Pseudavid, Verity Virtue, Joey Jones, Dan Fabulich, Craiglocke, Catacalypto y Jack Welch.</p>\n<p>Puedes encontrar a los autores del juego en twitter @Daurmith y @RuberEaglenest.</p>\n<p><strong>Advertencia de contenido</strong>: <em>Tuuli</em> es una pieza corta de fantasía con elementos de horror: descripción de imágenes gráficas y brujería. El juego dura en torno a treinta minutos. No hay necesidad de hacerse un mapa, pero grabar la partida es conveniente.</p>\n<p>Para aprender cómo se juega a Ficción Interactiva, lee esta guía: http://www.caad.es/baltasarq/i...</p>", "metacritic": null, "released": "2017-06-30", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/220/22087bcd49dc6e639c19530beabdb0fe.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 12, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Android", "Web"], "developers": ["rubereaglenest"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}