{"id": 166354, "slug": "hcf", "name": "HCF", "name_original": "HCF", "description": "<p>Choose a Technique. Kill a Conspirator. Search for the meaning of HCF. #HCFtwine</p>\n<p>My Patreon.</p>\n<p>My Twitter.</p>\n<p>__________</p>\n<p>*Please note: This game is best experienced with headphones.  If you don't have headphones, though, don't sweat it. :) Please savor this experience.*</p>\n<p>Made for the Twiny Jam (https://itch.io/jam/twiny).  The word count (not including repeated phrases) is 299. </p>\n<p>All images on the game's cover are free-use and under the Creative Commons license.  All of them can be found at: http://commons.wikimedia.org/wiki/Human_body_diagr...</p>\n<p>***PARTIAL VOICE-ACTING HAS NOW BEEN IMPLEMENTED!  THE SHOPKEEPER IS VOICED BY BRANDON KOZIATEK.  CONTACT HIM AT BOKULTRA@GMAIL.COM.***</p>\n<p>UPDATE (4/11/15)- Took out the Wav audio, thus decreasing the file size from 29mb to 5mb.  Tweaked the writing a bit, since coughlinjon said it was sometimes hard to tell who was speaking.  Since that put me over the word limit, I put it in as a separate file from the original (HCF 300+.zip)</p>\n<p>UPDATE (5/14/15)- Now with voice-acting for The Shopkeeper!  Did some writing tweaks, too, and added a sound effect.  This is also a separate file (HCF 300+VO.zip).  The other files have been deleted, for convenience.  If you want me to put them back up, let me know by sending me a message.</p>\n<p>The clock sound is  coocoo clock chime.wav by photogtony, and can be found here: http://freesound.org/people/photogtony/sounds/2420....  I modified it, which is permitted under the sound's licence, Creative Commons 0.  (See the sound's page for more detail)</p>\n<p>__________</p>\n<p>As a participant of this event, what do you beleive HCF means?</p>\n<p>Tweet your thoughts with the hashtag #HCFtwine.</p>\n<p>Find me on Twitter @NaomiNorbez.  Or send an e-mail at mninorbez@gmail.com.</p>", "metacritic": null, "released": "2015-04-09", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/321/321e6ed5046673c2474e21e150fd0e9b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 34, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Android"], "developers": ["Naomi Norbez"], "genres": [], "publishers": [], "esrb_rating": null}