{"id": 166392, "slug": "le-journal-de-lobservateur-jdo-tome4", "name": "Le Journal de l'Observateur JDO-Tome4", "name_original": "Le Journal de l'Observateur JDO-Tome4", "description": "<p>Mise à jour 1.5 : Correction de bug</p>\n<p>https://www.tipeee.com/jdo-univers<br/></p>\n<p>L'introduction ne se lance plus à l' infinie.</p>\n<p>N'hésitez pas à nous communiqué les bugs et à nous noyer sous les retours, positifs ou négatifs afin que la qualité de nos jeux s'améliore et que vous puissiez en profiter à fond !</p>JDO-Univers\r\n<p>Créé en 2017 par l’écrivain Jean-Michel Martin, le studio JDO-Univers prend directement racine au cœur de la mythologie créée par ce dernier dans la série « Le journal de L’Observateur ». Rapidement rejoint par Alexis Breuvart, directeur développement, les deux associés, alors portés par les scénarii de l’auteur démarrent une aventure dans laquelle non seulement vous êtes le héro, mais aussi les conseillers, les amis, les soutiens indéfectibles... Bienvenue dans l’épopée JDO-Univers !</p>\n<ul><li>Jean-Michel Martin\r\nScénaristeNé en Corse au début des années 80, l'auteur, J.M. Martin commence très tôt à aiguiser sa plume en de nombreuses circonstances. Après avoir émigré à Toulouse et suite à divers rebondissements personnels et professionnels, il se lance cette fois dans l' écriture professionnelle et nous ouvre les portes d'un univers inédit. Composé d'une multitude de strates et d'une mythologie complète, il parvient à faire éditer ses premiers livres assez rapidement. Aujourd'hui, de retour sur son île natale, il scénarise pour le studio de jeux vidéo JDO-Univers, il continue malgré tout ses œuvres littéraires complétant un univers riche et infini.\r\n</li><li>Alexis Breuvart (Alias Squirrel/LesTutossUE4)\r\nLeader DevelopperPeu importe ce qu'on lui demande, il dit toujours oui. Par contre il ne dit pas quand. C'est lui qui dit quand c'est possible ou non. Et il s'occupe, en plus de son poste dans le studio, d'unechaîne Youtube de tutoriel sur Unreal Engine 4\r\n</li></ul>\n<p><strong>Mise à jour 1.1 : </strong>Correction de bug</p>\n<p>Ajout de l'option configuration du clavier / personnalisation des touches</p>\n<p><strong>Pourquoi faire un jeu vidéo?</strong></p>\n<p>Aujourd'hui ce média qui autrefois était produit par une élite, et bien que celle-ci soit toujours présente et indispensable à cette économie, deviens accessible à tous pour la création.</p>\n<p>Les jeux vidéo foisonnent, surtout provenant de studio indépendant, mais combien recelent de vraies évolutions, combien sortent des schémas d'énigmes et de quêtes classique?</p>\n<p>Avec mon regard de joueur, ma curiosité et mon imagination d'écrivain, je me permets aujourd'hui de vous proposer un jeu dont l'archétype est connu de tous, mais à l'histoire et aux mécaniques les plus originales possible.</p>\n<p>J'espère que ce projet ira jusqu'au bout, avec votre soutien, votre amitié, votre patience.</p>\n<p>Merci à tous ceux qui m'aident et me soutiennent à l'aube de ce nouveau défi, Lowlow, Amylol, Pierro, Angy et tant d'autres...</p>", "metacritic": null, "released": "2017-07-08", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/f72/f720b9b5a7e5c36a6a8574db45ac2ad2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 249, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Android"], "developers": ["jdo-univers"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}