{"id": 166400, "slug": "fantastic-backflip", "name": "Fantastic Backflip", "name_original": "Fantastic Backflip", "description": "<p><em>Alright Evelyn, time to go.  No big deal, just getting up in front of the whole university and dancing my heart out.</em></p><p><em>Why am I doing this?  I don't even know anymore.  Maybe I don't even want this, really.</em></p><p><em>Well, it's too late now.</em></p><p><em>And besides--I won't be there alone.</em></p><p>__________</p><p><em>Fantastic Backflip </em>is now complete!  Made for NaNoRenO 2016.<br/></p><p>If you have any questions, comments, or critique: comment below on this page, message me on Twitter or Tumblr, or e-mail me at mninorbez@gmail.com. I'd love to hear from you!<br/></p><p>My Patreon. (Special thanks to my Patreon, Bluebirdplays)</p><p>__________</p><p>7/16/16: <em><strong>Fantastic Backflip </strong></em><strong>has updated to Version 1.1!  This update includes, in summary:</strong></p><p>-Edited &amp; improved text.</p><p>-Addition of Some Strange Circus to the \"Special Thanks\", for the use of their poem, which is quoted in the beginning of the game.</p><p>-Fixed a broken link at the beginning of the game; code was supposed to have the player click the link to reveal more text on the page, but instead all the text was shown at once.</p><p>-Addition of a \"Clean\" and \"Cleaner\" version of the game, that makes the <em>Fantasitc Backflip</em> swear-free.  Click here to download it &amp; get more information!</p><p>-No art was altered or changed in this update.</p><p><strong>Specific changes in text:</strong></p><p>-Bolded all text in the links at the game's end (all text in the <em>Author's Note</em>, <em>Special Thanks</em>, etc.)</p><p>-Edited the <em>Author's Note: Disclaimer</em> to specify that while this game could be used as an introduction to ASL/Signed English, other sources should be consulted.</p><p>-Altered a pronoun so that Evelyn's Coach is now female instead of male.</p><p>-Changed \"Chelsea\" to \"Carrie\" (Evelyn's roomate).</p><p>-Added a few lines &amp; paragraphs in certain sections to give more detail.  For example: added a to the scene where Evelyn tells Miss. Dexter, \"Be careful\", explaining that Evelyn was wary the girl might take things further than just gossip.  Additional details in the text can be found throughout the game.</p>", "metacritic": null, "released": "2016-04-08", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/0f3/0f331193adb2df28f0b7cbedb51941ee.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 35, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Naomi Norbez"], "genres": [], "publishers": [], "esrb_rating": null}