{"id": 16651, "slug": "paddle-up", "name": "Paddle Up", "name_original": "Paddle Up", "description": "Paddle up with online multiplayer, robots, complete challenges or train your table tennis skills. This is the ultimate ping pong experience for VR.Key Features!<ul><li><strong>Natural Table Tennis Physics</strong> - Indulge in the most natural table tennis physics in VR. Customize your paddle with different types of rubber or go hardbat for more control!<br/></li><li><strong>Online Multiplayer</strong> - Compete against your friends or players globally online, interact with voice chat so that you can talk smack. Our optimized netcode allows you to play across continents with high ping!<br/></li><li><strong>Versus Robot</strong> - Play against AI of varying skill sets - from casual to \"don't even bother hard\". Get better by playing them in practice sessions.<br/></li><li><strong>Bullseye</strong> - Improve your table tennis skill with multiple levels that challenge your precision and performance. Unlock new levels as you get better!<br/></li><li><strong>Practice Modes</strong> - Go into training sessions against automatic ping pong ball shooters, AI or just you and the wall.<br/></li><li><strong>Customization</strong> - Play in different locations, try on different hats, play with fire balls (not recommended), go crazy.<br/></li><li><strong>\"Beer\" Pong</strong> - As an added bonus, improve your beer pong skills and become the beer pong master.</li></ul>", "metacritic": null, "released": "2016-08-24", "tba": false, "updated": "2019-08-28T22:10:51", "background_image": "https://media.rawg.io/media/screenshots/358/358082f836e7819ccca206b9510aab26.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 14}, "playtime": 1, "achievements_count": 11, "ratings_count": 1, "suggestions_count": 187, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Pavel Jamal"], "genres": ["Sports", "Indie"], "publishers": ["Pavel Jamal"], "esrb_rating": null}