{"id": 1665, "slug": "battle-for-cydonia", "name": "Battle for Cydonia", "name_original": "Battle for Cydonia", "description": "Make your mech battle like a kung-fu master!  A top hit in over 20 countries, Battle for Cydonia has had over 1 million downloads!<br/><br/>The year is 2360, the battleground is Mars, and the war is between two factions competing for the right to colonize the red planet. Fighting for the resistance, you command the Datalus-5 - a mech capable of unprecedented agility and outfitted with a growing array of devastating weapons.<br/><br/>Innovative touch responses puts you in control of the Datalus-5.  Draw a path and watch your weapon of war follow your orders. Firing on multiple enemies? No problem. Using multi-touch, tap on multiple foes and aim your fire in multiple directions. Even drag your finger across the screen to lay down a sheet of covering fire.  Whatever it takes to defeat your enemy.<br/> <br/>Crisp visual effects from lasers, missiles and other weapons combine with clear sound effects and a roaring sound track to made Battle for Cydonia an instant hit. Whether you’re new to gaming or a seasoned vet – Battle for Cydonia will challenge and impress you.<br/><br/>Reviews:<br/>“John Woo meets MechWarrior – Battle for Cydonia does a great job in keeping its Mech combat fresh...huge range of interesting weapons and items to unlock..engaging mission objectives... a staple on our devices for a while to come.” - TouchArcade.com<br/><br/>“Finally a step away from the dreaded V-Pad!  The interface in Battle of Cydonia is a mix of shooter and flight-control like mechanics that work amazingly well.” - TouchMyApps.com <br/><br/>“Ambidextrous Metal Carnage!!  Put simply, Battle for Cydonia rocks.” - NoDPad.com<br/><br/>“Battle for Cydonia will provide you with an unrelenting challenge while making you and your mech look like a kung-fu master.” - AppSpy.com<br/><br/>“Sound effects are amazing, including machine gun like artillery, fiery blasts, coupled with a hard pounding guitar rock soundtrack that enhances the action.” - AppSafari.com<br/><br/>Features:<br/>•Multiple weapon configurations – arm yourself for each battle.<br/>•Fully customize your mech with upgrades for armor, weapons and more!<br/>•Slamming sound track or listen to your own music<br/>•Outlast your friends in Survival Mode.<br/>•Open Feint integration with global leaderboards and achievements. <br/><br/>Check out out other hit games by Brisk Mobile at www.BriskMobile.com and follow us on Twitter @BriskMobile !", "metacritic": null, "released": "2010-02-01", "tba": false, "updated": "2019-10-22T14:27:48", "background_image": "https://media.rawg.io/media/screenshots/57b/57b4300e925bc0bd951b3a998931cc1a.jpeg", "website": "http://briskmobilegames.com/Games/Cydonia", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 292, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Brisk Mobile"], "genres": ["Adventure", "Strategy"], "publishers": ["Brisk Mobile"], "esrb_rating": "Everyone 10+"}