{"id": 166515, "slug": "crime-is-sexy", "name": "Crime is Sexy", "name_original": "Crime is Sexy", "description": "<p>\r\n\tInspired by the \r\n\tJalloo 2015 Game Jam theme, <strong>\"Is this Legal?\"</strong> our game submission satirically questions and challenges several official and unofficial laws within games, the game industry and the game jam itself. We lampoon some of the current directions and movements in the game industry with regard to profitability, privacy, independent development, and intellectual property controversies.\r\n</p><p>\r\n\tAfter a few quick set‐up steps, players can choose one of the 1000 bundled game titles and enjoy the truly mind‐blowing graphics and gameplay that await. Each unique game experience is only available once and may just challenge players' notions of what is \"legal\" in terms of games and their possible social meanings. What are you waiting for?... DO IT!!\r\n</p><p>\n</p><p>You can also find this game on the Steam workshop.</p><p> \"Beginning with a satire of the ruthless financial forces behind Big Gaming, Crime Is Sexy moves on to target everything about this industry's politics, from the corporate cheerleading mentality of players and consumers to the timid, faux-emotional, inferiority complex inherent to popular independent games. Developer Jallooligans pulls absolutely no punches. In a climate of blithe video game positivity, vicious criticism like Crime Is Sexy is exactly what we need.\" - Edward Smith, International Business Times</p><p>Click to read the Game Bias review!<br/></p><p>\r\n\tCREDITS: Jeff Mundee, Lauren Cruikshank, Rebecca Goodine, Nicholas Polchies, Nathan Thompson, Chad Comeau, Jade Yhap\r\n</p>", "metacritic": null, "released": "2015-06-16", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/b6b/b6b2b2ab2759b48a442cd2cfc8a3ae14.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 97, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Fring Frang", "Jeff Mundee", "Jallooligans"], "genres": [], "publishers": [], "esrb_rating": null}