{"id": 166695, "slug": "onedollar", "name": "OneDollar", "name_original": "OneDollar", "description": "Estamos concorrendo por voto popular a uma vaga na final do maior evento de desenvolvimento de games da América Latina.  \r\n<p><strong>Você pode nos ajudar a chegar lá!</strong></p>\n\n\n<strong>Faça seu login e dê 5 estrelas no menu \"Plus Ultra\"</strong>\n\n<p><strong>O mundo é desigual e nem todos os lugares têm as mesmas oportunidades. Mas não precisa ser assim. Às vezes, um dólar de cada um já pode fazer a diferença.</strong><br/></p>\n<p>O jogo OneDollar pretende ajudar a Unicef a aumentar arrecadação de doações para continuar mudando a vida de milhares de crianças e adolescentes.</p>\r\nProposta\r\n<p>A UNICEF, órgão das Nações Unidas que tem como objetivo promover a defesa dos direitos das crianças, já tem credibilidade no mundo todo para receber doações, mas precisa tornar o ato de doar mais palpável ao público. Neste contexto, surgiu a proposta do jogo: ajudar a mudar esse cenário. </p>\n<p>O protótipo funcional do OneDollar foi desenvolvido para web browser durante a GameJam+ São Paulo, em apenas 48h, visando abordar a discrepância entre áreas com e sem acesso a estruturas de saneamento básico. O level se passa no Brasil, mas pode ser amplamente escalado para abordar qualquer tema ou projeto da UNICEF no mundo. O projeto conta com escopo definido, cronograma de execução, proposta de viabilidade (parcerias com iniciativa privada, plano de comunicação e marketing com ações de viralização orgânica etc.) e muita, muita vontade da equipe de idealizadores.</p>\n<p><strong>Mecânica: Puzzle + Plataforma + Ação Social</strong></p>\n<p>A ideia é coletar moedas e resolver o quebra-cabeça para chegar até a moeda especial, que serve para passar de fase. O desafio do jogo é sempre baseado em um problema social real e abordado pela UNICEF no local em que o jogo se baseia. Os puzzles serão trabalhados para serem gradualmente mais complexos à medida em que o jogador se familiarizar mais com a mecânica do jogo.</p>\n<p>Além de se esforçar para corrigir o problema, o jogador deve doar a moeda especial na caixinha da organização para prosseguir. Após o fim do level, ele terá acesso a mais informações sobre a atuação da UNICEF na região abordada no game  e terá a opção de conhecer mais sobre os projetos próximos (se permitir acesso a geolocalização), além de poder fazer uma doação verdadeira, no valor que quiser a partir de um dólar.</p>\n<p><strong>Por que OneDollar?</strong></p>\n<p>A escolha da moeda dólar é baseada em medidores internacionais de pobreza. Foi estabelecido um valor simbólico de doação para torná-la mais palpável, para que as pessoas entendam que é a atitude em massa, em comunidade, que realmente ajuda a equilibrar o mundo. Acreditamos que, atualmente, para a Unicef, é melhor receber 10 dólares de 10 pessoas diferentes do que a mesma quantia de uma pessoa só. É preciso ganhar alcance e gerar empatia.</p>\n<p><strong>Como trabalhar o tema</strong></p>\n<p>A aplicação do jogo OneDollar pode se dar em variadas abordagens (regional, por país, por problema a ser combatido, por projeto local a ser divulgado e fortalecido), trazendo temáticas mundiais e mostrando representatividade (étnica, cultural, inclusiva) por meio de seus personagens especialmente desenhados para cada nível, por exemplo, uma garotinha da África do Sul para abordar o tema de saúde/HIV, um cadeirante  para tratar de acessibilidade etc.</p>\n<p><strong>Evoluções</strong></p>\n<p>Traçamos um plano robusto de evoluções, pensando em ranking, personalização de avatar, tracking de doação por projeto, expansão para mobile e construção de níveis mais desafiadores a cada novo mundo. Nossa proposta é engajar o público com um produto final com poder de mudança, mas também muito gostoso de jogar.</p>\n\n\r\nEquipe\r\n<p><strong>Ayrton Mugnaini </strong>– Designer na Deloitte Brasil e artista 2D, responsável pela direção de arte.</p>\n<p><strong>Bira Lavor</strong> – Visual storyteller, produtor na Stuplendo Entertainment, responsável pela produção executiva e líder de projeto.</p>\n<p><strong>Gabriela Brandão </strong>– Marketing Digital na Deloitte Brasil, responsável pelo conceito original e líder de projeto.</p>\n<p><strong>Guilherme Sabino</strong> – Programador qualificado para desenvolvimento de produtos em diversas plataformas, web e mobile, responsável pela construção do game.</p>\n<p><strong>Jonatas William</strong> – Programador na Uranet Projetos e Sistemas; Technical artist e responsável pela construção do game.</p>\n<p><strong>William Botura </strong>– Game designer e CEO do Arcadya Studio, responsável pelo planejamento e design dos desafios.<br/></p>\n<p>________________</p>\n<p><strong>Contato: </strong>playonedollar@gmail.com</p>", "metacritic": null, "released": "2018-07-29", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/342/342be8a117864b3261e0c18deef0495d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 34, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["OneDollar"], "genres": ["Puzzle", "Platformer"], "publishers": [], "esrb_rating": null}