{"id": 1666, "slug": "dungeon-gems", "name": "Dungeon Gems", "name_original": "Dungeon Gems", "description": "Join players from all around the world in a quest to defeat the dragons! <br/>Experience thrilling, fast-paced puzzle gameplay with strategic RPG-style party management.<br/> <br/>EASY TO LEARN - HARD TO MASTER<br/>» Drag your finger over elemental runes to link them and trigger your heroes’ attacks.<br/>» Link like-colored runes to launch focused attacks or…<br/>» Link differently-colored runes to unleash devastating multi-element attacks, but beware: These will cost you precious Action Points.<br/><br/>RECRUIT A DARING PARTY<br/>» 220 powerful warriors await your summons.<br/>» Choose wisely: Each warrior can launch a different elemental attack, but is vulnerable to an element as well.<br/>» Power up your favorite warriors, then evolve them into new, legendary forms!<br/><br/>YOU DON’T HAVE TO FIGHT ALONE<br/>» There’s always someone ready to help you in your quest, be it a friend or a complete stranger.<br/>» Choose your allies wisely, as you need the right kind of strength to defeat particular foes.<br/>» Compare your progress to your friends’ and gain bonuses when completing dungeons together.<br/><br/><br/>Notes: <br/>Dungeon Gems is free to download and play. However, there are in-app purchases available to expand upon your gameplay experience. If you do not wish to use these features, you can disable in-app purchases in your device’s settings.<br/>A network connection is required to play.<br/>In-app purchases are available via the “Shop” icon within the app.<br/>Please refer to In-App Purchases for the price tiers.<br/>Dungeon Gems requires an iPad 2 (or newer), iPhone 4s (or newer), or iPod touch (5th generation).<br/><br/>_____________________________________________<br/><br/>Visit our official site at http://www.gameloft.com<br/>Follow us on Twitter at http://glft.co/GameloftonTwitter or like us on Facebook at http://facebook.com/Gameloft to get more info about all our upcoming titles.<br/>Check out our videos and game trailers on http://www.youtube.com/Gameloft <br/>Discover our blog at http://glft.co/Gameloft_Official_Blog for the inside scoop on everything Gameloft.<br/><br/>_____________________________________________<br/><br/>This app allows you to purchase virtual items within the app and may contain third party advertisements that may redirect you to a third party site.<br/><br/><br/>Privacy Policy : http://www.gameloft.com/privacy-notice/<br/>Terms of Use : http://www.gameloft.com/conditions/<br/>End User License Agreement : http://www.gameloft.com/eula/", "metacritic": null, "released": "2014-06-19", "tba": false, "updated": "2019-10-22T14:27:48", "background_image": "https://media.rawg.io/media/screenshots/040/040f1e929168f6dc255f9c76b684196a.jpeg", "website": "http://www.gameloft.com/iphone-games/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 194, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Gameloft"], "genres": ["RPG", "Puzzle"], "publishers": ["Gameloft"], "esrb_rating": "Teen"}