{"id": 16660, "slug": "strategic-war-in-europe", "name": "Strategic War in Europe", "name_original": "Strategic War in Europe", "description": "Strategic War in Europe takes you back in time to World War 2. <br/><br/>This game is about:<br/>Panzer Corps<br/>Waves of Infantry<br/>World War 2<br/>Land, Naval and Air battles<br/>Providing supplies<br/><br/>Following the 'easy to learn, hard to master' design principle, Strategic War in Europe combines accessibility with a plethora of strategic options. A compact, large-scale map and clear basic rules will not overwhelm you, yet the choices you will be presented with should satisfy all your tactical needs. From overthrowing governments and researching new technologies, to securing air supremacy and supplying your troops by water and railway, Strategic War in Europe is a strategist's dream. <br/>Seven scenarios with up to 25 controllable countries, each with five scaling difficulty settings make for an incredible replayability. When pitching yourself against the AI is not enough, Strategic War in Europe offers hot-seat and PBEM for all your multiplayer needs. Match your wits in an epic East vs. West showdown or try to survive together as Poland and Norway.<br/><br/><strong>Muster Your Panzer Corps!<br/>Prepare Waves Of Infantry!<br/>The War Begins Now!</strong><br/> <br/> <br/>  Main Features<ul><li>Take over one or more of 25 countries, ranging from Nazi Germany to Iraq<br/></li><li>Play through seven unique scenarios, including six historical from 1939 to 1944, and a fictional 1945 West vs. East campaign<br/></li><li>Command hundreds of historical units and leaders<br/></li><li>Declare wars, host elections and carry out coup d'etats<br/></li><li>Experience dozens of historical events with great repercussions on gameplay<br/></li><li>Enjoy tactical battles, with weather, supplies and terrain all being important factors<br/></li><li>Control the skies with air combat, recons, fighter interceptions, bombardment, and even nukes!<br/></li><li>Sail the seas using a naval system that includes convoys, raiders and sea battles<br/></li><li>Manage economy and research<br/></li><li>Fight against your friends in hot-seat and Play By E-Mail multiplayer modes</li></ul>", "metacritic": null, "released": "2014-03-21", "tba": false, "updated": "2019-09-17T08:17:20", "background_image": "https://media.rawg.io/media/screenshots/1ae/1ae5b5680e9aaf2df8ef733c21786b76.jpg", "website": "http://wastelands-interactive.com", "rating": 0.0, "rating_top": 1, "added_by_status": {"yet": 7, "owned": 254, "dropped": 2}, "playtime": 5, "achievements_count": 64, "ratings_count": 5, "suggestions_count": 279, "game_series_count": 0, "reviews_count": 5, "platforms": ["PC"], "developers": ["Wastelands Interactive"], "genres": ["Strategy", "Indie"], "publishers": ["Wastelands Interactive"], "esrb_rating": null}