{"id": 166780, "slug": "ret", "name": "RET", "name_original": "RET", "description": "<p>Hey everyone,</p><p>RET is an experimental voice based cooperative FPS. It has been created as part of my master thesis. </p><p>I am conducting some research for my master thesis on voice communication in games, more specifically how designers can mitigate feelings of anxiousness when talking to new groups of players in online games. In order to explore this I have created a small cooperative FPS game designed for groups of three players. I would tremendously appreciate if you could take the time to play it with other players and fill out the survey afterwards.</p><p>The game takes around 5-10 minutes to complete depending on how well you work together. There are three roles DPS, Tank and Healer that you will be assigned randomly when joining. You are able to swap roles with other players at any time and is required at some points. </p><p>The game does require that you have a microphone!</p><p>The game has 3 versions that are possible to be played, one of these doesn't require voice and instead uses text based chat. </p><p>Due to its nature you may find yourself waiting for more players. The only way to mitigate this is by getting more people to play so please feel free to share it around!</p><p>Troubleshooting:</p><p>Can't connect? Try restarting.<br/><br/>Mic not working? Try restarting.</p><p>Got stuck somewhere or broken the game? email(khicks@lincoln.ac.uk) or tweet(@Kieran_Hicks) and berate me for making a buggy game.</p>", "metacritic": null, "released": "2016-07-08", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/529/52923d69d42ce147eeeb31995e8e5544.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 11, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Nakash"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}