{"id": 166850, "slug": "arcade-room", "name": "Arcade Room", "name_original": "Arcade Room", "description": "<p>Welcome to the Arcade!</p><p>Here you can get hands-on action (yes, your actual hands!) in a virtual arcade room. In here, you can play darts and take turns with your friends at the strength tester, while getting hi scores for bragging rights.</p><p>There is a another feature in there, if you want, you can slap the guy that gives that annoying speech. We don't condone violence, but hey, we won't blame you if your hand slips :). If you are going to do it, a word of advice, don't abuse it, as it will have consequences. Don't say we didn't warn you!</p><p>Update version to 1.1.1:</p><p>- beware of the Hulk when slapping the guy!</p><p>- for convenience sake, if the game does not detect a Leap Motion controller it will automatically default to mouse/keyboard controls, so that you don't have to :)</p><p>- revamped quality settings to better suit a more broader range of machines, settings are now (from low to high): Yucky, Meh, Decent and Purty. I recommend starting with Purty and working your way down until you find the right fps for you</p><p>- fixed some animation trigger issues that would occasionally prevent the guy from properly responding to your slaps</p><p>- fixed some minor material issues (shiny teeth and non-shiny eyes)</p><p>Updated version to 1.1:</p><p>- better looking animations &amp; blending (including lip-sync)</p><p>- added emotions for talk animations</p><p>- resolved a nasty issue when switching to mouse control that would constantly spin the room</p><p>- revamped animation state machines to be able to slap the guy at any moment (including being able to interrupt his initial speech)</p><p>- the guy can now block your slaps</p><p>- added and changed some existing slap reactions</p>", "metacritic": null, "released": "2015-11-09", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/4c8/4c8a8f3f8d19c2267ff23defdbdd3904.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 149, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["rotsin"], "genres": ["Action", "Simulation", "Sports"], "publishers": [], "esrb_rating": null}