{"id": 16692, "slug": "sins-of-a-solar-empire-trinity", "name": "Sins of a Solar Empire: Trinity", "name_original": "Sins of a Solar Empire: Trinity", "description": "In Sins of a Solar Empire: Trinity, you are the leader of a civilization embroiled in a galactic war, fighting for the survival of your entire race against relentless foes. Your success will depend entirely on your ability to manage your empire and command your vast fleets of starships to victory.<br/>\t\t\t\t\t\tSins of a Solar Empire: Trinity is a “RT4X” game, blending the epic strategy and empire management of the 4X genre (Explore, Expand, Exploit, Exterminate) with the fast-paced and tactical elements of real-times strategy. <br/>\t\t\t\t\t\tKey features:\t\t\t\t\t\t<ul><li>Explore the epic scale of a dynamic 3D galaxy featuring planets, asteroids, plasma storms, stars and more.<br/> </li><li>Take on multiple roles as you seamlessly transition between the role of emperor and fleet commander using Sins’ unique strategic zoom.<br/> </li><li>Extensive diplomatic and economic strategies are yours to wield to your advantage. Forge alliances, establish powerful pacts with allies to open up new bonuses, setup trade between empires and use pirates to take out over-powered tyrants.<br/> </li><li>Fight epic battles with hundreds of ships on-screen at once, with up to 10,000 particles firing off in full-out combat.<br/> </li><li>Seamless zoom in and out, from looking at a one-man fighter to viewing your entire empire spanning billions of kilometers of space.<br/> </li><li>Defend your worlds by constructing massive starbases, deploying deadly minefields, and researching advanced defensive technologies.<br/> </li><li>Create strong alliances and gain powerful pact bonuses using the all new diplomacy system.<br/> </li><li>Bribe or hire pirates to wipe out your opponents, but beware, the pirates gain strength over time and can also be used against you!<br/> </li><li>Play online with up to 10 friends via Ironclad Online.</li></ul>", "metacritic": 87, "released": "2010-02-08", "tba": false, "updated": "2022-09-03T03:55:41", "background_image": "https://media.rawg.io/media/screenshots/4cc/4ccbf99ffa5837ee1d7828b706bee109.jpg", "website": "http://www.sinsofasolarempire.com", "rating": 2.78, "rating_top": 4, "added_by_status": {"yet": 33, "owned": 578, "beaten": 6, "toplay": 7, "dropped": 7}, "playtime": 1, "achievements_count": 0, "ratings_count": 18, "suggestions_count": 292, "game_series_count": 0, "reviews_count": 18, "platforms": ["PC"], "developers": ["Stardock Entertainment", "Ironclad Games"], "genres": ["Strategy"], "publishers": ["Stardock Entertainment"], "esrb_rating": null}