{"id": 166998, "slug": "strayspells", "name": "Strayspells", "name_original": "Strayspells", "description": "<p><strong>Strayspells is a game with lots of magic, creatures,</strong><strong> monsters. Ice, fire, earthquakes, floods, vortexes, portals, walls, blizzards, ufos, and</strong><strong> blobs</strong><strong>... Yes, blobs!</strong><br/></p>\n<p><strong> Figure out ways to survive with a wide variety of magic!</strong><strong> There is a big adventure mode that I have taken many steps to make as versatile and enjoyable as possible. You can play custom games with coop hot seat multiplayer, or single player, and there is also a versus game type to put your strategic skills up against each other.<br/></strong></p>\n<p><strong>The battle part of the game is easy to get into as it is pretty much just selecting spells and using them somewhere. When and where to use them is another matter though.<br/></strong></p>\r\nThe Essentials:\r\n<ul><li><strong>No adventure or custom game will ever be the same for any player, any time.<br/></strong></li><li><strong>Choose your own style of play in adventure, and embrace the consequences.<br/></strong></li><li><strong>Entertaining dialogue. With a good spoonful of crazy.<br/></strong></li><li><strong>An incredible never ending amount of weird items to laugh about.<br/></strong></li><li><strong>A huge variety of magical items is possible, ready for use on the battlefield.<br/></strong></li><li><strong>Simulated human bots and standard bots that you can play custom games with.<br/></strong></li><li><strong>Delightful hand crafted music that I spent truckloads of hours on.</strong></li><li><strong>Original retro flavor sounds.</strong></li><li><strong>Voice alerts for when things get dangerous. Or at other important events.</strong></li><li><strong>Built in random background generator, in case anyone wants to use it.</strong></li><li><strong>Real time or turn based play entirely up to player.<br/></strong></li><li><strong>And pause game flow at any time to easily think about what to do.<br/></strong></li><li><strong>Fast spell previews to see what spells you can use on what units.</strong></li><li><strong>Humorous score ratings at adventure completion.</strong></li><li><strong>Low/high resolution graphics for low/high screen or window resolutions. <br/></strong></li><li><strong>Anyone can draw and design any kind of units, and add them to the game.<br/></strong></li><li><strong>Anyone can also make entire new themes for the game.</strong></li></ul>\n<p>Are you tired of micromanaging your units in other games? In this game, you can relax about that. Units in this game have a mental state that will likely be changed several times throughout a game. You can not tell your minions where to go unless you make them obedient. consequently it means that your enemies are open to be distracted, confused, and pacified, or just straight up subverted at the mercy of you and your army's spells. A powerful enemy army is no good if it starts fighting between themselves, or if they are just watching television.</p>\n<p>Units can also be frozen, turned into a statue, be undead, and even be a ghost. Or a mix of  those. All of which have negative and positive effects. Except for camouflaged and armored units.</p>\n<p><strong>IMPORTANT: This game needs Directplay enabled in Windows. More details of this is in install instructions.</strong><br/></p>\n<p>Hope you will enjoy.<br/></p>", "metacritic": null, "released": "2017-09-18", "tba": false, "updated": "2019-08-28T23:21:39", "background_image": "https://media.rawg.io/media/screenshots/461/461b5142540765ef55779f420ee016d1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 111, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Selfuniverse"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}