{"id": 16691, "slug": "sky-break", "name": "Sky Break", "name_original": "Sky Break", "description": "Humanity is threatened. A deadly virus is rapidly spreading.\t<br/>The particular flora of Arcania, a planet once used by humans for space colonization, may help in the creation of a cure. But the planet has been abandoned ever since working drones turned against humans.<br/>A group of researchers has been sent to this planet to find a solution. You are one of them.<br/>But as you arrived, your spaceship crashed…<br/><br/>Hack and command mechasMechas are wild and are used to living in the storm. You must fight some of them for your survival, but they are often stronger than you are. <br/>Your best chance of survival is to hack some of those mechas and use them as allies to defeat the others.EvolveThe more combats you win, the more fragments you earn. They can be used to evolve your mechas' strength and skills. But you can also find some during exploration.<br/>Your character can also improve its capabilities.The StormThe weather is a major threat. You must deal with lightning strikes, tornadoes, and other elements in order to make your way through the storm. You will be able to activate old installations used to ionize the air and stop the storm within an area. Thankfully an old abandoned station that sits above the clouds provides good shelter.The SpaceshipYou have access to your spaceship early in the game, but you do not have enough fuel to leave the planet.<br/>It is impossible to land in the storm, but once you have unlocked some weather controllers, you will be able to quickly travel across the map and save a lot of time.", "metacritic": null, "released": "2016-10-21", "tba": false, "updated": "2023-02-07T02:10:51", "background_image": "https://media.rawg.io/media/screenshots/707/7077d55b75b9a5e8e5c401b5f5f645f7.jpg", "website": "http://www.farskyinteractive.com/skybreak/", "rating": 3.22, "rating_top": 4, "added_by_status": {"yet": 7, "owned": 195, "beaten": 3, "dropped": 5, "playing": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 9, "suggestions_count": 498, "game_series_count": 0, "reviews_count": 9, "platforms": ["macOS", "PC", "Linux"], "developers": ["Farsky Interactive"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["Farsky Interactive"], "esrb_rating": null}