{"id": 166934, "slug": "cute-mermaid-sea-adventure-mermaid-games", "name": "Cute Mermaid Sea Adventure: Mermaid Games", "name_original": "Cute Mermaid Sea Adventure: Mermaid Games", "description": "<p>Welcome to epic mermaid world in water swimming with endless fun and mermaid ocean attack adventure. Race your cute mermaid and attack on monster sharks. This is a mermaid 3d simulator game full of endless fun and hunting attack enjoyment. Different water surfing mermaid are available for ocean adventurous attack. Select your own deadly mermaid and perform fish hunting in sea water in this mermaid 3d simulator game. Occupy your virtual mermaid world and attack on different ocean ship boats, destroy them and also hunt other fishes or monster sharks to live a happy life. Look forward to hunt wild sea animals with horrible mermaid. <br/><br/>Crazy Mermaid princess with full makeup will be hungry; as it will sea different wild sea animals it will perform water swimming towards them and perform underwater ocean attack. Some insane monster sharks will attack reversely on mermaid princess but you have to run towards your virtual mermaid world to avoid sea whale attack. You have to hunt blue water whale before its adventurous attack on you. Fight with wild sea animals and be the best mermaid fish hunter. Following activities you have to perform in this game for mermaid survival. <br/><br/>Mermaid deadly boats attack, mermaid race and mermaid insane sea animals attacking hunt. Cute mermaid furious attack with full power in each mission will clean his virtual mermaid world and after that it will be free to wander and swim in blue water. Smooth and realistic mermaid fish hunter controls has been designed to have cute mermaid princess racing and sea animals hunting experience. Beautiful wild sea animals including tortoise, deadly monster sharks, water snakes and fishes animations have been designed to feel you real time hunting adventure and diving underwater experience.<br/><br/>Just download and install this water surfing mermaid simulator attack game and enjoy its hunting attacks in ocean blue water. Every aged person including kids can enjoy this game. Kids mermaid game is very realistic and adventurous ocean mermaid fish hunting game. It also includes fight with whale and real deadly animals for mermaid survival. Don’t miss a chance to have great fun with real cute mermaid in blue ocean water. Water surfing mermaid is one of the best mermaid games available on Google play store.<br/><br/>Features of Cute Mermaid Sea Adventure: Mermaid Games<br/><br/>-\tA beautiful and cute mermaid available <br/>-\tWild sea animals e.g. wild snake and deadly monster sharks to hunt and kill<br/>-\tBeautiful and real ocean environment<br/>-\tSmooth and realistic mermaid race controls<br/>-\tJoystick to control real mermaid<br/>-\tSimple and easy gameplay of this real mermaid game<br/>-\tFree to install and enjoy in the virtual mermaid world<br/>-\tAdventurous mermaid fight with monster sharks and other sea animals<br/>-\tBeautiful and real mermaid animations<br/>-\tRealistic animations of adventurous ocean animals <br/><br/>Now just install this Cute Mermaid Sea Adventure: Mermaid Games and enjoy its above listed features. Give your positive feed after playing this cute and real mermaid game.</p>", "metacritic": null, "released": "2018-02-08", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/f61/f617db36fb42f5c9ffbf680b320c615b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 136, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["MadMaxGames"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}