{"id": 167143, "slug": "abandoned-bunker", "name": "Abandoned Bunker", "name_original": "Abandoned Bunker", "description": "<p>Deep in the woods, next to a disused road, is a fenced off area with a sign on it that says “DANGER abandoned facility KEEP OUT”, inside is a full blown abandoned bunker, just waiting for a urban explorer photograph its decaying beauty. So you decide to go and find it.\r\nAfter walking along an old overgrown road for over an hour you get to the fence and climb over. Past some strange pipes sticking out of the ground you find a small hatch which you open and look in. You see a long shaft with some old metal rungs, leading down in to complete darkness, and decide to climb down it. While climbing down, the rung you are holding breaks off the wall, and you fall down in to the dark bunker below. Now with no way to climb back up and only a flashlight, glowstick and camera for light, you must find a way to escape.\r\nAs you explore you find notes from the people who worked there which describe the last days of operation of the bunker and as you piece together what happened it becomes clear that the bunker was closed down for a good reason.\r\nWhat were they working on in there?\r\nWhy was it closed down?\r\nAnd could anything STILL BE ALIVE?\r\nThis is a horror experience designed to be played in vr (or at least a dark room with headphones).\r\nIt will contain loud noises, dark and claustrophobic bunkers, strobe lighting (can be disabled from pause menu) and intense jumpscares.\r\nI hope you enjoy it.<br/></p>\n<p>CONTROLES:</p>\n<p>\r\nmove = wasd / left stick</p>\n<p>run = shift / LB / RB <br/></p>\n<p>crouch = C (keyboard) / B (xbox) <br/></p>\n<p>interact = left click / RT <br/></p>\n<p>camera flash = F (keyboard) / X (xbox) only used in bunker 3 <br/></p>\n<p>center hmd = R (keyboard) / back (xbox) </p>\n<p>HOW TO PLAY:</p>\n<p>Keep exploring the bunkers until you find the exit.</p>\n<p>There are notes at fixed locations in the bunkers.</p>\n<p>A black crosshair means you can interact.</p>\n<p>Lockers can be opened using RT + RS or click and drag though no crosshair is displayed.</p>\n<p>The camera flash level can be made easier by disabling strobe lighting from pause menu.</p>\n<p>If you get lost you can enable the guidance system from pause menu. Only use this to complete a level if you are finding it to frustrating or are having trouble getting all the notes.</p>\n<p>Enjoy the fear and remember places like this really exist.</p>\n\n<p>SYSTEM REQUIRMENTS:</p>\n<p>A reasonable windows 64-bit gaming pc with at least 720p monitor.</p>\n<p>A vr headset is recommended as it makes it MUCH MORE SCARY</p>\n<p>The graphic can be configured from main menu (setting shadows to high will have large performance hit in first and last levels recommend setting to medium).</p>", "metacritic": null, "released": "2018-03-11", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/cdf/cdfe6d571c718934ebff30beb56185f2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 280, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["jshalse"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}