{"id": 167177, "slug": "supremaship-alpha", "name": "SupremaShip (Alpha)", "name_original": "SupremaShip (Alpha)", "description": "<p><em>Current version: Alpha 0.4.0</em></p>\n<p>Get early builds and live updates by joining the Discord!<br/>Get to the soundtrack!</p>\n<p><strong>SupremaShip</strong> is a single-player 2D top-down space shooter with a few roguelike elements about teamwork with AI controlled ships. The game uses an Asteroids-like visual style upgraded to 1000%. This game has a heavy emphasis on teamwork, meaning it can’t be beaten alone. The player’s objective is to destroy the enemy mothership with their fellow ships.<br/><br/><strong>Main features<br/></strong>- Teamwork system<br/>    - Ships follow the leader (or closest ship with highest XP)<br/>    - Ships ask for help and help other ships asking for help<br/>    - Ships can attack an enemy that the player selects if they’re the leader<br/>    - Ships flee when outnumbered<br/>- 7 different ship types in which 5 of them have unique abilities<br/>- 3 weapon types<br/>- 5 ship upgrades<br/>- Dynamic soundtrack<br/>- No HUD (there won't be any)<br/>- Roguelike elements:<br/>    - Permadeath... kinda (when the player dies, they can choose to respawn at the mothership and their ship type is selected randomly, all XP is lost and some other things or they can quit the game and lose all progress)<br/>    - Items (health, nuke and shield)<br/>    - Difficulty (not much at the moment, actually... but one of this game’s goals is to provide a challenging experience)<br/>    - Fair gameplay (all ships behave the same way so no one has an advantage over anyone)<br/>    - Procedural generation (asteroids, mines and the protector ships are procedurally placed on the map)<br/>    - No invincibility frames<br/><strong><br/>Features to be added<br/></strong>- Intro cutscene<br/>- Menus (main, options, pause etc)<br/>- Boss phase 2<br/>- Credits <br/>- Achievements<br/><br/><strong>Don't know where to give feedback? You can either join my Discord server and get early builds, previews and updates or just comment on this page. </strong><strong>(If you join the server soon enough and help a lot, you'll be in the credits as an alpha, beta and release candidate tester in the 'Special Thanks' part, however, if you leave the server, all your progress will be lost)<br/><br/></strong><strong>PLEASE NOTE: This is my first attempt on creating a full game on my own so don't expect super high quality music, sounds effects and art, those will improve over time, but hopefully they don't suck. It's also the reason why this game is free.</strong></p>", "metacritic": null, "released": "2018-06-28", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/2ec/2ec6398baa723e7cece9fa373dbf265b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 92, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["LevyMarCiS"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}