{"id": 167258, "slug": "chant-savant", "name": "Chant Savant", "name_original": "Chant Savant", "description": "<p>\r\n\tChant! Use your microphone to summon creatures from beyond! Learn new Runes, new Creatures, new Tactics. Graduate!\r\n</p><p>\r\n\tChant Savant is a Lovecraft themed game where you chant into your microphone to summon monsters to fight for you. For example:\r\n</p><ul>\n<li> <strong>\"Enir Ogrdu Zur\"</strong> would summon a monster with tons of health and an attack that can petrify other monsters!<br/>\n</li>\n<li> <strong>\"Yog Cuthulhu Ia\"</strong> would summon a monster with damage reflection, that will split into several sub-monsters on its death. The child monsters will also have damage reflection!\r\n\t</li>\n</ul><p>\r\n\tBy speaking the different Runes into your microphone, you will shape your creatures and give them a dozens of powers and advantages. You will learn to combine the ~40 power Runes to overcome enemy summoners, counter their creatures, and become a true Chant Savant. Matches are fast and decisive, as each Rune is hard-countered by other Runes. A single mis-chant is usually enough to end a match.\r\n</p><p>\r\n\tThe game has 3 modes of play. There is a Campaign mode, where you enter the Esoteric Academy and gradually earn Runes and upgrades on your path towards Graduation. There is a Skirmish mode where you have access to all 40 Runes and face increasingly difficult opponents. And finally, there is a Multiplayer mode (in development), where you can pit your Chanting skills against human opponents.\r\n\t<br/>\n</p><p>\n<br/>\n</p><p>\n<strong>Notes:</strong>\n</p><p>\r\n\t- This game is best when played with a microphone. You can play it without a mic, but you are losing 60% of the fun.\r\n</p><p>\r\n\t- The voice recognition program is Windows only, so for now the game is, well, Windows only.\r\n\t<br/>\n</p><p>\n<br/><br/><strong>Update Notes:</strong><br/>Update 4-2-2016: After a *loooong* hiatus I am coming back finish up the final bits and do some bug fixing and polishing. The newest version has a couple dozen small improvements and bug fixes. In particular, there are a number of options to make the game faster and more interactive. The main one is something I like to call \"Taint Sparkles\", which are magical motes that are generated during battle and can be harvested. So now you have something to click on and do besides just thinking about your next move. :) I've also added a bug reporter, so if you can see any problems you can mail them directly to me from inside the game. The tutorial has also been improved a bit, I think.  There will probably be more updates in the future as I continue play testing.<br/>\n</p>", "metacritic": null, "released": "2016-04-28", "tba": false, "updated": "2019-08-28T23:21:38", "background_image": "https://media.rawg.io/media/screenshots/8da/8da92d3bee7dd364cb647b7b37b3b961.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 139, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MuffinKitten"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}