{"id": 16721, "slug": "wars-of-napoleon", "name": "Wars of Napoleon", "name_original": "Wars of Napoleon", "description": "AGEod goes back to the Napoleonic era and delivers the most detailed and comprehensive strategy game ever created about a time of struggle and conquest that forged modern Europe.<br/><br/>The engine has been refined to better represent the peculiarities of the period, allowing players to think and act as commanders of the Napoleonic era.<br/><br/>You are now able to manage the complexities of armies organization and logistics in a very detailed political setting, where each contender plays a vital part to the final outcome.<br/><br/>Establish your dynasty over most of Europe as Napoleon, or get rid of the Revolutionary tyrant as Britain. Also play as one of the other main contenders of the time such as Austria, Russia, Prussia, Spain or the Ottoman Empire and emerge amongst the victorious powers!<br/><br/>New to the game? Check out the video tutorials below<br/><br/>youtu.be/CmUCKpssdXQ<br/><br/>Change History! Discover how Napoleon could have been able to invade England in this great scripted video!<br/>youtu.be/ekKbBA6o8hM<br/><br/><strong>Scenarios</strong><br/><br/><ul><li>Grand Campaign 1805-1815 with 2 starting dates (January &amp; August)<br/></li><li>Austerlitz Campaign 1805<br/></li><li>Jena Campaign 1806-1807<br/></li><li>Waterloo Scenario June 1815</li></ul><br/><strong>Military</strong><br/><br/><ul><li>Create armies and corps and manage how they support each other<br/></li><li>Lead mighty fleets of ships that can intercept, bombard, and disembark troops.<br/></li><li>Check your supply network, create depots, forage the land while you march or pillage the enemy regions if the rest fails.<br/></li><li>Build new units with a brand new system of ‘create and gather’ system.<br/></li><li>Two set of uniforms for most soldiers depending on army reforms. More than 300 different uniforms from accurate sources, and over 400 portraits of generals redone from historical paintings and sources.<br/></li><li>Numerous historical options, including reforming your nation and army the way you want.<br/></li><li>New interface to promote your generals or see the hierarchy of your army more easily.<br/></li><li>You can guide your allies, if they are AI nations, so you get the most out of them.<br/></li><li>New history screen where you can check the evolution of your army and the army of your enemies.<br/></li><li>Form or disband divisions and appoint generals to lead them.<br/></li><li>Promote generals but beware of the political support of some, if they are bypassed in favour of young promising officers.<br/></li><li>Lead expeditionary forces assisted by allies and minor nations.<br/></li><li>Use special orders like forced march, build redoubts, disband units.<br/></li><li>Muster partisans and levy special emergency troops.</li></ul><br/><strong>Political</strong><br/><br/><ul><li>Play one among seven major nations: France, Great Britain, Prussia, Russia, Austria, Spain, and Ottoman Empire.<br/></li><li>Diplomacy with casus-belli, coalitions, defensive treaty, passage rights and more.<br/></li><li>Send monetary help, gain access to special units and dozens of historical options completely customizable for the major nations.<br/></li><li>Draft your population, use smugglers, develop your territories and many more decision cards.<br/></li><li>Large chain of events with multiple possibilities dealing with the insurrections in Spain or special peace treaties.<br/></li><li>Custom faction modifiers that give your nation a specific feel (e.g. as France, reward your talented generals with The Légion d’Honneur)<br/></li><li>Handle your resources carefully, like money, guns and horses. Each country has strengths and weaknesses.<br/></li><li>Form or disband satellite nations.<br/></li><li>France and Great Britain can form super alliances against one another.<br/></li><li>As France or Great Britain, try to get the upper hand in the Continental Blockade.</li></ul><br/><strong>Special Features</strong><br/><br/><ul><li>\"What if?” options that you can enable or disable, to shape the course of the war in line with your strategy (e.g. Ensure that The United States  sides with France against Great Britain in 1812).<br/></li><li>A very large map of Europe with over 4,000 regions and also special areas like the West Indies, North America, Persia and India.</li></ul>", "metacritic": null, "released": "2016-05-06", "tba": false, "updated": "2019-08-28T22:10:48", "background_image": "https://media.rawg.io/media/screenshots/646/646b4f6d92eb6f298d1d838a0ec8667e.jpg", "website": "http://www.matrixgames.com/products/593/details/Wars.of.Napoleon", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 5}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 339, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ageod"], "genres": ["Strategy"], "publishers": ["Slitherine"], "esrb_rating": null}