{"id": 167454, "slug": "the-angelina-game-player", "name": "The ANGELINA Game Player", "name_original": "The ANGELINA Game Player", "description": "<p>ANGELINA is an AI system that can design simple games, made by Mike Cook, an AI researcher at Falmouth University. The latest version of ANGELINA makes games that are little text files, but in order to play them you need this application. Drop one of ANGELINA's games in the 'Games' folder, and start the app. You should see it in the main menu.<br/></p>\n<p><strong>Current Games:</strong><br/></p>\n<p><em>Before Venturing Forth</em>: a game based on the 'Adventure' template game used by some AI projects. Mike gave ANGELINA the rules, and ANGELINA designed the levels (but in a way that completely twists the original idea behind the game!)</p>\n<p><em>Ace Comcat</em>: a simple puzzle game about guiding mice to cheese. Designed live at Eurogamer's Rezzed expo, London, 2018.</p>\n<p><em>Acow For</em>: a much harder puzzle game about avoiding loss. This one takes some thinking to work out. Designed live at Eurogamer's Rezzed expo, London, 2018.</p>\n<p><strong>What Is ANGELINA?</strong><br/></p>\n<p>If you're curious to learn more about the tech behind ANGELINA, I'm always writing papers and giving talks. Here are some recent ones:</p>\n<p>Redesigning Computationally Creative Systems - a talk about the philosophy behind the new ANGELINA, given in June 2018</p><p>You can find out more about our work on the project website.</p>", "metacritic": null, "released": "2017-10-06", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/d9c/d9cdd2d5f9b7cd0919ff1e0af0fb388c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 6, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Games by ANGELINA"], "genres": [], "publishers": [], "esrb_rating": null}