{"id": 16770, "slug": "qbeh-1-the-atlas-cube", "name": "Qbeh-1: The Atlas Cube", "name_original": "Qbeh-1: The Atlas Cube", "description": "Created by Liquid Flower, QBEH-1: The Atlas Cube is a prequel to their much beloved Qbeh, a small student project that found its way online and into the hands of gamers and journalists alike who wanted more after feasting on the appetizer. Now, QBEH-1: The Atlas Cube builds on the core concept and aesthetics introduced in the original and brings even more polish, passion and gameplay into the new game. <br/><br/>Now includes a LEVEL EDITOR with STEAM WORKSHOP support! Build your own levels then share and play those made by the community.MAIN GAME FEATURES:<ul><li>Solve elaborate puzzles using a variety of Cube types such as Building Blocks, Energy Cubes and Gravity Manipulators <br/></li><li>Explore atmospheric Worlds, each with 6 challenging levels and unique themes<br/></li><li>Discover alternate paths, intriguing platforming elements and secrets to unlock an unfolding mystery<br/></li><li>Experience an immersive &amp; mesmerizing Soundtrack that pulls you into the adventure<br/></li><li>Uncover the game’s narrative through interpretive imagery<br/></li><li>Oculus Rift Support (supports DK1 &amp; DK2)</li></ul>STEAM WORKSHOP FEATURES:<ul><li>Create levels using similar (world) styles found in the game<br/></li><li>Mix and match styles from multiple themes in one level<br/></li><li>Add doors, switch activated doors, moving platforms, fans and more<br/></li><li>Add special cubes (basic, energy, gravity and force)<br/></li><li>Add geometry blocks such as walls and floors with different styles<br/></li><li>Move, resize and rotate objects (only geometry blocks are resizable)<br/></li><li>Change lighting and add light cubes as light sources<br/></li><li>Change skybox<br/></li><li>Select your background music from tracks available in the game<br/></li><li>Test levels right in the editor<br/></li><li>Share levels through Steam Workshop<br/></li><li>Play levels made by others</li></ul>", "metacritic": 72, "released": "2014-05-15", "tba": false, "updated": "2023-09-02T16:27:05", "background_image": "https://media.rawg.io/media/screenshots/a62/a629531eb72e494e5ddd3dd21bf87822.jpg", "website": "http://qbeh-1.com/", "rating": 3.14, "rating_top": 4, "added_by_status": {"yet": 10, "owned": 305, "beaten": 6, "toplay": 1, "dropped": 4}, "playtime": 4, "achievements_count": 17, "ratings_count": 14, "suggestions_count": 264, "game_series_count": 0, "reviews_count": 14, "platforms": ["macOS", "PC"], "developers": ["Liquid Flower"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Digital Tribe"], "esrb_rating": null}