{"id": 167843, "slug": "blockz", "name": "Blockz", "name_original": "Blockz", "description": "<p>Durante uma exploração em um planeta distante você ficou preso. Milhares de blocos o separam da sua liberdade. Mas a fuga não será uma tarefa fácil. Parece que alguém conhece seus planos e assegurará que você não terá sucesso. Mas nem tudo está perdido. Um poder estranho está interferindo a seu favor. Você pode ser uma nova peça no meio de uma antiga batalha.</p>\n<p>Seu objetivo é destruir os blocos com a bola, evitando que ela caia, além de coletar os itens que te ajudaram a progredir no logo. Cada nível traz novos desafios e novos itens especiais. Alguns deles é melhor serem evitados.</p>\n<p>OBS.:<br/>O jogo é independente e ainda está em desenvolvimento. A primeira fase já está plenamente disponível, e seu sucesso será salvo para futuras atualizações.</p>\n<p>______________________________________________________________________________________<br/></p>\n\n<p>You was trapped during an exploration in a distant planet. Thousands blocks are between you and your freedom. The escape will not be an easy task. But It seems a stranger power is interfering in your favour. It's like you ar a new piece in an old battle.</p>\n<p>Your goal is to destroy the blocks with the ball, avoiding its fall, beside collecting itens that will help you progress in the game. Each level brings new challenges and new special itens. Some of then is better to be avoided.</p>\n<p>This is an independent game and is still in development. The first level is already made and its functional, your progress will be saved for future updates.</p>", "metacritic": null, "released": "2017-12-31", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/c45/c45aa54af8060a160f3978af127db2ef.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 66, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux"], "developers": ["Guilherme Tognetti"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}