{"id": 16791, "slug": "midnight-club-2", "name": "Midnight Club 2", "name_original": "Midnight Club 2", "description": "<p>Midnight Club 2 is an arcade open-world racing game developed by Rockstar San Diego. It is the direct continuation of Midnight Club: Street Racing and is the second game of the series.</p>\n<h3>Plot</h3>\n<p>There is little story present in the game. The unnamed main protagonist sets out to defeat all the racers from the Midnight Club street racing team to make his way to the top. </p>\n<h3>Gameplay</h3>\n<p>Like the first game of the series, Midnight Club 2 focuses on street racing. The players can free roam in Los-Angeles, Paris, and Tokyo. The game features a dynamic day-night cycle and a sophisticated real-time weather system. </p>\n<p>The main game mode is the Career Mode. The goal of the Career Mode is to defeat all the members of the Midnight Club racing team. To do so, the players have to win a certain amount of races to get noticed by a member of the team and defeat them to move to the next one. To win a race, the players have to pass all the checkpoints first either in a specific way or as they see fit. Some races are time-limited, with several seconds added to the timer for passing a checkpoint.</p>\n<p>Police are present in the game and can be encountered during both races and free-roaming. They can call in reinforcements if the player does not comply, set up roadblocks, and use a helicopter projector to blind the players.</p>\n<p>In the Arcade game mode, the players are free to choose whichever race they had already completed and set up their own set of rules.</p>", "metacritic": 81, "released": "2003-04-09", "tba": false, "updated": "2023-12-08T20:32:50", "background_image": "https://media.rawg.io/media/games/d1c/d1c676bd2b8b9d909ccaefb15b8554f5.jpg", "website": "https://www.rockstargames.com/games/midnightclub2", "rating": 3.56, "rating_top": 4, "added_by_status": {"yet": 33, "owned": 864, "beaten": 64, "toplay": 21, "dropped": 68, "playing": 3}, "playtime": 1, "achievements_count": 0, "ratings_count": 118, "suggestions_count": 422, "game_series_count": 5, "reviews_count": 120, "platforms": ["PC", "Xbox", "PlayStation 3", "PlayStation 2"], "developers": ["Sony Interactive Entertainment", "Rockstar San Diego"], "genres": ["Racing", "Arcade"], "publishers": ["Rockstar Games"], "esrb_rating": "Teen"}