{"id": 167967, "slug": "growyourcheckeredsquare", "name": "GrowYourCheckeredSquare", "name_original": "GrowYourCheckeredSquare", "description": "<p>A game (prototype) for GDL game jam  (June2017), this is a virtual pet game in which I attempted using JQuery for the GUI. </p>\n<p><strong>How to play: </strong><br/></p><ul><li>Your Square will grow automatically </li><li>To ensure it doesn't die of starvation, click the \"Feed\" button every so often </li><li>When its \"Attention\" (the blue bar) is low, its hunger will decrease faster so ensure this doesn't happen by clicking the \"Play\" button now and then, and ensuring your mouse doesn't leave the canvas-area for too long </li><li>The Square will eventually stop growing when it reaches a certain size at which point you're welcome to stop playing or head over to the Github repository and modify (improve) the game. </li></ul><p>Github Repository: https://github.com/GDLynx/Grow... </p><p><strong>N</strong><strong>ote/s: </strong></p>\n<ul><li>The game is actually a prototype for a free-time project of mine (inspired by Tamagotchi) </li><li>You're welcome to access the code via Github (to be posted) and modify it to your pleasing, I too will continue making various versions of the game and sharing them. I do however ask that you don't attempt to commit directly to the Github-repository (unless/until I permit otherwise) and instead make your own (cloned) repository </li><li>The game may seem very minimal but this is because more features were intended (expect better versions of the game after the end of the jam's voting period). </li><li>You're welcome to contact me on Discord (TheLynx) with any questions regarding the game </li></ul>\n\n<p>Obviously; thank-you for playing, and I'd appreciate it if you shared the game with others. </p>", "metacritic": null, "released": "2017-06-04", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/96f/96f530f371a7aaf5a4f2d6c567562ee9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 6, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["DevLynx"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}