{"id": 16813, "slug": "mount-blade", "name": "Mount & Blade", "name_original": "Mount & Blade", "description": "<p>Not every medieval game has to have fantasy elements, magic and the prophecy of a great hero. Mount &amp; Blade is an action RPG set in the sandbox kingdom of Calradia. Players are creating their characters at the beginning of the game, by answering some multiple-choice questions about their past and then pick the appearance. After the quick preparations, the character is dropped in the world where they can choose their own adventure, by either joining one of the combating factions, becoming an outlaw or a mercenary. By traveling to different locations, player will find some quests to follow, gaining renown for winning battles in order to level up skills, attributes, and weapon proficiency.<br />\nMount &amp; Blade offers a different take on the combat. The player can clash on the open map with an opposing army or join the already ongoing conflict between two or more hostile parties. Sometimes a tournament is organized in town arenas.  If players gain the control over the fort or are attacking one, they participate in the siege combat where the player can either defend or attack a fortification. And when players are given control over a settlement, they might be involved in conflict after a triggering event.</p>", "metacritic": 72, "released": "2008-09-16", "tba": false, "updated": "2024-03-20T16:46:24", "background_image": "https://media.rawg.io/media/screenshots/ee7/ee7e7b6d5dbf0adf7705eff6912a3e60.jpg", "website": "http://www.taleworlds.com/en/Games/MountAndBlade", "rating": 3.87, "rating_top": 4, "added_by_status": {"yet": 159, "owned": 2417, "beaten": 162, "toplay": 31, "dropped": 169, "playing": 5}, "playtime": 4, "achievements_count": 0, "ratings_count": 343, "suggestions_count": 469, "game_series_count": 5, "reviews_count": 343, "platforms": ["PC"], "developers": ["TaleWorlds Entertainment"], "genres": ["Action", "RPG", "Indie"], "publishers": ["TaleWorlds Entertainment"], "esrb_rating": null}