{"id": 168124, "slug": "audi-unraceable-top-racing", "name": "Audi #unraceable: Top Racing", "name_original": "Audi #unraceable: Top Racing", "description": "<p><strong>#unraceable – The Ultimate Racing-Experience </strong></p>\n<p>Fordern Sie Bayernlegende Giovane Elber heraus!<br/>Batteln Sie sich mit Österreichs populärsten Gamern venicraft, chaosflo und Supercars of Austria!<br/>Schlagen Sie die Bestzeit des 6-fachen Ski-Weltcup-Gesamtsiegers Marcel Hirscher!</p>\n<p>Erleben Sie die virtuelle Race-Realität hautnah im Motion Seat oder zeit- und ortsunabhängig mit der #unraceable App – auf der Jagd nach der persönlichen Bestzeit und gemeinsam mit Ihren Facebook Freunden. #unraceable vereint unfassbar spannendes Live-Racing, eine starke Community und jede Menge Starpower! </p>\n<p><strong>Create it - feel it!</strong></p>\n<p>Mit #unraceable werden Sie selbst auf spielerische Weise zum Streckendesigner: Sie bauen Ihre individuelle Rennstrecke - mit Ihren eigenen Händen - direkt am #unraceabletable – inkl. Gefälle, Kurven, Sprungschanzen und vielem mehr. Mit Hilfe neuester Technologien verwandeln wir Ihre Modellstrecke in eine revolutionäre 3D Virtual Reality Landschaft, zusehen aus der Cockpit-Perspektive. Mithilfe einer VR-Brille erleben Sie im Motion Seat hautnah und in Echtzeit virtuelle Autorennen – und das alles auf Ihrer personalisierten Strecke. Emotional, echt, spürbar: Der Motion Seat überträgt in einer perfekten Simulation Geschwindigkeit, Verlagerungen und physikalische Kräfte bis zu 2G direkt auf den Spieler. <br/>Besuchen Sie www.unraceable.at und finden Sie jederzeit den aktuellen Standort des #unraceable Motion Seats.</p>\n<p><strong>Take it - enjoy it!</strong></p>\n<p>Die #unraceable App bietet Ihnen die einmalige Gelegenheit, Ihre individuelle Rennstrecke einfach auf Ihrem Smartphone mit nach Hause zu nehmen und immer wieder zu erleben. Fordern Sie über Facebook Ihre Freunde heraus und bewerten Sie die Strecken anderer Freunde. On top schicken wir Ihnen Ihre Strecke samt Foto Ihres Auftritts im Motion Seat per E-Mail zu.</p>\n<p><strong>Share it - fight it!</strong></p>\n<p>Ihre Race-Parcours beinhalten einen Code: Wer diesen Code in die #unraceable App eingibt, kann sich auf Ihrem Track versuchen. Wird ein Abenteuer geteilt, können Sie mithilfe des Codes die Challenge annehmen und versuchen die Zeit Ihres Freundes zu unterbieten. Plus: Als eingeloggter Facebook-User sehen Sie in einem Extra-Tab die freigegebenen Strecken Ihrer Freunde.</p>\n<p><strong>The ultimate special: beat the stars!</strong></p>\n<p>Ein absolutes Highlight sind die Star-Specials von #unraceable. Sie können sich auf hochklassigen Tracks mit der Bayernlegende Giovane Elber oder dem 6-fachen Ski-Weltcup-Gesamtsiegers und Audi Markenbotschafters Marcel Hirscher batteln. Weiterhin erwartet Sie die „Ernst Habsburg“ Strecke von Formel 3 Star Ferdinand Habsburg-Lothringen sowie ORF Formel-1-Kommentator Ernst Hausleitner.</p>", "metacritic": null, "released": "2017-12-01", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/afc/afc31975fc2e6c6191927b825af510b9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 44, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Porsche Holding"], "genres": ["Action", "Racing"], "publishers": [], "esrb_rating": null}