{"id": 16811, "slug": "wildlife-park-2-crazy-zoo", "name": "Wildlife Park 2 - Crazy Zoo", "name_original": "Wildlife Park 2 - Crazy Zoo", "description": "<p>The Zoo is expanding!<br />\nMore than 30 new types of animals and plants have moved in at the zoo. Favorite species such as the Wolf, the Arctic Fox, the Giant Kangaroo and the Meerkat are the new Stars in your zoo! Improve the park with the blossoms of sunflowers and rare orchids and plant exotic trees such as bamboo and eucalyptus.<br />\nEntertainment for all<br />\nYou can use numerous new attractions for the perfect park experience. There is something special for everyone: from the children&#39;s adventure playground to the helicopter round-trip to diving in the shark cage. Visitors can travel through the park in boats, Jeeps or on the back ofhorses, camels and elephants. Or how about a dive to the newly constructed coral reef?<br />\nOn the tracks of the Animal World<br />\nOf course the animals are the real protagonists! The new additions to the zoo show off their stunts and even challenge the guests of the zoo to a little duel: the courageous visitor can face the kangaroo in a boxing match. Enthusiastic water-babies are given the opportunity of swimming with dolphins and turtles - go get wet! Inquisitive visitors can track the zoo inhabitants in the wild, observe them and capture them on film. But be careful: in case of an emergency the player has to personally intervene as Zoo Director, search for an escaped animal, sedate it with a tranquilizer gun and take it back to its safe environment.<br />\nAdvanced park economy<br />\nTo keep the cash coming in and to ensure that expensive novelties can be paid for, supply your visitors with culinary and cultural delights at booths and stalls: tired guests enjoy a steak at the BBQ Stall or refreshments at the Pool Bar. Street musicians, a clown and a juggler provide fun entertainment. A room at the Zoo Hotel turns a visit to the Animal World into the ultimate all-round enjoyment.<br />\nTurn a visit to the zoo into an unforgettable holiday experience for your guests!<br />\nFeatures:<br />\n• 20 new animal species inhabit the zoo, for example Arctic Fox, Spotted Hyena, Giant Kangaroo and Meerkat<br />\n• 10 interesting and varied new mission, 10 new cards for free play<br />\n• New exciting attractions provide fun and entertainment for visitors to the zoo,<br />\n• e.g. glass bottom cruises, elephant riding, helicopter tours and swimming with dolphins<br />\n• 16 additional plant species, e.g. sunflowers and orchids<br />\n• New decorative equipment, enclosure elements and guest facilities such as diving equipment for hire, street musicians and Pool bar<br />\nA couple of new visitor attractions, such like:<br />\n• Boat station with glass bottom cruises<br />\n• Riding on horses, elephants and camels<br />\n• Children’s&#39; excursion train and helicopter station with helicopter tours<br />\n• Photo Safaris (animal documentation) and tranquilizer gun mode<br />\n• Diving equipment hire and underwater observation in shark cage<br />\n• Swimming with dolphins and other water creatures<br />\n• Including Wildlife Park 2`s comprehensive sandboxmode with a bunch of: decorations, plants, service-items, pen-items, terraforming, ways, grounds, fences, etc.</p>", "metacritic": null, "released": "2007-03-30", "tba": false, "updated": "2020-04-06T13:16:31", "background_image": "https://media.rawg.io/media/screenshots/391/391ae3cdb2f1d9e480ea6884fd5edc87.jpg", "website": "http://www.b-alive.de/joomla/index.php?option=com_content&amp;task=view&amp;id=16&amp;Itemid=67", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 12, "toplay": 1}, "playtime": 3, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 459, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["b-Alive"], "genres": ["Strategy", "Simulation", "Casual", "Indie"], "publishers": ["b-alive"], "esrb_rating": null}