{"id": 168161, "slug": "segdx", "name": "SEGDX", "name_original": "SEGDX", "description": "<p>\r\n\tSEGDX is a space exploration and survival game with real time strategy/resource management aspects made for the libgdxjam 2015-2016.\r\n</p>\n<p>\r\n\tYou can read some of the lore in the devlog for this game.\r\n\t<br/>\r\n\tGo To Download\r\n</p>\r\nHow to Play\r\n<ul>\n<li>Basics</li>\n<li>Node Types</li>\n<li>Rest Stops</li>\n<li>Gossip</li>\n<li>Work</li>\n<li>Combat</li>\n<li>Draft</li>\n<li>Achievements</li>\n</ul>\n<p>\n<strong>BASICS:</strong>\n</p>\n<p>\r\n\t\r\n\tUse your mouse cursor to click and select nodes.  You may then press the\r\n\tbutton on the bottom right corner of the screen(Some actions may case you to be  unable to travel). Traveling expends fuel(located on the top bar of the screen) and the amount you of fuel you use is dependent on your ships fuel economy. You can find some of your ships crucial info in the Ship Tab on the right hand side of the screen. Up there is also your hull(hp) food, and currency.\r\n</p>\n<p>\r\n\tYou must keep track of your food as it expends periodically(faster depending on difficulty). If you run out of food or fuel you will get an immediate game over.\r\n</p>\n<p>\n<strong>NODES:</strong>\n</p>\n<p>\r\n\t\r\n\tThere is 3 different types of nodes in the game:\r\n</p>\n<ul>\n<li>Rest Stop - these are as the name implies nodes where you can rest. While at a rest node you the player can buy fuel, food or repair. Also you will not expend food if you are at a rest stop!    There is also tabs for Gossip and Work.</li>\n<li>Trade Post - the center of all trade and commerce. In order to amass your fortunes you will need to travel to these nodes. Different trade post have different prices. You may also buy Modules and Ships at trade posts.</li>\n<li>Event Node- Event nodes are either a blessing or a curse. One minute you are mining rich Ore deposits the next You are fending off a pirate Attack.</li>\n</ul>\n<p>\r\n\tYou may travel to any node from any other node but be sire to keep your food and fuel supply in mind. Once you hit travel your ship will set out its course and it cannot be stopped.\r\n</p>\n<p>\n<strong>REST STOPS:</strong>\n</p>\n<p>\r\n\t\r\n\tRest stops are one of the most if not the most important nodes in the game. In the current state of the game you want to always be near a rest stop because if you run out of fuel or food you are going to get a Game Over. Fuel and Food prices vary from Rest stop to rest stop. You can also find Gossip and Work at Rest Stops.\r\n</p>\n<p>\n<strong>GOSSIP:</strong>\n</p>\n<p>\r\n\t\r\n\tBefore you get your first scanner it will be pretty tough to figure out if your destination node after you hit travel will be your last resting spot. But if you can spare the money sometimes it might be a good idea to invest in some Local gossip at a Rest Stop.\r\n</p>\n<p>\r\n\tGossip will tell you one of three types of things.\r\n</p>\n<ul>\n<li>A random event node that has an active event. You will also receive information about the node and be shown the relative area of where it is on the map.</li>\n<li>trade post who are selling something for huge discounts. </li>\n<li>and Work gossip. This will point you to a Rest Stop with the specified Work. It will also give you the description for it.  </li>\n</ul>\n<p>\n<strong>WORK:</strong>\n</p>\n<p>\r\n\t\r\n\tWork is basically in game quests that require a lot of effort and thought in order to complete. If you manage to complete some Work you will be rewarded with an achievement specific to that Work and also a neat reward unobtainable anywhere else. If you are having a hard time finding a specific \"Work\" quest you can head to any rest stop and check the gossip tab.\r\n</p>\n<p>\n<strong>COMBAT:</strong>\n</p>\n<p>\r\n\t\r\n\tCombat in the game is very minimal at the moment. When a happen upon a combat event you will have 1 of 3 options.\r\n</p>\n<ul>\n<li>Flee - You may try to run away. Doing so will make you lose a % of your current fuel and cause the combat event to end. You may attempt to flee as many times as you want during combat even if it has already failed by simply going back to the event tab and attempting to flee again. The higher your ship speed the more likely you are to succeed.</li>\n<li>Bribe- You may try to offer currency to the attacking force. Each time you try this option you will lose a % of your current wealth. Some enemies are more likely to be bribed than others. Also if an enemy is damaged it is more likely to accept a bribe.</li>\n<li>Fight!- Takes you straight to the action and begins combat. If you decide that this wasn't the smartest choice you may go back to the event tab and choose again. Just remember that once combat has been initiated you will be under constant barrage by your enemies so Choose Fast! </li>\n</ul>\n<p>\r\n\tOnce you are in combat and in the combat tab you will have 2 sets of combat usable abilities displayed. Offensive(red) on the left and Defensive(green) on the right.\r\n</p>\n<p>\r\n\tYou choose a target and begin to use your abilities at will. All the abilities on cooldown will move down the list allowing you to quickly chain attacks , but be careful to pay attention to what ability you use.\r\n</p>\n<p>\r\n\tDepending on modules such as the RailGun you may have several of the same ability at the same time as long as you have the upgrade points on your ship to equip them.<br/>\n</p>\n<p>\r\n\tAt the start of the game you will need to be careful and try to avoid combat at all costs. You do not spawn in with any weapon modules of any sort. But what you do spawn in with is a mining module. So try to find some deposits and mine away!.\r\n\t<br/>\n</p>\n<p>\n<strong>DRAFT:</strong>\n</p>\n<p>\r\n\tEvery few cycles(timer on the top right) you will be drafted by the empire. You can either choose to pay the specified amount or be drafted into the empire. If you choose to be drafted you will get an immediate game over. Also if you do not have enough currency to pay off the draft you will only receive the option to be drafted.\r\n</p>\n<p>\n<strong>ACHIEVEMENTS:</strong>\n</p>\n<p>\r\n\tThere is currently over 35 achievements in the game. View-able through the achievements tab in the main menu. Get them all to show dominance!,\r\n</p>\n<p>\n<br/>\n</p>", "metacritic": null, "released": "2016-01-11", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/58c/58c9f0964ae7c8befb144e74f1adc466.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 80, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["kyperbelt"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}