{"id": 168183, "slug": "tycoon-of-the-highseas", "name": "Tycoon of the HighSeas", "name_original": "Tycoon of the HighSeas", "description": "<p>You are the Captain of a small merchant ship on the high seas! Buy goods from port and sell them to passing friendly merchants at sea to make your booty. But watch out! the open waters are not so kind. Stay alive and make your fortune!</p>\n<p>- New with Alpha Patch 0.0.2.8 -</p>\n<p>Updated site images to better show off the games current state</p>\n<p><strong>GAME PLAY</strong></p>\n<p>-Crew are now able to rank up, doing so will increase their working speed. Working grants xp towards ranking up</p>\n<p>-The fisherman can now charge up his cast, it will cast further and fall deeper the higher the charge</p>\n<p>-The fisherman is now able to rank up, catching fish grants xp towards ranking up, each rank increases fish sale value by 25</p>\n<p><strong>VISUAL</strong></p>\n<p>-Rank icons added to crewmembers and the fisherman</p>\n<p>-Adjusted the size and location of the crew's working progress bar and added an xp bar</p>\n<p>-Added casting strength bar and xp bar to fisherman(relevant animations to come at a later date)</p>\n<p>-Added lvl up animation</p>\n<p>-Decreased the padding around text on text boxes, making the box smaller.</p>\n<p>-updated menu screen</p>\n<p><strong>SOUND</strong></p>\n<p>-Added lvl up sound effect</p>\n<p><strong>BUG FIXES</strong></p>\n<p>-Fixed a bug that was causing captain and crew to sometimes eat a fish from the total amount of fish even while you did not have a blue fish in your inventory with no affect</p>\n<p>-Fixed a bug with the Dutchman's phantom bomb which caused the game to crash if the Dutchman was defeated while the bomb was active</p>\n\n<p>-Things to know - <br/></p>\n<p>-The fish are still bugged when becoming unhooked from the fish hook, causing them to sometimes swim backwards.</p>\n<p>This project is still in development. - future updates include, but are not limited to; A world map to explore, expanded economy(different types of goods, items), new ships, crew and, random events such as pirate or sea monster attacks.</p>\n<p>Please consider supporting this project with the recommended $2.00 donation :) It would be greatly appreciated!</p>", "metacritic": null, "released": "2017-12-05", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/44c/44cf3d4c4b762e8cb096bd759a21db80.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 115, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["RelicToothStudios"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}