{"id": 16825, "slug": "blocks-that-matter", "name": "Blocks That Matter", "name_original": "Blocks That Matter", "description": "<p>Blocks That Matter is an isometric indie platformer game developed by Swing Swing Submarine.</p>\n<h3>Gameplay</h3>\n<p>You play as a robot named Tetrobot. It can drill blocks, recycle them, and produce new blocks of different matter. Every matter has its own behavior and features. Tetrobot can also destroy lines of eight blocks just like in Tetris. </p>\n<p>There are special blocks scattered around the game&#39;s story mode levels that cannot be drilled or recycled. Hence why the game is called Blocks That Matter. The only purpose of such blocks is to unlock bonus levels. Each block serves as a pop culture reference to games as Portal or even a Rubik&#39;s cube. Such special blocks can be found either on the levels or hidden in random treasure chests.</p>\n<p>The game features 40 levels in its adventure mode and 20 more bonus levels. Every bonus level resembles a game with blocks in it, for example, Portal and its Weighted Companion Cube. Apart from that, the game is bundled with a level editor which allows for creating new levels and sharing them with the community.</p>\n<p>The game is heavily influenced by Minecraft and Tetris, which can be seen while playing through any level. The block mechanics heavily resemble the same in Minecraft. In some levels, the developers use Minecraft-styled blocks of mud, ores, and resources.</p>", "metacritic": 72, "released": "2011-08-19", "tba": false, "updated": "2024-04-06T12:36:58", "background_image": "https://media.rawg.io/media/screenshots/7b5/7b504019a81ba84711323fb758729925.jpg", "website": "http://www.swingswingsubmarine.com", "rating": 2.82, "rating_top": 3, "added_by_status": {"yet": 44, "owned": 1020, "beaten": 11, "toplay": 1, "dropped": 40}, "playtime": 2, "achievements_count": 32, "ratings_count": 62, "suggestions_count": 151, "game_series_count": 0, "reviews_count": 62, "platforms": ["PC", "Linux", "macOS"], "developers": ["Swing Swing Submarine"], "genres": ["Action", "Casual", "Indie", "Puzzle", "Platformer"], "publishers": ["Swing Swing Submarine"], "esrb_rating": null}