{"id": 168215, "slug": "virtual-pet-definitelynotashark", "name": "Virtual Pet (DefinitelyNotAShark)", "name_original": "Virtual Pet (DefinitelyNotAShark)", "description": "Adopt and name your own virtual pet!<p>You can adopt a cat, a dog, or a hamster!</p>At the beginning, you will...<ol><li>Choose your new pet! Which type do you want to take care of?</li><li>Give your pet a name. Your pet's name will appear in game notifications and will appear right above your pet the whole game!</li><li>Start to take care of your pet. They have a lot of needs, but it can be done!</li></ol>Features<ul><li>A thought button. See what your pet is thinking. Thoughts change depending on how your pet is feeling. There are over 50 different thoughts to see!</li><li>Accessories! Personalize your new pet with accessories from the store.</li><li>Walks! No one knows what you might find on a walk. Make the correct choice to win items or make your pet happier</li></ul>There's lots of stuff you can do together!\r\n<ul><li>Go out with your pet. Show them off!</li><li>Take your pet on walks!</li><li>Go shopping! Buy all kinds of care from dollar store shampoo to a luxurious mineral bath.</li><li>Buy your pet accessories! </li><li>Care for your pet to increase its mood!</li><li>Level up by being active with your pet.</li><li>See what your pet is thinking.</li></ul>\n<p>*Note: there's no save or load function. There are also some bugs. This isn't a perfect game, but it's free. If you like virtual pet games, this one could be a lot of fun!</p><p>Leave a comment to let me know what you thought of it!</p>", "metacritic": null, "released": "2017-11-10", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/2d5/2d50277acb2d2bca58aab3a3a38767ca.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 24, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["DefinitelyNotAShark"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}