{"id": 168205, "slug": "gentryfight", "name": "Gentryfight", "name_original": "Gentryfight", "description": "<p>GentryFight est un tower defense traitant du problème de la gentrification.</p>\n<ul><li>Click gauche pour transférer de \"l'influence\" sur un bâtiment,</li><li>Click droit pour construire un  bâtiment</li></ul>\n<p>Au carrefour des tentacules du grand capital et du pouvoir institutionnel, Nanterre.</p>\n<p>Au détour de ses mille chemins, la Maison Daniel Féry. Anciennement MJC, et en Majuscule SVP.</p>\n<p>Repère emblématique de la culture populaire, locale et proximale, et parmi bien d’autres, humble monument du hiphop parisien ; espace de création artistique et de diffusion culturelle ; gymnase et cuisine des jeunes et moins jeunes artistes du coin et de tous les parages ; un morceau d’histoire, une adresse sûre, une âme collective et des souvenirs communs.\r\n</p>\n<p>Mais depuis quelques saisons les grues ont pris d’assaut le ciel et le sol. C’est plus du goudron, c’est du foncier. </p>\n<p>L’horizon est sous palissade. </p>\n<p>La nouvelle est tombée, d’ici 2 ans la salle aura été rasée.</p>\n<p>GENTRYFIGHT est une cartographie des possibles, une mise en scène simplifiée de l’idée folle que c’est encore jouable... garder le terrain...</p>\n<p>Jeu réalisé en 48h à l'occasion d'une Urban game jam organisée en février 2018.\r\n</p>\n<p>Un infini MERCI aux membres des équipes de la salle Daniel Féry. Merci à celles et ceux qui font briller et rugir cet espace. Pour les 2000 coups de mains, la disponibilité, et le sourire malgré les cernes et les heures supp’. Vous n’imaginez pas la portée de vos mains vertes !!</p>\n<p>Enfin pour terminer, on dirait un détail, et pourtant... Daniel Féry était un jeune militant syndiqué, mort par étouffement avec d'autres manifestants au métro Charonne au cours d’une manifestation en solidarité avec l’Algérie indépendante le 8 Février 1962, qui fut sauvagement réprimée par les forces de police sous l’ordre de Maurice Papon. Il y a quelques jours à peine se commémorait le souvenir de ces disparus.</p>\n<p>11 février 2018, la police tue, encore et toujours.<br/><br/><br/></p>", "metacritic": null, "released": "2018-02-11", "tba": false, "updated": "2019-08-28T23:21:36", "background_image": "https://media.rawg.io/media/screenshots/0f8/0f89e475deee58da513a916e998a4bbf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 18, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["corpsmoderne", "axlez"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}