{"id": 1683, "slug": "gesundheit", "name": "Gesundheit!", "name_original": "Gesundheit!", "description": "<p>Breaking: iOS10.3 users a 64bit update is snot too far away!<br />\nThe multi-award winning iOS classic regarded by many as the best adventure puzzle game of all time! IGN Mobile Puzzle Game of the Year, Apple App of The Week. Enjoyed by over 10 MILLION players and loved by reviewers and gamers the world over!<br />\n<em> Gesundheit! is one of the rare games for iOS that I think everyone should play. 9.5/10 Editors Choice (IGN)<br />\n</em> The sort of experience that shows off the wonderful things people can create for this platform. 5/5 Stars. Don&#39;t miss it. (TouchArcade.com)<br />\n<em> Perfectly executed a beautiful surprise, both original and captivating. 9/10 (FunTouch.net)<br />\n</em> 4.5/5 a tight, focused and tailor-made experience that I challenge any gamer not to fall in love with. A True AppStore Gem (TouchGen) -Editors Choice.<br />\n<em> A refreshing game that comes highly recommended to fans of action puzzlers (Appmodo.com)<br />\n</em> 8/10 plays like a bird’s-eye view of Metal Gear Solid. The dark humor and steep difficulty will please grown-ups. (The Daily)<br />\n<em> The experience is wrapped in a beautiful, adorable package…most players will be delighted by Gesundheit! (Gamezebo.com)<br />\n</em> A+ Game of the Month. (ireviewT.com).<br />\nGesundheit! combines extraordinary hand-drawn visuals and animation with an infectious gameplay to create a vibrant and colorful world where cute characters face off against wacky monsters, pigs will fly, and snot happens!?<br />\nAlso available &#39;Gesundheit!&#39; for iPad.<br />\nFor more updates and news on Gesundheit! and other upcoming titles, follow us on twitter @revolutionaryco or on Facebook!</p>", "metacritic": null, "released": "2013-01-24", "tba": false, "updated": "2019-10-22T13:57:02", "background_image": "https://media.rawg.io/media/screenshots/704/7047af02dda47a209b9524838433af60.jpeg", "website": "http://www.revolutionaryconcepts.org", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 3, "beaten": 2, "dropped": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 4, "suggestions_count": 164, "game_series_count": 0, "reviews_count": 4, "platforms": ["iOS", "PC"], "developers": ["Revolutionary Concepts"], "genres": ["Adventure", "Puzzle"], "publishers": ["Revolutionary Concepts"], "esrb_rating": null}