{"id": 168538, "slug": "ant-runner-turboignited", "name": "Ant Runner (turboignited)", "name_original": "Ant Runner (turboignited)", "description": "<p>An ant has left his colony and must successfully maneuver it's environment to survive.</p><p><strong>Features</strong></p><ul><li>Fun mechanics that allow the ant to manoeuvre and stay alive. How well can you control the ant?</li><li>Infinite random level generation that continues to get more difficult. How far can you go?</li><li>Global leaderboard that counts your score throughout the levels. How good are you?</li></ul><p><strong>Levels</strong></p><ul><li>The Stream</li></ul><p>Take the ant for a float through the stream where it must survive the current. Lily pads and logs platforms are available to traverse or jump onto. Avoid the dragonflies who fly around and attempt to kill the ant. Also, stay within the boundaries of the stream to avoid crashing and drowning.</p><ul><li>The Iceberg</li></ul><p>Take the ant for a float through the antartic where it must survive the freezing ice. Iceberg platforms are available to traverse or jump onto. Be as fast as you can to get the ant through without sinking.</p><ul><li>The Forest</li></ul><p>Take the ant for a run through the forest where it must avoid the oncoming bees.</p><p><strong>Story</strong></p><p>It was particularly unusual for any ant to venture away from its colony into a world of unknown consequences. Pheromones tend to lead ants into unfamiliar territory where they may find themselves stuck or otherwise incapable to turn back. There's something of a good or bad type of consequence that can come from following a scent blindly. In a world unlike our own at such a minute scale, yet vastly stretched for miles, this ant has got a long way ahead of him.</p><p>Keep Updated</p><p>https://www.facebook.com/Ant-Adventure-Game-942230...</p><p>More Games</p><p>https://turboignited.wordpress.com</p>", "metacritic": null, "released": "2016-07-19", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/f1d/f1df7c7e9161ba4e07b1a099d75996d2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 95, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["turboignited"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}