{"id": 168671, "slug": "final-football-tactics", "name": "Final Football Tactics", "name_original": "Final Football Tactics", "description": "<p>Final Football Tactics is a turn-based tactical football game!<br/></p>\n<p>Control your team of players and outwit your opponent in the competitive multiplayer mode, or score goals as quickly as possible to progress through the single player challenge mode.</p>\r\nNote to Ludum Dare players\r\n<p>The single player mode is designed to be enjoyable on its own, and also introduces all of the main concepts of the game. However, we highly recommend getting a friend to play the multiplayer mode if possible, as we think it best demonstrates the theme of combining two incompatible genres (sports + turn-based tactics). Since the game is turn-based, it can be played online through screensharing.</p>\n<p>Bugs causing the controls to freeze after completing single player, and allowing balls and players to occupy the same square after goals were fixed on the 24th.</p>\r\nInstructions\r\n<p>Note: The game can be played with just the keyboard, or with both the mouse and keyboard. Using just the keyboard may give the smoothest experience.</p>\n<ul><li>Press I in-game to see full controls</li><li>Use the mouse or arrow keys to select players</li><li>Use M when selecting a unit to move it</li><li>Use K when selecting a unit to kick with it</li><li>Use R to restart a level</li><li>Use - / + to adjust the volume</li></ul>\r\nCredits\r\nProgramming/Design\r\n<p>Mitchell Lee, Colin Lu, Jon Schneider, Anderson Wang</p>\r\nMusic\r\n<p>Mitchell Lee</p>\r\nSprites and Graphics\r\n<p>Colin Lu</p>\n<p>Made with HaxeFlixel. Applause sound effect is from here and licensed under Attribution 3.0.</p>\n<p>All of the other sprites, music, and effects are original.</p>", "metacritic": null, "released": "2018-04-24", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/c1c/c1c81d54d325078294486f645dcd333d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 15, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["cluedo"], "genres": ["Sports", "Puzzle"], "publishers": [], "esrb_rating": null}