{"id": 16877, "slug": "soccer-rage", "name": "Soccer Rage", "name_original": "Soccer Rage", "description": "<strong>Soccer Rage</strong> is a sport/action game that features: a hybrid engine of soccer and fighting. This game has a dynamic and fast-paced soccer gameplay. There are no red cards, no off-sides, no outside balls, no substitutions, brutal fouls are allowed along with fighting.<br/> <br/><br/>In order to beat your opponent you need to have a greater goal difference or make your opponent have less than 7 players on the field. There are no red cards, no off-sides, no outside balls, no substitutions, brutal fouls are allowed along with fighting. Create the best strategy in order to beat the opponent team while attacking or defending. <br/><br/>For example, while attacking: you can give passes, long range passes, one and two passes, you can shoot, precise shooting, lofted shooting, rage shooting and much more. As for defending: you can perform moves such as: tackle, slide tackle, shoulder barging, and also you can rage slide tackle and fight your opponent. Damage your opponent until they get injured pulling them off the game and remember: any team with less than 7 players will lose the game. <br/><br/><strong>Available features</strong><br/>There are 8 teams to play with. <br/>Full keyboard and controller support <br/>Full customizable controllers <br/>Up to 4 players in a local multiplayer match. <br/>Tournament mode.<strong>Planned features</strong><br/>Online Multiplayer.<br/>Advanced AI<br/>8 more teams<br/>8 more scenarios.<br/>Team/Player customization<br/>Strategy planning. <br/><br/><br/>Thanks for your support and please comment about the game and the features you would like to see on it, we are committed to bring those features and as much as we can possibly do, making together the Best Sport Game on PC,MAC and Linux <br/><br/>please also visit our website for more information: www.stamina-games.com", "metacritic": null, "released": "2015-06-02", "tba": false, "updated": "2019-08-28T22:10:42", "background_image": "https://media.rawg.io/media/screenshots/bbb/bbb9531b5219dc324016f2eaccbbba54.jpg", "website": "http://stamina-games.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 71}, "playtime": 1, "achievements_count": 8, "ratings_count": 0, "suggestions_count": 483, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Stamina-Games"], "genres": ["Action", "Sports", "Indie"], "publishers": ["Stamina-Games"], "esrb_rating": null}