{"id": 168720, "slug": "fun-vision-park-board-game", "name": "Fun Vision Park Board Game", "name_original": "Fun Vision Park Board Game", "description": "<p>This game is a prototype for a variety of custom imaged board games.  This one specifically was used when I was campaigning to become a moderator of an RPG developers' forum. By the way, I did win that election. :)  Now, here is some information about the game. </p><p>The community want a new park. They want the Fun Vision Park. Unfortunately, the Killjoy Gang Boss, and his minions, want otherwise. Come join MJ, as he searches for fun gems and also fulfills quests to get Funshroom and VisionBird to assist him. Can he even persuade some of the Killjoy Gang Members to change their minds, and become his friends?<br/><br/> Play Fun Vision Park, on a Game Board like presentation, to find out how.</p><p>Being from the marshlands and swamps of Southern Louisiana, I just love alligators (especially in a variety of dishes). So do not be surprised if you see a couple different versions of them.</p><p>If you decide not to purchase an upgrade or 'weapon' for an NPC in the market, to get to previous option press [Esc].</p><p>NOTE: I can also make customized versions of this to cater to birthday party invitations, baby gender announcements, present revealed when quest is completed, tourism, new church member introduction to staff, team training exercises, etc. Contact me for further details, as these would be commissioned works.</p><p><strong>Available Games:</strong></p><p>A Ball People Winterfest </p><p><strong>Ballden Facing Bullies Board Game Adventure</strong> </p><p><strong>Finding Hope Board Game Adventure</strong> </p><p><strong>Fun Vision Park Board Game</strong> </p>", "metacritic": null, "released": "2016-12-02", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/184/184502aab4ea662ac50b32946ebcaab7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 65, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["MinisterJay"], "genres": [], "publishers": [], "esrb_rating": null}