{"id": 168869, "slug": "the-daydreamer", "name": "The Daydreamer", "name_original": "The Daydreamer", "description": "<p>[ <strong>English</strong> | Español] </p>\n<p><em>       \"Dreams are chaos!\", she said.<br/>        \"Sure.\" replied the Daydreamer. \"They are a bit messy, but you can do fantastic things within them.\"<br/>        \"You're mad. Do you seriously believe that you'll solve your problems by sleeping?\"<br/>        \"Oh no, not by sleeping. By dreaming.\"</em></p>\n<p><strong>Click here to play the demo prototype online!</strong></p>\n<p><strong>The Daydreamer</strong> is an upcoming puzzle platformer. Explore the fate of The Daydreamer, a mysterious man who can manipulate reality from within his own dreams! Use the Daydreamer's signature skill to tackle the puzzling scenarios from within your dreams, where your skills change and time flows at different speeds. You'll require to use both your mind and your reflexes to prevail!</p>\n<p>The game is being developed and is expected to be ready in 2018. It was originally conceived during the \"My First Game Jam: Summer 2017\" contest, in which the first playable prototype was developed in two weeks. Afterwards, the prototype was extended to show 8 levels and new mechanics.</p>\n<p><strong>Want to help me build this adventure? </strong>Please support the game development with a donation! Click here to download the demo prototype for any amount you want (or free)!</p>\n<p>________________________________</p>\n<p>[ English | <strong>Español</strong> ]</p>\n<p><em>       \"Los sueños son caos!\", dijo ella.<br/>        \"Claro.\" respondió el <em>Daydreamer</em>. \"Son un poco desordenados, pero puedes hacer cosas fantásticas en ellos.\"<br/>        \"Estás loco. ¿De verdad piensas que puedes solucionar tus problemas durmiendo?\"<br/>        \"No, no durmiendo. Soñando.\"</em></p>\n<p><strong>¡Haz click aquí para jugar el prototipo de demostración en línea!</strong></p>\n<p><strong>The Daydreamer</strong> es un videojuego de plataformas y puzzle en desarrollo. ¡Explora el destino del Daydreamer, un misterioso hombre que puede manipular la realidad desde sus propios sueños! Utiliza la habilidad del Daydreamer para resolver los desafiantes escenarios desde tus sueños, donde tus habilidades cambian y el tiempo fluye a distintas velocidades. ¡Tendrás que usar tu mente y tus reflejos para obtener la victoria!<br/></p>\n<p>El juego está en desarrollo, y se espera que esté listo en 2018. Fue originalmente creado durante la competencia \"My First Game Jam: Summer 2017\", donde se desarrolló el primer prototipo jugable en dos semanas. Posteriormente, el prototipo se extendió para mostrar 8 niveles y más mecánicas.</p>\n<p><strong>¿Te gustaría ayudarme a construir esta aventura? </strong>Por favor, soporta el juego con una donación. ¡Haz clic aquí para descargar el prototipo de demo por cualquier cantidad que quieras (o gratuitamente)!</p>", "metacritic": null, "released": "2017-08-05", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/705/705c02fe18ed74bf2f47d6ad22abe507.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 28, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Racso"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}