{"id": 168998, "slug": "playing-god-joel-mehonoshen", "name": "Playing God (Joel Mehonoshen)", "name_original": "Playing God (Joel Mehonoshen)", "description": "<p><strong>Ongoing Project</strong></p><p>This is an ongoing project and as such builds may be incomplete or not fully functioning.<br/><br/><strong>Artist's statement:</strong><br/>All that glitters is not gold, that is the message of Playing God. You, the player have almighty power and may show this in this game, however you may soon realise that this is not all it is cut out to be and that with great power comes great responsibility. Your followers trust you with their care and you may betray this trust if you desire. To win this game, you must enlighten some of the villages under your care. The idea behind this is that the player must balance their villages stats at a sustainable level in order for them to achieve \"Enlightenment\", the games win condition. However the ultimate decision to care for the villages is up to the player and they may instead choose to smite them all if they so wish.</p><p>With Kanye West's 'Power' and Alex Grey's 'Oversoul' as inspiration, we made Playing God to be played from the perspective of some sort of cosmic entity with the world, literally, in their hands. This was our visual inspiration for the game we intended the player to feel the grandeur of their in game perspective and this in turn draws upon our second piece of inspiration Kanye West's 'Power'. The power idea comes from the in game mechanics from the player using their abilities, these abilities are supposed to make the player feel almighty and powerful however all that glitters is not gold and the player soon feels the weight of their actions and what they must do in the world, balance or destroy it.</p><p>The trust mechanic comes from the villages trust in the player, the happier the villages are with the player the more god points the player will replenish. This entices the player to care for the villages as they benefit from it however as we stated they may betray this trust if they wish. However, the less happier the villages are the less God Points gained per turn. At worst, you can gain only one per turn. As powers cost upwards of 2 to use, this is quite dangerous.</p><p>Made by:<br/>Production Manager: Connor Mackay<br/><br/>Creative Lead: Joel Mehonoshen<br/><br/>Programmers: Daniel Koitka, Liam Harvey<br/><br/>Animators: Kynan St Leon-Wharfe, Che Hubbard</p>", "metacritic": null, "released": "2016-07-27", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/27d/27d6eceb728dd5ef682e028ba5981153.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 51, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Joel Mehonoshen"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}