{"id": 1689, "slug": "harbor-master-hd", "name": "Harbor Master HD", "name_original": "Harbor Master HD", "description": "Enjoy the best selling game Harbor Master on the beautiful big screen of the iPad. With completely new content and gorgeous high resolution graphics, Harbor Master HD will blow you away.<br/><br/>You are the Harbor Master in a busy harbor. Direct boats into the docks, watch them unload their cargo, and direct them off the screen. But be careful not to let boats crash!<br/><br/>Harbor Master HD gives you one beautiful free level called Treasure Island. With six docks and two cargo types, the game gets hectic very fast. For even more fun with your iPad, try playing with a friend!<br/><br/>If you need more harbors to master, there are 4 additional maps available for download from inside the app, each with its own unique twist:<br/><br/>★ Cargo City - You&amp;#39;ve hit the big time now! With three cargo colors and six docks to manage, Cargo City is every Harbor Master&amp;#39;s dream!<br/><br/>★ Pirate Passage - Pirates attack! Manage three docks and navigate narrow island passages, all while fighting off pesky pirates!<br/><br/>★ Bermuda Triangle - The most dangerous waters on the seven seas - but they&amp;#39;re no match for you! Defeat all the pirates, monsters, and cyclones to master this harbor, and you&amp;#39;ll be a legend.<br/><br/>★ Kraken Atoll - Beware the Kraken! Four docks, two cargo colors, and an ancient beast that haunts the deep. <br/><br/>★★★★★★★★★★★★★★★★<br/>REVIEWS<br/>★★★★★★★★★★★★★★★★<br/><br/>One of CNET&amp;#39;s 20 Best iPad Games<br/><br/>&amp;quot;Everyone who owns an iPad should download Harbor Master HD.&amp;quot; - AppAdvice<br/><br/>&amp;quot;Something you shouldn&amp;#39;t miss if you own an iPad&amp;quot; - TouchArcade<br/><br/>&amp;quot;No questions, the single most addictive game I have ever played.&amp;quot; -- The Appera<br/><br/>★★★★★★★★★★★★★★★★<br/>FEATURES<br/>★★★★★★★★★★★★★★★★<br/><br/>- A gorgeous new HD map, Treasure Island<br/>- 4 additional maps available for purchase<br/>- Multitouch support - play with a friend!<br/>- Two cargo types, which must be dropped off at the appropriate docks<br/>- Online Leaderboards<br/>- Tweet your score<br/>- Multiple player profiles on one device", "metacritic": null, "released": "2010-04-01", "tba": false, "updated": "2019-10-22T14:27:48", "background_image": "https://media.rawg.io/media/screenshots/50b/50b2b816e66c64e2a1c32ef280c846b7.jpeg", "website": "http://www.imangistudios.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 220, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Imangi Studios"], "genres": ["Action", "Arcade"], "publishers": ["Imangi Studios"], "esrb_rating": "Everyone 10+"}