{"id": 169, "slug": "bullet-time-hd", "name": "Bullet Time HD", "name_original": "Bullet Time HD", "description": "EPIC STORYLINE<br/>3 massive Campaigns!<br/><br/>HD CUSTOMIZATION<br/>Extensive Character &amp; Gear customization and upgrade possibilities!<br/><br/>AWESOME GAMEPLAY<br/>Epic dual-stick action with powerful boosts and powerups!<br/><br/>4-PLAYER DEATHMATCH<br/>Online WI-FI and 3G deathmatch multiplayer with up to four players! Own your friends and earn fantastic rewards.<br/><br/>SURVIVAL MODE<br/>Online WI-FI and 3G co-op multiplayer with up to three players! Reach number 1 with your friends!<br/><br/>IN-GAME COMMUNITIES<br/>Players helping players!<br/><br/>---<br/>They took all he had and left him for dead!<br/><br/>In a vivid post-apocalyptic world you’ll join the engaging story of John Irish as he strives to reclaim his family from the cold grasp of a savage breed of mutated beasts. <br/><br/>Welcome to the universe of Bullet Time – an epic action adventure story like no-other in the App Store!<br/><br/>Play through multiple campaigns delving deeper into the story of Bullet Time or join the action online, as players take part in three-player co-op MULTIPLAYER against the vicious mutated hordes!<br/><br/>Experience a large, living 3d-world with multiple quests and hidden secrets along the way. Retina and HD graphics optimized for iPad 2 &amp; iPhone 4S.<br/><br/>Survive a depraved, distant future where dangers lurk around every corner and only a few human survivors are living scattered throughout the wilderness.<br/><br/>Customize your character uniquely and upgrade every weapon in extensive ways. <br/><br/>Unleash the power of destructive boosts as the mutant armies attempt to take John Irish down.<br/><br/>Compete with your friends to reach number one on the GameCenter leaderboards and unlock exquisite achievements deep within the world of Bullet Time!<br/><br/>Backup your character from device to device through Bullet Times very own backup service located within the app. Fast &amp; efficient gaming across all your iOS devices. <br/><br/>Bullet Time is compatible with iPhone 3GS, iPhone 4, iPhone 4S, iPod Touch 3, iPod Touch 4, iPad 1 &amp; iPad2.", "metacritic": null, "released": "2011-11-17", "tba": false, "updated": "2019-07-29T19:38:29", "background_image": "https://media.rawg.io/media/screenshots/066/066d4c483f4a1f088fbdf1a9730baf2e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 304, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["Kiloo"], "genres": ["Action", "Adventure"], "publishers": ["Kiloo"], "esrb_rating": null}