{"id": 16903, "slug": "jack-keane", "name": "Jack Keane", "name_original": "Jack Keane", "description": "<p>Colonial England. Under a certain amount of duress... Jack takes on a job, which will not only cause him a great deal of trouble, but also bring to light the answer to a mystery out of his distant past. A lack of money leads Jack to accept a charter to take a British secret agent to mysterious &#39;Tooth Island&#39;. When Jack&#39;s ship shatters on the mysterious island&#39;s cliffs on arrival and the secret agent quickly becomes a meal for a monster in the jungle, Jack is soon left to cope with the situation on his own.<br />\nTooth Island is ruled by the strange Doctor T, who is cultivating man-eating plants and has his own dastardly plans for the British Empire. And why does he seem to know Jack, who can&#39;t remember ever having been on Tooth Island? What are Doctor T&#39;s plans? And what does he know about Jack&#39;s past?<br />\nAnd then there&#39;s the young and naive Amanda, who is filled by an almost fanatical drive to prove her worth. In the beginning the young lady is employed by Doctor T, and part of her task is to track Jack down and take him prisoner. It doesn&#39;t take long before she begins to wonder if she is really on the right side, or if she shouldn&#39;t join her opponent, the charming Captain Jack, instead.<br />\nA hair-raising hunt across the length and breadth of the dangerous island finally airs the mystery surrounding Jack&#39;s past and leads to a spectacular showdown with a dark and deadly enemy and his nefarious henchmen.<br />\nA wild, action-packed Point-and-Click adventure<br />\nA humorous and engaging story, containing many allusions and references to famous movies, characters and computer games<br />\nGreat dialogue, over 40 memorable characters<br />\nTwo playable characters \u0097 the somewhat clumsy daredevil Jack Keane, and the attractive and adventurous Amanda<br />\nA variety of settings including London, the High Seas, Capetown and of course, Tooth Island!<br />\n3D levels presented in that classic adventure style<br />\nCinematic cut-scenes to push forward the captivating storyline</p>", "metacritic": 69, "released": "2007-07-31", "tba": false, "updated": "2023-09-19T12:59:56", "background_image": "https://media.rawg.io/media/games/5ac/5ac19a1daec2b5688028caeb8995528b.jpg", "website": "http://www.strategyfirst.com/games/1432-jack-keane.html", "rating": 3.0, "rating_top": 4, "added_by_status": {"yet": 6, "owned": 172, "beaten": 7, "toplay": 6, "dropped": 3, "playing": 1}, "playtime": 4, "achievements_count": 0, "ratings_count": 10, "suggestions_count": 558, "game_series_count": 1, "reviews_count": 10, "platforms": ["macOS", "PC"], "developers": ["Deck13", "Runesoft", "Deck13 Interactive"], "genres": ["Adventure", "RPG"], "publishers": ["Kiss", "Runesoft", "Deck13"], "esrb_rating": "Teen"}