{"id": 169004, "slug": "princess-pajama-speaks-to-me", "name": "Princess Pajama Speaks to Me", "name_original": "Princess Pajama Speaks to Me", "description": "<p>This game is not meant to be taken lightly. Expect dark themes, slight innuendo, and non-fantasized, non glorified, violence.<br/>Also, this game favors audio over art.<br/><br/>Our hero is just your average sufferer of the cancer that is loneliness. His life is going nowhere, but there is good news! He has found a cure! A permanent solution! A beautiful piece of (Moe) art entitled Princess Pajama. Hes almost free! She even speaks to him! The only problem is he has to deal with pesky little issues, like his foster brother, and Jade, the caring and secretive cause of the cancer.<br/>Features:<br/><br/>Full Voice Acting (Its an audial novel)<br/><br/>4 endings<br/><br/>6 choices<br/><br/><br/>\"Princess Pajama speaks to me,<br/>and she tells me to kill\"<br/><br/>Characters:<br/><br/>Our hero:<br/><br/>Your average, sarcastic, lonely, and clinically depressed protagonist. Only problem is he has a few trust issues to sort out, and there's the whole murder thing...<br/><br/>Played by Wiliam Halas<br/><br/>Jade:<br/><br/>Our heroine, a cunning, smart, and beautiful girl who is clearly in love with our hero. What a shame she left him a while ago.....<br/><br/>Played by Kyakyakyu<br/><br/>Steven:<br/><br/>Our heroes best friend. Hes very chipper! Even though he did kind of just get fired.....<br/><br/>Played by Alonso Betancor<br/><br/>Eric:<br/><br/>Our heroes foster brother. Call him a spy, a sarcastic joker, or an idiot. But hes still a brother.<br/><br/>Played by Truman Williams<br/><br/>Feel free to review,lets play, and discuss as you please. Any (respectful) commentary would be appreciated.</p>", "metacritic": null, "released": "2016-01-25", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Tea for the Cynic Studios"], "genres": [], "publishers": [], "esrb_rating": null}