{"id": 16901, "slug": "reign-of-bullets", "name": "Reign of Bullets", "name_original": "Reign of Bullets", "description": "You'll start your journey with an old jet that Troy has lying around in his garage. Set out to shoot your way through different areas in order to collect more scrap and loot to improve your ship to bring the Titan corporation to it's knees! How will you build your ship? Will you go for high damage? Targeting lasers? Or an army of drones? It's all up to you! The upgrading and modification system in Reign of Bullets is detailed and endless, giving you the freedom to customize your weapons the way you desire.<br/><br/>Start shooting, collecting and upgrading to help Troy in his quest to free the world from Titan's tyranny. <strong>Find out more about the game features by clicking on 'read more'!</strong><br/><br/>Features<br/><ul><li>2D shoot 'em up gameplay with waves of enemies and screen filling bosses.<br/></li><li>Lots of upgrading possibilities on each weapon to suit your playstyle! <br/></li><li>Use lasers, rifles, miniguns, rockets, flamethrowers and more to destroy your enemies! <br/></li><li>Place weapons anywhere on your ship in any direction to adapt to different situations.<br/></li><li>Defeat bosses for legendary loot that can upgrade your ship to take on new areas.<br/></li><li>Experience the story of Troy and his crusade against the Titan corporation in the Campaign Mode!<br/></li><li>Play randomly generated levels with infinite replayability in survival mode.<br/></li><li><strong>And much more........</strong><br/><br/></li></ul>", "metacritic": null, "released": "2015-08-19", "tba": false, "updated": "2019-08-28T22:10:42", "background_image": "https://media.rawg.io/media/screenshots/c5d/c5dd42c49efb41e7e9bf6934376aea55.jpg", "website": "http://www.reignofbullets.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 85}, "playtime": 4, "achievements_count": 26, "ratings_count": 1, "suggestions_count": 352, "game_series_count": 0, "reviews_count": 1, "platforms": ["Linux", "PC", "macOS"], "developers": ["Critical Bit"], "genres": ["Action", "Indie"], "publishers": ["Triangle Studios", "Critical Bit"], "esrb_rating": null}