{"id": 16921, "slug": "fleeting-ages", "name": "Fleeting Ages", "name_original": "Fleeting Ages", "description": "Fleeting Ages features a never seen gameplay element in other sandbox games which will ensure the feeling of being an important figure of the game world. You can make permanent changes in the world of Fleeting Ages which will affect every aspect of the game. <br/>\r\nExperience the different ages from the prehistoric era to the Industrial era on the same map and observe as they transition into each other. <br/>\r\nShape the world around you and observe how it will affect the hostile enemies and their behavior, the weapons they use, the houses they build and the clothes they are wearing in the different ages that you triggered to shift. <br/>\n<br/>\r\nIn the game you play as a mysterious man who is able to die but won't grow old. If you are able to survive you can observe and shape the Fleeting Ages as they pass by. You are the only one of your kind and there are no other supernatural beings in this world. Find your own role in this world as your actions change your world for the better or worse. <br/>\r\nYou can affect the world by inventing tools and weapons never seen before. The changes you make in the world as little as killing an animal to as big as building a town will be permanent. <br/>\n<br/>\r\nAs you progress in different ways your surroundings will react to it and change accordingly. At start you will find different animals roaming around or attacking you if they are hostile. Then when the age is ready, humans will appear in their little settlements who will eventual learn from you and develop their own culture. As you trigger an age shift with your progress in the game the peoples will accommodate to the new age with new kinds of weapons, clothing and buildings. <br/>\r\nYou need to collect various resources while you try to survive and develop new tools like wood, copper, iron and other metals, coal, different herbs and plants to make potions out of, food and water to survive in this harsh world. As the ages shift the tools you make, the resources you use,  peoples and enemies you encounter will change as well. <br/>\n<br/>\r\nYou will face wild animals at the beginning and advanced human civilizations with firearms at the end of your explorable ages. You can use your resources to build anything you want with more possibilities as you invent new tools to use. You can make weapons and armors as well to defeat your enemies easier or to hunt for food in the woods. These are varied from simple sticks and bows to swords and firearms. <br/>\n<br/>\r\nThis is the world we give to the players to explore, shape, rebuild, survive and enjoy.", "metacritic": null, "released": "2016-05-02", "tba": false, "updated": "2019-08-28T22:10:41", "background_image": "https://media.rawg.io/media/screenshots/3bf/3bfdf7b42599b19b605978d0b2816263.jpg", "website": "http://randgsoftware.com/?q=content/fleeting-ages", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 50}, "playtime": 2, "achievements_count": 20, "ratings_count": 0, "suggestions_count": 297, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["R&G Software"], "genres": ["Action", "Indie"], "publishers": ["R&G Software"], "esrb_rating": null}