{"id": 169259, "slug": "guardian-of-the-sacred-banyan", "name": "Guardian of the Sacred Banyan", "name_original": "Guardian of the Sacred Banyan", "description": "<p>Guardian of The Sacred Banyan</p><p>Platform: Windows</p><p>Contact: SadSunStories@gmail.com </p><p>Release Date: 26/06/2015</p><p>Price: Free</p><p>Company: Sad Sun Stories</p><p>All Rights Reserved</p><p>(UPDATE: Previous file was the incorrect one, this is the proper and finished game with minor tweaks to create a fair experience)</p><p>This is a pixel platformer like no other. Here is the game that'll drive you mad. If mistakes are made you will be forced to completely restart. The difficulty of the enemies creates no room for error alongside the 1:20 time cap on every level. This is a five stage hell. The dodgy hitboxes will make you cringe in anger, the cluster of enemies will leave you confused. But just know if you ever finish the game, you are a God. You play an Elder Elf that must protect her home (Banyan tree) from the envious invading spirits. Can you save the Sacred Banyan?</p><p>Who is Sad Sun Stories?</p><p>I am a solo game developer. I am a one person game studio that had help only on the backing track and bosses (Credited to Kayla Ness) for this game. All ideas were conjured by myself, as was the artwork and the coding. I am a poor student that, prior to this videogame had no knowledge whatsoever on coding. This has broadened my horizons yet also lets me appreciate the hard work put in by engineers on bigger scaled developer teams. </p><p>Keep an eye out for our Sad Sun logo for future developments on Kickstarter.</p><p>DISCLAIMER: Play at your own risk, Sad Sun Stories will not be held illegible for broken monitors, tears  and broken friendships. </p>", "metacritic": null, "released": "2015-06-26", "tba": false, "updated": "2019-08-28T23:21:35", "background_image": "https://media.rawg.io/media/screenshots/87b/87bf17bd3ef15372a0d4972d28424e90.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 148, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SacredNiglette"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}