{"id": 169463, "slug": "do-not-play-this-game", "name": "Do Not Play This Game", "name_original": "Do Not Play This Game", "description": "<p>NOTE: All copyrighted materials inside has been wiped and replaced with corrupted version. If you do not like bright flashing lights or sudden loud noise, do not play this game. Actually, don't ever think about playing this game. It's not worth your time. This is not a dare.</p><p>Original \"game\" was rated 18 by PEGI and A/AO by ESRN due to strong language, mentions of suicide, use of drug, disturbing visual, depicts of sexual assault, and violence. (This was made when I was so angry at myself I added myself in that game so the enemies could slice my neck, so excuse me.)<br/></p><p>I removed those parts and edited all resources to permanently get rid of adult materials, so don't worry.<br/></p><p>This game is released under Creative Commons - NC SA.</p><p>Font was generated with BitFontMaker 2, and designed by me (BitMangle).</p><p>The relatively large file size was caused by default RTP resources (which is required to remove the need for downloading and installing RGSS-RTP). Actual content is very small.<br/></p><p>As a back story...</p><p>I was making a game called Ultra Boring KRPG: Shoddy Warriors. Then the development took nosedive because of unknown reason... Then I deleted all contents inside except the bare minimum resource and made this. This is a satirical version of Depression Quest. If you can't take this sort of satire, please remove your computer from your house and throw it out of window. Why? Because this is so bad even Superman 64 would look like a masterpiece.</p><p>NOTE: You can get all of the project and resource file from me free of charge and with no copyright bound. All you need is a copy of RPG Maker VX Ace (genuine one, please). To get it, ask me for the project file.<br/></p>", "metacritic": null, "released": "2015-09-28", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/546/5461218c7f802301d3dc631e68de2e7d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 8, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Pathfinder"], "genres": [], "publishers": [], "esrb_rating": null}