{"id": 169473, "slug": "cryptopia", "name": "Cryptopia", "name_original": "Cryptopia", "description": "<p><strong>Farming in the deep future - build a Utopia from the Dystopian garbage heap the humans left behind</strong></p>\n\n<p>Scavenge the wasteland, build solar arrays to generate extra power, use that power to carve through the trash and channel it into cryptocurrency mining rigs, earn enough Cryptore to purchase shells to hold immortal human consciousnesses downloaded from the virtual plane - Your goal is to find, fill and maintain 10 shells with immortal consciousnesses. Don't let any shells lose power or their precious contents will expire and you'll have to scrape out the remains and start again!</p>\n<p>pssst - if you want to see more of the game in a shorter space of time, you can press backspace then type in 31031989 to enable cheat mode! This will remove all the garbage clogging up the paths and allow you to charge up your beam instantly (press C), get a whole load of resources (press M), or receive a immortal consciousness to put in a shell (press I) - Handy if you're a reviewer in a hurry!</p>\n<p>—</p>\n<p><strong>W/A/S/D</strong> - <em>Move from node to node </em></p>\n<p><strong>Left click </strong>- <em>Scavenger beam / Build buildings / Sell resources</em></p>\n<p><strong>Right click</strong> - <em>Boosted scavenger beam from a nearby charged solar array</em></p><p><strong>Shift + Right click</strong> - <em>(If your solar array network can handle it) Rapid fire boosted beam!</em></p>\n<p>—</p>\n<p>Game by Luke No Further - http://lukenofurther.com/</p>\n<p>Music by Chime - https://soundcloud.com/chimetunes</p>\n<p>—</p>\n<p><strong>HOW TO PLAY</strong></p>\r\n\r\n\r\nHold down left mouse button to scavenge hardware from piles of debris\r\n\r\nBuild solar arrays on outdoor plots using 80 pieces of hardware\r\n\r\n\r\nSolar arrays slowly charge up (left) until full charge (right)\r\n\r\n\r\nIf you own a fully-charged array, you can right-click some debris to fire a charged bolt\r\n\r\n\r\nYou might find some cryptocurrency mining rigs - shoot energy from your arrays with right-click!\r\n\r\n\r\nOnce they are charged, they'll start mining\r\n\r\n\r\nWhen they're done, left-click to collect the ore\r\n\r\n\r\nYou'll receive a piece of Cryptore - just charge them up again to keep mining\r\n\r\n\r\nCryptore can be used to buy mining rigs of your own\r\n\r\n\r\nAnd if you collect a lot, you can build a shell\r\n\r\nThese need to be charged up before they can be used\r\n\r\n\r\nOnce you've built your first shell, the Virtual Plane Uplink will be active\r\n\r\n\r\nYou can use these to lease immortals to put in your fully charged shells\r\n\r\n\r\nHoly heck! You've just received an immortal!\r\n\r\n\r\nThen just click on the full-charged shell to insert it\r\n\r\n\r\nFind and build and fill all 10 shells to win\r\n\r\n\r\nYour filled shells will slowly consume energy so make sure you keep them topped up\r\n\r\n\r\nWatch out! Don't let them run out of energy or they'll expire!\r\n\r\nFire a bolt of energy into them to empty it and start again\r\n<p><strong>Happy farming everyone!</strong></p>", "metacritic": null, "released": "2018-04-23", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/73c/73ccec91249bf9c63127f8dc17c5a8b0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 66, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["lukenofurther"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}