{"id": 16945, "slug": "ortus-regni", "name": "Ortus Regni", "name_original": "Ortus Regni", "description": "AN EARLDOM AWAITS YOUR HAND.<br/>\n<br/>\r\nA truly medieval card game, that is free to download in the modern world!<br/>\n<br/>\r\nOrtus Regni is a new and novel card game inspired by the late Anglo-Saxon period of English history. The Late Anglo-Saxon era in English history is a time of warring Earls. Minor kings all, they claim whatever lands they can. They establish fiefs, cultivate powerful vassals, and fight and engage in endless political struggles. All the while, the Vikings roam not just the sea, but the land.<br/>\n<br/>\r\nIt is truly a Dark Age. Or is it?<br/>\n<br/>\r\nThis is Ortus Regni, “the birth of the kingdom.”<br/>\n<br/>\r\nThe ancient world is dead. The world is reborn. Anyone can become a king through politics and diplomacy – or by the blade. And it is always, in the end, by the blade. Will it be you?<br/>\n<br/>\r\nOrtus Regni is a unique closed-deck, deck-design strategy card game. Players take the role of great Earls vying to control what will become England. Ortus Regni was inspired not only by Anglo-Saxon history, but also by the art of illuminated medieval manuscripts.<br/>\n<br/>\r\nQUICK AND EASY DECK BUILDING: Or let the app build you one, and the save the decks you like. <br/>\n<br/>\r\nTUTORIAL SYSTEM: Journey through the basics of the game. <br/>\n<br/>\r\nCOMPLETE CARD SET INCLUDED: no in game “currency” or card harvesting. <br/>\n<br/>\r\nNOVEL STRATEGIC CARD GAME INTERFACE: Pictorial cards and a replicated tabletop experience. <br/>\n<br/>\r\nOrtus Regni is based off of the premium tabletop card game of the same name. To learn more visit: http://ortusregni.com", "metacritic": null, "released": "2016-06-21", "tba": false, "updated": "2019-09-17T13:17:45", "background_image": "https://media.rawg.io/media/screenshots/b31/b318deb62ddf9dba67ef438ae04aa781.jpg", "website": "http://ortusregni.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 4, "owned": 171, "toplay": 1, "dropped": 1}, "playtime": 1, "achievements_count": 31, "ratings_count": 2, "suggestions_count": 170, "game_series_count": 0, "reviews_count": 2, "platforms": ["macOS", "PC", "Linux"], "developers": ["Jon Sudbury Games"], "genres": ["Strategy", "Indie"], "publishers": ["Jon Sudbury Games"], "esrb_rating": null}