{"id": 169537, "slug": "orbital-2016", "name": "Orbital (2016)", "name_original": "Orbital (2016)", "description": "<p>Orbital est un jeu compétitif réalisé en 2016 par Alexandre Lapostolle et Victor Pérès-Nillus  2 étudiants en 2ème année de formation Game Design de l'ETPA.</p>\r\nSynopsys\r\n<p>Orbital vous donnera des purs moments de fun.<br/></p>\n<p>Dans ce jeu de sport particulier, vous incarnez une sphère qui doit ramener la balle dans son camp...mais en gravité autour d'une planète.</p>\n<p>En attaque ou en défense affrontez votre ami. Ramenez la balle dans votre goal et la planète prendra votre couleur. Capturez toute la planète pour empocher la victoire.<br/>Mais la compétition est dure, et ton ami va bientôt t'arracher la victoire des mains. Tombant du ciel il te propulse au loin et la compétition continue !</p>\n<p>Sur le sol où dans les airs prenez plaisir à vous affronter. <br/>Dans cet affrontement rapide et fluide, ressentez les lois de la gravité. Jouez quelques parties et plongez dans le fun électrique d'Orbital !</p>\n<p><em>[EN]<br/></em></p>\n<p><em>Orbital is a competitive game who delivers electric moments of arcade action.<br/>The idea of Orbital is to incarnate a light sphere -in a sport like game- and find all-new fun in controling the giant ball you have to score...but in gravity around a planet.</em><br/></p>\n<p><em>In offense or in defense you have to face your friend. The rules are simple, bring back the ball in your beam goal. The neon colored -and small- planet will light up, until you win. But the competition is harder than you expect,and your conquest will soon be deny by your adversary. Falling from the sky, producing a shockwave on impact, he propulses you away. And the competition goes on again !</em></p>\n<p><em>The heart of Orbital is in the feeling of unrestricted movement, you could roll on the ground or you can fly in orbit !</em><br/></p>\n<p><em>Experience the law of gravity in this fast and fluid contest. Play a few rounds and dive into one hell of a good time.</em></p>", "metacritic": null, "released": "2018-01-22", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/771/77104f74256eb34ed7b33b26715488a8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 112, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ETPA"], "genres": ["Action", "Sports"], "publishers": [], "esrb_rating": null}