{"id": 169540, "slug": "block-attack-rise-of-the-blocks", "name": "Block Attack - Rise of the Blocks", "name_original": "Block Attack - Rise of the Blocks", "description": "<p>Block Attack - Rise of the Blocks is my take on the classic Tetris Attack game. It might seem like any other match-3 style game but it is generally much faster. The game requires fast decisions compared to other puzzle games. While you can setup the perfect chain it is much more likely that you will construct chains while blocks are still dropping around you. In addition to traditional game types like endless, time trial and stage clear the game does also feature a VS-mode. The VS mode is a battle like you rarely see in a puzzle game.</p>\n<p>If you liked the original Tetris Attack and are a purist then you might be disappointed. This is not just any clone. It is my reimagining on how the game should have been. There are no physics in this game only fully predictable rules.</p>\n<p>Features:<br/></p>\n<ul><li>5 single player modes: Endless, Time Trial, Puzzle Mode, Stage Clear and Vs. Mode</li><li>2 two player options: Time Trial and Vs. Mode</li><li>Music and sound effects</li><li>Play with keyboard</li><li>Play witch mouse</li><li>Play with gamepad</li></ul>\n<p>I started this game back in 2005 and in my humble opinion it has not been done better on the PC by 2017.<br/></p>\n<p>Tested and works perfectly with the Itch App. For Windows choose the \"Windows without installer\" version.<br/></p>", "metacritic": null, "released": "2017-09-13", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/6e9/6e97673818f320a01d3de7b1d690aa3a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 25, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["sago008"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}