{"id": 169553, "slug": "fend", "name": "Fend", "name_original": "Fend", "description": "<p>Fend is a casual castle-defense game where players shoot waves of enemies with their archer(s) to stop them from breaking down their castle gate.</p>\n<p><strong>Controls</strong></p>\n<ul><li>Use mouse to aim</li><li>Left Click to shoot (there is an auto fire option in the options menu)</li><li>Q, W, E, and R keys are used to change arrow type (scroll wheel can also be used)</li><li>F4 to toggle fullscreen (this can also be changed in the options menu)</li></ul>\n<p><strong>Modes</strong></p>\n<p>Fend has a \"Normal Mode\" to get a feel for the game. After completing normal mode, players can start a new game in \"Endless Mode\" with randomized enemy spawns. Endless Mode has upgraded arrow types to unlock after reaching specific checkpoints.</p>\n<p>The game also features an online co-op mode where up to four players can team up to take on more enemies than the single-player modes have to offer. Co-op mode has split upgrades and rewards for each player (based on performance) and allows for specialization in elemental damage multipliers.</p>\n<p>Online mode requires the host to set up \"port forwarding\" on their router. For detailed instructions on setting up port forwarding, please visit https://portforward.com/</p>\n<p>All online progress is saved in the host's multiplayer save file.<br/></p>\n<p><strong>Support</strong></p>\n<p>Please report any bugs to drillergames@outlook.com and include \"fendbug\" in the subject, and screenshots if possible.</p>\n<p>If the game crashes with an error that mentions d3d, download DirectX9 at one of the following:</p>\n<ul><li>Windows 7 or below</li><li>Windows 8 or above</li></ul>", "metacritic": null, "released": "2017-02-20", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/8d5/8d52bf7f06a230d22a9489ace199fe0f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 51, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["DrillerGames"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}