{"id": 16960, "slug": "codespells", "name": "CodeSpells", "name_original": "CodeSpells", "description": "CodeSpells is in Early Access, so not all planned features have been implemented. The current version includes Earth, Water, Fire, and Air magic, as well as 5 multi-player minigames and a procedurally generated sandbox creative mode. *Note: multiplayer is still in an early alpha state and requires port forwarding and local hosting.<br/><br/>---<br/><br/>When we were young, wizards like Gandalf and Dumbledore struck a chord in our minds. We spent hours pretending to be wizards and casting epic imaginary spells. We wanted to see these fantasies fully realized, so we created CodeSpells. <br/><br/>CodeSpells combines the creative freedom of imagination with the beauty and interactivity of video games. The secret sauce? Coding. Instead of limiting players to pre-packed spells, we allow our players see the real magic that happens under the hood of most games. Through Javascript or the intuitive, kid-friendly visual tool Blockly, CodeSpells lets everyone craft the magic of their dreams.<br/><br/>Ignite blazing wildfires, drain entire seas, turn the elements into a force field around you, or just blow stuff up - the choice is yours!<br/><br/>PLANNED FEATURES:<br/>*Ability for players to use multiplayer servers in the cloud to play with friends (rather than using their own PC as a server).<br/><br/>*Life Magic: (Final Kickstarter Stretch Goal) We’re going to make more robust ecosystems and interactions with the lifeforms of CodeSpells.<br/><br/>*Coding Tutorial: After getting great feedback from our beta testers on Steam, we’ve decided to revamp our code windows in order to make them as intuitive as humanly possible. This includes built-in aid for trying to craft your own games within CodeSpells, like the 5 multi-player minigames we have provided. <br/><br/>*We might create a small campaign mode where players can test their skills by protecting the fading fragments of the CodeSpells universe, but this is a dream feature, and last on our list. Our primary purpose is to deliver on our Kickstarter goals, and make the best procedurally-generated spell-crafting sandbox the world has ever seen.<br/><br/>We are so grateful for everyone’s help in making CodeSpells as magical as we all want it to be. We hope you will continue to give us feedback on Steam and on the Forums as we bear down on the final product.<br/><br/>---<br/><br/>See what else we're making at Multi-Dimensional Games by visiting our website.<br/>", "metacritic": null, "released": "2015-09-18", "tba": false, "updated": "2019-08-28T22:10:39", "background_image": "https://media.rawg.io/media/screenshots/6d6/6d67ff2038336c334e9d9b0f0e384548.jpg", "website": "http://codespells.org/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 29, "toplay": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 484, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "macOS"], "developers": ["Multi-Dimensional Games"], "genres": ["Action", "Adventure", "Simulation", "Indie"], "publishers": ["ThoughtSTEM"], "esrb_rating": null}