{"id": 169645, "slug": "rad-chad-in-twice-the-action", "name": "Rad & Chad in: Twice the Action", "name_original": "Rad & Chad in: Twice the Action", "description": "<p>Rad &amp; Chad in: Twice the Action</p><p>This game is about a shooting aliens game - predictable you would say, and an endless runner game: EVEN MORE predictable you would say?</p><p>Ok.. how about playing the two genres TOGETHER!!! WAH, wha, WHAT?</p>That is correct, Rad &amp; Chad - Twice the Action is a game about playing two games at the exact same time! With easy controls, addictive game play and multiple modes what is not to love!!??<p>This includes:</p><p>Alion mode</p>2 player mode or Hard mode<p>and my personal favorite</p><p>Monkay mode!!! Yes they are monkays, not exactly monkeys( where monkays are flying all around with their bananas trying to distract you from your gameplay!)</p><p>+++ New update +++</p><p>Now 2 new modes:</p><p>Mix - no progression, just everything mixed </p><p>Progressive - progressive with no alion interruptions!</p><p>Power ups now included!!!! : )!</p><p>Ah, and of course since it has simple controls, a 2nd player can easily join the gameplay of the shooter or the runner in any modes!</p><p>Featuring music from ODJBOX as well.</p><p>I am offering this game for free, for your personal enjoyment, </p><p>but I do ask of you to read these thoughts on donations to independent and creative individuals that gives us great games like me as it will expand your mind on the powers of donations:</p><p>Donations.</p><p>I ask that you give as little as you can or as much as you can, to give thanks for the enjoyment that you had with the game that I have created with my sweat and blood( well not literally but you know what I mean!)</p><p> All I ask is that you donate money, to support the creative and independent game creators out there( like me), if everybody would donated some money to all the free games out there, how much more people would be inspired to create wonderful and imaginative games that we would have never thought of!</p><p> Perhaps the one that didn't believe in himself, could stand up and create a sure fire hit, all because of knowing that there would be good and appreciative people out there that are willing to churn out some of their hard earn money,to the lowly and creative crowd out there, that offers you a distraction of the woes of this world, even if it is just for a minute, isn't it worth just to give a little, to show you appreciation of the distraction from this harsh world it gave to you and the fun you had with it.</p><p> It will tell them, thank you, I actually enjoyed the game, and the time you spent creating it was not in vain, isn't this worth just a little bit of your money?</p><p>And for all the game creators out there, do not be shy to ask for donations, because you DESERVE it!!!</p><p>thank you.</p>", "metacritic": null, "released": "2015-10-31", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/45c/45ce170794a5ba435cdee885c504f785.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 63, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["D. Creator"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}