{"id": 16969, "slug": "offspring-fling", "name": "Offspring Fling!", "name_original": "Offspring Fling!", "description": "<h3>The side project turned game</h3>\n<p>A puzzle game from independent developer Kyle Pulver created on the FlashPunk engine. The game was released on Microsoft Window, Mac OS and Linux in the spring of 2012. The project began as a side-project for a developer from Arizona, which in the development process has become a full-fledged game. 100 puzzles are available for completion within the story campaign, and an additional 20 bonus levels that open after meeting all the conditions To do so the game requires the player a clear platforming skill from the player. The project is played with a sense of nostalgia: the gameplay and control are very similar to those used in the classic platformers from the 90&#39;s.</p>\n<h3>The Russian way</h3>\n<p>The protagonist is an unfortunate forest creature who accidentally lost all of his children and is now trying to get them all back. The game motivates players to replay it - after completing the level, the game creates a ghost version of the player. Critics noted the amount of work that Kyle Pulver did, noting that 15-20 years before the release of the game, would require a huge studio, and the game itself would appear on several covers of gaming media. But times have changed, and in 2012 the developer laid out the game on the Internet without much fuzz. The game, however, does not involve liberty in completion - for each puzzle, there is only one correct option.</p>", "metacritic": 79, "released": "2012-03-30", "tba": false, "updated": "2023-01-05T02:07:49", "background_image": "https://media.rawg.io/media/screenshots/dd5/dd5264ce0b5c7dc464f923b2f85c9091.jpg", "website": "http://offspringfling.com", "rating": 2.47, "rating_top": 3, "added_by_status": {"yet": 58, "owned": 1081, "beaten": 12, "toplay": 3, "dropped": 23}, "playtime": 2, "achievements_count": 10, "ratings_count": 45, "suggestions_count": 358, "game_series_count": 0, "reviews_count": 45, "platforms": ["macOS", "PC"], "developers": ["Kyle Pulver"], "genres": ["Adventure", "Indie"], "publishers": ["Kyle Pulver"], "esrb_rating": null}