{"id": 169758, "slug": "robot-2d-prototype", "name": "Robot 2D prototype", "name_original": "Robot 2D prototype", "description": "<p>Robot 2D is a simple platformer created in two days in Unreal Engine 4 using Unreal Engine's Paper2D tools. This prototype has a single level, wherein you search for a key, to unlock a door, and reach the Exit. There's also a <strong><em>Secret Area</em></strong>.</p>\n<p>Robot 2D was made while developing a video tutorial course on 2D development in Unreal Engine 4. The tutorial course was never greenlit, and this prototype sat on a hard drive . It is being released as a portfolio piece, and as an example of what can be done with the Paper2D tools in Unreal Engine 4.</p>\n<p>The game was originally designed for play on mobile devices, so there is an Android version available to download. There is also an HTML5 version to play in the Mozilla Firefox or Google Chrome browsers.</p>\n<p>The HTML5 version uses WebGL 1, and has been tested in Mozilla Firefox Quantum, version 59.0.2, and Google Chrome, version 65.0.3325.181; no other browsers or versions are guaranteed to work (it is a prototype after all ;-) ). Note that loading times for the game in HTML5 may vary by device and browser.</p>\n<p>The Android version requires Android Lollipop 5.0 or later.</p>\n<p>Enjoy!</p>\n<p>------------------------------------------------------------</p>\n<p><strong>Controls</strong></p>\n<ul><li>HTML5 version<ul><li><strong>A/D</strong> or <strong>Left Arrow/Right Arrow</strong> to move left and right</li><li><strong>Space Bar</strong> or <strong>W</strong> or <strong>Up Arrow</strong> to Jump, and to Read Signs</li><li>When you reach the <strong>Exit</strong>, use the <strong>P</strong> key to restart the game</li></ul></li><li>Android Version<ul><li><strong>Virtual Joystick</strong> to move left and right</li><li><strong>Tap Screen</strong> to Jump</li><li>When you reach the <strong>Exit</strong>, use the menu that appears to restart or close the game</li></ul></li></ul>\n<p>------------------------------------------------------------</p>\n<p><em>Note: </em>Since this is a prototype, it has some design issues, and probably has some bugs. The game is released as-is; and will probably not be worked on again (so, no bug fixes).</p>", "metacritic": null, "released": "2018-03-28", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/374/374f89956b1ea9e32307df34aa429dba.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 33, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "Web"], "developers": ["Jonathan A Daley"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}