{"id": 16970, "slug": "duet", "name": "Duet", "name_original": "Duet", "description": "<p>Your survival is dependent on protecting two vessels - they are devices in sync, a dance and song between two entities tethered together in symbiosis. Feel edge of your seat terror where the world around you becomes quiet and numb as all that matters is the game -- that is Duet.Gameplay<br />\nWith air tight controls and gameplay tuned to perfection, Duet provides the perfect balance between challenge and pure gaming satisfaction. Turn left and right to twist your vessels and avoid everything in your path. Remember: even that which begins simple can end complex.Nine Story Chapters<br />\nExperience nine chapters of deceptive narrative and nerve-twisting gameplay. Replay any stage to perfect your movements and unlock over 50 achievements. This is a game that will test you.Eight Epilogue Chapters<br />\nExplore a whole new narrative with all-new game mechanics in the Epilogue. Including over 40 stages, narrative and remix tracks, You will need a new state of mind to complete this experience.Challenges, Encore, and more!<br />\nStill can’t get enough Duet?<br />\nDiscover even more mind-bending challenges with the Encore Chapters.<br />\nCompete on the leaderboards in the Endless Mode, Epliogue Endless Mode and Encore Endless Mode.<br />\nHone your reflexes with the Speed Run Mode.Hypnotic Audio<br />\nAn outstanding handcrafted soundtrack by Melbourne composer and Gotye multi-instrumentalist Tim Shiel. Eighteen unique and mesmerizingly beautiful compositions ensure an immersive experience for you at every step of your journey, complemented by full in-game vocal narration by Jojo Petrina.About Kumobius<br />\nSelected for the Indie Showcase at PAX Aus and a finalist in both Game Design and Audio for the Freeplay Festival. This is another award-winning title from the team behind Time Surfer &amp; Bean’s Quest. We call Duet a “Hex-like” in honour of Terry Cavanagh’s contribution to the medium of games and exploration of genres.About Tim Shiel<br />\nTim Shiel is a composer/producer based in Melbourne. Tim is known to some as Faux Pas, the moniker under which he released a steady stream of constantly shifting electronic music for many years. He is also known for his work as a broadcaster at Melbourne independent radio station 3RRR FM, and for his recent role as multi-instrumentalist in Gotye&#39;s live band.</p>", "metacritic": null, "released": "2015-08-03", "tba": false, "updated": "2024-02-04T23:41:32", "background_image": "https://media.rawg.io/media/screenshots/c15/c15b292e62cd6596f71ca240e87ffc05.jpg", "website": "http://www.duetgame.com", "rating": 3.79, "rating_top": 4, "added_by_status": {"yet": 26, "owned": 388, "beaten": 23, "dropped": 13, "playing": 1}, "playtime": 4, "achievements_count": 76, "ratings_count": 33, "suggestions_count": 86, "game_series_count": 0, "reviews_count": 34, "platforms": ["macOS", "iOS", "Android", "PC", "Linux"], "developers": ["Kumobius"], "genres": ["Action", "Indie"], "publishers": ["Kumobius"], "esrb_rating": null}