{"id": 16987, "slug": "coh-2-the-western-front-armies-oberkommando-west", "name": "Company of Heroes 2 - The Western Front Armies: Oberkommando West", "name_original": "Company of Heroes 2 - The Western Front Armies: Oberkommando West", "description": "<p>By buying the OKW army individually, players who do not yet own any COH2 product can access all existing Company of Heroes 2 maps in auto-match, and play against all other existing factions in multiplayer or through skirmishes against the AI.<br />\nThe Oberkommando West, battle hardened and newly equipped, are a resurgent and very dangerous foe. Despite being challenged by an economy nearly shattered after years of continuous war, the Oberkommando West still manage to field some of the most impressive heavy armor yet seen:  the technical prowess of Germany is on full display as devastating armored force equipped with a new generation of super-heavy tanks repeatedly counterattack the US Forces attempting to drive into the heart of Germany. Seventy ton ‘King Tigers’ are supported by well-trained infantry; assault Sturmpioneers lead the way while capable Volksgrenadiers are a threat to enemy infantry and vehicles alike.<br />\nKEY FEATURESOBERKOMMANDO WEST<br />\nA completely new take on the German forces brings brand new abilities and new strategies to the frontline<br />\nTHE WESTERN FRONT<br />\nExpand the war to the popular Western Front theater of combat, featuring breathtaking new environments, that bring realism and vibrancy never before seen in the game<br />\nNEW MAPS<br />\nEight stunning new maps join the extensive collection of 23 existing Company of Heroes 2 maps as well as over 1,000 community created maps available on the Steam workshop<br />\nINTENSE ONLINE COMBAT<br />\nFeel the unprecedented ferocity of frontline strategic warfare and engage in visceral battle with adversaries across the globe<br />\nEVERY BATTLE TELLS A STORY<br />\nExperience the up-close moment-to-moment brutality of frontline warfare and control the battle through your military prowessOKW vs OTHER COH2 MULTIPLAYER ARMIESFind out the multiplayer army (and associated game/standalone) that suits your play style.</p>", "metacritic": null, "released": "2014-06-23", "tba": false, "updated": "2023-04-04T10:23:30", "background_image": "https://media.rawg.io/media/screenshots/076/07687cbae517b20e05698c0b895fff24.jpg", "website": "http://www.companyofheroes.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 590, "game_series_count": 0, "reviews_count": 1, "platforms": ["Linux", "macOS", "PC"], "developers": ["Feral Interactive", "Relic Entertainment"], "genres": ["Strategy"], "publishers": ["SEGA", "Feral Interactive"], "esrb_rating": "Adults Only"}