{"id": 169953, "slug": "cargo-truck-mountain-drive-sim", "name": "Cargo Truck Mountain Drive Sim", "name_original": "Cargo Truck Mountain Drive Sim", "description": "<p>Drive the legend cargo truck on mountain in this simulator game with smallest size of 24MB only.</p><p>You are mountain truck driver whose job is to deliver the cargo from one place to other.</p><p>Becoming a mountain truck driver was your childhood dream &amp; now this dream will become true.</p><p>Your job is to pick up the cargo from one hill station and drive the truck successfully to other warehouse.</p><p>Get behind the big beast monster truck and start delivering the cargo on the beautiful hill drives station.</p><p>Drive the mountain truck in this new mobile simulation game and improve your mountain truck driving skills.</p><p>Become off-road truck driver legend by driving the truck on the offroad mountain hill tracks.</p><p>Improvise your truck driving skills in this truck driving simulator game of 2016 and take them to next level.</p><p>Choose between different rides and use them as your cargo vehicle. Drive with great care on mountain roads.</p><p>The hill roads are very dangerous and very steep. So you have to be very careful while driving on these roads.</p><p>You also have time limit on making your delivery. So keep your eye on road as well as on time bar.</p><p>If you crash your truck by falling off the cliff, or crash in to mountains. Or if you cant make it within time the level will be failed.</p><p>Choose between 4x4 off-road pickup, flatbed truck &amp; a Big muscle cargo truck and let your journey begin on these cliffs.</p><p>Enjoy the beautiful hill scenes while driving this heavy loader on the beautiful hill valley.</p><p>Park your truck after crossing the finish point to finish the level. Keep your engine and start the second mission.</p><p>Drive the truck, complete the missions earn points and unlock new and power beast truck to take them on ride.</p><p>Make high score, beat your own high scores, top the leader board and earn respect other mountain truck drivers.</p><p>Features:</p><p>Realistic mountain hill drive.</p><p>Controls are very comfortable and smooth.</p><p>Choose between different cargo delivery vehicles.</p><p>All rides are tuned with good driving physics.</p><p>Lots of challenging levels to play and enjoy.</p><p>Improve your truck driving skills on difficult hill offroad tracks.</p><p>Feel like a real truck driver what he feels in real life.</p><p>Select between different controls to drive the trucks.</p><p>How To Driver:</p><p>Tilt your mobile left &amp; right device in tilt mood to.</p><p>Use steering wheel to drive in Steering mood.</p><p>Tap on left and right buttons in GUI mood to drive the vehicle.</p><p>Tap on accelerator to drive the vehicle.</p> Hit brake to stop and keep it hold to reverse.", "metacritic": null, "released": "2016-06-14", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/1af/1af1f86d475e30f2e4f8f40c07902009.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 282, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["TranspireUFD"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}