{"id": 17005, "slug": "puzzle-quest", "name": "Puzzle Quest: Challenge of the Warlords", "name_original": "Puzzle Quest: Challenge of the Warlords", "description": "<p>PuzzleQuest: Challenge of the Warlords delivers, for the first time ever, classic puzzle-game action backed with an epic story of good vs. evil.  Challenge your match 3 skills as you battle against computer opponents to save the Kingdom of Etheria from the evil Lord Bane.  Make matches of different crystal types which build your inventory of spells.  Outscore your oponents and unleash your spells to disrupt their matching chances and lower their totals.  Build your heroic character by winning head to head battles.  Or play classic match 3 in quick play mode.  Explore the expansive kingdom as you experience a puzzle game like nothing you have played before.<br />\nEmbark on an epic single-player campaign comprising more than 150 challenging quests.<br />\nJump into this exciting puzzle game and outmatch your opponent in Quick-play mode.<br />\nBuild your empire as you capture cities, build castles and gain a party of companions that will aid you in battle.<br />\nEarn money with each gold title to buy helms, weapons, armor and more!<br />\nExperience tiles grant you additional experience instantly.<br />\nMatch skull tiles to inflict damage on other players.</p>", "metacritic": 84, "released": "2007-03-16", "tba": false, "updated": "2023-09-14T09:28:26", "background_image": "https://media.rawg.io/media/screenshots/6c8/6c854d85985cccbd9c6278fd238e177a.jpg", "website": "http://www.1stplayable.com/gamesNintendo.asp", "rating": 4.0, "rating_top": 4, "added_by_status": {"yet": 15, "owned": 534, "beaten": 54, "toplay": 4, "dropped": 30, "playing": 7}, "playtime": 3, "achievements_count": 33, "ratings_count": 86, "suggestions_count": 521, "game_series_count": 2, "reviews_count": 86, "platforms": ["PlayStation 4", "PSP", "PlayStation 2", "Xbox 360", "Wii", "macOS", "PC", "iOS", "Nintendo Switch", "Nintendo DS", "PlayStation 3"], "developers": ["D3 Publisher", "Vicious Cycle Software", "Infinite Interactive"], "genres": ["Casual", "Puzzle"], "publishers": ["D3 Publisher"], "esrb_rating": null}