{"id": 170026, "slug": "stranger-treasures", "name": "Stranger Treasures", "name_original": "Stranger Treasures", "description": "<p><strong>THE GOAL</strong></p>\n<p>The main objetive is to find all the Pop references hidden in the Wheeler house.  But first of all, you must look for batteries, or you will see nothing...</p>\n\n<p><strong>THE GAMEPLAY</strong></p>\n<p>You must move around the house (WASD) and Interact with glowing objects (left click). The interaction comes with an GUI where it's shown information about the object. Then, you can rotate the object (left click and drag).</p>\n<p>As you find the objects, you can see in the wall how the \"christmas tree lights\" are turning on, as they turn on too in the HUD.</p>\n<p>When you find all, you will see that the TV is glowing both in game and HUD. It's time to watch TV!</p>\n<p>Enjoy!</p>\n\n<p><strong>PURPOSE OF THE GAME</strong></p>\n<p>The \"Stranger Treasures\" project is a personal work: a tribute for the \"Stranger Things\" series.<br/></p>\n\n<p><strong>NOTES AND CREDITS</strong></p>\n<p>The present work is a demonstration in low quality of an interactive environment inspired by the Stranger Things series of which I do not have any right: the only objective is to serve as a tribute and demonstrate my ability with UNITY 3D v.5.5</p>\n<p>It must be executed with administrator rights. The use of headphones is recommended for a better experience.</p>\n<p>For the preparation of the prototype, a series of specific scripts has been programmed with the help of the extensive documentation of Unity and its community:</p>\n<p>https://docs.unity3d.com/es/current/Manual/index.html<br/></p>\n<p>Likewise, a free particle system obtained in the Unity Asset Store has been used:</p>\n<p>https://assetstore.unity.com/packages/vfx/particles/simple-fx-cartoon-particles-...</p>\n<p>All 3D models, as well as textures, have been made specifically for the project.</p>", "metacritic": null, "released": "2018-07-25", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/33e/33ec456c4db3ce88377c90e49ba5799a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 69, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Vic Franco"], "genres": [], "publishers": [], "esrb_rating": null}