{"id": 170129, "slug": "jigster-a-square-deal", "name": "Jigster - A Square Deal", "name_original": "Jigster - A Square Deal", "description": "Your favorite Mobile Puzzle Game for Desktop! Redesigned from the ground up to take advantage of the larger screen space and offer new styles of play.<p>\n<br/>\n</p><p>\n</p><p>\n<br/>\n</p>Over 120 Amazing Jigs to Puzzle!<p>\r\n\tPuzzles are split into Collections ranging from Nature to Travel, in the hopes of helping you find that perfect one, quickly. Puzzle at your own pace, relax and enjoy the easy going music, or race the clock!\r\n</p>Slice the Puzzle to Your Size<p>\r\n\t\tCustomize each puzzle's difficulty by selecting the number of pieces and the ability to rotate these pieces. With 9 presets, ranging in piece counts from 9 to 121, and the option to do custom count setups, there is no lack of options.\r\n</p>Puzzle Options are Limitless!<p>\r\n\t\tUse your own images as the bases for your puzzling time. Load your personal images and group them into Collections.\r\n</p><p>\n</p><p>\r\n\t\tClassic - Want to enjoy some amazing puzzling fun, the same way it has been done for centuries, than you have found home.\r\n</p><p>\r\n\t\tDouble Trouble - With 2 Jigs inter-mixed, the race to bust both puzzles is more intense. Bonus for completing both with the same move\r\n</p><p>\r\n\t\tSpeed Runner - Can you bust 5 Jigs in the allotted time? It will take a quick mind and faster reflexes to bust them all before the clock drops to zero.\r\n</p><p>\r\n\t\tWeather - Battle the elements as you bust some jigs. Lucky Jigster is along to help.\r\n</p><p>\n</p>Difficulty Mods Pull You to the Extreme!<p>\r\n\t\tSelect none or every Difficulty Mod to ramp the challenge up to crazy levels! Each Mod increases the point value for busting Jigs, but be careful while combined a few make even small jigs worth large sums they are anything but easy.\r\n</p><p>\r\n\t\tRotate - Squares have all sides looking like up. Allows the pieces to be rotated.\r\n</p><p>\r\n\t\tCheckered - Cover half the puzzle? Sounds easy, but can you use your mind to connect the hidden tiles?\r\n</p><p>\r\n\t\tFlashlight - The darkness adds a new level, as you can only see pieces revealed by the light on your cursor.\r\n</p><p>\r\n\t\tBlink - Pieces randomly flip over and some even return right-side-up, can you still bust the jig with special shapes to guide you?\r\n</p><p>\r\n\t\tPerspective - Pieces randomly rotate, can you still bust that jig with all of the pieces turned in the wrong direction?\r\n</p><p>\r\n\t\tScattered - Dump that Jig's tiles on the table and get to work. Game starts with pieces scattered across the tabletop.\r\n</p><p>\n</p><p>\r\n\tCarefree - Relax and enjoy solving some beautiful puzzles without the need to watch the clock\r\n</p><p>\r\n\t\tTimed - Curious to see how long it took to bust that jig, this is the perfect mode for you\r\n</p><p>\r\n\t\tTime Limited - Ready to challenge your puzzle solving, and quick clicking skills?\r\n</p><p>\r\n\t\tRecord Buster - Train for that top spot on a puzzle by setting the clock to your shortest time and go for the gold!\r\n</p><p>\n</p><p>\r\n\t\tJigster Vision - Need to see what the busted puzzle looks like, this is the perfect hint for you\r\n</p><p>\r\n\t\tJigFrame - Square pieces can make things hard, use this hint to place a frame around the edge pieces to good handle on the puzzle, especially the large piece count ones.\r\n</p>Jigster on Greenlight", "metacritic": null, "released": "2017-03-14", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/928/928cd5a8209919f3269c14c5a321022e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 66, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["hostileviking"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}