{"id": 17012, "slug": "lucius-ii", "name": "Lucius II", "name_original": "Lucius II", "description": "The story of Lucius II continues where the original left off: Lucius emerges as the lone survivor of the burning wreckage his parents once called home, unscathed from the ruthless slaughter he had unleashed.  <br/>He had taken the weak and punished the wicked. He had looked through their souls and found the true selves they had been hiding.<br/><br/>Lucius is taken to the psychiatric ward of St. Benedict’s Hospital by unsuspecting caretakers. The Book of  Revelation predicts the birth of a child that would end up ruling the world with an iron rod. The first part of this prophecy has been fulfilled. It is time to take care of the rest. Whispers of a prophecy find their way to the boy's ears. Lucius decides to act again to regain his powers. But little does he know of his new adversaries...<br/><br/><br/><strong>Game features:</strong><br/><ul><li>Lucius II has a unique twist where you play the bad guy and wreak havoc as the son of the devil.<br/></li><li>3D Splatter adventure sandbox that continues the story of the original game.<br/></li><li>Over 100 potential victims.<br/></li><li>Lucius can now explore a vast five storey hospital and the small town of Ludlow. <br/></li><li>Homage to the classic horror movies. You can find references to different titles all over the game.<br/></li><li>Create your truly own unique traps by using a complex combination system and various tools.<br/></li><li>Each level is its own sandbox where you can decide when, how and who to kill.<br/></li><li>Create your own unique Lucius by choosing your favorite supernatural abilities.</li></ul>", "metacritic": 48, "released": "2015-02-13", "tba": false, "updated": "2024-03-30T05:18:52", "background_image": "https://media.rawg.io/media/screenshots/f3b/f3b177ac7f7438e9b60fd6b6783077f0.jpg", "website": "http://lucius2.com", "rating": 2.42, "rating_top": 3, "added_by_status": {"yet": 44, "owned": 544, "beaten": 36, "toplay": 5, "dropped": 24, "playing": 1}, "playtime": 5, "achievements_count": 65, "ratings_count": 49, "suggestions_count": 387, "game_series_count": 3, "reviews_count": 50, "platforms": ["PC", "Linux"], "developers": ["Shiver Games"], "genres": ["Action", "Adventure", "Simulation", "Indie"], "publishers": ["Shiver Games"], "esrb_rating": null}