{"id": 17016, "slug": "zombie-kill-of-the-week-reborn", "name": "Zombie Kill of the Week - Reborn", "name_original": "Zombie Kill of the Week - Reborn", "description": "<strong>Zombie Kill of the Week - Reborn</strong> is a challenging, fast paced, 2D survival shooter! And when we say fast, we mean breakneck, flat-out, adrenaline fuelled fast!  What’s different from the other shooters is your goal isn’t to run through levels and finish the game, but to survive for as long as possible under increasingly frantic conditions (we say as long as possible because ultimately you will die!).<br/><br/><br/> <br/>Seems simple enough, but where Zombie Kill of the Week - Reborn really takes off is in the added layers of depth and huge variety of features and customisation available. Players earn money for slaughtering the zombies (money might not bring you happiness, but it does buy you guns!). We live in a consumer society after all, which is useful, as you can spend big on over 25 different weapons (including chainsaw, katana, mini-gun, RPG, D.O.M. and many others!). You also need cash to open doors, activate jumps, buy new weapons, or hunt for the magic fridge and see what loot drops are inside! In short… the longer you survive, the more weapons and prizes you get.<br/> <br/>Surviving longer also gains you ZKW-Points which you can cash in to totally customize your character, customize your weapons, buy new weapons, buy different perks, open new maps, and a lot lot more! Players also earn XP as they play, allowing them to level-up their character and develop them to fit their chosen gameplay skills. Survival is all about the margins, and every little extra helps!<br/><br/><br/> <br/>The Steam release also features an exclusive level editor for the Zombie Kill of the Week - Reborn community, which allows the community to create their own custom and bespoke maps, then share them with friends (and enemies) for everyone to enjoy. Endless permutations and maps means endless challenges.<br/> <br/>With a compelling single player survival mode, as well as cooperative multiplayer for up-to four players, this is one zombie firefight you are not going to want to miss! If that wasn't enough you can even play cross-platform play with Android owners too!<br/><br/><br/><br/><ul><li>Kill zombies with a very wide arsenal of weapons, including: Chainsaw, RPG, D.O.M., katana and many others! <br/></li><li>Over 20 Steam Achievements<br/></li><li>5 stunning maps <br/></li><li>Exclusive Level Editor for PC. Create your own custom maps, then upload and share with friends. <br/></li><li>Cooperative multiplayer for up-to 4 players<br/></li><li>Full controller support<br/></li><li>Online highscores<br/></li><li>Cloud profiles<br/></li><li>Weapon customization<br/></li><li>Player customization<br/></li><li>Skills, trophies, perks, blood and gore!<br/></li><li>Original sound tracks composed by Roland La Goy<br/></li><li>Cross-platform play with Android allowing you to carry on playing on the go!</li></ul><br/>http://store.steampowered.com/app/310850", "metacritic": null, "released": "2015-03-13", "tba": false, "updated": "2024-01-22T16:12:05", "background_image": "https://media.rawg.io/media/screenshots/bd7/bd72eb1c7a14a886fc80a6cfb0cb8f9b.jpg", "website": "http://www.stillrunning.fi/", "rating": 1.93, "rating_top": 1, "added_by_status": {"yet": 8, "owned": 302, "beaten": 2, "toplay": 1, "dropped": 3, "playing": 1}, "playtime": 4, "achievements_count": 31, "ratings_count": 15, "suggestions_count": 192, "game_series_count": 0, "reviews_count": 15, "platforms": ["macOS", "PC"], "developers": ["Still Running"], "genres": ["Action", "Indie"], "publishers": ["Merge Games", "Tagstar Games"], "esrb_rating": null}