{"id": 170220, "slug": "love-in-death", "name": "Love in Death", "name_original": "Love in Death", "description": "<p>Vous devez jouer en 16:9 - (1920x1080, 1280x720)</p><p>Contrôles:</p><p>Côté Nubien:<br/>Actions - 1, 2, 3, 4<br/>Mouvement - Q, W</p><p>Côté Égyptien:<br/>Actions - 7, 8, 9, 0<br/>Mouvement - U, I</p><p>Ce jeu a été créé par Outerminds dans le cadre du Gamejam « Jam Nations » du 3 au 5 juin 2016.<br/></p><p>Nous voulions absolument jouer la carte de l'originalité et nous avions en tête de fabriquer notre propre manette. Nous étions prêts à toute éventualité et nous avions acheté un grand éventail de boutons et d'interrupteurs. </p><p>Le thème choisi par l'Opéra de Montréal fut l'Opéra « Aida ». Nous voulions donc absolument illustrer l'amour impossible entre Aida la princesse nubienne et Radamès le capitaine égyptien.</p><p>Les deux clans opposés d'Aida et de Radamès sont représenté par un mur qui traverse l'écran. À gauche on peut y voir le clan nubien représenté en vert et à droite avec la couleur dorée on y retrouve le clan égyptien.</p><p>Lors du deuxième jour, on nous a imposé d'inclure une pyramide. Nous avons donc changé l'environnement afin que l'action se déroule à l'intérieur d'une pyramide séparée par un mur.</p><p>Le tout se joue à 2 joueurs et on doit utiliser une série de boutons non-identifiés sur la manette que nous avons construit pendant le weekend. Ceux-ci changent aléatoirement après chaque partie. Notre manette représente un artéfact magique qui permet aux joueurs d'influencer le triste destin d'Aida et Radamès.</p><p>Un joueur contrôle Aida et l'autre contrôle Radamès à travers une série de pièges et d'obstacles. Chaque bouton sert à aider le joueur à franchir les obstacles mais chacun d'eux possède aussi une conséquence : L'activation d'un piège pour l'autre joueur. </p><p>Telle une finale à la Roméo et Juliette, chaque fois qu'un joueur meurt, le deuxième s'enlève la vie afin de le rejoindre pour un amour éternel. </p><p>Imaginez trouver un appareil semblable dans une pyramide qui permettrait d'activer des portes! Le processus serait génial en public et les gens curieux appuieraient sur des boutons et comprendraient que c'est en fait eux qui contrôlent les personnages à l'écran!</p><p>Il est aussi possible de jouer au jeu avec un clavier mais l'expérience de jeu est bien meilleure avec la manette personnalisée que nous avons fabriquée.</p><p>La finale du jeu est un clin d'œil à la finale de l'Opéra. Puisque les deux protagonistes meurent enfermés dans le temple, nous avons décidé d'illustrer à nouveau leur réunion par la mort. </p><p>Voici pourquoi notre jeu s'intitule « Love in Death » ou l'amour dans la mort. </p><p>Merci beaucoup et bonne partie!</p><p> Artiste :<br/> Sylvain Savard</p><p>Programmeurs :<br/> Nicolas Brunet-Messier<br/> Dalin Son<br/> Thomas Pradeilles</p><p>Électronique et Musique Originale :<br/> Guiz de Pessemier</p>", "metacritic": null, "released": "2016-06-05", "tba": false, "updated": "2019-08-28T23:21:33", "background_image": "https://media.rawg.io/media/screenshots/689/689bee5d79df43509b903d0ecb2070ba.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 129, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Outerminds"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}