{"id": 170228, "slug": "gathering-knights", "name": "Gathering Knights", "name_original": "Gathering Knights", "description": "<p>Thank you for taking the time to play Gathering Knights. I did not have as much time in the past week as I would have liked so its only a concept right now and not really a full game yet; Still I have personally had fun creating a nice town and then zooming in and walking around in it.</p><p>Build a nice town. After you build a building little guys will spawn that will automatically collect resources allowing you to build even more and bigger buildings.</p><p>CONTROLS: (Left and right controller can obviously be switched if you prefer)</p><p>Teleport: Right touchpad</p><p>Zoom: Left or Right grip button at side of controller; Hold grip if you want a gradual zoom</p><p>Building: Select the building / decoration menu with the left touchpad, then pick the building you want to build up with the trigger of the right controller and place it in the world. You can pick the building up and change its position once again with the right trigger.</p><p>KNOWN CRITICAL BUGS:</p><p>There are many small bugs, but I have only found one that will crash the game: please make sure you keep the building menu open until after you have placed a building to prevent the game from crashin</p><p>Even though the project isnt remotely finished, as this is my first game I am still a bit proud of the result and am definitely planning on continuing the work on this.</p><p>Special thanks to /u/nvmsocool/ for hosting this game jam , the great community of /r/Vive and to the awesome people in the unity asset store who make the assets that made this game possible by providing great free assets like the models for buildings and knight</p><p>Hope you enjoy!</p><p>/u/Dazovide</p><p>PS I am always interested in working together with someone else; feel free to send me a message ;)</p>", "metacritic": null, "released": "2016-08-28", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/922/9229b39046ab764f80397d464baa5c51.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 69, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Dazovide"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}