{"id": 17030, "slug": "sir-id-like-to-report-a-bug", "name": "Sir! I'd Like To Report A Bug!", "name_original": "Sir! I'd Like To Report A Bug!", "description": "After some new prototype tech goes screwy and causes bugs to escape into the world only one man can save the day. <br/><br/>That man is Reggie! An average, couch potato games tester with no talents what so ever! Help our new savior venture to and from work while the world around him slowly glitches out and breaks during his working week. <br/><br/>Overcome obstacles such as killer cars, lava floors and one seriously ♥♥♥♥♥♥ off sun, tackle the horrors of the daily commute but with more fire and randomness. Don't think that this is a fun, cute adventure though, the world wants you dead! Dead! <strong>Dead!</strong> <strong>DEAD! </strong><br/><br/>Still think you're up to the challenge and can help save the day?Features:<ul><li>Classic hard-as-nails 2D platformer gameplay <br/></li><li>Seriously, this game is hard. It will make you rage. <br/></li><li>Very shiny pixel art, look at how beautiful it is! <br/></li><li>A raving, chip-tune inspired soundtrack. Turn that volume up! <br/></li><li>Each level is unique thanks to the army of bugs blowing up the world! <br/></li><li>Jam packed with humor and references <br/></li><li>Challenge mode for those that fancy a little bit more <br/></li><li>The only game in history to ever feature flying old people, bouncing buildings and a level based on Eiffel 65's \"Blue (Da Ba Dee)\"<br/></li><li>Is it really too hard for you? Fine! Have a brand new easy mode with checkpoints <br/></li><li>More responsive control thanks to keyboard and controller support <br/></li><li>In game achievements<br/></li><li>Trading cards to collect or flog for a few pennies!</li></ul>", "metacritic": null, "released": "2013-10-23", "tba": false, "updated": "2019-08-28T22:10:37", "background_image": "https://media.rawg.io/media/screenshots/f6a/f6a1d3c35be275ae1b81e115a3ddbb00.jpg", "website": "http://lordpuggingtongames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 58}, "playtime": 3, "achievements_count": 6, "ratings_count": 0, "suggestions_count": 275, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "PC"], "developers": ["Lord Puggington Games"], "genres": ["Action", "Indie", "Platformer"], "publishers": ["Lord Puggington Games"], "esrb_rating": null}