{"id": 170312, "slug": "cubiculo", "name": "CUBiCULO", "name_original": "CUBiCULO", "description": "<p><strong>CUBiCULO </strong>is a memory game based on Simon's concept, where was given a color sequence that you need to reproduce triggering the cubes of the same color. At each round iteration the number of colors in the sequence is incremented, the objective is to achieve the maximum number of rounds.</p><p>  With 3 different modes this is a game for train your brain and have a good time. </p><p>The <strong>CLASSiC </strong>game mode consists in repeating the sequence of colors that light up randomly on the cubes.<br/>This objective is achieved  by triggering the correct cube, incrementing the sequence on the next round.</p><p>The <strong>MAGiC CUB</strong> mode is similar of the classic, but also the number of cubes and colors are incremented when you achieved a successful reproduction.<br/>The way of playing is also similar of the classic mode.</p><p><strong>CAN YOU Si iT? </strong>it's the most difficult game mode and is specifically for Virtual Reality.</p><p>In this mode the cubes are invisible and you need to look directly to make them appear. The sequence is presented in the monitor on the desk and you need to find the cubes in random positions for complete the sequence.</p><p>If the Cube is visible you only need to open-close your hand. <br/>At the end of each successful sequence you need to look again at the monitor to see the new incremented sequence.</p><p>Credits</p><p>Game Development:  http://www.retrai.co</p><p>Music:  http://www.bensound.com</p>", "metacritic": null, "released": "2015-11-10", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/727/727e7fd236429ea61786ef02a089bdd9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 67, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Re|trai"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}