{"id": 170410, "slug": "real-card-simulator", "name": "Real Card Simulator", "name_original": "Real Card Simulator", "description": "This is an early WIP in progress demo! :3Use an X-Box controller or a keyboard to control the hands and build a house of cards. <p>The higher you can get your house the better your score will be. Use the <strong>TIME STOP</strong> to help place the cards! You get a total of <em>30 seconds</em> of <strong>TIME STOP</strong> until you reset. <em>How tall can you build?</em></p><em>VOTE FOR IT ON GREENLIGHT NOW!</em>\r\nX-Box pad control scheme:\r\n<ul>\n<li>Left stick controls left hand, right stick controls right hand. The D-pad controls the head. </li><li>LB is card drop left, RB is card drop right. Left and right joystick buttons toggle between position and rotation per hand. </li><li>The A button toggles the gravity (<strong>TIME STOP</strong>) for the cards and the table. </li><li>Reset the table, head and hands, and return cards with the Back button.</li></ul>\r\nKeyboard control scheme:\r\n<ul>\n<li>Left hand: WASD for movement. Q and E control hand rotation, and F and V distance. </li><li>Right hand: IJKL for movement. U and O control hand rotation, and H and N distance.</li><li>Left Shift drops left cards, right Shift drops right cards.</li><li>Space toggles the gravity (<strong>TIME STOP</strong>) for the cards and the table. </li><li>Reset the table, head and hands, and return cards with backspace. </li><li>The arrow keys control the head.\r\n </li></ul><p>\n<strong>\r\nA maximum of 52 cards available at the same time. Currently only stacking works. Enjoy. :3</strong></p>Known bugs &amp; issues:\r\n-Rendering might look weird on some video cards\r\n-Sensitivity is not accurate across systems/devices", "metacritic": null, "released": "2014-08-01", "tba": false, "updated": "2019-08-23T11:39:09", "background_image": "https://media.rawg.io/media/screenshots/470/470071a2b998d777e5f5525c7341d142.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 12, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Colonthree Enterprises"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}