{"id": 17074, "slug": "the-political-machine-2016", "name": "The Political Machine 2016", "name_original": "The Political Machine 2016", "description": "Let the campaign begin!<br/><br/><strong>Your goal:</strong> Win the hearts and minds of America’s voters to achieve victory in the 2016 presidential election. Play as one of more than a dozen candidates such as Bernie Sanders, Donald Trump, Hillary Clinton, and more! <br/><br/>Think you can do better than the other candidates? Create your own candidate from scratch and show the rest of those windbags how to make a real run for the White House. Take to the campaign trail and try to out talk, outsmart, and out spend your opponents! <br/><br/>The Political Machine 2016 features updated relevant political topics from across the 2016 presidential campaign. Dozens of national issues including the Keystone XL Pipeline, human trafficking, and the Iran Nuclear Deal have been added, with more updates on the way as the season continues. Regional issues require the candidate to walk a fine line between appealing to the widest range of voters or appearing to “flip flop.”<br/><br/>Gaining favor from your voters by interviewing on talk shows might grant you some sympathy, but not everything can be swept under the rug forever. You must always be on the lookout for career-ending scandals like a torrid affair, natural disaster, or an unsavory email trail. They can pop up at any time and change the course of the campaign -- which can put you down in the polls! <br/><br/>Do you think you have what it takes? Take to the campaign trail and show the nation why you should be the next President of the United States of America!Core Features<ul><li> <strong>Time for some Mudslinging!</strong> - Use your power and money to purchase ads to discredit your opponent and influence voters.<br/></li><li> <strong>Dozens of Candidates</strong> - Play as one of several pre-made past and present candidates like Donald Trump, Hillary Clinton, Sarah Palin, Barack Obama, and more.<br/></li><li> <strong>Turn Friends into ‘Frenemies’</strong> - Challenge a friend for the presidency in multiplayer mode.<br/></li><li> <strong>Create a Candidate</strong> - Not a fan of the candidates? Create your own custom front runner and race for the White House.<br/></li><li> <strong>Out-talk, Out-smart, and Out-spend your opponents</strong> - Gain favor with the public by interviewing on talk shows, navigate disastrous random events, and buy advertisements to gain an advantage over your adversary.<br/></li><li> <strong>Practice your Politics</strong> - A sophisticated underlying simulation model uses census data and real issues to test your political savvy.<br/></li><li> <strong>Be Ready for Anything</strong> - Torrid affairs, natural disasters, email scandals, and other random events can come out of nowhere and change the direction of the campaign for better or worse.<br/></li><li> <strong>Check your Standings</strong> - With poll tracking and leaderboards, you can see how well people are playing as their candidates or what issues they are supporting over time.</li></ul>", "metacritic": null, "released": "2016-02-04", "tba": false, "updated": "2019-09-17T08:27:36", "background_image": "https://media.rawg.io/media/screenshots/7f7/7f7159db791f6423da090c1359cd672d.jpg", "website": "http://politicalmachine.com/", "rating": 2.54, "rating_top": 1, "added_by_status": {"yet": 7, "owned": 252, "beaten": 3, "dropped": 10}, "playtime": 2, "achievements_count": 24, "ratings_count": 13, "suggestions_count": 351, "game_series_count": 0, "reviews_count": 13, "platforms": ["PC"], "developers": ["Stardock Entertainment"], "genres": ["Strategy", "Indie"], "publishers": ["Stardock Entertainment"], "esrb_rating": null}