{"id": 17073, "slug": "prio", "name": "PRiO", "name_original": "PRiO", "description": "PRiO is a visually-striking, yet challenging platformer about manipulating the environment around you.<br/><br/>To complete a stage, you must light up all the blocks in a level. The only problem is that not every block is active at the same time. You must toggle between Red, Yellow, and Blue blocks to navigate each level without getting shot by turrets, impaled on spikes, or falling to your death.<br/><br/><br/>Key Features<ul><li> 50 Action-Packed Levels<br/></li><li> Endless Mode<br/></li><li> A Fully Functional Level editor<br/></li><li> Striking Visuals<br/></li><li> A Gorgeous Original Soundtrack<br/></li><li> Full Controller Support<br/></li><li> Color-Blind Friendly</li></ul>CampaignPRiO comes with 50 exciting levels to keep you busy for hours upon hours. This game is built around a simple concept of toggling the environment in order to navigate. In the beginning, it may seem easy enough to handle, but as the levels go by, you'll quickly realize the challenge that confronts you.Endless ModeIn addition to a plethora of challenging levels, this game also comes with an Endless Mode. Race against a rising floor of deadly spikes by endlessly climbing higher and higher in a randomly generated level. You can never beat endless mode, but you can rack up a nice highscore by lighting up blocks in your frantic escape from an inevitable death!The Level EditorYes, you read that correctly! You could be the proud owner of a fully functional level editor to create your own masterpiecel. Save and load levels for later! Not only that, but you can even copy the level-code to your clipboard and paste it somewhere for your friends to copy and paste into their own editor. No file transfers necessary!VisualsPRiO was meant to be a visually pleasing experience. While the gameplay itself is challenging, your eyes will have a wonderful time letting in all the beautiful lighting effects and particles.SoundtrackThe absolutely gorgeous soundtrack for this game was created by Erik Danielson at <strong>http://erikcld.bandcamp.com</strong>Color-Blind FriendlyBecause PRiO is about the three primary colors, it comes with a color-blind option for those who need it. <br/><br/><br/><br/><br/>PRiO is currently only available on Windows.<br/><br/>Please note: The game is completely functional using a keyboard and mouse, however it's highly recommended that you use a Gamepad to play PRiO.", "metacritic": null, "released": "2016-03-18", "tba": false, "updated": "2019-08-28T22:10:36", "background_image": "https://media.rawg.io/media/screenshots/96c/96c767888663e6311f36c5a6a4bb22cb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 27}, "playtime": 1, "achievements_count": 9, "ratings_count": 1, "suggestions_count": 106, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["DanielDavisGames"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["DanielDavisGames"], "esrb_rating": null}