{"id": 170729, "slug": "violent-settlers", "name": "Violent Settlers", "name_original": "Violent Settlers", "description": "<p>I first envisioned this game as a city building game somewhat like Settlers of Catan. However, the key difference was that in addition to building cities and roads, you could also stage an armed assault on an opponent's city. The armed assault would procedurally generate an FPS level based on the terrain of where the city was placed, and you could either win or lose the assault, which would decide who had possession of the city in the end. This would all be based on the economy (militaries are expensive, after all). You would also have ways to pay for increased defenses in your city.<br/><br/>There is a lot missing right now. Currently two players can alternate placing cities, and can select each other's cities to attack. This will launch into the fps mode, which you win by killing all the enemies. The enemies are currently statues that pose you no real threat, but suffice to say with some more time to implement AI, they would more than happy to destroy you! The first player to get to 10 cities wins.<br/><br/>(I couldn't get the \"quit game\" button to work at the end, so you just have to alt+f4 when you get there).</p><p>This project has been a huge learning experience for me. I had set a personal goal of creating a game for this Jam, even though its been years since I've done even basic programming. The game is mostly hacked together free assets from the store (primarily FPS Constructor, the Troll Model, and the moving water texture), but even that was a whole week's worth of effort for me. It was a great experience though, and I'd really like to thank the GOL guys for hosting this event, which motivated me to jump in and give it a try. I hope you can enjoy this game as a early demonstration of the idea I was going for.<br/><br/>I'd like to keep working on this, however its clear that I need to build the codebase from the beginning, since its so messy and hacky I'm sure it would give any legitimate programmer a heart attack! Also I've realized it was probably too ambitious for a first stab at game making, so I might try some simpler games. I am very interested in procedural generation algorithms, which is one of the things I was hoping to implement here, so I might try some simpler projects based on that.<br/><br/>Thanks for taking a look!</p>", "metacritic": null, "released": "2015-10-25", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/454/454e41742c0764253a1a79b506877434.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 52, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux"], "developers": ["ObsidianOps"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}