{"id": 170839, "slug": "haven-itch-william-bundy", "name": "Haven (itch) (William Bundy)", "name_original": "Haven (itch) (William Bundy)", "description": "<p>Haven is a lightweight town management sim written for LD40. </p><p>Think of Haven as cross between a non-spatial DF/RimWorld and CivClicker; you have to manage your colony of people by assigning jobs and projects, keeping them fed, and letting them rest. During the day, you have to deal with a constant stream of events that, if not responded to, will eventually destroy your haven.</p><p>If you aren't rating the compo version, I recommend playing the newer, \"postcompo\" version instead. While the changes aren't particularly major, they are significant to improving the feel of the game.</p><p>Changelog for the postcompo version: </p><ul><li>Added OpenGL 3.1 support, which means some people with very old intel GPUs can play.</li><li>You can now resize the window! Sizes below 1280x720 are not guaranteed to be readable, though. The default screen width is now 1400x720, which solves a lot of text wrapping problems.</li><li>Fixed and tweaked some transparency. Backgrounds should be darker now.</li><li>Made buttons larger and added a rim. This should make it easier to identify and hit them.</li><li>Added a list of changes to people (health, hunger, etc) at the end-of-day screen.</li><li>Clarified some text with regard to traders.</li><li>I think I fixed some of the weirdness with hunger that was happening, though maybe only I noticed that.</li><li>Fixed some events that weren't working as indented.</li><li>Tweaked the overall speed and balance of the game. The beginning is now much slower, green events occur more often, and buildings' work costs have been tweaked to be easier.</li><li>Added a couple new events. Sometimes, builders and craftsmen will show up to help you, for a fee. People sometimes have rough days as well as happy ones.</li><li>Added some colored text and animated effects to help draw attention to things: if there isn't a crafting/building job set, the job text for people working on that will be red; the message text in the beginning now moves to grab your attention; the tutorial text about crafting/building is now in green.</li><li>Internally, I've split stuff up into multiple files and worked to compress some of the noisier code. It's much nicer to work on now.</li></ul>\n<p>Written in C using SDL2, Win32, and a bunch of stb libs.</p>\n<p>Currently only for 64 bit windows</p>", "metacritic": null, "released": "2017-12-04", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/805/80520a950034e3c18bde53e73b91651a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 8, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["William Bundy"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}