{"id": 17082, "slug": "ink", "name": "INK", "name_original": "INK", "description": "INK is a fast-paced platformer about using colorful paint to uncover your surroundings.<br/><br/>INK has a similar feel to hardcore platformers like Super Meat Boy. The object of each level is to defeat all of the enemies in the room (if any) and reach the goal. However, the terrain is invisible to the player. The player can discover terrain by physically bumping into it, or by performing a double jump. The double jump sprays paint bullets out of the player and increases the player’s awareness of their surroundings. If the player happens to bump into spikes or falls to their death, paint will also shoot out from the player’s last position. The room isn’t wiped clean after death so that the player has an easier time navigating after multiple attempts! This expanded Steam version includes new mechanics, Boss encounters to provide a nice challenge and a change of pace.Deluxe EditionThe Deluxe Edition includes a copy of INK plus the Soundtrack + Art DLC all in one place!Key Features<ul><li><strong>75 platforming levels</strong> to test your skills<br/></li><li>Defeat challenging <strong>Bosses</strong>!<br/></li><li>Jump on <strong>enemies</strong> to open the exit portal<br/></li><li><strong>Explore</strong> levels by painting them with your double jump or, well, dying. Death has never been so useful!<br/></li><li>Experience the game’s <strong>tight and responsive controls</strong> that don’t make you feel cheated when you die</li></ul>", "metacritic": 68, "released": "2015-08-05", "tba": false, "updated": "2023-10-18T00:39:00", "background_image": "https://media.rawg.io/media/screenshots/213/213a68b31610ab16829d2707f0a6387e.jpg", "website": "", "rating": 2.84, "rating_top": 4, "added_by_status": {"yet": 43, "owned": 776, "beaten": 14, "toplay": 8, "dropped": 16}, "playtime": 3, "achievements_count": 48, "ratings_count": 50, "suggestions_count": 123, "game_series_count": 4, "reviews_count": 50, "platforms": ["Xbox One", "PlayStation 4", "Nintendo Switch", "PC", "Linux", "macOS"], "developers": ["Digerati Distribution", "Spaceboy", "ZackBellGames", "kittehface"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Digerati", "ZackBellGames"], "esrb_rating": "Everyone"}