{"id": 17097, "slug": "goetia", "name": "Goetia", "name_original": "Goetia", "description": "The ruins of any village are the silent testament to its final moments. The ruins of Oakmarsh are no different. Their telling silence, the dust blanketing what was once a quiet village near Coventry.<br/><br/>The name of a manor and the family that lived within. A perverted and mad lineage, a clan whose final members devoted their life to mysticism and fanatical experiments. I am Abigail. Abigail Blackwood. Recently risen from the grave, I know nothing about the last 40 years of my family’s history... But obviously somebody is keen on seeing me lift the veil on what happened in Oakmarsh - to what led to the downfall of Blackwood Manor. And it seems like I have no choice in the matter…<br/><br/><strong>Key Features</strong><br/><ul><li>A 2D world of Victorian mystery.<br/></li><li>Over 90 rooms to explore.<br/></li><li>Five vast and diverse areas to discover - Blackwood Manor is surrounded by ruins, woods, caves and an abandoned village.<br/></li><li>A progressive-rock and ambient-inspired soundtrack.<br/></li><li>Use your ability to walk through walls in order to reach secret rooms and areas.<br/></li><li>Possess objects like a poltergeist to lift them, use them, combine them, make them float in the air, pile them up… well, you’re a ghost after all, behave like one!<br/></li><li>Solve puzzles in more than one way by discovering hidden rooms and special features, such as new ghostly powers.<br/></li><li>Delve into Blackwood’s story: 40 years have passed, and many things have changed since Abigail’s death.<br/></li><li>Feel free to explore! You can travel through the world of Goetia however you like - and if you get stuck, simply backtrack and explore another area.</li></ul>", "metacritic": 79, "released": "2015-05-19", "tba": false, "updated": "2024-01-21T20:06:29", "background_image": "https://media.rawg.io/media/screenshots/6ae/6ae179d89d253b92542849ad73c72569.jpg", "website": "http://playgoetia.com/", "rating": 2.67, "rating_top": 3, "added_by_status": {"yet": 55, "owned": 957, "beaten": 11, "toplay": 7, "dropped": 11, "playing": 1}, "playtime": 3, "achievements_count": 50, "ratings_count": 32, "suggestions_count": 292, "game_series_count": 0, "reviews_count": 33, "platforms": ["PC", "macOS", "Nintendo Switch", "PlayStation 4", "Xbox One", "Linux", "iOS"], "developers": ["Forever Entertainment", "Sushee"], "genres": ["Adventure", "Indie"], "publishers": ["Square Enix", "Forever Entertainment"], "esrb_rating": "Everyone 10+"}