{"id": 171111, "slug": "plane-defensive", "name": "Plane Defensive", "name_original": "Plane Defensive", "description": "<p><em> Defend your home on the plane against invaders from the third dimension!</em></p>Some time ago, your cities started getting attacked. The assailants come not  from East, West, North, or South - but from Outside. Fortunately, scientists were able to develop detectors which see into the beyond, and deflectors which kick the invaders back out.Gameplay<p>You must protect your square resources, while being limited to dragging and dropping in two dimensions. However, your triangular detectors give you proximity information about the position of the invaders before they enter your plane of existence, the better to prepare your octagonal deflectors. Use all your senses, and remember: <em>shelter is mathematically impossible</em>.</p>Background<p>This prototype is the starting point of a long-term project for developing intuitions and insights into indirect sensation. While I hope to develop it into a fully-fledged game in its own right, I also plan on exploiting the lessons I learn here and use them to push the boundaries of three-dimensional interfaces into higher-dimensional game worlds.</p>Technical note<p>If the web version is not running smoothly, try one of the Windows or Mac stand-alone packages.<br/></p>Intellectual property notice<p>Plane Defensive™ © 2016, Klil H. Neori. All rights reserved.<br/></p><p>Built with the Unity® Engine, which is a trademark of Unity Technologies.</p><p>Sound effects created with Bfxr.</p><p>Credits, title, and cursors created with Paint.NET.</p><p>Font used in credits and title is Bitstream Vera Sans.</p><p><strong>July 1st, 2016 Update:</strong> Version 0.3.3 is now available. All rights reserved.<br/></p><p>Bugs fixed:</p><ul><li>Movable objects no longer clip out of frame if moved quickly enough.</li><li>Mouse cursor is now the same size on all platforms.</li></ul><p>Improvements:</p><ul><li>Save more structures to gain a higher score!</li><li>Movement is now slower, to increase suspense.</li><li>Movable elements now capable of spinning around, to make close-quarters navigation more fluid.</li><li>Gradual introduction to game features, with an illustration of drag-and-drop for those unfamiliar with it.</li><li>Defaults to full screen to avoid confusing configuration dialogue.</li></ul><br/>", "metacritic": null, "released": "2016-05-23", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/72d/72d982b29f32866bfb54e3521a077d4b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 1, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Web"], "developers": ["Klil H. Neori"], "genres": [], "publishers": [], "esrb_rating": null}