{"id": 171105, "slug": "airshow2000", "name": "Airshow2000", "name_original": "Airshow2000", "description": "<p>Eight different models to enjoy with. Spanning from the vintage Mirage to the fifth generation Sukhoi Pak-Fa.</p>\n<p>Purchase them with the coins you earn by making it through the various challenges; passing through gates and completing the given routes within the given times.</p>\n<p>In free flight mode, drive the planes and view your aerobatics in realtime through ten different cameras:</p>\n<ol><li> Cockpit Camera</li><li> Rear Camera</li><li> Behind Camera</li></ol>\n<p> And 7 different cameras located along the Island. Each camera has zoomable view to enhance your driving and viewing experience.</p>\n<p>Although the input is from keyboard only, the commands are very smooth and it is possible to drive the plane very precisely. You will really enjoy all the possibility this game offers.</p><p>**** VERY IMPORTANT NOTE ****</p><p>The game writes the player stats into an external file. It might be that, depending on the settings in your computer, the file requires administration permissions to be modified. In this case your stats would not be updated correctly.</p><p>To solve this problem, do the following before starting the game:</p><ol><li>Locate your icon on the desktop</li><li>With the muse over the icon, click the right mouse botton</li><li>Select Properties from the drop down menu</li><li>On the properties dialog, select \"Advanced\"</li><li>on the advanced dialog, tick the option \"run as administrator\"</li><li>Save the changes</li></ol><p>Thank you for downloading Airshow-2000</p>", "metacritic": null, "released": "2017-11-11", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/793/793f03a0f3849ca599e792709416bb85.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 122, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ChosmoSoft"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}