{"id": 171196, "slug": "cruze-6", "name": "Cruze 6", "name_original": "Cruze 6", "description": "<p><strong>Welcome to Cruze! The game where you can do whatever you want!</strong></p>\n<p><strong><em>NOTICE:</em></strong> <em>This game is extremely graphics intensive and should only be played on powerful hardware. For reference, on my MacBook Pro (Radeon Pro 560 with 4GB of GDDR5 memory, 16 GB RAM) gets about 15 FPS with the 'Fantastic' quality settings and running at 1080p. The game can be easily configured to run on weaker hardware though (as low as 640 x 480 pixels with no shadows, baked lighting, and cached textures) if your computer isn't powerful enough. All procedural textures are pre-rendered and saved to speed up loading times, but the first time you run the game will be extremely slow, and the game might appear to be not responding. This is normal, and will not happen on the second launch; just let it work through.</em></p>\n\n<p>Cruze, an idea for a game I had 4 years ago. Now its a reality. A game where you aren't given a specific goal, just to do whatever you want! You can get a job as a cargo deliverer, build computers, become a criminal, or just drive around as a normal citizen! While you're at it, enjoy the amazing quality of the graphics including sun rays, bloom, motion blur, HD textures, animated trees blowing in the wind, and much more! The game is still early in its lifespan, so expect many more features, jobs, and items soon.</p>\n\n<p>If you have any problems, concerns, suggestions, or bug reports, feel free to contact me at vieirast@icloud.com, and I will try to respond within a few hours.</p>", "metacritic": null, "released": "2017-08-06", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://img.itch.zone/aW1hZ2UvMTY2MDkzLzgxMjYyOS5wbmc=/original/oN%2FeXM.png", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["V0LT"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}