{"id": 17125, "slug": "karma-miwa", "name": "Karma Miwa", "name_original": "Karma Miwa", "description": "<strong>You play a strange fragile flightless bird, who has been gone for too long and now wants to go home to its mate, which is far away.</strong><br/><br/><strong>Badges :</strong> <br/><br/>However for unknown reasons, enemies are being lured and attracted the bird. The flightless bird needs to run and jump over many enemies and obstacles on its journey home to your mate. The bird trek is long and full of danger.<br/><br/><strong>Can you help the bird to get home to your mate?</strong><br/><br/><br/><br/>This game was heavily inspired by the classic game Snokie, which appeared on the Commodore 64 and Atari 800 back in th ’80s. While much of the basic gameplay is similar, the graphics, music and sound has been enhanced considerably and there are many newer enemy types.Features:<ul><li> Play As Miwa (slower) and Terry (faster), which each have two difficulties modes.<br/></li><li> Once all lives are lost the game enters Practice Mode where you can continue the level in easy modes.<br/></li><li> 2 hit system – the first contact with an enemy or water is non-fatal.<br/></li><li> The game features 21 levels, spread over three different areas.<br/></li><li> This game can been quite very hard in the pro mode.</li></ul> How to Play:<ul><li> You can only move on plain landscape and floating platforms.<br/></li><li> You can only jump in either left or right, not up.<br/></li><li> You cannot control your bird when its on a slope, or when its is in air.<br/></li><li> You cannot touch water or any moving enemy animals.</li></ul>Please Note:This  game have 3 jump buttons: <br/>Jump Left (Z), Jump Right (X) and a normal Jump (SpaceBar). Those keys can been remapped in the menu.<br/><br/>", "metacritic": null, "released": "2016-08-12", "tba": false, "updated": "2022-09-30T00:43:46", "background_image": "https://media.rawg.io/media/screenshots/4cc/4cc9e7a7baad4c9394bca643919d3d2b.jpg", "website": "http://studio.otakumaker.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 175}, "playtime": 4, "achievements_count": 0, "ratings_count": 3, "suggestions_count": 66, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC"], "developers": ["Space Fractal"], "genres": ["Action", "Adventure", "Casual", "Indie"], "publishers": ["OtakuMaker.com"], "esrb_rating": null}