{"id": 1713, "slug": "olliolli", "name": "OlliOlli", "name_original": "OlliOlli", "description": "<p>OlliOlli is a skating simulator, is an indie-game developed initially for handhelds, e.g., PS Vita. It is the first title of the series with the second numerical part of the series a year afterward.</p>\n<h3>Gameplay</h3>\n<p>The player is presented with the 2D world, which is filled with the ramps, cliffs, railings, and another environment to perform tricks on. As in many titles of its sort, the player gets bonuses for the number of stunts, safety landing and doing combos. The world consists of 50 levels: each one has 5 (250 overall) trophies, accomplishing every one of them unlocks the next level and so on. </p>\n<h3>Stylistics</h3>\n<p>The game features pixel-art graphics presuming the level design to be minimalistic. Such style, nevertheless, brings a unique trait to the game&#39;s mechanics. While it doesn&#39;t feature any of the usual skateboarding title&#39;s trampolines and pools, the minimalistic nature of the Olliolli brings the hardcore out and forces the one behind the controller to mash the buttons repeatedly, memorizing the playthrough during the entire level. Final parts of the game resemble the hardcore platformers like Super Meat Boy more than they resemble traditional skating games like Tony Hawk.<br />\nThe title is also being praised for the soundtrack — it matches the indie stylistics and is available for sale separately.</p>", "metacritic": 78, "released": "2014-01-21", "tba": false, "updated": "2024-01-14T15:54:17", "background_image": "https://media.rawg.io/media/games/0df/0df3e72c789c89f7e29fe776acb40cfa.jpg", "website": "http://www.roll7.co.uk/", "rating": 3.71, "rating_top": 4, "added_by_status": {"yet": 58, "owned": 1156, "beaten": 52, "toplay": 15, "dropped": 92, "playing": 4}, "playtime": 1, "achievements_count": 60, "ratings_count": 142, "suggestions_count": 330, "game_series_count": 4, "reviews_count": 145, "platforms": ["PlayStation 3", "PlayStation 4", "PS Vita", "iOS", "Xbox One", "Android", "Nintendo 3DS", "Wii U", "PC", "Linux", "macOS"], "developers": ["Devolver Digital", "Carbon", "Roll7", "General Arcade"], "genres": ["Action", "Sports", "Arcade", "Indie", "Platformer"], "publishers": ["Devolver Digital", "Curve Digital", "GHI Media"], "esrb_rating": null}