{"id": 171355, "slug": "2017-queen-city-high-school-game-jam", "name": "2017 Queen City High School Game Jam", "name_original": "2017 Queen City High School Game Jam", "description": "<p>On November 17th and 18th of 2017, members of the BGS community teamed up with six teams of grade school students from the Western New York region to design and develop the students' first video games. With the theme of the jam being \"Social Good\", six games were created, and you can check them out right here!</p>\r\nChopper Rescue\r\n<p>Fly your helicopter in to rescue victims of a natural catastrophe and put out the surrounding fires. Created by students from the Lewis J Bennett School of Innovative Technology.</p>\nThat Dog of Mine\r\n<p>You're a mine sniffing dog eliminating danger from the war zone you inhabit. Created by students from MST 197.</p>\r\nRecycle Road\r\n<p>Drive your recycling truck down the road to collect as many of the recyclables as you can. Created by students from City Honors.</p>\r\nPricilla's Pantry Panic\r\n<p>Help Pricilla collect food for the homeless as she roller skates through the late night streets of her city. Created by students from WNY STEM.</p>\r\nI Used to Fight Fires\r\n<p>Put out fires in the wilderness and rescue the hikers trapped in the burning woods. Created by students from the Buffalo Academy of Science.</p>\r\nBird the Squirrel\r\n<p>Stock up on acorns for winter and evade the incoming cloud of CO2 in this woodsy platformer. Created by students from Frederick Law Olmsted School.</p>\n<p><em>The Queen City High School Game Jam was made possible by sponsorship from WNY STEM, Infotech WNY and AT&amp;T.</em><br/></p>", "metacritic": null, "released": "2017-11-22", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/bee/bee2b6d8066a263601ff85e89d35db17.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 114, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Buffalo Game Space"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}