{"id": 171526, "slug": "gem-blast", "name": "Gem Blast", "name_original": "Gem Blast", "description": "<p>UPDATE </p><p>Android version update to make gems slightly larger as people were mentioning that they were too small on screen!</p><p>This is still a WIP project and subject to changes, The HTML5 version above will run slower than the downloadable version of the game below and is of less quality. You can donate if you wish to help fund this and other future projects and help them become much more than they already are!</p><p>Post your scores in the comments area too if you like!</p><p>Get ready for the biggest, brain busting game of the year!<br/><br/>The rules are simple, destroy the gems with your handy laser beam, but make sure the gem you are destroying is the same colour as your laser beam otherwise you'll get shocked and unable to shoot for a couple of seconds.<br/><br/>But keep an itchy trigger finger mind you because the longer you play, the faster the gems start appearing. If any gems are outside of the playing circle, you only have a short amount of time before a five second countdown starts and when that happens, it's game over!<br/><br/>Controls are simple, move the mouse and click or hold the left button to fire your laser and use your brain!<br/><br/>Be sure to check out our Facebook, Twitter and Youtube pages and be sure to follow us to keep up to date with developments on our other project \"Zombie Stadium\"!<br/></p>", "metacritic": null, "released": "2016-04-20", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/959/9591a45311057264022e928b44c5623e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 6, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Android", "Web"], "developers": ["IDProductions"], "genres": ["Shooter", "Puzzle"], "publishers": [], "esrb_rating": null}