{"id": 17152, "slug": "alien-invasion-tower-defense", "name": "Alien Invasion Tower Defense", "name_original": "Alien Invasion Tower Defense", "description": "Alien Invasion Tower Defense Alien Invasion TD is a new strategy 3D game with an exciting new design, campaign mode, endless mode, players  custom-built levels and PVP online multiplayer.<br/><br/>The aim is to defend against waves of approaching enemies by placing and upgrading your defense towers, recruiting units and using special attacks and boosts. You will be challenged to reconsider your tactics and use different towers and heroes to complete the mission. Each mission has three levels of difficulty and two special modes with player handicap.TowersBuilding and upgrading towers to attack enemies – each tower with its own unique advantages and upgrades – will enable you to overpower the waves of enemies.<br/><br/>The following towers are available:<br/><ul> <li>Tesla Tower - electricity bounce<br/> </li><li>Cannon Tower - AOE<br/> </li><li>Plasma Tower - freeze effect rate<br/> </li><li>Soldier Tower - recruit soldiers</li></ul><br/>Each tower has nine different types of upgrades and improvements.HeroesThere are a total of four heroes to unlock, each with its own unique skills which will aid you in different circumstances. At each level you can use up to two heroes. Different heroes are superior at different levels – select the right ones or you will face staggering defeat.<br/><br/><ul> <li>Willy - fast speed and high damage, he can place mines to stop the alien swarm.<br/> </li><li>Kristy - armed with her rocket launcher, she is able to inflict substantial AOE damage and has a special freeze missile.<br/> </li><li>Thunder - equipped with a sniper rifle and a jetpack, he has a deadly long-range attack.<br/> </li><li>Dave - high health and armor combined with a lethal shotgun and a grenade-launcher to block enemies.</li></ul>EnemiesThe aliens won't show you any mercy so you better watch out! There are 15 unique enemies with different traits which will make you reconsider your tactics at each level. The awesome stuff they can do includes teleporting, speed-boosting, sniping, freezing and destroying towers and more.<br/> <br/>Online Multiplayer PVPThe game has a real-time multiplayer mode in which you need to both attack and defend.<br/>You earn a special currency throughout the battle which can be used to send more enemies to your opponent when you see a hole in his defense.<br/><br/><ul> <li>Public matchmaking<br/> </li><li>Private games</li></ul>Custom Level Builder and BrowserThe custom level builder allows you to create your very own maps and publish them for all to use! You can browse, preview and play the maps and even leave a review. This lets you enjoy the experience of building and sharing with the community.<br/><br/> <ul> <li>Highly customizable wave-builder<br/> </li><li>Three map sizes<br/> </li><li>Build your own map with up to three paths<br/> </li><li>Create up to 15 waves of enemies<br/> </li><li>Designate tower locations and place other props<br/> </li><li>Save your progress<br/> </li><li>Publish the map</li></ul>", "metacritic": null, "released": "2016-10-27", "tba": false, "updated": "2019-08-28T22:10:33", "background_image": "https://media.rawg.io/media/screenshots/ac4/ac45d82bf987dcfccfb65f431243f094.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 13}, "playtime": 2, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 197, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["guyhezi"], "genres": ["Action", "Strategy", "Indie"], "publishers": ["guyhezi"], "esrb_rating": null}