{"id": 171523, "slug": "stormy-skies", "name": "Stormy Skies", "name_original": "Stormy Skies", "description": "<p>Stormy Skies by Joel Mehonoshen and Connor Mackay.</p><p>Stormy Skies is part of a project based on the concept of 'Fear to Surprise to Joy'. <br/>This game is a 2D Top Down space survival game, where the player controls a spaceship and pilot caught in the middle of a solar storm.</p><p>The game a player controls this spaceship and have to maneuver it through a storm to get to a safe house. There's a lot of asteroids, solar flares and black holes that will slow the player down. The player also has a limited amount of fuel and hull integrity. Get hit too much and their hull will be compromised, game over. Fly without care and they will be stranded, run out of fuel.</p><p>To help, the player has a drone called Lucky. Lucky will fetch Fuel and Health pickups that float around the area when the player clicks on them. </p><br/>Fear can be described in many ways. The aspects we venture into in this game are the feelings of stress and anxiety, the best way we could describe this was to have the player lost in a storm. There are many sounds of a storm, thunder and lightning flashes, the constant pressure of hazards around. That and the limited resources the player has to work with form a stressful experience. <br/>'Surprise' comes in about halfway through the game, where a black hole opens near the player, Lucky breaks down and is quickly sucked in. There is no more collecting health or fuel, there's no more Lucky. This makes the player more stressed and 'fearful'. However later on in the level a huge black hole appears and the player is sucked in. At this point the player loses hope realising that they cannot escape, before the last second Lucky miraculously comes out of it and repairs the player's ship and allows the player to escape. This is a positive surprise, which leads into Joy. The player then has a small distance to cover before the safehouse.", "metacritic": null, "released": "2016-03-30", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/6d2/6d28391914c262349a4d769730949ac4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 18, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SAE Brisbane Games"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}