{"id": 171680, "slug": "galactic-explorer", "name": "Galactic Explorer", "name_original": "Galactic Explorer", "description": "<p>The game, Galactic Explorer, is a science fiction game that captures the thrill of exploration. The player must fly a spaceship through an uncharted solar system in search of habitable planets for colonization. There will be dangers within space but the explorer will be equipped to counter the threats. The players will know what it means to travel a vast area of unknown possibilities and threats. However they will experience excitement, curiosity, and uncertainty while progressing through the game. The players will be driven by the curiosity of the unknown vastness of space and by the end of the game; they will feel that they have taken the next step in space exploration.<br/></p><p>The game will be based off of the unknown of outer space. It will be a space exploration game. The player must travel through space and discover new planets. In doing so, the player will establish a safe route for galactic travel to a specific planet. While traveling to new worlds, the player's spaceship will encounter obstacles within space. The challenges include navigating through a meteor shower and fighting hostile aliens. The player's ship will be equipped with a simple laser blaster to defend itself. Within outer space, the player will come across pieces of equipment that can be used to improve the player's ship and chances of success. If the player fails to survive a space encounter then he or she must restart from the beginning of the route. Once the player has reached a new planet, the space level will be complete and a new route will open. Then the player must scan the new planet to determine if it is habitable. If a planet meets the criteria of four requirements then it will be suitable for colonization. If the planet fails to match the criteria then the player must leave the planet and continue the search. However, planets can also be resources to restock the player's items for further space travel. The game will end once the whole galactic map has been filled with all planets discovered.</p><p><strong>Instructions:</strong></p><p>Follow the ! icon to the next planet</p><p>Green orbs are for health</p><p>Blue orbs are for engine boost</p><p>W key - Down</p><p>A key - Right</p><p>S key - Up</p><p>D key - Left</p><p>Hold Shift key - Engine Boost</p><p>R key - Scan for enemies</p><p>Left mouse click - fire weapon</p><p>+ key - Speed Up</p><p>- key - Slow down</p><p>Move close to a planet to scan but do not crash</p><p><strong>Team</strong></p><p><strong>Game Designer: Jackson Culp</strong></p><ul><li>Student of Cal State Monterey Bay with a major in Communication Design. The emphasis of the major is Game Design. Currently trying to get a Bachalor's Degree in Game Design.</li></ul><p><strong>Programmer: Nigel Hardy</strong></p><ul><li>Student of Cal State Monterey Bay. He is a musician, music producer, and a computer science student with an emphasis in game development. He loves playing guitar, traveling, and good food and drink.</li></ul><p><strong>Programmer: Jon Sylvarnes</strong></p><ul><li> A programming student from Norway with a certificate of craftsmanship as a computer electrician. He usually works on side projects and hangs out with friends during his free time.</li></ul><p><strong>Artist: Kacper Kapela</strong></p><ul><li>University of Silesia, Faculty of Fine Arts</li></ul><p><strong>Artist: Adam Dylag</strong></p><ul><li>University of Silesia . He is a student of Games and Virtual Space Design in Cieszyn, Poland. He likes 3d modeling and texturing, and likes playing the guitar.</li></ul><p><strong>Artist: Siergiej Stańko</strong></p><ul><li>He is a student of Games and Virtual Space Design in the art department of University of Silesia and believes in fitness. He also likes music, good stories, and learning new things.</li></ul><p><strong>Artist: Sebastian Lasocki</strong></p><ul><li>University of Silesia, Faculty of Fine Arts</li></ul><p><strong>Sound Composer: Łukasz Szostek</strong><br/></p><ul><li> A musician. He is a graduate of Second Degree Music School in Żory in 2012, and University of Silesia in 2015, with bachelor degree in Polish philology. Currently working on Master's Sound Design for Computer Games, in art department of University of Silesia.</li></ul>", "metacritic": null, "released": "2016-12-13", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/4e5/4e5a1e071332b365fe92ec85de60b94f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 96, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Student Games"], "genres": ["Action"], "publishers": [], "esrb_rating": null}