{"id": 17177, "slug": "umbrella-corps", "name": "Umbrella Corps /Biohazard Umbrella Corps", "name_original": "Umbrella Corps /Biohazard Umbrella Corps", "description": "<p>Umbrella Corps /Biohazard Umbrella Corps is a shooter game, a spin-off of the Capcom’s Resident Evil series.  </p>\n<h3>Gameplay</h3>\n<p>In Umbrella Corps you take a role of mercenary working for Umbrella Co.<br />\nThe player can switch between first-person and third-person perspectives. The game features both multiplayer and single-player modes although the game was primarily marketed as a multiplayer title. The single-player part consists of than 24 missions most of which task you with collecting DNA samples from killed zombies.<br />\nThe key feature of Umbrella Corps’ multiplayer is that alongside players, the maps are filled with aggressive zombies. They attack any mercenary they see, and can be a real threat when in large numbers. The players possess “Zombie Jammer,” a device that makes zombies ignore them. However, opposite players can disrupt. The combat system in the game is cover based meaning it allows one to hide behind walls or other large objects. The multiplayer also has a progression system which allows the player to unlock new weapons and cosmetic items. There are several types of weapons in the game including pistols, rifles, explosives, shotguns and melee weapons. The most notable melee weapons are ax-like Brainer which one-shot almost any enemy with a charged attack. The multiplayer features several game modes most of which are typical for this type of game. The most notable mode is DNA hunter in which you have to collect more DNA samples from killed zombies than your opponents.</p>", "metacritic": null, "released": "2016-06-21", "tba": false, "updated": "2023-12-18T17:42:02", "background_image": "https://media.rawg.io/media/games/4c0/4c009bf276a9d046d7dcc7601b5b0b9f.jpg", "website": "http://www.capcom.co.jp/bioUC/", "rating": 1.78, "rating_top": 1, "added_by_status": {"yet": 49, "owned": 958, "beaten": 12, "toplay": 11, "dropped": 44, "playing": 2}, "playtime": 5, "achievements_count": 205, "ratings_count": 81, "suggestions_count": 694, "game_series_count": 19, "reviews_count": 83, "platforms": ["PlayStation 4", "PC"], "developers": ["Capcom", "Capcom U.S.A"], "genres": ["Action", "Shooter"], "publishers": ["Capcom"], "esrb_rating": "Mature"}