{"id": 17180, "slug": "the-night-the-carsons-disappeared", "name": "The Night The Carsons Disappeared", "name_original": "The Night The Carsons Disappeared", "description": "<strong>Prologue</strong><br/>On April 6th 2009, the Carson family disappeared from their home in Richmond, and were never heard from again. The last known communication with the family came when Mr.Carson contacted local police to report the occurrence of a series of unexplained phenomena. The following events take place on the night the Carson family disappeared.<br/><br/><strong>Description</strong><br/>The Night The Carsons Disappeared is a VR ONLY horror game that puts you in the shoes of Michael Carson. On April 6th 2009, Michael and his two daughters vanished and were never heard from again. In TNTCD you witness the events leading up to their disappearance through the eyes of Michael Carson. This is the non-interactive version of the game. You do not need any controllers. Sit back, and watch the horror unfold. Ideal if you want to scare family and friends at Halloween. The entire game takes around 30 minutes (or less if you choose the shorter version via the menu screen).<br/><br/><strong>Why Play The Night The Carsons Disappeared</strong><br/><ul><li> Who doesn't want to play VR horror games leading up to Halloween<br/></li><li> Only takes around 30 minutes (With the option to play a shorter version too)<br/></li><li> No controls required (just a headset), so don't worry about not being familiar with game controls<br/></li><li> It doesn't require any prior gaming / VR experience<br/></li><li> Ideal for scaring friends and family</li></ul><br/><strong>What's Next?</strong><br/>The interactive Vive version of the game is in development.<br/><br/><strong>Important Notes</strong><br/><ul><li> This is a VR only game. Do NOT purchase this game if you do not have a VR headset<br/></li><li> The game is about 30 minutes long. Do NOT purchase the game if you will be unhappy with the length of the game.<br/></li><li> This is the Non-Interactive version of the game. Sit back and relax. </li></ul>", "metacritic": null, "released": "2016-10-24", "tba": false, "updated": "2019-08-28T22:10:32", "background_image": "https://media.rawg.io/media/screenshots/04c/04ca691b662bdcf97b71ee2e98149c02.jpg", "website": "http://nostalgicbear.wixsite.com/home", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 106}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 168, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Stephen Long"], "genres": ["Indie"], "publishers": ["Stephen Long"], "esrb_rating": null}