{"id": 1718, "slug": "action-news-heroes", "name": "Action News Heroes", "name_original": "Action News Heroes", "description": "Obliterate your enemies with violent soul crushing attacks, earn truck loads of cash, unlock an arsenal of weapons, eat your weight in fast food, and if you die trying, activate your finest clone and try again. War has never been so much fun!\n\nThrough brainwave stimulation media technology, Network X feeds the masses their imagination's wildest dreams in perfect clarity, and in real time. Pure sensationalism, violence, despair, exactly what the people want.\n\nGovernment is for hire. Fast food, corporate backed currency, and contract armies make the the world go round. Justice is a paycheck from Network X, cashed in the studio tour gift shop.\n\nFrom fast food restaurant chains to live TV news, Network X has gained control of almost every modern industry. Network X has spent decades developing a mythical teleportation technology. This teleportation technology was compromised to a contract army who calls itself, Sabre. As a result, Sabre has taken aim at Network X and everything it controls.\n\nNo longer able to protect their own interests, Network X hires a rag tag group of mercenaries who’ve been tasked with eradicating Sabre. Your job is to destroy Sabre on live TV as Network X's top hit news program, Action News Heroes. Put on a good show to boost Network X's ratings, and discover why Sabre has a sudden interest in destroying Network X.", "metacritic": null, "released": "2016-07-27", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/ada/ada47946d31ed52415b512389ea51f58.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 5}, "playtime": 0, "achievements_count": 25, "ratings_count": 1, "suggestions_count": 398, "game_series_count": 0, "reviews_count": 1, "platforms": ["Xbox One"], "developers": [], "genres": [], "publishers": ["Krewe Studios"], "esrb_rating": "Teen"}