{"id": 171935, "slug": "joeys-cardgame", "name": "Joeys Cardgame", "name_original": "Joeys Cardgame", "description": "<p>This is my first attempt to make a digital CCG as a student programmer. The game is heavily inspired by Hearthstone, so if you are familiar with that game youll easily be able to learn this one.</p>\n<p><strong>FEATURES</strong></p>\n<p><strong>Singleplayer Game Modes</strong><br/>Campaign and Duel are the two singleplayer modes in the game. Campaign involves choosing a hero and fighting through a series of 14 levels, each time gaining new cards to improve your deck. Duel is a more standard compeditive mode where you and the AI choose decks and duel it out with built-in or player-made decks. <br/></p>\n<p><strong>Deckbuilding</strong><br/>This game allows the player to create custom decks to use in either multiplayer or duel. The player chooses a class for the deck, then builds a deck using the deckbuilder by clicking on cards to add. A deck can have up to 3 copies of the same card and 25 cards total.<br/></p>\n<p><strong>How to Use Multiplayer</strong><br/>This game offers peer-to-peer multiplayer where one player hosts a game and the other joins. The host <em>must open port 444</em>. To join a friend's game, simply click join and then enter their public IP address.<br/></p>\n<p><strong>GAMEPLAY BASICS</strong><br/></p>\n<p>The goal of the game is to kill your opponent's hero (top of screen) while keeping your own alive (bottom of screen). Your \"hand\" of cards is displayed on the right side of the screen. The \"Field\" is on the left side of the screen. You can have up to 6 cards in hand and 4 minions on the field at any given time. Additionally, some classes have \"Trap Cards\", these show up to the left of the hero as red caution symbols. Each Player can have up to 2 traps in play at one time, but no more than one of the same kind. <br/></p>\n<p>To play a card, you must be able to \"afford\" it. The yellow number at the top left of a card is the cost. You use the blue crystals to pay for cards, and they turn white when expended. Expended crystals are restored each turn.<br/></p>\n<p>Minions, when summoned, cannot attack until the beginning of the next turn unless they have \"Charge\".  Minions can attack either the enemy hero or an enemy minion by clicking and dragging from said minion to the target. When minions fight, each loses health based on the other's attack value.  Attacking a hero does not damage the attacking minion.<br/></p>\n<p>Github: <strong>https://github.com/joey101937/cardgame1</strong><em><br/>This project includes art that I do not own and therefore I have disabled payment.</em><br/></p>", "metacritic": null, "released": "2018-05-02", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/a98/a988c3e6b2dd0c186e0380f30c7bcd05.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 98, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Android"], "developers": ["joey101937"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}