{"id": 17204, "slug": "blackfaun", "name": "Blackfaun", "name_original": "Blackfaun", "description": "<strong>BLACKFAUN</strong> is a fast paced roguelike with RPG elements, it is built on the principles of skill-based, challenging combat and replayability.<br/><br/>Players will join a faun tasked with a mysterious quest given to her by her parents. To prove her worth as heiress to the crown, she must battle her way through unforgiving, randomly-generated dungeons on her journey of self-discovery. Along the way, you will uncover an incredible variety of powerful items with over 100 mechanics and thousands of additional stat variations. You’ll fight against cunning and relentless enemies that employ advanced tactics and abilities to exploit your weaknesses.<br/><br/>Featuring a different experience on each play-through, Blackfaun aims to deliver a unique experience built on a solid foundation of fun, intense combat. Drawing inspiration from some of our favorite games, Blackfaun will bring dungeons to life with vibrant colors, clean character designs, and a rich original soundtrack for a fully immersive experience.<br/><br/><br/><br/>FORTY UNIQUE ENEMIES AND BOSSESBattle your way through cunning and relentless enemies that employ advanced tactics and abilities to exploit your weaknesses.PROCEDURALLY GENERATED DUNGEONSExplore unforgiving, procedurally-generated dungeons as you help Eri on her journey of self-discovery. Enjoy endless hours of Blackfaun fun as you experience new layouts on each playthrough.A LARGE VARIETY OF DIFFERENT ITEMSAlong the way, you will uncover an incredible variety of powerful items with over 100 mechanics and thousands of additional stat variations.ORIGINAL STORY AND SOUNDTRACKUnfold the relationship between Eri and her estranged brother, Pan, as each character shares their perspective of events. Their mysterious journey is accompanied by a rich and original soundtrack.<br/><br/><br/><br/><br/><strong>VANQUISH</strong> your foes as you brave your way through harsh environments, each with its own set of baddies that try to hinder Eri in her quest for truth.<br/><br/><br/><br/>This isn’t your standard ARPG.  You’ll be on the move dodging projectiles and melee attacks, pushing enemies out of your path, turning ethereal, and making use of a huge variety of spell effects to stay alive against all kinds of creatures.<br/><br/><br/><br/><br/><strong>DISCOVER</strong> tons of items that boost your ability to dispatch your foes! Blackfaun aims to deliver a replayable experience that relies on play skill rather than time-played. As Eri, you will be collecting gear -- hidden throughout the environments and guarded by fearsome boss monsters.<br/><br/><br/><br/>In the process, balance your inventory by choosing between powerful stats and special abilities granted by different items. Be on the lookout for consumables left behind by fallen enemies to help replenish your resources.<br/><br/><br/><br/><br/><strong>NAVIGATE</strong> a carefully crafted world -- goblin forests, haunted temples, dank sewers, and decadent palaces. Blackfaun places emphasis on each individual playthrough as its own experience rather than a grind to the top of the level meter.<br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><strong>EXPERIENCE</strong> the plot as it unfolds. Eri, along with her birth-rune, Lex, seek to uncover the meaning of the quest her parents tasked her with. Eri is the heir apparent, but must complete her trial before she can claim the throne. On their journey, the two encounter Pan -- Eri’s long-estranged brother. After dismissing him initially, Eri and Lex being to wonder about his intentions as they try to parse his riddles.<br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/>", "metacritic": null, "released": "2016-10-26", "tba": false, "updated": "2019-08-28T22:10:31", "background_image": "https://media.rawg.io/media/screenshots/cb2/cb2d1bc43479ba799fe43af28118a501.jpg", "website": "http://www.blackfaungame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 7}, "playtime": 5, "achievements_count": 50, "ratings_count": 2, "suggestions_count": 568, "game_series_count": 0, "reviews_count": 2, "platforms": ["macOS", "PC"], "developers": ["Wild Guess Software"], "genres": ["Action", "RPG", "Indie"], "publishers": ["Wild Guess Software"], "esrb_rating": null}