{"id": 17209, "slug": "omni-link", "name": "Omni Link", "name_original": "Omni Link", "description": "Your name is Keb. A man of little consequence. An orphan without a past or a future. It's your first day on the job at Zaos Corporation when you encounter an alien vessel.  Through a misunderstanding, your vessel explodes &amp; binds you with an entity known as Ectype D-7, an attractive and powerful being of technology. You quickly learn that there is more to this ship and A.I. than meets the eye. The artificial intelligence is so advanced she is able to absorb energy from other ships and duplicate them. As well as use a mysterious ability called Omni Link.<br/><br/><br/><br/>Match your abilities against an faceless terror. An enemy called \"The Virus\" awakens near the edge of the galaxy. Suns are disappearing and planets are dying. People discover that this threat is real. However, no one knows exactly what the Virus is or wants. Will you be fooled too?<br/><br/><br/><br/>On your journey you'll discover what it means to love and lose everything. The people you meet--a child prodigy, an ace pilot, a computer genius--will all come to depend on you to save them. But you're not a hero...! Give yourself an alias to add a personal touch to the adventure.<br/><br/><br/><br/><strong>Features in Early Access:</strong><br/><br/><strong>Real-time tactical combat -</strong> Defeat ships and absorb them into your fleet. Summon each ship to fight with you in battle. Discover hidden ships with powerful abilities and skills. Influenced by games such as Escape Velocity Nova and Star Control 3.<br/><br/><strong>Choices that affect gameplay and story -</strong> Dialogue and gameplay choices make every decision you make carry weight. Some will change dialogue in minor ways, but also open paths for completely new dialogue and space events. Even your gameplay actions have consequences. Some are not fully apparent till later and it's too late to change course. *Huge two path end game split planned.<br/><br/><strong>Hand Drawn Art &amp; Epic Music - </strong>Beautiful art and music accompany your journey. Feel the emotion through epic battle moments and emotions that comes from characters as you take part in the story.", "metacritic": null, "released": "2016-10-17", "tba": false, "updated": "2019-08-28T22:10:31", "background_image": "https://media.rawg.io/media/screenshots/d97/d97d9ec234258efa233653864929ff2d.jpg", "website": "http://www.omnilinkgame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 12}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 377, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Eldon Harris"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Roencia Game Creators"], "esrb_rating": null}