{"id": 172094, "slug": "smash-mario-jungle-world", "name": "Smash mario Jungle World", "name_original": "Smash mario Jungle World", "description": "<p>Smash Boy - Jungle World is the best classic platform games with a journey of smash boy. In the super world, super boy must pass so much threats to run to target super world.</p><p>Smash boy runs and jumps across platforms and atop enemies in themed levels. Smash adventure have simple plots, typically with smash boy rescuing the kidnapped Princess from the primary antagonist. </p><p>These include a multitude of power-ups and items that give smash boy special magic powers such as fireball-throwing and size-changing into giant and miniature sizes.</p><p>In Smash World, smash boy should pass most threats to run to focus on super world.</p><p>The Jungle boy will jump, run and he will use weapon to kill monster however weapon is hidden in somewhere on the jungle to kill all enemies on the means.</p><p>Smash Boy - Jungle World is about the adventures of Smash Adventure. The Smash World habitat was invaded by monsters,Mashroum.... that makes them displaced. </p><p>There is a brave super boy that do not want to surrender, He start the adventures to get rid the monster out of the smash World area.</p><p>Smash boy has the ability to stomp the monsters and has skill of throwing bones to attack the monsters. Of course the monsters waiting him with so many stuffs and traps.</p><p>Smash Boy - Jungle World is one of the most popular and enduring series of all time.</p><p>Smash Boy - Jungle World the legend of Smash free games bring your childhood back!</p><p>Features Smash Boy - Jungle World</p><p>- Great graphics and music.</p><p>- Game owns simple gameplay.</p><p>- Break the bricks to collect power-up items.</p><p>- Explore 3 super worlds: Beach, Forest.</p><p>- 30 levels free.</p><p>- Get the powerful items to be stronger, undefeatable and be able to throw the tenis balls.</p><p>- 9 enemies: snakes, spiders.</p><p>- Many items: mushroom, flower...</p><p>- Power-up items: Powerball, tennis ball...</p><p>What are you waiting for? Play Smash Boy - Jungle World now!</p>", "metacritic": null, "released": "2016-12-30", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/dc6/dc65f9b5181b7e6a9bd3d984ece5b287.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 113, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["niwla10@gmail.com"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}