{"id": 17212, "slug": "blacksmith-hit", "name": "BlackSmith HIT", "name_original": "BlackSmith HIT", "description": "BlackSmith HIT – Hit the iron when it is hot! And show who is the real blacksmith!<br/>\n<br/>\r\nSarcasm mode on :-)<br/>\n<br/>\r\nBlackSmith HIT is exclusive and interesting arcade game, which proffers ultra realistic hammering experience that features stunning graphics, amazing animations and simple intuitive controls. Hammer the gold iron, toss away the cold ones and earn amazing rewards by unlocking new levels.\u2028<br/>\n<br/>\r\nBlackSmith HIT is promised to render dynamic strength of character in you and guarantees you tremendous satisfaction, only if you are up for it. If you’ve what it takes to be a real blacksmith, your hammer awaits you, grab it and smash ‘em up hammer man. All the earnest players who have the passion and zeal to compete, BlackSmith HIT has it all stored for you.\u2028Brand your name among the best blacksmiths in the world.<br/>\n<br/>\r\nAs tempting as it sounds already, the game is reasonably simple. All you’ve to do is HIT and CATCH! HIT HARD AND PLAY SMART! Your priority is to keep the anvil at the highest temperature. Well of course there’s a catch. To optimized the right level of temperature toss the gray iron bars over your shoulder with the pliers in your hand.<br/>\n<br/>\r\nWin maximum number of real gold horseshoe and accomplish as many as strokes you can. Your progress will embark a world full of possibilities for the blacksmith. With every pre-defined sets of challenges you complete a new and bewildering blacksmith character is unlocked. You have to unlock 13 surprisingly creative characters and 13 scenes tailored to them. Your every move is important, and it is followed by a certain reaction.<br/>\n<br/>\r\nFeatures of the game:\u2028<br/>\r\n- multiplayer mode only on Steam (for 4 Players!)<br/>\r\n- be the best blacksmith in the world\u2028<br/>\r\n- experience the astonishing graphics, amazing animations and splendid soundtrack\u2028<br/>\r\n- choose from 13 awesome characters and tailored scenes<br/>\r\n\u2028- earn gold horseshoes and you decide how to spend it<br/>\r\n\u2028- try the addictive and intuitive gameplay\u2028<br/>\r\n- gain bonus score in the HIT&amp;HIT<br/>\r\n\u2028- compete with others and check out your score on the global results<br/>\n<br/>\r\nWhat are you waiting for? Suit up; let out the THOR inside you grab your hammer because you know you're worthy of it and HIT LIKE A BLACKSMITH!", "metacritic": null, "released": "2016-08-05", "tba": false, "updated": "2023-11-01T07:30:10", "background_image": "https://media.rawg.io/media/screenshots/87a/87a5799f22254bf16532d0887089ac67.jpg", "website": "", "rating": 1.76, "rating_top": 1, "added_by_status": {"yet": 8, "owned": 370, "beaten": 1, "dropped": 5, "playing": 1}, "playtime": 4, "achievements_count": 16, "ratings_count": 21, "suggestions_count": 235, "game_series_count": 0, "reviews_count": 21, "platforms": ["macOS", "PC", "Linux"], "developers": ["ENTERi"], "genres": ["Action", "Casual", "Indie"], "publishers": ["Forever Entertainment"], "esrb_rating": null}