{"id": 172195, "slug": "modern-supermarket-car-parking", "name": "Modern Supermarket Car Parking", "name_original": "Modern Supermarket Car Parking", "description": "<p>Play supermarket drive thru modern car parking game and add some more fun with shopping mall parking driving simulator. Drive car through the supermarket for the sake of your quick or long shopping and shop in the modern drive through shopping mall. Park cars in front of the grocery store parking lot and pick up items you want to shop at supermarket. Driving vehicles inside the shopping mall car parking area need high precision. Be careful while driving and parking car near supermarket shelves. Avoid hitting other parked cars at the big mall. You have played many other car driving games in supermarket but becoming a shopping mall car parking and truck delivery driver is bit hard job. so what are you waiting for boys and girls come and join this modern car parking game with our Modern Supermarket Car Parking.</p><p>A combination of shopping mall car parking games and supermarket car parking is here! Drive thru supermarket with car parking challenge in crazy way of car parking. Follow the signals and beware of collide or hit other parked cars in shopping mall parking lot inside city supermarket. Reverse car parking is also a big challenge to avoid crashing and smashing.</p><p>Buy your favorite grocery from drive thru valet with car driving games in supermarket. Shopping mall car parking games twist is has come on google-play. Multi level parking plaza is available for modern days car parking in supermarket car parking game. Drive thru! Supermarket 3d is now a drive through away with mall parking lot challenge. Multi Level Parking Plaza to drive exotic cars and complete hard parking missions.</p><p>Play the first ever drive through car shopping experience, the modern drive thru shopping mall is ready. Shopping mall parking do not need valet car parking. Drive thru modern supermarket with car parking fun is here for the fans of 3d car parking games. Modern Super Market drive thru car parking game is here for you just hit the download button and start the best parking mania of 2017.</p><p>Features in Shopping Mall Parking Driving Simulator</p><p>• Splendid drive thru area to shop and parking challenge. <br/>• You need extreme car parking and car driving skills like precision driver. <br/>• Realistic environment for multi level shopping mall parking lot.<br/>• Superb 3D graphics and amazing sounds for immersive gameplay. <br/>• Excellent modern supermarket drive thru car parking game of 2017.<br/>• Enjoy driving with different camera angles.</p><p>So what are you waiting for? Download now Modern Supermarket Car Parking drive thru sim 3d and enjoy the best car parking game of 2017 and shopping mall parking drive thru simulator.</p>", "metacritic": null, "released": "2017-04-10", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/0ba/0ba974781a8ca891d83e9885a6946e8d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 56, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["WhatGames"], "genres": [], "publishers": [], "esrb_rating": null}