{"id": 17237, "slug": "grave-matters", "name": "Grave Matters", "name_original": "Grave Matters", "description": "<strong>Take up the mantle of grave digger, Harey Burke, a mysterious rogue who must collect energy cells from the robot graveyard to survive.</strong><br/><br/>Puzzle your way through a near infinite amount of Minesweeper inspired levels, using quick wits and special skills to avoid disturbing the Steamborgs (steam-powered-cyborgs) who lurk six foot under, ready to pull Harey Burke to his doom - it is not going to be easy!<br/><br/>Grave Matters is a nerve-racking, adrenaline fuelled challenge, but you will not face it alone. You’ll be accompanied by Bobby, a (super cute) steam-powered, puppy dog, who will sacrifice his life for yours if you need it.<br/><br/>Set in a Tim Burtonesque steampunk world, with high definition 3D graphics and undead zombie charm. Grave Matters is a unique sensory and intellectually challenging experience that is perfect for your big screen!<br/><br/>Featuring 3 Acts with unique gameplay rules and tons of levels, plus an insanely difficult infinite survival mode, you will never run out of graves to dig up! Use the energy you collect, to unlock character upgrades, so you can progress further and demolish your friends high scores on Game Center.   <br/><br/>Can you Dig it?<br/><br/><br/><strong>Default Controls</strong><br/>-----------------------------------------<br/>Arrow Keys \t\t| Move<br/>Dig/Confirm \t\t| Space<br/>Use Lightning \t\t| Left Ctrl<br/>Use Dog Sense \t\t| Left Alt<br/>Place a Flag  \t\t| Right Alt<br/>Menu/Quit  \t\t| Left Shift", "metacritic": null, "released": "2016-10-27", "tba": false, "updated": "2019-08-28T22:10:30", "background_image": "https://media.rawg.io/media/screenshots/577/577c863cdf14a9bc83f42bb36b8309f9.jpg", "website": "http://gravemattersgame.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 243, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC", "Linux"], "developers": ["Ideonic"], "genres": ["Strategy", "Indie"], "publishers": ["Ideonic"], "esrb_rating": null}