{"id": 172384, "slug": "bus-simulator-india-2018", "name": "Bus Simulator India 2018", "name_original": "Bus Simulator India 2018", "description": "<p>The game offers an opportunity to experience and become a real bus driver on Indian roads across various cities. Gear up and get on board</p>\n<p>in this next - Gen game with realistic graphics, heavy vehicles and beautiful city to travel across various routes. One of the best bus simulation games, get Bus Simulator India now! </p>\n<p>FEATURES-</p>\n<p>- The most realistic 3D cities seen in a simulation game. Play around in 3 Major Metro cities of India: Mumbai, Delhi, and Bangalore.</p>\n<p>- Choose your favourite bus from a variety of 12 detailed buses. </p>\n<p>- Drive around different cities and experience the brilliance of a bus simulator with 40 realistic routes.</p>\n<p>- Different sets of controls to suit all the different players and give them a comfortable riding experience.</p>\n<p>- Get the feel of an actual bus driver with the Dashboard view Camera feature.</p>\n<p>- Drive carefully between the realistic AI Traffic and make sure to follow the basic traffic rules.</p>\n<p>- A little feature for opening and closing the bus door, that will give you the exact feel of a Realistic Bus Driver.</p>\n<p>Bus Simulator India 2018 gives you a great sense of driving heavy and popular buses all the way in the town. It's a realistic Bus Simulator where you get to transport people from one location to another with popular Indian as well as Euro buses. </p>\n<p>Euro Style bus simulator where you can choose from a wide variety of buses to play on Indian roads with attractive and free environments. Avoid crashing or breaking the signals on the road to keep the passengers in the bus happy all the time. Different additional functions like Horn, light indicators and 3 different camera angles adds more to the game giving it a much more realistic effect than just a game. </p>\n<p>Play in various cities from India like Bombay, Delhi and Bangalore. Tackle the traffic of Bangalore using handbrake, enjoy the best pleasant weather of Bombay and manage the heavy coach vehicles in foggy Delhi. Packaged with some awesome buses and euro style coaches, keep playing by transporting people and eventually unlock all the routes from India. The game offers 2 cameras, one is a third person look from behind the bus and the second one is a realistic cockpit camera inside the bus for real driving experience. Drive through the traffic by following all the traffic signals to keep the passengers happy and score more.</p>", "metacritic": null, "released": "2018-01-30", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/f8c/f8c28b38ad4ed7f69aa19949902d2430.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 85, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["underdogsthestudio"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}