{"id": 172490, "slug": "soul-charge", "name": "Soul Charge", "name_original": "Soul Charge", "description": "<p>Soul Charge is a first person horror survival game that is still in development.</p><p><strong>Objective:</strong> Survive for as many days as you can. Enemies spawn at night and on every 5th day a wave of special enemies will attack your power generator. Defend the power generator at all costs. Each special enemy is weak to a spesific weapon.<br/></p><p>The game's crafting system focuses on the use of the four main materials: wood, stone, iron and mithril. For weapons and tools the handle and head of each can be crafted separately and then combined together to form the item. These parts can be made of different material types making the item a hybrid of the two. </p><p>The player can also build up the walls of their home in any of the materials to strengthen their defences. The combat in the game uses a unique two handed approach that allows the player to control each hand independently. This means the player can hold different items and weapons in each hand to form a strategic attack or go for raw power with two of the same. </p><p><strong>Controls:</strong></p><p>Movement: WASD  </p><p>Tab: Open Inventory / Close Inventory <br/></p><p>Q: Switch to Left hand slot 2 or Left hand slot 1</p><p>E: Switch to Right hand slot 2 or Right hand slot 1</p><p>F: Pick up item</p><p>Left Shift: Activate split menu.</p><p>Mouse 1: Use item in left hand. </p><p>Mouse 2: Use item in right hand.</p><p><strong>Tips:</strong><br/></p><p>Open the inventory near objects to access their menu. (Workbench, Furnace, Chest, Walls)</p><p>Items are crafted at the workbench.</p><p>Ores and sand can be smelted with coal at the furnace.<br/></p>", "metacritic": null, "released": "2016-05-28", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/960/9607b8f1d1eeacf3c3436906da3a6486.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 26, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["enorton-cox"], "genres": ["Action"], "publishers": [], "esrb_rating": null}