{"id": 172503, "slug": "impossible-tracks-multivehicle", "name": "Impossible Tracks MultiVehicle", "name_original": "Impossible Tracks MultiVehicle", "description": "<p>Hey Kids it's time for car driving on city impossible tracks. Take control of kids car on impossible tracks of modern city. Both boys and girls can perform city stunts by driving their vehicle on impossible tracks of city. While stunt driving take car safety in this impossible game. Avoid the crazy obstacles by doing impossible jumping on goosebumps. Drive different as a super kid to be a legend of multi vehicle racing by driving on impossible tracks.Impossible Tracks Multi Vehicles with action packed sky high stunt drive.<br/>Get ready to play the most exciting car stunt game. In Impossible Tracks simulator, you will feel like a real stunt rider! Experience the fastest and most exhilarating 3D impossible stunts action. In this Impossible Tracks simulator game delivers you an exciting driving experience that will make you feel like driving real vehicle. This is the most challenging car driving &amp; simulator game you are going the play.<br/>In impossible tracks 3d game you and your kids can try to perform stunts on impossible tracks. If you are tired from other car racing game for your kids try this brand new multi vehicles impossible tracks racing and stunts game. Just thinks its a kids impossible tracks 3d game free, collect all the coins to unlock the other vehicles. You can choose different cars and vehicles like Monster Car, Taxi, ambulance, truck, bulldozer, Monster truck snow Truck, Police Jeep, helicopter, and tank. In impossible tracks 3d games there are unlimited fun and enjoyment. if you don't want to drive a car choose a monster truck simulator and take the journey of real 3d cartoonic city. Drive the kids police car in kids car racing game that gives you the enjoyment of driving, racing and stunts. So before you sent your kid of to a parking or driving school let them play car stunt on impossible tracks 3d.<br/>Be a furious and crazy driver and do multi vehicle stunt in the middle of the sky but the only enemy is the obstacles in impossible path in this impossible racer. Several extreme levels await your stunning multi vehicle stunt skills with extreme obstacles. Be the most passionate and competitive on all the stages while appreciating the amazing car physics and fast-paced game play.<br/>Game Features of Mullti Vehicle Impossible Tracks 2017.<br/>• Easy and smooth control to make your impossible race easy.<br/>• Addictive Game Play with lots of fun.<br/>• Most challenging tracks to drive on.<br/>• Stunning sound effects and visuals.<br/>• Multiple Vehicles to choose.<br/>• Real driving experience.<br/>• Unique, rough and dangerous stunts <br/><br/>Car Stunts on Impossible Tracks 2017 is easy to pick up but hard to master which will keep you in the zone for hours. The best physic based single player challenging mission, you can't stop play this game owing to gorgeous 3d and HD environment with perfect physics and enhance graphics. You will love furious speed jeep drive if you like drifting games.</p>", "metacritic": null, "released": "2017-04-22", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/bb9/bb9e704cf3d1c4a18ce54f0cefaeccc0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 109, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["MadMaxGames"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}