{"id": 172626, "slug": "mad-chickenx", "name": "Mad Chickenx", "name_original": "Mad Chickenx", "description": "<p>Desde la Island Jam III nos llega un título de tintes distópicos en el cual encarnaremos a los</p>\n<p>grandes señores de la guerra Schicken Hawking e Impollator Furioso en encarnizadas<br/>batallas motorizadas a través de las devastadas tierras del Yermo.<br/>Una forma de definir el género de MAD CHICKENX sería catalogarlo de una especie de<br/>crossover entre los juegos de carreras y los shooters de forma completamente alocada y<br/>salvaje. No es apto para cardíacos.<br/>En el apartado artístico MAD CHICKENX combina estéticas que a priori podrían<br/>considerarse incompatibles como son pesados riffs de heavy metal excéntricos personajes<br/>al estilo pixel art y entornos texturizados, en bruto, sin pulir. Salvajes y desesperanzados, al<br/>igual que la historia de nuestros personajes pollos.</p>\n<p>JUGABILIDAD<br/>El juego consiste en destruir a tu enemigo, reclamar su choza, degollar a su ganado y en<br/>general SER EL REY DEL YERMO.</p>\n<p>CONTROLES.<br/>Jugador 1: Teclas de deplazamiento WASD y tecla de acción Q<br/>Jugador 2: Teclas de desplazamiento IJKL y tecla de acción U<br/>EQUIPO:<br/>Arte:<br/>Cristian Tomás Quevedo Rodríguez<br/>Tegaray Galiano González<br/>Diego López de la Llave<br/>Luis García Cerdeña<br/>Programación:<br/>Aymedeyacoan Rodríguez Ortega<br/>Alberto Casado Garfía<br/>Colaborador Gallináceo:<br/>Andrés Ravelo</p>", "metacritic": null, "released": "2018-04-22", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/0ab/0ab633952d5cb2fa10825462ba14c5c2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 95, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Tega14", "equipo_10", "Xirzag"], "genres": [], "publishers": [], "esrb_rating": null}