{"id": 172652, "slug": "la-chocolaterie", "name": "La chocolaterie", "name_original": "La chocolaterie", "description": "<p>Ce jeu est inspiré de la série chocolatier.<br/>Le principe est simple. Au début du jeu vous vous trouvez sur une carte où il y a 3 maison : le marché, l'atelier de fabrication, le magasin de bonbons.<br/>Vous devrez tour à tour :<br/>- Acheter des marchandises au marché.<br/>- Fabriquer des tablettes de chocolat à l'atelier<br/>- Vendre votre production au magasin</p>\n<p>Pour se déplacer d'un endroit à l'autre, il suffit de cliquer sur la maison correspondante.</p>\n<p>Le but du jeu est  de faire le plus d'argent possible.<br/>-----------------------<br/><strong>Mon pseudo Gamecodeu</strong><strong>r</strong> : Astragor<br/><strong>Je suis élève de gamecodeur depuis : </strong> un peu plus de 2 mois<br/><strong>Le jeu est programmé en</strong>  : LUA/LOVE 2D  avec mes petites mimine et uniquement les miennes ;)<br/><strong>Pour les graphisme : </strong> il y a un peu de tout . J'ai pris des fichiers en CC0 pour les sprites, les cliparts viennent en partie de banques d'images d'autre ont été fabriqués par mes soins.  Tous ont été retouchés et adaptés par mes soins.<br/><strong>Librairie externe utilisée :</strong> Aucune<br/><strong>Temps passé :</strong> Je n'ai pas vraiment compté mais environ  50 H<br/><strong>Comment j'ai abordé la contrainte du thème :</strong><br/>J'ai tout de suite pensé à faire un jeu simple, mon objectif étant de pouvoir livrer un proto complet.<br/>Je ne voulais pas faire un simcity like car trop de choses à gérer en peu de temps. J'ai donc tout de suite pensé à un jeu de gestion pure.<br/>Je me suis alors rappelé les petits jeux auquel je jouait sur Oric Atmos (comme une affaire en or, par exemple) et j'ai repris et modernisé le principe en utilisant en autre thème que j'aime bien la fabrication de chocolat (thème inspiré de la série chocolatier).<br/><strong>Post Mortem :</strong><br/>J'ai découvert LUA en même temps que gamecodeur et j'ai bien accroché.<br/>J'avais un mauvais à priori sur ce langage car pour moi lua restait un simple langage de script.<br/> Je regrette cependant l'absence de certains éléments de programmation tels que les switch/case qu'on retrouve dans à peu près tout les autres langages.<br/><br/>En ce qui concerne le jeu lui même, ce qui m'a pris le plus de temps c'est la recherche de graphisme et le polish. <br/></p>\n<p>La main page (celui où il y a le personnage qui se déplace) a surtout servie à dépoussiérer mes connaissance ssur les tilemaps et fut également un prétexte pour programmer un mini pathfinding. J'aurais pu faire sans ;)<br/></p>\n<p>La GUI  a représenté le plus gros du travail de programmation.  Pour gagner du temps, j'ai un peu triché en dessinant mon interface sur les écrans de mon jeu,  en remplissant les \"trous\" avec des love.graphics.print() et en ajoutant une gestion de collision entre le pointeur de ma souris et les zone contenant les boutons.<br/>Le résultat final est quand mème assez intéressant mais il est clair que si cela avait été un projet complet (hors game jam)  j'aurais procédé différemment.</p>\n<p>Je regrette de ne pas avoir eu le temps de programmer un système de jeu tour par tour tel que je l'avais imaginé au départ.</p>\n<p><strong>Suivre les devlogs :</strong><br/>Durant toute la durée de la Gamejame, j'ai tenu un devlog pour expliquer les avancées du projet. Je vous invite à retrouver les différents articles :</p>\n<p>https://www.gamecodeur.fr/devlogs/preparation-de-la-gamejam-15/<br/>https://www.gamecodeur.fr/devlogs/gamejam-15-jour-2/<br/>https://www.gamecodeur.fr/devlogs/gamejam-15-jour-3/<br/>https://www.gamecodeur.fr/devlogs/gamejam-15-jour-5/<br/>https://www.gamecodeur.fr/devlogs/gamejam-15-jour-8/<br/>https://www.gamecodeur.fr/devlogs/gamejam-15-jour-14/<br/>https://www.gamecodeur.fr/devlogs/gamejam-15-jour-18/<br/>https://www.gamecodeur.fr/devlogs/gamejam-15-jour-19/</p>", "metacritic": null, "released": "2018-05-25", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/49d/49de42de378c3cf0276b8c1e12685960.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 38, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Android"], "developers": ["astragor"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}