{"id": 17263, "slug": "byte-family", "name": "Byte Family", "name_original": "Byte Family", "description": "<strong>StoryLine</strong>Overcome obstacles and restore the cyber world ByteFamily, eliminating the system virus, unlocking new game modes and gaining new skills!<br/>HERE IS THE TERRIBLE WORLD ENEMIES BYTE FAMILY<strong>Synopsis</strong>The cyber world ByteFamily was invaded by thousands of viruses that are affecting the entire system. The person in charge of all this is a bit familiar stranger, call: Ermes Boss.<br/>Save the system by Pixel, the antivirus bit. And stop plans Ermes Boss.<strong>Game Modes</strong>There are 5 game modes with different goals. Explore them and discover secrets, unlock secret stages and find and unlock new skills:<strong>Mode: Challenge</strong>Tame the phases of the way and save the system.<br/>Talk to NPCs. They may say something interesting.<strong>Mode: Record</strong>Use your abilities to deviate from a swarm of Alicops and last as long as possible on a R3302.<strong>Mode: Prison</strong>Eliminate all viruses from prison, before they end up with you.<strong>Mode: Bonus M</strong>Find out for yourself.<strong>Mode: Record Pro</strong>Stay alive in a swarm of Alicops as much as possible through the Infinity Jump technique.[[b]Master your control![/b]The game features a learning curve that level elements are gradually inserted between the phases, providing the development of their skills within the game mechanics.<br/>Each stage of the game difficulty increases progressively, requiring you increasingly reflection, reasoning and habiladade.<br/>Surpass your limits and claim your control!", "metacritic": null, "released": "2016-10-26", "tba": false, "updated": "2019-08-28T22:10:29", "background_image": "https://media.rawg.io/media/screenshots/726/726de205cd02c65298ab46ebc164fe63.jpg", "website": "http://www.byte-family.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 59}, "playtime": 4, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 106, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ProPixel Games"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["ProPixel Games"], "esrb_rating": null}