{"id": 172785, "slug": "n-et", "name": "N-ET", "name_original": "N-ET", "description": "<p>A test level in a huge, far away project from Gorgi Games (Redo) that involves an environment that breaks the standard laws of physics, and isn't continuous. (Pretty much what AntiChamber did)  We got carried away with making a player displacement script and made this.<br/></p>\n<p>(Click game to enable movement controls if not already active. WebGL usually.)<br/>WASD or Arrow keys to move.<br/>Use mouse to look around.<br/>Press spacebar to jump.<br/>Hold Left Shift to run.<br/>Hold Control to crouch.<br/>Press E to grab the temporal cube.<br/>Press E to drop cube. Drop cube while running+jumping to throw. Drop while just running to slide it forward.<br/>Press ESC to free mouse from game (WebGL only)<br/>Pressing ESC in standalone downloadable version will quit the game.</p>\n<p>A new pro strat was created here too.  We call it \"cube boosting.\" Run directly at a wall or corner while holding a cube.  Throw said cube as described above when you are close to the wall, then start repeatedly jumping.  If the cube clips through the level, don't worry.  Cubes re-spawn at their original location.  If that doesn't happen, the cube is now hiding somewhere.</p>\n<p>(Pre-upload testing shows that mouse sensitivity may be too high in WebGL version! I might try to fix this later.)<br/><em>(Lighting is also bad in WebGL version, the standalone version has better rendering options.)</em></p>\n<p>Feel free to leave feedback in comments!</p>", "metacritic": null, "released": "2017-07-29", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/66b/66bb9c516bf7c8feb4f4400a8b8d6206.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 52, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Web"], "developers": ["Gorgi Games"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}