{"id": 172792, "slug": "more-than-monsters-demo", "name": "More Than Monsters (demo)", "name_original": "More Than Monsters (demo)", "description": "<p>What happens when you move to a weird little town full of monsters in your quest for a better job?</p>\n<p>Well, if you land in the town of Darling Down, you do what any \r\nsensible young woman would do: you date one of the monsters! Surely \r\nnothing can go wrong!<br/></p>\n<p>Currently the game is in development, and this is a demo! All the boys' routes will be their own separate games, and the game (and description) will be updated to link to each boy's route as they're completed.</p>\n<p>Features:</p>\n<ul><li>7 unique monster boys for you to date!</li><li>Dateable boys include: an object head, a skeleton, a vampire, a ghost, a Grim Reaper, a naga, and an alien</li><li>2 endings (\"good end\" and \"bad end\") for each boy, for a total of 14 endings</li><li>prologue is roughly 10k words long</li></ul>\n<p>If you'd like to leave some feedback, please consider the questions below!</p>\n<p>Who was your favorite boy? Or did you like them all equally? Whose full route would you like to play first?</p>\n<p>Was the writing compelling? Was it fun to read? Did it draw you in?</p>\n<p>Did the choices make sense?</p>\n<p>Was the color scheme okay, or could it use some tweaking? If so, how?</p>\n<p>How did the art look? Do you have any tips to make the art feel like more a part of the game? Was it a good addition, or was the art too distracting/jarring compared to the text?</p>\n<p>Did you find any typos or game glitches? If so, where were they and can you describe them?<br/></p>\n<p>Any other comments, as far as what you liked, didn't like, or what you think could be improved on?</p>\n<p>Thank you very much! Hope you enjoy the game!<br/></p>", "metacritic": null, "released": "2017-10-25", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/5f7/5f79b5eda2e505ba99fadcc483dde86e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 40, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Bellum"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}