{"id": 172801, "slug": "graal-mini-adventure", "name": "Graal Mini Adventure", "name_original": "Graal Mini Adventure", "description": "<p><strong>GC Graal-Mini-Aventure </strong></p><p>Jeu crée pour la GameCodeur Jam 15.\r\n  </p>\n<p>Vous devrez au cours du jeu faire grandir votre camp, tout en survivant à l’assaut des monstres et éviter que votre Roi ne meure. Augmenter votre camp vous permettra d’avoir plus de mineurs qui chercheront le GRAAL pour leur seigneur.\r\n  </p>\n<p>Chaque villageois créé sera un paysan que vous pourrez faire évoluer en bucheron, mineur ou chevalier. Pour transformer vos paysans vous devrez au préalable construire le bâtiment correspondent.   </p>\n<p>Il est préférable de commencer par une scierie, puis une mine pour avoir une augmentation des différentes ressources.   </p>\n<p>Si vos ressources sont trop faibles pour la création de nouveau paysan, et pas assez de villageois pour les faire augmenter, il ne vous restera que le suicide de votre roi possible.\r\n  </p>\n<p>Les différents monstres présents dans cette forêt sont :\r\n  </p>\n<p>- les Gobelins : juste de petit voleur de nourriture\r\n  </p>\n<p>- les loups : bête sauvage, qui attaqueront vos villageois\r\n  </p>\n<p>- les squelettes : être d’outre-tombe, lent et faible\r\n  </p>\n<p>- les Orc : présent  au bout d’un certain nombre de jours mais assez puissant pour réduire en miettes un village sans soldat.\r\n  </p>\n<p><strong>Comment jouer :</strong>\n</p>\n<p>Un tutoriel est implémenté dans le jeu pour vous aider à comprendre toutes les mécaniques.\r\n  </p>\n<p>Il se joue principalement à la souris :\r\n  </p>\n<ul><li>Clic gauche – sélection / annulation\r\n  </li><li>Clic droit – validation / action\r\n  </li><li>« q » permet de tuer un PNJ sélectionné   </li></ul>\n<p><strong>INFO GAMEJAM :</strong>\r\n   \r\n  </p>\n<p><strong>- Elève Premium de Gamecodeur  : </strong>Depuis mi-avril\r\n  </p>\n<p><strong>- Langage et Framework utilisé :</strong> Lua /Love2D\r\n  </p>\n<p><strong>- Code/Graphisme/Musique : </strong>Graphisme « Micro Character Bases » par Kacper Wozniak, et d’autres images collectées sur internet et retravaillées pour correspondre au reste.   </p>\n<p><strong>- Utilisation de librairies et codes externes : </strong><strong>Utilisation de la librairie jumper pour tout le système de pathfinding</strong>\n</p>\n<p><strong>- Temps passé : </strong>Temps cumulé d’environ 180h\r\n  </p>\n<p><strong>- Comment as-tu (ou pas) abordé la contrainte du thème :</strong> Le thème  de la gestion/simulation n’était pas simple pour moi. Ce n’est pas le genre de jeux pour lequel j’ai beaucoup d’affinité. J’ai donc décidé de m’orienter vers des Game Play qui correspondaient à la fois au thème et à mes jeux préférer de gestion. Je me suis grandement inspiré de jeux comme « Nothgard ». Ma première difficulté a donc été les mécaniques de jeux, puis dans un second temps le calibrage des ressources pour avoir un Game Play à la fois vivant mais pas trop complexe à créer.\r\n  </p>\n<p><strong>- Postmortem : </strong>Je n’ai pas pu réaliser complètement mon idée de base, j’aurais voulu que le joueur soit plus impliqué dans la gestion du village en orientant plus les villageois dans leur action. Ou gérer différemment l’obtention des ressources mais mon jeu est fonctionnel c’est le plus important.\r\n  </p>\n<p>J’espère que vous aurez du fun en y jouant. Avec de la chance vous pouvez gagner en 5 min ;)\r\n  </p>", "metacritic": null, "released": "2018-05-27", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/5e9/5e9191c638ab669cd246bf776061e783.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 15, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Arnkil"], "genres": ["Adventure", "Simulation"], "publishers": [], "esrb_rating": null}