{"id": 172848, "slug": "boxxy-box", "name": "Boxxy Box", "name_original": "Boxxy Box", "description": "<p>With Amazon choosing to deliver by drones, WPS has instead opted for the ABDS, the Automated Box Delivery System!  As part of their testing, they have placed several Ming Vases into boxes wrapped only in a single layer of bubble wrap, and are now testing how fast it can be delivered to customers in real-world situations*.  </p>\n<p> <br/>Navigate Boxxy, the first prototype box, through several puzzles and to test your skill and speed, but of course at WPS speed is all we really care about**.<br/><br/></p>\n<p>* Situations may never occur in the real world. <br/>** We don't care about your stupid broken box.  <br/></p>\n\n<p>This was a basic project to show my high-school students how easy game development was, I have maybe put 3 solid hours into the basic prototype at the most.  I've spent maybe an extra hour and a half adding things like a pause menu, a couple more levels, and some very basic controller interaction (you can now play completely with a controller! Just press the Start button on the Main Menu).  This game still has a lot of bugs, and is far from perfect (it's a prototype, duh).  Keep that in mind.  <br/></p>\n<p>**UPDATE** A fellow staff member has showed interest, so I decided to pick the project back up and do a few desperately needed updates (mostly things that were already in the code, but not implemented properly).  Thanks Brett! See the DevLog for details.  <br/></p>\n<p>**UPDATE 2.0** I've finished up on this project, on to bigger and better things.  Version 1.0 is available, and unless there's something seriously game-breaking in there (please let me know if there is), I have a feeling I'm not going to touch it again.  Thank you!<br/></p>", "metacritic": null, "released": "2017-08-29", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/f2c/f2c488753ffb9991ab6614bfe1b6f3e5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 56, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["FFS"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}