{"id": 17293, "slug": "scourge-outbreak-2", "name": "Scourge: Outbreak", "name_original": "Scourge: Outbreak", "description": "<p>The year is 2026 and the world is ruled from the shadows by the power-hungry Nogari Corporation, the creators of a powerful new energy source called &#39;Ambrosia&#39;. Unknown to the world&#39;s population, Ambrosia is the product of research conducted on a mysterious meteorite fragment in Nogari&#39;s possession; something which they will do anything to protect. Only one organisation dares to defy and challenge Nogari Corporation: The Tarn Initiative - an anonymous group of anti-corporate saboteurs intent on revealing the truth behind Ambrosia and breaking Nogari&#39;s iron grip on the world.<br />\n&quot;Scourge: Outbreak&quot; puts you in the boots of Echo Squad, an elite group of mercenaries hired by The Tarn Initiative to deal a decisive blow against Nogari. While other Tarn Squads have been tasked with diversionary attacks, Echo&#39;s objective is the most important: First, to locate and rescue Dr Reisbeck, Tarn&#39;s double-agent inside Nogari; Second, to recover a piece of the meteorite fragment being kept deep within Nogari&#39;s laboratories. Utilize a devastating array of weapons and special abilities to crush everything that stands in your way, as you fight to discover the sinister truth behind Nogari&#39;s &quot;Ambrosia&quot; fuel technology.<br />\nFeatures a Co-op enabled Campaign for up to 4 Players, with full jump-in/jump-out support for easily joining sessions in progress. Experience flashbacks that only YOUR character sees, and figure out how they fit together with what your friends see!<br />\nAll XP and Gameplay Perks earned in the Campaign stay with you in the 8-Player Multiplayer modes, where Scourge: Outbreak&#39;s fast-paced style of Deathmatch, Team Deathmatch and Capture-The-Flag rewards quick reflexes, itchy trigger fingers and constant movement! 5 death-filled multiplayer maps await you, offering the chance to continue the carnage between Echo Squad and Nogari Security Forces as they fight for supremacy of Nogari Island!</p>", "metacritic": 40, "released": "2013-05-28", "tba": false, "updated": "2024-03-24T09:18:17", "background_image": "https://media.rawg.io/media/games/4ba/4ba54a14a9cf2c076a53965a9198eeac.jpg", "website": "http://www.scourgeoutbreak.com", "rating": 2.57, "rating_top": 3, "added_by_status": {"yet": 22, "owned": 511, "beaten": 9, "toplay": 6, "dropped": 8, "playing": 1}, "playtime": 5, "achievements_count": 63, "ratings_count": 23, "suggestions_count": 701, "game_series_count": 0, "reviews_count": 23, "platforms": ["Xbox 360", "PC", "macOS"], "developers": ["Tragnarion Studios"], "genres": ["Action", "Shooter", "Indie"], "publishers": ["UFO Interactive Games", "Bitbox"], "esrb_rating": "Mature"}