{"id": 172993, "slug": "room-to-grow", "name": "Room To Grow (itch)", "name_original": "Room To Grow (itch)", "description": "<p><strong>The game has recently been updated to Alpha 1. New controls are:</strong><br/></p><p><strong>-f to throw bomb</strong></p><p><strong>-h to drink health potion</strong></p><p><strong>-3 to switch to new weapon</strong></p><p><strong>***The bomb upgrade in the skills tab does not work yet***</strong></p><p>Room To Grow is a mix between a puzzle, shooter, and adventure game! The game is based in levels, currently only 1-2, but I each update adds one! The objective of the game (other than to get enough points to move on) is to scroll out, because you start extremely zoomed in. Currently there are 5 pickups, purple, pink, and yellow, which either increase points, add health, or scroll out, along with one ice pickup which is dropped from enemies and money.</p><p>Here is a list of enemies and pickups:</p><p>-Red cube, basic AI to follow and shoot at you. Avoids close contact as getting too close confuses it</p><p>-Green Cube, Attacks and hurts you by touching you</p><p>-Yellow Cube, Cannot move but fast fireball fire rate.</p><p>-Ice Sentry, Cannot move but shoots ice, which cuts your speed in half</p><p>-Ice Follower, Moves and shoots ice at you</p><p>-Poison Sentry, Shoots poison at you, which slows and damages you over time.</p><p>-Yellow Sphere, Adds 2 points</p><p>-Pink Glowing Sphere, Adds 50 points of health</p><p>-Purple Sphere, Scrolls out the camera</p><p>-Small Golden Sphere, Adds one gold coin</p><p>-Ice Gun Drop, Allows you to shoot the Ice cannon, a powerful weapon that slows the enemy; dropped by ice enemies</p><p>The game is still Pre Alpha, so there will be bugs, but currently the game is free and will probably stay that way. I update the game ever 1-3 days, and most updates add a lot, but usually add some bugs too.</p><p>If you would like more information or to join the community, go to my subreddit page here: https://www.reddit.com/r/EradInnovations/. For more info about updates, go to the devblog: http://goo.gl/UQyxI4, and if you wish to contact me directly, send me a message at fireking883@gmail.com</p>", "metacritic": null, "released": "2016-01-03", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/577/5779c93afb68142e543f6132103c5cfb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 70, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["FIreking883"], "genres": ["Shooter", "Puzzle"], "publishers": [], "esrb_rating": null}