{"id": 172950, "slug": "modern-army-strike", "name": "Modern Army Strike", "name_original": "Modern Army Strike", "description": "<p>The game of war and death, where no injustice just identifies your enemies fight with them and be a superman of your world.<br/>Experience the action packed and best ever Modern Army Strike game on your Android device.<br/>Your force has selected you for an important mission and wants your ascension in this war. Get trained for Officer Cadet Rank and be ready to fight against the trained enemy soldier's. Take flight to carcinogenic warfare missions as your land is under attack by one of the dangerous enemy troops. Here a need of shooter rise who possess all the abilities and tactics of a real shooter or strong fighter.<br/>Take off from your navy carrier, cross the area, fight in different battles against enemy ship carriers, jet fighters and Tanks. Dogfight up close with the enemy, defend your territory in Sea Battles and get ready for Desert Combat in all in one Modern Army Strike. <br/>The fatal War zone of the time is started here and sounds of guns, drone attack and jet fighters are prominent. Abolish enemies Tanks, Machines Guns and Jet fighters at once and Shootout the enemy soldiers, murder their boss, clear the area and save your land from enemy attack. Best of luck soldier for this biggest mission of your life.<br/>Game Features<br/>- Smooth Controls <br/>- Real Jet Fighter Simulator<br/>- Realistic warzone and shooter animations <br/>- Strategic Warfare<br/>- Realistic Physics and addictive war zone<br/>- 3D air combat jet fighting environments and challenging missions</p>", "metacritic": null, "released": "2015-10-07", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/d0f/d0fa913f9086acc9189927d612a987e8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 73, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["CogSoul"], "genres": ["Action"], "publishers": [], "esrb_rating": null}