{"id": 173055, "slug": "2d-shooting-games-collection", "name": "2d shooting games collection", "name_original": "2d shooting games collection", "description": "<p>this collection including three 2d shooting games 1- space robot - 2- air conflict - Modern Warfare 2D<br/></p> 1- space robot<p>space robot its shoot em up 2d video game you have your magnificent robot<br/>you drive it into deep space . in deep space there is a lot of aliens you have to<br/>destroy them all and clean the universe from them . you have 14 playable mission<br/>and you have to fight 7 bosses . after every mission you can upgrade robot weapons and armor but first you have to get enough score for upgrade</p> 2 - air conflict<p>A grand battle in the sky seems to be about to begin. A flock of enemy aircraft is approaching you. Your mission is to defend your squadron at all costs. </p><p>You are a leader, so it's vital for you to roll with the punches and cover your comrades-in-arms. Well, get ready to make decisions immediately.</p> In front of you are countless enemy hordes but you are brave enough to defeat them3 - Modern Warfare 2D<p>The magnificient success of Call of Duty Modern Warfare 2 is known by everybody in this planet.<br/> <br/> Graphics, sounds, story,... everything in it is amazing and now you can enjoy all the essence of the game for free and in 2D thanks to Modern Warfare 2<br/> <br/> Colorful graphics, good playability, a lot of action and fires,... that's MW2D.<br/> <br/> 6 levels, 6 different weapons, 4 vehicles, 8 tracks from the original game, original sounds,... Do you need anything else to play it?</p><p>you can buy all these three shooting games by this collection<br/></p>", "metacritic": null, "released": "2017-01-17", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/37f/37f6a4f72a314f3b0874d44becbee4af.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 170, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ayman12"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}