{"id": 173161, "slug": "biotopia-3d", "name": "Biotopia 3D", "name_original": "Biotopia 3D", "description": "<p>Play biotopia! it is unique and everytime surprises you with something new!</p>\n<p>Biotopia is the latest indie game from Magic Storm, our hobby game developer team. It is a mixture of RPG, platformer, jump and run at the same time and above all, a sandbox where the player 's imagination can run wild.</p>\n<p>- each time you start a new game a new random generated world awaits you! you can keep your player with it's progress and stuff and start a completly new world whenever you like<br/>- dig the ground and build, remove or terraform how you like it<br/>- craft everything from building blocks to weapons and armor <br/>- cook tasty meals <br/>- create powerful potions <br/>- create your own magic spells <br/>- enhance your weapons or armor with magic power<br/>- fight monsters with melee or range weapons and magic spells <br/>- talk to people, trade and fulfill quests <br/>- follow the main story and find secrets beneath it <br/>- fight lots of different monsters from spiders to gargoyles and dragons <br/>- hunt lots of different animals <br/>- dress your character with lots of clothing and armor pieces<br/>- solve puzzles or just ignore (or smash) them <br/>- discover lots of dungeons, ancient ruins and buildings <br/>- level up your character and gain new abilities <br/>- levelup your furball, your neat little sidekick <br/>- win awards <br/>- if you like it, buy a license for 10€ to support us making improvements and add more stuff</p>", "metacritic": null, "released": "2018-01-08", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/09f/09f605a7ccbbfaa35f8bf767e02683b5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 338, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["magicstorm"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}