{"id": 173193, "slug": "bunny48", "name": "BUNNY48", "name_original": "BUNNY48", "description": "<p><strong>1 bunny + 1 bunny = </strong><em><strong>lots of baby bunnies... </strong></em></p>\n<p>Populate the grassy hills with up to 1 million bunnies in this take on the iconic puzzle game. </p>\n<ul><li>Set your target score as 512, 1024, or 2048.</li><li>All three allow you to continue playing once you've hit your goal.</li><li>The largest tile has 1 million bunnies! How high can you go?</li></ul>\n<p>Additional features include:</p>\n<ul><li>How to play page for those new to 2048.</li><li>Score and high score displays.</li><li>Save and load* features.</li><li>Charming animated menus.</li><li>Plucky background music.</li><li>Hearts of varying colors that appear when you breed your bunnies!</li><li>Sound effects for matching tiles.</li></ul>\n<p>*Note that you lose 10% of your score when loading to prevent cheating.</p>\n<p>Match bunny tiles to 'mate' and multiply! Your goal is to reach a certain number of bunnies on one tile. Don't let the board fill up with tiles, because if none of them can be combined, you'll lose.</p><p>Hotkeys and Shortcuts:</p>\n<ul><li>Press M to pause the music.</li><li>Press N to mute the sound effects.</li><li>Press spacebar to start a new game, or click the 'New Game' button.</li><li>Press S to save and L to load, or click their respective buttons.</li><li>Use the pink 'X' on the submenu to get back to the main menu.</li><li>Use the pink 'X' on the how to play page to get back to the submenu.</li><li>Press the escape key while playing the game to go back to the submenu. (This also works on the how to play page.)</li></ul>\n<p>Feel free to e-mail <strong>mxcaseydanger@gmail.com </strong>at any time with bug reports, as well as any feedback, suggestions, or requests.</p>\n<p>---------------------------------------------------------------------------------------------------</p>\n<p><strong>The full game is being provided to you for free!</strong> There is a suggested donation of $5, and while you are not <em>required</em> to pay, we would definitely appreciate your support. If you're enjoying it, consider leaving a tip. Every bit helps! </p>\n<p><strong>If everyone who downloaded and enjoyed this game paid $1, or even $0.50, it would add up fast and help us to cover the cost of development. </strong>We definitely appreciate those who <strong>share</strong> the game on social media as well.</p>\n<p>Thanks for giving our first real game a try. Enjoy!</p>\n<p>&lt;3 Casey</p>\n<p>---------------------------------------------------------------------------------------------------</p>\n<p><strong>Note about the future of this game:</strong></p>\n<p>This game is finished, but<em> may</em> receive some quality of life updates down the line. </p>\n<p>If we do work on this game again, we may add in:</p>\n<ul><li>An options menu, with ways to change the volume or rebind controls.</li><li>A leaderboard, where players can compete and  show off their high scores.</li><li>Achievements to earn.</li><li>A how to play section, for those new to 2048. (added in 1.01!)</li><li>Update some of the graphics, in particular the menu/GUI to better match the pixel art in the game itself. (added in 1.0.1!)</li></ul>\n<p>It is not our highest priority, especially since it already got a small update, but we will try to tend to it if we have the free time and funds available. If this is one of your favorite games and you are dying for an update, an <strong>email</strong> is a good way to get our attention and share your ideas, and a <strong>donation</strong> is a good way to show that this game has people who still enjoy it and help us afford to take breaks from paid work in order to fix up a free game.</p>", "metacritic": null, "released": "2018-03-10", "tba": false, "updated": "2019-08-28T23:21:27", "background_image": "https://media.rawg.io/media/screenshots/3a5/3a545e46f9c3002e783003fbe654d57c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 67, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ca5ey"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}