{"id": 173149, "slug": "when-all-your-friends-are-dead", "name": "When All Your Friends Are Dead", "name_original": "When All Your Friends Are Dead", "description": "<p>You have gone on a 7 day hunting trip with all your friends in the middle of nowhere. Your friends decide to go hunting early, you decide to stay home and sleep off the long journey. The next day you wake up to find that your friends are missing. You get worried and go out to look for them, taking the rifle just in case. You are devastated of the thought that all your friends might be dead, but you keep on looking. You hear noises, scary noises. Then you see a black figure ambling towards you, as it get closer you realise its not alone Two more figures appear, you shine your torch away from them, and back again. They've disappeared. You run back into the house. Your friends are really dead. You check for any food, it's all gone. So is the ammo and batteries. However the flares are still there. You have set them up and it seems like you'll be rescued in no time. But the question is, will you survive by then?</p>\n<p>The game is still in very early stages and lots of bugs are present, some more obvious than others. It is only a 2 man team and we are trying our hardest to fix these bugs and create the best possible game we can. Donating can and will help us make this game even better.</p>\n\n<p>Coming soon:</p>\n<ul><li>Bug fixes</li><li>New and improved maps</li><li>Improved gameplay mechanics</li><li>Improve graphics and aesthetic (top down 3d?)(maybe)</li><li>Multiplayer (need a lot of funds to work)</li><li>Please email us to ask about any new features you would like us to make, we are very willing to do so.</li><li>Remaking the whole game as a first person shooter with hopefully co-op and multiplayer!</li></ul>\n<p>All of this can be made possible by buying the game, thanks.</p>", "metacritic": null, "released": "2015-09-24", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/36b/36b2d87bd34e3941ea4b5fc2b388dea6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 67, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ishina Nale"], "genres": ["Action"], "publishers": [], "esrb_rating": null}