{"id": 173230, "slug": "coven-demo", "name": "Coven (Demo)", "name_original": "Coven (Demo)", "description": "<p>The small town of Midnight Haven is home to many covens of witches and warlocks. Among these covens are the powerful Dragon Tooth, the chaotic Manticore Tail, and the mysterious Sprite Wing, the three largest covens in town. All three of which would be recruiting soon, and all of the fledgling witches and warlocks were speculating which coven they would be accepted to.</p>\n<p>Velvet Lazarus just wanted to practice her summoning. She had her sights set on going to Manticore Tail with her friend Marie. However, when Manticore Tail rejects her, Velvet decides to join the spiritually strong Sprite Wing coven. There, she meets several other witches ready to learn about magik and the spirit world.</p>\n<p>However, things become a little complicated for everyone when someone summons a lust demon. The demon refuses to leave until she has a wife to take back to the Underground with her. Velvet has to race against the clock to find someone to please the demon before it chooses one of her fellow Sisters as its bride.</p>\n<p>----***----</p>\n<p>In true Team Darknesse tradition, <em>Coven</em> is a fantasy visual novel showcasing the growth of friends, this time facing the struggles of magik, arcane, demons, and trying not to break curfew.   </p>\n\n<p>Demo Rating: E\r\n  </p>\n<p>Full Game Rating: 18+</p>\n<p><strong>~Full Game Features~</strong>\n</p>\n<p><strong>Four</strong> romantic routes\r\n  </p>\n<p><strong>One</strong> non-romantic route\r\n  </p>\n<p><strong>Original</strong> backgrounds and sprites\r\n  </p>\n<p><strong>Image Gallery</strong> including additional profile sheets for major characters</p>\n\n<p><em>Thanks for playing and we hope you stick around for the full release!</em></p>\n<p><em>- Team Darknesse</em>\n</p>", "metacritic": null, "released": "2016-09-02", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/a06/a06fbdbf0f7a1641a973dbaa9100223a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 6, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Team Darknesse"], "genres": [], "publishers": [], "esrb_rating": null}