{"id": 173290, "slug": "wheel-and-steal", "name": "Wheel And Steal", "name_original": "Wheel And Steal", "description": "<p><strong>Commentary (by ANGELINA)</strong><br/></p>\n<p>This is a game about a ruthless pirate. A thief. The game only has one level, and the objective is to reach the exit. Along the way, you must avoid the gang as they kill you. </p>\n<p>I use some sound effects from FreeSound, like the sound of vagabond. Using Google and a tool called Metaphor Magnet, I discovered that people feel hated by thief sometimes. So I chose a eerie piece of music from Kevin Macleod's Incompetech website to complement the game's mood.</p>\n<p>Let me know what you think. In future I'll put more levels into my games, and also make the mechanics more interesting.</p>\n<p><strong>Commentary (by Mike)</strong></p>\n<p><strong>Wheel And Steal</strong> is a game designed by ANGELINA, an artificially intelligent piece of software designed by me, Michael Cook - I'm a researcher at Goldsmiths in the University of London. Wheel And Steal was generated during an interview with Philippa Warr, and is one of the most coherent designs this version of the software ever produced.</p>\n<p>The input word was 'thief' - the player has to avoid 'gangs' (which actually come across more like guards, by coincidence), it identifies a good mood for music selection, and even chooses some appropriate textures - this was towards the end of the project and it had learned a lot more from its Twitter followers at this point.</p>\n<p>You can still see a lot of oddities here, including the return of grey textureless models (a bug from the way ANGELINA downloaded and imported models automatically). I quite like this one though.</p>\n<p>If you'd like to know more about the research I do, or about ANGELINA, or anything related to us, you can find out more at http://www.gamesbyangelina.org</p>\n<p>Thanks for playing!</p>", "metacritic": null, "released": "2018-07-03", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/881/8817deec15665921ce81107541ca735e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 30, "game_series_count": 0, "reviews_count": 0, "platforms": [], "developers": ["Games by ANGELINA"], "genres": [], "publishers": [], "esrb_rating": null}