{"id": 173367, "slug": "sheeps", "name": "Sheeps!", "name_original": "Sheeps!", "description": "<p>A game made for Lisp Game Jam 2017 (Easy Mode).\r\n</p>Overview<p>\r\n\tIn the game you play as a \"dog\" whose task is to protect and herd a flock of sheep. The sheep will roam around the gameplay area, looking for food, and trying to avoid wolves and your character. After sheep are fed, you need to secure them by escorting them to the top part of the gameplay area. You need to save at least half of the flock to win a level.\r\n</p><p>\r\n\tThe game employs a flocking algorithm for both sheep and wolves.\r\n</p>Installation<p>\r\n\tEnsure you have a working Lisp implementation (the game was developed on SBCL, but CCL should probably work too) and Quicklisp set up.\r\n</p><p>\r\n\tDownload the files from this package. They'll contain two projects - the game, and the Parendeck 2D engine. Ensure both are visible in your Quicklisp's local projects (e.g. by symlinking those repositories in ~/quicklisp/local-projects).\r\n</p><p>\r\n\tStart your Lisp from the root directory of this game (lispjam-2017-04), and execute (ql:register-local-projects) and (ql:quickload :lispjam-2017-04-temporal). After that, run (ljgame:run).\r\n</p><p>\r\n\tI'll add binaries for Windows users when I figure out how to reliably deploy them. All help appreciated!</p>GameplayControls<ul>\n<li>Left, Right - turn the player character</li>\n<li>Up - accelerate</li>\n<li>Down - slow down</li>\n<li>F5 - toggle showing debugging information for flocking algorithm</li>\n<li>F6 - toggle showing sight ranges of wolves and sheep</li>\n<li>F7 - while holding it, you can use left mouse button to place a sheep, right mouse button to place a wolf, and middle mouse button to place a food pellet</li>\n</ul>Mechanics<p>\r\n\tSheep want to eat food pellets. Eating two will turn the sheep white and enlarge it; this indicates that it is ready to be evacuated.\r\n</p><p>\r\n\tWolves want to eat sheep. You lose the game if wolves eat more than half of your sheep.\r\n</p><p>\r\n\tEating, in both cases, takes time, during which the wolf/sheep won't be moving much.\r\n</p>Technical<p>\r\n\tBoth sheep and wolves are driven using a flocking algorithm. They'll group together within their respective species, chase food when hungry, run away from danger, and - most importantly - run away from player character. This last thing is what gives you the ability to direct sheep and chase away wolves.\r\n</p><p>\r\n\tAll entities have limited sight range, so they'll only notice friends, food and danger in close proximity.\r\n</p><p>\r\n\tTo view the realtime computation performed by entities, use F5 key. To see the sight ranges, use F6 key.\r\n</p>TroubleshootingGame doesn't work - crashes, throws exceptions, etc.<p>\r\n\tE-mail me. If you can find engine.log file somewhere around the game directory, please send it to me too.\r\n</p>Game seems not able to find assets<p>\r\n\tVerify your Lisp's working directory is set to root of this repository. In Emacs / SLIME, you can use \",cd\" in REPL to change the working directory.\r\n</p>Game runs slow<p>\r\n\tThe code is pretty crappy (happens when writing in a hurry to meet the contest deadline), so it's nowhere near possible peak performance. I might optimize it in the future if there's interest.\r\n</p><p>\r\n\tTo help me do that, please find and e-mail me the file perf-report.html. Also if you're using SBCL, try and run the game with (ljgame:run-with-profiling), and send me the file sb-sprof.txt.\r\n</p>Credits<p>\r\n\tThis game's background was composed with assets from Tiny16 pack by Sharm.\r\n</p><p>\r\n\tThe book \"The Nature of Code\" turned out to be very helpful in designing and implementing the flocking algorithm.\r\n</p>", "metacritic": null, "released": "2017-04-25", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/b4d/b4dd9bcb5c0031a8ea5dec825565f1d6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 45, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["TeMPOraL"], "genres": ["Action"], "publishers": [], "esrb_rating": null}