{"id": 17345, "slug": "brick-battalion", "name": "Brick Battalion", "name_original": "Brick Battalion", "description": "Brick Battalion is a competitive tile-matching game where you can play with up to 8 people online or with bots. Play alone, in teams or engage in a Free-For-All in a space-themed battle for domination. By matching and chaining bricks, you can create more powerful attacks to defeat your enemies.Key Features<strong>Online Matchmaking</strong><br/><ul><li>Play against other players of a similar skill level and earn higher ranks as you become more adept. You can also play cooperatively against bots of increasing difficulty, if preferred.</li></ul><strong>Custom Games</strong><br/><ul><li>Take control with custom games. Set difficulty, handicaps and game speed. Set teams up however you desire. Mix and match human players and bots. Spectate matches to learn new techniques.</li></ul><strong>Single Player Modes</strong><br/><ul><li>Play single player to set records in the high score table. Play against waves of bots in gauntlet and defeat as many as possible, or play by yourself to create epic combos. There are weekly, monthly, and all-time leaderboards for both practice and gauntlet modes.</li></ul><strong>Profiles and Achievements</strong><br/><ul><li>Battle statistics are recorded in your profile. Keep track of your progress in both matchmaking and single player. Earn achievements as you progress.</li></ul><strong>Supports Offline Play</strong><br/><ul><li>Play even when you don't have an internet connection. Offline mode supports all styles of play against bots.</li></ul>", "metacritic": null, "released": "2016-08-15", "tba": false, "updated": "2019-08-28T22:10:26", "background_image": "https://media.rawg.io/media/screenshots/a32/a32dca199f24f0ce5afcf17ae315cdbb.jpg", "website": "http://scoriastudios.com/site/game_brickbattalion.html", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 18}, "playtime": 3, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 266, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC", "Linux"], "developers": ["Scoria Studios"], "genres": ["Strategy", "Casual", "Indie"], "publishers": ["Scoria Studios"], "esrb_rating": null}