{"id": 173437, "slug": "turbo-motorcycle-star", "name": "Turbo Motorcycle Star", "name_original": "Turbo Motorcycle Star", "description": "<p>Get your motorcycle driving skills into gear, start your engines and race like the wind in this fast-paced bike racing adventure!</p><p><b>TURBO BIKE RIDE</b></p><p>Turbo motorcycle Star is here to fulfill your desire of reaching the extreme level of bike drive. Run your scooter with fast speed on the city highway and reach the top of city skyscraper.</p><p>Drive your Moto as fast as you dare. You must carefully maneuver around Challenging road condition-Watch out for the sharp turns and traffic or you will get crashed. The game is not similar to other racing, driving and parking games, you have to play with distinct objectives where you have to run fast, collect coins and face the traffic on rush city highway.</p><p><b>COINS AND POWERUPS</b></p><p>In turbo Motorcycle Star racing game you have to drive and collect coins, gems, turbo and nitrous to increase speed and performance. Run the crazy Scooter on the city roads and get realistic extreme bike mayhem of the latest motor trend. This turbo motorcycle race enables you to practice your real life motocross skills on a suburbia highway road for an adventurous racing trip.</p><p><b>EXCITING BIKE SELECTION</b></p><p>Complete the job driving with higher points/rewards and unlocking several exciting and attractive scooters with different physics. Each bike has different mechanics and design to enjoy the real drive of your choice.</p><p><b>GAMEPLAY<b></b></b></p><p>Run your scooter in the city with smooth and simple controls. The motorcycle Star game is thoroughly designed for the ultimate turbo motocross experience. The location based and road conditions challenges make the difficulty more and more unbearable, as the turbo rider has to avoid collisions to vehicles, stay alert of heavy traffic, cars, buses and ambulances rushing by and stopping on any turn. Collect more coins to make the game play time longer.</p><p><b> FEATURES</b></p> <ul><li>-Intuitive and easy to use controls </li> <li>-Dynamic racing adventure</li> <li>-Excellent Camera view</li> <li>-Challenging but realistic driving environment </li> <li>-Unlock able Motorcycles and bonus achievements </li> <li>- Vivid sound effects makes game more stunning </li> <li>-Coins, Gems and Nitrous to make your performance at the extreme level </li> <li>-Two exciting level on city and highway roads</li></ul>", "metacritic": null, "released": "2015-09-02", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/e1b/e1b25927a2e647e2e71542184ed7dabe.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 152, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["CogSoul"], "genres": [], "publishers": [], "esrb_rating": null}