{"id": 17359, "slug": "rpg-maker-vx", "name": "RPG Maker VX", "name_original": "RPG Maker VX", "description": "Simple enough for a child; powerful enough for a developer.<br/><br/>RPG Maker VX allows you to make the role-playing games you’ve always dreamed of by being one of the easiest game engine software ever developed. With its enhanced auto-tile capabilities, quick event creation, and dungeon generator, you can have a game ready to play faster than ever before!<br/><br/>With RPG Maker VX, you can create your own unique RPG, without the need to be a programmer, artist, or musician. Take advantage of the following features to make the game you’ve always wanted to:<br/><ul><li>An easy to use mapping system, giving you the tools to build the look of your world.<br/></li><li>A GUI driven database, where you can create your heroes, villains, items, magic, and more.<br/></li><li>A powerful eventing system, allowing you to dictate the flow of your game using a simple point and click interface.<br/></li><li>A great default collection of graphics, sounds, and music, giving you all the materials you need to make your game.</li></ul><br/><strong>Easy To Use</strong><br/>RPG Maker VX carries over all the easy to use features from RPG Maker XP, while adding a few more if its own. You can save time by making frequently occurring events (like chests, doors, etc.) with a single command. You can create maps faster than ever due to the simple layer system and revamped autotile tool.<br/><br/><strong>Pre-Made Graphics/Audio</strong><br/>Don’t know how to create graphics? Can’t compose music? No problem. RPG Maker VX includes a large collection of pre-made, ready to use resources for you to create your own game with. You can also import new resources from the RPGMakerWeb blog, online communities, or even import resources you made yourself.<br/><br/><strong>Share Your Game</strong><br/>Finished your game and ready to send it to your friends? With just a few clicks you can have a ready to go install file that includes everything they will need to play the game, without the need to have RPG Maker VX installed themselves.", "metacritic": null, "released": "2016-10-20", "tba": false, "updated": "2023-09-02T16:05:09", "background_image": "https://media.rawg.io/media/screenshots/6ee/6ee7c6a9e6e3b1ecb4d433fb90fe9ac5.jpg", "website": "", "rating": 3.56, "rating_top": 4, "added_by_status": {"yet": 25, "owned": 535, "beaten": 1, "dropped": 2}, "playtime": 1, "achievements_count": 0, "ratings_count": 9, "suggestions_count": 166, "game_series_count": 0, "reviews_count": 9, "platforms": ["PC"], "developers": ["KADOKAWA"], "genres": [], "publishers": ["Degica"], "esrb_rating": null}