{"id": 17358, "slug": "squirreltopia", "name": "Squirreltopia", "name_original": "Squirreltopia", "description": "The Squirrel population is in trouble! Shadow-tail, an evil, robotic squirrel has kidnapped squirrels and stolen all the gems from Squirreltopia! Get them back and defeat his powerful machines to take back your planet and prevent squirrel extinction! <br/><br/>Scurry through diverse levels, including deserts, forests, factories, and alien planets. Use the environment to your advantage, by utilizing bubble machines, bomb-blocks, balloons, invisi-blocks, and more!Features:<ul><li>Simple, addictive gameplay<br/></li><li>50+ Challenging levels! (don't worry, you have unlimited squirrels at your disposal)<br/></li><li>♫ Full Original Soundtrack<br/></li><li>5 Unique Worlds<br/></li><li>Insane Boss battles<br/></li><li>Play as many different squirrels, they will change with each life!<br/></li><li>Cutting-edge squirrel tail physics!<br/></li><li>Explore the overworld and find entrances to new levels. Play in any order!<br/></li><li>Mini-games, unlocked by finding retro game cartridges hidden in levels<br/></li><li>Keep track of your best times for each level, try to earn all the time trophies!<br/></li><li>Secret cheat items that can only be earned by the most skilled Squirrels!<br/></li><li>Can play with only 1 hand</li></ul><br/>Throughout the worlds, there are many obstacles, some are dangerous, and some may help you on your journey....<br/><br/>Note: Linux/Mac versions hopefully coming<br/><br/>PHOTOSENSITIVE SEIZURE WARNING<br/>A very small percentage of people may experience a seizure when exposed to certain visual images, including flashing lights or patterns that may appear in video games. Even people who have no history of seizures or epilepsy may have an undiagnosed condition that can cause these \"photosensitive epileptic seizures\" while watching video games.<br/><br/>These seizures may have a variety of symptoms, including lightheadedness, altered vision, eye or face twitching, jerking or shaking of arms or legs, disorientation, confusion, or momentary loss of awareness. Seizures may also cause loss of consciousness or convulsions that can lead to injury from falling down or striking nearby objects.<br/><br/>Immediately stop playing and consult a doctor if you experience any of these symptoms. Parents should watch for or ask their children about the above symptoms - children and teenagers are more likely than adults to experience these seizures.<br/><br/>The risk of photosensitive epileptic seizures may be reduced by taking the following precautions:<br/>• Play in a well-lit room<br/>• Do not play when you are drowsy or fatigued<br/>If you or any of your relatives have a history of seizures or epilepsy, consult a doctor before playing.<br/><br/>Thanks for checking the game out!", "metacritic": null, "released": "2015-01-12", "tba": false, "updated": "2022-09-29T23:48:58", "background_image": "https://media.rawg.io/media/screenshots/d6b/d6b9fbbfd1a34f350241b1902f6f542b.jpg", "website": "http://www.surrealdistractions.com", "rating": 2.17, "rating_top": 1, "added_by_status": {"yet": 4, "owned": 146, "beaten": 1, "toplay": 1}, "playtime": 3, "achievements_count": 13, "ratings_count": 6, "suggestions_count": 144, "game_series_count": 0, "reviews_count": 6, "platforms": ["PC"], "developers": ["Sean Davy", "Surreal Distractions"], "genres": ["Action", "Adventure", "Indie"], "publishers": [], "esrb_rating": null}