{"id": 173514, "slug": "the-last-witch-knight", "name": "The last witch-knight", "name_original": "The last witch-knight", "description": "Description\r\n<p>Your mission, if you decide to accept it, is to slay <em>the last witch-knight</em>.</p>\n<p>As the fight progresses, the circle of light illuminating the arena will dwindle, leaving you with less space to maneuver. (Going out of light means imminent death after a few seconds.)</p>\n<p>The game consists of the one hard boss fight. That's all.</p>\n<p>Oh, and you die in one hit!</p>\r\nControls\r\n<p><strong>Arrows </strong>- movement<br/><strong>X </strong>- shoot<br/><strong>Z</strong> - dash<br/>F11 - toggle fullscreen</p>\n<p>Try to <strong>stay in the circle of light</strong>. You can go outside for a few seconds, but stay for too long and you'll die miserably. (There is a visual indicator, so you'll know how much time you have.)</p>\n<p>Dashing not only allows you to move faster, but it also makes you invulnerable, <em>and </em>destroys projectiles.</p>\n<p>(non-QUERTY keyboards are supported properly - Z and X will be remapped to whatever the two bottom-left keys on your keyboard are)</p>\r\nStrategy Guide\r\n<p><strong>(skip to avoid spoilers)</strong></p>\n<p>This game might be a bit too hard. (Like, *Titan Souls*-esque hard.)</p>\n<p>While it might be interesting to figure everything out by yourself, it may be too frustrating.</p>\n<p>Here are a few tips to make your life easier:</p>\n<p><strong>Phase 1 - Crystals  </strong><br/>   This shouldn't be hard. Use dash to dodge bullets, and shoot crystals from afar.</p>\n<p><strong>Phase 2 - Laser  </strong><br/>   Simply wait behind a rock, until the boss comes nearby. Then dash sideways, get behind his back and hit him a few times.</p>\n<p><strong>Phase 3 - More crystals  </strong><br/>   This one is tricky. Try to destroy one of the two crystals ASAP, preferably before it starts shooting. Then you can hide behind the boss and chill.  <br/>   There is a trick to destroying the second one: Instead of rushing towards it, use boss shield to deflect bullets towards the crystal while sitting in a safe spot.<br/>   <br/><strong>Phase 4 - Magic  </strong><br/>   At this point you should know how to dodge.  <br/>   First, you need to kill the two small orbs. Beware: when one is destroyed, the other and the boss itself will start shooting at you.<br/>   After both orbs die, the boss becomes vulnerable, but also aggressive. You'll need to dash a lot.</p>\n<p>That's all, good luck!</p>", "metacritic": null, "released": "2018-08-12", "tba": false, "updated": "2019-08-28T23:21:27", "background_image": "https://media.rawg.io/media/screenshots/1f3/1f3abcf511ffc24dc34a5e7bb3917009.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 86, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Holy Black Cat"], "genres": ["Action"], "publishers": [], "esrb_rating": null}