{"id": 17373, "slug": "strike-suit-zero", "name": "Strike Suit Zero", "name_original": "Strike Suit Zero", "description": "<p>Strike Suit Zero is a space flight combat game. The game was funded via Kickstarter and advertised itself as an attempt to revive space flight combat genre. </p>\n<h3>Plot and setting</h3>\n<p>The game takes place in the distant future. The main protagonist is a pilot for United Nations of Earth and must help his home planet in a war against united forces of space colonies. </p>\n<h3>Gameplay</h3>\n<p>The game consists of several missions. In each one of them, you participate in a massive space battle. The missions’ design intends to simulate full-fledged warfare that does not revolve just around the player. The player has to perform a specific task in every mission such as protecting an important ally or destroying the certain enemy object. <br />\nThe player can choose between four types of spaceships: interceptor, fighter, bomber and the Strike Suit. Using the last one, the player can switch their spacecraft between fighter-mode and strike mode. In the strike-mode, the Strike Suit transforms into a more agile human-like mech. <br />\nThroughout the game, the player unlocks different types of weaponry, including machine-guns, missiles, lasers, plasma cannons, and rockets.</p>\n<h3>Additional features</h3>\n<p>The game supports joysticks</p>", "metacritic": 66, "released": "2013-01-23", "tba": false, "updated": "2023-12-19T12:42:06", "background_image": "https://media.rawg.io/media/screenshots/bc7/bc7213e54142ad1b902978395182de02.jpg", "website": "http://www.strikesuitzero.com/", "rating": 2.86, "rating_top": 3, "added_by_status": {"yet": 56, "owned": 1077, "beaten": 4, "toplay": 5, "dropped": 36}, "playtime": 2, "achievements_count": 40, "ratings_count": 51, "suggestions_count": 473, "game_series_count": 0, "reviews_count": 51, "platforms": ["PC", "macOS", "Linux", "Android", "Xbox One"], "developers": ["Born Ready Games"], "genres": ["Action", "Simulation", "Indie"], "publishers": ["Born Ready Games"], "esrb_rating": null}