{"id": 173741, "slug": "oasis-itch-angrycomputernerd", "name": "Oasis (itch) (angrycomputernerd)", "name_original": "Oasis (itch) (angrycomputernerd)", "description": "<p>Oasis is a 3D adventure action game with puzzle solving elements. The game is designed with a minimalist philosophy. The graphics are low poly but with a stylish look which enables the game to be run on a broad spectrum of hardware. The mechanics are also kept simple but combined in new and unique ways. My goal is to create games that are heavy on the fun but light on wallet and your machines hardware.</p>\n<p>Currently the game is in the early pre-alpha stages so expect changes as things progress. You can try the development demo now at</p>\n<p>https://gamejolt.com/games/oasis/320012</p>\n<p>https://angrycomputernerd.itch.io/oasis</p>\n<p>The minimalist game design philosophy. This philosophy is how I approach game development. The idea is simple. It means to use the minimal for controls , mechanics and graphics but still deliver a high quality, challenging, and rewarding experience.</p>\n<p>The controls are designed to feel comfortable no matter your preference. No what you choose, the classic mouse and keyboard or the modern game pad, the controls should feel fluent and easy to learn. The game pad set up was designed using the common Logitech F350 which emulates the modern dual joystick Playstation and Xbox controller.</p>\n<p>The game mechanics where designed around an open exploration model. I wanted to keep locked areas that require special items or skills to the minimum. To do this the game has retain a moderate challenge in each area without being so easy it becomes boring or so challenging the player becomes frustrated.</p>\n<p>The combat mechanics also adapt the minimalist approach. The movement and attack mechanics use the fewest buttons and combinations possible. The combat relies more on using the environment and your weapon type to find creative ways to approach the enemy than complex finger movements and button press combinations.</p>\n<p>New items are introduced in each zone and they're used to help overcome obstacles in that zone. You'll also find a variety of ways to use items outside their home zones to find hidden treasures or new ways defeat enemies. Items should feel useful no matter where you are in the game.</p>\n<p>Graphics don't need to be complex or high poly to be interesting. To keep the game running smooth I've chosen low poly models with a bright cartoon style. The details are kept spread out but not so sparse the game world looks empty and not so much it breaks the game performance. I've also included an in game graphics control that allows you to reduce graphics and draw distance so the game can run on the simplest of toasters. I was able to get between 30 - 60 frames running on a netbook with 2GB RAM and a 1.6GHZ dual core processor using Windows 10 with the graphics set to the second lowest tier and without reducing the draw distance.</p>\n<p>Thanks to everyone who helped out on my journey so far. I want this to be the first of many great games to come. In the end if I'm able to receive enough funding the game will be free. Otherwise I'll attach a small price between $5 to $10.</p>\n<p>If you're interested in supporting this project you can contribute directly at</p>\n<p>https://www.angrycomputernerd.com/donate.html</p>\n<p>or visit the Kickstarter page</p>\n<p>https://www.kickstarter.com/projects/535388160/oasis-a-3d-adventure-game</p>", "metacritic": null, "released": "2018-02-16", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/95a/95a1d138514ada25de4862b33880c967.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 35, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["angrycomputernerd"], "genres": ["Action", "Adventure", "RPG", "Puzzle"], "publishers": [], "esrb_rating": null}