{"id": 17377, "slug": "east-india-company", "name": "East India Company", "name_original": "East India Company", "description": "In East India Company, players will enjoy building the World's most powerful trading empire &amp; engaging in vigorous battles in both single player &amp; multiplayer modes, all within a breathtaking cinematic game environment.<br/>\t\t\t\t\tPlayers will fight, manage, and rule nations from Europe to the Far East with eight nationalities to chose from: British, Dutch, French, Danish, Portuguese, Swedish, Spanish, and the Holy Roman Empire.  Starting modestly, you will build your fleet, establish connections to far away countries, and keep the rivaling nations at bay.  Choose from a wide array of ship classes, including a variety of transport and military vessels.  Create diverse fleets and assign each of them specific trading routes.  Control and upgrade well situated ports as you form your strategy for domination.<br/>\t\t\t\t\tConflicts and wars are inevitable.  When hostile fleets engage each other, the spectacular naval battles are fought from a real-time tactical level.  Devastating broadsides are fired with a deafening roar and cannon balls tear through enemy ships and their crew.  For greater tactical depth, command your ship and give independent orders to each of your fleets.  Fight against the other European powers to create a trading empire that will rule above all others in this groundbreaking strategy war game!<br/>\t\t\t\t\tFeatures:<br/> <ul><li>Spectacular cinematic &amp; epic naval battles<br/> </li><li>2 Command Modes: Give orders to all your ships in RTS or take the helm of a single ship in Direct Command-mode.<br/> </li><li>Unique combination of war &amp; trading<br/> </li><li>State of the art diplomacy AI<br/> </li><li>8 playable nations:  England, France, Holland, Portugal, Denmark, Sweden, Spain &amp; the Holy Roman Empire <br/> </li><li>Over 10 realistic ship types; from small sloops and cutters to East Indiaman and warships<br/> </li><li>Realistic yet fast-paced naval combat<br/> </li><li>Hire fleet commanders who will gain new skills &amp; increase the abilities of your fleets<br/> </li><li>Take over ports &amp; protect your shipping routes to create largest trading empire<br/> </li></ul>Multiplayer (Internet or LAN):<br/> <ul><li>Up to 8 simultaneous players<br/> </li><li>Player statistics tracked on the EIC game server<br/> </li><li>Several game modes with single &amp; team approach<br/> </li><li>Raise your ranking by thwarting your opponents<br/> </li><li>Head-to-Head missions are a true test of strategic skill<br/> </li></ul>FIGHT!<br/> <ul><li>Use Military might to build your trading empire<br/> </li><li>Command ships &amp; fleets independently<br/> </li><li>Wage war on the vast open sea<br/> </li><li>Sink your rivals' ship or board them to take control<br/> </li></ul>MANAGE!<br/> <ul><li>Hire fleet commanders to boost your fleet's abilities<br/> </li><li>User commander skills to give you an edge in battles<br/> </li><li>Upgrade your ports with new buildings<br/> </li><li>Buy &amp; Sell goods<br/> </li><li>Establish profitable trading routes<br/> </li><li>Open diplomatic relations or declare War<br/> </li><li>Negotiate tense political situation<br/> </li></ul>RULE!<br/> <ul><li>Lead the most powerful company in history<br/> </li><li>Take over colonies &amp; expand your empire<br/> </li><li>Use well modeled diplomacy to exert your power<br/> </li><li>Conquer strategic ports<br/> </li><li>Accomplish missions ordered by your company or the Crown<br/> </li></ul>", "metacritic": 67, "released": "2009-07-31", "tba": false, "updated": "2022-08-03T08:31:51", "background_image": "https://media.rawg.io/media/screenshots/296/296d25ee0c67d030769ca1380701fb28.jpg", "website": "http://www.eic-game.com/", "rating": 2.38, "rating_top": 1, "added_by_status": {"yet": 11, "owned": 188, "beaten": 1, "dropped": 6}, "playtime": 1, "achievements_count": 0, "ratings_count": 8, "suggestions_count": 499, "game_series_count": 0, "reviews_count": 8, "platforms": ["PC"], "developers": ["Nitro Games"], "genres": ["Strategy"], "publishers": ["Nitro Games"], "esrb_rating": null}