{"id": 173892, "slug": "guerrinha", "name": "Guerrinha", "name_original": "Guerrinha", "description": "<p>Lembra de brincar com seus amigos de guerra com arminhas de dedo?<br/>Gosta de jogos de tiro que simulam uma guerra de verdade?<br/>E SE A GENTE JUNTASSE OS DOIS?!<br/><br/>Guerrinha é um FPS que representa uma brincadeira de criança com armas de dedo , mas levada a sério. Você deve sobreviver o maior número de rodadas contra hordas de crianças bravas que querem te tirar do jogo. Colete outros tipos de armas do chão para aumentar seu poder de dedo e conseguir ficar mais tempo de pé.</p>\n<p><strong>Controles:</strong></p>\n<p>WASD -&gt; Movimentação<br/>Mouse -&gt; Atirar e interagir em menus<br/>R -&gt; Recarregar</p>\n\n<p>Este é um jogo feito para a Ludum Dare 41, cujo tema foi \"Misture 2 gêneros incompatíveis\". Confira em: https://ldjam.com/events/ludum-dare/41/guerrinha-tiny-war<br/><br/>Nós somos estudantes de Ciências de Computação na USP de São Carlos, e fazemos parte do grupo de desenvolvimento de jogos chamado Fellowship of the Game. Saiba mais sobre nós no nosso Facebook, Itch.io e no nosso site.</p>\n<p>Equipe:<br/>- Programação: Gabriel \"Cartaz\" Simmel, Óliver Becker, Lui Franco<br/>- Arte: Fabrício \"Bibicio\" Guedes, Ana Spengler<br/>- Som: Fabrício \"Bibicio\" Guedes</p>\n<p>Vozes e agradecimentos: Gabriel Toschi, Willian \"Binário\" Leodegario, Arthur \"Amnésia\" Rosa, Gabriel Ginja, Giovanni \"Gio\" Meloni, Fellowship of the Game<br/><br/>Obrigado a todos que participaram conosco e nos apoiaram, e obrigado à Ludum Dare por proporcionar essa oportunidade! &lt;3</p>\n\n<p>=====================================================<br/></p>\n<p><strong>Tiny War</strong></p>\n<p><em>A war game with finger guns!</em></p>\n\n<p>Remember playing with your friends using finger guns?\r\n<br/>Do you like shooting games that simulate real life?<br/>WHAT IF WE MIXED BOTH?!\r\n<br/>\r\nGuerrinha (\"Tiny war\") is an FPS that represents a children's game taken seriously. You must survive as many rounds as you can against hordes of angry kids that want to take you out of the game. Pick-up more weapons from the ground to up your finger arsenal and last longer in the fight.</p>\n<p><strong>Controls:</strong></p>\n<p>WASD -&gt; Movement<br/>Mouse -&gt; Shoot and interact with menus<br/>R -&gt; Reload</p>\n\n<p>This is a game made for Ludum Dare 41, with the theme \"Combine 2 incompatible genres\". Check it out at: https://ldjam.com/events/ludum-dare/41/guerrinha-tiny-war<br/><br/>We are Brazilian Computer Science students from USP São Carlos, and we are part of a Game Development group called Fellowship of the Game. Check us out at Facebook, Itch.io and at our website (in Portuguese, sorry 😔 ).<br/></p>\n<p>Team:\r\n<br/>- Programming: Gabriel \"Cartaz\" Simmel, Óliver Becker, Lui Franco<br/>- Art: Fabrício \"Bibicio\" Guedes, Ana Spengler<br/>- Sound: Fabrício \"Bibicio\" Guedes<br/></p>\n<p>Voices and acknowledgements: Gabriel Toschi, Willian \"Binário\" Leodegario, Arthur \"Amnésia\" Rosa, Gabriel Ginja, Giovanni \"Gio\" Meloni, Fellowship of the Game\r\n<br/><br/></p>\n<p>Thank you to everyone that participated with us and supported us, and thank you to Ludum Dare for providing this opportunity! &lt;3</p>", "metacritic": null, "released": "2018-04-24", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/3f7/3f7ef80adc6500c59349151d0e6e0240.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 56, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Fabrício Guedes", "brlui"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}