{"id": 173811, "slug": "introduction-for-a-game", "name": "introduction for a game", "name_original": "introduction for a game", "description": "<p>I'm sure I will not come to regret anything about my decision to submit this thing! It's an introduction for a game of interactive interactive fiction that we might play together. There is a lot of it! I had fun making it. It is creative and personal and vulnerable and weird. It is almost certainly too much of all of those things. But if you stick around to the end it'll tell you where to find the game, or the place where a game might be. And if nothing else I figure it's probably at least <em>interestingly</em> crazy.</p><p>(And since I wrote the aforegoing, the game has begun, and begun to bear first fruit!)<br/><br/><strong>Author Q&amp;A</strong> (maybe a FAQ? Idk what questions do you have? Ask me them and I will produce a frequency distribution!)<br/></p>\n<p><em>You were high when you wrote this, weren't you? You were SO HIGH.</em><br/>Fair question! But no. I was <em>delirious</em>, near the end of a bout with this season's unusually nasty flu which had me more or less delirious throughout the entire time I had it.<br/></p>\n<p><em>Close enough. You wouldn't have written something like this if you weren't in some way out of your head, right?</em><br/>Sure I would. But I probably <em>could</em> not, at least not before the flu. After? Maybe. Who knows? I've got a better chance than I did. But if that question is an oblique way of asking another, why not come out and ask that one instead?</p>\n<p><em>Okay. Is this - I mean how much of this is </em>real<em>? To you, I mean. Is this an elaborate piece of text-based performance art? Or is this actually how you see yourself?</em><br/>That is <em>three</em> questions, unnamed interviewer whose discursive style is suspiciously similar to my own! And I suppose it's a bit of both.<br/><br/>While I was writing, I <em>felt</em> everything I wrote, as strongly as I've ever felt anything in my life. Such intensity of emotion cannot be sustained, though - even when it's <em>not</em> enabled in part by a fever high enough to mess with the way your brains work. I certainly don't feel it that strongly now!<br/><br/>But simply because I don't feel it so strongly now doesn't mean it is no longer in some way real to me. Yes, I did have a fever high enough to mess with the way my brains work - but that didn't cause me to <em>invent</em> any of what I wrote. All of that has been floating around in there for quite a number of years now. The fever just...gave me a perspective that I'm not used to having on the contents of my skull, and I used that perspective to put together something I could not have in its absence.</p>\n<p><em>So what you're saying is that you actually do have a female </em>alter ego<em> who lives in your head and calls herself Alexis?</em><br/>Yeah! She's great, I'm super a fan.</p>\n<p><em>That's weird.</em><br/>That's not a question, unnamed interviewer whose discursive style seems suspiciously suggestive of a strawman created only to raise potential objections to my actions here so that I may preemptively dismiss them! But - yes, it's weird. And one of the benefits of the unusual perspective I've recently had, on the contents of my skull, is that it reminded me that <em>weird is okay</em>. Which is a real relief because I've got a lot of weird in here!</p>\n<p><em>No kidding. And the part about how Alexis is maybe dying and you need people's help to save her? You stand behind that now, too?</em><br/>That's a somewhat complicated question to answer. I became aware of Alexis quite a few years ago. Since then, she's never not been with me, albeit more quietly at some times than at others. We've never not been able to have a conversation, although there have been times when we chose not to speak to one another. This sense that she's...I don't know, <em>abstracted</em> herself from me - this is new, and not especially pleasant or comfortable. It is possible that I overreacted somewhat!</p>\n<p>But I'm still okay with that. I mean, maybe something fun will come out of it! And even if it doesn't, I'm not upset that I wrote what I did, or that I posted it. I feel like there's probably something there of benefit to someone. And even if there isn't, where's the harm?</p>\n<p><em>Well, people might think you've gone crazy. Did you consider that at all?</em><br/>The thought has crossed my mind once or twice. If that is a concern that anyone is having, then I suppose my response would be that, if I am indeed crazy, then I am crazy in a way which not only fails to preclude - but in fact actively supports and enables - a successful and highly remunerative career in software engineering, along with a wide range of actively pursued hobbies paramount among which I place writing, photography, and discovering new ways in which to be kind to others. Maybe by you this is nonetheless still a bad kind of crazy! If so, you may wish to check your definitions, because I think you have got the meaning of \"bad\" wrong.</p>\n<p><em>Has it occurred to you that all of this \"Alexis\" business might be nothing more or less than the Jungian integration process gone wrong, and that your fear-driven failure to confront your shadow may have caused you to excessively reify your anima by way of compensation in a way that may become extremely dangerous to you?</em><br/>That is a remarkably specific question, unnamed interviewer whose discursive style suggests you may be my self-doubt given voice! Yes, it has occurred to me. It doesn't seem terribly likely, seeing as - if we're going to be Jungian about this for a minute, and why not? - my shadow and I have been on speaking terms for a long time now, too. It's possible I'm getting owned super hard right now and totally do not know it! But I don't think so.<br/></p>\n<p><em>Okay. Getting back to whether this all might cause people to question your mental health, a followup question: What about other people in your life? What you wrote here makes you seem awfully lonely. You okay with that too?</em><br/>It's not terribly pleasant! I mean, don't get me wrong: I am well acquainted with solitude, and aware of the difference between solitude and loneliness, and very fond of the benefits that solitude has to offer. But I am lonely, too. It's a situation I would like in the fullness of time to change, though in that pursuit I am no longer willing to risk losing access to solitude when I need it.<br/></p>\n<p>But if you're asking whether I'm okay with having made that loneliness so evident in what I posted here - I mean, I don't know? I'm a little embarrassed about having made it so raw, I guess? But I'm not sure why, or why I shouldn't be real about it. I mean there are a lot of lonely people in the world, and one of the really pernicious things about being lonely is that after a while you begin to get this sense that you are as you are because you deserve no better, and that to try to change your situation - to reach out to others, in order to make it possible that someone might reach out to <em>you</em> - is foolish and stupid and pointless and only an imposition on everyone else in the world. Feeling that way is a terrible thing to do to yourself. It's agonizing and it's ultimately self-defeating. I decided I'd rather risk looking like a fool than do it to myself any more. Maybe I have made myself look like a fool! It's early days yet and I suspect I overcorrected. But I'd rather risk that than go on as I was. And maybe, if I'm very lucky, something in what I said about loneliness, or in the way that I said it, will be of some use to someone else who's feeling the same way lately.</p>\n<p><em>So you see yourself as helping other people by doing what you've done?</em><br/>To deny that I have done this primarily for my own benefit would be a lie. But I <em>do</em> think it's possible that, in doing what I've done, I've put something out there in which maybe someone else will find something that is in some way of use to them! I mean, sure, its focus is relentlessly interior, and it is above all else an extended act of introspection in written form, and it is in the nature of a rather pathetic plea for a certain kind of help. And, sure, those characteristics make it more likely than otherwise both to fail in its stated purpose, and to fail to be of any use to anyone other than myself. But hey who knows? There's a chance it may <em>not</em> fail, too. Maybe not a very good one, but not nothing, either! That's why I haven't taken it down.</p>\n<p>I don't know. I'm pretty sure by this point that nobody is going to want to get in the Discord and do a thing! I mean not gonna lie I'm a hot mess and I don't blame anybody for not wanting one of those on their hands. But maybe seeing what I've done will help somebody else find the courage to be real in the world, too. Help them see that it's not as scary as we tend to make it in our heads. I think there's a chance its presence might do somebody a favor, and I don't see how it being here does any harm. So what the hell, I'll leave it up.</p>\n<p><em>And you're not worried that people will think you're weird or crazy because of it?</em><br/>We already covered that point, unnamed interviewer whose discursive style seems to be growing more generic as I run out of questions to cover here! And, no, I'm not. I mean, I <em>am</em> weird. And if we agree to abide by the instrumental definition of insanity in which to be \"crazy\" is to see the world from a perspective whose correspondence with consensus reality is more than a standard deviation or so away from the population mean, then I'm probably a bit crazy too!</p>\n<p>On the other hand, there's nothing wrong that I can see with being weird. And if we take the more usual definition of insanity, in which to be \"crazy\" is to be so unable to distinguish reality from unreality that one is unable to conduct one's affairs or maintain oneself safe from the risk of harm by others or oneself, then I am quite, quite sane.</p>\n<p><em>If you say so. Anything else you'd like to add?</em><br/>Yes! Someone once told me that I am much more interesting when I express my real thoughts. Perhaps he was only being kind! But perhaps he was also being honest. In any case, that's what I've done here, as best as I was able - which is, I think, rather better than my usual pre-flu wont. Whether or not you, who is reading this now, finds it at all interesting - well, that's up to you.</p>\n<p><em>And that's all the time we have. Thank you for taking the time to join us here today!</em><br/>What a silly thing to say, unnamed interviewer whose purpose has now been served! But hey, thanks for having me. It's been real.<br/></p>", "metacritic": null, "released": "2018-02-02", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/95c/95c84cfca0625934b4c6fe520d81d48f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 12, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["a little alien thing"], "genres": [], "publishers": [], "esrb_rating": null}