{"id": 173814, "slug": "weed-racer", "name": "Weed Racer", "name_original": "Weed Racer", "description": "<p>\"That's a dope concept.\"</p><p>Weed Racer, Blow Blaster, Shroom Vroom, and Molly Mayhem were household names in the 70s. Every Saturday morning families would flock to their televisions to watch their cartoons. Times have changed since then, and so have our heroes. Now the animated stars of yesteryear have returned to the small screen to participate in America's favorite celebrity bumper-car racing game. Who will bring home the $10,000 cash prize for the charity of their choice? Are any of them really sober enough to be driving? Tune in to find out...</p><p><em>Weed Racer</em> is a demo of a 4-player racer game, created as a student project over the course of a five-day sprint. This was my first attempt at creating a multiplayer game. I had two primary goals in creating this game: first, I wanted to create a game that was genuinely fun to play (something I think I had failed to do in earlier games); second, I wanted to create a game by starting from the mechanics rather than from the story - I wanted to make a racing game in which the best way to win was to be bad at racing games. I accomplished this mainly by changing how crashing affected the player. First, I made it so that crashing does not reduce speed. Second, I introduced a buff/debuff system into crashing so that crashing into another player would cause both players to be affected. </p><p>Working from the mechanics up was both a challenge, and a pleasure. These bumper cars were both fun and a challenge to model, and finding a way to implement the bumper-car crashing I wanted without all the cars clipping through the walls and launching into the void caused me a rather infuriating amount of frustration.</p><p>In terms of the story, that all happened by accident. The drugs and 70s cartoons all happened at the same time. I was watching an old episode of <em>Speed Racer</em> for inspiration, and I was suddenly struck by the lightning bolt inspiration that was the pun \"Weed Racer\". I liked it. It made me laugh. I decided to run with it. Despite my full intentions NOT to focus on the story for once, I actually ended up creating a really zany story. Shame most of it didn't make it into the game. Mostly a time issue. I really didn't have the time to create the <em>Clutch Cargo</em> style cutscene I wanted to or record the voice lines for a <em>Wacky Races</em> style announcer. Oh well. All things to add in the next version.</p><p>Please note: for this game to work properly, it is recommended that you have a second keyboard plugged into your computer.</p>", "metacritic": null, "released": "2017-03-31", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/ecb/ecb6904c5a81b6211a34078290880917.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 120, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Octopi with Hats"], "genres": ["Sports", "Racing"], "publishers": [], "esrb_rating": null}