{"id": 17419, "slug": "the-secret-world-ultimate-edition", "name": "The Secret World: Ultimate Edition", "name_original": "The Secret World: Ultimate Edition", "description": "Get the ultimate experience of this deep and unique Massively Multiplayer Online Game with The Secret World: Ultimate Edition - it contains the full first season of content updates (Issues #1-11)!<br/><br/><br/><br/>The Secret World is a modern MMO unlike any other. Play through the incredible story and face unknown horrors, challenging puzzles, exciting mysteries and brutal monsters. Join one of three Secret Societies and travel from New England to Egypt, Transylvania, Venice and Tokyo in a modern world where legends come to life!<br/><br/>No subscription is required to play The Secret World.The Secret World: Ultimate Edition contains:<ul><li><strong>The full Secret World massively multiplayer online game with 30 days Membership included.</strong><br/></li><li><strong>Issue #5: The Vanishing of Tyler Freeborn – A deep and dark mystery investigation on Solomon Island.</strong><br/></li><li><strong>Issue #6: The Last Train to Cairo – An epic Indiana Jones-style adventure (including time travel!) in Egypt.</strong><br/></li><li><strong>Issue #7: A Dream to Kill – A spy thriller full of intrigue and action in the snowy mountains of Transylvania.</strong><br/></li><li><strong>Issue #8: The Venetian Agenda – Take on virtual training scenarios in Venice.</strong><br/></li><li><strong>Issue #9: The Black Signal – Discover the all new adventure zone and continue the main story.</strong><br/></li><li><strong>Issue #10: Nightmares in the Dream Palace – Learn who set off the rising tide of darkness.</strong><br/></li><li><strong>Issue #11: Reaping the Whirlwind – Reap the consequences of your choices in the main story!</strong><br/></li><li><strong>Sidestories: Further Analysis – Four Investigation Missions with Deep Mystery Box and The Inspector's Gadget rewards.</strong><br/></li><li><strong>Sidestories: Love &amp;amp; Loathing – Five Missions with Deep Mystery Box and Cracked Noh mask rewards.</strong><br/></li><li><strong>Sidestories: The Last Pagan – Six Missions with Deep Mystery Box and Lorenzian Fabricator rewards.</strong><br/></li><li><strong>Beginner Weapons – A full set of nine powerful and cool looking starter weapons.</strong><br/></li><li><strong>AP Injection (25 cc) – Gain 25 Ability Points instantly for a flying start.</strong><br/></li><li><strong>Ability Point Boost – For three days you earn double Ability Points as you play the game.</strong><br/></li><li><strong>Issue #1 - #4 – These content updates were released for free in 2012 and are fully available for you to explore.</strong><br/></li><li><strong>The Zenith Core – An exclusive and epic outfit for all your characters.</strong></li></ul><br/>The full value of The Secret World: Ultimate Edition is $162.The Secret World:<br/>The Secret World is a massively-multiplayer online world with a unique modern-day setting and unparalleled storytelling. Imagine if every myth, conspiracy theory and urban legend was true--a world where you align with secret societies and face the looming darkness.  No subscription required!<br/><br/><strong>Key features:</strong><br/><br/>Dive head-first into a deep, mature, story-driven experience, featuring fully-voiced in-game cutscenes that bring the world and its characters to life!  Challenge yourself with unique missions that require a sharp wit and keen eye to complete!<br/><br/><br/>Declare your allegiance to one of three secret societies:  The Illuminati, The Templar, or The Dragon--each with their own history and agenda.  Who will you choose?<br/><br/><br/>No classes, no levels.  Choose from over 500 abilities across firearm, occult magic, and melee weapons, then unleash your true potential with glyphs, signets, augmentations, and more!  Limitless customization awaits.<br/><br/><br/>Everything is true.  Survive the undead in modern-day New England, battle mummies in the sands of Egypt, hunt vampires in Transylvania, and even face off against demons in the streets of Tokyo!  <br/><br/><br/>No membership required. Purchase the game and experience The Secret World without a monthly fee.  Optional membership and in-game services offer tons of Loyalty Rewards and more!", "metacritic": null, "released": "2015-06-11", "tba": false, "updated": "2022-09-04T11:57:06", "background_image": "https://media.rawg.io/media/screenshots/c25/c25c83709fb7e9a12f25637678c10ff4.jpg", "website": "http://www.thesecretworld.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 663, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Funcom"], "genres": ["Adventure", "RPG", "Massively Multiplayer"], "publishers": ["Funcom"], "esrb_rating": "Mature"}