{"id": 17426, "slug": "world-of-fishing", "name": "World of Fishing", "name_original": "World of Fishing", "description": "World of Fishing is a unique mix of &amp;quot;Big Game Fishing&amp;quot; Simulator and fully-fledged MMO with hundreds of players around the world featuring <strong>character development</strong>, <strong>hundreds of items</strong>, <strong>exciting quests</strong> and the <strong>addictive hunt</strong> for rare fish. <br/><br/>Starting out with a small boat and basic equipment, players can work their way up to the point where they can <strong>catch huge fish</strong> from run-of-the-mill tuna to big-game <strong>exotic sharks</strong>, sail luxury yachts and use state-of-the-art angling gear.<br/><br/>Dynamic real-time fights with<strong> more than 450 species of fish</strong> controlled by a <strong>realistic AI</strong> provide entertaining and challenging gameplay that feels as <strong>close to the real thing</strong> as possible. <br/><br/><strong>Competitive players</strong> can face each other in <strong>Team Match Mode</strong>, while casual players will be able to enjoy the relaxing side of fishing in Freestyle mode, and visit beautiful, exotic fishing spots from Vancouver to Cape Town.<br/><br/>Features:<br/><br/><ul><li>Extensive, RPG-like character development<br/></li><li>Over 450 different types of fish<br/></li><li>Authentic fish AI<br/></li><li>A huge variety of boats, clothing and equipment<br/></li><li>30 fishing locations all over the world<br/></li><li>Dozens of quests, Daily and Instant Missions<br/></li><li>‘Freestyle’ mode and team competitions<br/></li><li>Ranking system<br/></li><li>Create or join clubs<br/></li><li>Showcase your biggest catch in your aquarium</li></ul><br/><br/>Please note:<br/>- In order to play WoF you need to create an InselGames account that is linked to your Steam account. You will find the link to the sign-up page within the game client which will enable you to integrate your Steam ID with our account system. Do not register directly on our website!<br/>- Any accounts created on our website will not be able to log into the Steam client due to restrictions by Valve. Likewise, accounts created in the Steam client cannot log into the standalone client. You need to use a different email as this serves as your login name.<br/>- Whether or not you play the game via Steam both the Steam and the non-Steam versions are identical and all players, regardless of the platform they use, can play on the same servers<br/>- Please use a valid email-address and confirm your account by clicking the link in the confirmation email otherwise your account will be deleted after two weeks!<br/><br/><strong>How to register for World of Fishing on Steam?</strong><br/>- Download the client via Steam and start it from Steam<br/>- Launch the game by clicking &amp;quot;Play&amp;quot; in the Patcher. Click the “Register!” button in the login menu. <strong>Do not register on our website directly!</strong> <br/>- Set your e-mail and password for the InselGames account on the website. Accept the terms of service and click “Register now!”.<br/>- Go to your e-mail’s inbox and click the confirmation link from the World of Fishing registration mail.<br/>- Your account has been successfully confirmed and can now be used to login into the Steam version of World of Fishing.", "metacritic": null, "released": "2016-09-06", "tba": false, "updated": "2019-04-19T12:59:49", "background_image": "https://media.rawg.io/media/screenshots/e6a/e6a9a733f9cac5e4bef565a5c9e2a83b.jpg", "website": "http://register.worldoffishing.net/steam.html", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 45, "beaten": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 3, "suggestions_count": 329, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC"], "developers": ["Masangsoft"], "genres": ["RPG", "Simulation", "Sports", "Massively Multiplayer"], "publishers": ["InselGames"], "esrb_rating": null}