{"id": 174232, "slug": "frogpocalypse-aka-2fr0g", "name": "Frogpocalypse (a.k.a. \"2fr0g\")", "name_original": "Frogpocalypse (a.k.a. \"2fr0g\")", "description": "<p><em>2fr0g is a work in progress, and may contain bugs (no pun intended!)</em></p><p><strong>UPDATED: JANUARY 12, 2016: New beta version 0.99!</strong><br/></p><p>Pronounced \"TOO-frog\", 2fr0g is a modern mashup of various classic 8-bit frog games. Four different-colored frogs are controlled by between one and four humans, each with their own USB gamepad. (Player 1 can use the keyboard.) The game's AI controls any remaining frogs as players jump around a pond and its various randomly-placed lily pads. Each two-frog team is trying to bring the most flies home to their froggy mamas, who sit in opposing corners of the screen. But watch out for the Hippo! Or you'll get knocked back home to Mama.</p><p>Find out more at http://xelf.me/2fr0g.html</p><p>Here's also a gameplay video: </p>Gameplay Design <p>Each player uses a USB gamepad with analog stick to aim, and any button to jump in the direction currently being held. (The 8 compass and diagonal directions are supported.)</p><p>Player 1 may be controlled using the arrow keys and the shift key against AI when no gamepads are available, or against a human Player 2 using one gamepad.</p><p>Gameplay occurs on a single non-scrolling screen with a blue background representing the pondwater. At the start of the game, Mama 1 is placed on a lily pad in one of the left-hand side corners with her two babies. Mama 2 and her team are placed at the diagonally opposite corner. The positions of other lilypads are scrambled for each new round.</p><p>At the beginning of each round, a fly emerges from the island placed equidistant from both Mamas. When a frog touches the fly, he grabs hold of it and becomes the fly-carrier until one of these events occurs:</p> <ul><li>Frog touches opposing team member: fly knocked away from both</li><li>Frog reaches mama: team is awarded a goal, and gameplay situation resets.</li></ul> <p>Movement while in water is slow; jump along lilypads to move much faster. Carrying the fly makes you even slower, so you must rely on your teammate to protect you! If your teammate has the fly, bonk away any opposing frogs by jumping into them. (Teammates do not obstruct one another.)</p><p>The fly will wake up and start wandering if it is not held.</p> Hippopotamus warning! <p>A hippo may occasionally appear, preceded by stomping waves and an ominous sound. The waves appear in the area where the hippo is about to surface. The hippo wanders toward frogs for a short while, and then disappears. If the hippo touches a frog, the frog is bounced toward away and must wait several seconds before moving again.<br/> Game duration and scoring</p><p>The team with the most flies when bedtime occurs (at the end of 4 minutes) is the winner. A stalemate can also occur.</p><p>The background color becomes darker and darker as the time counts down. When the background becomes black, the game is almost over.<br/> Kids mode setting</p><p>AI aggressiveness and movement are modified by the toggling of Kids mode. A teddy bear icon appears when Kids mode is activated. The hippo and frogs move more slowly, and the hippo knocks you out of the game for a much shorther period in this mode.</p> Team play AI setup and strategy <p>The setup screen consists of each frog blinking in turn; pressing a button while a frog is blinking causes that controller to be associated to that frog; the next frog starts blinking, etc.</p><p>Instead of a joystick button, SPACEBAR may be pressed to indicate that the blinking frog should use AI instead. Press \"W\" to cancel all input settings, and watch the game's AI play against itself!</p><p>Each frog on a team has a particular AI strategy for use when a human is not controlling it. On each team formation, the odd-numbered frog is the Striker and the even-numbered frog is the Guard. These roles influence how the team members coordinate when both are AI; by choosing which humans control which frogs on the setup screen, players can choose which AI routines participate.</p><p>The Strikers are frogs 1 and 3, yellow and pink—the same colors as their Mamas. The Guards are their respective blue and green teammates, frogs 3 and 4. When the fly is free, Strikers go for it while their Guards try to knock opposing players away from getting the fly. Once their teammate grabs the fly, then Guards attack anyone trying to get the fly back. Once the action gets close to a Guard's opposing Mama, the Guard will try to get in between them and knock the fly carrier away to prevent the goal.</p> Design Influences <ul><li>\"Frogs and Flies\" (Mattel, for VCS and Intellivision) is the source of the general motif—non-violent multiplayer with frogs and flies. </li><li>From \"Frogger\" (Konami, for arcade and VCS) i have borrowed the overhead 2-D perspective of jumping from lilypad to lilypad, as well as needing to avoid animals in the water.</li><li>\"Ice Hockey\" (Activision, for VCS) gives us a great model of 2-on-2 hockey madness that will be even cooler when transported into the world of frogs and playable with four controllers.</li><li>\"Warlords\" (Atari, for arcade and VCS) doesn't have the team-play aspect of \"Ice Hockey\", but it does support up to four human players fighting over one ball, with various AI taking hold of non-controlled bots.</li></ul> Notes <ul><li>Possibly other (ridable?) animals can be added.</li><li>The game is intended to be non-violent, so it is left unspecified what Mama does with the flies after bedtime.</li></ul>", "metacritic": null, "released": "2015-12-26", "tba": false, "updated": "2019-08-28T23:28:08", "background_image": "https://media.rawg.io/media/screenshots/80e/80ecc3e6d667a2f7402a1460c117237d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 32, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["dto"], "genres": ["Action"], "publishers": [], "esrb_rating": null}