{"id": 17427, "slug": "duke-grabowski-mighty-swashbuckler", "name": "Duke Grabowski, Mighty Swashbuckler", "name_original": "Duke Grabowski, Mighty Swashbuckler", "description": "<strong>\"Duke Grabowski is a loving tribute to the latter Monkey Island games, and wears its influence on its sleeve.\"</strong> - Kevin McClusky of Destructoid  <br/><br/>Duke Grabowski, Mighty Swashbuckler is a classic point-and-click adventure, created with love by an indie team that includes LucasArts alumni, Bill Tiller (The Curse of Monkey Island, Steven Spielberg's The Dig, Indiana Jones and the Infernal Machine). Play as Duke, a pirate who’s had success in pillaging, ransacking, and other forms of piratey goodness, but doesn’t know a thing about women. Help him prove to his crew he has what it takes to become a captain by winning the affection of the opposite sex – a task that is the most difficult challenge this seasoned pirate has faced! Along his journey to “sea-deuce” he’ll have to tame jaguars, fight zombie sailors, and even wrestle a gorilla!<br/><strong>Features:</strong><br/><br/>A Sprawling Adventure – Enjoy tropical locations, solve amusing puzzles, and revel in comic pirate mischief.<br/><br/>Full Voiceover – Every wild character Duke meets comes to life with the work of talented voice actors, including Erik Braa (Telltale's The Walking Dead, League of Legends, Assassin's Creed Series) as the voice of Duke Grabowski himself!<br/><br/>Amazing Art and Animation – Duke comes to life with 3D animation and interacts with beautifully realized 2D backgrounds.", "metacritic": null, "released": "2016-10-06", "tba": false, "updated": "2019-08-28T22:10:23", "background_image": "https://media.rawg.io/media/screenshots/c92/c920b4eefac652457bdfbef100b370a8.jpg", "website": "http://venturemoongames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 34, "beaten": 3}, "playtime": 2, "achievements_count": 12, "ratings_count": 2, "suggestions_count": 544, "game_series_count": 0, "reviews_count": 2, "platforms": ["macOS", "PC", "Linux"], "developers": ["Venture Moon Industries"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Alliance Digital Media"], "esrb_rating": null}