{"id": 174279, "slug": "laser-defender-petergambell", "name": "Laser Defender (petergambell)", "name_original": "Laser Defender (petergambell)", "description": "<p>Pilot your craft and blast the waves of enemies that stand against you!</p><p>Laser Defender is a Galaga/Space Invaders style shoot em' up, which pits your fighter against waves of enemy ships.</p><p>See if you can beat my high score of 14,600, lasting until Wave 32.</p><p>The game can be played in the browser (should work on all modern browsers) or as a Windows x86 application. To play the Windows version, simply download the LaserDefender_v1.2.zip file, extract the contents to a location, then run the LaserDefender_v1.2 executable.</p><p>The default resolution for the game is 1024x786 (4:3), but it is playable in any of the resolutions offered when starting the Windows version of the game.</p><p><strong>Credits:</strong></p><p>Laser Defender developed by Peter Gambell, licensed under Creative Commons Attribution-NonCommercial-ShareAlike 3.0 license<br/></p><p>Based on material in the Laser Defender section of the Complete Unity Developer course by Ben Tristem</p><p>Image sprites taken and adapted from the Space Shooter Redux pack by Kenney Vleugels, used under CC0 1.0 license<br/><br/>Music:<br/>Siste Viator by Clearside, used under CC BY-NC-SA 3.0 license<br/>Assimilator by Clearside, used under CC BY-NC-SA 3.0 license<br/>Coma by Clearside, used under CC BY-NC-SA 3.0 license<br/><br/>Sound Effects:<br/>Laser SFX compilations pack by cabled_mess, used under CC0 1.0 license<br/>Damage by Iwan Gabovitch, used under CC-BY 3.0 license<br/>unfa's Laser Weapon Sounds by Tobiasz 'unfa' Karoń, used under CC-BY 3.0 license<br/>Explosion longer by wubitog, used under CC0 1.0 license<br/>Small boom by ProjectsU012, used under CC-BY 3.0 license<br/>Powerup04.wav by jeremysykes, used under CC0 1.0 license<br/><br/>Fonts:<br/>Retro Computer by Petyka, free for non-commercial use<br/>Arcadepix Plus by Jimmy Campbell, free to use</p>", "metacritic": null, "released": "2016-08-22", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/fcc/fccceb10b626d3e95d63d13c44313315.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 59, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["petergambell"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}