{"id": 174318, "slug": "lets-make-a-game", "name": "Let's make a Game", "name_original": "Let's make a Game", "description": "<p>At the end of December 2016 I started playing around with multiplayer game development again. I just implement features without of any concept. Today I got a lot of features in my project and I think it would be waste to let it die on my harddisk with all those other unfinished projects I made in the last years. Last week I found itch.io and decided to release this project here with the background to form a Team and making a serious game project.</p><p> </p><p>I think here are a lot of nice people who are interested in game making. Those one who have awesome ideas and talents.</p><p> </p><p>Today the project includes the following features:</p><p> </p><p>Realistic vegetation</p><p> There are trees that populate them self by throwing seeds. New grown trees are genetic different to its parents. They can be cut down with a chainsaw and deliver wood pieces that the player can collect. This could be used for buildings or energy generation.</p><p><strong> <br/></strong></p><p><strong>(New) Login and account system<br/></strong></p><p>Since v0.2 there is a login and account management system. Players are now able to create a personal account with nickname and password.</p><p> </p><p>Pickup and Inventory system</p><p> I implemented some pickups and an inventory system. This is actually in a very early state, but the basics are done. The players inventory is on server side. Later I will implement the possibility of exchanging Items to other players and combing things to new things (crafting).</p><p> <br/> </p><p>Basic FPS-Shooter system</p><p> I have already a raycastgun with bullet holes, physical interaction on dynamic objects, some effects and sounds, ammo handling etc.</p><p> <br/> </p><p>Vehicle system  </p><p> There is one off-road car at this time that can be used players as driver or passenger. It is based on PhysX-Wheels and have some funny features like unique numberplates.</p><p> <br/> </p><p>What could be your role in this project?</p><p> I have never made a complete game, so I don't now ;)</p><p> I think we need some:</p><p> - 3D &amp; 2D artists</p><p> - Coders</p><p> - Level designer</p><p> - Concept maker</p><p> - Marketing guys</p><p> - Some one who takes care of the Community (Forum moderators, social media managers)</p><p> <br/> </p><p>What kind of game should it be?</p><p> I am open for all and everything. My favorite kinds of games are tagged with \"Open World\", \"Action\" and \"RPG\". Games where the player is able to do what he wants. I don't like fantasy games with magic and so on.</p><p> <br/> </p><p> What techniques are used?  </p><p> The project is made with Unity 3d and Photon Unity Networking (PUN). It is a server cloud based masterclient controlled concept.</p><p> <br/> </p><p>Will we earn money?</p><p> I think this is a target that every one want. But I think it is far away at the moment. It makes a lot of work to create a game for that some one is willing to pay. At this time there is no budget for paying you, but if we will earn something we will share it fair.</p><p>Are you interested?</p><p> Contact me: </p><p> via skype: Kerosini</p><p> via Email: tobias.rosini@hotmail.de</p><p> <br/> </p><p> </p>", "metacritic": null, "released": "2017-02-05", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/8cb/8cb45453c280e3007cdc8a2c72f8388a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 16, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Kerosini"], "genres": ["Shooter", "RPG"], "publishers": [], "esrb_rating": null}