{"id": 17448, "slug": "brick-inventions", "name": "Brick Inventions", "name_original": "Brick Inventions", "description": "Brick Inventions is a physics based building game. It combines simple blocks with realistic physics so that everything in the game can be completely destroyed. Build awesome structures, invent machines, master difficult challenges or play exciting multiplayer battles against your friends – Brick Inventions offers a variety of different game modes for all of that.SingleplayerPlay through 25 singleplayer levels, of which each one offers a different kind of physics based challenge. Besides the normal mode, many levels can also be played in a more difficult challenge mode in order to earn medals and to unlock achievements.MultiplayerFight against your friends or other players in the strategy oriented online multiplayer mode. Depending on the selected game type, each player has to gather resources, build warehouses to increase storage capacity and unlock blocks in the research center in order to build more powerful defenses and weapons. The multiplayer mode offers two different game types on two distinct maps.SandboxIn the sandbox mode, you have unlimited resources and can build whatever you want. As it is way more fun to create things together with other people, the game also contains an online multiplayer sandbox mode that allows you to play together with your friends.Inventor modeSince everything is created out of blocks, it might take long to build things that are more complex. The Inventor-mode enables you to create your own inventions, which can be saved and placed with just one click in any other mode. Invent a new machine, more efficient weapons or powerful defenses - the better your ideas, the better are your chances of winning a multiplayer game or mastering a challenge in a singleplayer game.", "metacritic": null, "released": "2016-03-23", "tba": false, "updated": "2019-08-28T22:10:22", "background_image": "https://media.rawg.io/media/screenshots/2e1/2e1f5b0319c80cdd2d1cd7d2794f6850.jpg", "website": "http://www.brickinventions.net/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3, "dropped": 1}, "playtime": 2, "achievements_count": 15, "ratings_count": 0, "suggestions_count": 211, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["BernhardM"], "genres": ["Simulation", "Indie"], "publishers": ["BernhardM"], "esrb_rating": null}