{"id": 174488, "slug": "paddle-league", "name": "Paddle League", "name_original": "Paddle League", "description": "Welcome to the court!\r\n<p>Paddle League is an ATARI pong-style game of tennis, but this time with competitive matchmaking. Rise up the ranks from Bronze I to Diamond to #1 in the world and compete in online competitions. Choose your bat's colour and the shape of your supporters. Challenge your friends to intense 1v1 competitions.</p>\r\nFeatures\r\n<ul>\n<li>The classic game of computer tennis with an online matchmaking and ranking system</li>\n<li>Month long seasons to test your mettle and try and permanently land first place</li>\n<li>Online leaderboards and end of season forum signatures: get your bragging rights!</li>\n<li>BOT matches that affect your rank!</li>\n</ul>\r\nState of development\r\n<p><strong><em>Test Season #1 is NOW LIVE!</em></strong>. Beyond that, there'll be a few more test seasons before the full game launches sometime this summer!</p>\r\nFAQ\r\nWhat's the monetisation to be like?\r\n<p>The game will be completely free to play during the test seasons and £1.99 at launch (with a two keys for £2.99 deal to get your friends involved!) There will be absolutely no loot boxes or microtransactions. You can earn skins in game, but these will not cost money and will be rewards or random drops from games.</p>\r\nBOT matches alter my rank? How will that work?\r\n<p>You can get all the way up to rank Diamond by playing against BOTs. This is to combat a presumed low player count but will be removed if enough players take part. <em>However,</em> the online leaderboards will be based on goal difference. BOT matches will <em>not</em> have an effect on goal difference, so if you've got all of the way to Diamond by playing against BOTs you'll be at a significant disadvantage. We'll see how this plays out and make changes as appropriate.</p>\r\nSpecifics on networking?\r\n<p>The game runs at 60 FPS on a toaster (resolution is only 320x180 for that proper retro feel) and games are at a tick rate of 16 (that is, 16 network frames a second). Thought has been put into preventing lag, with methods such as frame stopping to await user input implemented. Sometimes things mess up, however, and that's going to be the focus of the test seasons.</p>", "metacritic": null, "released": "2018-03-07", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/169/169c7a1e58553412d38896d4454cdb2c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 38, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Android"], "developers": ["Pebsie"], "genres": ["Sports"], "publishers": [], "esrb_rating": null}