{"id": 17456, "slug": "surfingers", "name": "Surfingers", "name_original": "Surfingers", "description": "Surfingers – The new game by the creators of the cult Timberman.<br/><br/><br/><br/>After a spectacular success of the Timberman game (over 30 million downloads worldwide) , Digital Melody Games' new arcade game is ready. It's all about surfing this time.<br/><br/>Surfingers is a arcade game with controls based on up-and-down movement. The player must change the height of the wave in a dizzying pace, bypassing many obstacles (ships, balloons, rocks, trees, bones, pyramids etc) and try to get as long as possible without touching anything.<br/><br/>The game offers surfing through various worlds, including: ocean, snow, desert or hell. There are over 20 characters available to choose from, which can eventually be unlocked for the achievements or gained stars.<br/><br/><br/><br/>\"The graphic design of the game was inspired by 1970s California, colorful posters and the Surf Rock music genre. In addition, we used a variety of colors to make the game more enjoyable\"<br/><br/>\"That was close, we would never have released Surfingers. You need to prepare many prototypes of the game to find the perfect gameplay. I remember that we have reached the milestone in that single moment we introduced the diagonal waves and changing worlds. Thanks to these changes the game got incredible playability.”<br/><br/><br/><br/>Game features:<br/><br/><br/><br/>Over 20 characters to unlock<br/>Surfing music and graphic<br/>Worlds full of dangers<br/>Innovative gameplay<br/>GABEN surfing at 100 bill! What could be more cool then that!!! Come on!!!<br/><br/>", "metacritic": null, "released": "2016-01-06", "tba": false, "updated": "2024-01-06T10:44:39", "background_image": "https://media.rawg.io/media/screenshots/c18/c1839c9150aa6e62abea8bbb2bfc0b00.jpg", "website": "http://digitalmelody.eu/games", "rating": 1.78, "rating_top": 1, "added_by_status": {"yet": 12, "owned": 500, "beaten": 4, "toplay": 1, "dropped": 9}, "playtime": 4, "achievements_count": 10, "ratings_count": 18, "suggestions_count": 106, "game_series_count": 0, "reviews_count": 18, "platforms": ["PC", "Linux", "Nintendo Switch", "macOS", "iOS"], "developers": ["Digital Melody", "DIGITAL MELODY GAMES KITAJEWSKI I STALEWSKI SPOLKA JAWNA"], "genres": ["Action", "Sports", "Arcade", "Casual", "Indie"], "publishers": ["Forever Entertainment", "DIGITAL MELODY GAMES KITAJEWSKI I STALEWSKI SPOLKA JAWNA"], "esrb_rating": "Everyone 10+"}