{"id": 174596, "slug": "extreme-car-drifting-driving-school", "name": "Extreme Car Drifting & Driving School", "name_original": "Extreme Car Drifting & Driving School", "description": "<p>Burn your real sports car on Asphalt Road!<br/>Take a control of amazing sports car to drive high performance cars (turbo or naturally aspirated) and make them drift at high speed in tracks designed specifically for drift racing.Download the best extreme car drifting &amp; driving game form google play store free! &amp; enjoy the hgh speed car racing &amp; driving with amazing sports cars on extreme asphalt tracks.<br/>Grip The Steering &amp; Put Your Foot On Accelrator!<br/>Extrene Car Drifting &amp; Driving School is one of the best car driving simulator game of 2018. Drive your extreme car on fastest speed and challenge your opponent for head to head racing and drift competition for earning more scores. Unlock sports cars with maximum city driving and road drift. Become the king of drift, press your foot on the accelerator and drift around in different cities to become a turbo drift in this extreme car drift game. You have top cars for the drift racing and extreme car drive around the asphalt racing tracks. In Extreme Car Drifting &amp; Driving School Be ready for this pull drive simulator. Push your car to its limits and take your place among the best.<br/>Features<br/>It is the latest and one of the best car drifting simulators!<br/>Choose your best car for driving between Sports cars, offroad cars, and speed cars.<br/>Customize them and change tire, wheel, smoke, colors, and more. <br/>Drift in a whole city with realistic and intense traffic, and try 5 tracks to pull off super long drifts.Drive through different scene like snow, desert and rainy with diferent weathers. <br/>Experience real drift in fast and agile sports cars in one of the car drifting simulators.<br/>Complete tons of missions to become a professional drifter and driver to become rich!<br/>Experience the most realistic car driving school game, speed past civilian vehicles and drift around city and asphalt racing tracks. Start the destruction with your partner for gaining maximum scores to unlock more sports cars. In fastest sports car driving games you may flip and wreck your car with real time vehicle damage, each collide or crash will make more realistic dents and scratch in this pull drive game. You have played many best car driving simulators now time to try this fully customized with unique vehicle selection, racing and speed drifting simulator. Start sky resort driving and sky resort parking simulator. This unique driving game will help you feel the charm of the winter season. Show your amazing drifting and car driving skills, perform awesome car stunts in one of the best free car driving simulators. Drift and drive fast because you don’t need to follow the city traffic rules and your score will reflect that in car drift &amp; driving games 2018.</p>", "metacritic": null, "released": "2018-04-24", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/49c/49c352ac4a9ee4df0ccad76f9c463868.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 106, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Royal Gaming World"], "genres": ["Racing"], "publishers": [], "esrb_rating": null}