{"id": 174673, "slug": "jewel-quest-saga", "name": "Jewel Quest Saga", "name_original": "Jewel Quest Saga", "description": "<p>We present the wonderful quest games of jewel match 3 games free! This is one of the classic match 3 game launched on Android!</p><p>This game is very much different from all the match 3 games because of its well designed puzzle and unique gem games. In this jewel quest achieve targets by making match 3 of all the gems and jewels.<br/>This is the game meant for puzzlers, who love mystery game though focus and determination is highly valued in this free jewel saga.<br/>In jewel quest saga match 3 jewels and overcome all the riddles like stone, gummy jelly , cage in given number of moves. Some levels are time puzzle which makes it one of the most addictive adventure games.</p><p>How to Play:<br/>• Match 3 or more similar gems in this jewel quest.<br/>• In time mode match as fast as you can to achieve the target.<br/>• Gummy jelly removes after 3 match.<br/>• Earn bonus by completing the level in lesser move.</p><p>In this free jewel quest it is sometimes frustrating but engaging. Gummy jelly are tough to remove so plan before any move.</p><p>Game features<br/>• A new kind of 3 match jewel quest for all puzzlers.<br/>• Try to collect stars in this jewel quest saga.<br/>• Jewel Quest game for brain exercise.<br/>• Varied game in each level.<br/>• Gummy jelly and stones will prove to be major riddle.</p><p>If you love playing matching game then download jewel quest saga for free and enjoy new kind of match 3 puzzle !</p>", "metacritic": null, "released": "2015-12-17", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/b26/b269bb955547c4ab77c1d4b039141b49.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 102, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["ViMAP Services"], "genres": [], "publishers": [], "esrb_rating": null}