{"id": 17463, "slug": "ultraworld-exodus", "name": "ULTRAWORLD EXODUS", "name_original": "ULTRAWORLD EXODUS", "description": "<strong>ULTRAWORLD EXODUS</strong>, a free addition to the wildly abstract first-person exploration adventure you've heard so much (or little) about. The sole work of James Beech, a former Crytek/Sony AAA game developer, ULTRAWORLD EXODUS is a visual novel/Art toy/who-knows-what.<br/><br/><strong>FEATURING</strong><br/><br/><strong>IMPERFECT</strong>: A highly revised redux of the original ULTRAWORLD story. Ponder Exoplanets and Artificial Intelligence while trying to assist a self-aware NPC in the midst of an existential crisis. Some people loved it. Some people hated it. Feel free to decide for yourself.<br/><br/><strong>EXODUS</strong>: A new continuation of the unusual sci-fi meta-narrative that could only be told in the medium of video games. A year has passed and ULTRAWORLD has changed. Your old pal is dismayed by your inaction, but this gives way to a new friend with an impossible plan. Embrace the hivemind!<br/><br/><strong>VACATION MODE</strong>: A greatly expanded free-roaming mode where you're the Artist. Change the colors, filters, particles, and rendering modes for infinite visual variety (and I do mean infinite). Then soar above the landscape, camera in hand, looking for the perfect picture. Every shot is a unique abstract painting, created by you, and fit to hang on your walls.<br/><br/><strong>THE SOUNDTRACK</strong>: There are now double the songs to the highly praised original soundtrack.<br/><br/><strong>VR SUPPORT</strong>: Vacation Mode can be setup to use VR devices (although you'll need a steel stomach. Not meant for humans)<br/><br/><strong>FREE</strong>: If you already own ULTRAWORLD, you'll get EXODUS automatically. It's my way of saying thanks to everyone who's supported my bizarre art experiment. And of course, anyone buying from here on out gets EXODUS as part of the package.<br/><br/>Now get out there and find your painting!", "metacritic": null, "released": "2014-12-04", "tba": false, "updated": "2019-08-28T22:10:22", "background_image": "https://media.rawg.io/media/screenshots/c1f/c1fe584a619afdf0103044d8aba4ff90.jpg", "website": "http://neon-serpent.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 151}, "playtime": 4, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 279, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Neon Serpent"], "genres": ["Indie"], "publishers": ["Neon Serpent"], "esrb_rating": null}