{"id": 17478, "slug": "destinys-princess-a-war-story-a-love-story", "name": "Destiny's Princess: A War Story, A Love Story", "name_original": "Destiny's Princess: A War Story, A Love Story", "description": "-------------------<br/>\r\nThe story of the game is the same as \"Destiny's Princess\" for the smartphone version.<br/>\r\n-------------------<br/>\n<br/>\r\n- What is \"Destiny's Princess\"? <br/>\r\nIt's a game for girls designed with a dramatic storyline with an emphasis on an intriguing plot.<br/>\r\nYou can fall in love with the well-known heroes of the Warring States Period!<br/>\n<br/>\r\n- Story <br/>\r\nThe Warring States period in the world just a little different from this world. <br/>\r\nYou're the one, princess of a certain country. <br/>\r\nIn response to the favor from the environment, it has been spent on easy street. <br/>\n<br/>\r\nBut now, in response to the invasion of demons variant, <br/>\r\nCastle lady is forced to the brink Rakujo. <br/>\n<br/>\r\n- Were risking their lives, it is ending of love -<br/>\n<br/>\r\n- The Guys<br/>\r\nSanada Yukimura<br/>\r\nA valiant Warring States commander with the fearlessness to run after and fight off enemies on his own.<br/>\r\nHe is summoned as the main character's \"twin brother.\"<br/>\n<br/>\r\nTakenaka Hanbei<br/>\r\nA brilliant tactician who is cool-headed and composed and can sometimes seem cruel.<br/>\r\nHe is summoned as the main character's \"fiance.\"<br/>\n<br/>\r\nDate Masamune<br/>\r\nA mighty warrior who excels in physical strength, martial arts, and horseback riding. In particular, he possesses unrivaled command of the bow and arrow.<br/>\r\nHe is summoned as the most skilled and revered \"commander\" of the main character's country.<br/>\n<br/>\r\nFuma Kotaro<br/>\r\nA ninja who moves like a shadow and possesses nearly inhuman techniques.<br/>\r\nHe is summoned as the \"ninja reinforcement\" who has come to the main character's castle.<br/>\n<br/>\r\nOda Nobunaga<br/>\r\nAn extraordinary man and providential hero of the Warring States Period, also feared as the Demon of the Sixth Heaven.<br/>\r\nHe is summoned as the main character's \"father.\"<br/>\n<br/>\r\n- You should play Destiny's Princess if...<br/>\r\n...you want to fall in love with a handsome guy.<br/>\r\n...you like romance novels, romance manga, and romantic TV dramas.<br/>\r\n...you like romance games.<br/>\r\n...you like the Warring States Period of Japanese history.<br/>\r\n...you enjoy a storyline with a lot of depth.<br/>\n<br/>\r\n-------------------<br/>\r\nPlanning, character design and illustrations : Metawo Ueda (上田メタヲ)<br/>\r\nScenario : Matsuri Kusaka (草香祭)<br/>\r\nMusic : Nobuko Miyauchi (宮内 信子)", "metacritic": null, "released": "2016-04-05", "tba": false, "updated": "2019-08-28T22:10:21", "background_image": "https://media.rawg.io/media/screenshots/1db/1db0308d57d51fbb5d2b993b0f9d2568.jpg", "website": "http://dogenzaka-lab.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 12, "beaten": 3, "toplay": 1}, "playtime": 6, "achievements_count": 13, "ratings_count": 3, "suggestions_count": 488, "game_series_count": 0, "reviews_count": 3, "platforms": ["Nintendo Switch", "PC"], "developers": ["Dogenzaka Lab"], "genres": ["Adventure"], "publishers": ["D-Pad Studio", "Dogenzaka Lab"], "esrb_rating": "Teen"}