{"id": 17487, "slug": "quest-of-souls", "name": "Quest of Souls", "name_original": "Quest of Souls", "description": "Quest of Souls is a fantasy, twin-stick, shoot 'em up, RPG adventure with skill upgrade customization, multiple endings, pixel graphics, a story-rich experience, and a dragonslaying corgi!<br/><br/>Quest of Souls is inspired by nostalgic 90's SNES games like Pocky &amp; Rocky, Zombies Ate My Neighbors, Super Smash TV, Secret of Mana, Chrono Trigger, FF3, Gauntlet, and the Legend of Zelda series. If you like those games, we are making Quest of Souls for you!<br/><br/>We are planning for three player co-op, three levels of difficulty (Casual, Normal, and Insano), 7 full levels in game, and secret unlockable story twists and characters!<br/><br/>The core of combat is an action packed twin-stick shooter. You dodge enemy projectiles while using each of the character's four abilities to get to the end of the level. As the game progresses you make decisions in the story that lead you down different paths. Each of those paths have their own encounters, enemies, and unlockable skill upgrade books used to enhance and customize each character's abilities. <br/><br/><br/><br/>The storyline revolves around three main characters: Brunhilde the Good Lich, Toki the Dragonslayer, and Yoshimbo the Sworn Protector, and their quest to track down a powerful magical artifact of great value that was stolen by a mysterious dark sorcerer.<br/><br/>Their trek takes them across a wondrous fantasy landscape boasting vastly different environments to explore and decisions that change not just the story, but the actual levels themselves!<br/><br/><br/><br/>Wait, you said a lich, a dragonslayer, and a Yoshimbo?!<br/><br/>Yep. So, Brunhilde is a lich who uses her powers for good, Toki was once a noble fairy dragoon's battle mount, and Yoshimbo is a ronin on a personal redemption quest wandering the countryside. Here they are!<br/> <br/><br/><br/><br/>King Crow Studios is part of a video game incubator at the Louisiana Technology Park in Baton Rouge, Louisiana. In collaboration with other video game companies like Pixel Dash Studios, BitFinity Games, Starblade Games, and Jetstreame Games, we hope to work with the community to make games that we all can enjoy and provide entry-level experience for local game developers.<br/><br/>The talent that goes into this game comes from all across Louisiana. We hope to show off how vibrant the gaming community is here by having almost every other existing indie company contribute in some way to the game. Every one of us have been chosen to be a part of this game because we all think this is an awesome idea and want to see it succeed. We will do our best to show you our progress so we can prove how hard we are working and how seriously we all want this to be amazing.<br/><br/>This is our first game. We want to listen to all of you, and create several games throughout the years for you to enjoy. <br/><br/><br/><br/>Follow us on Facebook, Twitter, and Instagram!<br/>https://www.facebook.com/KingCrowStudios/<br/>https://twitter.com/KingCrowStudios<br/>https://www.instagram.com/kingcrowstudio/", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T22:10:21", "background_image": "https://media.rawg.io/media/screenshots/c33/c33bc29c051a1ca01ff1bec295b30249.jpg", "website": "http://www.kingcrowstudios.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 168, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["King Crow Studios"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["King Crow Studios"], "esrb_rating": null}