{"id": 17496, "slug": "alices-patchworks-2", "name": "Alice's Patchworks 2", "name_original": "Alice's Patchworks 2", "description": "Who would have thought that an old family mirror from London would open a portal to an incredible chess kingdom? Set off on an exciting adventure through the looking glass alongside famous characters from Lewis Carroll’s world-renowned fairytale. Assemble patchwork mosaics and help Alice become the queen of the world beyond the looking glass!<br/>\n<br/>\r\nAlice’s Patchwork 2 is a game of mosaic puzzles made of 6 different materials: wood, cloth, glass, paper, precious stones and metal. Assemble patchwork puzzles and guess the picture: a garden with talking flowers, a crazy tea party, cards come to life, the riddles of Humpty Dumpty, a duel between the Lion and the Unicorn, the intrigues of the Red Queen, a meeting with the White Rabbit… What other wonders await you in these 6 worlds? Put together all the mosaics and help Alice transform from a pawn into a queen!<br/>\n<br/>\r\nTravel through a fairytale land in the company of your favorite heroes in Alice’s Patchwork 2!<br/>\n<br/>\r\n- 120 unique puzzles patchwork mosaics<br/>\r\n- 6 locations and 6 different materials<br/>\r\n- A plot familiar from childhood.<br/>\r\n- Special quests and 18 trophies for the real pros<br/>\r\n- More than 10 hours of gameplay with beautiful calming and cheerful music<br/>\r\n- Entertaining gameplay for players of all ages<br/>\r\n- Use bonuses and earn new ranks", "metacritic": null, "released": "2016-10-07", "tba": false, "updated": "2023-12-18T17:41:17", "background_image": "https://media.rawg.io/media/screenshots/32e/32e7be61980edae0b58e3d45a1d0c9ce.jpg", "website": "https://www.facebook.com/8FloorGames", "rating": 2.6, "rating_top": 4, "added_by_status": {"yet": 3, "owned": 220, "beaten": 1, "playing": 1}, "playtime": 4, "achievements_count": 18, "ratings_count": 10, "suggestions_count": 355, "game_series_count": 0, "reviews_count": 10, "platforms": ["PC"], "developers": ["Creobit"], "genres": ["Casual", "Indie"], "publishers": [], "esrb_rating": null}