{"id": 17497, "slug": "epic-clicker-journey", "name": "Epic Clicker Journey", "name_original": "Epic Clicker Journey", "description": "<strong>Experience your epic journey. Discover 20 mysterious lands and face the monsters living out there. Gather items and go through training that will allow you to develop your character and increase effectiveness in battle. Force defeated monsters to help you during the mission. Meet the bravest warriors and together conquer the most dangerous lands. Show that you are persistent traveler and held your adventure, even in the toughest conditions.</strong><br/><br/><br/><strong>Mysterious lands</strong><br/>20 lands are ready to be discovered, each of them has its own unique rules. Expect inexplicable phenomena on a daily basis.  It is not everything! Specific environment, weather conditions and exceptionally mild pH of the soil is truly made to promote evil -  that is why traversing across the lands is so dangerous. Be careful, scary monsters are to be found at every step. But…what cannot be done to save the world! <br/><br/><strong>Horrifying Monsters</strong><br/>In each of the lands you will encounter powerful opponents. Do not hesitate to use all available means. Fight bravely to get the treasure that is closely guarded by enemies.<br/><br/><strong>Marvelous Equipment</strong><br/>Become the gallant warrior. Collect gold and buy awesome upgrades to your weapons, armor or shield and build your frightening appearance among your enemies.<br/><br/><strong>Epic Loot</strong><br/>Do not miss out on the chance to find legendary items and use it against your enemies. Some of them are magical, others more mundane, but surely all worth checking out.<br/><br/><strong>Multiplayer</strong><br/>Countless legends came to exist in fog-shrouded lands.  They have origin in the bloodiest and most terrifying monsters. Before embarking on your journey, be sure to gather your team.  Remember, united we stand, divided we fall!", "metacritic": null, "released": "2016-04-21", "tba": false, "updated": "2024-01-22T16:13:35", "background_image": "https://media.rawg.io/media/screenshots/a19/a19fdbeedd6efe5f107eb619dd157ddc.jpg", "website": "http://playway.com", "rating": 2.14, "rating_top": 1, "added_by_status": {"yet": 6, "owned": 337, "toplay": 1, "dropped": 12, "playing": 1}, "playtime": 1, "achievements_count": 40, "ratings_count": 14, "suggestions_count": 461, "game_series_count": 0, "reviews_count": 14, "platforms": ["Nintendo Switch", "Linux", "PC", "iOS", "macOS"], "developers": ["PlayWay", "Cleversan Software"], "genres": ["Adventure", "Arcade", "Casual", "Indie"], "publishers": ["Ultimate Games", "PLAYWAY SPOLKA AKCYJNA", "Cleversan Software"], "esrb_rating": null}