{"id": 17506, "slug": "daughter-of-shadows-an-scp-breach-event", "name": "Daughter of Shadows: An SCP Breach Event", "name_original": "Daughter of Shadows: An SCP Breach Event", "description": "The player assumes the role of a dangerous and powerful girl known as SCP-029. After a facility wide power outage occurs, numerous SCPs breach containment and proceed to wreak havoc throughout the facility. SCP-029 must use her mind-controlling powers to survive and find a way to escape from the facility.<br/>\n<br/>\r\nWe wanted to incorporate some of the SCP favorites like SCP-173 and SCP-106. To that end we opted to set \"Daughter of Shadows\" in the same facility as \"SCP: Containment Breach.\" Beyond the physical location of the facility and a few SCPs, \"Daughter of Shadows\" is designed to be an entirely new experience. Most of the emphasis is on the introduction and discovery of new SCPs.<br/>\n<br/>\n<br/>\r\nSurvive and escape the randomly generated and labyrinthine SCP facility<br/>\n<br/>\r\nExperience the power of a mind-controlling Keter class SCP and force men to do your bidding<br/>\n<br/>\r\nRevisit some old “friends” like SCP-173 and SCP-106, and make some new ones<br/>\n<br/>\r\nExperience more of the SCP universe with a total of 25 unique SCPs<br/>\n<br/>\r\nUnlimited replayability with different SCPs and layouts in each playthrough<br/>\n<br/>\r\nUnlock 48 different achievements of varying difficulty<br/>\n<br/>\r\nAdditional SCPs and features may be made available via DLC", "metacritic": null, "released": "2016-04-04", "tba": false, "updated": "2019-08-28T22:10:20", "background_image": "https://media.rawg.io/media/screenshots/c21/c21ddd9cb4d537b8528aa5ee95c7c782.jpg", "website": "http://blackroseindustries.com/DaughterOfShadows/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 32, "dropped": 1}, "playtime": 6, "achievements_count": 61, "ratings_count": 2, "suggestions_count": 85, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC"], "developers": ["Blackrose Industries"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["Blackrose Industries"], "esrb_rating": null}