{"id": 17519, "slug": "citadels", "name": "Citadels", "name_original": "Citadels", "description": "<strong>The Legend Of King Arthur Reborn!</strong><br/><br/>A vast army has gathered in front of the castle gates and is preparing to attack King Arthur! How has it come to this? <br/>Witness important events in the history of the legendary king and accompany him and his army on the path to an uncertain future. It is up to you to restore the honor, the glory and the reign of the Arthurian line, and rewrite the course of history! <br/>Good or evil? The decision is entirely yours! Two extensive campaigns give you insight into both sides of the war.Key Features<ul><li> Construct impregnable fortresses, equip them with units, ditches and palisades and crush the hordes of enemies with your defense structures! <br/></li><li> A fortress alone does not mean victory! Build a dependable infrastructure and manage your resources. <br/></li><li> Your strategy will decide between victory and defeat! Only with the right combination of defense structures, units, extraction of raw materials, and production, will you emerge victorious from the sieges. <br/></li><li> Experience epic battles with realistic destruction! Assemble your army from a multitude of different units. But beware of falling rubble and take geographical conditions into account in your battle plan. <br/></li><li> Unlock legendary characters! Complete specific tasks and gain the support of famous heroes, granting you strategic advantages in battle.</li></ul>", "metacritic": 20, "released": "2013-06-07", "tba": false, "updated": "2019-08-28T22:10:20", "background_image": "https://media.rawg.io/media/screenshots/2af/2af050b01772086a829efe76aee0555d.jpg", "website": "http://www.citadels-game.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 43, "toplay": 1, "dropped": 1}, "playtime": 2, "achievements_count": 26, "ratings_count": 2, "suggestions_count": 460, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Games Distillery"], "genres": ["Action", "Strategy"], "publishers": ["THQ Nordic", "HandyGames"], "esrb_rating": null}