{"id": 175136, "slug": "ultimate-car-driving-supercar-i8-drift", "name": "Ultimate Car Driving: Supercar i8 Drift", "name_original": "Ultimate Car Driving: Supercar i8 Drift", "description": "<p>Supercar i8 driver simulator is pure drift rampage and city supercar driving simulation game. Become a furious drifter and burn your i8 car tyres on grand city roads in Ultimate Car Driving: Supercar i8 Drift simulation game. Drive, drift and race around the big New York City with rival super car drivers and win the racing championship with your i8 hybrid sports driving car. Drift your sports steering car model i8 hybrid sports into the hot blazing roads of NY City and show your exciting drifting skills in the multiple locations. Discover the fast track drifting world with new driving simulator and enjoy the highway stunts and racing with an expensive i8 sports car. Explore many driving and racing modes with sports car train stunts, i8 hybrid sports car airplane jumping and offroad i8 racing with the twist of offroad uphill sports car race. Discover the driving and drifting world with the best Drift Simulator which is i8 hybrid supercar. Enjoy the special i8 stunts mode with train vs i8 car with ultimate i8 sports car driving and i8 train jumping.</p>\n<p>Enjoy speed race track with city highway racing of i8 Sports car hybrid car city racing, desert rally car racing, highway stunt car racer, and offroad dangerous hill racing, offroad checkpoint race and offroad uphill drift driving with i8 sport car with hybrid sports car offroad racing. In supercar i8 stunt mode you have multiple sports car stunts options like i8 airplane stunts and i8 hybrid sports car train stunts. Start your powerful i8 drift racing car engine and jump over the airplane with tricky i8 car train stunts then you have i8 city driving and i8 offroad racing missions. Tricky train jumping stunts will blow your mind. Race with train in train vs car racing game and perform ultimate supercar i8 train stunts. Have experience of latest sports i8 car parking.</p>\n<p>Features of Ultimate Car Driving: Supercar i8 Drift:</p>\n<p>★ Multiple game modes, city drifting, offroad i8 car racing, train vs i8 car stunts &amp; tricky i8 car airplane stunts.<br/>★ Extreme racing competition with ultra-fast super cars.<br/>★ Beautiful graphics, easy &amp; ultimate driving experience.<br/>★ Free driving mode for ultimate New York City i8 driving experience.<br/>★ Amazing i8 drift physics with hurdles, surprise crashes &amp; obstacles.<br/>★ Smooth controls &amp; latest car navigation map.<br/>★ Use nitro booster for ultimate turbo speed driving.</p>\n<p>Real motor sounds of i8 Hybrid Sports car in this drift racing simulator will give you the feeling of an actual racing drive of super sports car with easy and extreme driving experience. Drift simulation uphill offroad i8 car racing gameplay mode allows you to test your crazy drifting and i8 sports car racing skills on various offroad tracks. Crazy jumping over train and airplane with powerful sport vehicle in i8 car driving 3d simulator. More amusement with i8 car parking feature to test your parking skills in this i8 parking game. Download Ultimate Car Driving: Supercar i8 Drift and have a ride of branded sports car offroad and city racing fun.</p>", "metacritic": null, "released": "2018-06-01", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/25a/25a3179f3c2946d6f637b77ef500ebd9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 97, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Tap2Ride"], "genres": ["Simulation", "Racing"], "publishers": [], "esrb_rating": null}