{"id": 17522, "slug": "miasmata", "name": "Miasmata", "name_original": "Miasmata", "description": "<p>Miasmata is a first-person survival/adventure game, developed from the ground-up by brothers Joe and Bob Johnson. You play as Robert Hughes, a plague-stricken scientist on a journey to discover a cure. Your adventure begins on the shores of a remote and mysterious island. Long ago, the island was inhabited by a group of indigenous people, whose extant monuments still decorate the island landscape. The island is now home to a scientific research outpost and it is your hope to reunite with your colleagues working there. Unfortunately, you'll soon discover that something has gone terribly wrong.\n</p>\n<p>During your adventure, you will encounter a mysterious and deadly creature. This creature can stalk you for miles, lurking behind grasses and vegetative cover. By treading carefully and with stealth, you may be able to elude the creature. If you are careless, however, you will be forced to confront the creature head-on.\n</p>\n\nKey Features\n\n<ul>\n<li><strong>Experience:</strong> An engine built from the ground up, featuring voxel-based volumetric clouds, advanced water reflection and refraction, volumetric light-shafts and atmospheric scattering simulations.\n<li><strong>Explore:</strong> A lush and incredibly detailed natural world. The island landscape is covered by forests with lush canopies. The terrain surfaces are blanketed by tufts of moss and grass. The forest floors have thick undergrowth and are littered with fallen leaves, rotting logs, stumps and sticks.\n<li><strong>Discover:</strong> Dozens of camps, outposts and ruins. Find maps, notes and clues that lead you on your adventure.\n<li><strong>Survive:</strong> A deadly world. Discover plants and fungi and synthesize them into life-saving medicines. Find water and shelter to stave off fever, dehydration and exhaustion. Use stealth and cunning to escape the deadly creature.\n<li><strong>Create:</strong> A map of the island using an innovative cartography mechanic. Use a true-to-life triangulation system to pinpoint your location on the island and construct a map of the its boundaries, contours and landmarks.\n</li></li></li></li></li></ul>", "metacritic": 76, "released": "2012-11-27", "tba": false, "updated": "2023-05-04T05:28:36", "background_image": "https://media.rawg.io/media/screenshots/ab0/ab0c46933e3306d45b6ad7cee1c1c953_Tf9EAlf.jpg", "website": "http://ionfx.com/product_pc_Miasmata.php", "rating": 2.88, "rating_top": 3, "added_by_status": {"yet": 41, "owned": 525, "beaten": 5, "toplay": 2, "dropped": 15, "playing": 2}, "playtime": 1, "achievements_count": 27, "ratings_count": 25, "suggestions_count": 426, "game_series_count": 0, "reviews_count": 25, "platforms": ["PC"], "developers": ["IonFX Studios"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["IonFX Studios"], "esrb_rating": null}