{"id": 1752, "slug": "blood-bowl", "name": "Blood Bowl", "name_original": "Blood Bowl", "description": "<p>Blood Bowl is the adaptation of the famous Warhammer Fantasy football board game created by Games Workshop.<br />\nAssemble your team from among 9 fantastic races<em> in the Warhammer universe (Humans, Orcs, Dwarfs, Skaven, Wood Elves, Chaos, Lizardmen, Dark Elves and Undead). Each race has its own strengths, weaknesses and numerous opportunities to develop which will lend an immense tactical depth to the game.<br />\nImmerse yourself in single games in Solo Player mode to enjoy fun matches that won’t make your head hurt, or set off to conquer the Blood Bowl in the extensive Campaign mode. Develop your team and players by gaining victories and experience as you progress in the game.<br />\nIn Multiplayer you can compete against a friend on your tablet in “Hotseat” mode, or launch yourself into the vast online world in a massive permanent league where you can create and develop your teams. Play against Blood Bowl players from all over the world thanks to our cross-platform multiplayer modes!<br />\n</em>The base game enables you to play Humans and Orcs: the other races are available from the in-game store.</p>", "metacritic": 65, "released": "2009-06-25", "tba": false, "updated": "2023-10-19T07:15:24", "background_image": "https://media.rawg.io/media/screenshots/fc3/fc32414dbb677084fb6951bec01df1ec.jpg", "website": "http://www.bloodbowl-game.com", "rating": 2.69, "rating_top": 3, "added_by_status": {"yet": 4, "owned": 32, "beaten": 5, "toplay": 4, "dropped": 9}, "playtime": 25, "achievements_count": 31, "ratings_count": 13, "suggestions_count": 405, "game_series_count": 4, "reviews_count": 13, "platforms": ["iOS", "Nintendo DS", "Xbox 360", "PSP", "Android", "PC"], "developers": ["Focus Home Interactive", "Cyanide Studio"], "genres": ["Strategy", "Sports", "Board Games"], "publishers": ["Focus Home Interactive", "Southpeak Interactive"], "esrb_rating": "Teen"}