{"id": 17523, "slug": "phantasmal-survival-horror-roguelike", "name": "Phantasmal: Survival Horror Roguelike", "name_original": "Phantasmal: Survival Horror Roguelike", "description": "<strong>Experience Terror that is Never the Same Twice</strong> with Phantasmal: City of Darkness, a <strong>procedurally generated survival horror</strong> where every playthrough is completely different. You simply cannot rely on your previous experience to guarantee safe passage.  <br/><br/>You will need to face off against lurking, otherworldly horrors in the perilous, run-down <strong>Kowloon Walled City</strong> before its destruction in the early 90s.<br/><br/>You are fragile. Not just physically, but mentally as well. The grotesque creatures will challenge your very sanity and losing your mind can be a fate worse than death!  <br/><br/>The odds are stacked steeply against you, but you can prevail through sheer cunning. You must scavenge for resources carefully, sneak past and distract your enemies. If you are caught, you can fight back, but don’t expect to live for very long. <br/><br/>The environment has been carefully crafted by none other than <strong>Brian Bell</strong>, critically acclaimed lighting lead of several Hollywood movies, including <strong>Riddick, Life of Pi, Ring 2</strong>.<br/><br/><strong>Key Features:</strong><br/><ul><li><strong>Fear the unknown:</strong> Every ramshackle, disgusting room and corridor is uniquely generated - battle your anxiety as you’ll never know what comes next!<br/><br/></li><li><strong>Don't Go Insane:</strong> Facing terrifying creatures and skulking in the suffocating darkness will erode your sanity until you can no longer tell the difference between reality and illusion!<br/><br/></li><li><strong>Tread Softly:</strong> Every fight you have could be your last. Sneak past and distract your enemies as much as possible.<br/><br/></li><li><strong>Light, Both an Ally and Enemy:</strong> Every asset to survivability has a price. Use light sources wisely - you’ll need them to restore your sanity, but you’ll risk being seen!</li></ul><br/><ul><li><strong>Scavenge to Survive:</strong> Scrounge the environment for anything you can use: from firecrackers and flares through to wooden boards and metal pipes. Guns are rare, but if you find one remember that every bit of noise you make will attract more creatures, and eventually much, much worse!<br/><br/></li><li><strong>Permadeath:</strong> This is a high stakes game - once you die, the game is over!  However you retain any money you've earned to upgrade your stats or buy critical items to help you survive longer next time!</li></ul>", "metacritic": null, "released": "2016-04-14", "tba": false, "updated": "2023-03-11T12:49:32", "background_image": "https://media.rawg.io/media/screenshots/260/26047c8f20438820e544a6a79f7a1631.jpg", "website": "http://www.phantasmal.co.nz", "rating": 0.0, "rating_top": 3, "added_by_status": {"yet": 3, "owned": 219, "beaten": 1, "dropped": 2}, "playtime": 1, "achievements_count": 55, "ratings_count": 5, "suggestions_count": 441, "game_series_count": 0, "reviews_count": 5, "platforms": ["PC"], "developers": ["Eyemobi"], "genres": ["Indie"], "publishers": ["Eyemobi"], "esrb_rating": "Teen"}