{"id": 17539, "slug": "data-hacker-reboot", "name": "Data Hacker: Reboot", "name_original": "Data Hacker: Reboot", "description": "Time, Space and Parallel universes collapse and merge, tethered to threads of reality and sustained by a paradoxical power source.<br/>Nothing is impossible - it is time to become a Data Hacker. <br/><br/>The stage is set for a struggle that spans many Worlds and their people; a struggle that is bigger than any man, woman or child. Who knows what trials you will face, what adversity you will defy in your quest for the true meaning of existence?<br/><br/>Data Hacker: Reboot is a Japanese-styled role-playing game that will make you question the very definition and value of life, reality, love and loss. We will laugh. We will cry. We <strong>will be</strong> gratified.<br/><br/>Are <strong>you</strong> ready to take up this quest, and become a Data Hacker?<br/> <br/><strong>Core Features:</strong><br/><ul><li>Beautifully crafted environments - explore a variety of unique World Fractures on your travels, from Fantasy and Sci-fi to Nightmarish and Surreal!<br/><br/><br/><br/></li><li><strong>Awesome Combat Scenes</strong> - Action-packed, classic turn-based battle system complete with voice acting! \"Argh! Huh! Take this!\"<br/><br/><br/><br/></li><li><strong>Totally Epic Sounds</strong> - An incredible soundtrack composed by Scott Holmes adds an ocean of depth to environments, battles and cutscenes<br/><br/></li><li><strong>Hacking, hacking hacking!</strong> - Break down restrictions. Smash through barriers. Manipulate monsters and achieve your goals. Each character has unique hack-style abilities!<br/><br/></li><li><strong>Class-Hybrid System</strong> - A dynamic class-hybrid system allows you to create your dream team, with over 58 classes to mix-and-match. Train each character as you see fit, retaining <strong>all</strong> learned skills!<br/><br/><br/><br/></li><li><strong>Engaging Storytelling</strong> - Take control of Thanier as he searches for his recently lost twin sister, recruiting a rag-tag bunch of characters to aid him in his quest.<br/><br/><br/><br/></li><li><strong>Rich Backstories</strong> - An intricate tapestry of backstories, motivations and goals create the backbone for each character design in the game.<br/><br/></li><li><strong>Unseen forces</strong> - Many powers, both dark and light, exist out there in the Shattered Worlds. Can there be peace, or at least a balance in this survival-focused reality?<br/><br/><br/><br/></li><li><strong>This is not the End</strong> - The Multiverse is abundant with practically limitless possibilities - download all DLC packs for free as they become available!<br/><br/><strong>What do the press think of the game? </strong>Let's see...<br/><br/><br/><br/>First, there was an Initiation~<br/>http://store.steampowered.com/app/311860<br/>Followed by a spread of Corruption#<br/>http://store.steampowered.com/app/329000/</li></ul>", "metacritic": null, "released": "2015-04-17", "tba": false, "updated": "2023-07-29T14:57:51", "background_image": "https://media.rawg.io/media/screenshots/eae/eaee57cee121bca50465cb6e09190ec3.jpg", "website": "http://www.newrealitygames.co.uk", "rating": 1.67, "rating_top": 1, "added_by_status": {"yet": 21, "owned": 656, "toplay": 2, "dropped": 6}, "playtime": 4, "achievements_count": 40, "ratings_count": 21, "suggestions_count": 272, "game_series_count": 0, "reviews_count": 21, "platforms": ["PC"], "developers": ["New Reality Games"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["New Reality Games"], "esrb_rating": null}