{"id": 17531, "slug": "kingdoms-ccg", "name": "Kingdoms CCG", "name_original": "Kingdoms CCG", "description": "Choose your Kingdom, collect your spells, herald your forces and prepare your weapons. The war for Euna awaits!<br/><br/>Kingdoms CCG is a unique digital trading card game where you take the role of a hero for one of the six great kingdoms of Euna. Each Hero and Kingdom has a distinct play style creating a vibrant metagame. Decks consist of spells, creatures, gear and powerful Rune Words that shape the battlefield. Combat takes place through a strategic three-lane system with lane changing and defending available at all times. Battles are tight, tense and highly rewarding.<br/><br/>Kingdoms CCG has been designed to be fast to play, yet highly strategic. Play against other players in PVP arenas or live Tournaments, or the challenging AI in the single-player campaign and Guild Wars. Win prizes monthly on the Arena Ladder or battle through the ranks to reach the Epic Guild League. Glory is yours for the taking!<br/><br/>Easy to Learn. Always a Challenge. Join the battle today!<br/><br/><br/>Features include:<br/><br/><ul><li><strong>27 unique Heroes</strong> - each with 3 special abilities that charge over time and can be used to turn the tide of battle<br/></li><li><strong>6 Kingdoms - each with strengths, weaknesses and unique abilities - your Kingdom matters!<br/></strong></li><li><strong>Over 900 cards</strong> - an amazing breadth of cards that allow for all types of decks - aggro, control and combo<br/></li><li><strong>Non-Linear Mana Progression</strong> - Gain 2 mana per turn, and turn cards into more. You control your fate!<br/></li><li><strong>Robust Guild System</strong> - Raise through the ranks to the challenge the Epic League, while gaining Honor to acquire special cards<br/></li><li><strong>Live PVP Arena Ladders</strong> - Prove your are the best and win free packs and promo cards! A new ladder every month.<br/></li><li><strong>Challenging Single Player Training Grounds</strong> - Unlock heroes, win cards, gems and coins - all free!<br/></li><li><strong>Crafting</strong> - Turn extra cards into essence to craft new cards - even Epics!</li></ul><br/><strong>FREE TO PLAY</strong><br/><br/>Join for free. Play for free. Pay if you choose.<br/><br/>As a Collectable Card Game this game includes randomized Booster Packs that expand your collection and deck building options. Of the 4 currently available sets, 3 can be purchased with Gold (in-game currency) and 1 require Gems (premium currency).<br/><br/>Gems can be acquired for free by completing daily Arena challenges, completing Hero achievements, completing the campaign and through high-level Guild play.<br/><br/>Special booster packs with cards from all sets can also be won through Tournaments.<br/><br/>Finally, all available heroes can be purchased with Gold.<br/><br/><strong>Complete the Advanced Tutorials found on the Campaign screen and receive 7 FREE Core Booster Packs!</strong>", "metacritic": null, "released": "2015-01-22", "tba": false, "updated": "2019-10-22T14:26:38", "background_image": "https://media.rawg.io/media/screenshots/602/602de58ef2f6d5a31243587760931e80.jpg", "website": "http://kingdomsccg.com", "rating": 1.67, "rating_top": 1, "added_by_status": {"yet": 3, "owned": 267}, "playtime": 1, "achievements_count": 36, "ratings_count": 6, "suggestions_count": 363, "game_series_count": 0, "reviews_count": 6, "platforms": ["iOS", "PC"], "developers": ["Ganz", "Ganz Studio"], "genres": ["Strategy", "Card"], "publishers": ["Ganz"], "esrb_rating": "Teen"}