{"id": 175348, "slug": "flaming-ninja-vr", "name": "Flaming Ninja VR", "name_original": "Flaming Ninja VR", "description": "Available on Oculus Rift and HTC Vive.\r\n\r\nDescription:\r\n<p>Flaming Ninja VR is a hack-and-slash, first-person shooter virtual reality game. You have been transported into a futuristic Feudal Japan. You have lost all your memory, including how you arrived at this new world, your identity, and your purpose to live. More severely, this world is inhabited by evil, humanoid creatures that will attack you on sight. However, these creatures have one weakness: Fire. Conveniently, you discover that you have acquired the ability to harness fire energy from his environment into bladed weapons that you can either throw from your hands or shoot from your high-tech wrist guns. Lost in this dangerous world, you assume the role of a ninja with one mission: to survive by scouring the land for money and slaying the evil creatures around you by extracting fire from your surroundings. The more creatures you defeat and loot you collect, the more you discover a sense of honor as a ninja, just within your reach. The question is, will you claim it?</p>\r\nFeatures:\r\n<ul><li>Four missions and one boss mission</li><li>The ability to throw shurikens with hands or shoot shurikens from guns</li><li>Sword fighting</li></ul>\r\nControls:\r\n<ul><li>Press Right Joystick (Oculus) or Touchpad (Vive) until it clicks to toggle between gun mode and throw mode.</li><li>In gun mode, press trigger buttons to fire shurikens in three-round bursts.</li><li>In throw mode, hold down trigger to prepare a shuriken, and release the trigger while swinging your arms to release throw three shurikens at once.</li><li>Hold Left Joystick (Oculus) or Touchpad (Vive) until it clicks to activate dash-mode, and aim to the location you want to dash to. Release the joystick/touchpad to dash to the location.</li><li>Hold down grip buttons to interact with objects (including the katana at your waist). Release the grip buttons to let go of the object.</li></ul>\r\nAny feedback and donations would be greatly appreciated! This is the first VR game I have made entirely on my own, and I would like to implement any feedback before I submit to the Steam Store!", "metacritic": null, "released": "2017-08-10", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/66d/66df405ab3942da6552ab9f9290dbbf5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 66, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Dorfdude8"], "genres": ["Action"], "publishers": [], "esrb_rating": null}