{"id": 17536, "slug": "sniper-ghost-warrior", "name": "Sniper: Ghost Warrior", "name_original": "Sniper: Ghost Warrior", "description": "<p>Sniper: Ghost Warrior is the second game in Sniper series of tactical shooters with sniping simulation. It is the first game subtitled Ghost Warrior and a spiritual sequel to Sniper: Art of Victory.</p>\n<h3>Plot</h3>\n<p>The game is set in Latin America, in the deep jungle of a fictional island state Isla Trueno. An enemy power has recently overthrown the local pro-American government. The player assumes control over the US special forces agents and Truenian rebels who fight against the new regime. In Sniper: Ghost Warrior, the player assumes the roles of several main characters, among them a US soldier Tyler Wells who performs sniping and stealth operations, and a local rebel El Tejon who is most useful in open combat.</p>\n<h3>Gameplay</h3>\n<p>There are several types of missions in the game. Some of them emphasize stealth action and marksmanship, while others involve direct firefight. Besides a variety of sniper rifles, the characters can use other silent weapons, such as knives and silenced handguns.</p>\n<p>The game has a quasi-realistic model of bullet ballistics. The player has to take into account the distance to the target and the bullet&#39;s flight time. The wind and the shooter&#39;s physical condition also influence the accuracy. In lower difficulty levels, the player can use the system that indicates the designated target and the place of the actual hit.</p>", "metacritic": 55, "released": "2010-06-24", "tba": false, "updated": "2024-04-12T08:19:51", "background_image": "https://media.rawg.io/media/games/61d/61d15dad7a5c58f58e6f182759fdeb5b.jpg", "website": "http://www.sniperghostwarrior.com", "rating": 2.95, "rating_top": 3, "added_by_status": {"yet": 70, "owned": 1842, "beaten": 175, "toplay": 26, "dropped": 108, "playing": 5}, "playtime": 1, "achievements_count": 80, "ratings_count": 239, "suggestions_count": 608, "game_series_count": 4, "reviews_count": 242, "platforms": ["PlayStation 3", "iOS", "PC", "Xbox 360", "Android"], "developers": ["City Interactive", "CI Games", "City Interactive S.A"], "genres": ["Action", "Shooter"], "publishers": ["CI Games", "City Interactive"], "esrb_rating": "Mature"}