{"id": 17533, "slug": "real-warfare-1242", "name": "Real Warfare 1242", "name_original": "Real Warfare 1242", "description": "Russia during the XIII century was a huge state, much larger than any other European country. Split by internal conflicts, and yet standing strong against numerous outer threats, it was attacked by the infamous Mongol Horde. They came suddenly and pierced through the country like a blazing arrow. The native people fought valiantly, led by a fierce warrior and prince, Prince Alexander Nevsky. Real Warfare: 1242, is a realistic real-time strategy game based on authentic historic events. It invites you to experience the glorious times of princes, knights and vast battles.<br/>\t\t\t\t\tThe player’s goal is to direct Alexander Nevsky through meticulously recreated historic battlegrounds and achieve the greatest of victories by repelling the attacks of Teutonic and Swedish knights, bringing Lithuania to peace and eliminating every single invader in 1242.Key features:\t\t\t\t\t<ul><li>The engine incorporates state-of-the-art technologies used in real-time strategy titles<br/> </li><li>Vivid, lifelike real-time graphics<br/> </li><li>Carefully maintained historic realia<br/> </li><li>Vast territories to conquer and control<br/> </li><li>Significant level of depth and in-game freedom<br/> </li><li>Improved unit animation (with the transition to motion capture)<br/> </li></ul>", "metacritic": null, "released": "2011-11-30", "tba": false, "updated": "2023-05-16T10:01:19", "background_image": "https://media.rawg.io/media/screenshots/0df/0dfab32308683e729ad2dce1423ea8b2.jpg", "website": "http://www.real-warfare.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 5, "owned": 244, "toplay": 1, "dropped": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 3, "suggestions_count": 444, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC"], "developers": ["Unicorn Games Studio"], "genres": ["Strategy"], "publishers": ["1C Company"], "esrb_rating": null}