{"id": 17540, "slug": "injustice-gods-among-us-ultimate-edition", "name": "Injustice: Gods Among Us Ultimate Edition", "name_original": "Injustice: Gods Among Us Ultimate Edition", "description": "<p>Injustice: Gods Among Us Ultimate Edition is an extended version of fighting game Injustice: Gods Among Us based on the imaginary universe of DC Comics. The gameplay is made in a traditional fighting 2.5D manner: battles occur in a 2D perspective but all the characters and objects are 3D. All fights are held in one-on-one form, where each participant has two life scales. Game mechanics are simple: three different types of hits and a special ability are available for each character. Some on-map objects are interactive and can be also used in attack. The main action takes place in a universe, which is parallel to a DC’s one, so occasionally clashes may look unusual. According to the storyline, Superman established dictatorship on Earth, and several Justice League members started resisting him. In the game, players are able to take control of favourite DC heroes and to participate in a war between Superman’s domination and the rebellion led by Batman. The Ultimate Edition offers players 6 new characters, over 30 new skins, and 60 new S.T.A.R. Labs missions. <br />\nInjustice: Gods Among Us is followed by the sequel Injustice 2.</p>", "metacritic": 80, "released": "2013-11-12", "tba": false, "updated": "2024-04-20T22:20:06", "background_image": "https://media.rawg.io/media/games/234/23410661770ae13eac11066980834367.jpg", "website": "http://www.injustice.com", "rating": 3.53, "rating_top": 4, "added_by_status": {"yet": 356, "owned": 7562, "beaten": 863, "toplay": 42, "dropped": 555, "playing": 25}, "playtime": 5, "achievements_count": 254, "ratings_count": 1377, "suggestions_count": 406, "game_series_count": 0, "reviews_count": 1381, "platforms": ["PlayStation 4", "PS Vita", "PC", "Xbox 360", "PlayStation 3"], "developers": ["NetherRealm Studios", "High Voltage Software", "Armature Studio"], "genres": ["Action", "Arcade", "Fighting"], "publishers": ["Warner Bros. Interactive"], "esrb_rating": "Mature"}