{"id": 175472, "slug": "the-maze-awestwoodcgd", "name": "The Maze (AWestwoodCGD)", "name_original": "The Maze (AWestwoodCGD)", "description": "<p>###This game is still in very early development and not fully working, please let me know what could be done to improve on the quality of the game or any ideas about the different maze types I could include. Any feedback is much appreciated and make sure to keep up to date with my updates which I will be releasing throughout the course of the project.###</p>\n<p>The Maze is a game that I am creating for my final major project for Computer Games Design at Priestley College. The project brief was to create a fully working game and I hope to expand off this and create more levels for the future of this game after the project.</p>\n<p>The game is all about exploring the various mazes and stages that are on offer. There are 5 stars available for each level which upon gaining a full set you unlock a view of the maze from above to plan the best escape route for the new best scores. Each level has a time trial that if you beat the time set it will reward you with a star as well as 3 more stars to be collected in the maze. The final star is acquired through walking to every dead end in the maze so you have explored every corner.</p>\n<p>Each set of mazes comes with a new challenge whether that be a larger maze or a different twist to the gameplay. Within each set, the mazes get progressively more difficult by having longer solutions and shorter solve times in comparison. Each maze needs to have been completed once as well as having collected 3 stars to enable the next maze to have been unlocked, so this will give something for you to work towards.</p>\n<p>The game is based on a mobile app sort of style with the progression through levels however it gives you this in a first person view giving a new twist to the popular mobile game format.</p>", "metacritic": null, "released": "2018-03-29", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/e6b/e6badcd06755fef527dae94ecb3b74b7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 91, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["AWestwoodCGD"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}