{"id": 175422, "slug": "automic-creator", "name": "Automic Creator", "name_original": "Automic Creator", "description": "<p>See http://cvprogramming.tk/automic.html for more information on this product.</p>\n<p>Block buidling games have gained huge amounts of popularity over the past couple of years. The ability to create anything you can imagine is great, but pretty much all of these aforementioned games lack one feature: The ability to automate things. While most games, including the popular game of Minecraft (by Mojang), have some sort of mechanic that works similarly to electricity, these still aren't very scriptable, and are only really to show off. They don't really have a purpose in the game iteslf. Automic Creator (Note the 'Auto' part in Automic), though it is still in early development, focuses more on the automation of tasks, then other game mechanics.<br/></p>\n<p>This game isn't just another rip off, trying to profit from another company's success. This is a completely reimagined version of the block building genre. Really the only thing purposefully taken from games like Minecraft is the block building concept. Mining is different, building is different, crafting is different... You get the idea.</p>\n<p>As stated earlier, this game is still in early development, so there might not be too much that can be automated. Currently, I am focusing on the core functionality of the game, since I don't want to take any shortcuts and just jump in. I want the game to feel fully completed, giving the player actual incentive to automate tasks.</p>", "metacritic": null, "released": "2018-02-21", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/1c4/1c44b4f49abb78ded9ae167662d51d3f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 74, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["V0LT"], "genres": [], "publishers": [], "esrb_rating": null}