{"id": 175563, "slug": "oreh", "name": "Oreh", "name_original": "Oreh", "description": "<p> Note : the game is currently for French speackers, and unfinished.</p><p><strong>a</strong> : Attack<br/><strong>z</strong> : Block<br/><strong>Escape </strong>: Give Up<br/><strong>arrows </strong>to move</p><p>Description (in French) :</p><p>Jeu réalisé à l'occasion de la <em>Jam Nuit Blanche</em>, en 2015, sous le thème de l'empathie.</p><p>Un guerrier en manque d'action attend auprès de son arbre, quand des étrangers font soudainement irruption pour s'en approcher.</p><p> </p><p>===========================================================<br/>******************* SPOIL / DO NOT LOOK BEFORE PLAYING ********************<br/>===========================================================</p><p>Le jeu manquant encore de finitions, le concept peut paraître abstrait, ou ne pas être compris, notamment peut-être le rapport avec le thème de la jam. En voici donc une explication du concept :</p><p>Le joueur voit son personnage affronter des hordes d'<em>ennemis</em>, mais dont on ne sait finalement pas vraiment qui ils sont. Le personnage, un guerrier, en est au départ ravi, il ne s'était pas battu depuis longtemps.</p><p>Seulement, au fur et à mesure de la partie, le personnage ne fait que tuer, de plus en plus, sans finalement vraiment savoir pourquoi. Il se met à souffrir de cette situation qui semble ne jamais finir, ne plus avoir le moindre sens.</p><p>L'objectif est que le joueur finisse par remarquer, comprendre cette douleur qui est celle du guerrier qu'il incarne, l'absurdité de ce qu'il fait, et qu'il <em>give up</em>, qu'il abandonne, pour que le carnage cesse, avant que le personnage ne devienne complètement fou.</p><p>Le joueur doit développer de l'empathie pour son personnage et comprendre que sa seule option est de quitter le jeu, d'abandonner, pour que la folie du guerrier cesse.</p>", "metacritic": null, "released": "2015-10-04", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/e41/e41692ec3d23f93921a6723a02632097.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 48, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Les Inde'termines"], "genres": [], "publishers": [], "esrb_rating": null}