{"id": 175522, "slug": "farm-animal-truck-transport", "name": "Farm Animal Truck Transport", "name_original": "Farm Animal Truck Transport", "description": "<p>Add twist to the animal transport games and become a farm animal transporter driver. Invigorate your cattle transport truck games fun in an amazing tame animal transport simulator that requires high precision! Farm cattle transporter games were never such before. Farm animal transporter aka farm cattle transporter truck is one of the finest animal transport simulator that is going to be a complete treat for farm transport animal games lovers. So get ready for the Farm Animal Truck Transport which is all about domestic farm animal's transportation concept.</p><p>Farm Animal Truck Transport 3D gives you the joy of playing a realistic animal transport simulator with a novelty of cattle variety among farm animals games. Be an awesome animal truck driver roaming around with your 3D truck trailer in a countryside with animal warehouses and farming fields to provide you a realistic farm animal transporter environment. Fulfill your almost truck driver duty of carrying livestock in your cargo truck and transporting them safely and without incurring any kind of damage. This animal transport simulator is a unique blend of quality transport games mechanics and scenic rural environment to give the perfect 3D animal transportation simulator experience. Time to buckle up and become the driving master in this 3D Farm Animal Truck Transport game.</p><p>Features:<br/>• Classic gameplay in this farm pets transport game<br/>• Real-model of farm cattle transport truck<br/>• Realistic village farm and city environment <br/>• A good experience of live animals transport<br/>• Extreme precision 3D animal transportation simulator<br/>• Transport different animals in each challenging level of farm cattle 3D transporter<br/>• An awesome farm truck game giving you the feeling of real truck driver</p>", "metacritic": null, "released": "2016-02-18", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/a89/a897f4059bc678061645f4396c88cd4d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 124, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Smashinggeeks"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}