{"id": 1756, "slug": "the-barbarian", "name": "The Barbarian", "name_original": "The Barbarian", "description": "\"I have a real RPG to play with on my iPad now!\" -Denin, Touch Arcade Forums<br/><br/>The Barbarian is a full, action packed RPG game designed to have a desktop-like feel on mobile!  Over 30 Hours of gameplay featuring 13 environments, hordes of over 100 enemy types and thousands of potential weapons and armor as well as a skill and class system that changes how the game can be played.<br/><br/>It's an open world adventure that won't hold your hand, won't give you any 3rd-party \"helper\" character to tell you what to do next.  There are puzzles, there are dead ends, there are hidden secrets and many quests for you to solve.<br/><br/>** Requires 1GB of RAM or More.  WILL NOT WORK without 1GB of RAM **<br/><br/>FEATURES<br/>* Open world play with 13 huge maps<br/>* Over 30 hours of Gameplay<br/>* Works with all Made for iPhone Gamepads!<br/>* Massively re-playable<br/>* Skills (48) and Spells (30) allow for character specialization<br/>* Quality Settings allow for play on all 1GB+ iOS devices (Shadow &amp; Resolution options)<br/>* Active Developer &amp; Forum<br/><br/>_________________________________________________<br/><br/>The Barbarian was made by a solo, independent developer.  It's my first big release, and I hope you enjoy it.  The game is being updated often with bug fixes and new character models.<br/><br/>Your support means I can continue making more RPG games for Desktop &amp; Mobile.  Really, FULL Role-playing Games that don't cut corners for mobile.  Games without in-app purchase gimmicks, that are designed to be fun and engaging, rather than grinding and pay-to-win.<br/><br/>Let me know what you think!  I think you'll enjoy it! :)", "metacritic": null, "released": "2015-05-11", "tba": false, "updated": "2020-06-29T02:23:26", "background_image": "https://media.rawg.io/media/screenshots/903/9038680e35037b587fcd9fa41fcfe4ee.jpeg", "website": "http://www.thebarbariangame.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 426, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "iOS"], "developers": ["S.F. Bay Studios"], "genres": ["Action", "Adventure", "RPG"], "publishers": ["S.F. Bay Studios"], "esrb_rating": null}