{"id": 17576, "slug": "batman-arkham-city-goty", "name": "Batman: Arkham City - Game of the Year Edition", "name_original": "Batman: Arkham City - Game of the Year Edition", "description": "<p>Batman: Arkham City is the second game in the Arkham series. Joker has escaped from Arkham Asylum, and Doctor Hugo Strange is capturing Bruce Wayne. Strange discovers the true identity behind the Batman and tries to kill him, but Wayne escapes from the prison and saves the Catwoman from Two-Face. Trying to acknowledge the mysterious &quot;Protocol 10&quot; he finds Joker in devastating state - fatal infection slowly kills. Joker infects Batman and every Gotham hospital.</p>\n<p>Arkham City involves legendary Kevin Conroy and Mark Hammil coming back as Bruce Wayne and Joker, gifting their voices one more time. Noir Gotham atmosphere is supported by a grim plot and very live surroundings. The gameplay is still concentrating on simple but comforting fighting system making fights feel very fast and intense. In solving puzzles and gaining a tactical advantage, Batman can use different gadgets, as Batarang or a grapnel gun. You can silently dive and kill your enemies and use your detective skills to find clues about villains your facing, becoming as close to Batman, as possible.</p>", "metacritic": 91, "released": "2012-09-07", "tba": false, "updated": "2024-04-12T08:41:51", "background_image": "https://media.rawg.io/media/games/c50/c5085506fe4b5e20fc7aa5ace842c20b.jpg", "website": "http://community.batmanarkhamcity.com/", "rating": 4.4, "rating_top": 5, "added_by_status": {"yet": 389, "owned": 5938, "beaten": 1446, "toplay": 118, "dropped": 173, "playing": 47}, "playtime": 9, "achievements_count": 64, "ratings_count": 1419, "suggestions_count": 681, "game_series_count": 0, "reviews_count": 1424, "platforms": ["PlayStation 4", "Xbox 360", "Xbox One", "PlayStation 3", "macOS", "PC"], "developers": ["Feral Interactive", "Rocksteady Studios"], "genres": ["Action", "Adventure"], "publishers": ["Feral Interactive", "Warner Bros. Interactive"], "esrb_rating": "Teen"}