{"id": 175765, "slug": "demo-elf_ears", "name": "DEMO (Elf_Ears)", "name_original": "DEMO (Elf_Ears)", "description": "<p><strong>UPDATE: NOW WITH SOUND!!!</strong><br/></p><p>Your <strong>3 GENERALS</strong> are about to <strong>DEMO</strong> their new <strong>SUPERWEAPON</strong>!!!</p>\n<p>This has to be stopped at <strong>ALL COSTS</strong>!!!</p>\n<p>This game is a loveletter to both old GBA games and old 2000's PC indie games.</p>\n<p><strong>Please ignore the rude person in the Notes section. They are detrimental to your self estem :(</strong></p>\n<p>==How To Play==<br/>Arrow keys - Move left and right, up to enter doors.<br/>Z- Fire weapon, read signs, advance dialogue and use warps when touching them.<br/>X - Jump<br/>A - Previous weapon, previous warp destination when touching warp.<br/>S - Next weapon, next warp destination when touching warp.</p>\n<p>==How To Change Controls===<br/>You can't. <br/>The default controls are vital to gameplay.</p>\n<p>Questioning this is not permitted.</p>\n<p>==Notes==</p><p>Sometimes the soldier enemies will get very scared at your prescence and stop moving. <br/>Even when you leave their cone of vision.</p>\n<p>This is completely intentional and not a combination of fighting with engine bugs, my poor programming and tight deadlines.</p>\n<p>The turret enemies and the final boss do not get scared as they are programmed differently</p>\n<p>==</p>\n<p>And yeah, sometimes the warps mess up upon loading a game and don't recognise that they've been activated  (FXXXING ENGINE BUG), <br/>thus creating multiple copies of themselves in the warp list.</p>\n<p>But you're a fat manchild naked at their computer. Be considerate, would YOU want to be told the truth?</p>\n<p>==</p>\n<p>Also, the main character's feet go into the ground because I needed to resize their hitbox last minute so they don't get stuck.</p>\n<p>Shut up fatty, I bet you wish YOU could resize your \"Hitbox\"</p>\n<p>=====================================</p>\n<p>Alright, all jokes aside. I am probably going to get my ass handed to me. </p>\n<p>I love this game and worked hard on it. <br/>But the cold hard truth is that teams of far better programmers, artists and musicians have probably already won.</p>\n<p>Yes I know the blade weapon is OP (if janky), but you deserve it if you picked it up.</p>\n<p>You bothered to find a secret in MY GAME! and that means a lot to me...</p>\n<p>Thanks if you played this. It means <strong>more than you could imagine.</strong></p>\n<p>Source available at https://github.com/ElfEars/DEMO</p>\n<p>Feel free to use the code in any way you want. There's a lot of cool stuff for the aspiring godot metroidvania maker.</p>\n<p>This game is probably more fun to mod than play lol.</p>\n<p>I'd like to keep ownership of the art and sounds however. (Feel free to use it in fangames though)<br/>Those walk cycles were hard to draw! Expect to see them in my next \"\"\"Great\"\"\" title.</p>\n<p>Made with <strong>Brought eternal shame to the Godot Engine</strong></p>", "metacritic": null, "released": "2017-12-01", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/bba/bba5e09c9db3d091887823a791da9e61.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 45, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Web"], "developers": ["Elf_Ears"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}