{"id": 175872, "slug": "morning-walk", "name": "Morning Walk", "name_original": "Morning Walk", "description": "<p>A quick game made as an entry into the FLATGAME Jam.<br/></p><p>Rules to make a Flatgame:<br/></p><p><strong>1.</strong> Create works where you only control/play with movement of pieces around the screen (the player or anything else) and no further interaction, or even collisions. As little scripting as possible except movement and animation. Flat games are focused on presenting a game as the most raw and immediate combination of movement, art and sound. Place text onto the world to give characters dialogue, monologue and story.</p><p><strong>2. </strong>Make art physically, and try to complete it in under an hour or so. Use whatever materials you want! Pens and paper, crayon, photos of toys around your house or even puppets! Give yourself a time limit. Eg, 30 minutes to draw the elements you need and 30 minutes to edit and clean up, or even alter however you want. I love boosting the saturation to gaudy levels. For animation, try to draw the same thing twice. The art can be re-purposed. Use the things you already drew in ways you didn't think of at the time! Protip, if drawing, draw on the same a3 sheet as it will limit how much drawing you do!</p><p><strong>3.</strong> No sound effects, just a single track of ambience/music/background. A track of music/sound is a great way to add structure and a sense of progression to your flatgame. Tools like audacity can be downloaded for free.<br/><br/><strong>4.</strong> Release it! The idea is to aim to make the game in an hour or two, and to actually do it in half a day. Finishing games is its own skill and it's fun. &lt;3 Remember most people's key impression of your game will be from your itch page, so add screenshots and give a nice description!!</p>", "metacritic": null, "released": "2017-01-16", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/cff/cff0fff651598a1b116e20385bd27aab.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 11, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Craig Innes"], "genres": [], "publishers": [], "esrb_rating": null}