{"id": 17581, "slug": "into-the-stars", "name": "Into the Stars", "name_original": "Into the Stars", "description": "We’ve been under attack for 10 years now. Every 6 months the Skorn arrive, set on destroying our planet, and now few of us remain to defend what’s left. The massive Ark ships we’ve built in hopes of escaping them have all gone, save one. You must take the role of Captain of our final vessel, the Ark 13, and guide a hand-picked, but inexperienced crew on a journey fraught with intrigue and danger. The fate of the Endurance Coalition is uncertain and you could well be our last hope. How will you fare once you set out Into the Stars?<br/><br/>Into the Stars is an open-world Space Survival Simulation built in Unreal Engine 4, featuring an original score from Jack Wall. <br/><br/>Take the role of Captain as you explore a massive star system in search of a new home for humanity. Outfit your ship, hand pick your crew and set off on a journey where you must scavenge resources, shelter civilians and either outrun, or outgun a hostile alien force, in order to survive.Key Features<ul><li><strong>Complete Control:</strong> Take command of your hand-picked, but inexperienced crew, and guide them through a star system packed with mystery and danger. Difficulty Settings allow you to tune the intensity of the enemy threat and the pace of your journey.<br/></li><li><strong>Explore a Massive Star System:</strong> You have the freedom to set your course for salvation, but no approach is free from peril. Each of the 90 zones in this system present unique opportunities, along with challenges, and only you can find the path to success.<br/></li><li><strong>Challenging volley-based Combat:</strong> A number of foes, who are unwilling to negotiate, await you on this voyage. That's why your ship is equipped with weapon systems that speak for the human race, in a language everyone can understand. Choose your target points, battle stations and crew wisely, if you want to survive numerous alien encounters.<br/></li><li><strong>Music by Jack Wall:</strong> Driven by an original score from the legendary composer behind the music for Mass Effect, Call of Duty and Lost Planet.<br/></li><li><strong>Replayability:</strong> Every decision you make as Captain, and every randomly generated obstacle the crew encounters, can affect the outcome of a mission, creating a different experience, every time you play.</li></ul>", "metacritic": 61, "released": "2016-03-03", "tba": false, "updated": "2019-09-17T14:26:23", "background_image": "https://media.rawg.io/media/screenshots/03a/03ae2de1779c180040bb5f724c5ba7eb.jpg", "website": "http://www.fugitive-games.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 4, "owned": 77, "beaten": 1, "dropped": 3}, "playtime": 3, "achievements_count": 17, "ratings_count": 3, "suggestions_count": 541, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC"], "developers": ["Fugitive Games"], "genres": ["Action", "Adventure", "Strategy", "Simulation", "Indie"], "publishers": ["Iceberg Interactive"], "esrb_rating": null}