{"id": 175801, "slug": "curious-tales-of-a-time-traveler-fall-2017-470", "name": "Curious Tales of a Time Traveler - Fall 2017 - 470", "name_original": "Curious Tales of a Time Traveler - Fall 2017 - 470", "description": "<p>In Curious Tales of a Time Traveler, you are a time traveler who travels through various points in time, anywhere from post-apocalyptic to civil war time. In this game, you travel to three different worlds, post-apocalyptic, medieval times, and civil war where you will face a variety of enemies like zombies, archers, and confederate troops. Your goal in each level is to reach the portal in each world to go to next point in time. However, there will be hordes of enemies trying to stop you along the way so you must be able to fight your way through them to reach the portals.\r\n</p>\n<p>In the game, you start off with just a pistol that has an unlimited amount of ammo. You aim and shoot with the mouse button and you move around using the WASD keys. The pistol will take two shots per enemy to be able to kill that enemy, but there will be better weapons for you along the way. For example, there is a shotgun powerup that increases your damage from two shots a kill to one shot a kill, but the powerup does not last forever. There will also be health packs and an instant kill powerup that will allow you to kill enemies by running into them. There will be checkpoints along the way as you progress through the worlds. If you can make it to the last portal in the third world without dying three times, you win the game. If you die more than three times before making it to the last portal, you lose.</p>", "metacritic": null, "released": "2017-12-06", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/736/73684bf86b89f9b2d01db6c0cc3af450.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 71, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["CAGD"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}