{"id": 175831, "slug": "brute-force-attack", "name": "Brute Force Attack", "name_original": "Brute Force Attack", "description": "<p>The game is build around a more or less standard Tower Defence core, but is has attempted to innovate by applying more modern Real Time Strategy elements to the formula. Most notably is the concept of the research tree, which controls the progression of the game, stopping the player from simply saving up to the most powerful weapons early on, and instead building a variety of weapons until the most powerful are within the players grasp. Another attempted innovation is the concept of the modular turret system, in which a single turret is made out of a bunch of modules, most commonly a base, a rotator and a weapon. However, due to poor planning and game design, as well as less-than-well structured programming, this became little more than a neat side-feature with no real practical uses outside of more compact damage.</p>\n<p><strong>Feature overview:</strong></p>\n<ul><li><strong><em>Solid-ish tower defence core with an outright mathematically guided difficulty curve.</em></strong></li><li><strong><em>50 waves of enemies even though most PC's can't handle it past 35.</em></strong></li><li><strong><em>A shallow and useless modular turret system.</em></strong></li><li><strong><em>A shoehorned in research system without any real analysis on how it'd affect gameplay.</em></strong></li><li><strong><em>Late-game gameplay similar to a particularily slow power-point presentation.</em></strong></li><li><strong><em>An inproportional amount of bloom.</em></strong></li></ul>\n\n<p>Brute Force Attack (Project codename: Project Virus) is a Tower Defence game developed mainly by Marcus \"Lomztein\" Jensen, with occasional help from various freinds, both in terms of programming and quality assurance. It uses the Personal Edition of the Unity Engine.</p>", "metacritic": null, "released": "2017-12-08", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/8c8/8c8618c921fde3c28e738b7be44a8170.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 89, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["Lomztein"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}