{"id": 175822, "slug": "project-defender", "name": "Project Defender", "name_original": "Project Defender", "description": "<p>\r\n\tYour company landed a lucrative contract with the government. Everyone on your team is happy because lucrative contracts mean years of job security\r\n\t. All seems well but then the dreaded \r\n\t<strong>Project Manager, Bad Programmers and the Government</strong> appears to threaten your job security. Defend your project's funding!\r\n</p>Game Objective\r\n<p>\n<strong>The </strong><strong>Project Manager</strong> moves left to right picking<strong> Funding Piles </strong>to attack with his death ray. If he is successful, the <strong>Funding Pile</strong> is knocked down. Once a <strong>Funding Pile</strong> has been knocked down, the <strong>Government </strong>will try to reclaim the <strong>Funding Pile</strong>.<br/>\n</p><p>\r\n\tAs the \r\n\t<strong>Lowly Employee</strong> you must use your <strong>Funding Shield</strong> to protect all the <strong>Funding Piles</strong> and prevent the government from taking them.\r\n</p><p>\r\n\tFrom time to time, additional money will fall from the sky. Move the \r\n\t<strong>Lowly Employee</strong> underneath the falling money to catch it and add it to your reserves. You can use this money to replenish your <strong>Funding Piles </strong>or shoot the money at the government to prevent them from taking your Funding Pile.<br/>\n</p><p>\r\n\tScore as many points as possible before the \r\n\tGovernment  takes all your <strong>Funding Piles</strong>.\r\n</p>Using the Controller<p>\r\n\tDuring play you will be able to control the \r\n\t<strong>Lowly Employee</strong>. Use the arrow keys to move the <strong>Lowly Employee</strong>\n<strong>left</strong> and <strong>right</strong>. Use these keys to maneuver the <strong>Lowly Employee</strong> under a funding pile to block the <strong>Project Manger's</strong> death ray from draining it.\r\n</p><p>\r\n\t To replenish a \r\n\t<strong>Funding Pile</strong>, maneuver the <strong>Lowly Employee</strong> on top of the knocked down pile and press <strong>Space</strong>. You can shoot any money you have collected at a Government by pressing <strong>Space</strong><br/>\n</p>Begin Play<p>\r\n\tAfter loading the game, press the \r\n\t<strong>Enter</strong> key to start the game. If you reach a <strong>Game Over</strong>, press the <strong>Enter</strong> key to start a new game.\r\n</p>General InforationFunding Pile<p>\r\n\tYou start the game with four \r\n\t<strong>Funding Piles</strong>. Replenishing a pile will award you<strong> 5 points</strong>.\r\n</p><p>\n</p>Evil Project Manager<p>\r\n\tThe evil project manager is attempting to drain your funding. Don't let his death ray strike yourFunding Piles.\r\n</p><p>\n<img <strong=\"\" src=\"http://i.imgur.com/P9GejvH.png\" style=\"width: 100px;\"/><br/>\n</p>Lowly Employee<p>\r\n\tThe lowly employee is all that stands against the\r\n\t<strong> Project Manager</strong>, the Government and Bad Programmers. Be the hero and protect your teams job security!\r\n</p><p>\n</p>Bad Programmer<p>\n<strong>Bad Programmers</strong> will attack from the left and right side of the screen. When a <strong>Bad Programmer</strong> hits the <strong>Lowly Employee,</strong> it will knock him to the side. Unfortunately, <strong>Bad Programmers</strong> are unavoidable so plan accordingly.\r\n\t\r\n</p>Government<p>\r\n\tThe Government will be watching your \r\n\t<strong>Funding Piles</strong>. If a <strong>Funding Pile</strong> is knocked down, the Government will fly down to reclaim it. Shoot <strong>Extra Money</strong> at the Government to stop them from taking your <strong>Funding Pile</strong>.</p><p>\n</p>Extra Money Boosts<p>\r\n\tThese extra funds will occasionally fall from the sky. Collect them to gain 5 points. You can then use them to replenish your \r\n\t<strong>Funding Piles</strong>.\r\n</p><p>\n</p>User Interface<p>\r\n\tThe left side of the user interface is your score. You receive points over time as well as collecting extra funds and replenishing \r\n\t<strong>Funding Piles</strong>.\r\n</p><p>\r\n\tThe right side of the user interface is the number of \r\n\t<strong>Extra Money Boosts</strong> you have. The maximum is 3 and you can use one at a time to replenish your <strong>Funding Piles</strong>.\r\n</p><p>\n</p>Credits<p>\r\n\tMusic by Tristan Lohengrin : \r\n\thttp://tristanlohengrin.wix.com/studio<br/>\n</p>", "metacritic": null, "released": "2017-02-16", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/340/340ec72dd38943fd85327b0725aa9b9a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 89, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Pixelshot Games"], "genres": ["Action"], "publishers": [], "esrb_rating": null}