{"id": 17590, "slug": "devil-daggers", "name": "Devil Daggers", "name_original": "Devil Daggers", "description": "<p>Devil Daggers is a shooter developed by Sorath. This is the only game in the franchise. </p>\n<h3>Plot</h3>\n<p>The player aims to survive through attacks by armies of demonic monsters for as long as possible. To survive, the player must defeat enemies or avoid contact with them; as the game goes, the monsters become more. The action is taken on a field shrouded in darkness. As a weapon, the protagonist can fire daggers from fingers. </p>\n<h3>Gameplay</h3>\n<p>Devil Daggers is a first-person shooter. As the game starts, the player fetches fire daggers.<br />\nThen he is transported to the dark arena, where monsters begin to spawn. The goal is to fight off every appearing enemy. More exotic creatures appear throughout the game; later on, the player can recognize the type of a monster based on the unique noise one makes. There are two alternatives in using the daggers: the protagonist can either fire a shotgun-like blast with a widespread (the player clicks the left mouse button) or fire a continuous stream of them (the player holds the mouse button). The player can die if he touches an enemy, or if he falls off the stage. After that the player can fetch the red crystals dropping from the top of the screen – it lets them upgrade the daggers. </p>\n<h3>Key features</h3>\n<p>The game design uses distorted effects like texture warping and polygon jitter. That makes it look like an old shooter game from the 1990s.</p>", "metacritic": 83, "released": "2016-02-17", "tba": false, "updated": "2024-01-22T16:21:53", "background_image": "https://media.rawg.io/media/screenshots/9cf/9cfb04d5480b105075226f02121ed3ae.jpg", "website": "http://devildaggers.com", "rating": 3.94, "rating_top": 4, "added_by_status": {"yet": 59, "owned": 1240, "beaten": 44, "toplay": 21, "dropped": 99, "playing": 14}, "playtime": 1, "achievements_count": 1, "ratings_count": 156, "suggestions_count": 269, "game_series_count": 0, "reviews_count": 157, "platforms": ["PC", "Linux", "macOS"], "developers": ["Sorath"], "genres": ["Action", "Indie"], "publishers": ["Sorath"], "esrb_rating": null}