{"id": 17614, "slug": "cargo-commander", "name": "Cargo Commander", "name_original": "Cargo Commander", "description": "Alone in space, light years away from your family, armed with only your Fistcannon™, Platform Drill and the meanest cup of coffee in the sector; you are Cargo Corps’ latest recruit, a Cargo Commander.<br/>Your responsibilities are simple: travel through the vast reaches of wormhole-filled space salvaging priceless cargo from alien infested containers. The work, however, is hard, honest, and hairy:punch and shoot deadly mutants in the face, while traveling between your ship and containers. Jockey for promotions with thousands of other Cargo Commanders in the galaxy, collect over 80 different cargo types, all the while earning your way back home.Key Features<ul><li>Randomly generated levels based around names.  Choose any name to generate a new custom sector and share with your friends to compete for high score!<br/></li><li>Fully destructible environments; create your own path with your Platform drill and explosives <br/></li><li>Compete with other players for promotions; each sector has an online leaderboard<br/></li><li>2 different play modes: Career and Journey <br/></li><li>Loot the dead corpses of other players' vain attempts at beating your score <br/></li><li>Upgradeable weapons and tools</li></ul>", "metacritic": null, "released": "2012-11-01", "tba": false, "updated": "2023-11-17T19:19:17", "background_image": "https://media.rawg.io/media/screenshots/267/2676d3df05e1e0cf4dee9170b147b383.jpg", "website": "http://www.playcargocommander.com", "rating": 3.05, "rating_top": 4, "added_by_status": {"yet": 16, "owned": 619, "beaten": 10, "toplay": 3, "dropped": 22, "playing": 1}, "playtime": 2, "achievements_count": 19, "ratings_count": 41, "suggestions_count": 430, "game_series_count": 0, "reviews_count": 41, "platforms": ["PC", "macOS", "Linux"], "developers": ["Serious Brew"], "genres": ["Action", "Indie"], "publishers": ["Missing Link Games"], "esrb_rating": null}