{"id": 176205, "slug": "the-halloweens-guardian", "name": "The Halloween's Guardian", "name_original": "The Halloween's Guardian", "description": "<p>Elève Gamecodeur depuis huit mois sous le pseudo Aktayr, je participe ici à ma 3ème GameJam avec un thème particulièrement stimulant, celui de Halloween.</p>\n<p>Je me suis principalement inspiré du jeu Bart's Nightmare et de Thimbleweed Park pour créer mon jeu.</p>\n<p>Les cours qui m'ont été  instructifs sont en particulier ceux sur le scrolling parallaxe, le cours sur les tilemaps pour la gestion des quads et l'atelier intégration des sons et musiques dans un jeu vidéo.<br/></p>\n<p>J'ai utilisé pour cela le langage Lua couplé au framework Love2D. Aucune librairie externe utilisée. Les principales difficultés rencontrées étaient principalement le fait de pouvoir zoomer le personnage principal, suivant qu'il se rapproche ou non de l'écran. Le changement de niveau m'a aussi m'a aussi posé quelques contraintes, du fait qu'il fallait rétablir certaines valeurs. <br/></p>\n<p>J'ai composé les musiques avec le logiciel Fl Studio et réalisé les graphismes avec Pyxel Edit (un vrai petit bijou ce logiciel !), exception faite des ciels que j'ai réalisé sous Krita. D'ailleurs, j'ai passé tellement de temps sur les graphismes que j'en ai oublié l'essentiel : faire un jeu ^^ ! On se retrouve donc avec une démo (le jeu sortira dans les bacs pour les fêtes. Précommandez-le  ^^) avec pour seule possibilité que  de déplacer son personnage.  Le jeu est actuellement en phase de test. En effet, en appuyant sur les touches X ou C, vous terminerez automatiquement le jeu.<br/></p>\n<p>Viendra sous peu la possibilité d'attaquer, des ennemis, des pnj (personnage non joueur) et des boss. Par contre, il me semble noter des ralentissements durant le jeu. De plus, il me faut régler les positions x des backgrounds qui ont tendance à ne pas se repositionner à l'identique au point de départ.<br/></p>\n<p>Bien que le jeu ne soit pas fini, je ressens une grande fierté par rapport à la progression que m'a apporté cette GameJam. Je me suis retrouvé à réaliser des choses que je n'aurais pas cru possible il y a peu. Et pour ça, je te dis merci David !<br/></p>", "metacritic": null, "released": "2017-10-29", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/076/0769573bd413ec7970566d3a67f1b6d8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 25, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Aktayr"], "genres": [], "publishers": [], "esrb_rating": null}