{"id": 17626, "slug": "cyberlink-colordirector-4", "name": "CyberLink ColorDirector 4", "name_original": "CyberLink ColorDirector 4", "description": "ColorDirector lets all users enjoy the advanced color grading features and functionality used by professional video editors. A wide range of manual and one-click color adjustment features make color grading faster and easier than ever, allowing for precise control over the lighting and mood of everything from action sports footage and video travelogues, to full-length movies. New blur, tint, and motion tracking effects offer even more creative possibilities.<strong>Features:</strong><ul><li><strong>Easy Ways to Stylize Your Videos</strong><br/>Simple but Powerful Adjustment Tools<br/>The new radial gradient mask enables you to create off-center, vignetted areas to highlight specific regions in a video. HDR effects let you increase the dynamic range of luminosity of footage, and single-click presets let you adapt the style of famous films. Powerful motion tracking combined with regional tints and blurs let you emphasize key objects and create motion effects. You can even use motion tracking to change the color of moving objects.<br/><br/></li><li><strong>Quickly Fix Color &amp;amp; Lighting Problems</strong><br/>Fast Correction of Common Problems<br/>ColorDirector comes with a complete set of tools to correct white balance, adjust tonality, and reduce artifact noise within your videos — especially useful for grainy low-light shots. Make precise adjustments to the RGB tonal curves to modify contrast and tint. You can also enhance visual details by adjusting the edge sharpness of objects. Exposure problems can be easily identified and fixed using the live histogram.<br/><br/></li><li><strong>Packed with Pro-Level Performance</strong><br/>Shorter Editing and Rendering Times<br/>The 64-bit, TrueVelocity 5 color grading engine allows ColorDirector to easily handle even the highest quality 4K video files. 120 / 240 fps high frame rate video can be smoothly previewed, adjusted, and then exported at the same frame rate, with no frame loss. A broad range of supported formats include new H.265 and XAVC-S. Round trip editing with PowerDirector ensures fast and efficient workflow.<br/><br/></li><li><strong>Consummate Color Creations</strong><br/>Color is a not only a fundamental element of graphic design, it is a key component of visual storytelling. The color grade of a video or movie can have subtle but profound effects on the way viewers perceive a scene. ColorDirector delivers powerful color grading tools that are easy to learn and put into effect.</li></ul>", "metacritic": null, "released": "2016-05-04", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/1e9/1e92696059ddd333b37d03ad0827b8bc.jpg", "website": "http://www.cyberlink.com/products/colordirector/features_en_US.html", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 289, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["CyberLink"], "genres": [], "publishers": ["Koch Media", "CyberLink"], "esrb_rating": null}