{"id": 17643, "slug": "world-of-subways-4-new-york-line-7", "name": "World of Subways 4 – New York Line 7", "name_original": "World of Subways 4 – New York Line 7", "description": "The series \"World of Subways\" features some of the most interesting Subway Routes of the world for the PC.<br/><br/>Once again World of Subways 4 comes back to New York, perhaps the most exciting city in the world. The whole gaming world takes place in the 70ies/80ies and is created in its typical look.<br/><br/>Start the trip from the green Flushing in Queens and go ahead until you reach the Times Square – the centerpiece of New York. The 15km-long Line 7 runs above ground for most of the route on the well-known N.Y. tracks. This time it´s your chance to discover the Big Apple from a track point of view while you are sitting comfortably at home in front of your PC. <br/><br/>Enjoy exciting missions either as the conductor or the driver. Due to the brand new Aggro-Mode (optionally turn on &amp; turn off) an evaluation of your handling is also possible during the drive. Always regard your speed, braking performance and stop position in the stations to keep your Aggro-display in the positive range. When the display is completely filled with red, your drive is cancelled.<br/><br/>WOS4 provides an interactive train depot with offices, a canteen and a garage. Talk to your colleagues at the interactive depot, listen to exciting adventures and try to manage them on your own. Expect tricky but most interesting missions, which will demand your driving skills.<br/><br/>Scheduled service with change of shifts, the original signal system and the interactive depot make the fourth part of the series as realistic as never before! Board the train now!<br/><br/><br/><br/><ul><li>21 original subway stations<br/></li><li>Eyeshot up to 4 km<br/></li><li>playable drivers and conductors <br/></li><li>interactive depot <br/></li><li>80% above ground and over the rooftops of the city<br/></li><li>new Aggro - Mode for more fun <br/></li><li>exciting missions based on stories <br/></li><li>schedule rides with shift change <br/></li><li>life-like signaling system<br/></li><li>realistic KL-train traffic and dynamic passengers on platforms<br/></li><li>interactive 3D- driver cabin with all relevant operations<br/></li><li>with a screen for routes, stations and controlling<br/></li><li>interactive 3D-conductor cabin for the optional conductor mode</li></ul>", "metacritic": null, "released": "2015-03-23", "tba": false, "updated": "2019-08-28T22:10:15", "background_image": "https://media.rawg.io/media/screenshots/a0c/a0ce612a248646d0cc050580a290fbf2.jpg", "website": "http://www.world-of-subways.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 7, "beaten": 1, "dropped": 1}, "playtime": 2, "achievements_count": 40, "ratings_count": 1, "suggestions_count": 386, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["TML-Studios"], "genres": ["Simulation"], "publishers": ["Aerosoft"], "esrb_rating": null}