{"id": 17671, "slug": "remnants-of-isolation", "name": "Remnants Of Isolation", "name_original": "Remnants Of Isolation", "description": "Grand Prize Winner of the 2014 Indie Game Maker contest.<br/><br/>Magic is a curse. A plague upon the world and those that live in it. Those that are born with this curse unwittingly sap the mana from the earth they stand in. In order to prevent these abominations from draining away the world's lifeblood, they are locked away in a castle in an isolated dimension. It is in this castle that the cursed are to remain, removed from society so that their magic does not harm normal people. They are to be kept here for the rest of their miserable lives.<br/>At least, that's the way it should have been...<br/><br/>Suddenly, a loud crash is heard. A young girl, kept apart from the rest of the castle, looks up from the ground. The magical barrier that prevented her escape slowly dissipates. Standing up, she pushes open the gate and finds her first taste of freedom. Guide her as she teams up with a renegade mage boy to search for the truth behind the castle, her unique magic, and a way to escape.Features<ul><li>A simple, but deep Spell Fusion system that allows for lots of experimentation.<br/></li><li>A heavy atmosphere made from a somber soundtrack, terrifying enemies, and a powerful tale.<br/></li><li>Simple puzzles that rely on each character's field abilities.<br/></li><li>A variety of locations to explore.<br/></li><li>A twist on traditional turn-based combat via MP charging. <br/></li><li>Discover the tragic stories of the castle's inhabitants by piecing together bits of information found throughout the adventure.<br/></li><li>3 different endings affected by your actions.</li></ul>", "metacritic": null, "released": "2015-05-01", "tba": false, "updated": "2022-08-18T12:37:02", "background_image": "https://media.rawg.io/media/screenshots/1a5/1a5ce5092723113f39a39eba70b115e4.jpg", "website": "", "rating": 2.88, "rating_top": 4, "added_by_status": {"yet": 26, "owned": 394, "beaten": 1}, "playtime": 4, "achievements_count": 7, "ratings_count": 8, "suggestions_count": 354, "game_series_count": 0, "reviews_count": 8, "platforms": ["PC"], "developers": ["Team Isolation"], "genres": ["RPG", "Casual", "Indie"], "publishers": ["Degica"], "esrb_rating": null}