{"id": 176898, "slug": "tank-vs-cars", "name": "Tank vs Cars", "name_original": "Tank vs Cars", "description": "<p><b>BATTLE'S ON THE RISE</b></p><p>Take your tank through a course of intense action and shooting combat. A wrecked battlefield is waiting for you where you have to shoot as well as survived from the wild attack of machine guns fitted on different locations of realistic city. Let's start your shooter mission, operate the tanks of your choice and storm attack on the rival's cars, buses and other vehicles in the age of war. The Tank vs. Cars Battle provides you the real life physics of tank for the movement and damage mechanics in the battle arena. Show your conviction of shooting Open your fire while riding triple cannon jumbo iron tank on the road and destroy rivals cars with clever planning.</p><p><b>WAR OF TANK Vs. CARS</b></p><p>Take on the Roll of an expert iron tanks hero in an extreme simulation experience to ensure the death of your opponents. As a skilled shooter you need to be very precise while fighting with the opposite force in the battlefield. You have to continue the war with triple cannon jumbo tank equipped with two ace weapons of missiles and shoots. Fight through several difficult missions, eliminating light and heavy cars, trucks and vans in the game. Collect coins to earn money and gat more exciting rewards.</p><p><b>INTENSE MISSIONS</b></p><p>Your mission is to destroy cars and earn points to unlock next level of challenging missions. Jump into an arena of intense shooting, with stunning graphics and intuitive touch-screen controls. Do not show mercy on anyone in the battle and damage vehicles, Cars, Vans, buses, light pools, phone booths, umbrella and beach huts to make sure death of your rivals and get the winning post. </p><p><b>GAME FEATRUES</b></p> <ul><li>-HD Stunning Graphics with realistic sound effects </li> <li>-Extreme explosion effects </li> <li>-Challenging and intense missions of epic battle </li> <li>-Survive through the fire of machine guns </li> <li>-Classic navigational and shoot controls </li> <li>-Breathtaking visuals</li> <li>-Triple cannon jumbo tank for more efficient and fast shooting experience </li></ul> <p>Please rate us and give your valuable feedback for further improvements.</p> Follow us @ https://www.facebook.com/cogsoulsofts", "metacritic": null, "released": "2015-09-01", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/2a7/2a7ee3332ba857eaf15d2ddfd2d695f0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 85, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["CogSoul"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}