{"id": 176813, "slug": "whats-inside-2", "name": "Whats Inside", "name_original": "Whats Inside", "description": "What is inside an egg?\r\n<p>Listen here! What really is inside an egg? We don't know! Once we open the egg, all we see is a gooey...thing! Well, that's what this is for! Discover the SCIENTIFIC evidence of what really is inside an egg!</p>\r\nControls\r\n<ul><li>Left click to move the <strong>big box</strong> and <strong>whirly thing</strong><ul><li>When moving those <strong>important </strong>items <strong>right click</strong> to turn them on and off<ul><li>You can tell by the button, or when the <strong>whirly thing</strong> moves!</li></ul></li></ul></li><li>You see that control panel in the center? It does stuff, figure it out!</li><li>Apparently the egg doesn't like the machines to be in one place, move em around!<ul><li>It isn't too hard, our state of the art equipment will show where the asset wants the machines!</li></ul></li></ul>\r\nInstructions On Care\r\n<ul><li>Don't let him turn into <strong>melted goop </strong>or <strong>ice cubes </strong>again, we have plenty!</li><li>Everytime he gives you an item, please thank him</li><li>Watch out with the magic one! He's scary!</li></ul>\r\nWhat is this game?\r\n<p>Whats Inside is a fast paced strategy game game about incubating eggs, if you do it right, you get rewarded, if you don't you still get rewarded, with different prizes. What do I mean?</p>\n<p>Well, you can incubate it, boil it, and freeze it, depending on what you do with it you may get different rewards. Just remember to watch the egg!</p>\n<p>This game is both hard and easy, how so? You can't loose unless your trying to incubate and its temperature reaches less then satisfactory amounts. How is it so hard though? You have to watch where Mr. Eggo wants his fan/heater!</p>\n\n<p>Game by Jonathan Thums - StarKitten Studios</p>\n<p>Made for Weekly Game Jam, Week 45, Theme: Hatch an Egg</p>\n\n<p>Please Note: Expect there to be bugs, I am the only person working on this and without testers, can't always find said bugs, thanks!</p>", "metacritic": null, "released": "2018-05-19", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/45d/45d5a9455362635b2c88889231f68fc3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 23, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["starcritikal"], "genres": ["Action", "RPG", "Strategy", "Simulation"], "publishers": [], "esrb_rating": null}