{"id": 177, "slug": "seabeard", "name": "Seabeard", "name_original": "Seabeard", "description": "A WORLD OF ADVENTURE IN YOUR POCKET!<br/><br/>Follow in the footsteps of the great captain Seabeard and discover a giant ocean teeming with islands to explore! <br/><br/>Live life at your own pace and choose your own path - whether you have ambitions of being a world-famous chef, fearless archaeologist, or deadly warrior, you can realise those dreams.<br/><br/>Awarded “Game of GDC” by Touch Arcade.<br/><br/>WORLD IN YOUR POCKET<br/>Discover a rich, charming world that you can jump into anytime, anywhere. The oceans of Seabeard are filled with surprises around every corner.<br/><br/>MAKE NEW FRIENDS<br/>Meet the Doza, Yorubo and Nook tribes and the fascinating characters that inhabit Seabeard’s villages, farms, holiday resorts and dungeons. Seabeard’s “Perpetual Adventure Machine” will ensure that there is always a villager in need of your help.<br/><br/>RECRUIT AN EXPERT CREW<br/>Engage in a huge variety of activities: from sailing and fishing to combat and cookery. Build your team from a one-man band to a crew of legend!<br/><br/>REVIVE YOUR TRADING EMPIRE<br/>Set sail to discover lucrative trading routes and source rare and valuable items. Rebuild the legendary trading capital, Accordia, and hire the finest market traders.<br/><br/>CONQUER THE SEAS<br/>Set sail to encounter the challenges of the ocean, from feeding whales and rescuing shipwrecked passengers to battling with menacing sea monsters.<br/><br/>GET CREATIVE<br/>Whether building out your island to attract visitors, or dressing up your crew in outrageous styles, there are countless ways to personalise.<br/><br/>PLAY WITH YOUR FRIENDS<br/>Explore the Islands of your friends, trade with them and tell them what you think of their crew!<br/><br/>Seabeard is completely free to play, but some game items can also be purchased for real money. If you don&amp;#39;t want to use this feature, please disable in-app purchases. Seabeard requires an internet connection to play (3G or WiFi). iPod Touch (4th Generation) &amp;amp; iPhone 4 are NOT supported.<br/><br/>&amp;gt;&amp;gt; Install Seabeard today. It’s FREE!<br/><br/><br/>______________________________<br/><br/>Made by HandCircus, creators of the critically-acclaimed Rolando series for iOS and brought to you by Backflip Studios, makers of absurdly fun games like DragonVale and Paper Toss.", "metacritic": null, "released": "2014-12-10", "tba": false, "updated": "2023-02-09T02:31:55", "background_image": "https://media.rawg.io/media/screenshots/570/5701d30035ad2a8d460c3a73d8dfdbee.jpg", "website": "http://www.backflipstudios.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 3, "suggestions_count": 297, "game_series_count": 0, "reviews_count": 3, "platforms": ["Android", "iOS"], "developers": ["Backflip Studios"], "genres": ["Adventure", "RPG"], "publishers": ["Backflip Studios"], "esrb_rating": "Everyone 10+"}