{"id": 177068, "slug": "bumper-ball", "name": "Bumper Ball", "name_original": "Bumper Ball", "description": "<p>Bumper Ball is an attempt to bring back that couch multiplayer feeling, that screaming excitement you get from deflecting a winning goal and getting hit by your friend for cheating them from the match point.<br/> <br/> We want to create a game that's simple, entertaining and fun for everyone, so we came up with Bumper Ball.<br/> <br/> The game will be reliant on console controllers for movement, and that's it. All you have to do is move around the field and score your goals. The game is best played with four friends on one screen and the controllers allow you to play on either Xbox, Playstation or Windows Bumper Balls lack of asset junk and simplicity allows for a smaller file size so it can played on older gen consoles and computers. <br/> <br/> Simple right? Well, to mix it up a bit we'll be adding in obstacles to the levels like pits and rocks to impede your progress, different speed and hitting power for cars and watch out for the Ball receptacle, don't fall down otherwise you'll have to re-spawn and that delay could be costly! <br/> <br/> You can gun for the ball straight away with a speedy car or select a slower one and bash your opponents out of the way and go for a long shot with a heavier car.<br/> <br/> All in all it's up to you how you want to play the game, all that we want is for you and your friends to have fun!</p><p>At the moment, the only build is for Windows, but we'll be working on campatibilty for consoles over the next few weeks.<br/></p>", "metacritic": null, "released": "2015-11-15", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/163/16314def646dad4a1cad796a7ed02201.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 2, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Polygon Primitive"], "genres": [], "publishers": [], "esrb_rating": null}