{"id": 17706, "slug": "forge-quest", "name": "Forge Quest", "name_original": "Forge Quest", "description": "Forge Quest is a dungeon crawling rpg set in a voxel world. Explore the land full of chickens on a light hearted quest to become a hero. Delve deep into the randomly generated dungeons to battle monsters, find treasure and craft your equipment. Invite your friends to join your world and help you in your adventure.<br/><br/>Long after great wars ravaged the land of Shmoop, a balance has been reached as both sides agreed to regulate all hero and villain related activities. This system flourishes as it creates the economic stability the land needed, and from it the great bureaucracy rose to rule over the land.<br/><br/>After many years from the system's inception, you step onto the scene. A strapping young adventurer who, after being dropped off by your parents, set off to obtain your Hero license from the kingdom. Although eager to claim your title, your path is full of danger as you must first prove yourself in the dungeons below. You also soon learn that not everyone plays by the rules and what it means to become a hero is much more then just a signed paper.<br/><br/><ul><li>Play solo or network up to 4 players for co-op play<br/></li><li>Randomly generated dungeons with scaling difficulty<br/></li><li>Mix and match abilities from all 9 classes as you level<br/></li><li>Collect treasure &amp; forge gear into increasingly powerful items<br/></li><li>Diverse monster and bosses to conquer<br/></li><li>A light hearted story of adventure and what it means to truly be a hero.<br/></li><li>Voxel Chickens!</li></ul>", "metacritic": null, "released": "2015-05-29", "tba": false, "updated": "2019-08-28T22:10:13", "background_image": "https://media.rawg.io/media/screenshots/2ab/2ab65bce075d640b7df57f93595fc489.jpg", "website": "http://www.forgequestrpg.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 79, "beaten": 2, "dropped": 1, "playing": 1}, "playtime": 2, "achievements_count": 49, "ratings_count": 2, "suggestions_count": 282, "game_series_count": 0, "reviews_count": 2, "platforms": ["macOS", "PC", "Linux"], "developers": [], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": [], "esrb_rating": null}