{"id": 177183, "slug": "wild-rhino-city-rampage", "name": "Wild Rhino City Rampage", "name_original": "Wild Rhino City Rampage", "description": "<p>Another wild jungle adventure with mighty beast angry rhino in city with destruction and chaos missions in Wild Rhino City Rampage. Super addition in rampage games with monster predator. This crazy rhino is in fight and attack for survival in grand town. Rhino games were never been so thrilling and filled with adventure. Smash and attack powerfully, feel the thrill of being a powerful forest beast in this city rampage game which is the fusion of animal attack games. Create chaos and maximum destruction and damage everything in your way. Release your inner animal and be a mad rhino and crash and destroy vehicles with your powerful horns. It’s one of the most thrilling and adventurous 3D simulation games right now. Feel the rush of being a wild animal in astonishing visual effects.</p>\n<p>You have to decide the fate of this angry rhino beast came from wild jungle and ready for adventure fight for its survival. Crush and smash the vehicles into pieces. Act and attack quickly, because the swat team and commandos with special forces will try to stop you with shooting. In animal attack games with the angry rhino city revenge you will surely enjoy the all destruction and chaos missions. Combine your aggression with this wild rhino’s muscular form and super power! It’s a recipe for ultimate rampage. Play as a crazy and angry rhino and make the whole town run for its life! Behave like mad and wilder beast and cause ultimate demolition in the most modern city in the world. In this free to play action simulation game, you can freely roam around and attack people, destroy cars and knock things down. Show your anger with aggression and have fun smashing and crashing in rhino games.</p>\n<p>Wild Rhino City Rampage Features:</p>\n<p>✓ Be an angry rhino &amp; create chaos around the town.<br/>✓ Thrilling hunting challenges with amazing 3D gameplay.<br/>✓ Superb background music with big city environment.<br/>✓ Adventures filled with thrilling hunting challenges for rhino survival.<br/>✓ Easy controls to make your Rhino run, attack &amp; destroy.<br/>✓ Fast action packed gameplay with direction map.</p>\n<p>Combination of rampage games is here for the lovers of wild animal attack games.  You are an angry and vicious rhino looking to slaughter anyone who comes within your sight. Close in for the kill and attack! Hunt them all down with your sharp horns in lots of prey hunting missions. Download and enjoy Wild Rhino City Rampage which is best animal fighting simulation game of 2018.</p>", "metacritic": null, "released": "2018-04-25", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/431/431ecf0246e5317c8454485af877f3fe.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 140, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Tap2action"], "genres": ["Simulation", "Fighting"], "publishers": [], "esrb_rating": null}