{"id": 17717, "slug": "graviteam-tactics-operation-star", "name": "Graviteam Tactics: Operation Star", "name_original": "Graviteam Tactics: Operation Star", "description": "Graviteam Tactics: Operation Star is a sequel to Achtung Panzer: Kharkov 1943. It’s an Eastern Front war game with solid graphics and sprawling battlefields that really emphasizes the scope of WWII tank combat.<br/>Want to step into the role of a commander in the very heart of Kharkov’s defense? You'll have everything the officers had back then: tanks, guns, and fearless soldiers. The success of each opposing force hangs in the balance every day. Your decisions will determine who wins the Battle of Kharkov.<br/><br/><ul><li>8 operations for the Red Army and Wehrmacht.<br/></li><li>More than 60 detailed units of the Soviet Union, Germany and UK, including Pz IV \"Tiger\", MkII \"Matilda\" and KV-1 with various modifications.<br/></li><li>Huge realistic landscapes (over 260 sq km), reconstructed by the topographic maps and photo.<br/></li><li>Quick battle anywhere in the operation areas.<br/></li><li>Mod utility set and campaign editor.</li></ul><br/>Features:<br/><ul><li>High replayability and flexible AI. It chooses the best strategy based on behavior rather than a script. Scenarios can be replayed using different tactics, as though playing against a human opponent.<br/></li><li>Real soldier behavior: every soldier has several basic parameters, such as experience level, fatigue, and morale, which affect their behavior and effectiveness.<br/></li><li>Detailed recreation of weapons and realistic ballistics: bullets and projectiles follow accurate trajectories.<br/></li><li>Comprehensive vehicle damage system: engine, suspension, weapons, and aiming mechanisms can all be damaged separately, affecting the combat capabilities of the vehicle.<br/></li><li>Destructible environment: nearly everything can be blasted and destroyed, from ground terrain to houses and enemy defenses. All traces of previous battles remain on the battlefield.<br/></li><li>Dynamic day, night and weather effects, all of which affect combat through terrain traversability, battlefield visibility, hidden force capabilities, and more, smoke screens, light flares e.t.c.<br/></li><li>Military encyclopedia with 3D model viewer and detailed data on all units, describing their historical and in-game characteristics.</li></ul>", "metacritic": null, "released": "2014-02-11", "tba": false, "updated": "2019-08-28T22:10:12", "background_image": "https://media.rawg.io/media/screenshots/c41/c413527fbaf5dc2a26e98baa9faee5ee.jpg", "website": "http://graviteam.com/games/GTOS.html", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 44, "toplay": 1}, "playtime": 1, "achievements_count": 20, "ratings_count": 2, "suggestions_count": 409, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Graviteam"], "genres": ["Strategy"], "publishers": ["Strategy First"], "esrb_rating": null}