{"id": 177187, "slug": "100-code-shooter", "name": "100% code shooter", "name_original": "100% code shooter", "description": "<p>Elève Premium de Gamecodeur depuis 04/10/2017 en premium vie. Mais inscrit depuis mi juin 2017 avec 2 mois à vide. </p>\n<p>pseudo gamecodeur : madbox</p>\n<p>Langage : Lua</p>\n<p>Framework : Love 2d</p>\n<p>code by me avec un remerciement à la communauté pour son aide et son support  (en particulier : Jdalis, breakingbardo, vesgames, Asthego et tous les autres)</p>\n<p>Temps passé pour ce proto : 57 heures</p>\n<p>Très intéressé par le thème dans la mesure où je suis déchiré à l'idée d'apprendre aussi le digitalpainting pour créer mes \"mesh\" ou alors me focus uniquement sur le code pour pondre du proto. (sujet qui est loin d'être clos dans mon esprit nébuleux)Mais  je voulais vraiment voir le principe des canvas dans la formation et c'est chose faite donc merci. Toutefois canvas ou pas je ne sais toujours pas donné une perspective à mes images(ombres, profondeur etc)</p>\n<p>postmortem : Premier point comme tout le monde, je suis très fier de ce que j'ai accompli en 6-8 semaines de formations à raison de 2-4 heures par  jour.</p>\n<p>Une certaine frustration celle de vouloir être déjà un développeur complet et accompli. J'ai mis trop de temps à résoudre certains problèmes et cela a grandement affecté ma vitesse de \"production\". Mais c'est en forgeant que l 'on devient forgeron comme dit l'adage. On verra donc dans 2-3 mois ce que je peux produire dans le même laps de temps.</p>\n<p>Il reste quelques bugs sur le nettoyage des tirs et les tirs DCA du boss durant sont apparition. J'ai voulu créer le canvas tourelleChar plus large que le chassiChar mais alors mon canvas chassis se met à clignoter. Quelques questions qui restent ouvertes (rotation d'image et associer un sprite de tir au rayon de cette image) résolu sur le char mais pas les DCA du boss. Et un souci pour appeler un tir sur un modulo 90 en math.abs. J'ai mis tous ces éléments que je n'arrive pas à maîtriser dans mon One Note et vais le soumettre à la communauté. Le duo lua love est vraiment super et je vais compléter/ améliorer ce shooter au fil des ateliers pour peut être en faire un jeu complet et vendable dans 1 à 3 ans.  Mais il me tarde de voir les trésors que réserve le C# monogame.</p>", "metacritic": null, "released": "2017-11-28", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/382/3829873b9c1b8c067ed32fb5f9291443.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 37, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["madhack"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}