{"id": 17710, "slug": "bumbledore", "name": "Bumbledore", "name_original": "Bumbledore", "description": "Throw fireballs, call down lightning, and summon volcanoes to defend your hive from annihilation!<br/><br/>For years you've trained under the great wizard Bumbledore in the hallowed halls of Honeyhold Keep, preparing for a day like this. Beezelbug, the most promising and ambitious young wizard of his generation, has returned from a long journey through distant lands and dark teachings. He brings with him an army of ferocious bugs, their greedy minds filled with promises of magical power. Your master has gone missing.  Can you repel Beezelbug's evil horde?Key features:Master the flows of magic!<br/>Clear grouped invaders with explosive fireballs and dismantle tight ranks with piercing ice spears. Fling ball lightning into loose enemy lines and summon bolts from the sky to interrupt airborne ambushes. Time meteors carefully to maximize destruction or hold invaders in place with magical blades of grass. Channel magma from the earth to melt enemy armor.<br/><br/>Conquer stages with logic, skill, and force!<br/>Develop a game plan to exploit your enemies' weaknesses. Aim your spells carefully for maximum impact. Shatter ice bugs and knock fireflies into enemy ranks to create devastating combos. Clear dozens of enemies with a perfectly placed spell to earn bonus points and unlock expert stages.", "metacritic": null, "released": "2012-03-15", "tba": false, "updated": "2019-09-17T13:16:41", "background_image": "https://media.rawg.io/media/screenshots/4db/4db6c476fca6248c9f19d6f0187b6823.jpg", "website": "http://bumbledore.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 98}, "playtime": 1, "achievements_count": 13, "ratings_count": 1, "suggestions_count": 386, "game_series_count": 0, "reviews_count": 1, "platforms": ["macOS", "PC"], "developers": ["Nimbly Games"], "genres": ["Strategy", "Casual", "Indie"], "publishers": ["Nimbly Games"], "esrb_rating": null}