{"id": 17719, "slug": "big-journey-to-home", "name": "Big Journey to Home", "name_original": "Big Journey to Home", "description": "Welcome to the world of adventures! <br/>You play as Jake, a simple guy who accidently got into trouble. What will happen to him, how he will behave, will he get home or not, all that depends on you. You will encounter a variety of creatures along your way, from roaches to huge scorpions, lizards and even small hamsters! Apart from living beings, you will see a variety of complex mechanisms. To overcome snow, forests, deserts and underground areas, you will require a good weapon. Though you already have that - a well-sharpened blade that will slice (almost) every monster.<br/>The game requires you to plan every step, so that monsters won't have you for dinner. However, if you stand still, the monsters won't touch you. The \"Hardcore\" mode won't let you sleep, though, it will require your full attention.<br/>If a friend of yours keeps bothering you, you can play a separate story about Jake and his brother together. You can walk through the same far-away places and see the same monsters, however, they will behave differently. If your friend gets lost, you will be able to show him where to go using the built-in chat and marker.<br/>The game has an achievement system - try to unlock them all! If you want to stay in this unusual world, you can extend the fun with usermade levels that people just like you can build. Thanks to the convenient level download system, you won't be leaving the game for a long time.<br/> A brief history of development <br/>The game was developed for the duration of five years, gradually improving. Different people contributed to the game and the development team changed over time. Some people worked on level design, some others did art. As of right now, the game has only one developer left: Vyacheslav \"Silver Sword\" Mironov. I have started this game and I have led it to its release.<br/> Key features of the game <br/><ul><li>Learn how Jake ended up in the forest and help him back home<br/></li><li>Travel through dark forests, undergrounds, cold ice caves and hot deserts!<br/></li><li>Solve unique puzzles destroying wile monsters along your way!<br/></li><li>Play co-op with a friend! Learn how fun it is to solve puzzles together.<br/></li><li>Prove that you are the best! Leaderboards, achievements and a special difficulty setting will help you in this.<br/></li><li>Create your own puzzles using a built-in level editor and share them with the world.</li></ul> <br/>Note: To use online functionality of the game, you require a BJtH-Online account.You can create one from the game, and it is completely free.", "metacritic": null, "released": "2015-08-20", "tba": false, "updated": "2019-08-28T22:10:12", "background_image": "https://media.rawg.io/media/screenshots/aa0/aa0edc1c856d5a50e8533e1706213743.jpg", "website": "http://bigjourneytohome.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 80}, "playtime": 6, "achievements_count": 31, "ratings_count": 3, "suggestions_count": 215, "game_series_count": 0, "reviews_count": 3, "platforms": ["macOS", "PC", "Linux"], "developers": ["The Light Sword Team"], "genres": ["RPG", "Strategy", "Indie"], "publishers": ["The Light Sword Team"], "esrb_rating": null}