{"id": 1771, "slug": "amoebattle", "name": "Amoebattle", "name_original": "Amoebattle", "description": "Real Time Strategy on a scale you&amp;#39;ve never seen before.<br/>Lead your squad of amoebas to battle in this imaginative and acclaimed RTS.<br/><br/>&amp;quot;Succeeds wonderfully at creating a touch-based RTS for iOS.&amp;quot; -TouchArcade <br/><br/>&amp;quot;A unique spin on a classic genre, and one that’s more than worth any interested iOS gamer’s time.&amp;quot; - 148Apps<br/><br/>&amp;quot;Clearly made by people who genuinely wanted to make something interesting for the platform, and they&amp;#39;ve succeeded.&amp;quot; -Kotaku [Gaming App of the Day]<br/><br/>&amp;quot;Tackles the hard-wired challenges of mobile RTS gaming with elegance and sophistication&amp;quot; -Modojo<br/><br/>&amp;quot;An excellent RTS...something that a lot of RTS fans have dreamed about ever since the iPad was first announced.&amp;quot; -TUAW [Daily iPhone App]<br/><br/>&amp;quot;A true gem of a title that earns every part of the price tag attached to it and then some.&amp;quot; -Gamezebo <br/><br/><br/>MAJOR WARFARE. MICROSCOPIC SCALE. <br/>The fate of our biological future lies in your hands. Command a squad of amoebas against a fast spreading infection that threatens the microscopic world. Built from the ground up for the mobile touchscreen, Amoebattle delivers a highly unique RTS experience for newcomers and veterans alike. <br/><br/>DIVE INTO THE UNSEEN WORLD <br/>Discover nine types of creatures, from the fast moving Viper to the indestructible Ursa. Journey through the beautiful yet alien landscapes, featuring a remarkable watercolor/pixel hybrid art style. <br/><br/>TURN THE TIDE OF BATTLE <br/>Mutate into any other amoeba to fit your playstyle or try new tactics. Turn the tide of battle with powerful Probes, such as the Cryoprobe that slows enemies to a crawl. <br/><br/>ALL THE THRILLS... <br/>Stop the infection and destroy its source in the varied and intense twelve mission campaign. Show your dominance by conquering the challenging Game Center Achievements. <br/><br/>AND ALL THE FRILLS <br/>Universal, iCloud Enabled, iPad &amp;amp; iPhone Retina Display, intuitive Multi-Touch controls, and AMI - your neighborhood friendly software assistant. <br/><br/>Amoebattle brings the action and excitement of the RTS to the iPad, iPhone, and iPod Touch to deliver an experience unlike anything else.", "metacritic": null, "released": "2012-04-04", "tba": false, "updated": "2019-10-22T14:27:49", "background_image": "https://media.rawg.io/media/screenshots/b39/b396dcfee4c7fa94eaf23638df0648d0.jpg", "website": "http://www.amoebattle.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 346, "game_series_count": 0, "reviews_count": 0, "platforms": ["Nintendo DS", "iOS", "Android"], "developers": ["Grab Games", "Grab"], "genres": ["Action", "Strategy"], "publishers": ["LLC", "Grab"], "esrb_rating": "Everyone 10+"}