{"id": 17738, "slug": "avenging-angel", "name": "Avenging Angel", "name_original": "Avenging Angel", "description": "Overview:<br/>Avenging Angel is a story-driven FPS/Adventure game set in a post-apocalyptic steam-powered world. <br/><br/>The story takes place in Northern City States, in a post-apocalyptic steampunk setting, roughly 10000 years from our current day and age, where 21st Century has not only passed from history to legend, but also from legend into myth. You are an Associate of the Inventors Guild, a freelancer/adventurer, dropped on an island in the Atlantic Ocean on a routine maintenance job. As you venture through the island, it becomes clear that there is nothing remotely routine about this mission as you are pulled into the web of personal, international, as well as metaphysical, conflict and conspiracy. Decipher forbidden history, learn about forgotten tragedy, and in the end, learn something about yourself. Key Alpha Features:<br/><ul><li>A story-driven adventure FPS set in a steampunk world. <br/></li><li>Interact with NPCs (with full voice over) to take on quests to progress in the story or discover new locations on your own. <br/></li><li>Hours of gameplay.<br/></li><li>Explore, interact, and fight your way through the island to discover its history and purpose.<br/></li><li>Dual-wield powerful weapons, both melee and projectile. Gun down your enemies with pistols, wreak havoc with a grenade launcher, or do both, at the same time. Choose any combination of weapons you like.<br/></li><li>A multitude of enemies: deranged automatons, malfunctioning cyborgs, and science projects gone wrong.<br/></li><li>Equip and mod your \"Goggle Glass\" to discover hints and secrets invisible to the naked eye. <br/></li><li>Download information and read journals from SoulFire terminals and \"Orbnals\". Discover and read notes, books, and new crafting and modding recipes. <br/></li><li>Mod your weapons into more powerful versions and discover new \"Goggle Glass\" features.<br/></li><li>Collect and utilise power-up potions, or discover ingredients and craft them yourself using alchemy. </li></ul>What we wish to bring you during development:<br/><ul><li>A huge underground facility to explore and new above-ground areas<br/></li><li>More quests<br/></li><li>More enemies<br/></li><li>New weapons, including the fabled Gun Blade <br/></li><li>More neutral/friendly NPCs with full voice-over and subtitles<br/></li><li>A second playable character with a slightly different storyline<br/></li><li>Fast travel system<br/></li><li>More crafting and modding recipes<br/></li><li>Lots more ingredients and parts<br/></li><li>Wildlife you can hunt for alchemy ingredients <br/></li><li>A battle arena, which can be also accessed from main menu after unlocked in game<br/></li><li>A mini-game to unlock unique weapons and power ups<br/></li><li> Multiple endings depending on player character and choices made during the game<br/></li><li>Achievements <br/></li><li>Full Oculus Rift compatibility (Please note this is not available in Alpha) </li></ul>This is what people said about Avenging Angel demo:<br/>Dark Amber Softworks have created a beautiful world, full of mystery and wonder. -Calum Fraser, Alpha Beta Gamer <br/><br/>...But I don´t mind having a lot of Steampunk games around, as long as the games are really good and well made. <br/>And that seems to be the case with Dark Amber Softworks Steampunk action/adventure game \"Avenging Angel\". -Robin E, The Gaming Ground <br/><br/>Steampunk Beauty -Flog, Are You Gaming? <br/><br/>...What I do know is that this is a rather good looking FPS that is set in a steampunk world and is boasting such features as dual-wielding and an “interactive story” that includes a large amount of exploration. -Matt Chelen, Regretzer <br/><br/>A great addition to your FPS collection. -Alexandru Niculaita, Softpedia <br/><br/>Avenging Angel is a very pretty single-player first person action adventure game. -@dakonblackrose <br/><br/>Here is a game that really comes from the heart. -Moni, Zockwork Orange", "metacritic": null, "released": "2015-06-01", "tba": false, "updated": "2019-08-28T22:10:12", "background_image": "https://media.rawg.io/media/screenshots/f91/f91d845a7196993b1524c11764a5f11c.jpg", "website": "http://www.avengingangelgame.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 54, "toplay": 1, "dropped": 1}, "playtime": 4, "achievements_count": 15, "ratings_count": 1, "suggestions_count": 457, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Dark Amber Softworks"], "genres": ["Action", "Adventure", "RPG"], "publishers": ["Dark Amber Softworks"], "esrb_rating": null}