{"id": 177360, "slug": "souper-quest", "name": "SOUPer Quest", "name_original": "SOUPer Quest", "description": "SOUPer Quest\r\nC'est dans les vieux pots qu'on fait la meilleure soupe\r\n<p>Vous incarnez le héros de la soupe. Armé de votre spatule, vous devez explorer cette terre dans le but d'obtenir la spatule ultime et de pouvoir touiller le chaudron de la vie.</p>\r\nPot-au-Jeu\r\n<p>Ce prototype de jeu a été réalisé seul, durant une gamejam de 60h. Elle avait pour thème \"Faire du neuf avec du vieux !\".\r\n<br/>C'est ma toute première experience en création de jeu et en gamejam. Il a donc fallu un temps pour me former à Godot et apprendre au fur et à mesure de produire le jeu. L'essentiel à retenir de ce prototype est qu'il respecte le thème de la gamejam, de part sa mécanique principale.</p>\r\nAbsent pour manque de temps\r\n<ul>\n<li>Ennemis</li>\n<li>Sons</li>\n<li>Menu</li>\n<li>Donjon</li>\n<li>PNJ</li>\n<li>Sauvegarde</li>\n</ul>\r\nInformations Techniques\r\n<p>Le jeu fonctionne à la manette et peut aussi être contrôlé au clavier, avec les flèches directionnelles ou ZQSD ainsi que Espace ou Entrée.</p>\n<p>~~~</p>\r\nSOUPer Quest\r\n<p>You play the hero of the soup. Armed yourself with a spatula, you must explore this land in order to obtain the ultimate spatula be able to toss the cooking pot of life.</p>\r\nPot-au-Jeu\r\n<p>This prototype of game has been made alone, during a 60h gamejam. It's theme was \"Making some new with some old !\".\r\n<br/>It is my very first game creation and gamejam experience. There had to be a time to learn Godot during the development process. The main point to retain of this prototype is it respects the theme with its main mechanic.</p>\r\nMissing due to lack of time\r\n<ul>\n<li>Enemies</li>\n<li>Sounds</li>\n<li>Menu</li>\n<li>Dungeon</li>\n<li>PNJ</li>\n<li>Save</li>\n</ul>\r\nTechnical Informations\r\n<p>The game works with a controller and it can also be controlled by a keyboard with directional arrows or ZQSD and Space or Enter.</p>", "metacritic": null, "released": "2018-07-22", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/b10/b100a25336b7b242eac56a6f74bdfeb9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 11, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux", "Web"], "developers": ["zankia"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}