{"id": 17761, "slug": "smugglers-5", "name": "Smugglers 5", "name_original": "Smugglers 5", "description": "<strong>Smugglers 5 </strong> is the fifth installment in the <strong>turn-based </strong> single-player space trading game series. Will you be a greedy trader, an ambitious fleet pilot or a ruthless pirate? Board enemy ships, manage factories, conquer star systems and forge your own galactic empire - ultimately, your actions will have an impact on a galactic scale.<br/><br/><strong> 'It’s basically Elite… but turn-based. [...]' - Rockpapershotgun.com blog (Smugglers 4)</strong><br/><strong> 'Smugglers 5 is an impressive and exceedingly addictive game.[...]' - darkzero.co.uk </strong><br/><strong> 'I’ve been playing Smugglers' games since I was a kid[...]' - Christian T. (a happy customer) </strong><br/>The galaxy is at war - the Federation, the Coalition, the Outer Rim systems and the criminal Syndicate battle for control. It's a dangerous life for a pilot on the front lines, but it can also be a lucrative one - are you an honest trader, or does smuggling illegal goods sound more profitable? Will you join the war effort for your faction, set up your own empire or simply explore the galaxy?<br/><br/>The fifth instalment in the long-running Smugglers series features a completely revised turn-based combat system and a range of new ships to fly, as well as <strong> a host of exciting features: </strong><br/><br/><ul><li>\tExplore the galaxy through a fast turn-based travel and combat system<br/></li><li>\t4 factions; 6 professions with new, unique skill trees; 100+ different skills and a revised skill system<br/></li><li>\t30+ spaceships and encounters ranging from fighters up to battleships, cruise missiles and star bases <br/></li><li>\tNon-linear war and campaign system. You can influence the war!<br/></li><li>\tManage a crew, board enemy ships, become Admiral and command whole fleets<br/></li><li>\tPlunder planets and pirate outposts, conquer space systems and even rule your own empire!<br/></li><li>\tSupply and demand based trading with the storyline and campaign influencing prices<br/></li><li>\tMore than 80,000 words of interactive non-linear storylines (that´s about the size of two novels)<br/></li><li>\tAdvanced text generation technology and new planet exploration short stories make every game different.<br/></li><li>\tMarry a beautiful wife and have children<br/></li><li>\tOptional compatibility mode to allow blind players to enjoy the game<br/></li><li> <strong>and much more ..</strong>.</li></ul><br/>The <strong>six most important new features </strong> compared to Smugglers 4:<br/><ul><li>\tYou can now start and rule your own empire<br/></li><li>\tManage your own factories or pirate outposts<br/></li><li>\tRaid and plunder planets or pirate outposts<br/></li><li>\t80,000 words of new and dynamic short stories (the equivalent of a full length novel).<br/></li><li>\tCompletely revised skill and combat system<br/></li><li>\tPlay as an independent adventurer - or join the military</li></ul><br/><strong> 'TOP 1 bestselling RPG game' - GOG.com from 16th to 24th March 2014</strong><strong> 'TOP 6 bestselling INDIE game' - GOG.com from 16th to 24th March 2014</strong><strong> 'TOP 3 bestselling PC game' - Impulsedriven.com in May 2011 (Prequel Smugglers 4) </strong><strong> 'TOP 1 bestselling indie game' - Direct2Drive.com in June 2011 (Prequel Smugglers 4) </strong><br/>There's a ship in the hangar and the stars are calling to you. Don't keep them waiting.", "metacritic": null, "released": "2014-04-11", "tba": false, "updated": "2019-09-17T11:22:06", "background_image": "https://media.rawg.io/media/screenshots/e22/e22f719470ffbc0a259385d34db52544.jpg", "website": "http://www.nielsbauergames.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 138}, "playtime": 1, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 295, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "macOS"], "developers": ["Niels Bauer Games"], "genres": ["RPG", "Strategy", "Simulation", "Indie"], "publishers": ["Niels Bauer Games", "Highcliffe Media Publishing"], "esrb_rating": null}