{"id": 17763, "slug": "cosmochoria", "name": "Cosmochoria", "name_original": "Cosmochoria", "description": "Cosmochoria is a love letter to old-school action / arcade games like Asteroids, Sinistar, and Mario Bros. Cosmochoria is a mesmerizing way to kill hours: hopping between planets, unraveling forgotten mysteries, killing aliens &amp; giant space monsters and planting mysterious seeds to sprout new life across a long-barren galaxy.<br/><br/>You play the role of a tiny pink naked cosmonaut who 'finds himself' in a distant galaxy. While no story is immediately apparent, consecutive games will begin to reveal some of the deeper mysteries surrounding the universe around you.<br/><br/>You are free to roam the galaxy in search of these secrets, or to remain on a single planet, establishing a home base to fight aliens and tend to your galactic garden.<br/><br/>Game Features: <br/><ul><li> So much Pew Pew Pew High Score arcade action. <br/></li><li> Super secrety mystery STEAM ACHIEVEMENTS for unlockable braggeryness.<br/></li><li> Plant seeds to sprout new plants, new plants give more seeds.<br/></li><li> Grow plants to fill dead planets with your Love Juices.<br/></li><li> Massive UltraNova Explosions Like from Contra III.<br/></li><li> Build Towers like a construction BOSS.<br/></li><li> Procedurally generated galaxy. Each game is unique like a snowflake. <br/></li><li> Aliens poop crystals from their bums before they explode. <br/></li><li> Spend said poop crystals at the upgrade shop to improve your abilities. <br/></li><li> Radical interstellar screen sized boss fights. <br/></li><li> Mini-Map Upgrade plots your cosmic journey. <br/></li><li> Warping around the whole place like U really mean it.<br/></li><li> Fresh electronic soundtrack by Ilkae, Zebra &amp; Mantrakid. <br/></li><li> Hand Crafted Vector illustration stylee. <br/></li><li> Form Deeply Special Bonds with Secret Cartoon Animal Pets.<br/></li><li> Befriend an old hermit alien at his wooden shack. <br/></li><li> Discover hidden artifacts strewn across the galaxy. <br/></li><li> Fire Bullets into a whole bunch of Bad Guy Faces.<br/></li><li> Float NAKEDLY all over Outer Space!! </li></ul>", "metacritic": null, "released": "2015-04-27", "tba": false, "updated": "2019-09-17T09:35:54", "background_image": "https://media.rawg.io/media/screenshots/d60/d609741f3ad49b75cdc1cdc81b9bc739.jpg", "website": "http://www.cosmochoria.com", "rating": 3.0, "rating_top": 4, "added_by_status": {"yet": 9, "owned": 187, "beaten": 2, "toplay": 1, "dropped": 3, "playing": 1}, "playtime": 4, "achievements_count": 28, "ratings_count": 6, "suggestions_count": 181, "game_series_count": 0, "reviews_count": 6, "platforms": ["macOS", "PC", "Linux"], "developers": ["Nate Schmold"], "genres": ["Action", "Adventure", "Strategy", "Indie"], "publishers": ["30/30"], "esrb_rating": null}