{"id": 177795, "slug": "simcamping", "name": "SimCamping", "name_original": "SimCamping", "description": "<p>- Elève Premium de Gamecodeur depuis 9 mois</p>\n<p>- Langage et Framework utilisé : LUA / LOVE2D</p>\n<p>- Code par moi même<br/>- Graphismes réalisés par moi même avec Pyxel Edit<br/></p>\n<p>- Utilisation de librairies et codes externes : Non</p>\n<p>- Temps passé : une vingtaine d'heure.</p>\n<p>- Pour ce thème j'ai mieux organisé mon code en découpant en plusieurs fonctions qui m'ont permis de moins me perdre au fur et a mesure que le programme se complexifiait. </p><p>- Travailler sur ce thème a été très enrichissant. J'ai réalisé que programmer un jeu de gestion / simulation n'est pas simple car il y a de nombreux paramètres à gérer. Du coup, malgré le nombre important d'heures passées sur le code, ma simulation de camping est très basique et il y aurait beaucoup de choses encore à ajouter. Je me suis donc plutôt concentré sur l'aspect simulation que sur l'apparence du jeu.</p><p>Explication du jeu :</p>\n<p>Le facteur important de cette simulation est l'indice de qualité de l'emplacement et l'indice de satisfaction des campeurs qui va dépendre de l'environnement (distance des sanitaires, verdure et autres campeurs à proximité.</p><p>Les campeurs restent le temps de leur séjour mais peuvent repartir plus tôt que prévu si ils ne se plaisent pas (en lien avec la qualité de leur emplacement)</p>\n<p>L'aspect interface est assez sommaire. On peut sélectionner et placer des éléments et les supprimer avec la tuile \"terre\" (on ne peut pas supprimer un emplacement qui n'est pas vide de campeurs). Pour les blocs sanitaires, on peut les regrouper ensemble pour former un sanitaire plus grand. Idem pour la piscine.</p>", "metacritic": null, "released": "2018-05-27", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/a28/a28b12d35adf7d48685a0cd5c3eed386.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 5, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MickGames"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}