{"id": 17794, "slug": "betrayer", "name": "Betrayer", "name_original": "Betrayer", "description": "<p>Betrayer is a first-person horror game developed by Blackpowder Games. </p>\n<h3>Plot</h3>\n<p>The game is set in the 17th-century state of Virginia. The protagonist awakes on a shore with no memory of the events leading him here. He goes to Fort Henry which appears to be completely abandoned. The whole colony is actually abandoned, yet there are hostile beings whose bodies consist of burning embers. The protagonist goes on to seek answers about what actually happened in the colony.</p>\n<h3>Gameplay</h3>\n<p>Betrayer heavily relies on stealth in its gameplay. There are no clear paths or objective for the players to follow. This was made specifically to deprive the players of any sense of direction and encourage exploration of a monochrome game world. It is essential to listen to specific sounds in the game, as some of them will guide the players towards a clue or an important item. The clues are documented and put in your inventory upon picking them up. </p>\n<p>Upon encountering the enemies, the best strategy for the player is to hide in the high grass, spectate the enemy movement and pick the right moment to execute a stealth kill. Sound plays an important role here too, as any sound the players make in the grass will attract some unwanted attention, so it is essential to time your movement with the wind gusts. The players have access to a wide variety of weapons, such as pistols, muskets, tomahawks, and bows. Upon death, the players leave all their items at the place of death and can retrieve them.</p>", "metacritic": null, "released": "2014-03-23", "tba": false, "updated": "2024-04-12T08:29:40", "background_image": "https://media.rawg.io/media/screenshots/830/8308df0cd9b070e63c13b4392b57d8a8.jpg", "website": "http://www.BlackpowderGames.com", "rating": 3.25, "rating_top": 4, "added_by_status": {"yet": 89, "owned": 1308, "beaten": 37, "toplay": 13, "dropped": 47, "playing": 5}, "playtime": 3, "achievements_count": 21, "ratings_count": 96, "suggestions_count": 581, "game_series_count": 0, "reviews_count": 97, "platforms": ["PC"], "developers": ["Blackpowder Games"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Blackpowder Games"], "esrb_rating": null}