{"id": 17805, "slug": "epoch-2", "name": "EPOCH", "name_original": "EPOCH", "description": "<strong>EPOCH - Post-apocalyptic Robot Combat</strong><br/>Get ready for post-apocalyptic robot combat! Follow the story of EPOCH, a guardian robot on a quest to fulfill his primary function in a world blasted by war. Use your quick reflexes, combat skills and tactical thinking to dodge, trick and blast the hordes of other robots in your way. Dodge, crouch and leap to avoid enemy fire. Spray bullets, fire Missiles, launch devastating Countermeasures, and activate powerful Boosters. Hone your skills in the multi-level Campaign, and then put them to the test in the endless Arena mode.UNRAVEL THE MYSTERYFollow the echoes of a lost civilization in a visually-stunning post-apocalyptic world where only robots survive to fight a never-ending war. Fight towards your goal and piece together the fragments to reveal exactly what happened when the old world ended. Is this the dawn of a new Epoch? And how can you find the one person you were originally assigned to protect?CHOREOGRAPH THE ACTIONControl your Guardian Robot with mouse and Keyboard or Controller. Make split-second tactical decisions, take cover, select targets, dodge incoming fire, utilize special abilities, and launch countermeasures!DESTROY, SALVAGE AND UPGRADEBattle escalating waves of robots in arena-style combat, and upgrade yourself with pieces torn from your fallen enemies! Configure your robot with dozens of weapons, armors, boosters and counters.IMMERSIVE SINGLE-PLAYER CAMPAIGNFight in multiple locations across a vast and ravaged city, and gather fragments of the past with logs from a cast of characters, each with their own perspective on the apocalyptic events that destroyed a once-proud civilization.ENDLESS ARENA MODEChallenge yourself and your friends to see who can get the top score against an endless horde of robots.New Graphics, Controls and Interface specifically for PC.<br/>EPOCH has been redesigned to be a fully featured PC Arcade shooter. We have been working hard to include the following new features;<br/><ul><li>Steam Leaderboards and Achievements. <br/></li><li>Mouse and Keyboard controls with keybinding <br/></li><li>Full Controller support </li></ul><br/>We have completely overhauled EPOCH's graphics to use the full rendering power of the Unreal Engine 3 on PC !<br/><ul><li>Dynamic Lighting and Atmospherics, Bloom, DOF, Motion Blur<br/></li><li>All surface shaders recreated for D3D<br/></li><li>Overhauled VFX, including Physics particles.<br/></li><li>Destroyable cover<br/></li><li>Fullscreen, Widescreen and Native / Multi resolution support<br/></li><li> Graphics options settings</li></ul>Follow us<br/>http://www.uppercut-games.com<br/>http://www.facebook.com/uppercutgames<br/>https://plus.google.com/112451516522474363004/<br/>http://twitter.com/UppercutGames", "metacritic": null, "released": "2011-11-10", "tba": false, "updated": "2019-10-22T13:59:47", "background_image": "https://media.rawg.io/media/screenshots/0db/0db0e041544698144ff26b0ccd06960b.jpeg", "website": "http://www.uppercut-games.com/EPOCH/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 4, "owned": 68, "beaten": 3, "toplay": 2}, "playtime": 3, "achievements_count": 24, "ratings_count": 2, "suggestions_count": 623, "game_series_count": 1, "reviews_count": 2, "platforms": ["Android", "PC", "iOS"], "developers": ["Uppercut Games", "Uppercut Games Pty"], "genres": ["Action", "RPG", "Indie"], "publishers": ["Uppercut Games", "Uppercut Games Pty"], "esrb_rating": null}