{"id": 178029, "slug": "villa-craft-survival", "name": "Villa Craft Survival", "name_original": "Villa Craft Survival", "description": "<p>Villa Craft Survival is a beautiful game with a 3d cube world.Creative and building aspects of the Villa Craft enable players to build constructions out of different cubes in a 3D procedurally generated world.<br/><br/>There are two game modes:<br/><br/>Survive:<br/>In this mode you can find monsters, which spawn depending on the difficulty, so player has to build shelter to stay alive at night. To stay alive, player can craft armor to reduce damage from enemies’ attacks.<br/>Player has a hunger bar which must be filled by eating food in-game. Weapons such as swords, bows and axes can be crafted to kill enemies and other animals easier.<br/>Player may gather resources to craft tools, such as axes, pickaxes, dig soil and ores. Tools made of ores like Gold, Iron or Diamond can be used more extensively. It takes longer to break these tools.<br/><br/>Creative:<br/>Player in the Creative mode has access to all of the resources and items in the game. Player is also able to fly around the game world. In the Creative mode, player doesn’t take damage, and does not starve. The Game mode urges player to focus on creating huge buildings inside the world.<br/>If you find all items in the Creative mode and see the world from the bird's-eye view you can change the type of the world into Survive. It is also possible to change the type of the strange world from Survive to Creative, if you don’t want to fight against characters and your passion is creating and building.<br/>There are a lot of different alien characters in the game. You have to notch and to craft a lot of things to be successful in these cube worlds.</p>", "metacritic": null, "released": "2018-01-25", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/e09/e097d639c1883e6e3d59f0d04ad1300c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 103, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["jaiparkash"], "genres": ["Action"], "publishers": [], "esrb_rating": null}