{"id": 17807, "slug": "necrovision", "name": "NecroVision", "name_original": "NecroVision", "description": "War is Hell. NecroVision is a first-person shooter that takes gamers across the frantic battlegrounds of World War I and into a dark underworld of vampires, demons and dark magic.<br/>Seeking adventure, young American Simon Bukner joins the British army in war-torn Europe of 1916. During a particularly ferocious battle, Bukner and his battalion are pushed into a series of dark trenches where they encounter mysterious phenomenon. As they move through the labyrinth they discover that there is a greater evil hiding underneath the battle-fields of the Great War — an evil that is forcing its way into our world and threatens to wipe out humanity. In the depths of this newly discovered underworld, Bukner must confront the dark forces and fight for the survival of mankind.<br/><br/> <ul><li>An engrossing storyline blends elements of a traditional war shooter with magic and the supernatural world <br/> </li><li>Players fight with authentic WWI era weapons, powerful magic artifacts and vampire powers <br/> </li><li>Hordes of enemies that include humans, demons and vampires <br/> </li><li>Massive, brutal boss battles <br/> </li><li>Intense, fast-paced FPS combat stands out from the trend of plodding shooters <br/> </li><li>Battle online with up to 16 players <br/> </li></ul>", "metacritic": 63, "released": "2009-02-20", "tba": false, "updated": "2024-04-12T08:21:00", "background_image": "https://media.rawg.io/media/screenshots/c0d/c0d01bcd66859c19845efb4f52ad5ca7.jpg", "website": "http://www.1cpublishing.eu/game/necrovision", "rating": 2.99, "rating_top": 4, "added_by_status": {"yet": 31, "owned": 782, "beaten": 49, "toplay": 16, "dropped": 38, "playing": 6}, "playtime": 1, "achievements_count": 0, "ratings_count": 85, "suggestions_count": 635, "game_series_count": 1, "reviews_count": 86, "platforms": ["PC"], "developers": ["The Farm 51"], "genres": ["Action"], "publishers": ["1C-SoftClub", "1C Company"], "esrb_rating": null}