{"id": 17800, "slug": "strato", "name": "stratO", "name_original": "stratO", "description": "Glide, swoop, tuck, dive, magnetize, grind, walldrive, and burn your way through rings to advance the difficulty of the vast, procedurally-generated environment while avoiding the fog and getting stranded!<br/><br/>stratO is a demanding game that requires a lot of dedication and determination but rewards you with the ability to make a friction-fueled rocket-glider pull off stunts that surpass anything you've seen in a movie. But forget everything you know about other flight sims and flying games. IT CAN'T HELP YOU HERE!<br/><br/>Key Features<br/>- Rather than telling your plane to go up/down/left/right, you control INDIVIDUAL air deflectors, and the sum of their generated torque is the result.<br/>- This means that although the controls are harder to learn, a master pilot can pull off very tight aerobatic stunts and emergency recovery manoeuvres.<br/>- Procedurally-generated world that gets more difficult as you collect more rings.<br/>- Interwoven and deep game mechanics -- slide to boost, boost through rings or slide during a boost to refuel, tuck to magnetize wings and slide easier and double engine thrust and decrease drag, and that's just the start!<br/>- Tight controls are simple to learn, but challenging to master. Being good at stratO is something to be _proud_ of.<br/>- PC Version supports keyboard controls, XBOX Controllers (with vibration) and generic gamepads/flight sticks<br/>- All controls are remappable (including menu &amp; interface navigation)Other Features<br/>- Flightstick users can press+hold on the main control menu button(The one with the star on it for 3 sec) to toggle the game to pitch/yaw/roll controls<br/>- Alternate colour scheme for airplane &amp; orientation indicators for players with Deuteranopia", "metacritic": null, "released": "2015-06-01", "tba": false, "updated": "2019-08-28T22:10:09", "background_image": "https://media.rawg.io/media/screenshots/8da/8da9207921912800210b7ceb2c8e00bf.jpg", "website": "http://www.flystrato.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 57}, "playtime": 5, "achievements_count": 13, "ratings_count": 0, "suggestions_count": 278, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Mark Chong"], "genres": ["Action", "Simulation", "Indie"], "publishers": ["Mark Chong"], "esrb_rating": null}