{"id": 17811, "slug": "axis-football-2015", "name": "Axis Football 2015", "name_original": "Axis Football 2015", "description": "Axis Football OverviewAxis Football is a high-quality, 3D American Football <strong>Game</strong>. Choose from 32 team and play in either season mode or quick match against AI or local multiplayer. A great alternative to Madden, Axis Football features excellent controls and a unique aimed passing system that gives unprecedented accuracy and control of where the ball is thrown.  Unlike the few other football games, Axis Football was specifically designed for play on a computer and takes full advantage of the mouse/keyboard controls as well as controllers.Teams and RostersAll 32 cities from the NFL are represented in Axis Football.  Each team features its own ranking in passing, running, pass defense, run defense, and special teams. Additionally, each player in the game comes complete with their own stats for all of the various football metrics (speed, tackling, blocking, etc.).  The names, numbers, and races of all players are stored in external files allowing for complete customization/modification of rosters.  Complete mod support will be added soon!Axis Football 2015 Features and Updates<br/><ul><li><strong>Season Mode with different schedules each year and season-long stats!</strong><br/></li><li><strong>Coach Mode</strong> Call the plays and watch the action! Available in both quick match and season mode!<br/></li><li><strong>Controller Support.</strong> You can now use your XBox 360 controller to play!<br/></li><li><strong>2-Player, Local Multiplayer.</strong> Using two controllers<br/></li><li><strong>Player Mod Support</strong> You have control over the name, number, and race of each player in the game<br/></li><li><strong>Uniform Mod Support</strong> Have complete control over each team's home and away uniforms<br/></li><li><strong>Steam Achievements.</strong><br/></li><li><strong>Steam Trading Cards.</strong></li></ul><br/>I know Axis Football doesn't have everything that you want it to have - yet! It's going to take some time to get all of the features that you have come to expect. I'm asking for your support in helping build a football game franchise that gives players options. I'm in this for the long-haul. If you decide not to purchase the game, I ask that you at least mention it to a friend!", "metacritic": null, "released": "2015-07-15", "tba": false, "updated": "2019-09-17T06:45:57", "background_image": "https://media.rawg.io/media/screenshots/c85/c851fef063a4f93ae7dd6b67c4c3f86c.jpg", "website": "http://axisgamesonline.com/p/axis-football", "rating": 1.33, "rating_top": 1, "added_by_status": {"yet": 9, "owned": 396, "beaten": 1, "dropped": 3}, "playtime": 6, "achievements_count": 14, "ratings_count": 6, "suggestions_count": 203, "game_series_count": 0, "reviews_count": 6, "platforms": ["macOS", "PC", "Linux"], "developers": ["Axis Games"], "genres": ["Sports"], "publishers": ["Axis Games"], "esrb_rating": null}