{"id": 17816, "slug": "celestial-tear-demons-revenge", "name": "Celestial Tear: Demon's Revenge", "name_original": "Celestial Tear: Demon's Revenge", "description": "<strong>Disclaimer</strong><br/><br/><strong>Our game is currently being redone on a new engine for better optimization with added content and features. Please consider your purchase as an early access version of the game and once it's updated, you will receive the new version. We apologize for any inconvenience, thank you for your patronage. For more information and updates on progress, please check the news </strong> <br/><br/>Demon’s Revenge is an episodic RPG set in a Sci-Fi fantasy world. <br/><br/><br/>You begin your journey on the planet Hasphal, where prejudice seems to have torn the world apart since the beginning of time. Humans have proclaimed jehts, the native beings of Hasphal, disfigured, dangerous and unworthy of living on the same planet. They believed them to be monstrous creatures from Remerin (a hellish place) and hunted them down in honor of their Gods.<br/><br/>Join Sen as she finds herself thrust into the middle of this ancient conflict, discovering the mysteries about herself and the true history of Hasphal and its inhabitants. Everything is not what it appears to be as religion and life itself unfolds in this exciting adventure.FEATURES<br/><ul><li>A unique turn-based combo based combat system inspired by 16-bit fighting games.<br/></li><li>Exciting motion comic cut scenes.<br/></li><li>A beautiful world brought to life with 2D pixel art and animations.<br/></li><li>A rich story with voice acted dialogue.<br/></li><li>A powerful, original soundtrack.</li></ul>", "metacritic": null, "released": "2015-11-19", "tba": false, "updated": "2019-08-28T22:10:09", "background_image": "https://media.rawg.io/media/screenshots/27e/27ee6a6913304e1a579d41fcada5752a.jpg", "website": "http://demonsrevenge.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 12}, "playtime": 1, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 442, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["White Guardian Studios"], "genres": ["RPG", "Indie"], "publishers": ["Degica"], "esrb_rating": null}