{"id": 17813, "slug": "ufho2", "name": "UFHO2", "name_original": "UFHO2", "description": "Play an alien navigating a maze of hexagons in this competitive mix between strategy and board game. Plan your next turn, think fast, act faster, and outmanoeuvre your opponents by predicting their moves. If you are into strategy and tactics, UFHO2 will put your brain to the test!<br/><br/>In this sequel, things get bigger and better in every way: new stages, more board layouts, all new characters, new game modes, and more powerups; plus Steam Leaderboards, Achievements, and Collectable Cards.JELLY FEATURES:<ul><li>Story Mode — 10 unique planets along 2 different story lines, for a total of 25+ matches<br/></li><li>Local Multiplayer mode — outwitting your friends is more fun when you can see the disappointment in their eyes<br/></li><li>Situations mode — once you’ve become really good, show your worth in these super-hard matches!<br/></li><li>10 different alien races to unlock, each one with its own in-game power<br/></li><li>6 guests from other indie games (World of Goo, Super Crate Box, Bit.Trip, Blocks That Matter, Gish, Cortex Command)<br/></li><li>24 Achievements and 2 Leaderboards - be the best in the world!<br/></li><li>Up to 4 players on one computer!<br/></li><li>A wonderful original soundtrack, by composer Francesco D'Andrea — listen to it on Bandcamp</li></ul>AND MORE TO COME SOON:<ul><li>A cross-platform Online Multiplayer mode<br/></li><li>Even more characters<br/></li><li>Hats for everyone :)</li></ul><br/>UFHO2 is strategy at its finest.<br/><br/>Follow the game on Twitter, and the developer on Twitter and Facebook", "metacritic": null, "released": "2015-06-02", "tba": false, "updated": "2022-11-29T10:37:01", "background_image": "https://media.rawg.io/media/screenshots/9f8/9f8d257c9980220486fe14aea9dfa1f7.jpg", "website": "http://www.tinycolossus.com/ufho2", "rating": 2.86, "rating_top": 3, "added_by_status": {"yet": 2, "owned": 227, "toplay": 1, "dropped": 1, "playing": 1}, "playtime": 1, "achievements_count": 24, "ratings_count": 7, "suggestions_count": 308, "game_series_count": 0, "reviews_count": 7, "platforms": ["PC", "macOS", "Linux"], "developers": ["Tiny Colossus", "Ciro Continisio"], "genres": ["Strategy", "Indie"], "publishers": ["Tiny Colossus"], "esrb_rating": null}