{"id": 17825, "slug": "subaeria", "name": "Subaeria", "name_original": "Subaeria", "description": "<strong>Subaeria is an intense action puzzler with roguelike-elements. Players use their wits to manipulate their enemies into destroying each other. They'll have to be smart in how they approach different situations and think strategically on how to use their environment and abilities to defeat their enemies. </strong><br/><br/>Players follow Styx, a young girl who’s out for revenge after her family is murdered by the overlord of Subaeria. She must fight her way through droves of murderous robots by pitting them against one another. As she progresses towards her goal of revenge, she’ll explore the underwater city of Subaeria to uncover the mysteries that lie below the depths.Features<br/><ul><li>Pit your enemies against one another and the environment to defeat them.<br/></li><li>Use skills equipped to your drone to influence your robot ennemies and Styx.<br/></li><li>Every room is a puzzle to be solved with the skills you have on hand.<br/></li><li>Unlock different skills, buffs and skins at each playthrough<br/></li><li>Explore a new labyrinth at every play session.</li></ul>The Game<br/>Players can manipulate both Styx and a hovering companion, their Drone, to trick and influence enemies into defeating each other and themselves. Along the way, they’ll find many skills to upgrade their Drone and give them an edge needed to survive.<br/>They’ll have to make strategic decisions in how they progress through the city and how they allocate their resources in order to survive long enough to witness the resolution of Styx's story.", "metacritic": null, "released": "2015-09-22", "tba": false, "updated": "2019-08-28T22:10:08", "background_image": "https://media.rawg.io/media/screenshots/86f/86fc7f4ef4656cdff0735f365472f44e.jpg", "website": "http://www.subaeria.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 12, "beaten": 1}, "playtime": 3, "achievements_count": 67, "ratings_count": 1, "suggestions_count": 469, "game_series_count": 0, "reviews_count": 1, "platforms": ["PlayStation 4", "Xbox One", "PC"], "developers": ["Studios iLLOGIKA", "Illogika Studios"], "genres": ["Action", "Adventure", "Indie", "Puzzle"], "publishers": ["Plug In Digital", "Studios iLLOGIKA"], "esrb_rating": null}