{"id": 178216, "slug": "distortion-clash-gameplay-playtest-demo", "name": "Distortion Clash - Gameplay Playtest Demo", "name_original": "Distortion Clash - Gameplay Playtest Demo", "description": "<p>Most Recent Update: You can now bring up move descriptions in the character select screen and the fight screen. While the top four characters are the only ones fully up and running, there are at least descriptions for the other four's moves. Press \"R\" as the first player or \"K\" as the second player to bring this menu up or put it away. Press your left/right buttons to change pages. If playing as Zephyr Glaive, press Up/Down to change between Armed/Unarmed moves.</p>\n<p>(I don't have art for most of the characters, aside from basically copy/pasting the same sprite to look like the different characters, so a lot of the actions done will be done with the Luchadora's sprites just to show that you are doing something at least.)</p>\n<p>Basics:</p>\n<p>Each \"Phase\" (10 seconds on the \"in-game\" timer if you are using it) is divided into two \"Reveals\". Each player can select up to two options for each Reveal (including the same option twice), but it is not necessary. Sometimes using a single option for a Reveal might be the better choice at that time. Throws are also not implemented at this time, so ignore the green button completely. If you input an invalid combination of options your character will do nothing for that Reveal. After each Phase you can go back to your controller to input the commands for the next Phase. The game will end if either the timer reaches 0 or if either player has no HP remaining at the end of a Reveal.</p>\n<p>(PLEASE USE ONLY SKIN #1 FOR ALL CHARACTERS. I don't have anything in Skin #2 for a lot of them, so it'll reduce any issues.)</p>\n<p>Combat Screen:</p>\n<p>P1: W,A,S,D for cursor movement, Z to select an option for your first Reveal, X to select an option for your second Reveal, C to place a decoy on an option, V to clear all placement on an option / Un-Ready if you need to make changes. Space to mark yourself as Ready.</p>\n<p>P2: Directional Arrows for cursor movement, U to select an option for your first Reveal, I to select an option for your second Reveal, O to place a decoy on an option, P to clear all placement on an option / Un-Ready if you need to make changes. Enter to mark yourself as Ready.<br/></p>\n<p>Common Moves:</p>\n<p>Movement: If you select only one option in a direction, you'll have the \"x1\" speed bonus added, and if you select a single direction twice you'll have the \"x2\" speed bonus added. Selecting two different directions is invalid, and you cannot move and attack in the same Reveal (example, you'd have to Move Right first Reveal and Light Punch second Reveal).</p>\n<p>Attacks: If you are doing just a standard punch or kick, only select one for your Reveal. If you are in the air, Punches hit horizontally from you while Kicks hit diagonally downward.</p>\n<p>Anti-Air Attacks: If you are anticipating your opponent to jump at you, you can use a combination of a jumping direction (Jump Left, Jump Up, Jump Right) with any of the four standard attack buttons to attack diagonally upward instead of in front of you.</p>\n<p>Block: Blocks currently reduce all hits to only 1 Damage.</p>\n<p>Jumping: When you jump, you have a momentum status depending on the type of jump (\"Left\", \"Right\", \"None\") and whether or not something is in your way. For instance, if your back is to the right wall and you select Jump Right, you aren't going to jump off the screen (at least you shouldn't) and will have a momentum status of \"None\". After the Reveal in which you jumped, you will spend one Reveal in mid-air and at the end of that Reveal you will go back to the ground. If the opponent is in the square you will be landing in, they will be pushed around (usually  in the same direction your were travelling in, unless their back was to the wall).</p>\n<p>UNIQUE/SUPER MOVES:</p>\n<p>Only the top four characters have any Unique or Super Moves implemented at the moment, but if you wanted to test those out, you can either do Move Left/Right + a Punch or Kick for their Uniques or a combination of any two punches/kicks for a reveal to do a Super Move.  You can press R for Player 1 or K for Player 2 during the input portion to bring up a move list for your selected character.</p>\n<p>The top four characters are also the only ones who have enabled passive abilities, which you can check by pressing the buttons above that were used to look up info.</p>\n<p>I'm rambling now, so please give it a try and let me know what you think.  If there is anything that you feel should be changed, let me know (not a guarantee it'll be changed, but the feedback is always welcome). I've been having slight issues with the screen size, so what I have been doing is starting it in Windowed mode and then maximizing the screen, so if something seems off please give that a try.</p>\n<p>FEEDBACK I'M LOOKING FOR AT THE MOMENT:</p>\n<p>Just let me know if it is something that you can see yourself playing more of after it gets the Throws added in and it looks and sounds nicer. If the basics turn people away, then usually some changes will need to be made going forward or it won't be enjoyable.</p>\n<p>If you play against the Computer, let me know if the outcome of the match felt reasonable. If you play against another person, let me know what both people thought about the outcome. Some of the characters will be worse than others at this point, as the characters with lower status usually have the passive abilities and moves to make up for the stat difference.</p>", "metacritic": null, "released": "2018-01-28", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/f11/f112c6e04ea9b14e254850c90f6b89b7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 4, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Riverwalker Studios"], "genres": ["Fighting"], "publishers": [], "esrb_rating": null}