{"id": 17839, "slug": "creeper-world-3-arc-eternal", "name": "Creeper World 3: Arc Eternal", "name_original": "Creeper World 3: Arc Eternal", "description": "Creeper World 3:  Cellular automata takes over a strategy simulation.  Instead of discrete units that attack your base, a fluid-like substance spreads over the terraformable terrain.  Your base, your weapons, your strategy... you must adapt them all.Creeper World 3 bends what it means to be a strategy title. Instead of heavily scripted A.I., players find themselves engaging an enemy with theoretically predictable behavior yet which is shockingly interesting to engage. Players can build fortifications and stick around forever.  Players can go for domination, quick strategic kills, or amass huge stockpiles of resources.  Some play for speed, others to create art.  Tiny maps, large maps, five minute missions, five day missions...  the simulation scales to handle all of these scenarios.User generated content is critical and supported at multiple levels in Creeper World 3.  Dial up worlds using the DMD (Dial Map Device) and tweak dozens of constraints.  Then, play and share the addresses via an on-line database.  Create your own maps using the built-in map editor and upload and share on-line.  Or, join with thousands of other players and peruse the databases of worlds created by others.  Want to create a new weapon, a unit, an enemy, or an effect?  Use the built in scripting language to create what you dream.  Hundreds of engine commands are exposed and examples abound on the forums and grow daily.  You can even take the built in story maps and make your own.  In fact, all of the built in story missions were written using the built-in editor and the CRPL scripting language.Some of the high level features are:<ul><li>Thermodynamic/fluid physics based play.<br/></li><li>Billions of total missions.<br/></li><li>Story arc with insane and unique enemies.<br/></li><li>Explore hundreds of star systems with thousands of worlds in Prospector missions.<br/></li><li>Hundreds of hand crafted missions in the Alpha Sector.<br/></li><li>Dial up your own mission worlds using the 'Dial Map Device' and share the address.<br/></li><li>Create your own maps using the included map editor.<br/></li><li>Play on maps of variable size, dimension, and shape.<br/></li><li>Script your own enemies and effects using the built in scripting language.<br/></li><li>Terraform the landscape during missions to take the higher ground.<br/></li><li>Discover experimental weapons that devastate the enemy.<br/></li><li>Share thousands of unique maps with an established, enthusiastic on-line community.<br/></li><li>Features a unique, original, and awesome soundtrack.</li></ul>", "metacritic": null, "released": "2014-03-27", "tba": false, "updated": "2024-04-06T12:13:08", "background_image": "https://media.rawg.io/media/screenshots/1fb/1fbf551e7e846cc8a5cb6de892e5d11b.jpg", "website": "http://knucklecracker.com", "rating": 4.18, "rating_top": 4, "added_by_status": {"yet": 10, "owned": 392, "beaten": 21, "toplay": 4, "dropped": 9, "playing": 1}, "playtime": 5, "achievements_count": 139, "ratings_count": 44, "suggestions_count": 293, "game_series_count": 0, "reviews_count": 44, "platforms": ["PC", "macOS", "Linux"], "developers": ["Knuckle Cracker"], "genres": ["Strategy", "Simulation", "Indie"], "publishers": ["Knuckle Cracker"], "esrb_rating": null}