{"id": 17833, "slug": "might-magic-x-legacy", "name": "Might & Magic X - Legacy", "name_original": "Might & Magic X - Legacy", "description": "<p>After a decade, a Might &amp; Magic® RPG is back with both the unique core formula and a new set of improved and fine-tuned features. The best RPG of its class!<br />\nIn the wake of the spectacular events in Might &amp; Magic® Heroes® VI, you will play in a party of four adventurers entangled in intrigue and political machinations unfolding in and around Karthal. The city, on the verge of secession, is prey to competing factions vying for its control. Your actions will determine the fate of the city.<br />\nMight &amp; Magic® X Legacy is an authentic solo experience in the classic first-person RPG genre. Create and lead your group into an exciting open world and battle mythical powerful creatures while collecting ancient magical treasures!Reviews&quot;Might &amp; Magic X – Legacy has everything it needs to be the next great title in the series&quot;<br />\nRPG Codex<br />\n“Schedule some vacation for early 2014”<br />\nRPG Watch<br />\n“A high-pressure blast of nostalgia”<br />\n82.5% - Game InformerDeluxe Digital EditionFREE COPY OF MIGHT &amp; MAGIC® VI<br />\nThe Deluxe Edition includes a free copy of Might &amp; Magic VI, one of the most praised episodes in the Might &amp; Magic franchise.<br />\nEXCLUSIVE DUNGEON WHEN IT RELEASES: THE DREAM SHARD<br />\nExplore the Dream Shard dungeon and pursue your quests in the Agyn Peninsula!<br />\nFIRST DLC FOR FREE WHEN IT RELEASES: THE FALCON AND THE UNICORN<br />\nDeluxe Edition owners will get to enjoy the game’s very first DLC called the Falcon and the Unicorn for free when it releases.<br />\nDIGITAL SOUNDTRACK<br />\nGet the Might &amp; Magic X – Legacy official soundtrack on audio CD and listen to thirteen unique compositions from the acclaimed duo of composers, Roc Chen and Jason Graves.Standard Digital EditionFULL GAME<br />\nRediscover the mythic Might &amp; Magic role-playing series, updated for a new generation in Might &amp; Magic X - Legacy. Experience a gripping four-act story that will test your tactics and judgement.<br />\n12 playable classes<br />\nCustomise your team of adventurers with choices from 12 different classes, 4 races, and over 20 skills. Evolve your party members and develop unique strategies using freshly acquired spells.<br />\n3 towns and 1 city<br />\nBegin your great journey at Sorpigal-by-the-Sea, travel to the other settlements, visit monuments, recruit hirelings, and trade with shopkeepers.<br />\nOpen world<br />\nTravel through stunning environments, choose which region you want to explore first but be careful, danger is never far off.<br />\nVarious quests<br />\nDiscover the sinister plot happening in the Agyn Peninsula, shape its inhabitants&#39; stories, and evolve your party thanks to fun and original quests full of Easter Eggs!<br />\n20+ dungeons<br />\nExperience fear and claustrophobia in the dark heart of classic dungeons, and feel vulnerable to attack from all sides while crossing open landscapes.<br />\nMore than 60 creatures and 6 unique bosses<br />\nFace cunning foes in turn-based combat and adapt your fighting skills to the mightiest creatures.<br />\nMODDING KIT<br />\nCreate your own map and mods to express yourself, design the game you want to play and share your creative vision with the Might &amp; Magic X – Legacy community!Caractéristiques PrincipalesDive into vintage Might &amp; Magic®<br />\nDiscover an authentic franchise that defined early PC RPG gaming in the 80s! This classic and timeless RPG has returned after eleven years of waiting and has been adapted to today’s standards while respecting yesterday’s expectations. Old school, new rules!<br />\nCreate your party<br />\nTake control of a team of four adventurers chosen among four different races. Twelve classes are available, each one having their own skill system. Thousands of combinations are possible!<br />\nForge your own tactics<br />\nThrough a turn-based gameplay system, defeat creatures and unique bosses and accomplish unique quests, level up your group and gain new powerful artifacts.<br />\nDiscover a new part of Ashan<br />\nExplore the Agyn Peninsula – a totally new, unexplored environment in the Might &amp; Magic universe. Get familiar with its epic wilderness and meet the locals who pack quite a few surprises…<br />\nExplore twisted dungeons<br />\nMake your way through dangerous dungeons, cities, and labyrinths full of traps, and solve puzzles and riddles to rack your brain! Beware: You never know what’s hiding around the corner!<br />\nExplore twisted dungeons<br />\nBuild your own adventure and quests and share them with the community. The legacy is yours!</p>", "metacritic": 70, "released": "2014-01-22", "tba": false, "updated": "2023-09-01T14:29:42", "background_image": "https://media.rawg.io/media/games/fa5/fa5a83902e207dd8c83b9785029deb8f.jpg", "website": "http://mightandmagicx.com", "rating": 3.24, "rating_top": 3, "added_by_status": {"yet": 27, "owned": 480, "beaten": 27, "toplay": 12, "dropped": 24, "playing": 1}, "playtime": 4, "achievements_count": 0, "ratings_count": 61, "suggestions_count": 662, "game_series_count": 9, "reviews_count": 62, "platforms": ["PC", "macOS"], "developers": ["Ubisoft", "Limbic Entertainment"], "genres": ["RPG"], "publishers": ["Ubisoft Entertainment"], "esrb_rating": null}