{"id": 178313, "slug": "terrain-explorer", "name": "Terrain Explorer (itch)", "name_original": "Terrain Explorer (itch)", "description": "<p><strong>Terrain Explorer<strong> </strong></strong>is an RPG map generator in a Pokemon-inspired environment which supports different forms of terrain and aids in mapping and tiling. By generating well-designed maps that are ready to be used in game development, the application aims to ease the exhausting task of level design, especially for games with a huge number of maps, through PCG concept and make the development of games with similar genres much easier.</p>\n<p><strong>Terrain Explorer</strong> is made entirely from GameMaker Studio 1.4 and has 2D pixel setting similar to those in many Pokemon games using customized tilesets to suit the game dimension. The character that is used to discover the map is self-made by me and can only move around to discover the map in the perspective similar to an in-game perspective of a player, due to the fact that this is not an actual game and map design generation is prioritized over gameplay.</p>\n<p>The map is generated using various PCG techniques, such as Random Walk, Probability-Based Spawning similar to Markov Chains, etc.</p>\n<p><strong>Instruction:</strong></p>\n<p>Use Up/Down/Left/Right arrow keys to move around</p>\n<p>Use ENTER to generate new map</p>\n<p>Use SPACEBAR to switch view (In-Game / Complete)</p>\n<p><strong>Credit</strong>: Evolina from DeviantArt for the Tileset. Source: https://evolina.deviantart.com/</p>\n<p>Character Sprites are designed by me.</p>", "metacritic": null, "released": "2017-11-13", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/c42/c422b59fa3499d214e976784be97fe23.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 64, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["hphong"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}