{"id": 17835, "slug": "fantasy-wars", "name": "Fantasy Wars", "name_original": "Fantasy Wars", "description": "<strong>Fantasy Wars</strong> is a turn-based strategy game set in a fantasy world. Combining both classic strategy gameplay and sophisticated 3D graphics players can experience epic battles like never before. Taking place in a fantasy world of Human kingdoms, Orc clans, Dwarfs' citadels and Elven forests the player is thrust into a world of war and legend. Play the role of an Orc or Goblin boss, a captain of the Human army or lead the elite forces of the Elven army. Participate in castle sieges and village defense, assault and reconnaissance operations and swift raids. To be victorious remember that the amount and experience of troops is not always the key factor, organize cooperation between different types of units and use the landscape to achieve strategic superiority. The game consists of three story-connected campaigns. In each of them players will have to gather an army, upgrade units, find magic artifacts and study magic spells. An epic story has been crafted to draw gamers in. The great Orc chieftain and conqueror Ugraum, incited by the cruel shamans, gathers a huge horde to invade the land of Humans. Only a small, but experienced army of general Pfeil is able to fight against the powerful enemy. However the sides in this confrontation don't know that this is all just a part of evil plot of the dark powers.<br/><br/> <strong>Key features:</strong><br/> <ul><li>Battlefields and surroundings in full 3D<br/> </li><li>Various tactical opportunities<br/> </li><li>Vivid characters which develop during the game<br/> </li><li>More than 70 units and 9 types of armies<br/> </li><li>Advanced army upgrade system<br/> </li><li>Original storyline<br/> </li><li>Multiplayer mode (LAN, Internet, Hotseat)<br/> </li></ul>", "metacritic": 67, "released": "2007-08-29", "tba": false, "updated": "2023-12-11T15:53:54", "background_image": "https://media.rawg.io/media/screenshots/8d2/8d2e7abb02995bd12f1bd0334b04aedc.jpg", "website": "http://fantasywars.1cpublishing.eu/", "rating": 3.28, "rating_top": 4, "added_by_status": {"yet": 16, "owned": 570, "beaten": 12, "toplay": 3, "dropped": 12}, "playtime": 1, "achievements_count": 0, "ratings_count": 29, "suggestions_count": 536, "game_series_count": 0, "reviews_count": 29, "platforms": ["PC"], "developers": ["1C: Ino-Co", "Ino-Co"], "genres": ["Strategy"], "publishers": ["1C-SoftClub", "1C Company"], "esrb_rating": null}