{"id": 178407, "slug": "delisp", "name": "Delisp", "name_original": "Delisp", "description": "<p>My game for Lisp Game Jam 2016 January </p><p>What was the most watched pc game in the 1990s that nobody never actually played?</p><p>That's right the windows maze screensaver!</p><p>Finally in the year 2016 you can frag those mazes like it's 1995!</p><p>The game requires java to run. </p><p>You can find the instructions in the README.txt.</p><ul><li>What dialect/tools/libraries did you use?<ul><li>Kawa scheme, Libgdx</li></ul></li><li>What sort of game did you choose to make, and why?<ul><li>Original idea was to make Quake defrag like game with doom like engine</li></ul></li><li>What went right, what were some successes?<ul><li>The raycasting engine worked and I managed to get it run at decent speed in the end</li><li>I was really proud of getting the floor casting to work</li><li>I submitted a bug to Kawa project </li></ul></li><li>What went wrong?<ul><li>I think libgdx might have been poor choice for this project</li><li>Creating the engine was harder than I thought and I had to change the goal to simpler one due to that</li><li>The performance is kind of poor and I had to cut corners in the quality</li><li>Kawas way of creating new thread (future expression) didn't run concurrently. I found a way to do multithreading but never used it in game.</li></ul></li><li>What did you learn?<ul><li>Kawa is a nice language but some things that you'd think that would work will give a compile error and really unhelpful java stack trace</li><li>When doing Wolfestein3D like raycasting engine how to the floor casting </li><li>Got more familiar with libgdx, scheme and kawa</li></ul></li><li>What did Lisp enable you to do well in this entry?<ul><li>Write less code than if I had done this in Java</li><li>Multithreading easily, sadly the final product does not utilize multiple threads.</li></ul></li><li>What challenges did Lisp present in making your entry happen?<ul><li>My problems were not Lisps fault they were mostly because of Kawa</li><li>I used emacs, the modes for schemes were useful for kawa but not always</li><li>There were some cases were if I defined class inside file that was the same name as the class there would be compile error</li><li>Unhelpful java stack traces </li><li>I Know common lisp and when I started I didn't know scheme. Writing hygienic macros was kind of hard when I started</li></ul></li><li>If you are comfortable answering, please mention how long you have used lisp and describe previous gamedev experience, if any.<ul><li>I have used common lisp for 2-3 years?</li><li>I have read The Little Schemer but I don't really know scheme</li><li>I have made some small games: Snake, Conway's Game of Life</li><li>I have done some exercises with Opengl and I have fiddled with Jmonkeyengine</li></ul></li></ul>", "metacritic": null, "released": "2016-01-06", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/ec3/ec3b509e98ef1fdd4668df6676e47674.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 72, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ssake"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}