{"id": 178465, "slug": "the-roamers", "name": "The Roamers", "name_original": "The Roamers", "description": "<p>The Roamers is a game where you start by investigating a scream you hear late at night in your secluded cabin, possibly a murder. You'll soon grow to find out all is not what it seems when the presumed killer shows itself. You realize you're one of the only ones left and you need to get away, to hide, to run. The game is a straight forward story with many mind boggling twists.<em> (read disclaimer at top for more info)</em></p>\r\nInfo:\r\n<p>The Roamers is a game that I started development for in mid-2017. The full Act 1 of the game will be coming in weeks to months. The reason for posting it so early was to build a development team and to get feedback, beta testers critiques, and suggestions on where the game should go on from here. Act 1 Scene 1 of 4 is what you'll play if you download it, with the remaining three scenes and acts being incomplete at the moment.<br/></p>\n<p>A lot of time and effort was put into this game. 1000+ hours were put into the graphics, game mechanics, and most of all,  the coding which brings it all together. The game was originally made using Gamemaker Studio, but I'm hoping to be able to get the creator or developer version of Gamemaker Studio 2 for future updates. Almost everything in this game was made by my team, Dawson (me) and Adwit. The exception being the Music, the Sound Effects, and the Lighting Engine. More information about the dev team is in game on the menu screen. Donations and feedback are always very appreciated.<br/></p>\n<p>Thanks, DawsonY8s</p>", "metacritic": null, "released": "2018-04-14", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/eb9/eb9893c52dddf052ce0881bfd9214dd7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 22, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["DawsonY8s"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}