{"id": 178497, "slug": "gg-store-proto", "name": "GG Store (Proto)", "name_original": "GG Store (Proto)", "description": "<p><strong><strong>Jeu :</strong></strong></p>\n<p>Vous êtes patron d'un petit magasin de vente de jeux vidéo. Votre objectif: vous développer, faire venir de nouveaux clients et devenir leader dans le domaine.</p>\n<p><strong>Commande:</strong></p>\n<p>- Clic Gauche souris: déplacer le pnj</p>\n<p>-F1: Afficher le debug Mode</p>\n\n<p><strong>A propos:</strong></p>\n<p>- Elève Premium de Gamecodeur : depuis le 04/04/2018</p>\n<p>- Lua et Love2d</p>\n<p>- Codé par moi-même / Graphismes par:</p>\n<p><strong>- christopher1006</strong> (Tileset Prison architect (https://forums.introversion.co.uk/viewtopic.php?t=18855))</p>\n<p>- <strong>Nuri Yuri </strong>(Tileset PNJ (http://www.pokemontrash.com/club/rpg-maker/bibliotheque-des-ressources-graphique...)</p>\n\n<p>- Utilisation de librairies et codes externes : Oui:</p>\n<p>- Librairie Astar(Pathfinding):<br/>https://goo.gl/sCAubj</p>\n<p>- Bibliothèque Hump (camera):<br/>http://hump.readthedocs.io/en/latest/</p>\n<p>- Bibliothèque STI (gestion de map):<br/>https://goo.gl/ZG4Hhv</p>\n\n<p>Temps passé :  ~ 30 h (répartis sur 12 jours)</p>\n\n<p>- Comment as-tu (ou pas) abordé la contrainte du thème:</p>\n<p>Je suis partit du postula que je ne voulais pas faire un \"Sim City\" \"Like\". Je voulais faire un jeu de gestion avec une gestion de pnj et dans un univers que j'aime: le jeu-vidéo.</p>\n\n<p>- Petit postmortem:</p>\n<p>Cette Jam était ma première. Après 1 mois, je me suis dit \"Allez, on tente le coup.\". Mais je ne me rendais pas compte de la complexité que je m'étais infligé dès le départ:</p>\n<p>- Je partais sur une idée de jeu de gestion d'un magasin de jeux vidéos. L'idée me paraissait intéressante. Je n'ai pas cherché à m'aventurer dans la 3d iso, même si je rêverais d'en faire.</p>\n<p>- Mon premier problème majeur a été la gestion de la caméra: Je voulais être capable de zoomer/de-zoomer sur la carte du jeu. Après moult péripétie, j'ai réussie à faire fonctionner la librairie. Mais au final, je ne l'ai pas inclus dans mon projet principal: trop de problème avec les autres librairies. </p>\n<p>- Un autre problème \"esthétique\" était de faire en sorte que le pnj s'oriente et change d'animation lors des rotations. La galère de l'animation était du au fait que j'avait un tileset. Je devais utiliser des quads pour récupérer chaque morceau de sprite de la tileset, les nommer et les mettres dans un tableau avec le nom de l'animation et la position, lui même dans une table avec l'ensemble des animations. Pour gérer toutes les propriétés du pnj, j'ai donc créé une classe (j'ai appris les bases des classes sur le tas, une bonne galère en somme).</p>\n<p>- Dernier problème majeur: le pathfinding. Encore aujourd'hui, je n'ai pas encore fait l'atelier de pathfinding de gamecodeur. Je me suis donc servie de la librairie Astar, qui m'a aidé pour faire un système de pathfinding. Beaucoup de problème de blocage, plantage et j'en passe</p>\n\n<p>Au final, mon projet de gestion ne s'est soldé que par un prototype d'un pnj dans une zone avec un sytème de pathfinding.</p>\n<p>Il faut qu'à l'avenir, je gère mieux mes ambitions en fonction de mes compétences et de mon temps. En effet, je suis partit 10 jours voir des amis que je ne vois qu'une à 2 fois l'an. J'ai donc passé plus de temps à m'éclater avec eux qu'à coder. Mais l'expérience était très intéressante et le proto ne restera pas un proto. Je compte bien allez au bout du projet :D<br/></p>", "metacritic": null, "released": "2018-05-29", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/7ca/7cacad1c9ea291255087303bda027a0a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 22, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Massdarme"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}