{"id": 17847, "slug": "abd-a-beautiful-day", "name": "ABD: A Beautiful Day", "name_original": "ABD: A Beautiful Day", "description": "To view our F2P Military Veteran program, please visit our Website (www.GagAMaggotEnt.com) for details. <br/>\n<br/>\r\nABD: A Beautiful Day is an MMORTSS (Massively Multiplayer Online Real Time Survival Strategy) that spans from 100,000 B.C.E. to 245 B.C.E.. Play in this 24 hour, 7 days a week continuous environment to build your civilization, and fight exposure in the process. Work together or work alone, and task your minions to do your bidding while you're gone! Inspired by Gaming Epic's like Empire Earth, Age of Empires, Supreme Commander, and The Oregon Trail, you will embark on an epic journey for survival that spans the ages. As a player, you will contribute to the progression and stories that encompass the era, the era around you, and the direction of the game as time moves forward. It isn't one rain drop that initiates a flood, its many thousands. <br/>\n<br/>\r\n•Anticipated Rating: M for Mature.<br/>\r\n•Post-Launch Agenda: E for Everyone version. <br/>\n<br/>\r\n•24 hour, 7 days a week continuous game area.<br/>\r\n•100+ Square Kilometer Map + Infinite. <br/>\r\n•Holiday Events.<br/>\r\n•Units work while you're away. <br/>\r\n•Men, Women, and Children. <br/>\r\n•Historical accuracy.<br/>\r\n•Unique Technology system. <br/>\r\n•Unique Crafting and Equipment system. <br/>\r\n•Diverse Economy. (W.I.P.)<br/>\r\n•Full Dismemberment. (W.I.P.)<br/>\r\n•Many, many more features. <br/>\n<br/>\r\nPlayers will battle exposure, infection, a lack of technology, and hardships that can cast the environment into a dark-age. Each Tier involves something called a Paradigm Shift, a Formal Paradigm that encompasses the epic of the era. Epics are stories that societies tell themselves that encompass their world views. These Paradigms are in textual form, which advances both on an individual player level and reflects globally across the game environment. For the July 15th Release, you will play through the First and Second tier, receiving further tiers as we progress through the refinement process of our Work in Progress release. <br/>\n<br/>\r\nUnlike most Tier/Era/Age based Real-Time-Strategy games, we're moving away from 'set' timespans. When you enter the game, you'll have primitive technology to begin with just like everyone else regardless of global progression. As you expand, you'll unlock further technology to aid you in your travels. Instead of having this 'set' timespan, players will have a unique experience every time they enter a server. For instance, if Server A is more aggressive, a dark age will be incurred. If Server B is more cooperative, technology and trade will be abundant. On Server C it could be a mix of the two, with certain regions in constant conflict and one or two superpowers in the far off distance. Also, you progress individually, but can work cooperatively and form alliances or guilds. <br/>\n<br/>\r\nABD plays out like any other RTS, except this time, cooperation and unity is your best bet for survival. The days of killing everything and everyone are over, you'll need each other to survive. Not only that, you'll form developmental relationships with your civilization. Sending your minions in to die will have an effect on you, emotionally immersing you into the experience. The introduction to Women and Children is important, otherwise the 18-32 male only demographic makes players remorseless to their actions in games. You will absolutely encounter ruthless players, but this feature will unify the gaming community in the conquest for the greater good to triumph the evils of the almighty player.", "metacritic": null, "released": "2015-08-14", "tba": false, "updated": "2019-07-25T17:07:08", "background_image": "https://media.rawg.io/media/screenshots/c51/c51cc11e6fcabcd4f7ab4d75bb43b2d6.jpg", "website": "http://www.GagAMaggotEnt.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 5}, "playtime": 6, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 311, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Jack Hanley", "Ben Rawles", "Robert Bonner", "Boris Blosse"], "genres": ["Strategy", "Massively Multiplayer", "Indie"], "publishers": ["Gag A Maggot Entertainment"], "esrb_rating": "Adults Only"}