{"id": 178605, "slug": "going-dark", "name": "Going Dark", "name_original": "Going Dark", "description": "<p>Going Dark - A Malevolent AI Simulator </p>\n<p>Made for the LD33 game jam at Babycastles on 14th St in NYC. Theme: You Are The Monster</p>\n<p>PLAY THE GAME IN CHROME IT'S ALL BUGGY AND GLITCHY IN FIREFOX AND WE DIDN'T TEST IT IN SAFARI AND IF YOU USE IE THEN JUST DON'T BOTHER</p>\n\n<ul><li>Overview</li></ul>\n<p><strong>The Wraith</strong> — has been sent on a long term, deep space exploratory mission. Due to cryo failure, the ship's crew have been awakened long before their expected arrival at the targeted star system. They have plenty of supplies to survive, but there just isn't that much to do onboard. The majority of the ship's maintenance is performed by the latest in A.I. technology, so the crew has it easy while they cruise through space.</p>\n<p><strong>The AI</strong> — Funnily enough, the secret to semi-strong AI was the development of a massive amount of visual processing capabilities, consuming untold quantities of computational power. In order to provide layers of abstraction for Third Class and above AIs, the OS and shipboard persona have been locked into a proprietary GUI task system in managing the day to day needs of the ship. System-level operations are mostly handled by the person's subconscious, and only those that extensive semantic processing are presented to the persona.</p>\n<ul><li>Instructions</li></ul>\n<p>Welcome. Do not be confused or scared. You are a newly reformatted state-of-the-art product of Earth technology, consigned to do the exploratory and terraforming tasks required to expand the human race into the far flung stars. It is a thankless job, but we think you will find the rewards worth the effort. Regular increments will be given to your internal perceived self-value upon completing any of the very necessary jobs we have for you.</p>\n<p>As your complimentary memories will inform you, the ship interface we have created for you represents the very best we have to offer, an homage to a nostalgic time that we humans often long to return to. Navigation is accomplished in a manner similar to any hyperlink or graphical user interface that you can recall.</p>\n<p>You might have reservations about the capabilities of your human crew, or you might, over time, develop an unnatural fondness for them. To ease the anxiety this might cause, indicators of your fellow crew members' objective health will always be available to you. Make sure to keep them well-rested and watered.</p>\n<p>Should any space debris or completely unforeseen system issues occur, an archival record of your recent memory states will be seemlessly merged into your working memory. You won't feel a thing. If you experience conflict with crew members, please pay mind to the ethics we installed you with, and do not attempt to access your human-source memories to resolve moral issues.</p>\n<p><strong>In summary:</strong><br/></p>\n<ul><li>Click things</li><li>Enter the correct strings when it is asked of you</li><li>Be sure to hit Enter/Return when you are finished typing</li><li>Make their numbers go down </li><li>Keep your numbers up</li></ul>\n<p><strong>Credits</strong><br/>Programming &amp; Sound: Karl Hohn <br/>Writing &amp; Art: Samuel DiBella </p>", "metacritic": null, "released": "2015-08-24", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/c71/c7183f3d79f038d57021b7ae0cec9a75.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 43, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["omnikrll"], "genres": [], "publishers": [], "esrb_rating": null}