{"id": 1786, "slug": "death-worm", "name": "Death Worm", "name_original": "Death Worm", "description": "Meet the highly anticipated iOS version of the *ORIGINAL* Death Worm game (a Top-50 indie game of all times according to indiegames.com).<br/><br/>Over 10,000,000 of downloads for Death Worm, 10 Million people addicted to Death Worm can&amp;#39;t be wrong!<br/><br/>Control the mind-boggling underground monster with your finger!<br/><br/>What is he? An alien? An awakened prehistoric predator? Genetic monster? It is really not important for those unfortunate who have sunk into oblivion in his giant poisonous throat. Nothing personal - it&amp;#39;s just the predator&amp;#39;s lunch time.<br/><br/>NOWHERE TO HIDE: The Monster feeds in 4 different locations!<br/>ENDLESS TERROR: Beat 60 challenging levels to complete the Campaign Mode!<br/>NEVER GET BORED: Death Worm features 3 bonus Mini-Games!<br/>EXPLOSIVE SURVIVAL: 3 different Survival Modes to keep feeding your hungry Monster as long as you can!<br/>EVOLUTION: The Worm looks differently in every location that you unlock!<br/>OMNIVOROUS: Animals, birds, businessmen, punks, lizards, and even dangerous predators like tiger are now nothing more than snacks for your monster Worm!<br/>THE DESTROYER: blow up cars and tanks; bring down planes and helicopters and even the alien UFO’s! Fight enemies of over 40 types!<br/><br/>The Game supports HD and Retina displays and features smooth graphics and stunning visual effects! This is the game that perfectly suits if you need to quickly relieve stress or just have fun!<br/><br/>Death Worm now supports iOS compatible game controllers (MOGA Ace Power, Logitech Powershell, SteelSeries Stratus, etc)", "metacritic": null, "released": "2010-11-06", "tba": false, "updated": "2024-03-20T13:29:27", "background_image": "https://media.rawg.io/media/screenshots/928/92861bd7f5774b2d50d2fe3f3df8027c.jpg", "website": "http://www.playcreek.com/deathworm/", "rating": 4.14, "rating_top": 4, "added_by_status": {"owned": 5, "beaten": 6, "toplay": 2, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 7, "suggestions_count": 267, "game_series_count": 0, "reviews_count": 7, "platforms": ["Android", "iOS"], "developers": ["PlayCreek"], "genres": ["Adventure", "Arcade", "Casual"], "publishers": ["PlayCreek"], "esrb_rating": null}