{"id": 17872, "slug": "fight-the-dragon", "name": "Fight The Dragon", "name_original": "Fight The Dragon", "description": "Build, Explore, Battle &amp; Loot in this <strong>GAUNTLET</strong> inspired <strong>USER CREATED</strong> hack’n slashCreate &amp; share Adventures like a true Dungeon Master of old!<br/><br/><br/><br/>Fight The Dragon is a <strong>COMMUNITY CREATED</strong> Hack'n Slash RPG where players can team up and tackle exciting adventures made by other community members in our in-game Adventure Construction Kit (ACK).It's <strong>DIABLO</strong> meets <strong>LITTLE BIG PLANET</strong><br/><br/>Follow us on twitter - http://twitter.com/3sprockets<br/><strong>Our Latest Dev Let's Play 9  Video... 18th December 2014</strong><br/>http://steamcommunity.com/sharedfiles/filedetails/?id=357821583 <br/>See all of our Dev Let's Play videos here...<br/>http://steamcommunity.com/app/250560/discussions/0/540743757658485898/<br/><br/>Players can play single player, local split-screen couch co-op (2 players) or online multiplayer (4 players) to complete 10-15 minute adventures in a non-linear order, which allows players to jump in for a quick fix or play multiple adventures over longer play sessions. Collect loot, level up, conquer enemies and become a master adventurer! Become the ultimate Dungeon Master you always dreamed of being!<br/><br/><br/>Fight The Dragon ships with a highly flexible in-game Adventure Construction Kit (ACK) that allows players to design, play and share their own adventures with other players on all platforms around the world.<br/><br/>The ACK (as is the gameplay) is designed to be as intuitive to use via a gamepad as it is via mouse and keyboard. Creators are able to sculpt and paint environments, place props, enemies, NPCs, Traps, checkpoints and other key game elements including hooking up basic logic systems for switches/gates and traps.<br/><br/>The Fight The Dragon community have already published over 1600 fantastic adventures, which means we have hundreds of hours of gameplay already created.<br/><br/><strong>ACK FEATURES</strong><br/><ul><li> Great assortment of Melee, Ranged and Mini-Boss Enemies<br/></li><li> Large selection of textures to paint environments with<br/></li><li> Static &amp; Dynamic props including realtime lights, traps, bridges &amp; more<br/></li><li> Super intuitive editor allowing rapid design<br/></li><li> In editor play testing at any time</li></ul> Dragon Battle Arena<br/><br/><br/>As heroes complete adventures and reach milestones, they earn tickets that allow them to go “Fight The Dragon” in the ultimate dragon battle arena.<br/><br/>Every player has their own dragon to fight, and each dragon has MEGA HP, so killing your dragon will require many encounters and a lot of skill. The damage you do to your dragon is persistent between play sessions, so collect as many tickets as you can and go battle it out! Each ticket grants the player 3 lives, but be warned, there are more ways to die in the dragon arena than just the dragon, so stay alert! Key Game Features<ul><li>In-Game Adventure Construction Kit – Create and share Adventures!<br/></li><li><strong>Over 300 hours of unique gameplay created by our community so far!</strong><br/></li><li>Action packed Hack-and-Slash Adventuring in your own creations<br/></li><li>Female and Male versions of all of our classes<br/></li><li>Local Drop-In Split-Screen Couch Co-Op<br/></li><li>Up to 4 player online Co-Op (cross platform)<br/></li><li>LAN server for local 4 player Co-Op<br/></li><li>Intense Dragon Fights with special dragon loot<br/></li><li>Full gamepad &amp; Big Picture support</li></ul>", "metacritic": 76, "released": "2014-12-04", "tba": false, "updated": "2023-05-02T21:13:34", "background_image": "https://media.rawg.io/media/screenshots/fd5/fd54738b25949a3b6af6133f1049be59.jpg", "website": "http://fightthedragon.com", "rating": 3.17, "rating_top": 3, "added_by_status": {"yet": 8, "owned": 323, "beaten": 2, "toplay": 3, "dropped": 9}, "playtime": 4, "achievements_count": 60, "ratings_count": 23, "suggestions_count": 572, "game_series_count": 0, "reviews_count": 24, "platforms": ["PC", "macOS", "Linux"], "developers": ["3 Sprockets"], "genres": ["RPG", "Indie"], "publishers": ["3 Sprockets"], "esrb_rating": null}