{"id": 178765, "slug": "chickens-revenge", "name": "Chicken's Revenge", "name_original": "Chicken's Revenge", "description": "Chicken's Revenge<br/><p>Chicken's Revenge est un jeu de réflexion (Puzzle game) où vous (la poule) devrez enfermer le(s) renard(s) en poussant les caisses.</p>Objectifs / Comment jouer<br/>\n<p>Si le renard arrive jusqu'à vous, il vous mange, vous perdez.<br/>Si vous arriver à enfermer le renard, vous gagner.<br/>Utilisez les touches de clavier (fleches) pour diriger la poule</p>Développement<br/>\n<p>Le jeu est développé pour la <strong>Gamecodeur Gamejam #7 </strong>en <strong>C# / Monogame</strong> (pour coller aux formations proposées sur GameCodeur).</p>\n<p><em>Il est actuellement en développement n'ayant pas eu le temps de le finir pour la GameJam. Beaucoup de changements sont donc à prévoir.<br/></em></p>GameCodeur<br/><ul><li> <strong>Elève Premium de Gamecodeur</strong><ul><li>Non</li></ul></li><li><strong>Langage et Framework utilisés</strong><ul><li>C# / Monogame</li></ul></li><li><strong>Code / Graphismes par<br/></strong><ul><li>Moi-même avec Gimp et Inkscape.</li><li>Graphismes temporaires téléchargés sur opengameart.org</li></ul></li><li><strong>Utilisation de librairies et codes externes :</strong><ul><li>Rien à part Monogame.</li></ul></li><li><strong>Temps passé</strong><ul><li>Recherche, conception, design (non utilisés finalement) : environ 10 heures</li><li>Apprentissage C#, apprentissage Monogame, Développement : environ 4 heure</li><li>(Je pensais pouvoir y consacrer beaucoup plus de temps et ai perdu trop de temps en design pour rien :'( )</li></ul></li><li><strong>Comment as-tu (ou pas) abordé la contrainte du thème</strong><ul><li>J'ai commencer par chercher \"Qu'est-ce qu'un Puzzle Game\".</li><li>Ayant compris qu'il s'agissait d'un jeu de réflexion avec une grille, j'ai chercher les jeux populaires de ce type et en suis arriver aux iddées/possibilités suivantes :<ul><li>Un 2048 : Je l'ai déjà fait, mais en Java/LibGDX : Ca ne cole pas aux formations Gamecodeur et n'aurais pas d'intérêt à être re-développer en C#</li><li>Un Démineur : idem</li><li>Un Tetris : Atelier Gamecodeur, j'avais commencer avant la Jam, mais je me suis dit (par erreur) qu'étant un atelier fait, tout le monde aller en faire un et ça ne serais pas original</li><li>Un remake de Rodent's Revenge, un petit jeu de 1991 que j'adorais sous Windows 3.1 =&gt; <strong>Bingo</strong></li></ul></li></ul></li><li><strong>Petit postmortem (avis sur le langage/framework utilisés, difficultés, succès, choix, bilan personnel rapide, etc...)</strong><ul><li>Développeur Web (PHP/JAVA) professionnel depuis 12 ans et développeur de jeux amateur et autodidacte (JAVA/LibGDX) depuis 1 ans, j'ai décidé, suite aux conseils de David de se diversifier, de me (re)mettre au C# (que j'avais à peine aborder il y a 13 ans) avec Monogame pour cette JAM.</li><li>IDE =&gt; Retour à Visual Studio : Très déçu. J'avais le souvenir d'un éditeur complet et moderne (il y a 13 ans), Visual Studio 2017 (et pire encore MonoDevelop) me semble aujourd'hui très lourd, lent et très en retard, notament par rapport aux IDE de JetBrain que j'utilise tous les jours pour PHP et JAVA</li><li>Langage =&gt; C# : Similaire dans la syntaxe à PHP et JAVA, je n'ai eu aucun soucis à me mettre à ce langage (je n'ai d'ailleurs suivit aucun tuto ou cours, juste des docs sur des points précis) tellement les langages sont similaires (C/C++/C#/PHP/JAVA, etc.). Quelques spécificité de C# me laisse très dubitatif et le déploiement m'a laisser sur le carreau : Je n'ai pas réussi à faire un déploiement digne de ce nom avec le peut de temps que j'ai eu.</li><li>Framework =&gt; Monogame : Très déçu. Très bas niveau par rapport à LibGDX que j'ai l'habitude d'utiliser. Si certaine fonctionnalité (gestion des assets) sont très pratiques, beaucoup, beaucoup d'autre sont juste complètement absente (ou je ne les ai pas trouver) et il faut donc les re-coder entièrement : Gestion d'UI (Boutons, blocs de textes, mise en page, tableaux, etc.), gestion d'algorithme d'IA (Pathfinding, etc.), gestion des animations (WTF, il n'y à rien pour gérer les animations de sprites et autres fondus ? Obliger de les coder à la mains ?), gestion des écrans tactiles, des préférences de fenêtres, etc.<br/>Aucune doc officielle, beaucoup de docs brouillons et souvent non-fonctionnel (surtout sur XNA dont Monogame est issue).<br/>Bref... Un framework beaucoup trop bas niveau. à mon sens pas utilisable pour de réel projets (sauf à vouloir tout re-coder à la mains).<br/>Il reste cependant sans doute une bonne transition entre un langage type Lua et un éditeur type Unity3D pour comprendre les mécanisme de base (cycle de jeux).</li><li>Développant sous Linux et à destination multi-plateforme (Windows, Android, Linux), je ne pense réellement pas faire d'autres jeux avec Monogame.</li><li>Cette expérience m'a apporter toutefois plusieurs réponses :<ul><li>Le 1er choix était sans doute le bon (pour moi et mes besoins/envis) : JAVA/LibGDX</li><li>David à raison sur ce fait : Si tu as les base d'un langage, passer à un autre langage du même type est totalement trivial.</li><li>De même pour les framework de jeux  : Le fonctionnement et les mécaniques de jeu restent globalement les mêmes</li><li>C#/Monogame est-il un bon choix aujourd'hui ? Pas pour moi.</li><li>Peut-on passer facilement d'un langage/framework à un autre ? Oui ! 4 heure pour faire un jeu avec un langage et un framework que je connaissait pas... Passage de Java/LibGDX à C#/Monogame sans aucun soucis ni interrogation (si se n'ai \"quelle est la syntaxe pour faire ça ?\")</li></ul></li><li>Pour le prochain jeux, je testerais HaxeFlixel. J'ai développé dans le passer en AS3 dont je garde des bon souvenirs et le framework à l'air de proposer un \"VRAI\" multi-plateforme et des outils sympas (algo, UI, effets, etc.). Seul bémol, à voir, l'IDE.</li></ul></li></ul>", "metacritic": null, "released": "2017-06-15", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/283/2830336198c064c8d4197fba7d838ed5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 23, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Neeftarah"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}