{"id": 17875, "slug": "guacamelee-super-turbo-championship-edition", "name": "Guacamelee! Super Turbo Championship Edition", "name_original": "Guacamelee! Super Turbo Championship Edition", "description": "<p>Guacamelee! is strongly inspired by colorful Mexican aesthetics and folklore. Your protagonist, Juan Aguacate, used to be a regular farmer until one day he found a magic mask of a Luchador, that is, a Mexican wrestler. His mission is to save El Presidente&#39;s daughter who was captured by evil Carlos Calaca. The villain wants her as a sacrifice to open the gates to the World of the Dead. In a cooperative mode, Juan is aided by female luchador Tostada.</p>\n<p>Despite being a traditional Metroidvania platformer, Guacamelee! is also, surprisingly, an open-world game. You can go in any direction in this 2D world. For example, if you climb down, this counts as going south on the map. Action in Guacamelee! is inspired by fighting games like Mortal Kombat, and the controls are very responsive. The monsters are varied and very Mexican: they include traditional Dia de Los Muertos skeletons, feral armadillos, and evil cacti.</p>\n<p>The Super Turbo Championship Edition adds several new features, such as Intenso mode that makes your characters way stronger for a short amount of time. Health bars above your opponents&#39; heads are introduced. This edition also features new enemies, levels, and even a new boss in this edition.</p>", "metacritic": 86, "released": "2014-07-01", "tba": false, "updated": "2024-04-06T13:00:22", "background_image": "https://media.rawg.io/media/games/fc8/fc838d98c9b944e6a15176eabf40bee8.jpg", "website": "http://guacamelee.com/", "rating": 3.55, "rating_top": 4, "added_by_status": {"yet": 396, "owned": 5119, "beaten": 420, "toplay": 76, "dropped": 251, "playing": 38}, "playtime": 3, "achievements_count": 197, "ratings_count": 811, "suggestions_count": 427, "game_series_count": 0, "reviews_count": 815, "platforms": ["PlayStation 4", "Xbox 360", "Wii U", "Nintendo Switch", "PC", "Xbox One"], "developers": ["DrinkBox Studios", "Broken Rules"], "genres": ["Action", "Indie", "Platformer"], "publishers": ["DrinkBox Studios"], "esrb_rating": "Everyone 10+"}