{"id": 178732, "slug": "ironclaw-circus", "name": "Ironclaw Circus", "name_original": "Ironclaw Circus", "description": "<p>Controls - <br/></p>\n<p>Arrow keys to move, hold SHIFT to dash, Z to accept, X to cancel or open the menu. </p>\n<p>If you're on a phone or some other device with a touchscreen, single tap to select, tap with two fingers to cancel or open a menu.  The web-version also should have little to no combat sound effects so, that's why there's only the battle music.  I had to do something to get the file count below 500 for itch.io.  In addition, while it should be mostly possibly bug-free, I'm not going to spend a lot of time on it AND on top of that, it ends even earlier than the downloadable ones.<br/><br/>  <br/></p>\n<p>This game is based around a small circus, two unsavory veterans, two unsavory newcomers.  They've been recently betrayed by a fifth member who skipped town, and now they're out for revenge.<br/><br/>While there is a plot, I'm trying to make it so that you can play through multiple ways, avoiding certain things if you wanted with the idea being that - while there's only so much you can do for variation where the end point (Revenge!) remains the same, I'm hoping to get a game that you can play through two or three times and have a different enough experience to make it worth your time.<br/><br/>If you play it for an hour or so and then wonder why it just kinda stops.... that’s because you probably got as far as there is.  This isn’t even a Chapter 0.  It’s the framework and start of a thing.<br/><br/>I'm currently using the default graphics because I'm awful at graphics.  If this is a problem for you enough that you feel you need to tell me, I only accept criticism with art samples and a timeline for drawing all new art for the game.<br/><br/>If you give me money you're dumb, as I'm liable to get bored and wander off in three months.  But I'm not stupid enough to turn down free money either.  At least I'm honest.<br/></p>\n\n\n<p>Credits - <br/><br/>Item and status icons taken from https://game-icons.net/ using https://creativecommons.org/licenses/by/3.0/<br/></p>\n\n<p>\"Grim Idol\"Kevin MacLeod (incompetech.com)<br/>\"Darkness Speaks\" Kevin MacLeod (incompetech.com)<br/>\"Corruption\" Kevin MacLeod (incompetech.com)<br/>\"Dark Dance\" Kevin MacLeod (incompetech.com)<br/>\"Darkening Developments\" Kevin MacLeod (incompetech.com)<br/>\"Death and Axes\" Kevin MacLeod (incompetech.com)<br/>\"Gathering Darkness\" Kevin MacLeod (incompetech.com)<br/>\"Mischief Maker\" Kevin MacLeod (incompetech.com)<br/>Licensed under Creative Commons: By Attribution 3.0 License<br/>http://creativecommons.org/licenses/by/3.0/<br/></p>", "metacritic": null, "released": "2018-05-30", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/d0e/d0ef134b40307fb3ac963e6ba0b88be5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 13, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux", "Web"], "developers": ["secondtalon"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}