{"id": 178733, "slug": "endless-jewels", "name": "Endless Jewels", "name_original": "Endless Jewels", "description": "<p>Bored? Time to kill? Then<strong><em> Endless Jewels</em></strong> is just the game for you!</p>\n<p>Endless Jewels is a casual-puzzle game created by Alpaca Studio. Endless Jewels offers the same quality and game play experience one might find in the vast array of \"Jewel\" games. However Endless Jewels doesn't come packed with timers, coins, challenges, or \"daily rewards\". You just play as long as you wish (or until you run out of moves) and quit when your done. (If you do run out of moves you would just click the '<em>Restart'</em> button. On every restart or quit, current score will be reset and the leaderboard will be updated accordingly. )</p><p><em><strong>Endless Jewels</strong> Standalone</em> for PC, Linux, and Mac is now available for free.  Get the android  version here: https://play.google.com/store/apps/details?id=com.AlpacaStudio.EndlessJewels</p>\r\nHow to Play\r\n<p>The objective of the game is to match as many jewel pairs as you can. The minimum required for a match is 3.  Matches can be vertical or horizontal, but <em>NOT</em> diagonal. Certain jewel pairs vary in points given per jewel. Each <em>Alpaca Jewel ( , </em><em> ) is</em> worth 10 points a piece, while all other jewels are worth 5 points.</p>\n<p><em> First time players may notice a 1-2 minute load time. This is because your browser is downloading the Endless Jewels game-files to your browsers cache in order to provide quicker loading in the future. If you have any issues loading the game, try refreshing the page. </em></p>\n<p>Once Endless Jewels finishes loading you're presented with the game's menu screen. You can begin playing as a guest user or enter your own username at the bottom center of the screen. <strong><em>When creating a username, please exclude any vulgar language, keep it PG rated.</em></strong></p>\n\n<p><em>NOTE: This game is in development and may contain bugs :( If you stumble across any you should let us know so we can get it patched up. On the bright-side, it would be the perfect time to suggest any new features and/or modifications to some old ones :D</em><br/></p>\n<p>__________________________________________________________________________</p>\n<p>By using, or downloading this software you agree to Alpaca Studio's EULA provided here.</p>\r\nCredits\r\nInterface Design<em>, Additional Game Art</em> - Alpaca Studio. <br/>Programming - Alpaca Studio. <br/>Game Mechanics, Additional Game Art - pondomaniac (http://pondomaniac.wix.com/pondomaniac). <br/>Music - Circlerun (https://opengameart.org/users/circlerun). <br/>Sound Effects - NenadSimic (https://freesound.org/people/NenadSimic/).", "metacritic": null, "released": "2017-12-24", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/40a/40ae8b1e3620fe6c57b9d70e2ad19978.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 117, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Web"], "developers": ["Alpaca-Studio"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}