{"id": 17887, "slug": "jagged-alliance-online-reloaded", "name": "Jagged Alliance Online: Reloaded", "name_original": "Jagged Alliance Online: Reloaded", "description": "Jagged Alliance Online: Reloaded brings the turn-based strategy classic back to life as a Single- and Multiplayer tactical combat game at an unbeatable price!<br/><br/>YOUR MISSION: Survive and build  the toughest frigging merc outfit in the world! Create and train your team of mercs selected from the well-loved Jagged Alliance characters, grab your gear and expand and evolve your headquarter to beat any opposition you may encounter.<br/><br/>Match your tactical skills against other players to win Warzones with your allies and lead your company to victory and great rewards. With 3D graphics, challenging tactical missions, your own headquarter and hundreds of new weapons and gear, this is turn-based strategy at its best!Key Features:<ul><li> Extensive stealth and perception mechanics including hearing and sight affected by weather and time of day<br/></li><li> Over 100 missions and 60+ hours of game time<br/></li><li> Select from over 40 mercenaries with individual attributes<br/></li><li> Over 500 different weapons and equipment items<br/></li><li> Build up your own expandable and upgradeable headquarter<br/></li><li> Crafting to improve your team's weapons and armor<br/></li><li> Face the ultimate challenge in live PvP and get to the top of the leaderboard<br/></li><li> Compete against players and alliances for rare gear and weapons in time-limited Warzone events <br/></li><li> Forge alliances with other players and compete as a team</li></ul><strong>Do You Have What It Takes to Become the Best?</strong><br/>This version of the game has been expanded, rebalanced and overhauled to get rid of any and all free to play mechanics, so it is about one thing only: YOUR SKILL.", "metacritic": null, "released": "2015-09-24", "tba": false, "updated": "2022-08-30T15:15:43", "background_image": "https://media.rawg.io/media/screenshots/488/488658d037a9a285f079095aba39a4c9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 22, "dropped": 1}, "playtime": 5, "achievements_count": 32, "ratings_count": 3, "suggestions_count": 469, "game_series_count": 14, "reviews_count": 3, "platforms": ["PC"], "developers": ["Cliffhanger Productions"], "genres": ["RPG", "Strategy", "Indie"], "publishers": ["THQ Nordic", "Cliffhanger Productions"], "esrb_rating": null}