{"id": 178912, "slug": "power-putt", "name": "Power Putt", "name_original": "Power Putt", "description": "<p>Power Putt is based on retro coin-op and console driven games that I've grew up on.  It has mixed and meshed concepts from many games from the 70's thru the late 90's.   It plays like golf but without the complicated rules.  In addition, I plan to add extra elements to it in the future but for now it's good enough to be at v 1.00 status.  All the controls are on-screen with this project and only uses a mouse for PC based systems.</p><p>Basic instructions are in-game.  However, I highly encourage *READING* the complete &gt;&gt;DOCS&lt;&lt; for the game as it explains all the concepts for the game.  Especially, dealing with hole-in-one concepts and platform - boundary provisions....  Along, with a whole slew of otherwise; subjective head scratching at a glance..</p><p>To start to end this project is completed around the original principal concept I started with.  Therefore, commenting will be disabled aside from community commenting..</p><p>NOTE: WEBGL is not needed to play Power Putt.  Also, If you have modified your browser's font settings.  It will have a direct effect on Power Putt.  All the browsers that I've tested Power Putt on, were left at the default settings..  </p><p>NOTE: On small device's, there may or not be sound.. It depends on the conformity of the device to the HTML5 standard...  Sorry for the inconvenience....</p><p>NOTE: Mini-games are meant to be challenging.  In addition, for the most part, are transparent to each other.  Read the docs concerning mini-games for more info.</p><p>Cue-ball: like the game pool. Except, only cue-balls are used(saving memory and file space for HTML5 format).  Flashing emitters are used as holes.  The primary hole-in-one can be hit as well for lesser score.</p><p>Hoops:  An orange basket ball is randomly placed at the start of each zone.  The basket hoop is placed randomly in three places:  Far left,center,and far right.  Hitting the hoop with the basket ball gives a huge score and trick-shot bonus.  If hit with the player's main ball(only on the falling of it)a bonus is earned as the ball goes through the hoop.  The latter bonus can achieve over a million in score and 500 in trick-shot bonus.</p><p>I've have reduced the frames of Powerputt to comply with Itch.io's HTML5 format.  If you are looking for the full version then download for local play.. Small devices currently don't apply. Otherwise, check the link below for typical devices.. NOTE: some devices will not support sound readily....</p><p>http://gamejolt.com/games/powerputt/231135<br/></p>", "metacritic": null, "released": "2017-04-28", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/0aa/0aab792abca2fffbae1aaee482e47a94.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 92, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Android", "Web"], "developers": ["mrpete"], "genres": [], "publishers": [], "esrb_rating": null}