{"id": 17893, "slug": "midnight-mysteries-salem-witch-trials", "name": "Midnight Mysteries: Salem Witch Trials", "name_original": "Midnight Mysteries: Salem Witch Trials", "description": "The famed writer Nathaniel Hawthorne has died during a freak snow storm, and his ghost has come to you, asking for help.  There’s more to this case than first appears, and only you can help free his spirit.  Why was it snowing in May?  Could Hawthorne’s powerful friends and the Oval Office have something to do with the author’s untimely death?  How do legends of witchcraft play into the death of a writer 170 years later? <br/>Travel back and forth in time from the scene of the author’s demise to the 17th century, where a town is going mad with rumors of witchcraft and a woman is facing accusations and the gallows.  Unravel the secrets of Salem’s accused witches and solve the mysterious death of Hawthorne in this Midnight Mystery!Key Features:<ul><li>Complete 10 Adventure Missions<br/></li><li>Explore the spooky terrain and structures of Salem village inside and out, interview apparitions, solve brain-teasing puzzles, and collect hidden objects<br/></li><li>Unravel the conspiracy of the Salem Witch Trials<br/></li><li>Collectible clovers let you unlock an unlimited hidden object mode!<br/></li><li>Hawthorne guides you through time to unravel his mysterious death<br/></li><li>Sequel to the hit Midnight Mysteries: The Edgar Allan Poe Conspiracy</li></ul>Collector’s Edition Features:<ul><li>Collector’s Edition includes detailed, illustrated Strategy Guide<br/></li><li>Find two hidden Easter Eggs to play special hidden object modes<br/></li><li>Artful character sketch index to explore</li></ul><br/>***Please note, to use Achievements you must select the Achievements tab under beta. This version is not compatible with all Win7/8 machines.", "metacritic": null, "released": "2010-08-05", "tba": false, "updated": "2023-08-15T11:44:21", "background_image": "https://media.rawg.io/media/screenshots/95e/95e31b355f4bd4c12e0eb0f1e9e0bf55.jpg", "website": "http://www.facebook.com/MumboJumboGames", "rating": 3.0, "rating_top": 4, "added_by_status": {"yet": 3, "owned": 304, "beaten": 5, "toplay": 2, "dropped": 1}, "playtime": 2, "achievements_count": 14, "ratings_count": 6, "suggestions_count": 588, "game_series_count": 0, "reviews_count": 6, "platforms": ["iOS", "PC"], "developers": ["MumboJumbo"], "genres": ["Adventure", "Casual", "Puzzle"], "publishers": ["MumboJumbo"], "esrb_rating": null}