{"id": 17926, "slug": "space-run", "name": "Space Run", "name_original": "Space Run", "description": "<strong>Space Run </strong>is a «<strong>real-time spaceship construction strategy game</strong>». Space Run takes the well-known Tower Defense-style gameplay and twists it, challenging you to manage and protect a spaceship and its cargo against the hazards of deep space!<br/><br/>Space can be a dangerous place. You’re one of the most daring «Space Transporters», people who carry the dangerous task of transporting valuable shipments from one place to another across hazardous space. This supposedly simple task gets tricky once you add dense asteroid fields that regularly cross the space lanes, the armed-to-the-teeth pirate starfighters and spaceships all too willing to shred your ship for your cargo, as well as the other Space Transporters you are competing against!<br/><br/>Take on increasingly difficult missions as your reputation grows: bringing more expensive cargo to their destination will earn you credits to unlock new ship modules and upgrades that will help you survive the lethal threats of space: laser turrets, missile launchers, protection shields, thrusters, power generators... you name it! You’ll have to quickly adapt to every new situations if you wish to survive, building modules on your ship as you fly across space. The faster you fly and reach your destination, the better your reputation, allowing you to unlock more difficult delivery missions!<br/>Space Run boasts high replay value: replay earlier missions with the new modules you unlocked in order to complete them faster and score higher... and show your friends you’re the fastest, most daring Space Transporter ever!<br/><br/><strong>Main Features:</strong><br/>•\tAccessible and extremely dynamic gameplay that puts a new twist on the well-known Tower Defense genre<br/><br/>•\tBuild your spaceship on the fly to adapt to every situation, protecting your valuable cargo and beating your competitor in deadly delivery races<br/><br/>•\tEarn credits to Unlock &amp; Upgrade new ship modules, allowing you to better defend yourself, attack other cargo, and complete your missions faster to gain higher reputation<br/><br/>•\tHigh replay value: replay earlier missions with the modules you unlocked to best your friends’ and your own scores!!", "metacritic": 73, "released": "2014-06-13", "tba": false, "updated": "2024-04-06T12:23:12", "background_image": "https://media.rawg.io/media/screenshots/282/2824a1b82f4625432fece85df0c62626.jpg", "website": "http://spacerun-thegame.com/", "rating": 3.16, "rating_top": 4, "added_by_status": {"yet": 17, "owned": 616, "beaten": 4, "toplay": 1, "dropped": 7}, "playtime": 5, "achievements_count": 30, "ratings_count": 19, "suggestions_count": 360, "game_series_count": 0, "reviews_count": 19, "platforms": ["iOS", "PC", "Linux", "macOS"], "developers": ["Focus Home Interactive", "Passtech Games"], "genres": ["Strategy", "Indie"], "publishers": ["Focus Home Interactive"], "esrb_rating": "Everyone 10+"}