{"id": 17939, "slug": "conquest-of-champions", "name": "Conquest of Champions", "name_original": "Conquest of Champions", "description": "Conquest of Champions is the perfect blend of Collectible Card Games and deep turn-based tactical strategy that only the creators of PoxNora could deliver. Think 'Magic the Gathering' meets 'Warhammer' or Chess.  <br/><br/>Build your personal deck strategy and bring your cards to life by summoning fully animated creatures, casting devastating spells, and equipping powerful weapons all within battlegrounds that are reminiscent of tabletop miniature warfare. <br/><br/>ModesYou can choose to complete an entire match in real-time or you can take turns asynchronously and complete matches that extend over several days. <br/><br/><br/>Conquest offers both PvP and single player options. In PvP you can challenge your friends or climb the leaderboards &amp;amp; compete in tournaments by battling ranked opponents. Currently our single player options are just practice battles but our development roadmap includes full campaigns and boss battles.Free to PlayConquest is free-to-play in that you are given a free Hero and starter deck when you register and then can unlock the other two factions at level 3 and level 6.  You will earn additional cards, components (used in crafting), gold, and experience just by taking ranked turns and completing matches and quests.  Everything in the game can be earned.  As you play you will be able to expand and customize your deck with the cards you unlock.  <br/><br/><br/>For those who do not want to wait, we offer a couple DLC bundles which allow you to acquire Hero decks at a bulk discount. The 'Starter' includes one hero from each faction for the price of two heroes. The 'Mega-Hero' includes every Hero in our release set and first expansion (this assumes you get to level 6 for the starter ones).  <br/><br/>Features  * 3 game modes: Single Player Campaign, Asynchronous PVP, or Real Time PVP.<br/><br/>  * Customize unique decks with over 200 cards (new expansions every 3-4 months).<br/>  * 3 Factions to choose from: Stonehold (Dwarves, Constructs, and Barbarians), Briarwood (Elves, Beasts, Fibians, and Treefolk), and Embercult (Demons, Undead, and Dragonkin)<br/>  * Each soldier has unique attributes and up to two special abilities such as ‘Double Attack’ or ‘Chain Lightning’.<br/>  * Earn experience, gold, components, and cards by taking turns in ranked matches or completing friendly matches.<br/>  * Global ranking system - play ranked games to climb the leaderboard.<br/>  * Make cards more powerful by fusing them together.<br/>  * Craft exotic rare cards by completing sets of components earned through gameplay.<br/>  * Daily Quests and Achievements<br/>  * Regular Tournaments scheduled seasonally<br/>  * Exchange strategies with your friends via the lobby chat.<br/>  * Cross-Platform play! Mac/PC and coming soon for iOS and Android tablets and mobile devices!<br/>  * 3 Unique Map Backgrounds (Mountains, Forest, Caverns), each with multiple map layout variations.<br/><br/>Early AccessWe are excited to open the doors to the beta to give a sneak peek at what is coming with Conquest. While the game is very much playable we have a great deal of features to add. Some of which include:<br/><br/>- Expansion Content:  We will be releasing regular expansions to add additional depth and strategy to the game.<br/>- Auction House / Trader<br/>- Tablet Build: With cross-platform support. <br/>- Guilds<br/>- Automated Tournaments: Round Robin, Draft, etc<br/>- Spectator Mode / Replays: Ability to watch others play. This was highly demanded during our first tournament and we can't wait to get it in.About UsKihon is comprised of the core PoxNora team and holds years of experience building a successful CCG community. We are small closely knit team based out of Tucson, AZ.<br/><br/><br/>", "metacritic": null, "released": "2014-04-23", "tba": false, "updated": "2022-08-30T12:55:10", "background_image": "https://media.rawg.io/media/screenshots/7e3/7e3c06110c373e22d26e16f9bfd2cb27.jpg", "website": "http://www.conquestofchampions.com", "rating": 1.33, "rating_top": 1, "added_by_status": {"yet": 7, "owned": 360, "dropped": 3, "playing": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 6, "suggestions_count": 536, "game_series_count": 0, "reviews_count": 6, "platforms": ["macOS", "PC"], "developers": ["Kihon"], "genres": ["RPG", "Strategy", "Indie"], "publishers": ["Kihon"], "esrb_rating": null}