{"id": 179422, "slug": "1-million-de-cv", "name": "1 Million de CV", "name_original": "1 Million de CV", "description": "<p>\"1 Million de CV” propose de libérer les vieux codes des entretiens d'embauche sur l'apparence physique et vestimentaire. Et si porter une casquette était le reflet d’une nature ambitieuse et volontaire tout comme le costard à son époque ? Les rôles du boss et du candidat sont ici confondus et interchangeables, où l’apparence n’a plus d’importance, seul le langage corporel compte pour éviter les situations coquasses.<br/></p>\n<p>Ce projet est l’association improbable de l’univers du jeu vidéo et du clip. Pour synthétiser cette fusion, ce mélange unique a permis de créer un véritable clip interactif réalisé en 48 h avec plus de 120 séquences filmés.</p>\n<p>Site internet du jeu : https://www.lecortex.com/1000002CV/</p>\n<p>- 60sFilmz : Notre sociéte de productions est specialisée dans l'entertainment et dans la production de contenus audiovisuels depuis 2012.</p>\n<p>Retrouvez leur site 60sfilmz</p>\n<p>- William Thomas : William Thomas vient tout juste d’avoir 19 ans, mais a déjà quatre-cent clips de rap réalisés à son actif. Niska, Gradur, MHD, Pso Thug, XVBarbar se paient les services de ce talent qui doit encore jongler entre le lycée, le Bac et les tournages.</p>\n<p>Retrouver sa chaine Directed By WT</p>\n<p>- LE CORTEX. : Studio parisien indépendant, Le Cortex conçoit, écrit et développe des jeux avec l'ambition de proposer des mécaniques ludiques inédites.</p>\n<p>Retrouvez leur site Site Web</p>\n<p>- Pierre Gempp est étudiant à l'IUT de Bobigny en spécialité Game Designer/Level Designer.</p>\n<p>Retrouvez son site Pierre Gempp</p>", "metacritic": null, "released": "2018-02-11", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/266/266e1e288e6d9411152f84e1798c3be0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 109, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["frederic sommer"], "genres": [], "publishers": [], "esrb_rating": null}