{"id": 17946, "slug": "carrier-command-gaea-mission", "name": "Carrier Command: Gaea Mission", "name_original": "Carrier Command: Gaea Mission", "description": "<p>From the creators of the award-winning Arma™ tactical military shooter series comes a next-gen re-imagination of a groundbreaking 80s classic. Set in a vast open archipelago, Carrier Command: Gaea Mission brings a breathtaking combination of action game and strategy elements!<br />\nAs a result of a catastrophic war between the United Earth Coalition and the Asian Pacific Alliance, Earth has been rendered an almost uninhabitable wasteland. The only hope lies in a distant planetary system, where the moon Taurus holds the key to restoring Earth&#39;s dwindling water supply. As a battle-hardened member of the surviving UEC forces, Lt Myrik is put in command of an armed vehicle carrier. By traversing the seas and establishing a network of island bases, his mission is to hunt down the enemy and conquer the Dead Zone on the planetoid Taurus. Key Features<br />\nStory-Driven Campaign<br />\nFollow the immersive storyline as you evolve from underdog rookie to Carrier Commander in a battle against overwhelming odds.<br />\nStrategy Campaign<br />\nExperience the original 80s classic; select startup settings, the balance of power and challenge the enemy carrier to an ultimate strategic duel. Explore 30+ unique islands in 6 distinct climatic zones.<br />\nIsland Network<br />\nRoam the seas to establish a network of island bases for defense, mining and manufacturing. A steady supply of resources is vital to your campaign’s success.<br />\nUnit Customization<br />\nBuild new upgrades and weapons for your Carrier and combat units, but keep an eye on fuel and ammo.<br />\nJoin the Action<br />\nGet into the heart of the action by taking direct control of any unit. Shift seamlessly from combat vehicles to strategic map via the unique Picture-in-Picture window.</p>", "metacritic": 53, "released": "2012-09-28", "tba": false, "updated": "2023-09-18T19:28:42", "background_image": "https://media.rawg.io/media/screenshots/d7b/d7b5c30794636298bd74f39a81184242.jpg", "website": "http://www.carriercommand.com", "rating": 2.56, "rating_top": 3, "added_by_status": {"yet": 29, "owned": 684, "toplay": 4, "dropped": 7}, "playtime": 1, "achievements_count": 45, "ratings_count": 18, "suggestions_count": 547, "game_series_count": 0, "reviews_count": 18, "platforms": ["Xbox 360", "PC"], "developers": ["Bohemia Interactive"], "genres": ["Action", "Strategy"], "publishers": ["Bohemia Interactive", "Rising Star Games"], "esrb_rating": "Mature"}