{"id": 179542, "slug": "vicious-virus-vs", "name": "Vicious Virus Vs", "name_original": "Vicious Virus Vs", "description": "Vicious Virus Versus\r\n<p><em>Vicious Virus Versus</em> is a 2 to 6 player arena infector. You are a virus with the goal of infecting as many cells as possible. Hop from cell to cell to rack up points but stay outside too long and you will parish, losing everything. Healthy cells and infected cells damage each other, so act quickly and aggressively, these cells wont last forever. Knockout any other viruses in your way and be the last virus standing.</p>\r\nGame Modes\r\n<p><strong>Sudden Death</strong> - When a player dies, thats it. They lose all points and don't come back.</p>\n<p><strong>Infection</strong> - When a player dies, they re-spawn but lose their points. All players re-spawn until there are no healthy cells left.</p>\n<p><strong>Timed</strong> - Like infection with a time limit.</p>\n<p><strong>Single Player</strong> - Rack up as many points as you can in 60 seconds. Just you vs the clock. Cells re-spawn so there is no point cap.</p>\r\nControls\r\n<p>This game is optimized for Gamepads. <br/></p>\n<p>D-pad to move.<br/>Face buttons Jump.<br/>Start button Pauses.<br/></p>\n<p>Optional controls for players 1 and 2:<br/>Player1 - Arrows and 'M' or '&lt;'<br/>Player 2  - WASD + 'C' or' V' </p>\r\nScores\r\n<p><em>Vicious Virus Versus</em> now saves your scores automatically after every match. You can view your high scores for each mode by selecting <strong>SCORES</strong> in the main menu.<br/></p>\r\nNames\r\n<p>The six player colors can be re-named to whatever you want. Now when your friends come over, everyone can name their character.</p>\r\nDevelopment\r\n<p><em>Vicious Virus Versus</em> was originally created at the 2018 Global Game Jam. I composed its unique sound and music effects by making live foley recordings. Notes were created using a glockenspiel, kalimba, and guitar, all instruments I don’t actually know how to play.</p>\n<p>The two most requested features at the moment are: Special Abilities (these could either manifest themselves as classes or powerups)  and Online Play (like an IO game). Both of these requests would be interesting  to pursue but I would like to see how big the demand really is. If you decide to purchase this game, please let me know what direction you want me to develop. You are my audience.</p>", "metacritic": null, "released": "2018-01-28", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/8d7/8d71ffdbf36c9bece5a679b5ed7a0285.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 35, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Artfail"], "genres": ["Action"], "publishers": [], "esrb_rating": null}