{"id": 179698, "slug": "extreme-stunts-3d-car-demolition-legends", "name": "Extreme Stunts: 3D Car Demolition Legends", "name_original": "Extreme Stunts: 3D Car Demolition Legends", "description": "<p>Get ready to master the art of demolition destruction. <br/>Extreme Stunts 3D car demolition legends features realistic vehicle physics and specially destruction for the players to enjoy.<br/>The game is not just about destroying the cars but also features a lot of amazing stunt levels and a great number of hurdle filled levels.<br/>The game features 4 different vehicles for the player to unlock using the coins earned by completing the hurdle challenges. <br/><br/>The game includes :-<br/>- Toyota Supra<br/>- Hummer<br/>- Mitsubishi Evolution<br/>- Jeep<br/><br/>There are 2 types of control settings that you can choose from. The game allows the player to repair their car by using the repair button on the top right of the screen. The repair button will reset the car position to the last collected checkpoint. If you do not want to repair your car but your car is upside down, you can use the flip button on the top left of the screen to just flip the car. Make sure you let the vehicle come to a stop before using the flip button.<br/><br/>The game features ramps, half loops, full loops, straight up jumps and many many more stunts for the players to enjoy. Also it includes hammers, fans, compression pushers for the players to have fun with.<br/><br/>The game allows the player to choose free roam mode so that player can enjoy driving in the huge environment and have total fun of the stunts and car demolition.<br/><br/>The game makes it impossible to complete the levels without getting hammered down.<br/>enjoy the game and go crazy with derby demolition.<br/><br/>P.S. The game features advertisements which we need in order to keep making games. Using the repair button 3 times will execute an advertisement once.</p>", "metacritic": null, "released": "2018-04-11", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/b56/b56fface81a3687a5e5b1157befc3873.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 270, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["BringItOnGames"], "genres": ["Racing"], "publishers": [], "esrb_rating": null}