{"id": 17962, "slug": "chasing-dead", "name": "Chasing Dead", "name_original": "Chasing Dead", "description": "Chasing Dead is a story-based, Sci-fi/Horror First-Person Action Shooter.<br/>\r\nThe game begins with a strange phenomenon in which another Earth appears in our skies. The curiosity and fear of a doppelganger planet initiates multiple missions in order to make contact with the duplicate Earth. A team of agents, astronauts, and scientists were sent 955,600 miles across space by NASA and the US Military, however all contact is lost a few hours after their arrival. You play as a marine named \"Jake\" who is sent on a mission to retrieve any research and data left behind by the original survey team while fighting off hostile forces.<br/>\n<br/>\r\nJake is a 29 year-old mercenary who is a former DEA agent and soldier who is hired by US government.<br/>\r\nDuring his training he was a identified as a lone wolf. He was recruited not just for his combat skills but for his self-driven tenacity and ability to make sound decisions on his own without the need for guidance. After his recruitment, he underwent a cybernetic operation that protects him from infection by the creatures of the parallel Earth. Jake suddenly wakes up in a crashing plane with no memory of his mission or any of events that happened after his arrival.<br/>\n<br/>\r\nChasing Dead features a wide variety of locations as players explore the horrifying, zombie-ridden lands of the parallel Earth.<br/>\r\nPlayers will roam the snowy Russian tundra, traverse the hot deserts of Afghanistan and venture through the ruined cities of Ukraine as they fight off creatures that were created through mankind's self-destruction. This brave new world is fraught with horrors as players try to survive lethal perils such as a crashing airline flight, an abandoned mine, a dilapidated hospital and a haunted house. Appropriately, at every location, they will face the voracious hordes of the undead, abominable mutants and insane soldiers that inhabit this world.", "metacritic": null, "released": "2016-03-03", "tba": false, "updated": "2019-08-28T22:10:04", "background_image": "https://media.rawg.io/media/screenshots/658/658826e0b3effb6b44e66c567ea56756.jpg", "website": "http://www.ChasingDead.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 8, "beaten": 1, "toplay": 3}, "playtime": 13, "achievements_count": 10, "ratings_count": 2, "suggestions_count": 578, "game_series_count": 0, "reviews_count": 2, "platforms": ["Wii U", "PC", "Linux", "macOS"], "developers": ["2020 Venture"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["2020 Venture"], "esrb_rating": null}