{"id": 17988, "slug": "spectrubes", "name": "Spectrubes", "name_original": "Spectrubes", "description": "A new addictive puzzle game from the creators of <strong>Big Journey to Home</strong>, inspired both by the eighties and the modern games – we present <strong>Spectrubes</strong>!<br/><br/>Do you remember the times when many had a wonderful machine under the name of ZX Spectrum, or, perhaps, a Commodore 64? Our game will help you remember, and if you haven’t been around for that, it will let you travel back in time to see!<br/><br/>In our game, Spectrubes, you control a cube. But not one – several, and at the same time! The key idea is that they move very differently! One of the cubes may move up, but another one will move down.<br/><br/>But not all cubes in the world of Spectrubes are friendly. Some of them are hostile, and will not let you freely enjoy your life. Avoid them unless you want trouble!<br/><br/>Use your environment and the game mechanic to complete a hundred of different levels! Are you ready for your adventures and trials, for the world of ZX Spectrum and cubes?Key features<ul><li>Immerse yourself in the world of vintage computers such as the ZX Spectrum and Commodore 64<br/></li><li>Experiment with various movement of cubes to reach your goal<br/></li><li>Use your environment to solve 100 different puzzles<br/></li><li>Compete with the entire world for highscores<br/></li><li>Get different Steam achievements and share your results with friends</li></ul>", "metacritic": null, "released": "2016-03-25", "tba": false, "updated": "2019-08-28T22:10:03", "background_image": "https://media.rawg.io/media/screenshots/af9/af9a88a8a066cc7aafa0d0d76c5122f5.jpg", "website": "https://silversword.itch.io/spectrubes", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 73}, "playtime": 4, "achievements_count": 8, "ratings_count": 1, "suggestions_count": 89, "game_series_count": 0, "reviews_count": 1, "platforms": ["Linux", "macOS", "PC"], "developers": ["The Light Sword Team"], "genres": ["Adventure", "Indie"], "publishers": ["The Light Sword Team"], "esrb_rating": null}