{"id": 17982, "slug": "adventurezator-when-pigs-fly", "name": "Adventurezator: When Pigs Fly", "name_original": "Adventurezator: When Pigs Fly", "description": "<strong>The Adventurezator is an emergent adventure game about creating emergent adventure games!</strong><br/><br/>Rock, Paper, Shotgun says:<br/>\"Madness! Brilliant madness.\"<br/><br/>You enter the room. Squinting your eyes under the dim light, you can make up the improbable form of a pig with wings. It is glorious. “We are Pigasus. Mighty game developers”, asserts the airborne swine, “And this here is Adventurezator”.<br/><br/><br/><br/>“Adventurezator is an adventure game. Well, sort of. You see, we all love adventure games (as all sentient beings in their right minds should) but you must admit that even the best of them lack something very special: good old YOU.”<br/><br/>“In Adventurezator, you not only play an ever-renewed pile of brilliantly designed point-and-click adventures: you actually get to design your own, and publish them too! The best part? You can do that without all that boring programming, or math. It’s all very technical, but (if we had to put it in layman’s terms) it works like a very fancy cable connected directly to your brilliance.”<br/><br/>You stare at the flying mammal for a while, barely containing your happiness. But still, you could use a little more detailed information. Something like a feature list. Maybe with bullet points. Pigasus opens its inventory and gladly gives it to you.<br/><br/><br/><br/><strong>Features:</strong><br/><br/><ul><li> <strong>An Adventure Sandbox:</strong> create and play your own adventures with no scripting or technical knowledge required;<br/></li><li> <strong>Workshop support:</strong> share your creations, and easily play the best adventures the community has to offer;<br/></li><li> <strong>Free-form Object Interaction:</strong> objects dynamically interact with each other – no need to manually make a cup and a water fountain find what they can accomplish together;<br/></li><li> <strong>Actor editor:</strong> create, save and share your own characters;<br/></li><li> <strong>Cutscene Editor:</strong> show the world your movie-directing abilities have been drastically underrated until now;<br/></li><li> <strong>Level Editor:</strong> easily point, click, drag, drop and rotate components to create your own levels;<br/></li><li> <strong>Campaign Editor:</strong> string your chapters together and create a world-spanning saga; <br/></li><li> <strong>Full-fledged campaign and stand-alone extra levels:</strong> for your enjoyment and to inspire greater creations!<br/></li><li> <strong>More post-launch content:</strong> we will continue supporting Adventurezator with official and community-driven updates;<br/></li><li> <strong>Pointy. Clicky.</strong><br/></li><li> <strong>Pigs. Naked, Baby, Flying, Godly Pigs.</strong></li></ul>", "metacritic": null, "released": "2015-09-17", "tba": false, "updated": "2019-09-17T11:56:53", "background_image": "https://media.rawg.io/media/screenshots/7fb/7fb2536868afac0ad420f785ee715678.jpg", "website": "http://www.adventurezator.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 142, "toplay": 3, "dropped": 2}, "playtime": 3, "achievements_count": 17, "ratings_count": 2, "suggestions_count": 452, "game_series_count": 0, "reviews_count": 2, "platforms": ["macOS", "PC", "Linux"], "developers": ["Pigasus Games"], "genres": ["Adventure", "Indie"], "publishers": ["Degica"], "esrb_rating": null}