{"id": 1799, "slug": "kometen", "name": "Kometen", "name_original": "Kometen", "description": "&amp;quot;Have you ever wondered if there was an app out there with the soul purpose of nurturing your spirit in the most beautiful way possible? Kometen is a game for the iPhone and iPad that does just this with elegance and grace.&amp;quot; – AppDiscover<br/><br/>“This is a remarkable addition to the app store that will separate itself from the crowded offerings of the same old same old with its own style and polish. Taking a seat next to Zen Bound, Kometen utilizes the unique aspects of the device perfectly and will be that app you want to share (show off perhaps?) with friends.” — No dpad<br/><br/>- About -<br/><br/>A comet has been born, please take good care of it! Explore the universe and learn how to fly in a graceful way. A beautiful and memorable experience for everyone!<br/><br/>- Features -<br/><br/>‣ Super minimalistic controls: tap planets to gravitate towards them, swipe to let go<br/>‣ Zoom through space at incredible speed!<br/>‣ Explore a world filled with gorgeous watercolor art<br/>‣ Use the map to find amazing paintings scattered throughout the universe<br/>‣ Keep track of the mood of your comet by reading its thoughts<br/>‣ Hypnotizing and awesome soundtrack<br/><br/>If you want to get the soundtrack: it&amp;#39;s out on both iTunes and Bandcamp, just search for &amp;quot;To Stop you Must Die&amp;quot; by El Huervo<br/><br/>- About the creators -<br/><br/>Erik Svedäng (design &amp;amp; programming) is the creator of the PC game Blueberry Garden, winner of the Independent Games Festival Grand Prize 2009.<br/><br/>Niklas Åkerblad (art, animation, sound &amp;amp; music) is an artist based in Gothenburg, Sweden. When not making games he&amp;#39;s painting huge paintings.<br/><br/><br/>Follow twitter.com/e_svedang to get the latest news about Kometen updates, special offers, competitions and more!", "metacritic": null, "released": "2010-05-12", "tba": false, "updated": "2019-10-22T14:27:50", "background_image": "https://media.rawg.io/media/screenshots/488/488d10e83ab8309d4bfbf238db86dae4.jpeg", "website": "http://www.eriksvedang.com/kometen", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 67, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Erik Svedäng"], "genres": ["Adventure", "Family"], "publishers": ["Erik Svedäng"], "esrb_rating": "Everyone 10+"}