{"id": 17997, "slug": "flyn", "name": "Fly'N", "name_original": "Fly'N", "description": "Somewhere between a platformer, a puzzle game and a great big dollop of pure fun, Fly’N will challenge your skills through more than forty levels set in a luxuriant world featuring charming visuals.<br/><br/>Experiment with the four Buds and their individual powers to save the World-Trees from Dyer, the loony hair-dryer who intends to destroy their Helys! Redistribute the Helys and play with the environment to free the inhabitants of Helicia.<br/><br/>It’s up to you to control the Buds: four different characters with unique powers, guardians of the World-Trees.  Watch out - Their path is peppered with pitfalls, each one more hazardous than the rest! When you find yourself in a tricky situation, you’ll have to figure out the right combination of powers and actions that will save the day…Key Features:<ul><li>Experiment with the four Buds and their individual powers to save the World-Trees:<br/></li><li>Fly'N uses his singing to interact with his environment and keep moving.<br/></li><li>Lyft can stick to almost any wall.<br/></li><li>Ywok, once inflated like a balloon, is invincible and bounces everywhere.<br/></li><li>Nyls propels himself through the air.<br/></li><li>Switch between Innate and Subtle Visions when to find your way through<br/></li><li>Redistribute the Helys in order to play with the environment and free the inhabitants of Helicia<br/></li><li>Challenge your skills through more than forty levels.<br/></li><li>Reach the top tier of the STEAM leaderboards and compare your scores with your friends and the developers.</li></ul>", "metacritic": 80, "released": "2012-11-09", "tba": false, "updated": "2023-09-10T09:55:41", "background_image": "https://media.rawg.io/media/screenshots/7a6/7a6055b341a0f73529b0fcf9029eb6af.jpg", "website": "http://www.flyn-devblog.com", "rating": 2.91, "rating_top": 3, "added_by_status": {"yet": 15, "owned": 436, "beaten": 6, "toplay": 3, "dropped": 5, "playing": 2}, "playtime": 2, "achievements_count": 19, "ratings_count": 23, "suggestions_count": 413, "game_series_count": 0, "reviews_count": 23, "platforms": ["PC"], "developers": ["Ankama"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Plug In Digital", "Ankama Games"], "esrb_rating": null}