{"id": 17999, "slug": "coast-guard", "name": "COAST GUARD", "name_original": "COAST GUARD", "description": "Experience the extraordinary life of coast guard officer Finn Asdair in <strong>COAST GUARD</strong>. Life at sea is fraught with adversity and danger.<br/><br/>Take on responsibility under the motto &amp;quot;Honor - Respect - Duty&amp;quot; and pursue dangerous criminals on the wide open sea. Recover decisive evidence, rescue people from burning and sinking ships, interrogate nefarious human traffickers and steer your own cruiser across the waves.<br/><br/>At the heart of <strong>COAST GUARD</strong> are you and your crew: Fatima Morgane, the engineer; Colman Bauers, the chief investigator; and Larry La Bouche, the forensics specialist. <br/><br/><strong>COAST GUARD</strong> is a unique blend of police work and ship simulation that highlights the exciting tasks of the coast guard. All missions are inspired by real-life coast guard events and make for a thrilling adventure with an intense storyline.<br/><br/><strong>Features:</strong><br/><br/><ul><li>Experience breathtaking coast guard operations on the high seas <br/></li><li>Rescue refugees, convict unscrupulous villains, gather water samples, interrogate suspects and collect the decisive evidence<br/></li><li>More than 15 exhilarating missions by day and night, embedded in a thrilling story<br/></li><li>Operate with your coast guard cruiser in all types of weather and make the most of the freely roamable mother ship <br/></li><li>Leave your ship and investigate exciting crime scenes, such as an oil rig</li></ul>", "metacritic": 47, "released": "2015-10-21", "tba": false, "updated": "2019-10-22T14:10:00", "background_image": "https://media.rawg.io/media/screenshots/ce9/ce9f49cb9ac1aa71e3bf0235f1ddbe78.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 43, "dropped": 1}, "playtime": 4, "achievements_count": 33, "ratings_count": 2, "suggestions_count": 338, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC", "iOS", "macOS"], "developers": ["Reality Twist", "Rondomedia"], "genres": ["Adventure", "Simulation"], "publishers": ["Astragon Entertainment", "rondomedia Marketing & Vertriebs", "astragon Sales & Services"], "esrb_rating": null}