{"id": 180065, "slug": "farmer-jack-and-the-hedge-monkeys", "name": "Farmer Jack and the Hedge Monkeys!", "name_original": "Farmer Jack and the Hedge Monkeys!", "description": "<p><strong>48K ZX Spectrum - 2008</strong></p>\n<p>Never one to turn down the offer of a holiday, Jack made his way down the M1, M42, and M5 to visit his cousin Farmer Jon in deepest Somerset. The journey took a while, but everybody seemed friendly - all the cars sounded their horns and waved their arms at him as they overtook his tractor. Jack was happy to be off the motorway in the end, and along the scenic, familiar winding lanes through the badlands before he got to Jon's farm.</p>\n<p>Farmer Jon wasn't in such a good mood when Jack finally arrived though. \"Them buggers\", he cried, \"every June they come roaming round me fields, looking for a festival. Eavis' farm's not another 20 miles away from 'ere in Pilton, but they're all too stoned to notice, pillocks! Ravers, Hippies and Hedge-Monkeys, same time every year. Just as I sow my crops they come trampling around, treading in the seeds and ruining it all - 'elp me Jack\". \"Eee, that's trouble at'mill and no mistake\", mused Jack, \"but m'tractors pretty nippy - I'll belt round and get them seeds up for you\" offered Jack. Jon gladly accepted, tired-out by chasing the hippies, monkeys and ravers across the levels all day.  \"I've no cows on them fields no more after that blue-tongue trouble, so you can move the gates all you need - that'll really confuse 'em! Thanks Jack\". \"No trouble\", said Jack, \"I'll start in<br/>morning\".</p>\n<p>\"Proper Job!\" said Jon, smiling at last.\"</p>\n\n<p>After writing <strong>Stranded 2.5</strong>, which with its 48 levels took a while to complete, I needed to do something quick &amp; fun to get back into the swing of things again, and so Farmer Jack returned with another conversion of an 80's arcade game missing from the Spectrum - this time with \"Ladybug\" - written as a thank you to Simon who runs Cronosoft and has always wanted a Spectrum version of it.</p>\n<p>Using the first Farmer Jack game as a base for the code I also tried to address some of the criticisms of the first and so locked the game to a constant frame-rate and improved the controls, but this time did a pretty straight conversion of the arcade - albeit with Jack &amp; Hedge Monkeys instead of the insect theme of the original.</p>\n<p>(\"Hedge Monkeys\", as the internet will tell you if you ask it, is a west-country term for hippies as they tend to look as if they live in hedges. Living in Somerset as a child the game's story is loosely based on the annual invasion of them for the Glastonbury festival, when you could still jump the fence and it wasn't in the least bit trendy!)</p>\n\n<p><strong>MicroMart</strong> - \"<em>...Lee du-Caine's superb AY beeps and tones for 128K variants ... everything is slickly executed, colourful and cute.</em>\" - 8/10</p>\n<p><strong>RGCD</strong> - \"<em>Hedge Monkeys is an excellent version of Lady Bug - a game that did not see an official conversion to the Spectrum. ...This is a really phenomenal version of the game with all the addictiveness (and difficulty) of the game that inspired it. Playing this game has even improved my skills on the arcade original. Now there's a testimonial for the box art!</em>\" - 85% (combined with Treasure Trove)</p>", "metacritic": null, "released": "2017-12-21", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/411/411eb4f6b57ecdde6e3c0d91bcec12ce.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 125, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Bob's Stuff"], "genres": ["Action"], "publishers": [], "esrb_rating": null}