{"id": 180486, "slug": "kure-world", "name": "Kure World", "name_original": "Kure World", "description": "<p>TFG UC3M by Daniel Jerez Garrido<br/></p>\n<p>---------------------------------------------------------------------------------------------------<br/></p>\n<p>This project is based on the development of a fully functional 2-dimensional platform game for Windows, Linux, Mac Os X and Android platforms using the Unity 3D graphics engine.</p>\n<p>Techniques of construction of automated scenarios are realized through loading of JSON files edited by the user. The files contain all the necessary information that the game needs for the staging (block codes, enemies, background, music, player start and goal). The level is structured in a coded two-dimensional matrix that the game traverses and instantiates each element with its respective properties programmed.</p>\n<p>In addition, procedural generation techniques are studied as an alternative to the manual creation of mentioned levels.</p>\n<p>---------------------------------------------------------------------------------------------------</p>\n<p>Este proyecto se basa en el desarrollo de un videojuego de plataformas en 2 dimensiones totalmente funcional para las plataformas Windows, Linux, Mac Os X y Android a través del motor gráfico Unity 3D.</p>\n<p>Se realizan técnicas de construcción de escenarios automatizados a través de carga de ficheros JSON editados por el usuario. Los ficheros contienen toda la información necesaria que el juego necesita para la puesta en escena (códigos de bloques, enemigos, fondo, música, inicio del jugador y meta). El nivel se estructura en una matriz bidimensional codificada que el juego recorre y va instanciando cada elemento con sus respectivas propiedades programadas.</p>\n<p>Además, se estudian técnicas de generación procedural como alternativa a la creación manual de los niveles mencionados.</p>", "metacritic": null, "released": "2017-04-19", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/8f0/8f07ec608920a1dbe7b893a010e432c5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 52, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Android"], "developers": ["Dani Jerez"], "genres": [], "publishers": [], "esrb_rating": null}