{"id": 18058, "slug": "vampire-legends-the-true-story-of-kisilova", "name": "Vampire Legends: The True Story of Kisilova", "name_original": "Vampire Legends: The True Story of Kisilova", "description": "Vampire Legends: The True Story of Kisilova is an adventure game with elements of horror, based on the first documented case of vampirism!<br/><br/>18th century Europe: fifty years after a great plague had swept the land of the Habsburg dynasty, the subjects of the Emperor are in danger again. A series of horrifying, unexplainable deaths occur in the remote Serbian town of Kisilova. Fearing that the plague may be striking again, the residents begin to flee their homes. Summoned by the Prince of Württemberg himself, Imperial emissaries come to Kisilova to investigate the events and prevent further deaths.<br/><br/>The heroine and her companion have to lead an investigation, question the witnesses, explore every nook and cranny in the town and solve many puzzles. Will they be able to uncover the secrets of the local dignitaries and discover the identity of the hooded stranger trying to thwart their plans?<br/><br/>The fate of Kisilova and the Empire lies in your hands! <br/><br/>Features<ul><li>62 hand-painted areas depicting remote lands of 18th century Europe.<br/></li><li>Your fellow investigator will often come to your aid.<br/></li><li>36 challenging mini-games and 21 scenes with hidden objects.<br/></li><li>14 intriguing characters to meet during the investigation.<br/></li><li>Additional adventure with multiple endings!</li></ul>", "metacritic": null, "released": "2015-11-26", "tba": false, "updated": "2023-01-31T13:51:48", "background_image": "https://media.rawg.io/media/screenshots/111/1119026ef17735d78a922e1a25796a6b.jpg", "website": "http://www.artifexmundi.com/page/vampire/", "rating": 2.92, "rating_top": 3, "added_by_status": {"yet": 8, "owned": 183, "beaten": 6, "toplay": 2, "dropped": 1}, "playtime": 4, "achievements_count": 10, "ratings_count": 12, "suggestions_count": 503, "game_series_count": 0, "reviews_count": 12, "platforms": ["PC", "Linux", "iOS", "Android", "macOS"], "developers": ["Artifex Mundi", "Organic 2 Digital Studio"], "genres": ["Adventure", "Casual", "Puzzle"], "publishers": ["Artifex Mundi"], "esrb_rating": "Teen"}