{"id": 18054, "slug": "bocce-revolution", "name": "Bocce Revolution", "name_original": "Bocce Revolution", "description": "The game of bocce (known also as bowls or bocce ball) is an ancient sport that requires skill, strategy and a little bit of luck. Bocce Revolution allows you to experience the thrill of a great game of bocce by challenging your friends or the computer.<br/>The game is played on a genuine court, belonging to an authentic bocce Club guaranteeing that the emotions of the athletes and audience will be intensified!<br/>Demonstrate your skills and talent by proving you are the master! You are in full control of your strategy and decisions required to defeat your opponent.<br/>Bocce Revolution has been created and realized with professional assistance, consultation and design by legendary Italian bocce Club.<br/><br/>- SELECT YOUR COMPETITION<br/>You have a choice of single-player and multiplayer tournaments. Can you win all challenges and become the ultimate champion?<br/><br/>- THE REALITY<br/>Your opponent will be determined and possess the skill of an expert bowler. His steady and accurate shots can put you into serious difficulty.<br/><br/>- CHOOSE THE TECHNIQUE OF PLAY<br/>Perform the approach; throw the ball abovehand, underhand or into the air. Analyze the position of the bowls in the field continuously during the game and determine your strategy.<br/><br/>- MULTIPLAYER<br/>Play against your friends in exciting 1vs1 matches<br/><br/>- THE GAME PHYSICS <br/>The Maximum realism of the game is thanks to the latest technology of PhysX by NVIDIA.<br/><br/>- RULES FOR BEGINNERS AND EXPERTS<br/>Choose to play with Raffa of simplified regulations which is suitable for amateur players.<br/><br/>- SPORTS COMMENTARY<br/>The emotions of the match will be described, by the voice and opinion of a commentator, for unparalleled realism.<br/><br/>- MULTILANGUAGE<br/>Bocce Revolution is available in: English, Spanish, French, Italian, Brazilian Portuguese, Russian, and Simplified Chinese.<br/><br/><br/><br/>", "metacritic": null, "released": "2015-10-23", "tba": false, "updated": "2019-08-28T22:10:00", "background_image": "https://media.rawg.io/media/screenshots/50f/50f11df7a51aa9d15df4fad76a9646ed.jpg", "website": "http://www.boccerevolution.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 6}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 223, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Dysotek"], "genres": ["Simulation", "Sports"], "publishers": ["Dysotek"], "esrb_rating": null}