{"id": 180502, "slug": "stock-brokers-dont-want-you-to-know-this-amazing-s", "name": "STOCK BROKERS DON'T WANT YOU TO KNOW THIS AMAZING STOCK MARKET TRICK: A GET RICH QUICK GAME", "name_original": "STOCK BROKERS DON'T WANT YOU TO KNOW THIS AMAZING STOCK MARKET TRICK: A GET RICH QUICK GAME", "description": "<p>A social experiment of sorts where you tap a button to choose a stock and hope it does well. The more people invest in the same stock, the worse it does. Use your charisma to haggle your fiends out of a good deal so you can make the most money, or play it silent in the corner and swoop into the lead. Find the tactic that suits your play-style best and MAKE MONEY.</p>\n<p>Rounds are on average about 5 minutes. Each round is 3 sets of 4 quarters with a total of 9 voting phases. At the end of each quarter you can select a stock to invest in. If you change your mind (or want to artificially inflate other stock), tap again to change investment at a minor cost. The top 10 most grossing and top 10 most bankrupt individuals get shown at the end only to have another round ensue.</p>\n<p>Don't get how to play? That's okay, most people start off investing in stocks they like such as \"POOP\", \"MYSPACE\", or \"MONEY\". You learn the ropes as you go, or not. But who cares, you can have fun cheering on your own stocks -- even when they tank along with your lifesavings.</p>\n<ul><li>Play over 100 players simultaneously. Connect your smart-device to the same wifi and drop-in via browser.</li><li>Game is best played with 10+ players. The more the merrier.</li></ul>", "metacritic": null, "released": "2017-07-18", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/d35/d35ca8e9089d9c3a0683e5dcd823efdc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 58, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["RaphaelTetreault"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}