{"id": 180531, "slug": "knock-down-a-slingshot-game", "name": "Knock Down: A Slingshot Game", "name_original": "Knock Down: A Slingshot Game", "description": "<p>Do you enjoy playing sling shot game? Kids all over the world enjoy shooting things with catapult.</p><p>Knock down is a sling shot game of shooting and targeting other objects in 3 fantastic worlds.<br/>Take your adventure craze of knock out to the world of candy land, Birds Island and the Pot world.<br/>Fun with physics is the motive of this game. In this platform game you will learn to imply projectile physics and enjoy this with your friends and family. Take into account the hurdles which will obstruct your shots. Hurdles may be some wooden flock, stone barrier and others.</p><p>How to Play:<br/>Simple game rules no complicated physics. Drag finger over the screen, aim to perfection and release for perfect sling shot.</p><p>Let's start the adventure with sling shot. There are three worlds in this game lets enjoy playing through all of that.</p><p>1) Candyland: Aim, project and boom all the delicious candy in this candy land. Knockdown all the candy to move on to the next level. There are 30 different levels of implementing the funny physics and grab all the sweet candies in this candy land.</p><p>2) Bird Island: Rescue birds as all of them are stuck by the magic of witch in this island. Your job is to rescue all the birds and set them free. You have catapult in your hand. Show them the power of your sling shot and the physics you know.</p><p>3) Pot world: Pots better known as dahi handi. These are the earthen dahi handi and all of them colourful. Take shot and destroy all the dahi handi to enjoy this pot world. There are 30 levels in this game of knock down dahi handi with sling shot.</p><p>Game Features:<br/>• Wonderfully designed knock down game.<br/>• Three amazing worlds of candyland, Birds Island and beautiful Dahi handi world.<br/>• 90 levels of action packed fun game.<br/>• Beware of hurdles.<br/>• Entertaining and magical graphics in the game.</p><p>Download it today and enjoy physics with knockdown a sling shot game!</p>", "metacritic": null, "released": "2015-12-30", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/433/433e86a225259721c62a745f63eeff60.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 179, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["ViMAP Services"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}