{"id": 180658, "slug": "fateful-released122", "name": "Fateful Released:1.2.2", "name_original": "Fateful Released:1.2.2", "description": "<p>Defeat the gods: Hades, Loki, and The Orphan, to be rid of gods, and make what Nietche said true: God Truly is dead.  Existentialism was the theme of the Game Jam and this is our take on it. Currently only versions for Windows are build.<br/><br/>This is GulagGames' second entry to the CreateJam events, at Aalborg University - Campus Create!<br/>Originally the game is designed as  an Asynchronous Co-Operative game, but we did not manage to split the controls on time, (beta build 0.1.2),  and still haven't split the controls, for the purpose of singleplayer fun. The game is much harder in coop, but is still not the easiest game to beat. <br/><br/>Inspiration is found in the old arcade games 1970-80's.<br/><br/>Known Bugs:</p>\n<p>-Backgrounds are upside down<br/>-Upon victory the screen goes blank, (workaround is by pressing B)<br/>-Mouse can influence the flightcontrols.<br/>-Disconnetion of a controller can cause infinite flying.<br/><br/><br/>Glitches:<br/>-Background is skipping instead of being seemless this is no bug, but caused by rushed code.<br/>- Loki clone in right lower corner has collision and cosmetical issues with projectiles.<br/>- Musscle flare is not always showing at the gun, this is caused by unoptimized code, but is no bug.</p>\n\n<p>Other issues:<br/>Installer can appear with an error which hold no significans.<br/>Installer is not signed but is constructed from InnoSetup, which only includes game related files and folders. You can safely ignore these errors.</p>", "metacritic": null, "released": "2018-03-25", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/9f1/9f18f744d070f6251ea8c65d31db9d83.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 134, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Web"], "developers": ["MrExillion"], "genres": [], "publishers": [], "esrb_rating": null}