{"id": 180862, "slug": "resource-wars", "name": "Resource Wars", "name_original": "Resource Wars", "description": "<p>Hi, my name's Patrick Pfeiffer. I am the sole developer of Resource Wars, an Abstract Military Strategy Game set in the modern day. What's an abstract strategy game? Any strategy game that does not contain random elements or hidden information. Chess and GO are two very popular games in this genre. However, unlike those turn based games, Resource Wars is a real time strategy game. </p><p>I am currently in the very early stages of development with the main focus of getting all the core systems functioning properly and eliminating bugs. This means visuals are on the bottom of my list and every visual aspect in the game right now is a placeholder. Before making the game aesthetically appealing, I need to make it fun and play as smoothly as possible.</p><p>To make the game as good as it can be, I am opening it up to anyone that would like to help as a playtester. I will be posting new devblogs (like this one) very frequently that detail the changes made throughout development. Each Devblog will have a link that allows anyone to download the updated game. After trying out the game there will be a short survey that every playtester has to fill out. That survey will help me know what needs to be improved, removed, or replaced in order to make the game better.</p><p>\n<br/>I believe that with strong collaboration and feedback throughout development, the end result will be a much better game than I could ever make on my own. Thank you for your interest in my game and I hope you choose to follow the development of Resource Wars.<br/></p>", "metacritic": null, "released": "2017-01-16", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/5f2/5f233df18700cce90a9ae91f408e0861.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 4, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["patruck"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}