{"id": 18080, "slug": "half-life", "name": "Half-Life", "name_original": "Half-Life", "description": "<p>Half-Life is the original game in the series. Being a revolutionary at the time, we follow the story of Gordon Freeman - a silent scientist at the facility called Black Mesa. Arriving late at work and hastily doing his routine he runs into the experiment field. However, the experiment goes completely wrong and opens a portal to a completely different dimension called Xen. The laboratory is destroyed as well as the facility itself, as unknown creatures like Vortigaunts are now everywhere in the facility. Gordon must battle his way to the surface and find a way to close the portal.</p>\n<p>One of the main features of Half-Life was story-telling through scripted sequences within the actual gameplay. Without having cutscenes, the game was able to tell the full story of the game by showing scripted deaths, dialogues, character appearance while the gameplay was moving one. By not ripping off the player from the process, the game feels much more smooth as it continues. Despite his science nature, Gordon is masterfully using his weapons and destroys any enemy at his path with rifles, grenades, shotguns and much more.</p>", "metacritic": 96, "released": "1998-11-08", "tba": false, "updated": "2024-04-21T07:23:19", "background_image": "https://media.rawg.io/media/games/6c5/6c55e22185876626881b76c11922b073.jpg", "website": "https://www.half-life.com/en/halflife", "rating": 4.38, "rating_top": 5, "added_by_status": {"yet": 398, "owned": 6834, "beaten": 2393, "toplay": 168, "dropped": 543, "playing": 60}, "playtime": 3, "achievements_count": 0, "ratings_count": 2266, "suggestions_count": 469, "game_series_count": 3, "reviews_count": 2285, "platforms": ["Dreamcast", "Linux", "macOS", "PC", "PlayStation 2"], "developers": ["Valve Software", "Gearbox Software"], "genres": ["Action", "Shooter"], "publishers": ["Valve", "Sierra On-Line", "Sierra Entertainment", "Sierra Online"], "esrb_rating": "Mature"}