{"id": 180951, "slug": "wrapper", "name": "Wrapper", "name_original": "Wrapper", "description": "<p>  Wrapper is a new, experimental, 2D game in which the goal is to collect as many good orbs as you can. You do so by <strong>HOVERING</strong> over an area, which leaves your trail behind, and making a <strong>CLOSED SHAPE</strong> around an orb,  as it's shown on the animation. But beware! Not all orbs that appear are good. By catching the bad ones you lose health, and once you lose all of it, the game is over.</p>\n\n<strong><em>Game rules</em></strong>\n<p>    There are a few concepts that you have to be familiar with:</p>\n<ul>\n<li><strong>BLUE ORBS</strong> - these are the GOOD orbs, and are worth <strong>10 points</strong> each.</li>\n<li><strong>YELLOW ORBS</strong> - after 5 seconds, blue orbs become yellow,\r\n gain different color, animation and are then worth <strong>30 points</strong> for another 5 seconds, after which they disappear.</li>\n<p>\n</p><li><strong>RED ORBS</strong> - these are the BAD orbs, and as such they TAKE AWAY <strong>50 points</strong> from total score when caught, as well as some amount of health.</li>\n<li><strong>COMBO</strong> - if you catch more than one orb at once the amount of gained points is calculated as: numberOfCaughtOrbs x theirTotalWorth i.e. if you catch one Blue and one Yellow:  2*(10+30).\r\n</li>\n<li><strong>HEALTH</strong> - you have 12 health points at the beginning of every game. You lose them by various means:\r\n<ol>\n<li>Catching red orbs - for every caught you lose: 4 health on expert mode, and 2 health on beginner mode.</li>\n<li>Not catching yellow orbs - on expert mode only, 2 health points per orb.</li>\n</ol>\n</li>\n<br/>\n<li><strong>SUPERPOWER</strong> - by moving around you generate energy, current energy can be seen on the energy bar at the top of the application window during gameplay. Only when the energy bar is full, you can deplete it by <strong><em>HOLDING THE LEFT MOUSE KEY AND DRAGGING IT</em></strong>. When you do that, a small block of the energy bar will get whitened, indicating when you should <strong><em>RELEASE THE KEY</em></strong> while the energy is depleting. If you succeed in using the superpower, all the good orbs will be collected, along with the combo bonus (max combo is x7) and you will replenish two health points. On the other hand, if you release too early or too late, you will be contracted to the half of the max length and colored in red for the next 10 seconds, after which you will be returned to normal state.</li>\n<li><strong>PAUSE</strong> - easily pause the game by pressing the home button in upper-right corner of the window, or by pressing the ESC key.</li>\n</ul>\n<p>    Along with all of these features, there is an intuitive and comprehensive interface that includes menus in which you can easily change difficulty, soundtrack, customize the way your Wrapper looks like, or take a look at the leaderboard for the active difficulty.</p>\n\n<strong><em>Install instructions</em></strong>\n<p>    The whole game is written in JavaFX, which means that you will need Java Virtual Machine installed on your computer in order for this game to work. If you don't have Java installed, or you don't have the version 8, you can easily download and install it by visiting the official Java site:<br/>\n<strong>Download Java</strong></p>\n<p>    If you have your Java set and running, all you have to do is to download the file below and start playing! It should work on all operating systems without a problem, but if you have a problem, you can always contact me and i will try my to best to solve the problem.</p>\n\n<strong><em>Final notes</em></strong>\n<p>    This is far from the finished project, meaning that I will be glad to hear about your thoughts and ideas to make it better. Reporting any bugs is also very welcome. I don't charge for this application, but if anyone is feeling generous and willing to donate, I'm really thankful for that, means a lot to me. That's all, I'm looking forward to receiving your feedback.</p>", "metacritic": null, "released": "2017-10-02", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/aa3/aa36542fcca10e65e44c92230a5ad7d9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 32, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["createit"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}