{"id": 18099, "slug": "phantaruk", "name": "Phantaruk", "name_original": "Phantaruk", "description": "<strong>APPROACH THE EDGE OF HUMANITY.</strong><br/><br/>For long has the humanity been constrained by limits of human body. Most have accepted the imperfection of flesh, but some sought for liberation. To pursue the dream of creating a post-human being – to achieve ideas of transhumanism – is the driving force behind H+ Corporation. Within its facilities technology and homo sapiens became one entity. An organism devoid of humanity’s biological weaknesses.<br/><strong>You board the spaceship Purity-02 – prime complex of the H+ Corporation.</strong><br/><br/>The dream shatters to a nightmare when you realize what has become of Purity-02. Once a research vessel, it has turned into a deadly, deserted trap. To flee Purity-02 you have to investigate the mysteries of the ship. With every passing minute the chances of survival grow slim. Infected with a parasite emitting deadly toxins, you struggle against havoc being wrought within your body. But there is yet a greater danger to evade.<br/><br/>A beast is roaming the ship. A creature known from long-forgotten fables and ancient myths. It could prowl around in any shadow and lurk behind any corner. You must plan your every move. You must survive the infection.<br/><br/><strong>You Must Get Off the Ship.</strong>", "metacritic": 53, "released": "2016-08-16", "tba": false, "updated": "2022-10-09T23:47:22", "background_image": "https://media.rawg.io/media/screenshots/00f/00f56056c5ae2d197f4a09839862a45a.jpg", "website": "http://phantaruk.com", "rating": 2.22, "rating_top": 3, "added_by_status": {"yet": 12, "owned": 190, "beaten": 2, "toplay": 1, "dropped": 4}, "playtime": 4, "achievements_count": 23, "ratings_count": 9, "suggestions_count": 453, "game_series_count": 0, "reviews_count": 9, "platforms": ["Nintendo Switch", "PC"], "developers": ["Polyslash"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Forever Entertainment", "PlayWay"], "esrb_rating": null}