{"id": 181021, "slug": "run-fast-and-die", "name": "Run Fast and Die", "name_original": "Run Fast and Die", "description": "<p><strong>This is a non-art alpha build (runs slow on terrible computers)<br/></strong></p>\n<p>Are you tired of endless runners where your character runs at roughly the same speed no matter what? This game offers an end to your suffering (by replacing it with a different, but new, brand of suffering).</p>\n<p><strong>Controls: </strong>Use A/D or the mouse to move left and right</p>\n<p><strong>Info That I Should Have Put Somewhere In The Game<br/></strong></p>\n<ul><li>Coins boost your speed</li><li>The golden staff gives you 25 points</li><li>The black orb slows time, but does not affect your time limit (so picking up a bunch will kill you)</li></ul>\n<p>The current state of the game is alpha, extra alpha. There are little to no art assets, both \"SciFi\" and \"Wilderness\" game types are little more than placeholders (I recommend playing \"Medieval\" and \"Retro\" and acting like those others don't exist), the levels per game type are basically identical.</p>\n<p>There's a few functional things I want to change/add, but for the most part the full functionality of the game is there. This exists on Itch.io so people can give feedback, comments and remind me that it's a non-art build.</p>\n<p>The end goal is to port this game to mobile, but quite a few things need to be done first, the biggest of which is optimization for the mobile platform.<br/></p>\n<p><strong>Roadmap<br/></strong></p>\n<p>As I cross items off the roadmap and add new features, I will replace the downloadable file. The beta release will be just before I'm ready to release for mobile, meaning the file will be much smaller and aside from minor changes, it will be very similar to the official release.</p>\n<p><strong>Performance: </strong>This game is not fully optimized. If you have a good CPU or a bad CPU and a dedicated GPU, it shouldn't be a problem. However, this game's eventual home is on mobile, which means it will need to be heavily optimized for that platform.<br/></p>\n<p><strong>Lock Literally Everything Behind a Paywall: </strong>Kidding. But I do want to make the levels and characters locked until you complete previous levels. Right now, all characters and levels are unlocked, mainly because there's no real difference between them.</p>\n<p><strong>Multiple Unique Characters: </strong>I plan on having at least two characters per game type, themed to those types. Each of these characters will have attributes, probably just things like top-speed and control, and they will have unique powers and/or passive abilities (intangibility, ignore bad pickups, etc.)</p>\n<p><strong>A Not-Completely-Black Main Menu: </strong>To be completely honest, I have next to no idea what I want to do with the main menu, but it's exceptionally bland right now, and that will change.</p>\n<p><strong>Fix Bugs: </strong>This probably doesn't need to be here, but my goal is to release a completely bug-free game. Right now, if you don't choose a character before you start the game, your character is invisible. Obstacles spawn inside each other, which isn't a huge deal, but it bugs me.</p>\n<p><strong>High Scores per Difficulty per Level: </strong>Each difficulty and level combination will have it's own high score. On this note, I was thinking about adding a \"Fastest Speed\" stat and \"Longest Distance Traveled\" at a later date.</p>\n<p><strong>Circlet of Charisma +12: </strong>Adding graphics to the UI, unique tiles, etc. Generally, making everything pretty.</p>\n<p><strong>Unique UI per Game Type: </strong>Each game type will have its own UI themed to match the game type.</p>\n<p><strong>Add Acessability Stuff: </strong>Like color-blindness support (if it's an issue with the obsticles/pickups) and other things to make the game better.</p>\n<p><strong>An Actual Options Menu: </strong>You know the kind, graphics settings, audio, custom controls. The Works!</p>\n<p><strong>Music: </strong>And other audio effects. The not-copyrighted kind too.<br/></p>\n<p><strong>There's More, I'm Sure: </strong>Which I will add to this list once I think of them.<br/></p>", "metacritic": null, "released": "2018-06-29", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/355/3555fc703c4f365a6999d953d589b5e3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 56, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["rklsimmersion"], "genres": ["Action"], "publishers": [], "esrb_rating": null}