{"id": 181067, "slug": "skullion", "name": "SKULLION", "name_original": "SKULLION", "description": "<p><strong>Introduction</strong></p>\n<p>SKULLION is a 2D split-screen 1v1 multiplayer game where you and a friend next to you fly triangles and battle over crystals.</p>\n<p>The goal of the game is to bring at least two of the three crystals to your goal.<br/>(You already win if you score two out of three crystals)</p>\n<p>Fly, shoot, ram, boost, push and pull your way to victory against the person next to you because you both are playing together using one keyboard and one game!</p>\n<p><strong>Controls</strong></p>\n<p>Player 1 (Left player)<br/>Thrust: W<br/>Turning: A and D<br/>Boost up &amp; push away: Left SHIFT<br/>Shoot: F<br/>Pull: SPACE</p>\n<p>Player 2 (Right player)<br/>Thrust: UP arrow key<br/>Turning: LEFT and RIGHT arrow keys<br/>Boost up &amp; push away: Right CTRL<br/>Shoot: NUMPAD 1 (Numlock on)<br/>Pull: NUMPAD 0 (Numlock on)<br/></p>\n<p>Controls can not be rebound, if you don't have a numpad on your keyboard then it might be possible to use macros as a workaround/fix.</p>\n<p><strong>Details</strong></p>\n<p>I made this game as an experiment to see if I could make a game with split-screen.</p>\n<p>This game was made using the GDevelop engine, this allowed me to create this game without needing to know how to program.</p>\n<p>This game was made only by me, Roel Hamersma, in about 3 days.</p>\n<p>The game is unlikely to be improved or updated but even a small donation can convince me to update the game.</p>\n<p><strong>Features I would add if I would continue development</strong><br/></p>\n<p>- I would change the art to be a overgrown industrial theme<br/>- Bug fixes if there are any to be done<br/>- More user friendly features such as rebindable keys and a fullscreen option<br/>- Iterating to improve the user experience and polish the gameplay<br/>- More levels, better level design</p>\n<p>These features are all within a one week scope and I have the time and experience to implement them if wanted.</p>", "metacritic": null, "released": "2017-07-22", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/55b/55bf022bb4ddc214e144588825c51637.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 36, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["RoelHamersma"], "genres": [], "publishers": [], "esrb_rating": null}