{"id": 181153, "slug": "ultimate-parking-simulator", "name": "Ultimate Parking Simulator", "name_original": "Ultimate Parking Simulator", "description": "<p>Ultimate Parking Simulator is an all new take on the parking games with the best and realistic cars and vehicle physics. It will drive you crazy and make you learn all the driving skills you been lacking for years.</p>\n<p>One of the best car driving and parking game with stunningly beautiful graphics and smooth driving mechanism. </p>\n<p>Drive through busy streets and park your car on suggested slots like a pro driver in this unique car simulator game. </p>\n<p>Features:</p>\n<p>- 100 challenging parking and checkpoint levels</p>\n<p>- 16 awesome vehicles: Cars, Trucks, Trailers, Buses and Ambulances</p>\n<p>- Realistic driving and physics</p>\n<p>- Beautiful city with 4 weathers: Day, Rain, Snow and Night</p>\n<p>- Cockpit mode for realistic driving</p>\n<p>- 3 storey parking</p>\n<p>Test your driving skills with more than 15 vehicles from the garage like cars, buses, trucks, trailers and ambulances. </p>\n<p>Race around with 4 types of cars varying in size and park in the allotted slots all over the city.</p>\n<p>Drive through sharp turns and park precisely (precision parking) with 3 types of buses including the school bus.</p>\n<p>Make sure you don't flip-over the trailer trucks as they are huge and heavy, drive slowly.</p>\n<p>Race as soon as possible and reach checkpoints with 3 types of ambulances, includes a World War II ambulance.</p>\n<p>Trucks carry loads, complete the transportation of the loads behind the trucks carefully without dropping the goods from the trucks.</p>", "metacritic": null, "released": "2017-03-18", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/fb7/fb7d64db22fb9a88e1dbcc33243b804f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 115, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["underdogsthestudio"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}