{"id": 18112, "slug": "kingdom-wars", "name": "Kingdom Wars", "name_original": "Kingdom Wars", "description": "Kingdom Wars is a free to play 3D MMORTS with real-time siege combat, without the pay to win element so common in the genre.  Having evolved from Dawn of Fantasy: Kingdom Wars this strategy game offers lively online world, where players gather resources, construct majestic towns, and impregnable strongholds, direct citizens, complete quests in the service of mighty nobles and fiendish rogues, and eventually manage a global empire. All within an online realm that grows, works, lives, and breathes even when you log off. All this in glorious 3d world with stunning level of detail and epic scale - with vibrant towns and thousand strong armies. And of-course let’s not forget the glorious siege battles all in real-time! Developed by Reverie World Studios, Kingdom Wars is the result of several years of hard work by a new Toronto based studio, with members all over the world.FeaturesInnovative MMORTS Approach<br/><ul><li>Wage war with neighboring regions or complete countless hours of quests as you unveil the dark secrets of Terria while managing a persistent kingdom and economy with thousands of other players. Socialize, trade, forge alliances and - best of all - battle against other players across the world, defeat their armies, and burn their towns!</li></ul>Not Pay to Win<br/><ul><li>With Kingdom Wars free to play release our goal was to create a game of skill, not bigger wallets. We have followed player suggestions and tried to avoid the common pay2win traps. In Kingdom Wars majority of micro-transaction only effect cosmetic changes or unlock bonus content, that does not effect game progress and player interaction. All the other options are limited to one time use, to prevent anyone gaining unfair advantage.</li></ul>Multiple Games Modes<br/><ul><li>Two additional singleplayer modes - including open-ended Campaign mode, and content-packed single-player Skirmish mode with both Lay Siege and Castle Defense maps - guaranteed to satisfy players of various tastes and gameplay styles.</li></ul>Stunning Siege Combat<br/><ul><li>User-friendly Siege-oriented gameplay adds a whole new dimension to the battlefield as you ram the enemy gate, scale the walls, and place automated defensive systems, such as: stone tippers, boiling oil, and wall-mounted catapults.</li></ul>Three Distinct Races &amp; Styles of Gameplay<br/><ul><li>Kingdom Wars features three distinct civilizations: Elves, Orcs and Men, presenting a unique approach to these iconic races with three distinct styles of gameplay. Each race is complete with its own lore, language, world region and terrain, dozens of distinct units and buildings, hundreds of unique technologies, and each even has a different approach to economy and building style.</li></ul>Fully 3D Dynamic World Map<br/><ul><li>Travel the MMORTS world using a beautifully-designed 3D World Map featuring scale replicas of all the NPC strongholds, quest areas, and the player's homeland.</li></ul>Original Base Building Approach<br/><ul><li>Each player’s Stronghold features hundreds of buildings that look and behave like a City-Simulation game, but without any micro-management, giving the player more time to spend on the battlefield. In addition each race offers a different approach to building strongholds.</li></ul>Complex Economic Model with Corpse Looting<br/><ul><li>Combines the complexity of nearly a dozen gathering possibilities, different for each race, with automated simplicity, allowing players the options to micromanage their economy, or leave it to run itself in times of war.</li></ul>Realistic Weather and Season Change<br/><ul><li>The gaming world comes alive as you build and battle during winter or summer months, as you push your armies through heavy rain or snow storms. Your economy significantly changes from summer to winter, when different strategic options are available during different times of day and severe weather makes certain units useless.</li></ul>", "metacritic": null, "released": "2013-04-01", "tba": false, "updated": "2023-09-23T20:23:37", "background_image": "https://media.rawg.io/media/screenshots/633/633f3ad798922e8c288f608866cbf01f.jpg", "website": "http://kingdomwars.ca", "rating": 2.21, "rating_top": 1, "added_by_status": {"yet": 8, "owned": 618, "beaten": 2, "toplay": 4, "dropped": 3}, "playtime": 2, "achievements_count": 35, "ratings_count": 14, "suggestions_count": 634, "game_series_count": 0, "reviews_count": 14, "platforms": ["Android", "PC"], "developers": ["Reverie World Studios", "Springcomes"], "genres": ["RPG", "Strategy", "Simulation", "Massively Multiplayer", "Indie"], "publishers": ["Reverie World Studios"], "esrb_rating": null}