{"id": 18124, "slug": "bus-tycoon-nd-night-and-day", "name": "Bus Tycoon ND (Night and Day)", "name_original": "Bus Tycoon ND (Night and Day)", "description": "Start building your passenger bus transport empire between cities all night and day!<br/>\n<br/>\r\nBus Tycoon ND (Night and Day) is a passenger transport tycoon game. Start building your transport empire by creating bus routes between as many cites as possible. You can freely build the road network and create traffic lights in order to have a better control of your traffic. <br/>\n<br/>\r\nThe player's company is responsible for connecting service centers to  gas stations and connecting these to other cities. This will facilitate the transportation of passengers on the buses, as the buses require fuel and servicing. Purchase a variety of bus models, based on their fuel type and consumption. Update your gas station's fuel supply to unlock newer bus models. Each bus route can accommodate a maximum of eight connections. You can build up to 30 bus stations and vehicles per game. At any time, you can upgrade your bus stations, in order to accommodate more passengers. Moreover, you can sell used vehicles to buy new and even more advanced ones.<br/>\n<br/>\r\nYour vehicles fuel up automatically if a road connection is available to the central gas station. But, at some point your vehicles will have to be serviced. You will have to send them to a service center (go to service), otherwise breakdowns will occur more frequently, eventually resulting in the loss of your vehicle. Road cracks also appear sometimes causing damage to your buses, so keep your roads maintained and clear of cracks. <br/>\n<br/>\r\nKey game features: <br/>\r\n- transport passengers between bus stations <br/>\r\n- a variety of bus models <br/>\r\n- build roads, stations, traffic lights completely free<br/>\r\n- NO INAPPS<br/>\r\n- upgrade stations to large bus hubs<br/>\r\n- upgrade gas station to offer different fuel types <br/>\r\n- beautiful night and day graphics, automatic or manual settings<br/>\r\n- build road network freely <br/>\r\n- build traffic lights to each junction<br/>\r\n- automatic breakdown generation<br/>\r\n- automatic road crack generation<br/>\r\n- various demolishing tools<br/>\n<br/>\r\nThe developer's notes:<br/>\r\nIf you liked the game, please provide us with feedback or a review and rate the game. We value your feedback as it helps us improve the features for future games as well so you all are welcome to request a new game feature. <br/>\r\nThanks guys- hope you enjoy Bus Tycoon ND as much as I enjoyed creating it for you!", "metacritic": null, "released": "2016-09-23", "tba": false, "updated": "2019-08-28T22:09:58", "background_image": "https://media.rawg.io/media/screenshots/22b/22bae832862ffd30f016cd7a840fa9e2.jpg", "website": "http://www.framelinenetwork.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 24}, "playtime": 7, "achievements_count": 10, "ratings_count": 1, "suggestions_count": 305, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["FrameLineNetwork"], "genres": ["Strategy", "Simulation"], "publishers": ["FrameLineNetwork"], "esrb_rating": null}