{"id": 18133, "slug": "cabal-online", "name": "CABAL Online", "name_original": "CABAL Online", "description": "<strong>Experience the revolution of action in ESTsoft’s original hit MMORPG, CABAL Online.</strong><br/><br/>CABAL Online introduces fast-paced, fluid, skill-based combat as never before seen in the MMORPG genre. Explore the sprawling and diverse lands of Nevareth, a stunning world that blurs the line between fantasy and science fiction. Play now for free!Experience<br/><ul><li>\tSeven unique character classes each offering varied and dynamic play-styles<br/></li><li>\tChallenging time-limited dungeons featuring a ranking system and completion time leaderboards<br/></li><li>\tUnrivaled skill-based PVP combat featuring a unique and intuitive combo system<br/></li><li>\tPVP systems supporting all play-styles; experience intense and balanced team-matches in Mission Battle, enter the massive fray in Nation War, pick your own rules of battle in the Custom PVP Battle Arena, or roam the world freely to protect or plunder<br/></li><li>\tBattle Mode allows your character to take on entirely new forms featuring exclusive abilities<br/></li><li>\tEpic story-driven quests featuring travel across diverse landscapes and battles with deadly foes<br/></li><li>\tMount your Astral Board or Astral Bike and venture into the unknown, blurring the line between science fiction and fantasy<br/></li><li>\tA dedicated and established community filled with active players<br/></li><li>\tContinuous content updates ensure that CABAL Online evolves with time and always provides players with engaging new challenges and frontiers to explore </li></ul><br/>CABAL Online is free to play, no matter how much time a player spends in the intriguing world of Nevareth. Time limited dungeons, blazing and fluid combat, challenging puzzles, an enthralling story, and a constant stream of new game content drives the exciting and action-packed experience that is CABAL Online.<br/><br/><strong>This is your true calling. Go forth and become a champion of Nevareth.</strong>", "metacritic": null, "released": "2016-02-17", "tba": false, "updated": "2019-09-17T10:01:37", "background_image": "https://media.rawg.io/media/screenshots/a97/a974d0b0911763f523d8b3612d28e39a.jpg", "website": "http://www.cabal.com", "rating": 3.14, "rating_top": 4, "added_by_status": {"yet": 2, "owned": 205, "beaten": 4, "toplay": 2, "dropped": 13, "playing": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 14, "suggestions_count": 548, "game_series_count": 0, "reviews_count": 14, "platforms": ["PC"], "developers": ["ESTsoft"], "genres": ["Action", "RPG", "Massively Multiplayer"], "publishers": ["ESTsoft"], "esrb_rating": null}