{"id": 1814, "slug": "the-pantheon-cycle-shrouded-aspect", "name": "The Pantheon Cycle: Shrouded Aspect", "name_original": "The Pantheon Cycle: Shrouded Aspect", "description": "Now with native iPad support using a universal binary!<br/><br/>Shrouded Aspect is the first installment in The Pantheon Cycle series. This single-player turn-based strategy game is set in a fantasy realm of ancient Celtic lore.<br/><br/>Focusing on combat instead of role-playing, action is always just a few touches away. Combat takes place on battlefields with hex-based movement. Over 200 skills can be learned through experience, as well as new equipment obtained throughout the campaign.<br/><br/>Harness the power of six different world energies to help your characters fight the evil plague that infests the land...Earth, Nature, Fire, Water, Life, and Death. Or you can do it the old-fashioned way with muscle and steel.<br/><br/>The story-driven campaign provides over 30 hours of gameplay, covering 32 scenarios with branching paths, allowing for replayability even in the single-player campaign.<br/><br/>For more information, gameplay video and screenshots, visit www.gilligames.com/sa<br/><br/>iPad, iPod Touch 3rd gen, or iPhone 3GS or newer is recommended for performance reasons.<br/><br/>If you are experiencing crashes in the Sheeh Hives or anywhere, please contact me. I&amp;#39;d like to fix any issues but I need to know about them ASAP.", "metacritic": null, "released": "2011-01-19", "tba": false, "updated": "2019-10-22T14:27:51", "background_image": "https://media.rawg.io/media/screenshots/ff0/ff0b38a324e7c6d7a43d378ce7962a08.jpeg", "website": "http://www.gilligames.com/sa", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 183, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Gilligames"], "genres": ["RPG", "Strategy"], "publishers": ["Gilligames"], "esrb_rating": "Everyone 10+"}