{"id": 1819, "slug": "power-hover", "name": "Power Hover", "name_original": "Power Hover", "description": "<strong>OVERVIEW</strong><br/>Power Hover is an action game about hoverboarding robots!<br/>Defy gravity and enjoy the freedom of controlling an hoverboard! Navigate your way through the decaying world, avoid the hazards and collect the energy! Unfold the story of odd and desolate robot-world.<br/><br/><br/><br/><strong>GAMEPLAY</strong><br/>The main goal in the game is to pass the levels and collect as much energy as possible.<br/>Controls are simple: press left or right to steer the player around.<br/>The hoverboard enables you to defy gravity and you often have to ride sideways and upside-down to pass the levels. Everything is tied together with a camera system which enables interesting angles and ensures the player stays in control at all times.<br/><br/><br/><br/><strong>STORY</strong><br/>Someone has stolen all the power from your robot village, but the track is still warm, hop on your hoverboard and get the energy back!<br/>As you ride your hoverboard through the game, a story about the odd and desolate world of the robots starts to unfold. Story is told through small interactive cutscenes.<br/><br/><strong>FEATURES</strong><br/>• Over 35 hand crafted levels full of surprises!<br/>• Defy Gravity and Enjoy the freedom of controlling a hoverboard.<br/>• Enjoy beautiful pseudo-low-poly art style.<br/>• Experience the story, told through small interactive cutscenes.<br/>• Explore the beautiful landscapes and multiple different themes.<br/>• Compete with your friends in the Challenge levels and in the Challenge mode.<br/>• A thrilling soundtrack by Ted Striker.", "metacritic": null, "released": "2015-12-09", "tba": false, "updated": "2023-08-09T17:52:53", "background_image": "https://media.rawg.io/media/screenshots/f36/f36d55083206a4598984ffd0d2a72318.jpeg", "website": "http://www.oddrok.com/powerhover/", "rating": 0.0, "rating_top": 4, "added_by_status": {"yet": 1, "owned": 100, "beaten": 1, "toplay": 1, "dropped": 3}, "playtime": 3, "achievements_count": 12, "ratings_count": 4, "suggestions_count": 148, "game_series_count": 0, "reviews_count": 5, "platforms": ["iOS", "macOS", "PC"], "developers": ["Oddrok Oy", "Oddrok"], "genres": ["Action", "Adventure", "Racing", "Arcade", "Casual", "Indie"], "publishers": ["Oddrok Oy", "Oddrok"], "esrb_rating": null}