{"id": 181928, "slug": "coton", "name": "Coton", "name_original": "Coton", "description": "<p>L’or blanc du coton au Pays <br/>des Hommes Intègres</p>\n<p>Au Burkina Faso, la filière cotonnière procure à elle seule près de 70 % des recettes d’exportation du pays. Nous nous sommes demandés si, dans le contexte de lutte contre le changement climatique, le choix des techniques agricoles pour produire le coton pouvait s’apparenter à l’essor d’une politique publique viable ?<br/></p>\n<p>Cette controverse explore les choix de politique agricole sur -lesquels s’est engagé l’État burkinabé entre 1990 et aujourd’hui. Le premier acte de la controverse s’ouvre sur le pari lancé par l’État de relancer sa culture cotonnière en utilisant les pesticides. 2003 ouvre le second acte marqué par une quête de meilleurs résultats et le passage à la technologie des OGMs. Le troisième acte se caractérise par l’ambiguïté des promesses et des désillusions de cette transformation de l’agriculture cotonnière burkinabaise. Malgré l’introduction du coton Bt (génétiquement modifié) par l’administration Compaoré en 2007, le Burkina Faso est relégué à la seconde place des exportations africaines de coton en 2008 et la controverse entre agriculteurs, sociétés cotonnières et partisans du coton Bt est au cœur de l’actualité depuis lors. L’usage systématique de pesticides est devenu un -phénomène très répandu chez les paysans burkinabés. Les problèmes provenant de leurs usages incontrôlés se sont matérialisés par quatre enjeux dans la cartographie réalisée : le rôle des intrants chimiques pour réduire l’impact de la sécheresse, celui de la gestion des stocks et des déchets de pesticides, la faible formation des producteurs locaux et les intérêts économiques de la filière du coton.<br/>La visualisation parcourt ces différents enjeux à partir du point de vue de quatre protagonistes et de leurs intérêts divergents : l’état burkinabé, les groupes agro-industriels, les ONG de l’aide au développement et les agriculteurs burkinabés.<br/></p>\n<p>Réalisation de la cartographie de la controverse [ULB]<br/>Grégoire Dromelet, Léa Emmanuel, Alessandro Megna, Juliette Mekhitarian, <br/>Somi Inès Mwe-Di-Malila et Gloria Vezzani, coordonnés par Grégoire Dromelet<br/>Réalisation de la visualisation graphique [ESA St-Luc]<br/>Nathan Dehan, Louis Delvigne et Fanny Hunin</p>", "metacritic": null, "released": "2017-11-03", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/180/180e2cb13929902028b75bc1604a82dd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 118, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Android"], "developers": ["Ahzirra"], "genres": [], "publishers": [], "esrb_rating": null}