{"id": 182040, "slug": "cucurucho-vs-the-world", "name": "Cucurucho vs The World", "name_original": "Cucurucho vs The World", "description": "<p><strong>If you do not know spanish</strong> <em>(And don't like use google traslator... but feel free to use it, with me spanish text. I think you gonne get it.)</em></p><p><strong>So this is me entry for a JAM, call it: \"SantoJAM\". the jam finish april 16, but i make a mistake in dates... So, like am al ready late, decide to pullish few things and make it like a proper product... the thing it's looks a little worse that I though. Anyway, the game accomplish his porpuse. I feel really comfortable with me new engine (And Sage XD). It's a platform with a gravity mecanic. it's not a big deal or anything, but it's fun, if you like a really injustice chanllege, look no more... this is you're game. PD: If you're like a religius dude. Plese do not play, thanks. </strong></p><p>Me <strong>Español</strong> es much better</p><p>Bueno esta es mi entrada para el Santo JAM, me pasa bastante de la fecha limite: <strong>MI RAZÓN</strong>, al ver que ya me había pasado empece a hacer proyectos pendientes y cosas varias. (Aparte aproveche para pulir y ponerle música.). La verdad es que cumplió de sobra lo que busca, que era acostumbrarme a la nueva herramienta que usare para mis proyectos. Pero esta aca, es bastante injusto y el control no esta muy optimizado asi que si mueres, sera mi culpa... Pero si le perdonas los horrores gráficos, la música a alto volumen (Te recomiendo 10% de volumen), y las muchas cosas que no respeto... créeme que te pasaras unos 5 minutos agradables. PD: Los siento si alguien se ofende con este proyecto, aunque mi objetivo era: \"Ser gracioso\" creo que se me paso la lanza con las referencias. Una disculpa si te siente aludido, no era mi intención... era a la organización en si... <strong>Mejor ya no sigo hablando</strong></p>", "metacritic": null, "released": "2017-05-02", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/a37/a37a195eafa8a75c157ddf063aa2fd21.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 93, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["kami'86"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}