{"id": 182088, "slug": "rufasgate", "name": "RufasGate", "name_original": "RufasGate", "description": "<p>Note:  RufasGate is an early C++ version of AdaGate that is no longer under active development.  It remains mainly to demonstrate a simpler build process using C++ directly, rather than using several Ada interfaces [bindings]. <br/></p><p>RufasGate is a first-person (you are the pusher) 3D sokoban puzzle game within a Stargate/Portal fantasy setting.  Now for Windows too.<br/></p>\n<p>While exploring a remote south-seas island you find an operational stargate that lures you into a curious sequence of dungeons. Your escape will require the logical rearrangement of weird power cells, called Zero Point Modules [ZPMs], that can roll in only two directions.</p>\n<p>Shoot your portal guns at the dungeon walls to define a wormhole escape. But, in order to activate it, all of the ZPMs must be bumped into their sockets. Now, you can only PUSH the ZPMs. That means you will fail if you roll one into a corner or against a wall.</p>\n<p>There are 4 dungeons and 5 degrees of difficulty [DoD] for a total of 20 user-replaceable puzzles to solve. Escape all 4 levels at the current DoD to reach an exotic lake on the surface, where the DoD is increased for your next game. Each game resumes at the DoD and level attained in the previous game.</p>\n<p>Works on Macs running OS-X and PCs running Windows or GNU/Linux.<br/></p>\n<p>Note that RufasGate can run on minimal graphics hardware, eg MacMini.</p>\n<p># Newest Update:</p>\n<p>**ver 4.0.0 -- 10nov17**</p>\n<p>* added prebuilt executables for msWindows;<br/>* added working build scripts for msWindows;</p>\n<p>**ver 3.9.3 -- 5jul17**</p>\n<p>* Added startup messages listing OGL profile &amp; version;<br/>* Implemented a nicer conformal texture map for rocks, coconuts;<br/>* Improved ocean opacity using a simplified Fresnel effect.</p>", "metacritic": null, "released": "2016-04-12", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/96c/96c5e2f1a544d5bf09e53cba4cdb0192.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 83, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["fastrgv"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}