{"id": 182118, "slug": "learning-center", "name": "Learning Center", "name_original": "Learning Center", "description": "<p>Dans ce prototype, vous êtes un directeur de centre de formation qui doit gérer au mieux son établissement.</p>\n<p>Vous devez construire les bâtiments et y implanter des salles de cours pour que vos étudiants puissent progresser et décrocher leur graal.</p>\n<p>Vous devez également embaucher des formateurs avec des profils différents qui peut influencer le déroulement de la formation.</p>\n<p>Tous se joue à la souris avec des cliquer glisser pour définir des zones à implanter.</p>\n<p>Dans l'état actuel du prototype, vous ne pouvez implanter que des bâtiments et des locaux (bureaux, salle de cours et atelier)</p>\n<p>Pour implanter un bâtiment :</p>\n<p>1 - touche <g> affiche la grille</g></p>\n<p>2 - cliquer/glisser pour définir la taille de la construction puis</p>\n<p>    - touche <a> : construit un bâtiment</a></p>\n<p>    <b> : construit une salle de cours ou un bureau</b></p>\n<p>   <c> : construit un atelier</c></p>\n<p>Les locaux ne peuvent être implantés que dans des bâtiments</p>\n<p>élève Gamecodeur depuis 8 mois</p>\n<p><strong>Langage</strong> : Lua + Love 2D sans librairie externe</p>\n<p><strong>Graphismes</strong> : Strombringer (pure code)</p>\n<p><strong>Sons</strong> : sans</p>\n<p><strong>Temps passé</strong> : environ 60 heures</p>\n<p><strong>Comment j'ai abordé le thème</strong> :  Le thème de cette game Jam est extrêmement porteur pour moi. J'aime beaucoup ce genre de jeu, du coup, les idées fusent sans doute trop.</p>\n<p><strong>Post Mortem</strong> : Comme je le dis au dessus, j'aime beaucoup ce genre de gameplay, du coup, il y a pas mal d'idées qui se télescopent et je suis parti dans un projet colossal sans vraiment m'en rendre compte au départ. Ce n'est qu'au bout d'une vingtaine d'heures de code que j'ai commencé à entrevoir le niveau de complexité que je m'étais donné. </p>\n<p>Ce \"jeu\" se transforme en demo technique pour moi avec la gestion de la caméra, le scrolling à la souris, les zooms et la gestion de la construction des bâtiments et des locaux avec la gestion des raccord entre murs.</p>\n<p>J'ai également développé une base de données de création procédurale de personnages avec des caractères différents qui peuvent influer sur le déroulement général. Mais là encore, trop de travail pour l'intégrer dans cette jam.</p>\n<p>Au final, je pense que je poursuivrais ce jeu pour en faire une version jouable, mais pour cette Jam, c'est impossible.</p>\n<p>Encore une fois, j'en aurais énormément appris.</p>", "metacritic": null, "released": "2018-05-27", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/904/904f9bc55b7d6213de94160cb83786aa.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 1, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Stormbringer233"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}