{"id": 18217, "slug": "gun-wings", "name": "Gun Wings", "name_original": "Gun Wings", "description": "It's the year 2112. A hundred years following the apocalypse, humans quickly rebuilt a new world while developing science and technology. Earth, at this time, became a perfect Eden. Despite this, humans continued to be possessed of madness and desire. Wars, crime, and killings still continued.<br/><br/>In 2113, due to the demand for new weapons of war, a program surrounding cybernetic technology was initiated. A group of specially selected girls was sent to a secret research facility for body modifications.<br/><br/>In 2115, a mysterious meteorite from deep space was detected approaching the Solar System. Some scientists predicted it would hit the Earth in three years. Humans were so afraid that they tried everything they could to prevent this from happening.<br/><br/>In 2116, analysis of the incoming meteorite revealed something even more frightening: the presence of many unknown life forms and suspected viral substances on the meteorite. Even if humanity survived the meteorite hitting the Earth, the world would be destroyed due to these mysterious life forms and viruses.<br/><br/>Near the end of 2117, just before the meteorite is due to hit the Earth, three of the girls who had their bodies modified as weapons are sent, along with all the hopes of humanity, to destroy the meteorite and save mankind...", "metacritic": null, "released": "2015-12-08", "tba": false, "updated": "2023-04-17T22:22:15", "background_image": "https://media.rawg.io/media/screenshots/4e5/4e54f155a9f24f566741d18cb28ef732.jpg", "website": "http://angelsblue.org/perentra/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 29, "beaten": 1}, "playtime": 3, "achievements_count": 21, "ratings_count": 2, "suggestions_count": 176, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["DigitalEZ", "Angels Blue Digital Entertainment", "Mercury Stone"], "genres": ["Action", "Casual", "Indie"], "publishers": ["DigitalEZ"], "esrb_rating": null}