{"id": 182285, "slug": "anticolonias", "name": "Anticolonias", "name_original": "Anticolonias", "description": "<p>Colonization: Don't let it happen to you, nor anyone else.</p><p>Six minutes of wacky alien ghost fairy strategy!</p><p>My first MiniLD entry, and actually my first game jam in general. Not as complete/balanced as I would have liked (many ideas were cut), but I hope you enjoy it nonetheless.</p><p>The tutorial is short, but there is more info to be found in tooltips, explanations in the menus, and the beginning story itself. The game's speed is adjustable and it starts slow, but there's more to explore than it might seem at first...</p><p>See if you can encounter all six endings, including the one that says your score is PERFECT :)</p><p>Known bugs: Caravans get stuck sometimes; once you play a fairy overtop something else (a village or another fairy) you can't select the thing under it anymore.</p><p>Also it was designed for 1024x600, and resizes automatically, but not during the game itself--you have to resize while you're on the title or intro story screens.</p><p>Finally, there's no audio, and it's all programmer art. :)</p><p>-----------------------------------<br/>Some helpful info not yet in the in-game tutorial:</p><p>Communities left alone may or may not send out a caravan when they grow, but the probability gets higher the bigger the community, until they are at their max size and then they always send one out.</p><p>You can click communities, caravans, fairies, colonizers, and the tower to see more info about them. Clicking ocean, green land, or resources on the map will centre the map where you click, but show the tower info.</p><p>You can also:<br/>- divert fairies who haven't reached their destination yet, or recall them once they have.<br/>- convert between Fairy Dust and Earthling Spirit by clicking the bars at the top<br/>- control the game speed with the buttons below the map, the more you want to manage what's happening or just watch things play out</p><p>-------------------<br/>CHANGELOG</p><p>1.0.1:</p><p> - growth rate is now globally affected by Grower Fairies<br/> - Fairy Dust and Earthling Spirit now show precisely how many points you have on their indicator bars<br/> - placing a fairy now works! because I am rereleasing as Flash instead of HTML5<br/> -sorry, I was testing in Flash all the time so I could debug more easily! didn't realize there was an HTML5-specific bug here...waiting on help because I can't see why there's a difference yet<br/> - I had made it so you can resize the game (but only during title/story screens)--however, this doesn't work on embedded flash! if you download the SWF and play offline in a standalone Flash player it will...</p><p>1.0.2:</p><p> - now back to html5 again and you can place fairies this time :) also released for Flash though just in case...<br/> - fixed communities having the wrong icon if they grew too big<br/> - fairies now cost what they say they do<br/> <br/>1.0.3:</p><p> - use system cursor instead of HaxeFlixel cursor, to hopefully fix it so the cursor is visible on Macs<br/> - fixed so clicking ES/FD bars at the top when tree is selected no longer gets you stuck in the ES/FD conversion menu<br/> - fixed dead communities leaving a ghost image behind<br/> - added sixth ending</p><p>1.0.4:<br/> <br/> - tower and default view are now combined<br/> - tower empty slots now suggest what to do<br/> - \"upgrade tower\" button now enables when ES passes amount needed (without having to switch away from tower and back)<br/> - clock and tower shortcut are now near the map instead, and tower shortcut is always enabled<br/> - added some tutorial popups and a tooltip on the tower upgrade button<br/> - fixed tooltips and other UI elements to work properly even when the game is paused<br/> <br/>1.0.5</p><p> - fixed fullscreen layout: top bar was too big, some tower text cut off </p>", "metacritic": null, "released": "2016-08-03", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/8c7/8c752e3f7955e30b78a47fb617c4f64b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 26, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["IBwWG"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}