{"id": 18227, "slug": "the-youthdrainers", "name": "The Youthdrainers", "name_original": "The Youthdrainers", "description": "In an unknown location out in the wilderness, a number of pregnant women are being held against their will in a facility in which everything is decorated in the style of a comforting living room to lull the women into a false sense of security so that they believe they’re in a safe spot. <br/><br/>The reality however, is much more hideous...<br/><br/>The women are in fact being monitored by a race of Little evil humanoids dressed head to toe in bright yellow robes. The humanoids want the babies for their heinous experiments, but you, as a mother, see no alternative but to take your own life to save your baby’s soul. <br/><br/>The game will begin with you in a room where you find a tape recorder with a woman’s voice on it, who was the previous inhabitant of the room before you. <br/><br/>The tape is a warning for other women who will be kidnapped, telling them what is going on and that she is going to kill herself before the evil little monsters burst through the door and take her baby. <br/><br/><br/>* 2D sidescrolling search and find adventure<br/>* Search for objects to escape the room and save your baby's soul<br/>* Use the flashlight when the lights go out to scare of the evil little monsters<br/>* Use a headset to know from which side the evil is coming<br/>* Discover the truth behind the facility<br/><br/><br/>Recorded message:<br/><br/>Whoever hears this message please listen carefully to this message...<br/><br/>This facility is not as it seems, there is evil in this place. There is no escape, they want to take your babies and use them for their evil experiments. <br/><br/>Don’t be fooled by the decor around you, they want you to feel like you’re in a safe place. The walls, rooms, paintings, sofas, and everything else is not real, they want you to feel at home but you aren’t, you’re in hell... <br/><br/>Be under no illusions, you will die one way or another. There is no escape, I’ve tried everything you could think of and as soon as they suspect something is up they’ll turn off the lights and enter the room. <br/><br/>There’s a reason they turn off the lights before they enter. The lights, they hurt their eyes, and by hurt, I mean they really hurt their eyes. Any light that you have, use it as it will keep them at a safe distance and may buy you some time. <br/><br/>The light can only buy you some time however, there is still no escape and no way out. The only way you can end the suffering and protect your unborn child is to take your own life before they get to you first. <br/>", "metacritic": null, "released": "2016-09-18", "tba": false, "updated": "2019-08-28T22:09:55", "background_image": "https://media.rawg.io/media/screenshots/2ef/2ef5e778ec0185ce7c88b169b90477cf.jpg", "website": "http://www.evilizedproductions.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 59}, "playtime": 4, "achievements_count": 10, "ratings_count": 1, "suggestions_count": 262, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Ben Aprigliano"], "genres": ["Adventure", "Casual", "Indie"], "publishers": [], "esrb_rating": null}