{"id": 182492, "slug": "uknight-spectacular", "name": "uKnight Spectacular", "name_original": "uKnight Spectacular", "description": "<p>uKnight Spectacular présente une version originale d’une machine à sous en intégrant plusieurs aspects du casino dont des jeux (poker, bataille) et sa théâtralité inspirée par son ambiance et ses spectacles. De type médiéval, le jeu provoque l’excitation des jeux de stratégie et l’exclamation des jeux de hasard.</p>\n<p>En prime, elle permet aux joueurs de personnaliser leur roulette de cartes à jouer avec un système de « drag and drop ».\r\n  </p>\n<p> Sous la forme d’une machine à sous qui semble conventionnelle, les joueurs doivent s’affronter lors d’un duel en activant des roulettes composées de cartes à jouer en tirant chacun sur leur levier.</p>\n<p>Chacun devra ensuite arrêter leurs 3 roulettes respectives afin de composer leur armée. Les roulettes roulent de plus en plus vite de gauche à droite.</p>\n<p>La valeur des cartes est représentée par des chevaliers médiévaux au lieu du nombre symbolisé par leur suite. Les joueurs accumulent donc des chevaliers de pique, de cœur, de carreau et de trèfle afin de s’affronter dans un combat qui se déroulent dans un petit théâtre au-dessus des roulettes.</p>\n<p>Le joueur avec le plus de chevaliers remporte la partie. Le gagnant sera récompensé par une carte.</p>\n<p>À tout moment, les joueurs auront le choix de s’unir afin d’affronter le croupier.</p>\n\n<p>Instructions</p>\n<p>Activer et arrêter les roulettes :</p>\n<p>Manette : Tirer le « joystick » gauche</p>\n<p>ou </p>\n<p>Clavier : </p>\n<p>Joueur noir = Touche Espace</p>\n<p>Joueur rouge = Touche Enter</p>\n\n<p>Redémarrer : Touche R</p>\n\n<p>Déroulement d’une partie</p>\n<p>Ils ont chacun leur manette afin de contrôler leurs actions. \r\n  </p>\n<p>Les joueurs peuvent soit jouer avec les roulettes déjà assemblées ou les personnaliser. S’il y a lieu, l’inventaire de leurs cartes s’ouvre latéralement.\r\n  </p>\n<p>Une fois que les joueurs ont modifiée leurs roulettes, ils tirent sur le « joystick » afin d’enclencher les révolutions.\r\n  </p>\n<p>Le joueur arrêtera, une à une, ses 3 roulettes, en tirant à nouveau sur leur « joystick »</p>\n<p>Les totaux des chevaliers qui s’uniront pour former leur armée s’affichent en haut de chaque roulette.</p>\n<p>Si le joueur parvient à obtenir une paire ou un triple, cela multipliera leurs forces. Les totaux de plus s’afficheront aussi.</p>\n<p>Les chevaliers apparaitront dans le petit théâtre pour unir leur force lors d’un combat.\r\n  </p>\n<p> <br/></p>\n<p>Les règles du jeu</p>\n<p>uKnight Spectacular peut être joué contre et avec l’ordinateur ou un autre joueur.</p>\n<p>Somme des cartes arrêtées : le nombre total sera la somme des totaux affichés \r\n  </p>\n<p>Quand on obtient une paire : le nombre de chevaliers qui composent la paire double.\r\n  </p>\n<p>Par exemple, si vous avez obtenu : 8, 3, 3 vous aurez en réalité 8, 6, 6 donc 20.\r\n  </p>\n<p>Quand on obtient un triplé : le nombre de chevaliers des 3 roulettes triplent.\r\n  </p>\n<p>Par exemple, si vous avez obtenu: 7, 7, 7 vous aurez en réalité 21, 21, 21 donc 63.\r\n  </p>\n<p>Thème</p>\n<p>Notre jeu suit le thème « L’union fait la force » de quelques façons.</p>\n<p>La prémisse du jeu est d’unir le plus grand nombre de chevaliers afin d’être plus fort que l’autre joueur. \r\n  </p>\n<p>Mais, aussi il y a deux autres façons de réaliser cette union.</p>\n<p>Lors de combat contre le croupier, les joueurs doivent réunir leurs chevaliers pour former une armée qui deviendra encore plus nombreuse donc plus forte. \r\n  </p>\n<p>L’union de leurs armées doubleront au moins leur nombre et leur force. </p>\n<p>La personnalisation des roulettes est une stratégie afin d’augmenter leur chance de réunir plus de chevalier dans leur armée. Par exemple, en rajoutant plus de cartes de la même dénomination dans une roulette, ils peuvent optimiser la probabilité d’obtenir des paires, des triples ou tout simplement d’accumuler plus de chevalier.</p>\n<p>Donc voici les 3 façons de bénéficier et de profiter que l’union fait réellement la force.    </p>\n<p>Contraintes\r\n  </p>\n<p> \r\n  </p>\n<p><strong>Multijoueur</strong>\n</p>\n<p>uKnightSpectacular vous permet de jouer en mode multijoueur, deux personnes à la fois, de deux façons : un contre l’autre et les deux joueurs contre le croupier. \r\n  </p>\n<p>Le deuxième mode peut être déclenché aléatoirement.</p>\n<p><strong>Éléments spectaculaires</strong>\n</p>\n<p>De plus, la musique suscite une ambiance de cabaret et les effets sonores ajoutent de l’entrain et de l’excitation lors du combat ce qui provoquent un contraste.</p>\n<p>Lors du combat dans le théâtre, les rideaux se refermeront et les joueurs pourront qu’entendre leur armée se défendre et attaquer. Les bruits d’exclamations et de combats ajoutent de l’humour et un élément de spectacle.</p>\n<p>Le revirement de la situation que les joueurs doivent maintenant unir leur force pour combattre le croupier est enlevant et surprenant.\r\n  </p>\n\n<p>\n</p>", "metacritic": null, "released": "2017-11-12", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/625/62593623a68753bfc672c0307b360d3a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 33, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["lavwa"], "genres": [], "publishers": [], "esrb_rating": null}