{"id": 182527, "slug": "elites-y-zombies", "name": "Elites y Zombies", "name_original": "Elites y Zombies", "description": "<p>Español: En el año 2025 ocurrió la mayor tragedia de la humanidad un grupo de crackers logro romper con la seguridad de todas la bases militares de alta tecnología donde poseían robot de combate listos para de guerra. Gracias a un procesador cuántico mejorado pudieron acceder a la programación de los robots, pero el grupo se volvió completamente loco y programaron a los robots para ser hostil con toda forma de vida en la tierra. Un grupo de científicos experimentaba con un medicamento capas de regenerar partes del cuerpo humano y volver a la vida a los muertos, pero los experimentos nunca salían bien y los cuerpos con el remedio liberaban un virus que se trasmitía por la saliva y al que mordía se deformaba, perdía la conciencia y era muy agresivo. Cuando se inyectaba en exceso este medicamento los cuerpos  empezaban a mutar con los días hasta ser capaz de matar a las personas con su fuerza. El día que los robots empezaron a causar el caos en la ciudades y también en el medio del caos accidentalmente liberaron a los mutantes y el virus se empezó a trasmitir por la gente que aún seguía viva. Algunos sobrevivientes denominaban a las personas con el virus \"Zombies\". Algunos de estos zombies se dedicaban a producir lagos de saliva con este virus y el que se sumergía y tragaba mucha cantidad de saliva se trasformaba en un \"Super mutante\" mucho más fuerte que los zombies.</p>\n<p>Requisitos mínimos:<br/>Os: Windows 7 32 Bits<br/>Procesador: Intel Core i3 2310M @ 2.10 Ghz<br/>Memoria: 2GB RAM Disco Duro: 4GB espacio disponible<br/>Grafica: Intel HD Graphics 3000<br/>Plataforma: PC y Android<br/>Idiomas: Español, Inglés<br/>Desarrollador: Unigames<br/>Clasificación: TEEN (adolescente)<br/>Características:<br/>- Modo campaña con 6 capítulos<br/>- Modo por rondas<br/>- Armería personalizable<br/>- Nivel de jugador</p>\n<p>Página del juego: http://www.unigames.esy.es/juego3.html<br/>Página de los desarrolladores: http://www.unigames.esy.es<br/>Página para contactar con el soporte: http://www.unigames.esy.es/contacto.html?</p>\n<p>Descargar .apk para Android (Gratis): http://www.unigames.esy.es/eyz/android.php<br/></p>\n<p>Aviso: El guion de la campaña es muy pobre y a veces carece de sentido.</p>\n<p>---------------------------------------------------------------------------------------------------</p>\n<p>English: In the year 2025 the greatest tragedy of humanity occurred, a group of crackers managed to break with the security of all the high-tech military bases where they had combat robots ready for war. Thanks to an improved quantum processor they were able to access the programming of the robots, but the group went completely crazy and the robots were programmed to be hostile to all life on earth. A group of scientists experimented with a medicine to regenerate parts of the human body and to bring the dead back to life, but the experiments never went well and the bodies with the remedy released a virus that was transmitted by the saliva and that it bit. He deformed, he lost consciousness and he was very aggressive. When this medicine was injected in excess, the bodies began to change with the days until they were able to kill people with their strength. The day that the robots started to cause chaos in the cities and also in the middle of the chaos accidentally released the mutants and the virus began to be transmitted by the people who were still alive. Some survivors called people with the virus 'Zombies'. Some of these zombies were dedicated to producing lakes of saliva with this virus and the one that submerged and swallowed a lot of saliva became a 'Super mutant' much stronger than the zombies.</p>\n<p>Minimum requirements:<br/>OS: Windows 7 32 Bits<br/>Processor: Intel Core i3 2310M @ 2.10 Ghz<br/>Memory: 2GB RAM Hard Disk: 4GB available space<br/>Graphics: Intel HD Graphics 3000<br/>Platform: PC and Android<br/>Languages: Spanish, English<br/>Developer: Unigames<br/>Classification: TEEN<br/>Characteristics:<br/>- Campaign with 6 chapters<br/>- Mode round<br/>- Customizable armory<br/>- Gamer level</p>\n<p>Game page: http://www.unigames.esy.es/juego3.html<br/>Developer's page: http://www.unigames.esy.es<br/>Page to contact support: http://www.unigames.esy.es/contacto.html?</p>\n<p>Download .apk for Android (Free): http://www.unigames.esy.es/eyz/android.php<br/></p>\n<p>Warning: The script of the campaign is very poor and sometimes it does not make sense.</p>\n<p>Trailer Español: </p>\n<p>Trailer English: <br/></p>", "metacritic": null, "released": "2018-08-22", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/ca8/ca82a6b3bc0a0fa95345a961cd1ef796.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 184, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Android"], "developers": ["Unigames"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}