{"id": 182620, "slug": "infinite-space-vine", "name": "Infinite Space Vine!", "name_original": "Infinite Space Vine!", "description": "Endless Runner with online leader boards, set in space!How to play!<p>Avoid space crystal while you try to get as far as possible on the mysterious space vine.</p><ul>\n<li><strong>Arrow keys</strong> to move left or right.</li>\n<li><strong>ESC</strong> to pause</li>\n<li><strong>Space</strong> to start the game from menus.</li>\n<li>Click on \"Playing as\" to change name for the leader boards.</li>\n</ul>\r\n\tPatch NotesV1.3 (Current) - 11/3/2015Features<ul><li>Updated \"Ship\" Model, it now has a nose which makes it looks more like a ship then a helmet.</li><li>There is now Limited Controller support, Press A to start the game (as long as no panels are currently active), D-pad or left thumb stick to move left or right.</li><li>FOV Slider</li></ul>Fixes<ul><li>Tweaked the HUD a little to fit the new model more</li><li>Moved the camera around (Still not loving the position)</li><li>Made Cursor viable while paused, useful for closing the game...</li><li>Removed a camera, now just move around the main one.</li></ul>Broke<ul><li>Resolution and Full screen options are mostly broken now, so I deactivated it. </li><li>Probably tons more.</li></ul>Planned features/fixes<br/><ul><li>Fix resolutions again or at least add the default unity one back until fixed.</li><li>Simplify the options menu, there is no reason to be fancy</li><li>Make defaults for the options.</li><li>Death effect, particles and sound effect.</li><li>Buttons on the pause menu for quitting or restarting.</li><li>More variation of the obstacle</li></ul>V1.2 - 11/3/2015Fixes<ul><li>Fixed leader boards, players should now be prompted to enter their name at the first boot of the game, as well as anytime the name is gone for whatever reason.</li><li>Reset button under options now reset everything, including your name and options.</li><li>Its no longer possible to start the game while the Options or Name entry panels are open.</li><li>Deactivated Development build Whoops! File size is a lot smaller now.</li></ul><p>Made for Novices Now over 2 weeks (Originally) in Unity By @Wagosaur.<br/></p><p>Screenshots are from different stages in development.</p>", "metacritic": null, "released": "2015-11-01", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/ea9/ea94c5f538828b4d710f9dfc93a68e9c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 179, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Wagosaur"], "genres": ["Action"], "publishers": [], "esrb_rating": null}