{"id": 18268, "slug": "data-jammers-fastforward", "name": "Data Jammers: FastForward", "name_original": "Data Jammers: FastForward", "description": "<strong>Data Jammers: FastForward</strong> is a continuously moving three dimensional driving and destruction game set within a retro wireframe world of impossible race tracks. Prowl twisting bitstreams amidst bizarre geometrical environments enhanced by otherworldly soundscapes as your nimble avatar encounters more dangerous denizens, hazards and boss guardians along the way!<br/> <br/>You are a Data Jammer...specifically a D.O.O.D. (Digital Operative, Optical Data),  an elite virtual commando tasked with one purpose: Infiltrate the virtual Vaults of Ouroboros, the Military Industrial Complex, and take down The System!<br/> <br/>The Deep Grid. The Wilderness. You've heard the hushed rumors about a \"network behind the network\"; a sub-cyber matrix of covert datastreams utilized solely by the Dark Powers of the world. Now, after several risky excursions beyond vast Pulsor City, you know the truth --Ouroboros exists!  In defiance, you have trained to work for the Good Guys to preserve Freedom by defeating the devious Grid Guardians, exposing the sinister secrets of those evil villains who use it to conspire and oppress!<br/> <br/>From the makers of Brainpipe: A Plunge to Unhumanity, Weird Worlds: Return to Infinite Space, Dr. Blob's Organism, and Strange Adventures in Infinite Space.<br/><br/>\t\t\t\t\t\tKey features:\t\t\t\t\t\t<ul><li> Zen-inducing frenetic arcade gameplay<br/> </li><li> Arresting 3D visuals and audio<br/> </li><li> Mindbending race tracks<br/> </li><li> Increasingly challenging environments, critters and hazards per level<br/> </li><li> Easy to learn and play<br/> </li><li> Brisk play sessions<br/> </li><li> Excellent replayability<br/> </li><li> Hands on tutorial<br/> </li><li> Supports game controller and good ol' fashioned keyboard<br/> </li></ul>", "metacritic": null, "released": "2011-10-24", "tba": false, "updated": "2022-09-26T02:23:27", "background_image": "https://media.rawg.io/media/screenshots/a5e/a5e7f0266ff8d571073d697ed4cb8dca.jpg", "website": "", "rating": 2.29, "rating_top": 3, "added_by_status": {"yet": 7, "owned": 428, "beaten": 1, "toplay": 1, "dropped": 1}, "playtime": 1, "achievements_count": 21, "ratings_count": 7, "suggestions_count": 243, "game_series_count": 0, "reviews_count": 7, "platforms": ["macOS", "PC"], "developers": ["Digital Eel"], "genres": ["Action", "Indie"], "publishers": ["Digital Eel"], "esrb_rating": null}