{"id": 182628, "slug": "army-frontline-ssg-commando-shooting", "name": "Army Frontline SSG Commando Shooting", "name_original": "Army Frontline SSG Commando Shooting", "description": "<p>World’s peace is in danger and the war is broken in various parts of the world. A new terrorist group has attacked different parts of your country and wage war against us. Killing thousands of innocent people and making them slaves. You as the sole SSG Frontline Commando in the area, have to stop them and defend the front line. Renegade Yalghaar operation against these terrorists and end this war once for all. Use your skills to survive and avenge your fallen commandos and soldiers. </p>\n<p>Army Frontline SSG Commando Shooting is a first-person shooting game in which you have to clear the area from terrorists.  You got an arsenal of weapons in the shop which you can unlock easily. This Army commando action game has 8 different maps to perform a counter terrorists operation. Every map contains 16 different levels and the difficulty increases with the completion of each level. The number of terrorist increases and the damage they deal also increases. Be careful while defending the front line because these terrorists are well equipped and fully trained and can deal a lot of damage. </p>\n<p>Maps are unlocked by completing all war levels or operations on a single map. As you complete all war operations a new map will be unlocked. You got 20 different FPS shooting weapons which can be unlocked easily. Weapons included are: M4, AK 47, G3, Sniper, Machine Gun, Pistols, Short Guns, Knife, Sword, Hammer, axes and much more. All weapons are fully automatic and we have also included the auto-fire feature in this game. So just aim at the target terrorist and your gun will fire automatically, you don’t have to tap every time for shooting. The 3D graphics are amazing in this FPS shooting game. You will face no lag as this game is fully optimized, also you can lower the graphics from the setting. The controls are smooth which help in moving around in this 3D FPS maps and hunt down these terrorists. Your SSG Commando got a mini-map which is a really useful feature; you can easily locate terrorists using this map and plan your Yalghaar SSG Frontline Commando operation accordingly.</p>\n<p><b>Army Frontline SSG Commando Shooting  Features:</b><br/>• Amazing 3D graphics.<br/>• 8 different FPS maps with 16 different levels each.<br/>• More than 20 different Army weapons to use.<br/>• One of the best FPS shooting game.<br/>• Sound effects which make game play more enjoyable.<br/>• Smooth controls for movement and aim.<br/>• Mini map to locate enemy on the map.<br/>• Auto-fire assistant to easily down the terrorist.</p>\n<p>Become a Special Services Group member and complete Yalghaar Commando operation heroically and gain your honor. Download this FPS Army Frontline SSG Commando Shooting and don’t forget to provide us your valuable feedback, so that we improve in future.</p>", "metacritic": null, "released": "2017-10-09", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/0e5/0e582546e43abd260a7be75b8ea3d9dd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 251, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Sohail Mumtaz"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}