{"id": 182662, "slug": "worlds-hardest-game", "name": "WORLD'S HARDEST GAME", "name_original": "WORLD'S HARDEST GAME", "description": "<p>LINK TO WALKTHROUGH</p>\n<p>Officially the world's hardest game? Love it when your games have challenge. This game has it in spades. Ace of Spades. Do you love to die over and over, then you'll love this game? This game will teach you many things about games. You will have a great exp with this game I guarantee it. If you just click \"download\" and then you unzip it you will find the help txt file and the exe launch the exe and try to do it. If you are confused go to the help file or watch the walkthru, cuz this is the hardest game you'll ever play in all your life. You will spend hours mastering it, and you will walk away a better gamer. Then you will find harder games to play and you will die many times, but it will be ok because you will learn how to be a better gamer. And then you will play more harder games until you find the hardest game, which is this game. This game was meant for people who like a challenge in their games, especially those who have played a lot of other challenging games and want a new challenge to add to their skills. This game really challenges you to do the task it tells you to, though the task is part of the challenge because it is so hard. It is too hard for some people but we dont talk about them. We only want good gamers here and those people arent good gamers. If you arent a good gamer you dont belong here. if you cant play games you should just die. if you cant play games i should just kill you, </p>\n<p>If you want to play a challenging game and really show it who's the boss, and then really show everybody else you are a really good gamer and impress them with the skills you have learned to do in this game and show everybidy whose boss so you can be the uber man you should play this game. IF you think this game is too hard u should cliick off the site right now and go back to candy crush because u r not a real gamer. you are fake and a stupid person who is into games because they want to pretend to be cool and intelligent but arent really, and so u should just go die. </p>\n<p>this game was made to be the hardest game you have ever played, and it is dark and might make you upset, so if u dont want to get upset or feel disturbed dont play it or watch the vid. Then when u do that go take a nap or watch the sunset, meanwhile ill be here tied in chains </p>\n<p>or maybe ill go out and smell fresh air too but the fresh air is in this game we have the hardest game or the freshest game or the hardest air? I dont knwo but what i do know is this is THE WORLDS HARDEST GAME,</p>\n<p>no lie,</p>\n<p>too true,</p>\n<p>solitary single player,</p>\n<p>and free,</p>\n<p>unless u want to donate to us,</p>\n<p>and if u are confused watch the Walkthrough because its ok to watch other ppl play games especially to train u on how to play the game right and if u watch them sometimes they make funny jokes or funny things happen rite? </p>\n<p>And the walkthrough is kind of its own new thing its not just the game its about the person making the walkthru too right?</p>\n<p>And if something horrible were to happen to the person playing it would be caught LIVE rigt ;) ;o :D</p>\n<p>Anyway u should not be ashamed to watch somebody else play a game by the way especially if they are playing the World's Hardest Game. Everybody should stream tjeir completed streams of the World's HArdest Game rite? And if they don't do all the parts right they should be held accountable..................... and that way the game will becoem super famous cuz of all the streamers streaming it!</p>\n<p>So stream the game and play the game and show your friends too </p>", "metacritic": null, "released": "2017-12-11", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/92f/92fd477d927c7728e0dfaf51ada41378.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 12, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["perebite"], "genres": [], "publishers": [], "esrb_rating": null}