{"id": 182677, "slug": "kidnap-all-humans", "name": "Kidnap All Humans", "name_original": "Kidnap All Humans", "description": "<p><strong>Controls:</strong></p>\n<p><strong>Keyboard:</strong> WASD to move UFO/Alien, Left Mouse to Shoot, Middle Mouse to switch between UFO and Alien, Right Mouse for abduction beam (air)/kidnapping (ground). R for restart.<br/></p>\n<p><strong>Controller:</strong> Joysticks to move/rotate, triggers to shoot/abduct, B to switch UFO and Alien, A to kidnap (ground). Start to restart.<br/></p>\n<p><strong>Future Updates: </strong>Create more fluent levels, add more enemies and AI behavior. Add animations and behaviors to the humans so they aren't stationary. I would also really like to implement more interactive environments, because that was a big goal at the beginning of this project which I feel really got removed in the last build when changing to level system. Instead of being more interaction/arcade based, it's now more objective based. This helps the core loop of the game, but took away from the overall feel I had for it. Perhaps create two different playmodes, one level based one, and then just free roam one.</p>\n<p><strong>Update (11/15):</strong> Final build of game is posted. Completely reworked game to be in a level system. Had trouble doing so since game was not initially meant to be level based. Goal is to kidnap humans to your ship, and use your ship to deposit them in your base to upgrade it. There are two hidden trophies I put in the game for completing certain actions. I increased the movement speed of both the UFO and the Alien to kind of balance the new level playstyle. I made it so the game clears all remaining objects before beginning a new level. I redid the entire help screen to reflect updated controls and objectives. The game still plays better on a controller, but again, a keyboard can be used. Switched the triggers on the controller for abduct and shooting. Implemented the new soldier enemy that shoots the player on the ground.</p>\n<p><strong>Update (11/8):</strong> Balancing reworks done on values throughout the game including movement speed, bullet velocity, human spawns, point earnings. Art added in for the base and its upgrades, along with completely redoing all of the human art assets. Few sounds added in from Freesound.org. Alien on ground can no longer shoot. Instead of killing humans for fuel, they are now brought to your ufo while on the ground. When running out of fuel, it will automatically kick you onto the ground.  Took bonus text off of screen, player does not need to actively keep track of that. So for simplicity it was removed.</p>\n\n<p><strong>Update (10/25):</strong> Keyboard implementation is completed. It is still easier to play with a controller, but not necessary. Added in menu screen. Redoing art assets in progress, currently working on background image.</p>\n\n<p><strong>Update (10/22):</strong> At the moment, this game requires an Xbox controller. Keyboard controls are not fully working, so the text file is not included in the newest version. Controller version is working fine.</p>", "metacritic": null, "released": "2017-10-13", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/352/35297f9db1f3f5ea79a23fa9d318884b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 20, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Quetzalty"], "genres": [], "publishers": [], "esrb_rating": null}