{"id": 182631, "slug": "cash-blender-uk-fruit-machine", "name": "CAsh Blender - UK Fruit Machine", "name_original": "CAsh Blender - UK Fruit Machine", "description": "<p><strong>6 Reel - £500 Jackpot Club Fruit Machine</strong></p><p>IMPORTANT NOTE: When your credit is exhausted and your bank is empty press on the \"CAsh Blender\" banner in the lower reels screen to receive more FREE credit With real life percentage payout, and behaviors.</p><p>The machine is presently set to 50p per play and pays out 80% of everything you put in.</p><p>Can you use your Skill and Luck to hit the £500 JACKPOT?</p><p>This app is 100% free there are no in app purchases, so is free to play as much as you wish whenever you wish. Please Note: On this same basis please note this is emulation only, no money will change hands on it and you will not be asked for pay for anything, nor will you receive any winnings It is purely for fun and hence it is 100% free to play</p><p><strong>Lower Reels Features</strong><br/>Transfer your bank balance to credit using the coin slot.<br/></p><ul><li>Holds: Hold matching symbols to get a winning combination</li><li>Nudges: Use nudges when available to get the best winning combination</li><li>Winning Shuffles: When you nudge and no winning combination is received, will you get a free winning shuffle?</li></ul>Now that you have a win on the lower reels, play your winning on the \"Win Meter\" win anything up and including the £500 JACKPOT<strong>Top Reels / \"Win Meter\" Features</strong> <p>The \"Win Meter\" adds up all you winnings to date, allowing you to risk part of the \"Win Meter\" value to try and win even more</p><p>Select your stake to win on anything up to 8 win lines per spin</p><ul><li>£1 Spin = 3 Win lines</li><li>£3 Spin = 5 Win lines</li><li>£5 Spin = 8 Win lines</li></ul><p><strong>Playing Tips</strong></p><ul><li>On the lower reels long press on the top half of the reels to look up, very useful when nudging</li><li>Nudges are not 100% random! Can you work out how to earn more nudges?</li><li>When your credit is exhausted and your bank is empty press on the \"CAsh Blender\" banner in the lower reels screen to receive more FREE credit</li></ul>", "metacritic": null, "released": "2016-01-13", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/6a8/6a8c3d6eaa6e15697b3f5d5ff700abed.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 109, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["cashman_eq"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}