{"id": 182754, "slug": "nyanandy", "name": "NyanAndy", "name_original": "NyanAndy", "description": "<p>This is a sort of top down shooter of Nyan Andy dodging rocks in space. </p><p>Nyan Andy is based on Andyjackel, a youtuber and a friend of mine. I made him a nyan version of him as a joke (based on Nyancat). Then I was messing around with code, and made a game using his character. It's pretty simple, but i'm happy with the game, and i'm mostly putting this up to figure out how exporting a game works.</p><p>Update 0.4</p><p>-There is now a score multiplier! Starting at 1000 points and every 2000 points after there will be a bubble at the bottom of the screen that will double your points for 10 seconds!</p><p>Update 0.3</p><p>-You can now press left/right in menus to change characters to Nyan Spaceman</p><p>-Every 1000 points rocks stop coming and lasers will come from the top of the screen</p><p>-rock top speed lowered</p><p>-death animation has been sped up</p><p>-the player will now fly upward upon death if on top half of the screen</p><p>-menu changes</p><p>Update 0.2</p><p>-added saved high scores so if you play multiple times you know your old high score</p><p>-added a congratulations message every 1000 points</p><p>-death screen now mentions what your most recent score was</p><p>-changed the rock textures</p><p>-stars start slower but move faster the higher your score is</p><p>-darker background so Andy pops out more</p><p>Update 0.1</p><p>-player can move with the arrow keys</p><p>-Can press up to start the game</p><p>-Rocks come from the right and kill player on contact</p>", "metacritic": null, "released": "2016-12-31", "tba": false, "updated": "2019-08-28T23:21:11", "background_image": "https://media.rawg.io/media/screenshots/c69/c69927830b8c32808c7597e3dbe58d17.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 14, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Nujum Key"], "genres": [], "publishers": [], "esrb_rating": null}