{"id": 18279, "slug": "puzzler-world", "name": "Puzzler World", "name_original": "Puzzler World", "description": "<strong>Puzzler World</strong> brings over 1200 puzzles of 8 popular puzzle types to your PC. Conceptis picture logic puzzle fans will be happy to know that in addition to Crossword, Wordsearch, Fitword, Sudoku, Codeword, Spot the Difference and Silhouette puzzles, Puzzler World also offers 83 Conceptis Link-a-Pix available in sizes of 10x10, 20x20 and 25x25.<br/> <strong>Puzzler World</strong> is split across two game modes: Quickplay, for a fast puzzle fix, and Challenge, for advance gaming where you can prove your puzzling prowess and tackle a wealth of puzzles and unlockable bonus games on offer.<br/>\t\t\t\t\t\tSuccessful players can win Hint Tokens to spend on tips and solutions as well as unlock exciting Bonus Games from six additional games to discover; Hangman, Chain Letters, Equate, Jigsaw, Picture Quiz and Missing Piece. The game also boasts a Handwriting Recognition feature which allows players to teach the game their own unique alphabet and handwriting style.<br/> <strong>Key Features:</strong><br/> <ul><li><strong>Challenge:</strong> Play for Bonus Games and Rewards, or beat your personal best time.<br/> </li><li><strong>Family Favourites:</strong> Including Wordsearch, Crossword, Sudoku, Spot-the-Difference, Silhouette, Codeword, Fitword and Link-a-Pix<br/> </li><li><strong>Quick Play:</strong> An instant way to improve your puzzling skills.<br/> </li><li><strong>Bonus Games:</strong> Unlock additional bonus games in Challenge mode including Hangman, Equate, Jigsaw, Picture Quiz, Chain Letters and Missing Piece.<br/> </li><li><strong>Handwriting Recognition:</strong> You can write in your own handwriting style which the game will learn to recognize.<br/> </li></ul>", "metacritic": null, "released": "2009-12-08", "tba": false, "updated": "2019-09-17T08:30:13", "background_image": "https://media.rawg.io/media/screenshots/378/3789605af52118062922b9bed34e4c30.jpg", "website": "", "rating": 3.4, "rating_top": 4, "added_by_status": {"yet": 4, "owned": 259, "beaten": 9, "toplay": 1, "dropped": 4, "playing": 1}, "playtime": 2, "achievements_count": 14, "ratings_count": 10, "suggestions_count": 245, "game_series_count": 0, "reviews_count": 10, "platforms": ["Nintendo DS", "PC"], "developers": ["Ideas Pad"], "genres": ["Casual"], "publishers": ["Atari", "Merge Games"], "esrb_rating": null}