{"id": 18274, "slug": "everyday-genius-squarelogic", "name": "Everyday Genius: SquareLogic", "name_original": "Everyday Genius: SquareLogic", "description": "The next generation of puzzle games is here!  Combining simple arithmetic with colorful cages and logical problem solving, this new puzzle game makes sure you never have to guess—and you don’t have to be a math wiz! <br/>\t\t\t\t\t\tEveryday Genius: SquareLogic can calculate and display possible solutions automatically—allowing you to spend more time playing and less time tediously jotting down possibilities. With puzzles ranging from first-grade easy to astrophysicist hard, you’ll progress along the path to enlightenment as you build your problem-solving brain power with Everyday Genius: SquareLogic.<br/> <ul><li>New types of puzzles never before seen in any game!<br/> </li><li>More than 20,000 puzzles, with over 18 different varieties and 6 different sizes<br/> </li><li>Removes the tedium of first-generation puzzle games by automatically handling notation and possibilities for you<br/> </li><li>No need to be a math wiz; solution possibilities are provided, letting you focus on puzzle-solving logic rather than arithmetic<br/> </li><li>Dazzling array of puzzles, with enough variety to tempt even the most sophisticated puzzle palate—hidden cages, double boards, comparisons, sequences, and more<br/> </li><li>Guide teaches you new ways to look at the problem and arrive at the correct solution<br/> </li><li>Thousands of puzzles at each level to challenge players of all ages and abilities<br/> </li><li>Excellent tutorial<br/> </li></ul>", "metacritic": null, "released": "2009-10-21", "tba": false, "updated": "2023-10-18T00:43:52", "background_image": "https://media.rawg.io/media/screenshots/9b2/9b27fcb4e02371b6a86373845a6c9000.jpg", "website": "http://www.squarelogicgame.com", "rating": 0.0, "rating_top": 4, "added_by_status": {"yet": 2, "owned": 60, "beaten": 4, "toplay": 1, "dropped": 1}, "playtime": 9, "achievements_count": 24, "ratings_count": 5, "suggestions_count": 225, "game_series_count": 0, "reviews_count": 5, "platforms": ["PC"], "developers": ["TrueThought"], "genres": ["Strategy", "Casual", "Indie"], "publishers": ["TrueThought"], "esrb_rating": null}