{"id": 18278, "slug": "ziro", "name": "Ziro", "name_original": "Ziro", "description": "<p>Once upon a time The Earth was green and beautiful. It was entrusted to humans to use it wisely together with all living things.</p>\n<p>Over time humans developed advanced technology using up the Earth’s natural resources. Humans lost their connection with the Earth. Caring only for their selfish interests, they didn’t notice the injuries that they had inflicted upon the Earth.</p>\n<p>Climate change became the Earth’s scream for help. But nobody heard. Nobody until the cries become so strong that they woke up <strong>Ziro</strong>, the youngest member of the ancient order of Snowmen Earth guardians.</p>\n<p><strong>Ziro</strong> will take you on a journey of puzzle solving. You will be able to learn how you can reconnect and help Mother Earth.</p>\n<p><strong>Ziro</strong> is innovative puzzle game offering incredible game-play in various levels of difficulty. You can relax and enjoy, or try to solve a serious puzzle that will prove to be a true challenge even for the experienced puzzle solver.</p>\n<p>So, Warm Up The Brain and Cool Down The Earth!</p>\n<p><strong>Key features:</strong></p>\n<ul>\n<li>Puzzle game featuring over 300 mind-cracking levels that will take player all around world in noble quest of fighting global warming</li>\n<li>Full 3D graphics powered by Ultra Engine technology that provides stunning graphics and visual effects rarely seen in casual games</li>\n<li>A wide variety of puzzle elements that will heat up even the most prepared brains</li>\n<li>Relax tension of problem solving and boost up your mood with 40 minutes of funky music</li>\n<li>3 different game modes: Quest, Skill and Practice – a challenge for everyone’s taste</li>\n<li>36 Steam Achievements</li>\n<li>Each level Leaderboard, including total Leaderboards for each game mode</li>\n<li>Enjoy the trip around the world through beautiful environments that are unique and characteristic for each part of the globe</li>\n<li>Learn the most important facts about global warming through fun and excitement</li>\n</ul>", "metacritic": null, "released": "2009-10-07", "tba": false, "updated": "2019-08-28T22:09:53", "background_image": "https://media.rawg.io/media/screenshots/ae0/ae0323d4dddb6e74ad4568f13f74d781.jpg", "website": "http://www.ziroworld.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 65, "dropped": 1}, "playtime": 1, "achievements_count": 36, "ratings_count": 1, "suggestions_count": 334, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Kokakiki"], "genres": ["Casual", "Indie"], "publishers": ["Kalypso Media"], "esrb_rating": null}