{"id": 183083, "slug": "mini-car-race-3d", "name": "Mini Car Race 3D", "name_original": "Mini Car Race 3D", "description": "<p>Best mobile racing game on asphalt race tracks you have ever seen. Play Mini Car Race 3D with offroad mini motor car racing and city mini car race. Tons of mini cars, buses, mini trucks racing and SUV’s range (ALL UNLOCKED) for extreme racing. Select car limits or speed limit and get into the racing in with mini car race. Start the adventures of our mini racing as extreme mini car racer. Speed Mini Car Race with the best of race in limits is action and adventure racing game with incredible competition to perform mad tricks and drifting with your mini racing cars adventures. Offroad and city car racing is a thrilling and exciting supercar racing simulation game for fastest car drivers on the city streets and mountain mini car racing tracks. Get ready to enjoy the ultimate race mania is best in the category of mini car drift games that is the extreme in the other genre of amazing car race 3d car games.</p>\n<p>Stunt mini car is an all new extreme stunt car best mini car driving simulation for your mini car stunt amazing adventure. Experience the unique 3d racing adventure with this superb stunt car racing is the best mini car stunt racing game, so get ready to feel the urge for superb fun racing. Addictive car racer techniques provide you, realistic dazzling environment of offroad mini car race and extreme mini car racing. Racing in mini car driving adventure is the best mobile racing 3D games for car racing lovers. You drive a car in car race free as uphill and hill climb view through the endless racing tracks without any heavy traffic and city race environment. High speed car racer with no limits of mini car stunt race and small car racing game.</p>\n<p>Start your speed car and start Mini Car Race 3D which has all the racing enthusiasts wants to have from nobody to the most wanted. You have to show your driving skills to win this car racing tournament. Here is your car race championship with the best mini car stunt race with multiple modes. You may choose arcade mode for ultimate offroad mini car racing or time laps mode for extreme mini car racing in quick time. Mini stunt car games will give you realistic driving feeling in a real open world. Be the king of the car racing and start crazy stunt racing to fulfill your mini bus racing dream. Do thrill  extra ordinary stunts with racing tricks and huge mini car jump with muscle cars through the racing track again not challenging racers. Mini monster trucks with mini truck racing of 2018 will be the best for mini suv racing lovers.</p>\n<p>Features of Mini Car Race 3D:</p>\n<p>✪ Tons of mini cars, mini buses &amp; racing trucks for extreme offroad mini car racing.<br/>✪ All racing vehicles are unlocked for ultimate fun.<br/>✪ Powerful artificial intelligence of opponents.<br/>✪ Choose arcade or time trial for speed race.<br/>✪ Experience of racing 3D in offroad traffic rush.<br/>✪ Multiple environments with super dazzling 3D downhill mini car driving.<br/>✪ Realistic exhaust turbo sounds in mini car drift games.</p>\n<p>Mini car race track game has extreme stunt race without highway traffic and reach the finish line before time. car race new 2018 is a speed car racing game with mini car drift feature. Be the best driver of the fastest mini cars on the different tracks and game mode with the most exciting car racing. Download Mini Car Race 3D and enjoy the ultimate mini car stunt racing on asphalt racing tracks.</p>", "metacritic": null, "released": "2018-06-12", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/397/397f69c9f05b14a3357a4fbbbdeb5463.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 181, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Tap 2 Race"], "genres": ["Simulation", "Racing"], "publishers": [], "esrb_rating": null}