{"id": 183042, "slug": "swimsword", "name": "Swimsword", "name_original": "Swimsword", "description": "<p>A small game for windows made in 24 hours for the Game Maker's toolkit game jam. Press A and L to move your arms. Grab things with your body. Unless those things are moving, those things you need to defend yourself from. With your arms. Attacking and moving are the same action in this game, and the difference between striking an enemy and launching yourself into them is a fraction of a second.</p>\n<p>Q: Who made this game?<br/></p>\n<p>A: I did, using Clickteam Fusion 2.5. A friend of mine helped playtest.</p>\n<p>Q: Do you recommend Clickteam Fusion 2.5?</p>\n<p>A: Absolutely not. I was trying to see how well it works. Not very is my answer. Details are on the credits page.<br/></p>\n<p>Q: Apart from the move/attack, how did you incorporate the themes of this jam?<br/></p>\n<p>A: The enemies can gather coins for you, so you can lead them around to gather more, but as your score increases they get faster. The longer a round goes, the more coins appear. You can use the out of bounds safety net to escape. I also managed to give the credits screen the additional purpose of complaining about Clickteam Fusion 2.5</p>\n<p>Q: If you disliked it so much, why even use it?<br/></p>\n<p>A: I didn't realize just how terrible it was until I'd spend four hours setting up the movement, and at that point the sunk cost fallacy had kicked in.</p>\n<p>Q: The movement in this game is unresponsive and tiring.<br/></p>\n<p>A: Yeah, I really wanted to accurately depict what swimming is like.</p>\n<p>Q: It's too easy to go out of bounds!</p>\n<p>A: That's not a question. More seriously there's a number of finetunements I could have made to both movement, how things spawn around you, and playing field, and on any other system I might have done so, but after 24 hours of dealing with this I'm going to uninstall this prgram and pretend it doesn't exist, like most of my steam library.</p>\n<p>Q: What do the powerups do?<br/></p>\n<p>A: The bubble with a heart in it is an extra life, and the bubble with a C in it is amultiplier for your coins.</p>\n<p>Q: How did you make the sprites?</p>\n<p>A: In program spriting app. Surprisingly servicable considering the rest of the program, but it'd have to be considering you can't load in external files.<br/><br/>Q: This game lacks a proper stamina bar, is it truly a soulslike?<br/></p>\n<p>A: That's a very purist way of viewing the genre IMO. Broaden your horizons a little</p>", "metacritic": null, "released": "2017-07-15", "tba": false, "updated": "2019-08-23T11:30:56", "background_image": "https://media.rawg.io/media/screenshots/302/3025f6dbe5bc478677b57654e18190c5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 20, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["yd12k"], "genres": [], "publishers": [], "esrb_rating": null}