{"id": 183099, "slug": "kajak-games-summer-game-jam-package", "name": "Kajak Games - Summer Game Jam Package", "name_original": "Kajak Games - Summer Game Jam Package", "description": "<p>The games made during our summer themed Game Jam.</p>\n\n<p>We have six games for you to enjoy and they are the following:</p>\n<p>Coaster Climber:</p>\n<p>A mobile game(android) where you must fake your excitement on the roller coaster. Be careful though! If you fail you will be ridiculed by your peers!</p>\n<p>Laituripoika or Pierboy in english:</p>\n<p>Launch the pierboy of the pier with some help from others and go for the highscores!</p>\n<p>My Summer Cat:</p>\n<p>As unfortunate as it is, many cats are taken as summer pets during that time of the year and are abandoned by the end of the summer. This cat though reuses to give up! Guide him to safety!</p>\n<p>Pekka Pouta The Game:</p>\n<p>The Finnish weather forecaster needs to save the Finnish summer! Help him to bring sunshine to the stormy weather.<br/></p>\n<p>Summer Strawberry Jam</p>\n<p>A midsummers eve and you have to work...<br/>Customers want ice cream and you must serve them, if the going gets too tough though you can relive yourself with some alcohol(Alcohol is bad for you drink responsibly) ,but drink too much of it and its game over.</p>\n<p>Summertime Sadness</p>\n<p>Eldritch Horrors have emerged in the Summer Jam area! <br/>Fight as a group of jammers trough the horrors and save the students and Jam organisers!</p>", "metacritic": null, "released": "2017-08-30", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/7a9/7a9de7c6ae3db41c54c7105493612230.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 14, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["KajakGames"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}