{"id": 18319, "slug": "painkiller-black-edition", "name": "Painkiller: Black Edition", "name_original": "Painkiller: Black Edition", "description": "<p>Painkiller is a game about the adventures in the afterlife. The protagonist will go through Purgatory and Hell to fight the hordes of demons and eventually Lucifer himself. The game was compared to Serious Sam and Doom.</p>\n<h3>Plot</h3>\n<p>The main character is Daniel Garner, a man who died in a car crash. His soul is imprisoned in the Purgatory. Garner becomes involved in a war between Heaven and Hell. Archangel Samael promises Daniel a place in Heaven if he kills four arch-demons. A mysterious woman named Eve comes to his help, informing him about his enemies.</p>\n<h3>Gameplay</h3>\n<p>The player controls Garner from the first person view and uses firearms to defeat enemies. The monsters and levels are extremely varied. Garner goes through various historical eras and locations before eventually descending to Hell. Painkiller consists of 25 levels divided into 5 chapters. At the end of each chapter, the protagonist fights a boss. Each level has an optional objective that the player can complete and receive a powerful bonus represented by a Tarot card. Painkiller also has a multiplayer with traditional first-person shooter modes.</p>\n<h3>Edition features</h3>\n<p>The Black Edition includes the Battle Out of Hell story expansion with 10 more levels. It is set immediately after the end of the original game. Lucifer is dead, and arch-demon Alastor takes his place. Garner has to defeat Alastor and his demonic hordes. This edition also includes additional content, such as a map editor and a behind the scenes footage.</p>", "metacritic": null, "released": "2007-01-24", "tba": false, "updated": "2024-04-12T08:44:28", "background_image": "https://media.rawg.io/media/screenshots/65b/65ba49d8a3c9ec952f1762112df19dd7.jpg", "website": "http://www.painkillergame.com", "rating": 3.9, "rating_top": 4, "added_by_status": {"yet": 70, "owned": 1505, "beaten": 141, "toplay": 17, "dropped": 56, "playing": 5}, "playtime": 2, "achievements_count": 0, "ratings_count": 175, "suggestions_count": 617, "game_series_count": 0, "reviews_count": 176, "platforms": ["PC"], "developers": ["People Can Fly"], "genres": [], "publishers": ["THQ Nordic"], "esrb_rating": null}