{"id": 18323, "slug": "cadence", "name": "Cadence", "name_original": "Cadence", "description": "Unleash your creativity with the PC’s first ever music sandbox game. Learn to make your own music by drawing beautiful shapes, and then share your favourite creations with the community. Here you can rate other player’s efforts or download them as a starting point for your own songs. There’s also an hour’s worth of head scratching puzzles for you to solve in Campaign mode.A new way to make musicIf you’ve ever tried to use pro audio software you’ll know how intimidating the space shuttle like controls can be. It’s a frustration that smothers curiosity before it’s even begun. But imagine there was a simpler way, a way for anyone to make their first music within minutes? By harnessing gameplay rules and the simple act of drawing, you can use Cadence to start making music right now.Learn from othersMusic is a deep passion that can take a lifetime to master. Cadence provides several tools for you to take more control as your musical confidence increases, but one of the best ways to learn is from others. The built in community browser showcases what’s possible with Cadence, and provides the inspiration for your own creativity with an effortless one-click import feature.CampaignCadence isn’t just a music app, it’s a game as well - featuring an hour’s worth of puzzles (at present) from the award winning designer of Desktop Dungeons. The perfect way to challenge yourself and get your head around the more obscure parts of the game.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T22:09:52", "background_image": "https://media.rawg.io/media/screenshots/ebd/ebdc120bbef6453b0d1264a300588daf.jpg", "website": "http://playcadence.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 57, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Made With Monster Love"], "genres": ["Indie"], "publishers": ["Made With Monster Love"], "esrb_rating": null}