{"id": 183258, "slug": "wild-hyena-simulator-2017", "name": "Wild Hyena Simulator 2017", "name_original": "Wild Hyena Simulator 2017", "description": "<p>Dive into the life of wild hyena simulator in savanna jungle. Use your claws and teeth and attack other animals, collect meat, grow and upgrade your skills. Hyena simulator is 3D game set in wild savanna and jungle is full of wild animals. Huge and dangerous locations are waiting to be explored! Raise your own Hyena Family Simulator! Cubs need a lot of attention so you will need to feed them and play with them until they grow up.Hunt lots of enemies including Buffalo, Dromader, Elephant, Fish, Flamingo, Gazelle, Giraffe, Goat, Gorilla, Hippo, Hyena, Leopard, Lion, Lioness, Rabbit, Raccoon, Rhino, Tiger, Wolf and Zebra much more will come in this safari simulator 3d! This is the best and most fun Hyena simulator out there!<br/>In this hyena simulator game the most powerful bite in the animal kingdom to hunt down and fight your prey! Deliver the killing blow by leaping through the air and pouncing on your enemies. The massive stunning 3D world is waiting to be explored! Your hyena mate and hyena family will help you discover all kinds of surprises that are waiting for you in island and desert locations.You can't get bored in this hyena family sim! Stunning High Definition graphics will transport you to the scorching hot plains of the savanna! In this animal simulation, role playing game, and part adventure game. It will take you on an ultimate epic journey as you build your new home, build your great warrior clan, use hyena magic skills, survive against enemies that attack, clash with enemy clans, <br/>Ultimate Hyena Adventure 3D Features:<br/>•Realistic animal simulation: Hunt, eat, drink, and sleep to maintain your health and energy. Mate to start a family, and fight to protect your cubs!<br/>•Advanced hunting experience: Multiple types of attack combos including Bite, Claw, Pounce, and more!<br/>•Simple yet detailed features: Simple and easy touch based controls. <br/>•Build your pride: Gradually build your strength to defeat animals like elephants, rhinos, and other opponents.<br/>•Level up by performing quests, and evolve to increase health, attack and endurance!<br/>Hyenas look like large dogs, but they are more similar to cats like tigers and lions. Hyenas have very strong teeth and powerful jaws.</p>", "metacritic": null, "released": "2017-10-15", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/28f/28f5cec3e31d0fa06afef41477359ce1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 154, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["MadMaxGames"], "genres": [], "publishers": [], "esrb_rating": null}