{"id": 18339, "slug": "plain-sight", "name": "Plain Sight", "name_original": "Plain Sight", "description": "Plain Sight is a multiplayer arcade game about suicidal ninja robots.<br/>\t\t\t\t\t\tFly through space, leap over planetoids and destroy opponents with your trusty katana.<br/>\t\t\t\t\t\tKilling fellow robots lets you steal their tasty, tasty energy. Packed with spinach-like goodness; energy makes you bigger, stronger, faster and generally more awesome.<br/>\t\t\t\t\t\tBeing all big and badass is great, but in this game it doesn’t win you the match. It makes you a target.<br/>\t\t\t\t\t\tTo win, you have to convert your energy into points...<br/>\t\t\t\t\t\tHow do you do this? Simple. Kill yourself.<br/>\t\t\t\t\t\tPress the button and turn your happy little robot into a vicious ball of enemy-absorbing plasma. The more opponents you take out, the better.<br/>\t\t\t\t\t\tUpgrade your robot, respawn and get stuck in again...<br/> <br/> <ul><li>13 Multiplayer maps<br/> </li><li>Battle up to 20 players<br/> </li><li>5 self-destructive gameplay modes<br/> <ul class=\"bb_ul\"><li>Deathmatch<br/> </li><li>Ninja! Ninja! Ninja! Robozilla! - mini ninjas unite to bring the gargantuan Robozilla down to size!<br/> </li><li>Lighten Up - Detonate on a target area with as much energy as possible, the best detonation wins the points for that round.<br/> </li><li>Team Deathmatch / Weakest Clink - Play a standard Team Deathmatch or up the stakes by having a communal score bank.<br/> </li><li>Capture the Flag - Well, it looks more like a beacon... but the gameplay is the same.<br/> </li></ul></li><li>Level the playing field with in-game power-ups<br/> </li><li>Spend your experience points on 30 different robot upgrades<br/> </li><li>Perfect your skills in offline practice mode<br/> </li><li>Ships with dedicated server software<br/> </li></ul>", "metacritic": 76, "released": "2010-04-05", "tba": false, "updated": "2023-10-18T00:56:17", "background_image": "https://media.rawg.io/media/screenshots/218/218091e720da161881848e0e179a53c4.jpg", "website": "http://www.beatnikgames.com/project/plain-sight/", "rating": 2.45, "rating_top": 3, "added_by_status": {"yet": 19, "owned": 475, "beaten": 5, "dropped": 12}, "playtime": 1, "achievements_count": 24, "ratings_count": 22, "suggestions_count": 332, "game_series_count": 0, "reviews_count": 22, "platforms": ["PC"], "developers": ["Beatnik Games"], "genres": ["Action", "Indie"], "publishers": ["Beatnik Games"], "esrb_rating": null}