{"id": 18345, "slug": "all-zombies-must-die-scorepocalypse", "name": "All Zombies Must Die!: Scorepocalypse", "name_original": "All Zombies Must Die!: Scorepocalypse", "description": "<p>Step into the sturdy boots of McJagger and take on an army of the undead! In the standalone spin-off to All Zombies Must Die!, the only thing that really matters is your score. Build your multiplier and rack up as many kills as possible to become the best zombie-slayer in Deadhill; to that end, your mission remains the same: all zombies must die. </p>\n<p>As well infesting familiar locations such as Town Square, Shopping Mall and Surburbia, the undead have ambled their way into all new areas of Deadhill: the Military Base and Graveyard. In their bid to turn the world into a race of shuffling corpses, the zombies have stepped things up a gear for Scorepocalypse.  McJagger will have to take on three new flavours of the undead: Soldier, Necro and Ghost. Our stoic hero shouldn’t be too concerned, however, there are two new weapons to help send the shufflers packing: Mini-gun and Rocket Launcher. Your score is based on a combination of two multipliers, one of which increases as you complete quests that appear organically as you play, and the other based on how many environmental modifiers you’ve managed to apply to the undead. Use fire, shock, sonic and radiation – and the environments themselves - to your full advantage, and get the highest score possible!</p>", "metacritic": null, "released": "2012-04-19", "tba": false, "updated": "2022-09-26T22:01:21", "background_image": "https://media.rawg.io/media/screenshots/6e5/6e508939ccf43d895ece63d45de00a1b.jpg", "website": "http://www.doublesixgames.com", "rating": 2.17, "rating_top": 1, "added_by_status": {"yet": 4, "owned": 136, "beaten": 1, "toplay": 2, "dropped": 1}, "playtime": 1, "achievements_count": 16, "ratings_count": 6, "suggestions_count": 360, "game_series_count": 0, "reviews_count": 6, "platforms": ["PC"], "developers": ["Doublesix Games"], "genres": ["Action", "Indie"], "publishers": ["Doublesix Games"], "esrb_rating": null}