{"id": 183559, "slug": "sombrero-skies", "name": "Sombrero Skies", "name_original": "Sombrero Skies", "description": "<p>Sombrero Skies is part strategy game, part bullet hell shooter that was created in our first year at The University of South Wales. It was made in Gamemaker, with assets created in Adobe Photoshop.</p><p>The year is 2038, the entire world economy has collapsed, aside from that of America. Because of this, immigration into the country skyrockets to record levels. America closes it's borders and declares itself the Empire of the United States of America</p><p>The year is 2038. The world economy has collapsed, but America thrives. Immigration into america rises to record levels. America responds by closing their borders and declaring themselves the Empire of the United states of America.</p><p>The E.U.S.A. becomes a beacon of wealth. A promised land in a broken and starving world. Many devise ways to invade America but all attempts have failed.</p><p>But who better to revolutionise immigration into the E.U.S.A. than the Mexicans?</p><p>Using their rag-tag revolutionaries, they attack the border at full force.</p><p>But bandits with a cause are not their only weapon: A long forgotten device left over from the failed Mexican space program of 2029. It's up to you to wield the power of this dangerous weapon and free the world from the greedy clutches of the Empire of the United States of America.</p><p><strong>Disclaimer: </strong>In designing, we were aiming to satirise the greed and patriotism of American culture rather than offend Mexican Culture, and we liked the idea of one stereotype extreme defeating another, much more dangerous one. We were aiming to punch up and not down, but ended up punching down at least a little. Our hearts were in the right place, but it's become apparent since making Sombrero Skies that our intentions were not communicated particularly clearly, so we apologise for any missteps we made here. </p><p>We hope you enjoy.</p><p><strong>Team</strong></p><p>Peter - Mechanic and Level Designer</p><p>Jessica - Art and Level Designer</p><p>Gary - Asset and Art Designer</p><p>Zack - Mechanic and Level Designer</p>", "metacritic": null, "released": "2015-04-14", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/8a6/8a6226294f5ba04abf73c1eb59d04719.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 142, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Zack F"], "genres": ["Action"], "publishers": [], "esrb_rating": null}