{"id": 18367, "slug": "simpleplanes", "name": "SimplePlanes", "name_original": "SimplePlanes", "description": "<p>BUILD AIRPLANES<br />\nYou have the tools you&#39;ll need to bring any airplane to life. Snap parts together to build your airplane&#39;s body. Place engines to add thrust. Design and attach wings and then strap yourself into the cockpit and see how it flies.<br />\nDOWNLOAD AIRPLANES<br />\nOver 100,000 airplanes are available to download for free from SimplePlanes.com Find anything from old WW2 bombers to next generation fighters to sci-fi spacecrafts. You can upload your own airplanes and rise through the ranks from a bronze builder to a gold level builder.<br />\nDYNAMIC FLIGHT MODEL<br />\nEvery little change you make in the designer impacts how the airplane flies. Weight distribution, thrust, lift, and drag are all calculated continuously while flying. Parts can break off in spectacular fashion while flying due to over-stress or by hitting something. The fun won&#39;t stop there though. You can keep on flying even with a missing wing if you&#39;ve got the skills. CHALLENGES<br />\nClimb into the cockpit of one of your custom aircraft and see how it does in the challenges. The challenges will keep you entertained for hours. Land on aircraft carriers, escort bombers, dodge surface-to-air missiles, race through courses, and so much more. SANDBOX<br />\nUse all available parts to build airplanes with no restrictions. The sky is the limit. Literally.<br />\nMODDING<br />\nModding is fully supported so you can build your own parts and environments. Download our Unity package which includes specially designed tools to aid in designing and building mods which you can then share with your friends and the community.</p>", "metacritic": 67, "released": "2014-12-10", "tba": false, "updated": "2023-10-10T19:34:02", "background_image": "https://media.rawg.io/media/screenshots/57d/57d561294af826d0dbf8d72aeeeff4b8.jpg", "website": "http://www.simpleplanes.com", "rating": 3.03, "rating_top": 3, "added_by_status": {"yet": 50, "owned": 891, "beaten": 4, "toplay": 4, "dropped": 15, "playing": 2}, "playtime": 1, "achievements_count": 72, "ratings_count": 30, "suggestions_count": 294, "game_series_count": 0, "reviews_count": 30, "platforms": ["iOS", "PC", "macOS", "Android"], "developers": ["Jundroo"], "genres": ["Educational", "Indie"], "publishers": ["LLC", "Jundroo"], "esrb_rating": "Everyone 10+"}