{"id": 18376, "slug": "dreambreak", "name": "DreamBreak", "name_original": "DreamBreak", "description": "<strong>'This looks like the most terrible mix of differing types of gameplay. I must have it!' - RPS Commenter</strong><br/><br/>An authoritarian state pacifying the masses with propaganda. A brutal police force that shoots first then shoots some more.<br/><br/>An ordinary everyman named Eugene, dragged by coincidence and circumstance from a life of mundane menial tasks into a baffling world of sudden, inexplicable murder, hidden conspiracy and unrelentingly lethal robots with nasty sharp pincers and lasers coming out of everywhere.<br/><br/>Depicted in a distinctive Cyrillic pixel art style the cyberpunk city crackles with tech-noir intrigue and neo-digital deceptions. Using every tool at your disposal help Eugene to unpick the knot of mystery that he has become enmeshed within – your equilibrium will be rocked as you point and click a path through this briar patch of tangled meaning and unexpected quixotic quirks.<br/><br/>Will Eugene make sense of the conundrum that unfolds before him, learn who is an ally or a foe and collect lots of vinyl records for his listening pleasure? He'll race rapid hover bikes to earn sub-cultural respect, rub shoulders with high society in a post-modern nightclub, hack the brains of pursuing drone cops in thrill-packed chase sequences, strive to survive tense shootouts with merciless law enforcers and enjoy some 8-bit cowboy coin-op action in a dingy dive bar with a broken toilet.<br/><br/><ul><li>Multiple endings<br/></li><li>Unique blend of action, point and click and Russia<br/></li><li>Get fingered for murder</li></ul><br/>Soviet Bloc Edition contains DreamBreak game with good Russian stuffs like:<ul><li>Original 19 track soundtrack recorded by Egor Gritsukov (.mp3 &amp; .wav)<br/></li><li>Digital art book (.pdf)<br/></li><li>Pack of 5 Wallpapers<br/></li><li>Walk-through (yeah good luck with that!) in Russian and 'English' (.pdf)</li></ul>", "metacritic": 46, "released": "2016-07-20", "tba": false, "updated": "2022-09-30T00:49:09", "background_image": "https://media.rawg.io/media/screenshots/0f9/0f97804010f515022adbcf51a1b780fd.jpg", "website": "http://aist-studio.com/", "rating": 1.67, "rating_top": 1, "added_by_status": {"yet": 7, "owned": 177, "beaten": 4, "toplay": 1, "dropped": 2}, "playtime": 4, "achievements_count": 46, "ratings_count": 12, "suggestions_count": 309, "game_series_count": 0, "reviews_count": 12, "platforms": ["Xbox One", "PlayStation 4", "macOS", "PC"], "developers": ["Digerati Distribution", "Aist"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Digerati Distribution", "Beatshapers"], "esrb_rating": null}