{"id": 183854, "slug": "falling-blockz", "name": "Falling Blockz", "name_original": "Falling Blockz", "description": "<p>A classic arcade-style shooter game thats all about reaction time and speed!<br/>My main focus was gameplay, i hope you enjoy playing it as much as i do!</p>\r\nControls ::\r\n<p>Move (Left and Right) - A &amp; D // Or Left Arrow &amp; Right Arrow<br/>Fire - LMB // Or W // Or Up Arrow<br/>And thats pretty much it controls-wise! for any info about the game, read below.</p>\r\nInfo/How to play ::\r\n<p>Its all about reaction time, you gotta be quick because those blocks rain down quick!<br/>A basic game where you shoot falling blocks, but its not that easy.<br/><strong>All music used is royalty-free (free to use, if you don't know), I do not take credit for the great tracks.</strong></p>\n<p>Defend yourself from the falling blocks! don't let them hit the ground! If they do you will lose a life! Your goal is to NOT DIE, and get the highest score you can! the game goes on for a bit, then a boss comes out to play! Don't let the boss win!<br/>Shoot Powerups dropped by the blocks to activate them, they will help you live, and help you get a good score! but beware! the Powerups are both good, and bad, depending on which one you got, the more blocks that will come raining down, it makes it a bit more difficult! And once the boss spawns, might wanna be quick!!<br/>he spawns enemies, and shoots at you! dont let the enemies hit the ground as usual, and dont let his bullets hit the player itself! Good luck and have fun!</p>\n<p>This game has a highscore system with leaderboards for each game mode that has a high score! Upgrades, Achievements, and more!</p>", "metacritic": null, "released": "2017-09-20", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/eef/eef3589ac4f3c624c2ade89ff348b91a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 59, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Steel_Dev"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}