{"id": 184061, "slug": "rainbowkappa789-inc-presents-impact", "name": "RainbowKappa789 Inc Presents... IMPACT!", "name_original": "RainbowKappa789 Inc Presents... IMPACT!", "description": "<p>RainbowKappa789 Inc. Presents IMPACT! is A Party Game Created with Ren'py! It takes fictional situations and asks you for your response to them. People then go to their strawpoll That Our Game Provides The Template for. The Situations are seperated into Rounds that are based on Themes.</p><p>Game History - Our Game Originated from RainbowKappa789 thinking onto what to do After the completion of School Simulator X, He was mainly thinking of a More Non-Story Feel to it but Once he was searching Online , He didn't want to pay or download for Game Engines that he didn't even understand. He went to the drawing boards and Thought of  a Party Game, he thought it could work like Mario Party and Wii Party, so IMPACT! was born! It was going to be named under School Simulator X : Party Mode but was scrapped due to it not making the concept work properly. The School Simulator X Party Concept was Scrapped but not the actual game. It was Changed then to IMPACT! because The Goal of the Game was to Make the Biggest IMPACT on The Audience. He thought of implementing A Voting System but currently there is no known support for such things,This was the same idea with the Timer Feature as well. The Voting and Timer System We have now might changed but for now we are happy with it. </p><p>Other Platforms? - Yes, We're planning to release this on Steam,Google Play,and IndieDB soon.</p><p>Update 3/30/2016 - Demo Released on IndieDB ,and Officially planned for Steam Greenlight! Google Play Release - N/A</p><p>Update 4/16/2016 - Steam,and Google Play Release Date Delayed and Open Beta and Paid Beta should be released by May 16th 2016!<br/></p><p>Update 4/29/2016 - OPEN BETA RELEASED! - Paid Beta Is In Development and should be Released soon! (OPEN BETA has 2 rounds with 15 Questions total,PAID BETA has 3 rounds with 25 Questions,and Final is planned to have 30 Questions!)</p><p>Update 5/31/2016 - Project was on hold for a while but should resume starting today. We also decided to release Tournament Mode as a Seperate Game Completely so we can focus on them each seperately! </p><p>Update 1/8/2017 - Long time no see! Thought you wouldn't see me posting here any more, well you're wrong! XD I know this game was on hold for half a year but I am planning to make this still in the forseeable future! On and the Paid Beta won't prob. be a thing any more, just because it's pointless by now. Will Update you about this in the upcoming days. :P</p>", "metacritic": null, "released": "2016-03-30", "tba": false, "updated": "2019-08-23T12:12:58", "background_image": "https://media.rawg.io/media/screenshots/86f/86f73b3460392a752a6f3160b38284a7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 14, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["RainbowKappaGames"], "genres": [], "publishers": [], "esrb_rating": null}