{"id": 18408, "slug": "vernons-legacy", "name": "Vernon's Legacy", "name_original": "Vernon's Legacy", "description": "Vernon's Legacy is an horror adventure with an enigmatic story that takes place nearly a century ago. <br/><br/>You learned of the sudden death of your uncle two days ago. When you reach the estate of your deceased relative, you find it deserted. Why is Alois the butler not here to receive you? <br/>Something is not right. <br/><br/>You explore the rooms of Dunkenhof Manor in the first person view. <br/>Do not expect this to be a hitch-free stroll—there are puzzles to solve, secrets to unravel, and hidden doors to open. <br/>You can add items to your inventory and use them to interact with your environment. <br/><br/>You keep coming across the effects of the former inhabitants of the place. Their letters and notes reveal to you the events of the past few years. <br/><br/>When you finally enter the centuries-old vaults beneath the house, you realize that a force beyond any imagination lurks here and your life is in mortal danger.<strong>Features</strong><br/><ul><li>Story inspired by real events from the World War I era.<br/></li><li>Authentic art-nouveau environment.<br/></li><li>Sophisticated puzzles with a variety of approaches.<br/></li><li>Immersive graphics based on the newest Unreal technology.<br/></li><li>Chilling horror atmosphere.<br/></li><li>Horror survival elements.</li></ul>", "metacritic": null, "released": "2016-09-23", "tba": false, "updated": "2023-05-02T23:06:38", "background_image": "https://media.rawg.io/media/screenshots/59d/59da370f8994dfbc518fc69588786ba9.jpg", "website": "http://vlgame.triplebrick.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 61, "beaten": 1}, "playtime": 3, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 390, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC"], "developers": ["TripleBrick"], "genres": ["Adventure", "Indie"], "publishers": ["TripleBrick"], "esrb_rating": null}