{"id": 184113, "slug": "bike-traffic-racer-2018-moto-fever", "name": "Bike Traffic Racer 2018: Moto Fever", "name_original": "Bike Traffic Racer 2018: Moto Fever", "description": "<p>Do you like endless bike racing games? Then this Bike Traffic Racer 2018: Moto Fever is for you. Join the endless bike race on highway bike riding in the free bike games. Asphalt highway tracks with ultimate speed of moto in bike rider game 2018. Start this bike racing and become a super rider 2018. Choose your favorite motorcycle or super bike and heavy bike on highway extreme fast rider between the fast going traffic dodging. Go on different modes highways and race as fast as you can to become the best new moto ultimate rider in the world! Race the traffic and complete the challenges to get real among the competition. Use nitro for extreme speed in endless bike racing, so join this moto fever and start racing in the traffic and become a best racer of 2018 with traffic bike driving in bike racing games 2018.<br/><br/>It’s time to Jump on your racing bike and ride in the endless busy roads and highways! Make near traffic misses and enjoy different locations for endless riding like suburbs asphalt highways, snow and desert. Enjoy the day and night cycle during endless motorcycle racing and become a super racer rider 2018. Bike traffic racer 2018 has realistic highway traffic and moto ultimate rider will enjoy the fun of fast bike driving. You are a speed rider and going to rock this endless bike driving as endless bike racer with your moto on your nitro speed in bike racing games 2018. Smooth and realistic endless motorcycle handling fever racing make this endless traffic race game a highway bike riding free bike games with realistic racing and bike driving physics. <br/><br/>Let’s start extreme fast moto driving as racing rider and become a no 1 motorcycle driver. Ride your motorbike, drive on endless busy roads and highways, escape the motor bike from busy highway traffic on slippery snow roads and complete the adventure as professional racer in bike racing simulation game. Improve your motorcycle performance by upgrading your motorcycle components and selection of more heavy bikes and moto. If you want to be a motorcycle driver, then join the endless bike race game quickly, it will provide you with moto driving with high speed nitro motorcycle riding experience. <br/><br/>Features in Bike Traffic Racer 2018: Moto Fever:<br/><br/>✓ Smooth handling of motor bike for endless racing on highway.<br/>✓ Multiple Detailed environments like desert, snow, city &amp; suburbs asphalt highways.<br/>✓ Realistic day &amp; night cycle during endless traffic bike riding.<br/>✓ Variety of heavy bikes, dirt bikes &amp; double silencer moto.<br/>✓ 3D graphics &amp; HD gameplay in endless bike racing games.<br/>✓ Accurate physics based bike rider simulation for endless bike driving.<br/>✓ Use nitro booster &amp; dodge quickly heavy city traffic having car, buses &amp; trucks.<br/><br/>Ride your bike in the endless highway roads overtaking the congested traffic and try not to crash. Tune your moto and accelerate your way to victory. Become the fastest moto 3d rider on the streets. Enjoy the multiple modes like endless, time trail and free ride option to explore the mega city. This highway bike riding with the free bike games is a milestone in the genre of endless race and bike driving and bike racing on traffic roads. Download Bike Traffic Racer 2018: Moto Fever and have moto driving fun with super-fast bike race fever.</p>", "metacritic": null, "released": "2018-05-14", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/56c/56cdb707531ab69814ad9f9f3995ec0c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 75, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Tap 2 Race"], "genres": ["Simulation", "Racing"], "publishers": [], "esrb_rating": null}