{"id": 184198, "slug": "super-rps-hyper-yomi-fighting-action-game", "name": "Super RPS Hyper Yomi Fighting Action Game", "name_original": "Super RPS Hyper Yomi Fighting Action Game", "description": "<p>Super RPS Hyper Yomi Fighting Action Game is rock paper scissors but with extra steps involved. Like all fighting games.<br/></p>\n<p>The only playable character in the demo is Ken and the option of vs CPU and vs Player<br/></p>\n<p><strong>Gameplay mechanics</strong></p>\n<p><em><strong>Offense</strong></em>\n</p>\n<p>Every 60 frames the heartbeat meter in the center of the screen ticks, this is the only time when one player can attack another. You must also take into account of startup frames of attacking/swapping hands to help get a better feel for the timing.\r\n</p>\n<p>Certain hands deal more damage than others, however if you attack with a losing hand, you will take <strong>Counter Hit </strong>damage, which doubles the damage dealt to you.</p>\n<p>If two players attack at the same time with the same hand  a <strong>Clash</strong> will occur and cause the heartbeat meter to skip a beat, instantly recovering both players to attack much sooner than normal. Both players also gain a lot of meter upon a clash.\r\n</p>\n<p>Attacking at any other time other than a heartbeat will result in <strong>whiffing, </strong>this will still result in meter gain.\r\n</p>\n<p>The meter bar on the bottom of the screen will glow yellow when it is full, it can be a powerful option, but you are still capable of <strong>whiffing </strong>if you miss a beat when using it. There are plans for other uses for meter later.<br/></p>\n<p><strong><em>Defense\r\n</em></strong></p>\n<p>If you choose to not attack during a heartbeat, then your character will automatically block. The block can be broken by a winning hand, but against anything else, damage will be minimized. Blocking an attack builds more meter than getting hurt, but less meter than landing an attack.<br/></p>\n\n<p>Also Rock beats Scissors, Scissors beats Paper, and Paper beats Rock. In case you are not aware.<br/></p>\n<p><strong>There are still a lot of missing assets in this demo, including backgrounds, music, sound effects and textures. </strong><br/></p>\n\n<p><strong>Player 1 Controls</strong></p>\n<p>A - Rock</p>\n<p>S  -  Paper<br/></p>\n<p>D - Scissor</p>\n<p>Z - Attack</p>\n<p>X - Super</p>\n<p>U - Up</p>\n<p>H - Left<br/></p>\n<p>J - Down</p>\n<p>K - Right</p>\n\n<p><strong>Player 2 Controls</strong></p>\n<p>Numpad 4 - Rock</p>\n<p>Numpad  5  -  Paper\r\n</p>\n<p>Numpad 6 - Scissor</p>\n<p>Numpad 1  - Attack</p>\n<p>Numpad 2 - Super</p>\n<p>Up Arrow - Up</p>\n<p>Left Arrow - Left\r\n</p>\n<p>Down Arrow- Down</p>\n<p>Right Arrow- Right</p>", "metacritic": null, "released": "2018-07-09", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/0a4/0a4009a96b5883bc48f6eff13a717ebd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 16, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["minoue"], "genres": ["Educational", "Fighting"], "publishers": [], "esrb_rating": null}