{"id": 18425, "slug": "rock-boshers-dx-directors-cut-2", "name": "Rock Boshers DX: Directors Cut", "name_original": "Rock Boshers DX: Directors Cut", "description": "Get ready to take a trip back to the 80s, the 1880s!<br/>Help young Queen Victoria fight her way across Mars and attempt to escape home in this exceedingly retro arcade adventure!<br/> Created to look, feel and sound like an 8-bit styled videogame from the 1980s - Rock Boshers DX: Director’s Cut mixes top down and side on 8-way directional shooting action.<br/><br/>See amazing sights as you journey across Mars. Prepare to bosh rocks! - with only the occasional break for tea and scones.<br/><br/>RBDX is a 2D pixel drawn arcade action game, created as if made on an 8bit hardware (choose from either NES or ZX Spectrum visuals), but modernised with widescreen formatting, HD rendering and of course - no colour clash!<br/><br/>Authentic 8bit loading sounds and borders art!<br/>Soldiers, zombies, giant bugs, tanks and more all try to block your progress.<br/>Leaderboards to compete on and achievements to obtain.<br/>Weapons to collect to help you escape the levels, such as Coal Rockets and Steam Lasers.<br/>Hidden snacks to collect to unlock bonus arcade games.<br/>4k and above rendering on PCs with the correct hardware/display.<br/><br/><br/><br/>Yes you can collect snacks hidden throughout the levels to unlock bonus arcade games such as:<br/><br/>- sees you chasing down a giant lump of Cheddar.<br/><br/>- is a mini spinoff from the DX version, where you must protect a milk pipeline under the sea.<br/><br/>- places you in the shadow of some ancient Martian pyramid as you dash to collect gems.<br/><br/>- lets you take to the stars in your very own space ship.<br/><br/>HISTORICAL ACCURACY.<br/>Which other retro action game which lets you play as Queen Victoria, through a small chunk of 100% accurate history from an alternate universe? :D<br/>You even get to meet Charles Darwin!<br/>", "metacritic": null, "released": "2014-12-10", "tba": false, "updated": "2022-09-29T23:17:35", "background_image": "https://media.rawg.io/media/screenshots/c99/c99293de254282d5f7aec085a4f4646a.jpg", "website": "http://tikipod.com/rockboshersdx/", "rating": 2.83, "rating_top": 3, "added_by_status": {"yet": 1, "owned": 56, "beaten": 2, "toplay": 3, "dropped": 1}, "playtime": 4, "achievements_count": 52, "ratings_count": 6, "suggestions_count": 358, "game_series_count": 0, "reviews_count": 6, "platforms": ["PlayStation 4", "PS Vita", "Nintendo Switch", "PC", "Linux", "macOS"], "developers": ["Tikipod"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Tikipod"], "esrb_rating": null}