{"id": 184216, "slug": "thai-alphabet-game-f", "name": "Thai Alphabet Game F (itch)", "name_original": "Thai Alphabet Game F (itch)", "description": "<p><strong>Enjoyable ways to learn Thai alphabets!</strong></p><p>The best way to start learning a language is by grasping the language's basics. Similarly, Thai Alphabet Game F guides you through the recognition, writing, definition, and pronunciation of all Thai consonants. No matter how less your knowledge in The Thai language is, you will find it easy to learn and master the 44 consonants and 10 numbers while identifying standard letters by listening to their pronunciations.</p><p>Learning Thai language is not boring anymore since you are going to learn by playing games with Thai alphabets and numbers while listening to cheerful sound and music to encourage your learning.</p><p><strong>Features included in this app:</strong></p><ul><li>Alphabet List Quick Reference: Don't know any Thai alphabets before? No problem..just read the alphabet list and you're good to go.</li><li>Learn how to write Thai alphabets by tracing your finger along the outline. Don't worry if you don't know where to start, it has a tracing hint. Once completed, you will hear how to pronounce along with a picture showing its meaning. It also has English words showing how pronounce.</li><li>Pairing the alphabets with images with 5 mini games will help you quickly remember meaning of each alphabet.</li><li>Learning by driving a car in this game (..of course) and show off your trophy</li><li>Game Leaderboard - Compete with others all over the world</li></ul><em>Download and enjoy playing now!</em>", "metacritic": null, "released": "2016-12-26", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/062/062d9d229b6135bc34f70d387b2eb81c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 53, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ake Apps"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}