{"id": 184414, "slug": "shadows-of-the-delta", "name": "Shadows of the Delta", "name_original": "Shadows of the Delta", "description": "<p>NOTE: Chrome has been having difficulties running this game recently.  Switch to an alternative browser like Safari or Firefox to play!</p><p>Play as two prisoners and escape the notorious Clay County Prison! The guards here are quite smart, so plan your moves and move quickly. Use switches to open and close doors. You can also block the guards with doors. Remember, teamwork is important!<br/></p><p>Player One: Use the Arrow Keys to move and Right Shift as your action button!</p><p>Player Two: Use W, A, S, D to move and use Spacebar as your action button!</p><p>Development Story:</p><p>When we were first assigned to work together on this project, every member of the group said which types of games they liked most. Since many of the types of games that we particurally enjoyed were outside of the scope of this project (RPG, Street Fighter style brawler), we decided that we wanted to make a stealth game even though none of us were huge stealth players. We then took five minutes and brainstormed individually to come up with concepts for a stealth game. None of these intial ideas really grabbed us, but when we mixed some of them together, we came up with a concept that most of us were excited about: one player could only see and one player could only hear. This concept was very similar to Marco Polo. We were relying on Unity's binaural technology to execute this concept, so when it turned out to be substandard, we had to scrap the concept and start again.</p><p>At this point, the team came up with a concept for a stealth-music game: players would have to sneak through a space to collect musical notes in the correct order. This concept seemed to be too complicated for us to execute in the limited time that we had, so we boiled it down to its basic \"sneak around guards\" mechanic. We then took Robert's suggestion and decided on the two core mechanics of our game. The core mechanics are Guards and Doors/Keys. From there, we developed the Mississippi Delta prison escape theme and the art and music to match, and began building levels and refining systems. Once we began playtesting, we discovered that our game had major puzzle elements, so we ran with it! From there, all that was left was polish.</p>", "metacritic": null, "released": "2016-08-16", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/bb2/bb247d8db5b71d4f2ad712d1141f34ad.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 18, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Web"], "developers": ["mguimaraes42"], "genres": [], "publishers": [], "esrb_rating": null}