{"id": 184406, "slug": "untitled-itch-grimrunner", "name": "Untitled (itch) (GrimRunner)", "name_original": "Untitled (itch) (GrimRunner)", "description": "<p>Le but du jeu est de retrouver la pièce cachée sous une grille. Il y a un nombre limité de coup, et une aide colorimétrique du rouge au vert qui indique si la pièce est proche.</p>\n<p>- Pseudo Gamecodeur : Grim </p>\n<p>- Elève Premium de Gamecodeur :  depuis le 22/10/2017 (1 mois)</p>\n<p>- Langage et Framework utilisé : Lua et Love2d</p>\n<p>- Code et graphismes par Grim, son du Gamecodeur Pack</p>\n<p>- Utilisation de librairies et codes externes : Non</p>\n<p>- Temps passé : Commencé le 17/11/17,  au moins 10 heures.</p>\n<p>- Comment as-tu (ou pas) abordé la contrainte du thème : </p>\n<p>Étant en train de suivre le tuto sur le Tetris, je suis juste partie sur une grille  comme base pour bien travailler le sujet sans vraiment savoir ou ça allais me mener. Je n'ai pas été gêné sur le fait de ne pas utiliser de textures externes.</p>\n<p>- Petit postmortem :</p>\n<p>Ma toute première Jam, je ne voulais pas la faire parce que je pars en voyage et que je suis en plein préparatifs, mais comme j'allais aussi louper la prochaine je me suis dégagé du temps et je suis heureux de l'avoir fait.</p>\n<p>J'en ai chié au début, pas vraiment d'idées, le code était un amas d'expérimentations, je voulais faire des trucs qui ne sont pas de mon niveau et sur le coup j'ai eu l'impression de perdre mon temps<br/>Et puis j'ai eu cette idée de gameplay, j'ai pris quelques notes, recommencé le code de zéro et tout à été plus facile. Et même avec quelques bugs j'ai pu arriver à ce que je voulais.</p>\n<p>Ce qui en est ressortit, il faut que j'apprenne à être organisé, passer peut être plus de temps à noter les idées avant de commencer à coder. </p>\n<p>Savoir m'arrêter quand je bute sur quelque chose et reprendre un peu plus tard. J'ai passé beaucoup de temps à m'acharner à chercher des bugs alors qu'après une bonne nuit de sommeil je me rendais compte que ce n'était vraiment rien.</p><p>Et par dessus tout, une grande satisfaction au moment de lancer mon code et de voir que tout fonctionne, ou presque :)</p>", "metacritic": null, "released": "2017-11-20", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/38a/38a6eeb5c107921fe2c95d6a924d4fc8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["GrimRunner"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}