{"id": 184476, "slug": "ar-tanks", "name": "AR Tanks", "name_original": "AR Tanks", "description": "Fast, fun and intense battles with three unique game modes - Campaign, Survival and Local Multiplayer!<br/><br/>Battle your way through an exciting campaign crossing four different worlds. Fight off waves of enemies in Survival mode to level up your tank and unlock new parts to equip. <br/><br/>It's super easy to setup and play with up to 4 friends in the same space - show off your latest armour, weapons, perks and accessories as you fight on procedurally generated maps!<br/><br/>The game is constantly changing and kept exciting - enemies get smarter and tougher as you level up, and during matches there are airdrops of explosives, health kits and more!<br/><br/>IMPORTANT: AR Tanks is an Augmented Reality game which means you play through the game through the device's camera on real surfaces (such as a floor or table).<br/><br/>The game utilises ARKit, Multipeer Connectivity, Haptic Feedback and Game Center to really take advantage of iOS.<br/><br/>Features:<br/>- Procedurally generated maps in Local Multiplayer &amp; Survival game modes<br/>- Battle against friends in Versus mode or work together in the Co-op Survival Mode!<br/>- Over 20,000 tank combinations to choose from<br/>- Play against friends in the same space <br/>- Campaign featuring 40 levels ( and more to come! )<br/>- Play on a tiny table, or scale it up to play outside!<br/>- AR generated table allows you to play anywhere<br/>- Randomly generated challenges to keep gameplay fresh and exciting<br/><br/>New levels, tanks and game modes will be included in future updates!", "metacritic": null, "released": "2018-07-08", "tba": false, "updated": "2019-08-05T07:03:53", "background_image": "https://media.rawg.io/media/screenshots/d56/d56abad068275955e54f2730d7583835.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 4, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "Android"], "developers": ["syst3m_ERROR", "Joseph Grainger"], "genres": ["Action", "Strategy"], "publishers": ["Joseph Grainger"], "esrb_rating": "Everyone 10+"}