{"id": 18458, "slug": "log-drive-runner", "name": "Log Drive Runner", "name_original": "Log Drive Runner", "description": "<strong>Log Drive Runner - a both relaxing and super-hectic game, a new variant of the endless runner genre, based on the log flume in Notodden, Norway.</strong><br/><br/>Run as far as you can, get your score on the leaderboards, beat your friends!<br/><br/>A small, skill based short game that is perfect to play in the bed before going to sleep.<br/><br/>With leaderboards: global hiscore and friends hiscore.<br/><br/>Can you beat your own record?<br/><br/>Can you run further than your friends?<br/><br/>Navigation<br/>Use arrow keys or wasd to control the player, or use your controller. <br/>Partial Controller support is enabled, you can use the controller for everything but the resolution menu, so you can also use the controller for changing music, enabling mutant hats, changing hats and so on.<br/><br/>Menu<br/>To get to the menu while playing, press ESC.<br/><br/>Hats<br/>Use left Alt-key to enable hats, use x to choose another hat (or use the mouse).<br/><br/>Mutant-hats: after enabling hats, you can enable MutantHats by pressing the M's under the Hat picture (or press M to enable both M's)<br/><br/>Music<br/>Choose music styles with the mouse, or use keys 1,2,3,4.<br/>All music is created and performed by Proud Camel Games own Njal Frode Lie.<br/><br/>In-game picture gallery<br/>Press the N-key (or use the mouse and press the 'N'), to enable the in-game picture gallery, with pictures from the Notodden area, photographed by ProudCamelGames own Siri Camilla Torset.<br/>After crashing, to start without having to use the mouse, press the space bar.<br/><br/>Quality settings<br/>The default quality level is 4.<br/>6 is the highest.<br/>If the game runs smoothly on the default setting, it might also run smoothly on a better quality setting.<br/>Choose quality menu from settings, and 'more'.<br/>If the game doesn't run smoothly, you can select a lower quality level from the menu.<br/><br/>Can be played on older machines in lower resolution and quality, for high quality in high resolution we recommend a modern gamer graphics card, and a modern CPU.<br/><br/>Other<br/>The first 600 meters are the same each time, but after that it goes faster and faster, obstacles are never in the same places and you have to really sharpen your reflexes not to crash.<br/><br/>Notodden has one of Northern Europe's longest timber flumes, 4193 meters long - which now has UNESCO World Heritage status - Woot-Woot!<br/><br/>This deserves a game, we thought, so we made it!<br/>Anyone who has grown up in our small industrial town has a relationship with this log flume, - either that one remembers when it was used for timber freight, or has walked or run all of the 4193 meters up and down, rode, skated or skateboarded - totally illegal, of course - after the operation was closed down. Industrial Rock!<br/><br/>In LogDriveRunner you can run as fast as the wind or lightning in the timber flume - in lifelike and organic, but also surreal surroundings - legally! The game starts with quietly hypnotic guitar music and is becoming more hectic, the more meters you put behind you. If you crash, you need to restart, - here there are no floating coins that allow you to start from where you crashed - no possibility to buy further progress, you need skills!", "metacritic": null, "released": "2016-09-08", "tba": false, "updated": "2019-08-28T22:09:47", "background_image": "https://media.rawg.io/media/screenshots/ee8/ee8152bbbb9778b3b498dc7de6030a37.jpg", "website": "http://steamcommunity.com/app/464040/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 14}, "playtime": 4, "achievements_count": 9, "ratings_count": 0, "suggestions_count": 347, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Proud Camel Games"], "genres": ["Casual", "Indie"], "publishers": ["Proud Camel Games"], "esrb_rating": null}