{"id": 184677, "slug": "finding-hope-board-game-adventure", "name": "Finding Hope Board Game Adventure", "name_original": "Finding Hope Board Game Adventure", "description": "<p><strong>Finding Hope Board Game Adventure</strong></p><p>Faith has lost Hope, and Hope and been captured by Fear.  Join MJ as he is sets out on a quest to find Hope.  Initially he adventures by himself.  Once he has acquired Joy's Prayer, she can join the team, when he gets back home.  Fear's friends include: Anxiety, Doubt, Worry, Nightmares, Hate, Revenge, Faithlessness, and Storms. When fifty of Fear's friend are chased away, and MJ has a Courage of 100 or more, Faith can also join the team.  </p><p>The game may have both an RPG and a Board Game feeling, as the map is set on an actual game board.  The player rolls a four-sided die, to determine where MJ will move next.  The primary Scripture for this game is Matthew 11:23.</p><p>Truly, I tell you, if anyone says to this mountain, </p><p>'Go, throw yourself into the sea,' and does not doubt </p><p>in their heart but believes that what they say will </p><p>happen, it will be done for them. (Jesus Speaking)</p><p>Remember to press [Esc] to get out of Jennie's Prayers List, if you decide not to purchase nor upgrade.</p><p><strong>WINDOWS downloadable version found below these details. :)</strong></p><p>Note:  If I receive requests for downloadable MacOS version, I may add that option. :)  I can also make customized versions of this to cater to birthday party invitations, baby gender announcements, present revealed when quest is completed, tourism, new church member introduction to staff, team training exercises, etc.  Contact me for further details, as these would be commissioned works.</p><p><strong>Available Games:</strong></p><p>A Ball People Winterfest </p><p><strong>Ballden Facing Bullies Board Game Adventure</strong> </p><p><strong>Finding Hope Board Game Adventure</strong> </p><p><strong>Fun Vision Park Board Game</strong> </p>", "metacritic": null, "released": "2016-12-10", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/9b8/9b85cf80d3e3e691e99e976f4b6e54d4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 73, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Web"], "developers": ["MinisterJay"], "genres": [], "publishers": [], "esrb_rating": null}