{"id": 1847, "slug": "pwn-combat-hacking", "name": "PWN: Combat Hacking", "name_original": "PWN: Combat Hacking", "description": "PWN is a multiplayer strategy game about competitive computer hacking. Battle your rivals to take over networks using viruses, trojans, and backdoors like you were in a retro-futuristic hacker movie.<br/><br/>&amp;quot;Smart, highly addictive, and competitive strategy/puzzle action&amp;quot; - 148 Apps (Editor&amp;#39;s Choice)<br/><br/>&amp;quot;The experience is simply exquisite. Such tension, such drama...it&amp;#39;s just perfect...PWN: Combat Hacking is what I want hacking to be.&amp;quot; - Kotaku<br/><br/>&amp;quot;A ludicrously chaotic, quick-fire take on the real-time strategy genre, delivering plentiful amounts of rich, strategically satisfying tactical action&amp;quot; - PocketGamer (Silver Award)<br/><br/>In this fast real-time strategy game you face off against other elite hackers within a 3D cyberspace and blast each other off the grid by tactical use of computer viruses, trojans, and spikes. Defend your own nodes with encryption, firewalls, and scanners. And watch out for hidden traps like backdoors that can decimate your network from within. Become the notorious computer hacker you always wanted to be.<br/><br/>- Real-time, player vs. player tactical hacking battles<br/>- Eight hacker characters to choose from, each with a special skill proficiency<br/>- Infiltrate maze-like three-dimensional network grids<br/>- 10+ hours of single-player campaigns where you take out other hackers, learn and upgrade various hacking skills, and finally compete in a huge tournament<br/>- Online and Local multiplayer<br/>- Now with cross-platform multiplayer - download in the Mac App Store and play against friends on their phone!<br/>- iCloud support<br/>- Widescreen support<br/>- 90 different maps to battle on<br/>- No actual coding/hacking knowledge required!", "metacritic": null, "released": "2013-03-14", "tba": false, "updated": "2019-10-22T14:27:52", "background_image": "https://media.rawg.io/media/screenshots/a40/a40789775647071b74a6a1cffdca8bbe.jpeg", "website": "http://www.82apps.com/pwn", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 107, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["82"], "genres": ["Action", "Strategy"], "publishers": ["Erik Asmussen"], "esrb_rating": "Everyone 10+"}