{"id": 18493, "slug": "ancient-planet", "name": "Ancient Planet", "name_original": "Ancient Planet", "description": "The stronghold of an ancient civilization has been invaded by hordes of alien raiders.<br/>\r\nUse powerful technologies of the Ancient and repel the attack of the enemy's armies!<br/>\n<br/>\r\nFeatures:<br/>\r\n- Classic Tower Defense (TD) for those who are fond of good old games;<br/>\r\n- Building towers in any free area on the field;<br/>\r\n- 40 unique levels;<br/>\r\n- Plenty of diverse enemies with their own features;<br/>\r\n- The game offers upgrading towers, as well as everything else. New improvements allow selecting exceptional strategies for each level. Even the base can be upgraded!<br/>\r\n- Improvements can be reset and distributed at will, it is free and you get all your emeralds back;<br/>\r\n- The storyline is based on recollections of the veterans of intergalactic wars;<br/>\r\n- Our artist visited the ancient planet himself in order to recreate its image in the game;<br/>\r\n- Character voices sound identical to real ones; <br/>\r\n- The game was developed upon the order of the High Council of the Intelligent Civilizations of the Galaxy;<br/>\r\n- There should have been one more feature here, but it failed censorship, so we replaced it with an advert: “Galactic energy drink “Improviser” with a rocket fuel extract will reduce fatigue and shorten your life by a couple of years. “Improviser” – for a vibrant and fast life!”<br/>\n<br/>\r\nWe love strategies, we did our best to create the game, and it turned out quite decent.<br/>\r\nIf you like it, do not forget to rate and leave a review; if you do not, you can blame us in comments, we accept any criticism.<br/>\r\nIf things are bad and some help is needed, you can contact the technical support.", "metacritic": null, "released": "2015-02-03", "tba": false, "updated": "2024-01-19T17:09:47", "background_image": "https://media.rawg.io/media/screenshots/80c/80caf21ca140df322df070cd3ba8aba4.jpg", "website": "https://www.facebook.com/AncientPlanetTD", "rating": 3.0, "rating_top": 4, "added_by_status": {"yet": 16, "owned": 306, "beaten": 3, "toplay": 1, "dropped": 4}, "playtime": 4, "achievements_count": 47, "ratings_count": 14, "suggestions_count": 284, "game_series_count": 0, "reviews_count": 15, "platforms": ["macOS", "PC"], "developers": ["Moonlight Mouse"], "genres": ["Strategy", "Casual", "Indie"], "publishers": ["Moonlight Mouse"], "esrb_rating": null}