{"id": 185283, "slug": "master-the-space", "name": "Master The Space", "name_original": "Master The Space", "description": "Ludum Dare:\r\n<p>This is JDA's submission to the ludum dare 42 game jam. It is our first submission to the jam. The theme of the jam is \"running out of space\".</p>\r\nStory:\r\n<p>After the universe has collapsed, a big black hole arose. Planets were shattered into small pieces and are attracted by the black hole. If the pieces won't get assembled to planets by a space master, they will be lost. Your task is to assemble the pieces back together, before the black hole can strike.</p>\r\nGame objective:\r\n<p>You have to put pieces from the same planet (same texture) together. If you put together 5 pieces (20 tiles) from the same planet and they touch each other the planet is assembled and disappears. When the planet is assembled, you get a point for every tile that touches the tile of another piece, so fit them together without creating any holes.</p>\n<p>The black hole strikes if you didn't place a piece fast enough. When it strikes, it takes away your space and every piece that was placed on that space. So keep in mind to place your pieces fast enough.<br/></p>\r\nControls:\r\n<p>Moving the active block: wasd or arrow keys<br/>Rotating the active block: q (left), e (right)<br/>Lock the active block to its current place: space</p>\n<p>Play sound: u<br/>Pause sound: i<br/>Volume: o (up), p (down)<br/>Next track: j<br/></p>\r\nScreenshots:\r\nStart Screen:<br/>\n<br/><br/>In game:<br/><br/><br/>In game after the black hole struck three times:<br/><br/>", "metacritic": null, "released": "2018-08-13", "tba": false, "updated": "2019-08-28T23:21:08", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["nenasdev"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}