{"id": 18525, "slug": "18-wheels-of-steel-convoy", "name": "18 Wheels of Steel: Convoy", "name_original": "18 Wheels of Steel: Convoy", "description": "<p>Sometimes 18 Wheels Just Ain&#39;t Enough!<br />\nTake the wheel of a fast paced, high intensity trucking business. Start as a one man show, bidding on jobs, then build your fleet into an unstoppable convoy and deliver the goods. Grow your business and your fleet, but beware - your reputation is everything.<br />\n10-4 Good Buddy. Bid on lucrative larger jobs and captain the convoys necessary to pull them off. But watch your back - the police are always looking to take a mighty convoy down!<br />\nHave fun playing the fourth truck sim game in the 18 Wheels of Steel series!FeaturesLock and load the big runs. There&#39;s power in numbers and your convoy&#39;s gonna rule the roadways.<br />\nFeel the rumble of the road beneath the wheels of 35+ rigs and trailers.<br />\nHaul asphalt through 40+ cities coast to coast and Canada.<br />\nBid on 45+ cargo types and prove you can handle the big jobs.<br />\nBuild your Convoy One Rig at a Time. Build your trucking empire from a single hauler to a vast network of big rigs criss-crossing North America.<br />\nTake this Job and Love It! Comb the cargo docks, gas stations, highway motels and other meeting points to locate jobs and get yourself on the road.<br />\nA Man&#39;s Only as Good as His Word. Build your reputation by getting the job done right. Bigger and better jobs wait for the trucker who gets&#39;r done! Passing on the wrong job can get the competition on your tail and your name in the mud.</p>", "metacritic": null, "released": "2005-08-31", "tba": false, "updated": "2023-12-05T23:36:52", "background_image": "https://media.rawg.io/media/screenshots/7f2/7f20eee4aed32d25dc5e66ef5f7e0c41.jpg", "website": "http://www.retroism.com", "rating": 3.62, "rating_top": 4, "added_by_status": {"yet": 3, "owned": 49, "beaten": 4, "dropped": 8}, "playtime": 2, "achievements_count": 0, "ratings_count": 13, "suggestions_count": 347, "game_series_count": 6, "reviews_count": 13, "platforms": ["PC"], "developers": ["SCS Software"], "genres": ["Simulation"], "publishers": ["Retroism", "ValuSoft", "Cosmi Valusoft"], "esrb_rating": null}