{"id": 18547, "slug": "dragons-prophet", "name": "Dragon's Prophet", "name_original": "Dragon's Prophet", "description": "From the creators of Runes of Magic, Dragon's Prophet is a free to play fantasy MMO that transports you to the breathtaking world of Auratia, a realm where dragons fill the sky. For thousands of years, the epic wars between ancient dragons have threatened to plunge Auratia into chaos. Now, an even greater danger has emerged that threatens the very existence of the realm. Explore the vast land as you attempt to CAPTURE, TRAIN, RIDE, AND FIGHT hundreds of unique dragons!<br/><br/><br/><br/>In a world shaped by dragon-kind, hundreds of unique dragons roam the lands. CAPTURE, TRAIN, RIDE, and FIGHT them in order to unlock their unique skills and abilities.<br/><br/><br/>Dragon’s Prophet uses a unique auto-target and combo system that immerses players in visceral battles and action gameplay. This system gives players a higher degree of control, and a wider range of tactical options than traditional MMOs.<br/><br/><br/>Players are transported to the breathtaking world of Auratia, which is filled with amazingly detailed landscapes. Mysteries, challenges and monsters await players as they fight not just for their own survival, but for the survival of the entire realm.<br/><br/><br/>Players will choose from four distinct player classes to begin their journey into Auratia. Whether they prefer to get in close, shoot an arrow into a dragon’s eye, or blast an entire group of goblins with ranged DPS, there is a class for every player.<br/><br/><br/>The dragons a player captures will shape their character and, ultimately, their fate. Will you be a legendary fighter? Can you capture and train a dragon that will stand alongside you in the heat of battle? Capturing the right dragons is the difference between life and death!<br/><br/><br/>Enter the world of Auratia for free and immerse yourself in the world where Dragons abound. Obtain loot through gameplay or enter the marketplace to make purchases with Diamonds.<br/><br/><br/><br/><br/><br/><br/><br/>", "metacritic": 63, "released": "2013-09-18", "tba": false, "updated": "2023-03-08T17:52:52", "background_image": "https://media.rawg.io/media/screenshots/7fd/7fd74567ac02a20a07880c2b4d6acead.jpg", "website": "http://www.dragonspropheteurope.com/", "rating": 2.25, "rating_top": 1, "added_by_status": {"yet": 8, "owned": 339, "beaten": 3, "toplay": 1, "dropped": 6}, "playtime": 1, "achievements_count": 0, "ratings_count": 12, "suggestions_count": 559, "game_series_count": 0, "reviews_count": 12, "platforms": ["PC"], "developers": ["Runewaker"], "genres": ["Action", "RPG", "Massively Multiplayer"], "publishers": ["Infernum Productions"], "esrb_rating": null}