{"id": 1855, "slug": "dandy-or-a-brief-glimpse-into-the-life-of-the-cand", "name": "Dandy: Or A Brief Glimpse Into The Life of the Candy Alchemist", "name_original": "Dandy: Or A Brief Glimpse Into The Life of the Candy Alchemist", "description": "Deceptively whimsical, Dandy is a perma-death side-scrolling shoot 'em up with a host of stacking power-ups. Different on every play-through, with reactive enemies that force you to strategize.<br/><br/>The last in a dwindling line, Dandy was the only active candy alchemist of his time. His obsessive search for alchemical ingredients took him into the ruins of the ancient world. It is said that whatever he found there drove him mad, but nothing is truly known about his disappearance. Take a brief glimpse into his life, and uncover the mysteries of a forbidden land.Key Features:<ul><li> Local co-op - Bring up to 3 friends along with randomly created companions. Just hook up your controllers and press start.<br/></li><li> Online Racing - Join up to 3 other players in a race to the boss, with kart racing style sabotages (works cross platform).<br/></li><li> Thousands of power-up combinations, with powerful synergies to discover. Each power-up combination gives Dandy a completely new look. <br/></li><li> Procedurally generated maps make each playthrough different and challenging. <br/></li><li> Reactive enemies that force you to learn and strategize. Coming in with guns (er, wands) blazing will often be a bad choice. <br/></li><li> Choose a custom random seed you can share with friends.<br/></li><li> 10 song original soundtrack (it's awesome!). <br/></li><li> Mouse, Keyboard, or Controller controls. </li></ul>", "metacritic": null, "released": "2015-08-04", "tba": false, "updated": "2019-10-22T14:27:52", "background_image": "https://media.rawg.io/media/screenshots/dd0/dd0a5729af8d6904c108b8544ceb23d3.jpeg", "website": "http://dandy.wefiends.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 61}, "playtime": 4, "achievements_count": 15, "ratings_count": 0, "suggestions_count": 195, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "macOS", "PC"], "developers": [], "genres": ["Action", "Arcade", "Indie"], "publishers": [], "esrb_rating": "Everyone 10+"}