{"id": 18569, "slug": "super-comboman-smash-edition", "name": "Super ComboMan: Smash Edition", "name_original": "Super ComboMan: Smash Edition", "description": "Crispy Combo Action<br/>\n<br/>\r\nEnter a new action hero. An energetic islander with a funked up mullet nugget, wearer of loud Hawaiian shirts, eater of chocolate chip cookies, and owner of a talking fanny pack (yeah, a talking fanny pack). His name is Struggles, and he’s the working class hero with an 'All You Can' attitude, a spinning pile driver, and fireball moves to match.<br/>\n<br/>\r\nHelp Struggles battle an army of baddies and mega bosses from a giant construction organization called DoDoCo. Traverse through vibrant levels, unlock powerful moves inspired by classic 2D fighter games  and punch your co-workers through brick walls in order to collect a paycheck along the way. Help Struggles keep a roof over his and his brother's head in this action packed 2D adventure.<br/>\n<br/>\r\nFEATURES<br/>\r\n●\t2D Fighting Game Inspired Action (you know you love it) – Smash, counter punch, and forward dash into classic 2D platform action and take down an army of DoDoCo thugs coming at you with fighting moves straight outta the classic 2D fighting games move list.<br/>\n<br/>\r\n●\tMega Manga Bosses &amp; Talking Fanny Packs (the obvious bullet point) - Test your twitch gaming skills and take on big beefy bosses with the help of Struggles' trusted flopping side kick, Flappy, the talking fanny pack. Struggles never leaves home without him.<br/>\n<br/>\r\n●\tUnlock &amp; Unleash - Earn your keep by beating down the DoDoCo baddies, and spend your hard earned cash on unlocking new powerful fighting moves like the fire uppercut, air dash, and the ole stand-by dive kick. <br/>\n<br/>\r\n●\tGo Combo Crazy - Rack up killer kombos and activate powerful perks you can unlock in the combo store.<br/>\n<br/>\r\n●\tPerks  - It's going to take more than a loud Hawaiian Shirt and a talking fanny pack to defeat your enemies. Activate powerful perks like Infinite Smash and Heal Parry to put the beat down on the enemy.<br/>\n<br/>\r\n●\t2D Sticker Art Style - Rad 2D sticker art style will make you want to rock your own fanny pack. (Not for the faint of heart.)", "metacritic": null, "released": "2017-08-22", "tba": false, "updated": "2022-10-01T23:42:36", "background_image": "https://media.rawg.io/media/screenshots/d86/d860707934ba372deb32cd3138bb8703.jpg", "website": "http://www.supercomboman.com", "rating": 0.0, "rating_top": 1, "added_by_status": {"yet": 9, "owned": 177, "beaten": 1}, "playtime": 1, "achievements_count": 20, "ratings_count": 5, "suggestions_count": 184, "game_series_count": 0, "reviews_count": 5, "platforms": ["PC"], "developers": ["Interabang Entertainment"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Flashman Games"], "esrb_rating": null}