{"id": 18577, "slug": "ruckus-ridge-vr-party", "name": "Ruckus Ridge VR Party", "name_original": "Ruckus Ridge VR Party", "description": "<strong>Ruckus Ridge</strong> is the first local-multiplayer mini-game tournament built for Oculus Rift and HTC Vive that pits 1 VR player against up to 3 friends in simultaneous combat. Duking it out in a series of 1 vs. 3 and Free for All mini-games, players take turns in the VR headset while the others use regular controllers to play. Players score points by winning minigames and the player with the most points at the end of the tournament takes the victory! <br/><br/>Don’t have extra controllers? No problem! Download our free gamepad app and play, no strings attached!<br/><br/>Inspired by classic local-multiplayer games like “Mario Party,” “Fuzion Frenzy,” and “Hidden in Plain Sight,” Ruckus Ridge comes loaded with enough tension-filled mini-game action to put callouses on those delicate baby hands of yours. <br/><br/><strong>FEATURES:</strong><br/>Ruckus Ridge features a variety of minigames, maps, and characters, all built exclusively for VR. The underlying tension of each mini-game is that couch players need to accomplish objectives in the environment while the VR player attempts to disrupt them. Couch players cooperate or compete to achieve victory, and the dynamic between couch players and VR players allows for endless strategic possibilities. Make enemies or alliances… It’s all up to you... <br/><br/>“Ruckus Ridge” is available to all Oculus Rift and HTC Vive owners in April 2016.<br/><br/><strong>Ruckus Ridge has been featured in UploadVR, VR Focus, The VR Experts, VR Nerds, Real O Virtual, VR Guru, and ARVR Magazine. </strong>", "metacritic": null, "released": "2016-04-05", "tba": false, "updated": "2019-08-28T17:05:57", "background_image": "https://media.rawg.io/media/screenshots/e49/e4990c42ef939ae89d7074410659fb2e.jpg", "website": "http://www.ruckusridgegame.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 6}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 353, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Foreignvr"], "genres": ["Action", "Indie"], "publishers": ["Foreignvr"], "esrb_rating": null}