{"id": 18589, "slug": "dolphin-defense", "name": "Dolphin Defense", "name_original": "Dolphin Defense", "description": "Start at the DOLPHINVERSE: a hub for different games and experiences within Dolphin DefenseLAB<br/>This area has arcade machines you can use to access new areas. Right now you can go to SUNSETあの日 and Tunnel Force Vortex (TFV). The sunset is a place to relax for a while. The clouds slowly change and there are some things to explore and see. TFV is an arcade-style game where you try and get a full combo while swinging your arm to move your player smoothly around the inside of a tunnel. The visuals become more intense as you get multiplier power-ups. It's made to be played with the included music or your own playlists using separate headphones.DOLPHIN DEFENSE<br/>Take on the role of a Dolphin Defense Department (DDD) staffer by dropping, dripping, throwing, and shooting balls containing jetpacks through time and space. With a lot of skill and a little bit of luck, these jetpacks will help dolphins get out of sticky situations. As you save more dolphins you'll be able to travel deeper into the DDD's 4th Dimension Outpost. <br/><br/>Your colleagues Saki, Pepper, and Julius will befriend you and help you out. After all saving dolphins is hard work, but it's all in a days work for you.<br/><br/>This game has 20 levels called zones and some extras. At the beginning you have access to a field-training tutorial that will teach you the basics and 3 zones that you can play.<br/><br/>As you save dolphins in each zone you will unlock access to more waypoints that you can teleport to. New waypoints will have more zones and new interactions with characters.<br/><br/>You have the opportunity to save 3, 5, or 10 dolphins in each zone. The number of dolphins you save depends on your score. Your score is computed differently for each level but usually consists of balls through rifts, rifts hit, and/or cubes hit multiplied together.<br/><br/>Diversity in maximizing the various components in each zone is key to getting higher scores. Your scores are compared against the tiers shown on the screen in the results scene. Check the Action Board at the beginning to see how many dolphins you’ve saved in each zone and what your next objective is.<br/><br/>The story unfolds a little more at each new waypoint. At first the characters are focused on explaining how to play the game, but after a few waypoints the dialogue shifts to giving you insight into their world.<br/><br/>If you are confused on how to get a higher score on a zone then read the debrief that is available on the menu before you enter the zone. Most zones require skill and practice to get familiar with what you need to do to win and many zones have an element of randomness so your experience will be slightly different each time you play.<br/><br/>For gameplay videos of each zone check out this playlist on the Dolphin Defense Youtube Channel:<br/>https://www.youtube.com/playlist?list=PLjkAgQa3vqkepcR54yMN5ulQn-aAHhAT_Seated/Standing<br/>Dolphin Defense is now playable for seated and standing players! The Dolphinverse, SUNSETあの日, and Tunnel Force Vortex are the most suitable for seated and standing players, but I have also added the ability to increase the number of dolphins you have saved in Dolphin Defense so that new areas can be accessed more easily. Some levels will still be difficult to play while seated or standing, but anyone who wishes may bypass those and still have a full experience.Music<br/>When I was a kid I wanted to create music for video games so I took that role very seriously on this project. A lot of it is inspired by music I liked as a kid (and still like now) including N64 video game music, Eurodance, Bubblegum Dance/Pop, and Trance. I made some Dolphin Defense playlists with songs from the game and other music I like to listen to with it.<br/><br/>DOLPHIN DEFENSE 🐬💧💜: https://open.spotify.com/user/4vv9int/playlist/7aVP2FuVf7FXnO1KmdPnDY<br/>SLEEPY DOLPHINS ⭐️🐬💤: https://open.spotify.com/user/4vv9int/playlist/58YyNJiEWJDOuC95QKxuuVTheme Song Lyrics<br/>Can't you see<br/>I'm waiting for you<br/>You and me<br/>Have so much to do<br/><br/>If I'm gone<br/>The world will be a darker place<br/>Come on<br/>Give it your all<br/><br/>We've got to<br/>Save the Dolphins<br/>We've got to<br/>La la la la love the Dolphins<br/><br/>We've got to<br/>La la la la love the Dolphins<br/><br/>Come with me<br/>We'll save the dolphins<br/>One two three<br/>No need to be twins<br/><br/>If I'm gone<br/>The world will be a darker place<br/>Come on<br/>Give it your all<br/><br/>We've got to<br/>Save the Dolphins<br/>We've got to<br/>La la la la love the Dolphins<br/><br/>We've got to<br/>La la la la love the Dolphins<br/><br/>Save them!<br/><br/>'Save the Dolphins' by Tanner Thayer feat. Hits Up &amp; Cyber Diva", "metacritic": null, "released": "2016-05-16", "tba": false, "updated": "2019-08-28T22:09:43", "background_image": "https://media.rawg.io/media/screenshots/7c4/7c4e525a8334eb183fa94911a4b47f42.jpg", "website": "http://tannerthayer.github.io/dolphinSite/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 180, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Tanner Thayer"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Tanner Thayer"], "esrb_rating": null}