{"id": 18580, "slug": "the-divergent-series-allegiant-vr", "name": "The Divergent Series: Allegiant VR", "name_original": "The Divergent Series: Allegiant VR", "description": "Venture into the world of The Divergent Series: Allegiant in this 10-minute immersive story that brings film characters to life in VR in an all new way. Join Tris, Four &amp; Caleb (Shailene Woodley, Theo James, &amp; Ansel Elgort), on a mission to prevent catastrophe and discover the true intentions of David and his Bureau of Genetic Welfare…<br/><ul><li>The Allegiant VR Experience was created as an experiment in VR storytelling. Interactivity is present, but limited.<br/></li><li>As the first VR experience with three photo-real characters, acted and performance captured via participation from their real-life counter-parts, Lionsgate and Summit Entertainment is dedicated to creating novel virtual reality experiences featuring boundary-pushing elements, freely made available for home use.</li></ul>IMPORTANT: The Allegiant VR Experience requires a high-end computer to run. A 980ti graphics card or better is strongly recommended.<br/><br/>For more information: http://thedivergentseries.movie/vr <br/>See the movie!: http://tickets.thedivergentseries.movie <br/><br/>From Summit Entertainment - A Wevr immersive production TM &amp; © 2016 Summit Entertainment, LLC. All Rights Reserved. <br/>-- <br/>#Allegiant <br/>The third installment of the blockbuster Divergent series franchise, ALLEGIANT takes Tris [Shailene Woodley] and Four [Theo James] into a new world, far more dangerous than ever before. After the earth-shattering revelations of INSURGENT, Tris must escape with Four and go beyond the wall enclosing Chicago. For the first time ever, they will leave the only city and family they have ever known in order to find a peaceful solution for their embroiled city. Once outside, old discoveries are quickly rendered meaningless with the revelation of shocking new truths. Tris and Four must quickly decide who they can trust as a ruthless battle ignites beyond the walls of Chicago which threatens all of humanity. In order to survive, Tris will be forced to make impossible choices about courage, allegiance, sacrifice and love.<br/>&gt;&gt;&gt;", "metacritic": null, "released": "2016-03-17", "tba": false, "updated": "2019-09-17T12:34:54", "background_image": "https://media.rawg.io/media/screenshots/e74/e74c6ac800e97c70e0d49a9916f3d93f.jpg", "website": "http://www.thedivergentseries.movie/vr", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 179, "beaten": 2, "dropped": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 4, "suggestions_count": 318, "game_series_count": 0, "reviews_count": 4, "platforms": ["PC"], "developers": ["Wevr", "Big Red Button Entertainment"], "genres": ["Adventure", "Casual"], "publishers": ["Summit Entertainment"], "esrb_rating": null}