{"id": 1859, "slug": "mad-o-ball-3d", "name": "Mad O Ball 3D", "name_original": "Mad O Ball 3D", "description": "Not your usual ball game!<br/>An exciting arcade action game of amazing races against time to play forever on your iPhone / iPod touch / iPad. Awesome 3D graphics, excellent music and sound effects and superb physics are the winning key for this great game.<br/>Control the ball with accelerometer and touchscreen.<br/>32 exciting levels with many different tricks and obstacles.<br/>Challenge your friends, who will be the more trained and balanced ?<br/><br/>Features:<br/><br/>- 32 challenging tracks + 8 in the new space levels add-on<br/>- 5 beautiful worlds: East, South, West, North and Space<br/>- Superb realtime physics<br/>- Get pass the levels with different racing styles.<br/>- Several physics-based obstacles: foe-ball, parking lot, high jump, mills, carousels and more!<br/>- Bonus to improve your race time<br/>- Rechargeable hydrogen &amp;quot;nitro&amp;quot; boost allows you to make crazy shortcuts!<br/>- New &amp;quot;marbles&amp;quot; to play with: Softball, Basketball, Golfball, Pinball, Beachball, RedMarble<br/>- Original music and sound effects<br/>- Accelerometer and touch screen controls<br/>- High quality production and full 3D accelerated OGL ES graphic<br/>- GameCenter Achievements<br/>- Universal: iPad HD resolution and Retina Display included<br/>- Built for iOS4.2<br/><br/>Bored with the original soundtracks ? <br/>The game supports listening to your iPod music while in game.<br/><br/><br/>********************************************************<br/>Featured by Apple in New and Noteworthy world wide<br/>********************************************************<br/><br/>&amp;quot;Games like this are what has lead Nintendo to comment that Apple is its competitor of the future.&amp;quot;<br/><br/>The Guardian: &amp;quot;[...] the puzzles are challenging and satisfying, making the game dangerously addictive.&amp;quot;<br/><br/>IndieAppolis: &amp;quot; [...] is a really nice marble game with lots to offer.&amp;quot;<br/><br/>ICasual | The Portable Gamer: &amp;quot;[...] Beautiful 3d graphics and fun fast paced game play is on the table with today&amp;#39;s show&amp;quot;<br/><br/>iPhone Canada: &amp;quot;[...] there are some really nice 3D visuals with great sounds in each level and the physics engine is very accurate. &amp;quot;<br/><br/>Touch Reviews: &amp;quot;There’s a lot of variety between the 4 worlds and 32 tracks which keeps things interesting as you progress through the four worlds.&amp;quot;<br/><br/>Capsule Computers: &amp;quot;You’re flying off the course onto the next object, always changing gameplay. This is the gyroscope game to buy.&amp;quot; - 8.5/10<br/><br/>iFanzine: &amp;quot;[...] impressively true to life physics and a “aw, just one more go” quality that’s more addictive than caffeine, and more likely to get your heart pounding too.&amp;quot; - 8/10<br/><br/>AppChat: &amp;quot;Awesome accelerometer game&amp;quot; - 5/5<br/><br/>Brutal Gamer: &amp;quot;[...] It’s good looking and the levels and environments are varied.&amp;quot; - 7/10<br/><br/>SlapApp: &amp;quot;What’s not to love!  Mad O Ball 3D is a flat out awesome game&amp;quot; - 5/5<br/><br/>Common Sense: &amp;quot;[...] is a real test of balance and agility.&amp;quot; - 4/5<br/><br/>Apptapper: &amp;quot;Mad O Ball 3D is a great universal app for your iPhone, iPod Touch, and iPad.&amp;quot;<br/><br/><br/>********************************************************<br/>Thank you! Your AppStore reviews and your enjoyment <br/>are motivating us in bringing you a better game !<br/>********************************************************<br/><br/>Follow us on Twitter:<br/>@MadOBall3D<br/><br/>The game on Facebook:<br/>facebook.com/pages/MadOBall-3D/305866366023", "metacritic": null, "released": "2010-03-03", "tba": false, "updated": "2019-10-22T13:57:03", "background_image": "https://media.rawg.io/media/screenshots/606/606abe323a0647b463c7bb7f0d1ddabe.jpeg", "website": "http://www.madoball3d.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 228, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tommaso Lintrami"], "genres": ["Racing", "Arcade"], "publishers": ["Tommaso Lintrami"], "esrb_rating": "Everyone 10+"}