{"id": 185936, "slug": "telebots", "name": "Telebots", "name_original": "Telebots", "description": "<p>***AS OF NOW, YOU NEED PS4 CONTROLLERS TO BE ABLE TO PLAY TELEBOTS***<br/></p><p>Telebots is a competitive multiplayer 2-D action shooter where you are pitted against other players in a battle royale to see who will be left standing in the end. Use the game's unique teleport mechanic and gather power-ups, such as shields and extra lives, to give yourself the edge and be the first to vaporize all of your opponents!</p><p>MISSION BRIEFING: COMMENCING</p><p>You are a sophisticated combat class Telebot that has been programmed with only one purpose: destroy your enemies before they do you. You are instantly transported to the battlefield with a standard phaser rifle in hand; use it to shoot your opponents and fight until you are the last bot standing. </p><p>As a combative model Telebot, you are equipped with a suit of armor that is capable of integrating several software and hardware upgrades that you will find on the battlefield. Acquire a shield module to grant yourself a protective force field that will nullify the fatal effects of a single enemy phaser shot; the \"Linkable Interface for External Communication\", or \"LIFE-COM\" module will allow remote upload to a secondary robotic interface, should the original be destroyed. Extra munitions for your weapon will also be made available. </p><p>Finally, do not forget to use your standard teleportation module to transport yourself between your two synched combat environments. Should teleportation to the same corresponding coordinates in one area be possible in the other, your HUD should notify you by displaying a \"shadow\" image in the available space. Use this ability to your advantage to avoid enemy fire and position yourself for victory.</p><p>MISSION BRIEFING: TERMINATED</p><p>Key features</p><ul><li>A multiplayer couch game that 2 to 4 players can play.</li><li>Surprise your opponents by using teleport mechanic</li><li>Fast travel through the levels using portals</li><li>Power-ups that can turn around the game in your favor</li><li>A variety of levels that each requires a different strategy</li></ul>", "metacritic": null, "released": "2016-05-04", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/64b/64b4c2194479dc568971e7f09c9ecb99.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 139, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["k4sr4"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}