{"id": 186097, "slug": "aspect-of-god", "name": "Aspect of God", "name_original": "Aspect of God", "description": "<p>Aspect of God was a story I had well over ten years ago. I was fairly passionate about the concepts within since it would have been a very different story.</p><p>The PC was an angel or some sort of universal entity called into existence for a single purpose. To travel to Earth, find the person or persons that were the cause of the \"call\", and attempt to aid them in moving past both past and future tragedies.</p><p>There was going to be three vignettes; a farmhouse with a grown daughter caring for her father, both mourning the passing of mother/wife.</p><p>The second was a business man in a city.</p><p>The third I never figured out.</p><p>The trick to the story was that the PC could not directly interact with the NPC's. I had planned to implement an emotions based recall system. The idea was that the NPC's were in a spiral towards destruction and they needed to be kicked out of the spiral. So the PC would observe the patterns, find moments of high emotion, and push the NPC to remember something about that object or place from the past. If the NPC hits the right notes, the father and daughter are saved. If the wrong notes are hit or none at all, suicide and life-long despair is the result.</p><p>I don't remember if I had the second vignette fleshed out.</p><p>I had to dig up and old disk drive and compile this with I7 4S08 to make it work. even then it had two minor compile errors.</p><p>The Z5 file, source, and extensions are included in the zip file.</p>", "metacritic": null, "released": "2016-06-18", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["David Cornelson"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}