{"id": 18618, "slug": "ironclads-2-american-civil-war", "name": "Ironclads 2: American Civil War", "name_original": "Ironclads 2: American Civil War", "description": "In 1862, when Farragut's Union squadron was preparing to occupy the vital hub of the South - New Orleans, the Confederate agent L. Merton approached the Austrian government for a passible naval arms deal. Relations between the Austrian Empire and the North were poor during the war. The Austrians tried to interest the Confederacy in steam warships, many of them gunboats. With the New Orleans ironclads, they could present a dangerous challenge to the Union navy on the high seas, potentially capable of overwhelming squadrons on individual blockading stations. In reality, the deal never took place - but it could have happened!<br/><br/>Create your fleet and army, hunt the enemy's fleet, hide your weak squadrons in protected ports until reinforcements arrive, blockade enemy trade routes, amphibious assaults and harbour sieges, struggle for dominance over the seas in turned-based strategic mode - All of these actions are possible in <strong>Ironclad 2 American Civil War</strong>. The real time tactical battle mode allows you to set up battles and squadron groups with their formations and management using realistic ship models and characteristics as well as advanced ballistics and weapon models. Choose your ships, increase the experience of your crews and send your squadron into the high seas. Command a battle formation and experience the power of iron and steam in a turned-based maritime strategy mode while fighting battles with a tactical real time naval simulation game. Raise anchor and get <strong>Ironclads 2 American Civil War</strong> now!", "metacritic": null, "released": "2015-11-05", "tba": false, "updated": "2019-08-28T22:09:42", "background_image": "https://media.rawg.io/media/screenshots/6c6/6c6457fa7d97e62840e0d73f8537b945.jpg", "website": "http://www.totemgames.ru/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 17}, "playtime": 3, "achievements_count": 44, "ratings_count": 0, "suggestions_count": 283, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Totem Games"], "genres": ["Strategy", "Simulation"], "publishers": ["Strategy First"], "esrb_rating": null}