{"id": 18619, "slug": "wartune", "name": "Wartune", "name_original": "Wartune", "description": "<strong>Wartune</strong> is a real-time MMORPG that puts you in charge of the world's last bastion. Enlist the aid of  magical Sylphs and summon unyielding Eudaemon to defeat your enemies. Strengthen your hero by challenging epic bosses from the depths of hell itself, and earn rewards to bolster your units. When your lust for blood grows strong enough, join your friends in epic PvP battles, and dominate the charts. The road may be long, but the reward is your Kingdom!<br/><br/><strong>Background Story</strong><br/>A thousand years ago the Void God, Yaros, led the abyss army to strike at the Yaloran Empire. This bloody war turned the rich, fertile land into a barren desert and has claimed the lives of millions of innocents. Humanity needs a hero, will you take them back from the brink of annihilation and defeat the divine terror, Yaros?<br/><br/><strong>Key Features</strong><br/>*Choose from 3 distinct classes.<br/>*Change your units, alter your formation, and adjust your tactics to defeat hundreds of enemies. <br/>*Summon mighty warriors  and mystical creatures to fight by your side.<br/>*Beautiful 2.5D 3D rendered artwork.<br/>*100% free-to-play.<br/><br/><strong>Online Multiplayer</strong><br/>*Clear multiplayer dungeons with your friends.<br/>*Prove yourself in the arena, and conquer players from around the world.<br/>*Defend your allies in massive Guild Battles.<br/><br/><strong>Show Your Style</strong><br/>*Equip hundreds of different items to suit your individual style.<br/>*Choose from more than 100 mounts to take you around Wartune's incredible world.", "metacritic": null, "released": "2016-08-15", "tba": false, "updated": "2019-07-25T17:15:27", "background_image": "https://media.rawg.io/media/screenshots/2df/2df6429dcd2cb3122f4a85598f732284.jpg", "website": "http://www.wartune.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 88, "playing": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 3, "suggestions_count": 380, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC"], "developers": ["7 Road"], "genres": ["RPG", "Strategy"], "publishers": ["Proficient City"], "esrb_rating": null}