{"id": 18610, "slug": "will-of-the-gods", "name": "Will of the Gods", "name_original": "Will of the Gods", "description": "<strong>Will of the Gods</strong> is an <strong>strategical 1v1 arcade game</strong> where players play as Gods, each trying to guide as many followers as they can to their temple, while <strong>punishing</strong> those who choose to follow the other God. It's a game about <strong>tactics</strong>, skill and proving who the <strong>better</strong> one is! Pick an arena, choose your game settings and activate <strong>gamemode mutators</strong> to create a chaotic duel between you and a friend your rival.<br/><br/><br/><br/>Play at your own pace - be it casually, versus an AI or heat things up and fight a friend! Will of the Gods is easy to pick up but hard to master due to several gameplay mechanics and the presence of micro-management! If, perhaps, you want both fun(the crazy type) and to prove that you are indeed the better player, you can activate several gamemode mutators to spice up your game.<br/><br/><strong>Features</strong><br/><ul><li>Play Online or Offline versus a friend or an A.I. <br/></li><li>Become an almighty <strong>God</strong>! Prove once and for all who is better!<br/></li><li>Change gamemode settings and activate mutators to augment your gameplay <br/></li><li>Pick from a variety of levels<br/></li><li>Guide followers to your temple to secure your victory <br/></li><li>Cast <strong>lightning </strong>to make enemies lose their faith or summon <strong>tornadoes </strong>to split large groups up !</li></ul>", "metacritic": null, "released": "2016-08-29", "tba": false, "updated": "2019-08-28T22:09:42", "background_image": "https://media.rawg.io/media/screenshots/95c/95c584229180c0fd4361e6b0214c6459.jpg", "website": "http://www.willofthegods.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 16, "beaten": 1}, "playtime": 3, "achievements_count": 8, "ratings_count": 1, "suggestions_count": 149, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Comrades"], "genres": ["Strategy", "Casual", "Indie"], "publishers": ["Comrades"], "esrb_rating": null}