{"id": 186125, "slug": "viliio", "name": "Vili.io", "name_original": "Vili.io", "description": "<p><strong>Vili.io Game:</strong><br/></p>\n<p>Vili.io is a fastest fidget spinner game. Your spinner can grow 6 times in size and rotate upto 4.2 Quintillion RPM. Its way too much. Lol. The Vili.io game was developed to add some fun around spinning your fidget spinner. In order to play longer you have to kill other spinners, collect donuts to gain 1 RPM and then collide with other spinners to kill them. When you hit other spinners they explode into bigger donuts than normal and also give more RPM value than the normal donuts. The game was developed to add some more features like speed boosters, shields, RPM boosters and extra zoom. You can say its a combo of Agar.io, Spinz.io, Wormate.io and its own game play (like shields and such). </p>\n<p><strong>Gameplay:</strong><br/></p>\n<li>Use mouse to move.</li><li>Left-click or Space to boost, when you are boosting you loose RPM determined by a random formula</li><li>Go to Speed boosters to quickly move in its direction</li><li>Eat small donuts to gain 1 RPM each piece.</li><li>Hit other spinners to gain RPM quickly or kill them.</li>\n<p><strong>Strategy:</strong><br/>Well Vili.io is quiet tricky and a bit hard to maintain your RPM if you are too big. When Small you just have to avoid other spinners to hit you. If any one 2 times than your RPM hits you, you die instantly. If less than 2 times than you loose RPM as much as the difference between you two. Bigger spinners loose 10% RPM on colliding with everyone. So they should avoid killing too many smaller ones or else they will die soon. Use Speed boosters to dodge other spinners and collect your food on the canvas. There are some Speed boosters which spawn additional food. So find them and gain RPM quick. </p>", "metacritic": null, "released": "2017-08-22", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/887/887b652640b8648086632cb62e1e8c30.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 9, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["viliio"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}