{"id": 186147, "slug": "worlds-collide", "name": "Worlds Collide", "name_original": "Worlds Collide", "description": "In the game of Worlds Collide, you will play as a king of your empire, to build<br/>\r\na city, expand its territory, gather enough resources, set up more production lines,<br/>\r\neventually form your army and conquer others. In this world, you will encounter almost<br/>\r\nall kinds of events that could happen to a real empire: raging natural disasters<br/>\r\nthroughout your land, uprising of your civilians against your reign, an unfortunate<br/>\r\nfalling into the notorious Malthusian trap. Variety of actions must be taken by you<br/>\r\nin order to survive and win the unltimate victory.<br/>\n<br/>\r\nBuild your city<br/>\r\nYour city is the foundation of all further development. You must try to increase its<br/>\r\ninfluence, occupy more lands and obtain the yields from them.<br/>\n<br/>\r\nVisit a village<br/>\r\nWhile you are adventuring on the map, you will find some villages. By choosing to<br/>\r\nvisit them, either pleasant surprise or unexpected misfortune could be awaiting.<br/>\n<br/>\r\nDevelop technology<br/>\r\nChanges in technology are the primary source for changes in society. Advanced<br/>\r\ntechnology enable your city to have more production lines, a stronger army and better<br/>\r\nability to deal with different natual disasters.<br/>\n<br/>\r\nBuild your army<br/>\r\nSend your army to the battlefield to gain experience and level up. Each time upon<br/>\r\nreaching a new level, three random traits will be available, but only one of them can<br/>\r\nbe chosen. Make your decision and let your army become invincible.", "metacritic": null, "released": "2017-10-15", "tba": false, "updated": "2019-08-28T21:53:55", "background_image": "https://media.rawg.io/media/screenshots/740/740f6014ff47c0dc69091b0d89ceeffa.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 10, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["discospider13", "otter otter game"], "genres": ["Strategy"], "publishers": ["otter otter game"], "esrb_rating": null}