{"id": 1863, "slug": "d4-dark-dreams-dont-die", "name": "D4: Dark Dreams Don't Die", "name_original": "D4: Dark Dreams Don't Die", "description": "<p>In D4: Dark Dreams Don&#39;t Die, the player assumes the role of a detective who can see and alter the past. The very name of the game, D4, references the concept of time as a fourth dimension that can be explored.</p>\n<h3>Plot</h3>\n<p>The main protagonist, David Young, is a former Boston police officer who served in a narcotics unit. A couple of years ago someone killed his wife. David himself suffered a head trauma that made him amnesiac. The same trauma allowed him to uncover his superhuman skill to see the past. When he touches the important items related to his past, he can see their history and even travel to his own past to change it. Now Young became a private detective and is still searching for his memories and his wife&#39;s murderer. His goal is to change the past to prevent her death. On his investigation, Young will encounter many oddball characters and question his own sanity.</p>\n<h3>Gameplay</h3>\n<p>The game consists of a series of episodes, not unlike a visual novel. The player controls David Young from the third person view. The main character is limited in his movements and can only follow the predetermined paths. The goal is to explore the locations and to interact with various characters to uncover the mystery. The game often uses quick time events, and when the player fails them, the protagonist loses health. Xbox One version of the game employs Kinect as the main control tool, while PC version allows the player to use the mouse.</p>", "metacritic": 72, "released": "2014-09-19", "tba": false, "updated": "2024-01-23T12:13:19", "background_image": "https://media.rawg.io/media/games/7a5/7a5f7a3e58593bfda983507c2ddbc891.jpg", "website": "http://d4-game.com/", "rating": 3.6, "rating_top": 4, "added_by_status": {"yet": 71, "owned": 940, "beaten": 111, "toplay": 41, "dropped": 54, "playing": 5}, "playtime": 5, "achievements_count": 156, "ratings_count": 197, "suggestions_count": 591, "game_series_count": 0, "reviews_count": 199, "platforms": ["Xbox One", "PC"], "developers": ["Access Games"], "genres": ["Action", "Adventure", "Casual", "Indie"], "publishers": ["Microsoft Studios", "AGM PLAYISM", "Active Gaming Media"], "esrb_rating": "Mature"}