{"id": 186327, "slug": "superhero-fighting-games-grand-immortal-fight", "name": "Superhero Fighting Games: Grand Immortal Fight", "name_original": "Superhero Fighting Games: Grand Immortal Fight", "description": "<p>Superheroes are fighting in grand immortal battle, a master piece for those who love to play superhero games. “Superhero Fighting Games: Grand Immortal Battle” in which immortal superheroes are ready to fight against each other using Kungfu techniques. Have you seen many super hero fights and grand battle in chaos ring? This time you will play by yourself immortal super hero fighting game in city environment where they will fight a deadly battle with incredible monsters in ring battle arena. There is a 3D real time fighting environment with amazing graphics where you can choose superhero of your own choice and real fight in the fighting simulator.<br/><br/>Superheroes fighting game brings a wide range of superheroes squad to lead the amazing combats battle. Superhero Fighting Games is an awesome action game in which super heroes fight with each other in immortal battle and Kungfu skills. Fight with different super heroes by using unique karate styles fighting, boxing, Kungfu and you’re your flying kicking and martial arts skills in arena ring battle. You have been played different fighting games but this time play a race between super league champions in fighting superheroes war. You can choose your hero between monster and ninja assassin and many others. Use your boxing skills and fight the real fight with monster hero’s. <br/><br/>Show bravery and power to sabotage an opponent in assassin battle. Flexible smash attack in Kungfu style is very important for winning this champion battle between superheroes. Superheroes will prove their caliber in this remarkable Superhero Immortal Battle which is a great starter for real boxing games.<br/><br/>Choose between your Ninja assassin battles and use your martial art skills to take this dual combat to a next level. Join the super hero real fight club and test your ninja assassin skills against martial arts in deadly combat battles. Discover the invisible fighting techniques and be the legend hero of your monster.<br/><br/>Superhero Fighting Games: Grand Immortal Battle Features: <br/>•\tSmooth &amp; Easy gameplay <br/>•\tAmazing Superhero fights<br/>•\tNew fighting techniques for Super Hero’s<br/>•\tAmazing Background &amp; Environment<br/><br/>Choose from highly skilled incredible fearless ring fighters to ace the arena. Show your breathtaking punching, utmost kicking and combo of these super techniques to take down opponents after selecting your superhero fighter. Play a role of superhero and fight against other superheroes which are in this fighting game and show them who the super hero is. Feel the incredible met human power of warrior and flying superstars. It’s the combat game of flying superstars and combo heroes so enjoy it with your friends!<br/><br/>Download superhero fighting games now and enjoy fighting with amazing features free of cost. Give us your valuable feedback and also rate us on play store.</p>", "metacritic": null, "released": "2018-06-20", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/d60/d60321989f2df5cd7dab9be6667c280d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 234, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Ehtesham12"], "genres": ["Action"], "publishers": [], "esrb_rating": null}