{"id": 186552, "slug": "the-journey-of-earl", "name": "The Journey of Earl", "name_original": "The Journey of Earl", "description": "<p>The Journey of Earl is a puzzle platformer game that has a character named \"Earl\", Ana (Earl Mother)  got a sickness that can't be cure by any medicine, because the doctor can't find anything what's the problem with the sickness. Someone know a folklore can cure Ana from that sickness. \"In this bottom of the earth have a magical flower can cure every sickness at this world\". While he seek those medicine, Earl must find way through a lot of trap and monster to go way down of the earth.<br/></p>\n<p>Devoleped by 5 students from Binus University</p>\n<ul><li>Earl</li></ul>\n<p>Early life of earl is just the same as the other child, But he is little different from other child, He is smart, brave, and care person. Also he learn some survival skill from his mother while, he had time with his mom. At the school, He join scout, because he want to learn a lot of survival skill and learn discipline from there</p>\n<ul><li>Ana (Earl Mother)</li></ul>\n<p>Ana was a hard worker farmer to find some money for her life and her son, Because of the hard work, She almost doesn't have time for her son. While she had some time, she spent her time with his son by teaching survival skill and some other stuff that useful. One day, Ana got a sickness that can't be cure by any medicine, because the doctor can't find anything what's the problem with the sickness. </p>\n<p>Trailer</p>\n<ul><li>Coming Soon</li></ul>\n<p>Screenshot</p>\n<ul><li>Coming Soon</li></ul>", "metacritic": null, "released": "2018-01-16", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["WeeDOG"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}