{"id": 186660, "slug": "battleship-3d", "name": "Battleship 3D", "name_original": "Battleship 3D", "description": "Sink them all!<p>\r\n\tDo you remember the classic game of sink ships of your childhood? If you spent evenings of fun trying to find and sink the ships of your opponent you'll love Battleship 3D where you can enjoy sinking the ships of your enemy in this digital version.\r\n</p>Battleship 3D<p>\r\n\tThis game based on the classic board game battleship is a completely free digital 3D version that explores different game modes available in board versions where you can enjoy great gaming experience thanks to its sound effects in this beta version which continues on development. Do not miss it progress!\r\n</p>Game Features<p>\r\n\tThis digital version of BattleShip3D includes:\r\n</p><ul>\n<li>5 different game modes</li>\n<li>5 difficulty levels</li>\n<li>Sound effects to enhance the gaming experience</li>\n<li>Fully integrated tutorial localized in 4 languages</li>\n<li>3D graphics</li>\n<li>4 different languages to choose to play</li>\n</ul>Game Types<p>\r\n\tDiscover the five fun and different game modes included in Battleship 3D so you can spend hours of fun.\r\n</p><ul>\n<li><strong>Classic</strong>: Come back to play the original version!</li>\n<li><strong>Classic 5</strong>: Discover the classic mode with 5 shots per turn!</li>\n<li><strong>1931 Salvo Edition</strong>: The way you will assess each of your ships!</li>\n<li><strong>Milton Bradley</strong>: You will protect your ships or you plunge in the attempt!</li>\n<li><strong>Largest ship</strong>: The aircraft carrier will be your king in this game!</li>\n</ul>Discover more!<p>\r\n\tIn this gaming experience you can not only choose between different and fun game types, you also can choose between many languages and enjoy the sound effects which enhance the gaming experience. Also you can learn how to play with the included tutorial into your chosen language.\r\n</p>", "metacritic": null, "released": "2016-11-05", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/b32/b325a0c5b9177ef26b13a666e5532e75.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 109, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Juan Antonio Fajardo Serrano"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}