{"id": 186776, "slug": "wild-wild-west-fruit-machine", "name": "WILD WILD West Fruit Machine", "name_original": "WILD WILD West Fruit Machine", "description": "<p><strong>Wild West Themed - 6 Reel UK Club Slot Machine with a £500 Jackpot</strong></p><p>=========================================================</p><p><strong>Overview</strong> </p><p>This machine has \"Wild West\" themed graphics and sounds. Use your skill to get a winning combination on the lower reels with the help of the cowboys and Indians. Use Wild symbols to double or even double-double your wins. Collect 3 \"Win Series\" symbols to earn a series of wins. Your win could be \"Good\", it could be \"Bad\", or it could be downright \"Ugly\". However fear not you can then go on to gamble all of your wins on the \"Win Meter\" in the saloon bar with the chance to win anything up to the £500 Jackpot.<br/></p><p><strong>Terms Of Use</strong></p><p>This app is 100% free there are no in app purchases, so is free to play as much as you wish whenever you wish.</p><p>IMPORTANT NOTE: When your bank and credits are exhausted press on the banner presented to instantly gain extra FREE credit</p><p>This game has as standard real life percentage payout, and behaviours. The machine is presently set to 50p per play and pays out 80% of everything you put in. Just like a pub in any pub or club would.</p><p>HOWEVER with this special edition can you find the secret 101% mode? If you find the secret mode the machine will payout 101% of everything you put in for the following 2 hours. Unfortunately real life fruit machines do not have this function.</p><p>Can you use your Skills and Luck to hit the massive £500 JACKPOT?</p><p>Please Note: This game is emulation only, no money will change hands on it and you will not be asked for pay for anything, nor will you receive any winnings, it is purely for fun and hence it is 100% free to play</p><p><strong>More Game Specifics</strong></p><p><strong>Lower Reels Features</strong></p><p>Transfer your bank balance to credit using the coin slot when lit.</p><p>- Holds: Hold matching symbols to get a winning combination</p><p>- Nudges: Use nudges when available to get the best winning combination</p><p>- Winning Shuffles: When you nudge and no winning combination is received, will you get a free winning shuffle?</p><p>Now that you have a win on the lower reels, play your winning on the \"Win Meter\" to win anything up and including the £500 JACKPOT.</p><p><strong>Top Reels / \"Win Meter\" Features</strong></p><p>The \"Win Meter\" adds up all you winnings to date, allowing you to risk part of the \"Win Meter\" value to try and win even more</p><p>- Select your stake to win on anything up to 8 win lines per spin</p><p>£1 Spin = 3 Win lines</p><p>£3 Spin = 5 Win lines</p><p>£5 Spin = 8 Win lines</p><p><strong>Playing Tips</strong></p><p>- On the lower reels long press on the top half of the reels to look up, very useful when nudging</p><p>- Nudges are not 100% random! Can you work out how to earn more nudges?</p><p>- When your bank and credits are exhausted press on the banner presented to instantly gain extra FREE credit</p><p>- Can you find 101% mode?</p>", "metacritic": null, "released": "2016-01-15", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/5fc/5fcbe41393fc03f82a517525f74602f1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 143, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["cashman_eq"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}