{"id": 187006, "slug": "toure-de-mage", "name": "Toure de mage", "name_original": "Toure de mage", "description": "<p>flèche HAUT- sauter</p>\n<p>flèche BAS- s'acroupir et passer à travers les plateforme vers le bas</p>\n<p>flèche GAUCHE-DROITE- se déplacer à gauche et à droite</p>\n<p>ASDF - stocker un item dans l'inventaire correspondant, échanger l'item déjà dans l'inventaire, utiliser l'item, stocker l'item dans un coffre.</p>\n<p>E - activer une bâtisse correspondant aux ingrédient dans les inventaires, appuyer une seconde fois pour construire la bâtisse au lieu choisit. </p>\n<p>X - lancer un sort, dépend de l'élément choisi. chaque sort produit des items différents lorsque lancés sur une ressource.</p>\n<p>bâtisses:</p>\n<p>MUR = 4 roches, permet de construire des meubles à l'intérieur</p>\n<p>COFFRE = 1 métal, 3 bûches, permet de stocker une sorte d'ingrédient. Appuyer avec un inventaire pour stocker l'item si le coffre est vide ou possède le même type d'item.  Appuyer avec un inventaire vide prend un item du coffre.</p>\n<p>LIT=2 laines, 2 bois, crée un apprenti qui stocke des items et tire sur les ennemis. Les apprentis doivent manger régulièrement pour fonctionner.</p>\n<p>ÉTABLI=2 métaux,2 bois, crée des objets</p>\n<p>CHAUDRON=3 métaux,1 charbon, crée des potions<br/></p>\n<p>FOUR=1 métal, 2 roches, 1 charbon cuit des objets<br/></p>\n<p>BIBLIOTHÈQUE=2 livres, 2 bois, change d'élément en appuyant sur x<br/></p>\n<p>ressources: </p>\n<p>(produit des items au hasard lorsque l'on lance un sort, persévérez si vous n'obtenez pas l'item voulu) </p>\n<p>rocher: produit du métal, de la pierre et d'autres selon le sort</p>\n<p>arbre: produit des bûches, des pommes et d'autres selon le sort.</p>\n<p>mouton:produit de la laine, de la viande et d'autres selon le sort.</p>\n<p>RECETTES: (mettez les deux ingrédients tour à tour puis le second dans le meuble  correspondant à la recette en appuyant sur l'espace d'inventaire le contenant lorsque le personnage touche le meuble.</p>\n<p>établi</p>\n<p>papier=2 feuilles</p>\n<p>livre=1 feuille, 1 cuir</p>\n<p>four</p>\n<p>fiole=1 sable, 1 charbon</p>\n<p>viande cuite= 1 viande, 1 charbon</p>\n<p>chaudron</p>\n<p>potion soin=1 fiole, 1 graine</p>\n<p>potion mana= 1 fiole, 1 pomme de pin</p>\n\n<p>Élève depuis décembre 2017</p>\n<p>pseudo:Shivur</p>\n<p>Fait avec pico-8</p>\n<p>code et graphismes par Shivur</p>\n<p>code externe: Moteur de jeu pico-8 que j'ai créé</p>\n<p>temps passé: 138 heures<br/>J'ai abordé la contrainte du thème en m'inspirant du jeu Kingdom qui est un jeu de gestion minimaliste en vue de coté.  J'y ai ajouté quelques éléments de crafting et collecte de ressources à la terraria.<br/></p>\n<p>Post-Mortem: J'ai peut-être vue trop grand dès le départ et passé trop de temps sur la personnalisation du personnage et l'animation. J'aurais dû commencer par faire un prototype avec un gameplay solide auquel j'aurais ajouté des features au fur et à mesure comme j'ai fait pour mon jeu de la reine des dragons. La double contrainte du temps et des opérations limitées de la pico-8 obligent à aller à l'essentiel en premier. Je suis tout de même fier car mon jeu est jouable avec suffisamment de features pour le rendre intéressant, mais je n'ai pas tout testé et il reste des bugs.</p>", "metacritic": null, "released": "2018-05-25", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/78a/78ab32d6c4a41031373a36b11d9920ae.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 32, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Shivur"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}