{"id": 187117, "slug": "immolation-organization", "name": "Immolation Organization", "name_original": "Immolation Organization", "description": "<p>\r\n\tWe are the Westlake Accessible Programming Club, a team of high-schoolers interested in the development of everything from games to kernels in the high-level language Swift. We were excited this year to take the entire month of November to create a game \r\n\t<em>loosely</em> based on the theme <strong>hacking, modding and/or augmenting</strong> for the developer services company GitHub's annual game development competition, the Game Off.\r\n</p><p>\r\n\tIn \r\n\t<em>Immolation Organization</em>, you <strong>moderate</strong> a mob of baddies with the intent of <strong>hacking</strong> away at and destroying alien spacecrafts! You do so by pointing at and touching places for the mob to travel. They'll always deteriorate and diminish the spacecrafts, but depending on who's bigger, the mob or the spacecrafts, they will either enlarge or shrink.\r\n</p><p>\n<em><strong>NOTE:</strong> The itch.io page only includes the official macOS build. To build from source for all Apple platforms, download the code from our GitHub repository.</em><br/>\n</p>\r\nBut wait, there's more!<p>\r\n\tAlso included is a non-DRM PDF format book written by our lead programmer, Eli Bradley, documenting the entire development process! <em>How We Won the Game Off</em> was initially meant to teach fellow club members how to develop a basic SpriteKit game, but we think everyone inexperienced can learn a bit from it.</p>", "metacritic": null, "released": "2016-12-23", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/fcc/fcc7b5c7911b4bfbd9796e4d7dac6387.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 3, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS"], "developers": ["EtherTyper"], "genres": ["Action"], "publishers": [], "esrb_rating": null}