{"id": 18716, "slug": "wasted", "name": "WASTED", "name_original": "WASTED", "description": "Kill, drink, and kill some more in WASTED, a roguelike post-apocalyptic pub crawler set in a lawless wasteland that lives and dies by the rules “Get wasted, or get wasted trying.”<br/><br/>When a thermonuclear blitzkrieg deprives America of its greatest minds, the very hardiest specimens of humanity cling on to life. From the ashes of old America, a new world emerges, and an ersatz, post-apocalyptic, stillborn 80’s continues indefinitely, populated entirely by the toughest, meanest, and outright dumbest of God’s creations, the Wasters.<br/><br/>Live the life of a Waster, fighting tooth and nail, bullets and baseball bats over the most precious of unnatural resources, a liquid from beneath the sands that fuels all of un-civilization: Booze. Gain strange mutational Hangovers and explore the Coolers, mysterious underground bunkers, in search of powerful weapons, impressive armor, and a nice stiff drink to top it all off. Who knows, maybe you'll uncover some old world secrets while you're at it.<br/><br/>Or don't, because death comes quick in the Western Wastes, and what's yours today just might be picked off your pile of guts tomorrow.KEY FEATURES<br/><strong>Get Wasted...</strong><br/>Customize your character through the S.H.O.T.S. system by drinking irradiated bottles of Booze. Gain powerful Hangovers and mutate yourself with a myriad of permanent abilities. Bolster your strengths by wearing gnarly, 80's inspired clothing, and arm yourself with an impressive array of things to beat, shoot, disintegrate, or explode your enemies with!<br/><br/><strong>...Or Get Wasted Trying</strong><br/>Explore giant, procedurally generated Coolers in search of loot, but beware vicious raiders, disgusting mutants, and a plethora of deadly traps that'll stop at nothing to turn you into a messy pile of guts. Make your way to the bottom-most level of the Cooler in any way you choose: sneaking your way past your foes, obliterating them with brute force, or maybe even fooling them into fighting one another. Scrounge up ammo and items from your surroundings and loot the bodies of dead enemies for their stuff. Just take care not to overextend yourself - when your character dies, they're gone for good.<br/><br/><strong>Carve Out Your Own Little Slice Of The Wastes</strong><br/>Build up your persistent player home and keep it stocked with weapons and supplies to keep you alive and ticking. Carve out your own little slice of the wastes by fitting your house with amenities like workbenches, kitchens, and gardens and decorate it with junk you find through your travels. Should the wastelands relieve you of your livelihood, your stuff will live on for the next Waster who stumbles upon your home. <br/><br/><strong>Leave Your Mark</strong><br/>The choices you make and the way you act will have profound effects on the future of the Western Wastes. Visit the various locales of the Western Wastes of California, trade sheets of TP for valuable supplies, and help other Wasters out by taking on their requests. Make friends with the wasteland's, um, more \"interesting\" personalities, and you'll be rewarded with unique goods and services. Who knows, you might even end up altering the future of the wastelands forever!", "metacritic": 68, "released": "2016-06-07", "tba": false, "updated": "2023-03-25T08:59:32", "background_image": "https://media.rawg.io/media/screenshots/8fa/8fae705b6b1c7225f894748c746b8272.jpg", "website": "http://games.adultswim.com", "rating": 2.36, "rating_top": 1, "added_by_status": {"yet": 33, "owned": 649, "beaten": 2, "toplay": 2, "dropped": 16}, "playtime": 3, "achievements_count": 21, "ratings_count": 25, "suggestions_count": 477, "game_series_count": 0, "reviews_count": 25, "platforms": ["PC"], "developers": ["Mr. Podunkian"], "genres": ["Action", "RPG", "Indie"], "publishers": ["Adult Swim Games"], "esrb_rating": null}