{"id": 18743, "slug": "desperados-wanted-dead-or-alive", "name": "Desperados: Wanted Dead or Alive", "name_original": "Desperados: Wanted Dead or Alive", "description": "<p>&quot;Desperados: Wanted Dead or Alive&quot; is the first strategy game ever to combine a movie-based and story-driven atmosphere of an adventure game with the intellectual challenge of a real time tactic game.<br />\nIn this western-style title, discover a game of strategy and tactics played out in exceptional real time. You&#39;re in charge of a team of 6 mercenaries and must find a way to complete your missions, be it infiltrating an enemy fortress, saving a team member or escaping an ambush... Combine the different skills of your 6 heroes to lead them to victory.The StoryEl Paso, a typical Wild West town in the southwestern United States near the Mexican border. It is the year 1881. For the last few months, the trains belonging to the famous railroad company, Twinnings &amp; Co have been the target of a whole series of hold-ups and ambushes. The management of the company has decided enough is enough and they have to put an end to the raids. It has offered a reward of $15,000 for anyone who captures the leader of the gang responsible.<br />\nBut no one in and around El Paso has the courage to take on the might of the bandidos, so the outlaws just keep on robbing train after train. Even the local Marshal is keeping well out of it.<br />\nIt’s only when a stranger rides into town that things start to change. Bounty hunter John Cooper pays a visit to the local Twinnings &amp; Co manager offering to end the railroad company’s problems once and for all. He gathers together a gang of his old partners and declares war on the bandidos. But during his pursuit, which will take him through half of the southwestern United States, Cooper soon discovers that on this mission nothing is quite what it seems...Key FeaturesMore than 20 enemies with different profiles, from the lazy and cowardly bandit, to the fearsome mercenary.<br />\nA team of 6 characters, each with their own very distinct characteristics, to manage in real time.<br />\n25 different levels provide nail-biting intrigue, with cinematic transition scenes and landscapes that will take your breath away. Amazing artificial intelligence!<br />\nEach enemy is ranked on 10 different criteria, including intelligence, courage, marksmanship, resistance to alcohol, etc.<br />\nAn array of different settings: day-time, night-time, storms, dusk, villages, ghost towns, fortresses, gold mines, saloons, prisons, boats 6 training levels to allow the player to really get into the story</p>", "metacritic": 78, "released": "2001-07-22", "tba": false, "updated": "2024-01-15T22:44:15", "background_image": "https://media.rawg.io/media/screenshots/9a8/9a8dc92a19d11e944a0a0ac256d089a6.jpg", "website": "", "rating": 4.23, "rating_top": 5, "added_by_status": {"yet": 55, "owned": 734, "beaten": 84, "toplay": 18, "dropped": 40, "playing": 4}, "playtime": 1, "achievements_count": 0, "ratings_count": 123, "suggestions_count": 626, "game_series_count": 0, "reviews_count": 125, "platforms": ["PC", "macOS", "Linux"], "developers": ["Spellbound Entertainment"], "genres": ["Action", "Strategy"], "publishers": ["THQ Nordic"], "esrb_rating": "Teen"}