{"id": 187458, "slug": "memes-vs-memes", "name": "Memes vs Memes", "name_original": "Memes vs Memes", "description": "<p>It is the year 20xx, the great hacker known only has XXchan has released a virus named \"Memz 2: Electric Boogaloo\". Thousands of computers are affected, and there is no Antivirus software that can successfully remove the virus. The internet becomes a vacant place as people wait days, weeks, even months for a fix to the problem: none of which presents itself...</p>\n\n<p>Having nothing else to do, you decide enough is enough and hop on the internet, you've gone far too long without looking at youtube videos. Everything goes fine, until an ad for a free minecraft account pops up in one of the videos, and you can't help but click it. Clicking the link reveals it to be a fake site (who would have thought) which ends up downloading the virus onto your computer.</p>\n\n<p>Panicking, you do whatever you can to try to stop the spreading virus. Oddly enough, it seems to be affecting everything quickly but your huge folder of dank memes... and that's when it hits you, you gotta fight fire with fire (or in this case memes with memes). You gather whatever memes you have and place them around your systems core files. </p>\n<p>_________________________________________________________________________________________</p>\n<p>Protect yourself from a army of memes, who would love to delete that lovely little system32 folder of yours. (Obviously this game doesn't not do any of that). Each meme has its strengths and weaknesses, and some of your memes can even be upgraded to provide game-changing advantages!</p>\n\n<p>This game is a WIP and many features are not done! The demo ends when you beat the first boss of the game, Irelia.</p>\n<p> </p>", "metacritic": null, "released": "2018-07-06", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/c56/c567f595cd091c193c6e300d3202a333.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 84, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["Raptorking"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}