{"id": 187947, "slug": "sandra-dress-up", "name": "Sandra Dress-Up", "name_original": "Sandra Dress-Up", "description": "<p>- Dress Up Fashion is a collection of beautiful dressing up made for girls. You can dressup princesses according to your mood. You can choose from nice collection a great number of hairstyles and hair colors.</p><p>- Do you love the latest fashions? With this game you can combine various clothes: dresses, shirt, shoes and jewels and create a perfect look.<br/>Start one of the best dress up games of 2016 and Create your own princess and help her to get best look like Cinderella ,barbie or other princesses</p><p>- All fashion experts know that hairstyle is very important ! Choose for your princess doll various hairstyles and you can try more colors like blonde hair or brown hair or what you like . Do not forget that she must look very pretty ! After that you have a big closet to choose various and colorful dresses for your princess doll . Blouses and shirts pants and skirts - all kind of clothes are in this closet from our fashion games . Only your fashion games skills and imagination decide what should to wear the princess doll ! Combine the colors and the models of all clothes in one of the biggest dress up games how to dress up, Fashion, hairstyles, haircut, makeup, Wedding DressUp, party DressUp,</p><p>- Accessories are also very important in all fashion games : purse and shoes or beautiful jewels will give a brilliant look for your doll . Try to find the perfect combination between the dresses that you choose and these accessories like shoes or necklaces or earrings and see the results : your princess doll looks fabulous !</p><p>- Features:<br/>★ share your dress up girls easily over Facebook or E-mail.....<br/>★ Beautiful HD illustrations joined with a rich narrative on every page<br/>★ Help a fashion doll get ready for a trip to the mall.<br/>★ Choose outfits, clothes, shoes and trendy bags.<br/>★ Pick out the perfect dress for her to wear.<br/>★ Complete fashion doll makeovers at your fingertips!<br/>★ Enjoy numerous engaging and fun animations on each page.</p><p>- Wanna have more fun? Having problems or suggestions? We would love to hear from you!</p>", "metacritic": null, "released": "2016-11-20", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/490/490cb7f12d82e55811784d3b3ed81e79.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 113, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["midooow"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}