{"id": 188, "slug": "modern-combat-2-black-pegasus", "name": "Modern Combat 2: Black Pegasus", "name_original": "Modern Combat 2: Black Pegasus", "description": "<p>In Modern Combat 2: Black Pegasus, complete the mission unveiled in the first opus of one of the most acclaimed FPS games on the iPhone, this time on fronts all over the globe. <br />\n“Modern Combat 2: Black Pegasus looks like a big step forward for the series.” SlideToPlay </p>\n<p>“I was impressed with the console-quality graphics and gameplay elements.” PC Mag </p>\n<p>Modern Combat 2: Black Pegasus further improves the exemplary gameplay of the first Modern Combat for an astounding immersion in a modern war experience and one of the most complete FPS multiplayer games on the iPhone. </p>\n<p>AN IMPECCABLE PRODUCTION ENHANCED BY THE MOST TENSE GAMEPLAY YET <br />\n- The original control modes (Default, Screen Tap, Virtual Sticks) have been further refined for an impressive gameplay fluidity. <br />\n- A new full gyro advanced control mode has been added for even more gaming comfort. <br />\n- Gyro-based QTEs and improved headshot sensations add to the stunning intensity of the gameplay. </p>\n<p>A STUNNING DIVE INTO THE HEART OF A GLOBAL MODERN CONFLICT <br />\n- Embody one of the 3 playable characters and throw yourself into 12 battlefields set in the Middle-East, Eastern Europe and South America. <br />\n- Facial animations and instant-kill slow-motion create a breathtaking sense of immersion. <br />\n- 15 weapons from real military forces that you can gather directly from your enemies and upgrade with several accessories. <br />\n- Blur effects when taking fire and dynamic lightning on your weapon contribute to the realism of the war experience. <br />\nTHE MOST COMPREHENSIVE FPS MULTIPLAYER EXPERIENCE ON THE APP STORE <br />\n- Engage in 10-player online and local confrontations. <br />\n- Choose between 4 multiplayer modes: Battle, Team Battle, Defuse the Bomb &amp; Capture the Flag. <br />\n- XP progression through 72 ranks, reward messages, unlockable weapons and leaderboards ensure heated multiplayer competition. <br />\n- Gather your squad and face your favorite foes through Gameloft LIVE!</p>", "metacritic": 90, "released": "2010-10-06", "tba": false, "updated": "2022-11-11T12:30:57", "background_image": "https://media.rawg.io/media/screenshots/85a/85a0fcbd5db6108b2454c9606edec924.jpg", "website": "http://www.gameloft.com/", "rating": 3.8, "rating_top": 4, "added_by_status": {"yet": 1, "owned": 6, "beaten": 9, "toplay": 1, "dropped": 3}, "playtime": 6, "achievements_count": 0, "ratings_count": 10, "suggestions_count": 480, "game_series_count": 7, "reviews_count": 10, "platforms": ["Android", "iOS"], "developers": ["Gameloft"], "genres": ["Action", "Shooter"], "publishers": ["Gameloft"], "esrb_rating": "Mature"}