{"id": 1881, "slug": "puerto-rico-hd", "name": "Puerto Rico HD", "name_original": "Puerto Rico HD", "description": "Puerto Rico has finally gone mobile!  Experience one of the world’s most popular board games in stunning HD and with fast, crisp game play.  <br/><br/>Travel back in time to the days of colonial Spain and become one of Puerto Rico’s island governors.  Prospect for gold, plant crops, and build up your economy in an epic quest for island domination.  Players will have to take on the roles of mayors, settlers, traders, captains, and craftsmen to beat out their opponents.<br/><br/>Features include:<br/>► Beautiful HD graphics include new building designs and animated, in-game cut scenes.<br/>► Compete against up to four other players, and mix and match between the computer, your friends (pass and play and local connectivity), or other players online through the Game Center.<br/>► Specially designed tutorial and in-game Help feature for those new to the game (or anyone who might want a brief brush-up on the rules).<br/>► Automatic resource distribution: no more fumbling with tiny board pieces.<br/>► No set up of the game required!  Press “Play” and get started.  And best of all, no tidying up after a match.<br/><br/>So dust off your conquistador hat, pull out your doubloons, and join the over 250,000 fans who have already fallen in love with Puerto Rico.<br/><br/>In addition to being ranked number one for eight years in a row on BoardGameGeek.com, Puerto Rico has also received the following awards:<br/><br/>► German Games Award<br/>► Austrian Gaming Experts Award<br/>► Game of the Year Nominee, Germany<br/>► United States International Gaming Award<br/>► And many more …", "metacritic": null, "released": "2011-08-04", "tba": false, "updated": "2019-07-30T06:47:54", "background_image": "https://media.rawg.io/media/screenshots/c15/c1520807458750a2286f3e0013c5450a.jpg", "website": "http://www.ravensburger-games.com/en/mobile-apps/iphone-ipad.html", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 205, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Ravensburger Digital"], "genres": ["Strategy", "Board Games"], "publishers": ["Ravensburger Digital"], "esrb_rating": null}