{"id": 188118, "slug": "alone-together-squaremike", "name": "Alone Together (SquareMike)", "name_original": "Alone Together (SquareMike)", "description": "<p><strong>Notice: This game requires 2 Xbox controllers.</strong></p>\n\n<p><strong>Gameplay</strong><br/></p>\n<p>Alone Together is a co-op first-person puzzle game that places two players in separate rooms where they must solve puzzles to help each other escape.<br/></p>\n<p>Our prototype currently only features button based puzzles, but the full game will feature many different objects and mechanics that the players can use to aid their escape.</p>\n\n<p><strong>Design</strong></p>\n<p>Designers will be able to work on:</p>\n<ul><li>Puzzles: Designers will have to design interesting puzzles that will require players to think creatively.</li><li>Objects: Players will have to use different objects found throughout the game to solve puzzles.</li><li>Level Design: The layout of each puzzle and the design of the different rooms.</li><li>Story: Alone Together will feature a narrative that explains why the players are trapped and why they must escape.</li></ul>\n<p><strong>Art</strong></p>\n<p>Artists will be able to work on:</p>\n<ul><li>Models and Textures: Artists will need to work on the models and textures for the different objects and rooms found throughout the game.</li><li>UI Artwork: Art for player and menu UI.</li><li>Animations.</li></ul>\n<p><strong>Programming</strong></p>\n<p>Programmers will be able to work on:</p>\n<ul><li>Puzzles: Code for various puzzles in the game will need to be written.</li><li>Multiplayer and Networking: The prototype is currently split-screen, but the final game will be playable from two computers across the internet.</li><li>Interactable Objects: Code for different objects that players can interact with.</li><li>Room &amp; Puzzle Randomizer: The game may potentially feature random levels which will have to be generated through code.</li></ul>\n<p><strong>Sound</strong></p>\n<p>Sound Designers will be able to work on:</p>\n<ul><li>Music</li><ul><li>Ambient Music</li><li>Level Music</li></ul><li>Sound Effects</li><ul><li>Ambient Sounds</li><li>Player Sounds</li></ul><li>Voice Acting</li></ul>\n\n<p><strong>Contact Information</strong></p>\n<p>If you have any questions and/or you're interested in working on the game (Columbia College Chicago students only), you can contact us at: <strong>alonetogethergame@gmail.com</strong><br/></p>", "metacritic": null, "released": "2018-05-24", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/dc0/dc0f5fb4437cfaa6d5cb3ab469c94047.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 64, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SquareMike"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}