{"id": 188230, "slug": "heavy-space-retro-i", "name": "Heavy Space Retro I", "name_original": "Heavy Space Retro I", "description": "<p>Game engine: <strong>Gdevelop</strong> - http://compilgames.net/main-it.html</p>\n<p>Graphics: Author: <strong>scofanogd</strong> - https://opengameart.org/</p>\n<p>Graphics: Author: <strong>Kenney </strong>- https://kenney.nl/</p>\n<p>Font: Author: <strong>Kenney</strong> - https://kenney.nl/</p>\n<p>Graphics: Explosion :Author <strong>Cuzco</strong> - https://opengameart.org/</p>\n<p>Sounds artist: <strong>SubspaceAudio</strong> - https://opengameart.org/</p>\n<p>Graphics: Author:<strong> ToxSickProductions.com</strong> - https://opengameart.org/</p>\n<p>Graphics: Author: <strong>Rawdanitsu</strong> - https://opengameart.org/</p>\n<p>Sounds artist: <strong>SubspaceAudio</strong> - https://opengameart.org/<br/></p>\n<p>Font: Author: <strong>Munro</strong> - http://tenbytwenty.com/<br/></p>\n<p>Sounds artist:<strong> Bfxr</strong> - https://www.bfxr.net/</p>\n<p>Graphics: Author: <strong>Jull</strong> - https://opengameart.org/</p>\n<p>Graphics: <strong>Master484 - https://opengameart.org/</strong></p>\n<p>Graphics: <strong>Scrittl</strong> <strong>- https://opengameart.org/</strong></p>\n<p>Description in update - Last update on 19 April 2018<br/></p>\n\n\n\n<p>- Important notes for this patch<br/></p>\n<p>Level 5 and 6 are ready to be played</p>\n<p>I remind you that for the first level the asteroids can not be destroyed with the bullets beware because they do really much damage.<br/></p>\n\n<p>Patch 010 Patches<br/></p>\n<p>*Because of a really slow loading the game was patched without the background music, I'm trying to fix it.<br/></p>\n<p>- Inserted background music on the home page</p>\n<p> - Inserted the music on the page instructions</p>\n<p> - Changed the instructions page</p>\n<p> - Corrected the number of enemies on level 5</p>\n<p> - Added new credit on the spaceships page</p>\n<p>- Create new bullets for the enemies of level 5</p>\n<p> - Modified Energy Bar</p>\n<p> - Changed life bar</p>\n<p> - New mother ship with animation and 4 guns</p>\n<p>- Created new bullet for mother ship</p>\n<p>* Problem to be solved with HITBOX bullets</p>\n<p>- Created new Hitbox points for the Bullet creation of the main starship.</p>\n<p>- Inserted the asteroids that do damage on the first level</p>\n<p>- Configured Level 6</p>\n<p>- Entered the updated statistic in a correct manner</p>\n<p>- Corrected the number of enemies</p>\n<p> - Inserted background music for the level credits</p>\n<p>- Entered the music on the page pause</p>\n<p>- Entered the music page on the instructions page</p>\n<p>* Started working for Level 7</p>\n\n<p>Patch 009 Patches<br/></p>\n<p>- The backgrounds now move down on all levels</p>\n<p>- Removed new mainship due to problems with license use</p>\n<p>- Created a new code that allows the ship to move both forward and backward</p>\n<p>- Inserted new Edge delineator not visible in game</p>\n<p>- Enter 2 new keys to move the spaceship W to move forward S to move backward</p>\n<p>- Created 3 new enemy models for level 5 animations included for 3 models</p>\n<p>- Created new kamikaze model with only one animation this model has been implemented further code so the movement is not linear</p>\n<p>- Created new protection model of different color</p>\n<p>-  Added 3 new audio effects when enemies are destroyed</p>\n<p>- Important NOTE: In this patch have been created several codes, which are repeated on all levels the having to write this piece of code to taken away really long, now the ship can move both high and low can not cross the limit of the map Pa. </p>\n<p>* Problem to solve the speed of the ship is slower to climb and faster to get down</p>\n\n<p>Patch Notes 0.08<br/>- Added new templates for the first 3 enemies the level 1<br/>- Added new animations for enemies in the level 1<br/>-  Fixed the colors of lasers for enemies of the first level all 3 models<br/>Reset all buttons to enemy fire--correctly display bullets for enemies of the first level</p>\n<p>-  Added new models of enemies is the main ship that animations were 6 different models of spaceships for level 2<br/>-  Fixed bullet patterns for the ships so as to match the color to the ship for all models-Recreated all focus points for enemies in the level 2<br/>- Recreated all focus points for enemies in the level 3</p>\n<p>- Added new enemy models both for the animations that for creating the laser, you restored all focus points</p>\n<p>- Created all models for the enemies in the level 4 were implemented all focus points</p>\n<p>- Modified all lasers for enemy spaceships</p>\n<p>- Fixed problem that prevented to change levels</p>\n\n<p>Patch Notes 0.07<br/></p>\n<p>- Fixed display of enemy bullets when they are hit by the main spaceship now is no longer the error that creates a single bullet this correction has been done up to level 4.<br/></p>\n<p>- Correct score spaceships now instead of 20 points for each kill gives 10<br/>- Added a new scoring system that appears each time you complete a new level</p>\n\n\n<p>*Due to time problems in this patch there are no new levels, however soon I will update everything with the level 4 of the game.<br/></p>\n<p>Patch Notes 0.06</p>\n<p>Reservations correction</p>\n<p>- Correct explosion display for Level 3</p>\n<p>- New Game implementations</p>\n<p>- Created new Layer 4 background</p>\n<p>- Added new type of laser for the main ship</p>\n<p>- Added new type of ammunition with laser effect for all spaceships of the game except for kamikaze enemies.</p>\n<p>- New space animated backgrounds for the main page and the 2 credits pages</p>\n<p>- New animated background for Level 1</p>\n<p>- New animated background for Level 2</p>\n<p>- New animated background for Level 3</p>\n<p>- New animated background for level 4</p>\n<p>- New Credits Page added</p>\n<p>- Reservations removals to improve the game</p>\n<p>- Removed old ammunition for all levels of the game</p>\n<p>- Removed the colored buttons from all pages results in a more fluid and better graphics</p>\n<p>- Removed some kamikaze enemies for Level 3</p>\n\n<p>*Level 3 access is now available directly on the site.<br/></p>\n<p>Patch Notes 0.05</p>\n<p>- Created a new background for the menu page.<br/>- The background was also implemented on the credits page.<br/>- Implemented a new master ship model<br/>- Corrected the visualization of the lasers now when the ship is hit by an enemy bullet the bullets are created without any kind of problem.<br/>- Created a different model for when the ship is hit by the enemy bullets.<br/>- Corrected the order of the enemies now the map is better than the previous.<br/><br/></p>\n<p>* Correct, an error now the display of the projectile for the green enemy is created correctly before it was not displayed.<br/></p>\n\n<p>Patch Notes 0.04</p>\n<p>- Updated the correct number of enemies for level 1<br/>- Created level 2<br/>- Created red enemy with animation<br/>- Created celestial enemy with animation<br/>- Created Purple enemy with animation<br/>- Created the bullets for all 3 enemies <br/><br/></p>\n<p>*Level 2 access is now available directly on the site.<br/></p>\n\n<p>Patch Notes 0.03<br/></p>\n<p>- Implemented new buttons for the start page<br/>- Insert 2 different fonts on the start page<br/>- Fonts have been implemented and the buttons on the credits page<br/>- Inserted the energy bar on the game page<br/>- Inserted the life bar<br/>- When the bullets impact the ship with the life is climbed<br/>- Added animation for the main ship<br/>- Added animation for the blue ship<br/>- Added animation for the orange ship<br/>- Added animation for the Green ship<br/>- Added the score - Added wave<br/>- Explosions have been implemented for all enemies<br/>- Added the game over option</p>\n\n<p>Patch Notes 0.02<br/></p>\n<p>- Implemented the start page<br/>- The projectiles for the main ship have been implemented<br/>- Implemented the projectiles for the blue ship<br/>- Implemented the projectiles for the orange ship<br/>- Implement the keys to move right and left</p>\n\n<p>Patch Notes 0.01 <br/></p>\n<p>- The first basic spaceship was implemented<br/>- Created 3 enemies of different color</p>", "metacritic": null, "released": "2018-02-27", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/34a/34a0709e24e703ca50c42dbe5e0cbdaf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 96, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["LucaProject"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}