{"id": 188455, "slug": "chexshift", "name": "Chexshift", "name_original": "Chexshift", "description": "<p>From Ludum Dare #35:<br/>With Chexshift, I tried to make a chaotic chess game. With random phases throughout the game, it's kind of a luck based chess game. With absolutely no special effects or such. Because I am a total newbie! <br/><br/>With each phase, one type of piece on the whole board, morphs. Evolves into something else, something more powerful. Like a Giant or an Alien! <br/><br/>I have included a little info box in-game so that you don't have to figure out that Rook...I mean Giants now explode after the phase change :) How good of a developer I am! Also, Devil's Pawn is a pun. You see it's like devil spaw... Okay moving on! <br/><br/>Keep in mind that this is a compo game and I have done everything by myself. Except for the font, that's made by codeman38... And the game-icons.net helped with the phase icons because... I suck. And sounds are made by bfxr... Anyway, back to the game! <br/><br/>This was my second ludum dare and I feel like I am getting better at being sleepy and not doing anything that's worth the time :) <br/><br/>Thanks for playing! <br/><br/>PS: If the gif doesn't animate: http://gph.is/1SfhCjW <br/>PPS: I'm going to get some sleep and regret what I wrote here after few hours later. <br/>PPPS: There could be tons of bugs, since the essential hours that I spent my time on this was the logic and I am too tired to spend more time on it so, I'm sorry guys :) I tried my best this time though! <br/><br/>Edit: Yes, there is no check in this game since it is kind of a different and chaotic version of chess. If you can kill the king, you will win. No check or mate. (OFC it was intentional you shut up :P)</p>", "metacritic": null, "released": "2016-04-18", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/0a5/0a599f3f967a28fe504c74111e1fd855.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 34, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Tharky"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}