{"id": 188585, "slug": "ding-dong-pixel-box-cg", "name": "DING DONG (Pixel Box CG)", "name_original": "DING DONG (Pixel Box CG)", "description": "<p>Children love to play, this is not news to anyone.<br/>Now, a group of friends who live in a shantytown in Brazil launched the following challenge: Irritate the neighborhood! <br/><br/>The aim is to Lady Coroca, an old lady grouchy neighborhood resident.<br/><br/>They have to: ring the bell of her house and try to escape it up as far as possible in order to let her furious.<br/><br/>The scenario has very similar characteristics to the Brazilian peripheries, full of national reference, such as houses, cars, buses, cards, among others.<br/><br/>But it is easy to understand for any player in the world. The focus is that everyone can have the \"experience\" and feel how fun is the day to day of children in Brazilian peripheries.<br/><br/>The game has a help screen, so you go and learn all about the game.<br/><br/>-Run away as far as you can and compete the highest score among your Facebook friends and world ranking.<br/><br/>-Earn rewards every record sharing overcome.<br/><br/>-Collect coins to buy characters or enhance your gaming experience.<br/><br/>-Buy And from 8 characters with personalities and different soundtracks.<br/><br/>-Find The Magnet to attract more coins.<br/><br/>-Find The spring to increase the height of your jump and facilitate his escape.<br/><br/>-Find The multiplier to multiply your points.<br/><br/>-Multiply your points every game to achieve the highest position in the ranking.<br/><br/>-Have a good time to each character's collision with obstacles and share your gaming experience with your friends in various social networks.<br/><br/>-The game is available in languages: Portuguese, English, Chinese, Japanese, Korean, German, French, Spanish, Italian and Russian.</p>\r\nPLAY ONLINE NOW!", "metacritic": null, "released": "2017-07-04", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/22c/22c86465086955665279212b882d49de.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 228, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Pixel Box CG"], "genres": [], "publishers": [], "esrb_rating": null}