{"id": 188658, "slug": "100-speed-bumps-challenge-speed-breaker-bike-ride", "name": "100 Speed Bumps Challenge: Speed Breaker Bike Ride", "name_original": "100 Speed Bumps Challenge: Speed Breaker Bike Ride", "description": "<p>Speed bumps or breakers are used for road safety to force riders to ride carefully. Bikers are usually fond of high speed racing so bumps play a vital role to slow down the vehicle. They are specially designed to avoid accidents and crushed. If you drive fast on a bump it will be spontaneous jump. While driving on speed breakers two things save your vehicle on road are tiers and shocks. These two parts will absorb the maximum jump produce during fast driving on a bump.   <br/></p>\n<p>Racers! Are you ready to accept challenge to cross 100+ speed bumps on bikes? Yes, after developing consecutive speed bump car drive Switch Play is offering 100+ speed bumps Bike Rider. In this simulation game you have to cross maximum speed breaks on a bike. In bike games, you can test your driving skills and can improve road skills. <br/></p>\n<p>Now, it’s time to cross speed bumps with a motorcycle!</p>\n<p>In this bike riding simulator you have to complete 10 challenging levels. Number of bumps will be increase in upcoming level. 3 different heavy bikes help you to cross speed breaks in minimum time. Complete the levels in the given time and ride as fast as you can. <br/></p>\n<p>Game Features:<br/>•    3 different bike to choose (Racer, Adventure and Police bike)<br/>•    On screen accelerator, hand brake and right/left turn<br/>•    Nitro option to boost the speed<br/>•    On screen speedometer for high speed testing<br/>•    Exciting city environment<br/>•    100+ speed bumps<br/>•    On screen timer</p>\n<p>100+ Speed Bumps Bike Rider takes the endless simulation genre to the next level by adding better graphics and realistic bike sounds. Ride the bikes in the highway roads crossing the speed breakers, buy new bike to complete the levels. Download 100+ Speed Bumps Bike Rider game for free and enjoy endless fun of Moto riding. Do not forget to rate and review. We will highly appreciate your valuable feedback.</p>", "metacritic": null, "released": "2018-02-26", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/82f/82f32313def25938a0f53e89ddd28f26.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 103, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Switch Play"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}