{"id": 188720, "slug": "song-a-videogame-essay", "name": "Song: A Videogame Essay", "name_original": "Song: A Videogame Essay", "description": "<p>The other night I was thinking about games and how to go about analyzing them in an academic sense and through this I came to the idea of looking at games through the lense of an essay. My question was what is the thesis of certain games? What is the fundamental question that a game tasked itself with answering.</p><p>Thinking about Dark Souls in this manner me and a friend(who co-designed the game on this page and we'll get to that soon) came to the conclusion that Dark Souls is at a base level about overcoming overwhelming odds and gaining so much, but, becoming only more fearful because for everything you gain you have so much more to lose. To us that accurately represents the feeling, the thesis, of Dark Souls. From then we looked to Pong which is perhaps one of the most simple games ever created and yet it was more difficult to place our fingers on what it tries to accomplish. Of course we could simply dismiss the idea and proclaim that Pong was never made with any thought of a grandiose intention, but, we would be remiss as game designers to so foolishly end the discussion.</p><p>From our night long talk we made a game and It's my hope that it accurately represents what we believe to be at the heart of Pong. I encourage game designers to comment and continue the discussion. The game we made is by no means revolutionary, however, I think game design as a field is in sore need of this type of study. Think about this as more of an essay, a conversation, and less of a straight up game. And finally, thank you for playing and thank you for reading.</p><p>~Graham Dolle</p><p><strong>Credits:</strong></p><p>Graham Dolle: Coding, Art, Sfx, Design</p><p>Damon Streat: Design</p>", "metacritic": null, "released": "2015-12-01", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/d98/d98f25ad98c3ce25654fd6015c6893c7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 6, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Web"], "developers": ["Cbear Wallis"], "genres": ["Sports", "Educational"], "publishers": [], "esrb_rating": null}