{"id": 188766, "slug": "a-dying-city", "name": "A Dying City", "name_original": "A Dying City", "description": "<p>The fleshed out version of A Dying City after Ludum Dare 40 </p>\n<p>For now this page is to provide those who are interested a place to follow the game. I will make it public and further edit it once I have a build ready.</p>\n<p>For now keep an eye out for devlogs.</p>\n\n<p><strong>Controls</strong><br/>You can use WASD to move the camera, scroll in and out, right clicking will close whatever popup is up. If you need more info on the game please look at the original LD40 version. I'll have the page for this version updated eventually.<br/></p>\n\n<p><strong>How To Play<br/></strong></p>\n<ul><li>Each turn you may select an action for each district</li><li>Each action will effect the district in different ways.<ul><li>Making a drug deal will increase crimerate in the district but give you a temporary income boost.</li><li>Cracking down on drugs will reduce crimerate but will cost a lumpsum of money</li></ul></li><li>After the player has selected all the actions they want for the turn they can end the turn by pushing the button in the bottom right.</li><li>You will lose if you hit 0 money, or approval. Once either hit 0 you have 1 turn to get it back above 0 or else you'll lose.</li></ul>\n\n<p><strong>Plans</strong><br/></p>\n<ul><li>A LOT more overlays</li><li>More visual indicators</li><li>Procedural city generation  <ul><li>I've decided that this is to much work for to little reward. I may still add some randomization to the cities appearence</li></ul></li><li>Choose how many sectors you want to play with</li><li>Use unity remote settings for better balance tweaking<ul><li>Not to sure about this one, I probably wouldnt use it enough to be worth it but who knows</li></ul></li><li>Actions will be sorted into types and have different options that have different effects</li><li>Numbers and how they effect each other will be more transparent</li><li>More variables for each sector</li><li>Better structured code</li><li>3D</li><li>Animated city with little people and cars<ul><li>This is not a priority feature but I think it'd be a nice way to bring the city to life and provide more visual indicators. It should be able to be turned off.</li></ul></li><li>A city editor where you can build your own city<ul><li>Also not priority. Would be nice though</li></ul></li></ul>\n<p>I can't really guarentee everything on the list will make it into the final product, but they are all things I'd like to add. I'll be making this page public once I have a working build out. If there's enough demand and I can create a Trello too.</p>", "metacritic": null, "released": "2017-12-15", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/403/403d762a2e33953366cb577d8066d59f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 16, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["minimurgle"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}