{"id": 18881, "slug": "meld", "name": "Meld", "name_original": "Meld", "description": "Meld is a mind-bending puzzle game featuring 200+ levels and a build-in editor so you can create your own and play levels made by others!  Master dozens of powerups and layers of strategy to make your way through each level. Meld features a build-in tutorial system which makes learning the rules and strategy simple!<br/><br/>Objective &amp; Gameplay<br/>Meld features an incredibly simple set of controls. Click to move or drag elements (tiles) around the gameboard to to create a path of like-colored elements between the starting and ending terminals.  If the terminals are yellow, then a yellow path must be created.<br/><br/>Like-colored elements can be stacked on top of each other, and certain colored elements can be melded together to produce new colors.<br/><br/>Melding<br/>Combining elements of different colors in called melding. Primary color elements (Red, Blue, and Yellow) can be melded together to create secondary colors.<br/><ul> <li>Red + Blue = Purple<br/> </li><li>Blue + Yellow = Green<br/> </li><li>Yellow + Red = Orange</li></ul><br/>Powerups<br/>As you progress in Meld, completing levels becomes much more difficult than simply creating a path. Powerups provide an added layer of strategy while increasing the depth of the game!  Below are some of the powerups you'll find in Meld. Each powerup will unlock at a certain level.<br/><ul><li><strong>Antimatter</strong> - Changes the color of any element or element stack to its opposite color.<br/></li><li><strong>Board Tile</strong> - Places an empty tile on the board at a selected location.<br/></li><li><strong>Asteroid</strong> - Destroys an element and its binding. If used on an unbound element or empty bound tile, a placeable tile is awarded.<br/></li><li><strong>{Color} Comet</strong> - Shoots out from a specified tile performing a single {color} meld on all valid elements it touches. (There are six colored comets: Blue, Green, Orange, Purple, Red, and Yellow.)<br/></li><li><strong>Meteor</strong> - Destroys the binding on a selected tile or an element on an unbound tile.<br/></li><li><strong>Pulsar</strong> - Destroys all unbound elements in a straight line away from a specified tile.<br/></li><li><strong>Solar Flare</strong> - Changes the color of any element or element stack to any other color.<br/></li><li><strong>Worm Hole</strong> - Connects two non-adjacent tiles and allow them to act as if they were connected.<br/></li><li><strong>Superconductor</strong> - Occupies a single, empty tile and allows any color conduit to pass through it.<br/></li><li><strong>Meteor Shower</strong> - Destroys the binding or unbound element on a selected tile and all six surrounding tiles.<br/></li><li><strong>Planetoid</strong> - Destroys an element and the tile that holds it or a bound element and its binding. All surrounding, unbound elements are also destroyed.<br/></li><li><strong>Fusion</strong> - Fuses any two elements of a different color producing special results.<br/></li><li><strong>Black Hole</strong> - Occupies a single tile plus all six surrounding tiles and devours anything that enters the black hole.<br/></li><li><strong>Dark Energy</strong> - Pushes all surrounding elements one tile away. Element collisions will create a fusion.<br/></li><li><strong>Dark Matter</strong> - Pulls all surrounding elements two tiles away in one tile. Element collision will create a fusion.<br/></li><li><strong>Supernova</strong> - Blasts out in all six directions destroying any element it hits then performs a meld on each tile according to its color.</li></ul><br/>Level Editor<br/>Meld features a user-friendly, built-in level editor where you can create, test, and publish your own custom levels. Once a level is published, it can be played by others who can rate the quality and difficulty of the level! See how your level compares to others that have been made!", "metacritic": null, "released": "2016-05-11", "tba": false, "updated": "2019-08-28T22:09:33", "background_image": "https://media.rawg.io/media/screenshots/055/0552629fa247e64f33d3d3e516f0f17e.jpg", "website": "http://meldgame.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 23}, "playtime": 4, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 239, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC", "Linux"], "developers": ["Axis Games"], "genres": ["Strategy", "Indie"], "publishers": ["Axis Games"], "esrb_rating": null}