{"id": 18886, "slug": "overlord-2", "name": "Overlord II", "name_original": "Overlord II", "description": "<p>This sequel to the comic dark fantasy Overlord allows the player to have fun being evil. You play as the dark Overlord who leads his armies of minions against the human Glorious Empire (which obviously mimics the real-world Roman Empire). The Glorious Empire is not &quot;good&quot; anyway: its leaders are trying to eliminate all magic users, so the &quot;evil&quot; motivation is quite justified. However, to accomplish his conquest and become a truly powerful and feared dark lord, you will have to commit some really vile deeds. One of your first missions, for example, involves slaughtering baby seals.<br />\nThe game follows the Overlord from his childhood, as he grows from a nasty kid to a mighty dark knight that looks a lot like Sauron as shown in The Fellowship of the Ring movie. The Overlord begins his conquest with a pack of goblins and a single troll, but over time his minions will develop into more powerful and deadly creatures and attack the enemy in large hordes. The game does not turn into a strategy, however, as you still only directly control the dark lord himself, and the minions are commanded through his orders.  Overlord II is famous for its humor: the game does not take itself too seriously. There are all sorts of puns and parodies on the stereotypical villains and other fantasy tropes, such as elves and fairies. Goblin minions squeak, cringe and fall, while playful Danny-Elfman-esque music is echoing in the background.</p>", "metacritic": 79, "released": "2009-06-22", "tba": false, "updated": "2024-03-13T20:50:28", "background_image": "https://media.rawg.io/media/games/bfb/bfb2bf7a0413443b1fcf0be7c3244053.jpg", "website": "", "rating": 3.76, "rating_top": 4, "added_by_status": {"yet": 201, "owned": 3011, "beaten": 248, "toplay": 43, "dropped": 158, "playing": 4}, "playtime": 2, "achievements_count": 82, "ratings_count": 359, "suggestions_count": 685, "game_series_count": 4, "reviews_count": 359, "platforms": ["Xbox One", "Xbox 360", "PC", "macOS", "Linux", "PlayStation 3"], "developers": ["Triumph Studios", "Virtual Programming"], "genres": ["Action", "RPG"], "publishers": ["Codemasters"], "esrb_rating": "Teen"}