{"id": 188995, "slug": "christmas-special", "name": "Christmas Special!", "name_original": "Christmas Special!", "description": "<p>English:</p>\n<p>Hello every body and welcome to my christmas special!</p>\n<p>It's a little strange and doesn't exactly work the way you think it would about the story.</p>\n<p>I'm not gonna say what i meant with the sentence just above, but if your playing my game you must have already found out what i meant.</p>\n<p>The short game with seven ends is playing around a few kids from my story and a buddy (go to my youtube page, link down below) and that their tree for christmas vanished.</p>\n<p>Now it's up to you, to find out where the tree is, but keep in mind that this is a really strange game.</p>\n<p>Have Fun</p>\n<p>GSB</p>\n<p>youtube: https://www.youtube.com/channel/UCsuFPgA9hVdKrLtgXI9xr9g?view_as=subscriber</p>\n\n<p>Deutsch:</p>\n<p>Hallo alle mit einander und Willkommen zu meinem Weihnachte Special!</p>\n<p>Es ist an sich etwas komisch und funktioniert nicht so wie man es auf den ersten blick denkt von der Geschichte her.</p>\n<p>Ich werde jetzt nicht erklären was ich mit dem Satz dadrüber gemeint habe, aber wenn ihr das spiel schon gespielt habt müsstet ihr versteht was ich meine.</p>\n<p>Die kurze Geschichte mit sieben Enden, handelt von einigen Kinder aus meiner Geschichte und einem Kumpel (geh zu meiner youtube seit, der link ist oben) und deren weihnachts Baum ist verschwunden.</p>\n<p>Nun ist es an dir, heraus zu finden wo der Baum ist, aber denk immer daran das dies ein sehr komisches Spiel ist.</p>\n<p>Have Fun</p>\n<p>GSB</p>", "metacritic": null, "released": "2017-12-22", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/c17/c17b5511d5ef1fcc2d37eba02265ff35.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 100, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Yasmin"], "genres": [], "publishers": [], "esrb_rating": null}