{"id": 189095, "slug": "witch-rpg", "name": "Witch RPG", "name_original": "Witch RPG", "description": "<p>Class project for https://www.udemy.com/unityrpg made in November 2017<br/>Scroll to the bottom of this page to get downloadable versions of this game for PC and OSX.<br/><br/>Known Concerns:<br/></p><p>- low frame-rates seem to lead to really weird movement.... RIP<br/>- ability buttons are not clickable so hotkeys must be used<br/>- if playing the web version, it is recommended that you use the full-screen button</p>\n<p>Story:<br/>The evil king has taken over your quiet village and driven away all the witches, with only the non-magical townsfolk allowed to remain. As the last witch remaining you must fight your way past the king's men and retrieve your magical staff before you will be able to brave the king's evil power.</p>\n<p>Player Manual:</p>\n<p>You may press the escape button at any time to leave the desktop version of the game.</p>\n<p>Click on the ground to move to the clicked spot.</p>\n<p>This is the main game screen, it is what you'll be using throughout the game.<br/><br/><br/>Sometimes you will come across peaceful townsfolk, they will often give helpful advice.<br/><br/><br/>This is your health indicator, once it hits zero it's game over. When it is full you have 360 health points.<br/></p>\n<p>This is your energy indicator. Energy is expended while using your special abilities but regenerates over time. You have 100 energy points when the globe is full.<br/></p>\n<p>When your mouse is positioned over an enemy it will change to have the appearance of a sword, when this happens you may click the left mouse button the enemy to attack them.<br/><br/><br/>This is your power attack, it is activated when you move your mouse over an enemy and click the right mouse button. It takes 20 energy and instantly deals significant damage.<br/><br/><br/>This is your explosion ability, It damages all enemies within 5 meters for minor damage at the cost of 25 energy. This ability is useful for taking out large swarms of little enemies.<br/>You activate this ability by pressing the \"1\" button on your keyboard.<br/><br/><br/>This is your healing ability, it heals you for 75 health and costs half of your energy.<br/>You activate this ability by pressing the \"2\" button on your keyboard.<br/></p>\n<p>Sometimes you will find weapons that will increase your power and allow you a better chance at survival. Walk over it to automatically equip it.<br/><br/><br/>Across the bridge and over the water lies a castle where the evil king has taken the queen hostage. But beware, you will need your magic staff to prevail!<br/><br/><br/>It is said that the magic staff can be found in the enchanted woods...<br/><br/><br/></p>\n<p>Credits:<br/>Student: Alice Robinson<br/>Programming Teacher: Ben Tristem<br/>Game Design Teacher: Rick Davidson<br/></p>\n<p>Assets are a mix of asset store assets and some provided by the class.</p>", "metacritic": null, "released": "2017-11-11", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/f5e/f5edbb8a49f19ae7c6322e2cb2847382.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 161, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Web"], "developers": ["Valkrysa"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}