{"id": 18910, "slug": "oese", "name": "OESE", "name_original": "OESE", "description": "OESE is about your little ship, traveling alone through space trying to survive as best as it can to find a new home. Along the journey you come across different encounters with different outcomes depending on your decision. You can either try a passive approach if you're feeling peaceful, you can try to contact or trade with whatever oddity you've crossed paths with or you can go full offensive and fire a missile to try and steal their power! <br/><br/>​OESE is about decisions and consequences.Features<ul><li>Over 100 different encounters with different outcomes. <br/></li><li>7 races and 4 factions that will love you and aid you on your way. <br/></li><li>7 races and 4 factions that will hate you and send bounty hunters out to kill you. <br/></li><li>20 in game achievements<br/></li><li>Delicious pixel art and original soundtrack.<br/></li><li>Customizable ship so you can look nice. <br/></li><li>The omnipresent impending doom of the indestructible Nox Cubes.<br/></li><li>A friendly companion to keep you company.</li></ul><br/>The game is very relaxing and turn-based, allowing you to take your time and enjoy the journey of space (or panic if your power is running low.) If you're in the office or classroom and it's one of those long days that never seem to end then it's rather nice having a little ship to watch over while you get on with your work.", "metacritic": null, "released": "2016-06-14", "tba": false, "updated": "2019-08-28T22:09:32", "background_image": "https://media.rawg.io/media/screenshots/deb/deb77675f029893c5e47d5b82897e399.jpg", "website": "http://www.oesegame.co.uk/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 127}, "playtime": 3, "achievements_count": 20, "ratings_count": 1, "suggestions_count": 94, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Alec Smith", "Dane Winn"], "genres": ["Simulation", "Indie"], "publishers": ["Milo Games"], "esrb_rating": null}