{"id": 189222, "slug": "cursed-princess", "name": "Cursed Princess", "name_original": "Cursed Princess", "description": "<p>My LD#41 game, you play as a cursed princess who recruits people and stuff.</p>\n<p>Number keys or QWE ASD ZXC can be used to select options</p>\n<p>Current stamina costs and mana gains:<br/>Name, Stamina cost, Princess's stamina cost, mana gain, carry cost<br/>Knight -10,-10, 10, 20 Balanced<br/>Dog -10, -15, 15, 40 Not a good carrier<br/>Elf -20, -10, 20, 35 High mana for the stamina it costs you<br/>Beggar -5, -5, 5, 30 All around low costs and benefits except for carrying<br/>Artist -20, -10, 10, 25 just as good as knight for you but weaker otherwise<br/>Warrior -5, -10, 5, 15 Bad stamina to mana rate for you but good for him also great carrier<br/>Mage -25, -5, 20, 30 best stamina to mana rate for you but worst for him<br/>Golem -5, -30, 10, 10 terrible stamina to mana for you but the best carrier<br/>(probably should have listed these somehow in the game but I'm not sure how necessary they are since even I only remember what they are just vaguely)</p>\n<p>Choosing where to go has no effect on party members opinion of you. </p>\n<p>changelog:</p>\n<p>v7 Stat changes made by the last action are now shown next to the stats, message log added(use on screen buttons or press H or L to open, wheel or PgUp and PgDn to scroll and Ctrl+ Ctrl- to change font size) easy difficulty added(add \"?diff=easy\" to the url to use), button sounds, feedback and icons, numpad keys can now be used and finally fixed some bugs that made it easier to get a gameover.</p>\n<p>v6 Probably fixed issue that could make the curse removal impossible.</p>\n<p>v5 Endings!(Probably last version before LD ends)</p>\n<p>v4 Supplies and gold are things and now locations matter outside of just recruiting, background graphic updates more suitably</p>\n<p>v3 Carrying is more expensive, mana costs and some stamina costs are shown, prevented Princess from getting obviously bad options in some choices, Princess can recover stamina using mana if necessary. Princess can watch over everyone if no one else can do it.</p>\n<p>v2 Traveling and recruiting should work now and you'll nearly always be able to get someone to carry you.</p>", "metacritic": null, "released": "2018-04-22", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/8fb/8fb6fd9ca33878896b39a6bf404adfa2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 13, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Unentokku"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}