{"id": 189516, "slug": "president-race-vote-to-crash", "name": "President Race: Vote to Crash", "name_original": "President Race: Vote to Crash", "description": "<p>The US elections have just gone dirty and the presidential candidates are taking each other out on the streets….in their campaign coaches. It is time for you to help your favourite candidate, annihilate the competition and claim the Oval Office!</p><p>This high-octane racing game will put you behind the wheel of the campaign bus of your number one presidential candidate. Always wanted to fire Donald Trump, crack Bernie Saunders' left wing dreams or punish Hilary Clinton for leaking those sensitive emails. Now is your chance! Democracy is over, it is time to put the pedal to the metal in this political race and park that bus in front of the White House!</p><p>The game is controlled with intuitive one-touch controls, but you will need to keep your head together to navigate through heavy traffic. Home in on the rival's team national anthem and collect precious power-ups and health pick-ups along the way. Catch up to the enemy coach and ram it off the road to become the next President of the United States of America!</p><p>Fair play?<br/>With each successful takedown money is earned which can be used to upgrade your campaign coach. The bus can be reinforced with a heavily armoured grille to increase crash resilience and ramming effectiveness, while aerodynamic upgrades will improve the vehicles' handling and top speed. Credit will give you the opportunity to upgrade your bus and rule the nation!</p><p>Put enough money on the table for your presidential campaign<br/>Other customization options include adapting the carriages' rims and colours. Furthermore, it is possible to add and change neon lighting underneath your bus. Score enough votes (crashes) to become the next number one politician of the USA.</p><p>Election forecasting<br/>The game's data will be used to forecast the presidential race based on how many times players choose a certain candidate in-game. It will be interesting to see if these numbers are close to reality. We will keep you updated on the standings on our social media channels</p><p>KEY FEATURES<br/>* High speed racing with intuitive one touch controls <br/>* Includes all republican and democratic presedential candidates <br/>* Flick and tap the bus to change lanes<br/>* Adapt and personalise your bus to suit your new-found unsportsmanlike and undemocratic lifestyle <br/>* Stunning fast paced 3D visuals <br/>* HD graphics<br/>* Collect bus parts and customization options, no in-app purchases required<br/>* More arcade racer then simulator game</p><p>NB<br/>* Ted Cruz is still in this version and will be patched out during the next update</p>", "metacritic": null, "released": "2016-07-04", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/c64/c6465b563ed11c3c50fd5f48b454a6fb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 167, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Buff Games"], "genres": ["Racing"], "publishers": [], "esrb_rating": null}