{"id": 18969, "slug": "swanky-paint", "name": "Swanky Paint", "name_original": "Swanky Paint", "description": "A modern Deluxe Paint tribute built using our open source game engine, Gamecake.It is a perfect tool for creating pixel art and animation.<br/><br/><br/>Deluxe Paint is a well designed bitmap graphics editor from the 80s that ran on the Commodore Amiga.<br/>To this day, we still find it the best package out there for its purpose and we have yet to find anything close to it in terms of usability and design. We have tried other pixel editors but still keep coming back to an old copy that we still use every now and then for our games. <br/><br/>However, as times goes by, we find an increasing need for an actual replacement that is not only up-to-date but more importantly, cross platform (Linux/Win/Raspi/Android/Mac). So here is our attempt at recreating our favourite paint package for today's generation of pixel artists. <br/><br/>It should be noted that this is currently in active development so will contain bugs.<br/><br/><br/><br/><br/><strong>Features: </strong><br/><ul> <li> Runs on Linux, Raspberry Pi, Android, Windows &amp;amp; Mac<br/> </li><li> <strong>Deluxe Paint shortcuts</strong><br/> </li><li> Escher modes : Hexels, non-Euclidean, strange geometry + more<br/> </li><li> Bloom shader options<br/> </li><li> Full resolution background image for tracing and referencing<br/> </li><li> Simple animation frames<br/> </li><li> Multiple Layers support<br/> </li><li> Spritesheet support<br/> </li><li> Animation exports to GIF and APNG<br/> </li><li> GIF and APNG import to frames<br/> </li><li> Popular colour palettes - C64, Spectrum, NES, Gameboy, MSX, AppleII, EGA, Swanky16, Swanky32<br/> </li><li> Manual PDF that includes one-page shortcut pullout<br/> </li><li> Support for UV mapping preview on to low poly 3D model</li></ul><br/>These are some of the features that are already included in the current version. We are still adding more during development.<br/><br/><br/>Swanky Art, a new kind of pixel art community.On International Amiga Day 2014, we released Swanky Art, a pixel art community based on daily challenges that restricts your palettes, dimensions and filters.<br/><br/><strong>Our aim is to fully recreate the restrictions of the past, teaching attribute clash to a new and terrified generation.</strong><br/><br/><br/><br/>Built in lua using our open source engine, GameCake.", "metacritic": null, "released": "2016-06-08", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/180/1800e7d2e4250b3c2c67e223f85cfca5.jpg", "website": "http://paint.wetgenes.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 241, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC", "Linux"], "developers": ["Wetgenes"], "genres": [], "publishers": ["Wetgenes"], "esrb_rating": null}