{"id": 18978, "slug": "mechrunner", "name": "MechRunner", "name_original": "MechRunner", "description": "MechRunner is an endless action game that casts you as a powerful mech in stunning cinematic battles against a relentless robotic army.<strong>Game Story</strong>On June 30th, 1908 a mysterious explosion took place over the Tunguska River in Siberia, Russia that wiped out trees and wildlife for over 800 square miles. To this day it remains the largest “impact event” in our planet’s recorded history. <br/><br/>In the years that followed, dozens of scientific expeditions to the site attempted to explain the disaster but failed to come to any conclusions. In the mid-1940s however, a team of scientists from the Russian secret service visiting the site stumbled upon the wreckage of an alien spacecraft containing technology that far exceeded our own. In the years that followed, the KGB set to work harnessing this mysterious new power source and created a new secret weapons program - The Division of Advanced Weaponry or \"O.S.O.\"<br/><br/>They thought they could control the new power they’d discovered, but it began to do more than run their machines. It began to drive the men working on it mad. The man in charge of the O.S.O., General Yuri Petrakoff, seemed particularly affected and on April 14th, 1949, Petrakoff launched a full scale assault on Europe.<br/><br/>One of Petrakoff’s lead engineers, Jesper Teterev, went AWOL and left the program early, wary of what was happening there. He went to live in secret with his sister, Isabel and niece, Allison. While in hiding however, Jesper (with the help of budding engineer and pilot Allison) was busy building his own mechanized war machine, called the XP-41, certain it may be needed one day to stave off the O.S.O.'s evil creations. He was right.<strong>Gameplay</strong>MechRunner is an endless-style action game mixed with fast and furious mode-changing mech action!<br/><br/>It is a \"runner\" in that the player is constantly moving forward while tracking down lethal O.S.O. forces but what makes it special is that you’re piloting a giant robot capable of some serious destruction! Other endless runners feature action elements, but none like this. Heat seeking missiles, heavy caliber bullets, laser cannons, and concussion bombs meet destructible buildings, debris littered streets, and tons of slice-able enemies to create a fast paced, visually stunning experience!<br/><br/>A typical game may take anywhere from a few seconds to several minutes to play. The higher your skill, the longer the game, the more rewards you will collect, and the more content you will unlock!<strong>Features</strong><ul><li>Meticulously detailed, fast-paced action<br/></li><li>Switch between Tank and Robot modes on the fly<br/></li><li>Slice &amp; Dice disabled enemies in cinematic fashion!<br/></li><li>Extensive arsenal of weapons, customizations, and power-ups<br/></li><li>3 unique environments that blend seamlessly together - you decide when it's time to switch<br/></li><li>Procedurally generated levels for endless variety<br/></li><li>Numerous enemy types with different tactics<br/></li><li>Epic boss battles!<br/></li><li>Dynamic environmental obstacles<br/></li><li>Unlockable skins, upgrades, and achievements<br/></li><li>Rescue civilians and escort them to safety<br/></li><li>Amazing Hollywood quality soundtrack<br/></li><li>Optional controls - play with a mouse or controller</li></ul>", "metacritic": null, "released": "2016-07-15", "tba": false, "updated": "2019-08-28T22:09:30", "background_image": "https://media.rawg.io/media/screenshots/12f/12f3faffe726b9e13fbef43f24888c64.jpg", "website": "http://www.mechrunner.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 37, "dropped": 2}, "playtime": 3, "achievements_count": 15, "ratings_count": 2, "suggestions_count": 589, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC", "PlayStation 4", "Linux", "macOS"], "developers": ["Spark Plug Games"], "genres": ["Action"], "publishers": ["Spark Plug Games"], "esrb_rating": null}