{"id": 189712, "slug": "my-horse-show-race-jumping-challenge", "name": "My Horse Show: Race & Jumping Challenge", "name_original": "My Horse Show: Race & Jumping Challenge", "description": "<p>Live the dream of owning of horse stable and prepare your horse for horse stunts, horse derby with horse show jump simulation game 3D. In this My Horse Show: Race &amp; Jumping Challenge, starts from horse stable with variety of beautiful and fast racing horses, german &amp; Arabian horses included. My horse games and horse show jumping games were never been so amazing. Horse derby and quest based racing and horse stunts with horse jumping challenge has hours of gameplay. You will surely enjoy this horse race game 2018. Perform ultimate horse stunts and start horse jump show and hop on your majestic steed and race into victory. Enjoy the best derby quest 2018, horse stunts and jump simulation action in 3D gameplay.</p>\n<p><b>Ultimate Fun of Horse Racing &amp; Horse Riding:</b></p>\n<p>In horse racing games 2018 reach for the finish line as you jump over hurdles in Horse race and horse show jump 3d simulator. Enjoy horse riding and racing, pick your own beautiful steed and knock down all rival and foes and win the championship in this horse racing. The derby quest 2018 of horse racing has been started. Let’s start horse riding in horse stable games and remember cleaning of your horse stable is important for horse breeding. Choose your favorite stallion and race towards the winning with loads of ultimate challenges against your horse racing foes. Play and run for real horse stamina jump carefully from the hurdles. Lets’ see how will you be capable of riding your stallion to dodge and jump over the obstacles in the fierce horse race competitions with our horse race game 2018. This is most realistic &amp; best horse rush game you have ever played.</p>\n<p><b>Horse Stunts Mode in Horse Jump Game:</b></p>\n<p>Exciting show jumping events are waiting for you with lots of horse stunt racing with horse show games. Perform skilled leaps with jumping and stunts with your mare. Trying obstacles stand in your way and every horse stunts mission will be difficult and you have to gain more scores to unlock fast horse to compete in horse show of jumping and stunt racing. Jump through hoops and over hurdles with power in limited given time. My horse show has ultimate 3D horse racing and Arabian horse stunts fantasy environment. Experience the riding your stallion to dodge and jump over the obstacles in the horse race games. Enjoy the adventure game of horse racing games 3d 2018! Play like a rider and feel you have the horses in real life.</p>\n<p><b>More Features in My Horse Show: Race &amp; Jumping Challenge:</b></p>\n<p>✓ Different fast Arabian horses to unlock to ride during the horse racing competition.<br/>✓ Take a part of derby quest 2018 with horse racing &amp; jump challenge simulator 3d.<br/>✓ Exciting obstacle, hurdles and horse stunts challenges in horse jump game.<br/>✓ Realistic 3D horse jumping championship with horse riding &amp; horse racing competitions.<br/>✓ Awesome 3D graphics &amp; sound effects with HD horse animations.<br/>✓ Ultimate races &amp; jump challenge in 3D stunt arena or derby racing stadium.</p>\n<p>My horse jump show simulation with horse stunts racing is here with amazing horse derby and racing quests in my horse games. It’s time to forget other horse show jumping games or horse racing games 3d and play this My Horse Show: Race &amp; Jumping Challenge! Face the realistic obstacles, horse jumping and wild horse racing with multiple horse stunts and stunt racing championship.</p>", "metacritic": null, "released": "2018-04-30", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/a00/a004d2ee33ac31981018828443c19446.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 190, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Tap2Ride"], "genres": ["Simulation", "Racing"], "publishers": [], "esrb_rating": null}