{"id": 1897, "slug": "mr-particle-man", "name": "Mr. Particle-Man", "name_original": "Mr. Particle-Man", "description": "From the creator of the critically acclaimed iOS game Ms. Particle-Man comes the eagerly anticipated and enigmatically titled sequel, MR. PARTICLE-MAN.<br/><br/>Remember the fun, fast-paced, and brutally difficult classic arcade gameplay from Ms. Particle-Man? No? Well, Entertainment Weekly called the game &amp;quot;a snappy delight that takes you back to a bygone era when games weren&amp;#39;t trying to be literary or cinematic.&amp;quot; Ring any bells yet? The Verge raved that it was &amp;quot;challenging, unforgiving, and quite satisfying.&amp;quot; The Onion AV Club gave the game an A rating, saying that the game &amp;quot;creates a rich world with just a few pixel strokes.&amp;quot; On the flip side, some dude on iTunes said that it &amp;quot;gets tiring and stops being fun,&amp;quot; but what does he know?<br/><br/>Mr. Particle-Man massively expands on the original winning formula with all new levels, new challenges, and new power-ups. You control the eponymous little hero as he bounces around like a mustachioed pinball, avoiding deadly obstacles, dashing past enemies, and doing battle with challenging bosses. The deceptively simple core gameplay mechanics are explored in increasingly creative and complex ways across more than 100 colorful levels. There&amp;#39;s a surprising amount of depth in this humble little package.<br/><br/>* * * * * * * * * * * *<br/><br/>KEY FEATURES<br/><br/>- Over 100 unique and colorful levels<br/>- Nonstop retro action<br/>- Challenging boss fights<br/>- Awesome power-ups<br/>- Responsive and intuitive touch controls: NO clunky on-screen buttons<br/>- Beautiful chiptune soundtrack<br/>- Gentle difficulty curve culminating in seriously satisfying challenges<br/>- Universal App: Play on your iPhone, iPad, iPad Mini, and iPod Touch<br/>- Game Center achievements and leaderboards<br/>- Full iCloud support: Your save data syncs seamlessly across all your devices<br/>- No advertisements or IAP<br/>- iOS 5+ support<br/><br/>* * * * * * * * * * * *<br/><br/>PRAISE<br/><br/>&amp;quot;Satisfyingly challenging. The gentle difficulty curve means beginners are welcome, but seasoned gamers are the guests of honor.&amp;quot;<br/>- Phil Bass, creator of the IGF-nominated masterpiece Shriner Kart<br/><br/>&amp;quot;Clearly built from the ground up for touchscreens. Responsive and intuitive controls that (refreshingly) don&amp;#39;t need a word of explanation. Best of all: No clunky on-screen buttons.&amp;quot;<br/>- A.S.S., Area Donkey Kong high score holder<br/><br/>&amp;quot;Gloriously designed for maximum flow. No plodding exposition or pointless tutorial screens. Each level flows instantly into the next, so once you start, the retro action is nonstop.&amp;quot;<br/>- GADD, Gamedevs Against Drunk Developing<br/><br/>&amp;quot;A beautiful chiptune soundtrack composed from scratch by the incredibly talented surasshu.&amp;quot;<br/>- Hero &amp;quot;Coxa&amp;quot; Tanaka, award-winning game soundtrack composer<br/><br/>&amp;quot;An unobtrusive in-game messaging system dubbed &amp;#39;The ParticleBoard&amp;#39;, inspired by Dark Souls, allows you to communicate with other people playing the same level as you. Share your thoughts, get hints for tough levels, and boast about your skills on the ParticleBoard, all using iOS&amp;#39;s native Twitter integration.&amp;quot;<br/>- Howard Phillippe, Nintendoo Power Magazine<br/><br/>&amp;quot;Game Center leaderboards and achievements, iCloud save support, and no advertisements or IAP. This is gaming done right on iOS.&amp;quot;<br/>- Picobots, Developer of the iOS smash hit Mr. Particle-Man<br/><br/>* * * * * * * * * * * *<br/><br/>CONNECT<br/><br/>Official website: http://picobots.net/games/mr-particle-man<br/>Official trailer: http://vimeo.com/108909254<br/>Twitter: http://twitter.com/picobots", "metacritic": null, "released": "2014-11-06", "tba": false, "updated": "2019-10-22T14:27:53", "background_image": "https://media.rawg.io/media/screenshots/077/077d238b2a324c338ec4be8fc388fe5c.jpeg", "website": "http://picobots.net/games/mr-particle-man", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 19, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Michael Falk"], "genres": ["Adventure", "Arcade"], "publishers": ["Michael Falk"], "esrb_rating": "Everyone 10+"}