{"id": 18988, "slug": "the-mind-hero", "name": "The Mind Hero", "name_original": "The Mind Hero", "description": "The Mind Hero is a unique comic/anime style visual novel which subtly teaches actual psychology within the story, allowing you to enter the minds of eight individuals to fight their traumas with them, while also everything you would expect from a great action dating sim. Built with usefulness reaching beyond mere entertainment, it will also be free.<br/>\n<br/>\r\nColven, 17, is a high school student and the only male in his 6-member psychology class. During a lesson one day, a guest offers the group the chance to help test his breakthrough mental health research, allowing Colven to enter the minds of the girls and others. They all relate stories of their past traumas, and Colven is eventually convinced to help.<br/>\n<br/>\r\nWhether in or out of the minds, everything is done through choices, resulting in thousands of options both for bonding with the characters and defeating their traumas. This makes for a great mix of both romance and action, with nothing to make story and fighting feel like two different modes as it would in standard games; it all flows together. You'll experience all this in the midst of beautiful music &amp; high-quality comic-style visuals, and more importantly, learn something about what makes us think and act the way we do-- knowledge which will prove invaluable both in understanding yourself and the people around you every day. <br/>\n<br/>\r\nCheck out the game intro right from your PC's browser: Click \"Visit the website\" at the right.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T22:09:29", "background_image": "https://media.rawg.io/media/screenshots/4ca/4cae6fde65969c98477c131110b8dbed.jpg", "website": "http://www.themindhero.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 211, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["themindhero.com"], "genres": ["RPG", "Simulation", "Casual", "Indie"], "publishers": ["themindhero.com"], "esrb_rating": null}