{"id": 18994, "slug": "bloodlust-shadowhunter", "name": "BloodLust Shadowhunter", "name_original": "BloodLust Shadowhunter", "description": "BloodLust is a present-day Dungeon Crawler where players will journey into the depths of darkness searching for a great evil, while struggling to decide whether to destroy or embrace their Kindred family.<br/><br/><br/><br/>The last member in a coven of \"ShadowHunters\" find themselves resurrected into a lost city terrorized by the all-powerful \"Emperor\" Ranior, a monstrous vampire lord. <br/><br/>Haunted by visions of darkness and tormented by their ghosts from the past, the hunters struggle daily, though they always continue to move forward. <br/><br/>With each victory they grow stronger, increasing bloodline and skills in the \"Dark Arts\", but all at the cost of their humanity. With each new bloodline, they find themselves turning more into the vampiric monsters they were resurrected to destroy. <br/><br/>In the end, their great power will be challenged only by themselves, as they will have to face the source of their own immortality and decide whether to embrace the darkness or destroy it...   <strong> What Would You Choose?</strong>Gameplay-----------------------<br/><br/>Bloodlust is a huge \"Dungeon Crawler\" style game where your character (a Warrior, Thief, or Witch) will explore extremely deep dungeons, passages, asylum basements, tunnels, sewers, and caves in search of secrets, traps, and rare loot, all while battling various enemies and creatures in order to uncover the truth behind a dark society.<br/><br/><ul><li>- Play as a Male or Female Vampire with Classes Including Witch, Thief or Warrior<br/></li><li>- Sire Others with your \"Embrace\" to Build your Family of Minions<br/></li><li>- Learn and Increase Vampire Disciplines, Skills, Talents and Attributes<br/></li><li>- Dynamic Loot and Procedurally Created Areas Create Infinite Replay-ability<br/></li><li>- Non-Linear World Allows Players to Follow Their Own Path and Quest Goals</li></ul>Key Features-----------------------<br/><br/><ul><li> <strong>Bite and Sire Others to Join Your Family</strong><br/>Create a family where each member can help you gain experience, find loot, or sire others.  Communicate and control with your members telepathically to use their growing strengths along with your disciplines to achieve victory amongst the Kindred rivals.<br/><br/></li><li> <strong>Procedurally Generated Areas</strong><br/>Explore and 'crawl' through vast dynamic dungeons, caves, passages and sewers with multiple floors delving deeper into darkness while searching for ever increasing valued loot, treasures and powerful weapons.<br/><br/></li><li> <strong>Grow Your Bloodline</strong><br/>Using talents, disciplines and attributes, you decide how to grow your character from a weak fledgling into a powerful Vampire, capable of leading an entire faction of Vampires.<br/><br/></li><li> <strong>Vampire Disciplines</strong><br/>Join rival clans to earn reputation while learning each group's unique skill set. The choice is entirely yours to either stay loyal or backstab, bluff, and lie while creating chaos from inside the clan's political hierarchy. <br/><br/></li><li> <strong>Non-Linear Story and Gameplay</strong><br/>Hidden from light, this Dark City is yours to uncover and explore however you desire.  Hide in the shadows, while traveling underground or interact with factions directly under their noses using the art of the embrace, seduction and persuasion to mask where your true loyalty lies. Your decisions can affect dialog choices or avoid quest outcomes entirely.  <br/><br/></li><li> <strong>Dynamic Loot From the Fallen Kindred</strong><br/>With a bloodline that dates back over 3000 years it is not inconceivable that a few valuable items, from the fallen kindred, may have been lost along the way. Buried deep below in the Dark City's ancient past, lies thousands of randomly generated weapons, loot, and equipment.  A bounty for the few souls brave enough to seek it out.</li></ul>", "metacritic": null, "released": "2015-09-21", "tba": false, "updated": "2023-09-20T17:44:16", "background_image": "https://media.rawg.io/media/screenshots/8b0/8b0811ab3a782078152f280ec9efb91a.jpg", "website": "http://www.lasthalfofdarkness.com/bloodlust", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 43, "beaten": 1, "dropped": 2}, "playtime": 4, "achievements_count": 25, "ratings_count": 4, "suggestions_count": 558, "game_series_count": 0, "reviews_count": 4, "platforms": ["PC"], "developers": ["WRF Studios"], "genres": ["Action", "RPG", "Indie"], "publishers": ["WRF Studios"], "esrb_rating": null}