{"id": 189986, "slug": "an-evening-with-unity-chan", "name": "An evening with Unity Chan", "name_original": "An evening with Unity Chan", "description": "<p>I have created a digital abomination. (UNPLAYABLE + trash)</p>\n<p>well w/e, you are here to download I guess. You have 2 hp per round, whoever wins 2 rounds... wins. Enemy hp goes down, by getting attack to hit.</p>\n<p>(Again, highly suggesting not to play)<br/></p>\n<p>Incompatible genres? “Tactical RPG” with Dating simulator?(ah wait, Fire emblem is a thing)</p>\n<p>Well, Puzzle genre (cut content of tactical RPG) and meta-humour? If only I had more time~</p>\n<p>It was supposed to be an cancerous game of high quality, intentionally bad. But… It is bad.</p>\n<p>The turn-based mechanics are solid (although spagghetti and some are cut) but the game itself is trash, so yeah, if you have read this far, don’t play it if you are looking for games. This could be considered trash by itself.</p>\n<p>I still upload this “thing” though, because in 3 days, I managed to do all of that stuff from scratch, and it wasn’t easy! (not worth either lel) After all, I can’t stop now, time to upload this pile of ~~~~</p><p>However, another reason I won't simply let this abomination die, is because in the future, when I have made actually good games, I can show this ultimate trashy game here, to get others' hopes up :)</p>\n<p>What it was supposed to be? A parody of dating simulators, commentating above the board game, with unity-chan saying intentionally awkward things, while the board game is fun by itself (note: its not, when 80% of it is cut)</p>\n<p>At this point, realizing what I have created, I am sorry for uploading this :(</p><p>(Early build pictures, mandatory pic requirement from the site)</p>", "metacritic": null, "released": "2018-04-23", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/8ab/8ab5d72838c5d9435c30084350bc4029.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 24, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["yelloWinner"], "genres": [], "publishers": [], "esrb_rating": null}