{"id": 19005, "slug": "fall-of-the-titanic", "name": "Fall of the Titanic", "name_original": "Fall of the Titanic", "description": "FALL OF THE TITANIC 103 years ago, the RMS Titanic set sail from Southampton, full of pride and glory. Now, the ship is merely remembered as a tragedy like no other at sea. In Fall of the Titanic, set foot onboard again, exploring the Titanic deck for deck. Discover what the layout, structure and purpose of the ship was like 103 years ago, and experience the tragic sinking all over again. EXPLORE Explore every deck of the Titanic, from Orlop to Boat-deck. Walk along the promenade deck, or discover how excluded the boilers really were. Discover hidden rooms and amenities, like a swimming pool, bathhouse, squash course and much more. Enjoy the beauty and elegance of the first class, as well as the endless hallways of the lower decks.EXPERIENCE THE TRAGEDYThe sinking escape mode allows for a deck-by-deck escape from F to Boat Deck. Hurry away from the rising water in search for useable tools and exits in the labyrinth of corridors hidden in the mass of the doomed ocean liner. See the beautiful spaces disappear in the endless water as you try to escape from a freezing death. Find your way to a lifeboat in the dark, cold night, surrounded by nothing more than water and the sound of a creaking, massive ship.MAKE IT SINKIn exploring mode, control when the sinking starts, so you can see which areas fill up with water as the ship slowly sinks below surface. This lengthy sinking sequence allows for a more time-realistic simulation of the sinking, with the ability to check every part of the ship during the process, as well as to choose your preferred sinking duration.", "metacritic": null, "released": "2015-12-03", "tba": false, "updated": "2019-08-28T22:09:29", "background_image": "https://media.rawg.io/media/screenshots/3c3/3c3ba6c8af388acb5ae719547e016fc4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 10, "beaten": 2, "dropped": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 3, "suggestions_count": 275, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC"], "developers": ["TheWgames"], "genres": ["Adventure", "Simulation", "Casual", "Indie"], "publishers": ["TheWgames"], "esrb_rating": null}