{"id": 19001, "slug": "moira", "name": "Moira", "name_original": "Moira", "description": "OverviewMöira is an action platformer that draws inspiration from the classic 8-bit portable games with a modern twist, memorable characters, lots of spells and awesome secrets! You play as Rubick, a young magician apprentice who's searching for his missing master. In order to accomplish that, Rubick must travel through the Magic Kingdoms mimicking enemies' powers and learning how to combine them using the wand his old master left to him.<br/><br/>However, Rubick's adventure won't be easy since he's going to fight against foes so powerful that are capable of distorting the limitations and break the rules of the land of Möira itself.<br/><br/>Möira is an action-platformer game with collectibles, puzzles and exploration elements. It is also a story driven game, so its levels will contain more than just enemies and a goal at the end. During the course of the game, the player will encounter many NPCs that will help Rubick on his quests, puzzles that use powers learned throughout the game and secret areas that can lead to hidden items.<br/><br/>In Möira, you’ll be able to explore the kingdoms presented in the story, every single one of them with its unique characters, enemies and bosses. The different environments will also come with new mechanics.Mimic<br/>Rubick’s power, Mimic, is one of Möira’s core gameplay features. With Mimic, players will be able to copy the ability of many different foes throughout the game and use it against them. The abilities that are copied will be the key to solve puzzles inside the levels.Combining Spells<br/>By acquiring each new power in the game, players will be able to combine these abilities to create new ones. This can be done inside the game menu by merging two different spells. The order of the combination also matters. For example, choosing to combine Beam + Sword results in Beamerang — a magic boomerang that bounces off surfaces. However, by picking the Sword before the Beam means that the player will acquire the Magic Sword.<br/><br/>These complex abilities are also indispensable to complete the game, so we suggest that you try all possible combinations for a more fruitful experience.Battle<br/>Möira’s battle system is a mix of a fast-paced combat and strategic thinking. Each enemy has its own patterns, weaknesses, resistances and immunities. Besides that, each power that the player has also possesses its own attribute. With this mechanic, confronting enemies in Möira will be a bit more complex than just hitting them with whatever you have currently equipped.Exploration<br/>Möira’s level design and exploration methods will be guided by modern platformer conventions. In a larger scale, powers that are only obtained late in the game will be fundamental to access blocked areas on the first kingdoms of Möira — which is crucial to reach 100% completion.<br/><br/>Each level in Möira contains a nonlinear design, which means that solving puzzles and collecting items are also tasks to be completed by means of exploration. We chose this line of thinking to stimulate the player to discover all the details in each world, as we were inspired by classics and modern games in the genre, such as Cave Story, Super Metroid and Ori and the Blind Forest.<br/><br/>Overview<br/>The kingdom of Anemos has been well-known for centuries for its great wizards and sorcerers. Anemos’ reference in magic is Zeppeli, the High Wizard. His contribution to the magic world was enormous, until one day he vanished without a trace.<br/><br/>To find out what happened to Zeppeli, the player incarnates Rubick, his young and not-so-talented pupil. Along the way, Rubick will get to know different people and learn new abilities in order to uncover pieces about a dark truth related to his master’s disappearance.The World<br/>Möira’s world is inspired by greek mythology and real ancient greek civilizations. In addition to this influence, the game also features a wide variety of cultures and video game tropes of the early Game Boy era. The kingdoms the player will visit in Möira are:<br/><br/>Anemos, the Kingdom of Light Magic<br/><br/>Photia, the Kingdom of Nature<br/><br/>Hydra, the Underwater Kingdom<br/><br/>Geh, the Kingdom of Dark Magic<br/><br/>Dynamis, the Kingdom of the Unknown<br/><br/>Every kingdom has its own characteristics and can easily be told apart from one another. One of the definitions of the word “Möira” is destiny or fate; “Möira” is also the name of the world itself, named after the mother of all life.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T22:09:29", "background_image": "https://media.rawg.io/media/screenshots/4ef/4ef322e5105c14e2fd6c5e40e256ee5f.jpg", "website": "http://www.moiragame.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 255, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC", "Linux"], "developers": ["Onagro Studios"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["Onagro Studios"], "esrb_rating": null}