{"id": 190293, "slug": "decked-out-a-deckbuilding-dress-up-game", "name": "Decked Out, a Deckbuilding Dress Up Game", "name_original": "Decked Out, a Deckbuilding Dress Up Game", "description": "<p><strong>EDIT: In case the WebGL version doesn't work for whatever reason, I</strong> <strong>added a Windows standalone build. Expect bad UI scaling. WebGL is still preferred and better.</strong><br/></p>\n<p>Created for Ludum Dare 41</p>\n<p>Become the fashion master! Believe \r\nin the heart of the cards to create the most fabulous outfits known to \r\nman/dog/cat-kind! Do you have what it takes to be <em>DECKED OUT</em>?<br/><br/>This\r\n was initially envisioned as a deckbuilding card game. However, turns \r\nout that deciding to write basically all the code in the last day wasn't\r\n too much of a bright idea. As comparison to what the game is now, \r\nhere's a screenshot of the full UI.<br/><br/>In this version of the game, \r\nyou can't do a whole ton much. There are no deckbuilding elements \r\n(unless you look at the spaghetti code). You start off with all cards \r\nunlocked by default. There is no store to access and buy new cards. \r\nThere is no money either. You were originally supposed to do these \r\nphotoshoots every few turns. You would have to assemble an outfit \r\naccording to the theme, getting money depending on how close you are to \r\nthe theme. The eventual goal would be to collect all 60 articles of \r\nclothing and/or reach a turn limit. Every 5 turns you were also supposed\r\n to pay an increasing amount of money towards some debt. The idea was to\r\n never become bankrupt while also gathering clothes.<br/><br/>I will have to revisit this concept at some point. Hopefully my NEXT GEN graphics are sufficient enough to make some laughs.<br/><br/>And\r\n if you're curious, the song used was Lost in the city by TRG Banks. It \r\nfelt really reminiscent of a dress up game's music to me.<br/></p>", "metacritic": null, "released": "2018-04-24", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/04e/04e1bf5b181fb0cdd7cd7648c454d11a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 24, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["DrEvilBrain"], "genres": [], "publishers": [], "esrb_rating": null}