{"id": 19038, "slug": "monstro-battle-tactics", "name": "Monstro: Battle Tactics", "name_original": "Monstro: Battle Tactics", "description": "On Ludus, ancient terror beasts and humans somehow coexist in perfect harmony. Yet once every few hundred years or so, a predictably unpredictable astrological phenomenon occurs wherein some angry people from the sky arrive from their dimension, \"Terra\". Whenever they arrive, a fleet of floating islands are brought along and make up the battlefields where the humans and the beasts battle for the amusement of the angry Skygods.<br/><br/>Welcome to Monstro. A <strong>fully deterministic logic game</strong> which plays like a tactical RPG but without RP, character growth or randomness. Fight the opposing army on the battlefield, which just so happens to be made up of conveniently perfect squares. Survive the onslaught and strike back to be the last one standing. Or, occasionally, do something else the evil Skygods want to be done for their own amusement.<br/><br/>This game takes the traditional tRPG gameplay and reconstructs it into a completely deterministic, logical experience with a twist of tactics. All of this is spiced up with ridiculous, tongue-in-cheek lore and approachable difficulty.<br/><br/>List of features:<br/> - A puzzle game with completely deterministic and repeatable set of rules which still feels like playing a tRPG.<br/> - And even though it plays like a tRPG there are no RPG elements, so it feels more like a t.<br/> - A tongue-in-cheek plot, much better than the previous bullet point!<br/> - No need to tediously repeat the same sequence of moves over and over if you lose, because undo is here! Undo a single move, undo all moves back to the beginning of the mission, undo if you fail the mission and even undo if you are victorious!<br/> - Learn the rules of the enemy AI and use them for your victory. Or read them up because everything is in the in-game help!<br/> - Real-time lighting which adds new depth to the crisp pixel art.<br/> - Traps, pimped-up units, moving walls and breakable walls, ranged attacks and quick feedback on predicted enemy movement.<br/> - 23 achievements including 17 which require you to complete existing levels in a more difficult way!<br/> - 6 Trading Cards with descriptions expanding the game's weird lore.<br/> - Skygods, hand-drawn islands, ancient terror beasts, Goos with :3 faces and the background pushed around by an artificial wind.", "metacritic": null, "released": "2015-12-03", "tba": false, "updated": "2019-08-28T22:09:27", "background_image": "https://media.rawg.io/media/screenshots/fc6/fc6110161a4e392db8cbd24754402cd0.jpg", "website": "http://monstro.retrocade.net", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 37}, "playtime": 4, "achievements_count": 23, "ratings_count": 0, "suggestions_count": 227, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Retrocade.net"], "genres": ["Strategy", "Casual", "Indie"], "publishers": ["Retrocade.net"], "esrb_rating": null}