{"id": 19056, "slug": "stalker-call-of-pripyat", "name": "S.T.A.L.K.E.R.: Call of Pripyat", "name_original": "S.T.A.L.K.E.R.: Call of Pripyat", "description": "<p>With over 2 million copies sold, the new episode of the most internationally successful S.T.A.L.K.E.R. series seamlessly connects to the first part of the Shadow of Chernobyl.</p>\n<p>S.T.A.L.K.E.R.: Call of Pripyat takes PC gamers once again into the vicinity of the Chernobyl nuclear reactor that exploded in 1986. This so-called &quot;Zone&quot; is a highly contaminated area cordoned off by the military and now is combed through by the so-called stalkers, modern fortune hunters, in search of unique artifacts. In the role of Agent Alexander Degtyarev, who is dressed up as stalker, the player has to investigate the mysterious disappearance of five military helicopters and thereby stand one’s ground against the various stalker groups.<br />\nOne of the first DirectX11 games<br />\nStory begins where S.T.A.L.K.E.R.: Shadow of Chernobyl has ended<br />\nPhotorealistic exclusion Zone : All locations are recreated by their true-to-life prototypes based on photographs<br />\nNew exciting storyline with a number of unique characters<br />\nExtended system of handmade side quests<br />\nNew monsters: Chimera and Burer. New behavior and abilities for all monsters<br />\nNew A-Life system, created using the players’ best-liked elements of the first two games in series<br />\nEmissions considerably influence the world of the Zone<br />\nSleep function added into the game<br />\nNew player’s interface<br />\nPossibility to continue the game after completion in a free play mode<br />\nUp to 32 players can compete in the multiplayer part. Four different play modes and a countless amount of maps are available</p>", "metacritic": 80, "released": "2009-10-02", "tba": false, "updated": "2024-04-23T10:18:56", "background_image": "https://media.rawg.io/media/games/5ad/5adab016a307c2902a82b60d487fe287.jpg", "website": "http://cop.stalker-game.com/", "rating": 4.28, "rating_top": 4, "added_by_status": {"yet": 232, "owned": 2979, "beaten": 866, "toplay": 73, "dropped": 184, "playing": 22}, "playtime": 3, "achievements_count": 0, "ratings_count": 874, "suggestions_count": 608, "game_series_count": 3, "reviews_count": 880, "platforms": ["PC", "Xbox Series S/X", "Xbox One", "PlayStation 4"], "developers": ["GSC Game World"], "genres": ["Shooter", "RPG"], "publishers": ["GSC Game World"], "esrb_rating": "Mature"}