{"id": 1906, "slug": "liberation-maiden", "name": "LIBERATION MAIDEN", "name_original": "LIBERATION MAIDEN", "description": "Eradicate your enemies in the #1 ranked 3D action shooter in Japan!<br/>With unmatched graphics, fully voiced cutscenes, <br/>Exhilarating gameplay and intuitive interface,<br/>The critically acclaimed Nintendo 3DS hit is available now on iOS!<br/><br/>*** DESCRIPTION ***<br/><br/>100 years in the future, players take the role of Shoko Ozora, a high school student who steps into the role of President of New Japan after her father’s assassination. With her country all but taken by fierce invaders wielding advanced weaponry, Shoko rides out on her Liberator, Kamui, to free her people and restore the once beautiful nation!<br/><br/>Her heroic battle for independence and &amp;quot;liberation&amp;quot; is about to begin!<br/><br/>*No registration or account setup is required.<br/><br/><br/>*** FEATURES *** <br/><br/>■ An Unprecedented Collaboration<br/>From a concept by Grasshopper Manufacture’s SUDA51 comes an all-star cast of artists, designers and musicians who bring AAA production value to the downloadable space. <br/><br/>■ An Intense Action Shooter That Never Relents<br/>Face powerful opposition from an arsenal of ground forces as you take to the sky with your lock-on lasers and graceful evasive maneuvers. Complete mission objectives across multiple stages that culminate in thrilling assaults on the enemy’s massive Conduit Spikes.<br/><br/>■ Simple and Intuitive Controls Meet Dazzling Graphics <br/>Anyone can enjoy the high-octane action with easy-to-play controls that can be further adjusted to suit your dominant hand. Beginners can view tutorials and have the controls explained at any time. Optimized for the retina display, the battle to reclaim New Japan is captured in a visual festival of high resolution imagery.<br/><br/>■ The Latest Tech for Your Mech<br/>With support for a wide range of popular Apple products, players on the latest devices will experience the ultimate in comfortable controls and the exhilaration of cutting-edge graphics.<br/><br/>No matter how you experience LIBERATION MAIDEN, get ready for a showdown of unparalleled action!<br/><br/>■ Expanded Game Play with Game Center<br/>Face new Challenges*, compete for high scores with your friends, and aim for the top of the Leaderboard!<br/><br/>*Challenges only compatible on iOS 6.0 or higher<br/>*4th Generation iPod touch not compatible with Game Center features.<br/><br/><br/>*** COMPATIBLE DEVICES ***<br/><br/>iOS: 5.0 and higher<br/>iPhone: 4 and higher<br/>iPod touch: 4th generation and higher<br/>iPad: 2 and higher, iPad mini<br/>*Certain devices are excluded<br/><br/><br/>*** OFFICIAL WEBSITE ***<br/><br/>http://level5ia.com/ios/liberation-maiden/", "metacritic": null, "released": "2012-10-04", "tba": false, "updated": "2019-10-22T14:27:54", "background_image": "https://media.rawg.io/media/screenshots/9f5/9f5362c6c8782da74843887b94475ce0.jpg", "website": "http://level5ia.com/ios/liberation-maiden/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 4, "beaten": 4, "toplay": 3, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 412, "game_series_count": 5, "reviews_count": 2, "platforms": ["Nintendo 3DS", "iOS"], "developers": ["Level 5"], "genres": ["Action", "Arcade"], "publishers": ["Level-5", "LEVEL-5 International America"], "esrb_rating": null}