{"id": 19069, "slug": "sword-of-the-samurai", "name": "Sword of the Samurai", "name_original": "Sword of the Samurai", "description": "Enter Japan in the age of warring states. At the center of this role-playing, action-adventure simulation of combat, statesmanship and intrigue, you are a samurai warrior struggling for honor. More important than life itself, honor is crucial to achieving your ultimate goal: unifying feudal Japan under your noble rule.<br/><br/><strong>Game Features:</strong><br/><br/><ul><li>Computer-controlled opponents make decisions based on your actions - and on the actions of other rival characters.<br/></li><li>Furious melee action against multiple warriors takes place in castles, villages and rice paddies.<br/></li><li>Vindicate yourself in duels against rivals who would like nothing better then to diminish your Honor.<br/></li><li>Feel the drama and immediacy of real-time battles involving infantry, cavalry and muskets on battlefields that vary with every conflict.<br/></li><li>Untie all 48 warring provinces in common allegiance to you, and earn the title of shogun, military ruler of all Japan.<br/></li><li>Fun and Easy to control!<br/></li><li>Four skill levels, plus other starting options<br/></li><li>An ingenious system of menus, animation and text windows - pioneered by MicroProse in Pirates! - conveys the detail of text with the fun of graphics and animation.<br/></li><li>Authentic Japanese music and graphics powerfully evoke the mood of Sixteenth century Japan.</li></ul>", "metacritic": null, "released": "1989-01-01", "tba": false, "updated": "2023-02-08T10:49:16", "background_image": "https://media.rawg.io/media/screenshots/648/648a0c1dd5fbc729d0007ff47346a996_CdMKibm.jpg", "website": "http://www.retroism.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 9, "owned": 144, "beaten": 2, "toplay": 4, "dropped": 2}, "playtime": 1, "achievements_count": 0, "ratings_count": 3, "suggestions_count": 271, "game_series_count": 0, "reviews_count": 3, "platforms": ["macOS", "PC", "Linux"], "developers": ["MicroProse Software"], "genres": ["Action", "Adventure", "Strategy", "Simulation"], "publishers": ["Nightdive Studios", "Retroism"], "esrb_rating": "Mature"}