{"id": 190659, "slug": "monogame-space-shooter", "name": "monogame Space shooter", "name_original": "monogame Space shooter", "description": "<p>Space Shooter 2D a été fait avec l'editeur Visual Studio et écrit en C# avec la librarie Monogame/XNA en 2014. Vous devrez detruire les vaisseaux sans vous faire toucher. S'ils vous touchent vous perdez des points de vie, jusquà ne plus en avoir.</p>\n<p><strong>Histoire du space shooter:</strong></p>\n<p>Les shoot them up fixes sont parfois appelés <em>gallery shooters</em> ou <em>single screen shooters</em>3. Ils sont constitués d'une série de niveaux tenant chacun sur un seul écran. Le fond d'écran ne bouge pas. Les ennemis à abattre arrivent d'un bord de l'écran et avancent plus ou moins vite en direction du joueur, situé de l'autre côté de l'écran, dont les mouvements sont limités à un seul axe horizontal ou vertical4. Sa capacité de tir est également réduite à une seule direction – en ligne droite. L'un des premiers <em>shoot them up</em> fixe est <em>Space Invaders</em> sorti en 19783.</p>\n<p>Les shoot them up fixes sont critiqués sur plusieurs points. Ainsi, on relève un manque de variété dans les challenges proposés, qui consistent généralement à viser des aliens tout en évitant leurs tirs avec son vaisseau spatial. Ils requièrent seulement d'apprendre les schémas des tirs ennemis et de les mémoriser pour terminer les jeux. Cependant, ils restent assez difficiles pour souvent décourager les nouveaux joueurs. Il manque également à ces premiers <em>shoot them up</em> un contexte narratif comme un scénario ou la description des pilotes et des vaisseaux3.</p>\n<p>Les heures de gloire du genre se situent de 1978 à 1981. Quelques exemples de <em>shoot them up</em> fixes : <em>Galaxian</em>, <em>Galaga</em>, <em>Phoenix</em>, <em>King and Balloon</em>…</p>\r\nÀ défilement[modifier | modifier le code]\r\n<p>Vidéo de <em>Chromium BSU</em>, un <em>shoot them up</em> à défilement vertical.</p>\n<p>Les <em>shoot them up</em> à défilement, appelé <em>scrolling shooters</em> en anglais, sont constitués d'une série de niveaux qui se révèlent au fur et à mesure que le joueur les explore. Le fond d'écran n'est pas fixe, mais avance en parallèle au vaisseau du joueur, faisant apparaître de nouveaux décors et de nouveaux ennemis. Les <em>shoot them up</em> à défilement peuvent défiler horizontalement ou verticalement. Dans le premier, le joueur se situe à gauche de l'écran et avance vers la droite ; dans le second, le joueur est en bas de l'écran, avance vers le haut et dispose d'une vue légèrement d'au-dessus. Par rapport aux <em>shoot them up</em> fixes, le joueur peut déplacer son vaisseau dans toutes les directions possibles, sans pour autant faire de rotations sur lui-même – le masque de collision du vaisseau fait toujours face à l'ennemi. Le genre offre souvent aux vaisseaux plusieurs types de tirs, dits « principaux » et « secondaires », se déployant en ligne droite et sur des angles de 180° et 360°, et également des boucliers se déclenchant autour des vaisseaux.</p>\n<p>Le premier jeu qui inaugura ce genre est <em>Defender</em>, un jeu à défilement horizontal sorti en 1980. Le jeu a subi de nombreuses innovations au fil des années, notamment avec l'arrivée du <em>manic shooter</em> et de schémas de tirs ennemis très complexes. Le <em>shoot them up</em> à défilement reste encore aujourd'hui le type de <em>shoot them up</em> le plus représenté.</p>\r\nMultidirectionnel\r\n<p><em>Mu-cade</em>, un <em>shoot them up</em>multidirectionnel.</p>\n<p>Les <em>Shoot them up</em> multidirectionnels, aussi appelés <em>arena shooters</em>, proposent au joueur une liberté totale de mouvement et d'orientation dans des environnements en deux dimensions. Les niveaux peuvent tenir sur un seul écran, tel que dans <em>Robotron: 2084</em>, ou être plus larges et permettre aux joueurs de naviguer sur de plus grandes aires de jeu – l'écran défile alors en même temps que le joueur. Exceptionnellement dans ce genre, le joueur se situe au centre de l'écran, cerné par une horde d'ennemis arrivant de toute part5. Les niveaux s'enchaînent en détruisant tous les ennemis de la zone.</p>\n<p>L'un des premiers <em>shoot them up</em> multidirectionnels est <em>Computer Space</em> sorti en 1971. Mais ce genre fut démocratisé avec la sortie d'<em>Asteroids</em> d'Atari en 1979.</p>\n<em>Tube shooter</em> et <em>rail shooter</em>\n<p><em>Torus Trooper</em>, un <em>tube shooter</em>.</p>\n<p>Les <em>tube shooters</em> donnent au joueur un seul axe de mouvement, qui se situe autour des bords d'un tube affiché ou non à l'écran, créant une illusion de vitesse et d'aller de l'avant. Il est uniquement possible de tourner autour du tube, afin de détruire les ennemis logés à l'intérieur de celui-ci. Le jeu qui initia le genre est <em>Tempest</em>, premier jeu vectoriel en couleur sorti en 1981. Le <em>tube shooter</em> reste cependant assez marginal6.</p>\n<p>Quelques exemples de <em>tube shooters</em> : <em>Gyruss</em>, <em>iS: Internal Section</em>…</p>\n<p>Les <em>rail shooters</em> ont largement supplanté les <em>tube shooters</em> avec la montée du jeu vidéo en trois dimensions. Leur <em>gameplay</em> est très restrictif et incite à la recherche du meilleur score possible. Le point de vue du joueur s'oriente automatiquement et se déplace dans le niveau comme si le joueur était attaché à un chemin de fer. Du début à la fin, le joueur est forcé de suivre le chemin imposé par le programme ; cependant il peut parfois influencer indirectement sur le parcours en atteignant certains type de score. Le joueur n'a pas le contrôle de son avatar. La liberté de mouvement est nulle, ou très limitée, se résumant à pouvoir esquiver les attaques ennemies. Il est possible de diriger l'arme et parfois la caméra.</p>\n<p>Quelques exemples de <em>rail shooters</em> : <em>Panzer Dragoon</em>, <em>Rez</em>, <em>Star Wing</em>…</p>\n<br/>", "metacritic": null, "released": "2018-04-15", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/337/33708ef37834308a8417ae8ee1683b44.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 236, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["jason colomay"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}