{"id": 190798, "slug": "the-dragon-speech", "name": "The Dragon Speech", "name_original": "The Dragon Speech", "description": "<p><strong>The Dragon Speech</strong></p>\n<p>At the 1992 CGDC (now GDC) Chris Crawford gave his \"I Had a Dream\" speech that later became known as \"The Dragon Speech\".</p>\n\n\n<p>In it he expressed his disappointment with how the games industry had progressed. At the time it seemed like the industry was progressing slowly, taking old ideas and tweaking in minute ways. The games of the day spent more time enhancing their graphics than game-play. Stories were reduced to a series of simple choices that lined up into a puzzle of finding the best pre-planned outcome. Players were reduced to a limited number of actions (or verbs). The most common actions in games were (and still are) move, jump, and fire. Chris saw this and tried to change the games industry from within. He tried to get the games industry to think about making games be more like a story where players could interact through a wide range of emotions and actions.<br/></p>\n\n<p>But it was clear in 1992 that he had no option but to leave the industry. The industry was set in its ways and people seemed happy with the games that were being made. Why would the industry want to change what was already working?</p>\n<p>At the end of the Dragon Speech Chris honored Don Quixote. Don Quixote was considered by many of the folks of his day to be a fool; a man who clearly had lost sight of reality. But Chris pointed out that Don Quixote had imposed his own reality upon the conventional reality. His reality saw sheep as armies, and the windmill as a dragon. And Chris realized his mission was to slay the dragon that others refused to see; to create story worlds where the player could shape the world through myriad actions. He realized that games lacked real interactivity and his vision was of more complex and advanced interactive storytelling games. These weren't simply puzzles where the designer showed how clever they were by frustrating the player; these were grand stories where the characters drove the story in ways the designer might not anticipate.</p>\n<p> Much of the promise of interactivity on the computer has been lost in the quest of better graphics, larger worlds, cut-scenes, and pay-for-play downloadable content. We have lost the ability to drive the story in meaningful ways. The actions in games are all pre-programmed with predictable outcomes. This is why computers can play our games better than we can; there's little human input into the game.</p>\n<p>At the end of his speech he picked up his sword and pledged himself to fight the dragon \"For truth! For beauty! For art! Charge!\". Upon uttering these words he galloped out of his talk, sword extended, and left CGDC (and the games industry) behind.</p>\n<p>On this, the #notgdc game jam, I honor Chris Crawford and his continuing quest to bring true interactive storytelling to the games industry. His journey continues to bring true interactive storytelling experiences to the world. It hasn't been an easy road, and there have been many setbacks, but his journey continues.</p>\n<p>In this simulation your only action is to move right (sadly this action covers most of the actions available in today's games). Your goal is to continue moving right until you reach the end of the hallway and leave the conference.</p>\n<p>Chris Crawford is still fighting the dragon. You can learn more about his quest by visiting http://erasmatazz.com.</p>", "metacritic": null, "released": "2018-03-23", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/3da/3dad03f8658c8dfa24df834c4718580f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 6, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Craig Maloney"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}