{"id": 19084, "slug": "awakened", "name": "Awakened", "name_original": "Awakened", "description": "The world has never been the same ever since the outbreak happened.<br/>The year is 2032, after the outbreak began, various citizens began their escape from towns, and resorting to<br/>making villages and camps in the woods.<br/>The sources of the virus are unknown, nobody knows why it happened or why it began.<br/>You, among many others, are a survivor who woke up in one of the settlements in the woodlands.<br/>Beware of the zombies, some may be faster or stronger than others.<br/><br/>In the game, you will be managing your stamina, hunger, thirst, O2 and temperature.<br/>Wear warmer clothes if you are in a cold environment, or cook some food with a campfire if you kill an animal and obtain it's raw meat.<br/>You can craft items using the resources you collect in your gameplay, and make a crafting station to craft even more items.<br/>Find a vehicle scattered out in the world and fuel it up with gasoline if it runs out.<br/>With weapons, you can hold the T key to attach any attachment you'd like, as long as it is fit for the weapon category you are using.<br/>Party up with a squad of 5 people (counting you) by clicking the plus icon on the lobby!<br/>Chop down trees using your trusty crafted axe and make wooden planks to create walls and furniture, to create your own base!<br/>Eliminate zombies, players, animals, and gain XP for all of it, you will also be gaining xp for your skill points, which can be used to unlock skills in the skill tree!<br/>There are various options to choose in the character creation menu, from different races to hairstyles, you name it.<br/>In the world, you will find humans just like you! (or not) and some of them may give you quests, or just hang out, or trade with you!<br/><br/><br/><br/>Third Person Perspective<br/>Inventory Management<br/>Crafting<br/>Looting<br/>Building System<br/>Customization System<br/>Quests<br/>Saving and Loading<br/>Skill Trees<br/><br/>..And more!<br/><br/><br/><br/>DreamriseStudios for making the Ultimate Multiplayer Survival Pack used for the game!<br/>Cheesy HFJ for making the lobby music!<br/>vantwister for voicing the zombies!", "metacritic": null, "released": "2016-06-29", "tba": false, "updated": "2023-08-25T02:48:38", "background_image": "https://media.rawg.io/media/screenshots/cf6/cf617041e61e8dda7d1043226ebf1115.jpg", "website": "http://genuineflip-flops.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 42}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 125, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC", "macOS"], "developers": ["Jesper Michael Petersen", "SparklingPishy"], "genres": ["Action", "Adventure", "RPG", "Simulation", "Casual", "Massively Multiplayer", "Indie"], "publishers": ["Jesper Michael Petersen", "SparklingPishy"], "esrb_rating": null}