{"id": 19083, "slug": "mechoecho", "name": "MechoEcho", "name_original": "MechoEcho", "description": "Enter MechoEcho, an ethereal world where all that stands between you and peril is your own ingenuity. Use blocks, engines, and an array of tools to invent and build wildly creative machines. Pilot them to solve the 3D puzzles in each of the 40 levels (30 from the original campaign + 10 extra tough expansion levels) and Sandbox.<br/><br/>You’ll transform from human to machine and back as you explore the shadowy cyberdeco setting with sheer drops, a pulsing soundtrack, and strange creatures out to destroy you.<br/><br/>The customized physics engine is highly accurate which makes driving fun and easy. Go from beginner to master as the carefully crafted difficulty curve takes you to the crazy hard final levels. The addictive, challenging puzzles will inspire you to dream up ever more creative machines.<br/><br/>In this cyberpunk fable, you awaken in a mysterious computer simulation after having witnessed the end of the world. Neither human nor machine, you carry the scars of the last days of humanity, and the mistakes you struggle to unmake. The past and present stories of Echo and her creation unfold in pieces and memories that weave together a tale of lost hope, escape, and possibly redemption. In the end, the fate of humanity is up to you.Key Features:<ul><li><strong>Build, Drive, and Solve the Puzzles</strong> <br/>You build machines to overcome any obstacle in your way, and pilot them to safety as you solve the 3D puzzles in each level.<br/></li><li><strong>Endlessly Creative</strong> <br/>There’s no one solution to any problem, you can construct machines within machines, catapults, walkers, climbing robots or anything you can imagine.<br/></li><li><strong>The Challenges Keep on Coming</strong> <br/>Sometimes, blocks may be in limited supply to further challenge your resourcefulness. Oh right, and creatures are trying to kill you.<br/></li><li><strong>Accurate Physics Engine</strong> <br/>Your machine will move the way you design it to move, as long as you can drive it.<br/></li><li><strong>Sandbox</strong> <br/>Unlimited blocks in a specially crafted Sandbox level. Challenge your engineering skills at building robots with no limits!<br/></li><li><strong>Stunning Visuals</strong> <br/>Looming spires of art deco buildings break the horizon while particle beings run on precipices and creatively conceived machines keep the action moving.<br/></li><li><strong>Compelling Story and Characters</strong> <br/>Mysterious post-apocalyptic fable where you choose the ultimate fate of humanity.<br/></li><li><strong>Mesmerizing Soundtrack</strong> <br/>The haunting electronic music pulls you even closer into the virtual world of Mecho.<br/></li><li><strong>Addictive Gameplay</strong> <br/>Tested on actual humans who would not stop until they solved the level ... and they didn't want the game to end!</li></ul>", "metacritic": null, "released": "2016-05-17", "tba": false, "updated": "2019-08-28T22:09:25", "background_image": "https://media.rawg.io/media/screenshots/b7f/b7fa16a1963a63b9f4fb598e507f2f05.jpg", "website": "http://www.mechoecho.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 14}, "playtime": 2, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 287, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Resilient Games"], "genres": ["Strategy", "Simulation", "Indie", "Puzzle"], "publishers": ["Resilient Games"], "esrb_rating": null}