{"id": 19097, "slug": "gravity-core-braintwisting-space-odyssey", "name": "Gravity Core - Braintwisting Space Odyssey", "name_original": "Gravity Core - Braintwisting Space Odyssey", "description": "<strong>„The superior man is distressed by the limitations of his ability; he is not distressed by the fact that men do not recognize the ability that he has.” (Confucius, Chinese philosopher, 500 B.C.)<br/>“You remind me of my hamster, which hasn’t much to offer besides fat cheek as well.” (E.V.E, artificial intelligence, 2132 AD)</strong><br/><br/>Gravity Core is an <strong>Anti-Casual Braintwisting Space Shooter</strong>. Accompanied by a psychotic artificial intelligence, you have to master three dimensional space, challenges to your sense of orientation and perception and your own inability to save all existence from extinction in this space odyssey.<br/><br/><strong>OVERVIEW:</strong><br/><ul><li>Anti-Casual Braintwisting Space Shooter: Combining elements of a space shooter with puzzles, challenges to your sense of orientation and perception<br/></li><li>50+ levels<br/></li><li>Hundreds of different obstacles (some of the complexity of complete levels) and enemies needing different approaches to complete the missions<br/></li><li>10+ weapon and defense systems<br/></li><li>Cockpit mode for gamers who need a VERY special challenge<br/></li><li>Full keyboard/mouse, gamepad, joystick support<br/></li><li>A story about pride, hope, betrayal and psychotic episodes of an artificial intelligence who likes to talk about the downside of rodents a lot…<br/><br/>After 28 years of war, most of the humanoid life forms are close to extinction, large areas of the six inhabited planets lie in ruins. And even though the survivors felt safe after the peace treaty of 2131, the worst threat still lies right ahead. Attracted by their gravitational forces, the debris of thousands of annihilated planets and countless destroyed fleets is moving towards the still populated planets. With increasing speed, they threaten to extinguish all remaining existence.<br/><br/>In a desperate move to rescue life itself, the scientists aboard the spaceship M.O.T.H.E.R. have ordered the advanced artificial intelligence E.V.E. to create a defensive weapon against the new threat. The result is a force field that is generated by two twin ships and can destroy even the most serious threats: the Gravity Core.<br/><br/>The player controls a space ship in three dimensional spaces, avoiding increasingly complex debris, operating rising numbers of weapons and defensive systems and trying to somehow cope with the ever growing challenges of the missions and E.V.E. herself.<br/><br/>The idea to Gravity Core has emanated from a small research project aiming at the software-driven activation and thereby training of coordinative abilities and was then further developed into a complete game including story, up to date graphics and progressive difficulty. <strong>WARNING:</strong> Gravity Core is challenging, anti-casual and just as frustrating as failure due to one’s own lack of abilities can be. But in the end, nothing is quite as satisfying as admiring one’s own progress at the end of a mission.<br/>…or as E.V.E. likes to put it: “All he did was manage to press eight buttons in the correct order, and already he's grinning like a stoned meerkat.”<br/><br/><strong>Our testers’ comments:</strong><br/>“Damn!” (Michael, 23)<br/>“You’ve gotta be fucking kidding me!” (Irene, 21)<br/>“Thanks to Gravity Core, I am no longer addicted to Minecraft.” (Jan-Torben, 35)<br/>“Could I get E.V.E.’s phone number?” (Thomas, 17)<br/>“This level sucks... just one more try... no, no it sucks... ok, one last shot.” (Michelle, 37)<br/>“Since I started playing Gravity Core, I no longer have to get up to pee in the middle of the night!” (Peter, 47)</li></ul>", "metacritic": null, "released": "2015-07-01", "tba": false, "updated": "2019-08-28T22:09:25", "background_image": "https://media.rawg.io/media/screenshots/a95/a951d34cc8423c85a4fa4c03a5f1f7c6.jpg", "website": "http://www.gravitygames.de/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 27}, "playtime": 4, "achievements_count": 16, "ratings_count": 1, "suggestions_count": 455, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Gravity Games UG"], "genres": ["Action", "Adventure", "Strategy", "Simulation", "Indie"], "publishers": ["Gravity Games UG"], "esrb_rating": null}