{"id": 191033, "slug": "beasty-boomerang-bananza", "name": "Beasty Boomerang Bananza", "name_original": "Beasty Boomerang Bananza", "description": "<p>My Solo Game Development Project game. Defend your home from angry wild beasts in the Australian outback!</p><p>Inspired by tower defense and twin-stick shooter games, BBB takes a comical idea and combines it with physics to make an funny, bouncy game.</p><p>All art assets were done by myself, sounds came from freesound.org and were then edited to fit the needs of the game. </p><p>I learned a lot from this process, and I was extremely happy with being able to delve into photoshop and sound design a bit during this, which is something I hadn't really done myself in a game prior to this project. </p><p>ALSO: The attached zip contains a file with with Windows version of the game along with it's data, and the mac version. I don't have a mac so I wasn't able to test the mac build, so if there is a problem with it, please let me know!</p><p>Some things I wanted to fix but didn't get to:</p><p>- I wanted to make collision between the player and the walls/house but due to all of the rigidbodies I have on objects ( that were needed for the bounce on the boomerang), this proved to be extremely difficult and I ran out of time.</p><p>-Possibly collision between beasts and player (this would have worked but it didn't really make sense in the context of the game, unless I added more complex enemy behavior, which I didn't really have time to do).</p><p>-In the end, I wanted to make some better UI elements but ran short on time. If I'd thought of that earlier I could've gotten it done.</p>", "metacritic": null, "released": "2016-11-21", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/9dd/9dddf95b3ddd63e197237693ee3f1796.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 10, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["sully703"], "genres": [], "publishers": [], "esrb_rating": null}