{"id": 19108, "slug": "celias-quest", "name": "Celia's Quest", "name_original": "Celia's Quest", "description": "Celia's Quest<br/>This is a story of a beginning. This is a story of a girl's journey to save her friend, prove herself, and maybe kick some bandit butt while doing so. This is the story of the birth of a heroine the world has never seen before. This is the story of Celia's first quest.<br/><br/>Not long after Celia leaves her home to go on an adventure (and maybe, just maybe, to avoid getting married to Ced the creep) she finds herself in the village of Villageville, where she meets another runaway. Just as they are deciding to go search for adventure together, a group of remarkably rude bandits show up and kidnap Celia's new friend! Now it's up to Celia to save her friend, prove herself to the villagers in Villageville, and beat up all kinds of strange creatures living in the Valley.<br/><br/><strong>Brawl, bomb and magic</strong> your way through hordes of enemies ranging from the almost-peaceful <strong>Angry Shrooms</strong> to the devastating <strong>Dragon Dragon</strong>! Meet new friends and companions like <strong>Guy the almighty fairy</strong>, an old man that's <strong>absolutely not a retired hero</strong>, pirates, bandits and an <strong>immortal mouth in a jar</strong>! Beat up monsters <strong>until they cry</strong> and turn those tears into <strong>potions</strong>! The possibilities aren't exactly endless, but there's a lot of them! Go forth, and above all else, <strong>please enjoy Celia's Quest!</strong>Features<br/><ul><li>Freely allocate attributes and skills through different mentors spread throughout the Valley.<br/></li><li>No grinding for levels! Power up through exploration and defeating special enemies, no need for experience or levelups!<br/></li><li>More than 80 skills and upgrades to choose from, spread over 6 skill types. Mix and match to find your own way to defeat your enemies.<br/></li><li>10 dungeons, countless secrets and puzzles, hidden world bosses all in a huge world to explore and enjoy.<br/></li><li>New Game Plus lets you carry over most skills and achievements, letting you fight even tougher foes, some with a dark secret past!<br/></li><li>Multiple endings depending on secrets found and friendship bonds created, changing the outcome of the game.<br/></li><li>A unique take on the classic JRPG battle style. Let Celia unleash a barrage of attacks, and adapt on the fly!<br/></li><li>15+ hours of gameplay per playthrough, with multiple possible paths and strategies.<br/></li><li>Become a mighty Swashbuckler, learn how to use the art of Punching, or imbue machinery with Magic!</li></ul>The nitty gritty<br/>Celia's Quest is a JRPG made in RPGMaker VX Ace with heavy emphasis on exploration and puzzle solving rather than grinding and leveling up. Forgoing classic level-up systems, Celia's Quest delivers player progression through Powerups spread throughout the world. This way the player is rewarded for exploring and solving puzzles rather than being patient. Celia's Quest focuses on enjoyment rather than an epic storyline or super dramatic monologues, and shies away from anything close to mature or grimdark. It is, simply put, a fairy tale. This fairy tale has many humorous moments and though it gets serious at times it's more of a comedy than a drama. Characters are over the top, enemies are silly and the world kind of makes sense... sometimes. Did you know dungeon waters are deeper than regular water? Did you also know that this is why dungeon water chooses to only reflect more profound things, such as stars?", "metacritic": null, "released": "2015-06-24", "tba": false, "updated": "2019-08-28T22:09:25", "background_image": "https://media.rawg.io/media/screenshots/ce2/ce25775b149b57aec3c52401e6f44e37.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 95}, "playtime": 6, "achievements_count": 6, "ratings_count": 1, "suggestions_count": 176, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Duckvalley Productions"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["Duckvalley Productions"], "esrb_rating": null}