{"id": 1911, "slug": "rpg-symphony-of-the-origin", "name": "RPG Symphony of the Origin", "name_original": "RPG Symphony of the Origin", "description": "Spring RPG Sale! Save up to 75%OFF on 4 titles! ($7.99 -&amp;gt; $1.99)<br/><br/>Humans, elves, dwarves, the Evils of the Earth-depths, and golems!<br/>Different people, different tribes, different motives- all come together in this classic fantasy RPG!<br/><br/><br/>The lands where the humans, elves and dwarves live continue to be attacked by hideous creatures that have appeared from the very bowels of the earth. The attacks are frequent and widespread, and the attackers commit the most terrible of atrocities.<br/>These attackers have been dubbed the &amp;#39;Evils of the Earth-depths&amp;#39;<br/>One day, Granzalk Castle is the subject of an attack by the Evils of the Earth-depths.<br/>In the midst of the fierce fighting, Ryle, a young apprentice swordsman whose parents were both killed in a previous attack by the Evils, and who vows revenge, finds himself in the underground chambers of the castle. In one of those chambers, he discovers a golem built to oppose the Evils.<br/>And so the quest begins: Ryle takes the fate of the kingdom on his shoulders, and, along with Denoas, the golem built to oppose the Evils, sets off first to the village of the elves...<br/><br/>This is KEMCO&amp;#39;s first brand-new RPG designed from the ground up especially for smartphones!<br/>Don&amp;#39;t miss the epic story that unfolds around Ryle and Denoas and the characters they encounter, each with their own intentions and motives! <br/><br/><br/>Smoothly Animated Dynamic Battles<br/>Smooth animation and dramatic voice effects bring the characters&amp;#39; battle scenes to life.<br/>There are huge numbers of enemies trying to stop your progress. Some of them even have parts which are destroyed when they are damaged beyond a certain level. For example, an enemy might be clad in formidable armor to begin with, but if that armor is destroyed, the enemy&amp;#39;s appearance changes and defense ability drops… but on the other hand, the enemy&amp;#39;s movements might become swifter.<br/>Don&amp;#39;t ignore these changes- use them to alter the battle situation to your advantage!<br/><br/>Customize Weapons and Statuses!<br/>The characters&amp;#39; weapons are each made up of parts, and by combining these parts, you can change attack strength, not to mention the magic and skills the characters can use.<br/>What&amp;#39;s more, by reinforcing weapons at a Weapon Shop, you can upgrade the weapons to be much more powerful than they originally were.<br/>In addition, by assigning Merit Points on the Status screen, you can strengthen different statuses as you want- and you can adjust these statuses at any time.<br/><br/>*This game features some in-app-purchase content. While in-app-purchase content requires additional fees, it is not necessary for finishing the game.<br/>*The actual price might differ depending on the region.", "metacritic": null, "released": "2012-12-18", "tba": false, "updated": "2019-08-02T03:28:01", "background_image": "https://media.rawg.io/media/screenshots/1f4/1f47ffb3d0c01c452797811a2bef852c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 259, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["KEMCO", "Kotobuki Solution Co"], "genres": ["Adventure", "RPG"], "publishers": ["Kotobuki Solution Co"], "esrb_rating": "Everyone 10+"}