{"id": 19115, "slug": "7th-legion", "name": "7th Legion", "name_original": "7th Legion", "description": "There's no Salvation from this army! <br/>Can you survive this furiously fast, kill-for-money, real-time blood-fest? There's nowhere to hide as you smash your opponent in'to-the-limit' conflict. And, while you've got a few nanoseconds to spare, you've got to build to survive, mechs, tanks, troops, mounted slavens - a host of murderous military units who will hone their killing skills with experience.<br/><br/>Just what devastating effect does a 7th legion priest have in battle? what happens when you summon the dark legion?<br/><br/>The landscape is isometric and you've got to be ice-cool to survive in the blazing heat of combat. And there's more! Random power ups and a massive selection of battle cards that can turn the tides of war in a flash. But be careful: you don't know what cards your opponent is holding and even when you've got his last trooper cornered he might play the battle card that wipes away your entire force!<br/><br/>Salvation? They'll be lucky to find a stone to crawl under! 7th Legion<br/><br/><br/><strong>Game Features:</strong><br/><br/><ul><li>Jump into over 40 massive missions including indoor and night scenarios.<br/></li><li>Beat the clock in special timed sub-missions.<br/></li><li>Manage your force's skill and accuracy using the experience-based ranking/promotion system.<br/></li><li>Change the course of battle at key moments with ranom power ups and battle cards.<br/></li><li>Soundtrack included!</li></ul>", "metacritic": null, "released": "1997-09-29", "tba": false, "updated": "2023-01-02T18:57:31", "background_image": "https://media.rawg.io/media/screenshots/48f/48f286898cf81d09f56343401536ec61_3n6bWlW.jpg", "website": "http://www.retroism.com", "rating": 3.0, "rating_top": 4, "added_by_status": {"yet": 7, "owned": 137, "beaten": 2, "toplay": 3, "dropped": 3}, "playtime": 1, "achievements_count": 0, "ratings_count": 7, "suggestions_count": 430, "game_series_count": 0, "reviews_count": 7, "platforms": ["PC"], "developers": ["Epic Games", "Epic MegaGames", "Vision Software"], "genres": ["Action", "Adventure", "Strategy"], "publishers": ["Nightdive Studios", "Retroism"], "esrb_rating": "Mature"}