{"id": 19118, "slug": "challenge-of-the-five-realms-spellbound-in-the-wor", "name": "Challenge of the Five Realms: Spellbound in the World of Nhagardia", "name_original": "Challenge of the Five Realms: Spellbound in the World of Nhagardia", "description": "The multi-dimensional world of Nhagardia is quickly becoming paralyzed by the evil lord Grimnoth's terrifying plague of darkness. As Prince of Alonia, you now have 100 days to keep the world from being cast into eternal despair!<br/>\n<br/>\r\nBut is 100 days enough? After all, in addition to confronting Grimnoth's evil forces, you'll have to unlock the many mysteries behind his power. And you'll need to overcome the myriad obstacles that dot each realm!<br/>\n<br/>\r\nDefeat a menacing band of traitors intent on conquering your kingdom; journey beneath the ocean to a vast underwater land; venture into the core of the world to find hidden secrets; fly to the majestic kingdom of the sky and experience the magic and wonder of the enchanted forest.<br/>\n<br/>\r\nYour actions will determine the fate of Nhagardia as you journey through Challenge of the Five Realms, an original fantasy role-playing adventure from gaming hall-of-famer Marc Miller.<br/>\n<br/>\r\nYou'll experience an array of wondrous and unpredictable scenarios. Each brought to life by compelling animations, streamlined character generation and a truly unique story line!<br/>\n<br/>\r\nGrimnoth has thrown down the gauntlet, are you brave enough to pick it up?!!", "metacritic": null, "released": "2015-04-01", "tba": false, "updated": "2019-08-28T22:09:24", "background_image": "https://media.rawg.io/media/screenshots/1e5/1e5aeb4450cca00b5e5c66b49229355b.jpg", "website": "http://www.retroism.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 69}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 348, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC", "Linux"], "developers": ["MicroProse Software"], "genres": ["Adventure", "RPG"], "publishers": ["Nightdive Studios", "Retroism"], "esrb_rating": null}