{"id": 191222, "slug": "beatpitchmayhem-jacob-galoci", "name": "Beat.Pitch.Mayhem (Jacob Galoci)", "name_original": "Beat.Pitch.Mayhem (Jacob Galoci)", "description": "<p>While preparing for the upcoming opening of the club, Digital Jynx finds a dusty, concealed record tucked away on the top shelf of the supply closet. Always looking for new sounds, he tucked the track in with the rest and continued prep work. Later, when the night is in full swing, DJ decides to mix it up and freestyle with the new track, but when the vinyl falls into place a mysterious energy blows him out of the DJ booth and onto the dance floor. With the obstacles out of the way, the demon that emerged in the Malkior summons monster-spawning portals at the main speaker units in each section of the club, and the crowd enters a mindless dancing trance from the music. Digital Jynx, headphones in place to avoid the trance-inducing sound, must reach the main speaker unit in the center of each section of the club to stop the monsters from spawning and release the grip that Malkior has on everyone, then confront him and take back your club</p>\n<p>B.P.M. is a first-person action suspense game that utilizes the beat of the music to dictate the enemies’ movement and attacks. Enemies can be manipulated through the use of various gadgets, and require a combination of skillful navigation and gadget combinations to “defeat”. Through the artistic style of the environment and the dimly lit, foggy surroundings, movement around the area is limited by the suspenseful atmosphere. The player’s progression through the levels are rewarded with gadgets, all of which are then used to defeat the final boss. </p>", "metacritic": null, "released": "2017-10-11", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/517/51732ce9a162a70eaa526c7aba593eee.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 31, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Jacob Galoci"], "genres": [], "publishers": [], "esrb_rating": null}