{"id": 19132, "slug": "dungeonrift", "name": "DungeonRift", "name_original": "DungeonRift", "description": "Join Sir Bucket and his friends in their peaceful journey through <strong>DungeonRift</strong>!Kill everybody on the level, grab the loot and move to the portal. But what's that? Monsters are following you! And they're becoming stronger and smarter! And the dungeon itself transforms into a darker, crippier and more dangerous place! How long will Sir Bucket survive?Monsters are persons too!Monsters are leveling instead of the player. Each enemy in DungeonRift has its own perks and abilities that they learn randomly, creating surprising and dangerous combinations. Every run won't be the same - different monsters choosing random perks will force Sir Bucket to adapt his strategy every time.<br/><br/>Obliterate your foes, explore the Rift, unlock new weapons and meet new rivals in your endless struggle in <strong>DungeonRift</strong>!Main features already developed:<ul><li> Fast and dynamic action;<br/></li><li> Various abilities and perks for monsters;<br/></li><li> 150+ of dungeon layouts;<br/></li><li> Menacing traps;<br/></li><li> Weapons with different mechanics;<br/></li><li> Player progression system;<br/></li><li> Two playable characters;<br/></li><li> Dark humor;<br/></li><li> Funny collectibles;<br/></li><li> Sweet and tasty hand-drawn art;<br/></li><li> Dynamic music by <strong>John Leonard French</strong>.</li></ul>In the past...DungeonRift was born as concept-project for a contest and rapidly became our obsession. We were very happy to see people playing our alpha-version and that's why we've decided to turn our last free version into a complete and polished product. That's what we've called the demoversion - you can download it right now and get the feel of DungeonRift. Most of the aforementioned features are there - you could decide for yourself, to support our project or not, carefree.In the future...We're planning to fill DungeonRift with content and new features in upcoming months. <br/>Content-wise - updates with weapons, characters, monsters, perks and locations planned to be frequent and regular.<br/>Feature-wise - we are very excited to add local-coop to our game and to make monsters' proficiency-system which will make them choose one of the two evolutions paths in mid-game therefore making the gameplay even more unpredictable and interesting.<br/>There is much much more we've planned in the future, but we don't want you to bet on our promises - check the demo and join the early access if you are interested in where it's going.Supersecret PolandRift game mode!In this game mode you take control of Poland Ball and guide him through endless dungeons on his way into Space. But there is a lot of other countries, starving for his soul... And oil. Does Poland have oil? Never mind...", "metacritic": null, "released": "2015-07-01", "tba": false, "updated": "2019-08-28T22:09:24", "background_image": "https://media.rawg.io/media/screenshots/81d/81dbb501c7cc5b49585e0716ddd491cf.jpg", "website": "http://dungeonrift.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 64, "beaten": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 262, "game_series_count": 0, "reviews_count": 1, "platforms": ["macOS", "PC", "Linux"], "developers": ["RiftyGames"], "genres": ["Action", "RPG", "Casual", "Indie"], "publishers": ["RiftyGames"], "esrb_rating": null}