{"id": 19140, "slug": "awareness-rooms", "name": "Awareness Rooms", "name_original": "Awareness Rooms", "description": "When I came to, I was in a room I knew nothing of.<br/><br/>As I looked around and checked objects, opened doors, operated machines, I slowly gained awareness...<br/><br/>Eventually I was able to perform various actions.<br/><br/>From searching blindly, to solving puzzles actively.<br/><br/>Relying on what I have made sense of, I have found my way out of here.<br/><br/><br/><br/><br/>This is a new type of escape game.<br/>However, it is a little different from ordinary escape games; the girl doesn't have enough \"awareness\" in the beginning, and she can only recognize a \"fridge\" as \"a large metallic box\" or \"tree\" as something with \"rough and busy texture\".<br/><br/><br/><br/><br/>So, as I said, this is a new style of escape game where you don't even have a clue nor puzzle to solve!<br/><br/>...Of course, you can escape eventually. <br/><br/>When you \"Check\" or \"Interact\" with the objects in the room, your \"Awareness\" level increases and the girl starts to recognize the true form of each object.<br/>For example, the girl picks up something-or-other at some point but she has no idea what it is or how to use it: once she has increased her \"Awareness\" level to a certain amount, she now realizes it is a \"handle-like object\" and can be used somewhere.<br/><br/><br/><br/>When I was playing the game, I felt like I was quickly re-experiencing the days of a baby improving its sense of perception by feeling everything in the surroundings. Also the game gave me lots of \"Aha!\" moments (a.k.a. the eureka effect). In any case, it was very pleasant experience.<br/><br/>It's not the end when you maximize your \"Awareness\" level, instead it's the beginning of the puzzle. When you get stuck, go back-to-the-basics; \"Check\" and \"Interact\" all the objects again!A small hint:When you \"Check\" or \"Interact\" the object, a \"?\" or \"!\" icon over the girl's head will appear, if it has no colour, you'll know you are already \"aware\" of those objects.<br/>When the level reaches 50% or 100%, the colour will come back and you will have detailed information for the objects.<br/><br/>When you use/lose the item, usually you can collect it again at the place where you found it. So stop whining and run for the item! (Sorry, the girl cannot run)<br/><br/>When you already have too many items and no space for a new one, you should go back and put another item back.<br/>You can place the item by using it at the same place where you found it (same action as when you pick it up).<br/><br/>Controls (keyboard recommended):<br/>Move: Arrow keys<br/>Check/Interact: Z key<br/>Switch action: Hold the left Shift key and select with Arrow keys<br/><br/><br/><br/>When confronted with something you don't really understand, you feel things like fear, or curiosity, but sometimes you also feel enjoyment when you start to make sense of it.<br/><br/>I wanted to recreate that feeling in a game, so I made \"Awareness Rooms\".<br/>I hope you will also feel the pleasure of the vague gradually taking shape as you solve each puzzle.", "metacritic": null, "released": "2016-06-16", "tba": false, "updated": "2024-02-07T18:00:34", "background_image": "https://media.rawg.io/media/screenshots/8dc/8dc0a16f92639bb84a065e996c785d11.jpg", "website": "", "rating": 3.83, "rating_top": 4, "added_by_status": {"yet": 2, "owned": 40, "beaten": 4, "toplay": 2}, "playtime": 2, "achievements_count": 5, "ratings_count": 6, "suggestions_count": 73, "game_series_count": 0, "reviews_count": 6, "platforms": ["macOS", "PC"], "developers": ["GAME NA KIBUN"], "genres": ["Adventure", "Indie"], "publishers": ["AGM PLAYISM"], "esrb_rating": null}