{"id": 191437, "slug": "zomball", "name": "Zomball", "name_original": "Zomball", "description": "<p><strong>Zomball (Web) now available!</strong></p><p>Welcome to the first World Zomball Challenge!<br/></p>\n<p>Despite pity misfortune (so-called ‘zombie apocalypse’) we continue to please our sports fans! And somewhat new world order encourage us to create something new - Zomball!</p>\n<p><strong>Zomball is like an old fashioned Basketball</strong>. You have a ball. Enemies have a basket. You have to bounce your ball while moving to enemies’ basket. And your goal is shoot your ball right through it. You can earn 2 or 3 points for successful shot depending on shooting zone.</p>\n<p><strong>Zomball is more than just a Basketball</strong>. Zombies stand between you and your goal. Also you have a time limit to perform your offense. So move quickly or enemies will gain 2 points!</p>\n<p><strong>Zomball is also a Shooter</strong>. You can hit your enemies with your magical ball and even kill them! Don’t worry, it’s as magical as full of nanomachines so it will return to you automatically. But beware of getting too close to zombies: if they eat your player your enemies will gain 3 points!</p>\n<p>For the past few years zombies ate a lot of decent people. But we succeeded in finding perfect athletes! Each of our Zomball team’s member is a real Basketball (amateur) veteran. They all know how to play Basketball and don’t want to be eaten by zombies! What a perfect mix for Zomball!</p>\n<p><strong>CONTROLS</strong>:</p>\n<p>WASD/Arrows - movement</p>\n<p>Mouse - aim</p>\n<p>LMB - throw ball to hit zombies</p>\n<p>RMB - basket shot: hold to aim, release to throw</p>\n<p><strong>CREDITS</strong></p>\n<p>Elena Nikitina - gamedesigner / sound designer</p>\n<p>Nick Feofentov - Unity developer</p>\n<p>Anastasiya Klieshchova - 2D artist<br/></p>\n<p>The game was made for Ludum Dare 41 during Kyiv Indies Game Jam.<br/></p>", "metacritic": null, "released": "2018-04-25", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/575/57590c6f791a38dcc495d4bafc558d51.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 54, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Nick Feofentov"], "genres": ["Shooter", "Sports"], "publishers": [], "esrb_rating": null}