{"id": 191659, "slug": "firefighter-atv-bike-helicopter-rescue-2018", "name": "FireFighter ATV Bike: Helicopter Rescue 2018", "name_original": "FireFighter ATV Bike: Helicopter Rescue 2018", "description": "<p>Play best firefighter simulation with ATV quad bike and rescue people with the help of rescue helicopter. 911 rescue fire ATV firefighters are on their way but you know how network works. The roads are jam packed and it’s time to show what you have learned on the training sessions. The rider of your firefighting quad bike is also on a leave so you have an additional task of riding the firefighter ATV bike too. Become a firefighter atv bike rider and also firefighter helicopter rescue pilot In this Firefighter ATV Bike: Helicopter Rescue 2018. Play best of rescue games 2018 with the new idea of Quad bike firefighter and forget fire truck driving games and firefighter truck simulation games with 3D fire fighting gameplay.<br/><br/>Helicopter fire fighting games 3d were never been so amazing! Start helicopter rescue simulation 2018 and rescue people with the help of your rescue helicopter. You are 911 rescue helicopter pilot and you have to operate your fire fighting helicopter in fire engine missions and complete fire emergency helicopter levels on time. Emergency locations will present a challenge of blazing disasters. Grab your ATV bike and become a firefighter atv quad rider and race to save lives, and display the courage of a real firefighter. Put on your helmet and get ready for an adventure as firefighter rescue rider and rescue helicopter pilot to extinguish the danger in rescue games 2018. Lead firefighter rescue missions from helipad in Chinook aircraft. As courageous fire ATV bike rider, rush to burning places in city and start extinguishing flames. Start evacuation mission and save citizens lives when you are on patrol your 911 helicopter and rescue quad bike.<br/><br/>FireFighter ATV Bike: Helicopter Rescue 2018:<br/><br/>• Multiple ATV firefighting bikes &amp; firefighter helicopter choppers.<br/>• Thrilling city rescue missions with HD gameplay.<br/>• New York City environment with awesome 3D graphics.<br/>• Rescue animated people &amp; complete firefighter ATV bike missions.<br/>• Smooth, easy &amp; addictive gameplay.<br/>• Play as modern firefighter &amp; operate helicopter to rescue people.<br/><br/>Become a pilot of modern firefighting helicopter or rider of firefighting quad bike will give you the opportunity of flying a Helicopter through different parts of the city and rescue people. Ordinary Firefighter trucks or fire-fighters do not have access on these locations in rescue games 2018. Fill water tanker from nearby lake and fly chopper helicopter force over the grand NY city to extinguish fires from houses, buildings and save people in burning places. You will surely enjoy the fusion of Helicopter fire fighting games 3d. Download now Firefighter ATV Bike: Helicopter Rescue 2018 and complete NY City Firefighting rescue missions.</p>", "metacritic": null, "released": "2018-04-24", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/820/82026fbb5c762f6cf97374fc87ee4ce3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 155, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Tap Play Game Studio"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}