{"id": 191812, "slug": "the-red-fighter", "name": "The Red Fighter", "name_original": "The Red Fighter", "description": "<p>The Red Fighter is an independently developed game. It is a top-down space shooter with an arcade-style look and feel. The game currently features an arcade mode where your sole objective is to survive as long as you can by defeating incoming enemy ships. The longer you survive the more enemies you will face. Points are awarded for each enemy ship you destroy. Power-ups are provided periodically and include features such as fire rate increase, point multipliers and health restoration. Aside from the point multipliers, you are awarded bonus points at the end of the game for not using the health restoration or fire rate power-ups.<br/></p><p>See how high of a score you can get!</p><p><strong>Update(s)</strong><br/></p><p>4/18/2017 - Added OS X version for download, mission mode option added (this is in preparation for future update)</p><p><strong>Current Controller Support</strong></p><p>Wired Ps4 controller (it is recommended to have the device connected to your computer prior to running the game)</p><p><strong>Future Plans</strong></p><p>More features are planned for The Red Fighter and they include Mission Mode, additional controller support, more weapons, saving and loading progress and of course, more enemies!</p><p><strong>Feedback</strong></p><p>Please feel free to provide any comments on the current game so it can be improved along with something you wish to see in future updates.</p>", "metacritic": null, "released": "2017-04-11", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/f02/f0243350367b8967deccb6d88afe3913.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 63, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["NotDaiquiri"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}