{"id": 19194, "slug": "ship-simulator-extremes", "name": "Ship Simulator Extremes", "name_original": "Ship Simulator Extremes", "description": "\t\t\t\t\t\t\t\t\t\t\t\tEver wonder how it feels to sail a half-million-ton supertanker through the perfect storm? To take on illegal whale hunters in the Antarctic?  Or to feel the rush of being part of the Coast Guard as you evacuate a cruise liner in distress? Ship Simulator Extremes has players take on exciting missions all over the world as they pilot an impressive array of vessels and live the stories of real ship captains. With missions based on actual events in realistic environments at locations all over the world, the new Ship Simulator game is sure to take you to extremes!<br/> <br/> <strong>Key Features:</strong><br/> <ul><li>From the very hot to the very cold, sail to the most enchanted regions in the world. Explore the Antarctic or take in beautiful Bora Bora. Includes famous harbors and locations from around the world.<br/> </li><li>Wide range of vessels to captain, including hovercraft, Coast Guard interceptors, mammoth tankers, tugs, cruise liners, and many others.<br/> </li><li>Includes exciting storylines and missions from all over the world.<br/> </li><li>Save the environment campaign: sail famous Greenpeace ships and take on ecological missions based on real events!<br/> </li><li>Realistic water and weather system. Sail calm waters or take on the most extreme weather ever witnessed at sea.<br/> </li><li>Online multiplayer mode. Sail online with your friends.<br/> </li></ul>", "metacritic": 49, "released": "2010-08-27", "tba": false, "updated": "2023-07-05T19:23:16", "background_image": "https://media.rawg.io/media/screenshots/558/5585c4ba030cc8b1bec7004dcd7da68d.jpg", "website": "http://www.shipsim.com/", "rating": 2.12, "rating_top": 1, "added_by_status": {"yet": 8, "owned": 268, "beaten": 1, "toplay": 1, "dropped": 5, "playing": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 16, "suggestions_count": 318, "game_series_count": 0, "reviews_count": 16, "platforms": ["PC"], "developers": ["VStep"], "genres": ["Simulation"], "publishers": ["Paradox Interactive"], "esrb_rating": null}