{"id": 192057, "slug": "who-is-the-virus", "name": "Who is the virus", "name_original": "Who is the virus", "description": "<p>\"Who is the virus?\" is a very simple game played from the command-line prompt, entirely coded in the Go Language. </p>\n<p>The object is simple. You have a file system with 100 files, all having a person's name. One of them is a virus, the others are not. In order to find out which file is the virus, all you can do is try to run one of the files and they will give you hints about the virus, but here's the rub. All the hints you get are lies. If you run the virus, it's game over. If you manage to delete the virus you win your game.</p>\n<p>For every file you run in order to obtain a hint you get 1 point. For every file you delete that was not the virus you get 10 points. Try to delete the virus with as little points as possible.</p>\n<p>A general playing tip:<br/>When you've eliminated all the impossible, whatever remains, however improbable, must be the truth -- Sherlock Holmes.</p>\n\n<p>How does the game work.<br/>As this game is a bit of a fake-os, inspired a bit by both DOS and Unix, the game will ask for a username and password. This is just in order to create a savegame file, and the game does it in style. Be wise and DON'T use any username and especially not passwords you use for real. The protection is non-existent, any experienced individual can 'hack' that. This is just a silly game after all and the system only does it to create your savegame file... Nothing more.</p>\n<p>When you see OK &gt; you can type \"HELP\" to get an overview of all the commands the game supports. Like DIR to get all files you have (if you are more accustomed to Unix commands, you can also use LS in stead).  You can 'run' a file by just typing its name. Please note, all filenames are CASE SENSITIVE so look well at the lower and upper case usage. Commands are case insensitive. With the \"DEL\" or \"RM\" command you can delete a file if you think it's the virus. </p>\n<p>If you have a Game Jolt account, you can get a few trophies and log your scores to your Game Jolt account by using the command \"GAMEJOLT <username> <token>\". The system will save your credentials to your savegame file.</token></username></p>\n<p>If you have any suggestions or bugs to bring up, please bring them to my issue tracker on GitHub.</p>", "metacritic": null, "released": "2018-04-29", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/cce/cce9146d0b13d5f467c33c46c8220162.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 142, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Phantasar Productions"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}