{"id": 192244, "slug": "cube-flicks-3d", "name": "Cube Flicks 3D", "name_original": "Cube Flicks 3D", "description": "<p>Category:<br/>Arcade, Adventure<br/>Ios Keywords:<br/>speed,jump,hit,smash,flick,tunnel,impossible,gravity,run,geometry,dash,rush,ride,unpossible,race,3d<br/>Description:<br/>Unlimited unpossible racing action awaits you..! Take up the impossible geometry challenge with simple physics control!! Flick the cube, jump over geometry rush of an obstacles and dash the previous score and beat the new records. Grab the ultimate speed rush challenging game “Cube Flicks 3D Rush”! Have fun with amazing endless cube running game.</p>\n<p>Cube Flicks 3D is one of the impossible and highly reflexive gameplays that will knock you of your feet!! Run, survive obstacles, play through 50 addictive levels and take the impossible mission to set a record for others.</p>\n<p>GAMEPLAY:<br/>This Impossible game Cube Flick is an extreme running action over 3D obstacles on your geometry path. All you need to do is to make the cube flick, jump, dunk or roll and pass through the shapes. The major challenge in this Cube Flick geometry environment game is to survive the running cube while avoiding various obstacles.</p>\n<p>NOTE: Remember, every split second of the game matters..! The game needs the utmost concentration to avoid the obstacles. So, play this game in an isolated area away from distraction.</p>\n<p>HOW TO PLAY:</p>\n<p>&amp;dashUse Spacebar Or UpArrow In Keyboard to make the cube bounce/roll/dunk/slide</p>\n<p>&amp;dash Avoid various obstacles (spikes, blocks, balls etc.)</p>\n<p>&amp;dash Survive and run as far as possible!</p>", "metacritic": null, "released": "2017-11-08", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/c1c/c1ccf9cf31b8e0c199bd4216e91a9312.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 32, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Android", "Web"], "developers": ["AkhilBhaskarNitta"], "genres": [], "publishers": [], "esrb_rating": null}