{"id": 192243, "slug": "meeting-pigman", "name": "Meeting Pigman", "name_original": "Meeting Pigman", "description": "<p><strong>The Origin</strong><br/></p>\n<p>The whole concept of Meeting Pigman was based on a  dream of mine about a year ago. It was definitely impressive to me that I could still recall the dread, nervousness and the sense of helplessness while in the dream. These  emotions are what I aim to represent throughout this environmental experience game.</p>\n<p><strong>The Experience</strong></p>\n<p>This game will bring you to an isolated and creepy house with the first person perspective  of a little girl who wanders and feels confused by all fugitive phenomena and arrangements all around just like you do. But when you found the note that seems written from someone hiding in this house, this place would be ready to take you to the mystery that might require a lot of searching. Of course, according to the title, you know who you are going to look for - the Pigman.</p>\n<p><strong>The Connotation</strong></p>\n<p>With the dark red flood, blood-like waterfalls, stains everywhere, it can be interpreted that this place represents the little girl's chaotic and unstable state of mind. All these clips, belongings and weird incidents are the flashbacks or memories of her past. The experience of find Pigman would also be the process of gaining self-discovery and self-acceptance. More than that, I want to further inspect the topic of mental illness, which often relates to the influences from childhood, family and self-cognition. In this game, I didn't attach a fixed definition to the distressing experience of the little girl because I prefer to let these ambiguous occasions to invoke players' own understanding and connection by the household scenes in game compared to their own emotional moments.</p>\n<p><strong>The Self-Reflection</strong></p>\n<p>While I was producing the game, I soon realised why I would be so impressed by this game. My explanation to my self was that I have been living with the anxiety of studying and living aboard for a long time. When I was homesick or depressive while recalling my memories back home, they always seem obscure and unfamiliar, which caused another sense of disacquaintance to myself.</p>\n<p><strong>Inspirations</strong></p>\n<p>On the aesthetic  standard, a part of my design choices and inspirational ideas were impacted by the game Postal 2. I love its colour scheme but to fit my own vibe, I chose more colour contrasts to bring out the intense and chaotic atmosphere.</p>", "metacritic": null, "released": "2018-05-25", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/2dd/2dd4a7d0e4a86efc27fe41994bf481bf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 56, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS"], "developers": ["KinoZhang"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}