{"id": 192402, "slug": "treasure-quest-3", "name": "Treasure Quest!!", "name_original": "Treasure Quest!!", "description": "<p><strong>Quick Credits Edit: The font used in the game is the Larua font by Jupiter Hadley!!</strong></p><p><strong>FAQ<br/></strong></p>\n<p><strong>Q: Why are you putting out the demo now even though you acknowledge it's not finished?</strong></p>\n<p>A: It's mainly my disillusionment with RPG Maker MV. The thing is, the engine's just not very well optimized. My computer has trouble running it properly it without the occasional lag spike. Every game made in MV has run badly on my computer and it's been a general issue that I've seen with people. It's a completely subjective problem, since it can run perfectly fine for some people (like that Driftwood Gaming person). And so I asked myself: \"why bother to keep working on something that only a few people could properly enjoy?\"</p>\n<p>And so, I've decided to say \"fuck it\" and put up what I already have. If RPG Maker MV improves in the future, I<em> would </em>consider going back to this, however....</p>\n<p>A second reason why I'm stopping work for now is my poor sense of scope. Initially, the game started out as an odd guy hopping into these caves while being chased by his rival and it was originally intended to be a Space Funeral-like. I ended up taking it more seriously as I went along and as I went on I began thinking of expanding on the concept of an adventuring economy/culture and putting subplots revolving around it and I ended up thinking up of adventuring NPCs that show up to travel alongside Quiddity with their own plots and -</p>\n<p>Basically, Treasure Quest!! is starting to suffer a bad case of feature creep, and as a solo dev, it's become something unreasonable, even if RPG Maker MV worked perfectly. Honestly, if I'm going to revisit this, it's going to have to be massively scaled back. And if I do that, it may as well be in a different engine entirely.</p>\n<p>So yeah, here's what people will be getting of Treasure Quest!!. Consider its flaws my punishment for my hubris.</p>\n<p><strong>Q: What did you have planned for the future?</strong></p>\n<p>A: I'll only say what I had planned for the second town and information based on the first, in case I ever actually do revisit this game:</p>\n<ul><li>Quiddity finds himself inside a coral reef house, rescued by this walking jellyfish named Ludo. They live on the outskirts of their fellows' small settlement, which is very steeped in tradition. Ludo becomes the second party member, with dreams of breaking out of their circle of society and seeing the world beyond - but they also have other reasons for wanting to leave their town.<ul><li>Ludo's main weapon is books and their list of skills that they learn are far more varied than Quiddity's. They would also use MP instead of Quiddity's TP.</li></ul></li><li>To get back on the proper path, Quiddity and Ludo have to start climbing Babel, a mysterious tower that runs through the underground that connects the various civilizations that's believed to have been built by the same people that made the mysterious statues. But they have to deal with bureaucracy first, so they register as a team with the Adventuring Association (player can name it whatever).<ul><li>The sidequests and later optional goals in the game would factor into this reputation system that gives the team more clout in the adventuring world. How exactly would I do that and to what extent? See, this is feature creep in the work, fellas.</li></ul></li><li>Whittaker recruits Steve as a bodyguard along with Salem as a magic expert; as she'd be classified as a research assistant, she'd bypass the regulations preventing her from going deeper. The research group will pop up around the game, investigating the statues like the one you find Whittaker at. For specific stuff at the point you meet them together:<ul><li>Steve will have abandoned his persona as \"The Dude,\" realizing that it's kinda lame and tasks Quiddity to find him some different gear again. He admits to Quiddity his insecurities about his identity and that he went into the caves to prove himself to others; his initial claw weapon is also cosplay based on a show he watched - Quiddity encourages him to stick by it. He can also be challenged to a spar.</li><li>Salem drags the magic plant from her house around, requiring the party to look for materials to feed it. She continues to get maniacal about it as her magic plant continues to grow as you go through the game...</li><li>Whittaker is hesitant about keeping the group around, but is excited about investigating the statues. He tasks you with finding an artifact from the dungeon, and doing his quest leads to him not paying Quiddity again.</li></ul></li><li>You can rematch a stronger, fully awake Ms. Sunshine to get reputation.</li></ul>\n<p><strong>Q: Why cards?</strong></p>\n<p>A: [thinking about that Triple Triad]</p>\n<p><strong>Q: What was supposed to be in the rest of the display cases at the beginning?</strong></p>\n<p>A: More foreshadowing stuff that will no longer happen I guess</p>", "metacritic": null, "released": "2017-12-24", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/99d/99d2263c691b2ae1d5e0a7a059cc2b4c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 49, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["scitydreamer"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}