{"id": 19240, "slug": "europa-universalis-iii-complete", "name": "Europa Universalis III Complete", "name_original": "Europa Universalis III Complete", "description": "<p>The third Europa Universalis game offers the player to lead a major world civilization through the Early Modern era. Unlike its predecessors, Europa Universalis III uses 3D graphics instead of 2D.</p>\n<h3>Gameplay</h3>\n<p>The player chooses a country and administers its diplomacy, economy, military, and society. The game has an emphasis on development rather than war, and the combat system does not allow you to directly control the units. You can pick any time period from between 1453 and 1789 and any country from a roster of 300. Despite the series&#39; title, civilizations are not limited to Europe. </p>\n<p>The country&#39;s current leader and state of affairs are generated on the basis of real history. Once the player enters the game, however, the events are randomized and only depend on the player&#39;s actions. A new feature introduced in EU3 is that the player can hire up to three court advisors (EU’s equivalent to Civilization’s “great people”). Each advisor has his or her area of influence and helps to improve the empire’s science, culture, or army. </p>\n<h3>Expansion packs</h3>\n<p>Contrary to its name, Complete edition doesn&#39;t include all of EU3 expansion packs (it is Chronicles edition that does), but only two of them: Napoleon&#39;s Ambition and In Nomine. Napoleon&#39;s Ambition is set after the main game&#39;s timeline, lasts until 1821, and deals with the Napoleonic Wars. By contrast, In Nomine begins in 1399, and includes late medieval features like Byzantine Empire, Tamerlan&#39;s conquests, and the Hundred Years War.</p>", "metacritic": 83, "released": "2007-01-22", "tba": false, "updated": "2024-03-06T03:02:15", "background_image": "https://media.rawg.io/media/screenshots/894/894b41c4664f51b692e07d57c2c2ae1e.jpg", "website": "http://www.europauniversalis3.com/", "rating": 3.32, "rating_top": 4, "added_by_status": {"yet": 72, "owned": 1257, "beaten": 26, "toplay": 4, "dropped": 23, "playing": 2}, "playtime": 2, "achievements_count": 0, "ratings_count": 71, "suggestions_count": 448, "game_series_count": 0, "reviews_count": 71, "platforms": ["PC", "macOS"], "developers": ["Paradox Development Studio"], "genres": ["Strategy"], "publishers": ["Paradox Interactive"], "esrb_rating": "Teen"}