{"id": 192551, "slug": "what-old-people-used-to-do-back-in-the-days-there-", "name": "What Old People Used To Do Back In The Days There Weren't Any ACs", "name_original": "What Old People Used To Do Back In The Days There Weren't Any ACs", "description": "<p>Lore:<br/>You're some kid. It's summer, august as a matter of fact. During the hottest of days you're lying on the ground, about to pass out. You ask your grandmother who is standing beside you: \"What did old people do back in the days there weren't any air conditioners?\" Before you can get a clear response you fall asleep. You find yourself in the past, probably some time around the bronze age. You're surrounded by 10 or so people who inform you (and you understand somehow) that they're poor people who've fled from war. Seeking peace and serenity they decide to found their own little town between two rivers. However they also insist that you're a \"wiseman\" who knows many things they will never even imagine. That time flows different for you, one month for them is but a second for you so long as you don't focus on them. Somehow you accept this (this is a dream after all) and decide to rule over your very on ancient kingdom. That is with the ultimate goal of gathering enough resources to build the world's oldest air conditioner!</p><p>Controls: W-A-S-D and the arrow key control direction. Click on the button in the center of the screen when you're near a forest, ore deposit or river. This will allow you to connect it to your town's network and gather supplies. However your subjects aren't immediately familiar some of your ideas, so you'll have to answer their requests in order to increase their understanding of technology. At the start of the game you may only build camps in forests.</p><p>Notes: Only one pump per river.</p>Edit: Sorry for Reuploading late. There were several gamebreaking glitches (instant game over and soft locks) that needed to get fixed which I somehow happened to miss.", "metacritic": null, "released": "2016-08-29", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/713/713a97d26df93aa15ce4352f0911794b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 10, "game_series_count": 0, "reviews_count": 0, "platforms": [], "developers": ["themadprogramer"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}