{"id": 192521, "slug": "destroy-the-earth-like-a-boss", "name": "Destroy The Earth Like a Boss", "name_original": "Destroy The Earth Like a Boss", "description": "<p>To play online: https://www.scirra.com/arcade/multiplayer-games/destroy-the-earth-like-a-boss-2118<br/>Official page: http://cms.lorenax-s-crazy-games.webnode.es/<br/>Destroy the Earth like a Boss is a multiplayer crazy game. In this game you can be a god or a devil. Gods and Devils will fight for destroy the Earth. They will use a space rocket to hit the earth and put it in a black hole.<br/>STARRED<br/>-Cthulhu<br/>-The Deep Ones<br/>-Christ<br/>-Satan<br/>-Beholder<br/>-Slime</p><p>My other games:</p><p>Destroy The Earth like a boss on gamejolt:</p><p>download:http://gamejolt.com/games/destroy-the-earth-like-a...<br/></p><p>Browser version:https://www.scirra.com/arcade/multiplayer-games/de...<br/></p><p>The Call of Baby Chtulhu:</p><p>Legend has it that the day in which someone fall asleep while reading the Necronomicon, Cthulhu will appear in a dream to send an important mission. For now nobody has thought asleep reading it, but what will happen the day? what will happen if cthulhu is still a baby and missing millions years for his adolescence? Will Cthulhu adolescence and unbalanced as disastrous as all of us? Will someone bully him ? Perhaps many of those questions will not be answered in this game, but discover how the land can move through space with only a magnet and a few deodorant spray, dodging asteroids and space snakes ...<br/>Are you going to miss it?<br/></p><p>http://gamejolt.com/games/the-call-of-baby-cthulhu...<br/></p><p>The God of Sanbox´s Adventure:</p><p>Meet this wonderful world where you will play as a god who likes to do good thinks and help people. But not everything will be easy, you must also confront evil sorcerers and supernatural beings who try to usurp your place as God.<br/>Under this premise presents \"The God of Sandbox's Adventure\", a game where you must complete different levels with puzzles and very different battles. From feeding a baby to save a penguin from their bullies, to defeat a magician. All it backed up by an original way to play, where you must use your powers to create objects and perform spells to help complete these levels; and a graphic cartoon handmade with a curious touch of computer that will give life to the adventure.<br/>What you expect to play?<br/></p><p>https://www.scirra.com/arcade/puzzle-games/the-god...<br/></p><p>Crazy car on gamejolt:</p><p>Crazy Car is like a car game, but with more destruction and more fun. You are a little but lethal tractor. You can destroy buildings, run very fast and shot a lot of things. . The game is finished, but maybe I will add some new version with new levels. Now ,PLEASE, STOP READING AND ENJOY DESTROYING.<br/></p><p>http://gamejolt.com/games/crazy-car/78553</p>", "metacritic": null, "released": "2016-07-17", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/526/5262d3ae805ff1953f94b85527f36a1c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 78, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["lorenax"], "genres": ["Sports"], "publishers": [], "esrb_rating": null}