{"id": 1926, "slug": "puzzlejuice", "name": "Puzzlejuice", "name_original": "Puzzlejuice", "description": "Puzzlejuice is a game that will punch your brain in the face.<br/><br/>-----------------------<br/><br/>\"Puzzlejuice is the only game puzzle fans need.\" - App Advice<br/><br/>\"Puzzlejuice is an enveloping world of gorgeous design, funky music, and falling blocks that you can’t help but fall in love with.\" - Slide to Play<br/><br/>\"It's an inspired effort that will tickle puzzle fans, word-game addicts and aficionados of smart design. Go get it now.\" - Kotaku<br/><br/>\"Loads of frantic gameplay, style and humor.\" - Touch Arcade<br/><br/>\"Every once in a while an iOS game breaks new ground and delivers something ingenious.\" - App Safari<br/><br/>\"Addictive combination of word and puzzle games. Slick presentation and incredible soundtrack.\" - Gamezebo<br/><br/>-----------------------<br/><br/>Puzzlejuice takes all of the elements of your favorite puzzle games and puts it into one convenient brightly colored package!<br/><br/>This game was designed to challenge both your spatial and verbal abilities and if you don’t feel overwhelmed then you might not be human. It’s a puzzle that will keep you hooked.<br/><br/>COME FOR THE PUZZLE. STAY FOR THE JUICE.<br/><br/>-----------------------<br/><br/>* HOW'S IT WORK? *<br/><br/>Multicolored BLOCKS constantly fall from the top of the screen and it’s up to you to arrange them. Once you complete a row with these blocks they will turn into LETTERS! The only way to clear out these blocks is to spell WORDS. Oh and also you can MATCH COLORS—that will make letters too. <br/><br/>* CORE MODE *<br/><br/>Test your endurance by seeing how long you can withstand the downpour. Complete objectives to unlock POWERUPS that will make you life easier as the game gets harder!<br/><br/>* ZEN MODE EXTREME *<br/><br/>Don't have a lot of time? Great! This mode is Zen because the blocks don't fall, so you don't have to worry about them piling to the top. This mode is EXTREME because you ONLY HAVE 90 SECONDS.<br/><br/>---------------------<br/><br/>\"LOCAL\" MULTIPLAYER: There's a lot to do in this game so it's great to play with friends! One of you can sort the blocks while the others look for words. Divide and CONQUER.<br/><br/>PICTURE-IN-PICTURE: We've packed the same experience into both the iPhone and iPad, but we know that phones are small and thumbs are big, so when you start spelling a word on the phone, a preview pops up to show the letters underneath your fingers!<br/><br/>GAME CENTER: Challenge your friends or try to become the world's best Puzzlejuice Master! <br/><br/>DICTIONARY: Spell a word and don't know what it means? No problem, tap on a word to look it up.  <br/><br/>FOREIGN LANGUAGES: Play the game in English, Spanish, French, Italian, or Dutch!<br/><br/>COLORBLIND SUPPORT: We've got you covered.<br/><br/>--------------------<br/><br/>It’s not your mother’s word game; it has balls. Brass balls. Puzzlejuice is for closers.", "metacritic": null, "released": "2012-01-19", "tba": false, "updated": "2019-10-22T13:57:03", "background_image": "https://media.rawg.io/media/screenshots/381/3815c2aedb152872821dc254c601c832.jpg", "website": "http://puzzlejuicegame.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 4, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 136, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Sirvo"], "genres": ["Educational", "Puzzle"], "publishers": ["Sirvo"], "esrb_rating": "Everyone 10+"}