{"id": 192718, "slug": "key-twister-fabio-marocchi", "name": "Key Twister! (Fabio Marocchi)", "name_original": "Key Twister! (Fabio Marocchi)", "description": "<p>This is a party game for 2 to 4 players using keyboard or joysticks. Single player modes are available too. The main feature of this game is non-determinism: the levels are randomly generated every time you play so that you can always have a new experience.</p>\n<p>The challenge is simple, but the path to  glory will not. Reach the bottom of the dice tower before your friends using your die, but be careful! During your fall to the finish line you have to avoid the hateful hands that will try to reroll your die, changing in this way your ability and your reflexes. Yes, we said ability, because depending on the one out of six faces of your die, you will be able to use a unique ability to take advantages over the other players.</p>\n<p>What are you waiting for? Join us in this crazy fall and challenge your friend (you might no longer be friends after trying this game) or play alone in the three single player modes: masochist (play against the countdown and hit the hands to gain time), never ending die (how far con you go with just six faces?) and ghost die (play against yourself to beat your own record).<br/><br/><br/>Developed during the Videogame Design and Programming course at Politecnico di Milano.</p>\n<p>Original page: https://polimi-game-collective.itch.io/key-twister</p>\n<p><strong>Credits:</strong></p>\n<ul><li>Artists:<ul><li>Simone Romei</li><li>Alessandro Tommasini</li></ul></li><li>Programmers:<ul><li>Marco Arnaboldi</li><li>Alessandro De Francesco</li><li>Fabio Marocchi</li></ul></li></ul>", "metacritic": null, "released": "2018-05-04", "tba": false, "updated": "2019-08-28T23:20:58", "background_image": "https://media.rawg.io/media/screenshots/a2e/a2eb49a1daea0a381260e94d1730da47.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 106, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Fabio Marocchi"], "genres": ["Racing", "Platformer"], "publishers": [], "esrb_rating": null}