{"id": 192717, "slug": "protonomathcards", "name": "ProtoNoMathCards", "name_original": "ProtoNoMathCards", "description": "<p>[Edit] Here the Game version after prototype:</p><p>We are a team called \"Five Heads Studio\" and we are participating in a marathon of a game development. A type of 12-week gamejam.<br/>The first screen of the game is written in Portuguese. It is an introduction and instructions on how to play. Just click on \"Start Game\" button to start the game prototype.<br/><br/><strong>How the game works:</strong><br/>- The game has a panel that shows three properties of a range of values. These properties are called \"Start\", \"End\" and the current value within the range, named \"Table\".<br/>- To win the match, you should discard all cards in hand.<br/>- The basic rule of the game is to keep the \"Start\" property less than or equal to the other two properties, and the \"End\" property greater than or equal to the two other properties. The \"table\" property will always be a value between (or equal to) the two other properties.<br/>- The cards can change any or all of the three values of the range.<br/>- It is only allowed to play a card if the result of the mathematical operation do not break the basic rule of the game.<br/><br/><strong>Prototype features:</strong><br/>- Each player receives five cards at the beginning of the match.<br/>- Click in the deck or type the \"space\" key to draw a new card, when it's your turn to play.<br/>- Pressing the \"R\" key restarts the game screen, having the same effect of the \"Play again\" button at the end of the match.<br/>- We let the player find out for yourself the key to activates the \"Easter Egg\" function :D.<br/>- To play a card, just click and drag it to the central region of the table. Only the cards with a blue border will be playable.<br/>- The \"Easter Egg\" function available may be in the final version as a special item, although this is an extra idea and is not even included in the GDD yet.<br/>- This prototype has only 29 cards to show the basic mechanics of the game.<br/><br/>We are waiting the feedbacks :].</p>", "metacritic": null, "released": "2016-10-01", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/7b5/7b51ed2c1df3ea9194d4b6e6322d7474.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 37, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["AdemilsonRodrigoMoreira"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}