{"id": 192895, "slug": "professional-footballer", "name": "Professional Footballer", "name_original": "Professional Footballer", "description": "<p><em><strong>‘Most important thing as a Professional Footballer is to know how to dive!’</strong></em></p>\n<p> In Professional Footballer upon losing possession of the ball, you must perform a Dive. The more spectacular the Dive, the more points and better score you’ll achieve – maybe even being recognised as the real Neymar.</p>\n<strong> Controls</strong>\r\nOnce you enter the dive state you need to add Force Triangles, which will apply forces to the various parts of the Footballers body. To do this follow these instructions:\r\n  \r\n- Click on a body part (in the Web build the body part won’t be highlighted, if you download the Unity build, it will be highlighted in that)\r\n- Next Right click where on the body part you want to apply the Force\r\n- As you move your mouse away you will see a Force Triangle, the longer it is the more force is applied\r\n- Once you’re happy with its length, right click again to finish placing\r\n- You can press Undo to delete the last Force Triangle placed\r\n- Finally click the Dive button when happy with everything\r\n<p> \r\n  </p>\n<p>This game was made for the Pizza Jam 3, where we had to choose a game title from a list of ZX Spectrum Games, but only base our game on the name – not the game itself: https://en.wikipedia.org/wiki/List_of_ZX_Spectrum_games\r\n  </p>\n<p>We chose the game Professional Footballer, and made this physics based Diving game (due to Footballers habits of flopping around on the pitch).\r\n</p>", "metacritic": null, "released": "2018-07-29", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/7cc/7cc96693e2c0fe3fe2f95c3ab5f103b8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 86, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["zubby"], "genres": ["Sports"], "publishers": [], "esrb_rating": null}