{"id": 193060, "slug": "finger-vs-bugs", "name": "Finger vs bugs", "name_original": "Finger vs bugs", "description": "<p>Finger vs bugs is a Fast-paced casual high score based game, where you play the role of a finger to prevent the bugs to reach and bite you, the longer you play the harder the game will be, the better you are on tapping the harder the bugs will push to defeat you.</p><p>The game mechanic of this game is simple just the tap the bugs using your finger to squash them to prevent them from reaching the bottom of the game screen, if they do they will inflict damage on you and when your hit points or life reached zero it's game over. aside from that this game is not really random because the spawn rate of the bugs is depends on the player if they are really good the spawn will be more because every bug is connected to each other it's like killing this bug can spawn other bugs and killing this other bug can spawn other bugs or events in the game.</p><p>In this game the most important skills is your Eye coordination and your tapping speed but you can always ask your friends to help you to squash the bugs like they say \"the more the merrier\" and it's more fun to tap the bugs together with your friends especially on big mobile screen devices or you can also play it together with your kids instead on letting them play the real bugs which is dangerous and can harm both the kids and the bugs which is not fun at all</p>", "metacritic": null, "released": "2017-03-20", "tba": false, "updated": "2019-10-22T14:31:56", "background_image": "https://media.rawg.io/media/screenshots/3ed/3ed45e774dc427e44d2798892658e535.jpg", "website": "https://www.facebook.com/fingervsbugs/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 67, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Gigadrillgames", "Juan Carlos Claridad"], "genres": ["Action", "Arcade"], "publishers": ["Juan Carlos Claridad"], "esrb_rating": "Everyone 10+"}