{"id": 1930, "slug": "slingshot-trials", "name": "Slingshot Trials", "name_original": "Slingshot Trials", "description": "Try the #1 Racing Game in over 10 countries - for FREE!<br/><br/>Get into the action with 8 Free Levels<br/>of this award winning arcade style racer.<br/><br/>Slingshot Racing is an original racing game developed exclusively for iOS devices. <br/>Behold a beautiful steampunk environment with ice tracks, grappling hooks, snowmen and more! <br/><br/>Please Read First: <br/>You can tap anywhere near the bottom of the screen to slingshot. Do not tap on the towers, or tap anywhere near the restart button during gameplay. <br/><br/>Reviews: <br/><br/>Touch Arcade &amp;#39;Mobile Racing Redefined&amp;#39; <br/><br/>iPhone Alley &amp;#39;Beautifully Redefines the Common Racing Formula&amp;#39; <br/><br/>Apple n&amp;#39; Apps 4.5/5 &amp;#39;Slingshot Racing is a must buy that will have you hooked from the first slingshot.&amp;#39; <br/><br/>148apps 4.5/5 &amp;#39;Snowbolt and Crescent Moon have absolutely nailed this game&amp;#39; <br/><br/>Gamezebo 4/5 &amp;#39;Silky smooth one-touch racing gameplay.&amp;#39; <br/><br/>TouchGen 4/5 &amp;#39;As multiplayer games on one device go I think Slingshot Racing is hard to beat.&amp;#39; <br/><br/>App Advice: &amp;#39;A New Genre Of Racing Emerges In Slingshot Racing&amp;#39; <br/><br/>AppSpy 4/5 <br/><br/>App-Score 9/10 &amp;#39;Slingshot Racing is one of the most innovative games we&amp;#39;ve playing in a long time&amp;#39; <br/><br/><br/>Use your grappling hook to slingshot around corners in this fast paced <br/>arcade style racer. Hone your skills by learning on the tutorial tracks, <br/>then blast out of the snow onto more complex tracks against other racers. Race around a selection of tracks in stunning day and night settings. <br/><br/>Career mode features 64 races with different objectives and settings. Take part in a simple straight race to the top spot on the podium. The pickups race pits you against the clock to collect all the cogs on the track as quickly as possible. The time trials offer you the chance to shave all important seconds and compare your times with others on the Game Center leaderboards. Alternatively prove your mettle by taking on the fearsome chomper as it hunts you around the track. <br/><br/>With 4 way multiplayer you can race family or friends on just a single device. With just a few clicks you can create mini tournaments the way you like or just mix it up with a quick random selection. <br/><br/>Features: <br/><br/>Super addictive gameplay <br/>Revolutionary controls, easy to pickup and difficult to master <br/>Stunning graphics for iPad and iPhone Retina displays <br/>Gorgeous 3d effects, shadows, and particle systems <br/>Game Center Leaderboards and Achievements <br/>4 player simultaneous play on one iPad or iPhone! Play against your whole family! <br/>iCloud saves <br/>Tweet or Post your high scores on Facebook <br/>Jumps, Speed boosts and other obstacles <br/><br/>Device Compatibility: <br/>iPhone 4, iPhone 3GS, iPod touch 3rd Generation (16GB and up), iPod Touch 4th generation, iPad, iPad 2, iPad 3 <br/><br/>Like Facebook.com/CrescentMoonGames<br/><br/>and<br/><br/>follow @cm_games on Twitter for more great games and deals!", "metacritic": null, "released": "2012-06-17", "tba": false, "updated": "2019-10-22T14:27:54", "background_image": "https://media.rawg.io/media/screenshots/489/489049e7c03eea878cbdb928b728c65c.jpeg", "website": "http://", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 138, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Crescent Moon Games"], "genres": ["Racing", "Arcade"], "publishers": ["Crescent Moon Games"], "esrb_rating": "Everyone 10+"}