{"id": 193125, "slug": "double-army", "name": "Double Army", "name_original": "Double Army", "description": "<p>Once upon the time,a Yellow Wizard lived peacefully in a cave. <br/>One day two armies choose the plains where the cave is to have their battle. <br/>You play as the wizard who tries to conclude the battle as soon as possible by killing one of two armies commanders. <br/>use the changing shape spell to let the armies attack each other <br/>you want ultimately to kill one of the commanders (They look like those in the main menu) <br/>but they are heavy guarded and you can't attack .So you should employ one army's troops on the another until you kill one of the commanders. <br/>don't change your shape nearby other soldiers <br/>(see the yellow ring) <br/><br/>the more the soldiers that you lead kill the more closer you get to be promoted. <br/>when promoted you get to have more followers under your command and you get a larger circle of influence (how far should you be from a soldier before he respond to your \"follow me\" command) <br/>Attempting to issue a follow me command to those higher than you in rank will make you lose as they will discover you. <br/>If you disguised as one army color , getting near the other army will result in their soldiers attacking you , you have a limited health so be careful. <br/>On the other hand when you are close to your soldiers they get a boost and become more probable to kill than being killed <br/>so be close to your soldiers but be careful of the enemy soldiers if your soldiers all died. <br/>Hope you like the game , and sorry for the long introduction</p>\n\n<p>Controls :</p>\n<p>Use WASD to move</p>\n<p>Press 1,2 ,or 3 to change shape </p>\n<p>Press Z to command nearby soldier of your same color to follow me.</p>\n<p>Press X to command the soldiers following you to halt.</p>\n<p>Press C to command the soldiers following you to attack nearby enemies</p><p>******************************************************************************************</p>\n<p>P.S. This game was a submission to the 35th Ludum Dare. The theme was <em>Shapeshift</em></p>", "metacritic": null, "released": "2016-04-19", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/4ae/4ae7d9773492bc2abac7d832cb62ec3e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 8, "game_series_count": 0, "reviews_count": 0, "platforms": [], "developers": ["abuzreq"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}