{"id": 19321, "slug": "bloodgate", "name": "BloodGate", "name_original": "BloodGate", "description": "<strong>A one-of-a-kind action puzzle RPG adventure. Players are unleashed into fast paced battles where they must balance intense real-time combat with precision rune matching in an attempt to defeat unspeakable demons.</strong><br/><br/><br/>The Empire of Toskyr is falling to a plague of horrific destruction. Behind the legendary Blood Gate, the plague’s creator, Black Dahlia, awaits the day she might leave her prison and inherit a blood-drenched empire. <br/><br/>The Toskyan Czar has put out a desperate call, offering any and all fortune hunters the freedom to plunder in return for wiping out the Plague Fiends and ridding the empire of Black Dahlia… <br/><br/>Build your party of heroes as you unlock new powerful spells and collect hordes of loot. Craft truly great weapons and armor to dominate your enemies. <br/><br/>Explore ever changing landscapes from the grassy lands of the Daraghul Highlands to the heart of the Iron Citadel as you delve deeper into the dark realms of the plague.<br/><br/><br/><ul><li>Unique blend of realtime rune matching and visceral combat.<br/></li><li>Over 100 dungeons to discover, explore and loot.<br/></li><li>Slay dozens of hideously mutated creatures and demonic bosses.<br/></li><li>Hundreds of weapons and armor: Collect and upgrade to create your perfect loadout.<br/></li><li>Three distinct classes: Level up with a wide range of skills and abilities.<br/></li><li>Battle across several unique regions; from frozen wastes to deep infested Jungles.<br/></li><li>3 difficulty modes: Looking for more of a challenge? Activate hardcore or Hell and see what you’re made of.</li></ul>", "metacritic": null, "released": "2016-06-02", "tba": false, "updated": "2019-09-17T13:41:41", "background_image": "https://media.rawg.io/media/screenshots/e8d/e8d605e68e8fba319aed8ad3dbab4dbc.jpg", "website": "http://www.blood-gate.com/", "rating": 2.67, "rating_top": 4, "added_by_status": {"yet": 4, "owned": 77, "beaten": 3, "dropped": 1}, "playtime": 3, "achievements_count": 22, "ratings_count": 6, "suggestions_count": 491, "game_series_count": 0, "reviews_count": 6, "platforms": ["macOS", "PC", "Linux"], "developers": ["Outsmart"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["Outsmart"], "esrb_rating": null}