{"id": 19334, "slug": "back-in-1995", "name": "Back in 1995", "name_original": "Back in 1995", "description": "A throwback to the survival horror and mystery games of the original PlayStation, Back in 1995 faithfully re-creates everything from this all-but-forgotten era of games.<br/><br/>Be transported to a world both concrete and indistinct, where you must uncover the mystery surrounding the disappearance of your daughter, the catastrophe that shook the city, and why you’ve decided to finally return.<br/><br/>Back in 1995 was created as a labour of love by indie developer Takaaki Ichijo as a means to replicate the unique feeling he had from his first gaming experiences: the PlayStation and the Sega Saturn.Features:<ul><li>Get lost in the nostalgic world of retro 3D graphics, including low res models, texture warping, CRT emulation, and fixed CCTV style camera angles.<br/></li><li>Relive the mystery game genre with an old-school user interface and tank controls.<br/></li><li>Explore a sparse cityscape in the year 1995, littered with clues about the past.<br/></li><li>Interact with a cast of damaged characters whose intentions you can never truly know.<br/></li><li>Uncover the mystery of yourself, your daughter, and what happened to the city.</li></ul><br/>* D-pad recommended<br/>* A 720p or greater screen resolution is required<br/>* Approximate playtime is 2-3 hours", "metacritic": 52, "released": "2016-04-28", "tba": false, "updated": "2023-01-11T08:39:25", "background_image": "https://media.rawg.io/media/screenshots/d15/d150f9e2e2e44ff8b48608bec1d38392.jpg", "website": "http://backin1995.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 43, "beaten": 2, "toplay": 1}, "playtime": 1, "achievements_count": 132, "ratings_count": 3, "suggestions_count": 265, "game_series_count": 0, "reviews_count": 3, "platforms": ["Nintendo Switch", "Xbox One", "PlayStation 4", "PC"], "developers": ["Ratalaika Games", "Throw the warped code out"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Degica", "Ratalaika Games"], "esrb_rating": "Teen"}