{"id": 193311, "slug": "frontline-sniper-cold-war", "name": "Frontline Sniper Cold War", "name_original": "Frontline Sniper Cold War", "description": "<p>Frontline Sniper Cold War is first Next Generation Operation Challenge game.</p><p>Enjoy the Premium cool sniper and assault bullet effect. City Sniper call of duty want you to attack on enemies<br/>that are trying to overtake the city. They called a Frontline Sniper war. As Sniper Shooter you mission is the clear</p><p>the city from enemies from brutal enemies. Aim Perfect to shoot enemies.</p><p>you are the skilled sniper battle assassin, you have been assigned for the task to clear the city from brutal enemies.<br/>Select you gun pack with latest weapon technology. Believe in your deadly sniper warrior fury nature and sniper gun <br/>which has amazing clear zoom with 80% of accuracy to take down your target.</p><p>Game environment will let you feel the reality of real time war ahead on you. In a battle field sniper rifle and <br/>assault gun won't let you settle down, So keep your sniper attack strategy on the line. Kill all enemies, take control<br/>of occupied operational base.</p><p>Game Features:</p><p>Full action FPS shooting game.<br/>Best 3D environment, enemy characters and animations.<br/>Best modern sniper gun with zoom for accuracy.<br/>Quality graphics and thrilling sounds.<br/>Modern war weapons.<br/>Amazing Fire effects<br/>Challenging and unique levels<br/>Addictive And optimized game play<br/>Latest weapons.<br/>Cool animations.<br/>No connectivity required while playing.<br/>Tune your armor and stand tough against enemies</p>", "metacritic": null, "released": "2016-06-19", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/b9a/b9ae20d74ab7c17d68a97cf877c35e2e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 127, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["topdevzone"], "genres": ["Action"], "publishers": [], "esrb_rating": null}