{"id": 193366, "slug": "vip-spades", "name": "VIP Spades", "name_original": "VIP Spades", "description": "<p>Play Spades now at VIP Spades! One of the most entertaining card games out there! Discover VIP Spades, a fun, friendly and strategic card game. Spades is not just another card game, it is one of the most popular card games in the US and in many other countries. Join the social Spades game!<br/>Download VIP Spades now, get your free chips and find new friends! </p><p>Spades is a 52-card trick-taking game similar to Hearths, Bridge and Euchre. <br/>The game is free and easy to play! VIP Spades is very fast and responsive, with card animation for a more realistic gameplay, accompanied by HD graphics and a modern design.</p><p>WHY PLAY?<br/>- High quality Spades in Multiplayer. Different game modes available - Pairs, Solo, Mirror, Whiz and Suicide.<br/>- Cross-platform Spades for WEB, Facebook, all mobile operating systems and Smart TV.</p><p>KEY FEATURES OF THE GAME<br/>- Play Spades with your friends, send them gifts and socialize with others. <br/>- Invite your Facebook friends to play with you! <br/>- Entertaining gameplay! <br/>- Enjoy free chips every day. <br/>- Strong social element embedded in the game, including chat, gifts, gallery and more, to further improve the experience.<br/>- Meet new people, easy dating functionality.</p><p>Do you wish to play against real players and meet new people, passionate about Spades?<br/>VIP Spades allows you to play against other players on your level.<br/>Whether you're a beginner or a pro, VIP Spades is ideal for all Spades players and card game lovers.</p><p>WHAT'S NEXT? <br/>VIP Spades continues to evolve! For upcoming releases and improvements to the game - stay tuned!</p><p>TRUE FANS OF VIP SPADES?<br/>Your opinion is important to us! Contact us at support@vipspades.com or write us on https://vipspades.com/</p>", "metacritic": null, "released": "2016-07-19", "tba": false, "updated": "2019-08-23T11:39:09", "background_image": "https://media.rawg.io/media/screenshots/9a2/9a24a18e45b3094da87b09366bfd4015.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 110, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Casualino"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}