{"id": 19348, "slug": "death-to-spies", "name": "Death to Spies", "name_original": "Death to Spies", "description": "<p>Smersh is Russian for &quot;Death to Spies&quot; and was the name of a set of counterintelligence agencies formed in the Soviet Army during World War II. Their mission was to secure the rear of the active Red Army by arresting traitors, deserters, spies and criminal cells. During the war these agents became the main force combating the German intelligence service.<br />\nAs captain of the 4th department of Smersh, it is your job to execute these operations in the heart of enemy territory. Be prepared to complete various tasks, including stealing important documents, eliminating enemy officers, kidnapping high-ranking officials, and sabotage enemy plans.<br />\nThird-person stealth action immerses the player into the atmosphere of World War II military intelligence operations.<br />\nDifferent types of missions based on real historical intelligence and counterintelligence operations.<br />\nFreedom to choose the way a mission is completed.<br />\nExtensive real-life indoor and outdoor locations.<br />\nA variety of different spy skills at the player&#39;s disposal such as sneak, hide, carry dead bodies, change clothes, mine objects, throw knives, sniping, picking locks, setting traps and many others.<br />\nAuthentic weapons and vehicles of World War II.</p>", "metacritic": 69, "released": "2007-10-15", "tba": false, "updated": "2023-11-02T02:48:00", "background_image": "https://media.rawg.io/media/games/472/47264311e4c1feb004b375f4f47104e0.jpg", "website": "", "rating": 3.49, "rating_top": 4, "added_by_status": {"yet": 32, "owned": 676, "beaten": 33, "toplay": 12, "dropped": 26, "playing": 3}, "playtime": 1, "achievements_count": 0, "ratings_count": 73, "suggestions_count": 501, "game_series_count": 3, "reviews_count": 74, "platforms": ["PC"], "developers": ["Haggard Games"], "genres": ["Action", "Adventure"], "publishers": ["1C-SoftClub", "1C Company"], "esrb_rating": "Mature"}