{"id": 193514, "slug": "the-most-important-he-pees", "name": "The Most Important He Pees", "name_original": "The Most Important He Pees", "description": "<p>This is my entry for Open Jam. This was first time in my solo career when I'm creating 2D game with only assets I've made. I must also notice that I consider myself more as environment and mechanics designer than 2d artist, so it was my first time doing pixel art in photoshop. To be honest from the very first minutes after theme was annouced i knew that it will be game without any sense,  just for fun porposes. So let me tell you something about \"The most important he pees\" or \"Leave the mark\", whatever.</p>\n<p>So in game you spawn as a dog. As every dog you sometimes need to pee. You are in procedurally generated  park. Your goal is to pee as many trees as possible, but watchout ! There are a lot of old men trying to kill you. You must walk around the park avoiding them or you will lose. Also pigeons live in the park. They sell some beer for coins you get when you pee on the tree. I forgot to say that when you tak control over tree you get passive income every second. Urine is basically your health points. You can also drink water randomly generated in the park. <strong>Have fun !</strong></p>\n<p><strong>Controls:</strong></p>\n<p><strong>ARROWS </strong>- moving, </p>\n<p><strong>SHIFT </strong>- sprint, </p>\n<p><strong>F </strong>- pee ( only when you nearby tree ), </p>\n<p><strong>X </strong>- buy beer from pigeon, </p>\n<p><strong>E </strong>- drink water.</p>\n\n<p>If you want executable or if you think this game is genius just let me know.</p>", "metacritic": null, "released": "2017-10-08", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/2fe/2fe0e0b85d8d4bf09659f0d754e89e64.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 4, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["MichalDev"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}