{"id": 19353, "slug": "starseed-pilgrim", "name": "Starseed Pilgrim", "name_original": "Starseed Pilgrim", "description": "<p>The only driving force in this game is the curiosity of the player.</p>\n<h3>Unusual game</h3>\n<p>In the game there are no goals set explicitly and in advance, there are no videos telling anything, there are no monsters with which it is impossible not to fight. Nevertheless, something constantly happens in the game, and what happens in it causes both curiosity and consequences - especially, depending on what you do in the game.</p>\n<p>For a start, you can go through a very briefing and then step into the world of the game to explore everything by yourself.</p>\n<h3>Unusual setting, unusual gameplay</h3>\n<p>The character of the game is a small man, alone in the whole space of the game. He is surrounded by blocks of different colors. Blocks grow like trees or duckweed on the surface of water. They can even be planted with seeds, just like plants are planted.</p>\n<p>Each seed after planting in the &quot;soil&quot; germinates differently. As a result, you are always surrounded by growing “bushes” or “fields” of blocks that live their own and special lives.</p>\n<p>It seems that these seeds and blocks speak to you in their own language. Understanding this language and learning how to interact with “plants” is one of the tasks of the game and the condition for success in it.</p>\n<p>But all this time, another dimension of the game world is slowly destroying the very ground on which you stand. It destroys your world, because everything in it rests on this soil.</p>\n<h3>Clear answers</h3>\n<p>It is noteworthy that everything that happens in the game has its own logic and can ultimately be clarified definitively and definitely. But until that happens, the player may feel ignorant and even confused.</p>\n<h3>Individuality</h3>\n<p>The path to understanding all of this is individual for each player and to a significant degree it is the player who determines what this path will be. The player determines this by his actions, his manner of reacting to what is happening in the game.</p>\n<h3>Goals and story</h3>\n<p>The game still has some goals that the player must achieve. But even the discovery of these goals is based on the fact that the game causes the player curiosity and in the process of satisfying this curiosity the player comes to both understanding the goal and the decision whether to reach this goal or not.</p>\n<p>There is also a kind of plot, a story in the game. But this story is represented by fragments scattered throughout the game world.</p>\n<h3>Music to relieve</h3>\n<p>To relieve the tension that may arise from the difficulties of the game, music that accompanies the gameplay helps well.</p>", "metacritic": 83, "released": "2013-04-16", "tba": false, "updated": "2023-10-09T12:16:19", "background_image": "https://media.rawg.io/media/screenshots/2f2/2f2958ae87ac35e3442f3c87424a09b2.jpg", "website": "http://www.starseedpilgrim.com/", "rating": 2.55, "rating_top": 3, "added_by_status": {"yet": 62, "owned": 939, "beaten": 7, "toplay": 5, "dropped": 29, "playing": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 38, "suggestions_count": 26, "game_series_count": 0, "reviews_count": 38, "platforms": ["macOS", "PC"], "developers": ["Droqen"], "genres": ["Adventure", "Indie"], "publishers": ["Droqen's Games"], "esrb_rating": null}