{"id": 19360, "slug": "alien-rage-unlimited", "name": "Alien Rage - Unlimited", "name_original": "Alien Rage - Unlimited", "description": "Unleash a fury of powerful weapons as you blast your way through armies of Alien forces hell-bent on taking you down! Battle through 14 intense levels and prepare to face a barrage of beastly-sized bosses that will test your every skill. Each of your 10 weapons comes with two firing modes and you’ll need all of them! Battle hardened Alien forces will attack you from every direction using various flanking and attack moves. Built with powerful up-to-date graphics technology, awesome physics, destructible environments… experience a truly intense, oldschool styled shooter game!Key Features<br/><ul><li> Wide variety of Alien enemy forces including Infantry, Warriors, Flying Drones, Spiders<br/></li><li> Huge boss fights – Over 21 enemy types including 8 beastlysized bosses to challenge and destroy through 14 Levels<br/></li><li> Strong thru-the-gun experience with 10 powerful weapons each with two firing modes<br/></li><li> Skill shots, head shots and shooting accuracy heavily rewarded<br/></li><li> Player-triggered destruction of environments and cover helps to advance through levels<br/></li><li> Built with powerful up-to-date graphics technology, awesome physics, destructible environments</li></ul>", "metacritic": 52, "released": "2013-09-24", "tba": false, "updated": "2024-02-08T18:28:38", "background_image": "https://media.rawg.io/media/screenshots/45a/45afc017c00d13e135894b179346e3e8.jpg", "website": "http://alienragegame.com/", "rating": 2.83, "rating_top": 3, "added_by_status": {"yet": 30, "owned": 875, "beaten": 40, "toplay": 13, "dropped": 23, "playing": 1}, "playtime": 1, "achievements_count": 77, "ratings_count": 69, "suggestions_count": 637, "game_series_count": 0, "reviews_count": 70, "platforms": ["Xbox 360", "PlayStation 3", "PC"], "developers": ["City Interactive", "CI Games", "4EversGames"], "genres": ["Action", "Shooter"], "publishers": ["CI Games", "City Interactive"], "esrb_rating": null}