{"id": 19364, "slug": "perils-of-man", "name": "Perils of Man", "name_original": "Perils of Man", "description": "<p>Imagine getting a glimpse into the secret clockwork of the universe. Imagine a machine that can crack the code of destiny and give you the power to tinker with fate. Imagine discovering that for generations your family has concealed this power from the outside world.</p>\n<p>Ana Eberling may only be a teenager, but she is about to confront the biggest questions of life as she tries to solve the mystery of her father Max Eberling, a rogue scientist who vanished when she was just a little girl.</p>\n<p>Perils of Man is the result of a collaboration between ex-LucasArts’ Bill Tiller and Gene Mocsy and Swiss developing studio IF Games to reboot the beloved classic graphic adventure game with striking 3D animations, challenging puzzles and a moving story that will leave you pondering its profound implications</p>\n<p>Timewalk Through the Past:<br />\nA key element of gameplay is a mysterious chronicle of history’s disasters and catastrophes. Unlocking its secrets will let players “timewalk” to real-world events from the gilded age of scientific invention.</p>\n<p>Alter Destiny By Preventing Disaster:<br />\nCommand the fates of thousands by mastering a hidden technology that gives the player the ability to foresee risk. Experience a special gameplay mechanic that reveals a hidden matrix of cause and effect.</p>\n<p>A Century-Old Mystery Solved:<br />\nDiscover a dark history of secrets, controversy, rivalry, and tragedy behind a façade of ingenious scientific invention and celebrated family fortune.</p>\n<p>24 Spectacular Environments:<br />\nA haunting adventure set in a unique and evocative graphic style. Explore the past and solve your way to the future in a game that will have you wondering if being the master of your fate is everything it’s cracked up to be.</p>", "metacritic": 61, "released": "2015-04-28", "tba": false, "updated": "2023-02-17T14:48:40", "background_image": "https://media.rawg.io/media/screenshots/9d7/9d7c6b65b39fc855ca256bf1b049ec3d.jpg", "website": "http://www.perilsofman.com/", "rating": 0.0, "rating_top": 4, "added_by_status": {"yet": 10, "owned": 85, "beaten": 3, "toplay": 4, "dropped": 2}, "playtime": 4, "achievements_count": 14, "ratings_count": 5, "suggestions_count": 442, "game_series_count": 0, "reviews_count": 5, "platforms": ["iOS", "Linux", "macOS", "PC"], "developers": ["Vertigo Games", "IF Games"], "genres": ["Adventure", "Indie"], "publishers": ["Vertigo Games", "IF Games"], "esrb_rating": null}