{"id": 19388, "slug": "stairs", "name": "Stairs", "name_original": "Stairs", "description": "<strong>STAIRS</strong> is a first-person atmospheric psychological horror game that takes players through the stories of three missing people as seen through the eyes of journalist Christopher Adams. Start preparing yourself now, for to descend down these steps is to descend into madness.<br/><br/><strong>STAIRS</strong> is inspired by real-life events, twisted into an original tale of terror, despair and sadness. Using a camera and journal, players set out to unravel the grizzly mysteries behind three stories - Valerie Berkley, a high school graduate; James Reed, a young businessman; and Jean Jowars Remens, a charismatic pastor. What happened to them? What do they have to do with each other? Creep down the stairs and discover the truth for yourself… if you dare.<br/><br/>FEATURES INCLUDE<br/><ul> <li>A tale of psychological horror that spans 3 diverse story arcs with thematic connections<br/> </li><li>Inspired by a series of horrific real-life events, recreated with a twist of fiction<br/> </li><li>Use your camera to capture supernatural elements that progress the story and open new areas<br/> </li><li>Utilize notes in your Journal to help track your progress, story beats and evaluate clues<br/> </li><li>Dynamic, immersive sound design sends chills down your spine while building palpable tension<br/> </li><li>Real-time story elements unravel the game’s narrative without interrupting gameplay<br/> </li><li>Explore interactive environments and solve cleverly crafted puzzles to find what you need to advance through the story</li></ul>", "metacritic": 65, "released": "2015-09-28", "tba": false, "updated": "2023-04-23T09:42:17", "background_image": "https://media.rawg.io/media/screenshots/f3e/f3ef5ca2819c01ff15c4266a792a6c00.jpg", "website": "", "rating": 3.25, "rating_top": 4, "added_by_status": {"yet": 6, "owned": 89, "beaten": 3, "toplay": 1, "dropped": 1}, "playtime": 3, "achievements_count": 15, "ratings_count": 7, "suggestions_count": 303, "game_series_count": 0, "reviews_count": 8, "platforms": ["Android", "PC"], "developers": ["Ketchapp", "GreyLight Entertainment"], "genres": ["Action", "Adventure", "Arcade", "Indie"], "publishers": ["Digital Tribe"], "esrb_rating": null}