{"id": 19391, "slug": "speedball-2-hd", "name": "Speedball 2 HD", "name_original": "Speedball 2 HD", "description": "Speedball 2 HD is a modern reincarnation on the classic, futuristic cyberpunk sports game Speedball, originally developed by the Bitmap Brothers and first released for the Atari ST in 1990. A brutal mix of handball and ice hockey placed at break-neck pace. Now Tower Studios, Vivid Games and The Bitmap Brothers have created a glorious fusion of classic gameplay and modern technology to launch this game into the 21st century.<br/><br/> Game DescriptionIn 2326, rival gangs formed an ultra-violent street sports league called Speedball to settle their deadly disputes. Two teams face each other in bloody battles for a steel ball: Nine on nine – in an all-out rush on the opponents’ goal. Almost any malicious move is permitted. The winner of the matches secures supremacy over the city. <br/><br/><br/>The highly anticipated PC revival to the legendary Amiga classic transforms the futuristic game setting with state-of-the-art technology into a high-speed sports spectacle. <br/>There are a huge variety of game modes and options - quick matches, single player tournaments, one-on-one multiplayer and full career mode. Your ultimate mission is to assemble your own Speedball team to win the Speedball Intergalactic Champions League and bring the greatest prize in Speedball back to Earth.<br/><br/>Choose from 28 teams across 6 new Speedball Arenas, Speedball 2 HD includes all the intense gameplay of the original with new teams, more formations and in particular the new Fire, Ice and Cyber teams.<br/><br/> Key Features<ul><li>HD Graphics in classic Speedball style<br/></li><li>6 brand new Speedball Arenas <br/></li><li>Choose from 336 unique players and 28 Teams across 4 Planets<br/></li><li>Full Player Transfer Market and Player Upgrade System<br/></li><li>Ability to create and customise your own ultimate Speedball team<br/></li><li>5 different Formations allowing strategy changes during play<br/></li><li>Score with Goals, Bonus shots and Brutal Knockouts<br/></li><li>A host of Steam Badges, Cards and Wallpapers to collect<br/></li><li>Over 20 power-ups and special effects<br/></li><li>Multiple game modes including 10 Season Career Mode and 10 Single-Player Game Modes<br/></li><li>Supports game pad and keyboard controls for 2 players at once<br/></li><li>Local multiplayer mode includes customisable tournaments for up to 8 player teams<br/></li><li>Plenty of Trophies and Achievements to collect<br/></li><li>The World famous “Ice Cream... Ice Cream!!” sample</li></ul>", "metacritic": 53, "released": "2013-12-04", "tba": false, "updated": "2023-01-15T18:43:29", "background_image": "https://media.rawg.io/media/screenshots/436/43678d0a01da2d6b7cbaee7d06fb0b8e.jpg", "website": "", "rating": 2.26, "rating_top": 1, "added_by_status": {"yet": 15, "owned": 557, "beaten": 1, "toplay": 2, "dropped": 3}, "playtime": 3, "achievements_count": 22, "ratings_count": 19, "suggestions_count": 383, "game_series_count": 0, "reviews_count": 19, "platforms": ["PC"], "developers": ["The Bitmap Brothers", "Vivid Games"], "genres": ["Action", "Sports", "Arcade", "Indie"], "publishers": ["Mastertronic"], "esrb_rating": "Everyone 10+"}