{"id": 19397, "slug": "vampire-the-masquerade-bloodlines", "name": "Vampire: The Masquerade - Bloodlines", "name_original": "Vampire: The Masquerade - Bloodlines", "description": "<p>Vampire: The Masquerade – Bloodlines is a story-driven action-RPG based on table-top role-playing game Vampire: The Masquerade, the part of the World of Darkness franchise. The game is setting a gothic urban fantasy where vampires, werewolves, and other supernatural beings live secretly by humans. The story follows the player character that gets turned into the vampire and becomes a member of Camarilla – a considerable vampire organization that tries to keep vampires’ existence in secret from ordinary people. It confronts Sabbat, an organization whose member believe that Vampires should let their inner beasts go wild no matter of people’s awareness.  </p>\n<p>The gameplay’s primary emphasis is variety in player’s action. The same goals can be achieved in several ways. Depending on the character’s abilities and clan affiliation, it can intimidate, seduce or convince NPC’s with words, use brute force or sneak in the shadows without being noticed. There are seven unique vampire clans from which player creates his character. They have different skills, supernatural powers, appearance, characteristics. Some of them affect gameplay in its unique way, e.g., vampires from Nosferatu clan are so deformed that they cannot be seen by ordinary people, forcing the player to rely on stealth and brute force rather than communication.</p>", "metacritic": 80, "released": "2004-11-15", "tba": false, "updated": "2024-04-18T21:07:37", "background_image": "https://media.rawg.io/media/games/6f0/6f0a69db053bce957d8328a7253fbb29.jpg", "website": "http://www.vampirebloodlines.com", "rating": 4.38, "rating_top": 5, "added_by_status": {"yet": 246, "owned": 1959, "beaten": 607, "toplay": 258, "dropped": 245, "playing": 42}, "playtime": 2, "achievements_count": 0, "ratings_count": 854, "suggestions_count": 550, "game_series_count": 6, "reviews_count": 858, "platforms": ["PC"], "developers": ["Troika Games"], "genres": ["Action", "RPG"], "publishers": ["Activision Blizzard"], "esrb_rating": "Adults Only"}