{"id": 19398, "slug": "lost-horizon-2", "name": "Lost Horizon 2", "name_original": "Lost Horizon 2", "description": "In the shadow of the Cold War, Fenton Paddock is facing the hardest fight of his life. While the tensions between the superpowers threaten to tear the world apart, the British soldier has to save his family that has been caught by powerful enemies. His adventure leads Fenton far beyond the Iron Curtain and finally onwards to mysterious, uncharted territory. He has to finally face the dark powers of his past and learn what it means to take on responsibility.<br/>\n<br/>\r\n• Legendary and mystical – Our Hero Fenton Paddock joins a new thrilling adventure in the shadow of the Cold War of the 1940s and 50s. On an exciting journey across the continents Fenton encounters new allies and obscure dangers which hold their own secrets<br/>\r\n• Colorful and hand-crafted – Thanks to the Unity 5.0 3D Engine the developers created a vigorous and rich 3D World with a love for detail which the the Players can dive right into. At the same time all the zones keep their hand-crafted charm which fans of the genre love and enjoy so much<br/>\r\n• Intuitive and challenging – open doors, pick locks, combine different components… the Game comes with a lot new haptic features which puts the Player right into the middle of what is happening around him and always calls the player to action. In Addition to this brand-new features, a variety of tricky and challenging new puzzles and puzzle types are waiting to be solved", "metacritic": 58, "released": "2015-10-01", "tba": false, "updated": "2023-03-17T14:30:55", "background_image": "https://media.rawg.io/media/screenshots/896/896be034b12489b1910209d6aa853cbc.jpg", "website": "http://losthorizon2.deepsilver.com", "rating": 3.43, "rating_top": 3, "added_by_status": {"yet": 19, "owned": 142, "beaten": 5, "toplay": 3, "dropped": 2}, "playtime": 6, "achievements_count": 0, "ratings_count": 7, "suggestions_count": 304, "game_series_count": 1, "reviews_count": 7, "platforms": ["Nintendo Switch", "PC", "iOS"], "developers": ["Animation Arts", "Animation Arts Creative"], "genres": ["Adventure", "Family"], "publishers": ["Deep Silver", "Koch Media", "Animation Arts Creative"], "esrb_rating": null}