{"id": 19409, "slug": "of-dragon-rising", "name": "Operation Flashpoint: Dragon Rising", "name_original": "Operation Flashpoint: Dragon Rising", "description": "<p>Dragon Rising is the second installment of Operation Flashpoint series, though its plot bears no connection to the previous game. The game is set on Skira, a fictional Northern Pacific island with huge oil reserves. China annexed the island, provoking a military conflict with Russia and the US. Skira’s landscape is thoroughly modeled after a real-life Kiska island in Russia. <br />\nThe player assumes the role of a leader in a squad of four US soldiers, three of which are AI-controlled. In the single-player campaign, they perform a series of military operations against the Chinese army. The gameplay tries to authentically simulate the real warfare, with no checkpoints and few scripted scenes. Depending on the difficulty level, the player may even lack the traditional HUD indications of health, ammo, and directions. The player will have to march long distances through the 35 km wide Skira, which may feel like a slog, but also adds to the game’s realism.<br />\nThere are many multiplayer modes in Operation Flashpoint: Dragon Rising. The players can assume the roles of the remaining three soldiers to play through the main campaign. There&#39;s also a local PvP mode and a couple of traditional online multiplayer modes.</p>", "metacritic": 76, "released": "2009-10-06", "tba": false, "updated": "2024-03-04T16:04:54", "background_image": "https://media.rawg.io/media/games/cd8/cd89ed5083a6cca9c2768ebca7a73b2d.jpg", "website": "http://www.flashpointgame.com", "rating": 2.77, "rating_top": 3, "added_by_status": {"yet": 80, "owned": 2163, "beaten": 72, "toplay": 24, "dropped": 107, "playing": 5}, "playtime": 1, "achievements_count": 73, "ratings_count": 171, "suggestions_count": 765, "game_series_count": 2, "reviews_count": 172, "platforms": ["Xbox One", "PC", "PlayStation 3", "Xbox 360"], "developers": ["Codemasters"], "genres": ["Action", "Shooter"], "publishers": ["Codemasters"], "esrb_rating": null}