{"id": 19404, "slug": "nexuiz", "name": "Nexuiz", "name_original": "Nexuiz", "description": "Powered by CryENGINE 3, Nexuiz reinvents Arena FPS gameplay.<br/><br/><br/>For centuries the Kavussari and the Forsellians have waged war. They have a fragile truce but due to their seething disgust of each other they still pit their warriors against each other in arenas rather than on the fields of war.<br/><br/><br/>Those episodes of lethal combat are now broadcast throughout the galaxy, as entertainment… a spectacle known as… The Nexuiz Competition: An arena based first person shooter where you can alter the rules of the match and laws of physics while you dominate opponents in ever-changing hostile environments bleeding with hatred.Key Features<ul><li><strong>Arena FPS is back</strong> – inspired by the giants of the Arena FPS genre, Nexuiz reinvents twitch gaming for next generation consoles and PC<br/></li><li><strong>Over 100 ‘Dynamic Mutators’ serve as game-changing power-ups</strong> – Jetpacks, Uber-Nuke, Low Gravity, Big Head Mode and many more...<br/></li><li><strong>9 deadly arenas</strong> – powered by CryENGINE 3, Nexuiz sets a new graphical benchmark for a digital-only release<br/></li><li><strong>Designed for competitive play</strong> - a superbly balanced weapon set, classic game modes, and extensive stat tracking, Medals and Leaderboard support<br/></li><li><strong>Play solo or online</strong> – hone your skills against bots, then wage war online against the best in up to 32 player matches</li></ul>", "metacritic": 54, "released": "2012-05-10", "tba": false, "updated": "2023-06-14T05:31:45", "background_image": "https://media.rawg.io/media/screenshots/2d1/2d1551f737ac3a6494522d818c64cac6.jpg", "website": "http://www.nexuiz.com/", "rating": 2.54, "rating_top": 3, "added_by_status": {"yet": 25, "owned": 563, "beaten": 5, "dropped": 24}, "playtime": 1, "achievements_count": 21, "ratings_count": 39, "suggestions_count": 317, "game_series_count": 0, "reviews_count": 39, "platforms": ["PC"], "developers": ["IllFonic"], "genres": ["Action"], "publishers": ["IllFonic", "Psyop Games"], "esrb_rating": null}