{"id": 19412, "slug": "gish", "name": "Gish", "name_original": "Gish", "description": "<p>In Gish, the player can assume the role of a piece of tar. The game is similar to physics-based platformers like LocoRoco.</p>\n<h3>Plot</h3>\n<p>The backstory of Gish is a parody of the video game cliches. Gish is a jelly yet sentient black creature who lives underground. Gish&#39;s love interest Brea, a human female, was kidnapped by his jealous ex-classmate. Gish goes on a quest to rescue Brea. Defeating the final boss does not automatically save Brea. The player can fail, and the game will end nonetheless, leading to a darker ending.</p>\n<h3>Gameplay</h3>\n<p>The player controls Gish and navigates him through the levels. Gish has no legs or other organs besides a mouth and two eyes, but he has several useful abilities. He can change his shape and physical state to suit the player&#39;s needs. Gish can become amorphous to slip down the slopes and squeeze through the thinnest gaps and holes. He can stick to the walls, ceilings, and other surfaces to climb and hold on. Gish can also become a solid ball which allows him to push other objects from his way, break the obstacles and crush opponents with his weight. Puzzle-like level design often requires Gish to use a complex combination of his powers.</p>\n<h3>Style</h3>\n<p>The game is made in a simple and cartoonish visual style and has occasional glimpses of black humor. It is mostly set underground, in the dark tunnels and caverns. Gish is accompanied by a rock soundtrack that suits the game&#39;s quirky and creepy atmosphere.</p>", "metacritic": 80, "released": "2004-05-10", "tba": false, "updated": "2024-01-26T15:14:26", "background_image": "https://media.rawg.io/media/screenshots/104/104413cef7cf98852df62616becacca6.jpg", "website": "http://www.crypticsea.com/gish", "rating": 3.4, "rating_top": 4, "added_by_status": {"yet": 52, "owned": 1287, "beaten": 61, "toplay": 2, "dropped": 57}, "playtime": 1, "achievements_count": 11, "ratings_count": 105, "suggestions_count": 209, "game_series_count": 0, "reviews_count": 105, "platforms": ["PC", "Linux", "iOS", "macOS"], "developers": ["Cryptic Sea"], "genres": ["Adventure", "Indie"], "publishers": ["Chronic Logic"], "esrb_rating": "Teen"}