{"id": 19423, "slug": "fair-strike", "name": "Fair Strike", "name_original": "Fair Strike", "description": "Do you remember the time when helicopters flew not only in real but also in virtual skies? Those time when a decent combat flight simulators weren't as rare as hen's teeth? So whether you do or not remember that, now you have a perfect chance to try a piece of genre which was very well known in the early 2000s. So don't waste your time and jump into the cockpit of a modern attack helicopter and join a war against world terrorism.<br/>Fair Strike is a game about brave pilots and their lethal celestial weapons fighting against terrorism and drug trafficking. Unlike many other combat flight simulations there will be no boring cloned missions over and over again in this classic game. No way! Fair Strike will vent all its fire fury upon the villains unlucky enough to disturb a peaceful citizens. Your goal is simple - Kill them all!  Your choice - Attack helicopters!<br/><br/><br/><ul><li>Fly 6 playable helicopters: AH-64A Apache, RAH-66 Comanche, PAH-2 Tiger, Ka-50 Black Shark, Ka-52 Alligator, and the Ka-58 Black Ghost. <br/></li><li>Battle heavily-armed narco-terrorists in the Caribbean, violent separatists in Eastern Europe, and Muslim fundamentalists in South East Asia and the Middle East. <br/></li><li>Lay waste to enemy tanks, tankers, bunkers, ships, helicopters, troops. Everything on screen is destructible! </li></ul>", "metacritic": 56, "released": "2015-04-23", "tba": false, "updated": "2019-08-28T22:09:13", "background_image": "https://media.rawg.io/media/screenshots/f6e/f6e0cdb38d7ad0d32167093d8a14e915.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 101}, "playtime": 4, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 234, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["G5 Software"], "genres": ["Action", "Simulation"], "publishers": ["Buka Entertainment"], "esrb_rating": null}