{"id": 19420, "slug": "championship-manager-2008", "name": "Championship Manager 2008", "name_original": "Championship Manager 2008", "description": "Think you can do better? It's your decisions that count: your budget, your buys, your formation, your tactics... your chance to prove it! Use your skills and knowledge to manage your club the way you feel it should be - now it's your turn.<br/>\t\t\t\t\tAll football fans around the world, believe they know more about football than anybody else. More than the guy sat next to them at the match, more than the people commentating on the game, more than the manager of their local team.<br/>\t\t\t\t\tChampionship Manager is the closest you'll ever come to the highs and lows of real football management.<br/><strong>Comprehensive Data Update</strong><br/> <ul><li>Club, Player, Staff and Competition Data updated to the end of the August transfer window<br/> </li><li>Increase of more than 25% of players and staff in database<br/> </li><li>27 playable nations, now including the Australian league</li></ul><strong>Multiplayer</strong><br/> <ul><li>Battle it out with other user managers on one PC!</li></ul><strong>ProZone Analyst Feedback!</strong><br/> <ul><li>Achieve managerial glory using ProZone, football's favourite analysis tool<br/> </li><li>Use ProZone Analyst for in-depth analytical feedback on how players and the team performed during a match<br/> </li><li>Play any match event within ProZone instantly. There's no hiding place for players!<br/> </li><li>Stop, rewind, fast forward and pause; stats you control!</li></ul><strong>Player Tendencies</strong><br/> <ul><li>32 tendencies that modify how an individual player performs during a matchday<br/> </li><li>Ability to mould players in training to learn new tendencies</li></ul>", "metacritic": 68, "released": "2007-11-02", "tba": false, "updated": "2019-08-28T22:09:13", "background_image": "https://media.rawg.io/media/screenshots/82f/82f9018aa1da07ffaca1ae2e60032d99.jpg", "website": "http://www.championshipmanager.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 39, "beaten": 2, "toplay": 1, "dropped": 3, "playing": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 3, "suggestions_count": 317, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC"], "developers": ["Beautiful Game Studios"], "genres": ["Sports"], "publishers": ["Square Enix"], "esrb_rating": null}