{"id": 19424, "slug": "shattered-union", "name": "Shattered Union", "name_original": "Shattered Union", "description": "<p>Following a great increase in terrorism, internal strife and ultimately, the nuclear destruction of Washington, D.C., the United States shatters into a half-dozen nation-states that descend into war. Take the helm of one of these newfound sovereignties (or the 'peacekeeping' European Expeditionary Force) and struggle to reunify America... by any means necessary!</p>\n<ul>\n<li>Modern 3D tactical war game viewed from a \"bird's-eye\" overhead camera.</li>\n<li>Non-linear mission progression with changes based on player-made decisions.</li>\n<li>Real-time resolution of turned-based moves. Take your time while you decide your move, but once you have selected your action, see the results all play out in full animation models, exploding vehicles, and burning cities and forests!</li>\n<li>Fully destructible terrain/environment. As the battle proceeds, everything from explosions and destroyed buildings permanently mark the terrain. Moving tanks will leave tread marks that stay for the duration of the mission. At the end, very little will look the same.</li>\n<li>Fight your way across the United States! Had enough of the windy city? Then go ahead and bomb Chicago! Invade across the Rockies into California, capture the tank factories in Ohio, and lay siege to New York City! You decide - the fate of the nation is in your hands!</li>\n<li>Call up National Guard forces equipped with M1 Abrams battle tanks, Apache helicopters and stealth bombers. Or make a deal with the Russians and equip your boys with MiG fighters and T-95 Heavy Tanks.</li></ul>", "metacritic": 67, "released": "2006-10-25", "tba": false, "updated": "2023-07-22T19:13:18", "background_image": "https://media.rawg.io/media/screenshots/d22/d2289ee72cdc8ba4eb9966b71e71f253.jpg", "website": "http://www.2kgames.com/shatteredunion/", "rating": 0.0, "rating_top": 5, "added_by_status": {"yet": 4, "owned": 75, "beaten": 2, "toplay": 4, "dropped": 3}, "playtime": 1, "achievements_count": 0, "ratings_count": 5, "suggestions_count": 317, "game_series_count": 0, "reviews_count": 5, "platforms": ["PC"], "developers": ["PopTop"], "genres": ["Strategy"], "publishers": ["2K Games"], "esrb_rating": null}