{"id": 19435, "slug": "oknytt", "name": "Oknytt", "name_original": "Oknytt", "description": "Oknytt is a point-and-click adventure game where the player takes the role of a small, seemingly insignificant creature, leading it through a dark world riddled with obstacles to help it find a place to belong. The game takes place in a Norse medieval world and contains a number of beings and areas inspired by Swedish folklore. <br/><br/>Oknytt's gameplay is comprised of classic point-and-click puzzle solving combined with the usage of four runes located at the bottom of the screen. These runes can be activated at any time to trigger various changes and events in the area around the protagonist. Each rune has a specific element tied to it which have different areas of use depending on what can currently be seen in the environment. <br/>Figuring out what the runes can be used for and how to utilise their affect on the environment together with the items at your disposal is key to you being able to progress through the game world. <br/><br/><strong>Features </strong><br/><ul><li>Manipulate the environment around you using elemental forces <br/></li><li>A unique art style inspired by the famous Swedish painter John Bauer <br/></li><li>Experience and collect lore about creatures and monsters from Scandinavian folklore <br/></li><li>Fully voiced by the talented Brian Hall <br/></li><li>6-7 hours of puzzle solving</li></ul>", "metacritic": 61, "released": "2013-07-08", "tba": false, "updated": "2023-05-02T22:27:28", "background_image": "https://media.rawg.io/media/screenshots/4db/4dbd4922839246a1c1dd4e951db70fba.jpg", "website": "http://www.nemoria.net", "rating": 3.32, "rating_top": 4, "added_by_status": {"yet": 9, "owned": 463, "beaten": 13, "toplay": 4, "dropped": 2}, "playtime": 4, "achievements_count": 10, "ratings_count": 24, "suggestions_count": 400, "game_series_count": 0, "reviews_count": 25, "platforms": ["PC"], "developers": ["Nemoria Entertainment"], "genres": ["Adventure", "Indie"], "publishers": ["Nemoria Entertainment"], "esrb_rating": null}