{"id": 19441, "slug": "silent-hunter-iii", "name": "Silent Hunter III", "name_original": "Silent Hunter III", "description": "<p>The king of submarine simulations returns with an all-new 3D engine, new crew command features, and more realistic WWII naval action than ever before. The movie-like graphics and simple, tension-filled gameplay make this the perfect game for the realism fanatic and the casual gamer.<br />\nRealistic and immersive environment: The suspense-filled atmosphere includes realistic 3D water modeling, day/night cycles, and historically accurate subs, ships, and aircraft. The detailed U-boat interiors, changing weather effects, and engaging audio represent the ultimate in WWII submarine warfare.<br />\nA deadly array of U-boats and weapons: Playable U-boats include Type II, VII, IX, and XXI submarines. Take aim against Allied convoys and warships. In recreating the great submarine battles of WWII, players will hide in silence just below threatening escort ships, fire deadly torpedoes, or surface and pound enemies with the deck gun.<br />\nDynamic campaign: Create your own realistic naval war story. Your military career will be influenced by successful command decisions in an unscripted and non-linear WWII campaign.<br />\nAccessible to players of all skill levels: Players will experience a simplified learning curve that will be easier to handle than standard simulations. Use the naval academy tutorial to learn the basics. Customize the realism settings for play that appeals to a variety of WWII combat fans.<br />\nCommand your crew: The crew will take orders and evolve based on the results of each patrol.<br />\nMultiplayer cooperative play: For up to eight players via LAN.</p>", "metacritic": 90, "released": "2005-03-15", "tba": false, "updated": "2024-01-21T22:27:44", "background_image": "https://media.rawg.io/media/games/f39/f39f58a4ac9c54e08f958def1b953649.jpg", "website": "", "rating": 4.21, "rating_top": 5, "added_by_status": {"yet": 9, "owned": 137, "beaten": 9, "toplay": 5, "dropped": 10, "playing": 2}, "playtime": 1, "achievements_count": 0, "ratings_count": 19, "suggestions_count": 333, "game_series_count": 4, "reviews_count": 19, "platforms": ["PC"], "developers": ["Ubisoft"], "genres": ["Strategy", "Simulation"], "publishers": ["Ubisoft Entertainment"], "esrb_rating": "Teen"}