{"id": 194446, "slug": "catclicker", "name": "CatClicker", "name_original": "CatClicker", "description": "<p><strong>Note: this is a post-jam version. A few bugs in the tutorial have been fixed, that made it resolution dependant. Also, the first two cats won't die during the tutorial.</strong> (Unless you do some sequence breaking, wich is quite possible, but not recommended ;) )<br/></p>\n\n<p>This game was our entry for Ludum Dare 40!<br/></p>\n\n<p>Play as a crazy cat lady on her endeavour to earn enough money to buy the ultimate cat suit. (It even has ears and a tail that will react to your emotions!) For only 75,000$! What a steal!<br/>And of course, the only way to earn money for any crazy cat lady worth her salt is: Breeding Cats!<br/>Use the mouse to buy new cats, bowls to feed your cat, litter boxes and breeding boxes.<br/>You can clean litter boxes and fill bowls by clicking on them.<br/>Drag cats into the breeding box to breed them. You need one male (blue ribbon) and one female (red ribbon) to breed. Also your cats must not be satisfied, e.g. you must see a small heart above them.<br/>Drag happy cats to the sales box to sell them and earn money.<br/>If you don't feed your cats or don't clean the toilets, they might die. That would be kind of mean.<br/>And you will have to click the corpses to remove them (eeewww, gross!) and that will cost some money as well.<br/>And their ghosts will haunt you. If you ever feel overrun by ghosts, you can call an excorcist to get rid of them. But it will be costly. (You deserve that for not caring properly for your cats.)<br/>Oh, and there are quests. Complete these to gain lots of money!</p>\n\n<p>Oh, by the by, so much breeding produces genetic defects. you might sometimes get cats with black ribbons from breeding. You can neither sell nor breed these cats. That's what you get for so much incest.</p>\n\n<p>All assest except for sound effects were created by us during this LD.<br/>We are:<br/>- Johannes Alef (https://twitter.com/MrMadcat42 ): programming<br/>- Randle (https://soundcloud.com/randle ): Music<br/>- Rebecca Schieren: artist<br/>- Hong Linh Thai: Music and additional programming<br/>- Koucha123 (https://soundcloud.com/Koucha123 ): Music</p>\n<p>Technology used:<br/>- Unity3D<br/>- Krita<br/>- Cubase Elements<br/>- Ableton Live</p>", "metacritic": null, "released": "2017-12-05", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/bf1/bf14bb9f2f09690d610ef0204fac8a10.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 17, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["MrMadCat"], "genres": [], "publishers": [], "esrb_rating": null}