{"id": 194421, "slug": "extreme-pro-motorcycle-simulator", "name": "Extreme Pro Motorcycle Simulator", "name_original": "Extreme Pro Motorcycle Simulator", "description": "<p>Do you like bike one wheeling games? Let’s have a ride on your ultimate motorcycle like a pro rider. Perform some stunts in one wheeling bike game. Become a Daredevil and amaze everyone with your superior skills while executing some checkpoint motorcycle racing and pro motorcycle stunts in motorcycle games 2018. In Extreme Pro Motorcycle Simulator let’s have exciting ride and crazy stunts. Use your motorcycle driving tricks and complete dangerous challenges. Make all achievements of this bike stunt game. Drive sensible motor cycle ride to be careful do not hit any vehicles and race track. Start your heavy bike with real ultimate motorcycle physics and play this motorcycle simulator like a pro. Ride as extreme rider with tricky stunts and one wheeling motorcycle tricks. </p>\n<p><b>Checkpoint Heavy Motorcycle Racing:</b><br/>Ultimate Motorcycle realistic simulator combines the fun riding physics to create the best motorcycle simulator on mobile with its advanced physics engine. Start racing with opponents on highway and complete all checkpoints in extreme speed and become a racer champion. The best motorcycle simulator comes with the best riding physics! From racing bikes to off road bikes you will enjoy at super motorcycle racer. This speedy bike drift racer is the perfect HD game for speed racers. </p>\n<p><b>One Wheeling Bike Game Experience:</b><br/>Enjoy your new game of one wheeling bike stunts with amazing levels and extreme dangerous stunts. Your ultimate motorcycle has superb physics to perform bike 3d wheeling stunts on tough paths. Long one wheeling bike driving will give you more scores and you may unlock furious paced heavy bikes and stylish fastest motorcycles in moto garage. Turn your wheels, burn your tires now and become a top racer in Extreme Pro Motorcycle Simulator.</p>\n<p><b>Motorcycle Jumping Stunts:</b><br/>There are massive jumps, midair bike jumping and variety of stunt racing tracks to perform extreme stunts! City highways are no match for your insane speed so start the thrilling adventure with ultimate motorcycle speed. The nitro speed booster is available, just press the nitro while riding or motor bike jump and fly you enjoy the jump fly stunt with motorcycle games 2018. Go really fast with super-charged nitro boost to get the bike up to speeds over 200 MPH with bike drifting &amp; racing championship.</p>\n<p><b>Bike Demolition &amp; Motorcycle Destruction Missions:</b><br/>Start fun of bike crash and in demolition bike task. Enjoy crash stunt racing on your motorbike and complete all motorcycle destruction missions wheeling bike race game. Bash to crash the derby auto bikes in crazy bike destruction mania in extreme racing conditions in this best motorcycle game. Complete all motorcycle demolition destruction missions unlock more heavy bikes for ultimate fastest racing as best rider.</p>\n<p><b>Motorcycle Parking Missions:</b><br/>After motorcycle racing and bike stunt jumping you have to park your bike in motorcycle parking challenge. Multi storey bike parking and motorcycle parking in congested parking area will check your skills. Perform multi level bike parking missions and become a motorcycle parking champion in this Extreme Pro Motorcycle Simulator. Motorcycle riding and parking with stunts and jump will surely amuse you as motorcycle stunt rider.</p>", "metacritic": null, "released": "2018-05-02", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/453/453fc47dfa783f6f64e5648fd2c411d2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 143, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Tap 2 Race"], "genres": ["Racing"], "publishers": [], "esrb_rating": null}