{"id": 194481, "slug": "sudoku-in-space", "name": "Sudoku In Space", "name_original": "Sudoku In Space", "description": "<p>Whether you've never played Sudoku before or you're an experienced Sudoku player, you'll loveSudoku In Space! If you're new to Sudoku, Allen the Alien will teach you how to play with his step-by-step tutorial. Think you're an expert at Sudoku? The colors-only mode will surely challenge your brain and skills!</p><p>★ Four difficulty levels: Beginner, Easy, Medium, Hard.<br/>★ Hundreds of unique puzzles.<br/>★ Play in colors-only mode for a cosmic challenge.<br/>★ Play with numbers for a more classic challenge.<br/>★ Relaxing music and stellar sounds.<br/>★ Intuitive user interface that's easy to navigate.<br/>★ Auto-save after every move so you don't have to worry about interruptions.<br/>★ Three hints per puzzle to use without penalty.<br/>★ Learn how to play Sudoku with a step-by-step tutorial by Allen the Alien.<br/></p><p>\"If you're looking for a new way to play Sudoku, or if you've never played before because it hasn't appealed to you, try this. You might be pleasantly surprised, like I was! Score: A\" - Nerdy But Flirty<br/>http://nerdybutflirty.com/2014/11/07/review-sudoku-in-space-will-you-choose-classic-or-cosmic/</p><p>\"...pretty much blows the traditional paper and pen version out of the water. With this version of Sudoku you'll be treated to all kinds of fun and vivid colors, music, sound effects, and graphics, something you're probably not used to when it comes to Sudoku.\"<br/>- http://apppicker.com/reviews/18890/Sudoku-In-Space-app-review-add-some-spice-to-your-game/</p><p>\"It's a creative new take on Sudoku that contains many levels of games of varying difficulty with an optional gameplay twist that utilizes colors 'for a cosmic challenge.' - 4 out of 5 stars\" -http://androidappsreview.com/2014/09/03/sudoku-in-space-android-game/</p><p>\"Sudoku in Space is the sudoku game for people who thought they couldn't play sudoku!...If you've always struggled with learning how to play Sudoku or you're looking for a new way to play, you'll definitely enjoy Sudoku in Space.\" - http://in-our-spare-time.com/sudoku-space-app/</p><p>Learn how to solve Sudoku puzzles with Sudoku In Space! The tutorial gives easy instruction for beginners. Play with colors or numbers. Follow Allen the Alien's story as he moves from galaxy to galaxy with your help. Sudoku In Space is available in English, Spanish, and Japanese.</p>", "metacritic": null, "released": "2015-08-23", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/80d/80d39382d1dcde58f28a5280cbaf4451.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 46, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Napland Games"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}