{"id": 19455, "slug": "marc-eckos-getting-up-contents-under-pressure", "name": "Marc Ecko's Getting Up: Contents Under Pressure", "name_original": "Marc Ecko's Getting Up: Contents Under Pressure", "description": "<p>Play as Trane, a &quot;toy&quot; graffiti artist with the street smarts, athletic prowess and vision to become an &quot;All City King&quot; - the most reputable of all graffiti artists. Along your quest, uncover the mayor&#39;s deep, dark secret and use your fighting talents and high-wire graffiti to expose the city&#39;s leader as a corrupt tyrant. As you struggle to save a neighborhood from an oppressive government, one question stands out: What if graffiti could change the world? Risk your life battling city authorities and rival graf gangs - mere obstacles in your attempt to get your tag up. And in this city, not just any tag will do. You have to &quot;Get IN, Get UP and Get OUT&quot;.<br />\nCombat: master a unique fighting technique and use improvised weapons<br />\nGraffiti: create tags in pressure situations, using multiple skills and styles<br />\nIntuition: follow your sixth sense to find the best spots to tag<br />\nSneak mode: infiltrate areas and avoid capture as you creep silently through the city<br />\nNavigation: utilize a unique guidance system to &quot;get up&quot; and tag</p>", "metacritic": 69, "released": "2006-02-14", "tba": false, "updated": "2024-04-07T23:37:21", "background_image": "https://media.rawg.io/media/games/e15/e15a2cad8ff4c494a0f51c106049db5b.jpg", "website": "", "rating": 4.12, "rating_top": 4, "added_by_status": {"yet": 38, "owned": 594, "beaten": 154, "toplay": 19, "dropped": 45, "playing": 3}, "playtime": 1, "achievements_count": 0, "ratings_count": 176, "suggestions_count": 910, "game_series_count": 0, "reviews_count": 179, "platforms": ["Xbox", "PC", "PlayStation 2"], "developers": ["General Arcade", "The Collective"], "genres": ["Action", "Adventure"], "publishers": ["Devolver Digital", "Atari"], "esrb_rating": "Mature"}