{"id": 194524, "slug": "taco-trump-down", "name": "Taco Trump Down", "name_original": "Taco Trump Down", "description": "<p>If you like TACO TRUMP DOWN, you an get it on Android FOR FREE:</p><p>https://play.google.com/store/apps/details?id=com.suhail.tacotrumpdown</p><p>--- DESCRIPTION</p><p>Mexican Superhero Taco Man heard that Trump wants to build a wall to keep Mexico out. That made Taco Man angry. Wanting to make Mexico great again, he grabbed his tacos and took flight. Flying over Trump's wall, he saw Trump building new things. Towers, walls, election centers, and steak houses. With extreme agility, Taco Man began to hurl his tacos at Trump's buildings, bringing them down one by one, even as the Donald was building them.<br/>Taco Man is also on a lookout for some Jalapenos...</p><p>Taco Trump Down is a classic arcade shmup game. Taco Man never stops throwing tacos; you control the direction of his flight and thus where the tacos land. Develop your skill as you focus Trump's buildings down, but watch out! Balloons fly from Trump's election centers, and steaks are thrown from his steak houses. If they touch you, they stagger your flight and you lose.</p><p>In addition, Jalapenos drop down sporadically. Pick them up to give Trump a nasty surprise!</p><p>How high can you score?<br/>Will everything Trump builds fall?<br/>And most importantly... will you take a dump on Trump?</p><p>--- CONTROLS</p><p>Click LEFT and RIGHT to go in that direction. Taco Man never stops moving, so one tap on either key is enough to steer him in that direction! To aim straight down, you need to constantly tap both LEFT and RIGHT.</p><p>+/- control sound volume.<br/>0 to mute the game.</p><p>--- DIFFERENCES</p><p>Control scheme is slightly different between versions.</p>", "metacritic": null, "released": "2016-06-27", "tba": false, "updated": "2019-08-28T23:20:55", "background_image": "https://media.rawg.io/media/screenshots/82d/82d8b5ecd55fd280873c7b1af883eb22.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 21, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Suhail Habib"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}