{"id": 19475, "slug": "velvet-assassin", "name": "Velvet Assassin", "name_original": "Velvet Assassin", "description": "<h3>The hero</h3>\n<p>The game is inspired by the real story of the British spy Violette Szabo. The owner of the St. George Cross, Violetta successfully fulfilled the tasks of the British special services. She was caught and killed in a concentration camp during the war. The player will go on a stealth adventure in the era of World War II and take control of Violette Summer, which runs deep behind enemy lines.</p>\n<h3>the story</h3>\n<p>The story tells of a girl from Dorset, Violette Summer, who lived happily with her family. But the war was all the same, and in the darkest times for the country, Violette joins the secret services of Britain. The game consists of secret missions and sabotages in which she took part. The action takes place in war-torn Europe: the agent is operating in Poland, Germany, and France.</p>\n<h3>Key features</h3>\n<p>From gameplay the point of view, the game is practically no different from other representatives of the genre: from the very beginning, Violette will have to hide in the shadows in order to survive and move through levels. The user interface helps the player to navigate in terms of how visible his/her actions are: it shows the silhouette of Violette, which can be in three states - each one representing how well the agent is hidden. The game does not provide a complex combat system, but the ability to detect a rebuff to enemies is available. Also, players can upgrade agent’s skills on three branches: Stealth, Morphine or Strength.</p>", "metacritic": 61, "released": "2009-04-28", "tba": false, "updated": "2024-04-12T08:20:38", "background_image": "https://media.rawg.io/media/games/cfb/cfb96f5490b8cf91e9952a8416a71245.jpg", "website": "http://www.playvelvetassassin.com", "rating": 2.94, "rating_top": 3, "added_by_status": {"yet": 68, "owned": 1205, "beaten": 60, "toplay": 21, "dropped": 73, "playing": 2}, "playtime": 1, "achievements_count": 45, "ratings_count": 129, "suggestions_count": 499, "game_series_count": 0, "reviews_count": 130, "platforms": ["PC", "macOS", "Xbox 360"], "developers": ["Replay Studios"], "genres": ["Action", "Adventure"], "publishers": ["Missing Link Games", "SouthPeak Games"], "esrb_rating": "Mature"}