{"id": 19472, "slug": "rise-of-flight-united", "name": "Rise of Flight United", "name_original": "Rise of Flight United", "description": "<strong>Rise of Flight</strong> is the most realistic WWI PC flight simulation ever created. Take to the skies of war torn Europe and experience daring air combat at the dawn of aviation. Re-enact famous air battles fought by legendary aces such as Manfred von Richtofen, James McCudden, Georges Guynemer and Eddie Rickenbacker. Rise of Flight transports you to a time when courageous pilots fought each other for control of the sky high above the bloody trenches. In aircraft made of canvas and wood they battled to the death. While some survived to become legends, most met a fiery fate. Do you have the skills and the courage to become an Ace?<br/><br/>The free-to-play <strong>Rise of Flight United</strong> is just the beginning of your adventure. There are 35 additional flyable aircraft available for purchase along with additional content from the Steam store in the form of content packs. These packs include not only airplanes and additional theaters of war, but other helpful items such as Field Modifications and Weapon Modifications for your aircraft which can help you be a more effective combat pilot. The Rise of Flight universe continues to expand with new flyable aircraft and game updates added on a regular basis. The sky knows no limit.The free-to-play Rise of Flight United allows you to:<br/><ul><li>Pilot three fighter planes (Spad 13, Albatros D.Va and Nieuport 17 by Dux plant) with all their modifications included against any planes in the game.<br/></li><li>Access Training campaign, Quick Mission Builder, Career mode and pilot the aircraft you have in multiplayer.<br/></li><li>Enjoy advanced graphics featuring High Dynamic Range (HDR) lighting, blinding sun glare, beautiful sunrises and sunsets, dark moonlit nights with stars and realistic looking raindrops and oil splatter on pilot goggles.<br/></li><li>Experience a cutting edge flight-sim with advanced flight-models, adjustable difficulty settings, a complex physics engine and an industry leading progressive damage model.<br/></li><li>Practice teamwork with your friends by manning additional gunner positions. You get unlimited access as a gunner to multi-crew airplanes in Multiplayer matches. Protect your plane’s six o’clock!<br/></li><li>Endure G-effects with blackout, red out and wounded pilot effects featuring blood splatter, ringing ears and control difficulty.<br/></li><li>Explore huge maps of Western and Eastern fronts of World War I.</li></ul>", "metacritic": 77, "released": "2013-09-05", "tba": false, "updated": "2022-08-15T19:04:54", "background_image": "https://media.rawg.io/media/screenshots/ff3/ff33f8b67d6e0a04273260e43901dd93.jpg", "website": "http://riseofflight.com", "rating": 2.91, "rating_top": 4, "added_by_status": {"yet": 10, "owned": 445, "toplay": 1, "dropped": 3}, "playtime": 1, "achievements_count": 89, "ratings_count": 11, "suggestions_count": 363, "game_series_count": 0, "reviews_count": 11, "platforms": ["PC"], "developers": ["777 Studios"], "genres": ["Simulation"], "publishers": ["1C Company"], "esrb_rating": null}