{"id": 194806, "slug": "treasure-bay", "name": "Treasure Bay", "name_original": "Treasure Bay", "description": "<p>Treasure Bay is a great puzzle game to play when you're bored. In addition to improving your logic skills and entertaining yourself, it helps you to spend some time in a relaxed manner. Playing this game will keep your brain awake and you will have a great satisfaction while solving more and more levels.</p><p>Treasure Bay is a fun game where you have to align 3+ boxes to open treasure chests. Train your brain and challenge yourself. Move a box in any direction (horizontal, vertical or diagonal) to align it with at least two others. A box cannot be moved above the other. Since at least three boxes are aligned, they disappear. When each box disappeared, you win. Do not hurry ! Starting with the wrong assembly can prevent you from gaining the level. If you're stuck, just tap the replay button. Play Treasure Bay to improve your logic skills.</p><p>Lubo has found a lot of treasures. Help him to solve the puzzles.</p><p><strong>How to play?</strong></p><p>- Move a color box in any direction to align it with two (or more) of the same color!</p><p>- Align at least three boxes in any direction: line, column or diagonal</p><p>- A box can not be moved above another</p><p>- When at least three boxes are aligned, they burst!</p><p>- Clear the puzzle to complete the level!</p><p><strong>Features</strong></p><p>- Help Lubo, the cute and strange orange character, to open the treasure chests</p><p>- Go for a trip on the sea and find a lot of treasure chests!</p><p>- Earn up to 100,000 points of XP for your Google Account game</p><p>- Match colored boxes to make it explode!</p><p>- Train your brain with over 50 challenging levels! (And more to come)</p><p>- Place the box in the right place to blow up one row and one column at the same time</p><p>- No timer! Relax and have fun!</p><p>- Find the right combination!</p><p>- Easily accessible \"retry\" button!</p><p>- Challenging puzzles to improve your logic!</p><p>- Big treasure chests full of golden coins</p><p>- Free Ads!</p><p>- Save and restore your progress</p><p><strong>Do you need help?</strong></p><p>If you are stuck and you consider you have to waste a lot of time on one level. Feel free to contact us and we'll give you the solution.</p>", "metacritic": null, "released": "2016-04-19", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/958/9583520ded81db111c2ee0a1db48ba28.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 38, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["axenlader"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}