{"id": 19483, "slug": "avencast-rise-of-the-mage", "name": "Avencast: Rise of the Mage", "name_original": "Avencast: Rise of the Mage", "description": "<p>Avencast: Rise of the Mage is an action RPG game developed by ClockStone Software. The game combines the elements of a beat-em-up, quest and puzzle games. </p>\n<h3>Plot</h3>\n<p>A young mage is brought up by an old wizard and is sent to Avencast wizardry academy. To complete his final exam, the mage has to go to a forest and find his own crystal. Upon returning back to the academy, it is revealed that Avencast fell under attack. The monsters roam the halls of the academy, while a few survivors barricade themselves deep in the academy. The mage has to save Avencast and figure out why was it attacked in the first place.</p>\n<h3>Gameplay</h3>\n<p>The main action in the game is killing enemies. It can be done in two ways: using magic spells or physically attacking them. Should the player choose the first method, they&#39;ll have to figure out the complex magic system.</p>\n<p>The magic system consists of three branches: force spells (used for close quarters combat), wisdom spells (long range combat), and summon spells (used for summoning pets and comrades). The activation of every spell is made with the press of three buttons. </p>\n<p>After killing an enemy, the players are awarded experience points which are used to level up your character. After leveling up, 10 points are given to the player, that can be used to upgrade the character stats or to buy new spells. The players can loot Avencast to find potions, notes, new armor or clothing.</p>", "metacritic": 68, "released": "2010-03-16", "tba": false, "updated": "2023-12-21T08:09:28", "background_image": "https://media.rawg.io/media/screenshots/8a9/8a93801fbd249cfc6fd42140dfbf20a7.jpg", "website": "http://www.avencast.com", "rating": 2.04, "rating_top": 1, "added_by_status": {"yet": 42, "owned": 1148, "beaten": 5, "toplay": 5, "dropped": 10}, "playtime": 1, "achievements_count": 0, "ratings_count": 48, "suggestions_count": 611, "game_series_count": 0, "reviews_count": 48, "platforms": ["PC"], "developers": ["ClockStone Studios"], "genres": ["Action", "RPG"], "publishers": ["Meridian4"], "esrb_rating": null}