{"id": 19497, "slug": "tristoy", "name": "TRISTOY", "name_original": "TRISTOY", "description": "TRISTOY is a story-driven 2D co-op platformer designed from the ground up exclusively for two player co-operative gaming enjoyment!<br/><br/>Set in Tristoy, an ancient fortress in the middle of the Sea of Shards you play together as Prince Freedan and the Wizard Stayn. You and a friend are forced to team up to try and escape the dungeon and defeat a common enemy, the Witch Ink.<br/><br/>Explore dungeons filled with traps and monsters - puzzle, jump and fight your way out as you attempt to escape from Tristoy. Designed to be played together on one screen, Tristoy’s engrossing non-linear story features multiple endings and requires you to work together, testing your friendship and forcing you to confront moral dilemmas and make some hard choices. <br/><br/>Developed by German studio Uniworlds Game Studios, the game features a dynamic split screen, which moves, rotates and seamlessly joins back together, keeping you locked in the action. Play with a keyboard, controller or use your smartphone to control the game with the companion app.<br/><br/><br/><br/>Grab a friend and try to escape from the dungeons of TRISTOY in this story-driven co-op platformer.  Play locally or over Steam. Meaningful choices and deadly consequences are waiting for you!Key features<ul><li>The ultimate couch multiplayer game for two<br/></li><li>Metroidvania style story driven 2D platformer<br/></li><li>Play locally or via Steam (giftable copy included - This will be available in your inventory)<br/></li><li>An epic co-op game (for 2 players only)<br/></li><li>Designed to be played together on one screen but can also be played via online co-op<br/></li><li>Dynamic split screen that moves, rotates and joins together<br/></li><li>Deep character play through individual story and dialogue choices<br/></li><li>Engrossing non-linear story with multiple endings<br/></li><li>Unique cooperative puzzles and quests<br/></li><li>Numerous types of enemies, puzzles, quests and additional unlockable content<br/></li><li>Full controller support or use your Smartphone as a controller using the developers own technology UNIPLAY (Android and iOS App available)</li></ul>", "metacritic": 49, "released": "2015-01-15", "tba": false, "updated": "2022-09-29T23:50:09", "background_image": "https://media.rawg.io/media/screenshots/d9e/d9e0fed6a06b6bceff9a37c317ef8ec8.jpg", "website": "http://www.tristoy.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 196, "beaten": 1, "toplay": 1, "dropped": 1}, "playtime": 6, "achievements_count": 28, "ratings_count": 2, "suggestions_count": 491, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Uniworlds Game Studios"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Headup Games", "Merge Games"], "esrb_rating": null}