{"id": 194949, "slug": "space-pilot-itch", "name": "Space Pilot (itch)", "name_original": "Space Pilot (itch)", "description": "<p><strong>Space Pilot </strong>v1.0<br/></p>\n<p><strong>Starting the Game &amp; System Requirements</strong><br/>Run the game by double clicking on the SpacePilot.exe icon in the extracted folder.</p>\n<p>A modern PC (Pentium or higher) running Windows XP or later is required.<br/><br/><strong>Concept</strong><br/>Fly through space with a spaceship while avoiding and destroying as many asteroids and enemies as possible. There are 10 Levels of gameplay.<br/></p>\n<p><strong>Game Introduction</strong><br/>You control a spacecraft in the bottom part of the screen. Your spacecraft can move side to side. Space objects move from top to bottom and various other directions.<br/></p>\n<p><strong>Controls and Controlling</strong><br/></p>\n<strong>Key</strong><strong>Function</strong>Cursor KeysControl shipCtrlFire weaponSToggle Sound On/OffESCExit Gameplay / Exit GameF11Toggle Fullscreen/Window ModeF12Advance to next level (up to level 6)\r\n<p><strong>Scoring</strong><br/></p>\n<p>You lose points for every object that passes by your ship. The number of points lost is equal to half the amount of points for the specified object in the scoring chart in the Instructions.<br/><br/>You also lose 100 points every time your ship is destroyed.<br/></p>\n<p><strong>Game Features &amp; Hints</strong><br/>Avoid being hit. Destroy as much as you can.</p>\n<p>Explosion particles will not damage your ship.</p>\n<p>Your ship can only be moved left and right.</p>\n<p>An extra life is gained for every 1000 points earned without dying. Unlike with scoring, objects that pass by your ship do not impact point accumulation for an extra life.</p>\n<p>Advance to the next level for every 1000 score points. The game consists of 10 levels. </p>\n<p>The game will continue in level 10 as long as you can stay alive, thus, there is no end to the game.</p>\n<p><strong>Saving and Loading Games</strong><br/>The saving and loading of games is not available.<br/></p>\n<p><strong>Comments &amp; Feedback</strong><br/>Your comments are welcomed.<br/></p>\n<p><strong>Credits</strong><br/></p>\n<p>Game Design &amp; Programming by David Falksen</p>\n<p>Artwork by The Game Creators, Ltd.</p>\n<p><strong>License</strong><br/>This game is public domain; however, donations are greatly appreciated.<br/><br/><strong>Version Update Information</strong><br/>Version 1.0<br/> Game released.<br/></p>\n<p><strong>Disclaimer</strong><br/>AUTHOR IS PROVIDING THIS SOFTWARE AND THE ACCOMPANYING FILES \"AS IS\". AUTHOR DISCLAIMS ALL WARRANTIES, CONDITIONS OR REPRESENTATIONS (WHETHER EXPRESSED OR IMPLIED, ORAL OR WRITTEN) WITH RESPECT TO THE SOFTWARE AND THE ACCOMPANYING FILES. AUTHOR DOES NOT WARRANT THAT THE SOFTWARE WILL FUNCTION WITHOUT INTERRUPTION OR BE ERROR FREE, THAT AUTHOR WILL CORRECT ALL DEFICIENCIES, ERRORS, DEFECTS OR NONCONFORMITIES OR THAT THE SOFTWARE WILL MEET YOUR SPECIFIC REQUIREMENTS.</p>", "metacritic": null, "released": "2018-05-23", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/552/552401a3876c37af52d7735014dc5b1e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 25, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["davidf215"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}