{"id": 195, "slug": "infinity-blade", "name": "Infinity Blade", "name_original": "Infinity Blade", "description": "<p>Winner of the 2011 Apple Design Award, and more than 20 “Game of the Year” &amp; “Top App” awards!  Tons of NEW FREE CONTENT available now!  See below for more details.<br />\nFrom Epic Games’ award-winning studio, ChAIR Entertainment, comes Infinity Blade, a new sword fighting action game developed exclusively for iPhone, iPod Touch, and iPad.<br />\nHere’s what the press has to say about Infinity Blade:<br />\n<strong>JOYSTIQ: 5 out of 5 - &quot;In terms of recreating a console-level experience on the iPhone, you simply will not do better than Infinity Blade&quot;<br />\n</strong>GAMEPRO: 5 out of 5 - &quot;The next generation of handheld gaming is here&quot;<br />\n<strong>SLIDE TO PLAY: 4 out of 4 - &quot;Any serious iOS gamer should grab this one up&quot;<br />\n</strong>ENGADGET: 9 out of 10 - &quot;Utterly delicious to look at&quot;<br />\n<strong>IGN: 9 out of 10 - &quot;Infinity Blade is easily one of the most defining iPhone games of 2010&quot;<br />\n</strong>TOUCHARCADE: &quot;It doesn&#39;t get much more &#39;must have&#39; than this&quot;<br />\n**GIZMODO: &quot;An iOS game like you&#39;ve never seen before&quot;<br />\nThe first mobile game powered by Epic’s cutting-edge Unreal Engine 3 technology, Infinity Blade takes handheld gaming to new heights with gorgeous visuals, adrenaline-fueled battles and advanced character progression in a fully 3D castle realm.<br />\nINFINITY BLADE<br />\nFor untold ages, the God King has ruled with an iron fist - his power is incalculable; his followers, legion. Now you must journey to the Dark Citadel to battle his Titans, one by one, until you face the tyrant himself. As it has been for all in your bloodline, this is your birthright - to free your people from an endless legacy of darkness. The immortal can be vanquished - but only if heart, mind, and steel are one.<br />\nDYNAMIC SINGLE-PLAYER CAMPAIGN<br />\nSpectacular 3D characters and environments powered by the award-winning Unreal Engine 3 bring to life the story of a lone knight’s pursuit to save civilization.<br />\nRESPONSIVE AND INTUITIVE TOUCH CONTROLS<br />\nAttack, dodge, block, and cast devastating spells - all with the simple swipe of a finger.<br />\nSIMPLE NAVIGATION<br />\nEasy to use, tap-to-move controls enable players to effortlessly navigate and explore the castle realm while searching for collectable items such as treasure, swords, shields, armor and other magical objects.<br />\nDEEP CHARACTER CUSTOMIZATION<br />\nDozens of Swords, Shields, Helmets, Armor, and Magic Rings to acquire and master - leveling up your character and increasing Attack, Health, Shield and Magic skills.<br />\nGAME CENTER<br />\nAchievements and Leaderboards, challenge your friends to multiplayer matches online via Game Center!<br />\nUniversal App - Play Infinity Blade on iPhone 3Gs, iPhone 4/4s, iPhone 5/5s/5c, iPhone 6/6+/6s/6s+, iPhone SE, iPhone 7/7+, iPhone 8/8+, iPad 1/2/3/4, iPad Air/Air 2, iPad Pro, iPad Mini/Mini 2/Mini 3/Mini 4, iPod Touch 3 (16GB or above), or iPod Touch 4/5/6 for a single low price.<br />\nNOTES:<br />\n- If you are experiencing technical issues with the App, please visit the Infinity Blade support page at: http://infinitybladegame.com/<br />\n- IMPORTANT: It is highly recommended that you upgrade your device to the latest iOS version.<br />\n- PARENTS: you can turn off In-App purchasing in the iOS settings.<br />\nFollow @Infinityblade on Twitter</p>", "metacritic": 87, "released": "2010-12-09", "tba": false, "updated": "2024-03-20T13:36:25", "background_image": "https://media.rawg.io/media/screenshots/3b4/3b40d7f47e3103520f4fd5814843d512.jpg", "website": "http://infinitybladegame.com", "rating": 4.11, "rating_top": 4, "added_by_status": {"yet": 3, "owned": 18, "beaten": 41, "toplay": 6, "dropped": 9}, "playtime": 5, "achievements_count": 0, "ratings_count": 37, "suggestions_count": 393, "game_series_count": 2, "reviews_count": 38, "platforms": ["iOS"], "developers": ["Epic Games"], "genres": ["Action", "Adventure"], "publishers": ["Chair Entertainment Group"], "esrb_rating": "Teen"}