{"id": 195062, "slug": "taxi-service-football-world-cup-2018", "name": "Taxi Service: Football World Cup 2018", "name_original": "Taxi Service: Football World Cup 2018", "description": "<p>Drive your crazy car as part time taxi driver from Russian city hotels to Football stadium in this soccer world cup 2018 taxi driving game. Taxi driving simulator game is here to start your career driving an amazing new sports car taxi in your favorite Moscow city. Start taxi pick and drop missions from motels to Russia football stadiums. Enjoy the taxi games as a car taxi with amazing controls. Our Taxi Service: Football World Cup 2018 is the best taxi simulator which is not simply a car game. Start your taxi engine and have a best driving experience in heavy Russian capital city with this car simulator which has best for car driving skills. So start car driving as taxi driver and pick passengers from football stadium after the end of the football world cup 2018 match and drop them on required hotel with amazing car taxi driving missions.</p>\n<p>As football world cup 2018 taxi cab driver of Russia, begin your career as taxi driver; pick &amp; drop passengers on board to their pinned locations and practice as taxi parking master with taxi driving school. In taxi games 2018, prepare you for the best taxi driving school experience and drive above heavy Moscow traffic roads along with your elevated taxi car. Use map as guide to help you reach the destination and don’t forget to refuel yellow taxi cab from highway gas station. Experience the Russian taxi simulation on the event of football world cup 2018 in the best taxi games 2018. Drive your Russian taxi cab and sit behind the crazy car taxi steering wheel with the yellow taxi cab in new generation of best taxi driving games.</p>\n<p>Russian taxi cab driver 18 takes modern taxi driving simulator games and taxi car parking school with the unique gameplay of elevated car taxi. Your smart car is ready to give live football viewers for giving taxi service nearest from Russian hotels. Every passenger is in hurry because football world cup 2018 match will be begin in a while and they are searching for taxi service from Moscow motels to football stadium. Your Moscow taxi simulation will be the best football taxi driving experience with elevated car taxi games.  Go to city airport and pick passengers from airport to hotel.  Whether going to city airport or across town, this smart car includes above Russian city with rush and heavy traffic roads for efficient public transportation. </p>\n<p>Features in Taxi Service: Football World Cup 2018 :</p>\n<p>🚖 Yellow cab driving simulation on Russian Highways.<br/>🚖 Football world cup 2018 taxi simulation game with pick and drop missions from hotel to football stadium.<br/>🚖 Luxury HQ taxi driving school levels based on parking &amp; driving.<br/>🚖 Learn Russian traffic signs and rules while having Russian taxi driving fun.<br/>🚖 Smooth intuitive controls &amp; realistic taxi cab physics.<br/>🚖 Ride different taxi models in 3D fantasy city in taxi games 2018.<br/>🚖 HD graphics &amp; New gen HQ taxi gameplay.</p>\n<p>Start your taxi driving career during football world cup 2018 on Russian roads and become a taxi driver. Race your yellow cab vehicle through the big Moscow city traffic; pick up passengers from nearest hotels and driving them safely to football stadium in limited time with Taxi Service: Football World Cup 2018. Steer your taxi through narrow streets, dodging traffic, and racing against time to become a fastest taxi driver. This football world cup 2018 taxi simulator game has many pick and drop missions around the town with elevated taxi fun.</p>", "metacritic": null, "released": "2018-06-20", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/aaa/aaa62d44663aa674e8b2d6529afbfc04.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 74, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Tap2Ride"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}