{"id": 1950, "slug": "rpg-darkgate-kemco", "name": "RPG DarkGate - KEMCO", "name_original": "RPG DarkGate - KEMCO", "description": "Enjoy intense battles and leveling up a multitude of jobs!<br/>Presenting Dark Gate, a full-blown fantasy RPG!<br/><br/>A long time ago, a battle ensued between God and the Demon Lord.<br/>To resist the powerful Demon Lord, God created a human.<br/>Sacrificing his own body to seal the Demon Lord, God assigned the role of guarding that seal to the chosen one.<br/><br/>Through an eternity of time, the seal has weakened, and a window to the underworld, \"Dark Gates\" have appeared in multiple locations. <br/>Monsters start to invade the land.<br/><br/>To break free from the doomed fate of man, they will rise and destroy every last \"Dark Gate\"…<br/><br/>** Overview of Dark Gate<br/>This game is a fantasy RPG. You must destroy the rifts where the monsters are coming from, each called a \"Dark Gate.\"<br/>The hero Leo joins his ally Sandy on a mission to destroy the \"Dark Gates\".<br/>A world full of adventures and powerful foes unravels during your assignment of destroying the Dark Gates.<br/><br/>FEATURES<br/>‐ Unfold a fast-paced, automated, and intense battle system<br/>‐ Different endings based on your choices in game<br/>‐ Over 70 different job classes<br/>‐ A full roster of characters. The story develops based on who is in your party.<br/><br/><br/>This game is an RPG you can enjoy with an intense battle system.<br/>There are many jobs and skills to choose from as you level up characters. Choosing the right strategy becomes the key to defeating monsters.<br/><br/>With multiple endings, you can enjoy replaying this RPG again and again!<br/><br/>*This game features some in-app-purchase content. While in-app-purchase content requires additional fees, it is not necessary for finishing the game.<br/>*The actual price might differ depending on the region.", "metacritic": null, "released": "2011-11-28", "tba": false, "updated": "2019-08-02T03:28:04", "background_image": "https://media.rawg.io/media/screenshots/6c1/6c11cacf5b8f70733629a37db00d114a.jpeg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 259, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Kotobuki Solution Co"], "genres": ["Adventure", "RPG"], "publishers": ["Kotobuki Solution Co"], "esrb_rating": null}