{"id": 195160, "slug": "rykert-hungers-the-shoemaker-requiem", "name": "Rykert Hungers: The Shoemaker Requiem", "name_original": "Rykert Hungers: The Shoemaker Requiem", "description": "<p><em>Just when they thought they we're safe... he hungers once more. Only one man from the west can take on the insatiable hunger of the eastern menace.</em></p><p>For Giant Rom 4. </p><p>Grab the music here if you want: https://jthomeslice.bandcamp.com/track/revengenceful-rykert-hungers-theme</p><p>I decided that I would try to incorporate both themes that got selected. I had to rack my brain to get something for One Big Chomp and East vs. West. One Big Chomp ended up with me thinking \"well Dan loves shoving Taco Bell down his food hole.\" East vs. West was much more obvious and that ended up with Brad fighting a hoard of hungry Dans by shooting many loaded grillers (or whatever that thing is called) into their dumb faces. From the Quake rocket launcher, of course.<br/></p><p>Brad's sprite couldn't have been more obvious. I feel like Dan's are pretty obvious too. I really like the LA Noire one. And Alex is there because I found that picture and it made me laugh again. Each Dan enemy has unique behaviors, but if I had more time and knowledge I'd make them even cooler. I also tried sound effects but couldn't figure out how to make them not annoying. The music was so fun to make. I looooove synthwave, darksynth, all that stuff, so I thought I'd try making a hard, driving jam of my own. It was the quickest I've ever made a song and I can't wait to do more.</p><p>This was the first full-ish game I've ever put out there. Construct 2 had a really nice top-down shooter template that I ended up modifying a lot. It was very intuitive as someone who has some coding experience but can't remember any of it most of the time. If I was gonna get more serious I'd make the UI not look like butt, add some more enemies, tune the gameplay a LOT more, add a scoreboard that saves, and all sorts of stuff. This was a great time! Can't wait to see what everyone else does.</p>", "metacritic": null, "released": "2017-02-04", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/e15/e152f84c4d1013f18bb6c2bb85646f96.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 4, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["JTHomeslice"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}