{"id": 19516, "slug": "a-druids-duel", "name": "A Druid's Duel", "name_original": "A Druid's Duel", "description": "Welcome to the Realm of Six Seasons, where the predictable cycle of nature's seasons has turned constantly since time began. But now, something is wrong.<br/><br/>A bright Summer's day ends in a snowy Winter's eve. The next morning brings a burst of colorful Autumn leaves and even that is followed by a surprising deluge of Springtime rains. Something (or someone) is tampering with the precious Seasons, making a complete mess of the Realm.<br/><br/>The Druids of the Esoteric Orders have long fostered this fertile landscape and tended to this delicate mystical balance. And it is up to Warren, a young druid fresh from his Esoteric Training, to discover what is causing this disastrous mixing of Seasons.<br/><br/><br/><br/>With a game board that changes based on players’ actions, and units that each have powerful animal abilities, you’ll need to stay focused and never let your guard down.<br/><br/><br/><br/>Whether it’s the single player story told across more than 130 levels, local or online multiplayer for up to 4 players, there’s enough variety for new and experienced players.<br/><br/><br/><br/>The professionally composed soundtrack and recorded music brings the Six Seasons beautifully to life.<br/><br/><br/><br/>Nothing is random in A Druid's Duel. A simple set of rules governs the board, allowing the game to be learned quickly, with various difficulty settings to match your current ability. But at its highest difficulty expect to spend months mastering the nuances that manipulating the board can create.", "metacritic": 70, "released": "2015-02-25", "tba": false, "updated": "2019-08-28T22:09:09", "background_image": "https://media.rawg.io/media/screenshots/50b/50b7e2b62c83bcf64adf4a5cf2aa9ec1.jpg", "website": "http://www.druidsduel.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 86, "toplay": 1}, "playtime": 4, "achievements_count": 49, "ratings_count": 1, "suggestions_count": 380, "game_series_count": 0, "reviews_count": 1, "platforms": ["Linux", "macOS", "PC"], "developers": ["Thoughtshelter Games"], "genres": ["Strategy", "Indie"], "publishers": ["Surprise Attack"], "esrb_rating": null}