{"id": 19529, "slug": "paper-sorcerer", "name": "Paper Sorcerer", "name_original": "Paper Sorcerer", "description": "Paper Sorcerer is a stylish single player turn based RPG focused on strategy, party-building, and environmental puzzles. Fight with the skills and spells you've learned in a battle system that emphasizes strategy over grinding. Assemble a party of monsters and dark creatures to fight alongside you. Explore and solve environmental puzzles to unlock secret paths and find extra loot! A double-sided adventure, an RPG with adventure game elements.Initial Steam release is for PC, Mac and Linux are in the works. <br/>If you'd like to play it on Mac or Linux right away, you can pick it up on the website http://ultrarunaway.com, and we'll send you a Steam key later.<br/><br/><br/><strong>Save files from the demo transfer to the full version!</strong><br/><br/>A powerful sorcerer is on the cusp of dominating the land. A group of heroes bands together and seals him away inside a magical tome. Now as the sorcerer you must escape from this ancient prison and find a way to regain your magical powers using your wits and an array of summonable creatures to aid you. There may be more powerful forces at work as you navigate the dungeons and fight the heroes sent to subdue you...<br/><br/>Key Features<br/><ul><li>Play as a renegade sorcerer as he struggles to escape the book prison and regain his powers.<br/></li><li>Escape a magical prison filled with heroes hunting you down at every turn.<br/></li><li>Leave behind mana and to-hit rolls for an exciting new battle system that emphasizes strategy and tactics over grinding.<br/></li><li>Strategically manage an energy pool to unleash devastating special attacks in battle.<br/></li><li>Assemble a party of fiendish creatures to join you as allies in battle.<br/></li><li>Numerous different creatures and fiends to unlock, further customizing your party; including a healer Witch, a trickster Imp, assassin Troll, and a berserker Minotaur.<br/></li><li>Discover fiendish puzzles and solve them with a combinations of spells, items, and your wits.<br/></li><li>Hand-drawn high-resolution sprites<br/></li><li>All-inclusive game, promise to never make you pay for DLC content.</li></ul>", "metacritic": 73, "released": "2013-11-02", "tba": false, "updated": "2019-09-17T07:40:35", "background_image": "https://media.rawg.io/media/screenshots/1ba/1bad88998619c2f82379a09a27293285.jpg", "website": "http://www.ultrarunaway.com/", "rating": 3.21, "rating_top": 4, "added_by_status": {"yet": 19, "owned": 331, "beaten": 3, "toplay": 3, "dropped": 12, "playing": 1}, "playtime": 2, "achievements_count": 39, "ratings_count": 14, "suggestions_count": 246, "game_series_count": 0, "reviews_count": 14, "platforms": ["PC", "macOS"], "developers": ["Ultra Runaway Games", "Jesse Gallagher"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["Ultra Runaway Games"], "esrb_rating": null}