{"id": 19536, "slug": "state-of-decay", "name": "State of Decay", "name_original": "State of Decay", "description": "<p>State of Decay offers you to become a zombie apocalypse survivor. You assume the role of a local community leader in a fictional US region called Trumbull Valley. In the Storyline mode, you begin the game as Marcus Campbell. However, though you only control one character at a time, AI-controlled allies will aid you on your missions, and if the main character is killed, you will switch to another hero from your community. Each character has a set of skills that can be improved by repetitive actions, such as fighting.<br />\nThe main goal is to help your people survive by building and protecting a safe haven. You can improve your base with multiple buildings, such as kitchens and medical bays. The game is strongly focused on resource management. There are no shops in the post-apocalyptic world, and most resources have to be scavenged. However, there are NPCs and other survivor communities you can interact with. You can trade with them and even recruit them to join your community as new members. There&#39;s also a variety of zombies that will attack your characters. The game offers you more than 100 weapons, both melee and ranged. All weapons have limited durability and will break down eventually.</p>", "metacritic": 79, "released": "2013-06-06", "tba": false, "updated": "2024-03-13T20:33:01", "background_image": "https://media.rawg.io/media/games/a34/a34a8c9e1798ef82ee3734719d3c60d3.jpg", "website": "http://www.undeadlabs.com", "rating": 3.6, "rating_top": 4, "added_by_status": {"yet": 64, "owned": 1676, "beaten": 219, "toplay": 51, "dropped": 233, "playing": 14}, "playtime": 5, "achievements_count": 92, "ratings_count": 405, "suggestions_count": 491, "game_series_count": 2, "reviews_count": 408, "platforms": ["Xbox 360", "PC"], "developers": ["Undead Labs"], "genres": ["Action", "RPG", "Simulation"], "publishers": ["Microsoft Studios"], "esrb_rating": "Mature"}