{"id": 195360, "slug": "blipo", "name": "blipo", "name_original": "blipo", "description": "<p>blipo is a simplistic 2D Puzzle game. The aim is to move the player from the starting point to the finish tile. I have never made a puzzle game before. This was something completely new for me and I thought the freestyle week would be a great opportunity to just go for it.</p><p>The game's forte is that its rules are extremely clear. You have:</p> <ul> <li> 1 player starts on bottom left tile</li><li> 1 goal win condition, always top rightmost tile</li><li> hazards lose condition met if they are on same tile as player</li><li> neutrals can be used to traverse the level, not harmful</li></ul> <p> </p><p>The entire game revolves around solving small to medium-sized puzzles in as few turns as possible. I wanted to make sure that the player was having fun while also maintaining a challenge for them so I used extremely short iteration cycles while trying to make puzzles deep enough that they could not be solved through basic brute-forcing.</p><p> </p><p>In his book \"A Theory of Fun for Game Design\", Raph Koster writes about something he calls \"groking\". This is where a player intrinsically absorbs a game's mechanics in order to gain the ability to understand and replicate them. His theory trudges along the lines of \"if you're learning, you're having fun\" and that once a game has stopped teaching you, it becomes stale.</p><p> </p><p>This, as well as concepts of \"flow\" inspired me a lot and I always wanted to make sure that my puzzles were filled to the brim with grok and consistently immersed the player completely.</p><p>Furthermore, I desired to keep the game very pure, that's why I used primitive shapes instead of sprites or models. I didn't want any distractions during game play and I needed to make sure that even the shape of something would be meaningful in identifying it (see Bouba-Kiki study)</p><p> </p><p>Designing a solid game: \"What does the player feel when they see this? What do they feel when...\"</p><p>I believe in using an emotional approach rather than a numerical one for game design.</p><p><strong>Technology Used:</strong></p><p>Game made entirely in Gamemaker Studio</p><p>All music was composed and recorded in Sunvox</p><p> All Sound Effects were made in SFXR</p><p> Game Icon and Banners were designed in GIMP</p>", "metacritic": null, "released": "2017-01-22", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/f13/f13bd694d751e96cdcaed06943d05911.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 14, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["NeoTalon"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}