{"id": 195346, "slug": "oracle-of-megalopolis", "name": "Oracle of Megalopolis", "name_original": "Oracle of Megalopolis", "description": "<p>The Oracle of Megalopolis is about an alien race living in a megastructure built around it's host star Tabby, and it's inevitable demise from the materialization of a wormhole.<br/>For millions of years an overpopulated race of beings in the Tabby star system have avoided the extinction of their species on several occasions, first their home planet of Damar became overpopulated and it's resources stripped until they had the technology to mine the vast resources from their asteroid belt, but then their planet eventually warmed as it's star grew older and they had to colonize the next further out planet Sethrol, but life was miserable there due to vicious creatures and deadly bacteria and viruses which almost wiped them out again. So after that they returned to the asteroid belt and instead of mining and removing resources they linked all the asteroids together and formed an enclosed megastructure encircling their star and called their new home Megalopolis. They controlled the temperature by adjusted solar venting voids in the megastructure and collected all the power they needed from great arrays of star facing solar panels and sustained the lives of 420 quadrillion citizens. All was well. Until one day...</p>\n<p>Controlls:</p>\n<p>WINDOWS KEYBOARD:<br/>Arrow keys: Move player/highlight menu options.<br/>Z key: Action/select menu item.<br/>X key: Talk/messages.<br/>C key: Pause/unpause, Open/close menu.<br/>Left mouse/mouse wheel: Manipulate some objects.<br/>ENTER key: Start game, take snapshot for log book.<br/>ESC key: Quit the game.</p>\n<p>WINDOWS GAMEPAD (xbox 360 style, button layout may be different if using other game pads)<br/>Dpad, right stick: Move player/highlight menu options.<br/>A button: Action/select menu item.<br/>X button: Talk/messages.<br/>Y button: Pause/unpause, Open/close menu.<br/>Left stick: Manipulate some objects.<br/>B button: Start game, take snapshot for log book.<br/>Use ESC key on keyboard to quit the game.</p>\n<p>ANDROID<br/>Dpad: Move player/highlight menu options.<br/>A button: Action/select menu item.<br/>X button: Talk/messages.<br/>Y button: Pause/unpause, Open/close menu.<br/>Single tap/double tap/tap-n-drag: Manipulate some objects.<br/>B button: Start game, take snapshot for log book.<br/>Use device's back button to quit the game.</p>\n<p>MENU</p>\n<p>Save button- There are 3 save slots, press the up or down arrows to change which slot you want to save to.<br/>Load button- There are 3 load slots, press the up or down arrows to change which slot you want to load from.<br/>Info button- Shows game info, press ENTER(windows) or B(android or gamepad) to show the log book, press up or down to turn the book's pages.<br/>Quit button- Quits the game WITHOUT saving.</p>\n<p>GAMEPLAY</p>\n<p>In this game you must help the citizens of Megalopolis escape from their apocalypse brought on by the materialization of a wormhole that starts devouring their host star. There are several missions for you to complete, some of which involve having to use math or remember coordinates that scientists give you in the meeting scene on planet Frozania. The first mission is independent on the other missions, but the next 3 depend on weather you complete the missions successfully,  and the last mission can only be reached if you completed the previous mission successfully. After each mission the game will automatically save a screenshot to the log book, you can also save screenshots to it whenever you want by pressing ENTER(windows) or B(game pad, android) and view the log book via the menu. There are 8 different ending scenarios  that depend on how well you completed all of the missions.</p>\n<p>NOTE ON ANDROID: Do not take screenshots while the game is saving log book screenshot entries (when the game screen changes size for a couple seconds it is saving a screenshot to the log book) or the game will crash, no fix available for this because you cannot take 2 screenshots at once.<br/></p>\n<p>Credits:<br/></p>\n<p>All music composed by Eric Matyas @ http:soundimage.org</p>", "metacritic": null, "released": "2017-10-16", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/fa0/fa049f663ed5ef44ce61288b6bd51e60.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 145, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Android"], "developers": ["Roadhammer Gaming"], "genres": ["Action", "Strategy"], "publishers": [], "esrb_rating": null}