{"id": 19546, "slug": "fester-mudd-curse-of-the-gold-episode-1-2", "name": "Fester Mudd: Curse of the Gold - Episode 1", "name_original": "Fester Mudd: Curse of the Gold - Episode 1", "description": "Set in Wild West, FESTER MUDD: CURSE OF THE GOLD is a three-part comic saga of exploration, reunion, and redemption...and a love letter to the classic adventure games of the 90s!<br/>\n<br/>\r\nRoused from a life of sloth to reunite with his long-lost brother in search of unimaginable riches, reluctant hero Fester Mudd somehow manages to be intrepid but cowardly, ambitious yet lazy, dimwitted but brilliant.<br/>\n<br/>\r\nIn Episode 1, Fester hits the trail to join his brother, Bud, in the downtrodden town of Loamsmouth. But when Bud is found to have mysteriously vanished, Fester realizes that the journey will be far longer and more treacherous than he bargained for...and he must enlist the aid of an experienced gunslinger to help him make his way through Indian territory to track down both his missing brother and the gold that awaits them both!<br/>\n<br/>\r\nBut gunslingers don't come cheap...and Fester must find a way to convince him to join him on the perilous quest.<br/>\n<br/>\r\nThis Episode sees Fester exploring Loamsmouth and surrounding territories. Along the way, he'll meet and deal with an assortment of Old West roughnecks, flim-flammers, and other larger-than-life characters...and give adventure game fans a huge blast from the past!<br/>\n<br/>\r\nIMPORTANT: The development of Fester Mudd games has been cancelled, and this episode is the only one available. Please note that it was designed to be part of a trilogy, and you will not experience the full story as the other two episodes won’t become available. The developer sincerely wishes to thank everyone who played and supported the journey of Fester Mudd.", "metacritic": 76, "released": "2013-11-04", "tba": false, "updated": "2022-09-06T09:06:13", "background_image": "https://media.rawg.io/media/screenshots/71b/71b06596f7e549756f1f752b93e902e9_goFpoXY.jpeg", "website": "https://www.replaygamesinc.com/store/index/products/item/fester-mudd-curse-of-the-gold", "rating": 3.17, "rating_top": 4, "added_by_status": {"yet": 8, "owned": 251, "beaten": 4, "dropped": 2}, "playtime": 1, "achievements_count": 15, "ratings_count": 6, "suggestions_count": 386, "game_series_count": 0, "reviews_count": 6, "platforms": ["PC", "Linux", "macOS", "iOS"], "developers": ["Replay Games"], "genres": ["Adventure", "Puzzle"], "publishers": ["Replay Games"], "esrb_rating": null}