{"id": 19541, "slug": "sherlock-holmes-the-awakened-remastered-edition", "name": "Sherlock Holmes: The Awakened - Remastered Edition", "name_original": "Sherlock Holmes: The Awakened - Remastered Edition", "description": "<p>The Sherlock Holmes series returns with this updated version of The Awakened, which brings a whole new dimension to the original title developed by Frogwares.<br />\nKeeping with the traditional Point &amp; Click gameplay style of the original adventure games, The Awakened has been totally rethought, offering players a new third-person view while keeping the original first-person view available also.<br />\nThe game puts the player into an investigation of the myth of Cthulhu - as imagined by author H.P. Lovecraft.  Sherlock Holmes, assisted by the loyal Doctor Watson, investigates strange disappearances which seem related to the activity of a secret sect. The adventure begins in London, in the renowned Baker Street, taking us to investigate a disturbing psychiatric hospital near Bale, Switzerland, on to Louisiana and finally to Scotland.<br />\nKey Features<br />\n2 points-of-view available at all times: new gameplay in 3rd person, giving a new dimension to the original game, or classic first- person point-of-view.<br />\nAn original confrontation between the universe of Sherlock Holmes and the myth of Cthulhu - a fight between the rational and the supernatural.<br />\nRich graphics, biting dialogue, disturbing characters and an excellent sound track create incredible turn of the century atmospheres.<br />\nPlay as the famous detective Sherlock Holmes and his loyal friend Doctor Watson.<br />\nA new help system that shows the interactions available (objects and actions).<br />\nInteract with more than 60 characters in 5 disturbing universes.<br />\nUse and combine more than 50 objects, and discover hundreds of clues and documents to carry out the investigation to its final outcome.</p>", "metacritic": 72, "released": "2008-10-23", "tba": false, "updated": "2023-03-18T10:50:05", "background_image": "https://media.rawg.io/media/games/4e5/4e54b9a254756febcea3d48d820b7818.jpg", "website": "http://frogwares.com/", "rating": 3.58, "rating_top": 4, "added_by_status": {"yet": 39, "owned": 572, "beaten": 29, "toplay": 15, "dropped": 3}, "playtime": 3, "achievements_count": 0, "ratings_count": 33, "suggestions_count": 469, "game_series_count": 7, "reviews_count": 33, "platforms": ["PC"], "developers": ["Frogwares"], "genres": ["Adventure"], "publishers": ["Frogwares"], "esrb_rating": null}