{"id": 1955, "slug": "clumsy-ninja", "name": "Clumsy Ninja", "name_original": "Clumsy Ninja", "description": "<p>Meet Clumsy Ninja, the most hapless ninja ever to grace a touchscreen!<br />\nTrain him, throw him, tickle him, and even tie balloons to him. Everything you do will make Clumsy Ninja more skillful, and help him find his missing friend, Kira.<br />\nClumsy Ninja is the next generation of interactive characters! He can sense, feel, move, and react uniquely every time. Prepare to be amazed…oh, and please take good care of him!<br />\nBELT UP<br />\nTrain your ninja to learn new tricks and super-special Ninja Moves! Impress his sensei and earn new Ninja Belts on your way to find Kira, or just have fun with over 70 unique interactive items, including trampolines, punch bags, ball guns, a chicken, and… a squirrel!<br />\nADVENTURE TIME<br />\nYou and your ninja will travel to new locations, play new games, meet new characters, complete quests, and unlock fun new items to play with. How many will you discover?<br />\nCUSTOMIZE &amp; SHARE<br />\nCustomize Clumsy Ninja’s suits, belts, and headbands to match your style. Take photos of your ninja’s craziest stunts, and share the fun with friends instantly. Keep your eyes peeled: there are many surprises waiting for you!<br />\nUNFORGETTABLE MOMENTS<br />\nClumsy Ninja is a living virtual friend who thinks and acts with real intelligence - and a lot of clumsiness! You’ll experience unique moments with your ninja and his companions every time you play!<br />\nFIRST ON TOUCH DEVICES!<br />\nClumsy Ninja is the first game on touch devices to ever use the EUPHORIA simulation technology – producing the most believable character you&#39;ve ever seen.</p>", "metacritic": 78, "released": "2013-11-21", "tba": false, "updated": "2023-11-01T09:46:31", "background_image": "https://media.rawg.io/media/screenshots/5ce/5cec9a2198ac13695f10822e3f85200a.jpg", "website": "http://www.naturalmotiongames.com/", "rating": 3.83, "rating_top": 4, "added_by_status": {"owned": 3, "beaten": 4, "toplay": 1, "dropped": 2, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 6, "suggestions_count": 210, "game_series_count": 0, "reviews_count": 6, "platforms": ["iOS", "Android"], "developers": ["NaturalMotion", "NaturalMotionGames"], "genres": ["Adventure", "Family"], "publishers": ["NaturalMotion Games"], "esrb_rating": null}