{"id": 195664, "slug": "people-against-fascists", "name": "People Against Fascists", "name_original": "People Against Fascists", "description": "<p><strong>NOTE: The controller configuration is a little wacky - make sure you configure your controls before playing (in the options menu).</strong><br/></p><p>People Against Fascist is a game for 2-4 players created for #resistjam.</p><p>In the game, one or more players play the role of fascists, and one or more play the role of \"people\" amongst the general population working to bring down the fascists.</p><p>There is an \"area of vision\" around each fascist - and the only true representation of the world is visible inside that area. Outside of that area, all people look the same - the buildings always look as if the fascists have control - and it's impossible to see what is actually happening.</p><p>The people must use this to their advantage as they move around the map liberating buildings. To do this - they should stand in front of the building and tap the \"Sabotage/Repair\" button. Once they have a sufficient level of control a window smashing sound will trigger indicating that the building has changed control. The fascists will not know which building it is until they go look. If the people control 6 of the 8 buildings at any point, they win.</p><p>The fascists must work to stop this happening. The major tool they have at their disposal is imprisonment. Fascist can walk up to anyone and press the \"Arrest/Escape\" button to pick them up. They can then drop them in the prison (by pressing the \"Cancel\" button) to imprison them. While holding, if the person struggles (by tapping \"Arrest/Escape\") it's possible they will break free - tap \"Arrest/Escape\" to avoid this.</p><p>People in the prison can not act until released from prison (either by the prison being liberated or by the fascists carrying them out). Once all \"people\" are imprisoned - or if the timer elapses without a \"people\" victory - fascists win.</p><p>The primary goal of the fascists is to identify the rebels amongst the population - the primary goal of the people is to liberate enough of the city to take control. Rebels should aim to act in such a way that the fascist can not identify them.</p><p><strong>Credits</strong><br/></p><p>Code by Citizen Of Melee, Art by Jivechameleon, Music and Sound by Ingo Duarte.</p><p><strong>Future Changes</strong><br/></p><p>There are a number of things which did not get implemented due to time limits during a gamejam. These include different appearances for people, more actions for NPCs, additional interactive buildings (such as deportation via the airport), a way for fascists to retake buildings, and powerups both for fascists and people. These may be revisited in a future game.</p>", "metacritic": null, "released": "2017-03-12", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/9eb/9eb4af7187ccde4cafdd909b0ac91d0f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 36, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Citizen Of Mêlée"], "genres": ["Action"], "publishers": [], "esrb_rating": null}