{"id": 195697, "slug": "lion-hunting-in-jungle", "name": "Lion Hunting in Jungle", "name_original": "Lion Hunting in Jungle", "description": "<p><strong>Lion Hunting in Jungle </strong>is best for those who look forward to experiencing an ultimate adventure of hunting lions in the forests. This shooting game brings to you forest environment with amazing 3D Graphics to keep you engaged throughout the game play.</p>\n<p>The sound effects in the background makes it more thrilling for the user and ensures that the he/she enjoys lion hunting and play consistently to achieve higher levels. In order to score higher and cross each level to reach the higher ones, hunt as many lions as you can. Stay active, alert, be accurate in aiming and shoot on the right target.</p>\n<p>Stay vigilant from the lion’s attack and avoid targeting other animals i.e. bears to avoid getting disqualified from the game. This is one the best and unique lion hunting games in which user will find new features and eye catching graphics.</p>\n<p><strong>Lion Hunting in Jungle Features:</strong><br/>-  3D Forest Environment<br/>-  Realistic Lion Model<br/>-  Different animals like Bear, Zebra, Rhino and Deer.<br/>-  Sniper Shooting<br/>-  Camera button to Zoom in and out.<br/>-  Button controls for rotation and movement<br/>-  Safari Adventure<br/>-  Available on Play store</p>\n<p>Are you ready to adventure with us and hunt lions in the jungle? Download to be expert hunter and shooter enjoy responsive gameplay!</p>\n<p>Install <strong>Lion Hunting in Jungle</strong> game for free and do not forgot to give your feedback at support@switchsolutions.com.pk and if you need any help we will get back to you with guidelines according to your query.</p>", "metacritic": null, "released": "2017-11-28", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/b4c/b4c5889b24267e22edbde67e4b2b58f4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 65, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Switch Play"], "genres": ["Shooter", "Adventure"], "publishers": [], "esrb_rating": null}