{"id": 19566, "slug": "children-of-the-nile-enhanced-edition", "name": "Children of the Nile: Enhanced Edition", "name_original": "Children of the Nile: Enhanced Edition", "description": "<p>Children of the Nile™ is a unique gem of a city-building game, unparalleled in both grandeur and attention to detail.<br/><br/>As Pharaoh you will guide your people through thousands of years of history: from simple hunter-gatherers to the creation of an immortal civilization. Guide your people well and you will build breathtaking pyramids, explore the ancient world and wage war against your enemies.<br/><br/>Every inhabitant of your city is a fully developed, living person – part of an individual family and household with wants and needs. From priests to entertainers, scribes to laborers, even the royal family… everyone will need to eat and that’s just the beginning. Every block of stone that is hauled to your pyramid will be pulled by people who pray to the gods in temples of your choosing. Under your supervision, local economies will thrive as goods from reed baskets to gold jewelry will be created, purchased and enjoyed by the inhabitants of your city.<br/><br/>To achieve immortality a Pharaoh must look outside his city’s borders and make an impact on the world. Explore and open trade with foreign neighbors and you will have reason to build commemorative wonders that will tell the tale of your dynasty for all time. As your prestige rises so too will your ability to draw more people to your ambitious endeavors and build cities that are truly epic.<br/><br/>How will your dynasty be remembered?</p>", "metacritic": 75, "released": "2008-07-08", "tba": false, "updated": "2023-01-08T04:07:41", "background_image": "https://media.rawg.io/media/screenshots/3ce/3ceb24ed7fa45b6775249814afeebb43.jpg", "website": "http://www.immortalcities.com/cotn/", "rating": 3.67, "rating_top": 4, "added_by_status": {"yet": 7, "owned": 156, "beaten": 2, "toplay": 1, "dropped": 6}, "playtime": 2, "achievements_count": 16, "ratings_count": 9, "suggestions_count": 481, "game_series_count": 0, "reviews_count": 9, "platforms": ["PC"], "developers": ["Tilted Mill Entertainment"], "genres": ["Strategy", "Simulation"], "publishers": ["Tilted Mill Entertainment"], "esrb_rating": null}