{"id": 19570, "slug": "hostile-waters-antaeus-rising", "name": "Hostile Waters: Antaeus Rising", "name_original": "Hostile Waters: Antaeus Rising", "description": "<p>Hostile Waters: Antaeus Rising is a real-time strategy game developed by Rage Games Limited. It is often classified as a hybrid of both a simulation game and a real-time strategy one.</p>\n<h3>Plot</h3>\n<p>In 2012 the last war on Earth took place. After the people defeated the corrupt government leaders, the world was rebuilt into a utopia in just twenty years. People started using the nanotechnological assemblers, which can create anything out of energy and useless objects. Even military equipment can be created.</p>\n<p>Many cities suffer from missile attacks from an island in the southern Pacific Ocean. A spec-ops team is sent out to investigate. You are a part of it.</p>\n<h3>Gameplay</h3>\n<p>Each mission of the game takes place near the enemy island, which is protected by all kinds of anti-air defenses. All the player&#39;s vehicles are created using the assemblers aboard a military ship and are transferred to them using a boat. The vehicles are built up with the trash the player collects on the island.</p>\n<p>The players have three ways of controlling their units. The first way is based upon the fact that the game allows for full control of a unit with a first-person camera and simulation-style controls. The downside of this is the need to control multiple units at one time.</p>\n<p>The second way resembles the typical real-time strategy games. The players control their units by issuing orders on a schematic map. The third way is practically the same, yet it allows for much more complex orders.</p>", "metacritic": 80, "released": "2001-06-13", "tba": false, "updated": "2023-12-18T17:52:15", "background_image": "https://media.rawg.io/media/screenshots/9f4/9f4cc216211ab6be61d8647383354e45.jpg", "website": "http://kiss-ltd.co.uk/", "rating": 2.09, "rating_top": 1, "added_by_status": {"yet": 44, "owned": 1147, "beaten": 9, "toplay": 3, "dropped": 7, "playing": 1}, "playtime": 4, "achievements_count": 0, "ratings_count": 45, "suggestions_count": 409, "game_series_count": 0, "reviews_count": 45, "platforms": ["PC"], "developers": ["Rage Software"], "genres": ["Strategy"], "publishers": ["Kiss", "Funbox Media", "Blue Moon Red Owl"], "esrb_rating": "Mature"}