{"id": 195700, "slug": "combustibawls", "name": "Combustibawls", "name_original": "Combustibawls", "description": "<p>I started off taking on Mini Game Jams based on single word suggestions from Social media sites. The first suggestion was \"Combustion\". So Combustibawls was born, a game where you play chicken with huge fireballs! The idea of the game is to go from left-to-right whilst avoiding fireballs that will turn you into dust if you get hit.</p><p>You begin the game standing in a blue, safe zone, the fireballs can't get you there. The goal of the game is to get to the right hand, green, side of the screeb. You receive a single point for each time you reach to the far right side. Each time you reach the to the right side, there's another fireball, and you need to it again. Every-so-often a pocket watch power up will appear that will allow you to stop the fireballs for a short time. Try to exploit this free time to get more points in.</p><p>I made the game look a bit like a hybrid of simple DOS game and a BBC Micro game, though most of that was bound to just laziness! You always need a minimum viable product right? I can get extra fancy graphics and additional gameplay stuff later! As for additional stuff to this game, I'll be slowly adding more things to the game at later dates.</p><p>The game can be played using a Keyboard (Arrow keys, space to start, return to pause) or a controller.</p><p>Credits goes to @vipp1990 for the suggestion of combustion on Twitter.</p><p>Be sure to keep your eyes peeled on my Twitter page for when I host my next personal GameJam where your single word suggestion might turn into a game!</p>", "metacritic": null, "released": "2015-08-07", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/ff2/ff216a6dd431d986720312ea823aec91.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 32, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["GreatBitBlog"], "genres": ["Action"], "publishers": [], "esrb_rating": null}