{"id": 195897, "slug": "normans-land", "name": "Norman's Land", "name_original": "Norman's Land", "description": "<p>Your ship has been capsized and you are stranded on a deserted Island.</p><p>Is there any hope of rescue?</p><p>No.<br/></p><p>The goal is to survive as long as possible.<br/> </p><p>space = jump<br/> f = kick<br/> g = punch<br/> r = roll(while crouching puts out fire)/rotate(while standing turns around)<br/> t = take(grab items off the ground)/throw(moving)/drop(standing still)<br/>u = use(cut with the knife while crouching)/eat<br/> p = pause<br/> w = walk(hold to walk)<br/> left = left<br/> right = right<br/> down = crouch</p>One life will be lost if you get knocked over; by tripping, running into something, or having something run into you.<p>If you catch on fire you will lose life until the fire is put out.</p><p>If your head is below water you will gradually lose life.<br/></p><p>You will lose one life at noon/midnight and at the change of day/night and night/day.<br/></p><p>Throw the knife at the tree to get sticks and knock down the coconut.</p><p>Once the coconut is knocked down a new coconut will grow the next morning.</p><p>Cut the coconut in half by crouching next to it and using the knife.</p><p>Pick up and use the coconut halves to restore one life.<br/></p><p>You can get up to three sticks at one time.<br/></p><p>Stack two or more sticks next to a rock and strike the rock with the knife to create sparks. If the sparks hit the sticks with at least one stick in a leaning position it will catch on fire. <br/></p><p>Throw the knife at the crab or the bird to get meat.</p><p>Don't eat the meat raw. Put the meat on the fire to cook it and be careful not to burn it. Get it on the fire quickly before it spoils. </p><p>While it is raining you will lose one health for every ten raindrops you are hit by.</p><p>Enjoy meeting all the dangerous and interesting creatures in Norman's Land!<br/></p>", "metacritic": null, "released": "2017-02-27", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/f42/f421d57a976809e77312900350b83c4d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 24, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["who_pizza"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}