{"id": 19598, "slug": "guild-wars-nightfallsup-sup", "name": "Guild Wars Nightfall", "name_original": "Guild Wars Nightfall", "description": "<p>Join millions of players worldwide in this third campaign in the award-winning Guild Wars® universe. Create your own band of Heroes and lead them against a mad ruler and an outcast god who desire to bring darkness to Elona. When night falls you must fight — but you won&#39;t fight alone.<br />\nExplore opulent cities, savage coasts, ancient monuments, and poisonous deserts as you determine the fate of Elona. Guild Wars Nightfall™ is the third stand-alone release from developer ArenaNet®, and features a new land, new mechanics, and new professions.<br />\nBattle against the armies of darkness in the company of customizable Heroes that level up with you, follow your instructions in combat, and use armor, weapons, and skills of your choice.<br />\nBeguile your enemies with the flashing scythe of the new Dervish profession, or empower the people of Elona with the shouts and chants of the god-touched Paragon.<br />\nFind your allies quickly and build the ultimate party using the new cross-district Party Search system.<br />\nDiscover new ways to throw down your enemies with more than 350 new skills.<br />\nNo subscription fees  — Buy the game and play online with no monthly fees.<em><br />\n</em> Requires product purchase and access to Internet. Player is responsible for all applicable Internet fees.</p>", "metacritic": 84, "released": "2009-04-22", "tba": false, "updated": "2024-03-09T11:03:28", "background_image": "https://media.rawg.io/media/games/f4a/f4afd2501175b05d70e3fab32a3e99ee.jpg", "website": "http://www.guildwars.com", "rating": 4.4, "rating_top": 4, "added_by_status": {"yet": 2, "owned": 8, "beaten": 14, "toplay": 2, "dropped": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 10, "suggestions_count": 565, "game_series_count": 0, "reviews_count": 10, "platforms": ["PC"], "developers": ["ArenaNet", "ArenaNet®"], "genres": ["Action", "RPG", "Massively Multiplayer"], "publishers": ["NCsoft"], "esrb_rating": null}