{"id": 19596, "slug": "heroes-of-annihilated-empires", "name": "Heroes of Annihilated Empires", "name_original": "Heroes of Annihilated Empires", "description": "<p>Check out the high-resolution trailer and see what the game is all about.</p>\n<p>Heroes of Annihilated Empires - is a fantasy-based trilogy game in the genre of RTS vs RPG for PC. A new proprietary 3D-engine is used to power the game. Episode one is set on Atlans island, the historical homeland of elves. The world of the game is living and huge, full of magic, mythical creatures, heroes and powerful forces involved in a large-scale conflict dating back to the past. The gameplay enables the player, controlling one of the heroes, as to lead thousands-strong armies into battle, so as combat with the hero alone, making use of the entire arsenal of possibilities and powerful magical spells. The possibility to upgrade your hero, improve his abilities, find artifacts and get random quests serves to hugely diversify the gameplay.</p>\n<ul>\n<li>Innovative opposing of two genres in one game - RTS vs RPG</li>\n<li>New 3D engine </li>\n<li>Detailed game world, including support of 5 novels from Europe-renowned writer Ilya Novak</li>\n<li>Mass-scale battles of thousands-strong armies</li>\n<li>Four unique races, individual skills, spells and artifacts</li>\n<li>12 heroes, 12 neutral races, 100 units and 150 various buildings</li>\n<li>Excellently developed character types and impressive unit animation</li>\n<li>Over 150 magic items and over 100 spells</li>\n<li>Original and involving story of the campaign</li>\n<li>Classic multiplayer over LAN or the Internet, up to 7 players in a game. Mix of two genres in the game: RTS vs RPG with a possibility to blend or choose in between during the play.</li>\n<li>Original card system of magic spells, equally interesting to both hardcore gamers and newbies. Over 50 spell cards</li>\n<li>Involving process of character level-ups throughout the entire game</li>\n<li>Stunning intros and cut-scenes. Comics in-between missions to give a deeper story insight</li></ul>", "metacritic": 65, "released": "2006-10-04", "tba": false, "updated": "2024-02-21T21:49:38", "background_image": "https://media.rawg.io/media/screenshots/6e1/6e1a91d974aaab574e8201fde3187cea.jpg", "website": "http://www.heroesofae.com/", "rating": 3.78, "rating_top": 4, "added_by_status": {"yet": 14, "owned": 423, "beaten": 18, "toplay": 7, "dropped": 14}, "playtime": 1, "achievements_count": 0, "ratings_count": 32, "suggestions_count": 563, "game_series_count": 0, "reviews_count": 32, "platforms": ["PC"], "developers": ["GSC Game World"], "genres": ["RPG", "Strategy"], "publishers": ["GSC Game World"], "esrb_rating": "Teen"}