{"id": 19592, "slug": "hitman-2-silent-assassin", "name": "Hitman 2: Silent Assassin", "name_original": "Hitman 2: Silent Assassin", "description": "<p>Hitman 2: Silent Assassin is the second part of the Hitman series, which tells us about the killer clone.</p>\n<p>The game takes place in 2002-2003.<br />\nThe story begins after the events of Hitman: Codename 47 (the first part of the series). Agent 47 left a killer job, and now he is trying to start a quiet life, living simply and working as a gardener in a monastery under the patronage of the father, Emilio Vittorio. But life soon turns against him. Mafia kidnaps Emilio. Desperate, 47 switches back to the Agency he previously worked for to ask them to help him find Emilio. The Agency agrees to help him, but in exchange for the fact that he will fulfil several orders. The protagonist accepts.</p>\n<p>The game has fixed a lot of flaws of the first part: the management of the game has been improved and simplified, the first-person view and a suspicion indicator has been added, which allows the player to understand how close the enemies are to reveal him. The ranking system was also added. After each mission, the player receives a rank for the quality of its execution.</p>", "metacritic": 87, "released": "2002-10-01", "tba": false, "updated": "2024-03-28T20:32:16", "background_image": "https://media.rawg.io/media/games/683/6833fbb183fd72a61c032501e3bc6d36.jpg", "website": "https://www.ioi.dk/hitman-silent-assassin/", "rating": 3.92, "rating_top": 4, "added_by_status": {"yet": 241, "owned": 3287, "beaten": 585, "toplay": 64, "dropped": 220, "playing": 6}, "playtime": 1, "achievements_count": 21, "ratings_count": 630, "suggestions_count": 411, "game_series_count": 9, "reviews_count": 633, "platforms": ["PC", "PlayStation 2", "PlayStation 3", "Xbox 360", "Xbox", "GameCube"], "developers": ["Square Enix", "IO Interactive"], "genres": ["Action", "Shooter"], "publishers": ["Square Enix", "Eidos Interactive"], "esrb_rating": "Mature"}