{"id": 19591, "slug": "blacklight-tango-down", "name": "Blacklight: Tango Down", "name_original": "Blacklight: Tango Down", "description": "In <strong>Blacklight: Tango Down</strong>, experience the bleeding edge of advanced warfare. Participate in the “NetWar”: a hyper-realistic battlefield letting you fight tomorrow’s conflicts with or against your friends in the gritty Blacklight universe.  Make your stand across seven game modes with 12 different maps in intense online battles supporting up to 16 players. Or fight through four intense Black Ops missions co-operatively or alone; all the while gaining experience, collecting stats, and unlocking items.  Earn new weapon attachments and items, improve your abilities, and engage your Hyper Reality Visor to locate enemies and take them out.  Customize your character and weaponry from among thousands of combinations to become the soldier you always wanted to be.<br/> <ul><li><strong>Groundbreaking content:</strong> 12 multiplayer maps across seven multiplayer game modes.<br/> </li><li><strong>Black Ops missions:</strong> Enhance your skills in four co-op missions with support for 1-4 players.<br/> </li><li><strong>Highly-customizable weapons and armor:</strong>  Modify the way your firearms shoot, look, and feel among thousands of combinations.<br/> </li><li><strong>Rank up through 70 levels:</strong> Improve your abilities as you unlock tons of new items, camos, armor, and weapon attachments!<br/> </li></ul>", "metacritic": 65, "released": "2010-07-07", "tba": false, "updated": "2022-09-26T01:27:06", "background_image": "https://media.rawg.io/media/screenshots/d0a/d0a7132a2a5b5929a73f05aa42319322.jpg", "website": "http://www.playtangodown.com", "rating": 2.4, "rating_top": 3, "added_by_status": {"yet": 4, "owned": 171, "beaten": 3, "toplay": 5, "dropped": 8}, "playtime": 1, "achievements_count": 48, "ratings_count": 10, "suggestions_count": 423, "game_series_count": 0, "reviews_count": 10, "platforms": ["PC", "Xbox 360"], "developers": ["Zombie Studios"], "genres": ["Action", "Shooter"], "publishers": ["Ignition Entertainment"], "esrb_rating": "Teen"}