{"id": 196022, "slug": "day-night-souq", "name": "Day Night Souq", "name_original": "Day Night Souq", "description": "<p>In <strong>Day Night Souq</strong> you try to trade Goods and Gold by day, and protect your wealth at Night.</p><p><strong>Controls:</strong></p><p>Stand over an offer (white rectangle with goods in it) and press B to Buy (Trade gold for goods). Press Space to Sell (trade goods for gold) (works only with merchant near the stores/houses).</p><p><strong>Mechanism</strong>:</p><p>Merchant near the stores buy and sell one type of goods. Merchant in the middle only trade goods. Try to maximize your gold and goods before night fall, and prepare for a chase with the desert thieves!</p><p>- The market changes everyday, and you get offers depending on the goods you own (still needs some balancing to be more smart and challenging .. working on it!)</p><p>- The thieves are more pissed the longer you survive at night! They become smarter and faster as you over-smart them!</p><p>- You lose if you run out of gold and goods, so take care not to get robbed by thieves (it hurts, you have been warned!)</p><p>Oh, and please share your thoughts if you think something can be done better and become more fun!</p><p>Have FuN !<br/></p><p><strong>Credits</strong>:</p><p>Sound Effects from http://www.freesfx.co.uk and http://soundbible.com/</p><p><strong>Submitted to: </strong>#GameZanga 5 and the theme was \"The Right Time\".<br/></p><p><strong>(in case you are curios..) How is the game related to the theme? </strong>Day time matters, you cannot trade at night. Timing matters to catch offers before they disappear. <br/></p>", "metacritic": null, "released": "2015-08-02", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/71c/71c241e5fa9573aa17baa14142c299b2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 7, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Usagi"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}