{"id": 196102, "slug": "coloring-book-for-kids-itch", "name": "coloring book for kids (itch)", "name_original": "coloring book for kids (itch)", "description": "<p>Kids Coloring Book features:</p><p>★ Realistic finger coloring book for kids that requires precision and practice. <br/>★ Develops fine kids motor skills in creative way.<br/>★ 12 drawing categories: Halloween, coloring book for boys, coloring book for girls, coloring book for toddlers, animals, number &amp; letters, shapes, christmas, princess, dinosaurs, cosmos and potluck.<br/>★ Coloring game with animals sounds!<br/>★ Coloring book free contains over 500 illustrations as free coloring pages (including Halloween, princess, dinosaur) with ads.<br/>★ Full version of Coloring Book for kids contains no ads.<br/>★ Kids Engaging, age-appropriate and skill-appropriate topics<br/>★ Store completed drawings in the kids coloring books gallery or share them as greeting card.<br/>★ Coloring book HD - the app adjusts to tablet and mobile screen size.<br/>★ Free updates</p><p>It invites kids to draw &amp; color a wide variety of animals, halloween, landscapes, knights, princess, dinosaurs. Your girls and boys has the possibility to express themselves creatively and become familiar with a full pallet of colors, even doodle like Picasso! This application is visually arresting, easy and intuitive which creates the perfect educational games for kids.</p><p>Download completely free application and give your child a great fun!</p><p>Coloring book for kids is divided into several coloring-in categories and progressive levels of difficulty. Children and/or adults can share their personalized paintings as greeting cards or simply store them in their own gallery.</p><p>An app can be used at the playschool, preschool, for fun as an educational drawing game. For girls we have princess, hearts, dresses and flowers we prepared. Coloring book for boys are diggers, excavators, cars, vehicles, dinosaurs and blank page doodling. The biggest attraction for toddlers though is coloring animals, that make real sounds!</p><p>Real animal sounds are of course not the only thing your child will learn. FingerPen is also about colouring other objects, like cars, rockets, trucks, knights, castles, dino, halloween, butterflies, dresses, doodle, much more. We have over 500 toddlers coloring pages for and we're still working on enlarging that number!</p><p>Learning through play<br/>Painting is an art, which contribute to the proper development of your child.<br/>Check out our free kids coloring book for girls and for boys, painting and drawing pictures like: pony, butterfly, doll, cat, fish, lion, dinosaur, boat and a lot more. Our educational kids coloring books games for kids guarantee great fun that you can share.</p><p>Author: Aplikacje mobilne IT-SYSTEM</p>", "metacritic": null, "released": "2016-07-08", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/c1c/c1caab8e950c03095efb93357156d6a3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 70, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["ITSS Games"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}