{"id": 196228, "slug": "blue-whale-attack-simulator-2017", "name": "Blue Whale Attack Simulator 2017", "name_original": "Blue Whale Attack Simulator 2017", "description": "<p>Get ready to enjoy the exciting new game for ocean, water lovers and the underwater life of a fantastically massive and majestic blue whale simulator! Watch beautiful surroundings of the aquatic reef plants, fight with different sea predatory beings, find your mate and raise a family of little blue whales playing Blue Whale Attack Simulator 3D! This angry blue whale is on rampage! It will attack and destroy whatever gets in way.Play the Best of its type 3D Blue Hungry whale Simulator and become a ferocious hungry Whale to kill ruthlessly and endlessly. Show no mercy, Chase your pray, attack and grab it in the might Jaws to kill instantly.This mighty beast is out to eat bulk of sea animals , fishes and lots of human.<br/>In this under water game live a life of the fantastic underwater creature – blue whale Become really mighty and unhurried oceanic animal roaming about the deep waters and searching for adventures! Spread your flippers and dip into the life of a real whale itself! Be wise enough not to run into trouble with different sea predators like orcas, shark fish, octopuses, morays and others! Just cute dolphin or slow turtle may become your friends!The new angry blue whale game has new attacking features.For the first time,you get to be on the evil side in this hungry whale game simulator, become a vicious blood thirsty and blue angry SHARK.You have to Pay more attention because this simulator is not like other ordinary Angry Sea White Shark games. Show your fighting simulator skills in this angry blue whale evolution game. Enjoy diving and swimming like realistic fish in water as Angry Blue Whale Revenge Simulator.Hunt around the world of Killer Whale, eat some dolphin and lonely scuba divers to clench your hunger.<br/>The new angry blue whale whale game has new attacking features. For the first time, you get to be on the evil side in this hungry whale game simulator, become a vicious blood thirsty and blue angry whale! Eat everything in your way and keep the killing going as an angry blue whale shark You have to Pay more attention because this simulator is not like other ordinary blue whale shark games. Go fishing for people and boats and come back with a full stomach.<br/>Features of Blue Whale Attack Simulator 2017<br/>Awesome 3d Sea and beach environment.<br/>Animated Aquatic animals including Shark, Orca, Whale, Dolphin, Jellyfish and more.<br/>Exciting killing missions<br/>Awesome Visuals and sound Effects<br/>Smooth game play and easy controls<br/>Lots of people to kill including Scuba Divers, Swimmers, Beach Goers, Fishermen, etc.</p>", "metacritic": null, "released": "2018-02-08", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/58a/58aaca5c3d7dd757f8c878c2275a3802.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 161, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["MadMaxGames"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}