{"id": 19620, "slug": "red-orchestra-ostfront-41-45", "name": "Red Orchestra: Ostfront 41-45", "name_original": "Red Orchestra: Ostfront 41-45", "description": "<p>From the bayonet to the artillery battery, from hand-to-hand combat to combat along the whole front - all this can be experienced in the game on the real events of the World War II. The Eastern Front is the site of the most brutal battles.</p>\n<h3>Realism</h3>\n<p>The circumstances of the battles and the characteristics of weapons are reproduced with great accuracy, including exact dates of battles and pictures of the terrain from cities to natural landscapes. Equally realistic are the characteristics of the flight of bullets and shells, fired from various weapons. The creators of the game paid attention to the authenticity of sounds, the game involved Authentic Immersive Sound FX and 3d Positional Sound System.</p>\n<h3>Weapons and more</h3>\n<p>At your disposal are infantry formations and tank divisions, many equipment and battalions of soldiers. In total, the game has sixteen completely reliable models of vehicles - their interior is also modeled. Thirty models of infantry weapons. You can fight by combining infantry and motorized weapons.</p>\n<h3>Modes and more</h3>\n<p>Modes of multiplayer and online-game allow simultaneous participation of more than fifty players. To coordinate activities in this mode, there is a technology called Voice Over IP.</p>\n<h3>Updates</h3>\n<p>Existing updates to the game include new types of weapons, equipment, new maps: Krivoi Rog, Smolensk Stalemate, Leningrad, Berezina, Black Day July.</p>", "metacritic": 81, "released": "2006-03-14", "tba": false, "updated": "2024-01-25T17:34:21", "background_image": "https://media.rawg.io/media/screenshots/6b9/6b999cc618df4cf5924537e95ea30090.jpg", "website": "http://www.redorchestragame.com/", "rating": 3.02, "rating_top": 4, "added_by_status": {"yet": 41, "owned": 1066, "beaten": 19, "toplay": 15, "dropped": 27}, "playtime": 1, "achievements_count": 47, "ratings_count": 55, "suggestions_count": 569, "game_series_count": 1, "reviews_count": 55, "platforms": ["PC", "Linux", "macOS"], "developers": ["Tripwire Interactive"], "genres": ["Action"], "publishers": ["Iceberg Interactive", "Tripwire Interactive"], "esrb_rating": null}