{"id": 19639, "slug": "toy-soldiers", "name": "Toy Soldiers", "name_original": "Toy Soldiers", "description": "The Xbox LIVE® Arcade smash hit <strong>Toy Soldiers</strong> comes to PC!<br/><br/><strong>Toy Soldiers</strong> is an action-packed strategy-based game in which players command antique WWI toy soldiers vying for control of the trench-filled battlefields of Europe. Deploy an exciting arsenal such as tanks, cavalry, biplanes, and flamethrowers in vintage WWI toy dioramas. Developed by Signal Studios, <strong>Toy Soldiers</strong> allows you to take control of individual units or control the entire battlefield from a strategic view. Integrating multiple game genres and world-class visuals, Toy Soldiers is a unique and action-packed entertainment experience! <br/><br/>Command your <strong>Toy Soldiers</strong> in epic, action-packed battles. Position your defenses and take direct control of your artillery to bomb the enemy positions, pilot your bi-plane against the enemy trench, or maneuver your tanks across No-Man’s Land and lead your <strong>Toy Soldiers</strong> to victory!<br/><br/>All DLC from the Xbox LIVE® Arcade hit is included!The Kaiser's Battle DLC<br/>Enjoy all new French inspired content with THE KAISER'S BATTLE! Take on the new experimental boss, The K-Wagen!Invasion DLC<br/>The British are bringing brand new secret weapons of tiny toy mayhem in Invasion!, the second add-on to Toy Soldiers from Signal Studios! Put on your Kaiser’s helmet and command the German Army against a mad menagerie of new antagonistic toys, including flying saucers, chivalrous knights, and the “Rolls Royce of the Sky,” the WWII Mustang. Defend Germany in a new Mini-campaign topped by the most calculating, head-strong boss of all (batteries not included)! Raise your saber, soldier, and lead the charge against… is that a spaceman? The Invasion has begun!Content ActivationTo activate Toy Soldiers after your purchase, launch Toy Soldiers and select <strong>'Redeem Code'</strong> from the main menu. Then follow the instructions to redeem your content.<br/><br/>Alternatively, you can redeem Product Codes for the downloadable content at https://live.xbox.com/RedeemToken.", "metacritic": 71, "released": "2010-03-03", "tba": false, "updated": "2023-11-26T19:35:05", "background_image": "https://media.rawg.io/media/screenshots/fae/faed4a36cdf2169b9381865fbd885ec9.jpg", "website": "http://www.signalstudios.net", "rating": 3.63, "rating_top": 4, "added_by_status": {"yet": 17, "owned": 595, "beaten": 26, "toplay": 4, "dropped": 29, "playing": 1}, "playtime": 1, "achievements_count": 52, "ratings_count": 60, "suggestions_count": 646, "game_series_count": 0, "reviews_count": 60, "platforms": ["Xbox 360", "PC"], "developers": ["Signal Studios"], "genres": ["Action", "Strategy", "Simulation", "Casual"], "publishers": ["Microsoft Studios"], "esrb_rating": "Teen"}