{"id": 19646, "slug": "splinter-cell", "name": "Tom Clancy's Splinter Cell", "name_original": "Tom Clancy's Splinter Cell", "description": "<p>Tom Clancy&#39;s Splinter Cell is a stealth-action game developed by Ubisoft Montreal. It is the first installment of the Splinter Cell franchise.</p>\n<h3>Plot</h3>\n<p>In 2003, the United States government formed a new covert agency to gather intelligence. It is a top-secret organization named Third Echelon. The agency has access to cutting-edge surveillance and military technologies. Third Echelon&#39;s agents are free to violate any law as long as it is required to complete the mission successfully.</p>\n<p>In 2004, contact is lost with a CIA agent. Homeland security sends a second agent to check on the CIA&#39;s asset, yet contact is lost again. Third Echelon sends Sam Fischer to investigate the situation.</p>\n<h3>Gameplay</h3>\n<p>The game&#39;s main focus is to hide from the enemy instead of going loud and gun-blazing. The players have to leave no trace of themselves. It is essential to stick to the shadows, use the environment for cover and carefully pick your equipment to avoid detection.</p>\n<p>Shadows are the best friend of the player. A special indicator is present on an in-game HUD that shows if the players are visible to their enemies. The game does not welcome the usage of weapons as the sound of gunfire is very loud and can be heard from the distance. The players have to rely on headshots, as they don&#39;t have much ammo on them. Sam has multiple advanced gadgets to aid him in his mission as well as a lot of hand-to-hand combat experience.</p>", "metacritic": 91, "released": "2002-11-17", "tba": false, "updated": "2024-04-22T18:20:39", "background_image": "https://media.rawg.io/media/games/104/104e82a52297cc7ddd3b05b7e68be04f.jpg", "website": "http://splintercell.us.ubi.com/", "rating": 4.16, "rating_top": 4, "added_by_status": {"yet": 160, "owned": 1222, "beaten": 498, "toplay": 75, "dropped": 158, "playing": 9}, "playtime": 2, "achievements_count": 37, "ratings_count": 463, "suggestions_count": 422, "game_series_count": 7, "reviews_count": 468, "platforms": ["PlayStation 3", "Xbox 360", "Xbox", "Game Boy Advance", "Classic Macintosh", "GameCube", "PlayStation 2", "PC", "Xbox One"], "developers": ["Ubisoft", "Ubisoft Montreal", "Ubisoft Toronto", "Ubisoft Shanghai", "Gameloft", "Ubisoft Annecy"], "genres": ["Action", "Adventure"], "publishers": ["Ubisoft Entertainment", "Aspyr", "Gameloft"], "esrb_rating": null}