{"id": 19653, "slug": "hinterland", "name": "Hinterland", "name_original": "Hinterland", "description": "\t\t\t\t\tCan you build a vibrant settlement, lead your people to prosperity, and tame the wild Hinterland?                    <br/> <ul><li><strong>Party-based RPG Action</strong> \u0097 A variety of characters, weapons, and strategies are at your disposal -- will you lead the charge with a devastating two-handed strike, or stand behind the herder in plate mail with your trusty bow?                    <br/> </li><li><strong>Town Building</strong> \u0097 Choose your settlers from a huge cast of characters and arm them for defense, or give them tools for production.                    <br/> </li><li><strong>Character Development</strong> \u0097 Develop lowly farmers into great warriors and customize your character with a variety of specializations.                    <br/> </li><li><strong>Random fantasy world</strong> \u0097 Each game of Hinterland takes place in a new location with different resources, items, and challenges. Different challenges feature a range of enemies, including orc war camps, dark elf raiding parties, goblin infested mines, ruined cities filled with undead, and more.                    <br/> </li><li><strong>Customizable Gameplay</strong> \u0097 From a hardcore game to a world without raiders you make the choice about the type of game you want to play.                    </li></ul>Hinterland is a new type of role-playing strategy game from the developers of Children of the Nile™, Caesar IV™, and SimCity Societies™.", "metacritic": 65, "released": "2008-09-30", "tba": false, "updated": "2024-04-15T10:47:35", "background_image": "https://media.rawg.io/media/screenshots/526/526dcd5c9784524e0d3b7081d37eabc0.jpg", "website": "http://www.tiltedmill.com/hinterland/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 142, "beaten": 2, "toplay": 1, "dropped": 2}, "playtime": 2, "achievements_count": 9, "ratings_count": 4, "suggestions_count": 490, "game_series_count": 0, "reviews_count": 4, "platforms": ["PC"], "developers": ["Tilted Mill Entertainment"], "genres": ["RPG", "Strategy"], "publishers": ["Tilted Mill Entertainment"], "esrb_rating": null}