{"id": 196585, "slug": "space-drifter", "name": "Space Drifter", "name_original": "Space Drifter", "description": "<p>Oh no, the guns got taken out! What will you do now?</p>\n<p><em>  Use the afterburners, Luke.</em><br/></p>\n<p>You mean, like run away?</p>\n<p><em>  No! Burn them to a crisp!</em><br/></p>\n<p>Oh, okay. I don't see any enemies though. there's just these crystals.</p>\n<p>  <em>That's just the developer not using their time effectively enough to implement enemies.</em></p>\n<p>¯\\_(ツ)_/¯</p>\n\n<p>Made with Clickteam Fusion 2.5. www.bfxr.net used for sound effects.</p>\n<p>Thanks to Coops for some feedback on some early builds. Everything was made by myself. Nothing from before the gmtk jam started was used.</p>\n<p>When I saw the theme my thoughts immediately went to making as many deep and interesting interactions as I could with only a single verb. The result is that your only method of interacting with the world is through the movement of your ship, which in turn directs the exhaust port of your engine, which acts as a weapon. It wasn't just intended to be a weapon however, as this exhaust is also capable of blocking enemy projectiles, hence \"dual\" purpose. Additionally, if the player were struck by an enemy projectile it would create a new exhaust port in that location with all the functions of your engine, and having too many holes in your ship would cause you to explode. (tying health back into exhaust and your movement. Thanks Coops for that idea!)</p><p>Unfortunately, there are no enemies or projectiles implemented into the game. rip</p>", "metacritic": null, "released": "2017-07-16", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/d0c/d0ccdf14c11d08c5637ccf00b07fe4fc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 5, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["CrazyMLC"], "genres": ["Action"], "publishers": [], "esrb_rating": null}