{"id": 196515, "slug": "powerton", "name": "Powerton", "name_original": "Powerton", "description": "<p>Controls: Click on buildings to power up/power down.</p>\n<p>Press M in the main menu to open up the hidden Map Editor. Will only work in the Jar distribution, NOT the game on itch.io.</p>\n<p>Map Editor Controls:<br/>* 1-4 = Select Between Terrain Tiles</p>\n<p>* Q-P = Select Between Buildings </p>\n<p>* A-J = Select Between Buildings</p>\n<p>* ESC = Leave Map Editor</p>\n<p>* M = Save Map</p>\n<p>* 0 = Clear Map</p>\n<p>* Left click to apply building/terrain on map. You can remove buildings by selecting the Grass Terrain (or the \"1\" key) and clicking on the bottom left corner of the building.</p>\n<p>Mayor! Powerton's suffered an energy plant explosion! We're currently lacking in power!</p>\n<p>Powerton is a city/power management game where you must power up and power down buildings in order to satisfy the 4 needs of your people: Happiness, Food, Economy, and Crime. You lose if Happiness, Food, or Economy reach 0. You also lose if Crime reaches 100. </p>\n<p>Click on an unpowered building to power it up - powering up a building takes time and is signaled by the light slowly turning on. When the light starts flashing, a building is totally powered up and works towards satisfying needs. You can also unpower buildings by clicking on a powered building, which is immediate.</p>\n<p>Your power is listed on the top left of the screen. Each building takes a certain amount of power to utilize - in general, larger buildings yield bigger bonuses but take longer to power up and eats up more of your power supply. Each day you will gain +10 more power to use.</p>\n<p>Courthouse, Police, Sheriff = Reduce Crime<br/>Arcade, Bowling, Pub = Increase Happiness<br/>Restaurant, Supermarket, Cafe, Burger Lord = Increase Food<br/>Factory, Bank, Super Shirts = Increase Economy<br/>Ice Cream = Increase Happiness and Food (reduced amount)<br/>Donuts = Increase Food (and Happiness, as long as a Courthouse, Police, or Sheriff is powered on)<br/>School = Reduce Crime (Greatest crime reducer), but also reduce some Happiness.</p>", "metacritic": null, "released": "2017-07-31", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/3dc/3dc7eff643cf4d6c6d82372d66c2d3fe.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 3, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Web"], "developers": ["trineroks"], "genres": [], "publishers": [], "esrb_rating": null}