{"id": 196500, "slug": "amnesia-of-who-memory-game", "name": "Amnesia of Who - memory game", "name_original": "Amnesia of Who - memory game", "description": "<p> Hi! my name is Who and I lost my memory!<br/>Help me remember my family members!<br/>Practice your memory and reveal each time a new family member!</p>\n<p>The player chooses two circles and flips them over to reveal the icons hidden on their other side. The goal is to match pairs of circles with the same icon. The game ends when the last pair has been flipped over and matched.</p>\n<p>You can configure 16 combinations of difficulty using the following options:<br/>1) \"peek\" (off by default) - Lets you open and then close again a circle.<br/>2) \"tries\" (on by default) - Set to 8 failed matches. <br/>3) \"time\" (off by default) - Set to 2 minutes.<br/>4) \"shuffle\" (off by default) - Shuffles circles after a wrong match. You just get a quick glimpse of where the circles you just mismatched went before they flip back again.</p>\n<p>If Tries and/or Time is on, then after each level you see an \"Extra\" screen showing how many Tries and/or how much Time remained available (if any). Those add on to the next level's default Tries and Time respectively.</p>\n<p>You can optionally right-click and select to Install the game on your desktop for Out of Browser (OOB) and Offline use.</p><p>USING SILVERLIGHT BROWSER PLUGIN, WHICH NOW WORKS ONLY IN INTERNET EXPLORER (ON WINDOWS 10's EDGE BROWSER PRESS THE \"...\" BUTTON AND SELECT \"OPEN IN INTERNET EXPLORER\") AND IN SAFARI ON MAC OS-X<br/></p>\n<p>Like on Facebook: http://facebook.com/AmnesiaOfWho <br/></p>\n<p>Also available on Windows Phone Store: http://www.windowsphone.com/s?appid=743fb612-830c-465a-9db5-403eee4a895d<br/></p>", "metacritic": null, "released": "2015-04-11", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/10a/10ab616dc32e0841b28ae866953c5f06.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 80, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Zoomicon"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}