{"id": 196534, "slug": "time-itch-jin-huang", "name": "Time (itch) (JIN HUANG)", "name_original": "Time (itch) (JIN HUANG)", "description": "<p>Time is a mysterious subject to me. Time is flowing, intangible and elapsing every second. Everyone feels it. It's a pretty subjective experience since we feel time as an individual, an observer. Thus, people feel different time pace and time rate based on their own perception. Time has its own properties - past, presence and the future. So I want to make an experience that uses visuals, sound and to create the atmosphere. I try to connect my work to \"ways of seeing\", The way people seeing the world is interacting with the way people feeling the time.</p><p>I'm creating an interactive experience that enable players to explore the relativity and absoluteness of time by make time manipulation based on their perceptions of time.</p><p>I try to set a world where big bubbles float and is always raining, the rain falling speed just show the real time elapsing speed. Each big bubble is an individual world which exist an unique time law after you enter it. Using the rain as the reference, player need to find the time law existing in each bubble and try to find the concealed switch and fix all the moving objects' moving speed to match the time system in the scene.</p><p>In the process, I try to set the ways of time manipulation. Design the switch or slider that enable player to adjust. However, I noticed that the interaction now maybe too single, my ability of programming now limits the expression possibilities of the work in some way. Also, now after you finish the level, it quit to the main menu too quickly, maybe I should add a counting system. I tried to use Ienumerator but failed. Moreover, the WebGL exported version always shows the worst resolution and has zigzags in the image.</p>", "metacritic": null, "released": "2016-12-20", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/f49/f492d4361461b87bcd4a5f93a69af2cb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 11, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["JIN HUANG"], "genres": [], "publishers": [], "esrb_rating": null}