{"id": 19662, "slug": "sword-of-the-stars-ii-enhanced-edition", "name": "Sword of the Stars II: Enhanced Edition", "name_original": "Sword of the Stars II: Enhanced Edition", "description": "<p>The Enhanced Edition contains Sword of the Stars II: The Lords of Winter and the first expansion, the End of Flesh. The new expansion introduces the new playable race, the Loa. All previous DLCs containing new avatars, new combat music, alternate voices, skins, and new badges for the warships are also included.\n</p>\n<p>Customize your own starships, amass your fleet, explore the outer reaches of the galaxy and expand your empire. Research new alien technologies and bring them into battle with  a mix of turn-based strategy and real-time skirmishes. \n</p>\n<p>Now a new Faction bursts onto the scene, a race of Artificial Intelligence who once served as slaves and now return seeking vengeance. Playing as the Loa, your Fleets will become masters of metamorphosis, shape-shifting into new forms to become the ships you need, where you need them. Durable and hardy, your colonies can be built on any rocky planet. Building an empire of silicon and steel, you will bring your former masters to their knees…or will you bring about the End of Flesh.\n</p>\n\nKey Features\n<ul>\n<li> Play as the Loa, with over 120 new ship sections and their own unique drive system – the Neutrino Pulse Gate\n<li> Over 25 additional technologies, including a new Cybernetic Tech Tree\n<li> 10 new weapons and attacks to use in battle\n<li> New ship sections for the original six Factions, including 2 new Leviathan class vessels\n<li> 2 new Independent Races to encounter, study and incorporate into your empire\n<li> New Random Encounters, a new Grand Menace, and new Star Maps\n<li> New Evacuation Mission, and Supplemental Mission system allowing players to focus on the Target or the Fleet\n<li> All Race DLCs: Suul’ka, Liir, Morrigi, Hiver, SolForce, Zuul and Tarka\n</li></li></li></li></li></li></li></li></ul>", "metacritic": 65, "released": "2012-11-30", "tba": false, "updated": "2023-02-12T00:17:46", "background_image": "https://media.rawg.io/media/screenshots/71a/71a4fb1f0e7b2e4c58bdb44bffda0e2c.jpg", "website": "http://www.swordofthestars.com", "rating": 2.47, "rating_top": 3, "added_by_status": {"yet": 12, "owned": 434, "beaten": 1, "toplay": 3, "dropped": 4}, "playtime": 1, "achievements_count": 14, "ratings_count": 15, "suggestions_count": 324, "game_series_count": 0, "reviews_count": 15, "platforms": ["PC"], "developers": ["Kerberos Productions"], "genres": ["Strategy"], "publishers": ["Paradox Interactive"], "esrb_rating": null}