{"id": 196628, "slug": "glider", "name": "GLIDER (itch)", "name_original": "GLIDER (itch)", "description": "GLIDER\r\n(another PICO-8 game from me)\r\nControls\r\n<p>Z to start. L/R arrows speed up or slow down the glider's horizontal movement (always moving to the right). Use the hot air vents to stay afloat as you float as far as you can. You can stop yourself moving by holding left, in order to rise higher off a particular hot air vent before continuing.</p>\r\nCommentary\r\n<p>I've done 'vector' games before, in the sense of art styles based on the old vector screens, but in PICO-8 at least, I've never really done anything with actual vectors. Can't remember if I've done any attempt at physics either. I kind of attempt both of those in this game. </p>\n<p>Gravity, hot air vents, and player input all apply changes (forces?) to the glider character's X and Y vectors, you never press a key and move the glider precisely <em>n</em> pixels. And physics, at least at such a super basic level as this, is not too hard to put together. Gravity adds to the Y vector all the time, unless it is at terminal velocity either up or down. It's probably terrible and unrealistic, but at least it feels more real than what I usually do.</p><p>I'm trying to give myself a break with the self-deprecation on my music offerings, but there's no denying that this is a fairly short looped track. Please mute if it's annoying, the game has no sound otherwise because I was too preoccupied with other messing.</p>\n<p>Lexaloffle BBS thread: here.</p>\n<p>#1GAM January 2018</p>", "metacritic": null, "released": "2018-02-01", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/62e/62e34c1a76d00b235cee8de1b7658954.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 29, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Web"], "developers": ["PROGRAM_IX"], "genres": ["Racing"], "publishers": [], "esrb_rating": null}