{"id": 19672, "slug": "rayman-raving-rabbids", "name": "Rayman Raving Rabbids", "name_original": "Rayman Raving Rabbids", "description": "<p>Hordes of crazed out-of control bunnies have invaded, enslaving Rayman and forcing him to participate in &#39;gladiator&#39; style trials.  Help Rayman win his freedom back by entertaining and outwitting these fury foes. Use the most hilarious fighting moves imaginable. Run races on animals, fight in the arena, mesmerize the bunnies with your dance moves, throw cows, milk pigs or engage in plunger shooting madness!  The possibilities for fun are endless.<br />\nOver 70+ Trials in Unique Stylized Worlds - Pass trials by entertaining the bunnies and unlock new worlds and many collectables such as costumes, music and items for Rayman&#39;s cell.<br />\nLoads of Hysterical Fighting Moves - Run races on animals, fight in the arena, dance or engage in toilet plunger- shooting action!<br />\nParty with friends - Experience frenzied competition with up to 4 players in frantic and quirky multiplayer trials.<br />\nDress to Impress - Go punk, pop, rock or hip hop and use your funky dance moves to entertain the bunnies; keep them moving to your rhythm and collect additional disguises. Become more and more popular and unlock additional items.</p>", "metacritic": 58, "released": "2006-11-14", "tba": false, "updated": "2024-04-07T23:43:17", "background_image": "https://media.rawg.io/media/games/8d7/8d736cac398f1d2dc3023ca9ddb3a05e.jpg", "website": "http://raymanzone.us.ubi.com/ravingrabbids/index.html", "rating": 3.64, "rating_top": 4, "added_by_status": {"yet": 40, "owned": 408, "beaten": 191, "toplay": 17, "dropped": 71, "playing": 4}, "playtime": 1, "achievements_count": 16, "ratings_count": 188, "suggestions_count": 451, "game_series_count": 23, "reviews_count": 191, "platforms": ["PC", "Nintendo DS", "Wii U", "Wii", "Xbox 360", "PlayStation 2", "Game Boy Advance"], "developers": ["Ubisoft", "Ubisoft Montpellier", "Ubisoft Sofia", "Ubisoft Bulgaria"], "genres": ["Action", "Adventure", "Family"], "publishers": ["Ubisoft Entertainment"], "esrb_rating": "Everyone 10+"}