{"id": 1968, "slug": "octagon-a-minimal-arcade-game-with-maximum-challen", "name": "Octagon - A Minimal Arcade Game with Maximum Challenge", "name_original": "Octagon - A Minimal Arcade Game with Maximum Challenge", "description": "You are trapped inside the Octagon, a megaplex of hallways, platforms, and gaps—and the clock is running. Can you survive the mad race through this trippy 8-sided tunnel?  <br/><br/>“Octagon is like Temple Run but on steroids and with much cooler music and graphics. If you're a Temple Run or Impossible Road fan, you definitely want to check out Octagon for iPhone or iPad.” - Allyson Kazmucha, iMore<br/><br/>“Some of the most fun I’ve had with my iPhone this year.” - 9/10 Arcade Sushi<br/>“Fast, tough game that doesn’t give a darn about your feelings. Go for it!” - 4/5 Cult of Mac<br/>“If you love these impossible reflex games, then you don’t want to miss out on Octagon.” - 5/5 AppAdvice<br/><br/>Octagon is a minimal arcade game where you have to move fast or be left behind. As the floor moves beneath you, spin your world around to dodge speed bumps. Flip upside-down to avoid holes, surf on top of the Octagon—whatever you can do to survive the mad race through this trippy 8-sided tunnel. An energizing soundtrack by Sqeepo and psychedelic color bursts keep you in the zone on your race to the finish. But with each round over after just 60 seconds, only super-fast reflexes will beat this very challenging game. <br/><br/>Features:<br/>- Classic, Endless and NEW Daily mode<br/>- Unlimited number of randomly generated levels<br/>- Dynamic procedural graphics with a minimalistic iOS7 look<br/>- Original soundtrack by Sqeepo<br/>- Universal App with iCloud syncing<br/>- Pure challenge with no in-app purchases or cheats<br/><br/>Tell me if you love it or hate it at info@lukaskorba.com or follow me at @lukaskorba.", "metacritic": null, "released": "2013-11-07", "tba": false, "updated": "2019-07-30T01:33:42", "background_image": "https://media.rawg.io/media/screenshots/eec/eecf3d1cb1eaa453a3008fde22700ecf.jpg", "website": "http://octagongame.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 2, "beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 113, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Lukas Korba"], "genres": ["Action", "Arcade", "Casual"], "publishers": ["Lukas Korba"], "esrb_rating": null}