{"id": 19715, "slug": "pitfall-planet", "name": "Pitfall Planet", "name_original": "Pitfall Planet", "description": "Pitfall Planet is a two-player co-operative puzzle-solving adventure game that takes place on a distant, forgotten mining world. Two astrobots, recently stranded and separated from their ship, must traverse the subterranean caves of the ruined planet and overcome its many perils in the process.<br/><br/>In Pitfall Planet, you and your friend are equipped with the latest and greatest in astro-miner technology! Players can use their grappling hooks to pick up objects (including each other!) and throw them over gaps or cliffs. To collect all the ore in each level, you'll learn to master buttons, crates, lanterns, bouncy pads, rockets, tanks, and more!SPACE  features, in SPACE!<ul><li>Play with a friend through a variety of levels with intriguing puzzles and dangerous enemies.<br/></li><li>Explore a mysterious overworld to discover caverns and secrets.<br/></li><li>Find hidden gems in every level, which can be used to unlock HATS!<br/></li><li>Choose a control scheme that works for you; play with controllers or on your keyboard, or even with two players sharing one controller!<br/></li><li>Throw your friends into pits of lava!<br/></li><li>Do it again! Don't worry, they'll be just fine.</li></ul>", "metacritic": null, "released": "2016-05-02", "tba": false, "updated": "2019-08-28T17:05:52", "background_image": "https://media.rawg.io/media/screenshots/009/0097e71cc680a7373176acea00771f76.jpg", "website": "http://www.pitfallplanet.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 24, "beaten": 1, "toplay": 3, "dropped": 1, "playing": 1}, "playtime": 1, "achievements_count": 38, "ratings_count": 1, "suggestions_count": 243, "game_series_count": 0, "reviews_count": 2, "platforms": ["Nintendo Switch", "PC", "macOS"], "developers": ["Abstraction Games", "Bonfire Games"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Abstraction Games", "adamgryu"], "esrb_rating": null}