{"id": 19722, "slug": "flobe", "name": "Flobe", "name_original": "Flobe", "description": "*EARLY ACCESS*<br/>*Please See Our Discussions Board To Report Any Bugs And Read About Any Updates*<br/>Find our High Score Contest Rules Here - http://www.foreverhumblepdx.com/no-mans-sky-contest.html<br/><br/>Forever Humble PDX via Skinny Jean Death Studios in collaboration with Porcelin Labs, presents FLOBE, an unique game with an emphasis on quick pick &amp; play action and casually intense gameplay! <br/><br/>Use both analog sticks to control the line's position and length! Collect characters that match the color of your bar in order to fill your multiplier for a higher score! Missing them will break your multiplier and cause the length of your bar to expand. Watch out for the green ♥♥♥♥♥♥♥s, red ♥♥♥♥♥♥♥s and those damn bombs, if they pierce your bar it's Game Over! Advance your gameplay to multiple color collectibles and intense enemy formation challenges. <br/><br/>Features 3 difficulty levels plus bonus challenges. Completing challenges will allow you to unlock the option to start the game in different difficulty modes. <br/><br/>Features an exquiste soundtrack by Jazz sensation Luis \"LoudMouth\" Camacho. <br/><br/>Although the game is extremely recommended for game pad use, it does have keyboard controls as well. <br/><br/>We will be releasing the game in Early Access as we continue to add increased difficulty challenges, a Linux build, Steam achievements and Steam trading cards. The game will have a low price point to appease all players on Steam...probably even just low enough for players to break even on sales of the Steam trading cards. <br/><br/>Lose yourself in the FLOBE!", "metacritic": null, "released": "2016-02-22", "tba": false, "updated": "2019-08-28T22:09:02", "background_image": "https://media.rawg.io/media/screenshots/fb9/fb9251572c8bf805cd013aeba1a6c39d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 93}, "playtime": 5, "achievements_count": 21, "ratings_count": 0, "suggestions_count": 108, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Skinny Jean Death Studios", "Porcelain Labs"], "genres": ["Strategy", "Casual", "Indie"], "publishers": ["Forever Humble PDX"], "esrb_rating": null}