{"id": 197381, "slug": "american-chilly", "name": "American Chilly", "name_original": "American Chilly", "description": "<p>Based on the Musical Rockestra American<br/>Chilly, by HEENE BOYZ.</p><p>Somewhere near a nuclear bomb testing<br/>site near Area 51. Maybe, or maybe not. You really don't know.</p><p>Consider this; You are in the desert<br/>between Los Angeles and Las Vegas and you have been driving 23 hours<br/>45 minutes and 19 seconds straight. Your gas gauge is next to empty,<br/>you are hungry, and you desperately need sleep, so you pull over.  Is<br/>this real or are you hallucinating? Fortunately, the last place for<br/>the next 100 miles to get Lodging, Chili, or Gas is somewhere nearby,<br/>American Chilly. YOU MUST GET TO AMERICAN CHILLY (Part 2). Oh,<br/>and your GPS on your computer just crashed, so you need to wait for<br/>it to restart or else you'll never find it. Will you survive<br/>survive the Cactus People, Aliens, giant ants and other strange<br/>creatures? For the best experience, turn up the volume on your<br/>computer, and play in the dark. Have fun and rock out with special<br/>guests, Pewdipie, Markiplier, Vanoss Gaming, and JackSepticeye. These<br/>are our favorite Let's Play Bros. </p><p>TIPS: Listen to the DJ, he will give<br/>you tips on how to play. </p><p>The car does not move. You will </p><p>Please don't forget to share and like<br/>us on: facebook/heeneboyz<br/>You Win! You will arrive at American<br/>Chilly in Part 2.<br/></p>", "metacritic": null, "released": "2015-11-30", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/4cf/4cfa866dbe678175971f445c07d09b36.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 165, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Android"], "developers": ["HEENEBOYZ"], "genres": ["Action"], "publishers": [], "esrb_rating": null}