{"id": 197408, "slug": "army-bus-coach-driving-us-military-transport", "name": "Army Bus Coach Driving: US Military Transport", "name_original": "Army Bus Coach Driving: US Military Transport", "description": "<p>The most adventurous and thrilling journey in which you have to play the role of US military bus driver and transport the army commandos from one base camp to another safely. Get hold on steering and perform best skills of US army bus driving on mountainous climb hill areas, improve your military bus driving skills and mental training follow instructions and reached in destination point on time. <br/><br/>Fasten your seat belt and get ready to transport the soldiers from one base to another base. Bus driving or simulation as an army bus driver on mountainous hill climb areas. Improve your bus driving skills and mental training by following instructions and reached to the destination point on time and perform your transport duty. You have limited time to reach the destination where you have to drop off the soldiers. You should drive carefully because there are mines on the road which you have to cross safely without any crashes on military transport.<br/><br/>There are 10 levels in US army bus driving game which you have to complete these levels are very challenging and difficult to complete. The graphics are very astonishing with 3D real time green hilly environment. Drive safely because there are hills, mountains and also mines if you will drive fast then you could not control your bus during the turns. Play and enjoy the realistic most adventurous off-road tracks while driving the bus. This army driving bus game is very easy to play. Complete missions or survive through different missions and complete the tasks to unlock the next US Army bus transport duty missions.<br/>Be responsible and complete your task as a military bus driving expert and perform your transport duty. Realistic bus physics smooth game play handling for US army bus driving. Army bus game gives you a real experience of army driving bus and military transport. Download and enjoy with your friends!<br/><br/>Features of Army Bus Coach Driving game include:<br/>•\tMultiple levels<br/>•\t3D green hilly environment for bus driving<br/>•\tSave yourself from mines.<br/>•\tAstonishing graphics<br/>•\tRealistic mountain and hilly areas<br/>•\tFree to play army bus driving game<br/>•\tAmazing sound effects<br/><br/>Download Army Bus Game now and play as an expert military transport bus driver while safely picking up and dropping off the soldiers from base camp to another camp. Don’t forget to give us your valuable feedback and also rate us on store.</p><p>Download Now!!!</p>", "metacritic": null, "released": "2018-05-25", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/921/9212438f4465ed38a48e189ed7b6f5e8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 39, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ayesha-Tabassum"], "genres": [], "publishers": [], "esrb_rating": null}