{"id": 197465, "slug": "run-duarte-run", "name": "Run Duarte Run", "name_original": "Run Duarte Run", "description": "<p><strong><strong><strong><strong>A game created in Mexico City as a part of the Gr8ArtGames gamejam series by Goethe-Institute and Maschinen-Mensch</strong></strong></strong></strong></p><p><strong>Gameplay Video:</strong></p><p>https://youtu.be/mkuR5CXGCEM</p><p><strong>This game use the projection of the image, like a hologram, so it can only be used in equipment adapted for it.</strong><br/></p><p>This game is the story of a politician who lies, steals, run away and ends up in jail, is not based on a real story, but on many real stories, shows the politics of the absurd, that more than a question that only live In certain regions, unfortunately it seems to be a world reality, it is a game that will put your computer upside down.</p><p>This game seeks to make think about how important it is to observe the work or our politicians and demand that they do a good job, many times our politicians use their position for their economic benefit, to the detriment of the population. </p><p>----------------------<br/></p><p>Politics is the art of looking for trouble, finding it everywhere, diagnosing it incorrectly and applying the wrong remedies.</p> Groucho Marx (1890-1977) American actor.<p>Este juego es la historia de un político que miente, roba, huye y termina en la cárcel, no está basado en una historia real, sino en muchas historias reales, muestra la política de lo absurdo, que más que una cuestión que solo se vive en ciertas regiones, lamentablemente parece ser una realidad mundial, es un juego que pondrá tu computadora de cabeza.<br/></p><p><strong>Credits: </strong>Julio Salinas<br/></p><p><strong>Special thanks: </strong>Al CCD, al Goethe Institut y a todas las personas involucradas en este evento<br/></p>", "metacritic": null, "released": "2016-11-23", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/fab/fabb733c041bb5e376fd802152675d66.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 168, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["goethejam003"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}