{"id": 19755, "slug": "ragnarok-online", "name": "Ragnarok Online", "name_original": "Ragnarok Online", "description": "<p>After a thousand years of a fragile peace, clues showing that the war between Gods, Humans and Demons, that was once responsible for an unspeakable destruction, could have started to appear. As troubling events happen, rumors rise about mysterious and evil forces coming back to life. What could have possibly happened to Ymir, that God supposed to maintain peace over the world ?<br />\nAfter the long and gruesome war between God, Humans, and Demons... Scarred during the dangerous moments in battle, and avoiding total destruction altogether, the Humans, God and Demons entered a long truce.<br />\nThe 1000 years of fragile and forged peace...<br />\nIn the land of Midgard, the existence of peace eventually led the humans to erase their memories of the scars and hardships of the wars in the past. Not remembering the faults of the past, culture was spreading throughout the land along with selfishness, corruption, and arrogance.<br />\nThen one day, strange occurrences started happening, breaking the balance that once existed in Midgard. There came a strange howl from the boundaries that divided the humans, God, and demons; creatures began attacking; increasing earthquakes and hail - and...<br />\nThe mysterious legend of demons...<br />\nAs the fragile peace began to fall apart, stories about the parts of Ymir, protecting the peace, began to spread among the adventurers. Forgetting the true nature of it, people set out to seek each of the pieces for their own selfishness, and the wealth that would come with it...</p>", "metacritic": 79, "released": "2001-10-31", "tba": false, "updated": "2023-11-28T16:34:19", "background_image": "https://media.rawg.io/media/screenshots/2d1/2d15a5802b276caf76f0e23410dce74f.jpg", "website": "http://www.ragnarokeurope.com/", "rating": 4.18, "rating_top": 5, "added_by_status": {"yet": 5, "owned": 302, "beaten": 31, "toplay": 4, "dropped": 37, "playing": 3}, "playtime": 1, "achievements_count": 0, "ratings_count": 58, "suggestions_count": 398, "game_series_count": 11, "reviews_count": 60, "platforms": ["PC"], "developers": ["Gravity Europe SAS"], "genres": ["RPG", "Massively Multiplayer"], "publishers": ["Gravity Europe SAS", "Whybe Online"], "esrb_rating": "Teen"}