{"id": 1977, "slug": "j-werewolf-ep1", "name": "J-Werewolf: EP1", "name_original": "J-Werewolf: EP1", "description": "A flying saucer landed on Earth; its enigmatic pilot asks for help. Ghosts and monsters lurk inside his magnificent custom painted flying saucer, but Eileen, the new ninja in town, is at the right place at the right time and so she gets to go on an adventure that is as nostalgic as it is NEW.<br/><br/>Inspired by really good classic games like Ninja Gaiden, Super Mario and Metroid, Mystery of the J-Werewolf was designed to be as comfortable as holding an old NES controller, but also to use the modern features of iOS devices in unique ways.<br/><br/>A classic platformer made by someone who played lots of them. The old meets the new in this new spin on 2D sidescrollers!<br/><br/>==================================<br/>What people are saying? Do you really want to know? Yes? YES YOU DO!<br/>==================================<br/><br/>&amp;quot;a great job at feeling modern while still being very retro&amp;quot; - 148Apps (4 stars out of 5!)<br/><br/>&amp;quot;it looks good, the sound is a treat for anyone who gets off on nostalgia, it&amp;#39;s fun to play, and it has a talking dinosaur&amp;quot; - Slide to Play (3 stars out of 4!)<br/><br/>&amp;quot;music to the ears of anyone who’s been waiting for a retro iOS game that actually captures the spirit of retro game design rather than plopping pixelated graphics over bare-bones gameplay&amp;quot; - iFanzine<br/><br/>&amp;quot;its often hilarious writing makes it worth a download even without the deliciously classic gameplay&amp;quot; - Appolicious<br/><br/>You can see a gameplay trailer on the Support link (or http://is.gd/jwerewolftrailer)<br/><br/>==================================<br/><br/>This game is Retina Ready for iPhone/iPod and iPad. Sure, since it&amp;#39;s pixel art, all you get will be larger pixels. But, hey: at least we&amp;#39;re safe from horrible, blurry interpolation!<br/><br/>==================================<br/><br/>As of 1.06, J-Werewolf has 3 touch-screen control options and supports Joypad and some other popular joystick hardware. One of these options should really fit your needs. PLEASE, try them all before writing a review. The controls in J-Werewolf are fine!", "metacritic": null, "released": "2011-12-21", "tba": false, "updated": "2019-10-22T14:27:56", "background_image": "https://media.rawg.io/media/screenshots/7e1/7e105a5bc07d36428bebda494f9428ce.jpeg", "website": "http://hot2thetouch.com/jwerewolf", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 129, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Daniel Novais"], "genres": ["Action", "Adventure"], "publishers": ["Daniel Novais"], "esrb_rating": "Everyone 10+"}