{"id": 197928, "slug": "kryptonator", "name": "KRYPTONATOR", "name_original": "KRYPTONATOR", "description": "<p>KRYPTONATOR is the unconventional weapon for this 2D fighter game with a twist—the villain is the hero! The goal is for one of Superman's villains (Bad Grrl or Lex Luthor) to defeat him in as many battles as possible. This is my first Ludum Dare jam submission though I made games during the Dare's 29-31 weekends. I was a FORTRAN programmer in the 1980s, but pursued an entrepreneurial career until I became disabled in 2000. Now my health has improved so much I'm teaching myself Java and Javascript. My ideas and coding examples for Kryptonator came from a combination of games in OpenProcessing.org and a Processing tutorial by Nikolaus Gradwohl. I'm studying Box2D and have ideas for and plans to create a Kryptonator 2 version with 2D physics. The images and sounds used are in the public domain. Special thanks to Jesse Valentine for the free download of the theme mu.sic \"Viper.\" (jessevalentinemusic.bandcamp.com). This game runs in the Safari and Firefox browsers. All donations are for the charity Technology Cooperative (techco.org) to support \"Make Something to Go\" (video games, mobile apps, robots, etc.) for underserved and underrepresented middle and high school students.</p><p>NOTE:The shooter algorithm now works.</p><p>Music and sounds were not implemented because I learned at the last minute before submission that Processing libraries are precompiled Java VM byte code, so Processing.js cannot load them. This is why my import statement for Minim.js (an audio library for Processing) was ignored. I'm in the process of adding Minim-emulation code. p5.js (in active development) should solve this problem. I've learned so much during Ludum Dare 32, but I realize it's time to take Java/JavaScript courses! <br/></p>", "metacritic": null, "released": "2015-04-21", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/fe5/fe58fa4b8b6ccb09d1c98f9522f34c63.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 34, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["tranzeve"], "genres": ["Shooter", "Fighting"], "publishers": [], "esrb_rating": null}