{"id": 19805, "slug": "attack-of-the-labyrinth", "name": "Attack of the Labyrinth +", "name_original": "Attack of the Labyrinth +", "description": "<strong>NEW content in Attack of the Labyrinth +:</strong><br/>- 3 more secret levels<br/>- new enemies<br/>- 4 hidden characters<br/>- Right stick firing<br/>- player Level up system<br/>- AI path finding<br/>- re-balanced<br/>- boss HP bars<br/>- New Map System<br/>- Custom Keyboard Controls<br/><br/><strong>KILL MONSTERS. DESTROY EVIL. GET RICH.</strong><br/> <br/>The forces of evil have invaded the land. A labyrinth of evil has appeared in the kingdom and legions of monsters are pouring out of its vile depths. The king has called upon a small party of heroes, the Champions of Virtue, to vanquish the demon within and free the land from a grim fate! <br/>An action arcade game for 1-4 players. With the help of ancient magics and piles of gold, you must find the hidden relic in each area to reach the heart! Who can vanquish the evil within the Labyrinth, and who can escape with the most riches? <br/><br/><strong>GOT WHAT IT TAKES TO BE A CHAMPION?</strong><br/><br/>- Arcade shoot-em up action<br/>- Up to 4 players locally<br/>- play as a Knight, Wizard, Archer or Dragon!<br/>- dungeons are randomly generated<br/>- battle through 10 levels of the labyrinth to reach the heart of evil!<br/>- collect upgrades to help you mow down the forces of darkness!<br/>- Find powerful scrolls to aid your quest", "metacritic": null, "released": "2015-03-30", "tba": false, "updated": "2022-09-29T23:47:54", "background_image": "https://media.rawg.io/media/screenshots/1c7/1c78e376285c64a8da24d2eccfc84576.jpg", "website": "http://timedropstudios.com/attack-of-the-labyrinth/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 159}, "playtime": 3, "achievements_count": 16, "ratings_count": 2, "suggestions_count": 248, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Timedrop Studios"], "genres": ["Action", "Indie"], "publishers": ["Timedrop Studios"], "esrb_rating": null}