{"id": 19800, "slug": "kwaan", "name": "KWAAN", "name_original": "KWAAN", "description": "<strong>--- END TIMES ARE COMING ! YOU CAN DO SOMETHING ABOUT IT ! ---</strong><br/><br/>Become a Dwaal, a tiny agent of nature, and with the help of your community, care for the god tree known as the Kwaan : collect resources, sustain an entire ECOSYSTEM of flora and fauna, COLLABORATE and make friends with other members of the tribe... it's up to you to establish a NATURAL EQUILIBRIUM and SAVE THE WORLD !<br/> <br/>--- EXPLORE A VIRTUAL WORLD THAT WILL MAKE YOU BELIEVE PIXELS CAN LIVE! ---<br/><br/>A UNIQUE CONCEPT<br/>KWAAN is a hybrid of RPG, online ecosystem management and pixel-art creativity, where helping others and respecting nature are essential to survival ! At the heart of the game is an organic, evolving ecosystem, players must help each other to prevent the end of the world and uncover the many secrets of the god tree mysterious origin !<br/><br/>AN DAILY BATTLE<br/>Each day, the game checks the state of the god tree's mood. If Kwaan cries, the server will drown in tears and crash. The players must restart - keeping their experience ! If Kwaan is happy, the tribe will progress through events and will hopefully unlock all the secrets of the game. If not... <br/><br/>CONSTRUCT, ORGANIZE, DISCOVER<br/>To make Kwaan happy, develop its branches, summon animals, create flowers, fight the pollution, use your grappling hook explore and unearth the secrets... Each action has an influence on the world! Each day, a new narrative mystery will appear, revealing more information about the Kwaan and the origin of the tribe.<br/><br/>STUNNING PIXEL ART...<br/>Created in collaboration with Gary Lucken (AKA Army of Trolls), our Art Director, and music from David Kanaga.<br/> <br/>--- More info ----<br/>http://www.kwaan.org/<br/>http://www.twitter.com/Kwaan_Official<br/>https://www.facebook.com/KwaanOfficial", "metacritic": null, "released": "2016-01-21", "tba": false, "updated": "2019-09-17T12:41:42", "background_image": "https://media.rawg.io/media/screenshots/449/44983e1bcf6f0c204521936043e899af.jpg", "website": "http://www.kwaan.org", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 99, "toplay": 1, "dropped": 4}, "playtime": 1, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 238, "game_series_count": 0, "reviews_count": 2, "platforms": ["Linux", "macOS", "PC"], "developers": ["Ankama Canada"], "genres": ["Adventure", "RPG", "Massively Multiplayer", "Indie"], "publishers": ["Ankama Games"], "esrb_rating": null}