{"id": 19823, "slug": "sleep-attack", "name": "Sleep Attack", "name_original": "Sleep Attack", "description": "Enjoy an amazing new TWIST in Tower Defense! You control the layout of the battlefield, and you decide the paths your enemies follow! Build and place powerful turrets to attack invading enemies. Then rotate the battlefield to force foes down your preferred path of destruction. Be careful though, there are always multiple routes to control!<br/><br/>Combine tactical planning with strategic tower upgrades to slow, divert and damage your enemies. Carefully choose the placement and upgrade levels of your towers, as each turret possesses unique strengths and weaknesses. Simply swipe to change the routes your enemies take, allowing each tower to cause maximum carnage!Features<ul><li><strong>Control the terrain</strong> - twist and turn enemies route while your towers destroy them!<br/></li><li><strong>Nine tower types to construct and upgrade</strong>, each with their own strengths and weaknesses. <br/></li><li><strong>17 gruesome enemies with different abilities</strong>, ranging from the speedy Boardog to the gargantuan Ghost. <br/></li><li><strong>Six unique and beautifully designed dream worlds</strong> containing many epic levels to conquer.<br/></li><li><strong>Discover massive boss enemies</strong>, each with their own fearsome attacks and abilities.<br/></li><li><strong>Cast formidable spells</strong> to avoid defeat when the going gets really tough! <br/></li><li><strong>Beautiful dreamlike graphics</strong> take you on a vividly imagined journey.<br/></li><li>Improved visuals and gameplay changes for the PC version!</li></ul>", "metacritic": null, "released": "2015-05-28", "tba": false, "updated": "2020-12-16T14:18:27", "background_image": "https://media.rawg.io/media/screenshots/fb1/fb1f35ac65159126f36cc7caec242fc5.jpg", "website": "http://www.sleep-attack.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 106, "toplay": 1}, "playtime": 4, "achievements_count": 70, "ratings_count": 3, "suggestions_count": 175, "game_series_count": 0, "reviews_count": 3, "platforms": ["Nintendo Switch", "macOS", "PC"], "developers": ["Bad Seed"], "genres": ["Strategy", "Casual", "Indie"], "publishers": ["Plug In Digital", "Bad Seed"], "esrb_rating": "Everyone"}