{"id": 19836, "slug": "carnivore-land", "name": "Carnivore Land", "name_original": "Carnivore Land", "description": "Like to chew gum and shoot zombies? Yeah? Cause we’re all outta gum… luckily, there is no shortage of zombies, weapons and ammo in this damned city... Carnivore Land, come for the thrill stay for the kills!<br/><br/>Something smells rotten… it must be the zombies… oh yeah... there are zombies. Lot's of them... and bad guys that are trying to kill you... with guns, lots of guns... and cake, nope, scratch that, no cake (it’s a lie)... just zombies that are going to have a party on your corpse if they catch you! So, in a way… you are the cake...<br/><br/>Oh, and it’s all top down. Yeah, you look from above and shoot and kill and loot and... wait… what rhymes with kill? Anyway, you shoot some more and then...guess what! More loot! And you have a teammate. What? You thought we were gonna let you alone in a dark, cool looking, scary city, full of evil residents that either want to eat you alive or shoot you on sight? No, you have a teammate, that follows you around… and you do missions together fighting hordes of infected meat-cake wanting zombies and paramilitary groups.The StoryCarnivore Land is a 3D top-down shooter for Windows, Mac OS and Linux, developed in the Unity engine by dwCrew. The game flirts with the comedic horror genre and features fast paced action, tons of weapons to use and enemies to shoot.<br/><br/>Way after the zombie apocalypse and movie cliches, the war between humans and the infected has ended. Humanity now lives in safezones, while the rest of the world is filled with quarantined cities, mausoleums to the old society before the war, occupied only by paramilitary groups and zombies. Everything outside the safezones either wants to add you to his caloric intake or practice his marksmanship skills on your bloody corpse, hence the nickname of the world, Carnivore Land (#omg #captainobvious).<br/><br/>Along with your teammate, you are dropped into a city, that has been destroyed from the war, and are tasked with finding a mysterious package. But you’ll have to deal with the residents first, which include meat eating infected and paramilitary soldiers that play lets-fill-them-up-with-lead a lot.<br/><br/>To help in your struggle against the hordes of the undead and enemy soldiers, you are equiped with your standard issued rifle and pistol. However, due to unknown paranormal reasons (must be something they ate), sometimes when killed, the zombies drop various items for you to use. These items include some weapons (some? try over 30! yeah, over 30!), grenades, armor and silly hats (how can I look silly when I’m wearing a bloody top hat?).<br/><br/><strong>So, wear your helmet (or bucket), pick up your rifle (or boomstick) and try not to become a permanent citizen of Carnivore Land.</strong>", "metacritic": null, "released": "2016-03-09", "tba": false, "updated": "2019-08-28T22:08:59", "background_image": "https://media.rawg.io/media/screenshots/dae/dae2442ce01e743072a2cadb4423d7bf.jpg", "website": "http://www.carnivoreland.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 6}, "playtime": 2, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 458, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "macOS", "Linux"], "developers": ["dwCrew"], "genres": ["Action", "Indie"], "publishers": ["dwCrew"], "esrb_rating": null}