{"id": 198475, "slug": "tappy-battle", "name": "Tappy Battle", "name_original": "Tappy Battle", "description": "<p>Tappy Battle was designed as a mobile game where you strategically place units to fight across the battlefield, tapping to advance units and gain more gold for troops!</p>\n<p><strong>Instructions:</strong></p>\n<ul><li>If you have enough gold, you may drag a unit card out of your hand and onto the first column of the battlefield. </li></ul>\n<ul><li>To advance the turn, click the yellow arrow</li><li>When a unit reaches the enemy \"End Zone\" a laser will clear that row, and one  enemy health orb will be destroyed.</li><li>Use the classes and their abilities strategically to overwhelm your opponent and destroy all of their orbs</li></ul>\n<p><strong>Classes:</strong></p>\n<p><strong>Rogue:</strong> (Low Health, Low Damage) This unit is dextrous and sneaky, using shadows to move two squares at a time.</p>\n<p><strong>Warrior:</strong> (Med. Health, Med. Damage) This is the basic combat unit, good with a sword he can deal moderate damage piercing the two squares in front of him.<br/></p>\n<p><strong>Tank:</strong> (High Helath, No Damage) The armor-clad tank uses his shield for defense, soaking up damage for the units behind him. When he approaches a friendly unit, he will swap spaces to be on the front line.<br/></p>\n<p><strong>Mage: (</strong>Med. Health, Med. Damage) The mage prefers to cast from afar, and thus can attack any space directly around him, including into lanes next to him.<br/></p>\n<p><strong>Archer:</strong> (Med. Health, Med. Damage) The archer deals damage from a range of 3 spaces to a single target. Works best behind a tank!<br/></p>\n<p><strong>Credits:</strong><br/></p>\n<p>Bryan Lee - Engineer</p>\n<p>Mat Mason - Engineer</p>\n<p>Sebastian Sanchez - Artist</p>\n<p>Caughey Zachery - Producer</p>", "metacritic": null, "released": "2018-02-02", "tba": false, "updated": "2019-08-28T23:20:51", "background_image": "https://media.rawg.io/media/screenshots/5cf/5cfb43ebca8ad7f9fd8b4ef4203b0425.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 58, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Cocochanel972"], "genres": ["Strategy", "Fighting"], "publishers": [], "esrb_rating": null}