{"id": 19841, "slug": "eco-global-survival-game", "name": "Eco - Global Survival Game", "name_original": "Eco - Global Survival Game", "description": "<strong>Enter the world of Eco</strong>, where you must team-up to build civilization and prevent a disaster, using resources from a fully simulated ecosystem, where your every action affects the lives of countless species. <br/><br/>Will you and your fellow builders collaborate successfully, creating laws to guide player actions, finding a balance that takes from the ecosystem without damaging it? Or will the world be destroyed by short-sighted choices that pollute the environment in exchange for immediate resource gains? Or, do players act too slowly, and the world is consumed by a disaster that could have been avoided if you developed the right technology? In Eco, you must find a balance as a group if the world is to survive.A world-survival game Eco is a survival game in a global sense, where it is not just the individual or group who is threatened, but the world itself. The world of Eco will be home to a population of thousands of simulated plants and animals of dozens of species, each living out their lives on a server running 24 hours a day, growing, feeding and reproducing, with their existence highly dependent on other species. <br/><br/>Enter humans into this equation, and things get complicated. It is the role of players to thrive in this environment by using resources from the world to eat, build, discover, learn and invent. However, every resource they take affects the environment it is taken from, and without careful planning and understanding of the ecosystem, lands can become deforested and polluted, habitats destroyed, and species left extinct. <br/><br/>In the extreme, the food supply of the ecosystem can be destroyed, along with all human life on it, resulting in server-wide perma-death. Eco is a game where the player’s actions have meaningful consequences.<br/><br/><ul><li>Everything you do affects the ecosystem, and players can destroy their food supply and world (server-wide permadeath)<br/></li><li>Create a player-run government to make decisions as a group, proposing and voting on laws<br/></li><li>Use data gathered from the world to propose and vote on laws as a group. Debate with scientific argumentation.<br/></li><li>Create a player-run economy that allows you to sell not only good but services in the form of server-enforced contracts (simulating a player driven quest system).<br/></li><li>PvP takes the form of a player-run criminal justice system.  Breaking the player-made laws can result in arrest and punishment.<br/></li><li>Your food level determines your skill-increase rate, making food very important and tying players directly to the ecosystem from which it comes.<br/></li><li>A game with goals higher than entertainment. We plan to build it for schools as an augmented classroom world students share.</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2023-07-07T18:04:58", "background_image": "https://media.rawg.io/media/screenshots/534/5343f16115d76765856af7aa4e830cac.jpg", "website": "http://www.strangeloopgames.com/eco", "rating": 3.71, "rating_top": 4, "added_by_status": {"yet": 8, "owned": 278, "beaten": 5, "toplay": 11, "dropped": 13, "playing": 1}, "playtime": 10, "achievements_count": 28, "ratings_count": 28, "suggestions_count": 343, "game_series_count": 0, "reviews_count": 28, "platforms": ["PC"], "developers": ["Strange Loop Games"], "genres": ["Adventure", "Simulation", "Indie"], "publishers": ["Strange Loop Games"], "esrb_rating": null}