{"id": 198481, "slug": "infestation-itch-xenonnsmb", "name": "Infestation (itch) (XenonNSMB)", "name_original": "Infestation (itch) (XenonNSMB)", "description": "<p>Infestation is a text-based adventure game that uses procedural generation to randomly create a world filled with towns, locations, items, and monsters. Your goal is to help stop an infestation of hostile creatures by ridding the world of as many monsters as you can until you eventually get killed by one of them. I would definitely add more strategy to this if I had more time, but for now it's kinda a demo of how random generation can make games more interesting. And it's fun for a bit of novelty. It gets pretty frustrating though. Created for #PROCJAM summer 2018!</p>\n<p><strong>Tips</strong></p>\n<ul><li>Avoid monsters if you aren’t prepared to deal with them. The only thing you gain from slaying them is making your slain counter go up, and while that is a satisfying prize, you’re better off collecting items and exploring then trying to get into combat. You’ll likely get into combat anyway by monsters attacking you preemptively, and so you’ll still get plenty of combat from that; and when you’re well prepared, feel free to pick fights.</li><li>Pick up every item. There is no reason not to grab one. Weapons you find will always be better than your current weapon, so don’t pass them up.</li><li>The purpose of towns is to heal you to 10 HP for free if you have 4 hp or less (and also because I wanted to make a random town name generator.) If you find a town, you can come back there whenever you want to get healed.</li><li>Again, DON’T PURPOSEFULLY START COMBAT UNTIL YOU’RE REALLY STRONG. Instigating combat before getting a lot of items ends most runs. You have no way of knowing how strong an enemy is until it attacks you.</li><li>A couple times I’ve screwed myself over by accidentally clicking Defend instead of Attack. Don’t make my mistake.</li></ul>\n<p>If you have feedback put it in the comments. Thanks for playing!</p>", "metacritic": null, "released": "2018-06-26", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/66b/66b0acb6c96b32d0d7af46703a52af6c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 4, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["XenonNSMB"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}