{"id": 19852, "slug": "the-bottom-of-the-well", "name": "The Bottom of the Well", "name_original": "The Bottom of the Well", "description": "The Bottom of the Well <br/>\r\nA visual novel where Alice steps into a different kind of wonderland. <br/>\n<br/>\r\nIn The Bottom of the Well, you play as Alice who has just had an unsettingly life-like dream about the end of the world. She retells her experience to her friend in a huge, branching narrative. Although a single play-through might take as little as 20 minutes, experiencing all the possible paths Alice can take through the ruins of her city will take you many hours. <br/>\n<br/>\r\nThe game is intended to be replayed several times with different permutations of Alice: try playing as a survival-minded lone-wolf, or a social butterfly, or why not attempt the difficult but rewarding romantic route? The stats you select for your Alice in the beginning of the game influences everything from small comments to major choices. <br/>\n<br/>\r\nThis is an updated, reworked and improved version of my entry to the WAG (Write A Game) Challenge arranged by IGDA's Game Writing SIG, where it placed first in the amateur category. The jury had this to say: <br/>\n<br/>\r\n- WINNER: THE BOTTOM OF THE WELL <br/>\r\nThe Bottom of The Well delivers an entertaining, branched story with interesting options. Alice's dream is genuinely terrifying. The conversations feel natural and appropriate. Players can randomize their character stats, but still negotiate the game with deliberate and meaningful choices. The final game stats give The Bottom of the Well immense replay value. One judge played the game several times to find the \"best\" ending!", "metacritic": null, "released": "2016-03-03", "tba": false, "updated": "2024-04-09T09:34:18", "background_image": "https://media.rawg.io/media/screenshots/398/39867ec92b9b8dd53ebc3c46c61c5d9a.jpg", "website": "http://www.rednettlestudio.com/", "rating": 3.2, "rating_top": 3, "added_by_status": {"yet": 10, "owned": 280, "beaten": 4, "dropped": 3}, "playtime": 1, "achievements_count": 12, "ratings_count": 10, "suggestions_count": 261, "game_series_count": 0, "reviews_count": 10, "platforms": ["Android", "macOS", "PC"], "developers": ["Wolfrug", "Red Nettle Studio"], "genres": ["RPG"], "publishers": ["Red Nettle Studio"], "esrb_rating": null}