{"id": 198505, "slug": "theteorite-yin-shi", "name": "Theteorite -印石", "name_original": "Theteorite -印石", "description": "<p>A strategy game conceived from an amazing Famicase design:<br/>http://www.famicase.com/17/softs/027.html</p>\n<p>Famicase Art by Isaac Wong.</p>\n<p>\"Developer art\"  and development by Stencil Chris for A Game by its Cover 2017 Jam. This game is not complete and will likely remain that way. Will also be submitted for September 2017 #1GAM!</p>\n<p>Music by Eric Matyas<br/>www.soundimage.org</p>\n<p>\n<strong>Story</strong><br/>Play as our nameless protagonist, a wanderer whose only goal is to reach the top of the Tower of Hunger and find LA CRIMA, a stone fabled to be able to restore light to his world. Your only goal is to ascend the Tower of Hunger by reaching the stairs - kill monsters if you want, but run out of lives and you lose the game. It's a challenging chess-style game!\r\n</p>\n<p>\n<strong>Controls</strong>: <br/>\r\nClick Blue Marker - Move to location<br/>\r\nClick Red Marker - Move to location and kill monster<br/>\r\nHover over Monster - View monster range in green<br/>\r\nClick yourself - Skip your move\r\n</p>\n<p>\n<strong>Hints</strong><br/>\r\n- Click on yourself to skip your move!! Its a very important mechanic, as monsters almost always move on their turn<br/>\r\n- You start out with only one life. At a couple key levels you gain an extra life, and if you acrue 100+ monster kills you can trade them in for an extra life next time you start the game.<br/>\r\n- Monsters always move on their turn (99% of the time at least) - use that to position them away from you<br/>\r\n- Hover over new monsters to learn their movement patterns. This is key for survival.<br/>\r\n- You don't have to kill all the monsters to move to the next floor!!<br/>\n</p>\n<p>Enjoy!</p>", "metacritic": null, "released": "2017-09-21", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/571/571c4f152cd920db32d573867f79514f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 57, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["stencil chris"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}