{"id": 198583, "slug": "agent-zer0", "name": "Agent Zer0", "name_original": "Agent Zer0", "description": "<p>This is an alpha for an arcade shooter similar to Call of Duty™ Nazi Zombies . I am open to suggestions, so email me at thelordofgamers@gmail.com, or post them in the discussion board below.</p><p>Play game HERE</p><p>-----COMBAT UPDATE-----</p><p>This is a bit of a big update, it's slightly unfinished but I wanted to put SOMETHING out there.</p><p>* Revamped how enemies attack, instead of bumping into you they will swing their arms at you! (Attack animation is a placeholder). If you are hit you will temporarily be stopped for a second, so getting trapped in a large horde of enemies is bad.</p><p>* Revamped how the gun store looks.</p><p>* Started work on implementing EXP, levels, and a skillpoints system. The more you level up the harder enemies will be, they will have higher health and hit harder. You will obtain skill points per level to increase things such as: Reload speed, health, damage, and more. Weapons will increase in stats as your level goes up.</p><p>* Enemies now have more health and hit harder as waves increase</p><p>* Made blood look a LOT better, and it now \"sticks\" to walls</p><p>* Hidden the \"attack boxes\"</p><p>* Fixed the bug where attack boxes dissappear</p><p>* Bullets now collide with walls</p><p>* Slightly changed the \"level\" to prevent being able to hold one angle indefinitely</p><p>* Some more things I forgot about</p><p>-----To Do-----</p><p>Fix pathfinding, sometimes it's buggy.</p><p>Implement the rest of the guns into the gun-shop.</p><p>Create the town and \"battlefield\" map.</p><p>Add dialogue to the NPC's.</p><p>Sometimes the enemies' attack boxes disappear, I think I know why.</p>", "metacritic": null, "released": "2016-04-27", "tba": false, "updated": "2019-08-28T23:20:50", "background_image": "https://media.rawg.io/media/screenshots/e22/e22c1d7e0702c729045d4962dc97c821.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 5, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["thedude1693"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}