{"id": 19851, "slug": "cyberlink-power2go-10-platinum", "name": "CyberLink Power2Go 10 Platinum", "name_original": "CyberLink Power2Go 10 Platinum", "description": "Power2Go delivers end-to-end functionality for all burning, backup and conversion needs. Incorporating advanced disc burning with military-grade encryption, Power2Go also provides advanced media conversion for music and video files, covering the broadest range of device and media player profiles. With Facebook, Flickr, YouTube &amp;amp; Vimeo integration, you can effortlessly download, convert, and back up your social media content, or your most treasured videos.<strong>Features:</strong><br/><ul><li><strong>BURN &amp;amp; CREATE</strong><br/>Create your own personal compilations in moments<br/>Power2Go’s advanced burning engine makes it a snap to burn CDs, DVDs and Blu-ray discs — even the latest 128GB BDXL discs. Duplicate CDs, unprotected DVDs and Blu-ray discs by burning 1:1 copies of your discs. Save a copy of a disc to your hard drive as a disc image and later burn the images back to disc.<br/><br/><br/></li><li><strong>CONVERT &amp;amp; TRANSFER</strong><br/>Support for over 150 portable device profiles<br/>Smart Detect technology solves the problem of confusing file formats and resolutions.. As soon as you connect a device to your PC, Smart Detect recognizes it and sets the optimal output formats and resolutions for converted media, ensuring best possible quality. The free companion App, Power Media Player, delivers superior playback quality.<br/><br/></li><li><strong>BACK UP &amp;amp; PROTECT</strong><br/>Download, convert and back up social media content and favorite videos<br/>Enjoy your favorite videos anytime. Search and download videos from YouTube and Vimeo to your hard drive, or burn them directly to disc to watch when you want. Securely back up, and be in complete control of your personal online media content with easy backup from Facebook and Flickr.<br/></li></ul><strong>Trusted by leading PC and burner manufacturers</strong>Global PC and burner manufacturers depend on Power2Go’s robust ability to burn mixed media onto any disc type. Easy-to-use and packed with innovative features, the added system recovery and data encryption functions make Power2Go the smart choice for your system.", "metacritic": null, "released": "2016-02-01", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/508/5086be6d4ff238781dc3fc79073a1e00.jpg", "website": "http://www.cyberlink.com/products/power2go-platinum/features_en_US.html", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 166, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["CyberLink"], "genres": [], "publishers": ["Koch Media", "CyberLink"], "esrb_rating": null}