{"id": 19869, "slug": "bombshell", "name": "Bombshell", "name_original": "Bombshell", "description": " From the creators of Rise of the Triad and legendary game maker 3D Realms comes Bombshell, an action shooter game. Bomb disposal technician turned mercenary for hire, Shelly \"Bombshell\" Harrison must strong-arm her way across 4 planets in an Unreal Engine-powered galactic adventure to rescue the president from an apocalyptic alien threat. With out-of-this-world enemies, a never-before-seen arsenal of devastating weaponry and a host of genre-crossing mechanics, Bombshell is set to blow you away.Features<br/><strong>History in the Breaking</strong><br/>Be part of Bombshell's debut as she fights to save the president and her people from a maniac's mechanical monstrosity.<br/><br/><br/><strong>Brave New Worlds</strong><br/>Traverse the dying world of Kyrron as it's consumed by its neighboring sun, discover the secrets of a civilization frozen in time on the distant world of Zeroth and travel to the epitome of technology -- a villain's vision which threatens to consume all that exists.<br/><br/><br/><strong>Robot-Armed and Dangerous</strong><br/>Shell, shock and shatter your way through vicious, bloodthirsty predators, an augmented alien species, and the remnants of an ancient race re-animated, with more than 10 weaponized arm modifications.<br/><br/><br/><strong>Heavy Handed</strong><br/>Fierce finishing moves and interactive environments make Bombshell as dynamic as she is deadly.<br/><br/><br/><strong>Isometric Ingenuity</strong><br/>Brilliantly brutal isometric shooting layered with some classic role-playing mechanics, including experience points, upgrades, side quests, and non-linear levels. All with a twist of first-person shooter mechanics.<br/><br/><br/><strong>What Are You Lookin' At?</strong><br/>Yeah, she has a robot arm. Deal with it.", "metacritic": 43, "released": "2016-01-28", "tba": false, "updated": "2022-08-05T10:08:49", "background_image": "https://media.rawg.io/media/screenshots/ef8/ef8523868578776348297f2e776f3149.jpg", "website": "http://www.bombshell.com", "rating": 2.43, "rating_top": 1, "added_by_status": {"yet": 15, "owned": 188, "beaten": 7, "toplay": 4, "dropped": 3, "playing": 1}, "playtime": 7, "achievements_count": 39, "ratings_count": 13, "suggestions_count": 631, "game_series_count": 0, "reviews_count": 14, "platforms": ["macOS", "PC"], "developers": ["Interceptor Entertainment", "Denki Gaka"], "genres": ["Action", "Shooter", "Adventure", "Strategy", "Casual"], "publishers": ["3D Realms", "Denki Gaka"], "esrb_rating": "Mature"}