{"id": 198620, "slug": "drip-drop-gordoniankid", "name": "Drip Drop (gordoniankid)", "name_original": "Drip Drop (gordoniankid)", "description": "<p>Narrative: Pamu (The main Character) is on a quest to save his village. He is a cute, colorful courageous Paintomians. Paintomians is a race that brings color and joy to everything in the world, without them the world will be dull, dark and lifeless. An evil villain called Dr.Thinner wants to change that. He wants the world to be in black and white where there is no color. What is Dr.Thinner true intentions? What does he want? One day in Pamus village, Dr.Thinner has wiped out every color within its reach. Although this happened Pamu has not lost his color therefore his job is restore to color back to his village and the world. Pamu will go through countless obstacles and have to solve many puzzles to save his people and restore color to Kalula village.</p><p>Pamu has the power to shape shift his size. Changing his size gives him both a negative and positive depending on the situation. For example, if Pamu is small, he can go through pipes and many small holes. However if he is in a bigger state he can break or even push large item in his way. These core mechanics is what makes the game. </p><p>Use the A and S or Left and Right Arrow keys to move, Up Arrow Key to increase in size, and Spacebar to Jump, you can also jump off of walls</p><p>Made by:</p><p>Programmers: Jesus,Onyx</p><p>Level Designer and Sprite Animator: Lorick</p><p>Sound Design: Kenny</p>", "metacritic": null, "released": "2017-05-17", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/4df/4df0b27e1875888c1cd867d6a383f726.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 29, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["gordoniankid"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}