{"id": 198727, "slug": "please-help-me", "name": "please help me", "name_original": "please help me", "description": "<p>Sorry for not putting a description up when I uploaded this, I was in a pretty bad state of mind and just needed to get it out somewhere, somehow. This isn't exactly intended to be a polished thing, it's very much of its moment and I don't intend to go back to it.</p><p>I fired off this game a couple of days ago because my course isnt going that well, and I needed a way of expressing what I was feeling. I didn't have the mental capacity to redraft a short story, and I don't have a place to even put short stories, and since games are the best way of communicating an experience, and Twine is the fastest most versatile game making tool i know of, I slammed together 'please help me'. I'm doing ok now, I am pretty sure I'm going to leave my course and my family/friends are very loving and supportive.</p><p>UPDATE 27/11/16</p><p>I am much better now! I'm halfway through the process for quitting my Computer Science course, and I'm going to transfer to my uni's Theatre Arts course, which is pretty respected, I hear. I'm going to live at home for a year, and then go back in September, but I've already rejoined my old drama group and I am so happy to be back.</p><p>UPDATE 21/03/17</p><p>I am nearly recovered. I auditioned for my uni's drama course but didn't get in, unfortunately. However, I am going to look for another drama school and try to get in either by clearing this year, or by doing actual auditions next year. I' in two plays at the moment and I'm planning to run a Twine workshop next month. I am so, so happy.</p>", "metacritic": null, "released": "2016-11-04", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/b87/b87ac8e7bcd438ac533e47befd8471c6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 10, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["piratescarfy"], "genres": [], "publishers": [], "esrb_rating": null}