{"id": 198894, "slug": "claude-van-clamme-presents-agent-poing-pnguins-ter", "name": "Claude Van Clamme Presents: Agent Poing P.N.Guin's Terrible Penguin Panic - Ice Edition", "name_original": "Claude Van Clamme Presents: Agent Poing P.N.Guin's Terrible Penguin Panic - Ice Edition", "description": "<p>WANS submission for Ludumdare-42's 72 hour game jam.<br/></p>\n<p>The story so far:<br/><br/></p>\n<p>The year is 2052 and Special Agent Poing P.N.Guin has been sent into the Headquarters of Club Penguin in an effort to bring back the platform and get to the bottom of whether it was a front for evil deeds, despite the heavy nostalgia trip of his childhood he was successful infiltrating the Headquarters and was enjoying himself in the Club Penguin coffee shop when a Puffle bit his toe. This startled Agent Poing P.N.Guin and he yelled out a torrent of abuse towards the culprit Puffle. <br/>The resulting profanity sent the \"Ultimate Safe Chat\" sentinels into meltdown, immediately charging towards Agent Poing P.N.Guin in unprecedented fashion. Due to his years of training in the Penguin Secret Service, Agent Poing P.N.Guin survived the initial onslaught and made his way out onto the Antarctic ice fields, lost and with no sign of his evac helicopter Agent Poing P.N.Guin began his ascent up one of the ice cliffs nearby in hope of getting signal to his satellite phone. Halfway up the mountain, the Moderators of Club Penguin deployed their ultimate weapon, after years of global warming being blamed on cars and factories the real culprit was finally revealed... <br/>Club Penguin had been running its generators on the emotions of its tween players which, when coalesced into physical form, just became a seething mass of angry hatred and burgeoning sexual frustration, in other words... Lava. Agent Poing P N Guin, still tasked with infiltrating this deadly lair, now has to contend with escaping a rush of fiery, burny, gross emotions that threaten to destroy his emotional stability and turn him into... An emo. Your mission is to complete Agent Poing's primary mission - getting him to the top of the ice mountain - whilst ensuring he doesn't succumb to the emotional lava chasing him along the way.</p>\n<p>Credits:\r\n</p>\n<p>Rob 'Carpster' Stacey - Professional artist, UI graphic artist, some programming, audio effects</p>\n<p>Scott 'Coconut Clusters' Herod- Project Lead, some programming or something</p>\n<p>Robert 'No nickname' Mason- Procedural generation program man\r\n</p>\n<p>David 'Buckets' Mason- Bad Music Man, title screen art, a little programming\r\n</p>\n<p>Woj ''No show' Rak - Was not here</p>\n<p>Thanks to Anchovy for use of triangulon licence</p>", "metacritic": null, "released": "2018-08-13", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/120/120ae78fa120061eeb530e8c5467b914.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 26, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["We Are Not Spies"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}