{"id": 198856, "slug": "stableincomplete-boyd-camp-defender", "name": "[Stable/Incomplete] BOYD - Camp Defender", "name_original": "[Stable/Incomplete] BOYD - Camp Defender", "description": "<p>Camp Defender was a \"REVAMPED\" version of another game I have yet to upload because of its updated set of code rather drag and drop.</p><p>The real game was a birthday game that was for 3 friends so I made it a whole other thing and I decided that I wanted to revamp it a bit and I did.</p><p>There is only two characters in this game and you CHOOSE them by CLICKING on them with your mouse. The white-haired one is an EASY character, the black-haired one is a HARDER character and they both have unique game play.<br/></p><p>RULES AND INSTRUCTIONS (and tips):</p><p>- The second the slime hits the top lining, you take damage.</p><p>- The difficulty gets harder as you survive longer.<br/></p><p>- The number thats under your ultimate indicated how many time you can use it, so its essentially not all that COOLDOWN based, after all the cooldown is pretty short. Not to mention the ultimate doesn't require mana to use it.</p><p>- Killing slimes can give ULT EXP and Mana by collecting orbs it drops.</p><p>- I can't think of anymore, so I'll answer any questions in the comment box if needed.</p><p>CONTROLS: Mouse (Left click to shoot... Move to aiim), WASD to move, 1-3 for basic abilities, and 4 for ultimate.<br/></p><p>CHARACTER EXPLANATION:</p><p>Snow... </p><p>Passive: Basic attack and abilities apply a very short AOE slow. Also has increased mana regeneration.</p><p>Snow Boulder: Launches a large snowball towards cursor's direction. It's attack and speed is increased during Snowy Ground.</p><p>Snowy Ground: Frosts up the field causing you to attack faster and interacts with the Snow boulder.</p><p>Snowfall: Places a snowfall at cursor making slimes slide down it.</p><p>Snowstorm: Casts a bizzard to slow ALL enemies and deal little damage over the duration.</p><p>Poision/Dark...</p><p>Passive: After casting an ability, gains stackable movement speed.</p><p>Poision Fog: Leaves behind a cloud of poison dust behind dealing little damage overtime.</p><p>Dark Extract: Forcefully extracts the poison out of the slimes dealing heavy damage. Only used on slimes who are afflicted with poison.</p><p>Poison Puddle: Places a growing poisonious puddle that slows and deals very little damage.</p><p>Shadow Bomb: For a few seconds, places a shadow bomb every half a second that will indefinitely obliterate slimes. <br/></p><p>SLIME EXPLANATIONS:</p><p>Blue: Normal Slime.</p><p>Red: Speed Slime (Twice as fast, half health)</p><p>Green: Immune Slime (Cannot be affected by slows, twice as strong)</p><p>Orange: Tank Slime (Takes less damage from basic attacks, and is slower)<br/></p><p>UI: Green = Health, Blue = Mana, Purple = ULT EXP (explained earlier)</p><p>The timer shows how long you've survived for, the number to the right of your abilities indicates the MANA COST and the number under your ULTIMATE shows how many times you can use it. Buttons are self explanitory. <br/></p><p>RESOURCES:</p><p>I used CHIBI maker for the images when choosing character and RPG maker to create the sprites and grassy background/wall. Sound effects from several places, I forgot.<br/></p>", "metacritic": null, "released": "2016-06-18", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/8e9/8e9a6b9cb3b04af8ca7f793d0aa76039.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 35, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Kymarai"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}