{"id": 19885, "slug": "princess-edge-dragonstone", "name": "Princess Edge - Dragonstone", "name_original": "Princess Edge - Dragonstone", "description": "<strong>Story </strong><br/>Hundreds years ago an ancient black dragon wreaked havoc in the realm of Arelia, bringing despair and calamity in to the land. A brave barbarian princess gifted with magic and prowess fought the dragon and used her body and soul to seal it for eternity. Or so it would seem ... a horde of dark legion managed to break the seal and free the ancient black dragon, bringing it's terror into the land once again. However a glimmer of hope remains .. unknown to them, with the destruction of the seal the brave barbarian princess also materialize once again in to this world. <br/><br/><strong>Gameplay </strong><br/>Princess' Edge - Dragonstone is a beat'em up inspired by Golden Axe, however unlike the usual beatemup it use the 3 planes system similar to Guardian Heroes. <br/><br/><strong>The game features: </strong><br/>- 5 stages <br/>- 9 types of normal enemies &amp; 5 bosses <br/>- plenty of special techniques are available at your disposal <br/>- backstab system, get behind your opponent and strike them for more damage <br/>- mounted combat system. Ride the dragon! <br/>- smooth animation and control <br/>- gamepad and keyboard are both supported <br/>- 3 difficulty settings <br/><br/>Default keyboard control (can be changed in option): <br/>z: magic <br/>x: attack <br/>c: jump <br/>v: dash", "metacritic": null, "released": "2016-05-19", "tba": false, "updated": "2019-08-28T22:08:57", "background_image": "https://media.rawg.io/media/screenshots/606/60639de1b6a1f5b6a768f0aebc14c143.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3, "toplay": 1}, "playtime": 2, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 317, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["erobotan"], "genres": ["Action", "Indie"], "publishers": ["erobotan"], "esrb_rating": null}