{"id": 19881, "slug": "flesh-eaters", "name": "Flesh Eaters", "name_original": "Flesh Eaters", "description": "<p>Flesh Eaters is a real-time strategy zombie survival game developed by 16 Bit Nights. There is no plot present in the game. Just plain old survival.</p>\n<h3>Gameplay</h3>\n<p>Flesh Eaters features a retro pixel-art style. The game revolves around controlling a team of survivors that defends their shelter, goes out for scavenging resources and staying together.</p>\n<p>It is necessary to build up your defenses as zombies profoundly affect the team&#39;s morale. If the morale falls too low, the team&#39;s members might attempt suicide, or refuse the orders you give them. It is possible to level up your survivors. Upon leveling them up, their health, morale, and weapon handling skills get increased.</p>\n<p>Each survivor has their own skills. It is possible to hire a medic to treat the team&#39;s wound, a soldier to defend a specific area assigned to them, or an engineer to build up the base defenses. The medics and engineers can only equip melee weapons, while only the soldiers can only equip armor sets and firearms.</p>\n<p>The players have to get out their hideout to get new supplies such as food, water, and ammo. It is possible to find new weapons and armor during such scavenger raids. The weapons you find can be further upgraded by an engineer. Upon upgrading, the weapons might acquire a rare damage stat, that will one-kill any zombie you find in the game, yet the chance of that happening is very low.</p>", "metacritic": null, "released": "2016-05-03", "tba": false, "updated": "2023-04-14T13:23:14", "background_image": "https://media.rawg.io/media/screenshots/816/816e0c769b29a66c053c21e15033f022.jpg", "website": "https://www.facebook.com/Zflesheaters", "rating": 1.74, "rating_top": 1, "added_by_status": {"yet": 37, "owned": 941, "beaten": 4, "toplay": 1, "dropped": 13}, "playtime": 4, "achievements_count": 9, "ratings_count": 38, "suggestions_count": 150, "game_series_count": 0, "reviews_count": 38, "platforms": ["PC"], "developers": ["16bit Nights", "S.C. 16 BIT NIGHTS"], "genres": ["Action", "Adventure", "RPG", "Simulation", "Indie"], "publishers": ["Back To Basics Gaming", "S.C. 16 BIT NIGHTS"], "esrb_rating": null}