{"id": 199056, "slug": "just-keep-sleeping", "name": "Just Keep Sleeping", "name_original": "Just Keep Sleeping", "description": "<p><strong>Controls:</strong></p>\n<p>    -1 + 2: Primary and Secondary weapons, respectively</p>\n<p>    -LMB: Shoot</p>\n<p>    -A + D: Move left and right</p>\n<p>    -W + S: Move up and down the staircase (Yellow thing for now)</p>\n<p>   - R: Reload weapon</p>\n<p>    -E: Hold to refill ammo at the ammo crate (it takes 5 seconds)</p><p><strong>[UPDATE 4]</strong></p>\n<p>As much of a learning experience this was, this project won't be updated frequently anymore. This was my first game and the programming is sub-par and difficult to work with and my next project will definitely benefit from this experience. </p>\n\n<p>As a short postmortem for this game I will say that though I'm proud that I've actually made something, it could have been much better. Areas that I neglected where physics, the story,  and the UI. I was always paranoid about functionality and file sizes so I adopted a physics-less game with as many manual movements as I could fit in. The UI was something that implemented late and had to work around my game rather than working my game around the UI.</p>\n<p>The idea for the game wasn't one of my biggest ideas which is why I chose for the jam. I wish I could expand upon the world but I keep coming to a grinding halt trying to work on everything at once. I think next time I'll work on the story first but learning how to program with flexibility in mind is something I'll be trying to do from now on.</p>\n\n<p>I'm not one to come up with small, workable project ideas and this game was definitely out of scope for my abilities. In the future I may come back and build this project from the ground up. </p>\n<p><strong>[UPDATE 3]</strong></p>\n<p>-Pulled back the camera to see the whole apartment</p>\n<p>-Added sounds for the guns</p>\n<p>-Added a shadow overlay for the hallways</p>\n<p><strong>[UPDATE 2]<br/></strong></p>\n<p>-Difficulty settings work</p>\n<p>-Enemy spawning is more wave-like</p>\n<p>-Enemy health and damage changes</p>\n<p>-Added a vignette</p>\n<p>-Enemies now take time traversing the stairs instead of insta-teleporting to the attic<br/></p>\n<p><strong>[UPDATE 1]</strong></p>\n<p>-Added a main menu. The difficulty setting doesn't work at the moment but the weapon choosing does. </p>\n<p>-Added an ammo crate on the ground floor. Hold E to refill your current weapons ammo.</p>\n\n<p>What happened to the world is unknown. What happened to the people, how they became like that is unknown. The future is dark, the sun has disappeared.  What will happen to us is unknown. All I can do now is to protect my family. I've told them that no matter what happens. No matter what you hear. Just. Keep. Sleeping.</p>\n\n<p>How long can you last?</p>\n\n<p>If you're interested in the future of this game then please add it to your collections! Progress will be updated on my twitter: https://twitter.com/zedthedev</p>", "metacritic": null, "released": "2017-08-05", "tba": false, "updated": "2019-08-28T23:20:50", "background_image": "https://media.rawg.io/media/screenshots/39c/39c88a1f50543fcbfdfbcbdbcf0c7335.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 37, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["PapaZev"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}