{"id": 199035, "slug": "galacticax", "name": "GalacticaX", "name_original": "GalacticaX", "description": "<p>This game doesn't work on Windows 10 or above</p>\n<p>What is the game about and what are it's features?</p>\n<p>this game is about you(the spaceship) eating and growing in mass, due to the effects that the fuel and planets give you once they are consumed of course.</p>\n<p>as soon as you eat the planets, bounty hunters will come and seek your head for murder, they will seek you even if you don't harm any planets(that is because you are wanted throughout the galaxy).</p>\n<p>there is a gui in the top right side of the in game scene, there you can see your score, warning, and status in the game.</p>\n<p>there is a restart and back to main menu button to either restart the in game scene, or to go back to the main menu.</p>\n<p>Helpful Hint: You(Spaceship) = A Green Circle, Fuel Is Also Green But Smaller, Planets = Random Colored Circles, Bounty Hunters = Dark Blue Circles.</p>\n<p>What are the physics?</p>\n<p>The player is controlled by the mouses x, and y axis, each time the mouse is moved the player will follow it, Warning the bounty hunters also follow the mouse so be careful.</p>\n<p>the more you eat the bigger you will get.</p>\n<p><strong>UPDATE:</strong><br/></p>\n<p>Added in 2 new objects into the game, Shield Alpha, and Shield Beta, both objects eat bounty hunters, but remember the bigger you are the harder it is to fit in the shields.</p>", "metacritic": null, "released": "2017-12-02", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/d09/d09b2f73db56fa0311533bdfda95754b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 70, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["CataclysmicXGames"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}