{"id": 199054, "slug": "rais-ali-delvari", "name": "Rais Ali Delvari", "name_original": "Rais Ali Delvari", "description": "<p>Rais Ali Delvari was an independence fighter and anti-British colonialism activist now remembered as the national hero of Iran, who organized popular resistance against the British troops, which had invaded Iran in 1915.<br/></p><p>In World War I, Iran was neutral . In reality, Persian forces were affected by the rivalry between the Allied Powers and the Central Powers and took sides based on the conditions. Western interest in Persia was based on its significant oil reserve and its strategic situation between Afghanistan and the warring Ottoman, Russian, and British Empires. Persia was divided into northern and southern spheres of influence under the Anglo-Russian Treaty of 1907. The treaty defined their respective spheres of influence in Iran and Afghanistan and provided a counterweight to German influence.This treaty was widely viewed by Iranians as having made the nation into nothing more than a British and Russian protectorate, so during the World War I, many local rebellions occurred in Iran against the British and Russian forces participating in war against Central powers of World War I.In Northern Iran, Jangal movement of Gilan, was the main operating local force against the British and Russians forces, and in Southern Iran, Qashqai, Tangistani and Laristani tribes were the main resisting power against the British empire. In both Southern and Northern movements, Persian Central Government Gendarmerie supported the rebels<br/></p><p>see more:</p><p>https://en.wikipedia.org/wiki/Rais_Ali_Delvari</p><p><strong>base on true story</strong></p>", "metacritic": null, "released": "2015-10-31", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/195/195a75d22b1514c5c7653ec103de5421.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 193, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["sajioo"], "genres": ["Action"], "publishers": [], "esrb_rating": null}