{"id": 199280, "slug": "inv-vr", "name": "INV VR", "name_original": "INV VR", "description": "<p>So I just got my VR head set. Decided I would like to test some ideas I had floating around in my head for years. That's not a good thing btw :P</p>\n\n<p>\n</p>\n<p>Mostly I'll focus on stuff that helps with exploration and investigations (big fan of those ^^)</p>\n\n<p>\n</p>\n<p><strong>Controls (Up till now):<br/></strong></p>\n\n<p>\n</p>\r\nControlActionRight D-pad in right controller\r\nScene RotationLeft D-pad in left controllerScene RotationTriggerGrab Green Things :P\r\n\n<p>\n</p>\n<p>\n</p>\n<p>Current ideas:</p>\n\n<p>\n</p>\n<p><strong>Free walk locomotion:<br/></strong></p>\n\n<p>\n</p>\n<p>Yes, of course I'm going to try this :P I'm waaaay too cool to teleport or use the the touch pad :P I want \"WALK\"  all the way form A to B. <br/></p>\n\n<p>\n</p>\n<p>Not as smooth as I was hoping for, and I can see how ppl can really hurt themselves with this, but I still think its a step in the right direction.</p>\n\n<p>\n</p>\n<p>Basically, by holding any of the triggers you will lock the map y-rotation to your controller. You will rotate the whole map around you by moving the controller.</p>\n\n<p>\n</p>\n<p>How does this help? Will, if you keep you arm in front of you while you rotate your whole body, you will get the illusion that you are not rotating at all, because the map is rotating with you. This happens while you still have the freedom to move around on the xz plane.</p>\n\n<p>\n</p>\n<p>So how do I <strong>actually </strong>walk? 3 words: PLAY AREA BORDERS. By using the play area borders as a guide and walk along them while holding the trigger down (and keeping your arm in the same place at all times), you'll give yourself the notion of moving continuously forward.</p>\n\n<p>\n</p>\n<p>I know, its not really that clever, but I think I can make it work if I put more work into it.</p>\n\n<p>\n</p>\n<p><em>A few notes of observations:</em></p>\n<ul><li>It goes without saying, SLOW DOWN. You have no idea how disorienting it could get if you move fast. Move at your normal pace, or even slower.</li><li>You may want to consider changing the color of your play area border to something more clear, like RED. The blue color doesn't work very with the white background.</li><li>If you play with it long enough, you can get a bit clever by positioning yourself more accurate by rotating the map around you.</li><li>You will get tired. I took  a walk around the map and started sweating. You can't tell how far things are till you actually get there :P</li><li>You will get in the habit of moving clock/counter-clock wise around the play area. That will put pressure on one of your knees if done for a long time. Consider rotating the other way form time to time to avoid this.</li><li>This works better with wider play areas. Be careful if your the play area is small.</li></ul>\n<p>\n</p>\n\n<p>Will add more in the future :)\r\n</p>\n<p>\n</p>", "metacritic": null, "released": "2018-02-18", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/7d8/7d8f085757f93aabd1cf3a13f3ba8d4c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 2, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Fare.is.Fare"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}