{"id": 19932, "slug": "arma-gold-edition", "name": "ARMA: Gold Edition", "name_original": "ARMA: Gold Edition", "description": "<p>ARMA: Gold Edition is a first-person tactical military shooter simulator developed by Bohemia Interactive Studio. Gold Edition includes the expansion pack named Queen&#39;s Gambit. </p>\n<h3>Setting</h3>\n<p>A fictional island of Sahrani is divided into two parts: a communistic north and a democracy established in the south. The U.S. armed forces that participated in training in the southern part of the island prepare for their leave. This moment is used by the northern communistic dictator for the invasion. The player controls a private that hadn&#39;t left the island prior to the conflict. Your squad will assist the local resistance in repelling the attacks while awaiting reinforcements from the mainland.</p>\n<h3>Gameplay</h3>\n<p>The players complete linear missions which feature both main and side objectives. There is an illusion that the game is not linear at all and that the player directly affects the outcome of the war.</p>\n<p>The game puts a strong emphasis on realism. The game features realistic weapons, vehicles, ballistics, animations, character damage, and the world&#39;s landscapes. There are no health points in the game. The players can get killed with 1-2 shots unless they wear body armor or heal their wounds in time.</p>\n<p>The game came bundled with a level editor which gave birth to a dedicated community and allowed for the creation of countless custom scenarios and levels.</p>\n<p>The game features a multiplayer mode in which other players can drop into your game seamlessly and either play with or against you.</p>", "metacritic": null, "released": "2011-07-13", "tba": false, "updated": "2023-08-05T00:17:16", "background_image": "https://media.rawg.io/media/screenshots/741/7415f6f478578831e1fd1329c1c98ee3.jpg", "website": "http://www.armedassault.com/", "rating": 2.65, "rating_top": 1, "added_by_status": {"yet": 50, "owned": 1312, "beaten": 8, "toplay": 9, "dropped": 22}, "playtime": 1, "achievements_count": 0, "ratings_count": 52, "suggestions_count": 324, "game_series_count": 8, "reviews_count": 52, "platforms": ["PC"], "developers": ["Bohemia Interactive"], "genres": ["Action", "Strategy", "Simulation"], "publishers": ["Bohemia Interactive"], "esrb_rating": "Mature"}