{"id": 19949, "slug": "princess-kaguya-legend-of-the-moon-warrior", "name": "Princess Kaguya: Legend of the Moon Warrior", "name_original": "Princess Kaguya: Legend of the Moon Warrior", "description": "Princess Kaguya is a Japanese-style beat ’em up game. Play as a beautiful princess dressed in traditional Japanese garb, and battle enemies using a kendama stick and a bow and arrows as weapons!<br/>Switch weapons according to the type of enemy you’re battling, and smash through hordes of enemies using special moves.<br/>Control an adorable character to battle your way through in this light-hearted action game.<br/>The central theme is loosely based on the ancient Japanese folktale called the Taketori Monogatari.■StoryOnce upon a time, the Wicked God brought great calamities upon this world.<br/>It spread a deadly plague and sent forth the Evil Spirits of Rivers and Mountains to attack the people.<br/><br/>Amidst the despair, a celestial maiden descended from the moon.<br/>This maiden used her mysterious powers to seal the Wicked God in a single scroll...<br/>And thus, the world once again returned to tranquility.<br/>The celestial maiden remained in this realm to guard the sealed scroll.<br/><br/>Ages had passed, and an era called the “Heian” had arrived.<br/>Among the descendants of the celestial maiden were two princesses. They were twin sisters—one named Kaguya, and the other named Sakuya.<br/>They were destined to one day inherit the duty of keeping the Wicked God sealed within the scroll.<br/><br/>One day, the younger twin Sakuya was lured by a mysterious voice, and was led deep into the sealed scroll.<br/>Kaguya leaped right into the sealed scroll in order to rescue her sister...■Features<br/>• Light-hearted beat ‘em up game<br/>• Adorable Japanese-style characters<br/>• Mysterious creatures from Japanese folklore<br/>• Unique concepts such as battles on a scroll<br/>• Formidable bosses", "metacritic": null, "released": "2015-08-04", "tba": false, "updated": "2019-09-17T14:15:53", "background_image": "https://media.rawg.io/media/screenshots/a21/a21275faf9b8cf7e5f5413ddcf7c948a.jpg", "website": "http://princesskaguya.zoo.co.jp", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 5, "owned": 100, "toplay": 1}, "playtime": 5, "achievements_count": 40, "ratings_count": 0, "suggestions_count": 413, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Zoo"], "genres": ["Action"], "publishers": ["Zoo", "Sticky Rice Games"], "esrb_rating": null}