{"id": 19951, "slug": "deadstone", "name": "Deadstone", "name_original": "Deadstone", "description": "A Planet Under SiegeMars is under siege, and the colonists are fighting a losing battle. Assume the role of Blake, a private security operative who crash lands near the colony of Deadstone, following an outbreak on the Icarus space station. Care to guess who just landed the job of sheriff? <br/><br/>To survive, you’ll need to use your combat expertise and lethal firepower to overcome an unrelenting enemy, but to win, you’ll need a strategy. Every time an infected slips through your defensive net, a colonist dies. Can you save the colonists of Deadstone?Two Distinct Game Modes Decide the fate of Deadstone’s colonists in the story driven, 50 mission Campaign, or find out just how long death can be cheated in Survival Mode.Campaign Deploy defences, choose your weapons and equipment, and get into the fight. Experience nerve wracking battles against the insidious infected threat across 3 mission types: Patrol, Arena, and Colonist Rescue.Survival Jump right into the fight with Survival Mode. Build your character, select your load out, and fight it out for the highest score until the bitter end. Death, however, does not spell defeat: it makes you stronger, gaining additional starting resources based on performance.Bring a Friend Experience the Campaign and Survival Mode with a pal in local co-op. Note: A control pad is required for co-op play. The Xbox 360 wired controller is officially supported, however most controllers should work.Play Your Way Develop the ultimate fighter with the unfortunately acronymed S.C.A.M. system, comprising 4 primary stats (Speed, Constitution, Accuracy, Mechanics), 11 secondary stats, and 70 perks.Face an Evolving EnemyConfront 6 different enemies, including the soldier, commander, and the fearsome phase shambler. Contend with an enemy that attacks under the cover of night and dust storm, and even burrows under the surface to ambush you.Defensive Hardware Deploy mines and 4 types of turret to create a defensive line. Upgrade your turrets’ stats, and research completely new abilities for them, including the Kinetic Thumper, which releases recoil energy into a shockwave to push infected back.Tools of the Trade Spend your hard earned credits expanding your arsenal. Choose from 16 upgradable weapons from 4 classes: pistol, shotgun, automatic, precision, and complement your selection with 6 equipment types, including flares, explosives, and armor.Twin Tales Experience two engaging stories, or play without if you’re just here for the action. Choose between a straight up survival narrative and a tongue-in-cheek take on events.Fight to Win Compete on online leader boards for the top spot.<br/>Casual to Hardcore: Deadstone has 6 difficulty settings, to accommodate varying levels of skill.", "metacritic": null, "released": "2014-07-10", "tba": false, "updated": "2019-08-28T22:08:54", "background_image": "https://media.rawg.io/media/screenshots/6f6/6f6b3bbaf7cc88f73d03ea60c7d0b6b7.jpg", "website": "http://www.deadstonegame.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 18}, "playtime": 1, "achievements_count": 47, "ratings_count": 1, "suggestions_count": 427, "game_series_count": 0, "reviews_count": 1, "platforms": ["macOS", "Linux", "PC"], "developers": ["Timeslip Softworks"], "genres": ["Action", "RPG", "Strategy", "Indie"], "publishers": ["Timeslip Softworks"], "esrb_rating": null}