{"id": 199599, "slug": "call-of-kung-fu-master-superhero-in-street-fight", "name": "Call of Kung Fu Master: Superhero In Street Fight", "name_original": "Call of Kung Fu Master: Superhero In Street Fight", "description": "<p>Call of Kung Fu Master: Superhero In Street Fight game is here for real superhero gamers to have ultimate kung fu fight with furious superheroes. Here is a challenge between multi spider heroes vs super hero in each mission. You have to select your favorite superhero or panther and start to take revenge from the enemy spider heroes by punching and kicking them. You have to use your superhero fighting in street skills and kick away the super multiple spider heroes. Powerful kicks and punches will lead your enemies to death. You have to become kung fu master by playing this spider hero game and winning all the missions. <br/><br/>Classic in street combat having mission to take revenge from your enemies you will play this game. You can also use all the boxing techniques in the game and become perfect boxer by practicing this game again and again. Enjoy the endless boxing action free having all super hero powers. Fighting fun in street you would never enjoyed before. Third person fight in street with full realistic combat controls. Superhero moving and jumping controls are very realistic so that you could amuse original fight in street. Become street hero by killing all the enemies. This Call of Kung Fu Master: Superhero In Street Fight game is one of the most favorite game among all other street revenge fighting games available on Google play store.<br/><br/>Punch and kick the street enemies one by one and complete all the challenging fighting levels successfully. Move forward towards the multiple spider heroes, kick away and punch them to have best fight. Multiple super and spider heroes are available having all kung fu skills to select and to have original fight. Simple and attractive UI’s has been designed for all aged peoples to play this game. Best arcade fight game is here for kid’s fun and fighting entertainment. Kid’s specially enjoy this kinds of fighting in street games.<br/>Just download and install this kung fu master fighting in street game and enjoy the special fight between spider panther superheroes and spider heroes in this game. You will really enjoy this in street kung fu fight game.<br/><br/>Features of Call of Kung Fu Master: Superhero In Street Fight game:<br/><br/>-\tOne of the best in street fight action game<br/>-\tSuperhero VS multiple spider heroes fight<br/>-\tChallenging in street kung fu fighting missions<br/>-\tSmooth and realistic superhero controls<br/>-\tFree to enjoy all the missions<br/>-\tBecome Kicks punches master fighter<br/>-\tEndless boxing action with full power<br/>-\tFurious superheroes ultimate fun<br/>-\tSmooth joystick control with up, down, left and right buttons<br/><br/>Download and install this Call of Kung Fu Master: Superhero In Street Fight game and enjoy its unlimited features for free. Give your positive feedback after playing this game.</p>", "metacritic": null, "released": "2018-02-08", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/859/85950418d7ca2504321b71a4e9ebb6c6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 272, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MadMaxGames"], "genres": ["Action"], "publishers": [], "esrb_rating": null}