{"id": 19952, "slug": "vortex", "name": "Vortex", "name_original": "Vortex", "description": "Vortex is a 3D open level star fighter pilot game in which the player controls StarCraft that can also perform multiple maneuvers in a All-Range Mode style flight simulated cosmic world.  Throughout the game, the player can fly or drive through power-ups to collect them akin to classic RPG Space fighters like Star Fox 64. However this game also contains an RPG elements as one collects loot from missions you can upgrade and outfit your fighter with new guns, missiles and engines as well as boost the cores systems of your ship such as body and shields. <br/><br/>In the heart of the Centraus V Galaxy a war has broken out throwing the surrounding sectors into chaos for over 1000 years the Aldari Collective has been seizing power in the region now they have all but secured their own galactic empire at this point all the Great houses have fallen save one. The Dovan Initiative Guardians of Hose Elias for centuries are now all the remain their central house was annihilated by the Aldari in a surprise attack now they Fight with all they have to drive these invaders from the homes of all. But they can't do it alone mercenary’s join the call from all sector's.<br/><br/>In Vortex you take on the role of a star pilot mercenary who has been swayed by the cause of Dovan Initiative. <br/><br/>These mercenary's are sent to the academy given ships, weapons and training to become the fighting vanguard of the Dovan Army. You travel now to join them at Sigmus Prime last bastion of the Dovan Territory for death or glory now only your skills as a pilot can save you. The docking bay opens and you begin your journey into a new world of war.<br/><br/><br/>Our team has been working to put Vortex together for over 2 and a half years and are very happy with the final result but don't take our word for it try our free demo and see all that Vortex has to offer for yourself. Our demo showcases a few of the first Main Story missions and full access to StarCraft ship and weapon upgrades to give you a central idea of both gameplay and progression in Vortex.", "metacritic": null, "released": "2015-07-17", "tba": false, "updated": "2022-06-24T06:49:12", "background_image": "https://media.rawg.io/media/screenshots/993/993654c57b07467176b554abd492d190.jpg", "website": "http://www.displacemedia.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 44}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 267, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Endless Void Studios", "Displace Media", "Josh Woolley"], "genres": ["Action", "Adventure", "RPG", "Strategy", "Casual", "Indie"], "publishers": ["Endless Void Studios", "Displace Media", "Josh Woolley"], "esrb_rating": null}