{"id": 199520, "slug": "noodle-olympics", "name": "Noodle Olympics!", "name_original": "Noodle Olympics!", "description": "<p>Player 1: QWER and ASDF</p>\n<p>Player 2: UIOP and JKL;</p>\n<p><strong>Noodle Olympics</strong> is a simple, intuitive physics game. You are a snake. How fast can you go in these olympic events? Easy to learn, even easier to master! The unique control scheme gives you complete control over your noodle, so that you can make quick, precise and controlled moves for maximum efficiency. Run, jump, and fly, noodle. Human olympics competitors are nowhere near as fast as you! When you’re done racing, grab a friend to fence in a noodle duel to the death!</p>\n\n<p><strong>How to Play:</strong></p>\n<ol><li>Start with Noodle Run. Tap the keys. Tap all the keys. Tap them a bunch. Notice how you move very slowly in the wrong direction? Good!</li><li>Press and hold a few keys, then let go. If you move forward, great!</li><li>Go to the Sandbox. See if you can figure out a better way to move. Good luck!</li></ol>\n\n<p>If I could retake this course, I would make a simpler game. Noodle Olympics has depth, but the barrier to entry is too high for the amount of content available to a skilled player. If it had networked multiplayer and a variety of multiplayer maps and game modes, maybe it would be fun to be good at Noodle Olympics. As it is, the game is deep but not elegant, because elegance = depth / complexity.</p>\n<p>\n</p>\n<p>If I were to expand on Noodle Olympics, I would start over from scratch (which I’m not going to do). The basic physics of the noodle need to be completely reworked. Even though it’s been improving all semester, it still feels neither responsive enough nor wiggly enough. And it needs a clear aesthetic that supports the feel of the noodle, and all the content that’s currently in-game needs to be redone to fit that aesthetic. </p>\n<p>\n</p>\n<p>I love what I made this semester, but I think I went about it all wrong. I should have made ten different noodles with different physics and different aesthetics, picked one, and finalized that much earlier. The “juice” videos we saw sold me on the fact that a good game is 10% content and 90% polish. I should have started polishing and kept polishing much earlier in the process.</p>", "metacritic": null, "released": "2018-01-27", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/b3c/b3c26293a7564e4db64fa446a1060329.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 68, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "Web"], "developers": ["mejg"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}