{"id": 199696, "slug": "maybot-run-itch", "name": "Maybot Run (itch)", "name_original": "Maybot Run (itch)", "description": "<p><strong><em>Help Maybot run, jump, slide, and shoot her way to a strong &amp; stable dystopia in this hilarious political infinite runner.</em></strong><br/></p>\n<p><strong>A Game for the Many</strong></p>\n<p>Play the villain, Maybot. Run through randomly generated levels collecting power-ups, taxes, and votes. Jump over crazy enemies from angry farmers  to missing nuclear bombs to foxes on horseback blowing bugles. Slide under tractors and ripsaws to avoid death and collect more goodies. Build up your naughtiness to unleash your ultimate form and shoot down massive bosses. Spend your votes in the shop on upgrades and new playable characters, each with their own perk. Rise to the challenge and unlock achievements and make history on the Steam leader-board. You are the Maybot now RUN! </p>\n<p><strong>Features</strong></p>\n<ul><li>Run, jump, slide, and shoot for political survival. How long can you stay in power?</li><li>Battle huge bosses destroying ethics, morality, and hope with your victories.</li><li>Power up your special weapon to unleash your ultimate form, 'The Dream Crusher'.</li><li>Collect votes to unlock upgrades and new characters aiding your path to elitist domination.</li><li>Sprint past famous London buildings and landmarks.</li><li>Collect tax and claim expenses for elaborate things and high scores. </li><li>Help Maybot bribe her way to unleash policies and see the world change.</li><li>Collect in game power-ups such as shields, invincibility, and double tax.   </li><li>Complete tasks to earn Steam achievements.</li><li>Compete with others for Steam leader-board domination.</li></ul>\n<p><strong>The Story</strong></p>\n<p>In 2016 Maybot landed in the UK and quickly took power as an unelected dictator. Help her and her cronies run, jump, slide, and shoot their way to a stronger, and more stable leadership. Wreak havoc on the poor, help the elite, and be as naughty as possible in those wheat fields. With your help Maybot can defeat the coalition of chaos; morality and hope, bringing back the wealth to the elite few and condemning the many to ordinary working poverty. There are girl's jobs and boy's jobs but this is definitely a bot's job.</p>\n<p><em>This game is based on true events that may or may not have happened by people who may or may not be real.</em></p>\n<p><strong>For more information:</strong> Visit the Maybot Run website and for instructions on how to play the game go to the Maybot Run online instruction manual.</p>\n<p><strong>#MaybotRun</strong><br/></p>\n<p><strong>Minimum System Requirements (Windows PC): </strong>Windows 7 or higher. Intel Core™ Duo or faster. 2GB of RAM or more. Direct X 11 or greater. OpenGL 3.0 compliant video card. Disk space: &lt;600MB.<br/></p>\n<p><strong>Minimum System Requirements (Linux PC): </strong>Ubuntu 12.04 LTS or higher. Intel Core™ Duo or faster. 2GB of RAM or more. OpenGL 3.0 compliant video card. Disk space: &lt;600MB.<br/></p>\n<p><strong>Minimum System Requirements (Mac OSX): </strong> OSX Maverick 10.9+ or higher. 2.0GHz+ processor. 2GB of RAM or more. OpenGL 3.0 compliant video card. Disk space: &lt;600MB.<br/></p>", "metacritic": null, "released": "2017-10-03", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/118/118d99e4df3bbdf31e587847d38bb7a8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 186, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Bloodline Games"], "genres": ["Action"], "publishers": [], "esrb_rating": null}