{"id": 19974, "slug": "tibetan-quest-beyond-the-worlds-end", "name": "Tibetan Quest: Beyond the World's End", "name_original": "Tibetan Quest: Beyond the World's End", "description": "<p>Journey to the mystical city of Shangri-La and find your missing niece! Embark on an adventure at the edge of the world to save Larisa from the clutches of the ancient labyrinth!<br />\nTibetan Quest: Beyond the World&#39;s End is a captivating hidden object game that blends together the elements of the thriller and adventure genres with oriental esotericism and lore.<br />\nWhen you were seeing off your beloved niece three weeks ago as she embarked on an archeological trip to Tibet, nothing could have foreshadowed the dramatic events that were about to unfold. Only yesterday you received a mysterious letter from which you learned that Larisa and her crew had gotten lost in a snow storm.<br />\nWithout hesitation you leave your family estate to come to your protégé’s rescue. The inhabitants of Lhasa&#39;s Tibetan temple guide you toward the legendary city of Shangri-La where Larisa and her expedition were last seen. Discover what really happened in Shangri-La and what secrets are hidden in the labyrinth beneath this ancient city brimming with magic. Beat the obstacles and puzzles, face the supernatural powers dwelling in the vast corridors, and find the clues about your niece&#39;s disappearance.<br />\nWill you find the courage to travel to mysterious Tibet? Will you face the dangers lurking in Shangri-La to save your family beyond the world&#39;s end?<br />\nFeaturesExplore 55 picturesque locations to find Larisa!<br />\nComplete 48 puzzles and unique Hidden Object Scenes!<br />\nBecome a master by unlocking 18 achievements!<br />\nPut the troubled souls to rest in the extra adventure!</p>", "metacritic": null, "released": "2016-04-06", "tba": false, "updated": "2019-10-22T14:09:31", "background_image": "https://media.rawg.io/media/screenshots/802/8028098f6ecf3c95efcacd678a9c63c5.jpg", "website": "http://www.artifexmundi.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 106, "beaten": 2}, "playtime": 4, "achievements_count": 18, "ratings_count": 3, "suggestions_count": 466, "game_series_count": 0, "reviews_count": 3, "platforms": ["Android", "iOS", "PC", "Linux", "macOS"], "developers": ["Artifex Mundi", "Brave Giant"], "genres": ["Adventure", "Casual", "Puzzle"], "publishers": ["Artifex Mundi"], "esrb_rating": "Teen"}