{"id": 19989, "slug": "hollows-land", "name": "Hollow's Land", "name_original": "Hollow's Land", "description": "What kind of game is Hollow's Land? <br/>Hollow's Land is a RPG driven to take players on a epic journey involving dangerous occultists and creatures. As the story unfolds the player will gain support and they will also discover more enemies. Eventually the player will gain enough support to form their very own faction. Hollow's Land is big world and has a lot to explore! Gameplay  <br/>Completing quests will give you experience points and will go towards leveling your character up,<br/>you will need to also complete quests to become stronger and thus taking on stronger enemies in Hollows Land.<br/>The game will be open world and will feature many different exciting creatures to take on, feel like relaxing?<br/>Hollows Land will feature towns, cities, villages for the player to sell and buy good, they will also feature a tavern. Features <ul><li> Customizable Characters <br/></li><li> Intelligent AI<br/></li><li> Crafting</li></ul> Future Features <ul><li> Skill System<br/></li><li> Factions<br/></li><li> Customizable Spells<br/></li><li> Customizable Mounts<br/></li><li> Player Housing What kind of game is Hollow's Land? <br/>Hollow's Land is a RPG driven to take players on a epic journey involving dangerous occultists and creatures. As the story unfolds the player will gain support and they will also discover more enemies. Eventually the player will gain enough support to form their very own faction. Hollow's Land is big world and has a lot to explore! Factions <br/>As a player progresses he will gain followers from either missions or defeating that follower. All followers will be based in their factions home. The more you progress and gain more followers the bigger your factions home will become. So the question is what else is the faction good for? Here is a list:<br/><ul class=\"bb_ul\"><li> Armor Crafting<br/> Players will be able to craft the best armor and weapons.<br/></li><li> Mount Training<br/> Players will be able to capture wild animals and train them to become mounts! <br/></li><li> Follower Training<br/> Players will have to train followers to unlock higher perks and skills. <br/></li><li> Assault<br/> As the story line progress the player will have to make a assaults in order to progress further. <br/>This will involve all of your followers to join forces with you and assist you on the battlefield! <br/></li><li> Customizable Spells<br/> As players explore they will discover spell books and each book has different type of spells from dark to light.<br/>Players can go to their faction home and can mix and match spells and can even change the way the spells look.  </li></ul> Twitter: https://twitter.com/LurixBanshee </li></ul>", "metacritic": null, "released": "2014-12-23", "tba": false, "updated": "2019-08-28T22:08:53", "background_image": "https://media.rawg.io/media/screenshots/d8d/d8de464c2566fe4383f08829394f05dd.jpg", "website": "http://hollowsland.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 49}, "playtime": 4, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 439, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["sxpenx"], "genres": ["Action", "RPG"], "publishers": ["sxpenx"], "esrb_rating": null}