{"id": 19996, "slug": "mechanika", "name": "MechaNika", "name_original": "MechaNika", "description": "<strong>THE MANIFESTO</strong><br/><strong>Project MechaNika. Plan for the destruction of all things that aren't awesome.</strong><br/><br/>I, Nika Allen, 7 years old, am sick to death of this world. My parents don't care about me. My brother never takes any notice of me. At school I never get taught anything useful. There are loads of things that shouldn't exist. It's for these reasons that I've decided to destroy everything that isn't cool. With MechaNika I will destroy and eliminate the things and the people that I don't like. I'll start at home. Then school. This city. The entire world. I'll get rid of everything that's boring and pointless, and this world will be better for it. <br/><br/><strong>If it's not cool, it will disappear. If you're not cool, hide. MechaNika is here.</strong><strong>THE GAME</strong><br/>Meet Nika, an intelligent girl that doesn’t fit the world in which she lives. Perhaps it’s the chocolate shake with a shot of cognac which she carries in her backpack which makes her different. Or maybe it’s the fact that at 7 years old her favourite things are the transfer of energy, magnetic fields and electrical engineering! But being the odd one out doesn’t matter to Nika. Not anymore. She has a plan to solve everything. A really… odd plan. You read the MechaNika manifesto, right?<strong>THE PSYCHOTIC ADVENTURES</strong><br/>As you help Nika in her mission to build a rusty weapon of mass destruction to destroy her world you will meet many unique characters. We want you to discover the freak stories of some of these characters and we will let you know about them through the Psychotic Adventures, a series of genre-spanning games that starts with MechaNika.<strong>THE WEAPONS</strong><ul><li>A different adventure where you will join Nika in her quest to destroy the world. Go for it!<br/></li><li>Lots of really fascinating characters with their own stories. Meet them!<br/></li><li>Extremely cool and colorful visuals, all hand-drawn!<br/></li><li>You will face many puzzles with different ways to be solved. Choose yours!<br/></li><li>References to many other video games, anime series, movies and music bands. Can you spot them all?<br/></li><li>Seriously, you shouldn't skip the chance to play this game.</li></ul>", "metacritic": null, "released": "2015-05-30", "tba": false, "updated": "2023-08-19T10:42:29", "background_image": "https://media.rawg.io/media/screenshots/dd7/dd7df2546706b16a634612641ef8527b.jpg", "website": "http://www.mangoprotocol.com", "rating": 3.53, "rating_top": 4, "added_by_status": {"yet": 5, "owned": 204, "beaten": 16, "toplay": 5, "dropped": 1}, "playtime": 6, "achievements_count": 31, "ratings_count": 17, "suggestions_count": 262, "game_series_count": 0, "reviews_count": 17, "platforms": ["Android", "PC", "Linux", "PlayStation 4", "Nintendo Switch", "Xbox One", "iOS", "macOS"], "developers": ["Mango Protocol"], "genres": ["Adventure", "Indie", "Puzzle"], "publishers": ["Mango Protocol"], "esrb_rating": "Mature"}