{"id": 200, "slug": "2dark", "name": "2Dark", "name_original": "2Dark", "description": "<p>From Frédérick Raynal, the creator of Alone in the Dark® and pioneer of survival-horror, 2Dark is a grim journey of stealth and courage into the heart of corruption. Use your cunning to infiltrate Gloomywood’s bastions of cruelty. Investigate to uncover the secrets of the deranged psychopaths within, seek retribution for their crimes, and bring the children to safety.<br />\nPlagued by a string of child abductions, darkness hangs over the once-picturesque city of Gloomywood like a curse, smothering hope and paralyzing its citizens with fear. Having seen his own wife slain and his children taken, former detective Mr. Smith vows to find justice and bring an end to the misery. But, if only it were so simple. From dubious streets and suspicious dwellers, to the pack of smokes in your pocket and the betrayal of your own footsteps, danger infests every corner and crevice. Doubt everything in this trap of a city where death is the only certainty.A NEW STEALTH-HORROR ADVENTURE A nerve-wracking experience of ruthless consequences with only your wits to guide you.<br />\nPerfect your plan to infiltrate intricately handcrafted levels and escape with the children.<br />\nStick to the shadows and step carefully. Light and sound can be your allies, and your undoing.<br />\nSupplies are limited. From flashlight batteries to bullets, make every item count.<br />\nInvestigate every nook and cranny to expose the sinister secrets behind the abductions, uncover new areas, and find every child.<br />\nKids will be kids. Stop for too long and they&#39;ll fidget and cry, putting both of you in harm&#39;s way.<br />\nBreak for a smoke to save your progress, but be wary of noisy coughing fits, and remember, smoking really does kill.</p>", "metacritic": 68, "released": "2017-03-09", "tba": false, "updated": "2023-12-27T21:21:38", "background_image": "https://media.rawg.io/media/screenshots/47d/47d74c9b88068a72ce3f5c492b954480.jpg", "website": "https://www.2dark.tv/", "rating": 3.46, "rating_top": 4, "added_by_status": {"yet": 17, "owned": 354, "beaten": 6, "toplay": 8, "dropped": 7, "playing": 2}, "playtime": 3, "achievements_count": 75, "ratings_count": 11, "suggestions_count": 377, "game_series_count": 0, "reviews_count": 13, "platforms": ["PlayStation 4", "PC", "Xbox One"], "developers": ["Gloomywood"], "genres": ["Adventure", "Indie"], "publishers": ["Bigben Interactive"], "esrb_rating": "Mature"}