{"id": 200040, "slug": "little-big-mushroom", "name": "Little big Mushroom", "name_original": "Little big Mushroom", "description": "<p><strong>Prototype<br/></strong><br/>In my latest research carried out in Oceania, I found a very interesting specimen of the kingdom Fungi, a mushroom that I called Agaricus duomoles, but how they prefer to be called Dules. At that point you might be asking, like a mushroom may have a preference as it is called? Here is one of the most fascinating, but however not the only peculiarity of this specimen, they are small thinking beings with a highly evolved society.</p><p>I believe that you would like to witness the wonderful rite of passage in which they must learn to use, from the elements to change its size.</p><p><strong>Arrow - </strong>Move</p><p><strong>Protótipo </strong></p><p>Nas minhas últimas pesquisas realizadas na Oceania, encontrei um espécime deveras interessante do reino Fungi, um cogumelo que dei o nome de Agaricus duomoles, mas como eles preferem ser chamados Dules. Nesse momento você deve estar se perguntando, como um cogumelo pode ter alguma preferência na forma que é chamado? Eis uma das mais fascinantes, mas porem não a única peculiaridade desse espécime, eles são pequenos seres pensantes com uma sociedade muito evoluída. </p><p> Acredito que você gostaria de presenciar o maravilhoso rito de passagem na qual eles devem aprender usar, dos elementos da natureza para mudar seu tamanho. </p><p><strong>Setas - </strong>Mover</p>", "metacritic": null, "released": "2016-01-24", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/e1f/e1f3297f27712c559753d9a4f3c5c654.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 6, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Kozuskoo"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}