{"id": 200107, "slug": "crime-vs-police", "name": "Crime vs Police", "name_original": "Crime vs Police", "description": "<p>Meet the new <strong>racing &amp; shooting</strong> game on the most popular 90s and <br/>2000s crime cars. Play as criminal racer versus police, use nitro and <br/>wipe out the cops with the legendary USSR and Russian weapon!</p>\n<p>Crime vs Police - Shooting Car Racing 3D - this is an amazing drive shooting <br/>game where you act as racer vs cops or cop versus crime racers.</p>\n<p>BONUS: Real russian cop walkie-talkie!</p>\n<p>Most popular <strong>bandit automobiles of 90's and 2000's</strong>. Show your skills in the <br/>death race and shooting rivals to survive in this auto hell. Choose your<br/> side, who you are: evil cop or mad racer who have nothing to lose? Road<br/> of fury will be your new home for an unlimited time. </p>\n<p>Compete in the extreme speed driving, use nitro for fast acceleration, crush your <br/>opponents with legendary Russian weapon. Beware of the enemy fire to <br/>save your car and yourself. Come first and open new roads. Get your main<br/> reward for good shooting - CASH.</p>\n<p>Tune your russian, german and japan cars in your crime/cops garage:</p>\n<p>EIGHTBALL (VAZ 2108), PRIORA (ВАЗ 2170), BENZ (MB W140), BULLDOG (Pajero II),  BEAMER (e38), DOUBLE R (RR Sport III), CUBE, GOAT COP, VOLGA FSB.</p>\n<p>Your upgrades: motor tuning, car armour, suspension, tires, weapon and nitro.<br/>Russian weapons are: </p>\n<p>- AKS-74<br/>- PK<br/>- RPG-7<br/>- KPV<br/>- KORNET<br/>- KRASUKHA EW SYSTEM<br/>- AKSU-74<br/>- VSK</p>\n<p>Features and benefits of the game Crime vs Police - Shooting Car Racing 3D:</p>\n<p>- Realistic physics<br/>- Mad race and original tracks (city, forest, beach)<br/>- Great car models<br/>- Cars tuning<br/>- Many weapons<br/>- Great music and graphics optimised for different devices</p>\n<p>And<br/> you can play as angry cop - the same shooting car racing only on police<br/> car. Enjoy, put five stars, write your reviews please. Thank you!<br/></p>", "metacritic": null, "released": "2017-10-29", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/444/444f051922927114430da5c14a73c504.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 111, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["arpaplus"], "genres": ["Action", "Shooter", "Racing"], "publishers": [], "esrb_rating": null}