{"id": 20013, "slug": "irrational-exuberance", "name": "Irrational Exuberance", "name_original": "Irrational Exuberance", "description": "Irrational Exuberance is an experiment to probe the possibilities of full room-scale VR and the HTC Vive, unfolding organically as you discover and engage with deep space phenomena. From the small, micro-scale to the epic and infinite, the experience puts you on the edge of the universe. Irrational Exuberance: Prologue has been an audience favorite at the <strong>Sundance Film Festival</strong> and the <strong>Kaleidoscope</strong> tour and is praised as a defining VR experience by the media for its use of space, sense and setting. The full release, scheduled for late-2016, features many more worlds of wildly different sensations, interactions, and impossible vistas. <br/><br/>Featuring:<br/><ul><li><strong>UNCOMPROMISING DESIGN</strong>: Exclusively designed for room-scale VR interaction, Irrational Exuberance is a non-violent, organic experience that offers cinematic moments of space, solace and spectacle. <br/></li><li><strong>AMPLIFIED SENSES</strong>: A highly tuned, evocative spatial audioscape takes audiences to surreal depths of space, from crumbling meteorites to chiming ephemera to the distant hum of stars.<br/></li><li><strong>HYPER PRESENT REALITY</strong>: Beautiful worlds, mysterious sensations, and nuanced interaction weave together to create a heightened sense and awareness of this alternate reality. <br/></li><li><strong>DEEP IMMERSION</strong>: An in-depth VR odyssey spanning the far reaches of the cosmos.</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T22:08:52", "background_image": "https://media.rawg.io/media/screenshots/83e/83ee40050471ba4227cafe0cefc65da2.jpg", "website": "http://irrationalexuberancevr.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 176, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Buffalo Vision"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Buffalo Vision"], "esrb_rating": null}