{"id": 200234, "slug": "paumel", "name": "Paumel", "name_original": "Paumel", "description": "<p>\"The time has come to be PAUMELing!''</p>\n<p>(Don't worry, the game will be in english, even if the trailer is not.)</p>\n<p>First off: Since I used the RPG-Maker 2k3 to create this game you have to download the following Runtime-Package to make it work. (Except you already have it. Don't worry, it won't harm you.)</p>\n<p>First go here -&gt; http://www.rpgmakerweb.com/download/additional/run-time-packages</p>\n<p>Then click on RPG Maker 2003 to download the Runtime-Package</p>\n\n<p>The story:</p>\n<p>Paumel, a pet dog from the quaint village Gida becomes a witness to the murder of his wifey, which was attacked by 3 puppies. He chases the puppies and discovers the alleged manipulator of the murder: A mysterious dog named Zerk. In addition to the assassination Zerk is in possession of strange goodies, that can cause weird mutations to anyone or anything that gets in touch with it. Hence Paumel is striving for vendetta plus the exposure of whats behind the strange goodies. On his journey he meets helping paws like 'Lucky' - an officers dog, or 'Samuel' - a pretty strung-out green rastadog.</p>\n\n<p>Gameplay:</p>\n<p>Paumel is a 2D-RPG á la old Final Fantasy in bird's eye perspective and turn-based random enemy encounters. Like in many RPGs the heroes of the story will learn new skills when they level up and find new armor or accessories.</p>\n\n<p>Age Limit:</p>\n<p>I'd recommend the game at age 12, because I depicted Marijuhana in a humoristic manner, and added some bloody scenes.</p>\n\n<p>Difficulty:</p>\n<p>For RPG-players: Medium ; For non-RPG-players: Hard</p>\n\n<p>Playtime:</p>\n<p>RPG-players: 7 - 10 hours ; Non-RPG-players: 10 - 14 hours (Be patient ;) )</p>\n\n<p>In total a very humoristic game, with some serious moments.</p>\n<p>Have fun and thank you!</p>", "metacritic": null, "released": "2018-05-01", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/8c8/8c8b289e322d5371db738495b604f1d6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 8, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ezz Vee"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}