{"id": 20035, "slug": "ninja-outbreak", "name": "Ninja Outbreak", "name_original": "Ninja Outbreak", "description": "In a Soviet Laboratory on Venus, a secret super-soldier program has gone horribly wrong. Subjects gained super-human strength and reflexes, but became irrationally violent. What's worse, those the subjects attacked began showing the same symptoms. These beings, dubbed \"Ninja,\" have now overrun the facility. The laboratory has gone into lockdown. You play as a lone scientist who must find a way to escape from the Ninja Outbreak. <br/><br/><strong>Features</strong><br/><br/>- Scarcity of Resources: Ammo is scarce, and sometimes your best option will be to run. <br/><br/>- Risk and Reward: Do you go for that extra bit of ammo, or that key that will open a shortcut, when you know there's a Ninja just around the corner? <br/><br/>- Weapon Variety: In addition to basic weapons such as the pistol and shotgun, you can find experimental weapons being developed at the laboratory. <br/><br/>- Exploration: How much of the game world you explore is up to you. Do you delve deeper into the laboratory searching for weapons and resources, or do you head straight to the North Lab to take on the Master Ninja? <br/><br/>- Many enemy types: You will face off against many varieties of Ninja as well as dangerous Venusian lifeforms. Some ninja will sabotage your environment, some will steal items, and some will follow you from a distance before jumping in for a precise strike.<br/><br/>-Betray the Ninja Empire:  Ninja is supreme and you have double-crossed it!  Why did you do that?", "metacritic": null, "released": "2016-03-30", "tba": false, "updated": "2019-08-28T22:08:52", "background_image": "https://media.rawg.io/media/screenshots/795/795a2f1a3a305d45e07bdd903b0bc5c4.jpg", "website": "http://renegadesector.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 29, "toplay": 1}, "playtime": 4, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 154, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Renegade Sector Games"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Renegade Sector Games"], "esrb_rating": null}