{"id": 200381, "slug": "lasersnake", "name": "LaserSnake", "name_original": "LaserSnake", "description": "<p>Whats up dev peeps!<br/><br/>So over the past December holiday, I was away from home (and my pc) for a while. This obviously meant no working on games, which made me sad. However, as luck would have it, just before the holiday actually started, I read about the Love2D game engine, which had a version that could be installed on Android. Happy Days!<br/><br/>So I installed the Love2D game engine on my phone, along with DroidEdit for coding and EZ file explorer in order to open my scripts with the Love2D engine. This allowed me to code the game attached to this post, title LaserSnake! (The title is a work in progress, maybe NeonSnake would fit better?)<br/><br/>The game is a port of the classic snake on the Nokie 3310. You are a snake, hunting food, in this case you click with the mouse or touch the screen where you want to move. The snake can move at any angle, and colliding with walls or yourself results in death. As you eat, you increase in length as well as speed. So, who has the longest snake? (pun intended :D)<br/><br/>So, about the engine. As I mentioned, you can install it on Android, and it works very well in that regard. I would say about 80% of the game was coded on my phone, with the last bit finished on my PC once I got back, for convenience sake. Overall, I was very impressed with my experience. Love2D uses Lua as a scripting language, and I enjoyed working in it. One thing to note is that Lua is not an Object Oriented language. For the visuals of LaserSnake, I used only the build in drawing functions, but you can import and animate sprites quite easily as well. Overall I would say that Love2D is a cool engine to work with and you could do a lot with it (on your phone or tablet!) , if you can get around the fact that it isn't OOP. <br/><br/>Please enjoy the game and give some feedback if you don't mind. It is very minimalist, as intended, but hopefully fun!</p><p>stofStorm</p>", "metacritic": null, "released": "2017-02-07", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/ba3/ba34f9e99f50f8e79790d6f3df89551c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 3, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["stofStorm"], "genres": [], "publishers": [], "esrb_rating": null}