{"id": 200428, "slug": "maze-crazed", "name": "Maze Crazed", "name_original": "Maze Crazed", "description": "<p>Mazed Crazed was my first serious project that I was \"gung ho\" about and was going to bring to market. It was inspired by the board game Labyrinth as I like the mechanic of a morphing maze. So in my version I had sliding tiles that changed the maze every few seconds and the object was to navigate the shifting maze and collect all the cheese before the timer ran out. Also you had to avoid an enemy or two or hit them with the blue cheese.</p><p>However the game was plagued with some serious collision issues that let you pass through walls at times and I was never able to solve that. Also I learned in the process that 3D modelling wasn't my forte and realized I would need lots of outside help to finish the game. I also didn't have a good idea on how to make a nice level progression to keep it interesting. Also many players voiced their frustrations of getting trapped by the moving maze with no where to go, which was another issue I didn't resolve.</p><p>I was eventually hit by the \"idea fairy\", put this project on the back burner and started on a different project. If I ever revive this project, I'll be doing it in 2D, not 3D as this project taught me 3D was harder than I thought and I don't have the skill set for it, and I didn't seem to click with any of the 3D modelling software that I tried.</p><p>The game is written in Blitz3D and you use the mouse to control the mouse in the game.</p>", "metacritic": null, "released": "2016-06-22", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/72d/72da137286996179ef0a6cf40755de83.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 99, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Greg Squire"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}