{"id": 2007, "slug": "piyo-blocks-2", "name": "Piyo Blocks 2", "name_original": "Piyo Blocks 2", "description": "PRESS REVIEWS<br/>• Eurogamer [9/10] - “absolutely tailor-made for touch-screen play”<br/>• Slide To Play [4/4] - “Piyo Blocks 2 is a near-flawless Match-3 title that tops the vast majority of its competition”<br/>• 148Apps [4/5] - “Piyo Blocks 2 is a great game for anyone looking for a challenge”<br/>• Pocket Gamer [8/10] - “Piyo Blocks 2 manages to surprise and delight”<br/>• Gamezebo [4/5] - “Unlike much of the match-3 competition, Piyo Blocks 2 is a diversion you can sink into”<br/><br/>Introducing Piyo Blocks 2, the magical match-em-up sequel to the iPhone original, Piyo Blocks. With all new retina graphics, new game modes, online multiplayer battles, and much, much more.<br/><br/>CHASING THE RAINBOW<br/>Match same coloured blocks to make them disappear, and capture the target number of blocks before the time runs out to level up. Make use of combos and power-ups to help match more and more glorious Piyo Blocks.<br/><br/>SIX SINGLE PLAYER MODES<br/>Now with six different single player modes, there’s a mode to suit everyone’s style of play. <br/>• Piyo Mode - capture the target number of Piyo’s to level up<br/>• Hyaku Mode - capture 99 or more of any Piyo type to level up<br/>• Time Attack - 1,2, or 4 minute game, capture as many Piyo’s as you can<br/>• Three Second Mode - you have 3 seconds to make your next move!<br/>• Disco Mode - 2 minute game and the disco blocks keep changing colour<br/>• Endless Mode - play forever! <br/><br/>ONLINE MULTIPLAYER BATTLES<br/>New to Piyo Blocks 2 is a two player battle mode, available online over Game Center, or locally via WiFi or Bluetooth. In a two battle, each combo you make adds to your Combo Bar. When the Combo Bar reaches different levels, you can unleash various attacks on your opponent. Whoever can survive the longest wins! <br/><br/>HIGH SCORES + ACHIEVEMENTS<br/>With Game Center integration, you’ll never have to leave the game to view your achievements and high scores. <br/><br/>STUNNING HD GRAPHICS<br/>Now updated to support Retina displays, the bright and colourful graphics look even more stunning in beautiful High Definition!<br/><br/>FOLLOW US<br/>@BigPixelStudios<br/>facebook.com/BigPixelStudios", "metacritic": null, "released": "2010-04-01", "tba": false, "updated": "2019-10-22T14:27:56", "background_image": "https://media.rawg.io/media/screenshots/373/37308855c70bdebd1f630ec634481914.jpeg", "website": "http://www.bigpixelstudios.co.uk/piyo-blocks-2/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 80, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Big Pixel Studios"], "genres": ["Family", "Puzzle"], "publishers": ["Big Pixel Studios"], "esrb_rating": "Everyone 10+"}