{"id": 20082, "slug": "goggles-world-of-vaporia", "name": "Goggles - World of Vaporia", "name_original": "Goggles - World of Vaporia", "description": "Goggles is an online coop arena shooter for up to four players. You can play as one of four different characters, namely Quentin, Frank, Tesla or Jerne. Each character comes with a unique set of weapons, vehicle and special abilities.Story<br/>The story of Goggles takes place in the world of Vaporia, a steampunk society that is run by the global company Fumare Tech.<br/>Almost every aspect of life in Vaporia is mechanized. You can find automatons everywhere. Some of them are very small and just roam the streets to keep them clean, others are bigger than houses and are used to build and construct the ever growing cities of Vaporia.<br/><br/>Next to those everyday automatons from Fumare Tech, there are also free inventor workshops. One of the best known workshops is the one of Master Vules Jerne. It is the night before the big reveal of Master Jernes new discovery: the existence of parallel universes! <br/>Next to his discovery, he and his apprentice Quentin have been working on some special lenses, which they placed in various Goggles, that allow the wearer to have a look into those universes!<br/><br/>In the morning the Goggles will be presented to the public and Master Jerne is just finishing his final tests when something terrible happens: one dimension after another turns black...<br/><br/>Jerne immediately starts to check for the alleged error in his Goggles when suddenly a dimension crack opens directly in front of him! <br/>While Jerne is watching in disbelieve a mucous black shadow enters the world. As the shadow realizes that Jerne can see him, he immediately goes for the Goggles.<br/><br/>The Goggles are lost in the attack and dimension cracks open all over Vaporia. It is up to you and three other players in the roles of Master Vules Jerne, his apprentice Quentin Quaint, the mysterious Fumare Tech trader Tesla o' Tool or the lovable steamworker Frank Frankson, the get the Goggles back by traveling all over Vaporia, and stop the black shadows.Gameplay<br/>Goggles is an online coop arena shooter for up to four player. You can play as one of four different characters, namely Quentin, Frank, Tesla or Jerne. Each character comes with a unique set of weapons, vehicle and special abilities. <br/><br/>The main goal in Goggles is to retrieve all goggles that have been lost at the beginning of the game. In order to do so you have to close black shadow rifts which are guarded by hordes of possessed automatons. While closing rifts more and more areas in each district are opening up for you to explore.<br/><br/>Once all areas in a district are opened you can either try to close all remaining rifts or fight the endboss before the time runs out to get the lost Goggles back. There are special events in each area that will be triggered at random. These events range from simple collect-missions to convoy- and hunt-missions. <br/><br/>When you complete those additional missions you gain bonus time and items to help you in your main fight. The positions of the shadow rifts and events are random generated, so each playthtough will be unique.", "metacritic": null, "released": "2015-10-09", "tba": false, "updated": "2019-08-28T22:08:50", "background_image": "https://media.rawg.io/media/screenshots/6fa/6fa8193c674cfa7f49e68ca8e1aa7de3.jpg", "website": "http://bit2good.com/goggles", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 6}, "playtime": 4, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 497, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC", "Linux"], "developers": ["Bit2Good Ug"], "genres": ["Action", "Adventure", "Racing", "Casual", "Indie"], "publishers": ["Bit2Good Ug"], "esrb_rating": null}