{"id": 20088, "slug": "dwelvers", "name": "Dwelvers", "name_original": "Dwelvers", "description": "--------------------------- EARLY ACCESS WARNING: THIS GAME IS STILL IN ALPHA, EARLY ACCESS STATE. YOU MIGHT ENCOUNTER BUGS. YOU MIGHT ENCOUNTER CTD'S AND YOU MIGHT GET FRUSTRATED. BUT, IF YOU BUY THIS GAME, YOU WILL ALSO HAVE THE CHANCE TO CONTRIBUTE TO THE SHAPING OF A GREAT GAME --------------------------<br/><br/>Dwelvers is a real time strategy game where The player takes the role of an evil Dungeon Lord who guide its minions through building their own dungeon, below and above the surface. Manage elaborate production chains, cater to the needs and quirks of each monster and lead them to battles against other monsters and pathetic humans.<br/><br/>The most challenging part for the player will be creating an advanced production system so as to have enough food to keep the creatures well fed, enough weapons and armour to outfit their army as a force to be reckoned with, and of course enough beer to keep them satisfied with you as their master. <strong>A drunk minion is a happy minion!</strong> The theme of the game will have a lot of dark humour, and each creature will have its own personality, demands and fighting style; forcing the player to handle all the creatures in different ways in order to max out their potential. <strong>A happy minion is a useful minion!</strong><br/><br/>Features:<br/><ul><li> Multi Layered dungeon: The dungeons are not only scary, they are also deep!<br/></li><li> Free form room building: Set the size and shape of your rooms and build the inside of them. no run-of-the-mill pre designed rooms, your dungeons is uniquely yours!<br/></li><li> Monsters equipment: Craft and equip different weapons and armours for your creatures. some of those weapons can only be found through looting enemy rooms.<br/></li><li>  Below and Above surface: In Dwelvers, you will have the option of raiding above surface human settlements and seamlessly transit between the surface and below.<br/></li><li>  Extended production system will see you managing the production of several resources in evil efficiency <br/></li><li>  Hydraulics system that allows players to build elaborated traps and dynamically changing walls that are triggered by pressure plates.<br/></li><li>  Trade with off map settlements by capturing portals. </li></ul>", "metacritic": null, "released": "2014-09-11", "tba": false, "updated": "2019-08-28T22:08:50", "background_image": "https://media.rawg.io/media/screenshots/947/9476f2ab47a32088ca737a35436154e8.jpg", "website": "http://www.dwelvers.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 42}, "playtime": 1, "achievements_count": 14, "ratings_count": 1, "suggestions_count": 489, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Rasmus Ljunggren"], "genres": ["Strategy", "Simulation", "Indie"], "publishers": ["Dancing Devils"], "esrb_rating": null}