{"id": 20087, "slug": "one-man-is-not-no-man", "name": "One Man Is Not No Man", "name_original": "One Man Is Not No Man", "description": "<strong>description:</strong><br/>Do you want to fight with a sword? Do you want to feel like a hero? \"One Man Is Not No Man\" project will quench that desire! You will defend the castle from the army of enemies on your own.<br/><br/>The player will be able to choose one of four heroes from different countries and eras. Everyone has his own weapon, features and fighting style. Simple, but flexible system of power upgrades, bonuses and rewards will allow you to enjoy every moment of the game.<strong>key Features:</strong><ul><li>Unique, but intuitive melee mechanics. You will literally feel the weapon in your hands! The attack depends on the movement of your mouse, and the quality of the blow depends on dexterity of the player.<br/><br/></li><li>Attractive claymation graphics. Detailed modeling, frame based animation and laborious manual processing of frames were worth several months of work.<br/><br/></li><li>There are no boring standard \"invulnerabilities\", \"double damage\", medkits among the bonuses, as this is not the other copy of Crimsonland. It is time for new and original ideas.<br/><br/></li><li>The gameplay is not only about \"hack and slash\". The heroes have various ranged weapons, which have individual features. Each of the heroes has personal renewable power. The power of the bonus also depends on the choice of the hero. In other words, the game can be played in different ways.</li></ul><br/>Challenge injustice and prove that one man is still a man!", "metacritic": null, "released": "2016-03-18", "tba": false, "updated": "2019-08-28T22:08:50", "background_image": "https://media.rawg.io/media/screenshots/ea1/ea12531d49fd804885822f570b5dafb3.jpg", "website": "http://ten-tiulenya.ru", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 128, "toplay": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 222, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["TEN TIULENYA team"], "genres": ["Action", "Indie"], "publishers": ["TEN TIULENYA team"], "esrb_rating": null}