{"id": 200934, "slug": "not-eye-b", "name": "not eye (b)", "name_original": "not eye (b)", "description": "<p>playable on htc vive <br/></p><p> <br/>In Samuel Beckett's play Not I an actress is strapped into a box floating above the stage on a ladder. The only thing visible during her rapid-fire monologue, delivered too quickly to be fully comprehended by either the audience or even the actress, is her mouth which is showing through a hole in the box and lit by a single spotlight. In not eye (b) I explore the ways that the Vive headset constructs a new kind of first-person experience. Virtual Realty headsets pose a very interesting dilemma in the picture plane / screen discourse of art history. Now, rather than a pictoral surface or object being something separate and looked at by a viewer, the screen is attached so close to their face that they cannot focus on it with both eyes. Instead two screens are playing slightly similar views of a virtual space that our bodies perceive as spatial rather than flat, especially when they respond to the screen moving in exact sync with our bodies by being strapped securely to our head.  The HTC VIve headset has a safety camera on its front meant for being able to show the user that they are about to run into an object. Because it only has one lens, when it's view is projected into the headset its perspective does not match up with our normal perception of depth. This is doubly so when it is projected in the same space as a 3D model. This piece plays and composes using these perceptual tensions. </p>", "metacritic": null, "released": "2017-10-15", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/452/452b4245513248b480944a5319dd0835.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 58, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["sutopat"], "genres": [], "publishers": [], "esrb_rating": null}