{"id": 200964, "slug": "sgj-1-shunpo", "name": "SGJ #1: Shunpo", "name_original": "SGJ #1: Shunpo", "description": "<p><em>Created for The Sunday Game Jam #1</em></p>\n<p>Shunpo is a League of Legends fan game, where you play as Katarina. Your objective is to kill as many enemies as you can in 5 minutes. </p>\n<p>As Katarina, you have all of her main abilities from League of Legends. There's a video explaining how the game works on my channel, but I'll explain it briefly here as well, since the video is in portuguese (it has english subtitles, though!): </p>\n<ul><li>AD: Moves Katarina;</li><li>Space: Jumps</li><li>Left mouse button: Throws a dagger towards mouse position. Daggers only deal damage on the first hit;</li><li>Right mouse button: Shunpo, teleports Katarina to mouse position, deals double damage;</li><li>E: Preparation, throws a non-damaging dagger upwards.</li><li>Q: Death Lotus: Spins and throws daggers in every direction. Daggers generated by the ult deal double damage.</li><li>Left Shift: Activates slow motion</li></ul>\n<p>YouTube video:</p>\n\n\n\n<p><em>The Sunday Game Jam is a show where I make a game every weekend, from saturday to sunday, in 24 hours. I'm making these as my own spin on the 100 days of code, and I'll be using various engines and tools to make the games, and art/animations/music when required. The focus here is to learn and test ideas, and to have fun! :)</em></p>\n<p><em>As a programmer, my general focus is on mechanics, not art nor music, but there will be games where I'll challenge myself to make better-looking drawings and music. </em></p>", "metacritic": null, "released": "2018-02-15", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/2c0/2c01dcd1128b0145ad09768d1feb44bb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 15, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Gabriel Naves"], "genres": ["Action", "Platformer"], "publishers": [], "esrb_rating": null}