{"id": 20097, "slug": "donyoku", "name": "Don'Yoku", "name_original": "Don'Yoku", "description": "Description<br/>If you love shoot ‘em up and you love ‘em hard, with glorious music, with screen filling bullet patterns and huge token cancels, then Don’yoku is just for you!<br/>Don’Yoku is a Shoot ‘em up game, in the most traditional sense, a Shmup, fast, technical, hard and rewarding.<br/><br/>The game unfold during a fantasy 1920, where air pirates plague the Zeppelin routes and mercenaries, like our characters, fight for the rich bounties offered by travel companies.<br/>Take the role of the mythical Iron chin, the ruthless Baron or the mysterious Duchess, in a epic battle against their former mercenary companion, now turned pirates.<br/><br/>Wield the incredible powers of the Don’Yoku techniques, that focus ones greed into powerful beams, shields and even gigantic personifications of that controversial sentiment.Features<br/><ul><li>Pixel art hand made well, pixel by pixel.<br/></li><li>A simple yet rewarding scoring system, with huge walls of bullets and huge cancels.<br/></li><li>Fight for the most honourable of game tokens; Gold coins<br/></li><li>The more coins you hoard, the more difficult, and profitable, the game become, up to crazy impossible levels, so keep in check that Don’Yoku (greed).<br/></li><li>Five levels, each with a different style and a unique boss.<br/></li><li>Incredible melodic hard-rock soundtrack, from Antonio S, will blow your socks off.<br/></li><li>Play it your way, bindable controls, pad, keyboard and arcade stick supported, Tate or Yoko it, and, for the unfortunate who do not own a old and battered CRT monitor, the ‘back to the 90′s’ mode, will transform your state of the art lcd ultra flat 90′’ into a buzzing and flickering arcade leftover; the way it’s meant to be played..</li></ul>", "metacritic": null, "released": "2015-06-29", "tba": false, "updated": "2019-08-28T22:08:50", "background_image": "https://media.rawg.io/media/screenshots/b21/b21cb196fe1eb2420fd40b6972454446.jpg", "website": "http://donyoku.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 54}, "playtime": 5, "achievements_count": 12, "ratings_count": 0, "suggestions_count": 308, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Dark-Spot Studio"], "genres": ["Action", "Indie"], "publishers": ["Dark-Spot Studio"], "esrb_rating": null}