{"id": 20106, "slug": "running-shadow", "name": "Running Shadow", "name_original": "Running Shadow", "description": "Running Shadow is a unique mix of a runner and fantasy RPG. Along with the simple game mechanics typical of this game type, it has a mythical plot full of secrets and intrigue. <br/>\r\nYou will try on the role of a fortunate thief and assassin in possession of a unique artifact: the Gauntlet of the Celestial Guardian stolen from the adepts of a dark and ancient cult. You will be gifted with wondrous and unique abilities, too. Get ready for an unending adventure full of risk: age-old castles, gloomy dungeons and treacherous enemy ambushes, dozens of most fascinating levels and unique quests. Enter the path full of danger and win the title of Master Shadow! <br/>\r\nFeatures: <br/>\r\n- Intriguing locations: noblemen’s castles, bandit layers, sewers, town prison, and many others<br/>\r\n- More than 20 unique characters, including elves, goblins, and majestic draconids<br/>\r\n- More than 8 outfits for the main hero, including swords, armor, and masks<br/>\r\n- Unique battle system: regular foes which you can fight with your sword, and the nefilims which are subdued by magic only<br/>\r\n- Secret elven tricks that you can learn to overcome obstacles<br/>\r\n- Special magic abilities which will let your character become a shadow, restore his mana, replenish his health and increase his rage while fighting the enemies; and, of course, the powerful Gauntlet you can also use in the battle<br/>\r\n- 300 collectible items which you can gather while fulfilling your quests", "metacritic": null, "released": "2015-02-20", "tba": false, "updated": "2023-07-29T14:40:28", "background_image": "https://media.rawg.io/media/screenshots/ba6/ba64a64018e0c36df54a12ddc5c584cf.jpg", "website": "http://running-shadow.com/", "rating": 2.35, "rating_top": 3, "added_by_status": {"yet": 11, "owned": 327, "dropped": 3}, "playtime": 1, "achievements_count": 40, "ratings_count": 16, "suggestions_count": 372, "game_series_count": 0, "reviews_count": 17, "platforms": ["PC"], "developers": ["Game Insight"], "genres": ["Action", "Adventure", "RPG"], "publishers": ["Game Insight"], "esrb_rating": null}