{"id": 201167, "slug": "ralph-n-ruby", "name": "Ralph N' Ruby", "name_original": "Ralph N' Ruby", "description": "<p>This game is a point-click-destroy type of game. It's going to have a huge amount of characters to choose from. Each character choice has it's own background and intro sound. I myself did not draw many of these characters. These were found at sites giving \"Free to Use\" gifs or sprites. The backgrounds were also found on \"Free To Use\" sites save for a few of them. There is also a set of music available for the game, all of the songs were made by me and are available for purchase at http://shaunnelson.bandcamp.com.</p><p>The idea came from the fact that I have a bunch of cats. I know they love to chase lasers or any fast moving thing on screen. So I wanted to make a game that would not only appeal to them but also people. Hopefully you guys enjoy it as much as I had fun making it. I had help from a good few people like Imperial, BananaLegs, and a few others.</p><p>The game will be updated periodically as more and more bugs are removed and more features are implemented into the game. The game will be available for PC, MAC, and Android, but not for iOS unless I'm later able to implement it. More games will be worked on like this and much bigger projects are on the way. Let me know what you guys think. As the game is still in development and needs some bug fixes. If you like it, it would help me a huge amount to donate so I can make even more games in the future. Donate at Patreon.<br/></p><p>Also, much of the game has been downloaded from picture servers like pixabay and other servers for the sounds and sprites. If any of those pictures or sounds or sprites belong to you and I have not included the attribution or if the file is not allowed to be for public use. Please let me know and I will attribute you or replace the file. I pretty much just downloaded and worked on this game as fast as I could and I have ADHD and Aspergers so it would be more helpful for you to let me know so I can fix it rather than go out and find the names for myself. Thanks a lot.</p><p>Upcoming changes for the game:</p><p>Adding Highscore and Countdown Timer</p><p>Adding Multiplayer Competition</p><p>Adding Online features</p><p>Adding Changeable Effects When Clicking Sprites</p><p>Adding Sound When Object is clicked</p><p>Applying Bugfixes<br/></p>", "metacritic": null, "released": "2017-03-19", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/6e0/6e0b6f3ab022705b5ac4c017d5feeab5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 344, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Kiyoshiakira"], "genres": [], "publishers": [], "esrb_rating": null}