{"id": 201259, "slug": "pack-snack", "name": "Pack Snack", "name_original": "Pack Snack", "description": "<p>Made for the 2017  Github Game Off (and in like 2 days because I found out about it really late).</p>\n<p>A very (very) simple game that combines Snake, with the ghosts trying to kill you in Pacman. The ghosts basically move around randomly and if they touch your head, you die, but if they touch part of your tail, it will be cut off from that point (i.e. you will be shortened).</p>\n<p>Initially this was going to be a bit more advanced, but I started working on it very late so didn't have the time to make it what I wanted it to be. These are some things I wanted the gameplay to have (and if there's interest I'll implement).</p>\n<ul><li><strong>Multiple levels</strong>: The map would feature obstacles to avoid, and the goal is to reach a certain length in order to complete the level.</li><li><strong>Powerups</strong> : such as don't get shortened when hit by a ghost (temporary invincibility), ability to temporarily kill ghosts.</li><li><strong>Audio</strong>: Some kind of simple audio effects would be nice. (and maybe I'll add it if I have time before the Jam ends)</li><li><strong>Proper animation and art</strong>: I'm going to work on getting actual art skills (seriously your eyes should be thanking me for not using custom art instead of boxes.</li></ul>\n<p><strong>Controls (very simple):</strong> Use WASD to change direction. At the start or when you die Space will reload/start the game.</p>\n<p>Please let me know what you think of the concept (and keep in mind this is the first playable game I've made, and also the first thing I've made with Godot).</p>\n<p>Hopefully you'll get some enjoyment out of this!</p>", "metacritic": null, "released": "2017-11-29", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/69d/69d1fe1517f75200be4bb38d0b8566bb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 8, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["therealwox"], "genres": [], "publishers": [], "esrb_rating": null}