{"id": 201363, "slug": "there-shall-be-light", "name": "There shall be light", "name_original": "There shall be light", "description": "<p>Don't let the darkness take over your world.</p>\n<p>Story:</p>\n<p>These strange body-less creatures coming from no where to invade your world. Your world is filled with Light and they want to turn it to darkness. You goal is to defend the portal and drive the intruders away. The only thing protecting you and the portal is the magic barrier but the enemies are weakening it gradually. The enemy fears the light so that's what you are going to use. Chop trees to make torches. Use them to scare and hurt the creatures. Place them near the barrier to keep the creatures away So that the barrier can repair itself and expand. If you expand it enough the light will be too much for them and your enemies will be forced to leave.</p>\n<p>Controls:</p>\n<p>Move with WASD or Arrow keys <br/>P is the action key. Use it to pick up/place torches, chop trees and make torches from chopped trees. <br/>Move the camera around with mouse to screen edges and zoom in/out with mouse wheel.</p>\n<p>Note:</p>\n<p>The game contains several bugs.. Some hilarious, some intended and the rest I will be fixing soon in sha' Allah :)</p>\n<p>Edited: Updated the game and removed some major bugs. There is only one bug remaining. Until its fixed watch your head while chopping those trees :D Only real issue now is that - smart brains that I am - I forgot to implement the winning and losing conditions. It's my first time doing this so I guess I was too caught up in implementing the main game-play stuff and forgot. Anyway for honesty's sake I'm not adding it here so you will just have to fool around knowing its a no win no lose situation :D Have fun!<br/></p>\n<p>Edited: Okay, so don't worry about the tree falling on your head no more. Now when you are chopping a tree it will fall reasonably to your left :) </p>\n<p>Windows Link: https://drive.google.com/open?id=0B-L67SwV_UlmZlRUZ2pGaVV4bTA</p>\n<p>Most of the graphics are not mine. I will be putting proper acknowledgement soon in sha' Allah.</p><p>Edited: Here is a list of the graphics I used in this game and link to them (Thanks to everyone for their precious work.. It made this game possible) :<br/></p><p>The rabbit character + the terrain: https://www.assetstore.unity3d...<br/></p><p>The trees: https://www.assetstore.unity3d...</p><p>The portal: https://www.assetstore.unity3d...</p><p>The torches: https://www.assetstore.unity3d...</p><p>The body- less creatures: https://www.assetstore.unity3d...</p><p>As for the music and sounds, I made the main background music using Fl Studio, the torch placing sound using jfxr and downloaded the wood chopping sound from here  http://soundbible.com/290-Axe-...</p><p>Thank you!</p>", "metacritic": null, "released": "2017-04-28", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/294/2949d8efeabe515cf78d7bebe44b6825.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 43, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Furious_Witch"], "genres": [], "publishers": [], "esrb_rating": null}