{"id": 201395, "slug": "space-defenders-3d", "name": "Space Defenders 3D", "name_original": "Space Defenders 3D", "description": "<p>Space Defender is a 3D third person base defence shmup, consisting of progressively difficult waves of enemies, with the player defending the core in the center of the map from enemy space craft that increase in frequency and numbers spawned as the waves consistently increment. <br/><br/><br/>Story<br/>You have discovered a plot to destroy your space station and you ordered all the workers and civilians to depart the station until the threat has been eliminated. It is your job as the captain of the space station to controls an unmanned fighter and desperately trying to stop the enemy bombers from causing enough damage to the space station's power core to cause it to implode, thus causing the shield generator for the space station to deplete so that enemies mother ship can make a final attack to destroy the space station. Good luck Captain!!!<br/><br/></p><p>Key Features<br/>Controller (xbox360 untested with others)<br/>Online Leader Boards<br/>Increasingly Difficult Waves<br/>Rapid Fire Power Up<br/>Auto Updater <br/><br/><br/>Goal<br/>Your goal is to defend the core of the space station against squadrons of enemy bombers by shooting them with guns that fire forwards from launchers under your ships wings. <br/>Avoid hitting the enemies yourself or you lose. Survive 10 waves and you win and receive a score based on the remaining core health and shots fired. If the core is destroyed will have lost the game so, defend it well.<br/><br/><br/>Atmosphere &amp; Mood<br/>Space Defender is set in a space an industrial space station that has been around for a few years that has some tarnish, dirt and weathering that has good lighting and sign that it is still populated in short a space station that is not brand new and is showing some signs of wear and tear with bright active power core. <br/><br/></p><p>Minimum System Requirements<br/>OS: Windows XP SP2+ or Later<br/>Processor: 2 GHz Intel Core I3 Dual Core Processor or Better<br/>Memory: 4GB Ram or Better<br/>Graphics: Nvidia &amp; AMD (512MB VRAM)<br/>DirectX®:9.0 (shader model 3.0) or DirectX®:11<br/>Hard Drive: 250MB HD space</p><p>you can also find any of our other game or electronics projects on our web Site</p><p>http://www.megabitstudios.net/</p><p>or any of the Socials</p><p>Steam https://steamcommunity.com/groups/Meg...<br/>Twitter https://twitter.com/MegaBitStudios<br/>Facebook https://www.facebook.com/megabitstudi...<br/>ModDB http://www.moddb.com/members/megabits...<br/></p>", "metacritic": null, "released": "2017-03-28", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/72e/72edf7e09f1b093e686809176abd68fa.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 108, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MegaBitStudios"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}