{"id": 20151, "slug": "absent", "name": "Absent", "name_original": "Absent", "description": "Absent is a story which follows the character of young-adult and college student, Murray Schull. He and his two best friends, Eve and Steve, attend a college in which students are disappearing daily. It’s up to them to find out how this is happening, why this is happening, protect their other friends, and to put a stop to it once and for all.<br/>\n<br/>\r\nThis series of events began when Crystal, a three month girlfriend of Murray’s friend, Steve, disappeared on her way home from college via mysterious means. Over the course of the investigation, however, Murray realizes that the abduction of Steve’s girlfriend was not from anything of this earth. Murray is haunted by visions of the past and future, confronted with puzzles, with friends turning against each other, and all for one reason. The Reaper.<br/>\n<br/>\n<br/>\r\nSpecial Features<br/>\n<br/>\r\n-A point/click, easy to use interface.<br/>\r\n-Approximately twenty NPC's to interact with.<br/>\r\n-Around forty playable rooms in the whole game.<br/>\r\n-A completely original story with original art and characters created by James Fenton.<br/>\r\n-A game so varied, I flipped a three sided coin to choose it's genre!<br/>\r\n-Full Voice Acting, including the talents of Esme Brand, James Fenton, Shannon Hayes, Rebecca Hanssen and Matt Haynes.<br/>\r\n-Full MP3 Soundtrack composed by Adam Haynes.<br/>\r\n-It's completely free!", "metacritic": null, "released": "2015-08-31", "tba": false, "updated": "2022-09-06T07:26:11", "background_image": "https://media.rawg.io/media/screenshots/6b4/6b4d20633f9054f8d8a9c9ad2b0207ef.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 270, "beaten": 4, "toplay": 1}, "playtime": 1, "achievements_count": 6, "ratings_count": 4, "suggestions_count": 212, "game_series_count": 0, "reviews_count": 4, "platforms": ["PC"], "developers": ["FNGames"], "genres": ["Adventure"], "publishers": ["FNGames"], "esrb_rating": null}