{"id": 20157, "slug": "jump-tanks", "name": "Jump Tanks", "name_original": "Jump Tanks", "description": "Humanity is in a precarious state. Radical factions squabble over scarce resources, and the best way to earn a day’s rations is to own an armored jumping tank. Luckily, you have three.<br/><br/>Jump Tanks is a online multiplayer combat shooter where it's us-versus-them until the battlefield is littered with broken machines. Prepare for explosive, frenetic matches where you'll dodge rockets and pounce from rooftops through storms of bullets.<br/><br/><strong>Build your Battalion</strong><br/>Customize three different tanks to take into battle. Don’t like your gun? Pick a new one. Need another jump to get the drop on the enemy? Swap in different legs. Millions of custom tank builds await you.<br/><br/><strong>Each Battle is Personal</strong><br/>Coordinating with your teammates is crucial to gain an edge over your opponents. Stick close to your ally to earn a special buff. Avoid your rival, who has an advantage over you.<br/><br/><br/>The future may look grim, but with you behind the controls and your team by your side, there is hope. See you on the battlefield!<br/><br/><strong>US, Europe and Japanese Servers</strong><br/><br/><strong>Additional Features:</strong><br/><ul><li>All future Arenas and Game Modes will always be free!</li></ul><ul><li>8 Pilots and 64 parts - More to come</li></ul><ul><li>5 Dynamic Arenas - Time of day, enemy locations, short cuts and hazards change each match</li></ul><ul><li>Hunter Game Mode - Seek and destroy your enemy's Hunter while protecting your own</li></ul><ul><li>Drop-in or out of a match at anytime</li></ul><ul><li>Fight against AI Turrets while waiting for other players to join a match</li></ul><ul><li>\"How to Play\" menu to help new players learn the basics</li></ul><br/><strong>Jump Tanks Deluxe Edition includes the Original Soundtrack and Digital Artbook.</strong>", "metacritic": null, "released": "2016-03-08", "tba": false, "updated": "2019-07-25T16:17:27", "background_image": "https://media.rawg.io/media/screenshots/963/963bb1e9b415ac36112ea5b19666f7b9.jpg", "website": "http://www.jumptanks.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 479, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Mechanical Butterfly Studios"], "genres": ["Action", "Indie"], "publishers": ["Mechanical Butterfly Studios"], "esrb_rating": null}