{"id": 201841, "slug": "roadie-hero", "name": "Roadie Hero", "name_original": "Roadie Hero", "description": "<p>live the droll life of a professional roadie in two thousand and sixteen. Experience for yourself the thrill of tuning a guitar with new <em>GOLDEN </em>strings put in by a full of himself lead guitarist. The true roadie experiene starts here.</p><p>arrow keys to move</p><p>enter or space to advance text</p><p><strong>in tuning minigame:</strong></p><p>q, w, e, r, t, y will tune the strings, with q being the top string, and y being the bottom string. tap each button and try to get it in the correct range. Be careful, you can go <em>over</em> the range, and the strings will fall out of tune while you aren't pressing them.</p><p>press enter or space when every string is tuned. </p><p>self-evaluation:</p><p> Overall I'm fairly satisfied with where the game is at this point. I wish I hadn't spent a lot of time attempting to figure out how to get sound to work, because it took a good chunk of my development time and I felt like I got nowhere, and felt a tad more strapped for time because of that. The tuning minigame at its core works and feels alright, but there needs to be a lot more audiovisual feedback associated with it. Something I wanted to do in addition to making sound work was make the strings vibrate up and down with each keypress, something which I almost got working but had a few extra bugs to work out. </p><p> Something that also definitely needs to be integrated is more player interaction within the game world. There needs to be something to do within the \"overworld\" so to speak, because as of now its basically thrown in there to get you into the tuning minigame. A good chunk of the game is going to take place there, so it needs to be fun to play in. In addition, there needs to be more to do in the dialogue screen, but it's pretty much just basic choices, so other than that it's just adding more of it. </p><p> I'm looking forward to the audiovisual part because I think I'll really get to make my game feel the way I want it to. </p><p>Self-Eval 2:</p><p>Overall I'd say the main thing I'm disappointed with was my inability to get the sound working on the tuning minigame. I saved it for last because I had gotten it half-working during the first pass but had so many weird edge cases that made it barely function here that I elected to exclude it.</p><p>With the art I'm fairly satisfied with what I have thus far (though for some reason some of the sprite for the main character seemed to be lost in transmission, not sure what happened there though it can be easily remedied). Though I intend to create more detailed sprites that animate for the dialogue sequences, as well as more detailed walk cycles for the overworld. The kind of silly song I wrote doesn't seem to fit as I was going for something kind of light to balance any heaviness coming from the game itself, but the issue is that the heaviness isn't there yet (and also I think the midi synth sounds like garbage, but I was limited in my options). I may rewrite it or resequence it in a better sequencer, or just see how it fits when more of the writing is integrated.</p><p>Next pass I'm going to focus on the writing and creating adventure-game-y scenarios that will hopefully make the game feel a fuller experience. I plan on patching up the existing dialogue sequence, adding options, specific sprites for it, and I'm going to get the sound for the tuning game working finally probably hopefully.</p>", "metacritic": null, "released": "2016-10-22", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/52e/52e1b73acc613168c2b6abeb67965c77.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 19, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["nichow"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}