{"id": 20194, "slug": "overcast-walden-and-the-werewolf", "name": "Overcast - Walden and the Werewolf", "name_original": "Overcast - Walden and the Werewolf", "description": "<p>Amnesia was a big success as a game of its genre – story driven horror with exploration and environmental puzzles. Overcast tells a story of an old hunter, living in complete solitude in the forest near the remote village. But players will have to deal with the fact, that now there’s a dangerous creature, that’s been haunting every human around, killing every resident of the village and now it’s the hunter’s turn.<br />\nThe game offers similar mechanics to the source of main inspiration – Amnesia. Players will have to carry a lantern and hunt down several monsters in each of a few in-game chapters. Unlike Amnesia, Overcast has gunplay, map system, and scarce checkpoints, adding the high risk of replaying the chapter from the beginning, if players lost focus and made a mistake of dying too close, to the end of the chapter. The original game soundtrack is using guitar compositions to set the tone and ease the tension after the horror scenes or jump-scares. There are three distinct monster types, and each of them introduced from a first-person perspective of the said monster, adding to the tension. The game gained a surge of popularity, due to the game being played and recommended by several big YouTubers.</p>", "metacritic": null, "released": "2014-04-18", "tba": false, "updated": "2024-04-06T13:14:09", "background_image": "https://media.rawg.io/media/screenshots/869/8694944f8bbdf77789274beee9f15be7.jpg", "website": "http://www.microblastgames.com/", "rating": 1.71, "rating_top": 1, "added_by_status": {"yet": 71, "owned": 1660, "beaten": 6, "toplay": 2, "dropped": 16}, "playtime": 4, "achievements_count": 0, "ratings_count": 75, "suggestions_count": 399, "game_series_count": 0, "reviews_count": 75, "platforms": ["PC"], "developers": ["Microblast Games"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Microblast Games"], "esrb_rating": null}