{"id": 20218, "slug": "canyon-capers", "name": "Canyon Capers", "name_original": "Canyon Capers", "description": "<p>Canyon Capers is a 2D platformer game.</p>\n<h3>Plot</h3>\n<p>The main character, DinoJr, is out on a quest of exploring different dungeons, canyons, and caves and hunting for great treasures hidden there. Other characters are unlockable through playing, with their unique traits and different approaches to each level. The levels in the game vary in goals and activities, wherein some there is a time limit to complete the run, while in others the player has to score some points by collecting trophies and defeating enemies.</p>\n<h3>Gameplay</h3>\n<p>The game follows a pattern set by the classic retro platformers: the player controls a character who can jump, get rid of enemies by landing on top of them and collect different upgrades. While at that, the game offers different challenges in the form of puzzles to solve and 50 different levels with progressing difficulty. Various types of enemies and dangerous traps await at each map, but the player can restore his progress after dying - the character respawns at the last haven.</p>\n<h3>Visuals and other features</h3>\n<p>As mentioned before, the game aims at giving its players the feeling of playing a retro platformer. Thus, the graphics are very cartoon-like, with characters having a simple, yet excellent and loveable design, and the backgrounds and other textures having much detail and work into them. The game also has a variety of achievements to obtain, as well as Steam Marketplace integration with a plethora of Steam Cards awarded for playing the game and completing some achievements.</p>", "metacritic": null, "released": "2014-04-25", "tba": false, "updated": "2023-11-13T18:00:05", "background_image": "https://media.rawg.io/media/screenshots/f2c/f2c1cda97fd642dc9809fee6b14728bf.jpg", "website": "http://crazymoogames.com/games/canyon-capers/", "rating": 1.86, "rating_top": 1, "added_by_status": {"yet": 40, "owned": 1228, "beaten": 3, "toplay": 1, "dropped": 17}, "playtime": 3, "achievements_count": 30, "ratings_count": 49, "suggestions_count": 426, "game_series_count": 0, "reviews_count": 49, "platforms": ["PC"], "developers": ["Crazy Moo Games"], "genres": ["Action", "Casual", "Indie"], "publishers": ["Kiss"], "esrb_rating": null}