{"id": 202244, "slug": "animal-jam-eremiell", "name": "Animal Jam (Eremiell)", "name_original": "Animal Jam (Eremiell)", "description": "<p>You’re an endangered species shelter manager. New animals are showing up at your shelter much faster than you’d really like.</p>\n<p>You need to push them out of gates as fast as possible to make space for new animals to be delivered and put them into right habitat to flourish. (Habitats implemented, but not effects on animals.)</p>\n<p>You also want them to reproduce, so putting the same species together is high priority. (Scoring not implemented.)</p>\r\nHow To Play\r\n<p>The game is played on keyboard. Arrows to move around, spacebar is select, return is skip phase/cancel.</p>\n<p>Each turn has three phases.</p>\n<ol><li>In first, you can move one animal by one space.</li><li>In second, you can remodel one space into another habitat.</li><li>In third upkeeping is done, animals delivered, shelter extended, …</li></ol>\n<p><strong>Good luck!</strong></p>\r\nTech used\r\n<p>Game is written in C++17 with use of SFML and nlohmann/json<br/></p>\r\nBuilding\r\n<p>To build your own, you’ll need a compiler that supports optional, string_view, filesystem, and some general C++17 stuff. Quickfix to circumvent filesystem not supported on MinGW is present. You’ll also need the two libs mentioned.</p>\n<p>After building the game, uncompress the assets archive into the same directory the binary is present.</p>\r\nRunning\r\n<p>To run the Linux build, you need SFML installed from your repos.</p>\r\nTrivia\r\n<p>This game was originally conceived for Ludum Dare 40 with theme \"The more you have, the worse it is\"</p>\n<p>We managed to fit several cross themes in, including One Game a Month Month 60 theme - \"Jam\", Weekly Game Jam Week 21 theme - \"Save a Life\", and 2nd Kajam theme - \"Sound Effects\".</p><p>Sources are available on GitHub.<br/></p>", "metacritic": null, "released": "2017-12-07", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/820/8200d238de045b0bbd4fc1fba95a2868.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 26, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux"], "developers": ["Eremiell"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}