{"id": 20234, "slug": "rpg-maker-2000", "name": "RPG Maker 2000", "name_original": "RPG Maker 2000", "description": "For the first time, RPG Maker 2000 is available in English! Since its debut 15 years ago, the beloved game-making engine has introduced untold amounts of users to the wonders of game design and continues to be a powerful, user-friendly tool. No other engine in the RPG Maker series comes closer to the classic late-80s/early-90s feel, with graphics and a battle system that hit the nostalgic sweet spot while still offering huge opportunities for innovation. With a brand new translation and updates, this is the best version of the classic engine you’re going to find!Key Features:<strong>-Classic Front-View Battle System:</strong> Recalling the earliest days of the console RPG, this vintage layout hasn’t lost its thrill. Creating fights can be learned in minutes but there is major potential for surprising, dynamic battles once all the different conditions and events are mastered.<br/><br/><strong>-Straightforward, User-Friendly Interface:</strong> RPG Maker engines are designed to be as flexible as possible while still being user friendly, and RPG Maker 2000 is one of the earliest examples. Virtually everything in the engine is managed through a simple point-and-click interface. All of your game’s characters, enemies, skills, animations, and equipment are created and stored in an easy-to-navigate database. An in-depth event system contains dozens of functions to help make your story and world come to life, such as custom messages, character movement, player choices, special effects, and more. Plus, RPG Maker 2000’s powerful map editor is extremely easy to master, allowing you to craft your world tile by tile with unprecedented efficiency!<br/><br/><strong>-Retro Aesthetic and Huge Customization</strong>: RPG Maker 2000 allows you to create games that look just like ones from the storied history of console RPGs. However, the possibilities go far beyond the graphics that come with the engine. If you’re feeling especially creative, RPG Maker 2000 allows you to import custom 16-bit graphics, including character sprites, tilesets for your environments, battle animations, backgrounds, and more! The engine is also loaded with a variety of catchy midi tracks and sound effects for your game; custom WAV and MIDI tracks can be added as well.<br/><br/><strong>-Share Your Game</strong>: Want to share your creation with the world? You can export your creation in a portable file that can be played on ANY Windows system! Plus, games made with RPG Maker 2003 can be sold as long as you have the appropriate rights and have followed the registration procedure. With some hard work you could become the next great indie game developer!", "metacritic": null, "released": "2015-07-13", "tba": false, "updated": "2022-09-16T04:21:08", "background_image": "https://media.rawg.io/media/screenshots/c4f/c4f09eac41d6570816bd742ceaf903b8.jpg", "website": "", "rating": 3.33, "rating_top": 5, "added_by_status": {"yet": 5, "owned": 112, "beaten": 2, "toplay": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 6, "suggestions_count": 233, "game_series_count": 0, "reviews_count": 6, "platforms": ["PC"], "developers": ["KADOKAWA"], "genres": [], "publishers": ["Degica"], "esrb_rating": null}