{"id": 202349, "slug": "bowling-the-scream", "name": "Bowling The Scream", "name_original": "Bowling The Scream", "description": "\"Bowling The Scream\" by Ray Hung<p>This game is inspired by \"<em>The Scream</em>\" by Edvard Munch. </p><p>I have seen a lot of memes making fun of this famous artwork, although the context had nothing to do with any positive emotion. It was describing the person's panic, fear and anxiety, which make the him/her screamed. So, I'd like to create a game that recreate the fear in an interesting way, which is a bowling game. I believe that by throwing a giant bowling to a person who stands still would absolutely makes him/her screams. <br/></p><p>First of all, I used Maya to model the screaming person and I imported the model into Unity. Then I looked into the general design of bowling alley. I applied the wood textures from asset store and designed the alley to be a wooden bridge with fences. And I photoshopped the skybox and made it orangish and more painting-like as well. Thus the game view would correspond to the painting more strongly. </p><p>Then I started coding the game functions, like changing force of throwing ball, controls of sound effects. The hardest part was restricting the rotation angle. Angle is 0 degree to 360 degree in Unity. That is, it is hard to calculate negative degree if I want to restrict the rotation within -30 degree to 30 degree. But hopefully my class teacher Robert helped me solved the issue. He asked me to use Mathf.Clamp to limit the angle and then do the calculations. </p><p>Lastly, I added a restart function so players can play it without refreshing the page while playing in the browser.</p>", "metacritic": null, "released": "2016-10-24", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/529/529cc4cca4bb0cfe320127631c5a8ce2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 26, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["hungk901"], "genres": [], "publishers": [], "esrb_rating": null}