{"id": 20247, "slug": "dragon-quest-heroes-slime-edition", "name": "DRAGON QUEST HEROES Slime Edition", "name_original": "DRAGON QUEST HEROES Slime Edition", "description": "<strong>The Digital Slime Edition for PC includes eleven additional goopy Slime Weapons and two bonus maps! </strong><br/><br/><ul><li>Splat O'Nine Tails<br/></li><li>Slime-On-A-Stick<br/></li><li>Slime Sword<br/></li><li>Gooreat Sword<br/></li><li>Gungenir<br/></li><li>Gooey Gloves<br/></li><li>Happy Map<br/></li><li>Goomerang<br/></li><li>Goopid's Bow<br/></li><li>Squishing Rod<br/></li><li>Gold-Digger's Map<br/></li><li>Fandangoos<br/></li><li>Goolden Axe</li></ul><br/>In DRAGON QUEST HEROES: The World Tree’s Woe and the Blight Below, the protagonists must rise up against seemingly insurmountable odds, facing off against swarms of enemies and gigantic monsters in an exhilarating action game. Filled with characters and monsters designed by world-renowned artist Akira Toriyama, DRAGON QUEST HEROES: The World Tree’s Woe and the Blight Below will be available on PC in beautiful HD graphics.<br/><br/>Story<br/>When a dark shockwave sweeps through the city of Arba, the monsters that once lived peacefully alongside the people are driven into a frenzied rage. As either the hero Luceus or the heroine Aurora, the player joins forces with a cast of fan favorites from previous DRAGON QUEST titles, such as Alena, Bianca and Yangus, to bring the rampaging hordes of monsters to their senses and restore order to the kingdom.Key Features:<ul><li><strong>Overpower Hundreds of Monsters</strong> – Swing into action against seemingly impossible odds and become the hero of the battlefield. Cleave through relentless swarms of monsters and fight against gigantic foes in an epic clash of good versus evil.<br/></li><li><strong>Fight Alongside Legendary Characters</strong> – Players can embark on a journey with some of the most beloved characters  of the DRAGON QUEST series – all voiced – to form their own party of four and stride into battle. From the sultry Maya of DRAGON QUEST IV fame to Yangus, the thief with a heart of gold from DRAGON QUEST VIII, the player’s party will always be full of character.<br/></li><li><strong>Strategy-Oriented Battles</strong> – Players can level up each character and upgrade their unique spells and abilities. Swapping between characters strategically and unleashing the right skill at the right time will help players survive the toughest battles.<br/></li><li><strong>Collect Monster Medals to Turn the Tide</strong> – Gather monster medals from defeated foes to bring them back to the battlefield as allies or to take advantage of their special skills. Up to 24 monsters can fight by the player’s side at any one time.<br/></li><li><strong>Legendary Trio of Creators </strong>– The title comes to life in beautiful high-definition graphics for PC with a host of distinctive characters and monsters designed by world-renowned artist Akira Toriyama. Both Yuji Horii, director and creator of DRAGON QUEST, and Koichi Sugiyama, the composer closely tied to the series since its first installment and creator of countless memorable musical masterpieces, are working on this full-scale action RPG.</li></ul><br/><br/><strong>Graphics options supported for high end PCs:</strong><br/><ul><li>Rendering resolution<br/></li><li>Shadow processing<br/></li><li>Glare adjustment<br/></li><li>Turning movie scene playback on and off<br/></li><li>Number of characters displayed<br/></li><li>Draw distance <br/></li><li>Texture Quality</li></ul><strong>Support for both full-screen and windowed display modes<br/>Support for a maximum frame rate of 60fps<br/>Support for full HD display at a maximum resolution of 1920 x 1080</strong>", "metacritic": null, "released": "2015-12-03", "tba": false, "updated": "2023-06-19T00:48:03", "background_image": "https://media.rawg.io/media/screenshots/ab5/ab5697e4e97607673a9899c23cb70c16.jpg", "website": "http://dragonquest-game.com/heroes/", "rating": 3.3, "rating_top": 3, "added_by_status": {"yet": 4, "owned": 97, "beaten": 7, "toplay": 7, "dropped": 5, "playing": 2}, "playtime": 4, "achievements_count": 50, "ratings_count": 10, "suggestions_count": 644, "game_series_count": 0, "reviews_count": 10, "platforms": ["PC"], "developers": ["Koei Tecmo"], "genres": ["Action", "RPG"], "publishers": ["Square Enix"], "esrb_rating": "Teen"}