{"id": 2024, "slug": "rrootage-online-hd-ad-supported", "name": "rRootage Online HD (ad supported)", "name_original": "rRootage Online HD (ad supported)", "description": "Kenta Cho&amp;#39;s legendary shooter rRootage ported and optimized for iPhone and iPod touch!<br/>4 different modes, 160 stages total. Including music, SFX, online hi-scores and achievements. rRootage Online is Game Center and OpenFeint Enabled.<br/><br/>◆ Reviews for rRootage Online ◆<br/><br/>EUROGAMER (Rating 9/10):<br/>&amp;quot;rRootage Online is why Kenta Cho releases his games in the way he does; it&amp;#39;s now got a chance to hit a new audience, and be enjoyed by many more people, in what feels like the definitive version.&amp;quot;<br/><br/>APP SPY (Rating: 4/5):<br/>&amp;quot;...for those who consider themselves fans of the shmup genre, this is without a doubt a must buy.&amp;quot;<br/><br/>TOUCHARCADE:<br/>&amp;quot;Anyone who enjoys a nice 2D shooter should grab this one instantly.&amp;quot;<br/><br/>WHATSONIPHONE (Rating: 4.5/5):<br/>&amp;quot;rRootage is a classic game faithfully rendered on the iphone&amp;quot;<br/><br/>FINGERGAMING:<br/>&amp;quot;rRootage offers much more variety than the typical App Store shoot-’em-up [...]. Shooter fans should definitely check this one out.&amp;quot;<br/><br/>POCKETGAMER:<br/>&amp;quot;The fact that this gem is available on the App Store is great news.&amp;quot;<br/><br/>THEPORTABLEGAMER:<br/>&amp;quot;If R-Type was too simple for you, or DoDonPachi Resurrection was something you completed with one eye closed while doing one handed pushups, then this is worthy of your time and money.&amp;quot;<br/><br/><br/>Controls:<br/><br/>* Touch and hold to move ship<br/>* Second touch to trigger special<br/>* Double tap to pause game<br/><br/>Menu:<br/>* Touch the squares to select mode/stage<br/><br/>Game:<br/><br/>Control your ship and avoid the barrage. Use the laser to destroy the battleship of the enemy. You can cause more damage if you fire the laser close to the enemy. When all ships are destroyed, the game is over. The ship extends at 200,000 and every 500,000 points.<br/><br/>. Normal Mode<br/><br/>This is the standard game mode.<br/>- Special -&amp;gt; Bomb<br/>The bomb wipes enemyies bullets. The number of bombs are displayed at the left-down corner.<br/><br/><br/>. PSY Mode<br/><br/>As your ship grazes a bullet, the graze meter (displayed at the right-down corner) increases. When the graze meter becomes full, the ship becomes invincible for a while.<br/>- Special -&amp;gt; Rolling<br/>This movement widens the range the ship can graze. <br/><br/><br/>. IKA Mode<br/><br/>Your ship has two attributes, white and black. All bullets also have these attributes, and your ship can absorb bullets that have the same attribute. Absorbed bullets are changed into lasers automatically.<br/>- Special -&amp;gt; Attribution change<br/>Change your ship’s attribute.<br/><br/><br/>. GW Mode<br/><br/>Your ship can use the reflector. The reflector reflects bullets around your ship.<br/>- Special -&amp;gt; Reflector<br/>To use the reflector, you have to activate special until the reflector meter (displayed at the left-down corner) becomes empty. You can use the reflector only if the reflector meter displays &amp;#39;OK&amp;#39;.", "metacritic": null, "released": "2010-07-09", "tba": false, "updated": "2019-10-22T14:27:57", "background_image": "https://media.rawg.io/media/screenshots/345/345ad2115ad57416721e67e561219ae1.jpeg", "website": "http://www.fraglab.at/rrootage/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 155, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["fraglab.at"], "genres": ["Action", "Arcade"], "publishers": ["Miko Wohlgemuth"], "esrb_rating": "Everyone 10+"}