{"id": 202564, "slug": "extra-bones-cryptic-quest", "name": "Extra Bones Cryptic Quest", "name_original": "Extra Bones Cryptic Quest", "description": "<p>(Best played in fullscreen) </p><p>Extra Bones Cryptic Quest is a short text adventure which sees you explore the mysterious Changeling Island: a place of varied locales, intriguing characters, and perplexing mystery.<br/></p><p>This online version is slightly adapted from the original project, which was a site-specific installation (details below, if you're interested).</p><p>There are a few issues depending on the browser you use: the random text generator has fallen over, and not all browsers seem to support .ogg files, and there's an intractable problem escaping the Mid-Mountain Tomb Caves in one piece -- I'm in the process of updating it using Twine 2 and will smooth all of this out, I hope!</p><p>BACKGROUND<br/></p><p>Back in July 2013, Deptford-based arts pals Extra Bones were invited to undertake a two week residency at InSitu - a small venue in New Cross, SE London, in the abandoned entrance and cloakroom of the Paradise Bar. For the past 10 years or so, the space has languished in a state of disrepair; used only to store the Royal Albert's barrels and to provide a sparse roof over the heads of roosting pigeons, but for a period over the summer it became home to a series of short exhibitions and projects .</p><p>Inspired by Andrew Kerr's Hillside drawings for Good Press Gallery's Modern Masters show, we decided to use the space to make an evolving installation/programme of events based around ideas of adventure and exploration – real, fictional or somewhere in between. The hope was to provide an open, participatory space in which people could do or make things together, and to enjoy the camaraderie of a noble and purposeful quest.</p><p>Within the installation, the game was intended to weave together the different threads of the residency, using the mythology and folklore of a fantastical shape-shifting island that Andrew had created as its setting. I had a ready-made cast of characters and locations, as well as a structure off which to hang some of the Twine experiments I had been working on.<br/></p><p>The game was to be available inside the space to be played any time - in between performances and workshops - and without any great commitment. Nothing too game-y; more of a story with game elements. The space itself was a mix of museum stores and Explorers Club trophy room – artefacts 'retrieved' from the Changeling Island – and the hope was that people could wander in, take a look at all of the relics or be involved in a workshop, and then set off and visit the Island in the game, enjoy the story, and to seek whatever treasures and secrets it had to hide. One was to reinforce the other.</p><p>So we built this peculiar cave of wonders. We covered the holes in the ceiling with a tarp, dumped a fetid, misty swamp inside the old ticket booth and filled the place with pseudo-museological objects – geology, art, tools, jars of coloured liquids…</p><p>The game was projected onto a wall behind the old cloakroom desk, underneath the billowing tarp that shielded the pigeons. We borrowed a PC and a big old trackball mouse, which mounted on a carved wooden hand. I wish I'd kept track, but over the course of the fortnight there were a good few people who completed the game.</p><p>There are a few things that had to change to get it online, and it maybe loses some of the atmosphere just playing on a desktop computer, but I think it's a nice story and a fun game too. </p><p>Please let me know what you think if you have a go.<br/><br/></p>", "metacritic": null, "released": "2016-04-22", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/2ce/2ceb215bdd2b282a9a60912105d24e33.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 25, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Computergame Concern"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}