{"id": 202693, "slug": "cattack-2", "name": "Cattack!", "name_original": "Cattack!", "description": "<p>Welcome to a basic 80's-90's styled Arcade type game named \"Cattack!\" The basic premise is that you are a cat, (Hence the name, a combination of Cat and Attack), who needs to move and catch mice as well as treats, but stay away from water!</p><p><strong>This is the start screen!</strong><br/></p><p>Here is a basic outline of the instructions you can see anytime you launch the game. I will also describe how the game works here. Your character, the cat, is on the bottom of the screen and can move left by pressing 'a' and can move right by pressing 'd'! When you press 'w' your cat shoots a paw that travels up the screen until it hits a mouse or goes off the screen. You can't fire again until the paw is off the screen. Mice will travel down the screen until they get hit by a paw, hit the cat, or go off the screen. Every time you get hit by a mouse or if it goes off the screen you will lose a life (You start with 9). IF you catch a mouse with one of your paws you will gain 10 points. If your cat is hit by a raindrop you will lose 2 of your lives, and if your cat is hit by a treat you will gain 50 points!<br/></p><p><strong>This is the screen during gameplay!</strong><br/></p><p><strong>This is the screen when you lose all of your lives!</strong><br/></p><p>The \"Your Score\" number clears every time you play again, or re-open the game, but the \"High Score\" number doesn't clear ever unless you hit 'c' to to clear them!</p><p>This is about it for the game, but the fast paced movements and quick thinking strategy will keep you entertained, all the while feeling like you are back in an arcade! Keep in mind, this is my first ever real game, so I would love feedback and ideas! All profits from this game will go straight back into developing new games for you awesome people, but donating isn't required, its what its called, a donation, but if you do decide to donate, whether it be 10 cents or 10 dollars, I really appreciate it. Thank you for reading and <em>possibly</em> purchasing :D</p><p>Feel free to comment your high scores!</p>", "metacritic": null, "released": "2016-08-04", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["FalseHonesty"], "genres": [], "publishers": [], "esrb_rating": null}