{"id": 20261, "slug": "crouching-pony-hidden-dragon", "name": "Crouching Pony Hidden Dragon", "name_original": "Crouching Pony Hidden Dragon", "description": "Senseï is the undisputed chieftain. His followers are well versed in every extortion, infiltration and martial art. Pony and Biki are his best students, his pride and joy. The duo knows the secret chakra technique like the back of their hand (or hoof in Pony's case). Together they rule the city and its surroundings. Although everyone respects and fears them they are hunted by law enforcement agencies. <br/><br/>They are Ninjas. <br/><br/>Crouching Pony Hidden Dragon (CPHD) is a brand-new Action/RPG game developed for SNK’s Neo Geo console which came out in 1990.<br/><br/>It might look like a straight-forward arcade game, but under the surface is a persistent world with a rich and varied set of rules. In CPHD “Run’N Gun” mechanics from the likes Shock Troopers or Ninja commando are combined with playful “RPG” ones from games like Zelda or Secret of Mana. <br/><br/>You'll need to explore every level to find the resources necessary for your progress: coins, health bonuses, resurrection potions, special Ninja techniques, etc. Treasure chests are hidden everywhere. You’ll have to find them to afford equipment upgrades from the ninja shops. In addition Pony and Biki gain experience points by defeating enemies, becoming more powerful over time. Be careful though: you’ll have to use your resources wisely. Health is limited so if you don't equip yourself at the armory you're in for a hard time. Money is limited too however: you'll need to choose these investments carefully!<br/><br/>Make new friends: a local multiplayer co-op mode lets a second player drop in at any time. It’s even more fun, even more frantic and even more strategic!<br/><br/>Lose old friends: there are the same numbers of resources no matter how many players there are; will you share or will you hog everything? <br/><br/>Have a good adventure!Why create a game for Neo Geo?Several reasons pushed us to develop for this console. The Neo-Geo is a legend amongst consoles, and is the one we dreamed of throughout our childhood and teenage years. For this reason, when we decided to bring our main character “Ninja Pony” to life, we wanted his early adventures to take place in the Neo-Geo universe. Thus we are offering our beloved Pony this welcoming present: to be born into the world of this “Rolls Royce” of consoles. Having our character emerge on cartridge is a way of enshrining him in the Pantheon of video game heroes, alongside Sonic and Mario. It's a way of going back in time! It also made sense with regards to the character's back-story. Crouching Pony Hidden Dragon relates the teenage years of Ninja Pony. This parallels the advent of the Neo-Geo in the history of video games: this console personifies gaming's teenage years. <br/><br/>Last but not least there were technical challenges we were eager to overcome. We realized that there were very few traces of the tools and documentation required to develop games on Neo-Geo. What's more this arcane knowledge was gradually disappearing! <br/>We had to become archaeologists, investigating, looking for clues, piecing together how these games were developed. We created our own software and hardware pipe-lines, started working directly in pixel art again, etc. We were able to leverage our experience working on “modern” video games in returning to blow the dust off these old techniques. It was an exciting job, a true act of video game craftsmanship!Why bring the game to PC?When we announced the Neo Geo version many expressed regret at not being able to play the game. Since our main ambition at Le Cortex is to offer original play experiences to as many people as possible we wanted to avoid restricting the release to Neo-Geo connoisseurs and collectors. So we decided to port the game to the gamers' platform of today: the PC. And in case you were wondering this is indeed a full native port, not the Neo-Geo ROM being run via an emulator!About Le CortexLe Cortex is an independent French Studio located in Paris. We design, write and develop games which aim to offer brand new play experiences.", "metacritic": null, "released": "2014-07-11", "tba": false, "updated": "2019-09-17T10:46:57", "background_image": "https://media.rawg.io/media/screenshots/dd1/dd1592e7a10b85c60d33c624cef6e701.jpg", "website": "http://www.lecortex.com/CPHD/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 167, "beaten": 2}, "playtime": 1, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 402, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Le Cortex"], "genres": ["Action", "RPG", "Indie"], "publishers": ["Neko Entertainment", "Spawn Digital"], "esrb_rating": null}