{"id": 202708, "slug": "cosmos-planner-space-match-3-puzzle-2018", "name": "Cosmos Planner - Space Match 3 Puzzle 2018", "name_original": "Cosmos Planner - Space Match 3 Puzzle 2018", "description": "<p>Become a Cosmos Planner and make a Universe planning of your own.</p>\n<p>A new way to play match 3 puzzle game. Take a minute to learn, and enjoy hours of fun solving this challenging puzzle. If you are looking for a game to play while falling asleep, this may NOT be for you. Constant decision making is a MUST in this game as you are doing the planning of the Universes after all.</p>\r\nFeatures<p>● Refreshing match 3 puzzle: hierarchical matching provides a level of strategy to the game.<br/>● Free-to-play: free of charge, no banner-ads, no in-app-purchase.<br/>● Smooth and satisfying gameplay experience.<br/>● Global leaderboards and cloud sync of game data across devices (in the same platform) are supported. Note that cloud sync is not real-time as there is usually delay for the synchronization.<br/>● No Internet connection required so you can enjoy anywhere, anytime; unless you want to save your progress across devices, to share your score or to use the Coin Boost feature.<br/>● Built-in game guide.<br/>● Built-in screenshot sharing button to help you easily share a favorite moment with your friends.<br/>● Never ending match-3 game: No level, no time limit. How far you go depends on your skills and a bit of luck.<br/>● Cosmic theme: immerse into space and solve puzzle with colorful asteroids, planets and galaxy.</p>\r\nGameplay<p>● Align 3 or more cosmic stones of the same type to form a higher-level stone. Check in-game guide for more details.<br/>● When in need, you can make use of the Quick Craft feature to create a desired stone or to use an item immediately.<br/>● Tips: <br/> - Chained matchings (combo) earn significantly higher score than a single match 3+, along with other benefits.<br/> - The Coins Boost option at the end of a game is the chance for you to double the God Coins earned during the game by watching a short advertisement video.</p>\n<p>Create yourself a beautiful universe!</p>\n<p>Contacts: for any inquiry and feedback, you can reach us via the following channels<br/>- EMAIL: studiotigi@gmail.com<br/>- FACEBOOK: @tigigames<br/>- TWITTER: @studio_tigi</p>\n<p>Privacy Policy: https://studio-tigi.com/privacy/</p>", "metacritic": null, "released": "2017-12-06", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/8dc/8dccd79bb5b871bfd74f9d953a99510b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 14, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["TiGi Games"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}