{"id": 20274, "slug": "isbarah", "name": "Isbarah", "name_original": "Isbarah", "description": "Isbarah is a cross-genre of bullet hell and platformer style, it's a hardcore 2d game and each level is a duel boss fight.<br/><br/>In Isbarah, you have the standard platformer game controls and bosses will fight like in bullet hell games.<br/><br/>To survive, we have added three abilities to the gameplay:<br/><br/><ul><li><strong>Slow Motion</strong> : Will enable a time slow down in order to give the player time to analyze the situation around them and to make a wise move.<br/></li><li><strong>Dash</strong> : This ability allows you to make fast moves to any direction with perfect precision.<br/></li><li><strong>The Barrier</strong> : you can use it as a shield or a platform, whether to protect yourself or to help you climb higher.</li></ul><br/>Players will need to fully understand the boss patterns. It’s built on smartly managing your powers and using them wisely to survive - everything in our game involves dodging and making smart movements.<br/><br/><ul><li>90 unlockable contents<br/></li><li>3 difficulty modes <br/></li><li>18 epic fights</li></ul><br/>Live through the story of Isbarah with short comic strips in each level.The Story<br/>Playing Isbarah, you will be following Iria's journey through her lineage.<br/>Iria is a goddess and in order to prevent this world from falling into chaos, her father rules it with an iron fist - and Iria is his only weapon and shield; he uses her to harshly punish anyone that bends the law, and there is no mercy granted.<br/><br/>Isbarah is bound to the imaginary world that all humans fantasize of - encapsulating all their dreams and nightmares into.<br/>Every single thought made by human beings contributes to the shape and size of this world, creating an ever-changing universe full of creatures and landscapes.<br/>These creatures are called The Designed; they all have different shapes and their behaviour depends on the people who have created them.<br/><br/>Alongside these creatures, live also the Designless.<br/>These creatures are only concepts, they haven't been fully created by humans.<br/>These Designless creatures are desperate to evolve and become full designs, therefore, they are constantly infecting other full designs to become more powerful and eventually takeover their shapes.", "metacritic": null, "released": "2015-02-25", "tba": false, "updated": "2019-08-28T22:08:43", "background_image": "https://media.rawg.io/media/screenshots/d0c/d0c34a659aa0de72a905ccc58428b185.jpg", "website": "http://www.leikir-studio.com/isbarah", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 50, "beaten": 1, "toplay": 1}, "playtime": 5, "achievements_count": 38, "ratings_count": 1, "suggestions_count": 293, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "Linux", "macOS"], "developers": ["Leikir Studio"], "genres": ["Action", "Indie"], "publishers": ["Neko Entertainment", "Spawn Digital"], "esrb_rating": null}