{"id": 20271, "slug": "darkness-within-2-the-dark-lineage", "name": "Darkness Within 2: The Dark Lineage", "name_original": "Darkness Within 2: The Dark Lineage", "description": "‘Darkness Within’ is an adventure game series, inspired by the works of celebrated horror writer, H.P. Lovecraft. In this second instalment, ‘The Dark Lineage’, players once again take the role of police detective Howard Loreid, a man tormented by the paranormal happenings around him, in the first volume ‘In Pursuit of Loath Nolder’. Now, Howard discovers that his own terrible past has some connection to the madness that is about to swallow him, yet again.<br/><br/>The Dark Lineage will take you to places where the ‘things’ of the past still live, and all the memories that should be long forgotten are still recalled; including a sleepy, depressing town called Arkhamend, a Victorian mansion that conceals dark secrets, a dilapidated building hidden within forbidding, snow-clad woods and dim underground buildings and tunnels. The Dark Lineage is even more harrowing than the previous instalment, so prepare yourself for the descending darkness, this time will be your last...<br/><br/><strong>Darkness Within 2: The Dark Lineage ‘Director's Cut Edition’</strong> was specifically created for Steam, with many extra features not available in previous versions:<br/><ul><li>Graphical refreshes for most environments.<br/></li><li>A brand new location begging to be explored.<br/></li><li>Post screen Chromatic Aberration effect  and Color gradation effect create a more ‘cinematic’ look, drastically improving the overall visual effect.<br/></li><li>More balanced game-play with new additional puzzles and enhancements.Key features:<ul><li>Unlike Part 1,  Part 2 is no longer ‘point-and-click’, but plays in 3D, with the power of the NVIDIA PhysX engine ; so you can move anywhere you want, light up your way with light sources that cast real-time soft shadows and realistically lift up, push, pull or throw objects.<br/></li><li>Built-in Hint System with 3 Difficulty Levels – Players can choose to play in Standard, Detective, or Senior Detective modes.<br/></li><li>Dynamic Puzzles and Features: Traditional adventure game puzzles are complimented by deciphering dreams, underlining excerpts in documents to garner critical clues and interacting physically with the environment<br/></li><li>Enhanced Gameplay Experience: Compelling special effects, stunning visuals, and dynamic lighting and shading, in a ‘first person’ game environment.<br/></li><li>Eerie Gameplay Atmosphere: An immersive experience is created by a fascinating ‘Lovecraftian’ story, chilling realtime cut scenes, and haunting music.</li></ul></li></ul>", "metacritic": null, "released": "2010-06-10", "tba": false, "updated": "2023-04-29T22:08:31", "background_image": "https://media.rawg.io/media/screenshots/084/08421230c723ff789560a82efa53aed0.jpg", "website": "", "rating": 3.36, "rating_top": 4, "added_by_status": {"yet": 14, "owned": 308, "beaten": 9, "toplay": 5}, "playtime": 2, "achievements_count": 38, "ratings_count": 11, "suggestions_count": 530, "game_series_count": 1, "reviews_count": 11, "platforms": ["PC"], "developers": ["Zoetrope Interactive"], "genres": ["Adventure", "Indie"], "publishers": ["Iceberg Interactive"], "esrb_rating": null}