{"id": 2027, "slug": "pudding-monsters-hd", "name": "Pudding Monsters HD", "name_original": "Pudding Monsters HD", "description": "Sticky, curious… and DETERMINED TO GET BIGGER! <br/><br/>&amp;quot;ZeptoLab looks to have another hit on its hands&amp;quot; - Guardian <br/>&amp;quot;The most fun you can have with pudding&amp;quot; - Kotaku <br/><br/>From the makers of Cut the Rope, Pudding Monsters is a deliciously addicting puzzle adventure with wacky characters and innovative stick-‘em-together game-play. It’s casual fun for the whole family! <br/><br/>The Pudding Monsters are on a mission to save their friends from the cold-hearted fridge owner! Growing into an ULTIMATE MEGA MONSTER sounds like the most reliable plan. Can you give them a hand?<br/><br/>Off the table, out of the house, and into the city – swipe to stick the Pudding Monsters together and save their friends! <br/><br/>Take advantage of the different monster species and their powers (like the Slime Monster, who leaves a trail of green goo), boost your growth using the cloning machines, wear pretty little cars on your head and much more! <br/><br/>Features: <br/>● 125 levels with more free updates to come! <br/>● Innovative stick-‘em-together game-play mechanics<br/>● Unique monster shapes, wacky personalities and attributes <br/>● Fun and educational, mind-bending experience suitable for all ages <br/>● Great for kids and the young at heart – it’s all your children will be talking about!<br/><br/>ALREADY A FAN? CONNECT WITH THE PUDDING MONSTERS <br/>* Like us: http://facebook.com/zeptomonsters <br/>* Follow us: http://twitter.com/zeptomonsters <br/>* Visit us: http://puddingmonsters.com", "metacritic": null, "released": "2012-12-20", "tba": false, "updated": "2019-10-22T14:27:57", "background_image": "https://media.rawg.io/media/screenshots/38f/38fc8a26d6a45863864e3297bc385211.jpeg", "website": "http://zeptolab.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 70, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": [], "genres": ["Family", "Puzzle"], "publishers": [], "esrb_rating": "Everyone 10+"}