{"id": 202981, "slug": "shadow-fighter-heroes-kung-fu-mega-battle", "name": "Shadow Fighter Heroes: Kung Fu Mega Battle", "name_original": "Shadow Fighter Heroes: Kung Fu Mega Battle", "description": "<p>Shadow fighter heroes are ready to fight against various other samurai warriors in this shadow fighting of Kung Fu battle. Become an ultimate samurai shadow fighter and fight against other samurai fighters. Enjoy an epic shadow ninja battle where you can choose from many famous heroes and join the Kung Fu battle. Just select a shadow dark warrior for yourself and also upgrade his ability, strengthen him with your own choice. In this battle of fighting, you have to perform different incredible martial arts and powerful ninja battle skills for winning and becoming karate champion.<br/><br/>Shadow fighters with battle warrior is an inspiring and challenging concept where you can utilize your Kung Fu skills with power and intelligence to conquer the Kung Fu fight of shadow strike super war which has various modes. So, let’s start the battle with 20 different superhero characters and defeat the opponents with mind strategy using martial arts. Samurai Shadow ninja battle will provide you with 6 environments with an addictive 3D environment of combat where you have to show your dominant abilities of fighting to make your way to victory. Start the Shadow fighters kung fu combat battle and find out different ways to win the samurai shadow combat fight adventure by using kicks, karate, jump, and punches and become the best battle boy and karate champion of the tournament. Be a Shadow hero conquer every war against you and best trick for that is shadow karate skills. Shadow revenge is your core challenge and shadow strike is full of fun.<br/><br/>If you want to become a shadow king of death fighting then strike with ninja combat characters and be a shadow fighter hero of this season. Survive as a legendary warrior in this endless battle and destroy the enemies professionally in mutant samurai shadow battle. Challenge next rivals to become the best battle boy in the samurai shadow combat fighting. Choose your ninja combat shadow fighter with amazing fighting methods and experiences, just do your best to defeat all fighting rivals by enhancing your fighting skills in kung fu combat. Perform different stunts of martial arts as a shadow dark warrior in this death fighting game. Earn points after successfully defeating opponents and become karate champion in mutant shadow of death game.<br/><br/>There is also a training mode in which you can practice and enhance your shadow fighting skills for kung fu combat death fighting. Just jump into the ring against your opponent shadow fighter as a battle boy and win the ninja combat fighting game. Become one of the best legendary warrior of shadow kings and win this samurai shadow fighting. Download mutant shadow battle warrior now utilizes all your fighting methods in order to win this death fighting karate championship.</p>", "metacritic": null, "released": "2018-07-24", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/759/759129fb070ec57a5bd0fede6f4b2267.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 119, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Ehtesham12"], "genres": ["Action"], "publishers": [], "esrb_rating": null}