{"id": 20302, "slug": "guns-and-robots", "name": "Guns and Robots", "name_original": "Guns and Robots", "description": "<strong>Guns and Robots</strong> is free to play online third person shooter. The game brings robot action with massive customization. Players get cartoony bright 3D graphics in attractive environments and challenge each other in open arenas. Guns and Robots gives fun, entertaining experience with easy to master gameplay and numerous options to experiment robot constructing skills.<strong>BUILD YOUR ROBOT. CUSTOMIZE IT. DOMINATE THE ARENAS!</strong><br/><br/>We are very excited to give gamers around the world the ability to enjoy the game that the community participated in creating! We would like to thank all for your support and most importantly, we are dedicated to adding more content and bring to you exciting new features, so join our Forums at http://forum.play-gar.com and be a part of Guns and Robots community!<strong>FEATURED DLC</strong><br/><br/>Purchase the <strong>Steam Starter Pack of Guns and Robots </strong>and blast your way through your enemies with:<br/><strong>• 1000 Sparks<br/>• 150 Upgrade Components</strong><br/><br/><strong>Guns and Robots Starter Pack</strong> is ideal for new robot-fighters who are looking to get a quick start in the action. This is special new player offer to get your hands on cool artillery, equipment and upgrades. In this pack you will get all upgradable component options:<br/><br/><ul><li>30 upgrade head components,<br/></li><li>30 upgrade weapon components,<br/></li><li>30 upgrade device components,<br/></li><li>30 upgrade body components,<br/></li><li>30 upgrade chassis components,</li></ul><strong>KEY FEATURES</strong><br/><br/><ul><li><strong>Massive customization</strong>. In Guns and Robots, the robots come in three module classes based on players' assembly and unlimited options for character customization. </li></ul><ul><li><strong>Pinpoint enemies with multiple weapons</strong> simultaneously.Wide variety of potential combinations per weapon allow players to fine—tune their arsenal according to their game play preferences.</li></ul><ul><li><strong>Enjoyable and extremely funny online arenas</strong> where players literally blast their way through.</li></ul><ul><li><strong>Adrenaline-pumping game play.</strong> Different maps add fine mixture of thrill, speed and action to the game play.</li></ul><ul><li><strong>Dynamic combat experience.</strong>Players can choose to line up for high-level real-time combat.</li></ul><ul><li><strong>Player Guilds.</strong> Players can join, create guilds and benefit from numerous guild features.</li></ul><ul><li><strong>Achievements.</strong> Variety of achievements for the players with exceptional performance.</li></ul><strong>AVAILABLE GAME MODES:</strong><br/><br/><ul><li>Capture the Batteries (Capture the Flag)</li></ul><ul><li>Team Deathmatch </li></ul><ul><li>Bomb Squad (Destroy the Enemy Base)</li></ul>", "metacritic": null, "released": "2014-08-04", "tba": false, "updated": "2023-12-19T12:30:55", "background_image": "https://media.rawg.io/media/screenshots/670/67024fb5e5f19777c9cb3f9e5bf8b0c4.jpg", "website": "http://play-gar.com/", "rating": 1.74, "rating_top": 1, "added_by_status": {"yet": 25, "owned": 812, "beaten": 1, "dropped": 9}, "playtime": 1, "achievements_count": 69, "ratings_count": 34, "suggestions_count": 496, "game_series_count": 0, "reviews_count": 34, "platforms": ["PC"], "developers": ["Masthead Studios"], "genres": ["Action", "RPG", "Massively Multiplayer", "Indie"], "publishers": ["Masthead Studios", "Thegamewallstudios"], "esrb_rating": null}