{"id": 203243, "slug": "rose-colored-glasses", "name": "Rose-Colored Glasses", "name_original": "Rose-Colored Glasses", "description": "<p>\"Rose-Colored Glasses\" is a prototype for social control. It is a pair of state-mandated augmented reality-powered lenses meant to seize narrative built from perception. In the context of the Unity project, it is meant to take place in Manila, Philippines, where a drug war is currently being waged through extrajudicial killings and vigilantism. The dead have cardboard signs discarded next to them, dismissing them as \"drug dealers,\" right away imposing a label onto a dead body, regardless of whether they are a drug dealer or not.</p><p>The prototype is meant to take the emergent technology of augmented reality and imagine how an authoritarian government might use this technology to extend a questionable and violent campaign in technological capacity. It is meant to toy with empathy, and provoke further questions on whether what the wearer is seeing is real or not. If it becomes socially acceptable to execute people, as long as they are \"drug dealers,\" might that extend to other labels, such as \"rapist\" or \"child molester?\" Do such people even deserve death?</p><p>This project was difficult in terms of finding the code I needed. The concept may have been simple, but it was challenging to incorporate all the various code I needed to run the project. I wanted to instantiate the crowd on the far sidewalk, but couldn't get it to run. However, I am very satisfied with the POV control I got in there. I got repeated feedback regarding making the POV movable, but I sadly had to keep it stationary, due to time restrictions.</p><p>Making the rotating text was surprisingly easy to do, as was creating the pink lenses meant to overlay the viewer's sight when the lenses are activated. What was difficult was finding the code to make the characters, again, seem independently like they were moving, or spawning to create a crowd.</p><p>I connect this project to Plato's \"Allegory of the Cave.\" That classical reading is currently being linked to virtual reality, and a decade ago it was used as an interpretation for the seminal 1999 cyberpunk movie \"The Matrix.\" The Allegory of the Cave posits that majority of people live in a \"cave\" where their perception of reality is warped, and that a single enlightened person can only leave the cave, see the world for what it is, and share their knowledge with those still inside. It made me think of how, in the cave, its occupants are kept prisoner by images that are controlled by an outside force. It makes me think about the oppressive potential of augmented reality, and how that may translate to an oppressive society. <br/></p>", "metacritic": null, "released": "2016-12-20", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/968/9681b6db5f5db4a8012440262eba11d2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 87, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["jedsegovia"], "genres": [], "publishers": [], "esrb_rating": null}