{"id": 203322, "slug": "passive-aggressive-lasagne-time", "name": "Passive Aggressive Lasagne Time", "name_original": "Passive Aggressive Lasagne Time", "description": "<p>Instructions: </p><p>You're helping your dad make a sweet bolognese lasagne, but you can't get in the carrot-chopping zone unless you're listening to the hits of the 80's, but you can't tell Dad you're not feeling the Bizet. Passive aggressively change the radio station by pressing E! Once you're done chopping up the carrot, walk over the the oven and press space to win.</p><p>This is a game about making lasagne with your dad and fighting about what music to listen to. I really do enjoy cooking with my dad, and it usually isn't that passive-aggressive, but just making a game about happily chopping up carrots would be kinda boring, I thought. This isn't really anything at all like I wanted it to be, because coding is god damn impossible. I'm gonna keep working on it until I feel like I could show it to my dad without him vomiting all over my computer.</p>\n<p>I really like 3D modeling, so that part was fun. Of course, I couldn't actually get most of the nice models I made to show up the way I wanted them to in unity, so I guess all those hours were pretty much pointless. Otherwise, I couldn't really find anything I enjoyed doing about the project, and it mostly just made me wanna die even more than before. Anyway, at least I've realized that game design probably isn't for me? So I might just give up. Or exclusively make games about being cripplingly depressed. One of those.</p>", "metacritic": null, "released": "2017-10-24", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/8bb/8bbf65dee2f456785b13b341ef5dc8ca.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 16, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["cat_efalls"], "genres": [], "publishers": [], "esrb_rating": null}