{"id": 20332, "slug": "atonement-scourge-of-time", "name": "Atonement: Scourge of Time", "name_original": "Atonement: Scourge of Time", "description": "The last king was killed over 400 years ago and the global rule of the land ceased to exist. Slowly over the years the law and order started to subside, people began to divide amongst themselves, big cities were gradually gone and replaced with smaller settlements, and the whole land started to slowly degrade. Many believe it’s because the Angelkind have abandoned it. <br/><br/>Now the bandits roam the roads and wild animals roam the fields. The only safety can be found in smaller villages, where groups of people have banded to work together in order to survive. The relations between the different sentient races are very marginal and fragile. Some have been at long conflicts with one another, at times erupting into full blown wars. A holy Order of Atonement has been trying to keep the people together, but even their influence is limited to a handful of villages. And to top it all off, many believe a “Vindicator” will walk the land one day as a punisher of all the sins and bring forth a swift end upon it.That Day Has Come. Features<br/><ul><li>A large, decadent, dark fantasy world with a new take on concepts of angels and demons. <br/></li><li>Two different protagonist teams, each one with its own point of view on the same story. Their paths repeatedly converge and diverge as they attempt to accomplish their own goals, occasionally antagonizing one another. <br/></li><li>Unconventional way of unlocking new skills: each character possesses all of their special abilities from the start. However, many are locked by high energy cost. Increase max Energy by any means necessary to get access to those skills. <br/></li><li>Strategically manage your energy in battles: use lots of low cost skills in a row, or use a high cost skill and wait for the overall energy to recharge. <br/></li><li>Two difficulty modes: Normal and Challenging. Normal is streamlined so to allow most people to complete the game and witness the story. Challenging is for those seeking blood, sweat, sorrow, and death. <br/></li><li>Turn-based battles and a variety of boss fights which require strategy to be beaten, especially in Challenging mode. <br/></li><li>A variety of weapons, armour, and accessories, allowing customization of the equipment on playable characters to fit to your playstyle.</li></ul>", "metacritic": null, "released": "2015-07-16", "tba": false, "updated": "2022-08-24T22:40:26", "background_image": "https://media.rawg.io/media/screenshots/1de/1deb3c6892f7aad40359073b8257d47c.jpg", "website": "http://www.newrealitygames.co.uk", "rating": 1.59, "rating_top": 1, "added_by_status": {"yet": 23, "owned": 701, "beaten": 1, "toplay": 2, "dropped": 6}, "playtime": 5, "achievements_count": 32, "ratings_count": 22, "suggestions_count": 371, "game_series_count": 0, "reviews_count": 22, "platforms": ["PC"], "developers": ["Astronomic Games", "New Reality Games Int."], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["New Reality Games"], "esrb_rating": null}