{"id": 20349, "slug": "gold-rush-anniversary", "name": "Gold Rush! Anniversary", "name_original": "Gold Rush! Anniversary", "description": "In 1988, Rush appeared with Gold! in one of the most comprehensive adventure games of the 1980s. Now, the fondly remembered game, Gold Rush! has been developed anew, to today’s highest standards. No aspect of modern gaming has been overlooked.  You can experience the famous California Gold Rush with high-resolution graphics, speech synthesis, a superb sound track and modern user interface features. Optimized game-flow will enhance your traveling and interactions with other characters of the period.<br/><br/>Gold Rush! takes you back to the year 1849, when gold was discovered in California. It was certainly one of the most exciting times in American history. Gold Rush! includes the three routes tens of thousands took to the gold regions.  Become Jerrod Wilson and experience each trek as you travel from New York to California.<br/><br/>Whichever route you decide to take, you will see many historical sights. Try going overland across the Great Plains and huge mountain ranges, crossing the Isthmus of Panama, or rounding Cape Horn on the tip of South America. If you survive and arrive at Sutter’s Fort, the adventure is still only half over!  Many other puzzles remain to be solved before you achieve your goals in California.Features:<ul><li>Over 130 pre-rendered images and animated scenes in full HD <br/></li><li>Three different routes west (3 adventures in one game)<br/></li><li>High quality voices and new recorded music<br/></li><li>Subtitles in English or German (Point &amp; Click!)<br/></li><li>Optimized game-flow (minimizing dead-ends and random perils)<br/></li><li>Two possibilities for controlling (original parser as well as a new intelligent Point&amp;Click control)</li></ul>Bonus item: (Normal Edition)<ul><li>Historical map of the three routes</li></ul>Bonus item: (Special Edition)<ul><li>Historical map of the three routes<br/></li><li>Over 90 unpublished original concept drawings of the developer from the 80s, as png<br/></li><li>Booklet with unpublished original concept drawings of the developer from the 80s, as pdf<br/></li><li>Making-of booklet, as pdf<br/></li><li>Gold Rush! Classic version (only PC!)</li></ul>", "metacritic": null, "released": "2014-11-07", "tba": false, "updated": "2019-09-17T09:03:22", "background_image": "https://media.rawg.io/media/screenshots/fc5/fc5083988e2706088cead9b5f8deab81.jpg", "website": "http://www.goldrush-game.com/", "rating": 1.67, "rating_top": 1, "added_by_status": {"yet": 9, "owned": 255, "beaten": 1, "toplay": 1, "dropped": 3}, "playtime": 4, "achievements_count": 0, "ratings_count": 6, "suggestions_count": 363, "game_series_count": 0, "reviews_count": 6, "platforms": ["iOS", "PC", "Linux", "Android", "macOS"], "developers": ["Sunlight Games"], "genres": ["Adventure", "Strategy", "Indie"], "publishers": ["Kiss", "Sunlight Games"], "esrb_rating": "Everyone 10+"}