{"id": 20354, "slug": "new-york-bus-simulator", "name": "New York Bus Simulator", "name_original": "New York Bus Simulator", "description": "Transformed is the famous bus line M42 which goes from Hudson River to East River on 42nd street, one of the most known streets of New York City. You drive the typical Nova RTS T 80-260 bus, presented as a very detailed and true to the original 3D model. The original timetable and numerous exciting tasks challenge your skills as a bus driver. The working day of a bus driver can be very entertaining and full of variety. This is where we have set the main focus. A lively realization of the normal workday full of curious events and you are the center of all the action! The complete route incl. side streets can be explored from the very start of the game (with the exception of the tutorial). Go by bus or take a walk through this exciting city area!Features:<br/><ul><li>The player slips into the role of „Carlos“, bus driver in Manhattan (character is animated and controllable) <br/></li><li>The 3d cockpit is being simulated realistically with all controls and rotatable view <br/></li><li>Physics engine to create a realistic simulation<br/></li><li>Dynamic AI-Traffic<br/></li><li>Animated passengers getting on and off the bus; voice output incl.<br/></li><li>6 exterior camera views plus mirror views left and right<br/></li><li>Dynamic weather and daytimes<br/></li><li>vehicle editor included to expand your entire fleet<br/></li><li>virtual radio station \"Double Bass FM.\" with over 43 tracks from great bands/artists</li></ul>", "metacritic": null, "released": "2014-08-06", "tba": false, "updated": "2019-08-28T22:08:41", "background_image": "https://media.rawg.io/media/screenshots/4a4/4a4ec21d656c8e04db977d423964d4e5.jpg", "website": "http://www.world-of-busdriver.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 66, "toplay": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 271, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["TML-Studios", "Little Freedom Factory"], "genres": ["Simulation"], "publishers": ["United Independent Entertainment", "Aerosoft"], "esrb_rating": null}