{"id": 203688, "slug": "control-an-experimental-meta-game-about-interface-", "name": "CONTROL - An experimental (meta) game about interface constraints", "name_original": "CONTROL - An experimental (meta) game about interface constraints", "description": "<p>The player is represented onscreen by a hand avatar, which is controlled using the basic arcade videogame control mechanism of 8 directions and one action button. The 5 digits of the hand can be individually used to press the onscreen game controls. In order to use one of the fingers, the player must hold down the action button along with directional control for either left, top left, up, top right, or right. Each of these 5 movements corresponds to a single digit, for example, the combination of left and action corresponding to the thumb.</p>\n<p><em>Control</em> echoes the hand to controller aspect of the videogame interface in the diegetic space of the visual interface through a downsampled meta interface. It makes the game interface the constant point of focus, rather than have it disappear to make way for an unrelated feedback visual. This goes against the notion of the ideal of interface design where an interface should be so intuitive that it for all intents and purposes ‘disappears’. In <em>Control</em> the visual interface will not let you forget that your are manually interfacing with the computer through a hand to controller link.</p>\n<p><em>Control</em>‘s visual style is in part inspired by early PC gaming graphics, combining the colours from the different 4 colour CGA video modes into a new palette. This reference to early PC gaming is merged with the tape loader aesthetic of 8bit computers such as the Commodore 64. Animated raster bars are commonly associated with the anticipation of game loading, but in this case are used as feedback indicators, changing colour in response to the player’s progress. The audio is also kept deliberately lofi, combining samples of ZX Spectrum loading sounds alongside 4 channel loops generated on the Nintendo Game Boy.</p>\n<p>By using a low fidelity reproduction of the hand in the playfield, both visually and in terms of the available control scheme, the game reflects the resolution divide between the analog and digital worlds. In addition to the challenge provided, the increasing button count of the onscreen game controllers is intended to reflect the evolution of game input devices. The final level of <em>Control</em> confronts the user with the speculative ‘OctoPad’ prototype game controller that exaggerates the complexity of existing devices. The progress a player makes through the game levels is a measure of their own patience and ability to play within a constrained control scheme and increasingly more difficult level layout.</p>", "metacritic": null, "released": "2018-06-12", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/4fb/4fbeb3943d7faa15d7f45a70d4ea5055.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 82, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Kieran Nolan"], "genres": [], "publishers": [], "esrb_rating": null}