{"id": 203825, "slug": "fun-fill-factory-android", "name": "Fun Fill Factory - Android", "name_original": "Fun Fill Factory - Android", "description": "<p>\r\n\tThe toys in the factory need to be filled.  Your task is to launch the correct fill at the correct toy to fill it. Don't overfill the toy or it will explode.\r\n</p>\n<ul>\n<li>\r\n\tEach toy can only interact with, and be filled by its own filler.</li>\n<li>\r\n\tYou have a limited amount of fill. This requires precision shooting rather than random shooting.</li>\n<li>Plan your moment of launch carefully and then click on the launcher to release the fill.</li>\n<li> The fill is light, it doesn't travel very fast; you have to launch it in time to intercept the toys that are far away.</li>\n<li>\r\n\t50 Unique levels where the toys move in different configurations. Fill them from the top, from the bottom, from the side etc.</li>\n<li>The speed at which the toys move increases every 10 levels.</li>\n<li>Launch the flower to fill a toy up to it's maximum - helpful when you've run out of fill. </li>\n<li>Launch the star to protect a toy, that is in the way, from exploding. </li>\n<li>Catch the bonus items on every level (launch any fill at them to collect them) and keep them until the later levels - you will need them!</li>\n</ul>\n<p>\r\n\tDon't be misguided by the cute graphics, getting gold on all the levels is very challenging.\r\n</p>\n<p>\r\n\tThis game will take 5 - 6 hours to complete - and many hours to perfect each level.  <br/>\n</p>\n<p>\n</p>\n<p>\r\n\tFun Fill Factory -  Arcade / Casual Game from Evolutionary Games on Vimeo.\r\n</p>\n<p>\n<em><strong>There is also a windows pc version for this game.</strong></em><br/>\n</p>\n<p>\n<strong><br/>\n</strong>\n</p>", "metacritic": null, "released": "2016-12-10", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/a48/a486661443aa42da63875e4637af4c8c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 105, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Evolutionary Games"], "genres": ["Action"], "publishers": [], "esrb_rating": null}