{"id": 203966, "slug": "tower-of-asterion", "name": "Tower of Asterion", "name_original": "Tower of Asterion", "description": "<p><strong>So there's this guy trapped at the top of a tower. The air inside is poisoned. The floors are in disrepair. </strong></p><p><strong>One night on a drunken dare, a group of dudes decide to brave this labyrinth. First dude </strong><strong>goes in, fails, so the second dude </strong><strong>goes in. Second dude </strong><strong>also fails, so they send in a third dude</strong><strong>. Meanwhile the guy at the top feels he should entertain his guests (as good hosts are wont to do) by shouting down interesting conversation starters. More dudes enter, more dudes die. </strong></p><p><strong>Now to be fair, these dudes did a serious amount of pre-gaming beforehand so they're moving pretty sluggishly and feeling more than a little woozy. The heavy gear on them isn't helping either. </strong><strong>But they got heart, because no one's left yet. Or maybe it's just plain drunken bull-headedness keeping them there, each waiting for their chance to climb the tower. </strong></p><p><strong>And the guy upstairs is still shouting down his rambling thoughts. He's getting more and more excited, and practically screaming his head off. The lungs on that guy. Nine stories of broken walls distort his echoes into incoherent, migraine-inducing roars.</strong></p><p><strong>Ugh. What is up with that guy? Why would <em>anyone</em> want to save him, let alone these jokers? Huh, <em>are </em>they trying to save him? </strong></p><p>Made for LudumDare #27 - 10 seconds (theme).</p><p><strong>Controls:</strong></p><ul><li>W, A, S, D to move</li><li>Spacebar to advance</li><li>R to give up and let the next dude try. 10 dudes = 10 tries.</li></ul><p>For all you literary folks out there, yup it's Borges.</p>", "metacritic": null, "released": "2016-01-24", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/ab4/ab4498f529443bf2ea43750ca13c80ea.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 6, "game_series_count": 0, "reviews_count": 0, "platforms": [], "developers": ["grvlndev"], "genres": [], "publishers": [], "esrb_rating": null}