{"id": 20407, "slug": "caster", "name": "Caster", "name_original": "Caster", "description": "<p>Caster is an indie third-person action-adventure game developed by Elecom.</p>\n<h3>Plot</h3>\n<p>Mysterious beings who are known as the Flanx start appearing around the world. They are highly hostile towards humans and annihilate every city they come across. A special organization is established to combat the bug-like monsters and fight back. You are one of its soldiers sent to prevent the extinction of humanity.</p>\n<h3>Gameplay</h3>\n<p>Caster focuses on fast-paced massive combat. The players can interact with terrain and plants as the main character is a descendant of a legendary clan the members of which had such abilities. The main objective of each level is to clear it off the bugs.</p>\n<p>At the beginning of the game, the main character is weak and can easily be killed. His attacks do not do much damage. The players are awarded upgrade points after completing a mission. It is possible to purchase both offensive and defensive abilities using these points.</p>\n<p>As for their defense, the players can use a set of movements, and their shield. The game follows the “movement equals life” principle, as if the players stop moving around the level, they will be quickly overwhelmed by the enemy forces.</p>\n<p>A wide range of attacks is available to the players. Most of these attacks are the result of the main character&#39;s ability to manipulate energy. Blasts and pulses of energy are available to the players. The most powerful attack is the Eruptor. It launches a ball of energy, dealing heavy damage and raising the terrain.</p>", "metacritic": null, "released": "2009-01-07", "tba": false, "updated": "2024-01-05T21:59:33", "background_image": "https://media.rawg.io/media/screenshots/1c1/1c1b874e7dc228d22c11a65870513236.jpg", "website": "http://www.casterthegame.com", "rating": 1.76, "rating_top": 1, "added_by_status": {"yet": 34, "owned": 1136, "beaten": 16, "dropped": 28}, "playtime": 2, "achievements_count": 0, "ratings_count": 78, "suggestions_count": 326, "game_series_count": 0, "reviews_count": 78, "platforms": ["macOS", "PC"], "developers": ["Elecorn"], "genres": ["Action", "Adventure", "RPG", "Strategy", "Casual", "Indie"], "publishers": ["Elecorn"], "esrb_rating": null}