{"id": 20406, "slug": "team-fortress-classic", "name": "Team Fortress Classic", "name_original": "Team Fortress Classic", "description": "<p>A world whose atmosphere consists of fire and flying fragments of flesh. The shooting and explosions are just as natural in this world as the birds&#39; singing in the forest. Without a continually working Hastings machine gun, you just do not survive. And it is necessary to forget about steps - running is better.<br />\nThe game has six modes - each mode is different for the purpose of the game:<br />\nCapture the enemy flag on the enemy’s base and bring it to your base.<br />\nSet your flag on the territory of the enemy or in an area not occupied by anyone.<br />\nBring one of the players - an unarmed &quot;civilian&quot; (but he does have an umbrella!) - to a safe place, do not let him be shot by enemy snipers.<br />\nGrab the ball (not the flag) and carry it to your base.<br />\nGrab more control points (not territories).<br />\nCapture places that are protected by enemies, or defend sites from invaders.<br />\nThere are only two means to achieve the goal. The first is obvious - to kill as many strangers as possible, but better all at once. The second is to establish interaction with the players on your team. This game is created to play in a team. For a diversity, there are nine classes for players - each class has one unique weapon.</p>", "metacritic": null, "released": "1999-04-01", "tba": false, "updated": "2024-01-22T02:05:04", "background_image": "https://media.rawg.io/media/games/abd/abdb7e589f0a8ccd36c0582673120b1e.jpg", "website": "", "rating": 2.93, "rating_top": 4, "added_by_status": {"yet": 310, "owned": 5158, "beaten": 97, "toplay": 8, "dropped": 207, "playing": 4}, "playtime": 1, "achievements_count": 0, "ratings_count": 370, "suggestions_count": 253, "game_series_count": 2, "reviews_count": 372, "platforms": ["macOS", "Linux", "PC"], "developers": ["Valve Software"], "genres": ["Action"], "publishers": ["Valve"], "esrb_rating": null}