{"id": 204030, "slug": "hey-you-turret-boy", "name": "Hey you, Turret boy!", "name_original": "Hey you, Turret boy!", "description": "<p>Turret boy es parte de las tropas de defenza de Lamara, un poderoso planeta en el que descanza la mayor fuerza del universo. Los protones tentados por el poder prepararon un gran ejército con el que destruyeron al planeta y al toda la armada, !!¡A toda excepto a Turret boy! Quién toma la ardua empresa de salvar al poder y restablecer la paz en en el planeta.</p>\n<p>Un juego de plataformas en dos dimensiones muy, pero muy difícil, con 8 niveles llenos de frustración y ´Game overs´ ininterrumpidos. </p>\n<p>Además de las mejores canciones del rock and roll en sus versiones de 8 bits.</p>\n<p>Lamentablemente, todavía no se traduce al inglés, pero el juego se puede disfrutar igualmente.</p>\n<p>No somos propietarios ni de las canciones ni de los covers de las canciones utilizadas para este juego, aquí están sus autores:</p>\n<p>Omingrad</p>\n<p>Queen</p>\n<p>The Clash</p>\n<p>Ghost busters</p>\n<p>Def Leppard</p>\n<p>Derek &amp; The Dominos <br/></p>\n<p>Pearl Jam</p>\n<p>Blues image</p>\n<p>Elvis Presley</p>\n<p>Jerry lee lewis</p>\n<p>Turret boy is a part of the troops of defence of Lamara, a powerful planet in which rest the major force of the universe. The protons touched by the power prepared a great army with whom they destroyed to the planet and to the whole army!! To everybody except to Turret boy! The one who takes the arduous company of saving to the power and restoring the peace in in the planet.<br/>A game of platforms in two measure very, but very difficultly, with 8 levels full of frustration and ' Game overs ' uninterrupted.</p>\n<p>Besides the best songs of the rock and roll in his versions of 8 bits.<br/><br/>Lamentably, still the Englishman is not translated, but the game can be enjoyed equally.<br/></p>", "metacritic": null, "released": "2017-01-05", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/228/228900b693ee80cf3bcf337d49a6b574.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 73, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Rol y Lol"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}