{"id": 20411, "slug": "mesel", "name": "Mesel", "name_original": "Mesel", "description": "M E S E L <br/>Mesel is inviting you to become the protagonist and the writer of a novel at the same time. Create your own novel with your own decisions.Key Features :<br/><ul><li>Visions From the Past ; <br/>The player can write their own adventure and also use the flashback feature to reveal hidden memories from the past to include in their novel.<br/><br/></li><li>Novel ;<br/><br/>Every choice the player makes and every revealed mystery is added to the novel. This way success of the novel depends on the style of the player. Depending on their game style, the player can write a novel up to up to a 100 pages.<br/><br/></li><li>Puzzles ; <br/><br/>Solve the puzzles waiting for you in the hospital to reveal more of its mysteries.<br/><br/></li><li>Documents ;<br/><br/>Mesel takes place in an abandoned hospital. That's why all the notes, records and letters you will find are what the old inhabitants of the hospital had left behind. Moreover, most of the documents you will find are taken from real hospital records.<br/><br/></li><li>No Combat Included ;<br/><br/>There is no fighting or shooting in Mesel; meaning you won't have to kill dozens of bots to finish the game. All you need is your intelligence, curiosity and observation ability in order to succeed. All Gölcük Childrens' Hospital wants from you is to be discovered. </li></ul>", "metacritic": null, "released": "2016-02-23", "tba": false, "updated": "2019-08-28T22:08:39", "background_image": "https://media.rawg.io/media/screenshots/b6f/b6fe032f1e8d0a99a6f888f0fab7cee7.jpg", "website": "http://www.dbkgames.net/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 8}, "playtime": 3, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 409, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Burak Dabak"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Burak Dabak"], "esrb_rating": null}