{"id": 204128, "slug": "clash-pour-la-gloire", "name": "Clash pour la gloire", "name_original": "Clash pour la gloire", "description": "<p>COMMANDES</p><p>- W,A,S,D ou LES FLÈCHE DU CLAVIER pour se déplacer</p><p>- ESPACE = attaquer                                                           - K = Bloquer</p><p>- J = Tirer                                                                                   - L = Esquiver</p><p><strong>Une description claire de la quête et/ou de l’objectif principal du jeu</strong></p><p>Ce tournoi de combat, rappelant les matchs de gladiateurs, est sans pitié. À chaque victoire, le combattant accède au niveau supérieur. Par contre, chaque défaite peut rapidement faire perdre le statut de celui-ci. Les victoires accumulées permettent au combattant avoir un mode de vie plus confortable ou même luxueux. Or, le guerrier, une fois vaincu est dépossédé de tous ses biens. La police “Batman Forever” a été utilisée pour l’interface graphique du jeu. Les pointes acérées ajoutent du dynamisme  et s’intègrent bien avec l’ambiance futuriste du jeu.  </p>\n<p><strong>Concept général du jeu</strong></p><p>Le but du tournoi est une suite de neuf combats. Au cours d’un combat, d’une durée d’environ une minute, il faut vaincre l’adversaire à l’aide d’un seul coup pour passer au prochain combat. Une victoire permet d’accéder à l’étage supérieur. et arrivé au sommet, le combat contre le champion du monde prend place. Le vainqueur devient le nouveau champion du monde et ressort de la pyramide glorieux.  </p>\n<p>Également, le héros est vaincu à l’aide d’un seul coup de l’ennemi. Chaque défaite du tournoi oblige le joueur descendre les étages de la pyramide. Par contre, si le joueur est vaincu au combat final, la partie sera définitivement terminée. </p>\n<p>Au cours des certains combats du tournoi, Maximilian Marx, l’antagoniste de l’histoire, peut pirater le système de combat pour désavantager Skailee, ajoutant un élément de difficulté supplémentaire. De plus, au fil des niveaux, des éléments de difficultés sont ajoutés tels des pièges, des sections de planchers déplaçant l’héroïne à des vitesses variées ou des obstacles afin d’ajouter une progression de difficulté. </p>", "metacritic": null, "released": "2018-03-15", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/357/357282c5a7b659a74df565003b1768b9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 33, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["JamesDelsoin"], "genres": ["Action"], "publishers": [], "esrb_rating": null}