{"id": 204214, "slug": "synthettriq", "name": "Synth:ETTRIQ", "name_original": "Synth:ETTRIQ", "description": "<p><strong>Brawler Controls: </strong></p><p>Left Thumbstick to Move</p><p>Right Thumbstick to Direct your Attacks</p><p>Bumbers to Jump</p><p>Back Button to Switch Players</p><p><strong>Rhythm Controls:</strong></p><p>AXYB or D-Pad to play Notes</p><p>Triggers to Switch Weapon for Brawling Player</p><p><strong>Basic But-Kinda-In-Depth Game Info:</strong></p><p>All your attacks do the same damage.</p><p>All your attacks are AoE.</p><p>Spear goes far.</p><p>Kodachi goes wide.</p><p>Hands don't go far.</p><p>Turrets take 5 hits to destroy.</p><p>Turrets explode after being destroyed. Big explode.</p><p>Missiles take 1 hit to destroy. Punching them feels great because like, they're right there dude.</p><p>Missiles have a 2% chance when spawning to spawn a \"Cluster\", which is a lot of missiles. It's intense. Good luck.</p><p>Turrets spawn randomly. This can lead to good or bad starts. We're sorry.</p><p>Lasers hurt. They also stun for a very short time.</p><p>Health is regenerated while in the Rhythm state successfully hitting notes.</p><p>Energy for keeping weapons out in Brawler mode is accumulated by the Rhythm player.</p><p><strong>Objective:</strong></p><p>As the <strong>Brawler</strong>, you want to avoid lasers and missiles, and destroy enemies.</p><p>As the <strong>Rhythm</strong>, you accumulate <strong>Energy</strong> by successfully hitting notes (there will be green particles) for the weapon (Kodachi or Spear) that the Brawler is using. If energy runs out, the Brawler will use \"Basic Attacks\", which are short range. Get energy for your buddy yo.</p><p>Communicate with your partner. And don't die.</p><p><strong>Story Stuff:</strong><br/></p><p>Newborns are now implanted with a LuOS chip that monitors their health, tracks their location, and aids in nervous system operations. LuOS chips also store the person's conscience- an effort by the government to retrieve information from an individual after their passing.</p><p>Synth technology emerged when a fashion corporation, LuOS, was working to find a better way to create mannequins/models to showcase their products. LuOS then created \"LuID\" chips to store the genetic information of celebrities/notable people, and \"LuSH\", Lucid Synthetic Humans, capable of taking the appearance of whoever's LuID chip was placed in the nape of its neck.</p><p>And thus, an era where the government is controlled by the fashion industry emerged.</p><p>Elaine Tetra (Etta), and Travis Cameron (Triq), are Freedom Fighters seeking to stop LuOS, and subsequently the government's operations. On June 18th 2061, their halfway house was assaulted- Etta was immediately killed.</p><p>Triq retrieved Etta's LuOS chip and placed it in a modified LuSH, relieved to find that it worked. Triq was then shot, and died in the newly revived Etta's arms. Etta then places Triq's chip alongside hers- in the same LuSH.</p><p>Synth:ETTRIQ is born, a shared conscious in LuSH G310, taking the appearance of whoever is in control. While one person manages the physical body, the other must maintain rhythm to keep the body functioning.</p><p>Play as Etta and Triq as they fight their way through turrets and missiles to get...somewhere!</p>", "metacritic": null, "released": "2016-08-30", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["JustJessTV"], "genres": ["Action"], "publishers": [], "esrb_rating": null}