{"id": 204354, "slug": "confusy-colors-train-your-brain-for-free", "name": "Confusy Colors - train your brain for free", "name_original": "Confusy Colors - train your brain for free", "description": "<p>Confusy Colors - the new <strong>super addicting Android game</strong>, that brings everyone to his limits.</p>\n<p>All you have to do, is to tap the corresponding color. <strong>Sounds easy right? But do not be fooled!</strong></p>\n<p>Take your phone and tap the correct colors under ernourmous time pressure to reach top scores in the ultimate time killer.<br/>Train your brain and challenge yourself and friends in multiple different gamemodes.</p>\n<p>Download this super addictive puzzle game today and you will get one of the top free games. That not only kills your time but also can train your brain!</p>\n<p><em>Game Features:</em><br/>⭐ Free to play, so play one oft the top free games!<br/>⭐ Endless play in one oft the most popular offline games!<br/>⭐ Compare to players world-wide with global leaderboards!<br/>⭐ Play up to 6 different and unique gamemodes offline!<br/>⭐ Redeem free codes and get awesome and free rewards!<br/>⭐ Complete multiple challenges every day and receive their free rewards!<br/>⭐ Share your scores with your friends!<br/>⭐ Receive free rewards every day!<br/>⭐ Unlock great achievements!</p>\n<p>But stay aware! If you tap the wrong color, you may have to start again. Because not everyone is skilled enough as some are.</p>\n<p>Decide for yourself if you will brave the challenge of the confusy colors or give up. The decision lies in your hands!</p>\n<p>The question is: Are you able to tap the correct colors under time pressure? - Find out now and you will never want to stop playing this addictive game again!</p>", "metacritic": null, "released": "2017-06-25", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/73e/73e175330841854968173b9815a6d5fa.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 100, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["BigMountainGames"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}