{"id": 20434, "slug": "total-pro-golf-3", "name": "Total Pro Golf 3", "name_original": "Total Pro Golf 3", "description": "Total Pro Golf 3 puts you in charge of your career looking to make it as a professional golfer on one of the world's most prestigious professional golf tours. <br/><br/>Earn your tour card and play on one of six different tours, earn sponsorships, meet in-game achievements via \"Challenge Mode,\" play in major tournaments, chase the Wolverine Cup, and enter special annual team play events. <br/><br/>In addition to managing your golfer on the course it’s up to you to manage your golfer off the links. Schedule practice times with your coach, decide what events to participate in, and when to take a break from the grind of travel and tournament play. Choose your golfer’s equipment and other items that will affect how well you perform in events over the course of a season.<br/><br/>Track the history and in-depth statistics of your tour performance with a detailed almanac feature and view your trophies and awards over the course of your career. Play rounds on beautiful 2D courses where your strategic decisions make the difference between winning the tournament and missing the cut.<strong>Features</strong><ul><li>Golf career management simulation - manage your very first qualifying round to retirement off the senior tour. <br/></li><li>One-Click or Tri-Click play options for playing out a round of golf.<br/></li><li>Shot shaping options allow you to strategically work your way around the course.<br/></li><li>Fast gameplay - play out rounds hole-by-hole or sim an entire round in seconds.<br/></li><li>Win event trophies, major tour events, and tour awards.<br/></li><li>Six international professional golf tours to move between your golf career.<br/></li><li>Full customization of golfers, tours and sponsors.<br/></li><li>RPG elements allow you to manage your golfer on and off the golf course.<br/></li><li>Hire coaches to improve specific aspects of your game and a caddy that can assist you in strategy and reading greens.<br/></li><li>Sign lucrative sponsorship deals with equipment, apparel, and shoe manufacturers.<br/></li><li>Weekly news reports to keep you up-to-date on golfers around all six tours.<br/></li><li>Massive almanac that details every bit of history for every golfer, course, and tour.<br/></li><li>In-game player awards, rankings, and achievement challenges.<br/></li><li>Manage your weekly schedule over a tour season - when you practice, what events to play in, when to take a break from the weekly grind of life on the tour.</li></ul>", "metacritic": null, "released": "2014-07-25", "tba": false, "updated": "2019-09-17T07:55:39", "background_image": "https://media.rawg.io/media/screenshots/741/741e1ee16cd03bc18150d56a6f37c43d.jpg", "website": "http://www.wolverinestudios.com/tpg.html", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 5, "owned": 272, "beaten": 1, "dropped": 4}, "playtime": 1, "achievements_count": 0, "ratings_count": 3, "suggestions_count": 369, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC"], "developers": ["Wolverine Studios"], "genres": ["Simulation", "Sports"], "publishers": ["Viva Meda"], "esrb_rating": null}