{"id": 20432, "slug": "raiseland", "name": "Raiseland", "name_original": "Raiseland", "description": "Raiseland is a procedural terrain generator that can produce realistic &amp;amp; non-realistic terrains in minutes. You can use them on your favorite game engines and 3D editors: Unreal Engine, Unity, CryEngine, Leadwerks, Blender and many more.Real-timeRaiseland is a procedural terrain generation tool which is able to modify the terrain in real-time: the terrain is regenerated instantly after user modifications. Enjoy it while you create vast terrains in minutes without interruptions.HybridRaiseland combines the power and speed of procedural techniques with the flexibility and imagination of designers, providing procedural tools and paint-like tools. Use the procedural system to generate huge terrains and fine-tune them with the sculpting tools.LimitlessRaiseland is powered by a very optimized engine that can deliver almost-limitless terrains. Quality and size will only be limited by your game/rendering engine since Raiseland can produce gigabytes of data even on a low-end machine.Different export optionsRaiseland provides multiple exporting options:<br/><ul><li>Heightmaps. Raiseland can export to the common .raw(16 bits) format. Texture weightmaps (on .raw 8 bits format) can be generated too. The maximum heightmap resolution is 16384x16384, but you can use the tiling function to overcome this limit using the World Composition feature of Unreal Engine.<br/></li><li>Mesh.  Raiseland supports the popular .obj format. By using the mesh exporting option diffuse textures and normalmaps will be exported automatically to .png files.</li></ul>Lots of examples43 easy to adapt terrain examples are included. Base your terrains on them!Non-destructive editingTerrain modifications are non-destructive, &amp;quot;undo&amp;quot;, &amp;quot;redo&amp;quot; and &amp;quot;eraser&amp;quot; functions are available: don't worry about mistakes.Unique algorithmOur in-house terrain generation algorithm can be adjusted in multiple ways so you can generate very diverse terrains.TexturingProcedural texturing can be easily applied within Raiseland. This technique uses height and slope information to paint your terrains.Camera-freeNo more &amp;quot;fixed views&amp;quot; and camera restrictions, the camera can be set at anywhere and look to anywhere.Multi-platformRaiseland not only supports Windows: it runs on Linux natively(without wrappers) and a Mac OS X version is under consideration.UnlimitedYou can use Raiseland commercially. We don't impose resolution limits to different versions. Only one version is available, new features are added as updates, not as DLCs.", "metacritic": null, "released": "2015-08-03", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/6a5/6a539684c674f92268011d88b8eb4040.jpg", "website": "http://raiselandsoft.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 8}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 257, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["David M."], "genres": [], "publishers": ["David M."], "esrb_rating": null}