{"id": 20438, "slug": "etaria-survival-adventure", "name": "Etaria | Survival Adventure", "name_original": "Etaria | Survival Adventure", "description": "Etaria is fictional and mysterious world with a variety of animals and creatures. <br/>In this wonderful world, you main goal is to establish your village and citizens, and lead them to prosperity.<br/><br/>World of Etaria ► <br/>Whole world is randomly generated and endless. <br/>What you will do is completely up to you. Do you feel like chop and gather woods? Or do you want to go fishing? Pick up berries or go hunting? <br/>Explore new territories or go down inside of deep caves?<br/><br/><br/>Creatures of Etaria ► <br/>While traveling in the world of Etaria you will notice that creatures and animals may vary upon  each location. You will meet not only cute  squirrels and  fluffy lambs, but huge and scary scorpions and many others. <br/><br/><br/>Sand-box elements ► <br/>This game has sandbox features, such as changing landscapes and building shelters and other useful structures.<br/><br/><br/>Survival elements ► <br/>Etaria also has survival features. You will need to gather food, fight with wild animals, go hunting, fishing, building shelters and a lots of other stuff to do.<br/><br/><br/>Hunting and fishing ► <br/>Etaria gives you opportunity for hunting animals,  gather food, and useful resources such as skin, animal teeth, and etc. Fishing in ponds is one of the most fascinating  things to do in this game. By the way, you have to choose the right time of the day in order to make fishing more successful and gather as much fish as possible. <br/><br/><br/>Citizens ► <br/>You can establish your own village, where your citizens can be settled. Each citizen can have it`s unique profession: lumberjack, hunter, fisherman, miner and etc. <br/><br/>Features ► <br/>• Randomly generated and endless world<br/>• Different biomes (forests, fields, deserts, swamps, and others)<br/>• Variety of animals and creatures<br/>• Tons of stuff to do: hunting, fishing, mining, crafting and etc<br/>• Tower defense elements. Establish your village and attacks others.<br/>• Survival elements. Survive and fight for your life.", "metacritic": null, "released": "2016-01-27", "tba": false, "updated": "2024-01-05T19:06:49", "background_image": "https://media.rawg.io/media/screenshots/888/888fd26ee6741cb980e97e1833b874be.jpg", "website": "http://bug-studio.net/etaria/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 19, "dropped": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 123, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC", "iOS"], "developers": ["BUG-Studio", "Ivan Matskevich"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["Ivan Matskevich", "BUG-Studio"], "esrb_rating": "Everyone 10+"}