{"id": 204474, "slug": "space-shooter-dylanm312", "name": "Space Shooter (dylanm312)", "name_original": "Space Shooter (dylanm312)", "description": "<p><strong>Summary:</strong></p>\n<p>This is a two-player graphical side-scroller space-shooting game with 3 levels that I made in my AP Computer Science class in my junior year of high school (2015-2016). There may or may not be some cheat keys available to be discovered. (I actually don't remember what they are. This was the first semester final project, so it's almost a year and a half old.</p>\n\n<p><strong>Controls:</strong><br/></p>\n<p>Player 1 (top): WS to move, spacebar to shoot</p>\n<p>Player 2 (bottom): Arrow keys to move, enter to shoot.</p>\n\n<p><strong>How to actually get the thing running:</strong><br/></p>\n<p>The zip file includes the source code and its compiled version, as well as image and sound files. Feel free to look through the source code to see how I made the game; all I ask for is credit where credit's due if you end up using my code or a variation on my code elsewhere. In order to launch the game, you'll have to do the following:</p>\n<p>1. Navigate to the /src directory</p>\n<p>2. Type \"java Runner\" (sans quotes, obviously)</p>\n<p>3. Enjoy (I hope!)</p>\n\n<p>This project is no longer in active development. If you've got some features you'd like to see added, or bugs you'd like to see squashed, feel free to add or fix them yourself and send me your updated version. I'll play it for a bit and if it seems to be running well, I'll update this project with your file and credit you in the description. All of this is subject to my availability, as I'll be starting college in the fall and likely won't have much time to give to the upkeep of this game.</p>", "metacritic": null, "released": "2017-04-25", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/6a8/6a8ea709542879ea5784737d23fa1269.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 10, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["dylanm312"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}