{"id": 20441, "slug": "the-glow", "name": "The Glow", "name_original": "The Glow", "description": "“The Glow” is a single player, survival game with roguelike elements. Take control over one of the six characters, explore semi-randomly generated world and try to survive without losing your sanity in the process! <br/>\n<br/>\r\nStory: <br/>\r\n\"What happened to this city? Don’t take me wrong, it's never been a paradise but usually you could leave home without fear that someone will stab you right between the ribs. But not anymore. Do they all just forget to take the pills? No, that’s impossible. Maybe they refuse to take them? That’s even less likely. No matter what happened, sooner or later I will have to leave my apartment. Probably sooner, because I'm also running out of pills… What was that? Someone knocking? Where did I put those keys…\" <br/>\n<br/>\r\nMain features: <br/>\r\n• Explore semi-randomly generated world! <br/>\r\n• Choose different objectives for each playthrough! <br/>\r\n• Complete objectives to unlock new characters! <br/>\r\n• Scavenge for resources. <br/>\r\n• Interact with other people in any way you want: <br/>\r\n  - Shoot them on sight? Go nuts. <br/>\r\n  - Talk to them and try to cooperate? Sure, but remember they don’t have to be friendly. <br/>\r\n  - Stay hidden and try to avoid them? Good idea! Who needs other people anyway? <br/>\r\n• Sanity is for the weak! If you stop taking pills, you will lose sanity and world around will become… more interesting. <br/>\r\n• Discover dark secrets behind all this madness! <br/>\n<br/>\r\nHave fun and remember: take your pills every day!", "metacritic": null, "released": "2015-12-10", "tba": false, "updated": "2019-08-28T22:08:38", "background_image": "https://media.rawg.io/media/screenshots/ca7/ca756f5071d43930c2aa59abfc27665c.jpg", "website": "http://brainwashing.pl/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 36}, "playtime": 1, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 190, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": [], "genres": ["RPG", "Strategy"], "publishers": [], "esrb_rating": null}