{"id": 204538, "slug": "memory-match-3", "name": "Memory Match 3", "name_original": "Memory Match 3", "description": "<p>Memory Match 3 is a fun memory and concentration game to exercise and train the brain!</p><p>Your memory will be challenged as you concentrate on memorizing where the cards in order to match up pairs of cards. </p><p>Memorize the cards and train your brain to find the pairs! Or try to match up three cards at a time for an extra </p><p>challenge. Or match up two pairs on each deal.</p><p>Would you like to improve your memory and concentration? Then Memory Match 3 is the game for you! Memory Match 3 is both </p><p>a fun and educational game of memory and matching. Logical scoring encourages repeat play for improvement to train your </p><p>brain and develop memory. The more you play, the better your memory becomes!</p><p>Many difficulty levels, suitable for kids and children of all ages as well as adults of any age. High-quality graphics </p><p>and configurable levels of detail to allow customizing the display to suit varying preferences.</p><p>Three modes of play:</p><p>- Classic match pairs, match up two cards at a time.</p><p>- Tricky match three, match up three cards at a time.</p><p>- Match pairs double, match up two cards at a time.. twice! Pairs of pairs.</p><p>Features:</p><p>* Three types of match games</p><p>* 10 difficulty levels within each type, 30 total</p><p>* High-quality animated graphics, with many customizations possible</p><p>* Configurable graphic detail for adults who prefer a \"cleaner\" look, or kids who prefer more \"effects\"</p><p>* Attractive awards and detailed stats</p><p>* Simple, intuitive controls</p><p>* Non-blocking touch interface (no \"forced wait\" after reveal, clicking next card will immediately continue)</p><p>* Logical non-timer-based scoring to encourage repeat play and improvement</p><p>* Auto-adjusts to fit any device</p><p>* Educational memory and concentration game, suitable for all ages</p>", "metacritic": null, "released": "2017-04-06", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/181/1819464a3083039c8b9cc6b0fd75b5a0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 233, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["danisobo"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}