{"id": 204566, "slug": "drone-patrol", "name": "Drone Patrol", "name_original": "Drone Patrol", "description": "<p>This work in progress is based on the Section 3 (Titled Blast!) coursework of Ben Tristem's \"Complete Unity Developer 2.0\".  This minigame is inspired by the classic: Lunar Lander.<br/></p>\r\nBackstory\r\n<p>You’re a remote drone pilot for an off-world research facility. The scientists have a penchant for disaster, so now it’s up to you to clean up the mess they’ve created. You can’t ask for hazard pay, because the Company buys the drones, but on the other hand, you also don’t die. You may find you get yourself fired if you destroy too many drones though – they are a bit fragile (and expensive!). Good luck!</p>\r\nKeys\r\n<p>thrust - w or up-arrow </p>\n<p>rotate - a/d or left/right-arrow</p>\n<p>gravity - , or . to reduce or increase gravity </p>\n<p>reverse gravity - /</p>\n<p>pause - escape </p>\n<p>exit - x (doesn’t apply to WebGL version) </p>\n<p>stop/start music - m (*bug: if music stopped, will re-start when the next level loads… hit M twice to stop)</p>\r\nGoal\r\n<p>Collect the orbs to reveal the exit portal, and get to the next level.</p>\r\nGame mechanic\r\n<p>Your drone gains mass over time, but you can control gravity! Increase it, reduce it, even reverse it! Your score is based on the difficulty, so if you go zero-G you won’t earn regular points, but not everybody plays for points anyway!</p>\r\nFuture development\r\n<p>My wife has suggested that un-claimed orbs should begin to vanish over time. A related mechanic could be to give bonus points for finishing a level within a specific time limit, but I’m also open to other ideas as well!</p>", "metacritic": null, "released": "2017-10-30", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/cfb/cfbe94b84b90776eee531e4346b92b3b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 47, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["Jack Draak"], "genres": ["Action"], "publishers": [], "esrb_rating": null}