{"id": 204757, "slug": "the-wizard-of-retail", "name": "The Wizard of Retail", "name_original": "The Wizard of Retail", "description": "<p>The Wizard of Retail is a game about my experiences working in the shops of Universal Orlando's Diagon Alley, part of their Harry Potter themed lands.  In it, you attempt to keep your store neat and orderly as a deluge of guests come in like a whirlwind to throw everything everywhere.  This is based on a common observation among retail workers--people just don't seem to have the willpower to return things from where they took them.  Controls are easy: move forward with W, look around with right mouse.  Technical limitations inspired this nontraditional control scheme.</p><p>The biggest issue I had in creating this game was my complete lack of artistic ability.  Maya gave me more headaches than any other piece of software I've ever worked with.  Unfortunately, there was no workaround for this--I just had to get good.  To do that, I leaned on internet tutorials and artistically-talented friends.  I chose a simplistic, Animal Crossing-inspired aesthetic to make this job easier.  The control scheme is the other major problem with the game as is--after trying to get physics-based motion to feel right for weeks, I eventually decided to scrap everything that wasn't working--namely, movement in all directions but forward.  I don't love it as it is, but it's what I have.  The \"shoplifting mechanic\" is actually a bug that I couldn't find--so now it's a feature!  My final issue with this project was that the codebase was a mess, a result of me writing the entire thing in one sitting from midnight to 10AM.  I didn't have to dip back into the code very often after that, but every time I did the lack of documentation and poor structure made it quite difficult.</p><p>Given more time, I would clean up the codebase.  This would make it easier for me to include all the features that I had to cut.  The game was originally envisioned as something like Diner Dash, where you have to complete lots of small tasks as quickly as you can to maximize your score.  I wanted players to also have to ring guests up, catch shoplifters, and go into a side room to restock.  I think the game would be a lot better with those mechanics implemented.</p>", "metacritic": null, "released": "2017-03-14", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["mguimaraes42"], "genres": [], "publishers": [], "esrb_rating": null}