{"id": 204839, "slug": "diamond-drop", "name": "Diamond Drop", "name_original": "Diamond Drop", "description": "<p>Catch the diamonds! Avoid the stalactites. Play local multiplayer with your friends.<br/>Control Basics:<br/>First non-controller Player -&gt; Left/Right Arrow Keys<br/>Second non-controller Player -&gt; A and D Keys<br/>Third non-controller Player -&gt; G and J Keys<br/>Fourth non-controller Player -&gt; L and \" Keys</p><p>Short Story: This is the very first game I made with Unity on my own. I notice many issues with it regarding blurry sprites on the web build, ugly backgrounds, lack of pause functionality, lack of control options, etc... - but it was a great first game. I enjoyed making it a lot. It was inspired by Chansey's egg catching mini-game in Pokémon Stadium 2. Run on 1280x720 resolution or higher. The web build supports Xbox controllers and local multiplayer - connecting an xbox controller overrides the keyboard controls for that player. The left and right bumpers (not triggers) control the character. Pressing nothing or both will reset the character to the neutral position.</p><p>Available for Download:<br/></p><p>An android single player build (input involves pressing the left/right side of the screen).</p><p>A PC/Mac/Linux build with Xbox controller support and local multiplayer. </p><p>Note for PC/Mac/Linux: If there are Xbox controllers connected, the controllers will be used preferentially to the keyboard (this is intentional)***. The left and right bumpers (not triggers) control the character. Pressing nothing or both will reset the character to the neutral position.</p><p>***This means if there are four controllers connected to the computer the keyboard controls listed above are irrelevant. If there are three controllers connected, the arrow keys will be used to control the fourth player and the controllers will be used for the other three players. If there are two controllers connected, the arrow keys will be used to control the third player and the A/D keys will be used to control the fourth player...and so on.<br/></p>", "metacritic": null, "released": "2017-05-17", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/d99/d99c8ed60e54493faeb61794b03ffd6c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 39, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Android", "Web"], "developers": ["Spoka"], "genres": [], "publishers": [], "esrb_rating": null}