{"id": 204945, "slug": "snakes-and-ladders-paints", "name": "Snakes and Ladders - Paints", "name_original": "Snakes and Ladders - Paints", "description": "<p>Youtube link - Snakes and Ladders Trailer</p><p>The best looking Snakes and Ladders FREE game is here and ready to play on your android device! <br/>More colourful, more interactive with flawlessly animated characters - one game for the whole family.<br/>A classic family board game - Snake and ladders (called Cute and Ladders, Ludo, Parchis, Parama Patam, Moksha Patam or Vaikuntapaali in some places) up to 4 players on a single devices. </p><p>Rules: The game is a simple race contest. The aim of the game is to be the first player to reach the end by moving across the board from square one to the final (100) square. If you land exactly on a square with the base of a ladder, your player climbs up the ladder to the square at the top of the ladder. If you land exactly at the top of a snake, your player will slide to end of snake. If you roll a six - you take an extra turn. </p><p>Snakes and Ladders Paint offers:<br/>- Two games mode - standard and quick<br/>- Easy to play - one tap gameplay<br/>- Hotseat multiplayer - up to 4 players on some device<br/>- Beautiful and colourful graphics with great animations<br/>- Great tablet support - excellent for hotseat game</p><p>So, download the game, enjoy with your friends and family - it's FREE and fun.</p><p>Homepage:<br/>http://www.zebrito.com/<br/>Facebook: <br/>https://www.facebook.com/ZebritoStudio?ref=hl</p>", "metacritic": null, "released": "2015-09-02", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/6ce/6cea262ed7c6a6585b78176df62a716e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 74, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Zebrito"], "genres": [], "publishers": [], "esrb_rating": null}