{"id": 204922, "slug": "tic-tac-toe-game", "name": "Tic Tac Toe game", "name_original": "Tic Tac Toe game", "description": "<p>Tic Tac Toe, it’s one of the most popular classic games ever! When we were kids, we played it a lot using the chalks on blackboards. And now, you (or your kids) don’t need to play on the blackboards already, all what you have to do is to play it on your smartphone or tablet with our new game! It’s far more cleaner and easier. But it will still bring you the same feelings of that classic game. <br/><br/>Download Tic Tac Toe Game for FREE and play the most addictive game ever created! Our game is the remake of the classic Tic Tac Toe, but this time, our game comes with a new concept and a new amazing environment that will let you play for hours non stop. <br/><br/>Why you need to download and install Tic Tac Toe Game for Free on your smartphone or tablet instead of other classic and arcade games?<br/><br/>•\tAddictive gameplay that will keep you playing for hours non stop!<br/><br/>•\tWe designed an awesome environment to let you enjoy playing within our game.<br/><br/>•\tYou can choose to play within the Single Player mode or Multiplayer mode.<br/><br/>•\tWe have an awesome and very easy to use interface, so your kids can play it easily!<br/><br/>•\tThe best thing is that Tic Tac Toe Game is Free and you can play it without paying any special memberships or annual subscription fees.<br/><br/>•\tStop being bored with old design. Enjoy this new graphic and keep playing for fun!<br/><br/>•\tWant to play our game inside your tablet too? It’s possible! And you can install it on your tablet and enjoy it because it’s responsive and compatible with all devices.<br/><br/>•\tPractice makes perfect! You need to play several times to become an expert gamer.<br/><br/>So, what are you waiting for? Download Tic Tac Toe Game now and enjoy the best free classic game ever!<br/>We are always striving to provide the best user experience for our players. <br/><br/>We are also looking for your feedback, suggestion or recommendation. Please, feel free to let us hear from you at “support@techyee.com “ so we can continue to bring you the best experiences and updates.</p>", "metacritic": null, "released": "2018-06-05", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/d3f/d3fb59bfd7b5aaf373cc978e76a3f21a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 33, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["techyeesolutions"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}