{"id": 204958, "slug": "vincent-van-velociraptor", "name": "Vincent Van Velociraptor", "name_original": "Vincent Van Velociraptor", "description": "<p>This was the first game I ever created, for my first game jam I'd ever participated in, which was also the first game jam I ever ran. I founded the WTF Are We Doing Game Jam in 2013 with Michael Elliott and, for our first year, decided to make a simple platformer.</p>\n<p>We didn't have an overarching theme for the first year, but we did have an Idea Bucket that contained a bunch of suggestions. Some were sincere, some were very silly, and some may have come from Orteil's Game Idea Generator. The prompt for this game was:</p>\n<p><strong>\"You are a velociraptor trying to sneak into a fancy dress party\"</strong></p>\n<p>Originally this was a very different game. The initial level was you climbing a mountain to a fancy chateau, followed by a second level where you would have to infiltrate the chateau without being spotted by partygoers. If you made it to the bar undetected, you won!</p>\n<p>However, near the end of the final day of the jam Stencyl up and killed my project, removing most of the assets in the game and then autosaving without prompting when I attempted to quit and reload. I got real frustrated, having lost literally all of (admittedly pointless) collectibles and my level designs.</p>\n<p>With two hours left, I resolved to finish it out of spite. I made a very simple and short level that was technically impossible to complete. I set the background to an aggressively unfriendly scrolling GIF. And I disabled rotation protection on Vincent's sprite, so he no longer stood properly. This also had the unexpected bonus of allowing you to actually finish the level by glitching your jumps over the larger hills.</p>\n<p>So, this is it. The first game I ever created. It's terrible and it's broken and it was never that great an idea in the first place, but I made it.</p>\n<p>Party hard, classy raptor.</p>\r\nControls\r\n<p>Left and Right Arrows to move left and right.<br/>Space to jump.<br/>Bounce off walls and corners to glitch physics for super-high jumps.</p>\r\nCredits\r\n\n<p>Code, \"Design\", &amp; Concept by Andrew Ferguson<br/>Music by Travis Fishbein<br/>Raptor Sprite by Chris French<br/>Title Screen by Erin Keaskin<br/>Remaining Assets by Stencyl and/or The Internet</p>", "metacritic": null, "released": "2018-01-27", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/fb0/fb0c10b247c1471a45b8ff4e74a366d9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 33, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Andrew Ferguson"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}