{"id": 20496, "slug": "qasir-al-wasat-international-edition", "name": "Qasir al-Wasat: International Edition", "name_original": "Qasir al-Wasat: International Edition", "description": "Qasir al-Wasat is a stealth action-adventure set in an enigmatic 12th Century Syrian palace. You play as an invisible creature, summoned from another world to complete an assassination mission. Although deadly, you are a fragile being and must navigate the trap-filled corridors without alerting guards and… whatever else might be locked in this fortress in-between worlds.<br/>\n<br/>\r\nStep lightly and watch out how you choose to kill your victims, for loud noises and blood stains will surely give out your position to enemies. Remember you can be put down with a single stroke. While exploring the dark corridors, will you fulfill the mission given to you by the enigmatic sorcerer, or will you investigate the mysteries of the palace, at you own risk? Players can search for hidden messages, eavesdrop the fortress’ guards conversations and look for secret passages since not everything is as it seems and there are ancient treasures waiting to be found.<br/>\n<br/>\r\nQasir al-Wasat is built around the tension between action and investigation. The palace is riddled with puzzles, a rich story, nasty traps and an ancient treasure that might be simply too magnificent to ignore. Explore it while embodying a lonesome creature from the underworld, and discover Its peculiar view of humanity. Qasir’s visuals are a love letter to intricate medieval Persian Miniatures, rooted in a thorough historical research. Alongside, an unusual soundscape that is created procedurally with each gameplay.<br/>\n<br/>\r\nThe gates are open and the sorcerer is summoning you, delve into the obscure world of Qasir al-Wasat.", "metacritic": null, "released": "2016-01-19", "tba": false, "updated": "2019-08-28T22:08:36", "background_image": "https://media.rawg.io/media/screenshots/786/786d3691f86231af6fa1c15abbe0e5fa.jpg", "website": "http://qasirgame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 41, "beaten": 1, "dropped": 1, "playing": 1}, "playtime": 4, "achievements_count": 26, "ratings_count": 3, "suggestions_count": 244, "game_series_count": 0, "reviews_count": 3, "platforms": ["macOS", "PC", "Linux"], "developers": ["Aduge Studio"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Zueira Digital"], "esrb_rating": null}