{"id": 205200, "slug": "noodle-olympics-av-prototype", "name": "Noodle Olympics AV Prototype", "name_original": "Noodle Olympics AV Prototype", "description": "<p>Player 1: QWER and ASDF</p>\n<p>Player 2: UIOP and JKL;</p>\n\n<p><strong>How to Play:</strong></p>\n\n<ol><li>Start with Noodle Run. Tap the keys. Tap all the keys. Tap them a bunch. Notice how you move very slowly in the wrong direction? Good!</li><li>Press and hold a few keys, then let go. If you move forward, great!</li><li>Go to the Sandbox. See if you can figure out a better way to move. Good luck!</li></ol>\n<p>One thing I knew from the beginning was that Noodle Olympics needed bright colors to give it a crazy, exciting feeling. Mixing and matching some of the highest-contrast colors I could create—pink, green, blue, and orange—the result is something that will make anyone perk up before they even start playing. The other part of this festive aesthetic is the patterns, which I discovered trying to make something that looks like snake skin. I decided to use similar patterns on the sky and the ground, which I think makes it all look fun, like a foam or sponge material.</p>\n<p>\n</p>\n<p>Conveniently, these high-contrast colors make it exceedingly easy to distinguish the different objects in-game. Nobody is going to lose sight of the big pink-and-green polka-dotted snake in the middle of the screen.</p>\n<p>\n</p>\n<p>The hardest part was the sounds. What does a running snake sound like? I still don’t know. I settled on some generic cheering (it is the Olympics after all) and festive menu music, but I suspect that the game would still benefit from sounds to keep the player engaged for an entire minute of running.</p>", "metacritic": null, "released": "2018-04-04", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/34d/34d64898a97c59dbdb329dfff298d10d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 63, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["mejg"], "genres": ["Simulation", "Sports"], "publishers": [], "esrb_rating": null}