{"id": 20526, "slug": "psychocat-the-answer", "name": "Psychocat: The Answer", "name_original": "Psychocat: The Answer", "description": "Psychocat: The Answer is an evil arcade game about the life of a cat named \"Zag\", who desperately seeks an answer. The purpose is to survive for 180 seconds in a Psychedelic tunnel by dodging the obstacles. The primary gameplay is that sometimes Zag will go through colored walls that will reverse your controls. With this unique and evil mechanic;<br/>\n<br/>\r\n\"it won’t be your reflexes that let you down, it’ll be your concentration – as control reversals mean you’ll constantly have to keep track of what’s up and what’s down (and left and right).<br/>\n<br/>\r\nYou control a Zag as he hurtles down multi-colored, gyrating tunnels packed with obstacles and (worst of all) zones that reverse your controls.  The obstacles aren’t that hard to avoid themselves, but the zones that reverse your controls really mess with your mind.  You can have the best timing in the world, but if you’re pressing the wrong button, you’re going to be one flat cat.  Zag does change color to give you some indication of which controls are reversed, but with so much happening on-screen, that doesn’t make things much easier!\" -Alphabetagamer<br/>\n<br/>\r\nFeatures:<br/>\n<br/>\r\n- The most evil game you will ever play<br/>\r\n- 2 tutorials<br/>\r\n- 1 survival mode <br/>\r\n- 1 epic Answer", "metacritic": null, "released": "2016-01-11", "tba": false, "updated": "2019-08-28T22:08:35", "background_image": "https://media.rawg.io/media/screenshots/6ad/6addef78b7c332de2ca5f9a43535a026.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 33}, "playtime": 4, "achievements_count": 9, "ratings_count": 0, "suggestions_count": 97, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Chewa"], "genres": ["Action", "Casual", "Indie"], "publishers": ["Chewa"], "esrb_rating": null}