{"id": 205328, "slug": "cool-math-games-primary-games-kids", "name": "Cool Math Games: Primary Games kids", "name_original": "Cool Math Games: Primary Games kids", "description": "<p>Maths Games &amp; exercises for kids in KS1 and First Grade (age 5-7 years). Using fun math games in an interactive way to teach kids important maths concepts . Features Addition, Subtraction, Fractions &amp; Splitting, Place value and Time &amp; Clock concepts. Learning numeracy concepts, using Cool and funny games, has never been so much fun .<br/></p>\n<p>List of Quizzes:<br/>*Sort it out: Arrange the numbers in Ascending or descending order by dragging them to their relevant circles. Arrange faster to get maximum stars and also beautiful stickers. The numbers are generated dynamically, so your kid will get new questions each time he/she plays the game without getting bored.<br/>*Number Names: Help the butterfly reach the right set of flower that consists of exactly the same number of flowers as mentioned in the image in the right side. This will help your child improve their counting skills.<br/>*Tens and Ones: This game helps your kindergartener in learning place values like tens and ones by arranging the beads one above the other.<br/>*Even Odd: This game teaches even and odd concept in a fun way using an animated cute frog.<br/>*Fractional Pizza: Feed the hungry monster with the slices of a delicious pizza. This game helps your son/daughter to learn the fractions and have fun at the same time.<br/>*Add Me Up: Add the fishes by touching them and help them reach a bigger aquarium. This really is a fun game to teach addition to the children.<br/>*Cut it Off: Touch the shape as per the instruction and subtract them from the total to get the result.This game teaches your kindergartener shapes as well as subtraction.<br/>*Halves and Doubles: Most of the kindergarteners get confused between halves and doubles. This game helps them to learn with the help of the dots on the lady bug. Hence, making it simpler and avoiding sheer confusion.<br/>*Tick Tock: Every child must know the basic skill of reading the time. Tap the clock that shows the correct time.<br/>A perfect math workout for your child and you'll be able to relax, knowing that your child is learning while having great fun.</p>\n<p>** About Greysprings<br/>** Visit us at www.greysprings.com<br/>** Contact us: contact@greysprings.com<br/>** Privacy<br/> 1. Privacy policy: http://www.greysprings.com/privacy.php<br/> 2. We do not collect any personal information about kids</p>", "metacritic": null, "released": "2018-03-27", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/982/982d958e52ddcecb680d3c83ae5b5cae.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 94, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["greysprings"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}