{"id": 205343, "slug": "on-the-gird", "name": "On The Gird", "name_original": "On The Gird", "description": "<p>This is an entry for Ludum Dare 39, theme was \"Running out of power\".</p>\n<p> The game is an electricity grid simulator, simple concept, you make electricity then sell it to make money. If you get bankrupt it's game over. The Gird in the title is not a typo it's absolutely intended.<br/></p>\n<p>HOW TO PLAY</p>\n<p>Yeah wish i had time for a tutorial. Start with placing a line between the 2 generator, or you get bankrupt before noon in the first day :P  You basically have 5 building blocks:</p>\n<ul><li>City</li></ul>\n<p>This block consumes energy according the time of the day. As time passes they use more and more energy. If you deliver the energy to the city you get money for exchange, but if you fail to meet the demand you pay double for the undelivered capacity.<br/></p>\n<ul><li>Line</li></ul>\n<p>Use this to plug transformers together<br/></p>\n<ul><li>Coal Power Plant</li></ul>\n<p>Power Plant. Generates power by burning coal. Electricity generation has a cost so take care that you are generating as much as you need and not more. You can change the plant capacity by clicking on it and changing the \"Target capacity\". Please note that it's take some time before the plant reach the targeted capacity.  New plants start at 0% capacity.<br/></p>\n<ul><li>Solar Power Plant</li></ul>\n<p>Power plant. Generates power during daytime. Cheap, power generation is free, don't working at night.<br/></p>\n<ul><li>Transformer</li></ul>\n<p>The electricity is flowing between transformers(of course only if there is a line between them). The power plants deliver their power to a transformer and the city takes the electricity what he need from one. Please note that a transformer only can do one job at a time, it is either in Input or Output mode but not both.<br/></p>\n<p>TIPS<br/></p>\n<ul><li>Making electricity and transporting it cost money, but cost less than not making enough for the customers. Try to make just enough to maximize your profit(if there is no green or red indicators in the graph then the generation is optimal). </li><li>Don't go above the transformer capacity or it's stop working</li></ul>", "metacritic": null, "released": "2017-07-31", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/802/802dbc23d0da87c823b399566fc1bcee.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 38, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["aeai"], "genres": [], "publishers": [], "esrb_rating": null}