{"id": 205389, "slug": "heated-groceries", "name": "Heated Groceries", "name_original": "Heated Groceries", "description": "<p>Heated Groceries is a game-based learning game created for university assessment, being submitted for both SGD102 and SGD200. It is designed to teach the player about the various types of fire extinguishers, and which one to use in which situation.<br/><br/></p>\n<p>Heated Groceries is a top-down 2.5D game where the player controls an avatar that must run around a supermarket map with the goal of putting out multiple fires in an overly-chaotic environment. The player can pick up any of the firefighting equipment (hereafter FFE) available to them by running over to it but can only hold one at a time. When the player uses the FFE on a fire, it will either shrink in size if the correct equipment is used, or it will backfire/explode and the intensity of the fire increases, which makes the fire spread at a faster rate. The frequency of fires spawning increases as the game progresses, and if it becomes too intense, the evacuation alarm can be played, and the game is ended. Points are awarded for each fire extinguished, but all points are deducted if the evacuation alarm is not activated and the player dies from the fire.</p>\n<p>‘Heated Groceries’ is a game-based learning game with the purpose of teaching which fire safety equipment to use, depending on the type of fire being dealt with, to  employees undergoing mandatory Fire and Evacuation training in a first response scenario. The game uses common firefighting equipment, as well as types of fires that could occur in the environment. It is intended to be used in conjunction with mandatory fire and evacuation employee training by replacing a small portion of the disengaging literacy theory. The game will be compliant with Queensland’s Building Fire Safety Regulation 2008.\r\n</p>", "metacritic": null, "released": "2018-06-22", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/e23/e235ed552b9c871464b699bed8a97651.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 4, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["UnIockables"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}