{"id": 205409, "slug": "jwing-ext", "name": "jwing EXT", "name_original": "jwing EXT", "description": "<p>jwing EXT is also available on phones and tablets! =)<br/>Get it for free at: <br/>https://play.google.com/store/apps/details?id=proc...</p><p>INSTRUCTIONS</p><p>English:<br/><br/></p><p><strong>The Magic Balls are out! And so is The Possum!</strong><br/><br/>jwing, the fun and addictive puzzle game!<br/><br/>Work with balls of different colours and weights in order to level up, gain as much jmoney as you can and achieve an enviable high score!<br/>On keyboards, use the LEFT and RIGHT keys to move the dropper across the screen and drop balls onto the sets of scales by pressing the DOWN key. On mobile phones and tablets, just click on the left and right side of the screen for transport and use the white coloured area to drop.<br/>Gain points by aligning at least three balls of the same colour in a horizontal line and watch them gather matching balls above and below the combo before leaving the screen.<br/>Save space on your board by merging five balls of the same colour placed on top of each other into one heavier ball.<br/>Listen to the warning lights in order not to break the dropper through stacking the balls too high as this would cause you to lose the game.<br/>Make sure you watch out for weight imbalances and resulting scale movements as they can be very inconvenient and even lead to game overs if you get unlucky!<br/>After every 50 balls dropped onto the field, you level up and an additional colour is added to the mix, making it harder and harder for you to score points and keep playing.<br/>At the end of the game the points you earned are converted into jmoney, allowing you to buy Power Ups and Characters.<br/>Once your game is over, press the DOWN key five times to go back to the main menu.<br/>Have fun playing and remember to think of a good strategy to rely on for success! :)</p><p>Games with Colours<br/>https://gameswithcolours.wordpress.com/</p><p>German:<br/><br/></p><p><strong>Jetzt neu: Magic Balls und The Possum!</strong><br/><br/>jwing, das lustige Spiel mit Suchtpotenzial!<br/><br/>Arbeitet mit Kugeln verschiedener Farben und verschiedenenen Gewichts um neue Level zu erreichen, jmoney zu verdienen und einen beneidenswerten High Score zu erzielen!<br/>Wenn ihr mit Tastatur spielt, benutzt die RECHTS- und LINKS- Tasten um den Dropper über das Spielfeld zu bewegen und die RUNTER-Taste um Kugeln auf die Waagenschalen fallen zu lassen. Auf Handys und Tablets drückt ihr rechts oder links auf den Bildschirm um den Dropper zu bewegen und auf den weiß markierten Bereich um Kugeln fallen zu lassen.<br/>Um zu punkten müsst ihr mindestens drei gleichfarbige Kugeln horizontal nebeneinander reihen. Schaut zu wie passende Kugeln über und unter der Kombo eingesammelt werden bevor alle zusammen vom Bildschirm verschwinden.<br/>Um Platz auf dem Spielfeld zu sparen könnt ihr fünf Kugeln gleicher Farbe vertikal übereinander stapeln und sie so zu einer schwereren Kugel verschmelzen.<br/>Warnlichter zeigen an wie viele Kugeln auf einen Stapel noch hinzugefügt werden können bevor er zu hoch wird und den Dropper zerstört - und ihr somit das Spiel verliert.<br/>Passt auf Gewichtsunterschiede der Kugeln und daraus resultierenden Auf- und Ab-Bewegungen der Waagen auf! Sie können sich nicht nur sehr unvorteilhaft auswirken sondern im schlimmsten Fall sogar zum Spielende führen.<br/>Nach 50 ausgespielten Kugeln steigt ihr ein Level auf und euer Kugelmix wächst um eine zusätzliche Farbe, was es immer schwerer macht Punkte zu erzielen und im Spiel zu bleiben.<br/>Nach Spielende werden eure gesammelten Punkte in jmoney umgewandelt mit dem ihr Power Ups und Charaktere kaufen könnt.<br/>Um nach Spielende ins Hauptmenü zurück zu gelangen müsst ihr fünf Mal die RUNTER-Taste drücken.<br/>Viel Spaß beim Spielen und vergesst nicht euch eine erfolgreiche Strategie zu überlegen! :)</p><p>Games with Colours<br/>https://gameswithcolours.wordpress.com/</p><p>French:<br/><br/></p><p><strong>Nouveau: Magic Balls - les boules magiques - et The Possum!</strong><br/><br/>jwing, jeu amusant et addictif!<br/><br/>Travaillez avec des boules de couleurs et de poids différents afin de monter de niveaux, de gagner du jmoney et d'atteindre un high score dont les autres seront jaloux !<br/>Si vous jouez avec un clavier, utilisez les touches de DROIT et de GAUCHE pour bouger le dropper d'une côté de l'écran à l'autre et tombez les boules sur les balances avec la touche de BAS. Sur portables et tablettes, touchez l'écran sur le côté droit ou gauche pour bouger et tombez les boules en tapant sur l'aire blanche.<br/>Pour gagner des points, vous devez aligner au moins trois boules de la même couleur de façon horizontale. Elles ramasseront des boules correspondantes en-dessus et en-dessous de la combo avant de disparaître de l'écran. <br/>Afin d'économiser de l'espace sur le terrain de jeu, empilez cinq boules de la même couleur les unes sur les autres et regardez comment elles se fusionnent en une seule boule plus lourde.<br/>N'ignorez pas les signaux lumineux qui vous indiquent combien de boules vous pouvez empiler avant de détruire le dropper et ainsi perdre la partie.<br/>Faites attention aux mouvements des balances provoqués par des boules de poids différents ! Ils peuvent être très désavantageux et même aboutir à la fin du jeu.<br/>Après chaque 50 boules jouées, vous montez de niveau et une nouvelle couleur est ajoutée au mélange de boules ce qui fait qu'il devient de plus en plus difficile de gagner des points et de rester dans le jeu.<br/>Après chaque partie, vos points gagnés sont transformés en jmoney avec lequel vous pouvez acheter des Power Ups et Personnages.<br/>Pour retourner au menu principal après une partie jouée vous devez taper la touche de BAS cinq fois.<br/>Amusez-vous bien et n'oubliez pas de développer une stratégie à succès! :)</p><p>Games with Colours<br/>https://gameswithcolours.wordpress.com/</p>", "metacritic": null, "released": "2015-07-15", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/947/947080c8b491b2e3de0f19290af3bc53.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 58, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Games With Colours"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}