{"id": 205525, "slug": "islamic-girl-puzzle", "name": "Islamic: Girl Puzzle", "name_original": "Islamic: Girl Puzzle", "description": "<p>Islamic : Girl Puzzle works almost like real jigsaw puzzles for kids. Once you pick a piece it stays on the board even if you place it incorrectly, and you can nudge pieces around until it snaps to the right slot. <br/><br/>Each relaxing puzzle features a different beautiful scene drawn by a professional cartoon artist, and a unique reward when the jigsaw puzzle is completed. Scenes include things like cute animals, dragons, or dinosaurs, and the rewards can be to pop balloons, fruits, snowflakes or many more!<br/><br/>Islamic : Girl Puzzle Features :<br/><br/>- 8 different kids jigsaw puzzles with gorgeous HD graphics<br/>- Tons of unique and perplexing Girl puzzles to play with. Stay tuned for upcoming new ones!<br/>- Receive bonus reward by completing achievement targets<br/>- Play with your own pace: Make the jigsaw as simple/hard as you want<br/>- Beautiful HD picture jigsaws in various themes: Animal, Scenery, Plant and City<br/>- Completely FREE Girl photo puzzle game<br/>- Easy and relaxing to play, hard to fully master<br/>- Enjoyable game for EVERYONE: Kid, Adult, Commuter, Girl, Boy, Housewives, Elderly etc.<br/>- Play whenever and wherever you want: WIFI is not a must for Game<br/>- Cool Sound<br/>- Great Graphics<br/><br/>5 puzzles are available for free , Remaining 3 Come as soon as..!<br/><br/>For more fun check out our other cool, fun and educational kids games for babies, toddlers, boys and girls!<br/><br/>Download and join Islamic : Girl Puzzle photo game NOW!<br/><br/>Store : https://play.google.com/store/apps/dev?id=5656828753256905600<br/>Facebook : https://www.facebook.com/KiyanSoftech<br/>Twitter : https://twitter.com/kiyan_softech<br/>YouTube : </p>", "metacritic": null, "released": "2017-08-03", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/8b8/8b812f604ca4edafac0898d1ecc1cf44.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 81, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["KiyanSoftech"], "genres": [], "publishers": [], "esrb_rating": null}