{"id": 205632, "slug": "inky-squirts-demo", "name": "Inky Squirts (Demo)", "name_original": "Inky Squirts (Demo)", "description": "<p><strong>Inky Squirts</strong> is a 2D side-scrolling adventure game for all ages. I produced all elements except for the music, which is by Ennio Morricone. (Licensing will be secured upon games completion)</p>\n<p>When my 6 year old daughter drew a picture of a cute little octopus...</p>\n\n<p>I felt inspired to make this game. I wanted to develop a game that could appeal to both children and adults, with the hope that maybe both could enjoy the game together. I have 8 levels total planned out for this game with various adventure and puzzle elements. There is also a slight twitch aspect to <strong>Inky Squirts</strong> as well. That means that some of the game relies on the players ability to make quick movements/decisions.</p>\n<p>I may design the game to have 2 separate play modes to offer an easier option for younger children and inexperienced gamers. </p>\n<p>I've also been developing a mini game within <strong>Inky Squirts</strong> as a sort of “easter egg”. This would not be so much a side quest but rather an entire <strong>Inky Squirts</strong> mini game in and of itself.</p>\n<p>If feedback is positive I intend to complete this game. It is designed for desktop and tablet, although touch controls are not currently fully developed yet. I will most likely get to work on those very soon and hopefully have a demo for tablet users.</p>\n<p>Lastly, If anyone is interested... I developed this game using Ps and Ae CS6, GarageBand, Bfxr, PhysicsEditor and GameSalad.</p>\n\n<p>YOU CAN PLAY A BROWSER BASED VERSION OF THE INKY SQUIRTS DEMO HERE http://gsrca.de/147709</p>\n<p>PLEASE NOTE INKY SQUIRTS IS NOT INTENDED TO BE ABROSWER BASED GAME SO PLEASE BE PATIENT WITH THE LOADING TIMES. FIREFOX SEEMS TO PERFORM FAIRLY PRETTY WELL.</p>", "metacritic": null, "released": "2018-03-20", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/47c/47cd1e77936ccf4ce40a411bf87441f9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 63, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS"], "developers": ["Mind Games Publishing"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}