{"id": 205602, "slug": "rat-race-todd-d-vance", "name": "Rat Race (Todd D. Vance)", "name_original": "Rat Race (Todd D. Vance)", "description": "<p>Beta version!</p><p>Use either WASD or arrow keys to run the rat.</p><p>current version: 3 lives then game hangs.  3 randomly-moving cats and 1 aggressive waypoint-AI cat.  Eat all the cheese dots and nothing happens.</p><p>Everybody likes cats, right? not me, I'm allergic! So I kind of feel for the mouse.....</p><p> Here is the Game Design Document (not all of below is implemented in this prototype!)</p><p> Rat Race</p><p> Classic arcade action!</p><p> The name of the game is Rat Race (the name of the git project was chosen before I decided that).</p><p> You control a rat in a maze. The rat must clear the maze of little bits of cheese while being chased by aggressive cats. Each maze has big pieces of growth-hormone-laced cheese which temporarily turns the rat into a super rat that can chase and swallow the cats.</p><p> Like a real rat race, once you clear the board, you have to race again. But of course, somebody has moved the cheese(s) now.<br/> Features include</p><p> 3 rats per play, bonus rats at various score levels</p><p> score points by eating cheese bits, more for bonus peanut butter and swallowing cats (exponential score increase for each cat swallowed while a super rat, up to 1600 points)</p><p> Lose a life if a cat catches you and you are not a super rat</p><p> High Score is saved</p><p> animated sprites, music and sound effects, and visual effects</p><p>simple cutscenes</p><p> handcrafted mazes with teleportation tunnels and automatic coloring</p><p> bonus pickups</p><p> keyboard or gamepad control</p><p> play in your HTML5-compatible web browser</p><p> full screen mode available</p><p> Made with Unity3D</p>", "metacritic": null, "released": "2016-11-26", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/28c/28c9cb598436246bfda6ec57eae307c8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 24, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Todd D. Vance"], "genres": ["Action"], "publishers": [], "esrb_rating": null}