{"id": 205628, "slug": "mechaniclock", "name": "Mechaniclock", "name_original": "Mechaniclock", "description": "<p>A game where the mechanics change as you play!</p><p>What do you do now? Shoot them!</p><p>Now? Avoid them speeding through space!</p><p>Now? Dance Dance DANCE!</p> <ul><li>WASD to move</li><li>Mouse to look</li><li>Space to perform an action specific to each type!</li></ul> <p>Here's a little help with the modes if you're feeling stuck</p><p><strong>Bullet</strong> - Gain score through shooting the others, avoid their shots, space to fire</p><p><strong>Shepard</strong> - Gain score by pushing others to the sub-circles, space to make them lock to your rotation and push them in the direction you want them to move</p><p><strong>Line</strong> - Gain score by making a line in front of an other, space to make a line</p><p><strong>Gravity</strong> - Gain score by shifting the gravity whilst avoiding the others speeding because of it, space to shift gravity</p><p><strong>Monster</strong> - Gain score by making monsters eat others, also don't let them eat you..; space to spawn an other in front of you</p><p><strong>Dance</strong> - Get as close as you can to as many others as you can for pointspointspoints, space to bring others closer to you</p><p>Music used is an unedited piece by Armadillo, available for use through the Creative Commons Attribution License (Details here: https://creativecommons.org/licenses/by/4.0/), the original song found and downloaded from here: http://armadillo.cc/nothinglikeac9/</p>", "metacritic": null, "released": "2016-01-23", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/2dc/2dc4fa5e33e56343c3f6f49ea906dfe3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 79, "game_series_count": 0, "reviews_count": 0, "platforms": [], "developers": ["BigHandInSky"], "genres": ["Action"], "publishers": [], "esrb_rating": null}