{"id": 205841, "slug": "toverhoed-de-bedelaar-mobile-game", "name": "Toverhoed & De bedelaar ( Mobile game)", "name_original": "Toverhoed & De bedelaar ( Mobile game)", "description": "<p><strong>Toverhoed &amp; De Bedelaar het verhaal:</strong></p><p>Ooit was er eens een jonge toverhoed,<br/>hij woonde in een schitterend huis, <br/>hoewel hij alles had wat zijn hartje maar begeerde,<br/>was Toverhoed verwend, onzeker en duwde iedereen die hem lief had weg.<br/><br/>Maar toen op een winter avond klopte er een bedelaar aan,<br/>hij bood aan om mee te gaan minecraften voor de gezelligheid,<br/>vol onzekerheid lachte toverhoed om zijn aanbod en wilde hij de bedelaar wegsturen.<br/><br/>Hij waarschuwde Toverhoed dat hij zich niet door de agressieve manier van aanpak moest laten bedriegen, want echte vriendschap vind jij pas van binnen.<br/>Toen Toverhoed hem nog steeds de deur wees, smolt de bedelaar weg om plaats te maken voor een  verschrikkelijke dictator.<br/><br/>Toverhoed wilde het contact verbreken maar het was te laat, <br/>hij had zich al genesteld in zijn vriendengroep, als straf veranderde hij Toverhoed in een verschrikkelijk monster, hij vertelde gruwelijke leugens over Toverhoed en al zijn vrienden.<br/><br/>Zich schamend voor de buitenwereld verschuild Toverhoed zich op zijn kamer, <br/>met alleen zijn beste vriend als venster naar de buitenwereld, de leugens die ze over hem vertelde waren in werkelijkheid gewoon woorden die zouden blijven rondgaan tot Toverhoed 24 jaar werd. <br/><br/>Als hij ook iemand anders kon lief hebben voordat de laatste woorden waren gesproken, dan pas zou de waarheid aan het licht komen.<br/><br/>Als dat niet gebeurde dan zou hij verdoemd zijn om altijd een beest te blijven,<br/>maand na maand ging er voorbij en hij verloor alle hoop.. <br/>Want wie zou er ooit vrienden kunnen zijn met een beest?<br/><br/><strong>In deze game speel jij als '' De Bedelaar'' en is het de bedoeling dat jij Toverhoed zo<br/></strong><strong>vaak mogelijk raakt met maar 3 levens! En dan om het nog moeilijker te maken ..<br/></strong><strong>Het spelletje gaat steeds sneller.. en sneller!</strong></p><p><strong>Wizard &amp; The Beggar The Story:</strong></p>\r\n\r\nOnce upon a time there was a young magic hat,\r\nHe lived in a beautiful house,\r\nAlthough he had everything his heart desired,\r\nWreck was spoiled, insecure and pushed everyone who loved him.\r\nBut then on a winter evening there was a beggar,\r\nHe offered to go with minecraft for the cosiness,\r\nFull of insecurity laughed at her husband's offer and wanted to send out the beggar.\r\nHe warned Toverhoed that he did not have to deceive himself by the aggressive approach, because real friendship does not come true.\r\nWhen heirens still be the door, the beggar smolts away to make way for a terrible dictator.\r\nSuperman wanted to break the contact but it was too late,\r\nHe had already nestled in his group of friends, as a punishment, he turned toverhoed into a terrible monster, he told horrendous lies about Toverhoed and all his friends.\r\nShameful to the outside world, worshiped in his room,\r\nWith only his best friend as a window to the outside world, the lies they told about him were in reality just words that would continue to wander until 24 years.\r\nIf he could also love someone else before the last words were spoken, then only the truth would come to light.\r\nIf that did not happen then he would be damned to always stay a beast,\r\nMonth after month went by and he lost all hope ..\r\nBecause who could ever be friends with a beast?", "metacritic": null, "released": "2017-06-22", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/3a1/3a1cd1341d91b8f193e43cf9de8838f5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 62, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Toverhoedchannelnl"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}