{"id": 205955, "slug": "fail-loop", "name": "Fail Loop", "name_original": "Fail Loop", "description": "<p>\n<strong>Predict the FAIL in Funny Videos. Press to Crash!<br/>\n</strong>\n</p><p><strong><strong>http://failloop.com</strong><br/></strong></p><p><strong>--</strong></p><p>\n<strong>The world's first app that makes winners out of losers!</strong></p><p>Whats the most German thing you can think of? Beer, Dirndl and Sauerkraut? Wrong. It's „Schadenfreude\" – the joy you feel watching others fail. Even this word just exits in German the mechanic works internationally. If it's cats who graciously overrate their abilitys, grooms whose trousers are widely open or even the trainer of Germany's soccer national team who seemingly enjoys to sort his private parts in front of millions of people – there is a reason why youtube videos showing failour in public have millions of views all around the world.</p><p>A small team around Berlin used this international delight in voyourism and developed an app where the users earn their points on others fails. Even if fail videos are watched by millions everday the enjoyment is a passive one as, until now, you couldnt intervene in the story.</p><p>Fail Loop offers exactly, what you tube videos are missing: Interactivity. The app makes the passive bystander an active player and engages him right in the moment the desaster ist happening. We watch a skater proudly starting his stunt, a happy kid running for a balloon, the Germany's national trainer seconds bevor the game is won. And all of a sudden the events take an unexpected turn, the world is watching and Fail Loop users are right in the middle o fit. Other people's failiour turns into the ultimative mobile gaming experience – a potential that nobody used before.</p><p>Fail Loop is the first game, that combines the worldwide success of fail videos with an app, where the users not only can consume the videos, but interact with them. Chapter for chapter you can open up new theme-levels, more videos and harder challenges. Why only like fail videos, if you can enjoy them with your friends? Those can be engaged by different functions, challenged and battled – everytime and everywhere. Schadenfreude never was more fun!</p>", "metacritic": null, "released": "2016-12-01", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/57d/57d435048bf6dbaa6bf7ff4d0b369605.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 164, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["failloop"], "genres": [], "publishers": [], "esrb_rating": null}