{"id": 20609, "slug": "orelight", "name": "OreLight", "name_original": "OreLight", "description": "OreLight, a dungeon crawling, multiplayer RPG with crafting, mining, base building and stabbing. <br/>\r\nEverything in the world can be dug up, replaced or moved, so building anything from a small hut to an entire town is possible. <br/>\r\nThe world is split into multiple areas; each area has its own procedurally generated world with dungeons, camps, forests, skeletons and a bunch of other OREsome stuff.<br/>\n<br/>\r\nWant to be a Warlock? A Swordsman, Blacksmith, one of those mysterious lone rogue guys? A King, an Archer? A Robot archer? That’s all good. Want to look like a fire spitting marauder, that’s cool. You can mix up your armour and items to play and look however you want.<br/>\n<br/>\r\nSWAP, STEAL, FARM, FIND, LOOT, LOSE, FIND AGAIN. There’s many an item in the world of OreLight; use Swords, Bows, Magic, Traps and Cannons to protect your base. <br/>\r\nThe AI is a key aspect of the game, we wanted the game to feel more like a game so the AI verges on breaking the 4th wall with their random conversations about daily life as a dungeon minion. AI wander around, have conversations with each other, use doors, shout for assistance, hunt you down, steal your stuff or just get so overwhelmed by your furious stabbing powers that they give up and flee. AI isn't the only thing to worry about, OreLight was built for multiplayer so watch your back and keep an eye on your loot.", "metacritic": null, "released": "2015-06-29", "tba": false, "updated": "2019-08-28T22:08:32", "background_image": "https://media.rawg.io/media/screenshots/d0f/d0f0cb41bf8f64bba7f01315771bf689.jpg", "website": "https://www.orelight.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 16}, "playtime": 9, "achievements_count": 10, "ratings_count": 0, "suggestions_count": 176, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC", "Linux"], "developers": ["GeekBeach"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["GeekBeach"], "esrb_rating": null}