{"id": 20610, "slug": "urja", "name": "Urja", "name_original": "Urja", "description": "Urja is fun, fast paced and challenging. This puzzling first person shooter will transport you into 12 beautiful worlds where you will try to strike the balance between stealth and tactical strategy to reach the top of our global leaderboards and take part in community competitions for real life prizes! The objective is simple; destroy all the entities as fast as you can. There are many different ways to approach each world and with intuitive AI every game will be different.Entities<br/><ul><li>Entities will attempt to stay alive by feeding on the energy found around them.<br/></li><li>Entities have the ability to discharge energy. This is typically used to temporarily stun their prey.<br/></li><li>Higher ranking entities can move faster and drain energy at greater distances.<br/></li><li>Entities can transfer themselves into the depleted shell of higher ranking entities and as a result become more powerful.<br/></li><li>The entities' appearance is inspired the board game chess. The knight, Bishop, and Rook entities have unique abilities.<br/></li><li>The Knight has the ability to enable a shield to block incoming energy.<br/></li><li>The Rook's ability is to create temporary glass structures, which can be used to block. entrances/exits.<br/></li><li>The Bishops unique ability is the power to resurrect dead entities.</li></ul>Seasons<br/>With Urja you will have the opportunity to win prizes, improve your FPS skills and challenge your friends on our new global leaderboards. Each year is split into four seasons and the top 10 players from each season will win prizes. Prizes consist of the latest AAA PC games, Steam vouchers and much more. As each season passes by expect new maps, game mods bug fixes and more.... <br/><br/>If you would like to find out more info on season one, or if you have any questions about Urja we have a dedicated support team on hand at <strong>play@urja.me</strong>", "metacritic": null, "released": "2015-01-09", "tba": false, "updated": "2019-09-17T09:21:35", "background_image": "https://media.rawg.io/media/screenshots/b27/b2768108376b0a59422c9bafc95a00ad.jpg", "website": "https://urja.me/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 209, "toplay": 1, "playing": 1}, "playtime": 4, "achievements_count": 0, "ratings_count": 3, "suggestions_count": 144, "game_series_count": 0, "reviews_count": 3, "platforms": ["macOS", "PC"], "developers": ["Breaking Fourth"], "genres": ["Strategy", "Casual", "Indie"], "publishers": ["GrabTheGames"], "esrb_rating": null}