{"id": 2061, "slug": "riptide-gp2", "name": "Riptide GP2", "name_original": "Riptide GP2", "description": "Rev up your rocket-powered hydro jet and put your racing skills to the test as you rip across a dynamic, ever-changing torrent of waves in Riptide GP™2.<br/><br/>Race through futuristic cityscapes, twisting canals and rivers, open harbors and mysterious research facilities.  Hurl yourself off sky-high jumps and bust out death defying stunts.  Build a collection of powerful watercraft and customize their performance and paint schemes to suit your individual style.  Take your skills online to battle other players around the world -- or trade elbows with friends in split-screen matches right in your home!  <br/><br/>Featuring dynamic racing on fully interactive water surfaces, a deep career mode with tons of upgrades, customizable riders and skills, online and local multiplayer, and fully integrated controller support, Riptide GP2 is the standard in modern water racing games.<br/><br/>From Vector Unit, developers of Hydro Thunder Hurricane on Xbox 360 and Windows 8.Features<ul><li><strong>Single Player Career Mode</strong><br/>Compete in over 60 challenging Race, Hot Lap, Elimination, and Freestyle events. <br/></li><li><strong>Upgrade Your Watercraft</strong><br/>Collect 10 powerful hydro jets and upgrade their performance and colors to gain an edge on your competition.<br/></li><li><strong>Thrilling Stunt System</strong><br/>Level up your character to unlock and master 25 outrageous stunts. Wow the crowd, charge your boost and make your competition eat wake.<br/></li><li><strong>Online Multiplayer</strong><br/>Pit your skills against the world's best in fierce online battles. <br/></li><li><strong>Split Screen Multiplayer</strong><br/>Trade elbows with your friends in 2 player, 3 player, and 4 player split screen races.<br/></li><li><strong>VR Challenge</strong><br/>Race against virtual recordings of your Steam Friends' best performances in \"VR Challenge\" mode.<br/></li><li><strong>Full Controller Integration</strong><br/>Play in Big Picture mode.  Seamlessly switch between keyboard and gamepad without having to tweak settings.<br/></li><li><strong>Online Sync &amp; Backup</strong><br/>Keep your game synced to the cloud and continue your game across computers with your Steam ID.</li></ul>", "metacritic": null, "released": "2013-07-23", "tba": false, "updated": "2023-07-31T22:06:26", "background_image": "https://media.rawg.io/media/screenshots/473/4736315fa58be917b609d8c947407db7.jpeg", "website": "http://www.vectorunit.com/riptide-gp2/", "rating": 3.26, "rating_top": 4, "added_by_status": {"yet": 8, "owned": 318, "beaten": 4, "toplay": 3, "dropped": 7, "playing": 1}, "playtime": 3, "achievements_count": 124, "ratings_count": 23, "suggestions_count": 550, "game_series_count": 0, "reviews_count": 23, "platforms": ["Xbox One", "PlayStation 4", "PC", "Android", "iOS"], "developers": ["Vector Unit"], "genres": ["Action", "Simulation", "Sports", "Racing", "Indie"], "publishers": ["Vector Unit"], "esrb_rating": "Everyone"}