{"id": 2063, "slug": "arcane-quest-2", "name": "Arcane Quest 2", "name_original": "Arcane Quest 2", "description": "Explore the dungeons with this board game rpg, in classic table top style!<br/><br/>Enjoy the thrill of an epic journey, in a mix of adventure, strategy and role playing.<br/>Find out the truth behind the Arcane powers in the world of Auria, build up your own guild and gain prestige among the realm.<br/> <br/>Features:<br/>- Loyal to the classic tabletop gameplay, fight hordes of Orcs, Goblins, Undead, Chaos Knights and many other fantasy creatures<br/>- An epic storyline and dozens of side quests to keep you entertained for 50+ hours<br/>- 8 unique heroes: Warrior, Dwarf, Wizard, Elf, Evoker, Assassin, Cleric and Ranger<br/>- 150 equipment and spells options, to customize each of your heroes to suit your combat style<br/>- Classic RPG levelling system, gain experience to make your heroes become legends<br/>- A glorious soundtrack will accompany you through your adventure<br/> <br/>What Arcane Quest players are saying:<br/>- “Excellent adaptation of the HeroQuest board game. Brings back many childhood happy memories.”<br/>- “If you are looking to play a simple D&amp;amp;D board game for your phone, this is the game. Easy and fun, love it.”<br/>- “If you have been looking for a fantasy board game this is the best.“<br/>- “If you were a fan of Hero Quest, Dragon Strike or D&amp;amp;D, board games, this is the perfect app to bring you back.”", "metacritic": null, "released": "2014-11-22", "tba": false, "updated": "2019-10-22T14:27:57", "background_image": "https://media.rawg.io/media/screenshots/e34/e344268e24157ed78f0c0f17997a4f0f.jpeg", "website": "http://www.nexgamestudios.com/arcane-quest2", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 202, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Marco Pravato"], "genres": ["RPG", "Strategy"], "publishers": ["Marco Pravato"], "esrb_rating": "Teen"}