{"id": 206416, "slug": "nuclear-arms-5-orphan-overdrive", "name": "Nuclear Arms 5: Orphan Overdrive", "name_original": "Nuclear Arms 5: Orphan Overdrive", "description": "<p>Craig Killbane tries to take a well earned vacation, but it's interrupted by a swarm of radio active orphans. Killbane needs to save the Orphans from the radiation and find them loving families. You play Craig Killbane in this next episode of the long running series Nuclear Arms!</p>\n<p>As Craig Killbane, you need to run into the Orphans crawling on the ground to pick them up before they morph into the orphan monster in the center of town. Then throw them into the open doors of loving families you see scattered across the city. You win when you get an orphan into every door!<br/>If you take too long, the orphan monster will grow to maximum size and start Armageddon. Knock orphans off of the monster by charging into it.</p>\n<p>- WASD to move<br/>- Mouse to look/aim<br/>- Hold Left Click to increase throw distance and release to throw<br/>- Right Click to Charge obstacles out of your way (And to knock orphans off the monster)<br/>- Holding too many orphans at once will slow you down<br/>- Delivering orphans to families speeds you up as you absorb their radiation.</p>\n<p>This game follows the adventures of Craig Killbane. You can check out the first 4 parts of the adventure from our past Ludum Dare submissions:</p>\n<p>Nuclear Arms - http://ludumdare.com/compo/ludum-dare-32/?action=preview&amp;uid=10322<br/>Nuclear Arms 2 - http://ludumdare.com/compo/ludum-dare-34/?action=preview&amp;uid=10322<br/>Nuclear Arms 3 - http://ludumdare.com/compo/ludum-dare-37/?action=preview&amp;uid=10322<br/>Nuclear Arms 4 - https://ldjam.com/events/ludum-dare/39/nuclear-arms-4-fallout-of-the-mountain-ki...</p>\n<p>We had another great Ludum Dare this time around. We're continuing the Nuclear Arms theme with this Ludum Dare game as we have with all our past games. We decided to go with 3D again as we have a new member on the team who knows how to create and animate 3D models. We're very excited to show you the first ever Craig Killbane in full 3D.</p>\n<p>Credits:</p>\n<p>Logan Marks - Programming (Trajectory, Implementing Assets), Level Creation</p>\n<p>Taylor Seely - Story Board, Sound and Asset Finder</p>\n<p>Mitchell Maclean - Programming (Player, Implementing Assets)</p>\n<p>Brodie Beaman - Programming (Orphans), Sound Editting, Post Processing </p>\n<p>Chad Gerein - Programming (Spawners), Loot Box</p>\n<p>Shelby Christie - 3D Art and Animations</p>\n<p>Brenden Roach - Slide Art</p>\n<p>**Some art was free from the Unity Store</p>", "metacritic": null, "released": "2018-04-10", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/ab0/ab07dc506756d123b9e3f04503069588.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 8, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["Logicon211"], "genres": ["Action"], "publishers": [], "esrb_rating": null}