{"id": 206483, "slug": "num-one", "name": "Num One", "name_original": "Num One", "description": "<p>Num One takes match-3 puzzles to the next level of puzzle game-play. Match blocks of the same number and color to create a new block of a greater number. The process of building bigger numbers gives you a sense of achievement not possible with simple match-3 games.<br/><br/>As blocks are combined to form greater numbers, the block levels up and gains the ability to jump over other blocks. The ability to swap blocks across larger distances induces more strategic options for combining 3 or more blocks.<br/><br/>In order to create the biggest possible number, you must organize your blocks by taking advantage of block jumping. Good organization and strategy allows a player to progress. The combination of strategic organization makes Num One provide a new style of puzzle game-play.<br/><br/>How large of a number can you create?<br/><br/>Num One features:<br/>-5 unlockable game-modes<br/>-32 block-number achievements<br/>-Strategic puzzle game-play<br/>-Makes combining numbers fun and exciting<br/>-Highscore rankings<br/><br/>Num One mixes mathematics with a puzzle game in a fun and exciting way. Num One's core block progression is the powers of 3: 3, 9, 27, 81, 243, 729, 2187, ...<br/><br/>Because Num One adds the ability to increase block swap-range through leveling up, the player has more options for organizing blocks compared to your typical match-3 game. Some movements even become asymmetric, meaning that block A may be able to swap with block B, but not the other way around.<br/><br/>The increased ability to organize blocks through different swap-options encourages the player to be more creative and strategic. Players are more able to logically organize to create higher number blocks. From increased player-chosen strategy, achieving a new higher number block and higher score is extremely satisfying in Num One. Meanwhile the player does not realize the personal improvement in logical thinking and familiar with the powers of three.<br/><br/>Please send questions, comments, or problems directly to: numonegame@gmail.com<br/>For problems, please include a screenshot of the issue---thank you very much!</p><p>https://numonegame.wordpress.com/<br/>https://www.facebook.com/numonegame<br/>https://twitter.com/NumOneGame</p>", "metacritic": null, "released": "2018-03-05", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/cd2/cd2b88ff1b736198b46e8ede340281e9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 24, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Mukikaizoku"], "genres": ["Educational", "Puzzle"], "publishers": [], "esrb_rating": null}