{"id": 20651, "slug": "cosmic-dj", "name": "Cosmic DJ", "name_original": "Cosmic DJ", "description": "Cosmic DJ is a quick, \"pick-up and play\" musical experience about the joy of music creation for budding intergalactic musicians of all skill levels. Set among the stars, you will strive to become the legendary Cosmic DJ through six musical adventures as you’re tasked with repairing the all-important “Jamtennas” and bring harmony back to the galaxy. <br/><br/><br/><br/><strong>EXPLORE</strong><br/><br/>Cosmic DJ includes a campaign mode that allows you, \"The Cosmic DJ of Legend,\" to go through six adventures to repair the \"Jamtennas\" and bring musical harmony back to the galaxy! <br/><br/><strong>SEQUENCE YOUR JAM</strong><br/><br/>Create your galactic beats with the intuitive, tap-based controls and the classic grid sequencer inputs with dozens of instruments from keyboards and drums to guitar and voice samples.<br/><br/><strong>CREATE AND SHARE</strong><br/><br/>A legendary DJ should not keep their creations for themselves so share your creations with the world by automatically creating and MP3 from your creations! Even create an album cover artwork with photos, stickers, and drawings to make it your own.<br/><br/><br/><br/><strong>FEATURES</strong><br/><br/><ul><li>Tap/Grid Sequencer - tap out your own beats from a set of funky instruments or align them using the grid sequencer for perfect rhythm.</li></ul><ul><li>.MP3 Conversion - export your musical masterpieces and share with other budding Cosmic DJs.</li></ul><ul><li>Story Mode - repair the Jamtennas and bring the groove back to the galaxy.</li></ul><ul><li>Quick Play - just let the music take over without anything getting in your way.</li></ul>", "metacritic": null, "released": "2014-05-16", "tba": false, "updated": "2019-10-22T14:22:50", "background_image": "https://media.rawg.io/media/screenshots/066/0663ff3545a9eac50c6aa4da06ad6f5d.jpg", "website": "http://www.cosmicdjgame.com/", "rating": 2.78, "rating_top": 3, "added_by_status": {"yet": 11, "owned": 338, "beaten": 11, "toplay": 1, "dropped": 10}, "playtime": 1, "achievements_count": 0, "ratings_count": 17, "suggestions_count": 324, "game_series_count": 0, "reviews_count": 18, "platforms": ["PC", "iOS", "macOS"], "developers": ["Devolver Digital", "Gl33k"], "genres": ["Casual", "Family", "Indie"], "publishers": ["Devolver Digital", "GHI Media"], "esrb_rating": "Everyone 10+"}