{"id": 206696, "slug": "an-awkward-hike-with-dad", "name": "An Awkward Hike with Dad", "name_original": "An Awkward Hike with Dad", "description": "<p><strong>CONTROLS:</strong></p>\n<p>Move – <em>Arrow Keys</em></p>\n<p>Dialog Choices – <em>Number Keys 1-3</em></p>\n<p>------------------------</p>\n<p>Most simply, this game is about a real conversation I had with my dad in the woods one day, recounted to the best of my memory. Some of my favorite memories are of the outdoors - something I grew away from, having been raised in the city. The memory this game was based on, then, sort of highlights a contrast between the supposed serenity of the outdoors (the woods) and the uncomfortable reality (this terribly awkward conversation). I tried to capture this as best I could in the game. The mechanics of the game are simple, and very subtly serve the same goal, I think. Because of the time constraint, I knew I couldn't put together a full dialog tree. So, behind the scenes, the dad's dialog never changes, regardless of what you input. Again, I hope this works to highlight the theme of contrast. Whether it does is... debatable.<br/></p>\n<p>While this project helped me learn a bunch of useful techniques and skills in Unity and otherwise (including waypoint movement, UI tracking an object, etc.), there were many incredibly frustrating setbacks. First it was the dialog system, then the faux-terrain I had to make in Maya, then having to place literally hundreds of objects to make the forest. Worst was working with Substance Painter, and having very strange UV issues come up. Not only did these things slow down my workflow, but they made my game less polished as a result. I didn't even have time to give the game a proper intro or end screen. But I will say, it should be easier to get through similar issues in the future. And the programming ended up being a lot of fun once I worked out the kinks.</p>\n<p>------------------------</p>\n<p>GitHub Repo<br/></p>", "metacritic": null, "released": "2017-07-25", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/d9b/d9baa381cd568246c7eb1426a1f1f040.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 13, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["beckett_m"], "genres": [], "publishers": [], "esrb_rating": null}