{"id": 206618, "slug": "dead-heroes", "name": "Dead Heroes", "name_original": "Dead Heroes", "description": "<p><strong>Dead Heroes\r\n<br/></strong></p>\n\n<p>This is Dead Hero and his friends, your new adventure hero.<br/>Hero escapes flames and flying shurikens and chased by huge cannons.<br/>We are aiming for best free game 2017 or at least best free arcade.<br/>And we believe soon it will be available at top-rated free games!</p>\n<p>Addictive and raging hardcore gameplay<br/>◆ Meet three levels!<br/>◆ New game mode: Dzen!<br/>◆ Multiplayer is coming soon!<br/>◆ Train on single player to improve your skills<br/>◆ Fun guaranteed<br/>◆ One swipe control<br/>◆ Compete with your friends<br/>◆ Play without WiFi</p>\n<p>Amazing features<br/>◆ Journey(Die) through(in) colorful levels: green, snow, volcano, sunset.<br/>◆ Collect over 10 characters: ninja, knight, halloween pumpkin, adventure girl, zombie with his girlfriend and more!</p>\n<p>You love hardcore you’ll love it. To become a master, skills matter (a lot). So, start practicing right now to become a master and rule them all. It will be fun and addicting, we guarantee it!</p>\n<p>◆ Play it anywhere and anytime<br/>Internet connection is NOT necessary, so you can have fun playing in the subway, while flying on a plane, in the car on the road, during services in a temple (or maybe even on the toilet!)</p>\n<p>◆ Low data usage<br/>This free game will not consume tons of data from your mobile plan that you'd want to use instead to surf the web.</p>\n<p>◆ Compatibility and support<br/>We're continuously working (hard) so that all Android phones and tablets run the game smoothly. please report any issue you may experience to amirapps1203@gmail.com.</p>", "metacritic": null, "released": "2017-09-03", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/71e/71ebc2c76ae1eba4a511e575075ead82.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 86, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["ApacheJunction"], "genres": ["Action"], "publishers": [], "esrb_rating": null}