{"id": 20663, "slug": "aveyond-3-1-lord-of-twilight", "name": "Aveyond 3-1: Lord of Twilight", "name_original": "Aveyond 3-1: Lord of Twilight", "description": "Chapter 1 in a four-part series! Journey across a massive world on a quest to thwart a power-crazed lunatic who wants to enslave humanity! Two hundred years ago, a sorcerer attempted to fulfill a dark prophecy that would see him rule the world. He died before his goal was realized, but the prophecy lingered on. Today, another maniac stands determined to succeed where the sorcerer failed and he needs YOU to fulfill his plan. Are you brave/crazy enough to stop this guy?Games that have been released in the series:Aveyond: Lord of Twilight (DOWNLOAD HERE)                                                                    <br/>Aveyond: Gates of Night (DOWNLOAD HERE)                                                                        <br/>Aveyond: The Lost Orb (DOWNLOAD HERE)   <br/>Aveyond: The Darkthrop Prophecy (DOWNLOAD HERE)Features:<ul><li>HUMOR. Lots of it. Humor is the core of Aveyond. You will laugh... or else!<br/></li><li>Massive world filled with loads of monsters, loot, and civilizations. <br/></li><li>Travel with a large party of friends. Pick your leader and your fighters for turn-based battles.<br/></li><li>Seek out special academies to learn skills like climbing so that you can explore new areas.<br/></li><li>Help Edward, one of your party members, find a wife or face the wrath of his mother.<br/></li><li>Give or steal from temples.<br/></li><li>Obtain a magical sword that can have its properties changed by the gem you put in its hilt.<br/></li><li>Run a farm in your spare time and collect creatures. <br/></li><li>Awesome music brought to you by an award-winning musician who has the entire Final Fantasy music library memorized.<br/></li><li>For the lazy: find the secret treasure caves and equip your heroes with mega weapons, gold, and level ups. <br/></li><li>20+ achievements to unlock!</li></ul>", "metacritic": null, "released": "2014-02-07", "tba": false, "updated": "2019-09-17T07:49:58", "background_image": "https://media.rawg.io/media/screenshots/42e/42ea7e56f21f9687e6971138ba6fef36.jpg", "website": "http://www.aveyond.com/", "rating": 1.75, "rating_top": 1, "added_by_status": {"yet": 17, "owned": 347, "toplay": 1, "dropped": 3, "playing": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 8, "suggestions_count": 338, "game_series_count": 0, "reviews_count": 8, "platforms": ["PC"], "developers": ["Amaranth Games"], "genres": ["Adventure", "RPG", "Casual", "Indie"], "publishers": ["Degica"], "esrb_rating": null}