{"id": 20697, "slug": "death-tractor", "name": "Death Tractor", "name_original": "Death Tractor", "description": "You are a member of the Nomsanto family. The luck of these average, run of the mill GMO corn farmers goes sour when their loyal tractors get fed up with the modifications the family is making to their corn. They transform into horrendous, murderous death machines hellbent on wiping out the Nomsantos and returning the crops to their pristine state. However, the darkness has also changed the Nomsantos. They've been consumed by their capitalist greed and will stop at nothing to harvest as much profit as they can, even if that means murdering their other family members. How much corn will YOU harvest before your eventual death by tractor? Don't let your family, or the tractors, stop you from becoming the ultimate capitalist in DEATH TRACTOR! <br/>\n<br/>\r\nThis totally serious, 100% accurate to life corn harvesting simulation experience will get your adrenaline pumping and nerves excited. You'll never be able to farm for corn in the same light again! <br/>\n<br/>\r\nFeatures include: <br/>\r\n-4 player online multiplayer or offline solo play<br/>\r\n-Multiple levels <br/>\r\n-Accurate corn harvesting physics and real-time growth patterns <br/>\r\n-Tractors so frightening you will dream of nothing but them bearing down over your soul. <br/>\r\n-Gameplay so easy to learn even your Grandma could do it. Until she has a heart attack from the TERRIFYING DEATH TRACTORS.", "metacritic": null, "released": "2015-10-29", "tba": false, "updated": "2019-08-28T22:08:29", "background_image": "https://media.rawg.io/media/screenshots/b45/b45df2337d4f151ad2295977dda81223.jpg", "website": "http://www.deathtractor.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 46}, "playtime": 5, "achievements_count": 16, "ratings_count": 0, "suggestions_count": 307, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Exato Game Studios"], "genres": ["Action", "Simulation", "Casual", "Indie"], "publishers": ["Exato Game Studios"], "esrb_rating": null}