{"id": 20695, "slug": "crayon-chronicles", "name": "Crayon Chronicles", "name_original": "Crayon Chronicles", "description": "Crayon Chronicles offers a relatively short (2-4 hours per play-through) but action-packed RPG experience that randomly generates the level layouts each time you play.<br/><br/>You are encouraged to play through the game more than once thanks to the random nature of the environment layouts, but also because we keep track of the interesting facts about each play-through (in our newfangled \"Heroic Hallitorium\") so you can compare your adventures to each other as well as to the adventures of your friends.<br/><br/>As the story goes, your friends have been kidnapped (tragic, I know), but as it so happens, you are brave enough to attempt their rescue. With help from a \"stranger\" you are soon set on the path to their salvation from the despicable Lord of the Swampyards, Stratolustrious Von Danderbeak the 37th (or Strato for short, his name is a mouth-full). If you succeed in rescuing your friends and bringing down the Swampyard Tyrant, then glory, satisfaction, and maybe a nap await you.<br/><br/><strong>Crayon Chronicles offers:</strong><br/><ul><li>50+ enemy creatures<br/></li><li>200+ items and gear to find<br/></li><li>13 different environments to explore<br/></li><li>Saving and continuing (if you stay alive)</li></ul><br/><strong>Your character will be able to carry:</strong><br/><ul><li>A helmet<br/></li><li>Armor<br/></li><li>A main weapon<br/></li><li>An off-hand weapon (unused when you have a two-handed weapon equipped)<br/></li><li>A ranged weapon (recharges shots as you use melee attacks)<br/></li><li>A skill power (recharges as you defeat enemies)<br/></li><li>4 consumable item slots</li></ul>The helmet, armor, main weapon, and off-hand weapon will all visually update on your character's avatar in-game.", "metacritic": null, "released": "2015-03-02", "tba": false, "updated": "2019-09-17T12:27:14", "background_image": "https://media.rawg.io/media/screenshots/9bf/9bffe580bab22fc6265d59d73842111c.jpg", "website": "http://www.crayonchronicles.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 107, "toplay": 1, "dropped": 2}, "playtime": 2, "achievements_count": 42, "ratings_count": 2, "suggestions_count": 230, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Outer Grid Games"], "genres": ["RPG", "Casual", "Indie"], "publishers": ["Outer Grid Games"], "esrb_rating": null}