{"id": 20713, "slug": "rothschild-the-sheep-will-wake", "name": "Rothschild: The Sheep Will Wake", "name_original": "Rothschild: The Sheep Will Wake", "description": "Rothschild: The Sheep will Wake is a procedurally generated first person horror game in which the Rothschild family dominates the world. The player fills the shoes of Jordan Baker, a journalist sent to investigate the hospitalization of Kane Rothschild. Little did he know, this rabbit hole just doesn't end.<br/><br/>Overall Rothschild is 6 chapters long, each being released separately; <strong>but all being apart of the same game. </strong> Once you've purchased ANY chapter you're also purchasing the rest of the chapters. We can't stress that enough, ONE purchase defines purchasing the complete game. Chapter Zero is the very first chapter, acting as a prologue to the main story and our launch for EA. <br/><br/><strong>Features: </strong><br/><br/><strong>Dynamic Horror System:</strong> Don't think you can ask your friends for help! Our D.H.S allows us to randomize each user experience a bit. Anything from clues, to AI, to even side missions and Easter eggs will be procedural.<br/><br/><strong>Non-Linear Story:</strong> With Rothschild there's more than meets the eye, especially when it comes to the story. Each play-through is tailored to how you play and what you, the user decided to do. Act accordingly, with some decisions there's no turning back!<br/><br/><strong>Shhh!!:</strong> Plug up your Mic but remain quiet! In Rothschild, the walls have ears and they will hear you. Although this feature is still being perfected we're very excited to announce it! The evils that lurk about RTSWW are very much attracted to your wimpy calls for help, can you keep quite?<br/><br/><strong>Fight or Flight System:</strong> Develop and hone your skills in Rothschild to help you survive, but what perks will you attain? Will you be a sly, stealthy, trap setting investigative journalist with a keen sense of awareness? Or are you more the type to run and hide in the closest small, dark space you can find?", "metacritic": null, "released": "2015-11-23", "tba": false, "updated": "2019-08-28T22:08:28", "background_image": "https://media.rawg.io/media/screenshots/1cb/1cbd792bc59dce311b83bc2238d0c2a5.jpg", "website": "http://rothschildthegame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 5}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 372, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Loudpak Studios"], "genres": ["Adventure", "Indie"], "publishers": ["Loudpak Studios"], "esrb_rating": null}