{"id": 207207, "slug": "baristasim", "name": "BaristaSim", "name_original": "BaristaSim", "description": "<p>A/D/arrow buttons - switch workspaces <br/>I made this game for a hackathon with my friend Tyler.</p>\n<p>Drag ingredients into the cup to make a coffee. <br/><br/>RULES <br/><br/>Every non-blended drink needs either a normal (dark) or decaf (light) coffee from one of the two coffee pots. <br/><br/>If the drink isn't iced or blended, the milks need to be added to the cup first and then warmed using the steamer attached to the espresso machine. <br/><br/>Steam levels are:<br/>no steam<br/>hot<br/>a little foam<br/>a lot of foam</p>\n<p>Increase steaming levels by pressing the button repeatedly.<br/><br/>A blended drink needs these ingredients, in this order:<br/>blended drink mix<br/>milks<br/>ice</p>\n<p>Then blend the drink in the blender and drag it to the cup.<br/><br/>Syrups need to be added to the cup last. <br/><br/>To add an espresso shot, the filters need to be unlocked from the espresso (turned left) and locked into the espresso grinder, where you'll need to grind the beans and then drag the handle down to tamp the grounds into the filter. Then lock the filter back into the machine and press the button. <br/><br/>Every drink needs a top. Hot drinks need a top and a cup wrapper thing, I forget what they're called.<br/><br/>If you mess up a drink, you can always throw it in the trash.</p>\n<p><strong>BUGS</strong></p>\n<ul><li>the chai syrup is green because I didn't know what chai was when I made this game</li><li>if you get an impossible order, reload the page</li></ul>", "metacritic": null, "released": "2018-08-01", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/994/994f467fb9a5c82be395a9c9926ffed3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 16, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["dr-slunch"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}