{"id": 207305, "slug": "habitabat-ad-mortem-the-screensaver", "name": "Habitabat Ad Mortem - The Screensaver", "name_original": "Habitabat Ad Mortem - The Screensaver", "description": "<p><strong>Working, watching TV, sleeping; working, watching TV, sleeping, ...</strong></p>\n<p>If your life is a pattern, things will start to drift more quickly, continually accelerating and you won't notice how life is passing you.  There isn't an end of level display, any extra lives or a chance to start again.  Sometimes we need a wake up call, the change in the pattern to allow us to look around and start to realise that if we don't take any actions to alter our patterns then it will be over before you know it with no chance to go back.</p>\n<p><em>Habitabat Ad Mortem</em> is now a screen saver, allowing you to watch a depiction of a how easily a life can go unlived unless actions are taken to inspire change and reset the acceleration of day-to-day life.  The character will make choices that affect health, career and the speed at which life will pass by.</p>\n<p>Each time the screen saver starts, it will continue from where it left off and the window into the characters life will shift and scale as a screen saver should to ensure that your screen will not be affected by screen burn should you be using a CRT.</p>\n<p>It will show how the mortgage keeps adding up while the character is sleeping, the affect of interest rates and interest only loans, showing how much the character will end up paying back or leaving behind as debt.  How an unhealthy diet and lack of exercise can affect blood sugar and the affect of aspirations for promotion and new jobs on blood pressure.  The character will be affected by age and previous jobs and promotions as career opportunities are sought or left behind.</p>\n<p>The game depicts a life where the number of days you have left is known; how would you live yours?</p>", "metacritic": null, "released": "2018-06-03", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/323/323db0de1bf44ebe9b2cb6c709bd091e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 58, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Coo Chew Games"], "genres": [], "publishers": [], "esrb_rating": null}