{"id": 20731, "slug": "extreme-roads-usa", "name": "Extreme Roads USA", "name_original": "Extreme Roads USA", "description": "Off you go! Get ready for trucking challenges that will keep you on the edge of your seat as you hitch up and haul your way across the ‘extreme roads’ of this massive map and unforgiving terrain. Accept your assignments, select your trucks, and transport all sorts of goods along the toughest routes on their matching trailers.<br/><br/>Earned cash can be spent on new trucks and their tuning – the investment will be worthwhile. Proceed to modify your truck visually (including logos and license plates). The customization can be extended with your own pictures for door logos, license and window plates. Same goes for the in game radio – enjoy a country music soundtrack or your very own playlist.<br/><br/>Manhandle menacing road passages and cross demanding country sides and hill ranges. Each truck and every trailer offers unique function and handling designed to boost your driving skills. Progress and collect all the achievements. Test your nerves, put it all on the line, and determine if you have what it takes to become ‘king of the road’.Features<ul><li>5 trucks with different driving qualities<br/></li><li>5 trailers with different driving qualities<br/></li><li>Bold and thrilling vehicle physics<br/></li><li>Huge, diversified landscape with real ‘extreme roads’<br/></li><li>Tuning with wide influence on the vehicle physics<br/></li><li>Extensive truck design (including logos and license plates) for your individual style<br/></li><li>Expand on door logos, license and window plates with your own pictures<br/></li><li>Dynamic weather with atmospheric day / night cycles<br/></li><li>In game radio, capable of playing your own audio files<br/></li><li>Full controller support for cruising on your couch</li></ul>", "metacritic": null, "released": "2014-06-06", "tba": false, "updated": "2019-08-28T22:08:28", "background_image": "https://media.rawg.io/media/screenshots/017/0179c9ba06b7eadc3539e596beca8a8f.jpg", "website": "http://www.uieg.de/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 56, "dropped": 2}, "playtime": 1, "achievements_count": 45, "ratings_count": 0, "suggestions_count": 390, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["United Independent Entertainment"], "genres": ["Simulation"], "publishers": ["United Independent Entertainment"], "esrb_rating": null}