{"id": 20745, "slug": "the-entente-gold", "name": "The Entente Gold", "name_original": "The Entente Gold", "description": "On June 28, 1914 in the center of Saraevo Gavrilo Princip shot Archduke Franz Ferdinand and his wife. Those shots began one of the bloodiest wars in the history of mankind the First World War. For four long years the earth trembled from gun explosions, the air was whistling with bullets and the sky was covered with smoke and ashes. It was the first war with such amount of troops to take part in it and with military operations going on earth, in the skies and seas, even under the water. Weapons of mass destruction were used for the first time.<br/>The Entente WWI Battlefields gives a chance to see it with your own eyes and try to change the history. Choosing one of five available countries of this real time strategy game (France, Germany, Russia, Austro-Hungary, England) players get under command troops with various units starting from infantry and cavalry and ending with battleships. All units were made true from historical point of view by using archive documents and photos. Every nation has its own features, which allow you to use strengths and weaknesses of troops from different states.<br/><br/>Economic and military advisors are present in the game to facilitate control over economic and military development. Advisors assist in upgrades, obtaining resources and producing units. There are more than 1000 structures on the map and 80000 units, 3D sound and full encyclopedia of armament that give a chance to feel like high military commander entrusted with the fate of the nations.<br/><br/>•\tOne of the first games based on actual events of the WW I<br/>•\tMassive battles (up to 10,000 units can take part in a battle from each side!)<br/>•\tNon-linear mission structure and authentic historical battles<br/>•\tVarious types weaponry, armor, vehicles, buildings from that period, which are unique for each nation<br/>•\tEntente Gold includes two new campaigns with 7 missions each, map and missions editor.", "metacritic": null, "released": "2014-06-16", "tba": false, "updated": "2019-09-17T07:22:44", "background_image": "https://media.rawg.io/media/screenshots/167/1677e6277ef65544847f858381043ddd.jpg", "website": "", "rating": 2.08, "rating_top": 1, "added_by_status": {"yet": 5, "owned": 339, "toplay": 2, "dropped": 3}, "playtime": 3, "achievements_count": 0, "ratings_count": 12, "suggestions_count": 492, "game_series_count": 0, "reviews_count": 12, "platforms": ["PC"], "developers": ["Lesta Studio"], "genres": ["Strategy"], "publishers": ["Buka Entertainment"], "esrb_rating": null}