{"id": 207577, "slug": "santa-claus-soda-racing-game-christmas-adventure", "name": "Santa Claus & Soda Racing game Christmas adventure", "name_original": "Santa Claus & Soda Racing game Christmas adventure", "description": "<p>A fun and dynamic game that is not so simple as it seems at first glance. We hope that it will support and prolong the New Year mood of the players.<br/></p>\n\n<p><strong>Flight</strong> on a sleigh with <strong>Santa Claus</strong>! A completely new principle of Santa's sleigh motion discovered! It is based on directed eruptions of soda water under pressure which gives an impulse to flight. But the sledge is not yet perfect. And so, the mission is becoming even more difficult. Thus, you need not only piloting skill, but you also have to develop your equipment.</p>\n<ul><li><strong> A structure of bonuses, achievements and upgrades </strong></li></ul>\n<ul><li> <strong>Garage and shop</strong> where you can create your own unique sled with special features. Collect the unique set of the boat, the sledges of Leonardo da Vinci himself, the plane and many others.</li><li><strong>The system of achievements</strong>, keeps statistics of success and rewards crystals that can be spent for bonuses for passing difficult levels or for a new equipment of sledges.</li><li><strong>This game requires minimal hand movements </strong></li><li><strong>Dynamic environment </strong></li><li><strong>The </strong><strong>online high score table</strong> gives you the opportunity to share your success with your friends and compete against Santa Clauses around the world.</li><li><strong>Wave complexity of the levels</strong>, so you can rest a little after particularly difficult.</li></ul>\n<p><strong>9 different stages: </strong></p>\n<ol><li><strong>Far Land </strong>–  Reach destination</li><li><strong>I will give you a star!</strong> – Grab the right number of stars </li><li><strong>Do not scratch the sledge </strong>–  Go through the distance without grabbing the sledge on the crystals. Take an ice ax for help. </li><li><strong>Time is money </strong> – Travel a distance in a certain time. Grab alarm clocks to increase the rest of time. </li><li><strong>Crush with axe </strong>–  Feel yourself a Viking. Break a certain number of ice-crystals with an axe. </li><li><strong>Jump to the moon</strong> - get to the moon jumping over the clouds.</li><li><strong>Collect gifts</strong> - collect gifts in the sea. Huge icebergs, ice floes and deep cold sea.</li><li><strong>\"Sleigh Race\"</strong>  - to win in the Olympic soda races. Pump it up and improve on new sleds to be the first.</li><li><strong>\"Catch up the thief\" </strong> - Baba Yaga stole gifts! Catch up and fall asleep with snowballs.</li></ol>\n<p>Happy Christmas, happy new year, wonderful mood and every success!</p>", "metacritic": null, "released": "2018-01-13", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/d2f/d2f8309b36695188a5a821bff318888f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 205, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["TapaJampaGames"], "genres": ["Racing", "Platformer"], "publishers": [], "esrb_rating": null}