{"id": 20758, "slug": "starchaser-priestess-of-the-night-sky", "name": "Starchaser: Priestess of the Night Sky", "name_original": "Starchaser: Priestess of the Night Sky", "description": "Tonight is the Rite of Starchasing, a ceremony handed down in the village. Kineto was chosen as the priestess by pure coincidence. She is dressed in the priestess's clothing, and at the end of the ceremony, she recites the names of the stars. That was supposed to be all she needed to do. When she looked up, though, her groggy eyes saw a pitch black sky. The stars she was supposed to be naming were nowhere in sight.<br/><br/>\"...Where am I? Are these...giant dice?\"<br/><br/>Kineto came back to her senses and found herself in the middle of a giant labyrinth.Welcome to Starchaser<br/><br/>Priestess of the Night Sky is a 3D action game with gravity in every direction, where you have to jump, leap, shoot, and dodge traps littered about the maze. A wall might be your floor a moment later in this \"Omnidirectional Gravity Space.\"<br/><br/>There is no concept of up or down in Starchaser: Priestess of the Nightsky. If you get close to a Gravity Floor , you can stand on any surface, and seemingly impossible routes become traversable if you switch the direction of gravity.<br/><br/>In The Starchasing Priestess, you will come up against enemies that block your way, such as the labyrinth's residents and lords, but the concept of using gravity to your advantage is even more important.<br/><br/>Take a good look at your surroundings. The path will reveal itself to you--all you must do is think.", "metacritic": null, "released": "2015-07-24", "tba": false, "updated": "2019-08-28T22:08:27", "background_image": "https://media.rawg.io/media/screenshots/b66/b6640aa678830d365d2fef08e89f8fb2.jpg", "website": "http://n-linear.org/hoshimiko", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 23, "toplay": 2}, "playtime": 6, "achievements_count": 16, "ratings_count": 0, "suggestions_count": 434, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Nonlinear"], "genres": ["Action", "Indie"], "publishers": ["AGM PLAYISM"], "esrb_rating": null}