{"id": 207536, "slug": "xorsblock", "name": "XORSBLOCK", "name_original": "XORSBLOCK", "description": "XORSBLO<strong>CK</strong>\n<strong>Inspiration</strong>\n<p><strong>Block Breaker is a simple 2D game that's made with Unity 4.6. It's my first game done with Unity, so it's a very meaningful experience! I am very interested in making games starting in high school, and has made a badminton game in my junior year; however, I stopped making games for about two years. With my classmate Aaron's inspiration, I found my interest in programming games back, and wish to make more amazing 2D and 3D games in the future within my free time! This game is introduced within a Unity 2D course taught by Ben Tristan; the instructor provides a structured tutorial of this game, but most of the details and graphic designs are made by me! </strong></p>\n<strong>What it does</strong>\n<p><strong>It's a simple Block Breaker game. The player needs to smash all the blocks to win the game! There're many different kinds of blocks with different colors; each color represents a specific number of hits. The player needs to move the paddle with the mouse and makes sure that the ball doesn't fall under the paddle. Each level gives player three lives; if the ball falls under three times, then the player lost. If the player passes through all five levels, he/she wins the game.</strong></p>\n<strong>How I built it</strong>\n<p><strong>It's built with Unity 4.6 and CSharp. </strong></p>\n<strong>Challenges I ran into</strong>\n<p><strong>Since it's the recently first game that I made, I run into many difficulties. I am not totally into the structure of Unity this game engine, and also I need to get used to the language of CSharp. </strong></p>\n<strong>Accomplishments that I'm proud of</strong>\n<p><strong>Very accomplished; learn and do many artistic works lol... I designed sprite sheets for my blocks for example.</strong></p>\n<strong>What I learned</strong>\n<p><strong>I learn to use a new image editor called GIMP 2. I know how to adjust fonts for my text within Start Menu and Rules page... I know how to insert music and background image into my game. I also learn a lot of physics such as collisions and colliders related concepts (eg. there're many different kinds of colliders as static colliders, rigidBody colliders, and kinematic colliders) And also most importantly, the concept prefab (collection of gameObjects)...</strong></p>", "metacritic": null, "released": "2018-07-01", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/cf9/cf9c9e98c6430e641c0eb85bcbf3ac0a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 57, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Ray Liu"], "genres": ["Action"], "publishers": [], "esrb_rating": null}