{"id": 20760, "slug": "final-fantasy-xiii", "name": "FINAL FANTASY XIII", "name_original": "FINAL FANTASY XIII", "description": "<p>FINAL FANTASY XIII is an action RPG with fast-paced combat, set in a science fictional world of the future. It&#39;s ruled by the Sanctum, a theocratic government, and a mechanical creature fal&#39;Cie that has the power to make people its servants. You play as Lightning, a former soldier, who needs to save her sister Serah, who was marked by fal&#39;Cie. She joins the resistance; however, they get marked by the creature too and have to fulfill its task to avoid death. <br />\nThe key feature of the game is its complicated combat and development system. Three characters can take part in a battle, while you control only one of them. To fight you need to choose actions that will be used but their amount is limited with Active Time Battle bar. There’s also the Paradigm system that allows giving the characters certain roles to perform in the battle making it more effective.<br />\nThe development tree in the game is called the Crystarium. It consists of ten levels to upgrade your stats, such as health, strength, magic and so on. Crystarium Points to progress are given for killing enemies.</p>", "metacritic": 77, "released": "2009-12-17", "tba": false, "updated": "2024-04-15T13:08:11", "background_image": "https://media.rawg.io/media/games/943/9432de383089b0a427a3cdf3687b2b73.jpg", "website": "http://www.square-enix.com/", "rating": 3.47, "rating_top": 4, "added_by_status": {"yet": 186, "owned": 2741, "beaten": 492, "toplay": 114, "dropped": 276, "playing": 39}, "playtime": 7, "achievements_count": 81, "ratings_count": 662, "suggestions_count": 581, "game_series_count": 27, "reviews_count": 665, "platforms": ["Xbox One", "Xbox 360", "PlayStation 3", "PC"], "developers": ["Square Enix", "ブロードメディアGC株式会社"], "genres": ["RPG"], "publishers": ["Square Enix"], "esrb_rating": null}