{"id": 207661, "slug": "caino-weeper", "name": "Ca$ino $weeper", "name_original": "Ca$ino $weeper", "description": "<p>Casino Sweeper is a casual logic/puzzle game, a spin-off of Minesweeper. Instead of scouring a board for bombs, players use their logic skills to reveal and win money, bonuses and other goodies, while avoiding money-draining traps. Score enough money and you can cash out, or press your luck and try to keep racking up more dough! (Of course, it's not real money, sorry to disappoint anyone!)</p>\n<p>This concept is still very much in development, right now we want feedback.</p>\n<p><strong>How to Play<br/></strong></p>\n<ul><li>Instead of searching for bombs, as in Minesweeper, you are clicking on tiles to find <strong>winning and losing tiles</strong>.  Winning tiles earn you money, while losing tiles cost you money.</li><li><strong>Click or tap on a tile to reveal the tile contents</strong>.  Tiles may be blank, contain two numbers, or have a winning/losing value.</li><li><strong>Some tiles have 2 numbers on them<em>.  </em></strong>The first green positive number means that there are that amount of winning tiles touching the tile you've clicked on.  The second, red negative number means that number of losing tiles are adjacent to the tile you've clicked.  Adjacent means any tiles that touch the one you've clicked, including diagonals.</li><li><strong>The objective is to click on enough winning tiles to earn the target amount of money to cash out.  </strong>Once you've won enough money, the \"Cash Out\" button will become active, and you can cash out at any time.  You can also continue playing the board if you want, but beware, because if you fall below the target amount, the \"Cash Out\" button will deactivate again.</li><li><strong>To mark tiles as negative, positive, or unsure, right-click the tile, or hit the \"Flag\" button and click the tile.</strong>  You can cycle through the different flags, including no flag, by clicking on the tile again while the \"Flag\" button is active, or right-clicking, just as in regular Minesweeper.  Flagged tiles will not be revealed when you click on them, so flag those losing tiles to keep you from accidentally clicking on them!</li></ul>", "metacritic": null, "released": "2017-09-09", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/e14/e14e3e860db2e7c8a15aaa5d8d3ebcc9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 8, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Android", "Web"], "developers": ["cloudyheavengames"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}