{"id": 20762, "slug": "wyv-and-keep-the-temple-of-the-lost-idol", "name": "Wyv and Keep: The Temple of the Lost Idol", "name_original": "Wyv and Keep: The Temple of the Lost Idol", "description": "Take control of two rookie treasure hunters as they adventure into an ancient Amazonian temple! Use teamwork to advance through 6 fiendishly difficult puzzle worlds - from a cannibalistic pygmy village to an active volcano. Dodge poisonous darts, venomous snakes, and deadly spike traps and use dynamite to blast through crumbling walls and floors. Discover hordes of hidden treasure, challenging secret levels, and even a mythical pygmy hat salesman.<br/><br/>Wyv and Keep is a game of action and puzzle-solving, where up to two players guide the treasure hunters through a gauntlet of confounding puzzles in search of the legendary lost idol. The game is presented in a style that would feel right at home on the 16-bit consoles of old, with beautiful pixel art, a catchy soundtrack, and finely tuned platforming gameplay.<strong>Featuring</strong><ul><li>Fully Co-operative - Innovative dual-character gameplay enables both characters to be controlled by either one or two players.<br/></li><li>Online Enabled - Play the entire game through with a partner from halfway around the world.<br/></li><li>Challenging Gameplay - Over 60 exciting levels, spanning around 20 hours of brain-teasing gameplay.<br/></li><li>Hidden Secrets - Collect hoards of hidden treasure, discover challenging bonus levels, and unlock all six different endings.<br/></li><li>Stunning Pixel Art - Lovingly handcrafted characters and environments.<br/></li><li>Fantastic Music - Featuring a full 20-track OST by accomplished musician Luke Thomas.<br/></li><li>High Fashion - Discover the secret in-game pygmy shop, and collect a wide assortment of stylish hats.<br/></li><li>Cupcakes - They're a girl's favorite!</li></ul><br/><br/><br/><strong>\"Intense puzzles... Stellar level design.\"</strong> - Co-Optimus<br/><strong>\"I felt like the cleverest man in all the world when I beat a level.\"</strong> - Rock, Paper, Shotgun<strong>Developer Notes:</strong>Thank you for playing! Please let us know of any issues or give suggestions for what you'd like to see next! :)<br/><br/><br/>", "metacritic": null, "released": "2014-08-08", "tba": false, "updated": "2022-09-29T23:24:07", "background_image": "https://media.rawg.io/media/screenshots/341/34136f7f29c1702682e4705d1024998f.jpg", "website": "http://www.wyvandkeep.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 141, "beaten": 2, "toplay": 1, "dropped": 1}, "playtime": 4, "achievements_count": 0, "ratings_count": 3, "suggestions_count": 238, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC", "Linux", "macOS"], "developers": ["A Jolly Corpse"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["A Jolly Corpse"], "esrb_rating": null}