{"id": 207657, "slug": "seer", "name": "Seer", "name_original": "Seer", "description": "<p>Seer - a turn based strategy game. </p>\n<p>Features include nine unit types, each with special abilities like Archers, Cavalry, Pikemen, and of course your spell casting Hero, the Seer.</p>\n<p>A magical Hero and his loyal army defend the homeland against the endless undead hordes!<br/></p>\n<p>Can you lead your army to victory? Can you rally your weary troops to defend your nations villages, people and holy shrines?</p>\n<p>Will your magical power tip the balance and win the day?</p>\n<p>Protect your villages and shrines from the undead who are swarming in from all sides of the hexagonal map. Use the unique skills of your different unit types to defeat the invaders.</p>\n\n<p>Installation:</p>\n<p>Just create a folder and copy the file \"Seer_Demo.exe\" or \"Seer.exe\" into that folder</p>\n<p>Run the executable </p>\n<p>Gameplay:</p>\n<p>Left click on a unit to select a unit<br/>Left Click map the to Move to a hex<br/>Right click on enemy unit to attack</p>\n<p>Moving adjacent to an enemy unit ends your turn<br/>Human units ending their turn in a village or city heal 1-4 hp damage<br/>Demonic Inf restore 4 hp in shrine<br/>Hero recovers 1Mp or 2mp if in a shrine hex Plus 1MP for each active shrine up to Max Mana Level<br/>Workers that end their turn in a damaged billage or city hex repair some damage.</p>\n<p>After killing ten units (10 Exp) units can 'level up' and gain hit points, range, movement or attack bonuses!</p>\n<p>Spells damage buildings!</p>\n<p>Victory Points:<br/>1 per damage done<br/>6 per village per turn<br/>12 per city per turn<br/>10 per shrine per turn</p>\n<p>MP Regen:<br/>+1 per turn<br/>+1 per at start of turn if in working shrine hex<br/>+1 per surviving shrine</p>\n<p>Gold Production:</p>\n<p>+2 per surviving village<br/>+5 for city<br/>+5 per worker unit<br/>+5 per worker on a fields hex<br/>+10 per worker on a mine hex</p>", "metacritic": null, "released": "2018-04-28", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/d10/d10ac456a30dd9d64979eef562091ccb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 43, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["RatbyteBoss"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}