{"id": 207667, "slug": "worldcup-sokerban", "name": "WorldCup Sokerban", "name_original": "WorldCup Sokerban", "description": "<p>WorldCupSokerban is a soccer-themed, 3D sokoban puzzle game. It now runs on Windows too!<br/></p>\n<p>It has undo (u) and restart (r) functions. Comes with many puzzle files, each typically having dozens of \"levels\". The next (n) and previous (p) keys move between levels. The (Lshft) and (Rshft) keys move between the different puzzle files (there are currently 60). The (z) key creates a setpoint (reZero) so that subsequent restarts restore that setpoint.  And now there is an <strong>embedded AutoSolver</strong> to step towards a solution when you get stuck.</p>\n<p>To move the \"pusher\" use the WASD or arrow keys. The objective is to kick all the red and blue balls into the goal nets. Notice that these strange soccer balls roll in two perpendicular directions only!</p>\n<p>And now the mouse can be used to control the game viewpoint. The mouse wheel adjusts the eye distance; a left button drag changes view angle; a right button click restores the default view settings. MacBooks can simulate these actions, as noted below.</p>\n<p>Works on Windows, Macs running OS-X and PCs running GNU/Linux.</p>\n<p>## Features:<br/> * laptop friendly;<br/> * user definable puzzles;<br/> * many predefined puzzles ranging from easy to impossible;<br/> * Windows, GNU/linux and OSX binaries;<br/> * full source code;<br/> * supports high DPI mode on OS-X Retina displays;</p>\n<p>* Andres Cantor sound effects.<br/></p>\n<p>The arrow keys control movements and the keyboard controls for view are:<br/>* (c) closer<br/>* (f) further<br/>* (0) defaults<br/>* (/) tilt up<br/>* (\\\\) tilt down</p>\n<p>* (=) tryAutoSolver<br/></p>", "metacritic": null, "released": "2016-03-21", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/2db/2dbb4f0fe60f9ba77f7b46d0658e4959.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 61, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["fastrgv"], "genres": ["Sports", "Puzzle"], "publishers": [], "esrb_rating": null}