{"id": 207756, "slug": "shoplifter", "name": "Shoplifter", "name_original": "Shoplifter", "description": "<p>This is a game that I actually made for my English Project when I was in Grade 9. My topic was Shoplifter. I though maybe I should make a game based off my topic, so I did! Everyone was impressed especially for someone who had recently started game-dev! Anyway I decided to make a complete remake with Godot 3.0, used piskel for artwork. Music was by Rolemusic, http://freemusicarchive.org/music/Rolemusic/.</p>\n<p><strong>Gameplay<br/></strong></p>\n<ul><li>Player 1 is the shoplifter stealing whatever he can reach, although it's not your typical \"grab and go and nothing happens\" special effects occur as you steal different items.\n<ul><li>Banana has a 20% chance of making you faster</li><li>Cheese has a 20% chance of making you slower</li><li>Cigarette has a 20% chance of making you \"high\" (for now, its just extremely slow speed)</li><li>Gun, shooting feature is implemented, but it's \"not\" really mapped to a button as it's extremely buggy right now</li><li>The effects don't end on new game! you need to reload the browser!</li><li>When Player 1 has at least a score of 12, he can leave the shop to win!</li></ul></li></ul>\n<ul><li>Player 2 is the shopkeeper, trying to catch player 1</li></ul>\n<p><strong>System Requirements</strong></p>\n<ul><li>You need OpenGL ES 3 or WebGL 2 to run this game<ul><li>If your browser is not compatible, try the new versions of Chrome or Firefox</li><li>If your browser is compatible but your computer isn't, try running you browser with software rendering</li></ul></li></ul>", "metacritic": null, "released": "2018-04-23", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/950/950ba953d844f3c1a35c213ae415e639.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 9, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["DSGuy"], "genres": [], "publishers": [], "esrb_rating": null}