{"id": 20782, "slug": "zombierun", "name": "ZombieRun", "name_original": "ZombieRun", "description": "ZombieRun is a retro platformer with the aim to bring sexy back to local multiplayer gaming. It's you, your friends and guns against all the living dead roaming around. If that's not enough there are also apples, carrots and superpowers in play.StoryAfter a massive apocalyptic thunderstorm you find yourself in the middle of a forest graveyard with two zombies drooling over you. It seems that the thunder wasn’t the only thing that hit the world while you were out. It’s time to act fast, stay alive and get to the city for some answers. This is where it all begins it's you your fast reflexes and guns agains all the dead running around.FeaturesThe game features classical weapons, gang of living dead and superpowers. Yes, you have SUPERPOWERS. So get your cape on and start saving the world. ZombieRun has addictive single player mode and awesome local multiplayer games. Up to 4 players can play at the same time in either single screen co-op mode, where you have to work together as one or split screen competitive mode, where everyone's racing to the finish. And also there's the Battle mode where players can blast at each other with what they've got.<br/><br/>ZombieRun has controller support so dust of the old joypads and get cracking.Game modesSo we’ve got intense solo mode where there’s only you against the world. Then we have co-op mode where up to 4 players can tackle the enemies as one team. And no we don’t leave anyone behind. Then there’s also the competitive mode that allows also up to 4 players to compete in split screen. Competitive mode is like a race to the finish. The one who’s first wins. Is it all already. No it’s not. I left my favorite to last. It’s the battle mode. This is straight up shoot everything that moves game mode. You go head to head with other players and only one can come out of the game as the winner. There are no limits in battle mode, everything is allowed, we actually encourage some elbow action when it seems that you might be losing.", "metacritic": null, "released": "2015-06-03", "tba": false, "updated": "2019-08-28T22:08:26", "background_image": "https://media.rawg.io/media/screenshots/b9e/b9e2db7ff34eed2b51b2cb25ef90e7bf.jpg", "website": "http://zombierun.eu", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 80, "dropped": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 3, "suggestions_count": 126, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC", "macOS"], "developers": ["Guerrilla Bandit"], "genres": ["Action", "Indie"], "publishers": ["Guerrilla Bandit"], "esrb_rating": null}