{"id": 2080, "slug": "teenage-mutant-ninja-turtles-rooftop-run", "name": "Teenage Mutant Ninja Turtles: Rooftop Run", "name_original": "Teenage Mutant Ninja Turtles: Rooftop Run", "description": "#1 App in 80 countries! You can play as Leo, Donnie, Raph, Mikey, or unlockable characters April and Casey Jones in this action packed combat runner with vehicle mode! Run, jump, fight and drive through New York’s endless cityscape as you rid it from the Foot Clan, Kraang, Dimension X and Baxter Stockman.<br/><br/>Collect energy orbs to unlock exclusive weapons, gear, and boosts that will keep you one step ahead of the Kraang ship. One-touch controls combine with ninja moves and shell shocking battles for an epic gaming experience. BOOYAKASHA!\u2028\u2028<br/><br/>FEATURES<br/>*NEW! Stomp the Foot with the all new hockey mask wearing, butt-kicking vigilante, Casey Jones<br/>*NEW! Shake off enemies while driving Casey’s motorcycle, the Chopper<br/>*Drive the Shellraiser through the streets of New York during vehicle mode<br/>*Jump ramps, crush obstacles and tap to shoot the garbage cannon at oncoming enemies<br/>*Battle hordes of baddies including the Foot Clan, Kraang, Dimension X and Baxter Stockman<br/>*Activate Turtle Time to fight up close in a slow-motion combat sequence <br/>*Outfit the Turtles in exclusive Cyber and Stealth gear<br/>*Upgrade with weapons, gadgets, and boosts like the Laserbot and Turtle Saver<br/>*Unlock and play as the Turtles’ formidable canine foe Dogpound<br/>*Earn rewards from the pizza time mini-game<br/>* Test your skills with new in-game challenges<br/><br/><br/>TEENAGE MUTANT NINJA TURTLES: Rooftop Run collects personal user data as well as non-personal user data (including aggregated data). User data collection is in accordance with applicable law, such as COPPA. User data may be used, for example, to respond to user requests; enable users to take advantage of certain features and services; personalize content and advertising; and manage and improve Nickelodeon's services. For more information regarding Nickelodeon’s use of personal user data, please visit the Nickelodeon Group Privacy Policy below.  Our Privacy Policy is in addition to any terms, conditions or policies agreed to between you and Apple, Inc., and Nickelodeon and its affiliated entities are not responsible for Apple's collection or use of your personal user data and information.   Additionally, this App may use “local notifications.”  Local notifications are sent directly from the App to your device (you don’t need to be connected to the Internet) and may be used to notify you of new content or events within your App, among other reasons. Use of this app is subject to the Nickelodeon End User License Agreement.<br/><br/>TEENAGE MUTANT NINJA TURTLES: Rooftop Run offers in-app purchases and charges real money for additional in-app content. You may lock out the ability to purchase in-app content by adjusting your device’s settings.<br/><br/>You may have set up your Apple ID password to keep you logged on for 15 minutes after an initial in-app purchase. If so, additional purchases won’t require a re-entry of the password during this 15 minute interval. This is a function of how you set up your account and not within our control.<br/><br/>For users residing in the EU, TEENAGE MUTANT NINJA TURTLES: Rooftop Run may include the use of persistent identifiers for game management purposes and installation of this app constitutes your permission to such usage of persistent identifiers for all users on your device.<br/><br/>End User License Agreement: http://www.nick.com/nick-eula/<br/>Privacy Policy: http://www.nick.com/privacy-policy/<br/>The End User License Agreement for this app includes arbitration for disputes – see FAQs: http://www.nick.com/faqs/<br/><br/>", "metacritic": null, "released": "2013-04-18", "tba": false, "updated": "2023-02-16T15:28:12", "background_image": "https://media.rawg.io/media/screenshots/4de/4de42424f1b6070343d35eff4b49c81b_BSIofUj.jpeg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 298, "game_series_count": 19, "reviews_count": 2, "platforms": ["iOS"], "developers": ["Nickelodeon"], "genres": ["Action", "Arcade", "Casual"], "publishers": ["Viacom International"], "esrb_rating": "Everyone 10+"}