{"id": 20831, "slug": "global-atc-simulator", "name": "Global ATC Simulator", "name_original": "Global ATC Simulator", "description": "Global ATC Simulator is a standalone simulation of the task of Tower, Approach and Departure controllers. What sets it apart from every other ATC simulation is that it is global, it covers all the major airports in the whole world with literally unprecedented detail. It uses the same (licensed) database as the majority or airliners so for each of the nearly 14.000 airports you will guide aircraft over the correct routing and procedures. And the aircraft you guide will fly as they should and they will be the right type and the right airline for that airport.<br/><br/>While it includes a ‘gaming’ mode where ever increasing traffic will test your skills, it is a serious simulation. Not only will you have to keep the aircraft type in mind (a massive Airbus A380 will need a lot more room to turn than a Twin Otter) but also the wind and visibility. Traffic flow is irregular, you will find that there are times when your airport simply is not able to handle the traffic and you will need to keep aircraft in holding patterns until things slow down. But keep them there too long and some will start to run low on fuel and will demand to be given landing clearance. You decide if departing traffic needs to give way to arrivals. Every decision has consequences and you will start to understand very fast why air traffic controllers get paid so much money as they do!<br/><br/>Global ATC Simulator is created with shared user created content in mind. You can edit virtually every part of the simulator. If you feel B747’s should climb faster you can edit the aircraft file. If your favourite airline buys a new aircraft type you can add it. If there is an airline missing you like you can add it in minutes. And of course sharing these files will make the simulation better for all users.Features<br/><ul><li>Close to 14.000 airports with all runways, SIDs, STARs, Arrivals, waypoints (including restrictions)<br/></li><li>100 Airlines (expanding every day) with correct destinations and aircraft types<br/></li><li>80 Aircraft types that all fly realistic (speeds, turning rates, climb and descend rates etc)<br/></li><li>Updatable navigation database (NavDataPro)<br/></li><li>All aspects of the simulator user editable, users are expressly invited to share content<br/></li><li>Scenarios<br/></li><li>Real Time weather (requires online connection)<br/></li><li>Win 7 and 8 touch interface<br/></li><li>Control aircraft with mouse or text interface<br/></li><li>MultiPlayer mode via LAN possible</li></ul>", "metacritic": null, "released": "2014-11-10", "tba": false, "updated": "2019-08-28T22:08:24", "background_image": "https://media.rawg.io/media/screenshots/761/761ac2c7a5b51067163d8a5144355bd6.jpg", "website": "http://forum.aerosoft.com/index.php?/forum/611-global-air-traffic-control/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 165, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Robert Miroszewski"], "genres": ["Simulation"], "publishers": ["Aerosoft"], "esrb_rating": null}