{"id": 208476, "slug": "laser-defender-mistriven719", "name": "Laser Defender (MistRiven719)", "name_original": "Laser Defender (MistRiven719)", "description": "<p>Operation Laser Defender:</p><p>Final speech from the Commander-----</p><p>The Endless Horde: Truly a fitting name. For as long as we have known of their existence, we have been living in fear, and now that we have become the target of their aggression, terror is all we breathe. Their numbers - Impossible to comprehend.. Their purpose - Impossible to fathom. Every single one the same as the last, so no matter how many we destroy, in our eyes no progress has been made.</p><p>This is why all of you are here. You have all enlisted in the defense of the planet... you have all volunteered your lives for the sake of others. Even if all hope is lost, you refuse to give up, you refuse to give in. Against impossible odds, you stand before us, men and women true to the fate of humanity. In your eyes, I see the very spark that helped us become the valiant race that we are. You make me want to believe that victory is indeed possible, when I know the truth is far more sinister. We reach for a fleeting dream, but without that dream, we are lost. </p><p>-sigh-</p><p>We know this is a suicide mission, and we value your courage, knowing that all that awaits you is death. If you can destroy even one assailant, that's a little more time that we will have on Earth - a little more time we have to say goodbye. I trust you have all said your own..... </p><p>Alas, this downer talk isn't going to do us any good from here on. You all have a duty to uphold. You have families depending on you. You have a planet to protect. Defend us with all of your strength! You ARE humanity! All of our hope lies with you. </p><p>We will deploy you in groups of three to spread out our efforts to give us the longest chance of survival. Get ready, gather your things, suit up, and reconvene in the hangar bay. We set out as soon as we are able! </p><p>Go and make us proud, and prolong the lives of those you love.... You are a true hero in our eyes... Farewell, and godspeed.</p>Note for future pilots: The cerebral interface that the spaceships use for the piloting systems still have a couple of developmental bugs that we were unable to iron out. Specifically, under duress, if a paradox is encountered, the system will glitch out and the sensory projections can malfunction, leading to unknown results. We have been able to prevent most of them, but under the right conditions, unforeseen circumstances may allow for new paradoxes to come forth. Mostly, try to stay away from forcing impossible solutions to present circumstances, particularly when using 3 key commands.", "metacritic": null, "released": "2016-10-07", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/a06/a0612f9fe77fb90e03ba51c7e4aba076.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 4, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["MistRiven719"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}