{"id": 20858, "slug": "aqua-kitty-milk-mine-defender", "name": "Aqua Kitty - Milk Mine Defender", "name_original": "Aqua Kitty - Milk Mine Defender", "description": "<p>Aqua Kitty is a fast paced retro styled submarine arcade shooter with optional 2 player local Co-op.<br />\nBlast through hordes of mechanical sea monsters in your kitty sub and defend the deep sea milk mining kittens!<br />\nTHE MILK MUST FLOW!<br />\nStoryDue to a sudden shortage of milk, cats around the world are forced to seek out new sources to get their fix.<br />\nYou and your team of milk mining kittens have overcome a fear of water to drill down under the ocean seabed and begin extracting vast reserves of what seems to be naturally forming full-fat milk.<br />\nGet ready for fast paced submarine action, defending the kittens from disruptive mechanical sea creatures.Key Features<br />\nOptional 2 player local CO-OP.<br />\nBranching map progression of levels.<br />\n3 Main Game Campaign Modes<br />\nNormal Mode - the standard game of branching levels full of mechanical enemies with differing behaviours.<br />\nEasy Mode - a version of Normal mode in case you found it too hard, with more health and easier enemies.<br />\nArcade Mode - a special survival mode where you must collect gems to purchase powerups.<br />\nDepth based power-up systems which gives partial control on the type and location of the power-ups created (allowing tactical advantage).<br />\nClassic infinite mode milk-free level, that never ever ends - for the hardcore challenge.<br />\nDual firing submarine with a rechargeable secondary weapon that needs to be managed carefully (upgrades through game progress in Easy and Normal Modes, but upgrades via a shop system in Arcade Mode).<br />\nVarying sea depths per level which subtly affect gameplay.<br />\nChain kill combo system allowing the more skilled player to maximise score.<br />\nSteam online leaderboards to challenge and achievements to obtain.<br />\nHand drawn pixel art graphics, displayed at a crisp 720p.<br />\nAwesome chiptune music taking inspiration from the best of the C64 and Amiga days.Development historyHello, here is a short history of this indie games&#39; development which we hope will be of interest.<br />\nAqua Kitty was made by a core team of two people with audio created by Electric Cafe and the game box art by artist David Hankin.<br />\nIt began as a small modern-retro styled PC game, designed to run at a crisp 1280x720 it was created with a love of the 16bit gaming era and late 80s video arcade games.<br />\nThere were originally 3 core versions of the game available of different hardware - PC, XBox360 and Sony PSM.<br />\nSony version is the oldest and smallest version. A critically acclaimed launch title for PSM (Vita).<br />\nXBox version is the Sony version with extra added levels + enemies + refinements.<br />\nPC version is the most feature rich and improves on the XBox one with new Weapons + Gradius style Arcade mode + yet further refinements and extra details (with the Steam version being unique in having online leaderboards and achievements).<br />\nAll the new things we have added to the Steam version will also be rolled back into the other PC versions unless Steam specific (ie Online leaderboards, achievements, trading cards are STEAM ONLY).</p>", "metacritic": null, "released": "2014-02-03", "tba": false, "updated": "2023-04-08T07:15:54", "background_image": "https://media.rawg.io/media/screenshots/cb2/cb20ef935f2eb18c73e382ee6c3e00b4.jpg", "website": "http://tikipod.com/aquakitty/", "rating": 3.13, "rating_top": 4, "added_by_status": {"yet": 9, "owned": 243, "beaten": 6, "dropped": 7, "playing": 1}, "playtime": 3, "achievements_count": 90, "ratings_count": 22, "suggestions_count": 253, "game_series_count": 0, "reviews_count": 23, "platforms": ["PS Vita", "PC", "PlayStation 4"], "developers": ["Tikipod", "Dugan", "Gabor", "Electric Cafe"], "genres": ["Action", "Shooter", "Arcade", "Indie"], "publishers": ["Tikipod"], "esrb_rating": null}