{"id": 20864, "slug": "fiesta-online", "name": "Fiesta Online", "name_original": "Fiesta Online", "description": "Fiesta Online is a unique free to play anime MMORPG played by an active and friendly community. In a magical and colorful world, players assume the role of a fantasy hero and brave powerful enemies and challenging quests. <br/>With regular updates and more than 115 levels, hundreds of hours of gameplay content await you!<br/> <br/><strong>Features</strong><br/><br/>•\tANIME MMORPG<br/>Choose your fantasy hero among five different character classes. Each class is equipped with different skills and plays a different role. You are not limited to only one character. You can change and experience the game in a new perspective.<br/><br/>-\tFighter<br/>-\tCleric<br/>-\tArcher<br/>-\tMage<br/>-\tTrickster<br/><br/>•\tQUESTS &amp; ADVENTURES<br/>Everyday new adventures await you thanks to a Daily Quest System rewarding you with fame and bonuses. You can also take part in epic Kingdom Quests to help your character make friends and level up. <br/><br/>•\tGUILDS &amp; DUNGEONS <br/>Become a member of a guild and have fun while playing Fiesta together. Fight together mighty bosses in dungeons and become the most powerful guild!<br/><br/>•\tMASTER &amp; APPRENTICE SYSTEM<br/>Learn a new type of team play to progress easily and fast in the game! Gain levels faster as Apprentice and pass on your knowledge as Master. <br/><br/>•\tEVENTS &amp; WEDDING SYSTEM<br/>Participate in numerous in-game events and organize parties where you can dance with your friends. Find a partner who will stay on your side throughout your adventures and get married. <br/><br/><br/><br/>Join the fun with us, thousands of players await you!", "metacritic": null, "released": "2014-04-28", "tba": false, "updated": "2023-11-13T18:03:21", "background_image": "https://media.rawg.io/media/screenshots/5e0/5e01436b8c45e3482fde196f65cf8482.jpg", "website": "http://fiesta.gamigo.com", "rating": 1.46, "rating_top": 1, "added_by_status": {"yet": 9, "owned": 461, "beaten": 3, "dropped": 6}, "playtime": 1, "achievements_count": 0, "ratings_count": 13, "suggestions_count": 582, "game_series_count": 0, "reviews_count": 13, "platforms": ["PC"], "developers": ["Onson Soft"], "genres": ["RPG", "Massively Multiplayer"], "publishers": [], "esrb_rating": null}