{"id": 208729, "slug": "slaughter-factory", "name": "Slaughter Factory", "name_original": "Slaughter Factory", "description": "<p>You wake up in a mysterious factory, no idea how you got there. As you explore the factory you discover you are not alone!<br/><br/>Controls:</p>\n<p>WASD - Movement</p>\n<p>Shift - Sprint</p>\n<p>E - Action/Item Pickup</p>\n<p>Left Mouse Click - Attack</p>\n<p>1/2/3/4 - Inventory Items</p>\n\n\n\n\n\n<p>If you get stuck here is a rough guide:</p>\n\n<p>- Left click infront of the Fire Axe to break the glass, press E to pick it up</p>\n<p>- Use the Axe and attack the steaming pipe 3 times, put the axe away and press E to break the handcuffs</p>\n<p>- In the Workshop, the torch is found in the Toolbox and the Oil Can in the Cabinet</p>\n<p>- Once the cutscene has triggered, head north into the freezer, follow the blood and open the freezer and pickup the keycard with E</p>\n<p>- Next head to the managers office up the steps in the main room</p>\n<p>- Make a hole in the door by attacking it twice with the fire axe, then press E to open it</p>\n<p>- On the left hand wall in the corner there is a button, press E and it will stop the Machine</p>\n<p>- Check the NPC</p>\n<p>- Head towards the Exit, in the reception there is a microwave, open it with E, equip the Gas Can and attack to put in the microwave, press E to close it and attack to start it, move away</p>\n<p>- Once the explosion happens, go through the whole to complete the level</p>\n<p>- This last bit can be done without saving the NPC</p>", "metacritic": null, "released": "2017-12-20", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/d69/d693540de78fb3be77f2723fb689bcef.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 18, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["zubby"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}