{"id": 20874, "slug": "sweet-lily-dreams", "name": "Sweet Lily Dreams", "name_original": "Sweet Lily Dreams", "description": "<strong>Prequel: Whisper of a Rose</strong><br/><br/>The peaceful Realm of Dreams is about to be consumed by a dark and terrible nightmare. You must venture into the darkness and battle fearsome literary foes such as Hyde, the Headless Horseman and Dracula. Are you brave enough to face the most maleficent recesses of the human imagination? Join Lily on a sugar-coated adventure about inner strength and trust with a dark interior.<br/><br/>Sweet Lily Dreams is an epic RPG with a cute surface and dark, adult themes on the inside. Lily, along with her comrades Faith (a dog) and Curly Trick (a cat), journey into the Realm of Dreams and end up at the center of the battle between good and evil. All is not as it seems and sweet Lily is about to learn that books are safer than reality, that trust is not to be given lightly, and that good does not always triumph.<br/><br/>\"What comes immediately to mind as a summation of the story's concept is the characters from preschool sing-along videos being thrown into Middle Earth and asked to defeat Lord Sauron by way of the horror shelf of your local DVD rental store.\"<br/>-<strong> Indie Game Magazine</strong><br/><br/><br/><ul><li>Explore a massive world of classic tales, folklore and dreams.<br/></li><li>Numerous enemies to fight in fast-paced, turn-based battles.<br/></li><li>Dozens of exciting Steam Achievements!<br/></li><li>Craft magic, furniture and items of power.<br/></li><li>Solve puzzles and play optional mini-games.<br/></li><li>Build and furnish your own house!<br/></li><li>Travel with a party of loveable and unforgettable characters.<br/></li><li>Discover hidden caves of treasure.<br/></li><li>Customizable mouse and keyboard controls.<br/></li><li>Try to collect all coins and accessories in the game!<br/></li><li>Get carried away by a beautiful soundtrack and atmosphere unique to each dream world.</li></ul>Other Games by RosePortal Games on Steam:<ul><li>Whisper of a Rose<br/><br/></li><li>The Princess' Heart<br/><br/></li><li>Unraveled<br/></li></ul>", "metacritic": null, "released": "2014-05-16", "tba": false, "updated": "2024-04-06T13:12:31", "background_image": "https://media.rawg.io/media/screenshots/956/956d8b36d4693bcb8a10ce5d687652ae.jpg", "website": "http://www.roseportalgames.com/index_sld.html", "rating": 1.71, "rating_top": 1, "added_by_status": {"yet": 37, "owned": 573, "toplay": 1, "dropped": 10}, "playtime": 3, "achievements_count": 38, "ratings_count": 16, "suggestions_count": 473, "game_series_count": 0, "reviews_count": 17, "platforms": ["PC"], "developers": ["RosePortal Games"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["Degica"], "esrb_rating": null}