{"id": 208846, "slug": "snorri-147", "name": "Snorri 147", "name_original": "Snorri 147", "description": "<p>*Snorri 147's Multiplayer is Still Functional but Development has ended.</p><p>What Ever Happened to The Original Snorri 147? <br/>We improved it over the past months to include multiplayer and the start of areas.<br/>areas are to contain different quests and activities to do while the game.<br/><br/>Snorri 147 is A Multiplayer Adventure Game where you travel across a gigantic map to complete quests and do activities! Each Server can hold up to 10 players currently but can have tons of servers opened up at a time. Snorri 147 is A Fan Game to Icelandic Twitch Streamer DjentlemanXIII! Check him out! He is Awesome!<br/><br/>Latest \"Normal\" Build - Alpha 0.6.0<br/></p><p>Changelog -<br/>0.1.0 - Initial Release<br/>0.2.0 - New Countryside Area - Used for travelling between Cities / Areas! , Fixed Slowness Bug! , Confirmed 2 New Cities in-game (Tott City &amp; New Yelp City)! , Still Working on Quests.<br/>0.3.0 - Tott City Update - Added Tott City, and fixed random bugs.<br/>0.4.0 - New Yelp City &amp; Super Tott Highway Update - After a long time We are happy to annouce the Super Tott Highway and New Yelp City! These are 2 important places within Snorri 147! Super Tott Highway connects Tott City and New Yelp City together and saves time going back and forth for quests! New Yelp City is one of the 3 cities in=game and is the biggest one out of them! It contains more Quests and Activities then the others but the other cities still have some Activities and Quests exclusively for them. We have been working towards the Quests feature since the start but we can't seem to find a way to implement it. We'll look through it ,but please expect that to be most likely the next big update.<br/>0.4.5 - Experimental Build - 0.4.5 is not an actual Update but instead a Public Test Build for the Community to test out new features. For this scenario, I wanted to test and get feedback on A Early Implementation of the Quests Feature. If you would like to test it... download the Build under \"Experimental Builds\" And Go to Snorri's House! Then Press E on the Capsule NPC. It will prompt you with a Quest. Either Accept or Decline it. Then Complete the Quest and Press E on Completion of the Quest. For Example if you need to talk to someone Press E next to the NPC of them. If though it's not a NPC-Related but to go to a cave or a city. Press E on the Object instead of the NPC. Please Provide Any Feedback of how your experience was with This Build in the comments of the game. Thank You.<br/>0.5.0 - New UI &amp; Main Menu Update! - Nothing more than A Nicer Main Menu &amp; Added Music. Top Supporters &amp; Music will Change on Update to keep variety.<br/>Removed Quests since not final. - 720p Resolution is highly recommended -<br/>0.5.5 - Android Support &amp; Cross-Multiplayer Support Added! - We added a Android Build below that has been tested to work with Multiplayer with Windows,Mac,and Linux! This means Snorri 147 can be played online anywhere you go with online access! :D This Build doesn't include a Windows , Mac OS X, or Linux Build since This Build works with Users of 0.5.0! This build is just for a Android Release.<br/>0.6.0 - Check-Up with Snorri 147's Game Progress! - Hello Everyone! I wanted to let you guys of a few things since it's been a few weeks since last build! I have annouced the official release of Snorri 147 for Christmas 2016 so get those calendars marked! Updates will still be working though. :P Nothing really though despite that in gameplay related features. We are still in the works of Custom Music, and Quests. Nothing yet for Resolution. Thanks for All of yours patience! I really appreciate it all! <br/>Final Release - Due to Lack of Development time till Release, We have decided to finish the development of Snorri 147. This will be the final release (for a long time if even). Thanks for the support and make sure to stay tune for our other games!</p><p>What's Our Goal for Next Update? - <br/>None</p>", "metacritic": null, "released": "2017-02-02", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/c78/c78f6176b3a0ff22679fcdb4f275a585.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 10, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Android"], "developers": ["RainbowKappaGames"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}