{"id": 209, "slug": "dino-dinis-kick-off-revival", "name": "Dino Dini's Kick Off Revival", "name_original": "Dino Dini's Kick Off Revival", "description": "Dino Dini is back and so is Kick Off! The advertising for the original game in 1989 declared: \"Playing it is easy, mastering it will take time - A lot of time\" and this is also true of Dino Dini's Kick Off™ Revival.<br/><br/>Designed for people who want to get the satisfaction that comes from executing skillful moves under pressure, this is a game for the hard-core where success and failure is all down to you and your dedication at mastering the game. Called by some the \"Dark Souls\" of football games, this game has the same philosophy that drives skill based games where the game itself is a sport.<br/><br/>The only question is, do you have the dedication and skill to master Dino Dini's Kick Off™ Revival? It's not a question that can be answered quickly, those who have tried to do that have failed! But don't worry, as long as you focus on what matters - building your skill and strategy - you will have plenty of fun along the way. This is not a game that just hands you goals, you have to earn them!<br/><br/>When you score an amazing header goal in injury time to win a match after coming back from behind, it feels like nothing on earth!Features<br/><ul><li>60 FPS smooth blisteringly fast gameplay<br/></li><li>Super smooth full speed netplay (dependent on your and your opponent's network connection)<br/></li><li>Simple controls with a single button, yet allowing a full set of moves<br/></li><li>Custom ball physics engine with\"non-sticky\" ball gameplay<br/></li><li>Gesture based input allowing you to shoot with any strength, direction, swerve, height<br/></li><li>Fouls, red and yellow cards<br/></li><li>4 Game Modes: Tutorials, Training, Single Game, European Cup  <br/></li><li>Online gaming: 1 vs 1 with random matchmaking, invites and leaderboards  <br/></li><li>Offline multiplayer: 1 vs 1 friendly or Euro competition<br/></li><li>European, North and South American teams<br/></li><li>Radar for full view of the pitch<br/></li><li>8 Formations selectable at any time<br/></li><li>Editing the groups of the European Cup</li></ul>", "metacritic": null, "released": "2016-06-24", "tba": false, "updated": "2023-02-24T20:11:07", "background_image": "https://media.rawg.io/media/screenshots/243/24329398fe5416352154df68321bc02c.jpg", "website": "http://www.thedigitalounge.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 38, "beaten": 1, "toplay": 1}, "playtime": 1, "achievements_count": 42, "ratings_count": 4, "suggestions_count": 146, "game_series_count": 0, "reviews_count": 4, "platforms": ["PS Vita", "PC", "PlayStation 4"], "developers": ["Plug In Digital", "DIGITAL LOUNGE", "Koo Games"], "genres": ["Simulation", "Sports"], "publishers": ["Plug In Digital", "The Digital Lounge"], "esrb_rating": null}