{"id": 209257, "slug": "crazy-collector", "name": "Crazy Collector", "name_original": "Crazy Collector", "description": "<p>If you like collectibles scattered on entire field, this game is excellent for you! Concept is simple: gather all jewels. Meanwhile you have to avoid enemies, collect bonuses which aid you in different circumstances and keeping high combo to get high score at the end of level. Therefore you can get keys to open hidden levels and puzzle pieces to reveal a secret image. Additionally there are 45 achievements to collect. You can also get experience to reach higher levels and upgrade skills! Attention! Trying to get everything could make you crazy! Still interested? I warned you...</p>\n<p>2.0 (22th July, 2018)<br/>----------------------------<br/>- updated Phaser to 2.11.0<br/>- completely rewrote and optimized code<br/>- smoothed rotating background<br/>- changed layout of buttons in main menu to horizontal<br/>- removed music and sound volume buttons in pause menu<br/>- removed Esc key for pause menu to not collide with escape from fullscreen mode<br/>- removed level number header after level start<br/>- added randomization of enemy direction when starting a level instead of always \"north-looking\"<br/>- adjusted countdown timer, now always displays the first digit even when it's zero<br/>- upgraded bonus spawn system, now spawns close to player instead of random placement anywhere<br/>- removed experience for pure level completion<br/>- added new achievements<br/>- adjusted some level layouts<br/>- changed color of level requirements from red to orange<br/>- adjusted drawing bonuses existing in level selection, now shows exact existance only when beaten the level<br/>- added \"lock\" for button that resets upgrades, now detects when resetting makes sense (only when spent some points)<br/>- adjusted some thresholds for stars gaining<br/>- adjusted experience for stars<br/>- slightly increased base movement speed of the player<br/>- fixed English vocabulary</p>\n\n<p>W, S, A, D / arrow keys – movement<br/>Esc / P – pause game<br/>F - fullscreeen / windowed mode</p>\n<p>Available in two languages: Polish and English.<br/>Powered by Phaser.</p>\n<p>This game is also available on Kongregate and Newgrounds!</p>", "metacritic": null, "released": "2018-02-15", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/031/031798b15aa908ae433983d4e03ae504.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 45, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Jason"], "genres": ["Action"], "publishers": [], "esrb_rating": null}