{"id": 20927, "slug": "ultimate-tic-tac-toe", "name": "Ultimate Tic-Tac-Toe", "name_original": "Ultimate Tic-Tac-Toe", "description": "<strong>Ultimate Tic-Tac-Toe</strong> takes the classic game of <strong>Tic-Tac-Toe</strong> and adds a strategic layer to it.Description<br/><ul><li>Each square of the 3x3 game board contains another, smaller, 3x3 game board.<br/></li><li>Where you make your move in a square of any small board, you send the opponent in the respective square of the big board.<br/></li><li>3 in a row in a small board wins the small board and the big square.<br/></li><li>3 small boards in a row wins the game.<br/></li><li>Strategize your play, plan your next move, let the opponent win some small boards, while you win the game!<br/></li><li>On the <strong>Forget</strong> game subtype, each 4th move of the same player in a board will erase his oldest move.</li></ul>Features<ul><li><strong>Classic</strong> and <strong>ultimate</strong> tic-tac-toe games.<br/></li><li>Each of the classic and ultimate types can also be played in <strong>Forget</strong> mode.<br/></li><li><strong>Single-player</strong>.<br/></li><li><strong>Hot-seat</strong>, a multiplayer mode from the same PC.<br/></li><li><strong>Multiplayer</strong>, through LAN or Steam.<br/></li><li>3 levels of <strong>difficulty</strong>.<br/></li><li><strong>Rankings</strong>: play with users closer to your skill level.<br/></li><li><strong>Leaderboards</strong>.<br/></li><li><strong>Achievements</strong>.</li></ul>Gameplay<ul><li>When the game starts, the player with the X piece will move first, and can place his piece wherever he wants. To let the opponent (AI or friend) place the first piece, you can choose to play with O. Placing the first piece will not give the player such a big advantage as in the classic tic-tac-toe game, he still needs to create a strategy in order to defeat you.<br/></li><li>Next, your opponent will have to play the board respective to the square that you've just filled.<br/></li><li>Your next move will be in a board that your opponent sends you to, given by the square that he just made his move on.<br/></li><li>What happens if the opponent sends you to an already won or draw board? Then you can go wherever you like, but be sure not to send your opponent to a closed board, because he would have the same advantage.<br/></li><li>After playing a little, you will see that, even though you could win a small board easily, the fact that if the move you make would put your opponent at an advantage, you could chose to not win that board at the time, or perhaps forfeit it, if it will give you an advantage to complete other 3 boards in a row and win the match.<br/></li><li>A draw board will not count for either X, nor O.<br/></li><li>You can also play on the Forget mode, which erases your 4th oldest game piece, thus having another strategic element which you must focus on, and there won't be any boards that end-up in ties.<br/></li><li>When playing against the AI, you have 3 choices of difficulty:<br/><ul><li><strong>Easy</strong>: The AI tries to send you to boards where it's most difficult for you to make a move, even though he could win others.<br/></li><li><strong>Medium</strong>: The AI will always try to win small boards.<br/></li><li><strong>Hard</strong>: The AI will win small boards, if it doesn't give you an advantage on the next move; it tries to create a balance between winning and not giving you the upper hand. It also has a random element to it, so it provides more diversified plays overtime.</li></ul></li></ul>", "metacritic": null, "released": "2015-04-28", "tba": false, "updated": "2023-10-24T10:34:27", "background_image": "https://media.rawg.io/media/screenshots/f61/f6189cf4dd3a2cc987f0e7f604e2122e.jpg", "website": "http://www.tigerishgames.com/", "rating": 2.5, "rating_top": 1, "added_by_status": {"yet": 9, "owned": 456, "beaten": 6, "dropped": 5}, "playtime": 1, "achievements_count": 11, "ratings_count": 18, "suggestions_count": 125, "game_series_count": 0, "reviews_count": 18, "platforms": ["PC"], "developers": ["Shere Khan", "Tigerish Games"], "genres": ["Casual", "Puzzle"], "publishers": ["Tigerish Games"], "esrb_rating": null}