{"id": 209252, "slug": "late-for-class-alpha-4", "name": "Late For Class Alpha 4", "name_original": "Late For Class Alpha 4", "description": "<p>4th alpha of the game: now with power ups!</p>\n<p>You can also download a mac or windows version if you prefer. Personally, I do think the downloaded version plays better.</p>\n<p>When you're in the game, you can press \"r\" to reset and \"q\" to return to the menu. You no longer need the mouse for that!</p>\n<p>You can use arrow keys or wasd to move, and space to use a power up. You can also use a controller to play!</p>\n<p>The power up on the left will always be decelerate, and the power up on the right will always be accelerate.</p>\n<p>If you have fun, let me know your highscore!</p>\n<p>Major changes from Alpha 2:</p>\n<p>Added a second level. Once you hit 2x speed, the walls change color, and a new obstacle will be introduced. It's not much, but I've set up the system so that I can easily add a lot of level changes now. (UPDATE: There are now 5 levels, each with its own set of obstacles)</p>\n<p>Added power ups. Right now, there's a 1 in 30 chance that a power up will appear instead of an obstacle. The power ups will change your speed by 0.25.</p>\n<p>Added a new obstacle starting in the 2nd level. (UPDATE: There are new obstacles in every level)</p>\n<p>Added a camera bob, to simulate running. Let me know if that looks okay! (UPDATE: Capped the camera bob speed, to prevent disorientation)</p>\n<p>Fixed textures of walls and obstacles.</p>\n<p>(UPDATE 3.2) Implemented a max speed of 15 and now prevents players from going slower than 0 speed</p>\n<p>(UPDATE 3.2) made dodging obstacles at high speeds easier</p>\n<p>(UPDATE 3.2) holding a direction down no longer makes you repeatedly move in that direction, you now need to release a direction before inputting a new one</p>\n<p>(UPDATE 4) game now stores high score information</p>\n<p>(UPDATE 4) you now unlock levels as you beat previous ones</p>", "metacritic": null, "released": "2018-06-07", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/c29/c295899f338c3adbab172021a815d36c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 5, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux", "Web"], "developers": ["xandotoaster"], "genres": ["Racing"], "publishers": [], "esrb_rating": null}