{"id": 20938, "slug": "chariot-wars", "name": "CHARIOT WARS", "name_original": "CHARIOT WARS", "description": "CHARIOT WARS is a high quality story-led arcade racing game set in Ancient Rome with both singleplayer and multiplayer game modes.<br/>\n<br/>\r\n•\tAAA quality arcade racing game<br/>\r\n•\tExciting murder mystery singleplayer story (via a digital graphic novel)<br/>\r\n•\tArcade racing<br/>\r\n•\tSingleplayer Championship<br/>\r\n•\t8 player multiplayer<br/>\r\n•\tGlobal Leaderboards<br/>\r\n•\tAchievements &amp; Trophies<br/>\r\n•\tGame levels set in Egypt, Gaul, Greece and Helvetia<br/>\r\n•\tDay and night levels<br/>\r\n•\t10 chariot models to win and upgrade<br/>\r\n•\t8 charioteer avatars<br/>\r\n•\t5 horse types<br/>\r\n•\tLive streaming via Twitch<br/>\n<br/>\r\nBackground Story<br/>\r\nIt is 128AD. Emperor Hadrian announces a major festival to celebrate his first ten years as Roman emperor. The main attraction is a chariot race spanning the entire empire from Rome to Helvetia. <br/>\n<br/>\r\nFamous charioteers from across the vast Roman empire including Greece, Egypt, Judea, Carthage, Hispania, Gaul, Macedonia and Britannia have assembled in the Eternal City. Spectators in their thousands are streaming into the Eternal City for the inaugural race in the Circus Maximus. <br/>\n<br/>\r\nThe air is tense with excitement and anticipation. <br/>\n<br/>\r\nThe night before the first race, one of the charioteers from Judea is found murdered in his quarters. The charioteer had been tortured and crucified to the room’s window. An unknown woman’s body is also found on the floor. <br/>\n<br/>\r\nThe head of the emperor’s Praetorian guard, Quintus Octavian, suspects Rome’s constantly feuding noble families of masterminding the murders. Emperor Hadrian is deeply troubled by the murders. He fears a bloodbath in Rome and in restive Judea. It had only been a few decades since the Roman legions destroyed Jerusalem, the Judean capital and crushed the Hebrew rebellion. The emperor fears another uprising in Judea which could spread to the other conquered Roman colonies. <br/>\n<br/>\r\nEmperor Hadrian asks Quintus Octavian to take the position of the murdered Judean charioteer and represent Judea in the upcoming chariot race. <br/>\n<br/>\r\nAs Quintus continues his investigation, he is drawn inexorably into the murky world of Roman politics. Quintus has to solve two problems at the same time. He has to keep winning each race to stay in the Championship. He also has to solve the twin murders without himself becoming the next victim……..", "metacritic": null, "released": "2015-05-25", "tba": false, "updated": "2019-08-28T22:08:21", "background_image": "https://media.rawg.io/media/screenshots/d90/d90f4f922bcf7921089694f6f6d4cfa4.jpg", "website": "http://www.omplay.net", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 5}, "playtime": 5, "achievements_count": 16, "ratings_count": 0, "suggestions_count": 374, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["OM ENTERTAINMENT"], "genres": ["Racing"], "publishers": ["OM ENTERTAINMENT"], "esrb_rating": null}