{"id": 2094, "slug": "chase-hunt", "name": "Chase & Hunt", "name_original": "Chase & Hunt", "description": "&amp;quot;Gorgeous flight and graphics&amp;quot; - iFanzine<br/>&amp;quot;Novel concept, ingenious AI system, gorgeous sceneries, and open world experience&amp;quot; - DNReviews<br/>&amp;quot;If you’re interested in testing out your skill as an eagle, this is the game&amp;quot; - Edamame Review Club<br/><br/>Unlock the full power of your iOS device with Chase &amp;amp; Hunt, an open world game that has thrilling gameplay and vistas that you can show off. Explore these landscapes as you soar through parched deserted lands , dew touched highlands verdant with life, dusty canyons and steep mountains- all filled with amazing landmarks and beautifully rendered foliage. Lose yourself in these worlds, bring out the hunter in you and emerge a victor. <br/><br/>AMAZING FEATURES FOR IMMERSIVE GAMEPLAY<br/><br/>Console quality rendered terrains that have stunning details built into them.<br/>Realistic and dynamic lighting to take you from dawn to dusk while you soar the skies.<br/>MFI Controller support.<br/>iCloud support built in so that you wont ever lose that hard earned progress.<br/>Challenge yourself with exciting hunting missions that are carefully crafted in three difficulty levels. <br/>Get boosts and rewards to excel at your missions.<br/>Unique soundtracks for environments for more immersion.<br/>Climb our leaderboards and share your scores with friends and colleagues through game center. <br/>.<br/>Chase &amp;amp; Hunt is specifically optimized for iPhone5s and above with greater environmental detail, lighting and shadow effects and greater performance. <br/><br/>We work to update and improve the game to provide the best possible experience for you. Send us your impressions, feedback or any issues that you face with at info@rgbgamestudios.com. <br/><br/>Twitter: https://twitter.com/Chase_and_Hunt<br/>Facebook : https://www.facebook.com/playchaseandhunt", "metacritic": null, "released": "2015-10-17", "tba": false, "updated": "2019-10-22T14:27:58", "background_image": "https://media.rawg.io/media/screenshots/4c9/4c9b20152e3fc64e3aa719278c5e0368.jpeg", "website": "http://rgbgamestudios.com/home.html", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 224, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Ganesh Mamadapur"], "genres": ["Adventure", "Simulation"], "publishers": ["Ganesh Mamadapur"], "esrb_rating": "Teen"}