{"id": 20947, "slug": "mountain", "name": "Mountain", "name_original": "Mountain", "description": "<p>Mountain is a mountain simulation application which was intentionally made as an anti-game. It features very little gameplay and only a semblance of interactivity.</p>\n<h3>Gameplay</h3>\n<p>At the beginning of a new game, the player must undertake a quiz. He or she has to answer several psychological questions by drawing the answers. This is the only gameplay Mountain actually has. Based on the drawings, the program generates a floating mountain that embeds the player&#39;s answers. The user cannot interact with the mountain or influence it. However, he or she can observe it from any angle by rotating the camera with the mouse. By using the keyboard, the player can also influence the game&#39;s piano music.</p>\n<h3>The Mountain</h3>\n<p>The mountain slowly changes over time, acting as a living environment. As the time passes, the mountain goes through the day and night, various seasons, clouds, rains, and snowfalls. New plants can grow and fade on the mountain, and random objects can fall on it out of nowhere. Occasionally, a piece of philosophical text appears on the screen indicating the mountain&#39;s &quot;thoughts.&quot; The mountain eventually collides with a shooting star and collapses.</p>\n<h3>Premise</h3>\n<p>This game was created as an art object and an experiment rather than entertainment. It is meant to fill the time in the background while the user is preoccupied with some other activity. Though hardly a game, Mountain can be used for relaxation and meditation.</p>", "metacritic": null, "released": "2014-07-03", "tba": false, "updated": "2024-04-06T13:09:04", "background_image": "https://media.rawg.io/media/screenshots/e0b/e0b7df921a951ec97fa4d7c595dac410.jpg", "website": "http://mountain-game.com", "rating": 3.14, "rating_top": 4, "added_by_status": {"yet": 49, "owned": 1199, "beaten": 65, "toplay": 13, "dropped": 44, "playing": 3}, "playtime": 4, "achievements_count": 31, "ratings_count": 120, "suggestions_count": 148, "game_series_count": 0, "reviews_count": 120, "platforms": ["iOS", "PC", "Linux", "macOS"], "developers": ["David O'Reilly", "David OReilly"], "genres": ["RPG", "Simulation", "Casual", "Indie"], "publishers": ["Double Fine Productions", "David OReilly", "David O'Reilly"], "esrb_rating": "Everyone 10+"}