{"id": 20959, "slug": "realms-of-the-haunting", "name": "Realms of the Haunting", "name_original": "Realms of the Haunting", "description": "<p>Realms of the Haunting is a game about a haunted house with a creepy supernatural atmosphere. The plot is told through a series of full motion videos which were relatively new at the time.</p>\n<h3>Plot</h3>\n<p>The protagonist is Adam Randall, a young Englishman. His father died recently, and since then Adam is haunted by the nightmares about a cursed house. A mysterious priest gave him a box of magic stones and his father&#39;s letters. They reveal that the house from Adam&#39;s dreams was real. To investigate the mystery that led to his father&#39;s demise, Randall finds and visits the house. As soon as he enters it, someone locks the door behind his back. </p>\n<p>Adam has to walk through the house, reveal its dark secrets and deal with terrible creatures from other dimensions. Early at the game Rebecca Trevisard, a psychic, joins Randall as a companion. They learn that his father&#39;s soul is imprisoned within this walls, and there&#39;s much more at stake.</p>\n<h3>Gameplay</h3>\n<p>Realms of the Haunting uses a first-person view. The gameplay alternates between sequences of arcade action and puzzle-solving. In action parts, Randall has to gun down the undead monsters. When solving puzzles, the player has to find and use the item that fits the task. The player can adjust the difficulty level, and at the easy difficulty, the items are chosen automatically. There are also many letters and other documents that reveal details of the plot and provide clues for puzzles.</p>", "metacritic": null, "released": "1996-12-31", "tba": false, "updated": "2023-12-18T17:50:51", "background_image": "https://media.rawg.io/media/screenshots/464/46461a239c32cd68d3dc07add1c8c7a9.jpg", "website": "http://kiss-ltd.co.uk/", "rating": 2.6, "rating_top": 1, "added_by_status": {"yet": 73, "owned": 1484, "beaten": 6, "toplay": 9, "dropped": 21}, "playtime": 1, "achievements_count": 0, "ratings_count": 63, "suggestions_count": 505, "game_series_count": 0, "reviews_count": 63, "platforms": ["PC", "Linux", "macOS"], "developers": ["Gremlin Interactive"], "genres": ["Action", "Adventure"], "publishers": ["Kiss", "Funbox Media", "Blue Moon Red Owl"], "esrb_rating": "Mature"}