{"id": 20955, "slug": "deer-hunt-legends", "name": "Deer Hunt Legends", "name_original": "Deer Hunt Legends", "description": "Deer Hunt Legends puts players in the ultimate hunting environments, where bravery and intuition will be tested each step of the way. Your mission: capture as many trophies as you can, taking down big game around the world. You’re not out there to take notes. You’re out there to kill!<br/><br/>Deer Hunt Legends is a third person hunting simulation game that follows the story of a hunter on a quest to take down species never before seen by the human eye, some even believed to be extinct…<br/><br/>Players will travel across the globe in search of their prey. Captured in their natural environments, these animals are quick, deadly, and eager to turn you into dinner! You will engage in vicious boss battles against the feared T-Rex, saber-toothed cats, and Gastornis. With diverse weapons to choose from like sniper rifles, crossbows, and high-powered shotguns, Deer Drive Legends is the most realistic hunting game you’ll ever play!Features:<ul><li>More than 30 elusive animals including woolly rhinos, white-tailed deer, wolves and Irish elk<br/></li><li>Realistic natural background effects and sounds<br/></li><li>Range of unique challenges using true-to-life hunting techniques<br/></li><li>Bonuses awarded for successful kills, such as Health Packs, Ammo Clips, and more<br/></li><li>Earn skill points for extra advantage during specific hunts</li></ul>", "metacritic": null, "released": "2015-01-16", "tba": false, "updated": "2019-08-28T22:08:20", "background_image": "https://media.rawg.io/media/screenshots/db0/db00324492872738b60ca4c9613886ad.jpg", "website": "http://www.raylightgames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 51, "dropped": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 222, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Raylight Games"], "genres": ["Action", "Sports"], "publishers": ["Kiss", "Maximum Games"], "esrb_rating": null}