{"id": 20966, "slug": "gun-metal", "name": "Gun Metal", "name_original": "Gun Metal", "description": "<p>Gun Metal is a futuristic first-person shooter developed by Rage Software. It was released on different dates in different geographical regions.</p>\n<h3>Plot</h3>\n<p>The game&#39;s core story revolves around a human colony on the distant planet of Helios. Extra-terrestrial entities invade the planet, causing the planet-wide mobilization of its armed forces. The player controls a soldier, who is sent to repel the alien attack in his trusty mech suit.</p>\n<h3>Gameplay</h3>\n<p>The game combines both a shooter and an aerial combat simulator.</p>\n<p>The mech that is controlled by the player is developed as part of a Gunmetal project. These mechs stand twelve meters tall in their default configuration and are equipped with numerous weapons and force fields, that absorb an enormous amount of damage.</p>\n<p>Upon transformation, the mech becomes a modern reactive hypersound plane, similar to the American F-22 Raptor series of combat planes, that is equipped with a set of advanced sci-fi weaponry, including napalm, impulse cannons, harpoons, and ballistic rockets, yet it loses the ability of using its force field, thus rendering the plane mode much less sustainable to damage. </p>\n<p>The players can choose the set or armament that is installed on their mech, with 12 weapons present in the game. Each weapon has its own up&#39;s and down&#39;s hence why it is necessary to pick them carefully.</p>", "metacritic": 63, "released": "2002-06-30", "tba": false, "updated": "2023-10-10T19:37:15", "background_image": "https://media.rawg.io/media/screenshots/861/861780e580119b036c8b99044bd55b90.jpg", "website": "http://kiss-ltd.co.uk/", "rating": 2.53, "rating_top": 1, "added_by_status": {"yet": 40, "owned": 941, "beaten": 13, "toplay": 4, "dropped": 11}, "playtime": 4, "achievements_count": 0, "ratings_count": 38, "suggestions_count": 393, "game_series_count": 0, "reviews_count": 38, "platforms": ["PC", "Xbox"], "developers": ["Rage Software"], "genres": ["Action"], "publishers": ["Kiss", "Funbox Media"], "esrb_rating": null}