{"id": 20982, "slug": "puzzle-pirates", "name": "Puzzle Pirates", "name_original": "Puzzle Pirates", "description": "Brace yourself for swashbuckling puzzle action as you pillage your way to glory across the briny deep!<br/>\t\t\t\t\t\t\t\tCreate and customize a pirate, collect booty, and join a player-run crew of cutthroats! Every activity in Puzzle Pirates is a uniquely fun puzzle: be it sailing, gunning, or hauling treasure, your own puzzling skill determines your success!<br/>\t\t\t\t\t\t\t\tKey features\t\t\t\t\t\t\t\t<ul><li><strong>Co-operative Piracy:</strong> Sail the seas with your friends and pillage brigands and merchants aboard your very own pirate ship!<br/> </li><li><strong>A Plethora of Puzzles:</strong> Play more than 20 puzzles and mini-games, representing various piratey exploits, such as Swordfighting and Sailing!<br/> </li><li><strong>Sail to Adventure!:</strong> Explore a living world filled with thousands of other players! Hunt dangerous Sea Monsters and voyage to lost treasure-filled realms, such as the Haunted Seas!<br/> </li><li><strong>Booty!:</strong> Customize your pirate with a bounty of different clothing items and equipment!<br/> </li><li><strong>Player-Run Economy:</strong> Run your own shop and produce weapons, ships and other goods for sale. Band crews together under a mighty “Pirate Flag” and become governor of a pirate haven.<br/> </li><li><strong>Free to Play!:</strong> Puzzle Pirates is free to play, no subscription is required to enjoy everything the game has to offer!<br/> </li></ul>", "metacritic": null, "released": "2011-08-31", "tba": false, "updated": "2023-11-13T18:06:26", "background_image": "https://media.rawg.io/media/screenshots/a8b/a8b6cf2df28afbe6b3ebb6371f095c6d.jpg", "website": "http://www.puzzlepirates.com", "rating": 2.54, "rating_top": 1, "added_by_status": {"yet": 12, "owned": 654, "beaten": 3, "dropped": 8, "playing": 1}, "playtime": 1, "achievements_count": 220, "ratings_count": 26, "suggestions_count": 419, "game_series_count": 0, "reviews_count": 26, "platforms": ["PC", "macOS"], "developers": ["Three Rings"], "genres": ["Adventure", "Strategy", "Casual", "Massively Multiplayer"], "publishers": ["Three Rings"], "esrb_rating": null}