{"id": 20984, "slug": "peggle-extreme", "name": "Peggle Extreme", "name_original": "Peggle Extreme", "description": "<p>Mayday! The Peggle Institute has been invaded by a host of other-worldly creatures. It&#39;s up to you, Peggle Master, to report to duty and shoot and bounce the critters to oblivion. Take your best shot with energizing arcade fun, now exclusively themed with art and sounds from The Orange Box!<br />\nPeggle Extreme delivers fast-paced puzzle action that combines elements of pinball and pachinko to create a truly unique game experience. As with the original Peggle, Peggle Extreme requires players to fire a metallic silver ball from the top of the screen, relying on gravity to propel the ball downwards while ricocheting off orange and blue &quot;pegs&quot;. The goal is to clear all the orange pegs from the screen before running out of balls. A moving &quot;bucket&quot; at the bottom of the screen offers free balls, while green power-up and purple &quot;bonus multiplier&quot; pegs provide additional twists. Peggle Extreme features one power-up in the form of Bjorn the Unicorn, whose special takes the form of a &quot;super-guide&quot; sighting capability which enables players to see where there next shot will go beyond one or two initial bounces.<br />\nMaster 10 levels of &quot;Extreme&quot; challenges<br />\nConquer 5 Master challenges<br />\nPlay against a friend or the computer in Duel Mode<br />\nRevel in breathtaking artwork and sounds from Half-Life: Episode 2, Portal, and Team Fortress 2<br />\nReplay and save your best shots</p>", "metacritic": null, "released": "2007-09-11", "tba": false, "updated": "2024-01-13T13:15:16", "background_image": "https://media.rawg.io/media/screenshots/d36/d36db902d539d09a390b1e71f43adc06.jpg", "website": "", "rating": 3.25, "rating_top": 4, "added_by_status": {"yet": 9, "owned": 572, "beaten": 20, "toplay": 1, "dropped": 10, "playing": 2}, "playtime": 1, "achievements_count": 0, "ratings_count": 32, "suggestions_count": 146, "game_series_count": 4, "reviews_count": 32, "platforms": ["PC"], "developers": ["PopCap Games"], "genres": ["Casual"], "publishers": ["PopCap Games"], "esrb_rating": "Teen"}