{"id": 209863, "slug": "midterm-project-rajbasu", "name": "Midterm Project (rajbasu)", "name_original": "Midterm Project (rajbasu)", "description": "<p>Instructions: <br/></p><p>Use W, A, S, D to move and mouse to look around. Press 'e' to interact with the villagers and objects.<br/><br/></p><p>I chose this concept for my project, based on a memory of the time I spent on the Himalayas. My family was staying in a small village in the mountains, and my siblings and I would often walk through other nearby villages. On one such occasion, my younger sister got lost. This is supposed to represent a recollect of that time. Your character is looking for their lost sister on this mountain village, trying to find her with the help of the villagers, before sunset.<br/></p><p>Most of the development was fun. I knew that I would enjoy coding it, though I didn't expect that modeling would be equally as enjoyable. Perhaps the only thing that I found frustrating was working in substance painter. I didn't fully understand UV mapping, so there were many issues that came up when I was painting my textures. Because of the time expenditure it would be to solve these issues, and the time constraint I was working under, I had to forego the original aesthetic that I was looking for. However, I was pleasantly surprised by the new minimalist look, and I decided to roll with it, continuing development. That and the design were the most challenging. I ended up not using a lot of the design that I had initially and came up with new ideas, as I went in consideration of my time constraints. Thinking back on it, I would have saved myself a lot of work if I was testing smaller implementations of things I was adding to the game before as I went along. Overall I'm happy with the work that I've done.</p>", "metacritic": null, "released": "2017-07-25", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/9db/9dbc778a963571dd5c26dd4eadd0ea7d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 7, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["rajbasu"], "genres": [], "publishers": [], "esrb_rating": null}