{"id": 209826, "slug": "quit-smoking-save-life", "name": "Quit Smoking Save Life", "name_original": "Quit Smoking Save Life", "description": "<p>Quit Smoking Save Life offers virtual smoking which don’t damage your health and save your lungs from smoke! Want to quit smoking? Tired of tobacco cigars and filter cigarettes? Start virtual smoking. Anti smoking app will keep you away from tobacco and nicotine. Choose the favorite flavor and blow to show off the real fun of puffs. It’s 100% harmless and tobacco free quit smoking app. Download quit smoking cigarette app free to discover the magic!<br/>Install a cigarette simulator on your phone and show your friends how you smoke a virtual cigarette. Open packet of cigarette and take one out, light it up and see how it burns out slowly on the screen of your phone. Blow into the microphone to smoke a cigarette faster. You will see realistic smoke.<br/>How to smoke virtual cigarette?<br/>• Open the pack of cigarettes and get one<br/>• Light up the cigarette and start smoking. You need to blow into the microphone to smoke.<br/>• Smoke as much as you want! It is healthy and for free!<br/>Do you want to be cool in the company of friends, but you not want to damage your health then start virtual smoking because it does not harm your health. Smoking pipe is basically an electronic cigarette. Make your own smoking pipe by adding different flavours and tobacco. No smoking app lets you smoke anywhere anytime with just one tap. Smoke as much as you wanted without harming yourself.<br/>Do you want to surprise your friends and show them the real smoke of virtual smoking? Open the best quit smoking app, put a cigarette and pretend to puff. The cigarette on the phone will start burning faster. It will look as if you are really smoking a cigarette on the screen. Avoid smoking by simply using stop smoking app. Smoking is injurious to your health. So, install cigarette quitting app and start working out for healthy life. Quit smoking app for android will be helpful for you to stop smoking.<br/>This app is a gift for smoking addicted peoples a smoking app. we know smoking is dangerous for health. But still people still want that smok in their lungs why? Who much dangerous a  cigarette for health? how to stop smoking? All these types of questions answered in this app. This app is a smoking habit quitter app.</p>", "metacritic": null, "released": "2018-03-26", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/71b/71ba53384545e1f2f2b5a0c340306162.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 118, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["annaw"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}