{"id": 210089, "slug": "super-glitch-bob", "name": "Super Glitch BoB", "name_original": "Super Glitch BoB", "description": "<p>This Game was made in 48 Houres During the NSI Games Winter Game Jam with a team of 4.\r\nSuper Glitch Bob is a 3rd person endless runner in which two players compete against each other and try to defeat one another by sabotaging the opponent's running course.<br/><br/>\n</p>\n<p>Key Features\r\n<br/>2 Player Local Multiplayer\r\n<br/>Endless Running Course\r\n<br/>Increasingly Running Speed<br/>\r\nIncreasingly Hard Obstacles\r\n<br/>Glitch Power (makes you immune for x seconds)\r\n<br/>Randomized 6 Power Ups <br/><br/></p>\n<p>Goal<br/>The goal of each player is to achieve the defeat of their opponent by interfering with the opponent's running course using randomised power ups that can be found throughout the track.\r\nMeanwhile, each player has to manage to endure the increasingly difficult obstacles appearing along their own course, alongside the increasing running speed.\r\nThe defeat of the opponent is achieved by sabotaging the opponent running experience on its won course and causing the opponent to take damage, unless the opponent takes damage on its own by either hitting obstacles or falling of the running path. \r\nAtmosphere &amp; Mood\r\nSuper Glitch Bob is set within a surreal virtual environment suspended within a star-filled void. The visuals of the game are borrowed from the style and vibe of arcade and pc games of past generations. Super Glitch Bob displays a vibrant and electric color palette with a preference for reds, pinks, and purples.</p>\n<p>\n</p>\n<p>Minimum System Requirements\r\n<br/>OS: Windows XP SP2+ or Later \r\n<br/>Processor: 2 GHz Intel Core I3 Dual Core Processor or Better <br/>\r\nMemory: 4GB Ram or Better <br/>Graphics: Nvidia &amp; AMD (512MB VRAM) \r\nDirectX®:9.0 (shader model 3.0) or DirectX®:11 <br/>\r\nHard Drive: 150MB HD space \r\n<br/><br/>\r\nKeyboard\r\n<br/>Left Player:\r\n<br/>Jump : W \r\n<br/>Movement Left-Right : A/D\r\n<br/>Left ALT: Glitch<br/>\r\nLeft CTRL: Power Up</p>\n<p>Right Player:\r\n<br/>Jump : Up Arrow \r\n<br/>Movement Left-Right: Arrows\r\n<br/>Right ALT: Glitch<br/>\r\nRight CTRL: Power Up<br/><br/>\r\nIn Depth Break Down\r\n<br/>The running course is made by floating platforms randomly arranged to form the track as the player progresses forward. Each platform might be empty or contain a random obstacle.\r\nAs the game keeps going, the difficulty of the obstacles increases as well as their regularity. The running speed of the player also procedurally increases.\r\nPlayers have the “glitch” power which allows them to phase along the track allowing them to pass through obstacles and moving through empty spaces without the need to jump\r\nPlayer find along the track power ups which granted one of six different effects at random. \r\nEach power up ,once used, affects the track of the opponent in different ways.</p>", "metacritic": null, "released": "2017-10-12", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/251/25109ef0552894ff6081cf08115a04c4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 209, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MegaBitStudios"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}