{"id": 210055, "slug": "brick-breaker-x-deluxe", "name": "Brick Breaker X: Deluxe", "name_original": "Brick Breaker X: Deluxe", "description": "Intro\r\n<p><strong>Brick Breaker X: Deluxe</strong> brings you a unique brick-breaking experience of a lifetime. Prepare to break bricks inside stages with different field formations, you never play any Breakout clones like this before!</p>\r\nFeatures\r\n<ul><li>Playable with mouse, keyboard and Xbox controllers (experimental). Controls are interchangeable.</li><li><strong>Adventure Mode</strong> is where you'll start, blast through 50+ colorful, yet silly-looking stages and 8 challenging bosses. Meet new objects that you can tinker with the balls. You can also upgrade your paddle and ball to simplify the progress, these upgrades are also carried on the other modes!</li><li><strong>Classic Mode</strong> gives you the retro endurance-style brick-breaker, try to reach the boss through 30 stages before you run out of paddles!</li><li>This game is packaged tightly with <strong>3 additional modes</strong> that you can unlock by collecting the falling <strong>Power Orbs</strong>  from Adventure Mode:<ul><li><strong>Blitz Mode: </strong>How many bricks can you destroy within a minute? <em>(10 Power Orbs required)</em></li><li><strong>Frenzy Mode: </strong>How long can you survive the brick flood before it crushes your paddle? <em>(20 Power Orbs required)</em></li><li><strong>Party Mode: </strong>This is where the party started, grab your friends for a ball-and-bricks party for up to 4 players. USB keyboards and Xbox Controllers are recommended! Mouse, however, not supported. <em>(40 Power Orbs required)</em></li></ul></li><li><strong>Combo system</strong>, try to break multiple bricks at the same time to receive gigantic combos! More combos mean more scores!</li><li>This game tracks your progress that you can check by accessing the <strong>Records </strong>screen from the main menu.</li></ul>", "metacritic": null, "released": "2018-06-18", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/d61/d61e1c94a16505caee49bc5fa9081c37.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 64, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SONAR Games"], "genres": ["Action"], "publishers": [], "esrb_rating": null}