{"id": 21034, "slug": "beijing-2008", "name": "Beijing 2008 - The Official Video Game of the Olympic Games", "name_original": "Beijing 2008 - The Official Video Game of the Olympic Games", "description": "<p>Embrace the competitive spirit of the world&#39;s most prestigious sporting event and represent your country as you compete for the highest honor - the Gold.<br />\nThe game delivers a far more entertaining and immersive Olympic experience with superior graphics capturing the fine emotional detail of each event where a fraction of a second means the difference between winning and losing. With brand new gameplay mechanics challenging your time, speed, and coordination, you will strive to break records alone or with up to seven friends online as you lead your team to victory in 38 authentic Olympic events.<br />\nFeatures:<br />\n38 Official Events: Represent the country of your choice and compete for honor in ten Olympic sports including: Track and Field, Aquatics, Gymnastics, Cycling, Judo, Table Tennis, Canoe-Kayaking and more.<br />\nIn-Depth Career and Competition Modes: Organize your daily schedule and customize your chosen team with agility, power, stamina and speed for competition in 38 events across the duration of the Olympic Games. In Competition Mode participate with up to three friends in either a single or multi-event challenges offline.<br />\nInnovative Game Play Mechanics: Use a variety of controls across all the events including a time-based system where power, timing and angle are essential, rhythm-based play that requires skill of increasing and maintaining speed, and a targeting system to assist in aiming.<br />\nGlobal Online Competition: Choose your country and face challenges from other nations. A multitude of online features such as exhibition events, and leaderboards will allow players to prove themselves before the world.</p>", "metacritic": 57, "released": "2008-06-27", "tba": false, "updated": "2022-12-21T18:18:19", "background_image": "https://media.rawg.io/media/games/f2b/f2bf3d2d412a3bd7f29f5a0459b559cb.jpg", "website": "http://www.olympicvideogames.com", "rating": 3.3, "rating_top": 3, "added_by_status": {"yet": 2, "owned": 66, "beaten": 4, "toplay": 2, "dropped": 3}, "playtime": 0, "achievements_count": 50, "ratings_count": 10, "suggestions_count": 446, "game_series_count": 3, "reviews_count": 10, "platforms": ["PC", "Xbox 360"], "developers": ["Eurocom", "Eurocom Developments", "Eurocom Entertainment Software"], "genres": ["Sports", "Arcade"], "publishers": ["SEGA"], "esrb_rating": null}