{"id": 210578, "slug": "xcvb", "name": "XCVB++", "name_original": "XCVB++", "description": "<p>WARNING: This Game no longer has flashing images, but shakey camera is annoying. so those with photosensitive epilepsy beware.</p><p>I have playtested the game with WASD as the controls, and confirmed that all you people complaining about the nonstandard control schemes are morons who don't understand what it would do to the game. It would ruin it.</p><p>This is the kind%uFEFF of game that turns people into Batman villains.-MountedDragoon</p><p>XCVB: QWOP on drugs and Malaria</p><p>MARKIPLIER has done an awesome LP of this. Check it out here: http://www.youtube.com/watch?v=DuX7IDfHguY</p><p>This is a game made in 4 days as part of Newgrounds Game Jam 9.</p><p>SOME OF MY FAVOURITE NG REVIEWS:</p><p>\"Rainbows are coming out of all my orifices.\"-malthusian<br/>Rated 4.5 / 5 stars</p><p>\"It's fun because it's challenging. I kind of feel like my critical thinking has improved for playing this game.\"-Kadako<br/>Rated 5 / 5 stars</p><p>\"After every level I thought, that it was hardest one. Every time I've been wrong.<br/>Really well done.\"- szx<br/>Rated 4.5 / 5 stars</p><p>\"You my friend are the Devil.<br/>I could feel my Brain scrambling around like a Rubiks Cube :D<br/>Simple, so simple, that it gets hard.\"- Nachter<br/>Rated 4.5 / 5 stars</p><p>\"Oh fuck yeah! I beat it! That was intense and truly satisfying!!\"-mkurt<br/>Rated 4 / 5 stars</p><p>\"a perfect masterpiece, the controls were simple enough to be played but hard enough to our brain takes a while to get used to it, sadly, when I finally understood, the screen begun spinning more and more ;-; you evil genius, I LOVE IT\"-THE-VOID<br/>Rated 5 / 5 stars</p><p>It has a very alternate control scheme and is inspired very vaguely by this screenshot:http://www.newgrounds.com/art/view/havegum/physics-hell?context=ratings:etm.search:screenshotjam.offset:12</p><p>And I mean very vaguely.</p><p>This is a challenging skill based game where quick reflexes and quick thinking let you beat the game.</p><p>You start off in a Black and White World, not knowing where you are or what to do. And then BOOOM COLORS!!!!! RAINBOWS!!</p><p>X.C.V.B stands for something but I'm not sure what yet. You tell me XD.</p><p>X to left and right. C to up and down. V to go in the direction of UP or DOWN. B to go in the direction of Left or Right.</p><p>Get to the end of the levels.</p><p>The game gets faster as you go along.</p><p>Eventually you will come across the Malevolent Levels where what you are shown and what you will are the opposite. You must use considerable thinking to beat this game.</p><p>I would love you forever if you beat this game.</p><p>It's quite hard.</p><p>For those who like to look for messages and such in things. There's a subtle political commentary on the attitude of gay rights going on. As can be seen by the introduction of the rainbow levels. <br/>That's only if you want to look further into something than you should</p>", "metacritic": null, "released": "2016-07-01", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/e48/e48daa91fb15d8e6c6630a1a89216952.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 21, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["David Ryan"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}