{"id": 21053, "slug": "playing-history-the-plague", "name": "Playing History - The Plague", "name_original": "Playing History - The Plague", "description": "<strong>The Playing History</strong> game series revolves around experiencing engaging and personal stories set in exhilarating points in world history. The series have won the category of ‘best learning game’ in Europe. The series puts the student in the middle of important and interesting points in history.<br/><br/><strong>Why play Playing History?</strong><br/>To gain the opportunity to take part in history, within in a living breathing world. You will be able to learn about historic events that they cannot alter – instead, they witness how the historic events altered humanity as a whole. The learning process is autonomously conveyed throughout the story of the game as it progresses, this occurs through decisions and actions taken by the player throughout the course of the game. This kind of interaction is a unique learning method, which encourages the player to relate to the world and actively seek out knowledge.<br/><br/><strong>The Plague:</strong> Go on an exciting journey in the 14th century of Florence, an amazing city struck by a mysterious disease. The story is brimming with fascinating characters, historical events and captivating locations. Your mother has become ill and the fate of your family lies in your hands. History is yours to explore.", "metacritic": null, "released": "2015-10-21", "tba": false, "updated": "2019-08-28T22:08:17", "background_image": "https://media.rawg.io/media/screenshots/7f8/7f8a65c2100e2455c6f11b1ec2794e6a.jpg", "website": "http://www.playinghistory.eu/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 113, "beaten": 1, "toplay": 1}, "playtime": 3, "achievements_count": 8, "ratings_count": 2, "suggestions_count": 340, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC", "macOS"], "developers": ["Serious Games Interactive"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Serious Games Interactive"], "esrb_rating": null}