{"id": 210596, "slug": "kids-preschool-learn-letters-abc-english-phonics", "name": "Kids Preschool Learn Letters: ABC & English Phonics", "name_original": "Kids Preschool Learn Letters: ABC & English Phonics", "description": "<p>An English Alphabet learning app to teach Letters and phonics to Kindergarten &amp; Preschool children. Fun way to encourage child to learn letters and English Phonics while playing games.<br/></p>\n<p>Features:<br/>• Ten simple &amp; colorful games designed to educate young kids about English Alphabet and Phonics. <br/>• An effective and engaging way, designed especially for Toddlers and Preschoolers.<br/>• Covers preliminary English precepts such as ABC recognition, phonics, and simple words.<br/>• Core activities for foundation stage of primary school. <br/>• A common playground for randomly playing all the games.<br/>• Easy and intuitive instructions for the young brains.<br/>• Rewards and appreciation to boost our champion’s morale.</p>\n<p>** Description:<br/>An app, designed especially for young kids (2-4 age group), to lay the groundwork for learning basic skills with the help of fun activities. 10 high quality activities at a single place, each focusing on a key precept of elementary ABCD. Funny and enticing rewards keep our young learner amused for hours while introducing them to the language. The unique interactive activities are perfect for preschoolers to help them learn the language in a structured way. The activities also help build their hand-eye coordination, motor skills and concentration.<br/>The activities do not force timed completion, and therefore encourage the kid to learn at her own pace. Kids are enchanted with the experience of the game as there is no winning and losing. Appreciation and stars can be earned at the end of each activity. Adorable stickers can be collected after scoring enough points.<br/>The parent corner shows the performance report, for the reference of teachers and  parents. The great thing about this fun learning app is that while kids enjoys fun play, at the same they learn the basic concepts of Alphabet and phonics with out getting bored.<br/> <br/>** List of activities in the app:</p>\n<p>• Shadow Matching<br/>• Jigsaw <br/>• Bubbly <br/>• Bingo <br/>• Odd one out<br/>• Sequence Crawl<br/>• Letter Hop<br/>• Sequential Shells<br/>• Hello Phonics<br/>• First Letter</p>\n<p>You can also checkout other applications of Greysprings \"Play and Learn\" series @ Google play store:<br/> 1. Kindergarten Kids Learning <br/> 2. Kids Preschool Learning Games<br/> 3. Kids Preschool Numbers &amp; Math<br/> 4. Shapes &amp; Colors Nursery Games<br/> 5. Kids games Learning math basic<br/> 6. Kids Learning Word Games<br/> 7. Toddler Learning Games</p>\n<p>** About Greysprings<br/>** Visit us at www.greysprings.com<br/>** Contact us: contact@greysprings.com<br/>** Privacy<br/> 1. Privacy policy: http://www.greysprings.com/privacy<br/> 2. We do not collect any personal information about kids</p>", "metacritic": null, "released": "2018-03-27", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/956/956ed28ebed8b004b102e04c3891ac90.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 147, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["greysprings"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}