{"id": 210679, "slug": "police-monster-shooter-game", "name": "Police Monster Shooter Game", "name_original": "Police Monster Shooter Game", "description": "<p>POLICE MONSTER SHOOTER GAME </p>\n<p>Prepare yourself for most wanted kids police monster shooter game. Chasing criminal in monster truck along beachis amazing experience which you must know. Some really dangerous criminals are on run and you have to catch them. Grab your asphalt monster truck and chase them along beach while shooting at them to stop them anyway. It feels amazing to be a police shooter. Play this fantastic police shooting game and you will know how much fun it is to run and chase most wanted criminals in monster truck. <br/>Download this best police monster shooter game of 2017 and enjoy monster truck stunt in monster truck.This game is best free monster truck simulator game. A lot of people like shooting games. If you are interested in shooting games then this is the best option for you. Download this game from play store for free and enjoy being a police monster shooter in monster truck. <br/>This game is compatible with every android device. Now you can feel free to download this shooting game on your android device without any botheration. Now we do not have to waste more time and let’s go and play this fabulous game. <br/>HOW TO PLAY POLICE MONSTER SHOOTER GAME??<br/>As you know you are going to chase highly wanted criminals so you have to take the fastest monster truck; the asphalt monster truck. Check this truck thoroughly to make sure that there is no fault in it and it is safe to ride. We all know that criminals are master minds but they use it in the wrong way. So you must check that there is nothing unusual in your monster truck. If you found anything unusual then immediately call special police squad. <br/>Now if everything is clear, get in your monstrous police truck and get ready for crazy chase. While chasing make sure you have got all shooting equipment to shoot those criminals. You can select shooting equipment in this shooting game. <br/>Many police shooting games do not provide police shooting simulator and shooting missions but this game will not disappoint you. It has all the fun in it which you dream of and it is easy to understand and play. You can share this game with your friends as well. Because it is really fun to chase criminals on police monster truck on beach road and shoot during chase. <br/>Police monster shooter game is one of the top most games of 2017. So do not miss a chance playing this fantastic game. <br/>POLICE MONSTER SHOOTER GAME FEATURES <br/>o Challenging paths <br/>o Easy missions and difficult missions as well <br/>o Realistic city environment <br/>o Cool physics of asphalt monster truck <br/>o Machine gun <br/>o Heavy weapons <br/>o Beach road drifting <br/>o Tilt your screen on left to move on left <br/>o Tilt your screen on right to move on right <br/>o Maintain your speed <br/>o Realistic sound of brakes and accelerator <br/>o Outclass background music <br/>o Smooth controls <br/>o Endless game play <br/>o Beautiful sea view <br/>o Shooting and fight against criminals <br/>o Excellent graphics <br/>o Initially challenging </p>\n<p>If you are a fan of police shooting games then you must play this amazing game. It has all the important factors in it which can make this game enjoyable. Be aware it’s a public place you cannot be careless or you can do some damage. <br/>Give us your feedback!! </p>\n<p>POLICE MONSTER SHOOTER GAME <br/>Police monster shooting game is police games simulator so enjoy this police game.</p>", "metacritic": null, "released": "2017-06-02", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/d3d/d3d36a6f1a2f65f4c95fadc24fa6a781.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 101, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["UNKNOWNSOULX"], "genres": ["Shooter", "Puzzle"], "publishers": [], "esrb_rating": null}