{"id": 210754, "slug": "match-pets", "name": "Match Pets", "name_original": "Match Pets", "description": "<p>Discover and rescue animals with heroic panda. Play and find your own tai chi, good and evil, black and white. Discover the secret life of animals. Choose your hero: a boy named Tom or Jerry girl. Click avatar and explore a world full of secrets. The lives of all animals is threatened. What happened? Only Panda knows.</p><p>Join us and save all the animals. Connect 3 or more tiles with animals to free them.</p><p>In the game there are almost all popular animals that can be found on our planet.</p><p>No matter whether you're a boy or girl and so you'll love this game.</p><p>We have prepared for you up to 4 different types of animals.</p><p>From the most popular and beloved pets like cats, dogs, mice, rabbits and parrots until the special like a unicorn.</p><p>After the animals from the farm as cows, pigs, birds and sheep. You will also find in our frogs and cute bees.</p><p>But it is not everything. Playing next encounter other creatures candy.</p><p>Playing further know the inhabitants of the forest. Sly fox, the wise owl, raccoon cunning and dangerous bear. And it suddenly keel of them. Play and discover all.</p><p>Last in our package are the most unique. They live in the jungle in the Barrens or the islands of Madagascar. You can also find them in zoos around the world. Do you already know which animals it?</p><p>We have a friendly penguins, which will guide you through the whole zoo. Meet the pink elephant, giraffe curious, slow turtles, funny koalas and pandas unruly.</p><p>All these magnificent creatures are waiting for you. Smash blocks, adjust the candy animals and earn as many points.</p><p>Game Features:</p><p>- Match three or more blocks to meet the requirements of the level and save the animals</p><p>- Train your logical thinking in our matching puzzle adventure</p><p>- Meet zwierzaczki all varieties like puppies, bunnies, piglets and many more!</p><p>- Super addictive and that poses many challenges in the game match 3 puzzle</p><p>- Different game modes: limited time, number of moves and many others</p><p>- Find 100+ different levels and different themes!</p><p>- Many lands and worlds connected as one of the beautiful saga</p><p>- Animals combined in groups as home favorites, the inhabitants of the forest, zoo or farm.</p><p>- Bonuses, bonuses and power ups to help you in the game.</p><p>- Charming animation and music</p><p>How to play?</p><p>For example:</p><p>- Connect 3 owls to remove them from the map and earn points.</p><p>- Merge 4 pandas to get a special tile that will clear all tiles in a vertical or horizontal line.</p><p>- Connect 5 of frogs and you will get a colored candy, which can remove the stones of the same color.</p>", "metacritic": null, "released": "2017-02-07", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/a42/a42891aaf7857cc4542c83f1722d12f5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 92, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["LvlAppStudio"], "genres": [], "publishers": [], "esrb_rating": null}