{"id": 211253, "slug": "three-rooms-gameplay-prototype", "name": "Three Rooms Gameplay Prototype", "name_original": "Three Rooms Gameplay Prototype", "description": "<p>It’s not much to look at, but this game is to be a narrative adventure game that weighs speech and story against tedium and loneliness.  Right now it’s just a moving block and a talking robot.  I get that.  Present, though, are a majority (probably all, depending on time) of the mechanics of the final game.  You can move left and right with the arrow keys or A and D, you can open doors, interact with objects, and talk to our robot friend using enter. You can unlock the exit and leave the games’ three rooms after a few minutes, and right now there’s really no reason not to.  Future iterations will add, well, the story, and as many embedded narratives and tales as I have time for.  With this framework, and after figuring out the art-style and implementing a few animations we’ll be off to the races.  Hopefully.</p>\n<p>\n</p>\n\n<p>If I were on the other side of this game and happened to play it on itch or at a playtest, I don’t know if I’d really call it “good,” but given the context of its status as a gameplay prototype I’d think it functional.  The movement could be tighter, the interactions with items and so on likewise. It’s hard currently to discern the game’s “fun,” and I understand the significance of that shortcoming.  Mine is the problem of most narrative games, and that’s that everything needs everything else.  Narrative design is, for me, very holistic, and removing any one component, anything from sound to lighting, reduces the whole significantly.  It’s a gamble, but I think it’ll come together in the end.</p>\n<p>\n</p>\n\n<p>One of the chief struggles in getting this far has been finding time to work and using it well when I get it.  I am by no means the most efficient person in the world, and with limited time most days that posses a bit of a problem.  The solution then, has been to keep a constant to-do list.  The time involved in managing that list is not insignificant, I definitely spend a good amount of time just sitting at my computer figuring out what I need to do next, but doing so allows me to home in on what’s most essential to the game in that moment.  I’ve learned that often times if something is proving finicky to implement or is otherwise taking an exorbitant amount of my time, it’s probably not worth the effort.  That said, sometimes I realize that had I just put in an extra half-hour implementing a system or two to keep myself organized or to push through a certain problem, I’d be saving myself hours down the line.  It’s always a tough call.  By paying attention to the results of those calls though, I’m slowly but steadily refining my judgement. </p>\n<p>\n</p>\n\n<p>Another skill that has certainly contributed a lot to getting things done has been saying no to things.  I’m typically the kind of person who’s down for anything–a gallery opening, a lecture, a concert, a table-top RPG module, whatever.  And for the longest time I’ve seen saying no to those activities as nothing more than just that, missing an opportunity.  What I failed to realize was that saying no to those things is in fact opening another door. It’s cliche, sure, but it’s true.  It’s also true that staying in and spending a night gnashing teeth over UI isn’t the most fun thing to do, but honestly the satisfaction of progress is pretty damn rewarding.  Here’s hoping I can continue to convince myself of that.  </p>", "metacritic": null, "released": "2017-09-25", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/dd5/dd5d4c0331270ce735bd9f7b45902b1e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 7, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "Web"], "developers": ["jimi stine"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}