{"id": 21136, "slug": "procyon", "name": "Procyon", "name_original": "Procyon", "description": "It's the future! And humanity is, predictably, under attack by extraterrestrial forces. Lucky for us we have an experimental ship that's never before been flown that will surely...uh, possibly...well, implausibly be able to win the war! All we need now is a pilot or two.Key Features<ul><li>Fight through five increasingly-populated shoot-em-up stages <br/></li><li>Destroy a plethora of enemies (or, as we like to call them, \"potential explosions\") <br/></li><li>Switch between two distinct weapons on the fly: bullets for lots of damage over lots of space and a locking beam for concentrating on those hard-to-reach areas! <br/></li><li>Use your shields to zip unharmed through enemy attacks! <br/></li><li>Overcharge your weapons on the fly for even more destructive power! <br/></li><li>Original faux-orchestral soundtrack is like music to your ears! Because it IS music. For your ears. <br/></li><li>Multiple game modes, from the start-at-any-level normal mode up to \"I have but one life to give for my planet\" survival mode. <br/></li><li>Local co-op allows you and a friend (or even a complete stranger that you're willing to invite into your home, if you want) to team up and deliver double the delicious destruction! <br/></li><li>Support for playing in portrait orientation for a true top-down shmup experience! </li></ul>", "metacritic": null, "released": "2014-02-26", "tba": false, "updated": "2022-09-29T23:22:01", "background_image": "https://media.rawg.io/media/screenshots/e7a/e7adfddcbdda0d76a7f0188e5e24bc18.jpg", "website": "http://procyongame.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 113, "toplay": 1, "dropped": 1}, "playtime": 3, "achievements_count": 36, "ratings_count": 3, "suggestions_count": 311, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC"], "developers": ["Deadly Red Cube"], "genres": ["Action", "Indie"], "publishers": ["Deadly Red Cube"], "esrb_rating": null}