{"id": 21157, "slug": "3switched", "name": "3SwitcheD", "name_original": "3SwitcheD", "description": "Be careful! This Game is addictive! You won´t find more challenges, more speed, more fun and more treasures anywhere in the known Universe!<br/><br/><strong>3SwitcheD™</strong> combines classical Gameplay with fascinating new technologies. Find yourself in a new World arcade gaming. The brand-new 3D- and 3D-ET-Technology lifts the whole Game really in a new Dimension. Using the 3D-ET™-technology 3SwitcheD™ not only gives you fantastic real 3D looks, it works 3D. Using any connected camera the game will scan your face and you will be able to turn the view only by looking in the direction you want it to! This brand new Technology will give you a Gaming experience never imagined!<br/><br/>For all Players not using this feature the Game still provides fantastic looks and a bunch of challenges! A bunch of challenges is waiting for you, are you ready?Six highly addictive, vastly different and challenging modes set in an innovative 3D environment. Clear clusters and even shift gravity to rearrange gems for an all-new experience in puzzle and strategy gaming. Boost your high scores out of orbit with vertical, horizontal and even diagonal moves to blast those brilliant gems and gain access to the bonus levels!SIX DIFFERENT GAME MODES:<ul><li><strong>Snazzy Swap</strong>: Make those rows collapse and try to hit two with one strike.<br/></li><li><strong>Clearing Clusters</strong>: Kick those clusters cleverly to unlock rewarding bonus levels.<br/></li><li><strong>Falling Stars</strong>: Line up incredibly long rows until the core overloads.<br/></li><li><strong>Moving 4-ward</strong>: Test your gem swapping strategies and try the quadrature of diamonds, but make certain and form large clusters for a maximum payload of points.<br/></li><li><strong>Pathfinder</strong>: They just want to play… but those nasty little diamonds are blocking your path into the heaven of high scores! Show them who’s in charge!<br/></li><li><strong>Gravity Switch</strong>: Up is down, and down is up! Shift gravity as you please to strategize your way into unlocking bonus levels.</li></ul>KEY FEATURES:<ul><li>Unique 3D-ET™ Technology to control the perspective<br/></li><li>3D playing-field and fantastic animations<br/></li><li>Six totally different Game-Modes with unique challenges<br/></li><li>Choose between two music scores and two charming voices<br/></li><li>Track your score against others online!<br/></li><li>12 different languages</li></ul>", "metacritic": null, "released": "2012-03-29", "tba": false, "updated": "2023-02-12T00:17:32", "background_image": "https://media.rawg.io/media/screenshots/639/6392165155af1651ac6352e0a2050a8d.jpg", "website": "http://www.3switched.com", "rating": 0.0, "rating_top": 3, "added_by_status": {"yet": 8, "owned": 271, "dropped": 2}, "playtime": 3, "achievements_count": 0, "ratings_count": 5, "suggestions_count": 180, "game_series_count": 0, "reviews_count": 5, "platforms": ["macOS", "PC"], "developers": ["Reality Pump"], "genres": ["Casual", "Indie"], "publishers": [], "esrb_rating": null}