{"id": 21176, "slug": "deja-vu-ii-macventure-series", "name": "Déjà Vu II: MacVenture Series", "name_original": "Déjà Vu II: MacVenture Series", "description": "Welcome to <strong>Déjà Vu II</strong>- and to Las Vegas, the city that never sleeps – the city of excitement! Actually, you’ve already had plenty of excitement in the last 48 hours. You’ve been abducted by two thugs from Chicago, grilled by the notorious Las Vegas mobster, Tony Malone, knocked senseless, and tossed into a bathtub in a cheap Vegas hotel. It couldn’t’ possibly get any worse that this, could it!? The sequel to the groundbreaking game <strong>Déjà Vu: A Nightmare Comes True!</strong><br/><br/>The original Macintosh AND Apple IIgs versions are back, once again featuring gumshoe detective Ace Harding! Come see where the world of first-person adventures started and experience the classic 1940′s noir game as it appeared in 1988.Déjà Vu II: MacVenture Series Key Features<br/><ul><li><strong>Two Original Versions</strong>: You get BOTH the Macintosh and Apple IIgs versions, restored to their original glory!<br/></li><li><strong>First Person Adventuring</strong>: Over 50 game rooms of Noir adventure.<br/></li><li><strong>Drag and Drop</strong>: Utilize the classic, groundbreaking windows-based, drag and drop object system.<br/></li><li><strong>Puzzles</strong>: Tons of great puzzles.<br/></li><li><strong>Customized UI</strong>: Move the UI around to suit your needs and resize the retro graphics to full screen.<br/></li><li><strong>Save System</strong>: Save your progress at any time – create as many save points as you wish.</li></ul>", "metacritic": null, "released": "2015-01-26", "tba": false, "updated": "2022-08-05T10:10:30", "background_image": "https://media.rawg.io/media/screenshots/bb1/bb1e56a1577eaeb9cdb38029dbda9f17.jpg", "website": "http://www.zojoi.com/dejavuii_macventure/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 122, "toplay": 1}, "playtime": 3, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 328, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC", "macOS"], "developers": ["Zojoi"], "genres": ["Adventure", "Indie"], "publishers": ["Reverb Triple XP"], "esrb_rating": null}