{"id": 21173, "slug": "stained", "name": "Stained", "name_original": "Stained", "description": "Stained is a side-scrolling, platforming and combat action game set in an ancient, mysterious castle featuring detailed 3D environments with a continually changing game world. Events in Stained are triggered by breaking objects placed in and around the castle, and outcomes are determined by the combination of glass pieces that litter the ground, leading to a variety of experiences. Novel ways to break objects have to be thought of at times, which will keep the player guessing what the next puzzle will be. In any fight in the game victory is usually temporary, as defeated foes may form again, or reassemble to form entirely new ones. The gameplay is fully interactive and physics based – each character’s uncanny abilities have to be kept in mind to think of innovative ways to proceed through the game!Feature List<ul><li><strong>Explore Castle</strong> – Explore the world of sprawling castle, be aware of the hidious scourge ruling the castle and find your way to survive <br/></li><li><strong>Intense Action</strong> – Intense Action with color full stained glass creatures. Fight with plenty of Unique Stained Monsters and bosses at regular intervals. <br/></li><li><strong>Tangram Puzzles</strong> – stained offers variety of puzzles including in-game tangram puzzle editor. <br/></li><li><strong>Unique Weapons</strong> - Unique Weapons featuring different ways to shatter the glass. Hook your self to the walls and slide. <br/></li><li><strong>Random Experiences</strong> - Events are determined by the combination of glass pieces that litter the ground, leading to a variety of different stained monsters. <br/></li><li><strong>Temporary Victory</strong> - Victory is usually temporary, as defeated enemies can form again, or reassemble into entirely new enemies giving players a mentally stimulating game play. </li></ul>", "metacritic": null, "released": "2014-07-10", "tba": false, "updated": "2019-08-28T22:08:13", "background_image": "https://media.rawg.io/media/screenshots/dcc/dcc5e38a906168ab6df441f9b87367c6.jpg", "website": "http://stained-thegame.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 38, "toplay": 1}, "playtime": 3, "achievements_count": 9, "ratings_count": 0, "suggestions_count": 596, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["RealAxis Software"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["RealAxis Software"], "esrb_rating": null}