{"id": 21197, "slug": "the-musketeers-victorias-quest", "name": "The Musketeers: Victoria's Quest", "name_original": "The Musketeers: Victoria's Quest", "description": "Guide a young woman on her quest to become a musketeer in this thrilling arcade adventure! The classic tale of the musketeers gets a feminist twist as Victoria sets out to save her king and the country she calls home. As you guide her through 17th Century France, you'll rebuild the charming and picturesque land, perform tasks for the people you meet, and recruit help from fellow adventurers. Along the way, you'll steer a massive sailing ship through a pirate blockade, snatch treasure from the jaws of a dragon, and face a slew of enemy rogues!<br/><br/>As you explore caves, castles and more, you'll learn to craft the items you need from the resources you gather. You'll also acquire magic boosters that increase your speed and help you to beat the game's challenging levels. Skilled players can race against the clock to earn a host of trophies, while casual players can enjoy the game at their own pace. With lush visuals, a captivating story, and addictive time management gameplay, The Musketeers: Victoria's Quest offers an unforgettable saga of high adventure!<br/><br/>* Vibrant and colorful levels <br/>* Over eight hours of captivating gameplay<br/>* Make your own tools and other items<br/>* Cool boosters that give you an edge<br/>* Thrilling mini-gamesHow to play:<ul><li>1. Collect the resources you need.<br/></li><li>2. Clear and repair the path to the exit.<br/></li><li>3. Rebuild and upgrade buildings.<br/></li><li>4. Complete tasks for NPCs.</li></ul>", "metacritic": null, "released": "2015-08-20", "tba": false, "updated": "2019-08-28T22:08:12", "background_image": "https://media.rawg.io/media/screenshots/3e7/3e752c2b8cb7e77720c48a7d640074d3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 49, "dropped": 1}, "playtime": 4, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 301, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Alawar Entertainment", "New Bridge Games"], "genres": ["Adventure", "Strategy", "Simulation", "Casual", "Indie"], "publishers": ["Buka Entertainment"], "esrb_rating": null}