{"id": 21195, "slug": "7-wonders-ancient-alien-makeover", "name": "7 Wonders: Ancient Alien Makeover", "name_original": "7 Wonders: Ancient Alien Makeover", "description": "<p>The long-standing 7 Wonders series keeps getting better and better! The fifth installment, 7 Wonders: Ancient Alien Makeover, adds an entirely new game component, new Wonders and a new and exciting material – Alien Energy!<br />\nThe goal is still to construct exciting new Wonders by swapping same-colored runes to make matches of three or more to the tune of exploding bonuses. Make enough matches before time runs out to fill your arsenal with power-ups and the materials needed to complete your Wonders before your very eyes! As you complete each game board, bricks, water, gems, landscape, and now – Alien Energy! Excel and face bonus levels that take you deep below the earth’s surface to win materials like gold to adorn your Wonders! There is also, for the first time, a secondary game component to build a village! Mini-games rewards players with buildings and decorations to create their own village. Build all 7 Wonders and then unlock a magical 8th location, Nazca Valley! New game play and new Wonders await in Ancient Alien Makeover!<br />\nKey Features:<br />\n56+ addictive and challenging levels<br />\nExpanded play field<br />\nNew “alien energy” construction material!<br />\nNew village component<br />\n4 difficulty modes including “Zen” which has no timer.<br />\nPlayers earn a star rating for the completion of any Wonder. There is replay value to improving the star rating from a 2 to a 4 because it will lead to unlocking the Bonus Wonder and more things to decorate the village.<br />\nPlayers can earn a wide variety of achievements which are displayed in a trophy room.</p>", "metacritic": null, "released": "2012-10-23", "tba": false, "updated": "2021-09-06T15:26:25", "background_image": "https://media.rawg.io/media/screenshots/b23/b2314eb307224341aa4dad491aa8ce14.jpg", "website": "", "rating": 2.58, "rating_top": 3, "added_by_status": {"yet": 2, "owned": 308, "beaten": 5, "toplay": 2, "dropped": 2, "playing": 1}, "playtime": 5, "achievements_count": 26, "ratings_count": 11, "suggestions_count": 343, "game_series_count": 8, "reviews_count": 12, "platforms": ["iOS", "PC"], "developers": ["MumboJumbo"], "genres": ["Strategy", "Arcade", "Casual", "Puzzle"], "publishers": ["MumboJumbo"], "esrb_rating": null}