{"id": 212, "slug": "plague-inc", "name": "Plague Inc.", "name_original": "Plague Inc.", "description": "<p>Can you infect the world? Plague Inc. is a unique mix of high strategy and terrifyingly realistic simulation.<br />\nYour pathogen has just infected &#39;Patient Zero&#39;. Now you must bring about the end of human history by evolving a deadly, global Plague whilst adapting against everything humanity can do to defend itself.<br />\nBrilliantly executed with innovative gameplay and built from the ground up for iPhone &amp; iPad, Plague Inc. evolves the strategy genre and pushes mobile gaming (and you) to new levels. It’s You vs. the world - only the strongest can survive!<br />\n◈◈◈ #1 top game globally with well over a billion games played ◈◈◈<br />\nPlague Inc. is a global hit with almost a million 5 star ratings and features in newspapers such as The Economist, New York Post, Boston Herald, The Guardian and London Metro!<br />\nThe developer of Plague Inc. was invited to speak at the CDC in Atlanta about the disease models inside the game!<br />\n▶ “The game creates a compelling world that engages the public on serious public health topics” – The Centers for Disease Control and Prevention<br />\n▶ “Best Tablet Game” - New York Daily News<br />\n▶ “Plague Inc. will snag your attention in all the right ways and keep it there” - Touch Arcade<br />\n▶ “No denying Plague Inc.&#39;s high-level of quality” - Modojo<br />\n▶ “Plague Inc. should not be as much fun as it is” – London Metro<br />\n▶ “Will leave you hoping to destroy the world, all in the name of a bit of fun” – Pocket Lint<br />\n▶ “Plague Inc.&#39;s gameplay is infectious” - Slide to Play<br />\n▶ Winner – “Overall Game of the Year” – Pocket Gamer<br />\n▶ “Killing billions has never been so fun” – IGN<br />\n◈◈◈<br />\nFeatures:<br />\n● Stunning retina graphics with a highly polished interface (Contagion guaranteed)<br />\n● Highly detailed, hyper-realistic world with advanced AI (Outbreak management)<br />\n● Comprehensive in-game help and tutorial system (I am Legendarily helpful)<br />\n● 12 different disease types with radically different strategies to master (12 Monkeys?)<br />\n● Full Save/Load functionality (28 Saves Later!)<br />\n● 50+ countries to infect, hundreds of traits to evolve and thousands of world events to adapt to (Pandemic evolved)<br />\n● Full game support for scoreboards and achievements<br />\n● Expansion updates add the mind controlling Neurax Worm, the zombie producing Necroa Virus, Speed Runs and real life Scenarios!<br />\nLocalised in English, German, Spanish, Brazilian Portuguese, Italian, French, Japanese, Korean, Simplified Chinese, Traditional Chinese and Russian. (more coming soon)<br />\nP.S. Give yourself a pat on the back if you got all the themed literature references!<br />\nSpecial sale price to celebrate being one of the most popular paid iPhone games ever!<br />\n◈◈◈<br />\nLike Plague Inc. on Facebook:<br />\nhttp://www.facebook.com/PlagueInc<br />\nFollow me on Twitter:<br />\nwww.twitter.com/NdemicCreations</p>", "metacritic": 80, "released": "2012-05-26", "tba": false, "updated": "2024-02-28T18:02:50", "background_image": "https://media.rawg.io/media/screenshots/0f8/0f8f34410d8f86a5c528a421b2429485.jpg", "website": "", "rating": 3.97, "rating_top": 4, "added_by_status": {"yet": 3, "owned": 37, "beaten": 133, "toplay": 5, "dropped": 79, "playing": 9}, "playtime": 6, "achievements_count": 0, "ratings_count": 144, "suggestions_count": 137, "game_series_count": 1, "reviews_count": 146, "platforms": ["Android", "iOS"], "developers": ["Ndemic Creations", "Miniclip.com"], "genres": ["Strategy", "Simulation"], "publishers": ["Ndemic Creations"], "esrb_rating": null}