{"id": 212071, "slug": "gun-runner-itch-poik007", "name": "Gun Runner (itch) (poik007)", "name_original": "Gun Runner (itch) (poik007)", "description": "<p>In Gun Runner, the player starts with no money and no loyalty for any faction (BLU, RED, GRN and YLW). BLU offers a free mission, so the player starts with that. By \"running\" bullets across the levels. These levels are composed of an endless series of three lanes where enemies come at the player. These enemies have various abilities depending of what colors they are and destroying them gives money for the correpsonding faction. The player also encounters Loyalty Boxes that are worth loyalty points (which are basically experience points). When the player runs out of bullets either by shooting them all or by getting hit by enemies, the level ends.</p><p>In order to progress through the levels, players start with a small gun with average attributes - fire rate, damage, reload speed, ammo capacity and special power (a multiplier used by some special skills) - and by leveling up the four factions, the players get better weapons that all fit some archetype, shotgun, machinegun, rocket launchers and so forth. The way upgrades work is that most of them are a choice between two things - either you get 20% more reload speed or you get a chance to automatically reload when you kill enemies, for instance - and some of them are purchasable multiple times and grant a stacking effect - bonus damage, for instance.</p><p>In order to 'finish' the game, the player has to get to level 10 with each faction, the way to do that is either by spending money to buy loyalty points or just to run a lot of times and shoot plenty of loyalty boxes. While running for various factions, players might encounter more enemies of a specific group - for instance, BLU is at odds with RED, so many RED enemies will be present when running for BLU. Everything about all factions was tailored to give them a style and a personality, from enemies to upgrades.</p>", "metacritic": null, "released": "2015-08-28", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/3f2/3f2a89b646e9c0b8481c7c3d0b9881a2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 126, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["poik007"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}