{"id": 212226, "slug": "space-ex", "name": "Space Ex", "name_original": "Space Ex", "description": "<p><strong>Story script</strong></p><p>You are an aspiring astronaut who is hoping to be picked for a space ex around our solar system.<br/></p><p>If you prove that you are a worthy astronaut for the mission you have dreamed about since your childhood, you will be sent on a rollercoaster ride around the solar system. Not everything will go as smoothly as your space ex team would hope.</p><p>P.S. I wish you all the best on your adventures sir.</p><p><strong>Rationale behind the game:</strong><br/></p><p>I chose the Maze style of game because of its simplicity, its addictive play style and the ability to add a relatively deep story line to the game. </p><p>These three elements make a good basic game for both the creator and the players.</p><p>Firstly the simplicity. The ease of making maze games allows the creator to focus on the more important aspects such as the game flow. I was able to make all the sprites, the objects, the actions, the background and the level design all in one night and now I can dedicate the rest of my time on the game play.</p><p>Secondly its addictive playstyle. Even why I am debugging the game I lose track of time and just keep playing, such a game is much more fun to play than any other. My family and friends have also tried out this game and I have to watch them play for half an hour because of their persistent attitude towards the game.</p><p>Finally, the deep storyline. I am focusing on the rest of the story line as I believe that this can make or break a game. The reason I believe that the storyline is so critical is because without one a game feels kind of pointless to play. A good storyline will make the player want to get to the end and will immerse the player in the game.</p>", "metacritic": null, "released": "2016-09-16", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/62f/62f9e993bb68bfe8f11e6eb1260f524c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 33, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["HSSproducer"], "genres": [], "publishers": [], "esrb_rating": null}