{"id": 21225, "slug": "airport-madness-time-machine", "name": "Airport Madness: Time Machine", "name_original": "Airport Madness: Time Machine", "description": "You are an air traffic controller at a small grass airfield in 1925.  Watch the airport develop over time, into a major international airport in 1970.<br/><br/>Airport Madness: Time Machine's theme goes back to the core of what made Airport Madness fun in its beginning in 2008. It offers an airport that grows up over time. We take you back to 1925 and put you into the control tower (Although radio-equipped towers did not start appearing in the United States until 1930, controlled fields began to appear in the United Kingdom as early as 1921).<br/><br/><br/><br/>As the game progresses, you will witness the airport grow from just a tiny grass field in 1925, to a multi-runway wartime airfield in 1944, to a giant sprawling airport in 1970, with passenger jets and several terminal buildings. Witness Lindbergh, the breaking of the sound barrier, the first passenger jet, and the birth of the Boeing 737.<br/><br/><br/><br/>Imagine what it might have been like to witness aviation in 1925. After WW1 there were many fighter pilots looking for something to do with their flying skills. Many of them created air shows where they would perform stunts, while others offered paid rides to the public. In 1925, flying mail services became very popular, and the world saw such aircraft as the Curtis Jenny, Ford Tri-motor, and Boeing Model 40. There was some passenger travel, although this did not truly begin developing until the late depression. In 1940 WW2 came along, giving aviation a giant boost. It wasn't until after WW2 that the passenger travel boom began. This game is an explosion of beautiful artwork, which was our top priority in the development of this game, as it is essentially a walk through time, and therefore demanding of \"eye candy\". It is much more \"game\" than earlier versions in it's structural design. There are 60 levels, each with a duration of 5 to 15 minutes, depending on your ability. After a level is unlocked, it can be revisited at any time.<br/><br/><br/><br/>Although most of AMTM is based within the 20th century, Airport Madness takes you back to the year 1802, with a steampunk theme! Witness aviation the way it wasn't. At some point during your progression through history, the time portal will offer you the opportunity to visit a fantasy version of 1802, where we get to imagine what aviation might have been like, had Da Vinci's early drawings of flying machines actually been built.<br/><br/><br/><br/>There is also the opportunity to zoom way ahead, to 2173.  What will future airports look like? Our concept is basically what we feel is obvious. Airplanes will become faster and larger. Airports will become more efficient. What we show you is an airfield where things happen fast. Planes move at ludicrous speeds, and decisions must be made quickly. Thousands of people are moved in and out of the field every minute.", "metacritic": null, "released": "2015-09-18", "tba": false, "updated": "2019-08-28T22:08:11", "background_image": "https://media.rawg.io/media/screenshots/c0e/c0e49355f0b1f4eed6be8143b982d22b.jpg", "website": "http://bigfatsimulations.com/game/airportmadnesstimemachine", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 109}, "playtime": 4, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 400, "game_series_count": 0, "reviews_count": 1, "platforms": ["macOS", "PC"], "developers": ["Big Fat Simulations"], "genres": ["Adventure"], "publishers": ["Big Fat Simulations"], "esrb_rating": null}