{"id": 21226, "slug": "cabelas-trophy-bucks", "name": "Cabela's Big Game Hunter Trophy Bucks", "name_original": "Cabela's Big Game Hunter Trophy Bucks", "description": "<p>Your Trophy Buck is Waiting!</p>\n<p>Experience fast paced hunting action in pursuit of record trophy bucks across 24 state and provinces in North America. Gameplay starts at the most critical and exciting parts of each hunting mission where you are immediately presented with a challenge. Paired with incredibly realistic gameplay and North America's most popular deer, waterfowl, upland birds, small game and varmint species, you will be able to hunt for animals in places that most hunters could only dream of experiencing in a lifetime. Your well-honed hunting instinct, keen observation and quick decision making will be essential in your quest to become the ultimate North American hunter!</p>\n<ul>\n<li>Hunt 11 species of trophy deer including Whitetail, Rocky Mountain Mule Deer, Sitka, Desert Mule Deer, Columbian Black Tail and more!</li>\n<li>Travel to North America's top hunting regions across 24 states and provinces ranging from the Sonoran Desert in Mexico to Northern Canada.</li>\n<li>Experience 96 fast-paced hunting missions in levels that are focused and defined and facilitate a specific hunting scenario.</li>\n<li>All new hunts include calling in wild turkeys, scaring up upland birds with a hunting dog and long range varmint hunting.</li>\n<li>Achieve 5 career hunting slams for deer, turkey, waterfowl and more!</li>\n<li>You'll need all the help you can get, including skill upgrades and power-ups, to acomplish your mission.</li>\n<li>Visit the Cabela's Gun Library to select one of sixteen different realistically modeled weapons.</li>\n<li>Compete in 24 shooting competitions based on real-life tournaments.</li></ul>", "metacritic": null, "released": "2007-10-02", "tba": false, "updated": "2023-12-31T19:37:43", "background_image": "https://media.rawg.io/media/screenshots/703/703527a897f57b96d612f45d8803b0f4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 31, "toplay": 1, "dropped": 2}, "playtime": 1, "achievements_count": 31, "ratings_count": 2, "suggestions_count": 602, "game_series_count": 18, "reviews_count": 2, "platforms": ["PC", "Xbox 360", "Wii"], "developers": ["Magic Wand Productions", "FunLabs", "Magic Wand"], "genres": ["Action", "Shooter", "Sports", "Arcade"], "publishers": ["Activision Blizzard", "Activision Value Publishing"], "esrb_rating": null}