{"id": 21232, "slug": "top-hat", "name": "Top Hat", "name_original": "Top Hat", "description": "Top Hat is a 2D action adventure platformer, just like old NES games. If you are tired of “games” in which you get hit by heavy machine gun and grenades, and all you need to do is cover behind the wall to replenish HP, then Top Hat is a perfect game for you!<br/>The story is about a golden top hat that has been stolen from our Hero. Now he has to to get it back. On his adventure the Hero will visit seven worlds, each one with his own graphic style. <br/><br/>The hero will meet many kinds of NPCs:<ul><li>we will help a guy with lost wallet, <br/></li><li>drink many bottles of rum with a pirate captain, <br/></li><li>smoke some strange tobacco with an old guy in the desert </li></ul>and more! In the game we have seven kinds of weapon. Some are meant for killing and some for changing the game mechanics e.g. <ul><li>a platform gun, which shoots platforms, of course on which we can jump,<br/></li><li>a freeze gun which, of course, freezes our enemies.</li></ul>The game is meant to be hard and addictive, so if you were playing much on NES as a child it's a perfect choice for you. <br/><br/>Game Features:<br/><ul><li>Seven worlds, each with 3 levels and a boss to fight (from fourth stage each level is divided on two parts).<br/></li><li>Each stage contains its own graphics style.<br/></li><li>Seven kinds of weapons, for example a platform gun which shoots platforms that you cam jump on.<br/></li><li>Mini quests.<br/></li><li>Funny cutscenes and other stuff.<br/></li><li>Awesome chiptune soundtrack made by Jakim.<br/></li><li>ACHIEVEMENTS. YAY.<br/></li><li>WE WILL PLAY ON YOUR NOSTALGY FEELINGS, BRO.<br/></li><li>Challenging. Really. </li></ul>", "metacritic": null, "released": "2014-07-31", "tba": false, "updated": "2022-09-29T23:22:11", "background_image": "https://media.rawg.io/media/screenshots/977/977c2f0c4206c7c527dc4b3ded8467e2.jpg", "website": "http://www.n94games.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 110, "dropped": 2}, "playtime": 1, "achievements_count": 81, "ratings_count": 2, "suggestions_count": 224, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["N94Games"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["PlayWay", "N94Games"], "esrb_rating": null}