{"id": 212376, "slug": "the-mountain-joel-mehonoshen", "name": "The Mountain (Joel Mehonoshen)", "name_original": "The Mountain (Joel Mehonoshen)", "description": "<p>Artist's statement:</p><p>The mountain is a game about overcoming adversity; this adversity is something many of us encounter throughout our lives I'm talking of course about anxiety. This game delves into the idea of how anxiety gets in the way of our goals physically and mentally, it also touches on the idea of overcoming this anxiety through the use of perseverance. Anxiety can take many shapes and forms and as such in this game they take very abstract forms for the environment the player is in, the hurdle for example is a metaphor for physical anxiety as many people during their schooling and at other times have found themselves feeling anxious about their physical performance or appearance. The other hazards are the spider, scribble, ghost and stop sign. The spider and ghost serves to ignite ones fears as they restrict or disabilities the players ability to move in some way when they touch them, I chose these 2 things as they are easily relatable to the player as many people suffer from fears of these things. Next is the stop sign, this attempts to get the players to feel doubt in themselves, it attempts to subconsciously tell the player to stop and that they can't make it as when the player collides with it their movement is slowed. Lastly is the scribble, the most obscure of the hazards it is meant to get the player to feel anxiety as in game it represents an anxiety attack as it looms towards the player and the screen becomes obstructed and the background changes. All of these hazards together represent anxiety as a whole and they attempt get the player to feel this as impede the player's progress towards their goal. I chose the environment as a mountain as I believed this would be easiest to identify as a challenge or goal the player is striving towards. The player's dialogue alerts them to this goal at the very start of the game saying \"I don't think I can climb that :(\", this also serves to dissuade the players confidence during these starting portions. However as the player progresses their dialogue changes to be more confident saying things such as \"I think I can make it :)\" this serves to get the player to strive to persevere.</p>", "metacritic": null, "released": "2016-07-27", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/ee3/ee32c1e1f528bdf34e5f88583b313bc8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 5, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Joel Mehonoshen"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}