{"id": 212390, "slug": "pandatyphoon", "name": "Pandatyphoon", "name_original": "Pandatyphoon", "description": "<p>The main target audience are both boys and girls in high school who would like to spend around twenty minutes per day to play games. And the game is designed to be played on PCs and mobile devices, such as laptops and smartphones.</p>\n<p>This is a sports and strategy game that lets users control the Panda to deliver pizzas within the whole campus. And they need to avoid typhoons and try to collect coins at the same time. The speed of the skateboard will increase at every level to make the game more and more thrilling. The final goal of this game is to successfully deliver enough pizzas to get enough coins so that the Panda can buy a new car at the end.</p>\n<p>What’s more, one important factor of this game is that the users may come across with bullying scenes when they are skateboarding. If they choose to stop and prevent bullying happening, they will lose certain amount of coins because of costing more time for delivering pizzas. But when they achieve the highest level, users will gain a big amount of coins depended on how often they help with others.</p>\n<p>The special part of this game is the hidden factor could affect the game's result, which makes users to think about their previous behaviors again and learn from them. The game is in cartoon style with colorful and simple design. It also offers Help page and sound feedback. And because the game is quite thrilling and playful with different levels, it would make users want to play it and stick to it. Also, since the school bullying towards races happens a lot, the game could help students change their attitudes towards this before entering society, which is significant and meaningful.</p>", "metacritic": null, "released": "2018-05-08", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/898/8984b9411141b785fb24eb1079e5118b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 5, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Xanthe"], "genres": ["Sports"], "publishers": [], "esrb_rating": null}