{"id": 2125, "slug": "respawnables", "name": "Respawnables", "name_original": "Respawnables", "description": "Run, shoot, laugh and respawn!<br/>Join the fun with this trigger-happy, action packed, third person shooter.<br/>Play Offline or Online for FREE for endless hours of fun: complete challenges, join a team, or just kill them ALL! <br/>…you are NOT expendable, you are… RESPAWNABLE!<br/> <br/>“Win or lose, Respawnables is still an incredibly fun and addicting shooter” - 148Apps.com<br/> <br/>“Respawnables is a perfect fit for smartphones and tablets” - Modojo.com<br/> <br/>“Action packed, fast paced gameplay in Respawnables” - FAAD<br/> <br/>---Offline Missions Mode ---<br/>- More than 185 single missions to complete<br/>- Fast paced gameplay for brisk fun <br/>- Short battles for entertainment on the go<br/><br/>--- Online Multiplayer Modes ---<br/>- Seamless connection and matchmaking<br/>- Two modes: Free For All &amp;amp; Team VS <br/>- WiFi and 3G/4G connections enabled <br/><br/>--- Make it your own ---<br/>- 60+ customization items with attributes<br/>- 30+ killer weapons<br/>- Progressive skill tree<br/>- Gadgets and boosters<br/>- Various maps<br/><br/>--- More Awesome Features ---<br/>- Superb quality 3D cartoon style<br/>- Colorful retina display graphics<br/>- Ultra smooth controls <br/>- Fast paced with an amazingly funny vibe<br/>- Offline &amp;amp; Online playing modes<br/>- Lots of mix-&amp;amp;-match content to unlock<br/>- Sharing via Twitter or Facebook available <br/>- Game Center Leaderboards &amp;amp; Achievements <br/>- Log in to Game Center and/or Facebook to play with your friends <br/>- Please note - <br/>- This is a universal App and requires iOS 5.1.1 or later <br/>- Works with iPhone 5s, iPhone 5c, iPhone 5, iPhone 4s, iPhone 4, iPod touch (5th &amp;amp; 4th gen) and the iPad Air, iPad Mini with Retina display, iPad Mini, New iPad with Retina display, iPad 2 &amp;amp; iPad <br/>- Log in with your Game Center account to play on multiples devices and for online profile support<br/>- This game is free to play, but extra content can be purchased with real money, to restrict in-app purchases adjust the settings on your device<br/>- Supports Game Controllers made for iPhone and iPod touch. Game Controller support requires iOS 7 or later and is compatible with iPhone 5, iPhone 5s, iPhone 5c, and iPod touch (5th generation)<br/><br/>----- MORE CONTENT COMING SOON! -----", "metacritic": null, "released": "2012-12-13", "tba": false, "updated": "2019-10-22T14:27:58", "background_image": "https://media.rawg.io/media/screenshots/bfc/bfcfbd7b5d72e312b3f1c181077ebd17.jpeg", "website": "http://www.digital-legends.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3, "dropped": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 182, "game_series_count": 0, "reviews_count": 2, "platforms": ["iOS"], "developers": ["Digital Legends Entertainment"], "genres": ["Action", "Adventure"], "publishers": ["Digital Legends Entertainment"], "esrb_rating": "Teen"}