{"id": 212602, "slug": "ratatatatouille", "name": "Ratatatatouille", "name_original": "Ratatatatouille", "description": "<p><strong>Top Down Shooter, but you can't pull the trigger!</strong></p>\n<p>Jaque Jones is a war veteran, who lost everything. His woman, his dog, his passion... and now his sanity? </p>\n<p>The only things that always stay by  his side are his loyal weapons. And boy, are these weapons loyal! <br/>They have so much respect for Jaque Jones that he doesn't even need to pull the trigger, now. They shoot for him. <br/></p>\n<p>Out of respect of course! </p>\n<p>Now, as his life is falling apart again and even his faithful food turned against him it's time for Jaque and his weapons to fight evil once again. </p>\n<p>Last year our team developed Orbital Punch for Game Makers Toolkit Game Jam, this year it's Ratatatatouille!<br/></p>\n<p><strong>Controls: </strong></p>\n<p>Waliking: wasd / left stick<br/></p>\n<p>Aiming: mouse / right stick<br/></p>\n<p>Swapping weapons: spacebar / right button</p>\n<p><strong>Good to know</strong><br/></p>\n<p>The levels are all procedual generated. Which we think is awesome, to be honest. We actually wanted to make a cooking game and then this happened. We also wanted to call Jaque \"Cooking Papa\", but then decided against it and I actually don't even know why, \"Cooking Papa\" would have been an awesome name. <br/></p>\n<p>As you can't control when the weapons shoot we wanted to make the UI as clear as possible. We also crafted our intro to show that you can't actually pull the trigger yourself. <br/></p>\n<p><strong>Known Bugs:</strong></p>\n<p>1. If you  get a Game Over Screen you need to restart the game. Sorry for that!</p>\n<p>2. The waves aren't balanced yet. There are a lot of potatoes at the beginning, but we have french fries and chilis too! Try to survive, we know you can!</p>\n<p>3. Some outer walls can be destroyed and enemies get out of bounce. Good news: YOU can get out of bounds TOO! Grab 'em, before they grab you!</p>\n<p>4: If you pause the game with a controller you need to press the \"spacebar\" afterwards. Don't ask why, we have no idea, but if you exit the pause menu with the \"start\" button on your controler you don't get any input. Seems like a useless feature.</p>\n<p>5. Just let the credits sit for 5 seconds. It seems like you're stuck, but you're not. DON'T TOUCH ANYTHING! Just read and enjoy and after 5 seconds you return to the title screen. </p>", "metacritic": null, "released": "2018-09-02", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/557/557f0b76a4b51b5bb5f48261c27cd860.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 65, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Lunz Jams"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}