{"id": 212709, "slug": "square-dash-4appdev", "name": "Square Dash (4appdev)", "name_original": "Square Dash (4appdev)", "description": "<p>Do you have what it takes to make your way through these obstacles and reach your goal? Can you jump your way past all the spikes and complete every level to be on the top? Embark on this thrilling saga and prove your worth by reaching the top! Get Square Dash now!<br/><strong>Game Description:</strong><br/>Square Dash is a challenging and thrilling tap game, which is based on a journey of a box named 'Square', making its way through different obstacles in the game. Take control of 'Square', play 9 different levels, make high scores, share your top score and beat your friends!<br/><strong>Game Features:</strong><br/></p><ul><li>Play an arcade style game and make your way through different obstacles to reach the end.</li><li>Challenge yourself by clearing all levels with increasing difficulty.</li><li>High-sensitivity helps you to tap on the screen to help your character jump its way past the spikes. </li><li>Play with a single hand while doing your regular chores to pass your time. </li><li>Play 9 levels to have a different experience each time you step into the game.</li><li>Get a hold of the addictive game play and play it anywhere. </li><li>Share your scores with your friends and become the Master of Square Dash!</li></ul><p>So, are you ready to become the master of square dash, and beat your friends at their own game? What are you waiting for then? Download Square Dash today and make your way through an action-packed and fun-filled ride!</p>", "metacritic": null, "released": "2016-08-27", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/377/3773419913fe2d689fe9f4cbb9f4b12c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 70, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["4appdev"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}