{"id": 21273, "slug": "sacraboar", "name": "Sacraboar", "name_original": "Sacraboar", "description": "<p>Sacraboar is an RTS game in which players have to capture their opponent's boar trophy. Featuring an intuitive and easy to use resource management system, the game offers fast-paced game play without lengthy and tedious construction phases.</p><br/>\n<p>During the game players can build towers, which either give them access to powerful spells or increase their budgets for producing units.</p><br/>\n<p>Get yourself some awards in league and cup competitions as well as bronze, silver, and gold medals in over 80 challenging missions and battle it out against human opponents via LAN.</p>\n<ul>\n<li>Multiplayer via LAN</li>\n<li>League in four difficulties (Bronze, Silver, Gold, All Star)</li>\n<li>Cup in four difficulties (Bronze, Silver, Gold, All Star)</li>\n<li>89 Missions, each one in three difficulties (Bronze, Silver, Gold)</li>\n<li>6 additional tutorial missions</li>\n<li>Replays (record your matches and share them with your friends)</li>\n<li>18 difficulties in Skirmish mode (from very easy to ultra-hard)</li>\n<li>Lots of different game modes that can be combined</li>\n<li>Easy to use code system for sharing cool game settings</li>\n<li>Test Center for testing units and spells</li>\n<li>Encyclopedia with all information about units, spells, game modes etc.</li>\n<li>Trophy Room that lists all your achievements</li>\n</ul>", "metacritic": null, "released": "2009-11-06", "tba": false, "updated": "2023-05-01T14:10:58", "background_image": "https://media.rawg.io/media/screenshots/b0d/b0d495fecf7813744d567ae766a5edee.jpg", "website": "http://www.sacraboar.com ", "rating": 0.0, "rating_top": 1, "added_by_status": {"yet": 7, "owned": 303, "beaten": 1, "dropped": 1}, "playtime": 1, "achievements_count": 51, "ratings_count": 5, "suggestions_count": 522, "game_series_count": 0, "reviews_count": 5, "platforms": ["PC"], "developers": ["Makivision Games"], "genres": ["Action", "Strategy", "Indie"], "publishers": ["Makivision Games"], "esrb_rating": null}