{"id": 21286, "slug": "playing-history-2-slave-trade", "name": "Playing History 2 - Slave Trade", "name_original": "Playing History 2 - Slave Trade", "description": "<strong>The Playing History </strong>game series revolves around experiencing engaging and personal stories set in exhilarating points in world history. The series have won the category of ‘best learning game’ in Europe. The series puts the student in the middle of important and interesting points in history.<br/><br/><strong>Why play Playing History?</strong><br/>To gain the opportunity to take part in history, within in a living breathing world. You will be able to learn about historic events that they cannot alter – instead, they witness how the historic events altered humanity as a whole. The learning process is autonomously conveyed throughout the story of the game as it progresses, this occurs through decisions and actions taken by the player throughout the course of the game. This kind of interaction is a unique learning method, which encourages the player to relate to the world and actively seek out knowledge.<br/><br/><strong>Slave Trade: </strong>Travel back in time to the 18th century and witness the horrors of the trans-Atlantic slave trade firsthand. In this episode, you will be working as young slave steward on a ship crossing the Atlantic. You are to serve the captain and be his eyes and ears – reporting any suspicious activities is your duty. But what do you do, when you realize that your own sister has been captured by the slave traders?<br/>Target audience: 11-14 years old.<br/><br/><strong>UPDATE: [/b The game and trailer has been updated. Slave Tetris has been removed as it was perceived to be extremely insensitive by some people. This overshadowed the educational goal of the game. Apologies to people who was offended by us using game mechanics to underline the point of how inhumane slavery was. The goal was to enlighten and educate people - not to get sidetracked discussing a small 15 secs part of the game.</strong>", "metacritic": null, "released": "2015-08-27", "tba": false, "updated": "2019-09-17T13:30:23", "background_image": "https://media.rawg.io/media/screenshots/bf8/bf84bc22ff05c60423b39f490c9a5f98.jpg", "website": "http://www.playinghistory.eu/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 106, "toplay": 1, "dropped": 1}, "playtime": 1, "achievements_count": 8, "ratings_count": 3, "suggestions_count": 339, "game_series_count": 1, "reviews_count": 3, "platforms": ["PC", "macOS"], "developers": ["Serious Games Interactive"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Serious Games Interactive"], "esrb_rating": null}