{"id": 212838, "slug": "shield-color", "name": "Shield Color", "name_original": "Shield Color", "description": "<p>Shield color is a 2D Arcade game and playable for all ages, even if your kid under 13 or bigger. Shield color designed and made to be simple and easy to play and understand the game and the levels, and we made sure to make and keep the game fun and challenges, So we have design the game with multiple game modes such as mode for the levels game area, mode for \"score challenges\", Colored Game mode and Shapes game mode, etch one of these game modes is different than the other.</p><p>So in the center of the game area there are a big circle witch this is the circle that the player must defense it with the shield color and must choose the correct color to change the shield color and Protect the big circle because if you choose the wrong color or miss any behind then the game over will show and will loss the round. </p><p>Backing to the first game mode \"Levels\", So in levels mode will start with easy game a play and need to destroy the coming shapes, witch in the first level only 5 shapes will come and must destroy theme by clicking and choosing the same shape color to change the shield color and make the shape destroyed, and when moving to the next level \"Level 2\", will not come only 5 shapes it will increased etch time level up by one. And so for the next level 3, 4, 5…, etch time will increase the coming shapes by one more. </p><p>But the game can't be challenges if only one more shape will come and to destroy it, So the game programed that when the player destroy an shape the next shape speed will increase letter bit and so the game get harder litter more etch time, And then the started shape speed will not be same as the last shape speed, So by that will keeping the game not at the same all the time but to keep it challenges and get harder etch time. </p><p>As also the shape that are coming will be the same all the game but every five levels up will unlock different shapes and the player can unlock about up to 50 shapes within 250 levels. Not just the shape will changed also every 5 levels the colors will changed and will get new four colors for etch five levels up for the 250 level.</p><p>For regards to the second game mode \"Score Challenge\", no levels will be shown and will not start with an easy game play but will start with the normal speed and etch shapes has destroyed the next shape speed will increase but this game mode is harden than the levels, and this part will challenge your friends with your max effort that will gave.</p><p>The third mode of the game will not see any levels or four different colors to choose but will have to save the big circle with anther method not touching the color but hit and drag with the finger to get line and make this line cut the coming shapes that don't have the big circle color because if you tried to destroy shape that have same big circle color you will lose some point and will reduce your high score. So keep awake and destroy only the needed. </p><p>Finally the shapes game mode, you will check yourself how can you be fast to match the coming shapes by rotation the big circle with your fingers and let the correct shape hit the big circle. </p><p>So you need to keep two things in mind to win the round:</p> <ul><li>1-Keep awake and don't miss any behind.</li> <li>2-Be faster as you can to jump and ne the super shield color. </li></ul>", "metacritic": null, "released": "2016-06-22", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/f86/f863f7cd98cc658b1ce31e1cc5b20ede.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 88, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "Android"], "developers": ["adham394"], "genres": ["Action"], "publishers": [], "esrb_rating": null}