{"id": 21295, "slug": "dark-shadows-army-of-evil", "name": "Dark Shadows - Army of Evil", "name_original": "Dark Shadows - Army of Evil", "description": "<strong>Dark Shadows - Army of Evil is a Classic Medieval Fantasy First Person - Hack and Slash Game with a kind of old school look. </strong><br/><br/>StorySeptember 1362:<br/><br/>An army of evil, named \"Dark Shadows\", have been ravaging the country like a plague of locusts for over a year and are frightening the people with their scary get-up. Most people still think they are monsters. But they are only in disguise. While you were away these monsters stormed the castle. A woman named Katerina has been kidnapped. It is not just any woman. You are in love with her. They’ve also taken all the gold. All the taxes. And weapons! You are the only one who can help Katarina. You must hurry and follow them before they do something to her. <br/><br/>GameplayClassic Hack and Slash Game:<br/><br/>The player fights his way through 19 levels. Various weapons will be available. They can be found in different levels. Everything begins moderately and you need to find some keys and a sword. After the first level the game turns into a hack'n slash game. Most of the time, the player has to fight against enemies. But he has to do also other little things and must solve certain problems. You need keyboard and mouse. <br/><br/>FeaturesThis game is an indie game with a kind of old school look.<br/><br/>It is also supporting SSAO and Bloom Shader effects.<br/><br/><ul><li>    19 Levels and 18 Weapons<br/></li><li>    ​Single Player<br/></li><li>    3D Realtime Cinematic Blood Splatter Scenes</li></ul>", "metacritic": null, "released": "2014-03-11", "tba": false, "updated": "2023-12-18T17:51:42", "background_image": "https://media.rawg.io/media/screenshots/e8f/e8f133c2814557677c6230c16f9bad93.jpg", "website": "http://www.dark-shadows-army-of-evil.com", "rating": 1.29, "rating_top": 1, "added_by_status": {"yet": 2, "owned": 286, "dropped": 5}, "playtime": 4, "achievements_count": 0, "ratings_count": 7, "suggestions_count": 540, "game_series_count": 0, "reviews_count": 7, "platforms": ["PC"], "developers": ["Burian Media Enterprises"], "genres": ["Action", "RPG", "Indie"], "publishers": ["Burian Media Enterprises"], "esrb_rating": null}