{"id": 2132, "slug": "chambara", "name": "Chambara", "name_original": "Chambara", "description": "Chambara's color-based stealth mechanic lets you blend completely into parts of the environment. Hide in plain sight. Leap, sneak, and dash with both speed and style. Strike hard and then fade away before your position is revealed. <br/><br/>Play locally in 1-on-1 or 2-on-2 matches across 9 varied maps with their own selectable color schemes. Build tournament playlists, or jump right into a random map for instant action. Use a shuriken to stun from long range. Build the best strategy for each map's unique features. Show off and customize your fighting bird with fanciful hats and weapons, but remember: style comes with a cost. The bigger your hat, the easier it is for opponents to find you.<br/><br/>Duel alongside friends in a world like you've never seen before. <br/><br/>Winner of the 2015 BAFTA Ones to Watch Award, IGF Nominee for Best Student Game, Official Selection IndieCade 2015, Dare ProtoPlay finalist, and finalist in the E3 College Game Competition. Featured at EVO 2016 Championship Series Indie Showcase. <br/><br/><br/><br/><br/>Additional hardware required for Remote Play.<br/><br/>1-4 players<br/>DUALSHOCK®4<br/>Remote Play<br/>1080p HD Video Output<br/><br/>  Software subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.<br/><br/>", "metacritic": null, "released": "2016-07-26", "tba": false, "updated": "2019-08-02T16:25:21", "background_image": "https://media.rawg.io/media/screenshots/891/891960121e1e98c4375a7a98edeba744.jpg", "website": "http://chambaragame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 7, "beaten": 1}, "playtime": 0, "achievements_count": 9, "ratings_count": 2, "suggestions_count": 169, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC", "PlayStation 4"], "developers": ["University of Southern California", "team ok"], "genres": ["Action"], "publishers": ["team ok"], "esrb_rating": "Everyone 10+"}