{"id": 21327, "slug": "undeadz", "name": "Undeadz!", "name_original": "Undeadz!", "description": "Undeadz! is an open world Zombie Survival game with a retro art style! <br/>\r\nCan you make it out alive in a Zombie infested open world! Search all buildings inside and out, finding items that will help you survive longer and basically have a blast killing zombies! There are various weapons, scattered food items and tools! Don't forget to scavenge for fuel and parts to operate the various vehicles in the world! <br/>\n<br/>\r\nSome Controls to know:<br/>\n<br/>\r\nPress H in game for help with Controls!<br/>\r\nPress M in game for Map!<br/>\r\nPress Esc. in game to save/load game!<br/>\n<br/>\r\nTo RUN you have to press SPACE BAR (and release W)<br/>\n<br/>\r\nUse Left click in inventory to see item option!<br/>\r\nUse mouse Left Click to Interact while close to objects in the world.<br/>\r\nUse mouse Middle to fire guns.<br/>\r\nUse mouse Right Click to use melee weapons.<br/>\r\nMove forward with W (player will move towards mouse cursor)<br/>\r\nPress E to get on vehicles when you have enough gas.<br/>\n<br/>\r\nIMPORTANT NOTE:<br/>\r\nFull screen is not currently supported (do not use Alt + Enter)<br/>\n<br/>\r\nJust a few of the items in the world: <br/>\r\nCrowbars, which can be used to open locked doors when you aren't crackin' a zombies skull! <br/>\r\nGuns, pistols and machine guns! <br/>\r\nChainsaw, chop trees for useful wood to build camp fires! <br/>\r\nFlame throwers, it's kinda fun to watch the zombies run around on fire! <br/>\r\nLand mines, watch them zombies pop, but be very careful with them! <br/>\r\nAnd of course, Chickens, you never know when you'll need a diversion!", "metacritic": null, "released": "2015-09-25", "tba": false, "updated": "2019-08-28T22:08:07", "background_image": "https://media.rawg.io/media/screenshots/fb6/fb68e3d133c921462ae9087fc19124da.jpg", "website": "http://www.undeadz.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 4, "dropped": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 195, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Miguel Lleras"], "genres": ["Action", "Indie"], "publishers": ["Miguel Lleras"], "esrb_rating": null}