{"id": 21335, "slug": "tisnart-tiles", "name": "Tisnart Tiles", "name_original": "Tisnart Tiles", "description": "Tisnart Tiles takes you beyond the ordinary match 3 games!... 120 levels of entertaining twists and surprises along the way. Which way is gravity pulling on the tiles up/down/left/right? No one board is the same. Unique powerups like Tile Blasters, Gravity Tiles, Tile flips, Gas Pods, what's next? Lookout for Mr.Skull, He is waiting for you to make a mistake so he can steal your tiles. Between split boards, rotating tiles and earthquakes you are bound to get dizzy. Think you got what it takes?Features List<ul><li> 120 levels of entertaining twists and surprises<br/></li><li> 9 exciting Power-ups like the Flip Tile, Bomb Tile, Gravity Tile <br/></li><li> Collect coins to use special items like the Multi Bomb or the Multi Blaster<br/></li><li> Use the Rotator to rotate the tiles on the board<br/></li><li> Collect Element tiles to start a QUAKE to help clear the board</li></ul>Hints/tips<ul><li>Although there are tutorials within the game, there are many \"things\" left for the player to discover during game play!<br/></li><li>The Title is screen is an interactive one....can you figure out all the different things you can do?<br/></li><li>There may be some secrets in the level select screen for extra coins......can you find out what they are?</li></ul><br/>#MadewithFusion", "metacritic": null, "released": "2015-08-31", "tba": false, "updated": "2023-06-14T19:58:24", "background_image": "https://media.rawg.io/media/screenshots/ec4/ec4902b95b9f0378dd6894d5dcce27a7.jpg", "website": "http://www.tisnart.com/tisnart-tiles.html", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 76, "dropped": 1}, "playtime": 4, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 161, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Tisnart"], "genres": ["Casual", "Indie"], "publishers": ["Tisnart"], "esrb_rating": null}