{"id": 21359, "slug": "7-grand-steps-what-ancients-begat", "name": "7 Grand Steps: What Ancients Begat", "name_original": "7 Grand Steps: What Ancients Begat", "description": "What Ancients Begat is a complete (~15 hour) game of family generations surviving the rise of western civilization. Survival is the ultimate goal. The sub-goals, you choose, build their story.<br/><br/><br/>Experience an abstract telling of the lives of our earliest recorded ancestors. Part board game, part machine, part nod to computer games of yore, it begins with a simple mechanic. Spend tokens to traverse the wheel of life. Earn tokens by tempting the jaws of death. Then, like layers upon a pearl, game play expands, introducing fresh tactics and strategies which, turn by turn, drive a sophisticated, emergent narrative. How you play defines the lives of one family's generations through the changing ages.<br/><br/><br/><strong>An enormous tableau of ancient western culture awaits your exploration:</strong><br/><br/><br/><ul><li> <strong>Core Mechanic</strong> - Back and forth tactics, across four social boundaries, to win legend points.<br/></li><li> <strong>Family Strategy</strong> - Romance. Raise children. Rite of Passage.<br/></li><li> <strong>Family Drama</strong> - Tales in the life. Sibling rivalry. Failed branches. Graveyard of  ancestry.<br/></li><li> <strong>Grand Legends</strong> - Earned over generations, they strengthen your family: Discoveries and Invention. Social Advancement. Heroics.<br/></li><li> <strong>Ruling Games</strong> - City Administration. Warring Kingdoms. Imperial Senate.<br/></li><li> <strong>The Challenges of an Age</strong> - Special for each social level. Survive and overcome, to enter a new age.</li></ul>", "metacritic": null, "released": "2013-06-07", "tba": false, "updated": "2023-12-18T17:52:37", "background_image": "https://media.rawg.io/media/screenshots/66e/66e9b44cd532e8c09e497fce55f6e3cd.jpg", "website": "http://www.7grandsteps.com", "rating": 1.65, "rating_top": 1, "added_by_status": {"yet": 36, "owned": 531, "beaten": 3, "dropped": 11}, "playtime": 4, "achievements_count": 0, "ratings_count": 20, "suggestions_count": 504, "game_series_count": 0, "reviews_count": 20, "platforms": ["PC", "macOS"], "developers": ["Mousechief"], "genres": ["Strategy", "Simulation", "Casual", "Indie"], "publishers": ["Mousechief"], "esrb_rating": null}