{"id": 213692, "slug": "usurper-itch-say-si", "name": "Usurper (itch) (SAY Sí)", "name_original": "Usurper (itch) (SAY Sí)", "description": "<p><em>A top down Action/Adventure game in which the player must travel through complete darkness, only seeing a small distance around them, and explore the environment using audio cues instead of visual cues. They must collect items and fight monsters to advance through the game, all relying on sound.</em></p>\n<p><strong>Controls</strong></p>\n<p>In this game you rely on sound to navigate the level and find items. Each important object has its own distinct sounds. They get louder when you are near and quieter when you are far.</p>\n<p><strong>To move</strong>, use the <strong>arrow keys.</strong><br/><strong>Click</strong> or use <strong>the spacebar</strong>  to <strong>attack enemies</strong>.<br/><strong>This game works best when you are wearing headphones.</strong></p>\n<p><strong>Story</strong></p>\n<p><em>The light is an immense force, able to destroy even the darkest of voids with a single spark.</em></p>\n<p><em>After an ancient war, the creatures of the dark receded to their eternal night in defeat. The light has been to rule ever since, threatening the dark if it ever dared to come in their way.</em></p>\n<p>In <em>Usurper</em>, you are a Saint from the light empire venturing into the darkness, with the intent of slaying their lord. All you have is the light you hold dear, as you descend into the void that you believe has threatened you for ages. You are in their world now.</p>\n<p><strong>BY</strong><br/>Alessandra Holveck<br/>Emilie Chavez<br/>Madelyn Holveck<br/>Maggie Rose Kolb</p>", "metacritic": null, "released": "2018-08-30", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/09e/09e34794430869defc916edefb369de7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 31, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["SAY Sí"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}