{"id": 213604, "slug": "turtle-simulator-aquatic-edition", "name": "Turtle Simulator: Aquatic Edition", "name_original": "Turtle Simulator: Aquatic Edition", "description": "<p><strong><em>Turtle Simulator: Aquatic Edition is a reworked version of the game 'Turtle Simulator' , made for the Ludum Dare 29. New dialog, bugfixes, music, and obtuse philosophical themes await!</em></strong></p>\n<p><strong>Become a turtle</strong><br/></p>\n<p>Turtle Simulator is an adventure game in which a newly-hatched turtle that has been left behind must confront the realities of life outside of the egg, and journey into the ocean to find its kind. Along the way, it learns profound lessons about the food chain, the circle of life, introductory aesthetics and trends in twentieth-century contemporary art.  </p>\n\n<p><strong>Enter the ocean</strong></p>\n<p>Turtle Simulator features a world in which man and fish alike occupy the ocean in an inane aquatic fever-dream. Nothing makes sense here.  There are many characters to meet and even more adversaries to fight. And fight them you must, in order to survive the threats of the deep blue sea. </p>\n\n<p><strong>It is so beautiful here</strong><br/></p>\n<p>Turtle Simulator is a game designed to look like a Gameboy Color title in every way. The ocean is a place of incredible beauty. Is beauty an inherent property of certain things, or do we project beauty upon that which is physically ordered and pure in this world? Only investigation into the depths of this ocean world will yield answers.</p>\n\n\n<p><strong>Confront hard decisions</strong></p>\n<p>In this game, you must confront existential dilemmas. Are you willing to fulfill the destiny that nature has preordained for you? You may not like the answers that you seek in your quest to find your turtle kind. </p>\n\n\n<p><strong>Controls </strong><br/></p>\n<p>Arrow keys to move. Spacebar to select and advance dialog.</p>\n\n<p><em>Created for Ludum Dare 29 in April 2014. Linux build coming as soon as we figure out the automated build process.</em><br/></p>", "metacritic": null, "released": "2018-08-31", "tba": false, "updated": "2019-08-28T23:20:33", "background_image": "https://media.rawg.io/media/screenshots/833/833814bb6529befd80113a388cbb682c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 137, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Caveware Digital"], "genres": ["Action", "Adventure", "RPG"], "publishers": [], "esrb_rating": null}