{"id": 21389, "slug": "phineas-and-ferb-new-inventions", "name": "Phineas and Ferb: New Inventions", "name_original": "Phineas and Ferb: New Inventions", "description": "<p>There is no time to get bored on holidays! Half-brothers Phineas and Ferb always know how to entertain themselves. They can build an entertainment park in their backyard or think up something very special… But their elder sister Candace is not very happy of their tricks. She is always ready to bust the brothers and tell their mother on them. And Phineas has a pet platypus called Perry who has a secret of his own. He just pretends to be a silly amenable pet but in fact lives a double life as a secret agent codenamed P battling the malicious scientist Dr. Doofenshmirtz… On the whole, they all have a lot to worry about!<br />\nThis time Phineas and Ferb decide not to fritter away their energy. They are going to build the coolest rollercoaster in their backyard! But to assemble such an enormous construction they need a good drawing and a lot of different parts which are not so easy to find. And tattletale Candace is up to stick her nose where she doesn’t belong… And where is Perry the Platypus? He is on a secret mission again! Brave Agent P is on his way to save the town from another wicked design of Dr. Doofenshmirtz. Someone must help him! And, of course, one shouldn’t forget about building the rollercoaster. The fun begins!</p>", "metacritic": null, "released": "2015-02-24", "tba": false, "updated": "2019-08-28T22:08:04", "background_image": "https://media.rawg.io/media/screenshots/86c/86caf6db1b9b5eef80c1b3c6e7f88555.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 13, "toplay": 2}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 157, "game_series_count": 5, "reviews_count": 0, "platforms": ["PC"], "developers": ["PIPE Studio"], "genres": ["Adventure"], "publishers": ["Disney Interactive"], "esrb_rating": null}