{"id": 213922, "slug": "bonaparte", "name": "Bonaparte", "name_original": "Bonaparte", "description": "<p>English and German Language!</p>\n<p><strong>English:</strong><br/></p>\n<p>BONAPARTE - THE BATTLE         FOR POWER AND FREEDOM</p>\n<p>We're back in the year 1789,         the French Revolution has just begun. Now you're getting the chance to         step into Napoleon's shoes.</p>\n<p>Chose one out of 5 nations         (France, Prussia, Austria, Russia or Great Britain) and lead them through         the oncoming 70 years. 1 to 5 players may play from one computer. Furthermore,         you may re-play historical scenarios.</p>\n<p>FUNCTIONS:</p>\n<p> - Lead wars on sea and on the ground. - Lead war with up to 4 different armies and 2 marine units - Lead the battle for 40 different regions - Take climate, the population's wealth and the region's population into account<br/> - Issue letters of marque for pirates - Establish the tax burdens for the '3 Estates' - Arrange fairs to win the estates' favor.<br/> - Invest in research in 4 categories and earn up to 25 advancement score points - Protect your own life by secret service and guards - Choose between 5 state orders after researching their advantages and disadvantages<br/> - Build a palace for you and your descendants<br/> - Secure your successoion by marriage and children<br/> - Consolidate your children's supreme position in order to assure the survival of your dynasty<br/> - Invest in the regions of your nations in order to increase your wealth<br/> - Watch out for your import / export profits<br/> - Obtain and maintain diplomatic relations to the 5 most important nations<br/> - Execute secret plans in order to weaken your opponent<br/> - Have a look at the extensive statistic listings of each nations - increase your reputation and gain a title - Beat the high score - Fight rebellious countries - Experience personal and country specific events<br/> - Enjoy the graphics and the ingenious KI</p>\n<p><strong>German:</strong></p>\n<p>BONAPARTE - DAS SPIEL         UM MACHT, INTRIGEN UND DIE FREIHEIT</p>\n<p>Wir schreiben das Jahr 1789,         die französische Revolution befindet sich noch am Anfang. Nun erhalten         Sie die Möglichkeit in die Fußstapfen von Napoleon Bonaparte         zu treten.</p>\n<p>Wählen Sie eine von 5         Nationen (Frankreich, Preussen, Österreich, Russland oder Großbritannien)         und führen Sie diese durch die nächsten 70 Jahre. Es können         1-5 Spieler an einem Rechner spielen. Außerdem kann man historische         Szenarien nachspielen.</p>\n<p>SPIELFUNKTIONEN:</p>\n<p> - Führen Sie Krieg zu See und zu Land - Führen Sie Krieg mit 4 unterschiedlichen Land- und 2 Seeeinheiten<br/> - Kämpfen Sie um 40 Regionen - Berücksichtigen Sie das Klima, den Reichtum und Bevölkerung der Region<br/> - Stellen Sie Kaperbriefe für Piraten aus<br/> - Legen Sie Steuersätze für die \"3 Stände\" fest<br/> - Richten Sie Volksfeste aus, um die Gunst der Stände zu gewinnen<br/> - Forschen Sie in 4 Bereichen und erlangen Sie bis zu 25 Fortschritte<br/> - Schützen Sie Ihr Leben durch den Geheimdienst und die Leibwache<br/> - Wählen Sie eine von 5 Staatsformen die Sie vorher erforschen müssen<br/> - Bauen Sie einen Palast für sich und Ihre Nachfahren<br/> - Sichern Sie Ihre Nachfolge durch Hochzeit und Kinder - Festigen Sie die Position Ihrer Kinder, damit Ihre Dynastie fortgeführt wird - Investieren Sie in die Regionen Ihrer Nation um den Reichtum zu erhöhen<br/> - Achten Sie auf die Import- bzw. Exportüberschüsse<br/> - Erhalten Sie diplomatische Beziehungen zu den 5 wichtigsten Nationen<br/> - Führen Sie Geheimaktionen durch, um Ihre Gegner zu schwächen<br/> - Schauen Sie sich die ausführlichen Statistiken zu jeder Nation an<br/> - Erhöhen Sie Ihr Ansehen und erlangen Sie Titel<br/> - Knacken Sie den Highscore<br/> - Bekämpfen Sie aufständische Länder<br/> - Erleben Sie persönliche und länderspezifische Ereignisse<br/> - Genießen Sie die atemberaubende Graphik und die ausgeklügelte KI</p>", "metacritic": null, "released": "2018-08-28", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/780/78075d9084db91bc36adadc239c74654.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 225, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["netmingames"], "genres": ["Strategy", "Simulation"], "publishers": [], "esrb_rating": null}