{"id": 214008, "slug": "swooping-season", "name": "Swooping Season", "name_original": "Swooping Season", "description": "<p><em>Snakes. Spiders. Sharks. Magpies? </em></p>\n<p>Australia, the land down under, is known for it's dangerous flora and fauna. Every year, thousands of potential tourists are repelled from this land at the very thought of a spider crawling up their leg, or a shark attack at one of our beautiful beaches. Little do they know, these animals pale in comparison to the ferociousness of our most dangerous creature: <strong><em>the Australian Magpie.</em></strong></p>\n<p>Every year, from August through November, magpies strike fear into the heart of every man, woman and child as they descend from their nests at a piercing rate. Eyes are struck and skulls are penetrated. Those who have not encountered the feathered missiles do not know true terror.</p>\n<p>In <em>Swooping Season, </em>players must progress from one side of a magpie-infested park to the other, making sure not to be hit in process. There is no defense from these terrifying birds, besides sprinting off in another direction, hoping an exit will see you out of the park in one piece - but be careful, one magpie easily turns into two, three, four and more if unwittingly coax them out...</p>\n<p><strong>Controls:\r\n</strong></p>\n<ul><li>Mouse: <em>Look</em></li><li>W-A-S-D: <em>Movement</em></li><li>Left Shift: <em>Sprint (Limited and regenerates)</em></li><li>Escape: <em>Quit Game (Press twice within two seconds)</em></li></ul>\n<p><strong>Credits:</strong>\n</p>\n<ul><li>Sam Vidler - Art</li><li>Harrison Short - Programming, Sound, Animation</li><li>David Upcher - Music</li><li>Go to harrisonshort.net/6in6-challenge/ for additional credits!</li></ul>\n<p><strong>Other Notes:\r\n</strong></p>\n<p>Swooping Season was made in one month as part of the 6-in-6 challenge being undertaken by Sam Vidler and Harrison Short. From July through to December 2018, we'll be making (and trying to release) one game a month. To follow our journey, check out our Twitter pages: Sam, Harrison</p>\n<p><strong>Known Issues:</strong></p>\n<p>Please let us know if you find any glitches in the game, and we'll list them here! After the 6-in-6 challenge is complete, we may come back and fix up any pressing bugs.</p>", "metacritic": null, "released": "2018-08-30", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/562/56229f688af5f4fc1c445b9927e8b0fa.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 100, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["harrishun"], "genres": ["Action"], "publishers": [], "esrb_rating": null}