{"id": 214031, "slug": "lettre-presentation-nad", "name": "Lettre presentation NAD", "name_original": "Lettre presentation NAD", "description": "<p>Voici ma lettre de présentation pour l'admission d'hiver 2017 au NAD. Le projet entier fut réalisé en 2 jours et demi avec Unity, 3Ds Max et Photoshop. </p><p>Ceci est seulement le fichier .exe pour que vous puissiez l'essayer vous-même. </p><p>Ne sachant pas coder, il y a encore des lacunes de gameplay dans mon jeu, et je m'en excuse.</p><p>Voici le texte de fin si vous préférez le lire ici:<br/></p><p>\"À qui de droit,</p><p>Voici ce que je réussis à faire en une semaine approximativement avec Unity et un DEC en Animation 3D. C'est bien, mais je sais que je n'ai pas atteint mon plein potentiel.</p><p>Il y a une raison pourquoi je ne me suis pas cherché de boulot après le Cégep. C'est parce que je sais que je n'ai pas encore ce qu'il faut pour le marché du travail.</p><p>Ce qui m'attire à l'université n'est pas le diplôme ou les cours eux-mêmes. Ce sont les ressources qui seront à ma portée: profs, logiciels, contacts, connaissances...</p><p>Mon plan est très simple: entrer au NAD, exploiter jusqu'à la dernière goutte toutes les ressources que j'y trouverai, graduer, devenir le meilleur props artist au Québec (je reste réaliste tout de même) et me trouver un boulot en jeux vidéo. Ensuite, j'improviserai. J'aimerais bien enseigner un jour. Peut-être même au NAD, pourquoi pas?</p><p>Le NAD est la prochaine étape sur ma route. J'entends bien avoir mon BAC au NAD peu importe le temps, l'énergie et le nombre de demande d'admission que cela me demandera.</p><p>Au plaisir de me compter parmis vos rangs à l'hiver 2017.</p><p>Merci.\"</p>", "metacritic": null, "released": "2016-10-29", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["falloutworldrecord"], "genres": [], "publishers": [], "esrb_rating": null}