{"id": 214229, "slug": "the-last-librarian-kickstarter-demo", "name": "The Last Librarian | Kickstarter Demo", "name_original": "The Last Librarian | Kickstarter Demo", "description": "<p>This is the Kickstarter demo for this project, it is not the full game, just a bit to showcase what I've finished so far.</p><p>The world of Rosarah is haunted by the ancient past. Grand civilizations fell to the iron fist of the Kithen Empire. The people suffered. And while the suffering ended, for the most part, over 1,000 years ago, the guardians who protect Rosarah are dwindling.</p>\n<p>They are the Librarians: the guardians of ancient knowledge and history, protectors of the 8 magic spell books which were originally used by evil to conquer Rosarah. In <em>The Last Librarian</em>, you play as Randel, who is thrust suddenly into his role as a Librarian when his grandfather is slain by an undead monster. You must unseal the spells, buried deep in well-guarded Libraries, in order to defend Rosarah once again from tyranny.</p>\n<p><em>The Last Librarian</em> is an action-adventure RPG, with a detailed, wide-open world to explore. It is designed to not only capture the spirit of adventure (exploration, discovery and freedom) but also contain an engaging and intricate story, packed with compelling characters and lore. Rosarah is a world crafted in such a way that you <em>want</em> to save it from evil.<br/></p>\n<p>This is the Kickstarter demo for <em>The Last Librarian</em>. I'm running a Kickstarter campaign to raise the funds I need to continue development to publish in 2019. Consider backing the project if you played the demo and had a good time, or otherwise share it with someone you know who might. Thanks!</p>\n<p>https://www.kickstarter.com/projects/cloakedgames/the-last-librarian-action-adve...</p>", "metacritic": null, "released": "2018-08-31", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/cd5/cd5fba6b3c65f938fe3bdec8d2e30a45.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 80, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Cloaked Games"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}