{"id": 214200, "slug": "formula-xd-itch", "name": "Formula XD (itch)", "name_original": "Formula XD (itch)", "description": "<p> <br/></p>\n<p> Formula XD is a racing team strategy game for PC (and soon Mac). You'll take on the role of manager - hiring drivers, negotiating contracts with sponsors and engine suppliers, and making the big decisions necessary to keep your team above water. You'll issue orders to your drivers when they go out onto the track, and be responsible for guiding them to victory or defeat.</p>\n<p>It won't be easy - you'll start at the bottom and fight your way through a long career, striving to win the Constructors' Championship title, or at least make your mark on the Wall of Fame. There'll be plenty of challenges along the way - not only will you be adjusting your drivers’ pace, fuel and tyre strategy in response to ever-changing race circumstances, you’ll also have to deal with extreme weather, sabotage, stray animals, food poisoning, and even terrorism. Can you manage? </p>\n<p><strong>Game Features</strong></p>\n<ul><li>Racing circuits set all over the world</li><li>Loads of drivers, sponsors and engine suppliers</li><li>Bright, colourful aesthetics</li><li>Vibrant audio and an energetic synth soundtrack</li><li>Get hired, buy a team, sell out, switch teams, it's up to you</li><li>Special abilities and game modifiers shake it up</li><li>Filled to the brim with puntastic humour</li></ul>\n<p><strong>MacOS version</strong> to arrive at some point later for no additional charge.</p>\n<p><strong>1.0.6 Changelog</strong></p><ul><li>Fixed an issue introduced in 1.0.4/1.0.5 where new car stats were not copied over at end of year.</li><li>Fixed screenshots being overwritten after game relaunch.</li><li>Rebalanced safety car speed</li><li>Fixed an issue where saving game settings without existing save data could crash the game.</li></ul><p><strong>1.0.5 Changelog</strong></p><ul><li>Removed all diagnostic file producing code</li><li>Fixed stupid error where the game was asking for a connection to Steam. This is not the Steam version. I'm an idiot. I shouldn't hurry when preparing builds.</li></ul><p><strong>1.0.4 Changelog</strong></p>\n<ul><li>Fixed really rare fatal error triggered on budget confirm in very specific circumstances (game complains that an expected string is actually a number).</li><li>Removed code that produces diagnostic files (you can freely delete Finances.ini and WTF.ini... heh).</li></ul>\n<p><strong>1.0.3 Changelog</strong></p>\n<ul><li>Fixed safety car problem where it could crash the game upon setting off.</li><li>Cars are now better at grouping up and maintaining position under yellow flags.</li></ul>\n<p><strong>1.0.2 Changelog</strong></p>\n<ul><li>Fixed save game bug from adjusting settings and then quitting the game shortly afterwards.</li></ul>\n<p><strong>1.0.1 Changelog</strong></p>\n<ul><li>Fixed driver name reading from FXDcustomise.ini</li><li>Fixed possible game-breaking problem in Wall of Fame</li><li>Unusually, a patch to the soundtrack album: 'Make Tea Not Love' had some problems and didn't sound particularly splendid. Published individual single and updated album.</li></ul>", "metacritic": null, "released": "2018-08-26", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/43d/43dcc86591270f5e9c3d5f1b6e87a042.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 344, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Nitroglycerin"], "genres": ["Strategy", "Sports", "Racing"], "publishers": [], "esrb_rating": null}