{"id": 21424, "slug": "apothecarium-the-renaissance-of-evil-premium-editi", "name": "Apothecarium: The Renaissance of Evil - Premium Edition", "name_original": "Apothecarium: The Renaissance of Evil - Premium Edition", "description": "The story takes place in Italy in the époque of the Renaissance. Disastrous outbreak of plague and leprosy is raving, taking thousands of lives. We play-act for Adriano, - brave and daring as hereditary aristocrat Adriano family member of the Duke of Medici, who sent for the pursuit of his daughter, Claudia. Our hunt leads us to the strangest of places – little town called Apothecarium. Just recently Italy’s brightest minds were fighting over the search of the vaccine against plague. These scientific pioneering and research so as to win the fight with the dreadful disease is the purpose this “amazing city” was built for.<br/><br/>On arrival we discover that Apothecarium has become abandoned and Claudia’s cortege destroyed and the Duchess herself kidnapped. The further deep into the mysterious city we are making our way the more we find it overflowing with the odd inventions imbued with the fleur of the Renaissance and the more horrific details we discover. Unveiling the mystery we learn that the city’s inhabitants have fallen the victims of the outrageous and demented Alchemist who in his pursuit for the elixir of youth has taken the path of the evil and wrecking havoc. This virulent and frenetic scientist is taking lives of the innocent so as to gain the immortality. We are to come across the sinister mysteries of Apothecarium, overpass a great deal of considerable tests and face multitude of hardships so as to free the Duchess of Medici from the clutches of the insane and cold-blooded lunatic and save the survived.  <br/> <br/>Key Features:<br/><ul><li>Over 40 Location, 20 Hidden Object and 16 Puzzle scenes <br/></li><li>Interactive Map (quest and navigation) <br/></li><li>Over 8 hours of gameplay <br/></li><li>Integrated Match3 Game<br/></li><li>Global Hint System<br/></li><li>Additional Game content (Music, Wallpapers, Screensavers etc.)<br/></li><li>Special Chamber Orchestra Live Records, original soundtrack included<br/></li><li>Built-in Strategy Guide</li></ul>", "metacritic": null, "released": "2015-05-28", "tba": false, "updated": "2019-08-28T22:08:03", "background_image": "https://media.rawg.io/media/screenshots/492/49244df6ba540aa151d3ab64718b3fdb.jpg", "website": "http://www.facebook.com/Apothecariumgame", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 80, "beaten": 1}, "playtime": 2, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 605, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Space Monkey International"], "genres": ["Adventure", "Casual"], "publishers": ["1C Company"], "esrb_rating": null}