{"id": 21447, "slug": "worldcreator", "name": "WorldCreator", "name_original": "WorldCreator", "description": "WorldCreator is a professional stand-alone terrain creation tool used to create most realistic terrain data for 3D environments used in games, movies and artworks. It empowers the user with the most advanced procedural techniques available nowadays.<br/><br/>The WorldCreator Steam version supports terrain generation up to a maximum resolution of 4096 by 4096 <strong>(if you require higher resolutions, please check out the WorldCreator Indie version on www.bitethebytes.com)</strong>. It offers many tools, filters and predefined terrain presets allowing you to create ANY kind of terrain you can imagine. The most important part about terrains that are created with WorldCreator is, that they look naturally and absolutely realistic.<br/><br/>You can use <strong>isolines </strong>to to creatively control the form of the landscape. Interventions are <strong>non-destructive</strong> and <strong>layer-based</strong>, and you can always readjust, switch off or change an isoline or layer at any time in the process.<br/><br/>Artistic &amp;quot;shape&amp;quot; filters give the landscapes a typical natural structure such as round hills or ridged mountains.<br/><br/>The semi-scientific <strong>erosion</strong> and <strong>sediment</strong> algorithms can turn these outlines into fantastic, realistic and believable landscapes. In addition, flows, rivers or even entire river networks can be added to the terrain. The algorithm is unique, extremely fast and satisfies even scientific requirements. But landscapes are not only defined by nature. The human factor also is a very important element. The &amp;quot;vector&amp;quot; tool &amp;quot;simulates&amp;quot; this part of a landscape. You can use it to integrate roads, urban areas or even controlled rivers into your terrain.<br/><br/>Terrain created with WorldCreator can be exported to most common image formats (e.g. PNG, TIF, BMP) and RAW files which can be used to create exactly the same terrain in other 3D applications like the <strong>Unity Engine</strong>, <strong>Unreal Engine</strong>, <strong>Cry Engine</strong>, <strong>3DS Max</strong>, <strong>Maya</strong>, <strong>Cinema 4D</strong>, <strong>Vue</strong>, <strong>Terragen </strong>and a lot more!<br/><br/><strong>It is of course also possible to import existing terrain data and also real world terrain data! (supported file formats are RAW 16 and 32 bit, TIF, TGA, PGM, TER, BMP, JPG and PNG) </strong>", "metacritic": null, "released": "2014-10-20", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/0a7/0a717b4cf7748d491594aaa0de48def9.jpg", "website": "http://www.bitethebytes.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 116, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Stefan Kraus", "Timo Armbruster", "Johannes Rosenberg"], "genres": [], "publishers": ["BiteTheBytes"], "esrb_rating": null}