{"id": 21463, "slug": "mission-control-nanomech", "name": "Mission Control: NanoMech", "name_original": "Mission Control: NanoMech", "description": "Mission Control: NanoMech is set late in the 21st century and puts players in a high-tech base on the surface of Mars, where they step into the role of a rover pilot delivering supplies. A rogue artificial intelligence named D-brain has taken control of the factory and most of its robotic workers and refuses to let the humans go. With the threat of a massive Mars dust storm cutting off communications to the rest of the Mars bases, it's up to the player to save the other humans trapped inside the factory.<br/>\n<br/>\r\nLuckily, several friendly robots are on hand to help the player fight back. The robots gift the player with a spacesuit and teach the player how it can be improved with nanotechnology. As the game progresses, the player is helped further by scientists hiding inside the factory who leave clues and information that help the player understand and use the nanomaterials in optimal ways to solve puzzles and overcome obstacles. Players must master this improvement process as it is directly linked to the progressive difficulty in the game. Presented with puzzle challenges, the player must race against the clock to keep their robotic team members functioning while searching for more raw materials and the hidden scientists in order to get strong enough to confront D-brain directly.<br/>\n<br/>\r\nMission Control: NanoMech was developed under a grant from the National Science Foundation (Grant #0823411) and developed in collaboration with NASA through a Space Act Agreement. This action-adventure game is based on real nanotechnology content, which was reviewed by experts for accuracy. Spacesuit components and technologies are based on authentic future technologies being researched and developed by NASA and others.", "metacritic": null, "released": "2014-12-17", "tba": false, "updated": "2019-09-17T14:27:39", "background_image": "https://media.rawg.io/media/screenshots/d63/d630f73040302cac66e612d84d80fd28.jpg", "website": "http://www.nanomechgame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 76, "beaten": 1, "dropped": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 135, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC", "macOS"], "developers": ["WisdomTools"], "genres": ["Action", "Adventure", "RPG"], "publishers": ["WisdomTools"], "esrb_rating": null}