{"id": 21472, "slug": "mahjong-quest-collection", "name": "Mahjong Quest Collection", "name_original": "Mahjong Quest Collection", "description": "<p>Includes the first three installments of Mahjong Quest, the epic tale of tile matchmaking!</p><br/>\n<p>What's the meaning of happiness? You are Kwazi. Starting from a mysterious birth at a mountaintop monastery and ending as a wizened old man, you use your grandfather's ancient Mah Jong set to solve an ever-challenging series of puzzles. As you play Mah Jong Quest 3, you'll make life choices that take you though battles against dragons, unreturned love, twisty career paths, artistic fulfillment, utter devastation, spiritual awakening, a rebuilding, and ultimately a blossoming family. The story unfolds based on the decisions you make, so choose wisely. In the end, only you can match the tiles and find the balance that brings about true Happiness.</p>\n<ul>\n<li>Unlimited Play</li>\n<li>Four Game Modes: Quest, Freeplay, Tournament, and Variations</li>\n<li>72 Challenging Levels in Quest Mode</li>\n<li>More than 800 New Puzzles</li>\n<li>Hundreds of Classic Layouts</li>\n</ul><br/><br/>\n<p>Nature has struck back. The world has fallen into a state of imbalance, splitting our teenage here Kwazi into the male Kwazi White and Female Kwazi Black. You must help the Kwazis advance through the eight mystical lands, matching pairs and triplets like never before. Only you can restore harmony to the world.</p>\n<ul>\n<li>8 lands with 8 levels each in Kwazi's Quest, each with it's own special tiles</li>\n<li>Over 500 new puzzles</li>\n<li>Dozens of special tiles and monstrous surprises!</li>\n<li>NEW Tournament mode! 32 unique puzzles</li>\n<li>Play against competitors on-line</li>\n<li>Mind-blowing animation!</li>\n<li>Over 144 classic layouts</li>\n<li>Unlimited game play! Play as long as you live - forever!</li>\n</ul><br/><br/>\n<p>More than an addictive puzzle game - a true cinematic experience. After three dragons wreak havoc over the empire, young Kwazi must use an ancient set of Mah Jong tiles to restore balance. Enjoy sweeping animations as you help Kwazi journey through the Orient, meet wise animal guides, and use an amazing array of special tiles to solve tricky puzzles.<br/><br/>\n\t\t\t\tIn addition to this great story, you can also enjoy your favorite layouts in Classic-style play, and whole new challenges in Puzzle-style play.\n\t\t\t\t</p>\n<ul>\n<li>Reveal unique tiles that provide special powers</li>\n<li>Classic Play: over 80 classic layouts, endlessly replayable with unlimited shuffles</li>\n<li>Puzzle Play: more incredible power tiles and 80 more brain-teasing layouts</li>\n<li>Play your favorite layouts in special modes for stimulating challenges</li>\n</ul><br/><br/>", "metacritic": null, "released": "2009-08-24", "tba": false, "updated": "2019-08-28T22:08:01", "background_image": "https://media.rawg.io/media/screenshots/82c/82c03ad1396bd7fa9812d78b31ac8e0c.jpg", "website": "http://www.iwin.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 9, "beaten": 1, "toplay": 1}, "playtime": 2, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 429, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["iWin"], "genres": ["Casual"], "publishers": ["iWin"], "esrb_rating": null}