{"id": 21489, "slug": "bonetown-the-power-of-death", "name": "Bonetown - The Power of Death", "name_original": "Bonetown - The Power of Death", "description": "The Apocalypse Has Arrived.<br/>The ancient writings were clear: \"monsters and dark forces of all kinds and forms will come to Earth to punish us for our disobedience to the gods. <br/>We'll be destroyed in a pool of blood, and from that blood we will start all over again.\" <br/><br/>This ancient book, hidden somewhere in the world, also told of a salvation, a hero, that would come from the skies and banish the darkness into oblivion. <br/>When I heard of this, I realized that I was in some way involved. <br/>The people believed that I was not a true warrior, but just a little boy. Well, they were wrong. <br/>When I was a child my parents tried to keep a part of me hidden, perhaps out of fear or maybe just to protect me. <br/>When I grew up I realized what I had in my hands, or rather what I had inside of me. <br/>People call it the \"Power of Death\". <br/><br/>Sorcerers say that this.. thing.. is the soul of a dragon, Agurah, and it's holed up inside me waiting for the day that I will bring her home. <br/>I don't know if it's a true story or not, but I have to start this journey to discover this mistery and save my people. <br/><br/>Play in this epic fantasy-adventure game where you can explore and do everything you want. Build, craft, search, steal... and fight for your liberty!", "metacritic": null, "released": "2015-02-16", "tba": false, "updated": "2019-08-28T22:08:01", "background_image": "https://media.rawg.io/media/screenshots/108/108928a5474268f9da7f25394793a4e9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 9, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 278, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["CPsoft"], "genres": ["Adventure"], "publishers": ["CPsoft"], "esrb_rating": null}