{"id": 21495, "slug": "3d-paraglider", "name": "3D Paraglider", "name_original": "3D Paraglider", "description": "Do you dream of flying without restrictions, getting as close as possible to mother nature? If yes, then 3D Paraglider is for you. <br/>\n<br/>\r\nExperience Paragliding realism like no other, hanging from just a few nylon strings, feeling the wind rush past you as you climp up high, experience almost real paragliding, look for thermals, stay in those to gain altitude, stay in the air and stay afloat for as long as possible, discovering all areas of the huge virtual maps of beautiful scenery, all over the world. <br/>\n<br/>\r\nParagliders are lightweight, free-flying glider aircraft with no rigid structure. Paraglider flights can last many hours and cover many kilometres. All of this is also possible in 3D Paraglider, but with a pause option. <br/>\n<br/>\r\nThe longer you stay up aloft, the more points you score. <br/>\r\nHave fun or choose missions, be evil and drop bombs on targets or city buildings for extra points, get achievements,  practice your paragliding skills to eventually earn your virtual Paraglider Pilot License, just like in real life.<br/>\n<br/>\r\nOffering many different paragliding locations to fly in.<br/>\r\nPractice your flying/take off/landing, when your real wing is packed away in the winter, or just have a laugh. <br/>\r\nPlay against friends with Multiplayer, or just have a Solo outing and complete the courses.", "metacritic": null, "released": "2015-08-03", "tba": false, "updated": "2019-08-28T22:08:00", "background_image": "https://media.rawg.io/media/screenshots/5aa/5aa7bbe6bb6d6af15aa3d45f45340ac7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 25}, "playtime": 5, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 400, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux", "macOS"], "developers": ["khos85"], "genres": ["Action", "Simulation", "Sports"], "publishers": ["khos85"], "esrb_rating": null}