{"id": 215012, "slug": "tavern-guardians-banquet-2", "name": "Tavern Guardians Banquet", "name_original": "Tavern Guardians Banquet", "description": "Puzzle RPG meets Turn Based Tactics\r\n<p>Welcome to an all new RPG experience which perfectly blends the excitement of match three games with the strategic demands of Turn Based Tactics! No longer will you match tiles just to watch avatars attack enemies above the board. In TGB, countless waves of enemies, each with their own skills and specialties, advance from the top of the board. You take on the role of a Guardian, charged with defending various taverns. Watch each enemies' movements and actions, and then use magical skills and items to claim victory against evil!</p>\n\n<ul><li><strong>4 classes of guardians</strong> with their own unique skills and specialties.</li><li><strong>60+ unique enemies</strong> with their own skills and behavior. You'll need to think of the right strategy to defeat different combinations of enemies!</li><li><strong>10+ epic Boss fights</strong></li><li><strong>40+ items and pieces of gear</strong> to enhance your guardians' abilities and playstyles.</li><li><strong>Story Mode:</strong> Select a guardian to help the Tavern Master build his new taverns all across Dionia.</li><li><strong>Survival Mode </strong>(in development): Face completely randomized waves of enemies and pick from random items and gear in the shop. Full of surprises and difficult challenges!</li></ul>\n<p>We are WOMBO COMBO GAMES, a Japanese indie studio established in Fukuoka. The studio is comprised by 3 friends who love game and have experiences in the videogame industry.</p>\n<p>Demo is available now!  Feel free to download our game, play to your heart's content, and share your valuable feedback with us.<br/></p>", "metacritic": null, "released": "2018-08-28", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/b86/b86cbab83a96a441a12006e6e411be58.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 207, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["WomboComboGames"], "genres": ["Action", "Strategy", "Puzzle"], "publishers": [], "esrb_rating": null}