{"id": 21516, "slug": "home-is-where-one-starts", "name": "Home is Where One Starts...", "name_original": "Home is Where One Starts...", "description": "“I remember when I was a little girl, waiting at the end of my driveway. I had already missed the school bus, but I stood there anyway… envying the birds.”<br/><br/>Home is Where One Starts... is a short, first-person exploration game in the same vein as Dear Esther or Gone Home. It’s an experience where every object has been carefully placed to tell a poignant story—a story about childhood, hope, and the miracle of memory. You play as a little girl from a broken home somewhere in the American South. Exploring the lonely countryside reveals clues and vignettes which help the player answer the question of where home is—and how one can get there.<strong>Key features:</strong><ul><li>A quiet, non-linear story told by the future self of a reflective narrator<br/></li><li>Inspired by the rural countryside and stories like John Steinbeck’s East of Eden and Terrence Malick’s The Tree of Life<br/></li><li>A 15-30 minute experience that can be completed in one sitting<br/></li><li>An experience that focuses on atmosphere rather than action or puzzles<br/></li><li>A rich, detailed environment that rewards players who explore with story insights and secret endings<br/></li><li>Oculus Rift DK2 support (currently in beta)</li></ul>", "metacritic": null, "released": "2015-05-12", "tba": false, "updated": "2019-09-17T09:41:06", "background_image": "https://media.rawg.io/media/screenshots/165/165cca86baf63de7a137031fdf72759a.jpg", "website": "https://homeiswhereonestarts.wordpress.com/", "rating": 2.73, "rating_top": 3, "added_by_status": {"yet": 4, "owned": 224, "beaten": 11, "toplay": 3}, "playtime": 3, "achievements_count": 8, "ratings_count": 11, "suggestions_count": 256, "game_series_count": 0, "reviews_count": 11, "platforms": ["macOS", "PC", "Linux"], "developers": ["David Wehle", "Whelly"], "genres": ["Adventure", "Indie"], "publishers": ["David Wehle"], "esrb_rating": null}