{"id": 215278, "slug": "diy-brain-surgery", "name": "DIY Brain Surgery", "name_original": "DIY Brain Surgery", "description": "<p><strong>- - - - - T H E M E - - - - -</strong><br/></p>\n<p>The theme for this GMTK game jam was \"GENRE, but you can't MECHANIC\".</p>\n<p>So I decided to make a split-screen co-op game - but you can't co-operate. This created an interesting dynamic of coordination for the player, since they have to divide their attention between two screens at once, performing different tasks. And just to mess with people, I made the tasks change from time to time, so the player is kept on their toes.</p>\n<p><strong>- - - - - C O N T R O L S - - - - -</strong></p>\n<p>WASD + Space and mouse (Game will tell you when to use which)</p>\n<p><strong>- - - - - D E S C R I P T I O N - - - - -</strong></p>\n\n<p>Welcome to the hospital!</p>\n<p>You are currently in the operating room of our fine establishment, ready to undergo brain surgery. Unfortunately, all of our surgeons have called in sick for the day.  It's against hospital policy to let other staff members cut your head open, so you're going to have to do it yourself. On the bright side, we had a programming intern sitting around, so they crafted a wonderful game-like interface for you to use. However, the machines used to perform brain surgery are usually operated by two people, which means you'll just have to handle both of their jobs at once. You have two brain halves though, so there shouldn't be a problem with that.</p>\n<p>Sort the incoming blocks into the correct boxes using the mouse and WASD + Space on the two halves of the screen (one screen WASD and Space, one screen mouse). There are two different ways to sort, one will require you to either click on the correct box as the blocks are passing through the middle (marked by the spinning cross) or press the correct direction as the blocks pass through to shove the blocks towards the boxes. For the other, you will have to aim a pusher (mouse or AD) at the correct box and fire the blocks at it with Space / Clicking when they pass by. You will have to pay attention to either color/shape or size of the blocks when sorting (the mouse and keyboard icons will tell you which [pulsing = size, hueshifting = color/shape]), so pay attention to that.</p>\n<p>Notice the countdown at the top? That's how much time you have until something changes. Could be anything, you'll have to deal with it.</p>\n<p>When both green bars at the bottom are full, you'll have successfully performed surgery. Congratulations!</p>\n<p>Also, do remember that you're performing brain surgery on yourself. Messing up won't make your job any easier.</p>\n<p>NO CHEATING WITH TWO PLAYERS!</p>\n\n<p><strong>- - - - - P L A T F O R M - - - - -</strong></p>\n<p>This game is intended to run on 64-bit Windows Operating Systems.</p>\n<p><strong>- - - - -  R E S O U R C E S - - - - -</strong><br/></p>\n<p>Programming &amp; Design: Soul<br/>Art: LordCloud<br/>Menu BGM: shalpin - Icy Wastes (https://opengameart.org/content/icy-wastes - CC-BY 3.0 https://creativecommons.org/licenses/by/3.0/) <br/>Main BGM: Kim Lightyear - Time Is Ticking Away (https://opengameart.org/content/time-is-ticking-away - CC-BY 3.0 https://creativecommons.org/licenses/by/3.0/)<br/>Glitch Effect: Keijiro Takahashi - KinoGlitch (https://github.com/keijiro/KinoGlitch)<br/>WASD &amp; Mouse Sprite: InanZen - Arrow Keys, WSAD, Mouse Icon (https://opengameart.org/content/arrow-keys-wsad-mouse-icon - CC0 https://creativecommons.org/publicdomain/zero/1.0/)<br/>Victory Sound: Jon K. Fite - Victory! (https://opengameart.org/content/victory-2 - CC-BY 3.0 https://creativecommons.org/licenses/by/3.0/)</p>\n<p><strong>- - - - -  T O O L S - - - - -</strong></p>\n<p>Unity 5<br/>GIMP<br/>Bfxr<br/>Audacity<br/>Inkscape</p>", "metacritic": null, "released": "2018-09-02", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/74c/74ca9f1742a0a962c685a4c2e51fc2ff.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 11, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Soul"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}