{"id": 215348, "slug": "loneliness-itch-jordan-magnuson", "name": "Loneliness (itch) (Jordan Magnuson)", "name_original": "Loneliness (itch) (Jordan Magnuson)", "description": "<p>An experimental, minimalistic microgame about loneliness, made in 2010.</p>\n<p><em>Loneliness </em>was an official selection of the Extra Credits Innovation Awards 2011, in the category of Narrative Delivery. It was also the focus of episode 25 of Extra Credits season 4: Mechanics as Metaphor.</p>\n<p>Discussion and Reactions: Ludum Dare, Notgames Forums, TIGForums, FlashPunk Forums, Newgrounds, Kongregate, Twitter, IndieGames.com.</p>\n<p>Source: GitHub</p>\r\n.\r\n.\r\n.\r\n.\r\n.\r\n.\r\n.\r\n.\r\n\r\n.\r\n.\r\n.\r\n.\r\n.\r\n.\r\n.\r\n.\r\nSome kind words:\r\n\"Affected me the first time, and even more strongly the second.\" <br/>-Gregory Weir, creator of <em>Necropolis</em> and <em>The Majesty of Colors</em>\r\n\"What’s amazing about it is that it undeniably has a narrative, even though it features no words… but what’s more incredible to me is how different that narrative can be for different people… This game not only tries to put us in the emotional state of that crushing loneliness… but it lets us explore it, and this to me is the unique power games have.\"<br/>-James Portnow, co-creator of the <em>Extra Credits</em> video lesson series\r\n\"Made me really really really really really really really really really sad inside.\"<br/>-Elspeth, NG Comments\r\n\"Worth every second.\"<br/>-PlayIndieGames.Wordpress.com\r\n\"I can’t say that this game makes me feel particularly lonely, or particularly sad. But what it does do (very well, I think), is force me to make a decision: will I continue to engage, even though I KNOW it’s fruitless, or will I give up? And that question, I think, is profound. Because that IS what loneliness feels like: a never ending pattern of rejection. A hopeless state which will not change. And the only choices are to despair (to move, alone, into the dark), or to continue to pour out energy in what we believe (what we feel we KNOW) to be a pointless endeavor. What I loved about the game was that it demonstrated that, despite my knowledge of futility, I couldn’t choose isolation.\"<br/>-AmelMag, NG Comments\r\nOn the flip side:\r\n\"Ye gods, it’s not emo sixth form poetry these days is it, it’s dreadful indie games.\"<br/>-Kate S, Twitter\r\n\"So grauenhaft wie das und seine anderen Spiele programmiert sind, glaube ich eher dass er diese \"schlichte\" Aufmachung leider nur wählt weil er es nicht besser kann.\"<br/>-Besucher2778, Spreeblick.com\r\n\"The meta-game reason for it aside; it does have nice music and visuals, but you can’t use ‘minimalist’ as an excuse for not having any real content. There’d be many ways to take some time and actually give it a point beyond the meta-game point to it. Games can have meanings and messages beyond just being a ‘game,’ but a game must have some sort of rules and goals to it to fulfill its primary purpose as a game. Without that, it doesn’t matter the reasoning or point to it, it’ll just be dull.\"<br/>-Pyrewraith, Kongregate\r\n\"Lame as fuck.\"<br/>-Greg, IndieGames.com comments", "metacritic": null, "released": "2018-08-29", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/b2a/b2a2ae9cb4a921dcec72ff7a4bd15a3b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 8, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["Jordan Magnuson"], "genres": [], "publishers": [], "esrb_rating": null}