{"id": 21538, "slug": "broadsword-age-of-chivalry", "name": "Broadsword: Age of Chivalry", "name_original": "Broadsword: Age of Chivalry", "description": "<strong>Broadsword: Age of Chivalry</strong> boasts turn-based strategy gameplay as players move from mission to mission in the Middle Ages.  Command one of four different armies: the English, The French, the Spanish, or the Hapsburgs in this exciting PC game.  Lead different types of units into battle -- from archers, knights, pikemen and catapults with special units per nationality.  Control special 'heroes' units such as Henry III, Joan of Arc and El Cid, among others whose special 'hero' powers can affect the entire battlefield. Set in medieval Europe.  The game features four playable factions, a single player campaign, strategic gameplay, asynchronous multiplayer matches, and cinematic battle sequences.Game Feature Overview<br/><ul><li>Campaign 1.  Learn the basics of war and help Joan of Arc drive out the English from her homelands.  <br/></li><li>Campaign 2.  Join King Edward III in his campaign against King Philip VI to reclaim the lands that are his by birth right. <br/></li><li>Multiplayer.  The game will feature asynchronous gameplay, e.g. Words With Friends Turn-Based multiplayer.<br/></li><li>Factions.  The game will feature four playable factions (French, English, German, and Spanish).<br/></li><li>Watch your troops fight boldly in full 3D Battle Action!<br/></li><li>Take control of special ‘Hero’ units like Henry III, Joan of Arc, El Cid and others who command special ‘hero’ powers affecting the entire battlefield.<br/></li><li>Command different types of units from archers, knights to pikemen, catapults and more.<br/></li><li>Optional features such as FOG of WAR, Graphic Detail and more.</li></ul><br/>The player will undertake a chain of missions in the 1st Campaign, that follow Joan of Arc as she liberates France from the English. The campaign also functions as introduction/tutorial to teach new players the game features in the most engaging way. It will begin with the Siege of Orleans and continue through to the Battle of Patay. The second campaign follows King Edward III in his campaign against King Philip VI to reclaim the lands that are his by birth right.Plan your Strategy <br/><ul><li>Play on a variety of maps in distinct weather conditions.<br/></li><li>Terrain has a direct effect on the players’ strategy and combat.<br/></li><li>Turn-based combat keeps the battle moving at the player-preferred pace.<br/></li><li>Players construct &amp; upgrade buildings like town centres, mines, mills, and farms to raise units and create resources for their empires!<br/></li><li>Players research different technologies like Forestry, ballistics, husbandry and more to take their empire into the next tech level.<br/></li><li>Combat Advisor provides an indication of how the battle might go.</li></ul>Additional Features <br/><ul><li>Original music from German film composer Jan Morganstern.</li></ul>Multiplayer<br/>Players are able to challenge another human opponent to a match.  It will start with a person picking their faction and then choosing a map.  Once each player has a faction and map has been chosen, the players will enter the game.  Since it is asynchronous, each player will take their turn, moving units and capturing points.Game Mechanics<br/><ul><li>Map. The map is a 3D model, where each of the borders of the hexes are on the same plane, at y=0.   The size of the map is between 20-30 hexes wide and 20-30 hexes deep.<br/></li><li>Capital city. Each player begins each match with a capital city.  A player wins by capturing his opponent’s capital and loses if the opponent captures theirs.  The capital city performs several functions: It provides resource each turn, it’s the only place where players can build troops (if they have the correct buildings unlocked), and it contributes to the amount of troops a player can field.<br/></li><li>Capital city upgrades.  A player’s capital begins the game as a town square.  If the player has the necessary resources it can be upgraded to a castle, and then a stronghold. Each upgrade increases resource income, defense, and supply limit.<br/></li><li>Resources.  Players must collect resources in order to build units and fortifications.<br/></li><li>Gold.  Gold is spent to construct units.<br/></li><li>Wood.  Wood is spent to construct buildings and fortifications.<br/></li><li>Food.  Food determines the amounts of units a player can field.</li></ul>", "metacritic": null, "released": "2015-05-15", "tba": false, "updated": "2024-03-09T08:25:10", "background_image": "https://media.rawg.io/media/screenshots/1ce/1ce1971099475f3cd1961d7860682562.jpg", "website": "", "rating": 1.72, "rating_top": 1, "added_by_status": {"yet": 19, "owned": 648, "dropped": 4}, "playtime": 1, "achievements_count": 0, "ratings_count": 18, "suggestions_count": 366, "game_series_count": 0, "reviews_count": 18, "platforms": ["PC"], "developers": ["Hoplite Research"], "genres": ["Action", "Strategy", "Simulation"], "publishers": ["Kiss", "Funbox Media"], "esrb_rating": null}