{"id": 215395, "slug": "gam-james", "name": "Gam & James", "name_original": "Gam & James", "description": "<p>Hey this is our game for Mark Brown's GMTK 2018 Jam.</p>\n<p>The theme was \"genre without mechanics\" so we chose to remove shooting from our game and make it more defensive with a big ol blue guy with a shield and a completely vulnerable  but strong smaller guy. <br/></p>\n<p>This was made by a group of guys that mostly did a jam  for the first time. Really cool experience to try out together, the game is nowhere near finished but it was fun and we didn't feel the need to pressure ourselves too much pulling all-nighters. <br/></p>\n<p>This is a two player game, though you have to carry the larger player frequently so honestly you could get away with playing this by yourself. </p>\n<p>Controls for the two players:</p>\n<p>James (larger blue dude):</p>\n<p>A and D for movement</p>\n<p>W to jump<br/></p>\n<p>Q,E for moving shield (once it is held down with S)</p>\n<p>Gam (smaller pink dude):</p>\n<p>Left and Right arrow keys for movement</p>\n<p>Up arrow key to jump and throw if you're carrying the other player</p>\n<p>Down arrow key to pick up the other player. </p>\n\n<p>This was made by four people:</p>\n<p>Coding, Vape Mastery, Rocket League Addict,  Computer Hacking:</p>\n<p> Alex Matheson  https://matho.me/<br/></p>\n<p>Coding and Trawling Through Terrible Royality Music Bios, Ya Standard Weeb, Gnarly Scooter Boi, Connoisseur of Pickled Onions and Hummus:</p>\n<p>Darcy Phillips  phillda.non@gmail.com</p>\n<p>Art and Game Maker Wizard, Idubbz Impersonation, Individual of Good Video Game Taste, Drawing Ugly Creatures:</p>\n<p> Daniel Ferguson  danielfergusonn@gmail.com</p>\n<p>Lousy Animations and Art, Cooker of Beanz,  Wears Caps Because He Doesn't Do His Hair,  Concept Artist Wannabe:</p>\n<p>Sal Fontaine  https://www.instagram.com/sal_fontaine/<br/></p>\n\n<p>Lastly, we wanna say thanks to Mark and I'm assuming his team(?) for making really incredibly astute videos on video game mechanics and themes.<br/></p>\n<p>Good luck to everyone I hope you got something out of it.<br/><br/><br/></p>", "metacritic": null, "released": "2018-09-02", "tba": false, "updated": "2019-08-28T23:20:27", "background_image": "https://media.rawg.io/media/screenshots/3d8/3d803ffe12b9b83d78d55704c7c63fec.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 72, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["salfontaine"], "genres": ["Action", "Shooter", "Platformer"], "publishers": [], "esrb_rating": null}