{"id": 215495, "slug": "pong-but-you-cant-move-gmtk-jam", "name": "Pong But You Can't Move (GMTK Jam)", "name_original": "Pong But You Can't Move (GMTK Jam)", "description": "<p>A GMTK Jam 2018 game.</p>\n<p>Not sure if it quite hits the <em>genre</em> part of the prompt, but this game ended up being a lot of fun to make and toy with. I hope you enjoy it, too!<br/></p>\n<p>When you start up, check what direction the ball will move, place your block by clicking with the mouse, and then the AI player will place one, too. Then \"play\" starts--but, well... you can't move. That's all you get; you get one block until your opponent scores on you (and likewise for your opponent). There are some rules about placing new blocks to keep from obvious min-max strategies, like walling off.<br/></p>\n<p>Try to figure out the best ways to place your blocks so that they not only repel the initial shot, but also remain useful throughout the match!</p>\n<p>Play is scored on a differential, i.e. your lead is what counts, not your points. First to seven wins. Additionally, if a player has to place a block and there is no valid position for it, that player loses.</p>\n<p><strong>Some Things to Note: </strong></p>\n<ol><li>I went with retro sound; I tried to keep it from being harsh as retro can sometimes be, but thought to warn you anyway.</li><li>There's definitely some physics jank in here. The ultimate outcomes are usually close to the expected, but you might notice some odd looking bounces here and there. Chalk it up to time and my finite brain power. If you get any softlocks, I do apologize.</li><li>Even if the physics are perfect, there's still some cases where the ball will end up in an infinite loop. I plan on adding a solution to do this in a patch, but it's currently not there. This is a soft lock. I do apologize.</li><li>Thanks to Arne on LOSPEC for a solid, simple palette: https://lospec.com/palette-list/generic-8-color</li></ol>", "metacritic": null, "released": "2018-09-02", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://img.itch.zone/aW1hZ2UvMzAwOTA1LzE0NzE4MjQucG5n/original/006lMv.png", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["epiblitikos"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}