{"id": 21557, "slug": "president-for-a-day-corruption", "name": "President for a Day - Corruption", "name_original": "President for a Day - Corruption", "description": "<strong>President for a Day - Corruption</strong> gives you the opportunity to assume the role of an African president. As such, you must make controversial decisions revolving around topics such as: democratic evolution, corruption, development aid- and cooperation. The game provides a solid foundation for discussions regarding e.g., human rights, cultural differences and governance. There are four diverse scenarios with a set difficulty for the player to engage – scenarios ranging from famine to effloresce of democracy.<br/><br/>In PFAD - Corruption you will be faced with a wide array of dilemmas that stem from recent events in African history. You will also witness the local and national effects of modern bilateral cooperation. What kind of leader will you be? Will you strive for democracy, or rule the country with an iron fist?<br/><br/>The subjects regard:<br/><ul><li>Famine, caused by draught and climate change<br/></li><li>Foreign intervention from neighbouring, as well as, western countries.<br/></li><li>Ethnic conflicts spun by the numerous African tribes, as well as the borders established, in the past, by the colonial forces.<br/></li><li>The political culture of the country, in regards to upholding (or failing thereof) human rights.</li></ul><br/>Target audience: 13+ years old.", "metacritic": null, "released": "2015-08-05", "tba": false, "updated": "2019-09-17T13:02:00", "background_image": "https://media.rawg.io/media/screenshots/ed4/ed47521744c8a006d36978f4c2b22752.jpg", "website": "http://pfad.nu", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 103, "dropped": 1}, "playtime": 3, "achievements_count": 5, "ratings_count": 1, "suggestions_count": 229, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "macOS"], "developers": ["Serious Games Interactive"], "genres": ["Strategy", "Casual", "Indie"], "publishers": ["Serious Games Interactive"], "esrb_rating": null}