{"id": 215537, "slug": "dangerous-plane-flappy-ride", "name": "Dangerous Plane: Flappy Ride", "name_original": "Dangerous Plane: Flappy Ride", "description": "<p><strong><em>Don't get blown to ashes!</em></strong></p>\n\n<strong>Simple and intuitive two button controls!</strong>\n\n<p>Make your way through the deadly spinning blades, <em>time your jumps</em> just enough to go past them.</p>\n<p>Take advantage of the <strong>limited bullets</strong> at your disposal. You can have only 3 of them.</p>\n<p>Use your bullets just before a head-on collision to save your ass at the last moment. But they won't save you from crashing vertically.</p>\n<p>Don't worry your bullets will <em>regenerate</em>. Every 10 seconds a bullet regenerates. The time to regenerate <em>decreases</em> as you last further in the game.</p>\n<p>The game gets harder the longer you survive in it as you have to move at <strong>higher speeds.</strong></p>Strategically choose the right path and blow through whatever comes in your way.\n<p>The game rewards players who can stay calm and patient yet have a quick thinking to make the right decisions at the right time.  If you go in this game with a hammer approach you will get smoked.</p>\n<p><strong>Look for the right opportunity to jump and you will live to fight another blade!</strong></p>\n\r\nUse your bullets carefully to have them available to save you at the last moment! \r\n\n<p>The game's jump mechanics may be inspired from beloved games like Flappy Bird or Jetpack Joyride but it is much different. The gameplay is tuned to provide precision to the player. You know when you screwed up,  you won't be experiencing 'spray and pray'. </p>\n<p>Featuring symphonic and orchestral music, relax and immerse yourself in the game as you look to beat that high score.</p>\n<p>And don't forget, <strong>Keep Enjoying Video Games! </strong></p>", "metacritic": null, "released": "2018-09-02", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/a91/a91d84fda9261a1e0a4a8155346ba244.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 41, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["SK_27"], "genres": [], "publishers": [], "esrb_rating": null}