{"id": 2156, "slug": "bad-piggies", "name": "Bad Piggies", "name_original": "Bad Piggies", "description": "<p>From the creators of Angry Birds: a game from the PIGS’ point of view! OiNk! Build makeshift contraptions from a huge collection of parts and make it to the goal without blowing your vehicle to pieces!</p>\n<p>IGN&#39;s &quot;Best Mobile Game of 2012&quot; Winner!</p>\n<p>&quot;Extremely fun and very challenging&quot; -- Kotaku</p>\n<p>“The best title Rovio has released yet” - IGN</p>\n<p>“4/4 - Must Have” -- Slide to Play</p>\n<p>&quot;Bad Piggies is awesome, and needs to be a part of your iOS game collection just as much as the rest of the Angry Birds series&quot; - Touch Arcade</p>\n<p>&quot;If you can’t enjoy watching a pig drive a badly constructed car off a cliff and onto a pile of dynamite, you probably don’t have a soul.&quot; - Yahoo/BGR</p>\n<p>Create the ultimate flying/crawling/rolling/spinning/crashing device and pilot the pigs safely to the eggs!</p>\n<p>The Bad Piggies are after the eggs again -- but as usual, nothing is going according to plan! Can you create the ultimate flying machine and steer them safely to their destination? Those tricky pigs have a few objects they can use, but they need your help to turn these into the perfect transportation!</p>\n<p>With more than 200 levels, and free updates coming up, you have hours and hours of pig-crashing, exploding, and flying fun! Get three stars to unlock over 40 more levels! HINT: Sometimes you need to play the level several times to achieve all the objectives -- try building a new device or steering in a different way to earn all the stars!</p>\n<p>Features:<br />\n● Over 200 levels crammed with flying/driving/crashing fun!<br />\n● 40+ special levels unlocked by getting three stars!<br />\n● Free updates!<br />\n● 9+ sandbox levels to stretch your creativity!<br />\n● Ultra-special, ultra-secret, ultra-difficult sandbox level to unlock by collecting ten skulls! Oh – guess it’s not a secret anymore...<br />\n● 42 objects to create the ultimate machine: motors, wings, fans, bottle rockets, umbrellas, balloons, and much more!</p>\n<p>Mechanic Pig<br />\n● Need help? This little piggy will build it for you!<br />\n● Mechanic pig pre-assembles transport for you!<br />\n● All you have to do is pilot it!<br />\n● Tweak his design to get all three stars!</p>\n<p>New Episode: The Road to El Porkado<br />\nEmbark on an archaeological adventure in an all new episode full of treacherously icy environments and spooky dark caves. Be sure to equip the trusty lamp to find your way in the darkness – or put the new Night Vision Goggles power-up to use!</p>\n<p>Get ready to see pigs fly!</p>\n<p>Become a fan of Bad Piggies on Facebook:<br />\nhttp://facebook.com/badpiggies</p>\n<p>Follow us on Twitter:<br />\nhttp://twitter.com/badpiggies</p>\n<p>Terms of Use: http://www.rovio.com/eula<br />\nPrivacy Policy: http://www.rovio.com/privacy</p>\n<p>Important Message for Parents</p>\n<p>This game may include:<br />\n- Direct links to social networking websites that are intended for an audience over the age of 13.<br />\n- Direct links to the internet that can take players away from the game with the potential to browse any web page.<br />\n- Advertising of Rovio products and also products from select partners.<br />\n- The option to make in-app purchases. The bill payer should always be consulted beforehand.</p>", "metacritic": 83, "released": "2012-09-27", "tba": false, "updated": "2024-03-20T13:31:08", "background_image": "https://media.rawg.io/media/screenshots/0df/0dfbce453a81c8a9dd51df52b6f5c3d2.jpeg", "website": "http://www.rovio.com", "rating": 3.88, "rating_top": 4, "added_by_status": {"owned": 28, "beaten": 35, "toplay": 1, "dropped": 25, "playing": 1}, "playtime": 7, "achievements_count": 12, "ratings_count": 43, "suggestions_count": 264, "game_series_count": 0, "reviews_count": 43, "platforms": ["PC", "iOS", "Android"], "developers": ["Rovio Entertainment", "Rovio Entertainment Oyj"], "genres": ["Arcade", "Casual", "Puzzle"], "publishers": ["Rovio Entertainment", "Rovio Entertainment Oyj"], "esrb_rating": null}