{"id": 21572, "slug": "last-half-of-darkness-society-of-the-serpent-moon", "name": "Last Half of Darkness - Society of the Serpent Moon", "name_original": "Last Half of Darkness - Society of the Serpent Moon", "description": "BONUS - Three Last Half of Darkness Chapters included FREE!This package includes Society of the Serpent Moon PLUS 3 Additional Last Half Games too! (Shadows of the Servants, Beyond the Spirit's Eye, Tomb of Zojir)<br/><br/>Story<br/>You receive a strange package with a scrawled note, a mysterious map, and your fiancé's ring with blood on it. <br/><br/>The return address on the package reveals it came from Antibes. Where only a few days earlier your fiancé was sent to write and investigate a story on a series of vampire-like murders that have plagued the dark streets and alleys of the tiny European town. Your journey follows the path of clues left behind by your girlfriend, where along the way you will have to solve an ancient mystery and the source of evil causing the local townsfolk to turn into a rare breed of savaged night-thirsty murderers.<br/><br/>Your plane leaves tonight... are you ready to once again uncover the secrets behind another chapter of the <strong>Last Half of Darkness?</strong>Features<br/><ul><li>Third-Person Point and Click Style Game Play* <br/></li><li>Cinematic Movie Cut Scenes <br/></li><li>Dynamic Fog and Rain Effects <br/></li><li>Strange and Mysterious Puzzles <br/></li><li>Creepy and Horrorfying Thriller Mystery </li></ul>Three Last Half of Darkness Chapters included FREE!*Bonus games are First-Person View", "metacritic": null, "released": "2015-08-03", "tba": false, "updated": "2019-08-28T22:07:58", "background_image": "https://media.rawg.io/media/screenshots/e81/e8170f095af7c6a28651148288934211.jpg", "website": "http://www.lasthalfofdarkness.com/moon", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 9}, "playtime": 6, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 510, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["WRF Studios"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["WRF Studios"], "esrb_rating": null}