{"id": 21576, "slug": "draconian-wars", "name": "Draconian Wars", "name_original": "Draconian Wars", "description": "Are you ready for a new level in online card games? Draconian Wars is possibly the most strategic and challenging online card game out there. Engage in fierce combats, manage your limited resources and outmaneuver your opponent. <br/>Draconian Wars is a game of combat, resource management and battlefield tactics. The battlefield is the lands and skies of Hyperborea, an exotic continent rich in natural resources, with a wide variety of ecosystems and full of amazing and terrifying creatures. <br/><br/>During thousands of years Hyperborea has been under the uncontested control of the Draconians, but now the Technocrats have arrived to the shores of the continent and they claim what once was theirs. The control of the land is what will bring victory to one or other. The Draconian extract their magic power from the earth, consuming the live and the natural resources around them. On the other hand, the power of the Technocrats comes from carbon and steel, both equal abundant in Hyperborea.<br/>A battle for supremacy over Hyperborea has begun and one thing is clear, no matter who wins, the scars on the lands of Hyperborea will last for centuries.<br/><br/>In Draconian Wars players build their decks of 50 cards and try for their opponent to run out of resources. They can accomplish this by controlling as much areas of hyperborea as they can, or just crushing the opponent in battle.<br/>Players have a mixture of ground and air units to spread terror across the lands of Hyperborea. Also, they have a lot of surprises that can change the fate of any battle. The options are endless.Key features <ul><li>No boosters! Every card included in the game. <br/></li><li>Two different factions: Draconian and Technocrat. Each faction has completely different strategies. <br/></li><li>150 Unique cards available as you progress in the game. <br/></li><li>Online mode and two different single player modes: Skirmish and Challenge. <br/></li><li>Fully customizable decks.<br/></li><li>Extensive tutorial mode to learn all the mechanics<br/></li><li>Achievements, leaderboards and trading cards</li></ul>", "metacritic": null, "released": "2014-08-28", "tba": false, "updated": "2019-08-28T22:07:58", "background_image": "https://media.rawg.io/media/screenshots/8a4/8a49e6ce5933db58abb8a1afc6bc0752.jpg", "website": "http://www.draconianwars.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 68, "toplay": 1}, "playtime": 2, "achievements_count": 27, "ratings_count": 1, "suggestions_count": 485, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Kardfy Studios"], "genres": ["Strategy", "Indie"], "publishers": ["Kardfy Studios"], "esrb_rating": null}