{"id": 216037, "slug": "pavlovs-parrot", "name": "Pavlov's Parrot", "name_original": "Pavlov's Parrot", "description": "<p>Try to coax a parrot to navigate a level by rewarding it for good behaviour and punishing it for bad behaviour.</p>\n<p>My entry for the GMTK Game Jam 2018. The theme is GENRE without MECHANIC, so this is a platformer without any direct control of the player character (a parrot). Instead, the player must reward actions that they want the parrot to do and punish actions they don't want it to do. Rewarding actions will make that action more likely in the future, and punishing will make it less likely. However, all probabilities are based on what the parrot can currently see in front of it - if the parrot has been rewarded for go forward while it can see leaves, it will only be more likely to go forward in the future if it can see leaves. This means different actions can be associated with different stimuli to allow the parrot to traverse the level.</p>\n<p>Arrow keys are all that are required to play (except pressing X to begin the game).</p>\n<ul><li>The UP arrow rewards an action.</li><li>The DOWN arrow punishes an action.</li><li>The LEFT and RIGHT arrows decrease and increase the game's speed respectively.</li></ul>\n<p>Tips:</p>\n<ul><li>Navigate the parrot to the cherry to win the game.</li><li>The parrot remembers what it learnt even if it dies - use this to your advantage!</li><li>The parrot can see three squares in front of itself. If there is nothing ahead, it will see \"nothing\" (which can itself be associated with actions).</li><li>There are four types of stimuli the parrot can see - \"nothing\", leaves, wood and metal.</li><li>There are 3 actions the parrot can do - go forward, turn around, and toggling flight.</li></ul>\n<p>My girlfriend came up with this idea in a matter of seconds after I had already racked my brain for several hours. Thank you for saving my game jam! :) &lt;3</p>", "metacritic": null, "released": "2018-09-02", "tba": false, "updated": "2019-08-28T23:20:23", "background_image": "https://media.rawg.io/media/screenshots/f23/f23c0fc759caffed498fe22f85ea0f3d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 70, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["treewyn"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}