{"id": 216373, "slug": "age-of-viking-conquest", "name": "Age of Viking Conquest", "name_original": "Age of Viking Conquest", "description": "Age of Viking Conquest is a conquest simulation set at the time of the vikings invasions of Europe. The goal of the game is to become the dominant major power amongst the key powers of Northern Europe. Play as Sweden, Norway or Denmark and expand your zone of influence. Raise your drakkars and ensure your dominance on land and sea!<br/>\n<br/>\r\nFeatures<br/>\n<br/>\r\n- Return to the era of Golden Warfare and rule one of the few dominant viking kingdoms on the verge of shaking the balance of power in Europe and prove to be one of the most important military and cultural forces of the ear.<br/>\r\n- Sail, ride and march across Europe as your nation flexes its military and economic muscles.<br/>\r\n- Supplement brawn with subterfuge and use cloak and dagger tactics such as subversion and espionage.<br/>\r\n- Compete with other Northern Kingdoms and with the largest Continental powers.<br/>\r\n- Play as one of the three major viking kingdoms: Norway, Sweden or Denmark.<br/>\r\n- Play against the AI or other human claimants to the mastery of Europe.<br/>\n<br/>\r\nMore about the game<br/>\r\nYou win by either scoring the most Victory Points (VPs) or being the first to reach a certain preset VP threshold, depending on scenario and custom choices in the main menu. To do so, you must capture regions over the world, and defeat your enemies in battle.<br/>\n<br/>\r\nThe world has about 130 regions open to conquest. The regions have variable income and VP values (set randomly in the Standard scenario) and unknown until conquered or spied upon. Each region not owned by a Major Power usually has an independent Minor country owning and defending it.<br/>\n<br/>\r\nEach Major country is controlled by a human player or the computer, or is designated neutral and then acts as a Minor country.<br/>\r\nHotseat play is possible, with an option to limit to 4.00 minutes the playing time per player.<br/>\r\nEach game turn represents roughly one season.<br/>\r\nGame lasts till victory conditions are achieved.<br/>\n<br/>\r\nScenarios: game offers 3 scenarios: An historical scenario, and advanced scenario and a free-for-all, all random and non-historical scenario.<br/>\n<br/>\r\nThe game has 3 main phases, each player entering them in sequence, i.e. Build Phase (Spring only, with: Army &amp; Navy Construction, Fortification, Economic Aid, Espionage, Subversion), Movement Phase (Army &amp; Navy), and Combat Phase.<br/>\n<br/>\r\nGameplay of each phase is rather simple and straightforward, as follows:<br/>\n<br/>\r\n- Army and Navy Build Phase (Spring): Create new armies and fleets in your Supply Centers<br/>\r\n- Fortification Phase (Spring): Fortify army units (except in Supply Centers which are already fortified).<br/>\r\n- Economic Aid Phase (Spring): Lend money to other Major countries; which is added to their Treasury. Or Lend money to neutral Minor countries; which they use immediately to build armies.<br/>\r\n- Espionage Phase (Spring): Learn the approximate (not always accurate) army strength and the income of a Minor country or of an region controlled by a Major country. And the region’s VP value<br/>\r\n- Subversion Phase (Spring): Spend money to bribe a Minor country's army, weakening the country's defense or causing a coup (giving you control of the said country in return).<br/>\r\n- Movement Phase (All turns): Move armies to adjacent regions only. Move navies alone or with armies from one port to another (or carry regiments to amphibious landings on enemy holdings).<br/>\r\n- Combat Phase (All turns): up to twenty rounds of battle; each consists of naval (if ships are present) then land battles <br/>\r\n- and remember to care about the weather, from deadly tempests to freezing winters!", "metacritic": null, "released": "2018-09-19", "tba": false, "updated": "2019-09-13T05:30:21", "background_image": "https://media.rawg.io/media/screenshots/8d1/8d12711062eaf44b95b2b6afa193281c.jpg", "website": "http://www.ageofvikingconquests.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 3, "toplay": 1}, "playtime": 1, "achievements_count": 33, "ratings_count": 0, "suggestions_count": 458, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "PC", "macOS"], "developers": ["Stephane Oury", "Nemoïd Apps"], "genres": ["Strategy", "Simulation", "Indie"], "publishers": ["Argonauts Interactive", "Stephane Oury"], "esrb_rating": "Everyone 10+"}