{"id": 216314, "slug": "br-logic-pack", "name": "BR Logic Pack", "name_original": "BR Logic Pack", "description": "<strong>Game bundle with 6 puzzle / logical games.</strong><br/>Something for those who like pipes, tiles, math games, falling blocks, and challenges. In total 80 hand made levels, and unlimited number of randomly generated (depending on game you can choose map size and difficulty), shared screen option in 2 games. Ambient games, without tons of distractions and annoying popups. Puzzle themed music and basic sound effects.<br/><br/><br/><strong>Short descriptions of included games:</strong>BR PipesBuild your own drains. Place pipes on map to allow transport water from start point to end. Play on small and large maps, in 4 game modes + crazy color variation, try to beat all 40 levels.Colored TilesSimple and fast strategic game. Your goal is to conquer the map by taking over colored tiles. To take any tile your colors must be the same, and that tile need to be adjacent to your other tiles. In 'Skirmish' mode you can play with up to 4 players and AI with 3 difficulty levels.Plus or minusFast logic game, based on the original concept, slightly related to mathematics, more focused on planning and strategic approach. 3 game modes (Skirmish, Negation, Stars), in 'Skirmish' mode you can play with up to 4 players and AI with 3 difficulty levels.Twisted LineTurn all dark tiles into light tiles by drawing a single line, that's it! Pick up keys to unlock blocked tiles, use special blocks to pass harder levels. Game includes 12 hand made levels.Colorfull RibbonsCover all tiles with properly colored ribbons. Various ribbons can interweave, each of them marks tiles of same color as covered. Game includes 18 hand made levels.TetrilesBest classic if you have some spare time. Simple graphic with 3 art styles for blocks and responsive controls.", "metacritic": null, "released": "2018-09-29", "tba": false, "updated": "2019-08-28T21:53:50", "background_image": "https://media.rawg.io/media/screenshots/d3e/d3e51a4a9f5859b5df66d92e0f6bc88b.jpg", "website": "http://www.dreamerman.netserwer.pl/br/apps/brlogic.php", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 115, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Benarom Games"], "genres": ["Action", "Strategy", "Casual", "Indie"], "publishers": ["Benarom Games"], "esrb_rating": null}