{"id": 21638, "slug": "beast-boxing-turbo", "name": "Beast Boxing Turbo", "name_original": "Beast Boxing Turbo", "description": "An artfully designed first-person boxing game with freestyle arcade action in which you punch a turkey in the face.<br/><br/>Beast Boxing Turbo is a challenging first-person boxing game with fast-paced freestyle boxing action. You play a secret human boxer in a beastly world. She's outmuscled, undersized, and in way over her head. Can she master the skills needed to get to the top of the legendary boxing leagues of Beasthalla?<br/> <br/>Develop a fighting rhythm between attack and defense, and don't give up hope if you can't beat these monsters on your first try. There's a host of skills to train, and new gear to acquire that can give you an edge in the ring. Build up your boxing skills to match your personal style, and beat the grand champion of the Ultra League to unlock NewGame Plus mode and reach a new level of challenge.<br/><br/>PRESS AND REVIEWS:<br/><br/><ul><li>\"True PC Gaming, Best of 2012\" - Adam Ames,  True PC Gaming<br/></li><li>\"the game plays like a modern-day Super Punch Out\" - Aaron Righter, Indie-Love<br/></li><li>\"Beast Boxing Turbo believes in the old-school joys of quick reflexes and combo mastery.\" - Becky Chambers, The Mary Sue<br/></li><li>\"a lovely hand-drawn art style\" - Jim Rossignol, Rock Paper Shotgun</li></ul><br/>KEY FEATURES:<br/><br/><ul><li>Fast-paced arcade gameplay and controls: Controls optimized for gamepad and keyboard that will let you deliver combos with quick straight punches, high-powered hooks and uppercuts.<br/></li><li>Powerful Opponents: From Steve the Fitness Skeleton to Kamander the Snake Cyclops Sensei, these monsters are going to eat you for breakfast... until you can interrupt their devastating attacks to take their league titles!<br/></li><li>In-Depth Training: There's a lot to learn in Beast Boxing - a lead-hand jab is way more likely to hit than an right uppercut... unless your opponent's guard meter is low in the middle of a sweet combo. Never fear, though, there are plenty of training sessions that Coach Piglas will put you through!<br/></li><li>Customizable Gear System: What would a fantasy game be without armor? As you build up your fight winnings, spend it on useful character gear. Equip the right stuff for an opponent, and you can come out ahead in a tough matchup.<br/></li><li>Awesome Monsters: With 12 fantasy opponents designed by Khang Le of Adhesive Games, art director of Hawken, you'll be up against some of the weirdest creatures to ever grace your computer screen... and then they'll give you the first-person boxing fight of your life!</li></ul>", "metacritic": null, "released": "2013-11-19", "tba": false, "updated": "2023-11-13T18:01:42", "background_image": "https://media.rawg.io/media/screenshots/0c5/0c5425b9edf4762b35face403c32d96f.jpg", "website": "http://www.beastboxing.com", "rating": 2.88, "rating_top": 4, "added_by_status": {"yet": 2, "owned": 213, "beaten": 2, "dropped": 2}, "playtime": 1, "achievements_count": 19, "ratings_count": 8, "suggestions_count": 418, "game_series_count": 0, "reviews_count": 8, "platforms": ["PC", "macOS"], "developers": [], "genres": ["Action", "Sports", "Indie"], "publishers": [], "esrb_rating": null}