{"id": 216378, "slug": "arcade-islands-volume-one", "name": "Arcade Islands: Volume One", "name_original": "Arcade Islands: Volume One", "description": "The ultimate collection of 33 games for up to four players!<br/><br/>Six exotic Islands filled with games and Treasure are waiting for adventures of all skill levels. Explore the Islands solo or invite a group of friends over for some local co-op and competitive gameplay.<br/><br/>Collect Treasure as you master all 33 games in your quest to be crowned Ruler of the Islands.<br/><br/>• Tons of Games! Climb, run, jump, blast, rocket, outwit, and even putt your way through 33 games spread out across six fun-filled Islands<br/>• Explore and Collect! Earn stars by playing games to unlock treasure, new Islands, and even more games<br/>• Island Hop with Friends! Join up to three other players for friendly competitive or cooperative play with just one system and one copy of the game<br/>• Claim the Crown! Fill your Treasure Hut with bounty from every game and climb atop the online leaderboards to claim the Crown<br/><br/>1-4 players<br/>DUALSHOCK®4<br/><br/>  Software subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service &amp; playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.<br/><br/>", "metacritic": null, "released": "2018-09-04", "tba": false, "updated": "2019-08-02T16:19:53", "background_image": "https://media.rawg.io/media/screenshots/e80/e80521edf31cc7dc71501d80e542e673.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 4, "dropped": 1}, "playtime": 0, "achievements_count": 29, "ratings_count": 0, "suggestions_count": 286, "game_series_count": 0, "reviews_count": 0, "platforms": ["PlayStation 4", "Xbox One"], "developers": ["Mastiff"], "genres": [], "publishers": [], "esrb_rating": "Everyone 10+"}