{"id": 216458, "slug": "tonk-multiplayer", "name": "Tonk Multiplayer", "name_original": "Tonk Multiplayer", "description": "World's FIRST Multiplayer Tonk!<br/><br/>Tonk, also known as Tunk is a kind of knock Rummy or variation of Gin Rummy. Five cards are dealt to each player. The next card is placed face up on the table to start the discard pile, and the remaining un-dealt cards are placed face down in a stack beside the discard pile to form the stock.<br/><br/>Game Features:<br/>1. Extreme User Friendly: Easy and refreshing interface.<br/>2. Play With Your Friends: Locate your friends and join their table with a simple click of a button.<br/>3. Play with Real Peoples: No robots like other Poker game. Play with only real players anywhere in the world.<br/>4. VIP Room: Unlock VIP rooms and play with VIP users.<br/>5. Chat &amp; Gift: Live in-game chat and exchange gifts and have lots of fun.<br/>6. Works Fast On Slow Internet: Works smoothly on slow Internet connection even like 2G.<br/>7. Play your way to top the Leaderboards! <br/>8. Tons of Achievements!<br/><br/>Get Chips:<br/>1. Initial Chips: Download now and get 10,000 chips!<br/>2. Daily Bonus Chips: Get more bonus chips than any other Poker game.<br/>3. Invite Bonus Chips: Get more chips on inviting friends.<br/>4. Weekly Winner Chips: Get Millions Chips on every week by participating on Weekly Contest!<br/><br/>Play this timeless classic card game anytime anywhere! With your friends or against real peoples from anywhere in the world. It’s a popular pastime for lunch breaks and family game nights.Try now this interesting card game on your iPhone, iPod and iPad!!<br/><br/>Having any problems? Any suggestions? We always love to hear from you and making this App better. <br/><br/>Thank you.", "metacritic": null, "released": "2014-10-28", "tba": false, "updated": "2019-10-22T14:20:16", "background_image": "https://media.rawg.io/media/screenshots/673/673acaa3c526a6576668e35148710e62.jpg", "website": "http://www.gamewithpals.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 168, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "Android"], "developers": ["Artoon Solutions"], "genres": ["Card"], "publishers": ["ARTOON SOLUTIONS PRIVATE"], "esrb_rating": null}