{"id": 21640, "slug": "aware", "name": "Aware", "name_original": "Aware", "description": "<strong>-Game Story-</strong><br/>You are stranded on an island, The plane you came with have crashed, and you are alive. To survive on the island you'll have to find food, water and shelter. It's up to you.<br/><br/>-Do you have the knowledge to know what you can eat or not?<br/>-Are you faster alone but maybe stronger as a team?<br/><br/>Decide how you want to play the game. Level your Account to unlock other characters and assets. Use your skills to make the character survive the best.<br/><br/><strong>-Key Features-</strong><br/><br/>Hunger and Thirst<br/>Your character is a normal human being. You need food and water to survive. If you don't have enough, you'll eventually get tired and slow. This will affect your gameplay. Use your mind and get supplies. Explore the world and see what you can eat and drink, but be careful!<br/><br/>Leveling System<br/>As you level your account you'll unlock more characters and assets. The more you explore the game, the faster you'll level up your character.<br/><br/>Skills<br/>Choose your way to survive. Every new game you start you can choose between different skills. Are you a runner or an explorer? You decide how you want to skill your character and play the game. <br/><br/>Gathering<br/>Gather different resources. Scavenge around the world and see if you can find anything useful. Use your tools for gathering different materials.<br/><br/>Crafting<br/>Use collected resources to craft different items in the game. Learn new prestige items to craft. Construct your housing and weapons to hunt animal and fight others to reach your goal.<br/><br/><strong>Game Modes</strong><br/><br/>The Crash - When released<br/>Multiplayer - This game mode is about survival after a plane crash and finding pieces to repair the plane. You'll survive alone against other players in this feature. Find the airplane part/-s as soon as possible to win. Use your survival abilities to slow other players down. Get your name as high as possible on the scoreboard, and see who the fastest players are.<br/><br/>Fortress - Future progress<br/>Multiplayer - This game mode is all about teamwork. Join a game lobby with your friends or sign up alone. Choose 2v2 , 3v3, or 5v5. You'll play in a world with alot of resources. Build a strategy with your team and collect wood, stone, food. Build households, weapons and much more! Construct your base in a smart way to fight of the other team. Fight against the other team and win.<br/><br/>Survival - Future progress<br/>Singleplayer - This game mode is about survival. You'll play alone and survive against harsh weather conditions, predators and diseases. Choose how the easiest way of surviving is for you. You have to find food, water, make shelter and be warm during bad weather conditions. As every day passes, the harder the game gets.<br/><br/>Search And Destroy - Future progress<br/>Mulitplayer - This game mode is a last man standing-mode. You start of in the woods alone and you'll have to find different weapons and gear to survive the best against other players.<br/><br/><strong>Singleplayer</strong> - Future progress<br/>The singleplayer is a story based gameplay where your main goal is to leave the island. The story starts way back home where you come from until you get on a plane which crashes and leaves you in the middle of nowhere. Search the island and do the missions. Craft and gather resources, build your home and plan your escape from the island.<br/><br/><strong>Multiplayer</strong><br/><br/>The crash<br/>Play up to 16 players on the server, each player on his own<br/><br/>Fortress<br/>1v1, 2v2, or 5v5<br/><br/>Search And Destroy<br/>Play up to 16 players on the server, each player on his own", "metacritic": null, "released": "2015-03-18", "tba": false, "updated": "2019-08-28T22:07:56", "background_image": "https://media.rawg.io/media/screenshots/fe2/fe28b3c0c4c4f0998a941b32a49554ed.jpg", "website": "http://www.play-aware.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 151, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Guilherme Nunes Barbosa", "Lennie Svensson", "Morgan Andersson"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Limevision Studios"], "esrb_rating": null}