{"id": 216473, "slug": "real-vegas-full-house-casino", "name": "Real Vegas - Full House Casino", "name_original": "Real Vegas - Full House Casino", "description": "*WELCOME to the best all-in-one option casino game! Install today and start your casino fantasy! We serve premium and trendy slot machine and table games! Install today and start your casino fantasy with Huuuge welcome bonus! <br/><br/>Full House Casino is a Vegas style casino with the best slots &amp; casino table games you know and love. <br/><br/>Play over 60+ Vegas &amp; Macau theme slot machines with most authentic land-based casino slots. We also have baccarat, bingo game, blackjack online, Holdem poker, roulette wheel, sic bo dice game, video poker, landlord war(Douzizhu) and many other games to not make you feel boring all day. <br/><br/>Try the best slots in our casino and take an immerse yourself in the real casino atmosphere! <br/>- Zeus, Buffalo, King Kong, Classic Slots, Africa, Robin hood, Wheel of Jackpot, Feng Shen Bang and a lot more fever slots with special features such as Scatter, Wild, Respin, Freespin and Grand Luxury Bonus Jackpot! Which slot will be your lucky slots? Find your top slots today! <br/><br/>777 Game Features 777<br/>• Casino games with unique, beautiful artwork and effects! <br/>• Amazing Vegas Slots! Classic Slots or Video slots!<br/>• Collect Huuuge bonuses and events every day to boost up your entertainment! <br/>• Weekdays &amp; Weekend quests to be completed for extra bonus chips! <br/>• Are you a fan of Powerball lotto? Be the Jackpot winner at Megaball lottery!<br/>• New slot games are added all the time, so the casino fun never ends! <br/>• Compete in free slot tournament all day long! <br/>• Invite your friends to play together. It's online social casino game! <br/>• Play free Gotcha with the gems you earnt! Collect stickers for higher rewards! <br/><br/>Full House Casino is Asia No.1 free online casino game with 5 million+ download and 500,000 5-star-rating! <br/>With Full House Casino, you don't have to head to Vegas to play real slot machines! You don't even have to fly to Vegas or Macau to play!<br/><br/>If you like going to real casino and hotel abroad, please stay tuned with Full House Casino in 2018! <br/>We are happy to announce our new partner, Paradise City, the biggest &amp; palatial Resort &amp; Casino in South Korea! Full House Casino will be offering variety of Paradise City products to our users in many different ways!<br/><br/>Like us on Facebook &amp; collect frequent bonuses: <br/>https://www.facebook.com/FullHouseCasinoFanspage/ <br/><br/>Contact us at cs@mplusfun.com for any queries! We are happy to help out! <br/>* Please take note of Service terms at official site before downloading.<br/>* The game is intended for an adult audience. <br/>* The game does not offer \"real money gambling\" or an opportunity to win real money or prizes. <br/>* Practice or success at social casino gaming does not imply future success at \"real money gambling\".", "metacritic": null, "released": "2014-09-23", "tba": false, "updated": "2019-10-22T14:20:16", "background_image": "https://media.rawg.io/media/screenshots/d6b/d6b7cce5982b2fec292d3e1f8789a44c_hHBFpMt.jpg", "website": "http://www.fhcasino.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 126, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Memoriki"], "genres": ["Card"], "publishers": ["Memoriki"], "esrb_rating": "Teen"}