{"id": 216547, "slug": "hidden-objects-mystery-society", "name": "Hidden Objects Mystery Society", "name_original": "Hidden Objects Mystery Society", "description": "Join the secret Mystery Society and find hidden objects! <br/><br/>You've been recruited to join the secret Mystery Society to help solve puzzles and mysteries throughout Europe. Escape to beautiful cities like Paris, London, Venice, Athens, Berlin and more! Find hidden objects, escape danger and climb through the ranks at the Mystery Society and become the greatest detective the world has ever seen! Can you solve the case!? Find out in this free hidden object game by Rolltower Studios.<br/><br/>Do you like free hidden objects games? Do you like to find clues, solve puzzles and uncover secrets? Then Mystery Society is for you!<br/><br/>***FEATURES***<br/><br/>● Solve Mysteries and in this hidden objects game in colorful scenes that change every time you play!<br/>● Gorgeous high resolution graphics!<br/>● Search for and collect hundreds of hidden objects in every scene! Solve crimes and catch criminals!<br/>● Tons of game modes! Find the differences, Mirror Mode, Night Mode, and more!<br/>● Connect with other popular Hidden Object games like Blackstone Mysteries and Relic Match for daily rewards!<br/>● Make friends and send gifts! Get daily rewards by also playing on facebook!<br/>● Get high scores and compete with your friends on facebook!<br/>● No Internet connection required to play! Escape the internet and enjoy the game at any time!<br/>● Solitaire and Match 3 Gem Minigames and more!<br/><br/>***Play the most exciting FREE hidden objects game on iPhone and iPad!***<br/><br/>Game available in: English, Spanish, German, French, Italian, Portuguese<br/><br/>Note to Mystery Society players on Facebook: this game does not connect to your web game, it is a new mobile game.<br/><br/><br/><br/>Questions? Email support@rolltower.com", "metacritic": null, "released": "2014-12-17", "tba": false, "updated": "2019-10-22T14:20:18", "background_image": "https://media.rawg.io/media/screenshots/d1f/d1f3d4b8c2652df79a89258dde10f29d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 217, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Rolltower Studios"], "genres": ["Adventure", "Puzzle"], "publishers": ["Rolltower Studios"], "esrb_rating": "Teen"}