{"id": 216548, "slug": "hidden-object-game-blackstone", "name": "Hidden Object Game: Blackstone", "name_original": "Hidden Object Game: Blackstone", "description": "Become an ace detective and investigate puzzling mysteries in an exciting new hidden object game!<br/><br/>Solve cases in a city fraught with intrigue and suspense! Search for hidden objects and uncover the secrets of the town of Westford!<br/><br/>Can you unravel the city's most baffling mysteries? Find out by playing the best FREE hidden object game on the iPhone, iPad, or iPod Touch! Hundreds of quests and an ever-growing collection of scenes await you!<br/><br/>**** FEATURES ****\u2028<br/>● Explore gorgeous scenes made for the Retina Display!<br/>● No Internet connection required to play! Enjoy the game at any time!<br/>● Play seven exciting game modes like Mirror Mode and Night Mode!<br/>\u2028● Complete a myriad of quests as you assist the residents of Westford<br/>\u2028● Regular updates bring new scenes, quests, and characters for FREE!<br/>● Collect hundreds of different items and complete a variety of collections!\u2028<br/>● Difficulty increases as you play each scene, revealing new objects!\u2028<br/>● Utilize plenty of hints to help you complete scenes!\u2028<br/>● Make friends and send gifts without needing a Facebook or Twitter account!\u2028<br/>● Interact and trade information with a cast of colorful characters!\u2028<br/>● Try and get the highest score for every scene!<br/><br/>____________________________<br/><br/>**** ADDITIONAL NOTES ****\u2028<br/>● Runs on iPad, iPhone, and iPod touch devices\u2028<br/>● Send us your feedback so we can improve your playing experience! Email support@rolltower.com to contact us<br/>● Make sure to leave us a review! We love the support of our fans!", "metacritic": null, "released": "2014-05-06", "tba": false, "updated": "2019-10-22T14:20:18", "background_image": "https://media.rawg.io/media/screenshots/a0b/a0b5c0d3cd05ffd4ca3de346bbd582df.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 227, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Rolltower Studios"], "genres": ["Adventure", "Puzzle"], "publishers": ["Rolltower Studios"], "esrb_rating": "Everyone 10+"}