{"id": 216549, "slug": "relic-match-3-mystery-games", "name": "Relic Match 3: Mystery Games", "name_original": "Relic Match 3: Mystery Games", "description": "The MYSTERY SOCIETY needs your help again to discover who stole the treasure of jewels and artifacts in this exciting free match-3 quest game!<br/><br/>From the makers of Hidden Object Blackstone and Mystery Society games: <br/>Rolltower Studios presents yet another amazingly fun game to play online! Relic Match 3 is a FREE Match Three puzzle solving adventure game. It is one of the best online Match 3 games and free matching games for adults, as you, the detective, need to use your brain to match three in a row and stolen items.<br/><br/>Join an exquisite detective crew!<br/>Relic Match 3 is unlike any of the three in a row games you played before. It combines free puzzles online, 3 in a row and a quest to find hidden objects: You start your adventure as a rookie and climb through the ranks to become a top detective! Match-3 or more objects to investigate the crime scene and find the hidden jewels.<br/><br/>EXPLORE THE MYSTERIOUS WORLD OF THE SECRET SOCIETY<br/>Enjoy not only free online puzzles but a rich storyline, thrilling quests and captivating characters as well! Investigate new, exciting locations and discover several different game modes. Break crates, pop bubbles, bust locks, play match-three games and more! <br/><br/>FIND STOLEN JEWELS<br/>Play through several exciting levels, match dozens of objects, use special boosters to investigate the crime scenes, and recover the lost treasures and relics! Find, trade, and collect items to earn amazing rewards. <br/><br/>SOLVE PUZZLES WITH YOUR FRIENDS<br/>You can compete for the highest score and send bonuses and boosters to your friends! <br/><br/>Can you become the greatest detective and put an end to the heists? Play Relic Match-3 and find out!<br/><br/>Features:<br/>• NO INTERNET CONNECTION REQUIRED to play! <br/>• BEAUTIFUL, HIGH-RESOLUTION GRAPHICS look great on your phone or tablet!<br/>• COMPETE for the highest score among your friends on iTunes! <br/>• HOURS of entertainment and gameplay!<br/>• CONNECT to Facebook to send bonuses and energy to your friends!<br/>• EXCITING PUZZLE adventure game!<br/>• PLAY for FREE NOW!<br/><br/><br/>VISIT US: http://www.rolltower.com/<br/>WATCH US: https://www.youtube.com/channel/UC_TDHLBo9DqBdB77ps9Zt_Q<br/>LIKE US: https://www.facebook.com/relicmatch/<br/>QUESTIONS? support@rolltower.com", "metacritic": null, "released": "2015-11-21", "tba": false, "updated": "2019-10-22T14:20:18", "background_image": "https://media.rawg.io/media/screenshots/cfb/cfbfe81b12a4f954dedcee9bf990c609_r6XALtk.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 211, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Rolltower Studios"], "genres": ["Adventure", "Puzzle"], "publishers": ["Rolltower Studios"], "esrb_rating": "Everyone 10+"}