{"id": 216644, "slug": "timber-block-puzzle-fun-game", "name": "Timber Block Puzzle - Fun Game", "name_original": "Timber Block Puzzle - Fun Game", "description": "Timber Block Puzzle is a fantastic puzzle game. And it’s FREE!<br/><br/>A SIMPLE and EASY game to play for everyone in ALL AGES.<br/>You DRAG and DROP those blocks to fill any horizontal and vertical lines to score.<br/>It’s all in woody style and no color match with UNLIMITED time.<br/>Accept the brain-tease and LOVE the challenge!<br/><br/>FEATURES<br/><br/>•\tSimple and addictive gameplay.<br/>•\tRelaxing block puzzle with woody style and sound.<br/>•\tYou can play with unlimited time so enjoy all the hours.<br/>•\tCan play on both phones and tablets.<br/>•\tBlock puzzle help you practice logical and strategic thinking.<br/>•\tThere is a 10x10 grid for you to enjoy the fun.<br/>•\tFREE wood block puzzle game.<br/>•\tIf you love solving puzzle and challenge, you will love this.<br/>•\tThis ‘Timber’ wood block puzzle provides challenge for your brain.<br/>•\tThere is no color match, all in one color so that you will focus and no distraction.<br/>•\tIt’s healthy and suitable for all age.<br/><br/>HOW TO PLAY<br/><br/>•\tYou drag one block from outside to the grid to create horizontal or vertical lines of ten.<br/>•\tThere is no color match, no timer which means you can play forever with unlimited time and NO PRESSURE.<br/>•\tScore as much as possible, continue on breaking the record and have the high score.<br/>•\tYou can share your score to your friends.<br/>•\tSURPRISE everyone, show them how smart and good you are!", "metacritic": null, "released": "2018-05-13", "tba": false, "updated": "2019-10-22T14:20:20", "background_image": "https://media.rawg.io/media/screenshots/97a/97aa266cf05756d0e2d35bb744fb7cd7_C2zxDs3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 44, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Thai Nguyen"], "genres": ["Board Games", "Puzzle"], "publishers": ["Thai Nguyen"], "esrb_rating": "Everyone 10+"}