{"id": 216647, "slug": "infinity-loop-energy", "name": "∞ Infinity Loop: Energy", "name_original": "∞ Infinity Loop: Energy", "description": "If your body battery is almost empty, ∞ Infinity Loop ENERGY is the perfect boost to power it. <br/><br/>From the famous ∞ Infinity Loop game, this connection game sequel takes you through a myriad of infinite levels. This is a new way of playing the Loop game!<br/><br/>This puzzle is a connection game that will challenge your brain and encourage your creativity by having you completing lighting circuits of bulbs, wires and lightning bolts. This game is, in fact a mixture of 3 of our previous hits: Infinity Loop, Infinity Loop HEX and Current Stream.<br/><br/>The Loop ENERGY environment is very relaxing and interstellar, mixing a smooth soundtrack with beautiful puzzles which will blow your mind. In fact, this puzzle game has a lot to do with imagination, design, art, vision and metaphysics. By connecting all of the wires with ENERGY sources, small pieces of art will be created, which you can photograph and store on your smartphone. In Loop ENERGY your role is a kind of an art unlocker: once you complete the circuit, you discover the figure behind it. <br/><br/>The communion between the astonishing visual parts and the soothing music builds the perfect atmosphere to escape from stressful situations like traffic, subway rush hours or a busy work day. Described by the players as extremely addicting and challenging, Loop ENERGY will take you into an infinite one way trip towards a relaxing state of mind.<br/><br/>If you are looking for a beautiful relaxing game, Loop ENERGY is the perfect answer for your prayers.How to play Loop ENERGY?<br/><br/>You will easily understand how Loop ENERGY works in the first levels as well as the purpose you will need to achieve. The apparent complexity is quickly replaced by clairvoyance and that is when fun begins! In order to complete the level, you have to rotate the objects so the ENERGY can pass through them. When all the bulbs were illuminated it means that everything is connected and your work is done. <br/><br/>How many levels are there?<br/><br/>Loop ENERGY is based on a logic of never-ending levels. Knowing this, you will never get bored solving the same puzzles; there will be an infinite number of puzzles to solve and everyone will play the exact same levels: If you are in the level 1000 and someone else is also on level 1000, you will be both playing the same exact level. <br/><br/>Do I need to pay anything to play?<br/><br/>Loop ENERGY is completely free and you don’t need to pay for playing the game. However, you can remove the ads for the price of a coffee, ice-cream, muffin, pizza or sushi and enjoy a more fluid version of the game. <br/><br/>If you have any questions or comments, feel free to reach us via e-mail. <br/><br/>Do you like our work? Connect below:<br/><br/>• Like: https://www.facebook.com/infinitygamespage <br/>• Follow: https://twitter.com/8infinitygames <br/>• Visit: https://www.infinitygames.io/ <br/><br/>Concept, development, design and copyrights: Badly Interrogated &amp; Infinity Games.", "metacritic": null, "released": "2017-11-14", "tba": false, "updated": "2019-07-24T11:22:01", "background_image": "https://media.rawg.io/media/screenshots/614/6147cb4f53a2336e333620e61a8773da.jpg", "website": "http://infinitygames.io", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 144, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["WebAvenue Unipessoal Lda", "∞ Infinity Games"], "genres": ["Family", "Puzzle"], "publishers": ["WebAvenue Unipessoal Lda"], "esrb_rating": null}