{"id": 216648, "slug": "infinity-loop-hex", "name": "∞ Infinity Loop: HEX", "name_original": "∞ Infinity Loop: HEX", "description": "The new version of Infinity Loop is here. Now you have a whole new collection of infinite levels to play within a hexagonal board. Enjoy this new relaxing game!<br/><br/>This HEX game allows you to build loops in a new way. We have kept the same structure of the Infinity Loop game: a clean and simple game that helps you improve your focus and attention levels.<br/><br/>Infinity Loop: HEX allows you to create closed shape patterns by connecting all of the pieces. It is a puzzle game but carefully built to provide moments of relaxation and joy.<br/><br/>We strongly believe that this Hexes game may relieve you from moments of stress as there is no pressure to solve the levels and no timers at all. We keep it without timers as we understand that everyone has their own pace and time shouldn’t be a measure of intelligence: The ability of solve the puzzle in the end is the sole extent of someone’s capacity and intelligence.<br/><br/>If you are looking for a relaxing game type, enjoy the new loop with this hexa game. <br/><br/>Say no to “stress” and enjoy the loop!<br/><br/>How to Play Infinity Loop: HEX?<br/><br/>The basics are the same from our main game, because the goal is the same (Reach perfection):<br/><br/>•\tConnect all of the lines and corners to create closed shapes;<br/>•\tWatch our video trailer to see how it works;<br/>•\tCheck YouTube for solutions if you are struggling<br/><br/>How many levels can I play?<br/><br/>Infinite. We keep it infinite!<br/><br/>How can I save my game progress?<br/><br/>•\tConnect the app with the Apple Cloud by clicking on the settings button;<br/>•\tThe settings button is available on the bottom of the gameplay;<br/>If you face any issues reach us by e-mail at support@infinitygames.io<br/><br/>Do I need to pay anything to play Infinity Loop?<br/>No. The game is 100% free. There is no need to pay anything for the original game. The game is free for unlimited levels.<br/><br/>Do you like our work? Connect below:<br/><br/>• Like: https://www.facebook.com/infinitygamespage<br/>• Follow: https://twitter.com/8infinitygames<br/>• Visit: https://www.infinitygames.io/<br/><br/>Concept, development, design and copyrights: Badly Interrogated &amp; Infinity Games", "metacritic": null, "released": "2017-08-21", "tba": false, "updated": "2019-07-30T11:47:16", "background_image": "https://media.rawg.io/media/screenshots/bc0/bc0bbf20304c85cbf3780171325fc020.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 155, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["WebAvenue Unipessoal Lda", "∞ Infinity Games"], "genres": ["Board Games", "Puzzle"], "publishers": ["WebAvenue Unipessoal Lda"], "esrb_rating": "Everyone 10+"}