{"id": 216646, "slug": "square-it", "name": "■ Square it!", "name_original": "■ Square it!", "description": "Pure, genuine, relaxing game. Just square it all!<br/><br/>■ Square it! is meant to be the best contemporaneous stress-relief game. With a pure, relaxing gameplay and a smart combination of colour schemes and sound, it applies a simple but genius idea - fill the area with squares, without leaving empty spaces.<br/><br/>Easy? Might be harder at first but as your brain starts developing a strategy to solve puzzles, this challenging game will become very relaxing and strangely fun.<br/><br/>Users who have played Square it! describe it as an addicting zen game, but perfect to train mind focus and concentration. No tension or pressure.<br/><br/>Square it all!<br/><br/>FAQ<br/><br/>How to Play ■ Square it?<br/><br/>Drag your finger to all 4 directions (upwards, downwards, to the left and to the right). See how the square reacts and fill the area without leaving blank spaces. When you are done, a check mark will show up - you may now share your abstract design (or maybe not so abstract) to any social network.<br/><br/>If you think you did something wrong, click on the restart button in the bottom and Square it all again.<br/><br/>Further levels might have not one but 2 squares (note that both will move at the same time). We have also introduced a special teleportation - you can jump your square to another location on the gamefield.<br/><br/>How many levels are there?<br/><br/>Infinite, why not?<br/><br/>How to save my game progress?<br/><br/>Make sure you connect the app with Apple Game Center on the bottom panel. Press anywhere outside the gamefield and then click on the Game Controller icon on the right. You will be prompted a screen to connect with the Game Center. This way your progress won't be lost. If you face further issues reach us by e-mail.<br/><br/>Do I need to pay anything to play this game?<br/><br/>No. It is 100% free. You can pay us a small fee (the price of a coffee) though, to remove ads from your game.<br/><br/>■ Square it! and let us know your feedback on this game. We greatly appreciate your thoughtful comments.<br/><br/>Concept, development, design and copyrights: Oskar Kuligowski", "metacritic": null, "released": "2016-10-09", "tba": false, "updated": "2019-07-30T11:46:45", "background_image": "https://media.rawg.io/media/screenshots/2e4/2e4b9d4d3667178b2956ac8bd6459609.jpg", "website": "http://squareit.io", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 91, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["WebAvenue Unipessoal Lda", "∞ Infinity Games"], "genres": ["Board Games", "Puzzle"], "publishers": ["WebAvenue Unipessoal Lda"], "esrb_rating": "Everyone 10+"}