{"id": 216651, "slug": "connection-2", "name": "◉ CONNECTION", "name_original": "◉ CONNECTION", "description": "◉ Connection is the new IQ test using a puzzle game! <br/><br/>This is the connection game where you have to connect dots from different colors. There is no timer or pressure; the more levels you can clear without help, the higher is your IQ:<br/>• SIMPLE: connect dots that share the same color and fill the hollow dots to pass the minimalistic puzzle levels. <br/>• CHALLENGING: powered by the Infinity Loop team, this game is harder than any of our previous games, CONNECTION will challenge your logic skills, test your IQ and your ability to build a successful network. <br/>• BEAUTIFUL: the CONNECTION between a minimalistic flat design and a soothing soundtrack will be highly appealing to your senses. <br/>• STRATEGIC: free of time-limit rules, CONNECTION allows you to build your own strategy and link dots at your pace.<br/>• FUN: level after level, you will find yourself wrapped into an immersive and enjoyable gameplay environment.<br/>• FREE: CONNECTION is totally free and you can play all the time you want without costs. However, you can always buy hints to help you in harder levels or pay a symbolical price to remove the ads. <br/><br/>This IQ game is also a rethink on the approach of IQ testing. Even though this isn’t scientific, these are your results:<br/>• Play 200 levels in less than 30 minutes: IQ Above 145 - Genius<br/>• Play 200 levels in less than 50 minutes: IQ above 130 – Very Superior<br/>• Play 200 levels in less than 1 hour and 15 minutes: IQ above 115 – Superior<br/>• Play 200 Levels in less than 2 hours: IQ above 85 – Normal<br/>• Play 200 levels in less than 5 hours: IQ above 70 – Dullness<br/>• Play 200 levels in less than 10 hours: IQ below 70 – Borderline deficiency<br/><br/>You can store your favorite levels on your smartphone, using them later to share with your friends or to beautify your social media channels. If you prefer, just send those screenshots to us, so we can know which level you are playing. We always enjoy receiving some feedback from our players and we will truly appreciate your message. <br/><br/>Do you like our work? Connect below:<br/>• Listen to our stories: https://www.instagram.com/8infinitygames/ <br/>• Learn more about us: https://www.infinitygames.io/<br/>• Show us your love: https://www.facebook.com/infinitygamespage<br/>• Follow our steps: https://twitter.com/8infinitygames", "metacritic": null, "released": "2018-04-04", "tba": false, "updated": "2019-07-24T11:21:59", "background_image": "https://media.rawg.io/media/screenshots/986/986615ee5a1a6c0f5d8c134672f6e784.jpg", "website": "http://infinitygames.io", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 114, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "Android"], "developers": ["WebAvenue Unipessoal Lda", "∞ Infinity Games"], "genres": ["Board Games", "Puzzle"], "publishers": ["WebAvenue Unipessoal Lda"], "esrb_rating": null}