{"id": 21670, "slug": "terra-incognita-chapter-one-the-descendant", "name": "Terra Incognita ~ Chapter One: The Descendant", "name_original": "Terra Incognita ~ Chapter One: The Descendant", "description": "<p>This game embodies the classic canon role playing game.</p>\n<h3>Plot</h3>\n<p>The world of Terra is plunging into chaos, great shocks await it. In this situation, it is time to turn the weapon against the main weak point of Terra - its corrupt royal family.</p>\n<p>The hero of the game must cross the whole world in order to unite the peoples of Terra and gather into his team the best warriors and other necessary people.</p>\n<h3>The Hero and the beginning</h3>\n<p>The game begins with a short video about Terra and the hostile forces that attacked this country.</p>\n<p>When the video ends, a mysterious man with a sword falls from the sky - this is your character that you will control in the game. A man falls next to a young hunter and fisherman named Leon, who was just fishing near his lonely dwelling among the hills.</p>\n<p>Leon, as one of the allies you found, is also the first achievement in this game. Leon had just caught a fish for dinner when he noticed a man falling from the sky. The man calls his name - Alexis. Leon and Alexis exchange a few words, Leon invites Alexis into the house.</p>\n<p>In the house of Leon Alexis first meets several creatures with whom he has to fight. Leon himself surprised at the presence of these creatures in his house. Another thing that surprises Leon is that Alexis finds a strange crystal near Leon&#39;s house. And through this crystal with Alexis, a mysterious voice speaks.</p>\n<p>In the future, you will travel around Terra, fighting with monsters and meeting more and more different characters that make up the team - these are the achievements for which the game is played.</p>\n<h3>State of the game and additions to it</h3>\n<p>Game development is not yet complete, but the game itself is already available to the public. As you work on the game, its creators complement the available version.</p>\n<p>During the work on the game, its creators have already released patches for it. These patches, in particular, brought into play the possibility of several new achievements. It should be remembered that it may be necessary, after adding a patch, to start a new game in order to gain access to these new achievements.</p>", "metacritic": null, "released": "2015-02-03", "tba": false, "updated": "2024-04-06T13:07:08", "background_image": "https://media.rawg.io/media/screenshots/f0d/f0dbd2f50b08b16e0cf2c1d6e64a85e4.jpg", "website": "http://www.backtobasicsgaming.com/", "rating": 1.81, "rating_top": 1, "added_by_status": {"yet": 40, "owned": 1109, "beaten": 2, "dropped": 8}, "playtime": 4, "achievements_count": 15, "ratings_count": 42, "suggestions_count": 403, "game_series_count": 0, "reviews_count": 42, "platforms": ["PC"], "developers": ["Back To Basics Gaming"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["Back To Basics Gaming"], "esrb_rating": null}