{"id": 2169, "slug": "psychoban", "name": "Psychoban", "name_original": "Psychoban", "description": "*** In celebration of the release of Running Fred, Psychoban is ON SALE for a limted time! ***<br/><br/>Psychoban brings you a deeper concept in puzzle gaming, drawing from proven classics such as Sokoban to create an unique and immersive experience!<br/><br/>-Brain-scrambling puzzles:<br/>Psychoban takes you through an entirely new dimension of puzzle-adventure experience, as you must make your way through actual 3D challenges. A non-stop concatenation of challenges, hilarious situations and gorgeous visuals will squeeze you out of any remnants of sanity.<br/><br/>- Insanely seamless interface:<br/>No virtual key-pads! An unique character control system, absolutely natural to the iPhone interface, allows for an easy and hands-on playability. You tell Mental Dude what you want him to do, and he does it!<br/><br/>-Deranged settings and environments:<br/>Make your way through five of the world´s creepiest mental asylums, and become a part of their gruesome, gore-stained history.<br/><br/>- Mad quantities of levels<br/>Sixty  levels of concentrated challenge-packed puzzles will keep you hooked-in to the last second! <br/><br/>- Alienating, comedy-driven story<br/>Join the adventure of Mental Dude, his quest for freedom, survival… and a grip to reality.<br/><br/>- Lunacy guaranteed!<br/><br/>Follow us on Twitter: http://twitter.com/psychoban<br/>Follow us on Facebook: http://www.facebook.com/pages/Psychoban/128736153820894", "metacritic": null, "released": "2010-06-26", "tba": false, "updated": "2019-10-22T14:27:59", "background_image": "https://media.rawg.io/media/screenshots/b03/b0333dd937e117e7fc23b8735e67bc63.jpg", "website": "http://www.psychoban.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 435, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "Android"], "developers": ["Dedalord"], "genres": ["Strategy", "Puzzle"], "publishers": ["Dedalord"], "esrb_rating": null}