{"id": 216918, "slug": "4x4-mania-suv-racing-premium", "name": "4x4 Mania: SUV Racing Premium", "name_original": "4x4 Mania: SUV Racing Premium", "description": "Racing, Derby and mud! Full customization, damage, revamped physics and vehicle stats and new cars! All this and more is waiting for you in this huge update.<br/><br/>This version of the game is ad-free and offers a bonus currency pack on purchase.<br/><br/>- Added racing and derby type missions<br/>- Completely reworked tire physics modelling<br/>- Added live axle and full suspension simulation<br/>- Added ability to damage and destroy trees based on mass and speed of vehicle<br/>- Tripled the mission count for each level<br/>- Added new derby arena level with races and derbies<br/>- Added AI opponents<br/>- Added damage to cars<br/>- Vehicles get dirty<br/>- Added mud<br/>- New vehicles inspired by: Baja Buggy, Cherokee, Blazer K5, Land Cruiser 80<br/>- Added customization for parts: bumpers, bullbars, roofs and roofracks, snorkels, etc.<br/>- Added detailed driving assistance setup<br/>- Added detailed vehicle setup options<br/>- Added manual gearbox and handbrake<br/>- Added low gear<br/>- Completely redid the user interface<br/>- Added list of missions and races to each level for convenience<br/>- Added new cameras and free camera rotation to some menus and cameras<br/>- Added car turnover assistance when flipped over (accelerate and steer together)<br/>- Added roads to levels<br/>- Other things<br/>- Fixed too many bugs to list, mainly related to tire physics<br/><br/><br/>Powerful 4x4 SUVs that you can upgrade and tune to your heart's desire, mud, racing and demolition derbies!<br/>Huge and tough offroad levels! Diverse environments: muddy forest, scorching desert, freezing ice lake, bumpy hills and a demolition derby stadium! Mod your SUV with bullbars, bumpers and snorkels, choose any color and upgrades to make it truly yours! Conquer all the elements: sand, land, snow, rocks, mud and ice in your tough 4x4 vehicle.<br/><br/>Complete challenging missions, races and derbies to earn in-game points.<br/><br/>16 SUVs - trucks and jeeps, to choose from, inspired by such classics as:<br/><br/>- Jeep Wrangler<br/>- Jeep Cherokee<br/>- Chevy Blazer K5<br/>- Baja Beetle<br/>- Toyota Land Cruiser 80<br/>- Mercedes G Wolf<br/>- Hummer H1<br/>- 1970 Ford F250<br/>- Land Rover Discovery<br/>- Toyota Hilux<br/>- Toyota FJ Cruiser<br/>- Lada Niva<br/>- UAZ 469<br/>- GAZ 66<br/>- KAMAZ<br/>- BTR LAV<br/><br/>Get behind the wheel of an extremely tuned 4x4 SUV and conquer the wilderness!<br/><br/>Also featured in the simulator:<br/>- Mud and tree-felling<br/>- Dumb bots and less dumb bots<br/>- Suspension and solid axle simulation<br/>- In-depth graphics settings to support the widest range of devices<br/>- Buttons, steering wheel or tilt steering<br/>- 6 cameras<br/>- Realistic simulator physics<br/>- 4 types of upgrades for your 4x4 SUV<br/>- Damage and checkpoints for the missions<br/>- Manual or automatic gearbox, low gear, handbrake<br/>- Detailed vehicle setup and driving assistance settings<br/>- Damage modelling", "metacritic": null, "released": "2017-03-29", "tba": false, "updated": "2019-10-22T14:20:29", "background_image": "https://media.rawg.io/media/screenshots/6ba/6ba5b5bcbda093ee9d06a3c26f85d605.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 247, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Anatoly Volnov"], "genres": ["Simulation", "Racing"], "publishers": ["Anatoly Volnov"], "esrb_rating": "Everyone 10+"}