{"id": 21696, "slug": "luxor-5th-passage", "name": "Luxor: 5th Passage", "name_original": "Luxor: 5th Passage", "description": "<p>Get ready to wield your winged-scarab shooter in an all-new LUXOR, the #1 action-puzzle game of all time!</p>\n<p>Navigate your shooter to ensure matches of three or more—fire colored balls into the advancing chain of colored spheres to eliminate them before they destroy the pyramids.  Unlock all 20 achievements as you collect Ankh coins for extra lives and catch falling treasures for big bonus points. </p>\n<p>Save ancient Egypt in the 100-level Adventure mode, or test your accuracy in all-new Blast mode—the 2-minute timed mode that challenges you to rack up the points.  Or play through People’s Choice mode, where we give you 15 of players’ favorites levels from LUXOR 2, LUXOR 3 and Quest for the Afterlife!</p>\n<p>Master four new power-ups: the powerful Double Shooter, the devastating Black Hole, the ruinous Spiker Ball, and the deathly Lead Barrage.  Outfitted with 25 all-new backgrounds and pathways, LUXOR Fifth Passage also introduces the Eye of Horus—click the button when you’re in a real jam to eliminate all remaining spheres.  And, for the true LUXOR Pharaoh, an Insane difficulty level to test your marble-shooting skills!  Celebrate 5 years of LUXOR’s reign in the 5th Passage!</p> \n\n\t\t\t\t\t\tKey Features:<ul>\n<li>100 all-new Adventure Mode levels\n\t\t\t\t\t\t</li><li>Classic LUXOR game play style with 25 all-new backgrounds &amp; pathways\n\t\t\t\t\t\t</li><li>4 difficulty levels: Easy, Medium, Hard &amp; INSANE\n\t\t\t\t\t\t</li><li>20 Achievements to earn\n\t\t\t\t\t\t</li><li>All-new Blast Mode lets you test your skills in two minutes!\n\t\t\t\t\t\t</li><li>Players’ Choice Mode includes 15 fan-favorite levels from LUXOR 2, LUXOR 3 &amp; Quest for the Afterlife\n\t\t\t\t\t\t</li><li>Eye of Horus lets you summon the Pharaoh to destroy the remaining spheres!\n\t\t\t\t\t\t</li><li>4 all-new power-ups: Double Shooter, Black Hole, Spiker, &amp; Lead Barrage\n\t\t\t\t\t\t</li><li>New bonus stage\n\t\t\t\t\t\t</li></ul>", "metacritic": null, "released": "2010-11-18", "tba": false, "updated": "2023-11-19T20:15:11", "background_image": "https://media.rawg.io/media/screenshots/3d4/3d497cc5a130505813ee6464c14b2db5.jpg", "website": "http://mumbojumbo.com/games/LUXOR_5th_Passage", "rating": 3.08, "rating_top": 4, "added_by_status": {"yet": 6, "owned": 319, "beaten": 4, "dropped": 2}, "playtime": 1, "achievements_count": 0, "ratings_count": 12, "suggestions_count": 481, "game_series_count": 16, "reviews_count": 12, "platforms": ["iOS", "macOS", "PC"], "developers": ["MumboJumbo"], "genres": ["Action", "Adventure", "Arcade", "Casual"], "publishers": ["MumboJumbo"], "esrb_rating": null}