{"id": 216937, "slug": "bus-simulator-2017", "name": "Bus Simulator 2017 *", "name_original": "Bus Simulator 2017 *", "description": "***** Best Simulator Candidate of 2017. Realistic Bus Driving Game. *****<br/><br/>Completely realistic missions and bus driving experience are waiting for you.<br/><br/>GAME FEATURES<br/>- Realistic bus driving<br/>- Realistic traffic system<br/>- Amazing and challenging missions<br/>- More than 6 perfect bus<br/>- Big city maps (New York like enormous city)<br/>- Various camera angles (Inner cam, Front cam, outer cam and more)<br/>- Realistic weather (Rainy, Snowy, Sunny, Foggy weathers)<br/>- Realistic traffic rules<br/>- Realistic pedestrian traffic<br/>- Amazing 3D graphics<br/>- Realistic bus sound effects<br/>- More than 15 language support<br/><br/>Completely realistic bus driving. Download Bus Simulator 2017 game right now for free.<br/><br/><br/>HOW TO PLAY<br/>- Start your bus by using Start / Stop button.<br/>- Fasten your seat belts.<br/>- On the right side of your screen, bring the shift to “D” position.<br/>- Control your bus by using break and acceleration buttons.<br/><br/><br/>TIPS<br/>- You may choose how to control your bus on the Settings menu.<br/>- During the night missions, you can turn the headlights on by using Headlights button.<br/>- When your bus ran out of gas, you can buy gas from the Garage by touching gas button.<br/>- If you follow traffic rules during the game, you will earn more money.<br/>- The faster you complete the mission, more money you will earn.<br/><br/><br/>You can reach us for any questions or problems on help@zuuks.com<br/>_________________________________________________________________<br/>Our website: http://www.zuuks.com<br/>Follow us on Facebook: https://www.facebook.com/zuuks.games<br/>Follow us on Twitter: https://twitter.com/ZuuksGames", "metacritic": null, "released": "2016-10-20", "tba": false, "updated": "2019-07-29T21:59:30", "background_image": "https://media.rawg.io/media/screenshots/7c4/7c46087023936e5d65fba7f13ee9a965_mOIP0x1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 127, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Zuuks Games"], "genres": ["Simulation", "Racing"], "publishers": ["ZUUKS BILISIM HIZMETLERI SANAYI VE TICARET LIMITED SIRKETI"], "esrb_rating": "Everyone 10+"}