{"id": 216936, "slug": "truck-simulator-2017", "name": "Truck Simulator 2017 *", "name_original": "Truck Simulator 2017 *", "description": "Truck Simulator 2017 lets you become a real trucker! Driver, Are You Ready?<br/><br/>Brand New Game from Producers of City Driving and Traffic Driver.<br/>Completely realistic missions and Truck driving experience are waiting for you.<br/>Build your own company and increase your revenue. Become the King of The Road by playing Truck Simulator 2017.<br/><br/>GAME FEATURES<br/><br/>- 4 European and 4 American truck brands<br/>- Detailed interiors<br/>- Realistic truck driving<br/>- Realistic traffic system<br/>- 50+ Challenging level<br/>- Drive across country roads , city roads and highways<br/>- Various camera angles (Inner cam, Front cam, outer cam and more)<br/>- Realistic weather (Rainy, Snowy, Sunny, Foggy weathers)<br/>- Realistic traffic rules<br/>- Realistic pedestrian traffic<br/>- Amazing 3D graphics<br/>- Realistic Truck sound effects<br/>- Achievements and Leaderboards<br/>- Easy controls (Tilt, Buttons or steering wheel)<br/>- More than 15 language support<br/><br/>Completely realistic Truck driving. Download Truck Simulator 2017 game right now for free.<br/><br/><br/>HOW TO PLAY<br/>- Start your Truck by using Start / Stop button.<br/>- Fasten your seat belts.<br/>- On the right side of your screen, bring the shift to “D” position.<br/>- Control your Truck by using break and acceleration buttons.<br/><br/><br/>TIPS<br/>- You may choose how to control your Truck on the Settings menu.<br/>- During the night missions, you can turn the headlights on by using Headlights button.<br/>- When your Truck ran out of gas, you can buy gas from the Garage by touching gas button.<br/>- If you follow traffic rules during the game, you will earn more money.<br/>- The faster you complete the mission, more money you will earn.<br/><br/><br/>You can reach us for any questions or problems on help@zuuks.com<br/>_________________________________________________________________<br/>Our website: http://www.zuuks.com<br/>Follow us on Facebook: https://www.facebook.com/zuuks.games<br/>Follow us on Twitter: https://twitter.com/ZuuksGames", "metacritic": null, "released": "2016-12-19", "tba": false, "updated": "2019-07-29T21:59:29", "background_image": "https://media.rawg.io/media/screenshots/d98/d98530982a514060b15ffe7a6abb96bf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 125, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Zuuks Games"], "genres": ["Simulation", "Racing"], "publishers": ["ZUUKS BILISIM HIZMETLERI SANAYI VE TICARET LIMITED SIRKETI"], "esrb_rating": "Everyone 10+"}