{"id": 21705, "slug": "tis-100", "name": "TIS-100", "name_original": "TIS-100", "description": "<h3>The hacker setting</h3>\n<p>Another puzzle game that uses the corrupted computer from the 1980s as the basis for its gameplay. The game uses the Unity graphics engine and came out on three operating systems: Windows, OS X, and Linux. The game was originally supposed to be dedicated to the programming of nanobots, which are launched into the body of a living person, but the developer opted for a more appealing idea for a setting.</p>\n<h3>Key features</h3>\n<p>The plot tells a story about the player finding the faulty TIS-100 computer and the manual to it. TIS (Tessellated Intelligence System) is similar to the first computers from the 80s. Each level looks like a 12 program of nodes, located by a grid of 3 to 4. Each node has a processor register, behind which a certain numerical value is hidden. In order to solve the puzzle, the player needs to reprogram the node so that they perform specific actions using a simplified version of the real assembly language. In the version for Steam Early Access, which was released in 2015, 25 levels were available for the completion. Their number reached 50 at a full release. Only a single story campaign is available in the game. The players noted that the game is an excellent exercise for all programmers who want to compete with each other in optimizing the code in a fictional multithread assembler.</p>", "metacritic": null, "released": "2015-07-19", "tba": false, "updated": "2024-01-01T16:56:37", "background_image": "https://media.rawg.io/media/screenshots/38d/38de014fb42ed1844d4a0f250cf876f4.jpg", "website": "http://www.zachtronics.com/tis-100", "rating": 3.58, "rating_top": 4, "added_by_status": {"yet": 68, "owned": 1472, "beaten": 20, "toplay": 18, "dropped": 56, "playing": 8}, "playtime": 1, "achievements_count": 10, "ratings_count": 120, "suggestions_count": 120, "game_series_count": 0, "reviews_count": 120, "platforms": ["PC", "Linux", "macOS"], "developers": ["Zachtronics"], "genres": ["Simulation", "Indie", "Puzzle"], "publishers": ["Zachtronics"], "esrb_rating": "Everyone"}