{"id": 21728, "slug": "railroad-lines", "name": "Railroad Lines", "name_original": "Railroad Lines", "description": "The game is dedicated to all railroad and modelling lovers. Easy to use interface makes the game widely accessible to all the railroad lovers and trainspotters. The player has to complete tasks connected with train service - either passenger and freight ones. The action takes place during the so-called \"5th Railroad Era\" (1990 till now). The timeframe has a direct influence on the setting, character and style of buildings, railroad infrastructur, and most of all, engines and carriages that are used.<br/><br/>At the beginning, the player is given a number of points. He can use them to buy carriages and create trains You can only manage the trains you are provided with at a given location (adapted to the type of a task). You earn more points as you complete different tasks. When you reach the target number of points, you finish the stage and are moved to another locality. It’s totally up to you how you use your points, you can either collect them from the start or spend them on developing your railroad lines. This system allows you to fully customize your trains and carriages depending on your preferences. Change your location into your dreamlike railroad model.<br/><br/>Features:<br/><ul><li> three camera view modes<br/></li><li> 20 engines to choose from and 20 carriage types<br/></li><li> different locations and missions to be completed<br/></li><li> different weather conditions</li></ul>", "metacritic": null, "released": "2015-07-10", "tba": false, "updated": "2019-08-28T22:07:53", "background_image": "https://media.rawg.io/media/screenshots/3f7/3f7cc12ffb68db1c3c8994c49c21b7cc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 53, "dropped": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 316, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["InImages"], "genres": ["Strategy", "Simulation", "Casual"], "publishers": ["Play sp"], "esrb_rating": null}