{"id": 217326, "slug": "pig-evolution-tap-coins-of-the-piggies-mutant-tapp", "name": "Pig Evolution - Tap Coins of the Piggies Mutant Tapper & Clicker Game", "name_original": "Pig Evolution - Tap Coins of the Piggies Mutant Tapper & Clicker Game", "description": "•••••••••••New Animal ••••••••••••••<br/>Pig evolution!!!<br/>One day, some scientific experiments made those pigs start to mutate.<br/>Would you like to know what mutations happening to them? <br/>Combine pigs to evolve them and discover their most strange, fantastic and visionary forms!<br/>You never seen so many mutations and crazy features in other games!<br/>All the alpaca clicker type evolution, but happened on bad piggies.<br/>Use your poop coins to evolution and mutations more piggies you will found the fun like alpaca clicker.<br/>Piggies evolve and mutant to another type piggies with fun coins clicker.<br/>Little piggies mutant to big piggies, big piggies mutant to fly piggies… fly piggies mutant to alien piggies.<br/>Mutant is the only thing, keep evolution, keep poop coins clicker.<br/>It’s fun like other evolution game like alpaca evolution, rabbit evolution, dog evolution.<br/>Mutations cost your poop coins, but new mutations brings more poop coins.<br/>Maybe you ever played alpaca evolution, but that one have no poop coins and so much mutant pigs.<br/>Alpaca clicker is fun, but not this type. Pig evolution can let you forget other evolution games.<br/>Keep mutant poop coins you will get that. Pig evolution is so different than alpaca clicker.<br/>Which one can keep you playing all the day? not alpaca clicker, it’s pig evolution.<br/>Mutations is the only thing you need care. You only need to care mutations poop coins.<br/>Piggies are waiting mutations. Be a mutations clicker you will get all the piggies.<br/>Use your finger, pig mutations by coins clicker. Easy to play if you ever play alpaca clicker.<br/>So, let’s go, poop mutations, pig mutations!!!!!!<br/><br/><br/><br/>~~~~~~~~~~~~~~~~<br/>INSTRUCTION<br/>~~~~~~~~~~~~~~~~<br/>• Put same type pigs together to mutate new creatures<br/>• Use pigs coins to buy new animals and new tools update<br/>• You can also tap the pigs to make more coins<br/>• Decorate you lovely pigs in fitting room<br/>• Lucky draw by flip the card<br/>• More features can let the mutations more fun<br/>• Mysterious Alien World<br/>~~~~~~~~~~~~~~~~<br/>FEATURES<br/>~~~~~~~~~~~~~~~~<br/>• There are more than 30 pigs for you to discover<br/>• This game is a similar game with alpaca evolution but more fun<br/>• Different endings and possibility: find your own pig world to be special one than others<br/>~~~~~~~~~~~~~~~~<br/>PLAYER FEEDBACK<br/>~~~~~~~~~~~~~~~~<br/>Awesome app BY： Marco the man<br/>This app is so much fun and you should really try it too. My friends and I love making the new pigs. It never gets boring and it has never glitched on me before.<br/><br/>fun to play BY： Partypuppydog<br/>This is is a fun little game that is great to play before you go to bed, in the car, or basically where ever! It's great for you if you like weird and cute things! It's also great for a game when you don't have wifi. You can just play the game and have fun! I love this game and it's cool because you never know what you're gonna get next!<br/><br/>More piggies!!!!! BY： ThatCat_Lil<br/>dog pigs! And cat pigs! And elephant pigs! And giraffe pigs and hippo pigs and maybe car pigs... How about a apple pigs? Pear piglet, and a Ohhhhhhhhhhh! A DINOSAUR PIG!!! <br/><br/>~~~~~~~~~~~~~~~~<br/>This is a simulator pig world, think you are one pig or the god of pigs.<br/>Disclaimer: Although this Game is free to play, some content can be purchased for real money in game. If you do not want to use these features, please turn off in-app purchases in your device's settings.<br/>Music: http://www.bensound.com", "metacritic": null, "released": "2016-03-18", "tba": false, "updated": "2019-10-22T14:19:28", "background_image": "https://media.rawg.io/media/screenshots/ffe/ffef4bad615932219efc05b35dede115.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 54, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Cartoon Mobile"], "genres": ["Strategy", "Family"], "publishers": ["Richard Hu"], "esrb_rating": "Everyone 10+"}