{"id": 217324, "slug": "dog-evolution-tap-coins-of-the-crazy-mutant-poop-c", "name": "Dog Evolution - Tap Coins of the Crazy Mutant Poop Clicker Game", "name_original": "Dog Evolution - Tap Coins of the Crazy Mutant Poop Clicker Game", "description": "•••••••••••New Animal ••••••••••••••<br/>Dog evolution!!!<br/>One day, some scientific experiments made those dogs start to mutate.<br/>Would you like to know what mutations happening to them? <br/>Combine dogs to evolve them and discover their most strange, fantastic and visionary forms!<br/>You never seen so many mutations and crazy features in other games!<br/><br/><br/>~~~~~~~~~~~~~~~~<br/>INSTRUCTION<br/>~~~~~~~~~~~~~~~~<br/>• Put same type dogs together to mutate new creatures<br/>• Dogs poop can become coins and your money incoming<br/>• Use dogs coins to buy new animals and new tools update<br/>• You can also tap the dogs to make more coins<br/>• Decorate you lovely dogs in fitting room<br/>• Lucky draw by flip the card<br/>• More features can let the mutations more fun<br/><br/><br/>~~~~~~~~~~~~~~~~<br/>FEATURES<br/>~~~~~~~~~~~~~~~~<br/>• There are more than 30 dogs for you to discover<br/>• This game is a similar game with alpaca evolution but more fun<br/>• Different endings and possibility: find your own dog world to be special one than others<br/>• Poop, get coins…. repeat and your will love it.<br/><br/>~~~~~~~~~~~~~~~~<br/>This is a simulator dog world, think you are one dog or the god of dogs.<br/><br/>Disclaimer: Although this Game is free to play, some content can be purchased for real money in game. If you do not want to use these features, please turn off in-app purchases in your device's settings.", "metacritic": null, "released": "2016-01-24", "tba": false, "updated": "2019-10-22T14:19:28", "background_image": "https://media.rawg.io/media/screenshots/120/120841d47ef4995fa8d02a95568aba9b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 86, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Cartoon Mobile"], "genres": ["Strategy", "Family"], "publishers": ["Richard Hu"], "esrb_rating": "Everyone 10+"}