{"id": 217347, "slug": "real-money-pool-win-cash-with-skillz", "name": "Real Money Pool - Win Cash With Skillz", "name_original": "Real Money Pool - Win Cash With Skillz", "description": "#1 Most realistic pool game on iOS. Play pool as it should be played, for real, with stunning 3D graphics and the most accurate and realistic pool physics available on mobile!<br/><br/>Compete against other real players from all around the world for FREE with virtual currency or play for REAL CASH PRIZES in the most ultra realistic pool game. Game types include:<br/><br/>8-Ball<br/>9-Ball<br/>Straight Pool Challenge<br/>Speed Pool<br/><br/>Our reviews agree!<br/><br/>Super...\"Real Money Pool is the closest to the real experience that I’ve come across\" - appstorearcade.com - 9/10  <br/><br/>\"Real Money Pool Will Let You Become A Pool Shark\" - OnlineCasinoArchives.com - 96% User review<br/><br/>Intuitive controls designed specifically for mobile devices allow complete control of your shots without losing focus on the game.<br/><br/>Complete with leaderboards, trophies and an amazing loyalty program that rewards you just for playing.<br/><br/>Take the tutorials and be coached through both basic and advanced techniques to really improve your game.<br/><br/>Hone your skills on the free-play practice table to perfect your armoury of shots. Forward spin, back spin, side and swerve shots are all available as you play in beautiful 3D or top down views.<br/><br/>Real Money Pool is Pool for Real.<br/>http://youtu.be/dFkDLoVCQ5w<br/><br/>Powered by Skillz: eSports for Everyone.<br/><br/>Beat by The Passion HiFi", "metacritic": null, "released": "2014-04-10", "tba": false, "updated": "2019-10-22T14:19:29", "background_image": "https://media.rawg.io/media/screenshots/b86/b8600b02f25cb50370f86a407f1ed83c.jpg", "website": "http://youtu.be/dFkDLoVCQ5w", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 60, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Coeus Creative"], "genres": ["Sports", "Arcade"], "publishers": ["Coeus Creative"], "esrb_rating": "Mature"}