{"id": 217316, "slug": "find-the-differences-houses", "name": "Find The Differences - Houses", "name_original": "Find The Differences - Houses", "description": "To all Find The Difference detectives: <br/>Don’t get bored and lazy. Hunt for differences in the best Find The Difference amazing puzzle game for free.<br/><br/>Girls and boys, ladies and gentlemen, try to find the differences!<br/><br/>Are you ready? What's the difference?<br/><br/>Compare two images, search and find 5 differences.  Get hints for fast difference detection.<br/><br/>- 200  beautiful HD images<br/>- 5 differences per level<br/>- no time limit<br/>- Online and offline<br/>- Use zoom for better search and to find challenging differences<br/>- 3 hints per level<br/>- Play on your smartphone or tablet<br/>- Relaxing music.<br/> <br/>Find the difference puzzle game for adults and kids is the best way to have fun when you're bored!<br/><br/>Are you addicted to finding the differences but out of hints? <br/>Find the difference detectives and experts can earn credits to replenish their hints. <br/>How many credits can you earn with your eagle eyes? <br/>Try to find the difference without hints or help.<br/><br/>Challenge your friends and invite them to play Find The Difference Houses too - for free!<br/><br/>Have questions, suggestions or simply love the best Find The Difference puzzle game, please leave a review and tell us about it.<br/> <br/>Find The Difference puzzle game is similar to hidden objects game.<br/><br/>Find The Difference Houses is counting on you!", "metacritic": null, "released": "2018-01-29", "tba": false, "updated": "2019-10-22T14:19:28", "background_image": "https://media.rawg.io/media/screenshots/530/5306d3daa82d7b199eb9d6365995f121.jpg", "website": "http://www.find-the-differences.net", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 180, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Mobilaxy"], "genres": ["Puzzle"], "publishers": ["Mobilaxy"], "esrb_rating": "Everyone 10+"}