{"id": 217304, "slug": "war-planet-online", "name": "War Planet Online", "name_original": "War Planet Online", "description": "When the entire world is at war, bold generals rise to the challenge and lead their armies toward Global Conquest. The time has come for you to strike! Do you have what it takes? Build your base, dominate regions of an actual real world map, and lead your faction to conquer every nation of the globe!<br/><br/>You are a lone military force in a world completely engulfed by war. But you are destined to rise up and conquer it all! So build a mighty base, gather strong allies, and launch a global assault in the most explosive real-time MMO strategy game!<br/> <br/>**GAME FEATURES**<br/> <br/>REAL-WORLD ACTION<br/>• Immerse yourself in a world where thousands of real players struggle for dominance 24/7.<br/>• Talk to your allies (and taunt your enemies) in the global chat, or plot your next attack in the private Faction chat.<br/>• Build your forces from units based on actual modern war machines including armored tanks, lightning-fast jets, long-range artillery and much more! <br/>• March your army across a faithfully recreated World Map.<br/> <br/>REAL-TIME CONQUEST<br/>• Fight for supremacy in real-time, live PvP warfare.<br/>• Use cunning strategies to strike your enemies where and when they least expect it.<br/>• Call on allies for reinforcements to overcome any obstacle!<br/> <br/>REAL MILITARY STRATEGY<br/>• Customize your base to create an impenetrable fortress that will crush any invasion.<br/>• Recruit skilled commanders that specialize in various types of operations.<br/>• Forge a massive alliance with other players and coordinate amazing feats of strategy together.<br/><br/>What are you waiting for, sir? The world needs a general like you to dominate and win this war!<br/><br/>_____________________________________________<br/><br/>Visit our official site at http://gmlft.co/website_EN<br/>Check out the new blog at http://gmlft.co/central<br/><br/>Don't forget to follow us on social media:<br/>Facebook: http://gmlft.co/SNS_FB_EN<br/>Twitter: http://gmlft.co/SNS_TW_EN<br/>Instagram: http://gmlft.co/GL_SNS_IG<br/>YouTube: http://gmlft.co/GL_SNS_YT<br/><br/>This app allows you to purchase virtual items within the app and may contain third-party advertisements that may redirect you to a third-party site.<br/><br/>Terms of Use: http://www.gameloft.com/en/conditions-of-use<br/>Privacy Policy: http://www.gameloft.com/en/privacy-notice<br/>End-User License Agreement: http://www.gameloft.com/en/eula", "metacritic": null, "released": "2017-08-30", "tba": false, "updated": "2019-07-29T12:57:44", "background_image": "https://media.rawg.io/media/screenshots/740/740a92c3efe2c87664d6ed02aa489f52.jpg", "website": "http://www.gameloft.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 447, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["Gameloft"], "genres": ["Action", "Strategy"], "publishers": ["Gameloft"], "esrb_rating": null}