{"id": 217348, "slug": "international-boxing-champions", "name": "International Boxing Champions", "name_original": "International Boxing Champions", "description": "Classic old-school Arcade Action<br/>Unrelentingly fast paced, Boxing action. Beautifully rendered and animated, high resolution and high definition graphics.<br/><br/>The worlds greatest fighters await<br/>Compete against boxers from all over the world each with their own distinctive style of fighting. Unload on your opponent with jabs, straight punches, hooks and body shots before finishing them off with super combos.<br/><br/>Advanced character-based artificial intelligence<br/>Each Boxer learns the way you fight and uses it against you. Dominate the ring to drive your opposition into the corner or get dominated by a super aggressive heavyweight. Watch them retreat with fear as you get the upper hand or mercilessly advance on you as you struggle to survive the round.<br/><br/>Choose your fighter<br/>Fight as boxers from China, Brazil, USA, Germany, Canada, Mexico, Russia and the UK. Each with their own characteristics and special moves.<br/><br/>Upgrade any of your fighters.<br/>Improve your speed to turn your hands into a lightening blur. Boost your power and watch them buckle under a single shot and make your fighter unbeatable with health, defence and recovery.<br/><br/>Great value<br/>Take one of the characters through the whole game absolutely free and enjoy another seven characters for a fraction of the price of other games.", "metacritic": null, "released": "2013-08-29", "tba": false, "updated": "2019-10-22T14:19:29", "background_image": "https://media.rawg.io/media/screenshots/358/358ae704e78b9eb24bd16c5271a31a9f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 193, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Coeus Creative"], "genres": ["Action", "Sports"], "publishers": ["Coeus Creative"], "esrb_rating": "Teen"}