{"id": 217479, "slug": "time-unit", "name": "Time Unit", "name_original": "Time Unit", "description": "Time Unit is the first superhero action game for Apple Watch. <br/><br/>When a mysterious anomaly breaches space-time and unleashes an invasion of monstrous abominations upon the world, the elite heroes of the Time Unit must combine their powers to fix this quantum catastrophe. Explore dangerous environments, recruit new team members and level up their unique abilities to defend the planet from the fearsome minions and bosses of the WORF Initiative. <br/><br/>Designed for a comfortable, convenient experience on the Apple Watch, Time Unit’s intuitive gameplay and controls are fine-tuned for quick bursts of glance-based action that build up in excitement over time. IMPORTANT NOTE: You need an Apple Watch to play the game. <br/><br/>FEATURES: <br/>- Unlock super heroes with unique powers <br/>- Explore the world to unlock special locations <br/>- Battle against bizarre monsters <br/>- Solve puzzles in the Lab to gain resources <br/>- Find Supply Crates with additional resources <br/>- STAY TUNED! More content, features and gameplay are on the way... additional information at www.reddit.com/r/timeunit<br/><br/><br/>DEVELOPER: <br/>Founded by executive talent from Remedy, Digital Chocolate and Rovio and listed as one of the hottest European startups by WIRED, Everywear Games is the first game studio to focus entirely on creating gaming experiences optimized for Apple Watch and similar devices. <br/><br/>PLEASE NOTE: Time Unit is completely free to download and play, but some game items may be purchased for real money. To disable this, turn off the in-app purchases in your device's settings. <br/><br/>www.everyweargames.com/ <br/><br/>Thank you!", "metacritic": null, "released": "2015-12-15", "tba": false, "updated": "2019-10-22T14:19:33", "background_image": "https://media.rawg.io/media/screenshots/295/29512ca8648fd47f6d399d0b77a28659.jpg", "website": "http://www.everyweargames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 146, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Everywear Games"], "genres": ["Action", "Adventure"], "publishers": ["Everywear Games Oy"], "esrb_rating": null}