{"id": 217405, "slug": "castle-breakout", "name": "Castle Breakout", "name_original": "Castle Breakout", "description": "“Castle Breakout, with its stunning photo-realistic 3D graphics and engaging set of puzzles,  sets the highest new standard for the room-escape genre in 2017.” Some forge steel. Others do battle with swords. Your task, as a security expert, is to make sure the castle is safe. Test the castle's updated security system, find the right clues and solve the challenging puzzles. <br/><br/>Over 1,000 hours of super-computer rendering, and intriguing puzzles, ranging from easy to hard, have made this medieval retro art style puzzle game the must have in your \"how to escape\" game collection.<br/><br/>__________________<br/><br/>3D RENDERED GRAPHICS IN PHOTO-REALISTIC DETAILS<br/>An experience so natural, you can almost feel the surface of each object. <br/><br/>INTRICATE CLUES AND CHALLENGING PUZZLES<br/>Easy to begin, getting more complicated and hard to put down.<br/><br/>AWARD-WINNING COMPOSER  MARCO ANTONINI <br/>The perfect background mood for short or long play!<br/><br/>Appunwrapper.com calls Castle Breakout! HD “ The game that scratches that room-escape itch!” <br/><br/>“The game is excellent! The graphics are amazing! The music is great! I can't find a thing wrong with it other than I want to keep playing it!” Michael Spence, USA", "metacritic": null, "released": "2015-06-04", "tba": false, "updated": "2019-10-22T13:49:01", "background_image": "https://media.rawg.io/media/screenshots/d39/d39110469fe04218b510c13940ea8fb7.jpg", "website": "https://www.goldengauntlets.com/AboutUs/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 342, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "iOS"], "developers": ["Cloudburst Room Escape"], "genres": ["Adventure", "Strategy", "Puzzle"], "publishers": ["Cloudburst Room Escape"], "esrb_rating": null}