{"id": 217460, "slug": "space-pop-shooter", "name": "Space Pop Shooter", "name_original": "Space Pop Shooter", "description": "Play with friends and family the best bubble popper puzzle game!<br/>Download Space Pop Shooter for free and get ready to explore the galaxy. <br/>This amazing bubble shooter puzzle features thousands of highly addictive levels, a fun gameplay and cool in-game features. <br/><br/>You’ll get addicted to this galactic bubble pop game in no time! Your goal is to blast and crack all the balls, clear the board and save the galaxy. Finish all the different missions so you can move on to the next space adventure! Space Pop Shooter is the best bubble shooter game  that will keep you entertained for hours! <br/><br/>Enjoy an easy and fun gameplay, tap where you want to shoot the bubbles, remove the bubbles from the board and fly to the next fun level. <br/>Match colors and break all the bubbles to achieve the level target and win. The more balls you remove from the board in one shot, the higher score you’ll get!  <br/><br/>Take a ride on our spaceship, orbit the moon and the earth and explore 1000+ exciting levels packed with awesome puzzles and challenges. Play and enjoy a classic gameplay and lot of cool features and visual effects. <br/>Space Shooter Features:<br/>- Colorful bubbles and fun puzzles. <br/>- A rich supply of boosts and power-ups.<br/>- Unlock the fireball and boost up your game!  <br/>- Amazing visual effects. <br/>- Exciting new challenges and missions. <br/>- Relaxing and addictive game mode. <br/>- Get a free GIFT everyday! <br/>- Thousands of cosmic levels to explore! <br/>- Unique challenges to discover. <br/>- Easy to learn and play.<br/>- Perfect game to kill time.<br/>- Aim and shoot matching bubbles. <br/>- Practice your matching skills.    <br/>- Get 3 stars on each level! <br/>- Suitable for all ages. <br/><br/><br/>**Play and Win!** <br/>* Join the space frontier and smash all the balls in this fun galaxy shooter. <br/>* Make sure to aim well so your bubble will land exactly where you want it. <br/>* Drop the big groups of bubbles first so you can clear a path. <br/>* Each new level has a different target you need to reach, so plan your moves carefully and fire away!<br/>* See which bubble color you are going to get next so you can plan your moves and make these bubble drop &amp; pop!<br/>* Bubble swap option is free- use it wisely! All you have to do is tap on the bubble to change its color.<br/><br/>It’s a must have app for fans of bubble shooter games!<br/>Take a spacecraft to get to the moon and help the astronauts in their special mission. Navigate through 1000+ puzzle levels, popping and smashing all the bubbles. <br/><br/>Fans of the good old bubble shooter games? You must try this fun new hit! The solar system needs protection- fight the space invaders and defend the bubble galaxy! Download for free and enjoy original new levels and challenges, shoot the balls and clear the board. <br/>Download this fun puzzle game and put your strategy skills to the test in this exciting bubble popping adventure. Explore the galaxy and use amazing boosters that will help you get through challenging levels. Tease your brain and journey through the sky in this all-new bubble shooter game - It is fun and entertaining! <br/>We would love to hear your feedback! <br/>Liked the game? Please support us by rating the game so we can keep improving and create more fun levels. <br/><br/>Space Pop Shooter is completely free to download and play, but some optional in-game items will require payment.", "metacritic": null, "released": "2018-02-27", "tba": false, "updated": "2019-10-22T14:19:33", "background_image": "https://media.rawg.io/media/screenshots/502/5022f1330b360a57953e0e91666e05a5_M2CQM2J.jpg", "website": "http://www.ilyon.net/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 24, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Nadav Salomon"], "genres": ["Adventure", "Arcade"], "publishers": ["Nadav Salomon"], "esrb_rating": "Everyone 10+"}