{"id": 217567, "slug": "the-princess-case-a-royal-scoop-a-hidden-object-ad", "name": "The Princess Case - A Royal Scoop - A Hidden Object Adventure", "name_original": "The Princess Case - A Royal Scoop - A Hidden Object Adventure", "description": "Getting the biggest scoop of her career was never so hard for one intrepid reporter. How could a simple news story turn into a police investigation. <br/><br/>The media were all smiles as the royal couple set off on their honeymoon trip. A reporter with New York’s People Mag, Lois Wheeler was the first on the trail of a big exclusive. But when she finds her way into the newly-weds' hotel, Lois gets more than she bargained for. <br/><br/>* UNLOCK THE FULL VERSION DIRECTLY IN THE GAME *<br/><br/>Instead of interviewing the couple of the moment, she finds herself tangled up in an international kidnapping case. And before she knows it the FBI are involved. <br/><br/>Thrown into a situation unlike any she has faced in her career, Lois has to use her investigative skills and gift for languages to rise to the occasion. Seek out the objects used to commit the kidnapping and begin your investigation. <br/><br/>Use your reporting skills and powers of observation and deduction to evade the trickiest of situations.<br/><br/>- Retina Display (on iPhone/iPod)<br/>- A host of superb animated scenes <br/>- An original storyline <br/>- Simple and intuitive gameplay <br/>- An interactive inventory <br/>- A range of mini games: Puzzles, Match 3, Sliding Blocks etc <br/>_________________________________________ <br/><br/>You have a comment, an opinion, a question, a proposition about one of our games or apps? <br/><br/>Send an email to community@anuman.fr <br/>or <br/>join our Facebook fanpage! <br/><br/>You have a technical issue? Contact support@anuman.fr<br/>_________________________________________", "metacritic": null, "released": "2012-10-24", "tba": false, "updated": "2019-10-22T14:34:21", "background_image": "https://media.rawg.io/media/screenshots/e56/e56f05d317758d3169e1a9380dd66dab.jpg", "website": "http://www.anuman.fr/logiciel-iphone_et_ipod_touch.html", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 233, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Microids"], "genres": ["Adventure", "Puzzle"], "publishers": ["Microids"], "esrb_rating": null}