{"id": 217557, "slug": "hero-siege-pocket-edition", "name": "Hero Siege: Pocket Edition", "name_original": "Hero Siege: Pocket Edition", "description": "NOTE: This game does not work on devices that have less than 2GB of RAM memory such as iPhone 6 and older.<br/><br/>With over 1.5 million copies sold on STEAM:<br/><br/>Hero Siege is a Hack 'n' Slash game with roguelike- &amp; RPG elements. Annihilate hordes of enemies, grow your talent tree, grind better loot and explore up to 6 Acts enhanced with beautiful Pixel Art graphics! This game offers countless hours of gameplay and up to 4 player online multiplayer! <br/><br/>In the depths of Tarethiel a group of monks united the four pieces of the brimstone talisman, waking up the slendering demons below... The Act was fortold in the Ancient Book of Revelations and that Satan would raise from Hell to rule the earth... Someone needs to stop him or else the mankind will soon face extinction! <br/><br/>FEATURES<br/><br/>- ONLINE MULTIPLAYER with up to 4 players!<br/>- Randomly generated levels, items, dungeons, bosses, secrets and events. Every game session you play is different!<br/>- Over 170 unique crafted relics that are either passive, usable or orbiting.<br/>- Randomized Loot + inventory like in Diablo -series<br/>- Over 80 different enemies with the possibility to spawn as rare or elite with extra hp/damage and abilities, but dropping better loot and giving more exp!<br/>- Over 30 Achievements to unlock!<br/>- Customize your character with over 90 different hats!<br/>- 7 Acts to play through! <br/>- Random Dungeons and Crypts to explore and clear from loot and enemies!<br/>- 7 playable classes! <br/>- 6 different difficulty levels to unlock!<br/>- Tons of random! Start discovering all the wonderful secrets and content!<br/>- Loot system with: normal, superior, rare and legendary loot!<br/><br/>Hero Siege: Pocket Edition is fully compatible with MOGA Controllers!", "metacritic": null, "released": "2016-06-18", "tba": false, "updated": "2022-07-14T15:28:09", "background_image": "https://media.rawg.io/media/screenshots/738/738a75cb7e0bd61e9a3f69893ff816d5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 1, "toplay": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 487, "game_series_count": 0, "reviews_count": 2, "platforms": ["iOS", "Android"], "developers": ["Panic Art Studios"], "genres": ["Adventure", "RPG"], "publishers": ["Elias Viglione"], "esrb_rating": null}