{"id": 217596, "slug": "treasure-island-the-golden-bug-full-extended-editi", "name": "Treasure Island - The Golden Bug (FULL) - Extended Edition - A Hidden Object Adventure", "name_original": "Treasure Island - The Golden Bug (FULL) - Extended Edition - A Hidden Object Adventure", "description": "The EXTENDED EDITION  has finally arrived! <br/>- New puzzles <br/>- New scenes <br/>- New objects <br/>- New mini-games <br/>- New characters <br/>- An improved interface, brought to life with the collection of key objects <br/>- An improved gaming experience <br/>- A longer life span <br/><br/>Inspired by Edgar Allan Poe’s novel. <br/>1827 – William Legrand, son of a fallen family, came to Sullivan Island, South Carolina, to flee the misery. <br/>Wandering on the island, he discovers a rare bug, made of gold. He uses a piece of paper to take it. At night, he draws the bug on this same piece of paper, as he is explaining the adventure to his friend Edgar, standing in front of the fireplace. <br/>As William takes back the paper, he realises that symbols appeared on it. It must be an invisible ink, revealed by the heat. From that moment, William thinks it is a Pirate’s document: Captain Kidd’s coded instructions to his hidden treasure… Help William find it! <br/><br/>A THRILLING ADVENTURE: <br/>The bug discovery is only a start. Help William decipher the message left by Captain Kidd! Understand the meaning of the codes used in the message, find your way to the different places, and finally dig out the treasure trunk! <br/><br/>USEFUL HINTS: <br/>Use the Hint: a shiny halo helps you to find one of the objects. <br/>No more hints? Not enough time? Find the bonus stars hidden in the scenes to get more hints or time! <br/><br/>MAGNIFICIENT SETS: <br/>Discover Sullivan Island and its darkest places: William’s crumbling shed, the Devil’s Rock, the forest and its wild life, the desert beach, the Bessops manor in ruins… but also the Charleston fortress on the continent. <br/><br/>CONTENT: <br/>-18 places to observe <br/>-Mini-games: decipher a coded message; find your way thanks to a compass… <br/>-3 profiles management <br/>-Best scores on line <br/>-Search of objects (list, identical objects) <br/>-Help: zoom on selected screens, limited number of reloading hints, bonus stars <br/>-Magnificent sets: high resolution images<br/>-Game Center<br/>-Retina Display<br/>________________________________________ <br/><br/>You have a comment, an opinion, a question, a proposition about one of our games or apps? <br/> <br/>Send an email to community@anuman.fr <br/>or <br/>join our Facebook fanpage! <br/> <br/>You have a technical issue?  <br/>Contact support@anuman.fr <br/>________________________________________", "metacritic": null, "released": "2010-06-26", "tba": false, "updated": "2019-10-22T14:34:22", "background_image": "https://media.rawg.io/media/screenshots/60e/60e7789cad76c5b42ee3e3cacf1cc882.jpg", "website": "http://itunes.apple.com/en/artist/microids/id433861351", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 255, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Microids"], "genres": ["Adventure", "Puzzle"], "publishers": ["Microids"], "esrb_rating": null}