{"id": 217604, "slug": "around-the-world-in-80-days-full-extended-edition", "name": "Around the World in 80 Days (FULL) - Extended Edition", "name_original": "Around the World in 80 Days (FULL) - Extended Edition", "description": "The EXTENDED EDITION has finally arrived! <br/> - New puzzles<br/> - New scenes<br/> - New objects<br/> - New mini-games<br/> - New characters<br/> - An improved interface, brought to life with the collection of key objects<br/> - An improved gaming experience<br/> - A longer life span<br/><br/>Accept the challenge and go around the world in 80 days!<br/><br/>Inspired by Jules Verne’s novel, Around the World in 80 Days<br/>The bet is on: Phileas Fogg, british gentleman, is to make it around the world in 80 days. <br/>Jean Passepartout, his French servant, is going with him. But Fix, a police inspector, has to keep close track of the travellers, as they are suspected to be the thiefs of the Bank of England.<br/>Will Fogg win the bet? Help him surmont the obstacles!<br/><br/>A THRILLING ADVENTURE:<br/>Phileas Fogg’s journey is not that easy. To win the bet, you will have to be courageous, to carefully observe things around you and to be clever!<br/>Elude Fix’ traps, save an Indian widow, find your way in the jungle, and during longer trips, prove your whist opponents that cards don’t have any secrets for you!<br/><br/>USEFUL HINTS:<br/>Use the Hint: a shiny halo helps you to find one of the objects.<br/>No more hints? Not enough time? Find the bonus stars hidden in the scenes to get more hints or time!<br/><br/>MAGNIFICIENT SETS:<br/>Discover incredible sceneries : London, Suez, Bombay, Calcutta, Hong Kong, Yokohama, San Francisco… And use different transportation means, sometimes very surprising : catch a train, go aboard a ship, travel on the back of an elephant!<br/><br/>CONTENT:<br/>• 22 places to visit<br/>• Mini-games: maze, cards games<br/>• Search of objects (list, identical objects)<br/>• Help: zoom on selected screens, limited number of reloading hints, bonus stars<br/>• Magnificent sets: high resolution images<br/>• Game Center <br/>• Retina Display<br/>______________________________________<br/> <br/>You have a comment, an opinion, a question, a proposition about one of our games or apps?<br/> <br/>Send an email to community@anuman.fr<br/>or<br/>join our Facebook fanpage!<br/> <br/>You have a technical issue? <br/>Contact support@anuman.fr<br/> ______________________________________", "metacritic": null, "released": "2010-06-18", "tba": false, "updated": "2019-10-22T14:05:27", "background_image": "https://media.rawg.io/media/screenshots/250/2505527fcc4e43b329a863c8671cbe2c.jpg", "website": "http://itunes.apple.com/en/artist/microids/id433861351", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 188, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Microids"], "genres": ["Adventure", "Puzzle"], "publishers": ["Microids"], "esrb_rating": null}