{"id": 217650, "slug": "vietnam-war-a-10-tank-killer-ii-combat-flight-simu", "name": "Vietnam War. A-10 Tank Killer II - Combat Flight Simulator", "name_original": "Vietnam War. A-10 Tank Killer II - Combat Flight Simulator", "description": "***** App of the Week ***** Editors Choice Best iOS Apps Magazine<br/><br/>*** “ 5/5 - Must Have” -- Mobile Gamer<br/>*** \" Extremely fun and very challenging \" - AppZone ( 9 / 10 )<br/>*** \" Lovely, clean graphics and addictive music \" - Best New Indie Games (4 / 5)<br/>----------------------------------<br/><br/>3D Games presents \"Vietnam War. A-10 Tank Killer II\", second part of the award winning \"A-10 Thunderbolt - Tank Killer\". \"Vietnam War\" is an arcade / simulation game in which You will take part in Vietnam War between USA and Vietnam forces.<br/><br/>\"Vietnam War\" is powered by Unreal Engine technology. By using Epic Games' award-winning, most advanced game engine, our Combat Flight Simulator brings in the game such incredible detailed graphics, real-time lighting with a unique physics and weapon system that has not been here yet. You will not believe it's only a game for mobile devices!<br/><br/>FORGET EVERYTHING ELSE! THIS IS THE ULTIMATE AIR-TO-GROUND  COMBAT GAME!<br/>With an extensive single player missions and the non-stop action will keep you at the edge of your seat! You’ll participate in fierce attacks on  protected convoys of enemy's vehicles, tanks, bridges and even airfields. Everything is set up in accurately recreated locations.<br/><br/>Become the supreme lord of the skies!<br/><br/>CONSOLE QUALITY GAMING AND IT’S ONLY ON iOS!<br/>Unparalleled visuals, special effects and audio including: specular masks, normal mapping,  bump mapping, atmospheric scattering, realistic lighting, sun glare, high<br/>definition textures, 4x anisotropic filtering, HDR rendering, radial blur and more!<br/><br/>OPTIMIZED ON THE NEW iPAD AIR 2 AND iPHONE 6<br/>Optimized for iPhone 6 and  iPad Air 2 with the new A8 processors with greater environmental detail, spectacular visual effects and unparalleled performance!<br/><br/>RESTRICTIONS<br/>Due to the high quality graphics and demanding real-time physics calculations this game is not recommended for older devices including the iPhone 3GS, iPod Touch 1 and iPad 1", "metacritic": null, "released": "2014-10-24", "tba": false, "updated": "2019-10-22T14:19:38", "background_image": "https://media.rawg.io/media/screenshots/b47/b4793af61a8ff0dcd43c967ba5ff9566.jpg", "website": "http://virtual-heritage.co/index.php/games/159-ilyushin-il-2-shturmovik-battle-of-kursk", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 183, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Jacek Chedor"], "genres": ["Simulation", "Arcade"], "publishers": ["Jacek Chedor"], "esrb_rating": "Everyone 10+"}