{"id": 217625, "slug": "medinas-surf-game", "name": "Medina's Surf Game", "name_original": "Medina's Surf Game", "description": "Live the joy of surfing with the first brazilian worldwide surf Champion Gabriel Medina.<br/><br/>Welcome to the best surfing arcade game, where you can have fun on breathless beaches, awesome Medina’s island, live challenges on the wave, run against time and much more.<br/><br/>Customize the character with suits and awsome boards, improve your performance with energy and special bar, challenge friends doing mind-boggling surf maneuvers in playful and fun way.<br/><br/>ATTENTION: Go! Medina is free to download and install. However, some suits, boards, maneuvers and consumables can be bought with real Money. If you don’t wish to use this resource, keep playing with the boards available. The game runs online or off-line.<br/><br/>~~~~~~~~~~~~<br/>RESOURCES<br/>~~~~~~~~~~~~<br/>- World Tour, with 11 amazing worldwide beaches.<br/>- Beach House, to outfit your character with boards, suits and maneuvers for each round.<br/>- Medina’s Island, to practice with 4 game modes (free surf, surf against time, obstacle run and pro surf)<br/>- Surf Store, where acquire boards, suits and maneuvers to improve your performance.<br/>- Players ranking, to compete with the best players worldwide.<br/><br/>~~~~~~~~~~~~<br/>AND MORE<br/>~~~~~~~~~~~~<br/> - Incredible Surfing landscapes<br/> - Daily Bonus<br/> - Amazing Sound Track<br/> - Challenge and Professional Mode<br/> - Share with Social Medias<br/> - 5 attempts to score<br/> - More than 10 board models<br/> - More than 20 suit models<br/> - 5 incredible maneuvers", "metacritic": null, "released": "2017-08-28", "tba": false, "updated": "2019-10-22T14:19:37", "background_image": "https://media.rawg.io/media/screenshots/9ab/9abbdaaa4bba751662003daa7bea8e4b.jpg", "website": "https://youtu.be/Xitpmm0vSaE", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 121, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["SOMA"], "genres": ["Sports", "Arcade"], "publishers": ["Solucoes Mobile Avancadas Ltda EPP"], "esrb_rating": "Everyone 10+"}