{"id": 217640, "slug": "newgrange-virtual-3d-tour-travel-guide-of-irelands", "name": "Newgrange - Virtual 3D Tour & Travel Guide of Ireland's most famous monument (Lite version)", "name_original": "Newgrange - Virtual 3D Tour & Travel Guide of Ireland's most famous monument (Lite version)", "description": "Virtual Heritage presents LITE version of the \"Newgrange - Virtual 3D Tour &amp; Travel Guide of Ireland's most famous monument\".<br/><br/>Newgrange is one of the best examples in Ireland and in Western Europe, of a type of monument known to archaeologists as a passage-grave or passage-tomb. It was constructed over 5,000 years ago, about 3,200 B.C., making it older than Stonehenge in England and the Great Pyramid of Giza in Egypt.<br/><br/>\"Newgrange\" is powered by Unreal Engine technology and is an awesome new way to experience this unique monument. The application  is a walking simulator over 3D reconstruction of this prehistoric monument as it might have looked like in the past.<br/><br/>By using Epic Games' award-winning, most advanced game engine, viewers can freely walk around, learn and experience this 3D reconstructed monument in their own pace in engaging and educating way.<br/><br/>If you want to feel like one of the ancient people celebrating mid-winter solstice, this app is for You.<br/><br/><br/>FEATURES: <br/><br/>* Powered by Unreal Engine<br/>* Walking simulator over detailed 3D reconstruction of Newgrange<br/>* Experience mid-winter solstice<br/><br/>* Great for kids as a supplementary history lesson (no In-App Purchases) Just let Your child explore our 3D reconstruction as any other FPS game level", "metacritic": null, "released": "2014-10-17", "tba": false, "updated": "2019-10-22T14:19:38", "background_image": "https://media.rawg.io/media/screenshots/35f/35f993dd3768003d377fb5421d4b29c8.jpg", "website": "http://virtual-heritage.co/index.php/prehistoric-world/152-stonehenge", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 122, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Jacek Chedor"], "genres": ["Adventure", "Simulation"], "publishers": ["Jacek Chedor"], "esrb_rating": null}