{"id": 217622, "slug": "jules-vernes-return-to-mysterious-island-directors", "name": "Jules Verne's Return to Mysterious Island - Director's Cut Lite", "name_original": "Jules Verne's Return to Mysterious Island - Director's Cut Lite", "description": "Voices and text in English.<br/>The true essence of adventure is captured in this second game inspired by renowned author Jules Verne. In this first-person survival adventure, players will encounter recognisable locations from the famous novel, including the granite house, the volcano and the Nautilus. However, Return to Mysterious Island goes beyond Jules Verne's storytelling as players take on the role of Mina, a courageous young woman on a solo round-the-world sailing expedition.<br/><br/>In your quest for survival using logic, discovery, creative inventory management, and elements of the supernatural, the adventure unfolds across splendid photorealistic pre-rendered vistas. Intuitive puzzle challenges and vast exploration of the lush tropical landscapes of the island, all combine for a brilliantly executed adventure game.<br/><br/>Round-the-world saling expedition... Ship wrecked on a deserted island.. The ghost of Captain Nemo... The quest for survival... Caught in a tremendous storm, Mina, our heroine, becomes stranded on the shores of a wild and apparently uninhabited island. As she explores her new surrounding, she uncovers artifacts, living spaces and technologies left behind by the people who came before her to this uncharted island.<br/><br/>FEATURES<br/>- Inspired by Jules Verne's classics<br/>- Mass Appeal Theme: \"stranded on a desert island\"<br/>- Survival, exploration, discovery and puzzles, set in a tropical island setting.<br/>- Original interactive inventory system allows you to combine and create new items and tools.<br/>- Proprietary engine allows for fluid and intuitive point-and-click navigation.<br/>- Photorealistic settings and numerous recognizable locations to explore: Granit House, the volcano and the Nautilus.<br/>- Meet and interact with the ghost of Captain Nemo.<br/>- Videos, voices and texts in english, french, spanish, italian and german.<br/><br/>★ DON'T FORGET TO CHECK OUT OUR OTHER FANTASTIC ADVENTURE GAMES! ★<br/><br/>On Mac:<br/>Amerzone: The Explorer's Legacy<br/>Dracula Resurrection<br/>Dracula : The Last Sanctuary<br/>Dracula The Path of the Dragon (3 parts)<br/>Egypt Series: The Prophecy (3 parts)<br/>Nostradamus: The Last Prophecy - Director's Cut<br/>Still Life 2 - Director's Cut<br/>Versailles 2 - Complete Game<br/>Jules Verne's Journey to the Center of the Moon<br/>Jules Verne's Return to Mysterious Island 2<br/><br/>On iPhone/iPad:<br/>Amerzone: The Explorer's Legacy (3 parts)<br/>Dracula: Resurrection (3 parts)<br/>Dracula : The Last Sanctuary<br/>Dracula The Path of the Dragon (3 parts)<br/>Egypt The Prophecy (3 parts)<br/>Jules Verne's Journey to the Center of the Moon (3 parts)<br/>Jules Verne's Return to Mysterious Island 2<br/>Nostradamus The Last Prophecy (2 parts)<br/>Versailles 2 (3 parts)<br/><br/>♥ FOLLOW US ♥<br/><br/>MICROIDS<br/>On twitter.com/microids_off<br/>On facebook.com/microids<br/>On microids.com/en<br/><br/>ANUMAN INTERACTIVE<br/>On twitter.com/anumani <br/>On facebook.com/anuman.fr<br/>On anuman-interactive.com", "metacritic": null, "released": "2011-12-23", "tba": false, "updated": "2023-03-18T09:41:01", "background_image": "https://media.rawg.io/media/screenshots/fb0/fb0f5fcd755f6e8b43d2244e582f2984_2vPZyPl.jpg", "website": "http://itunes.apple.com/us/artist/microids/id433861351?mt=12", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 220, "game_series_count": 0, "reviews_count": 1, "platforms": ["macOS"], "developers": ["Microids"], "genres": ["Adventure", "RPG"], "publishers": ["Microids"], "esrb_rating": null}