{"id": 217676, "slug": "irollercoaster-3", "name": "iRollerCoaster 3", "name_original": "iRollerCoaster 3", "description": "The iRollerCoaster team is proud to present:<br/>iRollerCoaster 3 - The Extreme Roller Coaster Simulation Game!<br/><br/>Includes the iRollerCoaster custom track designer and builder!<br/><br/>The Amusement Parks features 60 different tracks with:<br/><br/>- Normal Roller Coasters<br/>- Inverted Roller Coasters<br/>- Hovercraft Racer<br/>- Water Slides<br/><br/>Ride perfectly engineered realistic roller coaster tracks all over the world. Buy land in different cities from around the world and then buy your favorite tracks.  Each track you buy generates more revenue to buy more tracks with!  You can view the real time tracks in multiple different camera angles while the cars are moving.<br/><br/>Ride world-class tracks in the following cities:<br/><br/>- Orlando, Florida<br/>- Sandusky, Ohio<br/>- Rome, Italy<br/>- Shanghai, China<br/>- Monte Carlo, Monaco<br/>- Williamsburg, Virginia<br/>- Cape Town, South Africa<br/>- London, England<br/>- Zermatt, Switzerland<br/>- Las Vegas, Nevada<br/>- Los Angeles, California<br/>- Canberra, Australia<br/>- Paris, France<br/>- Tokyo, Japan<br/>- Atlantic City, New Jersey<br/><br/>Our roller coasters use a realistic lift hill cable to pull the cars to the peak of the track. Once the cars reach the peak, potential energy accumulated by the rise in height transfers to kinetic energy and the cars race downwards. Some energy is lost to friction on the track itself. The effects of gravity are taken into account to increase speed and accelerations accurately. You can experience several G's of force on high-speed turns!<br/><br/>iRollerCoaster 3 features:<br/>- Advanced OpenGL shader graphics<br/>- Music and sound effects<br/>- High-resolution textures<br/>- Made for iPhone 5, iPad retina, and all other iOS 4.0+ devices<br/><br/>iRollerCoaster 3 is brought to you by the makers of World Winter Games and iBASEjump.", "metacritic": null, "released": "2013-06-06", "tba": false, "updated": "2019-07-30T11:57:30", "background_image": "https://media.rawg.io/media/screenshots/cf9/cf96945feaa0163f600453a30b792ae2.jpg", "website": "http://www.seaventurellc.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 165, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Sea Venture"], "genres": ["Simulation", "Racing"], "publishers": ["Sea Venture"], "esrb_rating": null}