{"id": 2176, "slug": "anodia-unique-brick-breaker", "name": "Anodia: Unique Brick Breaker", "name_original": "Anodia: Unique Brick Breaker", "description": "Anodia has a solid 5 star rating with thousands of comments and  is enjoyed by millions of players. Any hesitation? Just read the Customer Reviews! <br/><br/><br/>Play through over 150 handcrafted and unique levels, compete with your friends on Game Center leader boards, unlock over 30 achievements and simply have a lot of fun with Anodia. <br/><br/><br/># MAIN FEATURES # <br/>— full iPhone 6 and iPhone 6 Plus support<br/>— brick breaker genre reinvented <br/>— fast-paced addictive gameplay <br/>— easy to pick up and play <br/>— over 150 handcrafted levels <br/>— over 20 power-ups and power-downs <br/>— full Retina Display support <br/>— touch and tilt controls <br/>— superb realtime physics <br/>— Game Center integration <br/>— universal app <br/>— it has a rainbow! <br/><br/><br/># MEDIA REVIEWS #<br/>— TouchArcade.com: <br/>&amp;#39;All I want is a really awesome modern take on the Breakout formula. Is that so much to ask? Apparently not, because that&amp;#39;s exactly what Anodia gives us.&amp;#39; <br/><br/>— 148Apps.com: <br/>&amp;#39;Anodia takes the tried and tested formula of Arkanoid and mixes it up with great style.&amp;#39; <br/><br/>— Appmodo.com: <br/>&amp;#39;All in, Anodia is a top-notch brick breaker game—possibly even the best for the iOS.&amp;#39; <br/><br/><br/># USER REVIEWS #<br/>&amp;#39;The Screenshots Do NOT Do This Game Justice!!! - Not like any brick breaker I&amp;#39;ve ever played.&amp;#39; <br/><br/>&amp;#39;Best Brick Breaker Game Since BreakOut in 1975 - If u like brick breakers this is the game for you. Super fun, creative, and perfect for the iOS.&amp;#39; <br/><br/>&amp;#39;REVOLUTIONARY! - A cross somewhere between brick-breaker, pong, and something entirely new! You&amp;#39;ll have fun just trying to figure out what it is?! A MUST BUY!&amp;#39; <br/><br/>&amp;#39;Wonderful!!!!! - This is one of the best in the entire app store!Thanks Devs!!!!!&amp;#39; <br/><br/>&amp;#39;Brick Breaker Masterfully Reinvented! - I&amp;#39;m in love with the game! I love brick breakers and this is the best one in my honest opinion.It&amp;#39;s original and masterfully crafted with many differents stages and powerups!If you like brick breakers GO GET IT!&amp;#39;", "metacritic": null, "released": "2011-05-26", "tba": false, "updated": "2019-10-22T14:28:00", "background_image": "https://media.rawg.io/media/screenshots/f6d/f6db137bfbe39b776bdf2c08b0f5cc30.jpeg", "website": "http://anodia.cluelesslittlemuffin.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 124, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Clueless Little Muffin"], "genres": ["Arcade", "Family"], "publishers": ["Clueless Little Muffin"], "esrb_rating": "Everyone 10+"}