{"id": 217790, "slug": "candy-jigsaw-puzzles-games", "name": "Candy Jigsaw Puzzles Games", "name_original": "Candy Jigsaw Puzzles Games", "description": "Are you a true admirer of jigsaw puzzles but tired of constantly missing pieces? We have a way out! Food Jigsaw Puzzles is the best choice for you! <br/><br/>What makes beautiful jigsaw puzzles hd for girls special?<br/>-\tRich collection of high definition images of desserts will challenge your brain and help you enjoy colorful jigsaw puzzles free games for adults;<br/>-\t5 difficulty modes suit for all ages starting from easy food puzzles for kids free to 100 piece jigsaw puzzles for experts;<br/>-\tCollect ice cream jigsaw puzzle of different sizes: 2x3, 4x6, 6x9, 12х8, 15х10;<br/>-\tSave your progress to continue playing from where you’ve stopped before;<br/>-\tA number of jigsaw puzzles with levels are so addictive that you'll want to play more and more;<br/>-\tPleasant background music contributes to the relaxing atmosphere;<br/>-\tIntuitive interface and touch controls are designed to be played even by toddlers and preschool children;<br/>-\tThis puzzle game works perfectly well both on smartphones and tablets.<br/><br/>A wide selection of high quality chocolate jigsaw puzzles will bring many hours of fun to the whole family while playing food jigsaw puzzles free for adults.<br/>The game is so easy to play. Parts which are placed correctly will stick together. Assemble pieces into groups, then move and connect the groups. With 5 difficulty levels both children and adults will enjoy this puzzle game.<br/>These awesome jigsaw puzzles are also designed for the development of fine motor skills, logical thinking, concentration, attention visual and spatial thinking. <br/><br/>Want more very hard and challenging jigsaw puzzles? Check out more free themes!", "metacritic": null, "released": "2016-07-08", "tba": false, "updated": "2019-10-22T14:19:40", "background_image": "https://media.rawg.io/media/screenshots/15e/15ea2774cd4efe100be54dd0aacc86c5_U9PRbWk.jpg", "website": "http://smartkids-games.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 19, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Alfasoft", "Halina Tsitova"], "genres": ["Board Games", "Puzzle"], "publishers": ["Alfasoft", "Halina Tsitova"], "esrb_rating": null}