{"id": 217700, "slug": "pirates-solitaire-3", "name": "Pirate's Solitaire 3", "name_original": "Pirate's Solitaire 3", "description": "Reveal the secret of a treasure island in Pirate’s Solitaire! The Jolly Roger is raised, the ship is ready to sail and adventures in the Caribbean are about to begin... But where’s the pirate treasure? Maybe Captain Flint’s map holds the answer? No! The cards know the answer... the cards of Pirate’s Solitaire - 120 unique solitaire layouts in which you’ll have to search for the old pirate’s treasure!<br/><br/>Classic solitaire with a new and unique mechanic – collect pairs of cards by using various bonuses: mulligan, shuffle and joker. Any card on the table provides a reward, and a special multiplier can make it far more valuable. Find card pairs faster and keep an eye on the multiplier!<br/><br/>What’s that? You say you’re an experienced sea dog and you need a truly fierce sea battle? Then select \"Sea Dog\" difficulty and complete the 12 locations over again, but with new rules!<br/><br/>So, is your ship ready to take on board... unique pirate-themed graphics? Exciting card gameplay both for young captains and hardened pirates alike? And a multitude of bonus rewards? On top of all that, there’ll be jolly pirate music to make this card game a real adventure on the Caribbean sea!<br/><br/>Pirate’s Solitaire offers a whole chest of excitement:<br/><br/>- Сard solitaire game for new players and experts alike<br/>- Unique game mechanics – choosing pairs of cards<br/>- Use various bonuses – mulligan, shuffle and joker<br/>- Collect gold cards to complete the level and unlock the next location<br/>- Collect bonus cards to get more coins and bonuses<br/>- Collect cards fast – make combos and get good rewards<br/>- 12 locations, 120 levels and multiple difficulty modes<br/>- For daring players, we offer special tasks and over 15 colorful trophies<br/>- Colorful high-quality graphics in a jolly pirate style<br/>- Original themed decks and 12 card backs<br/>- Beautiful music that doesn't distract from gameplay", "metacritic": null, "released": "2015-07-24", "tba": false, "updated": "2019-10-22T14:19:39", "background_image": "https://media.rawg.io/media/screenshots/6de/6deef88e1b0d79c9c3f336b0d44b5756.jpg", "website": "http://www.facebook.com/8FloorGames", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 138, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["8Floor"], "genres": ["Card", "Puzzle"], "publishers": ["8Floor"], "esrb_rating": "Everyone 10+"}