{"id": 2177, "slug": "the-walking-dead-no-mans-land", "name": "The Walking Dead: No Man's Land", "name_original": "The Walking Dead: No Man's Land", "description": "Join Rick, Daryl, Michonne and other iconic characters from AMC’s The Walking Dead in the official mobile game of the show. Do you have what it takes to stay alive?<br/><br/>The Walking Dead: No Man’s Land is a thrilling, action-packed RPG where tactical choices make the difference between life and death. Only the strongest will survive so choose your team wisely: bring Michonne and dominate in close-quarter combat or send Rick to dispatch enemies from afar. Or perhaps you’ll choose to snipe from a distance with Daryl’s crossbow, or mow the herd down with Abraham’s assault rifle.<br/><br/>• FIGHT through hordes of deadly enemies in tactical turn-based combat<br/>• COLLECT and upgrade your favorite characters from AMC’s The Walking Dead<br/>• CHOOSE the right team and the equipment for each mission<br/>• HUNT walkers in Terminus, The Prison and other familiar locations from AMC’s The Walking Dead<br/>• JOIN other players in deadly weekly challenges and PVP combat for exclusive rewards<br/><br/>“Throw in some pretty swish graphics, lovely animations and blood splatters, and you have one of the most carefully fleshed out zombie games we&amp;#39;ve seen on mobile. It looks lovely, and plays great too.” - Pocketgamer<br/><br/>“Each aspect of survival on AMC&amp;#39;s The Walking Dead has been parallel to the series&amp;#39; official mobile game, subtitled No Man&amp;#39;s Land.” - Mashable<br/><br/>“Imagine your favorite mobile base-building strategy game, mix in a dash of XCOM, and then paint on a fresh coat of AMC’s The Walking Dead. That’s No Man’s Land in a nutshell.” - Gamezebo<br/><br/>For more, please visit:<br/><br/>http://www.facebook.com/thewalkingdeadnomansland<br/>http://twitter.com/twdnomansland<br/>http://www.thewalkingdeadnomansland.com<br/>http://www.youtube.com/nxtgms<br/><br/>For player support, please visit:<br/>nextgames.helpshift.com", "metacritic": null, "released": "2015-10-07", "tba": false, "updated": "2019-07-29T18:00:46", "background_image": "https://media.rawg.io/media/screenshots/58e/58e26a0efe1d2ea2c6b5d194957cf002.jpg", "website": "http://www.thewalkingdeadnomansland.com/", "rating": 0.0, "rating_top": 3, "added_by_status": {"yet": 1, "owned": 3, "beaten": 1, "dropped": 4, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 5, "suggestions_count": 555, "game_series_count": 0, "reviews_count": 5, "platforms": ["Android", "iOS"], "developers": ["Next Games", "Next Games Oy"], "genres": ["RPG", "Strategy"], "publishers": ["Next Games Oy"], "esrb_rating": "Mature"}