{"id": 217797, "slug": "math-matching-game-space-math-qiuz", "name": "Math Matching Game. Space Math qiuz", "name_original": "Math Matching Game. Space Math qiuz", "description": "Hello, math space explorers! Jump into your spaceship and let’s go towards interstellar adventures!  <br/><br/>Travel between galaxies, discover new planetary systems, explore 200+ planets and even meet aliens by playing mathematics puzzle games. Land your spaceship on unknown planets to get resources for new planetary missions. But you should fight for these resources. Each planet challenges you with memory cards kids with tasks on addition, subtraction, multiplication and division. Solve math quiz games to collect stars that are necessary to reach new galaxies. <br/><br/>Explore two galaxies – the Galaxy of Light and the Dark Universe. The Galaxy of Light is a perfect training ground to learn math for kids. Just match math tasks and answers. But the Dark Universe is quite a tricky place. You’ll need all your attention and speed. Try to remember as many tasks as possible before cards flip. <br/><br/>The rules of these math games with levels are simple: match pairs quickly and avoid giving incorrect answers to get more stars! You’ll need these stars to travel between Planetary Systems. The more stars you collect the more Planetary Systems you’ll be able to visit.<br/><br/>Features of these math puzzle games which help you increase your brain power:<br/>-\tLearn basic math operations: multiplication, division, addition and subtraction<br/>-\tChallenge yourself in two difficulty modes of educational math games for 10 year olds: easy (the Galaxy of Light) and hard (the Dark Universe)<br/>-\tPlay arithmetic games in two galaxies with math brain games on 35 Planetary Systems and 200+ planets to explore<br/>-\tSolve various math equations with math quizzes <br/>-\tThe difficulty level adjusts your progress which means that this math quizzes and tests for all grades<br/>-\tGreat learning assistant for children to learn addition, division, multiplication quiz and subtraction<br/>-\tFun arithmetic practice and math training for adults to test their knowledge of arithmetic in math trivia", "metacritic": null, "released": "2017-07-06", "tba": false, "updated": "2019-10-22T14:19:41", "background_image": "https://media.rawg.io/media/screenshots/e34/e34b415a0201ef666c13b6c3d01b2b13_uJmb8Nf.jpg", "website": "http://smartkids-games.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 80, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Alfasoft", "Halina Tsitova"], "genres": [], "publishers": ["Alfasoft", "Halina Tsitova"], "esrb_rating": null}