{"id": 217894, "slug": "number-chain-by-szy", "name": "Number Chain by SZY", "name_original": "Number Chain by SZY", "description": "Video demo at Support Web Site or Youtube (http://www.youtube.com/watch?v=sXhknhcfSx4) <br/><br/>This is an incredibly amazing game! You can easily win hundreds of points; you can also carefully play the game and win millions of points. All in your hands! <br/><br/><br/>*** Purpose <br/>Build as many as possible removable chains so as to achieve incredible scores and challenge the longest chains! <br/><br/><br/>***Rules <br/>When three or more than three same or consecutive numbers are aligned together, they constitute one removable chain that will be automatically removed. Once the chain is removed, another removable chain may be constituted and removed automatically. It goes on until there is no more removable chain. The longer the removed chain is, the higher the score is. <br/><br/>It is called \"RENSA\" when chains are removed one by one. You can view the demo of 25 Rensa inside the game (see screenshots). <br/><br/>*** Details <br/>* There are 10 different digital numbers from 1 to 10, and each can be used 12 times; Game ends when all numbers are used up. <br/>* When the chain length is longer than three, Final Number of 0 will be rewarded. It is used to remove all numbers at final stage. <br/>* When game ends with no number in the pool, score is doubled. <br/><br/><br/>*** Others <br/>* Support Chinese, English, Japanese, Traditional Chinese, French, German, Spanish, Italian, Dutch, Portuguese, Russian, and Swedish. <br/>* Support leaderboards and achievements in Game Center. <br/>* Support saving game automatically. <br/>* Support Game Center Agency to report scores achieved in Mac OS.", "metacritic": null, "released": "2012-01-06", "tba": false, "updated": "2019-10-22T14:19:43", "background_image": "https://media.rawg.io/media/screenshots/87b/87b583576715f2075e065c93ece9460b.jpg", "website": "http://www.youtube.com/watch?v=sXhknhcfSx4", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 21, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Shen Zhongyuan"], "genres": ["Board Games", "Puzzle"], "publishers": ["ZHONGYUAN SHEN"], "esrb_rating": null}