{"id": 21781, "slug": "ares-extinction-agenda-ex", "name": "A.R.E.S. Extinction Agenda EX", "name_original": "A.R.E.S. Extinction Agenda EX", "description": "The game takes players on a thrilling sci-fi adventure! Take control of combat specialist Ares, or the new playable character, Tarus, to battle deadly machines with a variety of powerful weapons and armor. Your goal: Save Minos Space Station’s survivors and uncover the nefarious Zytron’s extinction agenda!Key Features:<ul><li><strong>Receiving EX Transmission</strong> – A.R.E.S. Extinction Agenda EX has been refitted with new friendly UI, control scheme, and leaderboards.<br/> </li><li><strong>Upgrade Complete</strong> – Armed with new weapons, abilities, and even a new playable ally, humanity’s secret weapon has never been stronger.</li></ul><br/> <ul><li><strong>Obstruction Eminent</strong> – Ares isn't the only one with new tricks; new enemies and bosses have also joined the fray. Along with challenges stages, you’ll need all your might and power to fight off these guys.<br/> </li><li><strong>Uncharted Sectors</strong> – With readjusted maps and completely new levels, there are an abundance of areas to explore for new and returning robots alike. Delve deeper into the world of A.R.E.S. and discover new areas of Minos Space Station you never knew existed!<br/> </li><li><strong>Visuals Updated</strong> – New high resolution textures as well as brand new animated cut scenes.<br/> </li><li><strong>Audio Enhanced</strong> – A.R.E.S. Extinction Agenda EX comes complete with the original soundtrack by Hyperduck Soundworks. Also now boasting a completely new additional soundtrack for the second campaign from Heavy Metal master Charlie Parra Del Riego, a perfect fit for Tarus the heavy metal Tanker.</li></ul>", "metacritic": null, "released": "2014-10-03", "tba": false, "updated": "2023-05-31T13:30:12", "background_image": "https://media.rawg.io/media/screenshots/86c/86ce66fbf9b27ab53d0910b37f6a38ab.jpg", "website": "http://x10interactive.com/ares-ex/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 84, "beaten": 3, "toplay": 2}, "playtime": 4, "achievements_count": 31, "ratings_count": 2, "suggestions_count": 394, "game_series_count": 1, "reviews_count": 4, "platforms": ["PC"], "developers": ["Extend Studio"], "genres": ["Action", "Indie"], "publishers": [], "esrb_rating": null}