{"id": 217800, "slug": "memory-cards-space-adventures", "name": "Memory Cards. Space Adventures", "name_original": "Memory Cards. Space Adventures", "description": "Are you ready for breathtaking space adventures? Do you want to train you memory and attention? «Memory Cards. Space adventures» is an educational game for toddlers, memory card matching game, and space game rolled just into one!<br/>In this memorization gamesyou can take on different roles: just play for brave astronauts or for fearful aliens – only you get to choose! All depends on you: will you kill aliens or will you take their part in the fight!<br/>«Memory Cards. Space adventures» is a fascinating memory game for kids. With the help of this space game you can train your concentration, attention, fine motor skills, as well as memory! The main goal of «Memory Cards. Space adventures» memory training game is to find the pair of cards. You can play in 2 modes: or on the speed or on number of steps. Try to remember as much correspondences as you can to turn cards with their pairs! More stars you’ll find, more stars you’ll get! You need these stars for space travels! Win and discover new worlds, only you’ll decide the outcome of robots vs aliens battle!<br/>Main features of «Memory Cards. Space adventures» educational space game with cards are:<br/>•\tTrain your memory and concentration with the help of fascinating and funny memory cards;<br/>•\tParticipate in space battles in 2 modes: for astronauts or for aliens;<br/>•\tPlay in «Memory Cards. Space adventures»: save and discover many planets;<br/>•\tGet pleasant and charming bonuses for your space achievement;<br/>•\tComplete all the levels in this exciting attention game;<br/>•\tTell everybody that you’re playing in «Memory Cards. Space adventures» - infect everybody by space-fever! Compare your achievements with your friends’ achievements while playing in space games without Internet-connection. <br/><br/>Join to fascinating world of \"Memory Cards Classic\" where fun and benefit go together!", "metacritic": null, "released": "2017-08-15", "tba": false, "updated": "2019-10-22T14:19:41", "background_image": "https://media.rawg.io/media/screenshots/c62/c6242274a64aaec7c0d473182e0ce537_Z8Hb2Pc.jpg", "website": "http://smartkids-games.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 77, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Alfasoft", "Halina Tsitova"], "genres": ["Adventure", "Puzzle"], "publishers": ["Alfasoft", "Halina Tsitova"], "esrb_rating": null}