{"id": 217854, "slug": "super-space-laser", "name": "Super Space Laser", "name_original": "Super Space Laser", "description": "The Earth is dead,  scorched and burnt by the invaders from another Galaxy.<br/><br/>The last of humanity survives in the Zircon 4 Space Station, it still orbits around the smoking remains of our charcoaled home world. <br/><br/>The station its equipped with the most powerful Laser in the known Universe, unfortunately it was not completed in time to save our beautiful planet.  <br/><br/>Even now its only partly operational, and unable to save the sole survivors of the Human race that live on the station. <br/><br/>And so we need a hero (That's you) , your job is to pilot a lone X-wing star fighter and defend the station against the hordes of attacking aliens.<br/><br/>The repair crews are working frantically to complete the super laser, once its online and fully charged you can use it to annihilate the attacking ships and save the human race.<br/><br/><br/>The Game :- its a retro arcade style game with lots of invading alien ships that you need to blast to smithereens.<br/><br/>You can shoot the aliens at they are approaching, or weave and dive around the space station taking them on at close quarters. Once the Space Station's Laser is charged click on the fire button and watch the immense power of the Laser wipe out all attacking ships.<br/><br/>The Space Station is capable of taking a vast punishing from the galactic invaders, but keep an eye on the damage bar in the bottom right corner. Once it gets critical the space station will explode and that's game over.<br/><br/>You can safety shoot towards the space station, your weapons will do it no damage.<br/><br/>Are you the Hero we are looking for :- download the Super Space Laser now, defend the station, save humankind!", "metacritic": null, "released": "2016-01-03", "tba": false, "updated": "2019-07-30T15:26:32", "background_image": "https://media.rawg.io/media/screenshots/4f9/4f9f52db48aa61afbd3ca6d61d81e50c_N4GrmFq.jpg", "website": "http://galaticdroids.com/superspacelaser.html", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 191, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Galatic Droids"], "genres": ["Action", "Arcade", "Casual"], "publishers": ["Gold 5"], "esrb_rating": null}