{"id": 217918, "slug": "flag-solitaire-free", "name": "Flag Solitaire Free", "name_original": "Flag Solitaire Free", "description": "(Video demo in Youtube)<br/>http://www.youtube.com/watch?v=w7Tmu29rbic<br/><br/>(General Introduction) <br/>You have two ways to enjoy this game: playing the solitaire or answering the quiz. Yet they are not separated. You need first play the solitaire to get chances for quiz. And you will answer better if you play more. <br/><br/>(Number of Countries/Regions) <br/>There are totally 175 countries/regions in the game, classified into seven groups by population from high to low, with 25 countries/regions in each group. <br/><br/>(Playing the Solitaire Game) <br/>Playing the solitaire requires your observation and patience. You are to remove two same flags each time until all flags are removed. If two flags are positioned vertically or horizontally with no other flags existing between them, they are removable. To make flags removable, you can move flags only one time. Your task is to find out the flags that are potentially removable. This is where your observation and patience are required. And you have only one chance for hints. <br/><br/>(Answering the Quiz) <br/>You will get 0 to 6 chances to answer the quiz after each solitaire, depending how well you finish it. You are to answer 25 questions within 90 seconds. Questions are randomly chosen from group 1 to the group that you have just played. Group 1 is the easiest group and each correct answer gets one point. The higher the group number is, the more the point is. There are two question types. You are to answer either the country/region name when you are given the flag, or on the contrary. The number of straight correct answers is highly weighted in point calculation. <br/><br/>(Country Profile) <br/>When you tap a flag, you will be informed of the following information about it: Country/Region, Continent, Capital, Population, GDP per capita, and actual location on the world map. Thus, by playing this game, you will not only become an expert of flags, but also you will know much detailed information about each country/region. <br/><br/>(Scores) <br/>Three types of scores will be reported to the leaderboards in Game Center. They are Best time, total numbers of Completion and Quiz Scores. In addition, achievements have five levels. <br/><br/>(Related Apps) <br/>While related Zhongyuan Mahjong (Solitaire) and ABC solitaire are very challenging and enjoyable games, Flag Solitaire is designed to let you learn something while you enjoy the game.", "metacritic": null, "released": "2014-11-27", "tba": false, "updated": "2019-10-22T14:39:16", "background_image": "https://media.rawg.io/media/screenshots/2f3/2f3d15045160bd5d940620d91e3a76a3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 133, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS"], "developers": ["Shen Zhongyuan"], "genres": ["Board Games", "Puzzle"], "publishers": ["ZHONGYUAN SHEN"], "esrb_rating": null}