{"id": 21791, "slug": "wildlife-park-2-farm-world", "name": "Wildlife Park 2 - Farm World", "name_original": "Wildlife Park 2 - Farm World", "description": "Farm World is the famous farm-extension of the successful and award-winning Wildlife Park 2.<br/>Wildlife Park 2 - Farm World will completely satisfy animal lovers and farm fans: an incomparable natural experience – right in your living room! Become a zoo, respectively farm manager and take good care of your animal charges!<br/>In Farm World, players can build their own farm and have to take care of their farm animals such as cows, pigs, sheep and chickens. The breeding of many new animals is a major challenge. At the same time the production of food is important: The fruit and vegetable gardens should always be well maintained. These farm workers and harvesters can be hired to assist the players best efforts.<br/><br/>Farm World is fully independent, Wildlife Park 2 IS NOT required - but works together!<br/><br/>Farm World offers: <br/>• 10 farm animals: chicken, romney sheep, pig, fox, donkey, german shepard, Brown Swiss Cow, Holstein, Cow, Red Holstein Cow, texan longhorn<br/>• 8 exciting missions <br/>• 20 freeplay maps in different territories all around the world, e.g. Australia, Germany and Northamerica.<br/><br/><strong>• Including Wildlife Park 2`s comprehensive sandboxmode with a bunch of decorations, plants, service-items, pen-items, terraforming, ways, grounds, fences, etc.</strong>", "metacritic": null, "released": "2014-07-17", "tba": false, "updated": "2019-08-28T22:07:51", "background_image": "https://media.rawg.io/media/screenshots/6cc/6cc409eb8c700b36940c7bcc55a207b4.jpg", "website": "http://b-alive.de/joomla/index.php?option=com_content&amp;task=view&amp;id=16&amp;Itemid=67&amp;lang=english", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 11}, "playtime": 3, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 394, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["b-Alive"], "genres": ["Strategy", "Simulation", "Casual", "Indie"], "publishers": ["b-alive"], "esrb_rating": null}