{"id": 218055, "slug": "backgammon-online-3", "name": "Backgammon Online 3", "name_original": "Backgammon Online 3", "description": "PLEASE NOTE that the default backgammon server of this app, FIBS.com, is currently not reachable. We are investigating this. In the meantime, you can connect via Game Center or ti-ga.com (use expert mode in the FIBS settings to change the server address).<br/><br/>• Also available for OS X in the Mac App Store<br/><br/>Backgammon Online was the first internet-capable backgammon app in the App Store and Mac App Store. Play anywhere at any time against real people.<br/><br/>You can choose between several servers to play on: <br/><br/>• the vivid First Internet Backgammon Server (FIBS, see fibs.com) or the similar TigerGammon (see ti-ga.com)<br/>• or Game Center <br/><br/><br/>FEATURES<br/><br/>• On FIBS there are also very sophisticated bots of different playing strengths which are a serious challenge to even the most skilled Backgammon players <br/>• Creating a new FIBS account is just a matter of finding a suitable user name, no web-site visits or personal informations required <br/>• Automatic forced moves and bear-off <br/>• Integrated FIBS Chat and Game Center Text and Voice Chat <br/>• All aborted matches are automatically saved <br/>• Ratings for each player are based on match results and other factors, thus you can easily find a player with your playing ability. The same algorithm is used for both FIBS and Game Center accounts, thus it is easily compared <br/>• Finished matches can be saved in the MAT file format and later downloaded to your desktop computer using iTunes. The matches can then be analyzed using professional backgammon software<br/>• Tap or drag or multi-drag your tiles back and forth, using backgammon on a device has never felt so naturally<br/>• You can also play offline (use as an Backgammon Board)", "metacritic": null, "released": "2011-02-05", "tba": false, "updated": "2020-03-06T02:00:25", "background_image": "https://media.rawg.io/media/screenshots/991/99131b5407aab064396e3ea93e39be12.jpg", "website": "http://multimedia-go.de/bgonline", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 108, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["multimedia-go"], "genres": ["Board Games"], "publishers": ["Golde Bothmann"], "esrb_rating": null}