{"id": 21802, "slug": "quadle", "name": "Quadle", "name_original": "Quadle", "description": "<strong>Quadle is ready to puzzle your mind!</strong> <br/><br/>It's A brand new arcade puzzler from Gamesare Studios, Invoking the memory of classic arcade cabinet games but adding a new twist. Jump on the blocks as the titular character Quadle, changing the block colors till they are red. Once red they fall away. Eliminate all blocks on the screen to go to the next level. Be careful not to corner yourself into a situation where you can jump to the next block. <br/><br/>With three worlds and a initial offering of 96 levels there is plenty of arcade puzzle action to frustrate I mean to enjoy. Of course just when you think  you get the hang of it, Quadle is introduced to new suprises, like switch panels, spring beams, drop blocks and more. Can you get through all 96 levels? <br/><br/><br/><br/>For those of you wanting more punishment er I mean challenge, use the Steam Workshop level editor to design your own boards and share them with friends via Steam Workshop, and check out the puzzles they create!<strong>Features </strong><br/><br/><ul><li>96 levels of arcade puzzle action <br/></li><li>3 worlds featuring the amazing musical and artistic talents of Ilker Esen <br/></li><li>numerous puzzle challenges change through out, spring panels, teleports and shrinking bricks to name a few <br/></li><li>Full controller support <br/></li><li>Finish on special panel for bonus points <br/></li><li>Build your own levels with the editor and upload them to Steam Workshop<br/></li><li>Download other user created levels<br/></li><li>Guaranteed to frustrate I mean sorry, please you</li></ul><br/>#MadewithFusion", "metacritic": null, "released": "2015-07-23", "tba": false, "updated": "2019-10-22T14:30:32", "background_image": "https://media.rawg.io/media/screenshots/d67/d678864ed8c398874f3a921bb2c7492c.jpeg", "website": "http://www.Gamesare.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 4, "owned": 105, "toplay": 1, "dropped": 1}, "playtime": 1, "achievements_count": 6, "ratings_count": 1, "suggestions_count": 243, "game_series_count": 0, "reviews_count": 1, "platforms": ["Nintendo Switch", "iOS", "Android", "PC"], "developers": ["Gamesare", "Gamesare Studios"], "genres": ["Strategy", "Arcade", "Casual", "Puzzle"], "publishers": ["Clickteam", "Chris Carson"], "esrb_rating": null}