{"id": 2180, "slug": "knot", "name": "Knot", "name_original": "Knot", "description": "Have you ever heard about Chinese wood knots? If you’re not familiar with them, I’m sure you know the Magic Cube. We all went crazy handling the Magic Cube, and it was our source of inspiration for making Knot. <br/>\n<br/>\r\nKnot is a 3D mechanical puzzle game with realistic graphics that will fully immerse you into its world. Each puzzle is composed of blocks that are mechanically interlocked. Your mission is to find a way to solve it by moving and rotating the correct block in order to disassemble the puzzle. <br/>\n<br/>\r\nSome puzzles are easy while others are quite challenging. But don’t worry, we created the perfect atmosphere that will allow you to relax and complete your mission. You will need to be focused, because the more puzzles you solve, the harder it becomes to move a block. <br/>\n<br/>\r\nThese interlocking puzzles are composed of multiple materials including wood, copper, stone, etc. <br/>\n<br/>\r\nWe hope that you will enjoy the brain teasers as much as we did designing them. Don’t hesitate to leave us a comment or question. We will be happy to answer as much as we can.<br/>\n<br/>\r\n-- 40 unique brain teasers <br/>\r\n-- 20 unique materials<br/>\r\n-- Many achievements to unlock<br/>\r\n-- Gorgeous graphics", "metacritic": null, "released": "2016-07-19", "tba": false, "updated": "2019-08-28T22:15:47", "background_image": "https://media.rawg.io/media/screenshots/8d5/8d57e38428b5f9e916e313c032fd286e.jpg", "website": "https://www.facebook.com/Knot-1664035960563836/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 11, "beaten": 3}, "playtime": 3, "achievements_count": 36, "ratings_count": 2, "suggestions_count": 114, "game_series_count": 0, "reviews_count": 2, "platforms": ["PlayStation 4", "PC"], "developers": ["Warlock Arts", "Warlock"], "genres": ["Simulation", "Casual", "Indie", "Puzzle"], "publishers": ["Warlock Arts"], "esrb_rating": "Everyone 10+"}