{"id": 218147, "slug": "betrayal-at-house-soundboard", "name": "Betrayal at House Soundboard", "name_original": "Betrayal at House Soundboard", "description": "This soundboard sets the creepy tone for the thrilling board game Betrayal at House on the Hill!<br/><br/>** Widow's Walk expansion now available in-app for purchase! **<br/>30 new sounds for Widow's Walk, with an 80s horror vibe inspired by Stranger things!<br/><br/>Start off with eerie music that plays throughout the game. As you explore the haunted mansion, every Event, Item, and Omen has a unique sound effect that makes you feel like you're right in the middle of the house. You'll hear walls with heartbeats, creepy puppets, and men screaming on fire. You'll also hear sounds of weapons you discover or items that help you.<br/><br/>Once the Haunt starts, switch the music to Haunt mode with it's impending doom sound. Once you use this soundboard you'll never be able to play without it!<br/><br/>*************************************<br/>Instructions:<br/><br/>IMPORTANT: The sound must be on and volume up to use this soundboard. Your device cannot be on vibrate!<br/><br/>iPad:.<br/>Switch tabs on the bottom to view Items, Omens, or Events sounds.<br/>Background music, Haunt music, and turning off background music are handled in the Settings tab.<br/><br/>iPhone:<br/>Swipe up and down to scroll through the sounds on each tab.<br/>Background music, Haunt music, and turning off background music are handled in the Settings tab.<br/><br/>When you draw any card, tap the appropriate sound as you read the card out loud. More than one sound can be played at a time. Feel free to play with sounds that weren't drawn just for fun!", "metacritic": null, "released": "2014-04-04", "tba": false, "updated": "2019-10-22T14:19:46", "background_image": "https://media.rawg.io/media/screenshots/538/538f16fdc7ceb42dd57c04f67b15bf63_8tWQZ2l.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 58, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["RabidRogue"], "genres": ["Adventure", "Board Games"], "publishers": ["RabidRogue"], "esrb_rating": null}