{"id": 218156, "slug": "five-crowns-lite", "name": "Five Crowns Lite", "name_original": "Five Crowns Lite", "description": "Five Crowns is a turn-based card game that the whole family can play.  With this lite version, you can play 6 rounds of Five Crowns on a single device against other players in the same room or against the computer.  The lite version also includes a free trial of Wild Card Protection for up to 10 games.  The full version of the game is available in the App Store.  The full version adds the following features:  (1) play online games against friends and family or find new opponents from around the world, (2) access to online leaderboards tracking most wins and lowest score, (3) play full 11-round games, (4) access to in-app add-ons to assist in game play including Wild Card Protection, Ask AI for suggested moves and Game Log which reports every move in the game, (5) access to new features as the game is improved.  Feedback is always welcome and has helped shape the game.  I hope you enjoy!<br/><br/>The objective is to obtain the lowest number of points after playing all eleven hands of the game.<br/><br/>The game consists of two 55 card decks ranging from 3's to Kings of 5 suits.  There are an additional 6 Jokers in the deck.  In the first round, 3 cards are dealt to each player.  Each round the cards are reshuffled and an additional card is dealt to each player.  This continues until the last round.  In the lite version, the game ends after round 6 where each player has 8 cards in their hands.  In the full version, the game ends after round 11 where each player has 13 cards in their hands.<br/><br/>Each turn starts with either drawing a card from the deck or picking up the top card from the discard pile.  The turn is completed by discarding one card.  A player can only meld his/her books and/or runs when opening or after another player has opened.  When a player is able to open, the remaining players each have one last turn.  Each player will pick up a card, lay down a card and meld his/her books and/or runs to remove those cards from his/her hand.  The remaining cards count as points against him/her for this round.  The player who goes first in each round rotates.  Play continues until the eleventh hand when the Kings are wild.  The player with the lowest score wins.<br/><br/>Five Crowns is based on the card game by Set Enterprises, Inc.", "metacritic": null, "released": "2018-08-31", "tba": false, "updated": "2019-10-22T14:19:46", "background_image": "https://media.rawg.io/media/screenshots/028/028c12d5d09bac60b28687aa140fc37e_XtI9VaH.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 50, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Matt Gabriel"], "genres": ["Board Games", "Card"], "publishers": ["Matt Gabriel"], "esrb_rating": "Everyone 10+"}