{"id": 218174, "slug": "baduk-cap", "name": "Baduk Cap", "name_original": "Baduk Cap", "description": "Baduk Cap lets you capture positions on your wooden Go board and transfer them easily to the SGF file format with its built-in image recognition.<br/>Determine the winner and exact score of your game with the scoring function (this feature is an in-app purchase).<br/>As Baduk Cap supports corners of arbitrary size and recognizes them automatically, you can capture problems from books and export them to apps like EasyGo, that offer the spaced repetition system as a study tool.<br/>Live capture of your game, while it is being played, is also possible with automatic move recognition and automatic photos (this feature is an in-app purchase). Focus fully on the game, instead of spending time and concentration with recording it manually.<br/>Include game information like player names, ranks, captured stones, … and copy the SGF file to the clipboard, send it as an email, save it to Dropbox or export it to apps like EasyGo or SmartGo Kifu.<br/>Baduk Cap supports board sizes 9 x 9, 13 x 13 and 19 x 19.<br/><br/><br/>The following one-year subscriptions are available (Baduk Cap Pro):<br/>- Scoring: Determine the winner and exact result of the game (tap the result for an explanation of how it was calculated)<br/>- Game recording:  Live capture your game with automatic move recognition and automatic photos (includes all features of the Scoring subscription)<br/><br/>Each of the Baduk Cap Pro subscriptions also unlocks these features:<br/>- Siri shortcuts: Take a picture of your Go board with a voice command of your choice<br/>- Dark mode<br/><br/>The subscriptions do not renew automatically. After one year, if you want to continue using the unlocked features, you need to manually resubscribe.", "metacritic": null, "released": "2014-07-20", "tba": false, "updated": "2019-10-22T14:19:46", "background_image": "https://media.rawg.io/media/screenshots/bbf/bbf39012bd1a077aea8588f476d45ad3_d30QyAa.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 86, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Thomas Breitling"], "genres": ["Strategy", "Board Games"], "publishers": ["Thomas Breitling"], "esrb_rating": null}