{"id": 218266, "slug": "egyptian-senet-ancient-egypt-game-of-the-pharaoh-t", "name": "Egyptian Senet (Ancient Egypt Game Of The Pharaoh Tutankhamun-King Tut-Sa Ra)", "name_original": "Egyptian Senet (Ancient Egypt Game Of The Pharaoh Tutankhamun-King Tut-Sa Ra)", "description": "Don't Miss The Opportunity To Play The World's Oldest Board Game.<br/>Start your mysterious afterlife journey to pass through the underworld realm of Osiris.<br/><br/>The Favorite Pastime Of The Pharaoh Tutankhamun.<br/>The Artifact Of The World's Oldest Board Game Found In King Tut's Tomb, Beside The Golden Coffin &amp; Sarcophagus.<br/><br/>==== Awards ====<br/>◆ Nominated for Top 20 Apps in Mobily KSA Developers Award 2014.<br/>◆ Nominated for the World Summit Award 2013 in e-Entertainment &amp; Games from Egypt.<br/>◆ Silver Winner in 2013 W3 Awards.<br/>◆ 1st Place Winner Of Egypt e-Content Award 2013.<br/>◆ Winner Of Gaming Egypt Contest 2012.<br/><br/>After performing opening of the mouth ceremony on your mummy by Anubis, you start your afterlife journey protected by Eye of Horus(Wadjet) to pass through the underworld realm of Osiris, challenging an invisible adversary inside an Egyptian hidden tomb in The Valley of the Queens located near the better known Valley of the Kings, on the west bank of the Nile river across from Thebes (Luxor)<br/><br/>Senet is a board game from predynastic and ancient Egypt, it is the earliest known record of a backgammon , checkers and chess like games.<br/><br/>The oldest hieroglyph representing a Senet game dates to around 3500 BC.The full name of the game in Egyptian was meaning \"The game of passing\".<br/><br/>Games have been around for thousands of years, but none are older than the ancient game of Senet, invented by the Egyptians roughly 3500 or 5000 years ago. It is believed that this two-player board game originated as a popular form of recreation with both royalty and peasantry. But by the mid-13th century BC, Senet had evolved into a more religious ritual. Some depictions from this time period forward show the game being played not by two people, but rather as a deceased player competing against an invisible adversary, interpreted by some to symbolize the deceased players own soul.<br/><br/>The board has become a metaphor for the afterlife with pawns moving across the board just as a soul moves through layers of the netherworld after death. Reaching the final space and leaving the board is the goal of the game, just as reaching Horus and leaving the netherworld was the goal for the Egyptians after their death for attaining rebirth with the gods Isis &amp; Osiris, Sekhmet &amp; Bastet holding the Egyptian Ankh or the papyrus scepter.<br/><br/>The game board consists of 30 squares, arranged in 3 horizontal rows of 10. Pawns move from left to right through row 1, then drop down and move from right to left through row 2. Dropping down again, pawns move from left to right along row 3 and finally, off the board. The game uses the rules developed by Timothy Kendall in his 1978 work, Passing Through the Netherworld :The Meaning and Play of Senet, an Ancient Egyptian Funerary Game.<br/><br/>The game includes five special squares, governed by their own rules, each containing a hieroglyphic. Square 15 is the House of Rebirth; square 26 is the House of Beauty; square 27 is the House of Water: square 28 is the House of the Three Truths; square 29 is the House of Two Truths; and square 30, the last, is the House of Horus, the Egyptian falcon-god and lord of the sky.<br/><br/>Egyptian Senet is a challenging game that combines luck and strategy, features authentic photos of ancient Egyptian temples, plus artistically crafted graphics and animation of an ancient stone game board and pieces, set in an echoing, tomb-like chamber. Ritualistic music plus sound effects of stone pieces moving recreate the atmosphere of predynastic Egypt.The App's Icon shows the Egyptian Queen Nefertari playing Senet in her tomb, she was the great wife of the pharaoh Ramesses II (Ramses). Also many Egyptian Queens have a similar photos playing Senet such as Nefertiti the the great royal wife of Akhenaten,and the Queen Hatshepsut the wife of Thutmose II.<br/><br/>Recommended for everyone interested in Egyptology and Archeology<br/><br/>For More Info:<br/>Facebook Page: https://www.facebook.com/EgyptianSenet", "metacritic": null, "released": "2013-02-09", "tba": false, "updated": "2019-10-22T14:19:49", "background_image": "https://media.rawg.io/media/screenshots/015/015fdaa83ca8170b3dae7010145b31f2_TASPlbV.jpg", "website": "http://www.facebook.com/EgyptianSenet", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 248, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Mohammed Ezzat"], "genres": ["Board Games", "Puzzle"], "publishers": ["Mohammed Ezzat"], "esrb_rating": null}