{"id": 2183, "slug": "pixel-starships-8bit-star-ship-trek-mmorpg", "name": "Pixel Starships: 8Bit Star Ship Trek MMORPG", "name_original": "Pixel Starships: 8Bit Star Ship Trek MMORPG", "description": "Featured by Apple in Best New Games! From one of the most successful Mobile Game Kickstarter campaigns of the year comes Pixel Starships!<br/><br/><br/>Available exclusively for iPhone, iPad and Apple Watch.<br/><br/><br/>Pixel Starships is the world’s first total spaceship management game in an 8bit massive online universe. In Pixel Starships, you command every aspect of your ship from construction to battles in a single persistent world.<br/><br/><br/>Featured Reviews -<br/><br/>Touch Arcade - Pixel Starships tasks you with outfitting your very own ship with resource rooms, staff, and weapons. This looks Awesome!<br/><br/>MMGN - The graphics in this 8Bit indie game is the best we&amp;#39;ve seen in a retro style game for a long time<br/><br/>PocketTactics - I’m intrigued by the cutaway side-view of the starship with turbolifts and transporters at the ready <br/><br/>TechTimes - The World’s First 8-Bit Total Starship Management Game Hits The Online Universe<br/><br/>The Discovery Channel - A fully immersive starship captain experience.<br/><br/><br/>Key Features -<br/><br/>● Build Epic Starships of your own design.<br/>● Many races, aliens, factions to command and conquer.<br/>● Battle it out with other real players in a single massive online universe.<br/>● Manage diplomacy, recruitment, research, exploration!<br/>● Control ship&amp;#39;s power and limited resources. Discover epic weapons.<br/>● Build and deploy support ships to support your Starfleet.<br/>● Cross section full ship control and battles.<br/>● Explore planets, discover secrets of space.<br/>● Form alliances and battle with your friends to achieve victory!<br/>● Program situational AI commands to systems and crew allowing automatic combats and offline play.<br/><br/><br/>If you&amp;#39;re a fan of Star Wars and Star Trek; if you enjoy games like EVE, Clash of Clans, FTL, or Homeworld, you&amp;#39;ll love Pixel Starships!<br/><br/>Note -<br/><br/>Pixel Starships is totally free to play and is designed for perfect balance for all players. However, there are in-app items that can be purchased for real money to help speed up progress or offer cosmetic improvements. If you don&amp;#39;t want this feature, please disable in-app purchases in your device&amp;#39;s settings. <br/><br/>Note on Auto-Renewing Subscription - <br/><br/>Pixel Starships contains a optional Subscription Membership. Members receive extra missions, bonuses, and daily rewards. Membership content is regularly updated. <br/><br/>The Monthly Membership Subscription cost is USD $3.99 per month or a similarly adjusted currency price in your local region. Please refer to IAP menu or in app display for localised pricing. Payment will be charged to iTunes Account at confirmation of purchase. <br/><br/>The subscription is auto renewable and will renew monthly unless cancelled at least 24 hours prior to the end of the current period. Subscription can be cancelled via iTunes subscription manager. There is also a 7 day free trial for the membership; the free trial period is not transferrable and any remaining free time is cancelled if a paying subscription starts.<br/><br/>Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user&amp;#39;s Account Settings after purchase.<br/><br/>EULA: http://www.pixelstarships.com/eula<br/>Privacy Policy: http://www.pixelstarships.com/privacypolicy<br/><br/>As per Terms of Service and Privacy Policy, you must be at least 13 years of age to play or download Pixel Starships.", "metacritic": null, "released": "2016-01-06", "tba": false, "updated": "2019-10-22T14:28:00", "background_image": "https://media.rawg.io/media/screenshots/6b7/6b7ac084f9e790943d479e5c20b8f273.jpeg", "website": "http://www.pixelstarships.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 174, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Savy Soda"], "genres": ["RPG", "Strategy"], "publishers": ["Savy Soda"], "esrb_rating": "Everyone 10+"}