{"id": 218370, "slug": "dress-up-and-makeup-manicure-nail-salon-games-1", "name": "Dress Up and Makeup: Manicure - Nail Salon Games 1", "name_original": "Dress Up and Makeup: Manicure - Nail Salon Games 1", "description": "Dress Up and Makeup: Manicure™ is the best manicure app in the app store!!! Clip, buff, polish, decorate your nails and much more! Now with sparkling gems!!<br/>Manicure virtual nails like a real nail salon! Start by choosing a skin tone, trimming your nails with realistic nail clippers, and buffing to a squeaky high shine. Then choose from loads of polish color collections to custom paint gorgeous nails. Let your inner nail artist out! Choose from absolutely tons of sparkling rhinestones, crystals, diamonds, gemstones, stickers, decals, hearts, flowers, fruit and much much more to decorate your nails. Once you are happy with your creations, save your nails to your album, or share! <br/>Clean up with nail polish remover and start all over! <br/>From the creators of the original Dress Up and Makeup™ series of apps, Dress Up and Makeup: Manicure™ for iPhone, iPod touch, and iPad, takes makeover games to a whole new level! <br/><br/>FEATURES: <br/><br/>Seven different skintones <br/>Realistic nail clippings <br/>Realistic sounds <br/>Nail growth formula <br/>Nail buffer for shine <br/>Apply custom polish by painting <br/>Four nail polish color collections <br/>Nail art pens <br/>Ten gems/decals collections <br/>Save to camera roll/nail album<br/>Share on Facebook <br/>Email <br/><br/>Current Polish Collections Include: <br/><br/>Classic Reds, Pinks, Purples and Blues <br/>Pastel Polishes <br/>Grunge/Dark Colors <br/>Brights/Neon Glow <br/>Bonus: Pastel Nail Art Pens <br/>Nail Gloss, Gel nails, french manicure<br/>Glitter nail polishes<br/>Glitter nail art pens<br/>\"Real Glitter\" polishes<br/><br/>Current Gems Collections Include: <br/><br/>NEW ANIMATED Gems<br/>Animated Crystals and crystal rings<br/>Classic Rhinestones <br/>Luxury Crystals, Diamonds, and Gemstones <br/>Stickers and Decals <br/>Objects, including Hearts, Pearls, Flowers, and Fruit <br/>NEW Glitter Decals <br/>Music, notes<br/>Candy, cookies and sweets<br/>Rings - silver, gold, plastic, glitter<br/>Paint Splatters<br/>Mani/Pedi<br/>Flowers, hearts<br/>Water bubble tips with hearts, stars and more!!<br/>Gel nails and gel pens<br/>French manicure tips<br/>Wedding nails<br/>Princess nails<br/>Salon nails and spa nails<br/>Glow Nails<br/>Glitter Nails<br/>Nail Salon Art<br/>Unlock all gems for FREE!<br/><br/>Decorate your nails like a celebrity on the red carpet!! Hundreds of polish and gem styles for you to design your mani with! Everything from crystals to flowers, hearts, decals and more.<br/><br/>Free polishes and make up items added with every update! <br/><br/>Become a fan of Dress Up and Makeup: Manicure™ on Facebook <br/>http://www.facebook.com/MoreNailsApp <br/><br/>Download Dress Up and Makeup: Manicure™ for Free now to enjoy a sparkly new manicure any time!", "metacritic": null, "released": "2010-06-12", "tba": false, "updated": "2019-10-22T14:19:51", "background_image": "https://media.rawg.io/media/screenshots/4ac/4acffa5cc82802c4ad1c8b14956494c2.jpg", "website": "http://www.virtualitoy.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 114, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["virtualiToy"], "genres": ["RPG"], "publishers": ["virtualiToy"], "esrb_rating": null}