{"id": 218357, "slug": "word-cloud-world-explore-the-internet-mind", "name": "Word Cloud World: Explore the Internet Mind", "name_original": "Word Cloud World: Explore the Internet Mind", "description": "Explore the funny, dirty, witty, inspirational, cynical minds of thousands of people in this NEVER DONE BEFORE  social experiment/pseudo-multiplayer/message board/public toilet wall in space GAME.<br/><br/>Word Cloud World Internet Mind (application) is an improved version of the original Word Cloud World that you can accsess and edit on http://word-cloud-world.com .<br/><br/>What you need to know about the original:<br/>1. Messages are COMEPLETELY ANONYMOUS, we have no data on anything except what you write.<br/>2. Messages are seen by EVERYONE who finds them.<br/>2. We censor NOTHING, whatever is written will stay there, forever.<br/><br/>Users used Word Cloud World to write their life moto, message someone, hide from NSA, shared their love, advertised their projects, youtube channels, steam, psn accounts, break the records in the travel distance,left messages for themselves, created secret anti spamm cities. Pretty much emptied their souls in our space.<br/><br/>We also added some bonuses the website doesn't have! You can increase your ship's speed to 4 times the original which provides you faster traveling around the chaotic space of Word Cloud World. You can even teleport to coordinates which allows you to explore the edges of space!<br/><br/>Like the game and feel free to send your screenshots, love, hate and suggestions on <br/>https://www.facebook.com/WordCloudWorld?ref=hl<br/><br/>Like our little game dev team on <br/>https://www.facebook.com/DayGames?ref=hl", "metacritic": null, "released": "2013-11-27", "tba": false, "updated": "2019-07-30T03:35:59", "background_image": "https://media.rawg.io/media/screenshots/c62/c6223d23f94049282b47f26765755ed8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 55, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Boris Mikic"], "genres": ["Arcade", "Casual"], "publishers": ["Boris Mikic"], "esrb_rating": "Teen"}