{"id": 218426, "slug": "space-assault-galaxy-saga", "name": "Space Assault - Galaxy Saga", "name_original": "Space Assault - Galaxy Saga", "description": "Space Assault is a great shoot'em up among space games. It’s full of alien invaders and continuous battle for Earth. This alien shooter, designed under the influence of legendary games such as PHOENIX, Galaga or Space Invaders, won’t allow you to put down your phone, while your fingers will be shooting all the time.<br/><br/>The game has been designed in the old retro style. Hordes of aliens, who want to destroy Earth, are approaching from deep space. Go on board your spacecraft and fire at the enemy. There are six planets of the solar system, which have been taken over by the aliens. Watch out as the enemy’s extremely dangerous. Collect crystals and upgrade your spacecraft by purchasing better weapons. During the game, you’ll encounter additional surprises and mini games such as shooting at enemies and saving your spacecraft, or arranging memory cards. Steer clear of asteroids, fight with bosses and perhaps you’ll be able to find an ancient spacecraft in this alien shooter game.<br/><br/>Space Assault is a solid and striking space game filled with terror. Flying a spacecraft is not easy; it’ll require long hours of practice to get to the extremely dangerous boss, which is the \"mother ship\" on Neptune.<br/><br/>Each planet’s different; you’ll encounter different enemies whose actions vary from the one another. You'll also find elements typical for Space Invaders or Galaga.<br/><br/>Turn the engines on and take off. The fate of Earth is in your hands.", "metacritic": null, "released": "2017-04-28", "tba": false, "updated": "2019-10-22T14:19:52", "background_image": "https://media.rawg.io/media/screenshots/239/2398d46b6debf360cd57cdd251221bb9.jpg", "website": "http://kiko.cat/assault", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 249, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Cezary Tomczak"], "genres": ["Action", "Arcade", "Casual"], "publishers": ["Cezary Tomczak"], "esrb_rating": null}