{"id": 21849, "slug": "ultimate-chess-learn-play-and-friends-online", "name": "Ultimate Chess - Learn, Play and Friends Online", "name_original": "Ultimate Chess - Learn, Play and Friends Online", "description": "Mastersoft Chess has one of the World's best Desktop PC chess engines crammed inside! This engine finished 4th in the World Microcomputer Chess Championships and is not available in any other iPhone chess game. Designed by chess champions to play like a human opponent, Mastersoft Chess will take you from Novice to Grandmaster level! Features stunning high resolution sets by renowned Chess designers.<br/><br/>Easy to play but difficult to beat, this is pick up and play chess at its best!<br/><br/><br/>The #1 Best Selling Chess App for iOS*<br/><br/><br/>This is the Ad free version with an additional 100Mb of retina artwork and features.<br/><br/><br/>AWARDS<br/><br/>Strategy Game of the Year<br/>Smartphone Magazine runner up.<br/><br/>Various levels, board styles and breathtaking Retina Display chess sets combine with an outstanding World beating chess engine to offer you a great playing experience and an ever increasing challenge. <br/><br/>Whether you're just starting out or else a seasoned pro, Mastersoft Chess has something for you!<br/><br/><br/>BEGINNERS<br/><br/>Hint facility. <br/>Start off at a very low ELO and work your way up over 100 levels, each of which plays differently.<br/>Built in coach to monitor your progress<br/>Training levels that dumb down your iPhone / iPod Touch. <br/>Take back a move if you change your mind! <br/>Your iPhone/iPod Touch checks that your moves are allowed.<br/>Simple intuitive uncluttered interface that lets you concentrate on your game.<br/>NB If you are new to Chess then please ensure that the coach is turned on in options and that the lowest difficulty level is selected.<br/><br/><br/>GRANDMASTERS<br/><br/>A unique engine unlike any other - plays interesting and sometimes quite aggressive chess.<br/>ELO to around 3000+. There are very few players in the World that can play at this level.<br/>Designed to play like a human opponent -  right up to Grandmaster level!<br/>Huge opening book. <br/>100% Full Chess rules including enpassant, castling etc. <br/>Thought analysis (main line, depth and score). <br/>Setup position (including castling rights, enpassant and side to move) <br/>Move forward / backward to any point in the current game. <br/>Includes Standard Chess Book Sets in addition to the realistic ones.<br/><br/><br/>OTHER FEATURES<br/><br/>Huge collection of stunning high resolution chess sets in both 2D and 3D. Makes the most of Retina Display!<br/>Boards constructed from the real thing - Oak, Ash, Marble, Slate and more! <br/>Save and load games.  <br/>Realistic sound effects. <br/>Adjustable piece movement animation. <br/>Autosaving of your current game.<br/>Great for novices but will grow with you and still offer a challenge at Championship level.<br/>Universal App. Play on your iPod, iPhone and iPad. No additional purchase necessary.<br/>Great value!<br/><br/><br/>*Source: US App Store 2011.", "metacritic": null, "released": "2009-09-24", "tba": false, "updated": "2019-10-22T14:30:30", "background_image": "https://media.rawg.io/media/screenshots/61e/61e61134536f1319393261a5bd7bc75b.jpeg", "website": "http://www.mastersoftmobilesolutions.com/supportbb3/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 115, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Mastersoft"], "genres": ["Strategy", "Board Games"], "publishers": ["Mastersoft"], "esrb_rating": "Everyone 10+"}