{"id": 218422, "slug": "american-diesel-trains", "name": "American Diesel Trains", "name_original": "American Diesel Trains", "description": "Today is the day when your grandfather, an experienced Yardmaster, has retired and entrusted his heritage to your care – the SWV company in charge of the Bluefield Yard in West Virginia. From now on, you’ll be running a real Rail Yard and working for the benefit of the United States. Work hard and strenuously, and develop the company by taking over other rail yards and buying engines.<br/><br/>If you’re fascinated with railways and diesel engines, this game’s a perfect choice for you. During the game, you’ll be facing the tasks actual yardmasters and engineers, who travel thousands of miles in legendary switchers and road switchers, need to do every day. This is a great treat for all enthusiasts of railway mock-ups, which allows players to collect various types of engines and expand their rail yard.<br/><br/>It’s a typical idle clicker in the world of miniature train replicas of actual engines that used to be utilized or are still operational in the United States. Each engine has its specific characteristics; they are activated and controlled differently. There's a series of missions ahead of you. Switching operations, transporting freight wagons and passenger cars, etc. You’ll be sitting inside the most famous and legendary engines such as GTEL Big Blows, Centennial DD40X or Baldwin Sharknose RF 16.<br/><br/>Return to the world of your childhood where you used to play with miniature trains on a railway mock-up.", "metacritic": null, "released": "2018-01-05", "tba": false, "updated": "2019-10-22T14:19:51", "background_image": "https://media.rawg.io/media/screenshots/410/4104cee377f32cb631cc9a2a616bc6fc_OCEkTXF.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 198, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Cezary Tomczak"], "genres": ["Strategy", "Simulation"], "publishers": ["Cezary Tomczak"], "esrb_rating": null}