{"id": 218575, "slug": "can-you-escape-from-the-old-zombie-house", "name": "Can You Escape From The Old Zombie House?", "name_original": "Can You Escape From The Old Zombie House?", "description": "Friends do you like taking up challenges in your life? Have you ever been in a mostly challenging situations ever before? If no and you like to be in one then here is your chance to be in the mostly challenging game in your life. All you need to do is solve puzzles.<br/><br/>Welcome to Old Zombie House Escape - a cool escape game!<br/><br/>Do you think you have the skills with Old Zombie House Escape - a cool escape game?<br/><br/>Old Zombie House Escape is a scary new point and click escape game! Have loads of fun as you escape out of this crazy place before you absolutely lose it!<br/><br/>In this Escape Game, You are trapped inside a OLD ZOMBIE HOUSE, You will have more excitement in playing this point and click type escape game.you need to solve puzzles and for that you need to look for clue and hints and use them in a proper way to escape from the zombie House. Complete this task successfully then we will be back soon with your new task of escape game. Good luck,have fun!<br/><br/><br/>You went looking for gold in this place. But sadly, there wasn’t any, and to top it all off, the place is actually much darker than you’d expect! The place was crawling with zombies and the bad thing is, you have no idea which way is the exit. Oh gosh! This ain’t good at all!<br/><br/>Find a way out of this place and do not get bitten! Who knows what might happen if you do! Good luck.<br/><br/><br/>Game features:<br/><br/>• Genuine story!<br/>• Innovative puzzles!<br/>• Stunning graphics!<br/>• Realistic atmosphere!<br/>• Tricky and challenging puzzles!<br/>• Gorgeous graphics !<br/>• No signup's required, just download and install!<br/><br/><br/>E-MAIL<br/><br/>• info@bamvd.com<br/><br/>HOMEPAGE<br/><br/>• http://www.bamvd.com/<br/><br/>FACEBOOK<br/><br/>• https://www.facebook.com/canyouescapegames/<br/><br/>Enjoy this fun adventure escape game!", "metacritic": null, "released": "2017-06-30", "tba": false, "updated": "2019-08-09T06:51:12", "background_image": "https://media.rawg.io/media/screenshots/3b9/3b913812114b8805b5c264b339707540.jpg", "website": "http://www.bamvd.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 186, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Xiling Gong"], "genres": ["Adventure", "Puzzle"], "publishers": ["Xiling Gong"], "esrb_rating": "Everyone 10+"}