{"id": 21856, "slug": "distraint-pocket-pixel-horror", "name": "DISTRAINT: Pocket Pixel Horror", "name_original": "DISTRAINT: Pocket Pixel Horror", "description": "<p>DISTRAINT: Pocket Pixel Horror is a 2D psychological horror adventure game.<br />\nDISTRAINT was originally developed for PC and released on Steam 2015.<br />\nIn DISTRAINT: Pocket Pixel Horror you step into the shoes of an ambitious young man named Price.<br />\nIn order to forge a partnership from a famous company, Price seizes a property of an elderly woman.<br />\nIn that very moment he finds out the price of his humanity.<br />\nThis is his story and the tale of his regrets...</p>\n<hr />\n<p>FEATURES<br />\nDISTRAINT: Pocket Pixel Horror is a horror story. It is dark and grim but also has its share of dark humor.<br />\nThe story progresses quickly which allows for several settings and scenarios.<br />\nYour journey will last around two hours!<br />\nThe gameplay is simple but effective: You move left and right and solve puzzles to progress through the story.<br />\n<em> Side scrolling 2D with unique, hand drawn graphics<br />\n</em> Atmospheric music and sound design<br />\n<em> Minimalist interface so your focus never wavers from the experience<br />\n</em> Delve into a unique story full of intriguing twists<br />\n* Refined controls - Super easy to play on mobile devices</p>\n<hr />\n<p>SO MANY GAMES OUT THERE, WHY SHOULD I PLAY DISTRAINT?<br />\nRight, so you&#39;re thinking if you would enjoy this little horror story? What makes DISTRAINT: Pocket Pixel Horror different than other horror games out there?<br />\nThat&#39;s a good question, I&#39;d love to tell you more about the game and its atmosphere!<br />\nThis is not your typical modern horror game, jump scares and loud noises? Nope! Other horror games might rely solely on those but not DISTRAINT: Pocket Pixel Horror.<br />\nDISTRAINT: Pocket Pixel Horror is a psychological horror game which means the horror comes from its oppressing atmosphere and story.<br />\nDISTRAINT: Pocket Pixel Horror is pretty subtle on its horror, it&#39;s suitable for both hardcore horror fans and people that haven&#39;t played too many horror games in the past.<br />\nThere are quite a few DISTRAINT (PC) reviews out there, check them out if you&#39;re still unsure whatever to buy this game.</p>\n<hr />\n<p>DIFFERENCES BETWEEN THE IOS AND PC VERSIONS<br />\nIn order to make the iOS port as playable as possible I needed to make some small changes to the game.<br />\nIn PC version you have a lantern, but porting this over to iOS brought too many problems. I decided to leave the lantern out from the iOS version and instead expand the environmental lighting. While doing so I also added more color which makes the iOS port more pretty to look at.<br />\nTo have as smooth experience as possible I capped the iOS version to 30 frames per second. However, DISTRAINT has a very little motion so this is barely even noticeable.</p>", "metacritic": null, "released": "2017-04-19", "tba": false, "updated": "2023-06-16T19:33:57", "background_image": "https://media.rawg.io/media/screenshots/f15/f1515ad8b27b898b1678bd3abd294025.jpeg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"beaten": 2, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 4, "suggestions_count": 85, "game_series_count": 0, "reviews_count": 4, "platforms": ["Android", "iOS"], "developers": ["Winterveil Studios Oy"], "genres": ["Adventure", "RPG"], "publishers": ["Winterveil Studios Oy"], "esrb_rating": "Mature"}