{"id": 218580, "slug": "car-garage-escape-games", "name": "Car Garage Escape Games", "name_original": "Car Garage Escape Games", "description": "Welcome to Car Garage Escape Games - a cool escape game!<br/><br/>Do you think you have the skills with Car Garage Escape Games - a cool escape game?<br/><br/>Can You Escape From Car Garage is an awesome new point and click garage escape game developed by Bamvd Games for an awesome escape adventure and daring fun!<br/><br/>Back in your garage warehouse, you had a lot of things to do, most especially on the car you’re suppose to fix and time is wasting as you laze around. Phew! This one is a tough nut, but you keep on fixing things in the capacity of your mind.<br/><br/>As you work, you noticed something standing in the garage door from the outside. You almost saw it but, it slammed the door shut! Locking you inside as whoever that was did! Man, who was that!? Oh when I get my hands on whoever was that, I swear I’m gonna…. But the question is, can you find a way to escape your garage? Good luck!<br/><br/><br/>Can You Escape From Car Garage is another point and click escape game developed by bamvd. Assume that you were repairing your car in the garage but suddenly somebody closed the door from outside. You are now stuck inside the garage and wondering how to get out of the garage. You need to work out a plan if you want to escape from the garage. Collect objects and use them to solve puzzles and escape from the garage. Have fun!<br/><br/>Game features:<br/><br/>• Genuine story!<br/>• Innovative puzzles!<br/>• Stunning graphics!<br/>• Realistic atmosphere!<br/>• Tricky and challenging puzzles!<br/>• Gorgeous graphics !<br/>• No signup's required, just download and install!<br/><br/><br/>E-MAIL<br/>• info@bamvd.com<br/><br/>HOMEPAGE<br/>• http://www.bamvd.com/<br/><br/>FACEBOOK<br/>• https://www.facebook.com/canyouescapegames/<br/><br/>Enjoy this fun adventure escape game", "metacritic": null, "released": "2017-07-23", "tba": false, "updated": "2019-08-09T06:50:54", "background_image": "https://media.rawg.io/media/screenshots/e4e/e4e962bddedcb649cc7b506f91d0dfec.jpg", "website": "http://www.bamvd.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 167, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Xiling Gong"], "genres": ["Adventure", "Puzzle"], "publishers": ["Xiling Gong"], "esrb_rating": "Everyone 10+"}