{"id": 218655, "slug": "superhot-ninja-fighting-tiger-3d", "name": "Superhot Ninja Fighting Tiger 3D", "name_original": "Superhot Ninja Fighting Tiger 3D", "description": "Welcome to the greatest superhot Fighting Tournament ever! Challenge interesting crystal creatures and have the most unusual battle ever with Superhot Ninja Fighting Tiger 3D!<br/>Beat these ordinary human-like creatures and become the absolute champion of this interesting place! They all look like simple and ordinary harmless superhot people, but they want to kick your spirit out of your body! They use such fighting styles as Taekwondo, Muay Thai, Kung Fu, Boxing and even WWE, they are slim, mighty and angry! Explore various kinds of rings, give a dare to one of these colorful crystal human beings and have fun!<br/>Do your best and hold your ground as long as possible! Find out the information about these cruel fighters’ skills and knock them down! Your mission is clear – just lay them all down with your final blow, step over their dead bodies and you’ll find yourself at the top of the tournament list! Every blow brings you near the shattering victory! Join the team of fantastic fighters with Superhot Ninja Fighting Tiger 3D!<br/>Earn points for each successfully done mission and upgrade your speed, power and accuracy or unlock new blows and fighting style! Check five game modes – regular fighting mode; VS mode, where you should fight your enemies face to face; survival mode, where you should stay alive at the ring as long as you can; stair mode, where you should become the first in the tournament list; and training mode, where you may check all your blows and super strikes!<br/>Start your career of the best superhot fighter ever in this funny world! Defeat all your opponents! Kick your enemies’ spirit out of their body and become the real champion of this wonderful tournament!<br/>Superhot Ninja Fighting Tiger 3D features:<br/>•\tUltimate fighting game <br/>•\tInteresting fighting styles and super blows<br/>•\tCheck five game modes<br/>•\tSimple and intuitive controls<br/>Unleash your superhot inner fury and become a real champion of Superhot Ninja Fighting Tiger 3D!", "metacritic": null, "released": "2017-03-19", "tba": false, "updated": "2019-10-22T13:56:59", "background_image": "https://media.rawg.io/media/screenshots/223/22340caccbc1bbd19b11357a8f6f313f_J8lJT3D.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 98, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Games Banner Network"], "genres": ["Action"], "publishers": ["Geimz Banner Netvork, OOO"], "esrb_rating": null}