{"id": 218676, "slug": "wild-eagle-bird-survival-simulator-3d", "name": "Wild Eagle: Bird Survival Simulator 3D", "name_original": "Wild Eagle: Bird Survival Simulator 3D", "description": "Explore the sky as bird with Wild Eagle: Bird Survival Simulator 3D! Be a wild eagle, hunt for animals and explore wilderness flying around your territory!<br/><br/>Live a life of an eagle - a large bird of prey! Fly over the sky, hunting animals and trying to survive with this simulator in 3D! Explore wilderness as a bird, meet other wild eagles – start your own flock of eagles or battle against them!<br/><br/>Fly in the sky and feel like a powerful predator – wild Eagle! Hunt animals to survive and explore wilderness as a bird! Meet other wild falcons to join your flock, battle against other birds and predators and hunt smaller animals to survive with this eagle simulator in 3D! Maintain health, hunger and energy rate to set up a flock of eagles! Show your power to the whole wild forest with Wild Eagle: Bird Survival Simulator 3D game!<br/><br/>Hunt, chase and fight your prey with Wild Eagle: Bird Survival Simulator 3D – great game for those who loves animal simulators! Battle against other birds or recruit eagles to your flock! Fly the sky, hunt a prey to survive and enjoy the life of an eagle with this bird simulator!<br/><br/>Wild Eagle: Bird Survival Simulator 3D features:<br/><br/>- Great bird survival simulator<br/>- Level up your wild eagle - fly, chase animals, hunt and survive<br/>- Battle against other wild animals<br/>- Explore wilderness<br/>- Amazing 3D graphics and forest views<br/><br/>Try this bird simulator to fly in the sky being the powerful bird predator – Wild Eagle!<br/><br/>Amazing 3D game for everyone who loves bird and animal simulators! Try Wild Eagle: Bird Survival Simulator 3D and live the life of an eagle! Set up your own bird flock, hunt a prey, battle against other wild animals and have fun!", "metacritic": null, "released": "2015-10-03", "tba": false, "updated": "2019-10-22T14:19:55", "background_image": "https://media.rawg.io/media/screenshots/db1/db1482d45e1c3319cd47a5c104ba38d3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 140, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Games Banner Network"], "genres": ["Simulation"], "publishers": ["Geimz Banner Netvork, OOO"], "esrb_rating": null}