{"id": 218631, "slug": "jet-ski-boat-racing-3d", "name": "Jet Ski Boat Racing 3D", "name_original": "Jet Ski Boat Racing 3D", "description": "Be ready for ultimate motor boat racing! Take the challenge and ride powerful hydroplane boat, jump, whirl and rush across the water with the sea breeze and become a champion! <br/><br/>Be ready for great water racing experience! Choose the motor boat, earn coins and improve it or buy a new one! Jump over obstacles, try different springboards to achieve more bonus points and come first to win this boat race!<br/><br/>Explore the treks and find all hidden secrets and power-ups. Use your trek knowledge to short you way and become the winner of ride! Unlock new treks to improve your driving skills and earn more coins! Improve your motor boat with new investment – it would help you to control your motor boat better or to raise up your boat’s speed!<br/><br/>Feel yourself like a real boat racer! Try different game modes – do your best playing freeride mode become an racing champion at Tournament mode! Avoid accidents and collect stars to get more coins, use all of your riding skills and become a best racer! Do your best as a pro racer with Jet Ski Boat Racing – amazing hydroplane boat simulator for all racing games’ lovers!<br/>This time your goal is not to participate in usual car racing challenge, but to prove your worth as a hydroplane boat rider with this unusual 3D driving simulator!<br/><br/>Ride speed water motorcycles and feel real extreme taking part in boat driving challenge with Jet Ski Boat Racing!<br/><br/>Jet Ski Boat Racing features:<br/><br/>- Wide range of boat upgrades – improve stability of your boat on water surface, or just raise up it's speed<br/>- Different game modes - participate in tournaments and contests maneuvering powerful hydroplane boat or -enjoy the freeride<br/>- Realistic physics of jumping and boat controls - keep your balance and don’t let your boat to roll upside down<br/><br/>Start your turbo boat racer career with Jet Ski Boat Racing! Ride, jump and whirl to get your riding skills to a new level with this water racing simulator! Download our app and become a pro boat racer just tapping on screen of your device", "metacritic": null, "released": "2016-04-18", "tba": false, "updated": "2019-10-22T13:52:51", "background_image": "https://media.rawg.io/media/screenshots/c61/c61f9570aeafc0687264bc118060292e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 174, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Games Banner Network"], "genres": ["Sports", "Racing"], "publishers": ["Geimz Banner Netvork, OOO"], "esrb_rating": "Everyone 10+"}