{"id": 218650, "slug": "london-subway-train-simulator-3d-2", "name": "London Subway Train Simulator 3D", "name_original": "London Subway Train Simulator 3D", "description": "Drive a subway train with London Subway Train Simulator game in 3D! Feel like a real subway driver! Drive your metro train through deep subway tunnels to transport passengers, stop at subway stations to collect each passenger, open wagon doors and let them in! Get points for every passenger and show your worth as London metro train driver! Try London Subway Train Simulator – great app for those who loves railway and subway games!<br/>Work at London public transportation system as a machinist, explore subway tunnels, stop at each metro station and transport passengers with their cargo to the station they need! High driving level will let you become the best subway train driver! Just practice with London Subway Train Simulator 3D game – amazing train simulator for everyone! Maintain high speed, but avoid train crashes! Your goal is to carry passengers without damaging your vehicle! Great chance to explore deep underground playing this driving simulator in 3D! Could you keep the wheels in motion as locomotives speed to their various destination stations? Let’s try!<br/><br/>London Subway Train Simulator 3D features:<br/><br/>- Realistic subway train simulator in 3D<br/>- Detailed London subway tunnels and stations, animated passengers – it’s like a real metro!<br/>- Realistic machinist’s cabin with control panel<br/>- Modern upgrades for your train – bigger wagons, more space for cargo, comfortable sits for passengers and more!<br/><br/>Do you like public transport games? So hop in your driver’s cabin and start big railway adventure! Explore underground tunnels with dangerous stretches and numerous stations driving realistic subway train! Explore London metro being a subway machinist, transport passengers from one station to another and upgrade your driving skills! Arrive at the destination station, open wagon doors and wait till the passengers come in. Enjoy London Subway Train Simulator – great 3D game for all train and metro lovers!<br/><br/>Have you ever dreamed to drive a locomotive? Explore London subway today!", "metacritic": null, "released": "2015-10-04", "tba": false, "updated": "2019-10-22T14:19:54", "background_image": "https://media.rawg.io/media/screenshots/8e9/8e92e21a12c3a47fdb1a3c74886905bc_Z6KxXWd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 98, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Games Banner Network"], "genres": ["Simulation"], "publishers": ["Geimz Banner Netvork, OOO"], "esrb_rating": "Everyone 10+"}