{"id": 218680, "slug": "cargo-truck-driving-simulator-3d", "name": "Cargo Truck Driving Simulator 3D", "name_original": "Cargo Truck Driving Simulator 3D", "description": "Complicated driving challenge full of extreme in Cargo Truck Simulator 3D!<br/><br/>Drive down busy roads, hill and mountains to deliver your cargo to the customer! Show your skills as an extreme pro trucker! Be accurate on dangerous road twists to deliver cargo undamaged. It’s not a kind of simple job to drive heavy transporter truck with a trailer carrying bulky cargo such as luggage, logs and cars. Feel like a real driver on duty and transport cargo to the customer exploring different areas. Face challenges – bad roads, traffic jams, hills and mountains and show your skills driving mega transporter trucks. Transport cargo, luggage and logs from one point to another to complete missions and feel like a pro trucker with Cargo Truck Simulator 3D!<br/><br/>Offroad terrain, extreme twists and different weather conditions will test your driving skills! Drive your transport truck carefully not to damage relief cargo! Roads and paths might be difficult to overcome, but your duty as a real trucker is to transport cargo right to the customer! Have you ever tried to drive huge transport truck with trailer? Try it with Cargo Truck Simulator 3D! Show your worth as a driver – dangerous roads, offroad paths and high hills to climb are waiting for you!<br/><br/>Drive a long base transport truck with a trailer! Great simulator for those who loves cars, high speed and dangerous roads! Gain great transporting experience and feel the extreme driving huge cargo truck! It’s even more dangerous than hill climbing! Try Cargo Truck Simulator 3D game!<br/><br/>Cargo Truck Simulator 3D features:<br/><br/>- Detailed cargo transporter truck<br/>- Offroad terrain, busy roads and high hills to drive on<br/>- Challenging delivery missions<br/>- Various cargo to transport – luggage, cars, logs and more<br/>- Extreme driving experience<br/><br/>Feel like a pro trucker delivering cargo with this extreme driving simulator in 3D! Thrill of driving on hills, mountains and steep paths, complete challenging delivery mission and enjoy Cargo Truck Simulator 3D game!<br/><br/>Driving a huge cargo transporter is fun!", "metacritic": null, "released": "2015-09-08", "tba": false, "updated": "2019-10-22T14:10:37", "background_image": "https://media.rawg.io/media/screenshots/98d/98d1fa90e312f77be7d5934943659ebe.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 124, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Games Banner Network"], "genres": ["Simulation", "Racing"], "publishers": ["Geimz Banner Netvork, OOO"], "esrb_rating": null}