{"id": 218619, "slug": "the-39-clues-madrigal-maze", "name": "The 39 Clues Madrigal Maze", "name_original": "The 39 Clues Madrigal Maze", "description": "WHAT THE EXPERTS SAY:<br/><br/>***Parent's Choice Silver Award<br/>“Educationally, mazes like these exercise logical thinking and think-fast problem solving. Plus, this app may prove to be the gateway for some kids to reading the series-and reading more worthwhile literature in general.” – Parents Choice Awards<br/><br/>~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~<br/><br/>Solve a mystery that spans the world and history! <br/><br/>Every family has its secrets and the Cahill family is searching for one that leads to unimaginable power.  To reveal it, the Cahills must embark on a dangerous hunt for 39 clues hidden around the world. The Cahills aren’t the only ones looking for the clues—a group called the Madrigals secretly has been in the hunt for the clues leading to ultimate power and world domination! <br/><br/>Do you have what it takes to become one of the Madrigals? To prove your worthiness, successfully navigate a series of 39 mazes.  Use your wits and strategy to solve the puzzles while discerning the quickest paths and evading guards in this adventure game. If you succeed, you become a member of the most secretive and powerful group on the hunt for the 39 clues and will receive exclusive access to a secret Encryption Key on www.the39clues.com!<br/><br/>FEATURES:<br/><br/>39 PUZZLES<br/>The mazes increase in difficulty with each passing level. Learn to evade guards, manage gates and switches and dodge deadly traps. <br/><br/>UNLOCK A SECRET MADRIGAL ENCRYPTION KEY<br/>Successfully navigate mazes to receive exclusive access to a secret Madrigral Encryption Key! Unlock the Key directly from your iPhone™ or iPod touch®!<br/><br/>THE 39 CLUES MYTHOLOGY<br/>Get an inside look at the Cahills! Discover which famous historical figures belong to the Janus, Lucian, Ekaterina and Tomas branches along with how they shaped the world we know today!<br/><br/>Developed by Orange Design", "metacritic": null, "released": "2009-09-16", "tba": false, "updated": "2019-10-22T14:19:54", "background_image": "https://media.rawg.io/media/screenshots/693/69356ba5b308a67eff65573d1c80c20e.jpg", "website": "http://www.the39clues.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 166, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Scholastic"], "genres": ["Puzzle"], "publishers": ["Scholastic Interactive"], "esrb_rating": "Everyone 10+"}