{"id": 218678, "slug": "crazy-dino-survival-simulator-3d", "name": "Crazy Dino Survival Simulator 3D", "name_original": "Crazy Dino Survival Simulator 3D", "description": "Are you ready to become crazy rampaging monster plunging city into a total mess? Show how crazy dinosaur could be playing this ultimate dino simulator in 3D! Smash cars, fire hydrants, people and anything else around!<br/><br/>Long time ago there was a time when whole world was inhabited by dinosaurs - powerful monsters crashing everything on their way! Go back to the Jurassic age with this dinosaur simulator in 3D! But now one of this crazy monsters – Tyrannosaurus was noticed right on the city streets! Explore modern city being a crazy dinosaur - make mess, wreck stuff, smash cars and plunge this city into a mayhem! The huge monster dino came from Jurassic forest and ready to show his destruction power! What is it like to be a crazy dinosaur? Explore city, hunt for citizens, destroy buildings and crash cars with Crazy Dino Survival Simulator 3D game!<br/><br/>Is it hard to survive in modern city being prehistoric Jurassic monster? Hit everything on your way being a Tyrannosaurus Rex and never let citizens get rid of you! Show your rampage power, but don’t forget to mind dino’s health indicator. If your health rate drops – there’s no chance to survive! Remember, crashing cars and falling debris may injure your Jurassic dinosaur! Be crazy enough to destroy this city completely! Feel the power of real Jurassic monster playing this dinosaur simulator in 3D and let citizens no chance to survive!<br/>Dive into the atmosphere of prehistorical mayhem - smash, crash and wreck! Plunge this city into a total mess turning citizens into panic! Huge monstrous dino is noticed on the city streets! Raise the power of destruction playing Crazy Dino Survival Simulator 3D! What could be funnier that destroying fences, smashing cars, wrecking lawns and other crazy things? Make a rampage to leave this city into a total mess!<br/><br/>Crazy Dino Survival Simulator 3D features:<br/><br/>- Control crazy Jurassic dino - crash, wreck, smash, hit and destroy<br/>- Mind dinosaur’s health rate – avoid smashing debris and crashing cars<br/>- Plunge city into a total mess<br/>- Ultimate dino survival simulator in 3D<br/><br/>Do you like dinos? Try yourself as the most powerful of them – huge Tyrannosaurus Rex! Feel like a crazy dino walking down the city streets! Let citizens no chance to survive crashing everything on your way! Be a monster Dino making total mayhem, make a mess, wreck stuff, hunt for people and have fun! What is it like to live the life of a crazy dino? Get to know with our amazing dinosaur simulator in 3D!", "metacritic": null, "released": "2015-12-17", "tba": false, "updated": "2019-10-22T14:09:27", "background_image": "https://media.rawg.io/media/screenshots/cf5/cf56948644cfaed4a7d9c3d71b211114.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 136, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Games Banner Network"], "genres": ["Simulation"], "publishers": ["Geimz Banner Netvork, OOO"], "esrb_rating": "Teen"}