{"id": 21861, "slug": "quantum-revenge", "name": "Quantum Revenge", "name_original": "Quantum Revenge", "description": "Quantum Revenge is an addictive shooter blasting action game threatening the existence of the rest of the human race. Featuring breathtaking 3D/2D animation, highly stylized aggressive aliens and robots inspired from the Manga / Anime universe like Robotek, Evangelion, Gundam, especially the 'Mecha' heritage genre with man controlled robot fighters.<br/><br/>■ Fight epic battles in space<br/>Fight agains large number of enemies and boss fight, in mesmerizing 3D, and animated 2D art and manga cartoon animation at full frame rate with AAA quality 3D effects and huge amounts of effects on screen. <br/>Five missions, with two bosses each, and an epic finale. <br/><br/>■ Pilot and Customize your Mecha:<br/>6 different robotic armours and player are available with different abilities and special attacks.<br/>Upgrade your armour with different modules like shield, drones and more.<br/><br/>■ Show off skills around the globe:<br/>With Game Centrer realtime leaderboard, see your progression against the player better ranked than you while you play.<br/><br/>Quantum Revenge also features:<br/><br/>• Game Center achievements.<br/>• Extensive touch control configurations : fixed or static, left handed, and more.<br/>• In-app purchase available for exchanging in game currency.<br/>• Share your best score and invite friends and get rewarded.<br/><br/>MacOSX 10.8 or later. Any Mac from 2012 or later recommended.", "metacritic": null, "released": "2017-04-02", "tba": false, "updated": "2019-10-22T14:39:51", "background_image": "https://media.rawg.io/media/screenshots/04c/04c267d72a45a892269d869a3617b6da.jpeg", "website": "https://www.realtech-vr.com/qr&ref=AppStore", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 339, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "macOS"], "developers": ["Realtech VR"], "genres": ["Action", "Arcade", "Casual"], "publishers": ["Stephane Denis"], "esrb_rating": "Teen"}