{"id": 218658, "slug": "5-nights-at-cube-pizzeria-3d-4", "name": "5 Nights at Cube Pizzeria 3D – 4", "name_original": "5 Nights at Cube Pizzeria 3D – 4", "description": "Welcome to the new part of the Cube nightmare!<br/>Become a night guard and spend another five nights at Cube pizzeria and meet bear robots! Are you afraid of cube bears? These robots were made to help in Cube pizzeria, but at night they might be unpredictable! Who else could be in this nightmare mines? Spend five nights at the pizzeria with animatronic robots! Try 5 Nights at Cube Pizzeria 3D – 4 game!<br/>5 Nights at Cube Pizzeria 3D – 4 is not about delicious pizza…only horrible monsters are here! Welcome to the creepy Cube nightmare and try to stay alive until the morning comes! Open or close the doors and switch on the light not to let cube bears, foxes and bunnies attack you! Use the flashlight to protect yourself from the attack! Let’s check, can you suppress a scream!<br/>Be careful! These robots learned to move inside the walls using ventilation system! Quickly, look onto this monitor! Yes, we have some problem into the vent! You should solve it before robot bear could creep to you from vents!<br/>You have a limited amount of electricity to use per night. When you run out of power for the night - all cameras and light are off and cube bears are able to move! Beware of cube bear robots walking in the pizzeria! Escape from your nightmare! Face cube robots with 5 Nights at Cube Pizzeria 3D – 4!<br/>5 Nights at Cube Pizzeria 3D – 4 features:<br/>3D cube world<br/>Cube animatronic robots<br/>Different camera views<br/>New danger – THEY could come through vent systems<br/>Whole pizzeria to explore<br/>Five nights to survive<br/>Don’t allow cube robot bears to get close! Protect yourself from sudden attack! Finish your work safe after five horrible nights with 5 Nights at Cube Pizzeria 3D – 4 game! Escape from your nightmare!", "metacritic": null, "released": "2016-09-07", "tba": false, "updated": "2019-10-22T14:19:55", "background_image": "https://media.rawg.io/media/screenshots/988/9887507849a7a3618d0a08dc86b2a71b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 79, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Games Banner Network"], "genres": ["Adventure"], "publishers": ["Geimz Banner Netvork, OOO"], "esrb_rating": null}