{"id": 218677, "slug": "ocean-whale-simulator-3d-free", "name": "Ocean Whale Simulator 3D Free", "name_original": "Ocean Whale Simulator 3D Free", "description": "Play as a whale exploring underwater world in this Ocean Whale Simulator 3D! Swim in the ocean, feed your whale with plankton and meet other ocean animals! Have fun with this Ocean Whale Simulator 3D!<br/><br/>Do you like games about sharks, dolphins, orcas etc? Enjoy our new survival simulator! Dive into the ocean and control a Whale - the biggest animal ever. Explore all the deep places in this endless wilderness! Survive in an underwater world full of dangers! Explore ocean, search for plankton and bring up your whale with this Ocean Whale Simulator 3D. Control a whale using finger pads swimming around the ocean, try survival mode and have fun with new Ocean Whale Simulator 3D. Don't let your whale get lost in the vast underwater!<br/><br/>Ocean Whale Simulator 3D features:<br/><br/>- Play as a wild cetacean exploring the ocean<br/>- Meet other ocean animals<br/>- Realistic survival game<br/>- Search for plankton and enjoy ocean views<br/>- Great underwater simulator!<br/><br/>Try this amazing Ocean Whale Simulator 3D and join the underwater life! Swim as a whale, avoid ocean predators, feed it with plankton to grow up! Do you like games about sharks, dolphins, orcas etc? Try this fish survival game! Enjoy being a wild cetacean with this realistic Ocean Whale Simulator 3D game!", "metacritic": null, "released": "2015-06-28", "tba": false, "updated": "2019-10-22T14:19:54", "background_image": "https://media.rawg.io/media/screenshots/0a7/0a71e31c4a5aef92d9c1b54637647afc_FkZVSY5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 105, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Games Banner Network"], "genres": ["Adventure", "Simulation"], "publishers": ["Geimz Banner Netvork, OOO"], "esrb_rating": "Teen"}