{"id": 218641, "slug": "pixel-island-survival-simulator-3d", "name": "Pixel Island Survival Simulator 3D", "name_original": "Pixel Island Survival Simulator 3D", "description": "Feel like a real survivor exploring an island made of cubes and blocks with Pixel Island Survival Simulator 3D game!<br/><br/>You are a pixel man awakening on strange cube island, vast and lonely, don’t remember who you are and how you got there! Where are you from? And how to get home? Escape from this strange badlands with Pixel Island Survival Simulator 3D! Test your survival skills spending time on desert island!<br/><br/>Explore the vast island made of blocks and enjoy picturesque views of cube ocean, forests and mountains being stranded on this mysterious island! The main goal is to get home alive! Use all your survival skill protecting your life from predators and other dangers hunting, battling against wild animals or exploring the island to find something useful! Complete different missions, find pixel survival tools or craft your own one! These useful items could help you to escape from this cube island! Salvage all the blocky tools and weapons that may help you to explore mysterious badlands! Hunt for wild animal, use your loot to cook dinners, but be careful! Blocky predators may hunt you instead! Enjoy picturesque pixel scenery and build cute blocky sandman relaxing on the seashore and trying to remember who you really are. Swim the ocean, walk around enjoying amazing blocky landscapes, but beware of predators attack and other dangers! Check Pixel Island Survival Simulator 3D – great 3D game for all ages!<br/><br/>Survive in this lost cube island full of secrets and dangers! Mind your pixel survivor indicators - health, energy and hunger. Never let it drops – you need to survive to escape from this cube badlands! Various survival tools such as cube axe or blocky fish rod would help you to stay alive! Find useful tools or craft your own ones! Hunt, start fishing or looking for plant food to find a meal for your blocky man to survive! Find treasures, salvage cube weapons and special tools exploring this mysterious blocky island! All of the things around may help you to get home! Try to enjoy your time on blocky island with Pixel Island Survival Simulator 3D! Get survival skills that would help you to stay alive on this mysterious blocky island!<br/><br/>Control pixel man with joystick, explore the island, hunt, fish and search for food! Swim in the picturesque cube ocean to find treasures, which would help you to survive! However, be careful! Peaceful blocky ocean might be full of predators ready to attack you! Find weapons to protect yourself from wild cube island’s predators or even battle against them! Use your exploration, battling and survival skills to stay alive at all cost with Pixel Island Survival Simulator 3D!<br/><br/>Find cube survival tools such as weapons, axe, fish rod, exploring this blocky island, and be ready for great survival adventure! Use your hunting, fishing and survival skill spending time on a cube island! Train a blocky man to hunt for wild cube predators, swim the ocean and explore everything around! Get home safe with Pixel Island Survival Simulator 3D game! Are you ready to survival adventure in unusual blocky environments? Even funnier than playing usual sandbos games - build, battle and survive!<br/><br/>Pixel Island Survival Simulator 3D features:<br/><br/>-\tSalvage blocky survival tools or craft new ones – hunt wild predators with an axe or go fishing using a cube fish rod<br/>-\tMind health, energy and fullness indicators of your pixel survivor<br/>-\tCube vast island with picturesque ocean, forests and mountains to explore<br/>-\tSwim, hunt, battle and explore - do anything you want to stay alive<br/>-\tGreat island survival simulator in 3D<br/><br/>Spend time in a mysterious place with Pixel Island Survival Simulator 3D! Upgrade your hunting, fishing, battling and exploring skill with this simulator and finally get home from this cube nightmare! Discover all secret places to find useful Items, treasures or even cube teleports, which could help you to escape! Thrive in this hostile environment – cube survival island, being a lost blocky man!", "metacritic": null, "released": "2015-11-07", "tba": false, "updated": "2019-10-22T14:19:54", "background_image": "https://media.rawg.io/media/screenshots/c70/c709bfe4fe40e21a10292c0cafbe4761.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 100, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Games Banner Network"], "genres": ["Adventure", "Simulation"], "publishers": ["Geimz Banner Netvork, OOO"], "esrb_rating": null}