{"id": 218633, "slug": "offroad-suv-driving-simulator-3d-free", "name": "Offroad SUV Driving Simulator 3D Free", "name_original": "Offroad SUV Driving Simulator 3D Free", "description": "Great offroad car simulator for those who loves driving games! Drive fast 4x4 SUV car to feel like an offroad driver with this simulator! Level up your skills performing stunts and finally get to the destination point in spite of difficulties! Avoid crashes wading through real Siberian taiga - explore washed out cross country roads and climb high hills and mountains!<br/><br/>Feel the extreme with Offroad SUV Driving Simulator! Explore offroad terrain being a sports car driver and run your 4x4 SUV as fast as possible with this car driving simulator!<br/><br/>Try furious extreme driving with this offroad car simulator! Offroad SUV Driving Simulator gives you a chance upgrade your driving skills manouevering huge 4x4 car, performing extreme stunts and even more! No traffic jams or car parking problems! Great driving game full of extreme! Feel like a real sports car driver controlling 4x4 SUV with Offroad SUV Driving Simulator!<br/><br/>Extreme offroad driving had never been so fun! Drive you 4x4 SUV fast, but always show your driver skills! Enjoy Offroad SUV Driving Simulator – amazing racing game for all ages!<br/><br/>Offroad SUV Driving Simulator features:<br/><br/>- Realistic car damage. Crash your car!<br/>- Huge offroad terrain for extreme fast driving - hills, mountains and cross country roads<br/>- Control your car with a steering wheel, accelerometer or arrows<br/>- Highly detailed offroad SUVs, trucks and other cars to drive<br/>- Realistic driving simulator<br/><br/>Play Offroad SUV Driving Simulator – show your worth as as extreme 4x4 car driver! Try different cars, trucks and SUVs and prove your worth as a driver wading through real Siberian taiga!", "metacritic": null, "released": "2015-09-01", "tba": false, "updated": "2019-10-22T14:32:28", "background_image": "https://media.rawg.io/media/screenshots/c41/c412cab7914c51277c0919ce7cab86cd_ySmFMFP.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 199, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Games Banner Network"], "genres": ["Simulation", "Racing"], "publishers": ["Geimz Banner Netvork, OOO"], "esrb_rating": null}