{"id": 218612, "slug": "hubble-bubbles", "name": "Hubble Bubbles", "name_original": "Hubble Bubbles", "description": "Welcome to the game of juggling Hubble on bouncing Bubbles.<br/><br/>Hubble Bubbles is a skill driven arcade game, featuring madly addictive (I swear it was an accident!), straight from space gameplay. <br/>Whenever you will find yourself saying \"Ok, now it's the last time!... \", remember it's not my fault! <br/><br/>Rules are simple:<br/>1. You TAP - Highlighted Bubble GOES UP. No magic here. TAP THE BUBBLE UP.<br/>2. TAP when Hubble (little spaceship) is above Bubble. They bounce, we fly.<br/>(tip). Try to spin Hubble, momentum gives Hubble extra speed! Science, you know.<br/>3. Fly as many Light Years as you can (translation: fly right very far).<br/><br/>Sound easy, right? Right :)<br/><br/>There's more! The game has even better dynamics, thanks to: <br/>- Amazing Restart Button Technology (You will hate me for that, no offence taken).<br/>- Time Warp Button. Which slows down the time. And it helps... or does quite opposite.<br/><br/>To keep You happier, the game is packed up with:<br/>- Leaderboards. How far can You fly? Join the competition!<br/>- Achievements - Yeah! We all love achievements!<br/>- Fun to play Secret Levels, featuring extra challenges like Nyan Cat jump record competition, or infinite Time Warp superpower.<br/>- \"I can do better next time\" feeling. Offcourse you can! :)<br/>- Out of this world, skill driven, physics based gameplay...<br/>- ... which makes each and every round a genuinely unique event.<br/><br/>Hubble Bubbles contains other games advertisements, if you'll feel tired playing, feel free to try one of the cool games from the ads!<br/><br/>!!! WARNING !!!<br/>OH MY GOD, IT'S IN APP PURCHASE<br/><br/>But hey, getting the Premium version will give You instant access to:<br/>- All Secret Levels (using retro bubble codes in main menu).<br/>- Restart Button without any interruptions!<br/>- Ad free game. Forever.<br/><br/>Have tons of fun playing!!", "metacritic": null, "released": "2014-06-16", "tba": false, "updated": "2019-07-30T11:13:05", "background_image": "https://media.rawg.io/media/screenshots/f4b/f4b735e56d8931bbfb3c5d8322e54ea1_cGsppL3.jpg", "website": "http://hamsteroncoke.com/press/sheet.php?p=hubble_bubbles", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 91, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Michal Pawlowski"], "genres": ["Action", "Arcade", "Casual"], "publishers": ["Michal Pawlowski"], "esrb_rating": null}