{"id": 218645, "slug": "cube-goat-simulator-3d", "name": "Cube Goat Simulator 3D", "name_original": "Cube Goat Simulator 3D", "description": "Start a mess in huge pixel city being a crazy cube goat! New goat simulator in cute blocky environments! You are in control of a crazy blokhead goat destroying  and crashing everything on your way. Explore cube world wrecking stuff, pushing and headbutting people and have fun! Dive into the atmosphere of total rampage and bring your goat to a monstrous one!<br/><br/>Be a blockhead goat, complete challenging missions or try survival mode! Feel like a crazy animal - destroy city streets and houses, annoy citizens, strew junk and do other crazy stuff! It’s like to play a craft game, but instead crafting, you destroy and wreck everything, and instead of being blockhead you are a goat with blockhead.<br/>Destroy fences, wreck lawns and other street stuff being a crazy pixel goat! Score as many bonuses as possible destroying everything around and plunging the Cube City into a total mess! Being blockheas is fun!<br/><br/>Cube Goat Simulator 3D features:<br/><br/>- Live the life of a blockhead goat crashing and wrecking everything around<br/>- Cute city in pixel environments. It’s all made of blocks!<br/>- Nice 3D graphics<br/><br/>Explore whole cubics world and plunge it into a total rampage! Wreck houses, destroy street stuff and strew litter being a crazy pixel goat with Cube Goat Simulator 3D – amazing animal simulator you’ll never forget!", "metacritic": null, "released": "2015-06-25", "tba": false, "updated": "2019-10-22T14:19:54", "background_image": "https://media.rawg.io/media/screenshots/f71/f71e5e82dcd9fcfa1afed7c02c16b930.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 82, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Games Banner Network"], "genres": ["Simulation"], "publishers": ["Geimz Banner Netvork, OOO"], "esrb_rating": null}