{"id": 218754, "slug": "puzzledom-brick", "name": "Puzzledom Brick", "name_original": "Puzzledom Brick", "description": "Experience the new high-speed, action-packed take on the iconic block puzzle game! It’s two-minute Brick Twist with exciting fresh features, including a stunning look and feel, rewarding Power-Ups to get as you climb levels, and intense Battles with friends. Best of all, it’s free.<br/><br/>The objective of the game is to manipulate these Tetriminos, by moving each one sideways (if the player feels the need) and rotating it by 90 degree units, with the aim of creating a horizontal line of ten units without gaps. When such a line is created, it disappears, and any block above the deleted line will fall. When a certain number of lines are cleared, the game enters a new level. As the game progresses, each level causes the Tetriminos to fall faster, and the game ends when the stack of Tetriminos reaches the top of the playing field and no new Tetriminos are able to enter. Some games also end after a finite number of levels or lines.<br/><br/>CONTROLS<br/><br/>Drag to move the Tetrimino ,<br/>Release to drop,<br/>Drag down to soft drop,<br/>Flick down to hard drop,<br/>Tap left to rotate counter clockwise,<br/>Tap right to rotate clockwise<br/><br/>MANY LEVELS<br/><br/>The game has up to 100 levels for you to conquer, with increasing difficulty level each level it is difficult to go to 100 level of the game without persistence and a superior brain.<br/><br/>CONQUER CITY<br/><br/>A group of levels will be located in a beautiful city that you will have to conquer, when enough stars of new cities will be unlocked", "metacritic": null, "released": "2017-09-14", "tba": false, "updated": "2019-10-22T14:19:55", "background_image": "https://media.rawg.io/media/screenshots/fa5/fa51d29e6b7dd59b31dd31509e10e656.jpg", "website": "http://sinhviendev.net", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 91, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Vu Anh"], "genres": ["Strategy", "Puzzle"], "publishers": ["Vu Anh"], "esrb_rating": "Everyone 10+"}