{"id": 218742, "slug": "vehicles-and-cars-kids-racing-car-racing-game-for-", "name": "Vehicles and Cars Kids Racing: car racing game for kids simple and fun ! FREE", "name_original": "Vehicles and Cars Kids Racing: car racing game for kids simple and fun ! FREE", "description": "A wonderful car racing game for kids with a stunning collection of vehicles !<br/>Does your kid love vehicle games and want to play with cars, motors, trucks ? This is the app for you!<br/><br/>Vehicles and Cars Kids Racing is an educational and entertaining game.<br/>It is a nice, simple, fun, and colorful game for toddlers and kids! Play with vehicles games !<br/>A lot of different levels and many cool vehicles to drive and keep your kid busy.<br/><br/>Easy to learn and to control:<br/>-select your vehicle: motorbike, sports car, SUV or monster truck !<br/>-choose the game mode: arcade or endless !<br/>-touch on the gas pedal to move your vehicle<br/>-try to reach the maximum speed, pick up the turbo ! Increase the speed of your car !<br/>-collect all diamonds and coins to unlock all the cars !<br/>-make a car ramp jump and dodge vehicles !<br/>-but be careful not to overturn the vehicle or you'll lose the game<br/>-drive up to the finish line!<br/>-drive these cars in the shortest time possible<br/>-when a game level is completed tap the arrow to change to the next level<br/><br/>Available for all screen resolutions and devices ( ipad / ipod / iphone )!<br/>Simple and intuitive, your baby will have lots of fun for hours !<br/><br/>This educational game will help your kid to improve reflexes, <br/>logical and cognitive skills, concentration and fine motor skills.<br/><br/>Features:<br/>- high quality game for toddlers and preschool kids from ages 0 to 12 years old with amazing vehicles !<br/>- Easy to use and control<br/>- fun for children of all ages, babies, preschoolers, school children and pre-teens, designed for preschool boys and girls<br/>- Simple for toddlers and babies with increasing difficulty<br/>- Toddlers develop their fine motor skills<br/>- Play with your child or let him play alone<br/>- use it to keep your baby or toddler occupied<br/>- a lot of vehicles in this fun racing games for kids<br/>- Simple: control your vehicle with just one finger<br/>- Fast and exciting car racing game<br/>- randomly generated cars games! this educational game will never get old!<br/><br/>Fun and enjoyable to learn and to play, this is a must have app!<br/>A lot of educational car race game for toddlers and young kids!!<br/>Your child will admire every kind of vehicle and will hear realistic sound effects!<br/><br/>Ideal for children but also fun for adults who want to play with their kids!<br/>Are you ready to drive on the road ? Try to get out of traffic ! Feel the asphalt on the streets !<br/>Cars Racing Game for Kids is a funny game which also helps your toddler improving his abilities with the toy cars.", "metacritic": null, "released": "2016-06-09", "tba": false, "updated": "2019-09-09T06:01:54", "background_image": "https://media.rawg.io/media/screenshots/f78/f78a2ceaaf8623914194ae94902f2cf1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 117, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Stefano Frassi"], "genres": ["Racing"], "publishers": ["Stefano Frassi"], "esrb_rating": null}