{"id": 218775, "slug": "super-cars-parking-3d-underground-drive-and-drift-", "name": "Super Cars Parking 3D - Underground Drive and Drift Simulator", "name_original": "Super Cars Parking 3D - Underground Drive and Drift Simulator", "description": "   Choose a car to start playing the game, then proceed from one level to the other, which include-<br/>   - Test Drive: here one has to slide across the road cones in a perfect order without hitting any of them.<br/>   - Getting Harder: Here one has to slide across the pillars of parking place.<br/>   - Mass- Start: This level asks you to park six different cars in flat time.<br/>   - Top Down: The target in this level is to go through twelve check points and that too without hitting any cones in a limited time.<br/>   - Parallel Park: Excel in parallel parking without colliding with other cars or cones.<br/>Inside Bonus: Have some fun while driving from inside the car.<br/><br/>   Obviously there are approaches that will cause hindrance in your way of parking the car. This is what makes the game more interesting. Avoid the approaching hindrances to successfully park your car and win a particular level. There being no limit as to how many times one can play, you can dependably mix up your choices and go on playing from one level to the other.<br/><br/>   You will find a large variety of car options in the game. The \"Supercars parking\" is being continuously developed and every single day one or the other new, exciting features are being added to it.  It's not difficult to discover fervour and undertaking without needing to leave your machine. You'll cherish the automobile parking game that has been painstakingly designed for the ultimate gamers. You'll get the best alternatives in mobile gaming with the Supercars parking.", "metacritic": null, "released": "2014-01-29", "tba": false, "updated": "2019-10-22T14:19:56", "background_image": "https://media.rawg.io/media/screenshots/191/1911e9ef784a34d729fffd2b915826b9.jpg", "website": "http://www.evertap.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 123, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["UniqueApps"], "genres": ["Sports", "Racing"], "publishers": ["Unique Apps"], "esrb_rating": null}