{"id": 218765, "slug": "mad-cop-2-police-car-race-and-drift", "name": "Mad Cop 2 - Police Car Race and Drift", "name_original": "Mad Cop 2 - Police Car Race and Drift", "description": "If you enjoyed or even heard about Mad Cop that offered a great chance to master drifting skills, now is the time to take the challenges of Mad Cop 2, a game that is way ahead of its predecessor, as it presents several more challenges, which is a great improvement to give it a more real life like feel.<br/><br/>   Now is your chance to take on challenges of not just drifting a car on an empty road:<br/> - Performing a crazy drift at a speed of 200+ km/hr;<br/> - Drifting dangerously close enough to people without hitting them;<br/> - Responsibility of finding illegal drifters and arresting them. <br/><br/>   And while doing all of these together, there is a master challenge of scoring enough points by performing all these tasks and completing required drift stunts at specific areas of checkpoint to score sufficient points overall.<br/><br/>   As you can see, the new version actually offers a lot more challenges than you faced before. It is no longer about trying stunts on empty tracks but about getting a complete real life feel of driving and drifting. <br/><br/>Key features: <br/><br/>- Realistic 3D Physics for cars movements <br/>- Different Tasks/Assignments<br/>- Perfect performance on all devices <br/>- Retina Support <br/>- No in-app purchases - just drift, earn points and unlock new levels! <br/><br/> So drive like a Mad Cop, drift your way through to glory!", "metacritic": null, "released": "2013-04-05", "tba": false, "updated": "2019-10-22T14:19:55", "background_image": "https://media.rawg.io/media/screenshots/272/2722caa340e056e829b9cd51889787ee.jpg", "website": "http://www.evertap.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 83, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["UniqueApps"], "genres": ["Sports", "Racing"], "publishers": ["Unique Apps"], "esrb_rating": null}