{"id": 218846, "slug": "deluxe-puzzle-bubble-shooter", "name": "Deluxe Puzzle Bubble Shooter", "name_original": "Deluxe Puzzle Bubble Shooter", "description": "Deluxe Puzzle Bubble Shooter Is one of the most classic free &amp; 3D puzzle bubble shooter game of birds with deluxe version, having both Puzzle and Arcade mode. New &amp; free 3D puzzle bubble buster game is in the market with the bang of cuteness and naughtiness of birds at its best free for IOS devices. If you are fun lover or a pet lover nothing could be more adorable then 3D bubble shooter experience of Deluxe Puzzle bubble shooter with my lil SPAZZY (pet squirrel).<br/>I’m sure you going to Love my 3D bubble shooter Bird teaser more after playing exciting Deluxe Puzzle Bubble Shooter for free.<br/><br/>Two interactive free game modes, <br/>\t•\t3D Endless mode for endless free supply of excitement in a 3D Deluxe Puzzle bubble shooter to make birds bath in pond water. <br/>\t•\t3D Puzzle mode is design to make your bubble shooter journey challenging one after another level. Some 3D puzzle levels are quite easy but some baby birds will give bubble shooter tough time while try to drowning in water.<br/>In each 3D Deluxe Puzzle Bubble Shooter level collect 3 crystal jacket birds and win the free 3D Deluxe Puzzle Bubble Shooter stars. Direct your shooter to shot maximum birds to earn 3 stars and highest rank among your friends on leader board and become 3D bird bubble shooter of era.<br/>Deluxe Puzzle Bubble Shooter has 400+ levels of free 3D game play. Fun and addictive levels with HD graphics exciting for people of all age. So download Deluxe Puzzle Bubble Shooter for free on your IOS app and be a part of fun.<br/>Features:<br/>\t•\tFree Intuitive Puzzle bubble game play<br/>\t•\tAdorable shooter Spazzy squirrel for pet lovers<br/>\t•\t3D graphic game and smooth swipe control<br/>\t•\tTwo puzzle game modes:\t<br/>\t•\t3D Endless: Shooter! Shoot more bubble birds to earn more score.<br/>\t•\t3D Puzzle: Beat the level one after another puzzle bubble levels to reach at the top shooter.<br/>\t•\tOver 400+ 3D Puzzles bubble Shooter stages<br/>\t•\tYou’ll get 10 points for each bubble shooter hit, score highest to submit in Global leader board.<br/>\t•\tMultiple colorful bubble birds<br/>\t•\tEye catching Puzzle bubble views <br/>\t•\tColorful 3D puzzle bubble birds with adorable 3D design GUI<br/>\t•\tGather Crystal jacket bubble birds to compete faster<br/>\t•\tCHALLENGE your peers on Leader boards and become the bird shooter Masters of Deluxe Puzzle bubble shooter<br/>\t•\tDownload Deluxe Puzzle Bubble Shooter for Free and keep in touch for more content in periodic updates e.g. Levels. <br/>\t•\tDeluxe Puzzle Bubble Shooter compatible with all IOS devices support 3D games.", "metacritic": null, "released": "2017-01-06", "tba": false, "updated": "2019-10-22T14:08:56", "background_image": "https://media.rawg.io/media/screenshots/26c/26c6293ce2e509f5f0d581107466a8c5.jpg", "website": "https://www.facebook.com/jugglerstudio", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 79, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Hafiz Umar"], "genres": ["Arcade", "Puzzle"], "publishers": ["Hafiz Umar"], "esrb_rating": "Everyone 10+"}