{"id": 21883, "slug": "lost-within", "name": "Lost Within", "name_original": "Lost Within", "description": "<p>Named one of the best games in the App Store Best of 2015.<br />\n“Gorgeous visuals and a tense atmosphere make for a game that offers plenty of scares and will keep you hooked until the very end” – MacLife.com<br />\n“What Lost Within really thrives on is the ability to tell a compelling story in an easily-digestible way throughout the experience. In-between the jumps and frights I had a burning desire to unravel the game&#39;s various mysteries, and press on to the next area.” – Destructoid<br />\n“Lost Within is a survival horror meets adventure game, so it is kind of a little bit like what would happen if Silent Hill and Myst had a gruesome, gruesome baby together.” – Pocket Gamer<br />\nFrom the developer of Prey -- Survive a haunted asylum and its monstrous Inhabitants. Confront a legendary killer who prowls the abandoned wards. Scavenge and create makeshift weapons or conserve your resources and employ stealth tactics to sneak past the lurking horrors. When all else fails, run for your life or find a place to hide. To escape, you must uncover the asylum&#39;s dark mystery: the shattering secret that led to its condemnation. There are many doors, but there is only one way out.</p>", "metacritic": null, "released": "2015-04-16", "tba": false, "updated": "2021-11-26T18:53:07", "background_image": "https://media.rawg.io/media/screenshots/3af/3af262169cd5560fda0399d7fa1095f7.jpg", "website": "http://games.amazon.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "beaten": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 272, "game_series_count": 0, "reviews_count": 2, "platforms": ["iOS", "Android"], "developers": ["Human Head Studios", "AMZN Mobile"], "genres": ["Action", "Adventure", "Puzzle"], "publishers": ["Amazon Game Studios Distribution", "AMZN Mobile"], "esrb_rating": null}