{"id": 218806, "slug": "blossom-garden-mania-blossom-game", "name": "Blossom Garden Mania Blossom Game", "name_original": "Blossom Garden Mania Blossom Game", "description": "Blossom Garden Mania is a classic and exciting puzzle from top game app makers. It is a match 3 and match 4 game! Blast the flowers and enjoy the very addictive splash and most interesting match-three casual puzzle game! It is also a brand new amazing popping simulator game, completely free, you can play till you drop!! Blast your way through beautiful gardens full of sweet buds! Link the buds to bloom and clear the flowerbeds before you run out of moves!<br/>Link 3 or more flower of the same color to blast them. Watch as you set off an epic chain reaction of blooming flowers candies.<br/><br/>Features:<br/>+ Many challenging levels<br/>+ Stunning graphics and effects set in beautiful flower gardens<br/>+ Different modes available for each levels. E.g. Arcade, Classic.<br/>+ Easy and fun to play, challenging to master<br/>+ Best entertainment to kill your free time<br/>+ Suitable for family, including kids<br/>+ Leaderboards to watch your friends and competitors!<br/>+ Easily sync the game between devices and unlock full game features when connected to the internet<br/><br/>How to play:<br/>1. Match three or more same identical blossom blast to crush for points.<br/>2. Match until reaching the target.<br/>3. When 4 Flower buds are aligned, you will get a special candy which clear all in the same line horizontally or horizontally or surrounding 4x4 frozen candies.<br/>4. When 5 are matched, it will create a blossom flower which remove all of that same candy.<br/>5. This is an addictive and delicious adventure filled with colorful jewels style crunching effects with a sweet graphic picture.<br/>6. Complete levels with star to get bonus.<br/>7. Take on this wonderful blossom blast saga alone or play with friends to see who can get the best score!<br/><br/>Last but not least, a big THANK YOU goes out to everyone who download Blossom Garden Mania.", "metacritic": null, "released": "2016-10-11", "tba": false, "updated": "2019-10-22T14:38:14", "background_image": "https://media.rawg.io/media/screenshots/4b9/4b9b555cb3a8496115ca60d43c594fef.jpg", "website": "http://easygfm.blogspot.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 42, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Truong Nguyen"], "genres": ["Board Games", "Puzzle"], "publishers": ["Truong Nguyen"], "esrb_rating": "Everyone 10+"}