{"id": 218833, "slug": "pixel-boat-crash-faily-brakes", "name": "Pixel Boat Crash: Faily Brakes", "name_original": "Pixel Boat Crash: Faily Brakes", "description": "Welcome to the Pixel Boat Crash: Faily Brakes! Somewhy paddles of your pixel have broken, and, as we all know, there are no brakes on the canoe boat, so, all that you can do - maneuver at riverside dodging obstacles pixel trees and rocks, trying to elongate your braking distance!<br/><br/>Rush down the pixel river avoiding pixel obstacles, and don’t be scared of an accident - even if your boat crashes into the rock or another boatman, it dissipates into blocks and small pixels, so no one would hurt really! Just swim your vessel down, and try to do it much longer each time! <br/><br/>Don’t be scared by bad weather like snow and rain! Use all your driving skill to avoid the obstacles at the obscuring weather! Search for power-ups – it could ease your way down!<br/><br/>Earn points to get access to the in-game store and buy new boats or improve current one! Check the random boxes – there could be very special vessels or bonuses, unaccessible another way! So, try Pixel Boat Crash: Faily Brakes, race downhill and get fun!<br/><br/>Pixel Boat Crash: Faily Brakes features:<br/>• Funny pixel world as your playground<br/>• Varies difficult rivers with many obstacles – other boats, rocks, and bridges<br/>• Wide range of boats, kayaks, canoes, and other vessels to swim on<br/><br/>Get fun and swim down with Pixel Boat Crash: Faily Brakes! Avoid all obstacles coming in a way and try to swim down as long as you can!", "metacritic": null, "released": "2016-09-10", "tba": false, "updated": "2019-10-22T14:31:26", "background_image": "https://media.rawg.io/media/screenshots/401/4010f2b18974d4c8a5de6a09aeec2c8e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 66, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tayga Games OOO"], "genres": ["Racing"], "publishers": ["Tayga Games OOO"], "esrb_rating": "Everyone 10+"}