{"id": 218869, "slug": "cookie-jelly-sweet-mania", "name": "Cookie Jelly: Sweet Mania", "name_original": "Cookie Jelly: Sweet Mania", "description": "Cookie Jelly: Sweet Mania will bring you a lot of new experiences within the familiar gameplay of the match-3 type.<br/> Enjoy the sweet candy world with lots of candies, puddings, jellies, cupcakes, cookies and desserts with fun and stylish challenges; the game will bring you lots and lots of entertainment.<br/>This is a very sweet and addictive match three game!<br/>Connect two or more jelly to crush and splash, and try to get as many score as possible!<br/>Enjoy this blast mania game alone or play with friends to see who can get the highest score!<br/> Cookie Jelly: Sweet Mania features:<br/>- \tExploring challenge maps with more than 100 levels<br/>- \tFun matching mechanic brings balance to the gameplay<br/>-\tEasy to pick up, hard to master. Itís not easy to get all 3 stars for each and every levels<br/>-\tLively sound effects with full HD graphics and cute characters<br/>- Easy to learn but hard to game master.<br/>- Fantastic and cute UI &amp; cool animation effects.<br/>- Very small size but super tasty graphics<br/>- Create a high score in your friends circle<br/><br/>How to play Cookie Jelly: Sweet Mania :<br/>-  Connect two or more same sweet jelly.<br/>-  Achieve the target score to jump the game level.<br/>- Eliminate the more candies in one line can get more extra scores.<br/><br/>Thank for play Cookie Jelly: Sweet Mania", "metacritic": null, "released": "2016-07-20", "tba": false, "updated": "2019-10-22T14:38:14", "background_image": "https://media.rawg.io/media/screenshots/c02/c023e5d8860e508c549a9d0893db1923.jpg", "website": "http://easygfm.blogspot.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 62, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Truong Nguyen"], "genres": ["Arcade", "Casual", "Puzzle"], "publishers": ["Truong Nguyen"], "esrb_rating": "Everyone 10+"}