{"id": 218922, "slug": "final-city-war-free-3d-heli-attack", "name": "Final City War Free - 3D Heli Attack", "name_original": "Final City War Free - 3D Heli Attack", "description": "Officer!! some commando terrorist are detected in the area. Currently they are located in the building and its looks like the building is being used for the terrorism activities.<br/>Your Mission:<br/>Release the building from the terrorists possession. For this mission you have air support with only one gunship helicopter with limited weapons. The weather is bad, time is short, Go make a strategy and eliminate all the enemy terrorist. Also check if there is any civilian hostages captured in the building. Your mission code is \"Operation Red Blood\".<br/>How to Play:<br/>- Touch &amp; Drag the screen anywhere to move/rotate your gun left, right, up or down <br/>- Aim and tap Fire button at bottom right to fire.<br/>- For clear aim view use the Telescope for sniper target shot<br/>- Try to shoot and kill enemy soldiers on first spot<br/>- The weapons will reload itself and you have unlimited number of bullets<br/>Features:<br/>- FPS (First Person Shooter) Game<br/>- Excellent real look 3D environment<br/>- Great building rooftop view from helicopter<br/>- Amazing Movie Quality sound effects and sound track<br/>- Easy GUI and controls<br/>- Enemy AI (Artificial Intelligence)<br/>- Efficient weapon control<br/>Visit our website for more info:<br/>Absologix Technology Limited - A Gaming Studio<br/>Web: www.absologix.com<br/>Feedback: admin@absologix.com<br/>Follow us on Twitter and Facebook<br/>www.facebook.com/absologix<br/>www.twitter.com/absologix", "metacritic": null, "released": "2013-12-28", "tba": false, "updated": "2019-10-22T14:35:35", "background_image": "https://media.rawg.io/media/screenshots/563/5638a7b83e1d0b9bc6959059eeb36392.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 113, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Ahmed Malik"], "genres": ["Action", "Adventure"], "publishers": ["Ahmed Malik"], "esrb_rating": "Mature"}