{"id": 218928, "slug": "crazy-police-pursuit-highway-race-cops-vehicles-dr", "name": "Crazy Police Pursuit Highway Race - Cops Vehicles Driving Simulator and Criminals Escape Silent Mission", "name_original": "Crazy Police Pursuit Highway Race - Cops Vehicles Driving Simulator and Criminals Escape Silent Mission", "description": "***The rivalry between criminals and police has just begun with a new twist. Get ready to go Fast and Speedy. One wrong move and you are doomed! ***<br/>Do you have what it takes to become an elite class racer? Hit the road now with this latest sequel of police car chasing game with the most exciting game play and amazing physics, guaranteed to give you an adrenaline rush.  Race as fast as you can on the fastest highway track packed with high speed traffic and outrun the police cars nipping at your heels as they have been sent in pursuit to arrest you and your rivals!<br/><br/>In Police Pursuit Highway, you are prone to hit into other speedy cars and increasing the speed also increases the chances and severity of a fatal crash (One wrong move and you are doomed!). Great timing and super-fast reflexes is all it takes to go as far as you can. Police Pursuit Highway combines with stunning, high quality 3D graphics with addictive game play that you have never experienced before.<br/><br/>What’s more in police pursuit highway? This extreme car racing game offers you a lot more action to challenge your racing and drifting skills with 3 different modes (endless, career, time attack) and lots of other exciting missions to test your competency as a racer.  Build your racing career now by completing all the challenging missions and emerge as the real super hero of racers.<br/><br/>Police Pursuit Highway Racing is all about racing, action and adventure. Use your superior driving skills to beat all the highway police cars and dodge the traffic; Earn cash to buy new cars; Refuel nitrous by picking boost packs and enjoy highway racing at its finest! Install now for an endless experience of the best highway police car chasing game with some amazing graphics, stunning physics, astounding tracks, and awesome cars! This is the game you have been waiting for!<br/><br/>Key Features:<br/>• Stunning 3D HD quality graphics<br/>• Breathtaking visuals<br/>• Smooth and realistic car handling<br/>• Highly responsive single-finger tap controls<br/>• Earn cash to upgrade different high-performance cars<br/>• Multiple camera angles to enhance the view<br/>• Smooth and realistic turbo racing game<br/>• Different sports cars<br/>• Easy to learn and drive<br/>• Fast nitrous boost to speed up your race.<br/>• Realistic sound effects and best suited music tracks for locations and races.<br/><br/>How to Play:<br/>• Tilt the screen to move right or left <br/>• Touch brake button to slow down or reverse the car<br/>• Touch screen to boost the car speed<br/>• Collect boost packs from the road and refill your nitrous boost<br/>• Hit Install and enjoy racing plus drifting with the best highway police car chasing game for FREE!", "metacritic": null, "released": "2016-07-06", "tba": false, "updated": "2019-10-22T14:35:40", "background_image": "https://media.rawg.io/media/screenshots/527/52711131befbb8fa4263b949bb0f406b_VjZyozd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 68, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Ahmed Malik"], "genres": ["Action", "Racing"], "publishers": ["Ahmed Malik"], "esrb_rating": "Everyone 10+"}