{"id": 218930, "slug": "extreme-beach-water-slide-stunt-ride-2017", "name": "Extreme Beach Water Slide: Stunt & Ride 2017", "name_original": "Extreme Beach Water Slide: Stunt & Ride 2017", "description": "Water slide beach adventure is an ultimate entertaining thrilling mind blowing exciting aqua fun simulation in virtual reality for true adventure lovers. Enjoy speed race sliding through water slide crazy roller coaster of crazy twists and turns with the most amazing physics based movements in the 1st person based 3D Virtual Reality water slide simulation. Water slider amusement ride is epic madness and the best of free 3D water racing games with a crazy thrill ride experience that is going to knock your socks off!<br/>Water slide beach adventure built up near the beach sliding down a water slide. But be careful, it is full of traps. Tackle the speeds of the rides be vigilant while making sharp turns at intersections of a massive waterslide! Enjoy adrenaline rush as twist and tilt your way round tight corners, make loops and whizz through at lightning speeds! Be sure to avoid dodging obstacles like sharp turn or concrete block can appear really suddenly keep alert and avoid crashes and accidents! Keep alert yourself around the edges as you can reach the speed of up to 60 miles per hour as you crash down the tallest thrill ride in free fall water slider.<br/>Voyage the water boat rider to ditch crazy twisters of water slide park tycoon, pick wonderful items at extreme velocity as you race down the crazy waterslide, dash through the crazy beach twister slide on the water boat at incredible speed &amp; extreme velocity to enjoy this water game racing in 3D. Water slide beach adventure is the best 3D water slide simulator enjoys dozens of loops incredible speeds and exhilarating drops whether you're on a water boat slippery slope.<br/>Prepare yourself for extreme waterslide action in the world’s craziest VR beach water park simulator! Survive as long as you can as you perform crazy stunts and blast through everything in your path! Whizz and bounce through rollercoaster-style corkscrews, loops and more! Be a brave incredible water parks and dominate some seriously insane tracks. This is more than just fun in the sun. Prove your skills to make it to the finish line in this epic, thrill-filled ride.<br/>In Water slide beach adventure feel through the excitement of riding on a magical joyride in crazy coaster VR Waterpark. Enjoy realistic splashing water effects as you slide down the tallest free fall thrill ride. The tallest and fastest Water Sliders in Waterslide Adventure 3D is the stuff of hallucinations at night! It is almost similar to driving a rollercoaster in a crazy water park by racing through the loops and drops. <br/>Earn coins to buy power-ups and use then wisely. Shield can save you at a critical moment, and invulnerability power-up can help you to achieve maximal speed without any problem! Use earned points to unlock varies kinds of water slide -flumes, water chutes, and hyroslides!<br/>Game Play:<br/>•\tTilt left/right device to steer right/left<br/>•\tPick coins and clear levels to unlock more amazing levels!<br/>•\tCollect speed boosters to race down the thrill slider<br/>•\tAvoid hurdles to save the waterboat rider <br/>Features of Water slide beach adventure Game:<br/>•\tHigh quality, immersive visuals<br/>•\tExtreme Water Park thrills with 3D water slider<br/>•\tPick coins and clear levels to unlock more amazing levels!<br/>•\tBuy upgrades with the coins, you've collected <br/>•\tEasy to download and user friendly<br/>•\tSuperb first person controls<br/>•\tAmazing environments to explore!<br/>•\tAmazing race boosts and pickups <br/>•\tFastest roller coaster ride of twists and turns<br/>•\tExhilarating physics guaranteed to give you an adrenaline rush!<br/>•\tFastest water racing game action <br/>•\tCoolest &amp; tallest water slide simulator<br/>If you like water splash simulation, please try other games by clicking “More from Developer” or by visiting our publisher account. And don’t forget to rate and review.", "metacritic": null, "released": "2017-05-08", "tba": false, "updated": "2019-10-22T14:36:03", "background_image": "https://media.rawg.io/media/screenshots/b4e/b4ecbb2f05c39bf7fa2bc894d165457c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 102, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Ahmed Malik"], "genres": ["Adventure", "Simulation"], "publishers": ["Ahmed Malik"], "esrb_rating": "Teen"}