{"id": 21899, "slug": "neon-adventures", "name": "Neon Adventures", "name_original": "Neon Adventures", "description": "............................... Neon Adventures............................... <br/><br/>Check the Exclusive Video Trailer<br/>http://goo.gl/kGlHl<br/><br/>STORY ---<br/><br/>Neon is the valiant butterfly and the only protector of the kingdom of Fauna. He is bestowed with immense energy to protect his race.<br/>While he was busy with his responsibilities, the little butterflies managed to escape the vial and venture deep into the space. Red alert rings aloud and Neon is on his wings to bring them back before the little ones are massacred. <br/><br/>40 AWESOME LEVELS ----<br/><br/>It’s an awesome graphic game, with high definition game graphics and effects. The game layout is really well planned and it has got 40 mind-blowing levels to fight. The trail of the path is rendered with some awesome particle effects, giving it a mesmerizing experience to watch and those playing it.<br/><br/>CHALLENGES ---<br/>   -  You need to help Neon to bring the little ones back to their vial, where they are supposedly safe. Fight and evade moving blades of all colors, some are static and some are in deadly motion.<br/><br/>   -  When you feel you have almost conquered the world, it’s just the beginning of the battle. The entry to the cages is locked and unlocking it is a flowery adventure. <br/>   -  The flower that gives access to the cages have time limit, so set you plan and watch out for the withering ones.<br/><br/>   -You can fight it right and increase your life chances<br/><br/>Go get the little butterflies  out of danger..!", "metacritic": null, "released": "2012-12-10", "tba": false, "updated": "2019-10-22T14:30:32", "background_image": "https://media.rawg.io/media/screenshots/41f/41f535be5a5a83f810f0d7fb52b3ce3e.jpeg", "website": "http://dumadu.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 133, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Dumadu Games Pvt"], "genres": ["Action", "Adventure"], "publishers": ["Dumadu Games Pvt"], "esrb_rating": "Everyone 10+"}