{"id": 218926, "slug": "vr-jet-fighter-combat-flight-simulator-game-best", "name": "VR Jet Fighter Combat Flight simulator game Best", "name_original": "VR Jet Fighter Combat Flight simulator game Best", "description": "**air fighting between jet fighters with fully manual control in virtual reality**<br/><br/>World's most popular and hottest action game is here.<br/><br/>VR Jet Fighter Dogfight is free offline hybrid vr flight simulation and VR action game in which you have to pilot jet fighter F-16 Falcon in storm of bullets and missiles in Virtual Reality. Get ready for an exciting VR game experience in the first ever Virtual Reality Jet Fighter fighting and bombing Battle. This vr game supported by all virtual reality headsets including google cardboard.<br/><br/>This VR Flight simulator game contains expanding range of exciting missions challenge. Chase and destroy all the enemies to complete your mission objectives and become the savior of your country as well as of your people from invasion. Opponent stunning AI will put your skills to the test.<br/><br/>In VR Jet Fighter fighting game, it focuses heavily on the realism that you don’t see in other VR Flight Simulation game. The environment of the game has a unique realistic view, based on real-time 3d mapping consists of high mountains and variety of buildings. The main and the best feature of this VR game is its breathtaking jet fighter control with dogfight chasing scenarios, as well as its stunning graphics and sounds create the look and feel of real cockpit. Game Pad is recommended to experience all features of this VR shooting and flight simulator game<br/><br/>Highlighted Features:<br/>-Realistic 3D fighter jet cockpits.<br/>-Simple, easy and intuitive control.<br/>-Fighter unit designed based on real warzone and dogfighting.<br/>-Highly detailed modern jet fighter war plane having supersonic speed and maneuverability.<br/>-Best VR Experience.<br/>-Manual playing mode as well as autopilot mode.<br/>-Ultra-Realistic explosion and fight against jet fighter.<br/>-Experience the ultimate action jet fighter bombing with console quality graphics and sounds in Virtual Reality.<br/>-No internet connection required.<br/><br/><br/>------------------------------------------------------------------------------------------<br/>Please follow us on our Facebook page; we would love your suggestions and try our level best to improve our games to provide you the better and quality entertainment.<br/>Facebook page link: https://www.facebook.com/absologix", "metacritic": null, "released": "2016-12-20", "tba": false, "updated": "2019-10-22T14:35:40", "background_image": "https://media.rawg.io/media/screenshots/a96/a96d2f6db3a4c0d1664c8edcede4e8a1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 126, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Ahmed Malik"], "genres": ["Action", "Simulation"], "publishers": ["Ahmed Malik"], "esrb_rating": "Teen"}