{"id": 218986, "slug": "asteroids-jam", "name": "Asteroids Jam", "name_original": "Asteroids Jam", "description": "This is one type of Space Game. In this game there are 3 Scenes.<br/>1.  Menu Scene<br/>2.  Game Scene<br/>3.  Purchase Scene<br/><br/>1.\tMenu Scene<br/>In this scene we can select game scene or purchase scene and background music mute option is there.<br/><br/>2. Game Scene<br/>\tThis is the scene where we can play game.  The background is moving along with Space Ship and opponents   are coming from 3 directions i.e. top, left and right. When you tap the screen Space Ship fires the bullets, if those bullets reach opponent that will blast you get the coins according to opponent size, you have to collect that coins and when you collect that coins you will get the score. The number of firing for each opponent depends on its size ex: some of the opponent blast for 1 fire and some one for 2 firing etc.<br/>When opponent hit the Space Ship game is over. Level will increase each few minutes and also background will change. You can get the power ups at any time while playing. <br/>There are 3 power ups added in this game.<br/>a.\tSpeed Power:  speed of the game will increase and opponents adding also will increase. You can get more points.<br/>b.\tMagnet Power: when this power is active there is no need of coin collections, when we fire the bullets we will get coin collections automatically and you can score more.<br/>c.\tShield Power: when this power up is active, if opponents hit the spaceship the game is not over. That means the spaceship is safe from opponents.<br/><br/>3.\tIn App Purchase Scene<br/> <br/>\tIf you want to play game with new spaceship you can purchase and set as game spaceship.", "metacritic": null, "released": "2015-11-26", "tba": false, "updated": "2019-10-22T14:18:31", "background_image": "https://media.rawg.io/media/screenshots/c4c/c4c1684850e31d735c0beb2daa90f09d_GTfXYKv.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 130, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["V Lokeswara Reddy"], "genres": ["Racing", "Arcade"], "publishers": ["V Lokeswara Reddy"], "esrb_rating": "Everyone 10+"}