{"id": 21897, "slug": "gamebook-adventures-8-curse-of-the-assassin", "name": "Gamebook Adventures 8: Curse of the Assassin", "name_original": "Gamebook Adventures 8: Curse of the Assassin", "description": "Curse of the Assassin is written and designed by S.P. Osborne, author of GA1, and takes you back to the familiar surrounds of Orlandes City where you pick up your life some time after the events in An Assassin in Orlandes. You’ve risen through society after dealing with Eltane and saving the city, capturing the affections of the Duke’s daughter along the way. The mysterious death of friend arouses your suspicions and once again you find yourself at the heart of conspiracy that takes you back to your home village and a meeting with your old adventuring party from your youth.<br/><br/>An exciting mystery adventure thriller races from Orlandes City through to the wilds of Orlandes, into the mines of Kern Badenach and even out to sea! Pirkka Harvala, who previously illustrated An Assassin in Orlandes and Catacombs of the Undercity, returns for his third gamebook and this time his wonderful artwork appears in colour for the first time!<br/><br/>** REVIEWS **<br/><br/>\"Gamebook Adventures are fun to read – not just because the RPG mechanic draws you in and engages you in the story, but also because the stories are good fantasy fiction. The artwork is great and there is a great deal of replayability in the application, especially when you consider the hundreds of choices that can be made and the various difficulties.\" - WIRED.COM <br/><br/>\"Like the previous entries in the series, this release doesn't really put a foot wrong, and serves as a fine tribute to the classic dice-and-pencil quests we used to know and love during our misspent youths.\" - POCKET GAMER (8/10 - Silver Award)<br/><br/>\"Telling a great story of murder and intrigue, Curse of the Assassin is a highly enjoyable adventure gamebook from the iOS masters of the genre.\" - 148 APPS (4/5)<br/><br/>\"All put together, Curse of the Assassin is a fun experience. It works as a stand-alone story, but this is actually a sequel, although upon completion you may be compelled to try its predecessor, and all others of its like.\" - DIGITALLY DOWNLOADED (4.5/5)<br/><br/>\"I've had an absolutely fabulous time playing through them, and highly encourage anyone interested in fantasy novels to check 'em out.\" - TOUCH ARCADE <br/><br/>** FEATURES **<br/><br/>•Includes all the interactive reading and gameplay features found in the previous Gamebook Adventures titles.<br/>•Read the story and dictate the direction of the story! Options based on who you have met, where you have visited and what you have found.<br/>•Unique battle system using realistic 3D dice which can be rolled by shaking your smartphone or tablet.<br/>•Lots of achievements to collect and artwork to find throughout the book. These are placed on your achievement wall.<br/>•Three difficulty levels. Read the book casually by being able to move around freely or crank up the difficulty and be a hardcore gamebook player.<br/>•Companions you meet on the adventure will now fight with you!<br/>•Awesome artwork (including a new cover by Dan Maxwell!) and music by Adrian Watkins to accompany the interactive story.<br/><br/>Join Tin Man Games at www.gamebookadventures.com for lots more exciting digital gamebooks including the Fighting Fantasy series and Judge Dredd!", "metacritic": null, "released": "2013-09-25", "tba": false, "updated": "2019-10-22T14:30:32", "background_image": "https://media.rawg.io/media/screenshots/0cc/0cc4041ba34254ab99c165d755905124.jpg", "website": "http://www.gamebookadventures.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 241, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tin Man Games"], "genres": ["RPG"], "publishers": ["Tin Man Games"], "esrb_rating": null}