{"id": 218910, "slug": "helicopter-air-attack-1-military-helicopters-fight", "name": "Helicopter Air Attack - #1 Military Helicopters Fighting and Shooting Game Free", "name_original": "Helicopter Air Attack - #1 Military Helicopters Fighting and Shooting Game Free", "description": "Heli Air Attack - Dogfight instantly slings you into the close range military helicopter fighting games. In this free helicopter simulator game you will get to pilot different types of helicopters in various anti-ground and anti-air missions. Missions are held in fixed map areas where you need to simply complete objectives which involves destroying various ground, air, or naval targets.<br/>Heli Air Attack - Dogfight is most immersive and realistic helicopter shooting and fighting game, a perfect exhibition of Armed and Military helicopters, deadly weapons, payload of guided missiles, rockets, bombs, and a 30 mm canon. Using the on-screen keypad, you can move selected helicopter back and forth, call in support and fire your weapons.<br/><br/>This insane gunship dogfight game is one of the best helicopter games with highly challenging missions, guaranteed to give you an adrenaline rush and have your heart racing! Don’t go astray and use your best helicopter flying skills as a gunship heli pilot to invade your enemy’s territory and attack them with your gunship to win the conflict and come out victorious. But beware of the enemy’s defense strategies, as they have installed anti-aircraft guns at numerous locations and have made a lot of other arrangements to kill you right on the spot!<br/><br/>Heli Air Attack - Dogfight is a complete case of helicopter driven third person shooting dogfight game with fully manual control. The game’s visuals is immersive. The individual military helicopter models, landscape, and enemy units and structures are quite detailed as well. The visual effects like weapon fire, explosions, etc blends well with the action as usually happens in helicopter fighting games.<br/><br/>Heli Air Attack 3D - Dogfight Features:<br/>- Spectacular Air defence missions<br/>- Close air support<br/>- Ground attack missions as well dogfight in air<br/>- Variety of weapons and equipment including Guided missiles and anti-aircraft guns<br/>- Advance radar and navigation system to navigate opponents choppers and helicopter<br/>- Collection of best military helicopters of aviation history (Apache, Viper, ATAK-120, Havoc, Mi17)<br/>- Turbo boost to enhance speed of your chopper<br/>- Stunning graphics , UI and visual effects<br/><br/><br/>------------------------------------------------------------------------------------------<br/>Please, follow us on the following page; we would love your suggestions to improve our games to provide better<br/>entertainment to our followers, users and supports;<br/>Facebook;<br/>https://www.facebook.com/absologix", "metacritic": null, "released": "2016-06-30", "tba": false, "updated": "2019-10-22T14:02:09", "background_image": "https://media.rawg.io/media/screenshots/226/22631e3f3db934bf1caf9e6b8b4202a3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 235, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Ahmed Malik"], "genres": ["Action", "Simulation"], "publishers": ["Ahmed Malik"], "esrb_rating": "Teen"}