{"id": 218901, "slug": "vr-city-roller-coaster-free", "name": "VR City Roller Coaster Free", "name_original": "VR City Roller Coaster Free", "description": "Taste the lekker flavour of a dream city embracing you to have your first splendid modern virtual reality experience. VR City Roller Coaster Simulator lets user steer through elevated skyscrapers, heart pounding tracks and giant drops. Let the cables pull the train up high in the sky and fall back down before it enters to the black hole!<br/>Best ever Roller Coaster tour in the heart of sky high buildings.<br/><br/>A tailor made interesting and thrilling amusement Roller Coaster ride in a big city of adventours.<br/>Be the first one to dare while faint hearted can’t just imagine to go for it...<br/><br/>Feel the heat energy of the track on flattened steel strips during roller coaster ride.<br/><br/>Dozens of carriages are assembled together to give you the ultimate roller coaster dare.<br/><br/>Nothing big is coming in the near future to give you the most heart pouncing million dollars rollercoaster ride, the wait is over so stop thinking and show the mettle.<br/><br/>Challenge your fear of heights to join the league of most adventurous and daring riders, surfing the crazy joyride on roller coaster. Let the eye candy environment, fab graphics and real time gives you the super joyous experience. VR City Roller Coaster Simulator is super easy to use and can be enjoyed anywhere whether you are waiting for a train on a subway or on the air plane while you are on flight.<br/><br/>Give it a try to make it your most favorite and memorable simulation adventure game.<br/><br/>Get ready to ride an amazing virtual roller coaster! Experience the real sensation and fear of riding a roller-coaster with your mobile virtual reality headset. This experience boasts a 360 VR FPS field of view, addicting and endless gameplay. No trigger needed - just wait for the ride to being!<br/><br/><br/>VR City Roller Coaster Simulator Features:<br/>-\tA cool ramp to start your tour with.<br/>-\tThe only place to fulfill your wild nightmares.<br/>-\tFace the most dangerous 360-degree heart line roll.<br/>-\tThe biggest dipper right in the pivot.<br/>-\tTravel up through corkscrews to experience the world’s most exciting cobra roll.<br/>-\tA smoother, safer ride and the teardrop shape to link the max speed.<br/><br/>Some Compatible VR ( Virtual Reality ) Headsets Include:<br/>Google Cardboard VR<br/>Stooksy<br/>Durovis Dive VR<br/>Refugio 3D<br/>VR View-Master<br/>VRTX One<br/>Merge VR<br/>ANTVR<br/>VR Smartview<br/>ColorCross<br/>VRTRIA<br/>Nibiru VR", "metacritic": null, "released": "2016-12-08", "tba": false, "updated": "2019-10-22T14:19:59", "background_image": "https://media.rawg.io/media/screenshots/eb4/eb467bcb609a0d0fc5bf886d4c7f0e09.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 182, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Ahmed Malik"], "genres": ["Adventure", "Simulation"], "publishers": ["Ahmed Malik"], "esrb_rating": "Everyone 10+"}