{"id": 21905, "slug": "cover-fire", "name": "Cover Fire", "name_original": "Cover Fire", "description": "<p>The TETRACORP megacorporation is occupying several areas over the planet suppressing the villages, taking over their resources, and controlling every single communication. A new resistance has born and it’s time to eradicate this menace.<br />\nAre you the hero the human race needs?<br />\n- Winner of the &quot;BEST IN SHOW: AUDIENCE CHOICE AWARD&quot; at the INDIE PRIZE in Berlin 2017 -<br />\nCOVER FIRE FEATURES<br />\n- The FIRST game to take advantage of the new 3D-TOUCH CONTROL. A pioneer control that brings you a UNIQUE immersive SENSATION. Connect directly your finger to the trigger. PRESS and SHOOT!<br />\n- HD graphics with detailed scenes, full of particles and grapeshot. DESTRUCTIBLE ENVIRONMENTS. Everything interact with the player.<br />\n-Move like a real veteran soldier thanks to an ORIGINAL and immersive cinematic. Engross yourself in a frenetic and dynamic adventure with NON STOP ACTION.<br />\n-Face the battle from different perspectives. Alternate among your mercenaries in REAL-TIME, find the ultimate combination.<br />\n- Supply yourself with a HUGE real-captures-based ARMAMENT. Faithful mechanics and characteristic sounds of each gun.<br />\n-Set up your AVENGERS squad with their unique skills. Choose diverse roles. Unlock new EPIC characters. Have you ever seen an inflatable dinosaur on the battlefield?<br />\nHear the calling. Set your team of mercenaries. Start the journey to battle, prelude of the biggest war the earth has ever seen so far. Soon, you will realize that the investigations in Tetracorp goes further than simple totalitarianism. The discovery of a new material, the element 115, it can decide the fate of the mankind and it can not fall in the wrong hands.<br />\nIn Cover Fire you will be the hero in charge of set an end to this potential holocaust. Lead your squad of avengers through sieged cities, inhospitable deserts and fields taken by guerrillas, and defeat diverse kind of enemies in the game with the biggest graphic and armament unfolding available on iOS.<br />\nThe ultimate war experience. Totally intuitive controls designed to create an entirely immersive sensation. Taking advantage of the new Force Touch to offer a unique feeling. Take cover, aim, press and eliminate this hazard.<br />\nAs the leader of the rebellion, you will face the rough army of the enemy corp: Implacable elite soldiers, lethal special units, mechanical experiments with impenetrable shields… Take the control of the situation, deal with the conflict as a real war machine. Become the legend of this rebellion.<br />\nWill you be able to annihilate all the enemies in this bloody battle?<br />\n- Absorbing story mode based on the original “Cover Fire” comic, with more than 60 missions and challenging showdown with the platoon bosses. Eradicate the menace of Tetracorp and lead an uprising. Many chapters with hundreds of possibilities and hours of gameplay.<br />\n- Simple and intuitive controls. Immerse yourself easily in the action. Use the 3D-Touch technology and feel an entirely new experience unique in the shooter games environment. Press the screen, pull the trigger!<br />\n- Upgrade the skills of every member of your team. Increase their abilities, make them faster, stronger, more lethal. Equip them with the best guns and gears. Level up your hero squad y drive them to victory.<br />\nWill you be able to annihilate all the enemies in this bloody battle?<br />\n<em>IMPORTANT</em> CoverFire requires iPad 4 (or newer), iPhone 5s (or newer), or iPod touch (5th Generation).<br />\nVISIT US:<br />\nhttps://www.facebook.com/CoverFireGame/<br />\nhttp://generagames.com</p>", "metacritic": null, "released": "2017-03-29", "tba": false, "updated": "2023-02-09T02:33:20", "background_image": "https://media.rawg.io/media/screenshots/ccc/ccc8fdf1119ee4190373c9d99bac539f.jpeg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 1, "dropped": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 3, "suggestions_count": 235, "game_series_count": 0, "reviews_count": 4, "platforms": ["Android", "iOS"], "developers": ["Genera Mobile"], "genres": ["Action", "Simulation"], "publishers": ["Genera Mobile"], "esrb_rating": "Mature"}