{"id": 21908, "slug": "finger-band", "name": "Finger Band", "name_original": "Finger Band", "description": "A new and exciting twist on the classic beat matching formula, will MEMORY or RHYTHM be your downfall? Answer: could be both!<br/><br/>Do you like to test your Rhythm and Memory in a fun and challenging way? If so this is the game for you! Not for the faint of heart, this game is for fans of that 'one more go' philosophy. Whilst natural ability may come in handy, you’ll never beat all 5 stages if you don’t hone and develop those skills… so listen up, let the rhythm take hold, and get tapping to that beat!<br/><br/><br/>HAND CRAFTED STAGES<br/>Each stage has been carefully designed to provide challenge and fun in equal measure! Difficulty increase as you progress, and the strange make-up of each stage means part of the fun is in seeing what comes next!<br/><br/>UNIQUE MUSICAL INSTRUMENTS (40+)<br/>A bizarre collection of instruments waiting to be unlocked and used. What sound does a Rubber Chicken make when squeezed by a vice? That and more will be revealed!<br/><br/>VARIATION ON PLAY<br/>Time pressures, tempo changes, sequence lengths, instrument numbers… they’re all played with to mix up how you play! There’s even a bit of challenge free fun to be had at the titles screen ‘Jamming Out’.<br/><br/>HANDICAPS AND CHALLENGES<br/>With SEVEN musical based handicaps introduced alongside the general changes during play, there’s plenty to keep you on your toes. Will you fall victim to the Decoy?<br/><br/>ACHIEVEMENTS AND LEADERBOARDS<br/>Battle your way to the top of the leaderboards, hitting high-scores targets and being graded as your progress. Complete additional achievements and unlock new content to play with on the titles screen. Integrated with Game Center as standard.<br/><br/>AUDIO FOCUS<br/>Ears and eyes are just as vital here, so let those ears take some of the strain! Headphones (although not necessary) will enhance the experience and give you that bit of an advantage.<br/><br/><br/>GAMEPLAY SUMMARY:-<br/>LISTEN as a sequence of beats is played, RECALL that sequence from memory, and then REPEAT it back. This is a simple premise but one you will find can become quite challenging as musical parameters are adjusted and handicaps are introduced. Points are scored for remembering the correct sequence, with additional points being given by responding in-time. By chaining these ‘Perfect Presses’ you can even start a multiplier for maximum points, something you will have to do if you want to hit those high-scores targets. But remember… one mistake, and it’s Game Over!<br/><br/>Hopefully you’ll have an enjoyable experience playing the game, but if you do notice any issues or simply have something to say, please do get in touch and/or follow sherpa reynolds at the relevant channels. All the best, son.", "metacritic": null, "released": "2016-12-01", "tba": false, "updated": "2019-10-22T14:30:32", "background_image": "https://media.rawg.io/media/screenshots/27a/27ab2d6fdb61c0e5153a8796f31b7e21.jpeg", "website": "http://sherpareynolds.com/FingerBand", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 123, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["sherpa reynolds"], "genres": ["Arcade"], "publishers": ["MR D S MCNAB"], "esrb_rating": "Everyone 10+"}