{"id": 219126, "slug": "knightfall-ar", "name": "Knightfall AR", "name_original": "Knightfall AR", "description": "Knightfall AR is an augmented reality experience designed by Milkroom Entertainment and co-developed by Milkroom Entertainment &amp; Spectral Games that places you in the world of The Knights Templar as they seek to defend the city of Acre from an invading army and protect Christianity’s most prized relic, the Holy Grail. Use your wits and sharp eyes to take out as many enemy soldiers as you can before they breach the walls. You’ll need to add and upgrade defenses between enemy waves, holding back your attackers long enough to fire on them with arrows and fireballs.  In a separate feature mode, place characters from both the show and the game in your environment, choose animations and snap pics that can be shared to social media or directly with friends. <br/><br/>* Leveraging Apple’s newest technology to create an experience right on your table!<br/><br/>* Highly immersive experience as you physically move around the battlefield, zoom in on the action and launch blistering attacks<br/><br/>* Engaging actions allow you to place and upgrade a variety of defenses<br/><br/>* In Photo Mode, place, move &amp; scale unlocked characters, choose animations and snap pics that can be shared with friends<br/><br/>* Learn about this fascinating time in history as you collect coins which provide facts about various soldiers and weapons", "metacritic": null, "released": "2017-09-19", "tba": false, "updated": "2019-07-30T11:54:54", "background_image": "https://media.rawg.io/media/screenshots/34c/34c449f9df87201d67d03bd108efece0.jpg", "website": "http://www.history.com/shows/knightfall", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 292, "game_series_count": 0, "reviews_count": 1, "platforms": ["Android", "iOS"], "developers": ["A&E Television Networks Mobile"], "genres": ["Strategy"], "publishers": ["A&E Television Networks Mobile"], "esrb_rating": "Teen"}