{"id": 219124, "slug": "ancient-aliens-the-game", "name": "Ancient Aliens: The Game", "name_original": "Ancient Aliens: The Game", "description": "Millions of people around the world believe we have been visited in the past by extraterrestrial beings. Did ancient aliens really help to shape our history? And if so, might they have come here to escape some cataclysmic event on their home planet? Or perhaps… to prevent one from happening on ours? <br/><br/>What if it were true?<br/><br/>Based on HISTORY’s longest running TV show, Ancient Aliens, this game explores the endless possibilities in our universe. Play as a reluctant alien-human hybrid in this story-driven city building game! Manage your resources and strategize carefully. The fate of the Earth might depend on it!<br/><br/>Inspired by the famous theory that aliens were the true pioneers of ancient Egyptian culture, Ancient Aliens: The Game puts you in direct contact with those very extraterrestrials. Tasked with overseeing the construction of the Great Pyramid of Giza, you will uncover long-buried evidence along with an ancient astronaut theorist—and learn the truth from the aliens themselves!<br/><br/>Abduct primitive humans, manipulate their DNA, and help them establish modern civilization as you exploit Earth's mineral wealth. But it won’t be easy. To build something as colossal as the Pyramid of Giza, you’ll need to build houses and farms, advance human technology, and more. <br/><br/>Key features:<br/><ul><li>Story written by bestselling author and award-winning game writer Steven-Elliot Altman<br/></li><li>Advance human technology to expand and customize your Egyptian empire!<br/></li><li>Meet a great cast of quest-giving characters that constantly shift your allegiance between your ruthless alien handlers, the Pharaoh, the Oracle and Ancient Astronaut Theorist Giorgio A. Tsoukalos.<br/></li><li>Perform quests for the aliens and ancient astronaut theorist, Giorgio A. Tsoukalos<br/></li><li>Build colossal pyramids and expand your Egyptian empire within 3 chapters, written by bestselling author and award-winning game writer Steven-Elliot Altman.<br/></li><li>Abduct your workers to probe them of their DNA and transform them into faster, stronger advanced beings such as Minotaurs, Savants and Giants!<br/></li><li>Research technologies to improve the empire’s knowledge and unlock unique technologies, skills, and structures<br/></li><li>Watch beautifully animated cutscenes, featuring engaging and fun characters</li></ul>", "metacritic": null, "released": "2016-05-05", "tba": false, "updated": "2022-09-30T04:59:08", "background_image": "https://media.rawg.io/media/screenshots/13a/13a39a4c311425e9cd723780d00422ad.jpg", "website": "https://www.facebook.com/AncientAliensCommunity", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 199, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "Android", "iOS"], "developers": ["A&E Television Networks Mobile", "Fifth Column Games"], "genres": ["Adventure", "Strategy", "Simulation", "Casual"], "publishers": ["Legacy Games", "A&E Television Networks Mobile"], "esrb_rating": "Everyone 10+"}