{"id": 21919, "slug": "hempire", "name": "Hempire", "name_original": "Hempire", "description": "From ganja to glory - get ready to grow your operation into a mighty Hempire!<br/><br/>This is the ultimate weed growing game. It doesn’t just stop at the pot: you must harvest your plants, breed new and unusual strains, make friends (and enemies), and eventually take control of your entire home city to be victorious.  <br/><br/>But watch your back! Just ‘cause weed’s gone legit doesn’t mean you’re safe! Hempire is a story driven joint, so get ready to deal with corrupt cops and shady businessmen, while also helping old ladies bake brownies. For real.  <br/><br/>Features:<br/>* Grow popular cannabis strains starting from the classics like Northern lights and Chemdawg.<br/>* Use the lab to breed and discover new strains and remain at the top of the industry. <br/>* Craft extracts like hash and shatter, and edibles like cookies and brownies.<br/>* Customize your grow op with new equipment, lights, and generators as your business grows.<br/>* Complete deals with game characters to unlock new features and strains.<br/>* Generate huge cash by selling your product in the dispensary. <br/>* Invest your money in local businesses and real estate and develop your city. <br/>* Start with one bud and grow your business, your Hempire, into a billion dollar enterprise. <br/>* Multiplayer Competition. The Hempire Cup: Compete against other players to breed the highest quality strain winning trophies in the Hempire Cup.<br/><br/>Grow your Hempire. Your pot-ential is limitless.<br/><br/>Please note Hempire is a free-to-play experience, but some game items are available for purchase using real money. A network connection is also required. <br/> <br/>Join us online:<br/> <br/>* Facebook: https://www.facebook.com/hempiregame<br/>* Instagram: hempiregame<br/>* Twitter: @HempireGame<br/>* Website: http://hempiregame.com", "metacritic": null, "released": "2017-04-05", "tba": false, "updated": "2022-10-26T07:17:56", "background_image": "https://media.rawg.io/media/screenshots/44f/44f512016cbd1706e790d85cc18143fc_yhO36DR.jpeg", "website": "http://hempiregame.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 188, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["LBC Studios"], "genres": ["Strategy", "Simulation"], "publishers": ["LBC Studios"], "esrb_rating": "Mature"}