{"id": 219218, "slug": "pixel-hitman-revolution", "name": "Pixel Hitman Revolution", "name_original": "Pixel Hitman Revolution", "description": "Embark on an epic block quest and fulfill your pixel destiny!<br/><br/>Prepare to face merciless killers and Templars coming towards you from all sides! The only thing that you can do is to pick your favorite weapon and begin your pixel adventure! Enter the block-like arena and begin your 3D journey!<br/><br/>Wonder through the block world, sneak into pixel forests and riversides, run through the streets of unknown. You must hide, jump or climb in order to make your sudden attack! Master your skills and became a true pixel assassin! Upgrade your weapons using coins you collected during the game and unlock achievements by killing as many as possible enemies, moving to other maps and discover mysterious secretes of the block world.<br/><br/>*** Single Player Features *** <br/>The more kills and minutes you survive in survival mode, the higher ranking you’ll get on the score table! Prove your skills to your friends and be the best on the scoreboard!<br/><br/>*** Multiplayer Features *** <br/>- Worldwide and local<br/>- Unique amazing maps that you will fall in love at first sight. And new maps are already in the making, so we are sure you won’t be disappointed! <br/>- Varied weapons, ranging from katanas, knives, axes and many more<br/>- Weapon upgrades<br/>- Chat mode is available so you can chat with your friends and colleagues during the game<br/>- Team match and death match mode <br/>- Exciting experience that can really get you hooked! <br/>- Amazing background music and sound effects", "metacritic": null, "released": "2017-05-25", "tba": false, "updated": "2019-10-22T14:18:37", "background_image": "https://media.rawg.io/media/screenshots/e52/e5236bd7f809d4d949d85e138d13a9b0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 260, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["EntArchs"], "genres": ["Action", "RPG"], "publishers": ["EntArchs"], "esrb_rating": null}