{"id": 219215, "slug": "elemental-sword-fight", "name": "Elemental Sword Fight", "name_original": "Elemental Sword Fight", "description": "It is the strength of the elemental magic that will decide this epic sword fight and the war that is evolving in the medieval times of the parallel blocky Earth universe. Pure strength means nothing! Magic is the king!<br/><br/>Elemental Sword Fight is a fight with magical blades, where contact is not needed. Throw your spells upon your enemies and bring the danger of the nature elements straight to them! Some effects can be deadly and you are the warrior with a special gear that can survive this and save the pixel kingdom from the demise.<br/><br/>You can choose from 8 special swords that contain the power of the Earth components:<br/>- Fire! Enemies will run from the blazing balls of fire that are torpedoed from the point of this blade. This guy is on fireeee!<br/>- Magic! Overwhelm your opponents with beautiful magic stars and destroy them with style. It is a bit stronger than the Fire Sword.<br/>- Toxic! Poison will run through the veins of you enemies. As long as they stand in the toxic cloud, they receive damage from it.<br/>- Air! Not as powerful as poison, but still dangerous. Shoot the cloud of air into your opponents and destroy them!<br/>- Ice! This sword shoots ice cubes into more than one enemy. You just have to go close enough to take damage. Ice, ice, baby!<br/>- Thunder! Even stronger than ice, thunder blades send lightning into multiple rivals of yours. It even goes through walls!<br/>- Water! Water is important for life, but a strong stream will destroy the foes and shoot them into the air. Your own geyser does not hurt you!<br/>- Earth! Similar to water, earth sword shoots a hazardous tornado of gravel out of the ground. You can use it to shoot yourself to the higher ground.<br/><br/>Choose your favorite and collect enough experience points and gold to upgrade the powers of your swords. That is how you can win the battles and get the best score in this colorful elemental war.<br/><br/>You can choose from three different types of gameplay.<br/><br/>One of them is the single player Training, where you are constantly attacked by your enemies. Try to survive for as long as you can and get the achievement and climb the rankings.<br/><br/>In the Multiplayer mode you can choose from two gameplays. Death-match where every man is for himself and Team match, where you can get you clan together again and prove to your enemies that you are not a joke.", "metacritic": null, "released": "2017-03-30", "tba": false, "updated": "2019-10-22T14:18:37", "background_image": "https://media.rawg.io/media/screenshots/2d5/2d5f3cfaf3f41d0aa8375099faf798bc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 204, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["EntArchs"], "genres": ["Adventure", "RPG"], "publishers": ["EntArchs"], "esrb_rating": null}