{"id": 219278, "slug": "bravo-elite-super-commando", "name": "Bravo Elite Super Commando", "name_original": "Bravo Elite Super Commando", "description": "This Commando shooting is an action game in which you experience the most amazing adventure war and shooting against dangerous terrorists in battle field multiple environments. In this 3D gaming experience will take you to a whole new level of fun in this fps world war army game heroes of 2018. Commando game is a free first person shooting action game that is all about shooting,killing and survival with your strategy. Play as a best military commando you have got training from us armed force school 2018, in which you have learned about how to fight in critical danger conditions and learned about uses of automatic weapons. You should use all these guns to become a assassin shooter.<br/>This is an amazing fighting game of 2018, in which you experience the most danger epic adventure. As a good army troop you have to show extra ordinary quick and good aim counter and shooting skills. Here wild enemies everywhere around you so shoot them with bravely and eliminate all successfully. In shooting game have to complete all adventure missions to become commando. So lets make Jungle Commando also which kill, shoot and survive ability. This army shooting game contain jungle shooting and desert shooting. Every environment have separate levels. So lets join this game now.<br/><br/>Features:<br/>-Variety of guns<br/>-Multiple environments<br/>-Very easy control and top to shoot and kill the enemies <br/>-Every mission make more adventure<br/>-New army game and battle zone graphics", "metacritic": null, "released": "2018-02-24", "tba": false, "updated": "2019-10-22T14:18:40", "background_image": "https://media.rawg.io/media/screenshots/45a/45a69196c0d87763737ad42731059f0d_c2SV4T3.jpg", "website": "https://toptiam.wordpress.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 112, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Arslan Ilyas"], "genres": ["Action", "Adventure"], "publishers": ["Arslan Ilyas"], "esrb_rating": "Mature"}