{"id": 219240, "slug": "bike-rider-chases-police-heli", "name": "Bike Rider Chases Police Heli", "name_original": "Bike Rider Chases Police Heli", "description": "This is the ultimate moto bike stunts and heli police chase game. Have you ever dreamed of performing motor bike stunts master and make champion against heli police ? This stunt is new concept game. <br/>Police are searching for a man who robbed a woman in a street.They doubted that Robber didn't know how to ride a bike. Police wants to judge him either he is a real robber or not. Police warn him to ride this stunt bike ,if he will pass all these hurdles then he will be cleared from all investigations otherwise he will be arrested.<br/>In which you can perform bike racing against helicopter police. Multiple 40 plus mission give you more fun and help you to make top stuntman. Each level is more challenging and thrilling than the other level. It is time for exciting ride and crazy stunts. Use your motorcycle driving tricks and complete dangerous challenges and make all achievements of this irresponsible bike stunt game. Complete unique missions to unlock more awesome tricky moto bike and become a stuntman against professional police pilot in one of the best simulator games. <br/>Police are searching for a man who robbed a woman in a street.They doubted that Robber didn't know how to ride a bike. Police wants to judge him either he is a real robber or not. Police warn him to ride this stunt bike ,if he will pass all these hurdles then he will be cleared from all investigations otherwise he will be arrested. So lets join this game show your skills. <br/>If you think this is the best game then you can suggest through comments.<br/><br/>Features:<br/>- Select your favorite motorcycle<br/>-Multiple levels 40 plus levels<br/>-Heli police and bike racing a new concept <br/>-Adventure game impossible track but interested<br/>-High quality graphics <br/>-Real Sounds both moto bike and helicopter", "metacritic": null, "released": "2018-02-02", "tba": false, "updated": "2019-10-22T14:18:38", "background_image": "https://media.rawg.io/media/screenshots/bb9/bb95f1f6ee8165bca9e2ba842ec5568d.jpg", "website": "https://toptiam.wordpress.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 146, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Arslan Ilyas"], "genres": ["Simulation", "Sports", "Racing"], "publishers": ["Arslan Ilyas"], "esrb_rating": "Everyone 10+"}