{"id": 219289, "slug": "mario-duck-hunt-mario-games", "name": "Mario Duck Hunt | Mario Games", "name_original": "Mario Duck Hunt | Mario Games", "description": "*** Reached No. 1 in Sports Games in 1 App Store ***<br/>*** Reached No. 1 in Arcade Games  in 2 App Stores! ***<br/>*** Reached No. 3 in Games in 3  App Store! ***<br/><br/><br/>Relive all of the fun and challenge of your Nintendo days with Mario Duck Hunt app. See if you can shoot the ducks as they fly out of the bushes and head for the sky. If you miss, the ANGRY DOG is going to laugh at you. <br/><br/><br/>★★★★★★★★★★★★★★★★★★★ <br/>REVIEWS !!!! <br/>★★★★★★★★★★★★★★★★★★★ <br/> ✔\"Wow, this game just brought back out the kid in me, when all games became classis. Mario Duck hunt app is the hottest game out!\"-Greg.<br/><br/>\"Mario Duck Hunt: Terrific game and idle time taker! I love this! \"-Terry<br/><br/>\"This is a real good game I hope it was free on here\"-Juanita<br/><br/>\"Mario Duck hunt app is totally awesome! You just have to buy this app! Kill the monkey.\"-laura<br/><br/>\"Cool game I am a hunter my self so this game is easy for me!\"-Jeremy<br/><br/>\"Fun 4 all;) my kiddos love it and it reminds me alot of that big orange and gray gun shooting at the T V ;)good job and it works just fine on my 3GS ;)!\" - Melissa<br/><br/> ✔ “Wow, I remember playing this with my brother soooo many years ago. And this game is like that, with design and graphic improvements. Brought back so many memories.” <br/>- Martin <br/><br/> ✔ \"finally...I was able to shoot that annoying doggy-monkey, I used to hate him so much\"<br/>-John<br/><br/> ✔\"Love this game! ..this game is a classic...plus a little beat more cool with its bonus\".<br/>-Gregory<br/><br/>✔\"very existing news!!!! I love that we finally can kill the annoying doggy\"<br/>- Mark<br/><br/>✔\"Funny game, Like it a lot\"<br/>- Sadi<br/><br/>✔\"Fun 4 all;) my kiddos love it and it reminds me alot of that big orange and gray gun shooting at the T V ;)good job and it works just fine on my 3GS ;)!\"<br/>- Melissa<br/><br/>Remember playing Duck Hunt on your Nintendo? You’d wait for a duck to start taking flight out of the bushes, point your gun at the screen and squeeze the trigger. A fast shot and steady hand was required to make a kill and if you missed, that dog popped up and snickered at you. <br/><br/><br/>That dog was funny but also frustrating at times. The thought of turning your Nintendo gun on him crossed your mind once or twice, especially when you were having a bad game, but it wouldn’t have been the same without him. <br/><br/>Some very exciting changes come with this update of Mario Duck hunt app. First of all, a large flock of ducks has been added as a bonus level. Veteran Duck Hunt players will be especially delighted to let loose at the whole glorious flock. Plus, fans of our original mobile game have let us know that the DOG isn’t exactly man’s best friend, quite the opposite! We feel your frustration and have improved the gameplay based on your suggestions! The game now includes special levels that allow you to shoot the ANGRY DOG!  Yes, really! Now you can let that snarky primate know who is boss from time to time. You just have to play the new version of Mario Duck hunt app!<br/><br/>Well now, Duck Hunt can be more than a pleasant memory because there’s a new version of that fun and challenging game that you’re going to love just as much. It’s called Mario Duck hunt app and you can play it right on your iPhone, IPAD.<br/><br/>Mario Duck hunt app has cool graphics and more detailed backgrounds than the original game. The classic play concept is the same but in a more modern setting. You still get to choose between one or two duck games, still have to shoot as many as you can. One of the main differences that you’ll notice is that YOU CAN SHOOT THE ANOYING DOG (THE ANGRY DOG). <br/><br/><br/>COOL FEATURES:<br/><br/>✔ Smooth navigation, easy to use <br/>✔ Shoot the ducks, your finger is the gun <br/>✔ Incredible modern graphics <br/>✔ Angry dog! <br/>✔ International leaderboard for comparing scores <br/>✔Same fun and challenge of the classic Duck Hunt game <br/>✔ Gives you a nice feeling of nostalgia", "metacritic": null, "released": "2010-10-22", "tba": false, "updated": "2019-10-22T14:18:40", "background_image": "https://media.rawg.io/media/screenshots/9ee/9ee43a1bbe4888f79614f22a2c539a28.jpg", "website": "http://www.youtube.com/watch?v=3BTbi89mAsM", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 94, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["AhorrecompArando"], "genres": ["Sports", "Arcade"], "publishers": ["maria camila ECHAVARRIA"], "esrb_rating": "Everyone 10+"}