{"id": 21929, "slug": "deathstate", "name": "Deathstate", "name_original": "Deathstate", "description": "Deathstate is a Rogue-like, bullet-hell, single stick shooter. You play as a number of unique characters trying to discover the fate of Professor Elinberg, who opened a portal to the endless void. Great and terrible mysteries await if you are bold or foolhardy enough to go beyond the beyond!<br/><br/>In Deathstate, you are a traveller of the outer realms. You have discovered the secrets of deep astral projection by entering into a fully death-like meditative state. While in your Deathstate, you can go beyond the beyond to realms previously only imagined by those enlightened or mad enough to dwell upon them. Tread lightly though, for these far planes of demi-existence that you choose to explore are extremely hostile to mortal souls.<br/><br/>GAME FEATURES<br/>- A Unique Take on Classic 16-bit World<br/>- Hordes of Enemies in action-packed Gameplay<br/>- Unlock Multiple Player Characters with Unique Abilities<br/>- Discover Mystic Tomes, Ritual Blades, Relics, and Organs<br/><br/>1 player<br/>400MB minimum save size<br/>DUALSHOCK®4<br/><br/>  Software subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service &amp; playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.<br/><br/>", "metacritic": null, "released": "2015-10-19", "tba": false, "updated": "2019-08-02T16:21:36", "background_image": "https://media.rawg.io/media/screenshots/521/5216ecc2fd91930426d540ea1ab38c52.jpg", "website": "http://www.deathstategame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 20, "toplay": 1, "dropped": 1}, "playtime": 3, "achievements_count": 33, "ratings_count": 1, "suggestions_count": 325, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "PlayStation 4"], "developers": ["Workinman Interactive"], "genres": ["Arcade"], "publishers": ["Workinman Interactive"], "esrb_rating": "Teen"}