{"id": 219293, "slug": "nok-hockey", "name": "Nok Hockey", "name_original": "Nok Hockey", "description": "Nok Hockey is an electronic version of the real-life hockey board-game made by Carrom. The same game played in camps and schools around the world. This game is meant to replicate what it's like to play the board game. We limited the fancy special effects so that when you play Nok Hockey on your iPhone or iPad, it looks and feels like the real life board game.<br/><br/>It will test your shooting and angle skills as you try to find the correct angle and speed to shoot off the boards and score a goal! First one to 5 wins!<br/><br/>PLAYING TIP: <br/>TO SHOOT: PUT YOUR FINGER BEHIND THE PUCK (not on it) AND SWIPE YOUR FINGER THROUGH THE PUCK IN THE DIRECTION YOU WANT IT TO TRAVEL.<br/><br/>There are 3 different playing modes of the game: <br/>1. Player vs. Player <br/>2. Player vs. Computer<br/>3. Shootout Mode<br/><br/>In the Player vs. Player mode, you can play hockey against someone else using the same device. But score quickly, because the first person to score 5 goals wins!<br/><br/>In the Player vs. Computer mode, you can select how good the Computer is: easy, intermediate, or difficult. But be careful, when you select a difficult computer opponent, the goals come quickly so make sure you can score quickly too! And also, the first to score 5 goals wins!<br/><br/>In the Shootout mode, you have the opportunity improve and test your shooting skills. The computer will randomly select 10 different shots on the board for you to shoot from. Your objective is to score as many of the 10 shots as possible. Then, play again to see if you can beat your score. <br/> <br/>And just a TIP, when taking a shot, be sure to put your finger BEHIND THE PUCK (not on the puck), and then with one motion, move your finger over and passed the puck. But find the right speed and correct angle. You will need these to be just right to score!!<br/><br/>NOK HOCKEY by TNT APPS.....<br/>HE SHOOTS, HE SCORES!!!<br/>SHE SHOOTS, SHE SCORES!!!<br/> <br/>www.tandtapps.com<br/>tandtapps@gmail.com", "metacritic": null, "released": "2009-09-18", "tba": false, "updated": "2019-10-22T14:18:41", "background_image": "https://media.rawg.io/media/screenshots/a0d/a0d51701e134da1614c2f19c687c7423.jpg", "website": "http://www.tandtapps.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 18, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["TNT Apps"], "genres": ["Sports", "Board Games"], "publishers": ["TNT Apps"], "esrb_rating": null}