{"id": 219461, "slug": "insulterator-the-insulting-insult-generator-of-tal", "name": "Insulterator - the insulting insult generator of talking insults", "name_original": "Insulterator - the insulting insult generator of talking insults", "description": "********************************* <br/>We've released a new FREE game \"Pixel Guess - the pixelated picture guessing game!\"   So please help us celebrate by downloading \"Pixel Guess\" today!<br/>********************************* <br/><br/>Insulterator —the talking insult generator!<br/><br/>\"This entertainment app has no problem insulting your friends and family\" -- AppAdvice<br/><br/>*****Recently featured on iTune's \"What's Hot\" for Kids!! (top 50)<br/><br/>*****Also recently featured on iTune's \"What's Hot\" in Entertainment!!<br/><br/>Does your friend “dance like a dizzy chicken” or  “have more body hair than unshaven weasel?”  The Insulterator will tell the truth.   <br/><br/>Simply type in a friend’s name, slide the switch and the Insulterator will happily insult your friends—hurling one hilarious zinger after another.   <br/><br/>Is the insult “totally random” or “right on target?” You and your friends will laugh your heads off trying to decide.<br/><br/>You can use the built-in words and phrases or easily add your own words for even more customized fun.<br/><br/>•Over 3 million different ways to insult your friends.<br/>•Send your favorites to your friends by email or text message or just save them to your device for later playback.<br/>•Add and delete your own words and phrases to create unlimited combinations.<br/>•4 different voices. <br/>•14 built-in voice presets including “whispering” and “Autotuna”<br/>•Change the pitch, emotion and speed of each voice to create your own custom voice presets<br/>•6 different color schemes including “Kiss of the Ninja,” “Merlin’s Dream,” and  “Silver Surf.”<br/><br/>And when you’re done insulting your friends with Insulterator, try analyzing their personalities with our other new  app  “Friendalyzer!”", "metacritic": null, "released": "2011-05-19", "tba": false, "updated": "2019-10-22T14:18:44", "background_image": "https://media.rawg.io/media/screenshots/72a/72a540dcd4a181c3b16608c7b46d4daf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 90, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Jay Bacal"], "genres": [], "publishers": ["Jay Bacal"], "esrb_rating": "Everyone 10+"}