{"id": 219587, "slug": "run-bug-run-survival-race", "name": "Run Bug Run - Survival Race", "name_original": "Run Bug Run - Survival Race", "description": "Experience a day of a bug’s life and try to outrun all enemies and threats that bugs have to deal with to survive! <br/>Run, jump, dash and slide to avoid the mean kid’s burning magnifying glass, while avoiding all obstacles that are trying to slow you down on your dash to safety. <br/><br/>Take to the unexplored part of the forest and try to stay ahead of the danger that is right behind you. <br/>Put your lightning reactions to the test and run as long as you can to save the little turbo bug’s life. Narrow bridges to cross, wide gaps to jump, rocks to avoid - those are only a few of the obstacles that you need to watch out  for while dashing through the course of this endless running game. <br/><br/>Staying ahead of the mean kid’s magnifying glass and keeping your turbo sprint on can be really exhausting! Try to collect as many cherries and melons as you see to run for longer and achieve all the crazy goals. The special power-ups give you magic power that will help you through the game! <br/><br/>Join us and save a bug’s life NOW! <br/> <br/> <br/>Features : <br/>- 3D <br/>- Powerups <br/>- Goals <br/>- Various Bug Characters <br/>- Endless runner<br/><br/>Join our facebook community and vote for the next character that you want to play with!", "metacritic": null, "released": "2014-09-19", "tba": false, "updated": "2019-07-30T17:02:37", "background_image": "https://media.rawg.io/media/screenshots/fca/fca38d74f693781450fea8e9653f306e.jpg", "website": "http://www.bytewaves.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 166, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Bytewaves"], "genres": ["Action", "Adventure"], "publishers": ["Bytewaves"], "esrb_rating": null}