{"id": 219671, "slug": "warhammer-age-of-sigmar", "name": "Warhammer Age of Sigmar", "name_original": "Warhammer Age of Sigmar", "description": "Whether you collect the models, read the background or play the game, Warhammer Age of Sigmar: The App is the ideal companion to your hobby. Off the battlefield, you can download and read a wide range of Warhammer Age of Sigmar resources, from every unit's warscroll to entire battletomes and other books – and even individual battleplans, Realm of Battle rules, allegiance abilities and much more! <br/><br/>You can browse and organise warscrolls for your units for easy access, check out the rules for new additions to your collection, and find links to buy models on Games Workshop's webstore. And with the Azyr Army Builder subscription, you can craft an army that will conquer the Mortal Realms.<br/><br/>While you're playing a game, the My Battle tool becomes your one-stop reference for everything you need. Choose a battleplan from among those you've unlocked, add Realm of Battle rules, consult your allegiance abilities and, of course, have all your warscrolls at your fingertips so you’ll never forget that crucial rule that could mean the difference between bitter defeat and glorious victory!<br/><br/>FEATURES<br/>Warscrolls: Browse a complete archive of warscrolls for every model in the Warhammer Age of Sigmar range, all specially formatted to be easy to read on your device. Each warscroll displays when it was last updated, so you know you're using the most recent iteration of your rules.<br/><br/>My Library: Browse a library of all your purchased books, ready for you to download and read – and with easy links to the store to buy more books you may like.<br/><br/>My Battle: Select warscrolls that are in your army, along with your battleplan, Realm of Battle rules and allegiance abilities, and have everything you need at your fingertips for easy reference as you play.<br/><br/>Rules: Read the full core rules for the game, designed for your device.<br/><br/>Azyr Army Builder: Make army lists designed for open, narrative or matched play, with all the options and artefacts from your battletome. Personalise your list and export it to print or share. Note: This feature requires a subscription, available through an in-app purchase.<br/><br/>Price per month  -  £0.99 / $0.99 / €0.99<br/><br/>Payment will be charged to your iTunes Account at confirmation of purchase. This subscription will automatically renew unless auto-renew is turned off at least 24 hours before the end of the current period. Your account will be charged for renewal within 24 hours prior to the end of the current period. The cost of the renewal will match the initial subscription price. You can manage your subscriptions and turn off auto-renewal by going to your ‘Account Settings’ after purchase. No cancellation of the current subscription is allowed during the active subscription period.<br/><br/>Terms Of Use<br/>https://www.warhammerdigital.com/apps-terms-of-use.html<br/><br/>Privacy Policy<br/>https://www.warhammerdigital.com/app-privacy-policy.html", "metacritic": null, "released": "2015-07-18", "tba": false, "updated": "2019-07-30T17:13:18", "background_image": "https://media.rawg.io/media/screenshots/bbf/bbf8b5cbac8de55623277dc97470052c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 104, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Games Workshop"], "genres": ["RPG", "Strategy"], "publishers": ["Games Workshop PLC"], "esrb_rating": null}