{"id": 219731, "slug": "compact-crossword", "name": "Compact Crossword", "name_original": "Compact Crossword", "description": "Compact crosswords are similar to normal crosswords, but use lines instead of black squares to separate the words.<br/> <br/>Advantages of compact crosswords are:<br/> <br/>• Grids contains many more words to find for a particular grid size, making it well suited for smaller screens, but great on tablets too<br/>• No wasting half the screen with black squares<br/>• Larger number of crossovers, like US style crosswords, more reward for finding the answers<br/> <br/>Compact crossword grids look a little like mazes, and another name for this game is Word Maze.<br/> <br/>Other Features:<br/> <br/>• Each new grid is generated on-the-fly by the app, meaning unlimited games to play<br/>• Many 1000's of clues, both straight and general knowledge<br/>• You can zoom in &amp; out of the grid, and move around, making it possible to play larger grids even on smaller screens<br/>• Can also generate grids using the more traditional British style grid, and Arrow Crosswords (Arrowords), where the clues are integrated into the grid<br/>• Very configurable game generator, allowing you to specify the grid size, grid type, clue types, difficulty of clues/answers and even the genre of general knowledge questions!<br/>• Ability to save and reload games, so several games can be played at the same time<br/>• Choose between US or UK English spellings<br/>• General knowledge questions tailored to your country (e.g. US, UK, Australia, Canada, etc.)<br/>• Allows you to generate crosswords tailored to your interests, ability, nationality and device size<br/>• Numerous aids in case you get stuck, e.g. validate word/letter, reveal word and even a built-in crossword solver to show potential matches<br/>• Possible to play with your choice of English, French, German and Dutch clues and answers", "metacritic": null, "released": "2014-12-30", "tba": false, "updated": "2019-10-22T14:05:31", "background_image": "https://media.rawg.io/media/screenshots/6db/6db6b46de46b4d54e1814a95d6c3f641.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 122, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Havos"], "genres": ["Puzzle"], "publishers": ["Havos"], "esrb_rating": null}