{"id": 219757, "slug": "crazy-stuntman-adventure-run", "name": "Crazy Stuntman Adventure Run", "name_original": "Crazy Stuntman Adventure Run", "description": "Let it go get into the real stunts man water run wipe-out park run game with awesome stunts man runs in super cool water park obstacle arena among the water challenge  games.<br/><br/>Get into the serious wipe out challenge in this legendary stunts man game along with extreme water slide stunts man run,when obstacles are in the way. Feel the real obstacle course difficulty in this legendary stuntsman game along with stunts man wipe out water park runs among 3D. Enjoy the best realistic stunts of wipe out extreme in our 3d, so think and jump to download it for free and its way better than water slide games of 2017.Extreme legendary obstacle course stunt game, the most accurate wipe out simulator game among water run games 3d.<br/><br/>Legendary stuntsman water run wipe-out park run game is best fun obstacle course water world game among the water slide extreme stunts games of 2017. Play the extreme water challenge obstacle arena simulation with ultimate survival stunts of real wipe out water world. Enjoy 3D stuntman water run in wipe -out Water Park with high speed moving obstacles in this HD water park run game, the best game among stunt man run games 3D. Get ready wear on your helmet and flak jacket and don't get wipeout before you qualify in the awesome hurdles event as real legendary stunts man.<br/>Real Stuntman Runs wipe out Park 3D provides you the best graphics, all you need is to control your character's balance and speed, be careful while making high jumps do not fall in water, sharp turns at closing of massive hurdle slides in this realistic 3D amazing wipeout and run adventure legendary game. Survive as long as you can as you perform crazy stunts and blast through everything in your path, take a splash in the water with whizz and bounce through rollercoaster-style corkscrews, loops and wipe out style hurdles.<br/>Features:<br/>- Interesting and super cool 3D Characters to choose from.<br/>- Smooth tap and swipe function to control stunt man.<br/>- Whole alot of exciting stunts tasks to complete.<br/>- Orignal 3D visual and ultimate sound effects<br/>- Amazing runs &amp; jumping Animation in 3D.", "metacritic": null, "released": "2017-09-16", "tba": false, "updated": "2019-10-22T14:07:09", "background_image": "https://media.rawg.io/media/screenshots/858/85899200570e3a572b86cb3b66a7b4ec_BeiXtuZ.jpg", "website": "https://majhyanatech.wordpress.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 56, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Adil Munir"], "genres": ["Adventure", "RPG", "Sports"], "publishers": ["Adil Munir"], "esrb_rating": null}