{"id": 219767, "slug": "frontier-doodle-island-sniper", "name": "Frontier Doodle Island Sniper", "name_original": "Frontier Doodle Island Sniper", "description": "Try to head shot to kill the enemies as enemies are very well trained shooter .This  is the best realistic and unique action shooting game. You are not a contract killer, you feel as a real island army best commando, who save own city to hazardous criminal and protect your country in any difficult time. Front line combat elite strike game is full action pack game. Assassinate the enemies with your favorite sniper weapon because you are a finest commando from the army desert force. This game is here for your great enjoyment period. Use your powerful sniper skills to shoot every target you can in this shooting simulation. Army commando shooting is not a board game; everybody likes shooting and action game. This is the best chance for better shooter to test your sniper shooting abilities.These are modern sniper shooter combat situation and you have to target and shoot.<br/>You've stepped into the crime, this desert and snowy location has many dangerous enemies and they stroll on off-road and snowy Mountains. So are you ready to thriller yourself? If yes, then pick up the latest rifle and pull the trigger to kill the enemy coming your way. Strike hard for your survival in this Army Sniper Desert 3D Shooter game. Use your latest sniper rifles and firearm to take the extreme head shot. This sniper rifle is especially designed for delivered to best shooter with an especially powerful zoom, limitless ammunition with powerful pierce bullets. In this game your task is shoot the terrorists with his gorgeous sniper rifles.<br/>This is very addictive for the lovers of action and battlefield games. This is the story of the brave front line army commando to war with hazardous terrorists. In this game you have join the battlefield as a trained sniper commando. Your duty is to kill the enemies’ forces and destroy his camp. Choose the weapon and get ready for thrilling action. The most popular Army Sniper Shooter game only for you; eliminate enemies because you are a hero of this island. A real action games with realistic shooting experience of sniper 3d with stunning graphics and realistic sound effects.", "metacritic": null, "released": "2017-08-05", "tba": false, "updated": "2019-10-22T14:07:31", "background_image": "https://media.rawg.io/media/screenshots/293/29318182c196bebd5a60e5a7800cd5bf_WCyR7n2.jpg", "website": "https://majhyanatech.wordpress.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 100, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Adil Munir"], "genres": ["Action", "Adventure"], "publishers": ["Adil Munir"], "esrb_rating": null}