{"id": 219755, "slug": "train-controller-simulator-3d-rail-fun-drive", "name": "Train Controller Simulator: 3d Rail Fun Drive", "name_original": "Train Controller Simulator: 3d Rail Fun Drive", "description": "Drive and become locomotive driver of this amazing train simulator game. Enjoy the Railway system and rail tracks. Get fun addictive with track changing, rainy environment, snow environment, pleasant  environment, multiple camera views and tremendous train speed to explore. Become train driver and operate huge trains and enjoy the most exciting train features in the game. This is the best train simulator game with excellent railway track change system. Get the thrills from this High speed rail adventure. This is the real racing metro train track in mountain, hills ,green land. Fast drive on the railway track is extreme fun for the crazy driver. Play this super train amazing game and enjoy hill location scenes. Drive carefully don't try to hit the other trains follow the signals and reach your destination safely.<br/>Driving a massive engine of train is my dream. If you have the same dream than get on board and start driving your own train. We give you your personal collection of trains in your pocket. This professionally made Train Simulator has something for every Train fan. Your responsibility is to maintain train and drive it from one station to other. You need to clear all the levels successfully before you call yourself a real train driver.<br/>You may face many challenges to get through and complete the tasks, but this game will definitely take you to a whole new level of satisfaction &amp; fun. T his is the only driving simulator that fully embraces incredibly smooth 3d engine physics and effects. This game is designed to give you pure and realistic train adventure. Experience the most amazing train ride of your life. Best of luck for driving trains simulator game.<br/>Features:<br/>1.Accelerate upward to move forward &amp; downwards to slow down<br/>2.Excellent in-game Sounds<br/>3.Press button to stop the train<br/>4.lovely level Design<br/>5. Easy &amp; User friendly game controls<br/>6. Endless Fun for Both Adults &amp; Kids<br/>7. Perfect 3D graphics and well-detailed environment<br/>8. Realistic train physics", "metacritic": null, "released": "2017-07-21", "tba": false, "updated": "2019-10-22T14:09:30", "background_image": "https://media.rawg.io/media/screenshots/0bf/0bfd031d493853871ff4aa22ecae88d3.jpg", "website": "https://majhyanatech.wordpress.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 111, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Adil Munir"], "genres": ["Adventure", "Simulation"], "publishers": ["Adil Munir"], "esrb_rating": null}