{"id": 219758, "slug": "rugby-786scores-kick-s", "name": "Rugby 786Scores Kick-s", "name_original": "Rugby 786Scores Kick-s", "description": "Experience the thrill and excitement of real Rugby.Don't miss a moment of the season and play.Enjoy Rugby as the Rugby teams of the world compete this season.Intuitive Flick Kicking: Control the angle and curve of your kick with the flick of your finger.There are three mode eat the clock,arcade mode,ball and all.Flip to kick the ball towards  the goal post.There are different level.In which play single player.Play your favorite game Rugby. Practice and master the kicks to win the football game.You need to check the wind direction before you kick the rugby ball. Score a goal and be a rugby football master! Play each game with different targets to achieve.PLAY your fanatical football game.Flick Kick Rugby brings intuitive, quick to play, on the go fun.Show your skills and make perfect player.<br/>Unique flick shoot control, improved 3D graphics and realistic animations for the best football kick experience.With multiple game modes and this game will keep you entertained through those long hours between real-world games.Need more of a challenge? Have what it takes to turn around a match in the dying minutes? If so, challenge mode is most definitely for you.So experience the pure flick-kick action of your favourite Rugby game. <br/>Kick the ball to Goalpost from on grounds with the flick of your finger.Keep an eye on distance &amp; wind factor; the ball may swing a lot distorting your goal angle.The most intense kick Rugby super kicks game to practice your flick-kick skills.Rugby: Summer Sports is one of a pack of Summer Sports that can be played individually or as part of multi-sport you can set up yourself. It’s up to you to decide how many sports you will compete at.Awesome graphics, great kicks and animations provide the best Rugby League gaming experience.Time has come for you to enter this hall of fame.<br/>And it happens there, on Rugby.<br/>Features:<br/>-Real Game Physics<br/>-Complete 3D Flick-Kick Power Action<br/>-Realistic 3D Game Graphics<br/>-Excellent Sounds<br/>-Amazing real-time Sport<br/>-Beautiful Stadium with lush green ground<br/>-Crowd will cheer at every successful goal", "metacritic": null, "released": "2017-10-14", "tba": false, "updated": "2019-10-22T14:07:09", "background_image": "https://media.rawg.io/media/screenshots/abc/abc4b5108703dad5542d9f7c1c557bef_ieJSiw2.jpg", "website": "https://majhyanatech.wordpress.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 117, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Adil Munir"], "genres": ["Adventure", "Sports"], "publishers": ["Adil Munir"], "esrb_rating": null}