{"id": 219778, "slug": "prisoner-impossible-escape-breakout-story", "name": "Prisoner Impossible Escape Breakout Story", "name_original": "Prisoner Impossible Escape Breakout Story", "description": "In this Prison Jail game you have been punished to prison for a serious crime. You are being watched through Cameras and security.The security of the jail is not in your hands, you can run and save your life otherwise enemies kill you.You are a professional criminal and you will not living in the prison. You will have to assassinate your enemies in the lockup.It will not be an easy task to attack the enemies.Opened your mind and protect yourself from enemy. <br/>It is time to fight hard with your amazing skills to fight with police guard in jail breakout missions. Mostly your life time is spent with dangerous criminals in prison cell.You spent some hard time with punishment in this custody home.Your mission is save your life, your enemies’ killing silently one by one quickly.Use simple tools to assassinate the enemies and save yourself from their counter attacks.Use baseball bat, punches and kicks and protect yourself to fight with enemies,hitting on their head and body.You do not have any weapons to use except your power.Breakout is your only mission now. In order to successfully break out of the jail you’ll have to devise a grand &amp; great plan.Immersive environment and real life sound effects would not let you leave this game ever.<br/>In this Escaping Game you will destroy enemies.This is very unique game like a sniper or commando clash and escaping game best action and thrilling Game.Bring professional criminal in your mind in this Prison Jail game,you are a prisoner and required to thinking a plan. How need plan, to break the jail and come out in this crime simulator.Detention center wardens are roaming everywhere,so you need to be careful while you should escape.Jail wardens is very violence and harmful to you and they punishment very hard.It is a very exciting and thrilling prisoner escape strategy addictive game.<br/>Features:<br/>-Amazing 3D Prison jail cell Environment<br/>-Realistic Sound Effects<br/>-Use Combat &amp; Fighting Tools like<br/>-Player Punch, Power ups and Combos<br/>-Smooth and intuitive controls<br/>-Real Thrill of Escaping the Prison", "metacritic": null, "released": "2017-08-19", "tba": false, "updated": "2019-10-22T14:07:45", "background_image": "https://media.rawg.io/media/screenshots/be5/be5e84908de5f226d403ccced1cafdd9.jpg", "website": "https://majhyanatech.wordpress.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 35, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Adil Munir"], "genres": ["Action", "Adventure", "Sports"], "publishers": ["Adil Munir"], "esrb_rating": null}