{"id": 219772, "slug": "service-station-adventure-cars", "name": "Service Station Adventure Cars", "name_original": "Service Station Adventure Cars", "description": "Drive and Park a wide variety of different super sports car at the Service Station.Just look at this car it looks really terrible and very dirty.Clean your car through the Car Wash.Let's play and clean your vehicle!With so much washing fun to be had why not try one of the best cleaning games available today.Drive and Park different vehicles at car wash service station.Enjoy driving and parking the most amazing gas station parking simulator and explore new cities.<br/>Park the beautiful real cars on different gas stations.The best for car parking job in  day for this some sports cars with different colors and latest models are decided to keep in this car parking challenge in this driving and parking game.<br/>Become a crazy furious car driver and show off your skills but keep the fuel meter in mind,because i fuel short then your level failed. You can drive in the whole grand city and be as fast as you can.No need to fear.<br/>Your duty is to drive cars through city, driving it to service station &amp; parking it with precision to get car services from petrol pump station.Park in service stations by driving a wide variety of different sports vehicles.Finest cars need regular wash just like you.You don’t have to any ruled in your amazing beast in modern car driving &amp; parking simulator game! It’s not car derby boaring racing, just take the 4x4 wheels of power packed sports car with  park it accurately in its spot.<br/>This is an excellent game for kids and youngster if you want to play a service station game with latest model 4x4 cars.Your mission starts with driving and ends with parking level if you park the car on right awesome place. So get ready to become a car driver and tune up many new sports cars and multiple vehicles and drive them to designated car parking lot.Your mission starts with driving and ends with parking. <br/>Features:<br/>-Grand Fun and adventure simulator<br/>-Multiple Car Selection<br/>-Big City Depend on fuel<br/>-Challenge game<br/>-lovely Levels and difficulty increse step by step", "metacritic": null, "released": "2017-11-11", "tba": false, "updated": "2019-10-22T14:07:35", "background_image": "https://media.rawg.io/media/screenshots/d13/d1382334fe9559e318d3dcff8602c9c1.jpg", "website": "https://majhyanatech.wordpress.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 73, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Adil Munir"], "genres": ["Adventure", "RPG"], "publishers": ["Adil Munir"], "esrb_rating": null}