{"id": 219777, "slug": "gorilla-sniper-vs-dino-terror", "name": "Gorilla Sniper VS Dino Terror", "name_original": "Gorilla Sniper VS Dino Terror", "description": "In the world of dinosaur hunting game you can hunt dinosaurs .Experience the thrill of being an real Dinosaur Hunter.Enjoy the biggest new shooting and hunting Dino game. Become a deadly sharp shooter; enter to the dark forest to hunt or kill the huge dinosaurs with test your best sniper skills and show your real assassination experience. In this modern sniper competition you are walking alone in the forest, equipping with unique killing rifles, aiming at the powerful dinosaur is around the green fresh jungle areas. The deadly dino killer simulation is full gunfire base addicting game. This Shoot Hunter wonderful simulator is here for your great enjoyment time with Lots of astounding and action levels with stylized stunning graphics and realistic thrilling environments; you can also feel marvelous effective sound of weapon shooting and dinosaur violent in this Jungle Dino Sniper War addictive simulation.<br/>Some amazing hazardous animals are spread around the rain forest, destroy the freshly place and killing the other wild animals. Dinosaurs have many powerful and too long, so the mission of the soldier is just about to being. You are required to hit the focus on your target indicate by arrow and do not let them loss from the scene. Take your sniper rifle and kill them all. Dinosaur has strike on forest so be alert, hold your breath, aim &amp; fire with unique weapons and ammunition! Front line shooter has responsibilities to save the jungle life and war with dinosaur. As a professional commando, you are called to lose or execute the dinosaur, they are walking on the jungle, find your goal which may available into hidden the forestry.<br/><br/>Aim, Shoot and Kill, be the perfect sharpshooter Jurassic Forest 3D Hunter game, use your modern deadly sniper rifles and firearm to take the exciting shot, this wonderful sniper  are especially designed for delivered to best handgun with a specially controlling zoom, unlimited ammo with powerful pierce bullets. You are equipped with many weapons like sniper gunfire. Use suitable handgun according to the situation. Prove That, You have the best assassin and show sniper abilities to shoot down the dinosaur.<br/>HOW TO PLAY;<br/>Press start button for start the game<br/>Choose your level from the game menu map<br/>Enter on the jungle Area<br/>Joystick control to move and change the angle of hunter<br/>Right side buttons are for shoot, zoom, swap and run<br/>In map you can find dinosaur and chase them to hunt.<br/>Left side button are for movement and whole screen is for aiming<br/><br/>FEATURES:<br/>With real Jurassic park stunning environment.<br/>Best sniper hunting experience in safari park.<br/>.Realistic first person shooting game.<br/>Easy to play.<br/>Unlimited bullet.<br/>Stunning graphic.<br/>3D game play and amazing sound effects<br/>Hunting different dinosaurs.<br/>With modern sniper shooting gun.<br/>Unique missions to play", "metacritic": null, "released": "2017-07-18", "tba": false, "updated": "2019-10-22T14:07:39", "background_image": "https://media.rawg.io/media/screenshots/342/34237ad35e94a48daf5ad48b7a401a86_YIEjd0o.jpg", "website": "https://majhyanatech.wordpress.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 153, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Adil Munir"], "genres": ["Action", "Adventure", "Sports"], "publishers": ["Adil Munir"], "esrb_rating": null}