{"id": 219715, "slug": "starship-captain-adventure-in-alpha-sector-free", "name": "Starship Captain: Adventure in Alpha Sector (Free)", "name_original": "Starship Captain: Adventure in Alpha Sector (Free)", "description": "This new version of Starship Captain is completely free. No in-app purchases!<br/><br/>Starship Captain is an epic role-playing strategy game where you travel from between star systems in search of adventure. You start with a small ship and some money and work to build a fortune and see the universe.<br/><br/>Along the way you can buy and sell cargo, accept missions, mine asteroids, attack and plunder other ships, upgrade your ship, and help others. You can talk to patrons of the spaceport bars to uncover multi-part missions and solve mysteries.<br/><br/>Game features:<br/>• Buy cargo at one spaceport and take it to another to sell for a profit.<br/>• Accept missions to deliver strange and unusual cargo.<br/>• Talk to characters at spaceport bars to hire crew, find treasure and unravel mysteries.<br/>• Upgrade your ship’s weapons, armor, shields and engines.<br/>• Fight other ships to take their cargo with a unique simple combat system.<br/>• Fly around asteroid fields and mine them for ore and precious metals.<br/>• Manage your fuel, crew and other factors to maximize profit.<br/>• Play completely for free, or buy relativity crystals to speed up travel between distance star systems.<br/>Requires: iPad 2 or newer, iOS 8 or newer.", "metacritic": null, "released": "2015-05-26", "tba": false, "updated": "2019-10-22T14:18:48", "background_image": "https://media.rawg.io/media/screenshots/f33/f33a0b7d70aaf59212191c5a0e39a6c2.jpg", "website": "http://clevermedia.com/iphonegames/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 160, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["CleverMedia"], "genres": ["Adventure", "RPG"], "publishers": ["CleverMedia"], "esrb_rating": null}