{"id": 219878, "slug": "bubble-shooter-arcade-hd", "name": "Bubble Shooter: Arcade HD", "name_original": "Bubble Shooter: Arcade HD", "description": "Bubble Shooter is an extremely addictive match 3 puzzle game for anyone from the age of 5 to 95. Playing the game is really easy: shoot at like-colored bubbles to make them pop. You'll spend hours exploding bubbles on your device in two game modes.<br/><br/>Choose the Story mode and display both logic and bubble popper skills to pass numerous tricky levels. The goal changes with every level, as well as bonuses scattered on the board. Collect keys, break through frozen and stone balls, shoot the lightning to unleash a bubble avalanche or burst virus bubbles as you try to beat your friends' score!<br/><br/>Bubble Shooter features:<br/><br/>-Make your way through multiple puzzle levels<br/>-Enjoy classic arcade bubble shooter gameplay in Collector and Sniper modes<br/>-Tailor game difficulty to your matching skills<br/>-Challenge your friends and share your achievements<br/>-Customize bubble skins and backgrounds in this bubble shooter game<br/><br/>The fans of classic bubble shooter games may choose between Collector and Sniper modes. Sniper mode obliges you to consider every single tap. Improve your shooting and targeting abilities: the fewer shots you make, the higher score you get.<br/>Collector mode is a bubble shooting game with the aim is to get the highest possible score. When you miss to burst bubbles a number of times the row moves down. Bounce marbles with similar colors line-by-line until nothing is left. Explode all of them and collect the highest score.  In a word, if you enjoy bubble games, this arcade is sure to absorb you!<br/><br/>All rights to Bubble Shooter™ are owned by Ilyon Dynamics Ltd.", "metacritic": null, "released": "2010-07-06", "tba": false, "updated": "2019-08-02T04:29:43", "background_image": "https://media.rawg.io/media/screenshots/4f6/4f611be7b2f80fef26d743f24c730b29.jpg", "website": "http://absolutist.com/iphone/bubble_shooter/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 30, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Absolutist"], "genres": ["Arcade", "Casual", "Puzzle"], "publishers": ["Absolutist"], "esrb_rating": "Everyone 10+"}