{"id": 219853, "slug": "mysteriez-find-hidden-numbers", "name": "Mysteriez: Find Hidden Numbers", "name_original": "Mysteriez: Find Hidden Numbers", "description": "Mysteriez: Hidden Numbers, the game that have proved a hit. It's free to start and need no foreign language knowledge. The items to find are simply 40 cleverly hidden numbers. You have only 5 minutes to spot as many as possible and prove your seek-and-find talents. With 2000 items to find, family-friendly gameplay and artwork Mysteriez: Hidden Numbers has something for everyone!<br/><br/>Discover 40 hidden numbers in each of 90 beautiful locations. This game is free and easy to understand. No special language skills needed!  <br/>Mysteriez: Hidden Numbers offers a long lasting journey through eye captivating scenes accompanied by pleasant music<br/><br/>TRY IT FREE, THEN UNLOCK THE FULL ADVENTURE FROM WITHIN THE GAME!<br/><br/>Challenge your seek &amp; find skills with 8 thematic packs in this awesome Hidden Object puzzle!<br/> <br/>Features:<br/><br/>● No language skills needed<br/>● 3200+ items to find<br/>● 90 levels to explore<br/>● Enjoy pleasant music and fantastic visuals<br/>● Get powerful hint upgrade<br/>● ABC family-friendly game<br/>● Addicting Hidden Object gameplay<br/>● See how high you can score and submit your results to global leaderboards <br/><br/>Make learning a joy! <br/><br/>This is a great example of ABC family games and an exciting way for kids to get basic math skills. Though the game is quite a challenge for everyone, you can play it with your children to learn numbers and develop attention.<br/><br/>The game is free to start. If you enjoy, buy more thematic packs and unlock 5 free levels as a bonus! Be quick to get time bonuses and submit your score to global leader board. Examine the tiniest details, zoom in and out and tap 40 hidden numbers on every location. Icons on the frame will show what is yet to find. Be quick to gain extra score and accurate enough as every mishit results in time penalty. You have only 5 minutes to cope with your task and prove your i spy talents.<br/><br/>Mysteriez: Hidden Numbers grants a great opportunity to learn while playing. Launch your expedition to discover hidden wonders as you travel through time and space. Be the first to unravel top unsolved mysteries!<br/><br/>► Discover 70+ great games and apps for kids from Absolutist, including:<br/><br/>◊ Revenge of the Spirit: Rite of Resurrection HD <br/>◊ City of Fools: Hidden Objects Adventure <br/>◊ Time Gap: Hidden Object Mystery<br/>◊ Who Am I: Hidden Object Adventure<br/>◊ Bon Voyage: Hidden Object<br/>◊ Animal Hide and Seek: Hidden Objects <br/>◊ Royal Express: Hidden Object Adventure <br/>◊ Animal Hide and Seek: Hidden Objects <br/>◊ ABC Mysteriez: Hidden Letters Free<br/><br/>Become our fan on Facebook: http://facebook.com/Absolutist.games<br/>Follow us on Twitter: https://twitter.com/absolutistgame<br/>Visit our site: http://absolutist.com", "metacritic": null, "released": "2011-03-18", "tba": false, "updated": "2019-08-02T04:29:34", "background_image": "https://media.rawg.io/media/screenshots/3f5/3f5ee82214624ef6225f46b41d80aa73.jpg", "website": "http://absolutist.com/iphone/mysteriez/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 315, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Absolutist"], "genres": ["Adventure", "Puzzle"], "publishers": ["Absolutist"], "esrb_rating": "Everyone 10+"}