{"id": 219857, "slug": "abc-mysteriez-hidden-objects", "name": "ABC Mysteriez: Hidden Objects", "name_original": "ABC Mysteriez: Hidden Objects", "description": "ABC Mysteriez is a free hidden object game, where hidden objects are letters of English alphabet. <br/><br/>TRY IT FREE, THEN UNLOCK THE FULL ADVENTURE FROM WITHIN THE GAME! <br/><br/>Go on adventure through epochs as you search for hidden letters in fascinating locations. Bring back the sweetest memories kept on the pictures of a large family album. Find the alphabets blended with the scenery end experience free seek &amp; find fun with this unbelievable hidden object game.<br/><br/>Game feature:<br/><br/>- pure hidden object game<br/>- no language skills needed<br/>- 70 unique locations<br/>- 1500+ objects to find<br/>- awesome graphics and sounds<br/>- additional level packs<br/>- blitz game mechanics<br/>- global leader boards<br/><br/>Alphabet of Mystery<br/><br/>Streets, stations, mystery castles and a great number of other spectacular locations make exploring fun and amusing. No additional rules and boring crossword descriptions, no language skills required, just letters! Sumptuous graphics cleverly masks hidden treasures: alphabets. Be attentive to every detail, zoom in and out to find 26 hidden letters on every location. Special icons indicate your game progress. Be quick and precise to complete your quest for fun in 5 minutes. Download ABC Mysteriez and start to improve your hidden object skills! <br/><br/>This game is free to start. If you enjoy — feel free to buy more level packs: Flashbacks, Hobby, Retro! Be quick to get time bonuses and submit your score to global leader board!<br/><br/>► Discover  70+ great games and apps for kids from Absolutist, including: <br/><br/>◊ Mysteriez: Hidden Numbers<br/>◊ Time Gap: Hidden Object Mystery<br/>◊ Hidden Objects: Twilight Town<br/>◊ Twisted Worlds: Hidden Objects<br/>◊ Crime City: Hidden Object<br/>◊ Boxie: Hidden Object Puzzle<br/>◊ Bon Voyage: Hidden Object<br/><br/>Become our fan on Facebook: http://facebook.com/Absolutist.games <br/>Follow us on Twitter: https://twitter.com/absolutistgame <br/>Visit our site: http://absolutist.com", "metacritic": null, "released": "2011-08-09", "tba": false, "updated": "2019-08-02T04:29:36", "background_image": "https://media.rawg.io/media/screenshots/e1e/e1e319d7fa60a165b94ab4f9b47b19b8_2dZE9WW.jpg", "website": "http://absolutist.com/iphone/mysteriez-abc/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 286, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Absolutist"], "genres": ["Adventure", "Puzzle"], "publishers": ["Absolutist"], "esrb_rating": "Everyone 10+"}