{"id": 219864, "slug": "time-gap-hidden-objects", "name": "Time Gap: Hidden Objects", "name_original": "Time Gap: Hidden Objects", "description": "*** The best hidden object game of 2017! ***<br/>The world's greatest mystery is waiting for you. Only you can solve the secret of sudden disappearance of the mankind. The spirits of the greatest people in the human history are there to help you. Explore vivid locations all over the Earth, unveil the mystery, conduct your own investigation!<br/><br/>Imagine a sunny day and a cozy Parisian cafe. People walking around, drinking coffee and laughing. Suddenly, a bright flash wipes out all life on the Earth. There's no soul around, but empty houses and deserted streets. Everything remains as it was, but people are gone. What have happened and where has the humanity disappeared? As the main character you have to solve the mystery and save the world!<br/><br/>While playing the game you will unravel curious facts about Alexander the Great, Cleopatra, Napoleon, Lincoln and Einstein as you try to save the day. Travel around the world with the help of an interactive map, complete multiple tasks, assemble diverse collections and engage in numerous mini-games. It's time to challenge the destiny!<br/><br/>Features:<br/><br/>- Complete countless tasks and play for months;<br/>- Chase the fire storm on the map and play exciting Bubble Shooter mini-game;<br/>- Snooker mini-game is available! Clear the field to overcome the hurricane; <br/>- Start fighting with storm to play Match 3 mini-game;<br/>- Try your luck in Cleopatra's and Einstein's casinos any time;<br/>- Attention! UFO has arrived to Earth! You can find it on the map;<br/>- Experience diverse hidden object gameplay;<br/>- Discover interesting facts about the outstanding personalities.<br/><br/>The age of wonders<br/>Following the storyline you will travel across the globe and explore various hidden object locations. Thus you raise your skill level and gain experience to unlock more spots on the interactive map. Various anomalies and natural disasters diversify the gameplay, so sometimes you will have to complete the HO scenes in pitch darkness, or face the item list with mixed letters. Don't give way to despair – all kinds of power-ups will let you cope with any trouble your encounter!<br/><br/>Scouring hidden object locations you will also come across numerous collectibles and special items. These are needed to comply with the requests of the wraiths who will guide you through this exciting adventure. Your diary will keep track of all the given tasks, because there may be a few of them at a time. Check it regularly, and learn interesting facts about your haunted companions and key information on the game story to finally return the Earth to the humanity. <br/><br/>► Discover more great games from Absolutist, including:<br/><br/>◊ Hidden Numbers: Twisted Worlds<br/>◊ Hidden Objects: Twilight Town<br/>◊ Spirit of the Ancient Forest<br/>◊ Secret Europe: Hidden Object Adventure<br/>◊ Boxie: Hidden Object Puzzle<br/>◊ Crime City Detective: Hidden Object<br/>◊ Bubble Shooter: Classic Arcade Game <br/>◊ Kingdom of Aurelia: Mystery of Poisoned Dagger <br/>◊ Witch's Pranks: Frog's Fortune Adventure <br/>◊ Revenge of the Spirit: Rite of Resurrection HD <br/><br/>Become our fan on Facebook: https://www.facebook.com/TimeGapCommunity/<br/>Follow us on Twitter: https://twitter.com/absolutistgame<br/>Visit our site: http://absolutist.com", "metacritic": null, "released": "2014-04-11", "tba": false, "updated": "2019-08-02T04:29:39", "background_image": "https://media.rawg.io/media/screenshots/5f1/5f1b7c8d6b80ac26e885111f468993ea.jpg", "website": "http://time-gap.com/en/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 525, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Absolutist"], "genres": ["Adventure", "Puzzle"], "publishers": ["Absolutist"], "esrb_rating": "Everyone 10+"}