{"id": 21983, "slug": "icarus-starship-command-simulator", "name": "Icarus Starship Command Simulator", "name_original": "Icarus Starship Command Simulator", "description": "In the future, a large star is about to go supernova and destroy all life - unless someone can find a way to stop it. But in order to get to the star, they will have to traverse a large region of space full of hostile aliens and dangerous phenomenon.<br/>\n<br/>\r\nFeatures:<br/>\r\nIntense Strategic Gameplay - Command your ship and crew in real time to survive alien attacks and dangerous phenomenon. Manage power, sacrifice crew, board enemy ships - all and much more will be required in order to survive.<br/>\n<br/>\r\nFirst Person Perspective - Unlike many other games in the genre - this one is about commanding a ship from a first person perspective. You can be killed by a hostile boarding party or if the ship you are aboard is destroyed.<br/>\n<br/>\r\nSmart Enemies - Each hostile ship you face is controlled by another captain and crew just like your own. They will struggle to defeat you.<br/>\n<br/>\r\nRandomized galaxy - Each play-through will feature different enemy ships, events and tough decisions. You will have to be adaptable and think on your feet to survive.<br/>\n<br/>\r\nMany Different Ships - There are over 50 different ships and spacestations from 9 different species. Each can be boarded and explored.<br/>\n<br/>\r\nText Based Choices - There are over a hundred different text based encounters that will affect your crew, ship and resources.<br/>\n<br/>\r\nUpgradeable Ships - You have limited resources and you will have to decide what are the most important parts of your vessel to upgrade or repair.", "metacritic": null, "released": "2017-05-26", "tba": false, "updated": "2019-08-28T22:07:49", "background_image": "https://media.rawg.io/media/screenshots/6f0/6f076468824d43fd0d0930381dc9d88c.jpg", "website": "http://www.midwestvideogames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 21}, "playtime": 3, "achievements_count": 24, "ratings_count": 0, "suggestions_count": 241, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Midwest Video Games"], "genres": ["Action", "Strategy", "Simulation", "Indie"], "publishers": ["Midwest Video Games"], "esrb_rating": null}