{"id": 21997, "slug": "grisaia-phantom-trigger-vol2", "name": "Grisaia Phantom Trigger Vol.2", "name_original": "Grisaia Phantom Trigger Vol.2", "description": "\"Grisaia: Phantom Trigger\" is a visual novel. More specifically, it is a kinetic novel, without any branching routes. Returning character artist Akio Watanabe and writer Ryuta Fujisaki bring you the latest installment in the acclaimed Grisaia series, \"Grisaia: Phantom Trigger\".<br/>\n<br/>\r\nStory:<br/>\n<br/>\r\n5:30 AM - U__ Harbor, K__ Prefecture.<br/>\r\nA VIP arriving from abroad mysteriously disappears in transit. The SORD team at Mihama Academy (Rena, Tohka, Chris, and Murasaki) are presented with a new mission: finding and recovering him.<br/>\r\nWhenever they appear to be closing in on this missing \"package\", though, it somehow slips through their fingers.<br/>\n<br/>\r\nAccompanying them on their mission are two fellow SORD members from the Kyousen Sakuragaoka campus - twin sisters, who both help and hinder the crew.<br/>\r\nThere have also been rumors floating around of a daredevil biker named \"Soul Speed\", who tears up the streets at night. What role might she play in this escapade?<br/>\n<br/>\r\nBefore long, the team's thrilling chase descends into a deathmatch, pushing the combatants to their limits and beyond. Rena and Haruto, meanwhile, are taken on a journey deep into the past, to their first ever encounter.<br/>\n<br/>\n<br/>\r\n\"What are you good at?\"<br/>\r\n\"I'm just a crybaby and a wimp... All I can do is kill...\"<br/>\n<br/>\r\n\"Do you plan on buying me...?\"<br/>\r\n\"If the price is right.\"<br/>\n<br/>\r\nDid Haruto really show Rena the path to salvation? Or is she on the road to hell...?", "metacritic": null, "released": "2017-04-27", "tba": false, "updated": "2019-08-28T22:07:48", "background_image": "https://media.rawg.io/media/screenshots/75d/75d2905c4599d21d1279a29d755fd881.jpg", "website": "http://grisaia-pt.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 6, "owned": 26, "toplay": 1}, "playtime": 7, "achievements_count": 14, "ratings_count": 0, "suggestions_count": 342, "game_series_count": 18, "reviews_count": 0, "platforms": ["PC"], "developers": ["Frontwing"], "genres": ["Adventure", "Casual"], "publishers": ["Frontwing USA"], "esrb_rating": null}