{"id": 22, "slug": "farpoint", "name": "Farpoint", "name_original": "Farpoint", "description": "<p>Farpoint is a riveting VR space adventure set on a hostile alien planet. On a mission to pick up scientists studying an anomaly near Jupiter, a sudden rupture nearby sends you and their station crashing onto an unknown alien world.<br />\nSeparated from your colleagues, you must use holographic logs scattered throughout the landscape to reunite with the scientists and escape the planet. Explore and discover the secrets of the planet, blasting your way through hordes of indigenous and alien life as you keep moving to survive.<br />\n•    Experience a full-length single player campaign as you traverse an unnerving alien world, searching for survivors and a way home.<br />\n•    Master various weapons – from charged plasma rifles to a railgun - in the fight through packs of hostile alien life.<br />\n•    Explore and fight together with a friend in 2 player online co-op.<em><br />\n</em>Active PS Plus membership required.<br />\nVR Games may cause some players to experience motion sickness.<br />\nUse of PSN and SEN account are subject to the Terms of Service and User Agreement and applicable privacy policy (see terms at sonyentertainmentnetwork.com/terms-of-service &amp; sonyentertainmentnetwork.com/privacy-policy).<br />\nOnline features may be terminated at any time.<br />\n*Online multiplayer requires a PlayStation®Plus membership.<br />\nOnline Play (Optional)<br />\nPlayStation®VR Required<br />\nPlayStation®Camera Required<br />\nEnhanced play with 1 PS VR Aim controller<br />\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service &amp; playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.<br />\nPlaystation®4 system, PlayStation®VR and PlayStation®Camera are required to experience VR functionality.<br />", "metacritic": 71, "released": "2017-05-16", "tba": false, "updated": "2023-12-09T15:02:10", "background_image": "https://media.rawg.io/media/games/fd3/fd3ba352de494fe390dfe53d326c646a.jpg", "website": "https://www.playstation.com/en-us/games/farpoint-ps4/", "rating": 3.49, "rating_top": 4, "added_by_status": {"yet": 29, "owned": 375, "beaten": 28, "toplay": 12, "dropped": 32, "playing": 6}, "playtime": 0, "achievements_count": 235, "ratings_count": 88, "suggestions_count": 385, "game_series_count": 0, "reviews_count": 89, "platforms": ["PlayStation 4"], "developers": ["Impulse Gear"], "genres": ["Shooter"], "publishers": ["Sony Computer Entertainment"], "esrb_rating": "Mature"}