{"id": 220067, "slug": "bike-race-free-top-motorcycle-racing-games", "name": "Bike Race Free - Top Motorcycle Racing Games", "name_original": "Bike Race Free - Top Motorcycle Racing Games", "description": "Bike Race is one of the best racing game on Android! Race and have fun against millions of players. Bike Race is one of the top-rated free games! And it's free! Speed up the wheels and get ready for fun!<br/><br/>Addictive racing gameplay<br/>- New game mode: Tournaments!<br/>- Race against millions of users on multiplayer<br/>- Train on single player to improve your skills<br/>- Fun guaranteed<br/>- Simple and intuitive driver controls<br/>- Challenge your facebook friends<br/>- Play without wifi<br/><br/>Amazing features<br/>-Hundreds of crazy tracks and mad worlds<br/>-Cool stunts<br/>-Tons of amazing bikes<br/>- Don't miss the free updates with lots of new content<br/><br/>Forget those dumb drag car racing games. To become a master motorcycle, skills matter (a lot). As they say: no pain, no gain! So, start practicing right now to become a pro bike racer and rule them all. It will be addicting, we guarantee fun at the tip of your finger!<br/><br/>Bike Race is brought to you by Top Free Games - the creators of the addicting game: Racing Penguin.<br/><br/>● Details about user created levels<br/>If you want to play more than 3 featured user created levels per day, you will need to buy a level pack. You can play unlimited free levels created by you or your friends if you have their codes. You can also play unlimited free levels shared publicly on the internet by other users. Levels can not be created on a mobile device. To create a level, surf to https://www.bikerace.com<br/><br/>● Play it anywhere<br/>Bike race free does NOT require any internet connection. you can have fun racing in the subway, while flying on a (real) plane, in the car on the road, during services in a temple (or maybe even on the toilet!)<br/><br/>● Low data usage<br/>This free game will not consume tons of data from your mobile plan that you'd want to use instead to surf the web, watch youtube videos and listen to free music<br/><br/>● Compatibility and support<br/>We're continuously working (hard) so that all Android phones and tablets run the game smoothly. please report any issue you may experience to support+bikeraceandroid@topfreegames.com<br/><br/>● Age rating disclaimer<br/>It does NOT contain violence nor any other mature content. it's just a simple and straightforward racing game. Feel free to play it with your friends and have fun as if you were children and boys. We bet it will be fun and you're gonna love it!<br/><br/>● Privacy policy<br/>https://www.topfreegames.com/games/bikerace/legal/privacy", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-30T04:15:57", "background_image": "https://media.rawg.io/media/screenshots/f3f/f3fbaabec96ed02e108b93eaeb87e071.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 97, "game_series_count": 0, "reviews_count": 1, "platforms": ["Android"], "developers": ["Top Free Games."], "genres": ["Racing"], "publishers": [], "esrb_rating": "Everyone"}