{"id": 220139, "slug": "fruit-cube-blast", "name": "Fruit Cube Blast", "name_original": "Fruit Cube Blast", "description": "<p>Tap, blast, crush, kaboom!<strong> Fruit Cube Blast is an exciting game about exploding colorful blocks and making crazy matches in a wild world of amazing characters!</strong><br/><br/>Embark upon a fantastic adventure as you solve tons of juicy puzzles. All you have to do is tap to match the colored fruit blocks on the screen. Make bigger matches and you'll create sweet power-ups, perfect for making some fresh explosions across the screen! Clear each puzzle by blasting the pieces away, then use your matching skills to take on the next level.<br/><br/><strong>Fruit Cube Blast lets you pop, crush, and blast tons of different blocks, but if you're smart you'll solve the puzzles by creating fun combos.</strong> Each puzzle is filled with colliding fruits and other objects. Make clever taps, match the right blocks, and crush the color cubes with enough skill and you'll create new and exciting power-ups and clear the screen with amazing combos. Now that's what we call awesome!<br/><br/> <strong>Fun features include:</strong><br/>✔️ Match, tap, and blast through tons of fruit puzzles.<br/>✔️ Unleash wild power-ups to free all the cute characters.<br/>✔️ Compete against your friends via Facebook.<br/>✔️ Easy to play, but tough to master!<br/><br/><strong>Colorful power-ups are waiting to be popped in this crazy puzzle matching adventure.</strong> You can also unlock insane gifts, defeat weird looking worm enemies, and meet friendly characters on your long and challenging adventure.<br/><br/><strong>Remember: </strong>the more you match, the better your score. Try to complete huge combos to earn extra special bonuses, including screen smashing power-ups and block blasting new items! Indulge your sweet tooth with Fruit Cube Blast, the most colorful and craziest matching game around!</p>", "metacritic": null, "released": "2017-12-06", "tba": false, "updated": "2019-10-22T14:01:52", "background_image": "https://media.rawg.io/media/screenshots/d27/d27e49f9d15b4c8b6e32ea423096af82.jpg", "website": "http://www.rvappstudios.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 100, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["RV AppStudios"], "genres": ["Family", "Puzzle"], "publishers": ["RV AppStudios"], "esrb_rating": "Everyone 10+"}