{"id": 220181, "slug": "yummy-island", "name": "Yummy Island", "name_original": "Yummy Island", "description": "🍬 Yummy Island – Enjoy the Candy App 🍬<br/><br/>Welcome to the sweetest island in the world! On Yummy Island, a floating isle high above the clouds, you'll find a dazzling variety of tasty treats. Ice cream, lollipops, chocolate, cookies, macarons, candy canes, gummy bears and candies galore! Experience a delightful 3D tycoon in candy heaven.<br/><br/>Meet the Fluffies. These cute little creatures have a knack for making sweets. Sugary-sweet puffs with ice-cream cones and macarons on their head, they'll churn out gourmet goodies for you on your candy farm on Yummy Island. Supply them with home-grown fruits and vegetables, and they'll give you the tastiest treats on the planet. In the universe even! Customers will come to your fantasy farm from every corner of the universe to sample your ice cream creations and crunch cookies. Bobbing around in little UFOs, they'll wait patiently for you to fill their candy orders. <br/><br/>Expand your Yummy Island and experience an extraordinary game that combines fantasy farm features with unique customization options. <br/><br/>🍭 Candy and sweet treats such as macarons, candy canes, lollipops, licorice, chocolate and cookies<br/>🍭 Captivating quests and tasks for your Fluffies on their candy farm<br/>🍭 A wide variety of production buildings, from a bakery and jam store to a kitchen and pastry shop, where you can make exquisite specialties<br/>🍭 Expansion options for your Yummy Island<br/>🍭 Countless decorations to spruce up your flying island, from trees and rocking chairs over hydrangeas and tables to fountains and pavilions<br/>🍭 Entertaining candy game play with quirky cartoon graphics<br/>🍭 Long-lasting fantasy farm fun with lots of levels<br/>🍭 Numerous customer orders<br/><br/>Yummy Island – Off to the Candy Farm!<br/><br/>Let yourself be enchanted by Yummy Island. Soar into a most fascinating game world and design your flying island according to your every wish. Decorate it with daisies, sunflowers, haybales and roses. Plant fruits and vegetables. Harvest your produce and let your Fluffies process them into tasty treats such as chocolate, cookies, and lollipops on your candy farm. Supply your customers, earn in-game money and expand your fantasy farm island!", "metacritic": null, "released": "2018-05-11", "tba": false, "updated": "2019-08-02T03:17:12", "background_image": "https://media.rawg.io/media/screenshots/384/384a1e872ae3d78cae6b3cb2ecb4a40d.jpg", "website": "http://apps.upjers.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 192, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Upjers"], "genres": ["Simulation", "Casual"], "publishers": ["Upjers"], "esrb_rating": "Everyone 10+"}