{"id": 220195, "slug": "call-of-dutyblack-ops-zombies", "name": "Call of Duty:Black Ops Zombies", "name_original": "Call of Duty:Black Ops Zombies", "description": "We want to thank you for being valued fans and let you know that as of July 25, 2018, Call of Duty: Black Ops Zombies will no longer be available to play in EU Countries.<br/><br/>***Now compatible Android M (6.0) ***<br/><br/>The Call of Duty: Zombies phenomenon has risen back to life.<br/><br/>Adapted from the best-selling console hit and built specifically for tablets and smartphones, Call of Duty: Black Ops Zombies delivers fan-favorite, heart-pounding maps: Kino Der Toten, Ascension, and Call of the Dead: Director’s Cut, as well as “Dead-Ops Arcade,” a 50-level zombie gauntlet that provides the ultimate undead challenge for fans of Call of Duty’s signature zombie warfare.<br/><br/>Play solo or join a team of up to 4 players via Wi-Fi as you mow down hordes of zombies using a variety of weapons and perks only available in the Call of Duty zombie experience. <br/><br/>And don’t just take our word for it; here is what critics think of the game:<br/><br/>•\t“Call of Duty: Black Ops Zombies is a must-have for any Call of Duty fan and for everyday gamers alike.” – Mashable.com<br/><br/>•\t\"As far as the whole package is concerned, I adore the Dead Ops Arcade mode and feel it adds significant value to the $6.99 price tag\" – Destructoid<br/><br/>•\t“Dead Ops…a perfect fit for the mobile platform.” – G4 TV online<br/><br/>Players can also opt to enhance their experience and get out of a jam with the in-game CoD Point System. With six tiers of in-app purchasing options to choose from, Zombies fans will be able to take their experience to a whole new level by unlocking additional areas and securing better weapons in much less time.  Please note that CoD points are only applicable in single player.<br/><br/>•\tBuy CoD points in the Main Menu to use when you run out of earned points in-game.<br/>•\tCoD points can be spent on anything in the game such as reviving, opening doors, weapons, perks, and the mystery box but are only used when you do not have enough earned points.<br/>•\tRevives can also be bought with CoD points if you die without the revive perk, although the three revive limit still applies.<br/>•\tNote: Your CoD points will be lost if the app is uninstalled from your device.<br/><br/>Sure, earning Achievements and Point-Multipliers is nice, but to survive these Co-Op Maps, you’ll need friends as much as you’ll need firepower. Lucky for you, not only will the weapons and perks you love from Call of Duty lie at your fingertips, you can join with up to 4 players via Wi-Fi to play mulitiplayer. <br/> <br/>As if that wasn’t enough, Call of Duty: Black Ops Zombies also includes “Dead-Ops Arcade” mode, an arcade-style top-down shooter perfectly suited for mobile combat vets. Unlocking the mode is easy—simply find the four missing coins in the game’s menus.", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-30T18:36:09", "background_image": "https://media.rawg.io/media/screenshots/e17/e178d96cbb07967da8b8b6e8ceeac9ef.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 250, "game_series_count": 0, "reviews_count": 1, "platforms": ["Android"], "developers": ["Activision"], "genres": ["Action"], "publishers": [], "esrb_rating": "Teen"}