{"id": 220113, "slug": "huuuge-casino-slot-machines-free-vegas-games", "name": "Huuuge Casino - Slot Machines & Free Vegas Games", "name_original": "Huuuge Casino - Slot Machines & Free Vegas Games", "description": "THE #1 SOCIAL CASINO<br/><br/>Join the world’s biggest casino community with SLOT MACHINES HUUUGE CASINO. Play the best free slot casino, compete in leagues, join clubs and have great fun - Las Vegas style. SLOT MACHINES HUUUGE CASINO is the ultimate free slots casino experience! SLOT MACHINES HUUUGE CASINO lets you play over 100 TOP FREE CASINO SLOT MACHINES, POKER, BACCARAT, ROULETTE and many other free casino games! Download Slot Machines Huuuge Casino now - The #1 free slots casino on mobile!<br/><br/>Play the best Free Slots on the market!<br/><br/>SLOTS™ HUUUGE CASINO offers the best Free Slots in the world, from retro classics to modern slot machines, you’re sure to find slots that will fit your fancy!<br/><br/>Our collection of slots includes:<br/>🎰 Huuuge Diamond Wins – Spin the Wheel of Wins to win billions of Chips.<br/>🎰 Aztec 2: Eclipse – Discover the secret wins hidden in the Sun and Moon temples.<br/>🎰 Respin Ranch – Check out the richest animals and hit massive wins!<br/>🎰 Cash Madness – Hit Huuuge Jackpots in this classic king of Slot Machines!<br/>🎰 Blaster Cats vs Aliens – Get up to 100 Free Spins… IN SPACE!<br/>🎰 Buffalo Rush – Your screen will shake from the massive wins you will hit in this!<br/>…and many more slots, including classic slots, modern slots, social slots and slots that include very special bonus games!<br/><br/>The biggest Jackpot of them all!<br/><br/>Play HUUUGE LINK – a set of four free slots that share a truly HUUUGE Grand Jackpot to see how easy it is to win massive Jackpots in no time! Prepare to be amazed by the wonders of Ancient Egypt and China in this amazing free casino slot machine adventure.<br/><br/>Join a Club and compete in the Billionaire League!<br/><br/>The Billionaire League is an amazing place where you can play free slots with your friends in order to compete for the best prizes and earn your bragging rights against the top spinners in the world to prove who’s king of the free casino!<br/><br/>♥️ Join your friends in a Club, or create a Club of your own<br/>♥️ Meet awesome new people and spin together<br/>♥️ Win awesome rewards for your dedication<br/>♥️ Spin your Club to Masters League glory on free slots.<br/><br/>It’s not just Slot Machines<br/>Huuuge Casino offers way more than Free Slots! If you’re not a slot maniac, we have other free casino games that we’re sure will give you that same winning thrill!<br/>♠️ Video Poker – Awesome, engaging, with multiple variants, an awesome alternative to slot machines!<br/>♠️ Sit’n’Go Hold’em – Play thrilling tournaments!<br/>♠️ Roulette – Place your bets and win big!<br/>♠️ Baccarat – Get some old school wins!<br/><br/>Awesome Bonuses<br/>Huuuge Casino offers many ways to win big on top of the Free Slots!<br/>🎁 Get the Betty Bonus in the Lobby every 15 minutes!<br/>🎁 Visit the Shop every day to collect an additional bonus!<br/>🎁 Play the Lottery to win massive prizes!<br/>🎁 Participate in Daily Free Casino Giveaways on our Facebook page and via Push Notifications!<br/><br/>Install now to receive a Huuuge Welcome Bonus and start playing free slots now!<br/><br/>Read our Terms of Use (www.huuugegames.com/terms-of-use), Privacy Policy (www.huuugegames.com/privacy-policy) and other important information.<br/><br/>Our games are for entertainment only. All points in the game stay in the game and all game points have no cash value. Although in-game currency can be purchased for real money or won during gameplay, none of the items in the game have any cash value. Our games are intended for adult audiences only.<br/><br/>► The game is intended for a mature audience.<br/>► The game does not offer real money gambling or an opportunity to win real money or real prizes.<br/>► Wins made while gambling in social free casino games can't be exchanged into real money or real rewards.<br/>► Past success at social free casino gambling has no relationship to future success in real money gambling.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:09:15", "background_image": "https://media.rawg.io/media/screenshots/cc8/cc8387d7a96a70501e437ce1c0ce0ebf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 133, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Huuuge Global"], "genres": [], "publishers": [], "esrb_rating": null}