{"id": 220158, "slug": "zombie-shooter-defense-shoot-kill-zombies", "name": "Zombie Shooter Defense - Shoot & Kill Zombies", "name_original": "Zombie Shooter Defense - Shoot & Kill Zombies", "description": "You are humanities last hope against zombie domination. You are a trained zombie killer! Use all your specialized skills to survive the onslaught of enemy zombies and avenge other fallen heroes. Get ready to utilize stockpiles of powerful weapons, supercharge them with upgrades and build up your defenses. Survive at any cost, kill zombies, and save the world.  Simple!<br/><br/>Tsunami of zombies have destroyed the planet, and zombie anarchy has taken over.  Your task is to defend against zombies and survive, you are the last hero. You have to use your zombie shooting skills, zombie survival skills, and become a ruthless zombie destroyer. Every city is filled with a swamp of bloody zombies, so the battle will be intense as you defend against these scary monsters.  Use your killer guns (machine gun, bazooka, grenade, shot gun, sniper gun, laser gun, flame thrower and more) to annihilate these killer zombies. You will have your zombie defense wall, guns, and some zombie killing surprises along the way to help you. We are with you, show the world why you are the last hero and best zombie shooter. <br/><br/>★Zombie Shooter Defense - Features ★<br/>✔️ 3 Thrilling Game Modes<br/>✔️ 5 Urban Area Backgrounds<br/>✔️ 3 Powerful Heroes to Kill Zombies<br/>✔️ Tons of Deadly Zombies <br/>✔️ Destructive Killer BOSS Zombies<br/>✔️ Explosive Weapons &amp; Guns<br/>✔️ 100+ Challenging Levels<br/>✔️ Regular Updates to Zombie Shooter Defense<br/><br/>Stop waiting and start downloading the best tower defense game today.  While you wait for the zombie game to download, remind yourself that you were born to do this my HERO. Whether you like defense shooting games or simply love to shoot zombies for fun, you will love being the Last Hero. Strategic tower defense shooting games have never been this fun and addicting! Victory &amp; glory awaits you my Hero! Download Zombie Shooter Defense today!<br/><br/>Have fun playing Last Heroes! Follow us to get news and updates:<br/>Facebook: https://www.facebook.com/RVAppStudios<br/>Twitter: https://twitter.com/RVAppStudios<br/>YouTube: https://www.youtube.com/c/rvappstudios", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:09:03", "background_image": "https://media.rawg.io/media/screenshots/caa/caa1fb60e266e3a89688966a05f78745.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 415, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["RV AppStudios"], "genres": ["Action"], "publishers": [], "esrb_rating": null}