{"id": 220160, "slug": "cat-safari-2", "name": "Cat Safari 2", "name_original": "Cat Safari 2", "description": "Cat Safari 🐈 The Evolution of Cat Games<br/><br/>Create cute cats in the colorful animal app Cat Safari. Mysterious crates seem to appear regularly on a large abandoned field – and inside, each one holds an adorable kitten! Combining two of the same kind of cat yields something completely new – step by step, you'll be able to breed unique new breeds of cats. Experience the unique cat game and initiate a cat evolution of your very own!<br/><br/>Combine and Sell<br/><br/>Feline fanatics aren't the only ones who'll be scrambling to get more and more cats. Cat Safari lets you breed your own cats by combining cats of the same time to create ever larger and more exotic cats – driving the evolution from playful kittens into majestic lions.<br/><br/>Animal Fusion<br/><br/>This is how it works: On the lush green meadows of your smartphone or tablet screen, wooden crates will magically appear. Click them to see what kind of cat lurks inside. As soon as you've opened at least two crates with matching cats, you can breed them by swiping them together. Soon, you'll have created a brand-new breed of cat. And if your next crates contain the right type of cats, you can combine them again, and so on. Cat Safari's meow-nificent features include:<br/><br/>🐾 diverse breeds of cats that can be combined into new felines<br/>🐾 adorable animations and lovingly detailed graphics<br/>🐾 constant evolution<br/>🐾 spectacular opportunities to fuse cats from regular mixes over purebreds to big cats<br/>🐾 virtual customers seeking specific breeds<br/>🐾 sale of cats for in-game currency which you can use to customize your meadows<br/><br/>Meow! The Cats are Waiting!<br/><br/>Download the cat game Cat Safari for your smartphone or tablet. Dive into the fascinating world of cats. Become a master breeder and see what you can create!", "metacritic": null, "released": "2018-06-22", "tba": false, "updated": "2019-08-02T03:17:10", "background_image": "https://media.rawg.io/media/screenshots/8ce/8cef5cfea8e83006fee77cffbf3d5a46.jpg", "website": "https://m.upjers.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 178, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Upjers"], "genres": ["Casual"], "publishers": ["Upjers"], "esrb_rating": "Everyone 10+"}