{"id": 22013, "slug": "the-edgelands", "name": "The Edgelands", "name_original": "The Edgelands", "description": "The Edgelands is an atmospheric adventure set in the present day, based on real and imagined folklore.<br/><br/>Beginning in a house in the forgotten rural backwoods beyond the City, you soon find yourself exploring an uncanny rustic twilight landscape in which familiar rural landmarks overlap with otherworldly occurrences, creating a dream-like blurring of the ordinary and the supernatural.<br/><br/>The Edgelands is focused on exploration and atmosphere, not brain-taxing puzzles and inventory juggling. It is a sedate and eerie experience, with an ambiguous narrative designed to enhance the mood of dusky ramblings in mysterious places where urban and rural environments overlap.<br/><br/>An evocative electronic soundscape responds and adapts to your actions as you interact with the environment and it’s inhabitants.<br/><br/>The Edgelands is a proud recipient of funding from Fundbetter, the initiative set up by Failbetter Games, developers of Sunless Sea and Fallen London.<br/><br/><strong>\"Striking visuals and a killer soundtrack \" - PC Gamer<br/><br/>\"Superbly Evocative\" - Rock Paper Shotgun<br/><br/>\"A powerful, personal experience that is well worth spending a hazy evening with\" - IndieGames<br/><br/>\"Compelling and beautifully written\" - PC PowerPlay Magazine<br/><br/>\"One of the most creatively surreal and bizarrely enthralling indie games of the last several years \" - Starburst Magazine<br/><br/>\"The Edgelands knows the power of sound design\" - Kill Screen</strong><br/><br/>Soundtrack available here https://hoofus.bandcamp.com/releases", "metacritic": null, "released": "2017-05-09", "tba": false, "updated": "2019-08-28T22:07:48", "background_image": "https://media.rawg.io/media/screenshots/446/4469868aee2383391cbdb2fce881e1c6.jpg", "website": "http://www.marshlight.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 4}, "playtime": 1, "achievements_count": 24, "ratings_count": 0, "suggestions_count": 125, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Marshlight Software"], "genres": ["Adventure", "Indie"], "publishers": ["Marshlight Software"], "esrb_rating": null}