{"id": 220172, "slug": "my-little-farmies-mobile", "name": "My Little Farmies Mobile", "name_original": "My Little Farmies Mobile", "description": "My Little Farmies – Found your own Medieval Village<br/><br/>Dive into the colorful world of My Little Farmies Mobile. Experience day-to-day life in a medieval village as you tend to a rustic family farm run by the lovable Amos. Your tasks will include growing crops and feeding animals, serving customers and helping out the many virtual friends you will make in this quirky and entertaining farm game.<br/><br/>Fantastic Farm Game Fun<br/><br/>My Little Farmies Mobile lets you shape the idyllic life in your own village; determine what crops the Farmies will tend to on their family farm, and which artisans and craftsmen buildings will grace your streets. Individual products can be combined in a myriad of production chains, making anything from delectable delicacies to homemade clothes. Refine your goods and sell them to earn money for the upkeep and expansion of your village. My Little Farmies Mobile is chock-full of amazing features for your gaming pleasure:<br/><br/>• Tantalizing tycoon game features that allow you to build workshops and streets in your medieval village, manufacture high-quality goods, keep animals, harvest cereals, vegetables and fruit and complete exciting quests<br/>• Daily booster rewards for logging in<br/>• Amazing social gaming features – become friends with other players and help them on their farms<br/>• A charming farm game setting with intuitive game controls<br/>• Lovingly detailed graphics<br/>• Long-lasting fun through level-up rewards, unique challenges, seasonal events and more!<br/><br/><br/>Your own Personal Village\t<br/><br/>Let yourself be enchanted by the beautiful world of My Little Farmies mobile. Run a family farm and grow all sorts of plants. Nurture them with tender, loving care, and harvest your very own farm-fresh produce. Mill your wheat into flour, and use your flour to bake mouthwateringly delicious loaves of bread for your farm game customers. Game developer upjers will whisk you away to the Middle Ages with MyLittleFarmies Mobile, a tycoon game without equal.<br/><br/>Download Now<br/>Now you can download My Little Farmies Mobile in the store. My Little Farmies Mobile is a standalone game; linking an account to the eponymous cult browser game “My Little Farmies” is not possible. Come play now! All you need is a mobile device and a stable internet connection!", "metacritic": null, "released": "2016-11-22", "tba": false, "updated": "2019-08-02T03:17:06", "background_image": "https://media.rawg.io/media/screenshots/4d7/4d79f3a2fd3d7812779335bc14b2bb6b.jpg", "website": "http://upjers.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 262, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Upjers"], "genres": ["Action", "Simulation"], "publishers": ["Upjers"], "esrb_rating": "Everyone 10+"}