{"id": 220183, "slug": "chess-tactic-puzzles", "name": "Chess Tactic Puzzles", "name_original": "Chess Tactic Puzzles", "description": "Do you want to get better at chess, improve your tactical vision or simply train your brain? Then this app is the perfect choice for you!<br/><br/><br/>- You will play a huge collection of mates, endgame studies, opening traps and practical chess positions. Just like in real games, you never know what you will get.<br/><br/>- Your tactics rating will be constantly measured. The better you are, the harder the puzzles will get. You can also track your performance with a rating graph.<br/><br/>- The computer engine Stockfish 9 will help you analyze the puzzles. This chess engine is  much stronger than the best human chess grandmasters.<br/><br/>- A simple layout will let you focus on the important. Simply slide to the right with your finger to analyze the previous tactic puzzle.<br/><br/>It doesn’t matter if you are a beginner at tactics or a chess grandmaster, this app will keep you happy for a long time!<br/><br/><br/>With this app you can...<br/>- Play over 20,000 selected chess puzzles<br/>- Use a big board that covers the whole screen<br/>- See the opponent reply if you play a wrong move<br/>- Analyze the tactics with the chess engine Stockfish 9<br/>- Play without an Internet connection<br/>- Enjoy a wide variety of chess tactics for all difficulty levels<br/>- Keep track of your progress with a performance-based Elo rating", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:08:55", "background_image": "https://media.rawg.io/media/screenshots/10f/10fe3ed81c1172aecd23af6df9cf8956.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 64, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["TIMLEG"], "genres": ["Board Games"], "publishers": [], "esrb_rating": null}