{"id": 220241, "slug": "puxers-the-fun-brain-game", "name": "Puxers - The fun brain game", "name_original": "Puxers - The fun brain game", "description": "Simple action packed, bubble shooting, number matching, puzzle game that is easy to learn but hard to master.  Pull to aim and release to shoot. Use your skill and logic to match equal numbers to make higher numbered pucks.<br/><br/>You haven’t played anything quite like this game before - One-part bubble shooter, one-part air hockey, one-part billiards and pool mixed with the number merging fun of 2048 you won’t want to put this game down. <br/><br/>This unique mix of arcade gameplay, strategy and numbers is fun and will stimulate your brain. If you like to play with physics and ricochet games such as Bubble Witch Saga, Angry Birds, or Panda Pop then Puxers is for you. Do you like mind and number games like 2048? Play Puxers the digit-disc game that’s great for kids and adults.<br/><br/>The more numbers you match the higher your score and the more Crowns you collect. Collect Crowns to become the true Puxers King! But beware, more pucks will come your way while you clear the board. Plan your shots carefully and play it smart, or it’s game over.<br/><br/><br/>Features:<br/><br/>• Action bubble shooting play<br/>• Strategic number matching<br/>• Simple to learn and challenging to master<br/>• Stimulate your brain and Improve cognitive skills;<br/>• Makes learning simple math fun!<br/>• Strengthen your reaction time;<br/>• Challenge your friends and Compete on leaderboards to show off your skills;<br/>• Only the true Puxers King will emerge in the end.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:08:49", "background_image": "https://media.rawg.io/media/screenshots/181/181f8e5e6510b9d6b85fe4816fa73da7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 96, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Chartbuster Games"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}