{"id": 220220, "slug": "super-mega-dash", "name": "Super Mega Dash", "name_original": "Super Mega Dash", "description": "\"A wonderful platformer with oodles of content, Super Mega Dash is charming, challenging, and inventive. An essential addition to your collection.\" — Pocket Gamer — 8/10 'Silver Award'<br/><br/>\"An adorable fast-paced platformer that is packed with hours of replay value\" — 148Apps — 4.5/5 \"Editor's Choice\"<br/><br/>“Fantastic platformer” — iReviewT — 10/10 \"Editor’s Choice\"<br/><br/>Super Mega Dash is a frenetic, fun, fast platformer that oozes quality. Full of ideas and unexpected turns, it will have you hooked the moment you tap its beautifully formed icon!<br/><br/>Take control of our hero and dash into the trap-filled worlds of Super Mega Dash. It’s the classic left, right, jump controls but it a world turned, literally, on its head! Loads of inventive levels are served up each challenging you to find the exit – sounds simple until you factor in the deadly dashing hazards that litter the landscape.<br/><br/>TONS OF LEVELS<br/>3 huge worlds packed with challenges in either ‘Hard’ or ‘Easy’ flavours<br/><br/>I LOVE VIDEOGAMES<br/>Super Mega Dash is a love letter to the golden age of videogames with a whole world of ‘retro’ themed bonus levels but totally fresh gameplay<br/><br/>COLLECT EM’ALL<br/>Collect the mushrooms and purchase new characters like ‘Stickman’, ‘Superstar’ and ‘Zombie Boy’ as well as power-ups and unlocks<br/><br/>MISSIONS IMPOSSIBLE<br/>From warming up in Boot Camp to becoming an ‘Epic Gamer’, Super Mega Dash is packed full of missions that will keep you coming back for more!", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:08:52", "background_image": "https://media.rawg.io/media/screenshots/472/472978e07dee7ec6abde12f18cc5f32f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 160, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["PlayCreek"], "genres": ["Arcade"], "publishers": [], "esrb_rating": null}