{"id": 22026, "slug": "grisaia-no-rakuen", "name": "The Eden of Grisaia", "name_original": "The Eden of Grisaia", "description": "<p>This is the sequel to The Labyrinth of Grisaia. It is strongly recommended to play the first and second game before starting this.<br />\nHe thought life at the academy would never change.<br />\nEveryone marched forward in the same direction, matching step for step; before he knew it, he began to surrender to that illusion.<br />\nHe believed that he would only arrive at the same place if he continued down the same path as everyone else.<br />\nThen he realized.<br />\nJust as there are as many paths as there are people, no two paths are identical.<br />\n—&quot;Asako. I&#39;ve already saved the five of them, you know?<br />\nSo it&#39;s all right, isn&#39;t it...? It&#39;s all right... for me to die now, right?<br />\nI know that even if I save somebody, it doesn&#39;t mean I can erase my past.<br />\nStill, wouldn&#39;t it mean I can die with a smile on my face?&quot;<br />\n&quot;I might not be able to see those girls anymore.<br />\nBut at least those memories would stay in my heart forever.<br />\nStill, this unforgiving world isn&#39;t full of girls sweet enough to be satisfied by those words alone.&quot;<br />\nThat was the truth one young man finally understood...<br />\nThe final chapter in the Grisaia series, featuring Prologue De La Grisaia, a prologue set before Yuuji&#39;s arrival at Mihama; Blanc Aile no Tane, the overarching story&#39;s grand conclusion.</p>", "metacritic": null, "released": "2013-05-24", "tba": false, "updated": "2022-06-13T10:59:16", "background_image": "https://media.rawg.io/media/screenshots/745/7457aa69ea5f2fc5a190daab253628d2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 7, "owned": 35, "beaten": 1, "toplay": 2}, "playtime": 7, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 181, "game_series_count": 18, "reviews_count": 2, "platforms": ["PC", "PSP", "PS Vita"], "developers": ["Front Wing", "prototype"], "genres": ["Action", "Adventure", "Casual"], "publishers": ["Sekai Project", "PROTOTYPE", "Front Wing"], "esrb_rating": "Mature"}