{"id": 220256, "slug": "rocket-hero-cannon-shooter", "name": "Rocket Hero Cannon Shooter", "name_original": "Rocket Hero Cannon Shooter", "description": "Christmas Rocket Hero : Tiny Troopers Cannon Shooter <br/> Best New FREE Shooting Game for 2016<br/> Here comes Rocket Hero with Santa. Your boredom must die. <br/><br/>Rocket hero is a fun, addicting game with cool graphics and sounds. You need to have good aiming skills to win the game. Best of luck.<br/><br/>Gameplay<br/><br/>This Christmas play free, cool and fun arcade adventure game with your favorite character Santa Claus. Santa Claus is on his mission is to kill enemies. Rocket hero has a cannon with which you can aim and fire on the enemy, which gives you scores and coins. If the rocket strikes on enemy's head you get two points and if you hit headshot 3 times consecutively, then fever mode is activated in which you get 5 points for next shot. It's a War, no law zone. The enemy must die if you miss he'll kill Santa Claus, No other way.<br/> <br/><br/>How to play<br/>Tap and hold your finger on the screen, and rocket hero will start aiming his cannon, and when you release he'll fire. But you have to aim perfectly because you got only one chance, the cannon doesn't gets back once you've crossed your aim. So aim perfectly and then fire. <br/>Why play this game<br/>• Addicting Cannon Shooting game.<br/>• Only one Life to age excitement.<br/>• Fever mode for more score.<br/>• Cool graphics.<br/>• Do or Die.<br/>• One tap gameplay.<br/>• Endless level. Hero keeps running as you keep shooting<br/>• Its addicting, simple &amp; interesting.<br/>• Supports all Android Phones , HD devices and tablets.<br/>• 5 different characters to choose from.<br/><br/><br/>Game is completely FREE with no consumables, time, or upgrades to purchase. <br/>DOWNLOAD &amp; PLAY NOW FREE!", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:08:44", "background_image": "https://media.rawg.io/media/screenshots/739/739bd962d0f671ff16a8ab743a6537b5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 117, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Skycap"], "genres": ["Arcade"], "publishers": [], "esrb_rating": null}