{"id": 220214, "slug": "drift-max-world-drift-racing-game", "name": "Drift Max World - Drift Racing Game", "name_original": "Drift Max World - Drift Racing Game", "description": "Welcome to the next step on the evolution of the acclaimed drifting game series Drift Max! Throttle up and drift across amazing real life locations (Brooklyn, Moscow, Dubai) from around the globe in Drift Max World, a brand new drift racing game from the creators of the legendary drifting games - Drift Max and Drift Max Pro!<br/><br/>Featuring decked out drift cars, hardcore modifications and pilot customizations, Drift Max World is here to test your handbrake drifting ability. Choose your pilot, modify your drift racing car, pick either the exterior or interior view, and start drifting! Perform spectacular stunts, burn the asphalt and enjoy one of the best drifting games ever created! The world of drift racing awaits you!<br/><br/>- DRIVE CRAZY DRIFT MONSTERS<br/>- RACE IN WORLD FAMOUS CITIES<br/>- CUSTOMIZE AND MODIFY YOUR DREAM CAR<br/>- CAREER MODE<br/>- QUICK PLAY<br/>- CHOOSE YOUR PILOT AND OUTFIT<br/><br/>HUNDREDS OF CAR MODIFICATION OPTIONS<br/>- Full-body decal kits.<br/>- Two-tone and matte paint colors, crazy graphical racing decals.<br/>- Headlight colors.<br/>- Door and hood stickers.<br/>- Rim model and color.<br/>- Glass color.<br/>- Caliper color.<br/>- Wheel (Camber) angle.<br/>- Suspension height.<br/>- Spoiler models.<br/><br/>CHALLENGING CAREER MODE<br/>Start your drift racing journey and test your drifting skills through challenging drift race missions and earn awesome rewards such as custom drift racing cars.<br/><br/>NOTE: Drift Max World doesn't require an internet connection after installation! Long live offline games!", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:08:52", "background_image": "https://media.rawg.io/media/screenshots/3ed/3ed2f80e6f002fb5bad18d656a849f9f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 287, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Tiramisu"], "genres": ["Racing"], "publishers": [], "esrb_rating": null}