{"id": 220254, "slug": "kids-puzzles-animals-shapes-vehicles-cake", "name": "Kids Puzzles - Animals, Shapes, Vehicles, Cake", "name_original": "Kids Puzzles - Animals, Shapes, Vehicles, Cake", "description": "Kids Puzzles -  Animals, Shapes, Vehicles, Birds is a free educational game for your baby kids<br/><br/>Want to make your kid learn about animals, vehicles, sweets, flowers, birds, nature, sea animals, shapes, bugs, monsters in shape of wooden blocks? We came with jigsaw concept where your toddlers / babies will learn and enjoy at same time.<br/><br/>Kids puzzles is one of the best way to educate your baby for coming challenges in pre-school education. <br/><br/>Some of the wooden jigsaw puzzle blocks your baby will play with :<br/><br/>* Animals: lion, beer, Kangaroo, fox, zebra, cow, monkey, horse, snake, camel, elephant, panda, piggies, squirrel<br/>* Nature: star, moon, sun, cloud, wind mill, rainbow, trees, mountains, waterfall, desert, snow, fire, snow man, flowers, beach, leaf<br/>* Vehicles: bus, car, truck, scooter, aeroplane, ship, ambulance, train, motor bike, racing cars, police car, boat, rocket, tanker, fire brigade<br/>* Sweets: candy, ice cream, donut, cake, cookies, chocolate, Muffins, colourful candies, toffies, jelly, chocolate roll, lolly pop<br/>* Shapes: square, circle, triangle, rectangle, eclipse, half circle, octagon, hexagon<br/><br/>blocks puzzle jigsaw have more levels for kids to enjoy like: Birds, Cute Bugs, Monsters, Flowers, Sea animals <br/><br/>Features of this free educational baby wooden puzzle game:<br/><br/>- Sharpens your toddlers / babies and kids brain<br/>- Learning while playing<br/>- Skills development to match and remember vehicles(bus, car, truck, scooter, aeroplane, ship, ambulance, train, motor bike, racing cars, police car, boat, rocket, tanker, fire brigade), sweets(candy, ice cream, donut, cake, cookies, chocolate, Muffins, colourful candies, toffies, jelly, chocolate roll, lolly pop), nature(star, moon, sun, cloud, wind mill, rainbow, trees, mountains, waterfall, desert, snow, fire, snow man, flowers, beach, leaf), birds, animals (lion, beer, Kangaroo, fox, zebra, cow, monkey, horse, snake, camel, elephant, panda, piggies, squirrel)<br/>- Easy to learn and play. Just drag and drop wooden jigsaw object to matching shapes.<br/>- Soft and stimulating sounds<br/>- High quality appealing colors &amp; cute hd pictures<br/>- Many different levels, check the game once to explore more<br/>- Improve level of education<br/>- This game is 100% free for kids<br/>- Adapted for smartphones and tablets, any screen resolution<br/><br/>All in one free game for your children.<br/><br/>We are working on adding more learning puzzles for your toddlers. Kindly share your feedback on contact@skycap.co.in we would love to hear what more you need for your toddlers and babies.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:08:45", "background_image": "https://media.rawg.io/media/screenshots/c6b/c6bb52a74f35779bcf96f912c4664838.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 176, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Skycap"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}