{"id": 220272, "slug": "lost-bubble-bubble-shooter", "name": "Lost Bubble - Bubble Shooter", "name_original": "Lost Bubble - Bubble Shooter", "description": "Get ready for the most exciting Bubble Shooter of all time! Everything you love about bubble shooter games and much more! 🍬🍬 Just Like a Candy! 🍬🍬 <br/><br/>Crush the evil forces and save the world from the dark mist together with the good witch Light Sentinel! Get rid of Pandora's Boxes in the levels by popping bubbles, but keep in mind that your moves are limited and you must not hit Pandora's Box. Play this addictive bubble shooter game to test your puzzle solving skills. It’s fun and simple to play, but it will take time and skill to become a bubble pop master! 😎 💜 <br/><br/>Unlock new episodes, and embark on amazing journeys in mysterious lands. Play now to enter a world full of mysteries, magic and adventures and of course difficult obstacles set by the witches of the Dark World. Pop bubbles and help Light Sentinel defeat the Witches of the Dark World! <br/><br/>🎉 Fun Guaranteed! 🎉 <br/><br/>---------------------------------------- <br/><br/>Key Features: <br/><br/>★ More than 1600 levels with unique layout and challenges 🎁 🎁 <br/>★ Simple and addictive gameplay! <br/>★ 20+ Unlockable Magic Orbs to help you during your adventure <br/>★ Compete with your friends and help each other with additional lives and coins <br/>★ Constant free updates with new features, new levels in mysterious locations <br/>★ Pop bubbles 🎈🎈 and discover more worlds and magic than you have ever imagined in a bubble shooter game<br/>★ No ads to interrupt you while playing <br/><br/>---------------------------------------- <br/><br/>Follow us in social networks to get the latest updates and win special prizes!<br/><br/>All rights reserved by Peak. <br/><br/>Peak<br/>https://peak.com/", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:08:41", "background_image": "https://media.rawg.io/media/screenshots/d77/d770b9f4cf3498d7c1dc5a9511b1e883.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 235, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Peak Games"], "genres": ["Arcade"], "publishers": [], "esrb_rating": null}