{"id": 220328, "slug": "learn-to-spell-write", "name": "Learn to Spell & Write", "name_original": "Learn to Spell & Write", "description": "Is a educational game for learning to write, read and improve spelling. The game is designed for the whole family.<br/><br/>Help kids learn how to spell and recognize words, in English and Spanish. With funny pictures, this game help improve her vocabulary skills every day.<br/><br/>Kids and parents will spend endless hours of fun Dragging the big and colorful letters into their correct slots. With each correct word Spelled, they earn coins which can be used to unlock other collections of words.<br/><br/>When select each letter, a pleasant voice says it, so the child will learn to pronounce it. <br/><br/>Can choose between different levels of difficulty according to the age of the child or adult. The language to practice and the use or not of clues.In the \"easy\" level, the children will be guided by the application about how to spell every word, teaching them to read and write.<br/><br/>It works perfectly in all smartphones and tablets.<br/><br/>*** FEATURES ***<br/><br/>★ All content is 100% FREE<br/>★ 9 Collections of Words: Animals, Holidays, Food, Tools, Instruments, Christmas, Clothes, Home &amp; Vehicles<br/>★ Over 650 words to spell in each language<br/>★ 3 Difficulty Levels<br/>★ Use of Clues.<br/>★ Supported languages: English and Spanish<br/>★ Learn vocabulary has never been so much fun<br/>★ Learn the letters of the Alphabets<br/>★ Learn the spelling to popular and simple words<br/>★ Learn how to pronounce the letters of the alphabet<br/>★ Learn to associate words with their images<br/>★ Letters can be dragged across the screen onto targets, helping to improve your Kid hand-eye co-ordination<br/>★ Voiceovers to help to learn how to say each Letter<br/>★ Simple design and very intuitive.<br/><br/>*** DO YOU LIKE OUR APP? ***<br/>Help us and take a few seconds to rate it and write your opinion on Google Play.<br/>Your contribution will enable us to improve and develop new free games.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:08:33", "background_image": "https://media.rawg.io/media/screenshots/dbc/dbc6f1fb16ccc553b0aa2130f3d6b523.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 61, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Orange Studios Games"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}