{"id": 220345, "slug": "scatter-holdem-poker-texas-holdem-online-poker", "name": "Scatter HoldEm Poker - Texas Holdem Online Poker", "name_original": "Scatter HoldEm Poker - Texas Holdem Online Poker", "description": "Scatter Poker is a new online Texas Holdem game set in a vivid fantasy realm. Explore the mysterious worlds filled with magic, skittish fairies, blazing elementals and other fantasy creatures. Find hidden treasures, complete dangerous quests, and dwell deep into ancient ruins to find its secrets and the source of ancient sorcery. Scatter Poker provides a breathtaking combination of a classic casino card game and a picturesque fantasy world that seduces a player with unique, spectacular experience.<br/><br/>What makes Scatter Poker worth checking out:<br/>♛ Play online poker for FREE;<br/>♛ Highlighting winning poker combinations;<br/>♛ Each level brings new and exciting challenges;<br/>♛ Free Mode for those players who are tired of game challenges and quests;<br/>♛ The game is living and breathing - bringing you new updates, features, characters and stunning worlds to explore. You won't get bored with us! ;)<br/>♛ Customize your avatar and deck with a variety of different options, and if you don't like avatars - you can always place your own picture!<br/>♛ Cool Bonus game Video Poker will help you acquire free chips every hour;<br/>♛ Invite your friends and family to play poker together - we provide the best dealers :)<br/>♛ Simple statistic display to help you keep the track on your wins and improve your strategy!<br/>♛ Free Casino slots minigame is for those players who want to think about their Holdem strategy while taking a rest from poker;<br/>♛ Help your friends to pass missions with elixirs and receive such help yourself;<br/>♛ You don't like your opponent?  Throw a fireball at his face!  It won't do much, but hey! It's fun!<br/>♛ Massive bonuses and epic special events on a regular basis!<br/><br/>Are you new to Texas Holdem Poker?<br/>From highlighting winning combinations to the simple and informative tutorial, our game will help you to take the first steps into the wonderful world of poker. You will learn when it is the right time to raise the bet and when you have to fold. But the most important - you will learn to bluff! Feel the uncontrollable thrill of an upcoming win when you have a demolishing Royal Flush in your hand or when you have nothing, but your unequaled bluff skills proving that an opponent is wrong, leading him to his demise!<br/><br/>This game will suit both new players willing to learn how to play and poker sharks looking for a change of pace and new challenges. Mysterious Lady Femida, eccentric Genie, cunning Thief, sinister Vampire Hunter and other fantasy characters are waiting for you in Scatter Poker fantasy realm. Stunning graphics, detailed characters, and bewitching music will keep you satisfied with the captivating atmosphere of the exciting new world. Become the hero for whom Fate itself will cheer for and, have fun :)<br/><br/>Download now and  get 60,000,000 Free Chips  as a casino welcome bonus!<br/><br/>Best of luck to you!<br/><br/>Visit our website:<br/>https://murka.com/<br/><br/>Join us on:<br/><br/>Facebook<br/>https://www.facebook.com/scatterpoker/<br/><br/>Twitter<br/>https://twitter.com/ScatterHoldem<br/><br/>Instagram<br/>https://www.instagram.com/scatter_holdem/<br/><br/>FROM THE MAKERS OF SCATTER HOLDEM POKER:<br/>This game is intended for an adult audience and does not offer \"real money gambling\". Practice or success at social gaming does not imply future success at \"real money gambling\". Use of this application is governed by Murka's Terms of Service. Collection and use of personal data are subject to Murka's Privacy Policy.<br/>By downloading the game app you acknowledge our updated Privacy Policy and Terms of Service: <br/>http://murka.com/#terms-of-service<br/>http://murka.com/#privacy-policy", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-30T21:19:31", "background_image": "https://media.rawg.io/media/screenshots/0ae/0ae9b0cfc4df420f84549f607ceeb090.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 233, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Murka Entertainment", "Murka Games"], "genres": ["Card"], "publishers": [], "esrb_rating": "Mature"}