{"id": 220398, "slug": "pets-race-fun-multiplayer-pvp-online-racing-game", "name": "Pets Race - Fun Multiplayer PvP Online Racing Game", "name_original": "Pets Race - Fun Multiplayer PvP Online Racing Game", "description": "Run, jump and race against friends in Pets Race, the amazing multiplayer runner where you race as tiny pets! Put your PVP platformer skills to the test as you battle in online multiplayer for first place and collect special loot to keep your pets happy!<br/><br/>Pick up items and boosts to slow down the competition as you dash platform to platform, leaving your competition in the dust. Don’t forget to collect coins to customize your cats and dogs and upgrade their pet world. You can even treat your pets with yummy foods! <br/><br/>Download now if you love the idea of mixing racing games with cute cat and cute dog games! Aim for the finish line with friends in one of the most fun running games on the Play Store, Pets Race! <br/><br/>Ready? Set? Pets Race!<br/><br/>= Pets Race Features =<br/><br/>PVP Racing - Multiplayer Racing Games with Friends<br/>• Endless Runner: The more you run, the higher you rank<br/>• Animal racing Games: Race as cats and dogs against friends!<br/>• PVP Games: Use PVP Platformer skills to slow down other racers<br/>• Platformer Games: Race across fun courses like Barksburg, Puppy Pier or Mt. Meowmeow<br/>• Fun Race: Avoid obstacles and get power-ups to help win the race!<br/><br/>Multiplayer Runner<br/>• Online Multiplayer: Join friends in multiplayer Racing Games online<br/>• Multiplayer Platformer: Race against friends and outrun the competition in real-time multiplayer races<br/>• Pets Runner: Choose your favorite pet and race against other pets!<br/>• Fun Run: PVP racing lets you chat with other players in your very own player lobby. Hang out and have fun!<br/><br/>Happy Pets<br/>• Animal Games: Take care of your cats and dogs in their home<br/>• Pet World: Collect coins to buy the animals treats and new pet beds for their world!<br/>• Pet Run: Play as cats and dogs. Have fun racing with friends!<br/>• Cat Run: Show off your Platform skills as a cute cat<br/>• Dog Run: Race as a puppy and separate yourself from the pack<br/><br/>Battle in online multiplayer runner games and gather special items to stay ahead of the competition! You’ve never played a multiplayer platformer so cute, or combative! &gt;:3<br/><br/>If you love fun running games and kart games, get ready to battle in this online multiplayer animal race and aim for first place in Pets Race!<br/><br/>Privacy Policy - https://kooapps.com/#faqsTab-privacy2. Email us support@kooapps.com for any questions.<br/><br/>Parents please purchase the no ads upgrade for kids to play with you. Kids are only allowed to play with parental supervision.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:08:21", "background_image": "https://media.rawg.io/media/screenshots/d10/d101cd79009e3a4a120b1b15216c841d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 234, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Kooapps"], "genres": ["Racing"], "publishers": [], "esrb_rating": null}