{"id": 220315, "slug": "piano-kids-music-songs", "name": "Piano Kids - Music & Songs", "name_original": "Piano Kids - Music & Songs", "description": "Piano Kids – Music &amp; Songs is a great fun music box created especially for kids and parents to learn to <br/>play musical instruments, wonderful songs, exploring different sounds and develop musical skills. <br/><br/>Use your fingers to play colorful instruments such as kids xylophone, drum kit, piano, saxophone, trumpet, flute and electric guitar. Let your child make music on your phone or tablet. It is great fun for toddlers and kids to sit down and learn how to play musical instruments with authentic sounds.<br/><br/>The interface of the app is colourful and bright. It will interest you and please your child as he will learn music while playing exciting games. <br/><br/>The application has Four modes: Instruments, Songs, Sounds and Play.<br/><br/>Your child will improve his skills not only in music. Piano Kids helps to develop memory, concentration, imagination and creativity as well as motor skills, intellect, sensory and speech.<br/><br/>The whole family can develop their musical talent and composing songs together!<br/><br/>Everyone can play and enjoy exploring different sounds (animals, transportation, comic sounds, among others) and learn to pronounce the colors, flags, geometric figures, numbers and letters of the alphabet in different languages.<br/><br/>HOW DOES MUSIC BENEFIT CHILDREN?<br/><br/>★ Increase the skills to listen, memorize and concentrate.<br/>★ It stimulates the imagination and creativity of children.<br/>★ It stimulates the intelectual development, motor skill, sensory, auditory and speech of children.<br/>★ Improve sociability, causing children interact better with their peers.<br/><br/>KEY FEATURES<br/><br/>★ Totally FREE!<br/>★ 4 GAME MODES:<br/><br/>--- INSTRUMENTS mode --- <br/>Piano, Electric guitar, Xylophone, Saxophone, Drums percussion and Flute. Each instrument has real sounds and representation. The child can give free rein to their imagination to compose their own melodies in the different instruments.<br/><br/>--- SONGS Mode --- <br/>Can learn to play wonderful songs. The \"Auto Play\" mode plays the song to learn the melody. Then can play it alone following the aid. Funny characters are accompanying the music and tell the child that note to play. Can choose to play songs with the following instruments: Piano, Xylophone, Guitar, Flute<br/><br/>--- SOUNDs mode --- <br/>Allows select several collections of objects with representing images and sounds. Children become familiar with their sounds and learn to identify them. The child can explore and recognize the different sounds of objects as well as learn the pronunciation of colors, numbers and letters of the alphabet in English , Spanish and Portuguese.<br/><br/>- GAMES mode -<br/>Fun games for kids that through music and sounds helps children learn. Learn to count, learn the alphabet, create melodies, solve puzzles, paint, draw, color, pixel art, memory game, Play with baby shark and fish, learn geometric shapes and much more.<br/><br/>★ Sounds of real instruments and high quality (Piano, xylophone, acoustic guitar, saxophone, drums, flute)<br/>★ 30 famous songs to learn to play.<br/>★ Fantastic Auto Play Mode to play the selected song.    <br/>★ Can select the representation of the scales \"DO-RE-MI\" or \"CDE\".<br/>★ Intuitive and very easy to use!<br/><br/>*** DO YOU LIKE OUR APP? ***<br/>Help us and take a few seconds to rate it and write your opinion on Google Play.<br/>Your contribution will enable us to improve and develop new free games.", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-30T18:51:54", "background_image": "https://media.rawg.io/media/screenshots/438/4383292b2a030fb7ee0529360c32399f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 130, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Orange Studios Games"], "genres": [], "publishers": [], "esrb_rating": "Everyone"}