{"id": 220313, "slug": "agent-a-trial-edition", "name": "Agent A: Trial Edition", "name_original": "Agent A: Trial Edition", "description": "Try the first chapter for free, pay to unlock the full game.<br/><br/>Selected as a Google Play Android Excellence Game of 2018.<br/><br/>Agent A, your new mission is in from headquarters. An enemy spy known as Ruby La Rouge has been targeting our secret agents. Your mission is to find and capture her. <br/><br/>First we need you to follow Ruby, then locate and infiltrate her secret lair. Once inside it is imperative that you uncover her plans.<br/><br/>Oh and agent... do be careful. Miss La Rouge has a taste for dismissing agents such as yourself.<br/><br/>———————————————————————————<br/><br/>Agent A: A puzzle in disguise is an episodic tale of espionage spanning five chapters:<br/><br/>Chapter 1 - A puzzle in disguise<br/>Chapter 2 - The chase continues<br/>Chapter 3 - Ruby's trap<br/>Chapter 4 - A narrow escape <br/>Chapter 5 - The final blow (OUT NOW!)<br/><br/>You play as Agent A, your mission (should you choose to accept it) is to infiltrate the secret hideout of Ruby La Rouge and apprehend or neutralise the target.<br/><br/>Uncover a stylish 60s themed world full of retro futuristic contraptions, hidden gizmos, gadgets and clever logic based puzzles. But do be warned… Ruby La Rouge is no spy to be taken lightly! Explore a labyrinth of perplexing puzzles in this quirky game of cat and mouse that’ll have you wondering whether you’re the cat… or the mouse!!<br/><br/>Notice something strange or out of place? Making mental notes and observations (like a good secret agent) will aid you in solving tricky puzzles later on. As you explore Rubys secret hideout, collecting objects and using them cleverly is crucial in unlocking a trail of puzzles leading you ever closer to your target!<br/><br/>Agent A features:<br/>* Stylish 1960’s inspired art<br/>* 35 environments to explore, 100 inventory based puzzles and 50 puzzle screens<br/>* 30 achievements to collect, for the trophy hunter in all of us<br/><br/><br/>———————————————————————————<br/><br/>If you like escape games, you will love Agent A!<br/><br/>***** Game of the Year AGDA 2016 Winner *****<br/>***** PAX Indie Showcase Winner 2017 and 2015! *****<br/><br/>4/5 Touch Arcade \"This is one of the most playable and least frustrating adventure games I've played, and it speaks to the strength of the game design that it is great.\"<br/><br/>AppUnwrapper \"Agent A feels like something really special.\"<br/><br/>———————————————————————————<br/><br/>Are you clever enough to outsmart Ruby? Slip into the exciting world of espionage with Agent A now!<br/><br/><br/>*Agent A does not require any special permissions. If permissions are shown other than network access, please review permissions on your Android device.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:08:36", "background_image": "https://media.rawg.io/media/screenshots/4e2/4e2c7479a10bbd9538efcf12079453d6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 205, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Yak & co"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}