{"id": 220322, "slug": "match-game-animals", "name": "Match Game - Animals", "name_original": "Match Game - Animals", "description": "This is an educational, attractive and fun game for the whole family!<br/><br/>Are you ready to challenge your memory?<br/><br/>Have fun, learn about animals and exercise your memory with this amazing game \" Find the Pairs \". <br/>It is also a good way to relax!<br/><br/>By activating the pronunciation option, it becomes a valuable tool for children to learn to read, write and pronounce the name of the animals from different habitats.<br/><br/>Over 100 animals with pronunciation of names!<br/><br/>Pronounce of animal names in selected languages ​​promotes learning languages. <br/><br/>Play against the clock and beat your own record, or challenge your family and friends in \"2 players\" mode!<br/><br/>If you are brave, challenge the intelligent robot in the \"Player vs Robot\" mode.<br/><br/>Features:<br/><br/>★ Totally FREE: No content blocked!<br/>★ SIMPLE and INTUITIVE design for the little ones!<br/>★ Ideal for kids to learn to recognize and pronounce the name of animals.<br/>★ 4 levels of difficulty for the whole family to have fun (6 to 20 Cards).<br/>★ 3 levels of AI to compete against the robot.<br/>★ Various collections of cards (Farm, Garden, Sea, Jungle, Forest and many more that will be added)<br/>★ The best way for children and adults to exercise memory and concentration.<br/>★ Develops recognition, memorization and concentration.<br/>★ Beautiful effects of visuals and sound.<br/>★ Supports all sizes and screen resolutions.<br/><br/>Modes:<br/><br/>★ 1 player (beat your own time record and get more stars!)<br/>★ 2 players (challenge your friends and show who is the best!)<br/>★ Robot Vs Player (are you able to beat the robot?)<br/><br/>**** Do you like our free application? ****<br/>Help us and take a few moments to write your opinion on Google Play.<br/>Your contribution allows us to improve and develop new applications for free!<br/><br/>This application contains Icons made by Freepik from www.flaticon.com", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:08:34", "background_image": "https://media.rawg.io/media/screenshots/f77/f773c1076bc407a9e6dc9e950acdb6f7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 109, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Orange Studios Games"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}