{"id": 220396, "slug": "death-invasion-survival", "name": "Death Invasion: Survival", "name_original": "Death Invasion: Survival", "description": "This is a small town occupied by Death. You will be infected by zombies easily if you continue staying here. Want to survive? Just arm yourself and flee the town!<br/>Being kind is stupid because the zombies here have lost their basic emotions. What you need to do is replenish your bullets in time and never stop shooting. Fighting is the only choice!<br/>There are several survivors in this town. Though you are not a savior, you may need their help to escape from this town. Find the survivors and form a squad to fight shoulder by shoulder.<br/>To survive, food, killer weapons, fuel and generator are indispensable. However, these essential resources are often left in dangerous places. You need to offer fire support for your teammates so that they have enough time to open the door. Otherwise, you will be surrounded by cluster of zombies. Arm yourself and improve your combat power. The helmet can help you reduce the damage you take when you are accidentally bitten by a zombie. The backpack allows you to collect more items to survive in the journey away from the horrible town. Hard gloves can make your fists more aggressive.<br/>Use your fists to repel the zombies and defeat the ugly zombies BOSS. The zombies have been infected not long ago. There are many useful items on their bodies- blood packs, stimulants, etc. These things often determine how longer you can survive.<br/>Use sub-weapons such as grenade and landmine to blow up closed doors and defeat groups of zombies! Collect pieces of firearms as many as you can in the deadly journey and assemble them into more powerful firearms! This is the survival game of strong ones.<br/>Of course, there will be many surprises in this survival journey. For example, if you find a shabby tank, all you need to do is cover your teammates to fix the tank. A tank will be more powerful than 10 heavy machine guns.<br/>Are you ready to start this journey of survival? To take up arms to survive the battle, or to give up resistance, drowning in the zombie sea? It depends on you. Just equip your weapon and experience the awesome third-person shooting game!<br/><br/>Game Features:<br/>HD battle scene<br/>Real story dialogue<br/>Rich gear system<br/>Awesome shooting<br/>Free-moving third-person shooting game", "metacritic": null, "released": "2018-08-04", "tba": false, "updated": "2019-07-29T20:59:17", "background_image": "https://media.rawg.io/media/screenshots/653/65354e75de9ac99a55c12d8eba2e601a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 452, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["GunBattle&ZombieShooters Games", "Sichuan Quleduo Network Technology Co"], "genres": ["Action", "RPG"], "publishers": ["Sichuan Quleduo Network Technology Co"], "esrb_rating": null}