{"id": 220389, "slug": "lastcraft-survival", "name": "LastCraft Survival", "name_original": "LastCraft Survival", "description": "Last Craft — a free post-apocalyptic mobile MMO game. Make yourself a weapon and destroy hordes of zombies and raiders with a single strike in stealth or openly start shooting them and kill everything you see. Do whatever you want to have fun!<br/> <br/>Depressing atmosphere of despair is going to follow you all around, making it even harder to stay alive. Every day might become your last day. Learn shooting, become the best and reach the top the pixel FPS.<br/> <br/>Game features:<br/>• 3D Mobile ММО — embrace all the possibilities of a free MMO game in 3D on your mobile device;<br/>• survival — you will not only have to fight over 50 various monsters, but also constantly seek for craft resources in order to survive. You are losing a part of inventory every time you die — the life of your character matters now;<br/>• PVP — fight with other players in multiplayer to gain experience and get cool loot;<br/>• cooperative — unite with friends online to complete the hardest missions together;<br/>• dozens of equipment and weapons — collect and improve equipment and armor sets. Sniper rifle, super rapid-fire machine gun or a silent crossbow? It is for you to chose;<br/>• amazing craft system — if you enjoyed the pixel world, you will definitely like this free game. It has more than 150 recipes for craft, from ammo, med kits and batons to powerful energy guns;<br/>• your own shelter, your own ark — build all of the 11 unique buildings with blocks and improve them. Use your imagination and craft to create an amazing house block by block in the creative mode and show it to your friends;<br/>• Hi-End bosses — level up and seize new locations by fighting bosses like a powerful zombie. Win or die;<br/> <br/>Fascinating game world<br/>The game world is like a real Earth. It is diverse and changes over time as you are leveling up your character. Player starts from grabbing lands in unknown prairies and then proceed to explore military bases and airports to reach other survivors in this world, turned into battlegrounds. Use your absolute freedom to stroll through the remains of human civilization left after the World War III, to survive the last day on earth. Visit an abandoned port, deserted amusement park, and metro tunnels inhabited by dangerous mutants. Always be on the alert — a random zombie might start a battle with you.<br/> <br/>Weapons and leveling<br/>Depending on the situation, you will need various pixel guns and equipment. Consider your strategy. Does it worth to perform an open attack with a machine gun? Is it better to kill the boss with a single shot from the distance? However, sometimes you just do not have a choice and forced to use hand-made batons and knives, since ammunition is very hard to find. Carefully choose your weapons: you will not be able to bring your entire arsenal on an adventure with you in a backpack.<br/> <br/>PVP/PVE system<br/>Aside from your shelter, only one rule applies to all battlegrounds of the multiplayer game world — the strongest man survives. It is hard to resist from shooting when you can get a part of resources from the defeated enemy. Kill another player and say “your things are mine now” — it feels very good. Do not miss a chance to shoot enemies or unknown monsters.<br/> <br/>Shelter<br/>The only ark where you can store ammo, hide from the constant war and feel safe is your shelter. You can restore all the building in a half-destroyed city to be able to make Equipment, Weapons, Auto transport, Medical supplies, Ammunition and food. The player has the complete freedom of action. Show your imagination and build anything you want in 3D with blocks. Turn yourself into a post-apocalyptic farmer: grow vegetables or start a livestock farm. Remember — shelter is a steady source of supplies for survival and your only place to escape unknown battlegrounds filled with enemies and walking dead.<br/> <br/>Join this incredible pixel world for free! Bring your friends — you will need them, when it is a last day on the Earth. Download the game and enjoy this crazy mix of shooter and simulator right now!", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:08:23", "background_image": "https://media.rawg.io/media/screenshots/e48/e481ce796c72348441aa2fce70bd65dc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 284, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Pixel Gun 3D"], "genres": ["Action"], "publishers": [], "esrb_rating": null}