{"id": 220487, "slug": "bubble-shooter-3", "name": "Bubble Shooter 3", "name_original": "Bubble Shooter 3", "description": "Shoot and pop bubbles and experience hours of fun in this classic bubble shooting game!<br/>Bubble Shooter 3 is a super relaxing bubble pop game that will keep you busy for hours shooting balloons and solving puzzles. <br/><br/>Play now and experience endless excitement with this highly addictive free shooting game!<br/><br/>🔴Train your brain and put your matching skills to the test playing this exciting bubble shooter game. Challenge yourself with thousands of amazing puzzle levels filled with awesome quests, boosts, and rewards. Aim and explode all the colored balloons to clear the board and move on to the next bubbly challenge! Blasting bubbles was never this fun!<br/><br/>🔵With thousands of levels and tons of free fun puzzles, Bubble shooter 3 is a must-have game for your Android device! Download for free today and start shooting bubbles. Match 3 or more colors to create a line blast, shoot all the balls, and clear the board. <br/><br/>How to play this top bubbles game:<br/>* Drag your finger to aim, release your finger to take a shot<br/>* Match colors to pop and blast balloons<br/>* Improve your bubble shooting skills - clear a level with fewer moves to get a higher score!  * Clear the board from all the bubbles<br/>* Solve all the puzzles and brain teasers<br/>* Explore thousands of free balloon popping levels<br/>* Swap bubbles without limit, just tap on your bubble to change its color<br/>* Win coins and reach high scores<br/>* Sharpen your matching and strategy skills as you plan your moves and work your way up to the top! <br/><br/><br/>This bubbly game is addictive, so you better be careful because the bubble magic starts to work once you shoot the balls! <br/><br/><br/>Don’t miss out our super cool features:  <br/>★ Thousands of fun levels<br/>★ Addicting stress relief bubble pop game <br/>★ Awesome effects and cool rewards<br/>★ Plenty of amazing challenges and puzzles<br/>★ Simple and fun balloon popping game, easy to learn and play <br/>★ Awesome boosts and power-ups to help you smash the balloons <br/>★ Enjoy the best balloon blaster game online or offline <br/>★ Play this free bubble shooter 3 game anytime and anywhere, no wifi or internet connection is required <br/>★ This fun popper is easy just to pick up and play! <br/><br/>It’s bubble magic time!<br/>Enjoy the most exciting puzzle game designed to keep your brain sharp and active. Smash all the colored balls, unlock great boosters and power-ups and complete all the quests<br/>Download this amazing bubbling game today and enjoy cool graphics and visual effects, awesome elements, and lots of challenging puzzles. <br/><br/>💥 Awesome Boosts!💥 <br/>Unlock exciting power-ups and match them with each other to generate big explosions! <br/>Get cool power-ups that will help you pass levels and beat challenges: <br/>+ Pop 7 bubbles in a row to get a FIREBALL that will burn up bubbles on the way<br/>+ Drop 10 balloons or more to get a BOMB that will take out surrounding bubbles <br/><br/><br/>Want to relax and clear your mind? Play Bubble Shooter 3 and join the thrilling puzzle adventure. You can start any level over and not have to wait for lives, as they are unlimited! Experience easy and fun gameplay, tap on the screen to shoot balls, make bubble combinations and plan your moves to finish levels. <br/><br/>If you’re looking for fun free puzzle games, you MUST try out this incredible shooter! No internet is needed so you can enjoy an unlimited bubble shooting FUN!<br/><br/>Warm-up your fingers and get ready to make these BUBBLES POP!<br/><br/><br/>All rights of Bubble Shooter™ are owned by Ilyon Dynamics Ltd.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:08:11", "background_image": "https://media.rawg.io/media/screenshots/655/6556624410f36868ccca5a856fa1c38c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 24, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Bubble Shooter Artworks"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}