{"id": 220482, "slug": "power-pop-bubbles", "name": "Power Pop Bubbles", "name_original": "Power Pop Bubbles", "description": "Start your engines and get ready to shoot and pop bubbles in the best shooter game! Unlock cool boosts &amp; win coins!<br/><br/>Power Pop ™ Bubbles is an addictive, exciting, brain-training puzzle game with thousands of fun levels packed with awesome challenges, power-ups, and effects. Play for free today and join the bubble popping mania!  <br/><br/>Shoot and burst all the colorful balls and solve the fun puzzles and challenges to level up. Make combinations of 3 or more identically colored balls to pop the group and blast the bubbles away. Aim carefully to hit the target, strike and drop big groups of bubbles and clear the board. With cool new items and effects, powerful boosters and tons of puzzle levels, you just won’t put it down- Try it out today!<br/><br/>COOL FEATURES <br/>Addictive gameplay. Play and enjoy hours of endless fun. <br/>Thousands of incredible levels packed with fun puzzles and challenges. <br/>Bubble swap is free, just tap on your bubble to change its color.<br/>Awesome features and effects.<br/>Classic and most addicting gameplay. <br/>Easy to learn and super fun to play.<br/>Test your matching skills in thousands of exciting levels.<br/>No wifi connection is needed so you can enjoy an unlimited bubble popping fun!  <br/><br/>This amazing shooter game will test your strategy and planning skills in thousands of exciting puzzles and brain-teasers. Download now and play for hours! <br/><br/>MATCH COLORS &amp; BURST BUBBLES<br/>Power Pop ™ Bubbles is the best game to play when you have some free time, or when you’re looking for a fun activity to share with friends and family. Get it now and enjoy this fun puzzle game designed to keep your brain sharp and active. <br/><br/>TIP: Drop the big groups of bubbles first so you can clear a path. See which bubble color you are getting next so you can work out a strategy to pop your way to victory and remove all the bubbles from the board. You can restart any level without having to wait for lives, as they are unlimited! <br/><br/>BOOST YOUR SKILLS<br/>Earn awesome power-ups and blast through the challenges:<br/>* Make 7 shots in a row to earn a FIREBALL that will burn up bubbles on the way.<br/>* Drop 10 balls or more and get a BOMB that will take out surrounding bubbles.<br/><br/>Do you have a knack for logic and puzzle games? <br/>PLAY Power Pop ™ bubbles now and have fun bursting the balls in this online bubble shooter game. Dive into the balloon popping fun and discover amazing levels, cool effects, and challenging puzzles. Download and play anywhere you’d like, online or offline - no internet connection is needed. Take your time and plan your every move, play today and win rewards!<br/><br/>How to Play<br/>* Drag your finger to move the laser aiming and lift it to shoot bubbles.<br/>* Match at least 3 bubbles of the same color or more to pop the group and win points.<br/>* Boost your experience with awesome power-ups.<br/>* Swap and match balls and win coins.<br/>* Aim and shoot matching bubbles and win big.   <br/>* Use your moves efficiently to overcome all obstacles and complete levels.<br/>* Solve the fun puzzles.<br/>* Pop and burst balls and clear the board.<br/>* Reach high scores by using the powerful fireball &amp; bomb boosters     <br/>* Master all the different challenges. <br/><br/>Liked the game? We would love to get your feedback! Let us know what we can add to make your gameplay even more enjoyable and earn your 5-star review.<br/>Have any questions for us? Contact our support team at support@ilyon.net <br/> <br/>Follow us for news, updates and fun surprises!<br/>Visit our Facebook page: https://www.facebook.com/powerpopbubble/ <br/><br/>All rights of Power Pop ™ are owned by Ilyon Dynamics Ltd.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:08:12", "background_image": "https://media.rawg.io/media/screenshots/145/145ae7a9cd3fc6f0d52ba375e76889e3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 32, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Bubble Shooter Artworks"], "genres": ["Arcade"], "publishers": [], "esrb_rating": null}