{"id": 22040, "slug": "personal-disco-vr", "name": "Personal Disco VR", "name_original": "Personal Disco VR", "description": "Enter a disco dance floor like you've never seen it before. It's private and it's personal and you get to choose the dance partner.<br/><br/>Choose between a number of different dance partners with their own looks, personality and dance style. You are guaranteed to get the full and total attention from your dance partner. A virtual reality experience that must be experienced first-hand in order to truly believe in the immersion. Step up close, look in the eyes of your partner and dance away to your favorite music.Features<br/><ul><li> Room scale VR with a recommended 1.5 x 1.5 m space.<br/></li><li> Detailed female and male characters, each with unique and interactive real-time facial and body expressions.<br/></li><li> Customize the appearance of the characters to your own liking.<br/></li><li> A very personal and immersive experience.<br/></li><li> Dance to the built-in music or select from your own music on your local computer.<br/></li><li> Play along to the music on virtual drums and laser harp.<br/></li><li> Real-time music analysis for energetic visual presentation and influence of the character's moves.<br/></li><li> This is not a traditional game - it's an amusement experience.</li></ul><br/>This game explores the human psychology of interaction with virtual reality avatars that are aware of the presence of the player.<br/>It is also an awesome way of experiencing music in virtual reality.<br/><br/>Available for HTC Vive on Windows PC", "metacritic": null, "released": "2017-04-06", "tba": false, "updated": "2019-08-28T22:07:47", "background_image": "https://media.rawg.io/media/screenshots/622/6220e163768b25cce44f2fa14efc9069.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 5, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 183, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Dual Heights Software"], "genres": ["Casual", "Indie"], "publishers": ["Dual Heights Software"], "esrb_rating": null}