{"id": 220492, "slug": "bubble-clash-2", "name": "Bubble Clash", "name_original": "Bubble Clash", "description": "SHOOT and POP the colored balls in this fun, addicting puzzle game and master all the challenges! If you are looking for a fun way to spend time, we have a perfect game for you. Play now Bubble Clash game and enjoy thousands of amazing levels packed with puzzles and brain teasers. <br/><br/>Your GOAL is to clear the board from all the bubbles, win points and finish levels. Make combinations of 3 or more the same colored bubbles to pop the group and blast away the bubbles. Plan your shots and win, see which color you are getting next and work out a strategy to smash all bubbles using fewer shots.  <br/><br/>TIP: Try to clear a level with fewer moves to get a higher score. Each new level has a different target you need to reach, so plan your moves carefully and fire away! You can start any level over and not have to wait for lives, as they are unlimited! <br/><br/>HOURS OF ENDLESS FUN<br/>Don’t worry about a WiFi connection, you can play this cool game anytime and anywhere you want, whether you’re online or offline! Share the bubble fun with family and friends and compete for the top scores.  <br/><br/>Use powerful boosts:                                                                                                                              <br/>** Drop 10 bubbles in a single shot to get a bomb that will take out the surrounding bubbles.<br/>** Pop 7 bubbles in a row to get a fireball that will cut through a pass. <br/><br/>Bubble Clash Features<br/>• Exciting gameplay experience.  <br/>• Classic and popular game modes. <br/>• 1000+ fun levels featuring awesome puzzles and challenges. <br/>• Test your skills and exercise your brain.<br/>• Free to play and addictive bubble pop game!<br/>• Enjoy Bubble Clash with family and friends. <br/>• Blast away all the colorful bubbles and clear the board. <br/>• Available to play on Android or Tablet device. <br/>• Special boosts and power-ups to help you pass levels. <br/>• Win points and try to get 3 stars on every level. <br/><br/>Download this fun puzzle game from Google Play and put your matching skills to the test! This classic popular bubble popper features highly addicting gameplay, awesome boosts and plenty of fun levels.<br/> <br/>Join the bubble clash now!<br/><br/>All rights of Bubble Shooter™ are owned by Ilyon Dynamics Ltd.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:08:08", "background_image": "https://media.rawg.io/media/screenshots/3e3/3e34182b9a9ba5dd13c9efe27f6b3f45.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 17, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Bubble Shooter Artworks"], "genres": ["Arcade"], "publishers": [], "esrb_rating": null}