{"id": 220467, "slug": "poker-heat-free-texas-holdem-poker-games", "name": "Poker Heat - Free Texas Holdem Poker Games", "name_original": "Poker Heat - Free Texas Holdem Poker Games", "description": "Poker Heat – The new FREE ONLINE POKER game brought to you by the creators of World Series of Poker (WSOP) poker app - Playtika<br/><br/>Compete in intense poker games as you place your bets online in the best POKER APP WITH EPIC LEAGUES. Put your Texas poker strategy to the test &amp; place your best bet like a true VIP Texas poker player! Move up the ranks of TEN poker leagues to reach the top and claim jackpots of MILLIONS of chips!! Play solo from your phone and enjoy the best Vegas Casino Poker online while you compete in live poker games vs other VIP players from Las Vegas and all over the world.<br/><br/>Feel the HEAT with Free Texas Hold’em poker – your free chips await in the poker room – there’s a reason why poker is the best card game around!<br/><br/>Prepare - New Poker Rings are Coming<br/>You might be a good poker player, you might be great at Texas Holdem, but can your poker skills grant you our RING? We’ve just turned the HEAT ON and enhanced our poker casino experience with an all new poker rings collection. Play free Texas Hold’em poker and complete missions to win crowns. After you’ve earned enough crowns, and only then, you will be worthy of the ring.  Claim your free poker chips, wear your best ring at the poker table and flaunt your achievements in front of everyone at the poker table. Claim your free poker chips NOW!<br/><br/>League-based competition<br/>Looking for something more exciting than simple Las Vegas poker games, where you can truly test your poker strategy? Poker Heat’s unique league-based competition mechanism with party-like classic poker games gives you an intensely competitive gameplay. Our large variety of online poker rooms delivers an experience like no other, better than any other standard online poker app. Start by playing in the Newbie Court to get into the ‘Promotion Zone’ and progress into the next league. Compete in 10 leagues, bet your free chips online and finish in the top tier to win HUGE PRIZES!! Free Poker games are here for you to play – Place your gamble, join the poker party and play free online poker!<br/><br/>Compete against friends and players from around the world<br/>Participate in a world poker tour straight from your phone! Show your poker hand, ante up, go ALL IN or fold - bluff your friends and outsmart poker players from all around the world! Play poker online with friends by simply hitting the Invite button at the poker tables and play free poker Texas Holdem together. Participate in exciting poker tournaments and win BIG!<br/><br/>Win Daily Bonuses and Free Perks<br/>Get your daily free poker chips bonus multiplied by your league ranking! The higher the league – the bigger the multiplier - jackpot! A Prize pool filled with free poker chips awaits the league’s top TX poker players in the Promotion Zone. Reach the World Class league to become a poker legend of poker stars in Poker Heat - the best online Texas Holdem app! Play online poker tournaments anytime, everywhere!<br/><br/>Exciting Content<br/>Get into the online VIP casino of Poker Heat as a true poker king and discover nine different stadiums with their own poker style and mood! Start at the Newbie Court, advance through Victory Cage and move on to the Ring of Honor - for the true poker pro! Enjoy player statistics, hand strength info, amazing animations and so much more! Find special deals at the Chips Store to buy chips instantly for a cheap price!<br/><br/>Connect with us on Facebook (https://www.facebook.com/Pokerheat/)<br/><br/>Install the latest Texas Holdem poker game, brought to you by the creators of the WSOP official online game (World Series of Poker).<br/><br/>This game is intended for an adult audience (21+) for amusement purposes only and does not offer ‘real money’ gambling, or an opportunity to win real money or prizes based on game play. Playing or success in this game does not imply future success at ‘real money’ gambling.<br/><br/>Poker Heat – can you feel it?", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:08:15", "background_image": "https://media.rawg.io/media/screenshots/6b1/6b1fd02051ec636da79b466587e5ffcf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 216, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Playtika"], "genres": ["Card"], "publishers": [], "esrb_rating": null}