{"id": 22059, "slug": "moe-mekuri-sp-sp", "name": "Moe Mekuri SP - 萌めくりSP", "name_original": "Moe Mekuri SP - 萌めくりSP", "description": "The goal of this game is to turn all the panels to face up. <br/>You can choose the level stage from EASY, NORMAL, and HARD. <br/>However, in order to play the NORMAL stage, you need to have passed all the EASY stages, and to play the HARD stage, all the NORMAL stages.<br/>Once you passed a stage, all the images from that stage are added to the GALLERY.<br/><br/>All 25 songs of the original song of the series which had been distributed with XBLIG are also recorded.<br/><br/><br/><br/>Moe character puzzle game which had been delivered with XBOX LIVE INDIE GAMES Moe Mekuri, Moe Mekuri 2, Moe Mekuri 3 with all the characters and songs that appeared!<br/><br/><br/><br/><br/>It is a puzzle game playing with intuitive operation using a mouse.<br/>It is a game that turns all panels face up by operating the panel placed on the stage.<br/><br/><br/><br/><br/>It is an easy puzzle that touches a panel placed on the stage and turns around.<br/>However, there are things that have characteristic movements on the panel, so be careful.<br/>Successful if you manipulate it well and all the panels can be on the table!<br/><br/><br/><br/><br/><br/><br/>◆NORMAL PANEL<br/>　It influences the panels on all four sides.<br/><br/><br/>◆UP-DOWN-AND-SIDE PANEL<br/>　It influences all the panels located above, below, to the right and left.<br/><br/><br/>◆DIAGONAL PANEL<br/>　Panel that affects all the diagonal directions.<br/><br/><br/>◆ROTATING PANEL<br/>　It turns 360 degrees and back to the original position.<br/><br/><br/>◆TRANSFORMATION PANEL<br/>　You can change this panel to your favorite panel only once.<br/><br/><br/>◆IMMOBILE PANEL<br/>　It flips over only by other panels' effect.<br/><br/><br/><br/><br/>You can select GALLERY by clearing all stages at game level EASY.<br/>When clearing the difficulty level of NORMAL, HARD, the character's clothes will become thin clothes.<br/><br/><br/><br/><br/>Moe Mekuri SP has recorded all the songs of the mochikuri series!<br/>MUSIC COLLECTION will be able to choose if you clear all stages with difficulty NORMAL!<br/>Touching the vocal collection title will switch to Moe Mekuri, Moe Mekuri 2, Moe Mekuri 3, each song, so you can listen to your favorite songs as much as you want.<br/><br/><br/><br/><br/>Moe Mekuri SP has a mode called ENDLESS GAME.<br/>It is a mode that makes use of the instinct and memory power that clears the stage as long as there is time.<br/>How many stages can you clear within the time limit?<br/><br/><br/><br/><br/>http://store.steampowered.com/app/644530/The_Maid_sans_Caving_Adventure/<br/><br/><br/>http://store.steampowered.com/app/656190/THE_HOUCHI_PLAY_THE/", "metacritic": null, "released": "2017-04-23", "tba": false, "updated": "2019-08-28T22:07:46", "background_image": "https://media.rawg.io/media/screenshots/323/3238c89eabac4d814a5f0316da832b04.jpg", "website": "http://koheigallery.jp/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 5}, "playtime": 5, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 181, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["KoheiGallery"], "genres": ["Indie"], "publishers": ["KoheiGallery"], "esrb_rating": null}