{"id": 220518, "slug": "brain-training", "name": "Brain Training", "name_original": "Brain Training", "description": "Brain Trainer app to quick exercise to your brain short term memory, concentration, focus , speed &amp; accuracy.<br/>it has 15 type of brain training games.<br/><br/> ◆  Multitasking brain training .<br/> ◆  Quick Search brain training .<br/> ◆  Math brain training .<br/> ◆  Focus brain training .<br/> ◆  Colors Vs Brain<br/> ◆  Memory Power Training<br/> ◆  Left Brain Vs Right Brain <br/> ◆  Remember Faces <br/> ◆  Concentration<br/> ◆  Quick Decision<br/> ◆  Grid Memory Challenge<br/> ◆  Listening Memory<br/> ◆  Word Memory Challenge<br/> ◆  Concentration Plus<br/> <br/>1) Multitasking skill: -<br/><br/>  Increase your brain multitasking capability by playing this.Questions will be displayed at a time in 2 panels. You have to get target score to finish the level by managing not to loose 3 chances on any panel and with in 1 minute..  Try to get max score on each level.. <br/><br/>2) Quick Search skill :<br/> <br/>Increase your brain searching skills by playing this.Blast the balls from high number to low number with in time limit. 5 seconds penalty on each wrong click.<br/> <br/>3) Math Skill : Add,subtract,multiply numbers fast in balloon solver. The objective of the game is to pop the balloons with correct answer.<br/> <br/>4) Focus Skill:<br/>  Increase your focus by controlling your attention. Number will be displayed with rapid pace. Tap the screen after every number except do not tap on withhold number.<br/><br/>5) Color Vs Brain<br/>Color List will be displayed for few seconds and colors will be be shuffled, remember the colors by putting full concentration before shuffle and arrange them in same order by dragging the items<br/><br/>6) Memory Power<br/>    Remember the objects which displays only few seconds and reenter them in same sequence.<br/>This exercise defiantly challenges you memory power <br/><br/>7) Left Vs Right Brain<br/>  Balancing Left and Right brains are very important, playing this game will train your brain on balancing activities <br/> <br/> <br/>If you are not satisfied with your results, Play this game daily 5-10 min. You may see better results.", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-31T06:19:21", "background_image": "https://media.rawg.io/media/screenshots/531/53120c4e82db0c1a7d3d2b21addce735.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 133, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["App Holdings"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": "Everyone"}