{"id": 220515, "slug": "skillz-logic-brain-games", "name": "Skillz - Logic Brain Games", "name_original": "Skillz - Logic Brain Games", "description": "Want to test your memory skills or give your brain an exercise? Try this fun memory game to improve your memory, speed, get better accuracy, distinguish between colors and much more. This is a fun logical game that gives a good test to your brain.<br/><br/>With this brain game, you can help players to learn to distinguish between different colors and improve their skills. The players sharpen their minds while having fun playing this game. This logical game is a skill test game. Also, you can test your reflexes. There are some fun game puzzles in the game of different kinds. You score points and advance levels. Very fun and addictive game that you will completely enjoy.<br/><br/>***********************<br/>APP HIGHLIGHTS<br/>***********************<br/>To add to playing a logical game and training your brain, you also have a lot of fun with the game. It is packed with different kind of tests that improve your skills and abilities. Here is how – <br/>✓Improve your memory<br/>✓Train your reflexes<br/>✓Increase your accuracy<br/>✓Prove your touch ability<br/>✓Increase your speed<br/>✓Learn color coordination<br/><br/>Each level tests your skills and abilities to their peak. After each level, your results are ranked between 1 and 5 Stars and you will be rewarded with a number of Brains. For every Star earned you will be rewarded with one Brain. Using a brain, you can retry from the current round, pass a round or pass a level with 5 stars.<br/> <br/>Every level is designed to help you improve your skills, memory to sharpen your mind with this addictive game. So, are you ready to take up a brain challenge now? Download this free app – “Skillz Logical Brain Game” now to get started.<br/><br/>The logical game is introducing a Multiplayer feature. Here is how it goes –<br/>- Play with your friends or with random players<br/>- Start a game with minimum 2 players. Max limit is 4.<br/>- If you finish the game in Multiplayer mode on the 1st place, you earn a \"Win\" and 5 Brains. If you finish the game but on the 2nd place, you earn just 3 Brains and no \"Win\"<br/>- Your Multiplayer Ranking depends on the \"Wins\"<br/>- Play in Multiplayer mode and unlock Achievements<br/>You will love the feature, so start sharing with your friends.", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-31T00:57:30", "background_image": "https://media.rawg.io/media/screenshots/fab/faba88c690a3566b07feda1511de5de8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 44, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["App Holdings"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": "Everyone"}