{"id": 22067, "slug": "trailmakers", "name": "Trailmakers", "name_original": "Trailmakers", "description": "Welcome to the Ultimate Expedition!<br/>Journey over grueling mountains, hazardous swamps, and bone-dry deserts on a distant world far from civilization - it is just you, your fellow adventurers and the amazing, jet-powered hover-buggy you built yourself. Explore, crash your vehicle, build a better one, and get as far as you can with whatever spare parts you find on your way.Engineering made easyTrailmakers is about building very awesome vehicles and machines, but you don’t need an engineering degree to get started. The intuitive builder will get you going in no time. Everything you build is made from physical building blocks. Each block has unique features like shape, weight and functionality. They can be broken off, refitted and used to build something new. Individually the blocks are fairly simple, but combined the possibilities are endless.Expedition in the makingExpedition Mode is the challenging survival mode of Trailmakers. You have volunteered to join a DIY off-road rally expedition in a distant world. With only a few building blocks, you must build, tinker with and rebuild your machine to progress. Traverse a big world, overcome deep gorges, angry wildlife and all kinds of weather to progress and find new parts that will juice up your machine. The world in Expedition Mode will test your survival skills and ingenuity. With the next checkpoint in sight but no wheels or wings, how do you and your four jet-engines get across the canyon?Pure creative freedomCreative Mode is where you want to head for an unrestricted, sandbox, vehicle-building experience. Here you can build anything you can dream of, and play around with it in the world of Trailmakers. It is a great place to test out crazy machines, and experiment with the physics engine. With tons of different blocks, hinges, thrusters and interactive vehicle parts - the sky is not the limit.Play with friendsTrailmakers is even more fun if you play it with a friend. Put two seats on your vehicle or race each other towards the next checkpoint - it is up to you. Both Creative and Expedition Mode support multiplayer.", "metacritic": null, "released": "2020-05-21", "tba": false, "updated": "2024-01-02T00:17:28", "background_image": "https://media.rawg.io/media/screenshots/885/885a7caffb0899f083f095502c968e7d.jpg", "website": "http://www.playtrailmakers.com", "rating": 3.37, "rating_top": 4, "added_by_status": {"yet": 60, "owned": 1040, "beaten": 14, "toplay": 14, "dropped": 40, "playing": 4}, "playtime": 3, "achievements_count": 113, "ratings_count": 68, "suggestions_count": 376, "game_series_count": 0, "reviews_count": 68, "platforms": ["Xbox One", "PlayStation 4", "PC"], "developers": ["Flashbulb"], "genres": ["Action", "Adventure", "Simulation", "Racing", "Indie"], "publishers": ["Flashbulb"], "esrb_rating": null}