{"id": 22065, "slug": "blackjack-bailey-vr", "name": "Blackjack Bailey VR", "name_original": "Blackjack Bailey VR", "description": "Blackjack Bailey VR is a casual casino gaming experience and the first stand alone virtual reality blackjack game available on Vive.<br/><br/>It's a single player game where you sit at a casino card table and play against the dealer in a little one on one blackjack.<br/>It features a cute and charismatic dealer that goes by the name of Bailey, who behaves just like a real dealer at a Las Vegas casino.  The game uses simulated gambling, so there are no real money transactions within the game and once downloaded, there is nothing more to buy. You can practice your best blackjack strategy and play to your hearts content.  <br/><br/>The odds are in your favor as you master the art of blackjack. <br/>Refine your strategy and improve your chances at winning. The odds are truly in your favor because there is NO risk! You have access to an unlimited bank and there are NO in-app purchases so you never have to buy chips to keep playing. Once downloaded you can play forever.<br/><br/>Virtual Vegas Baby!  You play seated at a 21 table just like you’re at a real Casino. All the thrills of gambling but with none of the risk! Enjoy playing 21 anytime, anywhere, all within the privacy of your HMD (head mounted display).<br/><br/><strong>Features:</strong><br/><ul><li>Single player blackjack in a casual casino environment<br/></li><li>Unlimited play with no in game purchases<br/></li><li>Simulated Gambling for fun and practice<br/></li><li>A Cute and charismatic 21 dealer<br/></li><li>Las Vegas house rules<br/></li><li>Single deck Blackjack<br/></li><li>Comfortable seated play</li></ul><br/>A must-have game for every VR game enthusiast's library.<br/>Join the winner's circle - get Blackjack Bailey VR today!<br/><br/>Co-developed by iCandy Games and Hologram Software LTD.", "metacritic": null, "released": "2017-04-27", "tba": false, "updated": "2019-08-28T22:07:46", "background_image": "https://media.rawg.io/media/screenshots/87d/87d923f895b5332c49ea38a7427d0414.jpg", "website": "http://www.blackjackbailey.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 127, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["iCandy Games", "Hologram Software"], "genres": ["Simulation", "Casual", "Indie"], "publishers": ["iCandy Games"], "esrb_rating": null}