{"id": 220674, "slug": "day-r-survival-apocalypse-lone-survivor-and-rpg", "name": "Day R Survival – Apocalypse, Lone Survivor and RPG", "name_original": "Day R Survival – Apocalypse, Lone Survivor and RPG", "description": "<p>How to survive in post-apocalyptic world destroyed by nuclear war and avoid radiation? How to stay alive in rpg games online? Tell after role playing game in Day R survival online!<br />\nRadiation, hunger and disease are all around you. You have to cross the entire country and save your family after nuclear war. Who knows if they are even alive, or if radiation and the deadly virus have already reached them? Uncover the secret of the apocalypse and regain your memories during a walking across the huge territory of the USSR in the 1980s.<br />\nSurviving after the apocalypse isn&#39;t easy. You&#39;ll have to face the real hunger games and dead characters! Monsters, thirst, countless pandemic diseases and injuries, blood-thirsty enemies – you have to fight it all in survival strategy games. Craft all your resources: weapons, clothes, and transport.<br />\n▪Hardcore survival:<br />\nSurviving hunger, zombies (like in zombie rpg games) and pandemic radiation won&#39;t give you a chance to unhurried walking. It&#39;s a real self-experiment, road to survival will be hard!<br />\n▪ Realistic world:<br />\nChanging seasons, huge map of the USSR and more than 2,700 different towns and cities. Survive in the woods and hunt animals, but be careful: even rats can seriously injure you! Explore the wilderness of zombie rpg games!<br />\n▪ Endless possibilities:<br />\nMulticraft, acquiring skills, hundreds of crafting recipes, lots of ammunition.<br />\n▪ People and stories:<br />\nExciting quests and helpful allies on your road to survival. Survive in open world after nuclear war.<br />\n▪ Improve your skills:<br />\nMechanics, chemistry, shelter survival and much more.<br />\n▪ Cooperative mode:<br />\nOnline mode with chat, item exchange and joint fights. Multiplayer survival strategy games.<br />\nSurvive in a post-nuclear war in real simulator USSR: overcome disease, hunger and enemies! Play open world games Online too! Survive together with other players.<br />\nExplore survival shelter and abandoned buildings. Find weapons and build transport using various materials.<br />\nRemember everything you ever learned about chemistry and physics! It&#39;s an incredibly realistic survival quest game!<br />\nFeatures:<br />\n- Сraft system – get resources, hunt, find useful objects or weapons and create your own in survival quest!<br />\n- Hardcore shelter simulator<br />\n- Journey across the wilderness map in multiplayer mode<br />\n- Choose the difficulty of the adventure games: sandbox, real life or online&amp;<br />\nWar never changes. In 1985, the USSR collapsed before an unknown enemy. Within days, the entire country became a radioactive wasteland – violence, hunger and disease reign here now. When you no longer lose in the fight to survive, other survivors await you in coop – Online mode in adventure games lets you survive together, dealing with hardship, talking in chat and sending gifts to each other. Try to survive zombie apocalypse!<br />\nLicense agreement: https://dayrtech.ru/conditions/en/</p>", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-24T12:08:26", "background_image": "https://media.rawg.io/media/screenshots/b54/b5493eca9d1809758fb7619254e6448a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "dropped": 1, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 215, "game_series_count": 0, "reviews_count": 2, "platforms": ["Android"], "developers": ["tltGames"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}