{"id": 220791, "slug": "pipe-out", "name": "Pipe Out", "name_original": "Pipe Out", "description": "💎Pipe Out - the best brain-teaser is a gift for every pipeline puzzle lover. If you are a big fan of pipe connection puzzle, do not miss this great FREE pipeline game! <br/><br/>It is not only a well-known pipe connecting game for children, but also for adults and families. Everyone can enjoy the fun of plumbing! We guarantee an amusing, inspiring pipe puzzle. All pipe plumbing fans, get ready for your exciting pipe plumbing journey!<br/><br/>Features of the best plumbing game--Pipe Out: <br/> <br/>🔧 250+levels and soon will be more: from a pipe beginner to a plumbing master.<br/>🔧 Pipe connection for everyone: brain stimulation for children, great relaxation for adults.<br/>🔧 Limitless moves: find out the best plumbing connection strategy before working on pipelines to reach the best record!<br/>🔧 Offline pipe connection available: enjoy the pipeline fun anytime, anywhere.<br/>🔧 Simple and beautiful graphics offers the best pipe gaming experience when connecting the pipes<br/>🔧 Support tablet <br/><br/>Plumb the pipelines by adjusting the direction of the pipes. Using different strategies will help to link all the stuck pipes together. <br/><br/>This kind of pipe puzzle game is the best teaser game for the brain. It’s challengeable, educational and addicted for adults and families who love physic puzzle games. <br/><br/>You will become the master pipes plumber in Pipe Out by spending as fewer moves as possible and plumb all the pipelines. <br/><br/>NOW download Pipe Out for FREE and plumb all stuck pipes! If you want more logic puzzle games, please check out Poker Power the developer, do not miss our other games-Line Out and Puzzle Out!", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:07:36", "background_image": "https://media.rawg.io/media/screenshots/a8c/a8cb2805ab46e279d0ae14b9eefa0ffc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 63, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Poker Power"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}