{"id": 220789, "slug": "left-to-survive-pvp-zombie-shooter", "name": "Left to Survive: PvP Zombie Shooter", "name_original": "Left to Survive: PvP Zombie Shooter", "description": "Grab your guns and bring your guts to survive the ultimate action-shooter game, Left to Survive.<br/><br/>Danger lurks everywhere. Survive against zombies using rifles, grenades, shotguns, and anything in your arsenal to secure safe havens and save survivors. Build your encampment to defend yourself against enemy attacks. Get to the chopper and lay waste on enemy bases to steal their resources. Battle other players in solo and team multiplayer tournaments. Band together with other human factions.<br/><br/>Kill Hordes of Zombies<br/>Save stranded survivors and purge zombie-infested areas using a pack of weapons with intense firepower<br/><br/>Destroy Bases From A Helicopter<br/>Get to the chopper and unleash a fiery bullet storm on your opponent’s base to steal their resources<br/><br/>Intense PvP<br/>Think zombies are deadly? Test your survival skills against live players in solo and 2v2 matches<br/><br/>Challenge Zombie Bosses<br/>Defend yourself against zombies that can jump, wear police armor, or explode with toxic gas<br/><br/>Build and Customize Your Base<br/>Build, customize, and defend your encampment from zombies and rival factions. Locate survivors, loot materials and band together to overcome a post-apocalyptic world<br/><br/>Left to Survive is free to play, but you can choose to pay real money for some extra items.<br/> <br/>- For information about how My.com B.V. collects and uses your data, please read our privacy policy at: http://legal.my.com/us/games/mobile_privacy/<br/>FOLLOW US at<br/>Twitter @Whalekitgames<br/>facebook.com/LefttoSurvive<br/><br/>- If you have a problem with this game, please contact us at: lefttosurvive@corp.my.com", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-31T04:29:44", "background_image": "https://media.rawg.io/media/screenshots/b66/b66673702d8b3b625a195f98c750949f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 457, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["MY.COM"], "genres": ["Action"], "publishers": [], "esrb_rating": "Mature"}