{"id": 22072, "slug": "bokida-heartfelt-reunion", "name": "Bokida - Heartfelt Reunion", "name_original": "Bokida - Heartfelt Reunion", "description": "<strong>Bokida - Heartfelt Reunion</strong> takes place on a dormant, seemingly monochromatic world of light that gradually reveals its beauty. Experience freedom while exploring an intriguing environment. Journey, using your abilities to reunite two planets who were separated a long time ago.Features<ul><li>Explore a stark environment rich with the potential for playfulness<br/></li><li>Change the world around you, building and altering massive structures<br/></li><li>Solve puzzles to radically transform the landscape<br/></li><li>Relax and enjoy the experience of an intriguing world rich with mysteries</li></ul><br/><br/><br/>Bokida's setting is defined by two worlds: the vast and open light world which invites exploration; and the dark world, home to another realm of mystery. These two gigantic entities have been separated for a very long time, but this is about to change. <br/><br/>Like two lovers longing to reunite after having been kept apart for far too long, these two worlds finally have a chance to be as one again.<br/><br/>Be the messenger. Awaken the light world, guide the dark world, and help reset the equilibrium that has kept the lovers apart.<br/><br/><br/><br/>At the core of the experience rests a powerful tool. Create colorful structures with the abilities it grants, cut and sculpt them with precision and clear away cut-off fragments. Express your creativity and navigate the massive, open world however they you wish.<br/><br/>Exploration revolves around the playful manipulation of this tool to engage with and harness the virtual environment. Bring life to the canvas of the computer screen by adding your touches of color. The initially dormant game world is transformed and turns into a place of beauty. Discover majestic landscapes to roam and dive into another reality...<br/><br/>", "metacritic": 75, "released": "2017-05-17", "tba": false, "updated": "2019-08-28T22:07:46", "background_image": "https://media.rawg.io/media/screenshots/0cf/0cf2af2ba2ebecaea3c37de63bea9642.jpg", "website": "http://bokida.com/", "rating": 0.0, "rating_top": 3, "added_by_status": {"yet": 5, "owned": 47, "beaten": 1, "toplay": 1, "dropped": 1}, "playtime": 2, "achievements_count": 27, "ratings_count": 5, "suggestions_count": 208, "game_series_count": 0, "reviews_count": 5, "platforms": ["PC"], "developers": ["Rice Cooker Republic"], "genres": ["Adventure", "Indie"], "publishers": ["Rice Cooker Republic"], "esrb_rating": null}