{"id": 220856, "slug": "avakin-3d-avatar-creator", "name": "Avakin - 3D Avatar Creator", "name_original": "Avakin - 3D Avatar Creator", "description": "PLEASE NOTE: In the interest of safety for all of our users, Avakin requires you to be at least 17 years old to register and play<br/><br/><br/>Choose an outfit in your wardrobe, communicate with friends, beat challenges and change your look to suit your mood. REALLY change it! Avakin offers a wide range of customisation options for your avatar’s body, face, hair and clothing. Make a replica of yourself, or your total opposite – let your creativity run free!<br/><br/><br/>Avakin is a unique social avatar platform offering one account shared across multiple applications – move between dressing up and playing games with ease. Make new friends – find like-minded souls by reviewing people’s interests in their profiles. Complete milestone challenges and reap the rewards – explore all Avakin has to offer and receive FREE Gems to spend on more clothes, hairstyles and features for your avatar. <br/><br/><br/>Got a question or a suggestion? Head to Avakin’s forums to talk to the developers and the community. Avakin is a world shaped by its users. Be part of the evolution!<br/><br/><br/>• CONSTANTLY EVOLVING: Frequent updates<br/>• CONSTANTLY EXPANDING: Frequent additions to clothing catalogue <br/>• SOCIAL: Send gifts and messages to friends<br/>• BEAUTIFUL: Fully realised 3D graphics <br/>• MULTI-PURPOSE: Manage all your activity from the Dashboard<br/>• MULTI-LINGUAL: Supports English, French, German, Spanish and Italian<br/>• FREE TO PLAY", "metacritic": null, "released": null, "tba": false, "updated": "2022-12-27T13:19:34", "background_image": "https://media.rawg.io/media/screenshots/d66/d6683f1d7b562f49703876a1707bee41.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 3, "suggestions_count": 168, "game_series_count": 0, "reviews_count": 3, "platforms": ["Android"], "developers": ["Lockwood Publishing"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}