{"id": 220879, "slug": "governor-of-poker-2-offline-poker-game", "name": "Governor of Poker 2 - OFFLINE POKER GAME", "name_original": "Governor of Poker 2 - OFFLINE POKER GAME", "description": "Texas Holdem Poker is the world's favorite online poker game. Now Play the best hold'em poker on your Android offline, NO WIFI REQUIRED! Beat every cowboy in Texas, in this great \"Texas Hold em\" Poker app called Governor of Poker 2 !<br/><br/>Millions of poker players have enjoyed Governor of Poker, without an internet connection.<br/>With an easy Texas Holdem Poker tutorial for players that don't know how to play Texas poker, but want to learn poker and good opponents for star poker players with real texas poker skills!<br/>The poker chips you win with player Texas Holdem are required to buy houses, win transportation, play against advanced poker AI cowboys, win Texas and beat the new Governor of Poker.<br/><br/>TRY GOVERNOR OF POKER 2 FOR FREE, THEN UNLOCK THE FULL POKER RPG ADVENTURE IN THE GAME!<br/><br/>•Get ready for many hours and hours of Hold'm Poker play:<br/>- Over 80 challenging poker players to beat;<br/>- 27 stunning casino saloons in 19 amazing Texas Holdem cities;<br/>- Get hold of the five big poker assets.<br/><br/>•Amazing and Fun Texas Poker AI Engine:<br/>The best poker engine will challenge poker beginners and world poker champions alike.<br/>Refine your card tactics to match the countless holdm poker playing styles of your opponents and watch them go \"Steamy\" and Tilt after showing off your great card bluffs!<br/>The offline Players will play better in each new city and poker tournament, no cheating allowed!<br/><br/>•Full Story and Progression:<br/>Governor of Poker 2 starts where the first game ended.<br/>A new Dallas government decided to put a ban on all Texas Holdem poker games and now considers the game to be illegal in Texas.<br/>Take matters in your own hands and prove them wrong! Poker isn't a game of luck, but requires poker skill.<br/><br/>•Play Always and Everywhere Poker offline, no internet connection required:<br/>There is no live internet connection required to play a good game of Texas hold'em poker, you can just play Governor of Poker 2 offline anywhere you want!<br/>Don't wait for real world players in multiplayer poker games, that don't respond or leave the pokergame or go all in every poker hand. Just play this singleplayer pokergame against realistic AI players!<br/><br/>•Customize poker characters:<br/>Prove you are a big shot by customizing your poker style to fit your reputation. Vvisit one of the many great cowboy hat shops across Texas and get yourself the poker deluxe hat of your dreams!<br/>The game includes HD Poker graphics for a great experience on all Android mobile devices: phones and tablets.<br/><br/>Travel through Texas by Train, Casino Boat or Coach and play poker whilst on your way to the next poker city in Texas.<br/>Every city has lots of exciting cash games and big poker tournaments with even bigger Chip prizes, competition and bigger tournaments. You’ll experience more checks, calls, raises, folds and all-ins than you can imagine!<br/>Enjoy sit-n-go tournaments, Wildcard tournaments, highstake poker, Cash games.<br/><br/>** NO WIFI CONNECTION REQUIRED **<br/><br/>Have you always been a Texas holde'm pokee fanatic? You'll love Governor of Poker 2! What are you waiting for cowboy? Click install, download and prove you're worthy of the great poker title: GOVERNOR OF POKER !<br/><br/>**** Governor of Poker 2 Reviews ****<br/>- Gamezebo: \"Makes poker accessible without being too simple. Great sense of personality. Excellent poker tutorial.. It's a Royal Flush.\"<br/>- Jayisgames: \"Governor of Poker 2 is well-made, highly accessible, and surprisingly addictive for all kinds of players.\"<br/>- Zylom: \"Play this challenging poker game now!\"<br/>- Miniclip 5 stars out of 5: \"Howdy! Finally it’s here, Governor of Poker 2! Packed with lots and lots of poker extra’s! More cities to conquer and tournaments to play!\"<br/><br/>** NOTE:<br/>This pokergame is FREE to play in Amarillo, but will require IAP to enjoy the full game.<br/>Please contact support@youdagames.com if you have any issues or suggestions, we would love to help!<br/>Facebook : https://www.facebook.com/governorofpoker2<br/><br/>Download Governor of Poker 2 now and enjoy the Texas Holdem Poker Adventure!", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-31T04:29:04", "background_image": "https://media.rawg.io/media/screenshots/12c/12c61642bd40817612e2fba784584d26.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 166, "game_series_count": 4, "reviews_count": 0, "platforms": ["Android"], "developers": ["Youda Games Holding"], "genres": ["Card"], "publishers": [], "esrb_rating": "Teen"}