{"id": 2208, "slug": "sentinel-4-dark-star", "name": "Sentinel 4: Dark Star", "name_original": "Sentinel 4: Dark Star", "description": "Sentinel’s award-winning strategy gameplay expands explosively as the interstellar war moves to a mysterious alien world. Deploy devastating new towers and technology against an enemy that’s smarter and more deadly than ever before as you explore the mystery of the Dark Star.CONQUER<ul><li>A huge campaign across 31 unique maps, each also playable in Endless mode.<br/></li><li>Defend massive, multi-screen landscapes and marathon paths.</li></ul>DESTROY<ul><li>A bestiary full of new and returning enemies. Their special abilities and varied behaviour will keep even veteran players on their toes.<br/></li><li>The aliens fight back with the ability to damage, disable and destroy towers.</li></ul>LOCK'N LOAD<ul><li>Control three varied Commander heroes to back up your defenses. Earn experience and level up to gain powerful new abilities.<br/></li><li>Pick your loadout from an extensive assortment of weaponry. Unlock Uber Towers that pack power to match their size.<br/></li><li>Deploy your own units onto the path to hinder attackers.<br/></li><li>Call in support from the skies with the Sentinel's trademark ship weapons.<br/></li><li>Unleash drones, nukes and more from your new improved Stronghold.</li></ul>REWARD<ul><li>Spend your earnings on a massive selection of persistent upgrades to support your play style and complement your tactics.<br/></li><li>Upload your score to the Global Nexus and contribute to the worldwide cooperative push for rewards.<br/></li><li>Leaderboards and achievements with SteamWorks.</li></ul>PRESS<ul><li>\"This is a big and beefy tower defense game, meant for people not afraid of depth\" - Gamezebo <br/></li><li>\"I would highly recommend picking up this addictive game\" - Engadget <br/></li><li>\"A rich and absorbing tower defence experience\" - Pocket Gamer <br/></li><li>\"Welcome to the gold standard of TD\" - Touch Arcade</li></ul><br/><br/>http://www.origin8.com/sentinel4<br/><br/>Follow us @origin8 on Twitter, Facebook <br/>http://www.origin8.com", "metacritic": null, "released": "2014-08-14", "tba": false, "updated": "2022-11-11T12:20:32", "background_image": "https://media.rawg.io/media/screenshots/a73/a73e0e7685a61ef6f6749bba656a430f.jpeg", "website": "http://www.origin8.com/sentinel4", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 46, "beaten": 2, "dropped": 1}, "playtime": 5, "achievements_count": 54, "ratings_count": 4, "suggestions_count": 551, "game_series_count": 0, "reviews_count": 4, "platforms": ["PC", "Android", "iOS"], "developers": ["Origin8 Technologies", "Origin8"], "genres": ["Strategy", "Arcade", "Casual", "Indie"], "publishers": ["Origin8 Technologies"], "esrb_rating": null}