{"id": 220808, "slug": "crosswords-puzzles-for-adults", "name": "Crosswords puzzles for adults", "name_original": "Crosswords puzzles for adults", "description": "A crossword puzzle quiz is a word puzzle that normally takes the form of a square or a rectangular grid of white and black shaded squares. <br/><br/>The goal of every crossword grid is to fill the white squares with letters, forming words or phrases, by solving clues which lead to the answers. In languages that are written left-to-right, the answer words and phrases are placed in the grid from left to right and from top to bottom. The shaded squares are used to separate the words or phrases.<br/><br/>These \"Free Crossword grids puzzles\" Application offers 290 free cross words puzzles grids divided in 4 different size:<br/><br/>- crossword grids size 9x9 :  110 x Free Crossword Grids <br/>- crossword grids size 11x11 : 80 x Free Crossword Grids <br/>- crossword games size 13x13 : 65 x Free Crossword Grids <br/>- crossword games size 15x15 : 35 x Free Crossword Grids <br/><br/>Other functionalities of this fun and free crossword puzzle grid application in different size:<br/><br/>- Crossword solutions always present<br/>- With a special button. it is possible to check the correctness of puzzles answers.<br/>- Aid extra in case of difficulties with the crossword (shows single letter or word)<br/>- The challenging Crossword puzzles can be saved and completed when you want.<br/>- The incorrect letters are marked in red.<br/>- The word games different grids can be solved off-line and no registration is required.<br/>- Simplified typing method<br/><br/>The Crosswords Puzzles available in this app are similar to the NYTimes crosswords quiz.<br/>Please consider the following suggestions to solve the crosswords puzzles games:<br/><br/>- Any time a clue contains the tag \"abbr.\" or an abbreviation more significant than \"e.g.\", the answer will be an abbreviation (e.g., M.D. org. = AMA).[6]<br/><br/>- Any time a clue ends in a question mark, the answer is a play on words.[6]<br/><br/>- Spoken phrases are always indicated by enclosure in quotation marks, e.g., \"Get out of here!\" = LEAVE NOW.<br/><br/>- Short exclamations are sometimes clued by a phrase in square brackets, e.g., \"[It's cold!]\" = BRR<br/><br/><br/><br/>For much more word puzzle games grid and Crosswords, a professional version (Ads free) is available.<br/><br/>Have Fun", "metacritic": null, "released": null, "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/931/9314605ceecaf9ee734f76c844770795.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 129, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["A. Baratta"], "genres": [], "publishers": [], "esrb_rating": "Everyone"}