{"id": 220812, "slug": "legacy-2-the-ancient-curse", "name": "Legacy 2 - The Ancient Curse", "name_original": "Legacy 2 - The Ancient Curse", "description": "Test your intelligence and memory in this challenging 3d puzzle game. Keep your eyes open, the solution is there. Set out on an adventure and can you escape the pyramid?<br/><br/><br/>Play as an archaeologist who sets out on an adventure to find your brother who's gone missing in an ancient pyramid filled with rooms and puzzles. In the pyramid you encounter riddles and puzzles that need to be solved to take you to the next room, and hopefully an escape. <br/><br/>No Signal Productions is very proud to present this mystery-filled puzzle game that will force you to think twice before advancing to the next room.<br/>A classical point-and-click adventure game updated with 3D-graphics and physics-based puzzles that create a new depth to the puzzle and escape room genre.<br/><br/>BEAUTIFUL VISUALS IN 3D<br/>Legacy 2 - The Ancient Curse is in 3D, making it stand out from traditional puzzle escape adventure games.<br/><br/>CHALLENGING PUZZLES THAT MAKES SENSE<br/>When encountering a new puzzle you are challenged to think before clicking. Do you have the correct item to solve it and escape the pyramid? <br/><br/>PICK UP ITEMS AND INSPECT CLUES<br/>The rooms are filled with items and clues that are there to help you on your quest. Interact with amazing touch controls to inspect your newly found keys and tools.<br/><br/>PRETTY COOL GRAPHICS<br/>Gorgeous and natural looking locations designed with simplicity in mind creates a compelling and mysterious atmosphere. <br/><br/><br/>I'm a solo indie game developer, if you like go give me feedback or need support do not hesitate to send me an e-mail!<br/>-------------------------------------------------------------------------------------------------------------", "metacritic": null, "released": "2017-11-20", "tba": false, "updated": "2024-01-06T06:34:16", "background_image": "https://media.rawg.io/media/screenshots/4de/4de28afe780ca7fac50d4246b1afcd01.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 344, "game_series_count": 0, "reviews_count": 1, "platforms": ["Android", "iOS"], "developers": ["No Signal Productions", "David Adrian"], "genres": ["Adventure", "Puzzle"], "publishers": ["David Adrian"], "esrb_rating": "Everyone"}