{"id": 220888, "slug": "how-to-play-poker-learn-texas-holdem-offline", "name": "How to Play Poker - Learn Texas Holdem Offline", "name_original": "How to Play Poker - Learn Texas Holdem Offline", "description": "Learn how to play poker! From an introduction to basic poker rules, to advanced poker tactics. This offline poker app explains the hand combinations, poker terms, hand rankings, who wins, split pot, side pot and much more! It's poker explained in an easy way with clear instructions and lessons.<br/> <br/>Practice while you learn texas holdem rules! This poker trainer teaches poker dummies, but also has great poker tips for advanced holdem online players.<br/> <br/>This Poker Tutorial includes:<br/>- Instruction for beginners and advanced poker players.<br/>- Clear tutorials about when to fold, how to bet and when to go all-in.<br/>- A cheat sheet, a manual for poker hand ranking, learn what beats what in hand values. It's easy to learn as it matches yahtzee rules.<br/>- Quick rules on hands to play and when to fold.<br/>- Instructions for All in rules.<br/>- Learn how split pot works.<br/>- How does a side pot work.<br/>- Betting rules and who will win in poker.<br/>- Practice offline poker, no internet required, and get yourself ready for poker online.<br/>- Poker game rules are explained.<br/>- Tips are paused, so you can read and learn poker on your own pace. You don't need to pause any video tutorial, you will learn it at the poker tables.<br/>- Learn hand analysis and poker odds and probability.<br/> <br/>Be a poker star in a Vegas Casino! Install this great poker app now and learn Texas Holdem poker today!<br/> <br/>Note:<br/>-This easy to use Android app is offered for free by the offline and online Poker Game: GOVERNOR OF POKER!<br/>- Suggestions or issues: support@governorofpoker.com<br/>- Facebook: https://www.facebook.com/GOP3/<br/>- Youtube: https://www.youtube.com/user/youdagames", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:07:23", "background_image": "https://media.rawg.io/media/screenshots/b99/b99cbf721e882424daa474f68ceee26b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 183, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Youda Games Holding"], "genres": ["Card"], "publishers": [], "esrb_rating": null}