{"id": 220862, "slug": "avakin-starstyle", "name": "Avakin Starstyle", "name_original": "Avakin Starstyle", "description": "PLEASE NOTE: In the interest of safety for all of our users, Avakin requires you to be at least 17 years old to register and play<br/><br/><br/>Get ready to strut your stuff on the catwalk and turn your passion for fashion into prestige and rewards! Style your Avakin to perfectly embody the competition theme then turn them loose against other Avakin fashionistas. When you've had your fill of dressing to impress, run your practised eye over the competitors and turn judge, voting on who should win or lose. <br/><br/><br/> Competition themes may require you to demonstrate your flair for a particular style (eg. Luxury Evening Wear), or convey a concept via the medium of clothing (eg. Romance). Consider every aspect of your Avakin's appearance from hairstyle to animation if you want to come out on top. Win rewards by placing in the top three, or being a regular judge. Try for a place on the Leaderboards, or just take pleasure in watching your Avakin blossom as a model by tracking your statistics.<br/><br/><br/>After a hard day's judging or modelling, you can celebrate or commiserate in the Starstyle Afterparty Space, Avakin Life's dedicated Starstyle location. It's the ideal spot to meet up with like-minded friends or make new ones.<br/><br/><br/>• COMPETE: Enter fashion competitions<br/>• CREATE: Select your category, clothes, hairstyle and animations <br/>• INTERACT: Judge competition entrants<br/>• IMPROVE: Track wins and entries in your statistics <br/>• ACHIEVE: Top leaderboards for most wins, votes and best dressed<br/>• RECEIVE: Rewards for winners and frequent voters<br/>• ENGAGING: Socialise with friends in the Starstyle Afterparty Space<br/>• EVOLVING: Frequent updates to animations and competition categories<br/>• MULTI-PURPOSE: Manage all your activity from the Avakin Dashboard<br/>• SINGLE ACCOUNT: One Avakin account is all you need", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:07:26", "background_image": "https://media.rawg.io/media/screenshots/be9/be9796eede6484961c1a9ee600cb3b1f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 196, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Lockwood Publishing"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}