{"id": 220885, "slug": "jewel-crush-jewels-gems-match-3-legend", "name": "Jewel Crush - Jewels & Gems Match 3 Legend", "name_original": "Jewel Crush - Jewels & Gems Match 3 Legend", "description": "Jewel Crush, match 3 puzzle with addictive and exciting adventure, classic jewels match legend.<br/><br/>Match and quest jewels in fun gameplay to complete the mission goals💎.<br/>It has a beautiful and cute gamestyle, ideal for girls to play with their families and to play in anytime and anywhere! <br/>Be the jewel stars and unlock the castles in this legend game. <br/>Designed for the beautiful girls.<br/>Easy to control, fun to play, beautiful graphics!<br/>Just swap &amp; match with your finger💯!<br/><br/>How to play:<br/>👉 You have a specific list of goals in each level.<br/>👉 Match 3 or more identical gem-jewels in a line to crush them.<br/>👉 Match 4 in a row or column to create special direction jewels.<br/>👉 Match 5 in T or L to create special jewels bomb. <br/>👉 Match 5 in a line to create special color jewels. <br/>👉 You must have the sharpest mind. Learn to use special jewels.<br/>👉 If you have any difficulties passing a level you can use helpful props.<br/>👉 Combine special jewels to make huge chain reaction to help you pass the level.<br/><br/>Special highlights：<br/>📎 Direction Jewels: it will can destroy all jewels in a line.<br/>📎 Jewels Bomb: it will can destroy all jewels around it.<br/>📎 Color jewels: it can destroy all jewels with the same color of selected gem.<br/>📎 Super value gift: Diamond and props power-ups help you pass level<br/>📎 Less moves, More Stars, Higher scores! Crush all jewels🏆!<br/>📎 Pass the levels and try to get all stars in each level.<br/>📎 Try your best to make super combinations with super match!<br/><br/>Colorful crushing effects and well designed puzzles for you to play in anytime and anywhere🦄!<br/><br/>Features:<br/>★ Designed for the beautiful girls<br/>★ Easy and free fun to play, challenging to master.<br/>★ 1500+ well-designed puzzle levels.<br/>★ Daily free bonus in the games🍭.<br/>★ Helpful magical bossters to win jewels stars.<br/>★ Games you can play offline.<br/>★ No WIFI? No Problem!<br/>★ Classic jewels match 3 game.<br/><br/>Let's go Matching 3 Jewels and crushing never stop👣!<br/><br/>**********<br/>Welcome to join our Facebook Homepage : https://www.facebook.com/LeyooMatch/<br/>In this big family, we can discuss products and optimize products together.", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-31T01:38:08", "background_image": "https://media.rawg.io/media/screenshots/2fe/2fee14f47db999816e3cbcaad58abb70.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 128, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Ivy", "BAD & BRO"], "genres": ["Casual"], "publishers": [], "esrb_rating": "Everyone"}