{"id": 220869, "slug": "avakin-poker-3d-social-club", "name": "Avakin Poker - 3D Social Club", "name_original": "Avakin Poker - 3D Social Club", "description": "PLEASE NOTE: In the interest of safety for all of our users, Avakin requires you to be at least 18 years old to register and play<br/><br/><br/>Card shark or new fish? Avakin Poker caters to poker players of all abilities, so pull up a chair and go all in on the excitement of Texas Hold ‘em absolutely FREE. Join players from across the world for a high stakes games, play against friends or dive in for a quick game against strangers. Friend stuck behind a PC while you’re on a tablet? Don’t worry – Avakin Poker allows cross-device play on any device that supports Avakin Poker.<br/><br/><br/>Show off your personality at the poker table with a custom chair – Avakin Poker has chairs to intimidate, impress and distract. They’ll have a hard time noticing you’re bluffing if you’re sitting on a sheep…..<br/><br/><br/>Low on chips? Ask a friend to gift you more. You can always return the favour once you get back on that winning streak. <br/><br/><br/>• FREE TO PLAY: Free chips to get you started<br/>• PLAY TO WIN: Climb the leaderboards <br/>• EVOLVING: Frequent updates<br/>• ENGAGING: Fully realised 3D graphics <br/>• SOCIALISE: Hang out in the Social Room and chat to old friends and new<br/>• CUSTOMISE: Use your fully customised avatar from the sister application, Avakin<br/>• MULTI-PURPOSE: Manage all your activity from the Avakin Dashboard<br/>• MULTI-LINGUAL: Supports English, French, German, Spanish and Italian", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:07:24", "background_image": "https://media.rawg.io/media/screenshots/9ab/9ab958b9a8efd093df300ce30d8d6851.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 153, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Lockwood Publishing"], "genres": [], "publishers": [], "esrb_rating": null}