{"id": 220865, "slug": "governor-of-poker-3-texas-holdem-poker-online", "name": "Governor of Poker 3 - Texas Holdem Poker Online", "name_original": "Governor of Poker 3 - Texas Holdem Poker Online", "description": "Do you feel lucky? Play Poker online in this great multiplayer Texas Hold'em Poker game and enjoy Texas Holdem in: Cash games, Spin &amp; Play, Sit &amp; Go tournaments, Royal Poker, Friends game, online Blackjack 21, Big Win and much more in the different Wild West saloon competitions! <br/><br/>The Governor of Poker (GoP) series is known as the best free offline poker entertainment game. Texas Hold'em Poker online is the enhanced mobile version of the best multiplayer card game worldwide: Enjoy the real time multiplayer Texas Holdem competition! Join our PvP casino stars club in Vegas western style!<br/><br/>Raise the stakes, try our card games in this classic Vegas stars casino multiplayer challenge and take your chances to win the jackpot and become rich in this free online GoP cards tournament! <br/>You have time to learn winning card combinations, pokerhands and casino terms like all-in and showdown or when to fold or bet online - There is also a cheat sheet with all the hand rankings to increase your chances to win a fortune and become a billionaire as a lucky master of the deck of cards! Find out the best bet strategy to win in this PvP gambling competition challenge!<br/><br/>GOVERNOR OF POKER 3 (GOP 3) FEATURES:<br/><br/>- BIG FREE CHIP STACK: 30,000 free chips, free gold, jackpot spinning wheel and a hat for every new casino saloon player!<br/>- 7 TEXAS HOLD’EM TYPES: Cash games, Sit N Go tournaments, Heads up Tournament with chests, Push or Fold, Big Win, Royal Poker and Spin &amp; Play gambling jackpot. <br/>- UNIQUE MULTI-TABLE MODE: Play on PvP multiple tables - highly recommended for advanced players who know how to bet and compete in poker multiplayer tables properly!<br/>- ENJOY PVP VEGAS CASINO GAMBLE: Travel through Texas by winning exclusive online tournaments with your best cards and your bet strategy, beat friends at Texas Holdem games and Big Win Poker card tournaments - Countless card games exist, but Texas Holdem is much more addictive than Video Poker, Baccarat or other gambling games and slot machines!<br/>- GUEST MODE – Bet at the competition tables of Texas Hold’em anonymously. Feel free to bluff players to win the jackpot!<br/>- BLACKJACK 21: Different betting amounts like in an offline Vegas casino card game but with more odds of obtaining benefits!<br/>- TROPHIES, PRIZES, REWARD &amp; STATUS: Become a millionaire VIP player, High roller, Poker Shark, VIP+ or Elite status in this free online multiplayer competition.<br/>- PLAY WITH FRIENDS:  Accept this stars casino cards challenge and invite your friends to join you in our gamble saloon!<br/>- FAIR CARDS TEXAS HOLDEM PVP GAME - We shuffle the cards with the best proven methods. So no roulette or bingo poker!<br/><br/>Are you ready to compete in multiplayer tournaments? Money from our huge jackpots awaits you in our Las Vegas casinos! Start betting now and may the luck be with you in this competition!<br/><br/>This PvP online Vegas casino card game is intended for an adult audience (e.g for use by those 21 or older). This Texas Holdem card game does not offer real money gambling or an opportunity to earn real money, rewards or prizes.<br/>Practice or success at this bet game does not imply future success at \"\"real money\"\".<br/>--------------------<br/>Support: support@governorofpoker.com", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:07:25", "background_image": "https://media.rawg.io/media/screenshots/54e/54eecf73e244ed14395c908b07b822a3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 207, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Youda Games Holding"], "genres": ["Card"], "publishers": [], "esrb_rating": null}