{"id": 22087, "slug": "gaben-kingdom", "name": "Gaben Kingdom", "name_original": "Gaben Kingdom", "description": "Take on the role of lord and savior Gaben and save the world from evil hands of vicious corporation. Embark on dangerous journey and save our beloved cheap games and game sales.<br/><br/>There are 70 levels scattered across 7 worlds that are waiting for you:<br/><ul><li>Spring Sale world<br/></li><li>Summer Sale world<br/></li><li>Autumn Sale world<br/></li><li>Winter Sale world<br/></li><li>Peasants' world (because everyone knows that PC Master Race is the only way to play)<br/></li><li>Brexit world (because laughing at politics is always fun)<br/></li><li>Corporate world (deal with these nasties, once and for all!)</li></ul><br/>You have one goal – to eliminate all the enemies on the map and reach the end of the stage. Remember that you have limited number of moves so plan you actions carefully.<br/><br/>Collect all dollars from the Gaben Kingdom and give some sales to your people. Only by doing that, you will be able to receive 3 stars on each level. Collect all stars on all levels and show everyone that you are the true Lord Gaben.<br/><br/>Choose your playstyle. Use lightning fast moves or plan your every move by using slow motion. Take on the challenge and try this simple but very addicting combination of action game and puzzle platformer.<br/><br/>Earn achievements. Collect cards. Become Lord Gaben.<br/>", "metacritic": null, "released": "2017-05-12", "tba": false, "updated": "2019-08-28T22:07:45", "background_image": "https://media.rawg.io/media/screenshots/5e6/5e62a8362f9b7ed9a60d86b1f334a123.jpg", "website": "http://www.gaben.aag-studio.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 34}, "playtime": 5, "achievements_count": 2, "ratings_count": 0, "suggestions_count": 217, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Mariusz Gibas"], "genres": ["Action", "Casual", "Indie"], "publishers": ["AAG Studio"], "esrb_rating": null}