{"id": 220933, "slug": "barbie-life", "name": "Barbie Life", "name_original": "Barbie Life", "description": "Welcome to Barbie Life™ - the official mobile destination of Barbie™! Get creative in the You Can Be Anything Photo Booth, piece together Barbie puzzles, play Dreamtopia games, explore an all-new level in the Barbie™ Video Game Hero game, watch videos and much more!<br/><br/>● GAMES: Be your own Video Game Hero, travel with Barbie across the galaxy and much, much more!<br/><br/>● COLORING CREATIONS: Create your own coloring pages!<br/><br/>● PHOTO BOOTH: Express your creativity with stickers and colorful filters in the You Can Be Anything Photo Booth! <br/><br/>● PUZZLES: Piece together Barbie scenes then watch as the puzzles magically turn into hidden object games!<br/><br/>● VIDEOS: Watch Barbie's best like Dreamtopia and Barbie LIVE! In the Dreamhouse, a new take on your favorite Barbie Life in the Dreamhouse episodes!<br/><br/>● ACHIEVEMENTS: Earn achievement badges along the way as you discover fun new ways to play!<br/><br/>Now the world of Barbie is at your fingertips! Download and play with the amazing Barbie Life app today!<br/><br/>This app allows users to create and modify photos. These photos are local to the device and never shared with any third parties or stored on our servers unless otherwise specified.", "metacritic": null, "released": "2014-01-30", "tba": false, "updated": "2023-03-02T20:40:18", "background_image": "https://media.rawg.io/media/screenshots/afc/afcf61e901f2350e8ba373f9c8e8d76e.jpg", "website": "http://kids.barbie.com/en-us", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 250, "game_series_count": 0, "reviews_count": 1, "platforms": ["Android", "iOS"], "developers": ["Mattel"], "genres": ["Adventure", "Casual", "Family"], "publishers": ["Mattel"], "esrb_rating": "Everyone 10+"}