{"id": 220999, "slug": "mobi-army-3", "name": "Mobi Army 3", "name_original": "Mobi Army 3", "description": "Năm 2014 tình hình thế giới diễn biến phức tạp, thế chiến  thứ 3 có thể bùng nổ bất cứ lúc nào. <br/><br/>Một lực lượng vũ trang tự xưng là ES đã xâm chiếm toàn Đông Á, Nam Phi và đang tiến hành áp dụng luật pháp diều hâu để kiểm soát 1 vùng lãnh thổ rộng lớn nơi đây, chúng khủng bố người dân, chiếm các mỏ dầu và tuyên bố sẽ thâu tóm toàn bộ các thành phố lớn ở các châu lục để thành lập một liên minh các quốc gia đưới trướng.<br/><br/>Các cường quốc trong khối vệ binh hòa bình Trái Đất GATO nhận thấy ES là mối đe dọa cho toàn nhân loại nên đã không kích chúng bằng máy bay và tên lửa Raptors, tuy nhiên chưa thể tiêu diệt được ES nếu không dùng tới bộ binh.<br/><br/>Tháng 10/2014 ES lại sát hại các nhà báo, các tình nguyên viên nhân đạo khi họ tham gia các chiến dịch tình nguyện tại các quốc gia mà ES có chiếm đóng và tham vọng thâu tóm GATO và các đồng minh quyết định cử các đội đặc nhiệm ưu tú nhất hành tinh SEAN, SWAN, SAT, DANTA và một đội đặc nhiệm bí ẩn đến các căn cứ tình nghi của ES và giải cứu người dân vô tội.<br/><br/>Bạn sẽ gia nhập lực lượng đặc nhiệm nào để tham gia chiến dịch lịch sử này ? hãy tham gia Mobi Army 3 và chọn đội mình yêu thích nhé.", "metacritic": null, "released": "2015-01-23", "tba": false, "updated": "2019-08-02T02:40:55", "background_image": "https://media.rawg.io/media/screenshots/04f/04f00c648fee411d03520905e1f4c353.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 245, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Teamobi", "Khoi Huynh"], "genres": ["Action", "Adventure", "RPG"], "publishers": ["Khoi Huynh"], "esrb_rating": "Teen"}