{"id": 220971, "slug": "wedrum-drum-set-music-games-drums-kit-simulator", "name": "WeDrum: Drum Set Music Games & Drums Kit Simulator", "name_original": "WeDrum: Drum Set Music Games & Drums Kit Simulator", "description": "Feel the beat at your fingertips in the ultimate mobile drumming experience. Throw down your sticks and get behind the drum kit of your dreams, as you say hello to the complete drum kit that fits right inside your pocket!<br/><br/>WeDrum is the free drum kit simulator that holds every type of drum kit you'll ever need to become a master of the sticks! Experience drumming in a real band by selecting a pianist, guitarist and a vocalist to play alongside you. Not an expert? Not a problem. WeDrum isn't only for drummers, it's also for people who just love music, so there's no skill level required to get playing!<br/><br/>WeDrum ensures that you have every tool you need to practice regularly and get the most out of your training. Developed by professional musicians the app consists of many complete kits, and tons of popular songs to play along with to improve your skills! Master rhythm and tempo as you become a beat machine as you study drumming from every genre.<br/><br/>AR Drum Kit<br/>Discover the most realistic mobile drum kit with the power of Augmented Reality. With AR you can build and place your drum kit wherever you like, all you need to do is tap go and start drumming! <br/><br/>◆◆◆ Key features ◆◆◆<br/><br/>SELECT: Choose your favorite song to drum along to out from a rich and varied catalog that features a wide variety of genres and artists! New free songs are added to the Songbook regularly. <br/>BAND: Pick a pianist, a guitarist and a vocalist to experience being in a real band! Learn to play in a group or go solo! <br/>PLAY: Drum along to your song of choice by following our dynamic hints and tips! Improve and master the drums!<br/>ACHIEVE: Keep up the tempo and earn the highest score you can! Hear the crowd cheering and feel like a real musician on stage! Perform an encore to see if you can better your score!<br/>SHARE: Make sure the world never misses a beat and share your drumming with friends! Show off your high scores on social media as you master the rhythm!<br/><br/>◆◆◆ More highlights ◆◆◆<br/><br/>SOLO mode lets you jam out and freestyle on a fully realistic drum kit simulator. Experience HD sound and incredibly realistic graphics!<br/><br/><strong>Here’s what else you get with WeDrum!</strong>: <br/><br/>Loads of drum kits to choose from!<br/>- Jazz  <br/>- Rock <br/>- Dance <br/>- Electric Pads (Electronic or Beat Pads) <br/>- Ethnic drums (Congas and Bongos) <br/>- Japanese drums and Taiko are coming soon!<br/><br/><strong>★ Advanced settings</strong>: <br/>- Mixing functionality to edit every sound!<br/>- Touch zones to help you learn each drum<br/>- Drum stick animations<br/>- A metronome so you never miss a beat<br/><br/><strong>★More WeDrum features!</strong>: <br/>- The fastest response time without any delays!<br/>- High-Quality audio and individual sound settings for every drum kit.<br/>- Every drum sound is recorded live by a professional!<br/>- Popular songs to learn and play along too! <br/><br/><strong>★ WeDrum is the perfect app to</strong>: <br/>- Learn to play the drums and electronic drum pads <br/>- Improve your sense of timing with exciting rhythm games <br/>- Travel and practice drums on the go <br/>- Spend your free time playing awesome drumming games <br/><br/>Are you going to become the next world famous drummer? Or maybe you're just looking to relax and play a few simple beats? How you play WeDrum is entirely up to you! This ultra-realistic drumming experience was designed for total access. Plunge into the world of drums, forge new skills, listen to great music and master the drum kit! It’s time to throw down your sticks and pick up your mobile! Your fans are waiting!", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:07:11", "background_image": "https://media.rawg.io/media/screenshots/eac/eaccf7d9a2f7d409713499d7abcec43b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 89, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Gismart"], "genres": [], "publishers": [], "esrb_rating": null}