{"id": 220924, "slug": "barbie-fashion-closet", "name": "Barbie Fashion Closet", "name_original": "Barbie Fashion Closet", "description": "Welcome to Barbie™ Fashion Closet - the perfect game to express yourself with fashion! Style Barbie and her friends from head to toe and help them make their dreams come true. <br/><br/>Choose a character and create fashionable looks! Apply makeup to Barbie and her friends while using fun face stencils to draw and color pretty designs. Be creative with hairdos by selecting from different styles and colors! Choose from hundreds of tops, bottoms, dresses and shoes to create the ultimate look and even create career outfits so the characters look great at their dream jobs! Once you’ve found the perfect outfit, play with a variety of backgrounds for a photo, then add accessories and stickers to add to the scene!  Get even more creative and add a fashion-inspired photo filter!  Now you’re ready for a photo!  You can save all your looks in your photo album and show your friends! <br/><br/>With your help, Barbie and her friends will be the most stylish crew around. We can’t wait to see what you dream up and create!<br/><br/>CHARACTERS.  Meet Nikki, Rene, Teresa, Barbie, and more of her friends to style and help make their dreams come true while exploring new places. <br/><br/>HAIR &amp; MAKEUP. Choose between a bun, ponytail, braid, and many more hairdos to fit your style. Color your model’s hair and set the mood. Apply magical makeup with color to pull your look together!<br/><br/>OUTFIT. Select between trendy tops and bottoms or chic dresses with hundreds of outfit combinations to choose from.<br/><br/>PHOTOSHOOT. Take pictures of your designs, save them in your photo album, share them with friends. Bring your creation to life with the AR feature, allowing you to take pictures alongside Barbie and her friends!<br/><br/>GAME FEATURES. Win collectible fashion items and unlock fun surprises, new careers with purchase packs, and make your dreams come true.<br/><br/>Tell your friends and have fun with the endless fun of Barbie™ Fashion Closet!<br/><br/>Privacy Policy: http://corporate.mattel.com/privacy-statement.aspx", "metacritic": null, "released": "2017-08-30", "tba": false, "updated": "2023-03-02T20:40:09", "background_image": "https://media.rawg.io/media/screenshots/7be/7be8ab31ec7047863be5c2852e3e270b.jpg", "website": "https://play.barbie.com/en-us", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 279, "game_series_count": 0, "reviews_count": 1, "platforms": ["Android", "iOS"], "developers": ["Mattel"], "genres": ["Adventure", "Casual", "Family"], "publishers": ["Mattel"], "esrb_rating": null}