{"id": 220995, "slug": "ninja-school", "name": "Ninja School", "name_original": "Ninja School", "description": "Only support Vietnamese language this time! Topics about ninja are not new! But it has always been a favorite subject for those who love fantasy, nostalgia or those who prefer secrecy, sneaky or something half evil half good. Indeed, Ninja is difficult to recognize the image as a true hero, but this character’s attractions seem never lost. To experience the world with the enchanting mythological Ninja or overcome the challenges with friends, we would like to introduce Ninja School Games Online! Ninja School Online is the online games for mobile devices. Our story is about young disciples, they are active, playful but energetic, and attend one of the three Ninjutsu schools. These schools are the Hirosaki, Haruna and Oozaka schools which physical training and improve skills from teenager age. The disciples are developed based on five factors: strength, speed, processing ability, patience and balance. Besides, each Ninja will be trained to face its own challenges and individual tasks or with fellow disciples to push their limits to the highest level. Depending on the player's choice and the guidance of the teachers that we can choose a variety of weapons from melee to long ranged from magical to be based on power. Moreover, their strength and spirits are tempered by the elements Water, Fire or Wind so the character Ninja of players will be unique. The characters in the games are built in with cute Chibi style, their moves are smooth, beautiful but it was strongly expressed and nice transformed. The landscape in game is outlined, simulations in the traditional Japanese style. Background music can smooth out the pace of games and match with context. Let’s play and enjoy your Ninja world!", "metacritic": null, "released": "2015-08-22", "tba": false, "updated": "2019-08-02T02:40:49", "background_image": "https://media.rawg.io/media/screenshots/ca5/ca5ea5ed9f5509d6816f6d01e4ea6d7c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 335, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Teamobi", "Khoi Huynh"], "genres": ["Action", "Adventure", "Arcade"], "publishers": ["Khoi Huynh"], "esrb_rating": "Everyone 10+"}