{"id": 220953, "slug": "chatsters", "name": "CHATSTERS", "name_original": "CHATSTERS", "description": "Call, text, and play with your CHATSTERS doll with the Chatsters app! You can do makeovers, watch hilarious videos, and have a dance party with your CHATSTERS. Send her a message, and she’ll text you right back – just like a real BFF! <br/><br/>CHATSTERS APP FEATURES <br/>•Call &amp; Text – you can call and text Gabby or Abby, and she’ll call and text you back. Sometimes she’ll leave you a voice mail if you aren’t allowed to pick up the phone! <br/>•Makeover – pop on over to the salon to give your Chatsters a makeover. Try on some different hair styles, fun nail polish colors, and get glam at the makeup station. You can even groom her pet puppy, Sprinkles! <br/>•Photo booth – Take pictures of you &amp; your Chatsters, your friends, or even your family, and decorate with adorable stickers. Once finished, you can download and save onto your album! <br/>•Music – Dance party! You can play some of Gabby’s favorite songs (or any music on your device) and have a dance-off with Chatsters! <br/>•Movie Theater – Watch funny little animation clips with your Chatsters – they especially love videos of hilariously cute animals <br/><br/>For more info on the app or the toy, please visit www.Chatsters.com", "metacritic": null, "released": "2014-08-25", "tba": false, "updated": "2019-10-22T14:39:22", "background_image": "https://media.rawg.io/media/screenshots/82d/82dc2d2f16868a1bd2680839102eee6b.jpg", "website": "http://www.spinmaster.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 79, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "Android"], "developers": ["Spin Master Studios", "Spin Master"], "genres": ["Casual", "Family"], "publishers": ["Spin Master"], "esrb_rating": "Everyone 10+"}