{"id": 221006, "slug": "bingo-free-bingo-games", "name": "Bingo - Free Bingo Games", "name_original": "Bingo - Free Bingo Games", "description": "Looking for the best free game you're going to find on phones and tablets?<br/><br/>It's BINGO time! Play one of the best FREE Bingo games on Android! Bingo by Absolute Games is free to play with lots of bonuses and coins. Best of all, you can play Absolute Bingo anywhere you want as the game can be played offline with no internet connection.<br/><br/>ABSOLUTE BINGO FEATURES<br/><br/>✪ FREE bingo play - get free coins to play every 4 hours<br/>✪ FUN bingo rooms and mini games<br/>✪ Great bingo odds and GENEROUS payouts<br/>✪ PLAY up to 4 bingo cards<br/>✪ Play OFFLINE or play free online too! You can play anywhere, anytime<br/>✪ PAUSE the game whenever you want<br/>✪ CHANGE your game SPEED - play faster or slower as you please<br/>✪ WIN powerups in the special casino slots game (unlocked at higher levels)<br/><br/>If you love bingo and are looking for a fun new bingo game, this is the game for you.<br/><br/>DOWNLOAD THIS TOP FREE GAME NOW<br/><br/><br/>Need help?<br/>Send us a message inside the game!  We respond to all messages!<br/><br/>Follow us to get news and updates:<br/>facebook.com/AbsoluteBingo<br/><br/><br/><br/>Are you new to bingo? <br/>American bingo is one of the most popular games out there for when you're bored!  75 card bingo is played on a 5x5 grid with numbers 5 across and 5 down.  Each grid square contains a letter and a number.  Match any 5 numbers across, down, or diagonal and call bingo to win!  Try it out!<br/><br/><br/>PLEASE NOTE : This app lets you purchase digital content using real money. You can turn off payments by disabling in-app purchases in your device settings.<br/><br/>Bingo does not offer \"real money gambling\" or an opportunity to win real money or prizes.<br/>Practice or success at social casino gaming does not imply future success at \"real money gambling.\"", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-30T19:13:50", "background_image": "https://media.rawg.io/media/screenshots/94b/94b53fe9699d1cf7d2b4f99ac5d04183.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 279, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Absolute Games : Free Bingo Games"], "genres": ["Card"], "publishers": [], "esrb_rating": "Teen"}