{"id": 221088, "slug": "hercules-falls-in-love-gods-girls-school-crush", "name": "Hercules Falls in Love - Gods & Girls School Crush", "name_original": "Hercules Falls in Love - Gods & Girls School Crush", "description": "Make way for hunky Hercules! Your favorite godly hero is coming to Earth! Find out how wacky things get when Hercules has to dress up as a human and try to fit in at an earthly high school. Even gods fall in love! Hercules has a high school crush on a girl named Daphne… but will she ever love him back?!<br/><br/>Hercules was merrily enjoying a cloud bath in the sky, when his grumpy old dad Zeus sends him down to Earth to live among the humans for a day, to become less spoiled and lazy. He even has to dress up as a normal boy. What starts out as a mission to find his humanity turns into an exciting high school crush love story.<br/><br/>Features:<br/>&gt; Hercules must pretend to be a human, but his superhuman strength keeps getting him into embarrassing situations! <br/>&gt; Help Hercules do everything in his mighty power to get the human high school crush girl of his dreams, Daphne, in this love story game. But how will he fall in love when he’s so clumsy?!<br/>&gt; Dress up Hercules in cool human clothes &amp; style his hair so he fits in at school and impresses high school crush schoolgirl Daphne!<br/>&gt; Make delicious food for Daphne! Maybe all this high school crush love story needs is food!<br/>&gt; Publish a story about Hercules in the school newspaper - get his girl crush to notice him and fall in love!<br/>&gt; Design a beautiful diamond ring for Daphne, the girl of his dreams.<br/>&gt; Make Hercules an enormous ice cream sundae to mend his broken heart - Daphne won’t even notice that he exits!!!<br/>&gt; Daphne has finally agreed to a date! Dress up the two of them and find out if this love story is a success or a disaster! <br/><br/>The \"All Levels Pack\" allows you to enjoy the entire game! Complete each level individually to  advance to the next one and achieve your final goal.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:06:46", "background_image": "https://media.rawg.io/media/screenshots/77c/77cefdf2a48800677e46a3cec4969172.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 117, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["TabTale"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}