{"id": 221020, "slug": "domino-the-worlds-largest-dominoes-community", "name": "Domino! The world's largest dominoes community", "name_original": "Domino! The world's largest dominoes community", "description": "Play FIVES, BLOCK, and DRAW multiplayer dominoes with your friends! Join over one million people who have downloaded Domino!<br/><br/>Domino! is super addictive, fast-paced, multiplayer dominoes done right for Android!<br/>This easy to learn but impossible to master strategy game is beautifully designed and endlessly entertaining! Play opponents at your own pace or see who's online right now for even faster gameplay.<br/><br/>Find yourself bored with other, slower multiplayer games on the App Store? Change that now with Domino! Taking turns is ridiculously fast. Play your Facebook friends, contacts, or even random people across the globe! Push notifications let you know it's your turn. In-game chat lets you tell your opponent who's really the best.<br/><br/>Download today for free and join the community of Domino! players now!<br/><br/>Features: <br/>• Insanely addictive<br/>• Extremely fast gameplay<br/>• Most popular styles of Dominoes <br/>• Easy to learn, impossible to master - it’s always fun! <br/>• Familiar, intuitive user interface <br/>• Turn-based or real-time play - play whole games at once or at your own pace<br/>• Play an unlimited number of games at the same time<br/>• See who’s online now for even faster action", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-30T20:18:13", "background_image": "https://media.rawg.io/media/screenshots/a23/a236a760e67848a195797e592a4caf03.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 129, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Flyclops"], "genres": ["Board Games"], "publishers": [], "esrb_rating": "Everyone"}