{"id": 221073, "slug": "baby-care-dress-up-kids-game", "name": "Baby Care & Dress Up Kids Game", "name_original": "Baby Care & Dress Up Kids Game", "description": "~~&gt; Dress, Feed &amp; Bathe your Baby - Have a Tea Party &amp; Put your Baby to Bed! <br/>~~&gt; Play Mommy &amp; Care for Adorable Babies, Hundreds of Outfits &amp; Loads of Fun! <br/>~~&gt; Kids will Learn Responsibility - Don’t Let the Babies Cry!<br/><br/>Meet Emma, Sophia, Ava, Olivia, Kim and Connor, 6 adorable babies who can’t wait to be dressed, fed, played with, bathed, read a bedtime story and put to sleep. This is the most fantastic mommy’s helper game ever! <br/><br/>Dress Up Time! <br/>First, it’s time to dress up your baby in style. Choose from dozens of hairstyles, outfits, onesies, dresses, jeans, silly pacifiers, accessories and toys! Now she’s ready to eat.  <br/><br/>Feed Me! <br/>Your baby is hungry! Prepare a bottle and feed your baby her cereal and veggies. Is your baby a picky eater? When she’s happy, she will smile, but if she’s hungry or doesn’t like her food, watch out - she will cry. Remember to clean your baby’s mouth with a napkin!<br/><br/>Tea Party! <br/>Everyone loves a fun tea party! Surrounded by her dolls in her backyard, your baby is ready to eat cookies and drink tea. You will mix up the tea and add sugar cubes. Don’t forget to give her dolls drinks too.!<br/><br/>Bath Time! <br/>Get out the shampoo and soap, your baby is dirty. Wipe her clean with a sponge. Make the bubbles pop and play with her bath toys. Rinse her off with water when she’s all clean.<br/><br/>Time for Bed!<br/>After all the fun she had, your baby is getting sleepy. She wants a bottle and a bedtime story. All tucked in and ready for bed, choose from 3 books to read to her. Nightie night.    <br/><br/>Features:<br/>&gt; Touch the spoon and scoop the formula to make the baby’s bottle<br/>&gt; The bottle shakes until it’s mixed and ready to be used<br/>&gt; Feed the baby her cereal, vegetables &amp; fruit and make her smile or cry<br/>&gt; Make the tea yourself from 4 flavors, add some sugar and serve! <br/>&gt; Choose bedtime stories to read, “Cinderella,” “Wizard of Oz” or “Goldilocks”<br/>&gt; Use the soap and sponge to clean your baby, then wash &amp; dry her with the towel", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:06:49", "background_image": "https://media.rawg.io/media/screenshots/5a0/5a07f29c2575ae7d37131a4d50cb689b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 101, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["TabTale"], "genres": ["Casual"], "publishers": [], "esrb_rating": null}