{"id": 221011, "slug": "golden-age-of-egypt-rich-slots", "name": "Golden Age of Egypt Rich Slots", "name_original": "Golden Age of Egypt Rich Slots", "description": "Play the Free Golden Age of Egypt Slot Machines game now! Enjoy the world's best mobile slot machine. Spin &amp; get Mega Wins! Receive daily rewards, huge bonuses, and $400,000 WELCOME COINS!<br/><br/>★ Top Features of Slot Machine<br/><br/>- Free gifts every 30 minutes.<br/>- Boosts your wins and experience in 2x, 3x and event 5x TIMES.<br/>- Play a bonus game anytime you want.<br/>- Use GEMS for double rewards, extra rewards and boost Free-Spin-Game.<br/>- Massive jackpot all users and chance to win TRILLIONS of COINS of Jackpots!<br/>- Special bonus slots reward when you level up.<br/>- Unique tournaments with hourly and daily challenges and big payouts!<br/>- RISK game to DOUBLE UP your WINS.<br/>- Daily Quests &amp; Achievements for you to complete and get HUGE casino bonuses!<br/>- Exciting mini-games.<br/>- Exchange gems for coins, bonus points &amp; boosters!<br/>- Play anywhere you want without wifi.<br/><br/>★ A lot of free rewards on every step<br/><br/>Play in thrilling hourly &amp; daily tournaments with millions of slots fans and get your place on the top of leaderboards!<br/><br/>- Slot maniacs win a lot of Royal &amp; Huge Jackpots each day!<br/>- Collect golden symbols to earn huge rewards!<br/>- Collect Daily Bonus (Coins, Gems, Bonus Points)<br/>- Complete Daily Quests and Achievements and collect rewards for that.<br/><br/>★ Play Slots NON-Stop!<br/><br/>You can play the Golden Age of Egypt Slot Machine at any time and anywhere! Just connect your Facebook account and stay synced with coins and your progress!<br/><br/>★ Make a spin! Download NOW ★<br/><br/>Golden Age of Egypt Slot Machines is intended for an adult audience for entertainment purposes only. Success at social casino gambling does not reward real money prizes, nor does it guarantee success at real money gambling.<br/><br/>- All in-game sales are final;<br/>- This slot machine is intended for a mature audience (age 21 years or older);<br/>- The game does not offer real money gambling;<br/>- The game does not offer an opportunity to win real money or real prizes;<br/>- Wins made while gambling in this free casino games can't be exchanged into real money or real rewards;<br/>- Past success at social casino gambling has no relationship to future success in real money gambling.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:07:00", "background_image": "https://media.rawg.io/media/screenshots/d91/d91010cb2f41039739ccbf8eee1b71d9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 165, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Duksel Slots & Games"], "genres": ["Casual"], "publishers": [], "esrb_rating": null}