{"id": 22119, "slug": "please-knock-on-my-door", "name": "Please Knock on My Door", "name_original": "Please Knock on My Door", "description": "<strong>Please Knock on My Door</strong> is a story-driven game which gives you control over a person suffering from depression and social anxiety. Help them get through work and reach out to friends while desperately trying to survive. Experience the frailty these themes bring and gain a better understanding of what it's like to live with some of the most common mental health issues today.Features<ul><li>A compelling and emotional story offering a voice to those who have none.<br/></li><li>A fully voiced narrator who always has your best in mind. Probably.<br/></li><li>A gameplay system which adds to the weight of every story-choice you make.<br/></li><li>No \"Game Over\" screen, only alternate endings that tie into your choices.<br/></li><li>A soundtrack that has been tailor-made for this experience.<br/></li><li>Relationships that can be developed or broken.<br/></li><li>Game length varies depending on your choices, ranging from 1-3 hours with enough content that you can come back and explore different parts of the narrative in consequent playthroughs.<br/></li><li>As in real life, all of your choices are immediately saved. There is only one save. </li></ul>A note from the developerPlease Knock on My Door has been in development since autumn 2014 and was initially supposed to be a 6 month exploration of my own experiences with depression. A word of caution; this is a game that might be difficult to play for those who have dealt with psycological issues such as depression and anxiety. That said, I truly believe that through entertainment we are able to understand topics that would otherwise be too foreign for us. I hope this game can help you better understand what it can be like to live with these issues, like it has already helped me.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T22:07:44", "background_image": "https://media.rawg.io/media/screenshots/97f/97f6ecc17a966bc6dc864ceee67be1cf.jpg", "website": "http://pleaseknockgame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 6, "owned": 36, "beaten": 4, "toplay": 5, "dropped": 2}, "playtime": 2, "achievements_count": 12, "ratings_count": 3, "suggestions_count": 118, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC"], "developers": ["Levall Games"], "genres": ["Indie"], "publishers": ["Levall Games"], "esrb_rating": null}