{"id": 221170, "slug": "solitaire-collection-premium", "name": "Solitaire Collection Premium", "name_original": "Solitaire Collection Premium", "description": "Discover the best collection of solitaire card games ever created for android devices. Intuitive, simple, friendly, beautiful... just great.<br/><br/>Try it and you'll love it!<br/><br/>Solitaire Collection Premium is a collection of 90 solitaire card games (and more coming soon...) including the most famous and fun solitaire card games like Klondike, FreeCell, Spider, Forty Thieves, Yukon, Scorpion, Pyramid and many more.<br/><br/>Discover this amazing collection of solitaire games including: Accordion, Ace of Hearts, Aces and Kings, Aces Up, Addiction, Agnes Bernauer, Alaska, Alhambra, Alternations, Antares, Australian Patience, Baker's Dozen, Baroness, Beleaguered Castle, Bisley, Black Hole, Box Kite, Bristol I, Bristol II, Buffalo Bill, Busy Aces, Calculation, Canfield, Casket, Chinese, Clock Patience, Colorado, Crescent, Cruel, Demons and Thieves, Double Klondike, Double Pyramid, Eagle Wing, EastHaven, Eight Off, Eliminator, Flower Garden, Forty Thieves, Four Seasons, Fourteen Out, FreeCell, Frog, Gaps, Golf, Grandfather's Clock, Harp, House on the Hill, Indian, King Albert, Klondike, Klondike 1, La Belle Lucie, Lady Jane, Lady of the Manor, Little Spider, Lucky Thirteen, Monaco, Monte Carlo, Nestor, Odd and Even, Osmosis, Penguin, Perpetual Motion, Pyramid, Raglan, Rank and File, Red and Black, Russian, Russian Cell, Scorpion, Sea Towers, Shamrocks, Simplicity, Sir Tommy, Spider, Spider 1 Suit, Spider 2 Suits, Spiderette, Stonewall, Strategy, Tabby Cat, Tower of Hanoi, Tri Peaks, Twenty, Waning Moon, Wasp, Westcliff, Will o' the Wisp, Windmill and Yukon.<br/><br/>The game has a menu and user interface simple, fast and intuitive, with graphical impeccable quality and adapted to all types of devices (phones and tablets), regardless of the screen.<br/><br/>Designed to become a referent of android games, comes with many options and a huge variety of games that will offer hours of fun.<br/><br/>Most important options:<br/><br/>- Drag &amp; Drop cards<br/>- Double tap<br/>- Autoplay<br/>- Show hints<br/>- Sound effects<br/>- Timer<br/>- Card animations<br/>- Statistics<br/>- Favorites<br/>- Undo &amp; Redo (unlimmited)<br/>- Portrait and Landscape mode during gameplay<br/>- Flip Hand mode (with redesigned layouts)<br/>- Save games<br/>- Several decks<br/>- Several backgrounds<br/>- Move to SD Card<br/>- Android 8.1 Oreo support<br/>- Small file (only 3,6 MB)<br/>- Languages: english and spanish<br/>- Share in Facebook<br/>- Permanent updates, adding new options and games<br/><br/>More options and a lot of games coming very very soon.<br/><br/>If you like solitaire card games, this is your definitive collection.<br/><br/>Try it and enjoy!<br/><br/>Important note: Please, rates and comments on google play are welcome and will help me to continue improving the game even more, including more and more solitaire games and new options. Any suggestions, new games to incorporate, improvements... can be communicated to me by email and will be attended.<br/><br/>My work is your fun!<br/>Thank you very much", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-30T21:21:38", "background_image": "https://media.rawg.io/media/screenshots/956/9566b4028707d9915a6ffa5fc8c10be4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 252, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Ruben Reboredo"], "genres": ["Card"], "publishers": [], "esrb_rating": "Everyone"}