{"id": 221253, "slug": "zombie-fighting-champions", "name": "Zombie Fighting Champions", "name_original": "Zombie Fighting Champions", "description": "2036 AD. A genetically engineered Serum transforms humans into zombies. A new evil, Papa Rainbow, controls the undead to unleash these deadly zombie fighters on humans and destroy mankind. <br/> <br/>Your mission is to create your Zombie fighting team with an array of bone-crushing weapons and take on the undead in gruesome pit fighting leagues. Collect three classes of zombies with unique skills, strength, power, attacks, and agility to defeat mighty opponents.<br/><br/>Are you ready to unleash your match-winning strategy, build your zombie horde and experience a captivating story to get to the end and save mankind?<br/><br/>BUILD YOUR BATTLE HORDE <br/>Unravel your monstrous roster of Zombie fighters. Engage in skull-crushing mayhem with Scarecrow, Clown, Hannibal, Tombstone and other fighters inspired from the meanest ever known to mankind. <br/><br/>HONE YOUR WINNING STRATEGY<br/>Combine Brute, Mauler &amp; Stalker classes in your zombie fighting team to win. Unleash the sheer thrashing power of Brutes against Maulers. Take down any Stalker with extreme health and agility of a Mauler. Use Stalkers to mow down Brutes with fast and special attacks.<br/><br/>EQUIP DEADLY WEAPONS AND ARMOUR<br/>Choose from an array of bone crushing weapons to rip apart any opponent and tank up with strong armor to withstand piercing damage. <br/><br/>FIGHT EXTREME BATTLES<br/>Journey through four intense Fighting Leagues and defeat mighty zombie bosses to become the ultimate champion.<br/><br/>BECOME THE HERO OF HUMANITY<br/>Fight evil in the dark Salvage Yard, Fortune Casino, StreetFight, SteakHouse and ShowTime Arenas. Each win gets you closer to defeating your nemesis Papa Rainbow and saving mankind! <br/><br/>JOIN THE EXCLUSIVE CLUB OF ZOMBIE FIGHTING CHAMPIONS FANS<br/>Enjoy regular news on game updates, characters, features, views, video tips and more for Free<br/><br/>Visit us: www.zombie-deathmatch.com <br/>Like us on facebook: https://www.facebook.com/zombiedeathmatch<br/>Follow us on twitter: https://twitter.com/PlayZDM <br/>Watch us on youtube: http://www.youtube.com/reliancegames<br/><br/>This game is completely free to download and play. However, some game items can be purchased with real money within the game. You can restrict in-app purchases in your store’s settings.<br/><br/>* Permission:<br/>-  android.permission.GET_ACCOUNTS- is needed to access  the list of accounts in the phone", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:06:28", "background_image": "https://media.rawg.io/media/screenshots/3a0/3a0b523b00b3cda802d385b157f17945.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 436, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Reliance Big Entertainment"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}