{"id": 221236, "slug": "etabu-a-party-well-played", "name": "eTABU - a party well played!", "name_original": "eTABU - a party well played!", "description": "eTABU is a social game where players of two teams guess the keywords presented by their team-mates, who cannot use the forbidden words or gestures. The team who earns a certain amount of points first, wins. The ONLINE mode lets you to compete with players all over the world!<br/><br/>If you have played the classic board game Taboo, this game will be familiar to you. <br/><br/>Cards available in English, German, Polish, Turkish, Spanish, French, Italian, Portuguese, Greek, Russian, Arabic. <br/><br/>RULES:<br/>1.Divide yourselves into two teams.<br/>2.Choose the first player to describe the keyword.<br/>3.The opposite team will select the person to verify:<br/>- the use of forbidden words.<br/>- the use of plural or abbreviated forms of the forbidden words.<br/>- gestures and sound imitations.<br/>4. When the keyword is guessed the verifying person hits the OK button [+1 point], if any rules are broken, he pushes the WRONG one[-1 point].<br/>5. When the set time has ended, the opposing team starts their turn according to the same rules. <br/>6. The gameplay lasts until one of the teams reaches the set amount of points. In case of a draw, the team with less skipped keywords wins.<br/><br/>During the gameplay, the player can use three buttons:<br/>- SKIP - to forfeit a difficult keyword and move on to the next<br/>- PAUSE - to pause the gameplay<br/>- EXCLAMATION - signal a spelling error<br/><br/>*** Offline Multiplayer, Party Game, Quiz<br/>**** Will you be able to guess the keyword in 5 seconds? 7 seconds? 30 seconds?<br/><br/>Challenge yourself and have fun!<br/><br/>Christmas Party!<br/><br/>eTABU - a party well played!<br/><br/>Social Game. Online game. On-line mode.<br/><br/>Disclaimer: <br/>eTABU is not associated with Hasbro or Hersch and Company's Taboo, Tabou, Tabu, Tabù, Tabuh, or any other variants of the Taboo, Alias or Uno products, registered trademarks.", "metacritic": null, "released": null, "tba": false, "updated": "2023-02-22T12:59:40", "background_image": "https://media.rawg.io/media/screenshots/36e/36e392f777100f73d8fc07575a9be210.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 76, "game_series_count": 0, "reviews_count": 1, "platforms": ["Android"], "developers": ["Softnauts"], "genres": [], "publishers": [], "esrb_rating": null}