{"id": 221277, "slug": "classic-slots-machines-poker-fun-vegas-tower", "name": "Classic Slots Machines & Poker 🎰 Fun Vegas Tower", "name_original": "Classic Slots Machines & Poker 🎰 Fun Vegas Tower", "description": "🎁Free Spins &amp; Classic Slots🎰<br/>Install and play on the best classic slots in this 3D free casino and enjoy a new experience in slot machines from Las Vegas. Start with a welcome bonus of 100 Free Spins. Enjoy Las Vegas from all angles with the most amazing graphics and the most realistic machines. Unlock all the games and conquer the casino tower to find out new slot games and win big!<br/><br/>🏆Finally, a real 3D casino🏆<br/>Slide your finger across the Lobby of Vegas Tower Slots and explore the different rooms where you can find Bonus games, free spins and great prizes that wait for you to live an authentic adventure in Las Vegas.<br/><br/>🌟Play Vegas Tower Slots and enjoy:<br/>★ 100 Free Spins to start.<br/>★ A whole new visual experience never seen before.<br/>★ No loading times. Fastest Casino App.<br/>★ Huge Slot machine with free coins Bonus every hour.<br/>★ 3D lobby with lots of games.<br/>★ The best slot classic machines with realistic graphics.<br/>★ Bonuses, free spins, jackpots and much more!<br/>★ Authentic Lucky Wheel with daily bonus.<br/>★ Play the Keno machine and win amazing prizes.<br/>★ Complete goals and obtain your reward.<br/>★ Save some coins with every spin on your Piggy Bank.<br/>★ Online Tournaments. Play with your friends and win!<br/>★ VIP benefits to win more.<br/>★ Play Online or Offline, without restrictions.<br/>★ Exclusive offers every day to rank faster!<br/>★ Regular updates with new games.<br/><br/>Best Realistic Classic Slots<br/>Are you tired of trying games with the same visuals and design? In Vegas Tower Slots you will enjoy an complete different experience! 100% realistic, 100% 3D!<br/><br/>If you are a classic slots fan of Las Vegas, you will love Vegas Tower Slots. You will find slots machines with retro style across different rooms, video slots and other games like Keno, Wheel of Fortune or either a huge slot machine, just like in Las Vegas!<br/><br/>Lucky Wheel and Giant Slot Machine Bonus<br/>Inspired by the real ones in Las Vegas, the Lucky Wheel and the Giant Slot Machine will increase your chances to win big thanks to their daily and hourly bonuses that will allow you to keep playing all the casino games. Play several days in a row to increase your prize!<br/><br/>Casino VIP benefits to win more<br/>As long you play on any slot game tasks, you will receive VIP casino points that will allow you to win more on Tournaments and Bonuses. Also, all your purchases will reward you with much more VIP casino points. <br/><br/>Video Poker machines<br/>Three video poker machines are waiting for you in the top floor! Jacks or Better, Deuces Wild &amp; Ultimate Bonus Poker. Enjoy the retro style of these mytical video poker games.<br/><br/>3D Keno game machine<br/>If you stay wanting more, try the Keno game machine! Find out how lucky you are playing Keno anytime you want and prepare to get huge wins! Simply place your bet then choose 10 numbers and then press the Start button. Easy and a new way to try your luck!<br/><br/>Download now and start your 100 Free Spins!!!<br/><br/>The games are intended for an adult audience. The games do not offer \"real money gambling\" or an opportunity to win real money or prizes. Practice or success at social casino gaming does not imply future success at \"real money gambling.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:06:23", "background_image": "https://media.rawg.io/media/screenshots/ff9/ff9aa129584e6decc7f59f3d4451b64e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 195, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Pure Casino Apps"], "genres": [], "publishers": [], "esrb_rating": null}