{"id": 221380, "slug": "empire-warriors-td-premium", "name": "Empire Warriors TD Premium", "name_original": "Empire Warriors TD Premium", "description": "If you are a fan of tower defense games free and strategy games, Empire Warriors Premium: Tower Defense Games is a must-have addictive game that can't be missed in your 'challenging games' folder.<br/>With powerful heroes, unique towers, epic challenges and also funny moments which are combined in this tower defense games free, Empire Warriors Premium will satisfy your demand.<br/>What are you waiting for? Don't waste your time anymore!<br/><br/>Not only be able to satisfy your demand, this Premium Bundle will also satisfy your budget when you can get huge benefits with 300% less expensive than making in-app purchases!<br/>★ Miria – The Strongest Hero<br/>★ 1,500 gems<br/>★ 300 crystals<br/>★ 6 supportive 4* runes<br/>★ 50 VIP coins<br/>⚠ Game data in this version is different from the free version (Empire Warriors TD)<br/><br/>▶ Fantasy Story<br/>The origin of Empire Warriors Premium is on Ioria, a fantasy continent, where Human, Elf, Dwarf, Orc and other legendary creatures live together.<br/>Every places you come, every battles you join, and every castles you build, everything have a story behind.<br/>Countless of champions with enough courage who have engaged this marvelous empire with tons of weapons, magic elements and mysterious aspects, have found its story.<br/>Now it's your turn. Are you brave enough, champions?<br/><br/>▶ Best Tactical TD Game In A Magical Fantasy World<br/>Will you have enough courage to take into this greatest empire with a galaxy of weapons, magic things and so on?<br/>Let enjoy a lot of epic wars in different fantasy environment: the plain of human, dense forests of elves, the mountain kingdom of dwarves, the dead swamp, frozen mountain, and many more!<br/><br/>▶ Build, Battle, Defend<br/>Perform your best strategy in this tactical TD game with 4 new specialized castles:<br/>- Barrack Tower, trains strong warriors that, led by the brave knights of Endia to help you block the path and destroy the enemies.<br/>- Archer Tower, deals physical damage and bring useful buffs to nearby towers.<br/>- Magic Tower, control by best wizards of Endia, has high magic damage, ability to debuff the enemies and summon awesome dragon.<br/>- Golem Tower, the mighty weapon of Endia kingdom, which can throw giant rock to the enemies and deal massive damage.<br/><br/>▶ Complex And Addictive Gameplay<br/>Various modes of gameplay in this fantasy TD game, from easiest to toughest, besides the campaign missions, the player also can enjoy the infinite challenges in endless mode.<br/>Not only that, offline option combines with online will bring to you the great experience. Let’s show the world who is the best tactician by ranking yourself top one on the leaderboard.<br/>The endless mode is also a very good one to farm gems and to be a legend in epic battle.<br/><br/>▶ Endless Action Tactical TD Game<br/>Control mighty legend heroes: now you can select and control 3 heroes at a time to protect the empire in any mission!<br/>Each hero has an active ability and 3 passive abilities. By upgrading heroes, their strength will increase greatly. <br/><br/>▶ Formidable Challenges<br/>A variety of monster with an infinite rush in the tower defense games free: more than 30 types of enemies are waiting for you.<br/>Each monster has a unique appearance and some even have abilities that may cause a lot of trouble to every tactician.<br/><br/>Learn more about your kingdom with an in-game encyclopedia. Be ready for tower defense games free in the best strategy games. It's worth every penny.<br/>No fear of death! Be a wise leader and join now!<br/><br/>Contact us for further support and information:<br/>- E-mail: zitgastudios@gmail.com<br/>- Official Fanpage: https://www.facebook.com/EmpireWarriorsTD<br/>- Official Group: https://www.facebook.com/groups/EmpireWarriorsTD<br/>- Official Twitter: https://twitter.com/EmpireWarriorTD", "metacritic": null, "released": "2020-05-28", "tba": false, "updated": "2020-06-29T02:21:41", "background_image": "https://media.rawg.io/media/screenshots/169/169e5f9a54484d38e2125c25c1394859.jpg", "website": "https://www.facebook.com/EmpireWarriorsTD", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 411, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "Android"], "developers": ["ZITGA PTE", "Zitga"], "genres": ["Action", "Strategy"], "publishers": ["Pitado Viet Nam JSC"], "esrb_rating": "Everyone 10+"}