{"id": 22138, "slug": "tower-in-the-sky-tactics-edition", "name": "Tower in the Sky: Tactics Edition", "name_original": "Tower in the Sky: Tactics Edition", "description": "Save the Kingdom by leading a team of unlikely heroes into battle against an ancient enemy! Explore a magical world, conquer evil, collect loot, mystical items, and even designer T-shirts. You’ll need to move your characters judiciously, time your attacks just right, unleash powerful spells, and strategically customize your party (and play style) if you want to survive. Can you unravel the truth about the Tower in the Sky?<br/><br/>Tower in the Sky was built to challenge experienced strategy gamers. Easy to pick up and play on normal and easy difficulty levels, while hard and extreme levels will challenge even the most hardcore strategy role playing game vets. <br/><br/><br/><br/>• Unique gameplay mechanics: Allows players to build their own parties, manually move characters between lanes, and use primary and secondary attacks in real-time battles.<br/><br/>• Minimal vector art style influenced by “material design.\"<br/><br/>• Players are challenged to use deep strategy in battle to advance.<br/><br/>• Battle and strategize against dozens of different enemy types.<br/><br/>• Build a unique party by choosing from a dozen playable characters – each with their own unique abilities.<br/><br/>• Customize your party with tons of weapons, items, and collectible T-shirts.<br/><br/>• Encounter a cast of NPCs in a cross-genre story that spans thousands of years.<br/><br/>• Enjoy up to 10 hours of play in the main campaign and plenty of additional metagame end content.<br/><br/><br/>Thank you for supporting indie gaming!", "metacritic": null, "released": "2017-05-01", "tba": false, "updated": "2019-08-28T22:07:43", "background_image": "https://media.rawg.io/media/screenshots/95d/95dbf0ef6db72857df0f863ab25e5c59.jpg", "website": "http://towerinthesky.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 150, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Three Brothers Games"], "genres": ["Action", "Adventure", "RPG", "Strategy", "Indie"], "publishers": ["Three Brothers Games"], "esrb_rating": null}