{"id": 2213, "slug": "kerbal-space-program", "name": "Kerbal Space Program", "name_original": "Kerbal Space Program", "description": "<p>How to build a spaceship capable of delivering a human crew into space - and return this crew back? Even if we have all the necessary parts, engines, life support systems, rudders and accelerators, even if all this we have, the construction of the ship requires the correct arrangement of parts together with each other. Depending on how correct our decisions are, the ship will fly or not, it will fly right or fatally deviate from the course.</p>\n<p>The game has three modes. The first is the sandbox. You can build everything that comes to your mind. The second is Science. Here you can experiment and improve technology. The third is career. Here you are responsible for the smooth functioning of all departments, including administration strategies, crew management, reputation, taking up contracts to earn funds etc.<br />\nThere are also tasks to deal somehow with asteroids, create bases and stations in space, discover new planets and search for minerals in their bowels, and so on.<br />\nThe ship&#39;s behavior is based on the real physics of such phenomena, the ship behaves naturally in this sense, and our solutions must comply with this. Similarly, it is necessary to take into account other physical realities, such as a possible explosion of fuel due to overheating and so on.</p>", "metacritic": 88, "released": "2015-04-26", "tba": false, "updated": "2024-04-10T02:05:34", "background_image": "https://media.rawg.io/media/games/bda/bdab2603c0dc67268d0610449bc7df16.jpg", "website": "https://kerbalspaceprogram.com/", "rating": 4.18, "rating_top": 5, "added_by_status": {"yet": 202, "owned": 3117, "beaten": 116, "toplay": 64, "dropped": 279, "playing": 56}, "playtime": 5, "achievements_count": 89, "ratings_count": 389, "suggestions_count": 407, "game_series_count": 1, "reviews_count": 393, "platforms": ["Linux", "macOS", "PC", "Xbox One", "PlayStation 4"], "developers": ["Squad"], "genres": ["Simulation", "Indie"], "publishers": ["Private Division", "Squad"], "esrb_rating": "Everyone"}