{"id": 221305, "slug": "free-slots-pure-vegas-slot", "name": "Free Slots - Pure Vegas Slot", "name_original": "Free Slots - Pure Vegas Slot", "description": "Classic Slot Machines: Pure Vegas introduces you to THE #1 REALISTIC SLOT MACHINES.<br/><br/>Try your luck and win BIG in these Las Vegas classic slots free machines. With this Free Slots Machines: Pure Vegas you will find a set of vintage retro style slots machines that will amaze and allow you to enjoy a different kind of visuals. More real, more immersive, more engaging. You'll feel like you're in Downtown Las Vegas. All available for playing offline in this pokie slots free game.<br/><br/>Classic FREE Slot Machines with the BEST graphics!<br/>Start with a free coins pack and join the party to get Free Spins, Bonuses, Wheel of Fortune spins, Wilds, Scatters...all the Casino Slots features are waiting for you in Free Slots Machines: Pure Vegas.<br/><br/>If you are looking for a free, easy to play and offline slot machines or pokie slots, Free Slots Machines: Pure Vegas offers you the best experience for you and your friends, with Social Tournaments at any time, 24/7. Accept the challenge putting your whole heart into spinning and be ready to get rich! This Slots free is the funniest way to achieve it!<br/><br/>Classic Slot Machines: Pure Vegas offers you the following features:<br/>🔹Exciting visual HD experience with retro style machines. Let yourself be surprised  with this slotss free machines.<br/>🔹Online Tournaments 24/7. HUGE rewards!<br/>🔹Free offline slot games.<br/>🔹New Bonus every 2 hours. <br/>🔹Facebook integration. Play with your friends!<br/>🔹Max payouts in all machines.<br/>🔹100% Random and genuine mechanics on all these slots free. No tricks. All depends strictly on your luck :)<br/>🔹Everyday Bonuses, Double XP Boosts, Discount Offers, etc. Stay tuned to win big and get experience faster.<br/>🔹Popular slotss machines: High Diamond Slots, Grand Cherry Slots, 6x Pay Times Slots, Pharaoh's Slots, American 777 Slots, Top Money Slots and much more!<br/><br/>The games are intended for an adult audience. The games do not offer \"real money gambling\" or an opportunity to win real money or prizes. Practice or success at social casino gaming does not imply future success at \"real money gambling.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:06:18", "background_image": "https://media.rawg.io/media/screenshots/eee/eeebe9f29ff72443c0dc34dc6dc894f1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 178, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Pure Casino Apps"], "genres": [], "publishers": [], "esrb_rating": null}