{"id": 221367, "slug": "stickman-legends-ninja-warriors-shadow-war", "name": "Stickman Legends - Ninja Warriors: Shadow War", "name_original": "Stickman Legends - Ninja Warriors: Shadow War", "description": "Stickman Legends is a free-to-play shadow fight style of stickman fighting games, a great combination of action, role playing game (RPG) and player versus player (PvP).<br/>Plunge into the heroic shadow battle, you will be brought to an epic fantasy shadow of war, have to face against many cruel zombies, evil monsters and mighty enemies.<br/>Get ready to be the greatest shadow fighter of Stickman Legends World and master the Dungeon of Shadow!<br/> <br/>▶ EPIC SHADOW OF WAR IN STICKMAN FIGHTING GAMES<br/>In each shadow battle, disguise yourself as a stickman ninja warrior who is on a journey of conquering the dark world and has to fight off the dangerous league of monsters.<br/>Crush the enemies, humiliate evil bosses, and be the greatest dark knight in the ultimate fighting games to free the fantasy world from Shadow!<br/> <br/>▶ VARIOUS STICKMAN SHADOW FIGHT TO CHOOSE<br/>Collect these kinds of shadow fighters: Lion-Hearted Swordsman, Legendary Ninja Warrior, Mighty Dungeon Guardian, Elite Archer Hunter, Powerful Mage, Shadow Hunter.<br/>All that you have to do is training your powerful stickman ninja warrior with martial arts and savaging all the monsters in the Shadow of War.<br/> <br/>▶ TONS OF ULTIMATE ITEMS &amp; POWERFUL SKILLS<br/>Enjoy customizing the multiple upgrades for your stickman heroes in the best action RPG fighting game.<br/>To fight against the most dangerous monsters, the shadow fighter may need more powerful weapons than the starting ones. Take action and burn off the darkness world!<br/> <br/>▶ THE GLOBAL STICKMAN LEGENDS RANKING<br/>Lead your elite stickman ninja warrior to the top by battling a smart &amp; skillful way.<br/>Defy other players characters and take these amazing stickman heroes a place at the Top 100 of Leaderboard in Arena.<br/> <br/>▶ STUNNING DESIGN, EFFECT &amp; GRAPHICS<br/>You will be amazed with the fascinating graphic &amp; sound effects of Stickman Legends.<br/>Be a dark knight, grab the dark sword and wipe out the monsters at a glance in the epic shadow fight!<br/> <br/>This is certainly an unforgettable experience, the best choice in the series of stickman fighting games and ninja games.<br/>Download 'Stickman Legends' and share your moment with friends now!<br/> <br/>Contact us on:<br/>- Mail: zitgastudios@gmail.com<br/>- Facebook Fanpage: https://www.facebook.com/StickmanLegends<br/>- Official Group: https://www.facebook.com/groups/StickmanLegends<br/>- Instagram: https://www.instagram.com/stickmanlegends<br/>- Twitter: https://twitter.com/stickmanlegends", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:06:05", "background_image": "https://media.rawg.io/media/screenshots/c8f/c8ffeadc62a2de1a96c6c0eaa7c94ef2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 279, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["ZITGA PTE"], "genres": ["Action"], "publishers": [], "esrb_rating": null}