{"id": 22139, "slug": "mega-overload-vr", "name": "Mega Overload VR", "name_original": "Mega Overload VR", "description": "Mega Overload is retro arcade action brought to virtual reality! Join the front lines on the Crystal Asteroid to defend the Milky Way from the endless onslaught of the Mega Bots. You'll collect various power-ups as you fight against a wide variety of robots in this easy to learn but hard to master game. Stand alone against the robot army or team up with a partner as you blast your way to a high score!<br/><br/>Each player wields dual blasters and shoots a variety of mischievous Mega Bots, each with unique attacks, defenses, and flight patterns, in their quest to the top of the leaderboard. Throughout the course of the game, players can choose a safe and steady playstyle or aggressively spend lives to upgrade their weapons for a bot blasting bonanza.<br/><br/>Mega Overload also features an online co-op mode, doubling the guns and doubling the fun. Players stand side by side and take out the troublemaking robots together. Each player still retains an individual score, so bragging rights will remain intact.Key Features<ul><li>Shoot down endless waves of enemy robots!<br/></li><li>Collect power-ups and upgrade your weapons!<br/></li><li>Team up with a partner in online co-op!<br/></li><li>Recreates the challenging difficulty of classic arcade games!<br/></li><li>Climb to the top of leaderboards!<br/></li><li>Unlock over 20 achievements!</li></ul>", "metacritic": null, "released": "2017-04-18", "tba": false, "updated": "2019-08-28T22:07:43", "background_image": "https://media.rawg.io/media/screenshots/ffe/ffe100b9afb1187a6d5e206919702b12.jpg", "website": "https://www.subdreamstudios.com/mega-overload/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 19}, "playtime": 6, "achievements_count": 22, "ratings_count": 1, "suggestions_count": 269, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Subdream Studios"], "genres": ["Action"], "publishers": ["Subdream Studios"], "esrb_rating": null}