{"id": 221363, "slug": "stickman-legends-shadow-of-war", "name": "Stickman Legends: Shadow of War", "name_original": "Stickman Legends: Shadow of War", "description": "Do you know what interesting things are waiting for you in this Premium? Hurry up and get the most stunning costumes for free to equip your unique stickman hero. It's your turn now to be the Legend!<br/><br/>Stickman Legends: Shadow War is definitely a top offline game of stickman fighting game series, a classic mix of Role-playing game (RPG) and Player vs Player (PvP). No more concerns about the internet, now you can enjoy stick fight style every time you have and everywhere you are with full action stickman games experiences. <br/><br/>In each fighting game, you’ll play a ninja warrior who is facing with countless enemies and showing a spirit of stick fight hero. Crush the zombies! Beat them all! As a stick hero in epic stickman games, do you have the drive, courage &amp; passion to conquer the shadow war and master shadow fight in Stickman Legends the top fighting game?!<br/><br/>Game feature:<br/>- Various stick fight heroes to collect: Shido the Lion-Heart Swordsman, Bernald the Mighty Dungeon Guardian, Ignite the Fierce Gunner, Mistral the Elite Archery, Raven the Powerful Mage, Hason the Shadow Warmaniac.<br/>- Enjoy utilizing the multiple upgrades and ultimate items. Lead your stickman hero to the top by battling a smart &amp; skillful way in the Shadow War.<br/>- Challenge yourself to survive in challenge modes with endless waves of undead enemies.<br/>- Enter the Arena, show off anything you have trained then wipe out the opponent at a glance in each epic battle of shadow fight.<br/>- There are rankings to make the game more interesting and entertaining. Make friends all over the world and compete your stick heroes with your friends.<br/><br/>‘Stickman Legends’ is an unforgettable fighting game experience, the best choice in series of stickman games and ninja warrior games. Are you ready to be a super stick hero legend?<br/>Download Stickman Legends: Shadow War and share your funny moment in this popular action game with friends now!<br/><br/>Contact us:<br/>-        Email: zitgastudios@gmail.com<br/>-        Facebook: https://www.facebook.com/StickmanLegends<br/>-        Twitter: https://twitter.com/stickmanlegends<br/>-        Instagram: https://www.instagram.com/stickmanlegends", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:06:06", "background_image": "https://media.rawg.io/media/screenshots/86b/86b56807cb60db2d389d77cdac40c65c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3, "toplay": 1, "dropped": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 285, "game_series_count": 0, "reviews_count": 2, "platforms": ["Android"], "developers": ["ZITGA PTE"], "genres": ["Action"], "publishers": [], "esrb_rating": null}