{"id": 221442, "slug": "family-barn-tango", "name": "Family Barn Tango", "name_original": "Family Barn Tango", "description": "Play the best farming simulation game! Create your own unique farm in Family Farm Seaside and compete with your friends to be the top farmer!<br/><br/>Family Farm Seaside is a beautiful and fun farming simulation game. There’s a bunch of tasks to do on the farm, so you will never feel bored! Take care of cute animals on your farm, like Mary the cow. Grow crops and sell them on the market for a nice profit. Design your own boat at the seaside and show it off to your neighbors. Win the farm beauty contest and prove to everyone that you have the most beautiful farm in the world!<br/><br/>Family Farm Seaside features:<br/><br/>★ FREE to play Farming Game<br/>★ Played by over 80 million people all around the world<br/>★ Cute animals<br/>★ Unlimited barn space<br/>★ Build your farm at the seaside and on an exotic island<br/>★ Prepare more than 400+ dishes in the kitchen<br/>★ Plant, harvest and process over 200+ unique products<br/>★ More than 150+ achievements to complete<br/>★ Fulfill daily orders and quests with your farm products<br/>★ New missions added regularly with fun new features<br/>★ Compete with other farmers in the new farm beauty contest!<br/>★ Grow special plants in the farm laboratory!<br/>★ Dig for precious ores and diamonds in the Mine<br/>★ Adopt pets and watch them explore your farm!<br/>★ Decorations can now be cleaned while in the warehouse<br/>★ Guests can visit the farm and interact with your pets!<br/><br/><br/>App Notes: <br/><br/>• This app requires an active internet connection to play. Please make sure your device is connected while playing.<br/><br/>• Family Farm Seaside is completely free to download and free to play. However, some items in the game can be purchased with real money. If you don't want to use this feature, please disable in-app purchases in your device's settings.<br/><br/>​• Please note that this is a standalone version of Family Farm, and will not sync or connect to your Facebook farm.<br/><br/>Contact Us!:<br/><br/>• Having any problem in game? Click here! &gt;&gt;&gt; https://funplus.helpshift.com/a/family-farm-seaside/<br/><br/>• Need more neighbors and want to get game news and tips? &gt;&gt;&gt; https://www.facebook.com/familybarntango<br/><br/>• Privacy Policy &gt;&gt;&gt; http://www.funplusgame.com/privacy_policy/", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:05:49", "background_image": "https://media.rawg.io/media/screenshots/6fc/6fc9a57805fd0aa641077f1e2cff9b9c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 225, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["DIANDIAN INTERACTIVE HOLDING"], "genres": ["Casual"], "publishers": [], "esrb_rating": null}