{"id": 221555, "slug": "pixel-war-battle", "name": "Pixel War: Battle", "name_original": "Pixel War: Battle", "description": "Experience the wonder of your face transformed into 625 different heroes.<br/>A whole new world is open.<br/><br/>-If the pictures of your mother and father get into a battle, who will be the winner?<br/>-If you and your toy battle each other, who will be the winner?<br/>-If pictures of your boss and you get into a battle, who will be the winner?<br/><br/>▣ A game in which you can have a mass combat with everything in the world!<br/>▣ The ultimate mass combat game!<br/>▣ Your picture is transformed into 625 different characters!<br/>▣ Occupations of the characters are distinguished by the color of the picture!<br/>▣ Raise your Archer, Thief, Warrior, Tanker, and Soldier!<br/>▣ By dragging with just one finger, you can control numerous characters.<br/><br/>※ Features ※<br/>☞ No need for internet!<br/>☞ No additional downloads!<br/>☞ No data storage is worried! Total data usage: 31MB!<br/><br/>1. Anything in the whole world can be changed into 625 different heroes.<br/>Everything you see becomes a character.<br/><br/>2. Experience it yourself.<br/>Experience the strategy and the growth!<br/><br/>3. Don't worry about the low-end phone!<br/>It runs smoothly even on old and deadbeat phones.<br/><br/>▣ Official Facebook page: https://www.facebook.com/nexelonFreeGames ▣<br/><br/>Smartphone App Access Permissions Guide<br/>▶ We request access permissions at the time of using the app in order to provide the following services:<br/>- WRITE_EXTERNAL_STORAGE permission to save game data,<br/>- READ_EXTERNAL_STORAGE permission to load saved game data.<br/>These permissions are not used for any other purposes other than to install, play, and analyze the game.<br/>※ Even if you don't allow permissions, you can still use the services without the functionality that needs the specific permissions. <br/>※ If you use a version below Android 6.0, you can't individually set optional access permissions; we recommend you to upgrade the version higher than 6.0.<br/><br/>▶ How to Withdraw Access Permission<br/>After you have agreed to allow access, you can reset or withdraw such access in the following ways:<br/><br/>[OS 6.0 or later]<br/>Settings &gt; Manage Applications &gt; Select your app &gt; Rights &gt; Select Consent or Withdraw for Access Permissions.<br/><br/>[OS Below 6.0]<br/>Upgrade the OS to withdraw, or delete the app.<br/>★ Warning ★ <br/>1. If you change your device or delete the app, your data will be reset.<br/>2. This product includes in-app payment features for partial items.<br/><br/><br/>◎ Contact to the Developer: helpnexelon@gmail.com<br/>◎ Facebook: https://www.facebook.com/nexelonFreeGames", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:05:36", "background_image": "https://media.rawg.io/media/screenshots/5c3/5c35133a0ef0c02ca79fb6330181c680.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 241, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Nexelon"], "genres": ["Arcade"], "publishers": [], "esrb_rating": null}