{"id": 221552, "slug": "spelling-bug-1st-gr-words-lite", "name": "Spelling Bug 1st Gr Words Lite", "name_original": "Spelling Bug 1st Gr Words Lite", "description": "See how many spelling word cards you can match to create a beautiful butterfly. Or fly with fire bug through 4 different worlds to find the words before the caterpillars can get them! Spelling Bug helps your child learn 1st grade spelling words in 4 games with spectacular sound and fun graphics! Add your own words to match what you do in school.<br/><br/>FEATURES in this language game:<br/>*  Learn to spell with flash cards, memory games and puzzles, spelling bees and an exciting word shape game for hours of learning fun<br/>*  Word game with 4 worlds and 36 levels (first 5 levels in LITE Version) 100´s of words<br/>*  Add as many of your own words as you want (paid version only)!<br/>*  Adapts to kids' skills levels so it is always challenging and never too easy.<br/>*  Record your own voice<br/>* Phonics based lessons to match school work<br/>* Great for 1st Grade<br/>* See progress in the results tab<br/>* Easy simple to navigate user interface<br/>* COPPA compliant – NO ads, no personal detail is collected, no geolocation.<br/><br/>All lessons and activities teach English and use common core state standards, so you can be sure these games will help give your child a boost in the classroom. And with helpful voice narration and exciting games, they won't want to stop playing and learning!", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:05:37", "background_image": "https://media.rawg.io/media/screenshots/a58/a58c75374ea56842744481ecb044d507.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 146, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Ace Edutainment Apps"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}