{"id": 221571, "slug": "poker-online-texas-holdem-casino-card-games", "name": "Poker Online: Texas Holdem & Casino Card Games", "name_original": "Poker Online: Texas Holdem & Casino Card Games", "description": "Play POKER ONLINE now and TEST MULTIPLAYER TEXAS HOLD'EM POKER game! Invite your friends to the most exclusive online poker rooms in the world and compete with them anytime, anywhere, LIVE! T-Bull promises to bring an experience to the live Texas Hold 'Em poker circuit that's never been had before! <br/>Master the poker hand rankings with Online Poker: Texas Card Game NOW! <br/><br/>FEATURING:<br/>★ Play the No. 1 Poker App Online!★<br/>★ Join the game and play with your FRIENDS wherever you want, LIVE! ★<br/>★ Compete in TONS of challenging TOURNAMENTS! ★<br/>★ Get FREE chips every 4 hours! ★<br/>★ ENJOY real-time TEXAS HOLD 'EM poker for FREE! ★<br/>★ BECOME the best PRO POKER PLAYER and WIN unique TROPHIES! ★<br/>★ Discover the REAL POKER experience on your MOBILE! ★<br/>★ Log in daily and get EXTRA CASH! ★<br/>★ Enjoy an ORIGINAL GRAPHIC STYLE of Texas Hold 'Em Poker! ★<br/>★ Full SUPPORT for ENGLISH, Spanish, Indonesian, Thai, Spanish, Portuguese, Vietnamese, Italian, French, Traditional Chinese, German, Turkish, Japanese, Korean, Arabic, Malay, Polish, and Russian! ★<br/><br/>THE NO.1 ONLINE POKER APP!<br/> Were you looking for a faster poker with NO wait times? Fun games in a real poker style? Enjoy cash games, GO Poker tournaments, playing poker with friends game, big win and poker texas hold'em! Great! You're in the right place! Download Poker Online: Texas Card Game now, and join millions of poker players in an online casino for endless fun! Are you ready to face real poker stars and compete against them? Bluff and raise, improve your skills, gain experience, make new friends, and prove that you're the only poker star!<br/><br/>PLAY WITH YOUR FRIENDS WHEREVER YOU WANT!<br/>Enter the world of online poker! Love casino games? Invite your friends to adrenaline-filled poker games through Facebook and get cash bonuses as a reward. Whether you're a beginner or already a poker superstar, Poker Online: Texas Card Game is for you! This online poker is a real poker party that gives the best poker experience! Join The poker party and play online poker!<br/><br/>COMPETE IN TONS OF INTERNATIONAL TOURNAMENTS!<br/>Take part in international tournaments such as the Singapore Carnival, French Joust, English Tourney, or American Series! Up the stakes, win hands, go all-in, and unlock achievements. Track your progress and status in the game! See how many Tournaments you've won and Achievements you've earned. This #1 poker app is build to be used by millions of players.<br/><br/>VEGAS TEXAS HOLD 'EM<br/>Want to learn how to play poker? Flush, straight, three-of-a-kind, pair, and what beats what? If you love online card games, it doesn't matter whether you're a poker star or just a beginner. Playing online poker allows you to gain valuable experience! Understand and master the poker hand rankings with Poker Online! Enjoy a Las Vegas casino atmosphere and show other players who rocks!<br/><br/>PLAY POKER DAILY AND GET CASH FOR!<br/>Download Poker Online now and receive $100,000 in chips instantly! Come back to the game every day and get free $50,000 in chips. Everyone can win with Poker Online! PLAY THE NO. 1 POKER APP OF 2017!<br/><br/>Download Poker Online: Texas Card Game NOW! Finally available on Google Play! 100% to play!<br/><br/>Discover our other games: http://t-bull.com/#games<br/>Like us on Facebook: https://facebook.com/tbullgames<br/>Follow us on Twitter: https://twitter.com/tbullgames<br/><br/>This product is intended for use by those 21 or older for amusement purposes only. <br/> Practice or success at social casino gaming does not imply future success at real money gambling.<br/> This product does not offer real money gambling or an opportunity to win real money or prizes.<br/><br/>We're always making changes and improvements to Poker Online: Texas Card Game. To make sure you don't miss a thing, keep your updates turned on!", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:05:33", "background_image": "https://media.rawg.io/media/screenshots/ac7/ac768be6d5123eec246216a8676f5b46.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 274, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["T-Bull"], "genres": ["Card"], "publishers": [], "esrb_rating": null}