{"id": 221525, "slug": "moto-rider-go-highway-traffic", "name": "Moto Rider GO: Highway Traffic", "name_original": "Moto Rider GO: Highway Traffic", "description": "Moto Rider GO: Highway Traffic brings to you one of the most compelling and satisfying traffic dodging experience in the world!<br/><br/>Features:<br/>- Choose from the fastest high-performance motorcycles!<br/>- Enjoy extreme 3D visuals!<br/>- Prove your skills in hardcore challenges!<br/>- Upgrade your speed, breaking level and add extra lives!<br/>- Select your favorite motorbike category: chopper, cross or superbike!<br/>- Make near traffic misses discovering 4 unique locations: Suburbs, Desert, Snow and Night City<br/>- Explore 4 unique locations in 4 different modes!<br/>- Ride your motorcycle on a highway, interstate, or the autobahn!<br/>- Dominate online leaderboards!<br/>- Unlock 23 achievements!<br/>- Discover plenty of bike tuning options!<br/><br/>ENDLESS GAMEPLAY<br/>Head out and race as fast as you can to become the best new moto rider in the world! Race the traffic and complete the challenges to get real among the competition. Jump on your racing bike and ride in the endless busy roads and highways! Make near traffic misses discovering 4 unique locations: Suburbs, Desert, Snow and Night City in 4 different modes! Ride your motorcycle on a highway, interstate, or the autobahn. Never forget that riding a motorcycle can be fun, but it can also be dangerous! Roads and highways are full of speeding cars – they can bother you!<br/><br/>SELECTION OF HIGH-PERFORMANCE MOTORBIKES<br/>Have you ever wanted to ride a motorcycle in real life? Great! It's about time to test your skills and decide on the motorcycle category you would choose – extremely fast superbike, epic chopper motorcycles or modified high-performance versions of off-road motorcycles! Every bike has its own individual extras: total lives, near miss bonus, high-speed bonus or wrong way bonus.<br/><br/>A TON OF TUNING AND CUSTOMIZATION OPTIONS<br/>Go to the garage and select one of the high-performance motorbikes. Tune your vehicle and customize its appearance. Choose your favorite body color and slap on some well-designed decals! Give your rides your own style. Increase your motorbike's speed, breaking level and add extra lives – these will all have a definite impact on your bike's performance.<br/><br/>CLIMB TO THE TOP OF THE LEADERBOARDS<br/>Take part in a selection of hardcore challenges and become the fastest moto rider on the streets. Millions of other players will compete for the top rank. Join them and work your way up the weekly leaderboards rankings. Race the traffic and complete the challenges to get real among the competition. Nobody said that traffic driving would be easy - but the prize is well worth it.<br/><br/>RICH ROAD ENVIRONMENTS<br/>GO Moto Rider: Highway Traffic is setting the new standard within traffic racing genre. Enjoy extremely impressive graphics and experience high-octane racing! Discover well-designed and full animated dash and speedometer! It will be fun and compelling, we guarantee!<br/><br/>Prove your skills as tenacious bike rider! Download Moto Rider GO: Highway Traffic now!<br/>Finally available on Google Play for FREE!<br/><br/>Discover our other games: http://t-bull.com/#games<br/>Like us on Facebook: https://facebook.com/tbullgames<br/>Follow us on Twitter: https://twitter.com/tbullgames", "metacritic": null, "released": "2017-03-01", "tba": false, "updated": "2019-08-23T04:32:55", "background_image": "https://media.rawg.io/media/screenshots/ea3/ea3c3f28b51b8d2ae79bb8119208bf8e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 213, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "Android"], "developers": ["T-Bull"], "genres": ["Simulation", "Racing"], "publishers": ["T-Bull"], "esrb_rating": null}