{"id": 221562, "slug": "top-boat-racing-simulator-3d", "name": "Top Boat: Racing Simulator 3D", "name_original": "Top Boat: Racing Simulator 3D", "description": "Drive the fastest ocean-going powerboats in this exciting ultimate racing game!<br/><br/>•  Enjoy extreme mind-blowing visuals <br/>•  Choose from 25+ customizable boats<br/>•  Explore 6 unique boat classes: hovercraft, classic, offshore, catamaran, jet ski, and hydroplane<br/>•  Reach impossible speeds<br/>•  Race for the World Cup and achieve victory for your team<br/>•  Take part in a selection of hardcore challenges<br/>•  Win the jet ski race!<br/><br/>Race for the World Cup, reach unbelievable speeds, and become one of the most popular elite racers in Top Boat: Racing Simulator 3D!<br/><br/>CHOOSE THE POWERBOAT OF YOUR DREAMS<br/>Pick and tune to perfection one of the 25+ powerboats from 6 unique boat classes: hovercraft, classic, offshore, catamaran, jetski, and hydroplane. Customize your boat by tuning its appearance and slap on some decals if you want to! Find the optimal tune for your boat with dozens of performance parts – from fuel filters to gearboxes! You can also increase your engine's power, upgrade your clutch, body, nitrous, and more – these will all have a definite impact on your boat's performance.<br/><br/>UNIQUE WORLD SETTINGS<br/>Have you ever dreamed of driving the fastest ocean-going powerboats, speedboats, motorboats, and jet skis in the world? Are you fed up with standard boat racing games? Then you should definitely take a look at this one! Top Boat is setting a new standard in the boat racing genre. Enjoy perfectly designed world settings that set out a multi-faceted approach to the player experience!<br/><br/>HIGH-SPEED RACING<br/>Take the challenge and beat the high score setting a new maximum world speed record! Nothing will stop you from reaching the finish line before your opponents. Race for the World Cup and win proudly your first world title! Watch out your challengers! They can be tough nuts to crack! It's about time to prove your racing skills and show what you are made of!<br/><br/>HOW ABOUT A JETSKI RACE?<br/>Prove your skills and drive the fastest water scooters (as they were originally called)! Have you ever dreamed about racing on a brand-new jet ski against real opponents? And as the wind rushes past you and little droplets of water fill the air, you'll feel the high-octane speed in your hair! Jump on a jetski and experience the most amazing water action out there!<br/><br/>STUNNING GRAPHICS<br/>Top Boat combines extreme mind-blowing visuals and sound with breathtaking gameplay. Experience top notch graphics with realistic world settings and amazingly detailed ocean-going rides on powerboats and motorboats. We also know you'll enjoy the game because of its exotic style and vibrant world, which we all need in those long, dark winter months!<br/><br/>It's about time to get on your offshore powerboat, motorboat, or jet ski and show what you're made of! Your skills will be tested, so get ready for the most intense racing game of 2017!<br/><br/>Download and play for amazing stunt boat racing emotions and start new season 2018 . of water sports championship!<br/><br/>Finally available on Google Play for FREE!<br/><br/>Official site for T-Bull: http://t-bull.com/#games<br/><br/>Like us on Facebook: https://facebook.com/tbullgames<br/>Follow us on Twitter: https://twitter.com/tbullgames<br/>Follow us on Instagram: https://www.instagram.com/tbullgames/", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-31T06:41:41", "background_image": "https://media.rawg.io/media/screenshots/91b/91bcd202dba6ec185e69e9f617ac6ba4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 288, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["T-Bull"], "genres": ["Racing"], "publishers": [], "esrb_rating": "Everyone"}