{"id": 22162, "slug": "moonlighter", "name": "Moonlighter", "name_original": "Moonlighter", "description": "<p>During an archeological excavation – a set of Gates were discovered. People quickly realized that these ancient passages lead to different realms and dimensions. Rynoka, a small commercial village, was found near the excavation site – providing brave and reckless adventurers with treasures beyond measure.<br />\nMoonlighter is an Action RPG with rogue-lite elements that demonstrates two sides of the coin – revealing everyday routines of Will, an adventurous shopkeeper that secretly dreams of becoming a hero.Features:<br />\nWhile conducting your business in Rynoka village, you can put items on sale, set their price carefully, manage gold reserves, recruit assistants and upgrade the shop. Be careful though – some shady individuals may want to steal your precious wares!<br />\nGetting to know Rynoka’s residents and understanding needs of customers is crucial. Some folks may have special quests for you, requesting rare items and offering handsome rewards in return.<br />\nCrafting and enchanting system is essential for the your progression. Interacting with the villagers is the way to craft new armors, weapons and enchant existing equipment. This creates a great deal of flexibility and spices up the way the equipment is used.<br />\nWhile visiting other worlds, collect valuable resources, weapons, armors, treasures and peculiar artifacts. Then, manage acquired loot using unique inventory-based abilities.<br />\nDefeating various enemies and bosses, revel in the challenging and deep combat mechanics. The depth of combat depends on the interactions between weapons, abilities, enemies and secondary effects of items. Feel comfortable developing your own battling style.<br />\nGates lead to different worlds. Each run is unique and forces you to take some smart decisions. You never know what you will encounter next – that’s why you have to be prepared for everything.</p>", "metacritic": 82, "released": "2018-05-28", "tba": false, "updated": "2024-04-11T21:42:52", "background_image": "https://media.rawg.io/media/games/5c2/5c2b78d4ee2647849d0bfb5d772345c8.jpg", "website": "http://www.moonlighterthegame.com", "rating": 3.74, "rating_top": 4, "added_by_status": {"yet": 330, "owned": 2255, "beaten": 216, "toplay": 146, "dropped": 262, "playing": 66}, "playtime": 5, "achievements_count": 262, "ratings_count": 470, "suggestions_count": 347, "game_series_count": 0, "reviews_count": 478, "platforms": ["PlayStation 4", "Nintendo Switch", "Linux", "macOS", "PC", "iOS", "Xbox One", "Android"], "developers": ["11 Bit Studios", "Digital Sun"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["11 bit studios"], "esrb_rating": "Everyone 10+"}