{"id": 221677, "slug": "dead-warfare-zombie", "name": "DEAD WARFARE: Zombie", "name_original": "DEAD WARFARE: Zombie", "description": "Let’s experience new Zombie Shooting Game - the addictive action game for all of the zombie games fans!<br/><br/>In 2072, the world is filled with zombies. Tens of billions the dead are destroying the Earth and nonstop. The Zombies makes the anarchy everywhere. It’s the war that everyone who are not dead need to join! The Empires of zombies can come around any time, maybe this day will be the last day!<br/><br/>A group of survivors named MPS-16 wants to gather other living people. They're traveling around the world to find sniper, weapons, and other shooters to kill zombie. Dead Valley in the Middle East is the target destination for this extremely dangerous journey. <br/><br/>The adventure begins badly, the team is trapped in a museum by hordes of zombies. The shooters have to fight through the dead night with few guns. But a secret is revealed which makes these survivors strongly believe in their target. Their true warfare begins. <br/><br/>Millions people are collecting guns, build their teams to fight in very exciting gun games - the best shooting game!<br/><br/>This Zombie game is an extreme zombie survival game with lots of features:<br/>- Free game with variety of guns to exterminate your zombie foes with.<br/>- Realistic-looking 3D shooter and lands with the survival theme in free offline gam.<br/>- That free zombie game is true FPS perspective and emotion.<br/>- Defend your lands and fight with other survivors to open warfare.<br/>- Save other shooters in dead battles and find new supplies and weapons.<br/>- A multitude of dangerous zombie and Boss in intense free games.<br/><br/>EPIC EFFECTS IN SHOOTING GAMES<br/>- Realistic lighting and texture present sniper, zombies, guns and FPS environments.<br/>- Zombie shooting game with 3D characters have different looks and skill systems for more survival strategy.<br/>- Guns can be viewed in 3D mode<br/>- Zombies have different behaviors and abilities that makes this free game more interesting.<br/><br/>BEST SHOOTING FPS WITH MANY KINDS OF CHARACTERS<br/>- Shooters are separated into different classes with unique skills and shooting guns. Keep your finger on the trigger, shoot as fast as you can!<br/>- In this FPS game, appearance and skills are based on the shooter class. <br/>- Each class can use one kind of weapon to fight against the dead zombie.<br/>- Heroes have levels and stars, that is one of the reasons make this zombie game is one of the best zombie games .<br/><br/>ZOMBIE GAMES WITH PLENTY OF ZOMBIES <br/>- The dead zombies are dangerous with many kinds of behaviors and abilities in this Zombie game.<br/>- The Bosses can snatch any creatures near to them and call others zombi <br/>- New kinds of zombie always appear in new survival locations.<br/>- Choosing the correct shooting guns can help you to take down a zombie faster.<br/><br/>POWERFUL WEAPONS TO KILL THE DEAD<br/>- Shooting guns can be customized with various parts in this Zombie Shooting Games.<br/>- Upgrade your trigger, every part of shooting guns to kill zombi and win zombie games offline<br/>- Special effects make guns stronger and more effective to the shooter.<br/>- All kinds of shooting guns can be randomly found in the warfare world.<br/><br/>BE THE LAST ONE STANDING IN PVP BATTLE <br/>- The shooter can defend against and fight with opponents around the world.<br/>- Your mission in this Zombie game is not only kill all Zombi, but also protect your own survival base<br/>- There is a ranking system to compare all sniper in Sniper games.<br/>- Prepare your gun and hunt your enemy in the battle<br/><br/>MASSIVE BATTLES <br/>- Shooting FPS players can explore many dead places to find supplies and survivors in this kind of Sniper games.<br/>- Many different target locations with new challenges and zombie in zombie games<br/>- Each survival place contains a secret waiting to be revealed for the shooter.<br/>- Shooters need to prepare a good strategy for different dead warfare battle to win zombies games<br/><br/>Accept challenges, shooting zombie, earn rewards to become a legend in this addictive gun game. <br/>Let’s download this free game and have fun!<br/>Contact us on FB: http://bit.ly/officialpageDWZ", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:05:21", "background_image": "https://media.rawg.io/media/screenshots/fba/fbaccdaaa57bbfa37b5f35df64ca55c4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 480, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["VNG GAME STUDIOS"], "genres": ["Action"], "publishers": [], "esrb_rating": null}