{"id": 221625, "slug": "blackjack-trainer-pro", "name": "BlackJack Trainer Pro", "name_original": "BlackJack Trainer Pro", "description": "Blackjack Trainer Pro will teach you to how to play your hands with the highest possible probability of winning using the basic strategy. You will be dealt a hand and see the dealers card. It's your turn to decide to Hit, Stand, Split, Double or Surrender.<br/><br/>User reviews:<br/>★★★★★ Amazing - This app is a must have!<br/>★★★★★ Worth the $$$ - Made learning the basic strategy very easy and fun.<br/>★★★★★ Good Teacher - The dealer will be impressed with your quick play<br/>★★★★★ Excellent training device - Simple way to refresh blackjack strategy that was second nature to me forty years ago.<br/>★★★★★ Allows for all variations of blackjack. Its Outstanding!<br/><br/>Specifically practice soft hands and pairs and see how well you did in the statistics-table.<br/><br/>Black Jack Trainer allows you to set your exact table configuration, so you can learn the basic strategy for your game. No other application allows you to set as many configurations as BlackJack trainer. <br/><br/>This app allows you configure any table, from 1-8 decks, with or without dealer peek, with or without Surrender, and whether the dealer hits on soft 17 or not.<br/><br/>This is NOT a black jack game, but an application that teaches you the right play. Use it to prepare for your next Vegas trip or before visiting your local casino. Regard this app as your personal blackjack school helping you to master the game of twenty-one and the basic strategy without the need to count cards.<br/><br/>Any further questions/feedback/suggestions? Don't hesitate to contact us at blackjacktrainer@hornetapps.com<br/><br/>More user reviews:<br/>★★★★★ I like it. Very good practice before visiting casino.<br/>★★★★★ Great app, great explanations. Definitely pay the few dollars to gain access to all settings. Well worth it if you'd like to make a little extra at the casino.<br/>★★★★★ Solid trainer. Great app. Just what I was looking for. The ability to practice just soft hands and pairs sets it apart from the rest.<br/>★★★★★ Very good for learning basic strategy<br/>★★★★★ Super, best Blackjack Trainer. My favorite Blackjack Trainer! Improved my game a Lot!", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-30T20:36:53", "background_image": "https://media.rawg.io/media/screenshots/735/735c8df1f9d34fe8507c972886e406d2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 62, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["HornetApps"], "genres": ["Card"], "publishers": [], "esrb_rating": "Everyone"}