{"id": 221695, "slug": "toddlers-app-farm-animals", "name": "Toddler's App: Farm Animals", "name_original": "Toddler's App: Farm Animals", "description": "You in the farmyard: animals, tractors and lots of adventures. Explore life in the country in our hidden object game with over 90 interactive stories, funny sounds and loads of fun! <br/>▸ Our amazing Toddlers Seek &amp; Find apps have already been downloaded over 4 million times.<br/>▸ Kids ages 2-6 ▸ get an entertaining and playful glimpse into the thrilling world of the farmyard and country living. With real interactive adventures!\u2028<br/>▸ In four scenes ▸ with around 90 hidden animations and things to discover, children and parents experience life on the farm, and discover at the same time a whole host of crazy, detail-rich stories:<br/><br/>SCENE 1 - Highlights (On the Farm)<br/>------------------------------ <br/> Help the farmer plant the beets.<br/> Feed the donkey.<br/> Give the piglet a little shower!<br/> The proud rooster watches over everyone.<br/><br/>SCENE 2 - Highlights (In the Country)<br/>------------------------------<br/> Mow the field with the combine harvester and sow the new crops<br/> Let the boys in the treehouse slide down the flying fox.<br/> Find out why the sheep is so funny.<br/> Ride the pony: walk, trot or canter! <br/><br/>SCENE 3 - Highlights (In the Barn)<br/>------------------------------<br/> Give the sheep the funniest haircuts!<br/> Paint the eggs with your favorite color.<br/> Feed the animals.<br/> Help the farm fix the tractor.<br/><br/> SCENE 4 - Highlights (The Farmyard at Night)<br/>------------------------------ <br/> Now the moon is out.<br/> The animals are all sleeping.<br/> But what's happening behind the doors and windows of the old homestead? Find out!<br/> <br/>MORE HIGHLIGHTS<br/>------------------------------ <br/>▸ So many adorable stories on the theme of farmyards and country life.<br/>▸ Why is Granny rattling around on the scooter? <br/>▸ Why is the goat grabbing all the apples?<br/>▸ What does the cow like to eat?<br/>▸ Play with the children by the lake!<br/>▸ Why has the fisher caught a shoe?<br/>▸ What's the robot doing in the barn?<br/>\u2028… and there's still so much more to do: <br/>Complete tasks in every scence, find out why the sheep and the pig are such close friends and dive into our adorable farmyard world together!<br/><br/>Our promise<br/>------------------------------ <br/>▸ Your child will discover lots of little connected stories.<br/>▸ Parents too will keep finding new hidden details.<br/>▸ Your child won’t be the only one enjoying this app.<br/><br/>Fully supported languages<br/>------------------------------ <br/>▸ Arabic<br/>▸ Chinese (traditional and simplified)<br/>▸ Dutch<br/>▸ English <br/>▸ French<br/>▸ German<br/>▸ Italian<br/>▸ Japanese<br/>▸ Korean<br/>▸ Norwegian<br/>▸ Portuguese (Brazilian)<br/>▸ Russian<br/>▸ Spanish<br/>▸ Swedish<br/>▸ Turkish<br/><br/>Apps by wonderkind <br/>------------------------------ <br/>Tiny Pirates - Toddler's Seek &amp; Find<br/>Tiny Builders - Toddler's Seek &amp; Find<br/>Tiny Airport - Toddler's Seek &amp; Find<br/>Tiny Firefighters - Toddler's Seek &amp; Find<br/>Monster ABC – Learn with the little monsters<br/><br/>Support note<br/>------------------------------ <br/>We have thoroughly tested this app on all devices. If you do however experience problems, please understand that we are unable to provide support on the basis of comments in the reviews section. Please send us an e-mail instead so that we can respond and provide assistance quickly. Thank you very much.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:05:17", "background_image": "https://media.rawg.io/media/screenshots/499/4993b534f13a5fe6789f5361a876b073.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 241, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["wonderkind"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}