{"id": 221756, "slug": "bowling-club", "name": "Bowling Club", "name_original": "Bowling Club", "description": "- Official launch on 143 countries around the world, dare you to come and challenge top players in the world?<br/>-《Bowling Club》 is 3D free mobile game that simulates a real bowling game/match.A unique game experience design, giving you a completely different bowling competition experience!<br/><br/>[Game features]<br/>- The most realistic striking experience, restoring the fun of bowling competitions;<br/>- 3 innovative events gameplay: Drunk Bowling, Domino Bowling and Strike Master;<br/>- 4 game modes: real-time 1V1 match, championship, Drunk Bowling, Single game;<br/>-Beautiful and Realistic 3D graphics scenes, let you experience different atmospheres of the game/give you a different atmospheres of the game;<br/>- 100+ exquisite 3D bowling balls and Pins &amp; Lanes show off your class;<br/>- Global real-time fast 1V1 match, a perfect match with players around the world;<br/>- Tournament of Champions, make you be the invincible world champion!<br/>- In-game friend system allows you to bowl together with your friends PK anytime, anywhere!<br/>-Hundreds of grade medals and Achievements give you the absolute glory!<br/><br/>[A wide variety of pins and amazing equipments]<br/>A variety of material equipments, different striking experience!Challenge numerous levels and unlock new locations!Enter the game to get a huge amount of upgrade materials,and even you will receive a gift pack right now,!! Come and create your legendary upgrade path!<br/>[Creative play to have fun]<br/>Based on the traditional rules of bowling competition, we also added Drunk Bowling, fun games such as Domino Bowling and Strike Master, and a variety of mini games such as Daily wheel,Super Wheel and flips.The game is very easy to learn,and addicted to it, you can not stop in the game.<br/>[Championship to complete for King of bowling]<br/>There are Hundreds of grade medals and Achievements, a variety of competition rankings. Who is the Hit King? Who is the championship? Who is the LADDER? Waiting for you to strike!<br/>[The ultimate experience of top art]<br/>Bowling balls,fantastic bowling alleys and Pins are crafted in exquisite 3D art. Top-class high-definition game scenes such as Bowling Alley, Snow Fort, Route 66, Magical museum, Wonderful Street, Seaworld. Make you have the ultimate immersive experience!<br/><br/>Download the game and start your Bowling Club now!Become a pro bowler!<br/><br/>Welcome everyone to follow us on Facebook:https://www.facebook.com/BowlingClubGame/<br/><br/>We hope you enjoy the game.<br/>Have fun! ! !", "metacritic": null, "released": "2019-10-24", "tba": false, "updated": "2019-10-28T02:59:49", "background_image": "https://media.rawg.io/media/screenshots/b34/b34ecbcc52b78f545cf71b03b0d35fbb.jpg", "website": "https://www.facebook.com/BowlingClubGame/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 215, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "Android"], "developers": ["707 INTERACTIVE"], "genres": ["Sports", "Casual"], "publishers": ["HONGKONG 707 INTERACTIVE TECHNOLOGY CO"], "esrb_rating": "Everyone 10+"}