{"id": 22180, "slug": "starsmashers", "name": "StarSmashers", "name_original": "StarSmashers", "description": "This turn based action strategy game sees players at the helm of the Starship Space Beagle, tasked with wrestling back control of the galaxy from evil emperor, Kaldor Seth and his army of interstellar allies.<br/>\n<br/>\r\nFighting through five star systems, the Beagle and her crew will encounter new races, advanced spaceships and vast planets as they battle towards a final showdown with Kaldor Seth. Along the way they’ll discover new weapons and advanced technology, allowing them to upgrade the Beagle and take on terrifying new enemies in epic tactical combat. They’ll also make contact with a mysterious race of aliens, creators of a technology that could help them defeat Seth once and for all…<br/>\n<br/>\r\nKey features:<br/>\n<br/>\r\n* High octane space combat – epic battles that demand tactical decision making and quick reflexes…<br/>\n<br/>\r\n* Ship upgrades and augments – loot new technologies and upgrade the Space Beagle. Pick the right weapons for maximum damage, and the right shields to keep the enemy at bay…<br/>\n<br/>\r\n* Epic encounters – huge variety of alien races and ships, all inspired by classic 1970s Chris Fosse artwork…<br/>\n<br/>\r\n* Five star systems to explore – discover vibrant gas nebulae, mysterious alien planets and derelict space stations…", "metacritic": null, "released": "2017-05-26", "tba": false, "updated": "2019-08-28T22:07:42", "background_image": "https://media.rawg.io/media/screenshots/134/1341de701d1f2d425c67d867bce0821d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 14}, "playtime": 3, "achievements_count": 22, "ratings_count": 0, "suggestions_count": 359, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Wayne Jackson", "Jason Mallett", "Colin Wren"], "genres": ["Action", "Adventure", "Strategy", "Indie"], "publishers": ["Kiss", "War Hungry Games"], "esrb_rating": null}