{"id": 221842, "slug": "ace-tales", "name": "Ace Tales", "name_original": "Ace Tales", "description": "Embark on an epic Atlantic adventure with hero dog Ace and Doc O'Hare. This game will surprise you with stunning graphics, great game play and action moments.<br/><br/>As a one button social game, this game is easy to play but hard to master. Great for children and adults alike. Fly over Atlantic, avoid obstacles, collect dog biscuits and rise to the top in leader boards!<br/><br/>Features:<br/>- A social Gift Challenge, donate your way to the top!<br/>- Stunning cartoon like graphics and action<br/>- Fun, addictive and easy physics based game play<br/>- Make your run through various Atlantic weather and landscapes<br/>- Collect shiny diamonds and dog biscuits to gain more upgrades<br/>- Unlock special power ups such as bad guy bombs, Time slow down, Epic Cannon and more!<br/>- Buy new awesome air planes and helicopters.<br/><br/>This game features a Gift Challenge, where Bugbyte challenges players to collect dog biscuits for a good cause. Every time players beat the challenge, Bugbyte will donate real money to organizations in need.<br/><br/>Fast reflexes are your best allies in this action game. Avoid fiery birds, pirate air balloons, flying fish and burning meteors to reach your destination across the Atlantic. The journey will be hard but the reward so sweet. And don't worry, there will be epic power ups to help Ace and Doc O'Hare on the action journey.<br/><br/>***<br/><br/>\"Ace Tales is an addicting flying game that feels like an endless runner on steroids.\" -- Supergamedroid<br/><br/>\"A bonafide game changer, this unique concept takes in-game currency and turns it into a tangible thing with real world implications.\" -- Supergamedroid<br/><br/>***<br/><br/>Players take the role of dog character Ace, a seasoned fighter and mail pilot, as he embarks on his most important mission yet. Baron Oliver has set up a competition, 25 000 dollars for the first dog to fly over the Atlantic.<br/><br/>The risks are high but Ace is ready to champion this challenge. Ace is flying for a noble cause, he wants to donate the life changing winnings to his home town, and save the town from hunger and despair.<br/><br/>Don't wait any longer! Hop in the plane and immerse yourself in an action Atlantic adventure full of joyful moments!<br/><br/>IMPORTANT NOTICE TO PARENTS<br/><br/>This game may contain:<br/><br/>- The ability to purchase optional content using real money. You may control in-app purchases made within this app using the password settings explained in the Google Play help center.<br/>- Promotional material for Bugbyte products and trusted business partners.<br/>- Links to external social networking sites intended for users over the age of 13.<br/>- Direct links to the Internet which may open the default web browser on the device.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:05:00", "background_image": "https://media.rawg.io/media/screenshots/17e/17ef3430cb58ae1fe973def3df19582f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 206, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Bugbyte"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}