{"id": 22188, "slug": "rozkol", "name": "Rozkol", "name_original": "Rozkol", "description": "DESCRIPTION:Rozkol is a dynamic 2D shooter, with a view from the top. Your task in the game, grab the entire territory on the global map, applying different types of weapons.<br/>Before each match you choose weapons, equipment, and together with the soldiers of your unit go to war with the enemy.<br/>Actions take place on the territory of a fictional state, in the Middle East.GAME TYPE:In the game there are different types of games, fighting in which you earn money to buy weapons, ammunition, equipment, and hired soldiers.<br/><br/>Capture cards: this is the main game mode, where you have to capture the entire territory on the global map, destroying all enemy troops.<br/>Fight in the city: the mode in which you have to fight with the enemy, in a heavily built city, but do not worry, any wall can be demolished, and make your way through the buildings.<br/>Fight in the fortified area: these are small villages with dense vegetation, the map in this mode is generated randomly, and with each new match, you will not be able to predict what lies ahead.<br/>Defense: you have to protect a small factory building, from the furious attacks of the enemy, in contrast to other modes, this is constantly near you whistling enemy bullets, and shards from explosions.<br/>Tank battle: a group of enemy tanks entered the city, you need to destroy them at any cost.<br/>Zombie sweep: the mode from the section of fiction, which does not really fit into the concept of the game, but is one of the most interesting, in this mode you will find yourself a unit fighter, designed to clean the city of zombies, actions occur at night, which complicates your task, so How, you do not know what awaits you in the darkness of the night city.", "metacritic": null, "released": "2017-05-01", "tba": false, "updated": "2019-09-17T12:50:22", "background_image": "https://media.rawg.io/media/screenshots/3ec/3ecaf4138520e0713509fa007b2daa70.jpg", "website": "http://nuostak.ml", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 65, "beaten": 1}, "playtime": 4, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 214, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Nuostak"], "genres": ["Action", "Adventure", "Simulation", "Indie"], "publishers": ["Enjoy Games", "LEVER Software"], "esrb_rating": null}