{"id": 221822, "slug": "combat-assault-fpp-shooter", "name": "Combat Assault: FPP Shooter", "name_original": "Combat Assault: FPP Shooter", "description": "<strong>Combat Assault</strong> is a hot new PvP shooter with intense gameplay, loads of skins, weapons, a ranking system, and the ability to level up characters through a skill tree.<br/>Choose your weapon from a huge variety, battle it out with players from around the world, and upgrade your fighter to the max. Fight as part of a team in the classic style you know and love.<br/><br/><strong>Tons of cool features: </strong><br/><br/><strong>Weapons: </strong><br/>The game has over 30 different weapons, from the classic AK-47, m4a4 and AWP, to super powerful mini guns and shotguns. Get armed to the teeth and jump into battle!<br/><br/><strong>Skill tree: </strong><br/>Boost up your characters for better results, upgrade armor, health, reload time and so much more depending on character class.<br/><br/><strong>Ranks: </strong><br/>Just like in other classic shooters, we have a ranking system where the more you win, the higher your rank and the stronger your opponents. Fight for a spot on the leaderboard, boost your rank and improve your shooting skills.<br/><br/><strong>Weapon skins: </strong><br/>The game has lots of cool skins in different colors to suit any taste. Show off what you got to other players.<br/><br/><strong>Cases and daily bonuses: </strong><br/>Open cases, get skins: it couldn't be easier. Complete daily missions and receive daily bonuses like gold and top cases.<br/><br/><strong>Maps: </strong><br/>Different maps with certain areas that might feel familiar... Hone your shooting skills at the shooting range, race against the clock and hit targets as accurately as you can.<br/><br/>⍟ ⍟ ⍟ <strong>HUGE ARSENAL! </strong> ⍟ ⍟ ⍟<br/>Get in the game with a huge range of guns, including machine guns, submachine guns, sniper rifles, pistols and more. Suit up and destroy your enemies with lightning-fast attacks!<br/><br/>⍟ ⍟ ⍟ <strong>OPTIMIZED FOR WEAK DEVICES! </strong> ⍟ ⍟ ⍟  <br/>We optimized our game so even weaker devices can handle it. Now you can compete against other players without worrying about your phone overheating.<br/><br/>⍟ ⍟ ⍟ <strong>UPGRADE ARMOR AND WEAPONS! </strong> ⍟ ⍟ ⍟<br/>It's all about the upgrades! The stronger you're leveled up, the faster you defeat your opponents and the higher you can make it on the leaderboard. <br/><br/>⍟ ⍟ ⍟ <strong>AWARDS!</strong> ⍟ ⍟ ⍟<br/>Play the game every day to get free bonuses, cases, gold and skins.<br/><br/>Hey everyone, Our shooter is absolutely free to download, but some elements in the game are available for purchase. <br/><br/>We're grateful for any and all feedback and suggestions on the project. <br/><br/>*****************************************<br/><strong>Join: </strong><br/>FB: facebook.com/Combat-Assault-1762305577180348", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:05:04", "background_image": "https://media.rawg.io/media/screenshots/bd0/bd04e575b74012bd4742479a799750d1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 271, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["GDCompany"], "genres": ["Action"], "publishers": [], "esrb_rating": null}