{"id": 221991, "slug": "planet-commander", "name": "Planet Commander", "name_original": "Planet Commander", "description": "In <strong>Space Armada</strong>, you are the captain of an interstellar spaceship. Your galactic fleet starts out with a small cruiser, but as your space base develops, you’ll get to control battleships and even supermassive space cruisers!<br/>Start with a small spaceship, but as your base grows and develops, you’ll graduate to commanding huge battleships and super-heavy spaceships. Battle in a galaxy on fire online with real opponents in the multiplayer Space Wars game mode, and develop your space fleet.<br/><br/><strong>Features: </strong><br/><br/>≛ <strong> 6 classes of spaceships and galactic starships! </strong><br/>Several classes of spaceship, from light frigates to supermassive cruisers!<br/><br/>≛ <strong>Leagues and Leaderboards! </strong><br/>Players are divided into different leagues from bronze to diamond, depending on their level and skills!<br/><br/>≛ <strong>Galactic team battle! </strong><br/>Space invaders! Fight side by side with other players in team-based galactic battles online!<br/><br/>≛ <strong>Customize your cosmic spaceship! </strong><br/>100+ types of plasma galaxy guns and modules are available. You can even repaint your ship!<br/><br/>≛ <strong> Over 20 galactic spaceships! </strong><br/>More than 20 different ships available, all with their own capabilities and features, including the Predator, Phoenix, Olympus, Soul Catcher and many others. Improve your skills and equipment, add turrets, missiles and special weapons!<br/><br/>≛ <strong> Beautiful 3D graphics! </strong><br/>Perfectly detailed maps and spacecraft textures, enjoy galactic views of cosmic objects such as Jupiter, Mars, Saturn, asteroids and even galactic cities!<br/><br/><strong>Space Armada</strong> The most dynamic space simulator yet, space battles between massive ships and small but sneaky frigates, each one controlled by individual players.<br/><br/>★★★ Fight for a place in a global league. Upgrade your fleet. Customize your ships, repaint them and improve their skills!<br/><br/>★★★ In-game lobby where you can chat with other players to share your successes and ideas!<br/><br/>★★★ Regular updates and new elements are waiting for you in online multiplayer games. This year’s best graphics and perfectly-matched audio will have you spending all your time playing Space Armada!<br/><br/>★★★ Awesome mobile space game with 3D graphics!<br/><br/>★★★ Our multiplayer PvP space shooter is completely FREE to download!<br/><br/><br/>A galaxy on fire full of epic space battles needs a commander like you! Become a legend in this galactic space shooter! Let the spaceship battles begin!<br/><br/>⋙⋙⋙⋙⋙⋙⋘⋘⋘⋘⋘⋘<br/>Join our galactic community:<br/>https://www.facebook.com/spacearmada", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:04:53", "background_image": "https://media.rawg.io/media/screenshots/e9e/e9e77cf3cd8541b32019fd99988c8bbb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 314, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Azur Interactive Games"], "genres": ["Action"], "publishers": [], "esrb_rating": null}