{"id": 221961, "slug": "infinity-ops-sci-fi-fps", "name": "INFINITY OPS: Sci-Fi FPS", "name_original": "INFINITY OPS: Sci-Fi FPS", "description": "<strong>Infinity Ops</strong><br/>A multiplayer FPS in a sci-fi setting! <br/>The event of the game take place in the distant future, when humanity has surpassed the limits of technological development and the world has descended into the chaos of interplanetary warfare!<br/>Player will face team PvP combat as classes like Recruit, Saboteur, Tank, and Assault! Each of the classes has its own features and abilities. <br/><br/><strong>Features:</strong><br/>❖ <strong>Clans </strong><br/>Create your own clan and invite other users or friends and spend time in the game together!<br/><br/>❖ <strong>Armament </strong><br/>A wide variety of weapons are available in-game, from assault and plasma rifles to laser machineguns and grenade launchers! Each weapon has its own unique properties and features.<br/><br/>❖ <strong>Material interaction</strong><br/>Low gravity frees players to jump far and high, while universal gravity can affect running speed!<br/><br/>❖ <strong>Jetpacks </strong><br/>Use a personal flight device to more quickly and effectively conduct combat operations.<br/><br/>❖ <strong>Fantastic 3D graphics </strong><br/>Excellent, detailed 3D character and map modelling.<br/><br/>❖ <strong>Optimization for weak devices </strong><br/>The game is optimized for devices with low technical characteristics. Choice of graphics for different phones!<br/><br/>❖ <strong>Easy controls </strong><br/>Intuitive control and easy interface won’t leave you struggling to master the learning curve!<br/><br/><strong>Game modes</strong><br/><strong>≛ Team Deathmatch</strong><br/>Two teams battle for domination. The team with the highest score at the end of the round wins;<br/><br/><strong>≛ Deathmatch</strong><br/>Free mode. You fight for yourself. The player with the highest score at the end of the round wins;<br/><br/><strong>≛ HARDCORE</strong><br/>A more realistic combat experience with doubled damage; For true pro players!<br/><br/><strong>≛ Custom game</strong><br/>Create a game with your own rules. Invite your friends to your custom game lobby and battle together!<br/><br/><strong>More features</strong><br/>☢☢☢ <strong>MAGNIFICENT GRAPHICS AND OPTIMIZATION FOR WEAK DEVICES! </strong>☢☢☢ <br/>Immerse yourself in the experience of online battles in the future with stunning graphics and perfect controls. Take to the frontline of each battle.<br/><br/>☢☢☢ <strong>IMPROVE ARMOR AND ARMS! </strong>☢☢☢<br/>Improve your character, upgrade weapons, reload time, armor and movement. Each character has its own traits. Buy additional gadgets, such as: mines, grenades, medkits, and shock-blades.<br/><br/>☢☢☢ <strong>A DAILY REWARD! </strong>☢☢☢<br/>Enter the game daily to receive free presents, quests, and tons of free stuff!<br/>Do your daily quests and improve your equipment!<br/><br/>Dear users, the game is still in the post-development phase. Please share any bugs and errors you experience, as well as any requests and ideas you have through the support team.<br/><br/>✦✦✦✦✦✦✦✦✦✦✦✦✦<br/>Please join us:<br/>https://www.facebook.com/destinywarfare/", "metacritic": null, "released": "2018-12-15", "tba": false, "updated": "2019-07-29T18:06:49", "background_image": "https://media.rawg.io/media/screenshots/772/772919c896b40d244e5bc960e1b88a4e.jpg", "website": "http://azurgames.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 553, "game_series_count": 0, "reviews_count": 2, "platforms": ["Android", "iOS"], "developers": ["Azur Interactive Games"], "genres": ["Action", "RPG"], "publishers": ["AZUR INTERACTIVE GAMES"], "esrb_rating": "Teen"}