{"id": 221931, "slug": "adventure-escape-allied-spies", "name": "Adventure Escape: Allied Spies", "name_original": "Adventure Escape: Allied Spies", "description": "Newlyweds Ed and Marie Hamilton parachute into Occupied France on a mission to smuggle two scientists out of Europe. They meet the French Resistance but things quickly go wrong as ruthless Major Kressler smashes their network. Who’s the traitor? Where are the scientists? What mega-weapon is Major Kressler preparing? Will Ed and Marie ever get a night alone?<br/><br/>Join millions of happy Adventure Escape players and experience the danger and thrills of Allied Spies!<br/><br/>- Stunning graphics bring the beauty and danger of Occupied France to life!<br/>- Explore Strasbourg and the surrounding forests between Germany and France!<br/>- Solve devious puzzles and riddles!<br/>- Get the whole game for FREE! You’re never forced to pay!<br/>- Gather tools and items to aid in your escape!<br/>- Memorable characters!<br/>- Find hidden objects that help you escape!<br/>- It’s free! No registration, no hassles, just download and play. <br/><br/>Uncover the secrets of Adventure Escape: Allied Spies! Can you steal secrets from the Nazis and escape with your lives?<br/><br/>--- ABOUT HAIKU GAMES ---<br/>We are a small indie game studio that loves making games. Our Adventure Escape™ series has been played by tens of millions of players. Solve a celebrity murder in Starstruck, discover ancient treasure in Hidden Ruins, and investigate paranormal phenomenon in Midnight Carnival. Search for “haiku games” to find us!<br/><br/>Website: www.haikugamesco.com<br/>Facebook: www.facebook.com/adventureescape", "metacritic": null, "released": "2017-12-22", "tba": false, "updated": "2019-10-22T14:39:54", "background_image": "https://media.rawg.io/media/screenshots/73a/73a1275e3ec0b748bd20a18cc5f428f4.jpg", "website": "http://www.haikugamesco.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 414, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "Android"], "developers": ["Haiku Games", "Haiku Games Co"], "genres": ["Adventure", "Puzzle"], "publishers": ["Andrew Ow", "Haiku Games Co"], "esrb_rating": "Everyone 10+"}