{"id": 222020, "slug": "drift-clash", "name": "Drift Clash", "name_original": "Drift Clash", "description": "Drift Clash is the first drift racing game with real-time battles and realistic physics!<br/><br/>Win most wanted cars, burn tyres on track, play with your friends in free-roam and enjoy unique retro style of the game!<br/><br/>REAL-TIME MULTIPLAYER<br/>Battle with other players in real-time and become drift king!<br/><br/>PLENTY OF CARS<br/>33 cars are in the game! Unlock these drift legends and burn rubber!<br/><br/>MOTORCYCLES DRIFTING<br/>This is the first game ever where you can drift on motorcycles!<br/><br/>CLIPPING ZONES<br/>Get ready to drive different sport cars on tracks designed precisely for drift racing. <br/>Drift points scoring system is based on car speed and angle. But you receive extra combo for the right drifting path if you drift on clipping zones. That’s why you won’t see manji drifting here. Only pure drift race. <br/> <br/>PHYSICS<br/>The game has retro style but you should see through the trick. The cars have realistic physics. We don’t have any drift helpers, steering assistants and any other wiles. It still easy to control and play but in this racing game everything depends on you. <br/><br/>CUSTOMIZATION<br/>Unlock different rims, colors, change camber for front and rear wheels.<br/>This car drift  game is still in development and a lot more features are coming. <br/>Please rate and give your feedback for further improvement of the game!<br/><br/>FOLLOW US<br/>https://www.facebook.com/Drift-Clash-196268314286653/", "metacritic": null, "released": "2018-01-31", "tba": false, "updated": "2020-11-27T04:30:14", "background_image": "https://media.rawg.io/media/screenshots/f90/f90ac782b43fe337aa5f6fbc3bacf013.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 161, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "Android"], "developers": ["AKPublish", "Alexander Mironov"], "genres": ["Racing", "Casual"], "publishers": ["Alexander Mironov"], "esrb_rating": "Everyone 10+"}