{"id": 222025, "slug": "the-troopers-mercenaries", "name": "The Troopers: Mercenaries", "name_original": "The Troopers: Mercenaries", "description": "Tactical turn-based action strategy shooter with elements of warfare. Take the lead of a brigade of merciless mercenaries, ready for anything to win against the soulless corporation of evil plotting to consume the whole world. These little warriors are at your command: upgrade them, improve their equipment, train your squad with new combat techniques, track their health and mental wellness. <br/><br/>Mini-war features:  <br/>☆ Huge selection of warriors, from the weakest and most nimble, to the truest dogs of war. Each soldier has their own skills and tactical nuances, make sure to make the right choice going into battle! <br/><br/>☆ Easy to learn and exciting military action-strategy with a developed tactical component. Even a child could figure out the game’s interface, you won’t need much time to make sense of things. <br/><br/>☆ Combat training.  Train your soldiers; improve defense, increase their lives, or increase damage output and many other things. <br/><br/>☆ Equipment.  The game contains a wild array of equipment options, such as: helmets, gloves, different levels of armor, belts, boots, and so on! <br/><br/>☆ Cartoony graphics and lovingly custom-made music. Suitable for a variety of age groups, runs even on weak devices.<br/><br/>☆ Military humor and a light-hearted mood are guaranteed. Our soldiers love to joke as much as they love to fight. Don’t miss the opportunity to catch some excellent jokes.<br/><br/> Gather a team of the craziest warriors! <br/>An elite unit of cheerful special operations nuts without a commander is just a slow-acting bomb. A collection of 90 experienced warriors await your command. Elite camouflage, legendary weapons, sweet skills, and much else. <br/><br/>You may recognize some heroes as your good old friends from Pocket Troops. Strong as a bear, the commando from the USSR hopelessly in love with his own heavy machinegun, glad to clear out a battlefield. The unstoppable action scout, gleefully raining grenades down on the enemy. The spooky spy-hitman and bellowing artillery operator, the sensible sniper and utterly, completely concussed special forces assault trooper. <br/><br/>Commander, you have an unstoppable tactical combat brigade on your hands. Decide who best fits your strategy. Don’t forget to send the boys off for training and issue well-deserved promotions to your brave defenders. <br/><br/>Go to battle against the mighty Corporation V.<br/> Load your special forces into an armored transport and set off on exciting adventures. Pursue a ruthless enemy, explore beautiful maps, and defeat bosses. <br/><br/>Beat a path through jungles and mountain ranges to Corporation V’s secret hideout, send your best warriors of light to China and the USA. Only your unstoppable brigade can ensure the Vengeance Bomb is never made. <br/><br/>Attack your enemies. Attack your friends. Attack everything that moves.  <br/>Stock up and develop your arsenal to defeat ruthless rivals in order to reach the highest ranks. There’s no mercy in the PvP Arena. The key to success? Choosing the right strategy for each opponent. Test you spec ops brigade’s might! <br/><br/>No-hold-barred in the Silver, Gold, and Alpha Arenas, only the most experienced commanders and the most vicious warriors. Show everyone who the real Alpha is! <br/><br/>Good luck in you battles, Commander! <br/>Keep in touch:  Facebook: https://www.facebook.com/thetroopersgame <br/>We’re glad to answer all your questions at troopers.feedback@heyworks.com", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:04:46", "background_image": "https://media.rawg.io/media/screenshots/02f/02f0ef36ffa47b3966a0ee6e4b90da6d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 259, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Azur Interactive Games"], "genres": ["Action"], "publishers": [], "esrb_rating": null}