{"id": 222125, "slug": "trench-assault", "name": "Trench Assault", "name_original": "Trench Assault", "description": "Numerous heavy war machinery and military equipment of WW2 is at your disposal in this epic real-time strategy game - from the most influential combat vehicles to devastating carpet bombing and sophisticated chemical warfare. <br/><br/>Build powerful card decks at your choice made up of various types of war equipment from the whole world, be it Japanese Shin Gunto swords or Soviet Katyushas or American M4 Shermans. <br/><br/>Total freedom of operation and variation in strategy are waiting for you. <br/><br/>Earn your medals of honor and climb up the Leaderboard! <br/><br/>FEATURES:<br/>+ A wide range of military equipment: 150+ types of tanks, aircrafts and artillery from all over the world. <br/>+ Real-life copies of WW2 military equipment reproduced in detail with characteristic shapes and authentic painting.<br/>+ Diverse gameplay: artillery support, air combat, bombardment, chemical attacks and much more.<br/>+ Travel through the map of Europe and rid the countries of the military occupation.<br/>+ Build and upgrade your military base that will enhance your army, weapons and vehicles. <br/>+ Collect crates, unlock new powerful cards and construct strong card decks to defeat your opponents in the legendary battles of the WW2 machinery. <br/>+ Awesome HD graphics<br/>+ Real-time PVP<br/> <br/>Lead your army to historic triumph!", "metacritic": null, "released": "2018-09-13", "tba": false, "updated": "2021-03-22T03:27:57", "background_image": "https://media.rawg.io/media/screenshots/b16/b167ae1f19d6bfa9768a3a31fd66f758.jpg", "website": "https://amt-games.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 297, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["AMT Games", "Dušan Čubík"], "genres": ["Action", "Strategy"], "publishers": ["AMT Games Limited."], "esrb_rating": "Teen"}