{"id": 222192, "slug": "find-the-words-a-free-crossword-puzzle-game", "name": "Find the Words - A Free Crossword Puzzle Game", "name_original": "Find the Words - A Free Crossword Puzzle Game", "description": "Search and find all the words hidden in the puzzle. If you found a word, select it to remove it from the list of searched words. Connect the letters to select a word. The game is finished when you found all 25 words. In this search word puzzle you can choose between 8 levels of difficulty, play with or without timer and compare your scores with your friends and people around the world. All puzzles are automatically generated by the app for endless fun. You can also play in different languages to improve your language skills and learn the correct spelling.<br/><br/>⭐NEW⭐NEW⭐NEW⭐<br/>Play with up to five friends or users from all over the world the same game in the realtime multiplayer mode. The player who first finds all the hidden words wins the game.<br/>To start a multiplayer game you simply press the globe, select a difficulty level and hit the play button. Then you can invite your friends, as soon as they accept the invitation you can begin to search for the words.<br/>Have fun with this new game mode!<br/><br/>⭐And also new:<br/>There are 5 new search categories to choose from. So you can search only animals, colors, food and drink, geography, plants, or combine different categories. This update can you found in the settings for the English language.<br/><br/>Features:<br/>♾Infinity puzzles<br/>🌍14 languages (English, German, Spanish, French, Portuguese, Italian, Swedish, Norwegian, Finnish, Dutch, Danish, Czech, Polish,Russian)<br/>🏆Google Play Games: Leaderboards and Achievements<br/>↕️8 different search directions<br/>⏱️Play with or without Timer<br/>👨‍👩‍👧‍👦Realtime Multiplayer Mode<br/>🏅Offline high score<br/>🤚in English there are 5 new search categories to choose from (Animals, Colors, Food and Drink, Geography, Plants)<br/><br/>🔓You can unlock this free app to play without advertisement and with unlimited hints.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:04:21", "background_image": "https://media.rawg.io/media/screenshots/8da/8da37797ec9c8d0dfef078bb61b8494a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 62, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["AsgardSoft"], "genres": [], "publishers": [], "esrb_rating": null}