{"id": 222147, "slug": "1942-arcade-shooting", "name": "1942 Arcade Shooting", "name_original": "1942 Arcade Shooting", "description": "Are you hear about The Battle of Midway in the Pacific Theater of World War II? <br/>Are you played any classic arcade shooting game in the 1940 series like 1941, 1942, 1943, 1944, 19XX...<br/>With its simple concept and endless fun, 1942 Arcade Shooter  is a masterpiece remake of the classic arcade experience.<br/>The controls are easy to learn and use. Keeping the old feeling of playing in an arcade. <br/><br/>Includes 10 types of famous WWII combat planes for military fans and more . Supported for all kinds of devices, from phones with low specifications to tablets. Supported Global service. Supported for Achievements, Leaderboard.<br/><br/>FEATURES<br/>- Controls are also similar: auto fire,shooting the POW from red enemies, it will cycle between the various weapons available, which can then be picked to equip it to the aircraft.<br/>- Perfect Shoot ‘em up: Lots of fighter jets, battle companions, ammunition and guns, and devices to choose from: your personal armory is packed with hi tech! And you can play game offline.<br/>- Exciting campaign: more than 60 levels full of enemies and breathtaking action!<br/>- Additional modes: Bombarding, Bosses and Protect, each of them radically changing the gameplay!<br/>- Huge bosses: battle and defeat enemies that are so big they don't even fit the screen! And wipe out swarms of their minions! Find pieces of the Danmaku barrage of bullets.<br/>- Great visuals: Tired of space shooter and lasers? Try out flying! Vertical shooters have never been better. Epic sky wars are full of excitement. Choose your airplanes and free the country from invaders. The symphony of air war and heroes' charisma are unforgettable!<br/>- Retro modernized: Played Shmup (STG) games before? This top-down shooter will make you say «wow» and revive the best impressions of your scroll childhood. No matter you are a fan of Strikers, Tyrian, Ace Squad, Razor or Airborn or you participated in battle actions in Sky Force. You will become the fan of our series 1942 Arcade Shooting<br/>- Future update: PvP, Co-op, Friends….<br/><br/>Make your choice - take you’re airplanes to victory. Feel the bullet force.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:04:31", "background_image": "https://media.rawg.io/media/screenshots/6cf/6cf5e6aca69d5d18b6d9235cdaff7ddb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 130, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["ONESOFT"], "genres": ["Arcade"], "publishers": [], "esrb_rating": null}