{"id": 222186, "slug": "munchkin-match-magic-home-building", "name": "Munchkin Match: Magic Home Building", "name_original": "Munchkin Match: Magic Home Building", "description": "Do you love candy crushing casual puzzle games with thousands of levels that keep you immersed for hours on end? Do you also love interior design games that let you spread your creative wings? If you like the sound of those two things, look no further <br/>than Munchkin Match: Magic Home Building.<br/>Lemi, who is a clumsy but warm-hearted wizard, lives in a sweet magical world filled with candy, donuts and all kinds of furry toys. His home is a beautiful magic airship. But one day, the evil ice dragon Winklehawk looted all his candy and trashed the airship. How sad! Luckily, Lemi's uncle Hogarth, a powerful wizard, sent him some help: six magical monsters called munchkins. They set off on a journey to rebuild the airship home and defeat the ice dragons. The munchkins are talented in building home, but their magic power comes from stars. Lemi and the munchkins need your help to earn stars from solving puzzles and picking the best design for everything in the home from chairs to curtains.<br/><br/>But the fun doesn't stop there! Watch Lemi and the little munchkins banter and bond with one another as they embark on their adventure. Follow the story to also discover Lemi's family legacy. <br/><br/>Munchkin Match: Magic Home Building is filled with beautiful 3D graphics, relaxing music, rewarding gameplay and funny stories. It has received tens thousands of 5-star reviews from our players and it is sure to put a smile on your face. Come join millions of players to blast away any boredom or stress!<br/><br/><br/>Already a fan of Munchkin Match? Like us on Facebook for giveaways, contests, the latest news, and more! https://www.facebook.com/MunchkinMatch/ <br/><br/>Need any help? Contact us directly at munchkin@microfun.com", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:04:23", "background_image": "https://media.rawg.io/media/screenshots/8e4/8e4ef206685559df224ced45836d3a98.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 220, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Microfun"], "genres": ["Casual"], "publishers": [], "esrb_rating": null}