{"id": 222155, "slug": "mahjong-journey-a-tile-match-adventure-quest", "name": "Mahjong Journey: A Tile Match Adventure Quest", "name_original": "Mahjong Journey: A Tile Match Adventure Quest", "description": "Embark on a magical journey in this addictive Mahjong Journey® solitaire adventure!<br/><br/>Enjoy a new take on Mahjong Shanghai as you help a young girl and her grandfather traverse the globe in search of her lost parents. Make your way by pairing tiles in order to dismantle hundreds of layouts. Collect achievements for special accomplishments while taking advantage of innovative gameplay twists like Shuffle, which allows you to get out of a difficult situation, or Firecracker, a tool for blowing up multiple pairs of tiles. Visit the Forbidden City, Virupaksha Temple, the Taj Mahal and the famous Mount Fuji as you fulfill challenging quests and earn gold stars for completing levels as fast as you can!<br/><br/>While this game is absolutely free to play, you have the ability to unlock optional bonuses via in-app purchases from within the game. You may disable in-app purchases in your device settings.<br/><br/>● Master over 1800 immersive levels (with hundreds more coming in free updates)<br/>● Match 1806 types of tiles in 43 different tile sets (with more coming in free updates)<br/>● Earn over 40 desirable achievements and utilize four groundbreaking power-ups<br/>● Enjoy gorgeous graphics, rich sounds and regular free updates with new levels, tile sets and more<br/>● Google Play game services support<br/>______________________________ <br/><br/>Compatibility notes: This game performs best on high-end smartphones and tablets.<br/>______________________________ <br/><br/>Visit us: http://www.g5e.com<br/>Watch us: http://www.youtube.com/g5enter<br/>Find us: www.facebook.com/g5games<br/>Follow us:  http://www.twitter.com/g5games<br/>Game FAQs: https://support.g5e.com/hc/en-us/articles/115005748769-Mahjong-Journey<br/>Terms of Service: http://www.g5e.com/termsofservice<br/>G5 End User License Supplemental Terms:  http://www.g5e.com/G5_End_User_License_Supplemental_Terms", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:04:29", "background_image": "https://media.rawg.io/media/screenshots/016/0160a8d4613f8a79dbfeb4eb8bd0ebf4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 193, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["G5 Entertainment"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}