{"id": 222120, "slug": "hopeless-land-fight-for-survival", "name": "Hopeless Land: Fight for Survival", "name_original": "Hopeless Land: Fight for Survival", "description": "A survival mobile shooting game you never tried before – Hopeless Land, which can support 121 players fight in one fatal survival game at same time. Many ingenious game features in Hopeless Land: various of special Asian architectures locate in the battleground; Drive the helicopter and experience the air-to-land modern fight you never tried before; Enjoy ultra-cool shooting feelings with easy operation; No devices barriers, no matter what mobile phones you use, try to survive to the last in the fatal battleground Hopeless Land！<br/>　<br/>========================<br/>Contact Us:<br/>Like us on Facebook: https://www.facebook.com/HopelessLand.Game<br/>Subscribe us on YouTube:<br/>https://www.youtube.com/channel/UCGxAt0FBhGHtBIFwuA3Jv_w<br/>Customer Service Email:  hopelessland@herogame.com<br/>========================<br/>　<br/>----- Game Features -----<br/>If you want to try more fatal and more strategic battle royale game and enjoy simpler operation, don’t hesitate, download and be a warrior Hopeless Land for free now! The combination of randomness and enjoyment brings you infinite possibilities. But remember the only rule is survival, be survival to the last!<br/>　<br/>※1vs100, Test Your Strength and Luck<br/>121 players parachute to perilous hopeless island, what you can believe are only your teammates, your strategies and guns in your hands! Excellent strategies, strong execution and bit of luck constitute the victory iron triangel! Let’s move to the final safe zone, terminate enemies, fight for the highest glory!<br/>　<br/>※Special Designed Battlefield and Brand New Vehicles<br/>Various Asian style buildings, which are inspired by really constructions, can be found in Hopeless Land. Find the most suitable and the most familiar battleground, start your survival travel. Land Air Sea Warfare, the new air vehichal – helicopter you never drived in other mobile shooting game before. The modern carrier owns strong maneuverability can help you no matter in catching enemy or evacuating from battleground.<br/>　<br/>※In-Game Voice Communication Make Your Teamwork Better<br/>In-game voice communication and exact map marking functions help you make strategies with teammates easily. No matter the real life friends or the new warriors meet in Hoplelss Land, the tacit cooperation can be achived among your team! Come to enjoy the team fight!<br/>　<br/>※Suitable Operation Method for Mobile Devices<br/>Hopeless Land was made by the development team which has rich shooting game developing experience. All movements like running, hiding and shooting are designed with motion capture. Simple operation and smooth control feelings help you dominate in Hopelss Land, be the survivor king.<br/>　<br/>※Low Devices Requirment and Easy Control<br/>Low devices requirment make sure that every player has the best survival game time in Hopless Land. No matter you are a veteran or rookie in survial game, you can get started quickly in Hopeless Land, because of the simple control. Enjoy the best free mobile survival game, download Hopeless Land now!", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-31T00:56:07", "background_image": "https://media.rawg.io/media/screenshots/4a6/4a678e0f9a29378b46a21b65b7551d82.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 383, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Hero Game"], "genres": ["Action"], "publishers": [], "esrb_rating": "Teen"}