{"id": 222102, "slug": "8-ball-live", "name": "8 Ball Live", "name_original": "8 Ball Live", "description": "🎱8 Ball Live<br/> is one of the top realistic 8 ball games with online video chat in Android market.<br/>Here we have unique 8 ball pool online game in video live chat, you can also start a billiards pool game in the private billiard room with your friends. Enjoy the real-time multiplayer game everybody’s talking about!<br/><br/>Download 🎱 8 Ball Live and start your pool ball live match! <br/><br/><br/>🎱8 Ball LIVE KEY FEATURES: <br/> <br/>✨ Compete 1-vs-1 match in video real-time live games: Challenge your opponent face-to-face, double fun!<br/>✨ Voice chat: Instant live chat with your competitors <br/>✨ Advanced 3D physics engine: Realistic graphics and sounds effects, authentic pool table game experience<br/>✨ Private 1-vs-1 match room: Log in Facebook, play 1-vs-1 pool ball games with friends, build your social network!<br/>✨ Play with Facebook friends: Sign in with your Facebook account and you’ll be able to challenge your Facebook friends straight from the game. <br/>✨ World tournament: Play like a pro and win your trophies against other pool ball players!<br/>✨ 50+ classy, epic, legendary cues in pool shop: Customize your cue, get advantages to play against your pool ball opponents<br/>✨ Get free pool ball coins and hit the jackpot every day!<br/>✨ Open profile: Show off your brilliant stats<br/><br/>Play in the cool pool hall against players around the world in real-time as you compete in tournaments, 1v1 games and challenge your Facebook friends!<br/>Now slide your screen to aim the ball, drag down the power bar to strike, with skills and concentration to dive into the pool ball game, you are the future billiards pool master in the world tournament.<br/><br/>Come and download<br/> for free today. Pocket all the pool balls on the table, prove yourself in the best online pocket billiards, you are the future billiards master in 🎱8 Ball Live<br/> !", "metacritic": null, "released": "2018-05-04", "tba": false, "updated": "2019-10-22T14:19:14", "background_image": "https://media.rawg.io/media/screenshots/282/282e86772eca979aa6e6f986985f42e0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 206, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "Android"], "developers": ["Noodle Games", "Odd Otter", "Special Tag"], "genres": ["Sports"], "publishers": ["Odd Otter"], "esrb_rating": "Everyone"}