{"id": 222177, "slug": "kievan-rus", "name": "Kievan Rus’", "name_original": "Kievan Rus’", "description": "Kievan Rus’ is a strategy game with a focus on political maneuvering. Here war is just a tool of the trade. <br/><br/>This game enables you to play as the ruler of Kievan Rus’, one of the mightiest states of the world of that time. The Middle Ages is a setting that is truly a treasure for any strategy game fan. In the game, there are 35 states, and Barbarians, who have their own territory and resources. <br/><br/>However, the ruler’s way to domination is not going to be a walk in the park. Get ready for deadly wars and backstairs politics – you will be confronted by the most powerful states of the game world, including England that dominates seas, Balkan states (Bulgaria, Poland, Hungary, Croatia and Serbia), and the Arab state of Syria, with a huge army at its disposal. So you think the Roman Empire has made great progress? Perhaps, you prefer European states, such as France and Scotland? Or it is Byzantium that you consider to be a good example? Let them know you are ready to fight head-to-head and build your own empire, and that you are a dictator and a strategist. Their aim is to advance their own civilization while preventing yours from doing so. Put your political foresight to the test and find out whether you are good at strategy and diplomacy – lead your country through ages and epochs.<br/><br/>To succeed, engage in wars with your rivals. Raise your own army and fleet, declare wars or start fighting in them when they are in full swing. Deploy spies and send saboteurs to your enemy country to find out what they are going to do. Invade states, conquer lands and capture rare resources.<br/><br/>A sagacious dictator is key to state policy success. Manage foreign affairs, conclude non-aggression pacts, and make suggestions to be considered by other states. Remember that diplomacy and well-thought-out policy are often more effective options than war. <br/><br/>Don’t forget about state economic activities: produce food, and manufacture weapons for your army. Use researches to increase the amount of manufactured goods and military capability. However, a single civilization cannot produce everything, so you will have to trade with other states and buy rare resources and goods. <br/><br/>Introduce new laws and make your citizens abide by them. You can establish the civilization religion of your choice. Appoint army and fleet commanders, and tax, trade, economy and construction chiefs. Separatism will not be tolerated: quell riots occurring in your state. Your empire will be mightiest, and diplomacy, weapons and economy will help you achieve it. <br/><br/>The game uses real-life states that existed at that time, with real historic events. The large and detailed map will enable you to see information about your own territory and that of other countries. These are just the game basics: you can find out how much it offers only by playing it. <br/><br/>The game does not require Internet connection, and you can play it anywhere you like. There is no set time limit for turns: you can choose the game pace to your liking. The geopolitical strategy set in the Middle Ages with a special focus on the Slavs is available on smartphones and tablets. It is a good way to spend time, as it combines entertainment and brain exercise.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:04:25", "background_image": "https://media.rawg.io/media/screenshots/10b/10b56a629d86f87de991a55afbcea624.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 221, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Oxiwyle"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}