{"id": 22220, "slug": "flatout-4-total-insanity", "name": "FlatOut 4: Total Insanity", "name_original": "FlatOut 4: Total Insanity", "description": "<p>FlatOut Is Back!<br />\nFlatOut 4: Total Insanity™, where reckless driving has never been this much fun.<br />\nFlatOut 4: Total Insanity™ blends everything everyone has ever loved about FlatOut into one offering.  Gamers will also be introduced to all new and exciting features, game modes, and vehicles which will soon become personal favorites. Another installment of nitro fueled demolition and derby racing featuring a variety of tracks, modes, arenas and multi-player options are available. Welcome back to FlatOut!<br />\nExclusive to STEAM version of FlatOut 4: Total Insanity™<br />\n•   Big Picture Mode<br />\n•   Steam Achievements<br />\n•   Partial Steam Controller Support<br />\n•   Steam Leader Boards<br />\n•   Steam Cloud<br />\n•   Steam Trading Cards<br />\n•   Exclusive Arena: Ice Lake Arena<br />\n•   2 Exclusive Drivers: Gadget Stewart and Dave Worker<br />\n•   2 Exclusive Vehicles: Ice breaker and Repair truck<br />\n•   Steam Workshop coming 30 days post launch<br />\nFlatOut 4: Total Insanity™ Features<br />\n•   High Speed racing and collisions on a variety of tracks and environments<br />\n•   Customizable Cars: Gamers will unlock 27 cars to customize and race, including tributes to fan favorites and new additions to the garage<br />\n•   Gamepad Controller Support<br />\n•   Dynamic Tracks: FlatOut 4: Total Insanity™ features 20 tracks including traditional derby racing, time trials, arenas, assault levels, carnage levels and much more<br />\n•   Destructible Environments: Chaos and destruction return to the world of racing with high speed collisions and wild destructible environments<br />\n•   The Legendary Stunt Mode:  Featuring 12 stunts in total. Six new stunts and six re-imagined classic stunt mini-games await fans in search of epic crashes and death-defying maneuvers<br />\n•   Arena Mode: Three game play styles including Death Match, Capture the Flag and Survivor<br />\n•   New Assault Mode: An arsenal of deadly weapons at your disposal to slow or destroy opponents<br />\n•   Single Player: Race, Destroy and enjoy Stuntman mode offline before showing off your skills in multi-player<br />\n•   Multiplayer Mayhem: Competitive online modes allow up to eight players to master destruction arenas, race courses and set traps<br />\n•   Hot Seat Mode: Take turns with your family and friends in hot seat competition of Stunts<br />\n•   Thumping Indie Soundtrack:  FlatOut features a global range of over 35 amazing indie music tracks<br />\n•   Male and Female Drivers:  12 Drivers: 6 males and 6 females:<br />\n•   Classic<br />\n•   Military<br />\n•   Prisoner<br />\n•   Punk<br />\n•   Clown<br />\n•   Hippie<br />\n•   + 2 Exclusives: Gadget Stewart and Dave Worker<br />\n•   Uses the power of next gen devices with high end 3-D rendering<br />\n•   Sophisticated Physics engine based on Nvidia PhysX and KT Engine</p>", "metacritic": 52, "released": "2017-03-17", "tba": false, "updated": "2024-03-05T22:58:30", "background_image": "https://media.rawg.io/media/games/ee4/ee4520c8196ae7594f67fb653adf2b85.jpg", "website": "", "rating": 2.8, "rating_top": 3, "added_by_status": {"yet": 26, "owned": 342, "beaten": 17, "toplay": 6, "dropped": 24, "playing": 5}, "playtime": 3, "achievements_count": 183, "ratings_count": 54, "suggestions_count": 545, "game_series_count": 6, "reviews_count": 54, "platforms": ["PC", "Xbox One", "PlayStation 4"], "developers": ["Kylotonn Entertainment", "Sidewalk Games"], "genres": ["Racing"], "publishers": ["Strategy First", "Bigben Interactive"], "esrb_rating": "Teen"}