{"id": 222292, "slug": "heroes-of-magic-match-3-puzzle-rpg-games", "name": "Heroes of Magic: Match 3 Puzzle RPG Games", "name_original": "Heroes of Magic: Match 3 Puzzle RPG Games", "description": "Soul summoners, welcome to a real match-3 PvP world! Heroes of Magic is an online game for strategic players addicted to the world of heroes and dragons. Choose your best warriors and lead them into the PvP battles waged with match-3 mechanics. Become a legend by recruiting the best warriors and heroes for the team. Make dragons, creatures, superheroes and other epic warriors fight and win in battles in this fantasy game. In the magic jewel world all battles are won through match 3 puzzles. Crush the jewels with free puzzles to unleash ancient destruction spells. Good strategy, fully equipped armor, sword, arrows or other epic weapon, magic spells, and team of powerful heroes ready to follow your orders is all you need to beat the enemies, defeat great armies of dragons and monsters and show an excellent defense skills. Your magic journey starts now, this action game with unique 3D graphics and a pinch of history, spells and adventure is waiting for you!<br/>What to expect in this match 3 RPG game? Real fights and duels in multiplayer (PvP mode), never-ending quests, legions of heroes and armies of monsters, MMORPG, multiple battles against enemies and coalitions with friends, adventures, events, campaigns and strongholds. But be aware of the fact that fantasy world is so addicting and thrilling that once you enter it and see all the fantasy, monsters, warriors and battles, you may never want to leave!<br/><br/>Play this free online game and become a fantasy winner. Strategy action MMO game for free? Yes! This free RPG game with match-3 elements which brings hours of online play and fantasy gameplay. And both RPG players and match-3 fans will find it engaging. Take part in a PvP multiplayer journey, live your own adventure and legend, invite friends, create your own strategy, make your team of heroes legendary and lead heroes to the victory against monsters and dragons and other hostile warriors and enemies and become a master of war. This epic game for free will let you live through magic, fantasy, adventure. War gaming, role playing, campaigns planning, army defending, strategy building, battles and wars winning, army of heroes leading, enemy fighting? You will do that all in our RPG game for boys and men.<br/><br/>What are the modes you can choose in this MMORPG game with match-3 and puzzle elements? Real PvP (duels in multiplayer game), magic quests, campaigns, battles, stronghold. You can compete with enemies or cooperate with friends. Other game modes make you use other strategy, the game is challenging and unique thanks to that. What makes you engaged in this free game? Taking revenge on enemies, winning the wars and battles and leading the ranking, upgrading heroes and seeing their final evolutions, completing new events, opening chests with spells and other gifts, achieving new levels, becoming a master in puzzle quests and RPG battle. Each level unlocks new arenas, new rankings, new heroes, new campaigns and battles. Stunning 3D graphics changes with new levels and events. You can play match-3 puzzles and collect and upgrade heroes and warriors in a fantasy arena, castle, medieval battlefield, dragons land or even pirates ship. You are a master of strategy in this free mobile game and you decide which quests and puzzles you solve. Your friends can help you, go through fantasy world with you and take part in journey together. Strategy is a key to the victory in this RPG simulation game. Dragons, monsters, dungeons are the only obstacles for you to overcome. Forge your glory and build your empire with match 3 puzzles.<br/><br/>* Play for free - F2P RPG game <br/>* Hundreds of unique characters and legendary teams (league) <br/>* RPG multiplayer MMORPG<br/>* Dungeons, summons, monsters, heroes of RPG online games<br/>* 3D graphics, stunning fantasy world<br/>* Upgrades - customize your heroes<br/>* Clans, guilds - some features coming soon<br/>* New boards, legends, arena, battles", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:04:11", "background_image": "https://media.rawg.io/media/screenshots/a22/a22432f81a860607edce48ad71a9b269.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 299, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Ten Square Games: Sport Hunting and Fishing Games"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}