{"id": 222293, "slug": "kids-games-profession", "name": "Kids Games - profession", "name_original": "Kids Games - profession", "description": "Kids Games - professions will bring your baby positive mood and a smile. It will improve his logical thinking and make his reaction better.<br/>In this app we collected a lot of different educational games for children. So your little one should be busy with it for a long time.<br/>The interface is simple and clear even for a 3 years old child.<br/>Due to the fact that kids always tend to imitate adult most of the games associated with adult professions such as doctor, policeman, chef, fireman and builder.<br/>Builder: the child can build a house. The size of a house and number of parts will be increasing from level to level.<br/>Pilot: the game gives an idea how to control the plane in the sky and how to land.<br/>Doctor: a patient needs help. The child has to decide what to do to cure him quickly.<br/>Policeman: at a high speed an offender went off police's grid. The task is to chase him. And the offender won't give up just like that.<br/>Chef: Let your baby cook! One of the most famous meals in the world is pizza. The task is to make delicious pizzas for our heroes. Playing the Chef is not difficult. It is important to cut all the products carefully and put them to the surface of the pastry correctly. Making a pizza, your baby can use different recipes and choose that one likes.<br/>Fireman: in the city several serious fires broke out. Our team needs help to stop the fire. Firefighters cannot extinguish the fire without water. The hose needs to be connected to stop the fire and save the house from burning.<br/>Jockey: let your baby have a fun. We invite to play racing. Here is a great chance to control a horse and overcome the obstacles. The competition is not only interesting, but also difficult. So welcome to rodeo.<br/>In this app a child has a great opportunity to control a plane, to extinguish the fire, to treat the child and even build a house.<br/><br/>Visit us at: Site: http://yovogames.com <br/>Youtube: http://www.youtube.com/channel/UCZruadkJJTuD4Bgb1F6pa3A<br/>Twitter: https://twitter.com/YOVOstudio<br/>Facebook: https://facebook.com/yovogames", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:04:11", "background_image": "https://media.rawg.io/media/screenshots/3ae/3aed5c287d1753c1437fd63cddce2ca4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 120, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Games from YovoGames !"], "genres": ["Arcade"], "publishers": [], "esrb_rating": null}