{"id": 222235, "slug": "anime-school-dress-up", "name": "Anime School Dress Up", "name_original": "Anime School Dress Up", "description": "All anime and manga lovers, here is a new dress up game for you with cute Japanese schoolgirls! <br/><br/>6 kawaii chibi girls, 4 backgrounds and 200 items to put on - all this amazing variety comes completely free, without any in-app purchases. Try all the different combinations to train you fashion sense. Design great outfits and press \"Camera\" button to save them in your photo albums and share with your friends.<br/><br/>School is a great place to make new friends and even find your first love. If not the boring lessons and the annoying tests, school would be much more fun! In many schools there is a formal uniform which is obligatory for all girl students, and in Japan the uniform can look pretty close to sailor uniforms of the West. That's how chibi anime schoolgirls usually look in comics and cartoons. However, in this game you will also find other types of uniforms as well as more casual clothes which girls can wear in less conservative schools and outside Japan. Create cool, cute or nerdy looks for the chibi girls.<br/><br/>These schoolgirls are cool, beautiful, love parties and dress up games. They are true fashionistas in their hearts, follow trends in fashion and go shopping almost every evening after school. Most of all in their school life they like holidays and vacations. After high school these girl students dream to become actresses, supermodels or Youtube celebrities. They love to make selfies and post them on social networks. These amazing kawaii girl friends are very popular in their class at school!<br/><br/>We've got more dressup games for anime and manga fans: \"Anime Dress Up\", \"Anime Wedding\" and \"Manga Dress Up\". Download them free by following the \"More by Games For Girls\" link!", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:04:16", "background_image": "https://media.rawg.io/media/screenshots/091/09184b98fa9a859d510d394c87985040.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 125, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["lepshy.com"], "genres": ["Casual"], "publishers": [], "esrb_rating": null}