{"id": 222393, "slug": "twin-shooter-invaders", "name": "Twin Shooter - Invaders", "name_original": "Twin Shooter - Invaders", "description": "*** Pocketgamer Silver Award Winner ***<br/><br/>Now with NEW SHIPS, NEW ENEMY and a brand NEW POWER-UP!!!<br/><br/>Shoot Once. Die Twice!<br/><br/>Shoot. Kill. Die. BOOM! Welcome to Twin Shooter, the old school space shmup where YOU CAN SHOOT YOURSELF!<br/><br/>Fight increasingly difficult waves of invaders controlling two starships that are facing each other. Shoot enemies before they get you… but beware, because your ships can also shoot each other! Try conquering the high scores by yourself or bring a friend and play on the same device with the 2 player cooperative mode. <br/><br/>With up to 20 different spaceships to unlock, Twin Shooter distills the experience of the explosive action of arcade machines such as Space Invaders or Defender and brings it to your smartphone and tablet, maintaining the same kind of playability: easy to pick up and play, but hard to master!<br/><br/>Are you ready for the next level in arcade shooters? How many waves are you going to last before obliterating into millions of pieces? Are you going to be shot… or are you going to shoot yourself?<br/><br/>FEATURES<br/>✔ 1 player and 2 players cooperative mode! <br/>✔ Simple touch control - slide to move your starships<br/>✔ Endless gameplay<br/>✔  A considerable amount of explosions<br/>✔  20 different ships to unlock, each with an special power-up<br/>✔  Epic Boss fights!", "metacritic": null, "released": "2015-09-30", "tba": false, "updated": "2019-07-29T22:22:21", "background_image": "https://media.rawg.io/media/screenshots/c2f/c2f5c719ab3ad9de3e09e070118895a0.jpg", "website": "http://www.erepubliklabs.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 291, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Erepublik Labs"], "genres": ["Action", "Arcade", "Casual"], "publishers": ["eRepublik Labs"], "esrb_rating": "Everyone 10+"}