{"id": 222399, "slug": "magic-book", "name": "Magic Book", "name_original": "Magic Book", "description": "Welcome to the Magic Book – one of the most popular match-3 genre!<br/><br/>Complete levels one by one, matching crystals, using magic and solving riddles in this fascinating puzzle game. <br/><br/>Explore the world filled with magic, free new characters and defeat villains! Be smart and show your skills, making moves in the game, because each of them can be rewarded with an interesting bonus or a colorful cascade of combinations!<br/><br/>Magic Book is a free game. There are also some in-app purchases which provide more opportunities.<br/><br/>The storyline:<br/><br/>The main character is a little dragon Draco, who has just hatched out. Now he is all alone in a strange world. In the game, the dragon explores the world and looks for his lost friends. Suddenly he finds out all of them have been abducted and kept by the evil sorceress and her servants.<br/>The dragon needs to gain strength to free all the fabulous characters and relieve the forest from the danger! <br/><br/>Main features:<br/><br/>- colorful graphics<br/>- the most popular match-3 genre<br/>- completely free<br/>- various game modes: collect points and crystals, collect items by moving them to the lower edge of the playing field, drive fireflies away and much more. <br/>- interesting and varied levels <br/>- playing the game every day, you can get useful prizes.<br/>- free new characters, upgrade them and get new skills to complete levels!<br/>- discover new wonderful places on the map and meet new characters.<br/>- make matches to get the charged bomb-crystals and use them in the game as well!<br/>- defeat the villains on the levels with bosses.<br/> <br/>Download the Magic Book now and enjoy it!<br/><br/>The world of magic is waiting for you….", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:03:48", "background_image": "https://media.rawg.io/media/screenshots/a88/a88a9dc15562ffb123592fd8fe5ea55f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 209, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Games from YovoGames !"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}