{"id": 222319, "slug": "repair-machines-monster-trucks", "name": "Repair machines - monster trucks", "name_original": "Repair machines - monster trucks", "description": "All kids, boys and girls, love the games about cars. When they play such wonderful educational games for children, they necessarily represent themselves as the driver of the real machine, and it does not matter - these are small cars, or high-speed sports cars, this is car washing and car repair. <br/>We are happy to introduce to you and your kids our new, fun and very exciting game for young motorists - \"Car Repair - Monster Truck\". <br/>Imagine - a powerful sports monster tracks participate in serious competitions, proving to everyone who is faster and stronger. Naturally after the off-road races, they need a very serious and thorough repair. And then you, as a real mechanic, are simply obliged to help them. And that's why they need your car repair shop, which they came to for inspection. <br/>In our game about repairing cars you have to repair and clean the machines. But to do this you will need the newest and up-to-date equipment, with which you can repair the machine, remove dents, clean rust and dirt, remove holes and scratches, repaint the car in the brightest new color. You have to look into the heart of the car - under the hood, eliminate all the problems and breathe new life into your four-wheeled friend. <br/>In the end - you will have to install new, more attractive tires, stick colorful and bright stickers on your body, make your car much prettier and more attractive than it was before, highlight it among others and show - it is your car. <br/>In the course of the game, your little one will be able to understand and learn in practice how to repair a car, to do it in a simple and understandable game form, to get the most basic and vitally important skills in repairing vehicles in modern life. <br/>All our children's games about cars will impress your kids with their bright, colorful and pleasant graphics and certainly will not leave your baby indifferent.<br/>Learn technique with the baby - for this you need to download and install our application for free on your phone or tablet. Our game will not leave you or your baby indifferent, will present many cheerful and joyful minutes and help with huge benefit to spend your free time.<br/><br/>Do not forget to visit our website at http://yovogames.com<br/>Twitter: https://twitter.com/YOVOstudio<br/>Facebook: https://facebook.com/yovogames<br/>OK: www.ok.ru/yovo.games<br/>VK: https://vk.com/yovogames", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-31T00:33:50", "background_image": "https://media.rawg.io/media/screenshots/720/72017a424784697b16b5cc868e33d298.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 38, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Games from YovoGames !"], "genres": ["Racing"], "publishers": [], "esrb_rating": "Everyone"}