{"id": 222323, "slug": "nail-salon-princess", "name": "Nail Salon: princess", "name_original": "Nail Salon: princess", "description": "Welcome to our new game for young fashionistas - \"Nail salon\". This game is dedicated to children who adore stylish manicure and who are willing to spend their free time learning to make the most beautiful nails.<br/>When you play a manicure for girls - you will certainly be able to put aside other games of similar themes for a long time, and at the same time you will certainly learn how to make your own unique manicure by yourself, thereby raising your skills to a professional level. You will not need to visit manicure salons anymore, because you yourself will learn how to do the best manicure.<br/>Everyone wants to become successful in the world of fashion and design. But you have such a chance. You have a real opportunity to show to your relatives, friends, relatives - you are the most talented manicurist. Do not miss the chance! Try one of the first to download the game manicure.<br/>Before going to the nail salon, if you doubt what kind of nail design you would like to do, do not know how to make beautiful nails - we will be able to help you in this. You just need to spend your free time for training.<br/>In this game you have the opportunity to take advantage of the best advanced technologies and tools that are currently in modern cosmetology. Here you can see a large number of nails of various lengths, shapes, sizes. Create an interesting manicure with your own hands!<br/>Variations in the colors of different varnishes are limited only by your imagination. You can easily experiment with different colors, try to combine rhinestones, stickers on nails, and thus create a beautiful fashionable manicure. Also there is an opportunity to show to relatives, friends and acquaintances how you can skillfully make up your nails, report it on social networks, take photos, send results of your own creativity.<br/>Download and install our mobile application on your phone or tablet, create your own, original and glamorous manicure. Use your imagination and, ultimately, with our game, you will not be bored. Learn to make your nails beautiful and original. Spend time cheerfully and profitably.<br/> <br/>Visit us at: Site: http://y-groupgames.com", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:04:03", "background_image": "https://media.rawg.io/media/screenshots/a7a/a7ad010d972c8285d5494ca7a86ae43c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 79, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Games from YovoGames !"], "genres": ["Casual"], "publishers": [], "esrb_rating": null}