{"id": 222382, "slug": "age-of-lords-legends-rebels", "name": "Age of Lords: Legends & Rebels", "name_original": "Age of Lords: Legends & Rebels", "description": "Age of Lords is a new strategy MMO game set in the medieval age. As a mighty lord you will build a grand castle, forge alliances and TRAIN massive armies to defeat other REAL players.<br/><br/>FEATURES<br/>✔ Develop your castle, research new technologies and become a kingdom builder<br/>✔ Use diplomatic strategy to forge Alliances with other lords<br/>✔ Use brute force and subterfuge to defeat enemy players<br/>✔ Train a massive medieval army with various troops including cavalry, infantry and archers<br/>✔ Explore the Kingdom Map to gather resources, scout rebel players<br/>✔  Experience the dragon age and become a monster slayer<br/>✔ Chat in real time and set up diplomatic ties with other alliances<br/>✔ Discuss war strategies with allied lords<br/>✔ Form a rally march and hire lords and knights to boost your chances to win<br/>✔ Become part of the legends and rebels by conquering the King's throne<br/>✔ Reach the top of the rankings and earn the respect of the whole kingdom<br/>✔ Compete with thousands of player in weekly events<br/>✔ Level Up your Hero<br/>✔ Learn the greatest mmo strategy of medieval times by completing hundreds of Quests and collecting massive rewards<br/>✔ Use FREE Speed Ups to develop faster and trump your enemies<br/>✔ Become a VIP player and gain game-changing bonuses<br/>✔ Discover countless strategies and diplomatic choices!<br/>Join a new age of warfare and test yourself against real players worldwide in the best mmo medieval! PLAY NOW!", "metacritic": null, "released": "2015-06-16", "tba": false, "updated": "2019-07-29T22:25:45", "background_image": "https://media.rawg.io/media/screenshots/c50/c50d39d8105d64eab59067ca90a0c5a6_G7UmbUq.jpg", "website": "https://www.ageoflords.com", "rating": 0.0, "rating_top": 0, "added_by_status": {}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 504, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Erepublik Labs"], "genres": ["RPG", "Strategy"], "publishers": ["eRepublik Labs"], "esrb_rating": "Teen"}