{"id": 222448, "slug": "frog-funny-adventures", "name": "Frog: funny adventures", "name_original": "Frog: funny adventures", "description": "Greetings to everyone who loves funny games! We are glad to present you one of the new, amazing games about the fun adventures of the fun frog who decided to go around the world, towards his dream - to learn this magnificent, mysterious and magical world. Introducing you and your kids a new game from the series of children's educational games: \"Frog: funny adventures.\"<br/>Well, the time of adventure has come. And our frog is ready to go. Go on a trip with our hero and help him reach his goal! With your head plunge into the world of exciting mini-games, collect coins and improve your character.<br/>Playing the frog will give you and your kids a lot of unforgettable and thrilling experiences. You will have to overcome many different obstacles - to skate over the celestial islets and try not to fall, it is safe to lead the character across the road, conquer the insurmountable peaks of the mountains, escape on the skateboard from the mad professor and descend the parachute from a huge height among the sharp rocks. In this case it will be necessary to be as careful and cautious as possible so that the adventures of the frog do not end.<br/>Games about frogs are very funny and funny. A stunning soundtrack and colorful animation makes them truly fascinating and exciting, plunging into a fairy-tale world.<br/>        If you are ready to accept the challenge, go to meet the dangers and difficulties - you just need to download the game, install it and go to meet the dangers of a great trip. Take the challenge and get a lot of fun, playing a fun game about the frog!<br/><br/><br/>Be sure to visit our website at http://yovogames.com<br/>Twitter: https://twitter.com/YOVOstudio<br/>Facebook: https://facebook.com/yovogames<br/>OK: www.ok.ru/yovo.games<br/>VK: https://vk.com/yovogames", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:03:37", "background_image": "https://media.rawg.io/media/screenshots/534/5340792881edbcad747cff5b1e15ecf2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 92, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Games from YovoGames !"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}