{"id": 222482, "slug": "kids-nail-salon", "name": "Kids nail salon", "name_original": "Kids nail salon", "description": "We are glad to welcome all the young admirers of beauty and fashion who simply adore stylish manicure and beautiful nails, dreaming to learn how to create their own unique design of nails, and we offer to play our new fascinating game - \"Kids nail salon\".<br/>Now, before going to the nail salon, you will not need to look for fashionable catalogs of new pictures on nails, to find out what colors and shades are in fashion. No need to worry, what kind of drawing or stickers on the nails you will offer a master of manicure in the salon. All this is in the past. Now you can, before going to do yourself a real manicure, play a game and create for yourself your own perfect manicure, and then already embody the results of your imagination in practice. In doing so, you will receive a huge number of positive emotions and have fun your free time.<br/>Game manicure for girls will teach and show how beautifully to make up nails, pick bright colors and shades, create an amazing and unique holiday manicure, create unique, beautiful drawings on the nails. After all, in this game your experiments with flowers, drawings and stickers can be limited only by your imagination. Create an interesting manicure with your own hands and surprise them with your loved ones!<br/>All you need is to download the game manicure, install it, use your imagination and start creating your own, unique super manicure.<br/> <br/> <br/>Visit us at: Site: http://y-groupgames.com", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:03:29", "background_image": "https://media.rawg.io/media/screenshots/c1f/c1fbe3643adbd306beb5771bfa2d12be.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 62, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Games from YovoGames !"], "genres": ["Casual"], "publishers": [], "esrb_rating": null}