{"id": 222415, "slug": "block-dayblock-puzzle", "name": "Block Day(Block Puzzle)", "name_original": "Block Day(Block Puzzle)", "description": "“Block Day” is the best addictive block puzzle game!<br/> Tap to rotate Block Days and placed in to completed lines!<br/> Challenging yourself! Using special blocks to get your high score!<br/><br/>*TAP &amp; DRAG! Simple game play that everyone can enjoy!<br/> Tap to rotate block and drag to placed into the board!<br/> Complete a line either vertically or horizontally, just completed your line with no space then it will be disappear!<br/><br/>*Simple block puzzle with unique strategies!<br/> Rotate various shape of blocks without limit!<br/> Using your own strategies to rotate your block then placed in best position! <br/> Using special &amp; extra blocks that has variety skills to get your high score! <br/><br/>*EXTRA blocks and SPECIAL blocks!<br/> Survive as long as you can to unlock extra blocks!<br/> Enjoy special blocks’ skills! It will make your game more dynamic!<br/><br/>*Lovely characters!<br/> Completed line to feed your starving characters!<br/> Characters will give useful item to you when you feed them!<br/> Please fee them more and more! If characters couldn’t eat blocks, the game will be over!<br/><br/>*So simple!<br/> Quick into the game play! Do not need to sign in and any other unnecessary steps!<br/> Do NOT need network connection! Do NOT worry about your data issue!<br/> Even airplane, you can enjoy the game!", "metacritic": null, "released": "2018-01-10", "tba": false, "updated": "2019-10-22T13:58:35", "background_image": "https://media.rawg.io/media/screenshots/43b/43b2af9aba88f7e884cfb65774a294f1.jpg", "website": "https://monsterplanet.co.kr", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 47, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["MONSTER PLANET"], "genres": ["Family", "Puzzle"], "publishers": ["MONSTER PLANET"], "esrb_rating": null}