{"id": 222553, "slug": "utanoprincesama-shining-live", "name": "Utano☆Princesama: Shining Live", "name_original": "Utano☆Princesama: Shining Live", "description": "Enjoy your favorite Utano Princesama music in this intuitive rhythm game, which is also a massive hit music game app in Japan! Simple and fun to play. Just tap along to the rhythm!<br/><br/>Meet the members of leading entertainment company Shining Production’s hottest new group STARISH and the veteran members of QUARTET NIGHT. Communicate with all eleven stars, follow their behind-the-scenes lives in Story mode, and then take to the stage and help them deliver the show of a lifetime! Support your favorite boys as they aim for the top!<br/><br/>Enjoy a Japanese anime rhythm game with idol-raising features!<br/><br/>Utano☆Princesama Shining Live Features<br/><br/>- Play your favorite Utano Princesama songs anytime you like!<br/>- Create your ideal unit and increase the Bond between the unit members!<br/>- Meet all 11 stars anytime you like! Depending on the time you visit, he will say different things.<br/>- Collect Photos and then unlock new voice clips, original side stories, special outfits, and more!<br/>- Arrange your units any way you like. You don’t have to stick to the groupings in the story! Enjoy features that let you level them up and make them better idols!<br/>- All stories are fully-voiced, included side stories!<br/>- Increase your Bond with the guys to unlock new voice clips.<br/>- Unlock Special Shots and high-quality Posters of your favorite stars!<br/><br/>Raise his Bond with you and maybe something special will happen on your home screen!<br/><br/>Spend everyday in your new life surrounded by 11 hot idols!<br/><br/>Want to know more about Utano Princesama Shining Live?<br/>Check out our website for all the latest game news: https://www.utapri-shining-live.com/en/<br/>You can also follow us on Facebook and Twitter at:<br/>https://www.facebook.com/ShiningLiveEN/<br/>https://www.twitter.com/shininglive_en<br/><br/>Utano☆Princesama Shining Live is a completely free to play game that contains optional in-game items that require payment.<br/><br/>System Requirements<br/><br/>Amount of storage needed: 2GB<br/>(We recommend having at least 3GB free on your device.)<br/><br/>Troubleshooting when App is Unresponsive<br/>Please try the following if the app stops responding.<br/>If the app starts working again after one of these steps, feel free to stop the troubleshooting process.<br/><br/>Restart the app.<br/>Restart your device.<br/>Tap the “Repair Data” button on the Title screen. (The screen that says “Tap to Play.”)<br/>Delete the app and reinstall it. (Only do this step after making sure that your game data has been linked to another account. Tap “Other” on the Main screen then go to “Account Link” to make sure you have linked your data.)<br/><br/>If none of the above resolve this issue, please contact customer support.<br/><br/>The following permissions are necessary to play this game.<br/><br/>READ_EXTERNAL_STORAGE<br/>WRITE_EXTERNAL_STORAGE<br/><br/>These permissions are necessary for the game to be able to store the data of photos taken with the camera mode in an external location. <br/><br/>This application uses the following middleware:<br/>- “CRIWARE ™” by CRI Middleware Co., Ltd.<br/>- “Live2D®” by Live2D Inc.\"\"<br/><br/>App Content is in English or Traditional Chinese.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:03:13", "background_image": "https://media.rawg.io/media/screenshots/533/5330ce50287792adeeddc9afbd1cc238.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "dropped": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 345, "game_series_count": 0, "reviews_count": 1, "platforms": ["Android"], "developers": ["KLab"], "genres": [], "publishers": [], "esrb_rating": null}