{"id": 22259, "slug": "kimmy", "name": "Kimmy", "name_original": "Kimmy", "description": "<strong>Kimmy is a visual novel style game about a summer spent babysitting in late 1960s Massachusetts.</strong> You play as Dana, who stumbles across Kimmy--a tiny girl wandering around alone in her neighborhood. Dana decides to take Kimmy under her wing, worried that she's having trouble making friends, and decides to be her babysitter. Let summer begin! Collect trinkets, play street games, and learn more and more about Kimmy and her mysterious family as summer passes by.<br/><br/><strong>Features:</strong><br/><br/><ul><li>A dialogue rich story that takes place over the course of 5 acts.<br/></li><li>Over 10 characters to chat with and get to know throughout the story.<br/></li><li>A painterly art-style brings the characters to life, including multiple illustrated cut scenes.<br/></li><li>An intimate story about childhood, honesty and growing up.</li></ul><br/><strong>Recommendations and Notes</strong><br/><br/><ul><li>A single play through takes about 2 to 3 hours. <br/></li><li>Play multiple times to see all of the conversations.<br/></li><li>Headphones are recommended.</li></ul><br/><strong>Content warning:</strong><br/><br/>Kimmy is a game about childhood, but it does address some more serious issues and is primarily intended for adults. There are conversations between the characters about things like death, profanities and alcohol. Please consider this before playing this game with younger kids.<br/><br/><strong>Credits:</strong><br/><br/>Designed and written by: Nina Freeman<br/>Illustrated and written by: Laura Knetzger<br/>Programmed by: Aaron Freedman<br/>OST Composed by: Louie Zong<br/>Sound design by: Amos Roddy<br/>Special thanks to Noel Clark for the Kimmy logo design.<br/><br/><strong>Kimmy was originally commissioned by Humble Bundle as a part of the Humble Monthly Bundle</strong>, released to subscribers in January of 2017. Special thanks to Humble Bundle for their support in the development of <strong>Kimmy</strong>!<br/><br/>", "metacritic": null, "released": "2017-04-18", "tba": false, "updated": "2023-06-09T02:21:30", "background_image": "https://media.rawg.io/media/screenshots/3f3/3f345350f3da7eeb09b915789d48954b.jpg", "website": "http://ninasays.so/kimmy", "rating": 2.17, "rating_top": 1, "added_by_status": {"yet": 22, "owned": 233, "beaten": 3, "toplay": 1, "dropped": 4}, "playtime": 2, "achievements_count": 0, "ratings_count": 6, "suggestions_count": 158, "game_series_count": 0, "reviews_count": 6, "platforms": ["PC", "macOS"], "developers": ["Star Maid Games"], "genres": ["Indie"], "publishers": [], "esrb_rating": null}