{"id": 222542, "slug": "yazy-the-best-yatzy-dice-game", "name": "Yazy the best yatzy dice game", "name_original": "Yazy the best yatzy dice game", "description": "Join millions of fanatical Yatzy players. Get the best dice game ever: Yazy! It is simple, fast to learn and offers you guaranteed fun!<br/><br/>Yatzy is composed of 13 rounds. There are five dice that can be rolled up to three times in each round. At any moment you can choose one of the 13 category boxes to score the result you achieved. Many of the sets are Poker like, such as 3 of a kind, 4 of a kind, straights, etc. Some call it dice poker game.<br/><br/>You have to score once and only once in each category box. You must think, judge and develop your skills to progress and improve your gaming abilities. As the game unfolds your category boxes start to run out. The objective is to achieve the highest score from these 13 rounds.<br/><br/>Features:<br/><br/>- The best tutorial for the new players<br/>- Best, easiest interface you will find anywhere<br/>- 4 playing options *<br/>- Customizable dice colors <br/><br/>* This amazing Yatzy dice game has 4 playing options:<br/><br/>- One Solo Game: One column game<br/>- Triples Game: Longer three columns game<br/>- Play versus opponent: Play against the robot<br/>- Local pass and play: Play a friend using the same device<br/><br/>This is the coolest yatzy dice game ever. Try it now and let us know what you think! We are always improving. The game is also called Poker Dice Game, The Yacht Game, Yatzy, Yam’s, or Yatzee. Some common typos are yahtzy, yahtzee tm, yatze, yatsy, yazee and. It is a fantastic family dice game.", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-30T19:53:45", "background_image": "https://media.rawg.io/media/screenshots/d42/d42084a454e5df140c2c2c7c6d8611cf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 130, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["FIOGONIA"], "genres": ["Board Games"], "publishers": [], "esrb_rating": "Everyone"}