{"id": 222622, "slug": "valet-parking-multi-level-car-parking-game", "name": "Valet Parking: Multi Level Car Parking Game", "name_original": "Valet Parking: Multi Level Car Parking Game", "description": "Brand New Game from Producers of City Driving and Truck Simulator 2017.<br/><br/>Parking your customers cars safely, be the best valet driver! Multi Level Car Parking Game.<br/>Completely realistic missions and Car Parking experience are waiting for you.<br/><br/>You may have played different valet parking games, this time your professional parking skills will be tested in this multiple story car parking simulator. This unblock car parking free game is different from typical parking car games. Here in this luxury vehicle parker mania, you will park in two different classic car park systems. In one environment, you have to drive speedy vehicle in underground parking lot. But in other systems, the driver has to drive a super car in a multi-story building. Parking cars to customers smoothly, earn money! Do not crash to earn more money! If you do the Valet Park service perfectly, you can go to the world rankings!<br/><br/>Starting with the unblock motorcar parking, the expert parker has to park in underground car lots. Drive carefully the car because there are different obstacles to avoid. Press the race paddle slowly or you would not be able to control your urban car in this car park simulator. Adjust your 360° camera while driving through sharp turns and narrow path of this impossible track parking lot simulation.<br/><br/><br/>FEATURES<br/><br/>- Multi Level Car Parking<br/>- Realistic customers<br/>- 360° camera<br/>- Detailed environment<br/>- More than 50+ career levels<br/>- Amazing real-like graphics<br/>- Realistic traffic system<br/>- Achievements and Leaderboards<br/>- Easy controls (Tilt, Buttons or steering wheel)<br/>- More than 15 language support<br/><br/>Are you ready to be the best valet driver?  Valet Parking : Real Car Parking play now!<br/><br/><br/>GAMEPLAY<br/><br/>- Control your vehicle by motion sensor or touching <br/>- Touch right on screen to accelerate <br/>- Touch left on screen to slow down <br/>- You may change vehicle controls through settings <br/><br/><br/>HINTS<br/><br/>- Do not crash to earn more money<br/>- If you car drive faster, you can get more money and points <br/>- You can get more money and points by overtaking a vehicle in traffic <br/><br/><br/>Attention: Drive safely and follow traffic rules in real life.<br/><br/><br/>For any inquires and opinions please contact us on help@zuuks.com.<br/>_________________________________________________________________<br/><br/>Official website: http://www.zuuks.com<br/>Follow us on Youtube: https://www.youtube.com/channel/UCSZ5daJft7LuWzSyjdp_8HA<br/>Follow us on Facebook: https://www.facebook.com/zuuks.games<br/>Follow us on Twitter: https://twitter.com/ZuuksGames", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:03:02", "background_image": "https://media.rawg.io/media/screenshots/da8/da89eb0bd53b0484b8979a10f0ad2aba.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 155, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Zuuks Games"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}