{"id": 222658, "slug": "lost-journey-dreamsky", "name": "Lost Journey", "name_original": "Lost Journey", "description": "Dreamsky Games, Just be Happy!<br/><br/>\"Lost Journey\" is a puzzle game of space exploration, we have received:<br/>\"2015 IndiePlay Best Mobile Game\" nomination<br/>\"2014 Imagine Cup\" award in China<br/>\"2014's most anticipated ID @ Xbox game\"<br/><br/>On a Journey… Lost, but not without Hope<br/>An angel of heaven comes to Jennifer in the form of a butterfly. This plane of existence mirrors the serene world she left behind, but there are secrets – memories – hidden here. As Jennifer collects the shards of her memories, she confronts many trials, but the happy memories and her strength of spirit solidify her resolve, spurring her onward. With her guide at her side, Jennifer sifts through time and space, reverses gravity, and does the otherwise impossible to find her happiness and her way back to heaven. Jennifer will uncover the truth; she will reach the end of her Lost Journey.<br/><br/>The serene music and uplifting backgrounds in Lost Journey convey hope and beauty even in the journey after death. Through Jennifer, players realize that their own strength of spirit will carry them through their own trials in life, and ultimately allow them to reach the end of any Lost Journey.<br/><br/>【Game Features】<br/>- Nomination of Best China IndiePlay Game <br/>-Colorful, soulful artwork draws players into the story and journey.<br/>-Players can literally ‘flip’ the scene to expose new paths and opportunities.<br/>-Reverse Gravity, Bend Time, Manipulate Space… this reality is not as straightforward as it appears!<br/>-Music nicely compliments the Asian setting and relaxed feel of the game.<br/><br/>【Follow Us on 】<br/>Facebook:https://www.facebook.com/ALostJourney/<br/>Youtube: https://goo.gl/0gPgIY<br/>Visit our Official site: http://www.dreamsky.me/lost-journey-game", "metacritic": null, "released": "2016-01-28", "tba": false, "updated": "2021-03-22T03:32:14", "background_image": "https://media.rawg.io/media/screenshots/647/6478578a91ca4d342e5d6e39ad30ef3f.jpeg", "website": "https://www.facebook.com/SoulGameFans/", "rating": 0.0, "rating_top": 5, "added_by_status": {"yet": 2, "owned": 3, "beaten": 2, "dropped": 4}, "playtime": 0, "achievements_count": 0, "ratings_count": 5, "suggestions_count": 185, "game_series_count": 0, "reviews_count": 5, "platforms": ["Android", "iOS"], "developers": ["SOULGAME INFORMATION CO", "DreamSky", "Guangzhou CooHex Technology Co"], "genres": ["Adventure", "RPG", "Puzzle"], "publishers": ["SOULGAME INFORMATION CO", "Guangzhou CooHex Technology Co"], "esrb_rating": "Everyone 10+"}