{"id": 222629, "slug": "anycard-2", "name": "ANYCARD", "name_original": "ANYCARD", "description": "Here in K52 we wanted to create something more than a simple magic app and we succeeded. <br/><br/>ANYCARD is a real magic tool, always ready and always with you. It allows you to create truly impossible effects. <br/><br/>A real reputation-maker.<br/><br/>ANYCARD allows you to bring up any card of the deck on the display of your phone, instantly and without difficulty.<br/>Your audience will be speechless. <br/><br/>They can think of any card, touch it, draw it, mimic it... any card in any way and you'll be able to make it appear on the screen of your phone. As if you had real powers.<br/><br/>You decide how the card is chosen and how to produce it on your screen, depending on your taste and style. Use it with already existing effects or shock someone just by snapping your fingers and making the card appear on the display. <br/><br/>ANYCARD has been extensively tested with laymen and magicians alike and none of them was able to understand the diabolical method.<br/><br/>The most common question we received: \"IS IT REAL MAGIC?!?\"<br/><br/><br/>HIGHLIGHTS:<br/><br/>· No voice commands.<br/>· No visual recognition.<br/>· Easy to perform.<br/>· No forces.<br/>· Any card.<br/>· Any deck.<br/>· Usable with no cards.<br/>· Endless possibilities.<br/>· Instant reset.<br/><br/><br/>Times change, magic changes. This is a modern miracle, ALWAYS with you.<br/><br/>Any sufficiently advanced technology is indistinguishable from magic. <br/>- Arthur C. Clarke", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-31T01:43:28", "background_image": "https://media.rawg.io/media/screenshots/a3a/a3adec2a8455f7a3a1c6a0784134fd0a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 76, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["K52"], "genres": ["Card"], "publishers": [], "esrb_rating": "Everyone"}