{"id": 222760, "slug": "empire-four-kingdoms-2", "name": "Empire: Four Kingdoms", "name_original": "Empire: Four Kingdoms", "description": "Build alliances and conquer rival kings in MMO battle. Defend your castle from enemies and fight a medieval war with epic PvP strategy. With a custom palace and formidable army, you could rule the Four Kingdoms! <br/><br/>Conquer kings and defend your kingdom in this epic PvP strategy game. Do you have what it takes to rule an empire, fight enemies, defend your castle and build a growing army to dominate the Four Kingdoms? With this epic MMO game, you can employ cunning strategy to defend your kingdom, wisely choose your alliances to fight with you in battle and create a resourceful army.<br/><br/>Download Empire: Four Kingdoms and join millions of players in this award-winning multiplayer strategy and medieval war game. With powerful rulers, fierce battles and strategic masterminds, your best PvP battle skills will come to the fore.<br/><br/>Empire Four Kingdoms: TOP 5 REASONS TO DOWNLOAD<br/>1. Fight enemies and battle rival kingdoms with tons of different weapons &amp; 50 different units<br/>2. Build, customize and expand your castle to a mighty fortress. Defend your palace from an invading empire in this MMO war game<br/>3. Alliances with kings &amp; other players help you to conquer rival clans and gain territory on an interactive map<br/>4. Build over 60 different constructions, expand your palace &amp; produce and trade resources<br/>5. Enemies advancing towards your palace? Chat with friends or join the huge MMO community &amp; active forum for advice on how to make your kingdom the most powerful of all. <br/><br/>Regular updates with new and improved features make this the number one medieval strategy game. Take part and play in community events, discover new research levels and try out new Combo Tools in the latest update.<br/><br/>Problems &amp; Questions: http://support.goodgamestudios.com/?lang=en&amp;g=16<br/>Forum &amp; Community: http://en.board.goodgamestudios.com/empirefourkingdoms/forum.php<br/>Facebook: https://www.facebook.com/EmpireFourKingdoms<br/>General Terms and Conditions: https://www.goodgamestudios.com/terms_en/#terms<br/>Privacy Policy: https://www.goodgamestudios.com/terms_en/#privacy-mobile<br/>Imprint: https://www.goodgamestudios.com/terms_en/#imprint<br/><br/>Subscription (optional):<br/>- Empire: Four Kingdoms offers two types of auto-renewable monthly subscriptions: Player subscriptions and alliance subscriptions. <br/>- Player subscriptions activate special effects, bonuses, and/or convenience features for your army during the period the subscription is active.<br/>- Alliance subscriptions activate or boost special effects and bonuses for each alliance member’s armies during the period the subscription is active.<br/>- Your subscription will be charged to your Google Play account at confirmation of purchase and automatically renewed every month unless you cancel the auto-renewal at least 24 hours before the end of the current period.<br/>- You can manage your subscription and/or turn off auto-renewal by visiting your Google Play account settings after purchase.<br/>- If you own both subscription types (player and alliance), you need to cancel both separately.<br/>- If you own both player subscriptions, you need to cancel both separately. <br/>- After canceling a subscription, you will still keep your active bonuses until the date when the automatic renewal is due to occur. After this date, all active bonuses for that subscription will expire.<br/><br/>* This app is completely free to play. Additionally it offers optional in-app purchases.<br/>This game requires an internet connection.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:02:43", "background_image": "https://media.rawg.io/media/screenshots/57f/57f9d40ae8c5fe5fc16475f5a1baf72f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 378, "game_series_count": 0, "reviews_count": 2, "platforms": ["Android"], "developers": ["Goodgame Studios"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}