{"id": 222795, "slug": "dungeon-maker", "name": "Dungeon Maker", "name_original": "Dungeon Maker", "description": "Dungeon Maker is a multiplayer application/game to bring your tabletop fantasy role-playing online.  Dungeon Maker is designed to work best with the Dungeons and Dragons 5e ruleset, though no content from DnD is included with the game.<br/>\n<br/>\r\nWith Dungeon Maker you can design Characters, Enemies, and NPCs, and set their portraits which will be shared to all players in the game.<br/>\n<br/>\r\nDungeon masters can use the Campaign Designer to create a world map for your campaign, and host this campaign to any players without having to have players download the maps.<br/>\n<br/>\r\nA continually evolving and robust Map Maker will let you create encounters and areas for your players to explore.  These maps and encounters are hosted purely by the Dungeon master, so anyone can join without downlaoding the campaign.<br/>\n<br/>\r\nCampaigns are hosted over the internet by IP, or locally on a LAN.  Let your play group join you from anywhere.  A video tutorial for multiplayer IP can be found on the Tavarin Games YouTube channel:<br/>\r\nhttps://youtu.be/K9v_OOVSVRo<br/>\n<br/>\r\nPlayers can see the world, interact with NPCs and enemies, and roleplay to their heart's content.<br/>\n<br/>\r\nDungeon Masters can switch between maps and encounters, control enemies and NPCs, move players, and control the game.", "metacritic": null, "released": "2022-01-07", "tba": false, "updated": "2022-01-10T03:08:33", "background_image": "https://media.rawg.io/media/screenshots/efa/efa423128d21c9783e7235ecbf6f15c6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 2, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 373, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "PC"], "developers": ["GameCoaster", "Brian De La Franier"], "genres": ["RPG", "Strategy"], "publishers": ["Tavarin Games"], "esrb_rating": "Teen"}