{"id": 22272, "slug": "hello-inc-vr", "name": "Hello inc VR", "name_original": "Hello inc VR", "description": "[HellO, Inc.]<br/>VRAD GAMES<br/><br/>Story<br/>From your friend, HellO, Inc.<br/>We are currently hiring security agents who would protect corporate building in Neo-Kyoto.<br/>Applicants will be given effective weapons and gears which would let the applicants protect the building from vicious monsters and blend into Neo-Kyoto perfectly.<br/>Please call 090-hello-inc, or vote “YES” on STEAM GREENLIGHT.<br/>Thank you! <br/><br/>Game<br/>[Hello, Inc.] is a casual, action, shooting, throwing, defense VR game. <br/>Players have to stop flooding 40+kinds of monsters before they reaches the [HellO, Inc.] building. <br/>Instead of shooting throwing stars to enemies with left clicks,<br/>now players can actually THROW throwing stars in VR!<br/>Blow hordes of monsters up into air with explosion charm,<br/>Freeze, strike lightening, even stop the time with secret ninjutsu!<br/>Defeat giants Kaizu before they breach into the building<br/>And find out secrets about mysterious HellO Incorporate.<br/><br/>Features<br/>Require HMD and hand motion controller<br/>Support HTC Vive (Oculus Rift Support coming up)<br/>Single Player – infinite challenge mode is currently available<br/>Single Player – Campaign mode is under development.<br/>Multil Player – Co-op will be available within early access period", "metacritic": null, "released": "2017-04-13", "tba": false, "updated": "2019-08-28T22:07:39", "background_image": "https://media.rawg.io/media/screenshots/ff2/ff2bb53301b547c27dccba431483a0b0.jpg", "website": "https://www.facebook.com/HellO-Inc-VR-1936789949877198/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 301, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["VRAD"], "genres": ["Action", "Casual", "Indie"], "publishers": ["VRAD"], "esrb_rating": null}