{"id": 22281, "slug": "laser-strikers", "name": "LASER STRIKERS", "name_original": "LASER STRIKERS", "description": "<strong>\"FAST, HECTIC AND TACTICAL” THIS IS LASER STRIKERS!</strong><br/><br/>Compete with your friends or against the IA in this vertiginous 2 vs 2 local cooperative game by scoring goals with the Striker or guarding the goal with the Defender. <br/><br/>Welcome to a sport where what matters are reflex responses. Assume one of the roles, Defender or Striker, and team up with your allies to carry out your great tactics.<br/><br/>The shared PowerUps system for each team allows each PowerUp collected by the Striker to be activated by the Defender at a precise time. Communication is vital so do not Waste’Em.<br/><br/><br/><br/><ul><li>Local Cooperative Game (1-4 players)<br/></li><li>Up to 4 players, compete with each other or against the IA<br/></li><li>2 Different Player Roles: Defender and Striker, each with unique abilities<br/></li><li>Compatible with Kinect for Windows in an exclusive mode of up to 4 players<br/></li><li>PowerUps shared by the teams. Use them to boost your teammates! <br/></li><li>Wide Variety of fields with increasing difficulty made to test your reflexes!<br/></li><li>Full Controller Support for most Dual Shock controllers<br/><br/><br/><br/>The Defender:<br/></li><li>The Defender is all power, its blockage skills are in charge of preventing the ball from reaching the goal area.<br/>He is responsible for launching the Power Ups and with its unique ability, the Defender is able to catch and redirect the ball with a super powerful shot.<br/><br/><br/>The Striker:<br/></li><li>The Striker patrols the Playfields furiously, leaving a trail behind as it charges energy, allowing the Striker to create a barrier and generate waves of force to push the ball against the opponent.<br/>He is the one collecting the PowerUps for the team while trying to take down the Striker from the rival team.<br/><br/><br/></li></ul>", "metacritic": null, "released": "2017-04-17", "tba": false, "updated": "2019-08-28T22:07:38", "background_image": "https://media.rawg.io/media/screenshots/209/209842a6a4ec40494daae5229abcb767.jpg", "website": "http://kothstudio.com/laser-strikers", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 18}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 163, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Koth Studo"], "genres": ["Strategy", "Sports", "Casual", "Indie"], "publishers": ["Koth Studio"], "esrb_rating": null}