{"id": 222923, "slug": "vector-full", "name": "Vector Full", "name_original": "Vector Full", "description": "Vector is an exciting, arcade-style game featuring you as the exceptional free runner who won’t be held down by the system. The game opens with a view into a totalitarian world where freedom and individually is nothing more than a distant dream. But the heart of a freerunner is strong, and you soon break free. Run, vault, slide and climb using extraordinary techniques based on the urban ninja sport of Parkour all while being chased by “Big Brother” who’s sole purpose is to capture you and bring you back.<br/><br/>Inspired by the practice and principles of Parkour, Vector’s intuitive controls please players of all levels, and sophisticated level designs challenge the most demanding players with fast-paced timing puzzles as the traceur “flows” over the dystopian rooftops.<br/><br/>Game Features:<br/><br/>- Arcade gameplay from the makers of the hit Facebook game<br/>- Astoundingly lifelike Parkour-inspired moves made possible by Cascadeur animation tools<br/>- 40+ challenging levels<br/>- Quick to learn, challenging to master<br/><br/>The best parkour-inspired action game! Vector lets you break free and run! Don’t get caught!<br/><br/>The Press Loves Vector:<br/><br/>“The way Vector mimics the movements of real-life parkour practitioners is quite impressive... I can’t wait to be entrapped in Vector’s promising mix of direction and magnitude.” (appadvice.com)<br/><br/> “Vector is thrilling, rich in variety and it reminds us of Stick Run, but offers much more elaborate animations.” (fbgamer.de)<br/><br/>\"The only cool way to run from all your problems.\" (Gamezebo.com)<br/><br/> “The game looks smashing … ” (idroidplay.com)", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-30T18:36:08", "background_image": "https://media.rawg.io/media/screenshots/533/533450dc5942ef3dc3c1f9cff2af3126.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 121, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["NEKKI"], "genres": ["Arcade"], "publishers": [], "esrb_rating": "Everyone 10+"}