{"id": 222966, "slug": "dragon-land-2", "name": "﻿Dragon Land", "name_original": "﻿Dragon Land", "description": "Social Point welcomes you to Dragon Land, the brand new 3D platform game that’s packed with stunning levels, arcade action and awesome dragons! Expand your dragon collection and set off on the adventure of a lifetime!<br/> <br/>Jump, dash, climb and glide your way through every episode. Unlock new dragons and learn different skills!<br/> <br/>When a mysterious evil appears, it’s up to the plucky dragon Blaze to save his friends and return peace to the world. Inspired by classic games, Dragon Land is a thrilling and fun platformer for everyone!<br/> <br/>DRAGON LAND FEATURES:<br/> <br/>3D Platformer Campaign<br/>- Jump through over 100 levels full of rewards and secret items!<br/>- 3D graphics and gameplay, just like your favorite oldschool games!<br/>- Secret levels: find keys to unlock these extra-tough, extra-rewarding areas.<br/>- Multiplayer challenges where you race against friends in real time to climb the rankings!<br/> <br/>Dragon Collection &amp; Upgrades<br/>- Collect dozens of unique dragons, each with their own special skill!<br/>- Dragons get even more impressive when you level them up!<br/>- Customize dragons with unique skins.<br/> <br/>Challenge Levels in Quick Play<br/>- One hit, infinite levels. How far you can get?<br/>- Beat your friends’ scores in this challenging mode!<br/> <br/>Stay tuned for regular updates. New levels and features added constantly!<br/> <br/>Adventure and action awaits in Dragon Land, the episode based 3D platformer from Social Point! Take control of Blaze and save the dragons!<br/> <br/>Download Dragon Land and enter the world of dragons today!<br/> <br/>Are you enjoying the game? We’d like to know! Leave us a nice review sharing your thoughts!<br/> <br/>Having an issue? Go to Menu &gt; Support, we’ll try to help you the best way we can!<br/>Dragon Land is FREE to download and FREE to play. However, you can purchase in-app items with real money. If you wish to disable this feature, please turn off the in-app purchases in your phone or tablet’s Settings.", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-31T01:39:24", "background_image": "https://media.rawg.io/media/screenshots/854/8543a020509ffcb849248df0ad6d55e0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 193, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Social Point"], "genres": ["Adventure"], "publishers": [], "esrb_rating": "Everyone"}