{"id": 2229, "slug": "carmageddon-max-damage", "name": "Carmageddon: Max Damage", "name_original": "Carmageddon: Max Damage", "description": "Play an adrenaline pumping bunch of game modes against AI opponents, or online against the rest of the Carmafan masses! Progress your Career through the Carma ranks or have a MultiPlayer romp in a Car Crusher, Fox &#39;n&#39; Hounds (always been Stainless MP game session favourite!), Death Race or Checkpoint Stampede event - all frenetic fun, featuring Carmageddon’s trademark over-the-top violence, crazy PowerUps and non-stop laughs…<br />\nPLUS! You can relive all the mangling mayhem with the built-in Action Replay System. Featuring multiple choice of cameras and replay options – it’ll mean you never miss a pile-up again! Get your movies online and brag about your ped culling achievements. And there will be plenty of THOSE too – Achievements, Challenges and Collectables to hunt down, that’ll keep the whole family entertained for hour upon happy blood and oil splattered hour.<br />\nThe game features:<br />\nSingle Player Career mode<br />\nFreeplay mode<br />\nOnline &amp; Offline Multiplayer mode<br />\nCarMODgeddon mods mode<br />\nThe Car Is The Star! Carmageddon: Max Damage features a wide and varied range of cool, crazy, custom killing machines; each with its own highly distinctive “character”. Carmageddon cars are specifically built for the job in hand – wrecking opponents and killing peds! Nearly 20 years ago the original Carmageddon invented the whole concept of videogame physics and real-time damaging of cars and scenery, and so it’s obviously been our responsibility to bring this technology BANG up-to-date with a brand new state of the art car damage (and repair) system. Crush, bend, twist, and completely mangle your opponents’ and your own car – smash parts off, or split it in two; the original game was all about wrecking motors and pummelling pedestrians, and today we take this to a whole new level!  Power, Armour, and Offensive upgrades are available for your car, along with other customising options, allowing you to personalise the killing capabilities of your rides.<br />\nA host of old favourites from the original Carmageddon make a comeback, along with some all-new faces. Only ever seen before as low resolution mugshots, now you get to see them from head to toe (well, head to knees in the case of Screwie) in full HD 3D glory – usually as they smash through their windscreen and hurtle past (or INTO) yours!<br />\nThe new environments are amalgamations of the best bits from the numerous chunks of landscape that we all loved to tear around in Carmageddon. “Bleak City”, &quot;Devil&#39;s Canyon&quot;, “Dusty Trails”, “MagNuChem” and &quot;Snowy&quot; levels all return in updated forms, with their memorable landmark features such as the Loop ’de’ Loop, acid pits and Football Stadium. Everything is reassuringly surreal; hell, we’ve even managed to incorporate a giant food mixer into a level!<br />\nThe topography and detail in the locations is updated and enhanced, with even more fun stuff to smash into, smash up, snap off, and send careening into the poor pedestrian population. “Nice Shot Sir!” And talking of pedestrians…<br />\nOnce again, the game features a varied mix of adult pedestrians of all ages, shapes, persuasions and species. Classic pedestrians are back, such as old lady on a Zimmer frame and old man with his stick, with their famous cry “I was in the war!”, plus bikini babes and swimming trunk hunks, fat bastards, and herds of cows in improbable locations. Joining them are some new faces – including cyclists, wheelchair users and peds on mobility scooters. Carmageddon is an equal opportunities ped slaughterfest!<br />\nPowerUps are back and this time they’re even funnier, surrealier, hurtier, and messier than ever! Lots of the classic PUps return in super-enhanced form, such as Repulsificators, Kangaroos &amp; Solid Granites. Then we have all new PUps like &quot;Pelvic Thrust&quot; and a variety under the heading “Tossers”! Combine PUps to create hilarious combo results like Groovin’ Helium Filled Peds, or Peds without legs at a Temporary Rapture!<br />\nLeaderboards. Challenge yourself to reach the top of the leaderboard using skill or brute force!<br />\nAchievements. A suitably warped array of mad Feats and Exploits will garner you the rewards that every gamer dreams of.<br />\nChallenges: Do the most stupid things, collect meaningless trinkets and waste hours of your life in the pursuit of ultimately pointless goals!<br />\nSmelly Bushes: We’ve hidden a variety of these specially fragrant Easter Eggs throughout the game to keep you busy and entertained!<br />\nCarMODgeddon: The whole game is MODdable for your MODding pleasure!<br />\nCheck out the official Carmageddon comic series! Click on the image!<br />\nFancy a FAQ? Check out the known issues here: Go here!</p>", "metacritic": 52, "released": "2016-07-05", "tba": false, "updated": "2024-04-06T12:00:57", "background_image": "https://media.rawg.io/media/screenshots/f59/f5987f61320786a8a41203c3905a5435.jpg", "website": "http://www.carmageddonmaxdamage.com/", "rating": 3.43, "rating_top": 4, "added_by_status": {"yet": 34, "owned": 861, "beaten": 24, "toplay": 15, "dropped": 48, "playing": 4}, "playtime": 3, "achievements_count": 153, "ratings_count": 104, "suggestions_count": 520, "game_series_count": 4, "reviews_count": 105, "platforms": ["PlayStation 4", "PC", "Xbox One"], "developers": ["Stainless Games"], "genres": ["Action", "Racing"], "publishers": ["Stainless Games"], "esrb_rating": "Mature"}