{"id": 222992, "slug": "disco-bees-new-match-3-game", "name": "Disco Bees - New Match 3 Game", "name_original": "Disco Bees - New Match 3 Game", "description": "As unique as it is funny and punny - this is the game for you! Get down with the newest match-3 puzzle sensation!<br/><br/>Disco Bees is the fun and exciting new way to play match-3 puzzle games. Switch and match the colorful bees in “the hive”, our unique honeycomb shaped board. Unlock wild new locations and puzzles to test your skills!<br/><br/>Disco Bees features:<br/>- Never-ending fun - play dozens of unique and innovative puzzles<br/>- Recruit “superbees” like the Ninja Bee to help you hit new high scores and surpass your friends<br/>- Fly through dozens of colorful and crazy levels. Yes, bees do live in space!<br/>- Fun and easy to learn, but an entertaining challenge to master.<br/>- Connect with Facebook and match up with your friends on our leaderboards <br/>- Parents, grandparents and everyone in between loves to play!<br/>- Never get bored – we’re adding new levels and fun all the time!<br/>- Bees in outer space doing the Waggle Dance? You know you need to join in!<br/>- Awesome original disco music brought to you by Andy Ross of the band OK Go.<br/><br/>\"Spectacular visual and aural features, with an amazing original disco soundtrack!\" - Cult of Mac Review<br/><br/>Warning: You will BEE inundated with un-matched BEEautiful, BEEwitching bee puns. If you’re afraid of laughing and having too much fun then this is not the game for you!<br/><br/>A big “thank you” to all the dedicated Disco Bees fans!<br/><br/>Want to join the friendly Disco Bees community? Like us on Facebook:<br/><br/>https://www.facebook.com/discobees<br/><br/>Disco Bees is the newest game from developer SpaceInch, which, in collaboration with the band OK Go, created Say the Same Thing, and the hit game Make it Rain.<br/><br/>Note: Disco Bees is free to play but does offer in-app purchases of various kinds. You can disable in-app purchases by going to the Google Play app on your device, tapping the Menu button, selecting Settings &gt; Use password to restrict purchases.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:02:29", "background_image": "https://media.rawg.io/media/screenshots/cd9/cd9f7d8ba03d6c07ad33dc5b18e2f405.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 84, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Scopely"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}