{"id": 22302, "slug": "link-twin", "name": "Link Twin", "name_original": "Link Twin", "description": "Link Twin is an exciting and stylistic puzzle game with fresh mechanics, visually stunning art and a haunting soundtrack. Take control of the mysterious Tom and Lily who share an unbreakable connection. Uncover a treacherous world of mysterious landscapes and mind-bending puzzles as you navigate ever increasing challenges. <br/>\n<br/>\r\nDISCOVER AN INNOVATIVE PUZZLE CONCEPT<br/>\n<br/>\r\nTom and Lily are linked and move together. Use the environment and interactive objects to manipulate positioning and find the exits!<br/>\n<br/>\r\n========<br/>\n<br/>\r\n“Link Twin is a puzzler that really makes you think. Simultaneously moving Tom &amp; Lily, you’ve got to plan out your path to victory very carefully.” - Pocket Gamer<br/>\r\n “It’s the kind of addictive puzzle game you could easily get stuck in for hours.” - Android Headlines<br/>\r\n“Link Twin is definitely a game specifically designed for puzzle enthusiasts and handled with deft care. It’s a game I’d highly recommend.” - The Huh?<br/>\n<br/>\r\n========<br/>\n<br/>\r\nTONS OF LEVELS AND CHALLENGES TO MASTER<br/>\n<br/>\r\n-\tEnjoy over 100 levels of increasingly challenging puzzle gameplay<br/>\n<br/>\r\n-\tEngage with over 10 unique mechanics like movable obstacles, teleporters and electronic circuits<br/>\n<br/>\r\n-\tExplore 5 mysterious settings, each with their own haunting soundtrack<br/>\n<br/>\r\n-\tImmerse yourself in a whole new world of minimalistic art and surreal environments", "metacritic": null, "released": "2017-01-27", "tba": false, "updated": "2020-02-14T02:14:28", "background_image": "https://media.rawg.io/media/screenshots/9b8/9b8082b093ce10f7fcd98830f3840fe9.jpg", "website": "http://www.link-twin.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 25, "beaten": 1}, "playtime": 4, "achievements_count": 11, "ratings_count": 1, "suggestions_count": 50, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "iOS"], "developers": ["Lorraine Studio", "Carbon Incubator"], "genres": ["Strategy", "Casual", "Indie", "Puzzle"], "publishers": ["Carbon Incubator"], "esrb_rating": null}