{"id": 223041, "slug": "indian-metro-train-simulator", "name": "Indian Metro Train Simulator", "name_original": "Indian Metro Train Simulator", "description": "Indian Metro Train Simulator the highly anticipated and Most awaited Indian trains game from Timuz, the creator of smash hit \"Train Simulator 2016\"<br/><br/>Indian Metro Train Simulator brings you the most realistic rail driving experience on Indian railroads. It has a proper game play with realistic physics, lots of local metro engines to choose, drop and pickup passengers from one station to another. <br/><br/>Be a real trains driver and drive through the major cities of India; Kashmir , Rajasthan, Gujarat, Madhya Pradesh, Bihar , Kolkata , Raipur ,Telangana , Karnataka , Kerala. It is a challenging task to drive trains in India, it gives you more excitement and trill when you are driving real trains simulator. Make driving a fun part by covering various states and cities throughout India. <br/><br/>We let you drive through the detailed India routes with bridges, advertisement boards and food kiosks. You will be entirely dependent on the signals and track changers. Be alert and fast to choose the right path for your rail. Blow the horn to gain XP and avoid all rail accidents or your game will be over. Make sure you stop before you enter the danger zone and safely park in the railway station.<br/><br/>Game Features : <br/>- Free to Play!<br/>- HD 3D Graphics, <br/>- Various Came Angles<br/>- Realistic Physics<br/>- In Game Sounds<br/>- Responsive Controls<br/>- Many engines to upgrade<br/>- 100+ levels of challening fun<br/>- Addictive game-play with lots of fun.<br/>- Huge open India Map.<br/><br/>Install \"Indian Metro Train Simulator\" Now, you are waiting for an incredible train driving adventure.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:02:25", "background_image": "https://media.rawg.io/media/screenshots/4ea/4ead1a430c0f777b84b60aece61bf89c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 206, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Timuz Games", "GT Action Games"], "genres": ["Simulation", "Arcade"], "publishers": [], "esrb_rating": null}