{"id": 223154, "slug": "medieval-warsstrategytactics", "name": "Medieval Wars:Strategy&Tactics", "name_original": "Medieval Wars:Strategy&Tactics", "description": "Strategists! A huge update of Medieval Wars is here!<br/><br/>A free campaign ‘In Praise of Odin!’ consists of 9 missions, in which you will take part in the Vikings’ bloody wars in Scandinavia and Mainland Europe. <br/><br/>• You will be able to capture Paris, invade England and Southern Italy. <br/>• With the great Rollo you will found the Normandy dukedom. <br/>• In Oleg the Prophet’s campaign you will gain Kiev. <br/><br/><br/>For those who think that’s not enough, we have also prepared 4 new historical scenarios. <br/><br/>• In the bloody ‘Battle of Brávellir’ you will defeat the legendary Harald Wartooth, the King of Danes and Swedes. <br/>• In a huge scenario called ‘Vikings' Wars’ you will be able to keep half of Europe in fear and make them look to the seas in terror. <br/>• Playing as Harald Fairhair in the ‘Unification of Norway’ you will set the Norse crown atop your head. <br/>• As Cnut the Great you will win the war against Norway and Sweden and establish power over these lands.<br/><br/><br/><br/>Medieval Wars: Strategy &amp; Tactics<br/><br/>The history of medieval Europe is rich in bloody wars and conflicts. The Norman invasion, the Crusades, the Hundred Years' War, the Reconquista, the Wars of the Roses, the Albigensian Crusade and endless peasant riots… A new game in the Strategy &amp; Tactics series gives you an opportunity to try your strength in confrontations between the most ruthless conquerors. This is turn based grand strategy historical war game. Crusaders and Kings. Great medieval battles, total wars, Atilla, Napoleon and Rome empire.<br/><br/><br/>In Medieval Wars: Strategy &amp; Tactics you are to lead the armies of England and France as well as the armies of crusaders in three campaigns and try to win the biggest wars and battles of European medieval history. Scenario maps will let you take part in Russian feuds, stop the Saracens under the flag of Charles the Great and lead The Hussites.<br/>After winning all the fascinating battles of Campaign and Scenario mode, try Hotseat multiplayer mode.<br/>Medieval Wars: Strategy &amp; Tactics: It’s time to march off!<br/><br/><br/><br/>• 4 historical campaigns, with 25 missions in total<br/>• 11 independent historical scenarios<br/>• Several Skirmish mode maps<br/>• 21 types of units <br/>• Multiplayer mode Hotseat<br/>• Turn-based battles, economic and military research<br/><br/><br/>The following content is available in free version:<br/>- 3 missions of England campaign;<br/>- full viking campaign In Praise of Odin!;<br/>- One Hotseat mode map with fixed game settings;<br/>- 3 historical game scenario;<br/><br/><br/>The following content is available in premium version:<br/>- Complete England, Vikings, France and Crusaders campaigns with 25 historical missions in total;<br/>- Uploading of new campaigns available in future update;<br/>- Multiple Skirmish mode maps with various customisable game settings;<br/>- Uploading of new Skirmish mode maps available in future update;<br/>- 11 unique game scenarios available;<br/>- Uploading of additional game scenarios available in future update;<br/>- Several Hotseat multiplayer mode maps with various customisable game settings;<br/><br/><br/>\"A sharp and elegant turn-based strategy game, Medieval Wars leaves you with the best of medieval times and leaves out the boring bits.\" - hardcoredroid.com<br/><br/>_____________________________________<br/><br/>If you wish to play Medieval Wars S&amp;T without any ads or IAPs, just check out this special premium version of the game here:<br/>Medieval Wars S&amp;T Premium on Google Play<br/>_____________________________________<br/><br/>FOLLOW US: @Herocraft <br/>WATCH US: youtube.com/herocraft <br/>LIKE US: facebook.com/herocraft.games <br/><br/>(C) HEROCRAFT, 2013<br/>", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:02:12", "background_image": "https://media.rawg.io/media/screenshots/044/044c9918a6a782d37d512308cf8cf0df.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 189, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["HeroCraft"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}