{"id": 223174, "slug": "gingerbread-wars", "name": "Gingerbread Wars 🎄", "name_original": "Gingerbread Wars 🎄", "description": "Sugar... spice... and everything nice! Then just add a little bit of ginger and voilà! These are the ingredients needed to create perfect (and yummy!) little Gingerbread Men! Santa Claus loves them - the spirit of Christmas shall not fade!<br/><br/>But one day, when cooking a delicious batch of chocolate-flavored gingerbread, the baker accidentally added an extra ingredient to the concotion - the nightmare of every Xmas candy: Rum Raisin! Thus the evil chocolate-flavored rum raisin gingerbread men were born! (Willy Wonka would be so ashamed...) <br/><br/>Now, using their ultra super powerpuff candy-launching cannon, the sweet vanilla gingerbread men must fight the forces of evil and clear all rum raisin from the candy world once and for all! Run for your lives!<br/><br/>Are you up for the challenge? It is time for the sugar war! Don't let the grimm gingerbread win, brothers!<br/><br/>Choose the size of your cannonball (or should we say Gumball?!?)... <br/>... then load you cannon with the sweetest candy of them all... <br/>... and shoot to blow the evil Rum Raisin Gingerbread Men to dozens of pieces!!! <br/><br/>The Gingerbread Wars have started. Sargent Charlie and lieutenant Ralph, the scout cookie men, are inviting everyone - girls and boys, kids and adults, children and ancient - to wreck every evil peanut butter cookie that tastes bad in the factory of dreams in this Xmas night! Commander Shrek and Santa Claus will be leading the assaults!<br/><br/>May the super pony unicorn cookie knight be with us!<br/><br/>-----<br/><br/>Join our army of Facebook and Twitter followers and help us fix the factory in candy world and have a Merry Christmas<br/>https://www.facebook.com/mgaiastudio<br/>https://www.twitter.com/mgaiastudio", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:02:08", "background_image": "https://media.rawg.io/media/screenshots/cb4/cb4a7817f43091eeccaf8da9ac78e633.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 224, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Mgaia Studio"], "genres": ["Casual"], "publishers": [], "esrb_rating": null}