{"id": 2231, "slug": "the-war-of-eustrath-hd", "name": "The War of Eustrath HD", "name_original": "The War of Eustrath HD", "description": "*** Price Down! <br/>June 2011 is the first anniversary of iQubi&amp;#39;s App-Store Debut! Also, thank you very much to our friends, we have been selected as one of the World&amp;#39;s Most Successful Game Studios in 2011 edition of develop 100! (http://www.develop100.com)<br/>Celebrating those, and hoping that more friends enjoy our game, we are dropping the prices of our game!<br/><br/>The War of Eustrath is a Strategic/Tactical RPG.<br/>You control various units -called &amp;#39;GEAR&amp;#39;s- and characters with unique abilities in semi-real time battles.<br/>Enjoy battles and tales of knights with mysterious power in the world of Eustrath.<br/>The results of battles and choices YOU make in the story affect the story and even the ending of this game.<br/>Join the group of brave young soldiers. And see how the war ends with your own eyes.<br/><br/>Background<br/><br/>The stage of this game is the world called &amp;quot;Eustrath&amp;quot;. Even though it has advanced technologies it differs from Earth by the existence of Elementals. Like magic in a typical fantasy world, the power of Elementals is accepted and utilized in everyday life. One of them are fighting machines called &amp;quot;Elemental GEARs&amp;quot;. And there are also fighting machines called &amp;quot;Mechanical GEARs&amp;quot; whose power comes from the pure mechanical energy not elemental energy. These GEARs (both Elemental and Mechanical) are natural element of Eustrath. People accept them as part of their life and mainly utilize them for warfares.<br/><br/>Throughout the history of &amp;quot;Eustrath&amp;quot;, there were three great wars recorded. This game is an attempt to revive one of those wars. The heroine of the game is a country girl &amp;quot;Tiana&amp;quot;. You can control her and her companions to build the history of Eustrath. <br/><br/>Features<br/><br/>- Over 50 campaign stages are playable with several endings including a special one.<br/>- More than 20 unique characters and over 40 units.<br/>- Special abilities make battles more fun to play.<br/>- Upgrade GEARs using various items.<br/>- Intuitive User Interface.<br/>- Many awesome illustrations in game.<br/>- Highly detailed graphics.", "metacritic": null, "released": "2010-06-04", "tba": false, "updated": "2019-10-22T14:28:01", "background_image": "https://media.rawg.io/media/screenshots/412/412dca777a021c9d284d333d6e88ef86.jpeg", "website": "http://eustrath.iqubi.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 230, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["iQubi"], "genres": ["RPG", "Strategy"], "publishers": ["iQubi"], "esrb_rating": "Teen"}