{"id": 223171, "slug": "crazy-eights-free-card-game", "name": "Crazy Eights free card game", "name_original": "Crazy Eights free card game", "description": "Download the Crazy Eights card game app from LITE Games now for free and start playing right away. Completely in English and perfect for on the go!<br/><br/>With its many variations, Crazy Eights is without doubt the world’s most popular card game. To win you’ll need the right strategy and a good hand – every game is different, so Crazy Eights offers unlimited fun!<br/><br/>The basic rules are simple and easy to learn. As many different variations of the game are played, lots of rules can be changed in the LITE Games version: number of cards, change of direction, jokers, drawing cards and many more...! <br/><br/>Features:<br/><br/>• Completely free to play and in English!<br/>• Optimized for smartphones &amp; tablets<br/>• Easy to understand with customizable rules<br/>• Suitable for newcomers and pros alike<br/>• Play against up to 4 opponents<br/><br/>Crazy Eights for Android is offered in the following languages with high quality localization: English, German, French, Italian, Japanese, Korean, Dutch, Polish, Spanish, Portuguese, Turkish and Russian. <br/><br/>By downloading this game, you are agreeing to our Terms and Conditions (http://www.lite.games/agb/). By downloading this game you explicitly agree to the app collecting and transferring Personally Identifiable Information that might contain device-IDs and/or location data (http//pii.lite.games). An internet connection is required to enjoy this app fully. <br/><br/>Last but not least, we would like to thank all our players! We hope you enjoy the game.<br/><br/>Need help? – We’re here for you:<br/><br/>https://www.lite.games/support/<br/>support@lite.games<br/><br/>Visit us here for more free Android games:<br/><br/>http://www.lite.games<br/>https://www.facebook.com/LiteGames<br/><br/>Thank you for playing!", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:02:09", "background_image": "https://media.rawg.io/media/screenshots/255/25569d9426868462a5a9a55ec159bd2a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 172, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["LITE Games"], "genres": ["Card"], "publishers": [], "esrb_rating": null}