{"id": 223161, "slug": "rummy-free-card-game", "name": "Rummy - free card game", "name_original": "Rummy - free card game", "description": "Rummy Free Card Game by LITE Games – one of the most popular mobile card games worldwide finally comes to Android!<br/><br/>The game is also well-known in other countries around the world, for example as Remi (Turkish), Romme (German) and Rami (French). <br/><br/>Rummy features an excellent design and an intuitive interface. The most common rules are set by default but can be customised with numerous options. Download our free Ramino app and finally play without need for a partner: Rummy by LITE Games lets you play whenever and wherever you want.<br/><br/>Features:<br/><br/>♤ You can play for 🆓<br/>♤ Up to three challenging opponents<br/>♤ Customizable difficulty<br/>♤ Unlock great achievements 🏆<br/>♤ Playable in portrait and landscape mode<br/><br/>Popular game is available in high-quality localizations for the following languages: English, German, French, Italian, Spanish, Dutch, and Polish.<br/><br/>LITE Games is trying to reproduce the classic game experience as extensively and realistically as possible on mobile devices. The app is not aimed at children, but is designed for adults. The game does not offer real-money gambling: no money or real prizes can be won. Practice and/or success at social casino games does not imply future success at real-money gambling. <br/><br/>An internet connection is required to enjoy the app fully. <br/><br/>The game can be played completely free of charge. However, some optional in-game purchases (for example, ad-free time) are subject to charge. You can also deactivate the payment function completely by disabling in-app purchases in your device’s settings.<br/><br/>Have you ever played Remi, Romme, Rami and Ramino? If you love card games, that game is for you. Your points get counted automatically and the rules are easy to learn. Have a seat at our virtual table and play now for free!<br/><br/>By downloading this game, you are agreeing to our Terms and Conditions (http://www.lite.games/agb/). By downloading this game you explicitly agree to the app collecting and transferring Personally Identifiable Information that might contain device-IDs and/or location data (http//pii.lite.games).<br/><br/>Last but not least, we would like to thank all of our players! We hope you have fun playing this app.<br/><br/>Visit us for more free Android games:<br/><br/>http://www.lite.games<br/>https://www.facebook.com/LiteGames<br/><br/>Do you have any questions? We are here to help - please contact:<br/>support@lite.games<br/><br/>Thanks for playing!", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-31T02:02:37", "background_image": "https://media.rawg.io/media/screenshots/9d6/9d66c58a7fc74d01d4598989e83ce0bd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 271, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["LITE Games"], "genres": ["Card"], "publishers": [], "esrb_rating": "Teen"}