{"id": 223175, "slug": "virtual-families-2", "name": "Virtual Families 2", "name_original": "Virtual Families 2", "description": "The sequel to the smash hit mobile game “Virtual Families” is here!<br/><br/>ADOPT YOUR FAMILY TODAY!<br/><br/>Adopt a little person from the thousands living inside your mobile device!  In this life simulation game, help them choose a husband or wife and start their virtual family!  Make babies and pass the house on to the kids!  Adopt all kinds of cute pets for your kids to play with - cats, dogs, and more!  Help nurture and guide generations, managing your own beautiful family story.<br/><br/> DESIGN YOUR DREAM HOME<br/><br/>Expand and renovate your virtual house.  Your adoptee’s new home has a lot of potential, but they need your help to fix it up!  Imagine your dream home and make it a reality.  Add bedrooms, a baby nursery, a home theater, or even a game room!  Collect decorations to customize and design each room.<br/><br/>MAKE A HAPPY, PROSPEROUS LIFE <br/><br/> Train your little people from babies to adulthood to take care of their home and make the best choices in life.  Encourage them to work on their career and earn money for decorations, necessities, and luxuries.  Upgrade your virtual family to be the best versions of themselves. Your little people will send you messages, thanking, pleading, and praising you for caring for them.  Don’t forget to check in on them, because they miss you and become very sad!<br/><br/>LIFE SIMULATION RUNS IN REAL TIME!<br/><br/> Your little family continues to live, eat, grow, and work when the app is switched off.  Along the way, there will be many different random events to respond to, all of them adding surprise to this simulation game and unexpected elements to routine, daily virtual life.  Find highly varied, unpredictable game play. No two games run the same; the story unfolds differently for everyone who plays it.  This simulation game is designed to have a life of its own!", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-30T22:04:07", "background_image": "https://media.rawg.io/media/screenshots/e02/e02a98d283d31cbc83b4de6a32e64514.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 167, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Last Day of Work"], "genres": ["Casual"], "publishers": [], "esrb_rating": "Everyone"}