{"id": 223182, "slug": "gibbets-2-arcade-puzzle", "name": "Gibbets 2: Arcade Puzzle", "name_original": "Gibbets 2: Arcade Puzzle", "description": "Tired of always losing at Hangman?  <br/><br/>This is casual action arcade puzzle game based on physics with shooting, bows, arrows, ropes and archers.  <br/><br/>Now it's time to get your own back on that noose-wielding bully! <br/>Gibbets 2, the sequel to the Flash smash hit, gives you chance to save the poor victims before they run out of breath!  <br/><br/>A truly innovative arcade puzzler where you'll have to aim your bow and arrow carefully to cut the hangman's rope without causing the victims further injury!  Use all manner of bonuses and pick ups, warps and teleports, to help you on your quest. You'll gain bonus points for rescuing multiple people with one arrow so try and gain the perfect score on each level. Accumulate even more points with the vulture blasting bonus round, then upload your high scores to challenge your friends! <br/><br/>Can you the handle the frantic pace and save the innocent before they take their final breath?<br/><br/><br/>• Draw back your bow in this truly unique game of skill.<br/>• Save the innocent people from hanging in over 50 challenging levels. <br/>• Master the use of portals and pick ups across the colourful detailed landscapes.<br/>• Unlock awards and achievements for your expert bowmanship<br/>• The sequel to the million selling hit on various platforms.<br/>_____________________________________<br/><br/>FOLLOW US: @Herocraft <br/>WATCH US: youtube.com/herocraft <br/>LIKE US: facebook.com/herocraft.games", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:02:05", "background_image": "https://media.rawg.io/media/screenshots/a81/a81cd3c492a39254f7a5c8fe35ed98a6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 98, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["HeroCraft"], "genres": ["Arcade"], "publishers": [], "esrb_rating": null}