{"id": 223173, "slug": "tempest-pirate-action-rpg-premium", "name": "Tempest: Pirate Action RPG Premium", "name_original": "Tempest: Pirate Action RPG Premium", "description": "The Jolly Roger is waving over your ship, Captain! An adventure RPG that won the hearts of over 100.000 players is now on your mobile! Become a daring pirate, prowl the seas on a battleship armed to the teeth, trade, and assemble your crew from the best cutthroats, defeating other pirates and legendary monsters such as the Kraken, the Leviathan, and others still unknown to science in naval warfare! You will need a massive arsenal: cannons, mortars, flame throwers, and a lot of other various rigging. But you will only earn the most devastating sea artifacts for completing difficult and interesting multilevel quests.<br/><br/>May the enemy tremble at the very sight of your flag rising over the horizon, reckless Captain!<br/><br/>OPEN WORLD<br/>Endless travels over the boundless seas, full of adventures and mysteries.<br/><br/>FASCINATING STORY<br/>Over a hundred quests on dozens of islands in three regions.<br/><br/>PLAY WITH FRIENDS<br/>Share the huge world of Tempest with two friends: fight a war with each other, or become companions.<br/><br/>NAUTICAL WONDER<br/>Buy ships, upgrade ships, and decorate ships.<br/><br/>PIRACY WITH A BIT OF TRADE<br/>To buy cheaper and to sell dearer is not a pirate's path. Rob galleons, sink warships, and destroy forts!<br/><br/>SEA MONSTERS<br/>The Kraken has brought its sea friends!<br/><br/>NOT ONLY CANNONS<br/>Use mystic crystals to deflect enemy cannonballs, bring meteors down on enemies, or summon a giant octopus.<br/><br/>ASSEMBLE A CREW OF CUTTHROATS<br/>Upgrade your pirates from green hands to salted sea wolves.<br/><br/>_____________________________________<br/><br/>FOLLOW US: twitter.com/Herocraft<br/>WATCH US: youtube.com/herocraft<br/>LIKE US: facebook.com/herocraft.games", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:02:09", "background_image": "https://media.rawg.io/media/screenshots/543/54321e56b03eca4705af4c8508d4ab8f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 440, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["HeroCraft"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}