{"id": 223180, "slug": "mills-play-for-free", "name": "Mills – play for free", "name_original": "Mills – play for free", "description": "The Mills board game by LITE Games: play the popular game Mill with online multiplayer options for free on Android devices. <br/><br/>Mills is a hugely popular game throughout the world, characterized by the fact it is so easy to learn – and it’s even older than chess. Nowadays the game that's also well known as Nine Men's Morris, The Mill Game, Daadi, Navakankari, or Cowboy Checkers is a national pastime in many countries. <br/><br/>The aim of the game is to hit as many enemy stones as possible by forming so-called Mills (3 stones in a row). However, you can also block your opponent by cleverly moving your own stones around, rendering them unable to make a move.<br/><br/>If you think that you're a master of strategy: try to win against the strongest players of the LITE Games community. 😉<br/><br/>Features<br/><br/>◎ Completely free and in English 🇺🇸 🇬🇧<br/><br/>◎ Unlock amazing achievements 🏆<br/><br/>◎ Climb to the top of the online highscore leaderboard 🔝<br/><br/>◎ 👤 Single player and multiplayer 👥<br/><br/>◎ Can be played online and offline 🆚<br/><br/>◎ Customizable rules to suit your individual needs ☑️<br/><br/>The mobile Mills board game is offered in high quality localization in the following languages: English, French, Italian, German, Spanish, Portuguese, Dutch, Swedish, Turkish, Russian, Polish, Mandarin Chinese and Japanese.<br/><br/>Mills is a real classic travel game and offers a strategic challenge for beginners as well as experienced veterans.<br/><br/>By downloading this game, you are agreeing to our Terms and Conditions (http://www.lite.games/agb/).<br/><br/>Join in and get yourself a top spot in the Mills player community https://www.facebook.com/LiteGames<br/><br/>The 10 best players will be proudly displayed each week on https://www.lite.games/games/mills<br/><br/>Click here to find out about our other free Android games: <br/>http://www.lite.games<br/><br/>Or give us your App feedback here<br/>support@lite.games<br/><br/>Thanks for playing!", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:02:07", "background_image": "https://media.rawg.io/media/screenshots/f16/f16ce53c11e6aecbd6a7688730a41cf5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 111, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["LITE Games"], "genres": ["Board Games"], "publishers": [], "esrb_rating": null}