{"id": 223256, "slug": "battlepillars-multiplayer-pvp", "name": "Battlepillars Multiplayer PVP", "name_original": "Battlepillars Multiplayer PVP", "description": "Crawl into the bug battle with this action packed real time strategy game! The red caterpillar army is on the attack, so fight back with your own tactics as you command the battle ready green caterpillar army! <br/><br/>Battlepillars is an RTS tug of war game where you command heavily armed caterpillar soldiers to do your fighting! Armed to the teeth with flamethrowers, sticky honey, mines, machine guns and more, send your caterpillar troops on the attack using real time strategy and skill! Need some air support? Call in Larry the Bird to deploy some bird bombs! The woodland creatures are at your side and ready for battle Commander! Once the enemy base is destroyed, send your caterpillar army to the next level with brand new prestige segments!<br/><br/>Utilize the best strategies and combinations to form the strongest squad to defeat your opponents. From blitzkrieg and cannon caterpillars, to robot and ninja caterpillars, there are an infinite number of ways to kill off the enemy army!  Looking for an even tougher challenge Commander? Perfect your strategies in the Test Zone, then take the battle online against your buddies via the multiplayer mode! Need to prove you’re the best? Tackle Endless Mode! Conquer the campaign, then continue the battle to overthrow chaotic forces in the new Nightmare Mode!<br/><br/>***FIVE WAYS TO GET IN THE RTS ACTION***<br/><br/>CAMPAIGN - Conquer your way through the map and kill 50 enemy bases and 5 big boss Battlepillars poised to halt your attack!<br/><br/>MULTIPLAYER - Take the battle online via Google Play and challenge your buddies in a multiplayer battles!<br/><br/>TEST ZONE- Experiment battle tactics in the Test Zone!<br/><br/>ENDLESS MODE - Survive for as long as possible against the attack of the red caterpillar army!<br/><br/>RAID MODE – Cocoon your caterpillars into Battleflies and raid the enemy apple supply!<br/><br/>***FEATURES***<br/>-RTS gaming keeps the action fast paced and fun while you strategize your attack.<br/>-50 Levels and 5 World Themes: Garden, Jungle, Spooky, Junkyard, Robots.<br/>-Optional Gold Challenges let players challenge themselves while earning more apples for upgrades, power ups, and rare skins. <br/>- Over 20 unique and powerful skins to boost your army’s might, including the Shaman and Alien skins!<br/>-Wide variety of weapons and upgrades let you create your own fighting style. Kill off enemies with cannons, grenades, flamethrowers, mines, machine guns, missiles and more.<br/>-Plenty of caterpillar soldiers skins to choose from, all with unique battle properties: standard, mummy, spider, robot, ninja and more.<br/>- Use Startfruit to get powerful new prestige segments!<br/>-Call upon woodland allies like the Wizard Turtle or Larry the Bird to aid in the fighting!<br/><br/>Battlepillars is an awesome tug of war battle game that will have you addicted to the battlefield! With tons of upgrades, weapons and soldiers, there are endless ways to conquer with your caterpillar army! So what are you waiting for Commander? Victory awaits you! Download today and launch your attack, your troops need you!", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:01:51", "background_image": "https://media.rawg.io/media/screenshots/e62/e627f52d6a59332f4dbde4951d30658d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 258, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Hitcents"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}