{"id": 223282, "slug": "pixel-blood-online", "name": "Pixel Blood Online", "name_original": "Pixel Blood Online", "description": "The Survival Pixel Block Game, Pixel Blood Online<br/><br/>Pixel Blood Online is a survival block game where you have to survive in cities, farms, airports and train stations full of zombies.<br/>You have to acquire a serum to survive from the many people who have turned into zombies and protect yourself from those who want to take the serum away.<br/><br/>Always be careful of what's behind you. You don't know when your friend will turn into the enemy.<br/><br/>When you are down and tired, build your bonfire. someone who is passing by may become your friend.<br/><br/>Join the fight right now for your country, for mankind, and for yourself.<br/><br/>[Features of Game]<br/>1. Unique and Various Characters<br/>We offer over 100 play characters with a variety of occupations and characteristics, including chefs, pilots, soldiers, school girls, and stewardesses. <br/><br/>2. Offering Dozens of Weapons<br/>The most weapons available to humans from the close weapons(such as knife, sword, hammers, bats, hockey sticks) to gun and throwing weapons(such as pistols, shotguns, machine guns and hand grenade) are waiting for you.<br/><br/>3. Vehicles Support<br/>Vehicles such as boar, stag, undead horses with mobility and attack power can be use<br/><br/>4. Dynamic Action and Addictive Touch of Hitting<br/>You can enjoy a rhythmic touch of hitting and real action with dynamic.   <br/><br/>5. Various Game Modes<br/>In addition to general battle mode, you can experience various game modes such as boss battle and death match.<br/><br/>6.Transformation Mode to Mutant Zombie<br/>After transformed into a Mutant Zombie, you can hunt people who turn into zombies and collect serum. Zombies are no longer your enemy.<br/><br/>7.Decide your own battle style<br/>You can decide a variety of battle methods and styles due to changes in peace, hostility, national mode and day and night changes.<br/><br/>8.Jump high in the sky<br/>You can climb above tall buildings and roofs using the enhanced jump function.<br/><br/>※ If you delete the game, all the data will be gone and not recovered.<br/><br/>※ Please visit our Facebook page (www.facebook.com/pixelbloodonline) or YouTube (www.youtube.com/user/hanaGames/videos) channel if you want more information.<br/><br/>The Best Zombie Survival Pixel Game on Mobile! Play Now for FREE!", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:01:46", "background_image": "https://media.rawg.io/media/screenshots/d80/d8009f901cdfdae0ca82349f5105bf96.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 176, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["1Games"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}