{"id": 223299, "slug": "forge-of-glory-match3-mmorpg-action-puzzle-game", "name": "Forge of Glory: Match3 MMORPG & Action Puzzle Game", "name_original": "Forge of Glory: Match3 MMORPG & Action Puzzle Game", "description": "Forge of Glory is a new exciting 3D multiplayer RPG where you have to battle against real players worldwide to be the most powerful fantasy lord. Use soul stones to summon warriors, rogues, mages, and archers with special roles and unique skills!Open chests and collect cards of different rarity! <br/><br/>Choose your own strategy to conquer other castles and seize their treasures! Build your town and turn it into an invincible fortress! Summon strong guards and use their abilities to protect your resources during PVP sieges!<br/><br/>Explore mysterious dungeons and fight dozens of different monsters: pass through skeletons, try to avoid butchers’ axes, dodge hell knights’ fire and defeat trolls! Open new regions, upgrade your heroes and rush dangerous bosses for rewards.<br/><br/>Enjoy the excellent art and dive into the amazing fantasy world of war and magic! Start your enthralling adventure and prove your bravery in a great number of fights!<br/><br/>NO ADS!<br/><br/>FEATURES:<br/>·         Enjoy awesome 3D graphics in the new addicting Role-playing game!<br/>·         Upgrade heroes and charge your enemies!<br/>·         Collect cards with unique abilities and combine them to make your strategy unbeaten!<br/>·         Compete for high scores with other players in real-time ladder leagues!<br/>·         Battle other players in PVP mode and loot their treasures!<br/>·         Rush in epic dungeons and defeat terrible bosses!<br/>·         Fight with a great number of monsters and defeat them all!<br/>·         Develop your tower to explore new realms!<br/>·         Summon powerful guards with soul stones!<br/>·         Produce resources and develop their mining!<br/>·         Upgrade your fort with excellent city builder mechanics!<br/>·         Run through endless beautiful locations!<br/>·         Become the best in the world of war and magic!<br/><br/>Please NOTE!<br/><br/>Forge of Glory is a free-to-play game, but there are some game items that can also be purchased for real money. If you want to prevent using this feature, please disable in-app purchases in your phone or tablet’s settings. Also, under our Terms of Service and Privacy Policy, you must be at least 13 years of age to play or download Forge of Glory.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:01:43", "background_image": "https://media.rawg.io/media/screenshots/d47/d479b15d445fb8ca538352211427afbc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 421, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Kefir!"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}