{"id": 22339, "slug": "hunahpu-way-of-the-warrior", "name": "Hunahpu: way of the Warrior", "name_original": "Hunahpu: way of the Warrior", "description": "Gameplay <br/>       A hardcore platformer with the difficulty of classic NES games. The increasing complexity and large number of strategic actions at each level. Mix and match different types of weapons, items, and build a sequence of actions.<br/><br/> Painted two-dimensional high resolution graphics. Cartoon style in the spirit of 1990s animation.<br/> The plot is based on the Mayan civilization mythology.<br/> Large number of funny animations.<br/> More than 40 colorful and diverse levels in 6 completely different worlds.<br/> High-quality old school style’s sound.<br/><br/>                                                 Story <br/>       Ancient elders told that the previous world died in the \"big flood\" when the sky fell to the ground and the light disappeared. After that, there was a period between two worlds, a time of magic and heroic events. It was the birth of the heroes-twins first pair, children of previous creators. When the warriors grew, they were summoned to the underworld, Xibalba, for playing ball very loud. After the terrible torture they were executed, but from the head of one of them, the God of Maize, king Xibalba’s daughter, lady Blood, magically got pregnant.<br/>       Lady Blood was cast out. She gave birth to a new pair of legendary heroes-twins Hunahpu and Xbalanque. When they grew up, the brothers carried out many heroic deeds. Their first feat was a victory over the evil stepbrothers, which they turned into people-monkeys with the help of ancient magic. The second feat of the glorious brothers was the victory over the terrible Vucub-Kakish bird.<br/>       After all this, the brothers faced a new threat - kings-magicians of the underworld Xibalba, who left their world and came to ours to enslave it. They were able to take possession of Xbalanque’s mind and force him to serve their will.<br/>       Our hero Hunahpu have a long way to go to save his twin brother Xbalanque from the dark spell of Xibalba kings. To do this he will need to go through forests and rivers, swamps and jungle, snowy mountains and the very underworld of Xibalba. Maybe he'll be able to save not only his brother but also bring back to life his father Maize.<br/>        <br/>", "metacritic": null, "released": "2017-04-10", "tba": false, "updated": "2019-09-17T13:06:31", "background_image": "https://media.rawg.io/media/screenshots/51f/51f98d698af0179b07d993bc612c8d64.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 59, "beaten": 1, "dropped": 1}, "playtime": 4, "achievements_count": 10, "ratings_count": 4, "suggestions_count": 360, "game_series_count": 0, "reviews_count": 4, "platforms": ["PC"], "developers": ["Paper Pirates", "rumata_lab"], "genres": ["Action", "Adventure", "Casual", "Indie"], "publishers": ["Paper Pirates"], "esrb_rating": null}