{"id": 223446, "slug": "hollywood-jackpot-slots-classic-slot-casino-game", "name": "Hollywood Jackpot Slots - Classic Slot Casino Game", "name_original": "Hollywood Jackpot Slots - Classic Slot Casino Game", "description": "Join in on the World's #1 Jackpot Classic Slots Vegas Casino Game with all your Favorite Free Casino Slot Machines!!<br/><br/>With TONS OF FREE LAS VEGAS SLOTS, free slots credit sweepstakes, free slots promotions, NEW GAMES EVERY WEEK and free slots tournaments, Hollywood Jackpot is the BEST classic slots machine game for Android! <br/>Discover the best free slots games in the palm of your hands – get ready to win the biggest slot machine jackpots while you experience the authentic Las Vegas casino games vibe! Play our free slot games with the most realistic casino slot machines in the Play Store! <br/>Transport yourself to the Las Vegas casino floor and play some classic themed casino slots machines that'll be sure to have you spinning non-stop! Install now to play one of the best casino games slots free! We have the best slots gaming promotions and party sweepstakes ready for the taking! Download today and WIN BIG in Hollywood Jackpot party free casino games classic slots!<br/><br/>Features:<br/>🎰 ► Travel to slots free classic old Vegas slots casino and play free slots games online!<br/>🎰 ► Enjoy single-line free slot machine games with bars, triple sevens, diamonds, and cherries!<br/>🎰 ► No-internet and No-wifi required to play Las Vegas Slots on your Android Phone or Tablet!<br/>🎰 ► New free casino slot machines and free casino games weekly!<br/>🎰 ► Free slots gaming with our free to play casino simulator with top free slot games!<br/>🎰 ► 777 Slots Casino Jackpot wins with some of the most realistic slots machines right from your couch!<br/>🎰 ► All your favorite party simulation gambling games and free slot games online for adults!<br/>🎰 ► BINGO! You've hit it big with our unique casino slots games with free bonus slot machines and new bonus casino games!<br/>🎰 ► Be a big fish in a big pond with our social badge system! Show off your Hollywood Jackpot classic slots free accomplishments with pride!<br/>🎰 ► Unique slots free casino slots games with free bonus slots and new bonus casinos games!<br/>🎰 ► Our free casino slot machine games have old Vegas slots party tournaments, 777 wins, party jackpot spinning wins, diamonds, dice deluxe, Amazon, and classic Vegas slots! <br/><br/>These 777 Jackpot Slot machines Wins will have you spinning all day long! You will love playing all these 777 classic Vegas slots games so much that you will tell your friends about it and everyone will have their favorites! Enter the lobby and enjoy free casino slots games in our online Las Vegas casino!<br/><br/>If you like these types of slots free classic slots machine free games, you will also like Hollywood Jackpot Las vegas Slots:<br/>Solitaire, poker, video poker, coin dozer, bingo, texas holdem, blackjack, roulette, keno, match 3, 777 dice deluxe slot wins.<br/><br/>Like our classic slots games? Leave us a 5-star review. Your feedback is appreciated.<br/>Play old Vegas free slots today!<br/>Questions about our Las Vegas Slots? <br/>E-mail us at: HollywoodClassicSupport@playrocketgames.com<br/>Like us on Facebook: https://www.facebook.com/HollywoodClassicSlots/<br/><br/>This Las Vegas slots game is intended for an adult audience and does not offer real money gambling or an opportunity to win real money or prizes. Practice or success at social gaming does not imply future success at real money gambling", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:01:21", "background_image": "https://media.rawg.io/media/screenshots/dba/dba956eddcd5f092cc62cfd7702e5403.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 98, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Rocket Speed - Casino Slots Games"], "genres": [], "publishers": [], "esrb_rating": null}