{"id": 223496, "slug": "super-party-vegas-slots", "name": "Super Party Vegas Slots", "name_original": "Super Party Vegas Slots", "description": "Do YOU want to join the party? Travel the world for the best party slots, It's party time! BIG WINS, FREE SPINS, and your favorite parties from around the world.  PLAY NOW!<br/><br/>★★★★ Game Features ★★★★<br/>► It's YOUR Party: 5 Reel Slot Machines with SWEET wins &amp; HUGE payouts!<br/>► Play for FREE! We give you HUGE daily coin bonuses every 4 hours!<br/>► Beautiful hand-drawn HD graphics, HD sound<br/>► Level up for BIGGER bets and FREE credits!<br/>► Double or Nothing on YOUR BIG wins with the MEGA bet<br/>► Get tons of FREE spins, fun mini-games, HUGE bonuses<br/>► Enjoy the world's wildest parties in the palm of your hand! Our machines will allow you to experience the thrills of Carnival, Oktoberfest, and St. Patrick's Day!<br/>► Try our brand new feature COLOSSAL STACKS!! Spin to reveal huge stacking symbols for enormous jackpots!<br/>► Try multiple machines for different slot layouts and paylines!<br/>► Android, iOS, Facebook, and Amazon play on multiple platforms!<br/>► Want more amazing slots action?  Play our other games!<br/>► Play where you want, when you want! No internet required!<br/><br/>Don't get left out!  We've got the slot party that you've been waiting for!  Do you like free slot apps? Then you'll enjoy Super Party Vegas Slots!  Play for free, without spending a cent or needing internet connection.<br/>What party have you always wanted to go to?  You can join in the fun with Super Party Vegas Slots!  Want to go to Brazil for the Carnival in Rio De Jainero?  Or do you want to have fun in a beer house for Oktoberfest in Munich?  You can party with the Vegas Luxury High Roller, and win in style.  You can play the pokies for a St. Patrick's bonanza.  Want to celebrate the Chinese new year?  Well you can!<br/>Hit the party and have fun with these amazing slot pokies.  Get HUGE payouts and play for FREE every day!  Download Super Party Vegas Slots now!", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:01:12", "background_image": "https://media.rawg.io/media/screenshots/751/7511d6b02ee29aba68ea3652ea2a1a9b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 171, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Rocket Speed - Casino Slots Games"], "genres": [], "publishers": [], "esrb_rating": null}