{"id": 223452, "slug": "drag-racing-club-wars-2014", "name": "Drag Racing: Club Wars (2014)", "name_original": "Drag Racing: Club Wars (2014)", "description": "Addictive! Play the Best Racing Game on Google Play, Makes a Great Time Killer - Not too Boring and Doesn't have Too Many Ads.<br/><br/>Hit the Drag Strip with Race Clubs battling for Territory, Gold and Glory!<br/><br/>The best racing game that launched the legendary Creative Mobile Drag Racing series returns with new features, improved graphics and expanded game play. Supercars? Check. Street Racers? Check. Classic muscle? You bet! <br/><br/><br/>LOTS OF CARS<br/>This game includes virtually every sports car for you to enjoy. That's right, 20+ BRANDS: Chevrolet, Ford, Dodge, BMW, Volkswagen, Honda, Nissan, Mazda - and more! The best part? There's always more of them coming.<br/><br/><br/>REAL RACERS  &amp; TEAMS<br/>Go head-to-head against your friends or random racers, real time bet racing, or race against 9 players at once in real-time competitions. If you like to race on the go or offline, we've got you covered with loads of Career and Class Challenges. <br/><br/><br/>CLUB WARS<br/>Now players can join Racing Clubs in-game and take their club to the top of the leaderboards! Club features include membership rosters and in-game chat, so players can talk with racers from around the globe!<br/><br/><br/>MASSIVE UPGRADES<br/>Everyone loves a good stock car, but we know what you really desire is to PUT THE PEDAL TO THE METAL! Drag Racing has a fresh new advanced upgrade system, featuring car parts and modifiers.<br/><br/><br/>GET UNDER THE HOOD<br/>We have the most realistic physics engine in the genre, meaning that everything works the way it does in real life. Try to find the right balance between power and grip while staying in your class.  Adjust gear ratios and don’t forget to add in some nitrous oxide to give your ride an extra kick!<br/><br/><br/>AWESOME COMMUNITY<br/>It's all about the players, connect with other car fanatics and enjoy DR Club Wars together:<br/>Website: http://dragracing.creative-mobile.com<br/>Facebook: https://www.facebook.com/DragRacingGame<br/>Twitter: https://twitter.com/dragracinggame<br/>Instagram: https://instagram.com/dragracinggame<br/><br/><br/>TROUBLESHOOTING<br/>- If the game doesn't start up, runs slowly or crashes, get in touch and we'll do our best to help.<br/>- If you have any questions, make sure you check out our FAQ at http://dragracing.creative-mobile.com/faq<br/>If you need additional support please contact us through our Support system: https://support.creative-mobile.com/ or to our e-mail at support@creative-mobile.com<br/><br/><br/>", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:01:20", "background_image": "https://media.rawg.io/media/screenshots/8bd/8bd40aa16e5539d7f16f99f3d1629d9d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 201, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Creative Mobile"], "genres": ["Racing"], "publishers": [], "esrb_rating": null}