{"id": 22344, "slug": "old-mans-journey", "name": "Old Man's Journey", "name_original": "Old Man's Journey", "description": "<p>Old Man’s Journey, a soul-searching puzzle adventure, tells a story of life, loss, reconciliation, and hope. Entrenched in a beautifully sunkissed and handcrafted world, embark on a heartfelt journey interwoven with lighthearted and pressure-free puzzle solving.<br />\nA visual narrative about life’s precious moments, broken dreams, and changed plans, uncover stories of the old man’s life told through beautiful vignettes of his memories. Interacting with the serene and whimsical environment, solve playful puzzles by shaping the landscape, growing the hills to create the old man’s path forward.<br />\nDuring this compact gameplay experience, you’ll be transported to a vibrant and wishful world, exploring life’s complexities through the old man’s eyes. Meditatively delightful and reflective, Old Man’s Journey invites you to immerse yourself in quiet and inquisitive puzzles, and experience the old man’s heartache, regret, and hope.<br />\nFeaturesA powerful and emotional narrative told only through imagery<br />\nGorgeously whimsical landscapes with hand-drawn art and frame-by-frame animations<br />\nHandcrafted, pressure-free puzzles<br />\nUnique delightful landscape-shaping mechanic<br />\nA compact game experience perfect for a wanderlust-evoking escape<br />\nOriginal and emotionally compelling soundtrack by SCNTFC<br />\nCrisp drawings rendered in native resolution - even on your 4K monitor</p>", "metacritic": 77, "released": "2017-05-17", "tba": false, "updated": "2024-01-06T07:23:47", "background_image": "https://media.rawg.io/media/games/8f5/8f51cd193717f03ec820b5caece4f963.jpg", "website": "http://www.oldmansjourney.com", "rating": 3.6, "rating_top": 4, "added_by_status": {"yet": 160, "owned": 1403, "beaten": 212, "toplay": 154, "dropped": 49, "playing": 26}, "playtime": 2, "achievements_count": 51, "ratings_count": 240, "suggestions_count": 391, "game_series_count": 0, "reviews_count": 251, "platforms": ["PlayStation 4", "iOS", "Nintendo Switch", "Xbox One", "Android", "macOS", "PC"], "developers": ["Broken Rules"], "genres": ["Action", "Adventure", "Casual", "Indie", "Puzzle"], "publishers": ["Broken Rules"], "esrb_rating": null}