{"id": 22348, "slug": "shattered-throne", "name": "Shattered Throne", "name_original": "Shattered Throne", "description": "War has come to the once peaceful kingdom. Her brave knights turn on one another, while sylvan armies emerge from the wilds and necromantic magic commands forces of the dead. Test your tactics on the fields of battle. Master both steel and magic to secure victory. <br/><br/><br/>Turn based strategy at its finest.  Follow the story of the young prince as he leads his forces against dark forces that threaten to tear the realm apart. Direct powerful combo attacks to destroy the enemy and fuel game changing powers. Multiple play modes will challenge your ability as a general to the limit. <br/><br/><br/><ul><li> Three unique armies, each with their own distinct play style <br/></li><li> Choose your general from a variety of characters, each with their own special powers and enhancements <br/></li><li> Strategy without the random, results are fully deterministic <br/></li><li> Unlimited undos to find the best method of attack <br/></li><li> Combo system makes each follow up attack against the same target stronger than the previous <br/></li><li> Upgrade villages to increase your economy and access special units and effects <br/></li><li> Units gain experience by defeating enemies, yielding powerful champions and heroes<br/></li><li> Battle the AI across a sprawling campaign with unique battles and 3 difficulty modes<br/></li><li> Puzzle mode maps to test even the greatest generals<br/></li><li> Build your own maps and share them through Steam Workshop<br/></li><li> Battle others online with asynchronous game play</li></ul>", "metacritic": null, "released": "2016-11-28", "tba": false, "updated": "2019-08-28T22:07:35", "background_image": "https://media.rawg.io/media/screenshots/663/663a6e8365ea8c1432baa4adff8a13f2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 38}, "playtime": 6, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 313, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Checkmark Games"], "genres": ["Strategy", "Indie"], "publishers": ["Checkmark Games"], "esrb_rating": null}