{"id": 223495, "slug": "life-quest-full", "name": "Life Quest [Full]", "name_original": "Life Quest [Full]", "description": "It’s a big world out there — you can have it all in the palm of your hand with Life Quest® the hit PC game, now tailored for your touch screen!  You’re a new graduate ready to tackle life's challenges in this quirky simulation game. The race is on to accomplish it all, from finding true love to building your dream home to discovering a rewarding career. Hurry, your reunion is right around the corner. Show your rivals that you have what it takes to be a superstar success story! <br/><br/>Key Features: <br/> • Play the hit PC game on your touch screen!<br/> • Choose an avatar and customize your look with a full array of colors and endless fashions!<br/> • Meet the quirky characters who inhabit this colorful city full of charm!<br/> • Unlock a sneak peek of the highly anticipated sequel, Life Quest 2, at the 4Reelz movie theater!<br/> • Play again and again to try all the different life choices! <br/><br/>☆☆☆ Discover more from Big Fish Games! ☆☆☆ <br/><br/>We’re big believers that everyone is a gamer at heart and that games are a great source of joy and relaxation. Founded in 2002, Big Fish Games is a developer, publisher and distributor of casual games. We offer a virtually endless selection of interactive games that you can enjoy anytime, anywhere — on your PC, Mac, mobile phone, or tablet. Renowned for offering A New Game Every Day!® on www.bigfishgames.com, Big Fish Games distributes more than two million games per day worldwide.<br/><br/>We have many other great Google Play games including:\u2028 <br/><br/>➠ Empress of the Deep: The Darkest Secret<br/>➠ Nightmare Adventures: The Witch's Prison<br/>➠ Big City Adventure: San Francisco<br/>➠ Atlantis Sky Patrol<br/>➠ The Serpent of Isis<br/>➠ Adventure Chronicles<br/>➠ Azada<br/>➠ Amazon: Hidden Expedition<br/><br/>And coming soon:<br/>➠ Secrets of the Dragon Wheel<br/>➠ Mahjong Towers Touch <br/>➠ Azada: Ancient Magic<br/>➠ Fairway Solitaire<br/>➠ Uncharted: Hidden Expedition<br/><br/>Visit www.bigfishgames.com from your Android device to see the whole list!<br/><br/>Follow us on Twitter: http://bigfi.sh/BigFishTwitter<br/><br/>Become a fan on Facebook: http://www.facebook.com/BigFishGamesMobile", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-30T21:44:19", "background_image": "https://media.rawg.io/media/screenshots/f6e/f6e78d34fc62b9eab8f0d82e2d9d88b3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 151, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Big Fish Games"], "genres": ["Casual"], "publishers": [], "esrb_rating": "Everyone"}