{"id": 223486, "slug": "somme-trench", "name": "Somme Trench", "name_original": "Somme Trench", "description": "You're a fresh British infantryman at the Battle of the Somme, one of the longest, bloodiest battles of World War One. Can you survive a clash that kills almost twenty thousand of your countrymen on the first morning alone?<br/><br/>\"Somme Trench\" is an interactive historical novel by Andrew J. Schaefer, where your choices control the story. It's entirely text-based—without graphics or sound effects—and fueled by the vast, unstoppable power of your imagination.<br/><br/>Your best bet might be as an airplane gunner, or a trench fighter, or even as a stretcher bearer. Firing squads, brothels and homeward-bound steamships are all in your possible future.  Or you might give in to your inner demons and wind up chatting with ghosts and skeletons as though they're your friends. Whatever path you choose, you'll be immersed in a richly detailed, interactive historical novel that has almost as many twists and turns as there were soldiers at the Somme.<br/><br/>• Immerse yourself in the world of the Western Front<br/>• Choose paths as diverse as infantryman, stretcher bearer or aircraft machine gunner<br/>• Learn about some of the most important events of world history<br/>• Challenge your mind<br/>• Enjoy a richly-detailed interactive novel with countless storylines<br/>• Solve mysteries embedded within the game", "metacritic": null, "released": "2014-12-30", "tba": false, "updated": "2019-08-02T06:28:19", "background_image": "https://media.rawg.io/media/screenshots/06d/06d9d56c0373b9511a27824350c54eda.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 156, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "Android"], "developers": ["Hosted Games"], "genres": ["Adventure", "RPG"], "publishers": ["Hosted Games"], "esrb_rating": null}