{"id": 223540, "slug": "covet-fashion-dress-up-game", "name": "Covet Fashion - Dress Up Game", "name_original": "Covet Fashion - Dress Up Game", "description": "Show off your great style with Covet Fashion, the game for the shopping obsessed! Join millions of other fashionistas, discover clothing and brands you love, and get recognized for your style! Feed your shopping addiction and create outfits in this fashion game designed to hone your style skills. Express your unique style by shopping for fabulous items to fill your closet, putting together looks for different Style Challenges and voting on other players’ looks. Plus, win exclusive in-game prizes for looks that earn 4 stars or more!<br/><br/>SHOP THE BEST STYLES. We’ve partnered with brands like Calvin Klein, Rachel Zoe and Vince Camuto to bring you the latest fashions to obsess over. With over 175 brands to shop from you’re sure to discover styles you love.<br/><br/>STYLE THE PERFECT OUTFIT. Choose from thousands of glamorous clothing and accessory items in addition to chic hair and makeup styles on our new diverse array of models to create looks for various styling challenges such as photo shoots, cocktails and red carpet fittings.<br/><br/>VOTE ON WHO WORE IT BEST. Cast your vote and decide what’s hot on the Covet Fashion scene! Over hundreds of thousands of entries per styling challenge! Are other players’ looks 5-star worthy or did they miss the mark?<br/><br/>PLAY WITH FRIENDS. Want to get advice on your outfits or celebrate your wins? Join a Fashion House to make friends or connect to Facebook and chat about any and all things Covet Fashion.<br/><br/>Did you know you can shop your favorite Covet Fashion items in real life? All of the clothing and accessory items featured in the game link to places where you can buy them for your real-life closet. Not only can you discover new brands and trends, you can own them, too!<br/><br/>Download Covet Fashion now and start styling!<br/><br/>FOLLOW US<br/>Instagram: instagram.com/covetfashion<br/>Facebook: https://m.facebook.com/covetfashion<br/>Twitter: https://twitter.com/CovetFashion<br/>Pinterest: http://pinterest.com/covetfashion/<br/>________________________________________<br/>Contact Support:<br/>covethelp@crowdstar.com<br/>__________________________________________<br/>Payments FAQ:<br/>Does Covet Fashion allow in-app payments?<br/>Covet Fashion is a free-to-play app, but like many apps on Google Play, there is the option of purchasing in-app items using real money. <br/>Turn off in-app purchases on your device if you’d like to disable this feature.<br/><br/>Privacy Policy: http://www.crowdstar.com/privacy<br/>Terms of Service: http://www.crowdstar.com/tos<br/>Acceptable Use Policy: http://www.crowdstar.com/aup<br/>__________________________________________<br/>Notes:<br/>- This game requires an internet connection (WiFi or 3G) to play<br/>________________________________________", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-30T22:40:54", "background_image": "https://media.rawg.io/media/screenshots/7b7/7b7eb3c97f600d43c0e7b97cad1f23e2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 159, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Crowdstar"], "genres": ["Casual"], "publishers": [], "esrb_rating": "Teen"}