{"id": 22354, "slug": "freaky-awesome", "name": "Freaky Awesome", "name_original": "Freaky Awesome", "description": "Freaky Awesome is a rogue-lite with the randomly generated environment, permadeath and a whole lot of gradually unlocked content. Game developers are fans of such games as Binding of Isaac and Broforce. But Freaky Awesome raises the degree of madness! During the fight, you can mutate into a new form with unique mechanics and quickly adapt to survive. In addition to mutations, you can unlock skills and objects that affect mechanics and gameplay. Play solo or co-op with your friends!<br/><br/>Mutate to survive!Dead mutants leave nasty puddles of mutagen. Be careful and wise because if you step into it, you’ll replenish your health receiving a dose of a mutagen that will change your character at some point.Invite friends to online co-op!You can play alone or invite friends to join you and explore the game together in teams of 2 to 4 players. Coop benefits everyone so that every player will be able to apply it later during a single game or a multiplayer game with other people.Gain new mutation forms by slaying them!To unlock new mutation, you should free it from confinement and then kill it in combat. Once done, you’ll be able to turn into this form in your playthrough which entails a significant change your character’s mechanics. A couple of seconds ago you threw your head at your opponents, and now you lay eggs so that your tiny copies can hatch to fight at your side, or maybe your enemies get electrocuted. That’s quite OK.Make use of the environment!But be careful! Explosions, flying barrels, circular saws, flames out the walls or flying pig heads won’t give you a second to breathe. You can both use the environment as a weapon or get killed by it.The game is changing!It applies to randomly generated locations as well as more general things. The game plot itself is designed to make the game change after every successful session. It means new unlocked locations, new enemies, bigger levels with new mechanics, stronger bosses. And with each session, you’ll move along the storyline.", "metacritic": null, "released": "2018-10-26", "tba": false, "updated": "2022-08-10T14:23:09", "background_image": "https://media.rawg.io/media/screenshots/ed7/ed7d0dc8fb988bffd2a8d194c62e8196.jpg", "website": "http://mandragoragames.com/freakyawesome", "rating": 2.85, "rating_top": 3, "added_by_status": {"yet": 13, "owned": 180, "beaten": 1, "toplay": 1, "dropped": 9}, "playtime": 3, "achievements_count": 68, "ratings_count": 19, "suggestions_count": 160, "game_series_count": 0, "reviews_count": 20, "platforms": ["Nintendo Switch", "PlayStation 4", "PC", "macOS", "Linux"], "developers": ["Mandragora", "Badland Games Publishing"], "genres": ["Action", "Adventure", "RPG", "Simulation", "Casual", "Indie"], "publishers": ["BLG Publishing", "Mandragora"], "esrb_rating": "Teen"}