{"id": 223568, "slug": "idle-tap-zoo-tap-build-upgrade-a-custom-zoo", "name": "Idle Tap Zoo: Tap, Build & Upgrade a Custom Zoo", "name_original": "Idle Tap Zoo: Tap, Build & Upgrade a Custom Zoo", "description": "Tap, collect and raise your very own zoo animals in Idle Tap Zoo, the incremental idle zoo clicker game! Raise zoo animals and upgrade them to increase their birth rate and value, then sell them for a profit to expand your business with just a tap! Use your profits to build your own custom zoo!<br/><br/>Manage a zoo simulation and improve it with the small upgrades like bathrooms and food stalls to attract more visitors and become the ultimate business manager. More visitors means more money, and before you know it, you'll be able to expand your zoo with aquariums and safari rides!<br/><br/>In this idle game, your zoo will continue to grow and make you money that can be used to unlock new zoo animals like monkeys, pandas, gorillas and lions! Become a business manager and trade your animals in bulk at the trading post for gems. Use gems to research permanent upgrades for large boosts and continue to expand your zoo all with a simple tap!<br/><br/>How much will your zoo be worth?<br/><br/>Idle Tap Zoo Features:<br/><br/>Build Your Zoo<br/>• Manage a zoo that can be customized exactly to your liking! Create the perfect business simulation! <br/>• Create a dream zoo and open it to visitors to begin increasing your income and grow your business empire<br/>• Customize your zoo with special decorations, fun rides, and all of your favorite zoo animals!<br/>• Create a jungle habitat for the monkeys and gorillas! Create a lush bamboo forest for your tigers and pandas!<br/><br/>Raise Animals<br/>• Raise zoo animals – Buy and sell your favorite zoo animals<br/>• Raise animals and manage their population based on their birth and death rate percentage<br/>• Stock your food with bananas for the gorillas and monkeys and bamboo for the pandas! <br/>• Upgrade each zoo animals to help its survival rate and sell price<br/>• Trade your zoo animals at the trade post for gems which can be used to boost your progress<br/><br/><br/>Idle Progress<br/>• A unique incremental/idle game experience without too much clicking<br/>• The idle clicker game that lets you grow and learn – read fun zoo facts!<br/>• Idle Progress – Your zoo will continue to grow and make money while you're gone<br/>* Enjoy an idle safari in your pocket-return to the game to purchase rare attractions!<br/><br/>Expand Your Zoo<br/>• Manage a zoo and tap to invest in improvements that can permanently increase zoo animals’ birth rate<br/>• Be the zoo manager and increase the maximum time the zoo can run without you. Run a perfect zoo simulation! <br/>• Build your zoo to be the best and earn as many achievements as possible<br/><br/>Build your dream zoo filled with fun rides, great attractions and all of your favorite zoo animals!<br/><br/>Tap to raise rare animals like monkeys, pandas and lions OH MY! Continue to expand your zoo in the best idle clicker simulation game, Idle Tap Zoo!<br/><br/>Download Idle Tap Zoo today to start managing a zoo!<br/><br/>Idle Tap Zoo does not require an internet connection, and only watch ads if you want.<br/>See this game and other incremental, idle, tapper and clicker games on the incremental games subreddit", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:00:55", "background_image": "https://media.rawg.io/media/screenshots/4e5/4e5a42fbe89936d4ce26c67b644cd2ed.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 254, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Iron Horse Games"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}