{"id": 223581, "slug": "tattoo-tycoon", "name": "Tattoo Tycoon", "name_original": "Tattoo Tycoon", "description": "Start your own tattoo studio and acquire the arts that get under the skin! Create your own style and expand your studio to become the greatest one in town!<br/><br/>AD-FREE Version! (no in-game ads)<br/><br/>Features:<br/>- casual business simulation with classic “tycoon”-style gameplay<br/>- 6 scenarios with more than 50 challenging tasks<br/>- individualize your tattoo studio with a multitude of furnishings and fixtures<br/>- manage employees and expand your business<br/>- minigames with dynamic difficulty<br/>- hard-rocking music and sound effects<br/>- HD-graphics for high-resolution displays<br/>- App2SD<br/><br/>Look behind the scenes of the tattoo culture and build your own tattoo empire! Set up a perfectly furnished studio and prove your skills at handling your employees and tattoo machine! Improve your reputation and squeeze money out of your customers by fulfilling their wishes and offering individual advice, refreshing drinks, comfortable sofas, and trendiest t-shirts! Create the most impressive tattoos by designing new patterns and by improving your equipment! Let skilled employees give you a hand and manage your employees and make the best use of their abilities! Work your way up from a backyard parlor owner to the scene's most successful tattoo artist and become a tattoo tycoon!<br/><br/>Thank you for playing 'Tattoo Tycoon'!<br/><br/>", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:00:53", "background_image": "https://media.rawg.io/media/screenshots/106/106c0e88fdf9525298f9f07ebc17c4e6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 302, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Handy Games"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}