{"id": 223525, "slug": "galaxy-storm-galaxia-invader-space-shooter", "name": "Galaxy Storm - Galaxia Invader (Space Shooter)", "name_original": "Galaxy Storm - Galaxia Invader (Space Shooter)", "description": "Defend the Galaxy and planet Earth from the alien Galaxia invaders as they attack, zig zag and dive-bomb the player.<br/>Collect bonus power-ups and use them to destroy the attacking swarm of aliens. Get this retro space shooter that classic gaming fans just love!<br/><br/>Best free galactic arcade space shooter game - Play Galaxy Storm - Galaxia Invader today! Styled on classic 80s arcade games.<br/><br/>Press:<br/>★★ App Weekender Pick - AndroidTapp ★★<br/> 4/5 Stars – A solid, entertaining and challenging shoot ‘em up, Galaxy Storm is a great homage that old and young should try out. - Androidheadlines <br/><br/><br/>Fast Arcade Shoot'em up (Shmup) retro space shooter in the style of classic retro arcade games.<br/>The alien invaders are attacking and they're bringing their boss! So you need to tool up!<br/>Power-up with Blaster rapid fire, Plasma cannon, Side guns etc, Shields and more...<br/><br/>Features:<br/>★ Easy to play, Hard to master<br/>★ Fast smooth action on phone or tablet<br/>★ Includes Power-ups and Bosses! <br/>★ Free Galaxia ship and unlockable space ship<br/>★ Great sound effects and soundtrack<br/>★ Retro arcade feel of 1980s<br/>★ Global Scoreboard (to get on it score over 5000+ points)<br/>★ 3 Control modes (Buttons or 1 Finger Drag or 2 Finger Drag)<br/>★ Score bonuses for killing charging aliens<br/>★ Optional CRT scanlines!!<br/>★ Responsive controls: easy to use<br/>★ Multi-touch with fire button on top right of screen<br/>★ Autofire shooting option<br/><br/>Play Galaxia Invader and defeat the oncoming alien bugs! <br/><br/>**** Please Rate Us &amp; follow on Twitter for updates @Gazzapper ****<br/><br/>*** Controls (Touch or Buttons) ***<br/>Button Control:<br/>Left / Right / Fire buttons on bottom of screen (my personal preference)<br/><br/><br/>Autofire: Just use the new autofire button to switch it on or off<br/><br/><br/>Drag (Touch) Controls:<br/>1 Finger Mode: Touch bottom screen to have ship follow your finger <br/><br/>2 Finger Mode: Touch bottom screen to have ship follow your finger and tap screen above the ship to shoot.<br/><br/>2 Finger Side Mode: Move and shoot ship gun by pressing each side of the screen<br/><br/>Includes the tricky Alien Dodging from the classic and \"Chase the Flagship\" <br/><br/>Get your Highest Score on a Global High-score Table!<br/>Works well on small or large screens<br/><br/><br/>[ Please update to latest Version ]", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:01:05", "background_image": "https://media.rawg.io/media/screenshots/68e/68e3c7598a6ed153deb0e0719a1f295d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 144, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Gazzapper Games"], "genres": ["Arcade"], "publishers": [], "esrb_rating": null}