{"id": 223567, "slug": "dungeon-hunter-5-action-rpg", "name": "Dungeon Hunter 5 – Action RPG", "name_original": "Dungeon Hunter 5 – Action RPG", "description": "Join forces with millions of Bounty Hunters online for the most intense hack-and-slash adventure!<br/><br/>Fate has thrust the land into an age of chaos that ushered in the rise of darkness. Now, the people must fend for themselves against bandits, monsters and other terrors. However, for mercenaries and bounty hunters, this is an age of unbridled opportunity and prosperity, for justice always demands a high price, and their business has never been better!<br/><br/>It's at this time rising heroes like yourself must grab their sword and ask themselves: Do I fight for good? Or for gold?<br/><br/>THE ULTIMATE HACK 'N' SLASHER ON MOBILE<br/>o Discover the casual controls that make amazing combat moves easily accessible to anyone.<br/>o Hunt down monsters, dark knights, devil minions, demon mages and other villains in more than 90 dungeon crawler missions, including Epic levels for true ARPG dungeon legends.<br/><br/>UNMATCHED GRAPHICS<br/>o Amazing animations for your heroes, attacks and slain foes make the entire experience more satisfying.<br/>o Detailed visuals with stunning AAA graphics that bring your MMO adventure to life.<br/>o Explore gorgeous environments, unlike any dungeon game you’ve seen, from the shattered realm of Valenthia to the cold and barbarous Valen Outpost.<br/><br/>LEGENDARY POWERS<br/>o Wield over 900 pieces of armor and weaponry. Your heroes will need all the customization they can find in this massive RPG adventure game.<br/>o Unleash hundreds of devastating spells and skills in battle.<br/>o Master the Elements by strategically equipping the best weapons, armor and magic.<br/>o Evolve and Master gear to compete in PvP and PvE features like the Arena.<br/><br/>FIGHT WITH FRIENDS<br/>o Rally up to 3 other player heroes to fight side by side in Co-Op multiplayer mode.<br/>o Hire friends as Allies to help you become a great slayer of evil along your journey of vengeance, where you'll discover arcane legends.<br/>o Join a Guild and clash against other players in competitive battles.<br/><br/>BUILD, DEFEND &amp; RAID<br/>o Build and upgrade a Stronghold in this MMO-style bastion-defense mode.<br/>o Tactically deploy over 230 Minions to 60 Trap Rooms to stop any hunters that dare attack.<br/>o Craft powerful defenders by collecting Minion Shards in Co-Op mode.<br/>o Defy other heroes to try and break into your bastion of traps in this asynchronous MMORPG challenge!<br/><br/>ALWAYS MORE TO EXPLORE<br/>o Daily Dungeons not only provide a fresh dungeon quest for heroes, but allow you to collect rare materials to craft powerful equipment and boosts.<br/>o Weekly Events and Legendary Hunts give you the chance to prove yourself a worthy Bounty Hunter as you fight the dungeon boss and unlock exclusive gear in the game.<br/>o Seasonal Challenges add completely unexpected twists to your adventure, but offer unique rewards for success.<br/>o Climb the leaderboards as you take down challenges, so everyone will recognize your warrior's legacy! You’ll earn mighty rewards along the way as well.<br/><br/>If you’re a fan of fantasy, MMORPGs, action role-playing games, or multiplayer dungeon games, and have a hunger to slay endless hordes of monsters as you explore ancient crypts and magical strongholds, then stop waiting and download Dungeon Hunter 5 now! The world can ill afford to wait for heroes such as yourself…<br/><br/>Find out more about the game on the official site -- http://www.dungeonhunter5.com/<br/>___<br/><br/>Visit our official site at http://gmlft.co/website_EN<br/>Check out the new blog at http://gmlft.co/central<br/><br/>Don't forget to follow us on social media:<br/>Facebook: http://gmlft.co/DH5_Facebook<br/>Twitter: http://gmlft.co/DH5_Twitter<br/>Instagram: http://gmlft.co/GL_SNS_IG<br/>YouTube: http://gmlft.co/DH5_YouTube<br/>Forum: http://gmlft.co/DH5_Forum<br/><br/>This app allows you to purchase virtual items within the app and may contain third-party advertisements that may redirect you to a third-party site.<br/><br/>Terms of Use: http://www.gameloft.com/en/conditions-of-use<br/>Privacy Policy: http://www.gameloft.com/en/privacy-notice<br/>End-User License Agreement: http://www.gameloft.com/en/eula", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-31T08:01:18", "background_image": "https://media.rawg.io/media/screenshots/a8c/a8c270ee9163f36795db7e81f192fe86.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 511, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Gameloft", "Gameloft SE"], "genres": ["RPG"], "publishers": [], "esrb_rating": "Teen"}