{"id": 223598, "slug": "slots-jackpot-isle-slots-games", "name": "Slots Jackpot Isle Slots Games", "name_original": "Slots Jackpot Isle Slots Games", "description": "Download Slots Jackpot Isle - a tropical casino extravaganza!<br/><br/>We’ve got slots games of all reel shapes and sizes! This exciting free casino quality video slots game has big wins and bonanza payouts. Slots Jackpot Isle offers top slots games in a treasure island casino bonanza of riches. Find your fortune in our range of slot machines! Dazzle your senses with spins of chance!<br/><br/><br/>Slots Jackpot Isle Features:<br/>- Hit the jackpot with our slot machines – multiple paylines, generous payouts, multiplier Wilds, scatter symbols, doubledown mega bets, and epic Free Spin modes.<br/>- Dazzling bonus games – Bounce your way to big wins with our Olympus Pachinko bonus round! Hit Multiplier Pegs for bonanza payouts! Win progressive bonus jackpots, or spin the wheels of fortune for mega rewards!<br/>- A sizzling variety of freespins – blazing 7s, shifting Wilds, scatter symbols. Match Five of a Kind Free Spin symbols for progressive chances to get Mega Wins on your bet!<br/>- Packed with casino favorites like Triple 777s, Cherry Wilds, Bells, and Bars.<br/>- Experience the excitement of a Las Vegas or Macau style casino for free - easy to play and easy to win. Get guaranteed fortune payouts in our Free Spins and Bonus Rounds!<br/>- Top quality art, sounds, and animation – smooth spinning reels with gorgeous graphics and hit anticipation sounds.<br/>- Tons of slots with unique configurations and themes – more reels than gemstones have sides, multiple paylines to bring the riches, and bonus rounds of fortune!<br/>- Download system for new slot machines – get new slots seamlessly and easily with frequent additions.<br/><br/>Relax in a tropical slots mania casino with riches unmatched by Cleopatra or Zeus!<br/>If you love great video slots games, you’ll love Slots Jackpot Isle! Download today and start spinning!<br/><br/>If you have any questions please reach out to us at: jackpotislesupport@playrocketgames.com", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:00:50", "background_image": "https://media.rawg.io/media/screenshots/d57/d57c38015f7537bf1864bcd6ecd4c706.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 196, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Rocket Speed - Casino Slots Games"], "genres": [], "publishers": [], "esrb_rating": null}