{"id": 223547, "slug": "modern-combat-versus-new-online-multiplayer-fps", "name": "Modern Combat Versus: New Online Multiplayer FPS", "name_original": "Modern Combat Versus: New Online Multiplayer FPS", "description": "Drop into a free, fun online FPS that defines a new era of shooter games. <br/><br/>🏆 Android Excellence Game of 2018 🏆<br/><br/>Choose your Agent, master your role, and dominate the field of battle with your team. From skilled run 'n' gun attackers and covert assassins to team supporters and defenders, there’s an Agent for every style of warfare.<br/><br/>FEATURES<br/>• Make every bullet count in 4v4 online multiplayer battles featuring a set of competitive team-based game modes.<br/><br/>• Play as 17+ specialized Agents, each equipped with unique guns and abilities!<br/><br/>• Create or join a clan to connect with players from around the world.<br/><br/>• Host Live Tournaments with custom lobbies, spectator mode, and in-game prizes!<br/><br/>• Go for the kill as you battle across 6 distinct maps ranging from close-quarters to long-range warfare. There’s multiplayer action around every corner.<br/><br/>• Compete in ranked seasons and get promoted to higher leagues where the warfare hits new heights of online action! Earn free prizes and prestigious rewards.<br/><br/>• Customize your Agents with cosmetic skins featuring unique designs and weapon camos.<br/><br/>• Pick up and play with groundbreaking, intuitive shooter controls that are perfectly designed for an FPS game.<br/><br/>• Get immersed in the action with the best console-quality FPS graphics featuring stunning visuals and effects.<br/><br/>If you’re a fan of online FPS battles, team-based shooter games, and run &amp; gun warfare, then drop into the action for free! Download NOW!<br/><br/>_____________________________________________<br/><br/><br/>Visit our official site at http://gmlft.co/website_EN<br/>Check out the new blog at http://gmlft.co/central<br/><br/>Don't forget to follow us on social media:<br/>Facebook: http://gmlft.co/SNS_FB_EN<br/>Twitter: http://gmlft.co/SNS_TW_EN<br/>Instagram: http://gmlft.co/GL_SNS_IG<br/>YouTube: http://gmlft.co/GL_SNS_YT<br/><br/>This app allows you to purchase virtual items within the app and may contain third party advertisements that may redirect you to a third party site.<br/><br/>Terms of Use: http://www.gameloft.com/en/conditions-of-use<br/>Privacy Policy: http://www.gameloft.com/en/privacy-notice<br/>End-User License Agreement: http://www.gameloft.com/en/eula", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:01:00", "background_image": "https://media.rawg.io/media/screenshots/cef/cef22d0afc82bcf93017dc08250deeb4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 576, "game_series_count": 0, "reviews_count": 1, "platforms": ["Android"], "developers": ["Gameloft"], "genres": ["Action"], "publishers": [], "esrb_rating": null}