{"id": 223608, "slug": "slots-paradise-vacation", "name": "Slots Paradise Vacation", "name_original": "Slots Paradise Vacation", "description": "★★★DOWNLOAD SLOTS PARADISE VACATION - THE TOP TROPICAL CASINO SLOTS! ★★★ <br/><br/>Slots Paradise Vacation is a free video slots experience that transports you to tropical jackpot nirvana and charms your senses with games of chance!<br/><br/>Slots Paradise Vacation boasts slot machines with multiple paylines and generous payouts. We offer loose slot machines with that authentic Vegas, Macau, and classic casino slots feel. Strike it rich with our wide variety of reel styled slot machine games. New slots games will be frequently unlocked while our very progressive launch titles include an assortment ranging from Tropical Paradise to Twin Diamonds!<br/><br/>GAME FEATURES<br/>► You may be relaxing on a beachfront paradise vacation, but you're rocking the heights of Olympus! Doubledown and win Titan Fortunes with our Megabet opportunities!<br/>► Featuring everyone’s casino favorites – Bars, Bells, and 777 Wild Cherries with mega payouts! Multiple ways to win by matching Five of a Kinds, Big Wins, Mega Wins, and Epic Winning potential!<br/>► Make it rain – Random Wilds turn your reels into giant jackpots!<br/>► Match triple 777s to get blazing free spins and bonanza rewards!<br/>► Huge bonus rounds on every slot machine with massive payouts!<br/>► Free spin bonuses and scatter symbols on gorgeously animated reels that build progressive anticipation with each hit!<br/>► Uniquely themed free slot machines like Sizzling Triple 777s, Pharaoh’s Chamber, and The Wild West to name a few.<br/><br/>If you love great slots games, then you’ll love Slots Paradise Vacation! You’ll go crazy with your chance to hit big jackpots! Enjoy 777 wild cherries, free spins, bonus rounds, and multiple paylines with massive payouts.<br/><br/><br/>Slots Paradise Vacation is FREE, EASY to play, and easy to WIN BIG jackpots! Download today and enjoy the fortune tropics! Hit 777 wilds and win big in this tropical casino bonanza!<br/><br/>If you have any questions please reach out to us at: slotsparadisevacation@playrocketgames.com", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:00:47", "background_image": "https://media.rawg.io/media/screenshots/8f4/8f40ddd172dab896b27e4f57de435e90.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 132, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Rocket Speed - Casino Slots Games"], "genres": [], "publishers": [], "esrb_rating": null}