{"id": 223656, "slug": "big-city-life-simulator-pro", "name": "Big City Life: Simulator Pro", "name_original": "Big City Life: Simulator Pro", "description": "From the creators of the multi-million game Clash of Crime Mad San Andreas and World of Derby<br/><br/>It's time to conquer a larger city and show yourself in all its glory. To become famous, you will not be helped by weapons, shooting and leaving the police. Start your way with a simple worker and move up the career ladder. A huge number of tasks, missions, steep wheelbarrows in the game Big City Life: Simulator.<br/><br/>Features of the game Big City Life: Simulator:<br/>- Colorful models of characters, vehicles and buildings<br/>- HD graphics<br/>- Optimization of control for touch screens<br/>- More opportunities for the open gaming world<br/>- The endless sea of ​​gameplay<br/>- Absolute freedom of action<br/><br/>Features of the game process:<br/>- Create a character at your discretion<br/>- Dress the character in the latest fashion squeak<br/>- Go to the gym, swing your muscles<br/>- Follow the indicators of hunger and energy<br/>- Fulfill the desires and goals of the character<br/>- Get the rights and buy yourself a cool car, and better all<br/>- Became cool? Start buying property<br/><br/>Brief description of the plot of the game:<br/>The young guy came to a larger city, where he was faced with problems of survival, as the larger city requires more opportunities and money. He works on different jobs, gets a new experience, changing work at work. With a pizza dispenser, garbage removal, he is mastering new, more complex, jobs. At this stage, everything just begins in his new life in a larger city. Although it's not San Andreas and Los Santos, but you do not have to get bored at all.<br/><br/>We will regularly update Big City Life: Simulator, taking into account your suggestions. Do not forget to leave a review!", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-02T05:12:17", "background_image": "https://media.rawg.io/media/screenshots/e97/e97e05f5a17a6a74ffc54501cdba4686.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 179, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["CactusGamesCompany"], "genres": ["Racing"], "publishers": [], "esrb_rating": "Everyone"}