{"id": 2236, "slug": "energy-hook", "name": "Energy Hook", "name_original": "Energy Hook", "description": "From the inventor of the acclaimed web-swinging movement in *Spider-Man 2* comes the extreme sport of the future: Energy Hook! <br/>\n<br/>\r\nEnergy Hook athletes use their jury-rigged gravity beams to perform death-defying stunts. Fall great distances and use your momentum to launch yourself to dizzying heights! Run on walls, and perform loops, spins, and aerial tricks! <br/>\n<br/>\r\nYou play Delilah, Energy Hook athlete who is making a name for herself in a future transformed by gravity tech, teleportation, and climate problems. By proving yourself on the obstacle courses set up by the Energy Hook underground you'll gain street cred, giving you access to better gear and new levels.<br/>\n<br/>\r\nEnergy Hook challenges you to chain together sequences of tricks, wall-runs, and stylish moves for massive scores; hurtle through time challenges by using tricks to gain speed; and seek out collectibles hidden throughout the levels.<br/>\n<br/>\r\nMuch like a graphic novel might have different chapters by different artists, Energy Hook showcases the work of several different artists: the organic floating islands of Keegan O'Rourke; the dystopian future city of Killst4r; the soft, pastel colored buildings of Paul Whitehead; and the virtual realities of Antonio Revard.<br/>\n<br/>\r\nEnergy Hook has:<br/>\r\n* 6 sandbox levels with multiple challenges each (5 in early access)<br/>\r\n* 10 bonus challenge \"VR\" levels (6 in early access)<br/>\r\n* Dozens of challenges, from doing trick combos to getting best times and more<br/>\r\n* Compete on the leaderboards or just swing around, explore, and be Zen<br/>\r\n* Tune your energy line and jetpack in the equipment options screen<br/>\r\n* Rift support<br/>\n<br/>\r\nEnergy Hook is a challenging game that requires a great deal of finesse and practice to master! Do you have what it takes?", "metacritic": null, "released": "2016-07-05", "tba": false, "updated": "2019-08-28T22:15:46", "background_image": "https://media.rawg.io/media/screenshots/3e0/3e060edb916d3d78921d78f22fdbb925.jpg", "website": "http://energyhookgame.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 17}, "playtime": 1, "achievements_count": 37, "ratings_count": 0, "suggestions_count": 354, "game_series_count": 0, "reviews_count": 0, "platforms": ["PlayStation 4", "macOS", "PC", "Linux"], "developers": ["Happion Labs", "Happion Laboratories"], "genres": ["Action", "Sports", "Indie"], "publishers": ["Happion Labs"], "esrb_rating": "Everyone 10+"}