{"id": 223717, "slug": "vr-thrills-roller-coaster-360-google-cardboard", "name": "VR Thrills: Roller Coaster 360 (Google Cardboard)", "name_original": "VR Thrills: Roller Coaster 360 (Google Cardboard)", "description": "The ultimate VR Roller Coaster experience. NEW &amp; UPDATED version: one of the most popular VR games now features a , new 3D rides steel runner, fantasy &amp; alien music ride! Go beyond the rollercoater in new the Tycoon Mode!<br/><br/>Samsung Galaxy S8 (+) users please make sure to enable WQHD+ resolution for the best experience. Settings &gt; Display &gt; Screen resolution &gt; WQHD+ &gt; APPLY<br/><br/>This game features multiple Virtual Reality (VR) Roller Coaster rides. You're ultimate attraction / theme park VR app is one install click away. Dash over the rollercoaster track in VR or touch mode (non-VR). Download it for free.<br/><br/>►VR no gyroscope?<br/>No worries we got you covered. If you have a device without any gyroscope sensor please tilt your head left or right to rotate the view. You do not control the vr rollercoaster, but can view 360 degrees during you ride.<br/><br/>►Multiple rides<br/>Why settle for one roller coaster if you can enjoy many? Swing by your very own roller coaster park and going to be like being the tycoon of your own theme park and picking your own roller coaster ride when ever you feel like it!<br/>The rides come in different tastes and thrill level from all over the world. Pick a more classic cedar roller coaster edition or take the fastest high speed crazy ride and discover at what point you'll get queasy.<br/>We offer both recorded 360 videos of real rollercoaster rides and NEW an amazing interactive 3D roller coaster ride in a fantasy world that will make your jaw drop!<br/><br/>The 360 video rides come from real life footage making this a roller coaster simulation that is as real as any simulator can get. So download this free VR game now and have your own attraction park in your pocket when ever you feel like taking a roller coaster for a spin. Experience the roller coaster racing down the track at top speed in full 360 VR.<br/><br/>►Latest rides<br/>New in the 2018 a ground breaking new 3D VR roller coaster ride that interacts with live music. The all new Alien Music Ride puts you an a both relaxing and high speed ride that interacts and visualizes music. The track has fast ans slow sections and the blend into the environment makes it feel like taking a wingsuite our for a drive on a alien planet. Musically speaking your going to love this as you can first pick a genre including Pop, R&amp;B, or Dance en then start your ride aligned with the music. Please note that where the ride mentions 3D in the top corner of the tile the ride will offer a true 3d experience, as where it mentions Video the ride will be streamed through online video which requires an online Internet connection (wifi recommended).<br/><br/>►Compatibility<br/>The VR app is optimized for Android mobile phones and the use of Google Cardboard. We aim to support cheap and high-end devices. If you have issues correctly displaying the ride on your headset please first check if you enabled the Cardboard setting for your device correctly. You can usually scan a QR code to automatically enable the setting for your headset. Our known compatibility includes:  VRTX One, Stooksy, VR KiX, Durovis Dive, Merge VR, Refugio 3D, ANTVR, VR Smartview, ColorCross, VRTRIA, FIBRUM VR, VR View-Master, Nibiru. Please contact us if you have any issues.<br/>Furthermore you can use this app to enjoy the rides without any VR headset through touch controls as well.<br/><br/>If you like VR apps and games, and specifically thrilling VR Roller Coaster rides then this is a must download for you. 5, 4, 3, 2, 1... Get into the VR groove and claim your free VR Roller Coaster now!<br/><br/>___<br/>Find more on your AR / VR Discovery and join us on social media:<br/><br/>- Like us on Facebook<br/>- View our videos YouTube<br/>- Follow us on Twitter<br/><br/>", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-31T01:52:03", "background_image": "https://media.rawg.io/media/screenshots/32c/32c97dcc33270fcc280f85d5f8e88796.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 283, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Rabbit Mountain"], "genres": ["Simulation"], "publishers": [], "esrb_rating": "Everyone"}