{"id": 2237, "slug": "pocket-boxing-legends", "name": "Pocket Boxing Legends", "name_original": "Pocket Boxing Legends", "description": "Lace up your gloves and do battle with a colorful cast of hulking opponents, each with a unique fighting style.  Dodge, duck, and punch your way to victory in a rousing romp of old-timey arcade boxing action! Take on Jersey Joe, Moose McGee, Super Ivan, Mean Bean, Kimber Slash, Palooka Pete, Rasta King, and more!<br/><br/>Play in automatically rotated landscape or portrait mode with optional orientation lock.  \"Retro Mode\" offsets a stylized presentation with pixel art.<br/><br/>Pocket Boxing supports Game Center for leaderboards and achievements, and features multiple gameplay modes:<br/><br/>\"Training\" - go toe to toe with a defenseless heavy bag.  Learn basic play control, defensive techniques and punches.<br/><br/>\"Amateur Circuit\" - fight past three brawlers for a shot at going pro.<br/><br/>\"Road to the Title\" - battle your way up the ranks to seize the championship belt.<br/> <br/>\"Title Defense\" - battle new and returning boxers, to cement your status as a living legend.<br/><br/>\"Time Challenge\" - rematch unlocked boxers to improve your statistics, notch up opponent-specific achievements, or practice against specific opponents.<br/><br/>Attack with jabs, crosses, hooks, uppercuts, and body blows.  Your left jab is your fastest punch.  Your right hand hits harder.  Fill your power meter and unleash powerful uppercuts and hooks.  Keep your guard up to protect your face from jabs.  Dodge or duck big punches, then unleash brutal combinations while your opponent is off balance.<br/><br/>Video help is available as part of the \"attract mode\" by staying on the splash screen.<br/><br/>Touch the top-right corner of the screen in-game to pause.<br/><br/>Compatible with iCade and MFI controllers.", "metacritic": null, "released": "2009-12-29", "tba": false, "updated": "2019-10-22T14:07:57", "background_image": "https://media.rawg.io/media/screenshots/e32/e327e3d5df6c381eddf10419f367b8a4_N2ncCEp.jpg", "website": "http://www.northernbytes.ca/iphone/pocketboxer", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 271, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Easy 8 Software"], "genres": ["Sports", "Arcade"], "publishers": ["Easy 8 Software"], "esrb_rating": "Teen"}