{"id": 223792, "slug": "wizard-of-bingo", "name": "Wizard of Bingo", "name_original": "Wizard of Bingo", "description": "If you’re looking for bingo games free to play but you’re bored of those plain &amp; boring designs that do not offer any extras or goodies? This is the bingo heaven for all the lovers of the game and intrigued by the mystical magic world of powerful wizards, fairies, and enchanted forests decorations.  Explore our several rooms &amp; dungeons; you’ll be able to play online modes and also offline, so you’ll be able to play every time and everywhere you want. Enjoy our mix of Loteria bingo modality and have fun with other players around the world. Don’t worry; you can also spend tons of hours of fun with the classic bingo rules, video bingo, and many new modalities for keeping you entertained and enjoying the most trendy bingo fever classics. Come to live the best bongo experience available in the market!<br/><br/>🎇💰🎇 Be ready for the best mix of bingo slots party! Dive into to the world of bingo maniacs to win incredible tournaments! Download NOW Wizard of Bingo-Bonus Magic for Free on Google Play Store!!! 🎇💰🎇<br/><br/>Live the thrill &amp; furor of the live action in our videobingo mode! Play online tournaments with players from around the world. With our always growing community, there will always be lots of players to enjoy the pop of the bingo screams! Setup private parties with your friends and family to arrange your own tournaments! Discover who the super lucky winner is! Try your luck in every single room of the tons of themed rooms available for you. No deposit is needed, you can enjoy the entire game absolutely with no cost. Our free social bingo offers you the chance to play &amp; enjoy the blitz of super boosters and double ups so you can double your chances to win &amp; increase your bets easily! Collect special charms, spells, and medals that you can trade for skins &amp; themes for your bingo cards! Daub up to 4 cards at the same time if you dare! The witch of the north will try to enchant your numbers, making them barely visible, so watch out!  <br/><br/> 🎊🔮🎊 Play in the most Fast-Paced number calls &amp; Gameplay! Forget about those boring waiting times! Interact &amp; chat with other users but don’t get distracted! A wrong call will take lots of coins and points! Download NOW Wizard of Bingo-Bonus Magicfor Free on Google Play Store!!! 🎊🔮🎊<br/><br/>To break the spells &amp; move forward on the yellow brick road, you’ll have to gain experience and beat other players. Your anti spell protection will become stronger once you are closer to the castle. Our bingo bango bongo  VIP room is reserved for the high betting players, so be sure to gain good amounts of lucky charms to avoid losing all! We love our community of users, that’s why; we’ll be integrating soon our version of fringo, but with our magic &amp; Oz particular touch. Daub up, double &amp; split your cards or bets while enjoying our wonderful world full of magic and amazing characters! Give a rest to your eyes, our HD graphics, and big number cards will help you to spend unlimited hours of fun! Join to players in America, Europe, &amp; the entire world! Begin your bingo craze career &amp; be ready to claim your victory! <br/><br/>👑🏰👑 Join our weekly special events &amp; tournaments! Gain XP faster by climbing in our online leaderboards! Let the bash begin NOW withWizard of Bingo-Bonus Magic for Free on Google Play Store!!! 👑🏰👑<br/><br/>*** Features of the Game***<br/><br/>🎇 Totally FREE to play, no deposit required.<br/>🎇 Always New Content for you!<br/>🎇 Live Action 24/7! <br/>🎇 Tons of Thematic rooms &amp; Game Modes<br/>🎇 Fast-Paced Action &amp; Intuitive Controls<br/>🌟 Begin your bing games career while enjoying a world full of magic! Download: Wizard of Bingo-Bonus Magic FREE for a Short Period Only! 🌟<br/><br/>This game is intended for an adult audience (21+) for amusement purposes only and does not offer \"real money\" gambling, or an opportunity to win real money or prizes based on game play. Playing or success in this game does not imply future success at \"real money\" gambling.", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-30T21:12:14", "background_image": "https://media.rawg.io/media/screenshots/f16/f160fa66e2bfcf4d2226357d967f1ebc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 156, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Dynamic Games"], "genres": ["Board Games"], "publishers": [], "esrb_rating": "Teen"}