{"id": 22374, "slug": "yonder-the-cloud-catcher-chronicles", "name": "Yonder: The Cloud Catcher Chronicles", "name_original": "Yonder: The Cloud Catcher Chronicles", "description": "<p>Yonder is set on the vast island of Gemea, a lush frontier with eight distinct environments ranging from tropical beaches to snow-capped summits. Each location has its own flora and fauna, along with changing seasons and a day-night cycle.  Gemea, once a paradise, still maintains the appearance of one, yet an evil murk has enshrouded the land and its people in despair.<br />\nAs the hero you will explore Gemea, uncovering the island&#39;s secrets and the mysteries within yourself as you embark on a journey of self-discovery. On a quest to become the island’s champion, you join forces with Sprites, creatures who are the only thing capable of dispersing the murk, to save Gemea and its people.<br />\nThe towns of Gemea are filled with kind-hearted residents who have faced many difficulties since the murk arrived. By contributing to the island through farming, crafting, cooking, fishing and brewing, relationships can be built with the locals, who offer everything from resources to a new farm as rewards.<br />\nAt the heart of Yonder, is a game that delivers a sense of discovery, wrapped in a familiar yet unique adventure.Features:A vibrant open world full of things to discover and places to explore.<br />\nSet your own pace; trail-blaze across the world or settle down for a spot of quiet fishing and farming.<br />\nExtensive character customization.<br />\nMaster professions like carpenter, chef, tailor and more to help the residents of Gemea.<br />\nCraft and trade items to solve puzzles as you banish the murk from the island.<br />\nBefriend and adopt endearing creatures.<br />\nBuild and harvest multiple farms across 8 diverse biomes, ranging from grasslands through dense forest, Caribbean tropics and more.<br />\nSet in a welcoming world you&#39;ll want to visit again and again<br />\nMultiple creative routes to achieve objectives.<br />\nA dynamic living world – seasonal changes affect routes, animals migrate, day/night and evolving weather conditions affect the world.<br />\nSpend time doing what you want: fishing, farming, crafting, questing, picking up rocks.  It’s all up to you!</p>", "metacritic": 70, "released": "2017-07-17", "tba": false, "updated": "2023-07-21T19:24:51", "background_image": "https://media.rawg.io/media/games/abc/abc43ccc7f4647691356f8782823a59e.jpg", "website": "https://www.yonderchronicles.com/", "rating": 3.49, "rating_top": 4, "added_by_status": {"yet": 21, "owned": 266, "beaten": 29, "toplay": 32, "dropped": 26, "playing": 4}, "playtime": 4, "achievements_count": 298, "ratings_count": 57, "suggestions_count": 296, "game_series_count": 0, "reviews_count": 61, "platforms": ["PlayStation 4", "Nintendo Switch", "Xbox One", "PC"], "developers": ["Prideful Sloth"], "genres": ["Action", "Adventure"], "publishers": ["Prideful Sloth"], "esrb_rating": null}