{"id": 223874, "slug": "easter-bunny-bingo", "name": "Easter Bunny Bingo", "name_original": "Easter Bunny Bingo", "description": "Welcome to the best live bingo experience in the world! Because we know the Easter is blitz bliss, we proudly introduce you the totally renewed holyday themed game, with tons of Easter decorations, music, and animations to cheer your gameplay with your favorite holydayof the year! Play in our different hall rooms and enjoy playing with other Easter hunt enthusiasts the 365 days of the year! Don’t you want that Easter last a little bit longer?  Play Loteria bingo tournaments and have unlimited hours of fun with the classic bingo rules and different new modalities to discover. Try the real bingo experience in the multiplayer bingo challenges, the new bingo slots mix, and many other Easter Bunny gifts that are waiting to you! <br/><br/>Our responsive &amp; quick interface ensures a high quality gaming experience, with stunning St. Valentine's animations, themed bingo cards, gifts, and much more surprises! Pop &amp; classic Easter Bunny Bingo festivale music will be playing in the background to complete the romantic sensation!  Earn special trophies &amp; medals as special achievements; with them, you’ll be able to unlock more play rooms like Luna park bingo and many other funny animated bingo cards.<br/><br/><br/>Win amazing bonus, free chips &amp; more while the color blast of Easter hunt amuse you! Are you ready to live the bingo! scream? Download NOW Easter Bunny Bingo on Google Play Store!!!<br/><br/>Dive into our offline rooms, where you’ll be able to play without having an internet connection. Play with no worries, as you can playbingo with no deposit requests, all the game is free!<br/><br/>*** Features of the Game***<br/><br/>- No deposit required, all content is free<br/>- Online Leaderboards<br/>- Several Rooms and a Lobby to Chat<br/>- Low battery &amp; Memory Consumption<br/>- Offline Mode!", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-31T00:58:51", "background_image": "https://media.rawg.io/media/screenshots/5b5/5b5b4cfb536e971486f03c3171c99dfd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 70, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Dynamic Games"], "genres": ["Board Games"], "publishers": [], "esrb_rating": "Teen"}