{"id": 223826, "slug": "goosebumps-horrortown-the-scariest-monster-city", "name": "Goosebumps HorrorTown - The Scariest Monster City!", "name_original": "Goosebumps HorrorTown - The Scariest Monster City!", "description": "Celebrate Halloween with our limited-time updates<br/>R.L. Stine's \"Goosebumps\" monsters have come to terrify your phone! You choose whether to join or fight Slappy the Dummy in this creepy build simulator! In Goosebumps HorrorTown, you can build a gruesome city full of mystery and fill it with scary undead monsters from the horror book series. The most frightening and demented villains await for you: are you brave enough to face your grisly terrors?<br/><br/>The game features original content that will terrify and delight Goosebumps fans, with animations and missions for both humans and monsters in this city builder. The more experience you gain, the more new content you unlock, including bloody creatures or spooky buildings to get new resources. Make your town grow and discover chillingly fun new adventures! Stop the evil creatures that fill this villa as if it was Halloween from unleashing the worst havoc and survive!<br/><br/>BEWARE... YOU CHOOSE YOUR SIDE! <br/> - Play as human: you can spy on monsters to find out what's going on in their town. Collect resources, build secure zones, investigate monster activity and explore the map to unlock new areas and adventures! Defend yourself against the monsters and hide to survive! Find the best strategy to avoid being detected! Your neighbor needs your help to clear off the surroundings from zombies and ghosts!<br/> - Play as monster: gather a scary squad of sinister creatures and terrify townsfolk! Bring your darkest nightmares to life in this simulation. You can scare humans to obtain materials and add new Goosebumps monsters and evil beasts. You can hide in the shadows or follow humans in the streets!  <br/><br/>KEY FEATURES FOR THIS HORROR ADVENTURE<br/> - Build and manage the city of terror! Death surrounds this simulator: don't die of fear in this horror madness!<br/> - Raise your own town and fill it with haunted constructions, frightened humans and condemned souls from hell!<br/> - Create a complete collection of Goosebumps monsters: you can choose from a huge variety of creatures, from terrifying mutants and scary vampires to gruesome beasts and creepy skeletons! Get the most terrifying collection of beasts ever!<br/> - Over 100 playable characters! A nasty mummy coming from its tomb, a bloody phantom in search of vengeance or an evil gnome that will curse the neighborhood!<br/> - Craft and sell new items! Unveil the darkest secrets of this spooky town before you end in the tomb!<br/> - Scare humans to collect special materials! Spread the monster doom all over the greatest terror town full of terrible beasts!<br/> - Run from a werewolf, zombies or ghosts in this construction and survival simulator! Will you be able to survive another gruesome night or will you just let them catch you?<br/><br/>Are you ready to face the horrors and creepy mysteries of Goosebumps? Kill your fears while you keep building in this never-ending horror simulator!<br/><br/>Download today to enter this condemned and haunted horror city...if you dare.<br/><br/>™ &amp; © Scholastic Inc. SCHOLASTIC, Goosebumps and associated logos are trademarks of Scholastic Inc. All rights reserved", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:00:01", "background_image": "https://media.rawg.io/media/screenshots/46d/46d388b9191cc0ae820d92dcaf3ce49c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 361, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Pixowl"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}