{"id": 223801, "slug": "bejeweled-stars-free-match-3", "name": "Bejeweled Stars: Free Match 3", "name_original": "Bejeweled Stars: Free Match 3", "description": "Experience endless fun and unique challenges every day in a beautiful world filled with surprises, explosions, and playful puzzles. Combine sparkling gems to earn rewards, create boosts when you need them most, uncover collectible emojis to express yourself, and even control the game board itself as you play. Free to download.<br/><br/>DISCOVER AMAZING CHALLENGES <br/>Bejeweled Stars comes to life with exciting twists and distinctive ways to play. Master moving Currents of gems to enhance your matching strategy. Maneuver gem-filled Clouds around the board, causing winning cascades. Rescue floating butterflies before they slip away into the sky.<br/><br/>EARN, COLLECT, AND SHARE BEJEWELED EMOJIS<br/>Open chests to reveal exclusive and delightful Bejeweled emojis that let you express your own style and send personal messages. There are hundreds to enjoy as you play!<br/><br/>CREATE GAME-WINNING BOOSTS<br/>Collect brand-new SkyGems and use them to create special boosts. Use the Star Swapper to blast through difficult spots. Shuffle the game board for new matches with the Scrambler. Deploy the boosts you want, when you want them, and perfect your winning strategy. <br/><br/>LIGHT UP THE NIGHT SKY<br/>Earn shining stars with every level you play. Watch as they fill Constellations in the sky and unlock amazing rewards!  <br/><br/>BECOME A STAR <br/>Looking for some friendly competition? Each level has its own leaderboard, making it easy to track progress in the game, compete with friends, and show off your powerful skills.<br/><br/>Go to your shiny place in this brand-new matching experience that takes you far away from the everyday.<br/> <br/><br/>Important Consumer Information:Requires acceptance of EA’s Privacy &amp; Cookie Policy and User Agreement. Contains direct links to the Internet and social networking sites intended for an audience over 13.<br/>User Agreement: terms.ea.com<br/>Visit http://help.ea.com/en/ for assistance or inquiries.<br/>EA may retire online features after 30 days’ notice posted on www.ea.com/1/service-updates.", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-31T07:30:11", "background_image": "https://media.rawg.io/media/screenshots/123/123311f81f640b31fb7909b2b191af46.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 105, "game_series_count": 8, "reviews_count": 0, "platforms": ["Android"], "developers": ["Electronic Arts"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": "Everyone"}