{"id": 223802, "slug": "tropical-beach-bingo-world", "name": "Tropical Beach Bingo World", "name_original": "Tropical Beach Bingo World", "description": "Welcome to the Bingo heaven for all those who love bingo, and willing to relax playing your favorite game with nice environmental paradisiac islands. Play &amp; explore our several rooms and enjoy offline or online modes, so you’ll be able to play every time and everywhere. Play Loteria bingo tournaments with other players around the world and have unlimited hours of fun with the classic bingo rules and many other new modalities to discover. Try our quick &amp; friendly interface integrated into our online bingo; you’ll never suffer delays anymore! Enjoy a real bingo experience in the multiplayer bingo challenges, stay sharp and don’t miss a number! Try also the new bingo slots mix, where you’ll find the best of the Vegas world combined in just one app! <br/><br/>🌴 🎰 🌸 Be ready for a Tropical Paradise Island Bingo Party! Enter to the world of bingo maniacs and begin to win amazing prizes! Download NOW Tropical Island Bingo World for Free on Google Play Store!!! 🌸 🎰 🌴 <br/><br/>Feel the furor or all the live action in our videobingo mode, send gifts to your friends and invitations to participate in private parties you can setup. Challenge your family and discover who the real champion is! Have a bash with the intuitive in-game amenities, spin the daily wheel of fortune and earn amazing boosters to double your earnings each time you get a number! Try our free social bingo; our always growing community is always ready for playing 24/7. You’ll never skip a blitz action day! Change the colors &amp; themes of your cards as you please, and unlock new amazing skins by earning medals and special achievements. Collect valuable items by making winning strikes. The more consecutive wins you manage to gather, the more rewards you’ll obtain! <br/><br/>🌴☀💰 Juice up the fun! Play in Fast-Paced number calls, where you’ll have to put to tests your senses to avoid missing a number! Wrong call will make you lose your boosters &amp; extra points! Let the fun begin today! Download NOW Tropical Island Bingo Worldfor Free on Google Play Store!!! 💰☀🌴<br/><br/>Dive into our offline rooms, where you’ll be able to play without having an internet connection. Play with no worries, as you can playbingo with no deposit requests, all the game is free! Pop the beach &amp; pina colada hidden figures during the gameplay to earn some special bonus goodies. Stay tuned with our constant updates, as we will be integrating soon a fringo modality for you to play with delicious tropical fruits! If you think you can handle it, you can have fun daubing up to 4 cards to increase your chances of winning. You can make custom bets on each card. Double daub when you feel the lucky is on your side &amp; be the biggest winner! Join the Havana special VIP club room, where the bets are higher, only for the best players daring to place huge bets!  Let the fun begin now!<br/><br/>🌴☀💰 Feel the Paradisiac golden sun &amp; be part of wild party bingo community! Join our weekly special events and climb our online leaderboards! Start playing NOW Tropical Island Bingo World for Free on Google Play Store!!! 💰☀🌴<br/><br/>*** Features of the Game***<br/>☀ Absolutely FREE to play, no deposit required.<br/>🌴 New Content in Our Updates<br/>☀ Play alone &amp; with players around the world<br/>🌴 Video Bingo Special Rooms<br/>☀ Super High Quality Graphics &amp; Friendly UI<br/><br/>🌟🌺 Begin your superstar career while enjoying the relaxing beaches! Download NOW FREE Tropical Island Bingo World for a Short Period Only! 🌺🌟<br/><br/>This game is intended for an adult audience (21+) for amusement purposes only and does not offer \"real money\" gambling, or an opportunity to win real money or prizes based on game play. Playing or success in this game does not imply future success at \"real money\" gambling.", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-31T07:11:19", "background_image": "https://media.rawg.io/media/screenshots/1c8/1c85a15ebff8f2b8f368de8e93cb183d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 82, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Dynamic Games"], "genres": ["Board Games"], "publishers": [], "esrb_rating": "Teen"}