{"id": 22392, "slug": "warhawks", "name": "Warhawks", "name_original": "Warhawks", "description": "Fly in some of the most notable air battles of WWII in powerhouses of the sky. This fully 3D VR experience puts you behind the stick of a P51 mustang air fighter to defend and destroy key targets in the allies’ fight against the axis powers. <br/><br/>Using real satellite scans and geographic data, Ghost Machine has recreated an immersive historical time machine which takes players back to 1944 during the height of conflict with airbourne axis powers.<br/> <br/>Get briefed in the War Room by the top military agents before you fly over detailed European villages and defend your troops against an armored stronghold that is quickly moving against your forces. Find yourself in the middle of challenging dogfights where only your aim and the control of your plane will get you out alive. One thing is certain: war will never be the same again.<br/><br/>Fight either by yourself will partner team AI, or with friends via online multiplayer as the resistance, or turn your allegiance and become one of the alien swarm that vows to destroy the human race with advance technology and firepower. <br/><br/>For those brave enough to join the battle with the Oculus Rift, a complete VR version of the game will put you directly in the action as you experience firsthand mission control where you receive your mission briefing and train to destroy the enemy. Complete VR immersion can be experienced with in-game VR menus, HUDS, and fully immersive 3D cockpits with working controls and gauges.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T22:07:34", "background_image": "https://media.rawg.io/media/screenshots/859/85921a2c0c7b0298c71cf8de25d60fad.jpg", "website": "http://www.ghostmachinevr.com/#!warhawks/c204u", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 279, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ghost Machine"], "genres": ["Action", "Indie"], "publishers": ["Ghost Machine"], "esrb_rating": null}