{"id": 223917, "slug": "ocean-nomad-survival-on-raft-2", "name": "Ocean Nomad - Survival on Raft", "name_original": "Ocean Nomad - Survival on Raft", "description": "<p>Ocean Nomad is a new release in the series of ocean survival games with new enemies, items, rpg elements, survival on an island and ocean exploration on a boat. Build and upgrade your raft for survival in the sea, defend it from sharks and explore the vast world around. Try all our awesome survival simulator games rolled into one!<br />\nFeatures of our game:<br />\n☆hundreds of weapons and items<br />\n☆open world exploration<br />\n☆realistic 3D HD - graphics<br />\n☆survival on islands<br />\n☆improved raft building<br />\nTips for apocalypse survival:<br />\n🌊Catch items and resources with you hook<br />\nLots of useful resources in shark games are right under your nose. Chest and barrels floating around always contain vital resources for survival on in the sea and wreckages are really good material for raft building in ocean games. You might even find items, tools and weapons for defense of the raft, so keep on throwing the hook!<br />\n🔫Craft weapons and armor<br />\nA prey can easily change the rules and become a hunter in shark games. Make a hard choice among hundreds of guns, two - handed blade weapons and armor parts to defend you floating base and hunt sharks. Craft a perfect arsenal and always be ready for the battle.<br />\n⛵️Defend your raft<br />\nBe ready to evolve and fight for survival in the sea with a double effort, now that you’ve got one more problem to deal with. The shark is now joined by swimmers from other survivor games and eager to attack the raft. No man can tame a shark and there’s nowhere to escape, so prepare for shooting and swinging all night and day long!<br />\n🔨Build and upgrade<br />\nPay attention to the condition of your raft on the water in survival games in the ocean. It’s not enough to tie together a couple of wooden planks without a roof or even walls to feel safe. Be creative and expand the raft free in height and width, because the only limit for building in survival simulator games 2018 is your imagination. There’s also a lot of upgrades for fishing, storage space extension, that you can improve the floating shelter with to help you survive in the ocean.<br />\n🛶Explore the ocean<br />\nEver wondered if there’s lost land with forest woods, jungle and animal pets in this ocean without end? An awesome feature of our island survival games free is now implemented in this one. Don’t sit idle — dare to explore the ocean and islands around. What do they hide: horror or glory, medieval royale treasures or wild tigers and scary dinosaurs from the jurassic age or even an old airplane wreckage? What&#39;s more you can find resources, upgrades for the raft and other items on the islands. You won’t need a ship or an ark to sail to them in shark games — a simple boat will do, and may the stars be your guide.<br />\n🌋Learn the story of the apocalypse<br />\nAn unknown devastating cataclysm turned the world into an endless ocean and last survivors are locked on scattered islands like in prison, dreaming of finding their home. The quest of our raft game is to find them and discover the truth of what happened, find other people who could survive and join them.<br />\n🦈Survive on a raft<br />\nThe latest release of our offline survival simulator games is full of evolved enemies, new items and other features that will surprise everybody. Download Ocean Nomad game and embark on an epic survival adventure. Play with no wifi or internet connection, last as many days as you can and share the results online with friends!<br />\n<em>Attention:</em> We are not affiliated with the developers of the original Raft game.<br />\nOur company Unisoft Games has full rights to use the RAFT trademark in the USA (The Mark Consists of Standard Characters without claim to any particular font style, size or color - Ser. No. 87-605,582 FILED 09-12-2017)</p>", "metacritic": null, "released": "2018-12-31", "tba": false, "updated": "2024-03-02T17:15:07", "background_image": "https://media.rawg.io/media/screenshots/b72/b72677cf21ccc894da926aac0efb7d0b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 126, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["UniSoft Games"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}