{"id": 223939, "slug": "stickman-revenge-3-ninja-warrior-shadow-fight", "name": "Stickman Revenge 3 - Ninja Warrior - Shadow Fight", "name_original": "Stickman Revenge 3 - Ninja Warrior - Shadow Fight", "description": "⚔️⚔️⚔️ Stickman Revenge 3 - The spectacular return in Stickman games series toppled the international game market. <br/><br/>The followers of Stickman games still have not forgotten the feeling of tight guillotine and ecstatic graphics of Stickman Legend old version. And what would you expect in a recent version of Stickman fight and this revenge? Whether this revenge will end or not? <br/>Stickman Revenge 3 will come back with a new look, new Stickman characters, new Stickman skills, new stick pets. Be ready to wipe out the enemy – cruel monster and their obstacles by unprecedented features in Stickman Revenge 2<br/>Stick War deserves as one of the best stickman games worth playing ever.<br/><br/>⚔️⚔️⚔️Graphics have been updated to a new level in this Stickman game<br/>Continuing the success of images in the old Stickman Games, the new League of Stickman version will impressive with absolute contrast and dramatic color and attract the players with each kinds of Stickman warriors, pet system and each stick war.<br/>The maps in Stick War be continuously updated, graphics transformation on each other maps only in Stickman Warrior.<br/>Each map of this Stickmen with different theme help you have wonderful experience: Ninja theme, Dark swords them, Gravity theme, the forest theme, dead land theme, Warriors theme, the Shadow fight theme, and the land of Demon theme,…<br/><br/>⚔️⚔️⚔️Heroes system was upgraded, diversified and INCREDIBLE than ever <br/>Heroes system - League of stickman has 6 Stickman in 6 different styles.<br/>Each Stickman has his own fighting feature and uses the different weapons like stick war, stick gun and special Heroes like Ninja or Shadow Fight, and how to each stickman fighting that brings the whole new experience for players.<br/><br/>⚔️⚔️⚔️ Pet system is diversified <br/>With Stickman Revenge 3, the Heroes have been retrofitted Pet system unprecedented in Stickman 2 version.<br/>Pet types are: Angels Stick, Ghosts Stick, Dogs Stick, Pigs Stick and Butterfly Stick which will increase the bonus and score and gain more coin in the runway for Stickman. They are also great warriors.<br/><br/>⚔️⚔️⚔️Unique skill system for each Character ins this Stickman Game<br/>Skills help Stickman increase their power many times and wipe out the enemies at a glance in each Stick War. The warriors can also use Stickman special skills to destroy the monster faster like stickman gun, stickman fighting,… in each Hero. <br/><br/>⚔️⚔️⚔️Cruel Boss system was unprecedented in precedent<br/>In Stickman Revenge 3, Stickman and Stickman warriors not only have to confront the monsters with various shapes and different mode of attack, but Stickman also to destroy the most dangerous Group Boss Monster with incredible power. <br/>Competitive Leaderboards in this Stickman Fighting Games<br/><br/>We offer Stickman games world leaderboard and friend leaderboard. You can compete with your friends or other players around the world. Beat all others and be the Champion!<br/><br/>Why not download Stickman Revenge 3 right now and be the best League of Stickman to continue the revenge journey for Stickman and his family, destroying the bloodthirsty monsters in the dark world. This is one of Ninja games you just cannot miss. <br/><br/><br/>Download Stickman Revenge 3 and share your experience with us in Stickman fight <br/><br/>fanpage: https://www.facebook.com/game.stickmanrevenge/", "metacritic": null, "released": null, "tba": false, "updated": "2024-01-05T22:59:13", "background_image": "https://media.rawg.io/media/screenshots/c99/c999751c4ca2d1700d443b4ffe2a37a6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 276, "game_series_count": 0, "reviews_count": 2, "platforms": ["Android"], "developers": ["Zonmob Game Studio"], "genres": ["Action"], "publishers": [], "esrb_rating": null}