{"id": 223929, "slug": "crash-derby", "name": "Crash Derby", "name_original": "Crash Derby", "description": "Crash Derby is the ultimate derby driving simulator! There is no racing here, your aim is to destroy your opponents using any means possible. You’ll be thrown straight into the arena where the last car that survives will be declared the winner.<br/><br/>The destruction of your fierce rivals can be achieved using the many traps and hazards in the arena of simply by using your battle car as a good old fashioned battering ram! Crashing and traps cause damage to rival cars and you can track how much you’ve damaged your rival by checking the health meter above each car.<br/><br/> Crash Derby Features <br/>• Fun, but realistic car handling.<br/>• Extreme car physics engine - crashes, pile-ups and traps react explosively!<br/>• A huge selection of crazy and colourful derby cars.<br/>• Fun, trap-filled arena environment with crowds of derby fans.<br/>• Collect power-ups to give yourself the edge! Replenish your car health or increase ramming damage for even more extreme crashes.<br/>• Collect those dollar bills to spend in the Demolition Derby Shop, you’ll need to upgrade your car as each level you’ll be taking on tougher and more extreme rivals.<br/>• Choose between normal and phone accelerometer steering.<br/>• Keep an eye on what’s coming behind you using the eye in the sky super mirror! You’ll need to use this regularly to become a crash derby driving master!<br/>• 14 Levels of extreme destruction, risky racing and devilishly fun driving action.<br/><br/> Environment Features <br/>• Explosive barrels - try to push your enemies into them while you drive away and watch the explosions!<br/>• Avoid the huge blue marbles of death! Use them against your opponents to cause maximum damage!<br/>• Push other cars into the path of the Big White Truck, let them do the hard work for you!<br/>• The deadly power grinder! - The ultimate trap, one touch of this and you’re dead! Stay well away or try to use it’s awesome power on your rivals.<br/><br/> Crash Derby Store! <br/><br/>Use your hard-earned racing dollars to upgrade your trusty destruction derby car. You’ll need the best car possible once you start taking on the derby pros! Each upgrade has three levels - try to max each one out to have a chance on level 14!<br/><br/>• Health - how much damage your derby car can take before being completely destroyed. You better upgrade this quickly because you’re going to be hit a lot!<br/>• Steering - effects how agile your car is and how quickly you can steer. Essential to avoid those crazy ramming rivals and make tight turns around killer traps and deadly marbles.<br/>• Acceleration - get up to top speed more quickly, you’ll be able to race past other drivers and pull away from danger before it’s too late.<br/>• Right Time - You’ll be spending a lot of time on your roof after crashing and pile-ups, upgrade this to get on your wheels faster!<br/>• Sponsor - Get more lovely money! Each upgrade means you’ll pick up more cash every time you find a money power-up.", "metacritic": null, "released": "2015-01-30", "tba": false, "updated": "2019-10-22T14:14:23", "background_image": "https://media.rawg.io/media/screenshots/4f9/4f9060d5ddac7a70e8296feef899f164.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 271, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "Android"], "developers": ["FOG.COM", "freeonlinegames.com"], "genres": ["Action", "Racing"], "publishers": ["FreeOnlineGames.com FZE"], "esrb_rating": "Teen"}