{"id": 223927, "slug": "the-tribez-kids", "name": "The Tribez Kids: Take care of Stone Age pets!", "name_original": "The Tribez Kids: Take care of Stone Age pets!", "description": "Can you believe you can adopt and take care of a real baby Dino? In this magic world you can! He is so funny and adorable! His fluffy friends - a Beaver Kit Justin, a Mammoth Calf Sophie and a Tiger Cub Sarah - also need your attention! Adopt a pet and play with it: wash, feed, sing to sleep, dress up and customize its home. Each animal has its own unique personality, hobbies and favorite locations. <br/><br/>Dino is the lead of this squad - he is the strongest and oldest of all. He loves his small garden and wants to create the most beautiful living environment! Design the tree cut, choose the pattern for the fence and decorate Dino’s home. Don’t forget to feed him a lot - the bigger snack he gets, the longer you can play fun games with him!<br/><br/>Sarah the Tiger is a real fashionista! Dress her up in the most amazing outfits. Her closet won’t make you bored! Change her style the way you want: choose among tons of trendy accessories and crazy clothes. Sarah loves fishing - help her catch the biggest and yummiest fish! Guess who is the most talented dancer and puts the floor on fire? Sarah is! Be her drummer and let her dance to the beat - what a show!<br/><br/>Sophie the Mammoth is the cutest little creature, whose kawaii eyes will definitely melt your heart! He lives in the snowy North where Christmas never ends. Fluffy Sophie wants to change her style and her white fur is a perfect canvas for a makeover! Choose hot colors and crazy patterns for her new trendy look. Don’t forget to play Sophie to keep her entertained!<br/><br/>Justin the Beaver is the real champion in swimming and finding underwater treasures! He cares about nature too! Help him clean his river from trash and find even more treasures! Justin loves drawing, creating stunning tree sculptures and decorating his house. But sometimes he gets messy - wash him with soap and sponge!    <br/><br/>Play the cutest pet care game since the Stone Age:<br/>· Adopt a baby animal from the Stone Age!<br/>· Bath, feed, sing to sleep and play with four adorable pets!<br/>· Pay attention to their stats and make your virtual pet friends happy!<br/>· Help Dino get rid of spooky spiders and bats in his cave!<br/>· Choose the crazies outfits and accessories for Sarah the Tiger!<br/>· Play hide-and-seek with Timmel the Mammoth and find all his friends!<br/>· Discover stunning underwater world and help Justin the Beaver find treasures!<br/>· Use your artistic skills and get super creative with house decorations!<br/>· Play every day to open new style items for your Stone Age pets!<br/>· Watch fun videos for kids and get exciting rewards!", "metacritic": null, "released": "2018-08-02", "tba": false, "updated": "2019-10-22T14:05:58", "background_image": "https://media.rawg.io/media/screenshots/a14/a1480d10c4bd72417f14a0866beb9d5d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 97, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Game Insight"], "genres": ["Adventure", "Simulation", "Family"], "publishers": ["Game Insight UAB"], "esrb_rating": null}