{"id": 223978, "slug": "galaxy-defense-tower-game", "name": "Galaxy Defense (Tower Game)", "name_original": "Galaxy Defense (Tower Game)", "description": "░░░░░░███████ ]▄▄▄▄▄▄▄▄▃<br/>▂▄▅█████████▅▄▃▂<br/>I███████████████████].<br/>◥⊙▲⊙▲⊙▲⊙▲⊙▲⊙▲⊙◤            <br/><br/>Galaxy Defense – The best Tower Defense game for android ever! This game is very wonderful and special in this Strategy game category!<br/><br/>Let's play this TD Game, you'll be a powerful general who making strategy wisely to command cannons and defend the tower against waves of aggressive enemies. This Tower Defense game has diversified mission system with many levels of difficulty waiting for you to conquer.<br/><br/>This TD Game is one of the best strategy / arcade games that you should play! <br/>You may have played many of Tower Defense games, but Galaxy Defense has tons of different challenging maps. Each map has its own unique that always ready to test your skills. This Tower Defense must be the best one you ever have.<br/><br/>Galaxy Defense has old-school design but whole new missions. You will don’t feel bored when playing it like other Tower Defense Games. <br/>Galaxy Defense is a 100% free tactical game.<br/><br/>### FEATURES<br/>+ Strategy of game is not easy <br/>+ 21 Missions for your Defender<br/>+ 21 maps Tower<br/>+ 16 Towers Defender<br/>+ 16 Enemy units<br/>+ Diversity of maps, never get bored.<br/><br/>### TIPS<br/>+ Consider carefully where to place you defensive units<br/>+ Prepare carefully strategy for the first waves coming<br/>+ Never forget to upgrade your defense system<br/>With this Tower Defense, The Defenders can challenge themselves with every big battle in difference map and speed up the game to feel the excitement.<br/><br/>Keep your Tower safe during the war. Destroy all enemies and protect your Tower is your mission. Please keep your spirits and fight hard!<br/><br/>Applications should be granted the following permissions:<br/>+[READ_EXTERNAL_STORAGE, WRITE_EXTERNAL_STORAGE]: Permission to save necessary game data externally<br/>+[GET_ACCOUNTS] This right is need for the linkage and notification between your game account and google account information.<br/>+[READ_CONTACTS, READ_PHONE_STATE] Permission to sync your Address Book and access device status for Friend Invites.<br/><br/>With vivid sounds and colorful effects and, this Evolution TD will bring a real fierce battle to player’s experience. Don’t miss the chance to have amazing experiences with Tower Defense – one of the most awesome Strategy game in the world.<br/><br/>Download Galaxy Defense, just become a best Legend of Defender, enjoy and have fun!<br/><br/>Keep in touch with us:<br/>- Facebook: http://www.facebook.com/TDefense<br/>- Youtube: https://www.youtube.com/c/ZonmobGameStudioOfficial", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:59:35", "background_image": "https://media.rawg.io/media/screenshots/747/74702652fddf8cf66fa374274089f7f0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 215, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Zonmob Game Studio"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}