{"id": 223910, "slug": "san-andreas-real-gangsters-3d", "name": "San Andreas: Real Gangsters 3D", "name_original": "San Andreas: Real Gangsters 3D", "description": "Building up your criminal empire pays of in San Andreas: Real Gangsters 3D<br/>It's all California love in this awesome crime game from VascoGames , in San Andreas: Real Gangsters you have one goal. And that is to build up your crime empire, dive into the criminal underworld of this big city. Just getting out of jail you have two options dive into the criminal live again or behave. But life on the streets of San Andreas is tough man, living on these California streets will ask the most out of you. Gang wars, gangsters, pimps and more rule this streets. So in order to survive you need to take control, get the crooked police out. Fight of rival gangs and but the city under your control. <br/><br/> How to build up your criminal empire in San Andreas: Real Gangsters 3D<br/>Earn money when doing missions, use this money to improve your position on the streets. With loads of missions in this newest crime game you can earn a lot of cash to make sure you get what you want. San Andreas has a linear mission line that takes you loads of different types of missions, like massive shoot outs, stealing car or robbery mission. <br/><br/>it’s a big open world you live in,San Andreas: Real Gangsters 3D<br/>You as a player are given a full sized city where you can go nuts, but don’t go on a rampage because then the cops will be upon you. The action in this crime simulator 3D game revolves around shooting and to eliminate your enemies.<br/><br/>SAN ANDREAS: REAL GANGSTERS 3D : GAME FEATURES:<br/>- Ride on awesome looking motorbikes and in insane fast sports cars<br/>- Massive improvements to the gameplay, epic crime simulator vibe<br/>- Pick up goods, earn cash in different missions, drop packages, steal cars and eliminate rival gangsters<br/>- Become a real old school San Andreas Gangster<br/>- Set in a 90 style open world, enjoy the music, enjoy the feeling<br/>- Buy guns, cars and make your way to the top<br/>- Police wanted level, make a mess will come to clean it up<br/>- Character level system, become bigger, stronger", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:59:51", "background_image": "https://media.rawg.io/media/screenshots/1c7/1c734a5a9570a02c544b5246bc6fe42c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 230, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["VascoGames"], "genres": ["Action"], "publishers": [], "esrb_rating": null}