{"id": 223907, "slug": "bubble-mania-spring-flowers", "name": "Bubble Mania Spring Flowers", "name_original": "Bubble Mania Spring Flowers", "description": "April Showers bring May Flowers, but that won’t stop the Bubble Wizard from his mischievous ways! Prune that weedy warlock’s overgrown plan and have some bloomin’ fun in Bubble Mania: Spring Flowers!<br/><br/>-Sweet NEW ISLAND with fun and flowery puzzles!<br/>-SPRING FLOWER ART blossoms everywhere! <br/><br/>The best bubble shooting puzzle adventure game! Defeat the Evil Bubble Wizard and rescue baby critters! Shoot bubbles and match 3 or more to pop and drop your way to victory!<br/><br/>- 600+ levels of Challenging Puzzles!<br/>- Adventure across a stunning world. Shoot bubbles in sparkly swamps, amazing airships, and chocolate covered islands!<br/>- Score Big Bonuses - beat your friends’ scores!<br/>- Power Up with Rainbow and Bomb Bubbles!<br/>- Master tricky obstacles like the explosive Lightning Bubble!<br/>- You’ll love the Adorable Animations and playful music!<br/>- Two control methods - pick the one that works best for you!<br/>- Top-notch performance! Animated bubbles, effects, and characters!<br/>- FREE updates with new puzzles and powers!<br/><br/>Please note that Bubble Mania: Spring Flowers is free to play, but you can purchase in-app items with real money. To disable this feature, go to the Google Play app on your device, tap the Menu button, select Settings &gt; Use password to restrict purchases. Then follow the directions to complete setup. In addition, Bubble Mania: Spring Flowers may link to social media services, such as Facebook, and Storm8 will have access to your information through such services.<br/><br/>Storm8 Studios is the #1 Mobile Social Game Developer on Android.<br/><br/>Use of this application is governed by the Storm8 Studios Terms of Service. Collection and use of data are subject to Storm8 Studios Privacy Policy. Both policies are available at http://www.storm8-studios.com/terms/ and http://www.storm8-studios.com/privacy/<br/><br/>Follow Storm8<br/>www.storm8-studios.com<br/>facebook.com/storm8<br/>twitter.com/storm8", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:59:52", "background_image": "https://media.rawg.io/media/screenshots/cd8/cd8681425e6ee69e638aecbf8676cc98.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 129, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Storm8 Studios"], "genres": ["Arcade"], "publishers": [], "esrb_rating": null}