{"id": 223983, "slug": "samorost-3-demo", "name": "Samorost 3 Demo", "name_original": "Samorost 3 Demo", "description": "Guide the space gnome through the entire first planet in this free demo! <br/><br/>Please make sure you are logged in to your Google Play Games account to transfer your progress into the full game.<br/><br/>Samorost 3 is an exploration adventure and puzzle game from the award-winning creators of Machinarium and Botanicula. It is Amanita Design’s most ambitious experience to date and a loose continuation of the hit indie games Samorost and Samorost 2. <br/><br/>Samorost 3 follows a curious space gnome who uses the powers of a magic flute to travel across the cosmos in search of its mysterious origins. The full game invites you to visit nine unique and alien worlds teeming with colorful challenges, creatures and surprises to discover, brought to life with beautiful artwork, sound and music.<br/><br/>What the press said:<br/>“Possibly the most beautiful point-and-click adventure I've ever played.” - Destructoid<br/>“The best adventure game in years.” - Kill Screen<br/>“A worthy follow-up to Machinarium and Botanicula.” - Pocket Gamer<br/>“Arguably the greatest game to come out of Amanita Design.” - PC Gamer<br/>“Samorost 3's setting is immediately entrancing.” - GameSpot<br/>“All of the music is incredible.” - GameZebo<br/>“Samorost 3 is a game that feels alive.” - Stuff", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:59:34", "background_image": "https://media.rawg.io/media/screenshots/711/71126e1c3b608e65bd19f92789637d49.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 337, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Amanita Design"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}