{"id": 223959, "slug": "city-builder-2016-county-mall", "name": "City Builder 2016: County Mall", "name_original": "City Builder 2016: County Mall", "description": "Create something of worth, something of value <br/> City Builder 2016 County Mall , a new city construction game from Vascogames, will put you in the spot of a real city builder. 8 different construction vehicles are waiting for you to be used in the dirt with each their own mission and difficulty, i hope you brought your lunch box because there are going to long hours.<br/><br/><br/> From a bulldozer to a really, really big crane. Take your pick.  <br/> City Building 2016 County Mall  offers you the use of multiple construction vehicles. So you could say this construction simulator is a forklift  simulator, excavator simulator, big crane simulator and many more cramped into one epic construction game! City Building games have never been this much fun so take your chance and play it now! If you feel like you want to become a construction crane driver, you can. Or a excavator operator, also possible. You’ll understand that the possibilities are endless in  City Builder 2016 County Mall  <br/><br/><br/> Construction missions with a goal, with a purpose.  <br/>These city builder games fall into the category : fun games for when you are bored. So this means that you’ll never get bored playing  City Builder 2016 County Mall ! Next to the 20 epic construction missions, this city builder games has 8 (!) epic bonus missions for collecting more money. What can you do with that money you ask? Buy new skins for the 8 construction vehicles. Every construction vehicle has 5 different skins to really make it your own! <br/><br/><br/> City Builder 2016 County Mall  City Builder Games Features  : <br/>▶ City builder games made fun again with the implementation of 8 construction vehicles! <br/>▶ Drive, dig, transport and more in this complete construction game! <br/>▶ Collect all construction vehicles and skins!  <br/>▶ Doný forget to rate us or give us feedback! <br/><br/><br/>Facebook - https://www.facebook.com/VascoGames<br/>Twitter - https://twitter.com/VascoGames<br/>YouTube - http://goo.gl/HChVVx", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:59:39", "background_image": "https://media.rawg.io/media/screenshots/03d/03d0332b1f10a6600c5721b8c8542bba.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 145, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["VascoGames"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}