{"id": 224018, "slug": "streets-of-crime-car-thief-3d", "name": "Streets of Crime: Car thief 3D", "name_original": "Streets of Crime: Car thief 3D", "description": "A new crime city game is here<br/>Streets of Crime: Car thief 3D brings you to New Haven a metropolis crime city that was once the pearl of the east coast of the United States. The city is now struggling, people are losing jobs start moving or even worse take part in criminal activities because they are losing hope for something better. You’re Leo an ex-car dealer, mechanic and car transport truck driver who had his own Car Dealership in New Haven for years. The rapidly economic uncertainty will force you into doing something you normally would never though as a way to make sure your retirement is more rosy than now.<br/><br/>Streets of Crime: Car thief 3D are you going to take the opportunity?<br/>As you are looking for new opportunities because you are flat out any cash. You decide to contact an ex-con you know Leroy to see if you can offer him your expertise. And this is how the ball starts to roll as you progress through this exciting car theft game. You get deeper and deeper into the criminal underworld of the crime city New Haven. More and more missions will find their way to your mailbox. These thief jobs will get harder and harder as the cars the gangsters are looking for become more special by the day. Choose the jobs you like, find the car in the city. And steal cars and drive them into your transport trailer truck to stay clear from the law. The last thing you like is to get into is a police chase, with real cops that will not care about your money problems.<br/><br/>Streets of Crime: Car thief 3D game features:<br/>- A real car thief game, its something never seen before on android.<br/>- Build up your garage as you can expand the space you have to store different type of cars. <br/>- Lockpick mini games, before the heist is done you need to complete these minigames successfully otherwise you will get the cops on your tail.<br/>- Drive a big rig car transport trailer truck through the streets of crime.<br/>- Steal all kind of different vehicles in this epic crime city thief game.<br/>- You can explore the crime city of New Haven by car, truck or on foot.<br/>- Super simple and easy controls and super advanced real physics engine.<br/>- Drive through traffic in a police chase, at get into safety in time. Make sure the cops will not lock you up  <br/><br/>With more than 20.000 different kinds of cars to steal in Streets of Crime: Car thief 3D you can make sure Leo will get the retirement he is looking for. Most gangster games are about shooting and killing people, Streets of Crime: Car thief 3D is something else it shows you a different path in the criminal underworld. A world of shady people, stealing cars and trying to make it because they were running out of options. Can you help out Leo setting up for the long haul.<br/><br/>Please give us some support by rating our game on Google Play or following us on:<br/>Facebook - https://www.facebook.com/VascoGames<br/>Twitter - https://twitter.com/VascoGames<br/>YouTube - http://goo.gl/HChVVx", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:59:28", "background_image": "https://media.rawg.io/media/screenshots/e87/e87004a1933754c121989719309b931a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 139, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["VascoGames"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}