{"id": 224068, "slug": "kitty-city-kitty-cat-farm-simulation-game", "name": "Kitty City: Kitty Cat Farm Simulation Game", "name_original": "Kitty City: Kitty Cat Farm Simulation Game", "description": "Kitty City was the purr-fect community, where Kittizens and kittens worked and played in their thriving meow-tropolis. Until the fateful day a giant yarn ball meteor fell from the sky, causing the Great Bath, and their world was changed fur-ever.<br/><br/>Help Farmer Franny and her fellow Kittizens restore Kitty City to its former glory! Harvest crops and build shops to produce new goods. Catch fresh fish to feed your furry friends at the Kibble Kantina. Clear trees and customize your city with decorations. Send supply trains and fill balloons to help neighboring cities. Bring the cat-titude and rebuild Kitty City to all new heights!<br/><br/>Features:<br/>Rescue cats to unlock new buildings and recipes<br/>Harvest crops and craft valuable goods<br/>Join clubs and compete with your friends<br/>Complete requests at Balloon Express<br/>Fill trains to receive gifts from surrounding towns<br/>Level up Kittizens at the Kibble Kantina to earn bonuses<br/><br/>DEVELOPER INFO: Jam City is the leading developer in truly cross-platform social gaming! Check out our other top mobile games and see what the buzz is all about!<br/><br/>LIKE: https://www.facebook.com/PlayKittyCity<br/>Twitter: https://twitter.com/playkittycity<br/>Snapchat: @PlayKittyCity<br/>Instagram: https://www.instagram.com/playkittycity<br/>Pinterest: https://www.pinterest.com/PlayKittyCity/", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:59:16", "background_image": "https://media.rawg.io/media/screenshots/5c5/5c5dcd7ff07a579122b93deaf92d6c64.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 168, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Jam City"], "genres": ["Casual"], "publishers": [], "esrb_rating": null}