{"id": 224032, "slug": "arcaea-new-dimension-rhythm-game", "name": "Arcaea - New Dimension Rhythm Game", "name_original": "Arcaea - New Dimension Rhythm Game", "description": "New Dimension Rhythm Game<br/><br/>\"A harmony of Light awaits you in a lost world of musical Conflict.\"<br/><br/>Touch, hold and slide to the rhythm through a challenging, unforgettable arcade-style rhythm game experience featuring artists from Japan and across the Entire World.<br/>Experience brand new 3-dimensional 'Arc' gameplay: taking your touch screen to its limits swiping and following to the rhythm.<br/><br/>Lose yourself in songs of Light and Conflict within a forgotten world<br/><br/>⚏Play anywhere and anytime with no limitations. Internet connection not required⚏<br/>All songs playable on phone or tablet!<br/>Both free to play and paid songs available! Freely play many songs any time as well as unlocking Arcaea-exclusive original songs.<br/><br/>⚏Features ⚏<br/>- A high difficulty ceiling - experience personal growth as you develop skills in arcade-style progression<br/>- Over 90 songs from more than 50 artists famous across other games<br/>- 3 rhythm difficulty levels for every song<br/>- An expanding music library through content updates<br/>- Full song jacket illustrations<br/>- Online friends and scoreboards<br/><br/>Download now and experience a brand new music game experience!<br/><br/>⚏Story ⚏<br/>Two young girls wander in a broken world filled with remnants of its former self: Arcaea.<br/><br/>Arcaea are melodical shards of the past that call out to the girls, but each chooses to be experienced only by one or the other. Over time, the girls begin to notice inconsistencies in the Arcaea that choose them and develop conflicting views about the world as it once was.<br/>---<br/><br/>Follow Arcaea &amp; News:<br/>Twitter: http://twitter.com/arcaea_en<br/>Facebook: http://facebook.com/arcaeagame<br/>Google+: https://plus.google.com/100125201589035673885", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-31T01:09:39", "background_image": "https://media.rawg.io/media/screenshots/8c8/8c863bdc75a1e965933f9437e736a5ce.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 372, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["lowiro"], "genres": [], "publishers": [], "esrb_rating": "Everyone"}