{"id": 224092, "slug": "lego-friends-heartlake-rush-2", "name": "LEGO Friends: Heartlake Rush", "name_original": "LEGO Friends: Heartlake Rush", "description": "We wanted to make a LEGO run game that would be fast-to-the-fun and have heaps of things to collect and do. Right now we have Andrea, Mia, Olivia, Emma, Stephanie and a bunch of their LEGO friends in the game for you to drive around with. There’s heaps of missions to go on, collecting things as you drive, fligh, jump, duck and dodge your way around other vehicles and obstacles on the street. Zobo is in there too, and when you collect him, you’ll turn into a different sort of vehicle. Even though it is a LEGO Friends game, it is not meant to be a game for girls only. If you or your family love run games, racing, collecting cool items, we hope falling in love with LEGO Friends game will come easy.<br/><br/>- DRIVE through LEGO Heartlake City as your favorite Friends character!<br/>- COLLECT coins, ice cream, fruit, flowers, gifts, confetti bombs, and a special collectible item for each of the five Friends!<br/>- PURCHASE special characters or an amazing Stud Doubler!<br/>- CUSTOMIZE your cars with decals, colored tires, and aerial toppers!<br/>- COMPLETE MISSIONS to level up and earn more coins!<br/>- DODGE enemies coming right at you!<br/>- DECORATE your cars with unlockable decals!<br/>- BOOST AND TRANSFORM your car into a jet by picking up Zobo the robot!<br/>- UNLOCK all 10 playable LEGO Friends characters and cars by earning coin rewards!<br/>- MIX AND MATCH your characters, cars, and decals for a true LEGO game building experience!<br/>- SAFETY FIRST: Play in a safe, closed environment, with NO third-party advertising, links to external websites or hidden data collection. LEGO marketing content and information is served, for instance LEGO news about LEGO sets and other LEGO games, in hope of inspiring creative play.<br/><br/>Please note that you can download this game for free and it is free to play the app but additional content is available via in-app purchase. In-app purchases cost real money and are charged to your account. To disable the ability to make in-app purchases, change the device settings.  <br/><br/>For app support, contact LEGO Consumer Service.<br/>For contact details, refer to http://service.LEGO.com/contactus<br/>We love to take your comments from reviews to our internal design meetings, and talk about how to make our play experiences better. Please take the time to tell us what you think!<br/><br/>Child Safety and Privacy is important to the LEGO Group. Please read more about them on http://aboutus.LEGO.com/legal-notice/Privacy-Policy and http://aboutus.LEGO.com/en-us/legal-notice/terms-of-use-for-apps. Our privacy policy and terms of use for apps are accepted if you download this app.<br/><br/>LEGO, the LEGO logo and the FRIENDS logo are trademarks and/or copyrights of the LEGO Group. ©2018 The LEGO Group. All rights reserved.", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-31T03:17:17", "background_image": "https://media.rawg.io/media/screenshots/fc2/fc2239e83954884a16b9feaf88a14dc2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 327, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["LEGO System A/S"], "genres": ["Arcade"], "publishers": [], "esrb_rating": "Everyone"}