{"id": 224061, "slug": "bakery-story-valentines-day", "name": "Bakery Story: Valentines Day", "name_original": "Bakery Story: Valentines Day", "description": "The #1 FREE virtual bakery game returns with Bakery Story: VALENTINE’S DAY EDITION!<br/>Design the bakery of your dreams and share with your friends! Impress your sweetheart with fun V-Day decorations and mouth-watering sweets! Now with Valentine’s Day themed treats, decorations, and REWARDING storylines!<br/><br/>New FREE content is released every week to keep your bakery growing!<br/><br/>- DESIGN and build the perfect, personalized bakery! Stunning variety and unlimited creativity!<br/>- DECORATE with thousands of items, choose tables, chairs, wallpaper, art, and more!<br/>- CUSTOMIZE a menu of delicious treats to make tummies grumble for more!<br/>- SOCIALIZE with other bakeries, and collect bonus tips from players!<br/>- FREE to download, FREE to play, FREE weekly updates with new treats and decorations!<br/><br/>Please note: Bakery Story: Valentine’s Day is an online only game. Your device must have an active internet connection to play.<br/><br/>Please note that Bakery Story: Valentines Day is free to play, but you can purchase in-app items with real money. To disable this feature, go to the Google Play app on your device, tap the Menu button, select Settings &gt; Use password to restrict purchases. Then follow the directions to complete setup. In addition, Bakery Story: Valentines Day may link to social media services, such as Facebook, and Storm8 will have access to your information through such services.<br/><br/>Storm8 Studios is the #1 Mobile Social Game Developer on Android.<br/><br/>Use of this application is governed by the Storm8 Studios Terms of Service. Collection and use of data are subject to Storm8 Studios Privacy Policy. Both policies are available at http://www.storm8-studios.com/terms/ and http://www.storm8-studios.com/privacy/<br/><br/>Follow Storm8<br/>www.storm8-studios.com<br/>facebook.com/storm8<br/>twitter.com/storm8", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:59:18", "background_image": "https://media.rawg.io/media/screenshots/6d1/6d16bdaf8e0531d763e4b99ddbe901b9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 214, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Storm8 Studios"], "genres": ["Casual"], "publishers": [], "esrb_rating": null}