{"id": 224058, "slug": "lego-dc-mighty-micros", "name": "LEGO DC Mighty Micros", "name_original": "LEGO DC Mighty Micros", "description": "Play with LEGO BATMAN™, LEGO WONDER WOMAN™ or with LEGO SUPERMAN™ in this free and fun LEGO® DC Comics racing game.<br/><br/>Chase or be chased! You can play as the Killer Moth™ or BIZZARO™ and escape the city before BATMAN™ or SUPERMAN™ can catch you. Or would you rather be the superhero?<br/><br/>This game is a fun and free racing LEGO® game designed for boys and girls with the following ages: 5-12  <br/><br/>You can race through multiple environments and enjoy the ride with your favorite LEGO® DC superhero.   <br/><br/>Do you want to see your favorite LEGO® DC Mighty Micros sets in action?  <br/><br/>* Swoop through the air in the LEGO® DC Mighty Micros Batcopter and swat Killer Moth™ out of the sky! Throw Batman’s Batarang at the flying bug’s wings and send the villain crashing, but watch out for the cocoon gun.<br/><br/>* Doomsday™ is powering up his Mighty Micros car and going in for the attack with his club. Watch Wonder Woman™ strike back using her mighty sword and shield as she zooms around the villain in her Invisible Jet! <br/><br/>* Zoom into battle and catch Bizarro™—if you can! Who knows which direction Superman’s imperfect nemesis will turn next in his back-to -front Mighty Micros car. Use the blue Kryptonite to sap Bizarro’s energy, but watch out for the green Kryptonite! Bump the giant fists against each other to see who will win this crazy battle.<br/><br/>Features <br/>* Collect and play as your favourite DC Comic character and explore the 3 different worlds!<br/>* Great fun for kids 5-12! <br/>* Become the hero or play as the mischievous villain<br/>* Fun cinematics to watch and learn about the villains and heroes!<br/>* Bluetooth Game Controller Support<br/><br/>LEGO DC Mighty Micros is free to play and offers no in-app purchases.<br/><br/>For app support contact LEGO Consumer Service. <br/>For contact details refer to http://service.lego.com/contactus <br/><br/>Our privacy policy and terms of use for apps are accepted if you download this app. <br/>Read more on http://aboutus.lego.com/legal-notice/Privacy-Policy and http://aboutus.lego.com/legal-notice/terms-of-use-for-apps <br/><br/>LEGO and the LEGO logo are trademarks of the LEGO Group. ©2016 The LEGO Group.", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-30T18:58:46", "background_image": "https://media.rawg.io/media/screenshots/191/1914dea5f747597947b9730cff43102e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 326, "game_series_count": 0, "reviews_count": 1, "platforms": ["Android"], "developers": ["LEGO System A/S"], "genres": ["Racing"], "publishers": [], "esrb_rating": "Everyone"}