{"id": 22402, "slug": "victoria-i-complete", "name": "Victoria I Complete", "name_original": "Victoria I Complete", "description": "<p>Carefully guide your nation from the era of absolute monarchies in the early 19th century, through expansion, colonization and social upheaval, to emerge as one of the great world powers by the dawn of the 20th century in Victoria Complete. Gather the wealth and strength required to stay ahead of your enemies, gain invaluable prestige and honor, and reform the nation into a free democracy. Or, drive your people down the grim road of tyranny, corruption, and anarchy...</p>\n<p>Experience an in-depth political simulation where every action you take will have various consequences all over the world. The collection focuses on six different aspects of governing a nation: Diplomacy, Warfare, Economy &amp; Industrialization, Colonization, Technological Research and Politics. The main game is hailed as the ultimate World Domination and Empire-Building simulation and allows continuation of the game in “Hearts of Iron 2: Doomsday”.</p>\n<p><strong>Features:</strong></p>\n<ul>\n<li>Historical and Dynamic missions guiding your country through history</li>\n<li>Advanced tech tree covering the entire period including the Interwar period</li>\n<li>Experience a global map with more than 2800 provinces</li>\n<li>A military system linked with the player's policy decisions</li>\n<li>Deep engrossing political simulation and detailed economic system</li>\n<li>Multiplayer with up to 32 players</li>\n<li>A Doomsday converter with possibility to export a save game at the end of the game into Hearts of Iron 2: Doomsday VICTORIA is all about recreating world history according to your wishes. While the game strives to simulate the unique conditions and prerequisites of the time period as closely as possible, it leave all the decision-making to you, the player.</li>\n<li>Developed by the team behind Europa Universalis and Hearts of Iron.</li>\n<li>Play any country from the time period.</li>\n<li>Play multiplayer with up to 32 players in LAN or over the Internet.</li>\n<li>More than 2 hours of quality recordings of music from the period.</li>\n<li>This real-time game can be set to pause at any given point or event, allowing players to plan and strategize in a \"semi real-time\" environment.</li>\n<li>Set on a global map with more than 2800 provinces and sea zones</li>\n</ul>", "metacritic": null, "released": "2010-08-20", "tba": false, "updated": "2023-10-28T06:03:40", "background_image": "https://media.rawg.io/media/screenshots/1e1/1e19fe1c121313853c7cad5b6e590000.jpg", "website": "http://www.paradoxplaza.com/", "rating": 3.5, "rating_top": 4, "added_by_status": {"yet": 19, "owned": 317, "beaten": 9, "toplay": 4, "dropped": 4}, "playtime": 1, "achievements_count": 0, "ratings_count": 18, "suggestions_count": 358, "game_series_count": 0, "reviews_count": 18, "platforms": ["PC"], "developers": ["Paradox Development Studio"], "genres": ["Strategy"], "publishers": ["Paradox Interactive"], "esrb_rating": null}