{"id": 224137, "slug": "uphill-rush-racing", "name": "Uphill Rush Racing", "name_original": "Uphill Rush Racing", "description": "Get ready for some extreme waterslide action in the world’s craziest water park racing simulator! <br/><br/>🌊 NOW WITH A MULTIPLAYER MODE! 🌊 Try it for free today!<br/><br/>How long can you surf while you perform crazy stunts, flips, and slide through everything in your path?<br/><br/>Master your surfing skills and bounce through roller coaster style corkscrews, loops, and more! Will you dare to try some seriously insane racing tracks? This is more than just fun in the sun in an amusement park. Do you have the skills to make it to the finish line and not wipe out? <br/>Test yourself with an epic and thrilling ride now!<br/><br/>TAKE IT TO THE MAX! Take the fun to another level! You'll flip over our most thrilling water slide game when you choose from tons of rad “boards” like bathtubs, sharks, or jet skis, each with their own unique specs. <br/><br/>CHALLENGE your friends in the new multiplayer mode!<br/><br/>CLIMB UP the leader board. Set up surfing races, beat records, and become a surfing master.<br/><br/>UNLOCK cool upgrades, and use power-ups to give yourself an extreme boost!<br/><br/>CREATE your own amusement park levels that can be played by your friends and other players from around the world. They will rate your levels and help you climb to the top of the leader board. Of course, you can just play other players' levels too. Tons of new ones will be added daily!<br/><br/>JOIN the greatest surfboard masters.<br/><br/>SUPER FUN FEATURES:<br/>• An amazing, new cruise ship world that will make you flip!<br/>• Conquer the world’s most dangerous attractions and try not to wipe out. <br/>• Experience extreme water park surfing thrills.<br/>• Perform mind-blowing stunts while trying not to flip over.<br/>• Choose from 20+ rides, and many different characters and outfits.<br/>• Master all levels in Level Mode.<br/>• Survive as long as you can in Endless Mode. Test your surfing skills, slide, and try not to wipe out for as long as you can.<br/>• Create your own amusement park content in the level editor.<br/>• Tons of new levels are added every day by the community.<br/>• Discover hidden diamonds and unlock power-ups.<br/>• Conquer the global leaderboard.<br/>• Play anytime and anywhere. No Wi-Fi needed!<br/><br/>Will you wipe out or will you prove yourself to be a water park pro? Jump on a board and find out today!<br/><br/>PRIVACY POLICY<br/>http://www.spilgames.com/mobile-apps-privacy-policy/<br/><br/>TERMS OF USE<br/>http://www.spilgames.com/terms-of-use/", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:59:01", "background_image": "https://media.rawg.io/media/screenshots/a1b/a1b3605126a979e61c3002e03adf7c5b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 295, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["SPIL GAMES"], "genres": ["Racing"], "publishers": [], "esrb_rating": null}