{"id": 224152, "slug": "jewel-mania-mystic-mountain", "name": "Jewel Mania: Mystic Mountain", "name_original": "Jewel Mania: Mystic Mountain", "description": "Help the Creature of Mystic Mountain regain its former happiness! Swap jewels to match 3 or more and shatter the curse on the land by collecting the missing Crystal of Joy that once belonged to the Creature's heart!<br/><br/>- A NEW ISLAND filled with puzzling twists and turns!<br/>- MATCH JEWELS in 600+ puzzles - each one is unique and full of fun and amazing challenges!<br/>- DAZZLING PUZZLES like smashing glass and digging for treasure keep the fun flowing!<br/>- CREATE COMBOS by matching rare jewels and create amazing cascades!<br/>- DISCOVER rare Magic Diamonds and Power Bombs by making big matches!<br/>- EASY TO LEARN - hard to master! Can you score high enough to earn 3 stars on every level?<br/>- MASTER tricky obstacles like walls, pitfalls, and puzzling portals!<br/>- BEAUTIFUL backgrounds as you solve puzzles at amazing places with your puppy companion!<br/>- TOP-NOTCH performance! Animated jewels, effects, and characters!<br/>- FREE updates with new puzzles, boosts, and more!<br/><br/>Please note that Jewel Mania: Mystic Mountain is free to play, but you can purchase in-app items with real money. To disable this feature, go to the Google Play app on your device, tap the Menu button, select Settings &gt; Use password to restrict purchases. Then follow the directions to complete setup. In addition, Jewel Mania: Mournful Mountain may link to social media services, such as Facebook, and Storm8 will have access to your information through such services.<br/><br/>TeamLava, a Storm8 studio, is the #1 Mobile Social Game Developer for Android devices.<br/><br/>Use of this application is governed by the TeamLava Terms of Service. Collection and use of data are subject to TeamLava's Privacy Policy. Both policies are available at www.teamlava.com/terms and www.teamlava.com/privacy<br/><br/>Note: READ_PHONE_STATE permission is used to help us remember your puzzle progress<br/><br/>Follow Storm8<br/>www.storm8-studios.com<br/>facebook.com/storm8<br/>twitter.com/storm8", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:58:58", "background_image": "https://media.rawg.io/media/screenshots/d3a/d3a11f7eb25b2adb438aa5ebc476cf3e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 140, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Storm8 Studios"], "genres": ["Arcade"], "publishers": [], "esrb_rating": null}