{"id": 22416, "slug": "space-trader-merchant-marine", "name": "Space Trader: Merchant Marine", "name_original": "Space Trader: Merchant Marine", "description": "<p>In the far future, humanity is ruled by The Ministry of Accounts, an oppressive bureaucracy that tracks, records and taxes every transaction of daily life. From the depths of Red Tape, a new breed of marketeer arises to challenge the authority and make a profit: the Space Trader is born!</p>\n<p>As a Trader, you will attempt to amass a fortune beyond your wildest imagination, buying and selling commodities and taking up arms against the oppressors or even accepting bounty missions, hunting down crime bosses and their thugs.</p>\n<ul>\n<li><strong>Trader Campaign:</strong> Start as a rookie trader and earn your way to Master Trader using shrewd trades, back alley deals, bribes, a well placed bullet and more through a challenging 5-level single-player campaign.</li>\n<li><strong>Three Ways to Challenge:</strong> Master your trading skills in three unique challenge missions; Moon Madness, Free Trade and Red Eye Trader.</li>\n<li><strong>From Iron Ore to Organs:</strong> Turn misfortune to profit. Buy low, sell high. Over 40 different commodities to supply the demand.</li>\n<li><strong>Have Ship, Will Travel:</strong> Visit seven planetary locations, their moons and stops along the way and interact with over 100 characters.</li>\n<li><strong>Conflict Builds Character:</strong> Using an assortment of unique weapons, bring dozens of crime bosses to justice and turn a tidy profit.</li>\n<li><strong>Competitive Cooperative:</strong> Challenge your friends and family, not just your peers. Working together has never been so competitive!</li>\n<li><strong>Steam Achievements:</strong> Unlock all 40 Steam Achievements</li> </ul>", "metacritic": null, "released": "2008-10-22", "tba": false, "updated": "2022-08-01T03:23:13", "background_image": "https://media.rawg.io/media/screenshots/64a/64a7870e16c1e90e254592baa8edba5e.jpg", "website": "http://www.playspacetrader.com/", "rating": 2.21, "rating_top": 1, "added_by_status": {"yet": 16, "owned": 664, "beaten": 1, "dropped": 8}, "playtime": 1, "achievements_count": 40, "ratings_count": 28, "suggestions_count": 390, "game_series_count": 0, "reviews_count": 28, "platforms": ["PC"], "developers": ["Meridian4", "Hermitworks Entertainment"], "genres": ["Action", "Strategy", "Indie"], "publishers": ["Meridian4"], "esrb_rating": null}