{"id": 224176, "slug": "omaha-texas-holdem-poker-pokerist", "name": "Omaha & Texas Holdem Poker: Pokerist", "name_original": "Omaha & Texas Holdem Poker: Pokerist", "description": "Play Omaha poker free with millions of players from all over the world!<br/>Immerse yourself in the world of Omaha poker excitement, challenges and victories to prove that you're a true winner.<br/>Bluff and raise, improve your skills, gain experience, make new friends and become the best Omaha poker player ever!<br/><br/>Game features:<br/>• FREE CHIPS – Play the game every day to get free chips!<br/>• GET REWARDS – Up the stakes, win hands, go all-in and unlock achievements.<br/>• QUESTS - Complete daily quests to get free chips!<br/>• YOUR OWN PROFILE PAGE – Track your progress and status in the game! Get experience and level up. See how many poker tournaments you've won and achievements you've completed. Get unique property and display it on your profile. View other players' profiles to see how you compare!<br/>• CHAT WITH OTHER PLAYERS – Have even more fun at the casino tables with our convenient in-game instant messenger and chat with other Omaha poker players.<br/>• FAIR HAND DEALING GUARANTEED – Our certified Random Number Generator (RNG) gives you the best and fairest online Omaha poker experience!<br/>• LEARN TO PLAY – Are you new to Omaha poker, Texas hold’em poker, blackjack or roulette but always wanted to try it? <br/>Our simple-to-follow tutorial mode will help you take the first steps. Quickly learn everything you need to know about Omaha poker, from the rules of the game to winning combinations.<br/>• NO REGISTRATION – Get straight into the action. Choose guest mode to use our free casino app without registering.<br/>• SINGLE ACCOUNT – Start playing free Omaha poker on your smartphone, then continue on your tablet without losing progress. Use your account to play any of our other casino games in one app.<br/><br/>♥️♦️♠️♣️ Want more than Omaha poker? ♣️♠️♦️♥️<br/>Try our other games for an unforgettable 3D experience:<br/>• SLOTS – Explore our themed slots with lots of unique features!<br/>• TEXAS HOLD'EM POKER – A classic version of poker with 2 cards in hand.<br/>• BLACKJACK – A simple game of \"21\". An exciting 3D game that any blackjack fan is sure to enjoy.<br/>• ROULETTE – Featuring stunning 3D graphics and three table varieties: French, American, and European.<br/>• BACCARAT – One of the most popular and exciting card games with superior 3D graphics!<br/>• CRAPS – The first 3D craps game ever. Make bets, roll the dice, take risks and become the best craps player!<br/><br/>Subscribe to the official Facebook page of the game and be the first to find out about our promotions and news!  https://facebook.com/Pokerist<br/>Follow us on Twitter and get free chips!<br/>https://twitter.com/KamaCasino<br/>This game is only available to users of legal age. The game offers no possibility of winning money or anything of value. Success in playing this game does not imply your success in a similar real-money casino game.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:58:55", "background_image": "https://media.rawg.io/media/screenshots/93b/93b2552081838d00cea5a5ccd68d95b8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 169, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["KamaGames"], "genres": ["Card"], "publishers": [], "esrb_rating": null}