{"id": 224165, "slug": "farm-story-2-birthday-party", "name": "Farm Story 2: Birthday Party", "name_original": "Farm Story 2: Birthday Party", "description": "Explore a beautiful 3D world to harvest crops, raise happy animals and discover exciting surprises in the long-awaited sequel to our #1 hit farming game! Celebrate our 2nd birthday, help Jed throw a party for Morgan, and win exclusive prizes!<br/><br/>Play with friends for free and as long as you want, turning your fresh produce into delicious goods to become a farming legend!<br/><br/>Available in English, Deutsch, Español, Français, Italiano, 日本語, 中国语言, 한국어<br/><br/>• EXPLORE a living, breathing world - simply tap to catch butterflies, fish in the pond, or talk to friendly characters!<br/>• COLLECT a barnyard full of cute and playful animals!<br/>• HARVEST fields of colorful crops and find fresh ingredients to use in tasty recipes!<br/>• CRAFT delicious meals in your Kitchen, snacks with your Deep Fryer, or desserts in the Chocolatier!<br/>• TRADE your fresh goods with friends and neighbors!<br/>• TREASURE your adventures with a colorful Scrapbook that automatically fills as you progress!<br/>• DECORATE your farm with a wide assortment of items from the market!<br/>• MEET friendly characters like Jed Fallows, the kindly old farmer, full of helpful advice and stories to share!<br/><br/>What will you do with your new farm? Come and play the BEST looking FREE Farm game for your Android Device!<br/><br/>Farm Story 2: Birthday Party is an online only game. Your device must have an active internet connection to play.<br/><br/>Please note that Farm Story 2: Birthday Party is free to play, but you can purchase in-app items with real money. To disable this feature, go to the Google Play app on your device, tap the Menu button, select Settings &gt; Use password to restrict purchases. Then follow the directions to complete setup. In addition, Farm Story 2: Birthday Party may link to social media services, such as Facebook, and Storm8 will have access to your information through such services.<br/><br/>Storm8 Studios is the #1 Mobile Social Game Developer on Android.<br/><br/>Use of this application is governed by the Storm8 Studios Terms of Service. Collection and use of data are subject to Storm8 Studios Privacy Policy. Both policies are available at http://www.storm8-studios.com/terms/ and http://www.storm8-studios.com/privacy/<br/><br/>Follow Storm8!<br/>www.storm8.com<br/>facebook.com/storm8<br/>twitter.com/storm8", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:58:57", "background_image": "https://media.rawg.io/media/screenshots/0e8/0e88ba55bdf6bd2aa7a7c1633efbccdc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 112, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Storm8 Studios"], "genres": ["Casual"], "publishers": [], "esrb_rating": null}