{"id": 224299, "slug": "mahjong-crimes-mahjong-mystery", "name": "Mahjong Crimes - Mahjong & Mystery", "name_original": "Mahjong Crimes - Mahjong & Mystery", "description": "PLAY MAHJONG AND SOLVE CRIMES<br/><br/>Unravel the mystery behind Agatha Christie’s renowned Murder on the Orient Express in Mahjong Crimes!<br/><br/>MYSTERIOUS FEATURES<br/><br/>🀄 Play 250+ captivating Mahjong levels!<br/>🀄 Experience fresh new puzzle mechanics!<br/>🀄 Dive into “Murder on the Orient Express” by Agatha Christie!<br/>🀄 Use boosters to crush tricky Mahjong puzzles!<br/>🀄 Collect cool looking tile sets!<br/>🀄 Play anytime, anywhere! No Wi-fi needed!<br/><br/>PLAY MAHJONG<br/><br/>Mahjong Crimes is an addictive puzzle game where you pair tiles to reveal hidden clues, essential to solving crime cases. You’ll need a sharp eye to spot the identical tiles and connect them to clear the board to progress. Use power-ups to help you get past tricky time-based levels and collect amazing awards along the way. You won’t be able to put your phone down, trust us!<br/><br/>SOLVE CRIMES<br/><br/>This unparalleled Mahjong game is all about solving crimes alongside the renowned detective Hercule Poirot! Climb aboard the Orient Express with its elegant compartments and affluent travelers, where opulence is just a cover up for the crimes taking place behind the Mahjong tiles. <br/>Match tiles to investigate crimes, defeat thugs, and untangle the obscure mysteries! Embark on a fun adventure that will have you glued to your devices from the very first tile you pair!<br/><br/>Do you have what it takes to solve these captivating Mahjong puzzles and mysterious crimes?", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:58:22", "background_image": "https://media.rawg.io/media/screenshots/72d/72de9ea04f2aca1d8a4b978cab0048a2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 273, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["SPIL GAMES"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}