{"id": 224320, "slug": "my-little-pony-rainbow-runners", "name": "My Little Pony Rainbow Runners", "name_original": "My Little Pony Rainbow Runners", "description": "Run, jump, fly and restore the colors of the world with all your favorite ponies!<br/><br/>Budge Studios™ presents My Little Pony Rainbow Runners! A powerful color-stealing spell has been unleashed on Ponyville and it’s up to your favorite ponies to break it with the power of Friendship! Run, jump, awaken your ponies’ Rainbow Powers and use their epic abilities to bring the colors back to the world!<br/><br/>A COLOR FILLED ADVENTURE<br/>• PLAY exciting missions all over Ponyville!<br/>• RUN to close the color-stealing portals, one platform at a time!<br/>• JUMP, FLY and SLIDE to avoid obstacles, holes and muddy puddles!<br/>• TRANSFORM your ponies into their epic Rainbow Power form!<br/>• COLLECT Pony Power and upgrade your ponies’ Rainbow Powers<br/>• EMBARK on a personal quest with each pony<br/><br/>6 PONIES, EACH WITH THEIR OWN RAINBOW POWER AND SUPER FORM<br/>• PRINCESS TWILIGHT SPARKLES: Clears the way of obstacles with her Magic Blast<br/>• PINKIE PIE: Jumps higher than ever with her Mega Bounce<br/>• RAINBOW DASH: Dashes and smashes through obstacles with her Rainboom<br/>• RARITY: Attracts Pony Power with her Magnetic Personality<br/>• APPLEJACK: Turns obstacles into apple sauce with her Apple Strike<br/>• FLUTTERSHY: Glides gracefully over and above anything with her Super Flight<br/><br/>PRIVACY &amp; ADVERTISING<br/>Budge Studios takes children's privacy seriously and ensures that its apps are compliant with privacy laws, including the Child Online Privacy Protection Act (COPPA), a privacy legislation in the United States of America. This application has received the “ESRB (Entertainment Software Rating Board) Privacy Certified Kids’ Privacy Seal”. If you would like to learn more on what information we collect and how we use it, please visit our privacy policy at: https://budgestudios.com/en/legal/privacy-policy/. If  you have any questions, email our Privacy Officer at : privacy@budgestudios.ca<br/><br/>Before you download this app, please note that it is free to play, but additional content may be available via in-app purchases. This app may contain contextual advertising from Budge Studios regarding other apps we publish, from our partners and some third parties. Budge Studios does not permit behavioral advertising or retargeting in this app. Note that any purchase made in the app will remove pop-up advertising. The app may also contain social media links that are only accessible behind a parental gate. <br/><br/>This app requires an Internet connection (3G, 4G, LTE, or WiFi) to download the app and app updates. Kids, ask a parent first before downloading the app.<br/><br/>END-USER LICENSE AGREEMENT<br/>This application is subject to an End-User License Agreement available through the following link: http://www.budgestudios.com/en/legal/eula/ .<br/><br/>HAVE QUESTIONS? <br/>We always welcome your questions, suggestions and comments. Contact us 24/7 at support@budgestudios.ca<br/><br/>Visit us: www.budgestudios.com <br/>Like us: facebook.com/budgestudios <br/>Follow us: @budgestudios <br/>Watch our app trailers: youtube.com/budgestudios  <br/><br/>MY LITTLE PONY and all related characters are trademarks of Hasbro and are used with permission. © 2017 Hasbro. All Rights Reserved. Licensed by Hasbro.<br/><br/>BUDGE and BUDGE STUDIOS are trademarks of Budge Studios Inc.", "metacritic": null, "released": null, "tba": false, "updated": "2023-03-02T20:44:21", "background_image": "https://media.rawg.io/media/screenshots/243/24320cc485a6f338e576469e178b6924.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 128, "game_series_count": 0, "reviews_count": 1, "platforms": ["Android"], "developers": ["Budge Studios"], "genres": ["Casual"], "publishers": [], "esrb_rating": "Everyone"}