{"id": 224332, "slug": "cargo-transport-driver-3d", "name": "Cargo Transport Driver 3D", "name_original": "Cargo Transport Driver 3D", "description": "Everybody, let’s get this car transporter simulator 3D game now! We should go on the road and drive around with a new real car carrying trailer. Picking up all available cargo transport it and finish the job behind the wheel of a real trailer truck. Are you the transport driver what we’ve been looking for the last time? Are you getting excited when seeing massive trucks with cars and deliver the cargo with such high value? Become king behind the wheels of this giant vehicle, the auto transport truck, and complete your missions like a boss. Park the truck on the right place and deliver the cargo in time.<br/><br/><br/>Cargo Transport Driver 3D Features:<br/>+ Delivery Man Driving Experience<br/>+ Various Different Vehicles<br/>+ Different Point Of View; Forward and Backward<br/>+ Realistic Truck Driver Environment<br/>+ Car Transporter Cargo Delivery<br/>+ On-Screen Steering Wheel<br/>+ Acceleration Pedal + Brake Pedal<br/><br/><br/>Yes, it’s true. You need to deliver the cargo on the right place. The destination of every real trailer truck driver experience. Drive around in a realistic big city full of traffic and people. Be sure you avoid the traffic, don’t hit any obstacle. Dodge every strange object on your way to the parking lot.<br/><br/>Use the different points of view to make sure you don’t hit the traffic. Deliver the cargo transport driver truck on time, without any scratch on it. Are you being the next top cargo transport driver of 2015? Many tried already, but it can be hard to master! This 3D truck driving experience is great to play, try it out! Load and unload the real truck trailer on your way to the parking lot. Precision driving is what you need to be successful. Remember.<br/><br/><br/>Make money when you deliver the cargo with your car transporter truck in time. The more money you have, the more options you can unlock. Be the most awesome cargo transport driver in the most realistic city online. Shine like a real truck driver on the road, drive through all other traffic without hitting it and finish the cargo delivery with the highest score possible!<br/><br/><br/>Please give us some support by rating Cargo Transport Driver 3D on Google Play or following us on:<br/>Facebook - https://www.facebook.com/VascoGames<br/>Twitter - https://twitter.com/VascoGames<br/>YouTube - http://goo.gl/HChVVx", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:58:15", "background_image": "https://media.rawg.io/media/screenshots/2c1/2c153f24bd58429e463e0ad8f19448f6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 148, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["VascoGames"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}