{"id": 224372, "slug": "3d-cop-duty-police-vs-thief", "name": "3D Cop Duty POLICE VS THIEF", "name_original": "3D Cop Duty POLICE VS THIEF", "description": "Emergency calls are coming, turn on your police lights<br/>Its full hot pursuit action in 3D Cop Duty POLICE VS THIEF! Chasing down criminal suspects force them to stop. So if you ever dreamed of being a real life cop, and you like to know what it takes to work as a law enforcement officer. then download 3D Cop Duty POLICE VS THIEF this fun and exciting car driving simulator will test your driving skills to the max. Chase down the most wanted outlaws on the asphalt streets, max sure you lock them up Take criminal suspects to the police station. Earn cash, upgrade your police cars there are more than enough cars to choose from.   <br/><br/>Big City, big streets, loads of crime<br/>3D Cop Duty POLICE VS THIEF has loads of gameplay time, drive around in a major open world city. Clear the streets in this extreme car simulator 3D game. With an endless amount of missions and different tasks to complete you will never get bored with this extreme car driving simulator game. how your crazy driver skills in different police cars in a great and massive city. A big city also means the streets have loads of traffic on the asphalt, this makes chasing down the suspects a difficult task sometimes. Watch yourself and cars on the street as you find your way through the traffic. So law man it is POLICE VS THIEF in this one, are you up for the task to clear the streets of crime?<br/><br/>Extreme car simulator 3D car physics <br/>Every car has it own strong and weak points, the driving of these super realistic cop cars give you the real deal feeling. The cars have a great sense of weight and momentum on them, this makes them do drifts in this police car drifting 3d game. Tweak the cars in the garage, customize your cars or buy new police cars so your collection grows.<br/><br/>3D Cop Duty POLICE VS THIEF - racing simulator game features<br/>- Hours of core gameplay<br/>- Day and Night time driving<br/>- Earn cash and points during police pursuits<br/>- Show your driving skills and don’t get shaking off<br/>- Build up your own car collection of unique and rare cop cars in this extreme car simulator 3D game<br/>- Police chase car racing action with one of the best racing physics on google play store today<br/><br/>Get ready for some extreme traffic chase action , drive fast as you try to takedown different crews of illegal street racers, and other scum that run the streets. Don’t let the outlaws outrun your mighty police cars in this police chase car racing game. Earn access to all the different cars in this awesome cops vs robbers racing game. New cars means more chance to get those outlaws behind bars. This is not only a police chasing bad guy game it more a full real fast racing simulator experience. as you will go through this extreme car driving 3d game you will find it out yourself for sure!<br/><br/>Please give us some support by rating our game on Google Play or following us on:<br/>Facebook - https://www.facebook.com/VascoGames<br/>Twitter - https://twitter.com/VascoGames<br/>YouTube - http://goo.gl/HChVVx", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:58:02", "background_image": "https://media.rawg.io/media/screenshots/512/5123161eda08af40f421fa7d2f9fdec7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 67, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["VascoGames"], "genres": ["Racing"], "publishers": [], "esrb_rating": null}