{"id": 224363, "slug": "word-connect-word-cookies-word-games", "name": "Word Connect - Word Cookies: Word Games", "name_original": "Word Connect - Word Cookies: Word Games", "description": "Do you enjoy word puzzle games? Here comes the perfect word games for you!<br/><br/>Word Search games has never been so challenging. New Crossword Puzzle Word Games is available NOW. Enjoy the best combination of word searching and crosswords. <br/><br/>The Word Connect games  is loved by over Millions of users worldwide! Come and Find all hidden words!  DOWNLOAD TODAY for FREE!<br/><br/>New Feature: New Crossword Puzzle Word Game is Available NOW.<br/><br/>HOW TO PLAY: <br/>Slide &amp; drag your finger over the words to solve puzzles. Game gets trickier as you progress. The game’s brain teasers test your vocabulary, lateral thinking &amp; puzzle solving skills.<br/><br/>FEATURES: <br/>★ Daily Gift<br/>★ Hundreds of Word Puzzle Games<br/>★ Automatically saved<br/>★ Play OFFLINE in anytime and anywhere with no time limits<br/>★ Free &amp; easy to play, challenging to master word games<br/>★ Word Games designed for all ages, perfect for kids &amp; adults!<br/>★ Word games were created by person, not by computer, to make sure word puzzle games are always interesting and fun. <br/><br/>Word search is perfect for both word connect and crossword puzzle word games FANS!<br/><br/>Start Your Word Games Daily  Brain Training NOW!<br/><br/>There are thousands of word games on android but this word connect is unique and fun. Word games can be easy or hard but this word connect game suits everyone.<br/><br/>Some word games may drain your brain but this word connect remains good balance of fun and difficulty.<br/><br/>You will find many similar word games but this word connect will standout for sure.<br/><br/>Word games are fun but this word connect game is even better. <br/><br/>For all word game lovers, this word connect is truly what you deserve.<br/><br/>Word games for the young, word games for the smart, word games for the fun.<br/><br/>Word puzzle games uplift your literacy; word puzzle games improve your memory; above all, word puzzle games kill your boring time.  <br/><br/>Build your word connect knowledge; improve your word connect skills; beat the word connect challenges.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:58:05", "background_image": "https://media.rawg.io/media/screenshots/a89/a891616289c10d0886de9f2db7bd64a0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 63, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Crazy Word Games"], "genres": [], "publishers": [], "esrb_rating": null}