{"id": 224312, "slug": "super-blackjack-battle-2-turbo", "name": "Super Blackjack Battle 2 Turbo", "name_original": "Super Blackjack Battle 2 Turbo", "description": "Headup Games and Stage Clear Studios would like to welcome you to the greatest Blackjack tournament the world has ever seen!<br/><br/>Super Blackjack Battle II Turbo edition introduces a roster of 12 very different characters all competing to become the greatest Blackjack player of all time.<br/><br/>Following an invitation by the owner of the largest Casino in Las Vegas and Godfather of the local most influential crime family, each character will face the other participants in a face off game of cards. Only the best of them will fly to Vegas to challenge the Godfather himself in a final match, not knowing that the tournament itself is nothing more than a charade to hide a ruthless master plan to defeat the competing clan family...<br/><br/>More information will be revealed over time, but let's tease you with some features:<br/>- It's Blackjack!<br/>- It tributes to a well known arcade fighting game from the '90s<br/>- A rooster with 12 characters from all around the World such as Mark, an undercover FBI Agent, Kamiko from Japan, seeking revenge for her Uncles death or Gregor, a South African warlord.<br/>- Ten different story lines with individual endings and dialogues in an epic Single player campaign<br/>- Up to four player online matches where people can freely drop in and out<br/>- Ranked online PvP mode with online leaderboards<br/>- Cross-platform online multiplayer for up to four players<br/>- Google Play Game Services<br/>- Supports Tablets", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:58:19", "background_image": "https://media.rawg.io/media/screenshots/8cf/8cf7f6b6f2287c1b2696a36712febc73.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 146, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Headup Games"], "genres": ["Card"], "publishers": [], "esrb_rating": null}