{"id": 22436, "slug": "galactic-inheritors", "name": "Galactic Inheritors", "name_original": "Galactic Inheritors", "description": "You have reached to stars to find that the dreams of a new utopia was dead before it began. Ancient technologies spread over the galaxy leave a sword of Damocles hanging over you. Now you must go out into the stars to conquer or perish. <br/><br/><strong>GALACTIC INHERITORS</strong> is a new space 4X game from Crispon Games and published by Argonauts Interactive. The game focuses on science fiction, strategy and empire building.Features<br/><ul><li>Explore the Galaxy, look for the key choke points to guard your empire and cut off your opponents avenues of expansion. <br/></li><li>Research technologies to gain new ships and solar system improvements. <br/></li><li>Improve your solar system's infrastructure to take advantage of your investment. <br/></li><li>Build up your navy, gain experience in ship building and unlock powerful new bonuses for your ship designs and building partners.<br/></li><li>Use the power of the media to steer your people opinions of your neighbours, but pay attention of what their media say too.<br/></li><li>Manage your empire bonuses over time to reach your conquest goals.<br/></li><li>Keep on your toes! The galaxy is treacherous and bad (or good) surprises are waiting for you throughout the game.</li></ul>", "metacritic": null, "released": "2015-06-09", "tba": false, "updated": "2019-08-28T22:07:32", "background_image": "https://media.rawg.io/media/screenshots/c6a/c6a29434cb3c5f4dd6899ef74afd8d0c.jpg", "website": "http://www.argonautsinteractive.com/galactic-inheritors.html", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 55}, "playtime": 4, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 383, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Crispon Games"], "genres": ["Strategy", "Indie"], "publishers": ["Plug In Digital", "Argonauts Interactive"], "esrb_rating": null}