{"id": 22433, "slug": "16-bit-arena", "name": "16 Bit Arena", "name_original": "16 Bit Arena", "description": "<ul><li> It's FREE!<br/></li><li> Fight in turn-based multiplayer battles up to 9v9 with the old school graphics you've been missing!<br/></li><li> Enter battle as a Warrior, Mage, Rogue, or Healer of either gender, and use a card to transform into any of 16 characters, combining their stats and abilties with your class's! <br/></li><li> Elemental properties for every character; collect gems that let you choose yours, and cast its magic! <br/></li><li> Gain Charge during battle to do more damage, boost specific stats, and more-- or just save your turns for later and pummel an enemy all at once! <br/></li><li> A rockingly awesome soundtrack! <br/></li><li> Journey through eight intense Trials to gain cards and gems for use in the Arena! <br/></li><li> Enjoy the 2-player tactical-RPG-style Card Game-- a great additional game on its own, it lets you earn cards and gems too! <br/></li><li> In the mood to just chat for a bit?  Hang out in the lobbies, the Card Game, or even the audience of the Arena!<br/></li><li> Wins in large battles are recorded to the server and periodically posted, so people can see where you rank!<br/></li><li> Updated just before the Steam release with new backgrounds and other improvements!<br/></li><li> Play as a Champion (boss) and take on 9 enemies at once!</li></ul>", "metacritic": null, "released": "2015-03-24", "tba": false, "updated": "2019-09-17T09:29:23", "background_image": "https://media.rawg.io/media/screenshots/04a/04a01f5348a4f5a30b3225fb2ff7e3f9.jpg", "website": "http://www.16bitarena.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 4, "owned": 273, "dropped": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 3, "suggestions_count": 269, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC"], "developers": ["16bitarena.com"], "genres": ["Action", "RPG", "Strategy", "Casual", "Massively Multiplayer", "Indie"], "publishers": ["16bitarena.com"], "esrb_rating": null}