{"id": 224444, "slug": "city-of-gangsters-3d-mafia", "name": "City of gangsters 3D: Mafia", "name_original": "City of gangsters 3D: Mafia", "description": "In Crime lord: Gangster City 3D you play as Paulie Bonbanno, a small time mobster looking to avenge the death of his other family members. You start out in the city of Hunters Hill, knowing that the killers of your family have established a foothold for their operations here. Hunters Hill is a small city controlled by three other rival cities, these families keeping the city under a firm grip. Having rackets all over town, and attacked each other all the time.  <br/><br/><br/>You begin with your territory establishing, take on small car thief missions to earn a quick bug. Or bring people away with legal taxi driving missions. But the best money is in setting up a network of different rackets, as you hire gangsters and muscles to take over and to protect them. Wreak havoc on your rivals establishments, by killing their henchmen and taking over all their operations. As the game goes on, you are going to set up your own illegal businesses, hiring more and more gangsters to protect you rackets, shops and other stuff.<br/><br/><br/>But besides this players can embark on a spectacular crime spree, stealing cars, collecting and dropping of different packages. Can you survive the dangers of the criminal underworld in this fun open world game. Us the hard earned money to upgrade your rackets hire specialist, customize your rides. <br/><br/>Crime lord: Gangster City 3DD game features:<br/>-Build out your mobster empire as you take over rival rackets, shops become the ultimate kingpin. <br/>-Hire gangsters and muscles to protect your own rackets<br/>-Earn daily cash, spend it on upgrading stores and build a collection of epic cars as well<br/>-You can steal all kind of different vehicles in the epic looking crime game<br/>-Steal, Sell and buy cars, upgrade these into the vehicle you want to have<br/>-Super simple and easy controls and super advanced real physics engine.<br/><br/><br/>Crime lord: Gangster City 3D is set in a massive open world city that is full of different mission types, making this this one of the most fun crime games ever seen on mobile or tablets. The City feels like an open world, that is full of different missions and quests for you to take on. This game is not only a crime game, but also a real driving simulation game. The game isn’t a level by level game no the game offers a massive amount of missions. That make sure you as a small criminal in this crime city can become richer and richer. The mechanics of Crime lord: Gangster City 3D  feel like a basic third person shooter. Like in that genre of 3D action games you see the players character visible on-screen. <br/><br/><br/>Please give us some support by rating our game on Google Play or following us on:<br/>Facebook - https://www.facebook.com/VascoGames<br/>Twitter - https://twitter.com/VascoGames<br/>YouTube - http://goo.gl/HChVVx", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:57:47", "background_image": "https://media.rawg.io/media/screenshots/f1f/f1f29d4ab61d495832d68967fb872693.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 216, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["VascoGames"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}