{"id": 224489, "slug": "real-driving-ultimate-car-simulator", "name": "Real Driving: Ultimate Car Simulator", "name_original": "Real Driving: Ultimate Car Simulator", "description": "Ever desire to play the most realistic 🏎️racing car simulator? <br/><br/>Along with Real Driving, we're ready to surprise you with loads of cool realistic cars. <br/>Now you can drive, drift and customize a racing sports car for free! Fasten your seatbelt, here is a life-like vehicle simulator game for you！<br/><br/>Get behind the wheel and start your lessons in the most realistic city driving simulator around! This is a game that will not only test your skills in controlling the car but also demand full attention to traffic rules. <br/><br/>With its advanced realistic physics engine, this ultimate car game - Real Driving: Ultimate Car Simulator is going to provide you with addictive gameplay, and endless fun of driving simulation!<br/><br/>The tutorial will teach you all the ruls on how to drive and race your customized cars on challenging maps, finish multiple missions!<br/><br/>KEY FEATURES<br/><br/>▶ Beautiful 3D modern graphics.<br/>▶ 100% Free to play missions<br/>▶ Controls: Buttons, Wheel, Tilt &amp; MFi Game Controller Support<br/>▶ First person camera<br/>▶ Various racing scenarios, weather system, and racing tracks to choose from.<br/>▶ Realistic driving simulator system, accurate simulation of real car driving experience.<br/>▶ Authentic car accident, and car damage physics effects.<br/>▶ Unlimited customization: Customize your cars with paint, tires, rims.<br/>▶ The Coolest car collection.<br/><br/><br/>Pick your own classic, modern or luxury car, drive in cockpit view through the endless traffic and realistic environment. Become a furious racer, hurtle on city, country, wherever you want! Overtake traffics to earn coins as much as possible, and unlock more brand new fancy cars!<br/><br/>Get your car ready and start your engine! With the amazing real-like racing car simulator, feel free to immerse yourself in the pleasant of speeding!<br/><br/>Download Real Driving for FREE to show off your driving skill now! Trample the accelerator and speed up!", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:57:29", "background_image": "https://media.rawg.io/media/screenshots/08b/08be1956f56a853e3333b05dd5a4cf3b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 133, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Magic Puzzle"], "genres": ["Racing"], "publishers": [], "esrb_rating": null}