{"id": 224462, "slug": "fashion-fever-dress-up-styling-and-supermodels", "name": "Fashion Fever - Dress Up, Styling and Supermodels", "name_original": "Fashion Fever - Dress Up, Styling and Supermodels", "description": "Express your style and rule the runways in Fashion Fever! Start your career as a stylist on a promising fashion studio and travel around the world showcasing your skills by putting together the best looks for beautiful top models at the most famous fashion capitals, including Miami, Sao Paulo, Sydney, Paris, Madrid and Milan.<br/><br/>Explore all the hottest and trendiest fashion brands and choose the right outfits for every event or occasion. Pick a classic summer look for the fashion magazine photo shoot, and a sexy alternative look for the club! As your career takes off, gain access to the best and most exclusive clothes as you make your way to stardom.<br/><br/>HIGHLIGHTS<br/>• GO SHOPPING and CUSTOMIZE the looks with dozens of options of clothes and accessories<br/>• DRESS FOR THE JOB: put together incredible looks from unique fashion brands<br/>• STYLE the perfect outfit for every occasion and become the one everyone talks about<br/>• FUN MINIGAMES to earn extra cash<br/><br/>Fashion Fever is the definitive game for fashion lovers. Are you ready to live the runway life?<br/><br/>Please note! This game is free to play, but it contains items that can be purchased for real money. Some features and extras mentioned in the description may also have to be purchased for real money.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:57:40", "background_image": "https://media.rawg.io/media/screenshots/14f/14f851ab465a970ab7a5cd34fb84c408.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 281, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Tapps Games"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}