{"id": 224434, "slug": "3d-airplane-flight-simulator", "name": "3D Airplane Flight Simulator", "name_original": "3D Airplane Flight Simulator", "description": "Do you have the dream of working in the aviation industry? Let your career take off here with this cool new 3D flight simulator game. This 3D flight game is your chance to put yourself in the pilot’s seat of four different airplanes.  3D Airplane flight simulator is a realistic flight simulator game where you have to pilot your aircraft safely to the ground into the air and more!. Flight control has already give you clearance to land your plane. And after learning the first ropes of how to fly a big aircraft like an Airbus A321, you get the change to take up controls of a Boeing 727, Boeing 747-200 and the Boeing 737-800. With over 20 aeroplane missions in this free airplane game you will get more than enough flight hours . <br/><br/>This new android flight simulator will challenge you to practice landing and taking off your airplane. The challenge of this flight sim 3D game is that you have a limit amount of time to get your commercial airplane safely on the ground. And landing and take-off is not all you need to learn with this 3D flight game, there is also a need for aircraft pilots that know how to taxi there airplane to the airport, and airport hangar. <br/>To be the most successful aeroplane pilot in the sky you need to follow the directions from flight control closely. So you know what direction you need to go. <br/><br/>3D Airplane flight simulator – game features<br/>-\t20 different airplane missions – landing , taking off, and more.<br/>-\tNew improved airplane physics.<br/>-\tChange your view to Cockpit view .<br/>-\tFly an Airbus A321, Boeing 727, Boeing 747-200 and the Boeing 737-800<br/>-\tTime challenge you you could enjoy the scenery of the sky around you but time is not on your side. Bring your aircraft down before time runs out!<br/>-\tWatch out for skyscrapers or else its mayday, mayday and that is not good for your flight career.<br/>-\tDifferent airports to land your aircraft and to take off from.<br/>-\tNew aviation missions will follow. <br/>-\tNew airplanes will be added. <br/><br/>Keep your aircraft in the sky can be a very difficult task! You as an aircraft pilot will experience how it feels to really fight a big commercial aircraft. VascoGames is therefore happy to bring you 3D airport flight simulator. This is a new android flight simulator, we hope you will enjoy to this cool new 3D flight game. To keep up-to-date about new levels and new aircrafts that will be add please follow us on Facebook or Twitter!<br/><br/>Facebook - https://www.facebook.com/VascoGames <br/>Twitter - https://twitter.com/VascoGames", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:57:51", "background_image": "https://media.rawg.io/media/screenshots/6db/6dbb592873231142e1a60863bba2bc4e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 238, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["VascoGames"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}