{"id": 224401, "slug": "budge-world-kids-games-fun", "name": "Budge World - Kids Games & Fun", "name_original": "Budge World - Kids Games & Fun", "description": "☆Start your 7-day free trial today!☆ <br/><br/>EXCITING GAMES FEATURING 16 AWARD WINNING BRANDS INCLUDING:<br/>My Little Pony • Barbie • Thomas &amp; Friends •Transformers Rescue Bots • Animal Planet • Discovery • Strawberry Shortcake • Caillou • Hello Kitty • Crayola • Budge Laughter Lab • The Smurfs • Garfield • Care Bears • Miss Hollywood • Hasbro<br/><br/>PLAY – LEARN - CREATE – DISCOVER:<br/>-TONS TO SEE AND DO – Each brand has its own portal filled with activities<br/>-NEW CONTENT CONSTANTLY – Regularly updated with exclusive content such as new themed lands, new characters, stickers, games, learning activities, and more!<br/>-INSPIRE LEARNING – Practice spelling, counting, and art with exciting activities!<br/>-VIDEO – Play clips and take pop quizzes!<br/>-EARN &amp; COLLECT – Collect new characters and customize your world with prizes, stickers and more!<br/><br/>No pop-up ads or in-app purchases for subscribers<br/><br/>SUBSCRIPTION DETAILS<br/>Budge World is a subscription service. Subscription to the app gives full access to all the content of the app for as long as the subscription is active. New content added monthly for subscribers. Some content only becomes available as kids progress in the game, such as prizes, stickers and new Budge characters.<br/><br/>- This app offers monthly subscriptions.<br/>- Users may be offered a free trial of the subscription.<br/>- One free trial per account, on new subscriptions only.<br/>- Users will need to opt-in to a subscription in order to accept the trial period and will have the right to opt-out at any time during the trial period. Users will be automatically charged after the trial period if they haven't opted out.<br/>- Subscription automatically renews unless auto-renew is turned off before the end of the current period.<br/>- You can cancel or manage your subscription &amp; turn off auto-renewal by going to the Account Settings after your purchase<br/>- You can cancel your subscription at any time, but please note that you will not get a refund for any remaining period of a subscription.<br/>- If you have any questions or need help, please contact our Customer Support at support@budgestudios.ca<br/><br/>PRIVACY AND SAFETY<br/> Budge Studios takes children's privacy seriously and ensures that its apps are compliant with privacy laws. This application has received the “ESRB (Entertainment Software Rating Board) Privacy Certified Kids’ Privacy Seal”. For more information, please visit our privacy policy at: https://budgestudios.com/en/legal/privacy-policy/, or email our Data Protection Officer at: privacy@budgestudios.ca<br/><br/>TERMS OF USE / END-USER LICENSE AGREEMENT<br/>This application is subject to an End-User License Agreement available through the following link: <br/>https://budgestudios.com/en/legal/eula/<br/><br/>Before you download this app, please note that this app may be free to try, but additional content is only available to subscribed users. It may contain advertising from Budge Studios regarding other apps we publish.<br/><br/>Please note that this app gives users the ability to take and/or create photos in-app that can be saved locally to their devices. These photos are never shared with other users in-app, nor are they shared by Budge Studios with any unaffiliated third party companies.<br/><br/>BUDGE STUDIOS, BUDGE, BUDGE WORLD and BUDGERS are trademarks of Budge Studios Inc. All other trademarks featured in this app are the property of their respective owners and used under license by Budge Studios Inc.<br/><br/>BUDGE WORLD © 2016-2019 Budge Studios Inc. All Rights Reserved.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:57:57", "background_image": "https://media.rawg.io/media/screenshots/554/554299ec8054076c5208b0739c9de434.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 200, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Budge Studios"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}