{"id": 224536, "slug": "balls-bounce-blast", "name": "Balls Bounce Blast", "name_original": "Balls Bounce Blast", "description": "Ready for a blast! Do not let colorful balls fill up the screen! <br/> <br/><br/>This is a funny but intense balls bouncy game ever in Google Play.<br/><br/>Balls Bounce Blast is a playful classic mechanic ball bouncing game. Simply tap a single or multiple same color balls and make them blast. Be aware of big emoji colorful balls! Blast it can get higher points.<br/><br/>Balls Bounce Blast will be the best arcade game to release your mind and kill time, you can play Balls Bounce Blast by only one hand. Simple but very addicted‼ <br/><br/>HOW TO PLAY <br/> <br/>🔸 Click 1 or more jewels bubbles to crush them<br/>🔹 Tap extra size emoji balls can make a blast to destroy all small emoji balls around<br/>🔸 Tap only one emoji bubble will drop 3 more bubbles<br/><br/>BALLS BOUNCE BLAST PUZZLE FEATURES <br/> <br/>🔸 Colorful and funny emoji balls<br/>🔹 Easy and free fun to play, challenging to master<br/>🔸 Tricky big balls! Be careful, blast it and get more points!<br/>🔹 Different challenging modes and speed, the more you play, the more fun and challenge you have<br/>🔸 Physical balls bouncing mechanical system, make it bounce, make it blast!<br/>🔹 Interesting sound effects<br/>🔸 Simple HD graphic <br/>🔹 Addicting classic game mode<br/>🔸 Free for all ages: play with your friends, family, children <br/><br/>Download<br/> for free today, make a blast‼", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:57:09", "background_image": "https://media.rawg.io/media/screenshots/ac9/ac954816889048ac4ea0c41994511414.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 48, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Magic Puzzle"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}