{"id": 224577, "slug": "gladiator-heroes-clash-fighting-and-strategy-game", "name": "Gladiator Heroes Clash: Fighting and Strategy game", "name_original": "Gladiator Heroes Clash: Fighting and Strategy game", "description": "Welcome to the best fighting and strategy game, where gods and heroes clash to reach glory.<br/><br/>Fight with valor, fight for your blood and glory in an epic fight. This is the first fighting and strategy game where you can play and fight against epic enemies. Play with warriors, fighters and gods such as Thor or Xena! <br/><br/>Heroes, warriors and Gods of ancient Rome will defeat the enemy and conquer the world. This is the ultimate gods and heroes clash. Step into the arena and prove you are the best fighter in this heroes clash, separating blood from glory as you prosper in the fight.<br/><br/>In this addictive fighting and strategy video game you can play with the best gladiators, gods and heroes. Players such as Thor, god of war, or Xena, the warrior princess, are in the best fighting and strategy video game on the market.<br/><br/>Download this exciting and addictive fighting and strategy game, and join the best fighting warriors in a battle with the gods!<br/><br/>Valor and glory are at stake, and only the best fighters of the Roman Empire will achieve victory. The fight has already begun, equip yourself with the best weapons and defeat enemy fighters. <br/><br/>Mortal, join the best fighting warriors in a gladiator battle! In Gladiator Heroes Clash, you can unlock and wield the best kinds of weapons and resources in the game. Plan your strategy and defeat the other fighters.<br/><br/>Go into the fight with a well-planned strategy: in Gladiator Heroes Clash you are the game’s protagonist. Apart from just fighting in the arena with different weapons and against a multitude of enemies, you can also buy and sell fighters and evolve them into the best fighters in the Roman Empire in this incredible fighting and strategy game. <br/><br/>Lead your fighter team to an epic fight against the empire in the best fighting and strategy game. Build your battle strategy and defeat enemies from around the world. Play the online event game mode and face limitless action. Upgrade your fighting troop with unique fighting skills and obtain all the weapons.<br/><br/>It’s god versus gladiator, heroes versus warriors, and tons of other fighters in the best strategy fighting game! Assemble a team and begin your quest to become the Ultimate Gladiator of the Roman Empire!<br/><br/>Gladiator Heroes Clash - the best heroes, gods and warriors fighter game - puts the power, intensity, and raw emotion of adrenaline-fueled visceral strategy fighting in the palm of your hand.<br/><br/>PLAY GLADIATOR HEROES CLASH, the best fighting and strategy game:<br/><br/>Epic fighting and strategy game mode where the fighting clans will fight to dominate the empire.<br/><br/>Organise your fight strategy choosing the best weapons to carry out your attack.<br/><br/>Incredible graphics that recreate challenging fighters and imposing coliseums, where you will have to fight and defeat your enemies.<br/><br/>Enjoy multiplayer PvP events with unstoppable action against other fighters. Fight non-stop with the best strategy and turn-based tactics video game. Face your friends, choose your best fighter and win the fight.<br/><br/>You can also build powerful alliances! Build the best city to supply, heal, and tend to your army of fighters.<br/><br/>Fights, blood, battles and strategy are mixed in this incredible fighting and strategy game that recreates the time of the great fighters of the Roman Empire such as Thor, god of war, or Xena, the warrior princess, considered by many to be the real Gods of ancient Rome.<br/><br/>Download and Play the best fighting and strategy game on the market and fight with gladiators, gods, heroes and legendary fighters from around the world!<br/><br/>DOWNLOAD it now and ENJOY the best fighting and strategy game: Gladiator Heroes Clash Game - Fighting and Strategy game!<br/><br/>Best Video Game Ever: http://bestvideogameever.com/<br/><br/>Gladiator Heroes Clash: Fighting and Strategy game is a free action and strategy game, but you will have the option to buy some items in the game in exchange for real money.<br/><br/>www.generagames.com", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:56:50", "background_image": "https://media.rawg.io/media/screenshots/70a/70a690ef64b9f2f842fd967046b01d79.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 565, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Genera Games"], "genres": ["Action"], "publishers": [], "esrb_rating": null}