{"id": 224546, "slug": "castle-clash-kings-castle-de", "name": "Castle Clash: King's Castle DE", "name_original": "Castle Clash: King's Castle DE", "description": "🇩🇪 🇩🇪 🇩🇪 This is the optimized version of Castle Clash in German, for a better user experience, we recommend you to install the English version of the game through the following link:<br/>https://play.google.com/store/apps/details?id=com.igg.castleclash&amp;referrer=utm_source%3DDE%26utm_campaign%3DEN<br/><br/>War is about to begin and you have a whole kingdom at your command. It is time to forge strategic alliances and plan brilliant strategies in order to attack and conquer enemy kingdoms in the most addictive fortress war MMORPG!  Command your army and start the fight against the enemy to build the biggest empire ever! A new era of heroes is beginning: Lead your army and conquer the world!<br/><br/>Defend your king castle-fortress, customize your knight troops and attack enemies to survive in this MMORPG. Experience a refreshing tactical adventure in a co-op RPG or multiplayer battlefield full of enemy kingdoms. The world is at war: Rewrite the course of history! Hire powerful soldiers and heroes who will fight for your castle and win epic PvP battles! <br/><br/>Think like a strategist and act decisively as a king in any MMO battlefield situation! Equip your magician, warrior or druid with infinitely customization weapons, equipment, enchantment and armor to clash in an endless war duel against other empires. Learn to fight the enemy using the best strategy to become the most powerful Lord in Castle Clash MMORPG! Аn ultimate invasion strategy game in real-time PvP battles!<br/>Join thousands of players and elite troops on a middle ages adventure to complete multiplayer strategy role-playing fortress games! Battle across hordes of enemies, dragons, elves, archers, swordsman and monsters and crush your enemy's castle deploying different troops! <br/>Start now with your army recruitment, create a powerful empire with your alliance, prepare your kingdom for the invasion and conquer enemy's territories to expand your borders! Put your strategies to the test in dungeons, raids and more in this action MMORPG!<br/><br/>- Build an impregnable castle and customize your middle ages empire defense and offense in this PvP and PvE game!<br/>- Plan your invasion strategy, conquer other kingdoms and recruit the best soldiers to create the ultimate army!<br/>- Collect and evolve dozens of action heroes with magic attacks! <br/>- Attack and invade the rival castle to increase your power and protect your empire realm resources to grow in this MMORPG!<br/>- Endless possibilities to get ready for the battle using different tactics against rivals as a middle ages king!<br/>- Play solo or in a co-op mode along your guild in a multiplayer role-playing campaign<br/>- Protect your castle's resources with many dangers waiting ahead, as well as attack and take over other's in this RPG: Build the strongest empire of the civilization and become a legend!<br/>- Epic medieval empire conquest: Jump into the arena in PvP or PvE war strategy and castle games!<br/><br/>Our fantasy world is at war: Defend your castle, lead your kingdom to victory and win this legendary role-playing challenge! Are you ready for the ultimate kingdom clash?<br/><br/>Note:This game requires an internet connection.<br/>Facebook: http://www.facebook.com/CastleClashDe", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:57:04", "background_image": "https://media.rawg.io/media/screenshots/470/47056e2d2f0c4e4d2eb73e03fa5a5761.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 179, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["IGG.COM"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}