{"id": 224534, "slug": "food-cats-rescue-the-kitties", "name": "Food Cats - Rescue the Kitties!", "name_original": "Food Cats - Rescue the Kitties!", "description": "Congrats, you’re the newest member of the Food Cats Support Foundation. Your new job is to rescue adorable kittens from being confused with food and put into lunch boxes! Use your Food Cats Tracker to find boxes with cute cats inside so you can save and keep them forever!<br/><br/>KITTY HIGHLIGHTS<br/>😺FIND and COLLECT many kinds of cute food cats and save them from being locked forever into lunch boxes!<br/><br/>😺RELAX in the company of your kitties and enjoy cozy moments!<br/><br/>😺ENJOY simple and easy gameplay sessions with a pleasant and fun atmosphere!<br/><br/>😺MEET food cats with different personalities and make a big, happy and diverse kitty family as you find more and more cats!<br/><br/>You simply can’t leave these adorable food cats inside those stuffy lunch boxes. The Food Cats Support Foundation needs your special cat tracking talents to save the kitties and keep them warm and safe in your cute food cat collection!<br/><br/>After rescuing your first adorable kitty, you’ll fall in love with these amazing creatures: finding them all will become a personal quest! Relax and have fun admiring your growing kitty collection, but be careful: you might never want to leave your new fluffy buddies!<br/><br/>Please note! This game is free to play, but it contains items that can be purchased for real money. Some features and extras mentioned in the description may also have to be purchased for real money.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:57:10", "background_image": "https://media.rawg.io/media/screenshots/477/477389f5510d2c01de0bb3c13d0b2c58.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 128, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Tapps Games"], "genres": ["Casual"], "publishers": [], "esrb_rating": null}