{"id": 224512, "slug": "castle-clash-rpg-war-and-strategy-fr", "name": "Castle Clash: RPG War and Strategy FR", "name_original": "Castle Clash: RPG War and Strategy FR", "description": "🇫🇷 🇫🇷 This is the optimized version of Castle Clash for French, for the best user experience, we recommend you to install the English version of the game through the following link:<br/>https://play.google.com/store/apps/details?id=com.igg.castleclash&amp;referrer=utm_source%3DFR%26utm_campaign%3DEN<br/><br/>Wage war, fight against armies, battle kingdoms, build your castle and conquer an empire in the fortress war of this action real-time strategic MMORPG! <br/>The world of Castle Clash is yours to explore: Divide, conquer and win the combat! Choose your favorite heroes and build the perfect team with your comrades-in-arms to create the best strategy, defeat other empires and win this PvP epic war! <br/><br/>Fortify your walls, hire troops, and get ready for a multiplayer battle. Assemble an army of unique heroes, team up and communicate with your friends for epic alliances, battle across hordes of enemies and monsters and crush your enemy's castle deploying different troops! The best combat defense is a good offense: Plan your strategy, get into the arena and clash against other players on an epic war in this real-time MMORPG!<br/><br/>Conquer a castle while you experience a refreshing tactical adventure in a RPG multiplayer duel full of enemy kingdoms. Hunt your adversaries on the battlefield, feel the adrenaline of the action and become the champion sword inside this PvP war.<br/><br/>Every war has its heroes: Equip your wizard, magical warrior or druid with infinitely customizable weapons and armor to clash in endless war duel games against other empires. Learn to fight the enemy warriors using the best strategy and defend your army to become the most powerful lord in Castle Clash MMORPG! <br/>Join thousands of players and elite troops around the world on a fantasy journey to complete multiplayer strategy tournaments! Create with your MMORPG alliance an indestructible empire against the opponents' attack!<br/><br/>- Build an impenetrable castle and customize your empire defense and combat offense!<br/>- Plan your invasion strategy, conquer other kingdoms and recruit the best soldiers and warriors to create the ultimate army!<br/>- Collect and evolve dozens of action heroes with magic attacks in your military camp!<br/>- Attack the rival kingdom to increase your power and protect your empire resources to grow in this MMORPG!<br/>- Fight for the glory against enemy warriors as a mighty king and become a legend!<br/>- Join Fortress Feud for guild-on-guild fun!<br/>- Battle and clash with players from all over the world in this MMORPG to create the strongest empire ever!<br/>- If you like castle games, come join this exciting co-op and PvP modes, more than any other RPG war strategy game!<br/><br/>Stay alive and resist the attack: The secret to victory is to never give up! You can change the course of this battle MMORPG! Ready for the ultimate kingdom clash?<br/><br/>Note: This game requires an internet connection.<br/><br/>Facebook: https://www.facebook.com/CastleClashFr/", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:57:21", "background_image": "https://media.rawg.io/media/screenshots/868/868071af4737aa32d2fe98c122383122.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 184, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["IGG.COM"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}