{"id": 22461, "slug": "midnight-mysteries-3-devil-on-the-mississippi", "name": "Midnight Mysteries 3: Devil on the Mississippi", "name_original": "Midnight Mysteries 3: Devil on the Mississippi", "description": "<p>Down by the deep and muddy Mississippi, something’s not right. A ghostly riverboat brings to light a new conspiracy for players to unravel in this all-new Midnight Mystery. </p>\n<p>Mark Twain’s ghost has come to you seeking help from an evil that has been stalking him in the afterlife.  Trace the steps in Twain’s past that led to a lifetime of anguish.  Twain’s passion for literary history reignites a controversial debate about the true identity of Shakespeare; the age-old question resurrects a series of malevolent characters.  After waking an unexpected evil, Twain sets about to rid his time of the darkness, but the plot only thickens.  With Twain’s help, you have to unravel the connections to try and set history straight while dangerous forces loom.</p>\n<p>Who wrote the works of Shakespeare? And just how did Mark Twain get caught up in a strange Elizabethan rivalry all those years later?  Find out in this Midnight Mystery!</p>\nKey Features:\n<ul>\n<li>Complete all-new adventure missions by searching through hidden objects for tools, collecting additional tools to solve brain-teasing puzzles and interviewing apparitions from the past\n</li><li>Figure out the connection between humorist Twain and the Elizabethan Shakespeare\n</li><li>Detailed hint system to help you at any step along the way\n</li></ul>\nCollector’s Edition Includes:\n<ul>\n<li>Exclusive Bonus Mission! Explore all of Twain’s secrets\n</li><li>Helpful fully-integrated Strategy Guide \n</li><li>Peek behind the scenes with a treasure of Concept Art \n</li><li>12 Beautifully illustrated Wallpapers \n</li><li>Bonus “Dem Bones” Game Mode \n</li><li>Explore the Panic Room to relive all the special effects \n</li></ul>", "metacritic": null, "released": "2011-05-26", "tba": false, "updated": "2023-08-22T13:52:45", "background_image": "https://media.rawg.io/media/screenshots/666/666409e4c56cfe9c1fa4b4d1a6decd3d.jpg", "website": "http://www.facebook.com/MumboJumboGames", "rating": 3.57, "rating_top": 4, "added_by_status": {"yet": 5, "owned": 314, "beaten": 5, "toplay": 1, "dropped": 1}, "playtime": 4, "achievements_count": 16, "ratings_count": 7, "suggestions_count": 643, "game_series_count": 0, "reviews_count": 7, "platforms": ["PC", "iOS"], "developers": ["MumboJumbo"], "genres": ["Adventure", "Casual", "Puzzle"], "publishers": ["MumboJumbo", "Big Fish Games"], "esrb_rating": null}