{"id": 224611, "slug": "aeroplane-parking-3d", "name": "Aeroplane Parking 3D", "name_original": "Aeroplane Parking 3D", "description": "Aeroplane Parking is a 3D aeroplane simulator game in “Arcade” category on Google play.<br/><br/>Enjoy the new game of simulator parking from Timuz. Your mission is to park all the airplanes as soon as they arrive on the runway. Park each airplane on the marked parking area. Play exciting levels that will challenge your parking skills. Avoid speed parking, drive carefully and do not crash your aero plane. If you like parking mania games and crazy parking or simulator games, then you will like this game.  Avoid the bus, car and trucks on the runway of the airport.<br/><br/>GAME FEATURES:- <br/><br/>- 100% free game-to-play<br/>- Different airplane to drive and park <br/>- NEW Realistic physics <br/>- Real 3D environments, with multiple camera views <br/>- Google Play Game Services integrated for leader boards and achievements.<br/>- UNLOCK new achievements to challenge your friends on leader board.<br/>- Share on Facebook and Google Plus. <br/><br/>So what are you waiting for? Start the Parking Mania now!<br/><br/>How to Play:-<br/>Tap your phone/tablet on right side to drive / brake.<br/>Tap on left to control steering.<br/><br/>Check out our free games previews, game trailers, videos and more free apps in the future.<br/>Game Videos and Trailers:-<br/>http://www.youtube.com/user/gamesgeni?feature=watch<br/>Like us on Facebook:-<br/>https://www.facebook.com/timuzsolutions<br/><br/>This game is suitable for all kind of genres from kids, girls and boys of all ages.<br/><br/>Install and Play our new game in arcade game category – Aero plane parking 3D for free on Android now!<br/><br/>COMPATIBLE with all mobile devices of android above 2.2 and up.<br/>If you have any problem in installation, please report to us. We will try to fix it as soon as possible.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:56:45", "background_image": "https://media.rawg.io/media/screenshots/4bc/4bc79f0991954fd33395696b5dfc97d7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 251, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Million games"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}