{"id": 224715, "slug": "quadropoly-academy-data-science-for-board-game", "name": "Quadropoly Academy - Data Science for Board Game", "name_original": "Quadropoly Academy - Data Science for Board Game", "description": "This is a Classic Property Trading Game with hundreds customisation options supercharged with Artificial Intelligence trained on real games with professional players. Download and enroll into Quadropoly Academy today!<br/><br/>With this Classic Property Trading Game you will be able to learn how to play on professional level and compete in International Tournaments by playing with state of the art AI trained with Machine Learning. Unique and exclusive AI Advice feature would guide you through your learning journey. With Roll Your Own Dice feature you will see the winner is decided not by the Dice and luck, but your skill and strategy.<br/><br/>Artificial Intelligence in Quadropoly has been training on a vast collection of real games for 2.5 years and counting. AI becomes better with every player who could achieve at least 40% winrate on Monopolist or 30% on Champion difficulty levels.<br/><br/>🎯 First real Artificial Intelligence for Classic Business Board game, third after Deep Blue for Chess and AlphaGo for Go<br/>📇 Support for all official rules by the book<br/>🎻 Support for majority of house rules<br/>🎓 AI advice at any moment in game to speed up your learning<br/>🎭 Every single AI in every game is unique and has its own personality which defines its risk taking or risk averse tendencies as well as the attitude towards property. AIs are great at imitating real people: they could be annoyed, desperate and greedy as well as 'feel' a range of other emotions<br/>🎲 Optional External Dice feature<br/>🌠 Variable game speed<br/>💾 100% data integrity<br/>🏆 Detailed Account information with statistics, custom built leaderboards and challenges<br/>🆕 Frequent updates with new features: http://quadropoly.com.au/app-releases/<br/>📠 Full anonymous logs (5-8Kb per game) are uploaded to the Cloud for Machine Learning<br/>❕ Learn about differences between AI levels through in-game help<br/><br/>This is Academy: it has all AI levels with most Pro features available but supported by ads<br/><br/>These are the main foundations this game has been built on:<br/>🔵 No cheating. No re-rolls, every dice roll is final. No hidden luck parameters used by others, regardless of the difficulty. Pure data science for Machine Learning versus your skill with guaranteed random dice rolls<br/>🔵 No preferential (discriminatory) trading for AI. This is the second trick others use to lift the difficulty. In Quadropoly, AI does not know whether their trading partner is another AI or a human, regardless of the difficulty: trade offer evaluations depend on pretty much everything on the board at the moment of trade, but not on who their opponent is<br/><br/>This classic Board Game has been built by independent fans for people who appreciate true challenge of super intelligent AI instead of widely used cheats. The goal of this project is to prove data science could be a lot of fun!<br/><br/>Unlike human opponent, AIs are infinitely patient, make their turn as fast as you tell them and never quit the game when you start winning. Additionally, with AI advice system in Quadropoly you can rapidly improve your own skills in any Business Trading game, learn the real value of the properties, monopolies and money, improve your negotiation skills, and, most importantly, avoid throwing (or dodging) game pieces at your opponents face.<br/><br/>With 6 AI difficulty levels available you can always stop on a level you feel comfortable with, advancing at your own pace. With top level AI capable of participating in monopoly Championships, even the best players in the World are guaranteed to find the game very challenging yet 100% fair.<br/><br/>If you would like to share your thoughts on what could be improved - please contact us at clevermindgames@gmail.com<br/><br/>If you like the game, please support our work by upgrading to Pro version. You will get larger board, no ads and other exclusive features: https://play.google.com/store/apps/details?id=au.com.quadropoly.monopoly<br/>Your progress will be preserved!<br/><br/>Powered by Python, Kivy and Kivent", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:56:14", "background_image": "https://media.rawg.io/media/screenshots/f0f/f0f040f4c8b2b9eb675561be121472f2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 211, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Clever Mind Games"], "genres": ["Board Games"], "publishers": [], "esrb_rating": null}