{"id": 224788, "slug": "farm-town-cartoon-story", "name": "Farm Town: Cartoon Story", "name_original": "Farm Town: Cartoon Story", "description": "Designed for family.  <br/><br/>★ ★ ★ ★ ★ Cutest free farm game. ★ ★ ★ ★ ★<br/>★ ★ ★ ★ ★ Top new free hay and farm experience on your android. ★ ★ ★ ★ ★<br/>★ ★ ★ ★ ★ More than 10 000 000 people played farm town and enjoyed farm town 2! ★ ★ ★ ★ ★<br/><br/>Invite all your friends in cute farm town game! Prepare yourself for dozens of receipts for cooking, crafting and growing. Plant fresh crops like hay, vegetables, fruits, and berries. Equip and develop your farm with new cars and buildings. Take care of the cute pets - here you will find a cow, peacock, pig, sheep, ostrich, and many other animals. <br/><br/>Build beautiful estate for all of your friends in different style: American mansion, Japan house and Spain hacienda and many others buildings for your serves!<br/><br/>Fantastic farm + hidden object. Unique HOB will bring you an opportunity to find wonderful things on your farm, and craft it into next items in hidden.<br/><br/>Produce useful goods like bring your farm to prosperity. <br/><br/>But that's not all! In this game you will have ability not only to build your farm - the whole nearby city and will depends on your success.<br/><br/>Enlist the support of your friends, and create your own distribution network, help the development of the city and provides residents with supplies and ... Who knows, maybe it is you who will one day become the mayor of Farm Town! Its hay day on your farm.<br/><br/>Welcome to the exciting game about the life of a villager near the town of<br/><br/>Group on Facebook:<br/>https://www.facebook.com/pages/Farm-Town-2-Group/1510680039145047", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:55:52", "background_image": "https://media.rawg.io/media/screenshots/063/063d8c33363cf15d90326d477ff2f83e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 113, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["foranj"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}