{"id": 224852, "slug": "the-little-prince-bubble-pop", "name": "The Little Prince - Bubble Pop", "name_original": "The Little Prince - Bubble Pop", "description": "The most classic and amazing bubble shooter adventure game based on the first-ever animated feature film adaptation of Antoine de Saint-Exupéry's iconic masterpiece, The Little Prince! Match 3 or more bubbles to make them blast. Blast and pop bubbles in this amazing bubble game.<br/><br/>Play for free. Pop the bubbles &amp; match 3 of the same color to eliminate them in this awesome new bubble shooter. Play with the Little Prince, the young girl, the aviator, and all of your other favorite characters from the movie! Enjoy various maps from this bubble game, including the desert where an old man shows the little girl an extraordinary world where anything is possible, and where he encountered the mysterious Little Prince. Sometimes the bubbles will go down gradually so you need to shoot quickly to avoid death!<br/><br/>Travel around the magic world bursting as many bubbles as you can in this exciting adventure. Help the little girl escape from her monotonous life of rules and homework, and play with her in this magical bubble shooter game, based on the new film The Little Prince. Take on this epic game alone or play with friends to see who can get the highest score!<br/><br/>Features:<br/><br/>- POP BUBBLES WITH THE MOVIE CHARACTERS!<br/><br/>- THIS BUBBLE GAME INCLUDES 3D MAPS<br/><br/>- AMAZING POWER-UPS &amp; special features to boost your bubbles<br/><br/>- GREAT ANIMATIONS &amp; stunning graphics from the film<br/><br/>- FUN FOR ALL AGES.<br/><br/>- POP ALL BUBBLES TO WIN AWESOME PRIZES!<br/><br/>This new game is sure to provide HOURS OF UNBEATABLE FUN AND POP BUBBLES! IT IS THE BEST BUBBLE SHOOTER EVER!<br/><br/>And remember this… “It is only with the heart that one can see rightly. What is essential is invisible to the eye”<br/>The Little Prince is completely free to play bubble game but some in-game items such as extra moves or lives will require payment.<br/>Already a fan of The Little Prince - Bubble Pop? Like us on Facebook to stay up-to-date: <br/><br/>https://www.facebook.com/TheLittlePrinceBubblePopJourney/<br/>VISIT US: https://www.generagames.com", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:55:45", "background_image": "https://media.rawg.io/media/screenshots/1e8/1e8638abee4327cce9049e4fb5256800.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 183, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Genera Games"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}