{"id": 22492, "slug": "slip", "name": "Slip", "name_original": "Slip", "description": "Slip is a fast paced side scrolling platformer that utilizes a two-color swap mechanic to allow the player to evade danger. Slip is not for the faint of heart. It has an immense focus on timing and features devilishly tricky level design. Utilizing your two colors, absorb damage from incoming projectiles of the same color, or be destroyed immediately by the opposite color. Additionally, Slip features colored Geometry that you only interact with when you share its color. This is perfect when you need a place to stand, but can result in instant death if you land on a set of spikes sharing your color. In addition to color based obstacles, Slip is also host to numerous Color driven props. Sharing the color of a launch-ring will shoot you in the direction it faces. Match the color of a gravity well to get sucked in and color swap again to have it launch you in which ever direction you are spinning. Lastly, utilize the phase shift platforms to shift vertically in the direction of your color. <br/><br/><strong>Game Progression: </strong><br/>Slip is split up into 12 levels with an overworld connecting them. Game progression is linear with each level being unlocked when the level before it is beaten. Each level features a plethora of deadly obstacles that result in instant death. However, since the game can be quite difficult, there are frequent checkpoints laid throughout each level. Lives are NOT limited. You can press on until your thumbs are weary. <br/><br/>At the end of every level there is a mini-boss or boss encounter. During these sequences the game switches to an autorun mode where the player can adjust their position on screen by moving left or right. Here, positioning can mean the difference between life and death.Why we run: The story of Slip.You play as the devilishly cubie protagonist. You've always been pretty awesome with your ability to swap between 2 colors. You're a pretty sweet deal. Your nemesis Steve, on the other hand, is gross and smooth, nasty and organic. His color is that of a sickly peach. Why doesn't he just swap colors like you? Because he can't. Because he's Steve. In his early years Steve idolized you. He wanted to be you. After a failed attempt to become your sidekick (you don't have sidekicks since you're not a superhero) Steve began to seclude himself from the world. His envy of you grew and turned to hatred and resentment. He worked tirelessly in his lab creating all forms of horrible beings. His greatest triumph however has just been unleashed upon you. You couldn't have foreseen in your wildest dreams that Steve's malice would lead to such a monstrosity as the color purple. And now, it is upon you.<strong>Key Features</strong><ul><li>Steam Leaderboards: Keep track of your rank in every level of Slip. (PC only. The Mac version does not have Steamworks support)</li></ul><ul><li>Challenge Levels: In addition to the core game levels, there are also 20 challenge levels that really put your platforming skills to the test.</li></ul><ul><li>Controller Support: Enjoy Slip from the couch. (PC only. Mac versions of Slip do not have controller support)</li></ul><ul><li>Accessory Unlocks - To add a bit of silly to a light hearted game, players can also unlock clothing accessories to wear while playing. These accessories are unlocked by feats of skill while playing. The requirements can range from beating the first level to completing a level without dying.</li></ul><ul><li>3 Difficulty Levels - Even though Slip is immensely difficult (in a fair sort of way) players will find that their skill level increases dramatically as they master the art of color swapping. As such, there are 3 levels of play. Normal - 100% gamespeed. Hard - 110% gamespeed. And Sassy - 120% gamespeed. These percentages might not sound intimidating, but they are really quite dramatic in the context of Slip</li></ul>", "metacritic": null, "released": "2014-04-28", "tba": false, "updated": "2022-09-29T23:22:27", "background_image": "https://media.rawg.io/media/screenshots/e5c/e5c92eb0b0ae802d1313feefc0aadcbc.jpg", "website": "http://www.handsomegames.net/slip.html", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 114, "dropped": 1}, "playtime": 1, "achievements_count": 21, "ratings_count": 3, "suggestions_count": 361, "game_series_count": 0, "reviews_count": 3, "platforms": ["macOS", "iOS", "PC"], "developers": ["Handsome Games", "Noah Cremer"], "genres": ["Action", "Arcade", "Indie"], "publishers": ["Handsome Games", "Noah Cremer"], "esrb_rating": "Everyone 10+"}