{"id": 224922, "slug": "car-toons-2", "name": "Car Toons", "name_original": "Car Toons", "description": "• Clear the Road with a Wicked 80’s Rescue Squad <br/>After more than a decade of service, the CAR TOONS have been written off as scrap metal. However, today an emergency call from the government brings them back into action! Gangster Cars are all around and terrorizing the streets. This situation requires some serious measures, which only the CAR TOONS and their \"unconventional\" methods can deliver. <br/><br/>• Equipped with awesome Super Powers<br/>The CAR TOONS never leave a garage without some decent new equipment. Use it wisely to ram all the baddies off the screen. Solve over 100 cleverly designed missions. Outwit the gang and serve up some sweet justice! <br/><br/>SUPER POWERS INCLUDE:<br/><br/>++ Lightning Fast 180° Turns.<br/>++ Rocket Engine Turbo Boost<br/>++ Super Jump <br/><br/>KEY FEATURES:<br/><br/>✓ 100+ Missions and Never-Before-Seen Gameplay<br/>Solve over 100 unique levels and challenges with fresh physic-based gameplay.<br/><br/>✓ Three Different Characters<br/>Control three completely different vehicles each with its own special abilities and personality<br/><br/>✓ Hilarious Art Style and Story Telling<br/>Enjoy an entertaining cartoon art style and some of the funniest \"one-liners\" since the 80’s<br/><br/>✓ Justice at your Fingertip<br/>Use pinpoint accurate touch screen controls <br/><br/>✓ Challenge the World<br/>Make your way to the top position on the leader boards and unlock dozens of achievements", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:55:30", "background_image": "https://media.rawg.io/media/screenshots/e06/e068ad5b39366a75bb36abd09c750ce3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 143, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["FDG Entertainment GmbH & Co.KG"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}