{"id": 225, "slug": "pixel-people", "name": "Pixel People", "name_original": "Pixel People", "description": "Welcome to the world of Utopia where YOU create the city and the residents. <br/><br/>&amp;quot;Pixel People takes an apocalyptic future and makes it hopeful, cheerful and bright—if it&amp;#39;s where freemium games are headed, we have a lot to look forward to.&amp;quot; — Touch Arcade, 5/5<br/><br/>&amp;quot;Pixel People is an excellent and addictive mash-up of town building and element combining. Download it!&amp;quot;— IGN, 9.0/10<br/><br/>&amp;quot;Seriously good&amp;quot; — Computer &amp;amp; Videogames, 8/10<br/><br/>&amp;quot;It&amp;#39;s got charm in spades, depth of play and an awful lot of content to keep your fingers busy for a long time to come.&amp;quot; — Modojo, 4.5/5<br/><br/>&amp;quot;Simple, elegant and endlessly entertaining&amp;quot; — Kotaku<br/><br/>&amp;quot;The game strikes a great balance between accessibility, with its loveable pixelated population, familiarity, and innovation...&amp;quot; — EDGE<br/><br/>This app offers in-app purchases.  You may restrict in-app purchasing using your device settings. <br/><br/>Greet new clones to Utopia at the arrival centre, then find them a place in your new world. Splice genes of residents and combine their skills to discover new Pixel People to join your thriving city.<br/><br/>• VARIETY IS THE SPLICE OF LIFE<br/>Combine the properties of Utopia residents to create 400 new occupants, each one suited to a special role in your new society. You can create Athlete Stanley Cupp, Judge Judy Schuss, or even Buccaneer Yoho Howe! <br/><br/>• MONEY MONEY MONEY<br/>Each new job you create for a Utopian resident puts money in the bank, and the more residents you place in each building, the more money you make! Use your cash to build more residences, places of work, and to expand your land. Collect or buy Utopium to speed up building processes and reveal secret recipes for creating exotic residents.  <br/><br/>• LOTS TO DO<br/>As your population grows, love can blossom in Utopia too, and you can earn a sweet bonus for every 11 love hearts you collect. Bonuses could be coins, Utopium, or even a wild animal to wander your world?<br/><br/>• EASTER EGG<br/>Discover all the secrets of Utopia with Pixel people&amp;#39;s delightful hidden secrets — unlock certain buildings for enchanting surprises!<br/><br/>Key Features:<br/>• Create 400 different Pixel People<br/>• Find hidden animals through secret combinations and bonuses<br/>• Find secret bonuses and minigames inside your buildings<br/>• Distinct pixelated art style <br/>• Share your newly created Pixel People on Facebook<br/>• Move and customize your Pixel Utopia however you wish <br/><br/>Visit the Chillingo room on the App Store to see more of our great games: appstore.com/chillingo <br/>\u2028\u2028 <br/>Important Consumer Information. This app: Requires acceptance of EA’s Privacy &amp;amp; Cookie Policy and User Agreement.Includes in-game advertising. Collects data through third party ad serving and analytics technology (see Privacy &amp;amp; Cookie Policy for details). Contains direct links to the Internet and social networking sites intended for an audience over 13. Allows players to communicate via Facebook notifications and gifting. To disable see the settings in-game. <br/><br/>User Agreement : http://terms.ea.com/en<br/>Privacy &amp;amp; Cookie Policy : http://privacy.ea.com/en<br/>Visit http://www.chillingo.com/about/game-faqs/ for assistance or inquiries.<br/><br/><br/>EA may retire online features and services after 30 days notice posted on www.ea.com/1/service-updates", "metacritic": null, "released": "2013-01-31", "tba": false, "updated": "2019-11-01T03:13:13", "background_image": "https://media.rawg.io/media/screenshots/eb5/eb56a744c49eabd3f6131e3bfedf8720.jpg", "website": "https://chillingosupport.zendesk.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 2, "toplay": 2, "dropped": 2, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 3, "suggestions_count": 365, "game_series_count": 0, "reviews_count": 3, "platforms": ["iOS", "Android"], "developers": ["Electronic Arts Chillingo", "Lamb Damu Pte"], "genres": ["Adventure", "Strategy", "Simulation", "Educational"], "publishers": ["Chillingo", "Lamb Damu Pte"], "esrb_rating": null}