{"id": 225011, "slug": "magic-tiles-piano-despacito", "name": "Magic Tiles Piano Despacito", "name_original": "Magic Tiles Piano Despacito", "description": "Ever heard of Beethoven, Chopin, Bach or Mozart? Ever had a dream of becoming an adored musician, a loved pianist surrounded by fans and admirers? Ever dreamed of playing classical songs like Little Star with Piano Play Game, Cannon, Jingle Bells or Fur Elise on a piano key?<br/>This is a super fun Piano Tiles and highly addictive game suited for everyone best game 2017.<br/>No special skills needed for Magic Tiles Piano Play, all this game asks of you is an attentive mind and fast fingers!<br/><br/>Game features: <br/>1.Finish your achievements to get more diamonds and coins. <br/>2.Master's challenge kicks off! Reach the peak experience of speed challenge.<br/>3.Brand new slider tile gamplay brings you more exciting gaming experiences.<br/>4.There are more albums and songs of various styles. <br/>5.You can add songs to your favorite, play both classical and pop music to enrich your playing experience. <br/>6.New interface and new song lists make it easier to choose songs.<br/>7.Compete with friends and global players<br/>8.Easy to master with visual effect incomparable<br/>10.Enjoy a brand-new level of sound quality<br/><br/>Game rules: <br/>Tap on the black tiles while listening to music. Avoid the white ones! Hurry now! Enjoy classical and pop music, challenge your friends, improve your tapping speed!. Compete with your friends and speed up your fingers!", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-31T02:37:58", "background_image": "https://media.rawg.io/media/screenshots/beb/beb6e625c9c501bcbb01b9337dbc75d8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 49, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Great Music Games"], "genres": [], "publishers": [], "esrb_rating": "Everyone"}