{"id": 225009, "slug": "baby-smart-games", "name": "Baby Smart Games", "name_original": "Baby Smart Games", "description": "Baby Smart Games is a learning game pack for babies and kids of all ages consisting of 18 games where children can arouse their curiosity and develop intelligence and skills as creativity, coordination or memory. Educational game for kids. Hours of learning time with our kid game.<br/><br/>At early age, sensory stimulation is essential for children's development.This game contains educational and instructional content for babies and children to develop their language and listening skills through relaxing music.<br/><br/>18 GAMES TO DEVELOP CHILD’S INTELLIGENCE<br/><br/>  In this game pack, children can:<br/><br/>- Learn to write uppercase and lowercase letters and numbers from 0 to 20. Choose from 5 languages: English, German, French, Italian and Spanish.<br/>-Learn the sound of percussion musical instruments like the tambourine, maracas or bell.<br/>-Stimulate their memory by recognizing pairs of objects and figures.<br/>-Create their first musical pieces, playing the piano.<br/>-Distinguish shapes and colors to match the pieces accompanied by stimulating classical music.<br/>-Distinguish colors and show your ability to move animated screen objects.<br/>- Match the pictures and play with wooden pieces.<br/>- Learn the sound of piano and play music.<br/>- Play puzzles with pictures of your environment.<br/>- Play with butterflies, fishes and other animals.<br/>- Discover amazing fun with soap bubbles and balloons.<br/>- Draw funny pictures with a lot of pencils and colors.<br/>- Boost reaction time and improve reflex coordination of movements with drawings.<br/><br/>GAME FEATURES<br/>Children can have fun playing a long time.<br/>Besides the game to acquire the following skills by playing:<br/>- Improve children's skills in memory, concentration and development of knowledge of their environment.<br/>- Help with the recognition of the letters of the alphabet.<br/>- Keep the children entertained with fun sound effects and animal sounds, musical instruments and vehicles ..<br/>- The game is adapted to be handled very easily.<br/>- It is specifically designed as an educational tool for interface of preschoolers and late<br/>-Relaxing music and sounds to enhance concentration and spark the imagination.<br/>-Multilingual: Children can learn the pronunciation of numbers and letters in different languages.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:55:14", "background_image": "https://media.rawg.io/media/screenshots/162/1623c22891ad55e7e820c6da34bddc08.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 155, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["AppQuiz"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}