{"id": 225036, "slug": "educational-games-for-kids", "name": "Educational games for kids", "name_original": "Educational games for kids", "description": "You are a parent and you are trying to relax a little by playing your favorite game. Your child keeps asking you to let them try it... But this game is not suitable for children (because it’s a little scary and not educational at all). Does this situation sound familiar?<br/><br/><br/>At last: a well thought-out, smart, polished, ‘console quality’ educational game pack is out for your kids. Suitable for boys and girls from ages 3 to 18. A pack of 21 different games with 51 variations that educate in various ways like: reflexes, logic, math, memory and knowledge. Keep track of your child's progress with our statistics. All games have easy-to-learn controls with interesting and fun things to do. At last, a pack of games designed to educate and make your children smarter. The game runs natively in 4K when supported.<br/><br/><br/><strong>What's included in this Educational Games pack:</strong><br/><ul><li> Reflex: Riding a tricycle. (Ages: 3-4)<br/></li><li> Reflex: Riding a scooter. (Ages: 5-7)<br/></li><li> Reflex: Riding a bike. (Ages: &gt;8)<br/></li><li> Logic: Jigsaw puzzles with four variations. (Ages: &gt;3)<br/></li><li> Math: Addition, Subtraction, Multiplication and Division with many variations. (Ages: &gt;6)<br/></li><li> Knowledge: World Geography of Countries/States plus capital cities. Huge game that includes all the world. (Ages: &gt;11)<br/></li><li> Knowledge: World Flags. Another huge game with many variations. (Ages: &gt;11)<br/></li><li> Memory: Sharpen your child's memory. Three difficulty variations. (Ages: &gt;3)<br/></li><li> Logic: Mazes. Find your way out the maze. Five difficulty variations. (Ages: &gt;3)<br/></li><li> Just for Fun: Dress up a girl just for fun. (Ages: 3-5)<br/></li><li> Just for Fun: Color many sketches just for fun. (Ages: 3-5)<br/></li><li> Logic: Categorize the animals, birds and fish. (Ages: 3-5)<br/></li><li> Logic: Categorize the colors of the objects around you. (Ages: 3-5)<br/></li><li> Logic: Categorize the shapes of the objects around you. (Ages: 3-5)<br/></li><li> Knowledge: Get to know the sound each musical instrument makes. (Ages: &gt;6)<br/></li><li> Logic: Learn how colors are mixed. (Ages: &gt;6)<br/></li><li> Logic: Build IQ by understanding patterns. (Ages: &gt;4)<br/></li><li> Logic: Is it a toy or is it food? Simple and fun game for young children. (Ages: 3-4)<br/></li><li> Logic: Match the shape to its identical hole. (Ages: 3-4)<br/></li><li> Knowledge: Learn and hear the number from 1 to 20 by popping balloons. Translated professional speech in eight languages included. (Ages: 3-4)<br/></li><li> Hidden Dragon Game. Needs all games completed with 3 stars to unlock! (Ages: &gt;4)</li></ul><br/><strong>Features:</strong><br/><ul><li> Runs natively in 4K at 60FPS (when supported).<br/></li><li> 21 different games with many variations designed to make your children smarter.<br/></li><li> Suitable for boys and girls, even from very young ages i.e., 3-18.<br/></li><li> Focuses on many areas like: reflexes, logic, math, memory and knowledge.<br/></li><li> Statistics included to see your child’s progress.<br/></li><li> A hidden dragon game ready to be unlocked by completing a task.<br/></li><li> Budget price.<br/></li><li> Many interesting Achievements.</li></ul>", "metacritic": null, "released": "2020-09-01", "tba": false, "updated": "2020-09-04T02:21:28", "background_image": "https://media.rawg.io/media/screenshots/88c/88c4e4864e5b6ef5a640221ab9db8399.jpg", "website": "https://www.crazysoft.gr/all/educational_games_for_kids.php", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 243, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "PlayStation 4", "Android"], "developers": ["crazysoft", "AppQuiz", "Choloepus Apps"], "genres": ["Action", "Strategy", "Casual", "Educational", "Indie"], "publishers": ["Crazysoft"], "esrb_rating": null}