{"id": 225035, "slug": "clockmaker-amazing-match-3", "name": "Clockmaker - Amazing Match 3", "name_original": "Clockmaker - Amazing Match 3", "description": "Be the hero of the Clockmaker story and help Uncle rescue the townspeople from the evil curse of the Maleficent Clockmaker. Match cascading jewels and gems and use special boosters to beat thousands of unique and challenging levels. Explore buildings around town and meet new characters. Download now to embark upon a mystical puzzle adventure! Play Clockmaker offline or online without ads - no Wifi or Internet connection required.<br/><br/>💎Features 💎<br/><br/>- Intricate match three in a row - ancients artefacts, cursed and broken mechanisms;<br/>- Pop jewelry, crush and blast puzzles - challenge yourself!<br/>- Immerse into a mysterious atmosphere - gloomy and majestic buildings<br/>- Find the maleficent antagonist and reveal his secret, find out the Mystery!<br/>- Save an old town from the curse - bring joy to the dwellers! <br/>- Use powerful boosters - pop jewelry, blast puzzles easily<br/>- Over a thousand breathtaking puzzle quests - drive away your boredom!<br/>- New updates and challenges every month - join us on Facebook<br/>- Facebook login, new HD graphics, cross device, Android support<br/>- Play free offline, online - no Wifi or Internet required, no ads<br/>- Clockmaker - a game with an amazing story for adults and young adults.<br/><br/>OVER 30 MILLION USERS<br/>Clockmaker downloads have exceeded 30 million users! People all over the world are playing this amazing atmosphere match-3 adventure quest game. Play anywhere and everywhere! An amazing story for everyone!<br/> <br/>CM is a free to play 3 match jewelry game but some optional in-app items will require payment.<br/> <br/>Follow us to get news and updates:<br/>facebook.com/clockmaker.game<br/><br/>Discuss the hardest gem quests you have encountered. Watch the walkthroughs of the puzzle adventure game. Reach out with any Wifi or Internet connection issues, bugs. Enjoy daily/weekly bonuses when offline, online. Enjoy new levels, locations and stories!<br/><br/>Explore other products by our company:<br/>facebook.com/ice.cream.game (pop &amp; crush candies saga) (available for Android as well)<br/>facebook.com/funkybay (farm, adventure island) (available for Android)", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:55:05", "background_image": "https://media.rawg.io/media/screenshots/61d/61d67a3a0ef5767e0eca16298cfcf490.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 394, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["BELKA GAMES"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}