{"id": 225003, "slug": "cruel-games-red-riding-hood-hidden-object-game", "name": "Cruel Games: Red Riding Hood. Hidden Object Game", "name_original": "Cruel Games: Red Riding Hood. Hidden Object Game", "description": "<p>MOST POPULAR GAME IN &quot;HIDDEN OBJECT&quot;, &quot;DETECTIVE&quot;, &quot;I FIND&quot; GENRES IS ALREADY HERE AND REPRESENT TO YOU A UNIQUE EXCITING STORY, BASED ON A FAMOUS FAIRY TALE!<br />\nTake on the role of an innocent woman, trapped in a twisted game with a known murderous psychopath and stalker. Due to your attire, he dubs you Red Riding Hood. His wicked fairy tale begins by kidnapping your fiancé, and dragging you through challenging hidden object sequences, puzzles, and a chilling adventure for the ages!  Beware the Big Bad Wolf in Cruel Games: Red Riding Hood!<br />\nA psychotic killer wants to play a game.  He has dubbed you Red Riding Hood, as your red attire suits the story well. You must play through his wicked fantasy and sick imagination, investigate crimes, complete quests, solve puzzles, mysteries, arcana and going from one crazy puzzle to the next!  Find hidden objects throughout the world to help you on your journey to save the one you love. Don’t be afraid, as the wolf can sense your fear. Make sure this best hidden object detective story has a happy ending by defeating the Wolf and ending his murderous game! Cruel wolf is very hungry and his hunger games are ready to begin! True Battle Royal starts now!<br />\nTHIS BEST HIDDEN OBJECT FAIRY TALE FINDING GAME FEATURES:<br />\n◇ 38 creepy locations and amazing designed levels to play!<br />\n◇ 28 mini-games and numerous puzzles to solve add to the unlimited fun<br />\n◇ A plethora of hidden object scenes<br />\n◇ 100% unlimited Hints and Tips to help if you get stranded!<br />\n◇ Interactive tutorial to help get you off to a fast start<br />\n◇ Tons of enchanted hidden objects to find, addicting quests, funny mini-games and logic puzzles to solve!<br />\n◇ Awesome cinematic cut scenes and best hidden object gameplay!<br />\n◇ Story-driven game - Epic storyline, fillfull of love, desire and real fear!<br />\n◇ Equally suitable for teenagers, and adults<br />\n◇ Help you improve your concentration, perception, and focus, enhance your cognitive capacities<br />\n◇ Revise your vocabulary and improve your memory and mind<br />\n◇ Nice and beautiful graphics!<br />\n◇ Catchy melodies and sound!<br />\n◇ Play on all kind of mobile phones or tablets<br />\n◇ No Wi-Fi or internet connection required - play where and when you want!<br />\n◇ Supported languages: English, French, Deutch, Spanish, Danish, Hebrew, Russian, Greek, Hungarian, Italian, Dutch, Norwegian, Polish, Portuguese, Romanian, Slovak, Turkish, Finnish, Czech, Swedish, Estonian<br />\nTo all players, who plays only excellent hidden object seek and find games:<br />\nYou can&#39;t missed this best detective thriller hidden object puzzle adventure!<br />\nDownload Cruel Games: Red Riding Hood and enjoy this crazy show!<br />\nThis fantasy epic story-driven hidden object quest game for girls and boys, kids, teenagers, and adults, contains exciting various challenges, greatest detective storyline to investigate, cute characters and unusual artifacts and abilities. Please, welcome to enjoy this one of the best most beautiful, deepest, highest-quality, most epic hidden object searching game on your mobile device!<br />\nIf you looking for “find the hidden object game”, please, welcome to download this perfect game!<br />\nMost beautiful, story-driven, highest-quality, most epic hidden object adventure puzzler game awaits you, stranger!<br />\nPlay the best games from &quot;Alawar&quot;, the creators of such games as Beholder, Farm Frenzy, The Treasures Of Montezuma, House of 1000 doors, on Google Play!</p>", "metacritic": null, "released": null, "tba": false, "updated": "2019-02-04T22:21:31", "background_image": "https://media.rawg.io/media/screenshots/702/70222bcabe431367c6152df61b26c56b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 1, "beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 280, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "Android"], "developers": ["Alawar Entertainment"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": "Teen"}