{"id": 225102, "slug": "pixel-soldiers-the-great-war", "name": "Pixel Soldiers: The Great War", "name_original": "Pixel Soldiers: The Great War", "description": "Pixel Soldiers: The Great War is a simple to play, but difficult to master turn based strategy game set during the First World War. You will choose to command the armies of either the Entente (France, Britain and Russia) or the Central Powers (Germany, Austria and the Ottoman Empire).<br/><br/>You will fight from 1914 to 1918 on the Western Front and Eastern Front. You will land on the beaches at Gallipoli, desperately hold or seize the important city of Verdun and try to achieve a breakthrough on the Somme.<br/><br/>This game is the fourth entry in the Pixel Soldiers series. Previous games: Pixel Soldiers: Waterloo, Pixel Soldiers: Bull Run and Pixel Soldiers: Gettysburg.<br/><br/><br/>BATTLES AND CAMPAIGNS<br/>*Mons<br/><br/>*Tannenberg<br/><br/>*Gallipoli<br/><br/>*Verdun<br/><br/>*Transilvania Campaign<br/><br/>*Somme<br/><br/>*Villers-Bretonneux (The first tank v tank battle in history) <br/><br/><br/>FEATURES:<br/>*Command your armies with ease.<br/><br/>*Difficult to master in-depth strategy.<br/><br/>*Play against an intelligent AI opponent or another player on the same device.<br/><br/>*Morale system: Units that take casualties may go into disorder or break and run depending on their morale.<br/><br/>*Includes Entente and Central Powers campaigns, with historical scenarios throughout World War 1.<br/><br/>*Many different nations, types of units and weapons, complete with individual uniforms.<br/><br/>*Sandbox mode (available soon)<br/><br/>*Force the enemy from a position with a bayonet charge<br/><br/>*Amphibious assaults<br/><br/>*Create trenches<br/><br/>*Deadly machine gun posts, heavy howitzer artillery and field guns<br/><br/>*Tanks!<br/><br/><br/>STRATEGY AND TACTICS:<br/>Use the terrain to your advantage: Keep vulnerable units behind ridges or hide them in the trees. Protect vital mountain passes, river crossings, towns and forts.<br/><br/>Will you push your troops forward and seize the initiative? Or will you set up a defensive line, await reinforcements and let the enemy come to you?<br/><br/>These and many more questions you will need to ask yourself. There are many ways to win the game.<br/><br/><br/>HOW TO PLAY<br/>Tap to select a unit. Tap again to move or attack!<br/><br/>Long press on a unit or tap a unit's description to see more information<br/><br/>Pinch zoom in and out of the battle to get a better view.<br/><br/>Long press anywhere to check line of sight.<br/><br/>These are the basic controls to get you started. There is also a tutorial that can be accessed at any time.<br/><br/><br/>I want this game to be as good and as fun as it possibly can be so if you have any questions or ideas let me know! Email me at jollypixelgames@gmail.com", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-02T05:11:43", "background_image": "https://media.rawg.io/media/screenshots/6bc/6bc12eebc8bc9a146318b7909f0fe908.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 141, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Jolly Pixel"], "genres": ["Strategy"], "publishers": [], "esrb_rating": "Everyone 10+"}