{"id": 225121, "slug": "pixel-soldiers-waterloo", "name": "Pixel Soldiers: Waterloo", "name_original": "Pixel Soldiers: Waterloo", "description": "Pixel Soldiers: The Battle of Waterloo is a tactical turn-based strategy game. It is a single player game where you will fight against an intelligent AI opponent.<br/><br/>Become a Napoleonic General and take control of either the British, Prussian or French armies in scenarios starting with Napoleon’s crossing of the frontier into Belgium and ending with the Battle of Waterloo.<br/><br/>Similar in style to Advance Wars or Panzer General, Pixel Soldiers: The Battle of Waterloo is a game for wargamers and casual gamers alike.<br/><br/><br/>FEATURES:<br/>*Command your armies with ease.<br/><br/>*Difficult to master in-depth strategy.<br/><br/>*Intelligent AI.<br/><br/>*Morale system: Units that take casualties may go into disorder or break and run depending on their morale.<br/><br/>*Includes British, French and Prussian campaigns, with historical scenarios leading up to the battle and culminating with the assault of the Imperial Guard at Waterloo.<br/><br/>*Many different types of units complete with individual uniforms (see the Coldstream Guards, 95th Rifles and Imperial Guard and many more in all their pixel glory!)<br/><br/><br/>STRATEGY AND TACTICS<br/>Use the terrain to your advantage: Keep vulnerable units behind ridges or hide them in trees. Turn nearby villages and farmhouses into defensive bastions.<br/><br/>Use your artillery for long range fire support or risk placing them near the enemy to use murderous canister shot.<br/><br/>Place your cavalry on the flanks or keep them in reserve for a devastating counter attack.<br/><br/>Use your various Infantry well. The 95th and Kings German Legion Rifles can outmatch any other at long range, whereas the Guardsmen and Imperial Guard are best suited for close range gritty fighting.<br/><br/>Will you push your troops forward and seize the initiative? Or will you set up a defensive line, await reinforcements and let the enemy come to you?<br/><br/>These and many more questions you will need to ask yourself. There are many ways to win the game.<br/><br/><br/>HOW TO PLAY<br/>Tap to select a unit. Tap again to move or attack!<br/><br/>Long press on a unit or tap a unit's description to see more information<br/><br/>Pinch zoom in and out of the battle to get a better view.<br/><br/>Long press anywhere to check line of sight.<br/><br/>These are the basic controls to get you started. There is also a tutorial that can be accessed at any time.<br/><br/><br/>I want this game to be as good and as fun as it possibly can be so if you have any questions or ideas let me know! Email me at jollypixelgames@gmail.com", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-02T06:07:12", "background_image": "https://media.rawg.io/media/screenshots/ee3/ee35f86955b9507a53ca67e90df51bc3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 73, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Jolly Pixel"], "genres": ["Strategy"], "publishers": [], "esrb_rating": "Everyone 10+"}