{"id": 225115, "slug": "educational-games-memory", "name": "Educational Games. Memory", "name_original": "Educational Games. Memory", "description": "Educational Kids Memory Games consists of 12 games to develop memory and retentive capacity, aimed at children from 3 to 10 years old.<br/>Each of these games will help your kids process information and practice recognition memory through easy and fun exercises.<br/><br/>MEMORY EDUCATIONAL GAMES<br/>During early childhood, kids show a significant development of their memory. This app helps them exercise their mind and improve their ability to concentrate and focus.<br/><br/>With these memory games your kids will learn to:<br/><br/>- Develop recognition and memory skills.<br/>- Remember and detect different objects in an image.<br/>- Identify the clear relationship between objects and professions.<br/>- Associate the different elements in the rooms of a house.<br/>- Retain a visual image in short-term memory.<br/>- Stimulate and enhance the capacity for observation and attention.<br/>- Differentiate the musical sounds and associate them with different instruments.<br/>- Exercise memory with exercises of repetition and gradual difficulty.<br/>- Memorize sounds and objects present in everyday life<br/><br/>ILLUSTRATIONS AND DESIGNS FOR CHILDREN<br/><br/>Educational Kids Memory Games are games created with a very careful design and a simple interface for children to have fun while learning to play with animals and children's characters.<br/>Kids will discover the different rooms of the house of our raccoon pet and his friends, the animals, who will congratulate and encourage them every time they solve the game.<br/><br/>DIFFERENT DIFFICULTY LEVELS<br/><br/>Our goal is that, whatever the intellectual capacity of the child may be, they can sharpen their memory development. To do that, the game offers three difficulty levels (easy, medium and difficult), adapted to different ages and stages of development.<br/><br/>Easy: Ideal for beginners, especially for babies and kids at an early age.<br/>Medium: Perfect for those children who are already familiar with the game.<br/>Difficult: Suitable for kids who have managed to solve each game quickly and don’t need supervision of parents or teachers to solve them.<br/><br/>EDUJOY EDUCATIONAL GAMES <br/><br/>This app is part of an educational games collection created by Edujoy in order to help kids to develop new intellectual and motor skills from elements of their environment.<br/><br/>All our games are created by professional educators and psychologists in order to provide pedagogical content, necessary for the intellectual development of babies and children.<br/><br/>We love creating educational and fun games for you. If you have any suggestions or questions, feel free to send us feedback or leave a comment.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:54:39", "background_image": "https://media.rawg.io/media/screenshots/4c7/4c735bae16b2da68941b0883185dba49.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 131, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["AppQuiz"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}