{"id": 225283, "slug": "freecell-solitaire-pro-4", "name": "FreeCell Solitaire Pro", "name_original": "FreeCell Solitaire Pro", "description": "Classic FreeCell  Solitaire is one of the world’s most popular card games, and it's now yours, on your mobile device! Enjoy  gameplay designed for endless entertainment in the palm of your hand. It's perfect as a break from work, waiting in line, or just twiddling your thumbs! FreeCell is a form of Solitaire (or Patience) played with a standard 52-card deck. It is different than most other solitaire games in that nearly all deals are winnable making it more of a game of skill than luck.<br/><br/>BREATHTAKING GAMEPLAY<br/>- Drag and drop cards with your finger<br/>- Or tap a card to make a move<br/>- Gorgeous animations<br/>- Unlock new achievements as you play<br/><br/>CLASSIC FEATURES<br/>- Highlight Moveable Cards<br/>- Casino-quality random shuffle<br/>- Unlimited undo option and automatic hints<br/>- Track your FreeCell Solitaire statistics<br/>- Auto complete to finish game<br/>- Play in portrait or landscape view<br/>- Global Google Play Games leaderboard lets you see how your score stacks up<br/>- Share your score on Twitter, Facebook or via e-mail<br/><br/>Do you like puzzles and puzzle games? Want to lower your brain age with a brain game? Or do you simply want to kill time with a relaxing game of solitaire? If you answered yes, then this brain game is for you. Relax, have fun and lower your brain age with FreeCell Solitaire!<br/>With 7,000 trillion possible hands, you'll never get bored! We hope you enjoy the game. Please send us your feedback at: support@forsbit.com", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-31T02:43:14", "background_image": "https://media.rawg.io/media/screenshots/32f/32f8c4d3c60d35ed8341db3577c9d75d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 77, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["forsbit"], "genres": ["Card"], "publishers": [], "esrb_rating": "Everyone"}