{"id": 225274, "slug": "glitch-fixers-powerpuff-girls", "name": "Glitch Fixers: Powerpuff Girls", "name_original": "Glitch Fixers: Powerpuff Girls", "description": "The Internet is under attack! Battle monsters and solve puzzles with the Powerpuff Girls in Glitch Fixers, the game inspired by the PPG episode \"Viral Spiral\"!<br/> <br/>USE BRAINS + BRAWN<br/>Bubbles uploaded Blossom and Buttercup to the Internet, but they don’t have their powers! Use simple commands, procedures, and loops to launch the girls into action.<br/> <br/>BATTLE INTERNET TROLLS<br/>The Amoeba Boys have unleashed a mess of monsters onto the web. Take down mutant memes, Internet trolls, and spam bots before they ruin the Internet forever!<br/> <br/>RIDE A DINOSAUR<br/>Game on! Use special weapons like Bunny Bazookas, Rainbow Trout Blasters, Giant Rattles, and a Flying Triceratops to stomp your enemies.<br/> <br/>MASTER 40 LEVELS<br/>Solve all 40 puzzling levels to fix the glitch and defeat the Amoeba Boys. Are you Powerpuff enough?<br/> <br/>Save the day (and the Internet) in GLITCH FIXERS! <br/><br/>*****<br/><br/>IMPORTANT CONSIDERATIONS: <br/>This app may contain ads that feature other products, services, shows or offers from Cartoon Network and our partners.<br/><br/>PRIVACY INFORMATION: <br/>Your privacy is important to us at Cartoon Network, a division of Turner Broadcasting System, Inc. This game collects and uses information as described in Cartoon Network’s Privacy Policy linked below. This information may be used, for example, to respond to user requests; enable users to take advantage of certain features and services; personalize content; serve advertising; perform network communications; manage and improve our products and services; and perform other internal operations of Cartoon Network web sites or online services. Our privacy practices are guided by data privacy laws in the United States. For users residing in the EU or other countries outside the U.S., please note that this app may use persistent identifiers for game management purposes. By downloading this application, you accept our Privacy Policy and End User License Agreement, and you give permission for such uses for all users of your device. The Privacy Policy and End User License Agreement are in addition to any terms, conditions or policies imposed by your wireless carrier and Apple, Inc. Cartoon Network and its affiliates are not responsible for any collection, use, or disclosure of your personal information by Apple or your wireless carrier. <br/><br/>Terms of Use: http://www.cartoonnetwork.com/legal/termsofuse.html <br/>Privacy Policy: http://www.cartoonnetwork.com/legal/privacy/mobile.html", "metacritic": null, "released": "2016-12-01", "tba": false, "updated": "2020-04-03T11:42:42", "background_image": "https://media.rawg.io/media/screenshots/659/659b616548f8ef5d8e481c434657d945.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 244, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "Android"], "developers": ["Cartoon Network"], "genres": ["Action", "Arcade"], "publishers": ["Turner Broadcasting System"], "esrb_rating": null}