{"id": 225247, "slug": "backgammon-lord-of-the-board-online-board-game", "name": "Backgammon – Lord of the Board – Online Board Game", "name_original": "Backgammon – Lord of the Board – Online Board Game", "description": "Play Backgammon -  Lord of the Board, The #1 Free Backgammon App! Enjoy backgammon quick play with our great board games! Outsmart your opponent and play to win online backgammon with friends!<br/><br/>Challenge yourself or play online games with friend to master the backgammon rules with one of the most popular board games that has ever existed!<br/><br/>Download Backgammon - Lord of the Board today and get your free welcome bonus! Compete in challenging online board games and put your skills to the test! Chat with your friends in one of the best multiplayer strategy games – Backgammon – a classic board game.<br/><br/>Forget all you know about board games and other multiplayer games. Backgammon - Lord of the Board is one of the most competitive and addicting games out there! The adrenaline rush of winning backgammon tournaments and advancing to a top spot in the leaderboard is simply unbeatable. Join our community of online multiplayer games and get started today!<br/><br/>Backgammon – one of the oldest strategy board games in the world AKA: Narde, Tavli, Gammon, Nardi, Shesh Besh! <br/><br/>Play with backgammon masters in one of the top 10 board games.  Play online games with friends and practice your strategy development.  Learn to outsmart your opponent and become a backgammon champion.  Play for free the best new board games and have fun playing with friends online.<br/><br/>Download one of the best backgammon app and play backgammon with friends!<br/><br/>New Feature! Play Backgammon with friends<br/>Looking for backgammon games to play with your friends? Now you can compete with your Facebook friends online!  Invite and play online games with friends.<br/><br/>Roll the Dice &amp; Join the Fun! <br/>Everyone is competing in one of the best board games on Google Play! While some may call it Nardi or Narde, Tavla or Tabla or shesh besh, the rules are the same and the fun is universal. Beginner backgammon player or seasoned expert, rookie bets will get you started right away. Play free backgammon live alongside thousands of competitors worldwide. Roll dice, move pieces, win BIG! Enjoy Backgammon free download to become #1 place on the board! <br/>Join our backgammon tournaments and be the backgammon champion today!<br/><br/>Become the Backgammon Master<br/>Play backgammon online and master this game of dice, gain experience, earn coins and make your way to the top! Enjoy our one on one gameplay and multiplayer backgammon tournaments, which are all free to play. Unlock new and exciting content as you progress within the backgammon game, level up and lead the board in a highly popular game. <br/>Challenge other skilled players and see if you have what it takes to beat the competition and become the Lord of the Board! <br/><br/>Invest in Strategy <br/>When you’re playing against other backgammon masters, in one of the most challenging thinking games out there, every second counts! Reach your true potential by focusing on your backgammon game strategy and leave the rules and regulations to the app. Instead of wasting time on counting steps, plan your next move and outsmart your opponent! <br/><br/>Built by Pros<br/>Backgammon - Lord of the Board is brought to you by the creators of some of the leading online social games out there! Enjoy incredible features such as:<br/>•\tEnticing Graphics<br/>•\tEasy Enjoyable Gameplay<br/>•\tExciting Game Progression<br/>•\tPlayful Chat Options<br/>•\tLive Tournaments<br/>•\tPlayer Statistics Profiles<br/>•\tDice Roll - Completely Random! (Sophisticated RNG)<br/>•\tLots of Free Bonuses, Rings, Trophies, Prizes &amp; More!<br/>•\tUnique Competitive Leaderboards<br/><br/>Like us on Facebook for FREE COIN OFFERS!  https://www.facebook.com/441503676034501/<br/><br/>Have any suggestions for the game? Contact us at support@bbumgames.com.  <br/>This game is intended for adults and does not offer real money gambling or any opportunities to win real money or prizes. Success within this game does not imply future success at real money gambling. .", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-31T02:47:37", "background_image": "https://media.rawg.io/media/screenshots/ec6/ec603ea0c1358a6dbeb305bece38d463.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 158, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Beach Bum"], "genres": ["Board Games"], "publishers": [], "esrb_rating": "Teen"}