{"id": 22529, "slug": "the-amazing-bernard", "name": "The Amazing Bernard", "name_original": "The Amazing Bernard", "description": "You will play as THE Bernie O'Tag in an action/adventure/platformer/runner that will push you to the brink with a challenge worthy of the old school.<br/><br/>But who is Bernie O'Tag...?<br/><br/>A world-renowned, legendary hero with a career of success in some of the most dangerous and critical missions the world has seen...<br/><br/>That's the man the world knows...but I know Bernard O'Tag...and there's a story to be told to find out how the scrawny, meek Bernard I knew became the \"Amazing\" Bernie O'Tag...<br/><br/>....I'm going to make him tell that story and you are going to help me.<br/><br/><br/><strong>THE AMAZING FEATURES:</strong><br/>-30 no-two-the-same, pulse-pounding, super challenging levels to conquer as you discover the truth of Bernie O'Tag.<br/>-Use Bernie's Powers such as creating platforms and springs to keep him alive as he runs...and more! Be wise with that Energy Bar though...<br/>-3 Playable Heroes: Unlock and play as Barron and Anna, two new playable heroes each with their own play style that totally changes the game.<br/>-Challenge Mode: All 30 levels have 5 different Challenges to overcome, with each playable hero having their own unique set of Challenges! Can you perfect all 450 Challenges!?<br/>-Endless Runner Mode: Beat your high score! Wager, earn coins and top the leaderboard in 3 different endless runner levels, each with their own unique challenges.<br/>-Gorgeous 2D environments, from mystical forests to snow-capped mountains, the world of Bernard is something to behold!<br/>-Challenge yourself with over 70 Achievements!<br/>-Epic original soundtrack bringing you deeper into the story of Bernie O'Tag!", "metacritic": null, "released": "2016-05-31", "tba": false, "updated": "2019-10-22T14:30:34", "background_image": "https://media.rawg.io/media/screenshots/47c/47cceced6edfa5c304efb8d156528fdf.jpeg", "website": "http://www.kumkwat.net", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 28}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 546, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "PC"], "developers": ["Kumkwat Entertainment"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Kumkwat Entertainment"], "esrb_rating": "Everyone 10+"}