{"id": 22533, "slug": "river-city-melee-battle-royal-special", "name": "River City Melee: Battle Royal Special", "name_original": "River City Melee: Battle Royal Special", "description": "The 10% launch discount and additionally 10% loyalty discount for the previous franchise owners(20% in total)will be offered for the first week.<br/><br/>This is the most recent installment of the ‘Kunio-Kun’ franchise recreated as a fun and easy fighting game with the fighting aspects taken and upgraded from River City Super Sports Challenge ~All Star Special~.<br/><br/>The developers of the acclaimed fighting game series, ‘Blazblue’, have participated in this game, to improve the user experience. Game is designed to enhance the mind games and overall balance, which allows more strategic approach for players.Brand New System<ul><li> Rage Super Arts : Guage will be filled as you damaged, and eventually you will get into the \"Rage\" mode once you have max guage! In Rage mode, your overall and Super Arts will be enhanced! For example, you can see Mach Kick II instead of Mach Kick, Bomb punch will be explosive!, and so on.<br/></li><li> New Skills : On top of new special moves, all characters can now use the throw skill. With increased means to survive the battle, players can experience intense combat by lifting the opponent into the air and adding attacks, striking multiple opponents with the Giant Swing, etc.</li></ul>New Stage<ul><li> Football Stadium : Score Goals! Opponents will take damage when you make a goal to their goalpost.<br/></li><li> Factory Stage : Random items are generated when you push switches on both sides! Feeling lucky? Try your luck!<br/></li><li> You can find even more new stages in real game!! </li></ul>Introducing Game Mode<ul><li> Single Player : Enjoy each 25 team's unique story lines.<br/></li><li> Free Battle : Set each battle condition and get into the battle with up to 4 players.<br/></li><li> Multi-Player : Play with friends in online multi-player mode. Searching other player's online room is available.</li></ul>", "metacritic": null, "released": "2017-04-28", "tba": false, "updated": "2019-08-28T22:07:30", "background_image": "https://media.rawg.io/media/screenshots/540/540d389a3e7b9c2af785e174095ab036.jpg", "website": "http://www.h2interactive.co.kr/games/rivercitymelee/en/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 40}, "playtime": 3, "achievements_count": 24, "ratings_count": 2, "suggestions_count": 311, "game_series_count": 25, "reviews_count": 2, "platforms": ["PlayStation 4", "PC"], "developers": ["Arc System Works", "H2 Interactive Co"], "genres": ["Action", "Adventure", "Sports"], "publishers": ["H2 Interactive Co"], "esrb_rating": "Teen"}