{"id": 225373, "slug": "bubbles-empire-champions", "name": "Bubbles Empire Champions", "name_original": "Bubbles Empire Champions", "description": "Discover the new and addicting bubble shooter game! Take part in the legendary adventure, go to war against the colorful bubbles to defend your empire and win the fight. Try it out today and get ready for a clash in the epic shooting battle! <br/><br/>Popping bubbles was never so exciting! Play the action bubble pop game Bubble Empire Champions, work on your strategy, practice your balloon matching skills, and get ready to become the war hero!<br/><br/>Join the bubbles empires game, conquer hundreds of challenging levels and win points. Hit the target, blast and pop all the colorful balls and clear the board. Get it now for FREE and enjoy the most fun shooter game. You can play this bubbles game anywhere and anytime you’d like - no wifi and no internet required to become the puzzle fighter champion league.<br/><br/>Why You’ll Like this Bubble Shooter Game?<br/>* Play hundreds of addicting game levels, packed with fun championship puzzles.<br/>* Explore the empire kingdom bubble shooting legend, and enjoy the classic smooth gameplay.<br/>* Complete puzzle quests and collect awesome rewards.<br/>* Reach the epic game level target and win. <br/>* Fight alongside the bravest warriors of the kingdom and conquer all the amazing challenges. <br/>* Boost your experience with awesome power-ups and boosters and pop all the colorful balloons.<br/>* Shoot and explode 7 blaster balls in a row to unlock the FIREBALL that will burn every bubble on the way.<br/>* Drop 10+ bubbles at once to get a BOMB that will take out surrounding bubbles.<br/>* See which color you are getting next and work out a strategy to smash all bubbles using fewer shots. <br/>* Less moves you pass a level, the higher score you'll get.<br/>* Overcome the challenges and break all the bubbles to win boosters and power-ups.<br/>* Play offline!<br/><br/><br/>Aim, Hit the Target and Pop Bubbles!<br/>Solve puzzles in this fun bubble shooter and enjoy hundreds of addictive levels filled with fun and intriguing challenges. Come up with killer gaming tactics and win coins! Bubble Empire Champions is a relaxing free game, perfect for families and friends to play and have a great time. <br/><br/>Don’t miss out this epic legend! Are you ready to begin? Warm up your fingers and prepare for the great blast game battle. Join the hero adventure and blast your way to victory. If you love online puzzle games and can’t get enough of exciting brain teasers, this app is simply perfect for you. <br/><br/>Conquer the empire of bubbles and win big! <br/><br/>All rights of Bubble Shooter ™ are owned by Ilyon Dynamics Ltd.", "metacritic": null, "released": "2017-12-16", "tba": false, "updated": "2019-11-08T03:03:42", "background_image": "https://media.rawg.io/media/screenshots/e6b/e6bec3a3ce8fd4ca2a3e81518f05bef1.jpg", "website": "http://www.ilyon.net/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 2, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 102, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS", "Android"], "developers": ["Bubble Shooter Games by Ilyon", "Yonatan Erez"], "genres": ["Action", "Adventure", "Arcade", "Casual"], "publishers": ["Yonatan Erez"], "esrb_rating": "Everyone 10+"}