{"id": 225338, "slug": "cinemawares-wings", "name": "Cinemaware's Wings", "name_original": "Cinemaware's Wings", "description": "Cinemaware's classic Wings! gets re-mastered in high definition with all its original missions, dogfights, story and gameplay!<br/>Relive the action, glory and seat of the pants daring of a WWI Allied fighter pilot! You'll strafe Hun armies, bomb enemy aerodromes and match wits against deadly Aces in heart-stopping dogfights, the loser going down in flames...without a parachute! More than just a simulator, Wings! features genuine arcade action and an emotion-packed role-playing experience. Wings is the easy to play air combat simulation you've been waiting for... no complicated keyboard commands. Just fly and shoot!<br/>Wings!(tm), the classic flight-combat action game from the Amiga generation is back! With \"Wings! Remastered Edition“ Cinemaware brings you back to an experience full of blasting action, drama and emotions. Get your Sopwith Camel started and dive deep into this amazing story of a WWI combat pilot's life experience. Fight your foes in one-on-one air combat, bomb enemy installations and strafe enemy supply lines!<br/>Wings! Remastered Edition is the great comeback of the Amiga hit-game from 1990. The game has been completely reproduced in stunning HD graphics, high-quality sound effects and a masterful soundtrack re-scored with real instruments. Jump into the cockpit and enjoy this remastered classic game experience!<br/><br/>*Experience a dramatic World War I storyline from the perspective of a combat pilot unveiling right before your eyes!<br/>*Re-live the horrors and glories of the 56th Squadron as it strives to survive to the end of the war<br/>*Dogfight, bomb &amp; strafe enemies in a variety of dramatic missions!<br/>*Play through over 230 diverse missions taking place between 1916 and 1918<br/>*Enjoy a completely re-scored orchestral soundtrack by Sound of Games, the leading game music production team!", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:53:23", "background_image": "https://media.rawg.io/media/screenshots/a63/a63aa38d24f253aaa90126d4060bc6e7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 183, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Kalypso Media Mobile"], "genres": ["Action"], "publishers": [], "esrb_rating": null}