{"id": 225428, "slug": "baby-shapes-colors-free", "name": "Baby Shapes & Colors FREE", "name_original": "Baby Shapes & Colors FREE", "description": "Shapes and Colors Games is an app with 12 games for children to learn to identify silhouettes and colors of objects with fun animations and drawings. Children can touch the screen and discover a world full of colors and geometric figures while having fun. This game is designed for babies from 6 months, toddlers and preschoolers.<br/><br/>EDUCATIONAL GAMES FOR KIDS<br/><br/>Thanks to this series of games, children will learn to:<br/>- Sort objects and by shape, color or size.<br/>- Associate geometric figures with silhouettes each with different number of sides and angles.<br/>- Establish object classification logics.<br/>- Develop visual and spatial intelligence.<br/>- Identify forms partially and completely.<br/>- Recognize geometric figures such as square, rhombus, triangle, circle, trapezoid, rectangle...<br/>- Recognize different colors: red, brown, green, blue, pink, yellow...<br/>- Solve educational puzzles about different shapes and colors.<br/>- Distinguish shapes within a series of elements.<br/><br/><br/>GAME FEATURES<br/><br/>Shapes and Colors games are games with colorful drawings and are pleasing to children. Each game is accompanied by funny animal characters that will encourage your kid to finish the game. In addition, the animations and movements of the characters encourage interaction and act as positive reinforcement. These games stand out for their ease of use and handling of the elements of game.<br/><br/>This collection of 12 different games with dozens of puzzles and educational exercises has infinite possibilities since the combinations of elements are shown randomly.<br/><br/>DEVELOPMENT OF MOTOR AND INTELLECTUAL SKILLS<br/><br/>- Shapes and Colors Games will help your child improve their problem-solving skills, logical and cognitive skills, concentration and memory.<br/>- Improve the speed of thought, attention and psychomotricity.<br/>- Improve coordination and fine motor skills in kindergarten kids.<br/>- Develops visual and spatial perception.<br/><br/><br/>EDUJOY EDUCATIONAL GAMES <br/><br/>This app is part of an educational games collection created by Edujoy in order to help kids to develop new intellectual and motor skills from elements of their environment.<br/><br/>All our games are created by professional educators and psychologists in order to provide pedagogical content, necessary for the intellectual development of babies and children.<br/><br/>We love creating educational and fun games for you. If you have any suggestions or questions, feel free to send us feedback or leave a comment.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:53:02", "background_image": "https://media.rawg.io/media/screenshots/015/015f6615fe9c172e791adbd35af1451c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 97, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["AppQuiz"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}