{"id": 225414, "slug": "monster-killing-city-shooting-ii", "name": "Monster Killing City Shooting II", "name_original": "Monster Killing City Shooting II", "description": "Monster Killing City Shooting 2 is new intense 3D first person action shooter game FPS where you shoot minions. It's a second game from our production where you do such things. Blast your enemies with an MP5, AK47, Desert Eagle, FN SCAR, HK 416, grenades and many more shotguns and rifles Realistic outdoor hd graphics is compareable to visuals of AAA assault army games from high-end PC. Game contains dangerous singleplayer. You can pick from arsenal of weapons - army knife, chainsaw, RPG, sniper gun, m4 rifle, grenade, uzi. You can configure graphics to fit your device, so you can play more smootly and your movement will be more fluent. This game was made on unity engine. Each class contains main weapon, but you can also buy / upgrade other weapons, ammo, armor and bullets to the primal gun. Singleplayer campaign mission consists of simple task, which is to eliminate all dinosaurs from city. After each finished gore game, you gain experience ( xp ) and bounty money.<br/><br/>Become the best ruthless online hero assassin who will lead headshot leaderboards ranks in this memorable stellar game with unique feel. Dive in to the new gaming experience with hours of not ordinary gameplay. The monsters must be eliminated. Keep your finger on the trigger. Kill them before they kill you! Grab your shotgun in arsenal and shoot your way through this monster war of gory main levels to rescue the world from the monster apocalypse.<br/><br/>Each match is not time limited. After you die, you will return to the war frontline battlefield, so you won't be pernamently dead. You can avenge yourself and gunshot surviving killer monster with critical damage. Every game you gain skills, that will help you to achieve desirable victory.<br/><br/><br/><br/>- 59 frontier apocalypse saga levels, more to come<br/>- Awesome doom Sound &amp; Music<br/>- Weapon Upgrade System, Arsenal of Weapons like from top class games<br/>- Possibility to Demolish buildings<br/>- Stunning 3D mountain park ( hill ) graphics, Innovative Level Design<br/>- Hours of fun gameplay with this great jurassic simulator<br/>- 59 Monsters minoins to pick ( death skull, dragon, virus zombie, walking dead, undertaker warlord, kraken, hell rot, giant bat, gargoyle etc)", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:53:05", "background_image": "https://media.rawg.io/media/screenshots/d4e/d4ef4840be93c6ceac9ebedf39710a87.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 316, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["HGamesArt"], "genres": ["Action"], "publishers": [], "esrb_rating": null}