{"id": 225455, "slug": "familys-game-travel-pack", "name": "Family's Game Travel Pack", "name_original": "Family's Game Travel Pack", "description": "Come and enjoy our exclusive collection of more than 40 traditional board games ! <br/><br/>★ Strategy: Chess, Draughts, Checkers, Chinese Checkers, Backgammon, Reversi, Nine Men's Morris, Alquerque, Neutron, Bagh Bandi, Bagh Chal, Tic Tac Toe, Connect Four <br/><br/>★ Family classics: Domino, Mexican Train, Ludo, Game of Goose, Snakes'n Ladder, Memory, Animal War, Dots'n Boxes, Battleships <br/><br/>★ Cards: Crazy Eights, Nain Jaune, Russian Bank, Nordic Russian Bank, King's Corner <br/><br/>★ Solitaires: Peg Solitaire, Master mind, Mahjong Solitaire, Shisen-Sho, Sudoku, Minesweeper, 40 Thieves, Klondike, FreeCell, Spider, Golf, Pyramid, Poker Squares, The King Pile, 4 Aces <br/> <br/>★ Wooden games: Air Hockey, Passe Trappe <br/> <br/>★ Dice games: Yatzy, Shut the Box, 421 <br/><br/>All these games are packed together in a small application, offering robot players, local and online leaderboard.<br/>Up to 6 players can play together around a single device.<br/><br/>Authorizations : This application requires internet acces to offer optional online leaderboards. It also needs Wifi &amp; Bluetooth authorizations to handle playing between multiple devices. These features can be disabled in the application settings. <br/><br/>We collect anonymous usage statistics using Google Analytics to make the game better and more enjoyable. Please consult our privacy policy for more informations.", "metacritic": null, "released": "2016-09-02", "tba": false, "updated": "2019-07-30T20:23:27", "background_image": "https://media.rawg.io/media/screenshots/8d8/8d83dad83ff55c53cec57132d894e1a1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 226, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Soft Motion Labs", "Vincent Bousquet"], "genres": ["Board Games"], "publishers": ["Vincent Bousquet"], "esrb_rating": null}