{"id": 225406, "slug": "real-mech-robot-steel-war-3d", "name": "Real Mech Robot - Steel War 3D", "name_original": "Real Mech Robot - Steel War 3D", "description": "Real Mech Robot - Steel War 3D is a singleplayer and multiplayer game with steel / metal mech robots ( tanks ). You can pick from 12 different types of mercenary robots and also 5 types of weapons for each of them. Upgrade combat strength, speed, and durability of your battle robot. There are many boosts on the battlefield which helps you in fight. There are many possible combinations of robots and weapons. Create a war machine to fit your own play style. Participate in ultimate robot PvP battles accross the world - worldwide. Complete daily quests to recive rewards and bonuses. Become legendary gunner who terminates dangerous enemies on sight and know how to use tactical maneuvers with his guns and have amazing combat skills. Defeat, kill, destroy all enemies and earn victory. Clash with your friends or join forces together, shoot your rivals. Its your duty to fight and win.<br/><br/><br/>- 12 Futuristic robots to pick<br/>- 5 different weapons for each robot<br/>- 2 different battlefield maps to play<br/>- Modern amazing 3D tech Graphics<br/>- Futuristic extreme military environment<br/>- Realistic combat / conflict Sound Effects<br/>- Cool multiplayer strike game for 2017<br/><br/>By installing this app you agree to the following privacy policy: <br/>http://www.oneaudience.com/privacy/?package_name=com.hgamesartworks.mechmp", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:53:06", "background_image": "https://media.rawg.io/media/screenshots/402/402696c8409051661b7d337ace3cc5ae.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 393, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["HGamesArt"], "genres": ["Action"], "publishers": [], "esrb_rating": null}