{"id": 22545, "slug": "oafmatch", "name": "Oafmatch", "name_original": "Oafmatch", "description": "<strong>Oafmatch</strong> is a roleplaying game that combines traditional RPG turn-based combat with match-three mechanics.<br/><br/>Join Knuckles the Oaf and his menagerie of faithful companions in an epic quest to save their stricken homeland  from the vile depredations of a powerful and mysterious foe. Go into battle with four party members carefully picked from thirty playable classes, match gems to power up your team's weapons, and then unleash devastating attacks on your enemies!<br/><br/>Features include:<ul><li>RPG / Match-three hybrid combat system: match gems, earn mana, trigger terrifying skills to crush your foes.<br/></li><li>Sixty unique, equippable weapons, each with five different ability ranks.<br/></li><li>Dozens of wildly different monsters to wreak havok upon your poor party.<br/></li><li>Thirty playable classes, each with their own unique traits to master and levels to attain. <br/></li><li>Huge campaign worth over 30 hours of pain, death, and light-hearted dialogs.<br/></li><li>Roguelike dungeon mode for an ever changing (and ever punishing) experience.<br/></li><li>New Game Plus option, with shuffled loot and extra playable classes.<br/></li><li>Full controller support.</li></ul><br/><br/><br/>Playing <strong>Oafmatch</strong> you will quickly discover that this is a game for match-three lovers and RPG-lovers alike. It is also a game for tinkerers, as beneath its friendly exterior lurks a very deep well of party-building and party-outfitting strategic gameplay.<br/><br/>The game's <strong>strategy</strong> and <strong>tactics</strong> revolve, you see, around six colors: red, yellow, green, white, blue, and purple. Each character is assigned two colors, a major and a minor one. A properly formed party will have all six colors represented; at least in minor form. Neglect a color at your own peril!<br/><br/><br/><br/>Fail to carefully choose equipment at your own peril too! It is equipment that will allow your party to <strong>tactically flexible</strong> and <strong>resilient</strong>.<br/>Equipment can be broken down into the following general categories, with some overlap:<br/><ul><li>Direct damage. These are items that mainly deal damage to one or several targets. An example is the Poleaxe, which damages the target and one random enemy standing next to it.<br/></li><li>Board control. These are items that let the player control the flow of play on the 8x8 gem board. The Pipes of Beckoning, for example, allow the player to precisely choose a handful of gems to be destroyed.<br/></li><li>Mana management. These items help the player gain mana, or hinder the enemy's mana generation. An example is the Mana Scalpel, which destroys a small amount from each of the enemy's mana pools.<br/></li><li>Board shuffling: These are items that wreak havoc on the board in unpredictable ways, often generating  powerful cascading matches, and destroying precious enemy special gems in the process. And example is the Orb of Magma, which places a special persistent Magma Gem on the board. Each turn, this Magma Gem destroys the three gems immediately above it.</li></ul><br/>", "metacritic": null, "released": "2017-05-19", "tba": false, "updated": "2019-08-28T22:07:29", "background_image": "https://media.rawg.io/media/screenshots/3ec/3ec3aa2cdf91f6885c76ac814aea4c69.jpg", "website": "http://oafmatch.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 12, "beaten": 1, "toplay": 1, "dropped": 1}, "playtime": 2, "achievements_count": 32, "ratings_count": 1, "suggestions_count": 260, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["NCR Games"], "genres": ["RPG", "Casual", "Indie"], "publishers": ["Netcore Games"], "esrb_rating": null}