{"id": 225492, "slug": "bingo-happy-casino-board-bingo-games-free-fun", "name": "Bingo Happy: Casino Board Bingo Games Free & Fun", "name_original": "Bingo Happy: Casino Board Bingo Games Free & Fun", "description": "Are you ready to scream BINGO? Welcome to the best bingo game experience in the world! Get out your bingo daubers and starting calling out BINGO!<br/><br/>With tons of levels and exciting Bingo game play, Bingo has never been better! what are you waiting for?<br/><br/>Download Bingo Happy for FREE today!<br/><br/>FREE BINGO GAMES<br/>Bingo games free to play.Play free bingo games offline or online.With over 30+ bingo games free to play, you'll be taken on a free bingo games adventure around the world.<br/><br/>CASINO BINGO<br/>Bingo like in Las Vegas! The best casino bingo game on the mobile! Enjoy this exciting casino bingo game with millions of players together.  <br/><br/>BINGO WIN<br/>Play bingo happy to win as much bingos as you can.it's your best gambling bingo games.Pack up for your adventure now with bingo win in the best bingo games 2018.<br/><br/>FUN BINGO<br/>Love to play fun bingo games! download and play this fun free popular games.<br/><br/>BINGO OFFLINE<br/>Yes, you can play the BEST Bingo games free offline, no wifi, without Internet.Best offline Bingo games free like never before.<br/><br/>NEW GAMES<br/>New free bingo games added monthly.Bingo Happy is the world's most beloved card game, introduces a new free bingo experience.<br/><br/>BOARD GAMES FOR FREE<br/>Gather your family or friends and get ready for this globetrotting variation on a classic board game.with bingo board games you can enjoy all-time games within your <br/><br/>android, with an accurate design and playability.<br/><br/>GAMES FOR ADULTS<br/>Bingo Happy is designed for all ages, perfect for kids &amp; adults.Both adults and kids will love this amazing new trivia bingo game.<br/><br/>Free no wait BINGO you can play online or offline with no WiFi! <br/><br/>Enjoy now and have bingo fun. Bingo has never been better! Download Bingo Happy for FREE today!", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-31T06:13:02", "background_image": "https://media.rawg.io/media/screenshots/821/821cad5912a2a97cc2f157bb9c009474.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 144, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Saga Fun,Slots,Casino,Slot Machines,Bingo,Poker!"], "genres": ["Board Games"], "publishers": [], "esrb_rating": "Teen"}