{"id": 225448, "slug": "jigsaw-wooden-puzzles-for-kids", "name": "Jigsaw wooden puzzles for kids", "name_original": "Jigsaw wooden puzzles for kids", "description": "Jigsaw wooden puzzles is an educational and fun game for toddlers and preschoolers. This game will help your child develop tactile skills, association and fine motor skills, while being entertained for hours.<br/><br/>The main objective of the game is to complete the picture by sliding the different forms with your finger.<br/>Like classic wooden block games, this game helps children develop their spatial intelligence while learning to identify objects and shapes.<br/><br/>60 PUZZLES FOR TODDLERS &amp; PRESCHOOLERS<br/><br/>Jigsaw wooden puzzles include different topics as:<br/><br/>-Transport<br/>-Animals<br/>-Fruits<br/>-Professions<br/>-Musical instruments<br/>And more items!<br/><br/>GAME FEATURES<br/><br/>- Keep children entertained with fun sound effects.<br/>- The game is adapted to be handled easily.<br/>- It's specifically designed as an educational tool interface for preschoolers and up.<br/>- Suitable for right brain exercise, the graphics activate the right brain. Improve the brain´s observation skills, cognitive ability, concentration, memory, creativity and imagination.<br/>- Improve the response speed and the coordination of the brain and the body. Exercise visual ability to observe the dynamic objects.<br/>- Simple and convenient, easy to operate. Suitable for children, the elderly, their families and friends to play together.<br/><br/>FIND OUT MORE EDUCATIONAL GAMES<br/><br/>Edujoy has more than 50 games for children of all ages; from kindergarten to the elderly. <br/><br/>THANK YOU FOR SUPPORTING US!<br/><br/>Thank you very much for playing Edujoy games. We love creating educational and fun games for you. If you have any suggestions or questions, feel free to send us your feedback or leave your comments.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:52:58", "background_image": "https://media.rawg.io/media/screenshots/ab8/ab8c95c90ce8a60af8569778e20a37ea.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 107, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["AppQuiz"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}