{"id": 22555, "slug": "storm-wars-ccg", "name": "Storm Wars CCG", "name_original": "Storm Wars CCG", "description": "Lightning-fast card battles. Captivating deck building. Infinite strategy.<br/><br/>Recruit heroes, build decks and watch battles instantly. Deep card mechanics and insane deck strategies, with hundreds of cards to collect. Battles are automated and resolve as quickly as you wish to view them – for fans of MTG, Duelyst and Hearthstone, it’s a whole new way to get your CCG rush!<br/><br/>New players trying out their first CCG will find decks easy to build and card-battles fun to watch. Pros will love the thrill of intense PVP battles, beautiful graphics, and unlimited strategies. Welcome to Storm Wars!<br/><br/>• Deep Deck Building Strategy•<br/>With over 250 unique cards to place in your deck (each with their own stats and special abilities), 24 powerful heroes, and no deck building limits, the strategic possibilities are endless! The immense variety of heroes, cards, equipment slots, and other features provide a depth of strategic options unparalleled in other CCGs and TCGs.<br/><br/>• Lightning-Fast Battles •<br/>Epic battles in under a minute! Build your custom army, choose an opponent, and watch the chaos as the battle unfolds. Your deck takes center stage as the intensity of the fight picks up. Play alone, or take up arms in PVP tournaments. Whether you are playing at home or on the go, victory is as close as a click of a button.<br/><br/>•Immersive Campaign •<br/>Explore a detailed fantasy universe complete with 6 distinct races and an extended single-player campaign. Fans of Hearthstone will love the engaging story and visual experience. Develop your favorite card-battle strategies while unlocking more content – use your newfound skills to conquer the world!<br/><br/>• Intense PVP •<br/>Face off in ranked matches against real opponents all around the world in the Arena, participate in daily tournaments, or engage in direct challenges with friends and foes. Join a crew (guild) or found your own, and battle your way to the top of the leaderboards to achieve fame and glory!<br/><br/>• Unlimited Strategy •<br/>With the hundreds of unique cards, artifacts, and heroes to choose from, no two decks are alike! Discover new heroes, experiment with card strategy, and destroy your opponents. What strategy will you use to conquer Atlantea?", "metacritic": null, "released": "2017-04-26", "tba": false, "updated": "2019-10-22T14:30:34", "background_image": "https://media.rawg.io/media/screenshots/813/8131c07f4069233b179b7ed2389d94cc.jpeg", "website": "http://presskit.stormwarsgame.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 180, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Janus Anderson"], "genres": ["Strategy", "Card"], "publishers": ["Janus Anderson"], "esrb_rating": "Everyone 10+"}