{"id": 22556, "slug": "blitz-brigade-rival-tactics", "name": "Blitz Brigade: Rival Tactics", "name_original": "Blitz Brigade: Rival Tactics", "description": "The most badass gun show on mobile just got upgraded with the latest in real-time tactical combat!<br/><br/>In Blitz Brigade: Rival Tactics, deploy unit after unit in a fast-paced tactical game that lets you build an 8-man squad of doom from a pool of dozens of heroes, vehicles and power-ups. Will you deploy a steady stream of light and agile troops or bet it all on a few crushing waves of armored vehicular carnage? Will you run in guns blazing through the enemy frontline or battle them from afar with rockets and artillery? The combinations and strategies are infinite!<br/>Supplies and goodies provided by Central Command will keep your army growing and open up new pathways to destruction. Do well on the battlefield, and you will be rewarded with crates full of weapons and tools of mayhem to collect and upgrade.<br/>Expand the Blitz Brigade saga as you recruit iconic heroes like the notorious Satoru Hokama, the always dapper Duncan McCracken, and the explosive Albert Donati to your squad! <br/><br/>Join old friends and new allies in a vibrant reimagining of the Blitz Brigade universe and become the greatest commander of all! <br/>• Fight in skirmishes with rivals from all around the world.<br/>• Unlock, upgrade, and deploy dozens of units and power-ups in all-out war.<br/>• Join a Faction and build a strong community of allies. <br/>• Receive gifts and donations from Faction buddies and help them advance up the ladder.<br/>• Collect and use iconic characters from the world of Blitz Brigade.<br/><br/>Contains in-app purchases<br/>A network connection is required to play the game.<br/>_____________________________________________<br/><br/>Visit our official site at http://gmlft.co/website_EN<br/>Check out the new blog at http://gmlft.co/central<br/><br/>Don't forget to follow us on social media:<br/><br/>Facebook: http://gmlft.co/SNS_FB_EN<br/>Twitter: http://gmlft.co/SNS_TW_EN<br/>Instagram: http://gmlft.co/GL_SNS_IG<br/>YouTube: http://gmlft.co/GL_SNS_YT<br/><br/>This app allows you to purchase virtual items within the app and may contain third-party advertisements that may redirect you to a third-party site.<br/><br/>Privacy Policy: http://www.gameloft.com/en/privacy-notice<br/>Terms of Use: http://www.gameloft.com/en/conditions-of-use<br/>End-User License Agreement: http://www.gameloft.com/en/eula", "metacritic": null, "released": "2017-05-03", "tba": false, "updated": "2019-10-22T14:30:34", "background_image": "https://media.rawg.io/media/screenshots/871/8711c8d9b2fd84f87cc0b44629ee76ff.jpeg", "website": "http://www.gameloft.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 168, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Gameloft"], "genres": ["Action", "Strategy"], "publishers": ["Gameloft"], "esrb_rating": "Teen"}