{"id": 225555, "slug": "foxone-free", "name": "FoxOne Free", "name_original": "FoxOne Free", "description": "A free version of the action flight simulator that offers the ★best value for<br/>money★ in the category. <br/><br/>This free version has 7 flyable airplanes (★F-5E Tiger, F-5E Tiger Patrouille Suisse,<br/>Jaguar GR3, Mirage 2000, F-14 Tomcat, F-15 Strike Eagle and the Chengdu J-20★) and now giving what<br/>players always have asked: more stages! Now with ★7 completely free NEW<br/>stages★, with 2 NEW GAME MODES (Survival and Free Flight) with more to come in the future - stay tuned!<br/>Buy the full version to get all the available airplanes! And ★22 action-packed stages★.<br/><br/>FoxOne is an action flight simulator where the entire world is your<br/>battlefield. Take part in a battle against terrorist powers, flying modern<br/>combat aircraft for a secret mercenary squadron. Get paid for your kills, to<br/>unlock and buy increasingly advanced aircraft, and rank yourself mission<br/>after mission against fierce enemies.<br/>◆◆◆◆◆◆◆◆◆◆◆<br/>■■■Features:■■■<br/>★★★★★ Unparalleled sense of speed: feel the thrill of blasting through<br/>the skies in several different supersonic jets, based on real aircraft models,<br/>each one having its place and use in the game.<br/><br/>★★★★★ Incredible small file size (&lt;50MB) with HD graphics quality.<br/><br/>★★★★★ Easy controls: unlike other action flight sims, FoxOne has<br/>intuitive and very responsive controls, so you can focus in the battle<br/>instead of trying to stay airborne.<br/><br/>★★★★★ Range of different weapons to equip your jet: from the built-in<br/>cannons to guided air-to-air and air-to-ground missiles, bombs and<br/>unguided rockets.<br/><br/>★★★★★ Fly through several different stages, with challenging<br/>and varied missions in different places of the world, in a non-linear way.<br/><br/>★★★★★ Destroy reactors and bases hidden deep inside canyons.<br/><br/>★★★★★ Protect allied aircraft such as the US Air Force One, or<br/>defend entire cities from enemy bombers.<br/><br/>★★★★★ Gritty and visceral: no cartoony visuals and silly characters,<br/>this is the real deal: flying several types of fighter jets as a mercenary<br/>fighter pilot is a serious business, and FoxOne's atmosphere is tense and<br/>chilling. Fly to live, kill or be killed.<br/><br/>■■■Related links:■■■<br/>http://www.foxonegame.com<br/>◆◆◆◆◆◆◆◆◆◆◆<br/>■■■Interview with the developers:■■■<br/>http://www.flightsim.com/vbfs/content.php?15756-SkyFox-DeveloperInterview<br/>http://www.slidedb.com/games/foxone<br/>◆◆◆◆◆◆◆◆◆◆◆<br/>https://www.facebook.com/foxonegame<br/>◆◆◆◆◆◆◆◆◆◆◆<br/>https://twitter.com/foxonegame<br/>■■■Support:■■■<br/>http://www.foxonegame.com/support.htm<br/>■■■Contact Email:■■■<br/>foxonegame@gmail.com", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:52:38", "background_image": "https://media.rawg.io/media/screenshots/b98/b98c5a003e092bac50b720aa38f83c0e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 262, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["SkyFox"], "genres": ["Action"], "publishers": [], "esrb_rating": null}