{"id": 225540, "slug": "dog-simulator", "name": "Dog Simulator", "name_original": "Dog Simulator", "description": "The best MULTIPLAYER Dog Simulator available on Android!<br/><br/>Play as a real puppy - jump, bark, destroy the house and do whatever you want. Now with a multiplayer mode you can play your friends and people all over the world. Cute puppies and fun adventures are waiting for you!<br/><br/>- Online multiplayer<br/>- 6 Beautiful levels to explore<br/>- Multiple dogs to choose: shiba, corgi, husky, collie, bulldog, greyhound, even wolfs and more<br/>- Interactive people and animals<br/>- Dress every dog as you like<br/>- Destructible objects to crash<br/>- Special Night mode<br/>- Stunning graphics<br/>- Smooth performance<br/>- Easy controls<br/><br/>ONLINE MULTIPLAYER<br/>Play online with animal lovers all over the world. Play together with other dogs, meet new friends and compete with them for the best score. See if anyone can match your skills as a naughty dog. You can create your own games which can be joined by your friends.<br/><br/>DOGS AND PUPPIES<br/>If dogs are your favourite pets then this is the game for you. Play as your favourite dog breed: <br/>corgi, shiba and husky puppies are waiting for you. If you love bigger dogs select one of the collies,bulldogs or a greyhound to bring even more cuteness to the game. And if that’s not enough try a wolf, direwolf or a giraffe ( well it’s a sneaky greyhound dressed as a giraffe ). <br/><br/>UPGRADE AND DRESS YOUR DOG<br/>When you press either single player or the multiplayer button in the menu you always go to the scene where you can change your dog and dress it as you like, using blue arrows on the both sides of the dog and buttons on the top of the screen. You can dress your doggy with multiple hats, collars and funny glasses. Then everyone can see your cool outfit in multiplayer games.<br/><br/>LOCATIONS<br/>There are six locations. First, awesome house were you smash some objects and learn the game. Second, nice garden with a dog that will follow you and a grill party to ruin. Third is a shop with lots of objects that can be smashed into pieces. Fourth and fifth are on a huge farm full of animals and people where you can chase sheep to get points. The last one is a crazy town with tons of stuff to destroy and funky missions.<br/><br/>TIME CHALLENGE<br/>In every level in the single player mode there is a rotating clock. When you run into it, you can activate time challenge mode. In this mode you have to destroy as many objects and do as many interactions as fast as possible. For the points you earn the stars and more gold.<br/><br/>NIGHT MODE<br/>Score one star in the last level to unlock a secret night mode. It contains new time challenges for every stage with increased difficulty and even bigger rewards. See if you’re a true expert.<br/><br/>SIMPLE CONTROLS<br/>You can use the joystick, on the left to move your dog, jump button on the right to make it fly and swipe to look around. You can use the hit button on the right to smash objects with your awesome dog power.<br/><br/>QUALITY SETTINGS<br/>The game will automatically detect which quality settings to apply for your device, but you can change them in the settings menu.<br/><br/>FACEBOOK AND SOCIAL SHARING<br/>At the end of the time challenge, the popup will show up allowing you to post your score on Facebook or Twitter. You can also share the image of your dog on in the scene where you change dogs and dress them.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:52:40", "background_image": "https://media.rawg.io/media/screenshots/dfa/dfa5b2334e70b14d56b0dd1e4874256d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 203, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Swift Apps"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}