{"id": 225527, "slug": "cat-simulator-kitty-craft-pro-edition", "name": "Cat Simulator Kitty Craft Pro Edition", "name_original": "Cat Simulator Kitty Craft Pro Edition", "description": "Difference between Free and Pro Edition<br/>- NO ADS<br/>- All levels are open<br/>- 5x bigger score rewards <br/><br/>Cat Simulator is an arcade game, where you play as a katze kitty. You can pick from several different breed of kittens. There are 20 diffent levels / houses with gardens to play and explore. You have 6 different quests that you need to pass to complete the level. There are quests such as <br/>- Caught swift stray mice ( mouse )<br/>- Scratch ginger carpets<br/>- Scratch armchairs<br/>- Mess real food<br/>- Destroy vases, that are destructible ( you can smash and crash all of them )<br/>- Ride on a carrossel<br/>- Jump on trampoline<br/>- Push balls from slides<br/>- Ride on skateboard<br/>- Destroy gnome statues<br/>- Pop balloons<br/><br/>You can also bully people in house such as Tom Kätzchen. If you interact with them they will say something. People in house are doing a lot of things, talking, eating, sleeping. You gain coins by moving or jumping on objects. Coins unlock other cats<br/><br/>- Stunning, real, beautiful HD 3D graphics <br/>- Easy controls<br/>- Nice music<br/>- Wonderful cat animations<br/><br/>- MULTIPLAYER SUPPORT<br/>From now, you can compete with your friends in multiplayer. You can choose from 20 different levels.<br/><br/>- CAT CUSTOMIZATION<br/>You can buy many different hats, necklaces, flags, suits, glasses to your kitty. There are several cat skins to pick.<br/><br/>- CAT'S HOUSES<br/>You can also buy new cat house and make life of your cat more pleasant.<br/><br/>- LANGUAGE SUPPORT<br/>You can choose between English, Russian, Spanish, Portuguese, Turkish, French, German, Polish, Italian and Indonesian<br/><br/>- Christmas Special Level<br/>- Daily rewards", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-30T23:25:57", "background_image": "https://media.rawg.io/media/screenshots/e71/e71fcdcf43cf52e7b805cf66f8578d8a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 253, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["HGames-ArtWorks", "HGamesArt"], "genres": ["Action"], "publishers": [], "esrb_rating": "Everyone"}