{"id": 225530, "slug": "blitz-bubbles", "name": "Blitz Bubbles", "name_original": "Blitz Bubbles", "description": "Looking for fun blitz shooting games without wifi? You should try Blitz Bubbles! Pop bubbles in space with an awesome bubble shooter, take part in an intergalactic blitz war! If you used to love going to the arcade and playing fun bubble shooter games, get ready to take your passion to the next level! Try out the best blitz game and put your strategy skills to the test.<br/><br/>Blitz Bubbles will occupy you for hours, and you are always ready to attack! Beware of this popping bubbles blitz game - it's super addicting! This fun bubble shooter game is easy just to pick up and play, perfect for the whole family to play and enjoy. Explode bubbles in space, complete bubbling levels and win free bubble shooters coins! <br/><br/>Blitz Bubbles is an addictive bubble popping game with hundreds of galaxy puzzle levels and fun challenges. Play for free today and join the balloon crushing fun! Shoot and pop colorful bubble drops in this relaxing board game and work your way through all the bubble-packed puzzles and brain teasers. Start the adventure now, hit and blast the balls and discover the most classic and amazing puzzle game! <br/><br/>How to Play this free puzzle game:<br/>- Drag your finger to move the laser aim and lift it to shoot bubbles. <br/>- Match at least 3 balloons of the same color to pop the combination. <br/>- Try to complete hundreds of challenging blitz battle levels. <br/>- Earn powerful bombing boosters that will help you fight your way to victory:<br/>- Pop 7 bubbles in a row to get a FIREBALL that will burn every bubble on the way. <br/>- Drop 10 balls or more to get a BOMB that will take out surrounding bubbles.<br/><br/>Warm up your fingers and get ready to show some fine matching skills in this cool free game! Download and play the super addicting Blitz Bubbles puzzle, and discover a fun bubble shooting game. Manage your time, plan your moves, and clear all the bubbles to overcome the obstacles. <br/><br/>Enjoy blitz shoot cool features:<br/>- Strike &amp; pop bubbles to complete challenging levels.<br/>- Completely free to play and highly addictive! <br/>- Amazing and vibrant graphics. <br/>- Smooth gameplay and hours of endless fun! <br/>- Play online or offline - no wifi and no internet required in this bubble shoot games for free.<br/><br/>Don’t miss out on this crazy bubble popping fun, compete against friends and family and see who can reach the highest score and get 3 stars on every level. Play this free game full of thousands of challenging levels to satisfy your itch for fun puzzles!<br/><br/><br/>All rights of Bubble Shooter ™ are owned by Ilyon Dynamics Ltd.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:52:42", "background_image": "https://media.rawg.io/media/screenshots/ddc/ddcba267c0ffc5d6676dba0333a52eb9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 65, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Bubble Shooter Games by Ilyon"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}