{"id": 22557, "slug": "gladiator-heroes", "name": "Gladiator Heroes", "name_original": "Gladiator Heroes", "description": "Construct gladiator academies, armories, infirmaries, government buildings, and arenas as you unlock a diverse map, with jungles, deserts, mountains, and volcanoes. Build, manage, and defend your territory, as you conquer new worlds and solidify your place in history. What you do in life echoes in eternity, so step into the arena and defend your empire, in Gladiator Heroes! You are both a warrior and an emperor in this new and exciting strategy game. <br/> <br/>The more prosperous your empire becomes, the better the gladiators and weaponry that you acquire. Design, train and outfit your warriors, and then lead them into deadly battles where they can show off their newly acquired skills and weapons. Bask in the glory as your small village grows into a formidable empire, and your young, untrained gladiators become the most fearsome opponents.<br/> <br/>Show your strength and defend your honor in Gladiator Heroes. Those who are about to die, salute you!<br/><br/>GAME FEATURES:<br/>* MULTIPLAYER! Play with friends and compete in the rankings. Discover new player divisions and the auto combat feature.<br/>* You control the construction and growth of your cities.<br/>* Fight in a variety of impressive arenas throughout the empire, from sweltering deserts to snowy tundra<br/>* Win gold, weaponry, and new skills in deadly showdowns<br/>* Place your gladiators strategically to take out their opponents<br/>* Design, name and train your gladiators, then watch at they evolve into indomitable killers<br/> <br/>The game includes subscriptions! Become a VIP and you'll be able to construct two buildings at once, and cut healing times in half.<br/><br/>Please note that Gladiator Heroes is completely free to play, however you will have the option to buy some in-game items for real money. If you prefer not to use this feature, please disable in-app purchases in your mobile device’s settings. Although this game is compatible with iOS 8 and up, it is recommended for iOS 9.", "metacritic": null, "released": "2017-05-03", "tba": false, "updated": "2019-10-22T14:30:34", "background_image": "https://media.rawg.io/media/screenshots/4c7/4c7aafef3fb18c6299c59cbe5e37e3e8.jpeg", "website": "http://www.generagames.com/helpdesk", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 224, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Genera Mobile"], "genres": ["RPG", "Strategy"], "publishers": ["Genera Mobile"], "esrb_rating": "Teen"}