{"id": 225631, "slug": "ravenhill-hidden-mystery", "name": "Ravenhill: Hidden Mystery", "name_original": "Ravenhill: Hidden Mystery", "description": "Don't miss the opportunity to be one of the first to try the new exciting hidden object game from the creators of the hit game Seekers Notes! Sign up now and become the first long-awaited guest in the lost city. Very soon, the city gate will open and let you into Ravenhill.<br/><br/>AN EXCITING NEW GAME FROM MYTONA, CREATORS OF THE HIT GAME SEEKERS NOTES! NEW INTRIGUES, AMAZING LOCATIONS, INTERESTING CHARACTERS AND ENGAGING INVESTIGATIONS!<br/><br/>In this new and exciting game, you have to solve the mysteries of a once flourishing city that suddenly became a ghost town. Where did all its residents disappear and who is behind it? To find answers to these questions, set out to Ravenhill, a city full of secrets and mystique, and plunge into a whirl of breathtaking events! Once you find yourself in Ravenhill, which still has some residents, you'll start unraveling a tangle of enigmatic incidents. In fact, a mission to prevent an unknown catastrophe is entrusted to you! <br/><br/>Unlock new locations, search for interesting objects, find items, and assemble rare collections. Solve puzzles, use talismans and tools to speed up your progress, and read the diary to keep up with the storyline.<br/><br/>Main game features:<br/><br/>—SERIAL PLOT STRUCTURE. Intriguing episodes and unpredictable turns of events.<br/>—FANTASTIC GRAPHICS. Picturesque locations, animations, and live scenes that will fascinate you with their realism.<br/>—VARIETY OF WONDERFUL AVATARS. The choice is all yours!<br/>—ENGAGING CHARACTERS. Each with their own striking individuality.<br/>—CAPTIVATING PUZZLES. Not only can you search for hidden objects, but you can solve interesting puzzles too!<br/>—SPELLBINDING MUSIC will immerse you in the game's unique atmosphere. <br/>—INTERESTING MODES AND ANOMALIES. Confront insidious anomalies and challenging modes!<br/>—43 AMAZING COLLECTIONS for those who truly love the finer things.<br/>—5 UNIQUE ARTIFACTS that are worth fighting for!<br/>—VALUABLE REWARDS that will attest to your achievements.", "metacritic": null, "released": "2018-11-09", "tba": false, "updated": "2019-07-30T20:31:40", "background_image": "https://media.rawg.io/media/screenshots/adb/adb21c26a4b7e48b3542a7bdb3274d48.jpg", "website": "http://www.mytona.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 454, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["MyTona"], "genres": ["Adventure", "Puzzle"], "publishers": ["MyTona Pte"], "esrb_rating": null}