{"id": 225663, "slug": "the-beautiful-story", "name": "The Beautiful Story", "name_original": "The Beautiful Story", "description": "<p><em>A Beautiful Story</em> by Deep Games Laboratory is an expressive, single player 2D game. Drawing on the personal account of a survivor of domestic violence, the game aims to make tangible through gameplay salient mechanisms of entering into and remaining in an abusive relationship. Since every survivor’s story is different, we decided to embrace subjectivity as a way to create emotional resonance with a unique, but relatable experience, rather than attempting a more generalizable design.   </p>\n<p> \r\n  </p>\n<p>To ease the player into this difficult topic and create a stronger moment of recursive learning (i.e. learning through disappointment, see Mitgutsch and Weise 2011), we further chose a metaphorical approach that initially camouflages the game’s true meaning. By calling the game “A Beautiful Story” and setting the tone for love and romance in the intro scene (through narrative description, music and character design), we aim to invest the player into the relationship emotionally. Abusive relationships do not start out that way. The initial bond with all its passion, hope and promise serves as powerful fuel for continued engagement long after troubles have started to manifest. For a player to empathize with survivors of abuse, establishing a naïve and hopeful starting point was essential.   </p>\n<p> \r\n  </p>\n<p>What could be more romantic and innocent than penguins who mate for life and propose to their mate with a pebble? Thus, the protagonists of our human drama are Guli and Gorgo, two penguins who have found and fallen for each other. The player takes the role of Guli, who in the first act of the game - which models the honeymoon phase of the abusive cycle (Walker, 1979) - collects little flames with Gorgo – representations of shared experiences that feed the relationship’s fire. The player is told that if they help Guli collect enough flames with Gorgo, building and growing the relationship, the penguins will be able to fly and live happily ever after. This leverages common expectations towards games – namely that they can be won with enough effort and that the player has agency to make this happen – creating an experiential alignment with the ambition to “make the relationship work” and the cognitive dissonance that happens after much time has been invested in attempting to reach this goal and failing (the longer you’ve tried, the harder it becomes to give up).   </p>\n<p> \r\n  </p>\n<p>After the player collected a certain amount of flames, tension rises and Gorgo’s issues – metaphorically represented by demonized crows – appear on the scene. That moment, direction tiles (up, down, left, right) become active on the maze-like floor of the gamespace, and Guli gains the ability to steer Gorgo away from the crows by walking over those tiles (e.g. by walking over an UP tile, Gorgo will go up at his next waypoint). This mechanic aims to create a sense of responsibility of the abused partner by putting the burden of preventing the abuse on her: if Guli / the player fails to keep Gorgo away from the crows – going out of her way (literally, by walking over direction tiles) to appease him, she is partly to blame for what happens next. Relieving an abusive partner of responsibility (by blaming oneself, external influences, a partner’s bad friends / family / mental health issues etc.) is another essential factor of remaining in the relationship and keeping the hope alive that things can change.  \r\n  </p>\n<p> \r\n  </p>\n<p>Attempts at “protecting” Gorgo from his demons are futile, though. The crows will eventually catch up with Gorgo and, possessed of the crow-spirit, Gorgo comes after Guli. This phase of the cycle always ends in an incident of abuse, followed by a “reconciliation screen”, which only depicts Guli and Gorgo on either side of a little flame. At this point, the player has the option to try again by walking towards the flame and entering the honeymoon phase of the next cycle, or leaving by simply walking out of the screen on either side. The “leave” choice, however, is not obvious and if a player attempts to walk away, she will be reminded of what she is giving up and encouraged to stay.   </p>\n<p> \r\n  </p>\n<p>Leaving an abusive relationship is a non-trivial matter. This is exemplified at the end of the game. After the player went through 4 cycles of abuse, each reconciliation restoring the relationship flame less and less, making the goal to fly and live happily ever after more and more unlikely, a bottom line is crossed: the reconciliation screen does not feature a flame anymore. Hope has been destroyed. Instead, an exit appears on the screen. Walking through it, however, lands Guli back in the original maze, where instead of collecting flames, she tries to make it out before Gorgo in his demonized catches up with her. If he does, the chase through the maze begins again. We decided not to model actual intimate partner homicide, but to allow the player to replay the escape scene until they were successful. The end-screen contains statistical information about domestic violence as well as a link towards resources for those who find themselves in crisis.   </p>\n<p> \r\n  </p>\n<p>We hope this game helps raise awareness for domestic violence, promotes self-reflection for those potentially affected by it, and alleviates stigma. Once you’ve bought into the mechanisms of <em>A Beautiful Story</em> as a game, it might be easier to see how people can buy into the mechanisms of abusive relationships in real life. While certainly not the same, the underlying assumptions and belief systems are highly comparable. Further, this game is complemented by a twine game (currently in production and featuring the same penguin characters and mythical universe) that elaborates on salient aspects of domestic abuse in a more concrete way, capturing more of the substance and nuances of the subject.   </p>\n<p> \r\n  </p>\n<p> \r\n  </p>\n<p><strong>References</strong>\n</p>\n<p>Mitgutsch, K &amp; Weise, M. (2011): Subversive Game Design for Recursive Learning. In Proceedings of DiGRA 2011 Conference, Think Design Play.\r\n  </p>\n<p> Walker, E.L. (1997): The Battered Woman. New York, NY: Harper &amp; Row.</p>\n<p> \r\n  </p>\n<p> \r\n  </p>", "metacritic": null, "released": "2018-09-06", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/769/7697fb10c4d905dc0eb73e55d38d908c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 5, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Web"], "developers": ["Deep Games Lab"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}