{"id": 225789, "slug": "slender-man-origins-1-full", "name": "Slender Man Origins 1 Full", "name_original": "Slender Man Origins 1 Full", "description": "Best Slender Man Game for Android with over 7 500 000 registered players worldwide! Join Slender Man Origins Community!<br/><br/>Slender Man Origins - Immerse yourself into the thick atmosphere of mystery and horror! Follow the Slender Man's trail, become a witness to his horrific deeds and save the children from their inevitable doom. <br/><br/>Explore, listen and look closely, travel through the dark corridors, damp halls, dense forests and empty streets, among the ancient tombs, old looming trees and abandoned houses. <br/><br/>But beware! Slender Man is near! In your journey you will encounter many things without explanation, some even seeking to harm you. Always remember that every step you take may well be your last - for the Slender Man watches you...<br/><br/>- Four different, atmospheric locations<br/>Each of the locations is unique, complete with a certain theme and filled with detail.<br/><br/>- Variable ambience<br/>Explore while experiencing different weather conditions, adding a certain feel to each of your journey.<br/><br/>- Enviroment<br/>The Slender Man isn't the only thing you shall notice out there. While some events may simply be a part of unexplainable,<br/>many of them mean danger, some may bar your way, while few others can even prove lethal. Be ready for surprises!<br/><br/>- Easy and quick-to-learn controls<br/>Move around and explore the way you are most used to - you can always choose a more familiar control scheme from the<br/>options menu. Run away from Slender Man easily!<br/><br/>- Use the headphones!<br/>3D sound makes the atmosphere even more mysterious, while listening to the directions of noises you can often get<br/>a feel of where you should go, or even avoid a hazard.<br/><br/>- Smooth, pleasant graphics<br/>Fine detail, soft light and lots of objects, as well as shadows from every tree, stone and iron bar in a fence - you are<br/>sure to itch for a few screenshots along the way.<br/><br/>www.facebook.com/HorrorSlender<br/>www.slendermanorigins.com<br/>twitter.com/bigzurgames", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:52:29", "background_image": "https://media.rawg.io/media/screenshots/0fe/0fe0d9420429a43cab2c7d5f259302c0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 357, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Bigzur"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}