{"id": 22576, "slug": "aporia-beyond-the-valley", "name": "Aporia: Beyond The Valley", "name_original": "Aporia: Beyond The Valley", "description": "\"... could well cement itself among the top puzzle adventure games of the longstanding genre.\" - <strong>PC Gamer</strong> (Preview)<br/><br/>“The most striking thing about Aporia, to me, is that the Myst comparison feels right.” <strong>Kotaku</strong> (Preview)<br/><br/>“The overall ambition and premise of the game have definitely caught our attention, as it’s a gorgeous world with an interesting narrative approach.” - <strong>Game Reactor</strong> (Preview)<br/><br/><br/><br/><strong>Aporia: Beyond The Valley</strong> brings a unique approach to the art of storytelling, by not using dialogue or text. It offers new, interesting puzzle mechanics, and elaborate environmental storytelling within an immersive world.<br/><br/>The mystical world of Ez’rat Qin - once a mighty civilization, now a crumbled ruin. <br/><br/>You awake after hundreds of years of sleep, in an abandoned land and no memory of your past. Immersed in this world of dark beauty, thrilling mystery and ancient puzzles, you embark on a quest to find out what happened in this world, and to discover who you are.<br/><br/><strong>Aporia: Beyond The Valley</strong> is a first person puzzle game set in the world of Ez’rat Qin. Explore a world filled with strange nature, ancient technology, and haunted by a spirit roaming the fog-covered forest. With a whole new story and puzzle mechanics, <strong>Aporia: Beyond The Valley</strong> presents players with the challenge of actively exploring and piecing together a non-linear story of what happened in this mysterious world.<br/><br/><br/><br/><strong>Key Features</strong> - <br/><ul><li>An immersive, detailed world created in CryEngine.<br/></li><li>Explore a story about humanity, technology and civilization told without text or dialogue. Uncover clues, devise theories, and make up your own mind.<br/></li><li>Avoid traps and solve brain twisting puzzles made to make you question what happened in The Valley.<br/></li><li>Explore bizarre architecture and overgrown nature, choosing your own path in the game’s non-linear world.<br/></li><li>Completely original musical score.</li></ul>", "metacritic": 71, "released": "2017-07-19", "tba": false, "updated": "2023-10-10T19:27:19", "background_image": "https://media.rawg.io/media/screenshots/4b0/4b0ea5c8b3271e7ee5a1ca0360655ef2.jpg", "website": "http://aporiathegame.com/", "rating": 3.0, "rating_top": 4, "added_by_status": {"yet": 19, "owned": 337, "beaten": 10, "toplay": 8, "dropped": 4}, "playtime": 5, "achievements_count": 41, "ratings_count": 19, "suggestions_count": 531, "game_series_count": 0, "reviews_count": 19, "platforms": ["PC"], "developers": ["Investigate North"], "genres": ["Adventure", "Indie"], "publishers": ["Green Man Gaming Publishing"], "esrb_rating": null}