{"id": 225714, "slug": "slenderman-origins-2-saga-free-horror-quest", "name": "Slenderman Origins 2 Saga Free. Horror Quest.", "name_original": "Slenderman Origins 2 Saga Free. Horror Quest.", "description": "The Best Horror Quest Game is Here! The most anticipated Slender Man Origins game!<br/><br/>*********************************************<br/>Install all our Slenderman games:<br/><br/>Slender Man Origins 1 (Lost Kids):<br/>https://play.google.com/store/apps/details?id=com.roonto.horror_free<br/><br/>Slender Man Origins 2 Saga (Horror Quest):<br/>https://play.google.com/store/apps/details?id=com.bigzur.slendermansaga.free<br/><br/>Slender Man Origins 3 (Abandoned School)<br/>https://play.google.com/store/apps/details?id=com.bigzur.slenderiiifree<br/><br/>Slender Man Hide &amp; Seek Online Multiplayer Game:<br/>https://play.google.com/store/apps/details?id=com.bigzur.slender4<br/>*********************************************<br/><br/><br/>Meet Slender Man Origins 2 Saga!<br/><br/>What makes our game so special?:<br/>- Plot: Enjoy the feeling of standing in the middle of a mysterious, intriguing story!<br/>- Quest: Solve puzzles, overcome obstacles and piece together the whole story!<br/>- Atmosphere: Immerse yourself into an atmosphere of mystery and danger!<br/><br/>The time has come to pursue the Slenderman once again, and this time it's personal - your daughter has been kidnapped. Your path lies through dark dungeons, catacombs and ancient ruins - and all of them are sure to contain a lot of mysteries and dangers.<br/><br/>Your only weapon and defense shall be your wits and observing skills - not every door can be simply opened, and not a single corner or nook can really be safe. Explore the deepest reaches, reveal hidden secrets and learn new details about the events occurring around you.<br/><br/>Danger lurks everywhere. Ancient halls guard their secrets well, and an unwary traveller can easily perish if he is not cautious enough.<br/><br/>Remember, the Slenderman is watching you...<br/><br/>- Large, detailed locations<br/>Exploring the main locations will take you quite a few hours.<br/><br/>- Puzzles, locks and keys<br/>Doors, bars, walls and ancient mechanisms will hinder you, and often it won't be an easy task to open them. You'll be searching for required items, hidden switches or something more exotic.<br/><br/>- Regularly updated journal<br/>On your way, you'll find notes left behind by different characters. Some have been written recently, and some a long time ago. They can contain clues to solving the riddles - or pieces of the story.<br/><br/>- Atmospheric music<br/>Each location has its own set of tracks, immersing you even deeper into an atmosphere of mystery and danger.<br/><br/>- Use the headphones!<br/>Sounds can help you find the right path. Many of them will warn you of danger - your ears will save your life more than a few times.<br/><br/>- Awesome graphics<br/>Quality textures, improved lightning scheme, interactive objects. All the locations are filled with detail, game events are followed by various visuals - sometimes you'll just want to stop for a moment and stare at your surroundings.<br/><br/>www.facebook.com/HorrorSlender<br/>www.slendermanorigins.com<br/>twitter.com/bigzurgames", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:52:33", "background_image": "https://media.rawg.io/media/screenshots/508/508256a496f8a10e9c0bc0fb2c884309.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 357, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Bigzur"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}