{"id": 2257, "slug": "beastie-bay", "name": "Beastie Bay", "name_original": "Beastie Bay", "description": "Washed ashore a desolate island and surrounded by savage beasts, can you thrive...or merely survive?<br/><br/>Blaze trails into unknown territory...and then make it your own! Plant crops, build housing and power sources, and transform the island into your own personal paradise. As you progress, you&amp;#39;ll be able to develop new gear and technology to take your adventure to the next level, including ways to travel to unexplored islands nearby!<br/><br/>The native fauna eyeing you as their next meal? Capture the critters, trade them with friends, and train them to fight for you! Most have elemental strengths and weaknesses, so use these to your advantage in battle.<br/><br/>Venture far enough afield and you may find signs of civilization. If you make the right friends, your humble isle could grow into an economic powerhouse, complete with hot springs, hotels, and heliport. The possibilities are as limitless as the horizon!<br/><br/>Survival of the fittest was never so fun! You call the shots as you develop your primitive isle into a luxurious slice of paradise!<br/><br/>* Game data is stored on your device. Save data cannot be transferred between devices, nor can it be restored after deleting or reinstalling the app.<br/>* Certain features (e.g., removing ads) require in-app purchases and become available once you reach a certain point in the game.", "metacritic": null, "released": "2013-02-07", "tba": false, "updated": "2024-02-24T11:17:48", "background_image": "https://media.rawg.io/media/screenshots/e70/e705a14430c1c87b982e752df11164c3.jpg", "website": "http://kairopark.jp/iphone/en/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3, "beaten": 2, "toplay": 1, "dropped": 4, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 3, "suggestions_count": 282, "game_series_count": 0, "reviews_count": 3, "platforms": ["Android", "iOS"], "developers": ["Kairosoft"], "genres": ["RPG", "Simulation", "Arcade"], "publishers": ["Kairosoft"], "esrb_rating": "Everyone 10+"}