{"id": 225861, "slug": "adventurecraft-3d-block-building-survival-craft", "name": "AdventureCraft: 3D Block Building & Survival Craft", "name_original": "AdventureCraft: 3D Block Building & Survival Craft", "description": "AdventureCraft is a sandbox construction game with 3D procedurally generated world. Play this FREE Online Multiplayer Game for adults and kids. This building game with thousands of players from all over the world will entertain you for a long time flooding your mind with unforgettable emotions.  <br/><br/>*** GAME FEATURES *** <br/>•\tVery realistic gameplay;\t<br/>•\tHuge world to explore;<br/>•\tMULTIPLAYER beta mode to CHAT with the real people online;<br/>•\tCreative mode to set your imagination free;<br/>•\tA great number of monsters and animals;<br/>•\tCraft and destroy everything;<br/>•\tGo deep into the mines;<br/>•\tGather resources to survive;<br/>•\tFight your enemies;<br/>•\t3D Sandbox construction game.<br/><br/>   *** GAME OPTIONS *** <br/>•\tSurvival mode for single player with infinite maps, crafting, building and mobs taming;<br/>•\tCreative mode for the Single player;<br/>•\tOnline Multiplayer beta mode for playing with your friends! <br/>•\t16+ player skins available for fun gaming;<br/>•\t10+ great predefined maps on the server to get started with the creative single player;<br/>•\tPlay cross-platform with your friends (Apple App Store, Google Play, Amazon App Store, Windows Store).<br/><br/> In AdventureCraft multiplayer beta mode you could: <br/>•\tplay with real people online:<br/>•\tget together in one world to show the most amazing buildings to each other! <br/>•\tdiscuss in real chat game features or game quests;<br/>•\tgive advice to people online how to build their shelters/houses/towns!<br/>•\thave fun with friends! <br/>•\tget the most amazing experience!<br/><br/>Create and break apart various kinds of blocks, explore the environment, gather resources, kraft weapons, build shelter and take part in combat with dangerous opponents.<br/><br/>The game offers two modes – Survival and Creative.<br/> -  In Survival  players have to collect resources, construct buildings, fight against enemies, manage hunger and explore the word to survive and prosper.<br/> -  In Creative mode  you focus on breaking new grounds of creation by building the most elaborate structures you can dream of.<br/><br/>This Exploration AdventureCraft Game was inspired by the popular one in which you could Crafting, Building, Survival, which gives you the opportunity to design your dream block house in 3D environment, and build a whole cube town! <br/><br/>Everything is possible on this Adventure Game!<br/>•\tExplore this world and start living your dreams and imagination. <br/>•\tCustomize your character by choosing unique skin for fun games. <br/>•\tSelect your favorite Blocks Texture Pack.<br/>•\tCreate your own worlds, start your own survival game on the randomly generated maps! <br/>•\tPlay Fun Online Creative Game with Your Friends and All Your Family! Survive at Nights, Hunt Animals, Craft and Build! <br/>•\tEndless possibilities!<br/>•\t3D game graphics!<br/>•\tExploration of the sandbox blocky world! <br/>•\tCity builder game!<br/><br/>This is all about AdventureCraft where all your town building dreams come true!<br/><br/>Join one of the Best Survival Game!<br/><br/>Please give us 5 stars and leave your reviews, we appreciate your support! <br/><br/>Follow us on:<br/>FACEBOOK: https://www.facebook.com/tellurionmobile/ <br/>TWITTER: https://twitter.com/TellurionMobG <br/>YOUTUBE: https://www.youtube.com/channel/UC2jqGx9MXCUJjYZY_f19vug<br/>FORUM: http://forum.tellurionmobile.com<br/>INSTAGRAM: https://www.instagram.com/tellurionmobile_games/<br/>VK:  https://vk.com/tellurionmobilegames", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-31T03:05:35", "background_image": "https://media.rawg.io/media/screenshots/ab9/ab91f30134164f4c2395a47194d1e860.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 389, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Tellurion Mobile"], "genres": ["Simulation"], "publishers": [], "esrb_rating": "Everyone 10+"}