{"id": 225990, "slug": "minos-starfighter-vr", "name": "Minos Starfighter VR", "name_original": "Minos Starfighter VR", "description": "Updated to support full controller flight mode!<br/><br/>Important: Please note this game is built specifically for Google Cardboard type VR headsets and requires your phone is compatible with the Google Cardboard app. If your phone does not work with this app or you have problems, please e-mail me before leaving a negative review.<br/><br/>Minos Starfighter VR is a first-person arcade space shooter built for virtual reality. Using head based movement or flying with a gamepad you pilot a small space fighter through intense space battles defeating progressively harder waves of enemies. Fire your ship's lasers with your headsets trigger button, or if no trigger is available with gaze based targeting.<br/><br/>Featuring triple AAA graphics and the use of 3D positional audio, Minos Starfighter VR delivers the most immersive and compelling VR experience available on Cardboard. It has been fully optimized to squeeze out every bit of performance to provide a fluid and smooth VR experience.<br/><br/>Minos Starfighter VR features:<br/>• Fully immersive VR experience using AAA graphics and 3D sound<br/>• 3 beautifully crafted space environments to fly through<br/>• Never ending gameplay with progressively harder waves of enemies<br/>• Highly detailed ships with damage modeling and destructible pieces<br/>• Powerful upgrades to your ship and weapons<br/>• Share your score with friends, how many waves can you complete?<br/>• Built with the latest guidelines for VR to provide a comfortable and immersive experience<br/><br/>Game options:<br/>• You can disable VR mode in the main menu<br/>• If your Google Cardboard / VR headset does not have a trigger button disable the Trigger option in the main menu. This will allow head gaze based shooting.<br/>• Most Bluetooth and USB gamepad controllers are now supported. To change the controls on your gamepad press the Pause button in the main menu. <br/><br/>Minos Starfighter VR is best experienced with headphones. Please play standing or seated on a swivel chair. Enemies will try and attack you from behind!<br/><br/>If you experience steady drift, placing your phone on a flat surface for a few seconds can help to calibrate the sensors.<br/><br/>Have an idea how to improve the game?<br/><br/>E-mail me: justin@endspacevr.com<br/>Get updates on Facebook: https://www.facebook.com/endspacevr<br/>Check out the website at: http://endspacevr.com", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-30T23:15:49", "background_image": "https://media.rawg.io/media/screenshots/b85/b85bcc7fa751d5705de3db71dc474f78.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 328, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Orange Bridge Studios"], "genres": ["Arcade"], "publishers": [], "esrb_rating": "Everyone 10+"}