{"id": 225980, "slug": "cooking-madness-a-chefs-restaurant-games", "name": "Cooking Madness - A Chef's Restaurant Games", "name_original": "Cooking Madness - A Chef's Restaurant Games", "description": "PREPARE 🔪, COOK 🕑and SERVE 🍕 delicious meals from all over the world 🌎 in Cooking Madness! <br/> <br/>Become the master chef 👨‍🍳 you have always wanted to be! This year it’s this highly addictive time management game that’ll bring you the best digital cooking experience! <br/> <br/>Get yourself in a real cooking craze. Cook like you’re a MAD CHEF in Cooking Madness! Did the cooking fever caught on and you can’t get enough of 🍨 cooking games? Then this is THE cooking game for you! You’ll be serving delicious dishes 🍩 to hungry customers in amazing restaurants in a ⏩ FAST pace. No challenge that can’t be beaten by you.<br/> <br/>Dash from restaurant to restaurant on this magical map. You will discover and unlock many places as you progress on your journey. 🌄 Get the restaurants back to business and attract more and more customers. Let the Cooking Madness begin!<br/> <br/>Practice your cooking techniques and management skills 🍽. Tap as fast as you can while keeping your eye on the time. Making dishes have never been so much fun and exciting! Try all the possible kitchen appliances 🍳 to improve your cooking abilities. Upgrade dishes and kitchenware for a better gaming experience! <br/> <br/>Love a little bit of a thrill in your cooking game? Keep up with the rush hours, become better at time management 🛎. This cooking game offers endless fun levels with challenging missions set up in each level to give you that special experience. <br/> <br/>What more FUN things brings this game? <br/>-       Cook &amp; Travel  discover many different new restaurants 🍴<br/>-       Get Combos and Earn Huge Tips while showing off your cooking skills 💰<br/>-       Unlock New Restaurants by collecting enough key cards  🌮<br/>-       Upgrade your Kitchen and Level Up to become the famous Mad Chef! 💵<br/>-       Tap away in many fun levels 🍖<br/>-       Complete special missions and achievements to earn more🎁 <br/>-       And keep an eye on many more updates to come! 🔥<br/> <br/>Put that Chef Hat on and get cooking! Download for free today and join the Cooking Madness! ♥️<br/> <br/>Follow us on the official fanpage: https://www.facebook.com/cookingmadness.chef", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-30T19:10:26", "background_image": "https://media.rawg.io/media/screenshots/ab0/ab04658fa26d7210edfea3fdb6ad946a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 172, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Girl Games - Cooking Games"], "genres": ["Arcade"], "publishers": [], "esrb_rating": "Everyone"}