{"id": 225931, "slug": "air-fleet-command-world-war-2-fighter-bomber", "name": "Air Fleet Command: World War 2 - Fighter Bomber", "name_original": "Air Fleet Command: World War 2 - Fighter Bomber", "description": "[Event] Complete the tutorial now and get 3 Squadron!<br/>                  (Supplies -&gt; Customize -&gt; F.Squadron / B.Squadron)<br/><br/>  - Complete Historical battles and get rewards including the Xaviet Air Force Squadron!<br/>  - HD textures of the new and improved Historical Squadron (Completed)<br/><br/>[Please reinstall the game if you can not get pass Stage 0!]<br/><br/>[Before changing to another device or formatting your device. Be sure to use 'Cloud Save'. You can check it in \"Setting\". Please use the same Google account.]<br/><br/><br/>You can play legendary World War 1 and World War 2 air combat without any controls.<br/><br/>Upgrade your squadron by air combat and air raid.<br/><br/>who will be reach the jet era first?<br/><br/>▶ Play Historical Battle<br/>- Become the commander of historic military operation, like a Battle of Britain,  Stalingrad, Pacific War, and the Operation yellow.<br/><br/>▶ Upgrade your air fleet with budget that earned automatically.<br/>- From the WW1 biplane to WW2 jet fighter!  (Spitfire / Bf109 / Fw190 / Me262 and more) <br/>  and Bomber (Lancaster / Ju88 / He111 / B-17 Flying Fortress / B-29 Superfortress / IL-4 / Halifax)<br/><br/>▶ Shoot down the enemy planes with machine gun and Anti aircraft guns.<br/>- Aim the machine gun to the enemy to protect the bombers!<br/><br/>▶ Take the air superiority!<br/>- Take down the enemy squadrons!<br/><br/>▶ Perform the air raid mission.<br/>- Drop the bomb accurately and earn the huge budget!<br/><br/>▶ Overpower enemies with overwhelming technology.<br/>- Upgrade your item to the maximum!<br/><br/>▶ Show your legendary achievement to the enemy.<br/>- Awarded medals and put on your uniform to earn a special ability.<br/><br/>▶ Manage your front with allies!<br/>- Communicate with ally using secret telegrams!<br/><br/>▶ Observe the dynamic air warfare!<br/>- Watch realistic air combat in sunny weather, snow storms and thunderstorms!<br/><br/><br/>※ Minimum specifications: Samsung Galaxy S3 / S4 LTE-A / LG G2 or higher <br/>(2GB RAM or Higher RAM)<br/><br/>※ Official website<br/>Facebook: https://www.facebook.com/mastgame/<br/>Official Cafe: https://www.plug.game/beyondtail-en<br/><br/>※ Developer contact:<br/>MASTGames@naver.com<br/><br/>※ FAQ<br/><br/>1. The use of camouflage and historical squadron of your aircraft can be checked from the 'Supplies - Customize' menu.<br/><br/>2. Mission points can be earned on completion of specific missions each day. You can check it in 'Mission' menu.<br/><br/>3. Implementing the Z-axis is a matter of optimization and game difficulty issues, so we still need to discuss with the developers.<br/><br/>4. The reason the aircrafts are white and red at the beginning of the game is because the concept is a flat graphic design. However, at the request of many of you, we have added a historical squadron.<br/><br/>5. In order to solve the repetitive and boring part of the game, we plan contents such as base management, pilot management, history battlefield. However, it should not hurt the existing game elements, so it will take a lot of trouble and it is not yet clear when to update.<br/><br/>6. There are many points about the quality of language translation. This is a problem arising from machine translation and verification of military non-experts. We are trying to improve, but since the game is constantly updated, we plan to fix the translation at the same time when the complete game flow is completed.<br/><br/>7. We are considering adding languages ​​such as Italian, Spanish, Thai, and Japanese, but most of the translators that we can hire due to the financial limitations of our team are non-experts, and it is difficult to guarantee the quality of translation right now.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:52:22", "background_image": "https://media.rawg.io/media/screenshots/83e/83eb88ea6b28c887a1c9b5ea488dabf4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 247, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["MASTGames"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}