{"id": 226075, "slug": "jezzball-classic", "name": "JezzBall Classic", "name_original": "JezzBall Classic", "description": "JezzBall Classic was created to be just like how the original JezzBall was 25 years ago! The graphics, the sound, the scoring, the physics, the tempo... they are all the same as they were in the original. Of course there are improvements as well; for example there's a much higher frame rate and fixed glitches. Plus a lot of bonus stuff, such as new game modes!<br/><br/><br/>Gameplay:<br/><br/>In JezzBall there are a number of Jezz atoms that bounces around. Your task is to build walls that contain them in as small space as possible. When over 75% of the playarea is built upon the current level is completed and you move on to the next where another Jezz atom is added into play.<br/><br/>Press down to place the origin of the wall, move to determine the orientation of the wall and release to actually start building it. The wall is constructed in two directions from the center, if a wall-half is hit by a Jezz atom before it has reached an already existing wall it is destroyed and you lose a life.<br/><br/><br/>Features:<br/><br/>+ The original JezzBall experience! Into the very last detail; if you came looking for the JezzBall you remember you will not be disappointed!<br/><br/>+ Four profiles (one reserved for guests) with their configurations stored separately.<br/><br/>+ 700 beautiful background images (real life photos). Go to the \"Graphics\" config screen to enable it. Will place a random image into the black walls each level.<br/><br/>+ 8 music tracks of classic MIDI tunes you'll probably remember! All recorded using SoundBlaster 16. You can set up to 24 music audio events if you want to.<br/><br/>+ 60 fully customizable SFX audio events - change which sample(s) to play or change individual volumes. A pool of 300 sounds are available from various old games.<br/><br/>+ Automatic saving of all games in progress. Stop and continue whenever you want to!<br/><br/>+ Local high score lists. In the Hall of Fame your name will last forever and on the three other lists you will see the daily, weekly and monthly high scores.<br/><br/>+ Level records. All your best statistics are saved on each and every level you complete. Profile records are comparable.<br/><br/>+ Smart and very customizable controls. If you have a touchscreen you can play using your fingers.<br/><br/>+ 83 mods that once activated changes how the game is played! Use none or pick one/several at the same time in any order. High scores and level records are stored separately for each combination. Some mods will just change the amount of time/lives you have while other will drastically change gameplay (allow you to use two wallbuilders at the same time for example).<br/><br/>+ 22 preset mod-combinations are provided in addition to the original JezzBall experience to give you variation.<br/><br/>+ 100 rooms that will stimulate your intellect as well as your ability to time your deployments! Can you solve them?<br/><br/>+ There are also missions available to inspire you to break your personal bests. Completing them all is an achievement!<br/><br/><br/>JezzBall may not be near as well-known as the biggest arcade puzzle games but it stands its ground as one of the most addicting ones and I promise you will find JezzBall Classic both challenging and enjoyable.<br/><br/><br/>+ Do you wish to try the game before you buy it? There is a lite version available!<br/><br/>+ The game is also available for PC on winterdust.com if you'd like to play with a mouse.<br/><br/><br/>Good luck containing those Jezz atoms!<br/><br/><br/>(About the Internet permission: JezzBall Classic does not actually use Internet at all, the permission is only there because it's required when using the Adobe AIR engine.)", "metacritic": null, "released": "2011-09-12", "tba": false, "updated": "2019-11-11T02:19:39", "background_image": "https://media.rawg.io/media/screenshots/899/89942d43130fcc703f9b4e985e4bfd79.jpg", "website": "http://www.winterdust.com/jezzballclassic/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 115, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "Android"], "developers": ["Winterdust", "Marcus Bjuhr"], "genres": ["Arcade", "Casual", "Puzzle"], "publishers": ["Marcus Bjuhr"], "esrb_rating": null}