{"id": 226187, "slug": "ngpemu", "name": "NGP.emu", "name_original": "NGP.emu", "description": "Advanced open-source Neogeo Pocket Color emulator based on Neopop, designed and tested on the original Droid/Milestone, Xoom, Galaxy S2, Nexus 4, Nexus 7, NVidia Shield, Xperia Tablet Z, and Xperia Play, but works on virtually any device with similar or better specs. It's the very first NGP emulator available for Android.<br/><br/>Features include:<br/>* PSG Sound support (DAC will be added in an update)<br/>* English/Japanese game language switch support<br/>* Backup memory and save state support, auto-save and ten manual slots for save states.<br/>* ZIP, RAR, &amp; 7Z file support<br/>* Configurable on-screen multi-touch controls<br/>* HID Bluetooth/USB gamepad &amp; keyboard support compatible with any input device recognized by the OS (MOGA Pro, etc.), Wii controllers also supported if running Android 4.1 or lower, all devices support custom key profiles<br/>* Works in any orientation<br/><br/>No ROMs are included with this app and must be supplied by the user. A number of public domain games/demos are available at www.pdroms.de. Transfer games anywhere to your SD card and browse to them from within the app (default SD card directory is /mnt/sdcard).<br/><br/>Follow me on Twitter for updates about my apps:<br/>https://twitter.com/rakashazi<br/><br/>Visit the homepage at explusalpha.com for more info &amp; apps, ports for other platforms, and GPL source code. Please report any crashes or device-specific problems via email (include your device name and OS version) so future updates continue to run on as many devices as possible.", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-31T05:07:15", "background_image": "https://media.rawg.io/media/screenshots/0e2/0e2f8a44b16e65ee7dd53c549e09c28d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 52, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Robert Broglia"], "genres": ["Arcade"], "publishers": [], "esrb_rating": "Everyone"}