{"id": 22629, "slug": "metin2", "name": "Metin2", "name_original": "Metin2", "description": "<p>YOUR SWORD FOR THE DRAGON GODThe appearance of the Metin stones has torn deep rifts through the once flourishing world of the Dragon God. War has erupted between the kingdoms – wild animals have transformed into fearsome beasts and the dead have arisen to bloodthirsty, demonic life.<br />\nDefend your kingdom and hurl yourself into incredible battles full of action and magic. Raise your weapons against the forces of evil and become a living legend in one of Europe’s biggest MMORPGs!SHARPEN YOUR BLADE AND MIND Experience epic PvE adventures and merciless PvP duels<br />\nFight through maps and dungeons against dragons and sinister demon lords<br />\nCharge into fast-paced battles – even against entire hordes of enemies<br />\nBecome a mighty warrior and increase your character’s level right up to 120CHOOSE YOUR PATH AND FORGE ALLIANCES Choose from five character classes – Warriors, Ninjas, Shamans, Suras and Lycans<br />\nChoose your kingdom: Shinsoo, Chunjo or Jinno<br />\nFound a guild with friends and build on your lands<br />\nFight on lightning-fast mounts and tame cool pets<br />\nContinually improve your weapons and equipment through a selection of crafting systems<br />\nTake part in regular seasonal and community events</p>", "metacritic": null, "released": "2004-03-08", "tba": false, "updated": "2023-11-02T02:48:41", "background_image": "https://media.rawg.io/media/screenshots/3b7/3b76c82b267a38490d07560609ae926a.jpg", "website": "https://metin2.gameforge.com/", "rating": 2.81, "rating_top": 3, "added_by_status": {"yet": 3, "owned": 314, "beaten": 16, "toplay": 3, "dropped": 38, "playing": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 42, "suggestions_count": 345, "game_series_count": 0, "reviews_count": 42, "platforms": ["PC"], "developers": ["Webzen"], "genres": ["Action", "Adventure", "RPG", "Massively Multiplayer"], "publishers": ["Gameforge 4D"], "esrb_rating": null}