{"id": 226246, "slug": "fashion-empire-boutique-sim", "name": "Fashion Empire - Boutique Sim", "name_original": "Fashion Empire - Boutique Sim", "description": "Express yourself and become a style maven in the #1 dressup boutique simulation game!<br/><br/>Designed for style savvy women of all ages, it’s free to play and you can play Fashion Empire while offline. The game is constantly updated and full of fabulous gameplay-<br/><br/>- CHIC FASHIONS to sell, mix and match and grow your fortune<br/>- DECORATE your boutiques with thousands of gorgeous decorations<br/>- DESIGN thousands of unique items ranging from elegant to edgy<br/>- DRESS UP yourself and your trendy staff any way you choose<br/>- MAKEOVERS with all the latest makeup and cosmetics trends<br/>- COLLECT and covet special designer, elite and signature items<br/>- SHOP furniture - racks, tables, registers, displays and much more <br/>- STORY mode with fashion shows, fascinating characters and freedom<br/>- ADVENTURE to the top with hundreds of quests across many cities<br/>- WIN big and show off in online challenges - it’s fashion week every day!<br/>- JOIN a vibrant fashion loving community<br/><br/>The game is free to play and in-app purchases are available for additional content and premium currency.<br/><br/>Game background and how to play:<br/><br/>1/ You start in San Francisco, an aspiring designer just opened your first shop. You've always been creative, from playing dress up with barbie dolls as a kid, hours on the sims, learning to sketch and creating an amazing portfolio at a top design academy. Together with your investor Eva you'll begin by designing your very first item - a gorgeous pink dress which is sure to bring in initial shoppers<br/><br/>2/ After making your first sales you'll want to expand capacity for racks, registers, dressing rooms - and don't forget decorations to attract the style minded clients.<br/><br/>3/ As your boutique grows you'll learn more and unlock more outfit categories of items - shoes, heels, bags, purses, rompers, jumpsuits, makeup, cosmetics, accessories and more.<br/><br/>4/ After a while you'll probably find yourself busy as the sole worker in your boutique - it will be time to find the perfect staff to join you on your journey. But first you'll need to find a way to persuade them to join - and each have their own story to tell and personality to work with.<br/><br/>5/ San Francisco is just the beginning, soon you'll be expanding to Las Vegas, Miami, Los Angeles and even New York. There you'll get to know celebs and stars who will warm to your unique style and, in time, crave and covet your latest collections. And who knows what glamorous occasions you'll be designing for...<br/><br/>6/ Your reputation is starting to grow and it's time to prove yourself on the world stage amongst millions of other players. This is your chance to show your interior designs and outfits in challenging online themed contests, whether it's celebrity style or coffee casual, from red carpet to haute couture runway...<br/><br/>Ladies, the next big dressup game is here - it's time to write YOUR stylish story.<br/><br/>Questions or requests? Email us at fashionempire@frenzoo.com", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-31T00:08:52", "background_image": "https://media.rawg.io/media/screenshots/c94/c946a19ba0ea33131e04c042d78428e0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 324, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Frenzoo"], "genres": ["RPG"], "publishers": [], "esrb_rating": "Teen"}