{"id": 2262, "slug": "taichi-panda", "name": "Taichi Panda", "name_original": "Taichi Panda", "description": "The new update: Elemental Power has come out!<br/><br/>==============================================================<br/><br/>Touch Arcade – “A stand-out in RPG genre!”<br/><br/>App Advice – “An intense and fast-paced dungeon crawler!”<br/><br/>148 Apps – “Make this the Year of the Panda!”<br/><br/>Inside X Game*Spark – “Best of Social/Mobile E3 2015”<br/><br/>==Features==<br/><br/>The Journey Begins<br/><br/>Grab your sword and battle hordes of crazy creatures, magical mysteries, and sinister specters on an action-filled journey to become the ultimate legend! Prove you have what it takes in a goofy and thrilling action adventure MMO rendered with PC game quality 3D graphics and full-body motion capture technology.<br/><br/>Slash Through Opponents<br/><br/>True power lies within, unleash your hero and fight through to infinity! Battle through unique levels wielding blades, magic, and fists to bash enemies into oblivion with a fun, fast-paced action combat system. Master the unique skills of 6 distinct heroes to defeat enemies and become the ultimate champion of Avzar!<br/><br/>Discover Powerful Gear<br/><br/>Build up a powerful hero through strength and cunning in an RPG adventure! Collect and upgrade gear, skills, pets and mounts to increase your might and unlock your inner potential. Do you have what it takes to become a Taichi Legend?<br/><br/>Battle Online and Rule the Land<br/><br/>Join in online PvP and co-op with other players! Take on powerful bosses, and become a hero alongside allies in Team Instances. Battle in the arena, join Guilds for online Guild competition and co-op, or enter the fray in 25v25 Battle Royale PvP. Capture territory in Warpath, and rise to the top in team arena PvP League!<br/><br/>==Connect==<br/><br/>Visit our official site to learn more about Taichi Panda: http://panda.snail.com/en<br/>Join the Taichi Panda community and learn more on Facebook and our official Forum <br/>Facebook Page: https://www.facebook.com/TaichiPandaOfficial<br/>Community Forum: http://pandabbs.snail.com/", "metacritic": null, "released": "2015-03-05", "tba": false, "updated": "2019-07-01T02:30:32", "background_image": "https://media.rawg.io/media/screenshots/236/23619bcfa37ed8f6234dfe0c36f47d45_1U4V65A.jpg", "website": "http://panda.snail.com/en", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 371, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Snail Games USA"], "genres": ["Action", "RPG"], "publishers": ["Snail Games USA"], "esrb_rating": "Teen"}