{"id": 22634, "slug": "conquests-of-camelot-the-search-for-the-grail", "name": "Conquests of Camelot: The Search for the Grail", "name_original": "Conquests of Camelot: The Search for the Grail", "description": "In pagan times, the legends of Camelot were told as epic tales full of faith. Bold, colorful and often brutal, these tales survived the ages. They were a tribute to the legendary High King of Britain who managed to bring the warring tribes of Saxons, Celts, Angles Jutes under one rule and bring about a rebirth of Western civilisation.<br/><br/>\n\nSadly, in the last half century, the Arthur legend has been recast as a cartoon and children's story. The mystic rituals and dark passions that colored the original  Arthurian legends have been watered down to the soft and toothless fairy tales most commonly seen today.<br/><br/>\n\nWith Conquest of Camelot, designer Christy Marx has dug deep into the most ancient roots of legend to restore the power and passion of King Arthur and his court: his queen's forbidden love for Sir Launcelot; the struggle for supremacy between Christianity and the ancient Roman warrior-god Mithra. The blending of myth, history and religion behind the Gail legend is dealt with honestly and directly.<br/><br/>\n\nThis combination of pre-Medieval history and ancient legend makes for a more sophisticated, complex and powerful view of Arthur than any you may have seen before.", "metacritic": null, "released": "1989-01-01", "tba": false, "updated": "2023-02-08T10:49:46", "background_image": "https://media.rawg.io/media/screenshots/f9d/f9d601dce4352e7afd866ac503e54bcc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 7, "owned": 26, "beaten": 4, "toplay": 4, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 4, "suggestions_count": 433, "game_series_count": 0, "reviews_count": 4, "platforms": ["Commodore / Amiga", "Atari ST", "PC"], "developers": ["Sierra Entertainment", "Sierra", "Sierra On-Line"], "genres": ["Adventure", "RPG", "Puzzle"], "publishers": ["Activision Blizzard", "Sierra On-Line"], "esrb_rating": null}