{"id": 22639, "slug": "anno-1701-ad", "name": "Anno 1701 A.D.", "name_original": "Anno 1701 A.D.", "description": "<p>ANNO 1701 A.D. includes Anno 1701 and its expansion Anno 1701: The Sunken Dragon.<br />\nANNO 1701 is the most elaborate and expensive game production in the German speaking region and the sequel to the most successful, multi-million selling game series of all times. The third part of the unique combination of different genres creates a real-time building game and is also set in 16th and<br />\n17th century, the era of discoveries and maritime trade.<br />\nFor the first time, players of all experience levels were included in the development and could help significantly to make the unique gaming experience now even more accessible. The player is engaged in creating, expanding and maintaining a flourishing metropolis, while communicating with other players or interacting with other parties via trade or diplomacy.<br />\nBecome a rich merchant, virtuoso builder or experienced strategist – the open structure of ANNO will reward any individual approach! The fascinating vibrancy of the self-built world, the ever present interaction with the player and an enthralling atmosphere offering excitement and fun will grip everyone who ever played ANNO 1701 A.D. forever.Unique combination of city-building strategy, trade, discovery, diplomacy and battle.<br />\nMaximum interaction with the game environment through numerous event details, such as cheering or protesting of the people, lovingly animated and composed characters, and through trade and diplomacy with foreign people.<br />\nExtremely detailed and vivid graphics with innovative effects and breathtaking realism in flora and fauna, in the city or in occurring natural disasters, such as tornados, volcanic eruptions or earthquakes.<br />\nPerfect introduction, even for the less experienced player, for example with the unique ‘Info mode’ and a simplified, clearly structured user interface.<br />\nExcitement without fail in over 100 different voluntary special tasks (Sub-Quests), which are dynamically integrated into the game and provide useful rewards.<br />\nSecret diplomacy with special tasks such as sabotage, espionage or demagogy allow for an intelligent, strategic approach.<br />\nMulti-player mode for up to 4 players via LAN and the option of cooperative play.<br />\nMilitary element with troop formation and feedback in spectacular land and sea battles.</p>", "metacritic": 78, "released": "2006-10-25", "tba": false, "updated": "2024-03-18T19:23:34", "background_image": "https://media.rawg.io/media/games/0d1/0d1a3155ea5e5bb46930ac64d04266fd.jpg", "website": "", "rating": 4.12, "rating_top": 4, "added_by_status": {"yet": 19, "owned": 97, "beaten": 31, "toplay": 7, "dropped": 11}, "playtime": 1, "achievements_count": 0, "ratings_count": 34, "suggestions_count": 514, "game_series_count": 14, "reviews_count": 34, "platforms": ["PC"], "developers": ["Related Designs"], "genres": ["Strategy", "Simulation"], "publishers": ["Ubisoft Entertainment"], "esrb_rating": "Everyone 10+"}