{"id": 22649, "slug": "dracula-trilogy", "name": "Dracula Trilogy", "name_original": "Dracula Trilogy", "description": "Dracula: The Resurrection\n<br/>\nBased on the characters from Bram Stoker's suspenseful novel, Dracula: The Resurrection takes you forward seven years from Jonathan Harker's faithful rescue of his fiancée Mina from the fangs of Dracula. Now married and comfortably living in London, Jonathan thinks his nightmare is behind him until he comes home to find a letter from his wife, who was bitten by Dracula several years ago on the night of his death. Unable to ignore her call for blood, she is returning to Transylvania. Jonathan's search for his wife - and his life - will take you through an Inn, Caverns, a Rail System and Dracula's Castle on his desperate passage to bring Mina back to London.\n<br/><br/>\nDracula: The Last Sanctuary\n<br/>\nAs Jonathan Harker, you know that your wife, Mina, trapped under the Vampire's spell, will never be safe as long as Dracula is still alive. You must hunt down Dracula in an attempt to vanquish him forever. Follow a lethal trail in a chase from London back to Transylvania: from an insane asylum to Dracula's castle, and through an underground prison littered with the bones of forgotten men, arriving finally at Dracula's Last Sanctuary.\n<br/><br/>\nDracula: The Path of the Dragon\n<br/>\nFather Arno has been sent to Vladoviste in Transylvania, a small town still recuperating from battle after the First World War. He's on a mission from the Vatican to investigate the life of a deceased woman reputed to be a saint. As night falls and the last train pulls away, something evil lurks across the graves of fallen soldiers, and Father Arno's nightmarish visions are becoming all too real.\n<br/><br/>\nBrave the depths of horror and depravity as you embark on three blood-tingling adventures! A gripping storyline will take you through three suspenseful chapters in the Dracula Trilogy. Investigate dark, occult secrets, interrogate suspicious characters, and discover the heart of the mystery in Dracula Trilogy!\n<br/><br/>The Dracula Trilogy pack includes Dracula: The Resurrection. Dracula: The Last Sanctuary, and Dracula 3: The Path of the Dragon.\nDecipher mysterious manuscripts and ancient prophecies from the origins of mankind.\nExplore the inner sanctum of a Transylvanian castle while on the hunt for a terrifying secret.", "metacritic": null, "released": "1999-09-30", "tba": false, "updated": "2019-08-28T22:07:26", "background_image": "https://media.rawg.io/media/screenshots/b20/b20dc4addb756c6b66ea4b757ded6223.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 4, "beaten": 1, "toplay": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 494, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Anuman Interactive"], "genres": ["Adventure"], "publishers": ["Microids", "Anuman Interactive"], "esrb_rating": null}