{"id": 226450, "slug": "realm-defense-hero-legends-td", "name": "Realm Defense: Hero Legends TD", "name_original": "Realm Defense: Hero Legends TD", "description": "Calling all strategic tower defenders! Are you a fan of epic online tower defense games? Become a hero of war in and download now to join heroes like Smoulder the Dragon, ninjas, wizards, and many other defenders of the realm in their ongoing quest to defend the realm! <br/><br/>Start playing Realm Defense - TD strategy game now and fight in the battle of heroes against monsters. <br/>Use your archery skills as you build a barracks, magic towers and more, in the #1 castle defender!<br/><br/>It will take a hero’s tactic to save the turrets and towers from invasion. Do you have what it takes to engage in realm defense? <br/>This real-time kingdom rush castle defense game needs your help to battle and conquer! We need your skills to defend the tower – The Allied Kingdoms have one choice in this TD game: defend, defend, defend! Battle with Death Knights and fight alongside dragons, wizards, ice queens, knights and other ancient gods in our magical fantasy adventure field! You can acquire gems, potions, elixir, and even spells while working your way up to become a champion and hero! Are you ready to save the kingdom and be the best realm grinder out there? Smoulder needs your help against the Goblin King! Defend the realm - be a castle defender and show us your TD skills in this online strategy game. We’re counting on your castle defense skills to help in our kingdom rush frontier! <br/> <br/><br/>Realm Defense is an ultimate tower kingdom defense game that challenges skilled players like you! <br/>Use our huge variety of powers and abilities to overcome obstacles in over 300 levels. By being a part of our kingdom rush frontier, you will travel through lush forests, snow covered mountains, and epic deserts as you use YOUR strategy to face off against enemies! The opportunities are endless – YOU will oversee the building a heroic team, discovering secret challenges, and upgrading your towers! <br/>Deploy rapid-fire archers! Carve walls on the map with magic beams! Fire roaring cannons! Summon allies! Realm Defense offers variety and challenge. Overcome incredible odds with strategy and wit! Rescue helpless villagers, collect important resources, and recruit legendary heroes with deadly abilities along the way to stop evil in this standout tower defense game.  <br/><br/>•\t300+ levels with various game play modes<br/>•\tMultiple worlds and realms to play with – Each having four different towers <br/>•\tCompete in tournaments to display your tower defense skills and win big prizes<br/>•\tPowerful heroes with unique abilities to aid you: Fee the Archer launches a deadly Kill Shot, Lancelot the Knight unleashes the Fist of Justice, Smoulder the Dragon rains down Heat Seeker fireballs and many more<br/>•\tFace off against epic bosses including a Skeleton Mage that rides a giant slime and zaps your heroes and a bomb tossing, mammoth riding Goblin King, and smolder your enemies to victory<br/>•\tHuge variety of enemies offer multiple challenges: Burn your enemy, freeze them, and more with 4 spells to cast in battle<br/>•\tBeautiful landscapes and character animations<br/>•\tOne of the best tower defense games free on the android market<br/>•\tFun strategy games and royal challenges<br/><br/>PLEASE NOTE! This online TD game is free to play and made by people who love tower defense games. We sincerely hope you enjoy our work!<br/><br/>Facebook: https://business.facebook.com/RealmTowerDefense<br/><br/>* Allows applications to access information about networks. (ACCESS_NETWORK_STATE)<br/>* Allows applications to access information about Wi-Fi networks. (ACCESS_WIFI_STATE)<br/>* Allows applications to open network sockets. (INTERNET)<br/>* Allows access to the vibrator. (VIBRATE)<br/>* Allows Google Play billing service. (BILLING)<br/>* Allows Play Install Referrer API. (BIND_GET_INSTALL_REFERRER_SERVICE)", "metacritic": null, "released": "2017-03-07", "tba": false, "updated": "2019-12-27T01:53:02", "background_image": "https://media.rawg.io/media/screenshots/646/646c5e0fcb8f009909ccc91c69f17281.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 332, "game_series_count": 0, "reviews_count": 2, "platforms": ["iOS", "Android"], "developers": ["Babeltime", "Babeltime US"], "genres": ["Action", "Strategy"], "publishers": ["Babeltime Inc. US"], "esrb_rating": "Everyone 10+"}