{"id": 226413, "slug": "basketball-frvr-shoot-the-hoop-and-slam-dunk", "name": "Basketball FRVR - Shoot the Hoop and Slam Dunk!", "name_original": "Basketball FRVR - Shoot the Hoop and Slam Dunk!", "description": "Smash the rim and shoot hoops from the free throwing line. How many triples in a row can you get? Slam dunk the hoop, get a 3-point shooting streak and became a basketball star! Join the free throw competition, shoot the hoops and try to get as many points as you can from the free throw line. Get on a roll in the best basket game!<br/><br/>🏀🏀🏀🏀🏀🏀🏀<br/><br/>It’s time to show off your basketball shooting skills! Feel like a real basketball star behind the free throwing line. Align your feet, find the balance, look up to the hoop and shoot the ball! See how the basketball flies and swish the rim like a PRO basket player.<br/><br/>Your mission is simple: Slide your finger on the screen of your smartphone or tablet to give the perfect direction to the ball to score point after point! Don't miss or you will have to start over. Start shooting to the hoop and try to beat your own high score!<br/><br/>Basketball FRVR is a truly relaxing casual experience, designed for both players looking for a fun time and hardplayers looking for a real challenge. Simple and incredibly addictive gameplay, easy to play but hard to master.<br/><br/>Warm up your wrist, your coach is calling you to enter the pitch and you have to be ready for the basket challenge of your life. The dunk tournament has begun and the best PRO players are joining to the basket jam. Race to shoot hoops in amazing shootouts and try to reach the highest score among your friends!<br/><br/>🏀⛹Seems easy for you? So we have a basket PRO here! Don’t get used to it, wait until the hoop starts moving! Don’t break your strim and dunk them all in this flick hoop game!⛹🏀<br/><br/>In Basketball FRVR there are no limits, all that matters is to slam all the free throws you can. Don’t worry if you hit the rim or the glass, just make sure you finally dunk the hoop! Raise your best free throw percentage and become a legend of the three point shootout. The best flick basketball game ever!<br/><br/>Basketball FRVR is different than a regular free throw contest that you can see. On this dunking game, there’s no score limit! Just try to slam as many hoops as you can by swiping your finger and try to beat your highscore! Swish the basketball and get +3 points, or use the glass and hit the rim for getting +2 points. A true master of the hoop never miss a shot ;)<br/><br/>Slam 3 shots in a row and get a +3 bonus with every swish you make. Your score will jump to the stars! Don’t break the streak and collect coins to unlock amazing skins for the ball. Choose among +10 unlockable basketballs and play each match with a different skin. Who said you can’t toss a watermelon and even though become the MVP? Slam dunk with style!<br/><br/>Looking to become a real basket star, and need some free shots lessons? Are you already a pro basket player but need some practice to improve your dunking skills? Then you’ve found your game! Take the ball and enter the area. Prepare your elbow, twice your wrist, take a deep breath (Remember not to step the foul line) and... BAM! Dunk hoop it all! Welcome to BASKETBALL FRVR!<br/><br/>Basketball FRVR is a low storage game, you don’t need more than 30 mb to play! This free throw jam game only focuses on giving you a truly fun experience in a low mb game for free. It’s an easy to play basketball game with incredibly addictive and simple controls, so both young and adults can have fun. Play online or offline, since you don’t need an internet connection to shoot hoops. And relax, you can play as much as you want, there’s no time limit!<br/><br/>🏀⛹Feel like a professional basketball player behind the foul shot, feel the pressure, feel the fun... toss the basketball and DUNK! Are you ready?⛹🏀<br/><br/><br/>Do you like it? We have a lot of free games for you!<br/>http://frvr.com<br/>https://basketball.frvr.com<br/>http://fb.me/frvrgames<br/>http://fb.me/basketball.frvr.instant", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-31T07:54:39", "background_image": "https://media.rawg.io/media/screenshots/dcb/dcb760f96bccf9f90a48d5a410b7f4c8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 62, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["FRVR"], "genres": ["Sports"], "publishers": [], "esrb_rating": "Everyone"}