{"id": 226469, "slug": "star-traders-4x-empires-elite", "name": "Star Traders 4X Empires Elite", "name_original": "Star Traders 4X Empires Elite", "description": "Play the free 4X version \"Star Traders 4X Empires\" before you purchase Elite and enjoy hours of turn-based strategy in the Quadrant for free! Explore, expand, exploit and exterminate in this ad-free, permission-free game!<br/><br/>Take command of humanity’s last survivors and rebuild an empire among the stars. In this immersive turn-based strategy game, you must lead the refugees of the great Exodus to a new home in hostile space and build a new galaxy-spanning civilization. To survive in the dark reaches of space, you will have to fight to protect your people, control rival factions, and unlock lost technology. <br/><br/>This challenging civilization-building game expands upon the universe of the original Star Traders RPG.  As the leader of a splinter group who have fallen behind the main fleet, you have no choice but to settle nearby habitable worlds, stake your claim and try to prosper. <br/><br/>Your forces will face hostile aliens at every turn and your fleets will do battle in a challenging tactical conflicts across the solar systems. As the waves of stellar conflict wash across your empire, you’ll face invasions, devastating planetary bombardments and need to exact the same on alien infestations to expand your empire. <br/><br/>Within your own imperium, you must manage your economy, political realm, and technological research. The squabbling factions vie for power, unable to lay old rivalries to rest.  Only your deft political maneuvering can build treaties and harmony over discord and war. From the helm, you must also construct a mighty economy, one capable of surviving the devastation of war and the attacks of political adversaries.  A sprawling technology tree lies before you and your choice of technologies will determine the strategy of your galactic civilization.  To survive, you’ll need to overcome some of these challenges, to succeed you must master them all.<br/><br/>Take control through the strategic use of spies, economics, politics, technology and advanced weaponry in the most engaging, expansive and intense turn-based sci-fi title.  Rebuild the human civilization from the ashes of interstellar war to become the galaxy’s ultimate leader in Star Trader 4X Empires. <br/><br/>FEATURES:<br/>   * Grow a ragtag band of survivors into a new galactic empire.<br/>   * Protect your colonies of galactic refugees from alien attack.<br/>   * Employ devious political and economic machinations to expand your domain.<br/>   * Use spies and espionage to get the upperhand on your enemies.<br/>   * Research and build incredible new ships, weapons and technologies.<br/>   * Trade with a vast universe full of rich, dynamic characters.<br/>   * Explore the galaxy and uncover its many secrets.<br/>   * Multiple difficulty levels and customizable map sizes.<br/>   * Risk everything to rescue refugees and keep them safe.<br/><br/>The Star Traders 4X Elite experience allows you to:<br/>   * Play on more than twice the maps, including large and huge Quadrants<br/>   * Play the Great Houses &amp; Clans - Thulun, Javat, and Steel Song<br/>   * Unlock the Elite tech tree and gain access to hundreds of new upgrades<br/>   * Battle against twice the alien enemies and AI types<br/>   * Research 180 Technologies, 100 Weapon Types and 9 unique Hull Variants<br/><br/>Get ready for the fight of your life in Star Traders 4X Empires.<br/><br/>Star Traders 4X Empires is on Facebook:<br/>https://www.facebook.com/startraders<br/><br/>Join the Community Forum:<br/>http://startradersrpg.proboards.com/#category-7<br/><br/>Twitter:<br/>https://twitter.com/TreseBrothers", "metacritic": null, "released": "2014-06-22", "tba": false, "updated": "2019-08-02T06:34:25", "background_image": "https://media.rawg.io/media/screenshots/e76/e76c388ad7ae2aa0ad03b7603ed11e14.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 321, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Trese Brothers", "Cory Trese"], "genres": ["RPG", "Strategy"], "publishers": ["Trese Brothers"], "esrb_rating": "Everyone"}