{"id": 226571, "slug": "kids-dino-adventure-game-free-game-for-children", "name": "Kids Dino Adventure Game - Free Game for Children", "name_original": "Kids Dino Adventure Game - Free Game for Children", "description": "FIVE fun and exciting games with lots of dinosaurs for all the dino lovers out there!<br/> <br/>Dino Adventure<br/> <br/>This is a simple game for toddlers. You dig for dinosaur bones by rubbing the screen on the marked spots. While digging, you find dinosaur bones and random items, and when you have found all the bones, the dinosaur comes alive!<br/> <br/>Coloring Book<br/> <br/>This is a simple yet fun drawing app for kids. Color lots of cute dinosaurs, have fun creating your own doodles in free draw mode, and laugh at the wacky color combinations created by the random button!<br/> <br/>Jigsaw Puzzle<br/> <br/>In this intuitive puzzle game for kids and adults you can choose whether to use 6, 9, 12, 16, 30 or 56 pieces, adjusting the difficulty to the appropriate skill level. Great for relaxation and hand-eye coordination. If you or your kids like dinosaur games and jigsaw puzzles, they will LOVE this puzzle filled with cool dino pictures!<br/> <br/>Matching<br/> <br/>This dinosaur matching game is the classic board game which helps develop memory skills of children. It contains cute images of dinos such as T-Rex, pterodactyl, stegosaurus and more. Five different difficulties (6, 8, 12, 16 and 20 cards) means you can push your memorization to the limits!<br/> <br/>Scratch and Color<br/> <br/>A scratch and color game with amazing dinosaurs! In this game children will discover a hidden image in scratch mode or paint in the coloring mode, and also learn the name of each dinosaur as you play. <br/> <br/>Key Info:<br/>- Train hand-eye coordination<br/>- Trains memory and memorization<br/>- Explore your creativity<br/>- We use Google Analytics to collect anonymous statistics to help us improve the game.<br/> <br/>We believe this is a great free game pack with a little bit of everything for dinosaur fans - but what do your girls or boys think? Download our game today, leave a review, and let us know!<br/> <br/>Music: \"Quasi Motion\", \"Artifact\", \"Montauk Point\", \"Earth Prelude\"<br/>Kevin MacLeod (incompetech .com)<br/>Licensed under Creative Commons: By Attribution 3.0", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:49:35", "background_image": "https://media.rawg.io/media/screenshots/abf/abf8f445dfceff62d038140609126c4c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 47, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["App Family Kids - Games for boys and girls"], "genres": ["Casual"], "publishers": [], "esrb_rating": null}