{"id": 226596, "slug": "550-card-games-solitaire-pack", "name": "550+ Card Games Solitaire Pack", "name_original": "550+ Card Games Solitaire Pack", "description": "Are you looking for an awesome Solitaire cards game collection for your Android device? If so, this application is for you. Get 550+ Card Games Solitaire Pack Free today and join the fun! <br/><br/>If you liked playing solitaire on windows or solsuite solitaire to pass time you are going to love this classic game.<br/>Our Solitaire game takes the trusted gameplay formula. With stunning graphics and animations this version of the popular card game is one of the most beautiful solitaire card games you'll find.<br/>550+ Card Games Solitaire features a beautiful custom designed card set in high resolution, playing Patience on your HD Android tablet never looked this good! World of Solitaire.<br/>The classic Patience game controls have also been optimized to touch screen devices - it takes no time to learn at all, and works just as you'd expect, be it on a tablet or a small phone. <br/><br/>550+ Card Games Solitaire Pack's features in points:<br/>* Various Game Type(Klondike, Freecell, Spider, Canfield, Yukon, Golf, Pairing, Gypsy, Braid, Terrace, Baker's Dozen, Raglan, Castle, Montana(Gaps), Fan, Napoleon, Forty Thieves and many more)<br/>* Stunning HD graphics &amp; animations<br/>* For each game there is a description of the rules<br/>* Various themes <br/>* Unique old classic card deck<br/>* Full Auto Hint (If you don't know game rule, check on) <br/>* Automatic completion(on/off support)<br/>* Easy controls: either drag and drop cards and stacks, or tap to select and tap to drop<br/>* Unlimited undo-all, undo, redo and redo-all<br/>* Auto save ensures your game is always ready to start off where you left it <br/>* Tablet support<br/>* Statistics<br/><br/>If you don't know game rule, don't worry <br/>Our game's full auto hint system keep on, then game rule automatic learning.<br/><br/>Solitaire is also known as Patience Card Game.<br/>The Solitaire Classic card game is fully featured, ad supported.<br/><br/>Enjoy solitaire games for FREE!", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-31T03:50:25", "background_image": "https://media.rawg.io/media/screenshots/175/175eda1e8e1394d710452956284f6417.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 134, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["CommaLite"], "genres": ["Card"], "publishers": [], "esrb_rating": "Everyone"}