{"id": 226502, "slug": "dubstep-floppy-bird-beat-drop-sound-effect-game", "name": "Dubstep Floppy Bird - Beat Drop Sound Effect Game", "name_original": "Dubstep Floppy Bird - Beat Drop Sound Effect Game", "description": "At the start of the game, everything looks normal. Then the beat drops and all the graphics change into a dubstep world of wonder! Unlock all 9 EDM tracks to listen to while flapping over the pipes/tubes. This is one of the few dubstep games on the app store which syncs the beat drop to a beautiful animation. It is highly recommended you plug your phone into a good set of speakers as the sound quality is exquisite. If you have a high score, share it on social media. Then, check out each of the composers' songs on their websites.<br/><br/>Part of the hilarity in the game is the fact that the intense dubstep music seems to perfectly describe the intense emotions one goes through when playing floppy bird. The combination of a dubstep game and a frustrating, stressful bird game is hilarious.<br/><br/>Your bird will also wear a cute top hat when you make a highscore (above 10). No ads during this period.<br/><br/>While ads are in the free version of this app, they are entirely avoidable. Each round gives you a simple goal which you must complete in order to skip the ad. Usually, this goal is set several points below your highscore, so you will always have a good chance at avoiding the ad. Consider purchasing the deluxe version if you struggle to avoid ads.<br/><br/>Features<br/> - Unlock 8 original dubstep song at various BPMs<br/> - Unlock many hats<br/> - Skip the ad when you reach a high enough score<br/> - Highscores to compete worldwide and with friends<br/> - Achievements<br/> - 60 FPS<br/> - Great gameplay<br/> - Flap through pipes<br/> - Amazing graphics change animation<br/> - EDM dance lighting effect<br/> - Twitter<br/> - Links to songs from the artists' sites. They partnered with us so that you can download their electronic music.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:50:00", "background_image": "https://media.rawg.io/media/screenshots/c71/c718dc5dc84a0c571b654963f1c99e1a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 49, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Impact-Studios"], "genres": ["Arcade"], "publishers": [], "esrb_rating": null}