{"id": 226584, "slug": "sudoku-offline", "name": "Sudoku offline", "name_original": "Sudoku offline", "description": "Welcome to Free Sudoku Game. The best ever Brain game for android offline!!!<br/><br/>With this free Sudoku or Number Place, you will never need any other Sudoku puzzle Game!!! Quest into the Sudoku world.<br/><br/>Because this Sudoku game have provided you so many Sudoku that allow you to play endlessly and it is completely free and offline playable. With more than 10000 games!!!<br/><br/>• 2 grid types<br/>• 5 different regions<br/>• 5 difficulty levels each of them more than 100 games. <br/><br/>Want to challenge yourself? Play the Fiendish.<br/>Want something fun and casual, Select from the Easy, Medium, challenging and hard or Fiendish<br/><br/>Want a classic Sudoku puzzle game? Play this. The standard Sudoku board offer you the classic Sudoku game.<br/>Want more than classic Sudoku game? Try the Squiggly board. A brand new experience of the Sudoku game!<br/>Want more? Try the X-Sudoku, Hyper-Sudoku, Percent-Sudoku, Color-Sudoku, there are so many variance for you to select.<br/><br/>Want to keep track the time you use to solve a Sudoku game? This app shows and record the time you spend on a Sudoku game.<br/><br/>Like to play by eliminating value in a Sudoku game? Yes, you got it from this app.<br/><br/><br/>Features:<br/>• Five difficulty levels : Easy, Medium, challenging, hard and Fiendish.<br/>• Two beautiful grid styles : Standard and  Squiggly <br/>• Choose light and dark Sudoku board - suitable for night/day mode selection.<br/>• Endless collection crafted puzzles with all difficulty levels. Play it and enjoy.<br/>   -Easy for the beginners<br/>   -Medium to Hard for intermediates <br/>   - Fiendish for experts<br/>• Auto save your game - Avoid missing your progress.<br/>• Unlimited Undo/Redo<br/>• Intuitive interface and input system<br/>• Cell first and digit first input system<br/>• support play by eliminating value<br/>• Error checking<br/>• Playable any time and anywhere offline<br/>• Pencil mark", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-31T07:43:56", "background_image": "https://media.rawg.io/media/screenshots/425/425fd0cfa204deb5c721c20718eac443.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 41, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["MobileAppForYou"], "genres": ["Board Games"], "publishers": [], "esrb_rating": "Everyone"}