{"id": 22653, "slug": "heroes-of-might-and-magic-5-bundle", "name": "Heroes of Might and Magic 5: Bundle", "name_original": "Heroes of Might and Magic 5: Bundle", "description": "Heroes of Might and Magic® 5 is a turn-based strategy game in which you can build cities and besiege them, train troops and slaughter them, and explore new lands – and crush them under your iron heel. You directly command your armies on the battlefield and aid them with your character’s abilities as well as your own strategy skills. With six unique factions to choose from, each with its own set of buildings and creatures, Heroes of Might and Magic® 5 provides gamers with the strategy and detailed graphics that the series has been known for. As you progress through the game your character gains levels of experience that allow him to learn new spells and abilities. All this is set in the magical and enchanting setting of the legendary Might and Magic® universe.\n<br/><br/>\nHeroes of Might and Magic® 5 is, without a doubt, a worthy installment of the acclaimed series. It stays true to the formula established by the previous parts of the franchise and improves upon it, creating a very entertaining title with a gripping story, an enchanting soundtrack with visuals to match, and very fluid gameplay. If you are a fan of the franchise you will not be disappointed, but if you haven't tried Heroes of Might and Magic® games yet, then this is the perfect place to start.\n<br/>Heroes of Might and Magic® 5 Bundle includes Heroes of Might and Magic® 5 and its two expansions: Tribes of the East and Hammers of Fate.\nThirteen campaigns bring you a deep and engaging strategy experience spanning countless hours in the fantasy world of Might and Magic®.\nExceptionally high level of immersion achieved through a synergy of beautiful visuals, enchanting music, and smooth gameplay.", "metacritic": null, "released": "2006-05-18", "tba": false, "updated": "2024-01-22T16:30:15", "background_image": "https://media.rawg.io/media/screenshots/87d/87dce13232080fe57d9be88f72f8e1b2.jpg", "website": "", "rating": 4.35, "rating_top": 5, "added_by_status": {"yet": 2, "owned": 10, "beaten": 20, "toplay": 5, "dropped": 7}, "playtime": 0, "achievements_count": 0, "ratings_count": 20, "suggestions_count": 538, "game_series_count": 0, "reviews_count": 20, "platforms": ["PC"], "developers": ["Nival Interactive"], "genres": ["Strategy"], "publishers": ["Ubisoft Entertainment"], "esrb_rating": "Teen"}