{"id": 226634, "slug": "unicorns-jigsaw-puzzles-game-kids-adults", "name": "Unicorns Jigsaw Puzzles Game - Kids & Adults 💖", "name_original": "Unicorns Jigsaw Puzzles Game - Kids & Adults 💖", "description": "This game features loads of jigsaw puzzles with pictures of magical unicorns and Pegasus horses taken straight out of a fairytale and is sure to be a hit with most kids, big or small!<br/><br/>For anyone who loves prancing unicorns and winged Pegasus horses, this app has just the fantasy setting for you! With over 20 different jigsaw puzzles featuring beautiful pictures you will be sure to find a favorite horse among these magical creatures.<br/><br/>With 6 different difficulty levels you can make sure the relaxing puzzle suits everyone. Adjustable settings also allows you to change the difficulty, hiding or revealing the image of that marvelous unicorn you're trying to puzzle together!<br/><br/>Features:<br/>- Enjoy 24 different fairytale puzzles<br/>- 24 pictures<br/>- Play with 6, 9, 12, 16, 30 or 56 pieces - easy for kids, challenging for adults<br/>- Fun rewards for each puzzle<br/>- Natural puzzle dynamics<br/>- Intuitive navigation<br/>- Free to play, with child-safe in-app purchase to remove ads<br/><br/>(Please note: the app contains advertisements shown after every 4 puzzles played. Advertisements can be disabled via an in-app purchase.)<br/><br/>What do you think about our game? Love it? Hate it? Let us know in your review. <br/><br/>Music: \"Simple Duet\"<br/>Kevin MacLeod (incompetech)<br/>Licensed under Creative Commons: By Attribution 3.0", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:49:15", "background_image": "https://media.rawg.io/media/screenshots/5c0/5c0ae37286bd18d56f2bf14971ed0b98.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 116, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["App Family Kids - Games for boys and girls"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}