{"id": 226716, "slug": "yachty-dice-game-yatzy-free", "name": "Yachty Dice Game 🎲 – Yatzy Free", "name_original": "Yachty Dice Game 🎲 – Yatzy Free", "description": "Yachty Dice Games<br/><br/>Yatzy is a free board dice games. A multiplayer that you can play with bubbies and fun offline game you can play anywhere. Yachty is a classic time killer for you and fantastic family pastime. People call it yatzy, yachty, yahtzy, yatzie, poker dice or any other way but be sure that this is the one dice game you and your buddies like!<br/><br/>If you are not familiare with classic yachty dice game, don't worry! Get ready to have fun in the world of this classic board and addictive yachty free game. The rules are simple and clear. You will learn how to play yatzy easily and will be able to tell your friends and family how to play.<br/><br/>Yatzy is the dice games where players should score as many points as possible, by throwing combinations of dice. There are only 13 rounds in the game and you should fill in all 13 combinations. This dice game is also called poker dice. Here, in the game 5 identical dice is the best combination which is called Yazty. There are a number of combinations such as Full house, Three of a Kind, Four of a Kind, Small Straight, Large Straight. If you re-throw Yatzy, Joke Rule will be activated and you will get a bonus and could write every combination. You can find full details on our website, dedicated to our fun and addictive dice game. <br/><br/>Let’s play Yachty free!<br/>- Pass your time with Yachty if you are bored and alone, train for being the best dice roller<br/>- Challenge your friends and family, activate online multiplayer mode and enjoy classic free yatzy<br/>- Choose your opponent according to your level <br/>- Roll and play regular yachty tournaments<br/>- Score prizes and gets super bonuses every hour!<br/><br/>Play this best classic free dice game everywhere! Enjoy yatzy yourself, get fun with family and friends, be the king of yachty<br/><br/>Terms of Use: www.fabros-team.com/terms-of-use.html<br/>Privacy Policy: www.fabros-team.com/privacy-policy.html", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:48:57", "background_image": "https://media.rawg.io/media/screenshots/232/23289a0e7d1a7f1f584c2ee543ae5a00.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 125, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["fabros"], "genres": ["Board Games"], "publishers": [], "esrb_rating": null}