{"id": 226750, "slug": "planet-genesis-solar-system-sandbox", "name": "Planet Genesis - solar system sandbox", "name_original": "Planet Genesis - solar system sandbox", "description": "*** Do you own a high-end device? Try Planet Genesis 2 for the best experience ***<br/>https://play.google.com/store/apps/details?id=com.RaptorClaw.Genesis2<br/><br/>Planet Genesis is one of the finest and most visually stunning universe sandboxes available for Android devices. Any person can now discover by himself how gravity affect and change objects in space. By just a finger touch, you can create asteroids, planets, stars (even black holes!) and watch them interact and orbit in a realistic way. Design your own solar systems!<br/><br/>Using Planet Genesis you will be able to visualize in real time your own solar systems with photorealistic graphics, and enjoy watching them orbit, collide and fuse each other in a cosmic dance!<br/><br/>With Planet Genesis, the ultimate universe sandbox, you will:<br/><br/>-With its complete editor, create asteroids, dwarf planets, rocky planets, gas planets, four different kinds of stars and black holes. Furthermore, you will get tools to build complete proto-solar systems, asteroid fields, binary star systems and many more!<br/><br/>-Visualize your world with realistic 3D graphics. Actual solar system pictures and artist's pictures have been used to depict alien worlds.<br/><br/>-Simulate and explore our Solar System. <br/>+ Planets available: Mercury, Venus, Earth, Mars, Jupiter, Saturn, Uranus and Neptune<br/>+ Dwarf planets available: Ceres and Pluto<br/>+ Satellites available: Moon, Io, Europa, Ganymede, Callisto, Enceladus, Tethys, Titan, Dione, Rhea and Iapetus.<br/><br/>-Alter time rate for maximizing the experience.<br/><br/>-Visualize a 3D grid that depicts in real time the impact of the gravitational field on bodies in space.<br/><br/>-Configure the simulation settings to push your Android device to its limit .<br/><br/><br/>Please, watch the presentation video and leave a comment with your suggestions!", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-02T06:50:09", "background_image": "https://media.rawg.io/media/screenshots/15b/15b2167431dfc9085c5693704d5fecbb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 179, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Raptor Claw"], "genres": ["Simulation"], "publishers": [], "esrb_rating": "Everyone"}