{"id": 226743, "slug": "must-a-mine", "name": "Must-a-Mine", "name_original": "Must-a-Mine", "description": "Mine, my Mustachios! Mine! Keep tapping to find gold and treasures as you travel to the Earth’s core in this new idle clicker game.  <br/><br/>Try the popular idle clicker game with over 3 million plays on the web on your mobile device!<br/><br/>Tap as fast as you can to dig deep into the earth and mine your gold. Mine enough gold and you can sit back like the clicker tycoon you are and let your Mustachio workers dig for you! Upgrade to hire more and more workers with unique skills, then match the right equipment near the right workers for awesome combo bonuses!<br/><br/>Key Features:<br/>• Keep clicking to destroy a layer of the earth and receive diamonds or treasure chests filled with rare (and not-so-rare) artifacts<br/>• Collect and equip artifacts to boost your mining skills<br/>• Discover unique crafting combinations and enhancements to mine faster!<br/>• Complete achievements and earn diamonds<br/>• Upgrade your Mustachios to unlock new skills and make even more gold while you’re idle<br/>• Boost equipment by creating a power combo<br/>• Find the special Molerat and push your luck for a reward -- careful, you can’t return what he doles out<br/><br/>Become a fan on www.facebook.com/AddictingGames or visit us on Twitter @AddictingGames to receive exclusive news from the Addicting Games community!", "metacritic": null, "released": "2015-09-10", "tba": false, "updated": "2019-10-22T14:13:14", "background_image": "https://media.rawg.io/media/screenshots/a8f/a8ff6624e5d96fe60c1a907b4576bc23.jpg", "website": "http://www.addictinggames.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 174, "game_series_count": 0, "reviews_count": 1, "platforms": ["Android", "iOS"], "developers": ["Defy Media"], "genres": ["Arcade"], "publishers": ["Defy Media"], "esrb_rating": null}