{"id": 226714, "slug": "picasim-flight-simulator-2", "name": "PicaSim: Flight simulator", "name_original": "PicaSim: Flight simulator", "description": "PicaSim is a flight simulator for radio controlled aircraft. You can use it to learn how to fly, to practise aerobatics, or just to have fun flying around on a rainy day.<br/><br/>This is the full version - so if you've tried the free version (which contains most of what's here) and you enjoy it enough that you would like to support its past or future development (or just say thanks!), buy this to make a contribution. <br/><br/>If it helps, this includes some extras that aren't in the free version of the simulator:<br/><br/>- A variety of races - F3F-style and cross-country (the free version has just one race).<br/><br/>- Limbo (slope and powered) and thermal duration challenges.<br/><br/>- Planes: Two discus launched gliders (including the Ypsi Notos), GeeBee R2, Tigger (2.9m F3F slope racer), ASW15, \"The Plank\", magpie, and an electric version of the Neoslope. Also a quadcopter/drone and a very fast/aerobatic control-line plane, the Peacemaker.<br/><br/>- Terrains: Panoramic version of the \"Mountains Dynamic Soaring\" scene, plus a \"Snowy Hills\" scene (3D and panoramic) and two more panoramic scenes (flat field and slope).<br/><br/>Over time it will acquire additional planes/terrains.<br/><br/>There's now a forum for posting bugs, suggestions and general discussion at http://picasim.freeforums.org<br/><br/>The complete list of planes included is:<br/><br/>Gliders/sailplanes: ASW15, Banana, Canard, Discus, trainer, Neoslope, Genie, Icarus (DLG), Jart, Kato, Le Fish (standard &amp; ultralight), Magpie, Notos (DLG), Phase 6, Plank (wing), Tigger (F3F), Trapeze, Weasel.<br/><br/>Electric gliders: Neoslope, trainer<br/><br/>Powered R/C planes: AcroBat, Extra (3D, normal and large size), F18, GeeBee R2, RT Eraser Five, High-wing trainer, twin-propeller delta.<br/><br/>Control-line: Extra, Peacemaker.<br/><br/>Other: Wasp (quadcopter), Moyes XS 142 (hang glider).<br/><br/>If your device is Android 3 or above and supports USB OTG, you can probably use an external USB gamepad or joystick, or even your R/C Transmitter (via an interface), using a USB OTG cable/adapter (very cheap). Its definitely worth trying. Make sure you connect the controller before running PicaSim, and then set it up in the settings-&gt;joystick menu. Here's a video walking through the setup: http://youtu.be/HnM0YDfVArs<br/><br/>Permissions: PicaSim saves settings to the SD card, mainly because it supports using user-generated content. It needs the \"Phone calls\" permission for Marmalade - and to handle interruption by incoming calls properly. PicaSim does not access any personal data on the device.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-02T06:55:48", "background_image": "https://media.rawg.io/media/screenshots/340/340a63864e5efd16f7b3cb1940c8171a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 226, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["The Rowlhouse"], "genres": ["Simulation"], "publishers": [], "esrb_rating": "Everyone"}