{"id": 22686, "slug": "port-royale", "name": "Port Royale", "name_original": "Port Royale", "description": "<p>Explore the Caribbean sea and towns in the predecessor to the best open-ended buccaneer game of all time! In this one your goal is to become the Governor.<br />\nYou can choose between 4 different character nationalities from English, French, Dutch or Spanish. Along the way you decide your character&#39;s career path, and live an adventurer&#39;s life, where you will follow all assigned missions and tasks. You will be able to buy maps to hidden treasures, find secret pirate hovels, trade between all 60 available cities, build up your own business or become a pirate! And whatever you choose sooner or later you will participate in beautiful sea battles.<br />\nPort Royale places the player within real historic locations. You are given the option to choose between 4 different times in history – 1570, 1600, 1630 or 1660. Each of these timelines has direct influence over the game play. You will witness wars, disasters and much more in this rich and dangerous world. So be prepared for everything and ready your cutlass and pistol – the adventure awaits!Become a landowner, merchant, pirate or adventurer<br />\nCommand entire fleets and participate in both skirmishes and epic sea battles<br />\nLive the life of a freelancer or pledge yourself to one of the world powers fighting for dominance over the Caribbean Sea</p>", "metacritic": 79, "released": "2003-06-03", "tba": false, "updated": "2022-07-27T16:41:21", "background_image": "https://media.rawg.io/media/games/8d2/8d2470c702fe8c7d7ab06e02f755b823.jpg", "website": "", "rating": 4.12, "rating_top": 4, "added_by_status": {"yet": 11, "owned": 61, "beaten": 5, "toplay": 8, "dropped": 4}, "playtime": 1, "achievements_count": 0, "ratings_count": 8, "suggestions_count": 538, "game_series_count": 3, "reviews_count": 8, "platforms": ["PC"], "developers": ["ASCARON Entertainment"], "genres": ["Strategy"], "publishers": ["Kalypso Media"], "esrb_rating": "Everyone 10+"}