{"id": 226953, "slug": "masha-and-bear-cooking-dash", "name": "Masha and Bear: Cooking Dash", "name_original": "Masha and Bear: Cooking Dash", "description": "Here are “Masha and the Bear: Cooking Dash”! Masha welcomes children to try these games for kids and their cooking food abilities! 😋<br/><br/>The Bear, Rosie, Panda, the wolves, and other animals in the forest are hungry! 🍲🍴 <br/>Who will feed poor animals in this food making games? Masha and Bear of course! With the help of kids this restless little girl will be cooking food for every character from the popular cartoon “Masha and the Bear” in this food games! <br/>But each animal wants different ingredients. Find them all in this cooking dash and make the best oatmeal ever!<br/>Game for kids features: 🤗 <br/>- 16 characters in this children games free from Masha and the Bear games<br/>- cooking dash games with 33 ingredients to add into oatmeal<br/>- talking Masha in this cooking games for girls<br/>- the recipes become more difficult with levels in this cooking games for kids free<br/><br/>😋 Are you ready to make oatmeal with bananas in diner games? Or with ham? In this cooking dash games Masha and the Bear will teach toddlers how to make oatmeal with anything in this cafe games free! <br/>Every animal in the forest will come to Masha's cafe games and order a dish. In cooking games for girls this can happen twice a day!<br/>With every new visitor in your cafe kitchen the oatmeal recipes will become more interesting and complicated. Cook all orders in this cooking games free!<br/><br/>This Masha and the Bear cook games are suitable for kids from 2 to 8, it has the initial interface so that even toddlers can play without parents. <br/>If your kids love children games free about cooking dash or diner games, “Masha and the Bear: Cooking Dash” is the best choice for them! With Masha and Bear plus other animals kids will train their intelligence, logic and attention! And will learn how to cook dinner! 😋<br/><br/>Children games for boys and girls free are not always interesting and new. But Masha cooking chef will make this cooking dash a complete fun! This is the first food games with Masha and the Bear. If you are looking for cooking games for kids free where kids cook this is a good choice!<br/><br/>Give your kids games free that are not only funny but are also educational games for kids! Toddler games free do not always suit these parameters but this cook game for kids really do!<br/><br/>❗Contact us if you have any suggestions or troubles! E-mail: support@indigokidsgames.com", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:48:22", "background_image": "https://media.rawg.io/media/screenshots/8db/8db2f83964f160f7ca3aa83442a758dd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 159, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Indigo Kids"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}