{"id": 226942, "slug": "chronology-time-changes", "name": "Chronology - Time changes...", "name_original": "Chronology - Time changes...", "description": "Chronology is a puzzle platform adventure starring The Inventor and The Snail. Try \"Part I\" with 3 chapters for FREE.<br/><br/><br/> ◆ \"Best Casual Game of the Year\" &amp; \"Best Mobile Game of the Year\" @ Game Connection Paris 2014<br/> ◆ \"When Braid and LIMBO had a pretty baby\" (★★★★- bagogames.com)<br/><br/>In Chronology, you manipulate the past and the future, in order to fix the present. Play as the Old Inventor and his sidekick The Snail, and take advantage of their special abilities - travel back and forth in time, stop time, manipulate objects and solve puzzles.<br/><br/>◆ Time changes everything - Solve puzzles by travelling back and forth in - or freezing - time.<br/>◆ Characters with heart and soul - Switch between two lovable characters with different abilities and combine their strengths.<br/>◆ A mind-bending story line. As the story unfolds, learn how the main character has already played a central role in shaping the future of his world.<br/>◆ A magical, colorful, vibrant and living universe that mixes elements from different times and cultures.<br/>◆ Amazingly animated characters, machines and creatures, inspired by Hayao Miyazaki (Howls Moving Castle, My Neighbor Totoro).<br/>◆ Fully voice acted in English<br/><br/>Follow our social accounts to receive the latest news and updates regarding the magical adventure through time and space:<br/><br/>▶Facebook:  https://www.facebook.com/ChronologyGame <br/>▶Twitter: https://twitter.com/ChronologyGame", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:48:25", "background_image": "https://media.rawg.io/media/screenshots/165/16539c50fa2c37e51507218ab1aca4d6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 386, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Bedtime Digital Games"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}