{"id": 226910, "slug": "777-slots-free-casino", "name": "777 Slots – Free Casino", "name_original": "777 Slots – Free Casino", "description": "WIN BIG! Play the best free casino slots with DragonPlay’s 777 SLOTS! Original fruit machines inspired by Las Vegas casinos!<br/><br/>Enjoy electrifying free casino games with HUGE casino bonuses! If you love Las Vegas slots, install SLOTS 777 and feel the Vegas-style casino slots thrill, with an incredible selection of ORIGINAL free fruit machine games, video poker, mind-blowing mini games and the best casino bonuses!<br/><br/>Feeling lucky? Hit the jackpot and WIN playing free slots games online! Enjoy incredible high-quality graphics that will transport you to the glittering floors of the Las Vegas Casinos!!<br/><br/><br/>Collect MASSIVE casino bonuses and play exciting games on our stunning fruit machines brought to you directly from the Las Vegas casino floors!<br/><br/>Get lucky today with SLOTS 777’s superior free video slot machines!<br/><br/>SLOTS 777 combines original free casino games with amazing perks! <br/>•\tGet the free 250,000 coins Welcome Bonus<br/>•\tSpin the Wheel for free coins every 4 hours<br/>•\tPlay ORIGINAL high-quality free casino slot machine themes <br/>•\tWin 15,000-35,000 in daily bonuses<br/>•\tEarn coins Prizes with MINI GAMES<br/>•\tCollect free coins for inviting friends<br/>•\tJoin multiplayer free slots tournaments<br/>•\tFor Advanced Players: Play the slots themes you love - YOU CHOOSE the slot type!<br/><br/>SLOTS 777 offers a wide variety of free casino slot games, including five-reel slots with multi pay lines, progressive slots and more! <br/><br/>PLUS – Free Video poker games like never before!<br/><br/>Install SLOTS 777 – The excitement of EXCLUSIVE Vegas-style free casino slot games awaits!<br/><br/>The games are intended for an adult audience (Aged 21 or older) <br/>The games do not offer “real money gambling” or an opportunity to win real money or prizes. Practice or success at social casino gaming does not imply future success at “real money gambling.”", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:48:26", "background_image": "https://media.rawg.io/media/screenshots/594/59449a0d67b4338207c4adff2aecbcf1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 208, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Scientific Games Interactive"], "genres": [], "publishers": [], "esrb_rating": null}