{"id": 227067, "slug": "battle-beach", "name": "Battle Beach", "name_original": "Battle Beach", "description": "After \"The Event\" humanity lies in shambles. <br/>Lawless marauders terrorize the last remnants of civilization. <br/>The only remaining habitable areas are remote tropical islands. <br/><br/>It is up to you and those like you to fight back the forces of chaos and help restore law and order to the world. <br/><br/>Form a powerful alliance and start rebuilding civilization one island at a time! Build your base, rally your troops, and engage in combat with thousands of other players online! <br/><br/>Battle Beach is an exciting combination of city building, tower defense, and fast-paced real time combat with other live opponents. Raise an unstoppable army of snipers, tanks, and mighty Exo-Suits. Forge an alliance with other players and rise through the ranks. Fend off the Marauder hordes and restore order to a world lost in chaos. <br/><br/>-- FEATURES -- <br/><br/>* Upgrade your base into an impenetrable beacon of hope. <br/>* Battle other real players all over the world and take their Medals. <br/>* Forge a powerful alliance with other players and rise up the global ranks <br/>* Wage war against the Marauder Leader in an epic single player campaign. <br/>* 10 unique units with multiple upgrade levels <br/>* Defend your base with Machine Gun Nests, Sniper Towers, Mine Fields, and Walls. <br/><br/>NOTE: Network connection required to play.", "metacritic": null, "released": "2013-07-15", "tba": false, "updated": "2019-10-22T14:18:23", "background_image": "https://media.rawg.io/media/screenshots/94c/94c7de52a4f40d153c322f40081664ea.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 386, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Ember Entertainment"], "genres": ["Action", "Strategy", "Arcade"], "publishers": ["Ember Entertainment"], "esrb_rating": null}