{"id": 227078, "slug": "crazy-for-speed-2", "name": "Crazy for Speed 2", "name_original": "Crazy for Speed 2", "description": "Crazy for Speed 2,  ⚡️ delivers even more crazy racing excitement with all the  racing challenges. Meet all expectations of the racers for speed. 🏎️Race the traffic now! The most dangerous roads are waiting for you to conquer.<br/><br/>🏎️ADVENTUROUS TRACKS<br/>The most dangerous real road from all over the world: Mountain road of Alps, Coastal road of Venice, Desert road of Nevada, Muddy road of Amazon, Asphalt road of Monaco, City street of Tokyo, Snow-icing road of Himalaya, Night road of London, etc.<br/><br/>🏆TO BE THE TOP RACING CHAMPION<br/>Various supercars made by top manufacturers of the world. Select your sports car, paint on your favorite color, pack up all your Nitro, chase on the road with your opponents. Crash! Drift! Roll! Gallop! Overtake! Challenge the players from all over the world. Be the top racing driver. Crazy for Speed will give you an real racing experience.<br/><br/>🎨CUSTOMIZE YOUR CAR<br/>Customize cars as you would in real life! <br/>Personalize your car with painted appearance, labeling and custom license plates! Unique car belongs to you only.<br/>Remember upgrade your cool cars. You will take an invincible lead in the chase for the championship.<br/><br/> 💥Features:<br/>* Realistic 3D graphics, physics and sound effect<br/>* Plenty of off-road tracks with incredible levels<br/>* Driving license exam game mode and career mode<br/>* Continuous and fast cars update<br/>* Competing with racers for the top racing champion<br/><br/> 🔥Join in the speed racing, if you are crazy enough!", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-31T03:55:41", "background_image": "https://media.rawg.io/media/screenshots/276/2769cb30ae7d2c1ed89ae8e73f8db7f7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 210, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["MAGIC SEVEN"], "genres": ["Racing"], "publishers": [], "esrb_rating": "Everyone"}