{"id": 227190, "slug": "drag-one-line", "name": "Drag One Line", "name_original": "Drag One Line", "description": "While playing this drag one line game you train your brain to process various forms of strategies at lightning speeds. While you devise strategies to win the game, it also builds your neural connections. This block puzzle game is made to help keep your brain cognitively fit, flexible, and young. <br/><br/>It is time to train your brain  and solve the best block puzzle. Sharpen your mind with a connect-the-block-style one-line brain training puzzle game.<br/>fill in one line connect the blocks with one line - is easy and hard puzzle game simultaneously .<br/><br/><br/>He rules are simple: Just fill in all of the blocks using only one line.<br/>It's great for time filling and always keeps the brain working.  The puzzles in this one line game can be hard or easy, but each one takes careful planning. <br/><br/>Mathematical thinking is said to increase work efficiency and prevent aging.<br/>Whether math is your bane or your forte, be sure to give this game a try.<br/>You’re sure to get hooked on these puzzles!<br/>4 levels of difficulty. whopping 500+ puzzles.<br/>Don’t get too cozy the puzzles get harder as you go along<br/><br/>One line puzzles are mathematical problems with origins in the early 18th century. First posed in Königsberg, the original puzzle revolved around the town’s Pregel River.<br/><br/>You'll train your brain with each level passed because the puzzles get harder as you go along.  Are you up for the ultimate brain-training challenge?", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:47:55", "background_image": "https://media.rawg.io/media/screenshots/d7e/d7e26f05ac456ed24778687f3c7a8ff9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 51, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Best Heart"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}