{"id": 227125, "slug": "mini-golf-3d-city-stars-arcade-multiplayer-game", "name": "Mini Golf 3D City Stars Arcade - Multiplayer Game", "name_original": "Mini Golf 3D City Stars Arcade - Multiplayer Game", "description": "Multiplayer and offline Mini Golf Game in one! Win coins and diamonds to buy cool things!<br/>Challenge the whole world in Mini Golf 3D Worlds Stars Clash, with the brand new real-time multiplayer function! Multiplayer mini golf magic competition showing your own avatar and giving you time to practice before the real match begins. Unlock new achievements, chat with standard lines, play Micro Golf 3D Worlds Stars Arcade and compete against real players from all around the globe. The update also comes with a cloud save function, so you won’t lose any progress, and new coin packages you can buy to use in the golf game. It is time to relax, so stop the rush and play golf. Get ready to join the tournament and be the number 1 minigolf champion!<br/><br/>Experience the clash world of arcade mini golf rivals in Aztec El Dorado World. <br/>Mini Golf 3D Worlds Stars Arcade is a free mini golf paradise with incredible 3D effects that keeps you playing, as more content and functions are added each month. The game has 245 putt-putt courses, each designed with a unique series of challenges. Let the golf ball run in the right way and make the ultimate winner. Carefully choose the right angle with the arrows, use the button for strength, and find creative ways to putt your ball in the hole before you are out of shots. Master funny challenging obstacles and dynamic objects such as jumps, spinning bars, slopes, holes, and loops. Show your best mini golfing skills, in single putter player mode &amp; online real-time multiplayer mode.<br/><br/>FEATURES<br/>★ Cloud save function for Sports Video Games!<br/>★ Multiplayer golf clash championship<br/>★ Country flags at the start of the track <br/>★ Top View camera added in Game Play <br/>★ Simple chat function <br/>★ Rise up as a golf star!<br/>★ Single player arcade mode<br/>★ Never worry about rainy days or a lost ball<br/>★ Incredible 3D cartoon graphics and effects<br/>★ Explore 245 legendary and wicked minigolf courses<br/>★ Master different obstacles and interactive objects in each miniature golf course<br/>★ Monthly content updates, with new features, golf courses, and even more to achieve<br/>★ Easy, responsive finger controls for smartphone and tablet<br/>★ Use coins to unlock new courses and cool items in the store<br/>★ Realistic ball movements based on real physics<br/>★ Select your favorite sports golf ball, like the soccer football<br/>★ Make that wonderputt shot and become a golf hero<br/>★ Daily rewards!<br/>★ Crazy golf courses that can madden you<br/><br/>CONTACT<br/>LIke and subscribe to our Social Media to stay updated.<br/>Facebook: https://www.facebook.com/MobileSportsTime<br/>Twitter: https://twitter.com/MsportsT<br/>YouTube: https://goo.gl/x5ASDa<br/><br/>For help, questions and support, please e-mail us at: interactivegamesentertainment@gmail.com. <br/>Feel free to tell us what you like, and what needs improving!", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:48:03", "background_image": "https://media.rawg.io/media/screenshots/422/422cc39481ca11df0570d61bade39ca9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 263, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Mobile Sports Time"], "genres": ["Sports"], "publishers": [], "esrb_rating": null}