{"id": 227137, "slug": "zombie-siege", "name": "Zombie Siege", "name_original": "Zombie Siege", "description": "Year 2048, A zombie virus breaks out, the world descends into chaos. Humanity’s Last hope is in your hands.<br/>Protect the base, Resist Zombie invasions, and find the truth behind it all.<br/>But while you do, Keep an even sharper eye out for other greedy survivors.<br/>For our survival, we must resist……….<br/>In the apocalypse, If you’re not a butcher, You’re the Lamb. Write a legendary Story.<br/>Become the king of the Apocalypse and Protect the last civilization! <br/><br/>Game content<br/>\"Zombie Siege\" is a global online apocalypse survival RTS modern war game. The most thrilling tactical war-themed MMO game. <br/>City-Building Game – Fort Building Strategy, Emphasize on Teamwork<br/>Gather resources, build an army, and resist the zombie horde.<br/>Join an alliance and find allies. Enlarge your territory and fight other powerful contenders.<br/>Do you want to feel the thrill of victory over a live opponent?<br/>Download Zombie Siege now!  Lead humanity's new age!<br/><br/>★★★★★The revolutionary update is now available! ★★★★★<br/>•  New server open events are now available! Login today for time limited City Skin, Epic officers and other exclusive rewards for FREE! <br/>•  New Epic officers <br/>•  New Special Bounties<br/>•  New UI layout <br/>•  New Monthly card and Growth fund<br/>•  New Sound effects<br/><br/>Features<br/>[Whole World Online]<br/>Compete and socialize with survivors from all around the world, and view wars breaking out worldwide in real time. Battle worldwide rival players in online PvP. Raise your rank in the global multiplayer leaderboards.<br/><br/>[Summon Epic Officers]<br/>More than 60+ officers are waiting for your order. Officers possess unique active and passive skills to supercharge your army. Level up your officer and Compete worldwide.<br/><br/>[Mech Fighters]<br/>Mechs are a powerful solo-fighting unit that survivors can own, capable of dealing huge damage to enemies all by themselves. Customize your own Mech and defend your city! <br/><br/>[Your City]<br/>Create your very own city and build a powerful army to protect it. Develop different technologies and increase your fighting effectiveness.<br/><br/>[Shooter Elements]<br/>One-of-a-kind FPS elements bring you the thrill of slaughtering zombies firsthand. Select your favorite weapon and start your journey now!<br/><br/>[Team Battles]<br/>This unique style of play lets you assemble your allies and strategically deploy them in battle. Unleash your command skills.  Attack zombies in real time on the world map and chat with alliance members worldwide! Battle with zombie troops and other survivors to expand your empire.<br/><br/>[Apocalypse Survival]<br/>In these end times, you can stay neutral, or you can play the part of a looter, gathering resources through battle and constantly growing your territory. More horrible than zombies, Is the humankind<br/><br/>[All-new Soldiers]<br/>Newly-added zombie soldiers allow you to resurrect soldiers that you lose in battle and enhance your power. You now have the power to control mutant zombies, assemble your zombie army to rule the world.  <br/><br/>Humanity’s last hope is in your hands, Protect the Last civilization and be ready for Zombie wars. Are your ready for the challenge? Download the game now!<br/><br/>PLEASE NOTE! Zombie Siege is free to download and play, however, some game items can also be purchased for real money. If you do not want to use this feature, please set up password protection for purchases in the settings of your Google Play Store app. Also, under our Terms of Service and Privacy Policy, you must be at least 13 years of age to play or download Zombie Siege.<br/><br/>Have any questions or issues with the game from Elex Tech? <br/>Reach us at zombiesiege.help@gmail.com<br/>https://www.facebook.com/ZombieSiege2017/", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:48:00", "background_image": "https://media.rawg.io/media/screenshots/106/106b4eeb11022bbc4e7c748b2fd2c16a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 435, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Elex"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}