{"id": 22719, "slug": "fa-18e-super-hornet", "name": "F/A-18E Super Hornet", "name_original": "F/A-18E Super Hornet", "description": "<h3>Includes The Albanian Campaign</h3><br/>Your orders have arrived and your mission is clear: utilize the F/A-18E Super Hornet’s full air-to-air and air-to-ground attack capabilities to seek out and destroy enemy targets on an unlimited number of flight sorties. Grab the flight stick and take control of your 3-D aircraft with unbelievably accurate weapon systems, 20 detailed training missions, 40 combat missions in two war-zones in changing weather conditions. <br/><br/>From the makers of the award winning Apache Longbow comes the U.S. Navy's newest multi-role strike fighter. The Navy's best pilots have proven this sleek and efficient machine's worth over real battlefields. Now it's your turn... Indulge yourself and test your skills inside the Super Hornet's fully interactive cockpit. Key guide and complete pilot notes included!<br/><br/><ul><li>A complex and realistic flight model<br/></li><li>A wide variety of missions, from air superiority to Wild Weasel<br/></li><li>A vast world and challenging AI opponents</li></ul><h3>The Albanian Campaign Mission Pack</h3><strong>FLY THE BALKAN CONFLICT FOR REAL!</strong><br/><br/>Serbian Forces have invaded the state of Montenegro, it's one-time ally in the Federal Republic of Yugoslavia. Serbia's invading armies have imposed a state of martial law throughout the country and peace in this once safe haven for Kosovo Albanian refugees is shattered.<br/><br/>Stationed on the USS Ronald Reagan aircraft carrier in the Adriatic, you represent the spearhead of NATO's armed response. Fly the Balkan conflict for real across over 20 true-life war situations in a whole new warzone, or fly head-to-head in network play for up to 24 users.<br/><br/><strong>Hunt down targets. Distinguish enemies from civilians. Use your weapons surgically.</strong>", "metacritic": null, "released": "2000-02-28", "tba": false, "updated": "2023-11-03T21:29:42", "background_image": "https://media.rawg.io/media/screenshots/d7b/d7b88736caa571f54ab913eb5f2a514c_f6gEErr.jpg", "website": "https://www.interplay.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 5, "owned": 33, "toplay": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 349, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Digital Integration", "Digital Theory", "Digital Intergration"], "genres": ["Action", "Simulation"], "publishers": ["Interplay Productions"], "esrb_rating": "Teen"}