{"id": 22728, "slug": "jagged-alliance-deadly-games", "name": "Jagged Alliance: Deadly Games", "name_original": "Jagged Alliance: Deadly Games", "description": "<p>The enemy is on the run. One more mortar shell should take them out. Still, you have to blow up the bridge by sundown, and Postie is starting to talk to himself again. Maybe you shouldn&#39;t let him keep that dynamite...<br />\nLock and load: it&#39;s time for Deadly Games. From the makers of Jagged Alliance, 1995&#39;s Game of the Year (Power Play magazine) comes the multiplayer strategy game chambered with new features.<br />\nMore ways to play. Play the new solo campaign or choose multiplayer mode via your network connection.<br />\nMore power. The included scenario editor provides infinite replay ability. Create your own maps, traps and enemies. Use the campaign editor to create your own deadly games.<br />\nMore mercenaries. Choose from 70 different mercs, including 10 new ones - plus all 60 of the original Jagged Alliance mercs.<br />\nMore weapons. Fun new war toys include mortars, grenade launchers, boobytrap kits and more!<br />\nMore terrain. Skirmish through jungles, deserts, towns and frozen wastelands.<br />\nAnd more attitude than ever!A highly requested multiplayer mode for the icon of turn-based tactical games<br />\nAn abundance of authentic weapons and equipment<br />\nDozens of extremely challenging missions that will put your tactical acumen to the test</p>", "metacritic": null, "released": "1996-01-03", "tba": false, "updated": "2023-08-28T11:23:19", "background_image": "https://media.rawg.io/media/screenshots/189/18953e3b95307fc84611d35197c7a3cc.jpg", "website": "", "rating": 3.87, "rating_top": 5, "added_by_status": {"yet": 22, "owned": 189, "beaten": 7, "toplay": 4, "dropped": 8}, "playtime": 1, "achievements_count": 0, "ratings_count": 15, "suggestions_count": 453, "game_series_count": 14, "reviews_count": 15, "platforms": ["PC"], "developers": ["Sir-Tech", "Sir-Tech Canada", "Sir-Tech Software"], "genres": ["RPG", "Strategy"], "publishers": ["Strategy First", "Virgin Interactive", "Sir-Tech", "Sir-Tech Software"], "esrb_rating": "Teen"}