{"id": 22734, "slug": "beneath-a-steel-sky", "name": "Beneath a Steel Sky", "name_original": "Beneath a Steel Sky", "description": "After being brutally abducted from his village in the wasteland, his village obliterated, and his kinfolk butchered, Robert Foster escapes a helicopter crash and finds himself alone save for the circuit board of his best friend, Joey, the AI he built as a child. Foster soon resurrects Joey and together they find themselves in Union City, where oppressed citizens live and work in soaring tower blocks, under the strict control of a brutal, fascist, AI dictatorship – whilst the corrupt, covetous and rich live below, shielded from the choking pollution.<br/>\n<br/>\r\nIn the melting pot of Union City, a not so impossible future, mankind’s worse nightmares are waiting to emerge from beneath the steel sky. It's Man against Man. Man against Machine. Man against Time.<br/>\n<br/>\r\nStrangers in a strange land, Foster and Joey must survive long enough to discover the sinister truth behind his abduction - why they specifically came for him - and defeat the evil before it’s too late. It’s a terrifying threat that only you can liberate… Maybe.<br/>\n<br/>\r\nFeaturing Revolution's Software innovative Virtual Theatre system, Beneath a Steel Sky is a gripping cyberpunk science fiction point and click adventure game. Art directed by award-winning comic book artist Dave Gibbons (Watchmen), Beneath a Steel Sky is widely considered as one of the best point and click adventures ever written.", "metacritic": null, "released": "1994-04-10", "tba": false, "updated": "2023-12-25T10:32:33", "background_image": "https://media.rawg.io/media/screenshots/f6b/f6b3338889ec877c9d3d89fc4f665152.jpg", "website": "https://revolution.co.uk/", "rating": 2.74, "rating_top": 1, "added_by_status": {"yet": 288, "owned": 2185, "beaten": 57, "toplay": 26, "dropped": 54, "playing": 8}, "playtime": 1, "achievements_count": 0, "ratings_count": 222, "suggestions_count": 535, "game_series_count": 1, "reviews_count": 225, "platforms": ["Commodore / Amiga", "iOS", "Classic Macintosh", "PC", "Linux", "macOS"], "developers": ["Revolution Software"], "genres": ["Adventure", "Indie"], "publishers": ["Virgin Interactive", "Revolution Software", "Virgin Interactive Entertainment"], "esrb_rating": "Teen"}