{"id": 227404, "slug": "forgecraft-idle-tycoon-crafting-business-game", "name": "ForgeCraft - Idle Tycoon. Crafting Business Game.", "name_original": "ForgeCraft - Idle Tycoon. Crafting Business Game.", "description": "Craft weapons and armors, make money and become a rich blacksmith!. Download ForgeCraft – Idle Tycoon, a blocky pixel graphics idle clicker game for free and make a fortune. <br/><br/>Do you like tap tap or clicker games? Are you looking for a top notch forging clicker game to be rich? <br/><br/>Welcome to ForgeCraft – Idle Tycoon, a pixel based graphics that offers you tons of fun at the spot. You will be playing an idle blacksmith, crafting and building weapons. <br/>In this crafting and building business tycoon you can be the greatest blacksmith and help your country to survive! Being blocky blacksmith it is your duty to make weapons and armors to save the country. Do it by crafting / building / forging, you can craft block 3D weapons and armors like dagger, sword, buckler, pavise, etc. Sell these weapons, become a billionaire and a clicker hero. <br/><br/>Start your business and make money! Once you start, you will be addicted soon! This is the best time waster!<br/>Hire assistants and multicraft weapons, multicraft armors, do it all at once, unlimited opportunities. Buy recipes for new weapons and explore them all. Play different missions, get achievements, expand the business and play minigames. ForgeCraft – Idle Tycoon is just a perfect blacksmith forge simulator. <br/>Get idle cash, even when you are offline. When you return, profits will be settled for you. Incremental game system applied! Enjoy the fun of the idle game!<br/><br/>► Simple but eye catchy 3d pixel based graphics <br/>► Missions, achievements and minigames available<br/>► Tap tap idling mechanics <br/>► The business still goes on even when you exit the game!<br/>► Prestige feature <br/>► Hire assistants - multicraft<br/>► Become the greatest forge business tycoon ever! <br/>► Blacksmith business simulator!<br/>► Free building and crafting game.<br/><br/>ForgeCraft – Idle Tycoon is must have idling game on your device especially when you got some time to kill. <br/><br/>Download and install this forging idle clicker game right now. Become the best business tycoon.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:47:36", "background_image": "https://media.rawg.io/media/screenshots/cbb/cbb91133c4145b9262b79268baf6639a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 172, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["RSGapps - Idle Tycoon Games"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}