{"id": 227568, "slug": "the-world-ii-hunting-boss", "name": "The World II Hunting BOSS", "name_original": "The World II Hunting BOSS", "description": "For all action game players,This game doesn't contain any kinds of micro transactions<br/>★☆☆☆☆ The Best Independent Game in Japan TGS, 2014<br/>★★☆☆☆ \"Best game of 2014\" selected by Google Play<br/>★★★☆☆ Recommend twice by Google Play Feature in Hong Kong, Macao and Taiwan <br/>★★★★☆ Recommend in App Store Feature by 14 countries of Asia-Pacific<br/>★★★★★ The most anticipated 3D Role-play Online Game <br/><br/>This is a game for you to face off gigantic monsters while progressing through the story to become the epic hero of the world.<br/><br/>Description:<br/> Pay to win a game doesn't always sound exiciting and meaningful, now here is a game that is all about slaying giant monsters, earn bounties, and perform some stylish moves. It is all up to you and your team to decide what to do next! <br/><br/>At the beginning you may have only 1 hero to choose from with limited resources. As you explore around the biggest city of Teros, you can develop the team by having heroes strike against the biggest monsters of the land, earn yourself some fames and money from doing good deeds to the land, or just fill up your wallet from some casual works. The more you build up, the more heroes will lend their strength to you, increasing the strength of your team to help your heroes for the upcoming epic battles. <br/>Players have the chance to fight against the most dreadful, fiercest, and gigantic bosses from the moment they enter the game, surrounded by  a destructible 3D environment. Fighting mobs is not always an interesting experience and can be sometimes annoying, players can face off threatening monsters right away!<br/>Can you feel the breath of the enemies? Do you meet up the expectations? Can you become the greatest hero?<br/>Play to find out!<br/><br/>recommended system specifications:<br/>Android 4.0<br/>RAM 1G<br/>CPU 1GHZ<br/><br/>Cooperation please contact<br/>E-mail: georgina@good321.net<br/>Https://www.facebook.com/TheWorldOnline2", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:47:12", "background_image": "https://media.rawg.io/media/screenshots/a07/a07897d078e8812b748961a5f39c1169.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 415, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Good Game & OXON game studio"], "genres": ["Action"], "publishers": [], "esrb_rating": null}