{"id": 227660, "slug": "chess-with-friends-free", "name": "Chess With Friends Free", "name_original": "Chess With Friends Free", "description": "Take no prisoners and protect your King at all costs! Brought to you by the makers of Words with Friends, Chess with Friends Free is the best way to play the classic Chess board game on Android.<br/><br/>Connect with friends and challenge them to one of the oldest, most popular strategy games in the world. Play multiple games at the same time, track your moves and improve your stats.<br/><br/>Download Chess with Friends Free and start playing the most social chess game today!<br/><br/>Features:<br/>★ CONNECT with Facebook to play family and friends, or find and challenge a random opponent<br/>★ TRACK your record, skill rating, and head-to-head stats to improve your game play\u2028 <br/>★ SIZE UP your opponent by viewing their matches and stats on their profile<br/>★ PRACTICE MODE - Choose your skill level, train your brain, and learn new tactics by challenging Chesster the Chess coach. Play him online or offline to sharpen your skills<br/>★ RELIVE the glory by replaying moves on the board in existing and past games<br/>★ ENCOURAGE, boast or taunt your opponent with in-game chat<br/>★ PLAY multiple chess games at once across Android and iOS<br/><br/>Player Reviews:<br/>★“Great app for playing with friends or anybody else that loves the game”<br/>★“I love this game!!! It’s as simple as that. A must have for the chess player in all of us” <br/>★“Great game that challenges your mind, and helps you learn new skills while playing with friends” <br/>★“My favourite app. The first app I check each morning. The only game I play every day. I’ve got a dozen opponents across the globe. My favourite app by far.<br/>__________________________________<br/><br/>Already a fan of the game?<br/>★ Join the community on Facebook to discuss the game, give feedback and find more friends to play https://www.facebook.com/ChessWithFriends<br/>★ Follow us on Twitter http://twitter.com/ChessWFriends for all of the latest news<br/>★ Follow us on Instagram http://instagram.com/chesswithfriends for daily challenges and inspiring quotes<br/>__________________________________<br/><br/>ADDITIONAL DISCLOSURES<br/><br/>● Use of this application is governed by the Zynga Terms of Service. These Terms are available at http://m.zynga.com/legal/terms-of-service.<br/>● For specific information about how Zynga collects and uses personal or other data, please read our privacy policy at http://m.zynga.com/privacy/policy. Zynga’s Privacy Policy is also available through the Privacy Policy field in the Developer section below.<br/>● The game is free to play, however in-app purchases are available for additional content and premium currency. In-app purchases range from $0.99 to $99.99.<br/>● This game does permit a user to connect to social networks, such as Facebook, and as such players may come into contact with other people when playing this game.<br/>● Terms of Service for Social Networks you connect to in this game may also apply to you.<br/>● You will be given the opportunity to participate in special offers, events, and programs from Zynga Inc. and its partners. <br/>● Must be 13+ to play.<br/>● Use of this application requires a Facebook or Zynga With Friends account", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-31T00:06:21", "background_image": "https://media.rawg.io/media/screenshots/a37/a37f01f2c81d324145c86db10d7b6dd6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 150, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Zynga"], "genres": ["Board Games"], "publishers": [], "esrb_rating": "Everyone"}