{"id": 227675, "slug": "dark-parables-queen-of-sands-full", "name": "Dark Parables: Queen of Sands (Full)", "name_original": "Dark Parables: Queen of Sands (Full)", "description": "Unlock the complete adventure with a single purchase! No in-app purchases!<br/><br/>A strange purple mist has appeared in the provincial city of Montafleur, turning dreams into nightmares and terrorizing the innocent townsfolk. You and your keen detective skills have been called in to stop the evil Queen of Sands and her beastly companions. Can you bring harmony back to this once peaceful land of fables, or will this fairy tale not have a happily ever after?<br/><br/>• AID THE RED RIDING HOOD SISTERS IN THEIR HUNT FOR JUSTICE<br/>Who is behind the ferocious beast lurking at the outskirts of town? Does this have anything to do with the secret nature of the town’s world-famous perfumes?<br/><br/>• TRAVEL THE LAVISH FRENCH COUNTRYSIDE<br/>Take in the sights and sounds and track your enemies through lush hidden object scenes.<br/> <br/>• CAN YOU COLLECT ALL OF THE DARK PARABLES?<br/>Unlock other bizarre stories through extraordinary puzzles and fabulous mini-games.<br/><br/>• EXPLORE THE PARABLE OF THE SEVEN RAVENS IN THE BONUS CHAPTER<br/>Challenge yourself to a tale of fantasy and enjoy additional Collector’s Edition exclusives including collectible items &amp; special achievements!<br/><br/>• Find thousands of hidden objects, plus solve tons of mini games and puzzles!<br/>• Unlock this incredible Collector's Edition to gain access to all of the amazing bonuses and additional gameplay!<br/><br/>*** Discover more from Big Fish Games*** <br/><br/>Sign up for our newsletter and never miss a new release or promotion again: http://bigfi.sh/AndroidSplash<br/><br/>Check out our entire game library with our Big Fish Games app absolutely FREE here: http://bigfi.sh/BFGAMGoog<br/><br/>Visit Big Fish Games, a leading developer, producer, and publisher of puzzle, adventure, casual, card &amp; casino games!<br/><br/>VISIT US: www.bigfishgames.com<br/>WATCH US: www.youtube.com/bigfishgames<br/>FOLLOW US: www.twitter.com/bigfishgames<br/>TALK TO US: www.facebook.com/bigfishgames", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-31T03:13:48", "background_image": "https://media.rawg.io/media/screenshots/aea/aeab163080e3375dac1eb5aa668da004.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 302, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Big Fish Games"], "genres": ["Adventure"], "publishers": [], "esrb_rating": "Everyone 10+"}