{"id": 227671, "slug": "backgammon-plus-2", "name": "Backgammon Plus", "name_original": "Backgammon Plus", "description": "Backgammon Plus is played and liked by hundreds of thousands of players on Facebook.<br/>Download Backgammon Plus for free, and play with your friends.<br/><br/>Double the stakes and make new friends.<br/>Join your friends’ tables and play instantly.<br/>Chat with other players while you play.<br/>Win thousands of free Chips every day!<br/><br/>QUICK PLAY<br/>Start playing right away with a single touch. No need to look for empty tables!<br/><br/>PLAY AGAINST YOUR FRIENDS<br/>Join tables with your Facebook friends with a single touch.<br/><br/>SELECT YOUR ROOM<br/>You can select from a wide range of rooms to play with different players and higher stakes.<br/><br/>CREATE ROOMS<br/>Do you want to create your own room? Create a room catering to your play style and start playing right away.<br/><br/>DOUBLE THE STAKES<br/>Double the stakes anytime you wish to win more.<br/><br/>Backgammon is one of the oldest board games, played worldwide with<br/>many variants. Backgammon Plus is designed for fans of games such as<br/>backgammon, tavle, tawla, tavli, gammon, nackgammon, shesh besh, mahbusa, narde,<br/>tapa, acey-deucey, gul bara, portes, plakoto and fevga.<br/><br/><br/>Additional information:<br/><br/>• The game is free to play; however, in-app purchases are available for additional content and in-game currency. In-app purchases range from $0.99 to $99.99 USD.<br/><br/>•  Use of this application is governed by Zynga’s Terms of Service, found at www.zynga.com/legal/terms-of-service.<br/>", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-31T02:42:06", "background_image": "https://media.rawg.io/media/screenshots/108/108c605afe29dc53457245573e30c0a8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 133, "game_series_count": 0, "reviews_count": 1, "platforms": ["Android"], "developers": ["Zynga"], "genres": ["Board Games"], "publishers": [], "esrb_rating": "Teen"}