{"id": 227631, "slug": "mystery-castle-hidden-objects-seek-and-find-game", "name": "Mystery Castle Hidden Objects - Seek and Find Game", "name_original": "Mystery Castle Hidden Objects - Seek and Find Game", "description": "Reveal the magic castle secrets and become a hero of the lost kingdom! Play Mystery Castle Hidden Objects - Seek and Find Game, and enter a magical fairy tale world with enchanted castles, haunted houses, secret gardens and other magical places. This is one of the best adventure games where you have a task to find hidden objects in pictures and escape the midnight castle full of ghosts, vampires and other scary monsters. This is one of the best Halloween stories you are going to love. So get ready and prepare for the most amazing mystery adventure for finding hidden objects of your life!<br/><br/>🏰 Mystery Castle Hidden Objects - Seek and Find Game features: 🏰 <br/> <br/>🔍 Adventure mystery game free localized into 15 languages! <br/>🔍 More than 1000 hidden objects to find in this wonder world! <br/>🔍 Multiple levels with mystery places full of magic hidden objects! <br/>🔍 Fantastic 3D game design that will leave you speechless! <br/>🔍 Find the hidden object from the card below &amp; click on it! <br/>🔍 Click on the magnifying glass button to use the hint for help! <br/>🔍 For mobile phones only! - Zoom in the picture to find the objects! <br/>🔍 Move the picture when it is zoomed to find the hidden object! <br/>🔍 Zoom out at any moment you like to see the mystery scene again! <br/> <br/> <br/>🏰 ADDITIONAL MYSTERY HIDDEN OBJECT GAME FEATURES: 🏰 <br/> <br/>🔍 Picture search for finding hidden objects quickly and easily! <br/>🔍 Silhouette hidden object – a challenging level for finding items! <br/>🔍 Word scramble game level – a hard level to find hidden figures! <br/>🔍 Flash light or a night mode level – use the light to seek for items! <br/>🔍 Match Pairs – a memory game with colorful cards to pair! <br/>🔍 Find the Difference – a mini game placed among the hidden objects! <br/>🔍 Time limit game - bonus level to train your brain and concentration! <br/>🔍 Tile puzzle game – put the puzzle pieces together to make a picture!<br/><br/><br/>Can you escape mystery castle? Find the hidden objects from the messy rooms, around the iron throne and run from this cursed place. Enchanted castle hidden object adventure game for adults will certainly impress you. You need to discover the darkest secrets of the mystery society that lived here. So enter this ancient castle, search each room for clues, pick hidden figures and enjoy. Pick as fast as you can all the items written on the list, pass all the levels and escape from the magic castle. In that way you will go through all the enchanted castle rooms of memory, messy kitchens and find the hidden figures everywhere. If you love treasure hunt games and mystery temple games, Mystery Castle Hidden Objects - Seek and Find Game will certainly be one of your favorite hidden treasure games you have ever played.<br/><br/><br/>🏰 Enchanted castle hidden object mystery game for adults and all ages!<br/><br/>If you want to be a great explorer, this is the best job for you! Mystery Castle Hidden Objects - Seek and Find Game brings you joy and fun through all the levels. There are also many of the mini games inside this search and find hidden object game app that will kill your boredom and help you exercise your concentration and train your brain. This horror story will lead you through the medieval castle, full of strange items scattered everywhere. Object searching game is the best pastime activity for you, don't wait any longer start the hidden objects quest free games with amazing graphics and gameplay.<br/><br/>🏰 Get lost in castle of mystery and search for hidden objects!<br/><br/>Be a castle hero! Clean up the enchanted manor! This mystery castle with the iron throne of the lost city in the kingdom really needs a little bit of house cleaning. When you enter the messy kitchen you will see so much old and broken stuff but you need to find the right hidden items that will help you find the truth about this haunted castle from the medieval period. Download Mystery Castle Hidden Objects - Seek and Find Game for adults and become a knight who will conquer the throne and pick up all the hidden treasure. Have fun!", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:46:56", "background_image": "https://media.rawg.io/media/screenshots/912/9128c26618ea9115ee031279feb26c5a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 296, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Webelinx Hidden Object Games"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}