{"id": 227678, "slug": "hidden-objects-crime-scene-clean-up-game", "name": "Hidden Objects Crime Scene Clean Up Game", "name_original": "Hidden Objects Crime Scene Clean Up Game", "description": "Become a member of mafia mystery adventure! Be a gangster - listen to your mafia boss, obey the rules, do the tasks properly and you will succeed very soon. Let's start the mission – play Hidden Objects Crime Scene Clean Up Game! Follow the instructions and make this criminal case difficult for the police investigation. Crime scene cleanup game is the best seek and find game that will lead you through the unforgettable mystery hidden object adventure. Remove all the lost evidence and save your mafia family!<br/><br/>Hidden Objects Crime Scene Clean Up Game features:<br/><br/>🔍 Mystery hidden object mafia game free localized into 15 languages!<br/>🔍 1000 + hidden objects to find and seek in the city of crime scene!<br/>🔍 Crime scene cleanup game with levels full of mystery hidden objects!<br/>🔍 Fantastic 3D game design for girls and boys, old and young!<br/>🔍 Find the hidden object from the menu below &amp; click on it!<br/>🔍 Click on the magnifying glass button to use the hint for help!<br/>🔍 Zoom in the pic to find the lost evidence hidden objects easily!<br/>🔍 Move the picture when it is zoomed to find hidden figures!<br/>🔍 Zoom out at any moment you like to see the crime scene again!<br/><br/><br/>🔍 ADDITIONAL MYSTERY HIDDEN OBJECT ADVENTURE GAMES FEATURES!!! 🔍<br/><br/>🔍 Picture search - find grand city mafia hidden objects easily!<br/>🔍 Silhouette of the hidden objects – a challenging level for finding evidence!<br/>🔍 Word scramble game level – a hard level to find hidden figures!<br/>🔍 Flash light or a night mode level – use the light to seek for items in the dark!<br/>🔍 Card matching game – a memory game with colorful cards to pair!<br/>🔍 Find the Difference – a mini game placed among the hidden objects!<br/>🔍 Time limit game - Bonus level to train your brain and concentration!<br/><br/>The best bank robbery hidden objects game free download!<br/><br/>Find the lost evidence before the police arrive! There are many bank robbery mistakes your fellow robbers have made at the crime scene, all around the bank. The heist went wrong because one of the burglars activated the alarm. They panicked! Some of them didn't put the gloves on and their fingerprints are everywhere on the hidden objects. The safecracker forgot to pick up his tools and many other items. The criminal escape was inevitable, bank robbers were not smart enough, so play Hidden Objects Crime Scene Clean Up Game and remove the lost evidence, all the hidden figures before the police officers and forensics come to solve the crime case.<br/><br/>The best mystery hidden object adventure games for adults!<br/><br/>Free hidden object mystery games are finally here for all the people who love crime stories and search and find games. Don't let the police solve the mystery case! This is not just a house cleaning game, or a kitchen clean up game with amazing graphic, this is a fantastic Hidden Objects Crime Scene Clean Up Game free download where you have a mission to find all the missing evidence as soon as possible. Many shops and galleries are robbed, go to the supermarket and clean up the mess there, then go quickly to the pawn shop and jewelry store to find hidden objects and get the reward for a well-done job.<br/><br/>Crime scene investigation is on a good way to find the suspects! Hurry up and find the lost evidence! <br/><br/>Grand city mafia is very powerful, more than Cosa Nostra or Yakuza. So, don't let it be destroyed by the police or by other smaller gangs. Play &gt; Hidden Objects Crime Scene Clean Up Game &lt; and fight in this mobster war until the end of your life. This adventure story is not funny at all, you have to concentrate a lot to seek and find hidden object in all the crime scenes – banks, museums, jewelry shops or pawn shops. If you don't find all the hidden figures and missing evidence with the fingerprints of the robbers, you will have a problem with the mafia boss. Grand city mafia is powerful enough, so don't hide, they will find you anyway if you don't do your job. So get ready, play one of the most popular finding things games and start the greatest adventure ever!", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:46:41", "background_image": "https://media.rawg.io/media/screenshots/b72/b720ce3fff9d7c8100e71ad50f24aaa2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 200, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Webelinx Hidden Object Games"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}