{"id": 227784, "slug": "code-adventures-coding-puzzles-for-kids", "name": "Code Adventures: Coding Puzzles For Kids", "name_original": "Code Adventures: Coding Puzzles For Kids", "description": "Embark on a magical adventure of coding, learning and fun! Sharpen your logic and elevate your problem solving skills with this brain-challenging game adored by kids and parents alike! Aesthetically rich and carefully designed child-friendly puzzles structured in 5 basic programming categories guarantee hours of mind-teasing entertainment.<br/><br/>________________________________<br/><br/>• Rated 'Best of the Best' by Best Apps For Kids<br/>• Certified by Educational App Store<br/><br/>________________________________<br/><br/><br/>Parents all around the world use Code Adventures to inspire their kids and spark in them a long-lasting interest in coding and science. Created with the help and input of educators and tested in schools, this game succeeds in teaching not only the basics of programming but also boosts logical thinking, problem solving, patience, persistence and self-confidence.<br/><br/>THE GAME<br/><br/>Take the exciting first steps in coding and delve into the world of Aurora - an utterly lovable fuzzball that needs your help to get back home. Train your brain and solve tricky spatial puzzles using only programming commands. Guide Aurora through fascinating colorful levels each of them presenting an even greater logical challenge. Different puzzle elements like flying platforms, movable bridges, ladders and portals are gradually introduced making programming even more fun. The game's beautiful graphics, sounds and humorous messages keep kids focused on the learning process. <br/><br/>Main features:<br/>• Solve challenging puzzles while learning how to program<br/>• Non-violent educational game suitable for kids, parents and teachers<br/>• Fascinating visuals, humorous sounds and lovable characters<br/>• Child-friendly environment with no in-app purchases and no ads<br/>• 32 well-crafted levels and more to come<br/><br/>WHO CAN PLAY<br/><br/>Code Adventures is designed for everyone to enjoy - from kids to teens to adults. Even players with no interests in programming can benefit greatly by improving crucial skills.<br/><br/>• Suitable for children aged 6+<br/>• Suitable for adults with interests in programming or brain-challenging puzzles<br/>• Great opportunity for parents to bond with their kids and spark in them interests in STEM related subjects<br/><br/>HIGH EDUCATIONAL VALUE<br/><br/>Children have astounding capacity and infinite curiosity for learning new things. More often than not they are even better than adults at grasping complex concepts like algorithms and procedures. Getting familiar with software technology becomes more important each day in preparing your kid for the jobs of tomorrow.<br/>Code Adventures teaches the basics of every modern programming language in an amusing, positive and lovable environment.<br/><br/>You will learn basic principles such as:<br/>• Order of operations<br/>• Functions<br/>• Lists<br/>• Goto and Wait statements<br/>• Loops<br/>• Conditionals<br/><br/>Students using Code Adventures also develop valuable everyday skills. The game helps in the following ways:<br/>• Improves logical thinking and problem solving<br/>• Provides great mental training for the whole family<br/>• Boosts self-confidence, rewards patience and persistence<br/>• Develops cognitive and spatial skills<br/>• Teaches \"out of the box\" thinking<br/>• Fosters communication and curiosity<br/><br/>A perfect brain teaser and an amazing educational gift for your kid, Code Adventures is a must-have.<br/>Immerse yourself into the colorful world of Aurora and see for yourself how easy it is to learn how to code!", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:46:27", "background_image": "https://media.rawg.io/media/screenshots/774/7741001078b9d02e56980ffff2b9751e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 83, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Cyborc Games"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}