{"id": 227885, "slug": "farm-day-village-farming-offline-games", "name": "Farm Day Village Farming: Offline Games", "name_original": "Farm Day Village Farming: Offline Games", "description": "After inheriting a farm from your parents, you must complete farming tasks to restore the legacy to become the most famous farmer in this free farming game. Being social will help you manage your farm and grow it. A fresh new world to care of your lush green farm and animals with farm games. Build your dream farm in this best middle ages offline farming game. Manage your farm, harvest crops, sell goods to build your lands and enjoy the most popular offline farm games. Prepare your farm while you gather resources and cultivate before you harvest the crops like corn, wheat, cotton, canola and hay. This is the variety you will get to grow to become a happy farmer. <br/><br/><br/>Lead the faming business world near the township in this popular farming game. Happy farming day farmers! Time to explore mines to find resources and artifacts. Tend to your crops, trade products and sell your produce via a delivery train. Horses, cats, dogs, cow and hens are not easy to manage on a big farm. Decorate your farmland in this free offline farm game. Offline farming is going to be epic for your lush green family farm. You have lovely animals to take care of in this farming game that simulates jobs of a farmer who is busy in managing a big farm. <br/><br/><br/>Something unique for the lovers of farming games, a whole new offline games experience to build, cultivate and harvest crops to turn your land into a happy farm. Build your own village farm near the town city. With amazing products like dairy, bakery and much more you experience the real life of a farmer in this farming game. Once you begin, you’ll find your farmland filled with visitors coming to buy fresh farm products. Décor the farmland to make it your dream farm in this farm game. <br/><br/><br/> WHAT’S INSIDE <br/>CULTIVATE amazing crops <br/>FEED farm animals<br/>MEET exciting new visitors<br/>ACCOMPLISH challenges<br/>DECOR your farmland<br/>TRANSPORT final products<br/><br/><br/> IMPORTANT NOTE <br/>FARM DAY is free to download and play. However, some in-game features can be purchased for real money. Remember, it’s an offline game. A network connection is not compulsory", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-31T03:07:41", "background_image": "https://media.rawg.io/media/screenshots/c35/c35e969c41116ceb39c32e5dce5901f0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 257, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Big Alpha Games"], "genres": ["Adventure"], "publishers": [], "esrb_rating": "Everyone"}