{"id": 227875, "slug": "bike-unchained", "name": "Bike Unchained", "name_original": "Bike Unchained", "description": "Download now and shred sweet trails, including tracks from the world’s premier freeride event  Red Bull Rampage!  Get the coolest bikes, travel the world and build your crew to ride against your ultimate rival - Team Praedor - and battle for a top spot on the podium.<br/><br/>Fearlessly ride your way through epic trails that combine Enduro, Downhill and Slopestyle Mountain Biking! Meet the world’s top riders, including Brandon Semenuk, Rachel Atherton, Andreu Lacondeguy and many more!<br/><br/>Full of killer tricks, awesome freestyle action and insane stunts, Bike Unchained is a high paced racing adventure - it’s the evolution of mountain biking on mobile!<br/><br/>WORLDWIDE LOCATIONS<br/>* NEW Red Bull Rampage tracks! Epic tracks from the world’s premiere freeride mountain bike event.<br/>* 4 amazing real-world locations to explore - Whistler, the Alps, Japan and Utah - with more to come.<br/>* Ride each lush environment at different times of day - no two rides are the same! <br/><br/>INCREDIBLE TRACKS &amp; TRICKS<br/>* 69 tracks action packed with the freshest and gnarliest tricks!<br/>* Pump your bike down the slope for extra speed, get stylish air time and pull off tsunami flips, tailwhips and other crazy mayhem.<br/><br/>MAKE IT YOUR OWN<br/>* Build your crew, customize their gear and skills to secure that top spot in the competition. <br/><br/>Choose online or offline play and a variety of game modes - Story Campaign, Quick play and exciting Special Contests! Newly added Praedor Challenges and Limited time events offer even more ways to compete and win epic prizes!<br/><br/>INTUITIVE CONTROLS<br/>* Simple but skillful one tap mountain bike riding: go with the flow and stick the hardest tricks with smooth controls.<br/><br/>BUILT FOR MOBILE, AMAZING ON YOUR TABLET OR PHONE<br/>Gorgeous 3D riding, smooth HD graphics and incredible speed. One universal game perfect for your mobile device.<br/><br/>It’s the evolution of mountain biking on mobile! Get ready to ride unchained!<br/><br/> <br/>IMPORTANT<br/>Minimum requirement: 1GB Ram<br/>Minimum Android OS: 4.1 or newer<br/>Minimum screen resolution: 800x480<br/> <br/>Recommended:<br/>Android device manufactured in 2013 or newer<br/> <br/>By downloading this application you accept our Terms and Conditions and Privacy Policy.  By accepting our Privacy Policy, you consent to the processing and transfer of your personal information as set out in our Policy: <br/>https://policies.redbull.com/r/Apps_and_Games/privacy/en<br/><br/>If you encounter any issue please contact us: games@support.redbull.com", "metacritic": null, "released": "2015-10-21", "tba": false, "updated": "2019-07-29T22:56:40", "background_image": "https://media.rawg.io/media/screenshots/b27/b275d38aa1eab38d484cdc9213f306ae_GchXrPF.jpg", "website": "http://redbull.com/games", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 310, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Red Bull"], "genres": ["Sports", "Arcade", "Casual"], "publishers": ["Red Bull Media House"], "esrb_rating": "Everyone 10+"}