{"id": 227880, "slug": "bingo-win", "name": "Bingo Win", "name_original": "Bingo Win", "description": "Welcome to the #1 Free Bingo Games on Android: Bingo Win!<br/>Join Winnie to start an interesting Bingo Journey now! Play bingo with friends and find mystery collections around the world! Find Unique Puzzles and win Huge Jackpot! It's the MOST FUN Bingo!<br/><br/>Top free games 2018! Grandma's favorite online multiplayer bingo game!<br/><br/>Play Free Bingo Games with Awesome Features<br/><br/>More than 30 themed rooms with delicate art design and jolly BGM here. Just Choose your favorite Bingo Hall in lobby and enjoy bingo caller anytime, anywhere! Travel in famous cities and claim generous rewards while collecting iconic items. Play Bingo with friends &amp; millions of players around the world with these exclusive features along the way:<br/><br/>✪Merry Christmas! BRAND-NEW Christmas cover, enjoy your best winter Holiday with Bingo Win!<br/>✪EASY to PLAY - Classic Bingo 75 gameplay in World Tour Bingo Hall. It's very easy to play!<br/>✪ FREE CREDITS and COINS - collect your daily sign-in bonuses &amp; Spin the Lucky Wheel to get FREE BONUS.<br/>✪ SPECIAL BINGO STYLES - Much more than classic Bingo rules, brand new winning patterns in Super Bingo are to be discovered. 90 Ball Bingo, Jackpot Bingo, Juice Fever, Castle at Night, Slingo and so on.<br/>✪ FUN DAILY EVENTS - it’s a bingo Holiday! Challenge yourself and win mega prizes in the daily event!<br/>✪ MINI GAMES in cities - interesting mini game styles with much fun and FREE GIFTS in some world tour cities.<br/>✪ VIP MEMBERSHIP - Improve your VIP Level to unlock higher level permissions. The More VIP level, the more bonus you will get :)<br/>✪ DAILY CHALLENGE - every day you will get a set of tasks to challenge. finish them to get BIG REWARDS.<br/>✪ PLAY MULTI CARDS - up to 8 CARDS each world tour round and enjoy fantastic bing rewards. Up to 12 CARDS in 90 Ball Bingo hall! The more cards you buy, the higher chance to call BINGO and WIN BIG! <br/>✪ POWER UPS and BINGO HINTS - even better are the various Power Ups that help double and boost your winning!<br/>✪ Daily Tournament Challenge - feel the thrill with this online multiplayer Bingo Games! Live tournament with multiplayer games online all around the world. Challenge yourself and see who gets the first BINGO! <br/>✪ Tournament Crown represents your glory! Play tournament to win Luxury jewelries and get your own crowns!<br/>✪ Customized daubers, Avatar Frames and bingo cards!<br/>✪ LUCKY WIN CASINO! - no matter you are a slots fan, or keno lottery lover, wait to be dazzled by Jackpot magic in Jackpot city slots. Spin the wheel and enjoy bonus game.<br/>✪ Scratch and offline games to be updated soon, no wifi required.<br/><br/>Bingo Win brings you more:<br/>- Free Daily Sign-in Bonus. Remember to check back your Free credits and coins EVERY day.<br/>- Spin Lucky Wheel every 24 hours<br/>- Classic fruit slot machine while waiting for the new round<br/>- Fantastic Jackpot prizes in the special bingo room<br/>- Holiday themed lobby with special offers<br/>- Level up Bonus as you unlock more rooms<br/>- Play with friends as in Bingo community. Send and request Gifts and Collection items<br/><br/>Ready to call \"BINGO\"? It's a fun bingo party! Come in NOW and jump for JOY! Have FUN!<br/><br/>Any suggestions? <br/>We would love to hear from you! You can reach us, the best support team at: bingowin.service@gmail.com<br/><br/>Already a big fan of Bingo Win? Make sure to LIKE us on Facebook: <br/>https://www.facebook.com/bingowingame/ <br/><br/><br/>Disclaimer:<br/>*Bingo Win is intended for use for amusement purposes only. <br/>*Bingo Win, which mean that practice or success at social casino gaming does not imply future success at real money gambling.<br/>*Bingo Win uses Facebook as ads provider. Facebook and Instagram likes wants to show ads relevant to you. For more information, please check https://m.facebook.com/ads/ad_choices.<br/><br/>- The games are intended for an adult audience.<br/>- The games do not offer \"real money gambling\" or an opportunity to win real money or prizes.<br/>- Practice or success at social casino gaming does not imply future success at \"real money gambling.\"", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-31T07:52:38", "background_image": "https://media.rawg.io/media/screenshots/872/872287eb5d2a54416f260e279576b201.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 129, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Best Bingo Casino Games"], "genres": ["Board Games"], "publishers": [], "esrb_rating": "Teen"}