{"id": 228350, "slug": "word-games-free", "name": "Word Games - Free", "name_original": "Word Games - Free", "description": "Word Games is the biggest collection of 80+ addicting word search, spelling, guessing, educational and casual games playable from a single app, offline!<br/><br/>✓ Fast &amp; offline  - Download once and play all the word games from one place! Offline or online (if you want to submit your points!)<br/>✓ Challenging - All the games are highscores based so you can submit your score at the end of the game and also review points of other people from all around the world or share your points with your friends via facebook, google+ or other social networks. <br/>✓ Free to download - This is a free to play version of the game. If you want to unlock all the extra games and features, you can do it directly from the app for very reasonable price.<br/>✓ Relax mode  - A clock icon on How To Play Screen (top right corner). Don't like playing under pressure? Turn on the relax mode then &amp; play with no time limit or lives! (enabled for most of the games)<br/>✓ Multiplayer  - \"A plus person\" icon on How To Play screen. Play against up to 5 people on a single device! (enabled for most of the games)<br/>✓ Multilingual  - \"A Flag icon\" on How To Play screen. Support of 16 languages for games Word Search, Word Fill and One By One. <br/>✓ Challenges - test your skills and try to collect as many points as you can by completing various game challenges! 100+ Challenges included!<br/><br/>This is a freemium version of the game.<br/><br/>GAMES INCLUDED:<br/><br/>✓ Word Search - Find all the words asap. <br/>✓ Word Search Unlimited - Find as many words as you can.<br/>✓ Word Crush - Connect the same type of neighboring blocks to remove them and create words from provided letters.<br/>✓ Word Connect - Connect neighboring letters and create words. Match the color of the first letter in your word for multiple points!<br/>✓ Word Master - Create as many words as you can from provided letters! <br/>✓ Puzzle Words - Crush the groups of the blocks and create words from the provided letters!<br/>✓ Word Gram - from provided letters create as many words as you can, but watch out, letters can't reach the top of the board!<br/>✓ Word Fill - find all the words above the board as soon as possible and fill the whole board! <br/>✓ Word Flood - create as many words as you can before the board is flooded!<br/>✓ Word Mania - create as many unique words as you can from provided letters!<br/>✓ Wordies - colorful word search game, create words with 3+ combos to get the new letters!<br/>✓ Spelling Check - test your English spelling skills in an entertaining and challenging way! <br/>✓ Spelling Challenge - decide if the word on screen is spelled correctly or not!<br/>✓ Spelling Test - check your spelling skills and go for highscores!<br/>✓ Decide &amp; Correct <br/>✓ Spelling Gaps  - fill all the missing letters in the word previously shown! <br/>✓ 4 Words 1 Right/Wrong - out of 4 words on the screen find the correctly/incorrectly spelled one!<br/>✓ Word Quiz - find the word definition as fast as possible!<br/>✓ Guess Jokes, Animals &amp; Countries - a hangman style games<br/>✓ Synonyms &amp; Antonyms - three games testing your knowledge of English words<br/>✓ Grammar Test - test your English grammar<br/>(and many more)<br/><br/>SUPPORTED LANGUAGES (games Word Search, Word Fill, One By One)::<br/><br/>* English<br/>* German<br/>* Spanish<br/>* French<br/>* Italian<br/>* Polish<br/>* Czech<br/>* Russian<br/>* Portuguese<br/>* Turkish<br/>* Swedish<br/>* Slovak<br/>* Finnish<br/>* Hungarian<br/>* Dutch<br/>* Bulgarian<br/><br/>Have fun with our app Word Games and if you like it and want to see more features, please support it by rating it and leaving some comment, it helps us a lot in adding new games and features. <br/><br/>If you find any bug or have any question, please let us know!<br/><br/>SUPPORT:<br/><br/>✓ Email: littlebigplay@gmail.com", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:45:20", "background_image": "https://media.rawg.io/media/screenshots/2ac/2acad25661e4f76137e79dac90a10333.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 109, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["LittleBigPlay - Word, Educational & Puzzle Games"], "genres": [], "publishers": [], "esrb_rating": null}