{"id": 22835, "slug": "worms-united", "name": "Worms United", "name_original": "Worms United", "description": "An absolutely engrossing game that was responsible for many sleepless nights back in the 90s is back to bring more sleepless nights now! What's there not to like about teams of 10 worms unleashing hell against each other on a fully destructible map using a wide arsenal of fun and imaginative weapons? The answer is \"nothing\". Especially if you are using the multiplayer option. The look on your buddy's face when your well-placed holy grenade sends a bunch of his best worm-soldiers to a better place is just priceless.\n<br/><br/>\nCreative use of weapons is the key to victory. You can shoot the bazooka directly at your opponent and take some of his health. If you are clever and skilled, though, then maybe there is a way to use the wind and gravity to curve the trajectory of the projectile so that it lands right behind his cover and throws him from the cliff, causing an instant death? The feeling of satisfaction after such a brilliantly executed stunt is what makes this game great. So if you are looking for a game to play with your friends then you really can’t go wrong with Worms United.Worms United includes Worms and Worms: Reinforcements\nFun and addictive hotseat multiplayer for up to four players\nImpressive arsenal of weapons featuring such classics as the banana bomb, explosive sheep, and holy hand grenade.", "metacritic": null, "released": "1996-01-01", "tba": false, "updated": "2019-08-28T22:07:20", "background_image": "https://media.rawg.io/media/screenshots/576/5768363bb26eed2a72a028634790bb61_YA0ih0R.jpg", "website": "", "rating": 3.0, "rating_top": 4, "added_by_status": {"yet": 12, "owned": 82, "beaten": 5, "toplay": 3, "dropped": 4}, "playtime": 1, "achievements_count": 0, "ratings_count": 9, "suggestions_count": 368, "game_series_count": 0, "reviews_count": 9, "platforms": ["PC"], "developers": ["Team17 Digital"], "genres": ["Strategy", "Fighting"], "publishers": ["Team17 Digital"], "esrb_rating": null}