{"id": 228309, "slug": "power-up-bubbles", "name": "Power Up Bubbles", "name_original": "Power Up Bubbles", "description": "Power up your brain with the most fun bubble pop game!<br/>Get Power Up Bubbles now and experience hours of bubble popping and blasting fun. Enjoy cool bubble elements, boosts, power-ups, and more. Play this awesome bubble shooter game now for free and join the fun!<br/><br/>Fire up all the bubbles in this awesome balloon popping game, clear the board and unlock new and exciting puzzle levels. Power Up Bubbles game is free to download and super easy to pick up and play. Download this cool app from the play store and join the bubble shooting adventure today, shoot and burst all the bubbles and clear the challenges. <br/><br/>How to play<br/>* Drag your finger to move the laser aim and lift it to pop bubbles. <br/>* Match 3 or more bubbles of the same color to pop the combo and win points. <br/>* Explore thousands of puzzle levels and beat all the challenges. <br/>* Boost your gaming experience with awesome power-ups. <br/>* Explode all the bubbles on the board. <br/>* Change the color of your bubble with a tap.<br/>* Use fewer shots and try to get three stars on every level. <br/><br/>* Fireball- pop 7 bubbles in a row to get a fireball that will burn every bubble on the way.   <br/>* Bomb- drop 10 balloons or more to get a bomb that will take out surrounding bubbles.<br/><br/>Powerful Boosters<br/>Power Up Bubbles game is easy to learn but can be tricky to master. You’ll need some help along the way. Make special combos to unlock powerful boosts that will help you on your journey.  Earn and use these boosters to hit and blast the balloons and advance through the game. <br/><br/><br/>Play with Friends<br/>Play with friends and family Power Up Bubbles, challenge them, and see who can reach the highest score and get three stars on every level. Enjoy this fun bubble shooter game with your family and solve all the puzzles. <br/>Don’t wait any longer to join the fun! Rush and pop all the balls and win levels!<br/><br/><br/>Don’t wait any longer! Download now from the play store and start your exciting adventure.<br/>Shoot the colorful balls and use awesome power-ups to blaze through levels!<br/>It’s game on!<br/><br/><br/>All rights of Bubble Shooter™ are owned by Ilyon Dynamics Ltd.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:45:27", "background_image": "https://media.rawg.io/media/screenshots/151/151b6033c45e5141b84f65b8e0bf574c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 28, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Blast 2 Fun Games"], "genres": ["Arcade"], "publishers": [], "esrb_rating": null}