{"id": 228424, "slug": "toy-defense-td-strategy", "name": "Toy Defense - TD Strategy", "name_original": "Toy Defense - TD Strategy", "description": "Put your defense and strategic skills to the ultimate test in the new Tournament Mode of this addictive military tower defense game! Put your towers into action and defend your base from the never ending waves of enemies as you compete with your friends in weekly tower defense tournaments! Play for as long as you can survive! Defend the frontier with your force!<br/><br/>Give your foe no quarter – a new Cooperative Mode has been added to the game! Create military alliances and join forces against a common enemy – develop strategy and wage war together to achieve awesome results and banish your enemies from the toy World!<br/><br/>Experience a totally explosive gameplay in the new tower defense game in the World War I setting! Now you have even more opportunities, many more weapons and tactical tricks. Battle, eliminate foes, defend your base and feel for yourself the atmosphere of the true born warfare. Lead your army to victory by any means!<br/><br/>Dive into this classic tower defense strategy – wargame № 1 in the world!<br/><br/>Toy soldiers but real war!<br/><br/>Game features:<br/>- Recreated World War I atmosphere <br/>- Over 90 thrilling tower defense war missions in a variety of worlds <br/>- 4 historically accurate weapons with 24 upgrades <br/>- Joint missions with your friends in the new Cooperative Mode!<br/>- Battles with 9 different enemies<br/>- All worlds are available at once and without any additional fees<br/>- Facebook and Twitter integration <br/>- 4 absolutely new cool features for a better defense:<br/>*Repairmen. Now tower can be repaired without your assistance!<br/>*Resurrection. Revive a ruined tower and take part in the battle again!<br/>*Squashing. Help your army, join the battle yourself! Squash the enemy with your finger!<br/>*Protective barrage. Defend your base. Crush the enemy with a blast wave!<br/><br/>Dive into World War I battle, develop the best strategy with your army and defend your frontier!<br/><br/>In the upcoming updates you will get new worlds, new toy soldiers and new weapons upgrades.<br/><br/>Follow us for the updates!<br/>http://www.facebook.com/ToyDefense<br/>http://www.Melesta-Games.com<br/>http://www.twitter.com/MelestaGames<br/><br/>Be sure to check out our other games!", "metacritic": null, "released": null, "tba": false, "updated": "2022-11-03T19:36:39", "background_image": "https://media.rawg.io/media/screenshots/1bb/1bb54ed555bf53dddf7c959fce509280.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 303, "game_series_count": 0, "reviews_count": 1, "platforms": ["Android"], "developers": ["Melsoft Games"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}