{"id": 228404, "slug": "alien-shooter-2-the-legend", "name": "Alien Shooter 2: The Legend", "name_original": "Alien Shooter 2: The Legend", "description": "<p>Meet the completely reworked legendary game loved by millions of players worldwide!<br />\nAlien Shooter 2 - the Legend is an ambitious follow-up to the famous Alien Shooter series.<br />\nIt offers a huge game world, deep RPG system and a great variety of weapon types and equipment.<br />\nYou&#39;re about to follow the mysterious story from the very beginning - the moment when the monsters appeared on the MAGMA corporation&#39;s secret base. You will take part in global battles for the survival of mankind.<br />\nMonster crowds - the distinctive feature of the whole game series - became even bigger, and the bodies of fallen beasts still remain on the battlefield.<br />\nWith time, the variety of monsters grew vastly. Some kinds of monsters mutated and now present a serious threat to every savior of humanity.<br />\nTo keep up with such a diverse alien army, the player&#39;s abilities were significantly expanded. Try upgrading the player to match your playing style and build your ultimate monster killing machine.<br />\nSo again mankind is in danger! Who has the courage to stand for it, go through all the obstacles, unwind the tangle of mysterious intrigues, and maybe find love?</p>", "metacritic": null, "released": "2019-01-09", "tba": false, "updated": "2023-02-01T13:36:07", "background_image": "https://media.rawg.io/media/screenshots/39e/39e75fdf2758412bf8a1eb8fab9d4198.jpg", "website": "http://www.sigma-team.net", "rating": 2.33, "rating_top": 3, "added_by_status": {"yet": 4, "owned": 37, "beaten": 1, "toplay": 2, "dropped": 3}, "playtime": 4, "achievements_count": 26, "ratings_count": 6, "suggestions_count": 541, "game_series_count": 0, "reviews_count": 6, "platforms": ["Android", "PC", "iOS"], "developers": ["Sigma Team"], "genres": ["Action", "RPG", "Casual", "Indie"], "publishers": ["Sigma Team", "Sigma"], "esrb_rating": "Mature"}