{"id": 22846, "slug": "thief-3-deadly-shadows", "name": "Thief 3: Deadly Shadows", "name_original": "Thief 3: Deadly Shadows", "description": "<p>Thief 3: Deadly Shadows is a stealth-action game developed by Ion Storm Inc. It is the third installment in the Thief franchise.</p>\n<p>The game is set in a Steampunk world that resembles both the middle ages and the Victorian era. Besides that, there are several fantasy elements in the game. The thief named Garett is a member of the thief guild. He receives a letter in which the guild invites him to listen out the new prophecy. In order to be let in the palace where the prophecy will be unraveled, Garett has to steal two sacred relics. His new adventure begins.</p>\n<p>The game can be played both from first-person and third-person perspective. The player may steal from innocents and avoid, distract, knock out or kill guards. Loot and weapons are picked up just by standing close enough to them. Locked areas can be unlocked using a lock-picking minigame. The player has to stick to the shadows during the missions, as running or walking will alert the guards who will come looking for Garett. </p>\n<p>The levels are fairly open-ended and have different paths for the player to choose from. After completing each mission, the player is free to explore the City for loot. City areas unlock as the game goes on.</p>", "metacritic": 85, "released": "2004-05-24", "tba": false, "updated": "2024-03-15T18:49:35", "background_image": "https://media.rawg.io/media/games/f89/f899f0bdeb6bcd7419d9b2281a693ad8.jpg", "website": "http://www.eidos.co.uk/gss/thief_ds/", "rating": 3.75, "rating_top": 4, "added_by_status": {"yet": 218, "owned": 2372, "beaten": 113, "toplay": 55, "dropped": 95, "playing": 3}, "playtime": 1, "achievements_count": 0, "ratings_count": 224, "suggestions_count": 378, "game_series_count": 3, "reviews_count": 224, "platforms": ["Xbox", "PC"], "developers": ["Ion Storm"], "genres": ["Action", "Simulation"], "publishers": ["Square Enix"], "esrb_rating": "Mature"}