{"id": 228496, "slug": "the-great-wobo-escape-ep1", "name": "The Great Wobo Escape Ep.1", "name_original": "The Great Wobo Escape Ep.1", "description": "In The Great Wobo Escape, you must help the high-tech robot Wobo escape from his mining colony. Optimized for NVIDIA SHIELD with specular highlights and 1080p visuals, guide Wobo through a number of different levels using stealth, solving puzzles, and using the environment to avoid detection by the Dieselpunk Robot overlords. <br/><br/>As featured in SHIELD Hub.<br/><br/><br/>STEALTH &amp; ACTION<br/>Fast-paced action-filled stealth game full of puzzles, deadly enemies, hidden passages, dangerous traps and tricky hazards.<br/> <br/>BEAUTIFUL 3D GRAPHICS<br/>Pushing limits of mobile devices with detailed, high-res textures, environments and characters.<br/> <br/>VISUALLY UNIQUE<br/>Unique visual style – play as a futuristic high-tech robot, fight dieselpunk enemies of various sizes and shapes.<br/> <br/>SCI-FI STORY<br/>Rich story in an absorbing sci-fi world exploring a thin line between a machine and a living intelligence, where colony’s AI went rogue and persecutes robots.<br/> <br/>FAMILY FRIENDLY FUN<br/>Approachable by young audience – no blood, just a comic mischief with a pinch of sabotage towards evil robots!<br/> <br/>CONSOLE-LIKE EXPERIENCE<br/>Enjoy playing on your TV thanks to 1080p resolution, full gamepad controller and Nvidia Shield Android TV support.<br/><br/><br/>This game features advanced graphics. To optimize performance, you may want to close down other running applications before playing the game.<br/><br/>Support: info@gamifi.cc<br/>Like us on Facebook: https://www.facebook.com/TheGreatWoboEscape<br/>Follow us on Twitter: https://twitter.com/gamificc", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-31T05:38:24", "background_image": "https://media.rawg.io/media/screenshots/2df/2df17256deab6e0a1ea29d5c2b70052a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 475, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["gamifi.cc games"], "genres": ["Action"], "publishers": [], "esrb_rating": "Everyone 10+"}