{"id": 228415, "slug": "toy-defense-2-td-battles-game", "name": "Toy Defense 2: TD Battles Game", "name_original": "Toy Defense 2: TD Battles Game", "description": "Playtime’s over, soldier! It’s time for some real fast paced tower defense action. Lucky for you, Toy Defense 2 has you covered. We invite you to play one of the best defense games in the mobile games industry, the atmosphere of battle games has never been so tense. Let the memories about boring defence games vanish — jump into epic td combat, take command of powerful vehicles, hone your strategy skills and become the ultimate commander of your army to win any World War II battle. A new page in the industry of defense games was now being started. Inspired by the greatest events of XX century, these tower games will leave you unforgettable impressions.<br/><br/><br/>Think you’re tough enough? Then sharpen your tactics and tackle dynamic real-time PvP battles on Arena from across the globe. Still looking for a bigger tower defense challenge? Take the next step, develop winning strategy and compete in tournaments to rise through the ranks to the top of the ratings. Embrace opportunity to play one of the best td games for today and say “Bye” to boring defense games you have met before, their days have passed. People from countless number of countries are using their armies to claim the title of the best defender, and hundreds of battle games are going on right now. Conquer all game modes, prove superiority of your strategy, and become a true master of PvP games. Be artful, choose an ingenious tactics to defend your tower and show your battle games rivals who is the winner! Strategy war games have never been so captivating before.<br/><br/><br/>They may be toy soldiers, but this no place for toying around! World war is in full play and only your army can win this epic battle. Defenders of your home turf are fully prepared and await your orders, no soldier will leave his post. No matter who you are: a beginner in tower games or a sophisticated pro in strategy war games, Toy Defense 2 will grasp your thoughts. It’s up to you build an unstoppable army, take on unforgettably awesome td battles, work out the best strategy, conquer your enemies and seize victory!<br/><br/><br/>✫ ✫ ✫ ✫ ✫ ✫ ✫ ✫ ✫<br/><br/><br/>Features:<br/>★ Three game modes: PvE missions, tournaments and real-time PvP battles on Arena<br/>★ 290 action-packed tower defense missions, absolutely free<br/>★ Famous World War II campaigns like the Battle of Iwo Jima and Operation Overlord<br/>★ Vehicles from Great Britain, the U.S.A., the USSR, and Germany<br/>★ Tournaments with rating system<br/>★ Stunning graphics<br/>★ Units upgradable by adding commanders for your army improvement<br/>★ Several nations’ armies available to defend your towers during a td battle<br/><br/><br/>✫ ✫ ✫ ✫ ✫ ✫ ✫ ✫ ✫<br/><br/><br/>You will definitely love this epic tower defense strategy game!<br/><br/><br/>Follow us for the updates!<br/>http://www.facebook.com/ToyDefense<br/>http://www.Melesta-Games.com<br/>http://www.twitter.com/MelestaGames", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:45:12", "background_image": "https://media.rawg.io/media/screenshots/0ce/0ce4c490de1652b7c5e4c81edb44d688.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 183, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Melsoft Games"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}