{"id": 228545, "slug": "2048-charm-classic-new-2048-number-puzzle-game", "name": "2048 Charm: Classic & New 2048, Number Puzzle Game", "name_original": "2048 Charm: Classic & New 2048, Number Puzzle Game", "description": "Are you ready to play the most fun and innovative 2048 game in the market? New 2048 is here to offer you the most classic 2048 puzzle gameplay along with 12 different variations, all in one complete package! <br/><br/>With rich gameplay, intuitive interface, and all the functions right at your fingertips, this 2048 number puzzle game is sure to be your favorite! Get immediate access to 2048 plus game variations like 4x4+ Board, 5x5 Board, Drop mode, Party mode, and other 12 fun number puzzles gameplay!<br/><br/>2048 Charm Puzzle Game Features:<br/>♥ 12 unique &amp; advanced 2048 gamemodes in one app<br/>♥ Keep playing for High-slcore after collected 2048 tile<br/>♥ Classic and simple UI, smooth sliding block experience<br/>♥ One Undo move support to adjust coolmath strategy<br/>♥ Reset 2048 standard anytime in case you get stuck<br/>♥ Detailed guide and rules for each 2048 classic modes<br/>♥ Process and high score will be automatically saved<br/><br/>How to play 2048 Charm:<br/>Swipe the screen to move tiles left, right, up, and down. When two tiles with the same number touch, they merge into one! Every swipe, a new tile will randomly appear in an empty spot on the board with a value of either 2 or 4. Slide the tiles to merge them, 2+2→4, 8+8→16 ...32 ...256 ...1024..., when 2048 tile is created, you win! Play this amazing 2048 game and have fun!<br/><br/>2048 Charm Game Modes:<br/>Classic Mode:  Classic (4x4), big (4x4+) amd bigger (2048 5x5) board options. This 2048 number challenge mode is an upgraded version of the original 2048 game.<br/>Click &amp; Joy:  Click the tile, the number +1 and compose a new number with adjoining tiles. Be prepared for a new super 2048 puzzle challenge for best record!<br/>Drop Mode:  Place the falling tiles to the right position. Two tiles with same number will merge into one. This is the interesting combination of 2 classic logic puzzles games: Block crush game &amp; 2048 Ultimate.<br/>Party Mode:  Click on the adjacent tiles with the same number, all the tiles will merge into one and double its number. Explore deep cool math logic challenge for your mind!<br/>Merge Mode:  Click on the blank spot, blocks will move closer. Start playing this awesome 2048 unlimited mode, merging the numbers and experiencing the cool math logic game.<br/>Line Mode:  Slide to connect the same number, the more you connect, the higher number puzzle game score you get. Compete with your friends to see who can reach the best score.<br/>Spin Number:  Line up numbers from small to large to generate a more larger number. The longer the line is, you have more chance to win the 2048 pro magic puzzles game.<br/>12 Legend Mode:  Only the red 1 tile and the green 1 tile can combine a 2. This is an amusing 2048 mania game mode that will get your brain trained, get fun out of it and make you think.<br/><br/>More fun 2048 games are waiting for you in our cool math games: 2048 Charm!<br/><br/>With endless 2048 you now have the famous math logic puzzle always with you – anytime and anywhere for free! We deliver all of that within a refined, appealing and easy to use interface! Relax or keep your mind active – pass time in a pleasant way!<br/><br/>If you want to have a great time while learning more math tricks in logic puzzle apps, this is the right brain teasers game to help you with that. Our 2048 free number app will make the puzzle solving experience smooth cause you can have lots of fun as you explore all the possibilities and everything that you might want from a popular 2048 game! <br/><br/>Like us on Facebook: https://www.facebook.com/DoPuzGames<br/>Follow us on Twitter: https://twitter.com/DoPuzGames<br/><br/>Free to Download Now! Enjoy the fun on this 2048 charm number puzzle games!", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:44:48", "background_image": "https://media.rawg.io/media/screenshots/4bd/4bdff0ce75d32af6cb2329851e223d85.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 89, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["DoPuz Games"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}