{"id": 228674, "slug": "modern-campaigns-mideast-67", "name": "Modern Campaigns - Mideast '67", "name_original": "Modern Campaigns - Mideast '67", "description": "This is the first paid release in the mobile Modern Campaigns series.  You should first install and play the free Panzer Campaigns and Modern Campaigns apps by John Tiller Software to become familiar with the interface and ensure that the app runs on your device.  This release includes 14 scenarios from the Middle East '67 game for the PC all played from the perspective of the Israeli commander.  The scenarios enable you to see the evolution of armored combat after World War II starting in 1956 (3 scenarios) and continuing through the 1967 Six Day War (7 scenarios) and culminating in the 1973 Yom Kippur War (4 scenarios).  In each case, you face an A/I opponent playing the part of the Egyptian, Syrian, Jordanian, and Iraqi force commanders.<br/><br/>Modern Campaigns is a detailed turn-based simulation of operational warfare after World War II through until present day.  It includes detailed rules and combat resolution but has a simple interface that allows the player to focus on strategy and tactics.  A wide variety of unit types are represented including infantry, tanks, artillery, and engineers.  In addition, modern warfare is addressed in this game engine including chemical and nuclear warfare, electronic warfare (signal intelligence and jamming), and thermal sights.<br/><br/>While this version of Modern Campaigns will run on large-format Android phones, it is best on an Android tablet with screen size of 7 inches or more.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-02T06:35:27", "background_image": "https://media.rawg.io/media/screenshots/258/258a6900846aa04b69b27b2b74ad7953.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 195, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["John Tiller Software"], "genres": ["Strategy"], "publishers": [], "esrb_rating": "Everyone"}