{"id": 228690, "slug": "chess-tactics-for-beginners", "name": "Chess Tactics for Beginners", "name_original": "Chess Tactics for Beginners", "description": "This course is based on a bestseller by the experienced coach Sergey Ivashchenko which became a sort of chess publishing sensation and sold over 200,000 copies. More than 1200 training exercises are intended for beginners, both children and adults. Elementary and simple tasks (1-, 2- and 3-way) are used as teaching material.<br/><br/>This course is in the series Chess King Learn (https://learn.chessking.com/), which is an unprecedented chess teaching method. In the series are included courses in tactics, strategy, openings, middlegame, and endgame, split by levels from beginners to experienced players, and even professional players.<br/><br/>With the help of this course, you can improve your chess knowledge, learn new tactical tricks and combinations, and consolidate the acquired knowledge into practice.<br/><br/>The program acts as a coach who gives tasks to solve and helps to solve them if you get stuck. It will give you hints, explanations and show you even striking refutation of the mistakes you might make.<br/><br/>Advantages of the program:<br/>♔ High quality examples, all double-checked for correctness<br/>♔ You need to enter all key moves, required by the teacher<br/>♔ Different levels of complexity of the tasks<br/>♔ Various goals, which need to be reached in the problems<br/>♔ The program gives hint if an error is made<br/>♔ For typical mistaken moves, the refutation is shown<br/>♔ You can play out any position of the tasks against the computer<br/>♔ Structured table of contents<br/>♔ The program monitors the change in the rating (ELO) of the player during the learning process<br/>♔ Test mode with flexible settings<br/>♔ Possibility to bookmark favorite exercises<br/>♔ The application is adapted to the bigger screen of a tablet<br/>♔ The application does not require an internet connection<br/>♔ You can link the app to a free Chess King account and solve one course from several devices on Android, iOS and Web at the same time<br/><br/>The course includes a free part, in which you can test the program. Lessons offered in the free version are fully functional. They allow you to test the application in real world conditions before releasing the following topics:<br/>1. Mate in 1<br/>1.1. Rook checkmates<br/>1.2. Queen checkmates<br/>1.3. Bishop checkmates<br/>1.4. Knight checkmates<br/>1.5. Pawn checkmates<br/>1.6. Mate in 1<br/>2. Winning material<br/>2.1. Gain a rook<br/>2.2. Gain a knight<br/>2.3. Gain a bishop<br/>2.4. Gain a queen<br/>3. Draw<br/>4. Mate in 2<br/>4.1. Double check<br/>4.2. Queen checkmates<br/>4.3. Rook checkmates<br/>4.4. Knight checkmates<br/>4.5. Bishop checkmates<br/>4.6. Pawn checkmates<br/>5. Sacrifice material<br/>5.1. Queen sacrifice<br/>5.2. Rook sacrifice<br/>5.3. Bishop sacrifice<br/>5.4. Knight sacrifice<br/>6. How to proceed?", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:44:42", "background_image": "https://media.rawg.io/media/screenshots/7d8/7d80247787e8c446c5246a23ffc170a8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 14, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Chess King"], "genres": ["Board Games"], "publishers": [], "esrb_rating": null}