{"id": 228644, "slug": "what-am-i", "name": "What am I?", "name_original": "What am I?", "description": "Welcome to the most challenging and fun charades game you’ve ever experienced. What Am I? is a free word guessing and multi-activity game that can entertain you and your friends for hours without noticing the time. It’s a party game for groups and comes with different activities such as dancing, singing, and drawing.<br/>So, if you are into such multi-activity party games and looking for a fun and exciting charades game, download What Am I? for free on your Android device and let your friends help you guess the word. <br/><br/><br/>Having fun? Or increasing general knowledge? How about both?<br/>What Am I?, the free guess the word game, comes with a clean and neat design and the interface is so user-friendly and the gameplay is so easy to learn that you’ll get the whole idea after opening the app for the first time. Speaking of the easy to learn gameplay, you get to play off-line against one friend or as many as you want at the same time. <br/>To get started, you should choose a deck from more than 20 different categories available. After that, you must place the phone on your forehead and from that moment on you are \"transformed\" into the word that is showing on the device. Your friends must help you guess what you are answering your questions, doing mimics, start dancing, drawing, singing or whatever they feel might work for you. The person who guesses more words correctly wins!<br/><br/>Below you will find some of the available deck categories to choose from:<br/>- Guess TV Themes<br/>- Guess Songs<br/>- Guessing Singers<br/>- Guess 70s, 80s And 90s TV Shows<br/>- Guess Animals Kingdom<br/>- Guess Movies<br/>- Guess Novels<br/>- Guess Kids TV Shows, Cartoons And Movies<br/>- Guess Cartoons<br/>- Guess Celebrities<br/>- Guess Pokemon<br/>- Guess Youtubers<br/><br/>Choose your favorite category, rotate your phone and let the fun begins. Don’t forget that your time is limited and you need to find the answer before the time runs out. <br/><br/>Should I install this free guess the word game?<br/>The answer to this question depends on the type of person you are the type of game you are looking for. <br/><br/>If you are looking for a multi-activity game to play with your family and friends, from literally any age, then this free charades game a must-have game for you.<br/>If you are always struggling about what to do at your events and looking for a fun way to pass time, then this free offline game won’t disappoint you.<br/>If you are looking for a fun way to learn more about new things and increase your general knowledge, then this free charades game can become your best companion.<br/>And since this free guess the word game is available for free, there is no harm giving it a try and see the features for yourself. No matter you are throwing a party, you are seeing your friend after a long time or you are spending time with your family, What Am I?, the free offline game, guarantees endless fun and laughter. <br/><br/>What Am I? main features at a glance:<br/>•\tClean and neat design with a fresh and intuitive interface<br/>•\tMost challenging and fun charades game<br/>•\tMulti-activity games for parties<br/>•\t20+ different categories to choose from<br/>•\tPlay offline with just one friend or hundreds of them<br/>•\tChange the time of each round<br/>•\tAvailable in different languages, including English and Portuguese<br/>•\tFun for all ages<br/>•\tFree to play<br/><br/>So, What Am I?, the free ofline and forehead game, delivers everything you should expect from such charades and multi-activity games and it even sets the bar to a higher level by offering the option to change the time, wide range of different categories to choose from, super user-friendly interface, and a lot more.<br/>Download What Am I? for free on your Android device and have fun playing offline with family and friends while guessing increasing your general knowledge. Make sure to use your imagination and creativity when it comes to helping your friend guess the word and find the correct answer.<br/>Stay tuned and let us know about any bugs, questions, feature requests or any other suggestions.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:44:44", "background_image": "https://media.rawg.io/media/screenshots/02f/02ffaa0a1240f27059729d830bafaf1a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 29, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["2Minds Dev"], "genres": [], "publishers": [], "esrb_rating": null}