{"id": 228701, "slug": "ct-art-40-chess-tactics-1200-2400-elo", "name": "CT-ART 4.0 (Chess Tactics 1200-2400 ELO)", "name_original": "CT-ART 4.0 (Chess Tactics 1200-2400 ELO)", "description": "The legendary tactics course that has been voted more than once by chess experts as the best chess training program in the world. This version includes 2,200 basic exercises and 1,800 auxiliary exercises, divided into 50 topics. The course is based on the bestselling book Combination Motifs by a renowned trainer grandmaster Maxim Blokh. All positions have been hand-picked over the course of 20 years of training practice and come in the order that ensures most efficient learning. Each position comes with a special hint unique to this course – a 5x5 mini-position designed to convey the very essence of the tactical maneuver used in the main example.<br/><br/>This course is in the series Chess King Learn (https://learn.chessking.com/), which is an unprecedented chess teaching method. In the series are included courses in tactics, strategy, openings, middlegame, and endgame, split by levels from beginners to experienced players, and even professional players.<br/><br/>With the help of this course, you can improve your chess knowledge, learn new tactical tricks and combinations, and consolidate the acquired knowledge into practice.<br/><br/>The program acts as a coach who gives tasks to solve and helps to solve them if you get stuck. It will give you hints, explanations and show you even striking refutation of the mistakes you might make.<br/><br/>Advantages of the program:<br/>♔ High quality examples, all double-checked for correctness<br/>♔ You need to enter all key moves, required by the teacher<br/>♔ Different levels of complexity of the tasks<br/>♔ Various goals, which need to be reached in the problems<br/>♔ The program gives hint if an error is made<br/>♔ For typical mistaken moves, the refutation is shown<br/>♔ You can play out any position of the tasks against the computer<br/>♔ Structured table of contents<br/>♔ The program monitors the change in the rating (ELO) of the player during the learning process<br/>♔ Test mode with flexible settings<br/>♔ Possibility to bookmark favorite exercises<br/>♔ The application is adapted to the bigger screen of a tablet<br/>♔ The application does not require an internet connection<br/>♔ You can link the app to a free Chess King account and solve one course from several devices on Android, iOS and Web at the same time<br/><br/>The course includes a free part, in which you can test the program. Lessons offered in the free version are fully functional. They allow you to test the application in real world conditions before releasing the following topics:<br/>1. Themes<br/>1.1. Annihilation of defense<br/>1.2. Distraction<br/>1.3. Decoy<br/>1.4. Discovered attack<br/>1.5. Opening of a file<br/>1.6. Clearance<br/>1.7. X-ray attack<br/>1.8. Interception<br/>1.9. Blocking, encirclement<br/>1.10. Destruction of the pawn shelter<br/>1.11. Pawn promotion<br/>1.12. Intermediate move. winning of a tempo<br/>1.13. Play for a stalemate<br/>1.14. Restricting of material<br/>1.15. Pursuit<br/>1.16. Conjunction of tactical methods<br/>1.17. Chess Tactics Art for Advanced<br/>2. Difficulty<br/>2.1. Level 10<br/>2.2. Level 20<br/>2.3. Level 30<br/>2.4. Level 40<br/>2.5. Level 50<br/>2.6. Level 60<br/>2.7. Level 70<br/>2.8. Level 80<br/>2.9. Level 90<br/>2.10. Level 100<br/>2.11. Level 110<br/>2.12. Level 120<br/>2.13. Level 130<br/>2.14. Level 140<br/>2.15. Level 150<br/>2.16. Level 160<br/>2.17. Level 170<br/>2.18. Level 180", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:44:39", "background_image": "https://media.rawg.io/media/screenshots/fbe/fbe770a143d998f62b4fdd7cbe382101.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 21, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Chess King"], "genres": ["Board Games"], "publishers": [], "esrb_rating": null}