{"id": 228709, "slug": "stickman-fighter-mega-brawl", "name": "Stickman Fighter: Mega Brawl", "name_original": "Stickman Fighter: Mega Brawl", "description": "Unleash your inner ninja and prepare for intense battles with STICKMAN FIGHTER, the best stickman action game in town. Kick, punch and sword fight to the death against other Stickmen, warriors and epic Stick Boss duels. Defeat is not an option, you play to win or you die. <br/><br/>Take them all on, try to exterminate them one by one because there is no mercy for the Stickmen! Choose from super skills, massive weapons, special techniques, magic spells and other destructive moves in battle after battle and kill them all! Get your kicks and break some sticks…<br/><br/>STICKMAN FIGHTER is a game of massive destructive battles offering no mercy for the fallen. Fast, addictive gameplay, a thumping soundtrack to the slaughter with Stickman brutality on a grand scale, what more could you want?! <br/><br/>Play now and try to get out of this sticks game without being injured or killed. Use whatever it takes to win, kicks, punches, devastating weapons, mega fireballs and plenty of other bone crushing, piledriving moves... <br/>Every night is alright for Stickman fighting, have you got the skills to take on the challenge, are you ready to fight and not be defeated? Download STICKMAN FIGHTER now and let your fists prove it. Are you ready for epic combats ?<br/>3, 2, 1, FIGHT!<br/><br/>Features:<br/>•\tEasy Controls, just tap with one finger to deliver death punch<br/>•\tUltra Violent Stickman fighting, Stickicide is not a crime<br/>•\tWeapons Galore! Swords, hammers, tridents, chainsaws<br/>•\tChoose Your Moves, bruise, bash and beat your way to victory<br/>•\tDevastating Magic Spells, wield special powers in duels to the death<br/>•\tExterminate them all, there is no mercy for the Stickmen!<br/><br/>Annihilation, obliteration, elimination, eradication, liquidation, killing, slaughter, massacre, complete utter destruction, defeat with extreme prejudice, total extermination..., you name it, you got it, but you need to kill them all! Play hard, offer no quarter, expect no mercy, defeat every single Stickman with your lethal fighting skills.<br/>Too tough for you? Relentless Stickmen are coming from both sides of the screen, use your warrior skills to strike at the right time to destroy them. Play the game, clean these thugs up, wipe the floor with these fools, finish the dirty work and leave this place a piping hot mess of desolation.<br/><br/>STICKMAN FIGHTER is the Armageddon of action games! If you want fast paced, weapons firing, sweat drenched, blood splattered Stickman ninja fighting that takes no prisoners, STICKMAN FIGHTER has it all.<br/>Download the app today and let the battle begin! Get your kicks and start the destruction now! <br/><br/>Die Stickman Die!", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:44:36", "background_image": "https://media.rawg.io/media/screenshots/ceb/ceb87437d818106a0aeffcf655f8596f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 119, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Playtouch"], "genres": ["Action"], "publishers": [], "esrb_rating": null}