{"id": 228849, "slug": "chess-middlegame-iii", "name": "Chess Middlegame III", "name_original": "Chess Middlegame III", "description": "Chess Middlegame III course contains 550 theoretical lessons and 500 practical exercises, aimed for 1800-2400 ELO players. The course includes typical plans and methods for the following popular openings: Petrov defense, Ruy Lopez (Marshall counter-attack, anti-Marshall system), Scandinavian defense, Sicilian defense (Closed variation, variations with 3. Bb5: Moscow variation, Rossolimo variation), Queen's gambit accepted (3. Nf3 Nf6 4. e3 and 3. e4), Grünfeld defense (4. cd Nd5 5. e4 Nс3 6. bc), Queen's pawn opening 3. Bg5 (1. d4 Nf6 2. Nf3 e6 3. Bg5, 2... g6 3. Bg5), Réti opening, King's fianchetto opening.<br/><br/>This course is in the series Chess King Learn (https://learn.chessking.com/), which is an unprecedented chess teaching method. In the series are included courses in tactics, strategy, openings, middlegame, and endgame, split by levels from beginners to experienced players, and even professional players.<br/><br/>With the help of this course, you can improve your chess knowledge, learn new tactical tricks and combinations, and consolidate the acquired knowledge into practice.<br/><br/>The program acts as a coach who gives tasks to solve and helps to solve them if you get stuck. It will give you hints, explanations and show you even striking refutation of the mistakes you might make.<br/><br/>The program also contains a theoretical section, which explains the methods of the game in a certain stage of the game, based on actual examples. The theory is presented in an interactive way, which means you can not only read the text of the lessons, but also to make moves on the board and work out unclear moves on the board.<br/><br/>Advantages of the program:<br/>♔ High quality examples, all double-checked for correctness<br/>♔ You need to enter all key moves, required by the teacher<br/>♔ Different levels of complexity of the tasks<br/>♔ Various goals, which need to be reached in the problems<br/>♔ The program gives hint if an error is made<br/>♔ For typical mistaken moves, the refutation is shown<br/>♔ You can play out any position of the tasks against the computer<br/>♔ Interactive theoretical lessons<br/>♔ Structured table of contents<br/>♔ The program monitors the change in the rating (ELO) of the player during the learning process<br/>♔ Test mode with flexible settings<br/>♔ Possibility to bookmark favorite exercises<br/>♔ The application is adapted to the bigger screen of a tablet<br/>♔ The application does not require an internet connection<br/>♔ You can link the app to a free Chess King account and solve one course from several devices on Android, iOS and Web at the same time<br/><br/>The course includes a free part, in which you can test the program. Lessons offered in the free version are fully functional. They allow you to test the application in real world conditions before releasing the following topics:<br/>1. Petrov defense<br/>1.1. Petrov defense<br/>1.2. System with 3. Nxe5<br/>1.3. System with 3. d4<br/>2. Ruy Lopez<br/>2.1. Ruy Lopez<br/>2.2. Marshall counter-attack<br/>2.3. Anti-Marshall system<br/>3. Scandinavian defense<br/>3.1. Scandinavian defense<br/>3.2. Variation with 4. d4 Nf6 5. Bd2<br/>3.3. System with 5. Nf3 Bg4<br/>3.4. System with 5. Nf3 c6<br/>3.5. System with 2. exd5 Nf6<br/>4. Sicilian defense<br/>4.1. Sicilian defense<br/>4.2. Closed Variation<br/>4.3. Systems with Bf1-b5<br/>5. Queen's gambit accepted<br/>5.1. Queen's gambit accepted<br/>5.2. Variation with 3. Nf3 Nf6 4. e3 e6 5. Bxc4 c5 6. O-O<br/>5.3. Variation with 3. e4<br/>6. Grünfeld defense<br/>6.1. Grünfeld defense<br/>6.2. System with 7. Bc4<br/>6.3. System with 7. Nf3 O-O 8. Rb1<br/>6.4. Variations with 6... c5 7. Bb5 and 6... Bg7 7. Bb5<br/>6.5. Variation with 7. Nf3 c5 8. Be3<br/>7. Queen's pawn opening<br/>7.1. Queen's pawn opening<br/>7.2. Variation with 1. d4 Nf6 2. Nf3 g6 3. Bg5<br/>7.3. Variation with 1. d4 Nf6 2. Nf3 e6 3. Bg5<br/>8. Réti opening<br/>8.1. Réti opening<br/>8.2. System with 1. Nf3 d5 2. c4 e6<br/>8.3. System with 1. Nf3 d5 2. c4 c6<br/>8.4. System with 1. Nf3 d5 2. c4 d4<br/>9. King's fianchetto opening<br/>9.1. King's fianchetto opening<br/>9.2. Variation with 2... d5 3. Nd2 c5 4. Ngf3 Nc6 5. g3 Nf6<br/>9.3. Variation with 2... d5 3. Nd2 c5 4. Ngf3 Nc6 5. g3 g6", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:43:28", "background_image": "https://media.rawg.io/media/screenshots/220/2207287d4d2819e6a65393041591efbb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 12, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Chess King"], "genres": ["Board Games"], "publishers": [], "esrb_rating": null}