{"id": 228893, "slug": "crossme-nonograms-premium", "name": "CrossMe Nonograms Premium", "name_original": "CrossMe Nonograms Premium", "description": "Nonograms are logic puzzles with simple rules and challenging solutions, keep you playing them!<br/><br/>Fill the cells according to numbers at the side of the grid to discover a hidden picture. It’s also known as Picross, Griddlers, Hanjie and Japanese crosswords.<br/><br/>★ TONS OF PUZZLES<br/>- more than 1900 different nonograms: animals, plants, people, tools, buildings, foods, sports, transports, music, professions, cars and more!<br/><br/>★ DIFFERENT SIZES<br/>- ranging from small 10x10 and normal 20x20 to large 90x90!<br/><br/>★ GREAT TIME KILLER<br/>- will keep you entertained in waiting rooms!<br/><br/>★ LIKE SUDOKU<br/>- but it’s with images and way more fun!<br/><br/>★ A MENTAL WORKOUT<br/>- exercise your brain!<br/><br/>★ WELL DESIGNED<br/>-  it's intuitive and beautiful<br/><br/>★ ENDLESS PLAYING<br/>- unlimited number of random nonograms! You will never get bored with this puzzles!<br/><br/>★ NO TIME LIMIT<br/>- it’s so relaxing!<br/><br/>★ NO WIFI? NO PROBLEM!<br/>- you can play picross offline!<br/><br/><br/>Nonogams, also known as pic-a-pix, paint by numbers puzzles, crucipixel, edel, figurepic, grafilogika, japanilaiset, karala, kare, logicolor, logigraphe, oekaki, pikurosu or ristikot, started appearing in Japanese puzzle magazines. Non Ishida published three picture grid puzzles in 1988 in Japan under the name of \"Window Art Puzzles\". Subsequently in 1990, James Dalgety in the UK invented the name Nonograms after Non Ishida, and The Sunday Telegraph started publishing them on a weekly basis.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:43:06", "background_image": "https://media.rawg.io/media/screenshots/f77/f77d1837404f82ec86f0dde5b9150809.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 225, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Mobile Dynamix"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}