{"id": 228831, "slug": "become-a-fashion-designer", "name": "Become a Fashion Designer", "name_original": "Become a Fashion Designer", "description": "Do you want to be a Fashion Designer? It’s time for you to create stunning outfits and make your name in the fashion world!<br/>Make the most fabulous dresses only in these awesome designing games for girls!<br/>Choose the type of dress you’d like to design: beautiful princess dresses, gorgeous dresses for party, everyday women clothes, or prom dresses.<br/>Combine tops and skirts of different kinds to design the dress of your dreams: a-line skirts, mini, layered, bubble, pencil, mermaid skirts, sleeves, straps, strapless tops, etc.<br/>Choose from a number of materials, patterns, colors and accessories. Design sensational outfits for clients! Discover amazing designs, patterns and accessories! Showcase your style and creativity!<br/>Let your fashion designing come alive with this dress designer game! All the fun and fashion dresses you’ve ever wanted, so don’t miss this terrific opportunity to have the most fun games for girls and make your “dress designer” dreams come true<br/><br/>Whether you Design for Clients or participate in Style Events, all you need is your unique sense of style to standout!<br/>Express your creativity by putting together designs for exclusive events. Take on top designers from around the world and become the Star Fashion Designer! Learn designing secrets from the very best in the world and become an overnight sensation. Choose from outfits, styles, prints, patterns and accessories to create your own signature style!", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:43:35", "background_image": "https://media.rawg.io/media/screenshots/1ac/1ac6f16ff08013ce4c6d2a4b5d6ea5a9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 96, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Playtouch"], "genres": ["Casual"], "publishers": [], "esrb_rating": null}