{"id": 22890, "slug": "cultures-12", "name": "Cultures 1+2", "name_original": "Cultures 1+2", "description": "\nCultures 1\n<br/>\nBefore Christopher Columbus sailed the ocean blue in 1492, the Vikings set out on their own journey of discovery and possible looting and pillaging. Having accidentally stumbled upon the Americas, they began their remarkable adventure in a new and unfamiliar land. Welcome to Cultures, where you can actively shape the destiny of your people as they struggle to gain a foothold on unfamiliar shores. Success hinges on your ability to balance achieving your goals with the needs and desires of your clan. It is up to you to nurture and guide your people: determine their names, occupations, marital partners, and, eventually, the gender of their children. The happiness of your settlers is paramount to achieving your goals in this exploration and construction-focused RTS.\n<br/><br/>\nCultures 2: Gates of Asgard\n<br/>\nThe Viking Bjarni whiles his days days away in an idyllic village on Greenland’s coast until a dark prophecy knocks on his door. In his premonition, Bjarni witnesses an epic struggle between the forces of Good and Evil. He must journey to battle the Midgard Serpent. Get ready for a quest that will take you through Europe (including England and Byzantium) and the outskirts of Baghdad. Your journey will unite the four great western cultures with a common purpose. But how long can it last? Inspired by Norse mythology, the real time strategy title, Cultures 2: Gates of Asgard, combines elements of simulation, adventure, and role-playing to immerse you in Bjarni’s quest to defeat the fabled beast.Includes Cultures and its sequel, Cultures 2: Gates of Asgard.\nOver 200 hours of absorbing god-sim gameplay with extremely detailed characters, stunning environments, and vast landscapes.\nA unique overarching story with strong adventure elements shines through in both games.\nFeatures more than 30 different trades and professions all with their own in-depth job and skills systems.", "metacritic": null, "released": "2001-07-24", "tba": false, "updated": "2019-08-28T22:07:18", "background_image": "https://media.rawg.io/media/screenshots/caa/caa8d861314ab99647415fa0372c333a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 1, "toplay": 6}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 555, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Funatics Development"], "genres": ["Strategy"], "publishers": ["Kalypso Media"], "esrb_rating": "Teen"}