{"id": 22891, "slug": "imperialism-2-the-age-of-exploration", "name": "Imperialism 2: The Age of Exploration", "name_original": "Imperialism 2: The Age of Exploration", "description": "The New World lies open before you, ripe for the taking. You must skillfully parlay discovery into riches and gather enough power to dominate Europe’s political landscape. Combining elements of resource management, economic trade, exploration, diplomatic wheeling-and-dealing, and military conquest, Imperialism 2: The Age of Exploration challenges you to leverage New World wealth into Old World dominance.\n<br/><br/>\nTo achieve world domination, you would be wise to employ a web of intricate strategies and plans within plans. If diplomacy is the order of the day, dispatch envoys to nurture critical trade agreements and treaties while deploying spies to sabotage your enemies. If you grow tired of the intrigues and double-crossings that are part and parcel of the diplomatic way, build a mighty war machine with an unquenchable thirst for conquest. Skillfully maneuver your nation and don’t forget: the object is to unite all of Europe under one flag - YOURS!An artificial intelligence that will challenge you as it takes into consideration nation-specific personalities, strategies, and diplomatic agendas.\nGive in to your imperialistic instincts as you engage in trade, diplomatic maneuvering, war, and resource management, all with an easy-to-use and intuitive interface.\nThe richness and depth of Imperialism 2 is reflected in over 40 military and civilian units and more than 100 technological advances from 300 years of history.", "metacritic": null, "released": "1999-03-30", "tba": false, "updated": "2019-08-28T22:07:18", "background_image": "https://media.rawg.io/media/screenshots/8b2/8b298514966cb09ff17848e23d61016f_EPSiS2m.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 4, "owned": 34, "beaten": 1, "toplay": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 357, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Frog City Software"], "genres": ["Strategy"], "publishers": ["Ubisoft Entertainment"], "esrb_rating": "Teen"}