{"id": 228911, "slug": "chess-chessok-playing-zone-pgn", "name": "Chess ChessOK Playing Zone PGN", "name_original": "Chess ChessOK Playing Zone PGN", "description": "Application features:<br/>* Play chess online<br/>* Play chess locally (for two players)<br/>* Play chess against AI<br/>* User friendly game interface<br/>* 12 board themes and 2 piece themes<br/>* Global chat<br/>* Chess tournaments start every 5-10 minutes<br/>* 4 independent chess ratings – for bullet, blitz, standard and chess-960<br/>* Game importing and exporting in PGN standard, local game database in PGN format<br/>* Searching for opponents<br/>* Friends list<br/>* Chess teams<br/>* Import PGN function<br/><br/>The program is designed to play chess online on ChessOK Playing Zone server (also known as ChessPlanet) - one of the most popular chess servers in the world. <br/><br/>Chess is the one of the oldest games on the Earth. Chess train your logical thinking and memory, so they became popular with children in school.<br/><br/>It is fascinating and useful to play chess online at Chess OK Playing Zone. There are more than 100 000 registered users on server, thousands of games are simultaneously online at any time of day. You can find a large number of partners of equal skill or close interests. Game supports both short and long time controls (bullet, blitz, standard). You can add favorite players to your friends list to make them easier to find later.<br/><br/>You can play chess online from mobile phone, tablet or PC. Games are saved in local database in PGN standard. Saved games can be shared via email, skype or jabber. You can play chess locally, online or watch live chess games. Online game is possible without registration, but if register, you will get your personal chess rating for three time controls – bullet, blitz and standard.<br/><br/>Application include very powerful engine for PGN import - it can handle majority of PGN features - standard notation, flash notation, SetUp tag and other. Also, it is integrated into system dialogs, so you can import PGN from clipboard, browser, messengers, another chess applications such as chess.com, chess for all, chess for android, chess-presso, chess from AI Factory and others <br/><br/>ChessOK company is also known by such products as Chess Assistant, Houdini Aquarium, Peshka, CT-ART, Chess King and 7-man endgame lomonosov tablebases.<br/><br/>Good game!", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:43:00", "background_image": "https://media.rawg.io/media/screenshots/891/891daef5f3b0c17fc39a5f2984cffe22.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 149, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Chess King"], "genres": ["Board Games"], "publishers": [], "esrb_rating": null}