{"id": 228902, "slug": "swat-force-vs-terrorists", "name": "SWAT Force vs TERRORISTS", "name_original": "SWAT Force vs TERRORISTS", "description": "Stop the terrorists before they attack you !<br/>You must defend your position against terrorists hordes.<br/>The most epic SWAT game is now available, and it's 100% free / gratis.<br/><br/>PLAY NOW <br/><br/>A group of terrorists has planified attacks. Take control of the most powerfull anti-terrorist force : The SWAT force !!! <br/>You lead a team of 2 super well trained soldiers. You have access to a number of powerfull weapons that can stop the ennemy. You can end this threat... But this is going to be an tough battle.<br/>You must protect your position. Whatever happens !<br/><br/>Lead your team to the final victory. You have a tons of different weapons available: gun, machine gun, bazooka, rifle, sniper rifle, kalashnikov, flame thrower, rocket launcher, heavy weapons, shotgun, the big bertha, bombs, barbed wire, mines, sandbags, defense's turret ... and many more...<br/><br/>Every weapon has different characteristics and you have to play wisely to defeat the terrorists. Make sure the enemies don’t pass your defense, or you will regret it!!!<br/><br/>FEATURES<br/>•         Realistic battles<br/>•         Build your defense into an unbeatable fortress <br/>•         Upgrade your weapons<br/>•         Hours of gameplay with over 40 levels<br/>•         60 weapons and bonus to unlock<br/>•         Compare your score with your friends and compete against them<br/>•         Leaderboard<br/><br/>PLAY NOW", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:43:03", "background_image": "https://media.rawg.io/media/screenshots/3d6/3d6d0b5146ef36fb59ed05f3816566f5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 224, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Playtouch"], "genres": ["Action"], "publishers": [], "esrb_rating": null}