{"id": 22909, "slug": "omikron-the-nomad-soul", "name": "Omikron: The Nomad Soul", "name_original": "Omikron: The Nomad Soul", "description": "<p>Responding to the desperate pleas of a mysterious character from another dimension, your soul must enter the dark and futuristic city of Omikron. This is but the beginning of an epic adventure through an increasingly strange and dazzling parallel world. You must solve the ultimate mystery: why are you in Omikron and how can you get out? Think, fight, and interact with awe-inspiring environments to defeat the menacing demons that are trying to stop you. Experience the life in an alternate reality with everything it has to offer--including the secret musical performances by The Dreamers, a band of rebels led by the Omikronian incarnation of David Bowie.<br />\nOmikron: The Nomad Soul is a futuristic 3d-action adventure like no other. Combining a deep game plot with adventure, exploration, action, combat and role-playing elements, the Omikron experience will captivate you from the moment you enter the strange and wonderful world beyond our own. Only using all of your combined skills will bring you deliverance from this exotic dimension.<br />\nExperience &quot;virtual reincarnation&quot;, the ability to move directly into the body of the last character you touch before dying.<br />\nAdventuring at a whole new level, Omikron combines puzzle solving, action, shooting, combat and role-playing elements in a deep and engrossing storyline.<br />\nComplete freedom to explore a vast city in real-time 3D with hundreds of fully-animated inhabitants and vehicles.</p>", "metacritic": null, "released": "1999-10-31", "tba": false, "updated": "2023-05-01T00:02:08", "background_image": "https://media.rawg.io/media/screenshots/f8e/f8ed683b124312b8e5ea1aecb86bb780.jpg", "website": "", "rating": 3.97, "rating_top": 5, "added_by_status": {"yet": 36, "owned": 118, "beaten": 15, "toplay": 26, "dropped": 16, "playing": 5}, "playtime": 1, "achievements_count": 0, "ratings_count": 35, "suggestions_count": 468, "game_series_count": 0, "reviews_count": 35, "platforms": ["Dreamcast", "PC"], "developers": ["Quantic Dream"], "genres": ["Action", "Adventure", "RPG"], "publishers": ["Square Enix", "Eidos Interactive", "small", "(digital)"], "esrb_rating": "Mature"}