{"id": 22907, "slug": "magic-carpet-2-the-netherworlds", "name": "Magic Carpet 2: The Netherworlds", "name_original": "Magic Carpet 2: The Netherworlds", "description": "After restoring balance and order to the shattered realms in Magic Carpet, you retired to live a peaceful life content in the knowledge that you have saved your people. Your idyll won’t remain peaceful for long, however, as Vissuluth the Dark One emerges from the Netherworld. The Netherworld is a place where demons and lost souls dwell and the Master Demon has grown powerful enough to bridge the great gulf between life and death. The Dark One and his minions threaten the world of men and it is up to you, under the guidance of your old master Kafkar, to once again take up the wizard’s mantle. Prepare to ride the Magic Carpet into terror and danger and emerge victorious!\n<br/><br/>\nWield powerful magics, construct castles that grant you more power as you upgrade them, shape and twist the land as you see fit--the world is your oyster in Magic Carpet 2: The Netherworlds. Embark on a magic carpet ride in first-person perspective to gather mana to power your spells, such as Volcano, Meteor, Metamorph, or Invisibility. Last but not least, wage war against the Vissuluth and his evil wizards, each more powerful than the last. Will you rise once again to save humanity or will you let ultimate evil reign? Take on your magical quest in this unique flying action game from Peter Molyneux's Bullfrog Productions.A vast array of wickedly awesome spells that can be upgraded for even more destructive power!\nFeatures 25 jam-packed levels with sub-missions that keep the action going!\nA plethora of monsters and demons to battle against: five-headed hydra, troglodytes, sentinels, cymmerians, and manticores!", "metacritic": null, "released": "1995-09-07", "tba": false, "updated": "2019-08-28T22:07:17", "background_image": "https://media.rawg.io/media/screenshots/a52/a527a71dc6ebbbe832e41f08cb7123aa.jpg", "website": "", "rating": 3.89, "rating_top": 4, "added_by_status": {"yet": 6, "owned": 78, "beaten": 2, "toplay": 2, "dropped": 3}, "playtime": 3, "achievements_count": 0, "ratings_count": 9, "suggestions_count": 385, "game_series_count": 0, "reviews_count": 9, "platforms": ["PC", "macOS"], "developers": ["Bullfrog Productions"], "genres": ["Action", "Shooter"], "publishers": ["Electronic Arts"], "esrb_rating": "Teen"}