{"id": 229145, "slug": "good-night-hippo", "name": "Good Night Hippo", "name_original": "Good Night Hippo", "description": "Very often, when the night comes and everybody says goodnight, you don't want to sleep. It is a feeling that something is missing. And really, there is not always enough good mod, one beautiful picture , a small interesting task, and, of course, an interesting story - good night fairy tale are also missing. That's why our beloved Hippy has a special fairytale. Hippy has come to wish goodnight and gift an interesting interactive fairytale for all members of the family.<br/><br/>Educational games for kids and family are renewed with a new interesting story about Hippo town. Today we are going to learn what are they doing before going to sleep. All Hippo citizens are really different and have a lot of various tasks, which they need to do before sleeping. Somebody likes to play and watch beautiful pictures in the book. Another citizen likes to invent interesting stories, and somebody just sets a noisy alarm, to wake up earlier and do nothing. Visit every citizen and help them to manage their urgent tasks. Perform interesting tasks, put the citizens to their beds and say them goodnight. When all the citizens are already asleep, you could also go to bed. When the night is outside, and you don't want to sleep, interactive Hippo lullaby will help you. A kind Hippo wish goodnight to everybody. And don't forget to set an alarm not to oversleep in the morning and not to miss a lot of interesting and important things!<br/><br/>Our interactive good night fairy tales are suitable for all the ages, for both kids and adults. This interactive story is suitable for all the family! Furthermore, this new game, as well as all our educational family games, is absolutely for free! Stay tuned, stay with us and have fun playing our free educational family games with your relatives.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:42:25", "background_image": "https://media.rawg.io/media/screenshots/44d/44de59012a6e01eebffde7028105bbd2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 89, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Hippo Baby Games for Girls and for Boys"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}