{"id": 229173, "slug": "school-of-chaos-online-mmorpg", "name": "School of Chaos Online MMORPG", "name_original": "School of Chaos Online MMORPG", "description": "Teachers are eaten by zombies!  There are no rules in this chaotic school!<br/><br/>FIGHT for RESPECT in this Online Multiplayer School game.  <br/>Make friends!  Train hard!  Gear up!  It's the survival of the fittest!<br/><br/><br/>Introduction:<br/><br/>This is the beginning of a very fun and exciting MMORPG journey.  The journey starts off at a school that has become chaotic.  The teachers are gone.  Probably eaten by zombies... Now the kids are free to do what they please!  Sounds like fun?  <br/><br/>But wait... There are consequences that come with not having any authorities around.  Bullies used to back off when a teacher walks by.  What happens now?  What would you do in such a school?  It seems that we're back to the basics where it comes down to the survival of the fittest!<br/><br/><br/>Features:<br/><br/>• Play with thousands of online gamers<br/>• Quest Maker - allowing you to make your own quests for others to play<br/>• 3D Open world sandbox environment allows you to free roam an entire school<br/>• Fully customize your character with over 5 billion different possibilities<br/>• Real-time market that enables true economy<br/>• Over 30 different fighting moves to crush your enemies with in real-time<br/>• Loads of weapons and armors to aid you along your journey<br/>• Upgrade your equipment to make them more powerful<br/>• Meet friends, or enemies<br/>• Create or join a clan to wage wars<br/>• Buy houses, furniture, then throw a house party with friends<br/>• Buy pets and train them to fight for you<br/>• Craft rare items of various types<br/>• Actively under development which means this game will evolve greatly to meet your MMORPG desires<br/><br/> <br/>TROUBLE?<br/><br/>** If the game is SLOW or FREEZES at the start, please reboot your device to free up more memory to play the game. Any problems please leave a detailed description in the developer support below so we can get back to you.  Thanks! **", "metacritic": null, "released": "2013-02-24", "tba": false, "updated": "2019-09-09T04:58:32", "background_image": "https://media.rawg.io/media/screenshots/cbe/cbe4c3106a8e39ab374aef422cece5da.jpg", "website": "https://www.youtube.com/watch?v=WoUjFIpV8Ug&feature=youtu.be", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 235, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["VNL Entertainment"], "genres": ["Action", "RPG"], "publishers": ["VNL Entertainment"], "esrb_rating": null}