{"id": 229135, "slug": "masha-and-the-bear-good-night-2", "name": "Masha and the Bear: Good Night!", "name_original": "Masha and the Bear: Good Night!", "description": "Today we will say good night and help go to bed all the characters from the cartoon Masha and the Bear! Bedtime stories and interactive lullabies are a special type of apps from the series of educational kids games. There are interactive stories with a plot, puzzles and adventures, your task is to put characters to bed and wish them goodnight. These games are interesting for boys and girls. Interactive lullabies are much better than ordinary bedtime stories or cartoons.<br/><br/>There is night and some lights are visible in the forest where Masha and the Bear couldn’t sleep. All the other animals don't sleep too. Every character, from the cartoon Masha and the Bear, has a lot of urgent things which they should do before going to bed. Somebody wants to put the things in order, another one wants to count starts. One character wants to watch cartoon, or to listen to the lullaby, and another character has come to the Masha’s house to take a shower and to listen to calm and pleasant music before going to sleep. Today all the stories will be unusual and very interesting. Bedtime stories and interactive lullabies are much better, than just cartoons. You are going to be the main character of the most interesting stories ever and write a new exciting fairytale about your own adventures in our kids game.<br/><br/>Anybody, who likes cartoons and adventures, Masha and the Bear invite to a new interactive kids game Bedtime stories! Make all the animals go to bed and wish them goodnight. Play with all the family members! Have a lot of positive emotions and spend fun and useful time together. Stay tuned and play with us. Our educational kids games for boys and girls will always make you and your toddler happy and you will always have a good mood playing our educational games.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:42:27", "background_image": "https://media.rawg.io/media/screenshots/1d2/1d23adc31795881c6f933e5d3e0602ef.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 227, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Hippo Baby Games for Girls and for Boys"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}