{"id": 229251, "slug": "pirate-games-for-kids", "name": "Pirate Games for Kids", "name_original": "Pirate Games for Kids", "description": "Kids likes any exciting adventures. But most of all children like adventures with pirates and treasures. Every child wants to step on the Black Pearl and go on through the Caribbean Sea to the island where Captain Flint had hidden his treasures. It is so interesting to search for treasures! But our little treasure seekers are not yet ready to go on severe Caribbean Sea. And today you can't find the island with real pirates. So what to do? To leave all the pirates and treasure seekers in our children dreams and fantasies? Of course not! Our curious Hippo give the opportunity for all the kids to find pirate treasures, not going out of the house. <br/><br/>Educational Hippo games are renewed with a novelty. We will step on the Black Pearl ship and go to the big pirate archipelago. Captain Flint was very rich and digged in here a lot of trunks. Let's find them all! We will visit island after island and find all the hidden treasures. And between the islands we will fight for trunks of the sunken pirate ships. But remember, we are not the only pirates here! Find enemies! Let's go to seek the treasures at once! All pirate treasures will be ours! Not Kraken, not Cthulhu never stop us! Yo-ho-ho!<br/><br/>Try our novelty and gift your kids happiness and pirate adventures. Follow Hippo and stay tuned. Our developing games for boys and girls will always make you and your kids happy!<br/><br/>Visit us:<br/>Website: http://psvgamestudio.com<br/>Facebook: https://www.facebook.com/%D0%9F%D1%81%D0%B2-%D0%A1%D1%82%D1%83%D0%B4%D0%B8%D1%8F-490743064607227/<br/>Twitter: https://twitter.com/Studio_PSV<br/>Youtube: https://www.youtube.com/channel/UCwiwio_7ADWv_HmpJIruKwg<br/>E-mail: hippo.kidsgames@gmail.com", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-24T20:53:22", "background_image": "https://media.rawg.io/media/screenshots/6d7/6d74f154f5cec37a18aae74edc05ca2f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 128, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Hippo Baby Games for Girls and for Boys"], "genres": ["Board Games"], "publishers": [], "esrb_rating": "Everyone"}