{"id": 229209, "slug": "solitaire-journey", "name": "Solitaire Journey", "name_original": "Solitaire Journey", "description": "Brand New Solitaire Journey <br/>In this Solitaire Journey, it brings you a refreshed brand new designed solitaire UI with different world famous scenic spots, like Mount Fuji, Tokyo Tower, The Great Wall, The Pyramid, The Eiffel Tower, etc. During this card game journey, you will both enjoy the excitement of solitaire and the beautiful scenery of the world with immersing background music and pictures!<br/><br/>Based on Classic Gameplay<br/>Based on the classic gameplay, Solitaire Journey keeps the game true to the spirit of classic TriPeaks Solitaire, and it provides you hundreds kinds of different TriPeak boards and various solitaire journeys in your hands!<br/><br/>Addictive and Challenging<br/>We added tons of new features into this Solitaire Journey including Undo(find missed  cards), Unlock Areas(levels), Shuffle, Shroud Cards, etc. We believe you will be addicted to enjoy this TriPeaks Solitaire Journey in a completely new way with those challenging features.<br/><br/>Beautiful Design &amp; Intuitive UI<br/>By removing all the unnecessary features, our Solitaire Journey is the most easy-to-play with clean and intuitive designs. The blossoms of Japanese sakura, the snow-white of the Great Wall and the sunset of the Eiffel Tower will surprise you by the moments you are totally immersed in this Solitaire Journey! More scenic spots will be added in later versions.<br/><br/><br/>►  HOW TO PLAY<br/>✔️️Unlock Areas: Achieve the required stars to unlock the next area.<br/>✔️️Undo: Tap \"Undo\" icon to try again, you can play the card you've missed.<br/>✔️️Combo Bonus: Additional bonuses will be awarded for continuous removing the cards.<br/>✔️️Shuffle: Use “Shuffle”s, you can reorganize the cards.<br/>✔️️Shroud Cards: In order to remove the Shroud Card(s), you need to use the right card to remove the shroud first.<br/>✔️️Keys &amp; Locks: In order to remove the Locked Card(s), you need to remove the Key Card(s) first.<br/>✔️️Blocked Cards: Blocked Card(s) will be displayed when you get 4 combos.<br/><br/>►  FEATURES<br/>✔️️Hundreds of levels with fully challenges<br/>✔️️Clean and user-friendly menus <br/>✔️️Big and easy to see card<br/>✔️️Single tap or drag&amp;drop to move card<br/>✔️️Exercise your brain to remove obstacle cards<br/>✔️️Use different tools for help to solve difficulties<br/>✔️️Collect more stars to unlock more areas to enjoy more scenic spots<br/>✔️️Reward for you everyday, bonuses for constant sign-in<br/>✔️️Auto-save game in play<br/>✔️️Play anywhere and anytime<br/>✔️️Offline play and no data cost<br/>✔️️More features to come!<br/><br/>If you like playing Tripeaks or other Solitaire card games then you will love this Solitaire Journey! It is the best Solitaire game in hands! Highly Addictive and 100% Fun, Download now for FREE!<br/><br/>►  FEEDBACK<br/>✔️️Follow us on Facebook  <br/>https://www.facebook.com/273180196510044/<br/>✔️️Email your feedback to <br/>support@queens.freshdesk.com", "metacritic": null, "released": "2015-12-14", "tba": false, "updated": "2019-10-22T14:05:38", "background_image": "https://media.rawg.io/media/screenshots/1c2/1c2ecff73d812c34377bb1bf2021a504.jpg", "website": "http://www.qublix.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 268, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Queens Solitaire Games", "Qublix"], "genres": ["Board Games", "Card"], "publishers": ["Qublix"], "esrb_rating": "Everyone 10+"}