{"id": 229210, "slug": "bedtime-stories", "name": "Bedtime Stories", "name_original": "Bedtime Stories", "description": "We continue to release incredibly popular game series Bedtime stories! This time, free educational kids games are expanded with a new Lullaby. Characters of our story will be funny characters from our favorite seaside Hippo town. And not only all the members of this funny family are going to take part in this game. Today we will visit a mysterious pirate ship “Red Snapper\" and find out what Bedtime stories the inhabitants know. Are you ready for new exciting stories and adventures? Then Lullaby is waiting for you!<br/><br/>Lullaby is a special type of games for girls and boys. Like any bedtime story, this app is designed to help the player to fall asleep. Simple gameplay makes it easy. A favorite cute characters create wonderful mood before going to bed. You will see the sweetest dreams. Our free educational kids games can make that real.<br/><br/>In a kids game series Bedtime Stories for boys and girls, player needs to do some simple actions to put a funny character to bed. This time we will play not only with one character, but the whole Hippo family and mysterious inhabitants of the pirate ship \"Red Snapper\". Everyone does something special before going to bed. One needs to tidy up the room before going to bed, and other has to finish the work. Papa Leo, for example, likes to write exciting stories before going to bed. And our grandfather is a famous developer! He looks through his telescope at the night sky and opens new unknown stars. You need to help all our characters. And, of course, our Lullaby includes educational elements. All our apps are, first of all, educational kids games.<br/>Try our new game from series of free educational kids games. Have a lot of positive emotions! Stay tuned and stay with us. Our free kids games will always make you happy!", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:42:16", "background_image": "https://media.rawg.io/media/screenshots/a68/a68d733eae5fb7d915fef4282c270e02.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 71, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Hippo Baby Games for Girls and for Boys"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}