{"id": 22922, "slug": "chaos-overlords", "name": "Chaos Overlords", "name_original": "Chaos Overlords", "description": "<p>“The future is chaos and chaos is you!” - The Exploited “Chaos is My Life”.<br />\nThe World United Solidarity (WUS) has made life boring in the year 2050. No sex, no booze, not even candy cigarettes were allowed. The people were tired of being WUS-sies, they had enough of censorship on TV and on the internet. Enter the Chaos Overlords. Former crimelords and CEOs, these leaders decided to capitalize on the people by creating chaos - selling the populace all the drugs, high-caliber weaponry, and pornography they desired. The cities have become battlegrounds as the Chaos Overlords vie for power as they attempt to destroy each other.<br />\nYou are a Chaos Overlord. The city lies vulnerable before you, waiting for all the chaos that you can bring. Wage a strategic war of influence on an 8x8 grid that represents city blocks. Hire gangs at the beginning of each turn and seize control of the city, block by bloody block. Research new items for your gangs to equip so they can dominate your enemies’ gangs in combat. It’s time to make some chaos, so go out there and kick some neck!More than 70 unique gangs, such as the Disgruntled Postal Workers, Renegade Nuns, or the Bankers.<br />\nSow chaos and disorder with more than 50 weapons, performance-enhancing items, and armor types.<br />\nA complex strategic layer of gameplay where you can snitch on your opponents, bribe the police, and engage in gang-to-gang battles.</p>", "metacritic": 70, "released": "1996-04-29", "tba": false, "updated": "2022-01-27T08:59:14", "background_image": "https://media.rawg.io/media/screenshots/401/4010f15d83c849c802965487d93cd97d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 11, "beaten": 1, "toplay": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 316, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Stick Man Games"], "genres": ["Strategy"], "publishers": ["Evolution Interactive"], "esrb_rating": null}