{"id": 229229, "slug": "free-games-masha-and-the-bear", "name": "Free games: Masha and the Bear", "name_original": "Free games: Masha and the Bear", "description": "A NEW GAME! Here we proudly present for your attention free family games Masha and the Bear. Do your kids like cartoons? And are they getting tired of the monotonous gameplay very quickly? And you don't want to waste your time to find a place where to download small games? There is a solution! Free family games Masha and the Bear is a series of great games for kids and adults!<br/><br/>Everybody likes to watch cartoons about funny adventures of the favorite characters. But now you and your kid have a great opportunity to take part in these adventures by yourself. You will find a large variety of games. Start to solve large and colorful puzzles, which images are the moments of the favorite cartoon. Kids will be surprised to find that our puzzles are different from standard games of this type. Try simple but funny scratching games with images from the cartoon. But if you will be bored with collecting images, start to pop the balloons flying out of the house. And you have to pop the balloons quickly to have time for collecting a series of toys and send them on a fascinating journey in a hot air balloon!<br/><br/>Both educational and entertaining elements are combined in Puzzles and Memories (Pairs). They develop visual memory and logical thinking. Game Connect the Dots is good for the development of movement coordination. Сonnect the dots and get as the reward a funny character from the cartoon. Kids as well as their parents like scratching games, especially when these scratching games are somehow connected with the favorite cartoons characters. Kids and adults like watching cartoons that’s why this game is suitable for all the family! But the biggest surprise for those who love cartoons, is waiting at the play Masha- photographer. Kid has to take a beautiful picture with the heroes of the series Masha and the Bear. But if you are getting tired to photograph, start again to play Spot the Pair, Pop the Balloons, Scratch pictures, jigsaw Puzzles or Connect the Dots with Kids favorite cartoons!<br/><br/>Go on for an adventure! Bring yourself and your kid a lot of joy. Our family games will surprise you. Play our family games Masha and the Bear absolutely for free!", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:42:13", "background_image": "https://media.rawg.io/media/screenshots/15d/15d3dd92c9ee667c2ccc6056e504fb8c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 261, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Hippo Baby Games for Girls and for Boys"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}