{"id": 229333, "slug": "sfstellacept-onlinemmorpg", "name": "[SF]Stellacept Online[MMORPG]", "name_original": "[SF]Stellacept Online[MMORPG]", "description": "March 5 2019 Update Notice!<br/><br/>▼New Map [Inside Cathedral 16th floor to 20th floor] has been added!!<br/>▼New Monster [Sharud Tribe] appears!<br/>▼The Defeat Bonus Campaign is on!<br/><br/>----<br/>★What is the free-to-play RPG Stellacept Online★<br/>Stellacept Online is a beautiful game in which you can inflict<br/>devastating combos by taping your screen at the right moment,<br/>or unleash a terrible power with the Burst Points earned by beating enemies.<br/>Chat in real time with other players to cooperate and to help each other!.<br/>Play as a soldier who fights against the terrific Tarazed to save the people of Sadalsuud.<br/>Become strong by developing and evolving your Stella.<br/><br/>★About transferring characters between Android devices★<br/>Google IDs (Google Accounts) are used to verify the Android versions of Stellacept Online.<br/>Setting up with a Google Account can restore your account data in the following cases:<br/>・Synchronizing with a new device.<br/>・After having reinitialized your device, or after a breakdown.<br/><br/>★Destroy your enemies with breathtaking combos and skills!★<br/>An intuitive battle system with an innovative combo system which provides a lot of freedom of action.<br/>Tap your screen at the right moment to trigger the special skills!<br/><br/>★Anyone can experience exhilarating moments thanks to the Burst System!★<br/>Unleash a phenomenal power by using the Burst Points collected by defeating enemies and beat the mightiest monsters!<br/><br/>-------------------------------------------- <br/>**Please note**<br/>・This game is to be used online.<br/>・Loading times may vary depending on the device used.<br/>・The game may not be available depending on certain circumstances (eg: customer's network failure, emergency maintenances).<br/>・We please you to behave correctly and to not annoy other playerｓ while playing.<br/>・Latencies and disconnections may happen in crowded maps.<br/>・Please try the game for free to check its<br/>compatibility with your equipment.<br/>・If your device gets hot while playing, quit the game<br/>and check your configurations before resuming.<br/>・We cannot provide support in case of using application which the manufacture does not guarantee operating, including rooting/jailbreaking apps.<br/>-------------------------------------------- <br/>Stellacept Online, the free-to-play SF/fantasy MMORPG with a stunning and kicky gameplay!", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:41:53", "background_image": "https://media.rawg.io/media/screenshots/652/652b8836182faf1f7b3440a4f6e231a9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 211, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Asobimo"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}