{"id": 229321, "slug": "masha-and-the-bear-kids-fishing", "name": "Masha and the Bear: Kids Fishing", "name_original": "Masha and the Bear: Kids Fishing", "description": "A new amazing novelty from Masha and the Bear! This time the beloved cartoon invites you to the interesting game Fishing! Masha and the Bear is a favorite cartoon of the smallest viewers all around the world. It is so interesting and exciting to watch stories about favorite heroes. But it is much more interesting to go on adventures by yourself and to go through all the task with Masha and the Bear, tasks which was prepared with  new game Fishing!<br/><br/>Educational games for boys and girls are not just exciting but very useful. They develop attention, speed of movement, imagination and agility. Playing these games, kids will learn how to count and distinguish colors, kids also will get a lot of skills useful in life. Such games for kids is a great preparation for school! And this school preparation will be an unobtrusive process with a lot of fun and happiness in the process of exciting game. We can prove that this is an easy and not a bit complicated process to learn how to count, distinguish colors and learn some useful skills. But this is not the end! Today we will not only catch fishes but also discover new types of underwater inhabitants! Diverse gameplay of a new fishing game with original ways to catch a fish will be loved by all the kids and adults! Only our forest pond has so many forms and colors of fishes. Put all the tasks away and catch fish together with us! Favorite cartoon and its amusing characters are waiting for you!<br/><br/>This new game, as well as all our games for kids, is absolutely for free. Are you ready to get through all the tasks of the game? Then Masha and the Bear invite you to the exciting journey! Stay tuned, stay with us, play our educational games for boys and girls with your kids and have a lot of fun and happiness together.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:41:55", "background_image": "https://media.rawg.io/media/screenshots/f2d/f2dd0baba96813658e0467e2c2eb9d4d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 179, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Hippo Baby Games for Girls and for Boys"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}