{"id": 229350, "slug": "ball-alien", "name": "Ball Alien", "name_original": "Ball Alien", "description": "Balance game with amazing cool 3D graphics, animation effects, relaxing background score, clever level complexity, addictive and challenging gameplay.<br/><br/>Ball Alien successfully combines the elements of arcade and puzzle. An errant ball is the only character travelling in space. This ball story originated in the early 80s with the game Marble Madness and continued by Ballance in 2000s. <br/><br/>STORY<br/><br/>A long time ago in a galaxy far far away... a wonderful journey of the ball continues.<br/><br/>No one knows for certain why and when this story was originated. The nature of the ball remains unknown as well. Perhaps it is the creation of an ancient civilization, wandering through time and space. Or just a figment of imagination.<br/><br/>Whatever it is, you have an opportunity to plunge into a new story, see the reality by its eyes, feel another unexplored side of life. And, of course, get an unforgettable experience.<br/><br/>What are you waiting for? Balance the ball!<br/><br/>The main goal of the game is to pass through all the levels balancing and reach the maximum score. Various elements and obstacles are being introduced as one moves onto new levels, meaning that the complexity and level of puzzle solving required are gradually increasing as the game progresses.<br/><br/>You will find 5 lives to spend and the unique ability to switch material and physical characteristics of the ball turning it light, medium or heavy. However, this feature is to be used only at special transformation points.<br/><br/>FEATURES<br/><br/>• Balance game<br/>• Classic gameplay<br/>• Deep atmosphere<br/>• Modern graphics<br/>• Realistic physics <br/>• Intuitive controls <br/>• No time limits<br/>• Free-to-play<br/><br/>Ball Alien is accessible both for kids and adults, easy-to-learn and control. Vivid graphics and addictive gameplay contribute to quick relaxation and bright emotions.", "metacritic": null, "released": "2015-06-11", "tba": false, "updated": "2019-10-22T14:13:55", "background_image": "https://media.rawg.io/media/screenshots/f7a/f7aa106c2df790caf4bbf29eb0abe7dc.jpg", "website": "https://www.facebook.com/BallAlien?ref=hl", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 126, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Bouland Games", "Alexander Bouland"], "genres": ["Adventure", "Puzzle"], "publishers": ["Alexander Bouland"], "esrb_rating": null}