{"id": 22938, "slug": "shadow-warrior", "name": "Shadow Warrior (2013)", "name_original": "Shadow Warrior (2013)", "description": "<p>Shadow Warrior 2013 is a reboot of 1997 game with the same name on it, Shadow Warrior. Setup is pretty simple - Lo Wang, our protagonist in a very specific quest. He is a hired assassin with a mission. He has to buy a very ancient katana with powers to kill immortals. When arrives at the place of the deal, everything turns in quite a disaster. Demons attack and slay everything in its path and Lo Wang decides to cooperate with them in order to bound three swords into one, making this very old and ancient katana a real and unstoppable force. </p>\n<p>Even though games setup is in modern days, it&#39;s been very firmly connected with old Asian mythology. Shadow Realm is filled with some very famous Asian demons that play key parts in a plot. Defeating hordes of demons is quite fun as you have plenty of ways to do so. Wang can shoot his enemies with weapons like pistols, submachine guns or even rocket launchers (some of this weapon can be dual-wielded) or slash them with your katana. High dependent on controls and patterns can create some unique attacks, and makes killing your enemies a very fun occupation.</p>", "metacritic": 73, "released": "2013-09-25", "tba": false, "updated": "2024-04-06T12:22:45", "background_image": "https://media.rawg.io/media/games/907/90757eaa9dc7c5cf7c47bf4960843999.jpg", "website": "http://www.devolverdigital.com", "rating": 3.64, "rating_top": 4, "added_by_status": {"yet": 180, "owned": 2640, "beaten": 389, "toplay": 97, "dropped": 225, "playing": 29}, "playtime": 4, "achievements_count": 193, "ratings_count": 573, "suggestions_count": 613, "game_series_count": 4, "reviews_count": 580, "platforms": ["PC", "iOS", "Xbox One", "PlayStation 4", "Linux", "macOS"], "developers": ["Devolver Digital", "Flying Wild Hog"], "genres": ["Action", "Shooter"], "publishers": ["Devolver Digital", "GHI Media"], "esrb_rating": null}