{"id": 229349, "slug": "kids-music-party-hippo-super-star", "name": "Kids music party: Hippo Super star", "name_original": "Kids music party: Hippo Super star", "description": "All boys and girls, who want to be the best at the school party and to be a real super star, should create their own music band! It doesn't really matter whether you would like to be rock star or pop star. Fans, noisy concerts and hit songs are waiting for you anyway. Hippo has created a music band especially for kids! This is a realistic and exciting party-simulator, that has everything, such as fashion and stylish dress up, various musical instruments, outfits for stylish looks for boys and girls, exciting melodies for kids and adults and other things. And all you need to do is make a musical party successful and collect likes from your fans!<br/><br/>The peculiarities of the game \"Kids Music Band\":<br/><br/>- a lot of levels and concerts in different cities<br/>- various songs and melodies<br/>- rock, pop, disco, techno, rock-n-roll<br/>- dress up for pop star, rock star and disco star<br/>- kids musical school party for boys and girls<br/>- different musical instruments with unique sounds<br/>- star dressing room and dress up to create wonderful stylish outfit.<br/>- dynamic simple gameplay<br/>- a lot of unexpected things and surprises<br/>- beautiful and funny Hippo characters<br/><br/>Is your music band ready for success? Then a kids party for boys and girls starts right now! And remember, you are a super star! And everything you need is to make noisy concerts, collect likes and be the best for your own fans, create stylish outfit with a help of star dress up!", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-31T05:01:29", "background_image": "https://media.rawg.io/media/screenshots/490/490b637ab5ad449486a16a3ed24fcc80.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 224, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Hippo Baby Games for Girls and for Boys", "Hippo Kids Games"], "genres": [], "publishers": [], "esrb_rating": "Everyone"}