{"id": 229315, "slug": "cooking-games-feed-funny-animals", "name": "Cooking games: Feed funny animals", "name_original": "Cooking games: Feed funny animals", "description": "Our beloved Hippo likes to cook, create new dishes and share them with friends. It is so funny and exciting to feed animals! Funny kitchen and canteen are waiting for you! Everybody likes to eat something tasty. There are so many different dishes, from spaghetti till culinary masterpiece, a big birthday cake! Welcome to curious Hippy, and find different kitchen surprises that kitchen has prepared for us. <br/><br/>Today we will cook a lot of different dishes! Let’s make a dinner party with different culinary masterpieces. Then we will go to the forest, make there a picnic and feed Hippy’s friends. Also we will celebrate Ji’s birthday in the pirate café, where we will try a real pirate cuisine! When you will be bored with cooking, let’s go fishing with friends! During fishing we will not only eat spaghetti, but also a delicious fish broth. First of all you need to open secret recipes, collect all the ingredients for special dishes, and then you can feed the animals spoonful. Adventures await us! Welcome to Hippo Canteen! Nobody will be hungry after all!<br/><br/>Play educational family games together with Hippo! It is funny and what’s more, it is very useful, because our aim are good mood and the development of a player. Players will get fun and excitement together with development. Stay tuned and follow Hippo! Our free family games, will always make you happy.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:41:55", "background_image": "https://media.rawg.io/media/screenshots/a7e/a7e75de8cd1b4cb62d49f392709e6687.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 133, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Hippo Baby Games for Girls and for Boys"], "genres": ["Casual"], "publishers": [], "esrb_rating": null}