{"id": 229394, "slug": "horror-sniper-clown-ghost-in-the-dead", "name": "Horror Sniper - Clown Ghost In The Dead", "name_original": "Horror Sniper - Clown Ghost In The Dead", "description": "Horror sniper clown in the dead is a jungle survival horror game, it is a first-person survival horror in a realistic 3D world. The story is nerve breaking and you got to conquer your fears to play this terrifying game.<br/><br/>So it all started when Sam went to the jungle for hunting, he kept on hunting till it got late in the evening. Realizing it pretty late, he jumped into his jeep and drove it pretty fast that he couldn't see what was in front of him. His jeep crashed and when he wake up, he finds himself caught in a trap. It was all dark and he couldn't see a thing. The only way to escape from trap was to cut it but it wasn't an easy job as when he started cutting the trap, he found himself in the middle of haunted area filled with creatures and paranormal activities. Now Sam has only one option to survive this horrific night, to cut the trap and run towards the nearest hut, but reaching to that hut isn't easy either as he has to fight with cursed creatures, monsters and ghosts. One thing Sam isn't aware of is that this setup was created by the scary clown who has so many victims in the past. He is a blood hungry clown and he'll be merciless if he catches you, he is a serial killers so beware. Once you set yourself free from the trap, there is a haunted house which might be a place you want to go in order to survive the night and wait for the day light. The door is closed and you need to be careful as you don't know what's inside waiting for you. <br/><br/>Your mission involves freeing yourself from the trap and getting rid of the evil ghosts. You are hero escape from blood killer with magical powers. An all new survival escape simulator game for the survival game lovers filled with horror and paranormal activities. If he catches you, he will kill you. There are many horror, frightful activities at evil mansion of rivals. There are houses haunted by a resident devil. Survival in this wilderness is a tough. Breakout from this mysterious evil village of horror residence and neighbors with monster assassin. If you like horror games with unexpected twists you will love this point adventure game. This hero escape blood killer battle adventure is very challenging and engaging. You can't determine who is angel who is devil. Extraordinary atmosphere, nervous scenario and blood-curdling flow.<br/><br/>Experience deep, dark atmosphere of horror and terror with unsettling ambient music and freaky, unearthly ghost voices and sounds. <br/><br/>Special Features<br/>Amazing 3D Haunted Jungle<br/>Interesting Game Play<br/>Smooth and intuitive controls<br/>Thrilling and challenging Missions<br/>Horror music &amp; sounds<br/>Fearful and tension atmosphere<br/>Paranormal horror and creepy game<br/>Live in the horrific horror stories and feel the scream sounds<br/>If you are a fearless player, you will face with your phobias in a terrible and haunted house<br/>Do not look scared in front of your demon enemy", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:41:44", "background_image": "https://media.rawg.io/media/screenshots/8b7/8b75e28d4184d5ea51717c6d4b925f57.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 168, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Blockot Games"], "genres": ["Action"], "publishers": [], "esrb_rating": null}