{"id": 229502, "slug": "poker-games-world-poker-club", "name": "Poker Games: World Poker Club", "name_original": "Poker Games: World Poker Club", "description": "The multi-million player social poker game awaits! Do you have poker friends who play deluxe poker games online free? Play free poker card games - Omaha and Texas Holdem - and compete in the Weekly Club tournament! Call them out!<br/><br/>Find yourself in the world of bets, stakes and huge winnings in poker world series! <br/>Finally, enjoy the stylish interface and friendly atmosphere designed for deluxe poker card games free!<br/><br/>To hype up the experience and thrill in poker card games free, we’ve prepared all sorts of surprises and free bonuses for our players:<br/>• complete themed collections by playing poker free online in different casino rooms and exchange them for game currency - feel the atmosphere of a real texas holdem poker deluxe;<br/>• play poker online with friends live, send gifts to them and receive kind gestures in return;<br/>• use the live chat to talk to other players while playing poker free online; <br/>• aim high in the top charts of our club wpt poker.<br/><br/>Prove to millions of other players in poker free online that you’re the king of your poker card games in World Poker tournament games. Let’s play poker king Texas Holdem free and free Omaha poker games! Once you’ve joined the club of poker kids pro, you’d never want to leave!<br/><br/>FEATURES:<br/>• Free chips and other deluxe bonuses<br/>• Card classics: Texas Holdem poker deluxe and free Omaha poker games (try poker king texas holdem free)<br/>• Weekly tournaments (world series of poker)<br/>• Sit-n-Go tournaments<br/>• World Poker tournament games (poker world series tournament)<br/>• Play as a guest or via your accounts at Facebook or Google+<br/>• Player ratings - become a poker king!<br/>• Stylish and intuitive interface<br/>• World Series of poker<br/>• Gifts, awards and collections<br/><br/>Download the poker king pro game to play poker online with friends live and become a true member of club wpt poker!<br/><br/>This product is intended for an adult audience.<br/>This product does not offer real money gambling or an opportunity to win real money or prizes.<br/>Practice or success at social casino gaming does not imply future success at real money gambling.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:41:40", "background_image": "https://media.rawg.io/media/screenshots/560/56020c6c719c0fee43b0662548ed439c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 4, "beaten": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 242, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Crazy Panda Mobile"], "genres": ["Card"], "publishers": [], "esrb_rating": null}