{"id": 229746, "slug": "highway-traffic-racer-planet", "name": "Highway Traffic Racer Planet", "name_original": "Highway Traffic Racer Planet", "description": "isTom Games presents the Highway Traffic Racer Planet!<br/>A new experience in the endless highway traffic arcade racing genre: drive on a highway of a mini planet with different environments, collect car and map parts to unlock the premium content of the game for FREE! Customize your cars! Choose a new paintjob, install new rims and items to give your cars a unique look! <br/>Drive dangerously and reach better and better positions on the Leaderboards to show the world that you are the best driver on the highways! If you like blocky style highway racers then you gonna love our low poly style game! <br/>And most importantly, HAVE FUN!<br/><br/>If you face any technical issues on your device, we would appreciate if you could contact us prior to writing a negative review. We will try to address the issue as soon as possible.<br/><br/>▶ FEATURES ◀<br/>- Stunning low poly styled 3D graphics<br/>- Endless highway road with traffic cars<br/>- 5 class of 20 cars and MORE TO COME!<br/>- Car CUSTOMIZATION!<br/>- 4 maps with unique perks<br/>- 4 game modes<br/>- Hilarious Crashes<br/>- Challenging Missions<br/>- Leaderboards &amp; Achievements<br/>- A whole lotta fun!<br/><br/>▶ GAMEPLAY ◀<br/>- Tilt or Touch to steer<br/>- Touch gas button to accelerate<br/>- Touch brake button to slow down<br/>- Avoid the traffic, evade obstacles on the highway<br/>- Earn Coins to unlock new cars, maps and custom items<br/><br/>▶ TIPS ◀<br/>- The faster you drive the more scores you get!<br/>- Overtake cars closely with High Speed to get bonus scores!<br/>- Take advantage of our Special Offers! Discounts up to 35%!<br/>- Finish missions to earn extra money<br/>- Playing in two-way mode gives extra score!<br/>- Knock out busted vehicles to get extra score!<br/>- We recommend high-end devices for the best gameplay experience.<br/><br/>▶ Required App Permissions ◀<br/>IN-APP PURCHASES – So you can buy in-game currency if you choose to<br/>PHOTOS/MEDIA/FILES – So the game can store game data on your device<br/>WI-FI CONNECTION INFORMATION – So the game can connect to the internet to play<br/>DEVICE ID &amp; CALL INFORMATION – So phone calls will not be blocked by the game<br/><br/>▶ FOLLOW US ◀<br/>Facebook - https://www.facebook.com/RebelApes-282904792112531/<br/>Youtube - https://www.youtube.com/channel/UCuAVLlRhvHomPuccrc3MYcQ<br/><br/>Please rate Highway Traffic Racer Planet to support cool new updates and give us your honest feedback to make the game even better!<br/>________________________________________________________________________<br/>This app allows you to purchase virtual items within the app.<br/>________________________________________________________________________<br/>Please drive safe on the roads! Enjoy crazy driving only in the Highway Traffic Racer Planet!", "metacritic": null, "released": "2017-09-06", "tba": false, "updated": "2019-10-22T14:15:33", "background_image": "https://media.rawg.io/media/screenshots/a9a/a9abfd67b0b0c08c0bae1d7e8eef1746.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 177, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "Android"], "developers": ["Istom Games Kft.", "isTom Games"], "genres": ["Racing", "Arcade", "Casual"], "publishers": ["Istom Games Kft."], "esrb_rating": "Everyone 10+"}