{"id": 22972, "slug": "ai-war-collection", "name": "AI War Collection", "name_original": "AI War Collection", "description": "Includes the base game, AI War: Fleet Command, and the DLC Pack consisting of: AI War: The Zenith Remnant, AI War: Children of Neinzul, AI War: Light of the Spire, AI War: Ancient Shadows, AI War: Vengeance Of The Machine, and AI War: Destroyer of Worlds.\n<br/><br/>\nGo forth into the galaxy, steal AI technology, recapture those planets you must in order to achieve your ends, and save what remains of humanity. But draw too much attention to yourself, and the full might of the AI overlords will come crashing down.\n<br/><br/>\nThe inattention of the larger AI is our only hope: a small resistance, too insignificant even to be noticed by the AI central command, has survived. These are the forces you will command. The AI subcommanders will fight you to the death when they see you -- but your glimmer of opportunity comes from quietly subduing those subcommanders without alerting central processing to the danger until it's too late.Humanity has already fought its war against the machines -- and lost. In this modern RTS classic, it's your job to win the ultimate David vs Goliath battle.\nSome of the most unique AI ever seen in the genre, set in procedurally-generated galaxies with 50,000+ ships in them.\nA unique blend of 4X and grand strategy thinking at the galaxy-map level with RTS mechanics and tactics at the planetary level.", "metacritic": null, "released": "2009-10-21", "tba": false, "updated": "2019-08-28T22:07:15", "background_image": "https://media.rawg.io/media/screenshots/f81/f81b7552e53ce703a60fe8c2d372408f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 328, "game_series_count": 0, "reviews_count": 1, "platforms": ["macOS", "Linux", "PC"], "developers": ["Arcen Games"], "genres": ["Strategy"], "publishers": ["Arcen Games"], "esrb_rating": "Teen"}