{"id": 229743, "slug": "blossom-blitz-tropic", "name": "Blossom Blitz Tropic", "name_original": "Blossom Blitz Tropic", "description": "Join the match-3 tropic fun with this awesome new puzzle game!<br/>Play the addicting Blossom Blitz Tropic game for free and spend a relaxing day at the exotic island. Swap and match the beautiful flowers and explore hundreds of colorful levels filled with amazing graphics and visual effects. <br/><br/><br/>Link the flowers and match your way through absolutely gorgeous levels, unlock splendid boosters and clear the board from all the flower buds! <br/><br/>• Make rows of at least 3 flowers to remove them and clear the board. <br/>• Collect the flowers and win levels.<br/>• Enjoy hundreds of colorful levels.<br/>• Plan your moves and solve all the fun puzzles. <br/>• Make powerful combinations to create big explosions!<br/>• Complete the missions set at the beginning of each new level. <br/><br/>++ Boost your experience with awesome power-ups: <br/>- Match 4 flowers to get a horizontal or vertical item of this kind that will create a line blast.<br/>- Connect 5 flower buds in an L or T form to get a powerful boost that will explode all the items around it. <br/>- Match 5 beautiful flowers in a line to get a special colorful bomb that can explode all the figures with the same color. <br/>- Combine 2 special boosts for even greater explosions!  <br/>Blossom Blitz Tropic Features: <br/>* Fun puzzles and challenges. <br/>* Lots of exciting levels. <br/>* Awesome boosters and bonuses.<br/>* Easy and fun to learn. <br/>* Free to play!<br/><br/>Start the amazing adventure today!<br/>Move and link 3 flowers of the same color to burst and clear the board, complete all the challenges and attempt to get 3 stars on every level. Plan ahead and work out a strategy to reach high scores by using fewer moves. <br/><br/>Earn and unlock powerful boosts that will help you blast your way through challenging levels, but try not to use the special boosts right away but save your power-ups until you need them. <br/><br/>Don’t wait any longer to join the flower smashing fun! Play now, link 3 beautiful buds, create amazing combinations and win levels. <br/>THANKS for playing!", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:41:19", "background_image": "https://media.rawg.io/media/screenshots/9b1/9b1e83054d1ff199cac72378fbfc4820.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 45, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Cookie Crush Games"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}