{"id": 229854, "slug": "vr-home-design-view-3d", "name": "VR Home Design View 3D", "name_original": "VR Home Design View 3D", "description": "Do you want to have a walk in an fully furnished apartment? want to see how the apartment is decorated? <br/>Here comes a special Apartment View VR Tour for you... experience yourself walking in a luxury apartment... in this virtual reality treat ... using Google Cardboard glasses<br/><br/>How to set things:<br/>+ Play the demo on your smartphone<br/>+ Put the Smartphone in Google cardboard glasses housing<br/>+ Align your phone in center <br/>+ Check for blurriness... rotate lens for proper focus<br/>+ Wear your Google glasses and enjoy walking in space<br/><br/>Modes of Demo:<br/>+ By default the visit of luxury apartment will be automatic<br/>+ when click \"manually visit\" you can by own move around to see the apartment <br/><br/>Movement Controls:<br/>+ Move around physically to explore the apartment<br/>+ Movement is simple, just look in the direction you want to move and you will automatically walk that way. You have complete 360 degrees of vision and you are free to explore the tour. Give it a try, it is your call!<br/>+ To walk just look down (for 5 seconds) as you looking your feet... the red indicator changes to green ... and you are free to walk any where<br/>+ And like wise if you want to stop ... just look down again for 5 seconds... the green indicator changes and you are stopped now.... explore complete 360 while you are standing idle...   <br/>+ To open room doors ... just focus on the door ... the loader displays loading... when it completes loading the door opens<br/>+ To play music... just focus LED TV in main lounge... the loader displays loading... when it completes loading the music starts<br/><br/>Features:<br/>+ Amazingly view of Apartment<br/>+ Realistic sounds<br/>+ Easy controls, simply look where you want to go<br/>+ Unique virtual reality (VR) theme park simulator<br/>+ Compatible with virtual reality glasses such as Google Cardboard VR<br/>+ Crisp, Cinema like, HD visuals<br/>+ Developed for high end phones which have Gyro Sensor<br/><br/>We don't collect any personal information , any non-personal information collected by our partners like Google is used for analytic and game improvements. For details check here<br/>http://www.tulipapps.com/privacy.htm", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:41:04", "background_image": "https://media.rawg.io/media/screenshots/d9a/d9a69b7fddbdc4927f8236d70bad14b5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 254, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Tulip Apps"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}