{"id": 229812, "slug": "roller-coaster-vr-ultimate-free-fun-ride", "name": "Roller Coaster VR: Ultimate Free Fun Ride", "name_original": "Roller Coaster VR: Ultimate Free Fun Ride", "description": "Roll on the elevated rail tracks to take the thrilling roller coaster rides in a beautiful amusement park while roaming around the virtual world just like the real one. Enjoy your furious roller coaster journey through the astonishing environments &amp; mesmerizing scenarios while taking the sharp turns and steep slopes. Dash with ultra-high speed and rush down like crazy to feel the real sensation of crazy rollercoaster rides while running past the various amazing objects. Experience the gyro-meter based 360-degree rotation in dual mode and fight against gravity to keep yourself on the cart. <br/><br/>Astonishing Visuals &amp; Amazing Theme Parks:<br/><br/>Loop through the scariest and tallest roller coaster tracks in various astonishing environments with amazing 3D graphics &amp; mind-blowing visuals. Discover the new heights while moving up high in the sky and have the closest look to colorful weather balloons &amp; other amazing game objects. Live in your favorite joy land to maximize the fun ride and say goodbye to fear of heights.<br/><br/>A Simulator of Your Choice:<br/><br/>Experience the heart-pumping adventure while coping with deadly heights, twisty turns and incredible speed. Feel yourself sitting on a real coaster train while playing this crazy rollercoaster game. Enjoy the realistic simulation with gravitational effects and sit tight to avoid any mishap. <br/><br/>An Eye-Catching Tour in VR:<br/><br/>Enjoy the mixed reality effects in VR game mode and immerse yourself in the ultimate depth of joy and fun with gyro-based virtual reality effects. Just slide your Android device in your VR headset and brace yourself for a wild ride. You can also enjoy the roller coaster rides without VR glasses by switching to non-VR mode. Just swipe your finger across the device screen to roam around the virtual world.<br/> <br/>Key Features:<br/><br/>• Beautiful and amazing amusement park themes.<br/>• Physics-based roller coaster simulation.<br/>• Both VR and non-VR game modes.<br/>• No internet connection required.<br/>• Totally free fun to play.<br/><br/>Game Play: <br/><br/>• Slide your device in your VR headset for virtual reality mode.<br/>• Go for the dual mode to enjoy 360-degree VR effects. <br/>• If you don’t have VR glasses, you can play the non-VR mode.<br/>• Collect all the amazing objects to get maximum points. <br/>• Don’t hit the hurdles and obstacles.<br/><br/>If you like this game, please try our other games by clicking “More from Developer” or by visiting our publisher account. And don’t forget to rate and review.<br/><br/>We don't collect any personal information; any non-personal information collected by our partners is used for analytic and game improvements.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:41:11", "background_image": "https://media.rawg.io/media/screenshots/868/86827d8e0990190883d3f04b3a2e8a24.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 418, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Tulip Apps"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}