{"id": 229869, "slug": "picross-survival", "name": "Picross Survival", "name_original": "Picross Survival", "description": "Playing the Picross puzzles is even easier than before<br/><br/>Solve the puzzles; Help the distressed hero! <br/><br/>Improve the current problematic Picross points; Picross game with a range of new features. <br/><br/><br/>[ Detailed description ]<br/><br/>Jungle and secluded island; Even at the South Pole... The unlucky hero who is always in distress! <br/>Help the hero escape and don't lose hope.<br/><br/>Improve the various Picross problems; For your convenience;  <br/>New features have been added to make the Picross game as complete as possible.<br/><br/>firstly; By changing the puzzle; we have removed the parts that we had to make in order to continue <br/>Enhanced close-up drag zoom (30x30); Reverse zoom function added. <br/>Touch; Pen; The pad supports three types of operating modes; and; Offers a range of options for you.<br/><br/>If you delete the game and restart after or; if you are playing on a new device then you can find the contents saved on your Google cloud. <br/>There are; also a number of features available. <br/>Find other new and existing Picross!<br/><br/><br/>[ special features ]<br/><br/>- Hundreds of puzzles available.<br/><br/>- Cool design colour dots. ( puzzle logic corrected )<br/><br/>- Ability to store your changes on Google Cloud.<br/><br/>- The puzzle game saves automatically at the end of the operation.<br/><br/>- Multiple difficulty levels (10x10; 15x15; 20x20; 30x30);<br/><br/>- By completing normal and history mode you can access BigMap mode.<br/><br/>- Various operation modes (touch, Pad, Pen)<br/><br/>- Two-finger zoom function; Zoom out; move around; New undo function<br/><br/>- The more puzzles you solve, the more interesting the story becomes", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:41:00", "background_image": "https://media.rawg.io/media/screenshots/71b/71b4611759b7c4f0696a618bd92a8340.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 145, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["GameFox"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}