{"id": 229979, "slug": "dogbiscuit-a-drawing-book", "name": "DogBiscuit: A drawing book", "name_original": "DogBiscuit: A drawing book", "description": "On your trip you'll discover many exciting things and you can even design your environment just as you would like it.<br/><br/>★          A colorful, interactive picture book<br/>★          3 lovingly designed worlds to explore<br/>★          Draw and illustrate more than 20 objects<br/>★          Lots of costumes to unlock<br/>★          Beautifully animated characters in 2D<br/>★          Child-oriented controls that are also fun for older drawing fans<br/>★          Pleasant, child-friendly music<br/><br/>Accompany the cute dog DogBiscuit and his friends on a drawing adventure! Design your own picture book and help DogBiscuit and the crayons to make their world more beautiful and joyful.<br/><br/>Draw a scarecrow with curly hair in the garden, paint a pink palm tree on the beach or even a giant planet in outer space – in this drawing book, your fantasy and creativity know no bounds!<br/><br/>In each of the three available worlds there are crayons of all different colors to draw with. Choose whether you want to draw with guiding lines or bring great objects to life completely freely. The garden will be filled with apple trees in no time and the night sky will light up with hundreds of twinkling stars.<br/><br/>The little dog DogBiscuit loves to discover the world in his painting book and to find new friends! On his journey, he makes lots of new acquaintances and helps others with his drawing skills. The user interface is very simple and child-friendly. Templates that can be switched on and off help with drawing, while older artists can draw in greater detail and without limitations. There are many coloring pens available in a range of colors that'll guarantee you'll have the most drawing fun possible!<br/><br/>Thanks to the easy controls and the picture book character, DogBiscuit is a great coloring book game for young children, dog lovers and creative drawing fans.<br/><br/>If you have questions or problems related to the app or in-app purchases, please feel free to contact us via our facebook page facebook.com/tivolamobile", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:40:31", "background_image": "https://media.rawg.io/media/screenshots/113/11312906df3172a73d80a84c9c739fbd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 74, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Tivola"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}