{"id": 22991, "slug": "akalabeth-world-of-doom-2", "name": "Akalabeth: World of Doom", "name_original": "Akalabeth: World of Doom", "description": "'Tis said that long ago peace and tranquility covered the lands. Food and drink flowed freely, man and beast lived in peace, gold and silver abounded – it was the Golden Age of Akalabeth.\r\n<br/><br/>\r\nMondain, second born of Wolfgang, a great king of old, wished to gain his brother's inheritance and so he used his great powers for evil, creating deep dungeons guarded by daemons and Balrogs. Now blood flowed freely in Akalabeth, and foul creatures soon came to roam near the surface. Mondain cast such sickness and pestilence upon Akalabeth, that both man and beast lived in constant fear. Thus was the Dark Age of Akalabeth.\r\n<br/><br/>\r\nThere arose from the land a man, pure and just, to battle the Dark Lord. British, Champion of the White Light, did battle with Mondain deep within the labyrinth of dungeons, eventually driving him from Akalabeth forever. British of the White Light was proclaimed Lord British, Protector of Akalabeth. Alas, much damage had been suffered unto the lands. The Revival of Akalabest has begun. \r\n<br/><br/>\r\n'Tis thy duty to rid Akalabeth of the foul creatures which infest it, whilst trying to stay alive!Developed in 1979, Akalabeth is the first game made by the legendary creator of the Ultima Series, Richard Garriot. \r\nDesigned by the teenage Garriot in Applesoft BASIC for the Apple II, Akalabeth is one of the earliest known examples of a computer role-playing game, and is considered by many to be \"Ultima 0.\" \r\nFeaturing 10 different monsters, procedurally generated dungeon crawling, and wire frame 3D graphics, Akalabeth was highly advanced for its time and is still widely regarded as one of the most historically significant RPGs ever created.", "metacritic": null, "released": "1979-12-31", "tba": false, "updated": "2024-01-06T09:05:05", "background_image": "https://media.rawg.io/media/screenshots/510/510ad66178757fcafc467d6d01c3b425.jpeg", "website": "", "rating": 2.08, "rating_top": 1, "added_by_status": {"yet": 142, "owned": 1234, "beaten": 11, "toplay": 9, "dropped": 24, "playing": 2}, "playtime": 1, "achievements_count": 0, "ratings_count": 83, "suggestions_count": 110, "game_series_count": 22, "reviews_count": 84, "platforms": ["macOS", "Apple II", "PC", "Linux", "iOS"], "developers": ["Quantum Toast", "Richard Garriot"], "genres": ["Adventure", "RPG"], "publishers": ["Johns and Stremplat", "Richard Garriot"], "esrb_rating": null}