{"id": 229941, "slug": "petworld-wildlife-africa", "name": "PetWorld: WildLife Africa", "name_original": "PetWorld: WildLife Africa", "description": "Become the new manager of an African park for wild animals and care for lions, rhinos and zebras to make them healthy again and give them to zoos and new owners. Like a veterinarian, you'll have to make sure to treat every illness correctly and to give everyone the right amount of food in order to nurse them back to full health.<br/><br/>Care for every elephant, lion and zebra in your safari sanctuary<br/>In PetWorld: WildLife Africa you get two jobs at once! Become the manager of your reserve and also a veterinarian to care for the wild animals of the African savannah and find them new owners. A challenging task, because each day there are feedings and medical decisions waiting for you. What's more, the enclosures also need to be cleaned and the animals would really like to have a short cuddling session!<br/><br/>The new Big 5 PetWorld game!<br/>Following PetWorld 3D and WildLife America, here comes the latest installment with African animals! Offer Ronny the Rhino and Leo the Lion a nice home until they can be given to a zoo, a national park or another location. There's a lot to discover in the desert – decorate your park with great accessories and customize the enclosures.<br/><br/>Detailed 3D graphics and lovingly animated wild animals <br/>Dive into the wild world of the steppe and observe the Africa's big 5 from up close! The great graphics and realistic animations make the game a wonderful experience for every animal lover. There are lots of challenges waiting for you – choose the right medicine, bandage wounds and give every animal the right amount of food to make them all fit and healthy again.<br/><br/>★ Care for 5 different types of animals and care for them<br/>★ Find out what's wrong with your protégés and choose the right medicine<br/>★ All in-app purchases can also be unlocked for free<br/>★ Decorate your reserve and the enclosures with neat accessories<br/>★ Find your animals loving, new owners<br/><br/>So what are you waiting for? Let's go to your reserve!<br/><br/>Visit us on Facebook: facebook.com/tivolamobile", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:40:42", "background_image": "https://media.rawg.io/media/screenshots/72b/72b75383e30f33778f8ae22e793dd99a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 312, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Tivola"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}