{"id": 229931, "slug": "petworld-fantasy-animals", "name": "PetWorld - Fantasy Animals", "name_original": "PetWorld - Fantasy Animals", "description": "Once upon a time in a far-away land, the Frog King decided to open a park for magical baby animals so that they could be lovingly cared for and adopted by affectionate new owners. But he cannot accomplish this task alone, and that's why he needs your help. Answer his call for assistance and help him with the Fantasy Baby Animals.<br/><br/>★ Following PetWorld and DogHotel comes the next adorable animal simulation from Tivola<br/>★ Take care of mythical creatures such as dragons, unicorns, phoenixes, griffins and jackalopes<br/>★ Cute animations and fantastic graphics<br/>★ Look forward to many updates with new baby animals and other surprises<br/>★ Recommended for all children aged 7 and up<br/><br/><br/>Magical baby animals need your help<br/>Following your first steps as a sorcerer's apprentice, it's up to you to accommodate and to provide for your magical guests. Make sure they want for nothing and that they always have fresh food and water. They'll also need lots of love and petting. And to make matters worse, the little ones have been cursed by an evil witch and you have to find the right charm to cure them.<br/><br/><br/>Play with dragons, unicorns, phoenixes and more<br/>During their recovery, the Fantasy Baby Animals will need lots of affection and activities. Feed them treats, pet them and equip their enclosures with new decorations so that they really feel at ease. Only healed and happy guests will find a new home with a knight, a wizard or maybe a king.<br/><br/> Support \t<br/>If you have questions or problems related to the app or in-app purchases, please feel free to contact us via our facebook page facebook.com/tivolamobile", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:40:44", "background_image": "https://media.rawg.io/media/screenshots/55b/55bba3374dcf2101dcbe47d4f7268a8d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 226, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Tivola"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}