{"id": 229964, "slug": "wormaxio", "name": "Wormax.io", "name_original": "Wormax.io", "description": "Mobile MMO version of the popular game wormax.io<br/>Play Wormax online against other people worldwide or against the computer in the single-user mode. Invite friends to play together. Upgrade your worm and compete with other players in the rating. Use active skills and game boosters.<br/>In the mobile version of Womaxio you control a snake. The goal of the game is to make your snake gain the biggest mass and to reach the first place in the server.<br/>The game is fascinating and easy to play. Install Wormax and go for it! <br/><br/>GRAND MULTIPLAYER<br/>Play online with hundreds of other people from all over the world.<br/><br/>SINGLE-USER MODE<br/>Play against the computer and train your slither skills<br/><br/>USE ACTIVE SKILLS<br/>Gain your first 100 points in Wormaxio, which will unlock the instant stop skill. Upon gaining 500 points, you will get a temporary option of crossing other worms without being afraid of running into any of them. Stay alert as the cooldown of the skills takes some time.<br/><br/>PLAY WITH FRIENDS<br/>Invite friends to play together on the same server.<br/><br/>COLLECT BOOSTERS<br/>Use various boosters that increase the worm's mass, attract food, provide acceleration without losing points or make the worm's mass toxic and dangerous for the opponents.<br/><br/>COMPETE WITH OTHER PLAYERS IN RATING<br/>Play more often. Grow bigger. Build up your account rating and receive essence for passing to another League.<br/><br/>UPGRADE YOUR WORM<br/>Use essence to buy artifacts in the Shop and upgrade your worm.<br/><br/>PLAY AS YOU LIKE<br/>The game provides a few modes, among those worm control with an accelerometer.<br/><br/>Thanks to these features, the game becomes much more interesting.", "metacritic": null, "released": null, "tba": false, "updated": "2023-12-17T20:59:23", "background_image": "https://media.rawg.io/media/screenshots/cab/cab47798ff67e6019ab8035ca6e745f8.jpg", "website": "", "rating": 3.86, "rating_top": 5, "added_by_status": {"owned": 5, "dropped": 1, "playing": 4}, "playtime": 0, "achievements_count": 0, "ratings_count": 6, "suggestions_count": 117, "game_series_count": 0, "reviews_count": 7, "platforms": ["Android"], "developers": ["Elyland"], "genres": ["Action"], "publishers": [], "esrb_rating": null}