{"id": 229947, "slug": "extreme-sports-car-shift-racing", "name": "Extreme Sports Car Shift Racing", "name_original": "Extreme Sports Car Shift Racing", "description": "The extreme sports car shift racing is all about perfect gear shift with timely acceleration and amazing drifting stunts on asphalt highway tracks. The ESR racing game is a kind of classic drag racing game with brand new ESR shift racing missions. Burn the asphalt racing tracks using the adrenaline filled nitrous stunt action and try to reach the finish line fast to win all ESR race missions. In the world of drag car racing games, not only speed determine the winner but also the perfect gearing shift, so drive like crazy while gearing up and down your ESR car simulator and race with pace to beat the rivals in this ESR racing game. This extreme sports car speed car racing game demands the stunt master skills to cope with other speed racers and highway drifters. So, it is time to show your ESR car driving and car parking skills to become the champion of this ESR shift racing game.<br/><br/>Get ready for the most furious and the fastest ESR racing game missions in the mid of extreme city traffic rush to beat the other speedy cars while driving your modern turbo car simulator. The extreme sports car shift racing game has amazing city environment with perfect lighting effects. Enjoy your modern supercar ride as a real drift racer and win this new ESR racing game like a pro shift racer. The ESR drift car racing game is a perfect version of drag race games which will allow you to test your speed driving skills while controlling the steering of a furious drag car simulator. Feel the thrill of manual car-driving, just like real life car driving simulation and double your fun riding adventure in no time. Drive the multiple new and modern muscle &amp; sports cars while playing the classic ESR racing game and race on multiple racing tracks with perfect drag car shifting stunts.<br/><br/>Play the multiple extreme sports car shift racing missions to fulfill your ESR racing fever and enjoy the most amazing drag car racing missions for the first time. This ESR car driving game is specially designed for those passionate supercar gamers who want something new in typical drag car racing games category. So download this amazing sports car simulation game and enjoy the best manual car shift racing game while staying at home. Have an eye on speedo meter and RPM meter of your formula cars to perfectly gear without losing speed. Use the nitrous boost to speed up your drift car whenever you feel yourself losing the ESR car race missions. Play and complete each supercar game mission to get cash rewards. Use the cash rewards to buy and upgrade new turbo cars and nitrous along with other speed booster packs. Complete each ESR drag race mission within time with maximum gearing and speed. <br/> <br/>Game Features of Extreme Sports Car Shift Racing:<br/><br/>• Realistic 3D environment with astonishing visuals.<br/>• HD graphics and high-quality textures.<br/>• Immerse yourself in exciting drag racing fun.<br/>• Smooth and easy controls.<br/>• Realistic turbo-car engine sound effects.<br/>• An ESR racing game for all ages.<br/>• Lot of challenging drag missions to unlock.<br/>• Addictive drag racing gameplay.<br/><br/>How to Play:<br/><br/>• Shift up and down your supercar simulator using the “+” and “-“buttons.<br/>• Tap the accelerate button to boost the ride.<br/>• Use the break button while shifting down to perform drifts.<br/><br/>If you like the extreme sports car shift racing game, please try our other ESR shift racing games by clicking “More from Developer” or by visiting our publisher account. And don’t forget to rate and review.<br/><br/>We don't collect any personal information; any non-personal information collected by our partners like Google is used for analytic and game improvements.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:40:42", "background_image": "https://media.rawg.io/media/screenshots/ccf/ccf1cd4d413e22d2fa01b11b04243985.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 162, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Tulip Apps"], "genres": ["Racing"], "publishers": [], "esrb_rating": null}