{"id": 2299, "slug": "dawindci", "name": "daWindci", "name_original": "daWindci", "description": "<p>Apple Design Award Winner 2012!<br />\nTouchArcade says: &quot;With a smooth soundtrack driving the action and excellent puzzle solving gameplay, DaWindci is a complete, beautiful, and unique puzzler that you really shouldn&#39;t miss out on if you&#39;re a fan of the genre.&quot;<br />\nNumber #1 Highlight in German AppStore!<br />\nNumber #1 Best Selling iPad-App in German AppStore!<br />\nNumber #10 iPhone Game in German AppStore!<br />\nA world full of magical equipment: Monumental wind turbines on the horizon, an impressive hangar door behind you and a surreal fauna and flora around you.<br />\nYou yourself: pilot of a homemade hot air balloon ready for the expedition into the unknown.<br />\nOn your way: Sharp cliffs, wind tunnels, dangerous electric fields - and a lot of incredible inventions.<br />\nAnd always by your side: The wind, which pushes you forward, opens doors for you, blows down heavy levers, helps you through the mountains and pushes the dark rain clouds in front of you.<br />\nImmerse yourself in daWindci, where scientists and engineers make even the unthinkable possible.  Create your own hot air balloon with over 20 different designs.<br />\nEmbark in 45 expeditions in search of valuable items and mysterious puzzles. You can paint wind, hurricanes and lightning on your screen with your finger and thereby navigate your balloon through the riddles of each level.<br />\nThe innovative gameplay with multi-touch gesture control, charming graphics and meditative soundtrack offers 5-8 hours of playtime and delights the casual player as well as core gamers.  Play daWindci at your own pace, solve many mysterious physics puzzles and share your successes with your Facebook friends!<br />\n<em> Winner of the Gamesload Newcomer-Award<br />\n</em> Nominated for the German Computergame Price<br />\n<em> Nominated for the Unity3D Award<br />\n</em> Multi-touch gesture control<br />\n<em> Meditative Soundtrack, great graphics, innovative gameplay<br />\n</em> 5-8 hours of playtime fun<br />\n<em> 45 levels and more than 20 designs for the balloon<br />\n</em> 14 special tasks (Achievements)<br />\n<em> Facebook-Connection<br />\n</em> Playable cooperatively<br />\n<em> Full Retina Screen Support<br />\n</em> Compatible with iPad 1+2, iPhone (3GS and later) and iPod Touch (3rd and 4th generation)<br />\n&quot;If you enjoy physics challenges with a minor puzzle twist, this is the game for you.&quot; - AppSpy<br />\n&quot;So what happens when you take a done-before concept and make it run smooth, look appealing, play fun, and slap some great music to it? A success! Great job, ya&#39;ll! This looks fun as hell!&quot; - SuperFunApps</p>", "metacritic": null, "released": "2011-04-14", "tba": false, "updated": "2023-09-06T07:02:55", "background_image": "https://media.rawg.io/media/games/338/338e5185fc897271718c50f33c6a2b8c.jpg", "website": "http://www.dawindci.de", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 176, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["Mimimi Productions"], "genres": ["Action", "Puzzle"], "publishers": ["Mimimi Productions UG"], "esrb_rating": "Everyone 10+"}