{"id": 229966, "slug": "horsehotel-premium-manager-of-your-own-ranch", "name": "HorseHotel Premium - manager of your own ranch!", "name_original": "HorseHotel Premium - manager of your own ranch!", "description": "Run your own Horse Hotel<br/>HorseHotel makes you the owner of your own horse ranch. Take care of the horses, look after their needs, and discover exciting games, until they return to their owners happy. You are responsible for their health and well-being. There is enough space on your green pastures for different horses. Each horse has to be examined in order to see if it’s healthy. Feed them, nurse them, and play with them. Make sure they have everything they need before they go back to their owners.<br/><br/>Exciting horse games and challenges<br/>There are different horse breeds waiting for you, and each breed has its own individual needs. Take a look at the horse’s file to find out what exactly the horse needs. This will help you to provide the best care for the horse. If your horse needs more endurance play the obstacle course minigame. If the horse is lacking in confidence, you can build it up with flatwork exercises in the riding arena. To increase its ability, just play the dressage minigame. But one thing all horses have in common: they need your affection, so don’t neglect to give them treats and pet them!<br/><br/>❀ Run your own hotel for horses and turn it into a luxurious hotel<br/>❀ Discover exciting minigames<br/>❀ Feed and take care of different breeds of horse<br/>❀ Collect coins, complete quests, and spin the wheel of fortune<br/><br/>HorseHotel Premium does not contain in-app purchases, ads, or links to external websites or social media presences. <br/>In case of questions or issues, feel free to send us an email at apps@tivola.de.<br/>Guaranteed ad-free and without in-app purchases!<br/><br/>Visit us on Facebook: facebook.com/tivolamobile", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:40:37", "background_image": "https://media.rawg.io/media/screenshots/cd2/cd29cb63b7e9c9feda8e90d82a2d90c9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 261, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Tivola"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}