{"id": 230023, "slug": "birds-pop-mania-match-3-games-free", "name": "Birds Pop Mania: Match 3 Games Free", "name_original": "Birds Pop Mania: Match 3 Games Free", "description": "<p><strong>Birds Pop Mania: Match 3 Games Free</strong>: A cute and addictive birds match 3 puzzle game from the makers of super hit games pastry jam, Garden Paradise &amp; Halloween Witch Connect.<br/><br/>These birds match bubbles puzzle game takes you to the new bird's paradise world. Rescue them and let the jungle angry birds be free by matching and pop them with your strategy. <br/><br/>For fans of cutest nibblers birds mania match 3 games, Launchship Studios comes with another exciting and fun-filled birds nibblers game with stunning graphics and sounds for a great experience.<br/><br/>Are you ready for the relax journey? Download Our Charm King of Birds Pop Mania now, you'll be addicted from the very first hit!</p>\n<p><strong>GAME FEATURES:</strong><br/>✔ 1000+ Well-designed levels each one is unique and full of fun and amazing challenges!<br/>✔ New Charm King birds match puzzle game with stunning graphics with leaderboards and achievements.<br/>✔ Hundreds of levels to splash the very angry birds, eggs, and chickens in a style of charming flashy birds blast.<br/>✔ Completely free to play and in-app purchases to get extra moves and lives.<br/>✔ Sweet graphics that you have never seen before and fabulous properties.<br/>✔ New and improved game modes, Different tricks to bring you a variety of different conditions garden mania challenge.<br/>✔ Eye-catching graphics and animations which will bring you into the story-driven adventure!<br/>✔ Rechargeable boosters, well-designed power-ups help with birds blast and challenging levels.<br/>✔ Pop bubble shooter the nibblers to move to the next level.<br/>✔ Easy and fun to play, yet challenging to fully master: all with strategic swiping Water Splash game!<br/><br/><br/><br/><strong>Contact Us!:</strong><br/><br/>★ Questions? Contact our Tech Support at <strong>info@launchshipstudios.com.</strong><br/>★ Having any problem with the game? <br/>Click here! &gt;&gt;&gt; http://launchshipstudios.com/contact-us/<br/><br/><br/>♥ Privacy Policy: <br/>http://www.launchshipstudios.com/privacy-policy/<br/><br/>♥ Terms of Use: <br/>http://www.launchshipstudios.com/terms-of-services/<br/><br/><br/>Fantastic Free Matching 3 Birds match Adventure, Water Splash!<br/><br/><strong>Have fun playing Very Charm King Birds Evolution Game!</strong></p>", "metacritic": null, "released": "2019-08-09", "tba": false, "updated": "2020-02-19T14:37:37", "background_image": "https://media.rawg.io/media/screenshots/3a6/3a6ef5fcb489778e227a8361b75cbc2d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 97, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Android"], "developers": ["Launchship Studios", "Launchship"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}