{"id": 230009, "slug": "airport-professions-fascinating-games", "name": "Airport Professions: Fascinating games", "name_original": "Airport Professions: Fascinating games", "description": "There are exciting adventures and interesting tasks for toddlers and their parents in the new educational kids games about airport. There is a huge airport in the Hippo city. A lot of passengers use its services every day. Airport is the place where people of different professions are working together. There are stewardess and pilot, cashier and security officer. And the shop assistant of duty free shop invites everybody to visit the shop. Today we are going to learn about the professions that serve the airport. The most skillful crew invites you to our plane. If you are not afraid of planes and heights, exciting travels and adventures are waiting for you!<br/><br/>We have prepared a real surprise for toddlers, for boys and girls. It is a real sky harbor, which could help you to get to any country, city or any place on our planet. It is not just an ordinary visit to a huge airport, we will also learn the professions, which could be seen here. Your kid will see how a real stewardess works and how a pilot prepares a plane for take-off. Or you can, like a real manager, open your own duty free shop. You could check whether you are a good seller by playing our game behind the counter of the shop! Then you could observe the job of cashier, serving international avia flights. Together with Hippo you could visit luggage space and get to know the peculiarities of security officer job. But that's not all! We are going to learn how interesting is the job in passport check-point and try the job of stewardess! We are going to try a lot of interesting tasks today. It is easy and interesting to learn professions with our kids game! Hippo crew is ready to pass a preflight check and go to the far away countries. Take part in all unbelievable adventures together with us!<br/><br/>This new game, as well as all our kids games, is absolutely for free. We have prepared a lot of interesting and useful mini-games about important and exciting professions. Have fun and play our new game for kids of 3, 5 or even 7 years old. If you kid is afraid of flights, this game will help to overcome it.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:40:24", "background_image": "https://media.rawg.io/media/screenshots/70a/70a04ba4972f9da7fed464363dea716b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 139, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Hippo Baby Games for Girls and for Boys"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}