{"id": 230050, "slug": "garden-paradise-mania", "name": "Garden Paradise Mania", "name_original": "Garden Paradise Mania", "description": "<p><strong>Garden Paradise Mania</strong>, from the makers of Birds Pop mania &amp; Pastry Jam games.<br/><br/>Experience the new flavor of Garden mania match3 puzzle game, with fun-filled and pleasing surprises. Collect delightful fruits and vegetable by connecting with three or more same matching items. Be a farm hero by achieving the targets on each level and enjoy the new journey of match 3 game from Launchship Studios!<br/><br/></p><p>Garden Paradise is different from other farm mania match 3 game with fantastic graphics and easy to addict yet challenging to master. Plunge and collect the sweet Tomatoes, Carrots, Brinjals, Beetroots, Pumpkins, Potatoes, Yellow Capsicums and many more vegetables in this green farm. Download now and start the fantastic harvest journey in the green farming paradise and be one of the best top heroes.<br/><br/><strong>GAME FEATURES:</strong><br/>✔ 300+ Well-designed levels - each one is unique and full of fun and amazing challenges!<br/>✔ FREE to play and in-app purchases to get extra moves and lives to clear the challenging levels.<br/>✔ Hundreds of well-designed unique levels to challenge you.<br/>✔ Plant and crop fresh carrots, vegetables and fruits.<br/>✔ Sweet graphics and animations that you have never seen before and marvelous properties.<br/>✔ Extra boosters and power ups to help you complete the challenging levels.<br/>✔ Connect as many as fruits and Carrots in single touch to get extra score and points.<br/>✔ Easy and fun to play, yet challenging to master: all with strategic swiping!<br/>✔ Facebook connection so you can share the adventure with friends.<br/>✔ All this available on smartphones and tablets!<br/>✔ Free and filled with super farm adventure!<br/><br/><strong>Have fun playing with Garden Paradise Game! - Thank you</strong><br/></p>", "metacritic": null, "released": "2019-12-13", "tba": false, "updated": "2020-02-10T13:10:48", "background_image": "https://media.rawg.io/media/screenshots/642/6426a58f31d1bf8197408558ccd5ca4c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 114, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "Android"], "developers": ["Launchship Studios", "Launchship"], "genres": ["Casual", "Puzzle"], "publishers": [], "esrb_rating": null}