{"id": 23011, "slug": "europa-universalis-ii", "name": "Europa Universalis II", "name_original": "Europa Universalis II", "description": "Europa Universalis II invites you to a global struggle for supremacy from the dark times of Jeanne D'Arc to the flaming wars of Napoleon. As the leader of a country you have to guide domestic and foreign policies. Engage in religious struggles, set up expeditions to claim the New World, lead your country to prosperity and victory. Send your Privateers to roam the seven seas, muster mercenaries to bolster your defences, and send missionaries to convert infidels to your State Religion.\n<br/><br/>\nInteract with true historical events and persons to determine which path your nation will take in the game. The new game includes an elaborate and expanded system for diplomacy, trade, military might and development. It also includes new graphics, music, sound, manual and a new tutorial system to lower the learning curve.The possibility to demand or offer any combination of provinces, gold and diplomatic agreements as a result of peace. \nEuropa Universalis II expands history's greatest cause of war \"Religion\", introducing Hinduism, Confucianism and Buddhism. Cultural groups based on linguistic differences between peoples have also been introduced to portrait the difficulty with which one controls the subjects of another culture during different time periods.\nA brand new event engine that produces historical, random and special events. The event engine is designed to let the player create his own events making it very fun to build scenarios. Many of the events have multiple choices.", "metacritic": null, "released": "2001-12-10", "tba": false, "updated": "2023-11-24T17:47:39", "background_image": "https://media.rawg.io/media/screenshots/10e/10e4cab49b0e3131e20afe4ea5676519.jpg", "website": "", "rating": 2.79, "rating_top": 1, "added_by_status": {"yet": 71, "owned": 845, "beaten": 13, "toplay": 5, "dropped": 5}, "playtime": 1, "achievements_count": 0, "ratings_count": 29, "suggestions_count": 441, "game_series_count": 0, "reviews_count": 29, "platforms": ["PC"], "developers": ["Paradox Development Studio"], "genres": ["Strategy"], "publishers": ["Paradox Interactive"], "esrb_rating": "Everyone"}