{"id": 230197, "slug": "galaxy-invader-shooter", "name": "Galaxy Invader Shooter", "name_original": "Galaxy Invader Shooter", "description": "In this air battle, drive your fighter, become a lightning in the gun fight!<br/><br/>Enter the galaxy defense state and resist the invasion war launched by aliens!<br/><br/>Drive your armored fighters and fight thousands of enemy planes!<br/><br/>Game Features:<br/>★ More elite fighters:<br/>  10 Thunder fighters are waiting for you to drive. Not all fighters can drive at begining. Some powerful fighters need you to reach a certain level before they can be unlocked. Unlocked fighters can be used randomly in the game. You can also upgrade these fighters to increase their firepower and levels, and easily breakthrough the alien shooters;<br/>★ More enemy planes, more battles:<br/>  Dozens of different types of fighters attack you. In addition to launching intensive firepower nets, these alien fighters will change different formations. In addition to avoiding shells, you must avoid enemies approaching you. Fighting in outer space, in addition to the enemy, you also need to be careful about the meteorites and comets that are suspended in space;<br/>★ A variety of game mode:<br/>  2 game modes: single player mode and multiplayer mode. There are 3 ways to play in the single player mode. Challenge game: Hundreds of levels are waiting for you to challenge, and you will be rewarded when you finish each level. Endless Challenge: Meet the waves of alien fighters and see how many passes you can get in the number of 3 lives. After the end, you will be rewarded according to the pass level. Boss challenge: directly challenge the strongest boss and get high rewards. Multiplayer mode: Spend a certain amount of gold coins against other players to see who can challenge more levels.<br/>★ Simple gameplay:<br/>  The sliding screen controls your fighter to move left and right, avoiding the shooting of aliens, and shuttles through the bullets. Defeat the enemy aircraft to get firepower upgrades, and a variety of new fighters are also available.<br/><br/>Try the Galaxy Invader Shooter and relive the fanatical arcade experience!<br/><br/>Join the galaxy defense force and fight with alien fighters to save the world!", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:39:59", "background_image": "https://media.rawg.io/media/screenshots/3bc/3bcf38d466e6beded828fe58c0a864aa.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 243, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["101 Sports Go"], "genres": ["Arcade"], "publishers": [], "esrb_rating": null}