{"id": 230141, "slug": "faraway-3-arctic-escape", "name": "Faraway 3: Arctic Escape", "name_original": "Faraway 3: Arctic Escape", "description": "***** Google Play Awards: Best Casual Games of 2018 *****<br/><br/>Escape all-new distant places in Faraway 3: Arctic Escape that are full of mind-bending puzzles and new exciting locations to explore. This room escape game will challenge your puzzle solving ability. Sequel to one of the all-time best escape games with over a million players! A room escape puzzle game that will completely challenge your mind, captivate you &amp; offer hours of amazing mobile gaming entertainment. <br/><br/>FASCINATING STORY<br/>It’s been several years now, since your journey began, searching for your lost father. After unraveling a huge number of mind-boggling puzzles, the last gateway you entered took you to an altogether new wintery continent filled with frosty, new temples to investigate. You seem to be getting closer to finding your father, all the while you are still finding notes he left behind. <br/>Observe the arctic environment, collect items, manipulate devices and solve perplexing puzzles to escape frosty temple labyrinths.<br/><br/>COMPLEX PUZZLES<br/>Explore 18 new temples packed with escape puzzles, Explore a 3D world that will captivate you from the moment you begin. Turn, look and explore mind-bending puzzles and contraptions.<br/><br/>RIVETING LOCATIONS<br/>Navigate through one of the easiest 3d environments in an escape game while enjoying an ambient soundtrack. Uncovering secrets have never been so much fun.<br/><br/>THE MYSTERY CONTINUES<br/>You have many more pages of your father’s missing journal to find, maybe then you will unlock your family’s past. This is an escape game that will keep you engaged for many hours!<br/><br/>NEW FEATURES <br/>In game camera allows you to take snapshots and save them for later use.<br/><br/>TRY FOR FREE<br/>Enjoy 9 free escape levels before you decide to purchase the remaining levels and experience the whole Faraway 3: Arctic Escape story that will leave you impressed.<br/><br/>SUPER WIDESCREEN SUPPORT<br/>This puzzle game looks beautiful on new 18:9 phones and also shines on tablet devices. Enjoy stunning and astoundingly detailed graphics that look exquisite.<br/><br/>Enter an all-new, fascinating world of room escape games &amp; puzzles with Faraway 3: Arctic Escape!", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:40:07", "background_image": "https://media.rawg.io/media/screenshots/0c9/0c9d363c7abe0b588a7b112aceeb78f6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 153, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Snapbreak"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}