{"id": 230189, "slug": "billiard-pro-magic-black-8", "name": "Billiard Pro: Magic Black 8🎱", "name_original": "Billiard Pro: Magic Black 8🎱", "description": "🎱 Billiards Pro: Magic Black 8 is the #1 professional 9 ball pool billiards challenge! Will you want to have a good relax after a long meeting, a whole day work, tense test, etc., Billiards Pro is one of the most suitable game for you!<br/><br/>Grab a cue and create a new billiard myth!<br/><br/>Join this billiards league and show off your skills as a professional billiards 9 ball pool player!<br/><br/>Game Features:<br/>🎱 More exciting game modes:<br/>  3 game modes: task challenge mode, fast game mode, bounty battle mode;<br/>  Task challenge mode: In the limited number of shots, a specified number of shots are shot into the hole. The fewer the number of shots, the more star ratings can be obtained. A certain number of stars can unlock the next challenge city. 360 levels waiting for you to challenge;<br/>  Fast game mode: Quickly start a 9-ball game. You need to hit as many balls in the hole as possible within two minutes. You can get an additional ten seconds for each ball you hit. See the last you Can hit a few balls;<br/>  Bounty Battle Mode: There are 5 levels of battle, you need to wager the game currency, then defeat the opponent, get the same game bounty, and defeat the opponent can unlock higher bounty battle;<br/>🎱superb game screen:<br/>  The real hitting physics effect, the clear game picture, and the percussive sound with an on-the-spot feeling are like being in the arena of a billiard game;<br/><br/>Gameplay:<br/>  Rotate the cue to aim at your target; slide the left side of the power slot to control your hitting strength; adjust your hitting angle in the upper right corner to create a more aggressive ball; use assistive props to score a simpler goal;<br/>🎱 More rewards:<br/>  In addition to completing the task to earn rewards, the achievements system also has rich props and game currency rewards can be received, the online duration challenge task can also be rewarded.<br/><br/>Can you hit all these balls into the pool? Come and challenge this billiard game !<br/><br/>Billiards Pro: Magic Black 8 brings together the world's most popular 9 ball pool game play. Grab the cue and play now!", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:40:01", "background_image": "https://media.rawg.io/media/screenshots/0cd/0cdf009808b50c5484bbccab4f3a2cd1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 54, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["101 Sports Go"], "genres": ["Sports"], "publishers": [], "esrb_rating": null}