{"id": 230112, "slug": "car-game-for-toddlers-kids-racing-cars-games", "name": "Car game for toddlers - kids racing cars games", "name_original": "Car game for toddlers - kids racing cars games", "description": "Which kid doesn’t love cool cars? Especially, when he can create unique cars for the race, drive faster than lightning, and cross obstacles on the road!<br/> <br/>With this exciting app children can enjoy beeping, accelerating and jumping on trampolines as they ride on different vehicles. For some added fun, the game also includes interactive objects on the way for kids to click. Set off on an exciting journey with a new friend - racer Raccoon!<br/><br/>Features of the app:<br/>★ Choose from different high-speed cars<br/>★ Paint or improve your cars in a garage<br/>★ Paste bright and funny car stickers<br/>★ Travel to different locations<br/>★ Enjoy this easy and fun-to-play game<br/>★ Delight yourself with the funny cartoon graphics<br/>★ Listen to the stunning sound effects and music<br/>★ Play without internet<br/> <br/>This entertaining game is suitable for kids aged 1 year and above. Let your children learn to be creative, attentive and determined, as they play this game!<br/> <br/>There are many different activities designed to capture toddlers’ attention as they travel around in fancy cars:<br/>- Add improvements like turbo boosters, flashers, sirens, balloons and other accessories<br/>- Paint the car in different attractive colors<br/>- Draw with brushes or use paint cans - it’s our choice!<br/>- Wash your car with a sponge in a garage<br/>- Choose wheels for your vehicle - small, large, or unusual ones<br/>- Decorate the car with stickers and superhero badges<br/><br/>Have loads of fun with amazing vehicles!<br/><br/>CLASSIC -  Retro car, Pickup, Ice cream truck  and others<br/>MODERN - Police car, Jeep, Ambulance and more<br/>FUTURISTIC - Lunar rover, Flying saucer, Concept car and others<br/>FANTASY -  Monster truck, Superhero machines, Dinosaur and more<br/>CONSTRUCTION - Excavator, Tractor, Concrete mixer truck and others<br/><br/>This adventurous car game is simple, exciting, and educative! That’s exactly what kids need!<br/><br/>We value your feedback. Did you enjoy this game? Write to us about your experience. If you have any questions or suggestions, please contact us at info@amayasoft.com", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:40:14", "background_image": "https://media.rawg.io/media/screenshots/4a0/4a0f9cddf9a0c19853b9213104cc2ec3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 120, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["AmayaKids"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}