{"id": 230227, "slug": "summer-girl-camping-life", "name": "Summer Girl: Camping Life", "name_original": "Summer Girl: Camping Life", "description": "Summer Girl : Camping Life<br/>Summer is almost over but do you want to relive or enjoy the summer a little longer? Play this summer holiday game with six minigames! This summer girl went on a vacation at a camping! Have fun with her at the camping and when she is back home. Search for bikinis, make ice cream, clean up your tent en help gardening at the camping. When you come back home there is ofcourse a lot of laundry to do! Help your mum doing the holiday laundry with all your cute summer clothes. <br/>Camping is always a lot of fun for kids, play in and with the nature and have fun with other kids on the camping. Swimming in the pool, sea or a river or sunbathing. Playing outside and inside the tent and make a mess and clean it up. And of course eat a lot of ice cream! Make your own ice cream and decorate it with fruits and sprinkles.<br/><br/><br/>Summer Girl : Camping Life with six fun summer holiday mini-games:<br/>❤ Do the after holiday laundry: sort colors from the white clothes and use the right detergent for your pile of summer clothes laundry!<br/>❤ Hang the laundry: Make sure the summer clothes dry properly by matching the right shapes!<br/>❤ Match the bikinis: All the bikinis are lying on the floor. Can you help me matching the right bikini tops with the right bikini bottoms?<br/>❤ Clean up the tent: make the air mattress, put the books and cute toys back in the right place and clean the rest of the tent!<br/>❤ Go gardening at the camping: Help the summer girl plant and water the most adorable flowers!<br/>❤ Make ice cream: Choose the fruit that you love most and put the right ingredients together! When you are done making and freezing you can decorate your ice cream!<br/><br/><br/>Summer Girl : Camping Life is a game from Top Girl games and one of the summer camp games. We publish many different easy to play girl games apps. We hope you will enjoy our Summer Girl : Camping Life and we hope you give us the love by liking our Facebook page or follow us on twitter or Instagram. . So we can keep you up to date on our summer holiday and decoration games.<br/>★ Facebook - https://www.facebook.com/LadiesDressUp<br/>★ Twitter - https://twitter.com/ladiesdressup<br/>★ Instagram - https://instagram.com/TopGirlGames", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:39:56", "background_image": "https://media.rawg.io/media/screenshots/db0/db0c79aeb733f8a165171c153e2605a4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 83, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Girl Games - Vasco Games"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}