{"id": 230296, "slug": "summer-garden-family-yards", "name": "Summer Garden Family Yards", "name_original": "Summer Garden Family Yards", "description": "Go on an adventure in this summer garden game for kids. Dig in the family yards to craft the best flowers and trees with the most beautiful and colorful blossom. Place gnomes as a real gardener while gardening your yard. Who doesn’t want to have the best summer garden family yards memories?<br/><br/>Gardener tasks:<br/>- Cleaning and cleanup the garden<br/>- Decorate the yard with amazing decoration<br/>- Gardening the blossom and flowers for the best result<br/>- Take a bath in the pool<br/>- Wash your clothes after the job is done<br/>- Dry your clothes and dress up afterwards<br/>- Take care of the puppy and build him a happy dream house<br/>- Work in the flower shop with the most beautiful plants<br/><br/>Enjoy all the features of this amazing garden game for kids. Memoriesof you and your puppy! Redo the whole gardening process as a real gardener. From cleaning up the ground to plant seeds in the ground for flowers and blossom. Lets cleanup yourself and dress up to enjoy the adventure feelings of this amazing summer garden family yards.<br/><br/>Remake and craft amazing things in the family yards in this summer garden. Your family album can be full of pictures of you and your family working as a gardener for fun. Put gnomes in this adventure and do gardening how it is supposed to be done. Make memories for the whole family!", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:39:43", "background_image": "https://media.rawg.io/media/screenshots/53b/53b9ea90754563fddaca0b62872b9326.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 133, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Girl Games - Vasco Games"], "genres": ["Casual"], "publishers": [], "esrb_rating": null}