{"id": 230243, "slug": "girl-hotel-hostess-resort-paradise", "name": "Girl Hotel Hostess Resort Paradise", "name_original": "Girl Hotel Hostess Resort Paradise", "description": "Welcome at your first day as girl hotel hostess in Resort Paradise! Serve the guests food and drinks in the hotel restaurant or juice bar, treat them in the spa / beauty salon or cleanup the room before new guests arrive in your reception. Explore all rooms in the hotel, make your guests happy and become the most famous hotel in the world!<br/><br/>You can play the best hotel games and make your own story a success. Be the best girl hotel hostess and finish cleaning games like a rocket! Resort Paradise is growing in popularity under guests worldwide, show them that you are working hard and give your guest a pleasant stay.<br/><br/>Features of Girl Hotel Hostess Resort Paradise:<br/>- Best hotel games for girls and boys<br/>- Take care of cleaning games to makeup your beds and rooms<br/>- Fun and colorful levels with different tasks to complete<br/>- Play levels or reveal the story in different game modes<br/>- Mini games divided over multiple rooms to explore<br/><br/>Possible duties for you as girl hotel hostess in the hotel games of Resort Paradise:<br/>1. Reception; check in guests at the reception.<br/>2. Juice Bar; prepare drinks in the juice bar.<br/>3. Lobby; cleanup games in the lobby to welcome guests.<br/>4. Restaurant; serve customers food in the restaurant, you’re the chef!<br/>5. Garden; prepare a flower garden and take care of everything.<br/>6. Swimming pool; prepare the swimming pool for the summer holiday season.<br/>7. Fitness; help guests exercise in the fitness gym of Resort Paradise.<br/>8. Spa; treat people in the beauty salon, spa and sauna.<br/>9. Bedroom; cleanup games in the bedroom, bathroom and balcony.<br/>10. Bridal Suite; prepare the bridal suite for a special guest<br/>11. Room Service; cooking food and delicious meals at the room service.<br/>12. Elevator; bring people up and down with the elevator / lift.<br/>13. Laundry; do the laundry of all guests and cleanup their dirty laundry.<br/>14. Roof Terrace; cleanup the roof terrace for big parties or epic sunset bbq’s.<br/>.. coming soon ..<br/><br/>Many more rooms will come in Resort Paradise if you finish the most famous hotel games with success. Play the story or choose levels yourself as a girl hotel hostess. There’s so many hotel games in Resort Paradise, that you can enjoy playing long time.<br/><br/>Come and play hotel games in Resort Paradise and be the best girl hotel hostess ever seen!", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:39:54", "background_image": "https://media.rawg.io/media/screenshots/5c8/5c86c4f3b5a8fbfc85b0f1c06f58d463.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 154, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Girl Games - Vasco Games"], "genres": ["Casual"], "publishers": [], "esrb_rating": null}