{"id": 23033, "slug": "warhammer-shadow-of-the-horned-rat", "name": "Warhammer: Shadow of the Horned Rat", "name_original": "Warhammer: Shadow of the Horned Rat", "description": "Warhammer: Shadow of the Horned Rat follows the adventures of Morgan Bernhardt, the commander of the Grudgebringer mercenaries and leader of the Grudgebringer Cavalry regiment. Once a star student of the great Gunnery School Officer Academy, Bernhardt’s love for gold and glory had him cast out of the school and into the welcoming arms of the mercenary life. With a fine steed to carry him to battle, his dwarven-forged, magical sword Grudgebringer in his hand and an army at his helm, he and the Grudgebringers have travelled the length and breadth of the Old World, bringing honour and fame to his house. However, an insidious plot by the Skaven Grey Seer, Thanquol and his accomplice, Orc Warboss Urgat Rip-Eye, is uncovered by Bernhardt, forcing him and his troops to defend the Empire. With Paymaster Dietrich ensuring that your efforts are justly rewarded, join Bernhardt and the Grudgebringers as they enter the maelstrom of war and fight for glory, the Empire and, most importantly, gold! \n<br/><br/>\nAs the first ever video-game adaption of the Warhammer world, Shadow of the Horned Rat not only brings the table-top adventure to life in this real-time strategy, but adds its own story to the wondrous mythos. With over 25 individual troops to choose from, you can create and lead your own army to battle across the many fields of the Old World. You can also forge your own story in this adventure, choosing to follow the main story and defeat the Skaven and Orc forces, or accept the work of the many patrons Paymaster Dietrich can procure. With increasing difficulty and expansive lore, this adaptation is a fine first-step for the franchise and a must-play for both RTS and Warhammer fans alike. Lead Imperial forces against the Skaven and Greenskin Forces and defend the Empire from their nefarious plot \nCo-ordinate your army and strategise victory in real-time\nCreate your own legacy - Follow the campaign and uncover the Skaven plot, or complete your patrons’ missions and earn fame, glory and gold\nFully customise and augment your army, with over 25 troops to choose from", "metacritic": null, "released": "1995-11-11", "tba": false, "updated": "2024-04-01T01:37:47", "background_image": "https://media.rawg.io/media/screenshots/68f/68f68159604e04f01059ef94dadeb542.jpg", "website": "", "rating": 2.64, "rating_top": 1, "added_by_status": {"yet": 43, "owned": 478, "toplay": 4, "dropped": 6, "playing": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 14, "suggestions_count": 355, "game_series_count": 0, "reviews_count": 14, "platforms": ["PlayStation", "PC"], "developers": ["Mindscape"], "genres": ["Strategy"], "publishers": ["MINDSCAPE", "GOG", "SSI"], "esrb_rating": "Everyone"}