{"id": 230300, "slug": "buddy-my-virtual-pet-friend", "name": "🐱 Buddy My Virtual Pet Friend", "name_original": "🐱 Buddy My Virtual Pet Friend", "description": "🐱 Do you love cat pets? Take care of your OWN VIRTUAL PET friend now! Buddy is waiting for you in his mansion. Play wonderful cat games in this virtual pet experience. Don’t get a dumb cat simulator, get this lovely cat simulator with the best mini games and living virtual pet friend! Get Buddy and become friends!🐱<br/><br/>Buddy’s mansion is full of surprises and interactive stories to explore. Design your own outfit, go for a beauty treatment in a spa, help a hurt Buddy as a little kids doctor in a real hospital or be a food maker cooking chef and start cooking food in the kitchen!<br/>Enjoy more than 30 super fun mini games with endless possibilities; basketball, beach volleyball, hill drive, endless runner, balloon pop and many more! Try them all, be surprised!<br/><br/>Features of Buddy My Virtual Pet Friend:<br/>- Best virtual pet game starring Buddy<br/>- Lovely cat game for kids of all ages<br/>- Learn many different things in exciting stories<br/>- More than 25 fun pet mini games with addictive game play<br/>- Huge mansion with interactive story games<br/><br/>Buddy My Virtual Pet Friend is a game from Top Girl games. We publish many different easy to play girl game apps. And we hope you will like this game and please let us know how we can improve this cat simulator game <br/><br/>Note: Be aware of the possibility of children activating in-app-purchases by accident. You can prevent accidental purchases by activating the parental controls and purchase authentication in your Google Play account. Girl Games - Vasco Games is not responsible for any purchase made in the game.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:39:42", "background_image": "https://media.rawg.io/media/screenshots/425/4252504a3ae2a99794ee8b622e75eff3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 126, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Girl Games - Vasco Games"], "genres": ["Casual"], "publishers": [], "esrb_rating": null}