{"id": 230355, "slug": "animal-cove-solve-puzzles-customize-your-island", "name": "Animal Cove: Solve Puzzles & Customize Your Island", "name_original": "Animal Cove: Solve Puzzles & Customize Your Island", "description": "🌴 Explore a mysterious tropical island story, play fun matching games and make hilarious animal friends in Animal Cove! 🌴<br/><br/>Animal cove is an enchanting 3D story driven adventure with fun match 3 puzzles and custom decorations for you to choose. Solve mystery tales of the island as you play!<br/><br/>Cute animal pals await as you make friends with a dapper dog, a nerdy cat, a singing panda, and many more, including Baby Dragons and Unicorns! Customize and decorate your island while you unlock the mystery of Animal Cove through hundreds of charming story mode interactions and adventures.<br/><br/>Story games meet Match 3 skills to progress the story. You are the only human that can hear your animal friends. Play matching games to help unravel the mystery and reveal the storyline! Use the island builder to make your animal friends’ dreams come true in uniquely customized habitats.<br/><br/>A tropical tale and island adventure await. Download Animal Cove today!<br/><br/>Animal Cove Features:<br/><br/>🐶🐯Cute 3D Animals Are Your Talking Friends🐱🐼<br/>● Animals sing, tell jokes, garden, and more – all in full 3D!<br/>● Enjoy island life by unlocking movies and cinematics featuring your favorite characters at play.<br/>● Rescue pets? More like Make Friends For Life! Decorate with accessories and uncover clues as you become best buds with dogs, cats, tigers, pandas, birds, otters and other fun characters!<br/>● 3D pet games have never been so fun! Enjoy the animals and environment in full 3D.<br/><br/>💎Match 3 Games and Puzzles💎<br/>● Match 3 levels provide hundreds of challenging and exciting games.<br/>● Matching games merge pieces to create a variety of zany power-ups, like the heat-seeking chicken bomb!<br/>● Merge any two power-ups to make game-changing bonus powers with “Fusions!”<br/>● Solve puzzles of the island, whether match 3 style or the island mystery!<br/><br/>🤔Story Game filled with Mystery😮<br/>● Solve mysteries alongside your witty new BFF Winston the Dog!<br/>● Animal pals have stories to tell. Learn all about them as you play!<br/>● Story game with rich audio – hear your animal friends talk with full voiceover! <br/>● Mystery meets Match 3! Puzzle games reveal more island mysteries for you to solve.<br/>● Mystery match made in heaven! Animal puzzle adventure meet an intriguing mystery.<br/><br/>🔨Building Gameplay – Make an Island Animal Paradise🖌<br/>● Customization lets you build, paint and style your buildings and garden your way!<br/>● Decorate your tropical home and land scape the island to your style.<br/>● Zoo customization fan? City building elements allow you to create a custom seaside area to share with your new animal friends.<br/>● Choose how to decorate the island and homes for your animal companions!<br/><br/>Meet cute animals and hang out as they perform hilarious acts and share what’s on their minds. Explore the seaside and encounter mysteries that only you can solve! Unlock the secrets of the island and design the animal kingdom of their dreams. <br/><br/>Join your new animal friends and play for free! Download Animal Cove today!<br/><br/>Animal Cove is completely free to install and play. However, some game items can be purchased for real money.<br/><br/>SUPPORT<br/><br/>If you need a little help with your animal friends, make sure to visit www.AnimalCoveGame.com and check out the FAQs. Still need help? There’s information on that page to contact our support team.<br/><br/>COMMUNITY<br/><br/>For the latest news and info, you can find Animal Cove on: <br/>Facebook - https://www.facebook.com/AnimalCoveGame/<br/>Twitter - https://twitter.com/AnimalCoveGame<br/>Google Plus - https://plus.google.com/b/106439573788392753644<br/>Privacy Policy - https://www.kingsisle.com/corporate/mobile/privacy-policy <br/>Terms of Service - https://www.kingsisle.com/corporate/mobile/terms-of-use", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:39:37", "background_image": "https://media.rawg.io/media/screenshots/894/8941fea357bf56f18ce78ce22d75cccd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 180, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["KingsIsle Entertainment"], "genres": ["Casual"], "publishers": [], "esrb_rating": null}