{"id": 230437, "slug": "noteworks", "name": "NoteWorks", "name_original": "NoteWorks", "description": "NoteWorks is a musical game, designed to teach note recognition and improve sight reading skills. Hungry Munchy is eager to swallow elusive blue notes. Your goal is to help Munchy catch each note as quickly as possible. <br/><br/>The game combines learning and fun into a single gratifying experience. The app is both educational and entertaining, with an intuitive and visually appealing interface. <br/><br/>NoteWorks was created for: <br/>• Players of all ages. <br/>• Beginners to advanced music students. <br/>• Families with multiple players. <br/>• Music teachers with multiple students. <br/><br/>Game design features include: <br/>• A funny animated character. <br/>• User-friendly menus. <br/>• Superb graphics. <br/>• Engaging sound effects. <br/><br/>Note reading options: <br/>• On-screen piano keyboard input.<br/>• On-screen guitar fretboard input.<br/>• MIDI keyboard input.  <br/>• \"A, B, C\" note naming:<br/>. . . CDEFGAB<br/>. . . CDEFGAH<br/>. . . ABCDEFG<br/>. . . AHCDEFG <br/>• \"Do, Re, Mi\" (Fixed Do) note naming. <br/>• Treble clef. <br/>• Bass clef. <br/>• Tenor clef. <br/>• Alto clef. <br/>• Custom note range in all four clefs.<br/><br/>Educational features: <br/>• Students learn by playing and having fun. <br/>• Multiple game settings allow players to stay in control. <br/>• Students can choose to play with hints. <br/>• Students play without hints to earn points and stars. <br/>• Students learn to recognize notes instantly, on sight. <br/>• For beginners, the game starts by teaching a limited range of notes. <br/>• Note range can be easily customized as students advance. <br/>• After mastering accidentals, students learn key signatures. <br/>• Game speed is controlled to increase or decrease difficulty, or students may choose to play without any time limit.<br/>• Sharing of game progress: ability to share game results with teachers.<br/><br/>While music teachers persistently stress the importance of sight reading, most teachers prefer not to spend valuable lesson time on basic note recognition skills. Thus, NoteWorks helps music teachers concentrate on more interesting aspects of their art, such as technique and musicality. <br/><br/>Serious music students can take advantage of the game to learn clefs outside of their own instruments, as well as prepare for music theory exams. In addition, non-musicians could use NoteWorks as an interesting memory game, to help keep their minds sharp and quick. <br/><br/>NoteWorks was created for people who like to learn by playing and having fun. It was designed with the objective of neither being too easy nor too hard, and never boring. We hope you'll find NoteWorks both useful and entertaining, and we would greatly appreciate it if you could share your thoughts and opinions about the game by rating it.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:39:32", "background_image": "https://media.rawg.io/media/screenshots/2d7/2d7046ba08eee669aa56006f5edfbb5b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 131, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Azati"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}