{"id": 230470, "slug": "501-free-new-room-escape-game-unlock-door", "name": "501 Free New Room Escape Game - unlock door", "name_original": "501 Free New Room Escape Game - unlock door", "description": "HFG brings you this point and click type latest new room escape games especially for the escape games lovers. 501 Free New Room Escape Games is a combo of 501 room &amp; door escape games of various locations. After playing all these 501 Free New Escape Games, surely you will have the feel of escaping in a logic way and give reality. That kind of experiences is assured by these Escape Games. Almost all room escape games have players locked inside the room and how they escape from the rooms by open the doors. But this 501 Free New Room Escape games will give you more excitement and relaxation than other room escape games, as the rooms are filled with cryptic puzzles that have to be cracked. So, these Room Escape games will surely make all the players addicted to it and it will definitely test your intelligence through your escaping skill. <br/><br/>Highly successful room escape game in this year 2019. You have ever dreamed to escape in these 501 levels is easy. If you think like that then don't wait to try and start your mission. Ready with confidence to face challenging different varieties of logical puzzles, mysteries journey continued from each and every rooms, thrilling twist in the stories, more struggles to find the hidden objects, need high memory power to arrange objects. If you are crossing all these stages then only possible to unlock the doors and locks.<br/><br/>Giving more exciting action and hard brain challenge. Most helpful to increase memory power.<br/><br/>You are an escape category games lover then first verify this<br/>You are an expert in facing brain challenges, start playing today.<br/>Your eyes are too sharp then try to find these hidden objects.<br/><br/>Having lots of mystery puzzle and they are waiting to entertain you. In this puzzle escape game completely give the huge challenge to your brain. These games will give more relaxation and definitely create the addictiveness.  <br/><br/>All time famous game with crossed over a million players. Here now having 501 levels waiting. Let's start your journey now but it not coming to an end. Surely the journey is having more adventurous and riddle fields.<br/><br/>FEATURES: <br/>501 Levels with different doors &amp; exits\t<br/>Tricky Challenging brain teaser  <br/>Beautiful graphics designs and sound.<br/>Addictive Gameplay (250 hours).<br/>Riddling Logic mysteries Puzzles waiting for unlocking.<br/>Free game coins are given daily<br/>Charming rooms with lots of hidden clues and solutions.<br/><br/><br/>Follow Us:<br/>Facebook: https://www.facebook.com/Ena-Andriod-Games-317895295064950/<br/>Twitter: https://twitter.com/EnaGamesAndroid<br/>Google +: https://plus.google.com/u/0/102488694792304952641", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:39:27", "background_image": "https://media.rawg.io/media/screenshots/53e/53e94cca8ed3e25973c9b6fabcbf5920.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 339, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Hidden Fun Games"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}