{"id": 230491, "slug": "war-of-legions", "name": "War of Legions", "name_original": "War of Legions", "description": "[One Year Appreciation]Over 1.5 million downloads!<br/>Real-time battles enjoyed the world round!<br/>Become the top Guild in the world!<br/>◆Top free game on the Japanese App Store!◆<br/>◆Guilds of up to 20 people compete for global glory!◆<br/><br/>=============◆STORY◆============<br/>The Legion of Order, those that strive for peace through pacification, and the Legion of Chaos, those that strive for revolution through destruction, are warring for control of a great land known as Mevion.<br/><br/>Mevion's inhabitants and the Monsters that serve them take to the battlefield in hopes of securing victory for their side!<br/><br/>=======◆WAR OF LEGIONS DETAILS◆=======<br/>■Form a Guild with your friends!<br/>Create Guilds of up to 20 members and increase your Guild's level to gain supremacy in the battle for Mevion!<br/><br/>■Form battle pairs of Warriors and Monsters!<br/>Assemble battle Formations consisting of pairs of two types of characters: Monsters and Warriors! Certain combinations offer stat boosts in combat, so find the most effective pairs to defeat your enemies!<br/><br/>■Take part in global real-time Guild Battles and become the best Guild in the world!<br/>Guild Battles are held several times every day! Form strategies with your Guild members to link together attack Chains and unleash powerful Guild Assault Attacks!<br/><br/>■Varied lineup of characters!<br/>Over 2,000 characters featuring artwork from international artists! Knights, dragons, elves, wizards, golems, and more that you can't even imagine!<br/><br/>===========◆NOTE◆===========<br/>*The game may be difficult to access during peak play times. If you are unable to begin the game, please try again at a different time.<br/><br/>*The game may not be available in all countries and regions.<br/><br/>*The game may not launch or operate properly if your device's date and time settings are not correct. Please confirm your date and time settings before playing War of Legions.<br/><br/>*Loading times may be increased when playing in an environment with a weak cellular or Wi-Fi signal.<br/><br/>*A Wi-Fi connection is recommended to smoothly enjoy War of Legions.<br/><br/>*Under certain conditions, the game may fail to run smoothly. If you experience choppy gameplay, force-closing the app, rebooting your device, and clearing your cache may improve performance.<br/><br/>===========◆CONTACT◆=========== <br/>For any inquiries regarding War of Legions, please contact us via the link on the official War of Legions home page. <br/>Information on supported devices can also be viewed on the below page.<br/>*Depending on the installed OS version and network conditions, gameplay may be unstable even on supported devices.<br/><br/>▼Official Home Page <br/>http://www.waroflegionsgame.com/support/", "metacritic": null, "released": "2013-07-15", "tba": false, "updated": "2019-10-22T14:11:03", "background_image": "https://media.rawg.io/media/screenshots/4ef/4efe756c849cdcedea688a6c63cad861.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 336, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Ateam"], "genres": ["Adventure", "RPG"], "publishers": ["Ateam"], "esrb_rating": null}