{"id": 230495, "slug": "the-dark-fence-horror-room-escape", "name": "The Dark Fence - Horror Room Escape", "name_original": "The Dark Fence - Horror Room Escape", "description": "Welcome to Dark Fence! - Halloween Fantasy World<br/>              *  Set About an astonishing excitement in dark fence.<br/>              *  Are you ready to get out of the room game and escape the lock.<br/>              *  Prove that you are good stalking and solve the baffle and exit the room. <br/><br/>Escape from the Darkness, Be careful of the scary black shadows. Then find the ghost lighted Pumpkins. You ready to inventory secret in the Panic Room and find the Hidden objects get out of the room escape.   <br/><br/> All the 30 levels you feel different astonishment thrilling adventures in feel panic room compare to another play escape! <br/><br/>You feel horror in an Xscape room.  Find all the mystery keys with which you can unhitch hatchway otherwise are very difficult to open. It's not easy to find the hidden keys. Work your brain to solve the puzzles and exit the room. <br/><br/><br/> The dark fence is free to download and play escape games some game items can also purchase in real money.<br/><br/>       If you are high and dry, you can use the inkling function  <br/><br/>       unhitch substantial: puzzels secret information hidden objects. <br/> <br/>       Interact with the objects in immersive room escape puzzle games.     <br/> <br/>      Thrilling hidden objects and inventory-based puzzles.<br/> <br/>     Squeeze into littlest details unhitch substantial play escape, secret into hidden breaks and try to escape an Xscape room.<br/><br/> <br/>  STORY :<br/> <br/>                The story of the game is about a Hell world, in which the Primary hierarchy is decided by the number of souls each guardian has captured. It is a rule that no soul should be taken away from a living person. Brongodo is a low-level guardian who sets out to capture souls of living beings using dark world magic taught to him by the dark world prince. Using the magic he can capture the souls, leaving behind just a little spark of life. This will make his actions invisible to his superiors.<br/> <br/>On his evil Journey, Brongodo captures the soul of Rhiannon, The Chief of Heiligen Heofon. His son, Casper, seeking to find the soul of his father meets the witch mother of the Magic Realm. Rhiannon had once saved the witch mother from the supreme race. Returning the favor, The witch mother assists Casper to find his father's soul by taking him to other worlds of various dimensions using her witchcraft. <br/><br/> <br/>FEATURES :  <br/>Traverse a different panic room and escape the room challenge. <br/>30 Levels of different doors to exit the room.<br/>Attractive Gameplays. <br/>Amazing Animations in 2D Graphics.<br/>Defy yourself with the amazing puzzles in many different locations.<br/>More than 100 unparalleled Puzzles. <br/>Find hidden objects and get rewards. <br/>Highly performing in Low Memory usage. <br/> <br/> Your Fantasy Adventure can't wait anymore. Let's download the game now.....<br/><br/><br/>Stuck in Game - Get Help - Any Suggestion about the game, please contact us through below social media links. We are ready to help you...<br/><br/>Facebook: https://www.facebook.com/Ena-Andriod-Games-317895295064950/<br/>Twitter: https://twitter.com/EnaGamesAndroid", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:39:21", "background_image": "https://media.rawg.io/media/screenshots/1fc/1fcaf23a87a4bc95bcada38696dad67f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 467, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Hidden Fun Games"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}