{"id": 230567, "slug": "bubble-popland-bubble-shooter-puzzle-game", "name": "Bubble Popland - Bubble Shooter Puzzle Game", "name_original": "Bubble Popland - Bubble Shooter Puzzle Game", "description": "Bubble shooting is funnier with cats. Our only concern is to make Tia happy. You’ll see it is not so easy to satisfy this lovely cat. Uhm, I am not sure whether this cat is really lovely. Maybe it is a bit itchy :) Anyway, you can make Tia  rejoice with biscuits and some toys like clew and balls.<br/><br/>Bubble Popland is a fun bubble shooter game free for adults. Some of the levels are easy to relax, some are difficult to challenge just like brain training puzzle game. <br/><br/>Aim and shoot bubbles! Never get bored thanks to the surprises and challenges in this bubble shooter game!<br/><br/>This shooting bubble game offers many puzzle game modes to avoid being bored. Delicious cookies, cat food, milk and toys are placed among bubbles. You will pop bubbles in the same color with the bubble on the launcher. Some obstacles like bubble spinner modes, icy bubbles on your way make you shoot bubbles strategically like in a puzzle game. Don’t worry! We put some surprising bubbles blasting all bubbles under it!<br/><br/>Super power-ups help you be the favorite playmate of Tia!<br/><br/>If you don’t want to see Tia glaring at you, you can use super power-ups such as marbles and peg-tops to burst bubbles in different colors in one move.<br/><br/>The more stars you collect, the more gifts you win!<br/><br/>Each bubble popping level you achieved adds star to your star box and after 20 stars are collected, gifts like unlimited lives, power-ups and coins are given to you!<br/><br/>Some tips to get more fun of this bubble game:<br/><br/>Shooting bubbles continuously brings more coins.<br/>Spend your coins to use power-ups popping more bubbles in one move.<br/>Bounce the bubbles on the walls to thread through bubbles and obstacles<br/>Win gifts with the daily spin wheel.<br/>Connect to Facebook to synchronize your progress on all devices<br/>Update the game for free when new updates are available on the market<br/><br/>How to play bubble games:<br/><br/>- Tap the targeted area to launch bubble to blast bubbles<br/>- Aim the same color bubbles, you need to match 3 at least<br/><br/>Follow us on social media:<br/><br/>https://www.facebook.com/Bubble-Popland-607256949413375/<br/>https://twitter.com/PoplandBubble<br/>https://www.instagram.com/poplandbubbleshooter/", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:39:16", "background_image": "https://media.rawg.io/media/screenshots/9db/9dbd5866095cd490420aa59f5be1bf37.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 52, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Narcade"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}