{"id": 230628, "slug": "snot-fluff-kids-story-book-learn-to-read", "name": "Snot & Fluff - Kids Story Book: Learn to Read", "name_original": "Snot & Fluff - Kids Story Book: Learn to Read", "description": "Mum, Dad, can I watch a movie? - how often do we hear these requests. This is where “Snot and Fluff - a Space Adventure” will speed to the rescue. This is an interactive story book with features of an adventure game for children aged 4 to 10. <br/><br/>This is a funny and educational story of friendship, courage and helping others. It will take your child and yourself on an amazing journey to distant galaxies full of colourful planets. You will meet various creatures, strange animals and together you will experience an unforgettable adventure.<br/><br/>The game DOES NOT include any advertisements, references to Internet websites or micro-payments! Your child may safely use it on a tablet or phone.<br/><br/>You will meet two friends: Snot and Fluff. The former is a traveller, an adventurous globetrotter, whereas the latter is quite the opposite - a home-loving amateur baker of new types of cookies. One day, Snot feels bored with everyday tasks and sets out on a  space journey, forgetting about his friend for a while. Fluffy, lonely and longing for the company of his buddy, builds a rocket and embarks on a journey to look for Snot. Will he manage to find him? <br/><br/>Key features:<br/>•  This is a story created by the authors of an interactive tale which gained global recognition: “Amelia and Terror of the Night” and illustrated by Agata Karelus, a renowned artist loved by children<br/>•  Hundreds of cartoon animals, monsters and weird objects<br/>•  45 boards with hand-drawn illustrations<br/>•  Offline Audio Bedtime Story for Kids with lyrics <br/>•  Professional narrator reading the story<br/>•  More than 35 minutes of professional soundtrack<br/>•  More than 400 funny sounds<br/>•  88 hidden stars to be discovered<br/>•  A secret room at the end of the story<br/>•  3D effect while tilting the tablet/phone<br/>•  A perfect story for children aged 4–10, both for boys and girls<br/>•  A story with a moral<br/>•  It can be read as a bedtime story<br/>•  Easy, intuitive navigation<br/>•  Page index, which makes it possible to gain easy access to any board in the story<br/>•  5 language versions: English. Polish. Russian. Spanish. Chinese<br/><br/>Furthermore:<br/>•  Together find a key to the pirates’ secret box<br/>•  Sit behind the steering wheel of a space rocket<br/>•  Solve the mystery of the electric cave<br/>•  Visit an alien spaceship<br/>•  Help the Crescent King solve his embarrassing problem<br/>•  Meet princess Candy<br/>•  See what the Moon looks like on the inside<br/><br/>Have you had enough of classical fairy tales?<br/>The Sleeping Beauty is snoring too loud?<br/>Three Little Pigs have finally built a stronghold?<br/>Puss in Boots started chasing around barefoot?<br/>Has the wolf already eaten the Little Red Riding Hood?<br/>Thumbelina couldn’t be any smaller and Cinderella has a closet full of shoes?<br/><br/>If so, it’s time you showed your child stories created by OhNoo studio. <br/><br/>What have other parents said about the game?<br/>- A great interactive story without violence. Together with my daughter, we continue to discover new animals hidden on colourful planets. Reading the story while looking for hidden elements turn out to be just the thing. Funny and amusing!<br/><br/>- This is his favourite bedtime story. Sometimes we also listen to the English version and I believe this is a perfect way to start learning the English language. Education combined with play.<br/><br/>- It’s the best interactive book for kids I’ve ever seen. It’s fun and colourful. The choice of the reader and soundtrack are also impressive. It’s great fun for younger and older kids as well as adults. Your child will love it.<br/><br/>Contact<br/>If you observe any problems with the story, have any questions or comments, please contact us at your convenience: contact@ohnoo.com. We would also like to invite you to visit our website www.ohnoo.com to get more information on other interactive books and games.<br/><br/>Facebook: https://facebook.com/OhNooStudio<br/>Twitter: https://twitter.com/ohnoostudio", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:39:13", "background_image": "https://media.rawg.io/media/screenshots/a34/a3407f971ac84bc5acdcbc22672be5c4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 305, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["OhNoo Studio"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}