{"id": 230620, "slug": "fox-tales-kids-story-book-learn-to-read", "name": "Fox Tales - Kids Story Book: Learn to Read", "name_original": "Fox Tales - Kids Story Book: Learn to Read", "description": "“Fox Tales” is an interactive story with features of an adventure game for children aged 5 to 12. It will be excellent both as an individual activity for a child and as a bedtime story, read out by parents. Since the text is visible on the screen, the story may also be a perfect aid when the child learns to read. The text may be read out by the parents or by a professional reader.<br/><br/>The game DOES NOT include any advertisements or micro-payments! When your child is reading “Fox Tales”, you may be satisfied.<br/><br/>This is a great story of brave foxes, who set out on a long, dangerous journey. It all starts when one day there is a series of earthquakes on the Fox Island. Two brave individuals are chosen from among the fix tribe: ferocious Samar and Kala the hunter. Their task is to find the cause of the earthquakes and solve the problem. The foxes set out on a dangerous and long journey. On their way they meet many strange animals and oversize creatures and experience numerous unforgettable adventures and funny situations. Will they manage to trace the source of the problems and protect the fox village from disaster? See for yourselves.<br/><br/>Key features:<br/>•  45 pages with hand-drawn illustrations<br/>•  The text is read with a suggestive interpretation of a professional reader, which makes learning to read much easier <br/>•  Apart from its literary value, the book also has educational merits  <br/>•  The book stimulates children’s imagination and contains valuable cognitive techniques and literary content<br/>•  Looking for hidden elements improves dexterity and concentration<br/>•  More than 35 minutes of professional soundtrack<br/>•  84 hidden stars to be discovered<br/>•  A secret room at the end of the story<br/>•  3D effect while tilting the tablet/phone<br/>•  A perfect story for children aged 5 to 12<br/>•  A tale for both girls and boys<br/>•  It can be read as a bedtime story<br/>•  A story with a moral<br/>•  Easy, intuitive navigation<br/>•  Page index, which makes it possible to gain easy access to any board in the story<br/>•  5 language versions: English. Polish. Russian. Spanish. Chinese<br/>•  A tale created by the authors of “Amelia and Terror of the Night” - an internationally appreciated and rewarded interactive tale.<br/>•  The story can also be played without the reader.<br/><br/>Furthermore:<br/>•  Visit Fox Valley and its inhabitants<br/>•  Help the Ogre construct a magic fishing rod<br/>•  Escape from the Snake Mountain<br/>•  Find a way to get inside the belly of a giant whale<br/>•  Win a fight with an enormous spider<br/><br/>Have you had enough of classical fairy tales? Is your child fed up with Pinocchio’s constant lying? Has the wolf already eaten the Little Red Riding Hood? Thumbelina couldn’t be any smaller and Cinderella has a closet full of shoes? Then it’s time to present your child with the stories from OhNoo studio. <br/><br/>What have other parents said about the game?<br/><br/>– This is exactly what I have been looking for. I read it to my six-year-old son at bedtime. »Fox Tales« is his favourite story now. Learning to read and playing at the same time, that’s what it is. We are looking forward to next stories.<br/><br/>– A wonderful story! I can recommend it to all parents. We read it together with my son in the morning and in the evening. Due to the subject matter, this particular story seems to be more popular with boys than girls. Giant spiders and snakes, fighting the muddy monster. Our daughter, on the other hand, appreciates another story from OhNoo studio - <br/>»Amelia and Terror of the Night«. The protagonist is a girl named Amelia - she’s exactly like our daughter.<br/><br/>– A great story to read and listen to! It is read with professional intonation. It captures a child’s attention. You can see that the authors really made an effort with this production! And the game with looking for hidden elements is just perfect! We have all the previous stories from this series and we can recommend all of them!<br/><br/>Like us: facebook.com/OhNooStudio<br/>Email us: contact@ohnoo.com<br/>Learn more about OhNoo story books for kids at www.OhNoo.com", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:39:14", "background_image": "https://media.rawg.io/media/screenshots/2e5/2e514d9a9f476db5ae17d146451a7db0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 328, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["OhNoo Studio"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}