{"id": 23069, "slug": "warhammer-40000-rites-of-war", "name": "Warhammer 40,000: Rites of War", "name_original": "Warhammer 40,000: Rites of War", "description": "<p>Inspired by the board and figurine games made popular by Games Workshop, the universe of Warhammer 40,000 is a vast and violent one, rife with strange, alien races, including the Eldar®. The mysterious Eldar are all that remains of a once great and powerful civilization that ruled the galaxy. They travel the stars in enormous spacecraft called Craftworlds, seeking the Maiden Worlds their ancestors created in ancient times.<br />\nOne such world is now inhabited by humans and possesses historical records and artifacts of great power far too valuable to leave in their hands. This once proud race now fights for its very survival, and must protect the secrets and power of their ancestors from both the Imperium of Man and the evil, bio-engineered Tyranids, bent on the destruction of this fertile paradise.<br />\nRites of War features a tightly crafted storyline composed of 24 missions and varied victory conditions as you lead the Eldar in their fight for survival. Additional scenarios allow for control of Tyrannid and Imperial armies and a glory point system lets you build and customize your own army, with 8 distinct troop classes ranging from War Machines to Assault Troops to Devastator Squads. A level-based experience system enhances the game&#39;s RPG (Role-Playing Game) element, allowing you to upgrade and customize units, enhance warrior skills and employ &quot;psyker&quot; (psychic) abilities. 24 mission campaign features a tightly crafted storyline, detailed atmosphere and varied victory conditions.<br />\nAdditional scenarios let you command Tyrannid and Imperial armies<br />\nGlory point system lets you build and customise armies, with your choice of unit types, wargear and warrior skills</p>", "metacritic": null, "released": "1999-07-22", "tba": false, "updated": "2023-04-30T00:24:30", "background_image": "https://media.rawg.io/media/games/a8e/a8e7e729420e8b40abf04f7a93ff0e0b.jpg", "website": "", "rating": 2.68, "rating_top": 3, "added_by_status": {"yet": 75, "owned": 849, "beaten": 4, "toplay": 3, "dropped": 10, "playing": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 25, "suggestions_count": 582, "game_series_count": 39, "reviews_count": 25, "platforms": ["PC"], "developers": ["DreamForge Intertainment"], "genres": ["Strategy"], "publishers": ["GOG"], "esrb_rating": "Teen"}