{"id": 2307, "slug": "monster-shooter-the-lost-levels", "name": "Monster Shooter: The Lost Levels", "name_original": "Monster Shooter: The Lost Levels", "description": "More levels, more enemies, more weapons... GET THE BEST MONSTER SHOOTER EVER - NOW!<br/>Monster Shooter: The Lost Levels is the totally ad-free, premium edition of quite possibly the best dual-stick shooter mobile game ever – with brand-new content and exclusive features!<br/><br/>★★★ \"Exploding Alien Faces Is Quite Fun, Actually\" - TouchArcade review ★★★<br/><br/>Your mission:  survive wave after wave of alien baddies and save the cute, cuddly kitten. Find all you need to annihilate your extraterrestrial antagonists in the fully-stocked armory. Upgrade your weapons to unleash even greater destruction. Improve your chances of success with useful perks and items. Challenge your friends to beat your high-score in Survival Mode. Will you emerge victorious?  Time will tell.  The only thing we can guarantee is many, many hours of the most exciting gameplay you’ll find on a mobile!<br/><br/>HIGHLIGHTS:<br/>- New levels, new enemies, new weapons!<br/>- 80 challenging levels on 4 different planets<br/>- 14 upgradeable weapons<br/>- Over 80 Game Center achievements<br/>- Game Center leaderboards in survival mode<br/>- Over 100 missions<br/>- Ultra-cute hand-drawn 2D graphics<br/>- Stunning visual and audio effects<br/><br/>---<br/>Remember to join our Fan Page on Facebook for the latest updates on our games, previews and hints:<br/>facebook.com/monstershooter<br/>facebook.com/gamelion <br/><br/>If you're on Twitter, follow us on:<br/>twitter.com/gamelion <br/><br/>Contact us via email: <br/>support@game-lion.com", "metacritic": null, "released": "2012-05-10", "tba": false, "updated": "2019-10-22T14:04:36", "background_image": "https://media.rawg.io/media/screenshots/2a8/2a810873639d28ac9042e3483594e0b7.jpeg", "website": "http://www.monstershooter.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "beaten": 1, "toplay": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 266, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["Huuuge Games"], "genres": ["Action", "Arcade"], "publishers": ["Huuuge Games"], "esrb_rating": null}