{"id": 230766, "slug": "league-of-light-wicked-harvest-full", "name": "League of Light: Wicked Harvest (Full)", "name_original": "League of Light: Wicked Harvest (Full)", "description": "Unlock the complete adventure with a single purchase! No in-app purchases!<br/><br/>Children have been going missing in the town of Blake’s Mountain in the days leading to the fabled Red Moon. The League of Light needs your help solving this strange and spooky case!<br/><br/>• UNRAVEL THE SECRETS OF BLAKE’S MOUNTAIN<br/>Follow the trails, uncover secrets and clues from hidden object scenes, and solve various mini-games and puzzles on your quest to bring back the lost children!<br/><br/>• DISCOVER THE LEGEND OF THE RED MOON<br/>No one really knows what will happen on the night of the Red Moon, but everyone agrees it can’t be good… Strange creatures creep through the shadows, and the citizens fear for their safety.<br/><br/>• WHO OR WHAT IS BEHIND THE CHILDREN’S DISAPPEARANCES?<br/>A wicked Scarecrow has invaded Blake's Mountain and kidnapped innocent children to perform the historical Red Moon Ceremony!<br/><br/>• SAVE THE HEALER’S DAUGHTER IN THE BONUS CHAPTER!<br/>Fill your achievements room, find 25 hidden owls, and unlock bonus content! Then enjoy extras such as beautifully drawn wallpapers and concept art sketches!<br/><br/>• Find thousands of hidden objects, plus solve tons of mini games and puzzles!<br/>• Unlock this incredible Collector's Edition to gain access to all of the amazing bonuses and additional gameplay!<br/><br/>*** Discover more from Big Fish Games*** <br/><br/>Sign up for our newsletter and never miss a new release or promotion again: http://bigfi.sh/AndroidSplash<br/><br/>Check out our entire game library with our Big Fish Games app absolutely FREE here: http://bigfi.sh/BFGAMGoog<br/><br/>Visit Big Fish Games, a leading developer, producer, and publisher of puzzle, adventure, casual, card &amp; casino games!<br/><br/>VISIT US: www.bigfishgames.com<br/>WATCH US: www.youtube.com/bigfishgames<br/>FOLLOW US: www.twitter.com/bigfishgames<br/>TALK TO US: www.facebook.com/bigfishgames", "metacritic": null, "released": null, "tba": false, "updated": "2019-02-05T07:15:32", "background_image": "https://media.rawg.io/media/screenshots/cd8/cd87f13df436ca4df58028522836048d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 265, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Big Fish Games"], "genres": ["Casual"], "publishers": [], "esrb_rating": "Everyone 10+"}