{"id": 230866, "slug": "blocky-cars-online-shooting-game", "name": "Blocky Cars - Online Shooting Game", "name_original": "Blocky Cars - Online Shooting Game", "description": "Are you looking for an awesome car shooter?<br/>Blocky Cars is not just a gripping pixel game but even more! It is extraordinary<br/>shooting game with crafting and a great variety of online modes. Build futuristic robots and fight with other players worldwide!<br/><br/>Blocky Cars is the mix of all your favorite features in one place:<br/><br/>- Create cars: collect blocks (more than 90!). Wheels, turbines, tank tracks, sniper guns, turrets and many more for your car or tank!<br/><br/>- 15 fascinating maps created in 3D!<br/><br/>- Various modes: create team battle, capture the flag, stand alone in your car or.. get out of it to show your rivals who's the boss in FPS heroes mode!<br/><br/>- Up to 8 players on the same map: hang out in chat, play together in online multiplayer! Develop your own tactics, form a brigade and combat against your enemies on the hardest battlefields!<br/><br/>- Show your individuality: choose a skin or draw it by yourself with a special editor<br/><br/>How often do you find shooters with user-friendly crafting of tanks? Try this online game! Create fantastic vehicles and customize your hero, choose an awesome gun...<br/>Grab your buddies, get into your tanks and start an epic fight!<br/><br/>Play Blocky Cars - the most imaginative online shooter game!<br/><br/>Join our official #BlockyFans communities and Blocky Cars channels on social media:<br/>- Like us and follow the latest news on Facebook at http://facebook.com/blockycars  to get more info about all our upcoming updates.<br/>- Check out our videos and game trailers on https://www.youtube.com/c/blockycars<br/>- Subscribe on our Instagram https://www.instagram.com/blocky.cars.online/<br/><br/>Terms of Use: goo.gl/CA6ZCP", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-31T04:32:37", "background_image": "https://media.rawg.io/media/screenshots/2c3/2c3e97662fee9ab70a103bd9d619fb94.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 287, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Full HP", "Fahrenheit Lab"], "genres": ["Action"], "publishers": [], "esrb_rating": "Everyone 10+"}