{"id": 23091, "slug": "sea-dogs-caribbean-tales", "name": "Sea Dogs: Caribbean Tales", "name_original": "Sea Dogs: Caribbean Tales", "description": "<p>Sail the rough seas with your tall ship and loyal crew of vicious cutthroats and fierce corsairs. Build up your fleet and capture and rule colonies to become the mightiest pirate of them all!<br />\nSea Dogs: Caribbean Tales is a naval game devoted to pirate adventures on the Caribbean seas of the 17th century, aiming to be the ultimate pirate simulation. Sea Dogs: Caribbean Tales models all the details of a sword swinging pirate&#39;s life and misses no part of his everyday adventures. Taking the role of reckless fortune-hunter Blaze or redheaded daredevil Beatrice – you will navigate your sailor in the original seas of the Caribbean, trade multiple goods, plunder merchant convoys, accomplish quests, build up your fleet, capture and rule colonies and much more. In addition, the game can be played in third person perspective, allowing you to walk through your colonies or fight with your own sword, side by side with your crew, and challenge every other captain on the sea!<br />\n- Develop your captain&#39;s skills, muster your crew, battle fierce enemies, and gain treasure and fame!<br />\n- Fight epic naval battles with a squadron of up to 4 vessels and 16 different sailing ships with upgradeable features<br />\n- Exciting weather conditions with devastating storms in full day and night cycles<br />\n- Hone your fighting skills with both swords and guns, trade with merchants, and solve challenging quests to make your fortune<br />\n- Conquer and manage colonies, construct town buildings and improve your defenses<br />\n- Join multiplayer battles with up to 16 opponents in four multiplayer modes: Deathmatch, Team Deathmatch, Defend the Convoy and Capture the Fort</p>", "metacritic": null, "released": "2006-09-11", "tba": false, "updated": "2023-11-18T22:05:59", "background_image": "https://media.rawg.io/media/screenshots/adf/adfd9a73de01abc574381b8822a227a0.jpg", "website": "http://en.akella.com/Game.aspx?id=11", "rating": 3.68, "rating_top": 4, "added_by_status": {"yet": 13, "owned": 100, "beaten": 26, "toplay": 7, "dropped": 11, "playing": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 31, "suggestions_count": 456, "game_series_count": 4, "reviews_count": 31, "platforms": ["PC"], "developers": ["Akella", "Акелла"], "genres": ["Action", "RPG"], "publishers": ["Akella", "Playlogic Entertainment"], "esrb_rating": "Teen"}