{"id": 230962, "slug": "fish-hunterban-caban-ca", "name": "Fish Hunter⭐Ban Ca⭐Bắn Cá", "name_original": "Fish Hunter⭐Ban Ca⭐Bắn Cá", "description": "An amazing fish catching, shooting game with amazing features. You are a fisher, fish hunter in this game and needs to catch fish. Amazing colored sea environment, with beauty of nature, cool underwater graphics and interface. <br/><br/>Try fish hunting, catching using net fishing, fishing net, guns and many other weapons. In this Fishing Games Fishing sage, Fishing, fish hunter you will see different beautiful and precisions fishes are wandering. Catch them or hunt fishes by weapons and get more coins, upgrades. Unlock many challenging stages by upgrade and get hell out of fun of sea, water, shooting games. <br/><br/>If you really wana get fish hunting fun, with real, fish hunting games 3d then you are on right place. In this Fishing hunter, fish hunting, fish shooter, fish hunting game, games, you’ll act as a fisher and have a deep-ocean experience catching fishes and other sea creatures. <br/><br/>You can catch, shoot, hunt all the fishes available in the diameter just need to be clever and sharper to catch them. You just need to make a proper direction of shooting target, the far you pull the powerful the fish shoot. Increase your shooting skills with hunting, hunter game, fish hunter, fishing games for free. And become a skillful fish hunter champion, fish shooter, fish hunter free. <br/><br/>***How to play***<br/>+ Its simplest to learn but harder to be the master of this game.<br/>+ Once the game has begun tap a target to shoot and catch the fish <br/>+ Cheese is available you can use cheese to make fishes come at a specific point place and can shoot at them at once<br/>+ Player can also use the change button to change between the 9 guns at any time during the game, which have various net sizes and power levels player is using;  <br/>+ Use power-up items to enhance your playing\u2028<br/>+ Try to complete all missions <br/>+ Get all fishes as much you can!<br/><br/>***With amazing features***<br/>+ Amazing handling – fully controls within the whole game<br/>+ Lots of different variations – You need to go with them with high accuracy – time calculation – Needed to be precise in this fish hunting adventure, fish hunter free, catching games. <br/>+ Very addictive, hard game – It is best among fish catching, fish shooting game, games.  <br/>+ Full compatibility with all devices. Designed to look good on low resolution and high resolution devices<br/>+ Here you need to learn something more than just shooting <br/>+ You have cheese to form a trap and then guns to shoot in fish hunter 2019, updated version. <br/>+ More you go farther more troubling stages, situations with full surprises will come in this hunting game free <br/>+ It is challenging, adventurer game<br/>+ Amazing soundtracks – Amazing sounds on win or lose and during playing game. Let you feel in real sea life in this fish hunter game.  Enjoy the game with fast-paced soundtrack.<br/>+ Game made for all ages including kids – get fishing joy and become fish shooter<br/>+ One of the best Fish hunting, water, sea games, fish hunter shooting game. By one of the top best developers.<br/><br/>Try for being a Fish hunter and get your chance for fish hunting. Totally new features unique game and challenges!!! Best game to play. \u2028<br/>Download for free and except the challenge to hunt fish! Download for free and play game...\u2028<br/>Run and play the game for free, developed by top, best game developers.<br/><br/>***Contact Us***<br/>+ Visit our official site at http://www.senspark.com\u2028<br/>+ Send your feedback via feedback@senspark.com\u2028<br/>+ Like &amp; follow on https://www.facebook.com/TeamSenspark\u2028\u2028<br/><br/>SENSPARK Game Studio is the studio behind the success of the top download classic casual games: Gold Miner, Shoot Dinosaur Eggs, Line 98, Jewel ...", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:38:26", "background_image": "https://media.rawg.io/media/screenshots/3d5/3d505d2ee429fd9126c1f29fcb779fac.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 284, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["SENSPARK CO"], "genres": ["Casual"], "publishers": [], "esrb_rating": null}