{"id": 23099, "slug": "rage-of-mages-ii-necromancer", "name": "Rage of Mages II: Necromancer", "name_original": "Rage of Mages II: Necromancer", "description": "Feel the wrath in the thrilling sequel, Rage of Mages II: Necromancer, a role-playing, real-time strategy game. Recruit stalwart allies to aid you against your enemies. Gather powerful weapons to show your might and wield awesome magic as you complete important quests and train your character to be the mightiest of all.\n<br/><br/>\nAcross a barren wasteland, a sleeping evil crawls from the depths of the earth. At first content to slowly build their strength within a small region, the Necromancers will soon reveal their awesome power as they move to subjugate the entire land for their evil purposes. Wielding dark magic, they have perfected the art of raising the dead and now command these terrible minions to obey their slightest whim. Amassing an army is a trivial task for those that can summon the black legions of departed souls. You must embark upon a journey to improve strength and skill, enlist powerful allies, and recover a lost talisman of ancient magic to survive the coming onslaught. Ultimately you must seek out the lair of the Necromancers and destroy them and their undead puppets before they can carry out their terrifying plans. Are you ready?43 non-linear, branching missions: Rage of Mages II: Necromancer personalizes the game playing experience by allowing players to experience greater variety on their quest. \nNew story set in an original realm: Players lead their party of adventurers through Arabian-style desert cities and arboreal Druid villages. Each location delivers new challenges and new foes. \nOver 400 weapons, items, spells, objects and buildings to help adventurers in their travels. \n80 unique foes to conquer, including hideous skeletons, zombies, Druids, shamans, and the lethal race of Necromancers. Each foe features deadly new combat abilities. \nNew ally system: Players can now crush the competition by allying with Orcs and Trolls, as well as with other people.\nIncreased replay value: Additional multiplayer arenas support up to 16 players.", "metacritic": null, "released": "1999-07-30", "tba": false, "updated": "2023-07-24T11:00:05", "background_image": "https://media.rawg.io/media/screenshots/b55/b5550b05f399920db7b52989b9a62b23.jpg", "website": "", "rating": 4.28, "rating_top": 5, "added_by_status": {"yet": 11, "owned": 75, "beaten": 28, "toplay": 11, "dropped": 8}, "playtime": 3, "achievements_count": 0, "ratings_count": 45, "suggestions_count": 479, "game_series_count": 0, "reviews_count": 46, "platforms": ["PC"], "developers": ["Nival Interactive"], "genres": ["RPG", "Strategy"], "publishers": ["Nival Interactive"], "esrb_rating": "Teen"}