{"id": 231075, "slug": "tower-defender-defense-game", "name": "Tower Defender - Defense game", "name_original": "Tower Defender - Defense game", "description": "Tower Defender – Defense Game is an action packed tower defence strategy game. Lead the warriors into battle against the undead, unleash mighty powers, perfect your DEFENSES and triumph over the evil forces. <br/><br/>Attack the enemy troops, cast mighty spells to destroy the kingdom of darkness. You can also build various towers in this TD game in order to aid your heroes in the battle against the undead.<br/><br/>Command royal battle lords in the revolt against dead enemies.<br/><br/>Tower Defender – Defense Game features:<br/><br/>• Many epic heroes with unique weapons.<br/>• Conquer powerful bosses.<br/>• Unleash mighty powers.<br/>• Variety of defense towers to aid in war.<br/>• Innovative combat in diverse fantasy world.<br/>• Play lots of addictive and exciting levels.<br/>• Craft tons of upgrades on your hero.<br/>• A mix of tower defence and action filled battle quest.<br/>• Stunning visuals.<br/>• Electrifying music and SFX.<br/>• Much more….<br/><br/>Story: The fate of humanity lies in the hand of your Defender Heroes, only they can destroy the resilient army of the undead monsters and they can’t do it without your leadership. <br/><br/>The Battle lords:<br/><br/>1. Baxter is speedy and agile Knight.<br/>2. Arteria the gladiator shoots arrows at enemies from a distance.<br/>3. Badrick the warrior is massive, really strong and rushes against hordes of enemies.<br/>4. Darren is a shooter; he uses fire balls to fight his way to glory.<br/>5. Farah freezes the devils with her magic wand. <br/>6. Scolar is a legend; medieval goblins and barbarians are no match for him.<br/>7. Pyro’s canon causes chaos in the arena.<br/><br/>Plan your strategy, strengthen your defenders and wipe out the enemy kingdom in this thrilling and fast-paced free TD game.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:38:06", "background_image": "https://media.rawg.io/media/screenshots/d00/d00cfb63bd20883bf96c650907346cfe.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 198, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["AppOn Innovate"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}