{"id": 231082, "slug": "bike-race-bike-blast-rush", "name": "Bike Race - Bike Blast Rush", "name_original": "Bike Race - Bike Blast Rush", "description": "Hop on your BMX and swipe, jump, duck, dodge and dash your way to victory! Non-stop HIGH OCTANE Bike RACING ACTION in the new AWESOME quality game from AceViral!<br/><br/>★ Colorful HD graphics!<br/>★ BLAST through the Subway!<br/>★ SURF through the streets!<br/>★ DODGE oncoming traffic!<br/>★ SWIPE through tunnels!<br/>★ JUMP over bridges and busses!<br/>★ GRIND crazy rails!<br/>★ SLIDE under obstacles!<br/>★ RIDE across the City and Park!<br/>★ TRICK off the MEGA RAMP for some sick air time!<br/>★ FLY through the skies on your very own Hang Glider!<br/>★ UPGRADE powerups to get impossible run scores!<br/>★ BOOST your score using a HELICOPTER and a ROCKET!<br/>★ RACE, compete, challenge and help your friends!<br/>★ ACHIEVEMENTS to unlock and show off your skills!<br/>★ WEEKLY LEADERBOARDS to compete with the world!<br/>★ Compete as one of the many characters to pick your #1 surfer! <br/><br/>Max and Amy need your help to rack up the most EXTREME score possible in the best new FREE endless running game! Set some intense HIGH SCORES and BEAT your buddies in the rush to the top!<br/><br/>Whether you are a boy or a girl, there are lots of FUNKY characters to meet and lots of SHINY cool bikes to earn! COLLECT coins, COMPLETE missions, SPEED through the ranks and more!<br/><br/>Updated with the coolest features and gameplay packed with content, you will love doing flips, tricks and stunts off ramps while testing your reactions speeding around town!<br/><br/>This is NOT your average running game! This is Faster, This is Smoother, This is for the best players, This is Bike Blast! <br/><br/>Download now and join your friends in the fun! Play NOW!<br/><br/>Like Us on Facebook: https://www.facebook.com/BikeBlast/<br/>Follow Us on Twitter: @Bike_Blast<br/><br/>Can't get enough of Bike Blast? Bugs causing problems? Then we want to hear from you! Click the feedback button in the options menu and drop the Bike Blast team a message!", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:38:05", "background_image": "https://media.rawg.io/media/screenshots/481/48165c88cde4609cea579d1aa8c39514.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 160, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Ace Viral"], "genres": ["Action"], "publishers": [], "esrb_rating": null}