{"id": 231034, "slug": "resort-tycoon-hotel-simulation-game", "name": "Resort Tycoon - Hotel Simulation Game", "name_original": "Resort Tycoon - Hotel Simulation Game", "description": "Resort tycoon is a beautiful resort simulation that tests your time and resource management skills. Upgrade your resort with all the latest amenities, open kitchens, serve varieties of drinks and much more because your customers deserve the best!<br/><br/>Kick start your hotel management career, keep the customers happy and earn money to buy resorts all over the city and create your own chain of dream hotels. But don’t forget to keep your business strategies updated by adjusting your own demand and the profits for the items you sell in your resort.<br/><br/>Carry enough burgers, sandwiches and much more delicious items to cater daily customer demands. Open swimming pool and dress up customers. Soothe impatient guests before they get angry. As resort’s popularity increases, you earn more money. Experience the situation and strategy of resort business.<br/><br/>Create a Resort tycoon story of yours who aspired and established a successful hotel business and eventually became the great Resort Tycoon.<br/><br/>Game available in: English, French, Spanish, Russian, and Thai.<br/><br/>Game Features:<br/><br/>•\tFREE TO PLAY, lifelong!<br/>•\tColorful and vivid graphics, also plenty of facilities and decoration items available!<br/>•\tSimple, intuitive and addictive game-play.<br/>•\tLet’s you build and maintain your dream family vacation hangout.<br/>•\tAllows you to play offline and serve your guests without wasting data.<br/>•\tOptimized for many devices including the latest mobile phones / tablets.<br/><br/>Players can pay real money for in-game currency and to enhance the game-play.<br/><br/>The quicker you serve food, happier the customers will be. Each customer will pay money for their stay, use the money to buy upgrades, decorations or to open new resorts in city and convert your resort to a super mall.<br/><br/>Expand your motel by buying more rooms for the guests to stay in and renovate it with several types of decorations such as paintings, fountains, etc.<br/><br/>Buy and upgrade diner stands to serve various items to the customers – ice creams, soft drinks, etc. in your own supermarket. <br/><br/>Game is packed with:<br/><br/>Real Simulation Experience<br/>•\tEnjoy every bit of managing your resort and watch it grow before your eyes. Your actions define how you'll be earning.<br/><br/>Stunning Visuals<br/>•\tLively characters and beautiful decors elevate the visual quality of the game and take it to another level.<br/>•\tDetailed interiors and objects are a visual treat.<br/><br/>Many Decors &amp; Upgrades<br/>•\tBeautify your resort and make it stand out.<br/>•\tUpgrade the resort and give your guests an experience that is a class apart<br/><br/>Helpful Boosters<br/>•\tSpeed up diner service and dash your way out to tips!<br/>•\tSpace crunch in your cart? Keep that extra can of soda or a sandwich ready!<br/><br/>Anything Else? Well...<br/>•\tEstablish your very own chain of resorts; over 5 unique resorts to expand your resort tycoon chain to.<br/>•\tVIP Guests – You have to pay special attention to them in your restaurant. They are pretty generous!<br/>•\tSoothing music ensuring a pleasant stay at the resort<br/><br/>Download now, for free!<br/><br/><br/>---------------------------------------------<br/><br/>IMPORTANT CONSUMER INFORMATION:<br/><br/>The game respects your privacy, does not store any personal information and does not allow you share this information. <br/><br/>We do require a few additional Permissions to function:<br/><br/>1) READ_EXTERNAL_STORAGE &amp; WRITE_EXTERNAL_STORAGE<br/>These permissions are needed to read/write data of downloaded content for new resorts.<br/><br/>2) ACCESS_COARSE_LOCATION<br/>These permissions are needed to show suitable ad content for targeted user for better ad experience<br/><br/>3) ACCESS_WIFI_STATE &amp; ACCESS_NETWORK_STATE<br/>This permission is required to check internet connectivity to download new content of new resorts.<br/><br/>Resort Tycoon is FREE to download and FREE to play. However, you can purchase in-app items with real money. Game may contain third-party advertisements that may redirect you to a third-party site.<br/><br/>---------------------------------------------", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-24T20:53:39", "background_image": "https://media.rawg.io/media/screenshots/643/643b4713f195c49c3bfab623ec733415.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 178, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["AppOn Innovate"], "genres": ["Casual"], "publishers": [], "esrb_rating": "Everyone"}