{"id": 2310, "slug": "mighty-no-9", "name": "Mighty No. 9", "name_original": "Mighty No. 9", "description": "<p>Mighty No. 9 is a sci-fi game that strongly resembles the classic Mega Man series.</p>\n<h3>Plot</h3>\n<p>The main protagonist is Beck, a battle android from the Mighty Numbers series (his number is 9). A virus attack led to a machine uprising, and Mighty No. 9 is among the few robots that were not infected. His creator, Dr. White, sends him to stop his rampaging kin and find out who is behind the attack. The Xel technology allows Beck to bring his fellow Numbers back to reason. He will also assimilate their data to send it back to the lab so that Dr. White could find the cure for the virus. Beck is occasionally assisted by Call, a female robot unaffected by the virus.</p>\n<h3>Gameplay</h3>\n<p>The player controls Beck in a 2D environment. Like in Mega Man, the protagonist jumps platforms and fires a gun. Beck can also use the special acceleration ability that allows him to leap long distances and through his enemies. By leaping through injured opponents, Beck can assimilate their Xel to receive a temporary power-up. The type of a power-up depends on the color of a Xel: red gives Beck more powerful attacks, green speeds him up, yellow improves his stamina, and blue heals him. Gathering Xel from Mighty Numbers, Beck receives new special abilities.</p>\n<h3>Multiplayer</h3>\n<p>The game includes a cooperative multiplayer for two, in which the second player controls Call. Her gameplay is very different and is largely defensive as she uses deflector shields to protect herself and Beck.</p>", "metacritic": 52, "released": "2016-06-21", "tba": false, "updated": "2023-11-21T01:16:04", "background_image": "https://media.rawg.io/media/games/fb0/fb05d26860505d5bc58619f9b8359c15.jpeg", "website": "http://www.mightyno9.com", "rating": 2.31, "rating_top": 3, "added_by_status": {"yet": 79, "owned": 1114, "beaten": 35, "toplay": 10, "dropped": 134, "playing": 2}, "playtime": 3, "achievements_count": 308, "ratings_count": 188, "suggestions_count": 447, "game_series_count": 0, "reviews_count": 192, "platforms": ["PS Vita", "PlayStation 4", "Wii U", "Linux", "macOS", "PC", "PlayStation 3", "Xbox 360", "Xbox One", "Nintendo 3DS"], "developers": ["8-4", "Abstraction Games", "Engine Software", "Inti Creates", "Comcept"], "genres": ["Action", "Adventure"], "publishers": ["Deep Silver"], "esrb_rating": "Everyone 10+"}