{"id": 231042, "slug": "cafe-tycoon-cooking-restaurant-simulation-game", "name": "Cafe Tycoon – Cooking & Restaurant Simulation game", "name_original": "Cafe Tycoon – Cooking & Restaurant Simulation game", "description": "Cafe tycoon is a beautiful cooking and restaurant simulation game that tests your time and resource management skills. Manage many chef’s, cook delicious meals, serve hot coffee and decorate your hotel. Write your own restaurant story in Cafe Tycoon today. <br/><br/>Keep customers happy and earn money to buy restaurants all over the world café and become world’s top Chef. Cafe Tycoon is fast-paced cooking and catering game. Use lots of exciting power-ups and booster and get carried away in a cooking fever!  <br/><br/>Cafe Tycoon is a fun cooking scramble game where you own your food court, decorate it beautifully, hire chef to cook food and serve customers as quick as possible to earn maximum profits. It’s by far the best Restaurant paradise cooking Simulation game ever! Travel the word and explore varieties of recipes. Play this kitchen game, cook and serve delicious food as a top chef and put your time-management skills to test!<br/><br/>It’ an addictive food serving game where you set off to open a classy cafeteria, manage kitchen stories and chefs and serve customers delicious food and drinks. <br/><br/>Serve coffee, cook bakery goods and immerse yourself in an addictive restaurant simulator that’s brimming with exciting tales and stories.<br/><br/>CAFE TYCOON FEATURES<br/><br/>❤ Build Your Restaurants!<br/>~ Restaurant management means you’re in charge! Create and maintain multiple cafe, restaurant or diner layouts to promote your business<br/><br/>❤ Cook delicious food!<br/>~ Hire best restaurant chefs and prepare delicious food that customers will love and share. Guests must love your food and service so as to improve cafeteria popularity. Make delicious tasty food Cake, deserts, cookie, coffee, burger &amp; other cuisine ranges from breakfast, lunch and dinner.<br/><br/>❤ Design Your Restaurant!<br/>~ Design your cafe, restaurant or diner by purchasing decorations to give your own personal touch<br/>~ Decorate your virtual restaurants with all kinds of in-game decorations<br/><br/>❤ Open Cafe worldwide<br/>~ What are you waiting for to invest your money and open another café world across the globe. New recipes and decorations simulation await for you in each country. <br/><br/>❤ Improve your appliances <br/>~ Acquire new machines for your cafeteria, upgrade them and give them maintenance. Ovens, blenders, coffee shops!<br/><br/>In your journey of becoming a Chef Tycoon mania, explore special dishes with skilled waiters or waitress having exceptional cooking skills, who handle world kitchen and restaurant appliances. Manage rush-hours by upgrading your cooking appliances, and decorate your restaurant to attract more customers! <br/><br/>Cook delicious meals and prepare fruity drinks! In all the restaurant you’ll find iconic but also special dishes from all over the world. Not to mention the special kitchenware that makes you the greatest waiter or waitress and chef in the cooking business mania. <br/><br/>This cooking game is a fast-paced game. Keep up with the rush hours, become better at time management. What makes this cooking game so fun is that there are endless amount of levels and the levels are loaded with enough orders to enjoy. <br/><br/>Become the superstar cook dash, you’ve always wanted to be! Start cooking, chef!<br/><br/>Realize your dream of becoming a Culinary Master! Play Chef tycoon: Cooking &amp; Restaurant Game today!<br/><br/>IMPORTANT CONSUMER INFORMATION:<br/><br/>Cafe Tycoon respects your privacy, does not store any personal information and does not allow you share this information.<br/><br/>We do require a few additional Permissions:<br/><br/>1) READ_EXTERNAL_STORAGE &amp; WRITE_EXTERNAL_STORAGE<br/>These permissions are needed to read/write data of downloaded content for new kitchen areas / competitors.<br/><br/>2) ACCESS_WIFI_STATE &amp; ACCESS_NETWORK_STATE<br/>This permission is required to check internet connectivity to download new game content for new cafe world locations / competitors<br/><br/>Cafe Tycoon is FREE to download and play. However, you can purchase in-app items with real money to enhance your gameplay. Game may contain third-party advertisements.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:38:10", "background_image": "https://media.rawg.io/media/screenshots/fc3/fc3cc6449a6ff3337a49e473c877989c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 172, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["AppOn Innovate"], "genres": ["Casual"], "publishers": [], "esrb_rating": null}