{"id": 231196, "slug": "solitaire-decked-out-ad-free-2", "name": "Solitaire: Decked Out Ad Free", "name_original": "Solitaire: Decked Out Ad Free", "description": "No Ads! <br/>The Classic Solitaire you know and love but WITHOUT Ads. <br/>Unlock themed decks and discover unique winning ceremonies! <br/><br/>Beat the game to earn coins and unlock decks and decorative items. <br/>DECK OUT your play experience with different themes and effects.<br/>Themes include penguins, flowers, hot dogs, UFOs, and more!<br/>Let’s get DECKED OUT!<br/><br/>Features: <br/>- unlimited FREE games without ads<br/>- Klondike style card game<br/>- Play anywhere! offline mode available<br/>- HOW TO PLAY instructions for beginners<br/>- standard 1-card or 3-card draw<br/>- 90+ challenging achievements<br/>- 90+ decorative items<br/>- pause the game at any time<br/>- game status saved automatically<br/>- both portrait and landscape mode supported<br/>- unlimited hints and undos<br/><br/>For Parents:<br/>Solitaire: Decked Out is free to download and play. But content can also be unlocked through in-app purchases. You can turn off the payment feature by disabling in-app purchases in your device’s settings.  <br/><br/>For the latest info and what we are up to:<br/>Like us on Facebook at https://www.facebook.com/SolitaireDeckedOut/<br/><br/>Terms of Service: <br/>http://solitaire-deckedout.com/terms-of-service<br/><br/>Privacy Policy:<br/>http://solitaire-deckedout.com/privacy-policy<br/><br/>Why We Are Ad-Free: We want Solitaire: Decked Out to be just like the classic Solitaire you already love, but without a single annoying ad to slow you down. Instead of forcing you to watch advertisements, we decided to create new things for you to enjoy and hopefully love enough to purchase. We added unique features and effects such as cool graphics, colorful backgrounds, and cute cards. We made a diverse assortment of decks and items for you to unlock and collect. Our belief is that if you appreciate all the care and details that went this classic game, you’ll support us and maybe even share your love for Solitaire: Decked Out with friends. Thank you so much!", "metacritic": null, "released": null, "tba": false, "updated": "2023-12-20T11:36:54", "background_image": "https://media.rawg.io/media/screenshots/794/794c72a4ae54c4bc545ff73156381f92.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 109, "game_series_count": 0, "reviews_count": 3, "platforms": ["Android"], "developers": ["Devsisters"], "genres": ["Card"], "publishers": [], "esrb_rating": "Everyone"}