{"id": 231223, "slug": "ball-hop-anniversary", "name": "Ball-Hop Anniversary", "name_original": "Ball-Hop Anniversary", "description": "Play the best skew ball style game on your Android with score boosting bonus targets!<br/><br/>Roll the ball, earn tickets and redeem nostalgic prizes. Customize your ball and tablet theme. Sign in to Google Play Services and compete in the global leaderboards for the top score.<br/><br/>AMAZING 3D GRAPHICS<br/>The best looking bowling alley roller game on mobile that looks and feels just like the real thing. 10/10 players prefer Ball-Hop over skee ball.<br/><br/>CUSTOMIZE YOUR GAME<br/>Tons of arcade bowling balls to redeem and several fun themes to earn and use.<br/><br/>OVER-ACHIEVE<br/>Earn achievements by redeeming sets of prizes with your tickets. Play against others for the top score on the world wide bowling leaderboards.<br/><br/>FEATURING<br/>Sim quality physics<br/>Vibrant 3D graphics and effects<br/>Bonus target multipliers to achieve super high scores<br/>Multiple balls, themes and prizes to unlock<br/>Play without internet or WiFi<br/>More fun than skee ball<br/><br/>*Install BALL-HOP ANNIVERSARY NOW!*<br/><br/>___<br/><br/>HOW TO PLAY<br/>• Swipe up on the screen to launch a ball<br/>• Aim for the Bonus Icons to enhance your game <br/><br/>ADVANCED<br/>• Swipe down to retrieve balls that don't launch<br/>• Tilt and Sensitivity settings are in the Pause menu<br/><br/>TIPS<br/>• Tilt and perform bank shots for extreme control<br/>• 3 Bonus Icons = On Fire!<br/>• 6 Bonus Icons = Burning Up!<br/><br/>SUPPORT<br/>• Please email us at the support address in Contact Information<br/>• If you don't receive a reply within 5 business days, check your Spam/Junk folders<br/>• We care about our customers and will do our best to help you out<br/><br/>___<br/><br/>BACKING UP DATA<br/>Your data is saved on the device and currently there isn't support to move save data between devices. If you uninstall the game without backing up, you will lose your data. You can use backup tools like Titanium Backup or any other backup program on Google Play. However, we do not encourage/support this and will not be able to provide support if anything goes wrong.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:37:42", "background_image": "https://media.rawg.io/media/screenshots/c53/c53c0eea09216a1a6e7da456e7f1841a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 94, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Renown Entertainment"], "genres": ["Sports"], "publishers": [], "esrb_rating": null}