{"id": 231305, "slug": "nes-hunter-pro", "name": "NES Hunter PRO", "name_original": "NES Hunter PRO", "description": "Retro video game collectors unite! NES Hunter PRO is a fully-featured game collection app that makes tracking your vintage Nintendo collections easy and fun! <br/><br/>The PRO version contains comprehensive game listings for all your favorite systems including: Nintendo NES, Super Nintendo, Nintendo 64, GameCube, Gameboy, Gameboy Color, Gameboy Advance, and Virtual Boy, and provides current Loose/CIB/NIB prices for each cart!<br/><br/>Hot new features in the PRO version include:<br/><br/>- Nintendo 64, GameCube, Gameboy, Gameboy Color, Gameboy Advance, and Virtual Boy listings in addition to NES and SNES<br/>- the ability to edit any price listed in the app as you see fit by simply tapping and holding on a game entry<br/>- options for sorting game listings by price/category<br/>- options to view the full game list, the top-50 rarest titles, variant list, or just your owned collection<br/>- support for tracking cartridges, instruction manuals, and boxes separately<br/>- support for tracking rare 3 and 5-screw NES cartridge variants<br/>- support for tracking N64 cart color variants<br/>- support for tracking Player's Choice variants<br/>- a bonus feature that picks a random game from the on-screen list for those of you who (like me) have a hard time deciding what game to play out of your ever-growing collection (just enter a ? in the search window)<br/><br/>Color-coding helps you identify at a glance which games are common/cheap (gray), which ones are worth a second look (green), and which ones are worth serious money (gold). The top 50-rarest carts are also marked with a star so you can't miss 'em.<br/><br/>Price lists are stored offline so you never have to worry about network coverage or roaming fees when rummaging through flea markets and second hand stores in the middle of nowhere! <br/><br/>Happy collecting! :)<br/><br/><br/>Additional Notes: <br/><br/>The PRO version will import game collection data from NES Hunter, however you must update the Free version to 1.1 first.<br/><br/>An in-app instruction manual is available and can be accessed by pressing the MENU button while viewing the app's main screen.", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-31T06:01:02", "background_image": "https://media.rawg.io/media/screenshots/4d8/4d84a55495fb6df39c4287692fd5d2d0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 99, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Game Misconduct Studios"], "genres": ["Casual"], "publishers": [], "esrb_rating": "Everyone"}