{"id": 231387, "slug": "wingsuit-simulator-3d-skydiving-game", "name": "Wingsuit Simulator 3D - Skydiving Game", "name_original": "Wingsuit Simulator 3D - Skydiving Game", "description": "In WINGSUIT SIMULATOR be a flying man with parachute bag ready to jump from airplane flight through the cockpit. Put on your wing-suit to fly and perform paragliding but don't collide with any other objects. Pull the parachute string to open bag in sky-high jumping. Look around the world by moving your phone to view in any direction. This driving game is best in the google cardboard to wind mania to manage airspeed when you jump from an airplane in the adrenaline rush.<br/><br/>Perform some adventure, fly's over the valleys, hills and feel the wind to have fun in the skyline with this games! Perform various stunts combined with the thrilling rush of flying games in the google cardboard. High air stunt VR paragliding skydive in airspeed with the diving sim. Be a paragliding who can be best for recreational activity in this skydive sim. The training course for parachute involves air jumps from high altitudes, maneuvering &amp; controlling body movements during the aerial flight &amp; avoiding collisions. <br/><br/>Successful extreme sports in this skyline flight in this fight simulation fun. Ever dream of flying down the highest mountains? Then join the \"Wingsuit Simulator\" adventure from the google cardboard and feel the speed of free fall. <br/><br/>Game Features:<br/><br/>1. Customize cool characters and amazing suits as you wish.<br/>2. Fly around 3 different themes likes desert theme, snow theme, and forest theme.<br/>3. 15 extraordinary levels to explore the sky.<br/>4. Best simulation controls and addictive gameplay.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:37:20", "background_image": "https://media.rawg.io/media/screenshots/8bc/8bc31c61d3259bc54aa10a6c3f8be79f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 260, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Timuz Games"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}