{"id": 231339, "slug": "dash-quest-heroes", "name": "Dash Quest Heroes", "name_original": "Dash Quest Heroes", "description": "Become a Legendary Hero and explore a vast world of fantasy adventure in Dash Quest Heroes! The Kingdom of Solas has fallen prey to the fiendish Zaru and it's up to the Heroes of the world to defeat him. Collect incredible gear and forge new items as you set out on a journey through rolling hills, cryptic caves, shrouded forests and more! Only the mightiest of Heroes will become legend.<br/><br/>Features:<br/>• Create and customize your Hero!<br/>• Unlock and Dash as an Adventurer, Warrior, Mage or Rogue!<br/>• Compete with friends via Online Leaderboards!<br/>• Power up your Hero with over 200 skills across 50 levels<br/>• More than 40 unique magical abilities with unique animations!<br/>• Fight epic boss battles!<br/>• Complete Quests for unique rewards!<br/>• Craft, acquire and enhance loot with forging, legendary drops and gear perks! <br/>• Challenging Minigames like Mine Cart Madness, Archery and Fishing!<br/>• Retro inspired levels, music and sound effects!<br/><br/>Capturing the spirit of RPG adventure classics from the 16-bit era, Dash Quest Heroes is the much-awaited follow up to the award-winning game, Dash Quest.<br/><br/>The fate of the world rests in your hands - if you dare to Dash!<br/><br/>Notes:<br/>Dash Quest Heroes requires an active internet connection to play.", "metacritic": null, "released": "2017-12-14", "tba": false, "updated": "2019-10-22T14:12:43", "background_image": "https://media.rawg.io/media/screenshots/f7e/f7ef72c3e170076a7300956ce2ac224a.jpg", "website": "http://www.tinytitanstudios.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 328, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Tiny Titan Studios"], "genres": ["Adventure", "RPG"], "publishers": ["Tiny Titan Studios"], "esrb_rating": null}