{"id": 231417, "slug": "preschool-adventures-2", "name": "Preschool Adventures-2", "name_original": "Preschool Adventures-2", "description": "Let's teach your preschooler kid numbers, counting, letters, colors, shapes, animals, logic and more.<br/><br/>\" Preschool Adventures-2 \" contains 36 puzzles in 4 fun, colorful, and educational sections, specifically designed to contribute to your child's cognitive skills, exercise abstract thinking abilities, and develop general knowledge. Developing these abilities and skills can help prepare your children for school and give them extra advantage in life.<br/><br/>Preschool Adventures-2 is a wonderful game with educational puzzles for 4-5-year old kids.<br/>The game is available in 12 languages: English, Germany, Spanish, Russian, French, Italy ,Portuguese and more..<br/><br/>This is the best game for your preschool children to learn with a lot of fun .The game is suitable for little girls and little boys alike.<br/><br/>While playing the game your child will learn:<br/>✔ Counting from 1 to 10<br/>✔ Completing a missing part of an image<br/>✔ Matching objects according to \"depends on\", \"is opposite to\", and \"is a kind of\" <br/>    logical relations<br/>✔ Bilateral and spatial awareness (above, below, left-to, right-to, behind, in front of)<br/>✔ Recognizing an object by its silhouette (shadow)<br/>✔ Letters and their pronunciations<br/>✔ Animal foods and habitats names<br/><br/>The game includes the appropriate sounds of animals, birds, instruments, etc. These (and other) sound effects are played on each correct answer.<br/><br/>♥ All the puzzles were prepared by a specialist in the field of child mental <br/>   development.<br/>♥ The game was tested on dozens of children in the appropriate age range prior to its <br/>    release.<br/><br/>Install \"Preschool Adventures-2\" today and let your kid have fun and free learning !", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:37:15", "background_image": "https://media.rawg.io/media/screenshots/c5f/c5f38554bdbdf142d4750d5d70541066.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 104, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["forqan smart tech"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}