{"id": 231459, "slug": "counter-terrorism-shoot", "name": "Counter Terrorism Shoot", "name_original": "Counter Terrorism Shoot", "description": "Are you keen on shooting? Join the game now! This game is our long-awaited FPS action game. With the game screen for a fierce shootout, feel different shooting experience. The game will give you a moment of relaxation, eliminating the stress of working and learning the day.<br/>Terrorists are threatening world peace. Hurry up to join the fight, destroy all the terrorists, bring peace to the world.<br/><br/>Counter Terrorism Shoot is the best shooting game. With a clear 3D graphics, allowing players to better experience the fun of shooting games.  letting our brave fighters fight against dangerous terrorists.<br/><br/>In the game, you are a professional gunman, you get the news of intelligence officers, find the location of the terrorist base, you need to close this dangerous area to carry out the task. It will be a very difficult task because the distance between you and the terrorists is very close and your danger is huge. But it will also make you more excited, because you can show in the task of a strong fighting skills. which will allow you to complete the task more perfect.<br/><br/>Face many challenges but it is very attractive time. This game will give you more fun and excitement. Make the greatest effort to kill the terrorists and finish the task. Enjoy the fun of this game.<br/><br/>Counter Terrorism Shoot Features:<br/>- Smart AI, to bring you a variety of challenges<br/>- Complex situation, terrain<br/>- Exciting map and realistic environment<br/>- Kill all the terrorists going into the next stage<br/>- Real combat effect<br/>- Best shooting game<br/>- stunning 3D graphics<br/>- shocking music and sound effects", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:37:07", "background_image": "https://media.rawg.io/media/screenshots/392/392ce19d61bba5b99e770130077584be.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 73, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Doing Studio"], "genres": ["Action"], "publishers": [], "esrb_rating": null}