{"id": 231415, "slug": "kids-brain-trainer-preschool", "name": "Kids Brain Trainer (Preschool)", "name_original": "Kids Brain Trainer (Preschool)", "description": "This game has is fun for adults as well as kids. It introduces a set of brain exercises for adults as well as kids! <br/>Let your child's brilliance soar through \"Kids Brain Trainer\".<br/><br/>With \"Kids Brain Trainer\" your kid will be able to: <br/>✔ Match an image to its shadow. <br/>✔ Find the odd image in a collection of images. <br/>✔ Match images to its families. <br/>✔ Memory game; match cards. <br/><br/>Completely safe and designed for kids, this game proves to be the best kids game to help your child grow, learn, have fun, and even give parents some time off. With four fun, colorful and educational sections, \"Kids Brain Trainer (Preschool)\" has 144 games specifically designed to contribute to, exercise and develop your child's motor and cognitive skills (such as visual attention, visual-spatial relations, short term memory, visual-motor coordination, bi-lateral coordination, tactile skills and much more).<br/><br/>Developed by a preschoolers father and a  child's mental development specialist, \"Kids Brain Trainer (Preschool)\" aims to be as educational and beneficial as possible; and being fathers themselves, these developers know how important -and tricky- it can be to keep children interested while learning. \"Kids Brain Trainer (Preschool)\" is updated at least twice a month with fun, new, graphics, puzzles and more to keep your little ones having fun!<br/>This highly educational app is not only designed for children 3+ (including special needs children), but also for any parents, teachers, or other professionals working in the field of child development.<br/><br/>\"Kids Brain Trainer (Preschool)\" includes four fun-packed parts with a number of colorfully themed and leveled games:<br/>1. Shadow: 48 mind-exercising levels of matching a figure to its shadow<br/>2. Differences: 48 fun levels of identifying the image that does not belong<br/>3. Match It!: 24 exciting games of matching a picture to the figure provided.<br/>4. Memory: 24 colorful games of matching memory cards; each game of three difficulty levels: Easy, Medium and Hard. <br/><br/>This educational game is truly developed with every child's best interest at heart and serves as an accurate way to access you child’s basic skills, as well as develop them. Forqan Smart Technology believes that by doing, playing and exploring, children learn best. Have your child develop essential motor and cognitive skills doing just that- doing, playing, exploring, and having endless fun with a safe game.<br/><br/>Reveal your child's brilliance and help their brain grow- download \"Kids Brain Trainer (Preschool)\" today.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:37:17", "background_image": "https://media.rawg.io/media/screenshots/a1c/a1c5793d5e32ae03ef0ffefa1ec0aa67.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 94, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["forqan smart tech"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}