{"id": 23154, "slug": "hidden-dangerous-2-courage-under-fire", "name": "Hidden & Dangerous 2: Courage Under Fire", "name_original": "Hidden & Dangerous 2: Courage Under Fire", "description": "<p>Hidden &amp; Dangerous 2Hidden &amp; Dangerous 2 is a first and third person tactical shooter that builds upon the tremendous success of Hidden &amp; Dangerous. You lead a small squad of Allied soldiers deep behind enemy lines, to carry out secret missions during World War II. The gripping story line takes you to Europe, Africa, Burma, and other locations scattered across the globe. Each critical decision impacts you, your men, and your country. This unique blend of action, strategy, and tactics forces you to use your brain just as much as your trigger finger.Hidden &amp; Dangerous 2: Sabre SquadronReprise your role as commander of the elite Special Air Services (SAS) in World War II as you take on the Axis Powers in nine new missions set in France, Africa and Sicily. Fight through these campaigns alone or play co-operatively with friends. Sneak past enemy lines, infiltrate heavily guarded bases and outposts, and utilize superior tactics to eliminate the opposition.<br />\nSupply your squad with a number of weapons including pistols, sniper rifles, grenades, and bazookas!<br />\nA Fully Interactive Environment depicts the ineptness of drowsy guards, the shocking quickness of an elite German battalion spotting your movements, and the terrified look of the enemy as you shove the barrel of your rifle under his nose!<br />\nComplete over 20 missions in 9 campaigns from the lush jungles of Southeast Asia to the harsh deserts in Africa. Commandeer a variety of vehicles including trucks, tanks, motorcycles, and planes.</p>", "metacritic": 75, "released": "2003-10-21", "tba": false, "updated": "2023-10-12T14:46:08", "background_image": "https://media.rawg.io/media/screenshots/b18/b1807f1c2a081824b0df64001bbe7ccc.jpg", "website": "http://www.2k.com", "rating": 4.06, "rating_top": 4, "added_by_status": {"yet": 10, "owned": 225, "beaten": 12, "toplay": 5, "dropped": 4, "playing": 1}, "playtime": 2, "achievements_count": 0, "ratings_count": 15, "suggestions_count": 396, "game_series_count": 1, "reviews_count": 16, "platforms": ["PC"], "developers": ["Illusion Softworks"], "genres": ["Action", "Shooter"], "publishers": ["2K Games"], "esrb_rating": "Mature"}