{"id": 231724, "slug": "prison-escape-jail", "name": "Prison Escape: Jail", "name_original": "Prison Escape: Jail", "description": "It's time to break out of this prison!<br/><br/>For two years you sit for a crime he did not commit, your family and friends have turned away from you, considering that you attacked her and robbed her. Your attempts to explain that you were framed in vain, a judge passed a sentence of 6 years in a strict regime prison. And then one day, you get an anonymous letter which says that there is evidence of your innocence and who framed you. The only option for you is to escape from the prison and find that person to prove his innocence.<br/> In order to escape from prison you will need to go through several well-protected rooms. On your way to meet a variety of traps, as well as surveillance cameras, machine-gun installation, motion sensors and cruel guards. You need to become invisible, to look for different ways around the traps, calculate the speed and the rotation of the camera, and much more!<br/> Help to escape from prison an innocent man in the latest game from our developers! Addictive gameplay, challenging levels and ingenious traps! The game has never been so fun and exciting as it is now, having passed one level you want to go next and so on until the very end. A great option for mobile lovers of puzzles here will have to think quickly and make spontaneous decisions. The game depends on your ability to think logically. If you ever wanted to try to escape from prison, but you are a law-abiding citizen, then this game is for you, a great simulator prison escape by the host phone, do not miss your chance!<br/><br/>Features:<br/>✯ addictive gameplay;<br/>✯ challenging levels;<br/>✯ ingenious traps;<br/>✯ mobile puzzle;<br/>✯ simulator prison escape;<br/>✯ absolutely new game is unique;<br/>✯ over 30 levels;<br/>✯ excellent graphics, in 2D style<br/><br/>How to play:<br/>Manage concluded, lead him to the door or hatch, beware of traps and guards.<br/><br/>We are glad to see you in our groups, engage, communicate and ask questions. Also, you can submit a question directly in the comments, we will reply to you !;)", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:36:46", "background_image": "https://media.rawg.io/media/screenshots/d70/d70f5573ad2a334f0fa1bed0d3118026.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 185, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Asteroid Games 3D"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}