{"id": 231752, "slug": "wild-fishing", "name": "Wild Fishing", "name_original": "Wild Fishing", "description": "🐟 🐟 A variety of vivid fish, amazing realistic 3D effect!<br/><br/>If you are a big fan of wild fishing, what are you waiting for? Let's set sail now!<br/><br/>Know nothing about fishing? Don’t worry, wild fishing is simple to operate, and you can enjoy the pleasure of fishing by gently sliding your fingers!<br/><br/>Game Features:<br/>◆ More deep-sea fish waiting for you to collect:<br/>  A total of 121 species of deep-sea fishes are distributed in the 11 most famous fishing grounds in the world. The fish in each fishing ground is divided into several levels. If the star of fish is higher, it would be more difficult to catch fish. It seems that these fishes are jumping around in front of you. They will splash water side to side when you click them with your fingers.<br/>◆ Professional fishing tools:<br/>  As a professional fishing expert, of course a professional fishing tool is essential: hooks, fishing rods, reels, baits, fishing lines, feeds, etc. all of them are essential; if you want to catch the biggest fish in this fishery, you need better tools, as many as 92 fishing tools are available for you to choose from. Of course, the best tools are all behind. If you want to get it, you can quickly fish and earn coins. Every tool can be made stronger and get more attributes through smelting .<br/>◆ Powerful fishing props:<br/>  In addition to some necessary tools, we have added a number of powerful items that will make it easier for you to catch big fish, such as time capsules, experience capsules, gold coin capsules, strength increasing, reel speed increasing, and more.<br/>How to deal with catching fish:<br/>  There are 3 ways to deal with the catching fish: Sell, sell the fish directly to get the gold coins and experience value immediately; release, if you do not want this fish, you can release it immediately, won't get the gold coin but can get more Experience value; into the fish tank, if the size of these fish does not sell well, you can temporarily put the fish in your fish tank, use the feed to help the fish grow, and sell it when it is big enough. You can get a huge amount of gold coins and experience values;<br/>Enjoy fishing in the wild and see the real perfect fishing, give you the same fishing experience in reality!<br/><br/>Play the ultimate 3D fishing game for FREE! Download Wild Fishing and show your fishing mania skills in this fishing adventure game. Come and experience it now!", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:36:39", "background_image": "https://media.rawg.io/media/screenshots/f56/f56301aee8d2193e382e106ca2538f57.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 189, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Creation Game Studio"], "genres": ["Casual"], "publishers": [], "esrb_rating": null}