{"id": 23188, "slug": "learn-to-fly-3", "name": "Learn to Fly 3", "name_original": "Learn to Fly 3", "description": "In Learn to Fly 3, you have to build, customize and upgrade a spaceship to reach space in an arcadey environment. Each playthrough earns you new parts to mess around with and assemble new exciting contraptions.<br/><br/>The game offers 4 different modes:<br/><br/><strong>Story Mode</strong>, where you have to earn money, upgrade your ship and make it to space. Try to beat the time challenges or just take it at your own pace.<br/><br/><strong>Payload Mode</strong>, where you have to build a much stronger ship that is able to pull heavy payloads along with it and carry them all the way into space. Light ships may be able to get to space in story mode, but it's going to take a lot more power to get those payloads off the ground!<br/><br/><strong>Classic Mode</strong>, reminiscent of the previous Learn to Fly games, where the goal is to fly as far as possible horizontally. It forces you to use parts differently and think of new strategies to favour distance over altitude.<br/><br/>Finally, <strong>Sandbox Mode </strong>allows you to mess around with many game and physics constants. Infinite fuel, 100x gravity, over-powered thrusters, a gazillion obstacles in the air... you're free to do whatever you want!Key features<ul><li>Build crazy spaceships from a combination of over 100 unique parts, each with their own distinct flavor and mechanics<br/></li><li>Halfway between realistic physics and a simpler arcade feel for an easy to learn yet deep experience<br/></li><li>Pick from 24 stages, 18 launchers, 24 boosts and 23 bodies, and each can be upgraded multiple times<br/></li><li>Research upgrades that affect all sorts of different aspects of the game and carry through play sessions<br/></li><li>Over 80 in-game achievements, each with their unique rewards<br/></li><li>Customizable HUD with all sorts of relevant information<br/></li><li>Customizable character and ship color<br/></li><li>Customizable music<br/></li><li>Every playthrough unlocks new items and bonuses for you to work with<br/></li><li><strong>Penguins</strong></li></ul>", "metacritic": null, "released": "2017-05-12", "tba": false, "updated": "2023-06-03T20:18:09", "background_image": "https://media.rawg.io/media/screenshots/893/893baec333e28956a8a6850c4fc313f8.jpg", "website": "http://lightbringergames.com/", "rating": 3.02, "rating_top": 4, "added_by_status": {"yet": 3, "owned": 411, "beaten": 29, "toplay": 1, "dropped": 10, "playing": 1}, "playtime": 2, "achievements_count": 40, "ratings_count": 50, "suggestions_count": 151, "game_series_count": 2, "reviews_count": 50, "platforms": ["PC"], "developers": ["Light Bringer Games"], "genres": ["Action", "Strategy", "Simulation", "Casual", "Indie"], "publishers": ["Light Bringer Games"], "esrb_rating": "Everyone"}