{"id": 231843, "slug": "car-soccer-2018", "name": "Car Soccer 2018", "name_original": "Car Soccer 2018", "description": "What would happen if you combined soccer ⚽ and fast, awesome cars 🚗? 🤔 Car Soccer 2018 would happen! A new, exciting type of game for new, exciting time! Discover it for yourself!<br/>\u2028FEATURES:<br/>\u2028▶ UNIQUE GAMEPLAY - Combining car driving and soccer - drive a car, score a goal ⚽!<br/>▶ AMAZING SOCCER ENVIRONMENTS - Drive around a realistic pitch and more 🚗!\u2028<br/>▶ 50 LEVELS OF FUN - Soccer and driving challenges for you to pass 😀!<br/>▶ 10 AWESOME CARS - Fast, aggressive, with great performance to boot! 🏁<br/>Combining soccer ⚽ and driving, Car Soccer 2018 will let you rediscover the joy of playing! Become the master 🥇 of a new type of game, driving fast and scoring big ⚽⚽⚽! Master the art of driving 🚗 and controlling the ball at the same time! 🌠<br/>\u2028\u2028Across 50 levels of increasing difficulty you will be met with fun and complex soccer challenges. Drive as fast as you can 🚘, score the required number of goals, defend your goal against the opposition!<br/>Be the first one 👑 on the finish line after you pull off amazing driving feats and score a goal! Show your driving skills 🏎️ and fulfill your dream of becoming the greatest driver and soccer player ⚽ at the same time 😍!<br/>Discover this unique and exciting new type of sports, inviting you to partake in a worldwide event of the greatest caliber 🚘! Become one of the champions 🥇 on the pitch as you pass every task and every challenge with speed and efficiency.<br/>Strike the ball, score a goal ⚽! It may sound easy but it will take patience and practice 💪. With time and persistence though you will be able to become the top driver 🚗 and player on the pitch ✌️! Make your racing and soccer dreams come true! 🥅<br/>You will get to choose from a wide variety of exciting cars 🚗. All of them are well suited for this new, exciting type of game! With great speed, manoeuvrability and performance on the pitch you will be able to pull off the most amazing soccer tricks ⚽!\u2028<br/>Download Car Soccer 2018 now and see the sport 🏆 in a completely new light! \u2028🌠", "metacritic": null, "released": "2018-07-24", "tba": false, "updated": "2021-06-14T03:52:47", "background_image": "https://media.rawg.io/media/screenshots/cea/ceac6bbff057fc91a21cc378fb979b72.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 223, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Play With Games"], "genres": ["Sports", "Racing"], "publishers": ["Play With Games"], "esrb_rating": "Everyone 10+"}