{"id": 231828, "slug": "football-coloring-book-game", "name": "Football coloring book game", "name_original": "Football coloring book game", "description": "Free football coloring book. Lots of free soccer coloring pages for painting and drawing and stimulating  creativity. A game for dreaming away being your favourite soccer player.<br/><br/>90 football coloring pages in different categories: actions, goals, champions, players, famous teams, different types of football and referees. Whether you are a keeper, a player or a supporter there is always something for you in this free game. <br/><br/>Football types:<br/>There are different types of football, as association football, indoor, beach, paralympic, keepie uppie and footbag. As you can see, the variety is much larger than “normal” and street football.  All of the types have their own rules. Football and soccer refer to the same game. See if you can recognize the different types. Choose your favorite type and color in the coloring page.<br/><br/>Goals:<br/>Goals is what is all about in football. We have some of the best goals for you!  Choose your favorite and create the best coloring page you've ever colored.<br/><br/>Champions:<br/>Every kid loves to be a champion. There are a lot of international football championships, like the Champion League, Europa League, World Cup but also the Youth League. Think of yourself being a world champion! Go for it and color one of the champion coloring pages.<br/><br/>Teams:<br/>Everyone has his own favorite team. We offer coloring pages of some of the favourite players of Barcelona, Manchester United, Real Madrid, AC Milan, Porto, Borussia Dortmund, Inter Milan, Chelsea and Ajax. See which of those teams is most favorable for you and finish the coloring page with the real colors. <br/><br/>Players:<br/>Everyone has one or more favorite players. Choose one of the coloring pages and make it look like your favorite player.<br/><br/>Football coloring pages  is an educational game for painting and drawing and stimulating creativity. If you or your kid loves to color, paint or draw and loves for example his favorite team, try it! It's funny and creative.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:36:31", "background_image": "https://media.rawg.io/media/screenshots/40b/40b4b5acb37fc05aa4d0869728e49f5b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 70, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Coloring Games"], "genres": ["Casual"], "publishers": [], "esrb_rating": null}