{"id": 231846, "slug": "soccer-caps-2018-table-futbol-game", "name": "Soccer Caps 2018 ⚽️ Table Futbol Game", "name_original": "Soccer Caps 2018 ⚽️ Table Futbol Game", "description": "Have you ever played with buttons? Are you ready for this soccer championship? Play Online in the champions soccer league! Win the online international table football tournament and become a legend in this free soccer game! Know the traditional game Penny Football?. Surely you played with friends at school classic game sheets, drawing a football field and using the classic soft drinks and plates with your favorite football traditional buttons game players. In this game everything is done, play on your phone or tablet comfortably with your football legends. Win the Soccer Competition.<br/><br/>Win every match of our Online Cup Soccer League: Show your opponents who is the best table soccer player! <br/><br/>Penny football, also called, coin football, soccer caps, button football, sporting coin, spoin, table football, tabletop football, or shove ha'penny football, is a coin game played upon a table top. The aim of the game is for a player to score more goals with the pennies (\"Spucks\") than their opponent. This is an electronic version of the game. The game has been in existence since at least 1959.<br/><br/>He reaches the top of the league with your star team and play soccer like never before buttons fun game where you have to try to score the best goals of the season using your best football players.<br/><br/>Play soccer cup with the best teams in the world, this amazing game sheet that will make you feel the best coach in the world, try to win every game they have this season.<br/><br/>Remember how we play Button Football?, plates on the floor or on the table, with chalked circuit to play a race or a football match. Using plates, marbles, concave discs, buttons, bottle caps, coins or any other round object that hit a ball, to score a goal. Similar to table football or mini soccer but played with sheets, chips or coins.<br/><br/>Want to be the best player in the world sheets? Download now Soccer Caps Game , and enjoy leading your team to glory, you'd never felt so close to the golf. Soccer game Button Football or Soccer Caps, allows you to be the champion of world soccer. Your stars have to play a good game and show that they can play in the team, pass, dribble, sprint, shooting and goal, this is the way to be the king of the sheets!<br/><br/>Enjoy playing with buttons as ever in this addictive soccer game where you have to win games of the World Cup.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:36:28", "background_image": "https://media.rawg.io/media/screenshots/929/9296713f3468d2a8568e4f1555622070.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 89, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Bambo Sports"], "genres": ["Sports"], "publishers": [], "esrb_rating": null}