{"id": 231818, "slug": "princess-coloring-game", "name": "Princess Coloring Game", "name_original": "Princess Coloring Game", "description": "Free princess coloring book game. If you love beautiful princesses or queens and like to draw or paint this free game is for you. <br/><br/>Free coloring book for all fans of princesses with  80+ coloring pages. Lots of designs with lovely princesses and princes, castles, beautiful dresses and hairstyles, horses, garden and many more.<br/><br/>This app is designed to be fun and easy to use for a mixed audience of all ages, from young to old. Easy navigation make it not only usable for adult women, but also easy to use for girls. We get lots of positive feedback from women of all ages, kids, teenagers and adult women. Even grandmothers find it fun to paint and color in this app.<br/><br/>You can paint all designs with different colors and you can paint their hair, clothes, makeup and crown or tiara. But you also have the option to draw your own drawing or work with stickers. <br/><br/>- Fun to play<br/>-Save and load your coloring pages<br/>-Many, many different colors<br/><br/>This game is fun for the entire family.  Both girls of all ages and adult women love to paint the princesses. <br/><br/>When you're done and have made a nice picture you can easily store your design to use as wallpaper or share it with friends or family. <br/><br/>We have a coloring book full of free pages of princesses in many different themes which you can paint and draw:<br/><br/>- Princesses in beautiful dresses with long hair.<br/>- Pricesses in love with their prince<br/>- With horses or other animals<br/>- In front of their castle<br/><br/>If you or your daughter likes princesses you will also enjoy coloring and painting the models in this app.  And with all the colors you can chose from you can also makeover and color the makeup and hair of these beautiful girls. Can you make them look like a real princess?", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:36:34", "background_image": "https://media.rawg.io/media/screenshots/a85/a855774ce56d3bc418c54b9fcdd73401.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 131, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Coloring Games"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}