{"id": 231859, "slug": "emergency-driver-sim-city-hero", "name": "Emergency Driver Sim: City Hero", "name_original": "Emergency Driver Sim: City Hero", "description": "Join the elite force tasked with keeping the city safe, clean and comfortable, and its citizens happy! Swipe the streets, put down fires, engage in high-octane chases, races and crashes! Complete each of the tasks as dilligently as you can, showing your skills and earning stars for your progress. Show everyone you're the top driver, able to complete each job without fault, quickly climb the ranks and become the City Hero you were always meant to be!<br/><br/>Emergency Driver Sim is a unique driving simulator that allows you to take up multiple careers and show your skills in every one of them. Your work will be done in the early morning hours, when most of the people people are sound asleep. Their safety though will be in your hands! Enter the road and engage in a variety of jobs and trials. From simple, everyday tasks to real emergencies, it will be up to you to keep the city functioning!<br/><br/>To stay ahead of the game you will have to be quick and thorough. Handle your car with precision and care but don't forget about the ticking clock. Drive fast but be careful not to crash!<br/><br/>10 VARIED VEHICLES<br/>Select from a variety of vehicles to complete your tasks in. Fast police cars, 4x4s, a garbage truck, a delivery van. With this huge and diverse collection you will not get bored quickly! Pick one, put your wheels on the road and start working for the best score!<br/><br/>EXCITING BIG CITY LOCALE<br/>Drive around the streets of a huge metropolis during early morning hours. Realistic lightning effects combined with imaginative architecture will transport you and immerse you into the game! With roads drenched in orange sunlight, your trials and tribulations will be a little easier to bear.<br/><br/>MULTIPLE JOBS TO TAKE UP<br/>Become a policeman, engaging in adrenaline-pumping chases with criminals, a firefighter putting down fires, but also a garbage truck driver or a street cleaner. Every job you can take up in this simulator is essential to efficient functioning of the city in its own way. Master all of them!<br/><br/>50 VARIED MISSIONS<br/>Each of the cars is tied to its own unique 5 missions. Complete them perfectly to earn in-game money for additional vehicles and unlock access to further tasks!<br/><br/>FREE TO PLAY<br/>The Main Game Mode is 100% FREE to play, all the way through, no strings attached! Extra Game Modes which alter the rules slightly to make the game easier are available through optional In-App Purchases. Each mode has separate leaderboards to make for totally fair competition!<br/><br/>GAME FEATURES<br/>- IMPRESSIVE CAR COLLECTION : Drive 10 Awesome Cars<br/>- MULTIPLE JOBS TO TAKE UP: Huge campaign to beat, earn in-game money for your progress<br/>- 100% Free to Play Missions<br/>- CONTROLS: Buttons, Wheel, Tilt<br/>- CAMERAS: Multiple cameras including First Person view for full immersion", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-31T05:01:26", "background_image": "https://media.rawg.io/media/screenshots/8e1/8e180ce46cb12ff1b14e527224233200.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 129, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Play With Games"], "genres": ["Racing"], "publishers": [], "esrb_rating": "Everyone"}