{"id": 231847, "slug": "3d-boat-parking-simulator-game", "name": "3D Boat Parking Simulator Game", "name_original": "3D Boat Parking Simulator Game", "description": "All hands on deck! In this popular and super addictive 3D parking simulator, you’ll have a chance to test your skills in sailing a realistic boat. If you love racing and parking boats, then you’re in for a real treat! This free game’s been designed for boys, girls and families alike. <br/><br/>***The Crème de la Crème of Boat Parking Sim Games*** <br/><br/>Doesn’t matter whether you’re from a city or a farm - If you’re tired of driving a regular car, bike, bus or monster truck and looking for some real fun you’ll definitely enjoy sailing from city to city. Your goal will be to set your target, escape the deadly waters and pilot your boat to the nearest port. But nothing comes easy - training and a lot of parking practice will be required in order to win and to not draw attention of the coast guard police and to park your turbo charged vessel in the right spot. As one of the best, free, and professionally designed 3D games of it's kind, it is full of addictive turbo charged watercrafts that you will be racing to realistic and popular ports.<br/><br/>***One of those games that you need to play before you test anything else***<br/><br/>Speed is something you’ll need, along with an eagle eye and super parking skills to have the slightest chance in mastering this free 3D simulator. It might seem easy to park a yacht at first but once you push the lever of your nitro powered engines to full ahead - taming a monster truck will look like a walk in the park. This free 3D sim will provide you with plenty of challenge and even more fun. Your kids and your whole family will love it! But remember - none of these boats is a toy to park. When you drive a car or a bike simulator you can always stop to take a breath. Spotting that parking place and adjusting your speed is much easier. On a bus it’s just a matter of pressing a button and alighting on your next stop On a boat it’s not possible and you need to stay focused at all times. One tiny mistakes and your sailing training will be wasted and the police will bust you. In order to win the chase against time, hop on the deck, turn on your nitro boosted engines and park your boat as you’re approaching the next city. Enjoy some beautiful 3D sceneries, challenge your opponents to see who can sail best, win the race and chase that glory of the best sailing pilot. So boys and girls - sail away or as they say: ride or be taken for a ride!<br/><br/>***The most fun and addictive racing simulator game I’ve played in years***<br/><br/>Let me tell you a secret. For the sake of driving your yacht in full sail and being able to avoid the police you will need to apply yourself. Unlike other free sim games, this super addictive and realistic simulator will provide you with some real challenge and test your skills to the maximum. Not only will you have to maintain the correct speed in order to escape the police but also apply your training to win that race. No other popular bus, plane, car or monster truck sim will give your kids and entire family this much fun. So once again boys and girls - see you during the race!!!", "metacritic": null, "released": null, "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/846/8469de580b6c7ca2975bb41634b77d49.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 148, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Play With Games"], "genres": ["Simulation"], "publishers": [], "esrb_rating": "Everyone"}