{"id": 231877, "slug": "shoot-2-goal-futsal-indoor-soccer", "name": "Shoot 2 Goal - Futsal Indoor Soccer", "name_original": "Shoot 2 Goal - Futsal Indoor Soccer", "description": "Score goals like a professional futsal player, take a free kick to the goalkeeper from different positions in the futsal pitch. <br/><br/>Play soccer championships like a striker against the goalkeeper y get the ball in the back of the net. Score goal, Free kick and penalty with spin near the poles and crossbar to get the max points. Aim right to earn the highest score in every match of this soccer game and become the best futsal player in the world.<br/><br/>Free kicks and penaltys with your finger on the screen and draw the ball´s trajectory. Score amazing soccer goals to get promoted to next division. Your rival team in soccer competition is scared of your swerve shot that always win the match of this soccer game.<br/><br/>★ ★ ★ ★ ★ Futsal soccer game at its best!<br/>★ ★ ★ ★ ★ Aim better with every shot<br/>★ ★ ★ ★ ★ Lift all the soccer cup to reach the glory<br/>★ ★ ★ ★ ★ Futsal stadiums are full of supporters<br/>★ ★ ★ ★ ★ Amazing soccer goals, free kick and penalty just like reality<br/><br/>Soccer fans are with you. You only must aim fine and score goal of the match of indoor soccer. Feel the pression of free kicks and penalty when the time is running and few seconds left to finish the match. The squad need your soccer goal to win the soccer competition and they want to celebrate with you. Forget the referee and concentrate in scoring with the good aim. Enjoy this soccer game, the best indoor soccer game.<br/><br/>〰️ 〰️ 〰️ 〰️ 〰️ 〰️ 〰️ 〰️ 〰️ 〰️ 〰️ 〰️ 〰️ 〰️ 〰️ 〰️ 〰️<br/>Bambo Studio 2018 - The best soccer games for Mobile<br/>🌐 Web: www.bambostudio.com<br/>👍 Facebook: facebook.com/bambostudio<br/>🐦 Twitter: @bambostu", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:36:21", "background_image": "https://media.rawg.io/media/screenshots/158/1584aa35bcb58c724b81f34310b5ded8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 191, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Bambo Sports"], "genres": ["Sports"], "publishers": [], "esrb_rating": null}