{"id": 231872, "slug": "detective-driver-miami-files", "name": "Detective Driver: Miami Files", "name_original": "Detective Driver: Miami Files", "description": "Become a Detective and stop the Criminal Masterminds! Use cars and boats to investigate crimes, chase the gang and foil their plan!<br/><br/>FEATURES:<br/>▶ SUNNY VICE ISLAND TO EXPLORE: feel the summer breeze on a huge detailed island!<br/>▶ STOP THE CRIMINALS: discover an exciting plotline and meet key characters in the story.<br/>▶ USE CARS &amp; BOATS: drive multiple vehicles in your mission to stop the criminals!<br/>▶ EXCITING AGENT ASSIGNMENTS: including car chases, investigations, hunting for clues, spying &amp; much more.<br/>▶ HIGH-FIDELITY GRAPHICS: with water physics, lighting system and audio effects.<br/><br/>Begin your adventure on Vice Island today! Learn the details of a nefarious plot and use your driving skills to stop it in its tracks! You will become a Detective, hired to investigate a crime that gets more elaborate with each new detail you learn.<br/><br/>To stop the criminals you will have to prove yourself as a master driver in a variety of cars. You’ll drive classic sports cars, a 4x4, an SUV… but that’s not all! When the time comes, you will have to switch to piloting speedboats and huge yachts with a different, unique control scheme.<br/><br/>Learn to drive them all safely and efficiently, and you will be able to stop the criminals and complete your mission. For finishing your tasks and challenges on time you will be rewarded with medals and money that can be used to unlock additional cars and missions. Chase the criminals, do your job, and you will be rewarded handsomely!<br/><br/>Join the best drivers club and feel the rush associated with high speed driving in a beautiful, sunny environment. Detective Driver has everything you’ll ever need to feel like a professional crime fighter! Drive, explore, complete the challenges! Be fast, be safe, be the best detective driver around!<br/><br/>While you complete your tasks you will have to be mindful of the traffic and other obstacles that could stop you. If you aren’t careful you could crash and lose your progress! Fortunately whenever that happens, you can always use the handy time rewind feature to quickly get back on your feet.<br/><br/>Master all of the vehicles and you will be able to complete your mission with the highest accolades. The safety of Vice Island depends on it, Detective!", "metacritic": null, "released": "2017-12-22", "tba": false, "updated": "2019-10-22T14:36:51", "background_image": "https://media.rawg.io/media/screenshots/ca2/ca220f5b8a946f70f490a5d126755e16.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 192, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Play With Games"], "genres": ["Sports", "Racing"], "publishers": ["Play With Games"], "esrb_rating": null}