{"id": 231929, "slug": "fashion-diva-dressup-makeup", "name": "Fashion Diva: Dressup & Makeup", "name_original": "Fashion Diva: Dressup & Makeup", "description": "The makers of ‘International Fashion Stylist’ and ‘Star Fashion Designer’ bring you a glamorous new fashion &amp; dress up game. Take on the runway, one stunning look at a time! Enter the dazzling world of High Fashion. Discover couture fashion!<br/><br/>Go crazy with exclusive clothing and pretty jewelry. Make everyone’s eyes sparkle as they watch beautiful girls grace the ramp! Dress the hottest models in exclusive looks. Create your own signature shows with gorgeous outfits, hairstyles, accessories and make up. Style interesting looks at the studio for exciting theme-based challenges, and impress everyone with your creative flair.<br/><br/>🌟🌟🌟 Become a FASHION GURU!!! Download Dress Up Games Stylist - Fashion Diva Style 👗 for FREE from the Google Play Store NOW!!! 🌟🌟🌟<br/><br/>Main Features:<br/><br/>🏆 Play in multiplayer mode - Compete 1 on 1 on Fashion Events!<br/>👩 Style your model - Models are waiting for you to style them!<br/>👗 Design your perfect look - Outrageously stylish clothes and accessories!<br/>💄 Create your ideal style - Trendy hairstyles &amp; ultra glam makeup!<br/>👩‍⚖️ Dress to impress - Make everyone astound when they see your unexpected dressup style choices you covet<br/>🎊 Exciting themes and breathtaking challenges - Feel the real pressure and tension of a runway show!<br/><br/>🏆 Multiplayer Mode<br/><br/>Do you think your style is the best? <br/>Play 1 on 1 with other divas in exciting fashion events, and find out for yourself! <br/>Get inspired by choices of others, improve your style, and may the best Fashion Diva win!!!<br/><br/>👗 Design your perfect look<br/>Be the glowing star of your own fashion show studio! Give your model attractive makeup and Dress them up with many beautiful dresses. If you covet the fashion world and dream to become a model, this is your opportunity to live your fantasy!<br/><br/>💄 Create your ideal style<br/><br/>Become a superstar beauty studio stylist and make your model look fabulous with the latest fashion. You have the opportunity to be the designer and makeup stylist. Try unique fantasy styles and makeup, jewelry collections, accessories and hairstyles. The models need the perfect makeup for the occasion! Your girls will glow and you can share your designer makeup abilities with your friends!<br/><br/>🌟🌟🌟 Become a FASHION GURU!!! Download Dress Up Games Stylist - Fashion Diva Style 👗 for FREE from the Google Play Store NOW!!! 🌟🌟🌟<br/><br/><br/>Dress Up Games Stylist - Fashion Diva Style 👗 requires the following permissions :<br/>* ACCESS_COARSE_LOCATION : This permissions is required by ad networks.<br/>* READ_EXTERNAL_STORAGE / WRITE_EXTERNAL_STORAGE : This permission is required for saving your creations<br/><br/>Please note that we use Advertising ID for serving better ads and improving the product through Analytics<br/><br/>Games2Win is a fun company that believes in creating amazing and enjoyable games for all ages. We have over 800+ proprietary games that are available both online and on mobile. Some of our smash hit games are Driving Academy - Car School Driver Simulator 2019, International Fashion Stylist, Power Cricket T20, Decisions - Choose Your Interactive Stories2019 and Car Driving &amp; Parking School. Currently, our company boasts of more than 220+ million app downloads and 13+ million gamers a month. And this is just the beginning!<br/><br/>VISIT US: http://games2win.com <br/>LIKE US: http://facebook.com/Games2win <br/>FOLLOW US: http://twitter.com/Games2win <br/><br/>Contact us at androidapps@games2win.com for any problems you may have.<br/><br/>Privacy Policy: http://www.games2win.com/corporate/privacy-policy.asp", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:36:15", "background_image": "https://media.rawg.io/media/screenshots/aa1/aa19c31e08b9d2799f430a6699a5a5af.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 316, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Games2win.com"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}