{"id": 231900, "slug": "3d-drift-xtreme-race-simulator", "name": "3D Drift Xtreme Race Simulator", "name_original": "3D Drift Xtreme Race Simulator", "description": "***Super extreme 3d drift race game***<br/><br/>All fans of of street racing - listen carefully! We’re proud to present this free game, that’s all about catching the right drift. You’ll be performing extreme stunts with these gt sports cars in some famous city locations. You have 5 cars to choose from and each is different in terms of speed, rally capabilities and street cred. Remember that you’ll be living on the verge of crime and as we all know - crime doesn’t pay. Unless you wake up your speed mania and race before anyone can catch you. Your mission is to race through orange checkpoints in order and drive over the green parking line to finish. You are ranked on two things: speed and drift skills. Repeat levels to improve your rank for both!<br/><br/>***How successful you are is only up to you - speed earns you stars and stars earn you cars!***<br/><br/>You can get get up to 3 stars. Get to the 1st  star for completing the level before you fuel runs out. The second is for a faster completion time. The 3 rd one is for beating the pro ghost car or target time. Hold your drift for maximum points. The longer the drift the bigger the multiplier; but crashing will cancel your current drift score. Unlike other jet or bike games, this free game is super addictive and super fun. Once you finish with one city you can always rally on the next one. There are plenty of levels and some serious challenge to master these gt monsters.<br/><br/>GAME FEATURES<br/><br/>▶ Master 5 Awesome Drift Cars with Real Physics on 30 diverse circuits!<br/>▶ Multiple modes: Earn your Drift License and learn the basics; put your skills to work in Drift Stunt Challenges; master the Drift Circuits or show off your creativity in Arena Freestyle!<br/>▶ New GHOST Tech: Race against the Spectre of a Pro, or your own best times to unlock new cars, levels and Career stages!<br/>▶ Easy to drive, but hard to master: Realistic Drift handling makes it satisfying to learn your craft. See yourself rise through the World Leaderboards!<br/>▶ Score high by keeping your Drift going! Style over Speed!<br/>▶ No upgrades or boosts for your cars: It's just you and the machine against equal competitors - a fair playing field to prove your Drifting Skills!<br/>▶ Exciting dynamic environment with animated scenery and obstacles.<br/>▶ Share your most EPIC REPLAYS with Everyplay!<br/>▶ Compete in the Championship: Try to get the World’s best scores for Drift and Speed!<br/>▶ Maximum Control: Supports Touch, Tilt and Analogue steering methods.", "metacritic": null, "released": null, "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/621/621b7f061020393794adc5ad33e4e5cb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 181, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Play With Games"], "genres": ["Simulation"], "publishers": [], "esrb_rating": "Everyone"}