{"id": 231988, "slug": "hakuoki-premium-edition", "name": "Hakuoki: Premium Edition", "name_original": "Hakuoki: Premium Edition", "description": "Hakuoki: Premium Edition<br/><br/>“Hakuoki”, the otome game that gained popularity not only in Japan but in the whole world, is now available in Englishl!<br/>The whole story fully-voiced in Japanese by popular voice actors, and the beautiful illustrations are perfectly ported right from the PSP version! In addition to that, it features a new scenario and new illustrations specifically created for the original app.<br/><br/>This version includes all the scenarios, as well as the new one, and gives a better value compared to the Normal Edition.<br/>-------------------------------<br/>*Requires iOS 5.1.1 or later<br/>*If you already bought the Normal Edition of the app, please be aware that save data are not transferable.<br/>*Wi-Fi connection environment is required to download this app.<br/><br/>[STORY]<br/>It is the end of the Edo Era, and the 3rd year of the Bunkyu Era... <br/>The protagonist, Chizuru Yukimura, was raised in Edo and is daughter to a Rangaku scholar.<br/>Having lost contact with her father in Kyoto, Chizuru decides to visit him. <br/>There, Chizuru witnesses a Shinsengumi soldier killing a bloodthirsty monster.<br/>By strange happenstance, Chizuru finds herself connected to the Shinsengumi, and the assassins desperate to kill them.<br/>As time progresses, Chizuru will discover their terrible secret...Furies.<br/>Tortured by their own thoughts, the men of the Shinsengumi wield their blades in defense of their faith and ideals, in an era torn apart by chaos.<br/>Hidden in the riots that defined the passing of the Edo period, a dark battle within the Shinsengumi begins: A battle that will never be recorded in the pages of history... <br/><br/>[SMARTPHONE VERSION EXCLUSIVE SCENARIO “A Sweet Opinion”]<br/>In February 1867, Chizuru is asked to attend a tea party on Kondo’s behalf. She accepts to go accompanied by the Shinsengumi warriors. What’s hidden behind that sudden invitation? What awaits her...? Find out by spending some sweet time with your favorite character!<br/>*This scenario is mobile-exclusive! It’s fully voiced (Japanese) and includes six new illustrations.<br/>*The scenario is available upon purchase of all main episodes.<br/><br/>[CAST]<br/>Toshizo Hijikata（CV:Shin-ichiro Miki）/Souji Okita（CV:Showtaro Morikubo）/Hajime Saito（CV:Kohsuke Toriumi）/Heisuke Toudou（CV:Hiroyuki Yoshino）/Sanosuke Harada（CV:Kouji Yusa）/Isami Kondou（CV:Toru Okawa）/Keisuke Sanan（CV:Nobuo Tobita）/Shinpachi Nagakura（CV:Tomohiro Tsuboi）/Kodo Yukimura（CV:Ryugo Saito）/Chikage Kazama（CV:Kenjiro Tsuda）/etc<br/>*Japanese Only.", "metacritic": null, "released": "2015-04-21", "tba": false, "updated": "2023-05-03T08:32:31", "background_image": "https://media.rawg.io/media/screenshots/6a3/6a35b09d93d572abcacf190d017ea767.jpg", "website": "http://www.otomate.jp/smp/en/hakuoki/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 379, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Idea Factory"], "genres": ["Adventure"], "publishers": ["Idea Factory"], "esrb_rating": "Teen"}