{"id": 232041, "slug": "fuzzy-house-premium", "name": "Fuzzy House Premium", "name_original": "Fuzzy House Premium", "description": "“All in all, it's a beautiful app that I highly recommend.“<br/>Geekswithjuniors.com<br/><br/>When you enter Fuzzy House, you enter a timeless world, that you can change and vitalize yourself. Kids can explore Fuzzy House, use their imagination and create their own stories as they play along.<br/><br/>What is going to happen in the house is up to you – is there going to be a tea party, is it time to tug the fuzzies to bed, take a bath or just sit by the fireplace and play the guitar?<br/><br/>In Fuzzy House you will meet no in-app purchases and no advertisements. There are no time limits, levels, scores or power ups – Fuzzy House is all about free open-ended and imaginative play. There are lots of things to discover and interact with and therefore plenty of replay value.<br/><br/>Fuzzy House is designed, so that 4 year olds as well as 9 year olds can use it – and have fun.<br/><br/>We have established Fuzzy House, because we want to develop great apps for kids.<br/><br/>- Apps that appeal to parents like ourselves who prefer authenticity over princess stereotypes and makeup games.<br/><br/>- Apps where kids can use their imagination and create their own stories as they play along.<br/><br/>- Apps where kids can be kids without gender stereotypes.<br/><br/>Fuzzy House is supported by the Danish Games Scheme.<br/><br/>“There is so much for kids to explore, it’ll take them a long time to get through it all.”<br/>Bestappsforkids.com<br/><br/>Featured as one of “7 AWESOME apps for preschoolers”:<br/>“There is plenty to discover and interact with, and the app is supported by a great website with ideas for make and create, and knitting.”<br/>kidsonthecoast.com.au<br/><br/>“The more digital my life gets – and that of my children – the more I’m drawn to beautiful physical toys, from wood to wool. Some apps are inspired by those kinds of toys too, though. Fuzzy House, for example, is a lovely “doll house app” that stars a cast of woolly characters.”<br/>Appsplayground.com<br/><br/>“Love using open exploration apps like this in OMazing Kids speech therapy! So many great opportunities for vocabulary, verbs, adjectives, pronouns, spatial concepts, storytelling, sequencing, turn taking and more.”<br/>omazingkidsllc.com<br/><br/>www.fuzzyhouse.com<br/>https://www.facebook.com/fuzzyhouse<br/>https://www.instagram.com/fuzzyhouse/", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-02T06:55:30", "background_image": "https://media.rawg.io/media/screenshots/91d/91de0c890c10e6658e46454d0cd3a50c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 250, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Fuzzy House Aps"], "genres": ["RPG"], "publishers": [], "esrb_rating": "Everyone"}