{"id": 23208, "slug": "bit-heroes", "name": "Bit Heroes", "name_original": "Bit Heroes", "description": "Explore a vast new MMORPG world inspired by your favorite pixellated dungeon crawlers.<br/><br/><strong>Bit Heroes</strong> captures that charm and nostalgia of your favorite RPGs, delivering them seamlessly to your computer.<br/><br/><br/><br/>Collect and craft thousands of pieces of loot to increase your power. Build your team by capturing monsters and bosses to fight at your side in old school, turn-based combat. Prove you’re the mightiest hero in the land by competing in the PvP arena, Raids, and weekly events for awesome prizes! Take your most powerful friends and guildmates along to battle at your side!<br/><br/><br/><br/><strong>Key Features:</strong><br/><ul><li>Retro dungeon crawling adventure!<br/></li><li>Participate in rotating competitive events, including PvP, Guild vs. Guild, Gauntlets, Trials, Invasions, and more!<br/></li><li>Five vast zones with over 60 randomly-generated levels and raids.<br/></li><li>Thousands of mix and match pieces of loot to upgrade, craft, and recycle.<br/></li><li>Capture and evolve over 100 creatures to fight by your side! (including powerful bosses).<br/></li><li>Equip fantastic pets such as floating pizza, tiny unicorns, and more!<br/></li><li>Team up with friends to tackle ultra-difficult dungeons to find great treasure!<br/></li><li>Level up your guild to unlock a special shop with powerful bonuses.<br/></li><li>Share stories and swap strategies with World Chat and Guild chat.<br/></li><li>Original chiptunes soundtrack that sounds like it was ripped straight from a NES cartridge.</li></ul><br/>", "metacritic": null, "released": "2016-09-29", "tba": false, "updated": "2023-11-01T09:54:29", "background_image": "https://media.rawg.io/media/screenshots/ea5/ea5e08d9467b0562e4582f2b2809a2fb.jpeg", "website": "https://www.kongregate.com/games/Juppiomenz/bit-heroes/", "rating": 2.9, "rating_top": 3, "added_by_status": {"yet": 3, "owned": 286, "beaten": 1, "dropped": 21, "playing": 3}, "playtime": 2, "achievements_count": 21, "ratings_count": 19, "suggestions_count": 460, "game_series_count": 0, "reviews_count": 21, "platforms": ["Web", "macOS", "PC", "Android", "iOS"], "developers": ["Kongregate", "Juppiomenz"], "genres": ["Adventure", "RPG", "Massively Multiplayer"], "publishers": ["Kongregate"], "esrb_rating": null}