{"id": 232090, "slug": "igun-pro-the-original-gun-app", "name": "iGun Pro -The Original Gun App", "name_original": "iGun Pro -The Original Gun App", "description": "<p>Downloaded over 55 Million times worldwide, iGun Pro is one of top 500 downloaded game apps of all time.   With 390+ weapons available and more added weekly, the best gun simulation app just keeps getting better!!!<br />\nFeatures:<br />\nFire - Ultra-Realistic gun simulation including both motion blur and smoke with an easy to learn interface let use quickly begin using your collection.<br />\nCollect - The largest library available on any mobile platform with over 390 guns just a tap away!<br />\nLearn - iGun Pro has a massive library of specs, history, usage and statistics of all the firearms featured in the app.<br />\nCustomize -<br />\nGun Wall - Display your guns to your way,<br />\nDetermine your shooting experience with adjustable recoil, motion blur, and slow motion<br />\nMake your weapons your own with skin packages<br />\nAccurate, high-resolution reproductions of a wide range of weapons including assault rifles, shotguns, handguns, sniper rifles, rocket-propelled grenades (RPG), machine guns, mini-gun and older antique guns.<br />\nWe have a HUGE selection of over 390 guns, including:<br />\n- The Minigun<br />\n- The Gatling Gun<br />\n- RPG<br />\n- AK-47<br />\n- M16<br />\n- Glock 17<br />\n- MK-19<br />\nDon&#39;t see a gun from your favorite game? Developers who are always listening for what you want next! Give us feedback on our Facebook page at www.facebook.com/iGunPro<br />\niGun Pro is a registered trademark of Crimson Moon Entertainment LLC. The iGun Pro logo, Crimson Moon Entertainment, and the Crimson Moon Entertainment logo are all trademarks of Crimson Moon Entertainment LLC and may not be used without explicit written permission.</p>", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-31T02:38:33", "background_image": "https://media.rawg.io/media/screenshots/cd9/cd919fddbaf618f0547d5677a7871bc2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 195, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "Android"], "developers": ["Crimson Moon Entertainment"], "genres": ["Shooter", "Simulation", "Arcade"], "publishers": [], "esrb_rating": "Everyone"}