{"id": 232115, "slug": "bubble-coco-color-match-bubble-shooter", "name": "Bubble CoCo: Color Match Bubble Shooter", "name_original": "Bubble CoCo: Color Match Bubble Shooter", "description": "Aim, fire and burst colorful bubbles! <br/><br/>Are you ready to be the best bubble shooter? Pop your way to the Victory!<br/><br/>Explore the bubble pop adventures with CoCo the mother hen and her baby chicks.<br/>More than 3,000 levels to go playing! You will find it very fun and addictive!<br/>Well-designed levels with various game modes will take your breath away!<br/><br/>Easy to play. Be the greatest bubble shooter in the world!<br/>Aim, shoot and blast color bubbles with excellent bubble shots! Match 3 or more same color bubbles to pop.<br/><br/>Bubble popping, bubble shooting fever!<br/>Bubble shooting 10 combos to have super fever mode for higher scores! Lots of helpful boosters and items. The more you drop the bubbles, the higher your scores will be.<br/><br/>New levels, events and rewards!<br/>Constant new game level updates. Enjoy diverse game events everyday and get rewards! Compete with other bubble shooters for better prizes : jewels, coins and boosters. Become the greatest bubble shooter.<br/><br/>Play with or without friends!<br/>Send gifts, ask help requests and compete with friends to see who is the best color bubble shooter!<br/><br/>Colorful and high quality graphics.<br/>Shoot and match color bubbles with CoCo the bubble shooter and her chicks. Complete daily quests and gain various cute costumes. Match the colorful fruit bubbles with same colors : red, blue, purple, yellow and green.<br/><br/>The best Bubble shooting game ever for you!<br/>Perfect to blast away your boredom. Kill the boring time with Bubble blasting game. Enjoyable without the Internet connection or Wi-fi. Completely Free to play. <br/>* Some optional in-game purchase may require the payment.<br/><br/>Please share your bubble popping, bubble shooting playing moment with other bubble shooters on our official fan page : https://www.facebook.com/playbubblecoco<br/><br/>Visit the Bubble CoCo Help Center : https://www.facebook.com/playbubblecoco", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:35:42", "background_image": "https://media.rawg.io/media/screenshots/40c/40cc2da1af29548da877c91fa24fc225.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 84, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["CookApps"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}