{"id": 23212, "slug": "artificial-superintelligence", "name": "Artificial Superintelligence", "name_original": "Artificial Superintelligence", "description": "You’re a startup founder building the world’s first sentient supercomputer!<br/><br/>Slide either left or right to train your AI, handle the bizarre requests of Silicon Valley residents, and explore parallel universes.<br/><br/>If you can keep your employees, your investors, the government, and the internet from tearing apart the fabric of society, then maybe you'll actually bring about the Singularity.<br/><br/>But you'll probably just get arrested by the FBI. Or kidnapped by an obsessed superfan. Or consumed by a swarm of nanorobots. <br/><br/>¯\\_(ツ)_/¯<br/><br/>Features:<br/>- Hilarious branching story overflowing with sci-fi weirdness.<br/>- Level up your dumb-as-rocks AI to the point where she’s millions of times smarter than every human who ever lived, combined.<br/>- Every time you play, you start in a new parallel universe; most are pretty similar to ours, but some have… diverged.<br/>- Meet characters like a hipster, an elder god, and a naked time traveler.<br/>- Learn how AI really works - and all the ways it can be both good and bad for humanity.<br/>- Find all 52 unique endings, such as the one where your cat Captain Whiskers enslaves humanity.<br/>- Music made by an actual artificial intelligence (ha ha, machines are coming to take all your jobs).<br/><br/>Apps starring the AI construct CARROT have been featured by Apple, The New York Times, Good Morning America, and Wired, and are beloved by millions of meatbags the world over.<br/><br/>* Note: iPhone 5, iPod Touch 6, iPad mini 2, iPad Air or later recommended.", "metacritic": null, "released": "2017-05-11", "tba": false, "updated": "2019-10-22T14:30:35", "background_image": "https://media.rawg.io/media/screenshots/7d2/7d290f1e5007d98bdacbd80815bdbf3b.jpeg", "website": "http://www.artificialsuperintelligence.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 138, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Grailr"], "genres": ["Adventure", "RPG"], "publishers": ["Grailr"], "esrb_rating": null}