{"id": 232192, "slug": "little-tittle-pyramid-solitaire-card-game", "name": "Little Tittle — Pyramid solitaire card game", "name_original": "Little Tittle — Pyramid solitaire card game", "description": "From the creators of Mechanicus, this captivating game is sure to appeal to all fans of card game. Little Tittle Adventure is an exciting mobile application that captures your interest from the start and keeps it until the very end. At first, the levels are fairly easy, but as you get further along, the game becomes more complicated and challenging. New objectives appear as you go, adding variety to the game.<br/><br/>Solitaire's history goes back to the invention of playing cards themselves. The original French name for the game is \"patience.\" It is believed that solitaire was invented by prisoners, who had a lot of free time and were starved for human companionship. Only very talented, intelligent people could've come up with an excellent logic game like this! Patience solitaire was popular entertainment exclusively among prisoners for a time, but it wasn't long before it gained popularity with everyone, even kings. Modern-day patience solitaire includes elements from other common solitaire card games. Every serious card player knows about patience solitaire.<br/><br/>This card game isn't just for entertainment – it also helps the player learn to concentrate and improve their logic skills. The mental load increases as the levels become more complex, which is ideal for brain training.<br/><br/>In the Little Tittle Adventure pyramid solitaire card game, colorful, magical animations and music create captivating backgrounds. The game also features global and friend rating boards. As you clear each level, you can share your achievements on social networks and brag to your friends.<br/><br/>Download and play Little Tittle Adventure for free.<br/><br/>What to expect:<br/>- An original magical design<br/>- Easy to download<br/>- A streamlined tutorial mode<br/>- Excellent graphics with high resolution<br/>- A large selection of languages<br/>- Suitable for all age groups, both children and adults<br/>- Coming soon: choose different backgrounds and card backs<br/><br/>So what are you waiting for? Download classic card game and start improving your logic and imagination now!", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:35:33", "background_image": "https://media.rawg.io/media/screenshots/6cb/6cb648f9420d325dff287ec04011eed5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 146, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["TeslaGames"], "genres": ["Card"], "publishers": [], "esrb_rating": null}