{"id": 232203, "slug": "message-quest-adventures-of-feste-with-ads", "name": "Message Quest — adventures of Feste (with ads)", "name_original": "Message Quest — adventures of Feste (with ads)", "description": "Message Quest is a tiny stained-glass point-and-click adventure about laziness and its herald. The atmosphere and story were inspired y a well-known Japanese animation studio. <br/><br/>This is the story of a lazy herald called Feste. You may know heralds, the guys who show up at the beginning of every story, looking for a hero to deliver that “call to adventure” thing to. You know, right before the interesting stuff starts to happen. That’s exactly our Feste's job: find a hero, give them their call to adventure, and be done with it. No exploits, no saving the world. But all he wants to do is sleep and eat candy. You must become his conscience and lead him through the struggles and strange encounters of the Road Between Worlds.<br/><br/>A cute fantastic journey for one evening—the game lasts about an hour and a half, so you’ll get the full story in one session.<br/><br/>The adventure will be fun for children and adults alike. Message Quest is an RPG for anyone who loves unusual tales of fantasy.<br/><br/>Features:<br/><br/>- Unusual stained-glass graphics that make everything look like a fairy tale;<br/>- Charming characters with unpredictable reactions who share their stories;<br/>- Puzzles with traditional mechanics that allow you to fully enjoy the story without losing game immersion;<br/>\"- Funny boss fights in true JRPG style with zany attacks and bonuses; <br/>- A new dialogue system that allows you to control multiple characters in a conversation;\"<br/>- Jokes and easter eggs that will surprise you when you least expect it;<br/>- A magical soundtrack written especially for Message Quest that will immerse you in the bizarre fantasy universe of the Road Between Worlds.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:35:30", "background_image": "https://media.rawg.io/media/screenshots/5d1/5d129307b6f6fdc10787748e88052ea1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 280, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["TeslaGames"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}