{"id": 232234, "slug": "war-games-blitz-tank-shooting-games", "name": "War Games Blitz: Tank Shooting Games", "name_original": "War Games Blitz: Tank Shooting Games", "description": "Get ready for tank war in the real warzone and fight with your enemy tanks which are in try to find and destroy your tank. You have to shoot enemy machine tanks in each level and complete the missions successfully to become the best tank warrior. Modern tanks are available in this world warfare tank game you have to select your high powerful tank for defensive attack. This is one of the best army games for free they can enjoy this tank battle game. Modern warzone environment has been designed to have real tank fighting with enemy tanks. <br/><br/>Tank Game Features<br/>•\t15+ iconic war tanks to choose from<br/>•\tcustomize tank war capability<br/>•\t100+ tank war strategies to dominate<br/>•\tTones of assist weaponry available<br/>•\tRoam around on tanks and dominate<br/>•\t5+ thematic worlds<br/>Winning Strategy from tank battles to tank wars!  Enemy tanks will try to find you and destroy you but you have to use your smart war strategy skills and destroy their tank force to win the mission. This is a multi featured army tanks war game, ride on the modern tank and battle tanks to win this tank warfare. Your revolution should be to conquer your area from the enemy tank attack. Enemy tanks are hidden behind their check posts and explode missiles on your area. This is an offline tank game offering a chance to lead in war of tanks. <br/><br/>Your health and coins collection is very important in this free tank game. To which tank you will destroy in this tank war game it will give you a pack of bullet, health or coin to collect and your tank's health and life will be increased to fight and eliminate more enemies or to destroy enemy tanks. You might have played other action games but in this tank game for free we offer real battle experience. Experience now addicting tank battle game and lead your tank army to invade enemy. <br/><br/>Enjoy the tanks battles; destroy enemy tanks and their check posts to show them your tank domination. Different modern tanks e.g. coral tanks, AT Gun Tanks strike, Cannon Tanks strike are available to have best and real tank fighting experience. You also learn tank driving and usage of army tanks in this tank war games play. Smooth and realistic controls will also help you to drive tank right and safe. Experience the Infinite cannon balls and bullets are available in each level of this world warfare tank game.<br/><br/>What we are offering for Tank Game Lovers: <br/>•\tMultiple Different tanks for fighting<br/>•\tInfinite cannon balls in the tank's cannon<br/>•\tTanks war in the desert and city <br/>•\tMultiple challenging and thrilling levels with increasing enemy tanks<br/>•\tThrilling and adventurous sounds of cannons <br/>•\tZoom in and Zoom out aim target<br/>•\tMap navigation to find enemy tanks<br/>•\tReal warzone environment with check posts <br/>•\tSmooth and realistic war tank controls<br/>•\tIt is free to play tanks war game<br/><br/>Just install and play this tank game and feel the real thrills of war. Give your effective feedback after playing this incredible tank game.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:35:27", "background_image": "https://media.rawg.io/media/screenshots/5bb/5bbd444b0be1826b4feccac42dd14c58.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 275, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["spiritapps"], "genres": ["Action"], "publishers": [], "esrb_rating": null}