{"id": 232236, "slug": "water-surfer-car-floating-beach-drive", "name": "Water Surfer car Floating Beach Drive", "name_original": "Water Surfer car Floating Beach Drive", "description": "Water surfer car floating race game is now available free on google play store in which you will race different kinds of sports cars in full water challenge free. You will have been played cars road racing and city car racing games till now but water car floating race is a new idea of car racing. It is simply like water jetting and submarine racing games you will have a car and you have to drive it on the beach pass through the ocean and to achieve small targets to complete level.  sea run real skiing bike racing challenge is here in the form of super cars racing. 4x4 car racing adventure in desert on beach and in the ocean in limited amount of time will be an amazing water car racing challenge for you. Ride on Nissan car and go in to the ocean water and enjoy  car floating game free.  water surfer car floating race in full ocean adventure you will never experience such an ocean adventure in real life. while driving or floating car in water in this wind surfing car game you will feel as you are driving and enjoying real car water racing in actual life.<br/>Floating bus, car or bike on the water surface is really very risky and adventurous. Like crazy stunt car racing don't  try to make crazy car stunts in the ocean water you may go under water while making stunts and your car may sink into the water and floating water car underwater will be difficult according to the water physics. floating bus, floating car and floating bike uses same water physics so if you drive and float city car into the water then you will be able to float or drive water bus and water bike on the water surface. be safe and drive water car carefully. Don't lose confidence while passing through the heavy layers of water keep full control on your car and continue car driving or car floating. if you will be puzzled on seeing the heavy and big layers of coming water in the huge deadly ocean then nothing will stop you from sinking.<br/>just ride on your favorite car and start to enjoy water car riding in real wind surfing environment. hope you will find it the best water surfer car racing game ever played.<br/>Water Surfer Car Floating Race 2017 Feature:<br/>\tamazing super 4x4 car for floating in ocean adventure<br/>\t3d real ocean and beach environment<br/>\tcheckpoints to check in each level<br/>\tlimited time to make your habit to reach destination in time<br/>\tAwe some flowing water in the ocean<br/>\tyou will enjoy Desert car driving also<br/>\tattractive HD graphics and UI's<br/>\tSimple and easy game play<br/>\tSmooth and realistic controls<br/>install this water surfer game and enjoy the real time car floating race in the ocean. Give your good review and feedback after playing this game.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:35:26", "background_image": "https://media.rawg.io/media/screenshots/554/5545675ccb94519ddee180fc3c203ae6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 123, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["spiritapps"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}