{"id": 232202, "slug": "modern-combat-5-esports-fps", "name": "Modern Combat 5: eSports FPS", "name_original": "Modern Combat 5: eSports FPS", "description": "&gt; “It plays as good as it looks.” – IGN<br/>&gt; “Amps everything up to the next level.”  – 148Apps <br/>&gt; “Sharp controls, impressive graphics.”  – Pocket Gamer <br/><br/>War has evolved, and so has the best online FPS on mobile! <br/><br/>Step onto the battlefield and answer the call with the title that raised the bar for first person shooter games with its great graphics, high-powered guns and intense online multiplayer action. Create a squad from 9 classes, add your friends for team play and test your skills in dynamic warfare against online rivals from around the world!<br/><br/>Prefer to work alone? Then feel free to step into the thrilling solo play campaign as you shoot your way through one dire situation after another to save the world as you launch an attack against a lunatic’s apocalyptic plans.<br/><br/>You won’t find more first person shooter fun in a free game anywhere!<br/><br/>9 CLASSES WITH UNIQUE SKILLS<br/>&gt; Customize and level up any of the 9 classes across solo play and team play modes. <br/>&gt; Find the playstyle that suits you: Assault, Heavy, Recon, Sniper, Support, Bounty Hunter, Sapper, X1-Morph, or Kommander.<br/>&gt; Activate class-specific skills by earning and spending Skill Points.<br/><br/>HIGH-POWERED ONLINE MULTIPLAYER <br/>&gt; Watch players engaged in live online FPS battles and eSports competitions with all the great graphics you expect in the new Spectator mode.<br/>&gt; Epic guns-a-blazing team play in Squad vs. Squad matches.<br/>&gt; Talk to other players to plan your online multiplayer strategies and coordinate an attack in the Global and Squad Chats.<br/>&gt; Top the individual and Squads leaderboards as you master your eSports skills.<br/>&gt; Win free rewards and cool prizes in limited-time events.<br/><br/>UNIFIED GAME PROGRESSION<br/>&gt; Accumulate XP and level up by playing both solo play missions and team play matches.<br/>&gt; Unlock higher-tier guns and other weapons by mastering lower-tier guns.<br/>&gt; Customize the perfect weapon using a host of attachments and jump straight into the free game action.<br/><br/>INTENSE SOLO PLAY CAMPAIGN <br/>&gt; Engage in fast-paced story missions where the call will take you from Tokyo to Venice for a variety of first person shooter challenges.<br/>&gt; Play the new Spec Ops missions for a real online FPS adrenaline rush.<br/>&gt; Great graphics, music and voice performances perfectly adapted for a first person shooter game.<br/><br/>HIGHLY CUSTOMIZABLE CONTROLS<br/>&gt; Intuitive, highly customizable controls so you can play the game just the way you want.<br/>&gt; Modern Combat 5 supports HID game controllers. MOGA Pro is also supported, in mode B (HID Mode).<br/><br/>Modern Combat 5 requires an Internet connection.<br/><br/>So if you’re ready for the online FPS of your dreams, dive into this unparalleled free game that takes online multiplayer to new heights. Perfect for anyone hungry for solo play first person shooter fun, or team play eSports competition.<br/><br/><br/>_____________________________________________<br/><br/>Visit our official site at http://gmlft.co/website_EN<br/>Check out the new blog at http://gmlft.co/central<br/><br/>Don't forget to follow us on social media:<br/>Facebook: http://gmlft.co/FBMCGP<br/>Twitter: http://gmlft.co/twmcgp<br/>Instagram: http://gmlft.co/GL_SNS_IG<br/>YouTube: http://gmlft.co/ytmcgp<br/>Forum: http://gmlft.co/MC5FR<br/><br/>This app allows you to purchase virtual items within the app and may contain third-party advertisements that may redirect you to a third-party site.<br/><br/>Terms of Use: http://www.gameloft.com/en/conditions-of-use<br/>Privacy Policy: http://www.gameloft.com/en/privacy-notice<br/>End-User License Agreement: http://www.gameloft.com/en/eula", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-30T23:04:36", "background_image": "https://media.rawg.io/media/screenshots/ea6/ea6a1e622672f41ee436a7318ff79c5d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 480, "game_series_count": 0, "reviews_count": 1, "platforms": ["Android"], "developers": ["Gameloft", "Gameloft SE"], "genres": ["Action"], "publishers": [], "esrb_rating": "Mature"}