{"id": 232266, "slug": "racing-in-moto-traffic-stunt-race", "name": "Racing In Moto Traffic Stunt Race", "name_original": "Racing In Moto Traffic Stunt Race", "description": "welcome to endless highway traffic racing game in which you will have a heavy bike and you have to race it in the huge city traffic rush. you have to drive moto bike in fast Upcoming dodge traffic. like a real highway racing you have to race your highway bike and reach the destination in the time limits. you have to win this motorcycle racing competition and proof yourself as real  highway road racer. select Moto bike and choose bike racing environment according to your choice, chill moto bike endless racing free and become heavy bike rider expert. you will never enjoy such an endless fastest bike racing. in this endless bike traffic racing 3 kinds of environment modes and different motorbikes are being offered to drive. enjoy traffic car racing in real city snowy, real desert and real jungle environment you will really enjoy this motorcycle racing in snowy environment mode.<br/>crazy traffic racing with fast boosts on highway asphalt roads will be an extreme fun. just race your bike make more score by passing very close to the vans, cars and challenge to your friends by making highest score.<br/>\tendless racing fever game<br/>\tdifferent bikes for racing on asphalt road<br/>\ttime racing and time free bike racing<br/>\thuge traffic rush bike racing<br/>\tdesert, jungle, city snowy environment modes<br/>\tsmooth and realistic bike controls<br/>\tsimple and easy game play<br/>\tattractive and User friendly UI's <br/>best of luck for this bike death race. be safe and give good and positive reviews after playing this game.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:35:17", "background_image": "https://media.rawg.io/media/screenshots/9a3/9a3683c558bdac6f140e1d47587de49f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 153, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["spiritapps"], "genres": ["Racing"], "publishers": [], "esrb_rating": null}