{"id": 2322, "slug": "bards-gold", "name": "Bard's Gold", "name_original": "Bard's Gold", "description": "Bard's Gold is a challenging platformer that let's you explore eerie worlds in a quest for a Goblin that stole your gold. Help the Bard to overcome the dungeon’s many dangerous perils and use your new-found treasures to improve your character and to buy new weapons and gear!<br/><br/><br/>This game takes inspiration from early 90's platforming classics such as Rainbow Island, Rick Dangerous, Alex Kidd and Erik, which at the time were popular on the Amiga and consoles. Bard's Gold is slower paced than most current day platformers, but is extemely challenging. Players need to avoid enemies, traps and projectiles in order to progress. Being hit by any of them means instant death. Difficult puzzles and towering bosses will have to be overcome to reach the filthy goblin that stole the family treasure.Key Features<ul><li><strong>Old school platforming experience</strong> - No tutorials or explanations how things should be done. Everything including the basic game mechanics must be figured out by yourself as you go.<br/><br/></li><li><strong>Rogue-lite</strong> - Different layouts for each level is randomly chosen every playthrough. While getting the chance to memorize levels and get better at them, the \"random level\" system will keep your interest. With the gems you collect you will be able to upgrade your character on the Game Over screen. These upgrades are permanent and will help you on future playthroughs.<br/><br/></li><li> Extremely challenging, yet rewarding gameplay<br/><br/></li><li> Beautifully designed retro-inspired graphics<br/><br/></li><li> Gain powerful new abilities by finding skill books<br/><br/></li><li> Death will make you stronger<br/><br/></li><li> Solve intricate puzzles and defeat towering bosses<br/><br/></li><li> Full controller support<br/><br/></li><li> Steam achievements, leaderboards and trading cards</li></ul>LoreWhile I was adventuring, I got my saddle containing the legendary Bard's Gold stolen by a filthy goblin.<br/>It has been my Family Treasure for generations... <br/>I had to get it back at all costs! Giving chase to the burglar, I went through a portal that sent me to this strange world... <br/>I must escape and return the Bard's Gold to where it belongs!", "metacritic": 58, "released": "2015-08-14", "tba": false, "updated": "2023-10-14T15:14:00", "background_image": "https://media.rawg.io/media/screenshots/4ba/4ba23f4d0d622f8d22de7f22339f14b3.jpg", "website": "http://www.bardsgold.com", "rating": 2.8, "rating_top": 3, "added_by_status": {"yet": 2, "owned": 108, "beaten": 1, "toplay": 1, "dropped": 3}, "playtime": 4, "achievements_count": 105, "ratings_count": 10, "suggestions_count": 304, "game_series_count": 0, "reviews_count": 10, "platforms": ["Xbox One", "PS Vita", "PlayStation 4", "macOS", "PC", "Linux"], "developers": ["Erdem Sen t/a Erdem Sen", "Erdem Sen"], "genres": ["Action", "Indie"], "publishers": ["Pixel Lantern", "Erdem Sen"], "esrb_rating": "Everyone"}