{"id": 23227, "slug": "xoel-empire", "name": "xoEl Empire", "name_original": "xoEl Empire", "description": "The Yabbies used to live in harmony, but everything changed... When the xoEl empire attacked. Now, they are trapped waiting his squared destiny and you, blessed by an unknown power, are the only one who can save them… Rotate, Match colours and solve tons of puzzles in your way to freedom.<br/><br/><br/><br/>The yabbies are one of the cutest creatures in the entire galaxy: lazy, sweet and they love to cuddle... but now they are trapped in cages and can’t escape!  But you can save them with your intellect and your tenacity. Save them and return them the freedom!<br/><br/><br/><br/><br/>Yabbies are pacifist, and also too cute to fight, but you have to save your friends! Escape from the xoEl prison solving tons of puzzles, colours and guards and reach the lowest level! First, escape from that damn cube, then we will think in how to save your race.<br/><br/><br/><br/><br/>You, unlike the other yabbies, have been blessed with the amazing power of moving your cube! But a great power comes with a great responsibility. Move around the prison and escape from the xoEl empire in order to save all the galaxy from the square supremacy.<br/><br/><br/><br/>The xoEl empire is evil, cruel, despicable… and squared.<br/>They only want one thing: the supremacy of the square all over the galaxy. They abduct and transform into squares all the species of the galaxy, and no one can’t stop them… <br/><br/><br/><br/><br/>Roll, match colours, rotate the screen and more! In xoEl, you have to escape by rotating your cube and always going down! There are 400 puzzles to solve! But be careful, the xoEl army will try to defeat you at any price...<br/><br/><br/><br/><ul><li>Simple to play, but addictive and challenging.<br/></li><li>Tons of puzzle to solve, like 400 puzzles!<br/></li><li>Try to get all the achievements without looking for a guide!<br/></li><li>Control a Yabbie, one of the cutest races in the entire galaxy.<br/></li><li>Beat your friends and try to be the nº1 in every level!<br/></li><li>Face the xoEl empire, who wants the supremacy of the square.<br/></li><li>Modeled in Blender and developed in Unity.<br/></li><li>Fall, rotate and match colours in order to escape from prison!</li></ul>", "metacritic": null, "released": "2017-06-05", "tba": false, "updated": "2019-08-28T22:07:09", "background_image": "https://media.rawg.io/media/screenshots/d11/d111bfc86e14e59a87c3befd66e666cc.jpg", "website": "http://xoel.greyman.es", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 8}, "playtime": 5, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 136, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux", "macOS"], "developers": ["Greyman Studios"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Greyman Studios"], "esrb_rating": "Everyone"}