{"id": 232240, "slug": "jungle-free-run-game", "name": "Jungle Free Run Game", "name_original": "Jungle Free Run Game", "description": "This is most interesting monkey game with full of jungle monkey adventures. You are running your jungle monkey in jungle and you have to keep it safe from dangerous things and keep running. In this adventure game, let your monkey run to collect different item on the way to keep it more powerful and strong. Your monkey jumps on one side to other side with your one tap. Challenge your friends for jungle free run in this monkey game for highest scores. Once game start you have to keep your jungle monkey from unexpected difficulties.<br/> <br/>Awesome Features:<br/>•\tAddictive game sounds<br/>•\tEndless thematic world<br/>•\tEasy to play, hard to master<br/>•\tOne tap, Endless game<br/>•\tInteresting game play<br/><br/>Let be your monkey the first jungle runner by passing all hurdles and wild animals like wolves, lions, gorillas, wasps and lot more on your way out in jungle. This jungle run game is easy to play but hard to master. <br/>How to play:<br/>Very easy to play this jungle game, tilt your smart phone, be careful and swipe whenever you see wild life coming in your way. Monkey speed will be increasing by time.<br/>Run Game Modes:<br/>•\tEasy, Hard<br/>•\tEndless run<br/>•\tWildlife obstacles<br/>This endless run game is an exciting fun game, where you would let your monkey run endlessly. Jungle free run is not that easy because of wild life obstacles on your way. Avoid those obstacles and get maximum point.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:35:25", "background_image": "https://media.rawg.io/media/screenshots/fc4/fc4ff2467decea97bfc02ba5073b5426.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 112, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["spiritapps"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}