{"id": 232349, "slug": "wolf-evolution-merge-and-create-mutant-wild-dogs", "name": "Wolf Evolution - Merge and Create Mutant Wild Dogs", "name_original": "Wolf Evolution - Merge and Create Mutant Wild Dogs", "description": "A truth: wolves come in all flavors. And they’re all noisy as howl.<br/><br/>Combine different mutant wolf types to discover a barking gigantic variety of new wild dog species.<br/><br/>Some like to turn into men by daytime, some like wearing clothes from their sheep prey, I mean, friends, and some are even among us as we speak!<br/><br/>Gotta fetch them all!<br/><br/>WOLVEN FEATURES<br/><br/>🐺Pantheon: a new place for supreme beings to look down on us mortals and laugh at our misery<br/>🐺Impostors: watch out for impostors trying to steal the spotlight from the wolves.<br/><br/>HOW TO PLAY<br/><br/>🐺Drag and drop similar wolves to create new mysterious creatures<br/>🐺Use wolf eggs (problem?) to earn coins, buy new creatures and make even more money<br/>🐺Alternatively, fiercely tap a wolf to make coins pop from their eggs (yes, eggs, you read right. Geez…)<br/><br/>HIGHLIGHTS<br/><br/>🐺Different stages and many wolf species to discover<br/>🐺A mind-blowing story with howling twists!<br/>🐺The unexpected mix of creature evolution dynamics and incremental clicker games<br/>🐺Doodle-like illustrations<br/>🐺Open-ended gameplay: enjoy the freedom!<br/>🐺No wolves were harmed in the making of this game, only developers<br/><br/>Why are there lunar eclipses sometimes? <br/><br/>Well, after stuffing the universe with mutant wolves, the answer is howling obvious, ain’t it?<br/><br/>Please note! This game is free to play, but it contains items that can be purchased for real money. Some features and extras mentioned in the description may also have to be purchased for real money.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:34:53", "background_image": "https://media.rawg.io/media/screenshots/4c5/4c594022b1fd8d381637058cf9aa4971.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 99, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Tapps Games"], "genres": ["Casual"], "publishers": [], "esrb_rating": null}