{"id": 232353, "slug": "so-social-2-social-media-celebrity", "name": "So Social 2 - Social Media Celebrity", "name_original": "So Social 2 - Social Media Celebrity", "description": "It’s time to rule the internet all over again! The most popular social networks are just waiting for your viral comeback, so rock your shiniest look du jour and get trending now!<br/><br/>CUSTOMIZE YOUR LOOK with new and fabulous options that will turn your every selfie into magnets for likes!<br/><br/>TAKE OVER FRIENDBOOK, CHIPER AND LATEGRAM, the trendiest corners of the web, and get every follower there is to get as you rise to web-celebrity levels of popularity!<br/><br/>SPREAD YOUR INFLUENCE by commenting on hot topics and getting seen and talked about! Become the most shared hashtag and grow into a meme more viral than any kitty video or celebrity scandal!<br/><br/>INTERACT WITH YOUR FANDOM and block the jealous haters that every famous internet personality has to deal with. Don’t let anyone try to take the web spotlight away from you!<br/><br/>It takes work to be a social media star. Going to glamorous parties every week, dealing with crowds of fans screaming your name, googling motivational quotes to go with your gorgeous selfies...such an exhausting life, and yet, everybody wants to be you! <br/><br/>Start playing now and keep giving them someone to look up to!<br/><br/>Please note! This game is free to play, but it contains items that can be purchased for real money. Some features and extras mentioned in the description may also have to be purchased for real money.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:34:51", "background_image": "https://media.rawg.io/media/screenshots/678/67815366971062d1d53bec298c6fcb48.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 156, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Tapps Games"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}