{"id": 232309, "slug": "we-are-illuminati-conspiracy-simulator-clicker", "name": "We Are Illuminati - Conspiracy Simulator Clicker", "name_original": "We Are Illuminati - Conspiracy Simulator Clicker", "description": "What do pop idols, world leaders and scaly-skinned aliens have in common besides money, power and cleverly disguised spaceships? <br/><br/>They are all Illuminati!<br/><br/>Join their ranks and influence as many people as you can through any means necessary! Mind control, fake news, hidden messages in music videos, weird chemicals on water supplies: there’s a surprisingly wide array of paths for world domination. <br/><br/>Just pick your favorite!<br/><br/>HIGHLIGHTS<br/><br/>👁️PRACTICE the world-dominating skills you know you always wanted to practice by influencing people and turning them into happily subservient lambs!<br/><br/>👁️OCCUPY the minds of human lambs all over the globe by clicking your master plan into motion and idly waiting for the results like a true secret society chairman.<br/><br/>👁️WORK hard to dominate everything and everyone! Why stop at deep web-level influence when you can go mainstream?<br/><br/>👁️EAVESDROP on secret conversations by placing wires on the offices of powerful world leaders and use fake news to manipulate their shady plans to suit your shady plans!<br/><br/>👁️RELISH beholding everything your influence can get you as you bring about your own new world order!<br/><br/>Prove conspiracy theorists right and give them lots more to theorize about. <br/><br/>Make deals with the reptilian aliens that control world affairs from the shadows, recruit pop idols and Hollywood stars through your not-in-the-least suspicious cult and slowly climb your way to Illuminati big boss status!<br/><br/>Spread some fake news, put on your tin foil hat just in case and join the Illuminati now!<br/><br/>P.S.: there’s absolutely no hidden messages in this text, stop looking! 👁️<br/><br/>Please note! This game is free to play, but it contains items that can be purchased for real money. Some features and extras mentioned in the description may also have to be purchased for real money.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:35:10", "background_image": "https://media.rawg.io/media/screenshots/7d8/7d83f30eb324e372a7e9e7d0cac598a7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 206, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Tapps Games"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}