{"id": 232319, "slug": "my-grumpy-the-worlds-moodiest-virtual-pet", "name": "My Grumpy - The World's Moodiest Virtual Pet!", "name_original": "My Grumpy - The World's Moodiest Virtual Pet!", "description": "You might have pulled all kinds of pranks on Mr. Grumpy, but now you can have him as a pet!<br/><br/>Adopt mr. Grumpy as your cute virtual pet and keep annoying him whenever you feel like it! Give him a happy family, keep him clean and well fed and maybe he’ll even grow to hate you a little less!<br/><br/>Hum...no, he won’t.<br/><br/>GRUMPY HIGHLIGHTS<br/><br/>🐻TAKE CARE of mr. Grumpy as your own cute and moody virtual pet. Shower, feed, pet and be the family he never ever wished for!<br/><br/>🐻DISCOVER new pranks and tricks to pull on your cranky pet and have fun with his funny (over) reactions!<br/><br/>🐻CUSTOMIZE mr. Grumpy with funny hats, ties, glasses and clothes! He absolutely loves to be dressed in cute little outfits, he just has a very different way of showing it!<br/><br/>🐻DECORATE your pet marmot’s home and make yourself comfortable: having people breach his personal space is one of mr. Grumpy favorite things in life!<br/><br/><br/>Spend quality time with mr.Grumpy and make him feel loved and cared for like the little kid marmot he is deep down. Making him feel good might be harder than winning the lottery, we know, but cranky might just be the new happy!<br/><br/>How to take care of a virtual marmot? Feed him overly spicy food without warning him first, wake him up with a good old scare and pull cartoon-worthy pranks on him all day! It’s simple!<br/><br/>Adopt mr.Grumpy now! <br/><br/>He simply can’t wait!<br/><br/>Please note! This game is free to play, but it contains items that can be purchased for real money. Some features and extras mentioned in the description may also have to be purchased for real money.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:35:03", "background_image": "https://media.rawg.io/media/screenshots/537/53767ff044b35011a5a85a38b40d7f00.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 114, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Tapps Games"], "genres": ["Casual"], "publishers": [], "esrb_rating": null}