{"id": 232300, "slug": "my-virtual-pet-shop-cute-animal-care-game", "name": "My Virtual Pet Shop - Cute Animal Care Game", "name_original": "My Virtual Pet Shop - Cute Animal Care Game", "description": "Welcome to your new Pet Shop simulator! Build your own pet store and take care of cute animals as clients check in to your place, in this pet shop game for kids of all ages! Play with, care for, feed, wash, groom and dress up little cats and dogs to maximize happiness and grow your animal care business! My Virtual Pet Shop is amazing fun, play now!<br/><br/>Take good care of the virtual pets to advance levels and earn coins by the end of day. Unlock new animal items and use coins to improve your shop and customize all the items of your pet store to give it the look of your dreams!<br/><br/>MINI GAMES<br/>Exciting mini games will add even more fun to your days in this virtual pet shop simulator story!<br/>★ Wash the Pet - Grab the sponge and some animal shampoo to clean the dirty pets<br/>★ Dress Up! - Put on cute animal items to give pets a special look in your shop<br/>★ Tap the Fleas - Pick off all these tiny nasty bugs from the pets<br/><br/>HIGHLIGHTS<br/>★ Four different activities: pet grooming, pet doctor, pet bath, pet dressing<br/>★ Simple simulator gameplay for pet lovers of all ages<br/>★ Upgradeable items: improve your shop to grow your business and write your success story!<br/>★ Cute virtual kittens and puppies of all breeds<br/>★ Fast-paced fun with challenging animal mini games<br/>★ Beautiful illustrations and animations<br/><br/>If you love animals and store simulator games, you’ll love My Virtual Pet Shop!<br/>Download now and start having fun with your own story filled with cute little pets -- and Doge too!<br/><br/>Please note! This game is free to play, but it contains items that can be purchased for real money. Some features and extras mentioned in the description may also have to be purchased for real money.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:35:13", "background_image": "https://media.rawg.io/media/screenshots/b6e/b6e147df101e1d726a648b74fc1af69f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 101, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Tapps Games"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}