{"id": 232324, "slug": "logic-pic-picture-cross-nonogram-puzzle", "name": "Logic Pic ✏️ - Picture Cross & Nonogram Puzzle", "name_original": "Logic Pic ✏️ - Picture Cross & Nonogram Puzzle", "description": "Solve endless logic puzzles and get a bit smarter every day while having fun!<br/><br/>Sharpen your mind anywhere, anytime with easy to learn, hard to master nonogram logic puzzles (a.k.a. Picross, Griddler, Picture Cross), all while discovering awesome pixel art illustrations!<br/><br/>Challenge your brain with increasingly complex nonograms and feel smarter with every new logic puzzle solved!<br/><br/>Have your wits always one step ahead!<br/><br/>HOW TO PLAY<br/><br/>If you’re already familiar with grid puzzles and puzzle games, you’ll quickly get the hang of nonograms.<br/><br/>You only need to follow two steps to get started:<br/><br/>1-Look at the numbers at the ends the rows and columns;<br/>2-Use logic to fill the blocks and discover the hidden picture!<br/><br/>Our quick in-game tutorial will have you solving picture cross puzzles like a genius of puzzle games in no time!<br/><br/>FEATURES<br/><br/>💡SOLVE countless brain-teasing, easy-to-expert nonogram puzzles!<br/><br/>💡BEAT a challenge every day with the daily puzzles feature!<br/><br/>💡USE logic to color the blocks on the grids and reveal the pictures hidden underneath them. The simple and fun picross and nonogram gameplay you know and love! <br/><br/>💡ENJOY hours upon hours of picross picture logic puzzles with varying difficulty: lots of fun for all ages and skill levels!<br/><br/>💡NO WI-FI NEEDED: play the game offline at any time!<br/><br/>💡DISCOVER beautiful pixel art pictures from different thematic sets in the biggest selection of picture cross puzzle categories yet! Puzzle Packs include famous landmarks, animals, everyday objects and movies<br/><br/>💡SHOW OFF how smart you are by solving nonograms and daily puzzles with record speed in front of your friends or that special someone you wish to impress!<br/><br/>💡AUTO-SAVE feature lets you resume your picross puzzle solving from where you left!<br/><br/><br/>You might not know nonogram, griddlers or picross logic puzzles yet, but if you like similar brainteasers like crosswords and jigsaw puzzle games, you’ll love our logic challenges and daily puzzles!<br/><br/>Complete fun thematic puzzle sets and power-up your problem solving skills without even noticing it! <br/><br/>Enjoy an ever growing collection of thematic level packs and daily puzzles and different modes to cater for every taste! From easy warm-up puzzles to daunting mind benders, carry a wide selection of fun nonogram logic challenges with you to play anywhere!<br/><br/>Try to beat every single puzzle available and discover all the cool pixel-art images hiding beneath the nonogram boards! The bigger your pic collection is, the smarter your brain becomes!<br/><br/>Each solution you come up with for these deceptively simple number-based riddles counts as a complete mental workout!<br/><br/>Download now and start boosting the power of your brain with this genius among puzzle games!", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:35:02", "background_image": "https://media.rawg.io/media/screenshots/8d7/8d7fd8f64822eae324dc06ca64daf542.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 163, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Tapps Games"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}