{"id": 232347, "slug": "unicorn-evolution-fairy-tale-horse-game", "name": "Unicorn Evolution - Fairy Tale Horse Game", "name_original": "Unicorn Evolution - Fairy Tale Horse Game", "description": "The Evolution series just got a fabulous touch! Claimed by our beloved players, unicorns are here to stay... and to mutate... a lot! If having a giant horn in the middle of the head wasn’t already enough, the most majestic of all creatures are about to get the Evolution treatment we all know and love. Check it out!<br/><br/>How to play? Easy! Combine unicorns to evolve them and discover their most curious, exotic and bizarre forms!<br/><br/>FEATURES<br/>🦄 Pantheon: a new place for supreme beings to look down on us mortals and laugh at our misery<br/>🦄 Impostors: watch out for impostors trying to steal the unicorns’ spotlight<br/><br/>HOW TO PLAY<br/>🦄 Drag and drop similar unicorns to create new mysterious creatures<br/>🦄 Use unicorn eggs to buy new creatures and make even more money<br/>🦄 Alternatively, fiercely tap a unicorn to make eggs pop<br/><br/>HIGHLIGHTS<br/>🦄 Different stages and many unicorn species to discover<br/>🦄 A mind-blowing story yet untold<br/>🦄 The unexpected mix of creature evolution dynamics and incremental clicker games<br/>🦄 Doodle-like illustrations<br/>🦄 Various possible endings: find your destiny<br/>🦄 No unicorns were harmed in the making of this game, only developers<br/><br/>Come to the mythical side of the Evolution series games! Unicorns await!<br/><br/>Evolution NEVER ends. Check out some of the other games in the series:<br/> <br/>Fox Evolution - http://bit.ly/FoxEvo - Find out what the fox says at last!<br/>Rabbit Evolution - http://bit.ly/RabbitEvo - Rabbits can surprise you!<br/><br/><br/>Please note! This game is free to play, but it contains items that can be purchased for real money. Some features and extras mentioned in the description may also have to be purchased for real money.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:34:54", "background_image": "https://media.rawg.io/media/screenshots/766/766754f3df6bc22692ba699138f90fd4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 123, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Tapps Games"], "genres": ["Casual"], "publishers": [], "esrb_rating": null}