{"id": 232359, "slug": "zombie-evolution-halloween-zombie-making-game", "name": "Zombie Evolution - Halloween Zombie Making Game", "name_original": "Zombie Evolution - Halloween Zombie Making Game", "description": "🎃What better time to unleash a zombie apocalypse than on Halloween?🎃<br/><br/>Graft and stitch together different mutant zombies and create an undead horde to call yours! <br/><br/>Each and every one of them will be a unique shambling corpse with hopes and dreams and a healthy appetite for human brains!<br/><br/>And they’re very low-maintenance, too, what with their favorite dish being so abundant and all.<br/><br/>It’s every necromancer’s dream!<br/><br/>UNDEAD FEATURES<br/><br/>• Pantheon: a new place for supreme beings to look down on us mortals and laugh at our misery<br/>• Impostors: watch out for impostors trying to steal the spotlight from the zombies<br/><br/>HOW TO PLAY<br/>• Drag and drop similar zombies to create new mysterious creatures<br/>• Use zombie eggs to earn coins, buy new creatures and make even more money<br/>• Alternatively, fiercely tap a zombie to make coins pop from their eggs<br/><br/>HIGHLIGHTS<br/>• Different stages and many zombie species to discover<br/>• A mind-blowing story with brain melting twists!<br/>• The unexpected mix of creature evolution dynamics and incremental clicker games<br/>• Doodle-like illustrations<br/>• Various possible endings: find your destiny<br/>• No zombies were harmed in the making of this game, only developers<br/><br/>Now THIS is bio hazard!<br/><br/>Please note! This game is free to play, but it contains items that can be purchased for real money. Some features and extras mentioned in the description may also have to be purchased for real money.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:34:48", "background_image": "https://media.rawg.io/media/screenshots/ade/ade8d97c202b1d79ccaa8b15e653e62d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 77, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Tapps Games"], "genres": ["Casual"], "publishers": [], "esrb_rating": null}