{"id": 232313, "slug": "my-boo-your-virtual-pet-game", "name": "My Boo - Your Virtual Pet Game", "name_original": "My Boo - Your Virtual Pet Game", "description": "Meet Boo, your very own virtual pet! Enjoy countless hours of fun in this addictive and entertaining game brought to you by Tapps Games!<br/><br/>Each Boo is like a real pet that needs lots of attention, and your task is to take care of it in the best way possible. Feed it, wash it, take care of its health, put it to sleep and play with your Boo - while you have lots of fun with over 20 thrilling mini games that will surely keep you entertained and your Boo happy as a puppy! <br/><br/>If your Boo is hungry, you can find an array of delicious and nutritious food in the pantry: from yummy tacos to some tender barbecue ribs, or even a portion of octopus sashimi if you’re in the mood for a more exotic food! Your sweet tooth will be satisfied with mouthwatering candies, such as pumpkin pies, milk shakes and colorful lollipops!<br/><br/>You can also dress up your boo any way you like! Go to his closet and style it like your favourite movie or book character! Choose its hair and accessorize, from top hats to a regal crown, or even a leprechaun hat! Choose your attire! From formal to fun - and every style in between! You can buy new accessories to customize your Boo as you level up!  <br/><br/>Your boo will get dirty from time to time, and like any other pet, a bath is necessary! Taking care of your pet also entails giving it some medication whenever needed, and you can play with magic potions and energy drinks! You can also decorate its house with fun posters and decorative rugs - not to mention redo the walls with beautiful wallpaper and some fancy flooring! You’ll LOVE this BOOtiful game so much, you won’t be able to leave it alone!<br/><br/>HIGHLIGHTS<br/>• ADOPT your Boo, give it a special name and watch it grow up! It’s so cute!<br/>• DRESS it up with countless outfits to give your Boo the best look! Just they way you want!<br/>• FEED Boo with candy, cookies, fruits, pizza or even sushi for a treat! Yummy!<br/>• TICKLE, play keepie uppie, trampoline or jump rope with your Boo to keep it happy and smiling!<br/>• TUCK your Boo in when the day is over and Boo is tired!<br/>• BATHE your Boo to keep it clean and happy!<br/>• DECORATE every room of your Boo's house with dozens of awesome items!<br/><br/>And a lot more! There’s always so much to do in My Boo!<br/>You will never get tired of your cute little pet monster!<br/><br/>MINI GAMES<br/>Have fun with exciting mini games and earn coins to buy items and food for your Boo!<br/><br/>• Boo Mix - Match Boos<br/>• Piano Boo - Tap the Boos and avoid the white tiles<br/>• Basket Boo - How many points can you score in this basketball game?<br/>• Matching - A match-3 style game to combine Boos<br/>• Bubble Pop - Launch and combine Boos of the same color<br/><br/>And many more!<br/><br/>Please note! This game is free to play, but it contains items that can be purchased for real money. Some features and extras mentioned in the description may also have to be purchased for real money.", "metacritic": null, "released": null, "tba": false, "updated": "2022-12-27T13:19:23", "background_image": "https://media.rawg.io/media/screenshots/999/99932294348a6eb64c81a9061dcfdcd1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "dropped": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 97, "game_series_count": 0, "reviews_count": 2, "platforms": ["Android"], "developers": ["Tapps Games"], "genres": ["Casual"], "publishers": [], "esrb_rating": null}