{"id": 232335, "slug": "into-the-deep-web-internet-mystery-idle-clicker", "name": "Into the Deep Web - Internet Mystery Idle Clicker", "name_original": "Into the Deep Web - Internet Mystery Idle Clicker", "description": "So you think you know the internet?<br/><br/>Dive into the dark depths of the deep web and discover you knew nothing! Explore the creepy mysteries lurking in the hidden expanses of the world wide web!<br/><br/>Anonymous hacker forums, pictures of weirdly slender men, illuminati secrets, alien tycoons, secret agent idle banter, information that could ruin empires and inc. companies and even the unimaginable, unthinkable, unspeakable…<br/><br/>...onion soup recipe.<br/><br/>HIGHLIGHTS<br/><br/>🌐DIVE into the deep web and explore the depths of the internet! Tap into mysteries that were never meant to be tapped, discover all sorts of creepy websites and, of course, very, very scary cat videos!<br/><br/>🌐EXPLORE the secret-filled depths of the web and go as far away from the surface, “inc.” web as you dare! The more levels of the deep web you access, the creepier your discoveries will be!<br/><br/>🌐GATHER more and more resources with classic idle clicker gameplay and fuel your curiosity to go deeper and deeper into the mysteries of the dark web!<br/><br/>🌐RECRUIT managers to help you earn more resources that will help you get to the bottom of the internet’s deepest oceans...if there is a bottom.<br/><br/>🌐GET TO KNOW the true internet in a deep journey of discovery.<br/><br/>You’ll never surf the web the same way again after taking the plunge into the dark side of the internet. The secrets you’ll find will shock you and change your perspective about life, humanity and the origins of viral memes…<br/><br/>No matter how much this journey rattles your soul, you’ll want to keep going deeper and deeper until you solve the ultimate deep web mystery: was there life before the internet?<br/><br/>Download now and start exploring the deep web, no Tor needed!<br/><br/>Disclaimer: While this App is completely free to play, some additional content can be purchased for real money in-game. If you do not want to use this feature, please turn off in-app purchases in your device's settings.<br/><br/>Like our page on Facebook and be the first to know about our upcoming games and updates! http://fb.com/tappshq", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:34:58", "background_image": "https://media.rawg.io/media/screenshots/1ca/1caf92b01aa0eee2ee020948526172bf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 257, "game_series_count": 0, "reviews_count": 1, "platforms": ["Android"], "developers": ["Tapps Games"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}