{"id": 232333, "slug": "money-tree-grow-your-own-cash-tree-for-free", "name": "Money Tree - Grow Your Own Cash Tree for Free!", "name_original": "Money Tree - Grow Your Own Cash Tree for Free!", "description": "Take care of your own MONEY TREE from budding plant to full crown glory, clicking vigorously like a true capitalist to cultivate the wealthiest piece of timber the world has ever seen! I mean, if you really must plant a tree before kicking the bucket, let it be one that grows beautiful green bills instead of leaves! <br/> <br/>Because who cares about oxygen, right?<br/> <br/>HIGHLIGHTS<br/> <br/>💸 CULTIVATE a mythical tree that never runs out of money, shake it to make it rain fresh green bills and become a true TREEllionaire!<br/> <br/>💸 HIRE gardeners, kids, llamas and the president himself to help you grow your living legacy!<br/> <br/>💸 BUY new equipment, fertilizers and power-ups to give nature an expensive hand and make your money maker grow faster. Hoses, sprinklers, lucky charms, alien generators: if they take cash, it’s yours!<br/> <br/>💸 PROFIT endlessly from your very own freak of nature and reach unfathomable levels of wealth. What comes after bazzilionaire?<br/> <br/>The elusive tree of many a chinese myth can now be yours forever, and there’s no limit for the amount of riches it can shower you with! You’ll never have to work again, nor will your family, or your dog, or your dog’s family!<br/> <br/>Forget Cashew. Think CASH!<br/><br/><br/>You might also like some of our other clickers:<br/><br/>So social - http://bit.ly/SoSocial - Take over the internet!<br/>League of Gamers - http://bit.ly/LeagueofGamers - Become an e-sports legend!<br/><br/><br/>Please note! This game is free to play, but it contains items that can be purchased for real money. Some features and extras mentioned in the description may also have to be purchased for real money.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:34:59", "background_image": "https://media.rawg.io/media/screenshots/229/229ecb8772397d346c8d0e4b81506f87.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 198, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Tapps Games"], "genres": ["Casual"], "publishers": [], "esrb_rating": null}