{"id": 23242, "slug": "1914-prelude-to-chaos", "name": "1914: Prelude to Chaos", "name_original": "1914: Prelude to Chaos", "description": "STORY<br/><br/>Enter the year 1914, which will mark the beginning of the first man made catastrophe of the 20th century. From the smoking revolver of the Serbian nationalist and grab for glory of a dying empires, that were slowly losing their legitimacy, death, despair and chaos that has finally put an end to the ancient European monarchies was born.<br/><br/>The player is put in a role of Finley Thompson, British adventurer and archaeologist searching for the mythical artifact from the First Crusade on the territory of Kingdom of Serbia. In this endeavor, his closest ally is his Serbian guide Vuk. Not long after locating the possible site all hell breaks loose when the Sarajevo assassination occurs. Cut from his home, Finley pleads Vuk to help him finish his mission. With heavy heart he agrees and they embark on a journey to find the artifact which according to legend makes any army who carries it invincible. They are also forced to seek unlikely ally in a German storm trooper transporting POW-s to defend the artifact and their own lives against the dangerous secret society searching for the artifact.GAMEPLAY<br/>The player will control Finley and his companions in their quest to find the lost artifact and preserve their lives in the midst of largest confrontation the world has seen. To solve the mystery of the First Crusade player will have to control his party in a series of conflicts while they search for the artifact.  Battles are turn based, with a moment of exploration in between each battle. During the exploration the player will have the option to talk with various NPC-s and upgrade their characters. During that, mystery will unravel and masks will fall. <br/>Will you have what it takes to stop an supposed object of unlimited power fall in the wrong hands?GAMEPLAY<br/>Embark on an epic adventure to save the lands. Form a party by selecting 4 different adventurers from a pool of over 12 unique classes. Battle your way through the cursed lands scaling the highest mountains and exploring the darkest dungeons. Face more than 30 unique challenging bosses in order to reach the capital of the kingdom. Trade and interact with other travelers, influence their fate and discover many secrets on your dark adventure.AMATERASU SOFTWARE<br/>We are a team of four video game enthusiasts with a childhood dream of making our own video games. Every member of our team is a fan of old school JRPG genre. We have already released a few games on Steam and our wish is to make our player base as happy as possible. Every player is more then welcome to give their feedback and criticism, without it, we will improve at a slower rate.", "metacritic": null, "released": "2017-05-08", "tba": false, "updated": "2019-09-17T14:00:31", "background_image": "https://media.rawg.io/media/screenshots/922/9226cee5f4e44352a29c0cfb3537f54b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 4, "owned": 119, "beaten": 1}, "playtime": 4, "achievements_count": 0, "ratings_count": 3, "suggestions_count": 218, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC"], "developers": ["Amaterasu Software"], "genres": ["RPG"], "publishers": ["Amaterasu Software"], "esrb_rating": "Everyone"}