{"id": 232448, "slug": "mad-town-miami-sandboxed-style-open-world-2018", "name": "Mad Town Miami Sandboxed Style Open World 2018", "name_original": "Mad Town Miami Sandboxed Style Open World 2018", "description": "Mad Town Miami Sandboxed Style Open World 2018 - open the game club a real online city full without tower races, chases, scuffles with cops and much more all in a free action without the internet in your hands!<br/>Build your Miami gangster get all the money in the world by simply performing story missions, chasing on high-speed cars, drag and drift - everything is possible on your city streets. If you are interested in cars without brakes, the game is specially for your attention.<br/>Enjoy games with the open world without fees, our games without the internet on Android allow you to have fun far out of town (where poor communication coverage). Shooters from 3 persons without the Internet will allow you to earn money quickly in the game, to buy a ready business, purchase the fastest cars or strong weapons of your hero and his people. Shooting and racing is the best combination to leave a couple of hundred cartridges on the asphalt and constantly burn your car tires at high speeds.<br/><br/>Feature of the game:<br/>- 100% sandbox without borders;<br/>- Saturated with extreme trials in the story missions;<br/>- A combination of legendary game genres FPS-action, shooters, racing;<br/>- A large city with an open world;<br/>- Drive motorcycles, cool cars, large trucks;<br/>- The city has the opportunity to skimp in weapons stores.<br/><br/>Create your own unique story of climbing and becoming a steep gangster in Miami. Think of new schemes for your dark deeds bypassing local cops, be prepared for constant chases and shoot-outs with them. You are on special control before the feds, they know about your intentions to crush the whole city for yourself!", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:34:38", "background_image": "https://media.rawg.io/media/screenshots/306/3066b60069fc154de86e398266ef5933.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 147, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Wild West Games"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}