{"id": 232426, "slug": "car-driving-simulator-2018-ultimate-drift", "name": "Car Driving Simulator 2018: Ultimate Drift", "name_original": "Car Driving Simulator 2018: Ultimate Drift", "description": "Car Driving Simulator 2018 is the latest game from Mobimi Games that offers 45 UNLOCKED cars available to drive, drift or race 8 different locations: 3 open world cities, docks area, highway or desert. This is the best car driving simulator 2018 game with realistic physics engine.<br/><br/>Try different driving modes, for each of the cars, such as simulator, racing, arcade, drift or fun drive mode.You can turn on or off the ABS (Anti-lock Braking System), ESP (Electronic Stability Program), TCS (Traction Control System) and SH (Steering Helper).<br/><br/>You can also adjust the Maximum Torque, Maximum Speed and Maximum Brake force of each super fast car!<br/><br/>Choose the traction type that you like: front wheel drive (FWD), rear wheel drive (RWD) or all-wheel-drive (AWD) and take the cars off-road for an excitement ride. Off-road cars and pickups for driving on hills and to simulate 4x4 traction are available. You can even drive/drift with a 6 wheeler truck!<br/><br/>Open the doors, hood and truck on some of the cars an change their appearance by applying new skins in the garage.<br/><br/>For all car games fans, now you can drive in the city by day or by night. Even in 2019 you can drive amazing fast cars in 8 different locations! Show off you driving skills in one of the best free car games from the store!<br/><br/><br/>Car Driving Simulator 2018 Top Features<br/>- 45 amazing cars to drive<br/>- Real physics engine game<br/>- Control your car with a steering wheel, accelerometer or arrows<br/>- Controllable car behavior: simulator, racing, arcade, drift, fun and custom.<br/>- Full HD graphics<br/>- Real HUD Camera<br/>- 5 Camera angle views<br/>- Car damage<br/>- Open World Environment<br/>- Day Night environment<br/>- offline game<br/>- free game without wifi", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-30T19:59:43", "background_image": "https://media.rawg.io/media/screenshots/ffe/ffe0c997a11a4aeb6345d6522990bf93.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 220, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Mobimi Games"], "genres": ["Racing"], "publishers": [], "esrb_rating": "Everyone"}