{"id": 232446, "slug": "old-west-sandboxed-western", "name": "Old West (Sandboxed Western)", "name_original": "Old West (Sandboxed Western)", "description": "The main hero, the former sheriff, received a letter from an old friend. The letter referred to a great reward for catching dangerous criminals who committed many bad deeds, after which only one way - a gallows.<br/>You accepted the invitation, packed your things and boarded the train, which led you to the vast wild expanses full of dangers. The local sheriff equip you with a horse, issued a task, weapons and a pleasant advance for the first time.<br/>You need to get rid of the local gangs, defeat the dangerous bandits of the Wild West in a duel, make friends with the indigenous settlements and put things in order in the city.<br/>Saddle your horse and forward to the adventure!<br/><br/>Features:<br/>- Photorealistic HD graphics conveying the atmosphere of a classic western<br/>- Excellent optimization for devices of any level<br/>- RPG in a large open world! Absolute sandbox!<br/>- Large and exciting missions with unforgettable pesonazhami, as well as interesting secondary missions with the delivery of cargo on the chariot on the vast expanses with the dangers of the mission with the search for bandits, dangerous dueling and much more!<br/>- A living world that is full of different livestock, including unpredictable wild animals, some of which are gathered in a flock<br/>- User-friendly interface and management! Nothing extra!<br/>- The game includes step-by-step training. You and him you definitely will not get lost in the mechanics of the game<br/>- Snuggling minigames in saloons that will allow you to distract and pass the time<br/>- The well-known mine for the whole district, in which you can enrich yourself, but remember that you are not the only ones who want to profit there<br/>- Dialogues and cut scenes from which it is impossible to come off<br/>- Advanced artificial intelligence<br/>- Your faithful horse that will come to you, only whistle!<br/>- Great shooter! A variety of weapons: revolvers, wild west and ammunition for each of them, as well as dynamites and other useful items that will help you travel<br/>- Dress your character in the store to your taste!<br/>- Dynamic jumps, shooting at targets, battles and skirmishes, atmospheric music! All this will swallow you into the atmosphere of the Wild West with your head!<br/>- If you are far from the Internet, you can play offline, without the Internet and wifi.<br/>- Excellent game, which you can download for free", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:34:38", "background_image": "https://media.rawg.io/media/screenshots/6a4/6a4f2d327daa1e6fc3c89e139813baf0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 100, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Wild West Games"], "genres": ["Action"], "publishers": [], "esrb_rating": null}