{"id": 232573, "slug": "living-legends-wrath-of-the-beast-ce-full", "name": "Living Legends: Wrath of the Beast CE (Full)", "name_original": "Living Legends: Wrath of the Beast CE (Full)", "description": "Unlock the complete adventure with a single purchase! No in-app purchases!<br/><br/>Bear attacks have increased since Goldilocks, the hero of Fortress, passed away three years ago. As her only son, you’ve taken on her legacy to protect the village and keep its people safe.<br/><br/>• BEARS ARE ATTACKING YOUR VILLAGE!<br/>What’s causing the bears to suddenly attack? Your mother’s diary may hold the answer but will you survive long enough to read her final chapter?<br/><br/>• AN ENCHANTING TWIST ON A FAMILIAR LEGEND<br/>Explore mountainous forests, snowy cliffs, and remote castles to uncover the truth behind the history of the village and unlock the secret of the magical bears who roam deep in the forest.<br/><br/>• FEEL THE FURY OF THE BEAST<br/>Use the skills you’ve learned at the Hunting Academy to find useful items within hidden object scenes and solve challenging puzzles and mini-games! Learn your mother’s darkest secrets—only you can stop the deadly attacks!<br/><br/>• CONTINUE THE ADVENTURE OF THE MAGICAL BEARS IN THE BONUS GAME!<br/>Pick up collectibles along the way to learn more about the Alchemist. Then, enjoy exclusive extras such as wallpapers, concept art, and even more puzzles!<br/><br/>• Find thousands of hidden objects, plus solve tons of mini games and puzzles!<br/>• Unlock this incredible Collector's Edition to gain access to all of the amazing bonuses and additional gameplay!<br/><br/>*** Discover more from Big Fish Games*** <br/><br/>Sign up for our newsletter and never miss a new release or promotion again: http://bigfi.sh/AndroidSplash<br/><br/>Check out our entire game library with our Big Fish Games app absolutely FREE here: http://bigfi.sh/BFGAMGoog<br/><br/>Visit Big Fish Games, a leading developer, producer, and publisher of puzzle, adventure, casual, card &amp; casino games!<br/><br/>VISIT US: www.bigfishgames.com<br/>WATCH US: www.youtube.com/bigfishgames<br/>FOLLOW US: www.twitter.com/bigfishgames<br/>TALK TO US: www.facebook.com/bigfishgames", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:34:13", "background_image": "https://media.rawg.io/media/screenshots/e26/e264e12d9b350d52bbe411a2e81fd1dd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 338, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Big Fish Games"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}