{"id": 23251, "slug": "mulaka", "name": "Mulaka", "name_original": "Mulaka", "description": "Action-adventure at its finest! Explore a 3D world inspired by real Sierra Tarahumara landscapes while solving puzzles, collecting magic herbs, fighting soul-eating foes, and running with the world-renowned Tarahumara prowess. The Tarahumara have been called super athletes, super humans, and even The Greatest Race the world has ever seen because of their running skills. Harness this amazing ability and engage in fast-paced gameplay!<br/><br/><br/><br/>Mulaka is being designed hand in hand with renowned anthropologists and Tarahumara leaders to capture the true essence of the culture in the game. We have unearthed old books, crumbling texts and forgotten diaries and gotten the most playable elements, as well as the coolest myths and stories and recorded authentic Tarahumara dialogue. Everything has been done so you can experience the power and adventurous history of this culture.<br/><br/><br/><br/>The gods have witnessed foulness spreading throughout their creation, corrupting men and beast alike. They now delve deep within themselves debating whether or not it's time to wipe this world clean and start over. It’s your duty to rally the demi-gods and gain their trust to save humanity! The Sukurúame is the shaman or warlock capable of interacting with the gods above, below and everywhere in between. He is also the most capable of facing mythical creatures like the gigantic Ganoko, the soul-eating Rusíwari or the fire-spitting Sipabuara. <br/><br/><br/><br/>Sukurúames are skillful at melee combat and can create special magic potions to enhance their powers and gain new abilities. Obtain new powerful transformations from the mighty demi-gods throughout your quest and become a true Sukurúame!<br/><br/><br/><br/>Mulaka features a gorgeous low-poly art style that shines with vibrant colors and breathtaking vistas that you won't believe! The low polygonal visual direction allows us to portray the vast varied landscapes of the region without sacrificing any fidelity to their real world counterparts. Not only will you look at a pretty game, but you'll feel in the Tarahumara lands. Enjoy the barren dunes of the Samalayuca desert, the unique architecture of Paquimé, the calm and romantic mood at the Lake of Arareko, the majestic nature of Basaseachi, and more!<br/><br/><br/><br/>By playing Mulaka, you're helping us contribute to the well-being of this community. We will donate up to 10% of the game earnings to NGOs that focus efforts on the Sierra Tarahumara.", "metacritic": null, "released": "2018-02-26", "tba": false, "updated": "2023-01-16T08:03:49", "background_image": "https://media.rawg.io/media/screenshots/750/750260f6e340cd50c423a48c0a3c59d4.jpg", "website": "http://www.lienzo.mx/mulaka/", "rating": 3.12, "rating_top": 3, "added_by_status": {"yet": 7, "owned": 75, "beaten": 7, "toplay": 10, "dropped": 6, "playing": 1}, "playtime": 2, "achievements_count": 58, "ratings_count": 14, "suggestions_count": 169, "game_series_count": 0, "reviews_count": 16, "platforms": ["Xbox One", "PlayStation 4", "Nintendo Switch", "PC"], "developers": ["Lienzo", "LIENZO MEXICO DESARROLLO DE VIDEOJUEGOS SA DE CV"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Lienzo"], "esrb_rating": "Everyone"}