{"id": 232561, "slug": "skiing-fred", "name": "Skiing Fred", "name_original": "Skiing Fred", "description": "Enter the perfect chaos of Skiing Fred... <br/><br/>The more dangerously you slide, the bigger the reward! Slide turbo-speed, dodge and drift through Fred's trap-ridden world as he escapes Grimmy Reaper. <br/><br/>- Free-style control system unlike any other game <br/>- Compete and help your friends! <br/>- Customize and gear up your character! <br/>- Massive Cooperative Missions <br/>- Tons of insane vehicles <br/>- Dozens of traps and enemies <br/>- The best Fred Game ever! <br/>- Keep your progress through iCloud <br/><br/>A sequel to Falling Fred and Running Fred, Skiing Fred is an over-the-top action-sports game featuring a unique free-movement system that allows you to take control of the action and perform true skill-based special moves. <br/><br/>Get daring! Get creative! Get an edge over your friends or get them to help you beat massive Challenges destroying any enemies on your way. You´ll be facing of extreme storms, apocalyptic meteor showers and blinding blizzards. <br/><br/>Whether looking to beat a friend's record, complete missions, unlock achievements o get that particular item set collection, Skiing Fred packs a full load of fun for everyone! <br/><br/>Skiing Fred is a universal app compatible with iPod (4th gen and 5th gen), iPhone (3GS, 4, 4s and 5), iPad (all generations) and iPad Mini that keeps progress across all your devices through iCloud!<br/><br/>Visit www.facebook.com/Running-Fred for get cheats, tips and cools stuff.", "metacritic": null, "released": "2013-05-26", "tba": false, "updated": "2021-07-02T04:19:08", "background_image": "https://media.rawg.io/media/screenshots/ad3/ad3562648fc4b4173ce1037b1b34de56.jpg", "website": "http://www.dedalord.com/skiingfred", "rating": 0.0, "rating_top": 0, "added_by_status": {"beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 399, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Dedalord", "Diego Ruiz"], "genres": ["Action", "Racing"], "publishers": ["Diego Ruiz"], "esrb_rating": "Teen"}