{"id": 232696, "slug": "enigmatis-3-the-shadow-of-karkhala-full", "name": "Enigmatis 3: The Shadow of Karkhala (Full)", "name_original": "Enigmatis 3: The Shadow of Karkhala (Full)", "description": "FANTASTIC HIDDEN OBJECT PUZZLE ADVENTURE GAME FROM THE CREATORS OF ENIGMATIS AND GRIM LEGENDS!<br/>Enigmatis 3: The Shadow of Karkhala is the final chapter in the blockbuster trilogy, an exciting detective story rife with adventure, puzzles, and ancient mystery. Follow the trail of a demonic preacher and unravel the secrets of Karkhala Peak!<br/>What secrets does the ancient monastery hold, high on its snow-covered mountain slope? What has brought the demonic Preacher here, and can anyone stop him now that he is more powerful than ever?<br/><br/>THE ULTIMATE HIDDEN OBJECT ADVENTURE BEGINS!<br/>The demonic preacher has escaped to the remotest mountains in pursuit of a grim secret that could give him ultimate power. He has already eluded the investigation of the protagonist detective and her partner Hamilton twice: once in Maple Creek, and again in Ravenwood. It’s no mystery that this time it’s personal.<br/><br/>43 HAND-DRAWN LOCATIONS FULL OF HIDDEN OBJECT SCENES!<br/>After returning to Maple Creek and uncovering new evidence about the preacher’s enigmatic plan, the two detectives set out in search of a centuries-old monastery hidden high in the breathtaking mountains where the immortal preacher’s lifelong quest for world domination could finally meet its sinister end.<br/><br/>EXCITING 25 MINI GAMES AND PUZZLES SET IN THE KARAKORUM MOUNTAINS!<br/>What is hiding in the ancient monastery that clings to upper reaches of the snow-covered mountain? What nightmarish secret is the preacher looking for there?<br/><br/>FANTASTIC DETECTIVE STORY RICH IN EERIE MYSTERIES!<br/>Drawn into this ancient struggle between the forces of light and darkness, the detective must defeat the ominous preacher at any cost. Will they even be able to stop him now that he’s more powerful than ever before?<br/><br/>MORE MINI GAMES AND PUZZLES IN THE BONUS ADVENTURE!<br/>Play the Blood on the Snow prequel to the main game for more storylines and even more mysteries and hidden object scenes!<br/><br/>BRING THE HIDDEN OBJECT PUZZLE ADVENTURE WITH YOU!<br/>Optimized for phones and tablets, filled with hidden objects, perfect for playing while traveling. No Wi-Fi required for this offline game!<br/><br/>SIGN UP TO OUR NEWSLETTER FOR NEW HIDDEN OBJECT GAMES EVERY MONTH!<br/>Captivating adventures, stories, tales, and eerie mysteries await in our selection of immersive hidden object games!<br/><br/>Look for “Artifex Mundi” to get more hidden object games like this!<br/><br/>• The ultimate hidden object adventure begins!<br/>• 43 hand drawn locations full of Hidden Object Scenes!<br/>• Exciting 25 mini games and puzzles set in Karakorum Mountains!<br/>• Fantastic detective story rich in eerie mysteries!<br/>• More mini games and puzzles in bonus adventure! <br/>• High-end, immersive gameplay, optimized for tablets and phones!<br/><br/> +++ WE ARE HERE +++<br/>WWW: http://artifexmundi.com<br/>FACEBOOK: http://facebook.com/artifexmundi<br/>TWITTER: http://twitter.com/ArtifexMundi<br/>FORUM: http://forum.artifexmundi.com<br/>YOUTUBE: http://youtube.com/user/ArtifexMundi<br/>PINTEREST: http://pinterest.com/artifexmundi<br/>INSTAGRAM: http://instagram.com/artifexmundi", "metacritic": null, "released": "2019-08-12", "tba": false, "updated": "2020-08-24T02:33:54", "background_image": "https://media.rawg.io/media/screenshots/a18/a182a38eda13f87aee8645ba0e5d418c.jpg", "website": "http://www.artifexmundi.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 335, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "Android"], "developers": ["Artifex Mundi"], "genres": ["Adventure", "Puzzle"], "publishers": ["Artifex Mundi"], "esrb_rating": "Teen"}