{"id": 23263, "slug": "chess-ultra", "name": "Chess Ultra", "name_original": "Chess Ultra", "description": "<p>Introducing the most breathtaking chess game ever made.<br />\nChess Ultra injects the greatest strategy game of all time with a modern twist; offering the ultimate chess experience with stunning 4K visuals, Grandmaster approved AI and full VR compatibility.<br />\nStunning chess sets and beautiful environments<br />\n10 Grandmaster-approved AI levels<br />\nIntuitive, overhauled local and online multiplayer with ELO ranking system<br />\nComprehensive time controls, including Classical, Blitz and Marathon, available online<br />\nCross-platform online play and leaderboards<br />\nSpectate and compete in Official Ripstone tournaments<br />\nDemonstrate your skills in over 80 chess puzzles<br />\nRe-write the past by winning the biggest historic matches<br />\nExport portable game notation (PGN) for every game, locally and online<br />\nFull Twitch integration invites you to play against your community<br />\nPlay in VR and immerse yourself in the Chess Ultra experience<br />\nIn-depth tutorials to help improve your game<br />\nWith full Oculus Rift and HTC Vive support, play Chess Ultra in VR for the most breathtaking chess experience to date. From the wood grains on the antique mahogany board in the library, to the luxury felt on the bottom of every chess piece; chess has never looked this good. Physically reach out to make your move and focus entirely on the game at hand.<br />\nCompatible with Oculus Rift and HTC Vive<br />\nUse Oculus Touch or Vive controllers to reach out and move the pieces<br />\nImmerse yourself in beautiful, ultra-realistic environments<br />\nChange your perspective of each environment by standing to get a better view<br />\nTake the most extreme chess challenge in Gomorrah. Will you survive?</p>", "metacritic": 81, "released": "2017-06-20", "tba": false, "updated": "2024-03-04T18:20:49", "background_image": "https://media.rawg.io/media/screenshots/413/4137847ceac2a680415f13a4526f72a6.jpg", "website": "http://playchessultra.com", "rating": 3.43, "rating_top": 3, "added_by_status": {"yet": 76, "owned": 619, "beaten": 4, "toplay": 6, "dropped": 24, "playing": 4}, "playtime": 2, "achievements_count": 169, "ratings_count": 23, "suggestions_count": 367, "game_series_count": 0, "reviews_count": 23, "platforms": ["PlayStation 4", "PC", "Xbox One", "Nintendo Switch"], "developers": ["Ripstone"], "genres": ["Strategy", "Simulation", "Sports", "Casual", "Indie"], "publishers": ["Ripstone"], "esrb_rating": "Everyone"}