{"id": 232646, "slug": "fashion-fantasy", "name": "Fashion Fantasy", "name_original": "Fashion Fantasy", "description": "Fashionistas, join us on an adventure where fashion meets fantasy. Complete tasks by mixing and matching clothing to express yourself through your sense of style, and unlock new chapters to reveal the untold story. Here every chapter is a show and this whole journey is your runway. Add a dash of fun to the journey with various activities: vote on the best looks of the styling challenges, shop amazing pieces at our Fashion Boutique, andyou can even create your own designs. <br/><br/>KICK OFF AN FASHION ADVENTURE<br/>If fashion is an adventure, you’re going to explore in style. Dress up as required to clear tasks and experience exotic cultures while traveling around the world with Lizzy.<br/><br/>COMPETE WITH YOUR FRIENDS<br/>Create looks that will take you all the way to the top of the styling challenges with tons of gorgeous outfits, accessories, chic hairstyles and makeups. Connect to Facebook and invite friends to join you. Gifting APs and competing with your friends will take the fun up to a notch. <br/><br/>COMMUNITY<br/>The official forum gives you access to a platform where you can discuss and share information with other players. Got a problem? Go to theforum for help!<br/><br/>COLLECT FABULOUS OUTFITS<br/>Check the Fashion Boutique for new arrivals or win materials by completing tasks to create your own designs. Collect fabulous outfits of various kind to fill your closet, and you can clean out the closet by swapping the excess for an amazing new one.<br/><br/>CONTACT US:<br/>Email: ff@libii.com<br/>Facebook Page: https://www.facebook.com/FashionFantasyPage/<br/><br/>Need You Know:<br/>This app is totally free to download and play, some basic items are also free to use, but some additional items need you to purchase and pay to unlock. Therefore, if you do not want to use these items, please turn off the in-app purchase in your settings. Thanks.", "metacritic": null, "released": "2017-04-29", "tba": false, "updated": "2019-10-22T14:19:10", "background_image": "https://media.rawg.io/media/screenshots/479/47983e4d9c2a7c5fbce563ecadf47bd6_vewhUIB.jpg", "website": "https://www.facebook.com/FashionFantasyPage/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 99, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "Android"], "developers": ["Libii", "Libii Girls Game"], "genres": ["RPG", "Simulation"], "publishers": ["Libii Girls Game Studio"], "esrb_rating": null}