{"id": 232693, "slug": "bladebound-hack-and-slash-action-rpg", "name": "Bladebound: Hack and Slash Action RPG", "name_original": "Bladebound: Hack and Slash Action RPG", "description": "🔥 💀🔥 Save the realm from anarchy in this immersive Action RPG! Fight enemies from the ancient underworld using magic spell and iron weapons! <br/><br/>🔥 💀🔥 Become a dungeon hunter always seeking greater loot or a bounty hunting witcher killing skeleton hordes with your katana blade. No matter which of the endless paths you choose there is a great adventure awaiting you in Bladebound. Face your lineage today!<br/><br/>🔥 💀🔥 Darkness has won in the past game of thrones bringing drastic fate to the kingdom of Ezura. The Dragon Betrayer shattered the last men and started a strong-arm régime. <br/><br/>\"You have been summoned in an ancient ritual to save people that fear their doom. As the last of the Bladebound, you are the only hope for bringing back the light. Embark on the final battle with the mysterious Sentinel and defeat the evil once and for all!\"<br/><br/><br/>DYNAMIC ACTION RPG<br/>⚔️ thousands of combinations of powerful attacks and spells<br/>⚔️ fight designed exclusively for mobile devices<br/>⚔️ build murderous attack combinations to slash your opponents<br/>⚔️ old school isometric feel<br/><br/>PILLARS OF YOUR VICTORY<br/>⚔️ combine the powers of all six elements to create a unique battle style<br/>⚔️ raise up mana to use deadly skills bound to 500 different swords and armor<br/>⚔️ use evolution to create epic gear like The Sword of Eternal Flames or The Necklace of Eternity <br/>⚔️ choose your blood battles wisely while exploring the world of sanctuary<br/>⚔️ find a hearthstone and other mystical ingredients to fuse with your weapons<br/>⚔️ consult your Sentinel - reborn as an angel descendant sent to the kingdom to help you light the darkness<br/><br/>HUNT RUTHLESS OPPONENTS<br/>⚔️ find your tactics to hunt down The Brutal Impaler, Master of Witchcraft, King of Blizzard of The Icy Tower and many others<br/>⚔️ explore the dungeons on 3 difficulty levels - from normal to heroic<br/>⚔️ practice your skill at the Arena and in many other modes<br/>⚔️ unique monsters waiting in the dark dungeons for your sword<br/><br/>DOZENS OF HOURS OF AN ADDICTIVE GAME<br/>⚔️ experience the history of the fall and war on several dozens of levels<br/>⚔️ compete with other players and win priceless treasures at the Arena<br/>⚔️ take part and fight in Events and Weekly Challenges<br/>⚔️ action RPG appreciated by hardcore MMORPG and hack’n’slash fans<br/>⚔️ endgame full of dungeons and dragons as well as other beasts to be slain<br/><br/>AAA QUALITY MOBILE GAME<br/>⚔️ Best Mobile RPG – Digital Dragons Awards 2018 http://digitaldragons.pl/dd-awards/<br/>⚔️ 3D console-like graphics and old-school feeling!<br/>⚔️ spectacular special effects and smooth gameplay<br/>⚔️ experience on your own that a mobile RPG in epic quality is possible<br/>⚔️ developed in Poland - a country where game development is a national industry!<br/><br/><br/>💎 STAY UP TO DATE!💎<br/>🔹Join the Order: https://facebook.com/bladeboundgame<br/><br/>💥 Bladebound requires Android 4.4 or higher and the minimum of 2GB RAM. Internet connection is necessary. The game also requires about 0.9GB of free disk space. 💥", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:34:01", "background_image": "https://media.rawg.io/media/screenshots/a13/a1364eee2c8c14386cb2c1e5665020ca.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 372, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Artifex Mundi"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}