{"id": 23267, "slug": "antisphere", "name": "Antisphere", "name_original": "Antisphere", "description": "<strong>Antisphere</strong> - Antisphere is a PvP competitive twin-stick shooter  where you compete against other players from around the world.<br/><br/><br/><strong>Conquer the Arena</strong> - Antisphere is a fast-paced arcade shooter where your goal is simple: blast away the competition. It’s just two ships in one arena - going head-to-head. You can customize your ship and your loadout to make sure that your loadout is optimal. Play against friends and see if you got the speed and reflexes needed to climb the ranks.<br/><br/><br/><strong>Play against Friends</strong> - Antisphere is online, multiplayer PvP at its finest. Quick matches where you really get to test your skills against anyone in the world. Just jump in!<br/><br/><br/><strong>Competition is All</strong> - To win you got to have what it takes. For you Antisphere could  be just a fun casual game, where you and some friends fight it out. Or it can be as hardcore as you like. As long as you’re competing!<br/><br/><br/><strong>Climb the Ranks</strong> - If you’re good enough you’ll start to climb the ranks. And if you’re one the best, you’ll soon make it into the ACE Rank, where you’ll find the best of the best. <br/><br/><br/><strong>Customize to Victory</strong> - Everything in Antisphere is customizable. You can change your ship to fit your liking - everything from color and vapor trail to body and shield but most importantly you can change your loadout.<br/><br/><br/><br/>Each weapon loadout is based on one of the following: Offensive, Defensive and Ultimate. So depending on your choices, matches are gonna differ greatly. You can customize and combine almost endlessly and more content is going to be added!<br/><br/>Maybe a Wall Spit or Curve Ball for your Offensive, Stun Dash or Teleport as your Defensive and finally Shotgun as your Ultimate?<br/><br/>Also, see if you can create the perfect counter loadout to beat your friends.<br/><br/><br/><br/><br/><strong>Exclusive Masks</strong> - If you own PAYDAY 2 on Steam, you’ll automatically get 2 exclusive Antisphere masks. If you buy Antisphere, you’ll get 6 additional masks.", "metacritic": null, "released": "2017-07-14", "tba": false, "updated": "2019-08-28T22:07:08", "background_image": "https://media.rawg.io/media/screenshots/916/91657789e4b2c3f1e733f00c1a1409b2.jpg", "website": "http://antispheregame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 41, "dropped": 1}, "playtime": 2, "achievements_count": 46, "ratings_count": 1, "suggestions_count": 234, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Soap Interactive", "Soap Interactive, Lion Game Lion"], "genres": ["Action", "Strategy", "Casual", "Massively Multiplayer", "Indie"], "publishers": ["Starbreeze publishing"], "esrb_rating": "Everyone"}