{"id": 232621, "slug": "lost-lands-full", "name": "Lost Lands (Full)", "name_original": "Lost Lands (Full)", "description": "Some creature has carried your son off into the portal! Set off for the search to the Lost Lands full of mysteries!<br/> <br/>Lost Lands: Dark Overlord - an adventurous hidden object game-quest with puzzles and mini-games that tells a story about the stunning fantasy world full of unknown corners and mysterious inhabitants.<br/><br/>Young mother with her son were about to leave their cottage located in the woods. Susan's son Jimmy was playing nearby when suddenly he heard strange voices... Susan had just stepped away to answer the phone, but when she returned she saw something pulling her son Jimmy through a shimmering portal. It closed before she could pull him back. To save her son, Susan must find a way to this other world. The things will turn out to be more complicated than the woman expects. On the way, she will face lots of puzzles and mysteries, as well as the mysterious inhabitants of the Lost Lands. To bring Jimmy back she will have to win a victory over the Dark Overlord who's keeping the world in fear!<br/>Will the mother in despair be able to save her child and free the world from the evil?<br/><br/>Game features:<br/>• Explore over 50 stunning locations<br/>• Complete over 40 different mini-games<br/>• Immerse yourself into the magic underwater world in the bonus chapter!<br/>• Challenge yourself with interactive hidden object scenes<br/>• Assemble collections, gather morphing objects, and gain achievements<br/>• The game is optimized for tablets and phones!<br/><br/>Start your journey in the Lost Lands!<br/>Meet lots of fairy-tale characters and help them – they will answer in kind!<br/>Solve dozens of puzzles and learn more about the Lost lands history!<br/>Explore astonishing places located in the Lost Lands!<br/>Protect the world from the destructive power of the vice!<br/><br/>+++ Get more games created by FIVE-BN! +++<br/>WWW: http://five-bn.com<br/>FACEBOOK: https://www.facebook.com/fivebn/<br/>TWITTER: https://twitter.com/fivebngames<br/>YOUTUBE: https://youtube.com/fivebn<br/>PINTEREST: https://pinterest.com/five_bn/<br/>INSTAGRAM: https://www.instagram.com/five_bn/", "metacritic": null, "released": "2015-01-15", "tba": false, "updated": "2019-08-12T04:20:32", "background_image": "https://media.rawg.io/media/screenshots/fda/fda91728ee2c9a0eb3212e46da678df6.jpg", "website": "http://five-bn.com/game/page/39", "rating": 0.0, "rating_top": 0, "added_by_status": {"beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 197, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "macOS"], "developers": ["FIVE-BN GAMES", "FIVE-BN UK"], "genres": ["Adventure", "Puzzle"], "publishers": ["FIVE-BN UK"], "esrb_rating": "Everyone 10+"}