{"id": 232723, "slug": "princess-isabella-the-rise-of-an-heir-full", "name": "Princess Isabella: The Rise Of An Heir HD", "name_original": "Princess Isabella: The Rise Of An Heir HD", "description": "<p>FANTASTIC HIDDEN OBJECT PUZZLE ADVENTURE GAME FROM THE CREATORS OF ENIGMATIS AND GRIM LEGENDS!<br />\nExplore the realm of magic and dragons! Free your mother from the clutches of an evil witch and discover the secrets of your heritage.<br />\n&quot;Princess Isabella: The Rise of an Heir&quot; tells the story of a captivating adventure in which the beautiful heiress Bella and her magical friends must face a scary, power-hungry witch whose agenda is shrouded in mystery.<br />\nEMBARK ON AN IMMERSIVE FAIRY TALE ADVENTURE!<br />\nThis captivating story begins with an evil spell turning the protagonist&#39;s mother into stone. Our young princess, who is the only legitimate heiress to the throne, narrowly escapes the same scary fate!<br />\nTEST YOUR MAGICAL DETECTIVE SKILLS IN 23 HO SCENES!<br />\nThanks to her magical friends (a family of fairies and a dragon who&#39;s nurtured Bella since she was a child), the princess is temporarily safe. Now she needs to put on her detective hat and look for clues to the whereabouts of her mother in cleverly designed hidden object scenes and exciting mini games!<br />\nEXPLORE 35 BEAUTIFUL HAND PAINTED LOCATIONS!<br />\nBella will embark on a scary adventure in order to free the kingdom from the clutches of the evil witch. Her journey will take her through many beautiful hand drawn locations, where countless mysteries, mini games, puzzles, and hidden object challenges wait to be solved! Will Bella succeed? Will the reigns return to the hands of the rightful ruler?<br />\nPLAY WITH YOUR OFFSPRING!<br />\nA simple but beautiful game, that’s easy enough to enjoy with your kids!<br />\nBRING THE ADVENTURE ON THE BUS!<br />\nOptimized for phones and tablets, filled with hidden objects, perfect while travelling.  No internet connection required – so play off line!<br />\nSIGN UP TO OUR NEWSLETTER AND GET ADVENTURE GAMES  ON SALE!<br />\nCaptivating adventures, beautiful stories and scary mysteries  await in our selection of immersive hidden object puzzle games!<br />\n• Embark on an immersive fairy tale adventure!<br />\n• Test your magical detective skills in 23 HO scenes!<br />\n• Explore 35 beautiful hand painted locations!<br />\n• Continue your journey in the Collector’s Edition!<br />\n• Get your throne back from the hands of an usurper!<br />\n+++ WE ARE HERE +++<br />\nWWW: http://artifexmundi.com<br />\nFACEBOOK: http://facebook.com/artifexmundi<br />\nTWITTER: http://twitter.com/ArtifexMundi<br />\nFORUM: http://forum.artifexmundi.com<br />\nYOUTUBE: http://youtube.com/user/ArtifexMundi<br />\nPINTEREST: http://pinterest.com/artifexmundi<br />\nINSTAGRAM: http://instagram.com/artifexmundi</p>", "metacritic": null, "released": "2014-09-28", "tba": false, "updated": "2023-04-27T07:53:23", "background_image": "https://media.rawg.io/media/screenshots/c24/c2495933bc9fb2d0326290c3c60eb515.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 386, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Big Fish Games"], "genres": ["Adventure", "Puzzle"], "publishers": ["Big Fish Games"], "esrb_rating": "Everyone 10+"}