{"id": 232724, "slug": "the-dreamatorium-of-dr-magnus-2-full", "name": "The Dreamatorium of Dr. Magnus 2 (Full)", "name_original": "The Dreamatorium of Dr. Magnus 2 (Full)", "description": "FANTASTIC HIDDEN OBJECT PUZZLE ADVENTURE GAME FROM THE CREATORS OF ENIGMATIS AND GRIM LEGENDS!<br/><br/>Enter a world where mysterious phenomena are everyday reality. Enjoy the thrill of visiting a place overrun with grim supernatural powers.<br/><br/>A mystery set between nightmare and reality! <br/>A researcher of paranormal phenomena is faced with another enigmatic challenge. A young girl disappears without a trace.<br/><br/>22 addictive mini games to test your detective skills! <br/>With the help of a crystal that allows her to see things hidden from the eyes of mortals, our heroine soon learns that the victim was kidnapped by a supernatural being.<br/><br/>28 breathtaking hand painted locations with grim secrets to uncover! <br/>Plagued by nightmares, she has to uncover the truth, face the ghost that haunts her, solve the mystery of the Dreamatorium of Dr Magnus, and find the kidnapped girl.<br/><br/>14 desirable detective achievements to unlock! <br/>Can she defeat the nightmare that manifested itself in the real world? Can she solve the mystery of the kidnapping?<br/><br/>Try the remastered edition of the spellbinding classic hidden object game! <br/>The game is available in English, German, Italian, French, Polish, Russian, Chinese, Japanese, and Korean with boosted graphics and improved gameplay.<br/><br/>Bring all the hidden object games with you! <br/>Optimized for phones and tablets, filled with hidden objects, perfect for playing while traveling. No Wi-Fi required for this offline game!<br/><br/>Sign up to our newsletter for new hidden object games every month! <br/>Captivating adventures, stories, tales, and eerie mysteries await in our selection of immersive hidden object games!<br/><br/>Look for “Artifex Mundi” to get more hidden object games like this! <br/><br/>• An extraordinary story set between nightmare and reality.<br/>• 22 addictive mini-games!<br/>• 28 locations with dark secrets to uncover!<br/>• 14 detective achievements to unlock!<br/><br/>+++ WE ARE HERE +++<br/>WWW: http://artifexmundi.com<br/>FACEBOOK: http://facebook.com/artifexmundi<br/>TWITTER: http://twitter.com/ArtifexMundi<br/>FORUM: http://forum.artifexmundi.com<br/>YOUTUBE: http://youtube.com/user/ArtifexMundi<br/>PINTEREST: http://pinterest.com/artifexmundi<br/>INSTAGRAM: http://instagram.com/artifexmundi", "metacritic": null, "released": "2015-12-17", "tba": false, "updated": "2022-04-22T09:56:02", "background_image": "https://media.rawg.io/media/screenshots/c05/c052d5f18dc0aca82729b9e74c86c2e0.jpg", "website": "http://www.artifexmundi.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 489, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "Android"], "developers": ["Artifex Mundi"], "genres": ["Adventure", "Puzzle"], "publishers": ["Artifex Mundi"], "esrb_rating": "Teen"}