{"id": 23271, "slug": "bloody-zombies", "name": "Bloody Zombies", "name_original": "Bloody Zombies", "description": "London has been lost to the undead plague. Overrun by hordes of mutated zombies, the last hope rests in the united fists of four lone outcasts. <br/><br/>Bloody Zombies is a co-op brawler designed to be played with any combination of PC and VR players. Fight across the ruins of London using carefully refined Free-Form Combat, taking down a terrifying variety of undead with an expanding special move-set. Created for 1-4 players, Bloody Zombies is also enhanced with HTC Vive and Oculus Rift - using its unique viewpoint to help the team overcome obstacles &amp; discover secrets in the game.<br/><br/><br/>Accessible yet deep freeform combat.  Combine moves to discover brutal, endlessly chainable combos. Unlock upgradable special moves &amp; passive skills to expand your zombie-slaying abilities.  <br/><br/><br/><br/>Unite with friends online &amp; locally, with or without a VR headset.  Work together to tear through the undead hordes, whilst competing for the highest score.  VR’s enhanced viewpoint allows you to assist other players - lean in &amp; look around to overcome obstacles &amp; give tactical support.<br/><br/><br/><br/>Choose from four survivors, brought together to fight the zombie plague - Teller, Mick ‘The Brick’, Rei, &amp; Eddie.  Customise each character’s skillset &amp; wield a destructive arsenal of melee weapons.<br/><br/><br/><br/>Take on a diverse plague of zombies, with loads of deadly mutations &amp; abominable bosses to contend with.  Learn to change tactics to match your foe &amp; survive!<br/><br/><br/><br/>Work together across the diverse, overrun zombie wasteland. Fight your way through the remains of iconic London streets &amp; landmarks to take back the city. Levels are overrun with secrets, &amp; events to discover.<br/><br/>", "metacritic": null, "released": "2017-09-12", "tba": false, "updated": "2019-08-28T22:07:08", "background_image": "https://media.rawg.io/media/screenshots/db5/db5cab1b3ad4315800516df976fb3fe7.jpg", "website": "http://www.ndreams.com/BloodyZombies", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 33, "beaten": 2, "dropped": 4}, "playtime": 1, "achievements_count": 171, "ratings_count": 3, "suggestions_count": 433, "game_series_count": 0, "reviews_count": 3, "platforms": ["PlayStation 4", "Xbox One", "Nintendo Switch", "PC"], "developers": ["nDreams", "Paw Print Games"], "genres": ["Action", "Adventure", "Fighting"], "publishers": ["nDreams"], "esrb_rating": null}