{"id": 232767, "slug": "premium-rpg-djinn-caster", "name": "[Premium] RPG Djinn Caster", "name_original": "[Premium] RPG Djinn Caster", "description": "A Fantasy Action RPG of far foreign lands! Summon the Djinns and rise to revolution!<br/><br/>These are the cities of Dulshara, hidden beyond the enchanting mirages and intense sandstorms of the vast surrounding desert. The people have long lived vigorously even under the tyranny of the Sultan. However, signs of doom were slowly approaching like a viper hunting its prey. From mass kidnappings by the Sultanate Army to a veiled man acting behind the scenes, a chain of mysterious events arose...<br/><br/>One day, the young man Elmir is handed a mysterious dagger by a perishing man on the run from the army. Sealed within it was the manifest power of ancient days... This power is known as \"Djinn\". With the world facing certain doom from the rise of an ancient evil, the long-awaited hero must seek and obtain power. Now begins Elmir and the Djinns' rise to revolution!<br/><br/>FEATURES<br/>- Summon the Djinns and release their power!<br/>- Collect up to 20 ancient Djinns hidden in the lands of Dulshara!<br/>- Thrilling and interactive battle actions!<br/>- Variety of dungeons with everything from creepy crawlies to spooky monsters!<br/>- Explore big and small cities and enjoy special events!<br/>- Participate in mini games, rank trials in dungeons, treasure hunting and more!<br/>- Aid your friends and fellow citizens with subquests!<br/><br/>May the protection of Aswan be upon you!<br/><br/>* The game can be played in its entirety without the need for in-game transactions.<br/><br/>[Non-supported Devices]<br/>- iPhone 4S or older<br/>- iPod Touch 5th or older<br/>- iPad 2 or older<br/>- iPad mini (1st)", "metacritic": null, "released": "2017-02-20", "tba": false, "updated": "2019-08-02T03:29:04", "background_image": "https://media.rawg.io/media/screenshots/efa/efa887f9fd01ee0829d9986128ad2a05.jpg", "website": "http://www.kemco.jp/sp/games/dc/en/index.html", "rating": 0.0, "rating_top": 0, "added_by_status": {}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 342, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["KEMCO", "Kotobuki Solution Co"], "genres": ["Action", "RPG"], "publishers": ["Kotobuki Solution Co"], "esrb_rating": "Teen"}