{"id": 232752, "slug": "rpg-asdivine-menace", "name": "RPG Asdivine Menace", "name_original": "RPG Asdivine Menace", "description": "A traditional fantasy RPG that can be played in its entirety for free!<br/><br/><br/>Travel to distant worlds!<br/>A century after the events of Asdivine Dios peace has finally settled in. That is, until a visitor from another world suddenly shows up proclaiming the entire universe is about to be destroyed.<br/><br/>Hearing this, Izayoi sets off in an attempt to reverse this seemingly pronounced fate with a trio of very idiosyncratic spirits as they criss-cross four worlds in search of an answer. But what is the answer they find...?<br/><br/><br/>Riveting 2D battles!<br/>Experience immersive two-dimensional battles like never before! Engaging the enemy on the battlefield is as intense as ever! What's more, cooperative attacks and new limit break skills have taken decimating hordes of enemies while in the throes of battle to an all new level!<br/><br/><br/>The works and more!<br/>Not counting quests, collecting, nor even the battle arena, Asdivine Menace comes packed with enough content to satisfy the most JRPG-hungry of gamers out there. That's not mentioning the post-game content!<br/><br/><br/>Barrel Busters and Weapon Crafting are back!<br/>With more weapon types to collect and crafting options than ever before, turn your slaying instrument of choice into one that strikes fear in the hearts of humans and beasts galaxy-wide!<br/><br/><br/>Cultivate relationships with the ladies!<br/>As Izayoi deepens his bonds of trust with his spirit companions, their fates together move in new and meaningful directions!<br/><br/><br/>* The game can be played in its entirety without the need for in-game transactions.<br/>* The actual price might differ depending on the region.<br/>* Please contact us through the Contact button on the title screen if you discover any bugs or problems with the application. Note that we do not respond to bug reports left in application reviews.<br/>* A Premium Edition that includes 1500 bonus in-game points is also available for download! For more information, check out \"Asdivine Menace\" on the web!<br/><br/>[Supported OS]<br/>- 2.3 and up<br/>[Game Controller]<br/>- Not optimized<br/>[SD Card Storage]<br/>- Enabled<br/>[Languages]<br/>- English, Japanese<br/>[Non-Supported Devices]<br/>This app has generally been tested to work on any mobile device released in Japan. We cannot guarantee full support on other devices.<br/><br/>[IMPORTANT NOTICE]<br/>Your use of the application requires your agreement to the following EULA and 'Privacy Policy and Notice'. If you do not agree, please do not download our application.<br/><br/>End User License Agreement: http://kemco.jp/eula/index.html<br/>Privacy Policy and Notice: http://www.kemco.jp/app_pp/privacy.html<br/><br/>Get the latest information!<br/>[Newsletter]<br/>http://kemcogame.com/c8QM<br/>[Facebook page]<br/>http://www.facebook.com/kemco.global<br/><br/>(C)2015 KEMCO/EXE-CREATE", "metacritic": null, "released": "2016-02-02", "tba": false, "updated": "2019-08-02T03:27:46", "background_image": "https://media.rawg.io/media/screenshots/531/5311ad4921c43ac7e2f7a0e98417e2c0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 382, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["KEMCO", "Kotobuki Solution Co"], "genres": ["Adventure", "RPG"], "publishers": ["Kotobuki Solution Co"], "esrb_rating": "Everyone 10+"}