{"id": 232728, "slug": "fix-my-car-supercar-shop-free", "name": "Fix My Car: Supercar Shop FREE", "name_original": "Fix My Car: Supercar Shop FREE", "description": "Become the ultimate supercar mechanic! Build a GT concept car supercharged for performance... fuel it with exotic racing upgrades in your very own high-tech research and development garage!  You'll have all the high-tech gadgets and robotics money can buy! Spare no part, detail, or custom mod when upgrading your car in this 3D mechanic simulator game! <br/><br/>* This is the FREE version of the game. Upgrade to the FULL version to remove all ads and get access to all upgrades! *<br/><br/>At one of the world's premiere car design facility, you've been called to fix an awesome, high-tech, auto dream! Starting with a wrecked prototype, you and your rich client will work together to fix and upgrade the car to a beautiful, world class racing concept car - a supercar! Explore different levels and work together quickly to get the vehicle ready before the big reveal!<br/><br/>Discover adventure, find hidden objects (HOG), use the highest quality parts, and leverage cutting edge tools! Paint it, fix it, mod it, detail it, fine-tune it, upgrade it, and plaster it with flair and ultimate speed in mind! Learn something about cars while you're having fun!<br/><br/>FEATURES:<br/><br/>+ 120+ objectives and upgrades to do!<br/><br/>+ Dozens of tools and cool after-market parts to find and install! <br/><br/>+ Perform dozens of jobs ranging from basic routine maintenance to outrageous performance mods! <br/><br/>+ Explore cool environments!<br/><br/>+ Built-in hint system so you never get stuck! <br/><br/>+ All hints and objectives available in FULL version, LITE version requires unlocking with reward videos or a one-time in app purchase<br/><br/>DETAILS:<br/><br/>See this game and more at: https://www.firerabbit.com/", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:33:46", "background_image": "https://media.rawg.io/media/screenshots/cb9/cb9fe006deae0398fdb4bd1cc7297f70.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 286, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["FireRabbit"], "genres": ["Casual"], "publishers": [], "esrb_rating": null}