{"id": 232706, "slug": "grim-legends-3-the-dark-city-full", "name": "Grim Legends 3: The Dark City (Full)", "name_original": "Grim Legends 3: The Dark City (Full)", "description": "FANTASTIC HIDDEN OBJECT PUZZLE ADVENTURE GAME FROM THE CREATORS OF ENIGMATIS AND GRIM LEGENDS!<br/>Step into the shoes of the Monster Hunter from the mysterious Order and save the city of Lichtenheim from a Nightmare coming from another dimension. Apprehend the thief of the powerful artifact and unravel the secrets of your own past!<br/><br/>PLAY THE CAPTIVATING THIRD INSTALLMENT OF GRIM LEGENDS!<br/>Grim Legends 3: The Dark City is a high-quality hidden object puzzle adventure game that focuses on mini games and puzzle solving in the creepy scenery of a gothic city.<br/><br/>HUNT MONSTERS IN THE HAND PAINTED GOTHIC CITY!<br/>Sylvia, the acolyte of the mysterious monster hunting Order, loses her memory. One year later, the Incarceri Stone – a powerful artifact that binds Koshmaar, a horrifying creature from another world – is stolen!<br/><br/>36 CAPTIVATING HAND PAINTED LOCATIONS!<br/>Sylvia and her master, Solomon, embark on an adventure that will lead them into the city of Lichtenheim, where they will face the thief whose identity will come as no less a shock than the actual disappearance of the artifact.<br/><br/>TEST YOURSELF IN 36 MINI GAMES AND HIDDEN OBJECT SCENES!<br/>The heroin and her mentor will need to put on their detective hats and face not only the evil forces within the gothic walls of the grim city, but also dark secrets from the past. Will Silvia succeed in recovering the Incarceri and prevent the Koshmaar from breaking free? Will she muster the courage to save Lichtenheim and its inhabitants?<br/><br/>HELP THE ESTRANGED LOVERS IN A BONUS ADVENTURE FROM THE COLLECTOR’S EDITION!<br/>The additional content contains an immersive bonus adventure that will pull you deeper into the game!<br/><br/>BRING THE HIDDEN OBJECTS PUZZLES ADVENTURE WITH YOU!<br/>Optimized for phones and tablets, filled with hidden objects, perfect for playing while traveling. No Wi Fi required for this offline game!<br/><br/>SIGN UP TO OUR NEWSLETTER FOR NEW ADVENTURE GAMES EVERY MONTH!<br/>Captivating adventures, stories, tales, and eerie mysteries await in our selection of immersive hidden object puzzle games!<br/><br/>• Master the third installment of Grim Legends!<br/>• 36 atmospheric hand-painted locations!<br/>• Test yourself in 36 mini-games and hidden object scenes!<br/>• Help the estranged lovers in bonus adventure!<br/>• Examine and put together useful items!<br/>• High-end, immersive gameplay, optimized for tablets and phones!<br/><br/> +++ WE ARE HERE +++<br/>WWW: http://artifexmundi.com<br/>FACEBOOK: http://facebook.com/artifexmundi<br/>TWITTER: http://twitter.com/ArtifexMundi<br/>FORUM: http://forum.artifexmundi.com<br/>YOUTUBE: http://youtube.com/user/ArtifexMundi<br/>PINTEREST: http://pinterest.com/artifexmundi<br/>INSTAGRAM: http://instagram.com/artifexmundi", "metacritic": null, "released": "2019-07-30", "tba": false, "updated": "2020-07-06T02:20:36", "background_image": "https://media.rawg.io/media/screenshots/298/29848bc157e1fc1c7f559ecfb2401f46.jpg", "website": "http://www.artifexmundi.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 365, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Artifex Mundi"], "genres": ["Adventure", "Puzzle"], "publishers": ["Artifex Mundi"], "esrb_rating": "Teen"}