{"id": 232889, "slug": "paw-patrol-air-and-sea-adventures", "name": "PAW Patrol Air and Sea Adventures", "name_original": "PAW Patrol Air and Sea Adventures", "description": "Pups Take Flight is now PAW Patrol Air and Sea Adventures! Kids take to the sky and sea with the PAW Patrol pups in a game featuring the Air and Sea Patrollers and the team’s new flight suits! The PAW Patrol Air and Sea Adventures app teaches children pre-k math skills with the help of their PAWsome pup heroes from the Nick Jr. TV show!<br/><br/>All the game controls are made just for kids, so your preschooler can:<br/>• Fly the skies with 6 pups in 3 different locations<br/>• Explore and dive into the sea with the pups in Adventure Bay<br/>• Avoid obstacles, collect pup treats, and unlock fun tricks<br/>• Develop counting and shape recognition skills<br/>• Earn special badges<br/><br/>Build Pre-K Math Skills:<br/>The PAW Patrol Air and Sea Adventures app helps prepare preschoolers for kindergarten by fostering important early math skills for 3 – 7 year olds. Kids will be exposed to concepts including:<br/>• Shape recognition<br/>• Number recognition <br/>• Counting and enumeration<br/><br/>Game Features:<br/>• Play with characters from the TV show, PAW Patrol: Chase, Marshall, Skye, Rocky, Rubble, &amp; Zuma!<br/>• Control the pups with easy swipe and finger-trace gestures!<br/>• Over 30 levels to explore!<br/>• Difficulty increases with each level!<br/>• Complete mini-games, unlock special moves and make the pups do amazing tricks!<br/>• Earn badges for completing a mission, collecting pup treats, and unlocking new moves!<br/><br/>PAW Patrol Air and Sea Adventures collects personal user data as well as non-personal user data (including aggregated data).  User data collection is in accordance with applicable law, such as COPPA. User data may be used, for example, to respond to user requests; enable users to take advantage of certain features and services; personalize content and advertising; and manage and improve Nickelodeon's services. For more information regarding Nickelodeon’s use of personal user data, please visit the Nickelodeon Group Privacy Policy below. Our Privacy Policy is in addition to any terms, conditions or policies agreed to between you and Google, Inc., and Nickelodeon and its affiliated entities are not responsible for Google's collection or use of your personal user data and information.   Additionally, this App may use “local notifications.”  Local notifications are sent directly from the App to your device (you don’t need to be connected to the Internet) and may be used to notify you of new content or events within your App, among other reasons. Use of this app is subject to the Nickelodeon End User License Agreement.<br/><br/>PAW Patrol Air and Sea Adventures offers in-app purchases and charges real money for additional in-app content. You may lock out the ability to purchase in-app content by adjusting your device’s settings.<br/><br/>For users residing in the EU, PAW Patrol Air and Sea Adventures may include the use of persistent identifiers for game management purposes and installation of this app constitutes your permission to such usage of persistent identifiers for all users on your device.<br/><br/>End User License Agreement: http://www.nick.com/nick-eula/<br/>Privacy Policy: http://www.nick.com/privacy-policy/<br/>Privacy Policy for Nick Jr.: http://www.nickjr.com/privacy-policy/<br/><br/>The End User License Agreement for this app includes arbitration for disputes – see FAQs: http://www.nick.com/faqs/<br/><br/>Having trouble with PAW Patrol Air and Sea Adventures or just have a question? Check out the Support page! <br/>http://www.nickjr.com/appsupport/", "metacritic": null, "released": null, "tba": false, "updated": "2024-01-05T22:12:46", "background_image": "https://media.rawg.io/media/screenshots/861/86125acda99ad66ff2ca2c6f76261bb8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 198, "game_series_count": 0, "reviews_count": 1, "platforms": ["Android"], "developers": ["Nickelodeon"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}