{"id": 232897, "slug": "dora-and-friends-rainforest", "name": "Dora and Friends Rainforest", "name_original": "Dora and Friends Rainforest", "description": "Oh no! Backpack and Map have been swiped and blown away! Dora and Boots need your child's help to run back to the rainforest to rescue them.<br/><br/>In Dora and Friends Back to the Rainforest your child helps Dora and Boots…<br/>•\trun and jump through the Treetops of the Rainforest<br/>•\treach new heights in the Flowery Garden to rescue Backpack and Map<br/>•\tslide and glide down the Tallest Mountain<br/>•\trace back to Playa Verde so they can fix Backpack who was hurt when blown away<br/><br/>Along the way your child will…<br/>•\tgather up as many of Backpack's dropped items as possible<br/>•\tsee old friends such as Tico, Big Red Chicken, and more<br/>•\tcollect charms in each location for Dora’s bracelet<br/>•\texperience counting in Spanish, color recognition and enumeration<br/><br/>Vamanos, let's go!<br/><br/>Dora and Friends Back to the Rainforest collects personal user data as well as non-personal user data (including aggregated data).  User data collection is in accordance with applicable law, such as COPPA. User data may be used, for example, to respond to user requests; enable users to take advantage of certain features and services; personalize content and advertising; and manage and improve Nickelodeon's services. For more information regarding Nickelodeon's use of personal user data, please visit the Nickelodeon Group Privacy Policy below. Our Privacy Policy is in addition to any terms, conditions or policies agreed to between you and Google.  Nickelodeon and its affiliated entities are not responsible for Google's collection or use of your personal user data and information.  Use of this app is subject to the Nickelodeon End User License Agreement.<br/><br/>Privacy Policy:<br/>http://www.nickjr.com/about/privacy-policy.html<br/><br/>End User License Agreement:<br/>http://www.nick.com/info/eula.html<br/><br/>", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:33:08", "background_image": "https://media.rawg.io/media/screenshots/24e/24e6df0915ec541c02617cf4b85347bb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 221, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Nickelodeon"], "genres": ["Action"], "publishers": [], "esrb_rating": null}