{"id": 2328, "slug": "pokemon-tcg-online", "name": "Pokémon TCG Online", "name_original": "Pokémon TCG Online", "description": "<p><strong>AN INTERNET CONNECTION AND AN iPad WITH RETINA DISPLAY (iPad mini with Retina Display, iPad 3 or newer) ARE REQUIRED FOR USE.  Generation 1 iPad, iPad 2, and the original iPad mini (without Retina Display) are not supported.</strong><br />\nPLAY, TRADE, AND CHALLENGE OTHER PLAYERS AROUND THE WORLD<br />\nHave fun learning and mastering the Pokémon Trading Card Game Online! Practice against the computer or go head to head with your friends or other players from around the world. Unlock cards and decks as you play to build up your collection and make truly unique decks. Your decks and card collection are stored as a part of your Pokémon Trainer Club account, allowing you to switch between iPad and desktop with ease.<br />\nEASY TO START: Choose from Grass, Fire, or Water decks, step right into a game, and learn as you go in an easy play experience.<br />\nEXPAND YOUR COLLECTION: Earn cards, open booster packs, trade with other players, and build the perfect deck around your favorite cards. Your collection grows with you!<br />\nCUSTOMIZE YOUR EXPERIENCE: Build your own decks, customize the look of your cards, deck boxes, and avatar, and join your friends online.<br />\nHONE YOUR SKILLS: Play against the computer until you are ready to challenge other players.<br />\nCHALLENGE THE WORLD: When you feel your deck design is ready, challenge other players or join a tournament to show your skill and knowledge.<br />\n<strong>An Internet connection and an iPad with Retina display (iPad mini with Retina display, iPad 3 or newer) are required for use.</strong><br />\nCard Languages Supported:<br />\n<em> English<br />\n</em> Français<br />\n<em> Deutsch<br />\n</em> Español (Europa)<br />\n<em> Italiano<br />\n</em> Português (Brazilian)<br />\n<em> Русский<br />\nUI Languages Supported:<br />\n</em> English<br />\n<em> Français<br />\n</em> Deutsch<br />\n<em> Español (Europa)<br />\n</em> Italiano<br />\n<em> Português (Brazilian)<br />\n</em> Nederlands<br />\n<em> Svenska<br />\n</em> Dansk<br />\n<em> Norske<br />\n</em> Suomi<br />\n* Русский<br />", "metacritic": null, "released": "2014-09-30", "tba": false, "updated": "2023-07-25T15:14:26", "background_image": "https://media.rawg.io/media/screenshots/a38/a3850500a7d43c8cad06eafe9ea05e0f.jpeg", "website": "https://www.pokemon.com/us/pokemon-tcg/play-online", "rating": 3.44, "rating_top": 4, "added_by_status": {"owned": 5, "beaten": 2, "toplay": 2, "dropped": 10, "playing": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 9, "suggestions_count": 313, "game_series_count": 0, "reviews_count": 9, "platforms": ["Android", "PC", "iOS"], "developers": ["THE POKEMON COMPANY INTERNATIONAL"], "genres": ["Card", "Family"], "publishers": ["THE POKEMON COMPANY INTERNATIONAL"], "esrb_rating": "Everyone 10+"}