{"id": 232961, "slug": "crazy-dentist-games-with-surgery-and-braces", "name": "Crazy dentist games with surgery and braces", "name_original": "Crazy dentist games with surgery and braces", "description": "Ever dreamed of becoming a super kids dentist? Make your dreams come true with Crazy dentist! Where you can experience being a super crazy kid dentist in hospital full of crazy doctors, cure patient or use all your skills to perform the craziest surgery ever! Enjoy the thrill of being a superhero kid dentist to cure all kids coming to your clinic and bringing them back from trauma. The injured patients suffer from kinds of teeth problems like bad teeth, tooth cavity, dental calculus, dental treatment, dentist mania &amp; they might need an emergency surgery &amp; treatment. Sterilize your tools and keep your dental chair prepared for treatment. Be careful, don’t get the bones and face skin damaged. Make use of injection, magic potion, droppers and all the medical tools you need &amp; perform crazy fun dentist routines surgery fill cavities, remove plaques, whiten teeth, squirt water, brush, and much more. Going to the dentist is something that not many people like to do, although to have a nice clean smile it has to be done. In Crazy dentist you can kill all the germs away, remove any holes that may be cracked, suck all the gum from the teeth, as well as remove and pull any rotten or cracked teeth in the dental surgery game. Treat patients with professional doctor tools like syringes, dental tweezers &amp; more.<br/><br/>Play Crazy dentist games with surgery braces for kids – free fun kids game! This kid’s clinic is painted with superheroes and dolls so that the little patients does not get worried with their sickness. Help these poor patient feel better again with an amazing dentistry treatment. Kids get hurt all the time while playing at home or in their schools and parks. Curing those little kids is a great fun in Crazy dentist games . Brush dirty teeth to kill those germs, pull out the painful teeth (tooth extraction), fight bacteria to prevent tooth decay, apply colorful braces and apply dental braces to straighten the misaligned teeth. Some kid patients have a fear of visiting the dentist’s office. Be good to them. Become an ultimate professional Crazy dentist to gain dental learning experience in this surgery simulator game. Be the best braces surgeon; enjoy tooth cleaning and teeth alignment at dental clinic. Ask your patients to brush their teeth daily otherwise they will get a cavity in their teeth. Enjoy and play fun-filled dentist surgery mini games for girls and boys. Do not poke the dental equipment in your patient’s eye, nose, ear or face. Check every patient’s dental health condition before carrying out the dental surgery simulation. Apply stitches after you are done with the oral surgery.<br/><br/>Crazy dentist games with surgery braces for kids features:<br/>√ Select your patient with bad teeth for dental treatment<br/>√ Scan the teeth to determine the condition <br/>√ Clean it and remove cavities and fungus with medical equipment <br/>√ Brush the teeth, clean it with water then suck out the extra water<br/>√ Use stain removal to remove stains <br/>√ Perform dental surgery and application of oral braces<br/>√ Pull out the rotten broken teeth<br/><br/>Do you have unaligned or unbalanced teeth? Do you need dental braces to align your teeth, but you have a dentist fear? If yes then forget your fear and be an ultimate professional braces surgery dentist with an amazing dental learning experience. Its Top of the line Surgery Simulator game! With innovative medical and surgical instruments; treat your little patient at the dental clinic to give the perfect and desired look to their teeth. Perform the dental surgery simulation and application of braces like professional dentist in Crazy dentist games with surgery braces for kids.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:32:55", "background_image": "https://media.rawg.io/media/screenshots/ae9/ae923d288b86a561355e9069faaa331b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 113, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["bonbongame.com"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}