{"id": 232900, "slug": "shimmer-and-shine-carpet-ride", "name": "Shimmer and Shine: Carpet Ride", "name_original": "Shimmer and Shine: Carpet Ride", "description": "Preschoolers learn basic math concepts on an enchanted carpet ride with Nick Jr.’s mega-popular magic genies, Shimmer and Shine! Help these genies-in-training practice a little genie magic – all while learning problem solving skills endorsed by Pre-K educational experts! Shimmer and Shine: Enchanted Carpet Ride Game is an app that invites kids to fly through four magical locations in Zahramay Falls, collecting genie coins and finding hidden treasure chests along the way. Collect all the genie jewels to open a jewelry box and reveal a special prize! <br/><br/>Boom Zahramay!  Let’s fly up and away!<br/><br/>NEW FEATURE:  Collect special Genie Gems that look just the like the brand-new Genie Gems featured in Season 2 of Shimmer and Shine! Genie Gems give kids unique genie “power-ups” as they fly through the Zahramay Falls: <br/>•\tThe Doubling Gem <br/>•\tThe Super Gem <br/>•\tThe Wind Gem<br/><br/><br/>This app also includes lots of educational opportunities for preschoolers who love Shimmer and Shine:<br/>1.\tStrengthens children’s understanding of shapes through consistent verbal and visual references. <br/>2.\tDevelops children’s ability to recognize patterns and use deductive reasoning.<br/>3.\tEncourages children to practice their observation and problem-solving skills.<br/>4.\tCurriculum developed and reviewed by a preschool education expert!<br/><br/>Fly on a magic carpet with Shimmer and Shine, and their pets:<br/>Kids can join Shimmer and Shine as they move their magic carpet up and down through four magical Zahramay Fall locations: Genie Beach, Genie Bazaar, Zahramay Falls city, and the Hanging Star Gardens. In every magic carpet ride, kids must avoid obstacles and open blocked doors, all with a little swipe of genie magic! Each level provides room for exploration and discovery as the player searches for all the hidden treasure chests and unlocks them to get their genie jewels.<br/><br/>Early Math Concepts - Shape identification and symmetry puzzles:<br/>Children develop matching skills with eight geometric shapes including rectangles, pentagons, hexagons and trapezoids. Jewelry box puzzles allow children to use problem-solving strategies and deductive reasoning to create symmetrical patterns which get increasingly more difficult as they play on!<br/> <br/>Complete fifty flying levels and earn fifty prizes – the fun never ends:<br/>Kids can complete each level and earn fifty unique genie prizes. The flying is endless and the puzzles can be completed again and again on your Android devices! <br/><br/>Shimmer and Shine: Enchanted Carpet Ride collects personal user data as well as non-personal user data (including aggregated data). User data collection is in accordance with applicable law, such as COPPA. User data may be used, for example, to respond to user requests; enable users to take advantage of certain features and services; personalize content and advertising; and manage and improve Nickelodeon's services. For more information regarding Nickelodeon’s use of personal user data, please visit the Nickelodeon Group Privacy Policy below. Our Privacy Policy is in addition to any terms, conditions or policies agreed to between you and Google. Nickelodeon and its affiliated entities are not responsible for Google's collection or use of your personal user data and information. Use of this app is subject to the Nickelodeon End User License Agreement. For users residing in the EU, Shimmer and Shine: Enchanted Carpet Ride may include the use of persistent identifiers for game management purposes and installation of this app constitutes your permission to such usage of persistent identifiers for all users on your device.<br/> <br/>Privacy Policy:<br/>http://www.nickjr.com/privacy-policy/<br/> <br/>End User License Agreement:<br/>http://www.nick.com/info/eula.html", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:33:07", "background_image": "https://media.rawg.io/media/screenshots/90d/90d9dac8d44e62dd61d5db561cff71f8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 146, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Nickelodeon"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}