{"id": 23298, "slug": "blood-of-old-the-rise-to-greatness", "name": "Blood of Old - The Rise to Greatness!", "name_original": "Blood of Old - The Rise to Greatness!", "description": "<strong>Blood of Old, Indie, Strategy game with RPG elements, with an in depth story.</strong><br/><br/><strong>WARNING!!!</strong><br/>This game is in very early stages of development, things will be broken, things will be added some things may be removed or changed. Please DO NOT buy or play this game unless you fully understand this and wish to be active in development of the game!<br/><br/><ul><li>Your father is ill, for as long as you can remember he has been bid-ridden and unable to move.  His lands have fallen into a poor state. You have just come of age, the responsibility now falls to you, to restore the lands to their former greatness!<br/></li><li>Manage your castles and cities ensuring they keep a smooth economy and happy peoples. <br/></li><li>Explore the word and play in 3 styles. Top Down RTS, 3rd Person RPG and First Person RPG.<br/></li><li>Build a city from scratch. <br/></li><li>Employ your people to carry out jobs.<br/></li><li>Manage taxes. <br/></li><li>Play through the story line and find the Blood of Old and help them regain their throne and restore peace to a war torn country.<br/></li><li>Play Freeplay mode, start with no resources, no objectives and build your city from scratch with no limits. Rise from nothing to greatness!<br/></li><li>Play Creative mode and start with huge amounts of resources, no objectives and build your city from scratch with no limits! </li></ul>", "metacritic": null, "released": "2017-05-15", "tba": false, "updated": "2023-08-23T13:29:18", "background_image": "https://media.rawg.io/media/screenshots/1fd/1fddea9d5321f6bae13065dbe1ab3e84.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 83, "beaten": 1, "dropped": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 4, "suggestions_count": 230, "game_series_count": 0, "reviews_count": 4, "platforms": ["PC"], "developers": ["AWStudios"], "genres": ["Action", "Adventure", "RPG", "Strategy", "Simulation", "Casual", "Indie"], "publishers": ["AWStudios"], "esrb_rating": "Everyone"}