{"id": 232975, "slug": "pop-cat", "name": "Pop Cat", "name_original": "Pop Cat", "description": "Pop Cat (LinkDesks - Jewel Games Star.) is an addictive pop cats puzzle game!<br/><br/>😍 More than 1000+ levels &amp; new levels update regularly! Pop cats are designed not only to bring entertainment when bored but also for brain training!<br/><br/>Blast cats blocks &amp; have fun just in the world of Pop Cat!<br/>Download for free &amp; enjoy our catoon blocks crush games - Pop Cats right now!<br/><br/>Cats are in a mess~~~~~<br/>Blast them and win 🏆 !!!<br/><br/>------------------------------------<br/>Features of pop bubble puzzle cat game:<br/>🎉 Bright newdesign provides bright new experience! <br/>🎉 Easy to get start with, but at which stage can you reach?!?<br/>🎉 New catoon bubble blocks - Cats of 5 colors.<br/>🎉 Levels of challenging puzzle games &amp; updates never cease!<br/>🎉 Free games with millions of different targets to achieve!<br/>🎉 Offline games allow to play anywhere anytime!<br/>🎉 No time limit! Reach the target points of each stage!<br/>🎉 Designed for all ages - both kids &amp; adults!<br/><br/>How to play pop bubble cat game:<br/>👉 Find matching colors of cats blocks &amp; just tap!<br/>👉 Tap two or more bubble cats blocks of same color!<br/>👉 Use the magic fish to help to change the color of cats.!<br/>👉 4000 points in one stage: get stars of pop cat game. <br/>👉 5000 points in one stage: win super stars of pop cat game!<br/>👉 More stars you get, higher score &amp; higher stage you'll reach!<br/>------------------------------------<br/><br/>Pop Cat- Match &amp; Blast, this Pop Bubble Game is globally FREE now!<br/>😍 Millions of players &amp; 1000+ puzzles are waiting for you, just in our addictive blocks crush puzzle game -Pop Cat 2019 !", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:32:46", "background_image": "https://media.rawg.io/media/screenshots/72e/72e7d5b1840faddc58268b6a4d813829.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 33, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["LinkDesks"], "genres": ["Casual"], "publishers": [], "esrb_rating": null}