{"id": 232971, "slug": "jewels-legend-match-3-games-puzzle", "name": "Jewels Legend - Match 3 Games Puzzle", "name_original": "Jewels Legend - Match 3 Games Puzzle", "description": "Ultimate Match-3 game in the jewel world with addictive and exciting adventures!<br/><br/>Jewels Legend (from LinkDesks Inc.) is an addictive and exciting adventure match 3 game filled with colorful jewels crunching effects! This jewel game has well designed puzzles for you to play in anytime and anywhere! Be the Jewel Star and unlock all castles in this jewel saga game.<br/><br/>HOW TO PLAY<br/>★ Match 3 or more jewels in a line to crush them.<br/>★ Match 4 jewels to create special lightning jewels. Lightning jewels can make a blast to destroy all jewels in a row or column.<br/>★ Match 5 jewels with T or L shape to create special jewels bomb. The jewels bomb can destroy all jewels around it.<br/>★ Match 5 jewels in a line to create special color jewels. Color jewels can destroy all jewels with the same color of selected jewels .<br/>★ Match 6 jewels can create a more powerful lightning jewel.It can destroy all jewels in a row AND a column.<br/>★ Combine 2 special jewels together to make different kinds of fantastic effects to help you pass the level.<br/>★ Reach different level target to pass levels in your adventure. <br/><br/>JEWEL LEGEND MATCH 3 PUZZLE FEATURES<br/>★ Easy and fun to play, challenging to master.<br/>★ More than 1000 addictive jewel quest levels - more added regularly.<br/>★ More than 230 challenging castle levels.<br/>★ 5 completely different best match 3 games types.<br/>★ Helpful magical boosters to win jewel stars.<br/>★ Daily free games bonus in best jewel games.<br/>★ Auto hint when you jewel quest but could not find one match.<br/><br/>PLAY WITH FRIENDS<br/>★ Connect to Facebook and play with friends!<br/>★ See your friends on the map!<br/>★ Synchronize the game on multiple devices and platforms!<br/><br/>EASY AND FUN PLAY<br/>★ Easy to control, fun to play, great graphics!<br/>★ Just swap &amp; match with your single finger!<br/><br/>NO TIME LIMIT<br/>★ Play at your own pace!<br/><br/>NO WIFI? NO PROBLEM!<br/>★ Free Games you can play offline.<br/><br/>Classic Match3 games in Google Play. It is simple and fun, but also quite challenging. Easy to play, difficult to master. All levels are designed attentively. Your mission is to win the Jewels Stars. Pass these match 3 jewel levels and try to get all jewel stars in each level to unlock castles.<br/><br/>This best Jewel match-3 game is completely free to play, but some in-game items such as extra moves or jewel quest hints or lives will require payment.<br/><br/>Contact us for any problem: JewelLegend@linkdesks.com.<br/><br/>Match 3 Jewels and never stop!", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:32:49", "background_image": "https://media.rawg.io/media/screenshots/ae5/ae5633db4482c84199b2674660f05aa0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 61, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["LinkDesks"], "genres": ["Arcade"], "publishers": [], "esrb_rating": null}