{"id": 233031, "slug": "multiplication-memorizer", "name": "Multiplication Memorizer", "name_original": "Multiplication Memorizer", "description": "Multiplication Memorizer helps you memorize the 12 x 12 times tables.<br/><br/>General Features<br/>+ Provides interactive lists covering each of the 12 multiplication tables.<br/>+ A practice area to improve accuracy.<br/>+ A timed area to improve speed.<br/>+ Keeps track of overall progress and best times.<br/>+ Supports Leaderboards and Achievements.<br/><br/>There are five general areas:<br/><br/>Times Tables provides a stress free learning environment. It's a modern take on multiplication flash cards listing all multiplication tables. This area displays the entire multiplication table, a \"row\" at a time. You can show or hide the answers to any multiplication problem at any time. There are no questions, no time limit, no data tracking.<br/><br/>Practice is where your multiplication memorization is tested. Questions are randomly generated. It's your job to enter the answer digit by digit (there is no multiple choice). The number of correct and incorrect attempts are tracked and saved for each multiplication fact. Incorrect problems are listed at the end of each session and you'll have the option to repeat all the questions, repeat only on the incorrect attempts, or shuffle the questions all together.<br/><br/>Time Trials is where you put all that practice to the test: How fast can you answer 12 multiplication questions? Compete against yourself or compare your times with friends and people all over the world with this multiplication game! <br/><br/>Time Records keeps track of your top 10 fastest completion times for each multiplication problem set attempted in the Time Trials area. Displays your rank, initials, time, and date for each record. Note: to set a record, you must answer 10 of the 12 questions correctly!<br/><br/>Data is where you can see how you're doing for each multiplication fact. The result for each fact is displayed as a colored box inside a multiplication chart. The colors range from green to red (with green meaning good and red meaning not-so-good). Pressing a box will show more details for that fact: Number Correct, Total Attempts, Percentage, and Grade.<br/><br/>Look for more multiplication games and features to be added in the future!<br/><br/>This is a free-to-download, ad-supported app.<br/><br/><br/>Thanks for any support.<br/><br/>MATH Domain Development", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:32:35", "background_image": "https://media.rawg.io/media/screenshots/025/02556d4666adf0091eb1ef58212a0fc5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 100, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["MATH Domain Development"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}