{"id": 233053, "slug": "coloring-book-kids-paint", "name": "Coloring Book - Kids Paint", "name_original": "Coloring Book - Kids Paint", "description": "Simple and funny game to develop creativity for all ages and tastes. All Family will enjoy it.<br/><br/>• 100% FREE content.<br/>• More than 200 drawings to color and decorate<br/>• Simple and intuitive design for all ages<br/>• Pencils, brushes, crayons, different strokes and colors.<br/>• Many stamps and backgrounds to decorate.<br/>• Special effects through the use of dynamic and bright colors.<br/>• Undo and Eraser function for partial or total deletion.<br/>• Save drawings in the album to edit them<br/>• Share drawings using Whatsapp, Instagram, Facebook, Twitter or email<br/><br/>The little ones can doodle, decorate and color freely without worrying about the neatness while the older ones and even adults can challenge themselves to color within the limits of each drawing and even draw freely.<br/><br/>It is an application for all ages that encourages and helps to learn, develop creativity in an intelligent and fun way.<br/><br/>This entertaining game allows you to draw, color, paint, decorate and embellish in a very simple way, in the same way as on a paper, book or magazine, using different options to paint as brushes, crayons or pencils.<br/><br/>Creativity is tested by coloring, drawing, painting and decorating works with multiple stamps and graphics of star, moon, sun, clouds, balls, candy, candies, sweets, teddy bears, rainbows, shooting stars, flowers, bees, butterflies, unicorns, fish, hearts, flying saucers, space rockets, snails, bows, kisses and delicious ice creams on multiple galleries.<br/><br/>The creations can be shared by WhatsApp, Instagram, Facebook, Twitter or email, among other options. The drawings can be saved in the application for editing and continue at any time.<br/><br/>The app works on both Tablets and Phones.<br/><br/>--- COLLECTIONS ---<br/><br/>• ANIMALS<br/>• PRINCESSES<br/>• HALLOWEEN<br/>• TOYS<br/>• CIRCUS<br/>• FRIENDLY MONSTERS<br/>• SPORTS<br/><br/>--- Do you like our free application? ---<br/>Help us and take a few moments to write your opinion on Google Play.<br/>Your contribution allows us to improve and develop new applications for free!.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:32:23", "background_image": "https://media.rawg.io/media/screenshots/b3c/b3c8627eadfb1b0c0b8fa3b78fa87a8b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 116, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Sunny Kid Games"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}