{"id": 233076, "slug": "fiksiki-dream-house-games-home-design-for-kids", "name": "Fiksiki Dream House Games & Home Design for Kids", "name_original": "Fiksiki Dream House Games & Home Design for Kids", "description": "Do you like house design games free? Interior design games, kids room decoration, home decorating games for children! 😍 Boy games for kids &amp; child games below 5 years!<br/><br/>Welcome to the Fixies house! It’s a fiksiki games!<br/>Design a room to your taste and share with friends! 🏡<br/><br/>🌟What you can do in kids games for girls and boys: 😃<br/>- Choose wallpaper and floor design: different colors, patterns and funny pictures for the interior design games!<br/>- Get some furniture: a sofa, a shelf, a bookcase and a table!<br/>- Don't forget electronics: TV, air conditioner, iron or even a Play Station!<br/>- Pick interior design games: pictures, books, curtains!<br/>- Explore the category of cool extra stuff: it has some surprises for you!<br/><br/>🌟Earn coins and crystals in room design games:<br/>Play funny memory games free in games for toddlers with a cool company of a dog - find pairs for all cards with food and feed the dog! You will get coins and crystals which you can spend on new furniture in your apartment games! This game is cool for everyone who is looking for dream home games!<br/><br/>🌟Visit other fixiki rooms in kids games for girls and boys and dream home games:<br/>There are many rooms in the house where other players live and play home decorating! Visit them all to view rooms and help with cleaning games for girls.<br/><br/>❗While playing memory games free, you can open new characters to play and get new furniture in toddlers games!<br/>You can choose any design for the room (even an orange floor) and place things wherever you want. The interface is colorful and easy at use so even the youngest children can play smart kids games free.<br/><br/>🌟Decorating house games for kids 10 years free: do house decoration, clean up house and play memory games for kids of 3 to 4 years in apartment games &amp; children games!<br/><br/>🌟If you want to know about more games, visit our developers page.<br/><br/>Download the educational games for children and become a true designer!<br/>✉️ Contact us: support@devgameou.com<br/>🛎 Stay tuned: https://www.facebook.com/DEVGAME.Kids<br/>💻 Our website: https://devgameou.com/", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:32:20", "background_image": "https://media.rawg.io/media/screenshots/18d/18d3f6170708ce6fc353bdca16057c83.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 192, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["DEVGAME KIDS"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}