{"id": 233084, "slug": "yasa-pets-school", "name": "Yasa Pets School", "name_original": "Yasa Pets School", "description": "It’s time for school … Pick a locker and sit next to your friends in class! Win the sports competition and celebrate with a pizza party. Then graduate with a diploma and go to the Prom!<br/><br/>Yasa Pets School is totally FREE with NO in app purchases !! <br/><br/><br/>Features include:<br/><br/><br/>* Explore a new school full of fun activities! <br/>* Help the teachers give fun lessons to their students!<br/>* Lots of cute bunnies and adorable kitties to play with!<br/>* Eat lunch in the school cafeteria sitting beside all of your friends!<br/>* Try fun experiments in the school laboratory!<br/>* Collect lots of outfits for school and sports!<br/>* Play on the school basketball and football teams!<br/>* Compete in the gymnastics competition!<br/>* Visit the principal’s office! Or visit the nurse’s office!<br/>* Unlock the HIGH SCHOOL GRADUATION by collecting STARS !!!!<br/>* Graduate with a diploma and go to the photo studio!<br/>* Get dressed up and go to prom to party with your whole class!!<br/>* Then go home and have a sleepover with friends!<br/><br/><br/>**** Remember to connect to the internet to collect the stars ****<br/><br/><br/>HIGH SCHOOL GRADUATION : Collect 6 stars to see the whole class graduate from high school!!  All of the students get a diploma and a special gown!! Hand out awards at the prizegiving!!<br/><br/>HIGH SCHOOL PROM : Take a family portrait in the photography studio!! Students get to dress in prom dresses and tuxedos for their special night! They will never forget their high school prom!<br/><br/>CLASSROOM : When the bell rings students must be at their desks before the grumpy teacher arrives! Make sure Kitties and Bunnies have done their homework and are ready for the test!<br/><br/>SCIENCE LABORATORY : Students dress in special lab coats and safety goggles when carrying out crazy experiments!!  Use the cool scientific equipment!!  Examine the amazing bugs in the specimen jars!!<br/><br/>SCHOOL CAFETERIA : After lots of studying, students line up for a delicious lunch.  The dinner lady has warm tasty meals for hungry children!  Choose between pizza, roast chicken or fish with lots of healthy vegetables and delicious cup cakes for desert!<br/><br/>SCHOOL NURSE : When a student has a tummy ache or bumps their head the school nurse will look after them in her office!  The nurse has lots of medicines and puts plasters on wounds!  She might even let students rest in the bed and watch some TV instead of going back to class!<br/><br/>SCHOOL PRINCIPAL’S OFFICE : Naughty students get sent to see the headmaster!!  The headmaster is always in his office to make sure that everyone behaves well and learns their lessons.  Better not get caught running in the corridor or you’ll find yourself in detention!!<br/><br/>SCHOOL GYM : The students love sports!!  The school gym has lots of fun games for everyone to play … choose between Basketball, Football and Gymnastics!!  There are lots of uniforms and plenty of sports equipment to use!  After the game have a hot shower in the locker room!!  Give trophies and medals to the winners!!<br/><br/>\u2028HOME : After school have a sleepover with friends from school!!  Order pizza or burgers and ice-cream to be delivered!!  Play computer games, watch TV and feed the parrots in a fancy apartment.  Then get ready for school in the morning … there is a big day of learning ahead!\u2028<br/><br/><br/>***<br/><br/><br/>Enjoy playing Yasa Pets School? Leave us a review, we love hearing from you.<br/><br/>For any other issues send us an email at support@yasapets.com<br/><br/>Privacy is an issue that we take very seriously. To learn more, please read our privacy policy : https://www.yasapets.com/privacy-policy/<br/><br/>www.youtube.com/c/YasaPets<br/>www.facebook.com/YasaPets<br/>www.instagram.com/yasapets", "metacritic": null, "released": "2018-08-25", "tba": false, "updated": "2021-01-29T04:27:42", "background_image": "https://media.rawg.io/media/screenshots/d6b/d6b0a409cee87ae5738f324a510b0bc4.jpg", "website": "https://www.yasapets.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 219, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Yasa"], "genres": ["RPG", "Educational"], "publishers": ["Yasa"], "esrb_rating": "Everyone 10+"}