{"id": 233054, "slug": "candy-monsters-match-3", "name": "Candy Monsters Match 3", "name_original": "Candy Monsters Match 3", "description": "- Puzzle and Match 3 Game<br/>- 100% FREE content<br/>- Simple and easy to play<br/>- For all ages<br/>- More than 100 challenging levels. All differents!<br/>- High quality graphics and animations<br/>- Boosts to get out of difficult situations<br/>- Fun game experience.<br/>- Multilanguage<br/><br/>Joins 3 or more monsters of the same color and use magical powers to break through hundreds of fantastic levels. But you will need your wit and talent to overcome the challenges and riddles that arise!<br/><br/>All the fun on your fingertips with the most fascinating puzzles you will ever solve!<br/><br/>Live the most incredible adventures that cross different lands, avoiding traps and solving the challenges that will increase and put to the test your way of reasoning and thinking<br/><br/>The levels have different objectives, and each one requires making the best decisions. There are levels that require you to earn many points and get stars, others collect candies, help the monsters escape from jelly or chocolates that have them trapped, even prevent the bombs from exploding.<br/>Beware of the evil monsters that will try to block the board!. You must eliminate them and reach your goal.<br/><br/>You will have a time limit or number of movements to solve the puzzle in each case.<br/><br/>All these combinations turn the game into a fun hobby with infinite possibilities. You will be presented with new challenges that you will have to solve, sharpening your concentration and wit while you have fun!.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:32:23", "background_image": "https://media.rawg.io/media/screenshots/c58/c58ae20d218d13b79921a3f445b09506.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 27, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Sunny Kid Games"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}