{"id": 233199, "slug": "garden-game-for-kids", "name": "Garden Game for Kids", "name_original": "Garden Game for Kids", "description": "Spring has finally sprung! It’s time to enjoy the flowers, vegetables and fruits. So go out and plant your favorite crops in the garden! <br/><br/>Combine business with pleasure and train your gardening skills in different sections of your garden: Vegetable Garden, Flower Shop, Greenhouse, Orchard and Garden Shed. Trade fresh goods and garden tools with customers at the marketplace and take good care of your garden.<br/><br/>• Vegetable Garden: First you have to remove grass, plant the seeds and water them to grow strawberries, lettuce, pumpkins, cauliflowers or red cabbage. Don’t forget to fix up a scarecrow to keep the birds away from your garden.<br/>• Flower Shop: Sun has finally warmed up the soil! Discover a wonder of colors and flowers at the flower section. Grow tulips, violets, roses, daisies or orchids, decorate them and make super beautiful bouquets for your customers.\t<br/>• Greenhouse: Ensure appropriate conditions for growing tomatoes, cucumbers, peppers, eggplants and peas in the greenhouse. Use organic fertilizer and wooden sticks to help your veggies grow. Then fix the broken pipes as the watering system needs some repair!<br/>• Orchard: What a delicious smell comes from apples, plums, oranges, pears and lemons! Repel moles in the mini game and sort fresh and rotten fruits in the sorting mini game. Fruit farming is pure joy for kids!\t\t<br/>• Garden Shed: Organizing a garden shed is always the most fun job! Help the kids find all the garden tools in your messy garden shed!<br/>• Farm: Enjoy beautifying your farm with stickers. Earn as many coins as possible in mini games to unlock stickers in your Farm. All the stickers are interactive with funny animations and sounds. <br/><br/>Gardener needs your help to run his cute little garden, quickly!<br/><br/>Features:<br/>• fun activities for kids<br/>• 5 different garden sections with many tools<br/>• more than 20 sorts of veggies, fruits and flowers<br/>• various tasks like harvesting, digging, watering, seeding, fertilizing<br/>• funny sounds and beautiful graphics<br/>• earning coins to unlock stickers to beautify the farm<br/><br/>This game is free to play but certain in-game items and features, also some of those mentioned in game description, may require payment via in-app purchases which cost real money. Please check your device settings for more detailed options regarding in-app purchases.<br/>The game contains advertising for Bubadu’s products or some third parties which will redirect users to our or third-party site or app.<br/><br/>Privacy policy: https://bubadu.com/privacy-policy.shtml<br/>Terms of service: https://bubadu.com/tos.shtml", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:31:59", "background_image": "https://media.rawg.io/media/screenshots/0ef/0ef4dde1f5c9cfcedcb33c0de5c0c199.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 184, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Bubadu"], "genres": ["Casual"], "publishers": [], "esrb_rating": null}