{"id": 233131, "slug": "mcf-key-to-ravenhearst-full", "name": "MCF: Key To Ravenhearst (Full)", "name_original": "MCF: Key To Ravenhearst (Full)", "description": "Unlock the complete adventure with a single purchase! No in-app purchases!<br/><br/>The word is out that someone has bought Ravenhearst Manor and is looking to rebuild it as a museum. You’ve been sent by none other than the Queen of England herself to check it out, but when you arrive it seems that the previous investigator sent there to snoop around has gone missing. Just what kind of heinous plot is going on at the new Ravenhearst?<br/><br/>• WHAT HAPPENED TO AGENT BARKER?<br/>It seems that all of the workers also vanished just after construction was completed. Were they abducted by the new owners, or is there some ghostly menace haunting the manor grounds? Watch your back, or you might be next!<br/><br/>• LOOK BEYOND THE FOG<br/>See through the mysterious shroud in a variety of twisted hidden object scenes.<br/> <br/>• CAN YOU SOLVE ALISTER’S ENIGMA BOX?<br/>Thwart the madman’s plan through cryptic puzzles and spooky mini-games<br/><br/>• REVEAL WHAT LED BENEDICT TO RAVENHEARST IN THE BONUS GAME<br/>Discover the true beginning and enjoy additional Collector’s Edition exclusives including collectible Ravens, super puzzles, morphing objects, and more!<br/><br/>• Find thousands of hidden objects, plus solve tons of mini games and puzzles!<br/>• Unlock this incredible Collector's Edition to gain access to all of the amazing bonuses and additional gameplay!<br/><br/>*** Discover more from Big Fish Games*** <br/><br/>Sign up for our newsletter and never miss a new release or promotion again: http://bigfi.sh/AndroidSplash<br/><br/>Check out our entire game library with our Big Fish Games app absolutely FREE here: http://bigfi.sh/BFGAMGoog<br/><br/>Visit Big Fish Games, a leading developer, producer, and publisher of puzzle, adventure, casual, card &amp; casino games!<br/><br/>VISIT US: www.bigfishgames.com<br/>WATCH US: www.youtube.com/bigfishgames<br/>FOLLOW US: www.twitter.com/bigfishgames<br/>TALK TO US: www.facebook.com/bigfishgames", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-31T03:09:16", "background_image": "https://media.rawg.io/media/screenshots/166/166a308ff5fbf9dab2caadc186e94205.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 393, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Big Fish Games"], "genres": ["Adventure"], "publishers": [], "esrb_rating": "Everyone 10+"}