{"id": 233128, "slug": "dangerous-games-prisoners-of-destiny-full", "name": "Dangerous Games: Prisoners of Destiny (Full)", "name_original": "Dangerous Games: Prisoners of Destiny (Full)", "description": "Unlock the complete adventure with a single purchase! No in-app purchases!<br/><br/>Escape from a beautiful and deadly world! You left the big city to seek out a new life in Brownville, Louisiana, where your friends Ben and Louise have lined up a job for you. Your new boss, Simon, seems like a friendly enough guy – he even suggests the four of you play a nice game of cards when you arrive. But it turns out that this is no ordinary game… The second you set a card down on the table, you find yourself in a strange world. As you search around your surroundings, it starts to sink in – you and your friends have become living pieces in someone's deadly game. Can you survive to the end? Find out in this gorgeous Hidden Object Adventure game! <br/><br/>• Find thousands of hidden objects, plus solve tons of mini games and puzzles!<br/>• Find clues scattered throughout the game in order to escape the deadly predicament in which you find yourself! <br/>• Get the Collector’s Edition to explore the history of the game in the bonus chapter, find collectables, and check out the beautiful concept artwork. <br/><br/>Sign up now for our newsletter and never miss a new release or great deal again: http://bigfi.sh/AndroidSplash<br/><br/>Visit Big Fish Games, a leading developer, producer, and publisher of puzzle, adventure, casual, card &amp; and casino games.<br/><br/>VISIT US:  www.bigfishgames.com<br/>WATCH US:  www.youtube.com/bigfishgames<br/>TALK TO US:  www.facebook.com/bigfishgames<br/>FOLLOW US:  www.twitter.com/bigfishgames", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-30T22:13:20", "background_image": "https://media.rawg.io/media/screenshots/b88/b88236d421d7a41288c779fe1a87c368.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 210, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Big Fish Games"], "genres": ["Casual"], "publishers": [], "esrb_rating": "Everyone 10+"}