{"id": 233176, "slug": "pixie-the-pony-my-virtual-pet", "name": "Pixie the Pony - My Virtual Pet", "name_original": "Pixie the Pony - My Virtual Pet", "description": "Take a chance to have a virtual pony that you’ve always wanted. Your pony likes running, swimming, gardening, watching beautiful butterflies and, mostly, being a part of your life! Adopt the cutest pony in the world and make your dreams come true.<br/><br/>Take care of your pet’s feeding, sleeping and health. Shower your pony under the waterfall or wash him in a lake. For a good and quiet sleep, put the pony in a stable and turn off the sun.<br/><br/>Explore pony’s green land, lake, prairie and steppe. Grow your own vegetables, cereals and fruits like carrots, wheat, apples and many more. Plant flowers to attract butterflies so you can fill all pages in your butterfly collection album. You can customize pony’s home, stable, castle and trees to create a dream world for your pony. <br/><br/>Have fun playing different mini games, like Diamond Connect, Flying Pony, Pony Jumping and Pony Racing. Earn coins to do a pony makeover and unleash your creativity. Make a rainbow unicorn, galaxy pony, fairy pony and many others. Complete as many funny quests as possible to get super shiny rewards. <br/><br/>Your cute pet needs some loving care. We promise you’ll have the best virtual pony in the world!<br/><br/>This game is free to play but certain in-game items and features, also some of those mentioned in game description, may require payment via in-app purchases which cost real money. Please check your device settings for more detailed options regarding in-app purchases.<br/>The game contains advertising for Bubadu’s products or some third parties which will redirect users to our or third-party site or app.<br/><br/>Privacy policy: https://bubadu.com/privacy-policy.shtml<br/>Terms of service: https://bubadu.com/tos.shtml", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:32:05", "background_image": "https://media.rawg.io/media/screenshots/f42/f42442bf5b2764333b124e1b21f91a9d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 175, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Bubadu"], "genres": ["Casual"], "publishers": [], "esrb_rating": null}