{"id": 233183, "slug": "pop-balloon-kids", "name": "Pop Balloon Kids", "name_original": "Pop Balloon Kids", "description": "Everyone likes balloons but popping them is even more FUN. Pop Balloon Kids is a simple yet addictive and challenging balloon popping game that offers you a lot of excitement. <br/><br/>Your goal is simple: pop as many balloons as you can in 60 seconds and try to score as many points as possible in the process. <br/><br/>There are numerous colorful balloons to pop in this game and, in addition, there are plenty of hidden toys to improve your score and a lot of different “power-up” balloons to make the game even more challenging. Many balloons contain a toy that gives you extra points if you tap on it while the “power-up” balloons either help you pop up all other balloons in the radius or they make your work even harder by spawning more new balloons.<br/><br/>Pop Balloon Kids is a simple and attractive game suitable for all ages and fun to play in any case - whether you want to just take it easy and relax, or play it seriously and test your tapping skills.<br/><br/>Features:<br/>• easy to play<br/>• beautiful HD graphics<br/>• colorful balloons<br/>• plenty of toys<br/>• lots of stunning effects<br/>• special “power-up” balloons<br/><br/>This game is free to play but certain in-game items and features, also some of those mentioned in game description, may require payment via in-app purchases which cost real money. Please check your device settings for more detailed options regarding in-app purchases.<br/>The game contains advertising for Bubadu’s products or some third parties which will redirect users to our or third-party site or app.<br/><br/>Privacy policy: https://bubadu.com/privacy-policy.shtml<br/>Terms of service: https://bubadu.com/tos.shtml", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:32:02", "background_image": "https://media.rawg.io/media/screenshots/381/381cf05e20e94615302bf76500df7073.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 55, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Bubadu"], "genres": ["Casual"], "publishers": [], "esrb_rating": null}