{"id": 233281, "slug": "santas-factory-nonograms-hd", "name": "Santa's Factory Nonograms HD", "name_original": "Santa's Factory Nonograms HD", "description": "The time of the winter holidays is at hand, and that means magic is in store for children and grown-ups alike. Families gather around the tree and table to tell stories, swap jokes and give each other gifts! <br/>The winter holidays are the most magical time of the year, when you can wrap yourself in a warm blanket and read captivating old fairytales.<br/><br/>And now, thanks to Santa’s Toy Factory Nonograms, you have the unique opportunity of visiting Santa’s workshop, meeting his elves and riding reindeer alongside them to deliver gifts!<br/><br/>New and improved controls! You won’t have to guess a solution again – the gameplay is built on logic alone! Improved, clear tutorial: choose a training level depending on your play skills. Complete only the training that you really need.<br/><br/>Develop your intellectual potential! This game is great for getting into the spirit of the winter holidays  and is suitable for everyone who loves original Japanese puzzles set in interesting locations. What could be a better addition to a happy holiday for a fan of Japanese crosswords?<br/><br/>Enjoy a happy Halloween atmosphere with classical griddlers gameplay!<br/><br/><br/>120 unique holiday puzzles!<br/>Captivating gameplay on 6 wintry locations!<br/>Santa’s Toy Factory Nonograms relaxes and trains your brain at the same time. <br/>Over 12 hours of gameplay with enchanting background music!<br/>An easy tutorial!<br/>Special tasks and more than 15 colorful trophies<br/>Nonograms in a Christmas setting", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:31:35", "background_image": "https://media.rawg.io/media/screenshots/046/0467950ff6796d6870aa66c02607f64f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 197, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["8Floor"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}