{"id": 233211, "slug": "line-drawing-physic-drop-logic-puzzle", "name": "Line Drawing Physic – Drop Logic Puzzle", "name_original": "Line Drawing Physic – Drop Logic Puzzle", "description": "A draw me physics game. Draw colorful lines &amp; let the cube drop into the cup. This casual line puzzler requires excellent precision and prediction of the movements of the cute cube. You can draw the line in any direction, however, the ultimate goal is to get the crazy cube into the basket. Sounds EASY? Believe us it is not! Especially in the later levels where you need to draw long lines.<br/><br/>💡THE ULTIMATE BRAIN TRAINING<br/><br/>Do you enjoy brain games? Want to play a unique line physic game? If you do, you should definitely try Line Drawing Physic Drop game now. This is ultimate line physic game for everyone! Draw line and make the cube drop into the cup. It is a very exciting cube drop puzzle brain game that challenges you to draw line accurately because the cube drops according to the law of physic. This custom cube puzzle will really test your senses, creativity, logic and strategy!<br/><br/>▫️ORIGINALLY CHALLENGING<br/><br/>There are various brain games out there, but to find a true challenging game is not easy. We keep innovating and creating unique games that will sharpen your brain and let you have fun at the same time. This time, we come up with a unique line physic game unlike any others. You’ll see, you’ll love the unique challenge. The puzzle drawing gameplay practically creates custom physics puzzles every time you start a new game.<br/><br/>✍️HOW GOOD ARE YOU AT LOGIC DRAWING? <br/><br/>This is the most interesting drawing you will ever do! It requires not only good drawing and precision, but also smart and logic drawing. The lines need to be smartly used and put together to create precise movement of the cube for best results.<br/><br/>👆BEST FEATURES OF LINE DRAWING PHYSIC DROP<br/><br/>• Simple rule: draw line (and sometimes colorful lines) to guide the movement of the cube<br/>• Make the cube drop into the cup<br/>• 45 challenging levels of physics puzzles<br/>• Falling gameplay<br/>• Realistic movement that follow the law of physics<br/>• Unique logic drawing challenge<br/>• Ability to unlock next level even before you’ve finished the last level. <br/>• Hours of addictive and exciting custom puzzle gaming. <br/><br/>⁉️HOW TO PLAY LINE DRAWING PHYSIC DROP GAME?<br/><br/>1. Touch and draw to draw colorful lines to guide the cube to drop into the bowl, bypassing as many stars as possible.<br/>2. The length of the lines and the types of lines you can draw are different for each level. <br/>3. Each line represents different types of movement:<br/>- Red means the cube will move upward<br/>- Green means the cube will bounce on top of it<br/>- Black means the cube will slide down<br/>4. Touch Play button to start moving the cube.<br/>5. If you’ve made a mistake, touch the Replay button to replay the level.<br/>-------------------------------------<br/>So, draw me now! Show that your mind can think and draw precisely at the same time.<br/>Play our drawing line physic game, have fun, and sharpen your brain in this thrilling brain game challenge!<br/>---<br/>Do you enjoy playing our line physic game? <br/>Show us love and support as much as possible.<br/>Thank you!", "metacritic": null, "released": null, "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/5d8/5d8efd399f783289a38cbb22db6cc49c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 40, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Laif Games"], "genres": ["Casual"], "publishers": [], "esrb_rating": "Everyone"}