{"id": 23323, "slug": "battletech", "name": "BATTLETECH", "name_original": "BATTLETECH", "description": "<p>From original BattleTech/MechWarrior creator Jordan Weisman and the developers of the award-winning Shadowrun Returns series comes the next-generation of turn-based tactical ‘Mech combat.</p>\n<p>The year is 3025 and the galaxy is trapped in a cycle of perpetual war, fought by noble houses with enormous, mechanized combat vehicles called BattleMechs. Take command of your own mercenary outfit of `Mechs and the MechWarriors that pilot them, struggling to stay afloat as you find yourself drawn into a brutal interstellar civil war. Upgrade your starfaring base of operations, negotiate mercenary contracts with feudal lords, repair and maintain your stable of aging BattleMechs, and execute devastating combat tactics to defeat your enemies on the battlefield.</p>\n<h2>Game features:</h2>\n<ul>\n<li>COMMAND A SQUAD OF `MECHS IN TURN-BASED COMBAT: Deploy over 30 BattleMechs in a wide variety of combinations. Use terrain, positioning, weapon selection and special abilities to outmaneuver and outplay your opponents.  </li>\n<li>MANAGE YOUR MERCENARY COMPANY: Recruit, customize, and develop unique MechWarriors. Improve and customize your dropship. Oversee your team of technicians, engineers, and support personnel.  </li>\n<li>TAKE PART IN A DESPERATE CIVIL WAR: Immerse yourself in the story of a violently deposed ruler, waging a brutal war to take back her throne with the support of your ragtag mercenary company… should you choose to provide it.  </li>\n<li>CUSTOMIZE YOUR `MECHS: Use your MechLab to maintain and upgrade your units, replacing damaged weapon systems with battlefield salvage taken from fallen foes.  </li>\n<li>FIGHT YOUR WAY ACROSS THE PERIPHERY: As a Mercenary, travel a wide stretch of space, taking all kinds of missions and managing your reputation with a variety of noble houses and local factions.  </li>\n<li>PVP MULTIPLAYER &amp; SKIRMISH MODE: Customize a Lance of ‘Mechs and MechWarriors to go head-to-head with your friends, compete against match-made opponents online, or jump into single-player skirmish mode to test your strategies against the AI.</li>\n</ul>", "metacritic": 78, "released": "2018-04-23", "tba": false, "updated": "2024-02-15T16:46:22", "background_image": "https://media.rawg.io/media/games/fe7/fe774427b11e2a808a1aacf1a32213ed.jpg", "website": "http://harebrained-schemes.com/battletech/", "rating": 3.58, "rating_top": 4, "added_by_status": {"yet": 122, "owned": 1392, "beaten": 29, "toplay": 60, "dropped": 62, "playing": 20}, "playtime": 4, "achievements_count": 88, "ratings_count": 158, "suggestions_count": 329, "game_series_count": 0, "reviews_count": 163, "platforms": ["PC", "Linux", "macOS"], "developers": ["Harebrained Schemes"], "genres": ["Action", "Adventure", "Strategy"], "publishers": ["Paradox Interactive"], "esrb_rating": null}