{"id": 233201, "slug": "ice-candy-kids-cooking-game", "name": "Ice Candy Kids - Cooking Game", "name_original": "Ice Candy Kids - Cooking Game", "description": "This ice pop candy maker is a simple and fun casual game appropriate for everyone. Boys and girls would enjoy enormously while making and decorating their masterpieces and then sharing them with their loved ones.  <br/><br/>You can select various shapes and mix colorful flavors for your popsicles, and that is going to be a mouth watering experience. You can also choose between many different sticks, glazings, toppings, toys and other elements to beautify your sweet and cold creations. <br/><br/>At the end, you can eat your ice cream, solve a slide puzzle or play a diving minigame to unlock special locked elements. <br/><br/>Features:<br/>★ beautiful high quality HD graphics<br/>★ intuitive, easy to use interface with draggable items for better positioning<br/>★ infinite gameplay with unlimited combinations<br/>★ 16 different shapes to choose from<br/>★ 8 flavors of ice candy in various colors<br/>★ lots of different sticks, glazings, toppings, candies, sprinkles, crumbs and interactive toys<br/>★ diving minigame (earn coins to unlock locked items)<br/>★ slide puzzle minigame<br/><br/>This ice pop cooking game is appropriate for babies, toddlers, children, and adults who like making, decorating, serving, or just eating ice candies.<br/><br/>This game is free to play but certain in-game items and features, also some of those mentioned in game description, may require payment via in-app purchases which cost real money. Please check your device settings for more detailed options regarding in-app purchases.<br/>The game contains advertising for Bubadu’s products or some third parties which will redirect users to our or third-party site or app.<br/><br/>Privacy policy: https://bubadu.com/privacy-policy.shtml<br/>Terms of service: https://bubadu.com/tos.shtml", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:31:58", "background_image": "https://media.rawg.io/media/screenshots/c3b/c3be8268d97464c085ca5c5c5ecda9a7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 71, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Bubadu"], "genres": ["Casual"], "publishers": [], "esrb_rating": null}