{"id": 233344, "slug": "santa-girl-run-xmas-advent", "name": "Santa Girl Run Xmas & Advent", "name_original": "Santa Girl Run Xmas & Advent", "description": "Santa girl is helping out Santa Claus with his present deliveries but she has gotten into some trouble with an angry watch dog that is chasing her through the whole city. Your task will be, to not let her be caught from the nasty dog so that she can go back to her work.<br/>Rush through icy cities, small villages, over big bridges and gather all the coins you can. <br/>While running, avoid hitting trucks, cars, buses or any other object that could either slow you down or stop you. Collect all the fun power ups to get further and to give the tireless dog the slip.<br/>Forget the subway stations, temple and jungles - the world run of Santa Girl Run Xmas &amp; Advent await you! <br/><br/>Santa Girl Run Xmas &amp; Advent is one of the 841 best free 3D running games! If you love running games, xmas games, girl games, christmas games, funny games or santa games then you will love the free and cool Santa Girl Run Xmas &amp; Advent game. Try it out and download Santa Girl Run Xmas &amp; Advent now!<br/><br/>How to play Santa Girl Run Xmas &amp; Advent:<br/>- Drag/swipe to jump or slide/sub and to move left or right<br/>- The power ups are activated automatically when you get them<br/>- Buy new characters and upgrade power ups with the collected coins<br/>- Try to dash so fast that you can smash the sonic wall ;-)<br/><br/>Features of Santa Girl Run Xmas &amp; Advent: <br/>- 9 gorgeous girls to choose<br/>- 3 Special Santa helpers to conquer by collecting robots<br/>- 2 run play mode: levels and infinite<br/>- Cartoon like environment<br/>- Amazing power-ups: coin magnet, rocket, super go cart, jetpack etc. <br/>- Trucks, cars and buses to avoid!<br/>- Lots of obstacles to dodge<br/>- Cool music<br/><br/>Special power- ups<br/>- The rocket will make you fly at top speed over the obstacles and give you the opportunity to collect a lot of coins.<br/>- The Go kart will makes you faster which will require all of your dodging abilities to not crush against something. If you hit something with the kart you will only lose the vehicle but still keep running. <br/><br/>If you like Santa Girl Run Xmas &amp; Advent, please rate it with 5 stars.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:31:07", "background_image": "https://media.rawg.io/media/screenshots/5a6/5a6ba424ec449769ef7c594d20c48cd7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 189, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Wonderful Games"], "genres": ["Action"], "publishers": [], "esrb_rating": null}