{"id": 233323, "slug": "halloween-talking-scary-zombie", "name": "Halloween Talking Scary Zombie", "name_original": "Halloween Talking Scary Zombie", "description": "Talk to the scary monsters and they will repeat all you say with their dreadful voices. Touch them to see how they will react. Shoot the werewolf, monster and walking dead down before they get to close to you. Use special sounds to make them freak out and dance. Additionally it contains a lot of exciting inside games with many levels to play!<br/><br/>Features:<br/>✔ High quality 3D graphics<br/>✔ Voice interaction<br/>✔ Many different animations like dancing, going crazy, killer instinct, farting etc.<br/>✔ Different weapons like shot gun, machine guns, uzi, etc.<br/><br/><br/>Extra content and games:<br/>★ Monster shooter: Shoot the dragons, zombies and the werewolf’s down with the different color bubbles.<br/><br/>★ Pumpkins throw: Hit the spinning targets with pumpkins without hitting the chained wolf man.\t<br/><br/>★ Fruit Match: Match up(slide) at least 3 same looking fruits in a row to remove them from the grid<br/><br/>★ Sliding puzzle: Touch and slide the pieces of the puzzle where they belong to recreate the original image.<br/><br/>★ Pairs: Find the same looking images on the board and train your memory with this cool match-2 game. <br/><br/>★ Different  match-3 fall games: touch where at least 3 same looking objects are fallen to score point and empty the quickly filling space.<br/><br/>★ Many other funny games are waiting for you <br/><br/>Enjoy hours of fun and laughter with this free virtual zombie app!<br/><br/>Speak with the talking zombies touch and shoot them down before they go crazy.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:31:14", "background_image": "https://media.rawg.io/media/screenshots/ec0/ec07a9ca149e9a5cf844debdb630deb0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 298, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Wonderful Games"], "genres": ["Casual"], "publishers": [], "esrb_rating": null}