{"id": 233325, "slug": "cat-race-car-extreme-driving", "name": "Cat Race Car Extreme Driving", "name_original": "Cat Race Car Extreme Driving", "description": "Seat behind the driving wheel with Leo Catomy the crazy cat and begin a wild racing adventure. Choose one of the amazing car models and storm into the stunt arenas. Drive around and learn how to handle the vehicles physics that causes it to bounce, drift, and tire slip realistically. Rush through fire rings, loops, jump over ramps or canyons and avoid a lot of obstacles to show your driving skills to everybody. <br/>Collect the required coins to accomplish the different missions and to unlock new amazing levels.<br/><br/><br/>If you like cat games, car racing games, freestyle games, car games, drifting games, driving games, 4x4 games, stunt games or race car games in general, then you will love Cat Race Car Extreme Driving! Enjoy hours of fun and laughter with Cat Race Car Extreme Driving! If you like Cat Race Car Extreme Driving then please rate Leo Catomy with 5 stars. Thank you!<br/><br/>Features of Cat Race Car Extreme Driving:<br/>- Wonderful 3D cartoon graphics<br/>- Amazing stunt arenas<br/>- Volcano, ice, grass and earth terrain<br/>- Simple controls<br/>- Turbo boosts<br/>- Extra time chronograph<br/>- Choose vehicles like buggy, jeep and racing car<br/>- Nice background music<br/><br/>How to Play Cat Race Car Extreme Driving:<br/>- Use the tilt control to move the car in the direction you want or choose the steering wheel from the menu.<br/>- Press on the accelerator to give power to the engine and move forward<br/>- Use the brake to curb, slow down or to move backwards<br/>Rush through the stunt arena, collect as much golden coins as you can to establish a new record (best score).<br/><br/>What are you waiting for? Speed through terrifying loops and Jump over thrilling obstacles!<br/><br/>If you search for funny cat games for girls, crazy cat games for boys or best cat games for kids then Cat Race Car Extreme Driving is the right game for you!<br/><br/>Try it out and play Cat Race Car Extreme Driving now!", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:31:14", "background_image": "https://media.rawg.io/media/screenshots/f77/f77a487d14aaa016b91ef71446238fc6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 265, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Wonderful Games"], "genres": ["Racing"], "publishers": [], "esrb_rating": null}