{"id": 233308, "slug": "super-hero-cat-run", "name": "Super Hero Cat Run", "name_original": "Super Hero Cat Run", "description": "Super Hero Cat Run is a free pets runner game with subway and other running theme. Choose your favorite super hero cat and dash your way in the different cities. Run, dodge, jump, and slide into an incredible chasing adventure. <br/><br/>While running, avoid hitting trucks, cars, buses or any other object that could either slow you down or stop you. Collect all the gold coins and the fun power ups to get further and to give the tireless dog the slip. Start your way, run as fast as you can to escape from Tom the angry dog. <br/><br/>Super Hero Cat Run is one of the most exciting and free running games! If you love running games or cat games, then you will love the free and cool Super Hero Cat Run game. Try it out and download Super Hero Cat Run now!<br/><br/>The super hero cats have different forces and powers which you can use. One super hero cat has a hammer and can destroy cars, another one has the power to levitate trucks, one has the flash power and there are many more super hero forces like spider, mutant etc which you can use.<br/><br/>How to play:<br/>- Drag/swipe to jump or slide and to move left or right<br/>- The power ups are activated automatically when you get them<br/>- Buy new characters and upgrade power ups with the collected gold coins<br/>- Try to dash so fast that you can smash the sonic wall ;-)<br/><br/>Features:<br/>- Different Super Hero Cats including the talking super hero cat Leo and Lea the princess cat as ninja cat<br/>- 2 run play mode: levels and infinite<br/>- Cartoon like environment with Lea Catomy<br/>- Amazing power-ups: gold coin magnet, rocket, go kart, etc.<br/>- Trucks, cars and buses to avoid!<br/>- Lots of obstacles to dodge<br/>- Cool music<br/>- Fun cat run<br/><br/>If you like Super Hero Cat Run, please rate it with 5 stars on the store and invite your friends to join the pet race. Download Super Hero Cat Run now!", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:31:22", "background_image": "https://media.rawg.io/media/screenshots/8b4/8b4db30b08e9b546eee0cd90b23b91a6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 168, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Wonderful Games"], "genres": ["Casual"], "publishers": [], "esrb_rating": null}