{"id": 233337, "slug": "cat-race-car-snow-drift-stunts", "name": "Cat Race Car Snow Drift Stunts", "name_original": "Cat Race Car Snow Drift Stunts", "description": "Sit behind the driving wheel of an amazing car with Leo Catomy the crazy cat and begin an incredible racing adventure in a frozen environment. Choose one of the amazing car models and storm into the stunt arenas. Drive around and learn how to handle the vehicles physics that causes it to bounce, drift, and tire slip realistically. Rush through fire rings, loops, jump over ramps or canyons and avoid a lot of obstacles to show your exceptional driving skills to everybody. <br/>Collect all the Christmas presents that Santa Claus has left behind for him and use them to unlock new amazing levels or buy new powerful cars.<br/><br/>If you like car racing games, winter games, freestyle games, car games, drifting games, driving games, ice racing games, stunt games or race car games in general, then you will love Cat Race Car Snow Drift Stunts! Enjoy hours of fun and laughter with Cat Race Car Snow Drift Stunts! If you like Cat Race Car Snow Drift Stunts then please rate it with 5 stars. Thank you!<br/><br/>Features of Cat Race Car Snow Drift Stunts:<br/>- Wonderful 3D cartoon graphics<br/>- Amazing stunt arenas<br/>- Breathtaking landscapes<br/>- Simple controls<br/>- Turbo boosts<br/>- Extra time chronograph<br/>- Choose crawler vehicles like buggy, jeep and racing car<br/>- A lot of trucks - choose your monstertruck - super monster truck<br/>- Nice background music<br/><br/>How to Play Cat Race Car Snow Drift Stunts:<br/>- Use the tilt control to move the car in the direction you want or choose the steering wheel from the menu.<br/>- Press on the accelerator to give power to the engine and move forward<br/>- Use the brake to curb, slow down or to move backwards<br/>Rush through the stunt arena, collect as much gifts as you can to establish a new record (best score).<br/><br/>What are you waiting for? Speed through terrifying loops and jump over thrilling obstacles with Leo Catomy!<br/><br/>If you search for funny cat games for girls, crazy cat games for boys or best cat games for kids then Cat Race Car Snow Drift Stunts is the right game for you! <br/><br/>Download Cat Race Car Snow Drift Stunts now and have big fun with Leo Catomy!", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:31:09", "background_image": "https://media.rawg.io/media/screenshots/d53/d539b65a6b2a64003894adcb01b448e6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 153, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Wonderful Games"], "genres": ["Racing"], "publishers": [], "esrb_rating": null}