{"id": 233367, "slug": "princess-where-is-my-diamond", "name": "Princess: Where Is My Diamond?", "name_original": "Princess: Where Is My Diamond?", "description": "Enter the dream of the beautiful Princess.<br/>The princess has fallen asleep and just started dreaming about having a lot of precious diamonds to create new amazing jewelry for her public appearances.<br/>The only problem is that the diamonds to create her jewelry are still trapped in a cave in some sort of magic labyrinth. <br/>It will be your tasks to unblock the gems and make them roll down into the castle in order to make the princess dream have a happy end.<br/><br/>Each level is a challenging physics based puzzle game and each level requires skills, fantasy and big logic to be solved.<br/><br/>How to play: Use your finger to cut through the rock and make the precious jewels flow into strategic places to open a path and make them fall towards the castle.  <br/><br/>Use the TNT boxes to blast the rock away and open a path where the stone is too hard to get through.<br/><br/>Advice: There are some magic tornados that will teleport the gems to another place. Choose your moves carefully as it is not always an advantage to use them. <br/><br/>If you would like to get 3 stars and reach a higher score you will have to collect all three of them, before the diamonds reach the castle.<br/><br/>★★★ Features: ★★★<br/>✔ High quality 3D graphics<br/>✔ Many puzzles for you to enjoy <br/>✔ Challenging physics game play<br/>✔ Many levels to be played<br/>✔ Background music and sounds<br/> <br/>This is a free application. Download it and please rate it with 5 stars if you like it.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:30:59", "background_image": "https://media.rawg.io/media/screenshots/ecb/ecb657094904fc10df31617000ff9f30.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 226, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Wonderful Games"], "genres": ["Casual"], "publishers": [], "esrb_rating": null}