{"id": 233305, "slug": "halloween-cat-theme-park-3d", "name": "Halloween Cat Theme Park 3D", "name_original": "Halloween Cat Theme Park 3D", "description": "Join Leo Catomy the cat at the Halloween theme park and check out all the marvelous attractions.<br/>Enter the theme park island by night where the curious Cat is waiting for you in order to discover all the marvelous attractions.<br/>Walk the Cat around the illuminated pumpkin park in order to reach the different attractions. Take a ride on the bumper cars, on the breathtaking rollercoaster, the nostalgic pirates ships or the elevator fall and many other marvelous attractions.<br/>If you should feel a little bit tired you can enjoy the view from unmissable ferris wheel.  <br/>What are you waiting for? Join the fun!<br/> <br/>If you like halloween games, scary games, cat simulator, amusement park games, theme park games or animal games in general then you will love Halloween Cat Theme Park 3D! Enjoy hours of fun and laughter with Halloween Cat Theme Park 3D! If you like Halloween Cat Theme Park 3D then please rate Leo Catomy with 5 stars. Thank you!<br/> <br/>- - - Features of Halloween Cat Theme Park 3D: - - -<br/>✔ High quality 3D video graphics<br/>✔ One finger control joystick<br/>✔ Cool mini games like, match-3, air hockey, robot shooter, unblock puzzle etc.<br/>✔ Background music and sounds<br/>✔ Fun for the whole family with Leo Catomy<br/><br/>The fun game Halloween Cat Theme Park 3D is a free application. Download Halloween Cat Theme Park 3D now and have big fun!", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:31:24", "background_image": "https://media.rawg.io/media/screenshots/c98/c9832bb5453607e66e43063c5206b817.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 119, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Wonderful Games"], "genres": ["Casual"], "publishers": [], "esrb_rating": null}