{"id": 233306, "slug": "cat-leo-run-talking-cat-leo-vs-dog", "name": "Cat Leo Run - Talking Cat Leo vs. Dog", "name_original": "Cat Leo Run - Talking Cat Leo vs. Dog", "description": "Run, dodge, jump, and slide into an incredible pet adventure. <br/>Leo Catomy is a brave and spiteful cat that as the habit of getting himself in trouble.  Your task will be to make him escape from the angry dog.<br/>Rush through crowded cities, small villages, over big bridges and gather all the coins you can. <br/>While running, avoid hitting trucks, cars, buses or any other object that could either slow you down or stop you. Collect all the fun power ups to get further and to give the tireless dog the slip.<br/>Forget the subway stations, temple and jungles - the world run of Cat Leo Run  await you! <br/><br/>Cat Leo Run is one of the 841 best free 3D running games! If you love running games, cat games, funny games or cat simulator games then you will love the free and cool Cat Subway Run game. <br/><br/>How to play Cat Leo Run :<br/>- Drag/swipe to jump or slide/sub down to move down and swipe left/right to move left or right<br/>- The power ups are activated automatically when you get them<br/>- Buy new characters and upgrade power ups with the collected coins<br/>- Try to dash so fast that you can smash the sonic wall ;-)<br/><br/>Features:<br/>- 9 Lovely cats to choose - for example cat Lea or Leo well known from Talking Cat Leo or Cat Theme Park<br/>- 2 run play mode: levels and infinite<br/>- Cartoon like environment with Leo Catomy<br/>- Amazing power-ups: coin magnet, rocket, super go kart, jetpack, etc.<br/>- Trucks, cars and buses to avoid!<br/>- Lots of obstacles to dodge or sub<br/>- Dancing Girl and the despicable Tom the thief who will steal your collected coins<br/>- Cool music<br/>- Quality from Wonderful Gamesag<br/><br/>Special power- ups:<br/><br/>- The rocket will make you fly at top speed over the obstacles and give you the opportunity to collect a lot of coins.<br/><br/>- The Go kart will makes you faster which will require all of your dodging abilities to not crush against something. If you hit something with the kart you will only lose the vehicle but still keep running. <br/><br/>- The super spring sneaker gives you the ability to make mega jumps and escape dangerous situations for some seconds. <br/><br/>You can buy stronger sport cars and replace the go-kart with the collected gold coins.<br/><br/>This funny app with Leo Catomy has been created by Wonderful Gamesag.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:31:23", "background_image": "https://media.rawg.io/media/screenshots/2cf/2cf89fca771114cd1a6b53e5e2448fd3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 175, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Wonderful Games"], "genres": ["Arcade"], "publishers": [], "esrb_rating": null}