{"id": 233310, "slug": "talking-cat-leo-virtual-pet", "name": "Talking Cat Leo: Virtual Pet", "name_original": "Talking Cat Leo: Virtual Pet", "description": "Meet Leo Catomy the talking stray cat. Talking Cat Leo is a fun little virtual pet that responds to your touch and repeats everything you say with his own hilarious voice. You can pet him, poke him pull his ears, play with his collar and much more. Leo loves to play and has got some cool games he cannot wait to play with you!<br/><br/>If you like talking animals games like talking dog, cat simulator, funny games, fun games or animal games in general then you will love Talking Cat Leo!<br/><br/>Features:<br/>- Funny Games - Fun Games - Crazy Games - Gamesag<br/>- High quality 3D graphics<br/>- Just talk to Leo Catomy: Speak and he repeats what you say in his own funny voice.<br/>- Play with Leo Catomy: Basketball, Soccer, and an exciting cooking game.<br/>- Customize / dress up: fur color change, sun glasses, new clothes, new outfits, caps and more.<br/>- Take care of him: wash him, bring him to sleep etc.<br/>- Over 20 engaging mini games to be played: Joe bounce, match-3 games, puzzles etc. <br/>- Earn coins: Get special achievements for playing with Leo and the different funny games.<br/>- Play football/soccer against the cat Babsy<br/>- Quality product from Wonderful Gamesag<br/><br/>If you search for funny cat games, crazy cat games or best cat games, then Talking Cat Leo is the right game for you!<br/><br/>Talking Cat Leo is a free application. Download Talking Cat Leo now and please rate it with 5 stars if you like it.<br/><br/>This funny app with Leo Catomy has been created by Wonderful Gamesag.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:31:20", "background_image": "https://media.rawg.io/media/screenshots/551/551da8f0d29fe2fda7e07086d5bdd8fb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 232, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Wonderful Games"], "genres": ["Casual"], "publishers": [], "esrb_rating": null}