{"id": 233313, "slug": "talking-cat-leo-halloween-fun", "name": "Talking Cat Leo Halloween Fun", "name_original": "Talking Cat Leo Halloween Fun", "description": "Meet Leo Catomy the talking stray cat in perfect Halloween mood. Leo is a fun virtual pet that responds to your touch and repeats everything you say with his own hilarious voice. You can pet him, poke him, pull his ears, play with his collar and much more. Leo loves to play and has got some cool games he can barely wait to play with you!<br/><br/>If you like talking animals games like talking cat, halloween games, scary games, cat simulator or animal games in general then you will love Talking Cat Leo Halloween Fun! Enjoy hours of fun and laughter with Talking Cat Leo Halloween Fun! If you like Talking Cat Leo Halloween Fun then please rate it with 5 stars. Thank you!<br/><br/>Features of Talking Cat Leo Halloween Fun:<br/>- High quality 3D graphics<br/>- Talk to Leo Catomy: Speak and he repeats what you say in his own funny voice.<br/>- Play with Leo Catomy: Basketball, Soccer, an exciting cooking game., etc.<br/>- Customize / dress up: fur color change, sun glasses, new scary clothes, new outfits, caps and more.<br/>- Take care of him: wash him, bring him to sleep etc.<br/>- Engaging mini games to be played: Joe bounce, match-3 games, puzzles etc. <br/>- Earn coins: Get special achievements for playing with Leo and the different games.<br/><br/>The fun game Talking Cat Leo Halloween Fun is a free application. Download Talking Cat Leo Halloween Fun now and have fun!", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:31:18", "background_image": "https://media.rawg.io/media/screenshots/5c5/5c59b5c83f0c2922a77022df29ba0e96.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 273, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Wonderful Games"], "genres": ["Casual"], "publishers": [], "esrb_rating": null}