{"id": 233359, "slug": "cat-leos-bakery-kitchen-game", "name": "Cat Leo's Bakery Kitchen Game", "name_original": "Cat Leo's Bakery Kitchen Game", "description": "Enter the delicious pastry shop of Leo Catomy the cat.<br/>Cook and bake delicious cakes, pastries and desserts and serve all your hungry customers in this free addictive time-management game! <br/>Serve your customers always as quick as possible to make them feel happy and to get good reviews for your shop.<br/>Remember that if you collect to many bad reviews from your customers your shop will be closed down. Therefore serve your customer always before time runs out.<br/><br/>Features:<br/>- Cool graphics<br/>- Many exciting levels to play<br/>- Match at least 3 pastries<br/>- Special objects<br/>- Kids friendly content with Leo Catomy<br/><br/>How to play: Serve Leo Catomy's customers the sweets they want in the shortest time possible.<br/>You will need to connect at least 3 sweets to get an order done. To get more points or activate a combo you need to connect as many sweets as possible and serve them to his sometimes crazy customers.<br/><br/>You can get some special items that will help you run your shop better, like:<br/><br/>The Hammer, to renovate the shop<br/>The Gingerbread will unlock new sorts of cookies<br/>The smile will make your visitors patience increase limiting the bad reviews.<br/>Time Freeze and many other helpful items can be unlocked<br/><br/>What are you waiting for? Join Leo Catomy the cat and his special clients in this amazing cooking game.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:31:03", "background_image": "https://media.rawg.io/media/screenshots/836/8361a3ea02ed39a053c7c749c9327bf8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 90, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Wonderful Games"], "genres": ["Casual"], "publishers": [], "esrb_rating": null}