{"id": 233498, "slug": "airport-airlines-manager", "name": "Airport & Airlines Manager", "name_original": "Airport & Airlines Manager", "description": "Have you ever wondered what goes on behind the scenes at the airport? With Airport &amp; Airlines Manager we show you just what goes on inside a busy airport in this fun and friendly simulation game!<br/><br/>You'll learn how to manage every aspect of an airport and run an airline through the day to day jobs that keep our airports busy as bees!<br/><br/>There's lots to do, so let's get started!<br/><br/>Visa Checkpoint<br/>Working in the Visa Checkpoint is a very important job, you’ll have to make sure every passenger who comes through gets the right Visa stamp. Check which country they’ve come from before you stamp their passports!<br/><br/>Security Checkpoint<br/>Once all the passenger’s Visas have been cleared, it’s time to get them through security. Bags on the right, passengers on the left! Send them through the security gates one at a time and remember, if the alarm goes off, you’ll have to make sure that all metal items are placed inside the tray before they can go through the scanner again!<br/><br/>Simulation<br/>In the simulator, you’ll be taking on the role of the pilot, getting the plane ready for flight! Plot a course, turn on all the engines and get the plane up in the air. Woohoo! The thrill of flying never gets old, even when you never leave the ground! So real! Train to fly just like a real jet pilot!<br/><br/>Painting<br/>It’s not all stress and strain in the airport, there’s always time for some rest and relaxation. How about a spot of painting to take your mind off things? Paint while you’re up in the air if you don’t like all that turbulence, or down on the ground if waiting for your flight gets you easily bored!<br/><br/>Control Tower<br/>Did you know that one of the hardest jobs in an airport is up in the tower? This is where the air traffic controllers have to make sure every plane takes off and lands at the right time, in the right order, on the right runway. One mistake and it could all go wrong! Do you think you can beat our Control Tower game? Select the right planes for the right hangars – it’s a tough challenge but we know you can do it!<br/><br/><br/>Lost &amp; Found<br/>In a busy airport, with millions pf passengers coming and going every year, it’s easy to lose things. And that’s why the Lost &amp; Found is always busy, with passengers looking for all kinds of personal items they’ve lost along the way. Help all our passengers find their lost things and make them happy again!<br/><br/>Cabin<br/>If you’ve ever stayed on a plane until after all the passengers have left, you’ll know just how dirty the cabin can get. The crew have to clean it up as quick as they can – they’re on a tight timeframe and need the plane ready for the next set of passengers so that the pilot can take off on time! It’s your job to clean up the mess. Get everything in the garbage can, then get your scrubbing gloves on because this is going to need a deep clean like only a professional can!<br/><br/>Hangar<br/>Over in the hangar is where we look after the planes. We wash them and polish them, pump up their tyres, and check them for any dangers – every plane needs to be in tip top condition before we can let them go out on to the runways!<br/><br/>It's all in a days work for a busy airline, and all in a days work for an Airport &amp; Airline Manager!<br/><br/>Have fun with BATOKI !", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:30:32", "background_image": "https://media.rawg.io/media/screenshots/c38/c38e6e449079994af2b49bced2c41ca3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 197, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["BATOKI - Best Apps for Toddlers and Kids"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}