{"id": 233514, "slug": "the-pizza-shop-cafe-and-restaurant", "name": "The Pizza Shop - Cafe and Restaurant", "name_original": "The Pizza Shop - Cafe and Restaurant", "description": "Do you love pizza? We do! <br/>The Pizza Shop - Café and Restaurant is a game made for pizza lovers the world over that lets everyone enjoy the fun and thrill of running your very own pizza shop!<br/><br/>The shop’s right here, ready and waiting for you to take over, come inside and get started today!<br/><br/>First things first, every good pizza restaurant should be clean and tidy. This one’s a mess, better get that vacuum out and clean up! <br/><br/>Excellent, all clean and ready for service. But wait, some of these pizzas are out of date, we can’t sell those! We need to replace the old ones with tasty, fresh pizza straight from the oven! First, we throw out all the nasty old ones, and then you get to decide which pizzas to put up on the counter in pride of place!<br/><br/>Now we’re ready to clean those windows – if your customers can see your delicious pizzas through the window, they’re guaranteed to come through the door and chose a mouth-watering pizza slice for themselves! First, we get some window cleaner on the glass, then we get the sponge out and rub it all over, then – pow! – we clean it up till it sparkles!<br/><br/>Success! Your first customer! It must be the sight of those delicious fresh pizzas through that wonderfully clean window! Take their order and go make that pizza! It doesn’t matter what topping they want, we’ve got them covered! <br/><br/>Get all your ingredients ready and then we can prepare our special pizza dough. A little flour, egg, milk and olive oil, add a splash of water and mix It all together. Time to get your hands in there and knead that dough good and proper!<br/><br/>Then it’s ready for the magic to begin! Roll it out with your rolling pin – it’s super stretchy so it won’t tear but it is sticky! When it’s the right thickness and size we can roll some little dents in it, make it ready for the sauce! Now here’s a little secret you might not know about, if you brush a little egg onto your pizza base, it will really help your pizza taste like it was made in a real pizza store!<br/><br/>Pop the pizza base into the oven and give it a little cook before we add those toppings – another little secret!<br/><br/>Got your toppings on? Okay, let’s get this delicious 1st pizza back in the oven and cook it to perfection!<br/><br/>Serve your first pizza to your fist customer and get ready for more! We make all kinds of pizzas in our pizza shop, even fruit ones! If they order it, we make it!<br/><br/>But it doesn’t end there for a pizza shop manager, you still have to clean up after every customer, make it perfect for your next guest and they’ll come back time and time again!<br/>It’s lots of fun in Pizza Shop Chef and Restaurant, where anyone and everyone can be the proud owner of their very own pizza store!<br/><br/>Have fun with BATOKI !", "metacritic": null, "released": null, "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/5e0/5e0e1770e806b5ccf817b02f5d84dee3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 184, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["BATOKI - Best Apps for Toddlers and Kids"], "genres": ["Educational"], "publishers": [], "esrb_rating": "Everyone"}