{"id": 23350, "slug": "phantom-dust", "name": "Phantom Dust", "name_original": "Phantom Dust", "description": "<p>Phantom Dust for Xbox One and Windows 10 PC is a re-release of the original Xbox classic, now returning with full Xbox LIVE support and a host of enhancements, including Xbox Play Anywhere, cross-device multiplayer, achievements, and 16x9 presentation. It features new gameplay enhancements including multiplayer starter decks that let you jump straight into multiplayer, improved frame rate, and adjustments to overall game balance. Experience the cult classic that’s kept a passionate community playing to this day and a unique multiplayer experience that’s never been duplicated.<br />\nPhantom Dust is a blend of third-person arena combat and collectable card game. Collect 300 unique skills and build your arsenal of powers, taking them into battle online with up to three other players. You’ll compete in highly-destructible arenas and unleash a wide array of powers and tactics to defeat your enemies, including orbital particle cannons, flaming swords, barriers of ice, flight, cloaking, attack reflection, and many other abilities.<br />\nThe game features over 15 hours of solo player content through an engaging story that explores the ideas of isolation and faith, and full Xbox Live multiplayer support for up to four players in a variety of match types.<br />\nPhotosensitive seizure warning [http://support.xbox.com/en-US/xbox-one/console/photosensitive-seizure-warning]</p>", "metacritic": null, "released": "2005-03-15", "tba": false, "updated": "2024-02-13T17:42:43", "background_image": "https://media.rawg.io/media/games/617/6178046e51bf80b87572d24fbde5c629.jpg", "website": "", "rating": 3.22, "rating_top": 3, "added_by_status": {"yet": 14, "owned": 93, "beaten": 1, "toplay": 2, "dropped": 13, "playing": 1}, "playtime": 0, "achievements_count": 45, "ratings_count": 17, "suggestions_count": 472, "game_series_count": 0, "reviews_count": 18, "platforms": ["Xbox", "Xbox One", "PC"], "developers": ["Microsoft Game Studios", "Majesco Entertainment Company"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": "Teen"}