{"id": 233508, "slug": "babysitter-newborn-baby-care", "name": "Babysitter Newborn Baby Care", "name_original": "Babysitter Newborn Baby Care", "description": "Hi there, babysitter! Are you ready to look after our newborn baby? She's a lot of fun and super cute! You'll have lots of fun with the cutest baby in Babysitter Newborn Baby Care! <br/><br/>Now while we're away you're in charge. There's a few things you need to know:<br/><br/>Baby needs lots of sleep, plenty of food and drink, a clean diaper and playtime! But you're a babysitter - you knew all this already, right?<br/><br/>Well, she's just woken up and we're ready to leave, so good luck!<br/><br/>Now baby's awake, it's time to change her diaper. Lay her down on the changing mat and let's take off that dirty diaper. Yuck! How does someone so adorable and cuddly make such a pong!? Clean her all up with a nice fresh wipe and then put on a clean diaper. There! Baby's all done and no more tears!<br/><br/>Ooh, but baby still looks a little grouchy - she must be hungry. Don't worry, kid, we've got lots of yummy foods to eat. Shall we have a bottle first or some yoghurt? Maybe a slice of fruit? Baby looks really hungry... Spaghetti time!<br/><br/>Baby can't feed herself, that's the babysitter's job. Grab the fork and scoop up some of that wriggly spaghetti. Here comes the train, into the tunnel... Yum, yum, yum!<br/><br/>How about some creamy yoghurt? Cool and refreshing. Onto the spoon and in it goes! Oops, baby's a little messy, we could use a clean wipe right now.<br/><br/>Spoon the formula into baby's bottle and mix it all up - wow! baby drank it up all in one go!<br/><br/>A slice of orange for desert - so sweet it makes baby's eyes water!<br/><br/>Diaper changed? Check! Baby fed? Check! It must time for play!<br/><br/>What will baby want to play with today? Will it be the airplane? No, that makes baby cry. How about the robot! Oh dear, baby's still not very happy. Does baby want to cuddle the plush pony? Not today! Baby wants the rattle today. Such a noisy rattle, baby! Crash, bang, rat-a-tat-tat! <br/><br/>It's been a long day for baby and babysitter, time for some well-earned sleep. Put baby in her cradle and soothe her with some gentle stroking, then pull up the sheets and tuck her in. Down with the blinds and rock the cradle gently till baby's dropped off to sleep. Shh, don't make a sound! Aw, but she's so cute when she's sleeping, maybe we'll just stand here and watch for a while...<br/><br/>With Babysitter Newborn Baby Care you can have fun and learn about how to take care of tiny little babies in this wonderful babysitting game !<br/><br/>Have fun with BATOKI !", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:30:28", "background_image": "https://media.rawg.io/media/screenshots/3b7/3b75aec384424157f6d786442c5a414b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 90, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["BATOKI - Best Apps for Toddlers and Kids"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}