{"id": 233560, "slug": "tracing-letters-numbers-kids-abc-phonics-games", "name": "Tracing Letters & Numbers - Kids ABC Phonics Games", "name_original": "Tracing Letters & Numbers - Kids ABC Phonics Games", "description": "Toddlers and Preschool kids learn to write and trace standing and sleeping lines, shapes, ABC, Number, Spanish, Hindi Alphabets. Kids also learn the phonetics of English Alphabets while Alphabet tracing. Let kids learn how to write in a fun and interactive way all while they enjoy playing using the free games for kids.<br/><br/>The app helps enhance hand-eye coordination of toddlers and helps them to learn to draw lines, curves and some basic shapes so that they can be introduced to the concept of writing without overwhelming them. Every kid can learn at their own pace all while having fun. This app is meant for kids of age right from 3 years to 6 years and also helps them to improve their handwriting as well as their understanding of phonics sounds and Letters tracing.<br/> <br/>Pedagogy of the app is specially designed and engineered to teach kids how to write as well as familiarize them with abc phonics sounds. After extensive feedback from various teachers and institutions that specialize in the same domain, we have come up with this app. It starts with the very basics and goes to complex forms very gradually. Here, the kid begins by understanding how to draw standing, sleeping and slanting lines. Slowly the kid proceeds to more complex shapes like curves, circles, square, etc. at his/her own pace, all while enjoying the experience facilitated by fun-filled animations and guidelines. Once, the kid has mastered the basics, he/she can move to tracing alphabets, the small case as well as the capital case, tracing numbers and even cursive writing.<br/> <br/>The app not only provides English but also Spanish and Hindi letters. The app is packed with lots of audio-visual effects to keep children interested and engaged during the process. Pre-schoolers will quickly and intuitively pick up the shapes, Letters, and numbers and build memory retention skills while enjoying the interactivity and sound effects associated with each activity.<br/><br/>Activities:<br/><br/>- Trace Lines, curves, Shapes etc.<br/>- Learn Basic Shapes<br/>- Tracing Letters (Capital English)<br/>- Trace Letters (Small case English)<br/>- Trace Numbers<br/> <br/>Bonus Material:<br/>- Spanish Alphabet and Phonics sound<br/>- Hindi Varnamala<br/> <br/>Skills:<br/>- Learn to Trace and Write<br/>- Trains memory<br/>- Hand-eye coordination<br/>- Concentration<br/>- Visual perception<br/>- Attention to details<br/>- Fine motor skills<br/>- Phonetics and pronunciation<br/>- Handwriting improvement<br/> <br/>To keep the child challenged, points are awarded for each game stage completed. A scoreboard is maintained which kid can see after each game. When the kid scores enough points, he/she earns a sticker of his/her choice. All his/her earned stickers are kept in a box which he/she can relish any time they want later.<br/> <br/>We have put every effort to make this app interesting and beautiful. But we would love to hear your views, feedback and ratings on the same. <br/><br/>** Privacy<br/>1. Privacy policy: http://www.greysprings.com/privacy<br/>2. We do not collect any personal information about kids", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:30:06", "background_image": "https://media.rawg.io/media/screenshots/ca1/ca15ce3e057d0fe6a8afe3218964b847.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 102, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["greysprings"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}