{"id": 23361, "slug": "fall-of-light", "name": "Fall of Light", "name_original": "Fall of Light", "description": "\"In the beginning, there was only an excruciating, screaming void, wherein twisted souls writhed about, imprisoned in nothingness. Then the darkness was pierced by Luce, and with her came warmth and order. The time of men had begun, and would last many eras. But the 14th era is one of Darkness…\"<br/><br/><br/><br/>As Nyx, an old, retired warrior, evade the Shadows and find your way through the crooked corridors of gloomy dungeons, navigate the treacherous pathways of the darkened overworld and fight emissaries of darkness in long-forgotten temples. Many puzzles and deadly traps stand between you and your goal – to bring your daughter Aether to the last place on the face of Earth that still sees light.<br/><br/>Inspired by games such as Dark Souls and ICO, Fall of Light rewards those who explore the world on their own and draw their own conclusions. Meet odd characters, search through every nook and cranny to unlock hidden secrets and learn more about the history and lore of the somber world around you. Pick your favorite combination of close-range weapons, crossbows and shields, determine your fighting stance and get ready to face hordes of crafty enemies. And above all, keep your daughter from harm, as she is the light piercing the darkness and the key to unlocking forbidden passages.<br/><br/>Features:<ul><li>6 different battle stances, including two-handed and dual-wielding<br/></li><li>7 weapon classes covering both short-range and long-range weaponry<br/></li><li>Guide and protect your companion – Aether, the Indigo child<br/></li><li>Fight Shadows, soldiers of darkness and underworld bosses<br/></li><li>Explore the overworld, scour dungeons and temples to gain and use special powers<br/></li><li>Uncover many secrets and solve various environmental puzzles</li></ul>", "metacritic": null, "released": "2017-09-28", "tba": false, "updated": "2023-04-28T20:05:44", "background_image": "https://media.rawg.io/media/screenshots/cbf/cbf5faa8375ece58abedc401f9fd3852.jpg", "website": "", "rating": 2.62, "rating_top": 1, "added_by_status": {"yet": 9, "owned": 198, "beaten": 3, "toplay": 5, "dropped": 8}, "playtime": 2, "achievements_count": 71, "ratings_count": 11, "suggestions_count": 418, "game_series_count": 0, "reviews_count": 13, "platforms": ["PlayStation 4", "macOS", "PC"], "developers": ["Digerati Distribution", "RuneHeads"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["1C Company"], "esrb_rating": null}