{"id": 233654, "slug": "rainbow-unicorn-poop-desserts-food-maker", "name": "Rainbow Unicorn Poop: Desserts Food Maker", "name_original": "Rainbow Unicorn Poop: Desserts Food Maker", "description": "Yo-oh! I just learned of the good news that the rock superstar - Mr. Unicorn will hold a grand party tonight! All the unicorn fans are invited!<br/>Let’s join the rock star party &amp; help Mr. Unicorn get to his crazy party on time! The music and the rock band are ready! Now, we only need more yummy desserts! Then the crazy fans can get more energy to have fun at the crazy party night.<br/>Come on! Let’s get start.<br/><br/>Product Features:<br/>-A super fun food-making game<br/>-Make yummy rainbow &amp; unicorn foods for the crazy rock star party<br/>-Ten rainbow &amp; unicorn foods to make: galaxy Frappuccino, unicorn birthday cake, unicorn popsicle, rainbow popcorn, rainbow ice cream rolls, rainbow grilled cheese, unicorn cotton candy, unicorn hot chocolate and chocolate bowl rainbow ice cream<br/>-Tons of realistic cooking tools to play: slushy dispenser, freezer, ice cube molds, cake molds, oven, cream mixer, food processor, popsicle mold, sticks, spoons, spatula, popcorn maker, air popcorn maker, grill, cotton candy maker, mugs, induction cooker, baking pan, piping bags and so much more<br/>-Tons of food materials and decorations to try: fruits, candies, sprinkles, milk, flour, salt, sugar, butter, eggs, chocolate, ice cream, cream, water, cheese, cotton candy and so much more<br/> <br/>How to play:<br/>- Use interactive controls to play the game<br/>- Take 10 different cooking modules for galaxy Frappuccino, unicorn birthday cake, unicorn popsicle, rainbow popcorn, rainbow ice cream rolls, rainbow grilled cheese, unicorn cotton candy, unicorn hot chocolate, unicorn and chocolate bowl rainbow ice cream<br/>- Try different tools to make your foods<br/>- Mix various ingredients to create the unique flavor and color of your foods<br/>- Decorate your foods with beautiful sprinkles, candies, fruits , straws and sticks<br/> <br/>Important Message for Purchases:<br/>- This App is free to play but certain in-game items may require payment. You may restrict in-app purchases by disabling them on your device.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:30:00", "background_image": "https://media.rawg.io/media/screenshots/bd5/bd588d8c7018892211820d737c3578d4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 34, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Kids Food Games"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}