{"id": 233674, "slug": "sweet-trendy-desserts-birthday-cake-foods", "name": "Sweet Trendy Desserts: Birthday Cake Foods", "name_original": "Sweet Trendy Desserts: Birthday Cake Foods", "description": "My 16th birthday is coming! I expect it for a long time! <br/>I plan to go NYC with friends to spend a delightful birthday weekend! NYC is my dream city, because there are so many fantastic restaurants and desserts shops hidden in this city! I got a long NYC food bucket list for this 2-day trip! My friends will help me to complete the list!<br/>This must be a best birthday weekend ever! I can’t wait to start the amazing food journey! <br/>Come on! Let’s get go!<br/><br/>Product Features:<br/>-A super fun food-making game<br/>-Make yummy NYC trendy desserts<br/>-Ten NYC trendy desserts to make: rainbow bagels, freakshakes, chocolate pizza, galaxy frappuccino, cloud ice cream, unicorn popsicle, watermelon ice cream, unicorn cotton candy, rainbow ice cream rolls and chocolate bowl rainbow ice cream<br/>-Tons of realistic cooking tools to play: slushy dispenser, freezer, ice cube molds, straws, bowls, plates, cotton candy maker, popsicle molds, sticks, knife, ice cream dispenser, spatula, induction cooker, rolling pin, cutting board, cup, oven, food burner and so much more<br/>-Tons of food materials and decorations to try: fruits, candies, sprinkles, milk, flour, salt, sugar, butter, eggs, chocolate, ice cream, cream, water, marshmallows and so much more<br/><br/>How to play: <br/>- Use interactive controls to play the game<br/>- Take different cooking modules for rainbow bagels, freakshakes, chocolate pizza, galaxy frappuccino, cloud ice cream, unicorn popsicle, watermelon ice cream, unicorn cotton candy, rainbow ice cream rolls and chocolate bowl rainbow ice cream <br/>- Try different tools to make your foods<br/>- Mix various ingredients to create the unique flavor and color of your foods<br/>- Decorate your foods with beautiful sprinkles, candies, fruits, straws and boxes <br/><br/>Important Message for Purchases:<br/>- This App is free to play but certain in-game items may require payment. You may restrict in-app purchases by disabling them on your device.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:29:59", "background_image": "https://media.rawg.io/media/screenshots/dd3/dd3fcb4b6139049d2620f0f35e544279.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 56, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Kids Food Games"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}