{"id": 23374, "slug": "trail-of-destruction", "name": "Trail of Destruction", "name_original": "Trail of Destruction", "description": "Trail of Destruction is about you flying a ship that leaves behind a <strong>trail</strong>. If you complete a <strong>circle</strong>, enemies within will be destroyed. Exciting <strong>abilities</strong> and a dynamic arena with events and items make this difficult task more feasible.<br/><br/>You can play with friends locally if you have at least two controllers. Alternatively there is online matchmaking. You can also go online while playing with your friends locally and fill remaining spots with online players, combining the two options.<br/><br/><br/><ul><li>Skill-based competition - fight your friends and show who is the better player<br/></li><li>Infinite replay value - random events, combining abilities to your liking and many ways to play<br/></li><li>Rapid pace - you won't have time to check your phone when playing Trail of Destruction<br/></li><li>Up to 4 players - local, online or combined multiplayer<br/></li><li>AI Enemies - you can play alone if you want to practice or no one is around to play</li></ul><br/><br/><ul><li><strong>Gamemodes:</strong> There are two gamemodes - Deathmatch and Team Deathmatch. Both work similarly: Fight for five minutes and try to get as many kills as possible - every kill grants you a point. But beware, if you die to environmental hazards, like events, you lose a point - some events also grant points if you perform certain actions. At the end the player or team with the most points wins.<br/><br/></li><li><strong>Abilities:</strong> Choose two unqiue abilities for your ship. You can combine any offensive ability with any defensive one. There are 6 offensive and 6 defensive abilities for a total of 36 combinations.<br/><br/></li><li><strong>Arena:</strong> The arena consists of many parts, constantly changing in appearance, requiring you to adapt.<br/><br/></li><li><strong>Events:</strong> Occasionally an event will happen, changing the pace of the game considerably. For example, during the laser event a laser sweeps through the arena, destroying every ship it touches.<br/><br/></li><li><strong>Items:</strong> To top it all off the arena is filled with items that give various interesting effects when you collect them. They are worth fighting over, in more ways than one.</li></ul>", "metacritic": null, "released": "2017-05-26", "tba": false, "updated": "2019-08-28T22:07:05", "background_image": "https://media.rawg.io/media/screenshots/70a/70a4d0d5971a073e269afbc7db069d0c.jpg", "website": "https://trailofdestructionsite.wordpress.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 26}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 286, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Klingelhöfer & Schlüter GbR"], "genres": ["Action", "Indie"], "publishers": ["Klingelhöfer & Schlüter GbR"], "esrb_rating": "Everyone"}