{"id": 23371, "slug": "mythlink", "name": "Mythlink", "name_original": "Mythlink", "description": "Mythlink is an upcoming VR-only monster battling game for the HTC Vive. Players can level up and battle with their mythlink in hopes to be the best mythlink keeper ever!MythlinksSo just what is a mythlink? A mythlink is a type of monster that players will select when the game begins. These monsters are based on various mythological creatures (such as a dragon, a cerberus, etc.) Once players have selected a mythlink, a special bond begins to form between the player and their new friend. This link between player and mythlink is so powerful that as one of you improves, so does the other. Because of this, players themselves will take part in various strength, dexterity, and intelligence training rooms to improve both themselves and their mythlink.Leveling UpMythlinks have 3 stats which can be improved through playing the game. These stats are strength, dexterity, and intelligence. Picking the best way to improve your mythlink stats is key to victory! <br/><ul><li>Strength: Helps your mythlink deal more damage. You improve your mythlink's strength by playing in the \"Gym\" room. The gym room includes games which involve punching and using force. Gym room available now in the demo.<br/></li><li>Dexterity: Helps your mythlink move and react quicker. You improve your mythlink's dexterity by playing in the \"Dodge\" room. The dodge room includes games which involve moving quickly.*<br/></li><li>Intelligence: Helps your mythlink learn more advanced moves. You improve your mythlink's intelligence by playing in the \"Puzzle\" room. The puzzle room includes a block-clearing game. Puzzle room available now in the demo.</li></ul>BattlingOnce a mythlink keeper is confident in their skills, they can enter the arena and battle against other mythlinks! Both keepers will be placed high above the arena at opposite ends where they can see the entire area at once. From this high vantage point, they will control their mythlink and utilize abilities in order to knock out the opposing mythlink. These 1 on 1 battles will showcase the fruits of all efforts put into training. Last mythlink standing wins!<br/><br/><br/>*Game is currently under development. Any number of things may change before the complete release! To follow the development of Mythlink, please go to our website/facebook for dev blog.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T22:07:05", "background_image": "https://media.rawg.io/media/screenshots/9b6/9b67c3108706ef3664521606e29bcabd.jpg", "website": "https://www.homepointgames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 157, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Home Point Games"], "genres": ["Action", "Strategy", "Indie"], "publishers": ["Home Point Games"], "esrb_rating": "Everyone"}