{"id": 233743, "slug": "hair-stylist-fashion-salon-rainbow-unicorn-hair", "name": "Hair Stylist Fashion Salon ❤ Rainbow Unicorn Hair", "name_original": "Hair Stylist Fashion Salon ❤ Rainbow Unicorn Hair", "description": "Play as the hottest hair stylist in town in this fun salon hair styling game.<br/><br/>Take clients into your hip salon and create brand new looks for them. Cut, color and style their hair using your creativity. Cut them into fun cuts like asymmetrical bobs, undercuts or pinup bangs. Choose from lots of different colors including rainbow!<br/><br/>Apply color and then complement with low lights and highlights. Dye your clients’ hair blonde and blue, or black and hot pink! Or create something completely different! The choice is up to you. Style their beautiful locks in braids or pigtails. Use curling irons, flat irons and curlers to make a look that’s as unique as your ideas! <br/><br/>Finish your styling with trendy bobby pins or headbands. Add feathers, sparkles and flowers to create a winning design. Don’t forget to save your look for your portfolio and show all of your friends! <br/> <br/>Product Features: <br/> - Use real salon tools in this hair styling game<br/> - Dye, cut and style <br/> - Mix and match colors to create awesome designs<br/><br/>How to Play: <br/> - Tap to pick hair dye and highlights<br/> - Swipe to apply color and sparkles<br/> - Swipe and spin to use styling tools to make different looks<br/><br/>We want to hear your voice!<br/>Watch our awesome videos on our YouTube channel! https://www.youtube.com/channel/UCm1oJ9iScm-rzDPEhuqdkfg<br/>Like us on Facebook: https://www.facebook.com/pages/Salon-My-Styling-Lounge/650573658373878<br/>Follow us on Twitter: https://twitter.com/SalonTM<br/>Know more about Salon™ on official website: http://www.salongirlgames.com/", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:29:57", "background_image": "https://media.rawg.io/media/screenshots/e9c/e9c73589a58b01a93745816470bf14e5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 121, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Salon™"], "genres": ["Casual"], "publishers": [], "esrb_rating": null}