{"id": 233763, "slug": "princess-royal-fashion-salon", "name": "Princess Royal Fashion Salon", "name_original": "Princess Royal Fashion Salon", "description": "Prince Charming is close to the castle! Hurry, get the princesses ready to meet him! The girls are in their rooms getting ready to meet the prince, but they have to look their best before they leave the castle! Help them look like beauty queens in this charming royal story of dress up, hair design and spa treatments!<br/> <br/> The royal girls high in the castle need your help to look beautiful for Prince Charming. Start by giving them new makeup, including lipstick, eyeshadow and blush. Keep the spa story going by changing their hair style, picking the prettiest, cutest hairdo around! Find the perfect royal dress to finish up the beauty makeover. Prince Charming is almost here, so make sure you design the perfect story book look for these royal girls!<br/> <br/> Features:<br/> - Run a beauty spa for princesses in the royal castle.<br/> - Help them play out their story and meet Prince Charming.<br/> - Give them makeovers, including hairstyles, makeup and dresses.<br/> - Design new outfits so they look like beauty queens.<br/> - Make your spa the best in the kingdom!<br/> <br/> How to Play:<br/> - Choose a princess to design a makeover for.<br/> - Pick out a new hairstyle, new dress and cute shoes.<br/> - Add makeup to the girls so they look extra cute.<br/> - Take them outside for a beautiful love story ending with Prince Charming!<br/><br/>We want to hear your voice!<br/>Like us on Facebook: https://www.facebook.com/pages/Salon-My-Styling-Lounge/650573658373878<br/>Follow us on Twitter: https://twitter.com/SalonTM<br/>Know more about Salon™ on official website: http://www.salongirlgames.com/", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:29:54", "background_image": "https://media.rawg.io/media/screenshots/269/269249397651668b21a9a2bf5b920994.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 105, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Salon™"], "genres": ["Casual"], "publishers": [], "esrb_rating": null}