{"id": 233882, "slug": "army-craft-heroes-of-ww2", "name": "Army Craft: Heroes of WW2", "name_original": "Army Craft: Heroes of WW2", "description": "Crafting combat game! Build your base from blocks and protect it from enemies! Take up arms, strike an iron assault! Explore square battlefield, fight for honor - for free! <br/><br/>An epic warfare story begins<br/>Be a soldier! Create a hero of World War 2 who fights in frontline with army! Craft &amp; build cube base or city and protect it from enemy forces - free city building games! Building &amp; crafting game for boys and girls with combat! In this exploration simulator game you can gather resources to create unique items and weapons! Shoot and survive! Craft land and battle enemy soldiers! Blocky heroes need a war leader like you! Build cube trenches and save your square people! Innocent pets, boys and girls! Pixel warfare craft with modern cube weapons! Assault rifle, sniper rifle, smg - it’s all here! Change clothes, haircut and weaponry! Defend your base and strike counter-attack. Watch for land mines! Destroy blocks to find new resources! Design elite pixel items for free! Craft explosives to break through enemy lines! Do it for honor or love of your girlfriend or boyfriend! You may even date them! True blocky combat  !<br/><br/>Build base from square blocks<br/>Survive assault and find a girlfriend or boyfriend! Lite crafting &amp; survival game! Fight for boys and girls you love! Rescue and befriend pets! Unlock new haircut and clothes - look great even on a battlefield! Evil forces are right behind square walls. Create large structures of blocks and become World War 2 hero! Enemy’s assault will fall! Move the frontline ahead and fight for honor in epic battle In this cube sandbox exploration combat game simulator! Square soldiers need you! Sandbox, blocky world of World War 2! Mine blocks, build weapons and become war leader - for free! Army needs you! Design and build house for survivors, hospital or armory! An entire square city  - like in city building games simulator! Transform cube surface! Infinite possibilities! Bring boyfriend or girlfriend with you! They’ll love such an exploration pixel art game! Build &amp; explore! You don’t need an iron tank!   world! Change clothes, haircut, jump into car, jeep or train and surprise enemy soldiers! As an assault commander you’re not only building cube base, but also leading a strike against opponent’s pixel forces! Be the World War 2 hero! Find a love and go on date. Rescue pets. Any boy and girl can make it! <br/><br/>Mine resources, win the battle<br/>Mine resources as an elite soldiers commander to craft square blocky weapon! Shoot enemies and survive! Brothers on the frontline will name you a hero! Craft a car or jeep! Save your boyfriend or girlfriend to earn honor and love! Change clothes, haircut and date them! Rescue pets! No need for iron tank - use a sniper rifle, assault rifle or land mine! Lead army, win the World War! It’s a best survival simulator exploration free game with amazing graphics and well-thought-out controls! This blocky soldiers need you! Don’t let them die in the square battlefield! Build cube base, gather forces, fight for survival in this building &amp; crafting lite combat game for boys and girls! Become a   hero!<br/><br/>UPCOMING FEATURES:<br/>Multiplayer!<br/>Co-op mode!<br/>Story mode!<br/>Survival mode!<br/>More blocks to create!<br/>More resources to craft!<br/>More interactions with your boyfriend and girlfriend!<br/>War music system!<br/>Tank attacks!", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:29:10", "background_image": "https://media.rawg.io/media/screenshots/288/28820e4482b1122e1afaed10c33521b3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 128, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Crafting And Building Games For Girls Adventure"], "genres": ["Action"], "publishers": [], "esrb_rating": null}