{"id": 233884, "slug": "restaurant-craft-design-fever", "name": "Restaurant Craft: Design Fever", "name_original": "Restaurant Craft: Design Fever", "description": "Design your restaurant! Building &amp; crafting. Build a cube blocky dream bistro! Craft furniture &amp; decorate! Start cooking like mama! Become a master chef in Exploration free game!<br/><br/>One of the best cooking games for free<br/>This restaurant needs a master chef like you! Countless possibilities to furnish interior of bistro! Become a interior designer! Great game for teenagers! Square blocky restaurant! Pizza &amp; donut shop! Start cooking. Fever Pizza or Burger Bomb you name it! Build a blocky cube kitchen you’ve always dreamt of and decorate it! Start cooking like mama - customers will love it! Invite high school friends, boyfriend, girlfriend, boys and girls! Bring cute little animal pets - puppy dog, kitten cat and more! Make here a date or party! Create a breakfast, lunch or dinner party! Serve different types of square food! Traditional meals, fast food, great pizza, hot dog, big burger - any of them! Design &amp; craft fancy decoration to customize your building! One of the best Exploration cooking games for free. <br/><br/>Craft &amp; build your own kitchen - cook like your mama!<br/>Feel like a chef! Choose from many blocky cube decor items! Craft &amp; build even more in a Exploration cooking mode! Square rooms need a decoration! Build a dream restaurant, decorate and show it to your mama, boyfriend, girlfriend, high school friends or even pets! Serve them big burger, great pizza or any other square food. You’re a chef! Furnish a kitchen! Place a blocky cube kitchen sink, great pizza oven, square fancy table &amp; chairs. Cook food for your mama, boyfriend or girlfriend! Extreme fun with cooking! Square cool decoration make food even better! Small blocky cube bistro can turn into great restaurant! Design, decorate &amp; build it in a master chef fashion! Food fever! Great building &amp; crafting experience!<br/><br/>Exploration of master chef’s world<br/>Cooking fever starts now! No time to waste for other design &amp; decoration apps! It’s a best free game for high school boys and girls who want to be master chef in their own restaurant! Take control over bistro, design and decorate every square room and kitchen with cube blocky table, chairs and other furniture! Impress your mama, boyfriend, girlfriend, high school friends or even cute pet animal! Make a great pizza, big burger or craft other food! It’s a hot dog fever! Exploration of restaurant world! Best free building &amp; crafting game for teenage boys and girls!  <br/><br/>CORE FEATURES:<br/>Design your own restaurant!<br/>Decorate it however you want!<br/>Choose from many decor items!<br/>Crafting more decorations!<br/>Feel like a master chef!<br/><br/>UPCOMING FEATURES:<br/>Multiplayer mode! (multi craft)<br/>Co-op mode! (party craft)<br/>Story mode!<br/>More Building &amp; crafting decoration items! (design craft)<br/>More dating options with boyfriend or girlfriend! (date craft)", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:29:09", "background_image": "https://media.rawg.io/media/screenshots/fa7/fa77a191c1807a8487328d4b6692e61d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 91, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Crafting And Building Games For Girls Adventure"], "genres": ["Casual"], "publishers": [], "esrb_rating": null}