{"id": 233881, "slug": "kawaii-girls-craft-cute-story", "name": "kawaii Girls Craft: Cute Story", "name_original": "kawaii Girls Craft: Cute Story", "description": "Cute princess kawaii craft! Building &amp; crafting game for teenage girls (Pocket story mode) with cute kawaii monsters! Japan kawaii &amp; anime / manga game! Build a cute blocky world! Be a top girl and make friends with cute colorful monsters! Exploration of the cute world! Crafting games for teenage girls! Cupcake or Cute cake? Sweet cute monsters are waiting to be your best friends forever! for teens! Be a top high school girl and make friends with cute kawaii monsters! Japan style at it’s best! Crafting for adults as well! for teens! You can build a princess palace using blocks, make friends with animals (puppy, pony, cat)! Cute munchy kitty face! Bake a strawberry pie! Take care of animal and monster friends! (monster care, animal care)! Be a sweet baby girl! Hug all of the super cute monsters! You can build a shopping mall, spa or pet shop! Princess girl house or Nail salon - building game for girls! Craft &amp; exploration. Lite adventure game for teenage girls. Decorate the walls with wallpapers, use furniture to design the perfect, cute interior. Delicious strawberry cake in the kitchen, cute pink living room.  &amp; salon decoration the new way! Build a little tiny princess room! A princess palace or a house! Exploration in a cube craft world! Make friends with a pony and my unicorn! Creative game! Fun sim game! Crafting simulator!  clean up and decoration! Sweet baby girls room decorated with funny cute kittens and strawberries as a wallpaper. Dress up like a princess and have fun with kawaii! Make a pool party! Be a manga and anime star girl! Sim (simulator) of the blocky craft world! Cuteness overload!  kawaii (かわいい?, [kawaiii], \"lovable\", \"cute\", or \"adorable\") is the quality of cuteness in the context of Japanese culture. It’s not another girls hairdresser game - it’s a creative app for creative people! <br/><br/>Upcoming features:<br/>Multiplayer<br/>Spa salon mode<br/>Fashion craft (design)<br/>Craft for girls mode<br/>Strawberry cake baking game (mini)<br/>Dress up &amp; spa salon mode (fashion game) <br/>My unicorn &amp; mini games!<br/>Building &amp; crafting - fast (2x)<br/>Decorate a Doll House!<br/>Build &amp; explore a blocky world!<br/>Create a fashionable world!<br/><br/>Fun games for free only from Building &amp; crafting Games! Want more crafting games for girls? See our other games for girls and boys!", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:29:11", "background_image": "https://media.rawg.io/media/screenshots/5fc/5fccf93941c89f9b6e368ff0cfb6d775.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 104, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Crafting And Building Games For Girls Adventure"], "genres": ["Casual"], "publishers": [], "esrb_rating": null}