{"id": 233876, "slug": "car-craft-traffic-race-exploration-driving-run", "name": "Car Craft: Traffic Race, Exploration & Driving Run", "name_original": "Car Craft: Traffic Race, Exploration & Driving Run", "description": "Crafting and building for boys and girls. Car racing, top speed, traffic jam and blocky exploration of the sandbox world! Car racing games for boys and girls! Build city (city craft), ride a car, chat with friends, race them in traffic! Car craft - blocky cars in an open, infinite world! Build using blocks! Mine, craft and explore! New free game from creators of girls craft and sim craft! Craft car games - the new way! Blocky roads &amp; cars! Square hill climb racer! Start the engine and hit the road! Blocky town craft for boys and girls! Beep beep vroom! Cars, upgrades and crafting in one game! Crafting game with supercars! Top speed racer in a blocky world!  Pick any car you want and drive! (driving craft) You can ride sport car, ambulance, police car, or anything you want! Learn how to park - become a parking princess or prince! Craft new upgrades for your cars! Race with top speed! Become an ultimate driver! Play the best car simulator game in an open world! Use blocky motorbikes on a blocky highway! Take your virtual girlfriend and have a romantic ride! Chat with people you meet, date boys and girls, craft, build and explore! Design your own garage, dream house (craft) and build the super car! Top speed racing game with building mode! Build &amp; drive! Car racing games for boys and girls! City builder game for free! In the open world of Car craft you can do anything you want! From exploring the world to hanging out with people or going to a party! Play dancing minigames, go to the bar or college party! Visit restaurant or ride the metro in blocky world! Crafting game for boys and girls (girls craft). Build using blocks (block craft), craft unique items, unlock the custom power ups and elements! <br/><br/>FEATURES:<br/>Driving cars (car simulator)<br/>Building and constructing an infinite railway system<br/>Build tunnels and bridges in a sandbox world!<br/>FPS car driver simulator<br/>FPS road &amp; highway system constructor simulator<br/>Sandbox world<br/>Chat <br/>Animals &amp; Pets!<br/><br/>UPCOMING FEATURES:<br/>Multiplayer (multicraft)<br/>Train racing<br/>Snow, sandstorm, rain<br/>Cars and traffic!<br/>Brazilian craft mode!<br/><br/><br/>Drive a car in a blocky world!<br/>Build a whole city! <br/>Explore the infinite world!", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-30T22:04:02", "background_image": "https://media.rawg.io/media/screenshots/134/1347ad7aa17451215885c769af03f69d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 54, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Crafting And Building Games For Girls Adventure"], "genres": ["Racing"], "publishers": [], "esrb_rating": "Everyone 10+"}