{"id": 233895, "slug": "bunny-pet-my-little-friend", "name": "Bunny Pet: My Little Friend", "name_original": "Bunny Pet: My Little Friend", "description": "Animal games with cute bunny for Teens! Rescue, care, dress up and play with a virtual pet! Talk to your new friend, wash, feed and play with him! It answers with funny animal sounds! Pet games for teenage girls! Get up close and personal with insanely cute bunnies! Take care of your pet! Explore the pet world! Virtual pet game! Adopt your very own bunny and help him grow into a fully grown pet! Change clothes, visit other players! Play mini games to entertain your friend when bored! Your adorable little bunny is waiting for you to love, pet, dress, feed, teach, clean and take care of him! With life-like emotions, stunning graphics and fluent animations it will feel just as if your bunny was real. Nice game for teenagers and even adults! Bunny is very playful, and would love to play with you in one of the super fun Mini-Games. Buy beautiful clothes, decorations and customize your bunny’s room in any way you want with the money you earn from the Mini-Games. After playing all day make sure to feed the bunny with either nutritious fruits or sweet candy! The best dress up games for teenage girls and boys! Decoration of the baby bunny’s room! Change wallpapers, buy new furniture, interact with all the items around! So adopt your very own puppy, little cute bunny. He is one of a kind. A pet so sweet you can’t look away! Take care of Bunny, your new favorite virtual pet. Feed him on delicious food, take him to the toilet and rock him to sleep on a hammock under a starry sky! Bunnies like cats and dogs are super fluffy and cute! Cuddle and hug your little friend! Fun game for teenagers!<br/><br/>FEATURES:<br/>Change clothes<br/>Customize and decorate the baby bunny’s room<br/>Visit your friends pets<br/>Makeover and dress up!<br/>Mini Games<br/>Over 200 clothes!<br/>Nurture: Take care of your Moy by feeding, cleaning, playing with him and getting him to sleep when he is tired. <br/>Talking pet mode<br/>Baby pet mode (virtual pet)<br/><br/><br/>Take care of your little friend!<br/>Change clothes of your baby bunny!<br/>Play awesome mini-games! <br/><br/>DISCLAIMER: This game is not advised to play for players below 13 years old without parental control.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:29:04", "background_image": "https://media.rawg.io/media/screenshots/35c/35c384440fce16949544e126933dca1f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 66, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Crafting And Building Games For Girls Adventure"], "genres": ["Arcade"], "publishers": [], "esrb_rating": null}