{"id": 233874, "slug": "girls-world-exploration-crafting-building-lite", "name": "Girls World Exploration: Crafting & Building Lite", "name_original": "Girls World Exploration: Crafting & Building Lite", "description": "Building &amp; crafting and Exploration for teenage girls! Crafting game for teenage girls and boys. Girls craft! Exploration of the sandbox blocky world! City builder game! Sim house design craft ! Create your own girls world! Design your dream house, girls room or baby room. Build a castle (as you’re a princess!) Craft unique items, chat with handsome boys and date them! (date craft). Exploration and crafting game for teenage girls! Ride the unicorn and hug the pony (pony craft). Creative game for creative people! Start the adventure! Pocket edtion of the best crafting game! Build using blocks, have pets (cat, dog, unicorn and pony!), create, explore and be a top girl! Exellent game for teens and adults! You can change clothes (dress up game) - pick the best dresses you want! Go shopping to the mall! Take friends with you! Shopping and crafting in a blocky world game! Girls craft, boys explore! Meet new people, have fun! Build, craft and be a top girl! Use over 300 colorful blocks to build anything you want. Sandbox game with infinite world where you can have a pet, meet people (NPC) and chat with them! Date handsome boys (date craft), dress like a princess and create any building you want! From small girls house, SPA or shopping mall to whole city! City building game for girls! You can even ride a train, build a train tracks and explore the world! Design your own world! Be creative! Exploration and crafting for teenage girls! Build zoo, feed animals become a tycoon of the zoo  industry! Drive a car in a square city! Crossy streets and blocky world! Build a dollhouse, craft awesome clothes and items, prepare most awesome high school party! Girls life craft in infinite world! Free game for teenage girls!<br/><br/>FEATURES:<br/>3D interior models<br/>Dating - talk to a boys and date them! <br/>Building and crafting - use blocks to build!<br/>Exterior and interior design - gardens, pools, flowers, parks<br/>House planner mode (kitchen, living room, baby room)<br/>Cute pink and colorful textures<br/>Coloring book and sketch book<br/>Sandbox world<br/>Custom wallpapers, carpets and furniture<br/><br/>COMING SOON:<br/>Multiplayer Exploration Mode<br/>Blocky Craft 3D Mode<br/>VR (Virtual reality)<br/>Adventure mode<br/>Pixel texture pack<br/>Girls Craft Mode<br/>Princess Craft extension pack (Cute Castle Interior Design)<br/>Build Craft Exploration extension pack (custom houses + extra furniture)<br/><br/><br/>Explore the girl’s world!<br/>Build, craft and create!<br/>Chat and date with virtual people!", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:29:15", "background_image": "https://media.rawg.io/media/screenshots/7fd/7fd21fc616b9788671696752a57448a8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 73, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Crafting And Building Games For Girls Adventure"], "genres": ["Casual"], "publishers": [], "esrb_rating": null}