{"id": 233969, "slug": "brainfck", "name": "Brainf*ck", "name_original": "Brainf*ck", "description": "Brainf*ck is an extremely minimalistic, fully competent, Turing-complete esoteric programming language created in 1993 as more of a theoretical joke rather than a tool for real-world software development. With just 8 extremely simple commands, Brainf*ck code can be used to write algorithms performing virtually any computational task possible.<br/>\n<br/>\r\nDue to its simplicity, Brainf*ck has a very shallow learning curve. It takes 5 minutes to learn but days of active thinking to master. This game, being a combination of an interactive guide with a powerful simulator equipped with debugging features, leads players through the primitive structures and basic patterns of the language with the ultimate goal of writing a self-interpreter (a program written in Brainf*ck that can execute any valid Brainf*ck code). Waves of frustration commonly associated with learning by many are fought against by a rich set of notes and hints that make completion of individual tasks painless and if one ever gets lost at any point, the game comes with a database of thoroughly worked solutions.<br/>\n<br/>\r\nA part of the content of the game is subdivided into schemas of scenarios that each focus on different aspects of Brainfu*ck programming. The basic tutorial demonstrates the many capabilities of the language and can be completed in just 15 minutes. Scenarios on sequences and strings, data manipulation and sorting and optimization give players a broad overview of what's possible not just in Brainf*ck, but in the programming world in general. All of the problem-solving skills acquired can be further used in one's personal and professional interests. Should one feel like experimenting or working on their own project, the Sandbox schema provides the environment to do so. <br/>\n<br/>\r\nThe game also features a level editor that can be brought up at any time by a single mouse click on both distributed and custom content. Schematics of different scenarios, testing plans, and savegames are hand-editable and the documentation is provided in the game itself, allowing players to create their own custom fork of the content.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:53:41", "background_image": "https://media.rawg.io/media/screenshots/1e8/1e891d8a5b25c6cb5948f911089eb6c2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 115, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["Esoterics"], "genres": ["Strategy", "Simulation", "Casual", "Indie"], "publishers": ["Esoterics"], "esrb_rating": null}