{"id": 233921, "slug": "medieval-exploration-craft-3d", "name": "Medieval Exploration Craft 3D", "name_original": "Medieval Exploration Craft 3D", "description": "Medieval Craft Exploration &amp; Town building moved to another level. Creative game for boys in fantasy setting (with dragon!) revolution! Survive the fantastic adventure with dungeons and dragons! This lite, pocket edition game, inspired by the popular cube / voxel based crafting games for boys, lets you build, create, craft and explore perfect fantasy medieval cube world with a dragon! Medieval Exploration Craft opens new adventures with castle, dungeons, dragons and knights! Explore caves and mines, find the treasure! Teenagers game! Conquer new fantasy kingdoms and worlds with dragons as a knight! Play in a fantasy creative mode with unlimited resources or mine deep into the cube world. Exploration of randomly generated cube medieval fantasy worlds, building and creating amazing &amp; perfect structures from the simplest of homes to the grandest of cube fortresses and castles with knights, princess, dragon and dungeon! With survival mode (to be created soon) you can defend the castle from monsters, dragons, zombies, skeletons and enemy knights! Just fantasy cube world and your infinite creativity! Build perfect structures step by step, create awesome fantasy castles, darkest dungeons - beware of dragon! All for free! This fantastic lite exploration game for boys contains: block placing, fantasy cube world, real time world generation in the times of knights and dragons! Build a cube world! Explore the cube world with dungeons and dragons! Start the adventure! In this incredible fantastic and totally free game  for boys you can destroy all the blocks, collect resources, survive and build beautiful &amp; perfect Buildings in fantasy setting. This game (PE) contains a large number of different blocks with which you can craft your own cube world in fantasy world! High resolution textures, very convenient and thoughtful game control, High FPS, without compromise! So plunge into the fantastic world of ‘Medieval Kingdom: Create &amp; Build - exploration’ - with new cube worlds and adventures in fantasy world with a vile dragon and a knight! Place blocks / cubes move voxels, dig and mine! Go beyond your wildest dreams, make your own cube base, mine castle or kingdom! Transform the surface in a 3D environment. Build shelter, fight, grow and craft, the only limit is your imagination! Start a cube craft! This game for boys free for age 16 to 18 gives you new quality of creation! <br/><br/>Coming soon:<br/>Multiplayer<br/>Crafting items and weapons<br/>Medieval realm<br/>Black knight hunt<br/>Survival mode<br/>Day &amp; night<br/>Cube Craft<br/>Story mode <br/>Dragons and zombies<br/>Stats and inventory<br/>Different worlds (hell, heaven, lair, dungeon)<br/>Shop with armors, weapons and unique elite swords for knight<br/>Kingdom management as a king of fantastic medieval country<br/><br/><br/>Build your own Castle!<br/>Rule the Kingdom!<br/>Be creative!<br/><br/><br/>If you are interested in similar games such as our cube craft world game please see our other fantasy medieval games for boys.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:28:52", "background_image": "https://media.rawg.io/media/screenshots/b04/b0430fa58db3a5a9552ff85e6d33fb80.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 112, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Tiny Dragon Adventure Games: Craft, Sport & RPG"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}