{"id": 233925, "slug": "dollhouse-craft-2-girls-design-decoration", "name": "Dollhouse Craft 2: Girls Design & Decoration", "name_original": "Dollhouse Craft 2: Girls Design & Decoration", "description": "Design &amp; decorate your doll house! Fashion craft for girls! Building &amp; crafting in a funny game! Be like a princess (princess craft) and decorate your own blocky cube castle! Build craft &amp; decorate rooms with furniture!  <br/> <br/>House decoration (house planner app) taken to the new level! <br/>Craft for girls! Doll house! Place cute elements to build the best house for dolls ever! Interior and exterior design app! exploration of the pixel art girls world! You can even date boys while designing your own dream house. Invite your High school friends for an epic party and chat with them! Go shopping with high school friends! Take your cute little pet with you! Or build a shopping center, spa or pet shop! Plant flowers and decorate the exterior. Dress up and craft new pixel glamour clothes! Date craft mode for cool boys and top girls! Great for Teens too! Chat with blocky cube NPCs. Decorate walls with paintings and wallpapers! Best pixel art sim dollhouse decoration game free with exploration experience! <br/> <br/>Doll house Interior design app - for free! <br/>Build a princess castle! Drive a car (car craft for girls) ride a train or even build restaurant, zoo or a theme park! Bake a sweet strawberry cake in the kitchen! Make friends with Pony or ride an unicorn! Plan, build and decorate a blocky cube whole house! You can choose from modern house to princess room. Become an exterior &amp; interior designer using this free game! Decorate your own nail salon or party house! Befriend a cute, small animal - dog, kittie, pony or even an unicorn! Doll house decoration in a fancy world ready for Building &amp; crafting! Craft unique items, explore the world! Be a queen or princess among dolls! There are many hand-crafted cute blocky cube furniture for you to decorate these rooms how you like it. How do you want to decorate the bathroom, bedroom, garden, kitchen or living room? It’s up to you! Best Building &amp; crafting game for top girls in the world! Dollhouse craft 2 - sim design with beautiful pixel art graphics!<br/> <br/>Colorful adventure to design &amp; decoration world!<br/>Fashion, design and creativity! Create and decorate the dollhouse of your dreams! Interior home decoration! Fashion dolls need a fancy pixel art house! Build a princess doll house! Apart from building and crafting you can choose clothes and be a fashion star have a fancy pet (cat, dog, unicorn), chat and date cool handsome blocky cube boys! Fall in love and prepare your own wedding! Play minigames to earn more unique items, challenge and compete friends in the multiplayer mode (soon). Decorate a cute pink living room! Build a theme park or a zoo! Teenage boys and girls! You should play this!<br/> <br/>FEATURES:<br/>Build and design using blocks<br/>Over 300 blocks and elements<br/>Completely free! <br/>Pre-generated doll houses (castle, mansion, modern, restaurant)<br/>Chat with NPCs<br/> <br/>UPCOMING FEATURES:<br/>Multiplayer<br/>Fashion craft (design) <br/>Date Craft<br/>Spa salon mode", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-30T19:10:28", "background_image": "https://media.rawg.io/media/screenshots/a73/a73b695f96c96298f4a6a83b1929528f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 93, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Tiny Dragon Adventure Games: Craft, Sport & RPG"], "genres": ["Adventure", "Casual"], "publishers": [], "esrb_rating": "Everyone 10+"}