{"id": 233968, "slug": "steel-division-2", "name": "Steel Division 2", "name_original": "Steel Division 2", "description": "<p>COMMAND YOUR ARMY. FIGHT YOUR BATTLES.<br />\nSteel Division 2 pushes the limits of the WW2 RTS experience. Set on the Eastern Front in 1944, this sequel of the critically acclaimed Real-Time Tactical game puts you in charge of your entire army during Operation Bagration, the Soviet offensive against Nazi armies in Bielorussia.<br />\nPlay as a General in the 1:1-scale turn-based Dynamic Strategic Campaigns, as a Colonel in the epic Real-Time Tactical Battles, as an Weapon Expert in the brand-new Deck Building System.<br />\nWith more than 600 units, 25 maps, and multiple game modes, Steel Division 2 lets you play as you want and offers hundreds of hours of gameplay in solo, multiplayer and coop.<br />\nMassive 1:1-Scale Dynamic Strategic Campaigns<br />\nRelive history in the huge single player Dynamic Strategic Campaigns: lead thousands of men on up-to 150x100 km maps, plan your batallions&#39; movements, manage supply and execute your strategy in week-long campaigns in this historically accurate turn-based game mode. Every batallion is the same as it was during the Operation Bagration.<br />\nPick your side and relive this massive offensive or rewrite the course of events. Decide which batallion will take part into battle, fight every one of them in real-time tactical combat, or use autoresolve for a pure Strategic experience.<br />\nMore than just another game mode, the Dynamic Strategic Campaigns are an entire new game within the game.<br />\nAuthentic Real-Time Tactical Battles<br />\nField over 600 extremely detailed units, including the iconic T-34 tank, the Katyusha multiple rocket launcher and the IL-2 ground-attack aircraft! Select your division, pick the units you will send to battle, and build the perfect battlegroups in the brand new deck system, allowing more tactical freedom than ever.<br />\nFight in the 25 new available battlefields, analyze the terrain and use your tactical skills to give the right order at the right time and dominate your enemy!<br />\nMain features<br />\nBrand new turn-based Dynamic Strategic Campaigns<br />\nNew setting, the Eastern Front, with the mighty Red Army and Axis powers<br />\nOver 600 historically accurate units across 18 new divisions<br />\nRealistic battlefields spread across 25 different maps<br />\nSubstantial changes to the Deck building mechanics<br />\nNew, realistic art direction to deliver a more immersive visual style<br />\nRevamped combat offering a more refined tactical experience<br />\nTons of game modes, offline and online, including co-op and massive 10v10 multiplayer battles</p>", "metacritic": 73, "released": "2019-06-19", "tba": false, "updated": "2023-07-13T11:49:51", "background_image": "https://media.rawg.io/media/games/b56/b5615fa3a6ae9d4ca77996c4c454afc9.jpg", "website": "https://www.steeldivision2.com", "rating": 3.85, "rating_top": 5, "added_by_status": {"yet": 9, "owned": 112, "beaten": 5, "toplay": 12, "dropped": 14, "playing": 6}, "playtime": 4, "achievements_count": 54, "ratings_count": 26, "suggestions_count": 342, "game_series_count": 0, "reviews_count": 26, "platforms": ["PC"], "developers": ["Eugen Systems"], "genres": ["Strategy", "Indie"], "publishers": ["Eugen Systems"], "esrb_rating": null}