{"id": 233941, "slug": "create-worldcraft-exploration", "name": "Create World:Craft Exploration", "name_original": "Create World:Craft Exploration", "description": "Exploration &amp; creativity moved to another level. Game for teens! Create a perfect building! This lite pocket app, inspired by the popular cube voxel (pocket mine edition) based games, gives you opportunity to transform the terrain in 3D environment, and build a perfect cube world! Build &amp; craft! Play &amp; Craft! Explore &amp; Mine! Story mode soon to be released! Have fun with cube world exploration! Play for FREE Creative Game: Exploration. Play in a creative mode with unlimited resources or mine deep into the cube world. Pocket Mine Exploration of generated cube worlds. Build and create amazing &amp; perfect things from the simplest of homes to the grandest of cube fortresses and castles and mine to the earth core! Become an adventurer! No dragons and survival mode. Just cube world and your infinite creativity! Build perfect structures step by step, create awesome castles! Pocket mine exploration! All for free! This lite game contains: block placing, cube world, real time world generation. Build a cube world! Good game for adults! Explore the cube world! In this incredible and totally free game you can destroy all the blocks, collect resources, survive and build beautiful &amp; perfect Buildings. This game (PE) contains a large number of different blocks/skins with which you can craft your own cube world! High resolution textures/skins, very convenient and thoughtful game control, High FPS, without compromise! So plunge into the fantastic world of ‘Creative Game Exploration ’ - with new cube worlds and adventures! Place blocks / cubes move voxels, dig! Craft new items! Go beyond your wildest dreams, make your own cube base, mine castle or kingdom! Transform the surface in a 3D environment. Build shelter, fight, grow and craft, the only limit is your imagination! Start a cube craft! Are you teenage girl or boy? Good! Play this game now!<br/><br/><br/>Coming soon:<br/><br/>Multiplayer Online<br/>Crafting items and weapons<br/>Survival mode<br/>Day &amp; night<br/>Cube Craft<br/>Story mode (with dragons and bosses!)<br/>Weather<br/>Stats and inventory<br/>Different worlds (hell, heaven, lair)<br/>Shop with armors, weapons and unique elite swords<br/><br/>Build awesome structures<br/>Explore the worlds<br/>Build&amp;Craft<br/>Play&amp;Craft<br/>Be creative!<br/><br/>If you are interested in similar games such as our cube craft world game please see our other games. <br/><br/><br/>Create &amp; build whatever you want<br/>Be creative!<br/>Construct castle or modern city!", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:28:46", "background_image": "https://media.rawg.io/media/screenshots/d20/d2057da55574a4cd9e479c77d5869931.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 63, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Tiny Dragon Adventure Games: Craft, Sport & RPG"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}