{"id": 233907, "slug": "london-craft-blocky-building-games-3d-2018", "name": "London Craft: Blocky Building Games 3D 2018", "name_original": "London Craft: Blocky Building Games 3D 2018", "description": "🇬🇧  How about tasty fish &amp; chips during a long ride on London Eye? Indeed, sounds enjoyable. But that’s not all! Build your own blocky Big Ben, swim in the pixel Thames and explore London Tower in one of the best city building games! Crafting &amp; building fun – only in London Craft!🇬🇧  <br/><br/>Build &amp; craft!<br/>Become a professional house builder! Create a whole pixel and blocky world in an English style. Ever wonder what’s like to redesign London Underground? Now you can because you’re a real city builder! Exploration is a wonderful experience. Subway is great but don’t forget about famous London Bus. Oyster Card not needed!<br/><br/>An ultimate builder<br/>Sandbox world meets crafting &amp; mining – that’s why pixel games are so creative. Consider yourself a real crafter and use blocks to design real Tower, Big Ben or London Eye. Explore the infinite blocky world! Buildings are the piece of art in blocky games like London Craft! It’s time for your custom design. You deserve a sip of tea and delicious biscuit afterward!<br/><br/>Play minigames<br/>London calling! It’s your builder base where you can find a lot of blocky fun in cool minigames. Exploration and huge adventure could be exhausting, so enjoy beautiful minigame maps. Build an empire of blocky entertainment and take exploration craft to a new level!<br/><br/>Date boys &amp; girls!<br/>Find a boyfriend or girlfriend in the city of love and luxury! Look for friends or pick up girls and boys to chat and meet them in romantic places like London Eye or London subway. Unleash your creativity and ask them anything you want. Don’t be too harsh, though, because they are only poor little bots..<br/><br/>Party time!<br/>Best city building games for girls and boys let you have a great time! Organize a real tea party at home or take your friends to water park or go on the rollercoaster ride! Be not only the best city builder, but also a mastermind of fun! Leave home, take a London Bus and party in the whole city!<br/><br/>Become an interior and exterior designer<br/>Use your crafting skills and special items to prepare awesome interior design! Home design isn’t easy peasy but you’re a city builder after all! Take Buckingham Palace for inspiration! Royal chairs, tables, drawers, desks! Design the royal kitchen, design the queen’s bathroom and become the guard of a royal interior design! Quite impressive for a house builder!<br/><br/>Features:<br/>🇬🇧  Classic crafting &amp; building gameplay!<br/>🇬🇧  Love story in he romantic scenery on the Thames!<br/>🇬🇧  Exterior &amp; interior design craft with many blocks!<br/>🇬🇧  Sandbox mode – no borders!<br/>🇬🇧  London Eye – a ride with a majestic view!<br/>🇬🇧  Tower Bridge – visit the symbol of London!<br/><br/>Explore the infinite world<br/>You can travel anywhere you want! Ride cars, London subway, trains or craft a perfect vehicle for your own in one of the best city building games! Do whatever you dream of like crafting &amp; building a London zoo! It’s the United Craft Kingdom and the throne is yours!<br/><br/>Build anything you want!<br/>If your imagination is limitless and city building &amp; crafting games are you favourite, you should challenge yourself as a city builder of London Craft. You will be responsible for the home design and even for every light in London subway!<br/><br/>Let’s play a real crafting game!<br/>No time to wait – enjoy the best games for girls and boys. Design London bus, swim in the Thames, use your blocky building skills and become a real city builder. Find a date, take care of custom design, experience sandbox and story mode. One of the most exciting city building games!<br/><br/>🇬🇧  London Craft – one of the best crafting &amp; building games of 2018. DOWNLOAD NOW!", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:29:00", "background_image": "https://media.rawg.io/media/screenshots/630/630092403a6e93c128df81df3d3099c0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 76, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Survival Crafting & Exploration Adventure Games"], "genres": ["Casual"], "publishers": [], "esrb_rating": null}