{"id": 23399, "slug": "qbike", "name": "Qbike", "name_original": "Qbike", "description": "Fast paced moto-racing multiplayer game, inspired by famous cyberpunk movies and build for VR. <br/>Take control of a powerful Quantum Motorcycle — each with different abilities — and jump into virtual death race with other players in various unique locations. Select your skills and become the ultimate Quantum Arena Champion.<br/><br/>Classic light cycle gameplay with new impressive features and different game modes in your VR headset.<br/>Avoid enemy barriers and create your own to catch your opponents into your Qbike's \"tail\". Be fast and smart enough to become the winner. Create barriers in front of your opponents to destroy them. Use on-track power-ups and your bike's powerful skills to succeed in this quantum madness. Tune your race with different options and game modes to create a unique race experience.<br/><ul><li>Online multiplayer and leaderboards — dive into photon-powered cyberpunk <br/></li><li>Addictive gameplay — well-known classic \"snake\" mechanics in a cyberpunk world.<br/></li><li>Challenges and missions to complete and become Crypto Master!<br/></li><li>Abilities and Perks — improve your gameplay with powerful abilities to avoid death.<br/></li><li>Stylish visuals and beautiful synth wave soundtrack from talented musicians.<br/></li><li>Different game modes — already available two Deathmatch modes.<br/></li><li>Constant game evolvement with community feedback</li></ul>ALL THE FOLLOWING INFORMATION IS UPDATED AS THINGS GO:Qbike Roadmap in Discussions (click to open)Leaderboards and Performance Points<br/><br/>While we are testing and balancing new skills, you can start practicing in earning points! When the skill set is finished, Performance Points will help you to unlock and upgrade new player abilities.<br/><br/>Your points amount, total wins and kills scores will be added to world wide Qbike Leaderboards. <br/>We plan to upgrade and add more interesting statistics during the development. <br/><br/>Get your scores, rise in the leaderboards and become ultimate arena champion!Challenges and Multiplicator<br/><br/><ul><li>You can raise your PP by performing various tricks and challenges during the race.<br/></li><li>Every time you earn 100 PP you receive 1 bar to your total power multiplicator.<br/></li><li>Every level will multiply your race score until you die. To reach next Multiplicator level you'll need to complete challenges again, but you'll receive more points accordingly to the current Multiplicator level.</li></ul>Current Challenges AvailableWe are going to update and expand this list during EA.<br/><br/><strong>The following Challenges add one Multiplicator bar:</strong><br/><ul><li>Destoying opponent's bike<br/></li><li>Ride under Arch — Sneak under Barrier Arch to get 50 points<br/></li><li>Maneuver —  gives 100 points when fast-killing opponent with your barrier<br/></li><li>Air Time — starts after one second is spent in the air<br/></li><li>Drift Time — you can achieve this by making a fast turn before the jump<br/></li><li>Close Call — gives 50 points every moment while riding close to the opponent</li></ul><br/><strong>The following Challenges give you bonus scores in the end and during the match:</strong><br/><ul><li>Destroying player's bike gives you 200 points<br/></li><li>Kills in a row give you 50 on the second, 100 on the third, 150 on the 4th and so on<br/></li><li>Air Kill gives you 100 bonus points<br/></li><li>First place — 100 points<br/></li><li>Win without using Abilities — 100 points<br/></li><li>Win the match — 100 points<br/></li><li>Never die during the race  — 100 points</li></ul>Game Modes:<br/>Right now you can join players in two different deathmatch game modes:<br/><ul><li> Short Trail will vanish after some time so you'll need to think more.<br/></li><li> Long (infinity) Trail will disappear only after the player dies.</li></ul>MAPS:<br/>You can play on three maps with different game style:<br/><br/><ul><li> Simplex brings you to fast and deadly action in a small place with some jumpers on the map.<br/></li><li> Pillars is a flat map with no obstacles, good for first-timers.<br/></li><li> Quadrocopter is a vast map with high jumps. Good for Long Trail mode.</li></ul>COMFORT OPTIONS<br/>Some people are very sensitive to motion sickness so we made a few tweaks to reduce it in Qbike.<br/><br/><ul><li>The Vignette — Enable this option to gradually reduce your chance to get sick. It will make your player's sight/game screen darker to the sides when extreme motion happens. There are three different styles you can choose.<br/></li><li>Seat Position — Your seat is placed just right to make your cycle's frame always under your sight. You easily can recalibrate your position to make it more comfortable for yourself anytime.<br/></li><li>Camera Reaction — You can switch between two modes — one with fixed camera movements (default) for more comfort and one with a free camera, wich follows your bike pitches and rolls (motion sick warning!).</li></ul><br/>We will keep working to make Qbike comfortable for everyone and always looking for new ideas. If you have some — share them with us!SOUNDTRACK<br/>A vast collection of synth wave tracks from talented artists awaits you. Open true race passion with these memorable compositions, which you able to download as a free DLC.<br/>Big thanks to all following artists for allowing to use their music and help in creating such immersive experience:<br/><br/><ul><li>DJ Caile<br/></li><li>Isidor<br/></li><li>The Judgeman<br/></li><li>Mythical Vigilante<br/></li><li>Oolong<br/></li><li>Retro Thunder<br/></li><li>Starman<br/></li><li>Sub Morphine</li></ul><br/>You can find them on Soundcloud and find more info in the Soundtrack DLC.HAND STEERING CONTROLS:ARCADE STEERING CONTROLS:<br/>", "metacritic": null, "released": "2017-07-28", "tba": false, "updated": "2019-08-28T22:07:04", "background_image": "https://media.rawg.io/media/screenshots/793/793d66d6a3e74ac7990dcb57df066c68.jpg", "website": "http://gexagon.com/qbike.htm", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 13}, "playtime": 1, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 176, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["GexagonVR"], "genres": ["Action", "Simulation", "Sports", "Racing", "Casual", "Massively Multiplayer"], "publishers": ["GexagonVR"], "esrb_rating": "Everyone"}