{"id": 233948, "slug": "girls-survival-craft-princess", "name": "Girls Survival Craft: Princess", "name_original": "Girls Survival Craft: Princess", "description": "Games for girls taken to another level! Girls Cube Survival Craft  is here! Feel like a princess in her kingdom! Play one of the best free survival games for teenage girls! Build shelter during day, fight monsters (dragons, zombies, spiders) in the night! This lite (Pocket Edition Survival) game for teenage girls, inspired by the epic Pocket Edition girl game, gives you great opportunity to build a perfect cube girls world!  You can feel like a princess and live in a castle! The only problem are monsters (dragons, zombies, spiders), they come in the night. Prepare during the day - craft weapons, gather resources and prepare for the night!  Play in a creative mode with unlimited resources or mine deep into the cube girls world. Build your home with cubes. Design interior, build and design kitchen - start cooking! Build whole city with SPA, Nail Salon, Pet Shop, Make-up &amp; beauty salon! Serious pocket survival game for serious girls! Build your own shopping mall and take part in fashion show! Wear high heels shoes and explore randomly generated cube worlds, build and create amazing &amp; perfect structures from the simplest of homes to the grandest of cube fortresses and castles! Create your pink kingdom &amp; protect it from the monsters (dragons, zombies, spiders)! Use pink - girlish - blocks to build beautiful pink and colorful structures. Become an adventurer! Just cute cube world and your infinite creativity! Build perfect structures step by step, create awesome castles! Very quick and easy. All for free! This lite game contains: block placing, cube world, real time cute world generation, survival, monsters spawners. Good game for teenagers! Build a girl’s cube world! Explore the girl’s cube world! Build SPA, Beauty Salon, Hair Salon and Pet Shop! In this incredible and totally free game (dedicated, and designed for girls and women!) you can destroy all the blocks, collect resources, survive and build beautiful &amp; perfect Buildings. This creative game for teenage girls (Pocket Ed) contains a large number of different cute blocks (pink, yellow, colorful) with which you can craft your own teenage girls cube world! You can plant flowers in garden, bake cakes, build a house for your pet and friends or even build your own palace! Be like a princess or queen but you have to protect your kingdom! High resolution textures, very convenient and thoughtful game control, High FPS, without compromise! So plunge into the fantastic world of ‘Girls Survival Craft’ - with new cute cube worlds and adventures designed specially for girls! Place blocks / cubes move voxels, dig and craft and explore! Survive! One of the best cute free games for girls! Go beyond your wildest dreams, make your own cube base, mine castle or kingdom with survival mode! Transform the surface in a 3D environment. Build shelter, fight, grow, the only limit is your imagination! Start a Cube Craft Survival! Build SPA, Beauty Salon, Hair Salon and Pet Shop and protect it from monsters! <br/><br/>Coming soon:<br/>Multiplayer - girls game edition<br/>Crafting items and weapons<br/>Survival mode - girls game mode<br/>Day &amp; night<br/>Cube Craft mode<br/>Story mode (with dragons and bosses!)<br/>Weather<br/>Stats and inventory<br/>Different worlds (hell, heaven, lair)<br/>Cute animals (panda, kitten)<br/><br/>Love games? See our other games, even a non-girl version of this game (with different texure pack).<br/><br/>If you are interested in similar games such or other - please see our other games. <br/><br/>Build a cute fortress during day<br/>Survive the monsters attack in the night<br/>Build, create &amp; survive!", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T13:28:42", "background_image": "https://media.rawg.io/media/screenshots/1b8/1b809096f823f79a90d2351d2840acd3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 100, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Tiny Dragon Adventure Games: Craft, Sport & RPG"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}