{"id": 233936, "slug": "fishing-craft-wild-exploration", "name": "Fishing Craft Wild Exploration", "name_original": "Fishing Craft Wild Exploration", "description": "Building &amp; crafting… and fishing! Start Exploration of a blocky seas! Get the biggest catch! Become a fishing champion of square world! Fishing games! Craft new rods and gear! Let’s fish now! Craft the best fishing hook using materials found in sandbox blocky world, drive a car (jeep 4x4), explore and discover new fishing areas! Open world games! It’s an extreme sport fishing game simulator in a world build with blocks! Avoid the crocodile attack or angry shark while casting a fishing rod!   for sport fishing enthusiasts! Love building, constructing and have a hobby called fishing? Then start the game! Catch the best fish (marlin, shark, goldfish, catfish, salmon etc.) or an old shoe or… a mermaid! Looking for free crafting and  fishing games (bass fishing, ice fishing, fly fishing, sport fishing, big fish fishing and more) or best outdoor games? Great! Fishing craft offers the best summer fishing and winter fishing experience, so u don't have to search for any other hobby games anymore. Miner &amp; fisherman! Dig, build and catch!  Building &amp; crafting games with fishing mod! Build a city using blocks, start Exploration of blocky world searching for best fishing spot! Try to get the biggest catch! Sport fishing game! Design and decorate your fisherman’s house (design craft). Collect the trophies and explore the world! Creative game for people with hobby! Start the fishing adventure! Sandbox open world full of fishes to catch! Use boats or yachts to catch the rarest species. Some fish are really rare and need special unique equipment to catch!  Pocket edition pixel hero game! It’s a boys and girls craft! Sim game for real fishing fans! See what happens when the cat goes fishing! Experience the thrill of catching a variety of freshwater  &amp; saltwater fish. Improve your skills by finding the right combination of tackle, retrieval motion, and lake locations to catch bigger fish each outing. Great game for parents and adults as well! Wild catch &amp; square fish!  Become a master angler! Let’s fish in a square world! Craft, build and explore. Creative game for teenage boys and girls! Start ridiculous fishing now! Take your pet with you! Chat with other fishermen, buy a boat or luxury yacht and start catching the biggest fishes! Fishing hook games for free! <br/> <br/>Features:<br/>Building &amp; crafting<br/>Exploration <br/>Daily catch reward<br/>Wild catch mode<br/>Design a fisherman’s house<br/>Sailing<br/>Fishing from the boat or yacht<br/>Drive a 4x4 offroad car to get to the fishing spot<br/>Chat with other anglers<br/>Craft equipment: floats, sinkers, hooks, swivels etc.<br/>Craft new fishing rods! <br/> <br/>Upcoming features:<br/>Multiplayer  <br/>New fishes<br/>Girls craft fishing mode<br/>Story mode (goldfish wish)<br/>Realistic fishing duel", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-30T22:15:07", "background_image": "https://media.rawg.io/media/screenshots/388/3886aebee66fb17b6de3e8418330bcd1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 84, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Tiny Dragon Adventure Games: Craft, Sport & RPG"], "genres": ["Adventure"], "publishers": [], "esrb_rating": "Everyone"}