{"id": 234014, "slug": "death-trader-cold-war", "name": "Death Trader: Cold War", "name_original": "Death Trader: Cold War", "description": "Death Trader: Cold War is a strategy game about the controversial life of a arms dealer. You begin on January 1, 1960, with a brand new cargo airplane, which, apparently, was a present from Santa Claus. How'd you use such an invaluable asset in a profitable manner? Well, here's the way: just buy weapons from the military and sell it to rebels and insurgents! Obvious, isn't it? <br/><br/>The whole world with all its conflict areas is at your disposal - from the hills of Indochina to the Central American jungle. Conflicts are constantly arising and ceasing, and you can have an active influence on this process. Choose the side which cause is worthy to support and lead it to victory - or be a cynical hypocrite and sell weapons to both sides in order to prolong the confrontation for more personal gain. At first glance, the life of a arms dealer is not so complicated. You buy weapons through unofficial channels, using connections in military departments of different countries. Then you select a suitable buyers and send them a bulker or a plane with deadly cargo. If you reach the destination without any adventures, pirates and custom officers, and if your contractor is completely satisfied with everything - the deal is concluded. And while the time will be passing, new models of weapons will appear, and special services from different countries will begin to show more and more attention to your humble person...Key features:<ul><li>Dozens of weapons from 8 countries - from submachine guns to tanks;<br/></li><li>Nearly 50 historical conflicts and almost 100 different insurgent groups and governments that you can support;<br/></li><li>Dynamic map: territories change ownership not only with the current of history, but also depending on your direct actions;<br/></li><li>Trade rivals: other arms dealers, just like you - but obviously less successful. Steal their clients - run ahead and make deals right before your rivals to prevent them from gaining any profits!</li></ul><br/>Remember: illegal arms trade is a crime in accordance with international treaties and national laws! Don't try to use the game experience in real life. If possible, avoid getting into the arms trade, support of insurgent movements or unleashing of a new Cold War!", "metacritic": null, "released": "2018-09-28", "tba": false, "updated": "2019-08-28T21:53:38", "background_image": "https://media.rawg.io/media/screenshots/366/366bda63cd1771f198c3b19180397bb3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 20, "ratings_count": 0, "suggestions_count": 162, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Dreambakers"], "genres": ["Strategy", "Indie"], "publishers": ["Dreambakers"], "esrb_rating": null}