{"id": 234020, "slug": "egg-is-broken-heart-is-too", "name": "egg is broken. heart is too.", "name_original": "egg is broken. heart is too.", "description": "<strong>You are a chicken.</strong><br/><br/>Break into a restaurant kitchen and rescue your precious baby egg from the clutches of evil, hungry humans.<br/><br/>You can do it.<br/><br/>You have the power of motherly love.Gameplay Features<br/><br/><strong>Platforming with a twist!</strong><br/><br/>Run and jump your way through four stages filled with maddening, deadly traps - but it's not just your life on the line. If you drop your egg, it'll shatter to bits along with your hopes and dreams of motherhood. You'll have to rethink the way you move to safely navigate each obstacle and bring your egg back home in one piece.<br/><br/><strong>An unforgiving-yet fair-challenge</strong><br/><br/>This is an escort mission where there's no faulty AI to blame for your failures. The only things standing between you and victory are the laws of physics and your own skill and ability. Every obstacle can be overcome with time and patience; and every obstacle is an opportunity to improve your skills.<br/><br/><strong>Unlockable extras</strong><br/><br/>Was the main game too easy? Try these extra game modes once you've cleared all four stages:<br/><br/><ul><li> Speedrun mode: Set a personal speed record for each stage individually or for the game as a whole!<br/></li><li> \"Best Mother\" mode: How deep is your love? Try to clear each stage with the fewest number of drops!<br/></li><li> Ironman mode: Only for the skilled, brave, and patient! Can you make it through the entire game without breaking your egg even once?</li></ul>", "metacritic": null, "released": "2018-05-24", "tba": false, "updated": "2019-10-29T10:04:34", "background_image": "https://media.rawg.io/media/screenshots/de6/de6b56f2d1e2ab65b49545784d7ee418.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3, "beaten": 1}, "playtime": 2, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 177, "game_series_count": 0, "reviews_count": 1, "platforms": ["Web", "macOS", "PC"], "developers": ["ZACH CHANG.", "Curious Visions"], "genres": ["Action", "Casual", "Indie", "Platformer"], "publishers": ["Curious Visions"], "esrb_rating": null}