{"id": 234046, "slug": "puzzle-hopper", "name": "Puzzle Hopper", "name_original": "Puzzle Hopper", "description": "Puzzle Hopper is a game with an innovative mechanics, as it combines puzzles with infinite races.<br/><br/>Place pieces throughout the tour and help your character to get as far as possible.<br/><br/>Each piece is adapted to the terrain. Build mountains of block totally free as the game tetris.<br/><br/>Along the way you will collect apples to give your character. Using an apple, your hopper will be stopped for a while as he eats.<br/>Remember to use the pieces correctly to get as far as possible!<br/><br/>Note that your character can only go up and down from block to block, so you have to be careful and smooth the ground!<br/><br/><br/>Main features:<br/><br/>-Enjoy innovative  puzzle game similiar to tetris!<br/>-A Hopper character who advances turning and jumping blocks throught your built path<br/>- Help your hopper to get as far as possible by modifying the terrain<br/>- Give apples to your character, and save time while building a safe path<br/>- Play  infinitely and completely free, without intrusive advertising<br/>- Compete against your friends in world rankings<br/>- Skin shop available! Reach the best score and unlock new characters!<br/>- A couple of terrains ! Green Mountains, Inferno and Ice!<br/><br/>Download now this game that blends the best of puzzles and runners, and post your best score!", "metacritic": null, "released": "2015-09-13", "tba": false, "updated": "2019-07-29T18:51:23", "background_image": "https://media.rawg.io/media/screenshots/7aa/7aa256d8bbcaf56b3e689c761f75ae88_jpveY6G.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 60, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Etorki Games"], "genres": ["Arcade", "Casual", "Puzzle"], "publishers": ["Etorki Games"], "esrb_rating": null}