{"id": 23404, "slug": "light-fall", "name": "Light Fall", "name_original": "Light Fall", "description": "Explore the Forgotten World of Numbra to uncover your mysterious past and save the land and its inhabitants from an imminent threat. In this land of eternal night, you will rely on your Shadow Core to brave the many challenges and foes standing in your way. Do you have what it takes to survive in perilous Numbra?Key Features<br/><strong>The Ultimate Freedom</strong><br/>Control the Shadow Core and use it the way you see fit to face the challenges of the game. You can spawn this magical box beneath your feet to propel yourself into the air and move across the land at your own pace. With the Shadow Core, you become the master of your surroundings and create your own path.<br/><br/><br/><br/><br/><strong>An Immersive Journey</strong><br/>Load up Light Fall and immerse yourself in this strange universe where darkness prevails over the light. Joining you in this adventure, Stryx the old and grumpy owl, will act as your sidekick and in-game narrator. Depending on his mood, he will either offer useful advice or bluntly mock your failures.<br/><br/><br/><br/><strong>A Vast World to Explore</strong><br/>With the Shadow Core in hand, reach new heights and explore every nook and cranny of Numbra. Wander through the Lunar Plain, the Marshlands of Sorrows, the Vipera's Forest and the Unknown Depths, where shortcuts, alternative paths, hidden collectibles and easter eggs await you in large numbers.<br/><br/><br/><br/><strong>Speedrun Competition</strong><br/>Quench your thirst for competition in the complementary Speedrun Game Mode. Revisit the world of Numbra and experience exclusive levels where the difficulty has been drastically increased. Compete with players worldwide and compare your fastest times with theirs on the online leaderboard.<br/><br/>", "metacritic": null, "released": "2018-03-31", "tba": false, "updated": "2019-08-28T22:07:04", "background_image": "https://media.rawg.io/media/screenshots/405/405712a56f042219137cf22d8a843d19.jpg", "website": "http://lightfallgame.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 4, "owned": 67, "beaten": 4, "toplay": 5, "dropped": 4, "playing": 2}, "playtime": 6, "achievements_count": 33, "ratings_count": 4, "suggestions_count": 218, "game_series_count": 0, "reviews_count": 4, "platforms": ["Nintendo Switch", "macOS", "PC"], "developers": ["Bishop Games"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Bishop Games"], "esrb_rating": "Everyone"}