{"id": 234296, "slug": "slingo-adventure", "name": "Slingo Adventure", "name_original": "Slingo Adventure", "description": "Get ready to play the latest release from everyone's favorite puzzle franchise, Slingo®!<br/><br/>Join The Joker, The Cherub, and other classic Slingo characters on a bingo quest through the world of Fair Chance! It’s up to you to recover King Diamond’s stolen scepter and rescue the Queen from everyone’s favorite Slingo nemesis, The Devil.<br/><br/>Slingo Adventure combines classic slot machine gameplay with Bingo and Keno style number matching. Play through over 1000 (and counting) fun, fast paced levels by spinning, daubing, and wagering your way to success. Don’t forget! The faster you match, the bigger the bonus!<br/><br/>Use Power Ups to overcome challenges! Invite your friends via Facebook and keep track on each other’s progress and scores! Enjoy a variety of skill and chance minigames that let you wager your score! Newly added is the Collapse mode where you must clear the board within a set time! This is Slingo like you’ve never seen before!<br/><br/>**Game Features**<br/>1000 levels of Slingo number matching fun with more on the way!<br/>A whole new world of Slingo to explore<br/>Slots and Bingo with a bit of Keno style gameplay!<br/>Unlock 12 new and returning Power Ups! <br/>Wager your score in minigames!<br/>Connect on Facebook to challenge and help friends in their adventure!<br/><br/>Show that you’re a Slingo fan by liking us on Facebook! <br/>https://www.facebook.com/slingo<br/><br/>If you encounter issues with Slingo Adventure please contact our customer support team through the in-game customer service button or by emailing slingoadventuresupport@blastworksinc.com.", "metacritic": null, "released": "2014-10-16", "tba": false, "updated": "2019-10-22T14:18:59", "background_image": "https://media.rawg.io/media/screenshots/012/012ee17c2b861cf338518d5489190479.jpg", "website": "https://www.blastworksinc.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 76, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Blastworks"], "genres": ["Board Games"], "publishers": ["Blastworks"], "esrb_rating": "Teen"}