{"id": 234281, "slug": "pop-pixie-dress-up-high-princess-fairy-tale-girl", "name": "Pop Pixie Dress Up: High Princess Fairy Tale Girl", "name_original": "Pop Pixie Dress Up: High Princess Fairy Tale Girl", "description": "Rumor has it in Rainy city that the annual cute Pop Pixie contest will be next week. You quickly check on the Internet only to see that this is indeed true. You have only seven days to match up against the city’s most fashionable Pop Pixie!!!<br/><br/>Pop Pixie Dress Up puts you in a situation where you can show your cute fashion and dress up your own unique and unbelievably cute Pop Pixie. Only in this way you can achieve a version that is fitting for a winner in the city’s best Pop Pixie contest.<br/><br/>Get your groove on and put that fashion taste and creativity into good use. Create the cutest little Pop Pixie with the most outstanding and fashionable clothes and accessories.<br/><br/>------ How to Play ------<br/><br/><br/>Pop Pixie Dress up has a simple and fun gameplay. You can dress up your Pop Pixie by customizing every piece of clothing and accessory. The game is rich on customization so you can achieve whatever fashion ideas you have in mind.<br/><br/>You can customise your Pop Pixie hair, head accessory, dress, necklace and environment.<br/><br/>The game is free to play. You can however pay a small fee to have specific Pop Pixie models , as well as high class accessories or pieces of clothing unlocked.<br/><br/>What are you waiting for? Download Now!!<br/>------------------------------------------------------------------------------------------------------------------------<br/>Please rate this game and let us know what you think ! Your feedback is very important for me.", "metacritic": null, "released": "2016-03-23", "tba": false, "updated": "2019-10-22T14:18:58", "background_image": "https://media.rawg.io/media/screenshots/441/4413f059e3d5202e169259fcf7eaa9f6_7HGjJnp.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 85, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Pasin Jan-oun"], "genres": ["Action", "Family"], "publishers": ["Pasin Jan-oun"], "esrb_rating": "Everyone 10+"}