{"id": 23433, "slug": "everclicker", "name": "EverClicker", "name_original": "EverClicker", "description": "Can you save the EverVerse? Battle an endless army of enemies in an all-new RPG. Awaken tons of legendary heroes. Set up your team to fight for you nonstop. Collect rewards like gold, spells, pets and more, even while you’re away! Everclicker is fast and simple to start, but infinitely challenging to master!  <br/><br/>EVERCLICKER FEATURES:<br/>• Endless role playing game action: Save the EverVerse from the ravenous Star Devourer.<br/>• Summon knights, chefs, ninjas, killer shrooms and more. Your misfit hero collection awaits.<br/>• Level Up and restore the EverVerse in our ultimate prestige system.<br/>• Share and compete: Join team battles to earn epic rewards and premium currency!<br/>• Unique SciFi Fantasy original world and story.<br/>• 3D graphics and incredible animation.<br/>• Collect pets, spells, legendary abilities, and enchanted weapons.<br/>• Click heroes to fight: Fun, intuitive combat system.<br/>• Idle RPG mode: Collect gold nonstop and avoid the grind by letting your team fight for you.<br/><br/>EverClicker is completely free to install and play. However, some game items can be purchased for real money.<br/><br/>SUPPORT<br/>If you need a little help with your nonstop heroes, make sure to visit http://www.everclicker.com/support and check out the FAQs. Still need help? There’s information on that page to contact our support team.<br/><br/>COMMUNITY<br/>For the latest news and info, you can find EverClicker on Facebook (https://www.facebook.com/EverClicker/) Twitter (https://twitter.com/EverClicker) and Google Plus (https://plus.google.com/u/0/102295849165322694874).<br/><br/>Privacy Policy: https://www.kingsisle.com/corporate/mobile/privacy-policy <br/><br/>Terms of Service: https://www.kingsisle.com/corporate/mobile/terms-of-use", "metacritic": null, "released": "2017-05-16", "tba": false, "updated": "2019-10-22T14:30:36", "background_image": "https://media.rawg.io/media/screenshots/da2/da260fc08c3600a25c85a15537fc6af1.jpeg", "website": "http://www.everclicker.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 197, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["KingsIsle Entertainment"], "genres": ["Adventure", "RPG"], "publishers": ["KingsIsle Entertainment"], "esrb_rating": "Everyone 10+"}