{"id": 234374, "slug": "wheelie-king-3d", "name": "Wheelie King 3D", "name_original": "Wheelie King 3D", "description": "Experience the thrill of formula drift in our latest motorsport racing game! Wheelie King  Drift Racing 3D will test your skill to the limit. How far can you perform wheelie and stunts with your motorcycle? Can you impress everyone as you rampage through the city, desert, or on off road tracks? Play our motorsport game and find out!<br/>HOW TO PLAY: Tilt your phone to steer your motorcycle to left or right. Meanwhile, you can perform drift, wheelie, and stunts with the buttons. For example, you can use your thumb to tap forward and press throttle button to activate drifting mode. <br/>========================================================<br/>FEATURES OF WHEELIE KING 3D : <br/>========================================================<br/>Realistic and immersive game graphic &amp; sound. <br/>Unlock various challenges and tracks. <br/>Get coins to unlock more tracks &amp; off road challenges. <br/>Try your hand at riding low cc scooters and turbo bikes<br/>Upgrade your motorcycles and customize them <br/>Various tracks and roads to play, from off road, city road, and many more.<br/>Perform awesome motorcycle stunts on your bikes.<br/>Set your graphic to Low or HD depending on your phone type.<br/>Intuitive and response game control. <br/>See how you perform compared to other players on Online Leaderboards.<br/>TYPES OF CHALLENGE:<br/>Time Challenge (Free)<br/>Wheelie Challenge (Free)<br/>Drifting Challenge (Free)<br/>Island (Free)<br/>Desert (Free) <br/>City (Free)<br/>Country Side (Free)<br/>Parking Area (Free)<br/>Time Attack (Free)<br/>Midnight (Free)<br/>With traffic (Free)<br/>Chased by the police (Free)<br/>Our Motorsport game is very addictive and realistic. If you want to experience extreme motorcycle racing game, this is the game that you should try. Riding a motorbike is definitely more challenging than even the most extreme car driving simulator or even off road legends. That’s because you have to control everything at once: your direction, the speed, and how you throttle. To succeed as drift racer, you must give your 100% attention, especially if you are chased by the police! <br/>If you are a gamer who doesn’t back down from a challenge, then this game is perfect for you! So, if you are ready to take on this challenge, download our formula drift racing game now! <br/>---<br/>Please help us improve our games! Leave us your rating and review.", "metacritic": null, "released": "2018-04-06", "tba": false, "updated": "2020-05-29T02:33:59", "background_image": "https://media.rawg.io/media/screenshots/075/075a8940cca2d8f4774155669853be9b.jpg", "website": "https://www.youtube.com/watch?v=A3whViUfoMA", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 180, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["kimmo halonen"], "genres": ["Simulation", "Racing"], "publishers": ["kimmo halonen"], "esrb_rating": null}