{"id": 234489, "slug": "t-rex-escape-dino-racer-park", "name": "T-Rex Escape - Dino Racer Park", "name_original": "T-Rex Escape - Dino Racer Park", "description": "The T-Rex is chasing you! Jump on your jeep and drive as fast as possible through the jurassic jungle! If you're not fast enough you will get eaten!<br/><br/>If you love dinosaur games, this is the game you've been waiting for!<br/><br/>Are you ready to survive the mighty Tyrannosaurus Rex? Choose your jeep and drive in this awesome car chase game!<br/><br/>As you go faster and further on the jungle you will win cash and you'll be able to buy better and faster jeeps! Survive the chase buying the best jeeps on this dinosaur game!<br/><br/>You can overtake the other dinosaurs and you will win more points and more cash! If the Tyrannosaurus Rex is getting close, dodge the palms in the middle of the road and make the T-Rex crash with them!<br/><br/>There's no time to lose! Choose your car and show the dinosaurs who is the king of the jungle! Don’t become Tyrannosaurus Rex food!<br/><br/><br/>◉ KEY FEATURES ◉<br/><br/>- A car chase with a scary T-Rex!<br/>- Velociraptor, triceratops and more cool dinosaurs!<br/>- Infinite jurassic jungle!<br/>- Very simple controls!<br/>- Incredible graphics!<br/>- Leaderboards and achievements!<br/><br/>◉ GAMEPLAY ◉<br/><br/>- Tilt or Touch to steer<br/>- Touch gas button to accelerate<br/>- Touch brake button to slow down<br/><br/>◉ TIPS ◉<br/><br/>- The faster you drive the more points you get<br/>- When driving over 100 kmh, overtake dinosaurs closely to get bonus points and cash<br/>- If you do overtakes fast, you can do combos and win more points<br/>- If you dodge the palms in the middle of the road, the T-Rex will crash with them and you will gain some distance<br/>- If the T-Rex is too close, don't slow down or brake or you will get eaten<br/><br/>Have endless fun by downloading this Tyrannosaurus car chase dinosaur game!<br/><br/>Do not forget to give us a review!", "metacritic": null, "released": "2017-06-08", "tba": false, "updated": "2019-10-22T14:19:08", "background_image": "https://media.rawg.io/media/screenshots/113/1139b508a38e36da4c617d8e512872e2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 186, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Ivan Calle"], "genres": ["Simulation", "Arcade", "Casual"], "publishers": ["Ivan Calle"], "esrb_rating": "Everyone 10+"}