{"id": 234491, "slug": "furious-racer-car-fate-2018", "name": "Furious Racer Car Fate 2018", "name_original": "Furious Racer Car Fate 2018", "description": "Enjoy this awesome racing game with cockpit view. Drive your sports car through the highway, overtake traffic, earn cash, buy new cars. Try to be one of the fastest drivers in the global leaderboards! Live the street racing game!<br/><br/>If you love fast cars and furious racing games, this is the game you've been waiting for!<br/><br/>Are you ready to be the champion of this awesome racing game? Are you ready to be the best furious driver?<br/><br/>As you go faster and further on the highway you will win cash and you'll be able to buy better and cars! Own the street races buying the best super sport cars on this fast racing game!<br/><br/>You can overtake other cars and you will win more points and more cash! Also, you can take the ramp to jump and activate the turbo! Feel the speed from the cockpit view!<br/><br/>◉ KEY FEATURES ◉<br/><br/>- Lots of sports cars<br/>- Easy to learn and drive<br/>-  Car handling simulator<br/>- 3D realistic cockpit view<br/>- Incredible graphics<br/>- Endless traffic game mode<br/>- Leaderboards and achievements<br/><br/>◉ GAMEPLAY ◉<br/><br/>- Tilt or Touch to steer<br/>- Touch gas button to accelerate<br/>- Touch brake button to slow down<br/><br/>◉ TIPS ◉<br/><br/>- The faster you drive the more points you get<br/>- When driving over 100 kmh, overtake cars closely to get bonus points and cash<br/>- If you do overtakes fast, you can do combos and win more points<br/>- Take the ramp to jump and activate the turbo<br/><br/>Have endless fun by downloading this furious racing game and live your life a quarter mile at a time.<br/><br/>Do not forget to give us a positive review!", "metacritic": null, "released": "2017-04-12", "tba": false, "updated": "2019-10-22T14:19:08", "background_image": "https://media.rawg.io/media/screenshots/33a/33af59f5c3e20948f1d6a04933ce8d6b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 65, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["Ivan Calle"], "genres": ["Simulation", "Racing"], "publishers": ["Ivan Calle"], "esrb_rating": null}