{"id": 234465, "slug": "xmas-taxi-parking-simulator-3d-snow-drive-2017", "name": "Xmas Taxi Parking Simulator 3D - Snow Drive 2017", "name_original": "Xmas Taxi Parking Simulator 3D - Snow Drive 2017", "description": "The winter season begins and it's a time to drive &amp; park the city taxi in snow. If you love car parking, driving, and simulation games then this thrilling taxi simulator game is for you and it's' a free parking game!<br/><br/>This is not just another 3D parking simulator game here you will get a chance to improve your driving skills in the big city which is covered with snow. Once you master your parking skills you can get a driver's license and you will be able to safely transport your passengers and customers to the destinations in the city and park like a boss.<br/><br/>To get the thrill and realistic feeling of driving a taxi in the modern city we have made 30 real extreme levels with exciting missions and enthralling environments. To park in parking spots you need to take control of your nervous as there are many obstacles on your way like snowy roads, Christmas trees, luxury cars, moving barriers and various Challenging parking adventure.<br/><br/>Get ready for endless fun! Do you have what it takes to be a real taxi driver? Be a real taxi driver and Don't crush or drive recklessly, other wise you may hit your yellow cab and it will be damaged. There are 6 Free luxury car taxi that meets all the rules and standards of a modern city.<br/><br/><br/>Features:<br/><br/>- Extreme breath-taking 3D graphics<br/>- Unique cameras to get the perfect view for car drive.<br/>- Realistic Parking Lot<br/>- Smooth controls, show your perfect parking skills<br/>- There is a time limit for each parking mission.", "metacritic": null, "released": "2016-12-08", "tba": false, "updated": "2019-10-22T14:19:07", "background_image": "https://media.rawg.io/media/screenshots/97d/97dcac03cae9e748440edb3bf4f35cbd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 120, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Muhammad Usman Shah"], "genres": ["Simulation", "Racing"], "publishers": ["Muhammad Usman Shah"], "esrb_rating": "Everyone 10+"}