{"id": 234496, "slug": "real-american-city-speed-racing-2017-snow-street", "name": "Real American City Speed Racing 2017 - Snow Street", "name_original": "Real American City Speed Racing 2017 - Snow Street", "description": "The 2016 winter racing season is about to begin! Be a snow man racer in car. This will be the real life ride that you can imagine. You need to be a real skilled racer to  compete in these Illegal races as there are no rules and no police chase, your only ambition is to become top street racer of American city at any cost. For seemless fast racing experince the traffic in city is stoped.<br/><br/>It's time to fasten your seat belt and race in car. Take control of your crazy car by going behind the wheels, use nitro to get the top speed of the car and overtake the relentless rivals in street racing. It's not that easy to chase these hot cars in these tracks as they are covered with snow of the winter. While driving the car hit the ramps and make awesome stunt tricks to fly your car at extremely high speed. Become furious and make stunts along difficult routes. You need to calm down while taking turn on street corners.<br/><br/>You will get the best car simulator experience of 2016. You can even enjoy your riding in the nights of streets as sometimes you get tired of racing in sunlight. Its your time to become a real racing racer.<br/><br/>Real City Speed Racing 3D Features: <br/>-  Its Free for life time!<br/>-  Drive and customise the most speedy cars<br/>-  Explore the breathtaking views of snowy winter roads in city<br/>-  Earn Gold and buy modern sports cars and upgrade them. It's Free!<br/>-  Extreme Fast racing tracks<br/>-  Sunlight and Night Modes<br/>-  Real 3D Graphics and tracks<br/>-  Slow motion Camera effects while car flying<br/>-  Most realistic car dynamics( brakes, engine, acceleration, brakes, drifts, etc)<br/><br/>GAMEPLAY<br/>• Real steering mode<br/>• Automatic Transmission<br/>• Live units for speed measurement<br/>• 3 Uniques camera angles to drive the car, choose according to your driving style<br/>• Realistic simulation of all aspect (engine, drivetrain, tires, etc.) of the car<br/><br/>Realistic 3D Car Controls:<br/>• Tilt Screen<br/>• Using Car Steering <br/>• By tapping on the left and right controls on the screen", "metacritic": null, "released": "2016-12-02", "tba": false, "updated": "2019-10-22T14:19:08", "background_image": "https://media.rawg.io/media/screenshots/dab/dab947df9e01fa0f3d9a84320c5e968f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 132, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Muhammad Usman Shah"], "genres": ["Simulation", "Racing"], "publishers": ["Muhammad Usman Shah"], "esrb_rating": "Everyone 10+"}