{"id": 234402, "slug": "vr-tunnel-race-pro-speed-rush", "name": "VR Tunnel Race Pro: Speed Rush", "name_original": "VR Tunnel Race Pro: Speed Rush", "description": "The most exciting VR Racing game ever. Download now and experience tunnel vision as an astronomer!! Best VR RPG you can find!! Put on your oculus rift and try more vr games!!<br/><br/>Imagine how terrifying yet exciting at the same time once you are trapped in a condensed environment like one in a black hole. You are an astronomer, after a time travelling in space, you suddenly got trapped in a weird tunnel. It hypnotizes you with multi colors.<br/><br/>Could it be a time tunnel? What kind of multi colored tunnel is this? Is it possible that you can find a real time tunnel instead of those same old boring stars you always see?<br/><br/>Whatever the hell this vr tunnel is, you are stucked and there is only one uncertain way out, partly virtual reality. Panicking and excited, you climb into one of the nearby spaceships. The speed was already set. You are ready for a roller coaster experience. Your exciting mission now is just to glide through time and space in a tunnel vision by tilting your phone/ your cardboard. The black hole distorted your mind. It is a virtual reality experience, tunnel vision.<br/><br/>All the trapped light inside created an explosion of color, a virtual reality view. Contrary to the pitch black you thought about black hole, the inside was multi colored. To get out, it feels as if you are in the movie series Fast and Furious.<br/><br/>Only with tunnel vision. This VR RPG game is not for those with a soft heart; it’s for real soldiers. If you think you have enough mentality, or a fan of roller coaster, climb on your vr spacecraft. This vr rpg game is no joke. You will die and collide. You will be shattered. It is dangerous. You will suffer from nausea to get out of this time tunnel. Yet you will never be defeated. You can always try again.<br/><br/>Try hard to escape with your roller coaster ride.<br/><br/>Play this vr rpg game now for a virtual reality experience. One of the best vr games you can find.<br/><br/>Try the cardboard app now.<br/><br/>Download VR Tunnel Race Pro Now!!<br/><br/>DTA Mobile<br/>Like us: https://www.facebook.com/DTAMobile<br/>Follow us: @DTAMobile", "metacritic": null, "released": "2016-09-09", "tba": false, "updated": "2019-10-22T14:19:04", "background_image": "https://media.rawg.io/media/screenshots/7f6/7f69f75a3e6c9f141e19c7f18933e97a.jpg", "website": "http://facebook.com/dtamobile", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 158, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["International Education and Communication Investment"], "genres": ["Adventure", "RPG"], "publishers": ["International Education and Communication Investment"], "esrb_rating": "Everyone 10+"}