{"id": 234471, "slug": "motorbike-driving-simulator-impossible-tracks-3d", "name": "Motorbike Driving Simulator - impossible Tracks 3D", "name_original": "Motorbike Driving Simulator - impossible Tracks 3D", "description": "Do you love impossible games that are challenging and fun? If yes this Impossible Moto Bike Tracks 3D is for you. Get ready for ultimate moto bike driving on sky roads by playing Impossible Tracks motorbike Simulator game of 2017. Be a furious driver of motor bike and do drifting and crashing in this auto action packed game. The helicopters are also flying in the air to destroy your luxury motorbikes, you need to race fast both of your heavy bike and dirt bike to avoid the crash. Avoid impossible fall to become the legend of biking by completing all the challenging and thrilling missions on sky roads.<br/><br/>You will feel like you are driving for your life on crazy heights to accomplish impossible missions. Perform killer stunts with powerful superbike by doing risky jump over the ramps that are sky high. Driving motorcycle on narrow paths is almost impossible as the hurdles and obstacles are very hard to overcome so to make it possbile you need extreme moto bike driving skills for this zig zag race. Falling down from impossible tracks will make this simulator game over.<br/><br/>To perform crazy stunts on crazy heights first wear your bike helmet as safety then as a real stunt rider of moto climb up the massive heights but do not fall down the from sky roads or get hit by flying helicopters otherwise your motorcycle will be crushed.<br/><br/><br/>Impossible Motor Bike Tracks 3D Features:<br/>- Real life motobiking experience<br/>- Mid-air stunts and sky high driving tracks<br/>- Sports cars with real stunt cars inside in impossible tracks games.<br/>- Xtreme bike stunts and realistic biking simulation <br/>- New free car driving game of 2017 with thrilling new high tracks<br/>- Amazing tracks dangerous sharp turns with jumps and obstacles<br/>- Heavy nitro engine for acceleration for impossible car racing simulator experience", "metacritic": null, "released": "2017-04-28", "tba": false, "updated": "2019-10-22T14:19:07", "background_image": "https://media.rawg.io/media/screenshots/9d7/9d7c1651825b3962c05ef82646f38a0b_gL2HPQy.jpg", "website": "https://www.facebook.com/top3Dgamessimstudio", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 126, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Muhammad Usman Shah"], "genres": ["Simulation", "Racing"], "publishers": ["Muhammad Usman Shah"], "esrb_rating": "Everyone 10+"}