{"id": 234483, "slug": "police-car-chase-smash-vs-criminal-gangster-escape", "name": "Police Car Chase Smash vs Criminal Gangster Escape", "name_original": "Police Car Chase Smash vs Criminal Gangster Escape", "description": "Do you love police chase games in cars? You have a chance to play police chase game where you are the criminal of big New York city. You may have played police chasing games as a cop but this time your role is to become a extreme member of gangsters instead of a police officer. The main purpose of this real cop simulator game is to train the police car officers for this you have given a role of a criminal where you have to accomplish challenging missions by real furious drive in cars. Speed up to set fire on the roads and don't let police cars pull over your car. Police is chasing you with all their strength you have to escape from them by using your daring skills of driving.<br/>There is a abandoned city where police chase down gangsters, criminals, escaped prisoners and most wanted killing mafia members to end lawlessness due to high crime level to accomplish this police duty in the town police has to smash gangsters cars that have made a successful prisoner escape.<br/><br/>Gameplay for police car chase training:<br/><br/>▶ Ride to the targeted location. Time is very important in our business, so make it done in given time.<br/>▶ Pick up the package and deliver it to hideout before it gets too late!<br/>▶ Escape from police cars for specific duration <br/>▶ Pick package and deliver it to the gang, be alert! police is chasing you!<br/>▶ Pick Wanted person and drop him in safe house. Be careful don't get caught!<br/>▶ Now reach to the safe zone in given time don't let police arrest you!<br/>▶ Pick two dealers from their respective locations and drop them to the club safely!<br/>▶ Speed up to set fire on the roads for 2 minutes and don't let police cars pull over your vehicle.<br/>▶ Reach to the safe zone in given time don't let police arrest you!<br/><br/><br/>Our players are very important to us at Tech 3D Games Studios (T3GSS). We want to make better police car games and also prisoners games that are source of fun for car racing fans.<br/><br/>If you like Police Cars vs Gangster Escape simulator games then please don't forget to rate this game!", "metacritic": null, "released": "2017-01-17", "tba": false, "updated": "2019-10-22T14:19:08", "background_image": "https://media.rawg.io/media/screenshots/b5c/b5cf79cb86cbbfe67671f83523f52e6f.jpg", "website": "https://www.facebook.com/top3Dgamessimstudio", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 136, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Muhammad Usman Shah"], "genres": ["Simulation", "Racing"], "publishers": ["Muhammad Usman Shah"], "esrb_rating": "Everyone 10+"}