{"id": 234452, "slug": "impossible-car-tracks-3d-stunt-driving-simulator", "name": "Impossible Car Tracks 3D: Stunt Driving Simulator", "name_original": "Impossible Car Tracks 3D: Stunt Driving Simulator", "description": "Are you ready to enjoy ultimate car driving on sky roads by playing impossible tracks games? Welcome to new Impossible Stunt Cars Tracks Simulator game where you can drive amazing cars on massive heights to touch the skies like a legend. Get unique driving experience on impossible tracks by performing crazy stunts on ramps with super muscle cars. Be careful while racing the car to avoid impossible fall.<br/><br/>You will get the feeling of a real stunt rider by playing Impossible Tracks simulator game. Choose your 4x4 car among multiple super Grand luxuries cars with super suspension and realistic breaking physics. To perform crazy stunts, tighten your seat belt and enjoy loads of grand vehicles while climb up the massive heights but try not fall down on the city otherwise you will lose. Dare to be a fearless driver to drive the cars on deadly and impossible roads. Driving on impossible roads with extreme cars needs special training as climbing on massive heights by doing mid-air ramps stunts is a hard drive.<br/><br/>Every level is thrilling and challenging that makes it most exciting car stunt game. Reach to the check point by doing serious stunts but you need to do this really fast to reach the finish line as racing time is limited. Enjoy the fastest and most exhilarating 3D stunts action on un possible path.<br/><br/>Impossible Stunt Car Tracks 3D Features:<br/><br/>- Mid-air stunts and sky high driving tracks<br/>- Sports cars with real stunt cars inside in impossible tracks games.<br/>- Xtreme car stunts and realistic car driving simulation<br/>- New free car driving game of 2017 with thrilling new high tracks<br/>- Amazing tracks dangerous sharp turns with jumps and obstacles<br/>- Heavy nitro engine for acceleration for impossible car racing simulator experience", "metacritic": null, "released": "2017-04-28", "tba": false, "updated": "2019-10-22T14:19:06", "background_image": "https://media.rawg.io/media/screenshots/bf2/bf207351143946062d74209248467e7e.jpg", "website": "https://www.facebook.com/top3Dgamessimstudio", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 140, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Muhammad Usman Shah"], "genres": ["Simulation", "Racing"], "publishers": ["Muhammad Usman Shah"], "esrb_rating": "Everyone 10+"}