{"id": 234500, "slug": "usa-army-truck-simulator-ramp-truck-driving-mod", "name": "USA Army Truck Simulator - Ramp Truck Driving Mod", "name_original": "USA Army Truck Simulator - Ramp Truck Driving Mod", "description": "Do you like hard army games? Are hard driving games are fun and thrilling for you? If yes then this Impossible Army Truck Driving is for you where you drive army trucks on sky high roads. Cargo Army Truck driving on impossible tracks is hard driving game. As a USA army truck driver take control of oil tanker on dangerous tracks that are made of containers in the space. If you love driving big truck or heavy vehicles on dangerous roads then this truck simulator game of 2017 is for you. While driving USA army oil tanker take sharp turns on road corners and zigzag tracks which are hard to drive. Do Armed force Truck Driver Duty on massive heights.<br/><br/>In this impossible game drive fuel tankers through crazy heights, grand paths and impossible tracks. Blood curdling obstacles and military helicopters are flying in air to destroy your heavy transport truck. Feel the thrill of army truck driving simulator 3d on massive heights. Roads are hard to drive and one mistake can cause a huge destruction to army oil tanker.<br/><br/>Get behind the wheel of a big truck with big steering in hand to perform your military duty as a legend trucker driver. This army transport truck adventure is a thrilling offroad truck driving game with freestyle feat and insane stunts on crazy heights. This USA Army Truck Hard Tracks Driving is a test and training for drivers who have height phobias. As a unpossible racer climb massive gravity defying grand paths in impossible tracks driving simulator game of 2017. In this US army training school game the only hurdle in your way is time and challenging hurdles.<br/><br/>Army Truck Hard Tracks Driving Features:<br/>Smooth and realistic Trucks and heavy vehicles physics. You will feel it on narrow paths in this run impossible game<br/>Different locations with different heights and depth, narrow paths to enjoy the ride<br/>Smooth and easy controls to make your impossible race easy<br/>Stunning sound effects and visuals<br/>Many powerful and beautiful Germany, Russian and USA Army Trucks to choose and play with", "metacritic": null, "released": "2017-05-18", "tba": false, "updated": "2019-10-22T14:19:09", "background_image": "https://media.rawg.io/media/screenshots/46f/46f4adfc87f089b424bde08c422d41a9.jpg", "website": "https://www.facebook.com/top3Dgamessimstudio", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 177, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Muhammad Usman Shah"], "genres": ["Simulation", "Racing"], "publishers": ["Muhammad Usman Shah"], "esrb_rating": "Everyone 10+"}