{"id": 234577, "slug": "balls-bounce-2", "name": "Balls Bounce 2", "name_original": "Balls Bounce 2", "description": "Balls Bounce 2: Bricks Challenge arrives in the App Store and brings the free-to-play arcade game enjoyment for all Balls Bounce fans. <br/><br/>The unique mix between brick breaker and bubble shooter games, perfect time killer to spend your leisure time. <br/><br/>Over hundreds of challengeable levels, clear the stages by eliminating bricks on the board. This brick breaker block game is going to be a hit! <br/><br/>▶ HOW TO PLAY?<br/>Swipe your finger and throw balls, break all bricks and finish all puzzle challenges. Boost your score by skills and concentration, time to challenge and shoot balls with your friends now!<br/><br/>▶ Balls Bounce 2 – Bricks Challenge Game Features <br/>* Over 1000 challenges, can play without an internet connection<br/>* 10 different items and numbers of special bricks<br/>* No time limit, best casual game to kill your free time<br/>* Coolest Super Aim! Crash all bricks precisely<br/>* Stunning graphic: burst all bricks!<br/>* More than 20 color ball patterns <br/>* Free to play bouncing balls game, easy to play and free for all ages<br/><br/>Like the classic bubble shooter game, you need to focus on balls chain, release your balls snake and shoot balls, bounce your ball chain and brick all bricks. Balls Bounce 2 is suitable for players who love ball bricks breaker puzzle games, classic arcade games, searching for the best casual arcade game like bouncy balls, kick balls games and free block breaker games. <br/><br/>Download for free today, relax your brain in the addicted ball bouncy bricks game world!<br/><br/>▶ Subscription options<br/>We have the following subscription periods in Balls Bounce 2:<br/>1. Weekly VIP Membership offers a weekly subscription for $7.99 which provides 300 diamonds per day, Super Aim and Remove Ads.<br/><br/>2. Monthly VIP Membership offers a weekly subscription for $19.99 which provides 300 diamonds per day, Super Aim and Remove Ads.<br/><br/>3. Yearly VIP Membership offers a weekly subscription for $99.99 which provides 300 diamonds per day, Super Aim and Remove Ads.<br/><br/>This price is established for United States users. Pricing in other countries may vary and actual charges may be converted to your local currency depending on the country of residence.<br/><br/>End of Trial and Subscription Renewal<br/><br/>Payment will be charged to your iTunes Account at confirmation of purchase.<br/><br/>Subscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the current period.<br/><br/>The account will be charged for renewal within 24-hours prior to the end of the current period, and identify the cost of the renewal.<br/><br/>Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user’s Account Settings after purchase.<br/><br/>Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that publication, where applicable.<br/><br/>Canceling trial or subscription<br/><br/>You can turn off the auto-renew for the subscription whenever you want to through iTunes. Check https://support.apple.com/HT202039. When your current trial/subscription period expires, you will be unsubscribed. The current active subscription period cannot be canceled. When your subscription expires, you will no longer be able to use elements included in Subscription option.<br/><br/>If you have any questions or comments, feel free to contact us at SilverAlpaca_games@hotmail.com<br/><br/>Privacy Policy: https://sites.google.com/view/silver-alpaca-privacy-policy<br/>Terms of Service: https://sites.google.com/view/silveralpacatermsofservice<br/>Terms of Subscription: https://sites.google.com/view/auto-renewable-subscription", "metacritic": null, "released": "2018-03-28", "tba": false, "updated": "2019-07-29T14:40:01", "background_image": "https://media.rawg.io/media/screenshots/6af/6af0c17cb378e8049be13bef638a6224.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 108, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Odd Otter", "Alpaca Silver"], "genres": ["Arcade", "Board Games", "Puzzle"], "publishers": ["Odd Otter", "Alpaca Silver"], "esrb_rating": "Everyone 10+"}