{"id": 234584, "slug": "megapolis-hd", "name": "Megapolis HD", "name_original": "Megapolis HD", "description": "Ever wanted to build your own city? <br/>Welcome to Megapolis, an economic city building strategy game based on the law of markets. <br/>Megapolis stands out from other city building games and tycoon simulators with its thoughtful approach to gameplay and huge range of features. Build houses and skyscrapers, expand your territory, collect resources and take part in different competitions with thousands of other players all over the world - the fate of your city is in your hands, Mayor. Prove that you are the perfect city planner!<br/><br/>Play the best city sim absolutely free!<br/>All you need is a smartphone or tablet and an internet connection. <br/><br/>In this strategy game you’ll find everything you need to create your perfect city:<br/><br/> - well-developed economic modeling, allowing you to effectively manage your city;<br/> - awesomely realistic 3D graphics with magnificent natural landscapes;<br/> - regular exciting updates, innovations of architecture and world famous buildings - from antiques to modern classics;<br/> - opportunities to invite friends and visit neighboring cities;<br/>free daily gifts;<br/> - the ability to build and expand your city;<br/> - a chance to join the global leaderboard of the best players;<br/> - and even more!<br/><br/><br/>Megapolis is constantly growing. Your gameplay experience is our priority, so updates are released regularly. Great promotions are waiting for you in the game store so you can adorn the streets of your city with unique buildings and decorations.<br/><br/>Create homes for your citizens, build factories and restaurants, open parks and gardens, explore new islands and regions, and turn your Megapolis into the best city on the planet! Have fun building a city from the ground up!<br/><br/>In order to make your city grow, you’ll have to learn the ropes of the Mayor's work. You need to attract new citizens, build new roads, develop infrastructure - and don’t forget about the city treasury! Build an empire with airports, railway stations, seaports, mining rings, and wind, solar and atomic power plants. You can even launch a rocket to the Moon! The sky’s the limit!<br/><br/><br/>You can even merge towns and cities into states! Together with other Mayors and Tycoons, you can create the Capital of the State. Teamwork will open the door to even more new horizons!<br/><br/>Megapolis is the best city simulator around! Join us and create the super city of your dreams!", "metacritic": null, "released": "2013-01-31", "tba": false, "updated": "2019-10-22T14:19:15", "background_image": "https://media.rawg.io/media/screenshots/618/6187a1609eceba4507bf794b69bb38a1_IaDBvhz.jpg", "website": "http://www.socialquantum.com/en/games/megapolis", "rating": 0.0, "rating_top": 0, "added_by_status": {"beaten": 1, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 242, "game_series_count": 0, "reviews_count": 2, "platforms": ["iOS"], "developers": ["Social Quantum"], "genres": ["Strategy", "Simulation"], "publishers": ["Social Quantum"], "esrb_rating": "Everyone 10+"}