{"id": 234514, "slug": "bottle-shoot-3d-expert-flipping-bottle-shooting", "name": "Bottle Shoot 3D Expert - Flipping bottle shooting", "name_original": "Bottle Shoot 3D Expert - Flipping bottle shooting", "description": "Do you love playing bottle shooting games with gun and got all what it takes to be a real bottle shoot master? If you like shooting games with gun or sniper then here you have a chance to master the shooting skills by playing free Bottle Shoot 3D. Take a breath, aim the target, shoot the moving flipping bottles and hit the bull's eye now.<br/><br/>Bottle shooter and archery games improve your focus and accuracy skills level.take accurate shots to smash all the bottles with pistol.while playing broken glass game be calm and stay focused while shooting the moving bottles. This new bottle blast game is specially design to test and improve shooting skills as gun shooter play vital role in army forces, police snipper training to fight terrorists and prisoners in the battlefield. Blast it all with your gun to become bottle shooter expert.you need strong pistol grip for bottle shoot in the fixed time duration.this classical shooter game needs focus and precision for bottle hunt master as the levels become harder and thrilling with limited time.<br/><br/>To start Bottle shoot 3D you need to aim at the bottle by moving gun with screen touch then once you lock the target with pistol just press shoot button to blast all within time.you may have break the bottles with stone or arrow but this time you have a gun in your shooting hand to blast the bubble bottles game that are moving in the water and air.Do copter hunting as some targets are moving in flying copters to break them you need to be a real copter hunter.experience shooting in different adventures! <br/>Gun Bottle Shooting Expert 3D Features<br/>Play anywhere, doesn't require an internet connection<br/>Realistic gun shooting and broken glass sound <br/>Both endless and challenging levels shooting gameplay<br/>Be accurate to get extended shooting experience<br/>Shoot like a real cowboy<br/>Bottle shoot game is for kids, youngsters and adults<br/>Full of thrilling action packed game<br/>Thrilling sound effects<br/>Very smooth control of guns", "metacritic": null, "released": "2017-03-06", "tba": false, "updated": "2019-10-22T14:19:09", "background_image": "https://media.rawg.io/media/screenshots/abf/abf817b2e64e031e8eb5ec8f1eac1f30_Pwy0WnQ.jpg", "website": "https://www.facebook.com/top3Dgamessimstudio", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 152, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Muhammad Usman Shah"], "genres": ["Action", "Arcade"], "publishers": ["Muhammad Usman Shah"], "esrb_rating": "Everyone 10+"}