{"id": 234535, "slug": "kung-fu-tiger-ninja-panda-3d", "name": "Kung Fu Tiger & Ninja Panda 3D", "name_original": "Kung Fu Tiger & Ninja Panda 3D", "description": "Kung Fu Tiger &amp; Ninja Panda brings the ancient Kung Fu world to your phone!<br/>Put on your dark ninja suit and become the best martial arts expert of all Asia!<br/><br/>Tigress has always been in love with martial arts. She watched every martial arts movie out there... Kung Fu Lion, Panda Tae Kwon Do Master, Muay Thai Gorilla in China Town, Taichi Mantis, etc. But above all she loved Kung Fu.<br/>Tigress is not a little tigress anymore and has decided to leave her home and travel all asia to find the famous Ninja Panda. He is supposed to be the best Kung Fu Master ever, so Tigress is going to ask him to become his disciple.<br/>The Ninja Panda is an old legend but with your help Tigress will find him for sure!<br/><br/>Run through the asian sky islands and try to be the fastest ninja in the global leaderboards. Compete against your friends to be the best martial arts expert!<br/><br/>The asian sky islands are full of obstacles you should dodge. Go as fast as you can and collect all the gold coins.<br/>Use powerups to cheat death. Use coins to upgrade the powerups.<br/><br/>* Dash and dodge as fast as you can!<br/>* Swipe to do awesome jumps, slides, tricks and more!<br/>* Online leaderboards and achievements!<br/>* An awesome panda legend!<br/><br/>Martial arts games had never been so fun!", "metacritic": null, "released": "2016-01-28", "tba": false, "updated": "2019-10-22T14:19:11", "background_image": "https://media.rawg.io/media/screenshots/d0d/d0d2ac033df7fdf1517a3a8d64d6359f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 140, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Ivan Calle"], "genres": ["Arcade"], "publishers": ["Ivan Calle"], "esrb_rating": null}