{"id": 23463, "slug": "the-shadow-warrior-collection", "name": "The Shadow Warrior Collection", "name_original": "The Shadow Warrior Collection", "description": "The Shadow Warrior Collection includes both the first Shadow Warrior and Shadow Warrior 2.<br/><br/>Shadow Warrior is a bold reimagining of the classic 3D Realms’ shooter from independent developer Flying Wild Hog starring the legendary and quick-witted warrior Lo Wang. <br/><br/>Shadow Warrior 2 is the stunning evolution of Flying Wild Hog’s offbeat first-person shooter following the further misadventures of former corporate shogun Lo Wang. Now surviving as a reclusive mercenary on the edge of a corrupted world, the formidable warrior must again wield a devastating combination of guns, blades, magic and wit to strike down the demonic legions overwhelming the world. Battle alongside allies online in four-player co-op or go it alone in spectacular procedurally-generated landscapes to complete daring missions and collect powerful new weapons, armor, and arcane relics of legend.<br/><br/>n/a<br/><br/>  Software subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service &amp; playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.<br/><br/>", "metacritic": null, "released": "2017-05-19", "tba": false, "updated": "2019-08-02T16:21:45", "background_image": "https://media.rawg.io/media/screenshots/133/1330f8c60f14366ce8d359c6ad32fbd7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 2, "dropped": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 595, "game_series_count": 0, "reviews_count": 0, "platforms": ["PlayStation 4", "Xbox One"], "developers": ["Devolver Digital"], "genres": [], "publishers": [], "esrb_rating": null}