{"id": 234665, "slug": "antiblock", "name": "AntiBlock", "name_original": "AntiBlock", "description": "If you are someone who hates waiting：in line at the market, for your clothes to dry on laundry day, when you pick the kids up from school, or for your name to be called when you are waiting to see your doctor (Ugh!)... then you will enjoy this game！<br/><br/>It is easy to play - you just slide the tiles around. However, you do have to figure out where to slide them. You don’t have to race against a timer, so you can play at a leisurely pace. You can put the game down, get coffee (or whatever you need to do), and when you come back, you can pick up right where you left off. Give it a try! Oh yeah - you don’t have to spend money to play either! There aren’t many games like that. <br/><br/>HOW TO PLAY:<br/>\u2028Move the blocks with your finger, make a tunnel for the little ball rolling to the exit. No time and step limits but the player made it with fewest steps will gain 3 stars reward. Do not forget to use the hammer as a good helper in game! If you are stuck, use hammer to break a block! It will offer you more space to move blocks and find the optimized path for your ball to go out.<br/><br/>FEATURES:<br/>•A challenge and fun game which is totally FREE to download, play and update.<br/>•Very simple to use interface: perfect for both kids and adults!<br/>•High quality graphics and pleasant running effects.<br/>•Get free bonus rewards &amp; hints occasionally!<br/>•Watch video ads for more free hints.<br/>•Works with: iPhone, iPad.<br/><br/>\u2028\u2028Enjoy the game! Slide the block and roll the ball!", "metacritic": null, "released": "2018-09-01", "tba": false, "updated": "2019-10-22T14:19:17", "background_image": "https://media.rawg.io/media/screenshots/e83/e838c128fd7394aa44acfdf9e395bb29.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 73, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Yanfei Liu"], "genres": ["Strategy", "Puzzle"], "publishers": ["Yanfei Liu"], "esrb_rating": "Everyone 10+"}