{"id": 23467, "slug": "league-of-maidens", "name": "League of Maidens", "name_original": "League of Maidens", "description": "League of Maidens is a 3D free-to-play online battle arena real time strategy game for PC featuring beautiful maidens with superhuman powers. Players battle in teams of 3 to destroy towers guarding the enemy base. The match is won when all towers are destroyed including the main tower located in the enemy base.<br />\nIN-DEPTH CHARACTER CUSTOMIZATION:<br />\nThe game features FPS style shooting and projectile attacks, 3rd person melee fighting with combo ability and combo counters, building and environment destruction, dynamic day/night cycles and weather, human flight at the speed of sound, swimming, car/truck driving, lifting and flying with cars/trucks, grabbing enemies while flying at high speed and smashing them into the ground or buildings, indoor and outdoor combat, in-depth character customization, building and recruiting military assets (soldiers, tanks, turrets, war ships and jets) and much more.<br />\nMOTION REPLAY (CREATE YOUR OWN GAME TRAILER):<br />\nMotion Replay® is a 100% free and awesome feature of League of Maidens® allowing players to step onto the battlefield with a professional film camera. In fact it is the exact same tool that we used in-house to capture some of the beautifully cinematic moments of the game trailer. Choose a lens and aperture then Start/Stop/Pause or even slow down the speed to capture that perfect moment. Even change the angle of the sun, the density of the clouds or the intensity of the rain. With so many options to choose from the possibilities are endless.<br />\nFREQUENTLY ASKED QUESTIONS (F.A.Q):<br />\nHave questions about the game that have not yet been answered? Check out the frequently asked questions on our website for answers to most questions about League of Maidens or feel free to post on our official message board.</p>", "metacritic": null, "released": null, "tba": false, "updated": "2022-11-15T02:18:37", "background_image": "https://media.rawg.io/media/screenshots/38c/38c5d5ec397ccff93443728c156d2b72.jpg", "website": "http://www.maidengaming.net", "rating": 0.0, "rating_top": 1, "added_by_status": {"yet": 8, "owned": 242, "toplay": 2, "dropped": 3}, "playtime": 1, "achievements_count": 31, "ratings_count": 5, "suggestions_count": 578, "game_series_count": 0, "reviews_count": 5, "platforms": ["PC"], "developers": ["Maiden Gaming"], "genres": ["Action", "Strategy", "Casual", "Indie"], "publishers": ["Maiden Gaming"], "esrb_rating": "Everyone"}