{"id": 23479, "slug": "observer_", "name": "Observеr", "name_original": "Observеr", "description": "<p>What would you do if your fears were hacked? &gt;observer_ is a cyberpunk horror game from Bloober Team, the creators of Layers of Fear. Discover a dark cyberpunk world beset by plagues, war and squalor. Play as the new front line of neural police as you hack into the jagged minds of the insane.<br />\nFeatures:<br />\nObserve and Report - You are Dan Lazarski, an elite neural detective known as an Observer, and part of a corporate-funded police unit whose purpose is to hack and invade suspects’ minds. In this future, anything you think, feel, or remember can be used against you in a court of law.<br />\nA Dark Dystopia - The year is 2084. If you somehow survived the Nanophage, odds are you were killed in the War. Those who live have turned to drugs, VR, neural implants— anything to distract themselves from this new reality. But they can’t hide from you.<br />\nInteractive Insanity - As you hack into the unstable minds of criminals and victims to look for clues, you will relive their darkest fears, forcing you to question your own reality -- and your sanity.<br />\nA New Horror from the Creators of Layers of Fear - The largest and most frightening world yet from Bloober Team! Lose yourself -- and your sanity -- in the dark dystopia that is 2084. &gt;observer_ is a horror experience meant for mature audiences. What you see will disturb you.</p>", "metacritic": 77, "released": "2017-08-14", "tba": false, "updated": "2024-03-10T19:22:30", "background_image": "https://media.rawg.io/media/games/0f4/0f4f4764555736eebfeb01571e44e99e.jpg", "website": "http://observer-game.com/", "rating": 3.92, "rating_top": 4, "added_by_status": {"yet": 323, "owned": 1919, "beaten": 332, "toplay": 152, "dropped": 140, "playing": 22}, "playtime": 4, "achievements_count": 71, "ratings_count": 464, "suggestions_count": 511, "game_series_count": 0, "reviews_count": 471, "platforms": ["PC", "Nintendo Switch", "Linux", "macOS", "PlayStation 4", "Xbox One"], "developers": ["Bloober Team", "Observer Studio"], "genres": ["Adventure", "RPG", "Casual", "Indie"], "publishers": ["Aspyr", "Bloober Team", "Observer Studio"], "esrb_rating": "Mature"}