{"id": 234793, "slug": "azzl-saga-edition", "name": "AZZL Saga Edition", "name_original": "AZZL Saga Edition", "description": "*** App Store Best of 2015 ***<br/><br/>A game mixture crafted to extract the most Yays Per Minute.<br/>Our animation puzzles get so juicy that the virtuality will never be the same again.<br/>This is what will be at your fingertips and quickly work its way into your mind.<br/><br/>==========<br/><br/>\"AZZL is an innovative blend of puzzler and cartoon\" — Pocket Gamer<br/><br/>\"Quirky, bubbly, animated puzzler called AZZL\" — App Advice<br/><br/>\"beautiful artwork and animated visuals reminiscent of Disney films\" — 148 Apps<br/><br/>\"AZZL is a cartoon puzzler like you’ve never seen before\" — Gamezebo<br/><br/>\"Loads of secrets to unearth on the way\" — App Spy<br/><br/>\"AZZL manages to frustrate, entertain and delight all at the same time\" — PhoneDog<br/><br/>\"The developers at Jutiful, are back with another artsy game that’s looking really interesting\" — TouchArcade<br/><br/>\"Your New Colorful Friends\" — GameMob<br/><br/>\"The animations are entertaining and the characters are charming\" — Cult of Mac<br/><br/>”It’s a lot like playing an interactive cartoon” — Mac Life<br/><br/>==========<br/><br/>HOW TO AZZL<br/>MOVE: Simply pat the screen and begin.<br/>LOOK: Wherever is interesting.<br/>REMEMBER: The more you less, the wider the skinny.<br/><br/>FEATURES<br/>- Works with any finger<br/>- Automatic pretending<br/>- Hours of minutes<br/>- A new teehee every yesterday<br/>- Gluten free<br/><br/>Every event occurs as necessary, otherwise it didn’t.<br/><br/>*Based on real fantasies.<br/><br/>~ AZZL is optimized for iPhone 4s, iPad 2, iPod Touch 5 or later.<br/><br/>Attention! The puzzle set of game AZZL Saga Edition does not differ from our game AZZL, the only difference is in the logic of progress through the levels.<br/><br/>azzl.com", "metacritic": null, "released": "2016-10-31", "tba": false, "updated": "2019-10-22T14:19:20", "background_image": "https://media.rawg.io/media/screenshots/112/112d2c5dba9be6aa6be5338eb2405776.jpg", "website": "http://azzl.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 70, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Jutiful"], "genres": ["Adventure", "Puzzle"], "publishers": ["Jutiful"], "esrb_rating": null}