{"id": 234790, "slug": "pou-the-first-smash", "name": "POU: The First Smash", "name_original": "POU: The First Smash", "description": "SMASH your enemies!<br/>Use special SKILLS and SPELLS to clear all the regions from the monsters!<br/>SAVE the WORLD from the primeval revengers!<br/><br/>Enjoy the first smash game which was built with vivid 3D graphics, adventurous level designs, high-toned gameplay music and sounds, upgradable skill and spell system, superb boss level mechanics and a fascinating story!<br/><br/>Creasaur Entertainment Company proudly presents…<br/>Power of Universe: The First Smash<br/><br/>There was an ancient balance that kept the world safe. This balance, was built between the seven chakras on planet earth. The magical bond between the seven chakras has now been broken. Now, the world is under attack by monsters from the dark ages. And the only hero that can save it is you! Use your finger to tap on the screen and wipe out evil lost souls, primeval hunters and ruthless demons. Save the people of planet earth and get ready for your next adventure!<br/><br/>Remember; you are the only saviour now!<br/><br/>FEATURES<br/><br/>• First of its kind game design that based on smash mechanics.<br/>• All regions representing the real culture of real countries.<br/>• All enemies are different reproductions of several legends that were filtered by different cultures around the world.<br/>• Numerous challenging achievements which earn fantastic awards.<br/>• Upgradable skills and spells like Booming Breeze, Colossal Cluster, Bloody Blizzard, Boom-a-Doom and Terra Strike that makes you more powerful against your enemies.<br/>• You can buy some shields with your CHI Energy Points which are protecting your aura from enemy attacks while you are fighting<br/>• Many different regions with different enemies and bosses.<br/>• Special Survival Mode option with which you can destroy monsters to attain 1st place on the leaderboard!<br/>• CHI Energy Points that you can collect from monsters to purchase and upgrade skills and spells.... and attain a shield also!<br/><br/>HOW TO PLAY?<br/><br/>• All chakras include 40 levels.<br/>• In every level you will clash with a great numbers of enemies.<br/>• These enemies will be coming from all around the universe to conquer planet earth by killing everyone on it.<br/>• You are the only hero in this great war who can truly defend the people and save this planet. BOOM! Great news right?<br/>• You can tap on the creatures during clashes to crush and destroy them or you can use your super hero skills to crush them.<br/>• When there is too much trouble in the war, you can always deploy some shields by using your CHI Energy Points to set your defence power against those brutal beasts.<br/>• Also, there will be some bosses as well that you must defeat during the war. You need to tap them before they perform their attacks to damage your aura.<br/>• Speaking of your aura, you can upgrade it with your CHI Energy Points to set your defence power on a higher level.<br/><br/>Privacy Policy: <br/>http://creasaur.net/privacy-policy<br/><br/>Terms of Service:<br/>http://creasaur.net/user-agreement", "metacritic": null, "released": "2018-08-13", "tba": false, "updated": "2019-10-22T14:19:20", "background_image": "https://media.rawg.io/media/screenshots/cec/cecaa86aa0d22489a0d655ebce3f473a.jpg", "website": "http://www.powerofuniverse.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 376, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Creasaur"], "genres": ["Action", "Arcade"], "publishers": ["CREASAUR TEKNOLOJI TICARET ANONIM SIRKETI"], "esrb_rating": "Everyone 10+"}