{"id": 234802, "slug": "forgotten-books-the-enchanted-crown-hd-a-hidden-ob", "name": "Forgotten Books: The Enchanted Crown HD - A Hidden Object Story Adventure", "name_original": "Forgotten Books: The Enchanted Crown HD - A Hidden Object Story Adventure", "description": "Play the trial for FREE!  Pay once &amp; complete the adventure!<br/><br/>Your librarian friend wants your help as a journalist – he’s found an ancient book that is still unfinished. Can you save the world in the book before their story ends?<br/><br/>• SAVE A MAGICAL WORLD FROM THE TERRORS OF ELDOR<br/>As you turn the pages of the ancient book, you are pulled into the world of Torelion. The dark mage Eldor has captured the king and threatens to take over the kingdom.<br/><br/>• EXPLORE FOUR NEW STORY WORLDS <br/>Follow the white rabbit as you travel through 13 different locations to solve challenging puzzles and hidden object scenes. But stay on your toes, because the story rewrites itself as you go along!<br/><br/>• REWRITE THE ENDING AND SAVE THE KING!<br/>Free the king from his chains and ensure a happy ending for the kingdom under siege!<br/><br/>• JUMP INTO THE ADVENTURE AND UNLOCK THIS COLLECTOR’S EDITION!<br/>Complete your set of collectibles and earn achievements along your journey. Plus, enjoy even more puzzles and mini-games as well as wallpapers and concept art!<br/><br/>*** Discover more from Big Fish! ***<br/><br/>Check out our entire game library with our Big Fish Games app absolutely FREE here: http://bigfi.sh/BigFishGamesApp<br/><br/>Sign up for our newsletter and never miss a new release or promotion again: http://bigfi.sh/iSplashNewsletter<br/><br/>Big Fish is the leading global marketplace to discover and enjoy casual games. You can enjoy our virtually endless selection of games anytime, anywhere — on your PC, Mac, mobile phone, or tablet. Learn more at bigfishgames.com! <br/><br/>Become a fan on Facebook: http://www.facebook.com/BigFishGames<br/><br/>Follow us on Twitter: http://bigfi.sh/BigFishTwitter", "metacritic": null, "released": "2015-03-30", "tba": false, "updated": "2019-10-22T14:19:21", "background_image": "https://media.rawg.io/media/screenshots/a6c/a6c2669d1c621b3abb3f2485b7f37ab2.jpg", "website": "http://www.bigfishgames.com/mobile-games/ios-games/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 256, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Big Fish Games"], "genres": ["Adventure", "Puzzle"], "publishers": ["Big Fish Games"], "esrb_rating": "Everyone 10+"}