{"id": 234857, "slug": "farm-frenzy-origins", "name": "Farm Frenzy: Origins", "name_original": "Farm Frenzy: Origins", "description": "IMPORTANT: <br/>This application doesn't support iOS 8.0 !<br/>Attention! This version may not be compatible with iPhone 7!<br/>-----------------------------------------<br/><br/>Show Old MacDonald how it's done in this super fun arcade farming sim!  From tending the fields where your cows graze to gathering eggs for sale at the town market, Farm Frenzy is as invigorating as the real thing!<br/><br/>WHAT THE MEDIA IS SAYING:<br/>- The iPhone Games Network (Editor's Choice Award):  \"Farm Frenzy is a gem in the growing mountain of time management games. It offers fresh gameplay, long game life and a distinct graphical style.\"<br/>- Slide to Play: \"It's kid friendly!\"<br/>- News Shopper (scored 8 out of 10): \"Harvests all of the raw materials of the time management format and turns them into a cute, fast-paced and fun game.\"<br/><br/>Become one with the soil as you cultivate your fields, feed your animals and gather the items they produce.  You'll have to keep the bears away from your ducks, though, or you won't have any eggs to sell!  You can spend the money you earn on upgrading your farm to churn out more products faster than before.  Offering hours of point-and-click action, just enough strategy to keep things interesting and an amusing cast of characters, Farm Frenzy is a game the whole family can enjoy!<br/><br/>GAME FEATURES:<br/>◇ 45 levels to beat<br/>◇ Five animals to care for<br/>◇ Nine farm products to sell<br/>◇ Six buildings to purchase<br/>◇ Game Center support!<br/>◇ OpenFeint support!<br/>-----------------------------------------<br/>More fun games from Alawar:<br/>- FARM FRENZY 2 – Enjoy a bumper crop of fun as you manage a wild and wacky farm!<br/>- HOTEL MOGUL – Point-and-click fun that will have you laughing all the way to the bank!<br/>- DANCING CRAZE – A time management game with a twist!<br/>- THE TREASURES OF MONTEZUMA HD – Trigger Power Totems in this dazzling match-three adventure!<br/><br/>For more games, visit us at iphone.alawar.com!<br/>-----------------------------------------<br/>FIND US in FACEBOOK: AlawarEntertainment<br/>FOLLOW US in TWITTER: @AlawarMobile<br/>Be the first to hear about our new games and awesome contests!", "metacritic": null, "released": "2011-06-10", "tba": false, "updated": "2019-07-30T01:25:01", "background_image": "https://media.rawg.io/media/screenshots/a2a/a2a21d1f15ceba30d662d008b83f2caa.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 129, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Alawar Entertainment"], "genres": ["Simulation", "Arcade", "Casual"], "publishers": ["Alawar Entertainment"], "esrb_rating": null}