{"id": 234870, "slug": "gourmania", "name": "Gourmania", "name_original": "Gourmania", "description": "IMPORTANT: <br/>This application doesn't support iOS 7.0 or later!<br/><br/>Time-management plus hidden object - become the world's top chef in this addictive smash hit! <br/><br/>WHAT THE MEDIA IS SAYING:<br/>- AppleTell.com: \"Gourmania is a great game that’s underpriced, and is something that should be tried by all casual iPhone/iPod touch gamers.\"<br/>- TouchArcade.com: \"Alawar's Gourmania bridges both the time management and hidden object genres with a culinary themed Frankenstein monster scientifically engineered to be the ideal casual game!\"<br/><br/>Do you have the skills to win a cook off among the top chefs at a glamorous resort? Begin your journey at a fast food joint, finding the ingredients for the sandwiches your customers want and the processing their orders before time runs out. Before the big showdown, you’ll save a Sushi Bar, a Pizza Parlor and more from shutting down, making you the most sought after chef in town! Full of seek-and-find and slice-and-dice fun, Gourmania is your ticket to the big leagues! <br/><br/>Also available for iPad! Check for Gourmania HD in App Store.<br/><br/>GAME FEATURES:<br/>◇ 60 levels<br/>◇ Eight locations (cafe, sushi, restaurant and more!)<br/>◇ Two bonus levels for each location<br/>◇ Unlimited game time!<br/>-----------------------------------------<br/>STILL NOT CONVINCED?  Try the lite version for free by searching for \"Gourmania Lite\" in the App Store.", "metacritic": null, "released": "2009-09-23", "tba": false, "updated": "2019-10-22T14:09:11", "background_image": "https://media.rawg.io/media/screenshots/adf/adf1a81ad5b0a6cf3f0e99498609843c.jpg", "website": "http://iphone.alawar.com/?p=79", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 163, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Alawar Entertainment"], "genres": ["Family", "Puzzle"], "publishers": ["Alawar Entertainment"], "esrb_rating": null}