{"id": 23483, "slug": "fear-effect-sedna-demo", "name": "Fear Effect Sedna Demo", "name_original": "Fear Effect Sedna Demo", "description": "Be part of a new Fear Effect adventure with Fear Effect Sedna, a new game in the classic series made popular on the original PlayStation console. With a whole new story, and shifting to a pausable real-time tactical action style, players will be able to control the team strategically and tackle enemies and puzzles alike.<br/>\n<br/>\r\nFear Effect Sedna is set four years after the events of the original Fear Effect game, and things have changed for the team. Hana, freed from the Triad, lives with Rain in Hong Kong and works as an occasional mercenary, while Deke has grown apart from them since Glas returned to the US.<br/>\n<br/>\r\nHana accepts a small mission for a shadowy organization asking for her services. Her target: a mysterious ancient statuette held by the Chinese ambassador in France. She sees it as a good opportunity to visit her birthplace... But this 'easy' mission is about to lead Hana to something way bigger than she expected.<br/>\n<br/>\r\nMeanwhile Glas is approached by a client who catches his attention enough that he soon sets out for Greenland.<br/>\n<br/>\r\nHow will these events bring the old team back together?<br/>\n<br/>\r\nFear Effect Sedna is dedicated to recreating the atmosphere and characters from the original Fear Effect. However, while there are familiar aspects of the game to previous incarnations of the franchise, you'll find yourself immersed in a completely unique and new world with Fear Effect Sedna - one that will appeal to fans both old and new.", "metacritic": null, "released": "2017-05-22", "tba": false, "updated": "2019-08-28T22:07:02", "background_image": "https://media.rawg.io/media/screenshots/93f/93f1b07a6f26754117e0e28bded2df28.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 118, "toplay": 1, "dropped": 3}, "playtime": 1, "achievements_count": 0, "ratings_count": 4, "suggestions_count": 225, "game_series_count": 0, "reviews_count": 4, "platforms": ["PC"], "developers": ["Sushee"], "genres": ["Action", "Strategy"], "publishers": ["Square Enix", "Forever Entertainment"], "esrb_rating": "Everyone"}