{"id": 234878, "slug": "farm-frenzy-3-farming-game", "name": "Farm Frenzy 3. Farming game", "name_original": "Farm Frenzy 3. Farming game", "description": "The popular game about a farm, an incredible collaboration of genres \"Farming game\" and \"Time management\", is waiting for most ambition farmers of the world!<br/>So you think you've mastered farming sims? Try running five farms in one game! Farm Frenzy 3 challenges you to overhaul struggling farms around the world. Conquer Farm Frenzy 3, and you might find yourself president of the Farmer's Union!<br/><br/>GAME FEATURES:<br/><br/>◇ 95 levels in five countries around the world!<br/>◇ 30 adorable animals, including five enemies<br/>◇ 33 products to make a huge farmer profit!<br/>◇ 17 beautiful buildings and vehicles<br/>◇ 16 amazing trophies<br/>◇ New, more efficient buildings with numerous upgrades!<br/>◇ Various transport vehicles and trucks<br/>◇ A lot of quirky lovely animals makes things more fun! Funny animals to care for!<br/>◇ Plant fresh crops, earn money and grow up your business<br/>◇ Help you to improve your concentration, perception, and focus, enhance your cognitive capacities and train your reaction<br/>◇ Nice graphics and sound!<br/>◇ No Wi-Fi or internet connection required - download and play where and when you want!<br/>◇ Supported languages: English, Italian, Russian, German, French, Chinese, Korean, Dutch, Portuguese, Japanese, Spanish<br/><br/>The Frenzy goes global as you tackle 95 fast-paced levels in Africa, Russia, the Wild West, an untamed jungle and more! Feed over 30 exotic animals such as walruses, penguins, and llamas while protecting your farm from dangerous jaguars, lions, and bears!<br/><br/>When you catch a predator, dress it in a silly outfit and sell it for profit! Then return to the business of growing crops, collecting goods and trade goods, purchasing factories and upgrading buildings, upgrading your warehouse and transportation, buying and selling supplies - makes things more fun!. <br/>Grow crops, trade fresh exotic goods, upgrade trucks, build and upgrade various facilities, explore numerous levels, manage your business in real time and build the Best. Farm. Ever and make yourself a most famous farmer around the world! Make your orders, complete funny tasks, reach various level goals, create unique products and conquer the market, compete for the highest score and discover new farming horizons. Take a new experience of the best farm business simulation! Produce cakes, butter, wool, sheeps, cows, chickens and other cute animals and take a good profit! Upgrade transport vehicles and you're can earn money much faster in this perfect growing game! Hire smart cats and brave dogs to help you in this farmers paradise!<br/><br/>Can you beat the highest score and prove everyone that you're the best virtual farmer in the whole world?<br/><br/>Play the best games from \"Alawar\", the makers of such games as Beholder, Farm Frenzy, The Treasures Of Montezuma, House of 1000 doors, on App Store!<br/><br/>FIND US on FACEBOOK: AlawarEntertainment<br/>FOLLOW US on TWITTER: @AlawarMobile<br/>Be the first to hear about our new games and awesome contests!", "metacritic": null, "released": "2011-09-15", "tba": false, "updated": "2019-07-30T01:20:11", "background_image": "https://media.rawg.io/media/screenshots/dee/dee12e42f90906c46db73d4e5c8c0f6c.jpg", "website": "https://www.alawar.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 215, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["Alawar Entertainment"], "genres": ["Simulation", "Arcade", "Casual"], "publishers": ["Alawar Entertainment"], "esrb_rating": null}