{"id": 234991, "slug": "monstercrafter-pro", "name": "MonsterCrafter Pro", "name_original": "MonsterCrafter Pro", "description": "• DREAM IT. BUILD IT. TRAIN IT. BATTLE IT • <br/>The sequel to Guncrafter has arrived! Craft your own pet monster. Train and care for it. Adventure through harrowing, boss-filled dungeons. Battle online against your friends, your enemies, or anyone in the world. MonsterCrafter is crafting + digital pets + monster battling…and there has never been anything like it.<br/><br/>• PLAY YOUR WAY •<br/>If you can dream it, you can build it. Create your monster any way you like. The way you craft it, the way you train and care for it…EVERYTHING affects your monster's personality, companionship, and performance in battle!<br/><br/>• ENDLESS CONTENT •<br/>The entire MonsterCrafter world is populated by player-created monsters! Every monster you see and battle has been crafted by someone. Show them who's boss!<br/><br/>• INSTANT MULTIPLAYER • <br/>Enter the multiplayer arena and get placed in a lag-free multiplayer match in 5 SECONDS. With Naquatic's exclusive Quick Match system, you never have to stop playing. No waiting. No lag.<br/><br/>• Clan Dungeons •<br/>Start a clan with up to 10 friends and play through unique co-op challenges!<br/><br/>• PRO FEATURES • <br/>- Extra Gold - Earn more gold to create and train more powerful monsters!<br/>- No Ads - Enjoy MonsterCrafter without disturbance!<br/><br/>• JOIN OVER 100 MILLION GAMERS WORLDWIDE •<br/>Follow @Naquatic on Facebook and Twitter to find out why our apps like MonsterCrafter and Shooting Showdown have been featured by everyone from Apple to IGN, AppAdvice, and TouchArcade.", "metacritic": null, "released": "2014-04-03", "tba": false, "updated": "2019-07-29T22:15:57", "background_image": "https://media.rawg.io/media/screenshots/4ff/4ff5de8db66bb67f036a36be7662ac75_rzFoBLL.jpg", "website": "http://naquatic.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 195, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Naquatic"], "genres": ["Action", "Arcade", "Casual"], "publishers": ["Naquatic"], "esrb_rating": null}