{"id": 235030, "slug": "four-in-one-halloween-activity-games-for-kids", "name": "Four in One Halloween Activity games for Kids", "name_original": "Four in One Halloween Activity games for Kids", "description": "Enjoy the Festive Holiday with 4 in 1 Halloween Activity games. It has spooky themed coloring pages, Memory games, Jigsaw Puzzle and Connect the dots.<br/><br/>A guaranteed fun of long hours for children.<br/><br/>Halloween Bundle for Kids is a Universal Game (works perfectly on all Apple devices). <br/><br/>Halloween Bundle comes with 4 different fun games to play with : <br/><br/>- SPOOKY THEMED COLORING PAGES <br/>Kids can save their lovely creations by the saving the images to Artwork Gallery which can be accessed later on for further coloring. <br/><br/>- CONNECT THE DOTS, REVEAL THE PICTURE<br/>Explore the kids learning by joining the dots of various illustrations and color them after for best creative output. <br/>Kids can save their lovely creations by the saving the images to Artwork Gallery which can be accessed later on for further coloring. <br/><br/>- MEMORY GAME<br/>Match the pairs of things related to Halloween with professional voice over and sounds which will not only improve the visual memory but also helps in understanding the pair shapes with their particular sounds. Every level comes with different set of pairs and scoring for star rating achivement. You need to match all pairs correctly to move on to next level. <br/><br/>- KIDS FAVORITE JIGSAW PUZZLES<br/>Join the Halloween Puzzle pieces which is totally fun and comes with 4, 6 and 9 pieces. Master them all. <br/><br/>Privacy disclosure: \u2028\u2028 <br/><br/>-- We do not collect or share any location and/or personal data of User. <br/>-- Our apps/games do not contain ads. <br/>-- Our Free version apps/games includes In-App purchases with Parental Gates. <br/>-- Our apps/games do not contain integration with social networks. <br/>-- Our Pro version apps/games includes “more apps” external links to additional Quackart studios apps/games and or rate the app on a separate page secured with a parents feature restricting.", "metacritic": null, "released": "2014-11-11", "tba": false, "updated": "2019-10-22T14:17:31", "background_image": "https://media.rawg.io/media/screenshots/15a/15a36047b7e7e02c6d0406b7d2828dbe.jpg", "website": "http://www.quackart-studios.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 112, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Sachin Sachdeva"], "genres": ["Board Games", "Family"], "publishers": ["Sachin Sachdeva"], "esrb_rating": "Everyone 10+"}