{"id": 235073, "slug": "solitaire-3d", "name": "Solitaire 3D.", "name_original": "Solitaire 3D.", "description": "\"Great app. So many different games in the full version that I never get bored. No ads, just good clean fun.\"<br/><br/>\"I love this best app ever!\"<br/><br/>\"Of all the apps I have downloaded in the past year, this one gets played the most.\"<br/><br/>\"This is a really terrific app, with a great variety of games. I love being able to compare scores to other players, and also to see which device they played on. Yes, it can be addictive, but it is a great way to kill time when you are waiting for someone or something.\"<br/><br/>\"This is a great game, albeit a little addictive. I love this app, no matter how many others I download I end up playing this version of solitaire.\"<br/><br/><br/>The highly popular and multi-award winning desktop computer game, Solitaire 3D, is now available for the iPhone and iPod touch.<br/><br/>Enjoy 70 different solitaire games, multiple card decks (including the unique 4 color card deck), a wide range of backgrounds, high scores, statistics, sound effects, 3D animation effects, and much more.<br/><br/>Solitaire 3D also comes with an in-built multi-user system, so that more than one person can customize, play and resume games without affecting other players.<br/><br/>Also included is the ability to optionally hide the menu and/or status bar, allowing for full use of the complete screen area.<br/><br/>With emphasis on ease-of-play and smooth beautiful graphics, Solitaire 3D is the perfect solitaire partner for all.", "metacritic": null, "released": "2009-06-10", "tba": false, "updated": "2019-07-30T06:21:45", "background_image": "https://media.rawg.io/media/screenshots/aac/aac1f99e6b35e985022f7c95027cd3c3.jpg", "website": "http://www.grassgames.com/solitaire/mobile/index.html", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 145, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["GrassGames"], "genres": ["Card", "Puzzle"], "publishers": ["Aidan McKenna"], "esrb_rating": null}