{"id": 235037, "slug": "sliding-sleighs", "name": "Sliding Sleighs", "name_original": "Sliding Sleighs", "description": "Sliding Sleigh's is your dream of sliding with Santa.<br/><br/>Do you dream that Santa will take you for a ride? Of course it's not a ride, it’s a slide and your dream came true with Sliding Sleighs...<br/><br/>Great graphics, cute characters, cool theme and the smiling Santa will make a more fun and cheerful Christmas!<br/><br/>A Christmas themed game containing bags of fun and enjoyment, which will keep you playing for long hours. <br/><br/>Reach Santa's House as fast as you can.<br/><br/>A completely fun and entertaining game.<br/><br/>Game features:<br/><br/>- 25 Challenging levels<br/>- Race against time<br/>- 5 Air Tricks for additional points<br/>- Gather as many Snowflakes for additional points<br/>- Choose from 10 different Christmas themed characters (Gingerbread, Mrs. Claus, Elf, Reindeer,Snowman, Polar bear, Christmas Tree, Babies and Stockings)<br/>- Power boosts to help you get through that challenging level<br/>- Level Skips - When you just can't get past that one level<br/>- Amazing Background music and sound effects when you climb high.<br/><br/><br/>To pick up speed, simply press and hold your finger on the screen when going downhill and release when going uphill. Sounds easy, but there is definitely a strategy required in order to make it down in the allotted time.", "metacritic": null, "released": "2012-12-15", "tba": false, "updated": "2019-10-22T14:17:31", "background_image": "https://media.rawg.io/media/screenshots/b20/b20379445ece74b813111f2bed634a76.jpg", "website": "http://www.quackart-studios.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 131, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Sachin Sachdeva"], "genres": ["Racing"], "publishers": ["Sachin Sachdeva"], "esrb_rating": "Everyone 10+"}