{"id": 235126, "slug": "euchre-hd", "name": "Euchre HD", "name_original": "Euchre HD", "description": "Euchre HD is a great partnership Euchre card game for up to four players. Play alone against the computer or with up to three friends using Apple Game Center.  If you don't know how to play Euchre, be sure to check out our website.  <br/><br/>If you have recommendations or feedback, we really appreciate hearing from you.  Also, please feel free to send as an e-mail via the support link.<br/><br/>It can be a little tricky to setup GameCenter multi-player.  Be sure to checkout our troubleshooting guide, available on our website, if you are having problems playing with friends.  <br/><br/>Features<br/> <br/>● Numerous achievements - Can you get them all?<br/>● Computer players for those times when you can't drum up enough friends to fill a table.<br/>● Multiple player and match making support through Apple Game Center<br/>● Play against the computer while waiting for a multi-player game to form.<br/>● Fast now on by default for new players  Look for Euchre HD in the \"Settings\" application to change back to \"normal\" speed.<br/>● Integrated with Heyzap allowing you to check-in, share tips, and more. <br/><br/>Euchre HD is a great way to learn to play Euchre or to perfect your game. A college favorite in a convenient, portable package. Don't be left out of the next Euchre get-together, try Euchre HD today.  Beer and pretzels sold separately.<br/><br/>Euchre HD allows you to invite your friends to play using Game Center.   We have an Invite a Friend Guide on our website to show you how to add your friends to your Game Center account.<br/><br/>It can still be challenging to find matches with 4 random player, so we recommend playing with friends.", "metacritic": null, "released": "2011-02-10", "tba": false, "updated": "2019-07-30T06:28:27", "background_image": "https://media.rawg.io/media/screenshots/f9a/f9acb49bc4c8bcda1007a4b49a12fc7b.jpg", "website": "http://www.fivelakesstudio.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 76, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Five Lakes Studio"], "genres": ["Strategy", "Card"], "publishers": ["Five Lakes Studio"], "esrb_rating": null}