{"id": 235155, "slug": "one-handed-solitaire", "name": "One Handed Solitaire", "name_original": "One Handed Solitaire", "description": "Follow us on Twitter @1HandSolitaire &amp; @RDApps <br/><br/>One Handed Solitaire is a card game played with a traditional 52 card deck, minus the jokers. It can be played in one hand and does not require a flat surface to arrange the cards. After shuffling the playing cards, hold the deck face down in your hand. Draw four cards from the deck and place them on top of the face down deck of cards. You will fan out the cards so that the suit and face value can be seen at all times for the last 4 cards. <br/><br/>The object of the game is to discard as many cards as you can, in the least amount of shuffles of the deck. To start discarding you must have at least four cards drawn from the deck and face-up in your hand. To discard cards, you need to match either the suit or face value of the cards in the first and fourth position (from the most recently drawn cards in your hand). If you match the suit, for example both are Hearts or Diamonds, you discard the middle two cards. If you match the face value, for example both are Aces or 9s, you discard all four cards. After you discard, if you still have at least four cards face up in your hand, look for another match before drawing one card. Repeat these steps until you draw all the cards or discard all of them. If you run out of cards to draw, you may keep playing and reshuffle your remaining cards and continue to discard when you find matches. <br/><br/>Along the way you’ll earn points and achievements for discarding in Apple’s Game Center, so make sure to log in or create your free account. <br/><br/>One Handed Solitaire is a fun way to pass the time and compete with friends for the best score! If you enjoy the game please leave a star rating and review. If you’re having problems with the game please email support or tweet us first before leaving an App Store rating and review.", "metacritic": null, "released": "2012-02-17", "tba": false, "updated": "2019-10-22T14:17:32", "background_image": "https://media.rawg.io/media/screenshots/17c/17cd6d7eba76ab3f6780c24c44a99d01_VuLdEZS.jpg", "website": "http://www.RDApps.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 33, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["RANEYDOMAIN"], "genres": ["Card"], "publishers": ["RANEYDOMAIN"], "esrb_rating": null}