{"id": 235210, "slug": "fun-bridge", "name": "Fun Bridge", "name_original": "Fun Bridge", "description": "Funbridge is an online bridge game allowing you to learn and play duplicate bridge wherever and whenever you like.<br/> <br/>Bridge is a card game played with four people who play as two competing teams of two players called \"pairs\" (North-South and East-West). The players of the same team sit across from each other at a card table. Bridge consists of two parts: the auction, which determines the contract to fulfil, and the play, where the side that wins the bidding tries to take the tricks necessary to make their contract.<br/> <br/>On Funbridge, you play South while North, East and West are played by the same artificial intelligence (AI) at all tables. So no need to wait until other players are available to play. The AI is available 24/7!<br/><br/>Other players play the same deals as you. The aim is to achieve the best result. You enter rankings allowing you to compare your play to other players.<br/><br/>Funbridge is designed for any type of players: from beginners (introductory module, lessons, exercises) to experts (tournaments). It also suits any player who wants to start playing bridge again (practice, challenges against friends).<br/><br/>Game modes:<br/>- Get started with bridge: (re)discover the basics of bridge.<br/>- Series tournaments: perfect to see how you compare with players of your level.<br/>- Tournaments of the day: compare yourself to players from all around the world.<br/>- Practice deals: play deals at your own pace without stress.<br/>- Face the elites: pit yourself against top players from the Elite series.<br/>- Challenges: challenge any player in head-to-head tournaments.<br/>- Two-player game: practise with your favourite partner.<br/>- Team Championship: create your team and compete against teams from all over the world.<br/>- Federation tournaments: improve your federation ranking thanks to official tournaments held conjointly with bridge federations.<br/>- Funbridge Points tournaments: play these tournaments to enter the Funbridge Points rankings and compare yourself to all players.<br/>- Exclusive tournaments: create your own tournaments and discuss the deals you play.<br/>- Commented tournaments: get valuable advice from a bridge champion.<br/><br/>You can also:<br/>- Pause your deal or tournament<br/>- Watch a replay of other players' moves<br/>- Replay deals that you have already played<br/>- Get the meaning of the bids made at the table<br/>- Seek advice from the AI in case of doubt<br/>- Set your bidding and card play conventions<br/>- Access an analysis of your play once the deal is over<br/>- Meet your friends and chat with them<br/><br/>Internet connection required: the AI is not in the app, which is therefore much more efficient and we can continuously improve it without you having to update it.<br/><br/>GENERAL TERMS OF USE, PRIVACY POLICY, SUBSCRIPTION, PRICES:<br/>The Funbridge app offers a monthly subscription (1 month) and a yearly subscription (1 year).<br/>If you subscribe in another currency, the price may vary slightly if your bank charges you a conversion fee.<br/>Payment for your subscription will be debited from your account after your purchase is confirmed.<br/>The subscription is automatically renewed at the end of the subscription period. The bank account associated with your payment card will be debited via your iTunes account.<br/>You can stop the renewal of your subscription at any time from your iTunes account. Please do so at least 24 hours before your subscription expires to avoid unwanted renewal. No unused subscription period will be refunded.<br/>Find out more about our general terms of use at https://www.funbridge.com/terms_of_use.<br/>Find out more about our privacy policy at https://www.funbridge.com/privacy.", "metacritic": null, "released": "2010-12-22", "tba": false, "updated": "2019-10-22T14:17:35", "background_image": "https://media.rawg.io/media/screenshots/073/0739392f79f13acda7292c95e4a89cea.jpg", "website": "http://funbridge.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 150, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "macOS"], "developers": ["GOTO Games"], "genres": ["Strategy", "Card"], "publishers": ["GOTO GAMES"], "esrb_rating": "Everyone 10+"}