{"id": 235241, "slug": "beach-volleyball-2016", "name": "Beach Volleyball 2016", "name_original": "Beach Volleyball 2016", "description": "We love listening to your feedback so please keep it coming! We just added 3 new features from your feedback suggestions.<br/><br/>New user input options . Original or Side (thumb) Button control layouts.<br/><br/>Side Button layout setting features single touch attack (easier spiking).<br/><br/>New scaled control timing for game speed settings allow easier control in higher speed games<br/><br/>Character Customization's!<br/><br/>Change facial expressions and features, hair styles and hair color. There are a bunch of new customization's available for you to choose from! The choice is yours!<br/><br/>Are you ready to experience Beach Volleyball like never before? Well pack your bags because you're headed to some of the world's finest Beach Volleyball courts.  <br/><br/>From the team that brought you, “The Best Beach Volley on iPad” game, Beach Volley Motion Sensing, comes the all-new Beach Volleyball 2016.<br/><br/>Choose to play for your favorite team and hear the crowd cheer you on as you outplay your friends in head-to-head online matches. Pass, assist, attack, block and dig your way to the championships and bring home the trophy for your country.<br/><br/>- Choose from 16 International Male or Female teams.<br/>- Play on 5 different exotic courts around the world.<br/>- Singleplayer, Multiplayer and Tournament Modes.<br/>- Fully Immersive 3D Graphics and Animations.<br/>- Compatible with iOS version 6.0 or higher.<br/><br/>Beach Volleyball 2016, \"You're in the Game\"", "metacritic": null, "released": "2016-09-02", "tba": false, "updated": "2019-07-30T12:52:41", "background_image": "https://media.rawg.io/media/screenshots/4ba/4ba37b05bf8ef2633f8d6ca056f2ac62_J4pwiTr.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 107, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Vtree"], "genres": ["Simulation", "Sports"], "publishers": ["VTree"], "esrb_rating": null}