{"id": 235233, "slug": "pyramid-solitaire-now", "name": "Pyramid Solitaire Now", "name_original": "Pyramid Solitaire Now", "description": "Welcome to the amazing world of solitaire! Pyramid is one of the most played patience games in the world. Now you can enjoy it anytime, and anywhere, on your mobile phone or tablet. Share your Pyramid Solitaire scores with your friends on Facebook and Twitter.<br/><br/>From Odesys, the makers of the best solitaire games for mobile.<br/><br/>The goal of Pyramid Solitaire is to discard the entire deck by finding pairs of cards that add up to 13, regardless of suit. Kings count as 13 and are discarded singly, Queens as 12, Jacks as 11, etc. The board consists of a Stock, a Pyramid and a Discard Pile. The cards in the Stock can be cycled three times, one at a time. Only cards that are completely uncovered are available for play. Giza and Seven are variations of Pyramid with slightly different board layouts.<br/><br/>Odesys Pyramid Features:<br/>• Bonus games - Giza and Seven<br/>• Unlimited Undo and Redo<br/>• Adjustable cards size (pinch-to-resize)<br/>• Hints<br/>• Sound<br/>• Animations<br/>• Auto save on exit<br/><br/>Follow us on Twitter: @OdesysSolitaire<br/><br/>Look for other great patience games by Odesys. If you like the classics, you would love Klondike Solitaire, FreeCell Solitaire, Spider Solitaire, or its lesser known variations, Black Widow Solitaire and Tarantula Solitaire. You might also like to try Pyramid Solitaire, or its somewhat easier variation, Seven Solitaire, or the completely open Giza Solitaire. No solitaire collection would be complete without the unique Golf Solitaire, the addictive Yukon Solitaire, or its almost impossible to solve cousin, Russian Solitaire.", "metacritic": null, "released": "2014-09-16", "tba": false, "updated": "2019-10-22T14:17:36", "background_image": "https://media.rawg.io/media/screenshots/3bb/3bbf0d4fef12f77972e4cbba887923cc.jpg", "website": "http://www.odesys.com/games/pyramid/ios.htm", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 52, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Odesys"], "genres": ["Card", "Puzzle"], "publishers": ["Odesys"], "esrb_rating": null}