{"id": 235211, "slug": "funbridge", "name": "Funbridge", "name_original": "Funbridge", "description": "Funbridge, your new bridge club to play wherever and whenever you like!<br/>Already over 400,000 players and more than 1,000,000 deals played every day.<br/> <br/>Funbridge enables you to play bridge games (\"deals\") and rank yourself against hundreds of other players (as well as your friends).<br/>With Funbridge, no need to wait for other players to start playing a deal. Your game partner and opponents are robots (or \"game engines\") and are the same at all tables. Therefore you play whenever you want!<br/>Since everybody plays the same deals (luck doesn't play a part here), you can easily compare your bidding, card play and results with other players. What makes the difference is that you can watch a replay of any other player's moves, making Funbridge the ideal tool to progress.<br/> <br/>Funbridge offers a multitude of game modes:<br/><br/>- Series tournaments<br/>Start in the New series and enter one of the series available, from Series 11 (i.e. the lowest one) to the Elite series (i.e. the highest one). This is a good way to compare yourself to players of your level.<br/><br/>- Tournaments of the day<br/>Every day take part in a 20 deals tournament lasting 24 hours and gathering thousands of players of all levels.<br/><br/>- Unlimited deals<br/>The ideal mode to progress by playing deals one after the other at your own pace without the stress of a bridge event.<br/><br/>- Face the elites<br/>Pit yourself and be judged fairly against the players from the Elite series, the best Funbridge players, and analyse their play. <br/><br/>- Challenges<br/>Challenge your friends or any other player on 5 deals. May the best player win!<br/><br/>- Two-player game<br/>Practise with your favourite partner on unlimited deals. Set the parameters of the deals yourself for a more targeted practice.<br/><br/>Other features of Funbridge:<br/>- You can pause and resume a tournament later<br/>- Help window with bidding tips at the game table<br/>- Set your bidding and card play conventions<br/>- IMP and MP scoring systems<br/>- The tournaments you have played can be found in the archives<br/>- Take a look at other players' visiting cards and edit yours<br/>- Filters available in rankings allowing to display only your friends e.g.<br/>- Chat to interact with players and your friends<br/><br/>Please note that Funbridge requires an Internet connection to play. Why? Simply because the game engine (the artificial intelligence playing bridge with you) is not present in the application. It allows us to provide you with a game engine which is much more powerful and to continuously improve it without you having to update your application.<br/><br/>GENERAL CONDITIONS OF USE, RESPECT OF YOUR PRIVACY, SUBSCRIPTION :<br/> <br/>• Funbridge offers in the app a monthly subscription (1 month) and a yearly subscription (1 year)<br/>• If you subscribe in another currency, this price may vary if your bank applies conversion charges.<br/>• The payment for your subsription will be debited from your account after your purchase is confirmed.<br/>• The susbcription is automatically renewed at the end of your subscribed time, the bank account associated with your  Itunes account will be debited via your Itunes account.<br/>• You can stop the renewal of your subscription at any moment from your Itunes account. • To avoid any unwanted subscription, do it at last 24 hours before the renewal of your subscription. We will not refund any unused subscription.<br/>• To learn more about our general condittions of use : https://www.funbridge.com/en/terms_of_use<br/>You can find here our comitment on the respect of your privacy : https://www.funbridge.com/en/privacy", "metacritic": null, "released": "2012-01-20", "tba": false, "updated": "2019-10-22T14:17:35", "background_image": "https://media.rawg.io/media/screenshots/104/1048fd4d44ece1badf2085c289164472.jpg", "website": "http://funbridge.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 42, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS"], "developers": ["GOTO Games"], "genres": ["Strategy", "Card"], "publishers": ["GOTO GAMES"], "esrb_rating": "Everyone 10+"}