{"id": 235234, "slug": "golf-solitaire-now", "name": "Golf Solitaire Now", "name_original": "Golf Solitaire Now", "description": "Welcome to the amazing world of solitaire! Golf is one of the most played patience games in the world. Now you can enjoy it anytime, and anywhere, on your mobile phone or tablet. Share your Golf Solitaire scores with your friends on Facebook and Twitter.<br/><br/>From Odesys, the makers of the best solitaire games for mobile.<br/><br/>The board of Golf Solitaire consists of 7 columns of 5 cards each, forming the tableau. The remaining 17 cards are turned face down to form the stock pile. The cards from the stock pile can be flipped over, one at a time, and placed on top of the home stack. The game begins when the first card from the stock pile is flipped. The cards from the tableau can be moved to the home stack in ascending or descending order only. Variations of the game exist where it is allowed for an Ace to be placed on top of a King and vice versa. The game ends when the stock pile is empty and no further moves can be made.<br/><br/>Odesys Golf Features:<br/>• Golf scoring<br/>• Landscape and portrait orientation<br/>• Unlimited Undo and Redo<br/>• Left and Right board layout<br/>• Adjustable cards size (pinch-to-resize)<br/>• Sound<br/>• Animations<br/>• Hints<br/>• Auto save on exit<br/><br/>Follow us on Twitter: @OdesysSolitaire<br/><br/>Look for other great patience games by Odesys. If you like the classics, you would love Klondike Solitaire, FreeCell Solitaire, Spider Solitaire, or its lesser known variations, Black Widow Solitaire and Tarantula Solitaire. You might also like to try Pyramid Solitaire, or its somewhat easier variation, Seven Solitaire, or the completely open Giza Solitaire. No solitaire collection would be complete without the unique Golf Solitaire, the addictive Yukon Solitaire, or its almost impossible to solve cousin, Russian Solitaire.", "metacritic": null, "released": "2016-02-11", "tba": false, "updated": "2019-10-22T14:17:36", "background_image": "https://media.rawg.io/media/screenshots/fad/fadb9f2270d9fbc9aff6ae5402e4b251.jpg", "website": "http://www.odesys.com/games/golf/ios.htm", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 58, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Odesys"], "genres": ["Card", "Puzzle"], "publishers": ["Odesys"], "esrb_rating": null}