{"id": 235356, "slug": "little-house-decorator-creative-play-for-girls-b-2", "name": "Little House Decorator - creative play for girls, boys and whole family", "name_original": "Little House Decorator - creative play for girls, boys and whole family", "description": "● If you have children who like to play with dollhouses or toy houses, this could be a wonderful app for your kids! - The iPhone Mom<br/>● is a must-have download for kids age 4 and above, who love room decorating games and dollhouses - Top Kids Apps\u2028<br/>● is a combination of a toy app, an activity book app, a sticker book app (...) In any cased hours of fun - Fun Educational Apps<br/>● nice creactive app to keep kids busy for hours - Real Kids Apps<br/>● wonderful app that promotes imagination and creativity and most importantly, free play! - APPreciation <br/>______________________________<br/><br/>If your child likes to play with dolls' houses this is a perfect application for it. Select one house that you want to decorate or decorate the entire neighborhood. Choose the furniture and decorations to be placed in your house. Select characters that have to live at home. See how much fun for your child will provide Little House Decorator.<br/><br/>FEATURES<br/><br/>- An application suitable for children of all age groups<br/>- Four houses (+ a tree house) to choose from. More than 100 different furniture and decoration in each house.<br/>- Simple interface makes the app easy to use by kids<br/>- You can always end the game and start it next time at the stage where it previously finished<br/>- Save your decorated house as an image to your device <br/><br/>________________________________<br/><br/>KNOW WHAT'S INSIDE<br/>As a MOMs with Apps member, we follow the <br/>\"Know what's inside\" best practices for kids’ apps<br/>________________________________<br/><br/>PRIVACY DISCLOSURE  <br/><br/>● this app does not collect or share any user's personal information.<br/>● this app does not contain ads.<br/>● this app does not contain any In-App Purchases.<br/>● this app does not contain social networks integration.<br/>● this app contains \"More Apps\" and \"Rate This App\" external links on a separate pages. The links are protected by a simple math task to prevent kids from going to the App Store. <br/><br/>For our privacy policy please visit www.jumpapp.eu<br/>________________________________<br/><br/>If you like Little House Decorator please take a moment to review it on the Itunes AppStore. Thank you!<br/><br/>If you have any comments, suggestions or would like to contact us please write to us - support@jumpapp.eu<br/><br/>● VISIT US: www.jumpapp.eu\u2028<br/>● LIKE US: www.facebook.com/JumpApp<br/>● FOLLOW US: www.twitter.com/JumpApp <br/>● FOLLOW US: www.pinterest.com/JumpApp <br/>● FOLLOW US: www.youtube.com/JumpAppHQ", "metacritic": null, "released": "2012-10-05", "tba": false, "updated": "2019-10-22T14:17:39", "background_image": "https://media.rawg.io/media/screenshots/b62/b620e2d6ff9e726a6e5375d16b98bae0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 139, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Sebastian Bachorzewski"], "genres": ["RPG"], "publishers": ["Sebastian Bachorzewski"], "esrb_rating": "Everyone 10+"}