{"id": 235329, "slug": "exploring-space-little-prince-edition", "name": "Exploring Space: Little Prince Edition", "name_original": "Exploring Space: Little Prince Edition", "description": "HAVE FUN WITH THE NEW ADVENTURES OF THE LITTLE PRINCE<br/><br/>Freely inspired by the immortal work of Antoine de Saint Exupery, \"The new Adventures of The Little Prince \"invite you to explore the universe of the original novel and discover new and charismatic characters. A fun and original way to introduce the small ones to one of the most famous stories of the twentieth century literature.<br/><br/>A PACK OF CHILDREN GAMES FOR CHILDREN AGE 2 AND UP<br/><br/>The app \"The New Adventures of The Little Prince\" is designed to move the narrative of the story of Antoine de Saint Exupery to the Children format game for children age 2 and up. Using classic games such as Puzzles, Find Differences or finding characters, learning and memory training and attention is encouraged, among other skills. But its studied visual and sound design, focused on relaxation and tranquility, make it an ideal candidate for use before bedtime.<br/><br/>● Explore and discover space in a single trip.<br/>● Play over 30 games for children age 2 and up.<br/>● Build puzzles with the characters.<br/>● Create and design an original scene of \"The Little Prince\". <br/>● Train your attention with the \"Find the differences\" game <br/>● Enhance your Memory by looking for matches.<br/>● Enjoy composing melodies with its musical game.<br/>● Relax with its music and atmosphere.", "metacritic": null, "released": "2017-01-19", "tba": false, "updated": "2019-10-22T14:17:38", "background_image": "https://media.rawg.io/media/screenshots/1dc/1dcac7c806c3c780e0a47e321f646f02_TeWJ9UY.jpg", "website": "http://www.bamboakids.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 58, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": [], "genres": ["Family"], "publishers": ["Sinergia de Estudio"], "esrb_rating": "Everyone 10+"}