{"id": 23547, "slug": "jaipur-the-board-game", "name": "Jaipur: A Card Game of Duels", "name_original": "Jaipur: A Card Game of Duels", "description": "** WARNING: iPad 2, iPad Mini 1 &amp; iPhone 4S are NOT compatible. **<br/><br/>*** Special Launch Price for a limited time! ***<br/><br/>*** \"Looks Gorgeous! I love the interface, so smooth and intuitive!\" *** - Brett Nolan, OTGGamer<br/><br/>*** \"I’ve been playing a ton of the new Jaipur app!” *** - Pep McDonald, Watch it Played<br/><br/>A Spiel des Jahres Recommended game, Jaipur is one of the most most well-loved 2-player tabletop games. Jaipur is a fast-paced card game for two players with a blend of tactics, risk and luck. You are one of the most powerful traders in Jaipur, the capital city of Rajasthan. You and your opponent duel to demonstrate to the Maharajah that you can earn a greater profit than your competition. At the end of a round, one player receives the Maharajah's seal of excellence, and the first player to earn two seals of excellence wins the privilege of being invited to the Maharajah’s court! <br/><br/>Each turn, you can choose to take one card, exchange your cards for other goods, buy the camels needed to transport your wares, or sell at the market. The sooner you sell and the more you sell of a single good at once, the higher your profit. <br/><br/>If you take cards, you have to choose between taking all the camels, taking 1 card from the market or swapping 2 to 5 cards between the market and your cards. If you sell cards, you get to sell only one type of good per turn, and you get as many chips from that good as you sold cards. The chips’ values decrease as the game progresses, but you get increasingly high rewards for selling sets of 3, 4, or 5 cards of the same good at a time, so it’s all about waiting just the right amount of time to make your trade.<br/><br/>You can’t sell camels, but they are integral to trading and they’re also worth a little something at the end of the round, sometimes enough to secure the win so use them smartly!<br/><br/>In this digital adaptation of the award-winning card game, find a comprehensive interactive tutorial and an extensive campaign mode. Solo play is available at three levels of difficulty. Play online 2 player cross-platform or locally in pass &amp; play mode. Track your achievements within the app and use your Asmodee Digital account to sign on.  Enjoy beautiful illustrations by Vincent Dutrait.<br/><br/>Languages available: English, French, German, Italian, Spanish.<br/><br/>Jaipur includes: <br/>• A faithful adaptation of Sebastien Pauchon's original Jaipur game<br/>• Online cross-platform 2 player mode <br/>• Local pass &amp; play mode<br/>• Solo play against 3 difficulty levels of AI<br/>• An extensive campaign mode<br/>• All new artwork by Vincent Dutrait<br/>• Detailed, interactive, turn-by-turn, in-game tutorial.<br/>• Achievement tracking<br/>• No in-app purchases or ads<br/>• Languages available: English, French, German, Italian, Spanish.<br/><br/>Awards:<br/>2014 Juego del Año Finalist<br/>2011 Games Magazine Best New Family Card Game Winner<br/>2010 Spiel des Jahres Recommended<br/>2010 Lys Grand Public Finalist<br/>2010 International Gamers Award - General Strategy: Two-players<br/>2010 Golden Geek Best Card Game Nominee<br/>2010 Golden Geek Best 2-Player Board Game Nominee<br/>2010 Fairplay À la carte Winner<br/><br/><br/>For more information, please visit http://asmodee-digital.com/jaipur<br/><br/>Find all the latest news for Jaipur on Facebook, Instgram, Twitter and Youtube!<br/><br/>Facebook: https://www.facebook.com/asmodeedigital/<br/>Twitter: https://twitter.com/asmodeedigital<br/>Instagram: https://www.instagram.com/asmodeedigital/<br/>YouTube: https://www.youtube.com/asmodeedigital", "metacritic": null, "released": "2017-05-24", "tba": false, "updated": "2019-07-30T20:05:24", "background_image": "https://media.rawg.io/media/screenshots/0b5/0b566ad0ef470d79c8493fec8ff242ee.jpg", "website": "http://www.asmodee-digital.com/jaipur/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 208, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Asmodee Digital"], "genres": ["Board Games", "Card"], "publishers": ["Asmodee Digital"], "esrb_rating": null}