{"id": 23541, "slug": "battleship-clashnaval-warfare-of-warships-empire", "name": "Battleship Clash：Naval Warfare of Warships Empire", "name_original": "Battleship Clash：Naval Warfare of Warships Empire", "description": "Start the Battle!<br/>It’s Your Duty, Commander!<br/><br/>BATTLESHIP CLASH is a REALITY 3D Naval game.<br/>There are more than 100 Warships, Warplanes，Guns and all kinds of Weapons.<br/><br/>FaceBook: Battleship Clash<br/><br/>This game design as a NAVAL STRATEGY type. The main defend fire are all kinds of warships, such as Aircraft Carrier, Battleship, Cruiser, Destroyer and other Vessels. To build up a fleet, the attack part mostly depends on many kinds of Warplanes such as Dive Bombers, Fighters, Heavy Bombers and Torpedo Planes. Main-guns and sub-guns of ships also can set up an air defense network to protect your fleet.<br/><br/>FREEDOM is the biggest feature of this free modern war game. Here are many sea areas, islands, boats and plants for you to explore and occupy. It’s all about command and conquer, all about call of duty, all about Kingdom and Glory.<br/><br/>ALLIANCE also a good place to communicate and cooperation. Allies can help each other to accelerate upgrade of vessels and ships, help each other to protect oil and steel fields. And the most import is the alliance PORT, it’s hard to occupy, so allies can attack the port together. After strike the port all the members can get a lot of bonus.<br/><br/>For the PVE part, this game provides a lots of battles and missions for players to learn how to fight various kind of ships and weapons. Attack the battles can obtain lots of resources. Generally speaking, the combat is not very easy to go through, the strategy is very import for this SLG game. When and how to launch Missiles, when and how to place aircrafts can make you immerse in this online frontline game.<br/><br/>For the PVP part. Players can choose fight by himself or join a ALLIANCE. To fight by self, you can fight for your nation and epic. You can attack all the players inside your shooting arrange. To fight by alliance. Generally, the President will gather all members take a military port as the center. The mission is to protect and occupy more ports and oceans to create a legend SEA EMPIRE. <br/><br/>NOW the Pacific is opening. In the short future the Atlantic, Indian oceans will open soon!<br/><br/>BATTLESHIP CLASH 3D is a Naval strategy game with brand new 3D models. You can experience exciting battles in the reality sea areas, occupy various kind of islands and create your naval empire.<br/><br/>At the beginning of this war game, you have a simple fleet with few warships and airplanes. To enhance your fleet, you can occupy island and attack enemy’s warship to get the necessary resources. Open the lottery box also a way to get rare debris of warships and airplanes. <br/><br/>FEATURES<br/>--Build historical WW2 battleships and aircrafts belonging to Allied and Axis forces. <br/>--Explore the mysterious sea areas to gather resources and create your fleet alliance.<br/>--Fight with thousands of REAL Players, chat in real time to discuss war strategy with your alliance members.<br/>--High quality 3D graphics with Acceptable size.<br/>--Customize your warships and Aircraft with different weapons and parts to win the battle<br/>--Episodes and hidden missions based on the largest Mysterious waters.<br/><br/><br/>Military fans attention! In this War Strategy Game, all the warships，weapons，airplanes and fighters are based on World War 2. <br/><br/>Cartoon warships with creative design! Include Battleship、Cruiser、Aircraft Carrier、Destroyer and so on!<br/>Thrilling news for the fans of Gunship Battle! With various kind of fight, such as Dive bomber, Fighter,Heavy bomber,Torpedo planes!<br/><br/>Take the battle to the seas in WARSHIP BATTLE 3D, a 3D battleship action game, with missions inspired by the historic naval clashes of World War II. <br/>Take control of authentic World War II era vessels and steer them through epic naval battles to glorious victory!<br/><br/>BATTLESHIP CLASH<br/>Join the largest war strategy online game and PLAY NOW!", "metacritic": null, "released": "2017-05-22", "tba": false, "updated": "2019-10-22T14:30:36", "background_image": "https://media.rawg.io/media/screenshots/c17/c17ebe389e6a6c873f4d1f9aa3bb2c53_jmwCHO8.jpeg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 150, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["lina wang"], "genres": ["Adventure", "Strategy"], "publishers": ["lina wang"], "esrb_rating": "Teen"}