{"id": 235411, "slug": "working-cats", "name": "Working Cats", "name_original": "Working Cats", "description": "Start from a humble, one-cat garage business and turn it into the biggest cat company ever! You'll have dozens of Working Cats, each one of them tapping their way into making you richer. <br/><br/>Choose and Collect from Thousands of different Cat variations, each one with their own life story, talents and skills. Train and develop them into their own specialties. There are even ultra-Rare Cats that you can choose to work for you!<br/><br/>Dress all of your Cats the way you want to, from smart, classy outfits to just really weird ones.<br/><br/>Send your Cats out to do sales calls, and they might bring you riches, gems, or even mysterious Trinkets for you to Collect. You can also give them breaks, where they will relax and mingle in your office lounge. <br/><br/>Design and upgrade your office with different themes, desks, computers, and trinkets. Watch your office grow from a tiny business to a massive, cat company!<br/>Features:<br/>- Hire, Train and Level Up a huge variety of different cats, including ultra-Rare cats<br/>- Build and Grow your Cat company from the ground up, starting from 1 cat to Dozens of cat workers<br/>- Send your Cats to relax and brainstorm in the break room - install vending machines, comfy couches, and more<br/>- Maximize your profits and decorate your office with a great selection of different desks, computers and background themes<br/>- Send your Cats out on Sales Calls to collect different kinds of mysterious Trinkets<br/>- Highly Satisfying mix of tycoon / RPG / collector", "metacritic": null, "released": "2017-07-21", "tba": false, "updated": "2019-10-22T14:17:41", "background_image": "https://media.rawg.io/media/screenshots/461/4614dcf4e669df61dc3e4e1a6fac8975.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 111, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Blimps"], "genres": ["Strategy", "Simulation"], "publishers": ["Blimps"], "esrb_rating": "Everyone 10+"}