{"id": 23540, "slug": "ace-racing-turbo", "name": "Ace Racing Turbo", "name_original": "Ace Racing Turbo", "description": "Get ready and start your engine, race on amazing tracks with crazy looping.<br/>Drive the fastest car in this exciting ultimate racing game!<br/><br/>Enjoy extreme mind-blowing visuals<br/>    Choose from 20 race tracks<br/>    Explore 9 unique car <br/>    Reach impossible speeds<br/>    Race for the World Cup and achieve victory being on top 3<br/>    Take part in a selection of hardcore challenges<br/>    Win the Ghost race!<br/><br/>Race for to the top 3, reach real unbelievable speeds, and become one of the most popular racers in Ace Racing Turbo<br/> <br/>CHOOSE YOUR CAR <br/>Pick and tune to perfection one of the 9+ car from 3 unique car classes.<br/> Customize your car by tuning its appearance. You can also increase your engine's power, upgrade your clutch, body, nitro, and more these will all have a definite impact on your car 's performance.<br/><br/>UNIQUE WORLD SETTINGS<br/>Have you ever dreamed of driving the fastest sport car in the world? Are you fed up with standard car racing games? Then you should definitely take a look at this real challenge!<br/><br/>HIGH SPEED RACING<br/>Take the challenge and beat the high score setting a new maximum world speed record! Nothing will stop you from reaching the finish line before your opponents. Race for the World Cup and win proudly your first world title!<br/><br/><br/>STUNNING GRAPHICS<br/>Ace Racer combines extreme mind-blowing visuals and sound with breathtaking gameplay.<br/><br/>Download and play for amazing stunt real racing emotions!<br/><br/>like us on facebook ! <br/>https://www.facebook.com/AHGAME2017/", "metacritic": null, "released": "2017-05-22", "tba": false, "updated": "2019-10-22T14:30:36", "background_image": "https://media.rawg.io/media/screenshots/5cc/5cc34be455a226a077146f83cc56a3cb.jpeg", "website": "http://ahgame.de/Home/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 21, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["AH GAME"], "genres": ["Racing", "Arcade"], "publishers": ["Hamdeh Abu Khalifeh"], "esrb_rating": "Everyone 10+"}