{"id": 235463, "slug": "crash-day-derby-simulator-pro", "name": "Crash Day: Derby Simulator Pro", "name_original": "Crash Day: Derby Simulator Pro", "description": "Destruction. Shooting. Race. Tricks. Explosions.<br/>All the best is collected in this game.<br/>Take any supercar, install your favorite weapon and press the accelerator pedal. Can you survive in the deadly race of cars?<br/>You will find an exciting race with a lot of game modes:<br/>- \"Deadly duel\" - destroy the machines of opponents in all available ways, smash, blow up, shoot. Whoever first reaches the goal of destruction, he will be the winner.<br/>- \"The last survivor\" is a classic derby battle, break all the machines, and you are the winner.<br/>- \"Ahead of all\" - this is the regime for real riders. You have to destroy more than ever, as the winner will only become if you tear yourself away from the enemy who is breathing in your neck for several accidents.<br/>- \"Tricks\" - show your ingenuity on a special track with trampolines. Get the most points of tricks to win.<br/>- \"Transfer of the bomb\" - this heat and adrenaline. Take the bomb from the enemy, and then give it until it exploded. You will have to not only catch up, but also run away, choose the fastest car and drive.<br/>- \"Race\" - drive first, install a machine gun or a bazooka on your machine, this will help you to come to the finish line first.<br/><br/>Features:<br/>- Realistic HD graphics with excellent optimization;<br/>- A lot of cars, choose any;<br/>- Installing weapons on cars;<br/>- Improvement of cars, pumping;<br/>- Three types of machine control are available in the settings;<br/>- Detailed setup of the game;<br/>- Change of color of cars;<br/>- Various tracks, an open arena, an arena with springboards, a racing track;<br/>- Deformation and destruction of machines in real time, various damages;<br/>- Earn a rating that would buy new cars;<br/>- Intensive, high-speed action action;<br/><br/>Destruction has never been so real.<br/><br/>Install it! Play it!", "metacritic": null, "released": "2017-07-01", "tba": false, "updated": "2019-07-30T12:51:04", "background_image": "https://media.rawg.io/media/screenshots/cfa/cfaab80558939eb989c49523f50de1b4_SVszGO4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 143, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Ruslan Vorona"], "genres": ["Simulation", "Racing"], "publishers": ["Ruslan Vorona"], "esrb_rating": null}