{"id": 2354, "slug": "mirrors-edge-catalyst", "name": "Mirror's Edge Catalyst", "name_original": "Mirror's Edge Catalyst", "description": "<p>Mirror&#39;s Edge Catalyst is the second part in the Mirror&#39;s Edge series. Like its predecessor, it is based around parkour simulation.</p>\n<h3>Plot</h3>\n<p>The game is set in the near future that is depicted as a cyberpunk dystopia. The story takes place in the city of Glass that is ruled by mega-corporations. Faith, the protagonist of the original game, returns in Catalyst. She is a Runner, a person who specializes in illegal delivery. Early in the game, Faith steals a valuable hard drive from a corporation. After reading its data, she learns about the Reflection project that will allow the corporations to control every resident in Glass.</p>\n<h3>Gameplay</h3>\n<p>The game combines platforming, parkour, and puzzles in the vein of Portal series. The player controls Faith from the first person view as she runs and leaps across the rooftops of Glass. Puzzle-like level design requires her to use pipes, wires, and ledges to get to her destination. Precision timing is important to perform jumps, slides, and rushes in a seamless flow.</p>\n<p>The combat system in Catalyst changed dramatically. Unlike in the original game, Faith cannot use guns. She can fight in hand-to-hand combat but usually has to avoid enemies.</p>\n<h3>Style</h3>\n<p>Like its predecessor, Catalyst is notable for its minimalist use of colors. Glass is mostly shining white and dark blue, while the occasional use of other colors signifies something important. The game is accompanied by the cold, atmospheric electronic soundtrack by Solar Fields.</p>", "metacritic": 72, "released": "2016-06-07", "tba": false, "updated": "2024-04-18T20:11:33", "background_image": "https://media.rawg.io/media/games/257/257c497aa4060f4a697ccbf5e99ec230.jpg", "website": "https://www.ea.com/games/mirrors-edge/mirrors-edge-catalyst", "rating": 3.49, "rating_top": 4, "added_by_status": {"yet": 198, "owned": 2481, "beaten": 595, "toplay": 152, "dropped": 326, "playing": 39}, "playtime": 3, "achievements_count": 219, "ratings_count": 824, "suggestions_count": 438, "game_series_count": 2, "reviews_count": 839, "platforms": ["PlayStation 4", "PC", "Xbox One"], "developers": ["Electronic Arts", "Electronic Arts DICE"], "genres": ["Action", "Adventure", "Platformer"], "publishers": ["Electronic Arts"], "esrb_rating": "Teen"}