{"id": 235443, "slug": "detective-deep", "name": "Detective Deep", "name_original": "Detective Deep", "description": "Detective Deep is a challenging slow paced underwater adventure filled with hidden objects. In this methodical game, you’re a top tier secret detective in a submarine with a mighty beam of light in the deep dark ocean. You’re there to shed some light on different cases by retrieving three unique pieces of evidence per case. Finish the case to receive 1 star and unlock the next case or challenge yourself to finish under 4 minutes for 2 stars or under 2 minutes for 3 stars! <br/><br/>You can also try to memorize the location of the evidence and replay a level to obtain the items quicker to gain more stars if you haven't received the max of 3. <br/><br/>**Evidence Mode:  Investigate the deep ocean to find three pieces of evidence that relate to the seriously silly case given to you.<br/><br/>**Challenge Mode:  Explore the tropical ocean to collect as many gold coins you can in 60 seconds.<br/><br/>--------------------------------<br/><br/>*Features vivid hand-drawn &amp; computer generated stylistic retro pixel artwork.<br/><br/>*Awesome atmospheric sound effects and music. <br/><br/>*Retro minimalistic animations.<br/><br/>*30 cases, each with a different culprit &amp; premise. <br/><br/>*High scores and Gamecenter leaderboards.<br/><br/>*Two virtual control options: Joystick or D-pad.<br/><br/>*Submarine beeps when its near an item, but there are several items in the ocean that aren't related to your case.  Tap an item for a clearer view.  Double tap to select as evidence.(Evidence mode)<br/><br/>*Your submarine detects most of the items in the ocean at the beginning of the case and lays it out on a map.  You can view the map at anytime, but there will be 30 seconds added to your case time with each use.<br/><br/>*Your submarine can also detect sharks sometimes and give you a warning sound when they're getting close to your general area…<br/><br/>*There are all kinds of living things in the deep ocean like electric eels, mermaids, blowfish, small octopus, sea turtles, and more, but watch out for those sharks and giant octopuses!  Your submarine can only take three hits.  On the fourth hit, its gameover.....until you restart of course. <br/><br/>----------------------------------<br/><br/>Detective Deep is a unique underwater adventure that's kind of relaxing but also kind of intense and always as challenging as you make it.<br/><br/>**Winner of the \"Best Originality\" award in the 2011 Think Outside The Box mobile game contest!!**<br/><br/>--------------------------------<br/><br/>(This is a slower paced game. There are no power-ups and shooting involved.)", "metacritic": null, "released": "2011-08-31", "tba": false, "updated": "2019-07-30T17:35:09", "background_image": "https://media.rawg.io/media/screenshots/7d1/7d123272949217256a464002c502b7b7_c9HUHHg.jpg", "website": "http://www.wordpress.8BitAvrin.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 89, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Avrin Ross"], "genres": ["Adventure", "Strategy"], "publishers": ["Avrin Ross"], "esrb_rating": null}