{"id": 235570, "slug": "extreme-flying-car-driver-2018", "name": "Extreme Flying Car Driver 2018", "name_original": "Extreme Flying Car Driver 2018", "description": "Welcome to the newest and unique Extreme Flying Car Driver 2018 game and enjoy the thrill ride across the Sky spaces and road tracks. If you like classic car driving games, you will love to drive a future flying car in city in this flying games, Extreme Flying Car Driver 2018 game has everything you expect in car games like car stunts, nitro and drifts with your muscle car. So now transform wheels into quadcopter and fly car in the skies like airplane flight with realistic plane physics and become a Grand flight pilot as well as car driver in this flying car game.<br/>The Extreme Flying Car Driver 2018 is amazing experience than the Airplane. Many flying car games are in competition. Drive the flying car in Sky to explore the City. Play the Extreme Flying Car Driver 2018 game on your own device. Extreme car driving in sky never seen before.<br/>Time to play Extreme Flying Car Driver 2018 simulator game. Test your airplane pilot and car driving skill at a time! Fly your car like airplane around the city. Drive your sports car &amp; drifts on sky in futuristic flying car drive pilot simulator 3d. You will fly super speed sports car into the real city locations. Flying car extreme futuristic flight pilot simulator 3d is a driving &amp; flying to complete different missions.<br/>Enjoy this most cool looking, excited game having a stunning graphics, with real sound effect, smooth and realistic handling in this Extreme Flying Car Driver 2018 game. This simulator game makes your time joyful with its amazing City with Sea environment and perfect beach Sky flying. Your muscle car has never been so much cool without wings, its now a futuristic flying car which can do both driving on the city offroad streets and flying in the skies. <br/>Now become the most incredible racing car driver and Flying car pilot by jumping into yor muscle car which can drive like a real car simulator and also can fly above the city like airplane simulator. Get in the driver seat and do stunts or drift around the city streets or activate the flying mode and turn your fast racing car into a very unique flying car. You can be a top car driver or an airplane pilot. Press on the nitro boost to go on the super speed and burn the asphalt road.  <br/>This Extreme Flying Car Driver 2018 simulator addictive game is available on app store. Now! you download this game. Good luck!<br/>Become Master in each mode of Extreme Flying Car Driver 2018 3D game. Pass the crazy Dangerous track in adventure rally and control your car movement for speed racing stunt game.  Burnout your tires and keep your name in the field of Driving.<br/>Drive the real flying car in maximum speed in this 3d car rally City Sky.<br/><br/><br/>Extreme Flying Car Driver 2018 Features:<br/><br/>- Highly realistic Simulation game.<br/>- Attractive visual effects of the game.<br/>- the actual driving feeling with extra fun.<br/>- Simple and smooth control.<br/>- Challenging tasks to complete.<br/>- 3d beautiful City and sea environment.<br/>- Realistic Airplane physics.<br/>- Awesome Hybrid Jet Car.<br/>- High quality 3D beautiful stunning graphics<br/>- Futuristic Flying Car Model<br/>- It is a free game available on app store.", "metacritic": null, "released": "2018-05-15", "tba": false, "updated": "2019-10-22T14:17:46", "background_image": "https://media.rawg.io/media/screenshots/ec7/ec7c57707fd837756a2677f561ac610c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 186, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Khurram Shahzad Khan Studio"], "genres": ["Simulation", "Racing"], "publishers": ["Khurram Shahzad Khan Studio"], "esrb_rating": "Everyone 10+"}