{"id": 235558, "slug": "prison-escape-jail-survival", "name": "Prison Escape: Jail Survival", "name_original": "Prison Escape: Jail Survival", "description": "In this game Prison Escape : Jail Survival ,Prison was sentenced 15 years imprisonment in a horrible jail prison commando escape. The jail prison break you are sent to the prison outside the City big jail in the woods for a crime as a prisoner never committed. It’s a high security prison, a jail just like Alcatraz. <br/>Kill the police guards before they shoot fight &amp; kill you &amp; pick up their modern weapons &amp; guns to combat back is police vs robbers. Strike hard &amp; counter their attacks because that’s what your success depends on. The corrupt warden has assigned police sniper shooters, police security guards, k9 dogs, cops patrol cars, CCTV cameras etc to keep an eye on break prison police man know prisoner hero don’t belong to jail with all the criminals. It’s time for broke the Prison escape life to plan &amp; break out of this jail broke Games in order to get your freedom again and prove you a prison fighter. Run prisoner Run away from this high security Alcatraz like jail the innocent prisoner fighter befriended other criminals &amp; prisoners which helped the hero in blending in &amp; collecting the information required in action game.<br/>The Police warden has the maximum security like alcatraz prison in escaped prison and escaping commando from the Jail guards only seems to be a dream fighter prison escape boy. But to breakout is your only break escaping prison mission now. In order to escape successfully break out of the jail you’ll have to devise a grand &amp; great plan. <br/>In this adventure game survivor jail Prison life get to play the role of a special agent spy intelligence who on a mission was captured by the enemy special forces cops &amp; robbers. As a secret trained agent commando were on a special secret mission serving your country like a true hero but unfortunately the enemy Special Forces somehow managed to capture &amp; put you in criminal jail. A maximum security prison plan. But simply putting the army in a jail adventure &amp; making you a prisoner is no good. Commando jail survivor are a special agent spy intelligence trained in stealth hand to hand combat fighting spying melee weapons &amp; gun shooting. Escape commando have all the skills required to break out of a prison. This jail can’t keep you away from freedom and fighting for family your daughter from serving your country like a true hero &amp; enemy forces can’t keep you as a prisoner life for long in survive games. Prison Escape : Jail Survival is a free game available on app store download it free.<br/><br/>Prison Escape : Jail Survival : FEATURES <br/>• Challenging Levels of Escaping and Fighting<br/>• Eliminate Police Officers trying to stop your Breakout <br/>• Thrill of Taking out Prison Officers <br/>• Highly Additive &amp; Immersive Gameplay<br/>• Punch, Kick or Hit them with your Baseball Bat<br/>• Escape the Prison with a Master Breakout Plan", "metacritic": null, "released": "2018-01-20", "tba": false, "updated": "2019-10-22T14:17:45", "background_image": "https://media.rawg.io/media/screenshots/992/992570115fedadeac1b2c12b37192c2e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 135, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Khurram Shahzad Khan Studio"], "genres": ["Action"], "publishers": ["Khurram Shahzad Khan Studio"], "esrb_rating": "Mature"}