{"id": 235572, "slug": "modern-commando-shoot-mission", "name": "Modern Commando Shoot Mission", "name_original": "Modern Commando Shoot Mission", "description": "Modern Commando Shoot Mission game is the most realistic action game. You are not just a smart shooter, you feel as a real army commando which protect city from dangerous killer and do efforts to secure country. This Modern Commando Shoot Mission game is full action pack game it’s absolutely free for users. Destroy the enemies with your favorite heavy guns 3d weapon because you are a best commando from the army officer force. This Modern Commando Shoot Mission game is here for your lovely great excitement time. Use your powerful guns expert shooting skills to shoot every target in this shooting game. Modern Commando Shoot Mission game is not dull game, everybody likes commando shooting action game. This is the best chance for better shooter to test your sniper shooting abilities.<br/>Modern Commando Shoot Mission game Aim, Shooting and hitting, be the perfect sharp shooter in this deadly new game. Use your latest guns rifles and fire arm weapons to take the extreme head shot. This sniper rifle type is especially designed for delivered for best shooter training with an especially powerful zoom and powerful pierce bullets. You've stepped to eliminate the crime, there has many dangerous enemies. So are you ready for thrilling secret mission? If yes, then pick up the latest rifle and pull the trigger to finish the enemy coming on your way. Strive hard for your survival in this Modern Commando Shoot Mission game.<br/>Features:<br/>• Use powerful skills to fight off enemies.<br/>• Intuitive FPS and 3rd person controls.<br/>• Real looking 3D battlefield environment.<br/>• A real-time lock picking and door hacking game play.<br/>• Realistic to life sound effects.<br/>• Realistic war fighting action<br/>• You can download free now.", "metacritic": null, "released": "2018-01-05", "tba": false, "updated": "2019-10-22T14:17:46", "background_image": "https://media.rawg.io/media/screenshots/ff0/ff07384456b832788c6a68302578d768.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 115, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Khurram Shahzad Khan Studio"], "genres": ["Action"], "publishers": ["Khurram Shahzad Khan Studio"], "esrb_rating": "Mature"}