{"id": 23554, "slug": "save-our-souls-sos", "name": "Save Our Souls (SOS)", "name_original": "Save Our Souls (SOS)", "description": "Episode 1 and 2  are now available <br/><br/>« Season 01 – Urban influences » - first part of a trilogy called « Between light and shadow » - takes place in big North American city.<br/><br/>This introduction to the first season of S.O.S. (Save Our Souls) presents the universe and the main characters of the season. It shows also the atmosphere in which “Ethan” the character you’ll play will evolve. He’s about to start a curriculum as a first-aid officer for very personal reasons…<br/><br/>The action takes place for the most between campus life and field emergencies. Ethan will be confronted during his night shifts to very stressful situations, sometimes very dangerous, playing always against the time, between life and death…<br/><br/>Ethan will have to make his presence felt, by learning to deal with the strong personalities of the other rescue team members.<br/>Episode by episode, Ethan will improve his “saving” skills and will develop his observation ability.<br/>He will learn other very useful capacities while in mission and will find out some secrets about his co-workers friends.<br/>A gameplay, in the pure tradition of the “point and click” genre using all the control assets provided by iPhone and iPod.<br/>An adventure game fit for casual gamers.<br/>A present and fantastic adventure game in which each episode concludes with two possible endings.<br/><br/>Available in two languages: English, French<br/><br/>FEATURES:<br/><br/>- Discover how it is to be in first-aid officer’s shoes<br/>- Addictive full 2D adventure in 10 episodes<br/>- Dark and mysterious atmosphere<br/>- Numerous and various attaching characters<br/>- Simple interface: point with your finger and play<br/>- Multiple endings<br/>- Astonishing backgrounds<br/>- The “Victim Mode” is stressful and demands to remain calm to save a person<br/>- 4 saving slots to pause and resume your game<br/>- 2 full episodes available", "metacritic": null, "released": "2009-10-05", "tba": false, "updated": "2019-10-22T14:30:36", "background_image": "https://media.rawg.io/media/screenshots/245/245e14df37347ae9c460db28dcb62124.jpeg", "website": "http://www.sosthegame.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 170, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["MEDIGAMES STUDIOS"], "genres": ["Adventure"], "publishers": ["MEDIGAMES STUDIOS"], "esrb_rating": "Everyone 10+"}