{"id": 235580, "slug": "extreme-super-water-bike-3d", "name": "Extreme Super Water Bike 3D", "name_original": "Extreme Super Water Bike 3D", "description": "Extreme Super Water Bike 3d is the ultimate stunts bikes game full with variety of Motorcycles having action motorcycle engines. Extreme Super Water Bike 3D game is fast-is paced action game with extreme crazy stunt bikes, full of hurdles 3D environment for crazy bike stunts action moto. You are a bike boy. Play the off road impossible bike stunt racing and explore much more fun with the super stunt bikes and off-road racing moto. You are a stunt rider in this game. This Extreme Super Water Bike 3D game is one of the best stunts and fast-paced game. This game is, as bike stunt games. This game will allow you to ride on your bike through the madness-filled levels. By playing this game be the quickest rider and show your bike riding skills. Perform dangerous stunts on your bike. In addition, use your stunning bike to navigate your way through crazy stunts to challenge your skills.<br/>Features:<br/>\t•\tOutstanding Water Surfing Bikes<br/>\t•\trealistic physics of floating motorbikes<br/>\t•\tBeautiful beach and ocean environment<br/>\t•\tEasy and intuitive controls<br/>\t•\tMany different types of bikes and levels<br/>\t•\tHigh Quality 3D Graphics and Engaging Sound Effects!<br/>\t•\tEnhance physics based engine.<br/>\t•\tModern fastest sports bikes in the aqua racing adventure game.<br/>\t•\tMulti-level gameplay<br/><br/>Play this Extreme Super Water Bike 3D addictive stunt game and perform your stunt riding skills to prove that you are the real trail bike racer. Show your stunts in this game .This game is Jump Bike and freestyle game. Enjoy 3D graphics and smooth control, which give you best stunts bike experience. If you like, this game share with your friends and family enjoy. Have Fun!", "metacritic": null, "released": "2017-10-26", "tba": false, "updated": "2019-10-22T14:17:46", "background_image": "https://media.rawg.io/media/screenshots/495/4957488be7f378556243d8934b3a0197_AhmwoSh.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 116, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Khurram Shahzad Khan Studio"], "genres": ["Simulation"], "publishers": ["Khurram Shahzad Khan Studio"], "esrb_rating": "Everyone 10+"}