{"id": 235524, "slug": "russian-mafia-gangster-driver", "name": "Russian Mafia: Gangster Driver", "name_original": "Russian Mafia: Gangster Driver", "description": "Do you know how to be a crime driver in Russian mafia business?<br/><br/>Deep into crime life with interesting story line and show the mafia gangsters and the police who is faster. The gangsters are really mad guys! Help them to steal guns, threaten people, rob a bank! Steal cars and run from the police. Be ready for hard time limit because now your life is full of crime!<br/><br/>Do you like crime games about gangsters, police or mafia? So, it is time to try our Russia Crime Driver. Try car driving without rules. A great driving simulator for you!<br/><br/>Features of Russian Mafia: Gangster Driver<br/><br/>- Crime missions<br/>- Gangster story<br/>- Car thefts<br/>- Russian mafia<br/>- Many police cars <br/>- Time limit<br/><br/>Work for rough gangsters against the police! Test the power of your car, deep into crime driving. <br/><br/>You can drive as fast as you want in Russian Mafia: Gangster Driver. Try the driving in Russia and enjoy the crime vs police atmosphere. Drive car, don't lose the control or the police catch you. Feel like a mafia gangster with our driving simulator!<br/><br/>Train your driving skills, find your strategy to drive any car and run from the police! Find who is worse in the city - mafia or the police officers! Do your crime tasks fast - mafia gangsters don't like to lose their time.<br/><br/>Do what mafia do in Russia! Steal cars and run away from the police. Meet bad gangsters and work for them. Be a crime driver in Russia! Run from the police as a professional. The gangsters are cruel. Do missions in Russia and see what might happen if you complete all of them or if the police catch you. Join the crime mafia business of gangsters and do their tasks. They need you to drive cars and help them to terrorize the city.<br/><br/>Don't wait, meet with Russian crime deals in Russian Mafia: Gangster Driver!", "metacritic": null, "released": "2016-09-11", "tba": false, "updated": "2019-10-22T14:33:13", "background_image": "https://media.rawg.io/media/screenshots/e52/e52264b89e5feb95f9b9883f52516cd8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 113, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Game Maveriks"], "genres": ["Simulation", "Racing"], "publishers": ["Game Maveriks OOO"], "esrb_rating": null}