{"id": 235501, "slug": "flying-car-driver-simulator-3d-full", "name": "Flying Car Driver Simulator 3D Full", "name_original": "Flying Car Driver Simulator 3D Full", "description": "Flying Car Driver Simulator 3D is best for you!<br/><br/>Want to drive or fly in a flying futuristic car simulator? Do it! Transform your car into flying futuristic vehicle and enjoy. No asphalt, no traffic, just fresh air. Try both simulator modes - fly missions and freeride. They are interesting! Earn money, upgrade flying cars, buy new futuristic models and try them. Fly right through red circles in futuristic simulator, but be accurate and don't crash!<br/><br/>Features of Flying Car Driver Simulator 3D:<br/><br/>- Futuristic Flying Car Models<br/>- 3D Graphics<br/>- Realistic physics<br/>- Easy simulator controls<br/>- Challenging flying missions<br/>- Sound effects<br/><br/>Flying Car Driver Simulator 3D is a real challenge for futuristic car fans! Start your engine right now and fly, pilot! Train yourself how to complete hard tasks. Find your own strategy how to drive any flying car in the futuristic simulator. Turn the thrust, expand wings and fly your awesome car.<br/><br/>The safety of your flying car depends on you. Is not easy to fly in the futuristic simulator. But you can do it with our tutorial and smooth controls. Don't forget that you can drive too. But Flying Car Driver Simulator 3D is not only about driving, it is more fun to fly here!<br/>Fly your futuristic car like an aeroplane! Be a pilot and driver at the same time. Test all your skills and abilities. This futuristic simulator is perfect for you!<br/><br/>Who loves playing real airplane flight simulators will love the futuristic Flying Car Driver Simulator 3D! Perform best flight to collect maximum circles and be a flying car professional.", "metacritic": null, "released": "2016-09-07", "tba": false, "updated": "2019-10-22T14:17:42", "background_image": "https://media.rawg.io/media/screenshots/3a9/3a9a4131d2d52c3ea5f6b46e4e650e2d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 95, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Game Maveriks"], "genres": ["Simulation", "Racing"], "publishers": ["Game Maveriks OOO"], "esrb_rating": "Everyone 10+"}