{"id": 23550, "slug": "iron-blade-medieval-legends-rpg", "name": "Iron Blade: Medieval Legends RPG", "name_original": "Iron Blade: Medieval Legends RPG", "description": "Fate doesn’t make a hero -- you must grab your blade and become one yourself!<br/><br/>Forge your destiny in Iron Blade; a thrilling action RPG set in a medieval Europe filled with monsters and magic. Explore a world brought to life with console-quality graphics as the innovative -- yet easy-to-learn -- combat system throws you into one heart-pounding battle after another!<br/><br/>Collect amazing weapons, explore breathtaking real-world locations and test your skills against millions of other players, as you build your own domain and engage in exciting PvP challenges.<br/><br/>**GAME FEATURES**<br/><br/>AN EPIC ODYSSEY:<br/>- A demonic army approaches! Soon, they will devour all of humanity unless you can fulfill the prophecy and seal them away for good.<br/>- Unravel a plot full of intrigue and bitter betrayal as you fight through the challenging story missions.<br/>- Explore a world rich in lore and set in a fantastic alternate-reality Europe, full of legendary warriors and arcane mysteries.<br/>- Your adventure will take you through many awe-inspiring locations, from fighting off demon knights in Notre Dame to banishing vampires in Transylvania.<br/><br/>AMAZING COMBAT<br/>- Everyone can enjoy the deep and thrilling combat controls, which were specially designed for mobile and allow you to smoothly perform amazing chains of attacks against numerous enemies.<br/>- Develop your own fighting style by linking up taps and swipes to perform monster-crushing combos.<br/>- Face a fearsome variety of foes from vampires to undead soldiers, each brought to life with amazing graphics, animations and combat abilities.<br/>- Unleash deadly special attacks and finishing moves that deliver a grisly end to any who dare challenge you.<br/><br/>MASTER LEGENDARY POWERS<br/>- Collect a massive selection of weapons and armour along your adventure.<br/>- Upgrade your gear to customise your combat strengths and style.<br/>- Unleash devastating spells and skills on your foes.<br/><br/>COMPETE WITH PLAYERS<br/>- Establish your own domain that you can fortify with a castle.<br/>- Acquire and upgrade castle defenders to protect your domain and its resources while you’re away.<br/>- Raid other players’ castles to crush their defences and loot their most valuable resources for yourself!<br/><br/>_____________________________________________<br/><br/>Visit our official site at http://gmlft.co/website_EN<br/>Check out the new blog at http://gmlft.co/central<br/><br/>Don't forget to follow us on social media:<br/>Facebook: http://gmlft.co/FBIBAN<br/>Twitter: http://gmlft.co/TWIBAN<br/>Instagram: http://gmlft.co/ibingp<br/>YouTube: http://gmlft.co/ytibgp<br/><br/>Privacy Policy: http://www.gameloft.com/en-gb/privacy-notice<br/>Terms of Use: http://www.gameloft.com/en-gb/conditions-of-use<br/>End-User License Agreement: http://www.gameloft.com/en-gb/eula", "metacritic": null, "released": "2017-05-24", "tba": false, "updated": "2019-10-22T14:19:23", "background_image": "https://media.rawg.io/media/screenshots/437/4376b979dc5d11b19773dca807f1e189_gK7FnF6.jpg", "website": "http://www.gameloft.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 609, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Gameloft"], "genres": ["Action", "RPG"], "publishers": ["Gameloft"], "esrb_rating": null}