{"id": 235574, "slug": "counter-terrorists-commando-sh", "name": "Counter Terrorists Commando Sh", "name_original": "Counter Terrorists Commando Sh", "description": "Counter Terrorist Commando Shooter game is a first person shooting game. With very dangerous missions and thrilling gameplay. A free endless shooting game with 3D graphics to indulge all the action and FPS lovers. In Counter Terrorist Commando Shooter game, you can select from various missions to complete, with its addictive war rescue game play and a chance to be the US Army hero city fighter in 2017. Counter Terrorist Commando Shooter game just when everything seems hopeless, shoot, blow and blast your way out of the sticky situations in this war rescue. In Counter Terrorist Commando Shooter game Enter into secret hideout of city mafia and criminals and take them down as special sniper. Eliminate the terrorist force with special shooting skills. Aim and shoot with perfection. <br/>In Counter Terrorist Commando Shooter game End the terrorist threat. This terrorist war against terrorism is not going to end until the last criminal remains in this Counter Terrorist Commando Shooter game. Army commando is must be careful and active to eliminate the enemies in counter terrorist gun shooting FPS shooting game 2017. Show your counter terrorist commando shooting skills in war against crime and terrorist forces. It is free available on App store, you can download this game and enjoy freely. Multiple guns (Pistol, knife, M4) are use in this game to shoot and eliminate the enemies<br/>Features:<br/>\t•\tAddictive game play<br/>\t•\tFree to play 3D Modern FPS Action game<br/>\t•\tChallenging missions to accomplish<br/>\t•\tReal like sound effects<br/>\t•\tVarious weapons to use<br/>\t•\tHD 3D graphics<br/>\t•\tRealistic 3D shooting battlefield environment<br/>\t•\tSimple and smooth operation<br/>\t•\ta large number of advanced powerful weapons<br/>\t•\tRadar vision positioning the enemy's position<br/>\t•\tChallenges of increasing levels of difficulty<br/>\t•\tBest quality attractive sound effects<br/>\t•\tPlay anytime, anywhere<br/><br/><br/>Counter Terrorist Commando Shooter game is a thrilling game and have interesting levels to play. This game is a challenge for you, so kill all the enemies and complete the missions. Download this game free on App Store.", "metacritic": null, "released": "2017-10-27", "tba": false, "updated": "2019-10-22T14:17:46", "background_image": "https://media.rawg.io/media/screenshots/1d9/1d942e411f1ff11933ef5f67213230a2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 157, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Khurram Shahzad Khan Studio"], "genres": ["Action", "Adventure"], "publishers": ["Khurram Shahzad Khan Studio"], "esrb_rating": "Mature"}