{"id": 235626, "slug": "sushi-mahjong-deluxe", "name": "Sushi Mahjong Deluxe", "name_original": "Sushi Mahjong Deluxe", "description": "*** SUSHI GIRLS MAHJONG - DELUXE EDITON ***<br/><br/>JOIN THE MILLIONS OF MAHJONG FANS IN THE WORLD!<br/>Train your mind and become a Mahjong Master with the help of the legendary Sushi Girls in their latest Mahjong adventure.<br/><br/>STEP INTO THE RUMINANT WORLD OF SUSHI MAHJONG!<br/>Use your mind and your power of deduction to solve Mahjong combinations created by the beautiful Sushi Girls.<br/>The master of Sushi will teach and train you to become the biggest Sushi Master.<br/>What are you waiting for ? Let's play !<br/><br/>Always remember, if you want to play Mahjong, play it Sushi-Style!<br/>Come and visit the beautiful Chinese garden of the Sushi Girls.<br/>Do you already know all Sushi Girls by name ?<br/><br/>FEATURES:<br/>- Game Center Achievements<br/>- 210 different layouts will train your mind<br/>- Detailed Game statistics<br/>- Find pairs, mix and undo function<br/>- Free stones view and perspective switch<br/>- Playfield zoom<br/>- Awesome Chinese songs<br/>- iPad and iPhone support<br/>- Mahjong Shanghai<br/>- Days of fun<br/>- Manga Sushi style!<br/>- Meet Akemi and the Sushi girls.<br/><br/>* Free of Facebook<br/>* Free of Advertising<br/>* Free of In-application-billing<br/><br/>HISTORY:<br/>One of the myths of the origin of Mahjong suggests that Confucius,the Chinese philosopher, developed the game in about 500 BC.<br/>The three dragon tiles also agree with the three cardinal virtues bequeathed by Confucius.<br/>The myth also claims that Confucius was fond of birds, which would explain the name Mahjong (maque = sparrow).", "metacritic": null, "released": "2014-04-20", "tba": false, "updated": "2019-10-22T14:17:49", "background_image": "https://media.rawg.io/media/screenshots/007/007b95b3ce1549a625e5581bf1f6e4e4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 147, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Laxity Media UG (haftungsbeschraenkt) & Co.KG"], "genres": ["Board Games", "Puzzle"], "publishers": ["Laxity Media UG (haftungsbeschraenkt) & Co.KG"], "esrb_rating": "Everyone 10+"}