{"id": 235615, "slug": "modern-army-city-strike-2k18", "name": "Modern army City Strike 2k18", "name_original": "Modern army City Strike 2k18", "description": "Modern army City Strike 2k18 war game is the full of action military games of best army strike war zone. In this army man Modern army City Strike soldier game, you will get the lot of opportunities for shooting and killing the terrorists. In this soldier, games is unlimited Soldier shooting fighting and frontline shooting and best in Army-shooting fight. Army soldier shooting City modern Strike Operation game you are going to experience real army shooting games adventure and real life army man fighting challenges. Army city modern strike is a combination of all new best war games, shooting games and modern weapons with many interesting levels. Now it is a time to show your best army shooter ability for your country by fighting against attack and other terrorist in free soldier games. Your elite sniper shooting is ready, your sniper take a charge as super hero, and get ready for real city modern game to protect your motherland. You are fully trained elite army man of special weapons and plan of action teams.<br/><br/>Modern army City Strike city strike shooting Game best war games, contract killer game. Army city strike for you to Play and feel yourself like a best army mission war games for free combat games. The best stunning looking 3D shooting game. Modern army City Strike shooting idea action delight you have been expecting is here. Join the Army city strikes war mission and shoot to hit. Your gun is ready now, upgrade, and adjust your heavy guns as an expert city military executive sniper shooter. Set up the catch and prepare to execute the assailants. In Modern Army city strike, you will use your all commando skills in this city airstrike against the enemies. Use your commando arms and sniper skills wisely and shoot all the city enemies at a distance before they get a chance to end at you. Enjoy this game army city air strikes, joins the best war game, and free soldier games.<br/>Features:<br/>\t•\tHigh Quality 3D graphics and best environment<br/>\t•\tBest Quality city attractive sound effects<br/>\t•\tModern weapons and control smooth movements<br/>\t•\tModern Radar vision to locate the enemies position<br/>\t•\tUse self-generated and easy controls<br/>\t•\tEasy tap to shoot and kill all the enemies<br/>\t•\tAutomatic reloaded guns with excellent magic sound<br/>\t•\tImprove your commando sniper shooting skills<br/>\t•\tBest 3D animation and action base<br/><br/>Army soldier’s city strike is army action strikes game and shooting games and it is one of the easy to play shooting game. This is best army soldier free action game mixture of army man shooting games and army mission games.", "metacritic": null, "released": "2017-10-28", "tba": false, "updated": "2019-10-22T14:17:48", "background_image": "https://media.rawg.io/media/screenshots/19f/19f8d4a65e6044b6405d0869fce045ce_3KkNg6l.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 126, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Khurram Shahzad Khan Studio"], "genres": ["Action", "Adventure"], "publishers": ["Khurram Shahzad Khan Studio"], "esrb_rating": "Mature"}