{"id": 235604, "slug": "jungle-wild-horse-racing", "name": "Jungle Wild Horse Racing", "name_original": "Jungle Wild Horse Racing", "description": "Jungle Wild Horse Racing is actually an adventure of horse riding game. How will you survive in a wild animal jungle! There is many obstacles but don’t afraid, If you have a little skill of horse racing and then you will beat him and you will get his target. Your task is to race and ride as long as you can. If you hit any obstacle or barrier you will lose the game. Get coins to increase your score multiplier. <br/>Jungle Wild Horse Racing will let you how good you are in Horse Riding. Mountain roads should get out as soon as the end point. Thirst, road barriers cannot beat you. At you will pass by all obstacles to good use. And you have to avoid jungle animals and reach the beating point. Jungle Wild Horse Racing has very fabulous gameplay and smooth controls with HD graphics, 3D scary sound system. Take the advantage here to become the rider hero. Get Coins and become a Champion for horse riding and racing competition.<br/><br/>Jungle Wild Horse Racing Simulation is the most realistic 3D horse racing game on smartphones. Live the dream of owning and looking after a realistic horse. It's easy, exciting, fun, and highly addictive adventure game. Challenge yourself and see how much you can win! Jungle Wild Horse Racing Simulation is one of the best 3D horses racing game with horse derby games fun for everyone. Enjoy the ultimate stunning ride of a realistic horse racing simulator and share the experience with your friends. Ride Free with no worries, Ride like a King. Jungle Wild Horse Racing Simulation looks amazing. <br/>Features:<br/>• Gorgeous Multiple sections.<br/>• Realistic environment models.<br/>• Amazing 3D graphics and virtual 3D sound system.<br/>• User-friendly game controls.<br/>• Realistic sound effects.", "metacritic": null, "released": "2017-12-25", "tba": false, "updated": "2019-10-22T14:17:47", "background_image": "https://media.rawg.io/media/screenshots/08d/08d0427ee37666b2128255b2a0b15687.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 178, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Khurram Shahzad Khan Studio"], "genres": ["Sports"], "publishers": ["Khurram Shahzad Khan Studio"], "esrb_rating": "Everyone 10+"}