{"id": 235637, "slug": "bank-robbery-police-crime-pro", "name": "Bank Robbery Police Crime Pro", "name_original": "Bank Robbery Police Crime Pro", "description": "Bank Robbery Police Crime Pro racing game the master plan of bank robbery simulation is soon to be execute by the mafia robber shooting, gangsters, and robber bank. War in Bank Rivals is going to be the grand crime parking police car by master mind gangsters boss ever done city criminal robbery brothers in bank are chase by Police Racing Bike &amp; Motorcycle Police Bike . Criminal bank robber car in mission of gangsters is to loot the bank and escape from Police Car. With this master cops robbery plan, police criminals thief cars they want to own the city but there is very less chance of doing so. Robber bank mad city thief not just robbery, there is fight, shooting and killing simulation. Robbery Escape Bank Break you need to have perfect shooting and crime fighting skills for this robbery mission. With This mission, Thief Escaped from bank Plan can test as a mafia and fighting skills against cops police officer. Police car mission is to stop this bank crime robbery and auto bank escapes hunter mission.  Bank Robbery Police Crime Pro at any cost prison sniper. Just get yourself Cops follow with ready  police chase thief secret mafia robber, get on mark, and show the criminals what you have.<br/>In Bank Robbery Police Crime Pro game, Gangster and shooting game against chasing for planned crimes. Get alert by the signs you get against the mafia gangsters. In this game enter in the war of City Street against the gangsters and kill every enemy who is in the way of peace.<br/>Features:<br/>•\t3D Graphics and Amazing Sounds<br/>•\tClever Enemies to Target<br/>•\tDifferent Thrilling Shooting missions<br/>•\tEasy to understand challenging to play<br/>• It’s a paid game and available on app store", "metacritic": null, "released": "2018-01-10", "tba": false, "updated": "2019-10-22T14:17:49", "background_image": "https://media.rawg.io/media/screenshots/da2/da28cd129e6f9a5d05705900dc90bcf4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 77, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Khurram Shahzad Khan Studio"], "genres": ["Simulation"], "publishers": ["Khurram Shahzad Khan Studio"], "esrb_rating": "Everyone 10+"}