{"id": 235651, "slug": "farm-infected-chicken-shooter", "name": "Farm Infected Chicken Shooter", "name_original": "Farm Infected Chicken Shooter", "description": "Infected Chicken hunting shoot is latest chicken hunting game for you to enjoy the modern shooting action with the theme of infected chicken. Shooting Game and Gun like best war game. Chicken shooting game with 3D environment. You can enjoy and play this interesting game.<br/><br/>Infected Chicken hunting shoot you being a sharp shooter assigned a duty to save the area from dangerous chicks, which infected from dangerous virus, which was in their food. The virus will cause chicken to get fat and then blast. After their destruction, the virus will mix in the environment and will cause the people infected. You have to find all the infected chicken and shoot them before they get fat and blast. Be a brave army sniper gunman, find the infected chicken, take the aim, pull the trigger, shoot chicken before the chicken gets fat and start running, and get blast. The chickens after getting fat also try to run to save their life but be a great hunter and sharp shooter and kill them all with your army sniper guns.<br/><br/>Infected Chicken Shooter is all about shooting the infected chicken before the virus inside there gets at it severe state and make chicken to blast. If you don’t kill the chicken than there might be a risk that people will use them for their food and if they will use it than virus will be converted into human beings which will become more dangerous and severe.<br/><br/>Features:<br/>• 3D environment<br/>• Smooth control <br/>• thrilling fighting<br/>• Real environmental effects<br/>• Exciting shooting mission<br/>• powerful and advanced weapons<br/>• Shocked music and sound effects", "metacritic": null, "released": "2017-12-01", "tba": false, "updated": "2019-10-22T14:17:50", "background_image": "https://media.rawg.io/media/screenshots/da2/da2d79cce4717fe3a3bdc1f51706cee4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 133, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Khurram Shahzad Khan Studio"], "genres": ["Action"], "publishers": ["Khurram Shahzad Khan Studio"], "esrb_rating": "Mature"}