{"id": 235627, "slug": "ultimate-tank-combat-shooting", "name": "Ultimate Tank Combat Shooting", "name_original": "Ultimate Tank Combat Shooting", "description": "Ultimate Tank Combat Shooting and tanks fighting games are you ready for the battle in this army tanks battle war. Get ready to fight tank-shooting attack and save your country in this ultimate tank war game, shooting incredible gunners and shooting army king. Ultimate tank combat shooting game choose your tanks and super hero game and start the fight against the enemy and war tanks. Action tank game, action launcher warplanes targeting game you have to save motherland and destroy all the tank of your enemy with tank.<br/>Ultimate Tank Combat Shooting battle war tanks get ready to fight the deadliest tank battle in ultimate Tank Combat Shooting game, launcher missiles action battle tanks. The heavy army forces, tank games have invaded your city. Destroy the enemies are in the ferocious tanks that are loaded with explosive furious weapons and war tanks.<br/><br/>Features:<br/>• Many mission for tank battle.<br/>• Modern 3D graphics<br/>• Various battle missions<br/>• Smooth controls<br/>• Fun, and addictive gameplay<br/>• Shooting sounds<br/><br/>In Ultimate Tank Combat Shooting Action, super tank war game do not let the enemy attack to destroy. Army Tank battle different kind of 3D war machines to shoot directly to the foe. Recon shooting clear enemy tank mission. Destroy their all tanker trucks and save your City.", "metacritic": null, "released": "2017-11-24", "tba": false, "updated": "2019-10-22T14:17:49", "background_image": "https://media.rawg.io/media/screenshots/0a5/0a5ae962719f44f3ed5300796f34d338_uD6daYn.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 106, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Khurram Shahzad Khan Studio"], "genres": ["Action"], "publishers": ["Khurram Shahzad Khan Studio"], "esrb_rating": "Mature"}