{"id": 235648, "slug": "extreme-shooting-3d-adventure", "name": "Extreme Shooting 3D Adventure", "name_original": "Extreme Shooting 3D Adventure", "description": "Are you ready for most exciting army game the Extreme shooting 3D adventure? You love to play this army shooting game. Let us start the adventure it is lead the charge for a dangerous mission your enemy’s attacks on a village, the public of village waiting for army help. Get ready your shooter and commandos to save the villagers. It is a deadly mission because terrorists are very dangerous they have lot of bombs, guns, sniper shooter for shooting the public. Soldier need to be very careful to move. Carry many bullets with your military. A Rader system helping your officer for locate the enemy’s movement so you will be ready for shoot. The terrorists kill many innocents. Your mission is attack the terrorists and shoot them.<br/>By playing a game you will become army-trained commando, you are a best commando shooter who is extremely well- trained in hard shooting so show your best action skills in this extreme shooting adventure game. Forget about other boring army soldier training games. No Mercy In field of battle! Show them how powerful your bullet force is. You also have to save your army fellows and be a hero.  The best Modern Army Fighter Shooting Game is here. Shot and kill each enemy. Enjoy and have extreme free fun of your dead badly targets. Expert Sniper Death War Game, Make your army forces feel proud of you. You are the special forces of your country. You will enjoy while playing this awesome shooting game. The commando action game you will ever sniper fury experience. You have more than six guns here in this shooting game. Keep your survival on this shooting game. Evil is the rise of demon. Finish it. Show them the power of your guns. You are a real super commando here; you will be the superhero of your country after killing all the enemies.<br/>Play this game as the best well-trained and Frontline Commando. You have Free Gun Strike and nuclear bomber squad. The soldier sniper rifles, machine gunner, air attack gun, portal gun, dagger, grenade launcher and silencer gun and other deadly shooting weapons as you are the mighty terminator genesis human commander. You will have to navigate secret sniper missions to eliminate terrorists. This is strategy world warfare to stop the universe of injustice.<br/>Features:<br/>\t•\tEasy Controls and addictive game play<br/>\t•\tCustomize your war weapons<br/>\t•\tEasy and smooth controls.<br/>\t•\tThrilling HD graphics with affective sounds<br/>\t•\tBeautiful realistic 3D Battlefield environment<br/>\t•\tEfficient weapon controls and smooth movements<br/>\t•\tMultiple Fast army action hard and easy missions<br/>\t•\tMultiple enemy targets<br/>\t•\tThe best army action sequences<br/>\t•\tA radar to indicate nearby targets<br/>\t•\tJoystick to control direction<br/>\t•\tRealistic &amp; detailed warzone strikes<br/>\t•\tFast and intense killing action<br/>\t•\tComplete missions to earn rewards &amp; cash<br/>Extreme Shooting 3D Adventure delivers breathless intensity &amp; warfare challenges in 3D. Install this to begin the military shooting adventure. If you like this game share with your friends and family for adventure. Have Fun!", "metacritic": null, "released": "2017-10-15", "tba": false, "updated": "2019-10-22T14:17:50", "background_image": "https://media.rawg.io/media/screenshots/b0a/b0aeefbb4deb7aa0b96921b4e64c135c_OnEFjcg.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 141, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Khurram Shahzad Khan Studio"], "genres": ["Action", "Adventure"], "publishers": ["Khurram Shahzad Khan Studio"], "esrb_rating": "Mature"}