{"id": 235654, "slug": "santa-claus-jumping-runner", "name": "Santa Claus Jumping Runner", "name_original": "Santa Claus Jumping Runner", "description": "Santa Clouse Jumping Runner slide and jump your way across Christmas special. Best gift Dash upward as fast as you can, jumping Santa double jump dodge obstacles and gift game collect points in Santa Clause Jumping Runner. Santa jumping Run and jump as fast as you can on the snowy of Santa Village. Avoid all obstacles as you dash through the levels. Christmas time is finally here. Santa clause, what are you going to do for the holidays? Here we have the application that will make your vacation even more joyful. Santa jump Special bounce this is very simple tilt control based game. In Santa Clouse Jumping Runner game Missions is very clear and enjoying. Jumping Santa Gift game there are enemies try to stop Santa; you have to help him out of this. Santa jump this game will not let you down in your boring times. Jumping Santa Start collecting more and more points and show your friends.<br/>Santa Clause Jumping Runner and Christmas is few days away, and help our Santa to jump and collect all the points. Hurry-up and collect as many points as possible from the snowy paths of Santa’s village as quickly as possible. <br/><br/>Features:<br/><br/>• Colourful &amp; smooth graphics<br/>• Easy one-touch controls and gameplay<br/>• Rich background music and sound effects<br/>• Intense and exciting game<br/>• Face the unknown dangerous and fear<br/>• Run across the snow<br/>• Avoid obstacles and collect points", "metacritic": null, "released": "2017-12-08", "tba": false, "updated": "2019-10-22T14:17:50", "background_image": "https://media.rawg.io/media/screenshots/ffc/ffccab4203a6fd914d0e94704ee7992e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 42, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Khurram Shahzad Khan Studio"], "genres": ["Adventure"], "publishers": ["Khurram Shahzad Khan Studio"], "esrb_rating": "Teen"}