{"id": 235636, "slug": "caribbean-pirates-puzzle", "name": "Caribbean Pirates Puzzle", "name_original": "Caribbean Pirates Puzzle", "description": "Somewhere in the Caribbean sea at 2nd July 1816...<br/>In a dark and stormy night Captain Sparrow the most overrated pirate in the Caribbean and his mob of bloodthirsty pirates pounded the frigate Meduse.<br/>Finally after a long and hard fight, they boarded the Ship. Just very few of the crew survived the strike.<br/>But on board there were no wealth at all. Just a little treasure-map was found in one of the passengers possession.<br/>Unfortunately he was overhasty killed by the big fat and stupid pirate Blood-Svente before somebody could find out any details about the map.<br/><br/>Ultimately the frigate with the rest of the surviving crew was deadlocked at the Arguin-Sandbank and set on fire.<br/>Captain Sparrow's ship the Black Earl and the mob of pirates sailed the Caribbean sea and followed the maps coordinates.<br/>The island on the map looked very strange. It was nearly a round island in such a perfection nobody of the pirates had every seen before.<br/>Just before they run out of water and just in time before the steersman wanted to start a mutiny, there was suddenly land in sight.<br/>It was really the island which was marked in the map.<br/><br/>The pirates found a lot of chest treasure on the island and additional a young pirate girl which was probably left back here for some reason.<br/>They captured her with the plan to get a good price on the slave-market.<br/>But when they opened some of the treasure chests the cursed ghost pirate Darby McGraw appeared and took over the ship.<br/>Also his evil kraken Chleomorpha surfaced in front of the ship and entangled the ship with his giant tentacles trying to pull it into the deep.<br/><br/>Fortunately Captain Sparrow could make a deal with Darby McGraw just offering him a lot of Rum.<br/>If Sparrow can defeat Darby McGraw at a Poker game, her would get his Crew, the Treasure and the Ship, and also his senseless live back.<br/>But if he would fail then his fate would be to swelter on the little Island without any smokeless tobacco.<br/>Also he should suffer the most awful torments of Tantalus.<br/><br/>Puzzle game of the scary ghost story about Captain Sparrow and the the cursed ghost of Darby McGraw.<br/>What are you waiting for ? The rum gets too warm, and the smokeless tobacco is low !<br/>Good luck and have fun!<br/><br/>FEATURES:<br/>- Awesome Pirates Story<br/>- 16 pictures tell the story of Sparrow and Darby McGraw.<br/>- guaranteed free of Facebook or Twitter<br/>- guaranteed free of in-game advertising", "metacritic": null, "released": "2017-05-31", "tba": false, "updated": "2019-10-22T14:17:49", "background_image": "https://media.rawg.io/media/screenshots/ec3/ec30a3ce89c8dedcc63ed4bbf82995a5.jpg", "website": "http://www.laxity.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 196, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Laxity Media UG (haftungsbeschraenkt) & Co.KG"], "genres": ["Adventure", "Puzzle"], "publishers": ["Laxity Media UG (haftungsbeschraenkt) & Co.KG"], "esrb_rating": "Everyone 10+"}