{"id": 235610, "slug": "zdk-zombie-death-kill-free", "name": "ZDK Zombie Death Kill FREE", "name_original": "ZDK Zombie Death Kill FREE", "description": "Zombie Apocalypse Alarm! Pick up your gun and survive!<br/><br/>What a bad day.<br/>Being late in school, dog eat your homework, and now this Zombie-Apocalypse just started while you entered your school.<br/>Everybody is attacking you and it seems you will be also more than DEAD very soon.<br/>Seems you will become \tfairly ... UN-DEAD !<br/><br/>Just what a luck your first walk was to the Nurse room and you found that pump gun in her room.<br/>Why did she had a loaded gun there ? No time to think about it.<br/>You have to fight your way through the hordes of Zombies, coming for you.<br/><br/>But seems the whole town already became infected and transformed into Zombies.<br/>Fortunately the US-Army had a long-time rescue plan for the end of all days.<br/>Scientists created an escape portal from earth which will beam you to a save place.<br/><br/>Just fight your way to the Tannhauser Gate and don't let that Zombies bite you while reloading your pump-gun.<br/>Unfortunately the Gate is on a far distant island in the caribean sea.<br/><br/>Well, what should I say ? I'm pretty sure you will make it.<br/>Good Luck!<br/><br/>Features:<br/>- 70 Levels to be survived<br/>- Big bunch of different Zombie enemies<br/>- Best bloody splatter game ever<br/>- Gamecenter support to compete with your friends and fiends<br/>- Easy to lern shoot em up<br/>- The ultimate zombie ego shooter action adventure game<br/><br/>WARNING:<br/>Don't play with the lights off !!!", "metacritic": null, "released": "2015-06-23", "tba": false, "updated": "2019-10-22T14:17:48", "background_image": "https://media.rawg.io/media/screenshots/787/78777043f202d621f69eca3c85e3c4ed.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 191, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Laxity Media UG (haftungsbeschraenkt) & Co.KG"], "genres": ["Action", "Adventure"], "publishers": ["Laxity Media UG (haftungsbeschraenkt) & Co.KG"], "esrb_rating": "Teen"}