{"id": 235723, "slug": "hidden-objects-christmas-magic-celebration-time", "name": "Hidden Objects Christmas Magic Celebration Time", "name_original": "Hidden Objects Christmas Magic Celebration Time", "description": "Hidden Objects – Christmas Holiday Magic is a beautifully designed search and finder game with over 30 Winter Holiday levels. <br/><br/>Explore Christmas and Winter scenes by visiting New York City covered in snow, Christmas Tree Farms, Vegas Winter Wonderland, Shopping Malls, Florida’s Sunny Winter Sand Xmas Tree, Santa’s Workshop, European Cities decked in cheer, festive Neighborhoods with decorated Porches, London, Elf, Reindeer &amp; Stockings, Snow Covered Gingerbread Houses, Santa’s Sleigh and more! <br/><br/>Find festive Christmas and Winter themed objects like Santa Claus, Rudolph, Snowmen, Reindeer, Christmas Lights, Stockings, Holly, Wreaths, snow covered Christmas Trees, Elves, Candy, Gingerbread Cookies, Ornaments, Dreidels, Presents, frozen Icicles, Snow Globes and more!<br/><br/>Levels vary from easy to difficult. A fun, object quest challenge for Hidden Object, Puzzle, Spot the Difference, Brain &amp; Word fans!<br/><br/>Brain Challenging Adventure through Winter season is sure to get you in the festive X-mas spirit!    <br/><br/>Hidden Objects – Christmas Holiday Magic features:<br/>Gorgeous, Crisp Graphics reflecting Christmas and frozen Winter themes<br/>3 Game Modes- Traditional, Chill, Adventure<br/>Exciting Levels/Scenes of Hidden Object Puzzles<br/>Artistically Crafted Levels<br/>Zoom to Find Objects<br/>Find Objects by Picture, Word, or Collector<br/>Challenge Scenes with Missing Letters, Scrambled Words and Bonus Objects<br/>Timed Challenges and Hints<br/><br/><br/>Game Modes instructions:<br/>TRADITIONAL-<br/>Time limits<br/>Hint limits<br/>Picture, Word, Collector<br/>8 Scenes (3 levels per scene)<br/><br/>CHILL-<br/>Time unlimited<br/>Hints unlimited<br/>Picture, Word, Collector<br/>8 Scenes (3 levels per scene)<br/><br/>ADVENTURE-<br/>Time limits<br/>Hint limits<br/>Bonus Bonanza (words highlighted in green)<br/>Missing Letters, Scrambled Words, Word Finder<br/>15 Unique Levels", "metacritic": null, "released": "2015-11-08", "tba": false, "updated": "2019-08-05T08:32:08", "background_image": "https://media.rawg.io/media/screenshots/e89/e8957c417dacf622af13e588ee520986.jpg", "website": "http://www.detentionapps.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 205, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Detention Apps"], "genres": ["RPG", "Strategy"], "publishers": ["Detention Apps"], "esrb_rating": "Everyone 10+"}