{"id": 235714, "slug": "deer-hunting-2017", "name": "Deer Hunting 2017", "name_original": "Deer Hunting 2017", "description": "Deer Hunting 2017 is free to play, Sniper Shooting, 3D game for lovers of Animals hunting. Hunt across the globe in the world's greatest hunting experience.<br/><br/>Hunting in Amazing First Person Shooting (PFS) Game<br/>For the deer hunters, It is one of the best First Person Shooting (PFS) and deer hunting simulator. Now Enjoy the Bear Hunt as well. Hunt animals so real they nearly jump off the screen! Track down and bag the world's most exotic and elusive game.<br/><br/>Hunt Around the World <br/>Except Deer of beautiful African forests, Now enjoy hunt of bear in cold environment of Alaska. Pursue rewards in unique and beautiful locations that span the globe from Alaska to Zimbabwe.<br/><br/>Stay Steady and Shoot like a Pro<br/>Develop your skills to stay steady hand, shot from line of sight and master the skills to take best shot. Shot the animals before they hunt you.<br/><br/>Big Guns to Hunt for <br/>Explore the forest and North Pole to hunt the animals with the best shooting weapons and big guns. Let's go hunting in the real jungle wilderness environment. Do you trust your sniper shooting skills? Let's show how to hunt.<br/><br/>Collect Rewards<br/>Compete for bragging rights and bag the biggest animals with achievements and Rewards!<br/><br/>Build Your Arsenal<br/>Collect and customize your firearms with scopes, magazines, barrels, and stocks as you perfect your weapons for each hunt.<br/><br/>Features:<br/><br/>- amazing First Person Shooting and Sniper Shooting experience<br/>- High quality graphics<br/>- 3D realistic jungle environment<br/>- Powerful shooting weapons<br/>- Camera zoom to get accurate shots<br/>- Mission based Tasks<br/>- Enjoy endless customization as you perfect your weapons.<br/>- More species more fun<br/><br/>Let's return to the wild. Hunt around the world. Shoot Like a real Hunter. Hunt them before they get you!", "metacritic": null, "released": "2017-03-18", "tba": false, "updated": "2019-10-22T14:17:54", "background_image": "https://media.rawg.io/media/screenshots/5b3/5b3d5ff08ee130d9924c72885b657770.jpg", "website": "http://www.centsol.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 159, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["CENTSOL"], "genres": ["Action", "Adventure"], "publishers": ["CENTSOL"], "esrb_rating": "Mature"}