{"id": 235717, "slug": "central-park-new-york-hidden-object-puzzle-games", "name": "Central Park New York Hidden Object Puzzle Games", "name_original": "Central Park New York Hidden Object Puzzle Games", "description": "Hidden Objects – Central Park New York is a beautifully designed Seek &amp; Find game with 30+ levels! 100’s of Objects to Find!<br/><br/>Explore New York City’s Central Park finding famous Fountains, ornate Bridges, Statues, gorgeous Gardens and more searching for Hidden Objects! See all the Seasons in Central Park - Winter, Spring, Summer &amp; Fall! <br/><br/>Discover the excitement of this World Famous Urban City’s Park without leaving your home. Find New York City themed objects like yellow cabs, NYC sports figures, pizza and more. <br/><br/>Levels vary from easy to difficult. A fun, object quest challenge for Hidden Object, Puzzle, Seek &amp; Find, Spot the Difference, Brain &amp; Word fans!<br/><br/>This Brain Challenging Adventure is sure to entertain! <br/><br/>Hidden Objects – Central Park New York features:<br/>Gorgeous, Crisp Graphics of NYC<br/>3 Game Modes- Traditional, Chill, Adventure<br/>Exciting Levels/Scenes of Hidden Object Puzzles<br/>Artistically Crafted Levels<br/>Zoom to Find Objects<br/>Find Objects by Picture, Word, or Collector<br/>Challenge Scenes with Missing Letters, Scrambled Words and Bonus Objects<br/>Timed Challenges and Hints<br/><br/>Game Modes instructions:<br/>TRADITIONAL-<br/>Time limits<br/>Hint limits<br/>Picture, Word, Collector<br/>8 Scenes (3 levels per scene)<br/><br/>CHILL-<br/>Time unlimited<br/>Hints unlimited<br/>Picture, Word, Collector<br/>8 Scenes (3 levels per scene)<br/><br/>ADVENTURE-<br/>Time limits<br/>Hint limits<br/>Bonus Bonanza (words highlighted in green)<br/>Missing Letters, Scrambled Words, Word Finder<br/>15 Unique Levels", "metacritic": null, "released": "2016-10-11", "tba": false, "updated": "2019-10-22T14:17:54", "background_image": "https://media.rawg.io/media/screenshots/dee/dee55f33bf9d388f5aa44644c34384d9.jpg", "website": "http://www.detentionapps.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 228, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Detention Apps"], "genres": ["RPG", "Puzzle"], "publishers": ["Detention Apps"], "esrb_rating": "Everyone 10+"}