{"id": 235758, "slug": "hidden-objects-secret-garden-passages-object-time", "name": "Hidden Objects Secret Garden Passages Object Time", "name_original": "Hidden Objects Secret Garden Passages Object Time", "description": "Hidden Objects – Secret Garden is a magnificently designed search and finder game with 30+ majestic Garden levels. <br/><br/>Gardens Around the World! Search through Rose Gardens, Japanese Gardens, Las Vegas Bellagio’s Botanical Gardens, English Gardens and more! <br/><br/>Find Secret Garden themed objects like Statues, Antique Trinkets, Roses, Hearts and more!<br/><br/>Levels vary from easy to difficult. A fun, object quest challenge for Hidden Object, Puzzle, Spot the Difference, Brain &amp; Word fans!<br/><br/>This Brain Challenging Adventure is sure to entertain! “Detention Apps makes the Best Seek &amp; Find Games!”   <br/><br/>Hidden Objects – Secret Garden features:<br/>Gorgeous, Crisp Graphics reflecting beautiful Garden themes<br/>3 Game Modes- Traditional, Chill, Adventure<br/>Exciting Levels/Scenes of Hidden Object Puzzles<br/>Artistically Crafted Levels<br/>Zoom to Find Objects<br/>Find Objects by Picture, Word, or Collector<br/>Challenge Scenes with Missing Letters, Scrambled Words and Bonus Objects<br/>Timed Challenges and Hints<br/>Drag Scene to Search<br/><br/><br/>Game Modes instructions:<br/>TRADITIONAL-<br/>Time limits<br/>Hint limits<br/>Picture, Word, Collector<br/>8 Scenes (3 levels per scene)<br/><br/>CHILL-<br/>Time unlimited<br/>Hints unlimited<br/>Picture, Word, Collector<br/>8 Scenes (3 levels per scene)<br/><br/>ADVENTURE-<br/>Time limits<br/>Hint limits<br/>Bonus Bonanza (words highlighted in green)<br/>Missing Letters, Scrambled Words, Word Finder<br/>15 Unique Levels", "metacritic": null, "released": "2016-01-26", "tba": false, "updated": "2019-08-05T08:35:41", "background_image": "https://media.rawg.io/media/screenshots/d05/d050d5db4db202ece5c5b89470c8e299_yFm1PL6.jpg", "website": "http://www.detentionapps.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 178, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Detention Apps"], "genres": ["Strategy", "Puzzle"], "publishers": ["Detention Apps"], "esrb_rating": "Everyone 10+"}