{"id": 235759, "slug": "hidden-objects-thanksgiving-fall-harvest-puzzle", "name": "Hidden Objects Thanksgiving Fall Harvest Puzzle", "name_original": "Hidden Objects Thanksgiving Fall Harvest Puzzle", "description": "Hidden Objects – Thanksgiving Harvest is an artistically crafted Seek &amp; Find game with 30+ gorgeous Autumn Season levels. 100’s of Objects to Find!<br/><br/>Explore Fall’s magic by seeing Autumn Foliage, Thanksgiving Harvests, Pumpkin Patches, Forests and Creeks, Apple Orchards, Scenic Autumn Lakes, Rustic Barns, Cornfields, Halloween and more! Give THANKS!<br/><br/>Find festive Autumn themed objects like Turkeys, Pumpkins, Acorns, yellow, green and orange Autumn Leaves, Candy Corn, Scarecrows, Ghosts, Halloween decorations, Indian Corn, Gourds, Hayrides, Pumpkin Patches and more!<br/><br/>Levels vary from easy to difficult. A fun, object quest challenge for Hidden Object, Puzzle, Spot the Difference, Brain &amp; Word fans!<br/><br/>This Brain Challenging Adventure through Fall season is sure to entertain!    <br/><br/>Hidden Objects – Thanksgiving Harvest features:<br/>Gorgeous, Crisp Fall &amp; Autumn Graphics<br/>3 Game Modes- Traditional, Chill, Adventure<br/>Exciting Levels/Scenes of Hidden Object Puzzles<br/>Artistically Crafted Levels<br/>Zoom to Find Objects<br/>Find Objects by Picture, Word, or Collector<br/>Challenge Scenes with Missing Letters, Scrambled Words and Bonus Objects<br/>Timed Challenges and Hints<br/>Drag Scene to Search <br/><br/><br/>Game Modes instructions:<br/>TRADITIONAL-<br/>Time limits<br/>Hint limits<br/>Picture, Word, Collector<br/>8 Scenes (3 levels per scene)<br/><br/>CHILL-<br/>Time unlimited<br/>Hints unlimited<br/>Picture, Word, Collector<br/>8 Scenes (3 levels per scene)<br/><br/>ADVENTURE-<br/>Time limits<br/>Hint limits<br/>Bonus Bonanza (words highlighted in green)<br/>Missing Letters, Scrambled Words, Word Finder<br/>15 Unique Levels", "metacritic": null, "released": "2016-10-15", "tba": false, "updated": "2019-08-05T08:35:12", "background_image": "https://media.rawg.io/media/screenshots/b57/b57cf8d21053929d5cb9ada2c75eb1a3.jpg", "website": "http://www.detentionapps.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 168, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Detention Apps"], "genres": ["RPG", "Puzzle"], "publishers": ["Detention Apps"], "esrb_rating": "Everyone 10+"}