{"id": 235752, "slug": "hidden-objects-new-york-city-winter-object-time", "name": "Hidden Objects New York City Winter Object Time", "name_original": "Hidden Objects New York City Winter Object Time", "description": "Explore New York City in Winter touring Manhattan, icy Hudson River, Brooklyn Bridge, Wall Street, Central Park, Times Square, Upper Eastside, 5th Avenue &amp; more finding Hidden Objects! <br/><br/>Hidden Objects – New York City Winter is an artistically crafted Seek &amp; Find game with 30+ levels! 100’s of Objects to Find!<br/><br/>Discover the excitement of this World Famous City without leaving your home. Find New York City themed objects like yellow cabs, snow covered cars, NYC sports memorabilia, Statue of Liberty, pizza and more. <br/><br/>Levels vary from easy to difficult. A fun, object quest challenge for Hidden Object, Puzzle, Seek &amp; Find, Spot the Difference, Brain &amp; Word fans!<br/><br/>This Brain Challenging Adventure is sure to entertain your Empire State of mind!<br/><br/>Hidden Objects – New York Winter features:<br/>Gorgeous, Crisp Graphics of the BIG Apple<br/>3 Game Modes- Traditional, Chill, Adventure<br/>Exciting Levels/Scenes of Hidden Object Puzzles<br/>Artistically Crafted Levels<br/>Zoom to Find Objects<br/>Find Objects by Picture, Word, or Collector<br/>Challenge Scenes with Missing Letters, Scrambled Words and Bonus Objects<br/>Timed Challenges and Hints<br/><br/>Game Modes instructions:<br/>TRADITIONAL-<br/>Time limits<br/>Hint limits<br/>Picture, Word, Collector<br/>8 Scenes (3 levels per scene)<br/><br/>CHILL-<br/>Time unlimited<br/>Hints unlimited<br/>Picture, Word, Collector<br/>8 Scenes (3 levels per scene)<br/><br/>ADVENTURE-<br/>Time limits<br/>Hint limits<br/>Bonus Bonanza (words highlighted in green)<br/>Missing Letters, Scrambled Words, Word Finder<br/>15 Unique Levels", "metacritic": null, "released": "2016-12-12", "tba": false, "updated": "2019-08-05T08:32:18", "background_image": "https://media.rawg.io/media/screenshots/4db/4dbb4d93e3da2cc1fafd465f48d5fb2f.jpg", "website": "http://www.detentionapps.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 224, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Detention Apps"], "genres": ["RPG", "Puzzle"], "publishers": ["Detention Apps"], "esrb_rating": "Everyone 10+"}