{"id": 235771, "slug": "tanks-seek-destroy", "name": "Tanks! - Seek & Destroy", "name_original": "Tanks! - Seek & Destroy", "description": "*** Pocket Gamer Rating: 9 of 10: \"Should be a lesson to every company considering rethinking classic game ideas.\" ***<br/><br/>Tanks! - Seek &amp; Destroy is classic arcade action at its best. Seriously, its BEST. Either ramp up your challenge from hunter to hunted (Novice level), or jump right into the frey (INSANE level) for an adrenaline filled, fire-and-forget blast-a-thon that never lets up.<br/><br/>You are the lone survivor on a mission behind enemy lines. You have stolen their super tank prototype, loaded with experimental weapons, and must blast through a rage-fueled battlefield.<br/><br/>The odds are very, VERY against you. Enter your tank and destroy as many of the enemy ordinance as possible without allowing them to destroy you.<br/><br/>Trapped on a battlefield with no way out, your performance will determine the future balance of power.<br/><br/>Tanks! has been written to take full advantage of your iOS device while maintaining that classic arcade feel. The electric responsiveness will make your fingers tingle.<br/><br/>Features: <br/><br/>* Devastating weapons allowing you to plow through hordes of enemies at unbelievable speed.<br/>* High speed action: Playing on INSANE level means no stopping to smell the roses. Intense gameplay that will leave you breathless.<br/>* Rage mode: You're on-the-clock with no reinforcements. Maximize your score before you 'punch out'.<br/>* Arcade inspired vector art style: Ensures your focus is on what’s important - seeing your enemies glow with anticipation of receiving your wrath!<br/>* Game Center support: Challenge your friends, dominate the global leaderboards and publicly brag about your op'edness.<br/>* 3D Audio<br/>* Super responsive controls.<br/>* Right- and left-handedness supported.<br/>* No Ads<br/>* No In-App Purchases", "metacritic": null, "released": "2015-06-11", "tba": false, "updated": "2019-10-22T14:17:54", "background_image": "https://media.rawg.io/media/screenshots/627/6273ab4cd1e17ad348ca206b6926ef4d_dtJAU02.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 124, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Acmee"], "genres": ["Action", "Arcade"], "publishers": ["Acmee"], "esrb_rating": "Everyone 10+"}