{"id": 235898, "slug": "pro-snooker-2018", "name": "Pro Snooker 2018", "name_original": "Pro Snooker 2018", "description": "Following the worldwide success of its sports games iWare Designs brings you Pro Snooker 2018, probably one of the most realistic and playable snooker and pool games available on mobile devices. Boasting fully textured game environments and full 3D rigid body physics this game is the complete package for both casual and serious gamers.<br/><br/>The simple click and play interface allows you to pick up and play the game quickly, or alternatively for the more serious players the game includes cue ball control allowing you to perform more advanced shots including back spin, top spin, left spin (Left english), right spin (Right english) and ball swerve. <br/><br/>So whether you want a simple easy and fun snooker game or a full on simulation this game is for you. <br/><br/>Download Pro Snooker 2018 now and try it for free, you will not be disappointed. <br/><br/>System Requirements: <br/><br/>∙ Compatible with iPhone, iPad and iPod touch. <br/>∙ Supports iOS 8.0 and above. <br/>∙ Utilizes Retina displays on compatible devices. <br/>∙ Game Center compatible. <br/><br/>Game Features: <br/><br/>∙ Localized to English, French, German, Spanish, Italian, Canadian French and Mexican Spanish.<br/>∙ Full High Def 3D textured environments. <br/>∙ Full 3D physics at 30 FPS.<br/>∙ Free online multiplayer games<br/>∙ Free local network multiplayer games<br/>∙ Practice: Fine tune your game by playing on your own with no rules. <br/>∙ Quick Play: Play a custom match against another friend, family member or computer opponent. <br/>∙ League: Participate in a league event over 7 rounds where the highest points total wins. <br/>∙ Tournament: Test your nerves in a 4 round knockout tournament event. <br/>∙ Configure up to 3 player profiles to keep track of all your statistics. <br/>∙ Each profile contains comprehensive statistics and progression history. <br/>∙ Select your handicap level with 5 levels of aiming and ball guide mark-ups. <br/>∙ Select your preferred post shot camera through your player’s profile. <br/>∙ Progress through the ranks from Rookie to Legend. Beware you can go down the ranks as well as up. <br/>∙ Play against 25 different computer opponents spread over 5 difficulty levels. <br/>∙ Fully customizable tables, choose from over 100 combinations of table finish effects and baize colors. <br/>∙ Play snooker on regulation 10ft and 12ft rectangular tables. <br/>∙ Test your skills on the non-regulation Casket, Clover, Hexagonal, L-Shaped and Square tables.<br/>∙ Play 6 Red Ball Snooker, 10 Red Ball Snooker and 15 Red Ball Snooker based on WPBAS rules. <br/>∙ Play US 10 Ball and Black Ball pool based on WPA rules. <br/>∙ Play World Eight Ball Pool based on WEPF rules. <br/>∙ Bonus 8ft snooker table for pool games. <br/>∙ Fully featured ball control system allowing back spin, top spin, left spin (Left english), right spin (Right english) and swerve shots. <br/>∙ Choose from various camera views including 3D, Top Cushion and Overhead views. <br/>∙ 20+ game achievements to collect locally or via Game Center. <br/>∙ Take action photos and share them via Email or save them to your device. <br/>∙ In game tips and help.", "metacritic": null, "released": "2012-09-18", "tba": false, "updated": "2019-10-22T14:18:02", "background_image": "https://media.rawg.io/media/screenshots/fe8/fe83bf015ed08686be85dc561713cf04.jpg", "website": "http://www.iwaredesigns.co.uk/game6.html", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 71, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["iWare Designs"], "genres": ["Sports", "Family"], "publishers": ["iWare Designs"], "esrb_rating": "Everyone 10+"}