{"id": 235993, "slug": "who-just-messaged-me", "name": "Who just messaged me", "name_original": "Who just messaged me", "description": "The game of \"Celebrities\" or \"Who's in the Bag\" bought up-to-date. You have one minute to get your team members to guess which celebrity, historical or fictional character has appeared in your text message window.<br/><br/>Select the number of players in your teams, press the start button, and the first celebrity name will appear in the message window.<br/><br/>The clue giver uses verbal clues to describe the celebrity name on the screen and tries to get their team to guess the name correctly. Once the name is guessed correctly the clue giver presses the \"guess is correct\" button. Ten points will be scored, and the next celebrity name will appear on the screen. The clue giver tries to score as many points as possible before the one-minute timer runs out. If they are having trouble getting their team to guess the celebrity from their clues, the clue giver can press the \"pass\" button. 2 points will be deducted, and the next celebrity name will appear on the screen.<br/><br/>After one minute it's time to pass your phone/pad to the next team to try and do better.<br/><br/>The phone/pad is then passed to the second member of team 1, then the second member of team 2, and so on, until each member of both teams have taken their turn at being the clue giver.<br/><br/>When the last member of team 2 has taken their turn, and the timer runs out, the scores for both teams will be revealed, and the winner will be declared.", "metacritic": null, "released": "2018-08-28", "tba": false, "updated": "2019-10-22T13:55:57", "background_image": "https://media.rawg.io/media/screenshots/904/904a4dfc19b9dec7133d6cf97fddf0e4.jpg", "website": "http://www.terrymillerassociates.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 38, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["John Miller"], "genres": ["RPG", "Family"], "publishers": ["John Miller"], "esrb_rating": null}