{"id": 23594, "slug": "kof98-um-ol", "name": "KOF'98 UM OL", "name_original": "KOF'98 UM OL", "description": "THE CULT FIGHTING GAME IS BACK!<br/><br/>Experience the adrenaline rush of classic KOF fights combined with the exciting &amp; addictive gameplay of collectible card games! Choose from an expansive roster of classic characters straight out of the best SNK games, assemble the ultimate tag team and chain-up your fighters’ special moves in battle to unleash devastating combos onto your challengers.<br/><br/>==Key Features ==<br/><br/>DECK BUILDING<br/>Unlock, recruit and collect fighters from a roster of 70+, including fan-favorite Terry Bogard, Kyo Kusanagi, Iori Yagami, Mai Shiranui and many more. Select up to 6 fighters in your dream team, set them in formation, then get ready for a hell of a fight! <br/><br/>QTE COMBOS<br/>Kusanagi Serpent, Maiden Masher, and Haoh Shoko Ken…unleash your fighters’ incredibly powerful attacks at a tap of your finger. But with KOF98’s unique QTE system, it takes the right timing and skills to chain up the perfect combo and KO your challengers!<br/><br/>RPG PROGRESSION<br/>Train your fighters, upgrade their equipment and level them up to their maximum potential to unlock their most powerful passive and active abilities, and their deadliest attacks.<br/><br/>CAMPAIGN &amp; PVP<br/>Fight your way through the 70+-level campaign that follows the classic storyline of the games, and a multitude of PVE challenge modes. Then take on players from all over the world in a variety of PVP modes and tournaments, to eventually claim the real “King of Fighters” title! <br/><br/>AUTHENTIC KOF EXPERIENCE<br/>All the classic fighters, battle arenas, iconic special moves, sound effects and even the Japanese voices from the original game. A must-play for the fans! <br/><br/>==Official information==<br/>Facebook: https://www.facebook.com/Kof98umol<br/>Official Website: http://98kof-us.game-bean.com/ <br/>Twitter: https://twitter.com/KOF98UMOL_EN <br/><br/><br/>", "metacritic": null, "released": "2017-05-24", "tba": false, "updated": "2019-10-22T14:30:36", "background_image": "https://media.rawg.io/media/screenshots/a82/a82fdef4b65174faab346023170f0754.jpeg", "website": "http://us.98kof.game-bean.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 1, "beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 201, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["FingerTips"], "genres": ["Action", "RPG"], "publishers": ["FingerFun"], "esrb_rating": "Teen"}