{"id": 236182, "slug": "gem-slider", "name": "Gem Slider", "name_original": "Gem Slider", "description": "Test your matching skills in this exciting, ultra addictive gem matching game, featuring multiple fun modes. Use awesome power-ups to help you along, and play through numerous gem packed levels as you try your hardest to master the game.  <br/><br/>FEATURES<br/><br/>* Highly addictive match-3 puzzle game play.<br/>* Three uniquely different and challenging modes; Arcade, Score Panic and Zen<br/>* Beautiful gem types to play with; jewel, diamond, ruby, crystal, emerald and many more.<br/>* Combo chains.<br/>* Plenty of explosive power ups.<br/>* Automatic hint if you get really stuck (can be switched off).<br/>* Separate leader boards for each mode and a combined board to show who's really king or queen!<br/>* Each mode is easy to learn, yet hard to master.<br/>* Progress is saved in every mode - try out the different modes without losing your saves.<br/><br/>ARCADE MODE<br/>Fast paced gem matching fun is on offer in the Arcade mode. Test your skill and reflexes as you race to destroy special gems and complete the level before the timer overpowers you. <br/><br/>SCORE PANIC<br/>Can you reach the target score before your time runs out? The target score is increased after every level making this mode more and more challenging. Just don't panic!<br/><br/>ZEN<br/>Relax and chill in Zen mode, without a timer to harry and panic, you can lay back and focus on an addictive, never ending game of match.", "metacritic": null, "released": "2013-01-24", "tba": false, "updated": "2019-10-22T14:18:11", "background_image": "https://media.rawg.io/media/screenshots/184/184db2e240a079de7b125b838f0dacb9.jpg", "website": "http://meyume.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 36, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Meyume"], "genres": ["Board Games", "Puzzle"], "publishers": ["MEYUME"], "esrb_rating": "Everyone 10+"}