{"id": 23610, "slug": "gray-skies-dark-waters", "name": "Gray Skies, Dark Waters", "name_original": "Gray Skies, Dark Waters", "description": "Gray Skies, Dark Waters drops you into a world of secrets, unanswered questions, and (just maybe) the supernatural. Search to reveal the truth—or, at least, your version of it.<br/><br/>What does it mean to truly disappear without a trace? In this modern interpretation of centuries-old folklore, that’s the question that seventeen-year-old Lina Garrett has to consider after her mother vanishes. Take Lina on a thought-provoking journey through her small Chesapeake Bay town of Avett's Landing to unravel the mystery of her mother’s disappearance and explore what it means to be part of a family - even a troubled one.<br/><br/>Fans of story-based games like The Path, Life is Strange, and To the Moon will love this story-driven adventure game in which your continuous choices decide the future of the Garrett family. Gray Skies, Dark Waters comes alive with:<br/><ul><li>an original score<br/></li><li>full voice-acting<br/></li><li>hand-drawn paintings inspired by children’s book illustrations<br/></li><li>a 2-3 hour playtime<br/></li><li>a series of short stories set in Avett’s Landing, Virginia<br/></li><li>Rich commentary mode that includes interviews with developers and experts in various fields</li></ul>The game features 3D models interacting in 2D settings, similar to classics like Grim Fandango, The Longest Journey, and Resident Evil 2. Gray Skies, Dark Waters takes literary inspiration from the writings of Edgar Allan Poe, Flannery O’Connor, Jorge Luis Borges, and Shirley Jackson.", "metacritic": null, "released": "2017-06-09", "tba": false, "updated": "2019-08-28T22:06:59", "background_image": "https://media.rawg.io/media/screenshots/ab3/ab3366492547846792f678ce10d77b49.jpg", "website": "http://www.greenwillowgames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 4}, "playtime": 3, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 183, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux", "macOS"], "developers": ["Green Willow Games"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Green Willow Games"], "esrb_rating": "Everyone"}