{"id": 236267, "slug": "fishio-ware-life", "name": "Fish.io Ware, life.", "name_original": "Fish.io Ware, life.", "description": "<p>Fish.io Ware, life. is inspired by WarioWare, Inc. and the microgames. The theme of the minijam 10 was \"Micro\" and the limitation was to use only 2 colors per sprite. The game tells the story of an anemone fish and the situations in his life via different microgames. I recommend to play option 4 which includes all levels. This way you get an easy start and will experience an increasing difficulty with every game.</p>\n<p>Controls:<br/></p>\n<p>Most of the time you are controlling the fish with WASD, except in the growing stages where you use SPACE to build up the fish.</p>\n<p>I joined the jam pretty late with 36 hours left. All in all I would say I was like 20 hours busy with the game. I'm no artist and it took me a lot of time to get the graphics like I imagined them. In the beginning I was not even planning to do this style of game. My first Idea was a 32 x 32 screen game where you are selling dlcs or something like that. I started with the images there and was pretty content with the outcome, but because the little screen and a lot of little sprites with different colors it didn't feel like 2 colors per sprite. I started over and ended with WarioWare, Inc.<br/></p>\n<p>GameJam: https://itch.io/jam/mini-jam-10-micro-<br/><br/></p>\n<p>Title theme:<br/>• provided by Legally Free To Use | Music https://www.youtube.com/channel/UCSgAXjVYsdITOz8qD66tRNw<br/>• License: CC-BY-ND <br/>• Track : Scuba Underwater <br/>• Artist : http://SilvyPro.com</p>\n<p>Other sounds made with http://sfbgames.com/chiptone/</p>\n<p>All graphics made by PronePlayingPanda<br/>All coding made by PronePlayingPanda</p>", "metacritic": null, "released": "2018-09-10", "tba": false, "updated": "2019-08-28T23:20:21", "background_image": "https://media.rawg.io/media/screenshots/f83/f83e98d3a2647d09288ff768db6bd425.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 75, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["Prone Playing Panda"], "genres": ["Action"], "publishers": [], "esrb_rating": null}