{"id": 236207, "slug": "sports-match-up", "name": "Sports Match Up", "name_original": "Sports Match Up", "description": "Test your reaction and agility in this Sports themed Match 3 game, as you race to complete the level before your time is up. Use awesome power-ups to help you along, and play through numerous sporty levels as you try your hardest to master the game.  Beat your friend's scores on the leader board and share your successes with them on Facebook!<br/><br/>⚾ Sports theme.<br/>⚾ Easy to learn, yet hard to master.<br/>⚾ Awesome power ups.<br/>⚾ Cascading combos helping you achieve massive scores.<br/>⚾ Climb the leader board and share your success with your friends on Facebook.<br/><br/>GUARANTEE<br/><br/>The loyalty and trust of our customers is very important to us. If you are not completely satisfied with a MeYuMe product then please contact us at meyume-games@xtremics.biz.<br/><br/>JOIN US!<br/><br/>☆ Facebook: http://www.facebook.com/meyumeapps<br/>☆ Twitter: http://twitter.com/MeYuMeApps<br/>☆ Tweet: @MeYuMeApps<br/>☆ Web: http://meyume.com<br/><br/>GAME PLAY<br/><br/>Match 3 games are puzzle games. You need to match 3 or more objects by exchanging two pieces in a horizontal or vertical direction.  Matched pieces are removed from the board and new pieces dropped back onto the board. The object is to clear the board and advance to the next level.  Matching more than 4  pieces can trigger the spawning of power ups with special abilities, helping you clear larger areas of the board.<br/><br/>Massive scores can be quickly achieved by chaining together the matches, these are called cascading combos. Each new combo results in an increase in the score multiplier and continues until there are no more matches for that combo run. <br/><br/>If you're unsure of the next move then you can rotate a quadrant of the board by pressing one of the rotate buttons that are situated in each corner of the board.", "metacritic": null, "released": "2012-11-20", "tba": false, "updated": "2019-10-22T14:18:12", "background_image": "https://media.rawg.io/media/screenshots/e51/e51f24f9fdcb36afe9776d429ffbf1f1.jpg", "website": "http://www.meyume.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 83, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Meyume"], "genres": ["Sports", "Board Games"], "publishers": ["MEYUME"], "esrb_rating": "Everyone 10+"}