{"id": 236284, "slug": "lemniskate", "name": "LemniSkate", "name_original": "LemniSkate", "description": "<p>---///LemniSkate///---</p>\n<p>Lemniscate:<br/>In algebraic geometry, a lemniscate is any of several figure-eight or ∞-shaped curves.<br/>Skate:<br/>Move on ice skates or roller skates in a gliding fashion.</p>\n<p>Controls:</p>\n<p>Middle Mouse: Grapple and hook on to a point<br/>Right Mouse Button: Jetpack<br/>Left Mouse Button: Shoot<br/>Left Control: Cancel hook, remove ground friction(skate)<br/>Spacebar: Jump<br/>WASD: movement<br/>Q: Slow Time<br/>F: Fix grapple marker (not recommended to use)<br/>R: Clear fixed markers(not recommended to use)<br/>Home: Restart Level</p>\n<p>(Very)Important Movement Tips:</p>\n<p>1.When you press the middle mouse button to hook on to something and reel in, you can cancel the reel-in mid way by pressing Ctrl. Holding down the Ctrl button this way will allow you to slide across the ground until you come to a stop. While reeling in, the sooner you cancel, the higher your resultant velocity will be.</p>\n<p>2.You can chain the above move by jumping/jetpacking at the end of a slide, and then hooking and repeating the process again</p>\n<p>3.Use the jetpack to slowly gain upward momentum (ideally used along with a jump)</p>\n<p>4.The faster you go, the lesser damage you take(more speed armor).Passing through turret spheres at high speeds will enable you to take less damage.</p>\n<p>5.The grappling marker( the blue sphere) will remain at the last valid point, or \"snap\" to edges.</p>\n<p>It might seem daunting at first(or not, i'm not sure) but once you get the hang of it, you'll be flinging yourself around the level with ease   </p>\n<p>Other comments/tips<br/>1.The pistol has no purpose as of yet. It can move the small cubes scattered around the level, and that's about it.Have fun slowing down time and shooting cubes!<br/>2.There was supposed to be a proper tutorial level(and more enemy types), but I ran out of time(fucking menudev reeee) so I apologize if things are convoluted/frustrating.</p>\n<p>Feedback/Criticism would be appreciated.<br/>Thank you so much for downloading and playing my game!</p>", "metacritic": null, "released": "2018-09-10", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/b19/b19bf3d869c536cefd66a6f6b36a4dd1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 20, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["selfawaresaltshaker"], "genres": [], "publishers": [], "esrb_rating": null}