{"id": 236222, "slug": "space-match-2014", "name": "Space Match (2014)", "name_original": "Space Match (2014)", "description": "Test your reaction and agility in this exciting space themed swap and matching game, featuring three different and addictive modes. Use awesome power-ups to help you along, and play through numerous space packed levels as you try your hardest to master the universe.  <br/><br/>FEATURES<br/><br/>* Super-charged match-3 puzzle game play.<br/>* Stunning graphics, fully optimised for small, medium, large and extra large screens.<br/>* Uniquely different modes; Arcade, Score Panic and Zen.<br/>* Gorgeous space themed pieces; asteroid, planet, rocket, comet, space jewel, space rock and many more.<br/>* Each mode is easy to learn, yet hard to master.<br/>* Amazing power ups and special cosmic effects. <br/>* Separate leader boards for each mode and a combined board to show who’s really the master of the universe.<br/>* Progress is saved in every mode - try out the different modes without losing your saves.<br/>* Use cloud backup to play on all your mobile devices without losing your progress. Game saves work across iPhones, iPads. <br/><br/>ARCADE MODE<br/>Fast paced space matching fun is on offer in the Arcade mode. Test your skill and reflexes as you race to complete the level before the timer overpowers you. <br/><br/>SCORE PANIC<br/>Can you reach the target score before your time runs out? The target score is increased after every level making this mode more and more challenging. Just don't panic!<br/><br/>ZEN<br/>Relax and chill in Zen mode, without a timer to harry and panic, you can lay back and focus on an addictive, never ending game of match.", "metacritic": null, "released": "2014-02-28", "tba": false, "updated": "2019-10-22T14:18:13", "background_image": "https://media.rawg.io/media/screenshots/a41/a411d3f380726d721a9b11fcb73231da_F0R3SDT.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 61, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Meyume"], "genres": ["Board Games", "Puzzle"], "publishers": ["MEYUME"], "esrb_rating": "Everyone 10+"}