{"id": 2363, "slug": "deo", "name": "DEO", "name_original": "DEO", "description": "Enter the gloomy world of DEO. Put your tapping skills to the test as you travel the serenity of space to create life and revive hope as you jump through 96 challenging levels requiring courage, skill and precision. Stylistically distinct, DEO features hours of immersive gameplay, challenging physics-based jumping, and a visually stunning art style.<br/><br/>Your goal is to jump to each hill of a rotating level to capture it. Complete each level successfully to build a planet on the main menu. The less you die in each level the more plants and life your planet will produce. From this fundamental balance, DEO leads the player through ambient backgrounds, deep artistic scapes and breathtaking visuals with a look that seems to combine dark, distressed and organic art.<br/><br/>****<br/><br/>“…DEO looks set to be a pleasingly creative take on the platform puzzler genre.” – Game Pro  <br/><br/>“If you enjoy creative, artistic games which evoke a real atmosphere and mood, then check this out.” – Touch Arcade<br/><br/>“I fully enjoyed every second of it.” 9/10 – InfiniPixel<br/><br/>“If you’re looking for a strikingly unique physics puzzler that will challenge even the most skilled of gamers, DEO is worth checking out.” 4/5 – AppAdvice <br/><br/>“DEO delivers all the basics of a platformer, but polishes them and awakens the experience with unparalleled visuals and sound. Visually, DEO is among the most striking titles I’ve seen in years.” 4.5/5 – Digitally Downloaded<br/><br/>“Fans of both platformers and aesthetically pleasing games would do well to explore DEO.” 4/5 – 148Apps<br/><br/>“DEO does a remarkable job serving up a platforming experience that’s unique, challenging, and surprisingly intuitive.” 4/5 – iFanZine<br/><br/>****<br/><br/>HIGHLIGHTS<br/>- 2 vast worlds, 90 challenging levels + 6 bonus levels<br/><br/>- Immersive main menu and gameplay <br/><br/>- Perform epic jumps and skillful landings<br/><br/>- Intuitive tap anywhere controls<br/><br/>- Surreal art design<br/><br/>- Retina display supported<br/><br/><br/>CONTROLS<br/>- Jump on each hill to capture the land pieces for your planet<br/><br/>- Tap anywhere on the screen to jump<br/><br/>- Hold your tap before letting go to make DEO jump further", "metacritic": null, "released": "2011-08-18", "tba": false, "updated": "2019-10-22T14:28:03", "background_image": "https://media.rawg.io/media/screenshots/8ea/8ea1b7fc9e03b714229bd7988d40aa3a.jpeg", "website": "http://deothegame.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 408, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "iOS"], "developers": ["eVeek", "Liman3D"], "genres": ["Action", "Adventure", "Strategy", "Arcade"], "publishers": ["eVeek", "Liman3D"], "esrb_rating": "Everyone 10+"}