{"id": 236372, "slug": "prisonnier-conquerant-tron-mini-jeux-ligne", "name": "Prisonnier , Conquerant ,Tron (mini jeux ligne)", "name_original": "Prisonnier , Conquerant ,Tron (mini jeux ligne)", "description": "<p>Different petit  jeux en réseau pour deux joueur pour l'instant il y a que 4 jeux ( prisonnier grille  7x7 , Prisonnier  grille 18 X 9 , Conquérant , Tron ) les autre  jeux seront Inclure dans les futures mis a jour. <br/></p>\n<p>Salons de discussion<br/>choisir le jeux et votre adversaire pour luis lance un défi.</p>\n<p> <br/>les différent réglé:<br/>[Prisonnier 7x7] : ogitif bloque votre adversaire.<br/>Pour vous déplacer cliquer autour de votre carré les  diagonales sont autorisés.<br/>Après le déplacement vous devez créer un blocs  celui-ci peut être placés sur tout le plateau du jeu.<br/>mini chat dans le jeux.<br/>a la fin de la partie on peu relancer une partie et la les emplacement des carres des joueurs restront a leur place dont Nouvelle stratégie aux perspectives.ou retourne au salon.<br/>Commande:<br/>a la sourie<br/></p>\n<p>[Prisonnier 19x9] meme chose que pour (Prisonnier 7x7)  mais vous avais un temps pour vous  déplacer et créer un blocks.<br/>Il y a un ennemie de temps en temps qui apparaît et se déplace et en fonction de son envie peu placé un a plusieurs blocks.<br/>Commande:<br/>a la sourie<br/></p>\n<p>[Tron] la je pense il y a pas grand chose a dire tout le monde connaît;<br/>Gagnée 5 fois<br/>Commande:<br/>Déplacement les fléchés<br/>Mode turbo la  barre d'espace (nombre 3)<br/>emplacement des joueur aléatoirement sur une base de 7 emplacement.<br/></p>\n<p>[Conquerant]<br/>Pour gagner la partie soyez plus nombreux que votre adversaire.<br/>Commande:<br/>Déplacement les fléchés<br/>Pour vous déplacer cliquer sur un de vous carre pour le sélectionner et cliquez sur une case vide.<br/>Si vous déplacez d'une case vous multipliés. Au-delà de deux cases vous été téléporter ceci augmente fur et à mesure du jeu. Pendant votre déplacement si votre carrés touche les carrés de votre adversaire celui-ci se transforme de la couleur de votre carré.<br/></p>\n<p>Les autre jeux sont en construction (bataille navalle,poursuite Bombe,SnakeVs avec différents modes il aura des surprises ;-), il me reste tant à faire. \"Améliorer\" les graphismes,regle les BUG.<br/>ceci et aussi  pour moi un test comme tout jeux qui sont en réseau si il y a personnes connectées il et vite oublier :-(</p>\n<p>Bon test.</p>", "metacritic": null, "released": "2018-09-09", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/971/971957c6910096b558199f1d7934d930.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 117, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Emmanuel Lorand"], "genres": ["Action", "Strategy"], "publishers": [], "esrb_rating": null}