{"id": 23649, "slug": "ripple-effect", "name": "Ripple Effect", "name_original": "Ripple Effect", "description": "Welcome to Ripple Effect, a free VR gaming platform set in a wide array of different environments. Adventure across an alien macrocosm, and through a vast selection of single and multiplayer experiences, which are updated weekly. Over time, players will unearth new content and experience a universe unfold. Each experience building on the last; a Ripple Effect. <br/><br/>Upon our release, players will be transported to a mysterious alien world where they can explore its stunning surface and cavernous depths. With the help of your own personalized guide, players will have access to 5 playable experiences and 3 environments. Mountain King and Illumination Bay are both networked and support multiple players. Here is a list of our games:<br/><br/>Spear Toss<br/>Master the spear to destroy your mortal enemy: an evil killer robot.<br/><br/><br/>Night Flight<br/>Soar the night skies of a futuristic metropolis and overcome its many challenges.<br/><br/><br/>Hammer and Shield<br/>Pick up your weapons and face off an army of giant rock monsters.<br/><br/><br/>Sky Roots<br/>Afraid of heights? Swing on vines dangling off floating islands thousands of feet above a majestic alien desert.<br/><br/><br/>Mountain King<br/>It's good to be king... but no one wears the crown forever. Climb to the top in our premier multiplayer experience and become the King of the Mountain. Play with up to 8 players in our unique free for all.", "metacritic": null, "released": "2017-05-31", "tba": false, "updated": "2019-08-28T22:06:57", "background_image": "https://media.rawg.io/media/screenshots/6c0/6c043b9e613ba4acc697ce6dc6520775.jpg", "website": "http://wellplayedstudios.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 137, "beaten": 1, "playing": 1}, "playtime": 1, "achievements_count": 6, "ratings_count": 1, "suggestions_count": 541, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Well Played Studio"], "genres": ["Action", "Adventure", "Strategy", "Simulation", "Casual", "Indie"], "publishers": ["Well Played Studio"], "esrb_rating": "Everyone"}