{"id": 236441, "slug": "elements-of-alma-shades-of-tragedy", "name": "Elements of Alma: Shades of Tragedy", "name_original": "Elements of Alma: Shades of Tragedy", "description": "<p>Prelude Chapter:<br/><br/>The Central Nation of Axandrum, has taken it's holy crusade against the Southern Nation of Uhdaga. Abdollius, the current ruling king of Axandrum.<br/>Has attempted to maintain peace for all the nations of Hal'Veshja, yet he feels Uhdaga and their cruel practices are consider taboo to the creators, the Arcus.<br/>Abdollius has ruled that in order for the \"Promise Day\" to be that of peace and long life. That Uhdaga and their practices must be put to a stop.<br/>Declaring an all out war with Uhdaga, 3 years after. Axandrum finds it's self at the mercy of it's own homeland threats. Bandits, Cults, and Fiend Tribes all begin <br/>to rise up and make their move to take down the Crown City and it's King.<br/><br/>Abdollius left with few soldiers to defend the Crown City, was left with only once choice. To assemble his most elite of soldiers, his Elite Court. <br/>made up of five of his most trusted and hand pick counsel. Abdollius has task them with maintaining the peace and order of the homeland, while<br/>handling other political affairs. Just as they were task their duties, a commoner presents to them a rare artifact that was long believed lost to <br/>mankind. The artifact could be used to rewrite the world to what ever the user desires, Abdollius against the use of the artifact demands that <br/>it be sealed away in the Castles Vault. As the Elite Court members take on their most notorious threat, the fiend tribe of Norgons. They are<br/>presented with an even greater threat. The presence of Dark Artifacts, these forbidden artifacts have given their foes the upper hand.<br/>While a mysterious ritual link to the artifacts has been discovered. They must act fast to put an end to the ritual or be at the mercy of <br/>it's caster and it's power..</p>", "metacritic": null, "released": "2018-09-09", "tba": false, "updated": "2019-08-28T23:20:20", "background_image": "https://media.rawg.io/media/screenshots/3c8/3c80d6e682c2768da760c8b7f733b220.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 100, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Soaring Dreams"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}