{"id": 23648, "slug": "vulture-strike", "name": "Vulture Strike", "name_original": "Vulture Strike", "description": "Side-scrolling shooting game in which you have the ability to travel between 2 parallel timelines whenever you want.<br/><br/><strong>Use the Wormhole mechanic to avoid obstacles</strong><br/>Travel freely between 2 parallel timelines to survive.<br/><br/><strong>Visions allow you to use the Wormhole mechanic carefully</strong><br/>Colorful silhouettes around your ship indicate the dangers in the parallel timeline.<br/><br/><strong>Increase your score by taking high risks</strong><br/>By putting yourself in dangerous situations right before opening a Wormhole, your score multiplier will increase greatly, allowing you to sum impressive amounts of points. Activate Frenzy Mode by filling up the Frenzy gauge.<br/><br/><strong>Game characteristics:</strong><br/>- Strictly horizontal 2.5D.<br/>- No player health bar, 1 hit KO.<br/>- Precise controls (arcade stick and game-pad supported).<br/>- 2 main buttons: shoot and Wormhole (a third optional button can be used to expand the vision into the parallel timeline).<br/>- 3 difficulty settings.<br/>- Completely configurable controls, works with keyboard, gamepad, arcade sticks, both analog and digital directions can be used for movement. Mouse controls are not supported.<br/>- Risk-reward based scoring system.<br/>- Standard shot and 2 powered up shot modes.<br/>- Online leaderboards.<br/>- 5 levels.<br/>- Graphic configuration options.<br/>- 16/9 fixed ratio.<br/>- Events in game tied to frames. If your computer struggles when rendering the game and the framerate drops, the game will be slowed down, no frames will be skipped.<br/>- Visions color can be changed by the player to make them more or less visible and more pleasing to the eye.<br/>- Unlimited use of the Wormhole mechanic, which allows for infinite different ways to approach the levels and unlimited potential to optimize runs for high scores.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T22:06:57", "background_image": "https://media.rawg.io/media/screenshots/76f/76f759488f3b961c4f9c25dbba5fb20f.jpg", "website": "http://vulturestrike.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 4}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 403, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Vulture Strike"], "genres": ["Action"], "publishers": ["Vulture Strike"], "esrb_rating": "Everyone"}