{"id": 236413, "slug": "knight-witch-demo-day-22", "name": "Knight & Witch - Demo Day 22", "name_original": "Knight & Witch - Demo Day 22", "description": "Fixed a series of major bugs with the AI and with the dungeon that prevented the demo from being completed\r\n<p>This is the second demo for my game Knight &amp; Witch, and my entry for agdg's Demo Day 22.</p>\n<p>Gameplay-wise, not much has changed since the last demo, at least at a surface level. I've made quite a few changes under the hood. </p>\n<p>The most visible change since the last demo: </p>\n<ul><li>the witch now attacks by charging her spells. hold down the button to charge, release the button to shoot. while charging you can aim your spells, but you can't move</li><li>the ally character now has 'proper' AI. if they see an enemy they will attack, if they're in danger or if they're too far away from you they will try to regroup, etc. (actually this is pretty much it...)</li></ul>\n<p>Now let me quickly go over what <em>did</em> change, even if most of it is back-end stuff as I said</p>\n<ul><li> I gave the enemy AI system a complete overhaul. It's still a simple finite state machine, but now I can create all new behaviors by mixing and matching action and conditions that make the AI transition from state to state. It's still rough around the edges and I already plan to refine and improve it, but I think it's already a lot better than the one enemy type I had before.</li><li>This new AI system proved to be reliable and sturdy enough that I decided to use it to handle the AI for the ally character. Many people rightfully complained that the AI character in the first demo was dead weight and, while they're still not very smart, now the allies can at least defend themselves and run away from danger (most of the time). Still, remember to switch over control if you see that you companion is in a bad situation, or tell them to stop moving if they're about to walk over a trap for example.</li><li>Design-wise I've been thinking a lot about what exactly I want the game to be, and finally settled on a Zelda-like concept of unique items that the two characters will obtain during their adventure. These items will serve different purposes, both in combat and in puzzle-solving. For this demo, I only managed to set up the bare ground work for this, but you will see what I mean if you play it. It's still very basic, but it's only the beginning.</li></ul>\n<p>Unfortunately I spent so much time on systems and design that the level for the demo will probably feel underwhelming, and the puzzles are pretty braindead (and most of them still don't make good use of the two-character mechanic). I want to be clear on this though, I do plan to make each character feel different and give them a purpose in different situations. I'm just not there yet.</p>\n<p>Enough talking. Play the game and give me your feedback. I haven't tested it nearly enough, so let me know if you run into any big, game-breaking or not. (Sorry in advance if you do)</p>\n<p><strong>Controls [gamepad]:</strong></p>\n<ul><li><em>WASD/Arrow Keys [L3] - </em>Move</li><li><em>E</em> <em>[B]</em> - Interact</li><li><em>Q [Left Bumper]</em> - Sswap characters</li><li><em>Z</em> <em>[Y] - </em>Toggle AI state (stop/follow)</li><li><em>F [A]</em> - Attack</li><li><em>X [Right Bumper]</em> - Swap weapon</li></ul>\n<p>I think this is all I had to say. I hope you'll have fun with my demo.</p>", "metacritic": null, "released": "2018-09-09", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/ba9/ba9878cd4a5e26bb24b93f5e7bf8d798.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 104, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SquareDev"], "genres": ["Action", "Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}