{"id": 236694, "slug": "remnant-from-the-ashes", "name": "Remnant: From the Ashes", "name_original": "Remnant: From the Ashes", "description": "<p>Remnant: From the Ashes is a third-person survival action game where players create characters to suit their playstyle and set out alone or alongside a team of up to three other players to explore and survive the perils of diverse and deadly environments.</p>\n<p>THE REMNANT OF MANKIND.<br />\nThe world is in ruins. Only a remnant of mankind remains, hunted to near extinction by horrors from another world. Most of humanity live like rats in the rubble of devastated cities. A few survivors with the technology to open portals to fantastic, alternate worlds venture out each day hoping to scavenge resources and find a way to defeat the invaders. They struggle to carve a foothold, rebuild, and then retake what was lost.</p>\n<p>FIGHT. ADAPT. OVERCOME.<br />\nEach world will presents new challenges and perils to overcome. Throughout your journey you will encounter dozens of monsters unique to each environment. You will fight tooth-and-nail against creatures both big and small - from towering behemoths the size of buildings to countless hordes of small, deadly terrors. You will adapt… or die trying.</p>\n<p>EXPLORE FANTASTIC, TERRIFYING REALMS.<br />\nExplore beautiful, dynamically-generated worlds – each with their own unique creatures and environmental challenges. You must explore, gain experience and adapt new strategies to survive the dangers of each world.</p>\n<p>CRAFT. UPGRADE. SPECIALIZE.<br />\nBand together with other survivors to improve your chances. Protect and befriend skilled tradesmen and offer them the safety of your home base. In turn, they will offer valuable skills and resources to help you upgrade, craft and enhance your weapons and gear.</p>\n<p>STRENGTH IN NUMBERS.<br />\nThe Root are ruthless and deadly. To stand a chance you need help - you need a Team. In Remnant: From the Ashes you can group up with three other survivors. There are multiple hero archetypes to choose from, each designed with unique skills and advantages to help the group survive.</p>", "metacritic": 76, "released": "2019-08-20", "tba": false, "updated": "2024-04-22T22:15:56", "background_image": "https://media.rawg.io/media/games/30f/30f2c0f6890da6971102210c56d8513c.jpg", "website": "https://www.arcgames.com/en/games/remnant", "rating": 3.62, "rating_top": 4, "added_by_status": {"yet": 280, "owned": 2217, "beaten": 373, "toplay": 213, "dropped": 311, "playing": 64}, "playtime": 7, "achievements_count": 195, "ratings_count": 622, "suggestions_count": 590, "game_series_count": 1, "reviews_count": 638, "platforms": ["PC", "Nintendo Switch", "Xbox One", "PlayStation 4"], "developers": ["Gunfire Games", "Perfect World Entertainment"], "genres": ["Action", "Adventure", "RPG"], "publishers": ["Perfect World Entertainment"], "esrb_rating": "Everyone"}