{"id": 236760, "slug": "monster-adventurer", "name": "Monster Adventurer", "name_original": "Monster Adventurer", "description": "This is my second game. <br/>This is a turn-based game.<br/><br/>The protagonist is an old man.<br/>Pursue your dreams and be an adventurer.<br/>Without any setbacks, he became an adventurer.<br/>It started adventurer life. Teammate System <br/>The protagonist can recruit two teammates and about 35 teammates can be recruited.<br/>You must activate your teammates before they appear on the recruitable list. Skill System <br/>Skills in addition to MP consumption, there is TP consumption<br/>MP can be recovered by potion, rest,<br/>TP can only be recovered by fighting<br/>The more advanced skills, the more TP needed backpack system <br/>The team has a common backpack that cannot be used in combat.<br/>Each person has a separate backpack that can be used in combat. Dot Adding System <br/>Role upgrades can earn points that can be used to increase ability values. Skill Learning System <br/>Role upgrades have access to points that can be used to learn their skills.<br/>The skills that everyone can learn are different. Card System <br/>Each monster has two cards.<br/>One is a summon card that can summon this monster to help.<br/>The other is a transfiguration card that can be transformed into a monster to help out. Mission System <br/>Only after the association accepts the mission can we go to the wild and perform the mission<br/>Accepting the task requires a deposit. No deposit cannot accept the task.<br/>Complete the mission to gain reputation<br/>Mission failure will lose reputation<br/>Reputation increases the adventurer level.<br/>Prestige is too low will reduce the adventurer level. Working System <br/>Can go to the store, work.<br/>It is a way to get money by hanging up.", "metacritic": null, "released": "2018-07-06", "tba": false, "updated": "2019-08-28T21:53:31", "background_image": "https://media.rawg.io/media/screenshots/10e/10e8035ae5611bfa08d8e9607009b5da.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 322, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["yang1zhi"], "genres": ["RPG"], "publishers": ["yang1zhi"], "esrb_rating": null}