{"id": 236753, "slug": "midnight-wave", "name": "Midnight Wave", "name_original": "Midnight Wave", "description": "Midnight Wave is a samurai cyberpunk tactical action RPG with immense customization, narrative choice, and innovative gameplay mechanic combinations, set in a world full of katanas, mega corporations, and elemental powers. Inspired by legendary classic titles such as Fire Emblem and Super Smash Brothers and more recent games like the Mass Effect series, Midnight Wave invites you to take part in a total genre mash-up adventure like no-other!<br/><br/><br/><br/><ul><li>Innovative Combat: Plan your attacks on the tactical map, then battle them out in a platform fighter duel! No more RNG percentages. You control the action. <br/></li><li>Old School Aesthetic: We've got pixel art vibes that'll make you drown in nostalgia! <br/></li><li>Narrative Choice: The story is yours, say what you want, do what you want, and make difficult choices that shape the world.<br/></li><li>Characters and World: Everything is fleshed out! Explore and learn more about characters and the world, and watch as they react to your actions.<br/></li><li>Customization: Customize all of your characters! Not just their equipment, but their appearance, class, and skills too! Unlike other games, in Midnight Wave tactical sprites, portraits, and platform fighter sprites all change appearance accordingly.<br/></li><li>Elemental Combat: Wreak havoc on the battlefield with the elements! Freeze your enemies, burn them alive, or blow them away! Manipulate the environment to your advantage.<br/></li><li> Local Multiplayer: Enjoy local multiplayer with up to four friends! Choose your character and fight head to head in platform fighter combat. </li></ul><br/>For more details, check out https://www.midnightwavegame.com/", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:53:31", "background_image": "https://media.rawg.io/media/screenshots/6ab/6abcd94cfaa4fb718da2f981fdfcbfd4.jpg", "website": "https://www.midnightwavegame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 163, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Walthall Studios", "Ampersand Game Studios"], "genres": ["Action", "Adventure", "RPG", "Strategy", "Indie"], "publishers": ["Walthall Studios"], "esrb_rating": null}