{"id": 236751, "slug": "we-were-here-together", "name": "We Were Here Together", "name_original": "We Were Here Together", "description": "The game continues the communication-centered adventure in which you and a partner must solve puzzles on an urgent mission to save the expedition... and yourself! This time, expect even more puzzles and discover the story behind the Antarctic expedition.<br />\nStarting out at the research base camp, you’ll need to figure out a way to get to Castle Rock together. Once you’re through the frozen Antarctic wastes, you&#39;ll find yourselves separated inside the castle itself, facing puzzles, secrets, and dangers!  You and your partner have nothing but your wits and a walkie-talkie each. Observation, smart communication and teamwork will be the only way to escape from the sinister Castle Rock.<br />\nNOTE: This game is co-op only. It requires both players to have a working PC-compatible microphone and an internet connection.<br />\nTalk – Your voice will have to lead the way.<br />\nYou and your expedition partner must traverse Antarctic wasteland and infiltrate a sinister ancient castle. The only possession you have left is a walkie-talkie.<br />\nSolve – The warmth of life abandoned the halls of Castle Rock long ago.<br />\nImmerse yourself in a thrilling experience as you and your partner puzzle your way through the expedition camp, frozen wastes, and finally multiple wings of two unique locations inside the abandoned castle itself. Discover brand new environments and mysteries, together.<br />\nEscape – We were not alone...<br />\nDarkness has engulfed the once magnificent Castle Rock and its surroundings. Can you discover the truth behind the grim fate of the fallen citadel and make it out alive... or will the original inhabitants catch you on your way out?</p>", "metacritic": 70, "released": "2019-10-10", "tba": false, "updated": "2024-04-08T03:30:55", "background_image": "https://media.rawg.io/media/games/812/8129a4f97f5a061e370901b6dc257bd8.jpg", "website": "http://totalmayhemgames.com/we-were-here-together", "rating": 3.96, "rating_top": 4, "added_by_status": {"yet": 86, "owned": 1343, "beaten": 148, "toplay": 48, "dropped": 25, "playing": 10}, "playtime": 6, "achievements_count": 89, "ratings_count": 143, "suggestions_count": 245, "game_series_count": 3, "reviews_count": 145, "platforms": ["PC", "macOS", "Xbox One", "Linux", "PlayStation 4"], "developers": ["Total Mayhem Games"], "genres": ["Adventure", "Casual", "Indie", "Puzzle"], "publishers": ["Total Mayhem Games"], "esrb_rating": null}