{"id": 236721, "slug": "offside", "name": "Offside", "name_original": "Offside", "description": "Far away in the snowy mountains of Northern Europe , lives Nils, a young boy with a passion for soccer. Grandson of a great champion, he is the heir to a wonderful ball collection. But Olaf and his bully boy crew, the Black Tigers, stole everything !<br/>With the help of his two friends Icha and Vince, Nils must defeat the wrongdoers and collect the balls as fast as he can.<br/>Between a Runner and an Hack &amp; Slash game, Offside lets you play as the young boy through 4 exciting levels, in which reflexes and agility will be the key in defeating Olaf’s plans and getting back the soccer ball collection.<br/><br/>Game characteristics :<br/><br/>- Dodge the obstacles on your way to help Nils in catching up with Olaf.<br/>- Block your enemies with some acrobatic shots to counter the Black Tigers’s ambushes.<br/>- Tackle the Black Tigers in single player mode, or challenge your friends and get the best score on each level.<br/>- Perform the most amazing tricks, and become the best soccer player in all Scandinavia.<br/><br/><strong>OFFSIDE a game by objectif 3D:</strong><br/><br/>OFFSIDE is a student group project. Our school,objectif 3D-game is specialized in game conception and is located in Montpellier, France. <br/><br/>Our goal? To match students passion for video game with the expectations of recruiters. We therefore do our utmost to ensure the sustainable hiring of our students at the end of their studies : from a pedagogy based and rooted in the reality of professional practices to contacting the studios that recruit.<br/><br/>The courses, mainly based on practice and personal investment, reproduce the working conditions of production studios to provide technical know-how and professional skills. The year is punctuated by individual projects, and group projects, which make it possible to apply the knowledge acquired, develop teamwork and affirm individual skills.", "metacritic": null, "released": "2018-09-26", "tba": false, "updated": "2019-09-09T03:19:43", "background_image": "https://media.rawg.io/media/screenshots/28c/28c03c8d7a146531e970b1a56a406903.jpg", "website": "https://www.objectif3d.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 33, "ratings_count": 0, "suggestions_count": 221, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Objectif 3D - game", "Stamford Highbury"], "genres": ["Action", "Simulation", "Sports", "Casual", "Indie"], "publishers": ["Objectif 3D - game", "Stamford Highbury"], "esrb_rating": null}