{"id": 236794, "slug": "spellfront", "name": "SpellFront", "name_original": "SpellFront", "description": "SpellFront is a first person action in which you play as a mighty sorcerer. On each step of you journey you will be discovering new spells that can help you to defeat enemies and go further in your path. Rise from your slumber to defeat unstoppable horde of extraterrestrial foes. During three big stages you will be exploring ancient ruins to find the ultimate weapon and stop your enemies once and for all.  <br/><br/><ul><li>Every you spell is a unique weapon that has a special role in the battle: crush your opponents from afar with help of Devil Hands, lure them into electric traps using Spheres of Thunder and destroy them in packs with Acid bombs.<br/><br/></li><li>Challenge the diverse cast of enemies: from combat robots to stone golems.<br/><br/></li><li>Use your spells to influence your surroundings. Use your surroundings to win the battle. You can destroy floor under your enemy fits, throw explosive at them using your telekinesis, or electrocute water to stun multiple enemies at once. <br/><br/></li><li>You may face with dozens of foes in one fight. So be prepare to change spells on the run and adjust your tactic!<br/><br/></li><li>Choose suitable spells to find secrets, traverse traps and solve puzzles. For example, you can use your telekinesis to build staircase from boulders, melt iron bars with Acid Bombs or charge an alien generator using Spheres of Thunder. </li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:53:27", "background_image": "https://media.rawg.io/media/screenshots/0e9/0e935949ebc85754592aa70a4832c86d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3}, "playtime": 0, "achievements_count": 22, "ratings_count": 0, "suggestions_count": 479, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Steppe Hare Studio"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Steppe Hare Studio"], "esrb_rating": null}