{"id": 23683, "slug": "castleparts", "name": "Castleparts", "name_original": "Castleparts", "description": "Classic castle building and cannon shooting strategy is back, but better. Strategically place your walls and shoot the weak points of your opponent. Cast spells to defend your walls or crush those of your enemies. Convert crystals to gold to supercharge your energy and win!<br/><br/>- Two battle modes, a classic mode and an all new Creep mode with an innovative twist where having the biggest castle is not the only goal.<br/><br/>- Two adventure modes where you explore a large map and build the castle of your dreams.<br/><br/>- Online multiplayer with friends or random opponents.<br/><br/>- Four playable heroes, each with unique abilities and advantages.<br/><br/>- Twelve spells to protect yourself or bring the pain to your opponents.<br/><br/>- Amazing retro pixel art graphics and an awesome chiptunes inspired soundtrack that you won't be able to stop listening to.<br/><br/>Look down from the highest rampart at the enemy minions in the fields below and fire your cannons to destroy them.  Wield the power of the elements as you drop thunderbolts and columns of fire on the walls of your opponents. For the first time ever, expand and explore on a large map with a persistent castle that lasts between play sessions. Whether you like strategy games, action games, tower defense games, or retro reimaginings of your favorite games of yesteryear, Castleparts is for you.", "metacritic": null, "released": "2017-05-31", "tba": false, "updated": "2019-10-22T14:30:37", "background_image": "https://media.rawg.io/media/screenshots/7a5/7a5df41206b8f7af44d4d78c78a7792a.jpeg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 211, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Matthew Olsen"], "genres": ["Action", "Strategy"], "publishers": ["Matthew Olsen"], "esrb_rating": "Everyone 10+"}