{"id": 236855, "slug": "the-last-train", "name": "The Last Train", "name_original": "The Last Train", "description": "Get ready to go on an adventure of a Lifetime<br/>The Last Train is a Survival Adventure Game where you take the role as one of the last surviving train pilot in a post world War 2 America. The game is set in Alternate History, post the Hiroshima and Nagasaki bombings. In this emotional journey, the story explores how war affects normal people who want to go about their family lives, not just the brave soldiers who are fighting at the frontlines. As a train pilot you are tasked to go around the country to help as many people as you can, helping them reach their families, helping the terminally ill or will you be greedy and try to make the most out of the dire situation by hoarding all the items you get from the people? All the decisions that you take will shape the story and affect the world around you.<br/><br/>We would also like to thank each and every one of our supporters on Indiegogo who trusted us to deliver the game. We sincerely hope that you enjoy playing the game as much as we enjoyed making it.Feature List<ul><li>Unique Survival Adventure Gameplay<br/></li><li>Engaging storyline that is tailor-made for you based on your decisions<br/></li><li>Explore over 20 different cities in the United States<br/></li><li>Deep Crafting, Cooking and Train upgrading systems<br/></li><li>Highly Interactive Scavenging Gameplay<br/></li><li>Over 150 unique characters with their own backstories and rewards<br/></li><li>Features a Grim and Dark Art style<br/></li><li>Over 15 Cutscenes to immerse you into the gameworld we've created<br/></li><li>2 Game Modes to playthrough Story Mode and a Sandbox Mode<br/></li><li>Original OST <br/></li><li>Male and Female Voice Over narration<br/></li><li>Compete with your friends on the Sandbox Mode Leaderboard<br/></li><li>Steam Achievements and Leaderboards<br/></li><li>Play with a Controller or a Mouse and Keyboard</li></ul>How to Play<br/><strong>Start the game by picking up passengers on board<br/><br/>Plan your trip strategically to make sure you have sufficient fuel<br/><br/>Travel across all the states and drop off passengers<br/><br/>Explore and Scavenge each city<br/><br/>Use the scavenged items to craft and cook new items and recepies for yourself<br/></strong>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:53:22", "background_image": "https://media.rawg.io/media/screenshots/5ff/5ff8fa366971680a996c5e1592316950.jpg", "website": "http://thelasttrain.net/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 32, "ratings_count": 0, "suggestions_count": 197, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Smash Game Studios"], "genres": ["Adventure", "RPG", "Strategy", "Simulation", "Indie"], "publishers": ["Smash Game Studios"], "esrb_rating": null}