{"id": 236933, "slug": "jigsaw-puzzles-now", "name": "Jigsaw Puzzles Now", "name_original": "Jigsaw Puzzles Now", "description": "Fall into pleasant daydreams with new amazing jigsaw puzzles! Hours of entertainment on your iPhone and iPad!<br/><br/>Jigsaw Puzzles Now is unlike any you’ve ever seen! Entertaining and brain training puzzles will touch everyone's heart and hold attention right to the last piece!  Extraordinary game for a truly fun and challenging experience.<br/><br/>REGULAR UPDATES<br/>• Enjoy new FREE colorful jigsaw puzzles EVERY DAY!<br/>• Recommendations - HAND PICKED content based on what you like!<br/><br/>AMAZING CONTENT<br/>• Tons of content - incredible collections and packs of high quality puzzle images will strike your imagination<br/>• Dozens of unique categories with puzzle pictures you’ll love<br/><br/>CHALLENGES AND DIFFICULTY<br/>• Choose your challenge - from 20 to 400 unique pieces<br/>• 3 different puzzle shapes<br/>• Rotation mode for advanced players<br/><br/>EXCELLENT GAMEPLAY<br/>• Preview the finished puzzle picture to help you solve it  <br/>• Attractive design - every piece has unique shape - no two pieces are alike<br/>• Move pieces in groups<br/>• Save incomplete puzzle and finish them later<br/>• Play multiple puzzles at a time and track their progress<br/><br/>AND MUCH MORE<br/>• Fun for all ages and skill levels<br/>• No more mess and missing pieces<br/>• No need internet for your entertainment<br/>• Friendly interface that is simple and easy to use<br/>• Share completed puzzles with friends or save them in your photo album<br/> <br/>Enjoy your time by collecting amazing jigsaw puzzles! This entrancing game is perfect for the young &amp; young at heart! Improve your memory skills and feel fun at the same time!<br/><br/>Finish these beautiful, inspirational puzzles is just the beginning of a wonderful adventure! Download now!<br/><br/><br/>SUBSCRIPTION PRICING AND TERMS<br/><br/>Subscription Options:<br/><br/>Weekly Premium Membership offers $2.99 weekly subscription after 7-day free trial for unlocking content, features and removing ads.<br/>Weekly Premium Membership offers $7.99 weekly subscription after 3-day free trial for unlocking content, features and removing ads.<br/>Monthly Premium Membership offers $5.99 monthly subscription for unlocking content, features and removing ads.<br/>Monthly Premium Membership offers $14.99 monthly subscription for unlocking content, features and removing ads.<br/>Yearly Premium Membership offers $29.99 yearly subscription for unlocking content, features and removing ads.<br/>Yearly Premium Membership offers $99.99 yearly subscription for unlocking content, features and removing ads.<br/><br/>* The price is for US customers. Pricing in other countries may vary and actual charges may be converted to your local currency depending on the country of residence.<br/>* Payment will be charged to iTunes Account at confirmation of purchase<br/>* Subscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the current period<br/>* Account will be charged for renewal within 24-hours prior to the end of the current period, and identify the cost of the renewal<br/>* Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user's Account Settings after purchase<br/>* Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that publication, where applicable<br/>* Link to Privacy Policy: http://zephyrmobile.com/privacy/<br/>* Link to Terms of use: http://zephyrmobile.com/terms/<br/><br/><br/>Requested access:<br/>Notifications - Allow notifications to receive all news about the app, new content, updates", "metacritic": null, "released": "2017-06-26", "tba": false, "updated": "2019-07-29T15:45:48", "background_image": "https://media.rawg.io/media/screenshots/a9e/a9eba15905eb1d74efdd1dc6a099e6ac.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 226, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Zephyrmobile"], "genres": ["Board Games", "Puzzle"], "publishers": ["Zephyrmobile, spol. s r.o."], "esrb_rating": "Everyone 10+"}