{"id": 237094, "slug": "monster-energy-supercross-game", "name": "Monster Energy Supercross Game", "name_original": "Monster Energy Supercross Game", "description": "Live the dream to become a Monster Energy Supercross championship superstar, race with riders and motorcycles of the official championship. Start the engines!<br/>Monster Energy Supercross Game drags you in the middle of the official championship. Your drivers compete in different game modes: a massive single player career that alternates between four race type, a multiplayer mode against real players from around the world and tournaments in real time during the championship weekends.<br/><br/>ARCADE GAMEPLAY Run on a track full of giant jumps and tight curves, accelerate and release with the right timing to keep control of your bike, control the acceleration and do not think about anything else!<br/><br/>LIVE THE RACE Ransom your opponents, control your departure and stay focused until the end line, it will be an adrenaline challenge!<br/><br/>● Official drivers and bikes for the Monster Energy Supercross 2017 championship, play with your myths and beat their times<br/>● Compete in the 250cc and 450cc championships, challenge opponents in official stadiums.<br/>● Boost your bike's stats: acceleration, speed and grip will be your best allies<br/>● Massive and engaging career mode: collect the achievement to become the champion of Monster Energy Supercross<br/>● Log in with Facebook to monitor what your friends are doing, challenge your network of contacts to do better than you<br/>● With each victory there is a prize: collect them to upgrade your motorbike faster<br/>● Log in every day to collect daily bonuses<br/>● Multiplayer Challenges: Beat players from all over the world to increase your \"Newbie\" fame until you reach the \"Epic\" level<br/>● Fans Challenge: during the championship weekends, jump in the saddle and compete for one of the two drivers proposed, choose the team well, if at the end of the weekend you will be in the winning side you will receive big prizes<br/><br/>Supported languages: English, French, German, Spanish, Italian, Portuguese, Brazilian Portuguese, Spanish South-America and Russian<br/><br/>The game is compatible with devices with iOS 10 and above.<br/><br/>Download for free today and start playing!", "metacritic": null, "released": "2018-02-08", "tba": false, "updated": "2019-08-02T03:09:42", "background_image": "https://media.rawg.io/media/screenshots/fe4/fe48b975b965d25aff28861593d47f6e.jpg", "website": "http://milestone.it/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 265, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Milestone"], "genres": ["Sports", "Racing"], "publishers": ["Milestone"], "esrb_rating": null}