{"id": 237099, "slug": "space-story-alliance", "name": "Space Story: Alliance", "name_original": "Space Story: Alliance", "description": "You are in the hands of the mad “creator”, who brings down the waves of enemies at you.<br/>Marauders with the legendary Star Bird, DeepWalkers with fantastic Cruiser Phantom and mysterious Black Dogs, leading by the Dark Moon.<br/><br/>Space RPG-slash-adventure game in planet defense genre in the world of game “Space Story”.<br/>More than 20 ships, three huge TITANs, more than 100 different weapons, anomalies, asteroid fields. The world you may discover and must protect.<br/>Improve your ship, buy or craft from blueprint new one, level weapons and equipments, improving rpg-skills, gettings new military ranks, and, of course, SWPs (stationary weapon points) and Lures.<br/>Choose any tactic of improvement you want to protect the planet. Call for support squadrons if needed.<br/><br/>### 4 DIFFICULTY LEVELS ### <br/>With over 90 waves of enemies in each.<br/>From a really easy to extreme mode nobody could pass. Not for the best, for the best of the best. <br/><br/>### MORE THAN 20 CUSTOMIZABLE SPACESHIPS ### <br/>With diffirent params, mount points, etc… Unique ancient ships.<br/><br/>### 3 TITANs ### <br/>A HUGE unique ships with a large number of weapons on board.<br/><br/>### MORE THAN 100 WEAPONS, EQUIPMENTS ### <br/>With unique names, random generated levels and params. Buy, find and craft. And all items will be really unique.<br/><br/>### INTERACTIVE WEAPON SYSTEM ### <br/>You see all mounted weapon on your ship, how it turns, reloads, fires.<br/><br/>### CRAFT SYSTEM ### <br/>All weapons, equipments can be crafted from blueprints. Unique randomize system. And, ships, of course. Some of them couldn't be bought, only crafted! <br/><br/>### SECRET PLACES ### <br/>To discover and unlock. <br/><br/>### ASTEROID FIELDS ### <br/>To look for hidden field and extract ore to craft items and ships.<br/><br/>A really great new adventure in the heart of the Space Story’s game world, now in planet defense genre. <br/>For everyone, who has a particle of the legendary space captains of the past in his heart!<br/><br/>### ATTENTION! TO ALL GALAXY CAPTAINS! ATTENTION! ### <br/>If any space traveller helps me translate this text to «right» English or any other language, i'll promise - I tell you all secrets i know about this game! <br/><br/><br/>### INSTEAD OF AN EPILOGUE ### <br/><br/>From the Code of Space Captains<br/>“Space Captains doesn’t die, after death, he continues to travel in the vast unknown space, discovering new worlds and fighting under the flag of the legendary fleet of Gray Stranger….”", "metacritic": null, "released": "2013-11-06", "tba": false, "updated": "2019-10-22T14:18:22", "background_image": "https://media.rawg.io/media/screenshots/86a/86a062580495834e1f9a5044092f529d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 20, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Alex Alez"], "genres": ["Action", "Strategy"], "publishers": ["Alex Alez"], "esrb_rating": "Everyone 10+"}