{"id": 23700, "slug": "cars-race-o-rama", "name": "Cars Race-O-Rama", "name_original": "Cars Race-O-Rama", "description": "<p>In the Cars Race-O-Rama video game, players get to race against new characters through action-packed tracks to win the Race-O-Rama trophy as their own personalized Lightning McQueen. Join Lightning McQueen in Radiator Springs as he prepares his academy of student racers for the Race-O-Rama competition. Lightning finds out that Chick Hicks has his own set of academy student racers who don&#39;t always compete fairly. These student racers are preparing to race in the same competitions in order to propel Chick Hick&#39;s academy to the #1 spot. The races take place at various tracks from the beaches, into the cities and off to the Baja desert. Along the way, racers are upgrading their abilities and customizing their look. The finale consists of a fully modified, ultimate Lightning McQueen racing against a fully modified Chick Hicks for the Race-O-Rama trophy. Let the race begin!<br />\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service &amp; playstationnetwork.com/privacy-policy). One time license fee entitles play on up to 2 PlayStation® 3 systems activated by this account.<br />\nCars Race-O-Rama</p>", "metacritic": 58, "released": "2009-10-12", "tba": false, "updated": "2023-08-31T00:47:50", "background_image": "https://media.rawg.io/media/screenshots/a40/a40fa5436dda847cde5e108c21607ff4.jpg", "website": "http://www.playthq.com./us/game/5322/Cars+Race-O-Rama", "rating": 3.88, "rating_top": 4, "added_by_status": {"owned": 8, "beaten": 6, "toplay": 1, "dropped": 3, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 8, "suggestions_count": 333, "game_series_count": 0, "reviews_count": 8, "platforms": ["Nintendo DS", "PlayStation 2", "PlayStation 3", "Wii"], "developers": ["Disney Interactive Studios", "Incinerator Studios"], "genres": ["Racing", "Arcade"], "publishers": ["THQ"], "esrb_rating": "Everyone 10+"}