{"id": 237040, "slug": "world-kitchen-fever-cooking", "name": "World Kitchen Fever Cooking", "name_original": "World Kitchen Fever Cooking", "description": "Are you a big fan of cooking? Want to be a super chef ?<br/>World kitchen fever is an addictive restaurant management game with a fast and fun cooking &amp; serving customers game play. Become a Super burger &amp; Italian master chef in this new food culinary fever mania.<br/><br/>Chef Jennifer will teach you how to cook tasty desserts with Fast Food to an Italian Restaurant. You will be able to cook and learn a variety of settings and cooking techniques. Use the best organic ingredients to cook amazing dishes.<br/>Enjoy all the kitchen upgrades from hotdog pans to tortellini cooker.<br/>Earn money to upgrade your kitchen and tools in this awesome restaurant management game!<br/><br/>New restaurants features:<br/>-\tBake, grill, and serve dishes by using a simple CLICK and PLAY <br/>-\tEndless cooking joy and kitchen scramble<br/>-\tPlay 110+ different levels with increasing missions’ requirements<br/>-\tMama Mia! Don't forget about pizzas. You'll love baking pizza too!<br/>-\tStart your pizza restaurant game with various pizza recipes.<br/>-\tServe fresh burger &amp; hot dog with tomato and lettuce<br/>-\tUnlock new exciting restaurants namely Italian restaurant, Fast food shop, etc and quality food ingredients<br/>- Dash through service to earn big tips <br/>-\tFeed the hungry customers with the tips of your fingers.<br/>-\tCook fast with the Time Saver Boost or go organic for more tips<br/>-\tNew levels added regularly<br/>-\tScramble through minimum score to earn top tips<br/>-\tNo Wi-fi needed! <br/><br/>In World kitchen fever, you are a world renowned burger &amp; Italian chef hired to make yummy food. Super chef can level up, expand their restaurant empire to include upcoming Mexican burrito joint, Chinese Noodle shop and Sushi Restaurant!<br/><br/>You will love the engaging and addictive Food Court challenge in World Kitchen Fever. This new master chef game is specially designed to test and improve your time management skills as a Master chef. Sharpen your skill as you prepare, cook, assemble and serve delicious menu items in each exotic restaurant.<br/><br/>Download World Kitchen Fever NOW! Build your restaurant empire with your time management skills and burger &amp; pizza making in the all new restaurant game. After playing the game, you will be the best star chef in town &amp; your mama will be impressed!<br/><br/>UPDATE: Ever wonder how to stir fry a Chinese noodle and fried rice? <br/>Do you have what it takes to stir fry a Chinese style egg-noodles in front of your customers with selected toppings, meat &amp; sauces?<br/>Another 40 levels of Chinese cooking craze are added to the existing game. Now you can:<br/>-Cook delicious noodles and rice.<br/>-Learn Stir frying and wok cooking experience", "metacritic": null, "released": "2017-08-25", "tba": false, "updated": "2019-10-22T13:48:40", "background_image": "https://media.rawg.io/media/screenshots/56f/56f0973c037685455ebd6b0a25ec5fa7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 203, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "macOS"], "developers": ["Play Spirit"], "genres": ["Family"], "publishers": ["Play Spirit"], "esrb_rating": null}