{"id": 237096, "slug": "mxgp-motocross-rush", "name": "MXGP Motocross Rush", "name_original": "MXGP Motocross Rush", "description": "Challenge and beat your opponents in the MXGP Motocross Rush championship, move your bubblehead in the most fun and exciting physics-based racing game.<br/><br/>MXGP Motocross Rush transforms you into a rider in the official MXGP motocross championship. Win every challenge to beat the official champions, will you be able to defeat the competition? Throw down the gas but cross the finish line with a supercool outfit, your look counts!<br/><br/>PHYSIC ARCADE GAMEPLAY Run on a track full of jumps, balance the weight of your rider, over the gorges and fly, however pay attention on landing, you could hurt yourself!<br/> <br/>CUSTOMIZATION Win the lootboxes to earn new parts of your bike and new accessories for your rider, upgrade the various customization cards, now you are a champ.<br/><br/>MULTIPLAYER Bravo, you have defeated the official riders, congratulations ... but you will be able to beat the MXGP Motocross Rush champions from all over the world?!?!?! We'll see!<br/><br/>- Official riders and motorcycles of the MXGP championship, play against your myths from MXGP and MX2 classes and beat their times;<br/>- Enhance the statistics of your bike and suits: besides being beautiful, you will also be the fastest;<br/>- Engaging career mode: collect your goals to become the MXGP Motocross Rush Champion;<br/>- Trick Mode: not only speed, grip and acceleration, remember that in some challenges you will be assessed for your acrobatic skills, learn how to handle your giant head weight and become the champion of tricks!<br/>- Each victory has a prize: more than 200 items to make your bike and your rider to look unique, many other collectables on the way;<br/>- Multiplayer Challenges: Beat players from all over the world to increase your \"Newbie\" fame until you reach the \"Epic\" level.<br/> <br/>Supported languages: English, French, German, Spanish, Italian, Portuguese, Brazilian Portuguese, Spanish South-America and Russian<br/> <br/>The game is compatible with devices with iOS 10 and above.<br/> <br/>Download for free today and start playing!", "metacritic": null, "released": "2018-09-26", "tba": false, "updated": "2019-08-02T03:12:27", "background_image": "https://media.rawg.io/media/screenshots/9d0/9d0fdd27a7fc5c47d5ae45c5248e939f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 376, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Milestone"], "genres": ["Sports", "Racing"], "publishers": ["Milestone"], "esrb_rating": null}