{"id": 237063, "slug": "destined-to-love", "name": "Destined to Love", "name_original": "Destined to Love", "description": "In Japan, the dawn of a new era was approaching.<br/><br/>You find yourself suddenly snatched from your peaceful life in modern days to a different time, and a landscape unlike you've ever seen. Caught in the center of revolution, which side will you choose? Even if for a mere moment, whose arms will you find sanctuary in? Your romance awaits you in the past. Do you believe in destiny?<br/><br/>Destined to Love is a dynamic love simulation/otome game where you get to be a part of history! Set in feudal Japan, experience a vibrant and exciting world filled with samurai, shogun and sword fights! Woo the hearts of 13 hot heroes, each with striking personalities and compelling stories! Receive 5 free Chapter Tickets each day to progress through the story! Free to download! Play now and experience a romance of the ages!<br/><br/>■Collect Goregous Illustrations!<br/>With each character route, you receive 3 beautiful illustrations of your guy that will suck you right into his story! You can also recieve illustrations through special in-game events!<br/><br/><br/>■Cute Avatars for Every Girl to Enjoy. Dress Up Your Guy As Well!<br/>Experience more interactive otome gameplay with the in-game avatars!<br/>Extravagant kimono, beautiful Japanese rooms and gardens, and cute accessories all await you in this game.<br/>Collect hundreds of attire pieces to adorn your avatar. Limited edition attire pieces are constantly being added so that you can always stay up to date with the latest trends! Characters from the story are also available as avatars!<br/>Dress up your love interest for the perfect day out together.<br/><br/>■Shape Your Own Destiny through the Choices You Make!<br/>In Destined to Love, there are multiple endings available for each guy depending on the choices you make in the game. If you get enough points you might even receive a special epilogue with your one true love! Which happy ending awaits you? Play to find out!<br/><br/>■Enjoy In-Game Story Events for a New Experience with Your Guy!<br/>Destined to Love holds many free Story Events that require no Chapter Tickets to continue reading! Play to experience exciting mini stories outside of the main story. Get into new situations with your favorite guys, and clear endings to get bonus items and attire pieces!<br/>Team up with your friends to clear the events faster and get every event ending!", "metacritic": null, "released": "2015-10-29", "tba": false, "updated": "2019-07-29T17:29:23", "background_image": "https://media.rawg.io/media/screenshots/bdb/bdb459e194d6d74ca772a10797fd6f47.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 284, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["CYBIRD Co"], "genres": ["Adventure", "Simulation"], "publishers": ["CYBIRD Co"], "esrb_rating": "Teen"}