{"id": 23712, "slug": "the-island-of-eternal-struggle", "name": "The Island of Eternal Struggle", "name_original": "The Island of Eternal Struggle", "description": "No face? No problem.<br/><br/>A soldier flees a secluded island controlled by powerful deities, consumed in an endless war with one another. Ian sets out for a peaceful life, but soon finds out his past can't be escaped so easily. The war catches up with him and threatens the entire planet. With the world's balance at stake, he teams up with others--fighting their past to restore peace at any cost.<br/><br/><br/>The Game<br/><br/>A faceless soldier, a warrior, a cyborg, and an oracle... while it may sound like an introduction to an awkward bar joke, it's not. It's the cast of The Island of Eternal Struggle--a 2D turn-based RPG developed by Wimbus Studios. The game places heavy emphasis on battle-system interaction, deep character-class customization, and a rich storyline with humor and depth.<br/><br/><ul><li> Classic turn-based RPG gameplay, but with unique and exciting \"action commands\"--enabling interactive and fast-paced combat sequences.<br/></li><li> Job class based character growth. Final game will include 24 different jobs such as Templar, Discomancer and Booze Hound and 500 different skills and abilities.<br/></li><li> A unique \"Soul Slot\" system, allowing each character to have a different loadout of skills and combat bonuses.<br/></li><li> 2D visual style inspired by the classics.<br/></li><li> A lovingly crafted soundtrack with styles as diverse as it's instrumentation.<br/></li><li> Mini-games? Of course!<br/></li><li> Unconventional enemies--from adult mutant turtles and balding eagles, to bears on roller-blades wielding switchblades.<br/></li><li> If you want to save, talk to a hobo.</li></ul>", "metacritic": null, "released": "2017-06-06", "tba": false, "updated": "2019-08-28T22:06:56", "background_image": "https://media.rawg.io/media/screenshots/2b5/2b5d7efb712368e71c2269762cf18468.jpg", "website": "http://www.wimbusstudios.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 198, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Wimbus Studios"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["Wimbus Studios"], "esrb_rating": "Everyone"}