{"id": 237401, "slug": "ship-captain-mate-crew", "name": "Ship Captain Mate & Crew", "name_original": "Ship Captain Mate & Crew", "description": "Ship Captain Mate &amp; Crew is a classic dice game. We have also included Fleet, our multi-ship variant of the original. Totally free. No in-app purchases.<br/><br/> - The first die is the Ship and needs to be a 6.<br/> - The second die is the Captain and needs to be a 5.<br/> - The third die is the Mate and needs to be a 4.<br/> - The remaining two dice are Crew.<br/><br/>The dice must be filled in the order Ship, Captain, Mate then Crew.<br/><br/>Both games can be played against the computer or Pass-and-Play (PnP) versus another human.<br/><br/>CLASSIC RULES:<br/>You get three rolls of five dice. You score one point for every point on the dice assigned to crew. If you fail to get a Ship then Captain then Mate you will score no crew.<br/><br/>The game lasts four rounds.<br/><br/>FLEET RULES:<br/>You get three rolls of five dice to populate three Ships. Unlike the classic game each roll is five dice even after you assign dice to a Ship.<br/><br/>On each roll:<br/>    - If you assign at least one Ship, Captain or Mate you get one free roll.<br/>    - You can sail, but only after you have increased the Crew count by at least one.<br/><br/>When you sail you score the Crew you have accumulated thus far and then your opponent gets a turn.<br/><br/>If you have no more rolls and cannot sail you will be forced to Scuttle. When you Scuttle you score zero, lose your turn, and the Crew hang around for your opponent to score.<br/><br/>The game lasts four rounds.", "metacritic": null, "released": "2015-03-03", "tba": false, "updated": "2019-10-22T14:16:30", "background_image": "https://media.rawg.io/media/screenshots/414/4140daba0f69600cfc028978ac549ef4_6Iuaz1f.jpg", "website": "http://mmpapps.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 74, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["MmpApps"], "genres": ["Strategy", "Card"], "publishers": ["MmpApps"], "esrb_rating": null}