{"id": 237476, "slug": "arms-road-2-bagration-lite", "name": "ARMS ROAD 2 Bagration Lite", "name_original": "ARMS ROAD 2 Bagration Lite", "description": "Roars of irons returned back to the Eastern Front!<br/>The second series of \"ARMS ROAD Eastern Front\".<br/><br/>********************************************<br/><br/>It is the realistic defense game that imaged the Eastern Front of World War II.<br/><br/>New systems are added to improve game characteristics, with the refreshing bombardment action.<br/><br/>New weapons are added to both forces.<br/>The war \"ARMS ROAD II Bagration\" outbreaks now!<br/><br/>********************************************<br/><br/>The differences between the lite version and the full version:<br/>- The lite version has 12 stages, whereas the full version has 50 stages.<br/>- You can collect all the achievements in the full version.<br/>- No advertisement on the full version.<br/><br/>********************************************<br/><br/>[[ War situation ]]<br/><br/>In 1944, a fierce battle between the German armed forces and Soviet Union force is developed on the huge Russian field.<br/><br/>\"Operation Bagration\" has begun in the summer by the Soviet Union force.<br/><br/>Against the Soviet Union force with the overwhelming amount of resources, the only option left for the German force is to defend the place with the help of a little reinforcement.<br/><br/>The Eastern Front was collapsing in many places, and the defeat of Germany was going to be determined.<br/><br/>With this war situation, you must make full use of limited war potential and defend the position of the German armed forces.<br/><br/>********************************************<br/><br/>[[ Tactics ]]<br/><br/>It is necessary to utilize the power of the tanks and the self-propelled guns effectively to defend the position.<br/><br/>Destroy enemy tanks by AP bullets (Armor Piercing).<br/>There is no effect to use the machine gun or HE bullets (High-Explosive) against thick armored tanks.<br/><br/>HE bullets (High-Explosive) are effective against enemy foot soldiers.<br/>Sweep the enemy who approached the position with the machine gun.<br/><br/>The offence of the Soviet Union force is reinforced each day, but you can get powerful new weapons when you survive.<br/><br/>You can prevent the march of Heavy Armed tanks by setting powerful tanks.<br/><br/>Low power tanks may be used to stop the heavy tanks by shooting from short distance.<br/><br/>Ascertain distance to be able to fire through the armor of the enemy.<br/><br/>Find the distance that you can fire through the enemy armor.<br/><br/>Enemy tanks aim our tanks too.<br/>You will lose your precious tanks when you don't destroy enemy tanks before they destroy us.<br/>Don't forget that the battlefield is always severe.<br/><br/>********************************************<br/><br/>[[ Organize the military unit ]]<br/><br/>The conduct of the position defense is left to you.<br/>Get powerful weapons by funds you won and organize tank corps.<br/><br/>You can fight with 4 corps at the same time.<br/>Each corps can have 4 tanks maximum.<br/><br/>You can't set different weapons in the same military unit.<br/>If you want to use a tank, organizes a military unit only by tanks.<br/><br/>********************************************<br/><br/>[[ Anti-crafts ]]<br/><br/>It is necessary to protect the position from the aerial bombardment of the air raider.<br/>Oppose them by setting anti-craft weapons in the position.<br/><br/>To change the weapon between the machine gun and the anti-craft weapon, switch the button on the lower left screen.<br/>Make sure you change to the antiaircraft gun when enemy planes come.<br/><br/>********************************************<br/><br/>We have provided new position to those of you fought well in \"ARMS ROAD Eastern Front\".<br/><br/>Let's fight till the end together.", "metacritic": null, "released": "2010-11-19", "tba": false, "updated": "2019-10-22T14:16:33", "background_image": "https://media.rawg.io/media/screenshots/752/7520ee30fbb428e78c7f17658e4c6fcb.jpg", "website": "http://www.snamiapp.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 200, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["sazanami"], "genres": ["Action", "Simulation"], "publishers": ["sazanami"], "esrb_rating": "Teen"}