{"id": 237462, "slug": "word-trace-mind-trainer-themes-2", "name": "Word Trace-Mind Trainer Themes", "name_original": "Word Trace-Mind Trainer Themes", "description": "Wanna try a new word game with themes? Would like to train your mind? Wonder how to kill time when you’re bored? Why not try this Word Trace? In this game, we show the clues and you find the hidden words! Think carefully for each swipe and solve it with right order and bricks. Sounds too easy? Then prove it!<br/> <br/>Before start, you may need some instructions:<br/>- SWIPE your finger horizontally, vertically and diagonally among mixing letters.<br/>- FIND the specific hidden words and clean the game board.<br/>- All words are relevant to the specific theme in each puzzle.<br/>- ALL LEVELS ARE SOLVABLE! If you get stuck in one level, try to restart or use hints.<br/> <br/>6 reasons you should get Word Trace:<br/>- FREE word game for all ages<br/>- DAILY puzzle for brain training<br/>- FRIENDLY interface for better game experience<br/>- 580 well-designed themes, similar with traditional crossword games, but more challenging!<br/>- SHARPEN your puzzle solving skills and keep your mind moving!<br/>- PLAY together with your family and friends to have even more fun.<br/>------------------------------------------------------------------------------------------<br/>It will get much harder as you level up, but we promise you will enjoy it, and your brain will experience a wonderful word journey!", "metacritic": null, "released": "2016-07-18", "tba": false, "updated": "2019-10-22T14:16:32", "background_image": "https://media.rawg.io/media/screenshots/0f8/0f8a73449c879e164ab7cf8dd5e59ff7.jpg", "website": "http://www.smartupinc.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 46, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["SMART UP"], "genres": ["Board Games"], "publishers": ["SMART UP"], "esrb_rating": "Everyone 10+"}