{"id": 237493, "slug": "jewels-heroes", "name": "Jewels Heroes", "name_original": "Jewels Heroes", "description": "The newest Match-3 game:Jewels Quest now available on Google Play for free.<br/>Fun and addictive game:Jewels Quest,is a game can be played by anyone,and you can expect the ultimate in explosive fun with jewels collecting!Your goals is to match the jewels until the board transparency.<br/>If you love Jewels games,Jewels Heroes is the perfect game for you!Try to get all stars in each level.Once you start,with satisfying and awesome visual effects,you can't stop!<br/>What's the difference with our other Jewel Heroes games:The gems can fall from the oblique direction in this game.<br/>Tips:Eliminate the jewels quickly can earn one blitz bonus,this will help you complete the levels quickly.<br/>- How to play?<br/>Touch the adjacent jewels to swap them.Make 3 or more with the same types together to eliminate them.Eliminate 4 or more jewels to gather special jewel. Match the jewels until the board transparency to pass the level.Try to get all stars in each level.Can you be the Jewels Star?<br/>- App Advice review: <br/>Cool music, beautiful graphics and effects, soothing and transcends above stress! Excellent!Best of all jewel games I have played!! Excellent graphics, makes you plan your strategy before you make the next move.<br/>- What users say:<br/>1.Very fun.If you are looking for a game that will occupy spare time, this is the one for you.<br/>2.AWESOME.Very addicted stayed up till 3 am.Time just flew by!!! Thanks for a GREAT FREE GAME!!!! BETTER THEN THE REST!!! <br/>- Features:<br/>1.lovely graphics,sweet sounds.<br/>2.Well-designed maps, to make the game more enjoyable and addictive.<br/>3.Share with your friends.<br/>4.Eliminate the jewels quickly can earn one more blitz bonus.<br/>5.Eliminate 4 or more candies to gather special jewels.<br/>We try our best to design the most interesting games,but there must be some place not good enough.If you have any suggestions please tell us.Your 5-star reviews or comments or suggestions of improved, is the best support for us.Thank you!", "metacritic": null, "released": "2016-01-10", "tba": false, "updated": "2019-10-22T14:16:35", "background_image": "https://media.rawg.io/media/screenshots/82a/82aac35a37a1ea20f676044e77244c8b.jpg", "website": "http://easygfm.blogspot.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 63, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Truong Nguyen"], "genres": ["Arcade", "Puzzle"], "publishers": ["Truong Nguyen"], "esrb_rating": "Everyone 10+"}