{"id": 237549, "slug": "the-martian-official-game", "name": "The Martian: Official Game", "name_original": "The Martian: Official Game", "description": "Based on the best selling novel and critically acclaimed film, The Martian is a real time, text based adventure game that tells the story of Astronaut Mark Watney who finds himself stranded on Mars.  Play as a NASA communications specialist and Mark’s sole contact with Earth in this riveting story of survival against all odds.  You choose the story path that will ultimately decide Mark’s fate.<br/><br/>-“The writing quality is paramount.  Ground control to Little Labs, you've really made the grade.” - EuroGamer<br/><br/>-“Mission Accomplished: compelling and efficient storytelling that draws you in for a moment then lets you get back to the real world.” - Gamezebo<br/> <br/>Accept your mission and BRING HIM HOME.<br/><br/>INCOMING…<br/>Communicate with Mark in real-time using the Ares III messaging system.  Guide him through crucial and difficult decisions to ensure his survival.<br/> <br/>DO YOUR RESEARCH<br/>Provide Mark with the right advice before time runs out.  Remember, science matters!  The wrong information could put Mark’s life in jeopardy.<br/> <br/>TRACK HIS PROGRESS<br/>Keep Mark healthy, safe and calm by keeping a constant eye on his real-time vitals on your Apple Watch.<br/> <br/>USE YOUR TEAM<br/>Provide Mark with life-saving information collected from a diverse team of experts you unlock along the way.<br/> <br/>CHOOSE A NEW PATH<br/>Your decisions affect the story outcome.  Play again, make different choices and experience different twists and turns.<br/><br/>PAY ONCE AND PLAY<br/>The Martian: Bring Him Home contains no in-app-purchases or ads.<br/><br/>Official Trailer:                 www.TheMartianGame.com<br/>Facebook:                      www.facebook.com/TheMartianOfficialGame<br/>Twitter:                           www.twitter.com/TheMartianGame<br/>Instagram:                      www.instagram.com/themartianofficialgame<br/>Support:                         martian-support@little-labs.com", "metacritic": null, "released": "2015-10-01", "tba": false, "updated": "2019-10-22T14:16:38", "background_image": "https://media.rawg.io/media/screenshots/298/29898ae1859290993dcb6b4360e32497.jpg", "website": "http://themartiangame.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 125, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Little Labs"], "genres": ["Adventure", "RPG"], "publishers": ["Little Labs"], "esrb_rating": null}