{"id": 237500, "slug": "blox-3d-world-creator", "name": "Blox 3D World Creator", "name_original": "Blox 3D World Creator", "description": "***Editor's Choice Award 2015, Children's Tech Review- 90% Rating<br/>\"...easy to use, powerful-feeling block building experience...\"<br/>\"....this app is well worth the download..\"<br/>www.childrenstech.com<br/><br/>\"...Both kids and adults can enjoy this open-ended app that promotes creativity and imagination!\"<br/>www.geekswithjuniors.com<br/><br/>\"...Blox 3D World Creator is part Minecraft, part piece of paper and pen -..\"<br/>www.pocketgamer.co.uk<br/><br/>Blox 3D World Creator lets kids create  beautiful worlds with simple taps, from giant windmills to craggy castles and desert islands teeming with life.<br/>Add animals, humans and birds which walk around and interact  to watch your world come alive! <br/>*Designed to develop children's creativity with hours of world building fun.<br/>*The worlds can be as simple as a deserted island or a teeming city...sky's the limit.<br/>*Control the lighting to change time of day or setting with night,day and water environments.<br/>*No sounds, scoring or virtual currency....just pure creative fun. <br/>*Animated animals ,windmills and people walking around and interacting makes an amazing miniature world.<br/>*Share your world creation videos on YouTube, Facebook and Twiter.<br/><br/>Based on the bestselling apps Blox 3D Junior and Blox 3D which have collectively been downloaded more than 200k + times since last year. This is the latest iteration in a series which has been featured on Itunes in 17 different countries on the Itunes home page for Creativity and part of the Learning Made Fun collections.", "metacritic": null, "released": "2015-04-02", "tba": false, "updated": "2019-10-22T14:16:36", "background_image": "https://media.rawg.io/media/screenshots/9c9/9c91d7c8a70eaf1b88ae94f734e6e47f.jpg", "website": "http://www.appymonkeys.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 110, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Arjun Gupte"], "genres": ["Arcade", "Casual"], "publishers": ["Arjun Gupte"], "esrb_rating": null}