{"id": 237574, "slug": "pai-gow-2-ad-free", "name": "Pai Gow 2 (Ad Free)", "name_original": "Pai Gow 2 (Ad Free)", "description": "Play 16 round games in 5 minutes.<br/>Fast, Fast, Super fast pace.<br/>Learn Pai Gow tiles in the most effective way<br/>Install this game and flip the tiles now<br/><br/>We have provided the list of scoring so you don’t have to remember all. Try to place your betting and win poker against AI in three in amazing locations around the world: Singapore, Las Vegas, Paris, and Macau casino.<br/><br/>Pai Gow is an awesome casino game that is different from other card games poker such as Texas hold em or pokies. If you love Las Vegas or Macau casino games, this is a perfect game for you, especially if you’ve never tried it before. Usually when we play some casino or gambling games, we can’t stop playing once we lose all of our free coins, but not on Pai Gow 2 Free.<br/><br/>HOW TO PLAY PAI GOW 2? <br/><br/>Each player (including the dealer) is given one stack of tiles and must use them to form two hands of two tiles each. The hand with the lower value is called the front hand, and the hand with the higher value is called the rear hand. If a player's front hand beats the dealer's front hand, and the player's rear hand beats the dealer's rear hand, then that player wins the bet. If a player's front and rear hands both lose to the dealer's respective hands, the player loses the bet. If one hand wins and the other loses, the player is said to push, and gets back only the money he or she bet.  We will provide the detail of the scoring and calculate the final points for you so you don’t have to worry about it. <br/><br/>===========================<br/>TOP FEATURES OF PAI GOW 2: <br/>===========================<br/><br/>Awesome game graphic with realistic casino environment. <br/>Choose your own Avatar to represent yourself on the card table. <br/>Rise through the rank as you winpoker and become pokerstars!  Conquer Macau casino, Singapore, Las Vegas, and Paris. <br/>Fun gameplay and simple control. Just place your betting and we will calculate the points for you.<br/><br/>Win Poker against AI. Play against 3 other AI players and win. <br/>Submit your score to the Leaderboard. Are you one of the top 20 players in the world? <br/><br/>So, are you ready to master Pai Gow now? We are usually familiar with classic card games poker like Pai gow poker so it’s refreshing to play new gambling game and place betting to win against AI.  If you like pai gow poker, you will also like Pai Gow 2.  Once you get a hang of it, you’ll conquer all the cities: Macau casino, Singapore, Las Vegas, and Paris, in no time!<br/><br/>This game is intended for an adult audience for entertainment purposes only. Success at social casino gambling does not reward real money prizes, nor does it guarantee success at real money gambling.", "metacritic": null, "released": "2017-01-02", "tba": false, "updated": "2019-10-22T14:16:40", "background_image": "https://media.rawg.io/media/screenshots/a79/a79ecce325010cf5ed70c4f46ea3c523.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 117, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Red Koda Software"], "genres": ["Board Games", "Card"], "publishers": ["Red Koda Software"], "esrb_rating": "Teen"}