{"id": 23752, "slug": "animal-crossing-new-leaf-welcome-amiibo", "name": "Animal Crossing: New Leaf - Welcome amiibo", "name_original": "Animal Crossing: New Leaf - Welcome amiibo", "description": "There's more to discover than ever before in the Animal Crossing™: New Leaf—Welcome amiibo game! This updated version of Animal Crossing™: New Leaf adds in support for all Animal Crossing series amiibo figures and cards. Tap these amiibo to invite the depicted villager to a new RV campsite, interact with them, and ask them to move into your town!\nIn addition, fifty new Animal Crossing series amiibo cards will launch on December 2nd, and you'll receive one random card with a purchase of this new packaged version. You can also tap select amiibo figures from other series to get items themed to the pictured characters! Check www.animal-crossing.com/newleaf for more details on compatibility. This is the perfect time to cozy up to the charm and creativity of this special game. New friends and new discoveries await every day. Express yourself by customizing your character, your house, and your town as you create your ideal world.\n\nYou can finally invite villagers to your town using amiibo™ accessories\nCustomize your character, your house, and your town as you create your ideal world\nContains a brand-new RV campsite where you can interact with villagers\nAnimal Crossing™: New Leaf – Welcome amiibo! packs in one random amiibo™ card", "metacritic": null, "released": "2016-12-07", "tba": false, "updated": "2022-10-19T03:31:08", "background_image": "https://media.rawg.io/media/games/7c9/7c9191d5edf98c3a09110bfc00cc03ff.jpg", "website": "http://www.animal-crossing.com/newleaf", "rating": 4.18, "rating_top": 4, "added_by_status": {"yet": 4, "owned": 6, "beaten": 12, "toplay": 3, "dropped": 9, "playing": 5}, "playtime": 0, "achievements_count": 0, "ratings_count": 16, "suggestions_count": 176, "game_series_count": 0, "reviews_count": 17, "platforms": ["Nintendo 3DS"], "developers": [], "genres": ["Adventure", "Casual"], "publishers": ["Nintendo"], "esrb_rating": "Everyone"}