{"id": 237614, "slug": "letters-and-numbers-game", "name": "Letters and Numbers Game", "name_original": "Letters and Numbers Game", "description": "Letters and Numbers was an famous Australian game show. This game is a great way for you to practice letter and number formation. <br/><br/>Letters Round :<br/>App chooses eight randomly chosen letters. There must be at least two vowels and six consonants.Then you have one minute to find the longest word that they can make out of these letters.<br/><br/>You will win with the longest word is awarded one point for each letter in the word. Proper nouns are not qualified during the Letters rounds.<br/><br/>Numbers Round :<br/>App chooses how many \"small\" and \"large\" numbers they would like to make up six randomly chosen numbers. Small numbers are between 1 and 10 inclusive, and large numbers are 25, 50, 75, or 100.  All large numbers will be different, so at most four large numbers may be chosen. You have to use arithmetic on some or all of those numbers to get as close as possible to a randomly generated three-digit target <br/>number within the one minute time limit. Fractions are not allowed—only integers may be used at any stage of the calculation.<br/><br/>You will get points as close as to the target number. Etc. you find approximately 2 close to to  target you will won 8 points. You will get 10 points when found complete solution only.<br/><br/>Properties:<br/>- Numbers round doesn't require internet connection.<br/>- Letters round require internet connection to check spelling.<br/>- You can select game round.(5/10/20 round)<br/>- You can display letters and numbers game statistics.<br/>- You can review numbers game rounds.", "metacritic": null, "released": "2018-02-07", "tba": false, "updated": "2019-10-22T14:16:40", "background_image": "https://media.rawg.io/media/screenshots/cf0/cf04345f8023e389dc1641d44ea399ef.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 59, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Coskun CAKIR"], "genres": ["Board Games", "Puzzle"], "publishers": ["Coskun CAKIR"], "esrb_rating": "Everyone 10+"}