{"id": 237705, "slug": "fidget-spinner-toy", "name": "Fidget Spinner Toy", "name_original": "Fidget Spinner Toy", "description": "Enjoy huge amount of the virtual Fidget Spinners - all absolutely free!<br/><br/>Boring on the meeting or lecture is too long for you? Then download this fun fidget spinner toy to relax, relief your stress and just to kill some time!  It is like a real fidget spinner, but even better! People around will not see it and will not hear it and you can easily enjoy it and calm you down!<br/><br/>What our players are saying:<br/><br/>RyderTGM: <br/>\"Very addicting! You choose a spinner and start spinning it! I just can't stop using it! It is like using a real fidget spinner!\"<br/><br/>DatBoiREAL862:<br/>\"Don't have a fidget spinner, get this! This game is amazing. If u age not aloud to have a fidget spinner or want a satisfying app, GET THIS.\"<br/><br/>Nik11998766:<br/>\"Amazing! To be honest this is the best app ever and it is better then a real spinner and I have recommended it to all my friends. I have spent many hours on this game and I plan to spend many more!\"<br/><br/>Caden Hawkins:<br/>\"This game is the best when I get bored. This helps me at home when I'm sad.\"<br/><br/><br/>MAJOR FEATURES:<br/>- All Fidget Spinners are FREE for you to try them out!<br/>- Huge collection of Fidget Spinners (120+ now) with regular updates!<br/>- Great different background themes to match with any Fidget Spinner!<br/>- Angular dumping adjustment parameter to spin short or long time!<br/><br/>HOW TO PLAY:<br/>- Select any Fidget Spinner you like<br/>- Rotate it in any direction, fast or slow<br/>- Select any background theme to get best much for your favourite spinner<br/>- Play with angular dumping parameter to simulate different spinning friction<br/>- Make infinite rotation by moving angular dumping slider most to the left<br/><br/>DO NOT WAIT! DOWNLOAD THIS APP FOR FREE NOW!", "metacritic": null, "released": "2017-05-11", "tba": false, "updated": "2019-08-05T08:03:18", "background_image": "https://media.rawg.io/media/screenshots/15f/15f847ac0e63117a1151e7a0627e6956_exVrF8c.jpg", "website": "https://itunes.apple.com/us/developer/www-hobbyapps-com/id412491567?mt=8", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 67, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["www.HobbyApps.com"], "genres": ["Action", "Sports"], "publishers": ["Edvard Arutyunyan"], "esrb_rating": "Everyone 10+"}