{"id": 237771, "slug": "hammurabi-the-game", "name": "Hammurabi, The Game", "name_original": "Hammurabi, The Game", "description": "Hammurabi, The Game, is our tribute to a classical computer game. The original game (called Hamurabi, due to limitations of the original hardware in the lenght of names) was the ancestor of strategy and resource management games and was completely text based. The iPhone version is enhanced with graphics (and sound effects) and sliders for input management. Moreover, some additions were introduced to game mechanism to improve longevity. It's also possible to play with the original version initial resources parameters.<br/><br/>The game's goal is simple. You’re given a kingdom to rule over by managing land and grain resources. In each turn you can buy and sell land for grain, you can allocate grain for your people and use the rest of the grain to plant your land.<br/><br/>To succeed, you must successfully balance population demands with available crops. You must achieve this task while trying to stave off random occurrences such as the plague and the ever-present rat problem.<br/><br/>Through trial and error you can find the optimal balance. Govern well and receive the accolades of your people. Govern poorly and you'll be responsible for the deaths of many...<br/><br/><br/>The game is also available for your iPad and Mac!<br/><br/><br/>Thanks for using our products. Feedback is always welcome to: support@dighentis.com<br/>App Store reviews are greatly appreciated, thank you.", "metacritic": null, "released": "2010-09-18", "tba": false, "updated": "2019-07-30T05:30:28", "background_image": "https://media.rawg.io/media/screenshots/d79/d79239b4dd8342ed6f8f2f27518bf9fb.jpg", "website": "http://www.dighentis.com/applications.htm", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 127, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Alessandro Benedettini"], "genres": ["RPG", "Strategy"], "publishers": ["Alessandro Benedettini"], "esrb_rating": "Everyone 10+"}