{"id": 237765, "slug": "rotate-2-learn-hd-full-free-christmas-edition-puzz", "name": "Rotate 2 Learn HD – Full FREE Christmas Edition Puzzles", "name_original": "Rotate 2 Learn HD – Full FREE Christmas Edition Puzzles", "description": "Play with your family and friends with an original new kind of circular puzzles! Spin the wheels, find the correct solutions, read and learn the words! Try it now, it’s FREE! It’s a really fun experience for kids and people that love puzzles!<br/><br/>It will be surely the favourite game for your family to play at Christmas!  …don't miss it!<br/><br/><br/>Some features:<br/>* More than 60 puzzles to solve with 3 different image sets!<br/>* Two difficulty levels. A “shuffle mode” option to play the puzzles in a random sequence.<br/>* Automatic auto-save mode. Replay from the last solved puzzle for each set.<br/>* Expressly and exclusively designed for the iPad with use of the finger touch features to control the game.<br/>* Playable for everybody and anybody! It's fun for all ages! The perfect game for your family!<br/>* Very simple design, ideal for our kids. Simple and immediate user interface, specifically designated for this purpose.<br/>* Beautiful HD graphic, with exciting vibrant colors.<br/>* English and Italian languages supported.<br/><br/>“Rotate 2 Learn HD - Christmas Edition” includes the 3 sets of puzzles completely dedicated to Christmas theme.<br/><br/><br/>**** If you like puzzle games download “Rotate 2 Learn” now... you’ll adore it! ****<br/><br/><br/>Thanks for using our products. Feedback is always welcome to: support@dighentis.com<br/>App Store reviews are greatly appreciated, thank you.", "metacritic": null, "released": "2011-12-08", "tba": false, "updated": "2019-10-22T14:05:47", "background_image": "https://media.rawg.io/media/screenshots/2a4/2a473bdc736905bd43acc5f410f27e6e.jpg", "website": "http://www.dighentis.com/applications.htm", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 129, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Alessandro Benedettini"], "genres": ["Action", "Board Games"], "publishers": ["Alessandro Benedettini"], "esrb_rating": "Everyone 10+"}