{"id": 237873, "slug": "block-ball-arcade", "name": "Block Ball Arcade", "name_original": "Block Ball Arcade", "description": "On the lookout for the next challenging mind puzzles? Try BlockBall, the newest drop the ball, line drawing game with a twist! This is not a typical line drawing puzzle ball, but more fun and addictive. The concept is similar but the gameplay and movement of the puzzle ball is a bit different. We keep innovating and creating new brain teasing puzzles for gamers who love this genre. You should try it out and you will have so much fun solving every mind puzzles in BlockBall!<br/><br/>BlockBall – Brainiac Physic Drop Mind Game Puzzle is an intriguing and addictive brain game for adults &amp; problem solving game. It’s great for people who always challenge themselves to solve puzzles. The rule of this cool puzzle is pretty simple: Draw a line to make the ball moves according to the law of physic. It will bounce if it meets an obstacle. Make the ball hits the floating balls to drop them down but don’t let it touch the triangles. It’s certainly a challenging brain games for adults, though many kids have also successfully finish all the levels. If you are someone who always on the lookout for newest brain teasing puzzles, we are sure you’re going to love this cool puzzle! <br/><br/>O----------------------------------------------------------------------------O <br/>BEST FEATURES OF BLOCKBALL – MIND PUZZLE BALL GAME: <br/>O----------------------------------------------------------------------------O <br/><br/>•\tA challenging but fun problem solving game for adult and kids. <br/>•\tA realistic brain teasing puzzle that follows the law of physic. <br/>•\tGreat, upbeat music &amp; sound effects to accompany you play &amp; stimulate your brain.<br/>•\tSimple, minimalist graphic design <br/>•\tUser friendly and smooth gameplay<br/>•\tSimple game rule: draw a line to direct the main ball and knock off the floating balls. <br/>•\t50 Levels to beat (and upcoming 75 levels!)<br/>•\tNever get stuck – play another level even though you haven’t solve puzzle in the previous level. <br/><br/>How to Play BlockBall:<br/><br/>1.\tWhen you enter a level, you will see floating balls, bars / blockers, and dangerous objects like red triangle and pulsing circles.<br/><br/>2.\tYour mission is to knock of the floating balls (the blue hexagons) and avoid the dangerous objects.  If you touch the dangerous objects, your main ball will evaporated and you will fail. <br/><br/>3.\tTo do that, you have to draw a line by swiping your finger on the screen to move the main puzzle ball to that direction. It will move and bounce against the bars/ blockers according to the law of physic, and it will drop the balls / hexagons in its path. <br/><br/>4.\tYou have to knock off all the blue hexagons to complete a level. <br/><br/>5.\tUnlike other line drawing game, you only have 1 move on every level! You can only draw a line ONCE!<br/><br/>There is no limit to how many times you can try to solve puzzle. You might be able to solve it on the first try, second try, or maybe on your 101th try.  Never give up and keep playing! <br/>Note: although this is a brain game for adults, it has no inappropriate content so you can download this cool puzzle for your kids too!", "metacritic": null, "released": "2017-12-05", "tba": false, "updated": "2019-10-22T14:16:45", "background_image": "https://media.rawg.io/media/screenshots/d4d/d4db86688944850a7ed1e4c68e3cc044.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 9, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Abel Galvan"], "genres": ["Arcade", "Casual", "Puzzle"], "publishers": ["Abel Galvan"], "esrb_rating": "Everyone 10+"}