{"id": 237993, "slug": "prison-escape-sniper-duty-2018", "name": "Prison Escape Sniper Duty 2018", "name_original": "Prison Escape Sniper Duty 2018", "description": "Try Prison Escape Sniper Duty: Jail Break Missions game in 3D!\u2028\u2028In this first person sniper game you have to rescue your fellow inmates. It’s your duty to let them escape from dark prison.\u2028<br/><br/>Are your marksman skills good enough to make a breakout happen? As the sniper shooter you will lay down low and shoot the prison guards one after another.\u2028To be sure you will breakout your fellow inmates you have to become the ultimate sniper in prison breakout sniper escape. Zoom in on the guards, aim on their heads or bodies and pull the trigger. Aim your sniper rifle on the right guard if not the other prison guards will notice the inmate and shoot him down.<br/><br/>\u2028\u2028You spent some hard time with punishment in this jail. You manipulate warden, bribe security guards whatever it takes but you managed escaping from prison. Now it’s time to help your lockdown cell inmates, thief and robbers to get out of this notorious prison. Your life mission is to help your cellmates, prisoners and transport them out of jail without getting caught.<br/><br/>\u2028\u2028Look around and make the right decisions otherwise your friend will not escape from prison. So become the elite marksman en snipe every guard on the prison ground.<br/><br/>\u2028\u2028Prison Escape Sniper Duty: Jail Break Missions 3D FEATURES:<br/><br/>\u2028\u2028- Challenging prisoner escape and police chase adventure<br/>\u2028- Super-fast game with smooth controls\u2028<br/>- Action packed challenging missions<br/>\u2028- Amazing 3D environment\u2028-Stunning &amp; High Quality 3D Graphics<br/><br/>Prison Escape Sniper Duty: Jail Break Missions 3D is free, So start adding your confirmed kills! <br/><br/>\u2028Hope you will enjoy!", "metacritic": null, "released": "2017-02-09", "tba": false, "updated": "2019-10-28T03:27:35", "background_image": "https://media.rawg.io/media/screenshots/d1f/d1f98e8933cef1c4181344aa80388cac.jpg", "website": "https://www.facebook.com/fiveriversolutions/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 168, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Syed Usman Ali Shah Gillani", "Five River Solutions"], "genres": ["Action"], "publishers": ["Syed Usman Ali Shah Gillani", "Five River Solutions Private"], "esrb_rating": "Mature"}