{"id": 237909, "slug": "construction-sim-games-2018", "name": "Construction Sim Games 2018", "name_original": "Construction Sim Games 2018", "description": "Welcome to the Best construction building bridge simulator or construction games 2018 with more fun of construction city crew and construction jobs in construction zone. If you have a mind of constructing and building stuff then this off road construction-city construction games 2018 is here with new and challenging task among the best carpenter games or construction games. Join house construction games or highway tunnel construction games because the ultimate machine world simulator will give you the flexibility to design and construct the house building games or build the house on your dream location. You are able to construct a building with leading construction city crew and use all the tools required for house or bridge best construction games. Let your imaginations work on off road construction: city constriction 2018 games or construction building bridge simulator games for construction zone. You must have played a lot of building construction games, underground construction games, highway tunnel construction games, bridge construction games, city building games and town craft games but this city construction games 2018 is one of the kind with the detail-oriented construction experience. We will give you the actual experience of road construction or new city builder game and help you build the town ship. <br/><br/><br/>The Off-road City Building Construction Games 2018 is known as house building craft games is filed with substandard construction site games but we give you a new flavor for multiple construction vehicles such as sand excavator, crane operator, construction heavy duty truck and cement truck driving games. You are given a plane construction site and all the necessary construction material you have to use the multiple construction vehicles such as sand excavator, crane operator, and construction truck and heavy-duty truck games to design and construct the house, building or city of your dream. Grab your construction tools and come over construction zone &amp; operate heavy machinery in construction simulator. Extraordinary driving skills are needed to operate heavy crane, excavator crane, cement mixer, heavy loader simulator, bulldozer simulator, heavy tractor simulator in this farming simulator. Unlike other city builder games, House construction games, tunnel construction games, home builder games this Road construction new city builder game will provides you a new experience of city construction in a construction game. You being a city building will enjoy the house construction as well as experience the railway track train games and underground construction games with the carpenter simulator games skills <br/><br/>In this free Off-road City Building Construction Games 2018 or construction vehicle drive game practice your driving skills today in new city road builder 3d games. Like House construction games, bridge construction, doll house, tunnel construction, this off-road construction city will give you amazing experience with construction vehicles simulator in machine world. Operate the heavy machines with precise driver skills, repair the road builder and avoid accidents.<br/><br/><br/>Features<br/>-\tJoin best construction city crew in construction games<br/>-\tUltimate construction jobs in construction games 2018<br/>-\tDrive &amp; operate construction vehicles <br/>-\tOperate heavy machinery and learn driving skills<br/>-\tExperience under construction or construction truck games<br/>Download fun for free!", "metacritic": null, "released": "2018-03-29", "tba": false, "updated": "2019-10-28T03:27:12", "background_image": "https://media.rawg.io/media/screenshots/6fe/6fe9933dc4c9af458e2e352a2b008a71.jpg", "website": "https://www.facebook.com/fiveriversolutions/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 98, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Syed Usman Ali Shah Gillani", "Five River Solutions"], "genres": ["Simulation", "Racing"], "publishers": ["Syed Usman Ali Shah Gillani", "Five River Solutions Private"], "esrb_rating": "Everyone 10+"}