{"id": 237989, "slug": "flying-dragon-simulator-2017", "name": "Flying Dragon Simulator 2017", "name_original": "Flying Dragon Simulator 2017", "description": "Flying Dragon Attack 2017 in Dragon Kingdom, new game 2018!  The top &amp; best Dragon simulator is here.<br/>Dragon Simulator is game for those how likes to play simulation games of superhero giant monster animals for real pleasure. In this flying dinos game you don’t have to dragon race or train your dragon like other free dragon games. In this ultimate fire dragon game you enjoy many simulation experiences in one complete package. Control your destiny as you become a dragon master and live the life of a angry dragon as Flight dragon in castle simulator. Explore battle, conquer and rule the skies with your dragon in this epic dragon caves, new game 2018. This beautiful Super hero flying dragon game has combine power of strength and fire power. This flying dragon simulator 2018 is one of the best dragons attack games with advance dragon fly controls and ultimate dragon hunting missions. Now you can play the fire dragon games without internet at any place in this infinite dragons collection. So download this free dragon game 2018 and have fun while riding a real dragon simulator. <br/>Take your Mighty dragon up in the high skies, rain the fire from breathing fire dragon and destroy castles &amp; villages. Take Control of the Jurassic monster and be a wild angry Dragon to attack other animals and humans. Just like animal simulator games, best dragon simulator game has all the unique and astonishing game features which you are willing to play. So enter the world of magic and fantasy and be the king of Dragon kingdom in this flight dragon 3d game.<br/>In this Jurassic Rampage monster strike game the wild Dragon has arrived in the Amazon Forest as well as in ancient city for destruction and rampage. In Rampage 2018 Simulator there are multiple dragons collection that Attack Wild animals like Wild Crocodile, Angry Wolf, Giant Rhino, Pig, Crazy Stag, Angry Monster and many others. Frenzy monster screams and smash Jurassic city also. Let all the myths and stories come alive with this exciting simulation game 2018.<br/>Check your energy and a health indicator, if one of them drops, your chances to survive here would fell too. This new Dragon game gives you a chance to rage your anger in an easy way without making any Destruction in real world. This Deadly dragon 3D enter into the animal rampage and hunt animals, castle attack and city in Castle simulator. Being an ultimate dragon 3d warrior, you are the powerful beast and having strong hunting powers in Dragons’ kingdom. Feel the real thrill of Dragon attack and kill the wild animals, Save the beautiful queen in castle. Play the new game 2018 of mighty Dragon Warfare, war of Thrones and the game of thrones in a single simulation.<br/>Download this Dragon 3D city Flying Simulator Game today and play for free!<br/>Game Features:<br/>• 5 different types of 3D Monstrous Dragons for you to control and fly<br/>• More than 20 thrilling dragon flight missions to master your dragon flying skills<br/>• Different types of mode Selection<br/>• Stunning HD Graphics<br/>• Realistic dragon animations<br/>• Unlock more Dragons to fly in sky", "metacritic": null, "released": "2017-09-01", "tba": false, "updated": "2019-10-28T03:27:27", "background_image": "https://media.rawg.io/media/screenshots/2d9/2d9f9b5290ef6873f9c9f2f0581d5046.jpg", "website": "https://www.facebook.com/fiveriversolutions/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 183, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Syed Usman Ali Shah Gillani", "Five River Solutions"], "genres": ["RPG", "Simulation"], "publishers": ["Syed Usman Ali Shah Gillani", "Five River Solutions Private"], "esrb_rating": "Teen"}