{"id": 237935, "slug": "deer-hunting-2017-pro-ultimate-sniper-shooting-3d", "name": "Deer Hunting 2017 Pro: Ultimate Sniper Shooting 3D", "name_original": "Deer Hunting 2017 Pro: Ultimate Sniper Shooting 3D", "description": "2017 Deer hunting season is open!<br/><br/>It’s almost the season of hunting games especially the season of deer hunting nowadays. As a killer aim the largest and most severe animals in the Jungle. This is surprising greatly causing amusing game that take you to a finest risk in the most naturalistic surroundings including trees, grass, and snowy mountains. It’s time to observe your prey in wild with in jungle hunting. Hound deer and other wild animals in this sniper shooting game. Snipe your different hunting convenience. Freight them and move yourself to search the deer and other wild animals for hunting. In this hunting season you will be able to shoot out the wild animals.<br/>Let’s go hunting with Jungle Deer Hunting Adventure 2017. This is an amazing and addictive action game to take you to an ultimate adventure in the most realistic environment with trees, grass and snowy mountains. Those who love the hunting game will love this first person shooter sniper game. All you have to do is, grab your sniper rifle and go hunting the Deer's in jungle. So, let’s go hunting in the real jungle wilderness environment. The deer might be unaware of your presence so give your best shot and take as many Deer's home as you can.<br/>You will see the most amazing Different Hunting Season scenes in the game, sound of weapon, mountains and animals.<br/><br/><br/>Features: <br/>• Hilly and mountains Environment.\u2028<br/>• Exciting New 30 Levels.\u2028<br/>• Three Different Modes.\u2028<br/>• Efficient Gun Control.\u2028<br/>• A comprehensive 3D game with Console quality graphics.\u2028• Slow motion bullet action camera to hunt the deer.\u2028<br/>• Crazy Addictive Game Play.", "metacritic": null, "released": "2017-01-13", "tba": false, "updated": "2019-10-28T03:27:25", "background_image": "https://media.rawg.io/media/screenshots/fe6/fe619cba5340361f7955df1467497fcb.jpg", "website": "https://www.facebook.com/fiveriversolutions", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 133, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Syed Usman Ali Shah Gillani", "Five River Solutions"], "genres": ["Action", "Adventure"], "publishers": ["Syed Usman Ali Shah Gillani", "Five River Solutions Private"], "esrb_rating": "Mature"}