{"id": 237962, "slug": "police-attack-tank-shooting", "name": "Police attack tank shooting", "name_original": "Police attack tank shooting", "description": "Police attack is a real tank shooting game allows you to experience the most challenging police chase on the road. Tank shooting is a convenient and sensitive operation of attack shooting game. Police car real perspective, allowing the player to experience the real tank shooting. Here, you will face the deadly police attack, you have to do is wipe them out.<br/> <br/>You must have played many adventurous games but the excitement of this free police pursuit game is that you get a chance of testing you’re driving and shooting skills all together. So let’s hit the road and drive like a pro and shoot like a military tank shooting. An exciting gameplay, shoot and earn score for unlock your next mission.<br/> <br/>You are an army commando warrior entered in enemy city with your army tank. There police attack on your tank with elite class swats force to destroy your tank. You save your tank and destroy all of the elite force police cars and complete your mission for unlock your next adventurous missions. <br/><br/>Choose from a range of powerful tanks then build it up to suit your play style! An upgrade system allows you to pinch firepower, speed, accuracy and more, as well as stat-boosting patterns and decals for a competitive edge. Use your best strategy to win the war! That’s all the super futuristic military firepower you would want Tanks.<br/>The police car run your way for catch you shoot on elite police cars and destroy all. Proving you the most customized tank, having missile installed on it. Amazing city environment, features, graphics and physics. Charming background sound effects like as police siren, destroy cars, and fire shooting (etc…).<br/>Hurry up download/install this game and enjoy :)<br/><br/>HOW TO PLAY:<br/><br/>-        With police cars are fast approaching, hold the aim in the right direction. <br/>-\t Tap on a shoot to target the police cars.<br/>-\t Use the zoom option to shoot precisely.<br/>-\t Don’t let the police cars get near you.<br/>-\t When you will get surrounded by police cars, watch out for the bar at the top of the screen.<br/>-\tOnce the bar gets filled, you will be captured by the police and game will be over.<br/>-\tKeep in mind, to complete each level; you have to destroy every police car. Otherwise mission will be unsuccessful<br/>-\t With each new level, the number of police cars will increase.<br/><br/>FEATURE:<br/><br/>-\t Real 3d HD city environment. <br/>-\tAmazing background sound effects.<br/>-\tRealistic graphics and physics.<br/>-\tUse zooming and focus skills.<br/>-\tHealth bar show in gameplay.<br/>-\tDifferent shooting missions.<br/>-\tComplete your mission for unlock next missions<br/><br/>If you like this game, please try other games by clicking “More from Developer” or by visiting our publisher account. And don’t forget to rate and review.<br/><br/>For more queries you may contact through email: admin@soloftech.com", "metacritic": null, "released": "2017-04-27", "tba": false, "updated": "2019-08-02T04:26:10", "background_image": "https://media.rawg.io/media/screenshots/17a/17a0f42f4ee0848857a317c16c788967.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 119, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Muhammad Qasim"], "genres": ["Action", "Adventure"], "publishers": ["Muhammad Qasim"], "esrb_rating": null}