{"id": 237946, "slug": "shark-attack-evolution-3d", "name": "Shark Attack Evolution 3D", "name_original": "Shark Attack Evolution 3D", "description": "Explore the blue water land and play a 3D Blue Whale attack for the Shark evolution. The underwater  3D adventure is actually an ocean survival war that exemplified clean and contented water life. The swimmers are throwing net to catch up the jems of sea and the big animal (Blue whale) consequently will lose its existence on the aquatic land. The hungry shark is running for its perseverance and ready to eat whatever comes in way brutally. Killer shark has played the whistle of evolution battle and no one can stay out of its inhuman prey.<br/> <br/>Become the first hand of crazy shark  and experience a new mode of fishing game. Angry sharks are dare to become strong predator and the sign of eating viciously is too much dominant. They are real killers of their swimming enemies and big sharks are on call to create threat and disaster in marine life. Swimmers are irritating subjects in fishes world and they are no longer willing to tolerate them. Shark simulation game is a golden opportunity to enjoy shark's hunting of small fishes and swimmers. control your hungry whale to acheive the targeted point and make possible best water survival. Shark evolution game is simulator of genuine underwater 3D adventure. Your blue whale wandering haphazardly, give your shark purposeful mission, guide it to eat swimmers and protect its living state.<br/><br/>The ocean survival has gained series of missions which come after each successful ending. The shark simulator is free to clean its swimming path and it will cause damage of enery particle that disturb smooth play.  <br/>Features of Hungry Shark<br/>•\t3D shark evolution expedition<br/>•\tUnseen killer shark underwater venture<br/>•\tBlue whale survival mission<br/>•\tmysterious and fascinating shark attack simulator<br/>•\tsensational eating of swimmers and other creatures<br/>•\tseveral locked big sharks to play with<br/>•\tmagical aquatic land and fantastic beech scenes<br/>•\tExtra energy gaining elements for long survival<br/>•\tunlockable new and different levels <br/>•\tFree travelling of marine life<br/>•\tamazing 3D graphics with best colors and figures<br/><br/>How to Play<br/>Download it at free of cost and be ready to see shark attacks<br/>- handle the shark on its travelling course and help to eat swimmers in water and on beech.<br/>- eat the small fishes or little sharks to boast up the energy to secure existence<br/>- complete the assign target and try best to acheive high score<br/>- unlock new sharks to play next levels<br/>- use the screen control signs to move left, right or up and down<br/>- save the blue whale from the swimmers firing", "metacritic": null, "released": "2017-10-12", "tba": false, "updated": "2019-08-02T04:25:28", "background_image": "https://media.rawg.io/media/screenshots/51e/51e7a9161a1be7b3644b1584aa9bca9d.jpg", "website": "http://soloftech.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 51, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Muhammad Qasim"], "genres": ["Action", "Simulation"], "publishers": ["Muhammad Qasim"], "esrb_rating": null}