{"id": 237900, "slug": "real-drift-rally-racing-pro-offroad-racing", "name": "Real Drift Rally Racing PRO: Offroad Racing", "name_original": "Real Drift Rally Racing PRO: Offroad Racing", "description": "\"This game is totally ADS FREE, Buy once and enjoy!\"<br/>Fight for the first position on the real rally tracks of Rally Racer! <br/>Rally Racer 2017 championship tournament is here! It’s time to be the Legend again! Race against professional rally racers in most extreme off-road conditions. Perform stunts and drifts on hill climb curvy paths &amp; big city roads in  Car Rally Racing 2017. Realistic drift excitement is now on the margin of your fingers, start to play it Now!<br/>Now is the time to drift in racing circuit.<br/>Get ready to drive high performance turbo cars and make them drift at high speed in tracks designed specifically for rally racing. The best thing about this drift rally is that you can explore different environments at the same time.<br/>Real Drift Rally Racing 3D gives you exciting cars and country roads on different maps. Race against the time and be the best. You can rally race against your mate or any other rivals.<br/>Turbo Rally Racing 3D- Real Off-road Car Racer Game 2017 contains four different modes Arcade, Knock-out, Free and Time mode. Race in the track by yourself to achieve honors or race against a stronger opponent rivals and check how good you are in rally racing, while you achieve more points on your drifting skills. Stunning visual graphics, realistic yet fun to drive car physics, all in the palm of your hand. Take the rally racing anytime, anywhere with you!<br/>If you like Simulator Games, drifting, crushing and rally try it.<br/>Smooth controls, realistic auto physics.<br/>Test your real drift skills<br/><br/>Features:<br/>-Real tracks with sharp turns.<br/>-Amazing sport cars.<br/>-Unique rally race driving experience in different environments.<br/>- Realistic car controls.<br/>-4 game modes. Free, Arcade, Knock-out and Time mode.<br/>-Over 20 amazing levels.<br/>-10 legendary cars would race you in different levels.<br/>-Great graphics and sound effects.", "metacritic": null, "released": "2017-06-08", "tba": false, "updated": "2019-10-22T14:16:46", "background_image": "https://media.rawg.io/media/screenshots/9ab/9abdabdd3b7593b4327af3eb65e12650.jpg", "website": "https://www.facebook.com/fiveriversolutions/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 230, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Syed Usman Ali Shah Gillani"], "genres": ["Simulation", "Racing"], "publishers": ["Syed Usman Ali Shah Gillani"], "esrb_rating": "Everyone 10+"}