{"id": 237934, "slug": "bangalore-metro-train-2017-premium", "name": "Bangalore Metro Train 2017 Premium", "name_original": "Bangalore Metro Train 2017 Premium", "description": "Start experience Bangalore metro train virtually with real experience, environments, stations, and many more! Your job is to pick up passengers from one station to other stations on time. Real voice overs and real trains, stations, buildings makes you to feel like you are exactly conducting Bangalore Metro train virtually. Train fans can now enjoy super metro train simulator with Bangalore environment. This also determine to show your skills by driving this train with full of joy and thrill with a real ride! Start the engine and run this train like a bullet. Are you ready to become legendary driver? Where you need to unlock all lower badges namely veteran driver, rookie driver, perfectionist driver, master driver. Download Now for Free and start share with your friends as well. Subway simulator also implemented where you can pass through the real train underground which designed exactly like how it is in Bangalore.<br/><br/>Control the speed of the train by accelerating and keep eye on maximum speed while conducting metro train, Incase if you cross the maximum speed then there might be a chance of revoke your driving license which cause game over! Press and hold on the brake to stop the train right at the station and each station has got limited time to board and de board the passengers and hence you need to very careful with the timings. There are 2 lines namely Green Line and Purple line where journey starts from Nagasandra to Puttenhalli and Mysore Road to Bayappanahalli respectively, select different trains and route to get start. You will also be having different view like driver view, top view, etc where you can switch during the game play. You can also swipe the screen left to right in order to see the real buildings surrounding you.<br/><br/>This game can be played by all family members where this game is family supported game, Kids, Youngsters, old age people can also play this train simulator game.<br/><br/>Good Luck!<br/><br/>Features:<br/><br/>NO ADS......<br/>Real trains, real environment, real stations<br/>Real voice over, real buildings of Bangalore<br/>Pick and Drop services<br/>Easy to handle<br/>Real controls and user friendly<br/>3D view from the cab<br/>Well-designed railway tracks and environments<br/>Stunning sound effects<br/>Amazing scene and environment <br/>Real animated people<br/>Opportunity to become real subway engine driver<br/>Great dynamic game play<br/>Excellent game for train fans, train lovers", "metacritic": null, "released": "2017-06-24", "tba": false, "updated": "2019-10-22T14:16:47", "background_image": "https://media.rawg.io/media/screenshots/6a3/6a327c7bffa24ab9f2a672ced22f48dc_pkcTGGs.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 100, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Mobi2Fun Mobile Entertainment Pvt"], "genres": ["Adventure", "Simulation"], "publishers": ["Mobi2Fun Mobile Entertainment (Bangalore) Pvt"], "esrb_rating": null}