{"id": 237917, "slug": "car-transport-er-truck-driver", "name": "Car Transport-er Truck Driver", "name_original": "Car Transport-er Truck Driver", "description": "Let’s start with the amazing experience of loading and parking of different cars with heavy duty truck inside the Off-road areas. This multi trailer truck car transport game will provide you an opportunity to drive dual vehicles and you will become all-rounder in driving the small and large automobiles efficiently. <br/>It’s time to drive a Multi Truck transporter. This is one of the best car transporter game,  the Game of all time which beats all other truck games, Heavy cargo Truck games and Big Cargo transporter games. In this newest Off-road Multi truck Parking simulator you get to drive around with a Modern car transporter  such as a Heavy freight Truck Trailer, a Big Off-road Cargo Truck driver also known as MultiStorey car Transporter . You will drive this car transport cargo trailer around the city and a Heavy off-road uphill climb track in a 18 wheeler grand truck which would be fun to play with.<br/> You can drive off-road cargo drive to explore the hilly environment and test your mountain driving skills. You can operate trailer truck to transport cargo like heavy sports car and become a real truck car transporter. Your transporter truck might be carrying dangerous cargo so you can handle this job with perfect driving skills. Load up the cars on the transporter trailer and then drive the truck. One you have arrived at your destination, unload the cars, maneuver them and park them properly. <br/>In this Extreme Transporter truck 2017 simulation game you will test your driving and parking skills. The truck driving simulation is real and addictive and is a lot of fun to play. You have to really careful while parking and maneuvering the high value sports cars in the trailer truck and make sure you load and unload them without a scratch. Happy transporting!<br/>18 wheeler or 22 wheeler long trailer truck and lorry on dangerous Off-road roads is not so easy like SUV jeep driving. Truck driver need special skills. This is a very challenging truck driving game. As you reach on your destination you have to park you truck by using your truck driving and parking skills.<br/>The game play is very simple and so exciting. To transport the cars you have a limited time to drive. So Drive with high speed along fast moving Sports Car on high and in streets of grand off-road  to reach a destination with a limited time table. Drive the vehicles from the truck parking lot to the other points in the map and earn some cash.<br/><br/>Features: <br/>Drive Cars and Load them into the Heavy  Trailer Truck\u2028 Explore the City &amp; Off-Road Environment\u2028Modern concepts of transportation and loading\u2028Multiple changing climate and wonderful structure\u2028Realistic animation of different automobiles\u2028Different screen views and thrilling vehicles sound\u2028A nice way to explore driving expertise\u2028Stunning simulation related to large trucker drive", "metacritic": null, "released": "2017-01-06", "tba": false, "updated": "2019-10-28T03:27:16", "background_image": "https://media.rawg.io/media/screenshots/77c/77c105fc878152021ffecd8523b128b8.jpg", "website": "https://www.facebook.com/fiveriversolutions", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 128, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Syed Usman Ali Shah Gillani", "Five River Solutions"], "genres": ["Simulation", "Racing"], "publishers": ["Syed Usman Ali Shah Gillani", "Five River Solutions Private"], "esrb_rating": "Everyone 10+"}