{"id": 237990, "slug": "bubble-shooter-super-pop-puzzle-blast", "name": "Bubble Shooter Super Pop Puzzle Blast", "name_original": "Bubble Shooter Super Pop Puzzle Blast", "description": "Let’s play the perfect and most fun puzzle Bubble Shooter game. Super Bubble Shooter 2017 is a present for everyone who love playing game in free time. Sharp your brain and solve all the awesome puzzles and challenges. Bubble Shooter 3D 2017 is the super matching game!<br/>This new 3D bubble blast is the perfect brain training game that allows you to solve challenging puzzle after puzzle, improving your master skills.<br/>This super bubble pop game is free to download and also good for family and kids. Bubble Shooter 3D game is completely free to play but some in-game items such as extra moves or lives will require payment.<br/>In this perfect bubble shooter game Pop all the bubbles to get to a new level,<br/>Make the combinations of 3 or more bubbles with same color to make them fall down/clash/blast and Clear all the bubbles to win super game.<br/>You will pop all puzzle blast and challenge yourself to beat your new bubble shooting record. Will you beat your highest score? Join us and become a super master! It helps you relax a lot when you get stressful with pop blast and clash.<br/>You enjoy super puzzle craft after first play and give your reaction. You can face multiple levels in which different atmospheres, craft balloons,  <br/>Craze Bubble shooter is without a doubt a free game which can help lift any dull moods. This clash of bubble shooter game can be so addictive that it can cause a   <br/>Pop mania craft! A master of bubbles popping here and there and everywhere! You can continue your new puzzle game to make sure that you don’t lose any progress. If you like this new game like super bubble shoots then you have to try this one!<br/>FEATURE <br/>•\tColorful bubble with cool design HD graphics.<br/>•\tShoot/pop bubble with same color at least 3 bubbles.<br/>•\tMany different levels to play.<br/>•\tClear all bubble to finish level.<br/>•\tTime limit is required to finish the level.<br/>•\tShoot as fast as you can<br/>How to play? <br/>- Install Game in Smart phone<br/>- Touch on Play<br/>- Move your finger to the target, aim, and shoot!<br/>- Match colors Bubbles to Burst!<br/>- Burst all the bubbles or get 3 star to complete level <br/>-While the game is free to download and play<br/><br/>For more queries you may contact through email: Soloftech2017@gamil.com<br/>website: www.soloftech.com", "metacritic": null, "released": "2017-08-12", "tba": false, "updated": "2019-08-02T04:27:58", "background_image": "https://media.rawg.io/media/screenshots/077/077bc9dcac69958a21d9290f7daa824f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 59, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Muhammad Qasim"], "genres": ["Simulation", "Arcade", "Casual"], "publishers": ["Muhammad Qasim"], "esrb_rating": null}