{"id": 237907, "slug": "giant-moto-free", "name": "Giant Moto Free", "name_original": "Giant Moto Free", "description": "Giant Moto is a high speed, high flying racing game that's all about the jumps, turbo boosts and scoring the best time.  Giant Moto features beautiful retina display graphics, iPhone 5 widescreen support, 10 challenging tracks and 4 motorcycle's to choose from.  You can race against yourself or against 3 computer controlled bikes with 3 difficulty levels so it's challenging and fun for kids of all ages.<br/><br/>\"Giant Moto Free\" is the advertising-supported version of Giant Moto. If you want the ad-free version, look for Giant Moto on the app store.<br/><br/>Accolades:<br/>★ Previously an iTunes Hot New Game/Racing Game! <br/>★ Previously an iTunes \"Best Racing Game\"! <br/>★ Previously an iTunes \"What's Hot\" Game! <br/>★ Previously an iTunes \"New &amp; Noteworthy\" Game! <br/><br/>Reviews:<br/>★ \"Games of the Week: ...this is a perfect little motocross game. Giant Moto is all about jumps, turbo boosts, and scoring the best time. It's reminiscent of the Nintendo classic ExciteBike--but a lot purtier, to be sure. Well worth 99 cents.\" <br/><br/>★ AppModo: \"Giant Moto takes iPhone motocross racing to the next level with it’s highly detailed 3D graphics, physics engine, and killer racing system!\" <br/><br/>★ allaboutthegames.co.uk: \"Though there are a million and one tedious physics-based bike 'em ups, there's never really been anything as smooth and slick as Giant Moto.\" <br/><br/>★ TouchArcade: \"I can't wait to get my hands on this game, as I've been waiting for a truly excellent Excitebike-like game for the iPhone.\" <br/><br/>★ 148apps: \"Giant Moto is a fun, faithful homage to the video game classic Excitebike, providing players with an improved, updated pick-up-and-play arcade racer that stays true to the original.\" <br/><br/>★ Patrick, age 8: \"I love these jumps!!!\"", "metacritic": null, "released": "2010-11-11", "tba": false, "updated": "2019-10-22T14:16:46", "background_image": "https://media.rawg.io/media/screenshots/4d4/4d4a6dac356ab1262d095fdc74e41ece.jpg", "website": "http://www.rocket5studios.com/apps/giantmoto/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 122, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Rocket 5 Studios"], "genres": ["Racing", "Arcade"], "publishers": ["Rocket 5 Studios"], "esrb_rating": "Everyone 10+"}