{"id": 237979, "slug": "sweet-candy-blast-fruit-puzzle", "name": "Sweet Candy Blast Fruit puzzle", "name_original": "Sweet Candy Blast Fruit puzzle", "description": "This is the world of sweet candy  and trutti fruity jelly’s and unlimited blast  blossom. To play the magic of candy crash, a free bubble shooter and sugar crush fun is ready. Candy blast mania is super time killing game. Come and get a chance to enter in kandy flower garden. Match 3 candy hearts and cookies, sweet and juicy, and you will experience non stop candy crush.<br/><br/>Candy blast mania tests your matching skills and proves that you are a brainy..... All the regular bubble shooter  who were longing for an addictive blast game which can challenge their killing and candy crush job, will be happy now. More than hundred candy adventures are available in match 3 puzzle with fantastic graphics and disaster effects.   <br/>Let's have a taste of delicious cookies, chocolates and juicy candies. Practice the soda     bubble with saga, match three crunchy lollipops or yummy candy hearts and see and exciting candy blast feats. <br/><br/>Cookies crunching is a new free game to visit jelly saga, sweet candy home and limit free opportunities to make candy combos. To become candy camera king just download the yummy candy selfi 2018 and enter in the sweet candy adventurous world. The syrupy and quick candy bombs startle the candi world. The view of matching colorful blocks and candy crash is extremely entertaining.  <br/><br/>If you want to be candy blast legend, unlock the block jelly saga huts and start playing each new level with new task.  Sugar candy blast game designs only to swipe three same sweet cookies, chocolates, jellies or lollipops and kill them speedily. Try to blast plenty of candies in less swipes. You will also get candy booster to crush several cookies at one time . It is effortless to sugar crush all the candies with one touch. <br/>Cookie puzzle round is replete with fun and special surprises in it each sweet candy round. The tutti fruity jellies smashed world will be opened more and more with different puzzle and challenges ..... it will never mark an ending stop. <br/><br/>Features of sweet candy Blast Mania<br/>&gt; Amazing match 3 puzzle with unlimited play time<br/>&gt; Extremely entertainment bubble shooter<br/>&gt; Free hundreds of challenging rounds<br/>&gt; Candy crush adventure and super candy blast mania<br/>&gt; Fascinating crashing and smashing sound, throughout musical world<br/>&gt; Richly filled with bonuses and candy booster to get high score<br/>&gt; Additional lives and extra moves faculty<br/>&gt; International ranking and board score for kingship in each level<br/>&gt; Easy matching and swipe of three coloring jellies, cookies, candies etc<br/>&gt; Visit of Fun land and making of candy combos<br/><br/>How to Play<br/>The blasting of candy mania is very simple with few steps<br/>- Swipe the fingers on screen to match 3 same candies, it will be blasted instantly to secure score.<br/>- 4 or more than 4 same candy blocks blasting will create a booster as well to smash several cookies.<br/>- After passing one level move to next level which will ultimately open for you<br/>- Every level ends with rating so try to get 3 stars. <br/>- apply for daily bonus to attain extra moves", "metacritic": null, "released": "2018-07-27", "tba": false, "updated": "2019-08-02T04:27:30", "background_image": "https://media.rawg.io/media/screenshots/932/932f0c4d385e83e1ed03342f0302991c.jpg", "website": "http://soloftech.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 91, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Muhammad Qasim"], "genres": ["Arcade", "Casual", "Puzzle"], "publishers": ["Muhammad Qasim"], "esrb_rating": null}