{"id": 237940, "slug": "police-traffic-driving-school", "name": "Police Traffic Driving School", "name_original": "Police Traffic Driving School", "description": "Get your car rolling on the highway at full speed, while moving through the heavy traffic and busy. Police Chase Traffic Racer is the exciting and dynamic racing simulator. In the game you have to drive your car through the traffic and collect the coins on the step of your way, and avoid hitting the traffic, otherwise the game will be over. Police Chase Traffic Racer is the mission based game with multiple levels, and you will be given a specific task and every mission. At the start of every mission will ask you to complete the required distance and collect the given number of coins, or else the mission will be considered as failed. Once you complete the task, you will advance to the next level. On completion of each mission, you will be awarded coins. With these coins you can buy new cars and also enhance the performance of your car by customizing and upgrading the car. Beware of police car right behind you, or else you will get busted.<br/><br/>There are a number of cars you can choose at the start of the game, go for the super-speedy car with the enhanced performance. The better car you choose, you will be able to complete the distance by consuming the less possible distance. The earlier you reach to the final stop, the more bonuses you will get. Try to collect all the coins and do not skip a single coin. With the high definition graphics Traffic Police Chase Race will certainly provide you the much-enhanced racing experience that you were searching all along.<br/><br/>Fasten your seat belt for exciting and thrilling experience, by skipping pass through the unavoidable traffic. Do not lose the control, or you will end up banging your car on the road into traffic. You will have to deal with the unavoidable traffic, so this will you test your driving skills. Police Chase Traffic Racer is the interactive endless car racing arcade game. Keep a closer eye on the traffic, for the smooth and the ride safe. Download Police Traffic Racer and Chase getting ready for the ultimate racing game traffic.<br/><br/>How to play- Chase Police Traffic Racer:<br/><br/>• Select your preferred car from the main menu.<br/>• Choose the option play to get the game started.<br/>• Before the game starts, you will see your required target of collecting the coins and distance to be covered to complete the mission.<br/>• Tap to move left, right and the middle to evade the traffic on road and collect the coins.<br/>• Collect every coin.<br/>• On the completion of each task, you will get the reward.<br/>• With evading the police you will get double the reward.<br/>• With the slightest hit with the traffic passing by, the task will be considered unsuccessful and the game will be over.<br/>• With this reward, you can buy new cars and upgrade your car to enhance its performance.<br/><br/>Features - Police Chase Traffic Racer:<br/> <br/>• High Definition graphics.<br/>• Amazing sound effects.<br/>• Realistic on road traffic.<br/>• Smooth and easy controls.<br/>• Multiple missions and levels.<br/>• A number of cars to choose from.<br/>• Basic customization of the car.<br/>• Rewards on completion of every task.<br/>• Realistic car models.<br/><br/>For more queries you may contact through email: Soloftech2017@gamil.com", "metacritic": null, "released": "2017-03-09", "tba": false, "updated": "2019-08-02T04:25:41", "background_image": "https://media.rawg.io/media/screenshots/ba5/ba58cac988b4f9c7e17f999687ef9a58.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 99, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Muhammad Qasim"], "genres": ["Action", "Racing"], "publishers": ["Muhammad Qasim"], "esrb_rating": null}