{"id": 237948, "slug": "crazy-school-bus-driver-2018", "name": "Crazy School Bus Driver 2018", "name_original": "Crazy School Bus Driver 2018", "description": "High School bus driving simulator 2017 free: school kids pick-up &amp; drop duty simulation game<br/>Get ready for the early morning bus rush as schoolbus driver. School Kids are waiting to be picked up, to get dropped to their primary and high schools through futuristic bus.  City School bus driving simulator 2017 is the best school bus game for all who like bus simulator games, bus parking 2018, car parking games and other flying school bus and passenger like public transport games. Dropping off school kids on time is the challenge for any school bus driver in this Magic school bus drive game. So, start your engine, get on the extreme road trip and take your xtreme coach to school!<br/>School Bus Driving Simulator is developed especially for ambitious drivers who feel they are ready to do the job of city pre-School Bus Deiver. Your mission is that pick the all student and drop very safely. Safety is the first priority during the drive your school bus no need you break the traffic rules, you need to avoid the rush traffic like cars, simulator do not crash your driving coach and you need to obey every traffic rules for making you a best driver for Magic school bus. This free school bus games is a little unique in the sense that you required to perform your duties in big city and industrial area with heavy traffic rather than other off-road school bus games 2018. Sometimes you have to start before the sunrise to drop the Industrial workers and rush back for your school duties. In this bus driving academy 2018 game you do not only transport kids from home to school in the morning, you have to pick them from school and drop them home as well in the afternoon.<br/>Select the pre-school bus and drive through the city. 5 different school coaches are available in this New York city bus parking 2017 game and you can unlock your favorite vehicle after complete the require levels then coach waiting for you the school like a daily new simulator for transport. Go ahead towards front seat as the school bus driver bus transporter, and pick up passenger kids and drop them ahead to their destinations in your city school bus parker 3d. Consider yourself as the crazy school bus driver; in charge of the public bus transport, all you have to do is to give your school kids a safe and sound drive round the city, pick and drop them to their destinations in this highway bus parking game. If you loving school bus games and want experience in your driving skill you need to play high school bus driving for make you expert driver for big vehicle driver. Transport game is the most exciting to learn drive rules and skill and all traffic laws as in driving school academy game. Bus driving simulator 2018 is a game for everyone that would like to keep those driving skills up to date, you need to practice everything from parking, reversing, parallel and use your mental skills to keep calm. Their safety is in your hands! Drive safe and drive on time!<br/>In City school bus Driving 2017: Parking Simulator 3D your mission is to safely pick and drop the kids by driving your Magic school bus! All the great animations and the driving thrill make this City school Bus Driver Simulator as one of the best bus driving Parking 2017 free games.<br/><br/>FEATURES<br/>===========<br/>- School Bus Driving Experience<br/>- Explore the Big City Environment<br/>- Pick and Drop School Kids<br/>- A Unique Concept for School Going Kids<br/>- Amazing Gameplay with HD Graphics<br/>- .Realistic city environment Map<br/>-  Animated school kids idle, walking, entering/exiting the bus<br/>-  Intelligent Traffic System<br/>-  Cool and smooth graphics<br/>-  Amazing Bus Selection mode", "metacritic": null, "released": "2017-03-15", "tba": false, "updated": "2019-10-28T03:27:19", "background_image": "https://media.rawg.io/media/screenshots/850/850c5b8ebb6cade3e010d83305dd5f69.jpg", "website": "https://www.facebook.com/fiveriversolutions/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 125, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Syed Usman Ali Shah Gillani", "Five River Solutions"], "genres": ["Simulation", "Racing"], "publishers": ["Syed Usman Ali Shah Gillani", "Five River Solutions Private"], "esrb_rating": "Everyone 10+"}