{"id": 237961, "slug": "off-road-tractor-driving-sim3d", "name": "Off-road Tractor Driving Sim3D", "name_original": "Off-road Tractor Driving Sim3D", "description": "Extreme Heavy  tractor Driving Simulator is one of the dream tractor trali game for the lovers of tractor simulator and tractor games who like tractor driving Simulator, tractor parking and Big Off-road Cargo Truck also known as Heavy Cargo Transporter Truck.<br/>It is the latest entry into transport tractor truck games to show your skills as a modern transporter off road cargo Delivery. Off road Tractor Driver Cargo Transport is the game to be witnessed in cargo truck games category. For those who love playing off road transporter truck games with heavy truck driving duty, here is the perfect challenge for them. Challenge yourself to become an expert driver of this heavy Farming transporter tractor truck. Your duty as cargo truck driver is to reach safely on destinations. Let’s start drive of extreme powerful engine to feel the thrill of off- road driving and duty of hill transport with your own Tractor transport game.<br/>This American Tractor Truck Trailer 4x4 Cargo game will surely test you pro driving skills when you have to drive a Tractor trailer with heavy cargo. Cargo transportation is itself a challenging task but its challenge multiplies when it is in mountainous and hilly environment. Off-road driving tricks are much different from road driving. You have to face multiple dangerous turns and steep climb movement.<br/>Become a Tractor truck driver in this exciting new Big Tractor Farming Simulator 2017 3D game. Get in your Tractor truck and deliver cargo to your ending point. Carry all the materials and other things very carefully to your destination.<br/>Cargo Transportation Missions<br/>Transport goods in your transporter Tractor truck or just load cargo in your cargo lorry or Transport Sand, Woods, Seeds and much other Cargo. Now you become Sand Transporter, Wood Transporter and Other Cargo Transport Truck Driver of 2017 and take this cargo to different places, like uphill Off Road mountain track or urban city. Get behind the wheel of your tractor truck and make sure you successfully complete your trucking missions.<br/>Let’s play this 3D Tractor truck game that has a real off road cargo truck driving skills to control heavy duty trailer on off road tracks.<br/>Features: <br/>• Hilly and mountains Environment.<br/>• Exciting New 15 Levels.<br/>• Three Different Modes.<br/>• Tractor Driving, Parking and Transporter Simulator.<br/>• Multiple cameras angles to experience full driving control.<br/>• HD Sound Quality.<br/>• Crazy Addictive Game Play.<br/>• Realistic Tractor physics.", "metacritic": null, "released": "2017-01-05", "tba": false, "updated": "2019-10-28T03:27:24", "background_image": "https://media.rawg.io/media/screenshots/ab7/ab7c41e815bbe1a4df408431106cf401_fkSTcD8.jpg", "website": "https://www.facebook.com/fiveriversolutions", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 185, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Syed Usman Ali Shah Gillani", "Five River Solutions"], "genres": ["Simulation", "Racing"], "publishers": ["Syed Usman Ali Shah Gillani", "Five River Solutions Private"], "esrb_rating": "Everyone 10+"}