{"id": 237976, "slug": "dinosaur-jungle-simulator-2018", "name": "Dinosaur Jungle Simulator 2018", "name_original": "Dinosaur Jungle Simulator 2018", "description": "A new world of the Jurassic dinosaur has begun. Tyrannosaurus is the most dangerous meat eating dinosaur. Powerful jaws, strong legs and massive large, bone crunching teeth. Play as the real tyrannosaurus rex and survive in the wilderness as long as you can. Evolve your dinosaur to dominate the world. Take control of this huge dinosaur and help it hunt its enemies.  <br/>This Ultimate T-Rex is ready for the Rampage .Dinosaur simulator allows you to take control of ferocious T-Rex as he roams near and far to face enemies. In this Trex simulation game you will act like a tyrannosaurus Rex and enjoy to chop these dangerous animals into pieces. Ultimate T-Rex Dinosaur simulation at its best with massive 3d map so take your time to explore all the areas and find wild beasts.<br/>Tyrannosaurus is the angry dinosaur of its kind. Control this dinosaur and play against your enemies. Your enemies are stag, zebra, hippo, bore, big angry elephant and many other wild animals. Your mission is to control this angry dinosaur and play this real tyrannosaurus simulation game for hours of entertainment. <br/><br/>Features of Dinosaur Simulator 3D Attack: Survival Game 2017<br/>- Three different Modes (Snow, Jungle, City)<br/>- 27 Challenging Missions<br/>- Real Tyrannosaurus survival simulator <br/>- Chase and hunt down animals <br/>- Cool gameplay <br/>- Realistic environment <br/>- Attacking Dino missions <br/>Your Feedbacks and ratings are valuable for us to keep ourselves busy in creating more fun in the games to entertain you, your family and your friends. In case if you find any bug that needed to be addressed just send us an email, we will improve it and reply to your email as soon as possible.<br/>NOTE: You can play this game for free and also WITHOUT Internet!", "metacritic": null, "released": "2017-02-15", "tba": false, "updated": "2019-10-28T03:27:29", "background_image": "https://media.rawg.io/media/screenshots/f5d/f5de1d843d4577b535c3a3e2a424e21b_PhGq5hu.jpg", "website": "https://www.facebook.com/fiveriversolutions/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 173, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Syed Usman Ali Shah Gillani", "Five River Solutions"], "genres": ["Adventure", "Simulation"], "publishers": ["Syed Usman Ali Shah Gillani", "Five River Solutions Private"], "esrb_rating": "Teen"}