{"id": 238007, "slug": "modern-american-sniper-2017-contract-killer-3d", "name": "Modern American Sniper 2017: Contract Killer 3D", "name_original": "Modern American Sniper 2017: Contract Killer 3D", "description": "Modern American sniper 2017: Contract Killer 3D<br/><br/>Do you love Real Sniper Shooting games? If yes, then here we are with Modern American Sniper 2017 best shooting game set with best real-life 3d graphics of world’s most dangerous war zone battlefield places and cities filled with crimes like city of California. \u2028You are the part of the best team of the sharp American sniper Shooter s. It’s time to safe the California city of America and eliminates the mafia criminals.<br/><br/>EYES ON TARGET! \u2028It’s your duty to get your eyes on the right target. If you shoot first the wrong target your mission will be failed. Modern American sniper 2017: Contract Killer 3D got multiple missions with full of excitement and thrill. In this modern American sniper 2017 game it is very important to keep focused and make the right decisions. One little mistake and you will not be able to rescue the California city don’t forget Eyes on target!<br/><br/>FOCUS AND KILL ON TIME\u2028your job is to aim and shoot down the mafia criminals. Pull the trigger and make sure the bullet goes the right way.<br/>MISSIONS\u2028Take best shot to kill criminals in this modern American sniper 2017 and listen you are alone so show your shooting skills for the safety and security innocent peoples of California.\u2028In each level you will get some special task you should complete it in give time otherwise problems arises.<br/>Features of Modern American sniper 2017: Contract Killer 3D", "metacritic": null, "released": "2017-01-25", "tba": false, "updated": "2019-10-28T03:27:42", "background_image": "https://media.rawg.io/media/screenshots/f70/f706876c8008b2e1836157000a480c63.jpg", "website": "https://www.facebook.com/fiveriversolutions/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 153, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Syed Usman Ali Shah Gillani", "Five River Solutions"], "genres": ["Action", "Adventure"], "publishers": ["Syed Usman Ali Shah Gillani", "Five River Solutions Private"], "esrb_rating": "Mature"}