{"id": 238005, "slug": "angry-anaconda-simulator-2018", "name": "Angry Anaconda Simulator 2018", "name_original": "Angry Anaconda Simulator 2018", "description": "Play as a wild and angry anaconda snake on your smart phone, slay your victim, look and attack your favorite prey in this anaconda snake games and anaconda games 3d with the blend of wild snakes battle game.<br/>Get ready to slay your victim, look for your preys, slither around and kill them in the most pitiless way possible. Beware all, here comes the scariest giant predator in town from the jungles of Amazon and it’s looking for food. Play deadly anaconda! The Great Snake is always hungry. The spot is filled with all kinds of wild animals to target: hunt the Powerful King Lion, the Delicious Deer, innocent hen, rabbit, goat simulator, the Mighty Wolf and even fight with humans. Prove with your might that you’re the ultimate villain of this jungle.<br/> In this Snake Simulator there are many animals which are used for Preys and some are used as family of reptiles. Snake Right is to Hunt their prey in this venom anaconda snake simulator 3d.<br/>Venom Wild Anaconda Snake Simulator game have Different Snakes to play with in this free snake game. This 3d Snake called Anaconda looking for Prey to attack and fill it hunger. This wild anaconda can also eat snakes in the snake battle which is held in tropical rain forest. It can also corporate snakes and other hunting animals.<br/>This mighty giant beast is ready to attack with anaconda snakes simulator 3d.  Hunt or be hunted by wild crocodile is a part of this wild anaconda snake attack 3D games and fight with wild animals in swamp attack. In this snake attack there are 30 different anaconda snake attack levels and 3 different modes to play. You have to prove that you are wild anaconda of the Jurassic jungle in new anaconda snake games. Feel the thrill and rush in your playing as big angry anaconda a merciless and scariest predator of the jungle that is creating rampage in the Jurassic Jungle.<br/> Download now Angry Giant ANACONDA Slither SNAKE ATTACK Simulator 2017 and start the war against animals and humans and also fight for your survival!<br/><br/>Features:<br/>• 3 different Modes to Attack<br/>• 30 Challenging Missions<br/>•Beautiful Different environments with Vibrant 3D graphics<br/>•Thrilling prey hunting challenges and wild safari<br/>•Realistic swamp &amp; various lifelike breeds.<br/>•Smooth and easy controls to make the Anaconda run and attack.<br/>•Fast and action packed gameplay.<br/>•Plenty of sounds and visual effects<br/>•Show them the power of that dangerous Slithering King!", "metacritic": null, "released": "2017-08-31", "tba": false, "updated": "2019-10-28T03:27:26", "background_image": "https://media.rawg.io/media/screenshots/4be/4be2a90812a852de08c0b0f58b8ed5e7.jpg", "website": "https://www.facebook.com/fiveriversolutions", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 147, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Syed Usman Ali Shah Gillani", "Five River Solutions"], "genres": ["RPG", "Simulation"], "publishers": ["Syed Usman Ali Shah Gillani", "Five River Solutions Private"], "esrb_rating": "Teen"}