{"id": 238039, "slug": "attack-of-the-red-things", "name": "Attack of the Red Things", "name_original": "Attack of the Red Things", "description": "An epic battle with a story line so deep that you will never understand it (don't even try), Red things from a near distant land are attacking our green thing in force. <br/><br/>You must amass an army of Green Things to defend the other green thing. <br/><br/>At any given time your army can consist of 30 troops. Troops can spawn once some energy is built up on the green thing. Wait longer and the troops are stronger or get impatient and send a full army of weaklings out , do what you want its your army. <br/><br/>Melee troops are round green troops with blue pointy things that stick out, if the blue pointy thing hits a red thing it hurts them, and you (physically and emotionally). <br/><br/>Gunners shoot their little hearts out and chase the red things until they get in range, then they plant their feet and fire away (actually its never been proven that they have feet but it is assumed). <br/><br/>Snipers sit back and shoot their little hearts out. every shot they loose health (hey its a big gun). but they can also stab the red things with their own blue pointy thing once again hand to hand combat causes some damage to the sniper (I don't thing they have hands that would be silly)<br/><br/>Rushers are dumb, they walk in a straight line and are great offensive troops (too bad its a defensive game). but they can get you some points or cause a distraction as they march forward to their certain death. <br/><br/>Then there is the laser, it is bright blue and it hurts the red things feelings (and their heads). you have to collect the gems to fire it off... (we were going to call the gems \"pink things\" but we wanted to keep it classy so that's that). <br/><br/>For some reason when 10 red things hit your green thing the game ends. I would provide an explanation for this but I will leave something to the imagination. <br/><br/>This game will provide minutes, hours or days of fun depending on your own attention span. Only you can save the green thing from the red things in the \"battle of grey valley\"", "metacritic": null, "released": "2017-12-18", "tba": false, "updated": "2019-07-30T12:45:21", "background_image": "https://media.rawg.io/media/screenshots/b64/b64f0d4195d08e8b8951841f7b59ab5d_SRDvkHM.jpg", "website": "http://www.turbosmoke.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 71, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Carl Muller"], "genres": ["Strategy", "Arcade", "Casual"], "publishers": ["Carl Muller"], "esrb_rating": null}