{"id": 238017, "slug": "gunship-helicopter-battle-2017-air-fighter-3d", "name": "Gunship Helicopter Battle 2017: Air Fighter 3D", "name_original": "Gunship Helicopter Battle 2017: Air Fighter 3D", "description": "The Gunship Helicopter Battle 2017 Game contains stunning graphics along with great realistic sound effect, real sea view and desert environment. This Helicopter air attack game is free and has awesome game play. This air attack game allows Fight with evil enemies on the sea view. Fly your helicopter with instantly slings into the close range of evil enemies and attack on them with extreme firepower and missiles. Defend your helicopter in this shooting game. Your enemy is alert there with assaulting when you attack on them. Eliminate all intruders in this helicopter fighting game.<br/><br/>\u2028In this game you are on helicopter and move around the ruthless enemy. You have an equipped a missiles and spree. You have an impeccable decisive role like an aerial helicopter pilot. Your Helicopter is full loaded with missiles and bullets. Destroy culprit ships and protect your plane from enemy missiles otherwise your Heli should be crash.\u2028It has variety of missions. Choose your favourite mission and make your own tactical scenario. <br/><br/>In each mission there are different tasks. First mission is very easy instead of other missions. In the every next mission difficulty level increased. Shoot the perilous evil enemies and clear the existing mission and also unlock the next mission.\u2028This helicopter fighting game is a mobility and air raid with Heli air battle extreme crossfire game. Once you have start to play this extreme military helicopter shooter game, then you will not stop until the total destruction of the brutal enemies counter strike by sea attack. This air attack is undeniably with classic atmosphere and modern rendering game. The full of arsenal modern rendering and splendid air attack game. Protect your heli from brutal enemy missiles in the massive hordes. Keep continuous scramble with glorious way and destroy everything. If you like an action simulator shooting game then this is the right game for you.<br/><br/> \u2028Features:<br/>\u2028\u2028- Amazing shooting effect<br/>\u2028- Different Missions<br/>\u2028- Multiple helicopters with a variety of weapons and equipment\u2028<br/>- Best stealth helicopter navigational and assault controls<br/>\u2028- Gunship Air Helicopter equipped with gunner, guided missiles, short range rockets and guns.<br/>\u2028- Realistic Environments\u2028- Simulation Helicopter<br/>\u2028- Challenge &amp; Custom missions\u2028- Explosions, missiles, guns, bullets, bombs, smoke and more!", "metacritic": null, "released": "2017-02-08", "tba": false, "updated": "2019-10-28T03:27:43", "background_image": "https://media.rawg.io/media/screenshots/dee/dee86330a867ca38c6de44bc93fdeae0_xSD1mZx.jpg", "website": "https://www.facebook.com/fiveriversolutions/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 185, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Syed Usman Ali Shah Gillani", "Five River Solutions"], "genres": ["Action", "Simulation"], "publishers": ["Syed Usman Ali Shah Gillani", "Five River Solutions Private"], "esrb_rating": null}