{"id": 238008, "slug": "bike-highway-fight-sport-pro", "name": "Bike Highway Fight Sport Pro", "name_original": "Bike Highway Fight Sport Pro", "description": "Crazy Bike Attack Highway Race is a surviving episode and road revenge of master motor cycle racer, areal roadway bike attack to sweep the victory path. A thrilling impossible stunt adventure  and highway racing fight has gained new action plan that is challenging for a road king whether he persist on race attack or will find any escape. This action game is an extreme offroad racing, a fast lane driving zone and powerful bike fight with 3d graphics, animated physics and competitive environment that you never look before.<br/><br/>Crazy traffic racing battle is an adventurous title winning contest on highway with extreme speed and power predicting stunts of fighter who has to run run fastly on the road and among the rivals. The 3d traffic race mania simulation is a dual action and original hero grand battle to crash what comes in way. Jump in the diverse 3D moto ride and subway bike stunts show to wipe out the deadheads from the way of destiny and earn grace with progressive end. Crazy Bike Attack Highway Race is bloody motor cycle chasing that forces you to run fast and instantly attack on the competitor, follow the brutal rule of hit and kill and push the rogues deadly. <br/><br/>Motor cycle traffic racing has turmoil of quick decisions at every step that give you no chance freedo....... kill or being killed is the moto. The game is an actual consumer of man potential and based on the sustaining capacity that obviously race high with the survival urge. Kick the super speed bike for ultra traffic rider drive and armed you with the supplementary weapons for knock over round.<br/><br/>The fascinating roadway auto bike fight is superior amidst of other bike races in terms of its brutal clashes with other bike runners and the systematic survival approach from being attacked by bloody riders. Make your plan how to run on track, chase your winning point and pull down your rivals by punches and kicking. The sound and threat of expected road accident will remind you a genuine racing competition. <br/>Highlights of the game<br/>*Real highway traffic expedition <br/>*Offroad auto bike race and driving school<br/>*Ultra realistic master riders' road revenge<br/>* Solo moto driving challenge and speed competition<br/>*Finest arm fighting and deadheads' battle<br/>*Brutal action game and fast plan roadway race<br/>*Alluring genuine bike racing environment<br/>*3D animation for super bike race simulation <br/>*Weapons for attack ( punch, kick, axes, base bat)<br/>*Full with obstacles and stunts<br/>*Road king musical fight and racing sound<br/>*New and attractive levels to paly the contest<br/><br/>How to play<br/>- Tilt the phone to move the bike left or right<br/>- Tap on the screen button to attack with punish, kick, bat and axes<br/>- Avoid from the direct contact with the road obstacles, other vehicles and bikers<br/>- Boast up the speed to cross the rivals <br/>- Try to have and crash and accident<br/>- Collect coins during the driving from your track", "metacritic": null, "released": "2017-11-04", "tba": false, "updated": "2019-08-02T04:28:55", "background_image": "https://media.rawg.io/media/screenshots/994/994f2e502abd0b0f0892b6833411ef9f_AORHNwb.jpg", "website": "http://soloftech.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 104, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Muhammad Qasim"], "genres": ["Action", "Racing"], "publishers": ["Muhammad Qasim"], "esrb_rating": null}