{"id": 238174, "slug": "the-ghost-town-adventure", "name": "The Ghost Town Adventure", "name_original": "The Ghost Town Adventure", "description": "WEEKEND SALE 50% OFF LIMITED TIME ONLY GRAB IT NOW!<br/>Discover the truth about the mysterious lost loot of who was at some point, the most searched outlaw of the far west: “Mad Dog Black Jack”. Explore a curious ghost town on the best graphic adventure game of 2017 as you discover the truth about the town’s sought hidden treasure, which is rumored to have a terrible curse.<br/><br/>Plot:<br/><br/>You’re a struggling bounty hunter who’s about to quit his career. You’re tired of not only being unable to provide for your family in the way you wished, but also of being your friends’ all-around joke.<br/>Just when you thought your luck would never change, it comes to your attention that a loot from the West’s biggest outlaw - Mad Dog Black Jack- that contains gold, jewels, and gemstones is hidden near an old abandoned mine town on which you grew up.<br/>However, it is also said that over this treasure lies a terrible curse that ensures a terrible fate to anyone who gets ahold of it. Luckily for you, you’re a man who doesn’t believe in such things and you think that an outlaw probably came up with the curse to scare bounty hunters like you off. <br/>So you decide to give yourself one last chance and move on to undertake the search for this cursed treasure. After all the bad luck that has haunted you, nothing could get any worse. Or can it?<br/><br/>Features:<br/><br/>-\tAmazing &amp; attractive graphics<br/>-\tA deep and catching  story<br/>-\tHours of addictive entertainment<br/>-\tFun and clever riddles<br/>-\tHundreds of different scenes to explore &amp; discover<br/>-\tExcellent game design, levels, and riddles<br/>-\tHigh-quality graphics optimized for last generation devices<br/>-\tMultiple languages, auto-save, and more…<br/>-\tPlus expect new game modes &amp; features on the upcoming free updates<br/><br/>Buy now!<br/><br/>If you’re new to adventure games, download now. You won’t regret it. It’s more than likely that you’ll become an instant fan of the genre. And if you’re already a fan you must have already bought it. You weren’t going to miss the chance.<br/>Take a look.", "metacritic": null, "released": "2017-04-15", "tba": false, "updated": "2023-08-23T14:55:09", "background_image": "https://media.rawg.io/media/screenshots/eb6/eb6309ce6889c548af2e706ee0935862_zOOy5xD.jpg", "website": "http://www.mediacitygames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 194, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["MediaCity Games"], "genres": ["Adventure", "Puzzle"], "publishers": ["Homero Rojas"], "esrb_rating": null}