{"id": 238132, "slug": "horse-carriage-transport-3d", "name": "Horse Carriage Transport 3d", "name_original": "Horse Carriage Transport 3d", "description": "Description: Life of Horse as a buggy carriage transportation (Horse cart driving)<br/><br/>If you love the old era and the horses, you will find so much fun with the horse carriage Transport simulation 2017. This is a Virtual Horse carriage racing simulation game reminding the Victorian era of horse carriages, car and royal chariot. It is a most trending horse buggy transport game of 2017 with detailed range of horse craft missions. <br/><br/>Take a ride in horse carriage transport simulator and enjoy some fun. We are sure that you have not played such sort of horse carriage games as yet. So revive the uniqueness in horse simulator games. This Horse Carriage Transport Driver brings you the realistic experience of driving the grand old horse-drawn vehicle in the city. <br/>This is a game in which you control a horse carriage. Come on and don’t miss<br/>to play it. Select your horse carriage and enter into the amazing farm environment.<br/><br/>How to play horse carriage transport simulation 2017: <br/><br/>The game play is very simple. In this game you will have control of horse buggy with the help of joystick. Drag forward joystick and move horse carriage transportation to the highlighted spot and there your jockey will be waiting for you, then ride and have adventure of unique transportation. Your target is to Drive the carriage with pony horses, pick the passengers and tourists and drop them to their respective destination. Carry passengers and kids and drop them to market, play grounds, grand halls and churches. You will have to complete all the levels within the given time otherwise you’ll be unable to go through the next level. Remember! Prevent your horse buggy carriage from hitting anything like from buildings, traffic cars and civilians etc.This incredibly convincing horse carriage ride game is packed full of 15 thrilling and dynamic levels. It is time to become the best rider in horse carriage transport simulator 2017. Download free horse carriage transport simulator 2017 is one of the best horse riding game 2017, a new adventure which is full of venture and detailed fun for animal games lovers. <br/><br/>Game Features:<br/><br/>1) Become a virtual horse carriage driver 2017.<br/>2) Transport passengers<br/>3) Amazing 3D City Environment<br/>6) Joystick to move all around the city<br/>7) Horse and buggy with complete detailing.<br/>8) Fog and snow in the environment<br/><br/>Your Feedbacks and ratings are valuable for us to keep ourselves busy in creating more fun in the games to entertain you. In case if you find any bug that needed to be addressed just send us an email, we will improve it and reply to your email as soon as possible.<br/><br/>Download horse carriage transport 2017 absolutely free.", "metacritic": null, "released": "2017-06-09", "tba": false, "updated": "2019-10-22T14:16:53", "background_image": "https://media.rawg.io/media/screenshots/4d0/4d08a1553c6e8d32e65d03a1bee135b3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 157, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Asad Ali"], "genres": ["Adventure", "Simulation"], "publishers": ["Asad Ali"], "esrb_rating": "Everyone 10+"}