{"id": 238279, "slug": "dark-nova", "name": "Dark Nova", "name_original": "Dark Nova", "description": "WANTED: Ship captains!<br/><br/>*** Follow us on Twitter http://twitter.com/dead_jim for the latest updates from the dev team and check out http://darknova.net! ***<br/><br/><br/>\"If your eyes light up when you hear the word \"Elite\" in a non-Xbox 360 setting, go buy Dark Nova right now.\" --gamesradar<br/><br/>***** \"Awesome - Completely addicting game. It's really fun to engage in lifelike trading with a space twist.\"<br/><br/>***** \"Get This Game! - I can not explain to you how much I love this game. It uses little battery, doesn't need wifi, and it's addicting!\"<br/><br/>***** \"Brilliant - Excellent space trader executed with wit and style. I've sunk hours into it already.\"<br/><br/>This is an old school RPG experience! This game has depth and many hours of entertainment. This is not a mindless shooter!<br/><br/>Dark Nova is the essential single-player role-playing game we’ve all been waiting for on the iPhone.  A real-time expansive universe consisting of over 100 star systems, each with many planetary bodies make this a game that you don’t master in short order.  Buy and sell goods between star systems, make a profit and try to avoid the Police along the way...if you can.  Become a trader, a pirate, or a mercenary for hire.  There’s a market for all professions.<br/><br/>Classic SciFi RPG style play. 100's of hours of entertainment. Design your character then work your way up from a small fragile ship to a juggernaut brimming with weapons and gadgets.<br/><br/>Dark Nova is the highly anticipated conversion of the classic Palm Pilot game “Space Trader” for the iPhone.  A complete and total graphical overhaul and game flow/design update. Visually stunning graphics, a luscious soundtrack, and an unbeatable auto-saving mechanism make this the game we’ve all been waiting for.  Be the first space cadet on the block to get it.<br/><br/>Go on mysterious quests and adventures. With elements from SciFi classics like Elite, Star Control, Privateer, Sundog, Starflight, Trade Wars, Freelancer, and more!<br/><br/>Got an escape pod? You'll need it rookie!", "metacritic": null, "released": "2009-04-20", "tba": false, "updated": "2019-10-22T14:17:00", "background_image": "https://media.rawg.io/media/screenshots/40a/40a4d10ccd00a2bca25cae425abd9544.jpg", "website": "https://www.facebook.com/Dark-Nova-103010332744/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 118, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Dead Jim Studios"], "genres": ["RPG", "Strategy"], "publishers": ["Shon Burton"], "esrb_rating": "Teen"}