{"id": 238274, "slug": "simon-says-2", "name": "Simon Says +", "name_original": "Simon Says +", "description": "Simon Says+ is an addictive and challenging memory game based on Simon Says classic game - one of the most popular games of all time!<br/><br/>You have some free time, waiting in line or just want to chill? This game is perfect for you!<br/><br/>The objective of the game is simple: you need to reproduce the colours presented in the right sequence. In every step, one new movement is added. So it's getting really challenging pretty soon. Just try and see how long your memory allows it you can keep up!<br/><br/>It has four game modes:<br/><br/>• Classic - Repeat the sequence in the same order.<br/>• Dynamic - You play as in classic mode, but starting with 4 buttons and being surprised with the dynamic increase of buttons.<br/>• Reverse - Repeat the sequence in reverse order.<br/>• Shuffle - The sequence will change at every level.<br/><br/>It´s fully configurable: you can change the look and feel, game speed, play on a 2x2 or 4x4 board, change the starting level, and turn sound effects on or off.<br/><br/>Compare your score with your friends or the rest of the world with built-in Game Center leaderboards.<br/><br/>Don't be fooled by the simplicity of this game, if you reach level 30 you are a genius!.<br/><br/>Main features:<br/><br/>• 4 Look and feels (Classic, Piano, Aquarela and Piano Kids). <br/>• 4 Game modes (Classic, Dynamic, Reverse and Shuffle).<br/>• Play on a 2x2 or 4x4 board.<br/>• Repeat sequence button available.<br/>• Start at the level you want.<br/>• Set the game speed you want.<br/>• Turn sound effects on or off.<br/>• 3 Continues per game.<br/>• Paid version without ads.<br/> <br/>Don't forget to rate us and send your suggestions!", "metacritic": null, "released": "2015-03-04", "tba": false, "updated": "2021-06-18T04:49:56", "background_image": "https://media.rawg.io/media/screenshots/316/316064bf19bb5860ba83d1c838f75742.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 58, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Flavio Serrazes"], "genres": ["Strategy", "Puzzle"], "publishers": ["Flavio Serrazes"], "esrb_rating": null}