{"id": 238256, "slug": "double-out", "name": "Double Out", "name_original": "Double Out", "description": "Have you ever lined up at the oche trying to double out, and you’re just not sure what numbers to shoot?  Me too!!  That’s what inspired me to develop this application.  I’ve been a dart player, in leagues, for over 10 years and this application has definitely improved my game. <br/><br/>With Double Out you can have all of the x01 double out options right in your hand.  Over time you will learn all of the possible double out options and your game will improve.  Doubling out is key to winning all x01 games!<br/><br/>- Supports all x01 games.<br/>- Highlights preferred double out options.  Shoot like the pros!<br/>- Provides ALL double out options for the scores 170 through 2.<br/>- Easily sort double out options by triples or doubles.<br/>- View double out options in standard or grouped layout.<br/>- Display outs shots in short (T20 – T20 – D20) or long (Triple 20 – Triple 20 – Double 20) formats.<br/>- Provides alternate double out options if you miss your primary target.<br/>- Select your Preferred Double Outs numbers.  Your numbers are highlighted at the top of the list.<br/>- Cascade through shots to target the ideal double out path.<br/>- Tutorial included in the application to get your started.<br/><br/>I hope you enjoy using Double Out!!<br/><br/>Triples for Show, Doubles for Dough!!!<br/><br/>If you have any feature requests or comments regarding the application, you can contact me on Twitter @doubleoutdarts.", "metacritic": null, "released": "2018-03-23", "tba": false, "updated": "2019-10-22T13:53:27", "background_image": "https://media.rawg.io/media/screenshots/306/3060a8cf80f1b4b33cafa82361580c77.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 75, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Eric Ruth"], "genres": ["Sports"], "publishers": ["Eric Ruth"], "esrb_rating": null}