{"id": 238260, "slug": "marple", "name": "Marple", "name_original": "Marple", "description": "AWARDED \"BEST PUZZLER\" IN MACWORLD'S \"THE BEST GAMES OF 2008\"!<br/><br/>NOMINEE FOR \"BEST PUZZLE GAME\" IN \"2008 BEST APP EVER AWARDS\"!<br/><br/>RATED \"BETTER\" IN APPREVIEW!<br/><br/><br/>Getting tired of Sudoku? Why not try Marple?<br/><br/>Marple is a game of logic and deduction. The playing field consists of 20 tiles arranged in 4 rows of 5 columns each and a set of clues. The goal of the game is to figure out the correct order of those 20 tiles using the given clues by process of elimination.<br/><br/>There are four different types of clues: \"In between\", \"Left of\", \"Same column\" and \"Next to\". \"In between\" clue tells that the middle tile has to be located in between the other two. It however does not tell the order of the other two tiles or how far they are from the middle one. \"Left of\" clue tells that the left tile has to be located left of the right tile. It however does not tell how far apart they are. \"Same column\" clue tells that the two tiles have to be on the same column. \"Next to\" clue tells that the two tiles are adjacent to each other. It however does not tell the order of the two tiles.<br/><br/>Features:<br/> * 1,000,000 fiendishly clever puzzles to play so don't expect to run out of them any time soon! At 3 minutes / puzzle, 1 hour / day = ca. 137 years of puzzles!<br/> * Tutorial mode<br/> * Hint system that highlights a clue that you should be concentrating on next and also explains exactly what you should be doing next.<br/> * Graphical help with beginner tips", "metacritic": null, "released": "2008-08-28", "tba": false, "updated": "2020-06-19T02:33:48", "background_image": "https://media.rawg.io/media/screenshots/a08/a088923dc27d750b3caed230ca053f84_LPTmGDx.jpg", "website": "http://www.kotiposti.net/sodacan/marple/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 85, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Mikko Kankainen"], "genres": ["Strategy", "Puzzle"], "publishers": ["Mikko Kankainen"], "esrb_rating": null}