{"id": 2383, "slug": "karateka", "name": "Karateka", "name_original": "Karateka", "description": "<p>From PRINCE OF PERSIA creator Jordan Mechner, the original side-scrolling karate classic comes to Steam with art by Jeff Matsuda (The Batman) and music by Grammy-winning composer Christopher Tin (CIVILIZATION IV).<br />\nWhether you are a nostalgic Karateka fan or new to the game, Karateka will charm you with its classic love story set in feudal Japan. Fight to save the lovely Mariko from the evil warlord Akuma and reunite her with her True Love!Key Features:<br />\nRhythm-based combat mechanic. Easy to grasp yet challenging to master, the cinematic gameplay seamlessly blends a series of escalating karate battles with a simple human story.<br />\nThree playable characters. Three endings. Three suitors vie for Mariko’s love: A fearsome Brute, a noble Monk, and her brave True Love.<br />\nHighly replayable. Innovative “three suitors” system offers a compact single-playthrough experience, yet challenges advanced players to unlock more difficult achievements and endings as their skill improves.<br />\nUnique real-time score by Christopher Tin tells the story through the music. Authentic Japanese instruments and themes let you “hear” the onscreen action in real time.</p>", "metacritic": 48, "released": "2012-11-07", "tba": false, "updated": "2024-01-20T13:18:37", "background_image": "https://media.rawg.io/media/screenshots/9b4/9b42279591a018adcaae8a92cad80de1.jpg", "website": "http://karateka.com", "rating": 3.19, "rating_top": 3, "added_by_status": {"yet": 12, "owned": 388, "beaten": 15, "toplay": 3, "dropped": 4}, "playtime": 1, "achievements_count": 36, "ratings_count": 31, "suggestions_count": 505, "game_series_count": 0, "reviews_count": 31, "platforms": ["PlayStation 3", "Xbox 360", "Android", "iOS", "PC"], "developers": ["DotEmu", "Liquid Entertainment", "Karateka"], "genres": ["Action", "Family", "Fighting", "Indie"], "publishers": ["DotEmu", "D3 Publisher"], "esrb_rating": null}