{"id": 238390, "slug": "new-super-mario-bros-u-deluxe", "name": "New Super Mario Bros. U Deluxe", "name_original": "New Super Mario Bros. U Deluxe", "description": "<p>Take on two family-friendly, side-scrolling adventures with up to three <br />\n      friends* as you try to save the Mushroom Kingdom. Includes the New Super <br />\n      Mario Bros. U and harder, faster New Super Luigi U games—both of which <br />\n      include Nabbit and Toadette as playable characters!</p>\n<pre><code>  Two games in one, for double the fun! Simple, straightforward controls,   \n  new playable characters optimized for younger and less-experienced   \n  players, and a wealth of bonus content—like a Hints gallery and helpful   \n  reference videos**—make this a perfect choice for anyone looking to   \n  introduce their family to the wonderful world of Mario. All a player   \n  needs is one Joy-Con™ controller, so two people can team up right out of   \n  the box! Tackle 164 platforming courses in the two main game modes and   \n  enjoy extra replayability with three additional game modes in which you   \n  can also play as a Mii™ character: Challenges, Boost Rush, and Coin   \n  Battle!\n\n\n    A variety of playable characters are available, some with unique   \n    attributes that affect gameplay and platforming physics.\n\n\n    Younger and less-experienced players will love playing as Toadette,   \n    who is brand new to both games, and Nabbit, who was formerly only   \n    playable in New Super Luigi U. Both characters offer extra assistance   \n    during play.\n\n\n    Multiplayer sessions are even more fun, frantic, and exciting thanks   \n    to entertaining character interactions. Need a boost? Try jumping off   \n    a teammate’s head or getting a teammate to throw you!\n\n\n    Features a wealth of help features, like a Hints gallery, reference   \n    videos**, and a Super Guide in New Super Mario Bros. U that can   \n    complete levels for you if they’re giving you trouble.\n\n\n    Three additional modes—Boost Rush, Challenges, and Coin Battle—mix up   \n    gameplay and add replayability, while also upping the difficulty for   \n    players who want to try something harder. Players can use their Mii   \n    characters in these modes!\n\n\n    Share the adventure with a friend! During two-player co-op gameplay,   \n    each player can use a single Joy-Con controller, so no additional   \n    accessories are required. And to add two more players to the mix, all   \n    you need is one extra set of Joy-Con controllers (sold separately).\n</code></pre>", "metacritic": 80, "released": "2019-01-11", "tba": false, "updated": "2024-03-31T21:30:37", "background_image": "https://media.rawg.io/media/games/61c/61cf09a86fe686a01a0c9863fc4230a7.jpeg", "website": "", "rating": 3.81, "rating_top": 4, "added_by_status": {"yet": 40, "owned": 60, "beaten": 132, "toplay": 103, "dropped": 45, "playing": 37}, "playtime": 0, "achievements_count": 0, "ratings_count": 147, "suggestions_count": 101, "game_series_count": 0, "reviews_count": 153, "platforms": ["Nintendo Switch"], "developers": ["Nintendo"], "genres": ["Platformer"], "publishers": ["Nintendo"], "esrb_rating": null}