{"id": 238574, "slug": "metanormal-demo", "name": "Metanormal Demo", "name_original": "Metanormal Demo", "description": "<p><strong>---<em>If you enjoy this demo, please consider backing us on our upcoming Kickstarter</em>---</strong></p>\n<p><strong>*The demo mainly focuses on introducing the story, environment, and gameplay mechanics. The final version of the game will include complete world exploration and extensive choice making, elements that the demo lack.*</strong></p>\n\n<p><strong>Story</strong><br/></p>\n<p>Due to some unknown phenomenon, the spirits of the world are growing stronger. Unable to move on to the proper afterlife, they've grown restless being trapped in the Spirit Realm. Now that they're out, the strongest wish to terrorize the Human Realm. Some aspire to rule them. Others merely yearn for their destruction.</p>\n<p>It's up to Desmond Gates, the boy with the ability to interact with spirits, to restore order. </p>\n<p>By his side are his best friends, Cicilia Shine and Milo Martin.</p>\n<p> Accompanying them on their journey is Otto, a spirit that's been protecting Desmond since he was a child.</p>\n<p>Their path will constantly be fraught with danger, having to face a wide variety of opponents.</p>\n\n\n\n<p><strong>Gameplay</strong></p>\n<p>During combat you are taken out of the world and placed into a bullet-hell stage. Each stage will be unique and modeled around the opponent. Stages could also have sudden changes in combat mechanics, like switching from the usual free-roam to a platformer.</p>\n<p>The concept is simple, your goal is to deplete the enemy's health bar before they do the same to you.</p>\n<p>You attack by staying on top of a white-bordered object, most commonly a circle. </p>\n<p>You have to stay on it long enough for the white parts to completely disappear to cause damage to the enemy.</p>\n<p>That's easier said than done because the enemy will throw everything its got at you to keep you off it.</p>\n<p>If you find yourself low on health, chase the green HP Savers.</p>\n<p>It's up to you to decide how risky you want to play it.</p>", "metacritic": null, "released": "2018-09-13", "tba": false, "updated": "2019-02-02T14:05:51", "background_image": "https://media.rawg.io/media/screenshots/9c5/9c57c0cb6e44f0a836265dcaf030e1f2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 96, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["TheSecondGame"], "genres": [], "publishers": [], "esrb_rating": null}