{"id": 238614, "slug": "counter-terrorist-swat-shooter-fps-commando-strike", "name": "Counter Terrorist SWAT Shooter FPS Commando Strike", "name_original": "Counter Terrorist SWAT Shooter FPS Commando Strike", "description": "<p>An old village on the borderline is under the threats of terrorists attacks. Recently a village was attacked by a group of terrorists. You are army commando working with a SWAT team, it is now your duty to counter attack on these terrorists in this counter terrorist game. The area is the frontline of war, and the area is surrounded by with enemies all around. It’s hard to take large group of SWAT shooters and conduct the terrorist attack. So a small unit of SWAT team is conducting this counter terrorism operation in this battleground fps shooting game.</p>\n<p>In this counter terrorist SWAT shooter commando strike game, you will encounter some real action of battlefield and how to counter these attacks. The village is an old county which is surrounded by mountains. It is a peaceful area which is now converted into a battleground. Your mission is to stop these terrorists before they take hold this village in this commando strike as you are the guerilla force which handle these kinds of counter terrorism operations. Your main objective is to take down whoever is destroying the peace of the region and making it a battleground on the borderline.\r\n  </p>\n<p>In this counter terrorist fps shooting game, we have a great environment, smooth moving around, and easy to take down enemies in this terrorist attack 3D game. You act as a terrorism shooter and you have 2 other SWAT team members with you, which help you in this commando counter terrorist surgical strike. You and your counter terrorist teammates are equipped with latest military tech to clear this frontline and defend the people.\r\n  </p>\n<p>In this fps shooting game, you have 10 missions to complete, at the end you have to eliminate the terrorist leader. This is the game on war of terror to end the battlegrounds which are created in every peaceful region. Download this counter terrorist and commando strike game and don’t forget to provide your feedback which will help us in improving it more in future so that you enjoy this fps shooting game.\r\n</p>", "metacritic": null, "released": "2018-09-12", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/5e8/5e870c1c4375a3c36290702ebfbc458d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 79, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Logicgamestudio"], "genres": ["Action"], "publishers": [], "esrb_rating": null}