{"id": 23876, "slug": "lost-reavers", "name": "Lost Reavers", "name_original": "Lost Reavers", "description": "<p>The humid dust filled air and the remainders of the intruders who failed<br />\nbefore you are stoic reminders of the dangers that lie in seeking lost<br />\nand forgotten treasure. But all grievances can&#39;t compare with the<br />\noverwhelming satisfaction that one gains from gazing at a priceless<br />\nartifact. BANDAI NAMCO Studios is proud to present their latest<br />\nFree-to-play online co-op action game, LOST REAVERS.</p>\n<p>The lost treasures of the world lie scattered throughout various corners<br />\nof the Earth. But rare fortunes are never easily acquired. To recover<br />\nthese riches, it&#39;s going to take more than just a fortunate expedition.<br />\nYou&#39;ll need the wits to solve puzzles, the expertise to disarm traps,<br />\nand the armaments to fight legions of undead guardians. But that&#39;s not<br />\nenough; you&#39;re going to need a team of cunning explorers at your side.<br />\nTeam up with other voyagers online as you fight zombies, kill bosses,<br />\nand discover valuable relics in the most diverse locations on the<br />\nplanet. Acquire the treasure and successfully return with the cargo to<br />\ndivvy up the prizes and receive your share of the spoils!</p>\n<p>Features</p>\n<p>An Assortment of Treasure Hunters – Choose from a squad of<br />\nexpeditioners to tackle the missions ahead. Each character specializes<br />\nin a distinct attack style. From the bazooka blasting machine gunner to<br />\nthe katana wielding school girl, ther&#39;es a style for everyone to enjoy.</p>\n<p>Gain Levels and Unlock Weapons – As you go on missions, your<br />\ncharacter will gain levels, unlock more skills, and increase their funds<br />\nto acquire new weapons. But getting stronger is just a career perk; it’s<br />\nthe sparkle of a rare artifact that&#39;ll drive a treasure hunter to the<br />\nends of the Earth.</p>\n<p>Tactical Combat Planning – Before the mission begins, organize<br />\nyour character to be the ultimate treasure seeker. Strategize with<br />\nallies, modify weapons, or use items to give you the extra edge.</p>\n<p>Explore Elegant Environments – With a variety of different<br />\nroutes, puzzles, and enemy spawns, levels may be enjoyed multiple times.</p>\n<p>Play with Friends Anytime – Ally with up to three friends online<br />\nto take down formidable enemies and deactivate various traps so you<br />\nreach the treasure that lies deep within the level.</p>", "metacritic": null, "released": "2016-04-28", "tba": false, "updated": "2019-09-12T06:39:12", "background_image": "https://media.rawg.io/media/screenshots/bb5/bb5233c61ca5f385efe7187b71299fb5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 378, "game_series_count": 0, "reviews_count": 0, "platforms": ["Wii U"], "developers": ["Bandai Namco Entertainment"], "genres": ["Action"], "publishers": ["Bandai Namco Entertainment", "BANDAI NAMCO Entertainment US"], "esrb_rating": null}