{"id": 238745, "slug": "solar-windsurfer", "name": "Solar Windsurfer", "name_original": "Solar Windsurfer", "description": "Overview\r\nConcept\r\n<p>Solar Windsurfer is an endless runner in which you play a young alien named Grom who is learning how to surf on solar winds.</p>\n<p>All Gordnats are resistant to extreme heat and get their kicks from flying up and around jets of space radiation and through magnetic fields on the surface of the sun. The Gordnats worship the sun, not just because of its recreation potential, but because of its impressive plasmic maneuverings, so they share their knowledge of its scientific properties with each new generation. </p>\r\nGameplay\r\n<p>You play as Grom, a young Gordnat who is joining the sun surf for the first time and learning about the power of the great fiery star from his mentor, Broff. After a brief tutorial, you face intense solar weather occurrences that require you to navigate your way through targets and around increasingly more challenging obstacles. </p>\n<p>If you get through 3 consecutive targets, you enter a flow state that results in increased speed, more points, and a change in the music and environment. </p>\n<p>While Gordnats like the heat, they’re not completely immune to the most powerful of the sun’s emissions. You lose energy if you run directly into one of these intense solar occurrences, losing speed and taking damage to your sunsurfing board. Once you hit 6 of these solar flares, you have to return to your home planet to repair your board. </p>\n<p>Your points indicate your sun surfing skill. At the end of the game you have the option to play again and improve your score. </p>\n<p>---<br/>We'd love to hear what you think of our game. Thanks for playing. </p>", "metacritic": null, "released": "2018-09-09", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/513/51373822b93f13e52a17bbdc29ed8445.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 35, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["necole"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}