{"id": 238742, "slug": "in-the-shadows-itch-pedrosg-joaocasimiro", "name": "In the Shadows (itch) (Pedrosg, JoaoCasimiro)", "name_original": "In the Shadows (itch) (Pedrosg, JoaoCasimiro)", "description": "Introduction\r\n<p>Lockedin proudly presents this 3D game prototype called \"In the Shadows\".</p>\n<p>It was developed for our 3D Project assignment that was given to us in the second year of our course Digital Games and Multimedia.</p>\n<p>Be aware that currently this project is at an extreme early stage of development.<br/></p>\n<br/>\r\n\r\nGenre\r\n<p>The game takes place in an medieval era, in a semi open-world with a fantasy environment. It was mainly inspired by Lara Croft and Assassins Creed's franchises. It focus on the adventure aspect but with some Stealth involved.</p>\n<br/>\r\n\r\nStory\r\n<p>It follows the story of a young ambitious assassin that has a resolve of avenging her family honor. To succeed in her adventure she needs to use her skills to overcome whatever comes in her way. If you want to know more about the Lore of this game, please visit - Unavailable link.<br/></p>\n<p>Beware that the story is still in a very early stage of production and will have changes and adaptations to our needs.</p>\n<br/>\r\n\r\nLevels\r\n<p>There are three levels so far:</p>\n<p>1 - Tutorial, which is the part where is day time. To advance to the next level, go inside the entrance on cave, on the left side you will see an entrace, enter inside of it in order to progress.<br/></p>\n<p>2-  Cave, takes place on the underground cave. To advance to the next level you need to exit the cave.<br/></p>\n<p>3 - Village.<br/></p>\n<p>After you are in the Village there will be no ending, feel free to explore and just exit the game by pressing the key \"ESC\".</p>\n<br/>\r\n\r\nIn case you get stuck or have bad performance! (Read this)\r\n<p>There are two things that are worth mentioning.</p>\n<p>1 -  If you can't fully climb to the top of a vine in the Cave level, just use a diagonal movement while climbing (it's a bug), while grabbed to the vine, press for example W and D or W and A at the same time. We are aware of the bug of that mechanic, but for testing purposes you can cheat your way to the top of any climbing section. </p>\n<p>2- In case of bad performance, we're really sorry we haven't implemented various quality settings or resolutions, in our next patch those are the first functionalities we are going to make sure to add.</p>\n<br/>\r\n\r\nControls\r\n<p>We are going to update shortly this section, but if you have problems either interacting or activating some part of the level, just try a different button on the controller or keyboard, we're sorry we haven't had the time to fix it.</p>\n<br/>\r\n\r\nAssets Used\r\n<p>We want to give a big shout out  to some amazing people who made so many free assets to students like us to have a starting point!</p>\n<p>1- No info.<br/></p>\n<p>2- No info.</p>\n<p>3- No info.<br/></p>\n<p>4- No info.</p>\n<p>We will update this very shortly! We are very sorry for not referring to them right now!</p>\n<br/>\r\n\r\nStaff / Developers\r\n<p><strong>João Casimiro</strong> - Programmer, Gameplay Mechanics, AI Behaviour, Lead Game Designer, Shaders,  Animations, Particles, Code Optimization.<br/></p>\n<p><strong>Pedro Godinho</strong> - Level Design, Game Designer, Material Programming, Lighting, 3D Modelling, Textures, Game Optimization, Particles, Concept Artist.</p>\n<br/>\r\n\r\nBig Thanks!\r\n<p>We want to give a big thanks to <strong>Gustavo Reis</strong> and <strong>Filipe Gonçalves</strong> for being our tutors during this prototype and being very available to help us at any time!</p>\n<p>Links not available</p>\n\n<p> Also, special thanks to School of Technology and Management - Polytechnic of Leiria, of given us this opportunity to create amazing things!</p>\n<p>https://www.ipleiria.pt/estg/<br/></p>\n\n<br/>\r\n\r\nBugs and Feedback\r\n<p>There are plenty of bugs that we as developers are aware, but still, feedback is much appreciated.</p>\n<p>Fell free to comment any bugs, new ideas for mechanics, visual improvements or just overall feedback of the game. We will be on the lookout for any positive or negative feedback, it will help us improve the game and ourselves as developers .</p>\n<p>Just a side note, the screenshots will be altered to include mechanics and character gameplay.</p>", "metacritic": null, "released": "2018-09-10", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/3d3/3d31d2aa250da5df80a0622b27772d5a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 550, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Pedrosg", "JoaoCasimiro"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}