{"id": 238853, "slug": "bingo-dragon-jackpot-slots", "name": "Bingo Dragon - Jackpot & Slots", "name_original": "Bingo Dragon - Jackpot & Slots", "description": "Best. Bingo. Ever. Welcome to Bingo Dragon! From the creators of Bingo PartyLand comes a Vegas Bingo adventure starring the lovable Dragon Monster, Supercharged Cactus, Lava Shooter, Fire Pepper and much, much more - Nothing like other Vegas Bingo games you’ve played!<br/><br/>New levels of EXCITEMENT! Woohoo! Join the little monster’s adventure to discover magical islands and superpowered boost creatures! New Bingo Dragon is full of new game modes, cinematic animations and crazy sound effects. Take on this magical world alone or play with friends to see who can win the most Bingos!<br/><br/><br/>**WARNING! - This Bingo game is super-addictive!<br/><br/><br/>~~~~~~~~~~~~~~~~~~~~~~~~<br/>EXCITING NEW FEATURES<br/>~~~~~~~~~~~~~~~~~~~~~~~~<br/>◆ SUPERPOWERED BOOST CREATURES - Meet the Supercharged Cactus, Flame Chili, Fire Pepper, Lava Shooter and much, much more - You’ll love their craziness as they help you to win!<br/>◆ STUNNING ANIMATIONS and SUPER FUN SOUND EFFECTS - It’s eye candy!<br/>◆ COMPETE against Bingo players and FRIENDS globally in real-time to earn trophies and rewards<br/>◆ ALL-NEW FULLY THEMED BINGO LEVELS across a richly imagined, colorful world - Cards Kingdom, Bubble Pharaoh, Jelly Monster, 70s Party, Dragon Warrior, District-Z, and much more!<br/>◆ COLLECT MYSTERIOUS ITEMS from Dragon Eggs to build your own Magical Islands!<br/>◆ LOADS of ADDICTIVE BINGO TOURNAMENTS - Be the champion on leaderboards!<br/>◆ ACTION-PACKED GAMEPLAY - Challenge yourself to play tons of cards with our intuitive control!<br/>◆ MASTER your Bingo skill in SPECIAL BINGO MODES!<br/>◆ PLAY the LOTTERY WHEEL to unlock more items - go on, give it a spin! Win the Jackpot!<br/><br/><br/>THAT’S NOT ALL -- Additional islands and exotic boost creatures coming soon!<br/><br/>The game is intended for adult audience for amusement purposes only. The game does not offer “real money gambling” or an opportunity to win real money or prizes. Practice or success at social casino gaming does not imply future success at \"real money gambling”.<br/><br/>~~~~~~~~~<br/>SUPPORT<br/>~~~~~~~~~<br/><br/><br/>We love Feedbacks! Contact us at hello+bingodragon@kingsify.com", "metacritic": null, "released": "2016-09-04", "tba": false, "updated": "2019-10-22T14:17:03", "background_image": "https://media.rawg.io/media/screenshots/8b2/8b2170b5b4898981007911aa16a5f8f3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 87, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Kingsify"], "genres": ["Board Games"], "publishers": ["Kingsify"], "esrb_rating": "Teen"}