{"id": 238850, "slug": "omg-casino-slot-machines", "name": "OMG! Casino Slot Machines", "name_original": "OMG! Casino Slot Machines", "description": "Play the world’s Best Casino Slots Games!<br/>The real Vegas Casino slot fun with Massive Payouts, HUGE Bonuses and EPIC Wins!<br/>Play 777 Vegas slot games with a unique slot machine experience, exciting bonuses and features. <br/>Sticky Wilds, Collapsing Reels, Classic Slots, scratch cards, Pokies, Multipliers, Real-Time Tournaments &amp; Epic Jackpots. <br/>Join our free Vegas slots casino app and become a VIP player - get into the exclusive HIGH ROLLER Lounge with higher bets &amp; Massive Payouts. New slot machines and special 777 slots are added all the time. Don’t miss out on all the fun! PLAY NOW!<br/><br/>Game Features<br/>• Huge Welcome Bonus &amp; Exclusive VIP experience<br/>• World’s 1st – Social Cash Back! Compete against other players to win BIG!<br/>• VIP Clubs &amp; High Roller Lounge <br/>• Lots of freebies to keep you spinning!<br/>• Real Time casino slots Tournaments &amp; Mega Jackpots<br/>• Triple your win with “Double or Nothing” feature! <br/>• Amazing Graphics &amp; Thrilling Game Play<br/>• Share your Wins and Spins with Friends for more Coins and Free Spins<br/><br/>OMG! Free slot games are simply the best Vegas games! Catch the excitement Now!<br/><br/>If you have any questions or suggestions, please feel free to contact support@luckyfishgames.com<br/> <br/>Like us on Facebook for fan page freebies https://www.facebook.com/OMGfortune Follow us on Twitter: https://twitter.com/omg_fortune<br/><br/>*This product is intended for use by those 21 or older for entertainment purposes only. All wins are virtual and not real money.<br/>*Practice or success at social casino games gaming does not imply future success at real money gambling.<br/>* Please note that OMG! Fortune Free Slots™ is free to play, but you can purchase in-app items with real money.", "metacritic": null, "released": "2014-09-01", "tba": false, "updated": "2019-10-22T13:53:31", "background_image": "https://media.rawg.io/media/screenshots/00e/00e8f4e6ea8e3791cee11a81ccf5c3a9_5UT7tts.jpg", "website": "http://www.luckyfishgames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 150, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["LuckyFish Games"], "genres": [], "publishers": ["LuckyFish Games"], "esrb_rating": "Teen"}