{"id": 238955, "slug": "lightstream-racer", "name": "Lightstream Racer", "name_original": "Lightstream Racer", "description": "Futuristic anti gravity racing! Bring the fun to the real world using Augmented Reality!<br/>Enjoy all modes, tracks and cars available. <br/>Grab screenshots and share stickers on iMessage.<br/><br/>Featured as Game of the Day on the App Store! (28/06/2018)<br/>Editor’s Choice Award – AR Critic (28/06/2018)<br/><br/>“Lightstream Racer is a fantastic augmented reality racing game and it’s definitely the best AR racing game I’ve played to this date.” - AR Critic (9.2/10)<br/>“Sci-fi graphics done in a futuristic style” - PDALIFE (9.7/10)<br/>\"A racing arcade with augmented reality\" - Games@mail.ru (8.5/10)<br/><br/>“An AR Take on Wipeout crossed with the classic MicroMachines\" – VRFocus<br/>\"If you've ever missed playing with the Hot Wheels track you once had\" – Pocket Gamer<br/>“one of the most convincing AR titles seen on iPhone and iPad” – iPhon.fr<br/>\"the track can completely encircle the player, providing a new perspective on the racing action\" – Techristic<br/><br/>AUGMENTED REALITY RACING<br/>See tracks appear in the real world using ARKit with iOS 12 in any location! Share your screenshots with #LightstreamRacer (Please stay safe and be considerate to others.)<br/><br/>PLAY WITH FRIENDS - MULTIPLAYER AR MODE<br/>Get 2 devices and race side by side in AR! One player places down the track in AR, the 2nd player joins and its game on! This mode uses ARKit 2 on iOS 12.<br/><br/>TAKE ON RIVALS IN ONLINE MODE<br/>Online mode lets you race against other player times on your device, the seeker takes on their time as you strive to overtake on every turn! Online mode features exciting 5-Lap and Hot Lap races.<br/><br/>RACE IN OUTER SPACE – MOBILE MODE<br/>Mobile mode lets you race in outer space! Complete all tracks, unlock all cars and compete online across all 5 lap and Hot lap races! Try controlling the camera view with your device gyroscope to take control of the action!<br/><br/>PLACE FUTURISTIC CARS IN THE REAL WORLD WITH CUTTING EDGE GRAPHICS!<br/>Get close to the action and see the stunning graphics with real-time lighting effects. Take a screenshot and share with your friends in AR Showroom mode! #LightstreamRacer<br/><br/>RACING GAMEPLAY<br/>Anti gravity racing in short circuit bursts, experience exciting arcade entertainment as you drift around corners, use the Mag Grip to hold tight! Extra momentum, awarded as you complete each lap, increases your top speed - making each lap faster than the last!<br/><br/>PLACE TABLETOP AND 360 DEGREE TRACKS<br/>Tabletop tracks appear as a race track in front of your eyes! 360 degree tracks let you choose where you want to stand, the whole track will surround you in this room scale experience! Don’t worry though you won’t need a large living room as you can simply turn around to keep pace with the car. (Please take care and be aware of your surroundings.)<br/><br/>COMPLETE CAREER MODE<br/>The path to earning your racing stripes! Compete against the Seeker in offline mode, to hone your skills in the virtual world. You’ll progress across multiple tracks and unlock new difficulties with faster cars. These then also become available in online mode. <br/><br/>GO FROM NOVICE TO INTERMEDIATE TO EXPERT<br/>As you rise in difficulty, more advanced cars with progressively higher top speeds are unlocked! Lap times come down, but the risk of drifting off the track increases! <br/><br/>PERFECT YOUR DRIFTING CONTROL<br/>Streamlined, two button control system is super intuitive to use while offering a huge amount of depth as you perfect your racing line. Momentum fills with every successful lap in race modes increasing your top speed making timing your acceleration critical.<br/><br/>BECOME A LEGEND<br/>Prove your mad skills and climb the Online leaderboard against other players! The leaderboard is available across all 5 Lap Races and Hot Lap track modes.<br/><br/>BE PART OF AN AWESOME COMMUNITY<br/>Challenge other player race times and make some new friends. Enjoy Lightstream Racer together!<br/><br/>Facebook,Twitter: LightstreamRace<br/><br/>Web: Lightstreamracer.com<br/><br/>---------------------<br/>Further information available in our FAQ:<br/>http://lightstreamracer.com/faq", "metacritic": null, "released": "2018-04-21", "tba": false, "updated": "2021-03-12T04:08:50", "background_image": "https://media.rawg.io/media/screenshots/cee/ceef86f86eb66e2501eedc8349abd6e3_FjsmjBh.jpg", "website": "https://www.facebook.com/LightstreamRace", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 501, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Virtual Arts"], "genres": ["Action", "Sports", "Racing"], "publishers": ["Virtual Arts"], "esrb_rating": null}