{"id": 238953, "slug": "mad-potions", "name": "Mad Potions", "name_original": "Mad Potions", "description": "In Mad Potions, you will play the role of an immature alchemist, run an alchemist hut, and use alchemy to help customers with bizarre needs. At the same time, you also need to constantly collect magic to maintain the livelihood of the alchemist hut...<br/>Basic Gameplay:\u2028    When three or more potions of the same color are on a straight line, they will be synthesized as an advanced potion. When a potion reaches a certain level, it will explode and upgrade other potions of the same color!<br/>Game Features:\u2028 <br/>[Unique Gameplay &amp; Easy Elimination]<br/>\u2028    Extensively evolved on the basis of classic elimination games, increasing the correlation between elements and completing continuous elimination in a brand new way. Eliminate troubles with an easy click!<br/> [Rich &amp; Wonderful Gameplay]\u2028<br/>    Hundreds of well-designed levels and more than twenty types of obstacle elements. Each level is dedicated to bring you a distinctive game experience, making you immerse yourself in it and love it!<br/> [Endless Levels &amp; Unlimited Fun]\u2028 <br/>   An endless game mode is used to bring unlimited fun to the game. You will have a whole new experience every time you play Mad Potions! Nonstop gaming, nonstop fun!<br/> [Fantastic Customers &amp; Joyful Alchemy]\u2028  <br/>   Strange customers will visit your alchemist hut and bring a variety of problems. There are even customers who will hinder the alchemy when angry! Use your magical alchemy to help them! The unstable results are also hilarious!<br/>   Every challenge is an experience. Constantly collect magic, strive to make the store open for longer, and do your best to help each customer with their problems.\u2028   Mad Potions is a game you will be fascinated with!", "metacritic": null, "released": "2018-09-13", "tba": false, "updated": "2019-10-22T14:17:07", "background_image": "https://media.rawg.io/media/screenshots/e16/e163a4810bd435a21a32ec35ee13af20.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 119, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["AppicPlay"], "genres": ["Strategy", "Puzzle"], "publishers": ["AppicPlay"], "esrb_rating": "Everyone 10+"}