{"id": 238932, "slug": "3dtd-chicka-invasion", "name": "3DTD: Chicka Invasion", "name_original": "3DTD: Chicka Invasion", "description": "【Game Introduction】<br/><br/>As a 3D AR tower defense game, 3DTD brings you not only maps rotated freely by 360°, but also a distinctive physics engine with outstanding 3D effects. Shield against arrows from the chickens, slant rolling rocks with blocks and blow up chickens with a hammer!<br/><br/>All you need to do is simple: rotate the map, put electric towers, crossbows and other weapons onto the grids you like and enjoy the battle with crazy and funny Chicken Expendables!<br/><br/><br/>【Game Features】<br/><br/>--New Gameplay<br/><br/>Build your 3D tower defense facilities on the floor, the table, the hand or anywhere to fight against the chickens!<br/><br/>--3D worlds<br/><br/>Simply rotate your view with one finger and defend against 360° all-out attacks from the chickens!<br/><br/>--Over 1000 Stages<br/><br/>Over 1000 3D stages including dungeons, flying whales and battleships are waiting for you!Rotating and dragging, complete all levels with lovely, funny and special items.<br/><br/>--Infinitely matches with 100 kinds of defense towers<br/><br/>Collect over 100 kinds of imaginative defense towers for infinite matches!<br/><br/>--A mass of cute chicken soldiers<br/><br/>A mass of cute characters and countless specialties and skills will make you in a mess for sure.<br/><br/>--Beyond the land<br/><br/>With brand-new airplanes and big boats, battles will happen on beyond the land!<br/><br/><br/>【Contact Us】<br/><br/>facebook：@CMGEIndie<br/><br/>Twitter:  @CMGE_Indie<br/><br/>Instagram: fantasticgames_cmge<br/><br/>Only available on iOS 9 or above temporarily<br/><br/><br/>【Fantastic Games, an independent games supporting program of CMGE】<br/><br/>Fantastic Games, the independent games supporting program of CMGE, provides independent game developers overall supports with funds, technologies and services. CMGE recently has achieved a strategic cooperation with some well-known independent game developers, domestic and abroad, such as LemonJam Studio, Coconut Island, and Chilly Room etc. They have brought us independent games in a joint effort, including Candleman, Shadow Play of Monkey King, Dino Hero, Riptide GP 3, Cute Runner, Sunpolis, Egg×Egg, Adventures in Dreamland, 3DTD, Uri: The Sprout of Lotus Creek, Miss Switch, and Usavich, Corecraft, Roundrick all recommended by App Store Top Games. Join Fantastic Games, let’s build endlessly-creative mobile games on and on with your unique skills and techniques, as well as ours.", "metacritic": null, "released": "2017-07-11", "tba": false, "updated": "2019-07-30T02:05:46", "background_image": "https://media.rawg.io/media/screenshots/e66/e662c8657d1b58fdd3993303b2390263.jpg", "website": "http://i.shengli.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 153, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["中手游"], "genres": ["Adventure", "Strategy"], "publishers": ["CMGE Group"], "esrb_rating": "Everyone 10+"}