{"id": 238933, "slug": "candleman-lite", "name": "Candleman Lite", "name_original": "Candleman Lite", "description": "*Candleman is developed by Spotlightor Interactive, and published with the cooperation of Fantastic Games, an independent game supporting program of CMGE* <br/><br/>Play Candleman for free now!<br/><br/>Candleman, is also a popular game on Xbox One, Playstation 4 and Steam. iOS version is available now. Download for free! Come and get in on the fun!<br/><br/>[Game Introduction]<br/><br/>Despite only being able to burn for 10 seconds, a little candle journeys into the darkness, with the purpose of seeking light. <br/><br/>[Game Features]<br/><br/>LOW-LIGHT GAMEPLAY <br/>Venture through the darkness with only 10 seconds light. <br/><br/>LUSH YET HAUNTING ENVIRONMENTS<br/>A mysterious world bathed in the radiance of lively light and vibrant colours. <br/> <br/>RICH AND VARIED CHALLENGES<br/>Face obstacles based on the mechanics of light and shadow. <br/> <br/>AN EMOTIONAL JOURNEY OF LOST AND FOUND<br/>Journey out of the darkness with the little candle, looking for the light.<br/><br/>[Reviews &amp; Comments]<br/> <br/>Like a playable Pixar short that'll warm your heart. - Mirror<br/><br/>A beautiful, finely-tuned death trap.  – Gamespot<br/><br/>One of the strangest, but surprisingly endearing, heroes. - Metro<br/><br/>It made me feel like I was a kid again. - A Flawed Orange<br/><br/>A refreshingly unique platforming masterpiece - Death Essence<br/><br/>Any younger gamers would definitely enjoy this game. - vx FluxWolf xv<br/><br/>A great example of just an awesome indie game – LifeSuxPlayHALO<br/><br/>[Contact Us]<br/> <br/>Facebook: @CMGEIndie<br/> <br/>Twitter: @CMGE_Indie<br/> <br/>Instagram: fantasticgames_cmge<br/><br/>*This game is only compatible with devices running iOS 9 or later.*<br/><br/>[Fantastic Games is an independent games supporting program of CMGE]<br/> <br/>Fantastic Games, the independent games supporting program of CMGE, provides independent game developers overall supports with funds, technologies and services. CMGE recently has achieved a strategic cooperation with some well-known independent game developers, domestic and abroad, such as LemonJam Studio, Coconut Island, and Chilly Room etc. They have brought us independent games in a joint effort, including Shadow Play of Monkey King, Candleman,Dino Hero, Riptide GP 3, Cute Runner, Sunpolis, Egg×Egg, Adventures in Dreamland, 3DTD, Uri: The Sprout of Lotus Creek, Miss Switch, Usavich, Mimpi Dreams, Fat Bunny, Roundrick,and Follower Z all recommended by App Store Top Games. Join Fantastic Games, let’s build endlessly-creative mobile games on and on with your unique skills and techniques, as well as ours.", "metacritic": null, "released": "2018-06-12", "tba": false, "updated": "2019-10-22T14:17:06", "background_image": "https://media.rawg.io/media/screenshots/78d/78dda4aa786664dd2e0988ccfdb1894b_cF7RCQJ.jpg", "website": "http://i.shengli.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 224, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["中手游"], "genres": ["Adventure", "Puzzle"], "publishers": ["CMGE Group"], "esrb_rating": "Everyone 10+"}