{"id": 239076, "slug": "word-winder", "name": "Word Winder", "name_original": "Word Winder", "description": "The iPhone Mom says: <br/>\"Only the most addictive, challenging and entertaining word game app that I have ever played.\" <br/><br/>The App Review Zone says: <br/>\"The Word Winder word search game is one of those games that just keeps giving more and more and more!\" <br/><br/>AppCraver.com says: <br/>\"This is a must see app simply for its brilliant combination of word play, trivia and word building strategy.\" <br/><br/>And extra special, this month only: Word Winder delivers a dozen Mother's Day Puzzles -- just for you and totally in honor of our Moms. The dozen special puzzles are finely crafted by America’s most syndicated puzzle maker, David L. Hoyt (Daily Jumble™, Word Roundup™, &amp; many others). David makes all of the puzzles in Word Winder -- an app which contains six amazing and totally original games! <br/><br/>Play by yourself and choose one of four different puzzle games – every puzzle is hand crafted by David L. Hoyt. Or play together with friends and family (pass-and-play) in your choice of multi-player modes. The multi-player game is essentially the hit Word Winder board game launched in 2012! <br/><br/>Features of Word Winder include: <br/>  * 12 Free Mother's Day Puzzles -- play them this month <br/>  * 20 Additional Free Puzzles to get you started (5 each of 4 types) <br/>  * 31 Days of Unlimited Play of pass-and-play Multi-player <br/>  * Uses the Merriam-Webster Dictionary for determining answer validity! <br/>  * Super sharp retina design <br/>  * Game Center High Scores and Achievements <br/>  * Progress in all games/puzzles automatically saved <br/>  * 500+ additional puzzles available in collections (in-app purchases) <br/><br/>Word Winder is the game of winding words from the Man Who Puzzles America (David L. Hoyt) -- the game which has created amazing buzz all around the world since its 2012 launch! Try Word Winder today.", "metacritic": null, "released": "2012-11-29", "tba": false, "updated": "2019-10-22T14:16:58", "background_image": "https://media.rawg.io/media/screenshots/108/108e4ad79b318557fa7a7288a2b8eac1.jpg", "website": "http://www.wordwinder.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 123, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Adveractive"], "genres": ["Puzzle"], "publishers": ["Adveractive"], "esrb_rating": "Everyone 10+"}