{"id": 23908, "slug": "skylanders-superchargers-racing", "name": "Skylanders SuperChargers Racing", "name_original": "Skylanders SuperChargers Racing", "description": "<p>\n      Rev your engines! Skylanders®, the #1 kids' console franchise worldwide \n      is taking to Land, Sea and Air with Skylanders® SuperChargers \n      on September 20 in North America. Skylanders SuperChargers \n      expands upon the franchise's signature gameplay to introduce \n      vehicles-to-life -- an entirely new way for fans to experience the magic \n      of Skylands. For the first time, kids can explore and navigate the \n      mountainous terrains, deep sea environments and big blue skies of \n      Skylands like never before with amazingly detailed vehicles, many of \n      which feature moving parts that will play in the real world and come to \n      life in the game via the Portal of Power®.\n    </p><p>\n      The trailblazing vehicles-to-life innovation of Skylanders \n      SuperChargers is realized when players take helm of powerful, \n      tricked-out land, sea and sky vehicles. Skylanders SuperChargers \n      is an unprecedented high octane action-adventure videogame where fans \n      have the freedom to speed across Skylands' roads in vehicular combat, \n      race down roaring rapids and engage in aerial dogfights as they barrel \n      roll through enemy swarms.\n    </p><p>\n      In addition to vehicle-to-life, Skylanders is packing some major star \n      power with the introduction of two of Nintendo's iconic characters -- \n      Donkey Kong and Bowser -- as guest stars in Skylanders SuperChargers. \n      The characters, along with their specially created vehicles will be \n      available exclusively in Skylanders SuperChargers Starter Packs \n      for the Nintendo platforms.\n    </p><p>\n      In Skylanders SuperChargers, Kaos' quest to rule over Skylands \n      reveals his most sinister weapon ever – a massive \"Doomstation of \n      Ultimate Doomstruction\" capable of eating the sky itself. Fortunately, a \n      special team of Skylanders known as the SuperChargers has been assembled \n      to pilot an incredible fleet of vehicles with the power to travel \n      through the destruction – over land, sea, and sky!\n    </p><p>\n      Skylanders SuperChargers introduces 20 new SuperCharger \n      characters and 20 new vehicles, while also supporting all 300+ \n      Skylanders toys from previous games, enabling any Skylanders character \n      to pilot land, sea or sky-based vehicles.\n    </p><p>\n      Additionally, for the first time, players can purchase the digital \n      Portal Owners Pack via connected consoles or for select iPads. They can \n      download the full AAA game and complete the mainline game with Instant \n      Spitfire SuperCharger and Instant Hot Streak vehicle. They can also use \n      a Portal they already own to enjoy the full game experience with \n      physical toys from the new Skylanders SuperChargers along with their \n      existing collections.\n    </p><p>\n      KEY FEATURES:\n    </p><ul>\n<li>\n        Vehicles-to-Life – For the first time, players can take their \n        Skylanders vehicles straight from the real world into the videogame \n        via the Portal of Power to explore the land, sea and skies of \n        Skylands. The vehicles are aligned by element and terrain type, giving \n        players unique abilities and diverse experiences across different \n        settings throughout the game. Not only are the vehicles playable in \n        game, but many also have movable parts making the toys fun and \n        playable outside of the game.\n      </li>\n<li>\n        New Heroes – A brand-new class of Skylanders, known as \n        SuperChargers are ready to buckle up and throw down with special \n        in-game abilities that help Portal Masters fight Kaos. For the first \n        time in Skylanders history, two of Nintendo's iconic characters -- \n        Donkey Kong and Bowser -- will guest star in Skylanders SuperChargers. \n        These special Skylanders will be playable in both Skylanders \n        SuperChargers and select amiibo-compatible games with a simple \n        twist of the character's base. Turbo Charge Donkey Kong and Hammer \n        Slam Bowser will be exclusively playable on the following Nintendo \n        platforms: Wii U, Wii and the Nintendo 3DS family of systems.\n      </li>\n<li>\n        Customized Vehicles – In Skylanders SuperChargers, \n        kids explore Skylands like never before by going behind the wheel of \n        powerful, tricked-out vehicles. SuperChargers will have the ability to \n        customize vehicles in-game with super cool modifications and \n        upgradeable weapons. As players travel throughout the game, they can \n        also discover hidden mods such as a volcanic booster engine that spews \n        lava rocks and jet wings with feathers made of gold.\n      </li>\n<li>\n        SuperCharged Combos – For the ultimate gaming experience, \n        players can pair a SuperCharger Skylander with its unique signature \n        vehicle to create a SuperCharged combination, unlocking an exclusive \n        mod that revs up the performance of the vehicle. Turbo Charge Donkey \n        Kong and Hammer Slam Bowser's signature vehicles are available for \n        Nintendo platforms exclusively.\n      </li>\n<li>\n        More Diverse Gameplay – The game delivers a dynamic, \n        story-driven gameplay experience, filled with vehicle-based and \n        on-foot adventure – complete with combat, puzzles, mini games, \n        activities and platforming -- all set within a variety of compelling \n        environments. There will be 20 new vehicles toys that fans can play \n        with that feature a variety of designs and types – race cars, \n        motorcycles, boats, tanks, helicopters, jets, submarines and more.\n      </li>\n<li class=\"cms-indent\">\n        Land: Stunt, skid, and drift while driving and experiencing \n        high octane combat\n      </li>\n<li class=\"cms-indent\">\n        Sea: Explore underwater seas, race down roaring rapids and ride \n        the surf and waves\n      </li>\n<li class=\"cms-indent\">\n        Sky: Engage in aerial dogfighting and enjoy freedom of flight \n        with 360 degrees of control\n      </li>\n<li>\n        Fast-Paced Storyline – Fans can immerse themselves in an \n        all-new, high-velocity adventure that ignites imaginations and fuels \n        excitement as they speed through Skylands like never before.\n      </li>\n<li>\n        Online Multiplayer Gameplay – For the first time in Skylanders \n        history, Skylanders SuperChargers is offering online \n        multiplayer gameplay on console. Whether it's online co-op play in \n        Adventure Mode or four-player competitive racing, family and friends \n        are sure to have a blast. Voice-chat is available with players on your \n        friends list and with friends of friends to fuel fun competition \n        online.\n      </li>\n<li>\n        Racing Mode – Racing Mode is an all-new way to play, featuring \n        a mix of high-octane, supercharged racing and combat, accentuated by \n        power-ups, boosts, hazards and more. What's more, Racing Mode is \n        available right out of the box in the Skylanders SuperChargers \n        Starter Pack! There are a total of six race tracks in the Starter Pack \n        for fans to play – two for each terrain type: Land, Sea and Sky. \n        Players can also purchase Racing Action Packs that unlock additional \n        content. A total of three Racing Action Packs, one for each terrain, \n        will be available and include three special toys (a SuperCharger, \n        Vehicle and villain trophy). The villain trophy unlocks two new tracks \n        and new modes, including SuperVillain Cup, Boss Pursuit and Mirror Cup.\n      </li>\n<li>\n        Skylanders SuperChargers Racing for the Wii and 3DS: Fans can \n        augment their SuperCharger experience with a complementary, dedicated \n        racing combat game -- Skylanders SuperChargers Racing -- for the Wii™ \n        system and Nintendo 3DS™ hand-held system. All-new tracks, augmented \n        with power-ups, boosts, hazards and more, offer up to 50 different and \n        exciting gameplay experiences. On Nintendo 3DS, gamers can go \n        head-to-head with competitive multiplayer via local play or online \n        with up to four players. Iconic Nintendo character Bowser™ and his Sky \n        vehicle, Clown Cruiser are available in the Skylanders SuperChargers \n        Racing Starter Packs for Wii and Nintendo 3DS and can also be played \n        on the Wii U™ system. The Supercharged character not only works in \n        Skylanders SuperChargers Racing, but also as amiibo in compatible \n        Nintendo games, so players can store their saved data in both modes \n        with a simple twist of the figure's base.\n      </li>\n</ul>", "metacritic": null, "released": "2015-09-20", "tba": false, "updated": "2023-05-08T02:18:58", "background_image": "https://media.rawg.io/media/screenshots/1b9/1b901f9c9569c774dd07c4f4f5a87328.jpg", "website": "http://www.skylanders.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 1, "dropped": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 358, "game_series_count": 0, "reviews_count": 2, "platforms": ["Wii", "Nintendo 3DS"], "developers": ["Beenox"], "genres": [], "publishers": ["Activision Blizzard"], "esrb_rating": null}