{"id": 239378, "slug": "trump-tycoon-politics-game", "name": "Trump Tycoon: Politics Game", "name_original": "Trump Tycoon: Politics Game", "description": "The best political tycoon game is here!<br/><br/>Make some political stunts or nice charities or even bribe your enemies to gain votes and recognition. However, just doing that won’t be enough to get you to the top by themselves. Recruit staffers to help generate revenue and woo endorsements from top politicians for unique and powerful bonuses.Tap your way from a lowly campaign volunteer up to the highest office in the land!<br/><br/>KEY FEATURES:<br/><br/>Political Tapping Fun - With tons of way to earn money and rise to new and more powerful offices, how you go about doing it is up to you. Do you concentrate on tapping for cash, do a political stunt to get some cash or focus on bribing / funding political lobbies and other elements to passively generate money while you’re offline?<br/><br/>Strategy - Deciding which party to run for or which lobbies to invest in is just the tip of the iceberg. Retire from your campaigns in order to score coveted political capital that you can spend on endorsements from powerful party leaders or just bribe your way through all the possible problems from your pocket. Get votes by supporting a community or delivering promises and winning people's hearts. The more you promise the more votes you can possibly get.<br/><br/>Lot of Content - Unlock all the accessories, change the office to a better one and also the look of the future president himself, dozens of powerful upgrades that open up even more possibilities to play the game any way you want.<br/><br/>Be the best pocket politics tycoon in the history of mankind.", "metacritic": null, "released": "2016-09-26", "tba": false, "updated": "2019-10-22T14:15:17", "background_image": "https://media.rawg.io/media/screenshots/1e8/1e876e1ac953f930080f3339fcd38a0c_KEK5UTK.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 85, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Romit Dodhia"], "genres": ["RPG", "Strategy"], "publishers": ["Romit Dodhia"], "esrb_rating": null}