{"id": 239311, "slug": "pandas-road-to-strongest", "name": "PanDA's Road To Strongest", "name_original": "PanDA's Road To Strongest", "description": "The realization of the tension of real fight!!<br/>  The 3rd work of the GROVE series!!!<br/>　And also the 2nd work of the complicated animating object real collision judging system(CAORCJS).<br/>　Real collision judging by CAORCJS, speedy fight, essence of close fight.<br/>　Win the victory in this new fight on the bluetooth vs fight!!<br/><br/>　All of attack, defence, dash, GROVE attack and deadly attack have an important meaning.<br/><br/>　You can corporate these acts and create various strategies.<br/>　It's so speedy fight though, you can take various selections in every instant.<br/>　And in order to suppoert it's speedy fight, gauges are displayed beside a character(Floating gauge system).<br/>　Especially, the head HP and stomach HP are very important, without switching the guard position correctly you become disadvantageous overwhelmingly.<br/>　Your checking gauges is very important, and linked directly with your act.<br/>　When the HP gets low, you can recover it by killing time with the GROVE attack, the SPIRIT attack and so on.<br/>　By CAORCJS, attacks hit the oppenent as you watch them.<br/>　A fist/kick collides with a fist/kick.<br/>　Dignity of the SPIRIT attack as a deadly blow. I thought it's absurd that a deadly blow fails. So, whenever you excute it, it almost hits the opponent. So it's damage is low, but the benefit is large such as killing time and aiming at HP recovery.<br/><br/>　Case1: When you blow off your opponent,<br/>　　- you can dash and rush him.<br/>　　- you can dash backward to take distance and aim to recover your HP.<br/>　　- you can aim to increase the SPIRIT gauge.<br/><br/>　Case2: When the oppenent's head HP lowers,<br/>　　- you can deliver stomach attacks and make him lower the guard.<br/>　　- you can break down his guard by your GROVE attack.<br/>　　- you can rush him by your SPIRIT attack.<br/><br/>　Case3: When you get rushed by the opponent,<br/>　　- you can wait and see depending on the auto guard.<br/>　　- you can aim to hit him a counter GROVE attack.<br/>　　- you can guard over the low HP position.<br/><br/>　Thus, according to circumstances, you can take various strategies.<br/>　It's easy to deliver attacks by only touches. It's just the instant judging and strategy to decide the winner.<br/>　To enjoy tense vs fight over Bluetooth, I gave it various devices.<br/><br/>　A FOREST soldier PanDA's story in his youth.<br/>　It's the beginning of the battle of PanDA and his company.<br/>　He aims to become the strongest.<br/>　What's the true reason that his master trains him so hard?", "metacritic": null, "released": "2013-01-01", "tba": false, "updated": "2019-07-19T02:21:47", "background_image": "https://media.rawg.io/media/screenshots/fb8/fb8705394ae7d7df86615365fbbc21ab_UG56YxE.jpg", "website": "http://tandm.biz/game/2013/panda/PanDARoadToStrongestEng.html", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 161, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tetsuyoshi Morikawa"], "genres": ["Action", "Sports"], "publishers": ["Tetsuyoshi Morikawa"], "esrb_rating": null}