{"id": 239381, "slug": "idle-cafe-tycoon-tap-story", "name": "Idle Cafe Tycoon - Tap Story", "name_original": "Idle Cafe Tycoon - Tap Story", "description": "Start your very own Cafe Business / Coffee Shop today, invite the customers to your store in the most awesome way possible - just tap tap tap to make customers flood your store, Expand your cafe and Become the next Cafe Shop Tycoon!<br/><br/>Opening your own coffee shop / cafe has never been this rewarding!<br/>Where have you been all this time? Manage your own Cafe Restaurant and join the cooking game fever. Create new recipes and sell them to your customers! You can even hire employees and create more recipes and get a cooking fever!<br/>Coffee and You have one thing in common, BOTH OF YOU ARE BETTER RICH!<br/>Do you remember your dream about opening your very own coffee Shop or café or becoming a big business tycoon?<br/><br/>Cafe Tycoon shop features:  <br/><br/>:::::BUILD YOUR OWN CAFE BUSINESS:::::<br/>- Tap tap tap to make customers flood your store<br/>- Upgrade your shop, the customer will come automatically even when you're idle.<br/>- Hire hardworking employees and make them work for you.<br/>- Purchase, manage, participate in day to day operations to run the tycoon business<br/>- Upgrade and expand incremental cafe, add more floors to get new customers<br/>- Upgrade your cafe and equipments to unlock lots of food recipes<br/>- Unlock awesome furniture to make the cafe business even more attractive!<br/>- Improve your administrator’s skills<br/>Choose between a girl or a boy to train an expert and prepare the richest coffees, Frappuccinos, Lattes, Cupcakes, Pizzas and Hot cakes. The best starbucks simulator game.<br/><br/>:::::BECOME RICH:::::<br/>- Collect money even when you're away!<br/>- Passive income will help you grow even when you’re sleeping<br/>- Grow your business and be RICH! Don't waste your time, there's never been a better time to open cafe shop than today!<br/><br/>:::::BE THE BEST CAFE SHOP BUSINESS OWNER AND TYCOON:::::<br/>- Know your customers better and listen to their stories<br/>- Invite World's Best Baristas to join your coffee shop<br/>- Espresso yourself! Decorate your shop according to your taste!<br/><br/>Download now to start your coffee business, and next week you'll already be a Billionaire!<br/>What can you be in next month?<br/>Trillionaire?  Multi Billionaire? Or Multi Trillionaire? Even more maybe?<br/>Find out yourself!<br/><br/>Note 1: Idle Cafe Tycoon is an idle tap tap game. Some people also call it a clicker game. You just need to tap or click on your phone's screen to invite the customer. When you progress in the game, you can upgrade the items to make customer come automatically even when you're idle or away, you can also create your own recipes and sell them, hire employees, make better recipes, so you won't have to tap or click on the screen too often. (You can still tap or click on the screen to fasten your progress of course!)<br/><br/>Note 2: Idle Cafe Tycoon sometimes use \"Idle Game\" or \"Clicker Game\" or “Tap Tap” at the end of the name. But we're still the same game, since both idle game and clicker game define the general gameplay of Idle Cafe Tycoon. But don't worry, we can assure you that Idle Cafe Tycoon is more than just a general idle or clicker or tap tap game. Just give it a try! :)<br/><br/>Note 3: Idle Cafe Tycoon (or Idle Cafe Tycoon clicker game) is a free game but does offer in-app purchases of various kinds.<br/><br/>Got problems? Questions? Or simply want to share some love? Get in touch! info@theholycowstudio.com", "metacritic": null, "released": "2018-08-04", "tba": false, "updated": "2019-10-22T14:15:17", "background_image": "https://media.rawg.io/media/screenshots/0f4/0f41b7f3e70812f9873ecb755f47570e_4354ao3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 162, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Romit Dodhia"], "genres": ["RPG", "Strategy"], "publishers": ["Romit Dodhia"], "esrb_rating": null}