{"id": 239356, "slug": "video-game-tycoon-tap-story", "name": "Video Game Tycoon: Tap Story", "name_original": "Video Game Tycoon: Tap Story", "description": "Video Game Tycoon is an idle clicker business strategy game where you are in charge of running a game studio company that develops mobile games. Your end goal is to expand your business as much as you can to come out to the top as the leader of the mobile entertainment market.<br/><br/>You start as an independent dev working on mobile games and then slowly and smartly progress through hiring more people and making more games. This is a perfect game for everyone who are interested in game dev business or someone who wants to become a tycoon in  game development.<br/><br/>FEATURES<br/>- Automate your workflow to increase your idle income<br/>- Get idle cash, even when you are offline<br/>- Profit from a smart game or two to boost your economy<br/>- Hire employees to increase your per click money<br/>- Every employee has a special tycoon effect<br/>-SUPER CASUAL GAME PLAY Just keep tapping the screen. The perfect tycoon story!<br/>- Manage up to 29 employees to unlock<br/>- Make over 29 different games <br/>-TAP &amp; BUILD -  Build your game company, Hire employees, make money, upgrade your studio! Tap! Tap! Tapped!<br/>- Funny messages from employees either thinking or talking<br/>-First hand simulation for becoming a Game Company<br/>-UPGRADE &amp; GROW -  Plan your cash investments and level up your studio with multiple storey upgrades<br/>- Unlock cool items / accessories as you level up <br/>-Prestige Option<br/><br/>We're always listening to all feedback we receive! We want to make Video Game Tycoon the absolute best Tycoon and idle/incremental game and your feedback helps us reach that goal. We read *everything* you send us, so please let us know what you'd like to see!", "metacritic": null, "released": "2017-05-04", "tba": false, "updated": "2019-10-22T14:09:06", "background_image": "https://media.rawg.io/media/screenshots/121/1217d7032cb6304581f348075d9614f8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 148, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Romit Dodhia"], "genres": ["RPG", "Strategy"], "publishers": ["Romit Dodhia"], "esrb_rating": null}