{"id": 239387, "slug": "bitcoin-evolution-run-a-capitalism-firm-and-become", "name": "Bitcoin Evolution - Run A Capitalism Firm And Become A Billionaire Tycoon Clicker", "name_original": "Bitcoin Evolution - Run A Capitalism Firm And Become A Billionaire Tycoon Clicker", "description": "***FREE FOR A LIMITED TIME ONLY***<br/><br/>\"Bitcoin Evolution - Run A Capitalism Firm And Become A Billionaire Tycoon Clicker\" is a Virtual Bitcoin dealing game where you start running your Virtual bitcoin business. Start to mine Virtual bitcoins from your own mine and get more successful by clicking on the Virtual bitcoins and selling them. <br/><br/>Invest your virtual mined income thoughtfully and grow your virtual bitcoin firm. Soon you will be the most popular Virtual Bitcoin Capitalist and earn billions with your smart business. <br/><br/>But be aware that you will face all the problems that a successful merchant needs to go through. And don’t forget to launder your money !<br/><br/>How to play the game - Keep tapping, tapping, tapping and investing the money until you have enough virtual money to invest and build up a virtual Bitcoin Company.<br/><br/>Your goal is to build a Bitcoin Empire and become a Bitcoin Tycoon<br/>[ENDLESS HOURS OF FUN AND ENTERTAINMENT]<br/><br/>[HOW TO PLAY THIS APP]<br/><br/>■ Tap the Bitcoin in the middle of the screen to earn bitcoins<br/>■ Buy powerful items and lots of amazing extras at the stores<br/>■ There are three kind of play types:<br/>■ CPS (Cash per Second) play this game in idle mode<br/>■ CPC (Cash per Click) play this game as a mega hardcore clicker king!<br/>■ 12 Hour offline Production, Earn Passive income even when your app is closed <br/>■ Leveling up, the higher level the better offline production + More income<br/>■ Game center to compete with your friends, so you can beat them and become the first Bitcoin Capitalist<br/><br/>[Suggestions / Tips]<br/>■ Share your feedback to improve game so we know what to change<br/>■ If you like the game please Rate the game <br/>■ Use the passive income shop more often, it is a powerful tool while playing.<br/>\u2028<br/>[EASY TO LEARN BUT HARD TO MASTER]<br/>■ Be prepared to spend hours of fun time while you make endless money!!<br/><br/><br/>Is it a stupid game? Or are you just falling behind your friends and looking for excuses?<br/>Oh, and don’t forget to buy more Bitcoins.<br/><br/>Follow us on Facebook to know about our upcoming games and for Feedback / Suggestions ! - <br/>https://www.facebook.com/theholycowstudio<br/><br/>Disclaimer - The bitcoins are not real, it's just a fun game! Becoming bitcoin billionaire is applicable only to this game! please! the bitcoins in this game are not real!!", "metacritic": null, "released": "2015-12-21", "tba": false, "updated": "2019-10-22T14:15:17", "background_image": "https://media.rawg.io/media/screenshots/948/9486b9204105584a929e2f79650dfa65.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 76, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Romit Dodhia"], "genres": ["Strategy", "Simulation"], "publishers": ["Romit Dodhia"], "esrb_rating": null}