{"id": 239400, "slug": "taco-mucho-clicker-super-crafter-streetfood-truck-", "name": "Taco Mucho Clicker - Super Crafter Streetfood Truck Master Game", "name_original": "Taco Mucho Clicker - Super Crafter Streetfood Truck Master Game", "description": "***FREE FOR A LIMITED TIME ONLY***<br/><br/>\"Taco Tycoon - Mexico Streetfood Master Clicker Game\" is a Taco dealing game where you start running your Mexican Food Business.<br/><br/>Invest your virtual $ by selling Taco's thoughtfully and grow your Taco firm. Soon you will be the most popular Taco Boss and earn billions with your smart business. <br/><br/>But be aware that you will face all the problems that a successful businessman needs to go through. And don’t forget to launder your virtual money !<br/><br/>How to play the game - Keep tapping, tapping, tapping and investing the money until you have enough money to invest and build up an international reputed Taco Restaurant.<br/><br/>Your goal is to build a Taco Empire and become a Taco Tycoon <br/><br/>How to play this app?<br/><br/>■ Tap the Taco in the middle of the screen to earn money<br/>■ Buy powerful items and lots of amazing extras at the stores<br/>■ There are three kind of play types:<br/>■ CPS (Cash per Second) play this game in idle mode<br/>■ CPC (Cash per Click) play this game as a mega hardcore clicker king!<br/>■ 12 Hour offline Production, Earn Passive income even when your app is closed<br/>■ Changing Tacos as you go ahead and start unlocking different strains <br/>■ Leveling up, the higher level the better offline production + More income<br/>■ Game center to compete with your friends, so you can beat them and become the first Taco Tycoon<br/><br/>Suggestions / Tips<br/><br/>■ Share your feedback to improve game so we know what to change<br/>■ If you like the game please Rate the game <br/>■ Use the passive income shop more often, it is a powerful tool while playing.<br/>\u2028<br/>Is it a stupid game? Or are you just falling behind your friends and looking for excuses?<br/>Oh, and don’t forget to buy more Taco's.<br/><br/>Please Like us on Facebook to know about our upcoming games and for Feedback / Suggestions ! - <br/>https://www.facebook.com/theholycowstudio<br/><br/>Disclaimer - You do not make real money $$ from this game. $ is used only as in-game currency. Thank you.", "metacritic": null, "released": "2015-10-13", "tba": false, "updated": "2019-10-22T14:15:17", "background_image": "https://media.rawg.io/media/screenshots/742/7421b8fb95914ab97895e3d3a5697014.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 129, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Romit Dodhia"], "genres": ["Strategy", "Simulation"], "publishers": ["Romit Dodhia"], "esrb_rating": null}