{"id": 239488, "slug": "blood-honor", "name": "Blood & Honor", "name_original": "Blood & Honor", "description": "Blood &amp; Honor is an easy to pick up, hard to let go, world domination game.  It mixes the classic gameplay of risk and conquest board games with an innovative set of bonus cards that will give you access to air raids, nuclear bombs, assassins and more. With different maps, game modes and options, and the ability to play multiplayer games you will spend countless hours playing Blood &amp; Honor. <br/> <br/>*** Since its launch it has been featured in New &amp; Noteworthy, What’s Hot, Staff’s Pick and Great Strategy Games. <br/><br/>Highlights:<br/>- 7 Maps to choose from and more coming in future updates<br/>- Up to six players can battle for world domination<br/>- 3 AI difficulties <br/>- Pass &amp; Play <br/>- Real time Online multiplayer with built in chat<br/>- Automatic save/resume of offline games<br/>- Zoom and scroll in beautifully illustrated maps<br/>- Buy once, play everywhere with iPhone-iPod-iPad Universal support<br/><br/>You can try the lite version for FREE.<br/><br/>IMPORTANT: We take customer's feedback very seriously, this is clearly shown by the number of updates we have done since launch. So we ask that if you have an issue or suggestion you use the adequate channels (In game feedback, facebook, twitter, or email). Writing your issue on a review does not allow us to get back to you promptly. If you need for something to be resolved please email us at support@sandstorminteractive.com or use the mail button in the main menu screen of the game. Thank you!", "metacritic": null, "released": "2010-05-22", "tba": false, "updated": "2019-10-22T14:17:26", "background_image": "https://media.rawg.io/media/screenshots/507/507ef7e184f072f80abdb8fd7b24c8c5.jpg", "website": "http://www.sandstormi.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 154, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Sandstorm Interactive"], "genres": ["Strategy", "Board Games"], "publishers": ["SANDSTORM INTERACTIVE"], "esrb_rating": "Everyone 10+"}