{"id": 239575, "slug": "battle-hero-age-of-quest", "name": "Battle Hero - Age of Quest", "name_original": "Battle Hero - Age of Quest", "description": "How to play<br/>- Buy new hero by coin, Tommy is ready, you can buy Jack, Daniel or Maria<br/>- Buy new quest by coin or cashes , you must buy super gun to face difficult mission<br/>- Buy Item by coin or cash<br/>- If you have not enough coin or cash to buy , don’t worry, get more coin or cashes by in App Puchase<br/><br/>- Play the game :<br/>* Tap square left button to use item , you can change another items by left turn button and right turn button <br/>* Tap the square right button to switch guns<br/><br/><br/>1.1 Introduce the game<br/>Skeleton and monsters are walking around all over the your castle, kill the endless skeletons with your sword, magic skills, or even super frame. Save your castle, skeletons will destroy castle. Many heroes have already fallen, but you’ve managed to survive. Kill the most of the skeletons and monsters, collecting more coins or gems and ammunition to buy more powerful magic skills, which can kill the skeletons and monsters quickly<br/>FEATURES<br/>- Skeleton combat in different zones with 6 unique game modes <br/>- Kill Skeletons with 7 magic skills : small balls , lighting balls, fire balls, slashes, big fires, frame and rocket <br/>- 5 different types of items : mana flask, big mana, coin magnet, health kit, explosion. <br/>- 5 different types monster. You will face the boss in final battle <br/>- Great graphic and sound for shooter game <br/>- choose your heroes, 4 heroes : Tommy, Jack, Daniel, Maria<br/>- Earning big money with Admob interestital, show on Pause game, Game Over<br/>- Inn App purchase with 3 gem packs<br/>- Share game link, invite your facebook friends to get more cashes", "metacritic": null, "released": "2017-03-28", "tba": false, "updated": "2019-10-22T14:15:19", "background_image": "https://media.rawg.io/media/screenshots/ef8/ef88fd75209805e77cf41645348a2479.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 106, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Qingsheng Zheng", "YUANHUA YU"], "genres": ["RPG", "Strategy"], "publishers": ["Qingsheng Zheng", "YUANHUA YU"], "esrb_rating": null}