{"id": 239739, "slug": "hearts-lite-2", "name": "Hearts - Lite", "name_original": "Hearts - Lite", "description": "While the history of hearts goes back to Spanish Reversis game in 1750-ies, the game truly took off after release as a part of Microsoft Windows in 1992. As any other successful game, millions of clones have been created on all possible platforms. So why should you give our version a try? We tried to recreate all the fun of original game in a tiny download package.<br/>Hearts is trick-taking playing card game for 4 players, no teams and no trump suit. The game is also known as The Dirty, Black Lady, Chase the Lady, Crubs, and Black Maria, though any of these may refer to the similar but differently-scored game Black Lady. The game is regarded as a member of the Whist family of trick-taking games (which also includes Bridge and Spades), but the game is unique among Whist variants in that it is an evasion-type game. The object of the game is to avoid taking points. When the first player reaches 100 points, the player with the lowest number of points is the winner.<br/><br/>In hearts each heart card is worth 1 point and the queen of spades is worth 13 points, which is as much as all of the other cards combined.<br/>At the beginning of round, the players choose three cards to pass to a random player. The player with the 2 of clubs must lead the first trick with the 2 of clubs. For each trick a player must follow suit unless he does not have a card of that suit. Because there is no trump, a player can not win a trick if he passes a card of any suit other than the suit lead. Hearts can not be lead until hearts are broken - after the first heart card has been played. If a player takes every point in a round, he “Shoots the Moon” and he receives 0 points for the round while all other players receive 26 points.<br/><br/>Don't forget to check our Games section for more fun games...", "metacritic": null, "released": "2012-03-13", "tba": false, "updated": "2019-10-22T14:15:26", "background_image": "https://media.rawg.io/media/screenshots/483/483d3fb8f7c445c56e3ef17f0c897941.jpg", "website": "http://www.gaspmobilegames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 60, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["GASP Mobile Games"], "genres": ["Strategy", "Card"], "publishers": ["GASP Mobile Games"], "esrb_rating": null}