{"id": 239728, "slug": "mahjong-solitaire-lite", "name": "Mahjong Solitaire -- Lite", "name_original": "Mahjong Solitaire -- Lite", "description": "Mahjong solitaire is a solitaire matching game that uses a set of Mahjong tiles rather than cards. The computer game was originally created by Brodie Lockard in 1981 and named Mah-Jongg after the game that uses the same tiles for play. Lockard claims that it was based on a centuries-old Chinese game called \"the Turtle\". However, it was not until Activision released Shanghai in 1986 for the Macintosh and Apple IIgs that the game gathered momentum. A version of this game was also included in the Microsoft Entertainment Pack for Windows 3.x in 1990 and went by the name Taipei. It was subsequently included in the Best of Windows Entertainment Pack. Premium editions of the Windows Vista operating system and Windows 7 include a version of the game known as Mahjong Titans.<br/>As any other successful game, millions of clones have been created on all possible platforms. So why should you give our version a try? We tried to recreate all the fun of original game with 60 different layouts in a tiny download package.<br/>A tile that can be moved left or right without disturbing other tiles is said to be exposed. Exposed pairs of identical tiles (Flower and Seasons tiles in the same group being considered identical) are removed from the layout one at a time, gradually exposing the lower layers to play. The aim of the game is to clear the layout by pairing up all the tiles. The game is finished when either the layout is empty, or there are no exposed pairs remaining.<br/>Don't forget to check our Game section for other fun games...", "metacritic": null, "released": "2012-03-22", "tba": false, "updated": "2019-10-22T14:15:26", "background_image": "https://media.rawg.io/media/screenshots/339/339e7f97876e37ff2707028b8fbba448.jpg", "website": "http://www.gaspmobilegames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 74, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["GASP Mobile Games"], "genres": ["Card", "Puzzle"], "publishers": ["GASP Mobile Games"], "esrb_rating": null}