{"id": 239703, "slug": "forty-thieves-lite", "name": "Forty Thieves Lite", "name_original": "Forty Thieves Lite", "description": "*******************************************************<br/>Love some variety in your game of solitaire? <br/>Why not try Solitaire Sweet? <br/>4 great versions of Solitaire for under $3! <br/>Includes the all time best seller, 40 Thieves.<br/>*******************************************************<br/><br/>Forty Thieves is a game of patience<br/>It is quite difficult to win and relies mostly on skill.<br/>You can play by dragging or double tapping.<br/>Double finger scroll down to show top toolbar on iPhone, double finger scroll up to hide it.<br/><br/>Challenge your friends and family to the same set of cards, to see who is the master of 40 Thieves!<br/><br/>Rules: <br/><br/>Two deck of cards are used (104 cards total).<br/><br/>Ten tableau piles of 4 cards each, face up and visible.<br/><br/>Eight foundation piles (top right of display)<br/><br/>Remaining cards (stock) are placed face down (top left of display).<br/><br/>You may only move the top card from any tableau (middle right of display).<br/><br/>For every empty tableau, you may move one additional card from one tableau to another.<br/><br/>You may place any card in an empty tableau.<br/><br/>Tableaus are built down by suit (king to ace).<br/><br/>Foundations are built up by suit (ace to king).<br/><br/>You may deal one card from stock to waste at a time.<br/><br/>You may only use the top card from the waste.<br/><br/><br/>You may only go through the stock once.<br/><br/>The object of the game is to move all cards to the foundations (8 piles ace to king of the same suit).<br/><br/>Do you have what it takes to win this game?", "metacritic": null, "released": "2012-04-05", "tba": false, "updated": "2019-10-22T14:15:25", "background_image": "https://media.rawg.io/media/screenshots/ee3/ee3f61bc85aea30cbb490e1248836e5d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 56, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Teraport Solutions"], "genres": ["Card", "Puzzle"], "publishers": ["Teraport Solutions"], "esrb_rating": null}