{"id": 239742, "slug": "freecell-solitaire-lite", "name": "FreeCell Solitaire -- Lite", "name_original": "FreeCell Solitaire -- Lite", "description": "The first computer version of the game is believed to have been created in 1978 for the PLATO system. One of the Microsoft developers noticed this version and implemented a version for Windows. It was first included with Win32s as an application that enabled the testing of the 32-bit thunking layer (does anyone remember what that was?). FreeCell remained relatively obscure until it was released as part of Windows 95.<br/>Since then the game has been ported to numerous platforms. So why should you give our version a try? We largely tried to recreate a full experience of the game in a tiny download package, including power moves, hints and undo (top right corner of the title bar). But there are also some minor twists to make it easier to play on a small factor mobile devices. In particular you don't have to select a card to move - drag and drop entire column - only appropriate cards will move, the rest will snap back. The cards will be moved to foundation automatically when possible. The scoring is also changed - only number of moves counted - the lower the score - the better.<br/><br/>Only the top (exposed) card of each tableau pile is available for play. It may be moved to a foundation pile, a free cell, or to another tableau pile. Within the tableau, cards are built down in sequence and alternating in color. Any card may be moved into an empty space. Blocks of cards may not be moved, unless the requisite number of free cells and/or tableau spaces are available to allow each individual card to be moved. To move part of partial pile, drag whole pile - the game will self adjust. If you fill all four foundation piles, you win.<br/>If you don't see any more moves try hints, undo (top right corner) to back track, or menu to start new game.<br/><br/>Don't forget to check our Games section for more fun games...", "metacritic": null, "released": "2012-03-13", "tba": false, "updated": "2019-10-22T14:15:26", "background_image": "https://media.rawg.io/media/screenshots/fd1/fd15258dc814bba8e5d4b452c61e418d.jpg", "website": "http://www.gaspmobilegames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 33, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["GASP Mobile Games"], "genres": ["Card"], "publishers": ["GASP Mobile Games"], "esrb_rating": null}