{"id": 239730, "slug": "spades-lite-2", "name": "Spades - Lite", "name_original": "Spades - Lite", "description": "Spades is a trick-taking card game devised in the United States in the 1930s, however the game truly took off after release as a part of Microsoft Windows in 1992. As any other successful game, millions of clones have been created on all possible platforms. So why should you give our version a try? We tried to recreate all the fun of original game in a tiny download package.<br/><br/>The object is to take at least the number of tricks that were bid before play of the hand began. The bids and tricks taken are combined for a partnership. Spades is a descendant of the Whist family of card games, which also includes Bridge, Hearts, and Oh, Hell. Its major difference as compared to other Whist variants is that, instead of trump being decided by the highest bidder or at random, the Spade suit is always trump, hence the name.<br/><br/>A standard pack of 52 cards is used ranked from highest to lowest: <br/>A, K, Q, J, 10, 9, 8, 7, 6, 5, 4, 3, 2.<br/>The four players are in fixed partnerships, with partners sitting opposite each other. The first dealer is chosen at random, and the turn to deal rotates clockwise. The cards are shuffled and dealt clockwise.<br/>All four players bid a number of tricks. Each team adds together the bids - number of tricks that team must try to win in order to get a positive score. Everyone must bid a number. Players are not allowed to pass and bids once made cannot be altered. A bid of 0 tricks is known as Nil. This is a declaration that that the player who bid Nil will not win any tricks during the play. There is an extra bonus for this if it succeeds and a penalty if it fails. The partnership also has the objective of winning the number of tricks bid by the Nil's partner.<br/><br/>The player to dealer's left leads any card (except a spade). Each player, in turn, clockwise, must follow suit if able; if unable to follow suit, the player may play any card. <br/>A trick containing a spade is won by the highest spade played; if no spade is played, the trick is won by the highest card of the suit led. The winner of each trick leads to the next. Spades may not be led until either some player has played a spade, or the leader has nothing but spades left in hand.<br/>A side that takes at least as many tricks as its bid calls for receives a score equal to 10 times its bid. Additional tricks (bags) are worth an extra one point each.  A side which (over several deals) accumulates 10 or more bags has 100 points deducted from its score. Any bags beyond 10 are carried over to the next cycle. If a side does not make its bid, they lose 10 points for each trick they bid. If a bid of nil is successful, the nil bidder's side receives 100 points addition to the score won (or lost) by the partner of the nil bidder for tricks made. If a bid of nil fails - that is, the bidder takes at least one trick - the bidder's side loses 100 points, but still receives any amount scored for the partner's bid.<br/>The usual rule is that when a nil fails, the tricks won by the nil bidder do not count towards making the partner's bid, but do count as bags for the team. The side which reaches 500 points first wins the game.<br/>Don't forget to check our Game section for other fun games...", "metacritic": null, "released": "2012-09-22", "tba": false, "updated": "2019-10-22T14:15:26", "background_image": "https://media.rawg.io/media/screenshots/9b7/9b7de6db8532284f26448d9d40c80c32_ZdZls3f.jpg", "website": "http://www.gaspmobilegames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 63, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["GASP Mobile Games"], "genres": ["Card"], "publishers": ["GASP Mobile Games"], "esrb_rating": null}