{"id": 239758, "slug": "revert-lite", "name": "Revert! - Lite", "name_original": "Revert! - Lite", "description": "Revert! based on the game that was invented in 1883 by Englishmen Lewis Waterman and John W. Mollett (each calling the other a fraud), and gained considerable popularity in England at the end of the 19th century. <br/>The modern rule set used on the international tournament originated in Japan in the 1970s: game company Tsukuda Original registered the game under the trademark name Othello, as a reference to the Shakespearean play, referencing the conflict between the Moor Othello and Iago, who describes himself as \"two faced\" and more controversially, to the unfolding drama between black Othello, and white Desdemona. The green color of the board is inspired by the image of the general Othello, valiantly leading his battle in a green field. Interestingly, 2002 press release about the origins of the modern game makes no mention of the original version. <br/>As any other successful game, millions of clones have been created on all possible platforms. So why should you give our version a try? We tried to recreate all the fun of original game in a tiny download package. <br/>The game is played by placing a piece (possible moves are highlighted on the board). All the enemy piece between your existing pieces and newly placed piece (vertically, horizontally or diagonally) will be converted and become yours. When playing against the phone, you are always a White. The game stops when there are no moves left. Use menu (top-right corner) to control difficulty, first move. You can configure the game to play against phone, another person or even to see game played by itself completely. <br/><br/>Don't forget to check our Game section for other fun games...", "metacritic": null, "released": "2012-04-13", "tba": false, "updated": "2019-10-22T14:15:27", "background_image": "https://media.rawg.io/media/screenshots/195/195605d2fe96537a06d8d6f0dead847b.jpg", "website": "http://www.gaspmobilegames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 18, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["GASP Mobile Games"], "genres": ["Board Games", "Puzzle"], "publishers": ["GASP Mobile Games"], "esrb_rating": null}