{"id": 239760, "slug": "dominoes-lite", "name": "Dominoes -- Lite", "name_original": "Dominoes -- Lite", "description": "The game begins by shuffling the dominoes and dealing a hand to each player. With two players, each one starts with 7 dominoes, with more players, each one starts with 5 dominoes. The player with the lowest double in their hand makes the first move.<br/><br/>Except for Block dominoes, if a player cannot make a move, they must draw dominoes from the boneyard until they get a domino that they can play. A player who cannot make a move and cannot draw because the boneyard is empty or they are playing Block dominoes, must pass their turn.<br/><br/>In All-Fives dominoes, If a domino is played and the sum total of all four sides is a multiple of 5, the player earns those points.<br/><br/>The round is complete when a player plays all of their tiles, or when a game is blocked and no more moves can be made. At the end of a round, the player with the lightest hand (least number of dots on their remaining dominoes) wins a point bonus - sum of all of their opponents dominoes minus any dominoes still left in the winner's hand.<br/><br/>To move tap a domino you want to place. If there is only one place it can go, game will place it automatically. Otherwise tap or drag-and-drop it to the connecting domino.<br/><br/>This free version is supported by 3rd party ads. Ads may use internet connectivity, and therefore subsequent data charges may apply. The photos/media/files permission is required to allow the game to save game data to external storage, and is sometimes used to cache ads.<br/><br/>Don't forget to check our Game section for other fun games....", "metacritic": null, "released": "2016-09-02", "tba": false, "updated": "2019-10-22T14:15:27", "background_image": "https://media.rawg.io/media/screenshots/f39/f397e4cf7285961c6e267018b3366922.jpg", "website": "http://www.gaspmobilegames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 59, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["GASP Mobile Games"], "genres": ["Board Games", "Puzzle"], "publishers": ["GASP Mobile Games"], "esrb_rating": null}