{"id": 239727, "slug": "old-maid-lite", "name": "Old Maid - Lite", "name_original": "Old Maid - Lite", "description": "Old Maid is a Victorian card game for two to eight players probably deriving from an ancient gambling game in which the loser pays for the drinks. It is a card-passing game where each player hopes not to end up with the odd card out—the Old Maid. Over the time however the simplicity of the game made it very popular with the kids age 5-10 years old. The game is played all over the world. It is known in Germany as Schwarzer Peter, in Sweden as Svarte Petter and in Finland as Musta Pekka (all meaning \"black Peter\") and in France as le pouilleux (\"the lousy/louse-ridden one\") or vieux garçon (\"old boy\"). So why should you give our version a try? Our game features special 41-card animal deck (2 cards each of 20 different kinds of animals plus one Old Maid card) with authentic animal sounds. We specifically optimized the game for small factor, touch screen devices. We hope you and your little one will enjoy this incarnation of the timeless classic. <br/><br/>How to Play Old Maid: <br/>- Each player gets ten cards. If you have any pairs of cards (two cards with identical animals), click both cards to discard them. <br/>- On your turn, click a card in the hand of the player on your right to take it. If you get a pair, click each card to discard it. <br/>- Play continues, with each player drawing cards from the player on their right and discarding any pairs. <br/>- Eventually one player will be left with the Witch (the \"Old Maid\") card. <br/><br/>That ends the game, and the possessor of the Witch card loses the game. <br/><br/>Don't forget to check our Games section for more fun games...", "metacritic": null, "released": "2013-04-02", "tba": false, "updated": "2019-10-22T14:15:26", "background_image": "https://media.rawg.io/media/screenshots/a5e/a5ed3ff3cf72842325245646b2a9bb17.jpg", "website": "http://www.gaspmobilegames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 58, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["GASP Mobile Games"], "genres": ["Card"], "publishers": ["GASP Mobile Games"], "esrb_rating": null}