{"id": 239741, "slug": "4-in-line", "name": "4-in-Line", "name_original": "4-in-Line", "description": "The concept of this strategy game is centuries old... It is said that Captain James Cook used to play a variant of Connect 4 with his fellow officers on his long voyages, and so this game has also been called \"Captain's Mistress\". Connect4 is named Force4, or Puissance4 in French, Forza4 in Italian, Conecta4 in Spanish, 4gewinnt in German, 4 op'n rij in Dutch, Fire på stribe in Danish, Neljän suora in Finnish, Czwórki in Polish, Четыре в ряд in Russian, 四子棋 in Chinese, and 四目並べ in Japanese... <br/><br/>The contemporary Connect4 game was launched by Milton Bradley at the beginning of the 70s. It consists of 7 columns, each 6 pieces high. This game is a neat conversion of a classic game where the aim is to connect four tokens in a row, either horizontally, vertically or diagonally, while keeping your opponent from doing the same. Sounds easy, but it is not! The \"vertical\" strategy you need to play Connect4 creates a unique challenge: you must think in a whole new way to block your opponent’s moves. <br/><br/>As any successful game, Connect 4 has been ported to numerous platforms. So why should you give our version a try? We largely tried to recreate a full experience of the game in a tiny download package, including powerful AI engine with multiple different difficult levels, ability to play against other person or the phone, undo and hints. Use menu (top right corner) to activate all those features.<br/><br/>Don't forget to check our Games section for more fun time killers.", "metacritic": null, "released": "2012-03-13", "tba": false, "updated": "2019-10-22T14:15:26", "background_image": "https://media.rawg.io/media/screenshots/327/327642f8f3afe0b9998006de3852f093.jpg", "website": "http://www.gaspmobilegames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 20, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["GASP Mobile Games"], "genres": ["Board Games", "Puzzle"], "publishers": ["GASP Mobile Games"], "esrb_rating": null}