{"id": 239953, "slug": "chibis-town", "name": "Chibis Town", "name_original": "Chibis Town", "description": "Welcome to Chibi Town! Lead and build your own city.<br/><br/>The time has come to create your own city. Explore every corner, build homes and special buildings and bring entertaining characters to life.<br/>Help the policeman to catch the thieves, put out fires with the firefighters, cook in the restaurant, transport goods and take care of your sick citizens in the hospital.<br/>Have fun with the mini-games and missions and you will be able to get all the vehicles. Chibi Town is a complete game in which children will learn with total freedom to manage resources and make their own decisions. They will discover five professions and help with the maintenance and cleaning of the streets.<br/><br/>Features:<br/>- Play with 11 different characters: policemen, firefighters, doctors, cooks, engineers and deliverymen.<br/>- Build special buildings: a police station, hospital, restaurant, gas station, supermarket...<br/>- Drive and improve your vehicles: ambulance, fire truck, police car, taxi, bus, delivery truck,  race car, scooter, ...<br/>- Complete all missions, challenges and mini-games.<br/>- Cook delicious recipes in the restaurant and surprise your customers.<br/>- Keep the city clean and the residents will always be happy.<br/>- Receive benefits for your characters' work and win great rewards to improve the city.<br/>- Find all the special items and help your characters use them.<br/>- Upgrade your vehicles to make them faster and more ecological, and fix them when they break down.", "metacritic": null, "released": "2015-11-10", "tba": false, "updated": "2019-10-22T14:15:33", "background_image": "https://media.rawg.io/media/screenshots/631/6318bcd9630da5ec26fa39727968c49a.jpg", "website": "http://xiibi.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 133, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Chibig"], "genres": ["Simulation", "Family"], "publishers": ["Chibig"], "esrb_rating": "Everyone 10+"}