{"id": 240120, "slug": "flight-flow", "name": "Flight Flow", "name_original": "Flight Flow", "description": "Do you love the challenge of air traffic control games but find adjusting altitudes, headings and vectors overwhelming? Then Flight Flow is the perfect game for you. It combines the mental exertion and strategic challenge of a realistic air traffic control simulation while avoiding the more complex jargon used in the industry.  <br/><br/>But don’t think that makes Flight Flow easy. Much like a professional air traffic controller, you have to be able to work well under pressure, multitask efficiently and have excellent observation skills to keep track of all the planes.<br/><br/>YOUR DUTY: You’re in charge of controlling the take-offs and landings of planes. Direct their routes by drawing straight lines via route points. Aircraft must reach their destinations via the Approach sector. You can use holding patterns to delay planes from landing when traffic gets too hectic. But be careful - avoid the no-fly zones, keep your eyes sharp and above all, watch out for that plane!<br/><br/>What makes Flight Flow exceptional:<br/><br/>·         Easy-to-learn line-drawing to direct planes<br/><br/>·         Unique use of realistic features of air traffic control<br/><br/>·         Managing both take-offs and landings increases the challenge<br/><br/>·         Use of holding patterns where aircraft can fly while waiting to land", "metacritic": null, "released": "2015-04-30", "tba": false, "updated": "2019-10-22T14:15:39", "background_image": "https://media.rawg.io/media/screenshots/deb/debd73508c5d0a0f36c4491f87de0e7a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 35, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["APPcalyptus UG"], "genres": ["Simulation", "Arcade", "Casual"], "publishers": ["APPcalyptus UG"], "esrb_rating": null}