{"id": 240258, "slug": "matching-christmas-card-memory-game", "name": "Matching Christmas Card Memory Game", "name_original": "Matching Christmas Card Memory Game", "description": "MATCHING CHRISTMAS CARD MEMORY GAME….<br/><br/>* Christmas Card memory game for kids is the classic board game, which help develop memory skills of children.<br/><br/>* Playing this animals matching game with your kids will help them improve their recognition while having fun.<br/><br/>* Kids memory game contains very cute images of different Christmas Card, which are on memory cards.<br/><br/>* Christmas Card memory game is a game for children of all ages, babies, preschoolers, school children and teens. Both, boys and girls will love this game.<br/><br/>* It has been recently scientifically proven that regular mental and concentration exercise can greatly improve memory of kids.<br/><br/>How to play MATCHING CHRISTMAS CARD MEMORY GAME:<br/><br/>For each level, player is required to tap the square buttons and need to memorise what is behind it in order to match its couple. Players are required to complete a level in minimum finger taps to match all Christmas Crads<br/><br/>Features of MATCHING CHRISTMAS CARD MEMORY GAME:<br/><br/>- Three different levels of game play:<br/>(2 x 2 puzzles), (2 x 3 puzzles), (2 x 4 puzzles), (3 x 4 puzzles), <br/>(3 x 6 puzzles), (4 x 4 puzzles), (5 x 4 puzzles), (6 x 6 puzzles)<br/><br/>- Also above all are main levels.<br/><br/>- It’s 10 sub Levels of all main levels…<br/><br/>- Memory game develops recognition, concentration and motor skills of kid.<br/><br/>- Matching games has cute sounds for kids<br/><br/>- Colourful HD graphic designed for toddlers<br/><br/>- Sound settings to adjust or even on/off game sounds and music<br/><br/>- Visual memory training<br/><br/>- Matching game has get maximum star.<br/><br/>- It helps kids to recognise and teach different Christmas Cards<br/><br/>- Matching game is designed and structured according to kid's mentality<br/><br/>- Application may contains ads to keep it free.<br/><br/>- Also Learn Christmas Card Object Spellings.<br/><br/>* Simple and intuitive interface which is easy to use and easy to play, specially designed for children.<br/><br/>* Christmas Cards memory games for kids is also optimised for tablets (provide HD pictures).<br/><br/>* This free animals memory game for kids will keep your children quiet and entertained in car, in a restaurant or everywhere.<br/><br/>Have fun to play with our matching game!<br/>************************** About Prophetic Games ****************************<br/>Prophetic Games brings you the latest creations of most loved categories of games and apps which are all hugely loved by kids and all peoples. We are entirely devoted to build user friendly games related to fun and learning for better educational familiarises and enjoyment for kids and all peoples. Stay with us for the latest updates of Prophetic Games on App Store and get more of games.<br/><br/>Reach us at: http://www.propheticdevelopers.com/<br/><br/>--- LIKE US ON FACE BOOK AND GOOGLE ---<br/><br/>Follow us:<br/><br/>https://plus.google.com/u/0/107142176278162766051/posts<br/><br/>Like us: https://www.facebook.com/propheticdevelopers<br/><br/>WATCH US:<br/>https://www.youtube.com/channel/UC1aBCmCUC_Y1_bjoz7qNtTg<br/><br/>We will be glad with your response. Contact us anytime for any questions and suggestions at E: info@propheticdevelopers.com<br/>Don't forget to give us a good rate if you enjoy our game!<br/>***************************************************************************************************", "metacritic": null, "released": "2016-12-05", "tba": false, "updated": "2019-10-22T14:15:42", "background_image": "https://media.rawg.io/media/screenshots/4c4/4c4a56d2bed79401697554e849e35cbd.jpg", "website": "http://www.propheticdevelopers.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 75, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Jaydeep Patel"], "genres": ["Puzzle"], "publishers": ["Jaydeep Patel"], "esrb_rating": "Everyone 10+"}