{"id": 240288, "slug": "gunship-air-helicopter-battle-gunner-strike", "name": "Gunship Air Helicopter Battle: Gunner Strike", "name_original": "Gunship Air Helicopter Battle: Gunner Strike", "description": "Its Gunship Helicopter shooting game. Where you have critical missions to complete. Compete with <br/><br/>one of the brutal enemy who play game of war with every country. In this age of fire, everyone <br/><br/>suffers the consequences.<br/>So become a heroic gunship helicopter pilot in one of the modern helicopter games of gunship <br/><br/>battle category. HELICOPTER AIR BATTLE has a specific helicopter combat mission that you need to <br/><br/>complete for becoming an ultimate savior soldier in this game.<br/><br/>Mission:<br/>Their military helicopter, war planes raid our army places, army camps, air base etc. Invading <br/><br/>your country with the heavy machines and making every place is a war zone. Your king just wanted <br/><br/>to save his own empire and his throne, not thinking about the common people. The alliances with <br/><br/>other countries did not work out. The fire of ignorance is going to affect all. In this clash of <br/><br/>power everyone seems hopeless.<br/><br/>Being an elite and brave lone army pilot you need to counter enemy helicopter attacks in order to <br/><br/>destroy enemy combatants chopper and release the base from the enemy possession. Your army <br/><br/>helicopter is equipped with weapons and armory to disgrace enemy choppers.<br/><br/>Game Features:<br/>- Multiple weapons<br/>- Smooth And Dynamic Heli Copter Controls With Real Physics.<br/>- Challenging missions<br/>- Machine gun and upgraded RPG<br/><br/>-------------------------------------------------------------------------------------------------<br/>Please, follow us on the following page; we would love your suggestions to improve our games to  <br/><br/>provide better entertainment to our followers, users and supports;<br/>Facebook;<br/>https://www.facebook.com/gamechief<br/><br/>For any questions about this game contact us: gamechief2016@gmail.com<br/><br/>Thanks for your feedback and support with ratings to improve this game.<br/><br/>Regards<br/><br/>GameChief Team 2016", "metacritic": null, "released": "2016-04-12", "tba": false, "updated": "2019-10-22T14:15:44", "background_image": "https://media.rawg.io/media/screenshots/526/5261e02db411c02b845c77097cfead91_gSwUPoL.jpg", "website": "http://www.islamicpro.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 305, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["uzair ahmad"], "genres": ["Action", "Arcade", "Casual"], "publishers": ["uzair ahmad"], "esrb_rating": null}