{"id": 240251, "slug": "butterfly-simulator-3d", "name": "Butterfly Simulator 3D", "name_original": "Butterfly Simulator 3D", "description": "Role play a BUTTERFLY :)<br/><br/>3D REAL SIMULATOR - You need to maintain your health, hunger, and energy to survive and protect yourself in the forest!<br/><br/>POLLINATE  FLOWERS - Find sweet flower nectar around the forest and pollinate roses, sunflowers, daisies, safflowers, and help bring life to the forest.<br/><br/>EPIC BATTLES - Run after, howl, and race to catch prey such wild bears, wolves, foxes, and rabbits!  Fight off your enemies who do not want you to survive in this dangerous forest!<br/><br/>CREATE A BUTTERFLY PACK - Create, unlock, and raise a pack of butterfly to help you hunt and gather food, keep your strength up, and win battles against your enemies.  <br/><br/>BE A REAL-LIFE BUTTERFLY - Gain experience points by trying to survive in this forest by searching for food, pollinating flowers, defeating your enemies, and attacking your prey!<br/> <br/>GAIN A BUTTERFLY PERSPECTIVE - Easy controls so you can live your life as a butterfly! Zoom in and out to accomplish your butterfly missions! Hunt prey to gain energy and experience points!<br/><br/>This game features:<br/>3D REAL SIMULATOR<br/>POLLINATE FLOWERS<br/>EPIC BATTLES<br/>BUTTERFLY PACKS<br/>HUNTING WILD BEARS, WOLVES, FOXES, and RABBITS<br/>COLLECTING DIFFERENT COLORED GEMS FOR ENERGY POINTS<br/>AWESOME HIGH-DEFINITION GRAPHICS<br/>ESCAPING FROM WILD PREDATORS OUT TO DESTROY YOU<br/>STRUGGLING TO SURVIVE IN AN UNKNOWN FOREST<br/>3D WORLD TO DISCOVER AND EXPLORE<br/><br/>Role play a REAL LIVE BUTTERFLY!<br/><br/>Like us on Doodle Club!<br/><br/>Follow us on Chroma Club!<br/><br/>Music by Kevin MacLeod (incompetech.com)<br/><br/>Icon Image Credit: \"Butterfly (Monarch) on a Penta\" by A. Yee under Creative Commons 4.0 license/cropped from original", "metacritic": null, "released": "2015-09-03", "tba": false, "updated": "2019-07-30T13:41:22", "background_image": "https://media.rawg.io/media/screenshots/1be/1bee7d4e8a8a6bd28c05b185415ee89d.jpg", "website": "http://www.chromaclub.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 77, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Chroma Club"], "genres": ["RPG"], "publishers": ["Chroma Coders"], "esrb_rating": "Everyone 10+"}