{"id": 240234, "slug": "new-christmas-find-the-difference", "name": "New Christmas Find The Difference", "name_original": "New Christmas Find The Difference", "description": "Christmas Find the Differences is a classic casual game for children and adults alike. The goal is simple: Search and discover all the differences you can find in two similar pictures.<br/>This is puzzle game also known as “Spot the difference”, “Difference game”, or “Christmas Find the difference” where you have to find ten differences between 2 pictures. If you get stuck, there is two hints to help you!<br/><br/>Find all hidden differences before the timer runs out. With large amount of high quality photos and 150 differences to spot, what’s the Difference will keep you busy for 24 hours straight!<br/><br/>People young and old have been enjoying Christmas spot the difference games for generations. It’s the classic game you love, now in the palm of your hand!<br/><br/>Description:<br/>1) 10 levels<br/>2) At each level you can use 2 hints!\u2028<br/>3) High Quality pictures!<br/>\u20284) Designed for phones and tablets!\u2028<br/>5) Simple and intuitive interface.<br/><br/>Each time you spot a difference, just tap on the screen. Be careful, if you do not tap the right spot, your precious time will be reduced.<br/><br/>Hours of fun ahead. Christmas Spot the differences is a great way to train your brain and improve your observation skills. Download it today for free.<br/><br/>************************** About Prophetic Games ****************************<br/><br/>Prophetic Games brings you the latest creations of most loved categories of games and apps which are all hugely loved by kids and all peoples. We are entirely devoted to build user friendly games related to fun and learning for better educational familiarities and enjoyment for kids and all peoples. Stay with us for the latest updates of Prophetic Games on Appstore and get more of games.<br/><br/>Reach us at: http://www.propheticdevelopers.com/<br/><br/>--- LIKE US ON FACEBOOK ---<br/><br/>Follow us: https://plus.google.com/u/0/107142176278162766051/posts<br/><br/>Like us: https://www.facebook.com/propheticdevelopers<br/><br/>We will be glad with your response. Contact us anytime for any questions and suggestions at E: info@propheticdevelopers.com<br/><br/>Don't forget to give us a good rate if you enjoy our game!<br/><br/>************************************************************* ***************************************", "metacritic": null, "released": "2016-12-14", "tba": false, "updated": "2019-10-22T14:15:43", "background_image": "https://media.rawg.io/media/screenshots/55a/55a56f35896759b853abb3261d41c768.jpg", "website": "http://www.propheticdevelopers.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 94, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Jaydeep Patel"], "genres": ["Puzzle"], "publishers": ["Jaydeep Patel"], "esrb_rating": null}