{"id": 240242, "slug": "raccoon-simulator-3d", "name": "Raccoon Simulator 3D", "name_original": "Raccoon Simulator 3D", "description": "Role play a Raccoon :)<br/><br/>NEW CRAFT MISSIONS - Collect insects and bugs to craft new flowers and plants for the forest. <br/><br/>3D REAL SIMULATOR - You need to maintain your health, hunger, and energy to survive and protect yourself in the forest!<br/><br/>EPIC BATTLES - Run after, howl, and race to catch prey such wild bears, wolves, foxes, and rabbits!  Fight off your enemies who do not want you to survive in this dangerous forest!<br/><br/>CREATE A RACCOON PACK - Create, unlock, and raise a pack of Raccoon to help you hunt and gather food, keep your strength up, and win battles against your enemies.  <br/><br/>BE A REAL-LIFE RACCON - Gain experience points by trying to survive in this forest by searching for food, defeating your enemies, and attacking your prey!<br/> <br/>GAIN A RACCOON PERSPECTIVE - Easy controls so you can live your life as a raccon! Zoom in and out to accomplish your raccoon missions! Hunt prey to gain energy and experience points!<br/><br/>This game features:<br/>NEW CRAFT MISSIONS<br/>3D REAL SIMULATOR<br/>EPIC BATTLES<br/>RACCOON PACKS<br/>HUNTING WILD BEARS, WOLVES, FOXES, and RABBITS<br/>COLLECTING DIFFERENT COLORED GEMS FOR ENERGY POINTS<br/>AWESOME HIGH-DEFINITION GRAPHICS<br/>ESCAPING FROM WILD PREDATORS OUT TO DESTROY YOU<br/>STRUGGLING TO SURVIVE IN AN UNKNOWN FOREST<br/>3D WORLD TO DISCOVER AND EXPLORE<br/><br/>Role play a REAL LIVE RACCOON!<br/><br/>Like us on Doodle Club!<br/><br/>Follow us on Chroma Club!<br/><br/>Icon Image Credit: \"Raccoon Cute Pose\" by N. McIntosh under Creative Commons 4.0 license/cropped from original<br/><br/>Music by Kevin MacLeod (incompetech.com)", "metacritic": null, "released": "2015-07-21", "tba": false, "updated": "2019-07-30T13:27:15", "background_image": "https://media.rawg.io/media/screenshots/461/461ff6110d73ea2b783c8aa32d78571d.jpg", "website": "http://www.chromaclub.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 21, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Chroma Club"], "genres": ["RPG", "Simulation"], "publishers": ["Chroma Coders"], "esrb_rating": "Everyone 10+"}