{"id": 240232, "slug": "christmas-makeup-artist", "name": "Christmas Makeup Artist", "name_original": "Christmas Makeup Artist", "description": "Santa Claus is coming to town. Are you ready to have some fun?<br/><br/>How to Play:<br/>\u2028Decorate the Christmas tree, prepare a big dinner? Hum~ Forget it, why not do some makeup to look your best? Now, open the game, and click PLAY to start. Choose your favorite skin color for the girl, and then apply the powder puff onto her face. Well, hairstyle, hair highlighting, eyes, eyebrow, eyeliner, and blush, you'd better not miss any of them in order to make her the most beautiful. Want more? We got you and offer you different styles of head accessories, diamonds, fun items, and of course earrings. Slide up and down to choose your favorite ones. Oh, that's not all, you can pick a pair of glasses for her to make the whole style complete. All right, everything is done now, click the camera icon to save your work in camera roll, and then you can share with your best friends or submit it to join the show. Please remember to come back and check who are the weekly stars. Maybe you will be one of them. Good luck to you and wish you a happy holiday!<br/><br/>Features:<br/>· Spa Section<br/>· Makeup Section <br/>· Dress up Section <br/>· Plentiful shoes of different styles to choose<br/>· 3 dynamic and vivid backgrounds<br/>· Many hair styles and hair colors to choose <br/>· Try on dozens of different eye colors, eye-shadows, mascaras, lipsticks, and more<br/>· A lot of special clothes and dresses to choose<br/>· A huge variety of decoration items, including earrings, necklaces, bracelets, and headgears to choose<br/>· Several stockings to choose<br/>· Take a photo with the girl together<br/>· Share the unique girl via Facebook or E-mail with just one click <br/>· Screenshots of the girl can be saved in your photo album<br/>· Continued improvements of this game, please feel free to send us your feedbacks and suggestions<br/><br/>Need You Know:<br/>This app is totally free to download and play, All the items are also totally free to use.<br/><br/>*********** About Prophetic Games ***************<br/><br/>Prophetic Games brings you the latest creations of most loved categories of games and apps which are all hugely loved by kids and all peoples. We are entirely devoted to build user friendly games related to fun and learning for better educational familiarities and enjoyment for kids and all peoples. Stay with us for the latest updates of Prophetic Games on App Store and get more of games.<br/><br/>Reach us at: http://www.propheticdevelopers.com/<br/><br/>--- LIKE US ---<br/><br/>Follow us: https://plus.google.com/u/0/107142176278162766051/posts<br/><br/>Like us: https://www.facebook.com/propheticdevelopers<br/><br/>WATCH US: https://www.youtube.com/channel/UC1aBCmCUC_Y1_bjoz7qNtTg<br/><br/>We will be glad with your response. Contact us anytime for any questions and suggestions at E: info@propheticdevelopers.com<br/><br/>Don't forget to give us a good rate if you enjoy our game!<br/>******************************************************", "metacritic": null, "released": "2016-11-15", "tba": false, "updated": "2019-10-22T14:15:43", "background_image": "https://media.rawg.io/media/screenshots/b74/b74b87a7e837cf49aa4a96e482b780e3_o5r2MxQ.jpg", "website": "http://www.propheticdevelopers.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 105, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Jaydeep Patel"], "genres": ["Arcade", "Family"], "publishers": ["Jaydeep Patel"], "esrb_rating": null}