{"id": 240316, "slug": "ultimate-rescue-ambulance-driving-simulator", "name": "Ultimate Rescue Ambulance Driving Simulator", "name_original": "Ultimate Rescue Ambulance Driving Simulator", "description": "The over populated town you live in has been getting serious casualties and injured people due to the accidents lately, with the numbers increasing every day. You are one of the top ambulance drivers around in the local hospitals capable of leading this 911 rescue mission.<br/><br/>Drive your ambulance around the city to get to tend the accident situations in time. You need to RUSH to the sites before time runs out to deliver medical aid and assistance to the injured people. When emergency calls, just switch on the sirens and put the ambulance in top gear! Keep an eye out for hurdles, stops and pits through the city roads. Try to pass the incoming traffic with safety as lots of precious lives are depending on your driving skills.<br/><br/><br/>FEATURES<br/>Number of different ambulance models to get in and drive around the city<br/>Look out for hurdles along each drive, staying safe from incoming traffic and avoiding further accidents<br/>Pick up patients and injured from different locations throughout the city in the given time limit<br/>Simplistic driving simulator controls to aid in driving fast and efficient<br/>More than 20 different and challenging missions to take part in and gain experience points for each successful drop off", "metacritic": null, "released": "2016-10-25", "tba": false, "updated": "2019-10-22T14:15:45", "background_image": "https://media.rawg.io/media/screenshots/ff0/ff0d356e167cf9995dc90e20c7037cc1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 104, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["uzair ahmad"], "genres": ["Action", "Simulation"], "publishers": ["uzair ahmad"], "esrb_rating": null}