{"id": 240317, "slug": "armored-road-warrior-death-car-racing", "name": "Armored Road Warrior Death Car Racing", "name_original": "Armored Road Warrior Death Car Racing", "description": "Sometime in the future the road will belong only to the fastest and deadliest cars &amp; trucks as they try to rule the road! Your only hope of survival is total destruction to all vehicles in the way! Your Warrior vehicle is capable of blasting and crashing into the enemy.<br/><br/>Ge behind wheels on buggy or any vehicle your like and drive mad on roads. Dont let other drivers get pas you, its race of survival, race that is must to win on these scary, desert roads. this battle is the only hope to get out of this dangerous desert.<br/>Beware , all cars are armoured, you can fire, they will fire back on you, stay ahead of other, shoot them first to get the upper hand.<br/><br/>- buggy and other armored vehicles<br/>- mad racing challenges<br/>- shoots outs on the roads<br/>- race to survice<br/><br/>Game features:<br/>1) 38 racing scenes, taking from world famous racetrakers<br/>2) 9 different super cars<br/>3) Rich set of upgrade functions and customized items<br/>4) 3 kinds of racing modes: standard, survival and chase<br/>5) Share your result in Facebook or invite your friends to join the race<br/>6) Easy to get coins for free<br/>7) Realistic fighting and car damage effect <br/><br/>How to play:<br/><br/>The default self-driving mode allows you to focus on defeating your rivals<br/>Choose track-holding option to ensure better driving<br/>Tap (toch) your phone screen or tilt it to manage the car movement<br/>Avoid obstacles or destroy them with arms<br/>Use machine guns, missiles and landmines to prevent rivals surpassing you<br/>Raise your driving speed through “O” mark zone on the racetrack<br/>Get special equipment by passing through arrow mark zone<br/>Adjust 3D quality and other settings to find the best configuration to your mobile phone", "metacritic": null, "released": "2017-02-23", "tba": false, "updated": "2019-10-22T14:15:45", "background_image": "https://media.rawg.io/media/screenshots/192/192483603d8be5b21205c287e0733717.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 93, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["uzair ahmad"], "genres": ["Action", "Racing"], "publishers": ["uzair ahmad"], "esrb_rating": null}