{"id": 240322, "slug": "bubble-shooter-squirrel-pop", "name": "Bubble Shooter Squirrel POP", "name_original": "Bubble Shooter Squirrel POP", "description": "Bubble Shooter Squirrel Arcade Birds  is a fun and exciting match 3 game for mobile devices. The goal of this bubble shooting game is to take part in highly exciting and fun levels and clear them as quickly as possible, shooting your way through the bubbles maze. <br/><br/>This casual game delivers action for lovers of adult games, children games and baby games alike. Bubble shooting was never more fun, all you have to do is simply aim and shoot to burst the bubbles as your squirrel embarks on a fun bubble shooting adventure. The game is harder than it seems though, and if you have the appetite for learning games, you may be able to clear all the bubble shoot levels.<br/><br/>Squirrel Arcade Bubble Shooter has numerous levels and challenges, and you’ll be required to shoot and pop all the bubbles on screen to complete each level.<br/><br/>As you move your squirrel into the gameplay levels, the challenges become harder, and require more bubble shooting skills, time chases and combo moves, to burst as many bubbles as possible in a single move. Couple up same colored bubbles and blast them to earn bubble popping points and keep moving ahead in this bubble shooting saga.<br/><br/><br/>FEATURES<br/><br/>Beautifully designed high definition graphics for Squirrel Arcade Bubble Shooter genre<br/>Just shoot up the bubbles and keep enjoying the best arcade games free for life. Continuous updates with new levels and challenges will keep you entertained <br/>Squirrel Arcade Bubble Shooter is the perfect time killer with mind tingling challenges, which you have to think through and solve in the fastest time possible<br/>The current bubble shooter gameplay gives players over 200+ levels of bubble shooting to play<br/>Beautiful User Interface design <br/><br/><br/>What are you waiting for? Download your Bubble Shooter Squirrel Bird Now and Enjoy!<br/><br/>-------------------------------------------------------------------------------------------------<br/>Please, follow us on the following page; we would love your suggestions to improve our games to <br/><br/>provide better entertainment to our followers, users and supports;<br/>Facebook;<br/>https://www.facebook.com/gamechief", "metacritic": null, "released": "2017-06-16", "tba": false, "updated": "2019-10-22T14:15:45", "background_image": "https://media.rawg.io/media/screenshots/849/849a94cd648ece98a847e4c5a9d6471a_I3t6xBJ.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 19, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["uzair ahmad"], "genres": ["Adventure", "Puzzle"], "publishers": ["uzair ahmad"], "esrb_rating": null}