{"id": 240305, "slug": "berry-match-king-strawberry-fruit-crush-game", "name": "Berry Match King: Strawberry Fruit Crush Game", "name_original": "Berry Match King: Strawberry Fruit Crush Game", "description": "Do You Love Berry Match King: , Whether it is strawberry, blueberry, blackberry...? Do you love matching games!? Using your brain to play addicting games? How about adding a twist and matching berries? <br/><br/>Switch and match your way through hundreds of fun levels in this delicious puzzle adventure.<br/><br/>Take on this deliciously sweet Mania alone or play with friends to see who can get the top score! <br/>Candy Berry Match is completely free to play <br/><br/>Match the berries, cross them, line them up, connect them and make a threesome..Tap them, move them and get rid of them all! Come on in and try this multi-level matching game that you will be addicted too! <br/><br/>Berry Match King: Game features:<br/>● Tasty ways to play: Target Score, Timed Levels, Sugar drops, Colors<br/>● Tasty Berries, wrapped and striped Special Berries, Jelly and various other magical boosters to help with challenging levels<br/>● Hundreds of the best levels in the Berry Kingdom with more added every 2 weeks for your entertainment<br/>● It's easy to sync the game between devices and unlock full game features when connected to the Internet<br/>● Connect 3 or more berries to get rid of a row!<br/>● If you get more than 3 in a row you get bonus, powerups,.<br/>● Match the object and color by tapping on a block and tapping to where you want to move it.<br/>● The object is to line a berry up with others of its same kind and watch your points add up!<br/>● Tons of levels for endless gameplay!<br/>● Great background and audio.<br/>● Perfect for brain training!<br/>● Great for people who like to think!", "metacritic": null, "released": "2017-05-29", "tba": false, "updated": "2019-10-22T14:15:45", "background_image": "https://media.rawg.io/media/screenshots/51f/51f8badfe6ebc49cea94fa836cff6f9a_bGN8FSk.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 42, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["uzair ahmad"], "genres": ["Arcade", "Casual", "Puzzle"], "publishers": ["uzair ahmad"], "esrb_rating": null}