{"id": 240330, "slug": "highway-car-racing-3d-real-drift-race-pro", "name": "Highway Car Racing 3D - Real Drift Race Pro", "name_original": "Highway Car Racing 3D - Real Drift Race Pro", "description": "Extreme Traffic car racing is a trend in these days. You will be amazed after play this mind blowing and stunning racing game. Extreme Car Traffic Racing is an addictive game for drag Racing gamer. Drive with fast with furious speed in busy highway traffic feeling the excited Racing. Show your skills and become extreme stunt racer to win this Highway Traffic Drag Racing 2017 game. Burn out your car on the hills and perform the stunts by overtakes.<br/><br/>Extreme Traffic Racing is one of the most exciting new generation racer games. Forget all Train Simulator Game, 4x4 Prado Cruiser Game also Subway Train games and Moto Racing Games. Now it is time to do something new to drive your Extreme Car in traffic and enjoy racing through traffic rush. Test your driving skills by passing through heavy Traffic to collect cash.<br/><br/>Test your car driving skills in the endless highway roads overtaking the traffic cars and earn more bonus cash and avoid to crash with other vehicles for the long enjoyment of 3d realistic gameplay and environment with a lot of fun.<br/><br/>Realistic physics, nice graphics, and tuned on-screen controls give you great racing experience. Drive more your car through hills and snowy locations in highway Crazy car city traffic racing to earn cash, with cash you can buy new cars to beat the game.<br/><br/>THE ULTIMATE RACING CHALLENGE<br/><br/>Choose from a garage full of racing cars to enter the ultimate challenge<br/>Join in 4 different racing environments with different challenges<br/>Go head to head against a daunting highway traffic, drifting clear past <br/><br/>HIGH SPEED ENDLESS DRIVING<br/>Accelerate through the tracks, drifting past the heavy traffic and overtaking other vehicles<br/>True racing has no limits, the more dangerous the stunts and drifts, the higher the reward<br/><br/><br/>CUTTING EDGE GRAPHICS<br/>Race in exquisite and high quality 3d environments with customized tracks, with intricately detailed vehicles and traffic.<br/><br/><br/>BUILD YOUR OWN CAR<br/>Unlock new and improved cars and customize them with higher grade parts, power ups and paint jobs<br/><br/>SHIFT YOUR VIEW TO THE WAY YOU WANT<br/>Cycles through multiple camera angles to drive ahead, or turn the first person simulation mood to for the real time immersion in driving at high speed<br/><br/><br/>EXQUISITE DRIVING CONTROLS WITH MOMETUM SHIFT<br/>High speed means higher danger, but if you’ve got the true racer’s momentum, you can get out of tricky situations by halting the momentum, slowing speed instantly to drift smoothly<br/><br/>TIPS:<br/><br/>- The faster you ride, the more scores you get<br/>- Driving over 50 kmh and overtake traffic cars closely to get bonus cash points<br/><br/><br/>KEY GAMEPLAY FEATURES<br/>- Smoothest gameplay to thrill the race.<br/>- Scintillating 3D graphics<br/>- Exquisitely smooth driving controls, with the ability to switch to different - control modes<br/>- Drive in 4 high definition environments with challenging weather conditions<br/>- Unlock numerous different cars in your game progress<br/>- Take part in different challenges against a heavy incoming traffic including cars, trucks, buses and more…<br/>Customize your cars with custom paint and hardware jobs<br/>- Traffic rush and off road racing mania.<br/>- 3 Different controllers – Steering, Tilting, Touch buttons<br/>- Overtaking traffic to gives you more bonus cash", "metacritic": null, "released": "2017-04-08", "tba": false, "updated": "2019-10-22T14:15:46", "background_image": "https://media.rawg.io/media/screenshots/1c0/1c0e45645e87c66622b03794dfe4cd9c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 108, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["uzair ahmad"], "genres": ["Sports", "Racing"], "publishers": ["uzair ahmad"], "esrb_rating": null}