{"id": 240328, "slug": "apple-fruits-bubble-blast-pro", "name": "Apple Fruits Bubble Blast Pro", "name_original": "Apple Fruits Bubble Blast Pro", "description": "Apple fruits Adventure new ads free version<br/>Apple  Fruits Adventure- Match 3 is a new 3-match FREE game, a very addictive. With excellent apple candys <br/><br/>graphics , you may never get bored in Fruits Garden - Match 3 <br/>It’s very simple - connect all candies to fruits of same color. You can rotate everything with <br/><br/>one tap, but can't change positions! It is a classic delicious and free puzzle game, so sweet and <br/><br/>yummy that this description cannot even cut it.<br/>Unleash your inner autopilot and smash through levels. If you like a good pipe game, then this <br/><br/>free candy puzzle is just for you.<br/>The world’s most exciting and addictive Candy game is back – welcome to Candy Fruit Garden -<br/><br/>World!<br/>Sweeter and delicious than ever before, Candy Fruit Saga is a whole new level of the smooth fast, <br/><br/>thrilling gameplay that made the Candy game a award-winning hit. Move your fruits through an epic <br/><br/>and adventure as you blast exotic fruits from land of candy games,fresh juicy Fruits , and crispy <br/><br/>crunchy saga of whole new candy pack, levels, stars, and more goodies to help you crush your <br/><br/>fruits to a pulp. (Don’t worry, we’ve still got all the goodness of candies , too. It’s vintage <br/><br/>now.)<br/><br/>Candy Fruit Garden packs in so much content, it’s like a fully upgraded artillery blast of <br/><br/>mouthwatering, pixelated joy launched right into your smiling little face… and it hurts so good!<br/><br/>GAME FEATURES:<br/><br/>Surprises for you in each level<br/>Lovely graphics and powerful boosters!<br/>Easy to play but challenging to have high scores<br/>Lovely graphics and powerful boosters!<br/>Over 100 levels for you to challenge. More levels coming soon!<br/>Special power and features on every stage! Match longest chains of juicy fruits. <br/>Juicy , Fruity , and Most Addicting game modes to challenge your tactical skills!<br/>Two difficulty modes! Are you up for a real challenge? Go with Hard training mode!<br/><br/>How to play:<br/>1. Match 3 or more same type to clear them. <br/>2. Win the levels before you run out of moves. It's so easy.", "metacritic": null, "released": "2017-08-24", "tba": false, "updated": "2019-10-22T14:15:46", "background_image": "https://media.rawg.io/media/screenshots/9c5/9c5ed0d7b0570c3bc045e66cfed5405b_Rsxfm8g.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 46, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["uzair ahmad"], "genres": ["Arcade", "Casual", "Puzzle"], "publishers": ["uzair ahmad"], "esrb_rating": null}