{"id": 240465, "slug": "african-cheetah-wild-animal-simulator-3d", "name": "African Cheetah: Wild Animal Simulator 3D", "name_original": "African Cheetah: Wild Animal Simulator 3D", "description": "Try a cheetah survival in African Cheetah: Wild Animal Simulator 3D! <br/><br/>Live the life of the wild animal. Hunt, fight with lions and complete quests. Find an animal mate and breed a new cheetah. Develop a survival strategy against wild animal like lion. Level­up a cheetah in simulator to improve survival skills. Find other cheetah and start a family. Farm levels to open new survival skills in the animal simulator.<br/><br/>Features of African Cheetah: Wild Animal Simulator 3D:<br/><br/>- Big wild world<br/>- Many survival locations<br/>- Animal behavior simulator<br/>- Wild cheetah family<br/>- Many animal species - even wild lions<br/>- Survival and quests mode<br/>- Wild nature sounds<br/><br/>Choose a mode that you like - animal survival or quests. They are very enjoyable! Start your survival against lions right now, with wild cheetah simulator. We like cheetah and do our best to make great animal games. Create your strategy in the simulator! Be an angry cheetah, or calm cheetah - fight with lions or avoid them!<br/><br/>Have you ever dreamed to be a cheetah or lion? In our survival simulator we offer you to forget about a calm life, and be a wild animal. Become a wild cheetah and run across beautiful locations! Maintain your wild cheetah health against lions, survival in the wild is not easy for animal. Sneak into dark corners, full of lions. Fight for survival with every animal you meet or run away. Your cheetah can even die in the simulator.<br/><br/>African Cheetah: Wild Animal Simulator 3D has special animal sounds. Run and listen where lion is, deep into survival. This survival simulator has a map and a guide inside. Simulator controls allow you to run and fight. Read how to ride your animal and many other things. You will meet a lot of animal species in the survival simulator. <br/><br/>Survival games are so great! Behave like an animal in simulator. <br/><br/>Try our African Cheetah: Wild Animal Simulator 3D, be a cheetah and explore a big beautiful world!", "metacritic": null, "released": "2016-07-01", "tba": false, "updated": "2019-07-01T03:30:33", "background_image": "https://media.rawg.io/media/screenshots/242/242d6994302150d33e3d6a83c01f41ba_bfA34vk.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 134, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Andrew Kudrin"], "genres": ["Strategy", "Simulation"], "publishers": ["Andrew Kudrin"], "esrb_rating": null}