{"id": 240467, "slug": "unicorn-family-simulator", "name": "Unicorn Family Simulator", "name_original": "Unicorn Family Simulator", "description": "Dream to ride a magic horse? With our survival simulator you can be an animal. What about riding a magic unicorn and live in the magic world?! Ride across lovely landscapes. Run to a village and do interesting tasks. <br/>Feed your horse, explore the magic world and fight for survival in the unicorn simulator.<br/><br/>This magic horse survival simulator has a lot of interesting places. Easy controls allow you to ride your animal across all locations. Read how to ride your unicorn in the simulator and find friends.<br/><br/>Features of Unicorn Family Simulator:<br/><br/>- Magic creatures<br/>- Unicorn level up<br/>- Survival mode<br/>- Realistic animal battles<br/>- Animal behaviour simulator<br/>- Unicorn herds<br/>- Horse ride controls<br/><br/>Feel how to be a unicorn. Complete unicorn survival missions. Ride an animal across beautiful lands and look for magic dragons. Find an animal mate and breed a new unicorn. Level­up your horse to improve animal survival skills.<br/><br/>Explore magic places. Support your magic unicorn health, survival in the game is hard. So, we have warned you. Fight with every animal you meet or ride at a top speed. Your magic horse will have fun in the animal survival simulator. Farm levels in the simulator to open survival skills.<br/><br/>Many magic animal species are waiting for your horse in the simulator.<br/>Unicorn Family Simulator has natural sounds for every animal. Deep into horse survival. Ride your horse and listen to the magic sounds of forest, farm and river.<br/><br/>Animal survival games are cool! Behave and think like an animal. <br/>Try our Unicorn Family Simulator, choose your horse and run across the magic world.", "metacritic": null, "released": "2017-02-10", "tba": false, "updated": "2019-07-01T03:30:37", "background_image": "https://media.rawg.io/media/screenshots/2ce/2ce56de49dd313d3da4566b55b5204e4_2DuQ8d3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 126, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Andrew Kudrin"], "genres": ["Adventure", "Simulation"], "publishers": ["Andrew Kudrin"], "esrb_rating": null}