{"id": 240486, "slug": "pony-survival-simulator-3d", "name": "Pony Survival Simulator 3D", "name_original": "Pony Survival Simulator 3D", "description": "Turn to a little horse in the magic world of Pony Survival Simulator 3D.<br/><br/>Live the life of the animal. Ride across lovely landscapes. Complete quests. Find magic places and meet magic creatures. Find an animal mate and breed a new pony. Level­up a horse to improve survival skills.<br/><br/>Ride with other animals. Find a horse and start a family. Farm next levels to open new survival skills.<br/><br/>Features of Pony Survival Simulator 3D:<br/>- Realistic animal behaviour<br/>- Magic creatures<br/>- Farm locations<br/>- Horse herds<br/>- Many animal species<br/>- Survival and quests mode<br/>- Nature sounds<br/><br/>Ride across beautiful lands with magic flowers! From high rocks to a farm. Maintain your pony health, survival in the wild is not easy. Sneak into a farm and eat vegetables. Fight with every animal you meet or ride at a top speed. Your horse can even lose a battle in the simulator.<br/><br/>A fox, a wolf, a magic wizard and others are waiting for you in the simulator.<br/><br/>Pony Survival Simulator 3D has sounds for every animal. Deep into survival. Ride your horse and listen to the magic sounds of forest, farm and river.<br/><br/>This survival simulator has a map and a guide inside. Easy controls allow you to enjoy the ride, gallop, jump, etc. Read how to ride your animal, rob a farm, find magic places and many other things.<br/><br/>Have you ever dreamed to have a pony? With our horse simulator you will forget about a calm farm life. What about to... be a little pony and meet some magic?!<br/><br/>Survival games are so great! Behave and think like an animal. <br/>Try our Pony Survival Simulator 3D, choose your horse and ride like the wind!", "metacritic": null, "released": "2016-04-13", "tba": false, "updated": "2019-07-01T03:36:53", "background_image": "https://media.rawg.io/media/screenshots/275/2753e2b1659366e02da8f9093c83a7a3.jpg", "website": "http://wildanimalsworld.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 164, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Andrew Kudrin"], "genres": ["Strategy", "Simulation"], "publishers": ["Andrew Kudrin"], "esrb_rating": null}