{"id": 240487, "slug": "ocean-turtle-simulator-animal-quest-3d", "name": "Ocean Turtle Simulator: Animal Quest 3D", "name_original": "Ocean Turtle Simulator: Animal Quest 3D", "description": "Enjoy quests in the ocean! The sea is waiting for your turtle. <br/><br/>For simulators and quests fans we combined animal simulator and amusing quest about turtle. Turtle's life is hard, but in the simulator the ocean is beautiful! Solve all ocean quests. Try this simulator and meet wild sharks, dolphins and other animals. Fight with the wild or run away. <br/><br/>Features of Ocean Turtle Simulator: Animal Quest 3D<br/><br/>- Big wild world simulator<br/>- Many sea animal species<br/>- Ocean locations<br/>- Wild animal behavior simulator<br/>- Day and night cycles<br/>- Magic artifacts<br/>- Turtle pods simulator<br/>- Babies breeding<br/>- Turtle upgrades<br/>- Interesting sea adventures<br/>- Funny quest characters<br/>- Main and optional quests<br/><br/>Become a turtle in the simulator and enjoy the wild world of sharks and dolphins. Fight with animals, look for turtle clans, dolphins, sharks and treasures. In quests you are exploring the ocean bottom, talking to animals and complete tasks.<br/><br/>Start ocean journey in the simulator! Be wild turtle, find animals and do quests. Eat to maintain your wild turtle health, the animals simulator is not easy. Also, avoid sharks. Level up wild ocean animal and start your turtle family, so you can be stronger in our ocean survival simulator.<br/><br/>Want to have animals like turtle or dolphin? So, the quest is for you. Explore the ocean. Find a mate, breed a wild turtle and follow the story line. <br/><br/>Explore what the ocean is hiding from animals! Sharks or dolphins? Find all quests. Challenge friends. Who is the best turtle? Never seen wild dolphins or sharks? There is a tutorial in the simulator. Check ocean locations for quests. Many tasks are waiting in the turtle simulator. Complete quests to make the game funnier! <br/><br/>If you like turtles and the ocean, start playing Ocean Turtle Simulator: Animal Quest 3D!", "metacritic": null, "released": "2016-10-15", "tba": false, "updated": "2019-07-01T03:36:52", "background_image": "https://media.rawg.io/media/screenshots/aa2/aa273e161b48c197c09a2ce209ba128f_X5iZDa9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 143, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Andrew Kudrin"], "genres": ["Adventure", "Simulation"], "publishers": ["Andrew Kudrin"], "esrb_rating": null}