{"id": 240489, "slug": "wild-white-polar-bear-simulator", "name": "Wild White Polar Bear Simulator", "name_original": "Wild White Polar Bear Simulator", "description": "Explore the pole as a bear in Wild White Polar Bear Simulator!<br/><br/>Run, fight and complete quests. Live the life of the wild animal. Find an animal mate and breed a new polar bear. Develop a survival strategy against wild animals and level­up a polar bear in simulator to improve survival skills. Find other foxes and start a family. Farm next levels to open new survival skills in the animal simulator.<br/><br/>Features of Wild White Polar Bear Simulator:<br/><br/>- Many animal species<br/>- Survival and quests mode<br/>- Wild nature sounds<br/>- Big wild world<br/>- Many survival locations<br/>- Animal behavior simulator<br/>- Wild bear family<br/><br/>This survival simulator has a map and a guide inside. Simulator controls allow you to run and fight. Read how to ride your polar animal and many other things. You will meet a lot of animal species in the survival simulator. Wild White Polar Bear Simulator has special animal sounds. Run and listen, deep into survival.<br/><br/>Start your survival right now, with our polar bear simulator. Choose a mode that you like more - animal survival or quests. The both are very enjoyable! We like bears and do our best to make great animal games. Create your strategy in the simulator and fight as a real polar bear!<br/><br/>Be a wild animal. Become a wild bear and travel across snowy locations! Maintain your wild bear health, survival in the wild is not easy for polar animal. Explore the pole. Fight for survival with every animal you meet or run away. Train your skills and levelup your bear!<br/>Survival games are so great! Behave like an animal.<br/><br/>Try our Wild White Polar Bear Simulator, be a bear and stay alive!", "metacritic": null, "released": "2016-09-20", "tba": false, "updated": "2019-07-01T03:36:29", "background_image": "https://media.rawg.io/media/screenshots/af5/af5d33b3a32437014cefe05184c96ea0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 120, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["Andrew Kudrin"], "genres": ["Strategy", "Simulation"], "publishers": ["Andrew Kudrin"], "esrb_rating": null}