{"id": 240498, "slug": "save-the-jollies-escape-to-jolly-land-mega-fun-fre", "name": "Save the Jollies - Escape to Jolly Land - MEGA FUN FREE GAME", "name_original": "Save the Jollies - Escape to Jolly Land - MEGA FUN FREE GAME", "description": "This app is optimised for iPhone 4S/iPad2 and above!<br/><br/>Thousands of miles from civilisation, there lived some very cute little creatures called Jollies!<br/><br/>They lived peacefully and happily on their island called Jollyland for hundreds of years, until one fateful day when they were captured and put into crates and loaded onto a container ship.<br/><br/>Taken from their home, transported in a hundred crates... with their fate unknown?<br/><br/>Someone must help them! It's your job to Save the Jollies!!!<br/><br/>Save the Jollies is a fun and addictive game of skill and cunning, you must touch and drag Prince Jolly around inside each crate avoiding the crate edges until the timer reaches zero, sounds easy? unfortunately the Jollies are very protective of the Prince, and they will become enraged and speed about inside the crates trying to stop you!<br/><br/>If you survive inside a crate until the timer reaches zero without touching the sides or the other Jollies, your energy force will reach full, and you will be able to magically transport to the next crate.<br/><br/>You need to keep transporting from crate to crate searching for the Ancient Rune Stones, these will allow the Prince to magically transport all the Jollies back home to Jollyland.<br/><br/>Unfortunately, the over protective Jollies don't know your trying to help them and think your just trying to kidnap the Prince, they will not make it easy for you to complete each crate and find the Ancient Rune Stones!<br/><br/>Do you have what it takes.... Can you Save the Jollies!!!", "metacritic": null, "released": "2014-06-22", "tba": false, "updated": "2019-10-22T14:15:52", "background_image": "https://media.rawg.io/media/screenshots/f3f/f3faff3d5c5797c34853d6bef9e650db.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 101, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["A-Lab Software"], "genres": ["Arcade", "Puzzle"], "publishers": ["A-Lab Software"], "esrb_rating": "Everyone 10+"}