{"id": 240480, "slug": "lion-simulator-wild-african-animal", "name": "Lion Simulator: Wild African Animal", "name_original": "Lion Simulator: Wild African Animal", "description": "Try a lion survival in Lion Simulator: Wild African Animal!<br/><br/>Have you ever dreamed to be a lion? <br/>In our survival simulator we offer you to forget about a calm life and be a wild animal. Become a wild lion and run across beautiful locations! Maintain your wild lion health for fights with animals, survival in the wild is not easy. Sneak into dark corners, full of danger. Fight for survival with every animal you meet or run away. Your lion can even die in the simulator.<br/><br/>Live the life of the big wild animal! <br/>Hunt, fight with enemies and complete quests. Find an animal mate and breed a new lion. Develop a survival strategy against wild animals. Level­up a lion in simulator to improve survival skills. Also, find other lion and start a family. Farm levels to open new survival skills in the animal simulator.<br/><br/>Features of Lion Simulator: Wild African Animal<br/><br/>- Many animal species<br/>- Survival and quests mode<br/>- Wild nature sounds<br/>- Big wild world<br/>- Many survival locations<br/>- Animal behaviour simulator<br/>- Wild lion family<br/><br/>Game modes<br/>Choose a mode that you like - animal survival or quests. They are very enjoyable! Start your survival right now, with wild lion simulator. We like lions and do our best to make great animal games. Create your strategy in the simulator! Be an angry lion, or calm lion - fight with other animals or avoid them!<br/><br/>Atmosphere and controls<br/>Lion Simulator: Wild African Animal has special animal sounds. Run and listen where your victim is, deep into survival. This survival simulator has a map and a guide inside. Simulator controls allow you to run and fight. Read how to ride your animal and many other things. You will meet a lot of animal species in the survival simulator.<br/><br/>Survival games are so great! Behave like an animal in simulator.<br/><br/>Try our Lion Simulator: Wild African Animal, be a lion and explore a big beautiful world!", "metacritic": null, "released": "2016-07-23", "tba": false, "updated": "2019-07-01T03:33:06", "background_image": "https://media.rawg.io/media/screenshots/b04/b04089d03329765ac97aef1f3e0527c9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 155, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Andrew Kudrin"], "genres": ["Strategy", "Simulation"], "publishers": ["Andrew Kudrin"], "esrb_rating": null}