{"id": 240458, "slug": "wild-fox-survival-simulator-3d", "name": "Wild Fox Survival Simulator 3D", "name_original": "Wild Fox Survival Simulator 3D", "description": "Become a wild fox in Wild Fox Survival Simulator 3D.<br/><br/>Live the life of the wild animal. Run, fight and complete quests. Find an animal mate and breed a new fox. Develop a survival strategy against wild and farm animals. Level­up a fox in simulator to improve survival skills. Find other foxes and start a family. Farm next levels to open new survival skills in the animal simulator.<br/><br/>Features of Wild Fox Survival Simulator 3D:<br/><br/>- Big wild world<br/> -Many survival locations<br/> -Animal behaviour simulator<br/>- Wild fox family<br/>- Many animal species<br/>- Survival and quests mode<br/>- Wild nature sounds<br/><br/>Choose a mode that you like more - animal survival or quests. The both are very enjoyabe! Start your survival right now, with our fox simulator. We like foxes and do our best to make great animal games. Create your strategy in the simulator! Be a good fox, or evil fox - it is up to you!<br/><br/>Have you ever dreamed to be a fox? In our survival simulator we offer you to forget about a calm life, and be a wild animal. Become a wild fox and run across beautiful locations! Maintain your wild fox health, survival in the wild is not easy for animal. Sneak into a farm. Fight for survival with every animal you meet or run away. Your fox can even die in the simulator.<br/><br/>Wild Fox Survival Simulator 3D has special animal sounds. Run and listen, deep into survival. This survival simulator has a map and a guide inside. Simulator controls allow you to run and fight. Read how to ride your animal and many other things. You will meet a lot of animal species in the survival simulator.<br/><br/>Survival games are so great! Behave like an animal. <br/>Try our Wild Fox Survival Simulator 3D, be a fox and explore a big beautiful world!", "metacritic": null, "released": "2016-05-21", "tba": false, "updated": "2019-07-01T03:30:29", "background_image": "https://media.rawg.io/media/screenshots/36f/36f2eef16f3996d6502a60e918d8fa87.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 117, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Andrew Kudrin"], "genres": ["Strategy", "Simulation"], "publishers": ["Andrew Kudrin"], "esrb_rating": null}