{"id": 240462, "slug": "ocean-whale-orca-simulator-animal-quest-3d", "name": "Ocean Whale Orca Simulator: Animal Quest 3D", "name_original": "Ocean Whale Orca Simulator: Animal Quest 3D", "description": "Try the survival quest and become an ocean orca! <br/><br/>Explore the ocean and do the quest tasks! In the simulator you are a giant animal killer whale, but your friends are missing. Start your ocean orca survival with our animal survival quest right now. <br/><br/>Orca's life is hard. With our killer whale survival quest you can check it. Try it! Explore the ocean in search of quest mysteries. In Ocean Whale Orca Simulator: Animal Quest you must behave like an animal, and think like a human. Be ocean animal or swim just for pleasure. Level­up your orca to improve animal survival skills in the survival simulator. Form a ocean killer whale pod and breed an orca and be stronger to solve quests.<br/><br/>Features of Ocean Whale Orca Simulator: Animal Quest <br/><br/>- Wild animal behavior simulator<br/>- Day and night cycles<br/>- Power artifacts<br/>- Orca pods simulator<br/>- Big wild world simulator<br/>- Many sea animal species<br/>- Ocean locations<br/>- Babies breeding<br/>- Orca upgrades<br/>- Interesting sea adventures<br/>- Funny quest characters<br/>- Main and optional quests<br/><br/>This ocean survival simulator is not easy, make your own killer whale pod, explore the ocean. Breed a new orca. Your animal mates will follow you in the ocean. Support the survival of the orca pod. Don't forget about your quests. Who knows what adventures hide in the ocean simulator... Hunt, eat, jump out of the ocean for oxygen and never sleep. <br/><br/>There is a guide in the animal survival simulator. Convenient controls allow your orca whale to turn, hunt, jump, etc. Ride your ocean orca in the simulator, eat and do all quests. Explore all survival places and follow the story line in the animal simulator.<br/><br/>Ocean Whale Orca Simulator: Animal Quest allows you to be in whale's skin as if you are a real ocean animal. Real quest adventures of your orca! <br/><br/>Start playing your orca in Ocean Whale Orca Simulator: Animal Quest!", "metacritic": null, "released": "2016-10-15", "tba": false, "updated": "2019-07-01T03:30:32", "background_image": "https://media.rawg.io/media/screenshots/70b/70b8be77ae5b8b2168c21929de72ebbf_1Ya7Qnc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 75, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Andrew Kudrin"], "genres": ["Adventure", "Simulation"], "publishers": ["Andrew Kudrin"], "esrb_rating": null}