{"id": 240433, "slug": "ruthless-power-boat-top-gun-shooting-game", "name": "Ruthless Power Boat - Top Gun Shooting Game", "name_original": "Ruthless Power Boat - Top Gun Shooting Game", "description": "Ruthless Power Boat -  , race your hydro powerboat, loaded with best arms &amp; ammunition in the ultimate water racing combat game. Be the top reckless rider in ruthless water racing world, race shoot crush and sink every boat that come in your way.<br/>you’ll have a chance to test your skills in naval battle combat boat. If you love riding racing shooting and sailing on sea in speedboat, then you’re in for a real treat! This free battleship game is been designed for boys, girls and adults.<br/><br/>In the hot world of water racing, things go fast. Impose your style by customizing and upgrading your powerboat and weapons to be the hottest navy driver on land!<br/><br/><br/>Features: <br/>&gt; Simple Game play with Easy and Smooth Controls.<br/>&gt; Pick Booster Powers ups like Coin 2X Booster and Magnet Booster Power while driving. <br/>&gt; Vibrant Sound effects for Crashed, Strikes, Hits, kills and Whacks etc<br/> Pure Entertainment Simulation<br/>&gt; Sail and destroy through water canals across Desert, Snow , Highway, offroad, Jungle, City, Hills, Mountains, Rocks, Ice Road<br/>&gt; Powerboats Loaded with firearms from Piston, Minigun, Riffle,Submachine gun, light machine guns,Browning Automatic Rifle, heavy machine gun, Laser Shooter, Flame Thrower, Missile Launcher.<br/>&gt; Increasing difficulty as you reach higher level, the chase becomes more tough and racers become more fast strong and armoured<br/>&gt; Lots Of opponent rival traffic to blowoff starting from Ski boat, Surf superboat , missileboat, Patrolboat, steam gunboat, Armoured battlecruiser, TroopShip, Battleship ......<br/>&gt; 3d Person Camera view featured for fastest and dangerous auto race combat drive<br/>&gt; Neat and realistic high defination 3d graphics built for the speed, focus on the chase with the intense clarity of the display.", "metacritic": null, "released": "2016-09-25", "tba": false, "updated": "2019-10-22T14:15:51", "background_image": "https://media.rawg.io/media/screenshots/c37/c3719d562ee9393d2c403d46f83847d7_Oh70LPa.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 92, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Syeda Kausar fatima"], "genres": ["Adventure", "Sports", "Racing"], "publishers": ["Syeda Kausar fatima"], "esrb_rating": "Everyone 10+"}