{"id": 240463, "slug": "t-rex-simulator-3d-survival-adventures", "name": "T-rex Simulator 3D - Survival adventures", "name_original": "T-rex Simulator 3D - Survival adventures", "description": "Welcome to T-rex Simulator 3D!<br/>You are a dinosaur now! Explore the wild volcano island and find all secrets of Jurassic world. Complete quests or play survival mode. Create a strategy and fight with other dinosaurs. Make a clan and breed a new t-rex. Level­up your dinosaur to improve survival skills.<br/><br/>Features of T-rex Simulator 3D:<br/>- Wild Jurassic world<br/>- Dinosaur clans<br/>- Survival and quests mode<br/>- Many dinosaur species<br/>- 3D graphics<br/>- Wild nature sounds<br/>- Realistic behaviour simulator<br/><br/>Volcano island is waiting for you. Become a dinosaur and enjoy the survival in the wild. Fight with velociraptors, explore the island is search of other t-rex. There are two modes: quests and survival. In survival mode your only one mission is to stay alive in Jurassic world. In quests you are exploring the volcanoes, looking for dino skeletons, killing wild enemies and doing other things.<br/><br/>Dinosaur's life is hard, but imagine that there are two active volcanoes in the simulator! Ride your t-rex and enjoy all locations of Jurassic Volcano World.<br/><br/>Have you ever dreamed about Jurassic period with wild dinosaurs and beautiful nature? So, we have made the simulator for you. Hunt, kill, and explore. Find t-rex mate, breed another dinosaur and maintain their survival. Be the most powerful creature in the volcano world with dangerous dinosaurs.<br/><br/>Start your Jurassic journey now! Easy controls help you to move your t-rex, find enemies and kill. Eat wild healing flowers to maintain your t-rex health, the simulator is not easy. Fight as a wild Jurassic beast! They are always ready for battle. But if you levelup your wild animal, you can win all battles in our survival simulator. Or just run. And keep away from the giant triceratops, even developers of the Jurassic simulator can't knock them down. Ooops! It was our secret.<br/><br/>If you like survival games and Jurassic world as much as we do, we can't wait you start playing T-rex Simulator 3D.", "metacritic": null, "released": "2016-04-22", "tba": false, "updated": "2019-07-01T03:30:35", "background_image": "https://media.rawg.io/media/screenshots/164/164e6931e10ae5782d9e623c9ee5e2e7.jpg", "website": "http://wildanimalsworld.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 117, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Andrew Kudrin"], "genres": ["Strategy", "Simulation"], "publishers": ["Andrew Kudrin"], "esrb_rating": null}