{"id": 240451, "slug": "wild-snow-leopard-animal-simulator", "name": "Wild Snow Leopard: Animal Simulator", "name_original": "Wild Snow Leopard: Animal Simulator", "description": "Try to be a wild dangerous leopard in Wild Snow Leopard: Animal Simulator! Become a wild animal and run across beautiful snow locations.<br/><br/>We love leopards! Turn to snow leopard right now. Run, fight and complete quests. Find an animal mate and breed a new leopard. Develop a survival strategy against wild and farm animals. Level­up a leopard in simulator to improve survival skills. Find other leopard and start a family. Farm next levels to open new survival skills in the animal simulator.<br/><br/>Choose a mode that you like more - animal survival or quests. The both are very enjoyable! Start your survival today, with our leopard simulator. We enjoy leopards and do our best to make great animal games. Create your strategy in the simulator! Be a dangerous wild snow leopard!<br/><br/>Features of Wild Snow Leopard: Animal Simulator<br/><br/>- Different animal species<br/>- Survival and quests mode<br/>- Wild nature sounds<br/>- Big cruel wild world<br/>- Many survival locations<br/>- Animal behavior simulator<br/>- Wild leopard family<br/>- Small leopards breeding<br/><br/>Have you ever dreamed to be a leopard? In our survival simulator we turn you to a wild animal. Maintain your wild leopard energy, survival in the wild is not easy for animal. Sneak into a village, steal tasty food! Or fight for survival with every animal you meet.<br/><br/>You will meet a lot of animal species in the survival simulator! Bears, deer, rabbits, and other leopards of course.<br/><br/>Wild Snow Leopard: Animal Simulator is full of special animal sounds. Listen to deep into survival. This survival simulator has a map and a guide inside. Simulator controls allow you to run and fight. Read how to ride your animal and many other things.<br/><br/>Try our Wild Snow Leopard: Animal Simulator, be a leopard and explore a big dangerous forest!", "metacritic": null, "released": "2016-09-20", "tba": false, "updated": "2019-07-01T03:27:44", "background_image": "https://media.rawg.io/media/screenshots/3fe/3fe98ac2990479d2116a2ea45144bf6d_O2uaTVg.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 116, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["Andrew Kudrin"], "genres": ["Strategy", "Simulation"], "publishers": ["Andrew Kudrin"], "esrb_rating": null}