{"id": 240443, "slug": "wild-african-horse-animal-simulator-2017", "name": "Wild African Horse: Animal Simulator 2017", "name_original": "Wild African Horse: Animal Simulator 2017", "description": "Become a horse in Wild African Horse: Animal Simulator 2017!<br/><br/>Try how to be an African animal in horse survival simulator. Complete funny quests and upgrade your horse to open new survival skills. Explore the African locations and fight for your survival. Find an animal mate and breed a new African horse. Get a horse herd, it is important for your survival: there are many animal species in the survival simulator. Have your own African animal, that you can feed, ride and play with!<br/><br/>Features of Wild African Horse: Animal Simulator 2017:<br/><br/>- 3D graphics<br/>- Survival atmosphere<br/>- Animal behavior simulator<br/>- African horse herds<br/>- Many animal species<br/>- Survival and quests<br/><br/>Ride a horse across African simulator's lands, adventures are waiting for your survival! Sneak into every corner. Fight with every animal you meet or run. Survival is not easy for animal, so maintain your African horse energy in the simulator. Upgrade your animal and finish all quests - in the survival simulator they can be challenging, but funny.<br/><br/>African horse in the simulator is better than real animal! Real horse can't beat a giant crocodile or a rhino. But your animal can do it in our survival simulator! Don't wait! Listen to the nature, deep into African horse life and survival. Never played animal simulator games? Hold your African horse! Try our simulator right now. There are tutorial and smooth animal controls inside. Learn how to run and challenge friends.<br/><br/>Avoid big lions or find how to survive against them. Even cute animals can be dangerous in the survival simulator. Finish quests, help your African horse to be a hero. Try it, 3D graphics makes the animal survival simulator even more interesting!<br/><br/>Ride, fight and enjoy Wild African Horse: Animal Simulator 2017!", "metacritic": null, "released": "2016-07-10", "tba": false, "updated": "2019-07-01T03:24:23", "background_image": "https://media.rawg.io/media/screenshots/905/90516b87890334a70a3512b80118eb64_GzpKiTc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 131, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["Andrew Kudrin"], "genres": ["Strategy", "Simulation"], "publishers": ["Andrew Kudrin"], "esrb_rating": null}