{"id": 240475, "slug": "orca-killer-whale-survival-simulator-3d-play-as-or", "name": "Orca Killer Whale Survival Simulator 3D - Play as orca, big ocean predator!", "name_original": "Orca Killer Whale Survival Simulator 3D - Play as orca, big ocean predator!", "description": "Become an orca - big killer whale! <br/>Have you ever imagined how hard the life of the orca? With our simulator you can check it. Try it right now! Explore the ocean among ice fields in search of food. In Killer Whale Survival Simulator you must behave like an animal. Hunt, eat and breath! Keep your oxygen level. Fight with every animal or run away. Level­up your predator to improve survival skills. Form a pod and breed another orca. Be afraid of harpoons!<br/><br/>Features of Killer Whale Survival Simulator:<br/><br/>- Cruel ice ocean atmosphere<br/>- Various animal species<br/>- Whale groups<br/>- Survival and quests mode<br/>- North landscapes<br/>- Limited oxygen simulator<br/>- Violent animals<br/>- Harsh whale catchers<br/><br/>This survival simulator is not easy, make your own killer whale pod, explore the ocean not alone. Breed a new orca. Your animal mates will follow you through the ocean ice. But in this simulator they can die. Think how to support the survival of the team. And don't forget about your orca. Hunt, eat, jump out of the ocean for oxygen and never sleep. Who knows what animal may hide behind the ice?! There are a lot of them in the ocean.<br/><br/>There are a map and a guide in the simulator. Convenient controls allow you to turn, hunt, jump, etc. Try how to ride your orca, eat and kill. Explore all places and do many other things among the ice.<br/><br/>Explore the ice ocean and avoid the whale catchers! They are looking for you among the ice blocks. You are a giant animal, but your life is full of danger! Start your ice adventures with our simulator right now. Turn on a survival mode and fight. Your orca can destroy every animal you meet in the ocean.<br/><br/>Killer Whale Survival Simulator lets you to be in whale's skin as if you are a real ocean animal. Real survival adventures among the ice. Wait... What is it? It is the ice ocean orcas are calling for you.<br/><br/>We can't wait when you start playing your orca in Killer Whale Survival Simulator 3D!", "metacritic": null, "released": "2016-04-16", "tba": false, "updated": "2019-07-01T03:32:45", "background_image": "https://media.rawg.io/media/screenshots/6c4/6c48041c5e64139755d152cc3dc62ac3.jpg", "website": "http://wildanimalsworld.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 117, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["Andrew Kudrin"], "genres": ["Strategy", "Simulation"], "publishers": ["Andrew Kudrin"], "esrb_rating": null}