{"id": 24047, "slug": "dr-luigi", "name": "Dr. Luigi", "name_original": "Dr. Luigi", "description": "<p>\n      Zap viruses in a falling block puzzle game featuring Dr. Luigi™!\n    </p><p>\n      There’s a new doctor in the house! Dr. Mar—or, uh, Dr. Luigi is a new \n      twist on this classic virus-popping puzzle game! Use new L-shaped pills \n      in a brand new game mode and compete with players locally or online.*\n    </p><p>\n      Drop pills the usual way, or get a second opinion with the Wii U GamePad \n      controller. Virus Buster mode lets you position falling pill segments \n      with the touchscreen and stylus to place them wherever you want. Use \n      L-shaped pills carefully in the new Operation L mode or, for you \n      die-hard Dr. Mario fans, there’s always Retro Remedy mode. Feeling \n      better? Then sweat it out online* and see where you rank among the \n      world’s elite Operation L and Retro Remedy mode players. Both modes \n      feature online leaderboards.* It’s just what the doctor ordered…even if \n      it’s a little late!\n    </p><ul>\n<li>\n        Celebrate the Year of Luigi with Dr. Luigi™\n      </li>\n<li>\n        New L-shaped pills make you rethink your strategy in Operation L mode\n      </li>\n<li>\n        Use the Wii U GamePad controller’s touchscreen in Virus Buster mode\n      </li>\n<li>\n        Relive or try out the classic-pill dropping gameplay of Retro Remedy \n        mode\n      </li>\n<li>\n        Compete against other players locally or online*\n      </li>\n<li>\n        Both the Operation L and Retro Remedy modes feature online \n        leaderboards*\n      </li>\n</ul><p>\n      *Broadband Internet access required for online features. For more info, \n      go to support.nintendo.com.\n    </p>", "metacritic": null, "released": "2013-12-31", "tba": false, "updated": "2019-09-12T06:39:11", "background_image": "https://media.rawg.io/media/screenshots/863/86338d52efbed3a0c050704963759294.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 4, "beaten": 1, "toplay": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 137, "game_series_count": 7, "reviews_count": 1, "platforms": ["Wii U"], "developers": ["Nintendo"], "genres": [], "publishers": ["Nintendo"], "esrb_rating": null}