{"id": 240483, "slug": "oil-truck-simulator-3d-offroad-tank-truck-driving", "name": "Oil Truck Simulator 3D - Offroad tank truck driving", "name_original": "Oil Truck Simulator 3D - Offroad tank truck driving", "description": "Open the cabin of an oil truck and drive as a professional offroad driver in our simulator!<br/>Drive the truck with petrol. Transport your cargo to the sawmill, station and other destination points. But don't hit the truck. Or you blow up! Complete interesting missions and enjoy how to drive in offroad atmosphere. Drive fast and carefully and don't hit your truck in the big forest. Test the power of a big tank truck with offroad simulator.<br/><br/>Feel like a real offroad driver with our simulator! Complete transport missions. Deliver gasoline and be fast, other workers are waiting for your transporter. Explore forest roads. Test your offroad driving skills with the simulator. It is not easy.<br/><br/>Features of Oil Truck Simulator 3D:<br/><br/>- Easy drive controls<br/>- Powerful oil truck<br/>- Offroad terrain simulator<br/>- Interesting missions<br/>- Time limit<br/>- Great 3D graphics<br/>- Real sounds simulator<br/><br/>Try to transport gasoline in the forest. Drive your tank truck and be accurate! Workers in the simulator don't like waiting for oil. Use a simulator's navigation map to find a destination point. Drive and explore offroad terrains with mud, hills and other obstacles. Drive like a professional oil transporter driver with our simulator, good roads are for girls.<br/><br/>Get ready for challenging missions. Even if you can't drive in real life, you can drive an oil truck in the Oil Truck Simulator 3D. Drive across different offroad terrain and enjoy the simulator atmosphere.<br/><br/>Find new ways to drive your petrol cargo. Fight with rough offroad terrain. Test the power of oil truck. Deep into the offroad atmosphere. It is not easy simulator! Drive as fast as you can and don't hit a tank truck.<br/><br/>It is a pretty hard drive simulator. Learn how to drive an oil truck and be accurate with your oil cargo in any situation. Do you like offroad terrains as much as we do? So, it is time to try our Oil Truck Simulator 3D. Drive to feel the offroad power of the oil truck. Drive without roads, climb hills, fight with forest in the simulator. A great offroad simulator for real men!<br/><br/>Today is the best day to drive an oil truck in our simulator.<br/>Try our Oil Truck Simulator 3D. <br/>Drive with us and face cool adventures!", "metacritic": null, "released": "2016-06-03", "tba": false, "updated": "2019-07-01T03:35:36", "background_image": "https://media.rawg.io/media/screenshots/c61/c61cb8dfe60a6cf31872d7e3d0da84ae.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 151, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Andrew Kudrin"], "genres": ["Strategy", "Simulation"], "publishers": ["Andrew Kudrin"], "esrb_rating": null}