{"id": 240593, "slug": "christmas-drops", "name": "Christmas Drops", "name_original": "Christmas Drops", "description": "Christmas Drops begins as a simple match three <br/>board game and gradually increases difficulties<br/>as obstacles are added and level objectives becomes <br/>more challenging.<br/><br/>* Christmas themed match three puzzle<br/>* 375 levels over five difficulty modes including relaxed no timer special.<br/>* Multiple objectives,challenges and obstacles<br/>* 15 Dazzling power up combinations<br/>* Each level presents you with unique Objectives and Challenges.<br/>* Obstacles mixed with unique level board shapes will keep you swiping and matching for more.<br/>* Create powerful chained power up cascades to level up!<br/>* No in-app purchase, one time payment for the whole gaming experience.<br/>* Hints/Music/Banners can be disabled.<br/><br/>----------------------------------------------------------<br/>There are six possible objectives on each level.<br/>1. Score quota<br/>2. Remove dark pulps<br/>3. Bring down candy cane(s).<br/>4. Remove net(s)<br/>5. Fly angel(s)<br/>6. Consume the Christmas Wreath.<br/><br/>----------------------------------------------------------<br/>There are two possible challenges on each level.<br/>1. Complete the objective before time runs out.<br/>2. Complete the objective before you ran out of swaps.<br/><br/>----------------------------------------------------------<br/>Obstacles.<br/><br/>1. Snowman / Cookie: These items can not be moved, can only <br/>   be cleared if an adjacent match item is cleared or if a<br/>   ribbon frame or a double christmas item power up is triggered.<br/>   A cookie leaves a level three dark pulp.<br/><br/>2. Netted item: An item behind a net can not be swapped.<br/>   Can only be removed by matching the christmas item behind the net<br/>   with two other christmas items of the same type, or if it's in the<br/>   path of a triggered power up chain.<br/><br/>3. Bomb christmas item : A bomb is represented by a dynamite with a timer.<br/><br/>   The timer shows the number of seconds before<br/> the bomb goes off.  <br/>   When the bomb explodes <br/>the christmas item will be replaced with an obstacle.<br/><br/>   To defuse the bomb, you need to match the bomb <br/>christmas item with two<br/>   or more christmas items <br/>of the same type or a power up chain clears <br/>   it <br/>before seconds run out.<br/><br/>----------------------------------------------------------<br/>Objectives.<br/><br/>1. Score quota - You need to reach a certain score in order to <br/>    level up.<br/>2. Remove dark pulps.<br/>    Dark pulps are removed be clearing the christmas item ontop of the <br/>    dark pulp.  There are three levels of dark pulps.  The darkest<br/>    pulp needs to be removed three times, which means you need<br/>    to clear three christmas items ontop of that dark pulp.<br/>3. Bring down candy cane(s) to the bottom of the game board.<br/>4. Free the netted christmas item.<br/>5. Fly all angel(s).<br/>6. Consume the christmas wreath.<br/><br/>----------------------------------------------------------<br/><br/>A vaulted christmas item when opened reveals a christmas wreath.<br/>A vaulted item can only be opened by matching and clearing<br/>all the keyed christmas items. <br/><br/>----------------------------------------------------------<br/>Angel(s) are not switchable<br/><br/>You need to match an adjacent item around the <br/>angel to change its phase<br/><br/>In order for the angel to take flight, the angel needs to<br/>cycle  to all the phases, from tucked wing to<br/>open winged angel.<br/><br/>All angel(s) needs to fly in order to level up.<br/><br/>----------------------------------------------------------<br/>Matching 4 or more christmas items rewards the player <br/>with a power up. <br/><br/>There are three power ups.<br/><br/>1. Ribbon frame (horizontal and vertical)<br/>2. Double christmas item<br/>3. Dancing Santa<br/>4. Christmas wreath<br/><br/>----------------------------------------------------------<br/>Mystery items.<br/><br/>Mystery items are represented by gift boxes<br/>Mystery items are unraveled by matching the gift box's color<br/>with the item color.  Mystery items could be power ups or an<br/>obstacle - making the level easier or harder it's up to your<br/>luck<br/><br/>----------------------------------------------------------<br/>Auto hints can be disabled/enabled<br/>Banners can be disabled/enabled<br/>Music and sound can be disabled/enabled", "metacritic": null, "released": "2014-12-05", "tba": false, "updated": "2019-07-30T06:43:22", "background_image": "https://media.rawg.io/media/screenshots/cc6/cc69aaaab6ebc677fa0d1b056000ca81.jpg", "website": "http://www.bullbitz.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 62, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["ROBERTO MANONGDO"], "genres": ["Board Games", "Puzzle"], "publishers": ["ROBERTO MANONGDO"], "esrb_rating": null}