{"id": 240650, "slug": "cool-guy-teaches-math-chapter-4-the-final-showdown", "name": "Cool Guy Teaches Math - Chapter 4: The Final Showdown", "name_original": "Cool Guy Teaches Math - Chapter 4: The Final Showdown", "description": "<p>We've been through <strong>TOO MUCH </strong>I have to fight him... Even if I die... I will fight him, I will try my best to defeat him. For the good of humanity. For the good of math, I will defeat him.</p>\n<p>Controls: </p>\n<p>WASD to move SPACE to jump LEFT SHIFT to sprint</p>\n<p>to attack, get to an adjacent platform and left click on his tentacle</p><p>If at any time one of the platforms you are standing on turns darker, this means it will fall within one second, and reappear within 2 seconds.</p>\n<p>WATCH YOUR STAMINA</p>\n<p>ESCAPE to exit to the main menu</p>\n\n<p>If you would like to talk about future game ideas or just to talk to one of the developers at Pinnacle Games, you can join our discord server here: https://discord.gg/czknA7K.</p>\n\n<p>Real talk: </p>\n<p>Honestly, thank you so much for helping me make CGTM an actual series... I really just called the first chapter 'Chapter 1' as a joke because it sounded funny. I was just making a meme game, I really wasn't gonna post it. But when I did, i didn't really care. Until one summer night at 12:00 AM, I looked up 'Cool guy teaches math', and I saw FIP plays had uploaded a lets play, what are the chances... I'm really curious to know, FIP plays, if your reading this and there is a special reason you found my game, then email me at nickisepic8@gmail.com. Anyways, I digress I watched the video, and I had felt the most excited I ever had in my life. After a while I noticed more and more people were playing my game. Then, Low Light Games (BTW he's awesome) commented on the first chapter telling me how much he liked it, and was hoping for a second chapter. Then I thought, 'Hmm... Second Chapter? Well SUPPLY AND DEMAND BUD' I slapped the second chapter on to itch.io and everyone still liked it. From then on, I put as much dedication into my game as possible. I planned out the story into four chapters. Now that brings us to today, and I thank all my lucky stars that FIP plays happened to come across my game. I hope you stay tuned for any future Pinnacle Games productions.</p>\n<p>Thanks to all of you - NickChaps</p>", "metacritic": null, "released": "2018-09-16", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/8e0/8e0bd648128050326909f4953185ffe6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 84, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Pinnacle Games"], "genres": ["Action"], "publishers": [], "esrb_rating": null}