{"id": 240620, "slug": "projectile-fighter", "name": "Projectile Fighter", "name_original": "Projectile Fighter", "description": "<p>Projectile Fighter is a challenging arcade game where you can choose from a large variety of unique characters with multiple abilities to compete against a gauntlet of characters in a battle of projectiles. Projectile Fighter is like a fighting game but mainly projectiles are used to determine the outcome of a match. Projectile fighters can use a variety of elements for projectiles including light, dark, wind, magma, earth, lightning, aqua, fire, ice, plant and unique. Unique would apply to any projectile that does not fall under any of the other elements. All elements with the exception of unique have a weakness(an element they are weak to) and a counter(an element they counter). All characters have an affinity/element that determines their strongest element, elements they are resistant to and elements they can absorb. Projectile fighters can use basic techniques to attack by throwing projectiles in various directions(horizontally or diagonally upwards while standing and diagonally downwards while jumping) and they can defend themselves by deflecting, dodging jumping over and/or absorbing projectiles. Projectile fighters can also use a long list of special techniques for attacking, defending or powering themselves up. All characters are capable of using any technique but they are most likely to use their favorite techniques. Read the in-game guide/manual to get more information about the mechanics, techniques and terminology associated with the game. Projectile Fighter includes music and features a soundtrack with 7 tracks. Various types of projectiles include light energy, dark vortex, tornado(wind), magma ball, meteor(earth), lightning bolt, aqua ball, fire ball, ice spike, leaf(plant), wood(plant), ki energy, diamond, energy beam, eye beam, shock wave, shuriken, twilight energy, twilight vortex and star. Various classes/types of characters include normal, android, mage, swordsman, ninja, hybrid, alien and deity. Projectile Fighter is a very hard game that requires good reflexes, reactions, patience and focus in order to succeed.</p>", "metacritic": null, "released": "2018-09-17", "tba": false, "updated": "2019-08-28T23:20:17", "background_image": "https://media.rawg.io/media/screenshots/1c5/1c5f52d70031e7aaf059acee45b8526d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 107, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Hardai Games"], "genres": ["Fighting"], "publishers": [], "esrb_rating": null}