{"id": 240715, "slug": "stand-by-for-re-entry-beta", "name": "Stand By For Re-Entry (Beta)", "name_original": "Stand By For Re-Entry (Beta)", "description": "<p>This was a game originally made in a grade 10 computer technology class in a span of 17 hours. It was the first game I had ever made. It was made on an old version of gamemaker 8.1, I may update it for fun in the future. Anyways, it may be simple, but I made most of the sprites and things myself, hope you ENJOY!</p>\n<p><strong>Lore:</strong></p>\n<p>The year is 3044; humanity has been wiped off the face of the earth and all but eradicated. All but one… Launched into space many years ago to explore, a young space cadet by the name of Sterling Ryder has made first contact in another galaxy not so far from our own.</p>\n<p> Whilst documenting his findings and journey,  Sterling Ryder encountered a spacial void,  a “rip in time” of sorts. This new, parallax universe is full of hostile creatures and beings. The only hope of re-joining the normal space-time continuum is to make it through to the leader of the hostile beings, and end him… only then you can start your new life and rebuild humanity.</p>\n\n<p><strong>In this side-scrolling sci-fi arcade thriller:</strong></p>\n<p>Pull on your flight suit; it is time for you to walk in the footsteps of Cadet Ryder and pilot your way back to the normal time period. Your mission is to fly your way through the debris fields, fight enemies and make your way to the boss and slay them to advance.</p>\n<p>Now get moving cadet… The very fate of humanity rests on your shoulders!</p>\n\n<p><strong>Features:</strong></p>\n<ul><li>Exhilarating and action packed fast paced gameplay\r\n  </li><li>Fluid &amp; simple controls set-up\r\n  </li><li>Runs well on virtually any computer (exclusive to Windows OS)\r\n  </li><li>Classic arcade graphics, feel, and gameplay style\r\n  </li><li>Immersive soundtrack and effects\r\n  </li><li>Provokes a feeling of progression due to the modular, multi-level design\r\n  </li><li>Somewhat challenging to the recreational gamer\r\n  </li><li>Re-playable\r\n  </li><li>Arcade art style\r\n  </li><li>Room for expansion, with new levels to be released soon!</li></ul>\n<p><strong>Controls:</strong></p>\n<ul><li>“W” or “up arrow” to go up\r\n  </li><li>“A” or “left arrow” to go left\r\n  </li><li>“S” or “down arrow” to go down\r\n  </li><li>“D” or “right arrow” to go right\r\n  </li><li>“Spacebar” to shoot\r\n  </li><li>“Enter” to interact</li></ul>\n<p><strong>Note:</strong></p>\n<ul><li>Bosses are killed by destroying their turrets. <strong><em>Hit points vary between bosses</em></strong>\n</li><li>There are currently only two levels, once they are completed it will default back to the home screen</li></ul>", "metacritic": null, "released": "2018-09-16", "tba": false, "updated": "2019-08-28T23:20:17", "background_image": "https://media.rawg.io/media/screenshots/da8/da861a7a5463ebc46df438506617d134.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 111, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["RedStripe_7"], "genres": ["Shooter", "Adventure"], "publishers": [], "esrb_rating": null}