{"id": 240799, "slug": "eternal-september", "name": "Eternal September", "name_original": "Eternal September", "description": "Created in cooperation with Incarta'95\r\n<em>Eternal September or the September That Never Ended is Usenet slang for a period beginning in September 1993, the month that Internet service provider America Online began offering Usenet access to its many users, overwhelming the existing culture for online forums.\r\n<br/><br/>Before then, Usenet was largely restricted to colleges and universities. Every September, a large number of incoming freshmen would acquire access to Usenet for the first time, taking time to become accustomed to Usenet's standards of conduct and \"netiquette\". After a month or so, these new users would either learn to comply with the networks' social norms or tire of using the service.\r\n<br/><br/>\r\nWhereas the regular September freshman influx would quickly settle down, the influx of new users from AOL did not end and Usenet's existing culture did not have the capacity to integrate the sheer number of new users. Since then, the popularity of the Internet has brought on a constant stream of new users and thus, from the point of view of the pre-1993 Usenet users, the influx of new users in September 1993 never ended.<br/><br/>Eternal September (Wikipedia)</em>\n\n<p>Eternal September is my attempt at expressing the idea of the September That Never Ended. It's an online only game in which you can play music among other players, but with a twist: When you disconnect, your virtual player will persist and repeat your actions. This means that the longer a server is up, the more players will pile up inside of it.</p>\n<p>If you can't connect to the server for some reason, you can set up your own with the Dedicated Server download below. Make sure to read the readme!<br/><br/></p>\n\n<p>\n<strong>Controls</strong></p>\r\n\r\nMove       - WASD\r\nInteract   - E or Left Click\r\nPause      - Escape\r\nPlay Music - Press Keyboard keys when keyboard is focused", "metacritic": null, "released": "2018-09-15", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/e6a/e6a17b474ba6fd40a2610b2044632e79.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 82, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Iseeicy"], "genres": [], "publishers": [], "esrb_rating": null}