{"id": 24073, "slug": "pokemon-rumble-u", "name": "Pokémon Rumble U", "name_original": "Pokémon Rumble U", "description": "<p>\n      Each morning, Capsules filled with Toy Pokémon are delivered to the Toy \n      Shop. One day, some capsules filled with Toy Pokémon accidentally drops \n      into the river—a river that sets them adrift to a far-off place. Intent \n      on getting back to the Toy Shop, the Toy Pokémon start walking. \n      Suddenly, a Toy Pokémon appears in front of them and challenges them to \n      a battle! Why are the Toy Pokémon fighting each other? Will they make it \n      back to the Toy Shop?\n    </p><p>\n      Features:\n    </p><ul>\n<li>\n        Battle and collect all 649 Pokémon in this over-the-top rumble!\n      </li>\n<li>\n        As a Toy Pokémon, you’ll take on huge waves of other Toy Pokémon \n        through more than 70 battles that introduce new challenges and \n        obstacles.\n      </li>\n<li>\n        Before each level, you can select to play as any of the Toy Pokémon \n        you have collected.\n      </li>\n<li>\n        As the game progresses, more powerful Toy Pokémon can be collected \n        through battles, which you can then play with.\n      </li>\n<li>\n        Using the Wii U GamePad and Wii Remote controllers, you can play with \n        up to 3 friends and collect even more Toy Pokémon together.\n      </li>\n<li>\n        NFC Figures* (sold separately) can be scanned to receive that Toy \n        Pokémon in game and powered up using money gathered in the game to use \n        their special traits in battle.\n      </li>\n</ul><p>\n</p><p>\n      *NFC figures are not required to fully enjoy the game—they are an \n      accessory sold separately that works with the game and enhances gameplay.\n    </p>", "metacritic": null, "released": "2013-04-24", "tba": false, "updated": "2023-04-27T08:21:30", "background_image": "https://media.rawg.io/media/screenshots/983/983f9e732001eebbee45748f09ab206f.jpg", "website": "http://www.pokemonrumble.com/RumbleU/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3, "beaten": 5, "toplay": 2, "dropped": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 4, "suggestions_count": 159, "game_series_count": 4, "reviews_count": 4, "platforms": ["Wii U"], "developers": [], "genres": [], "publishers": ["Nintendo"], "esrb_rating": null}