{"id": 240935, "slug": "maze-of-adventures-itch", "name": "Maze Of Adventures (itch)", "name_original": "Maze Of Adventures (itch)", "description": "<em>An adventure puzzle game with a story!</em>\n\n<p>This game is about the brave adventurer Archaeologist John, who explores ancient ruins all around the world. You will see a series of fascinating puzzles - clamping plates, closed doors, teleports and death traps make the entangled mazes even more difficult.</p>\n<p>You will need full power of your intellect to collect all the treasures and find the ancient artifacts before the insidious villain Hans von Typischerbösewicht!</p>\n\n\n\n<em>Features:</em>\n\n<ul><li><strong>Braincracking puzzles</strong> - for those who know how to work with his head, not with the spinal cord.</li>\n<li><strong>Rare gameplay</strong> - the character can move vertically or horizontally, but only from wall to wall at a time. For those who are tired of the endless clones of clones of clones and dreams of trying something new.</li>\n<li><strong>Adventure story</strong> - humorous comments of the protagonist will not let you get bored and rest after another intense level.</li>\n<li><strong>Locations around the world</strong> - search for treasures in deserts of Egypt, explore the ruins of medieval Europe. There is different scenery, different story and different reward in each chapter.</li>\n<li>All the sceneries are <strong>hand painted and detailed with love</strong>.</li></ul>\n\n<em>Current development state:</em>\n\n<ul><li>44 levels in two chapters! Each final level in the chapter has a unique mechanics.</li><li>Dashing plot, three heroes and more than 250 phrases of dialogues, from funny to incredibly serious.</li><li>A lot of Easter eggs and references to other games and modern culture.</li><li>8 completely different interactive puzzles and dozens of their combinations in labyrinths up to 28x28 cells.</li><li>And there is a 'Battle royale'! Has anyone ever seen a 'Battle royale' in a puzzle game? </li></ul>\n\n\n\n<p><em>Since there are only two people work on the game, we will be very grateful for your feedback. New ideas, new locations, new puzzles, new mechanics - everything that the players find interesting and useful for the game. We will necessarily consider and try to make it by the time of release.</em><br/></p>\n<p><em>Follow the development: Twitter, Steam community</em></p>\n\r\nWe hope that the game will give you a lot of fun!", "metacritic": null, "released": "2018-09-14", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/868/8687a85b926f81a357c305b1b857dd17.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 221, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["OCPonl"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}