{"id": 241056, "slug": "dark-deception", "name": "Dark Deception", "name_original": "Dark Deception", "description": "<p>Dark Deception is a story driven first-person horror action maze game, created from a collaborative indie effort between DD&#39;s original creator and the creator of TJOC: Story Mode.<br />\nDark Deception mixes the fast-paced style of classic arcade games with fun horror game design. Trapped in a dark world full of nightmarish mazes and ridiculous monsters, the only way out is to face the darkness and find a way to survive.<br />\nThis is the first chapter in the Dark Deception story. Investigate and survive the first maze. Be careful though. You are not alone. There are monsters in there and they are looking for you. You will face your fears. The question is - what are you afraid of?<br />\nFeatures:<br />\nFast-paced Arcade Horror: No hiding in lockers here. Run for your life and run fast. Enemies can be stunned and avoided, but not killed.<br />\nPower System: Earn XP and unlock powers as you progress that will allow you to even the odds and survive longer against horrendous creatures.<br />\nHigh Quality: AAA-quality graphics and creative designs give players a variety of unique and terrifying worlds and enemies to survive.<br />\nHazardous Environments: Enemies are not the only danger. The mazes themselves are full of traps, hazards, and other dangers to watch out for.<br />\nUnique Enemies: Every nightmare presents a unique creature that has its own distinct AI. Players will have to change up their tactics in order to survive.<br />\nDark Humor: While scary, Dark Deception is not a bloody or gory game and features it&#39;s own stylized brand of dark humor. Dark Deception was designed to be enjoyed by everyone.</p>", "metacritic": null, "released": "2018-12-06", "tba": false, "updated": "2024-03-08T11:42:56", "background_image": "https://media.rawg.io/media/screenshots/e39/e39651e5a9faf0b545b551e19e6d5845.jpg", "website": "https://www.glowstickentertainment.com", "rating": 3.46, "rating_top": 4, "added_by_status": {"yet": 17, "owned": 453, "beaten": 8, "toplay": 8, "dropped": 16, "playing": 4}, "playtime": 1, "achievements_count": 18, "ratings_count": 33, "suggestions_count": 313, "game_series_count": 0, "reviews_count": 35, "platforms": ["PC"], "developers": ["Glowstick Entertainment"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["Glowstick Entertainment"], "esrb_rating": null}