{"id": 241088, "slug": "minoria", "name": "Minoria", "name_original": "Minoria", "description": "<p>Minoria is the latest and most ambitious game from Bombservice, and a spiritual sequel to the Momodora series, from the same studio.<br />\nFans of Momodora will find familiar aspects in the design and gameplay elements, as they master the ins-and-outs of parries, dodges, and a variety of different spells.<br />\nThe presentation has evolved to an HD format, with aesthetics mixing 2D hand-painted backgrounds and cel-shaded characters.<br />\nThe story takes place during the fourth Witch War. It is a time of fanatical religious fervor. On the one hand, by the Sacred Office, a powerful organization leading an Inquisition against heresy, in order to purify the sinners who threaten humanity. And on the other hand, those labeled “witches”, responsible for conducting a mysterious ceremony that contradicts the rules of the Church.<br />\nSet forth with Sisters Semilla and Fran, missionaries in the Church’s service, on their journey to thwart the witches’ ceremony and protect the common-folk from heresy that endangers the status quo.<br />\nA powerful fantasy story inspired by the history of medieval Europe<br />\nA unique visual aesthetic combining hand-painted 2D art with cel-shading<br />\nFluid controls encouraging careful engagement and patient play<br />\nOffensive combat enabling players to crush enemies with a mix of swordplay and spells<br />\nDefensive options including dodge-rolls and parries<br />\nA leveling system that helps players adjust their character to their desired difficulty<br />\nHello there! I’m rdein, the creator and director of Minoria.<br />\nFirst of all, I’d like to share my excitement in announcing this project. This is an universe I care a lot for, from the setting to the characters, and it’s been a lot of fun to explore and develop its concepts during the process of game development.<br />\nFor the first time in many years, I started a game project set in a new universe. It felt like a breath of fresh air for me. With that said, Minoria does contain some similarities with my previous projects (especially Momodora’s latest installment, Reverie Under the Moonlight).<br />\nI am proud of what we’ve been making for Minoria, and I hope you will enjoy the story and characters I’ve prepared this time around!<br />\nHowdy folks, Dan here from Dangen Entertainment. It’s been hard patiently waiting for the announcement of Minoria, knowing what an amazing game it’s going to be. It combines everything I love about the Momodora games with stronger emphasis on a solemn story. I love how Bombservice is approaching the visuals this time around too--it’s a unique take that looks beautiful and shows another evolutionary step in the team’s development experience, just as previous titles have.<br />\nThis game is extraordinary. A must-play if you’ve got an appetite for action-platformers like I do.</p>", "metacritic": 73, "released": "2019-08-27", "tba": false, "updated": "2023-07-10T21:51:18", "background_image": "https://media.rawg.io/media/games/a11/a115439cf07ec721103dd7367f84732a.jpg", "website": "", "rating": 3.49, "rating_top": 4, "added_by_status": {"yet": 52, "owned": 803, "beaten": 26, "toplay": 19, "dropped": 8, "playing": 4}, "playtime": 2, "achievements_count": 31, "ratings_count": 35, "suggestions_count": 217, "game_series_count": 0, "reviews_count": 37, "platforms": ["Xbox One", "Nintendo Switch", "PlayStation 4", "PC"], "developers": ["Bombservice"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["DANGEN Entertainment"], "esrb_rating": null}