{"id": 241121, "slug": "touhou-dreaming-butterfly-dong-fang-die-meng-zhi", "name": "Touhou: Dreaming Butterfly | 东方蝶梦志", "name_original": "Touhou: Dreaming Butterfly | 东方蝶梦志", "description": "<p>Touhou: Dreaming Butterfly is a Touhou Project derivative game developed by Strrationalism.It uses the way of the horizontal STG that any original game has never used.This game aims to make the horizontal STG players experience the fun of games,also lets the player who are used to the vertical STG have more contact with the horizontal STG, an entirely different type of game from Touhou original games.So, based on keeping style of the horizontal STG,Touhou: Dreaming Butterfly is almost similar to Touhou original games.like known Spell-card Rule, beautiful stages, concentrated but not hard to dodged bullets.</p>\n<p>How to play:</p>\n<p>Direction Key – Move </p>\n<p>Shift Key – Slow </p>\n<p>Z Key – Shoot/Enter</p>\n<p>X Key – Bomb/Cancel</p>\n<p>ESC Key – Pause/Cancel</p>\n<p>Recommended:</p>\n<p>Graphics: NVIDIA GTX950M (support OpenGL 2.0)</p>\n<p>Memory: 4GB</p>\n<p>CPU: 2.3GHz</p>\n<p>Using the gamepad with vibration and joystick, this game has better support for gamepad.</p>\n<p>Hello! We are Strrationalism, a team with interest.Now you’ll play our production, Touhou: Dreaming Butterfly.Whether by chance or long awaited, we are very happy to share with you the joy and hope of this game!</p>\n<p>It says that people entered someone’s dream inadvertently in Gensokyo.</p>\n<p>The leading roles are also our miko and magician.</p>\n<p>As the only ‘waking’ people, they came across acquaintances, one of who was abnormal manic, or sinister, or strange, or…themselves?</p>", "metacritic": null, "released": "2018-10-15", "tba": false, "updated": "2019-08-28T21:53:09", "background_image": "https://media.rawg.io/media/screenshots/30f/30f3bf3d48d9612732c2174b2b17e48f.jpg", "website": "https://thdmz.club", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 6}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 293, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["弦语蝶梦"], "genres": ["Action", "Casual", "Indie"], "publishers": ["弦语蝶梦"], "esrb_rating": null}