{"id": 241145, "slug": "matchygotchy-z", "name": "MatchyGotchy Z", "name_original": "MatchyGotchy Z", "description": "MatchyGotchy Z continues the MatchyGotchy spirit of childlike wonder and casual fun, introducing Zoot, the one true universal currency. Use Zoot to unlock places in your home Starbase like Zootlandia, the largest intergalactic currency exchange, and MatchyMart, a monster convenience store that ate several smaller stores. Immerse yourself in a new richer experience while building thousands of ships to reach Xanadu. <br/><br/>The MatchyGotchy cast is back, including Matchy Star, Spacey Galaxy, Pirate Planet, Loony Lander, Guru Moon, Speedy Sputnik and Doctor UFO. These Stars need your love so they can build ships, reach Xanadu, and become the rocket surgeons they always wanted to be. Look after your Stars' food, health, cleaning, games, and important selfie every other day. The better you take care of your Stars, the more productive they are and the faster they level. With four life stages: smol egg, tiny baby, awkward teen, and rocket surgeon adult, make sure to cycle through the activities to boost your Stars' productivity. They need your guidance to grow and work to visit Xanadu’s legendary Space Water Park, BIG X!<br/><br/><br/><br/>Starbase’s interdimensional ship building laboratory is full of new surprises. You can buy more kinds of food that affect your Star’s growth, personalize your clothing, and unlock more mini-games with custom options available for your little Star. Now you can trade in all the ships your Stars build for Zoot: take advantage of market fluctuation and sell, or simply save up money - however you decide to make the most out of your hard earned Zoot. Since there's plenty new items, there will be a MatchyDex to help you keep track of all 'em upgrades.<br/><br/>Meet a whole new cast including the galaxy's most efficient and friendly robots: Era, MatchyMart's funtastic clerk; and Zee, Zootlandia's smartsy pants analyst. Eventually you can invite Era and Zee to the lab to play a brand new min-game once you complete your MatchyDex. To guide you through all this universe of fun there will be a bubbly assistant named Stardust born from the collision of two derpatudinal novas and capable of understanding the universal astrological language. As a special bonus, you have a chance of discovering a new pet in Xanadu: Asteroid! They are a temperamental challenge, but if you treat them right they can be very sweet and can shower you with surprise gifts.<br/><br/>Game features:<br/><br/><ul><li> Total of 9 new minigames: cards, follow the cup, hackysack and many more, all fully customizable. In addition, you can unlock a new action: the magic 8 ball.<br/></li><li> New areas to work in the laboratory expansion. New areas to visit, MatchyMart and Zootlandia.<br/></li><li> All sorts of customizations for games, consoles, and Stars's outfits available for purchase at MatchyMart.<br/></li><li> Zootlandia offers different trade and banking transactions. Save or spend your Zoot.<br/></li><li> New Matchyverse characters: Era, Nom, Zee and Stardust! Plus a new pet to level, Asteroid.<br/></li><li> MatchyDex inventory screen to keep track of all your Zoot and items.<br/></li><li> Over 40 achivements, leaderboards, could save, and Steam cards as soon as they are available to upload.</li></ul><br/><br/><br/>MatchyGotchy Z is an expanded and revamped experience in the MatchyGotchy series, including a universe of fresh new options for returning players. For new players, we would like to welcome you into the Matchyverse. MatchyGotchy and MatchyGotchy Z are part of the Matchy Star world, which is still in development and you can follow on Steam here:<br/><br/>https://store.steampowered.com/app/782430/Matchy_Star/", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:53:07", "background_image": "https://media.rawg.io/media/screenshots/261/261318297586234903f47001753931ec.jpg", "website": "https://www.silverwaregames.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 132, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Silverware Games"], "genres": ["Simulation", "Casual", "Indie"], "publishers": ["Silverware Games"], "esrb_rating": null}