{"id": 241164, "slug": "accounting-2", "name": "Accounting+", "name_original": "Accounting+", "description": "<p>What began as a small game jam between William Pugh (The Stanley Parable), Dominik Johann (Minit) and Justin Roiland (Rick and Morty) is now, two years later, an aberration of warped technology, weird worlds and strange, disturbing creatures. Since its debut in 2016 (10/10 on Steam), Accounting has tripled in size, mutating into an intricate labyrinth of forbidden virtual realities. There are countless more secrets to discover if you have the stomach to brave the dangers of new characters, brought to life by an ever expanding cast of comedic legends (Rich Fulcher, Reggie Watts and Justin Roiland, to name a few).<br />\nHow long have these goggles been pressing into my flesh?<br />\nAccounting is a noble profession. During your tenure with Smith &amp; Smitherson, you will bare witness to the afterbirth of this new facet of human experience. However, it is not without it&#39;s dangers. Here are some of the dangers you need to be aware of before entering Accounting+.DANGERSIf you die in VR, you die in real life.<br />\nDo not play after midnight.<br />\nSome Characters may be unfriendly and not actively encourage you during gameplay.<br />\nAchievements linked to unforgivable acts of human corruption.<br />\nA soundtrack that is way better than a VR game soundtrack should have any right to be.<br />\nSubtitles and Translations for 9 languages… Oh wow that’s internationally dangerous.<br />\nThe vacuum of space.<br />\nSitting and Standing Mode are BOTH available (and dangerous)!!<br />\nAnd, unfortunately: The Cops.</p>", "metacritic": 74, "released": "2017-12-19", "tba": false, "updated": "2024-04-09T14:27:58", "background_image": "https://media.rawg.io/media/games/d6a/d6ad9c892f4519cf96641e8845005c40.jpg", "website": "https://accountingpl.us/", "rating": 3.98, "rating_top": 4, "added_by_status": {"yet": 10, "owned": 244, "beaten": 35, "toplay": 10, "dropped": 5}, "playtime": 2, "achievements_count": 63, "ratings_count": 45, "suggestions_count": 254, "game_series_count": 0, "reviews_count": 46, "platforms": ["PC", "PlayStation 4"], "developers": ["Squanch Games", "Crows Crows Crows", "Roberts & Co Bunsen Outlet"], "genres": ["Action", "Adventure", "Simulation", "Casual", "Indie"], "publishers": ["Crows Crows Crows"], "esrb_rating": null}