{"id": 241178, "slug": "sexbot-quality-assurance-simulator", "name": "Sexbot Quality Assurance Simulator", "name_original": "Sexbot Quality Assurance Simulator", "description": "<p>----Playable in VR and NonVR----<br />\n----Supporting HTC Vive, Oculus Rift and WMR----<br />\nHUGE LGBT update coming end of September! (FREE)<br />\nAdding:<br />\n- Playerbody character customisation<br />\n- Bot(NPC) customisation<br />\n- Professional Japanese Voiceovers<br />\n- New Toys<br />\n- Eastereggs<br />\nA long time ago, Earth was destroyed in a global thermonuclear war.<br />\nSoon afterwards, a global sickness started to spread through radioactive contaminated air. Fewer and fewer women were born until, humanity was close to extinction. To escape our dying planet, an Ark was built to find a new home for humanity.<br />\nWe started to develop artificial females to sustain the population on our long journey. Many years have passed since the first working unit was was produced.<br />\nTesting this vital technology is your job. Treat the bot with respect, as improper behavior might spell doom for not just you, but all of humanity. Even it&#39;s just a machine, it is imperative to earn their trust and admiration<br />\nBe gentle, sensitive, and ensure the survival of the human race.<br />\nYour Captain, Hazelhoff<br />\n--------------------------------------------------------------------------------------------------------------------------------------------------------------<br />\nGreetings from Berlin!<br />\nWe hope you enjoy our first release &quot;Sexbot Quality Assurance Simulator&quot;, by Candy Valley Network.<br />\nBy supporting us and buying this game, your money will be going straight into building the team which will enable us to push out new and exciting content quicker with higher quality!<br />\nAt Candy Valley Network, our goal with this product series is to create adult games for everyone who wants to express their sexuallity through Virtual Reality in a healthy way, no matter your preferences or physical ability. However this includes certain constraints,  we as developers are strictly against any form of abuse or rape fantasy. We have built and are still developing systems to prevent this kind of behaviour.<br />\nNow with that said, we are happy to collect as much feedback as possible to make our next releases and content updates to your liking.<br />\nKey Features<br />\n- Playable in VR and Non-VR<br />\n- Full-body interaction (NPC/Player Body)<br />\n- Discover a vast amount of toys hidden in the lab<br />\n- Detailed sexual content<br />\n- Enjoy six different amazing synthwave tracks</p>", "metacritic": null, "released": "2018-10-02", "tba": false, "updated": "2023-01-28T19:02:24", "background_image": "https://media.rawg.io/media/screenshots/acf/acf85a9143a37db5d4a51a8f0618cccf.jpg", "website": "", "rating": 3.86, "rating_top": 5, "added_by_status": {"yet": 1, "owned": 19, "toplay": 7, "playing": 2}, "playtime": 2, "achievements_count": 0, "ratings_count": 7, "suggestions_count": 339, "game_series_count": 0, "reviews_count": 7, "platforms": ["PC"], "developers": ["Candy Valley Network"], "genres": ["Simulation", "Casual", "Indie"], "publishers": ["Candy Valley Network"], "esrb_rating": "Teen"}