{"id": 241108, "slug": "kunoichi-tsubaki", "name": "Kunoichi Tsubaki", "name_original": "Kunoichi Tsubaki", "description": "In Japan's Warring States period,<br/><br/>demons known as \"warlords\" run rampant, as they feed on the malice of humanity.<br/><br/>The people cower in fear at the warlords' oppression, and impotently accept their subjugation.<br/><br/>But there is one ray of light that strikes through the darkness.<br/><br/>The only people with the strength to resist the warlords, are a special group of women, shrouded in secrecy.<br/><br/>They are known only as: \"Kunoichi\" and they, too, are creatures of darkness.* ConceptIn order to punish the oppressive warlords, first investigate the town by day, disguised as a maid. Then, use your ninja skills to sneak into their castle at night, and vanquish the enemy!<br/><br/><br/>- Charm<br/>Use your alluring powers of temptation to extract information!<br/>Charm your enemies by approaching them in disguise!* System- Sneak attack<br/>Press the confirm button behind an opponent to perform a sneak attack.<br/>Enemies are knocked unconscious by sneak attacks, allowing you to avoid combat.<br/><br/>- Transformation<br/>In a dungeon, if your Lust is higher than 0, hold A to transform into a cat.<br/>While transformed, enemies won't spot you, but you cannot perform sneak attacks.<br/>While transformed, your Lust steadily decreases.<br/>You cannot move to new areas while transformed.<br/><br/>- Ecstasy<br/>Ecstasy increases Lust, which makes Tsubaki stronger.<br/><br/>- Lust<br/>Attacks from an enemy raise Lust.<br/>As her Lust rises, Tsubaki's attacks become stronger, but she also takes more damage.<br/><br/>When Lust reaches maximum, Tsubaki is in heat.<br/>Being in heat has its pros and cons.<br/>Try to learn how to make the best use of it in each situation.<br/><br/>Being in heat can be canceled by using 'Mental Concentration'.<br/><br/>- Restraining attacks<br/>The enemy may try to restrain Tsubaki.<br/>If restrained, she will be defenseless against attacks.<br/><br/>Use your Ninja ability \"Recover Stance\" to escape from the enemy's restraint!* Plus, some more mechanics that will ensure smooth enjoyment of the game:- Charm<br/><br/>- Choose whether or not to view a scene that you have already scene.<br/>- Save &amp; Load<br/><br/>Illustrator: Kaisen Chuui<br/>Scenario: Ejimura, Hajime Tani<br/>Music: Goru<br/><br/>Created using RPG Maker MV", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:53:10", "background_image": "https://media.rawg.io/media/screenshots/46d/46dee05f4cf0bc43244f769461d66beb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 6, "toplay": 2, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 163, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["とらいあんぐる！"], "genres": ["RPG", "Indie"], "publishers": ["DLsite.com"], "esrb_rating": null}