{"id": 241112, "slug": "real-winners-victoryball", "name": "Real Winners: Victoryball", "name_original": "Real Winners: Victoryball", "description": "In Real Winners: Victoryball, you'll operate as a sports robot doing their best to win. Pick up and play rules that change the match and end up with a game that's nothing like where it started. Rules can change everything from the size of the players to adding buzz saws to the field. Fast paced and silly, Real Winners: Victoryball is a great game to pick up and play with friends, relative or frenemies! Real Winners: Victoryball is a 4-player local party game.<br/><br/>Real Winners: Victoryball comes with four distinct game modes:<br/><br/><strong>Victoryball</strong> begins as classic soccer. Kick the ball into the opponents goal. Add a laser fence and a baseball bat for a real challenge.<br/><br/><strong>Dodgeball</strong> poses the question: What if dodgeballs were also bombs? The answer is: Way more explosions. <br/><br/><strong>Trophy Troubles</strong> is a free for all where bots scramble to grab the trophy and hold onto it as long as possible. <br/><br/><strong>King Of The Hill</strong> gets a bit of a twist. This co-op mode finds the bots defending the King Ball from an onslaught of zombots that want to kick him out of his courtly circle. <br/><br/>Score often, score loudly.", "metacritic": null, "released": "2018-09-28", "tba": false, "updated": "2020-03-25T12:23:47", "background_image": "https://media.rawg.io/media/screenshots/967/9674959e27cca6514df4114fad078644.jpg", "website": "http://realwinnersgame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 241, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Kevin Knight", "Pizza Curse Studios", "Pizza Curse", "jholland"], "genres": ["Sports", "Indie"], "publishers": ["Pizza Curse Studios"], "esrb_rating": null}