{"id": 241158, "slug": "boxing-school", "name": "Boxing School", "name_original": "Boxing School", "description": "In Boxing School you become a boxing manager in the 80s. You’ll hire the boxers, teach them to fight and climb the ranks.Choose your teachings and training.Your boxers have unique fighting styles and skills. Do you want to teach non-stop swarmer aggression or a slower boxer style with more punching power? Or maybe you just want your boxer to be able to counter-attack and prey on opponent's mistakes.  Choose between a variety of fighting styles and skills.<br/>Pick the right fighters. Scouting the world for hidden gems is all the more satisfying when you find a potential new champion that hits like a truck and wish to become the future of boxing.<br/>Choose tactics and strategy.Manage your fighters between rounds to gain the edge on your rivals in the ring. Do you want your boxer to go for early KO and risk to run out of gas or play it more safe and wait for the right moment to strike when the opponent is tired.Key Features:<ul><li>  Hire boxers.<br/></li><li>    Manage training schedules.<br/></li><li>    Choose between a variety of fighting styles and skills.<br/></li><li>    Scout new candidates with active potential rating system.<br/></li><li>    Arrange fights and promotional events.<br/></li><li>    Gain new insights in the boxing world.<br/></li><li>    Coach your boxers in the ring between rounds.<br/></li><li>    Upgrade your gym and training equipment.<br/></li><li>    Level up as boxing manager and unlock improvements.<br/></li><li>    Promote your boxers and gain worldwide fans.<br/></li><li>    Climb in rank and challenge the champion himself.</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:53:06", "background_image": "https://media.rawg.io/media/screenshots/768/768ab3e49a884e2335f020ea0e2faa83.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 9, "dropped": 2, "playing": 1}, "playtime": 3, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 208, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Raptor Claw Games"], "genres": ["Strategy", "Simulation", "Indie"], "publishers": ["Raptor Claw Games"], "esrb_rating": null}