{"id": 241218, "slug": "real-limo-parking-simulator", "name": "Real Limo Parking Simulator", "name_original": "Real Limo Parking Simulator", "description": "Ready for an IMPOSSIBLE Parking Challenge? Well, OK, it’s not impossible, but it’s really hard! Have you got what it takes to pass all the levels?<br/><br/>Take the Ultimate Test of Driver &amp; Machine. Some incredibly tight courses, totally tricky maneuvers and seemingly impossible parking places to weave and sneak your vehicles neatly into!<br/><br/>Drive  interesting and unique vehicles around the Beautiful city. Master a Stretched Limo.<br/><br/>Each come with their own challenges and specially designed levels to push your Precision Parking to the Maximum!<br/><br/>The “Real Limo Parking Simulator” is a one of  of ultra-hard Parking Simulator games. <br/><br/>Get ready for a fun, crazy parking game!<br/><br/>Think you can drive? Think you can park? Well, can you park a limo? Come and find out? This game will test your ability to drive and park a limo in the time allotted. Fun for all ages! Great time killer!<br/><br/>So,Get your Chauffeurs hat on and get ready to cruise with the Stars in 3D Real Limo Parking Simulator!<br/><br/>GAME FEATURES<br/>▶ Drive Fantastic vehicles! Hard but Fun to Master!<br/>▶ Uniquely designed challenges to test your Precision Driving!<br/>▶ 100% Free-to-play Career Mode<br/>▶ Multiple views (including Drivers Eye view with real-time mirrors*) <br/>▶ iOS Optimisation: runs perfectly on anything from the original iPad 1 to the latest 5th Generation widescreen devices.<br/>Graphics supported for. iphone 6plus", "metacritic": null, "released": "2015-09-05", "tba": false, "updated": "2019-10-22T14:15:57", "background_image": "https://media.rawg.io/media/screenshots/b9b/b9b26b3491fceb6cbcea4cd1872f1574.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 43, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Mohammad ali"], "genres": ["Simulation"], "publishers": ["Mohammad ali"], "esrb_rating": "Everyone 10+"}