{"id": 241226, "slug": "mini-plane-flying", "name": "Mini Plane Flying", "name_original": "Mini Plane Flying", "description": "The newest flying adventure is available today, jump into the role of a pilot. Take control in your hands as the flight control tower just given you the clearance for landing. Get the feeling of flying a massive aircraft with this newest flight simulator game, fly the plane through the sky and experience the feeling of a being a pilot. Real Mini plane simulator 3D! is a super realistic flight simulator game, you get to learn everything about the aviation industry.<br/><br/>Mini Plane  3D  Flight - Fly Simulator gives you the chance to fly loads of different kind of planes. It does not matter if you are a beginner pilot or a more advanced one. In this awesome new 3D airplane simulator game, you need to fly different commercial jets and airplanes to their flight destination. Take off from the airports runway after collecting the passengers. Fly your plane across the big open 3D world, Fly over sea’s, cities and highways. Fly over big ocean collect jems  and land at your destination airport. Take the right approach as the runway lights of the airport closes in on you and your flight crew. Bring the plane safely to the ground and land the and guide your plane towards the runway and park the mini airplane within the marked zone to complete the level. Steer and guide your plane while parking it close to the landing runway through all the stuff you can find on a busy airfield. Think of other planes, buses, airport equipment and more.<br/><br/>To be the most successful aeroplane pilot in the sky you need to follow the directions from control closely. So you know what direction you need to go.In your approach to the runway slow the plane down and start to prepare the landing on the ground. Land and fly you can learn to become a real pilot. After landing the plane on the ground at your destination be very careful to not crash your jetplane against other vehicles on the runway. Parking the plane is just important as flying the aeroplane around. Since you have a limited amount of time during flying and after landing to park your plane you need to keep a close watch on the time.<br/><br/>Support iPhone 6 plus", "metacritic": null, "released": "2015-09-22", "tba": false, "updated": "2019-10-22T14:15:57", "background_image": "https://media.rawg.io/media/screenshots/e15/e15f6f5b1a0bbf83532867ebdf7cd61f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 76, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Mohammad ali"], "genres": ["Simulation"], "publishers": ["Mohammad ali"], "esrb_rating": "Everyone 10+"}