{"id": 241426, "slug": "shinnazuki", "name": "ShinNaZuki", "name_original": "ShinNaZuki", "description": "[Orthodox Japanese RPG -- Absolute Audiovisual Feast]<br/>--- Six major floating island adventures for super interaction,The chapter story line takes you to experience multiple worlds, and the million-word story takes you to explore the grand world view.<br/>--- Fantasy beautiful background music for super sense,Background music is carefully produced by Japanese music master Hitoshi Sakimoto, whose masterpiece is \"Final Fantasy Ⅻ\"!<br/><br/>[A number of Popular Voices - Listening to the Voice of Guardian]<br/>--- Super popular voice actor \"Hanazawa Kana\" as the \"Voice Ambassador\" <br/>together with many top voice actor\"Kimura Ryouhei\", \"Hayami Saori\", <br/>\"Fukuen Misato\"\"Horie Yui\" create the voice of the guardian. <br/>Many voice actor dubbing entirely, and more,sound interaction at intimate scene .<br/>--- Hatsune Miku broken wall to collaborate with Hanazawa Kana,<br/> the two loveliest sang the theme song \"ShinNaZuki\".<br/>More cute sounds waiting for you to listen!<br/><br/>[Reputed Painter Create Characters--Playing a variety of Modeling]<br/>--- \"Bloodline\" Art Team and Japanese well-known painter Zuzuhira Hiro,<br/> Mikimoto Haruhiko, Nekonabe Ao carefully drawn the characters, hundreds of <br/>painted characters can visually feel strong personality shaping.Unique and stunning picture <br/>not only can make pictorial book, but also give the player a huge sense of imagination.<br/>--- Gorgeous fashion free to change in girls dream closet. Spoiled, Crying, Shy...<br/>Character expressions are vivid and varied, and a variety of styles are free to match.<br/><br/>[Multiple Innovative Gameplay-- Real time PVP Battle]<br/>--- Single manipulating more than 40 kinds of character combinations, <br/>Warriors, Archer, Assassins, Mages, Cleric, the five major occupations, <br/>completely non-repetitive character characteristics and skill effects. <br/>The shackles and combinations between the characters also affect the battle!<br/>--- Using professional restraint to carry out pre-war deployments, using various <br/>brain-burning tactics such as back-attacks, combos and positions to break the enemy one by one.<br/> The fun of the game is more indicative of the player's Strategy&amp;Tactics!<br/>--- Real-time PVP battle, multiplayer build team to fight against the world BOSS, <br/>Guild War, Party Trial, Magic Cards, Star Ladder, Mystryland, etc.!", "metacritic": null, "released": "2018-09-15", "tba": false, "updated": "2019-10-22T14:16:04", "background_image": "https://media.rawg.io/media/screenshots/4e6/4e63c3a06d63f97edca3ecc487437ebd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 200, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Wonder Game Technology Co"], "genres": ["Card"], "publishers": ["Wonder Game Technology  Co"], "esrb_rating": "Teen"}