{"id": 241463, "slug": "save-o-animal-hero", "name": "SAVE (•ө•) Animal Hero", "name_original": "SAVE (•ө•) Animal Hero", "description": "◈ From the developers featured on the TOP 10 INDIE GAMES 2017 ◈<br/><br/>Save the cutest animals in the best arcade mini games collection! Their lives are in your hands!<br/><br/>---- DESCRIPTION ----<br/><br/>Which one is the smallest of the worlds? A super-globalized Earth? Life inside an ant colony? Pluto? When we thought about it for a while, we realized the smallest of the worlds may be something oppressive instead.<br/><br/>Think about a cage.<br/><br/>Think about having each day less space to live.<br/><br/>Think about someone controlling and limiting all your actions, every day.<br/><br/>Think about living only to serve and die.<br/><br/>Think about not being human in this world.<br/><br/>We created the smallest of the worlds… but it might not be the world we enforce the animals to live in. The smallest of the worlds could also be our narrow mind, every time we refuse to see what we are really doing :’(<br/><br/>¿WHY MINIGAMES?<br/><br/>We wanted to “talk” about as many topics as possible, so we though a bunch of simple-but-addictive mini games would fit this goal. Inspired by Wario Ware games like ‘Dumb Ways To Die’ we wanted ‘SAVE’ to feel friendly but meaningful at the same time. Hope we achieved it!<br/><br/>--------<br/><br/>Regarding In-App Purchases: <br/>IAPs removes ads.<br/>We'll donate our part of the proceeds to WWF. <br/>We'll publish the amount donated each month through our social media!<br/>*No internet connection needed.<br/><br/>--------<br/><br/>This game is made by a young passionate team so we really appreciate your feedback ^-^<br/><br/>We really hope you enjoy our game! We certainly had a blast making it. Even if you didn’t, we’d love to hear from you. Email us at info@platonicgames.com<br/>Join our community and take part in great contests and giveaways!<br/>Youtube Channel: https://www.youtube.com/c/Sweetsinsgame<br/>Follow us on Twitter! https://twitter.com/PlatonicGames<br/>Like us on Facebook: https://facebook.com/PlatonicGames<br/><br/>Your time and efforts are truly appreciated, and will make a lasting impression on the future of the environment!<br/><br/>Thanks! &lt;3", "metacritic": null, "released": "2017-11-02", "tba": false, "updated": "2019-10-22T14:16:06", "background_image": "https://media.rawg.io/media/screenshots/f35/f35d1fcf713d334c3908d0865e68cefb.jpg", "website": "http://www.platonicgames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 49, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Platonic Games"], "genres": ["Action", "Arcade"], "publishers": ["Platonic Games"], "esrb_rating": "Everyone 10+"}