{"id": 241531, "slug": "city-island-premium-builder-tycoon-citybuilding-si", "name": "City Island: Premium - Builder Tycoon - Citybuilding Sim Game from Village to Megapolis Paradise - Gold Edition", "name_original": "City Island: Premium - Builder Tycoon - Citybuilding Sim Game from Village to Megapolis Paradise - Gold Edition", "description": "If you liked the early Sim City tycoon games, you will definitely love this city building game!<br/>In City Island you will build houses for your citizens, decorations and community buildings to make them happy, and create jobs so you can earn money and gold from your happy citizens.<br/><br/>Discover a life in a virtual world full of quests where you have the power to build a business empire with a choice of 85+ unique buildings, like hotels, cinema's, offices, bakeries, restaurants, and even oil platforms on your paradise island. Grow your tiny city into a large metropolis. Catch some fish with your boats, make people happy by building parks, schools, churches, libraries, museums, plants, and even a nice ferris wheel. It is all about insight and balance in this city tycoon game: happy people attract more citizens, who will need residences and jobs. You have all the power in this epic story: discover what is the best way to be a successful entrepreneur on this fabulous exotic island!<br/><br/><br/>** Features **<br/>- Fun tycoon game<br/>- Tablet support<br/>- HIGH QUALITY graphics<br/>- Intuitive gameplay<br/>- Challenge to create your own new virtual paradise<br/>- Unlock and build from a list of 85+ Unique buildings (residential, commercial, community, decoration, plants, sea buildings like oil platforms and more)<br/>- Currencies: gold and cash<br/>- Attract citizens with parks, trees, and community buildings<br/>- Build residences for your citizens<br/>- Collect profit from your commercial buildings<br/>- Upgrade your city buildings<br/>- City park theme<br/>- Collect XP and level up to unlock new buildings for construction<br/>- Collect dozens of REWARDS while playing<br/>- Expand the tiny city on your paradise island to create more room for constructing more buildings, and making your tiny city bigger and bigger<br/>- Speed up construction/upgrade time using gold<br/>- Lots of adventure and quests to unlock<br/>- Help your citizens build a city on this exotic island<br/>- Age independent story<br/>- Find pirate chests around your island, containing cash or gold<br/>- Tons of hours of fun<br/>- Sim style architecture<br/>- Play with your friends: enter friend codes and gift codes to receive cash and gold<br/>- The \"City Advisor\" will provide insight and tell you what is needed in your city<br/>Join the community and follow us on Twitter, and Like us on Facebook, to get FREE giftcodes every week!!", "metacritic": null, "released": "2014-04-08", "tba": false, "updated": "2019-10-25T03:41:18", "background_image": "https://media.rawg.io/media/screenshots/ab3/ab3a6784b62cdf2cc6984a5493869484_EVc0vNp.jpg", "website": "http://www.sparklingsociety.net/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 142, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Sparkling Society"], "genres": ["Strategy", "Simulation"], "publishers": ["Trigames"], "esrb_rating": null}