{"id": 241540, "slug": "battle-cards-savage-heroes", "name": "Battle Cards - Savage Heroes", "name_original": "Battle Cards - Savage Heroes", "description": "A card battle game that is all about collecting awesome cards from various card packs, building competitive decks and fighting your opponents in a compelling campaign set in a real world wildlife setting. Unique in the way it has replaced the typical turn based card game mechanism with an interesting real time system. Keeping you on your toes it is certain to deliver interesting gameplay, for both newcomers to the genre as well as the veteran CCG / TCG player. Unleash your powerful packs of creatures on your sorry foes and train your creatures in order to unlock magical traits and abilities, delivering an intense experience you never thought a collectible card game (CCG) could. Trade cards with friends to further improve your card deck (TCG).<br/><br/>The game will take you on a journey over the fantastic virtual world map where you will encounter new enemies and win them over and have them fight for you. Compete in different game modes and prove your skills against card decks from other players from all over the world. Raise your fame on the global leaderboards where thousands of other players are waiting for you, to be beaten or to get beaten. Become the number one card hero of the world, the leader of the pack!<br/><br/>Easy to learn, hard to master. Or rather: complex not complicated. You may have heard it all before, but this game delivers where others fail. No steep learning curves, no over complicated mechanics, still enough depth and challenge to keep you occupied for many many hours. Polished game mechanics and beautiful graphics that you didn’t know your device was capable of will complement the ultimate card game experience and blow you away.<br/> <br/>FEATURES<br/>* Huge single player campaign that will be your primary source of new cards<br/>* More than 60 unique creature cards, lots of cool card packs<br/>* Compete in real time, forget about turn based TCG/CCG<br/>* Three game modes that will allow you to fight against AI and other players<br/>* A generous rewards system provides different card packs and a number of ingame currencies<br/>* Upgrade your cards and unlock special traits and abilities that make them even stronger<br/>* Global leaderboards that challenge you to compete with the best players worldwide<br/>* Features special social features to connect and exchange cards with your friends<br/>* Common, Rare, Epic &amp; Legendary card types, all deliver a unique experience<br/>* The world is yours to take…", "metacritic": null, "released": "2017-08-08", "tba": false, "updated": "2022-11-02T18:53:39", "background_image": "https://media.rawg.io/media/screenshots/4a3/4a39743f47ede024f02fa884809fea80.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 123, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["Sparkling Society"], "genres": ["RPG", "Strategy"], "publishers": ["Trigames"], "esrb_rating": null}