{"id": 241534, "slug": "jurassic-dinosaur-carnivores", "name": "Jurassic Dinosaur: Carnivores", "name_original": "Jurassic Dinosaur: Carnivores", "description": "Welcome to Jurassic Dinosaur - Carnivores Evolution!<br/><br/>In this TCG game set in the Prehistoric Era, packed with epic dinosaurs, you are challenged with the task to rule this jurassic world by defeating powerful enemies on the road to survival.<br/>Fight with powerful prehistoric dinosaur cards, collect awesome carnivores and herbivores, evolve your kingdom of mesozoic dino creatures, and unlock a wide variety of notorious dinosaurs, like the mighty t-rex, triceratops, several raptor dinos, spinosaurus, brachiosaurus and the ankylosaurus.<br/>This CCG Evolution game includes several battle game modes, such as campaign, tournaments but also an endurance mode to test your jurassic carnivores in an ultimate challenge to survival.<br/><br/>This game is not your typical CCG dino game: it is not turn-based, but real-time!<br/>This makes the game really fresh and stand out from the crowd in this genre.<br/>Unlock new traits for your dinosaurs as you upgrade them, which give them unique strategic elements during battles.  <br/>It is all about skill &amp; timing during the card battles, and managing your ultimate deck in the meta game.<br/><br/>FEATURES<br/>* 60+ Jurassic dinosaurs, such as t-rex, triceratops and raptors<br/>* A beautiful prehistoric dino world<br/>* Real time dinosaur card battles<br/>* Fight bosses and conquer new battlegrounds<br/>* Win cardpacks to unlock new dino cards<br/>* Multiple battle modes<br/>* Leaderboard<br/>* Invite and play with friends<br/>* CCG features: collect, upgrade, evolve your dinosaurs<br/>* TCG features: donate cards to friends", "metacritic": null, "released": "2017-11-14", "tba": false, "updated": "2019-10-25T03:41:37", "background_image": "https://media.rawg.io/media/screenshots/315/315a7a44113a124b9c6e54accd0257f2_fOMcU7t.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 156, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Sparkling Society"], "genres": ["Strategy", "Simulation"], "publishers": ["Trigames"], "esrb_rating": null}