{"id": 241619, "slug": "the-quest-classic-cursed-chess-set", "name": "The Quest Classic - Cursed Chess Set", "name_original": "The Quest Classic - Cursed Chess Set", "description": "The Quest Classic - Cursed Chess Set is an expansion to The Quest Classic, a beautifully hand-drawn, immersive and enchanting world full of exciting challenges. After enabling the expansion, you can explore new areas and quests. However, if you don't have The Quest Classic, you can also play the expansion as a standalone game.<br/><br/>There has been a severe mana leak in the world that has left all beings stripped of power. You can plug the leak but can't reverse the damage that has already happened. Your mission, beyond plugging the mana leak, is to find and destroy the evil creature who captured the King's two landmark towers so he could magically add them to his cursed chess set as rooks. When he has succeeded in capturing the king and queen to complete his cursed chess set, he will be able to summon a demon that will give him ultimate power in this world. Destroy him and the demon before he can complete the ritual!<br/><br/>This expansion is designed for fresh characters. It's highly recommended that you start a new character to fully enjoy it. To access the new areas (not applicable if you are playing the expansion standalone), go to Matras harbor and talk to captain Verra, then select \"Cursed\" as your travel destination. For those who would like to play with an existing higher level character, there is a high level dungeon for a challenge.<br/><br/>The Quest Classic - Cursed Chess Set has been developed by Zarista Games (www.catacomber.com) and was adapted to iPhone by Redshift.", "metacritic": null, "released": "2010-08-30", "tba": false, "updated": "2019-08-02T04:11:50", "background_image": "https://media.rawg.io/media/screenshots/0e0/0e0e6a69dcf9c21e551c14341c8de555.jpg", "website": "http://www.redshift.hu", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 244, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Redshift"], "genres": ["Adventure", "RPG"], "publishers": ["Vilya, BT."], "esrb_rating": "Everyone 10+"}