{"id": 241604, "slug": "the-quest-classic", "name": "The Quest Classic", "name_original": "The Quest Classic", "description": "* For new players we recommend The Quest! *<br/><br/>The Quest Classic is a beautifully hand-drawn, engaging and sinister world full of mystery, magic and provocative challenges.<br/><br/>Choose from five customizable races and an array of skills, attributes, weapons, armor and enchantments, then explore a huge non-linear realm of four different cities and a wilderness of mountains, caves, lakes and forests.<br/><br/>Play an absorbing card game, solve brain-teasing quests and clash with dangerous opponents in this turn- and skill-based Role Playing Game.<br/><br/>You will have many choices, including some that may place you against the law, along your way to the dramatic end of your own choosing. You will need all your gaming know-how to survive and discover your destiny!<br/><br/>The Quest Classic features:<br/><br/>- 50 hours of gameplay! <br/>- fps-like view with continuously rendered 3D graphics<br/>- ambient visual and sound effects<br/>- day and night cycles with weather effects<br/>- a huge, complex, living world with underground levels<br/>- long and provocative main storyline<br/>- dozens of interesting side missions<br/>- optional undead race with different abilities<br/>- complex magic, enchant and alchemy system<br/>- primary and secondary skills<br/>- advanced dialogue system<br/>- readable books, pickable locks, repairable items<br/>- race-, gender-, fame- and outfit-based relationships<br/>- fantasy card game with three decks at the inns<br/>- original soundtrack<br/><br/>Watch the QUEST for iPhone YouTube video - http://tinyurl.com/bfmxgk<br/><br/>Link to the PDF manual:<br/>http://www.redshift.hu/iPhone/TheQuestiPhoneManual.pdf<br/><br/>Players who are familiar with Chronicles of Inotia (trademark of Com2uS Corp), Arvale (trademark of PDAMILL), Dungeon &amp; Hero (trademark of CH Games), Orions Legends of Wizards (trademark of More Games) or Vay (trademark of SoMoGa Inc) might enjoy playing The Quest - the 3D Fantasy Role Playing Game.<br/><br/>Here are some great reviews:<br/><br/>\"Near perfect RPG - The Quest more than delivers what it promises.\" -TheAPPera<br/><br/>“It should be considered the benchmark for RPG makers to follow – Gameplay is beautiful and methodical - The sound is great and features a dramatic music track and good special effects - The Quest is pure bliss.” Kiss it, 5/5 -touchmyapps    <br/><br/>\"The Quest is a massive game - don’t hesitate to grab this one up right now.\" -theportablegamer", "metacritic": null, "released": "2009-02-20", "tba": false, "updated": "2019-08-02T04:10:11", "background_image": "https://media.rawg.io/media/screenshots/4e3/4e3acc79d0f5f238a79febe544242d02.jpg", "website": "http://www.redshift.hu", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 250, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Redshift"], "genres": ["Adventure", "RPG"], "publishers": ["Vilya, BT."], "esrb_rating": "Teen"}