{"id": 241601, "slug": "cookies-vs-claus-lite", "name": "Cookies vs. Claus Lite", "name_original": "Cookies vs. Claus Lite", "description": "Cookies vs. Claus is an action-packed battle game. With a range of characters to choose from, you can battle as your favorite cookie or take on a squad as a holiday character. Through both single and multiplayer, experience a unique asymmetric shooter that combines elements of FPS and battle arena games. THIS IS COOKIES VS. CLAUS!<br/><br/><br/>-----------------------------------<br/><br/>This is not the full version of Cookies vs Claus, the full version offers the following features:<br/><br/>Features:<br/><br/><br/>--Matchmaking and Custom Game Modes--<br/>Cookies vs. Claus currently offers two different multiplayer modes. Whether it's playing a Claus character vs. a team of cookies, or battling it out cookie v. cookie, Cookies vs. Claus has the game style for you. Play against live players or bots!<br/><br/><br/>--7 playable Characters with LOTS more planned!--<br/>Choose between unique cookie characters to find one that fits your playstyle. From high-damage to healers to tank characters, protect or carry your team to victory!<br/><br/>OR<br/><br/>Take on a team of cookies as your favorite holiday character! Currently play as Santa Claus or Rudolph the Red Nosed Laser Beam Reindeer to save yourself and the presents!<br/><br/>With over 30 more characters planned, expect a new cookie and/or Claus every two weeks!<br/><br/><br/>--Toys and Power-ups--<br/>Find countless toys and power-ups that cookies or Claus can operate! Bring planes, tanks and elves to life as you take on your worst foe.<br/><br/><br/>--Single Player &amp; Bots --<br/>Play offline to complete 84+ single player missions! Earn stars to unlock new challenges! Cookies vs. Claus also offers bots of each character in on or offline mode so that you can have endless fun!", "metacritic": null, "released": "2017-12-16", "tba": false, "updated": "2019-10-22T14:16:12", "background_image": "https://media.rawg.io/media/screenshots/3a8/3a8beac34067fb39d48485d88c63fd64.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 23, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Josh Williams"], "genres": [], "publishers": ["Josh Williams"], "esrb_rating": "Everyone 10+"}