{"id": 241625, "slug": "the-quest-classic-attack-from-asteroids", "name": "The Quest Classic - Attack from Asteroids", "name_original": "The Quest Classic - Attack from Asteroids", "description": "The Quest Classic - Attack from Asteroids is an expansion to The Quest Classic, a beautifully hand-drawn, immersive and enchanting world full of exciting challenges. After enabling the expansion, you can continue to play The Quest Classic with your existing character(s) to explore new areas and quests. However, if you don't have The Quest Classic, you can also play the expansion as a standalone game.<br/><br/>You're on Captain Hanty's ship when suddenly the stars blow up around you. You sense a summons and feel great pain as you are sucked through the Abyss into another place and time. You have been called to the Asteroids once again. The Elemental Lord awaits you...<br/><br/>You thought you killed Hemma but you only sent him to the Astral Plain -- he's back and has assembled a horror show of creatures who have captured the Asteroid Mage. It's your mission to save her, but -- you know the drill -- it's not going to be easy. There are monsters who love to hate you and puzzles and traps. It's all in a day's work.<br/><br/>To access the new areas (not applicable if you are playing the expansion standalone), go to Mithria harbor and talk to captain Hanty, then select \"Attack\" as your travel destination. It is recommended to reach at least level 58 before trying to take on the challenges of this new expansion. Please note that after you have traveled to your destination, you'll have no way back for a while (except if you have Marked a spot), so it is also recommended that you keep a save in Mithria.<br/><br/>The game uses File Sharing in iTunes. You can save and restore your save game files (named \"TheQuestSaveX.pdb\", where X can be 0 to 20) using iTunes (go to the Apps/File Sharing section when your device is plugged in)<br/><br/>The Quest Classic - Attack from Asteroids has been developed by Zarista Games (www.catacomber.com) and was adapted to iPhone by Redshift.", "metacritic": null, "released": "2010-12-21", "tba": false, "updated": "2019-08-02T04:12:40", "background_image": "https://media.rawg.io/media/screenshots/e24/e248de209e1151512938ad510668f11d.jpg", "website": "http://www.redshift.hu", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 229, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Redshift"], "genres": ["Adventure", "RPG"], "publishers": ["Vilya, BT."], "esrb_rating": "Everyone 10+"}