{"id": 241631, "slug": "the-quest-classic-celtic-queen", "name": "The Quest Classic - Celtic Queen", "name_original": "The Quest Classic - Celtic Queen", "description": "The Quest Classic - Celtic Queen is an expansion to The Quest Classic, a beautifully hand-drawn, immersive and enchanting world full of exciting challenges. After enabling the expansion, you can explore new areas and quests. However, if you don't have The Quest Classic, you can also play the expansion as a standalone game.<br/><br/>Habren is queen now, thanks to you, Hero! However, King Locrinus' brother has challenged her right to the throne. He's taken Madden's two sons under his control and assembled an army to fight Habren. Merlin holds the key to the future and would protect her but he's besieged by an opposing faction of wizards. He calls once more on your skill and daring, Hero. It's your mission to make order out of chaos and save the Queen.<br/><br/>Celtic Queen is the second installment of the Celtic Rift series.<br/><br/>To access the new areas (not applicable if you are playing the expansion standalone), go to Matras harbor and talk to captain Verra, then select \"Celtic Queen\" as your travel destination. It is recommended to reach at least level 35 before trying to take on the challenges of this new expansion.<br/><br/>The Quest Classic - Celtic Queen has been developed by Zarista Games (www.catacomber.com) and was adapted to iPhone by Redshift.", "metacritic": null, "released": "2012-08-31", "tba": false, "updated": "2019-08-02T04:13:55", "background_image": "https://media.rawg.io/media/screenshots/096/096bc268456e91d02370d2207400638b.jpg", "website": "http://www.redshift.hu", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 210, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Redshift"], "genres": ["Adventure", "RPG"], "publishers": ["Vilya, BT."], "esrb_rating": "Everyone 10+"}