{"id": 24182, "slug": "the-legend-of-zelda-twilight-princess-hd", "name": "The Legend of Zelda: Twilight Princess HD", "name_original": "The Legend of Zelda: Twilight Princess HD", "description": "<p>Click<br />\nhere for The Legend of Zelda: Twilight Princess HD retail<br />\nbundle that includes the Wolf Link amiibo™ figure.</p>\n<p>A dark force, shrouded in twilight, has invaded the vast land of Hyrule.<br />\nTo restore light to the world, team up with the mysterious creature<br />\nMidna and embrace the darkness to transform into a divine wolf. Fight<br />\nthrough labyrinthine dungeons, survive puzzling traps and meet a cast of<br />\ncharacters you’ll never forget in this legendary Zelda™ adventure.</p>\n<p>The Legend of Zelda™: Twilight Princess is a critically acclaimed<br />\nmasterpiece, set in a massive world bursting with life—but also shadow.<br />\nA dark figure from the Twilight Realm has invaded the world of light. As<br />\nLink™, a farmhand turned cursed beast, join forces with the impish Midna<br />\nand trusted (albeit unusual) allies to survive a quest that&#39;ll take you<br />\nto the farthest corners of Hyrule and beyond… to the Twilight Realm.<br />\nThis emotional adventure is now on the Wii U™ console with improved<br />\nvisuals and controls—and new challenges. Choose Hero Mode to take 2x<br />\nnormal damage, or tap the Wolf Link amiibo™ figure to unlock the tough<br />\nCave of Shadows.</p>\n<p>The Legend of Zelda: Twilight Princess HD is the best way to<br />\nexperience this critically acclaimed game</p>\n<p>Explore a vast Hyrule, a mysterious Twilight Realm, and<br />\nmasterfully-designed dungeons</p>\n<p>Restore balance to the world with the aid of the impish Midna and your<br />\ndivine wolf powers</p>\n<p>Meet a cast of friendly folk and interesting characters, like the<br />\nentrepreneurial baby Malo and even a yeti couple</p>\n<p>Enhanced visuals, additional controls, bonus challenges, and Miiverse™<br />\nfunctionality make the game feel fresh again</p>\n<p>Play in Hero Mode to take 2x the normal amount of damage—and do it<br />\nwithout any heart drops to refill your health!</p>\n<p>Tap any of the other Legend of Zelda amiibo figures from the Super<br />\nSmash series to unlock other bonuses, like extra arrows or even more<br />\nchallenging gameplay</p>", "metacritic": null, "released": "2016-03-04", "tba": false, "updated": "2024-01-02T19:05:29", "background_image": "https://media.rawg.io/media/screenshots/46e/46e49369d4a3d528db5216a5cadec38b.jpg", "website": "http://zelda.com/twilight-princess-hd/", "rating": 4.57, "rating_top": 5, "added_by_status": {"yet": 56, "owned": 66, "beaten": 122, "toplay": 65, "dropped": 27, "playing": 11}, "playtime": 34, "achievements_count": 0, "ratings_count": 107, "suggestions_count": 511, "game_series_count": 0, "reviews_count": 108, "platforms": ["Wii U"], "developers": ["Nintendo"], "genres": ["Action", "RPG"], "publishers": ["Nintendo"], "esrb_rating": null}