{"id": 241841, "slug": "canasta-nr-hd", "name": "Canasta NR HD", "name_original": "Canasta NR HD", "description": "**Play friends anywhere, anytime across the internet!<br/><br/>-The only Canasta game available in the App Store that allows you to play against your friend online. <br/><br/>-UNIVERSAL APP! Designed for the iPhone and the iPad. <br/><br/>No Ads or in-app purchases!<br/><br/>The absolute best Canasta game on the iPhone!   NR-Canasta is the first and only Canasta card game on the iPhone to offer fully integrated multiplayer through Apple Game Center.  Make friends and play people from around the world in one of the most popular card games ever invented. <br/><br/>NR-Canasta offers fully customizable game play!  With over 24 different hand-crafted card tables, three card decks, and 18 card back skins to choose from, you will always be able to keep you gaming experience fresh! <br/><br/>Whether you are playing single player or multiplayer, NR Canastas beautiful animation and rock-solid game play will keep you entertained for hours!<br/><br/>Responding to user demand we added the ability to configure many popular derivations of canasta. The person that starts the game determines the rules! So, be careful to check what rules you are playing when you accept a game! Pressing the i in the game screen will show you the rules of the game you are currently playing. <br/>  -now users can choose if a natural canasta is needed to go out<br/>  -can configure 1 or two canastas needed to go out<br/>  -can disallow wild card canasta<br/>  -can choose 1500 or 2000 points for wild card canasta<br/>  -can choose if player is allowed to pick up the pile using cards already in the meld.<br/><br/>NOTE: Some players had a difficult time figuring out how to pickup the discard pile. To do this place two matching cards from your hand into the meld area and then make sure you have the appropriate number of points in your meld area to meet minimum meld, then, and only then can you move the top discard card to the meld pile that matches it. The two matching cards must come from your hand, not from cards already in your meld from previous turns. <br/><br/>If you require any assistance please send email to nerdicusrex@gmail.com and we will be happy to help. Also, find us on our Facebook site at https://www.facebook.com/NrCanasta <br/><br/>Canasta is one of the most popular games ever invented.  It is an exciting mix of strategy, luck and skill. If you like solitaire, hearts, euchre or poker, you will love NR Canasta!  Hundreds of international variations of the game exist which is a testament to its worldwide popularity. <br/><br/>NR Canasta follows traditional North American style canasta rules as a default but allows players to configure the rule set in order to adjust to the many adaptations of canasta throughout the world. The list of customizations grows as we get feedback from our players.<br/><br/>**PLEASE KEEP YOUR SUGGESTIONS COMING AND WE WILL CONTINUE TO ADD OPTIONS IN THE RULES TOOLBOX AS I HEAR ABOUT THEM FROM YOU! All players in a game must be updated to the current version of the game! Players cannot custom configure rules when playing the AI yet. This is a result of needed to augment the API to allow rules to pass between players.", "metacritic": null, "released": "2012-11-19", "tba": false, "updated": "2019-10-22T14:14:09", "background_image": "https://media.rawg.io/media/screenshots/c0b/c0b17eb0824241d0673e23c7f8d29d0c.jpg", "website": "https://www.facebook.com/NrCanasta", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 65, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Nerdicus Rex"], "genres": ["Card"], "publishers": ["BREWSTER & LAVIERS PARTNERSHIP"], "esrb_rating": "Everyone 10+"}