{"id": 241913, "slug": "immortal-fury-temple-of-the-gods", "name": "Immortal Fury - Temple of the Gods", "name_original": "Immortal Fury - Temple of the Gods", "description": "Are you ready to show your full power as an Immortal? Squash, Throw and use your IMMORTAL POWERS to destroy all who try to demolish your temple! <br/><br/>Throw enemy soldiers across the screen with ruthless force. Squash your enemies like a true Immortal god. Use your Immortal Powers to BURN, FLOOD and LIGHTNING STRIKE enemy soldiers to collect their SOULS! <br/><br/>DESTROY YOUR WAY TO UNLOCK ALL THE POWER UPS <br/><br/>FEATURES ++ <br/><br/>Single Player &amp; Multiplayer modes, plus Game Center! <br/><br/>Three Immortal God modes: Zeus, Hades and Poseidon! <br/><br/>--Zeus – God of Lightning - Take control Zeus and use your LIGHTNING powers to destroy the enemies that dare attack your temples! Use special powers such as lightning strikes and electricity storms to turn your enemies to dust! <br/><br/>-- Hades – God of the Underworld – Enemy soldiers have invaded Hell and are attacking your temple. Take control of Hades and crush your enemies with boulders and FIRE BALLS! Show no mercy as you upgrade your abilities and unleash walls of fire from the pits of the underworld! <br/><br/>-- Poseidon – God of Water - An army has begun attacking your coastal temple. Call forth the wrath of the ocean as you smash your enemies with water blasts, your godly trident and TIDAL WAVES. Smite the attacking army and show them the power of Poseidon --- <br/><br/>Awesome power ups including: <br/>* Zeus – Destroyer of Lights Power Up <br/>* Hades – Wall of Fire <br/>* Poseidon – Wave of Death <br/>* Temple restore – Restore your temple before the soldiers destroy it.", "metacritic": null, "released": "2013-09-29", "tba": false, "updated": "2019-10-22T14:14:10", "background_image": "https://media.rawg.io/media/screenshots/90a/90a3b635899e47f0aaabebe2ac3d2b29.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 207, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["M&M App Services"], "genres": ["RPG", "Strategy"], "publishers": ["M&M App Services"], "esrb_rating": null}