{"id": 242090, "slug": "the-dark-eye-chains-of-satinav-2", "name": "The Dark Eye – Chains of Satinav", "name_original": "The Dark Eye – Chains of Satinav", "description": "Face your Destiny!<br/><br/>In Andergast, whose inhabitants are considered to be notoriously superstitious, King Efferdan awaits a state visit from high-ranking dignitaries. For centuries the kingdom has been at odds with neighboring Nostria, but now first steps are being undertaken toward a lasting peace. But a plague of crows troubles the king, for the birds are acting with unusual aggressiveness, even attacking humans. Moreover, there are those among the citizens of Andergast who swear that the crows are bringing them dark nightmares. As the belligerent creatures infiltrate even the castle itself, the king seeks a skilled bird catcher - an opportunity for young Geron to prove that the reputation for ill luck that has followed him since childhood is undeserved. Following an audience with the king, the prestigious task is assigned to him. However, not only does his task prove unexpectedly difficult, but it also turns out to be the first step of the greatest adventure of his life, which will lead him to the borders of the charted lands of Aventuria and beyond.<br/><br/>With a history of more than 25 years, The Dark Eye is one of Europe's best-known role-playing brands. In addition to the popular pen &amp; paper adventures, TDE has also inspired a series of successful computer games. The Dark Eye: Chains of Satinav immerses players deep in the world of Aventuria, where they experience an amazing story and explore lands never before featured in a TDE computer game.<br/><br/>Key Features:<br/>- An epic fantasy soundtrack, as well as high-quality voiceovers to provide an unparalleled gaming experience.<br/>- Dive into the fantastic world of Aventuria and experience an epic adventure, written by experienced authors of the popular pen and paper fantasy role-playing game The Dark Eye.<br/>- From the makers of \"A New Beginning\" and \"The Whispered World\".", "metacritic": null, "released": "2013-04-10", "tba": false, "updated": "2019-10-22T14:14:17", "background_image": "https://media.rawg.io/media/screenshots/9b8/9b89ca2835ac9ed574c611c3f778a5fc.jpg", "website": "http://www.daedalic.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 3, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 411, "game_series_count": 0, "reviews_count": 1, "platforms": ["macOS"], "developers": ["Daedalic Entertainment"], "genres": ["Adventure", "RPG"], "publishers": ["Daedalic Entertainment"], "esrb_rating": null}