{"id": 242094, "slug": "valhalla-hills-two-horned-helmet-edition", "name": "Valhalla Hills - Two Horned Helmet Edition", "name_original": "Valhalla Hills - Two Horned Helmet Edition", "description": "You're spending your whole life to please your gods. You're fighting and dying an honorable death. And now this! The poor Vikings are standing in front of Asgard's gates, waiting to enter Valhalla. But the ungrateful Gods won't give them what they deserve, closing the gates right in front of them.<br/>Although, a true Viking never gives up. If it's impossible to enter Valhalla the traditional way, then why not just walk in there? But the usually pretty strong Vikings don't seem to cope well with the danger and challenges of the mountains. Look after your Vikings, gather food, chop wood and take care of the well-being of your small but growing population. Reach the portal on top of the hills, this is the only chance to get your Vikings closer towards their well-earned reward.<br/>As in classical building games, it's essential to increase the productivity of the Vikings by puzzling out an ambitious and balanced economic system in Valhalla Hills.  <br/><br/><br/>Features:<br/><br/>•\tFrom the developers of classics like “The Settlers 2” and the “Cultures”-Series<br/>•\tBe prepared for randomly generated levels with various challenges<br/>•\tLook after your Vikings' needs<br/>•\tImprove constantly, use your knowledge and achievements for the next map<br/>•\tEarn your place in Valhalla, for your Vikings and yourself<br/>•\tIncluding DLCs \"Sand of the Damned\" and \"Fire Mountains\"<br/><br/>Minimum System Requirements:<br/>OS: Mac OS X 10.9.2 <br/>Processor: Dual-core Intel or AMD, 2.5 GHz or faster <br/>Memory: 4 GB RAM <br/>Graphics: NVIDIA GeForce 8800 GT or Radeon HD2900 series card or better (DirectX10 card or better) <br/>Storage: 3 GB available space", "metacritic": null, "released": "2016-07-05", "tba": false, "updated": "2019-10-22T14:14:18", "background_image": "https://media.rawg.io/media/screenshots/930/9300f9b323a9b0a6548a73fb6f7b1b7c.jpg", "website": "http://www.daedalic.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 281, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS"], "developers": ["Daedalic Entertainment"], "genres": ["Strategy", "Simulation"], "publishers": ["Daedalic Entertainment"], "esrb_rating": null}