{"id": 242064, "slug": "digrun-free", "name": "DigRun Free", "name_original": "DigRun Free", "description": "Match-4 Puzzle with new twists and cute characters, and angry, angry blocks!<br/><br/>A new match-4 puzzle game with unique gameplay and fun twists!<br/><br/>==================<br/>THE BLOCKS ARE MAD!<br/>==================<br/>Nut has awakened the blocks from their sleep.<br/>Abused by us gamers for far too long, now they seek to have their revenge!<br/><br/>==============<br/>SAVE YOURSELF!<br/>==============<br/>If it's colored, you can kill it. The same applies to these blocks too.<br/>Stack them together and blow them in pieces, while charging up super powers and using items!<br/><br/>=============<br/>SUPER POWERS<br/>=============<br/>By destroying a big enough number of blocks, you can activate a mighty Superpower that helps you in keeping your destruction going. Each of the six colored blocks give you a different power, so try them out!<br/><br/>====================<br/>CAREER AND UPGRADES<br/>====================<br/>You can upgrade nearly everything in your arsenal.<br/>Nut's Power Fist, the items and the Super Powers - You can upgrade them all, by spending coins gathered from the destroyed blocks. Keep those upgrades coming - otherwise you won't have a single chance on the highest difficulty.<br/><br/>========<br/>IN SHORT:<br/>========<br/>- Nice graphics you wouldn't expect from a puzzle game<br/>- Cute characters that melt your eyes<br/>- Well-balanced casual match-4 puzzle with a unique mechanic you have never seen<br/>- Useful Items and mighty superpowers to your disposal<br/>- Leaderboard and achievements<br/><br/>Facebook: http://fb.com/lanzegames<br/>Website: http://www.afeel.biz", "metacritic": null, "released": "2015-06-29", "tba": false, "updated": "2019-10-22T14:14:16", "background_image": "https://media.rawg.io/media/screenshots/3dd/3ddd988c23d4a1d6310f4538585e7f18.jpg", "website": "http://www.afeel.biz", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 162, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["AFEEL"], "genres": ["RPG", "Puzzle"], "publishers": ["AFEEL"], "esrb_rating": "Everyone 10+"}