{"id": 242004, "slug": "abc-alphabet-tracing-writing-letters-123-learning", "name": "ABC Alphabet Tracing Writing Letters 123 Learning", "name_original": "ABC Alphabet Tracing Writing Letters 123 Learning", "description": "abcd for kids – learn Alphabet is a FREE educational game for your toddler!<br/>figure out how to draw letters and what words start with this or that one – everything will be in the<br/>form of alphabet games. With the cheers of praise and candy medals, young learner is unlikely to get<br/>bored.<br/><br/>For moms and dads it is the best way to help their kids learn the letters, while for kids it is a new<br/>playground instilled with entertainment and happiness!<br/><br/>Features:<br/>- a colorful early education app that helps children learn the English alphabet.<br/>- Smart interface helps kids focus on phonics and letters without accidentally exiting the game.<br/>- Step-by-step learning process. The child can play with a new letter only after he learned the<br/>- Complete alphabets.<br/>- Professional voiceover in a clear voice with perfect pronunciation of vowel and consonant sounds.<br/>- Such games help your toddler learn the alphabet quick and with no effort!<br/>- 3 in 1 (ABC,abc,123)<br/><br/>The game is full of bright colors and amusing virtual toys for education of children of preschool or<br/>kindergarten age. Grandmother, mom, dad, sister – everyone can be your toddler’s playmate in<br/>obtaining the basic skills of reading and drawing, in finding out how to write letters and pronounce<br/>vowels, consonants and syllables. Studying abc with mother or father have never been such a joy!", "metacritic": null, "released": "2017-01-04", "tba": false, "updated": "2019-10-22T14:14:09", "background_image": "https://media.rawg.io/media/screenshots/3f0/3f0ef7503eed5387417275cd8f05276d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 60, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Siriya Sappianlert"], "genres": ["Board Games"], "publishers": ["Siriya Sappianlert"], "esrb_rating": "Everyone 10+"}