{"id": 242018, "slug": "happy-restaurant-cooking-deluxe", "name": "Happy Restaurant Cooking Deluxe", "name_original": "Happy Restaurant Cooking Deluxe", "description": "Happy Restaurant Cooking Deluxe<br/><br/>Enjoy with the restaurant game of the year.<br/>You love cooking? Then cook delicious meals and desserts for your customers in this cooking game which is an addictive and time-management game!<br/><br/>The best chef in town who can cook delicious meals for their cafe customer and rollover all other burger games or pizza games with this restaurant mania.<br/><br/>Features:<br/>- Simple yet fun to play<br/>- lots of dishes to cook using multiple ingredients<br/>- unique locations to cook Fast-Food, Chinese, Pizza, burger, coffee, Ice Cream Shop and a lot more.<br/>- Multitask between serving, grilling and stacking<br/>- More than 40 dishes to cook using hundreds ingredients<br/>- Stunning graphics and authentic sound effects<br/>- pass hours and hours making burgers for different customers!<br/>- Easy to pick up and play type of game play but hard to Master!!<br/>- Perfect for house wives, babies, kids and even chefs!!<br/>- busy restaurants need fast kitchen hands!!<br/><br/>In Fast Food Bakery Shop you can serve your customers the richest burgers, hot dogs, sandwiches, chips and any drink they want.<br/>Also, at times, you must work at the kitchen and make the burgers as each client likes.<br/>As a cook and waitress, you need to be very skilled in all your restaurants around the world.<br/>Show us your Fast Food is fun in this game of serving and cooking.<br/>Good Luck !!!", "metacritic": null, "released": "2015-09-02", "tba": false, "updated": "2019-10-22T14:14:14", "background_image": "https://media.rawg.io/media/screenshots/15a/15a938a512bc30a88dd2b007012134a9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 39, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Siriya Sappianlert"], "genres": ["Simulation", "Family"], "publishers": ["Siriya Sappianlert"], "esrb_rating": "Everyone 10+"}