{"id": 242091, "slug": "night-of-the-rabbit", "name": "Night of the Rabbit", "name_original": "Night of the Rabbit", "description": "Languages: English, German, French, Spanish, Russian, Czech, Polish, Portuguese<br/><br/>Lose yourself in a tale of magic and wonder, where anything is possible and where nothing is quite as it seems: join young Jerry and follow a peculiar white rabbit to the wondrous realm of Mousewood, a land where critters can speak and where mystery abounds. <br/><br/>It is here that Jerry’s dream of being a magician comes true, though a haunting, sinister force casts a long shadow over the forest. Someone offers the residents of Mousewood a deal of their lifetime - tickets to the greatest magic show that the world has ever seen. But the price is steep, as they'll have to stake their most precious possessions and also their lives. <br/><br/>As the shadows grow deeper, the residents of Mousewood have only Jerry to turn to. On an adventure full of laughter and tears, joy and fear, the young boy will face the ultimate trial, leaving behind the world he once knew, and his childhood, too, will become a thing of the past.<br/><br/><br/>KEY FEATURES:<br/>Story-driven exploration/adventure: The Night of the Rabbit was conceived, written and designed by Matthias Kempke, who believes that games design is all about creating new worlds to be explored by players.<br/><br/>Multi-layered story: it starts out in a light-hearted and funny way, but soon shift to a dramatic and thought-provoking tone over the 20 hours of gameplay.<br/><br/>Original character and world design: the animal people who populate the game were originally developed in short stories written by game creator; these stories are included as the in-game bonuses.", "metacritic": null, "released": "2013-06-03", "tba": false, "updated": "2019-10-22T14:14:17", "background_image": "https://media.rawg.io/media/screenshots/97a/97ae3afd95fffb6615405f5260863d17.jpg", "website": "http://www.daedalic.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 4, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 419, "game_series_count": 0, "reviews_count": 1, "platforms": ["macOS"], "developers": ["Daedalic Entertainment"], "genres": ["Adventure", "RPG"], "publishers": ["Daedalic Entertainment"], "esrb_rating": null}