{"id": 242171, "slug": "extreme-biking-3d-pro-street-biker-driving-stunts", "name": "Extreme Biking 3D Pro Street Biker Driving Stunts", "name_original": "Extreme Biking 3D Pro Street Biker Driving Stunts", "description": "Extreme Biker 3D is an addictive motorcycle bike racing game with bounty collection points makes to uplift your sporting spirits - higher level of gear.<br/><br/>Have you ever thought of high speed biking in big cities without getting tickets? Now you can - with this extreme biking! <br/><br/>As you cross certain game thresholds, bike speed gear moves to next level automatically to get more thrill. Try, not to hit moving objects while collecting bounties either same or opposite side of the road. Learn to focus and maneuver or steer the bike using motion or button controls. More you collect, more to brag about it in game center with others. <br/><br/>Don't miss this wonderful 3D extreme biking game with modern cityscape track and various biker natural animations.  Also try to find out hidden or surprise random animations during game play. Also with new version,  added new cool bridge track to extend the play. Total thrill.<br/><br/>Customize the game with motion or button control, own music playlist and choice of biker. Also various sound and motion sensitivity levels to choose your needs. <br/><br/>What are you waiting for ? Thrill never stops! Ready, Set, Go.!<br/><br/>Please Note: Game 3D graphics performs well on 4G, iPad devices with latest iOS compared to older devices. We recommend latest devices and iOS.", "metacritic": null, "released": "2012-11-01", "tba": false, "updated": "2019-07-30T12:16:34", "background_image": "https://media.rawg.io/media/screenshots/f40/f40e271a5a92e579233fd9b181e1afff.jpg", "website": "http://www.sulaba.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 205, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Sulaba"], "genres": ["Simulation", "Racing"], "publishers": ["sulaba"], "esrb_rating": null}