{"id": 242175, "slug": "race-gear-feel-3d-car-racing-fun-drive-safe", "name": "Race Gear-Feel 3D Car Racing Fun & Drive Safe", "name_original": "Race Gear-Feel 3D Car Racing Fun & Drive Safe", "description": "--- Special promotional price offer ---<br/>--- Feel your brain in high gear ----- <br/><br/>Race Gear-Feel 3d Car Racing is a 3D car racing game that puts you in the driver's seat to learn how to drive and race a car.<br/><br/>Thrilling, but also educational, this is a high voltage racing car game and fun learning tool for both kids and teenagers. Breaking, turning, learning optimal speed while avoiding sliding and spinning, or sharp, wide, or blind turning, learn the physics of driving and staying safe behind the wheel.<br/><br/>Features include the camera button that allows you to change the inside and outside views while driving, car color selector, sound and music controls, accelerator, steering, breaking, and reverse throttle controls to give you full control of your driving and racing experience.<br/><br/>With beautiful scenic mountain terrain, curved and divided roads, bridges, and tunnel, you're sure to want to take this baby for a spin and a half.<br/><br/>Key Features:<br/>-------------<br/>* Get the scoop of driving-both inside and outside perspective of car view. Camera Key (C or c) toggles dynamically to change the inside and outside of the car views while driving. More realistic.<br/><br/>* Switch between day &amp; night mode by pressing Ctrl and M keys during play. Awesome view with headlights on. Enjoy dual lighting!<br/><br/>* Artificial Intelligence (AI) for direction warning – If you are driving in wrong direction, it will alert with warning message<br/><br/>* Choose the car color (Red, Black, Blue, Yellow, Pink etc)<br/><br/>* Timer Mode: Complete the lap in less than the Best time to win<br/><br/>* Countdown Mode: Complete the lap before the countdown over<br/><br/>* Drifting Mode<br/>    - Speed up the car (Upward Arrow Key)<br/>    - Turn steering wheel to left or right abruptly (Right or Left Arrow Key)<br/>    - When the steering wheel is turned completely left or right, press and hold the break button (Space Bar)<br/>    - How much you will drift depends on how fast you were going<br/><br/>* Sound Controls:<br/>    - Music: Adjust the slider to set the music volume<br/>    - Sfx: Adjust the slider to set the sfx/engine volume.<br/><br/>* Acceleration &amp; Reverse Throttle use 'Up' &amp; 'Down' arrow keys<br/><br/>* Steering wheel rotation to maneuver the car using 'Right' &amp; 'Left' arrow keys<br/><br/>* Brakes- Press 'Space Bar' key to apply breaks. You may see realistic tire road marks after braking. That depends on speed/drift.<br/><br/>* Pause the game anytime by pressing 'P' or 'Esc' keys and select various sound and control options.<br/><br/>* Standard joystick controls mapped to keyboard play keys offered by the game should work.", "metacritic": null, "released": "2011-06-09", "tba": false, "updated": "2019-07-30T12:16:56", "background_image": "https://media.rawg.io/media/screenshots/db0/db00c7d499df992a72404a402952795f.jpg", "website": "http://www.sulaba.com/ipad/42-race-gear-app", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 133, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS"], "developers": ["Sulaba"], "genres": ["Simulation", "Sports", "Racing"], "publishers": ["sulaba"], "esrb_rating": null}