{"id": 242160, "slug": "skateboarding-3d-free-top-skater-action-board-game", "name": "Skateboarding 3D Free Top Skater Action Board Game", "name_original": "Skateboarding 3D Free Top Skater Action Board Game", "description": "Skateboarding 3D Skateboard Free is a perfect entertainer game for all ages to have an unlimited fun to do simple to complex tricks in all kinds of skating objects and terrains. Roam the mega city skyscraper streets with your long skateboard and exhibit skating skills in riverside skate park. Not satisfied, need more? Try fast pedaling in regular and beautiful pro skate park arena with water fountain and tunnel where number skating objects is inviting you perform do or die tricks &amp; stunts.<br/><br/>Don't miss the egg plant mount and wooden and concrete slabs blocks for funny tricks.<br/>You can associate yourself with one of the four 3d animated skaters to collect various gifts like googles, cap, t-shirt, skateboards, shoes and coins within limited time window frame based on your level selection.<br/><br/>Amazing four different theme park area with perfect mobile skater animations like pedaling, jump, ollie &amp; flips etc. Three different teen boys and one girl to choose from, with an option of playing it with motion sensor or easy touch joystick or old style D-pad controls. You don't want to miss the opportunity of playing in high quality 3D skate park arena and mega city park models with 3D animated skaters. Collect as many gifts and brag to others about your achievements. Learn to control the skater with your touch, eye and motion controls to win as many gifts as you can.<br/><br/>Fun starts here and never stops with superb background music blended with wheels, decks and landing gear makes it own grinding noise.<br/><br/>Start practice session, switch gear to intermediate and become pro.<br/><br/>To treat yourself, early holiday gifts is on its way. So now, new and fresh cool skateboarding 3D game in your pocket. Play it any time and any where. Enjoy.<br/><br/>So why wait ? Download it now..! It's free.<br/><br/><br/>Key Features:<br/><br/>* Various theme park settings<br/>* Choice your favorite skater (Girl model is also included)<br/>* Practice session, Intermediate and Pro<br/>* Collect gift items like Skateboards, Cap, Googles, T-Shirt, Shoes &amp; Coins<br/>* Very big megacity model to roam around with your skateboard - Awesome river view &amp; bridges and skyscrapers.<br/>* Top quality skate park arena with lot of skate park object to do tricks or stunts including water fountain &amp; tunnel and wood block skating arcade area.<br/>* Play mode to control skaters - Motion sensor with sensitivity adjustment, Easy touch Joystick controls or old style D-Pad.<br/>* Rocking skating background music or you can optionally turn it off.<br/>* Racing against the time to pickup as many gift points and collectibles.<br/>* Perfect mobile game with fast skate free roaming to do tricks or stunts adventure.<br/>* For iOS users, option to pick up your own device music library playlist also available<br/><br/>*** Important Note ****<br/><br/>Skateboarding 3D game works perfectly in in high end dual core processors or above devices as it needs/demand more CPU power to deliver the rendering performance. <br/><br/>*** Try the full version to unlock all features ***", "metacritic": null, "released": "2013-06-19", "tba": false, "updated": "2019-07-30T12:14:58", "background_image": "https://media.rawg.io/media/screenshots/19c/19cb5b612add3febacbb3a91c61ebef3.jpg", "website": "http://www.sulaba.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 183, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Sulaba"], "genres": ["Sports"], "publishers": ["sulaba"], "esrb_rating": null}