{"id": 242197, "slug": "race-n-chase-3d-extreme-car-speed-racing-thrill", "name": "Race N Chase 3D Extreme Car Speed Racing Thrill", "name_original": "Race N Chase 3D Extreme Car Speed Racing Thrill", "description": "Race N Chase 3D is one of the best racing game in a beautiful immersive racing track challenging AI cars. Addictive racing gameplay. You can choose it play in night or day mode with head lights on. Drag it or drift to see road markers. Push the gas pedal to throttle high speed chase thrill with intuitive tilt or motion controls using apple tv remote or Joy stick game pad. <br/><br/>It does not contain violence nor any other mature content. It does not need internet connection so that you can play in car, truck, van, all wheel drive suv etc on  road travel or as train subway surfers or while flying on a (real) plane  It's just a simple and straightforward 3D car racing game for hot auto racers. Feel free to play it with your boys and children. Train on single player to improve your skills. We bet you will love car racing fun game.<br/><br/>To become a master auto car race driver, start practicing right now to become a pro car drag racer with timer and countdown mode and rule them and challenge AI Cars for every level win. It will be fun and addicting with multiple lap levels with choice of car color. <br/><br/>Race along with other artificial intelligence (AI) cars for the desired number of laps assisted with back camera view mirror and win! Race N Chase 3D is one of the best car racing games with drag and drifting.<br/><br/>Key features;<br/><br/>Beautiful 3D graphics of unique race track &amp; cars<br/>Challenge AI opponents<br/>Drizzling rain or day mode<br/>Turn into night racing with lights on or off<br/>Custom choice of Steering, Stick, or Motion tilting control for wheel and throttle <br/>Picture-in-Picture(PIP) 2D overview track map<br/>Continuous feed - car back camera view mirror<br/>Choose from 3 fun game modes Race &amp; Chase, Countdown &amp; Timer<br/>Six diff.camera views including front facing car view (Inside/Outside &amp; Sky views)<br/>Collision fire sparks<br/>Choice of race car color<br/>Unique and absorbing music tracks plus SFX/sound controls<br/>Amazingly small footprint of binary size for a quality 3D racing game.<br/>Play with new apple tv device remote or game controller pad - tilt,motion,throttle,accelerometer etc<br/><br/>Choose from three different game modes: Race-n-Chase with AI cars, Countdown, and Timer mode with custom choice of Steering, Stick, or Motion control for wheel and throttle. You can optionally turn off engine (SFX) or music sound.<br/><br/>Chill out your racing experience with an option to turn on rain shower and lights.  Enjoy the rally action packed ride!", "metacritic": null, "released": "2016-10-29", "tba": false, "updated": "2019-07-30T12:21:06", "background_image": null, "website": "http://www.sulaba.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Sulaba"], "genres": ["Simulation", "Sports", "Racing"], "publishers": ["sulaba"], "esrb_rating": null}