{"id": 242167, "slug": "race-rally-3d-chasing-fast-ai-cars-racer-game", "name": "Race Rally 3D Chasing Fast AI Car's Racer Game", "name_original": "Race Rally 3D Chasing Fast AI Car's Racer Game", "description": "The Race Rally is the best extreme 3d cars racing arcade game features day or night rainy mode with lights on or off and six different camera views. Never lose the spirit in a beautiful road race track and countdown the clock to race!<br/><br/>Watch how cars are drifting and leave the marks on the lane or road ride. Race driving is fun with every lap win during speed chasing, try not to hit the walls unless like to see the fire sparks. Finish the circuit speedway before the countdown. Like to do race in rain or night mode, go for it. Various combinations of controls - accelerometer motion, touch steering wheel &amp; throttle and stick.<br/><br/>Key features;<br/>* Beautiful 3D graphics of unique race track &amp; cars<br/>* Challenge the countdown race<br/>* Drizzling rain or day mode<br/>* Turn into night racing with lights on or off<br/>* Custom choice of Steering, Stick, or Motion control for wheel and throttle<br/>* Picture-in-Picture(PIP) 2D overview track map<br/>* Continuous feed - car back camera view mirror<br/>* 6 diff.camera views including front facing car view (Inside/Outside &amp; Sky views)<br/>* Collision fire sparks<br/>* Unique and absorbing music tracks plus SFX/sound controls<br/>* Amazingly small footprint of binary size for a quality 3D racing game.<br/><br/>Best 3D Cars Racing Rider Free Games! Car Racer now it's time to drive for Race Win !!<br/><br/>Popular car real driver racing game app for all ages including kids, boys and girls who likes outdoor popular sports simulated in a best way.<br/><br/>Throttle your speed need and become formula1 or f1 style racer to win.<br/><br/>Enjoy the rally action packed cars drag ride!", "metacritic": null, "released": "2014-04-29", "tba": false, "updated": "2019-07-30T12:15:55", "background_image": "https://media.rawg.io/media/screenshots/35d/35dfd1c723eea52b57e6bd775ebd1b40.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 212, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Sulaba"], "genres": ["Simulation", "Sports", "Racing"], "publishers": ["sulaba"], "esrb_rating": null}