{"id": 242187, "slug": "circuit-racer2-race-and-chase-best-3d-buggy-car-ra", "name": "Circuit Racer2 - Race and Chase - Best 3D Buggy Car Racing Game", "name_original": "Circuit Racer2 - Race and Chase - Best 3D Buggy Car Racing Game", "description": "Circuit Racer2 - 'High Adrenaline Rush'  Great racing experience! <br/><br/>Now with new Circuit Racer 2,  you can race with other buggies for desired laps. Don't miss the action with beautiful unique race track - rain or clear sky mode and 6 different camera views of buggy racing. <br/><br/>You can play in 3 different modes - Race-n-Chase with AI buggies, Countdown and Timer mode with custom choice of Steering, Stick or Motion control for wheel &amp; throttle.  Also, you can watch the racing track in Picture-in-Picture (PIP) 2D map window. You can optionally turn off engine (SFX) or music sound. <br/><br/>Features include the camera button that allows you to change the inside and outside views including sky view and four more views while driving, car color selector, sound and music controls, accelerator, steering, breaking, and reverse throttle controls to give you full control of your driving and racing experience. <br/><br/>With beautiful race track, curved and divided roads, and tunnel bridge, you're sure to want to take this baby for a spin and a half along with other buggies.<br/><br/>Key features<br/><br/>✓ High voltage adrenaline rush in Race and Chase mode with other AI opponent buggies <br/>✓ Choose sunny or drizzling scenic rainy day dynamically during game play<br/>✓ 6 different inside and outside car camera views so that you can learn the effects of your actions on the road from both, a driver’s and an observer’s perspective.<br/>✓ 6 different car colors to choose<br/>✓ 3 modes of play - Race &amp; Chase with AI's, Timer &amp; Countdown<br/>✓ Timer &amp; Countdown mode to practice &amp; improve racing speed with less time to complete the lap on various sharp turns and curves of a beautiful race track.<br/>✓ Various wheel and throttle control options - steering, stick, motion(accelerator) or combination of any<br/>✓ Picture-in-Picture (PIP) 2D map window of race track during game play<br/>✓ Uplifting music for theme, countdown and timer mode <br/>✓ Watch your speed in digital way<br/>✓ Addictive game play<br/><br/>Please visit us at www.sulaba.com for following interesting gaming titles and other mindful apps for all ages!<br/><br/>✓ Race Gear 3D<br/>✓ Block Smasher 3D<br/>✓ Ring Toss 3D<br/>✓ Circuit Racer 3D<br/>✓ Eagle Quest<br/>✓ Egg Splash<br/>✓ Memory Puzzle<br/>✓ Word Teaser<br/>✓ Word Teaser Pro", "metacritic": null, "released": "2011-12-07", "tba": false, "updated": "2019-07-30T12:18:27", "background_image": "https://media.rawg.io/media/screenshots/93a/93ad3218e6b38fd9a830ee6e622bce56.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 176, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS"], "developers": ["Sulaba"], "genres": ["Action", "Racing"], "publishers": ["sulaba"], "esrb_rating": null}