{"id": 242180, "slug": "street-circuit-racing-3d-extreme-speed-racer-game", "name": "Street Circuit Racing 3D Extreme Speed Racer Game", "name_original": "Street Circuit Racing 3D Extreme Speed Racer Game", "description": "The Street Circuit Racing is the best 3d arcade city speed racing game features wonderful realistic metropolitan city with day or night mode and six different camera views. Race along with other artificial intelligence (AI) cars for the desired number of laps assisted with back camera view mirror and win!<br/><br/>Key features;<br/>Beautiful 3D graphics of modern city roads,bridges &amp; riverbed.<br/>Challenge AI opponents<br/>choose between 2 different unique car models and 6 different colors for each.<br/>Switch between day &amp; night mode during game play<br/>Custom choice of Steering, Stick, or Motion control for wheel and throttle<br/>Picture-in-Picture(PIP) 2D overview track map<br/>Continuous feed - car back camera view mirror<br/>Choose from 3 fun game modes Race &amp; Chase, Countdown &amp; Timer<br/>6 diff.camera views including front facing car view (Inside/Outside &amp; Sky views)<br/>Collision fire sparks<br/>Unique and absorbing music tracks plus SFX/sound controls<br/><br/><br/>Choose from three different game modes: Race-n-Chase with AI cars, Countdown, and Timer mode with custom choice of Steering, Stick, or Motion control for wheel and throttle. You can optionally turn off engine (SFX) or music sound.<br/><br/>Chill out your racing experience with an option to turn on rain shower and lights. Enjoy the city rally action packed ride!", "metacritic": null, "released": "2013-03-05", "tba": false, "updated": "2019-07-30T12:17:37", "background_image": "https://media.rawg.io/media/screenshots/580/580c0548d2f61a2638baae63a3f6d761.jpg", "website": "http://www.sulaba.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 147, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Sulaba"], "genres": ["Racing", "Arcade", "Casual"], "publishers": ["sulaba"], "esrb_rating": null}