{"id": 242220, "slug": "fight-in-streets-gang-wars-3d", "name": "Fight in Streets -Gang Wars 3D", "name_original": "Fight in Streets -Gang Wars 3D", "description": "An arcade fighting game that gives you powerful gameplay. Be the king of streets fighting. Start participating in aggressive street fights of gang wars. Every minute of this game is full on action. Fight on the street! Face varies of enemies! Defeat them and take all their territories!<br/><br/>The true heroes are born in the street fighting, feel the power and strength in your hands, wielding a real fighting machine. Punch, kick, and block your enemies before they kill you. Fight with a strategy with the opponent gang revolt. Equip yourself with a knife, pistol, or baseball bats that can be found by destroying the boxes and drums on the streets. The battle between your champion and other gangs have just begun. <br/><br/>Come swing your fists in this all-immersive mobile arcade game. This is the war of champions with gangs. Defeat all your enemies in street fights. Only the most skilled champion will survive. If you have played other street fighting games, classic arcade games, or you like Cadillac and dinosaurs, we recommend you to play this action adventure.<br/><br/>Main features of ‘Fight in Streets – Gang Wars Arcade Fighting’<br/><br/>- 2 playable characters<br/>- Kick and Punch Combos<br/>- Jump Kick Attack<br/>- Ground Punch and Kick attack<br/>- 3 Weapon Pick-ups<br/>- Destroyable objects<br/>- 4 Environments<br/><br/>We hope you like it, your feedback is appreciated.", "metacritic": null, "released": "2017-12-20", "tba": false, "updated": "2019-10-22T14:14:21", "background_image": "https://media.rawg.io/media/screenshots/56a/56acb059176ed792b73e564e2da588f7_J56CFhF.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 175, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["MOBILECREED"], "genres": ["Action", "Arcade"], "publishers": ["MobileCreed"], "esrb_rating": "Everyone 10+"}