{"id": 242263, "slug": "gunner-contract-the-killer-gangster-war", "name": "Gunner Contract the Killer Gangster war", "name_original": "Gunner Contract the Killer Gangster war", "description": "Gunner Contract the Killer Gangster war<br/><br/>A open world game filled with lot of actions.<br/>This Game is FPS (First Person Shooting) game.<br/><br/>This Game is play to the Shoot Killer and Clear The mission.<br/>The Mission Include to unloak a other weapons,or other guns. <br/><br/>Want to build a Criminal Empire and crush your rivals? Get ready to show everyone who’s boss by fighting in open world real action game. Rule the streets in this game.<br/>In this game you are a real city gangster - hero, who is not afraid of anything. Savage, aggressive criminals are everywhere. <br/>This Game is about Grand thief. Lots of mission &amp; activities of thief in this game like .....<br/>Start out as a small time gangster doing illegal job missions for the San Andreas Street Crime Auto. <br/>No more small time mafia stuff but become the boss of all bosses in this EPIC crime simulator game.<br/>Drive sports cars with fast speed engine and drift. It's time to show everyone who’s boss by shooting rivals and ruling the streets.<br/>This is one kind of Underworld Terrorist Survivor Game.If you are looking for Fighting Games &amp; shooting games we have that kind of play zone collection of 3D Game. <br/><br/>Perfect balance of strategy and fast-paced action.<br/><br/>Key Features:-<br/><br/>- Effective weapons<br/>- amazing 3D graphics<br/>- Smooth and Realistic controls<br/>- Best shooting game", "metacritic": null, "released": "2016-09-07", "tba": false, "updated": "2019-10-22T14:14:24", "background_image": "https://media.rawg.io/media/screenshots/805/8050b91ea15507b5edfc2acb6ae00433.jpg", "website": "https://www.facebook.com/pages/Fatima-Raheman/1529563297321307", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 134, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["fatima raheman"], "genres": ["Action", "Simulation"], "publishers": ["fatima raheman"], "esrb_rating": "Mature"}