{"id": 2422, "slug": "homefront-the-revolution", "name": "Homefront: The Revolution", "name_original": "Homefront: The Revolution", "description": "<p>Homefront: The Revolution is an open-world FPS developed by Dambuster Studios. It is the second game in the series.</p>\n<h3>Plot</h3>\n<p>In 1972, a technological marvel emerged in North Korea. The APEX corporation was found. Sometime later, the North Korean technologies become more widespread than the US. In 2004 the United States began to buy its weaponry from Korea. By 2016 the United States economy is at an all-time low, the US invade the Middle East. In 2025, the US debt to North Korea grows too immense to be paid out, and the economy crumbles. While being helpful at first, North Korea&#39;s military set foot on the American soil. You become a part of the resistance based in Philadelphia in 2029 trying to set the city free from Korean People&#39;s Army.</p>\n<h3>Gameplay</h3>\n<p>The players have to use the insurgency strategies in order to free the city of Philadelphia from the KPA. A wide set of explosives, jammers, and traps is available to the player. It is possible to modify the weapons the player has on the go. Attach suppressors, scopes or convert your weapon entirely as you see fit. </p>\n<p>Philadelphia is split into three zones: the Green Zone where the KPA and their collaborators live in comfort with stable electricity supply and clean drinking water; the Yellow Zone which serves as a ghetto for most of the Philadelphia residents; the Red Zone which mostly consists of bombed-out suburbs of Philly. </p>\n<p>A four-player co-op mode is present in the game and is separated from the main campaign.</p>", "metacritic": 54, "released": "2016-05-17", "tba": false, "updated": "2024-04-09T01:13:46", "background_image": "https://media.rawg.io/media/games/6eb/6eb5ed3b286510c6dab3f15e3a975529.jpg", "website": "http://www.homefront-game.com/", "rating": 3.0, "rating_top": 3, "added_by_status": {"yet": 97, "owned": 1562, "beaten": 163, "toplay": 63, "dropped": 130, "playing": 16}, "playtime": 9, "achievements_count": 301, "ratings_count": 335, "suggestions_count": 668, "game_series_count": 3, "reviews_count": 337, "platforms": ["Xbox One", "PC", "PlayStation 4"], "developers": ["Deep Silver", "Dambuster Studios"], "genres": ["Action", "Shooter", "Adventure"], "publishers": ["Deep Silver"], "esrb_rating": "Mature"}