{"id": 24238, "slug": "icarly-groovy-foodie", "name": "iCarly: Groovy Foodie!", "name_original": "iCarly: Groovy Foodie!", "description": "<p>\n      iCarly: Groovy Foodie! is a riveting action puzzle game, based on the \n      wildly popular Nickelodeon television series, iCarly, available \n      exclusively for the Nintendo DS™. In iCarly: Groovy Foodie!, Carly and \n      Sam get into mischief at a local hot dog stand and could face time in \n      juvie, unless they complete community service by feeding the citizens of \n      Seattle! Play as the duo and help them out of trouble by serving wacky \n      dishes to crazy customers in a fast-paced, action puzzle game that \n      dishes out all the random hilarity from the show!\n    </p><p>\n      Game Features:\n    </p><p>\n      • Prepare endless dishes and serve them to quirky customers before time \n      runs out!<br/>• Interact with the entire iCarly cast and earn special \n      upgrades to have Sam trigger “Random Dancing”, see Gibby charge \n      shirtless into lines of customers and more!<br/>• “Battle” 20 types of \n      crazy hungry customers including costumed web mascots, troublesome goop \n      throwing students, and intimidating prisoners from King County Prison!<br/>• \n      Serve more than 20 imaginative food creations including Spaghetti Tacos, \n      Doughnuts on a Stick, and Fudge Balls!<br/>• Match wits with characters \n      like arch nemesis Nevel Papperman, mean teacher Ms. Francine Briggs, \n      Lewbert the nasty doorman and T-Bo as they bring the pressure to serve \n      with extra special panache.<br/>• Enjoy frantic fun in five locations \n      from the iCarly show, including the popular Groovy Smoothie, Webicon, \n      Ridgeway High School, King County Prison and Crown Ridge Mall!<br/>• \n      Explore an abundant variety of dishes to serve in Spencer’s customizable \n      food prep guide and create your menu at the start of each location!<br/>• \n      Utilize Freddie’s customer database to understand the unique preferences \n      of each customer and concoct the perfect strategy to feed the crowd!<br/>• \n      Master your serving skills and earn up to 50 game achievements to unlock \n      bonus content like special abilities, additional dishes, helper \n      utilities and other awesome upgrades from Gibby’s shop!\n    </p>", "metacritic": null, "released": "2012-06-12", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/379/379d21ddd1d341453c038e11b5568a67.jpg", "website": "http://www.d3p.us/ProductDetails.asp?ProductID=162", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 153, "game_series_count": 0, "reviews_count": 0, "platforms": ["Nintendo DS"], "developers": [], "genres": [], "publishers": ["D3 Publisher"], "esrb_rating": null}