{"id": 24237, "slug": "cat-frenzy", "name": "Cat Frenzy", "name_original": "Cat Frenzy", "description": "<p>\n      This adorable and relaxing puzzle introduces totally new twists to the \n      popular slide and match-3 mechanics and, of course, lots of cats. Slide \n      rows or columns of cute, cuddly cats until you create a chain of three \n      or more cats of the same kind to pull them out of the well. The game \n      features a Mission and Quick-play mode with a combined 140 levels and an \n      explanation of all the rules in a quick tutorial. The Mission mode \n      provides new challenging objectives in each level, such as: clear the \n      board with only one slide, pull out all the shining cats, make a six-cat \n      chain reaction. You need to accomplish the objective in order to advance \n      to the next level. The Quick-play mode is all about beating your high \n      score, and there are no restrictions on how to play. Just remember that \n      longer chains can trigger funny bonuses and score you more points. The \n      game will engage you in hours of blasting fun, even if you are not a cat \n      person!\n    </p><p>\n</p><p>\n      Features:\n    </p><p>\n      • ADORABLE CATS <br/>You will find them yawning, moving \n      their eyes about and doing all sorts of lovable things. It is soothing \n      just to look at.<br/>• EASY TO PLAY <br/>Just slide rows or \n      columns of cats to make chains. With a quick tutorial and a hint button, \n      you will never feel lost.<br/>• MAKE YOUR WAY TO THE TOP<br/>Beat \n      your high score, use combos and bonuses to your advantage.<br/>• \n      ABUNDANCE OF PUZZLES <br/>140 levels of absorbing challenges in two \n      modes of game-play.\n    </p>", "metacritic": null, "released": "2012-06-07", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/b3b/b3bfa679cd15e2c4cd6b2cbbe23a99ff.jpg", "website": "http://www.teyon.com/games/cat-frenzy", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 101, "game_series_count": 0, "reviews_count": 0, "platforms": ["Nintendo DS"], "developers": [], "genres": [], "publishers": ["Teyon"], "esrb_rating": null}