{"id": 242316, "slug": "shark-survival-simulator-2k18", "name": "Shark Survival Simulator 2k18", "name_original": "Shark Survival Simulator 2k18", "description": "h no! It’s a shark feeding frenzy ! <br/>In shark survival simulator you will play as a big hungry shark looking for tasty civil scuba divers at the beach, It will gonna look like a civil war for them. Swim under water and attack the scuba divers from underneath. Are you ready for this shark evolution?<br/><br/>Sea Attack games were never this much fun! <br/>Be a hungry shark and attack all the scuba divers in the water. Hunt to survive in this angry shark simulator . Clear levels by completing the objectives, you have to hunt down more scuba divers each level to still your hungry shark. But watch out you only have limited time to hunt down the divers in each level, Be as quick as you can!<br/>Chase your pray, attack and grab it! <br/><br/>Smooth and easy controls will make this game easy to play. Become a vicious blood thirsty beast in our Shark games free to play game. Experience what it's like to swim around angry and rule the sea and attack every living creature what comes into your path, and try it all for free !<br/><br/>Key Features - shark survival simulator :<br/>▶ Addictive Shark simulator game gameplay<br/>▶ Unique realistic 3D sea world<br/>▶ 10 amazing challenging scuba divers hunting levels<br/>▶ Angry Shark games free to play <br/>▶ Stunning and breathtaking HD graphics<br/>▶ Limited time so swim as fast as you can in our amazing angry shark simulator<br/><br/>We hope you will enjoy Hardcore Angry Shark Civil War and don’t forget to rate our mobile games!", "metacritic": null, "released": "2018-05-01", "tba": false, "updated": "2019-10-22T14:14:26", "background_image": "https://media.rawg.io/media/screenshots/9c5/9c5f74e8be26bdd4c1716d7ebfc119f1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 70, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["syed mustafa", "Shoaib Sheikh"], "genres": ["Action", "Simulation"], "publishers": ["syed mustafa", "Shoaib Sheikh"], "esrb_rating": null}