{"id": 242360, "slug": "asylum-night-shift-2", "name": "Asylum Night Shift 2", "name_original": "Asylum Night Shift 2", "description": "Can you survive another five nights at the asylum?<br/><br/>Welcome back to your job as night watchman at the Ravenhurst Mental Asylum.<br/>You have been reassigned to the basement shift... but unfortunately the basement was never designed to hold patients!<br/><br/>From your security office you must keep watch on the asylum patients throughout the night - and make sure that they don't enter your room! Have you got what it takes to survive another five nights at the asylum?<br/><br/>'Asylum Night Shift 2' brings a whole new depth of gameplay to the survival night shift game - including:<br/><br/>* A power generator - keep winding it up throughout the night to prevent the power from failing.<br/>* An interactive map console where you can open and close doors around the asylum. Use the doors to prevent the patients reaching you!<br/>* Patient tracker devices which allow you to monitor the patients movements on your map console.<br/>* Security cameras where you can watch the patients walking around the asylum.<br/>* Benji the guard dog. Benji will warn you if a patient is approaching your room!<br/><br/><br/>Protect yourself from these four new terrifying asylum patients:<br/>The Ripper<br/>The Killer Dwarf<br/>Doctor Death<br/>Sackman<br/><br/>PLUS:<br/>Complete all five nights to unlock 'Night of the Dead', a bonus night with zombies!!!<br/><br/>----------------------------------<br/><br/>DEVICE REQUIREMENTS:<br/>It is recommended that this game is played on a newer phone with at least 512mb of RAM. The game will crash on older devices.<br/><br/>----------------------------------", "metacritic": null, "released": "2015-03-31", "tba": false, "updated": "2019-10-22T14:14:29", "background_image": "https://media.rawg.io/media/screenshots/5d2/5d22c1b74bc38458188c08d703f70f97.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 205, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "iOS"], "developers": ["PHB Media"], "genres": ["Action", "RPG", "Strategy"], "publishers": ["PHB Media"], "esrb_rating": null}