{"id": 242339, "slug": "x-plane-war-wings-sims-pro", "name": "X Plane War Wings Sims Pro", "name_original": "X Plane War Wings Sims Pro", "description": "Flight Simulator is a superior commercial plane simulation especially designed and developed for iTunes.<br/><br/>We here at Game Fever have been developing and working on making the ultimate plane pilot flying simulation experience, improving all areas of the simulator like, the airplane physics, environments, quality assurance, realistic plane cockpits, all for your enjoyment. <br/><br/>Right now, we're excited to get you involved in the fun and play our all new and exciting flight simulator!<br/><br/>Flight Simulator 3D is an awesome new 3D Airplane Simulator game, become the pilot and fly your commercial Airplane to the destination. Guide and steer your plane through all of the way points to ensure you head to the correct destination, go through all of the way points and land at your destination airport within the time limit to earn yourself more pilot stripes. When arriving at your destination zone, slow the plane down and prepare for landing, be careful not to crash! Guide your plane towards the runway and park within the marked zone to complete the level. While parking your plane, be very careful to avoid the buses, helicopters etc parked along the run way.<br/><br/><br/><br/>Airplane Flight Pilot Simulator is a highly advanced simulation developed for iTunes.<br/>Here at Game Fever, we have been studying to perfect the ultimate plane flying simulation, improving the physics for you the player. And finally, we're excited to give you the opportunity to play our brand new and exciting flight simulator!<br/><br/><br/>Get ready for the thrill of experiencing the controlling and flying a commercial airplane aircraft in Flight Simulator!<br/><br/><br/>With realistic aeroplane cockpit controls, you control the plane to fly safely through the air and help get the passengers to their destination on time.<br/>With 50 unique levels (more soon to come), your piloting skills will be tested to the limits. With the elements against you, you'll have to fly through tough situations in order to get to the destination on time in this airplane flying simulation.<br/><br/><br/>The game also simulates weather conditions as well as day and night cycle, with clear sky, tropical rain, thunderstorms, turbulence and more!<br/><br/>Become an Airliner Pilot and experience all the thrills in the exciting, new game, Flight Pilot Simulator!<br/><br/><br/>FEATURES:<br/>- Realistic airplane cockpit environment. All of the necessary controls to make the gaming experience more realistic <br/>- 50 Exclusive, entertaining levels for this game (More levels soon to come!)<br/>- Expansive, detailed open world environment (Including 5 Tropical Islands, Urban City, Residential Area, Farmlands, and Forest)<br/>- High quality buildings and airports <br/>- Accelerometers used to make easy to play tilt controls<br/>- Interact with functional instruments used in real-life airplanes <br/>- Unique reward system for game play<br/>- Dynamic lighting and sounds of a commercial airplane and environment<br/>- Amazing on-board cameras to capture every angle of the plane<br/><br/><br/>Flight Simulator uses real world simulated elements:<br/>- Weather forecast: clear sky, rain, thunderstorms,<br/>- Turbulence<br/>- Day and night cycle<br/>- Plane crashes and smokes effects.<br/><br/>Get yourself the best plane and go HIGHER!<br/><br/>- Ultra REALISTIC 3D graphics and cool animations<br/>- Tons of real-life planes: from single engine props to SUPERSONIC JETS, from airliners to military aircraft<br/>- Fun and challenging missions: emergencies, rescue missions, rough landings, fires, races <br/>- Immersive scenario: explore a huge open map with tons of surprises in amazing flight mode<br/>- Intuitive mobile controls and an ADDICTING game play<br/><br/>If you like  Flight Simulator. please try other games by clicking “More from Developer” or by visiting our publisher account. And don’t forget to rate and review.", "metacritic": null, "released": "2018-06-28", "tba": false, "updated": "2019-10-22T14:14:27", "background_image": "https://media.rawg.io/media/screenshots/434/4346f9e6e201d4b11be19e52b9b19965_O0bXe7R.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 215, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["syed mustafa"], "genres": ["RPG", "Simulation", "Sports"], "publishers": ["syed mustafa"], "esrb_rating": "Everyone 10+"}