{"id": 24239, "slug": "pikmin-2", "name": "Pikmin 2", "name_original": "Pikmin 2", "description": "<p>The second game in the fan-favorite Pikmin franchise originally launched<br />\nfor the Nintendo GameCube console in 2004. Now Wii users can enjoy the<br />\nimaginative fun of this classic and colorful mass action strategy game,<br />\nnow available at a suggested retail price of just $19.99 as part of the<br />\nvalue-minded, family-friendly Nintendo Selects series. The brave Captain<br />\nOlimar has returned to marshal new types of Pikmin in a wild, open-ended<br />\nadventure. On a mission to pay back his employer’s debt, Olimar and his<br />\nsidekick Louie must command squads of tiny Pikmin to help locate<br />\nvaluable treasures, exploring mysterious environments and battling pesky<br />\nenemies along the way. Players of any experience level can use the Wii<br />\nRemote and Nunchuk controllers to command these curious creatures and<br />\ncomplete their mission. The game also invites friends to deviously pit<br />\ntheir Pikmin squads against one another in a rough and ruthless<br />\ntwo-player mode*.<br />\nFeatures:</p>\n<p>Pikmin 2 is simple to pick up and play using the intuitive Wii Remote<br />\nand Nunchuk controllers. Players can alternate between controlling<br />\nCaptain Olimar and Louie as they point the Wii Remote controller at<br />\nthe screen to select Pikmin and put them to work. A swarm of up to 100<br />\nPikmin can be commanded simultaneously to explore new areas, locate<br />\ntreasures, fend off enemies and solve puzzles.</p>\n<p>Pikmin 2 marks the debut of two additional Pikmin types: white and<br />\npurple. Purple Pikmin boast 10 times the strength and weight of other<br />\ncolors, while white Pikmin are fast, resistant to poison and skilled<br />\nat locating hidden treasure. Returning Pikmin types such as red,<br />\nyellow and blue all have their own unique traits and abilities, too.</p>\n<p>Strategy is key as players choose which Pikmin to deploy for a given<br />\ntask. With more than 60 different species of enemy characters and<br />\nrandomly generated dungeons that span the planet, the game offers a<br />\nfun array of challenges.</p>\n<p>Players can go head to head in frantic two-player battles or team up<br />\nin a cooperative challenge mode.</p>\n<p>There are no time limits in Pikmin 2, so players of any experience<br />\nlevel can progress through the game at their own pace, heading<br />\nstraight for the action or taking time to explore the beautiful<br />\nhabitats.</p>\n<ul>\n<li>Additional accessories are required for multiplayer mode and are sold<br />\nseparately.</li>\n</ul>", "metacritic": null, "released": "2004-04-29", "tba": false, "updated": "2023-09-30T18:21:48", "background_image": "https://media.rawg.io/media/screenshots/4ad/4ad9f6dedf9764d885d3e3071ebd963b.jpg", "website": "", "rating": 4.39, "rating_top": 5, "added_by_status": {"yet": 13, "owned": 42, "beaten": 58, "toplay": 37, "dropped": 31, "playing": 5}, "playtime": 6, "achievements_count": 0, "ratings_count": 70, "suggestions_count": 392, "game_series_count": 6, "reviews_count": 70, "platforms": ["GameCube", "Nintendo Switch", "Wii U", "Wii"], "developers": ["Nintendo"], "genres": ["Strategy", "Puzzle"], "publishers": ["Nintendo"], "esrb_rating": null}