{"id": 242492, "slug": "jungle-crazy-runner-prisoner-survival-3d", "name": "Jungle Crazy Runner: Prisoner Survival 3D", "name_original": "Jungle Crazy Runner: Prisoner Survival 3D", "description": "Help Crazy Boy to escape in a jungle and make your time fantastic with one of the best fun busting endless running game of the year. You have to perform more exciting actions and jumps for more fun, you can enjoy with excellent experience of running, jumping and sliding in a fantasy jungle close to nature.<br/>Just try your running skills and ask yourself how far you can run because you not only have to go idle but you have to escape from the police.<br/><br/>Download and try for free this Jungle Crazy Run and get into endless running epilepsy where fun is at its extreme. The game offers very simple but easy to play intuitive controls. Feels yourself as be a part of unique marathon of the jungle.<br/><br/>Jungle Crazy Run is very exciting and fun challenging game which provides the brilliant game play with ease. You just have to tap simply to play this endless quest.<br/><br/>MODES:<br/><br/>The game is divided into two challenging modes of achievements and missions. You have to play in a manner to complete every mission with accuracy. Mission mode is divided into 3 challenging missions and other mode consists of 6 different achievements for the game completion and success. Make Nawaz happy by completing each of the mission and achievement.<br/><br/>GAMEPLAY<br/><br/>You have cover certain distance and collect power ups to complete the achievements.The objective of the mission is to run as fast as you can and perform amazing sliding, jumping and side navigation. To complete game objective and get more scores you have to collect gems found on your way in the jungle. You will definitely love the beautiful graphics and quick reflexes of the addictive game play and the nature scene which makes the game more attractive for the players. Collect items, jump over obstacles and watch out for the police.<br/><br/>Features<br/><br/>- Beautiful and addictive Game play <br/>- Stunning HD Graphics for better experience <br/>- Exciting crazy endless run<br/>- Collect gems for rewards <br/>- Best 3D Endless running game <br/>- Collect, slide and jump to complete achievements <br/>- 3 exciting challenging missions based on power ups and distance<br/><br/>Feel free to give us your valuable feedback and like us on Facebook at <br/>https://www.facebook.com/PlayVertex", "metacritic": null, "released": "2016-05-13", "tba": false, "updated": "2019-07-15T03:33:42", "background_image": "https://media.rawg.io/media/screenshots/781/781c9628560bb72ba9e8c757d38fbb70.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 190, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Muhammad Abdullah"], "genres": ["Adventure", "Simulation"], "publishers": ["Muhammad Abdullah"], "esrb_rating": "Everyone 10+"}