{"id": 242488, "slug": "jungle-four-footed-animal-hunt", "name": "Jungle Four-Footed Animal Hunt", "name_original": "Jungle Four-Footed Animal Hunt", "description": "Hunt for real crazy animals in the forest. Wild Sniper hunter in the realistic forest to shoot, furious beasts. Let's go hunting the dangerous beasts, deadly lions so you can survive. Enjoy the biggest &amp; unique \"Animal Hunting - Frontier Safari shooting\" Hunt the deadly animals and become a professional hunter. This adventurous hunt is filled with the stunning environment which makes you thrilling &amp; sharp professional hunter of the jungle world. Once you start this deadly animal. <br/>sniper shooting experience you didn't want to stop till it ends.<br/><br/>DEADLY ANIMALS &amp; AMMUNITION:<br/>In hunting frontier safari shooting game, there are thrilling missions &amp; a lot's of an adventurous hunt, with deadly and crazy creatures. You have to hunt many wild beasts in this safari forest like Tiger, Hyena, Cheetah, Stag, Bull, Pig, Rhino, lion, lioness. The most huntable dangerous heavy Elephant &amp; and attack. So you have to bring with you the guns like Knife, Pistol, SMG, Shotgun, Ak47, M4, Rifle, and Sniper for surviving. Target the lion, Do headshots in the tiger, leopards &amp; other beasts. There are some innocent animals like rabbit, Zebra, Giraffe &amp; African buffalo. if you target that innocent animal your point deducts and the game will over so  Sniper hunter safari jungle (Forest)  makes you crazy. You will become a professional target wilderness, sharp hunter. Must aim precisely at the sniper to Shoot attack the wilderness of jungle (Forest). Play the perfect hunter game, use your modern deadly sniper rifles, firearm to take the exciting shot, kill the deadly beasts. The wonderful sniper weaponry Wilderness Hunting's are specially designed for delivering to the best handgun with an especially controlling zoom, unlimited ammo with powerful pierce bullets. You are equipped with many weapons like knife, pistol, SMG, Shotgun, M4 Rifle, Ak47 gunfire. Use accurate gun from modern handguns according to the difficulty of the levels. Just prove yourself, you have the great shooting skills,  show modern shooting sniper abilities to shoot down the safari jungle deadly creatures. Some amazing hazardous safari creature is spread around the forest, savage lion &amp; lioness can attack back on you so if you want to survive, Aim the other creatures. In \"Wild Animal Hunting - Frontier Safari Shooting\" you have to aim every animal &amp;if your target is missed, they can kill you. <br/><br/>HOW TO PLAY<br/>- when you start the game you will see the Mode Selection.<br/>- Mode Selection further divided into two modes menus 1st one is infinite mode and the other one is level mode.<br/>- The infinite mode has three levels: Easy, Medium and Hard.<br/>- Easy mode: you have to shoot the wild beasts to achieve the target points but in easy if you kill one there is another wild creature in the forest as a gift. Whereas in Medium two wild animals will be gifted for hunting and in Hard Mode, there are three animals as gifts. <br/>- Levels mode have 10 different stages and each stage have the different animal.<br/>- Have to unlock weapons after playing different stages to get gold so you can kill wild animals easily.<br/><br/>FEATURES<br/>- Stunning HD graphics <br/>- Smooth and efficient controls<br/>- Easy ways to play the hunting game<br/>- It's first person shooting game", "metacritic": null, "released": "2017-12-29", "tba": false, "updated": "2019-07-15T03:30:48", "background_image": "https://media.rawg.io/media/screenshots/634/634df41367207e5479c465a2f2431166_pdxWQR9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 184, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Muhammad Abdullah"], "genres": ["Action", "Simulation"], "publishers": ["Muhammad Abdullah"], "esrb_rating": "Mature"}