{"id": 242484, "slug": "flying-birds-huntsman-real-adventure-hunting-2017", "name": "Flying Birds Huntsman: Real Adventure Hunting 2017", "name_original": "Flying Birds Huntsman: Real Adventure Hunting 2017", "description": "Huntsman does hunting on the island for adventure and survival. So in this action game, you can perform bird shooting freely.In Flying birds shooting, you will improve your experience of the professional classic taste of bird shooting and hunting. Flying Birds Huntsman will provide you real adventure touch of sniper hunting and shooting of flying birds.<br/><br/>By gripping hand on sniper or gun, you will be a sharpshooter.<br/>Flying Birds Huntsman has four types of birds like crows, eagle, owl, and Sparrow. Break the first level within given time and go forward. Unlock different levels to enjoy real amazing hunting game. You can easily kill any bird with help of latest sniper gun. If you feel difficulty to target a bird, use zooming in button to see the clear flying bird. Play to become a champion of shooting with a sniper. <br/>The game will give you a real feel of birds flying in the sky. Your feeling will matter on your real hunt.You will feel the pleasure of weather of island during hunting. <br/>Everyone is a legend, play this game to prove your legendary.<br/><br/>FEATURES:<br/>- 3D island environment with infinite water<br/>- HD and stunning graphics <br/>- Easy to play and smooth controls<br/>- Easily find flying birds with the help of map<br/>- Real classic touch of hunting on island <br/>- Enjoy pleasant weather of island<br/><br/>HOW TO PLAY:<br/>- Grab your sniper 3D gun<br/>- Aim at flying bird by zooming in <br/>- Shoot the flying bird and unlock the next level<br/>- To unlock next bird complete your current level", "metacritic": null, "released": "2017-07-27", "tba": false, "updated": "2019-07-15T03:31:11", "background_image": "https://media.rawg.io/media/screenshots/18b/18b0248d9090b48ef496cfd47c861674.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 70, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Muhammad Abdullah"], "genres": ["Action", "Simulation"], "publishers": ["Muhammad Abdullah"], "esrb_rating": "Mature"}