{"id": 242493, "slug": "animal-jumping-stunt-driver", "name": "Animal Jumping: Stunt Driver", "name_original": "Animal Jumping: Stunt Driver", "description": "Are you ready to test yourself as the animal stunt driver on high extreme impossible tracks? Do you want to do different stunts on animals? Then let's play ANIMAL STUNTS on IMPOSSIBLE TRACKS. Animal stunts on tracks is an adventurous simulation game. You will love to play stunt with wild animals.<br/><br/>The game is full of thrill and you have to keep the focus on impossible track. Some hurdles like balls, basketball, and skittles may divert your attention so play game wisely. You have animal Zebra at the start of game which is unlocked. You have to unlock animals Camel, Lion, Tiger, and Cheetah by performing different stunts. The game is real extreme stunts rush on the incredible tracks. Jump, ride perform crazy stunts in the mid-air amazing tracks, feel like an Animal Jumper. Rush like a crazy rider performs different racing tricks.<br/><br/>Play Animal Jumping: Stunt Driver Sim Game gives you the most adventurous gameplay.  Enjoy the impossible racing on the extreme tracks and become the master of this tricky stunt racing game 2018.<br/><br/>GAMEPLAY &amp; FEATURES<br/>- Awesome HD Graphics and sound effects<br/>- Real Animals Stunts<br/>- Challenging Levels on Impossible Tracks<br/>- Real Game-Play with awesome controls<br/>- Daily rewards and bonus", "metacritic": null, "released": "2018-01-11", "tba": false, "updated": "2019-07-15T03:33:49", "background_image": "https://media.rawg.io/media/screenshots/b24/b244388fca91bc30ca70b4a3374ca51d_JLq6fSH.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 158, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Muhammad Abdullah"], "genres": ["Simulation", "Racing"], "publishers": ["Muhammad Abdullah"], "esrb_rating": "Everyone 10+"}