{"id": 242471, "slug": "gangstars-sniper-shooter-survival-shootout", "name": "Gangstars Sniper Shooter: Survival Shootout", "name_original": "Gangstars Sniper Shooter: Survival Shootout", "description": "Army commando Sniper Shooting is the best free game in sniper shooting games of 2017. Real shooting era experience of a real action games of sniper 3d.<br/><br/>Army Commando Sniper Shooting is best game of competing modern army enemies by performing his duty. Sniper shooting is a real and full of action army combat sniper shooting in the industrial area, where enemies are equipped with modern army guns like ak47, rpg, pistol, m16 and latest American sniper gun. Try your best to take a head shot in these critical situations where they are very trained in combat and 3d sniper shooting. Perform your duty as an immortal army commando and be a soldier of Heavy Combat.<br/><br/>Eliminate modern combat enemies by showing yourself as a best army commando sniper by presenting your trained sniper shooting. By killing all the enemies you can become a Hero of Nation of 2017.<br/><br/>***** Game Play and Missions Briefing *****<br/><br/>This game is having missions. Each mission is different and much challenging for you.<br/><br/>Mission 1<br/>In Mission 1 Terrorist are in small amount and you having to find out all terrorists from the map and shoot them. <br/><br/>Mission 2<br/>Mission 2 is having a slightly higher level of Artificial intelligence of Terrorists and also having more terrorists. So shoot all the terrorists.<br/><br/>Mission 3<br/>Terrorist killed all the staff of the factory and they are going to utilize the weapons. <br/>So hurry up and save the factory.<br/><br/>Mission 4 <br/>In this mission terrorists are in large number in factory and they are going to destroy all the automatic machines of the Army Factory. Shooting must be your passion to shoot all the terrorists easily.<br/><br/>Mission 5<br/>Terrorists are going to be more dangerous after using modern and advanced weapons of the factory. Help out your country.<br/><br/>Mission 6 <br/>Terrorist have reached the final point of the factory where explosive is manufacturing, if they accessed your all heavy explosives then your country is going to be destroyed. <br/><br/><br/>***** Army Commando Sniper Shooting Features *****<br/>=&gt; best army commando sniper shooting game <br/>=&gt; Real and modern sniper 3d <br/>=&gt; Best Sniper Combat Action Game<br/>=&gt; HD graphics<br/>=&gt; Easy and understandable controls<br/>=&gt; Trained Enemies as Army commando", "metacritic": null, "released": "2016-05-05", "tba": false, "updated": "2019-07-15T03:26:58", "background_image": "https://media.rawg.io/media/screenshots/55c/55cd775dc859982cb3b285ca3ea2224e_4pfJQ29.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 155, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Muhammad Abdullah"], "genres": ["Action", "Simulation"], "publishers": ["Muhammad Abdullah"], "esrb_rating": "Mature"}