{"id": 242466, "slug": "desert-army-war-operation-furious-crushing-battle", "name": "Desert Army War Operation -Furious Crushing Battle", "name_original": "Desert Army War Operation -Furious Crushing Battle", "description": "Do you love to play with Best Army Commando War Sniper Shooting Games? If yes, here is best Action, Shooting and Army War Battlefield game for you. This is the best shooting game of 2016 in which you have to complete your duty by encountering all the enemies behaving as modern marine commando.<br/>Enemies have started to occupy the different areas of city with modern helicopter, tanks and with other modern weapons. They are with modern pistol,High level machine gun, pump action gun, bullpup rifle, machine gun, automatic shotgun, sniper, light machine gun, mini gun, rpg, slugger, grenade, m64c, cq16, thumper and Gatling gun.<br/><br/>You are not immortal but you have to show immortal Best Army Commando in the battlefield and with wipe out the City and Army base from the enemies. As Enemies have invaded some regions of our northern and southern areas of our city. You are lone army commando and it’s your duty to wipe out the city from enemies.<br/><br/>“Desert Army War Operation” is best sniper shooting game of 2016 and with stunning graphics with a war zone.<br/><br/>Best game features:<br/><br/>-\tGame is having stunning desert city war zone environment.<br/>-\t3D Modern guns with amazing actions.<br/>-\tEnemies are with modern weapons, helicopters and tanks.<br/>-\tHigh Quality Controls.<br/>-\tRealistic Sounds.<br/><br/>Stay Connected:<br/>Play vertex is developing HD games for Android, IOS and WP8 Devices. Stay connected to Play Vertex for the latest and amazing Updates of new upcoming Games.<br/><br/>Feel free to rate our games also give us feedback and Follow us on Facebook at <br/>https://www.facebook.com/playVertex", "metacritic": null, "released": "2016-09-12", "tba": false, "updated": "2019-07-15T03:25:56", "background_image": "https://media.rawg.io/media/screenshots/094/094479b9c40627316c475c4c441fc1ab.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 121, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Muhammad Abdullah"], "genres": ["Action", "Simulation"], "publishers": ["Muhammad Abdullah"], "esrb_rating": "Mature"}