{"id": 242500, "slug": "zombies-slay-assassin-zg-pro", "name": "Zombies Slay Assassin ZG Pro", "name_original": "Zombies Slay Assassin ZG Pro", "description": "Keep your danger level up and shoot the zombies to death in a best first-person shooting game, Zombies Slay Assassin Shooting 17, search out the intransitive way to survive?<br/><br/>A virus is brought to country sci-fi lab for testing purpose, due to wrong operations virus brought a zombie disaster. The Virus attacked scientists and workers of the lab and the war burst forth against the zombies. By the order of country's Minister, the FAST-ACTION FRONTLINE MILITARY sent to the sci-fi lab, to be part of the project ZOMBIES SLAY. As a frontline survivor and zombies shooter, you can turn sci-fi lab to a war battlefield and find a way to move forward by shooting the zombies and clearing the areas as missions. <br/><br/>Even you don't have to have your finger on the trigger, country's frontlines head provided you the weapon that allows auto-shooting. Upgrade your target shooting experience as zombies terminator and raise up your super destructive combat shooter level. Fight for survival against zombies through multiple missions and enter a rescue station after clearing zombies in a specific area of the lab. <br/><br/>If you are in search of new zombie shooting games to play this excellent game and ready for the surprise. Download and start your action game Zombies Slay Assassin Shooting. This is our new generation 3D zombie killer game 2017. You might have played zombie games but this game is based on the concept of your imagination with the great 3d environment with high-quality HD graphics gameplay.<br/><br/>ZOMBIES SLAY is an FPS shooting game in which you can:<br/>- Slay down evil zombies with your modern weapons<br/>- Purchase an upgraded weapons with higher shooting effects<br/>- get best target 3d shooting experience as zombie hunters<br/>- boost your nerve level to peak point while hunting zombies<br/><br/>WEAPONS &amp; GIMMICK<br/>- Frontiers provided 3 types of weapons to shooter<br/>- WARFARE WEAPONS - hunt zombies with SMG, AK47, M4 RIFLE &amp; HI-TECH SNIPER<br/>- FRONTS WEAPONS - slay down zombies with PISTOL &amp; SHOTGUN<br/>- GRENADES PACKS - explode evil zombies with two different types of grenades packages.<br/>- Upgrade your weapons when your cash level boosted and prepare yourself for a good shooter<br/>- turn your mobile to the battlefield with warfare and fronts weapons <br/><br/>DESIRES &amp; ACHIEVEMENTS<br/>- Shoot zombies and raise your cash amount to play with hi-tech weapons<br/>- Play daily and get daily reward bonus to engage you <br/><br/>TARGET ZOMBIES <br/>- Three types of deadly zombies<br/>- NORMAL ZOMBIES - can walk slow and have less dead impact on player<br/>- FAST ZOMBIES - can walk too fast and normal death impact on player<br/>- POWERFULL ZOMBIES - have the ability to turn player to dead within seconds<br/>- Kill zombies with modern and upgraded guns<br/><br/>GAME FEATURES <br/>- Excellent HD graphics and amazing gameplay<br/>- First Person Sniper Target Shooting with auto-firing<br/>- AUTO FIRING enabled or disabled on your own choice<br/>-Zombie Shooting Fun to Play", "metacritic": null, "released": "2017-11-17", "tba": false, "updated": "2019-07-15T03:40:15", "background_image": "https://media.rawg.io/media/screenshots/bd8/bd8c69443cddd3c1257a2f93b0de8fa0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 268, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Muhammad Abdullah"], "genres": ["Action", "Adventure"], "publishers": ["Muhammad Abdullah"], "esrb_rating": "Mature"}