{"id": 24257, "slug": "rytmik-retrobits", "name": "Rytmik Retrobits", "name_original": "Rytmik Retrobits", "description": "<p>\n      Its user interface blends the fast and well-arranged interface of \n      classic drum machines with flexible pattern interface of popular \n      trackers and with modern sound library. It contains more than 180 \n      carefully selected authentic retro sound samples of electronic drums, \n      percussions, bass, melodic instruments and effects from 8-bit and 16-bit \n      computers and classic consoles.<br/>\n</p><p>\n      With Rytmik Retrobits you can quickly and easily create the basic \n      building stone – an audio clip. It consists of musical notations for up \n      to four instruments that you may transpose, select their location in the \n      stereo field, and modify their volume, reverse, shuffle (rhythm twist) \n      and polyphony (with extended polyphony handling), chorus/widening stereo \n      effect, echo and arpeggiator. You may arbitrarily combine up to 128 such \n      clips in four tracks and create complex pieces of music. Moreover, you \n      have a collection of 10 pre-made compositions at your disposal from \n      which you may quickly compose your own pieces.<br/>\n</p><p>\n      Rytmik Retrobits is not only for playing with sounds; in the hands of a \n      skilful musician it can become a serious musical instrument – \n      surprisingly powerful pocket music station. For the best musical \n      experience we recommend connecting headphones or quality speaker system. \n      You’ll become the king of the retro party in no time...\n    </p><p>\n</p><p>\n      Features:\n    </p><p>\n      - Pocket music station<br/>- Library of more than 180 sound samples<br/>\n</p>", "metacritic": null, "released": "2011-12-22", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/525/525852143b8b9121c12be150f70f944f.jpg", "website": "http://rytmik-retrobits.cinemax.cz/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 156, "game_series_count": 0, "reviews_count": 0, "platforms": ["Nintendo DS"], "developers": ["CINEMAX"], "genres": [], "publishers": ["Cinemax"], "esrb_rating": null}