{"id": 242531, "slug": "the-next-big-thing-lite", "name": "The Next Big Thing - Lite", "name_original": "The Next Big Thing - Lite", "description": "The Next BIG Thing is the new, hilarious adventure gem from the creators of Runaway. A great adventure game in high definition, loaded with laughs, tributes, mysteries and wacky puzzles!<br/> <br/>Thanks to a production worthy of a great animated movie, an awesome soundtrack, delightful dialogue and a great art style, The Next BIG Thing will make you live an unforgettable adventure which brilliantly takes players across the fantastic movie genres of a totally crazy Hollywood.<br/> <br/>Hollywood<br/>What if horror movies' monsters were actually played by real monsters? And what if they were now forced to play in movies for kids, romantic comedies or even musicals? And what would happen if, eventually, they were to rebel?<br/> <br/>In that context, Liz Allaire, talented journalist who can't count up to 4, and Dan Murray, a tough macho who can't stand beetles, attend the horror movies award ceremony… there is the starting point of an incredible story, full of twists and turns! Help Liz and Dan solve the numerous mysteries of an amazing adventure that you won't forget any time soon!<br/> <br/>- Solve numerous puzzles and mysteries<br/> <br/>- Meet wacky characters and monsters<br/> <br/>- Explore dozens of colorful places<br/> <br/>- A production worthy of a great animated movie<br/> <br/>- Movie-like musical score and English voice-over", "metacritic": null, "released": "2011-06-02", "tba": false, "updated": "2019-10-22T14:14:30", "background_image": "https://media.rawg.io/media/screenshots/ca0/ca07901f35272dc63a277651f5718eac.jpg", "website": "http://www.thenextbig-game.com", "rating": 0.0, "rating_top": 0, "added_by_status": {}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 316, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS"], "developers": ["Focus Home Interactive"], "genres": ["Adventure", "Puzzle"], "publishers": ["Focus Home Interactive"], "esrb_rating": null}