{"id": 242656, "slug": "waste-of-time-pro", "name": "Waste Of Time Pro", "name_original": "Waste Of Time Pro", "description": "Waste of time PRO<br/><br/>This app is a complete waste of time so we would like to apologize in advance.  We built it while we were working on other projects.  You are being kind by downloading it and most likely wasting your time.<br/>Why are we being so honest?  Well after a heated meeting with our marketing department (which is ourselves) we decided to turn a new leaf and not use phrases like \"amazing game\" or \"ultimate awesomeness\" or \"crazy fun\".  We know you are too intelligent to fall for phrases like those.  As a weird side effect we have been overcome with a strange sense of honesty and goodness.  This is awkward for us so we will probably revert back soon to shallow and meaningless promotion.  <br/>If you are still reading this, you are a person of amazingly rare character and also good looking.  And if you are so unbelievably fabulous check our some other products on our website.  You will not believe how good it will make you feel (wiping tear from eye).  If you happen to download this app and find some bit of actual usefulness in it, please get a hold of our customer support at support@webgames3d.com and we will easily convince you that there is absolutely no usefulness and the game truly is a complete waste of time.  While some may find this app cool, entertaining, addicting, or fun, we officially have no comment on that.<br/><br/>List of features<br/>•holes<br/>•balls that move<br/>•obstacles<br/>•pause button<br/>•sounds", "metacritic": null, "released": "2013-12-13", "tba": false, "updated": "2019-10-22T14:14:35", "background_image": "https://media.rawg.io/media/screenshots/576/576574b094a7f7a2ccdb988caddfcc06.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 33, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["WebGames3D.com"], "genres": ["Simulation", "Puzzle"], "publishers": ["Andy Mileusnic"], "esrb_rating": "Everyone 10+"}