{"id": 242829, "slug": "odd-one-out", "name": "Odd one out (itch)", "name_original": "Odd one out (itch)", "description": "<p>Odd One Out is a brain game for children ages 3 to 6. It teaches to identify the odd one in a group and cross it out. While playing, little curious minds will evaluate elements, figure out patterns, and choose the odd one out. Children love games like this. They provide food for their natural curiosity. Colorful and simple pictures will be also of much interest.</p>\n<p>Don’t worry if your child fails to hit on the right answer at once. Not a big deal! After you explain, your little one will not only learn to analyze and process information, but also know a thing or two about the world around.</p>\n<p>The game engages thought and imagination. You will be surprised by your child’s answers. Children will try to compare the objects by very different characteristics including color, “animate-inanimate”, shape, etc. Changing the difficulty level, you can offer this game again and again! Children can never get enough of it!</p>\n<ul><li>141 sets of cards with different objects around us including transport and insects;</li><li>Colorful and easy to control even for the littlest ones;</li><li>Simple way to spark imagination and mind, broaden outlook of your kids;</li><li>Easy to use app for children;</li><li>No purchases in the app.</li></ul>\n<p>If you want your child to be curious, try Odd One Out!</p>\n<p>70 sets of cards are free. After you buy the game, you will get access to all 141 sets of cards and no advertisements.</p>", "metacritic": null, "released": "2018-09-20", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/6ef/6ef7ef66d3aec6c417e756bdc8de4b72.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 45, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Denis"], "genres": ["Educational", "Puzzle"], "publishers": [], "esrb_rating": null}