{"id": 2429, "slug": "fall-of-angels-hd", "name": "Fall of Angels HD", "name_original": "Fall of Angels HD", "description": "Fall of Angels is a JRPG adventure with a focus on exploration, puzzles, and an engaging and original story.<br/><br/>- Explore the many lands of Tellus from seaside towns to forgotten ruins to unravel the world&amp;#39;s secrets<br/>- Interact directly with scenes of interest with a first-person view<br/>- Find items and tools hidden throughout the world to solve puzzles<br/>- Control a diverse cast of characters, each with their own story and skills<br/>- No grinding<br/>- Embark on an adventure that you&amp;#39;ll never forget!<br/><br/>Fall of Angels is a return to the roots of classic adventure games, and to the important elements that make a game FUN.<br/><br/>~~~~~~~~~~~<br/><br/>The night that the skies of Tellus were lit up with the fire of an electrical storm, an object pierced through the clouds and crashed into the foot of the Oshu mountains. No one knew it then, but that night the world of Tellus would change forever.<br/><br/>When the Oshu region erupts in war and the Choir of Aquinas- the world&amp;#39;s peaceful religious order- sends their military arm to kill a small child at all costs, confusion begins to spread. As the sole survivor of the failed assassination attempt travels to find the fleeing girl before the Choir do, he begins to remove the mask that Tellus has worn for far too long and uncovers the terrible secrets that its people tried to bury.", "metacritic": null, "released": "2015-09-03", "tba": false, "updated": "2019-10-22T14:28:04", "background_image": "https://media.rawg.io/media/screenshots/fc1/fc159a545ee39287891b8058b3888299.jpeg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 169, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tellus Software"], "genres": ["Adventure", "RPG"], "publishers": ["Tellus Software"], "esrb_rating": "Everyone 10+"}