{"id": 243040, "slug": "oic-obviously-inappropriate-content", "name": "OIC: Obviously Inappropriate Content", "name_original": "OIC: Obviously Inappropriate Content", "description": "<p><strong>OIC: Obviously Inappropriate Content</strong> is a story-rich adventure game sets in a fictional Eastern-bloc country, where the player, as a game tester, must censor a developing game under government regulation. Developed by Shuaiying 'Shane' Hou with inspiration from  '<strong>Papers, Please</strong>', '<strong>Metal S</strong><strong>lug</strong>', and ‘<strong>Orwell</strong>’, OIC explores the origins and development of video game censorship, and how it might affect the video game industry and our society. </p>\n\n<p><strong>For Press Release and more please visit:</strong></p>\n<p><strong>https://drive.google.com/open?id=1sf-ac9QFxfrbviGryeG6leyJNtqnxsDG</strong></p>\n\r\nThe Story\r\n<p>The story takes place in a fictional Soviet country called <strong>Belkasvenia</strong>, and is based on a fictional historic idea that The Soviet Union still exists in 2008. The Belkasvenian government, ruled by <strong>THE SUPREME LEADER</strong>, continually implements regulations intended to “ensure that all video games nurture a healthy and positive culture”.</p>\n\r\nGameplay\r\n<p>The player plays as a game tester hired by a local game company called \"<strong>Last Life Left Game Studio</strong>\", and his/her weekly job is to test a 2D action-shooter game called “<strong>Ural Death Machine</strong>” which is under development. If he/she discovers any bug or anything that violates the censorship regulations, he/she must take a screenshot and report it.</p>\n<p>The total testing period is six months. One pass of testing a level of the game represents one week of testing. At the start and end of each working day, the player can check their emails, interact on social media with their work colleagues, and find out the news. In this way the player is updated on the effects their work has on the company, the events in the outside world that will affect the pressures on their job, and the changing attitude and censorship regulations of the government.</p>\n\r\nEndings\r\n<p>As the story progresses, the list of censorship regulations keeps growing longer and vaguer. It costs the game company a lot to change game content which might violate the rules, and it also makes co-workers question the justifiability of the government. Since the government and the company have opposing interests, the player must try to keep the balance between two sides. They must censor a certain amount of inappropriate content to gain trust from the government, while not causing too much trouble for the company. Different choices by the player lead to different endings.</p>", "metacritic": null, "released": "2018-09-05", "tba": false, "updated": "2019-08-28T23:20:13", "background_image": "https://media.rawg.io/media/screenshots/9bd/9bda681f0d2173d08cb4b52e8aa532ce.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 384, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Shane Hou"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}