{"id": 243006, "slug": "the-story-of-maple-hilarious-game-for-nerds", "name": "The Story Of Maple Hilarious Game For Nerds!", "name_original": "The Story Of Maple Hilarious Game For Nerds!", "description": "<p>This Story Of Maple is a hilarious, unique game that never takes itself too seriously. This game is really good when it comes to making fun of fan-bases and is full of hilarious nerdy references that should get a laugh out of almost anyone. If you want to see a game that makes fun of obsessive fans, than this is the game for you! this game is constantly making fun of those types of fans. This includes Undertale fans, anime fans, and much more! The Story Of Maple is based on a true story about a evil caw who was summoned from the underground set out to kill.I can promise you the story is way funnier than I am making it seem but I don't want to give away too much before anyone play's it. THIS GAME IS SOOOOOO FUNNY!!!! The biggest strong point in this game would have to be the story as it is a Visual Novel Game but remember, the story is designed for comedy only and is not to be taken seriously. WARNING: This game contains many nerdy references that normies may find offensive.  The Perfect Game For Nerds! </p>\n<p>If you play this game, I would love to know your thoughts on it! you can comment down below, or you can email me at seankellyw@gmail.com. I would love to hear your feedback! at some point I might even make a updated version of this game with more options and more cool stuff so be on the lookout for that! Thank's for playing!</p>", "metacritic": null, "released": "2018-09-18", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/243/243b10c59412957044dbb5a2c87f52bf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 105, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["sean the magical weeabu"], "genres": [], "publishers": [], "esrb_rating": null}