{"id": 24316, "slug": "top-shot-arcade", "name": "Top Shot Arcade", "name_original": "Top Shot Arcade", "description": "<p>\n      Have a blast in 4 player head to head arcade action!\n    </p><p>\n</p><p>\n      Enjoy non-stop laughs and the wildest shootin' action ever as you \n      compete in 75 arcade style shootin' galleries and 15 over the top bonus \n      games. Featuring 4 person head-to-head arcade style gameplay, this is \n      the ultimate game for a party or family night. You'll also need to get \n      your trigger finger ready as the game comes bundled with the TOP SHOT \n      ELITE peripheral - just load your WiiTM Remote and Nunchuk and you're \n      ready for countless hours of shootin' action!\n    </p><p>\n      Features\n    </p><p>\n      • 75 Arcade Style Shooting Galleries - across 15 North American locales \n      where you will need to prove your shootin' skills<br/>• 15 Over the Top \n      Bonus Games - fun shoot 'em up mini games including Tornado Toss-Up, \n      Animatronic Rampage and Trailer Trashin'<br/>• 4 Person Head-to-Head \n      Multi-Player - up to 4 players can compete at the same time for non-stop \n      shooting fun<br/>• TOP SHOT ELITE - Integrated with the TOP SHOT ELITE \n      peripheral featuring pump action reload and an adjustable stock<br/>• \n      Online Leaderboards - players will be able to post their scores online \n      and claim bragging rights<br/>• Party Games - a fun experience for \n      friends and family with plenty of laughs and over the top humor\n    </p><p>\n      As of May 20, 2014, the Nintendo Wi-Fi Connection service for Nintendo \n      DSi and Wii systems has been retired. Online features of this game are \n      no longer available after this date but this game still provides an \n      entertaining experience in offline mode.\n    </p><p>\n      To learn more about this service change, please visit To learn more \n      about this service change, please visit support.nintendo.com/servicesupdate.\n    </p>", "metacritic": null, "released": "2011-02-08", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/482/48289d7f1994701b7fb5b86073142bae.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 382, "game_series_count": 0, "reviews_count": 0, "platforms": ["Wii"], "developers": ["Budcat Creations"], "genres": [], "publishers": ["Activision Blizzard"], "esrb_rating": null}