{"id": 243108, "slug": "star-citadel", "name": "Star Citadel", "name_original": "Star Citadel", "description": "<p>Cinematronics released the original Star Castle arcade game in 1980. Back then vector games were all the rage with Asteroids perhaps being the best known example, but Star Castle is definitely worthy of attention, as you can hopefully tell from this screenshot:</p>\n\n<p>The aim of the game is to use your small but manoeuvrable ship (bottom-right in the screenshot above) to attack and destroy the cannon in the centre of the screen.</p>\n<p>This is complicated by the rotating shield rings that protect it, so you must first blast your way through those. You'll also need to keep an eye out for, and dodge, the mines that the cannon releases, in addition to its large energy projectiles. Fortunately it can only fire an energy projectile at you when it has direct line of sight on you through its shield rings. Still, it only needs the slightest gap to let loose a shot so be careful not to get too close.</p>\n<p>To give you a better idea, here's a gameplay video showing the free (ad supported) version of the game:</p>\n\n<p>(The version available for purchase on itch.io includes no adverts, which I'm sure you'll be pleased to hear.)</p>\n<p>Star Castle was relatively common in the US but, as far as I can tell, not necessarily that well known in other countries. In fact the first time I ever saw or heard of it was from watching the documentary film Atari: Game Over a couple of years ago.</p>\n<p>I thought Star Castle looked really cool, but I couldn't find a reliably playable version that I particularly liked (I tried several web, mobile, and desktop based ports). In the end I decided to try and write my own, spending quite a lot of time watching footage of the original arcade game on YouTube in the process.</p>\n<p>And thus was born Star Citadel. It has two game modes: modern and classic. Classic is intended to play as similarly to the arcade original as possible and, as such, it's incredibly difficult, but quite rewarding to master.</p>\n<p>The modern mode is designed to (hopefully) appeal a little more to today's gamers, as well as retro enthusiasts. The learning curve is somewhat less brutal, and the ship controls are a more fluid. I've also added power-ups to the game to spice things up a bit. Frankly, they become essential to progress on higher levels!</p>\n<p>Hope you enjoy the game, and I'm very happy to receive feedback/comments/suggestions/bug reports.</p>\n<p>Thanks for playing!</p>", "metacritic": null, "released": "2018-09-15", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/cb0/cb08649ae18ef5b883765eb007467d11.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 75, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["arcade.ly"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}