{"id": 243173, "slug": "rogue-bit", "name": "Rogue Bit", "name_original": "Rogue Bit", "description": "You play the game as a single bit of computer memory. You can invade other bytes around you and thus modify their values. <br/><br/>The game features various types of puzzles:Explore<br/>With ability to XOR into adjacent bytes, you can navigate your way through existing data in the memory. The game automatically marks the bytes you cannot go through without getting yourself overwritten and prevents you entering those. Both binary and ASCII views are available, which you can utilize to find an open path for a particular puzzle.Decipher programs<br/>Various programs run on the computer you are trying to escape from. The game includes a disassembler showing you the assembly language corresponding to the machine code that is being executed. Don't worry if you don't know any Assembly. There are only a handful of CPU instructions and they are introduced gradually as you complete the puzzles. Reading the assembly code, you can track the program logic, see which parts of RAM it reads and writes to and manipulate data in those locations to get the program to do what you want.Invade CPU registers<br/>The computer you are trying to escape has a simple CPU with a couple of registers. You can trick the CPU to load yourself into the registers and affect code execution or offload yourself into otherwise unreachable memory locations.Hack<br/>For some puzzles, it isn't enough to change the data in RAM or registers. You can also change the machine code to get the computer to do different things.<br/><br/>TL;DR<br/>The game is about the way computers work internally. This isn't a game about writing new programs, but hacking existing programs and their data to clear the path or teleport across memory until you find a way to escape the computer completely. <br/><br/>Having some programming knowledge makes the game easier, but it isn't required. All the elements required to solve the puzzles are explained in the game.", "metacritic": null, "released": "2019-03-21", "tba": false, "updated": "2019-08-28T21:53:04", "background_image": "https://media.rawg.io/media/screenshots/e1d/e1d51bc90d8e1c688bbc00952a655bda.jpg", "website": "", "rating": 0.0, "rating_top": 4, "added_by_status": {"yet": 2, "owned": 29, "beaten": 1, "toplay": 1, "dropped": 3}, "playtime": 1, "achievements_count": 9, "ratings_count": 5, "suggestions_count": 171, "game_series_count": 0, "reviews_count": 5, "platforms": ["Nintendo Switch", "PC", "macOS", "Linux"], "developers": ["Bigosaur"], "genres": ["Simulation", "Indie"], "publishers": ["Bigosaur"], "esrb_rating": null}