{"id": 24326, "slug": "cozy-fire", "name": "Cozy Fire", "name_original": "Cozy Fire", "description": "<p>\n      We all long for a cozy open fire, particularly during the cold \n      season, but not everyone is able to snuggle in front of a warming blaze. \n      The WiiWare service opens the door for a fireplace to fill the room with \n      a magical and cozy atmosphere! \n    </p><p>\n      We all long for a cozy open fire, particularly during the cold season, \n      but not everyone is able to snuggle in front of a warming blaze. The \n      WiiWare service opens the door for a fireplace to fill the room with a \n      magical and cozy atmosphere!\n    </p><p>\n      Select from a variety of logs and use the Wii Remote controller to stack \n      them up. Now, light a virtual match and your home will soon be snug and \n      glowing. There are 6 fireplaces available: fire alone, campfire and \n      rustic, classic, elegant and Zen fireplaces.\n    </p><p>\n      Poke and tend the fire to keep it burning. Place more logs on the fire \n      to keep the fire burning, just like a real fire. Would you like to just \n      sit back and relax? No problem: new logs will be placed on the fire in \n      Butler mode, and the logs never burn down in Non-stop mode!\n    </p><p>\n      What could be nicer than the comforting crackle and animation of a real \n      fire, during the coldest time of the year!\n    </p><p>\n</p><p>\n      Features\n    </p><p>\n      • 6 types of fire: fire alone, campfire, rustic, classic, elegant and \n      Zen fireplaces<br/>• Cozy, fireside sounds<br/>• Realistic physics \n      simulation with PhysX® by NVIDIA Technology<br/>• 4 game functions: \n      Butler (logs are placed on the fire automatically), Non-stop (logs never \n      burn down), Standard (a ready-made fire in any fireplace), Individual \n      (players select the logs and put them in the fireplace)\n    </p>", "metacritic": null, "released": "2011-02-21", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/936/9365e5068e56cd40bd08c5a1477a497d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 167, "game_series_count": 0, "reviews_count": 0, "platforms": ["Wii"], "developers": [], "genres": [], "publishers": ["dtp young entertainment"], "esrb_rating": null}