{"id": 243211, "slug": "super-zombie-arcade", "name": "Super Zombie Arcade", "name_original": "Super Zombie Arcade", "description": "A flu causing a zombie apocalypse has rampaged the world. There are few survivors. After a long night of heroically saving others, looting and good ol zombie killing you find yourself in a rather tricky situation. Wave after wave of zombies are coming and there's no escape. They're coming from everywhere. It's only a matter of time now. Question is how long will you last?<br/><br/><br/>Get thrown right into the action. In this first person arcade style shooter zombie after zombie is coming for your brains. As you kill zombies the level increases. As the level increases more zombies. Higher levels unlock cool weapons. Watch your back as the levels raise new lanes for zombies open. <br/><br/>Features<br/><br/>Weapons<br/>Pistol- This fantastic starter weapon gives bonus points for head shot kills.<br/>SMG- The highest rate of fire means this weapon is great for clearing thick waves.<br/>M4A1- Trusty M4A1 has the highest damage and is automatic.<br/>Sword- When you want it personal this baby one hit kills all except giants.<br/><br/>Zombies Types<br/>Slow- These zombies are everywhere...THESE ZOMBIES ARE EVERYWHERE!!<br/>Fast- Its pretty far off. Ill clear that lane first. &lt; famous last words<br/>Hardhat- Straight from the job site these worksafe abiding zombies won't take any damage from headshots.<br/>Giant- Bullets lots of em. Explosions also a lot of those yes. Don't let these guys get too close.", "metacritic": null, "released": "2018-10-05", "tba": false, "updated": "2019-08-28T21:53:02", "background_image": "https://media.rawg.io/media/screenshots/476/4769127d7068ce5fabb0a2da248e4001.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 158, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Palfrey Games"], "genres": ["Simulation"], "publishers": ["Palfrey Games"], "esrb_rating": null}