{"id": 243230, "slug": "happy-dash-in-geometry-world", "name": "Happy Dash in Geometry World", "name_original": "Happy Dash in Geometry World", "description": "The new version of Happy Dash in Geometry World Lite is a dance-themed game that flies in vibrant dash rhythm and extremely intense rhythm. With new levels and background music is extremely exciting to be updated in this version.<br/><br/>Rise up in this world, you have to keep the square jumping forward, your skills and strategy will decide how far you can go. <br/><br/>In this dash game, You have to keep the geometry square jump &amp; dash forward, your skills and strategy will decide how far you can go. Challenge yourself now with Happy Dash in Geometry World Lite, Free!<br/><br/>You are prepared to challenge the new levels in Happy Dash in Geometry World Lite. Difficulty will increase by level so your skill requirements increase to jump, fly, dash and skim through obstacles and obstacles.<br/><br/>This is a simple touch dash game that will keep you entertained for hours but requires a high level of training.<br/><br/>This new full version for new levels, tracks, achievements, online level editor and more!<br/><br/>Game Features of Happy Dash in Geometry World Lite:<br/>• Amazing geometric shapes design, unique and funny sound will make you feel enjoyable.<br/>• Platform based on the rhythm!<br/>• Unlock new icons and colors to customize your character!<br/>• Use practice mode to enhance your skills!<br/>• Graphics and sound are extremely beautiful and vibrant<br/>• The new challenge is extremely difficult<br/>• Fly rockets, flip gravity &amp; a lot more<br/>• Impossible subzero World<br/>• Challenging Meltdown World <br/><br/>Happy Dash in Geometry World Lite is totally free now and forever, so don’t hesitate let’s enjoy Square Dash Jump for Free.<br/><br/>There is no wait and load of new type of game inhibited here. Leave feedback and comments to let our team bring you the best experience. Wish you happy gaming !", "metacritic": null, "released": "2018-09-21", "tba": false, "updated": "2019-10-22T14:14:37", "background_image": "https://media.rawg.io/media/screenshots/bdd/bdd643e6ed60c585a6527bdf040d84db_Hk1py64.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 184, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Royale Gamers"], "genres": ["Racing"], "publishers": ["Royale Gamers"], "esrb_rating": "Everyone 10+"}