{"id": 243354, "slug": "perfect-shift", "name": "Perfect Shift", "name_original": "Perfect Shift", "description": "Due to popular demand, the Perfect Shift game soundtrack can also now be downloaded on iTunes so you can listen to your favourite tunes from the game even when you’re not playing!<br/><br/>«One of few must-have apps for your new tablet and smartphone» - Daily Star <br/><br/>Perfect Shift, the ultimate drag racing game with the best cars, is now available for iOS! <br/>Compete with challengers from around the world in visually stunning 3D race environments!<br/> <br/>Challenge the toughest opponents to race in abandoned tunnels, on deserted city streets and dark industrial areas. Design and upgrade your dream car to improve performance on the strip by purchasing with powerful engines, better tires and making aerodynamic tweaks in your well-equipped 3D garage.<br/> <br/>- Highest quality graphics in breathtaking 3D urban environments with superb sound &amp; light effects<br/>- Race 25 unique cars race through a range of urban settings –  tunnels, city streets and industrial areas<br/>- Challenge your fearless opponents in regular races, club tournaments, challenging daily competitions, ladders and time races to achieve world domination<br/>- Strategically tune your car: upgrade your engine, turbo, gear box, tires, nitro, weight and aerodynamics <br/>- Customize your dream car to your personal taste! <br/> <br/>PLEASE NOTE! This game is free to download but allows you to also purchase virtual items within the app.<br/>_________________________________________________________________<br/> <br/>Perfect Shift is published by LEXTRE Ltd.", "metacritic": null, "released": "2015-02-17", "tba": false, "updated": "2021-04-30T04:43:25", "background_image": "https://media.rawg.io/media/screenshots/47f/47f78eaf7eda4a44d969314c4a466333.jpg", "website": "http://lextre.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 102, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Lextre Rus"], "genres": ["Action", "Racing"], "publishers": ["Lextre RUS OOO"], "esrb_rating": null}