{"id": 243350, "slug": "winter-ski-park-snow-driver", "name": "Winter Ski Park: Snow Driver", "name_original": "Winter Ski Park: Snow Driver", "description": "Huge free-roaming update! Now you can explore the game world at your own pace! Complete new missions each day to earn in-game rewards! Challenges include: perform amazing jumps, stay in the air as long as possible, find a reward hidden on the map and more! Download now and discover all new content!<br/><br/>Explore the great, majestic winter resort, driving on ice-covered roads in a variety of exciting, challenging vehicles! Plow through snow, drift in a rally car, feel the winter air in a snowmobile or try to navigate a big, bulky bus! Plentiful exciting challenges await you!<br/><br/>FEATURES:<br/>▶ PICTURESQUE WINTER LOCALE: Explore the inviting, beautiful resort<br/>▶ DAY AND NIGHT CYCLE: Notice how the environment changes with the time of the day<br/>▶ 10 COOL VEHICLES TO DRIVE: From a small snowmobile to a giant bus with everything in between!<br/>▶ REALISTIC GRAPHICS &amp; EFFECTS: Winter driving has never felt so authentic<br/>▶ 5 AWESOME PREMIUM VEHICLES TO DRIVE IN FREE ROAM!: Try out sports car, truck and the old one!<br/><br/>Winter Ski Park: Snow Driver opens to you an authentic-looking, challenging location to drive around and prove your driving skills in. Start exploring it in your trusty SUV, getting the hang of navigating around the narrow, windy mountain roads. After a bit of practice you’ll be able to advance and try your luck in more demanding vehicles.<br/><br/>In the course of the game you’ll get the chance to try out and drive a myriad of exciting cars. From big to small, in all shapes, sizes and utilities. Each one will pose a different challenge and ask you to learn new skills. A rally car is fast and easy to handle, so you’ll be able to drive fast and drift to cut corners and get to your destination on time. Then to drive a large van or even a bus you will have to teach yourself to be more careful and mindful of your surroundings.<br/><br/>Feel like a tourist and explore this exciting, wondrous winter land at your own pace or put the pedal to the metal and do what you can to beat the record and get the gold trophy for your performance! Whatever your approach, this time spend in the cold will be something to remember!<br/><br/>The whole game area is meticulously crafted with authenticity and a unique mood in mind. Take a journey worth remembering and enter the Winter Ski Park!", "metacritic": null, "released": "2018-03-30", "tba": false, "updated": "2019-12-30T01:53:45", "background_image": "https://media.rawg.io/media/screenshots/987/987359f8c5415a1cd01bfcbe5083bb94_FSkcAzq.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 157, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Play With Games"], "genres": ["Sports", "Racing"], "publishers": ["Play With Games"], "esrb_rating": "Everyone 10+"}