{"id": 243381, "slug": "flip-trickster", "name": "Flip Trickster", "name_original": "Flip Trickster", "description": "Are you ready to flip into action? Jump and land into action but don’t miss the target! Travel through exciting 3D stages, show off your skills, and score a perfect 10! Come experience the number one flipping simulation.<br/><br/>Use your fast reflexes and amazing hand eye coordination in this unique flipping action game. You will need dexterity and laser focus to complete all the unique jumping levels and land in the target! Travel to new worlds. jump off various objects like cliffs, mountains, schools, houses, and many more. Start your adventure now! The one thing you have to ask yourself is: can you get gold on every level?<br/><br/>Game Features:<br/><br/>1. Hardcore Parkour<br/>Gymnasts and acrobats are jealous - they only wish they had the skills of the Flip Trickster. Jump off from the highest mountains and hit your target! Avoid Dangerous objects that interrupt your flips. Make sure you land on your feet otherwise it will be a crash landing!<br/><br/>2. Jump Tuck and Roll<br/>Jump into action! So many ledges to take off from for you to have perfect landings - each level brings their own unique twist! Coordinate your jumping power and then roll as many times as you can to get the highest score possible. The better than landing, the higher the score will be!<br/><br/>3. Amazing Realistic Flipping Physics<br/>No other game will give you the same realistic flipping sensation. Whether its a front flip or back flip, time your jump right to get the right distance and angle. Hold onto that tuck velocity as long as you can and release at the perfect time to stick that landing!<br/><br/>4. Impossible Challenges to complete<br/>More than just levels to beat. Only true flipping legends can complete all of the side quests. And for the insane, the full level challenge! This crazy impossible mode is only for the elite to master.<br/><br/>5. New Skins to enjoy<br/>New colors! New clothing items! Crazy heads and hats. Choose your items and get ready to jump.<br/><br/>6. Endless Worlds<br/>We are constantly adding new levels for you to test your jumping skills. You will NOT want to miss out on the action.<br/><br/>Whether you're a jumper or a flipper, Flip Trickster is a challenge ready for you. This is the best physics flipping game there is. Never miss a dull moment with this easy to learn and easy to play game that is almost IMPOSSIBLE to master. Jump off cliffs. Become a hardcore parkour legend. Start your mission and never stop flipping! Bullseye!<br/><br/><br/>Visit https://lionstudios.cc/contact-us/ if have any feedback, need help on beating a level or have any awesome ideas you would like to see in the game!<br/><br/>From the Studio that brought you Happy Glass, Flip Trickster and Love Balls!<br/><br/>Follow us to get news and updates on Flip Trickster and our other Award Winning titles;<br/>https://lionstudios.cc/<br/>Facebook.com/LionStudios.cc<br/>Instagram.com/LionStudioscc<br/>Twitter.com/LionStudiosCC<br/>Youtube.com/c/LionStudiosCC", "metacritic": null, "released": "2018-02-22", "tba": false, "updated": "2019-07-29T15:29:23", "background_image": "https://media.rawg.io/media/screenshots/8e0/8e0c8a7f406561f35b3e6759a4f8e529_K3DA85l.jpg", "website": "https://www.facebook.com/Flip-Trickster-143873906309115/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 131, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Lion Studios", "Oliver Eriksson"], "genres": ["Simulation", "Sports"], "publishers": ["Lion Studios", "Oliver Eriksson"], "esrb_rating": null}