{"id": 243399, "slug": "blobieio", "name": "blobie.io", "name_original": "blobie.io", "description": "New io game with unique gameplay! Hook your opponents and collect their blobs. Can you become the strongest on the map?<br/><br/>Control your blobie to target and shoot others, loot their remaining and grow your hook to become the strongest! <br/>You start the game with small hook to block or attack others and expand it by hitting other players. In blobleio game, all players have equal chance to win! Even you have a tiny hook, you can defeat others to get on the leaderboard. The bigger player you hit, the higher chance you take your spot in the leaderboard.<br/><br/>Watch out: you can not move during your attack and others can hit you as well if you dont hide. Defend yourself to survive and hook down as many players as possible to become the top player in the game.<br/><br/>FEATURES:<br/><br/>•    No lag. Works on many devices without performance issues. <br/>•    Internet connection is not needed. <br/>•    Smooth control on mobile devices.<br/><br/>WE VALUE YOUR FEEDBACK<br/><br/>From the creators of Landix.io and Twixio, blobieio game is still in development. We will listen you and develop our game according to your feedback and your wishes! Your reviews are important for us! Please send us any feedback.<br/>You can like blobieio on Facebook or follow us on Twitter to be updated about the game.<br/>https://www.facebook.com/blobieio<br/>https://www.twitter.com/blobieio", "metacritic": null, "released": "2017-01-12", "tba": false, "updated": "2019-07-29T17:42:59", "background_image": "https://media.rawg.io/media/screenshots/01b/01bcd20f2d4b57609769526fc11be079.jpg", "website": "http://www.blobie.io", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 53, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["Alictus"], "genres": ["Action", "Strategy"], "publishers": ["ALICTUS YAZILIM EGITIM BILISIM TEKNOLOJILERI ELEKTRONIK SANAYI VE TICARET"], "esrb_rating": null}