{"id": 243348, "slug": "vegas-crime-city-mafia-world", "name": "Vegas Crime City - Mafia World", "name_original": "Vegas Crime City - Mafia World", "description": "Welcome to the Vegas crime city. Vegas gangster city brings you a real street of vegas. Exciting car thief simulator, Rich 3D graphics and special effects. Play a gangster, advance in vegas city. Follow the mission line, evading cops， robbed businessman. you can even use airplanes, helicopters even military tanks to became the most notable gangsters in Vegas! This is an freedom game, that you can do anything in your game. It is a diffcult and Exciting thing that you can do anything that you can not do in your real life.Unlock all the weapons and find secrets hidden on the map, you will get top equipment and hidden Secrets. Sand beaches, great architecture, one of the best tourist city is waiting for you to join the game.<br/><br/>Game Features:<br/>- Rich 3D graphics and special effects.<br/>- Exciting car thief simulator.<br/>- Large map with a dozen of different quests.<br/>- Multiple weapons.<br/>- 0ver 30 varied task to complete, plus dozens of random events to give you hours of fun.<br/>- Storyline with over 30 single player missions.<br/>- A large variety of deadly weapons and ammo!<br/>- store weapons, clothes and special transport improvement +<br/>- Large map with a dozen of different task.<br/>- New weaponry including energy guns and rocket launchers.<br/><br/>Shoot your enemies down and do much more in this grand game.", "metacritic": null, "released": "2018-05-03", "tba": false, "updated": "2019-07-29T16:58:59", "background_image": "https://media.rawg.io/media/screenshots/268/26846f5af1c188b9523146f13875ed34.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 87, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Lin Wu"], "genres": ["Action", "Adventure"], "publishers": ["Lin Wu"], "esrb_rating": null}