{"id": 243320, "slug": "hd-poker-texas-holdem", "name": "HD Poker: Texas Hold’em", "name_original": "HD Poker: Texas Hold’em", "description": "HD Poker - The High Def Poker experience! Crush the competition with the newest FREE poker game.<br/><br/>Welcome to the latest and greatest multiplayer online poker app in the world. Play with friends and compete against opponents across the globe for chips and prizes - win billions and climb the ranks to become a poker champ.<br/><br/>Play Hold'em in a cutting-edge immersive poker app with a huge range of table themes and stakes - play casually or clash with the competition in high stakes games.<br/><br/><br/>FREE CHIPS - Get a welcome bonus of 150,000 FREE chips and 40 FREE gems just for downloading! Collect a bonus every 4 hours and keep your streak going to win a daily Bonus Chest!<br/><br/>CUSTOMIZE - Create your own HD Poker experience - choose your character from over 100 Avatars and vote for your favorite table theme.<br/><br/>COLLECT AND TRADE - Win Gems for completing Achievements, then use them on in-game content! Collect, Trade with friends, and open Chests to expand your inventory and further customize your experience.<br/><br/>LEADERBOARD - Compete with players across the globe in HD Poker's unique ranking system. Win trophies for winning hands and playing skillful poker. Rank up to earn better Rewards!<br/><br/>PLAY WITH YOUR FRIENDS - Recruit your friends to the HD Poker app and earn extra chips and gems! Invite friends to join your table - play poker, trade, chat, send gifts, and have fun!<br/><br/>JACKPOTS - Have a chance to win millions or even billions of chips by hitting a Royal Flush or triggering the Bad Beat Jackpot!<br/><br/>SIDE GAMES - Find tickets in chests or purchase them in the store with Gems, then play Side Games and win bonus prizes! Spin the Super Mega Wheel and win millions!<br/><br/>MULTI PLATFORM - Play our casino app on any platform – desktop, mobile, and web.<br/><br/>NEW CONTENT - The HD Poker app offers an immersive casino world with new content being released all the time. Have a cool idea that you want to share with us? Drop us some feedback using the in-game Help system.<br/><br/>WE’D LOVE YOUR FEEDBACK! - Connect with us on Facebook and Twitter:<br/>Facebook: http://poker.hd.io/fanpage<br/>Twitter: http://poker.hd.io/twitter<br/><br/><br/>DISCLAIMER - This game is intended for an adult audience (18+) for amusement purposes only and does not offer 'real money' gambling. The game is free to play; however, in-app purchases are available for additional content and in-game currency. Practice or success at social casino gaming does not imply future success at real money gambling.", "metacritic": null, "released": "2018-09-20", "tba": false, "updated": "2019-10-22T13:53:15", "background_image": "https://media.rawg.io/media/screenshots/1f3/1f3d0d53a63574f7e0d1d2b46a671d48.jpg", "website": "http://www.hdpoker.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 288, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Z4"], "genres": ["Strategy", "Card"], "publishers": ["Z4 Poker"], "esrb_rating": "Teen"}