{"id": 24340, "slug": "fluidity", "name": "Fluidity", "name_original": "Fluidity", "description": "<p>\n      Use intuitive controls to guide a pool of water on a journey to save a \n      magical book from the evil Influence.\n    </p><p>\n      A magical illustrated encyclopedia, Aquaticus, has been tainted by a \n      vial of evil ink called the Influence. You, as a pool of water that can \n      take on other forms of ice and steam, must overcome obstacles scattered \n      across the pages of Aquaticus and save it from the corruptive Influence. \n      Tilt or twist your Wii Remote controller to use the various forms and \n      properties of water on your free-flowing journey through Aquaticus, \n      where every page has multiple panels and illustrations that have come to \n      life. Tackle problems and defeat enemies to reveal magical Rainbow \n      Drops, each of which restores some of Aquaticus’ power and allows it to \n      open more chapters and grant you new powers. These additional powers, \n      such as sticking to objects as a block of ice or shooting bolts of \n      lightning as a steam cloud, will be needed to win the day and destroy \n      the Influence and its minions. Along the way, you can also test your \n      ingenuity and reflexes by finding hidden puzzle pieces. These unlock \n      playrooms that give you the opportunity to use the skills you’ve learned \n      and dare you to race against the clock to beat as many challenges as \n      possible. These challenges won’t affect your quest to restore Aquaticus’ \n      powers, but everyone needs a break now and again, right? Fluidity offers \n      the chance to slosh and slide your way through an imaginative \n      environment, filled with challenging adventures, using intuitive play \n      control. Are you ready to dive into this unique experience and save the \n      day?\n    </p>", "metacritic": null, "released": "2010-12-06", "tba": false, "updated": "2022-11-10T23:09:27", "background_image": "https://media.rawg.io/media/screenshots/454/454a6772db7af65956ea3d80b93a35b2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 6, "toplay": 2, "dropped": 3}, "playtime": 3, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 264, "game_series_count": 0, "reviews_count": 1, "platforms": ["Wii"], "developers": [], "genres": [], "publishers": ["Nintendo"], "esrb_rating": null}