{"id": 243403, "slug": "facepunchio-boxing-arena", "name": "Facepunch.io Boxing Arena", "name_original": "Facepunch.io Boxing Arena", "description": "Clown Games by Alictus presents the new smash hit io game: FacePunch.io Boxing Arena. Step onto the ring to knock out all champions with your brutal punches for real boxing experience in io game universe!<br/><br/>BECOME A CHALLENGER BOXER NOW! Attack with fierce face punches and combos to knock out others. Can you become the champion fighter of the boxing io game arena?<br/><br/>EASY IO GAME CONTROLS! Smash everyone with your hits and make combos to knockout with only one button in the world of fighting!<br/><br/>ULTIMATE FIGHTER SKILLS! Each hero has different special move to use in epic combat to knock out other fighting boxers.<br/><br/>POW! BAM! SMASH! KNOCKOUT! Join the marvelous fighting sports club of facepunch.io boxing arena with your champion boxer to use your brutal fighter punches and quick reflexes to attack others!<br/><br/>COLLECTIBLES! Achieve objectives to unlock amazing heroes with skills and skins! Step onto the classical fighting ring with your favorite hero to survive the longest, make maximum combos or a great number of knockouts! <br/><br/>The creator of popular io games like Landix.io, Twix.io, Blobie.io, Shooters.io, Fisp.io, Pikes.io, Goons.io presents FacePunch.io Boxing Arena now. Play when you are online and offline with rest of the world. <br/><br/>Please send us any feedback:<br/>https://www.facebook.com/facepunchio<br/>https://twitter.com/facepunchio<br/><br/>Subscribe Clown Games Youtube Channel for more games:<br/>https://www.youtube.com/clowngames", "metacritic": null, "released": "2017-12-06", "tba": false, "updated": "2019-07-29T17:43:06", "background_image": "https://media.rawg.io/media/screenshots/a3c/a3ca174b9ff04173db3be3aa92335712_l9trP1n.jpg", "website": "http://facepunch.io", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 67, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Alictus"], "genres": ["Action", "Arcade", "Casual"], "publishers": ["ALICTUS YAZILIM EGITIM BILISIM TEKNOLOJILERI ELEKTRONIK SANAYI VE TICARET"], "esrb_rating": null}