{"id": 243472, "slug": "pravda-ili-deistvie", "name": "Правда или действие!!", "name_original": "Правда или действие!!", "description": "Welcome to the free original popular \"Truth or Dare\" game!<br/>Truth or Dare App is a classic game like \"Spin the Bottle\" which involves either answering a question or doing a dare - something fun.<br/>To play Truth or Dares you should know some basic rules. First of all, you need more than one players. The minimum is two players, but we recommend you to have at least 3 players.<br/>To begin this party game all players need to sit into a circle or around the table depends on your situation. All players must feel comfortable and all other people (who don’t play Truth or Dare) should leave a room.<br/> Truth means a questions about his life, intimate things or other interesting for players question which should be answered without lie. <br/>Dare means a funny or hard to do task.<br/>Truth or dare is very good game for parties, it has no winners and losers (except those who were dropped out from game because of lot of penalties).<br/>Before starting Truth or dare you can choose a category in Settings menu and levels in Game screen.<br/>For children the best level is +0. For teenagers the best levels are +12, +16 which contents teenagers stuff like fist kiss questions or kissing dares. Category +18 contents alcohol drinking, intimate questions and sexy dares, so it is not suitable for younger people.", "metacritic": null, "released": "2016-01-26", "tba": false, "updated": "2019-10-22T14:14:45", "background_image": "https://media.rawg.io/media/screenshots/376/3768a9b08f38685a04f5bc3e2ff060be.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 5}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 26, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Rustam Zaripov"], "genres": ["Board Games", "Family"], "publishers": ["Rustam Zaripov"], "esrb_rating": "Mature"}