{"id": 243412, "slug": "rise-of-civilization", "name": "Rise of Civilization", "name_original": "Rise of Civilization", "description": "Only Strategy mobile game with real time strategy tactics, adventures and profound strategy game mechanics. Real time PVP battles visualization.  COLLECT, BUILD, Defend, ATTACK and eventually become king of kings in this clans war. <br/><br/>Ever thought of becoming a Warlord of the World?  You are not the only ones with eyes on the Throne. Other clans are thinking to win it. What are you waiting for? Get ready for next stage of Clash of civilizations. Deploy your Army along with the Allies to dominate the world. Clash of civilization is at edge to start. Mark your civilization’s impact on the history.  Real time Strategy Warfare Game with unique 3D realistic and Idle heroes from favorite Civilizations of your choice. This is Empire of Lords ensnared in a battle of war. Who will be the King of Kings in this combat of rising Kings?<br/><br/>It would be bloody. Are you up for this clash of kings, my Lord? <br/><br/>Crown is waiting for the courageous Lord.<br/>End the War before War ends you by deploying Army in advance with Allies to annihilate opponent troops to win the throne. Be always ahead of one step in Strategy by building castles, large amount of food supply storage for your Empire, bulking up your Armies and take the lead in this war of civilizations for building fantasy world of your dreams. Clans’ war predominantly will be prevailing, only way to survive is to device strategy which must lead to total success. <br/>And remember: he who dares, wins!<br/><br/>Features: <br/>-Strategy-<br/>Your thirst of Strategy is fulfilled: Train an Army of loyal soldiers, construct evasive traps and raid your enemies into nirvana. <br/><br/>-Building-<br/>Building! Grow and construct an Empire strong enough to survive in an ever evolving rise of civilization. <br/><br/>-Battle-<br/>Raid! Fierce attack with your own handpicked army and alliances to continue building new civilization. Conquer the world and feel the pleasure of domination and victory. <br/><br/>-Relic System-<br/>Get rewards! Relics collection, develop research and development academy to advance the army equipment. Ensure total destruction of enemy.<br/><br/>-PVE- <br/>PVE raid system, battle raid gangs through alliance cooperation. Rally PVP battle among alliances. <br/><br/>Strategy game with massive clash of civilizations and ensue of new rise of civilization, all in your hand to tackle with. <br/><br/>Narrative Fantasy! Domination of world expedition still beefing up. Stunning 3D Idle Heroes and HD graphics to relish. Start playing now the King of online massive strategy game, Rise of Civilization. <br/><br/>Facebook fanpage:<br/>https://www.facebook.com/RiseofCivilization/<br/><br/>Youtube fanpage:<br/>https://goo.gl/79H65o", "metacritic": null, "released": "2018-06-18", "tba": false, "updated": "2019-10-22T14:14:44", "background_image": "https://media.rawg.io/media/screenshots/2ca/2ca6aec595dec17545990bfa47bef263_rhfW8JJ.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 277, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Colorful Entertainment"], "genres": ["Strategy", "Simulation"], "publishers": ["Colorful Entertainment"], "esrb_rating": "Teen"}