{"id": 243522, "slug": "remote-chess", "name": "Remote Chess", "name_original": "Remote Chess", "description": "This is the classic Chess game, designed to be played by two remote players, using two network connected iPads. The players can be in different places, towns, and even different countries.<br/><br/>The general rules are well known, so they will not be repeated here. <br/>Only application specific features are exposed.<br/><br/>One player will deal with white pieces, and will see the chessboard from his white side; the opponent will deal with black pieces, ad will see the chessboard on the opposite side.<br/><br/>Once both players have started a game, the white move first.<br/>When it's your turn to make a move, you will see a disk of your color on the upper left corner of the screen, and the prompt: \"Make your move\" on the upper side.<br/><br/>When it's the opponent's turn to move, you will be prompted to \"Wait for opponent's move\" and a disk of the opposite color will be shown on the screen.<br/><br/>To move a piece you must touch it, drag it to the destination cell, and release it. If the move is valid, you will hear a 'tok' sound, and the moved piece will take place in the new seat; the move will be transmitted to your opponent's device, and will be automatically executed on his board, too. Then, the move turn is passed to the opponent.<br/><br/>So, both players will always see the same piece distribution, exactly as they were playing on opposite sides of the same board.<br/><br/>The move transmission time can vary, depending on the quality of the network connection, from a fraction of second to some seconds.<br/><br/>If you make an invalid move, the piece will automatically be brought to its starting place, and you have to try a different move.<br/><br/>If you want to castle, you have to move your king two steps aside (left or right);  if the castling is valid, the rook will be automatically moved to the other side of the king.<br/><br/>If a pawn reaches the opponent's base row, it is not possible to choose the type of promotion: it is immediately and automatically promoted to Queen. <br/><br/>If your move exposes your king to check, the move is automatically canceled as invalid.<br/><br/>If the opponent's move threatens your king, you are alerted: \"CHECK TO THE KING !\".<br/><br/>If you realize that your game is lost, and you haven't more valid moves, you can close it,  pressing the \"End Game\" button. You will be prompted to confirm, and in this case your opponent will be informed; both chessboards will be reset for a new game.", "metacritic": null, "released": "2014-01-13", "tba": false, "updated": "2019-10-22T14:14:48", "background_image": "https://media.rawg.io/media/screenshots/f6d/f6d334109fc4fc2b63eb194d9261b7d8_nhbmEsq.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 9, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Luigi Fonti"], "genres": ["Strategy", "Board Games"], "publishers": ["Luigi Fonti"], "esrb_rating": null}