{"id": 243622, "slug": "monster-fly-saga-christmas-edition-most-popular-ca", "name": "Monster Fly Saga Christmas Edition-Most popular candy or star casual game", "name_original": "Monster Fly Saga Christmas Edition-Most popular candy or star casual game", "description": "A funny festival casual game,  Collect energy to help monster fly back to her home.<br/><br/><br/>Monster Buster Saga is a funny Christmas festival casual game. <br/>Celebrate this holiday season with the new Christmas theme and Santa Claus character.The game have a very simple controls, just tap with colorful and fun animation.<br/>Aim the energy coins and shoot it down to collect it.<br/>Collect battery and help the cute monster to fly up.<br/><br/><br/>STORY:<br/>During this Christmas, A monster come to our earth, she was lost in the game. Her aircraft is no power, so you should help her to collect energy from 6 chapter: Village, Prairie, Forest, Iceberg,Desert,Ocean. Collect all the power and the cute monster will fly back home, you can also have a good Christmas.<br/><br/>FEATURE:<br/>- Easy to play but hard to master.<br/>- Beautiful sound effect and wonderful scene.<br/>- Christmas color and Christmas music.<br/>- Cute monster character with the mega jump ability.<br/>- Very addictive gameplay, once you start, you can't put it down.<br/>- 6 Different Chapter scene to collect energy  with Christmas color.<br/><br/>Play this game FREE with NO any in-app purchase. <br/>If you love our game, please give us a 5 star, thank you for your appreciation.", "metacritic": null, "released": "2015-12-22", "tba": false, "updated": "2019-10-22T14:14:53", "background_image": "https://media.rawg.io/media/screenshots/aa6/aa619d57849b56b2bd5b91c2f156d868_OacunKn.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 101, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["JuYing Yu"], "genres": ["Strategy"], "publishers": ["JuYing Yu"], "esrb_rating": "Everyone 10+"}