{"id": 243635, "slug": "car-x-traffic-tour-uphill-pro", "name": "Car X Traffic Tour Uphill Pro", "name_original": "Car X Traffic Tour Uphill Pro", "description": "Car X Traffic Tour Uphill Rush is a milestone in the genre of endless arcade racing. Drive and Overtake your car through highway traffic, earn cash, upgrade your car and buy new ones. Try to be one of the fastest Racer in the global leaderboards. Endless racing is now redefined!<br/><br/>Car X Traffic Tour Uphill Rush defines the mobile standards of infinite arcade type racing games. Based on racing and overtaking vehicles both in city and highway traffic, this game features enjoyable modes of racing: carrier mode, infinite mode, against-time mode and Endless mode . You can choose between one-way and two-way traffic and choose your favourite racer Car. <br/><br/>This Racing in Car is the best mobile racing game you have been looking for. You drive your car in cockpit view through the endless traffic and realistic environment. Tilt your device to drag your car wherever you want, overtake traffic, earn coins and buy new cars. and become Fast Racer Driver.<br/><br/>Try this limit racing game. Once you join the game, you will be addicted to this extreme racing game. Street Racing Game Have Fun Drive fast car driving make drifts on clear asphalt roads. Random racers , try Racing Car , cross other cars and win this race but you have to race in car with high speed, Are ready for this Racing Game?<br/><br/>-DRIVING PHYSICS: All cars in Traffic Racing have realistic power, torque and gear ratios. The acceleration process and top speeds are based on a complete simulation. Vehicle body weight, gear ratios, engine power and torque ratios are all taken into account.<br/><br/>-TUNINGS AND UPGRADES: You can customize your car by changing gear ratios, ride heights and wheel camber angles. You can upgrade your engine, brakes, and handling for better performance. Several body and rim colors are also available for you to choose.<br/><br/>-REALISTIC GRAPHICS: Racing Limits features lots of optimizations on very high detail and realistic graphics. <br/><br/>-LOTS OF RACE EVENTS: You will never get bored while playing this Racing Limits Game. It has lots of carrier mode levels, race tracks and different game modes. <br/><br/>Traffic Racing Limits - Overtake Car Racer will be updated constantly. Please rate and give your feedback for further improvement of the game. we are really appreciate your feedback.", "metacritic": null, "released": "2018-07-08", "tba": false, "updated": "2019-10-22T14:14:53", "background_image": "https://media.rawg.io/media/screenshots/020/020017fa0487caa8ef94193f0e033376.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 157, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Shoaib Sheikh"], "genres": ["Simulation", "Sports", "Racing"], "publishers": ["Shoaib Sheikh"], "esrb_rating": "Everyone 10+"}