{"id": 243619, "slug": "city-car-wash-gas-station-paid", "name": "City Car Wash Gas Station Paid", "name_original": "City Car Wash Gas Station Paid", "description": "Enjoy the latest Dusty Car Cleaner Wash station and new car wash garage 3D game. Luxurious car service station game will give you enough chance to master you're driving and parking skills. <br/><br/>In this realistic city environment you have to drive multiple muscles cars towards the petrol pump where Your car will be washed by the service men. There are multiple portions in this station like car washing and repairing garage. You can get your car repair at very low cost. <br/><br/>This is an excellent game if you want to play a service station game with Latest mission cars. First of all you have to collect a brand new car from our car stand. Your mission starts with driving and ends with parking. In this driving addictive game your task is ride carefully your favorite sporty car on extreme high way road with Huge traffic rush. If you crash any hurdles, obstacles, barriers and oncoming car your car will be damaged then, you can drive car fast and park on service station and repair it. <br/><br/><br/>You have to be very careful whil E over taking the other vehicles going to the service station of this town. There are multiple camera angles to help you locate your car position accurate. Control your car with a steering wheel, Tile Or buttons, acceleration and brake pedals.", "metacritic": null, "released": "2018-04-11", "tba": false, "updated": "2019-10-22T14:14:52", "background_image": "https://media.rawg.io/media/screenshots/86a/86ab4316fb4fa52200db85a35eb85565_QEHgI9s.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 123, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Shoaib Sheikh"], "genres": ["Strategy", "Simulation"], "publishers": ["Shoaib Sheikh"], "esrb_rating": null}