{"id": 243753, "slug": "disillusions-manga-horror-free", "name": "Disillusions - Manga Horror Free", "name_original": "Disillusions - Manga Horror Free", "description": "First person horror story, manga character art, 3D visuals and multiplayer.<br/><br/>• Explore in first person to proceed in the horror story. <br/>• Featuring 2D anime manga style character art and 3D environments. <br/>• Control two characters, DiS and Sui, see how their story connects. <br/>• Dark, gritty surroundings and eerie audio effects for atmospheric gameplay. <br/>• Retro indie horror, with a story to kill for. <br/>• Sandbox multiplayer, place traps, chat and scare other players!<br/>• Exploring, trap and chat in all 4 chapters with the multiplayer! <br/><br/><br/>- DiS and Vigil are two friends who visit the haunted residence the newspapers have been covering recently. Unbeknownst to them, however, the place is not as abandoned as the press makes out... <br/>- Be drawn into exploring the mysterious past of the psychotic murderer who once called the place home?<br/>Visit the original crime scene with Police girl Sui, solve and see how she is involved with the story! Has she been hiding something, are DiS, Sui and Vigil connected somehow?<br/><br/>Get the full version for all chapters!<br/><br/>- Parents -<br/>The games chat is censored and partially monitored, but this does not stop some children from trying to say bad language. Lots of players have already been banned, and it is likely more will continue to be. Please be aware of this. Thank you.", "metacritic": null, "released": "2013-04-30", "tba": false, "updated": "2019-10-22T14:14:59", "background_image": "https://media.rawg.io/media/screenshots/e79/e79c21fb07a76185ad9226be558cf190.jpg", "website": "https://www.youtube.com/watch?v=OEFSxMRErc4", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 214, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["StephenAllen"], "genres": ["Action", "Adventure"], "publishers": ["Stephen Allen"], "esrb_rating": "Teen"}