{"id": 243747, "slug": "hill-cliff-horse-online", "name": "Hill Cliff Horse - Online", "name_original": "Hill Cliff Horse - Online", "description": "Online Multiplayer, Chat, Role play, and Ragdoll with friends and players around the world !<br/><br/>- Talk to Horse NPC’s scattered around the maps to dress up your character, crazy combinations available!<br/>Such as: Dragon and Pegasus wings, Beach ball suit, Wolf masks, Polka dot paints, Zombie, Donkey and Ghost skins, miniature pony and Giant Stallion Horse sizes, Antlers, Sunglasses, Balloons, Unicorn Horns and lots more!<br/><br/>- Trot, Canter, Gallop, Jump and Ragdoll in big Beautiful maps.<br/>(beach, castle, igloo, farm, graveyard, city, meadow, forest, campsite, hurdles and more!<br/>New: Latest map includes a King of the Hill mini game, dominate the hill for the Crown!<br/><br/>- Flip, flop and drop with the Hilarious Ragdoll Physics button!<br/>Press ragdoll faster to get x1 x2 or x3 boosts.<br/><br/>- Activate Mods for extra features like Low gravity, Horror spotlight, Snow effects, Mega Ragdoll and Anime Mode!<br/><br/>- First Person Camera button lets you see through your horses Eyes, even in Ragdoll and Pose mode!<br/><br/>- Chat to other players, you can choose and decorate your own name and font colours!<br/><br/>• Mac Manes<br/>• Chestnut Colours<br/>• Mia Paints<br/>• Peanut Sizes<br/>• Oreo Extras<br/>• Sandy Shoes<br/>• Willow Leg wraps<br/>• Misty Themes<br/>• Charlie Hats<br/>• Maddy Masks<br/>• Toffee Trails<br/>• Harvey Herds<br/>• Daisy Names<br/>• Bonnie Mods<br/><br/>Chat and names are Censored and Monitored, players trying to use bad language be banned from all my games, you have been warned!<br/><br/>Created and run by one person, thanks for playing and supporting me! ^_^ - Developer Ste.<br/><br/><br/>\"Parental gates are used in apps targeted towards kids to prevent them from engaging in commerce or following links out of an app to websites, social networks, or other apps without the knowledge of their parent or guardian. A parental gate presents an adult level task which must be completed in order to continue.\"", "metacritic": null, "released": "2014-06-15", "tba": false, "updated": "2019-10-22T14:14:59", "background_image": "https://media.rawg.io/media/screenshots/743/74304bf922aa7e8520829645523ae503_2YKlYph.jpg", "website": "http://www.stephenallengames.co.uk/games.php#hillcliffhorse", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 252, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["StephenAllen"], "genres": ["RPG", "Simulation"], "publishers": ["Stephen Allen"], "esrb_rating": "Everyone 10+"}