{"id": 243849, "slug": "fixies-coloring-pages-paint-with-finger-in-book", "name": "Fixies Coloring Pages: Paint with Finger in book!", "name_original": "Fixies Coloring Pages: Paint with Finger in book!", "description": "Coloring books for kids with funny characters \"The Fixies\"!<br/>The Fixies are small creatures that live in your home appliances and fix them! To know more about them - check more of our games or watch the cartoon!<br/>In this coloring app you will find the most hilarious cartoon moments, a lot of painting possibilities and a huge color palette!<br/><br/>The app is suitable even for little kids, because all coloring tools and colors are easy at use. For kids older there is a big choice of colors on palette. <br/>APP FEATURES:<br/>- Educational process (at easy use kids will learn to draw carefully and to match colors)<br/>- Funny unique characters The Fixies<br/>- Many albums with different characters (open them all)<br/>- A big choice of colors and tools<br/>- Save your pictures on your device and share with friends!<br/><br/>This app is not only fun and joy for kids but also an educational process in drawing, ocean of creativity and imagination development. <br/>All apps of DevGame Studio are educational and aimed for kids development and growth. Try them all and make sure of this! Relax for mothers and fun for kids! <br/><br/>Download and color it all! <br/>If you have any suggestions do not hesitate to let us know!<br/>Email: contact.devgame@gmail.com<br/>Website: http://devgamestudio.com/", "metacritic": null, "released": "2017-03-09", "tba": false, "updated": "2019-10-22T14:15:02", "background_image": "https://media.rawg.io/media/screenshots/9dc/9dce81864ce3baaf2101cf1e1f9856f4.jpg", "website": "http://devgamestudio.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 98, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["DEVGAME OU"], "genres": ["Family"], "publishers": ["DevGame OU"], "esrb_rating": "Everyone 10+"}