{"id": 243850, "slug": "bubble-bust-hd-pop-shooter", "name": "Bubble Bust! HD - Pop Shooter", "name_original": "Bubble Bust! HD - Pop Shooter", "description": "Bubble Bust! has exceeded all our expectations and now over 25 MILLION people around the world are playing the game! Thank you all for your support! <br/><br/>- \"From the second I started playing, I couldn't put it down until I completed it. Literally. Bubble Bust! is a top-quality, highly-addictive puzzle game.\" <br/>-- App Unwrapper: 4.5/5 <br/><br/>- \"Bubble Bust just might be one of those addictive match three games that will surprise you... can be easily grasped within the first level or two, but ends up being very addictive. The game features a bright and enjoyable presentation package as well.\" <br/>-- 148Apps.com \"POPPING GOOD\" <br/><br/>Some player reviews: <br/><br/>- \"WOW!!! I've seen a lot of games like this but this is by far the best one out there, stunning visuals and intense gameplay\" - 5 star review <br/><br/>- \"I LOVE THIS GAME! I've played other bubble type games but this one is fantastic! I love the way everything moves, the graphics, the game itself! - 5 star review <br/><br/>- \"Premium Bubble Popping Game! 5 Star game without a doubt. This is more than just a bubble popping game. Beautifully made and controls are excellent.\" - 5 star review <br/><br/>- \"The best bubble burst type game out and I've played them all!\" - 5 star review <br/><br/>Bubble Bust! is an amazing bubble-shooter game featuring addictive gameplay and tons of exciting new bubbles and power ups! <br/><br/>The game is easy to play - clear the marbles and bust the hidden key bubble - yet incredibly fun and challenging! <br/><br/>FEATURES: <br/>* Many FREE levels + 490 purchasable levels of serious bubble-popping fun <br/>* Exciting new bubbles and power ups <br/>* High quality graphics with Retina display support <br/>* Game Center Leaderboards <br/>* 38 Awesome Achievements (Local and Game Center) <br/>* Breathtaking visual effects <br/>* Realistic game physics <br/>* Captivating arcade inspired music <br/>* Accurate controls, with two ways to shoot <br/>* Global high scores let you compete against players from around the world <br/>* Three star ranking system <br/>* Tracks today’s and personal records for each level <br/>* Excellent replay value <br/>* Colorblind mode <br/>* and much much more… <br/><br/>HOW TO PLAY: <br/>Your goal is to clear the marbles and bust the hidden key bubble. Clear the marbles by making groups of the same color. Groups of three or more marbles of the same color will fall down. If the marbles cross the glowing line at the bottom of the screen, the game is over. <br/><br/>CONTROLS: <br/>Simply tap a marble on the game board, or an empty spot close to it, to fire a marble towards that spot. To fine tune your shot, slide your finger left and right anywhere on the screen to first set the direction, then release your finger to launch the marble. <br/><br/>Please support us by rating and reviewing the game. <br/><br/>Game On! :)<br/><br/>Follow us on Facebook:<br/>http://www.facebook.com/GameOnArcade<br/><br/>Developed and published by GameOn<br/>http://www.gameonarcade.com", "metacritic": null, "released": "2012-06-28", "tba": false, "updated": "2019-10-22T14:15:02", "background_image": "https://media.rawg.io/media/screenshots/f62/f624fe98824377f4af1c8f99be38ad5f.jpg", "website": "https://www.GameOnArcade.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 54, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["GOES International"], "genres": ["Arcade", "Board Games", "Casual"], "publishers": ["GOES International"], "esrb_rating": null}