{"id": 243834, "slug": "fixies-kids-learning-games-for-smart-babies-apps", "name": "FIXIES KIDS: Learning Games for Smart Babies Apps", "name_original": "FIXIES KIDS: Learning Games for Smart Babies Apps", "description": "How to tell your kid about the world around? Through playing!<br/>\"Fixies Kids\" is a child growth and development game where kids will explore the world in the gameplay!<br/>The world around us and even a single room in the house are full of different things! We know everything about them but toddlers still don't! This app is a great way for you to show and explain your babies everything!<br/><br/>There are helpers in the app named The Fixies, who will lead kids though the app with voice and sounds!<br/>Kids will learn:<br/>- What appliances are there in the kitchen and what do they do (your kid will see what the oven is needed for)<br/>- What sounds do the musical instruments make (and what do they look like!)<br/>- How to take care of pets (and what to feed a parrot with!)<br/>- What do we need the tools for (kids will be good at helping their dads with repairing afterwards)<br/><br/>After exploring children can play games and solidify their new knowledge! The app is made specially for kids and their parents to make the way of learning easier and more fun! <br/><br/>Download and let's learn together!<br/><br/>Our email is always open for you suggestions:<br/>contact.devgame@gmail.com<br/>Our website: http://devgamestudio.com/", "metacritic": null, "released": "2016-10-27", "tba": false, "updated": "2019-10-22T14:09:14", "background_image": "https://media.rawg.io/media/screenshots/ff6/ff6ff7362c75901ede2945f307fc39a6.jpg", "website": "http://devgamestudio.com/main/privacy-policy/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 64, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["DEVGAME OU"], "genres": ["Family"], "publishers": ["DevGame OU"], "esrb_rating": "Everyone 10+"}