{"id": 243996, "slug": "pony-dash-pro", "name": "Pony Dash Pro", "name_original": "Pony Dash Pro", "description": "Pony Dash Pro is one entertaining and addictive dash kids pony game for you child offering to gallop with a cute pony and avoid the obstacles on the way. Build your child's concentration and enjoy completely entertaining kid friendly adventure. <br/><br/>SCENIC DESIGN AND EXCITING MUSIC<br/>If your kid loves ponies and likes playing tap games on iPhone, this pony game is the perfect choice for him. This tapper game is offering your kid endless fun and entertainment while galloping with the cute pony around the beautiful scenic backdrop. Also, while playing your kid is offered to listen the exciting background music on this pony run gameplay. High-quality and colorful designs, suitable for all kids. <br/><br/>ENTERTAINING GAMEPLAY FOR KIDS<br/>Playing this pony game, your kid will be able to build up concentration while having fun and enjoying the pony run. The task on this tapper game is simple, your kid will only have to tap on the screen to start galloping and trotting the pony while avoiding the obstacles on the way. Just tap and run, let the pony breeze past the hurdles so that it does not lose its life. Increase concentration while letting your kid enjoy this pony game. <br/><br/>LIMITLESS SCORING OPTIONS<br/>For non-stop kids entertainment, the game allows the child to run with the pony avoiding obstacles and collecting points along the way. The pace of the pony dash will make your child happy and eager to play.  With the limitless scoring options on this pony run game, your kid will have endless fun playing it while building his concentration. <br/><br/>PONY DASH PRO FEATURES<br/>- High-quality scenic backdrop <br/>- Cute pony and exciting music <br/>- Builds your child's concentration <br/>- Easy and entertaining gameplay <br/>- Dash, jump, tap and avoid obstacles and collect points<br/>- Limitless scoring options <br/>--------------------<br/>Build your kid's concentrations with letting him gallop the pony around the exciting scenery. <br/>Download it now on App Store.", "metacritic": null, "released": "2013-01-30", "tba": false, "updated": "2019-10-22T14:15:08", "background_image": "https://media.rawg.io/media/screenshots/c89/c89c549787972e3051829aae2e6cf1f1.jpg", "website": "http://klapedu.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 110, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS"], "developers": ["Klap Edutainment"], "genres": [], "publishers": ["Klap Edutainment"], "esrb_rating": "Everyone 10+"}