{"id": 244000, "slug": "kids-preschool-game-box-pro", "name": "Kids Preschool Game Box Pro", "name_original": "Kids Preschool Game Box Pro", "description": "Preschool Game Box is a great combination of educational games for children in a single series!<br/>Toddlers and older children alike can learn while having fun with the amazing and fun educational<br/>games in this series. Teach your kids all about numbers, alphabets, colors, puzzles, picture match,<br/>and much more!<br/><br/>~ VARIETY OF TODDLER LEARNING GAMES<br/>Kids will enjoy a huge variety of learning games in this app, like Coloring apps, Jigsaw Puzzles,<br/>Counting, Alphabets Trainer, Dots with Tots, Easy Crafts, Match &amp; Learn, Pony Dash and Mole<br/>Hunter game. There are endless hours of learning for your child with preschool learning games made<br/>for Counting and Alphabets Trainer. Increase your child’s concentration with fun educational games<br/>such as Jigsaw, Dots with Tots and Match and Learn. Unleash his/her creativity with learning games<br/>like Coloring and Easy Craft or take him on a giggly adventure with Pony Dash and Mole Hunter!<br/><br/>~ GREAT FOR BRAIN DEVELOPMENT &amp; TRAINING<br/>The wonderful animation, soothing sounds and professional studio recorded voices will add to your<br/>children’s delight and keep him engaged. Children will love the cute characters and life like objects in<br/>these educational games. You can be a part of your kid’s amazing world and lead him to new<br/>discoveries with Jumpstart Kids: 9-In- 1 Learn with Fun Series.<br/><br/>~ PREESCHOOL GAME BOX FEATURES<br/>- Learn with fun educational games<br/>- Perfect for toddlers and preschoolers<br/>- 9 different kids learning games<br/>- Learn numbers, alphabets, and colors<br/>- Improve concentration with jigsaw, dots and matching<br/>- Be creative with colors and crafts<br/>- Enjoy adventurous learning games with cute characters and life like objects<br/>- Great animations and soothing sounds<br/><br/>Go ahead and bring a smile on your kid’s face! Have hours of fun and learn at the same time with<br/>these awesome educational games!", "metacritic": null, "released": "2013-03-28", "tba": false, "updated": "2019-10-22T14:15:08", "background_image": "https://media.rawg.io/media/screenshots/48f/48fe33c2ecbb7b79586f48e82b583c2a.jpg", "website": "http://klapedu.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 70, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS"], "developers": ["Klap Edutainment"], "genres": [], "publishers": ["Klap Edutainment"], "esrb_rating": "Everyone 10+"}