{"id": 244029, "slug": "metalwars-hd-lite", "name": "MetalWars HD Lite", "name_original": "MetalWars HD Lite", "description": "The best machine action game : MetalWars HD<br/><br/>*** Our new game MetalWars3 is now available! ***<br/><br/>*TOP 100(GAMES) - Japan<br/><br/>Metal Wars is Full 3D Shooting Game that attacks and destroys enemies while upgrading to various parts of bots and using variety of weapons.<br/>Not only can you destroy enemies on your own but can also be played alongside other players<br/>You can create your own machine by assembling parts and weapons that you earn from each stage.<br/><br/>Playing this game is simple.<br/>Control using the two joy pads. Left pad is for moving and the right pad is for aiming and shooting.<br/>Touch the right pad lightly to move the player’s view and if you hold down the touch, the weapon will be fire.<br/>You can choose different weapons according to different situations.<br/>There are 3 commands on the left-hand side of the screen you can use towards your fellow players <br/>As you clear each stage, more powerful weapons and new parts will be given to the player.<br/>You can clear difficult stages easily playing alongside with your fellow players.<br/><br/>Features:<br/>-New Full 3D Graphic<br/>-Introduced Physics Engine<br/>-Various Particle Effects<br/>-Variety types of AI types<br/>-Transformation of weapons and parts<br/>-Over 12 different weapons<br/>-Over 20 different parts<br/><br/>---------------------------------------------<br/>More games from Goorusoft<br/><br/>-BoxMan Rising  <br/>-WarShip<br/>-MetalWars2:Revolution <br/>---------------------------------------------<br/><br/>Features:<br/>フル3Dのグラフィック<br/>物理エンジンの導入<br/>様々なparticle effect<br/>様々な人工知能<br/>武器とパーツにより外見が変化する<br/>12種以上の武器 <br/>20種以上のパーツ <br/><br/><br/><br/><br/>メタルウォーズは様々なパーツと武器を組み合わせアップグレードし敵を破壊するフル3Dシューターゲームです。 <br/>単純に一人で敵を破壊するのではなくパートナーと一緒に戦略的な動きで敵を破壊する事が出来ます。 <br/>全てのステージを攻略すると様々なパーツや武器を組み合わせ自分だけのメカニックにカスタム出来ます。<br/>コントロールはシンプルです。<br/>画面上の二つの仮想ジョイパッドを使用して、左のパッドで移動、右のパッドでターゲットを狙い発射することが出来ます。<br/>右のパッドは軽くタッチすると視界が移動、長くタッチすると武器を発射する。<br/>状況に合わせて武器を選択する事が出来ます。 <br/>画面左の3タイプのコマンドでパートナーのプレイ方式を変更。 <br/>ステージをクリアしていくとさらに強力な武器と新しいパーツを得る事が出来ます。 <br/>もっと強いパートナーを得て難しいステージを簡単にクリアする事が出来ます。", "metacritic": null, "released": "2010-08-23", "tba": false, "updated": "2019-10-22T14:15:09", "background_image": "https://media.rawg.io/media/screenshots/5ed/5ed0c509601fb7cecbe3c7d0a59fcbea.jpg", "website": "http://www.goorusoft.com/?portfolio=metalwars", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 302, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Goorusoft"], "genres": ["Adventure", "RPG"], "publishers": ["Goorusoft"], "esrb_rating": null}