{"id": 244087, "slug": "dinosaur-war-in-the-tropics", "name": "Dinosaur: War in the Tropics", "name_original": "Dinosaur: War in the Tropics", "description": "The ultimate Dinosaur simulator adventure game you have been waiting for : Dinosaur War in the Tropics.  Take control of a Trex, Triceratops, or Dilophosaurus.  It all takes place on a massive tropical Island with beautiful designed scenery .  <br/><br/>15 ACTION PACKED MISSIONS<br/>The Missions get more challenging as you advance. Free the trapped Dinosaur, smash the Tanks, Collect food, Invade the enemy army base, or whatever the missions require to complete.<br/><br/>REAL JURASSIC DINOSAUR EXPERIENCE<br/>High quality dino models, with excellent sounds and animations. Includes the Triceratops, Tyrannosaurus, and Dilophosaurus.  <br/><br/>THE MORE YOU PLAY, THE STRONGER YOU GET<br/>Smash Tanks, Cars, Buggies, Army Trucks, and Soldiers to gain more experience.<br/><br/>HUGE 3D ISLAND MAP<br/>Well deigned map with 3D graphics and action packed game play.<br/><br/>The game combines the best Dinosaur Simulation and adventure gameplay.  Choose from 3 different Dinos.  Race against the clock to complete the mission before the time expires.  Run around and explore all the hidden secrets the island has to offer.  Its huge map, with great 3D visual effects.<br/><br/>The game requires a relatively strong mobile device, but we have set it up to play on lower devices as well.   Please feel free to send your feedback to jellyfishgiant1@gmail.com.  We look forward to your comments.", "metacritic": null, "released": "2015-02-05", "tba": false, "updated": "2019-10-25T04:51:03", "background_image": "https://media.rawg.io/media/screenshots/931/93162d8206535e3d4ffd302be169676e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 94, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Sharkweed"], "genres": ["Adventure", "RPG"], "publishers": ["Sharkweed"], "esrb_rating": null}