{"id": 244088, "slug": "dinosaur-mercenary-war", "name": "Dinosaur: Mercenary War", "name_original": "Dinosaur: Mercenary War", "description": "Your name is Chris S. You are the lone mercenary soldier on an Island that has been overrun with Jurassic Dinosaurs.<br/>Your Mission is to reestablish control of the Island by taking out all of the unwelcome guests. Thrive in the face of adversity as you gain more experience by winning battles against these ancient beasts. This is an all out,take no prisoners, dinosaur war. Develop your hunting skills as you complete 15 epic missions. As the hunter, your goal is to survive the epic battles and advance. Attack the enemies before they race after you. This game combines the best features of 3D Open World style play with quests to complete.<br/><br/>Help Chris S escape the island.<br/><br/>\"I crossed him!\" you shouted.  <br/><br/>\"That's fake\" the other guy said.  <br/><br/>\"You think thats fake NOW!?, SLAM.\"<br/><br/>Video Preview : https://www.youtube.com/watch?v=m8QuFNWMmtY&amp;feature=youtu.be<br/><br/>App Highlights:<br/>***Hunting for Dinosaurs has never been more exhilarating and fun.<br/>***3D Graphics and Special Effects. <br/>***Mini Map to help you complete your missions<br/>***Stunning Visuals, Soundtrack &amp; Sounds<br/>***Includes realistic 3D Raptor, TRex, Triceratops, Carnotaurus, Dilophosaurus and Velociraptors, and many more<br/>***Become an excellent Sniper hunter and shoot down these wild jurassic monsters, one by one.<br/>***The weapon options include Pistol, Shotgun, AK47, and Sword<br/>***Win your battle and advance to the next mission<br/>***High Quality Jungle Island environment complete with jungle plants<br/>***Time of day changes from sunrise to sunset.<br/>***The more you play, the more powerful the mercenary soldier becomes<br/>***A realistic fighting 3D simulator<br/><br/>Choose from a close attack with a sword, or a distant attack with a gun. If you find yourself surrounded, you can always run to safety behind a jeep, quad bike, army tent, or boxes. Your survival depends on it.<br/>We hope you enjoy playing Dinosaur Mercenary.", "metacritic": null, "released": "2015-05-11", "tba": false, "updated": "2019-10-25T04:51:07", "background_image": "https://media.rawg.io/media/screenshots/fa3/fa39ff746538c0db95909cfa7a3a599f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 191, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Sharkweed"], "genres": ["Adventure", "RPG"], "publishers": ["Sharkweed"], "esrb_rating": null}