{"id": 244081, "slug": "truck-driver-3-rain-and-snow-trucking-3d", "name": "Truck Driver 3: Rain and Snow Trucking 3D", "name_original": "Truck Driver 3: Rain and Snow Trucking 3D", "description": "Step on the gas and Get Truckin’<br/><br/>Drive your Truck through heavy Snow and pouring rain<br/><br/>Truck Driver 3 sets a new standard in Truck Driving Sims. Unparalleled 3D graphics and game play make this a can’t miss game of 2014. Combines racing with trucks and skills driving. <br/><br/>Truck Driver 3 puts you in control of 3 of the biggest, baddest rigs on the road. Your mission : Drive through 12 challenging missions. You must score high to pass the mission and unlock the next.  Watch out for that traffic y’all, cause these big trucks have big power.<br/><br/>REAL TRUCKS<br/>Feel the power behind these big rigs. We used ultra realistic 3D models in this game. Nuttin’ but the best for y’all players.<br/><br/>REAL SCENERY<br/>Realistic looking 3D landscapes with Rain and Snow. <br/><br/>REAL TRAFFIC<br/>Realistic 3D buses, cars, and tractors. <br/><br/>REALISTIC MISSIONS<br/>Complete the mission and score high enough to pass. If you hit too many cones, cars, or barriers you will not pass.<br/><br/>MULTIPLE VIEWS<br/>Choose to either be right behind the wheel or the view from above. Both add to the superior game play.<br/><br/>What other players are saying about Truck Driver<br/><br/>“I love all the games in this series.  Excited to try this one” -- Randall K. , Santa Fe<br/><br/>“Awesome power.  I love playing with 'The Big Guy'! - A Rod from Queens<br/><br/>“Not easy.  Takes major skill to pass some of the higher missions. than a bucket of money.” - Harold K. Baton Rouge<br/><br/>You read this far, why not give it a try. <br/><br/>Big Trucks. Everybody loves them. Keep on Truckin’ Y’all", "metacritic": null, "released": "2014-10-12", "tba": false, "updated": "2019-10-25T04:50:48", "background_image": "https://media.rawg.io/media/screenshots/0d4/0d45641e76c277ea0b4c74a15d805ddb_cqhTZWN.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 81, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Sharkweed"], "genres": ["Simulation", "Racing"], "publishers": ["Sharkweed"], "esrb_rating": null}