{"id": 244119, "slug": "penguin-simulator-pro", "name": "Penguin Simulator Pro", "name_original": "Penguin Simulator Pro", "description": "Have you ever wondered what it would be like to be a Penguin?  Come and explore the world as a Penguin. Take him to the Beach or let him swim around some icebergs. Make him happy by accomplishing all the objectives. <br/><br/>Features: <br/>**Control a fun 3D Penguin <br/>**4 Fun and Interactive 3D Maps to Explore - Loads of Effects and Secrets <br/>**SHARKS!  Lots of Sharks are out to get your Penguin.  Swim fast!<br/>**Seagulls, People, Bears, Horses<br/>**Super Fun Music<br/>**Excellent 3D Graphics and Exciting 3D Penguin Gameplay <br/>**Loads of Achievements<br/>**Break some crystals, Smash some tables and chairs<br/>**Plenty of fun sounds and visual effects<br/><br/>When your penguin enters the water, we careful of the sharks below.  If your penguin hits them, they will cause him damage.  Too much damage from the sharks, and your penguin will need to rest a while.<br/><br/>Say hello to some friendly birds as you walk around the maps.  Bump into the horses.  Watch out for the Bears though . . .they are not friendly.<br/><br/>Be sure and look around in all the corners and uncover all the map secrets. We love these funny birds and we had a great time creating this app. Hopefully you will have a fun time playing it. . . You've tried Wolf Simulator, Bear Simulator, Shark Simulator, and Goat Simulator, and Dinosaur Simulator. Now give Penguin Simulator a try!!", "metacritic": null, "released": "2014-06-29", "tba": false, "updated": "2019-10-22T14:15:13", "background_image": "https://media.rawg.io/media/screenshots/0df/0df0d4c35b6d4753ffc7f4be61ceb033.jpg", "website": "https://www.facebook.com/sharkweedapps", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 148, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Sharkweed"], "genres": ["RPG", "Simulation"], "publishers": ["Sharkweed"], "esrb_rating": "Everyone 10+"}