{"id": 244193, "slug": "word-descrambler", "name": "Word Descrambler", "name_original": "Word Descrambler", "description": "As the Ultimate Unscrambling Tool, Word Descrambler is that 3rd lobe of the brain for those who love word puzzles and games. As a high-quality unscrambling app, it doesn't stop at just spewing out a collection of words found in a jumble of letters. Instead, it allows for the processing of the longest set of scrambled letters (22 when most stop at 20) and offers features not found in any other iOS unscrambling app of its class.<br/><br/>Great for players of Scrabble, Words with Friends, WordBrain, WordBrain 2, WELDER, Wordscapes, New York Times crossword puzzles, Jumble, anagrams, etc. <br/><br/>Word Descrambler will raise your game to a new level with multiple modes of descrambling.<br/><br/>    • In \"Simple\" mode, unscramble up to 22 letters, find anagrams, and find possible high-scoring words for Scrabble-like games.<br/><br/>    • In \"Pairs\" mode, unscramble 2 words simultaneously using up to all of the letters entered. For example, what are 2 words hidden in the letters \"doghouse\". \"Dog \" and \"House\" - Wow, who knew? How about \"loopyghqycaliaraecrups\"?  (Up to 22 letters can be entered.)<br/><br/>    • In \"Wild\" mode, use a wildcard character in order to unscramble words that contain the letters that you enter plus another letter from the alphabet. For example, with the letters \"gle\" this descrambler will not only find \"leg\" and \"gel\", but also \"age\", \"ale\", \"beg\" and 46 other 3-letter words and 13 4-letter words including \"legs\", \"gels\" and \"glue\".<br/><br/>Word Descrambler also includes great features like \"photo import\" and \"exclude\".<br/><br/>    • With \"photo import\", you can bring in a screenshot of a puzzle that you are struggling with or you can take a photo of a jumble puzzle out of a newspaper, and then easily enter the letters and unscramble them.<br/><br/>    • With the \"exclude\" feature, you can take words found in a descrambling search, exclude them from the original set of letters and then run the search again with the remaining letters. This allows you to whittle down a large set of letters containing multiple words, to try to solve a WordBrain-style puzzle.<br/><br/>Features:<br/>    • Provides three unique search modes - Simple, Pairs and Wildcard<br/>    • Draws from a complete and modern English dictionary of hundreds of thousands of words<br/>    • Shows the results in easy-to-read, alphabetized formats<br/>    • Sorts the results by longest or shortest words first<br/>    • Allows selecting the results, so that you can copy &amp; paste words from your searches<br/>    • Provides the \"exclude\" command when a word in the results is selected <br/>    • Produces your choice of either rich, colorized output or plain text output<br/>    • Can be set to automatically clear the screen after every search<br/>    • Allows you to import snapshots of your current iPhone (or iPod Touch) word game, so that you can type in the letters for your search easily<br/>    • Allows you to take a photo of any word game or puzzle from a book, magazine or newspaper, to make typing in the letters easier<br/><br/>    • NO internet connectivity needed to do searches!<br/><br/>And Now it is on the iPad!<br/><br/>Version 1.2 now works on the iPad and is written specifically to fully use the iPad canvas - not just provide a \"blown up\" version of the app.<br/><br/>Additional features for the iPad include:<br/><br/>    • Provides a new results pane that shows a history of the searches that you have performed and allows searches to be re-run with the single tap of a button<br/>    • Provides, of course, a larger area to see results compared to the iPhone version<br/>    • Supports Slide Over and Split View to allow you to work side-by-side with your other favorite apps<br/> <br/>##   Add a third lobe to your brain for mere pennies with Word Descrambler!   ##", "metacritic": null, "released": "2017-10-07", "tba": false, "updated": "2019-10-22T14:15:14", "background_image": "https://media.rawg.io/media/screenshots/1bb/1bb1873769764ce8f578e5a2bc17ebe4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 81, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["SoftTarget Computing"], "genres": ["Puzzle"], "publishers": ["Reginald Jones"], "esrb_rating": "Everyone 10+"}