{"id": 244136, "slug": "light-biker-racing-soccer-multiplayer", "name": "LIGHT BIKER RACING SOCCER MULTIPLAYER", "name_original": "LIGHT BIKER RACING SOCCER MULTIPLAYER", "description": "Soccer meets driving once again in the long-awaited, physics-based sequel to the beloved arena classic, Supersonic Acrobatic Rocket-Powered Battle-Bikers!<br/><br/>A futuristic Sports-Action game, Rocket League, equips players with booster-rigged vehicles that can be crashed into balls for incredible goals or epic saves across multiple, highly-detailed arenas. Using an advanced physics system to simulate realistic interactions, Rocket League relies on mass and momentum to give players a complete sense of intuitive control in this unbelievable, high-octane re-imagining of association football.<br/><br/>Awesome features include:<br/><br/>• All-new Season Mode that allows players to enjoy a full single-player experience<br/>• Extensive Battle-Car customizations with more than 10 billion possible combinations<br/>• Unlockable items and vehicles, stat tracking, leaderboards, and more<br/>• Addictive 8-player online action with a variety of different team sizes and configurations<br/>• Amazing 2-, 3-, and 4-player splitscreen mode that can be played locally or taken online against other splitscreen players<br/>• Broadcast-quality replays that allow you to fast forward, rewind, or view the action from anywhere in the arena<br/>• Competitive cross-platform gameplay with PlayStation®4 and Xbox One users", "metacritic": null, "released": "2017-08-31", "tba": false, "updated": "2019-10-22T14:15:13", "background_image": "https://media.rawg.io/media/screenshots/97b/97bda0dcfc84e8557659356925ea50fd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 196, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Nataly Voloskov"], "genres": ["Simulation", "Racing"], "publishers": ["Nataly Voloskov"], "esrb_rating": "Everyone 10+"}