{"id": 24423, "slug": "deca-sports-ds", "name": "DECA SPORTS DS", "name_original": "DECA SPORTS DS", "description": "<p>\n      DECA SPORTS, the hit sports compilation series, is taking its exciting \n      multi-sports competition on the road with 10 NEW sporting events in DECA \n      SPORTS DS! With all-new touch screen controls, DECA SPORTS DS will make \n      everyone in your family experts in a wide range of new sports, no matter \n      where they are. Lunge, flip, and kick your way to the top across all of \n      the included events: Arm Wrestling, Wall Climbing, Clay Shooting, \n      Cheerleading, Sky Diving, Ping Pong, Bobsled, Rugby, Golf, and even \n      Sepak Takraw! The spirit of competition is more fun, and more portable, \n      than ever!\n    </p><p>\n      Features\n    </p><p>\n      • Single player – Play Open Match in one sport, a one-sport \n      bracket-style Tournament, complete a Challenge, or the ultimate \n      competition in the League vs. 6 teams in all 10 sports.<br/>• Multiplayer \n      – Use just one game card for game sharing as you take on friends and \n      family in 2-6 player competition in Open Match, VS., and Tournament \n      modes.<br/>• Locker Room – Create your own team with the Team Editor: \n      pick the name, colors, emblem, and the look and attributes of the \n      players themselves! You can also learn the nuances of each sport in \n      Tutorial mode here.\n    </p>", "metacritic": null, "released": "2010-03-02", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/799/7990a3ce4b8ced520fb7f422b3fb6dd9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 293, "game_series_count": 0, "reviews_count": 0, "platforms": ["Nintendo DS"], "developers": [], "genres": [], "publishers": ["HUDSON SOFT"], "esrb_rating": null}