{"id": 244211, "slug": "puzzleinc-funny-puzzledom", "name": "PuzzleInc- funny puzzledom", "name_original": "PuzzleInc- funny puzzledom", "description": "A collection of the best and most addictive logic puzzles, with minimalist graphics and unique level design!<br/><br/>\"PuzzleInc\" merges the best puzzles like Word Connect,  Rolling Ball and Escape, which are easy to learn and fun to master into one game collection.<br/><br/>As a puzzle lover, you don't need to spend much time on searching new brain teasers any more. We will give you a ONE-STOP game experience from now on!<br/><br/>Escape <br/>Escape is a well-known game, called Chinese Sliding-Block. The goal is to move the red block to the exit. This game will test your observation skills.<br/><br/>Rolling Ball <br/>Rolling Ball is a path guiding game that you need to slide the blocks to create a channel, making the white ball move from the starting point to the end point.<br/><br/>Word Connect<br/>Simply swipe the letters and build words to earn coins! It’s time to discover all of the hidden words and enjoy the fun and excitement of building words! <br/><br/>More puzzles coming soon<br/><br/>FEATURES<br/>• Tons of manually designed levels <br/>Over 1000 free levels inside and more funny levels are under development. <br/><br/>E-MAIL<br/>#lonagcn@gmail.com<br/><br/>Like us on FACEBOOK<br/>#https://www.facebook.com/PuzzleInc-163815821012661<br/><br/>Enjoy the game with your family ;) <br/>If you have any good ideas about PuzzleInc, please send us an email in the game!", "metacritic": null, "released": "2017-12-22", "tba": false, "updated": "2019-10-22T14:13:06", "background_image": "https://media.rawg.io/media/screenshots/e46/e469a874a4a5a726228ead56de11a4a0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 63, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Nian Luo"], "genres": ["Arcade", "Puzzle"], "publishers": ["Nian Luo"], "esrb_rating": "Everyone 10+"}