{"id": 24432, "slug": "korg-ds-10-plus", "name": "KORG DS-10 PLUS", "name_original": "KORG DS-10 PLUS", "description": "<p>\n      KORG DS-10 PLUS is an enhanced version of the revolutionary KORG DS-10 \n      synthesizer software for Nintendo DS. The original KORG DS-10 \n      music-creation software, which combined the superior interface of the \n      Nintendo DS with the functionality of the famous MS-10 synthesizer, has \n      been optimized to essentially double the power of the original when used \n      with the Nintendo DSi system.\n    </p><p>\n      Features\n    </p><p>\n      • Improved professional-grade music tool software at a greater cost \n      performance value than the original KORG DS-10.<br/>• Optimized for \n      Nintendo DSi for 12-voice polyphony and to double the power of the \n      original KORG DS-10: 4 analog synthesizer tracks and 8 dedicated drum \n      tracks, increasing the total number of individual tracks from 6 to 12 \n      (feature available only for the Nintendo DSi).<br/>• SONG mode revamped \n      for expanded song composition capabilities and real-time performance. \n      Per track MUTE/SOLO built into the SONG mode, and EDIT/PLAY enabled for \n      all modes within the SONG mode to further improve real-time performance.<br/>• \n      Delay, chorus, and flanger sound effects available from the mixing board.<br/>• \n      Three different note-entry modes: Touch Screen control, keyboard screen, \n      and matrix screen.<br/>• Exchange sounds and songs and play with up to \n      eight systems simultaneously through a local wireless communications \n      link.\n    </p>", "metacritic": null, "released": "2010-02-16", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/6b6/6b685cb8f3ace9a3811239cd4a60ba2e.jpg", "website": "http://www.korgds10synthesizer.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 121, "game_series_count": 1, "reviews_count": 0, "platforms": ["Nintendo DS"], "developers": [], "genres": [], "publishers": ["XSEED Games"], "esrb_rating": null}