{"id": 244324, "slug": "into-the-flames", "name": "Into the Flames (itch)", "name_original": "Into the Flames (itch)", "description": "<p><em>Into the Flames</em> is a storytelling game about a haunted journey, specifically designed to be played in front of a campfire.<br/></p>\n<p>As a group you tell the story of a pilgrimage along an accursed road. Each player takes on the role of one of the pilgrims and over time uncovers their reasons for travelling - whether hoping to find treasure, escape persecution or experience religious epiphany.</p>\n<p>Only one of the pilgrims will make it to the end of the road. The others will be picked off, one by one, by the spirits that follow your every step. They lurk at the edges of the flames, greedy for tribute.</p>\n<p>Each night we will cast our offerings into the flames - a locket given by a former love, the sword that protects us, our meticulously kept diaries. We hope that what we offer is worthy. If not we will be culled, claimed into the ranks of the ghosts to haunt our former companions.</p>\n<p>***</p>\n<p><em>Into the Flames </em>is designed to be played over 1-3 hours without a GM. The 38 page rulebook contains all of the instructions for play. The rules are designed to be read as a group, with a simple character generation to get you playing quickly.</p>\n<p>The game is pay-what-you-like, any payments over $5 also get you the trinket cards - an additional resource for the game. They are not necessary for play, but allow you to skip finding or bringing your own objects to offer to the flames.<br/></p>\n<p>If you like the game and can afford to, please donate. Any money raised goes to making future games - usually hiring other creatives and collaborators.</p>", "metacritic": null, "released": "2018-09-23", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/70d/70daed6630258a98cdbc3eb2889782de.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 38, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Adam Dixon"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}