{"id": 2444, "slug": "egg-inc", "name": "Egg, Inc.", "name_original": "Egg, Inc.", "description": "In the near future, the secrets of the universe will be unlocked in the chicken egg. You have decided to get in on the gold rush and sell as many eggs as you can.<br/><br/>Hatch chickens, build hen houses, hire drivers, and commission research to build the most advanced egg farm in the world.<br/><br/>An incremental (clicker) game at its core, Egg, Inc. uses many elements from simulation games that give it a unique feel and play style. Instead of menus, you are presented with crisp and colorful 3D graphics and a delightful simulation of a swarm of chickens. In addition to choosing your investments wisely you must also balance your resources to ensure a smooth running and efficient egg farm.<br/><br/>There is something for everyone here:<br/>Casual players love Egg Inc's laid back feel and beautiful appearance. Take your time to build a wonderful egg farm and explore all the content.<br/><br/>More experienced incremental (clicker) players will love the emergent gameplay and depth afforded by the different play styles needed throughout the game. To reach the ultimate goal of having a ginormous egg farm with an astronomical value, you will need to balance strategies throughout many prestiges to make best use of your time.<br/><br/>Features<br/>- Simple, Casual gameplay with opportunities to challenge yourself<br/>- Chicken swarm!<br/>- Dozens of research items<br/>- Dozens of missions<br/>- Many different hen houses and shipping vehicles<br/>- A \"Nested\" Prestige system has the game always feeling new<br/>- Wonderful 3D graphics with pixel perfect UI and shadows<br/>- Game Center achievements and leaderboards to compete with your friends and the world!", "metacritic": null, "released": "2016-07-14", "tba": false, "updated": "2022-12-06T03:49:44", "background_image": "https://media.rawg.io/media/screenshots/282/2824f5ea97289b99bad110480e5ee70e.jpg", "website": "", "rating": 3.91, "rating_top": 4, "added_by_status": {"owned": 4, "beaten": 6, "dropped": 6}, "playtime": 0, "achievements_count": 0, "ratings_count": 10, "suggestions_count": 90, "game_series_count": 0, "reviews_count": 11, "platforms": ["Android", "iOS"], "developers": ["Auxbrain"], "genres": ["Strategy", "Simulation"], "publishers": ["Auxbrain"], "esrb_rating": null}