{"id": 244559, "slug": "reset-episode-2-under-the-golden-sun", "name": "Re:Set Episode 2 : Under the Golden Sun", "name_original": "Re:Set Episode 2 : Under the Golden Sun", "description": "<p><em>“After catching Lust, we know that Greed is after our asses. This time, our demon-hunting involves some kind of an old mansion with a creepy secret within its basement. Classic murder story ensues and we have to solve it before more people die! With the help of my schoolmates, a quirky biologist, and a creepy couple I know nothing about, I’m going to solve my first murder case! But wait, Gerald’s acting kind of weird lately. For a guy who has three different personalities, he is definitely not normal, but he's never THIS weird. I wonder if he needs laxatives…”</em><br/><br/><strong>ReSet</strong> is an episodic game consists of seven episodes where you play as both Mike and Gerald in order to retrieve all the seven demons back, and probably recover Gerald's missing memories.</p>\n<p>In this episode, they are involved in a double homicide. Can they solve it? Will they also manage to catch a demon, or be caught instead? It's all up to you! Good luck! Also watch your back most of the time, someone might put a “Kick Me” sign on your shirt without you noticing.<br/><br/><strong>Features:</strong><br/>- 63,139 words, play as Mike, Gerald, and Grace<br/>- 27 unlockable cgs and sketches<br/>- Five different endings (4 Others, 1 True one), 2 different paths and a bonus path<br/>- Debate system or whatever you'd like to call it.<br/>- All the stuffs featured in the previous episode, that includes randomness.<br/>- And as all of my other games it's completely free, no profits taken. If you bought this, you’ve been scammed.</p>", "metacritic": null, "released": "2018-09-22", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/e54/e542d9ce3dbde3410442f57543ab2b10.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 167, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["azureXtwilight"], "genres": [], "publishers": [], "esrb_rating": null}