{"id": 244683, "slug": "as-the-normies-do", "name": "As The Normies Do", "name_original": "As The Normies Do", "description": "<p>I was originally going to write an 'afterword' in the form of a text file since I'm really into light novels, funny enough i leave most afterwords unread... don't know why because they're often fun to read. Anyway! Since this is the description I'll talk a bit about the game first, this is a a comedy drama about otakus trying to fit into highschool and make friends despite the negative view most people have on them. it tackles a few ways in which people cope or not cope but most importantly! (lol) It shows cute girls doing cute things :3 <br/></p>\n<p>So a bit about this afterword, these always start with thank you for reading so I'll lead with that, thank you for taking your time to play this game, this was my first VN, I was in the process of writing a script for another one before I heard of this game jam so I put that on hold, I usually write for fantasy and even that there is no full project released yet so this is my first \"finished\" project, I say that with quotes because there was a few images I planned for the game, I only managed to get one out for it and it was rather rushed. I'll probably not rework this but if i do, adding those images would be the first thing I do and then rework some of these backgrounds. <br/></p>\n<p>That segways nicely to what this expience done for me, it helped me highligh some stuff I lack in my art like backgrounds, characters interacting with each other and time management for a deadline project for this. I could blame the week where i didn;t do much because I was sad, or the 9 days of work in a row i had or the weddings that happened and are happening but this project was 3 months, I took it easy at the start so when problems started happening within the last month I was unprepared. <br/></p>\n<p>From hereI'll probably leave furthur VN's on hold and work on a web comic, at least work on one to get a feel for it, if it's released that's another thing, there are many projects I wanna work on to find what I want to persue as a career. Anyway. I won't keep you too long, hope to see you again!<br/></p>", "metacritic": null, "released": "2018-09-20", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/625/625309d58792516ff0f7c918f6d060ef.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 113, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["OkeArt"], "genres": [], "publishers": [], "esrb_rating": null}