{"id": 244770, "slug": "zero-spring-episode-1-english-translation-version", "name": "Zero spring episode 1 English translation version", "name_original": "Zero spring episode 1 English translation version", "description": "It is an FPS game with horror and suspense elements.<br/>\r\nThe unique part of this game is where there is a recovering character to support you. You have to fight while protecting her.<br/>\r\nHealth recovery will be difficult if you lose her.Zombies will not appear in this game.<br/>\n<br/>\r\nStory<br/>\r\n2054,Japan. Policemen conducted investigations on illegal building of hospital constructed by emerging religion but did not return.<br/>\r\nBecause it was a hospital for a settlement on the mountain,the investigation seems difficult.<br/>\r\nThe prefectural police decided to dispatch special forces.But the wife of the captain of the special forces was a nurse at this hospital.<br/>\r\nThe prefectural police asked to remove the captain from the assignment and take a vacation.<br/>\r\nBut the captain began climbing the mountain alone to investigate the hospital.<br/>\r\nHasegawa of information officer and Nagase of medical officer carefully supported the Player.<br/>\n<br/>\r\nThis is an English translation version. Voices in the Japanese version has been cut.<br/>\r\nSeveral documents are not translated completely and the summary is displayed in the subtitle. Also, documents that are not important are not translated.<br/>\r\nThis game is made with GameGuru.<br/>\r\nWe can not do any support on the game's strategy.", "metacritic": null, "released": "2018-11-01", "tba": false, "updated": "2019-08-28T21:52:57", "background_image": "https://media.rawg.io/media/screenshots/3f4/3f4b8ba5013764971c8da42a0087c161.jpg", "website": "https://emerose.biz/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 216, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Emerose LLC. Japan"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["NS"], "esrb_rating": null}