{"id": 244764, "slug": "space-raiders-2018", "name": "Space Raiders (2018)", "name_original": "Space Raiders (2018)", "description": "The Earth as we knew it is gone. What’s left of humanity now lives inside an asteroid called Lutetia hidden in underspace. You are a space ranger, humanity’s last hope in the hopeless struggle against the puppeteers who have taken over all the intelligent species in the Galaxy.<br/>\n<br/>\r\n“Space Raiders” is an old-school role-playing game with turn-based battles and lots of exciting storylines. This game is not recommended for those who don’t like to read and prefer one-button battles. <br/>\n<br/>\r\nGame features:<br/>\r\n-A world where even the smallest details are well-thought-out, with its own history full of mystery and intrigue. A world inhabited by many different unusual species. <br/>\r\n- Exciting adventures and stories worthy of being retold over and over again.<br/>\r\n-Tactical battles with aliens where using your brain is more important than how fast you can tap the screen.<br/>\r\n- Shape the game story with the choices that you make.<br/>\r\n- Develop and improve character traits, battle bots, space suits, spaceship modules and so on.<br/>\r\n-Travel through hyperspace and to different planetary systems<br/>\r\n- Collect ore and organic matter to process in the ship’s Converter<br/>\n<br/>\r\nAre you sick and tired of just-kill-them-all or hey-Сhosen-one-can-you-help-me-out type of games? Then the wild world of Space Raiders is for you!", "metacritic": null, "released": "2018-10-08", "tba": false, "updated": "2019-08-28T21:52:58", "background_image": "https://media.rawg.io/media/screenshots/7f2/7f2b6e0619ed5b796fa149aded5ffe6c.jpg", "website": "https://vk.com/spaceraiders", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 276, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Geek Games"], "genres": ["Adventure", "RPG", "Strategy", "Indie"], "publishers": ["Geek Games"], "esrb_rating": null}