{"id": 244784, "slug": "felix-the-reaper", "name": "Felix The Reaper", "name_original": "Felix The Reaper", "description": "<p>Felix works at The Ministry of Death and is in love with Betty The Maiden from The Ministry of Life. He believes that going to the human world as a field reaper will enable him to one day meet her. Hence he’s taken the job of making sure people die and taught himself to dance to impress Betty.<br />\nSince Felix only moves in the shadows, he needs to manipulate those shadows to move around. Luckily reapers like Felix are able to turn the sun and move shadowing objects, which enables him to create the necessary shadow paths to get around. He does so to solve the adventure plots, that makes people die according to the ministerial plans.<br />\nEach level unlocks a hardcore version of itself for the striving ministerial achiever. You can also collect skull achievements, that further unlock bonus time trials for the extremely resourceful ministerial employee.<br />\n•   Challenge yourself to original puzzle game mechanics<br />\n•   Experience a gruesomely sweet and beautiful story world<br />\n•   Choose your own tune from a selection of 10+ indie music artists on Felix‘ Walkman<br />\n•   Collect skull achievements that further unlock bonus time trials<br />\n•   Watch Felix‘ dance moves develop as created by professional dancers<br />\nFelix The Reaper has sprung from a fascination with the sprawling, humorous and grotesque art history of Death. The history contains both The Dance of Death or Danse Macabre and Death And The Maiden as two central themes going through it. We sort of mashed those two together in Felix The Reaper.<br />\nFor the character himself and the world around him the inspiration was more diverse: in that aspect, the game contains inspiration from the ancient tv-show The Twilight Zone, medieval painters like Bruegel and Bosch and the cartoon characters of Adventure Time and Hayao Miyazaki.<br />\nAnother important inspiration for Felix The Reaper were the amazing artistic collaborators in the production. We&#39;ve worked with dancers, a long list of music artists and historian scholars.The DanceSeveral dancers have been around throughout the production, and eventually Gunilla Lind and Raphaël Ferdinand Eder-Kastling improvised the final moves, that ended up in the game.<br />\nHere&#39;s Gunilla doing a dance move for Felix:<br />\nAnd here&#39;s Raphael doing another:<br />\nThe MusicOf course a game with a dancing protagonist needs great music - why else would he be dancing? We designed the game in a way that lets the music artists be themselves. We wanted them to add to the game through their personal artistic expression, rather than ask them to be what we want them to be. That makes for a varied and strange combination of music. But since the gameplay is a non-stressful puzzler, you actually have time to appreciate and enjoy the weirdness while playing.The Art HistoryThe idea for the game itself stems from art history. We actually started with The Danse Macabre and Death and The Maiden as a basis and then asked ourselves: how can we make a game about this? Eventually and through several different prototypes, we ended up here.<br />\nParallel to the production a historical scholar has dived into the art history of Death across more than 10 centuries for a book manuscript he is working on, and every time he hit upon something interesting he told us, and we tried to put it in the game, if it fit. There&#39;s five different articles by this historian Søren Hein Rasmussen within the game, that you can unlock as you progress.</p>", "metacritic": null, "released": "2019-10-16", "tba": false, "updated": "2023-11-28T01:22:28", "background_image": "https://media.rawg.io/media/screenshots/9e2/9e267ccfe4e20b95815791ab391252b2.jpg", "website": "https://www.felixthereaper.com/", "rating": 2.97, "rating_top": 3, "added_by_status": {"yet": 45, "owned": 897, "beaten": 12, "toplay": 22, "dropped": 44, "playing": 6}, "playtime": 3, "achievements_count": 156, "ratings_count": 60, "suggestions_count": 230, "game_series_count": 0, "reviews_count": 61, "platforms": ["PC", "macOS", "Xbox One", "PlayStation 4", "Nintendo Switch", "iOS"], "developers": ["Daedalic Entertainment", "Kong Orange"], "genres": ["Adventure", "Indie", "Puzzle"], "publishers": ["Daedalic Entertainment"], "esrb_rating": null}