{"id": 244760, "slug": "a-winters-daydream", "name": "A Winter's Daydream", "name_original": "A Winter's Daydream", "description": "<p>Nineteen-year-old Yuu can’t stand his younger sister, Otoko, and the feeling is mutual. It’s been almost a year since Yuu saw her last, having escaped his dreary home town to study in the bustling city, but with the advent of New Year’s he finds himself obliged to return to his family to celebrate.<br />\nUnfortunately, Yuu’s absence has not softened his younger sister, and Otoko is just as sullen and surly as ever before.<br />\nFinding the atmosphere at home unbearable, Yuu decides to escape once more — not to the city this time, but to his grandmother’s snowy, secluded village.<br />\nThe reunion between grandson and grandmother starts normally at first… until one moonlit night, when the pair witness a star streaking through the sky.<br />\nThe following morning, Yuu enters the kitchen, still half-asleep, to discover...<br />\n“Who are you? What are you doing in my grandmother’s house?”<br />\n...that his grandmother has transformed into a cute young girl!<br />\nWhat is the reason behind his grandmother’s drastic change? Will Yuu be able to restore her to her original self? And why is she so adorable?!<br />\nStory by ebi-hime, author of Sweetest Monster, Blackberry Honey, and The Way We All Go<br />\nAround 50,000 words of text (approx 3-4 hours of reading)<br />\nDetailed background and character art<br />\nA custom OST<br />\n1080p display<br />\nA kinetic story with no choices or branches<br />\nA very cute grandmother!!!</p>", "metacritic": null, "released": "2018-10-15", "tba": false, "updated": "2023-01-29T21:51:50", "background_image": "https://media.rawg.io/media/screenshots/55c/55c14e26ab09a62b358481e3cad0dd0c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 43, "beaten": 2, "toplay": 1, "dropped": 1}, "playtime": 0, "achievements_count": 95, "ratings_count": 2, "suggestions_count": 357, "game_series_count": 0, "reviews_count": 2, "platforms": ["PlayStation 4", "Nintendo Switch", "Linux", "macOS", "PC", "PS Vita", "Xbox One"], "developers": ["Sometimes You", "ebi-hime"], "genres": ["Simulation"], "publishers": ["Sometimes You", "ebi-hime"], "esrb_rating": "Everyone"}