{"id": 244758, "slug": "executive-assault-2", "name": "Executive Assault 2", "name_original": "Executive Assault 2", "description": "Executive Assault 2 is an indie real-time strategy/first-person shooter-hybrid set in space in which you can jump into the boots of individual units. Take the reigns as a CEO of your own corporation and dominate rival factions for wealth and tech in a galactic wild west of chaos and lawlessness.<br/><br/>Play Executive Assault 2 in multiple ways including:<br/><br/><strong>RTS mode</strong><br/>Command your fleet aboard the bridge of your space station from a top-down perspective. Mine resources on nearby asteroids to produce a wealth of goods to sell to passing traders and grow your armies; Be careful: rival corporations and rebellious protestors will do all they can to thwart your aspirations of intergalactic domination!<br/><br/><strong>FPS mode</strong><br/>Fed up of watching the action from above and want to dive in and blow stuff up yourself? Seamlessly switch from RTS to FPS mode for manic fast-paced combat; weather that’s playing as a footsoldier defending your base or in the cockpit of a starship under your control.<br/><br/><strong>Executron mode</strong> <br/>Help friends run their company in multiplayer mode, with one player assuming the role of CEO and tactician and the other, a soldier or ship unit, with all the loot split straight down the middle.Main Features:<ul><li>Unique combination of real-time unit command gameplay and fast-paced FPS action<br/></li><li>Customizable corporation, unit and product names and emblem designs<br/></li><li>Build your very own fully explorable space station<br/></li><li>Design and construct dozens of starship fleets<br/></li><li>Take starfighters out into space for epic dogfights<br/></li><li>Manufacture goods to sell to traders to make a profit and grow your armies<br/></li><li>Research over 60 technologies for more powerful units and better upgrades<br/></li><li>Invade other space stations for resources or show no mercy by blowing them up!<br/></li><li>Build multiple Super Weapons, including the system-destroying Monolith ship<br/></li><li>Random encounters.</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2024-01-12T17:02:46", "background_image": "https://media.rawg.io/media/screenshots/82b/82b62b83851852600a2ecd680aa9e719.jpg", "website": "http://executiveassault.com/ea2/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 23, "toplay": 1, "playing": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 3, "suggestions_count": 485, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC", "macOS"], "developers": ["Hesketh Studios"], "genres": ["Action", "Strategy", "Indie"], "publishers": ["Hesketh Studios"], "esrb_rating": null}