{"id": 2447, "slug": "zombie-shock", "name": "Zombie Shock", "name_original": "Zombie Shock", "description": "* 7 games are purchased by a second. *<br/>&amp;quot;593k of downloads for Zombie Shock, 593k people addicted to Zombie Shock can&amp;#39;t be wrong&amp;quot;<br/>- August 4, 2010.<br/><br/>GAME INTRODUCTION<br/>** Blow away your stress with ZombieShock!!<br/><br/>&amp;quot;Zombie Shock is still a great action oriented title with castle defense elements that make this an extremely addictive title to own.&amp;quot;<br/> - [5/5] appspy.com, Andrew Nesvadba  <br/><br/>&amp;quot;The game is wonderfully designed with graphic novel type visuals and amazingly detailed zombies, and animations.&amp;quot;<br/> - [4.5/5] appadvice.com,Trevor Sheridan <br/><br/>&amp;quot;The game is excellent. Fast, frantic, fun. So polished it hurts. The upgrade system is fast and flawless. You level up at a perfect rate.<br/>Shooting is spot on with a really nice laser site. Enemies are varied and very imaginative.<br/>Best shooting/zombie game in ages.&amp;quot;<br/>- Toucharcade, sammysin<br/><br/>ZombieShock is an action-adventure game set in New York City in turmoil. <br/>A wide variety of zombie characters, numerous weapons, and the endless<br/>zombie-chases invite you to the world of great suspense.   <br/> <br/>GAME FEATURES<br/><br/>1. The mounting suspense as the game progresses.<br/>  - There are large-scale battles between the dreadful zombies and the main character.<br/><br/>2. Dynamic battles will blow away your stress!!! Feel the thrill of attacking zombies.<br/>  - Zombies move in various quick motions.<br/>  - The electrifying deaths of zombies vary by the attacking methods.<br/><br/>3. Fight the Small zombies with unique identities as well as the gigantic Boss zombies.<br/>  - Each of the 6 small zombies has unique characteristics.<br/>  - There are 5 dreadful boss zombies with various patterns of behavior.<br/><br/>4. Play strategically by using various weapons and upgrades.<br/>  - There are more than 18 unique weapons available in the game.<br/>  - There are 5 different status upgrades.<br/>   * You can play with different strategies by using these unique set of weapons.<br/><br/>5. Exciting heavy metal sounds<br/>  - Listen to the breathtaking heavy metal sounds recorded by Funnybucks studio.<br/><br/>6.Game modes : Scenario / Survival<br/>  - 50 stages in the background story of ZombieShock and the characters.<br/>  - Survival mode of battling against endless zombie attacks.  <br/><br/>7. Breathtaking scenario in between game stages.<br/>  - Cartoons were used to draw players&amp;#39; attention to the breathtaking scenario.<br/><br/>FUTURE UPDATES<br/> - Updated scenario: Episode 2<br/> - Higher-quality presentation<br/><br/>SUPPORT INFORMATION<br/> - help@abluewind.com<br/> - twitter: @abluewind_com", "metacritic": null, "released": "2010-05-25", "tba": false, "updated": "2019-10-22T13:57:10", "background_image": "https://media.rawg.io/media/screenshots/209/2093f1b06a42d2d637de69a2378cfc2e.jpeg", "website": "http://abluewind.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 284, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["BLUE WIND"], "genres": ["Action", "Arcade"], "publishers": ["BLUE WIND"], "esrb_rating": "Mature"}