{"id": 244808, "slug": "virgo-vs-the-zodiac", "name": "Virgo Vs The Zodiac", "name_original": "Virgo Vs The Zodiac", "description": "<strong>Virgo Vs The Zodiac is a sci-fi/fantasy JRPG inspired by the Mario &amp; Luigi RPG series and the Mother RPG series</strong> in which you play as an obsessed villain.<br/><br/>The game features traditional turn-based combat with real-time execution of moves: blocking, countering and timing your attacks carefully as well as predicting your foes' moves is essential to succeed in <strong>Virgo’s twisted and unforgiving cosmic quest to bring back the Golden Age</strong>, a period of peace, symmetry and balance, or so she thinks.<br/><br/>In this galaxy where every action means a reaction, you’ll play as Virgo, the Holy Queen, often called Dreadful Queen by heretics, bringing mayhem to the Zodiac Realms and leaving a trail of stardust on the way, all to fit her excessively righteous worldview.<br/><br/><br/><br/><br/><br/><br/><br/><br/><ul><li> <strong>Unforgiving timed-actions combat</strong> where all conflicts are lethal unless you protect yourself; precise timed attacks and blocks will bring an end to heresy.<br/></li><li> <strong>Counter-Turn system:</strong> Any attack can be countered by a variety of equippable counter skills.<br/></li><li> <strong>Spare enemies and make friends</strong>!<br/></li><li> <strong>No random encounters:</strong> Battles fought are plot-relevant.<br/></li><li> <strong>Non-self insert and overly villanious Main Character.</strong><br/></li><li> <strong>Unlikely friends and foes</strong> such as Goats, Save Dinosaurs and a Cookie Companion.</li></ul><ul><li> <strong>Choices matter, multiple endings</strong>.<br/></li><li> <strong>Rewards through exploration: </strong>As you delve into the most heretical star clusters of the galaxy, you'll find a vast amount of explorable areas brimming with interactive objects. Many choices that will impact the game can be brought up through world interaction and exploration.<br/></li><li> <strong>Interact with different Zodiacs</strong> outside of the main quest within the Zodiac Memories.<br/></li><li> <strong>Crafting and upgrading a multitude of items shareable between your party members, SHMUP minigames and you can also ride in Alpacas!</strong><br/><br/></li></ul>", "metacritic": null, "released": "2017-05-20", "tba": false, "updated": "2022-08-05T09:33:58", "background_image": "https://media.rawg.io/media/screenshots/756/756f31d26493b078ea78b5de6051e502.jpg", "website": "http://virgovsthezodiac.co.uk/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 10, "owned": 172, "beaten": 1, "toplay": 7, "dropped": 3}, "playtime": 4, "achievements_count": 32, "ratings_count": 3, "suggestions_count": 306, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC"], "developers": ["Moonana", "Nana"], "genres": ["RPG", "Indie"], "publishers": ["Fig Publishing", "Moonana"], "esrb_rating": null}