{"id": 244850, "slug": "glo-phlox", "name": "Glö Phlox", "name_original": "Glö Phlox", "description": "After being ambushed by a vicious shape-shifter, a resourceful young elf awakens in a mystical forest, unable to remember where she is and why. By communing with the power of nature, she begins piecing together her past. As her memories are restored, so too are her druidic powers, including her unique ability “Bloom Rush”. With crossbow in hand, she will explore the fantastical world of Glö Phlox and gain revenge on the vicious shape-shifter.<br/>\n<br/>\r\nExplore the rich and fantastical hand-drawn world of Glö Phlox by solving puzzles to gain new and exciting druid powers, and find your way back home. Fight unique bosses in quick-paced, twin-stick shooter combat while meeting a diverse cast of characters and influencing their fates, making them a part of your story<br/>\n<br/>\n<br/>\r\n● Bullet Hell boss fights create enticing spectacles of<br/>\r\ngameplay and challenge.<br/>\n<br/>\r\n● Bloom Rush ability adds a unique twist to all aspects<br/>\r\nof combat, exploration and puzzle solving.<br/>\n<br/>\r\n● Photostasis ability adds a strategic layer to the<br/>\r\ngame’s combat by controlling the flow of time.<br/>\n<br/>\r\n● Signature aesthetic combines pixel art with<br/>\r\ncustom lighting shaders to create a stylistic glow to the<br/>\r\nenvironments.<br/>\n<br/>\r\n● Parallel storylines lead to a unique gameplay<br/>\r\nexperience every time the game is played.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:52:52", "background_image": "https://media.rawg.io/media/screenshots/ff0/ff0a1dae3a8c7e4625e037f844e111f0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 127, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Justin Sennema", "Eduardo Brasil"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Justin Sennema"], "esrb_rating": null}