{"id": 24488, "slug": "the-daring-game-for-girls", "name": "The Daring Game for Girls", "name_original": "The Daring Game for Girls", "description": "<p>\n      Based on the best-selling The Daring Book for Girls series comes a fun, \n      interactive adventure that celebrates the independent female spirit. \n      Earn essential gear as you explore, play, learn and make new friends. \n      Whether it’s rafting the Amazon, climbing Mt. McKinley or embarking on \n      an African Safari, all of the inspiring activities within are designed \n      especially for daring girls like you!\n    </p><p>\n      Features\n    </p><p>\n      • Based on the best-selling, how-to book, The Daring Book for Girls<br/>• \n      A fun and informative adventure with 3 distinct environments and \n      numerous mini-game challenges to earn gear, inventory and collectibles<br/>• \n      Choose between 2 modes - Move through the main adventure or cut straight \n      to your favorite mini-games to try and set a new high score<br/>• Pick \n      from one of several character models with a wide range of ethnicities \n      and features<br/>• Play a variety of thrilling games and activities like \n      freeze tag, double dutch, basketball, spy games, building a camp fire \n      and cave exploring<br/>• Test your entrepreneurial spirit by selling \n      goods and lemonade at your own corner stand and use your profits to \n      purchase new activities and expand on existing ones at neighborhood \n      stores<br/>• Learn educational facts about famous women in history and \n      then excel in Pop Quizzes<br/>• Make in-game friends by giving out \n      friendship bracelets, friendship pins, flowers, or other crafted items<br/>• \n      Become a true Daring girl by earning all 6 types of Daring Girl Badges \n      like Girl Lore, Life Skills and World Knowledge\n    </p>", "metacritic": null, "released": "2009-11-11", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/565/56587e6f78a22a976d3f8a9f602873d5.jpg", "website": "http://www.daringgameforgirls.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 203, "game_series_count": 0, "reviews_count": 0, "platforms": ["Nintendo DS", "Wii"], "developers": ["WXP"], "genres": [], "publishers": ["Majesco Entertainment"], "esrb_rating": null}