{"id": 244805, "slug": "construct-pro", "name": "Construct PRO", "name_original": "Construct PRO", "description": "<strong>Construct PRO</strong> is a sandbox-designer, where you can assemble any structure using metal parts, bolts, and nuts and test its physical behavior.<strong>Currently the game has the following features:</strong>•\tassembly of a model using 29 parts<br/>•\tsaving the model in a simple text file and further uploading the model from there<br/>•\tenabling the gravity to check physical behavior of the assembled structure<br/>•\tchanging the bolt properties (whether they are screwed on tightly or not) both in assembly of the model and with enabled gravity <br/>•\tremoval of bolts/parts both at assembly of the model and with enabled gravity<br/>•\tapplication of a special Boltogun, capable to destroy any model<br/>•\tuse of electric motor for rotating the part  attached to it<br/>•\ttest prototype with possibility to complete the game with it: you should assemble a model capable to overcome all obstacles and reach the finish line<br/>•\tbugs (well, after all, it's an early access stage)Do the parts become available gradually?Currently there are 29 parts in the game and all of them are available from the very first minute.Can I complete the game?In my opinion, the sandbox games may have no completion; however, there is a goal in the Early Access version: to reach the finish line of the test prototype.I want to ride my assembled car across vast, endless areas!Do you really believe it's exciting? This is not a race; it's a puzzle for brainstorming, not senseless moving around the same locations. (at least at Early Access stage =))Can I connect two electric motors?Um, it seems I forgot to fix it...Are there hats in the game?No. Who are you going to put them on? On a Boltogun? Then contact our developer and I'll add them =)Who turns the Boltogun wheel?Magnetic power of indie-developers.How it works?Now let's see how the game process looks like. Let's build a simple mill, for example. After pressing \"Start assembly\", the camera immediately takes us to the shelf with parts relaxing on it, as if it was a sunny beach. We choose the largest one and pull it aside using wasd buttons.<br/><br/><br/><br/>We'll need an \"autonomous\" electric motor, so we choose it and bring it to our first part. We arrange it in a way, so that the holes for fasteners are opposite to each other. After a competent click on space button, our parts are pulled up and we see inseparable bolts and nuts. I select both bolts and press space button again. The motor is pleased with its attachment joining and is ready to rotate something on its shaft. Wheel? No problem! We expand it with ctrl q, bring it to the motor shaft end, press the spacebar, and select the nut.<br/><br/><br/><br/>Using elongated parts with five holes, we supplement it with four blades. For a change, I'll place the same construction, with shorter blades on the opposite side. Now we should just affix the feet to our mill by attaching long bars with eight holes. Done! Let's see what we got. We enable gravity with G button.<br/><br/><br/><br/>Something went wrong... These nuts need to be screwed on more tightly! I turn off the gravity, select the nut and tick \"Screw on tightly\" for all nuts. Checking! We rotate the motor with x and v buttons (you can change them by clicking arrows on the motor). It seems that everything runs smoothly. Congratulations! You've just finished the course of beginning engineer and are ready to get down to designing something more interesting!<br/><br/>", "metacritic": null, "released": "2018-10-09", "tba": false, "updated": "2019-08-28T21:52:55", "background_image": "https://media.rawg.io/media/screenshots/106/106ae6d86333c671d7abf1d859b3202d.jpg", "website": "https://for2questions.wixsite.com/construct-pro", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 9, "ratings_count": 0, "suggestions_count": 301, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["EnterUserNamePlease"], "genres": ["Simulation"], "publishers": ["EnterUserNamePlease"], "esrb_rating": null}