{"id": 244886, "slug": "london-detective-mysteria", "name": "London Detective Mysteria", "name_original": "London Detective Mysteria", "description": "Her Majesty the Queen’s birthday was to be the heiress of House Whiteley’s debut into high society, but an inquiring mind begs for more than parties as she stumbles into the many curiosities that lay hidden in London’s darkest corners. Help sharpen Lady Whiteley’s instincts as a budding detective, take control of her present to uncover the mysteries of her past, and grow an unbreakable bond with one of many dashing personalities from well-known works of fiction. <br/><br/><br/><br/><strong>Find Your Destined One</strong><br/>Find love with personalities inspired by famous figures and works of fiction, including Detective Holmes, Gentleman Thief Lupin, Jack the Ripper, and more.  <br/><br/><strong>Take Control of the Story</strong><br/>Decisions made throughout will net not only special rewards, but will shape whether love is in Lady Whiteley’s future or if fate has more unfortunate consequences in mind.<br/><br/><strong>An Extra-Customizable Visual Novel</strong><br/>Change Lady Emily Whiteley’s first name for a personal touch, then further customize your playing experience by adjusting text speed, toggling visual effects, and even adjusting the individual speaking volumes of your favorite characters.<br/><br/><strong>Coming to PC for the First Time</strong><br/>London Detective Mysteria comes to Windows PC for the first time, with both it and the English \"PlayStation®Vita\" version including all content previously exclusive to the Japanese PlayStation Vita version known as Eikoku Tantei Mysteria: The Crown.", "metacritic": null, "released": "2018-09-25", "tba": false, "updated": "2019-09-04T14:31:02", "background_image": "https://media.rawg.io/media/screenshots/39f/39fb3e5bedca52fe29c244582b6fd47d.jpg", "website": "http://www.xseedgames.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 19, "beaten": 2, "toplay": 4, "dropped": 1}, "playtime": 13, "achievements_count": 20, "ratings_count": 3, "suggestions_count": 441, "game_series_count": 0, "reviews_count": 3, "platforms": ["PS Vita", "PC"], "developers": ["XSEED Games", "Karin Entertainment"], "genres": ["Adventure", "Casual"], "publishers": ["XSEED Games", "Marvelous USA"], "esrb_rating": null}