{"id": 244825, "slug": "witches-legacy-lair-of-the-witch-queen-collectors-", "name": "Witches' Legacy: Lair of the Witch Queen Collector's Edition", "name_original": "Witches' Legacy: Lair of the Witch Queen Collector's Edition", "description": "A few years have passed since you rescued Lynn from Elizabeth, the witch who murdered her family, and now Lynn has grown into a young woman with awakened magical powers. When she receives a letter from Germany about Elizabeth, Lynn opens a portal to chase after her. Her thirst for revenge has enraged her, and an evil force is using that to pull Lynn deep into the darkness. You must find your young ward and stop her before the Witch Queen's evil plan comes to pass in Witches' Legacy: Lair of the Witch Queen, a cunning Hidden-Object Puzzle Adventure game. <br/>\n<br/>\r\nThis is a special Collector's Edition release full of exclusive extras you won’t find in the standard version. The Collector’s Edition includes:<br/>\n<br/>\r\nIntegrated strategy guide<br/>\r\nEarn achievements!<br/>\r\nBonus chapter featuring an extended epilogue!<br/>\r\nReplay puzzles<br/>\r\nWallpapers, screensavers, and soundtrack<br/>\n<br/>\n<br/>\r\nThis is a Hidden Object Puzzle Adventure game, meaning a specific genre of story-driven, point &amp; click adventures. Throughout the game, players are tasked to find a list of objects hidden within a particular scene, and to occasionally complete various mini-games/puzzles.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:52:53", "background_image": "https://media.rawg.io/media/screenshots/f63/f63306fa00913407549ce06f808564d0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 6}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 555, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["EleFun Games"], "genres": ["Adventure", "Casual"], "publishers": ["Big Fish Games"], "esrb_rating": null}