{"id": 244880, "slug": "perception-remastered", "name": "Perception: Remastered", "name_original": "Perception: Remastered", "description": "Using sound as her sight, Cassie explores Echo Bluff, desperate to unravel its sordid history. But she’s not alone a deadly entity called The Presence stalks the mansion’s halls. Cassie needs sound to be able to see, but every noise she makes draws The Presence closer. A careful balancing act is required if she wants to discover why she’s there, and why the house won’t let her leave. <br/><br/>•\t'See' using echolocation. Every sound creates a visual.<br/>•\tEngage in a deadly game of hide and seek.<br/>•\tTrigger radical change at the Estate at Echo Bluff each time you solve its mysteries. <br/>•\tEncounter an emotional journey that spans centuries, and in the end, uplifts any underdog who had ever been told no.<br/><br/>Accolades:<br/>Game of the Year – The Bit Awards<br/>Best in Show – Boston Festival of Indie Games<br/>Best Narrative – Boston Festival of Indie Games<br/><br/>“...managed to keep me on the edge of my seat, forcing me to solve a compelling mystery by facing what lurked in the dark” – Game Informer, 8.25<br/><br/>1 player<br/>4GB minimum save size<br/>DUALSHOCK®4<br/><br/>  Software subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service &amp; playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.<br/><br/>Ⓒ 2018 The Deep End Games", "metacritic": null, "released": "2018-09-27", "tba": false, "updated": "2019-08-02T16:20:28", "background_image": "https://media.rawg.io/media/screenshots/d0a/d0ad3f774f4cc202959f4d7cdf63988f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 324, "game_series_count": 0, "reviews_count": 0, "platforms": ["PlayStation 4"], "developers": ["The Deep End Games"], "genres": [], "publishers": [], "esrb_rating": "Mature"}