{"id": 244845, "slug": "warrior-fighter", "name": "Warrior Fighter", "name_original": "Warrior Fighter", "description": "The warriors of history fight for immortal glory.<br/><br/>Warrior Fighter pits the most skilful warriors of all time against each other in a one on one fighter, combining cinematic presentation with ultra fast moves and play. From the imperial palace of Rome to the streets of the future choose single player mode to conquer all eight of the warriors one at a time, or two player challenger mode to fight warrior against warrior.<br/><br/><br/><br/><strong>Mortem - Centurion General of the Northern Roman Army, his strategic command only excelled by his skill on the battlefield</strong><br/><br/><strong>Predator - Advanced automated weaponry system, never sleeps, hunts to kill its prey</strong><br/><br/><strong>Jolly Roger - Feared on all of the seven seas, the greatest swordsman buccaneer that lived, laughed and raided the high seas</strong><br/><br/><strong>Ragnarok - Favoured warrior of Thor and Odin, his mighty axe has fallen many</strong><br/><br/><strong>Ronin - Masterless Samurai, Katana of two names Inazuma- lightning strike and Ikazuchi- thunder</strong><br/><br/><strong>Armageddon - Knight victorious, rampant on the battlefield and in tournament unrivalled, the heart of the lion</strong><br/><br/><strong>Anarchy - Fights for mayhem, rules the streets, brings civil disorder that no society can control</strong><br/><br/><strong>Apocalypse - Mercenary warrior, fights for many flags and for the honour of skill in combat</strong>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:52:52", "background_image": "https://media.rawg.io/media/screenshots/6c8/6c8ee095529f529d9821b082378cfcac.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 519, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["A Reality Systems"], "genres": ["Action"], "publishers": ["A Reality Systems"], "esrb_rating": null}