{"id": 244855, "slug": "exiled-to-the-void", "name": "Exiled to the Void", "name_original": "Exiled to the Void", "description": "Year 2107. Humanity begins active exploration of the Oort Cloud far beyond the orbit of Pluto. Mining stations and interstellar flight preparation bases start to emerge in this dark, primordial area.<br/>Year 2108. Human activity violates the fragile gravitational balance, which, as it turned out, was maintained in the Oort Cloud since the formation of the Solar system. Millions of comets descended from their orbits, destabilizing the Scattered Disk and the Kuiper Belt and collapsing a chaotic downpour into the inner regions of the Solar system.<br/>Year 2111. Civilization is virtually destroyed. The cities of the Earth and the colonies on the Moon and Mars are critically damaged. Remaining survivors are scattered throughout the Solar System, trying to build a new life in drastically worsening conditions.<br/>Year 2118. The technology of plasma deflectors is mastered - high-energy shields boosted by enormously powerful magnets appear to be reliable enough to stop an approaching comet or asteroid with a diameter of tens of meters. By setting up the production of defensive stations and covering a number of small celestial bodies with deflectors, humanity gets a second chance, shallow, yet still existent.<br/>Year 2125. You are the captain of a tiny space station. You lost the struggle for a place in the safe orbit of Mars and were forced to move to a less hospitable zone - into the orbit of Europe, one of the Jovian moons. Outlook is grim: you have only two dozen people and an extremely small reserve of vital resources. Radiation, hunger and despair can quickly put an end to the existence of your small commune. Can you build a prosperous space society from such humble origins?Gameplay details:In this strategy game you act as captain of an orbital station, trying at all costs to survive and save all the fellow people who have trust in you. You start in the orbit of Europe, but gradually, as your develop the station and research new technologies, you will be able to build stations in orbits of other Galilean satellites of Jupiter - Ganymede, Callisto and Io. Moreover, you will be able to construct surface bases to extract more resources and support more population, as well as defensive stations - to minimize the impact risks with the help of plasma deflectors and railguns.<br/><br/>Develop your orbital habitat, enhancing it with additional modules for various purposes. Monitor the needs of the population, extract resources and distribute them fairly. Over time, your initial bunch of outcasts can turn into a proud self-sustaining space nation!<br/><br/>The game is a sandbox with a storyline. The final goal is to prepare your society for going beyond the Jovian system. This can be achieved by studying all available technologies and building a sufficiently developed society on the moons of Jupiter. In the meantime, you can select either the path of cyborgization and mind uploading or try to remain more biological than non-biological and focus on genetic improvement instead. Good luck!", "metacritic": null, "released": "2018-11-23", "tba": false, "updated": "2019-08-28T21:52:51", "background_image": "https://media.rawg.io/media/screenshots/8d8/8d8bd33f28bf9b6e1ce3878364e2de8e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 79, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Wonderbox Games"], "genres": ["Strategy", "Indie"], "publishers": ["Wonderbox Games"], "esrb_rating": null}