{"id": 244917, "slug": "real-money-racing-skillz", "name": "Real Money Racing Skillz", "name_original": "Real Money Racing Skillz", "description": "*The Worlds First Racing Game Where Players Can Win Real Money and Prizes*<br/><br/>Real Money Racing Skillz is the latest  in the genre of endless arcade traffic racing games. Drive your car through highway traffic in different sceneries, earn cash, upgrade your ride and buy new cars. <br/><br/>This special edition of Real Money Racing features the Skillz multiplayer game platform which allows yo to compete against players from around the world for real money and prizes.<br/><br/>KEY FEATURES<br/>- Stunning 3D graphics and Environments<br/>- Ultra realistic car handling<br/>- 17 different cars to choose from including VW Golf 4 GTI, Ford Mustang Shelby GT500, Mclaren P1, Bugatti Chiron, Ferrari Formula 1<br/>- Highly detailed environments: suburb, desert, snowy, beach and lake<br/>-Endless game play<br/>- Basic customization through paint and rims and police lights.<br/>- Over 10 different models for traffic <br/>- Game Center Leagues, Achievements and Trophies<br/>- iOS 7 MFi controller support<br/>- Rich language support<br/><br/>GAMEPLAY<br/>- Touch to steer<br/>- Touch gas button to accelarate<br/>- Touch brake button to slow down<br/>- Touch hooter to honk<br/>- Touch Nos button for N02 boost<br/><br/>TIPS<br/>- The faster you go the more scores you get<br/>- When driving over 100 kmh, overtake cars in traffic closely to get bonus scores and cash<br/>- The more risks the more cash you earn<br/>Real Money Racing Skillz is constantly updated with new features. We would appreciate your rating as we constantly look for ways on improving your gaming experience.<br/><br/><br/><br/>FOLLOW US<br/>* facebook.com/PlayPay-696697187117434/<br/>* twitter.com/PlayPayGaming", "metacritic": null, "released": "2017-01-18", "tba": false, "updated": "2019-07-29T13:48:46", "background_image": "https://media.rawg.io/media/screenshots/d25/d259b696dd6c426a83fa550865498fb9.jpg", "website": "http://playpaygames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 84, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Justin Graysmark", "ePlay Studios"], "genres": ["Simulation", "Sports", "Racing"], "publishers": ["Justin Graysmark", "ePlay Studios"], "esrb_rating": null}