{"id": 24492, "slug": "buck-fever", "name": "Buck Fever", "name_original": "Buck Fever", "description": "<p>\n      Take aim and bring the ultimate arcade hunting experience to your Wii. \n      Set your sights on dozens of wildlife species and take your shot with \n      simple point and shoot controls. Bag trophies in six different regions, \n      each with their own unique wildlife and terrain, as you hone your skills \n      and become a master hunter. Go it alone or invite your friends as you \n      compete in the ultimate shooting challenge.\n    </p><p>\n      Features\n    </p><p>\n      • Arcade Hunting: Buck Fever brings the familiar “point and \n      shoot” arcade action to your living room. Instead of stalking your \n      target you immediately get into the hunt and start shooting. Choose a \n      region on the in-game Hunting Map (such as Western, Central, Eastern, \n      Southern, and Southwestern United States, and four Canadian provinces) \n      and compete for the top seat on the in-game High Score leaderboard. Buck \n      Fever supports the Wii Zapper accessory.<br/>• Multiplayer Party Mode: \n      One to four players can join in on a hunt simultaneously. Buck Fever \n      features two unique multiplayer “party” modes: Hunter’s Challenge and \n      Bonus Games. In the Hunter’s Challenge one to four players compete \n      within a time limit for the highest score. In six Bonus Games one to \n      four players compete in a timed shoot-out with inanimate objects (such \n      as bottles and cans) or animal targets such as gopher and duck.<br/>• Trophy \n      Room: Buck Fever features a Trophy Room that, per player, shows off \n      the diverse wildlife you’ve bagged in the game’s 70 hunts including, but \n      not limited to, desert mule, blacktail, fallow, mule, and whitetail \n      deer, and wild boar. The Trophy Room also displays how many bucks you \n      have hunted, the number of one-shot kills you have earned, the biggest \n      buck you’ve brought down, and the highest overall score achieved while \n      playing the game.\n    </p>", "metacritic": null, "released": "2009-11-12", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/ee9/ee9e5328f5fab5aca59485c531c1fe03.jpg", "website": "http://destineergames.com/games/wii/buckfever/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 352, "game_series_count": 0, "reviews_count": 0, "platforms": ["Wii"], "developers": ["N-Fusion Interactive Entertainment"], "genres": [], "publishers": ["Destineer"], "esrb_rating": null}