{"id": 244992, "slug": "pirate-tales", "name": "Pirate Tales", "name_original": "Pirate Tales", "description": "It is a PIRATE REVOLUTION in the genre! Pirate Tales are about to board your device with some brand new action RPG experience. Become a pirate captain, the terror of the seas, and be known as the most fearsome pirate alive!<br/><br/>EASY TO PLAY, HARD TO MASTER<br/><br/>Thrilling graphics, spectacular soundtrack, dynamic battles with QTE and lots of ways to define the outcome of the battle. You have never seen a game like this before!<br/><br/>PUT TOGETHER A CREW<br/><br/>Dreaming of being the true captain? Here's your chance! Gather different well-known characters, including Davy Jones, Francis Drake, Blackbeard, Montezuma, Columbus, and many others – each with their unique abilities, stats, and factions. Upgrade your heroes to become more powerful and conquer the seas!<br/><br/>DISCOVER THE WORLD<br/><br/>Explore many dangerous locations full of adventures. Complete exciting storylines and get worthy rewards!<br/><br/>PURSUE THE FLYING DUTCHMAN<br/><br/>Have you heard about the legendary ghost ship that can never make port and is doomed to sail the oceans forever? Would you have it as your sail? Try and prove that you are a true pirate captain!<br/><br/>CHALLENGE OTHER CAPTAINS<br/><br/>Take part in different exciting PvP tournaments and show all your opponents who be the best pirate upon the high seas! Conquer the marine domain, protect your lands, and expand your influence! Take your rightful place among the famous captains of all times.<br/><br/>SUBSCRIBE AND GET RICHES. AND A RANK!<br/><br/>You can buy a subscription and get 300 gold coins a day while it’s active. Subscription costs 19.99 USD per month.<br/><br/>You can also acquire one of the following Ranks:<br/><br/>The Admiral Rank allows you to “hire” an in-game assistant - the First Mate, as well as unlocks Rank Avatars, access to extra Events and 8 free stamina recoveries a day for your Heroes throughout the term of subscription.<br/>Subscription costs 9.99 USD per week. <br/><br/>The Vice Admiral Rank allows you to “hire” an in-game assistant - the First Mate, as well as unlocks Rank Avatars, access to extra Events and 3 free stamina recoveries a day for your Heroes throughout the term of subscription.<br/>Subscription costs 4.99 USD per week. <br/><br/>The Captain Rank allows you to “hire” an in-game assistant - the First Mate, as well as unlocks a Rank Avatar throughout the term of subscription.<br/>Subscription costs 3.99 USD per week. <br/><br/>You can switch between Ranks at any time. Only one Rank can be active at any given time.<br/><br/><br/>Once you’ve confirmed your subscription, your account will be debited appropriately. Your subscription will be renewed automatically in the beginning of each new period, unless you opt out of auto renewal at least 24 hours before the end of the current subscription term. You can switch off the auto renewal at any time in your iTunes account settings.<br/><br/>Prices are in US dollars. Your home region may display prices in different currencies, reflecting the appropriate exchange rate.<br/><br/>_________________________________<br/><br/>Terms of use: https://crazypandagames.com/en/user-agreement/<br/>Privacy policy: https://crazypandagames.com/en/privacy-policy/", "metacritic": null, "released": "2018-04-22", "tba": false, "updated": "2019-07-29T13:10:57", "background_image": "https://media.rawg.io/media/screenshots/e68/e689f1c432600b17531563cb25cc148c.jpg", "website": "http://playpiratetales.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 294, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Crazy Panda"], "genres": ["Action", "Adventure"], "publishers": ["Crazy Panda"], "esrb_rating": null}