{"id": 245030, "slug": "strike-of-nations-ww3-mmo", "name": "Strike of Nations | WW3 MMO", "name_original": "Strike of Nations | WW3 MMO", "description": "Manufacture powerful tanks, forge alliances and together command your army into this modern World War strategy game full of action. Launch massive military campaigns to nuke your enemies and eventually capture the nuclear base.<br/><br/>• Command your army<br/>• Construct panzers<br/>• Plan military operations<br/>• Nuke PVP enemies<br/>• Join rogue allies<br/>• Conquer nuclear base<br/><br/>Open-world map<br/>A huge world map where players can fight each other, but also chat &amp; make alliances. Side by side, gather resources and fight the roaming bands of dangerous mercenaries!<br/><br/>An extensive collection of tanks<br/>Manufacture your armies from all kinds of modern tanks and vehicles. Train MBTs, tank destroyers, mobile artillery tanks, ballistic missile carriers and armored vehicles each with their own strengths &amp; weaknesses.<br/><br/>The nuclear option<br/>Dominate the battlefield and take control of the central nuclear base and become the military Emperor. Grant favorable titles to your allies and brand your enemies as bandits. Order a nuclear strike and destroy complete areas as a show of force and power!<br/><br/><br/>Powerful generals and legendary equipment<br/>Hire powerful generals under your command, each with their own skills and unique bonuses. Produce all kinds of equipment and gear. Don't forget to change your tanks loadout accordingly to your strategy.<br/><br/>Research technologies<br/>Research all kinds of economic and military technologies to suit your strategic needs, balance your economy and update your army to increase your capabilities and dominate the battlefield.<br/><br/>Massive military campaigns<br/>Rally your allies and launch massive military campaigns together to take down the mightiest rivals.<br/><br/>Events and updates<br/>Take part in all sorts of tides to increase your power and collect fantastic rewards. Join the worldwide events, where all the players must collaborate to succeed or join the cross-server fights and prove your server’s superiority, with constant updates and new features. The fun never stops!<br/><br/>Do you have what it takes to seize the title of the Emperor and push the red button?<br/>Join the fight now and be the master of your destiny!", "metacritic": null, "released": "2018-09-27", "tba": false, "updated": "2019-10-22T14:13:11", "background_image": "https://media.rawg.io/media/screenshots/cd2/cd202430cfcec9f99ea83a5e3f5d7b9b_OGkf8Bz.jpg", "website": "http://www.facebook.com/strikeofnations/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 452, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Babil Games"], "genres": ["Action", "Strategy"], "publishers": ["Babil Games"], "esrb_rating": null}