{"id": 245050, "slug": "words-inc-endless-vocabulary-definition-competitio", "name": "Words Inc - Endless Vocabulary Definition Competition", "name_original": "Words Inc - Endless Vocabulary Definition Competition", "description": "Test your verbal prowess in this fun and challenging game that requires intense concentration and a mastery of words. Words Inc is also a great way to improve your vocabulary!<br/><br/>The rules are simple - tap the word that correctly matches the definition shown on the screen before time runs out, or swipe away incorrect words to get more time.  The game is (virtually) endless - see how many vocabulary words you can correctly answer in a row.  <br/><br/>The catch? The difficulty of the words keep scaling higher and higher until it requires every ounce of concentration to get the next word correct!<br/><br/>Connect to Facebook to see how your score ranks among your friends.  Connect via Game Center and compare your score with the rest of the world.<br/><br/>Get higher scores by using one of three power-ups - pass! to skip a word, freeze! to stop the timer, and remove! to eliminate one incorrect choice.  Power-ups reactivate every 4 words of the same type you get right.  Purchase power-ups with credits earned by answering correctly or swiping away incorrect words.<br/><br/>Advance through the 14 different grades of vocabulary mastery by accomplishing different challenges such as scoring a certain amount of points or mastering a number of words.<br/><br/>How many words do you think you know?  How good do you think you vocabulary really is?  There's only one way to find out!", "metacritic": null, "released": "2015-01-20", "tba": false, "updated": "2019-10-22T14:13:11", "background_image": "https://media.rawg.io/media/screenshots/67e/67eca668cc99ac2da05f8e14504301c3.jpg", "website": "http://www.facebook.com/playwordsinc", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 39, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Esper"], "genres": [], "publishers": ["Esper"], "esrb_rating": "Teen"}