{"id": 245083, "slug": "notguilty", "name": "(not)Guilty", "name_original": "(not)Guilty", "description": "(not)Guilty is a role-playing text-based game about the crime and punishment in this day and age. See why we are one of the best rpg text based best interactive story games! <br/>Make decisions, choose your own path and expect even the unexpected!<br/>Download now and explore stories that will tickle your fantasy &amp; entertain you to the fullest!<br/><br/>PROVE THAT YOU ARE NOT GUILTY<br/>In this text based role playing game you are accused of a crime which you didn’t commit.<br/>Now you are placed in one of the most dangerous prisons in the country - in EDEN prison. Your main goal here is to survive at any cost. <br/>Can you find a real killer? Can you survive in EDEN? Can you prove that you are not guilty in the courtroom?<br/>Only you decide where this story will go.<br/><br/>MULTIPLE ENDING SCENARIOS – EVERY DECISION MATTERS<br/>Read carefully, and get into the role. This story will end differently and it all depends from your decision. Awake your fantasy, and put your body and soul into the game. Be sure that these storylines will be really complex and detailed, so be careful. As a game with interactive stories &amp; text rpg with lovely UI &amp; design, you can enjoy relaxingly this amazing adventure for hours and hours..<br/><br/>FEATURES:<br/>- RPG text story game<br/>- gripping &amp; interesting stories (original)<br/>- multiple complex storylines<br/>- interactive rating system<br/>- various ending scenarios<br/>- minimalistic and simple design for comfortable gaming experience<br/>- available in English and Russian languages<br/>- 3 complete interactive story text based scenarios<br/>So what will it be?<br/>Can you shape your own future and complete the stories to fit your desires and goals?<br/>Choose your path story &amp; enjoy one of the best text adventure games.<br/><br/><br/>REGARD: SUBSCRIPTION<br/><br/>• Title of publication or service<br/>not(Guilty) Package<br/>***********************<br/>guiltyStories2<br/>guiltyStories3<br/>guiltyStories4<br/>guiltyStories5<br/>ALL Contents include!!!!<br/>-Various stories will be added in the future-<br/>***********************<br/><br/>• Length of subscription (time period and content or services provided during each subscription period)<br/>1 mounth<br/>payment will be charged to iTunes Account at confirmation of purchase<br/><br/>• Subscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the current period<br/>• Account will be charged for renewal within 24-hours prior to the end of the current period, and identify the cost of the renewal<br/>• Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user's Account Settings after purchase<br/>• Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that publication, where applicable<br/><br/>– A link to the terms of use<br/>http://riyoukiyakutermsofservice.blogspot.com/2017/02/blog-post.html<br/>– A privacy policy link in the Privacy Policy URL field of iTunes Connect<br/>http://pprivacyppolicy.blogspot.com/2017/03/arata1972-inc.html", "metacritic": null, "released": "2017-05-16", "tba": false, "updated": "2019-10-22T14:13:12", "background_image": "https://media.rawg.io/media/screenshots/2f9/2f9696f409cf6ef9acca54e3fe5a62eb.jpg", "website": "https://www.facebook.com/pg/NotGuilty-1392287220886004/about/?ref=page_internal", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 11, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Takumi Sato"], "genres": ["Adventure", "RPG"], "publishers": ["Takumi Sato"], "esrb_rating": "Everyone 10+"}