{"id": 245005, "slug": "the-perfect-square", "name": "The Perfect Square", "name_original": "The Perfect Square", "description": "If you hate being called a square, this game may not be for you. Climb the leaderboard to see if you have the fastest reflexes. Earns coins when the square is perfectly placed. If the square is misplaced, that is game over for you! But don't worry we will give you a second chance. Life is better that way. <br/><br/>- Competitive Leaderboards<br/><br/>- Unlock awesome squares<br/><br/>- Challenge and share with friends<br/><br/>SUBSCRIPTION PRICING AND TERMS<br/><br/>-Square Membership is an Auto-Renewing Subscription<br/><br/>-Free 3-day trial then $7.99/week auto-renewing subscription<br/><br/>-With the Square Membership user will earn x2 Points &amp; x2 Coins every single game. The user will also have no banner ads, no ads between games, and no ads when receiving a second chance.<br/><br/>-Payment will be charged to iTunes Account at confirmation of purchase<br/><br/>-Subscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the current period<br/><br/>-Account will be charged for renewal within 24-hours prior to the end of the current period, and identify the cost of the renewal<br/><br/>-Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user's Account Settings after purchase<br/><br/>-Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that publication, where applicable<br/><br/>Canceling trial or subscription <br/><br/>You can turn off the auto-renew for the subscription whenever you want to through iTunes. Check https://support.apple.com/HT202039. When your current trial/subscription period expires, you will be unsubscribed. The current active subscription period cannot be canceled. After your subscription expires, you will no longer be able to use elements included in Subscription option. <br/><br/>Privacy Policy - http://toolitmedia.com/PrivacyPolicy.php<br/>Terms of Use - http://toolitmedia.com/TermsOfUse.php<br/><br/>If you have any questions or comments, feel free to contact us at toolitmedia@gmail.com", "metacritic": null, "released": "2018-03-22", "tba": false, "updated": "2019-10-22T14:09:17", "background_image": "https://media.rawg.io/media/screenshots/90d/90d33c20a80e5c8557b6f1f90633e321.jpg", "website": "http://toolitmedia.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 12, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Toolit Media"], "genres": ["Arcade", "Puzzle"], "publishers": ["Toolit Media"], "esrb_rating": "Everyone 10+"}