{"id": 245090, "slug": "laytons-mystery-journey-sk", "name": "LAYTON’S MYSTERY JOURNEY – Starter Kit (ios)", "name_original": "LAYTON’S MYSTERY JOURNEY – Starter Kit (ios)", "description": "<p>Play Case 01: ‘The Hand That Feeds’ for free in this Starter Kit version!<br />\nDeveloped by LEVEL-5, LAYTON’S MYSTERY JOURNEY™: Katrielle and the Millionaires’ Conspiracy is the latest game in the best-selling Layton Series and first official sequel debuting on mobile. The Starter Kit version features the prologue and first case for free. Additional cases are available as separate in-app purchases.<br />\nJoin Katrielle Layton in the heart of London as she becomes embroiled in a casual, comical, quizzical quest that has its roots in our new hero’s search for her missing father: Professor Hershel Layton. You’ll be whisked around London’s famous landmarks, from the Houses of Parliament to Tower Bridge. Follow Kat on her trusty bicycle, solving case after unlikely case, until she unwittingly uncovers the Millionaires’ Conspiracy.<br />\nHelp Kat and company discover clues, unravel mysteries, deduce the truth and solve original puzzles! Redecorate the agency and redress Kat in various outfits to suit the case at hand (or your mood). With twelve intriguing cases, seven multi-millionaires and one whopper of a conspiracy, will Kat ever be able to find the missing professor?<br />\nFull of ingenious challenges, charming characters and clever plot twists, the latest Layton instalment will prove to you beyond a shadow of a doubt that the truth IS stranger than fiction!<br />\nGame Features<br />\n·       Modern, female protagonist<br />\n·       The largest collection of puzzles in any Layton Series&#39;™ title<br />\n·       Bonus! Daily puzzles delivered directly to your mobile device<br />\n·       New cast of characters (and some favourites from the past)<br />\n·       High-quality, visually rich gaming experience<br />\n·       Customisable costumes and room decor<br />\n·       Additional minigames<br />\n·       Offline play after initial download<br />\nCase Collection 1 (includes cases 2 - 4)<br />\nCase Collection 2 (includes cases 5 - 8)<br />\nCase Collection 3 (includes cases 9 - 12)<br />\nFull Kit (includes cases 2 - 12)<br />\n<em>This game can be played in English, French and Spanish. Other languages cannot be selected in your region.<br />\n</em>*Bonus daily puzzles will require an Internet connection for accessibility &amp; download.</p>", "metacritic": null, "released": "2018-01-24", "tba": false, "updated": "2023-03-01T12:05:34", "background_image": "https://media.rawg.io/media/screenshots/8a7/8a7dab575911a2e446804955c86ef219_sP75svH.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 139, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["h.a.n.d."], "genres": ["Adventure", "Puzzle"], "publishers": ["Level-5"], "esrb_rating": "Everyone 10+"}