{"id": 245193, "slug": "archer-animal-hunting-game-3d-free", "name": "Archer Animal Hunting Game 3d free", "name_original": "Archer Animal Hunting Game 3d free", "description": "Show your skills with bow and arrow to feel the thrill and adventure of real hunting<br/>John is expert bow arrow archer. He started his quest of wild animal hunting in deep forests and lake view sides. Use strategy and bow arrow archery skills expertly to hunt wild animals.  Challenge your pro skills to hunt stags, pigs, bears, elephants, wolfs and lions. You also have to take care by staying john and safe distance from the beasts else they will attack john to eat his flesh. Bring forth your arrow bow skills to fight with almost all wild animals. Archer animal hunting takes you to real jungle environment and gives you a chance to feel the real archery action on your smart apple phone much more then entertainment. Master your arrow and bow skills. Become assassin animal killer. <br/>How to Play<br/>- Move john left/right/forward/backward by joystick present at left side of iphone device.<br/>- Tap on arrow to shoot arrow located right side of ipad device.<br/>- Just above arrow there is zoom option to take a close look at animals.<br/>- Keep eye on time. <br/>- While hunting dangerous animals like lion and wolf stay at a safe distance from them.<br/>Features<br/>- top ios free offline jungle  hunting game.<br/>- Excellent bow arrow physics and controls implemented.<br/>- Supports all Apple devices.<br/>- realistic 3d graphics with dynamic lighting and amazing killing effects.<br/>- brutal Action now on your smart ipads.<br/>- User friendly GUI and controls.<br/>- real adventuring forest Environment looks like adventure movies.<br/>- Support for hd iphone, ipad devices.<br/>- game with Good quality sound effects.<br/>- Efficient player controls &amp; movement.<br/>- Best downloading gun shoot game in apple gaming world", "metacritic": null, "released": "2016-01-11", "tba": false, "updated": "2019-07-05T03:25:21", "background_image": "https://media.rawg.io/media/screenshots/12f/12ff231b19189a9b905db3dd01eeb981.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 155, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Nasir Butt"], "genres": ["Action", "Adventure"], "publishers": ["Nasir Butt"], "esrb_rating": "Mature"}