{"id": 245189, "slug": "football-soccer-game-free", "name": "Football Soccer Game free", "name_original": "Football Soccer Game free", "description": "***Get ready for extreme real football and become a top soccer player<br/><br/>Select your favorite country compete with toughest football teams to become hero.<br/>Smooth game play and stunning graphics will take you to dream football stadium where you are controlling your team like a manager and make every player come to life on your screen during games. Fight and show skills to acquire soccer, conquer opponent team defense to score goal. <br/><br/>How to Play<br/>- Use Joystick to control the movement of player present left bottom of your iphone ipad    device.<br/>- Press ‘Shoot’ to kick the ball present right bottom of your apple mobile.<br/>- Tap ‘Sprint’ to move the player fast.<br/>- Adjust camera to your comfort zone by swiping anywhere on your ipad.<br/>- Tap’ Pass’ to pass the football to your fellow team member present just above sprint.<br/>- Tap ‘Tackle’ to snatch the football from opponent.<br/>- In penalty section you can hit ball by swiping anywhere on iphone mobile to kick.<br/>Features<br/>- best ios free offline football shoot game.<br/>- Supports all apple devices.<br/>- Realistic 3d graphics with dynamic lighting and amazing stadium effects.<br/>- Over 15 animations of players.<br/>- top flick shoot game. <br/>- look like real live football match on your apple mobile.<br/>- game with user friendly GUI and controls.<br/>- Soccer war now on your hd iphone, ipad devices.<br/>- Good quality sound effects.<br/>- Efficient player controls &amp; opponent team player AI.", "metacritic": null, "released": "2016-01-23", "tba": false, "updated": "2019-07-05T03:24:51", "background_image": "https://media.rawg.io/media/screenshots/957/957803a5de544e91aaffbd63dc88d6a1_Xh4uN4f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 198, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Nasir Butt"], "genres": ["Sports"], "publishers": ["Nasir Butt"], "esrb_rating": "Teen"}