{"id": 245158, "slug": "skins-pro-black-ops-for-minecraft", "name": "Skins Pro Black Ops for Minecraft", "name_original": "Skins Pro Black Ops for Minecraft", "description": "Hundreds of handcrafted Minecraft skins for free. All skins are Pocket Edition and PC compatible.<br/><br/>Skins Pro Black Ops for Minecraft is all about changing your character's skin in the hit game Minecraft. This pack is full of hundreds of the best war and black ops skins around!  Modern warfare, black ops, special operations, world war 1, world war 2, pilots and pure warriors. We even threw in bonus war time zombies!<br/><br/>This App requires an Internet connection. When you open the App, it will grab skins from our server. Because of this, we can add new skins any time we want without an app update! You can even edit the skins with our #1 skins creation tool, Skins Pro Creator for Minecraft.<br/><br/>Just added: Exclusive black ops 'ghost' skins!<br/><br/>Features Include:<br/>- Update your skin without leaving the App<br/>- Hundreds of black op and special forces!<br/>- Skin stealer… grab another players skin by simply entering their character name<br/>- Custom iPad and iPhone design to maximize each device<br/>- Hundreds of special skins to apply to your character<br/>- Exclusive pack you can't find anywhere else<br/>- 3D preview of the skins!!<br/><br/>Download the best Minecraft black ops skinning app available today!<br/><br/>Note: This is not an editor. It is a collection of unique skins for the full pc version of Minecraft.<br/><br/>Have questions or feedback about this App? Email us at seejaykayapps@gmail.com. We would love to hear ideas on how to make this Skins Pro Black Ops for Minecraft even better.<br/><br/>Seejaykay apps and websites are family friendly.<br/><br/>-- Important --<br/>This app and Seejaykay LLC are not affiliated with Mojang AB or Notch Development. Mojang AB is the legal creator of Minecraft.", "metacritic": null, "released": "2013-05-07", "tba": false, "updated": "2019-10-22T14:13:14", "background_image": "https://media.rawg.io/media/screenshots/442/442f4550bd1c5647491ce4cd7edea8cb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 71, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Craig Kerns", "Seejaykay"], "genres": ["Adventure", "RPG"], "publishers": ["Craig Kerns", "Seejaykay"], "esrb_rating": null}