{"id": 245171, "slug": "commando-adventure-shooting-action", "name": "Commando Adventure Shooting Action", "name_original": "Commando Adventure Shooting Action", "description": "***Fight for life in a combat as frontline commando with realistic shooting guns***<br/><br/>Commando adventure shooting is free ios offline first person shooting fighting action game that is all about shooting and survival with your strategy. Stunning game graphics and smooth game play will take you to real life battle zone. Your gunship helicopter was taken down by missile fired by enemies.  If you've quick reflexes and excellent aiming and shooting skills then find your way out of enemy’s army place. You are equipped with advanced weapons assault rifles, machine guns and sniper gun. Use these guns to become an assassin shooter and war hero champion for your own country. Death and Danger is on every footstep. Attack sniper shooter enemies with care else one sniper bullet hit and you are gone. Thrilling mission based game with modern combat warzones.  <br/>How to play: <br/>- Move commando by virtual joystick, half left side of your apple device is dedicated for moving commando.<br/>- Control aim by touching, half right side of screen is dedicated for aiming of your apple device ipad iphone device.<br/>- Tap Fire button located at right bottom of your ipad iphone devices.<br/>- Press Zoom to take a close look at enemy.<br/>- Tap on gun to switch between guns.<br/>- Tap on map to view satellite view of place.<br/>Features: <br/>- top free downloaded shooting game.<br/>- game supports all apple devices.<br/>- Kill enemies to accomplish mission at the end you will be rewarded by gold coins.<br/>- Gold coins can be used to buy magazines and other items and upgrade guns from pause menu<br/>- Realistic 3d graphics with dynamic lighting and amazing killing effects.<br/>- Multiple advance shooting guns.<br/>- Thrilling missions that will amaze you.<br/>- Brutal Action warfare game.<br/>- game with User friendly GUI and controls.<br/>- real Military Environment looks like real movies related to war.<br/>- Support for hd iphone, ipad devices.<br/>- Good quality sound effects used in the game.<br/>- Efficient weapon controls &amp; movement.<br/>- Best downloading gun shoot war game in apple gaming world.<br/>- Real Border environment.", "metacritic": null, "released": "2015-10-29", "tba": false, "updated": "2019-07-05T03:18:39", "background_image": "https://media.rawg.io/media/screenshots/321/32160bc1ee80949101b83f795df049ef_oCdeLPd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 276, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Nasir Butt"], "genres": ["Action", "Adventure"], "publishers": ["Nasir Butt"], "esrb_rating": "Mature"}