{"id": 245118, "slug": "zaccaria-pinball-master-edition", "name": "Zaccaria Pinball Master Edition", "name_original": "Zaccaria Pinball Master Edition", "description": "ALL TABLES ARE PLAYABLE WITHOUT ANY LIMITATIONS BY FREE PLAY MODE!<br/><br/>DISCOUNT PRICE INCLUDES 5 LICENSED ZACCARIA PINBALL TABLES (BLACKBELT, FARFALLA, HOT WHEELS, PINBALL CHAMP '82, TIME MACHINE)!<br/><br/>Zaccaria was founded by three brothers (Marino, Franco, &amp; Natale) and was the 3rd largest manufacturer of pinball machines in the world (behind Bally &amp; Williams). They had created and produced more than 35 different pinball machines between 1974 and 1987.<br/><br/>Zaccaria Pinball is a commemoration of this great pinball manufacturer. We will bring you almost all the pinball tables of Zaccaria one after the other.<br/><br/>FEATURES<br/>- 5 pinball tables (Pinball Champ '82, Farfalla, Hot Wheels, Blackbelt, Time Machine)<br/>- Various fixed and customizable camera views <br/>- Highly accurate physics and ball movements <br/>- Original table rules, sound effects and vocals <br/>- Breathtaking light and shadow effects <br/>- Retina Display and iOS 6 support <br/>- Customisable music themes<br/><br/>PINBALL TABLES <br/>- Blackbelt<br/>- Farfalla<br/>- Hot Wheels<br/>- Pinball Champ '82<br/>- Time Machine<br/><br/>PURCHASABLE PINBALL TABLES<br/>- Robot<br/>- Soccer Kings<br/>- Devil Riders<br/>- Locomotion<br/>- Shooting the Rapids<br/>- Star God<br/>- Magic Castle<br/>- Earth Wind Fire<br/>- Clown<br/>- Future World<br/>- Fire Mountain<br/>- Winter Sports<br/>- Space Shuttle<br/>- Zankor<br/>- Pool Champion<br/>- Mexico '86<br/>- House of Diamonds<br/>- Mystic Star<br/>- Spooky<br/>- Star's Phoenix<br/>- Strike (SS)<br/>- Aerobatics (EM)<br/>- Circus (EM)<br/>- Combat (EM)<br/><br/>SPECIAL TABLES FOR GOLD/SILVER MEMBERS:<br/>- Moon Flight (EM)<br/>- Lucky Fruit (EM)<br/>- Universe (EM)<br/>- Supersonic (EM)<br/>- Cine Star (EM)<br/>- Wood's Queen (EM)<br/>- Nautilus (EM)<br/>- Red Show (EM)<br/><br/>IN-APPS<br/>BRONZE MEMBERSHIP - offers all the in-apps on a discount price <br/>SILVER MEMBERSHIP - offers all Zaccaria pinball tables which have been released so far and will be release in the future, there will be 35 pinball tables in all <br/>GOLD MEMBERSHIP - offers content of Bronze Membership and Silver Membership on a discount price (all in-apps and all pinball tables)<br/>BALL SIZE - includes option that can change size of the ball (small, normal, large) <br/>USED TABLE - includes dirty textures, as well as an option that makes playfield dirtier and dirtier by the ball rolling <br/>LIGHT/DARK ENVIRONMENT - includes a darker environment that brings more realistic look for pinball tables <br/>+ 2 BALLS - adds 2 balls, so you will have 5 balls to play <br/>BALL PACK - includes 4 balls with different behavior <br/>FLIPPER PACK - includes 4 colored flippers (a.k.a. original replacement flippers) <br/>PREMIUM CAMERA EDITOR - adds 3 more customizable camera views and unlocks additional options to cam editor <br/>PHYSICS TWEAKS - allows you to modify some major value of physics engine <br/>GRAPHICS TWEAKS - allows you to change color and light settings<br/><br/>CONTROLS <br/>LAUNCH A BALL/START A GAME - tap the screen <br/>LEFT AND RIGHT FLIPPERS - tap left lower and right lower side of the screen <br/>PUSH THE TABLE - shake your device or swipe to left, right, up and down <br/><br/>SUPPORT <br/>If you found any bug or issue please send us an e-mail to support@askhomework.hu or look for us on our Facebook page at https://www.facebook.com/askhomework!<br/><br/>Thank you!", "metacritic": null, "released": "2013-09-13", "tba": false, "updated": "2019-10-22T14:13:13", "background_image": "https://media.rawg.io/media/screenshots/a38/a3871c0e06acd85160e76bef31e319df.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 159, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["ASK Homework"], "genres": ["Simulation", "Arcade", "Casual"], "publishers": ["ASK HOMEWORK"], "esrb_rating": null}