{"id": 245168, "slug": "addictinggames", "name": "AddictingGames", "name_original": "AddictingGames", "description": "Check out the awesome new look of the Addicting Games App! We've put a bunch of Addicting Games in your pocket. One FREE download delivers tons of ridiculously fun games straight to your device. For the first time on mobile, get online hits like Man-Eating Castle, Zombie Burger, and 50+ other great games from the Addicting Games catalog.<br/><br/>Hundreds of levels, 300+ achievements to unlock, hours of fun – and more games coming at you all the time! One single download brings you an truly epic game experience.<br/><br/>What’s in it? Perfect Hoopz 2, Release the Mooks, Break Monsters Out, Addictive Balance, Escape the Car and more!<br/><br/>Plus, brand new mobile games you will not find anywhere else - like Potty Copter, the latest craptacular adventure from the people who brought you Potty Racers!<br/><br/>Did we mention it’s completely free?<br/><br/>Stop playing crap games on the bus; start playing bio-fueled poo-tastic games from Addicting Games NOW and join millions of peeps already playing AddictingGames on Facebook and addictinggames.com.<br/><br/>Addicting Games collects non-personal aggregated user data.  User data may be used, for example, to respond to user requests; enable users to take advantage of certain features and services; personalize content and advertising; and manage and improve services.  User data collection is in accordance with applicable law, such as COPPA.", "metacritic": null, "released": "2011-10-14", "tba": false, "updated": "2019-10-22T14:13:14", "background_image": "https://media.rawg.io/media/screenshots/374/3741f66138a49bd971b6af531bce2943.jpg", "website": "http://www.addictinggames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 124, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Defy Media"], "genres": ["Action", "Adventure"], "publishers": ["Defy Media"], "esrb_rating": "Teen"}