{"id": 245167, "slug": "million-skins-for-minecraft-pe", "name": "Million Skins for Minecraft PE", "name_original": "Million Skins for Minecraft PE", "description": "Attention: This app is now compatible with Pocket Edition and PC!  Million Skins for Minecraft takes all the effort out of making the perfect Minecraft skin.  Shuffle heads, arms, legs, and bodies to create the skin you want to use in Minecraft.  There are literally millions of combinations at your fingertips. <br/><br/>Save your new skin for playing in Minecraft or for editing in our #1 Skin Creator, Skins Pro Creator for Minecraft!<br/><br/>As with all of Seejaykay’s apps, this is a high quality, easy to use design that everyone will love. Try it out today!  <br/><br/>Features Include: \u2028<br/>- Augmented Reality Preview (for supported devices)<br/>- Minecraft Pocket Edition 0.11 Compatible<br/>- Millions of skin combinations <br/>- Universal app runs on iPad, iPhone and iPod Touch<br/>- Create from bodies, faces, hair, shirts and more.<br/>- Export your skin to your photos<br/>- Universal app runs on iPad, iPhone and iPod Touch<br/><br/>This app has no access to your Minecraft account. <br/><br/>Have questions or feedback about this App? Email us at apps@seejaykay.com. We would love to hear ideas on how to make Million Skins for Minecraft even better. <br/><br/>Seejaykay apps and websites are family friendly. <br/><br/>\u2028\u2028-- Important --\u2028 <br/>This app and Seejaykay LLC are not affiliated with Mojang AB or Notch Development. Mojang AB is the legal creator of Minecraft.", "metacritic": null, "released": "2014-06-29", "tba": false, "updated": "2019-10-22T14:13:14", "background_image": "https://media.rawg.io/media/screenshots/fea/fea08719953c72de54760fca5f5475fe_A3jSN87.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 17, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Craig Kerns", "Seejaykay"], "genres": ["RPG", "Simulation"], "publishers": ["Craig Kerns", "Seejaykay"], "esrb_rating": null}