{"id": 245181, "slug": "urban-commando-shooting-blackout-3d", "name": "Urban Commando Shooting Blackout 3D", "name_original": "Urban Commando Shooting Blackout 3D", "description": "****extreme combat action with commando FPS for your apple devices ****<br/><br/>Urban commando shooting game is a First person action shooting game that takes you to the world of real army battle. Be the frontline army commando and fight for <br/><br/>your country. You are equipped with advanced assault rifles, machine guns and sniper gun. Use these guns to shootout enemy’s frontier force. Challenging missions will <br/><br/>decide whether you are battlefield hero or not. It’s a challenge to your entire military commando shooting and fighting skills engaging military scenarios to pull you into <br/><br/>an immersive combat experience the moment you start the game. Check your shooting skills by killing enemies before they reach a safe point where they attack on <br/><br/>you. Hold your breath and silent the guns of enemies.<br/><br/>How to Play:<br/>-\tcontrol commando by touch of your iPad or iPhone.<br/>-\ttap on fire to shoot located at right bottom of your Apple device.  <br/>-\ttap on zoom to take a close look at enemy.<br/>-\tswitch between guns by tapping on switch button bottom left of your Apple device.<br/>-\tkill enemies to accomplish objectives.<br/>-\tdon’t forget to reload when reload sign appears on the screen.<br/>-\tswitch between crouch and stand position to strategically face enemies. <br/> <br/>Features:<br/>-\ttop ios free offline shooting game.<br/>-\tsupports all apple devices.<br/>-\trealistic 3D graphics with dynamic lighting and amazing killing effects.<br/>-\t7 advance shooting guns.<br/>-\tvarious types of missions like sniper, assault, one to one battle. <br/>-\tbrutal Action now on your smart iPads.<br/>-\tuser friendly GUI and controls.<br/>-\treal Military Environment looks like real movies related to war.<br/>-\tsupport for HD iPhone, iPad devices.<br/>-\tgood quality sound effects.<br/>-\tefficient weapon controls &amp; movement.<br/>-\tbest downloading gun shoot war game in Apple gaming world.", "metacritic": null, "released": "2015-10-25", "tba": false, "updated": "2019-07-05T03:22:57", "background_image": "https://media.rawg.io/media/screenshots/506/506709a6958703dff4b4654f73bad67e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 192, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Nasir Butt"], "genres": ["Action", "Adventure"], "publishers": ["Nasir Butt"], "esrb_rating": "Mature"}