{"id": 245103, "slug": "hill-car-drag-racing", "name": "Hill Car Drag Racing", "name_original": "Hill Car Drag Racing", "description": "HILL CAR DRAG RACING offers you a unique drag racing experience with hill climb competition featuring different racing cars, stunning graphics and addictive gameplay.<br/><br/>RACE FOR TROPHIES<br/>Drag race against 3 opponents and win. Only the 1st place is rewarded by trophies. You will need them to challenge bosses.<br/><br/>UPGRADE YOUR CARS<br/>Upgrade engine, suspension, wheel and other parts to give your racing car better performance. A better and faster racing car brings more victories and trophies.<br/><br/>BEAT THE BOSSES<br/>Challenge bosses by paying entry fee. Defeat them to earn their racing cars.<br/><br/>HINTS<br/>- Only 1st place is rewarded by trophies.<br/>- A well-timed gear down gains more speed on uphills.<br/>- Purchase upgrades as soon as you have enough currency.<br/>- You need trophies to unlock bosses.<br/>- Defeat bosses to earn their racing cars.<br/>- You a nitro per race, use it wisely.<br/>- Every boss unlocks 300 new levels.<br/>- Upgrade booster to earn more coins and stars.<br/>- Upgrade pressure to gain more grip.<br/>- Upgrade magnet to reach coins and stars placed at higher positions.<br/>- Prizes of mystery box depends on the levels you reached. the higher level the bigger prizes.<br/>- Mystery box helps you out if you have currency problem.<br/>- Try to use your nitro at different places if a level causes you a trouble.<br/>- 4th place gives you nothing. try to reach better position.<br/>- You have to be 1st to unlock next level.", "metacritic": null, "released": "2016-09-06", "tba": false, "updated": "2019-10-22T14:13:13", "background_image": "https://media.rawg.io/media/screenshots/615/6150ae9e28af265037235e39d4c30304_ma55H8J.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 194, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["ASK Homework"], "genres": ["Simulation", "Racing"], "publishers": ["ASK HOMEWORK"], "esrb_rating": null}