{"id": 245159, "slug": "skins-pro-for-minecraft-unofficial", "name": "Skins Pro for Minecraft (Unofficial)", "name_original": "Skins Pro for Minecraft (Unofficial)", "description": "Over 500 handcrafted Minecraft skins for one small price. All skins are Pocket Edition PC compatible.  <br/> <br/>Skins Pro for Minecraft is all about changing your character's skin in the hit game Minecraft.  One of the best features of Minecraft is the ability to show off your individualism while you build your next masterpiece.  Skins Pro for Minecraft helps you do this through three primary functions.  First, you get many original skins that are not available anywhere else.   Second, the App makes it very easy to change your character’s skin from one to another right from inside the App.  All you have to do is click ‘Apply to My Account’ and the App guides you the rest of the way.  And finally, if you like another character’s skin, this App lets you type in their character name, view their skin and apply it right to yours!<br/><br/>This App requires an Internet connection.  When you open the App, it will grab skins from our server.  Because of this, we can add new skins every week as we develop them!  Expect a nice stream of new skins in the coming months as your selection gets bigger and bigger!  With Skins Pro for Minecraft, your small investment will really pay off.  Let the skinning begin.<br/><br/>Features Include: <br/>- Minecraft Pocket Edition 0.11 Compatible<br/>- Update your skin without leaving the App <br/>- Hundreds of super heroes! <br/>- Grab another players skin by simply entering their character name<br/>- Custom iPad and iPhone design to maximize each device<br/>- Over 500 custom skins to apply to your character<br/>- Exclusive skins you can't find anywhere else<br/><br/>Download the best Minecraft skinning app available today! <br/><br/>Note: This is not an editor.  It is a collection of unique skins. <br/><br/>Have questions or feedback about this App?  Email us at seejaykayapps@gmail.com.  We would love to hear ideas on how to make this Skins Pro for Minecraft even better.<br/><br/>Note: If you have problems seeing the skins on the right side of the App, it is because of a weak internet connection.  Please contact us if you have questions regarding this.<br/><br/>Seejaykay apps and websites are family friendly.<br/><br/>-- Important --<br/>This app and Seejaykay LLC are not affiliated with Mojang AB or Notch Development. Mojang AB is the legal creator of Minecraft.", "metacritic": null, "released": "2011-07-07", "tba": false, "updated": "2019-10-22T14:13:14", "background_image": "https://media.rawg.io/media/screenshots/e13/e13ef823e06de450638902fda507d72f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 82, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Craig Kerns", "Seejaykay"], "genres": [], "publishers": ["Craig Kerns", "Seejaykay"], "esrb_rating": null}