{"id": 245108, "slug": "hill-climb-runner", "name": "Hill Climb Runner", "name_original": "Hill Climb Runner", "description": "Do you love hill climb racing? Do you like to compete with racing cars with four-wheel drive? Then Hill Climb Runner is your racing title because all of the above mentioned and other cool features are implemented for your better racing experience.<br/><br/>• CHOOSE one of 4 racing cars that fits to your driving style better.<br/>• RACE on stages to collect coins and stars.<br/>• UPGRADE your racing car with collected coins and stars to get more speed and performance.<br/>• UNLOCK new stages to collect more coins and stars.<br/>• RACE on special stages to award skillpoints and spend them to unlock more racing cars.<br/><br/>FEATURES:<br/>• 4 racing cars with different shapes and driving styles<br/>• 70 stages with more than 1000 levels where coins and stars are collectible<br/>• 10 special stages with 1000 levels where skillpoints are awarded<br/>• 6 environments with various decorative objects<br/>• 6 upgrades with different effect to your racing car<br/><br/>HOW TO PLAY<br/>At the beginning you are able to race with the first racing car. You have to collect skillpoints on Special Stages to be able to unlock the other 3 racing cars. Race on the stages and collect as many coins and stars as you can. Don't forget to upgrade your racing cars as soon as you have enough coins and stars or you have trouble to accomplish a level within the time limit. Yes, every levels of every stage have a time limitation to accomplish. Unlock new stages for coins to be able to collect more coins and stars. So choose a car and a level and let's start racing! Tap on Start button to move your racing car to the starting position. Then the race is going to start as soon as you tap on the gas pedal. <br/><br/>TIPS AND TRICKS<br/>• You have 3 turbos, don't forget to use them!<br/>• It's not always worth to push the gas pedal to the metal.<br/>• Don't forget to upgrade your racing car.", "metacritic": null, "released": "2015-11-11", "tba": false, "updated": "2019-10-22T14:13:13", "background_image": "https://media.rawg.io/media/screenshots/f91/f912e444d46e6e61316eaf0d6abc5833_Bzd5vDB.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 206, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["ASK Homework"], "genres": ["Simulation", "Racing"], "publishers": ["ASK HOMEWORK"], "esrb_rating": null}