{"id": 245191, "slug": "highway-speed-bike-riding", "name": "Highway Speed Bike Riding", "name_original": "Highway Speed Bike Riding", "description": "Are you interested in bike riding on highway? Extreme bike Rider is a motorbike racing game on a heavy traffic road. By which you can increase your craze of bike stunts and one wheeling. Avoid colliding with anything such as truck, car or any other vehicle or road barrier. Try to overtake the motor cars from nearer to these to get scores and boost up your bike energy fuel. You have to collect power boosters to boost up your speed. So try to play this interesting game. Check your expertise in this game for bike controlling. The best traffic racing game on the store! Speed junkies, slap on your helmet and experience some high-octane racing! Zoom down the open highways and try to pass closely without crashing. Be stupidly irresponsible by breaking all your bones.<br/><br/>How to Play<br/>- Move bile left right by tilt.<br/>- Tap on your mobile screen to apply brakes.<br/>- Speedometer is provided bottom left side of your phone.<br/>- Tap on nitrous to increase speed, button is provided right side of your device.<br/>- Gain extra points by near miss.<br/>Features<br/>- top free offline racing game.<br/>- Excellent bike physics and controls implemented.<br/>- Supports all devices.<br/>- realistic 3d graphics with dynamic lighting and amazing racing effects.<br/>- User friendly GUI and controls.<br/>- real adventuring Environments looks like racing movies.<br/>- Support for hd devices.", "metacritic": null, "released": "2017-07-21", "tba": false, "updated": "2019-07-05T03:24:24", "background_image": "https://media.rawg.io/media/screenshots/acb/acb3b4e08abed92dc8a4fc32c4174fda.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 96, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Nasir Butt"], "genres": ["Simulation", "Racing"], "publishers": ["Nasir Butt"], "esrb_rating": "Everyone 10+"}