{"id": 245290, "slug": "stuck-excavator-crane-rescue", "name": "Stuck Excavator: Crane Rescue", "name_original": "Stuck Excavator: Crane Rescue", "description": "This is a story of heavy excavator which got stuck into the mud &amp; you have to rescue it using gigantic crane. An awesome offering!<br/>Lover of crane games &amp; rescue games? Enjoy the thrilling crane simulator experience in one of the best heavy machine operator games. This crane operator game is a perfect blend of crane machine games and rescue games. Our game offer you a chance to become the best crane operator of heavy excavator games where you can rescue the heavy machinery like excavators &amp; trucks. So fasten your seat belt to amuse yourself with crane operator adventure in heavy machinery games but don’t forget to show your excel steer skills with excavator simulator fun.<br/><br/>Enjoy the rescue excavator simulator, the best of excavator truck games, is a complete joy for rescue excavator games lovers. Relive the uniqueness in the excavator truck games 3d with automobile and excavator machine to make you forget the common rescue games, truck games. You’ll test your truck driving and rescue operator skills at blockage paths and roads with an excavator simulator while driving the big truck, much different from the rescue games.<br/><br/><br/>Features:<br/>• The top 4x4 truck with excavator rescue operator. <br/>• Perform various crane &amp; excavator rescue operations <br/>• enjoy controls upgraded for extreme rescue excavator.<br/>• show real truck driver skills in each challenging levels<br/>• eye catching graphics and real tricky tracks<br/>• exciting precision crane simulator<br/>• Experience the great crane working and truck combination<br/>• superb excavator and truck simulator giving you the feeling of real rescue operator.<br/><br/>So enjoy the best rescue excavator simulator game and have an escape from conventional heavy excavator games. The crane rescue excavator will excite you with an awesome excavator machine unseen in other crane games. An excavator truck simulator with rescue games theme makes this rescue excavator a unique gag to try. So experience the excavator simulators and truck driving simulator with ultimate rescue operation! Heavy excavator games were never such for sure. Just download Heavy Excavator: Crane Rescue to get the title of best crane operator simulator in top Notch heavy machine games.", "metacritic": null, "released": "2016-12-03", "tba": false, "updated": "2019-10-22T14:09:17", "background_image": "https://media.rawg.io/media/screenshots/98c/98c9d3dd396ecf1c61b03fd7243e9c9e_InMQXBE.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 187, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Waqas Ahmad"], "genres": ["Adventure", "Simulation"], "publishers": ["Waqas Ahmad"], "esrb_rating": null}