{"id": 245271, "slug": "regained-castle", "name": "Regained Castle", "name_original": "Regained Castle", "description": "Play a FREE trial of this immersive, high-quality game! Then pay once &amp; play forever offline!<br/><br/>The game action takes place in the early 20th century. Jane is a young woman who lost her parents in a tragic accident when she was a child. She receives a letter from her guardian, Sir Charles Willmore, who lives in an ancient ancestral castle. Upon opening the envelope, she finds an empty sheet inside on which the message \"You're next!\" magically appears. Jane hurriedly gathers her belongings and heads to Sir Charles to ask for an explanation. However, she doesn't yet know that she's hurrying straight into the trap prepared for her.<br/><br/>UNRAVEL THE SECRETS OF AN ANCIENT CASTLE<br/>Follow the trails, uncover secrets and clues from hidden object scenes, and solve various mini-games and puzzles on your quest to break the curse of the Willmore clan!<br/><br/>GAME FEATURES<br/>– You will visit 54 unique screens on your way to solving the quest<br/>– Uncover the secrets of the castle by exploring over 42 locations<br/>– Discover amazing 15 Hidden Object scenes<br/>– Challenge yourself in 21 mini-games and 14 puzzles<br/>– Your achievements will be rewarded with prizes, bonuses and pleasant surprises<br/><br/>TRY IT FREE, THEN UNLOCK THE FULL ADVENTURE FROM WITHIN THE GAME!", "metacritic": null, "released": "2015-12-17", "tba": false, "updated": "2019-10-22T14:13:17", "background_image": "https://media.rawg.io/media/screenshots/cac/cac7e607b59203ec785b07b17c0f64e6.jpg", "website": "http://sungiftgames.com/games/forgotten-places-regained-castle/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 231, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Andriy Pertsov"], "genres": ["Adventure", "Puzzle"], "publishers": ["Andriy Pertsov"], "esrb_rating": null}