{"id": 245203, "slug": "city-bus-simulation-pick-drop-realistic-drive", "name": "City Bus Simulation: Pick & Drop Realistic Drive", "name_original": "City Bus Simulation: Pick & Drop Realistic Drive", "description": "City Bus Driver Simulation is the latest bus simulation in market which will offer you the chance to become a real City Bus Driver! Realistic maps, incredible vehicle with real bus physics, wonderful interiors will make you feel like driving a real bus! It's time to get the passengers on board and drive the bus to complete all the routes targeting the destinations of passengers!<br/>Gameplay:<br/>- Drive bus with steering on right <br/>- Accelerate, Brake &amp; reverse paddles on left screen<br/>- Pick the passengers on your way... <br/>- The Bus Stop will be in green when there is passenger waiting for the bus<br/>- The bus stop will be red when destination of passengers comes<br/>- The direction towards passenger's destination can be found on the map in orange<br/>- Complete the route within given time<br/>- When a route is successful, new route loads<br/><br/>Game Features:<br/>- Animated people entering/exiting the bus<br/>- Realistic environment<br/>- Its like a navigatin Map system <br/>- Steering Wheel, Accelrate, Brake &amp; reverse paddles<br/>- Detailed Interiors<br/>- Intelligent Traffic System<br/>- Great Sounds<br/>- Awesome Bus driving challenges<br/>- Smooth controls and fun gameplay", "metacritic": null, "released": "2016-12-01", "tba": false, "updated": "2019-07-05T03:26:55", "background_image": "https://media.rawg.io/media/screenshots/738/7385708f87d6619b41fa29ff01752657_l0M7Mem.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 110, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Nasir Butt"], "genres": ["Simulation", "Arcade", "Casual"], "publishers": ["Nasir Butt"], "esrb_rating": "Everyone 10+"}