{"id": 245268, "slug": "deadly-soccer", "name": "Deadly Soccer", "name_original": "Deadly Soccer", "description": "Dear players, we draw your attention to the unique opportunity to see an abundance of various evil spirits in a soccer game. <br/><br/>In the heat of the lost souls' tournament, the accumulation of a large amount of immortal substance created to something which installed itself into the soccer ball, so that  everything it touched started coming to life – from the lifeless bodies in the cemetery to the scarecrows in the gardens... All the revived ones demonstrated an unquenchable thirst for the game.<br/><br/>In order to win this sinister championship, you will need to take the side of one of the evil spirits and work your way to victory through numerous atmospheric game fields covered by darkness and fog.<br/><br/>You can also play against your friends by using the same device simultaneously and derive a ton of deadly pleasure from using the game bonuses against each other. You are guaranteed both ardor and confrontation!<br/><br/>There is also an extra mini-game called \"Penality\"! Try surviving and defending your goalpost with your blood against the zombies' invasion!<br/><br/>Have fun with the Deadly Soccer!<br/><br/>Game Features:<br/>- 10 game locations<br/>- Unique evil spirit teams<br/>- An option for two people to play on the same device<br/>- Numerous bonuses which make the gameplay more interesting<br/><br/>Follow us on Twitter: @sungiftgames<br/><br/>Thanks for playing and enjoy!", "metacritic": null, "released": "2013-06-20", "tba": false, "updated": "2019-10-22T14:13:17", "background_image": "https://media.rawg.io/media/screenshots/1d8/1d86aa0f697e656b12ba68ba0b6f9f0d_RmBiEnc.jpg", "website": "http://www.sungiftgames.com/games/deadly-soccer/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 306, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Andriy Pertsov"], "genres": ["Sports", "Arcade", "Casual"], "publishers": ["Andriy Pertsov"], "esrb_rating": null}