{"id": 245205, "slug": "kill-the-wolf-and-save-the-goat", "name": "Kill The Wolf And Save The Goat", "name_original": "Kill The Wolf And Save The Goat", "description": "Show your ultimate sniper skills to save poor animals from horror wolves. <br/><br/>Aim and shoot! Kill the wolf lets you hunt the most dangerous animals in the world. Your mission is to snipe the attacking wolf. Shoot the attacking animal before the innocent goats becomes prey. Spot the attacking animal press zoom to take a closer look at the victim animal then trigger fire. Aim proper then shoot because if you missed one chance then you have less chance to kill the attacking animal. Real jungle environment keeps you in touch with the beautiful nature. . Bring forth your arrow bow skills to fight with almost all wild animals. Master your sniper shooting skills. Become assassin animal killer. Show your skills with gun to feel the thrill and adventure of real hunting.<br/>How to Play:<br/>- Tap on fire to shoot located at right bottom of your apple mobile.  <br/>- Tap on zoom present just above fire button right bottom of your iphone ipad device to take a close look at wolf.<br/>- 6 thrilling and challenging missions.<br/>- choose the level to play, hunt all to unlock next<br/>- Navigate screen on swiping on left of your apple phone.<br/>- Kill wolves to accomplish objectives.<br/>Features:<br/>- top ios free offline jungle shooting and hunting game.<br/>- Excellent sniper physics and controls implemented.<br/>- Supports all Apple devices.<br/>- realistic 3d graphics with dynamic lighting and amazing killing effects.<br/>- brutal Action now on your smart ipads.<br/>- User friendly GUI and controls.<br/>- real adventuring forest Environment looks like adventure movies.<br/>- Support for hd iphone, ipad devices.<br/>- game with Good quality sound effects.<br/>- Efficient weapon controls &amp; movement.<br/>- Best downloading gun shoot game in apple gaming world", "metacritic": null, "released": "2016-01-23", "tba": false, "updated": "2019-07-05T03:27:23", "background_image": "https://media.rawg.io/media/screenshots/057/057bf2d80573aa1366ede4bcc2663859.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 117, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Nasir Butt"], "genres": ["Action", "Adventure"], "publishers": ["Nasir Butt"], "esrb_rating": "Teen"}