{"id": 245223, "slug": "floating-car-future-flying-car", "name": "Floating Car Future Flying Car", "name_original": "Floating Car Future Flying Car", "description": "Ever heard of a car which can fly, swim, float and drive at the same time? If you love flying car games then enjoy this new breed of water racing games &amp; flying car simulator games. This futuristic car is very modern and it can act as a floating car, a flying car and a driving car all at the same time. You just need to enable the corresponding controls and that’s it. Get the amazing experience of extreme jet flying car games in the future with flying muscle car simulator? <br/><br/>Start driving the car in modern city, dive into the sea and your car will start floating on the ocean surface just like a boat. Get thrill of boat racing on water and think of being in the next century. Then start flying the car just like an F16 fighter jet airplane. Yes this is a super car!<br/><br/>Get ready to enjoy an energizing futuristic flying car simulator with the blend of adventurous flying games in one of the extreme jet flying car games. This flying car 3d racing game is a game involving the sports car in the flying race and real action with the flying car simulator 2016. Being a best sports car driver, it’s time for you to perform the futuristic flying car driving with one of the best flying car 3d. So get set to show some extreme stunts to fly the car race in the newest combination of flying car games in the future.", "metacritic": null, "released": "2016-06-17", "tba": false, "updated": "2019-10-22T14:13:15", "background_image": "https://media.rawg.io/media/screenshots/489/489ce01abf8e44c470c65237c48300ea_r7h7Dsr.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 83, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Waqas Ahmad"], "genres": ["Adventure", "Simulation"], "publishers": ["Waqas Ahmad"], "esrb_rating": null}