{"id": 245272, "slug": "stealth-helicopter-gunship-war-modern-air-counter-", "name": "Stealth Helicopter Gunship War – Modern air counter strike navy fighter game", "name_original": "Stealth Helicopter Gunship War – Modern air counter strike navy fighter game", "description": "Welcome to Stealth Helicopter Gunship War<br/>Enjoy the gunship helicopter air attack in one of the best helicopter shooting games having a brand new concept of gunship battle of its own thrill. So become a daring gunship helicopter pilot in one of the modern helicopter attack games of gunship battle category. This HELICOPTER GUNSHIP AIR BATTLE has a specific helicopter combat mission that you need to finish for becoming an vital savior soldier in this helicopter fighting game.<br/><br/>Welcome to Stealth Helicopter Gunship War Features:<br/>-\tExcellent Gunship Counter Attack<br/>-\t10 Exclusive Challenging Missions For Gunship strike Shooter<br/>-\tUltimate Defense Shooting 3D Game<br/>-\tSmooth And Dynamic Controls With Real Physics.<br/>-\tEnjoy Controls Optimized For The Counter Attack Extreme Helicopter War<br/>-\tReal Hard Strike Skill To Show In Each Inspiring Level Of Chaos Copter Combat.<br/><br/>Counter strike commando counter attacks, in one of the best gunship helicopters war games, to attain glory in strategic combat helicopter attack games arena. Free battle Gunship Helicopter games were never like that! Don't miss the opportunity to become a part of the grand battle counter strike games, get the best of Gunship Helicopter War games fun with counter attack commando. COUNTER", "metacritic": null, "released": "2016-04-16", "tba": false, "updated": "2019-10-22T14:13:18", "background_image": "https://media.rawg.io/media/screenshots/e84/e84c5e3c6b239d955eeb618ed97f18e5_okVcOI8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 255, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Waqas Ahmad"], "genres": ["Action", "Adventure"], "publishers": ["Waqas Ahmad"], "esrb_rating": null}