{"id": 245212, "slug": "real-dinosaur-roller-coastervr-jurassic-tour", "name": "Real Dinosaur Roller Coaster:VR Jurassic Tour", "name_original": "Real Dinosaur Roller Coaster:VR Jurassic Tour", "description": "Real Dinosaur Roller Coaster VR is not about shooting or hunting dinosaurs - it's a free-to-view VR simulator. It combines the terrifying sights of real dinosaurs with the thrill of a Real Roller Coaster Simulator.<br/>Take a thrilling deadly ride through the mountains, and go through the various areas where dinosaurs roam about freely in this virtual world of Jurassics.<br/><br/> New Rollercoaster Carts added<br/><br/>Three more Roller Coaster carts are added, that will completely change your rollercoaster virtual experience.<br/><br/> Go at Blistering Speeds<br/><br/>Enjoy the experience of a Real Roller Coaster VR over the hilly park.<br/>Embrace yourself for an interesting and thrilling amusement rollercoaster simulation ride in a big dinosaur infested environment park.<br/>Choose your favorite cart from the in-game store and customize your experience. Each cart has its own design and view model to give you a different experience every time you want a ride!<br/><br/> Real Roller Coaster in a Real Dinosaur Land<br/><br/>The Real Dinosaur Rollercoaster VR tracks are full of extreme climbing sections, extremely fast drops, sky-scraping peaks and gut-wrenching curves. Experience just how nasty gravity can get! The amusement ride will take you into the land of the dinosaurs where they roam. Your ears will experience real dinosaur growls first hand!<br/><br/> Cool Features and Updates<br/><br/>+ Plenty of dinosaurs present on the Rollercoaster track itself.<br/>+ Rollercoaster is now extremely fast and exciting.<br/>+ Crisp and Cinema like HD visuals<br/>+ A brand new Rollercoaster track with loops and dives now added.<br/>+ The retuned physics engine of the game will create the most thrilling deadly rides of your life.<br/>+ Intuitive and immediately accessible game<br/>+ Enjoy its stunning features.<br/>+ Realistic mobile friendly graphics<br/>+ Play it anywhere, anytime<br/>+ Realistic physics<br/>+ Dynamic sound effects of real dinosaurs to keep the you entertained.<br/>+ Compatible with virtual reality glasses such as Google Cardboard Glasses, 4DUD Headset etc.<br/>+ Developed for high end phones which have Gyroscopes.<br/><br/>Experience the real life sensation of Real Dinosaur Rollercoaster in VR by wearing Google Cardboard Glasses https://www.google.com/get/cardboard/<br/>Or 4DUD Virtual Reality Headset http://www.4dud.com", "metacritic": null, "released": "2016-12-07", "tba": false, "updated": "2019-07-05T03:28:42", "background_image": "https://media.rawg.io/media/screenshots/2c7/2c72b4823d70c2456bff13e64978d527.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 314, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Nasir Butt"], "genres": ["Adventure", "Simulation"], "publishers": ["Nasir Butt"], "esrb_rating": "Everyone 10+"}