{"id": 245214, "slug": "traffic-skate-adventure", "name": "Traffic Skate Adventure", "name_original": "Traffic Skate Adventure", "description": "Extreme skateboard surfing to check skills on challenging roads with traffic<br/>Experience thrill of being hero of skater in unique various environments. From desert to hilly mountains track from village to solid roads of city all you can find in this game. Get ready for addictive game play experience that combines the excitement of fast and furious feats with dangerous wacky roads. Try to be one of the fastest skateboard surfer in the global leader boards. Surf in the endless highway roads by overtaking traffic. A wide variety of challenging as well as surviving missions with many power ups and power boosts that will help you to accomplish these missions. Stunning graphics, smooth control and detailed environments will take to real life skate board surfing experience. Become a professional skater by completing each level of game it is much more then entertainment.<br/><br/>How to Play<br/>-\tSwipe left right to move skater left or right to avoid traffic.<br/>-\tSwipe up to jump over hurdles.<br/>-\tSwipe down to pass under the check posts.<br/>-\tCollect different power ups.<br/>-\tCollect coins. <br/>implemented.<br/>-\tRealistic 3D graphics with smooth and realistic environment.<br/>-\tMultiple racing and surfing tracks.<br/>-\tAuto camera angles.<br/>-\tDifferent animations of skate board<br/>-\tVarious power ups and power boost.<br/>-\tGame with User friendly GUI and controls.<br/>-\tReal detailed endless traffic game environment. <br/>-\tSupport for hd devices.<br/>-\tBest quality sound effects.", "metacritic": null, "released": "2017-07-20", "tba": false, "updated": "2019-07-05T03:29:08", "background_image": "https://media.rawg.io/media/screenshots/fb4/fb4da200c024879a310dd7326c03f9b2_qpJKWZJ.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 125, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Nasir Butt"], "genres": ["Adventure", "Arcade", "Casual"], "publishers": ["Nasir Butt"], "esrb_rating": "Everyone 10+"}