{"id": 245246, "slug": "sand-excavator-simulator-2016-heavy-machinery-city", "name": "Sand Excavator Simulator 2016 - Heavy Machinery City Road Construction Truck Game", "name_original": "Sand Excavator Simulator 2016 - Heavy Machinery City Road Construction Truck Game", "description": "Welcome to the sand excavator simulator 2016 game!<br/><br/>Drive sand excavator through the high intense brutal region playing as a development worker. Test your skills at a genuine development site driving the sand excavator truck simulator 3D. Experience manual treatment of this sand excavator simulator.  You can drive as mind-boggling sand excavator truck simulator 3D for construction work.  In sand excavator simulator   you can deal with sand excavator physically using the coordinating and diverse controllers.<br/><br/>Sand excavator simulator 2016 game Features:<br/><br/>- Real Experience of Driving Heavy Excavator. <br/>- Explore the Construction Site environment. <br/>- Complete all Levels of Driving and Excavation. <br/>- Smooth Steering, Brakes, Lifting and Rotation Controls. <br/>- Amazing 3D Graphics and Environment. <br/>- More levels in upgrades are coming soon. <br/>- 2 overpowering vehicles to reinforce and capitalize on your drive <br/>- Multiple Gameplay Missions <br/>- Real-time Simulation &amp; Driving<br/>- HD Graphics, Animations and Sound Effects<br/><br/>Have you ever thought to drive a heavy excavator crane, excavator tractor and excavator truck at development site for construction work? Difficult to handle, yet enjoyable to play heavy excavator crane sim 3d. Are you a pro heavy transport vehicle driver? Another idea in the construction and heavy crane driving games where you excavate sand, transport construction material through heavy excavator tractor and excavator trucks and that's just the beginning. You get the opportunity to handle the heavy excavator manually using the steering and other controllers. Drive on the harsh territory and move towards the sand on the construction site in this real construction driving simulator game. Complete the excavation challenges when you get behind steering wheel of the heavy transport vehicles. Free download this game now to add to digging games in your mobile device for an awesome driving experience in a construction city among digging games.<br/><br/>Sand excavator truck simulation 3D is for all of you guys who loves excavator simulator animation of arm, lift and lot of more heavy truck. Sand Excavator Simulator is a complete loader simulator treat for the lovers of excavator games.  You will enjoy a lot heavy Excavator simulator game. Free Download Sand excavator simulator 2016 game from app store today and enjoy!", "metacritic": null, "released": "2016-03-13", "tba": false, "updated": "2019-10-22T14:13:16", "background_image": "https://media.rawg.io/media/screenshots/0d8/0d8c9e5783d838944d6508a6cedb239d_auhb5RI.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 144, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Waqas Ahmad"], "genres": ["RPG", "Simulation"], "publishers": ["Waqas Ahmad"], "esrb_rating": null}