{"id": 245287, "slug": "city-bus-driving-simulator-2016-real-passengers-pi", "name": "City Bus Driving Simulator 2016 - Real passengers pick & drop driver traffic parking Sim", "name_original": "City Bus Driving Simulator 2016 - Real passengers pick & drop driver traffic parking Sim", "description": "Welcome to the City Bus Driving Simulator 2016 game!<br/>The most realistic bus driving game 3D is here! It’s all about to the newest and most realistic bus parking game game ever found on the play store! Your task is to bring passengers safely from one point to another. In this city driver simulator game you are playing the role of real life bus driver and also you have to follow the traffic rules and drive with care. <br/>You have to begin your bus simulator game career today. City Bus Simulator offers you a platform to make records and break records of your friends and enjoy the simulation game. And you will feel like a real bus driver. And being a real bus driver you have to park buses in exactly the expected places. It is a free simulation game with 3D environment and high definition graphics. The tutorial of bus game explains you how to pick up people and how to drop passengers. It is the best bus driving game to pick up passengers from their places and drop passengers on their desired destinations. It is time to show that you are very good at bus driving game 3D. It is the platform for you to prove yourself in the best bus driving game 3D ever as the best city bus driver.<br/><br/>City Bus Driving Simulator 2016 Game Features:<br/>•\tAdventurous &amp; Thrilling Bus Driving<br/>•\tAmazing 3D City Environment.<br/>•\tA complete Hill Station Environment to Explore<br/>•\tHours of Driving Fun with Bus Driver Duty", "metacritic": null, "released": "2016-03-14", "tba": false, "updated": "2019-10-22T14:02:00", "background_image": "https://media.rawg.io/media/screenshots/440/4408b0b80f9e9f238a5840addc5acf28_vkNXlfo.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 124, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Waqas Ahmad"], "genres": ["RPG", "Simulation"], "publishers": ["Waqas Ahmad"], "esrb_rating": null}