{"id": 245323, "slug": "flying-tank-flight-simulator", "name": "Flying Tank Flight Simulator", "name_original": "Flying Tank Flight Simulator", "description": "Ever wished to fly tank and sense like a professional tank driving simulator driver in one of the most innovative tank flying games? This tank driving games free is definitely the game for you if you love army tank games and flying vehicle games with having best flying tank simulator in this great world tank free game. You can trial your pilot skills and tank simulator driving skills at a time in the best intermix of army tank games and tank flight airplane games. Experience this flying vehicle games known as tank flight airplane games and steer our new tank simulator that is one of the best tank driving simulator. So, it's time to overlook other tank driving games free and world tank free game and try our best tank driving simulator in this extreme FLYING TANK FLIGHT SIMULATOR. <br/><br/>Best flying car simulator 2016<br/>Taste of extreme car driving simulator new games 2016<br/>High Quality Graphics<br/>Touch of flying car games<br/>Better than flying train games<br/>Brilliant Environment<br/>Make Your Own Gameplay<br/><br/>Want to fly your tank like an airplane? This game is perfect for you! You can test your airplane pilot skills and tank driving ability at the same time. Fly your plane around the world discover new landscapes, Drive your tank, fight with the enemies and win the battle. This Flying Tank Simulator is made for all fans of army games, flying car games, Simulation games and Airplane Flight games.<br/><br/>Feel like in the future by operating an amazing flying car simulator and experience the best Flying Tank simulator ride of your life. Flying Tank Flight Simulator is the most modern flying tank games among all futuristic flying car games. It’s much more fun than a flying car simulator. For those who love military aircraft simulators &amp; army car games; it’s a blend of both. <br/><br/>You will definitely forget all other flying vehicle games like flying car racing games, extreme jet flying car games free, flying train games, flying hoverboard games, flying truck games, flying bus games and all. This FLYING TANK SIMULAOTR is going to enliven your inner soldier. Amazing tank driving games free of army tank games.", "metacritic": null, "released": "2016-06-24", "tba": false, "updated": "2019-10-22T14:02:01", "background_image": "https://media.rawg.io/media/screenshots/529/529b4097db250819224032b40e479c43.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 69, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Waqas Ahmad"], "genres": ["Adventure", "Simulation"], "publishers": ["Waqas Ahmad"], "esrb_rating": null}