{"id": 245316, "slug": "shooting-expert-perfect-shot", "name": "Shooting Expert: Perfect Shot", "name_original": "Shooting Expert: Perfect Shot", "description": "Shooting Expert: Perfect Shot!!<br/><br/>One of the most addictive shooting games on the App Store! You will love it!<br/>an elite Sniper from the World Defense Force, is trapped in enemy territory - his skills are put to the test as he attempts to survive against a whole armada of Cerulean soldiers, Hell bent on wiping all humans from existence. But when a beautiful woman is shot and left for dead by her own kind, he must chose between his own life and the life of one of the very beings he is out to kill.<br/>If you want to become a sniper man, It is the only shooter game you want to play! Your mission is to gun down all the terrorists, you must be careful because there are many sharp shooters. Racked down by a sniper glare and kill ! While he did not get to you or your comrades ! That would kill the sniper you just need to find him and shot with a rifle will follow after the touch of a finger!<br/><br/>Features:<br/>A huge array of weapons and equipment to use on the battlefield.<br/>An advanced weapon upgrade system that lets you maximize your firepower.<br/>Realistic weather effects add new challenges to your missions.<br/>Upgrade your skills in the Lab to increase your combat effectiveness.<br/><br/>Are you going to become the sniper master? Let's find out and get your gun!<br/><br/>This shooting game is 100% free! Addictive Game play!<br/>Extremely challenging!<br/><br/>Have Fun!!!", "metacritic": null, "released": "2016-09-03", "tba": false, "updated": "2019-10-22T14:13:18", "background_image": "https://media.rawg.io/media/screenshots/ca3/ca3d88a2cf0ce385703fe02ebbe4474d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 135, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Ace of Apps"], "genres": ["Action", "Adventure"], "publishers": ["Jachie Holdings"], "esrb_rating": "Mature"}