{"id": 245315, "slug": "flying-dinosaur-simulator-velociraptor-spinosaurus", "name": "Flying Dinosaur Simulator - Velociraptor & spinosaurus Simulation FREE game", "name_original": "Flying Dinosaur Simulator - Velociraptor & spinosaurus Simulation FREE game", "description": "Ever heard of flying dinosaur games? Dinosaur games where you are the dinosaur? Yes, Welcome to the best flying dinosaur simulator of 2016 in one of the best dinosaur flying games. In this game you can be a dinosaur, Fly your dream fire breathing dinosaur and discover the sky to fly. Discover exciting islands, mountains &amp; landscapes. Blaze fire, smash village houses enjoy being a fire dinosaur. Enjoy being in the magical world of dinosaurs in one of the dinosaur simulator games! Train your dinosaur: Collect magic rings, pass levels and open new levels in one of the best T Rex Simulator games of 2016.<br/><br/>It is time to fly the fire breathing legendary creature from the medieval fantasy times! Dinosaur Flight Simulator is your perfect chance to feel the terror and menace of being a Dinosaur warrior and fly high into the sky. Let all the myths and stories come alive with this exciting simulation game that will give you a one-of-a-kind monster flying experience and enjoy playing being a dinosaur games.<br/><br/>Features: Flying Dinosaur Simulator <br/>-\tFree to play Dinosaur adventure game.<br/>-\tReal Fire Breathing Action<br/>-\tBest dinosaur Slayer Simulator Game<br/>-\tEquipped With Massive 3D Effect <br/>-\tChoose From a various available Of dinosaurs including Ankylosaurus, Carnotaurus, Parasaurolophus, Stegosaurus, Velociraptor, Apatosaurus, Triceratops, Spinosaurus, Tyrannosaurus<br/>-\tEnhanced Graphics for Best Gaming Experience <br/>-\tRealistic Sounds to Add More Thrill <br/>-\tRealistic flying dinosaur fire breathing animation<br/>Enjoy flying your little monster over the mountains &amp; oceans and feel the thrill. Rule the sky and live life as a legendary Monster! Discover a huge world of floating islands, dangerous monsters. Master your Dinosaur riding skills. Be the fire monster in this ultimate flying Dinosaur simulator. Are you the Dinosaur Master? Do you want to train your Dinosaur warrior for the wars of Roman Empire in Jurassic world dinosaur games? Show the knights and Dinosaur Slayer the power of the war Dinosaurs in this action game. A perfect war games quest awaits you in the newest flying Dinosaur Simulator games free.<br/><br/>This Flying Dinosaur games Simulator is made for all lovers of dinosaur simulator games, Jurassic dinosaur games and Dinosaur adventure games. This is the perfect time to unleash the beast in you. The action packed dinosaur simulator provides a realistic 3D effect in the various missions available. Control your fire breathing dinosaur slayer through a realistic island, roam freely wherever you want in one of the best dinosaur free games.<br/>-\tAnkylosaurus, Carnotaurus, Parasaurolophus, Stegosaurus, Velociraptor, Apatosaurus, , Spinosaurus, Tyrannosaurus", "metacritic": null, "released": "2016-07-25", "tba": false, "updated": "2019-10-22T14:13:19", "background_image": "https://media.rawg.io/media/screenshots/b07/b070d72332543d9f83fa4dae96a8ba31.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 59, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Waqas Ahmad"], "genres": ["Adventure", "Simulation"], "publishers": ["Waqas Ahmad"], "esrb_rating": null}