{"id": 245479, "slug": "three-billy-goats-gruff", "name": "Three Billy Goats Gruff", "name_original": "Three Billy Goats Gruff", "description": "No challenge, however daunting, is insurmountable. That’s what fairy tales teach us again and again with David versus Goliath clarity.<br/>Sure, your opponent may be bigger and stronger, but that is no reason to give up hope. If you have brains and courage on your side, the battle is half won.<br/>Such is the case for the Three Billy Goats Gruff bedtime story. They long to graze in the lush fields on the other side of the ravine. But an angry, goat-eating ogre lives under the only bridge to get there. Will the troll stop them?<br/>At first, yes. The Billy Goats Gruff are afraid of the ogre. But the biggest goat comes up with a plan to outsmart the troll.<br/>Will it work? The plan tests the goat brothers’ courage, but they are rewarded in the end. <br/>You and your children may follow along with our brave little heroes as they use their wits and cunning to outsmart the ogre. Based on the classic Norwegian fairy tale, this interactive story allows readers and listeners to match wits with the goats, helping them to cross the bridge and eat grass to their hearts’ content! An excellent story to boost the confidence of children who are intimidated by bullies, or bigger, ‘scarier’ children. <br/>Why is PonyApps’ version of Three Billy Goats Gruff so appealing to young children? Throughout the fairy tale there are games and jigsaw puzzles to entertain and engage young readers. Guide the goats through the labyrinth by finding treats and tools to help them. Recognize patterns by selecting the object that is different. Help the goats identify the sound of the animals around them, or find the shape to fit the shadow. The games are numerous and not contained in a single section separate from the story. Users can color a photo of one of the goats, find the ogre hiding in a barrel, clean a room, build a bridge and the like while reading the story. Some parents may find this a bit much because games appear every several pages, but the developer lets users off the hook with that handy settings button that can disable the games if a simple story is wanted.<br/>An excellent story to read with children who are intimidated by bullies, or are intimidated by bigger, ‘scarier’ children. Three Billy Goats Gruff is a delightful re-telling of the classic fairy tale with the same title. This story has a wonderful message and could be a great way to teach children how to deal with some of these difficult social situations that may arise!  Throughout the story there are games and puzzles to entertain and engage young readers. <br/>This classic bedtime story does what few classic story apps are able to do, stay true to a classic story while adding features to make it worth buying. Three Billy Goats Gruff is beautifully illustrated,  packed full of games and gives users lots of custom options including turning off the games during reading time if your little one gets a little too distracted. Goats Gruff is truly a treasure among eBooks or audiobooks. Not only is the story engaging, but it is beautifully illustrated and professionally narrated to add to your enjoyment of the story. There are also fun activities interspersed in the story to keep kids interested and excited to read on.  Make reading fun, and allow your children to test the limits of their courage through the magic of this classic tale.", "metacritic": null, "released": "2015-06-10", "tba": false, "updated": "2019-10-22T14:13:23", "background_image": "https://media.rawg.io/media/screenshots/3a9/3a9d3010f4296d73ba2616277191f0b9_rgzCBDx.jpg", "website": "http://www.saturnanimation.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 174, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Saturn Animation Studios"], "genres": ["Family", "Puzzle"], "publishers": ["Saturn Animation Studios"], "esrb_rating": "Everyone 10+"}