{"id": 245490, "slug": "humpty-dumpty-the-library-of-classic-bedtime-stori", "name": "Humpty Dumpty -The Library of Classic Bedtime Stories and Nursery Rhymes for Kids", "name_original": "Humpty Dumpty -The Library of Classic Bedtime Stories and Nursery Rhymes for Kids", "description": "We have all heard the popular nursery rhyme about Humpty Dumpty, but what happens after Humpty falls off the wall? In this epic adventure, the reader of this amazing classic bedtime story is the hero! According to lyrics from Lewis Carrol's 'Alice in the Wonderland', Humpty had a great fall and lost his memory and needs help to remember who he is and where he came from! <br/>While listening to the audiobook children will be empowered to solve the jigsaw puzzles of putting Humpty back together again, fostering imagination and innovation. Kids will then meet Farmer Joe, who wants to assist Humpty in jogging his memory and suggests that this might happen if Humpty first discovers what type of person he is, like if he is brave or caring.<br/>Farmer Joe wonders if Humpty has ever had an animal or pet he has cared for. Readers help Humpty care for and milk Farmer Joe’s cows to see if this is the key to remembering his past.<br/>Humpty slowly begins to remember things about who he is and where he came from. Farmer Joe continues to befriend Humpty and they work together with the reader to clean up Farmer Joe’s barn by sorting stuff into trash, recyclables and compost.<br/>Will this help Humpty Dumpty regain his full memory and be able to find his way home? Or is this only the start of an epic adventure?! Readers will be filled with curiosity to find out what happens next in this fairy tale.<br/>Each page of Humpty’s adventure entertains fairy tale readers with delightful illustrations and interactive animations, while teaching important life lessons about compassion, kindness and what it means to be caring towards living things and the earth.<br/>Not only can children read, watch and listen to this epic quest, but they can also participate in it, helping Humpty Dumpty overcome obstacles along the way. Children will be engaged by meaningful and educational games that weave their way seamlessly throughout the book.<br/>This reimagining of this classic nursery rhyme was created by IB International Teachers and is excellent for the classroom or for the home. With powerful themes such as mindfulness and responsibility, this is the perfect choice for parents or teachers to communicate with kids about important issues, while having a load of fun!", "metacritic": null, "released": "2015-05-24", "tba": false, "updated": "2019-10-22T14:13:24", "background_image": "https://media.rawg.io/media/screenshots/779/7790c66e3f7b7116523f89d0c1f2be6b.jpg", "website": "http://www.saturnanimation.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 106, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Saturn Animation Studios"], "genres": ["Family", "Puzzle"], "publishers": ["Saturn Animation Studios"], "esrb_rating": "Everyone 10+"}