{"id": 245478, "slug": "sleeping-beauty-fairy-tale", "name": "Sleeping Beauty Fairy Tale", "name_original": "Sleeping Beauty Fairy Tale", "description": "Love conquers all. The pure of heart will be rewarded. These are the lessons that fairy tales teach us over and over again. But they also teach us to be wary of those whose intentions are less than pure. Prompted by greed, jealousy, or some other perceived offense, such people can even be dangerous.<br/>Such is the case with Sleeping Beauty, the princess who falls under the spell of an evil fairy Maleficent and slips into a 100-year slumber.  With PonyApps’ interactive story, parents can transport their children into this magical world and instill in them the values they need in their own lives. Try as they might, the king and queen cannot protect their daughter from the curse – just as parents today cannot protect their children from every perceived danger and villain. But the situation is far from hopeless. As the children listen to the story, play games and put together puzzles, the princess sleeps and sleeps. But time will pass, her prince will come, and all will be right with the world. An evil fairy Maleficent? This is only a temporary set-back.<br/>The beauty of PonyApps’ Sleeping Beauty lies not only in the messages it conveys to young listeners – that there is hope even in the most difficult situations, and that time heals all wounds – but in the interactive nature of every page.  From the very start children not only read and listen, but follow along with the heroes; they engage in games designed to intrigue young readers and build their skills and fantasy. They can help set the holiday table – everything has to be perfect for the fairies invited to the feast. They can choose birthday presents for the young princess, collecting them in a bag of lace. They can feed the animals whom the kind-hearted princess befriends and cares for.<br/>After 100 years has passed it is time for the princess to wake up. How will her brave prince make it through the thorny bushes to reach her? How will he make it up the tower and get in to the chamber where she sleeps? Parent and child are right there to help: finding the key, unlocking the tower, and waking up the whole castle. And that is not all. A great wedding feast will follow; watch the chef dance with delight as your children help prepare a recipe in the kitchen. How tasty everything is turning out to be! This will be a wedding to remember – and the final wedding gift your child will give will be a painted portrait of bride and groom.<br/>This ancient and wise fairy tale about a sleeping princess enthralls readers into a wonderful world of love and virtue. Follow along with the book, and learn many new things to satisfy your curiosity. Learning is more fun with games and animations. Readers will help set the table for a feast, find the right gifts for the baby girl, pick the right lullaby to lull the animals to sleep, and even find the ingredients to cook a delicious meal. Finally, the young reader will become an artist. We have provided a portrait of a loving couple, but something is missing  – the  color! Well, here is a palette and brushes – now you can choose the right color and bring the painting to life.<br/>Listen, read, and play along with beautiful animation.", "metacritic": null, "released": "2015-03-09", "tba": false, "updated": "2019-10-22T14:13:23", "background_image": "https://media.rawg.io/media/screenshots/095/095720e96cb948ccb888c426c6fabac1_Caflbcn.jpg", "website": "http://ponyapps.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 160, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Saturn Animation Studios"], "genres": ["Family", "Puzzle"], "publishers": ["Saturn Animation Studios"], "esrb_rating": "Everyone 10+"}