{"id": 245428, "slug": "jumblee", "name": "Jumblee", "name_original": "Jumblee", "description": "Jumblee is a Mash-Up of two different word puzzles.  Each game consists of four to seven rounds depending on the difficulty level.  Each round requires one of the two puzzle types to be solved correctly before the next round can be played.  Once all the rounds are completed, the game is over.<br/><br/>Word Find: Find the indicated number of unique words given a random grouping of letters.  Each word must contain a minimum number of letters.<br/><br/>Unscramble: Unscramble the given letters into a single word.  At least one and maybe more words are possible.<br/><br/>Scoring is based on the time it takes to solve each puzzle so the LOWER the score the better.  For the Word Find game, you get a 100 point bonus subtracted from your score for each extra letter used.  Each letter also subtracts bonus points based on how often it appears in the word database.   A 20 point penalty is added for each letter reused from a previous word. <br/><br/>Jumblee is suitable for anyone who loves word puzzles. Everyone can enjoy finding and making words with three difficulty levels.  <br/><br/>Learn new words by looking up the definition after each puzzle.<br/><br/>Features Include:<br/>- Contains over 80,000 of the most common words in English.<br/><br/>- Fun underwater theme with animated fish, bubbles, seaweed, and coral reef.<br/><br/>- Two puzzle types per game including Word Find and Unscramble.<br/><br/>- Four difficulty levels, Hard, Medium, Easy, Beginner.<br/><br/>- Practice mode for stress free learning.<br/><br/>- Integrated help screens.<br/><br/>- Share scores with friends on Apple Game Center and social media.<br/><br/>- Score tracking on device.<br/><br/>- Word definition lookup after each puzzle.<br/><br/>- Get hints (sometimes) by tapping on the sea creatures.", "metacritic": null, "released": "2010-09-29", "tba": false, "updated": "2019-10-22T14:13:21", "background_image": "https://media.rawg.io/media/screenshots/6c8/6c8c97a8fb1062c1739a656ee8278253.jpg", "website": "http://creativelogicentertainment.com/jumblee.html", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 177, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Creative Logic Entertainment"], "genres": ["Puzzle"], "publishers": ["Creative Logic Entertainment"], "esrb_rating": "Everyone 10+"}