{"id": 245477, "slug": "the-snow-queen-by-hans-christian-andersen", "name": "The Snow Queen by Hans Christian Andersen.", "name_original": "The Snow Queen by Hans Christian Andersen.", "description": "Let us introduce the new birth of the classic fairy tale by Hans Christian Andersen as an audio book with amazing illustrations, games and beautiful animation.  Hot off the tail of Disney’s hit movie Frozen, comes this amazing adaptation of Hans Christian Andersen’s classic tale The Snow Queen. This e-book is filled with breathtaking illustration and challenging jigsaw puzzles that children will love. While Frozen is said to be inspired by The Snow Queen, there are several notable differences between the Disney version and the classic version. However, if your children are Frozen fanatics, they will love hearing this version of the story as well.  We remember the Snow Queen fairy tale from childhood. An evil troll invents a magic mirror that distorts everything beautiful and good. When the mirror breaks, a shard of its glass lands in the eye of young Kai, and his young heart becomes frozen.<br/>To save the boy from the magic spell, your child will have to overcome many hurdles together with our heroine Gerda, showing courage, wit and compassion along the way. Reading or listening this audiobook, your child becomes a participant in many entertaining activities.  He embarks upon a long rescue journey to struggle and win together with Elsa, Annabelle and other story’s heroes.<br/>Your child will get to know the little robber girl, who, deep down, is really kind-hearted.  He will meet a princess Annabelle who helps Gerda on her quest, setting her upon a reindeer that carries her across sea and mountain. With their help, they will collect all the pieces of ill-fated mirror to eliminate the troll curse forever. People, animals, birds, and even clouds will become real from the moment your child touches them. And, at the end of the Snow Queen fairy tale, your child will gather together the shattered fragments of the mean-spirited mirror as a jigsaw puzzle to triumph over evil.<br/>The games woven throughout this classic bedtime story develop your child’s attention and motor skills, and allow them to remain active and interested. Interactive activities include playing with snowflakes, musical glass splinters and flowers, rub and reveal images, puzzles and more. There is something to touch and play with on every page. Humans, animals, birds, clouds and even flowers come to life, instantly responding to your child’s touch. Watch the room burst into a blizzard, and let the harsh weather clear with the swipe of your finger. Once again the room will be a cozy scene, with logs crackling in the fireplace, the cat purring, and the grandmother knitting in this cold winter day.<br/>Beautiful illustrations, amazing animation and easy navigation make reading pleasant for you and your child … even exciting. And if you are tired, just turn on the auto play and the app will read the story to your child, page by page. What’s more – the price of the app is many times cheaper than your typical illustrated book. So read, play and enjoy! This edition of the Snow Queen will be a perfect solution for a bedtime story or for a child to enjoy on their own.<br/> It is a great tool and opportunity to introduce your children to classic literature.", "metacritic": null, "released": "2014-03-27", "tba": false, "updated": "2019-10-22T14:13:23", "background_image": "https://media.rawg.io/media/screenshots/344/344582790c997c675b963e4b285cd3e9.jpg", "website": "http://www.saturnanimation.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 203, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Saturn Animation Studios"], "genres": ["Family", "Puzzle"], "publishers": ["Saturn Animation Studios"], "esrb_rating": "Everyone 10+"}