{"id": 245487, "slug": "three-little-pigs-and-big-bad-wolf-full", "name": "Three Little Pigs and Big Bad Wolf Full", "name_original": "Three Little Pigs and Big Bad Wolf Full", "description": "Who does not know the classic fairy tale of the Three Little Pigs and the Big Bad Wolf? You may have watched cartoons or read books about them, but HAVE YOU EVER PLAYED?  Now you can do it with the PonyApps version of this famous story from the Library of Classic Bedtime Stories for Kids. While you are reading this interactive audio book to your son or daughter, they will become absorbed in its action and live through all the adventures of Three Little Pigs first hand. All heroes of this classic bedtime story, and even inanimate objects, such as an apple tree or a house, will come to life with the touch of your child's finger. They will assemble houses as jigsaw puzzles and play coloring games while listening to the narrative of the fairy tale.<br/>When little piggies Niff-Niff and Nuff-Nuff would rather play games in the yard than build a house, the Big Bad Wolf thinks he will have a chance to treat himself to fresh piggy. But there is no way he will succeed! Your child knows that a safe shelter will save Three Little Pigs from any enemy, and even the fierce cold of winter. This is why your child will help Naff-Naff to build a sturdy house step by step, to protect them from the elements and the hunger of the Big Bad Wolf. What are you going to do now, Wolf? Know your place!  <br/>Three Little Pigs app comes fully illustrated and contains colorful details that are sure to entertain preschoolers. Look around and you will find fun, animated characters and interactive elements hidden on every page.  They bring the story to life right before your eyes. Your child can see the pigs playing in the summer and  then paying the price when the wolf comes to call. <br/>As Julie Peterson from funeducationalapps put it  - she enjoyed this re-telling of one of her favorite childhood fairy tales, and she thinks you will, too.  Three Little Pigs fairy tale contains single in-app purchase to unlock the full story.", "metacritic": null, "released": "2014-08-18", "tba": false, "updated": "2019-10-22T14:13:23", "background_image": "https://media.rawg.io/media/screenshots/6ad/6ad2a67081809673969d10c9c4d7f005.jpg", "website": "http://www.saturnanimation.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 142, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Saturn Animation Studios"], "genres": ["Family", "Puzzle"], "publishers": ["Saturn Animation Studios"], "esrb_rating": "Everyone 10+"}