{"id": 24556, "slug": "shorts", "name": "Shorts", "name_original": "Shorts", "description": "<p>\n      Bring the outrageous and enchanting mayhem of Shorts, the movie, to your \n      Nintendo DS. After a magical rainbow rock that grants wishes brings \n      chaos to the suburbs, players must fix wishes-gone-wrong in this \n      entertaining platformer with classic puzzle elements. Play as 4 of your \n      favorite characters from the movie. Free your house from booger monsters \n      as Nose Noseworthy. Escape the canyon of doom and the castle that Loogie \n      Short wished into existence. Choose between Toe Thompson and Helvetica \n      Black to destroy the power-mad Mr. Black in the Black Box factory. It’s \n      up to you to return the community of Black Falls to normal.\n    </p><p>\n      Features\n    </p><p>\n      • Run through 26 replayable levels in 3 distinct episodes from the movie \n      that take place in a laboratory-like house in the town of Black Falls, a \n      factory, and a castle with a moat<br/>• Play as Nose Noseworthy, Loogie \n      Short, Toe Thompson and Helvetica Black, each with their own special \n      jump and unique ability<br/>• Use the stylus to draw temporary platforms \n      to jump on and get around obstacles or create a shield to avoid \n      dangerous threats<br/>• Activate special jumps and unique abilities like \n      the alien and wasp hover-jumps, telekinesis super-attack, invincibility, \n      and growth and shrink ray guns for sticky situations<br/>• Collect energy \n      balls to power special abilities. Find hidden heart pieces to increase \n      your health and pick up keys to unlock your way forward<br/>• Get help \n      from alien friends, giant wasps and a pterodactyl dinosaur to reach new \n      areas<br/>• Face a multitude of enemies like booger monsters, bomb \n      shooting crocodiles, poison spitting snakes, bats, and sparking robots\n    </p>", "metacritic": null, "released": "2009-08-18", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/546/546e40a1a5f8262a6e5f2d2536b7928a.jpg", "website": "http://www.majescoentertainment.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 238, "game_series_count": 0, "reviews_count": 0, "platforms": ["Nintendo DS"], "developers": ["A2M"], "genres": [], "publishers": ["Majesco Entertainment"], "esrb_rating": null}