{"id": 245573, "slug": "drift-classics-2-pro", "name": "Drift Classics 2 Pro", "name_original": "Drift Classics 2 Pro", "description": "Earn 4 times as much money as in the free version, no in-app purchases, no ADS!<br/><br/>You can easily earn enough money to get all the cars.<br/><br/>Now you can either Drift with a manual gearbox or an automatic gearbox. You can also select from 3 control types. The regular button, tilt control, and you get a steering wheel control.<br/><br/>You can select from 11 classic muscle cars, from both German and American manufacturers.<br/>-BMW 2002<br/>-Aston Martin DB5<br/>-Ford Mustang 1969<br/>-Buick<br/>Chevrolet Camaro Z28<br/>-Chevrolet Corvette 1960<br/>-Audi Quattro<br/>-Chevrolet Camaro IROC<br/>-Chevrolet Camaro<br/>-BMW M1 Procar<br/>-Chevrolet Chevelle SS<br/><br/>CUSTOMIZE<br/><br/>Paint your car to your liking, select its color, reflection, and metallic color. You can also select from a huge collection of rims and they can be painted to your liking too.<br/><br/>MODIFY<br/><br/>You can get 3 stages of weight reduction with the final stage you also get a roll cage.<br/><br/>TUNE<br/><br/>Engine tuning is available in 3 stages too. In the first stage, some minor modifications come into play, stage 2 is a bit more aggressive, you also get some exhaust flame and pops, and with stage 3 you get forced induction. Either supercharger or turbocharger. The appropriate one for your ride. You get some turbo spool sound and blow off sound in German cars and you that classic supercharger whine from the classics muscle cars.<br/><br/>MUSIC<br/><br/>6 Soundtracks from the 50s, and if you play from First Person then you can listen to them in radio quality. If played in Third Person then regular quality.<br/><br/>TRACKS<br/><br/>You can drift on 5 different tracks, and the last track is a bonus track in the desert, where your ride gets all-wheel drive and you can have some fun in the dust.<br/><br/>WEATHER<br/><br/>Random weather conditions occur on every track, and you can also drift at night on every track.<br/><br/>DASHBOARD VIEW<br/><br/>You can drive every single car from the first person view and witness the highly detailed cluster, which illuminates if you drift at night.<br/><br/>DYNAMIC SYSTEMS<br/><br/>The dynamic tire smoke is still being used like in previous games with the company of dynamic brake disc glow.", "metacritic": null, "released": "2018-03-07", "tba": false, "updated": "2019-10-22T14:13:26", "background_image": "https://media.rawg.io/media/screenshots/3e9/3e9691121ac28e84e3dc02046c235438.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 230, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Adam Keninger"], "genres": ["Simulation", "Racing"], "publishers": ["Adam Keninger"], "esrb_rating": null}