{"id": 245661, "slug": "abyss-of-magic-puzzle-rpg", "name": "Abyss of Magic - Puzzle RPG", "name_original": "Abyss of Magic - Puzzle RPG", "description": "Abyss of Magic!<br/>Do you want to embark in the adventure of a lifetime and enjoy astounding quests on your phone? Then your dreams come true with Abyss of Magic right now!<br/>Join the powerful warrior, agile rogue, holy paladin and impressive mage as they battle their way through numerous dungeons in order to restore peace to the land. Match three or more items in order to provide them with the necessary power to defeat evil.<br/>Each level in Abyss of Magic consists out of multiple baddies and a boss that are seamlessly combined in order to offer a one of a kind experience. No two levels are the same so you have to strategize and do whatever it takes in order to power up your heroes and defeat the foes as fast as possible.<br/>Abyss of Magic has everything you want from a mobile RPG and match 3 game: fun quests, boss battles, astounding graphics and tons of replayability. We guarantee that once you download the game you will play it repeatedly for a very long time. Don’t hesitate and get your own copy of Abyss of Magic right now, save our kingdom and don’t let it fall in the wrong hands!<br/><br/>Features:<br/>• Thousands of items to find and upgrade<br/>• Boss battles<br/>• Multiple heroes to control<br/>• Outstanding match 3 mechanics<br/>• Action packed quests", "metacritic": null, "released": "2015-06-20", "tba": false, "updated": "2019-10-22T14:13:28", "background_image": "https://media.rawg.io/media/screenshots/d5e/d5eb54715d72eab620f73692e799f2ff.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 105, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Sergej Voronov"], "genres": ["Adventure", "RPG"], "publishers": ["Sergej Voronov"], "esrb_rating": "Everyone 10+"}