{"id": 245730, "slug": "granny-vs-zombies-hd", "name": "Granny vs Zombies HD", "name_original": "Granny vs Zombies HD", "description": "The Zombies are in town, and its up to you to send them back to where they came from! You start playing as a lovable granny, but don't be fooled by appearances! This granny is really kick-ass! Collect different weapons, items, cash, and blast your way through the hordes of Zombies to clean-up the town. Granny vs Zombies HD is a fast paced action shooter for the iPad.<br/><br/>------------------------------------------------------------------<br/>Reviews:<br/><br/>148Apps.com<br/>\"The sharp visuals and cartoony art-direction bring to life a game that features some decent gameplay mechanics and interesting ideas\"<br/><br/>AppAdvice.com<br/>\"The game offers tons of replay value and a great amount of challenge for any experienced gamer or novice\"<br/><br/>the-ipad-site.com<br/>\"Granny vs Zombies is definitely one I would advise you check out. It’s fun, addictive and amusing all at the same time….great job.\"<br/>------------------------------------------------------------------<br/><br/>Features:<br/><br/>* Game Center Leaderboards and Achievements<br/>Leaderboards for each difficulty level, and 55 Achievements for you to earn!<br/><br/>* 8 Story Levels:<br/>In Story mode, you will battle across a multitude of scenes in your quest to stop the Zombie hordes. <br/>Unlock levels by completing the previous ones.<br/><br/>* Survival Mode:<br/>In Survival mode you will be able to test your survivor skills by blasting you way through ever <br/>increasing waves of Zombies in a given scene.<br/><br/>* 3 Difficulty Modes:<br/>Select from Easy, Normal or Hard difficulty depending on your ability.<br/><br/>* 2 different players to choose from:<br/>As you progress through the story mode game, you will unlock a second player!<br/><br/>* Different Zombies and Bosses:<br/>As you progress through the game you will meet 12 different Zombies and 2 bad-ass <br/>Bosses: Fat Zombie, Girl Zombie, Police Zombie, Farmer Zombie, Cow Zombie, Pig Zombie, Sheep Zombie, Undertaker Zombie, etc...<br/><br/>* 7 different weapons:<br/>7 different weapon with different properties. Use your bat for close range, throw Grenades and pipe bombs, lay down suppressing fire with your machine gun, or blast your way through huge hordes of zombies with your Rocket Launcher.<br/><br/>* Different Special Powers for each Player:<br/>Each player has som special powers to help you battle the Zombie Hordes! (lightning bolt, tesla shield, stealth, super speed...)<br/><br/>* Shop:<br/>Use the collected cash dropped by killed Zombies to purchase weapons and items in the shop.<br/><br/>* Varied Gameplay:<br/>Fast paced, action gameplay, with 2 different types of goals: 1) move freely around the level, destroying all the zombies 2) Defend the barricade and don't let any Zombie pass! Use obstacles to out manoeuvre the Zombies, manage your ammo supply carefully to avoid running out of ammo!<br/><br/>* Interactive Environment:<br/>Use the touch interface to interact with the environment. Touching doors will allow you to hide inside rooms, houses, barns, crypts. Open Mailboxes to pick up items...<br/><br/>* Cartoon-style 2D Graphics:<br/>Sharp and good-looking 2D cartoon graphics and characters.<br/><br/>* Music and Sound Effects:<br/>Somber and Mysterious music to help create the proper mood.<br/><br/>* Stats:<br/>See your score and hit accuracy in the Stats section", "metacritic": null, "released": "2011-03-31", "tba": false, "updated": "2019-07-30T16:40:57", "background_image": "https://media.rawg.io/media/screenshots/d2b/d2b440ff0cee33ee0c3d8f4cf6f628a3.jpg", "website": "http://www.4figapps.com/us/grannyvszombies/index", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 173, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Juan Casanueva"], "genres": ["Action", "Arcade", "Casual"], "publishers": ["Juan Casanueva"], "esrb_rating": null}