{"id": 245734, "slug": "granny-vs-zombies-2-the-return", "name": "Granny vs Zombies 2-the return", "name_original": "Granny vs Zombies 2-the return", "description": "The Zombies are back in town, and its up to you to send them back to where they came from! You start playing as a lovable granny, but don't be fooled by appearances! This granny is really kick-ass! Collect different weapons, items, cash, and blast your way through the hordes of Zombies. Granny vs Zombies 2 is a fast paced action shooter for the iPad.<br/><br/>Features:<br/><br/>* Game Center Leaderboards <br/>Leaderboards for each difficulty level.<br/><br/>* Achievement Missions:<br/>Complete the missions to earn in-game cash to buy and upgrade your weapons.<br/><br/>* 8 Levels:<br/>You will battle across a multitude of scenes in your quest to stop the Zombie hordes. <br/>Unlock levels by completing the previous ones.<br/><br/>* 3 Difficulty Modes:<br/>Select from Easy, Normal or Hard difficulty depending on your ability.<br/><br/>* 2 different players to choose from:<br/>As you progress through the story mode game, you will unlock a second player!<br/><br/>* Different Zombies:<br/>As you progress through the game you will meet different Zombies.<br/><br/>* Different weapons:<br/>12 different weapon with different properties. Use the bat or the chainsaw for close range, throw Grenades and pipe bombs, lay down suppressing fire with your machine gun, or blast your way through huge hordes of zombies with your Rocket Launcher.<br/><br/>* Different Special Powers for each Player:<br/>Each player has some special powers to help you battle the Zombie Hordes! (lightning bolt, tesla shield, stealth, super speed...)<br/><br/>* Shop:<br/>Use the collected cash dropped by killed Zombies to purchase weapons and items in the shop.<br/><br/>* Cartoon-style 2D Graphics:<br/>Sharp and good-looking 2D cartoon graphics and characters.<br/><br/>* Music and Sound Effects:<br/>Somber and Mysterious music to help create the proper mood.", "metacritic": null, "released": "2017-10-31", "tba": false, "updated": "2019-07-30T16:41:11", "background_image": "https://media.rawg.io/media/screenshots/88c/88c0d23d036627e9695730c979fc49c3.jpg", "website": "http://www.4figapps.com/us/grannyvszombies/index", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 150, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Juan Casanueva"], "genres": ["Action", "Arcade", "Casual"], "publishers": ["Juan Casanueva"], "esrb_rating": null}