{"id": 245729, "slug": "island-tribe-2", "name": "Island Tribe 2.", "name_original": "Island Tribe 2.", "description": "Get ready for new adventures in the second part of the Island Tribe iPhone series! Be one of the first to know what has happened to the settlers after their escape from the great volcano. <br/><br/>Having sailed for many days in search of a new home, the settlers came upon a lonely traveler who had become lost at sea. Thankful to the settlers for his rescue, the explorer decided to share a secret with them and unfolded an old map. It revealed three islands cloaked in mysterious fog that concealed hidden treasure and magic artifacts… <br/><br/>Help the tribe find a new home and make it through to the magic Altar of Wishes. Your way won’t be an easy one, so get ready for real dangers and challenges. Keep collecting resources, constructing and repairing buildings and overcoming new obstacles in Island Tribe 2! Lead the tribe and make all their dreams come true! <br/><br/>Hurry up! Check out Island Tribe 2 to get: <br/><br/>- Sequel to the hit game Island Tribe <br/>- Variety of new buildings and upgrades <br/>- 30 levels full of new adventures <br/>- 3 colorful episodes <br/>- Strategy and time management gameplay <br/><br/>Grab it while you can, and TELL YOUR FRIENDS! <br/><br/>Enjoy Realore Games at http://www.realore.com <br/>Follow us on: <br/>http://twitter.com/realoregames <br/>http://www.facebook.com/RealoreGame", "metacritic": null, "released": "2011-12-14", "tba": false, "updated": "2019-10-22T14:13:30", "background_image": "https://media.rawg.io/media/screenshots/cf3/cf36857fc8655efbaa84b0d612284874.jpg", "website": "http://qumaron.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 246, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Qumaron"], "genres": ["Adventure", "Strategy"], "publishers": ["QUMARON SERVICES"], "esrb_rating": "Everyone 10+"}