{"id": 245853, "slug": "zombie-hunter-death-to-the-undead", "name": "Zombie Hunter: Death to the Undead", "name_original": "Zombie Hunter: Death to the Undead", "description": "ARCADE STYLE ZOMBIE SHOOTING RAMPAGE<br/> <br/>We’re gonna be doin’ one thing and one thing only: Killin’ Zombies.<br/> <br/>Blast these zombies back to the deep depths of hell and save the human race as we know it. The ladies will love you forever, but heck, you’re just doing it cuz you need to kick your Saturday morning hangover. Yeah, you have that cool looking suit, but that’s just because there was a sale at the local thrift shop. The guns are just a perk of the job. And OH, did we mention wolverine blades and deadly grenades... things are gettin’ interesting. If you’re looking for a traditional, run of the mill zombie shooter, then this ain’t your game, but if you want a retro-styled, zombie-crushin’ experience, look no further. THIS GAME HAS GOT U COVERED.<br/> <br/>Game Features:<br/>- Dope arsenal of weapons to upgrade and choose from. Why stick with a pistol when you got a flamethrower?!<br/>- We got more levels than wrinkles on your grandpa’s face. Talk about some good content.<br/>- A plane full of snakes sounds pretty ridiculous, but you got a laboratory of nurses stabbing with their tongues, egg-dropping zombie birds, and knife wielding butchers to name a few. In case that isn’t enough, good luck with those 8 bosses.<br/>- And if you’re one of those “go-getters”, we have that late night lovin’ you be lookin’ for with missions, achievements, and leaderboards galore.", "metacritic": null, "released": "2016-04-21", "tba": false, "updated": "2019-10-22T14:40:06", "background_image": "https://media.rawg.io/media/screenshots/ce3/ce3172c767f62d04fb4ad143e1bbcec1_8aZ0dS9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 174, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Yodo1 Games"], "genres": ["Action", "Adventure"], "publishers": ["Yodo1 Hong Kong"], "esrb_rating": null}