{"id": 245947, "slug": "wordsearch-food-western-eastern-food-type", "name": "WordSearch Food (Western, Eastern, Food Type)", "name_original": "WordSearch Food (Western, Eastern, Food Type)", "description": "Word search games-also know as word find games-are popular for helping students recognize words.<br/>In searching for words, the students seem to read and memorize the words in a way that they enjoy and which helps them learn the words and their spelling. <br/>Enjoy hours of fun with the classic game of word search. <br/><br/>This game theme revolves around Food for both the Western and Eastern Worlds with an addition category of Food Types. <br/>This game is packed with over a thousand words with unlimited puzzles with no puzzle being the same. <br/><br/>Here are the categories...<br/><br/>Western...<br/>America, Germany, France, Italy, Spain, United Kingdom, Greece, Hungary, Sweden, Norway, Romania, Poland, Chile, Bulgaria, Austria, Belgium, Serbia, Uruguay, Ukraine, Finland, Canada, Ireland, Australia, Argentina<br/><br/>Eastern...<br/>China, Japan, Malaysia, Thailand, Armenia, Korea, Vietnam, India, Philipines, Iran, Taiwan, Cambodia, Myanmar, Load, Indonesia, Pakistan, Lebanon, Sri Lanka, Bangladesh, Israel, Mongolia, Russia, Afghanistan, Turkey<br/><br/>Food Type...<br/>Vegetables, Nuts, Fruits, Cakes, Herbs, Pasta, Cheese, Condiments, Sushi, Soups, Cuts of Meat, Finger Food, Grains, Vegetable Oils, Coffee, Alcohol, Desserts, Sea Food, Mollusks, Beans, Wines, Chilis, Breads, Meats", "metacritic": null, "released": "2013-05-24", "tba": false, "updated": "2019-10-22T14:13:37", "background_image": "https://media.rawg.io/media/screenshots/50d/50d1d43fc9b7f3ac6b545b5526030090.jpg", "website": "http://aptapp.blogspot.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 55, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Christian Liang"], "genres": [], "publishers": ["Christian Liang"], "esrb_rating": "Everyone 10+"}