{"id": 246083, "slug": "eko", "name": "eKo", "name_original": "eKo", "description": "<p><strong>¡CUIDADO CON EL <em>KRAKEN</em>!</strong></p>\n<p><strong>eKo</strong> es un juego de supervivencia en el que tendrás que organizar a distintas criaturas marinas para conseguir que tu ecosistema sobreviva el máximo tiempo posible. Todo un hábitat acuático con algas, kril, peces, tiburones y ballenas te aguarda.</p>\n<p>Tu mundo está inicialmente habitado por algas, que aumentan con el paso de los segundos y son el alimento del kril. A su vez, el kril es el alimento de los peces y las ballenas (cada ballena se alimenta de 5 ejemplares). Por su parte, los tiburones se comen a los peces. Y cada 90 segundos... ¡el <em>kraken </em>aparece, y si no puede devorar tres tiburones, la partida terminará!</p>\n<p>El objetivo del juego es introducir la cantidad apropiada de criaturas de cada tipo para alcanzar el equilibrio entre ellos y conseguir mantener suficientes ejemplares de tiburón para poder alimentar al <em>kraken</em>.</p>\n<p>Podrás añadir nuevos ejemplares de las distintas especies al ecosistema, aunque cada vez que añadas uno, tendrás que esperar para introducir otro del mismo tipo. Estas criaturas se reproducen en parejas y se alimentan cada cierto tiempo. ¡Cada especie tiene sus propios períodos de reproducción y alimentación! Si una criatura no tiene alimento, morirá. Solo consiguiendo el equilibrio entre algas, kril, peces, tiburones y ballenas, podrás llegar a los 90 segundos con al menos tres ejemplares de tiburón... ¡para servírselos en bandeja al <em>kraken</em>!</p>\n<p>¿Cuántos segundos serás capaz de aguantar antes de que el ecosistema colapse?</p>", "metacritic": null, "released": "2018-09-27", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/ad7/ad76ba7b66309fe2c4346f9766681a3b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 11, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["67Games"], "genres": [], "publishers": [], "esrb_rating": null}