{"id": 2460, "slug": "tower-of-fortune", "name": "Tower of Fortune", "name_original": "Tower of Fortune", "description": "===== Tower of Fortune is being chosen one of the \"Best iPhone and iPad Games of 2012: Arcade\" by Toucharcade =====<br/><br/>People say<br/>- A surprise gem of RPG - by Missattha<br/>- Excellent Slot/RPG game with unique art and addicting gameplay - by BazookaTime<br/>- Fun, Addictive and stylish - by Anne Packrat<br/>- Classic retro game - by Shaolean<br/>- Terrific RPG hybrid - by Retr0spective<br/>- Amazingly addictive - by Won'tgetfooledagainson<br/>- Old school with a twist - by Ricepirate Mick Lauer<br/>- I'm hooked - by Monster Party<br/>- Deeply engrossing game - by David Magallon <br/>- Highly enjoyable - by Pyong<br/><br/>Review<br/>- A Reel Good Time For RPG Fans - by Toucharcade, 4/5<br/>- ... it's a hard game to put down once you've mastered its secrets - by AppSpy, 4/5<br/>- ... it's just really freaking addicting and clever - by 148Apps, 4/5<br/><br/>Appstore Customer Ratings<br/>Average rating for all versions: 4.5/5<br/><br/>-----------------------------------------------------------<br/>Tower of Fortune is a retro-style slot machine/RPG. You play as a retired hero and lived with daughter peacefully. Until one day, an unknown power from the mystic tower took her away. This force the hero to draw the sword again and fight for his daughter.<br/><br/>Features<br/>- One button gameplay, easy to learn and no tutorial needed<br/>- Retro pixel graphics and funny animation<br/>- RPG mechanics such as combat, powerful equipment from defeated boss, level up and skill upgrade system, hero transform and much more...<br/>- 4 slot machine game: Combat in the tower, Treasure in the chest, Fight the scum family, and Rest in the tavern<br/>- Customize your camp with various options such as dungeon scene, cauldron and mystic mascot<br/>- 39 kind of enemies want to stop you to find the truth<br/>- 37 powerful equipment from the ancient god to collect<br/>- 39 random combat quest and 12 random tavern quest to challenge<br/>- 3 different game ending to discover<br/>- Endless spin and fun!<br/><br/>-----------------------------------------------------------<br/>Facebook <br/>http://www.facebook.com/TowerofFortune<br/><br/>Gameplay Movie <br/>http://youtu.be/eFcrbURiJrI", "metacritic": null, "released": "2012-04-28", "tba": false, "updated": "2019-10-22T14:28:05", "background_image": "https://media.rawg.io/media/screenshots/147/147541515d1a01d54a671263a53891aa.jpeg", "website": "http://www.facebook.com/TowerofFortune", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 109, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Game Stew"], "genres": ["Adventure", "RPG"], "publishers": ["GUAN LING WU"], "esrb_rating": "Everyone 10+"}