{"id": 246114, "slug": "otticute", "name": "OttiCute", "name_original": "OttiCute", "description": "<p><strong><strong>Sabemos que os encanta reventar el score de las demás parejas jugadoras. Es más, sabemos que os gustan las cosas… tiernas.</strong></strong><br/></p>\n<p>       <strong>CONTROLES: Jugador1 W,A,S,D y E para coger al cachorro; Jugador2 Flechas y L. </strong></p>\n\n<p><strong>¿Os parecen adorables las nutrias? Y a quién no.</strong></p>\n<p>Sentid el amor que vive una pareja de nutrias con su pequeño retoño aún huyendo de las terribles garras de la muerte.</p>\n\n\n<p><strong>¡Ponte las pilas!</strong></p>\n<p>Pues un barril impacta contra el fondo marino y su vertido tóxico acecha. Mientras uno de los papás nutria abre camino entre las profundidades, el otro deberá sujetar la manita al bebé, quien nunca puede quedarse solo. Ojo, hay que cambiar las tornas, porque como seres vivos que son, sus fuerzas no son infinitas, sobretodo la del que porta además el peso de su bebé. Desde la compatibilidad y el profundo sentimiento de amor verdadero, la pareja deberá reponer y cuidar sus energías mutuamente para sobrevivir.</p>\n\n<p><strong>Nutrias… sí, son realmente adorables.</strong></p>\n<p>Aunque veréis, el impacto medioambiental causa del ser humano, es tan desmesurado que resulta imposible de vencer. En otras palabras, pequeñas nutrias de mar... ¿Cuánto tiempo seréis capaces de aguantar hasta que el ese horrible error humano acabe con vosotros?</p>\n\n<p><strong>Un Infinity Runner de lo más sensacional.</strong></p>\n<p>Este videojuego cooperativo desatará en vosotros un frenesí de emociones. Pues obstáculos y más obstáculos entorpecerán vuestra huida mientras veis como la contaminación os persigue. Además de lo complicado que es avanzar a la par que gestionar las energías en pareja.</p>\n<p>Tensión no es el único sentimiento. Quizás os provoque una diabetes las acciones tan repletas de ternura que se regalan las nutrias para sobrellevar el momento.</p>", "metacritic": null, "released": "2018-09-26", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/1da/1dab9a919b6da3fc4f7a23f9232a3ad8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 82, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["thechemicalsquirrels"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}