{"id": 24615, "slug": "fantasy-aquarium-world", "name": "Fantasy Aquarium World", "name_original": "Fantasy Aquarium World", "description": "<p>\n      Your Wii becomes a virtual fish tank in Fantasy Aquarium World from \n      Destineer! Pick your fish, decorate your tank and balance species for \n      the ideal aquatic ecosystem. Under the watchful eye of the Captain, feed \n      and care for over 30 species of fish, from the common seahorse to the \n      legendary Loch Ness Monster!<br/>\n</p><ul>\n<li>\n        Hundreds of Options: Choose from six aquariums of different sizes for \n        raising your finny friends. Utilize six additional isolation tanks to \n        maintain balance. Choose from more than 30 tank decorations that \n        beautify your tank and influence fish behavior.\n      </li>\n<li>\n        Thousands of Combinations: Be careful which fish you put in your tank! \n        Some species get along while others may fight or even eat each other! \n        It’s up to you to learn which combinations of fish lead to the tank of \n        your dreams!\n      </li>\n<li>\n        Intuitive Wii Remote Controls: Use the Wii Remote to feed your fish, \n        scoop them out of the tank and more! All interactions are handled with \n        simple, easy-to-use motion controls.\n      </li>\n<li>\n        The Captain’s Challenges: The Captain will set several goals for the \n        player to complete in order to unlock amazing fish and tank \n        possibilities. To complete a challenge, the player may have to \n        establish a new tank, care for difficult fish species and more!\n      </li>\n<li>\n        Amazing Rewards: Unlock mythical aquatic species that you never \n        dreamed possible, including the Loch Ness Monster! The Legends of the \n        Deep have finally been discovered in Fantasy Aquarium World for Wii.\n      </li>\n</ul>", "metacritic": null, "released": "2009-03-24", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["Wii"], "developers": ["CoreSoft"], "genres": [], "publishers": ["Destineer"], "esrb_rating": null}