{"id": 2461, "slug": "rpg-dragons-odyssey-frane", "name": "RPG Dragons Odyssey Frane.", "name_original": "RPG Dragons Odyssey Frane.", "description": "----- Sale Information ---- <br/>It is sale in 50% off .<br/><br/>Dragons Odyssey Frane is a high-quality action-role-playing game from Japanese veteran game developer, Exe-Create.<br/><br/>Beautiful hand-drawn 2D graphics, a wonderful soundtrack, and an excellent English translation coupled with talented voice actors set this title apart and make it a great fit for anyone who has been patiently awaiting a solid fantasy title for iOS to come out of Japan.<br/><br/>We hope you will enjoy Dragons Odyssey Frane, as it is one that has been beloved by many gamers across Japan.<br/><br/>In Vanneth, the world above, and under the direction of God coexist two races charged with the oversight of Kalenthia-or in other words, the world below.<br/>These two races are the Angel Clan, who administer blessings; and the Demon clan, who administer trials.<br/><br/>Sadly, being unable to compromise in their beliefs, they have clashed and disputed continually over how to promote temporal growth in the world below for untold numbers of years.<br/><br/>It is during such a time that one angel named Escude decides to prove who is right once and for all, and in breaking Gods commandment not to interfere directly in the affairs of humans, she descends to the world below.<br/><br/>Having caught wind of this, God summons her most trusted servant, Kunah, the son of the fire dragon chief.<br/><br/>And along with Riel, Kunah&amp;#39;s childhood companion, who is also consquently the daughter of the ice dragon chief, he follows after Escude in an attempt to bring her back to Vanneth.<br/>And so the story of a dragon duo under the guise of human children begins and the unlikely adventure that awaits them below the clouds on the vast Kalenthian continent...", "metacritic": null, "released": "2012-05-02", "tba": false, "updated": "2019-10-22T14:28:05", "background_image": "https://media.rawg.io/media/screenshots/731/7318340450efc6053fb13a41f4c1b31f.jpeg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 209, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Exe Create"], "genres": ["Adventure", "RPG"], "publishers": ["EXE CREATE .INC"], "esrb_rating": "Teen"}