{"id": 246283, "slug": "voltage-itch", "name": "Voltage (itch)", "name_original": "Voltage (itch)", "description": "<p><em><strong>          ░░░░░░░░░░░░░░░░▒▒▒░▒▓▒▓░▒▒▒░░░░░░░░░░░░░░░░░   </strong></em><em>RETRO RAMPAGE FOR PC! Set in the town of Frontier, Missouri, in the 1980s, young man called Mark finds a prototype of VR-glasses. And to his surprise, the glasses are compatible with his Amiga 500. He launches a game and step in to an incredible adventure...</em></p>\n\n<p> Inspired by the Amiga, Commodore 64 and PC '90s legends! Redneck Rampage, DukeNukem and Quake fans might find something familiar from this game, also Dino Crisis and Dinosaur Hunter fans. Graphically it is designed look like AAA Amiga game, however Voltage won't sent you back to the stone age, it is boosted with modern game features (which where not available 30 years ago..).<br/></p>\n\n\n<p>the small town of Frontier, Missouri, in the 1980s. A young man called Mark is having his summer holiday, the last summer before going to a college. Mark is our story hero, who is living in this idyllic small town, surrounded by a thick forests with a dozens of small lakes with crystal-clear water. This town even have famous American football league. But sometimes you can get bored even a burning hot sunny day like this, even a town like this.</p>\n\n<p>that reason, Mark and his friends, Jesse, Benjamin and Kevin, are exploring scrap yard, where they tend to go secretly to look for all the special stuff, mostly parts of the mopeds and cars. The only employee in the scrap yard has gone to long 60 minutes lunch break, and Mark knows that this is their only change to explore treasures in a crap yard..<br/></p>\n\n<p><strong> </strong>old truck which have -as every car in this scrap yard- seemed to be in a traffic accident. Logo of the truck is badly damaged, but he can read some text in it, about \"Co\" and \"International\". He peek into the truck, and notice that most of the stuff is badly damaged. But deeper inside truck trunk he finds a prototype of VR-glasses and a floppy disk. Mark smuggle the glasses and a floppy disk to his home and to his surprise, he find out that the glasses are compatible with his Amiga 500. Quickly he realizes that the truck and all techie stuff were a property of C-I Advanced Technology Department, which does cooperation with a military. <br/></p>\n\n<p> that these glasses are capable to unlock incredible hidden features in Amiga 500, able to take full advantage of the Amiga's potential. He launches a game that extends beyond what the games is likely to do, a whole virtual universe, which is somehow connected to another paralled universe. A universe, where the development of computers wen't through other paths and Amiga is world second biggest and the most advanced computer system. Mark log in to interconnected virtual space called the AOSYS and real adventure begins..<br/><br/>While exploring incredible AOSYS game environment with his glasses, Mark doesn't know that technology department in the other site have noticed their visitor from another dimension and they try to do their best to track the player and get their glasses back.. with a help of army.. <br/></p>\n\n<p> one level at the moment and more in the near future, the game certainly offers value for money. Voltage was originally a peaceful place. But since the C-I Advanced Department of Technology is trying to eliminate the player they bring a massive army of enemies inside the game. Complete all levels* and bring peace back to the Voltage! </p>\n<p>First version (28.9. release) of the game currently includes one huge level:<br/><br/><strong>Level 1: Escape from the Star cruiser:</strong> You awake in Star cruiser. Seems that something has gone badly wrong and it's full of enemies (we don't reveal what kind of..). This level gives you about a 60-120 min gameplay, the game proceeds straightforwardly when you explore different parts of Star Cruiser and you desperate to escape..</p>\n<p>These levels will be added during the development process:<br/><br/><strong>Level 2: VoltageDinoLand:</strong> Dinos have escaped from their cages! This level gives you about a 30-100 min gameplay, depends how much are you going to explore the DinoLand and complete your mission.<br/><br/><strong>Level 3: City of Voltage:</strong> Something calls us in the middle of the city.. In this level you explore suburbs and the main city. It gives you a 30-100 min gameplay.<br/><br/>Currently it is not possible to move back to previous map (for example if you enter to level 3 you cant go back to level 2), since the storyline is going a straight line, but we are planing to implement that feature in future. However we can assure that map sizes are huge and you can freely explore and move inside the map.<br/><br/>To be continued... (More levels will be added during Early Access.).</p>\n<p><strong>Just added features:</strong><br/></p>\n<ul><li><strong>Ability to dive</strong> has been added to the game (27.7.2018)</li><li><strong>Ability to swim</strong> has been added to the game (28.6.2018)</li></ul>\n<p><strong>Features which have been scripted but wont be available in first release 28.9.</strong><br/></p>\n<ul><li><strong>Survival</strong> hunger, thirst and tiredness (This feature is available only levels where player needs to find food, water and shelter in order to survive.)</li><li><strong>Pick, Carry and drop</strong></li><li><strong>Day &amp; Night Cycle </strong>(This feature is available only in levels where it is a part of the story line)</li></ul>\n<p><strong>Features that may be added later</strong><br/></p>\n<ul><li><strong>Merchants system</strong> (In levels where it is a part of the story line, merchants can sell you weapons, ammo, meds and food)</li><li><strong>Drive Cars, Motorbikes &amp; Bicycles</strong></li><li><strong>Sail by boat</strong></li><li><strong>Fly</strong></li></ul>\n\n\n<p>Ah, finally we get to the most important thing in the game :) Player has an access to a wide variety of different kind of guns. Early Access -version includes at least these guns:<br/><br/>Shotgun, Sniper M700, Magnum 357, Colt 1911, RPG, Crossbow, Dagger, Hatchet, Bow, Halberd, Mace, Stones tho throw, Grenades and even one futuretek gun..<br/>Other type of weapons are Melee Weapons, which you also have access when exploring different levels. These Melee Weapons are: Baseball Bat, Bow Saw, Cleaver, Cricket Bat, Crowbar, File, Garden Fork, Hammer, Lead Pipe, Pickaxe, Screwdriver, Shovel, Sledgehammer, Spanner and Wrench.</p>\n\n<p><strong> </strong>dr. Stephen J. McRegon, scientist, computer engineer, and something an a dreamer was asked to help a medium large computer company, to create a ultimate virtual reality system, which was ahead of time. And he did it. On year 1982 he created an open world game for Amiga personal computer, called AOSYS, Amiga operating system. AOSYS was capable to unlock incredible hidden features in Amiga 500, able to take full advantage of it's potential. Unfortunately it was never introduced to the markets in your dimension, where you read this message. Until this day came. McRegon found a way to blend space and time by simple breaking the law's of nature; He was sending radio waves Faster Than Light and that way broke the Cosmic Speed Limit. That maneuver opened a portal (which can be used only for sending small mass objects or voice), and hence deliver AOSYS to our dimension. For you all to play. You see, all physical objects, even you and your chair, exist in three dimensions. Everything has a width, and a high and a length. But there is another kind of length, a length in time.<br/></p>\n\n<p><em>All characters and locations used in this game are fictitious in our universe and any resemblance to real persons, vehicles and places is purely coincidental.</em></p>\n<p><strong>EXTRA CONTENT (Coming soon! Free if you buy the base game before October 2.)</strong></p>\n\n<p><em>VOLTAGE SuperRetro Edition is graphically designed to look almost 100% Amiga/C-64 -game, it is using special shaders. Now you can play Voltage with a SuperRetro look!</em></p>\n<p>Voltage SuperRetro Edition comes free for you if you buy the base game! Voltage Super Retro is graphically designed for hardcore Retro players! This DLC includes the same game as the main game, but this version comes with ultra retro shaders, which makes Voltage look like Amiga / C64-game. So if you are more fan for ultra retro than  main game future retro style, you can play now with SuperRetro -look! Notice that this DLC is free for those who have bought the main game before July 20th 2018. If you buy the main game before that day, you will get this DLC for free forever. We reserve the right to change the price after the July 20th.</p>\n<p>Notice that if you save your game in the main game 'Voltage', you cannot load your saved games in this SuperRetro Edition.<br/></p>\n<p><strong>How to play Voltage Super Retro Edition</strong><br/>This Extra Content will be available later 2018.</p>\n<p><strong> </strong><strong>Why In Development?</strong></p>\n<p><em>“Reason why In Development is to collect feedback about the levels and gameplay overall, and to make sure that Voltage is game what players enjoy to play (is A.I clever enough, how about map design). </em></p>\n<p><em>Creating a complete game will take time and we feel that we need feedback about the gameplay. We wan't also explore new ideas with our community and take the time we need to get every detail/map design right.\"</em></p>\n<p><strong>Approximately how long will this game be in In Development?</strong></p>\n<p>“We would evaluate that the approximate estimate is 6-24 months. The time may be even longer: for example if we receive huge amount of ideas about map design from our community and we start implementing ideas. It is possible to make a huge game with this engine, but we need more ideas from the community because it is possible that our imagination is limited.”</p>\n<p><strong>How is the full version planned to differ from the In Development version?</strong></p>\n<p>“The game engine evolves with speed, so full release will have many more levels, amazing cutscenes (well, we try our best to create almost Hollywood level cutscenes but we can't promise that, but just for you all to know that this is our goal) and even more advanced A.I. than now. Buying this game now on this In Development price you will get access our updates (new maps, game technical development etc). Final version will have 10 levels. Mayby even more, but at this point we can promise that the number of levels will be 10.</p>\n<p>If you buy Voltage on In Development price, you receive new maps for free when we update them to the game and you don't need to pay anything extra.”</p>\n<p><strong>What is the current state of the In Development version?</strong> “Voltage was originally a peaceful place. But since the C-I advanced department of technology is trying to eliminate the player (read a plot in About this section ;) ) they bring a massive army of enemies inside the game. Thats why this FPS rampage gives you access to wide variety of different guns, which you can fight against enemies and bring peace back to Voltage.</p>\n<p>The game currently includes one huge level:</p>\n<p><strong>Level 1:</strong> Escape from the Star cruiser: gives player about a 60-120 min gameplay, the game proceeds straightforwardly when you explore different parts of Star Cruiser.</p>\n<p>These levels will be added during the development process:<br/></p>\n<p><strong>Level 2:</strong> VoltageDinoLand: gives player about a 30-100 min gameplay, depends how much are you going to explore the DinoLand and complete your mission.</p>\n<p><strong>Level 3: </strong>City of Voltage: In this level you explore suburbs and the main city. It gives you a 30-100 min gameplay.</p>\n<p>Currently it is not possible to move back to previous map (for example if you enter to level 3 you cant go back to level 2), since the storyline is going a straight line, but we are planing to implement that feature in future. However we can assure that map sizes are huge and you can freely explore and move inside the map.”</p>\n<p><strong>Will the game be priced differently during and after In Development?</strong> “Yes. Voltage will retail for a cheaper entry price during In Development with the intent to raise the price at full release. This is to reward and encourage those who buy Voltage during In Development. Reason for higher price on full release is that the full release will contain more maps and possible new functions. Creating new maps will take time so we feel it is justified to increase price when game leaves In Development. </p>\n<p>Price can be increased a also during Early Access when we ship more content to the game (new maps, gameplay development etc).”</p>\n<p><strong>How are you planning on involving the Community in your development process?</strong> “All users can communicate with their ideas, feedback and questions about the game in the Itch.io forum of the game.</p>\n<p>For example how to bring community ideas to the game:</p>\n<p>*community can help creating new maps by drawing a new map sketches as a .png files and then we here create new maps based to those sketches *give tips what kind of buildings and enemies do they wan't to be placed in the map] *community will also have the opportunity to influence the course of the storyline</p>\n<p>It is important to note that when you buy this game, participation is not compulsory in any way. If you wan't you can just play the game and enjoy the new updates. Or you can wrote feedback and share your ideas. </p>\n<p>It is up to you!”</p>\n<p>Now you just have to decide, are you sure you want to enter into the AOSYS</p>\n<p>░░░░░░░▒▒▒░▒▓░ Minimum System Requirements ▒▓░▒▒▒░░░░░░░░</p>\n<ul><li><em><strong>OS:</strong> Microsoft Windows 7, 8 or 10 (32/64bit)\r\n</em></li><li><em><strong>Processor:</strong> Intel Dual-Core 2GHz or AMD Dual-Core 2GHz\r\n</em></li><li><em><strong>Memory:</strong> 2 GB RAM\r\n</em></li><li><em><strong>Graphics:</strong> NVIDIA GeForce 400 series or AMD Radeon HD 6000 series, 2GB Video Card (Minimum Shader Model 5.0)\r\n</em></li><li><em><strong>DirectX: </strong>Version 11\r\n</em></li><li><em><strong>Storage:</strong> 4 GB available space\r\n</em></li><li><em><strong>Sound Card:</strong> DirectX Compatible Sound Card with latest drivers</em></li><li>Your purchase come with .exe file and other necessary files. </li></ul>\n<p>░░░░░░░▒▒▒░▒▓░ A Unique FPS Game For PC ! ▒▓░▒▒▒░░░░░░░░</p>", "metacritic": null, "released": "2018-09-25", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/bae/bae18a0a0452828238a7b0cf2f1c9f85.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 414, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["IcanY"], "genres": ["Shooter", "Adventure"], "publishers": [], "esrb_rating": null}