{"id": 24621, "slug": "major-league-baseball-2k9", "name": "Major League Baseball 2K9", "name_original": "Major League Baseball 2K9", "description": "<p>Major League Baseball 2K9 captures the essence of baseball down to some<br />\nof the most minute, player- specific details including batting stances,<br />\npitching windups and signature swings. 2K Sports has gone above and<br />\nbeyond the call of duty to deliver this in true major league fashion.<br />\nAdditionally, gameplay enhancements in pitching, batting, fielding and<br />\nbaserunning promise this year’s installment to be user-friendly and<br />\nenjoyable for rookies or veterans. New commentary and presentation<br />\nprovide the icing to this ultimate baseball experience. If you really<br />\nwant to Play Ball this is the game for you.<br />\nPinpoint Pitching – Use the Wii Remote to control every pitch. A flick<br />\nof the Wii Remote, as you pitch, will increase velocity and movement<br />\non your pitches.</p>\n<p>Precise Hitting – Use the Wii Remote and Nunchuk for total control of<br />\nyour hitting. The Wii Remote allows you to place your hits in relation<br />\nto your swing timing, swing speed and swing angle.</p>\n<p>Signature Style – Individual MLB player-specific batting stances,<br />\nstep-ins, step-outs, home run celebrations, windups and deliveries<br />\ncreate a real life game experience.</p>\n<p>New Broadcast Team – Gary Thorne provides the play by play calls<br />\nalongside color analyst Steve Phillips giving more depth and realism<br />\nfor a true-to-life conversational broadcast. With improved sound<br />\neffects including real time crowd noise you’ll feel like you’re<br />\nactually sitting in the park.</p>\n<p>New 2K Beats – Featuring Judas Priest, Cheap Trick, Coheed &amp; Cambria,<br />\nTed Nugent, SR-71, The Romantics, Boys Like Girls, and Europe.</p>", "metacritic": 62, "released": "2009-03-03", "tba": false, "updated": "2020-05-01T08:03:28", "background_image": "https://media.rawg.io/media/games/d43/d4357402bfcf2cf06650aab2e3bbf2a3.jpg", "website": "http://2ksports.com/games/mlb2k9", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 9, "dropped": 2}, "playtime": 1, "achievements_count": 43, "ratings_count": 0, "suggestions_count": 358, "game_series_count": 7, "reviews_count": 0, "platforms": ["Xbox 360", "PC", "PlayStation 2", "PlayStation 3", "Wii"], "developers": ["2K China", "Visual Concepts"], "genres": ["Sports"], "publishers": ["2K Sports"], "esrb_rating": "Everyone"}