{"id": 246350, "slug": "rcz-run", "name": "RCZ - Run", "name_original": "RCZ - Run", "description": "<p>Not uploading the android version yet as it is not ready but here the pc version of the game. The game is a bit different from a FPS game as you need to run from the enemies and the more you run the more you earn. But don't be sad if you thought it to be a FPS game as in you shop you can get a gun and begin shooting. </p>\n<p>There is a multiplayer version as well but it is still in development and would be out a bit late as I am busy during these days so it might not be possible for me to give out a new game next month but I hope you all would like this game and support it.</p>\n<p>A FEW DETAILS ABOUT THE GAME :-</p>\n<p>You are having 5 lives which increase after every 30 minutes and you can purchase them as well.</p>\n<p>You have an ammo as well if you have a gun which is displayed in the game.</p>\n<p>After 11am you would receive a gift but make sure you open the game at least twice one before 11am and one after that and there's also a reward for playing more then a specific time (15 minutes).</p>\n<p>WARNING - NOT TO PRESS 'Delete' key as that will erase the data of yours. </p>\n<p>IMPORTANT STUFF :- </p>\n<p>So this game is for all and you can get the game for free and play that and make sure to leave the experience below and well I hope you all would like it and you can support the game and me on Patreon.</p>\n<p>Every support of highly appreciated and you can support by giving any monthly amount and it is cancelable anytime so help me creating the games and keeping the content on the site free.</p>", "metacritic": null, "released": "2018-09-24", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/b2c/b2c7f00485e6b824e299a0f717292e4d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 148, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Yash Kumar Gupta"], "genres": ["Action"], "publishers": [], "esrb_rating": null}