{"id": 246363, "slug": "living-playground", "name": "Living Playground", "name_original": "Living Playground", "description": "<p>Siblings Octavio, Tony, and Pablo are exploring outside of an abandoned factory, looking for the world’s best snails. You can guess where this is going. <br/></p>\n\n<p><strong>Living Playground</strong> is a short puzzle-based adventure game with a dash of horror theming for flavor. The player controls Tony, the cheerful slide girl, as she attempts to reunite with her brothers and find an exit while avoiding multiple untimely ends. Conveniently, the children aren’t human but are living toys themselves, playground equipment which can take human form. Along the way, they uncover interesting details about the factory they're trapped in. What happened to the rather cheery-sounding owner? How did things get this WEIRD? At least the monster parts make sense, because there are some strange playthings wandering the factory.</p>\n<strong>Content Warning</strong>:  MILD\r\nA full list is available in the game's readme file, but it's mostly fantasy violence and very light touches of horror imagery. There is a chase sequence.\r\n<p>That said, it’s relatively low-difficulty, so even people bad at games (LIKE ME) should be able to complete it! And if you get lost, there is a walkthrough provided in the ZIP. The general running time seems to be about an hour and a half.</p>\n<p>Please feel free to contact me for bug reports, critique, or any other reason. While this is a remake of my first game, I'm still learning the ins and outs of RPG Maker and any advice anyone has just helps me improve my next games!</p>", "metacritic": null, "released": "2018-09-24", "tba": false, "updated": "2019-08-28T23:20:09", "background_image": "https://media.rawg.io/media/screenshots/cce/cce0f99f5457588ddffdb78a73fc7b65.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 61, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Meaka"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}