{"id": 246467, "slug": "choochoo-heroes", "name": "ChooChoo Heroes", "name_original": "ChooChoo Heroes", "description": "<p>Casually enjoy the refreshing RPG!<br />\nLives of Cute and Adorable Heroes</p>\n<p>Come on board on a full out adventure with our cute little retro heroes.</p>\n<p>The elves have now risen from their sleep.<br />\nDive into our rescue mission and help the elf warrior and princess save their friends!<br />\nSpecial mission! Defeat the monsters and save the friends in captive!</p>\n<p>Brave Warrior!<br />\nChoose from over 100 heroes to greet as your fellow- the charismatic dragon wizard being just one of many.</p>\n<p>Fight our way against rare, unique monsters, and win the finest (5 stars) equipment!<br />\nBut beware of the monster that was once a hero- and now the most dreaded nightmare…</p>\n<p>Defeat the monster squad with a party of only the greatest and the bravest of hearts,<br />\nAnd behold yourselves for the conquering of underground dungeons- soon to be updated.</p>\n<p>★ The real RPG with clear role division.<br />\nTanks do tanking, Dealers deal, and the Healers heal. The real RPG following the principle of RPG </p>\n<p>★ Fellows with various occupations.<br />\nChoose lovely fellows from more than 100 different characters and form your own party!</p>\n<p>★ Powerful boss monsters appear in map!<br />\nDefeat boss monsters and get legendary items to strengthen your characters. </p>\n<p>★ Gain reputation and compete ranks with friends!</p>", "metacritic": null, "released": "2016-12-12", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/55b/55b8c255fffcc37c58195a371b5f1f6d.jpg", "website": "http://www.skonec.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 180, "game_series_count": 0, "reviews_count": 1, "platforms": ["Android"], "developers": ["SKONEC Entertainment Co"], "genres": ["RPG"], "publishers": [], "esrb_rating": "Everyone 10+"}