{"id": 246491, "slug": "robogenesis", "name": "RoboGenesis", "name_original": "RoboGenesis", "description": "Play as an advanced sentient AI exiled from your homeworld for your radical ideas, doomed to roam the cosmos in search of a purpose for you and your robot followers. A disaster forces you to make a hasty landing on an unexplored world where you will need to rediscover the essential skills for survival in this strange new environment. To thrive, you will need to explore a diverse ecosystem, collect the resources to provide for your robots, build bases and infrastructure, and research new technologies. But beware, not all of your followers are content with your leadership. Get ready to defend your installations and robots from the dissenters. Protect your supply lines and production from the rebel faction. Relearn the art of war to overcome overwhelming odds utilizing every tactical and technological advantage you can muster. Survive long enough and maybe, one day, even discover the technology you need to return to space.<br/><br/>Features:<br/><ul><li>A diverse world with distinct biomes each holding unique resources and challenges.<br/></li><li>Different types of robots to build and control, ranging from simple utility drones to advanced combat models.<br/></li><li>Intense and physically based combat featuring a wide array of weaponry each with strengths and weaknesses including chemically propelled projectiles affected by atmospheric drag and gravity, persistent beam weapons requiring vast amounts of energy, and magnetically accelerated shells requiring long capacitor recharge times. <br/></li><li>Harvesting, scavenging and recycling resources.<br/></li><li>Building bases for production and research.<br/></li><li>A technology tree for specializing robots, weaponry, buildings and many aspects of the game to tailor it to your playstyle through R&amp;D.<br/></li><li>Co-op multiplayer with up to seven of your Steam friends. Invite who you want to your persistent world. The world is simulated when you or any of your chosen friends are active in it and saved to your Steam account so you can access it anywhere. Your game stores progress for your team with no private inventories or technology trees, so friends can join or drop in at any time without having to catch up.</li></ul><br/>Check out our YouTube channel for high quality previews and updates!", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:52:49", "background_image": "https://media.rawg.io/media/screenshots/561/5617c99b1857c158de3d5675878c2466.jpg", "website": "https://www.youtube.com/channel/UC_3k3XCdaMJGcgaj056OySQ", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 464, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["GrimFox Games"], "genres": ["Action", "Adventure", "Simulation"], "publishers": ["GrimFox Games"], "esrb_rating": null}