{"id": 246540, "slug": "rainbow-unicorn-ice-cream", "name": "Rainbow Unicorn Ice Cream!", "name_original": "Rainbow Unicorn Ice Cream!", "description": "Cindy is a big unicorn fan! She collected many interesting things about unicorn! She is going to have a magic unicorn party at this weekend! All of us have received her invitation!<br/>Party day finally arrive! Everybody come to Cindy’s house!<br/>The unicorn party is so cool! We can find many decorations, toys and yummy frozen desserts that all about unicorn! <br/>The unicorn desserts are my favorite part of this party! She prepared 5 trendy unicorn desserts for us! Like galaxy frappuccino, unicorn ice cream cupcakes, unicorn ice cream sundae, rainbow yogurt swirl and classic ice cream with unicorn cones!<br/>Do you want to try these amazing desserts and have fun with us? Come on! Let’s get start right now!<br/><br/>Product Features:<br/>-A super fun food-making game<br/>-Make yummy rainbow &amp; unicorn frozen desserts<br/>-Five kinds of desserts to make: galaxy frappuccino, unicorn ice cream cupcakes, unicorn ice cream sundae, rainbow yogurt swirl and classic ice cream<br/>-Tons of realistic cooking tools to play: glasses, slushy dispenser, ice cube molds, kettle, freezer, cutting board, knife, food processors, spatula, ice cream dispenser, spoon, paper cups, bowl, cream mixer, home ice cream maker, pan, induction cooker, ice cream mold, straws, flour sieve, cupcake mold, oven, piping bags and so much more<br/>-Tons of food materials and decorations to try: water, ice, fruits, candies, sprinkles, cream, marshmallows, milk, chocolate syrup, sugar, eggs, butter, salt, powder food coloring, straws, baking powder, flour, food coloring and so much more<br/><br/>How to play: <br/>- Use interactive controls to play the game<br/>- Take different cooking modules for galaxy frappuccino, unicorn ice cream cupcakes, unicorn ice cream sundae, rainbow yogurt swirl and classic ice cream <br/>- Try different tools to make your desserts<br/>- Mix various ingredients to create the unique flavor and color of your desserts<br/>- Decorate your desserts with beautiful chocolate syrup, sprinkles, candies, fruits and straws <br/><br/>Important Message for Purchases:<br/>- By downloading this App you agree to SHAKE IT’s Privacy Policy at https://www.shakeitmediainc.com/privacy-policy/<br/>- Please consider that this App may include third parties services for limited legally permissible purposes.", "metacritic": null, "released": "2017-10-19", "tba": false, "updated": "2019-06-24T02:00:56", "background_image": "https://media.rawg.io/media/screenshots/953/9539e5662812bc5e1997bccfc7dbf7c7_LUmNyzD.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 43, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Shake It"], "genres": ["RPG", "Family"], "publishers": ["Shake It Media"], "esrb_rating": "Teen"}