{"id": 24652, "slug": "mushroom-men-rise-of-the-fungi", "name": "Mushroom Men: Rise of the Fungi", "name_original": "Mushroom Men: Rise of the Fungi", "description": "<p>\n      Mushroom Men inhabit the world that goes on while we humans are looking \n      the other way, in the twilight hours when we sleep. We tower above them \n      and go about our business completely unaware of the war waged at our \n      feet.\n    </p><p>\n      After the comet had passed, the scientists concluded that the strange, \n      green dust had no effect on the world. No one noticed that tiny plants \n      and fungi were acting strangely. Mushrooms, cacti, flowers and vines had \n      awakened to full consciousness. Tribes quickly formed, building plant \n      and fungi nations and with nation building… came war!\n    </p><p>\n      Mushroom Men: Rise of the Fungi takes you through the events leading up \n      to the Spore Wars as a three inch high Mushroom Man. As one of three \n      classes of mushrooms players experience a world larger than life and \n      prepare for a tiny war of epic proportions.\n    </p><ul>\n<li>\n        Players explore and battle their way through more than 10 lush and \n        spooky levels in an oversized and hostile world.\n      </li>\n<li>\n        Convert everyday items and trash you find into weapons using the \n        stylus and the Scav system\n      </li>\n<li>\n        Choose from three different characters classes to do battle: Heavy, \n        Sage, and Scout.\n      </li>\n<li>\n        Experience two different game styles – a fast paced single-player \n        adventure, or team up with a friend in Cooperative mode.\n      </li>\n<li>\n        Wipe out your enemies with unique, spore-based powers\n      </li>\n<li>\n        Serves as a prequel to Mushroom Men: The Spore Wars on Wii\n      </li>\n</ul>", "metacritic": null, "released": "2008-12-02", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/c5d/c5d03a8a424499c862dfc9ab1413a6bd.jpg", "website": "http://www.mushroommen.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 171, "game_series_count": 2, "reviews_count": 0, "platforms": ["Nintendo DS"], "developers": ["Red Fly Studio"], "genres": [], "publishers": ["Gamecock Media Group"], "esrb_rating": null}