{"id": 246698, "slug": "pixel-color-by-numbers-game", "name": "Pixel Color by Numbers Game", "name_original": "Pixel Color by Numbers Game", "description": "Pixel Color is the perfect relaxing app! Choose a page in the coloring book or pick one of your own photos. Just follow the number in the pixel boxes. It's easy and fun. Rediscover the simple joy of coloring!<br/><br/>Key features:<br/><br/>- Easy and intuitive coloring by following the numbers.<br/>- A large choice of coloring pages to satisfy everybody: Monuments, Animals, Portraits, Mandalas, Food and many others.<br/>- Color your own photos from your gallery or by taking a selfie.<br/>- Save your creations and share your timelaps video with your friends via Instagram, Facebook, Messenger, etc.<br/>- Coloring anti-stress pictures.<br/>- New pictures regularly added (premium feature)<br/>- Works offline. No connection needed to relax in the coloring book!<br/><br/>Painting has never been so easy. So do not wait any longer: come and relax on Pixel Color!<br/><br/><br/>Subscription information:<br/><br/>- Subscribe for unlimited access to our Premium features: premium pictures, unlimited import.<br/>- Weekly ($7.99) &amp; yearly ($40.99)*<br/>- Free trial subscription is automatically renewed unless cancelled 24 hours before the renewal<br/>- Payment will be charged to iTunes Account at confirmation of purchase<br/>- Account will be charged for renewal within 24-hours prior to the end of the current period, at the same price<br/>- No cancellation of the current subscription is allowed during active subscription period<br/>- Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user’s Account Settings after purchase<br/>- Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that publication, where applicable<br/><br/><br/>Terms of Services &amp; Privacy Policy: http://musicgamingapps.com/pixelcolor<br/><br/><br/>* Price are equal to the value that \"Apple's App Store Matrix\" determines is the equivalent of the subscription price in $USD.", "metacritic": null, "released": "2018-09-27", "tba": false, "updated": "2019-10-22T14:13:44", "background_image": "https://media.rawg.io/media/screenshots/52a/52a74d7d78325bc4779dc48ba0872dce_tHDKTD2.jpg", "website": "http://musicgamingapps.com/pixelcolor", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 66, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Roger McAdams"], "genres": ["Board Games", "Puzzle"], "publishers": ["Roger McAdams"], "esrb_rating": "Everyone 10+"}