{"id": 24667, "slug": "shaun-white-snowboarding-road-trip", "name": "Shaun White Snowboarding: Road Trip", "name_original": "Shaun White Snowboarding: Road Trip", "description": "<p>\n      Shaun White Snowboarding: Road Trip takes the action-sports genre to a \n      whole new level. For the first-time ever, feel the rocky weight of the \n      mountain push up against your toes in your very own living room, ­with \n      the revolutionary Wii Balance Board™. Whether you’re coasting down bunny \n      slopes or carving through black diamonds, don’t expect to survive this \n      wild ride alone – you will need the support of an entourage and friends \n      to make it down this mountain.\n    </p><p>\n</p><p>\n      Developed in close collaboration with Olympic Gold Medalist Shaun White \n      – the most successful snowboarder in the history of the sport – Shaun \n      White Snowboarding is set to redefine the action-sports genre.\n    </p><p>\n</p><p>\n      Features:\n    </p><p>\n</p><ul>\n<li>\n        Hit the Slopes with the Wii Balance Board\n      </li>\n<li>\n        Get yourself into the game like never before by using the Balance \n        Board to control your rider. Control your jumps and tricks with the \n        intuitiveness and fun of having a snowboard in your own living room.\n      </li>\n<li>\n        Exclusive World Tour\n      </li>\n<li>\n        Everybody loves a road trip! You and your crew travel the world to \n        participate in a variety of the fun and exciting events to become a \n        world-renowned athlete. Hit the half-pipe competitions, race down the \n        mountains, or just do some freeriding – there’s plenty of boarding \n        action to satisfy all your needs.\n      </li>\n<li>\n        Round the Globe with Shaun White\n      </li>\n<li>\n        Ubisoft worked in close contact with Shaun White in order to infuse \n        the experience with the most authentic elements of his riding style, \n        personality and sense of humor. Shaun will act as a good-natured \n        friend and mentor to the player, hooking him up with the right friends \n        to conquer challenges together, introduce him to new locales, or \n        simply be around to share in a laugh.\n      </li>\n<li>\n        Play Together\n      </li>\n<li>\n        Engage in a seamlessly integrated multiplayer experience for two to \n        four players in both cooperative and competitive gameplay.\n      </li>\n<li>\n        Get Your Own Crew\n      </li>\n<li>\n        In the world of snowboarding, it pays to have friends on your side. \n        Your crew of friends will always be there to help you by offering you \n        unique abilities to improve both your riding and keeping you grounded \n        with friendly pranks; filming all the antics along the way.\n      </li>\n<li>\n        Dare to Be the Best\n      </li>\n<li>\n        Undertaking Dares from your friends will lead you to snowboard in a \n        variety of events such as Slopestyles, Big Airs, Half Pipes, Rail \n        Jams, Slaloms, Bordercross and Downhill events. You can even chill in \n        the backcountry with your friends and enjoy riding at your own pace.\n      </li>\n</ul>", "metacritic": null, "released": "2008-11-16", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/e72/e723185771d89dfa3338f0c374f6d198.jpg", "website": "http://shaunwhitegame.us.ubi.com/index.php", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 394, "game_series_count": 0, "reviews_count": 0, "platforms": ["Wii"], "developers": [], "genres": [], "publishers": ["Ubisoft Entertainment"], "esrb_rating": null}