{"id": 246689, "slug": "survival-ocean-adventure", "name": "Survival: Ocean Adventure", "name_original": "Survival: Ocean Adventure", "description": "Prepare yourself for a new chapter of the survival genre – Survival Island: Ocean Adventure, a whole new free online adventure survival simulator comes to your mobile devices! The survival genre gets challenged by genre masters one more time! In this new free online adventure survival simulator you will once again face beautiful and dangerous islands full of mysteries and deadly enemies. Explore the island to find secret locations and shelters of other survivors in our new free online adventure survival simulator Survival Island: Ocean Adventure! Level up and evolve your own survivor to unlock best new blueprints for crafting, survivor. Start a new adventure and get to crafting the best unique weapon and armor, every new item you craft will help you survive prolonging your survival. Arrange the safe haven by building and the best shelter possible to make your survival easier, fight off deadly enemies from within the safe walls of your house. Gather resources and hunt animal wildlife to craft new weapon and armor. Try our new free online adventure survival simulator Survival Island: Ocean Adventure and become the strongest survivor! Become the Hero of the Island!<br/><br/>- One of the main features of our free online adventure survival simulator Survival Island: Ocean Adventure is a unique crafting and building system. You might be the strongest survivor on the island but you will still drop dead without a proper weapon and armor so getting to crafting early on is essential for your survival. Crafting and upgrading will give you an advantage in any fight – create the best new knives, spears, hammers, bows and tons of other weapons in Survival Island: Ocean Adventure!<br/><br/>- Our new free online adventure survival simulator Survival Island: Ocean Adventure lets you level up and evolve your hero in order to become a true survivor! Level up and evolve by exploring the ocean and islands, gathering resources, building shelters, crafting new weapon and armor and fighting against deadly enemies! Every mistake might cost you your life! Survival won’t be easy, prove that you’re up for the challenge and evolve into the Best Survivor!<br/><br/>- Our new free online adventure survival simulator Survival Island: Ocean Adventure drops many challenges and difficulties on you right from the start, but you can protect yourself and everything you own by building the best and toughest shelter worthy of a true survivor! Build, strengthen and upgrade your house to prolong your adventure and make your survival easier. Survive day after day on the island by fighting deadly enemies, exploring and gathering resources. Survive night after night within the cozy walls of your unique and safe shelter!<br/><br/>- Experience not only one of the toughest gameplay of a true survival genre game but also exciting story introduced through multiple quests and missions in our new free online adventure survival simulator Survival Island: Ocean Adventure. Test your skills on a hostile island full of deadly enemies, hidden dungeons and dangerous traps. Take a quest, give everything you’ve got to complete it and get a unique and well-earned reward for all your effort!<br/><br/>- Stay tuned for the upcoming multiplayer update in the nearest future! A new free online adventure survival simulator Survival Island: Ocean Adventure will unite the best players all over the world to achieve their goals faster and easier. The upcoming online multiplayer mode will let multiple survivors meet each other and fight side by side on the islands. Decide the fates of other players, destroy their shelters or help them out – change the world of the wild islands to your liking. Survival was already tough, the upcoming multiplayer mode will make it even tougher!", "metacritic": null, "released": "2018-08-04", "tba": false, "updated": "2019-10-22T14:13:44", "background_image": "https://media.rawg.io/media/screenshots/27b/27bf1414b6951d01a6ded49926817993_muIJSC2.jpg", "website": "https://www.facebook.com/Survival-Island-Ocean-Adventure-172874673404882", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 177, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["PRIDEGAMESSTUDIO OU"], "genres": ["Adventure", "Simulation"], "publishers": ["PRIDEGAMESSTUDIO OU"], "esrb_rating": "Teen"}