{"id": 246641, "slug": "adorable-toy-phone-baby-game", "name": "Adorable Toy Phone Baby Game", "name_original": "Adorable Toy Phone Baby Game", "description": "A Must Have App For Parents! Even Better, Babies Love This Toy Phone Game. <br/><br/>The Toy Phone Game features bright colors, wiggling buttons, large and colorful items, piano sounds and lots of entertaining animations with HD cartoon animals! <br/>This fantastic baby phone game features a lot of pre-bundled nursery rhymes and lullabies that gets played when babies make a fake call! <br/><br/>Cool animations on tapping the screen with HD cartoon animals keeps the babies curious for hours and hours of guaranteed fun! <br/><br/>FEATURE LIST: <br/>- Large, colorful buttons with wobbling animation! <br/>- Piano sounds on pressing the buttons <br/>- Bright Colors engage the babies <br/>- iPad, iPad Mini, iPod, iPhone 4S and iPhone 5 support <br/>- Cute Cartoon Animals makes this baby game fun! <br/><br/>Your baby will love bobbing to the music, sound effects and animation packed in this game, that is baby-tested for your peace of mind! <br/><br/>Give it a try! You won't regret it!! <br/><br/>You can always connect to us and stay tuned with updates and provide feedback on: <br/><br/>Facebook: http://facebook.com/mobileroo <br/>Twitter: @mobileroo <br/>Support Email: info@mobileroo.com.au <br/><br/>We would love to see you take action now in giving the best toy phone to your little one today!", "metacritic": null, "released": "2013-05-16", "tba": false, "updated": "2019-10-22T14:13:41", "background_image": "https://media.rawg.io/media/screenshots/fbf/fbfe8e86ca63d0aa532da00c8786ccd0_y9zzZqU.jpg", "website": "http://games4babies.com/toyphone", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 36, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Mobileroo"], "genres": ["Family"], "publishers": ["Mobileroo"], "esrb_rating": "Everyone 10+"}