{"id": 246720, "slug": "monster-push", "name": "Monster Push", "name_original": "Monster Push", "description": "Monster Push is a cute puzzle action game. You could play a role as lovely creatures, a fox, a tiger, even a panda. Push boxes to beat monsters, collect items, unlock new characters and their skills. Each of the creatures has its own unique skill system. Complete all the challenges by defeating monsters with your wisdom and strategies!<br/><br/>Gameplay:<br/>* New style: Protect yourself against monsters by pushing boxes. Watch out there comes giant monsters sometimes, challenge them bravely!<br/>* Light puzzle: The magic cube and magic box are not ornaments on the map. Rush the magic cube into the box, collect the drop to get more scores. Pretty easy eh? Sorry, monsters won't let you succeed easily. They will come to disturb you and mess up everything!<br/><br/>Features:<br/>* Beautiful scenes. Greensward island floating in sky, island underwater and desert oasis are all free to play.<br/>* Collect lovely creatures fox, tiger, panda…<br/>* 6 kinds of attributes are free to develop, cultivate your own cute creatures.<br/>* Variety of skills, like amazing magic, overpassing, lifting and more!<br/>* Dozens of mysterious items help you to defeat monsters!<br/><br/>For more details, find us on Facebook with ’SoulGameFans’ or just click the following link to our page,<br/>https://www.facebook.com/SoulGameFans<br/>Don’t forget like and follow, we would bring you more interesting mobile games.", "metacritic": null, "released": "2018-08-03", "tba": false, "updated": "2019-10-22T14:13:46", "background_image": "https://media.rawg.io/media/screenshots/f5c/f5ce4f5b4a1bc57d7d4d44cd5e181ed0_Prb3BIF.jpg", "website": "https://www.facebook.com/SoulGameFans", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 95, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["SOULGAME INFORMATION CO"], "genres": ["Action", "Puzzle"], "publishers": ["SOULGAME INFORMATION CO"], "esrb_rating": null}