{"id": 246701, "slug": "battlelands-zombie", "name": "Battlelands Zombie", "name_original": "Battlelands Zombie", "description": "When the evil virus spreads out over this world, you become one of survivors. You need to become stronger when you face more and more vicious evil. You don’t have any kinds of Plan B. Keeping hunting zombies is the only way to save your friends and save yourself.<br/>Battlelands Zombie is one FPS game which can let you hunt different kinds of zombies by various kinds of weapon. You can get different special skills when you carries specific gun. There also have some top-level weapons can kill zombies by special damage effect. Pistol, submachine gun, shotgun, rifle, laser gun, grenade launcher, you can choose the suitable one to handle specific situation. Especially, there are some powerful sniper-rifles can give you exciting sniping experience.<br/>Beside the normal mode, you can play some other different modes with rich shooting experiences. For example, you can feel the pleasure about ‘one shot and one kill’ in the sniper mode. The zombie boss can give you most hard pressure; the only way to defeat him is firing every shot on the right weakness body part of the boss.<br/>Some interaction items in scenes can give you some helpful tactics. Gasoline tank, electric shock gate, death windmill, they give you critical help to break out from the siege of zombies.<br/>Game features:<br/>Free to play<br/>Delicate game graphics<br/>Good weapon system<br/>Special sniper mode<br/>Lots of interaction in scene<br/>Exciting Boss fight", "metacritic": null, "released": "2018-04-30", "tba": false, "updated": "2019-07-29T21:04:07", "background_image": "https://media.rawg.io/media/screenshots/6a0/6a035dd5d58cf76af517a46760731efb_tUtjozq.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 504, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Sichuan Quleduo Network Technology Co"], "genres": ["Action", "RPG"], "publishers": ["Sichuan Quleduo Network Technology Co"], "esrb_rating": "Teen"}