{"id": 246726, "slug": "facelashio", "name": "FaceLash.io", "name_original": "FaceLash.io", "description": "Welcome to the world of FaceLash.io! In this multiplayer game, our goal is very clear: Slapping other faces as hard as you can! Blowing them all up!<br/><br/>How to slap:<br/><br/>※ A hand is rotating round the face. Try to slap other faces with the hand.<br/>※ Having small pieces will make you bigger and stronger, meanwhile slower. Keep in mind that your goal is to slap faces rather than becoming bigger.<br/>※ You can run and rotate faster at a price of dwindling in size. Run after the weak or force the strong into a corner! <br/>※ Get as many items as possible! <br/>※ Pay attention to the enemies jumping out of the clouds. <br/><br/>Now it’s ready to slap!<br/><br/>--------------------<br/><br/>TOURNAMENT is online<br/><br/>Gather all your strength in the TOURNAMENT! You may earn coins or you may lose all your coins.<br/>In this mode, you can afford one—three hit before you get blown up, when you will lose all the coins with you. The good news is you won’t become smaller when using the skill.<br/>New rules, new equipment and new feelings in this exciting mode! Earn some coins in the quick mode and then let’s try the tournament mode. Enjoy yourself!<br/><br/><br/>SHORT WORDS is online<br/><br/>Cannot express your feeling with the look on your face? Try the WORDS!<br/>Express your feeling with the word button on the right of the screen, and all your enemies will see it. Beg or attack, it’s your call.<br/>You can change these words in Makeup.", "metacritic": null, "released": "2018-08-24", "tba": false, "updated": "2019-10-22T14:13:46", "background_image": "https://media.rawg.io/media/screenshots/353/3534c256bd57a0d7000fa3525a582e4a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 151, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["SOULGAME INFORMATION CO"], "genres": ["Action", "Family"], "publishers": ["SOULGAME INFORMATION CO"], "esrb_rating": null}