{"id": 246893, "slug": "pioneer-lands-hd-lite-western-settlers-strategy", "name": "Pioneer Lands HD lite: western settlers strategy", "name_original": "Pioneer Lands HD lite: western settlers strategy", "description": "GREAT PRODUCTION VALUES, 99 LEVELS, HIGH REPLAY VALUE, GAMEPLAY SIMILAR TO MY KINGDOM FOR THE PRINCESS. IF YOU ARE INTO THIS GENRE, I DON'T SEE WHAT THERE IS NOT TO LIKE. WAY TO GO, NEVOSOFT! - GAMEZEBO.COM<br/><br/>Pioneer Lands is a unique game with a fascinating combination of business simulation and strategy set on the frontier of America's Old West! A true Western casual game!<br/><br/>It's a story about brave pioneers who lived in early America. You're one of the first to head west into all sorts of adventures. Your mission is to develop new tracts of land! You'll discover eight unique locations, 99 levels, and an unbelievable number of various tasks which will require strategic thinking! <br/><br/>Features:<br/>- A fascinating combination of business simulation and strategy<br/>- 48 levels of an intriguing gameplay! Two more great level packs are coming soon!<br/>- 23 types of resources<br/>- A unique system of achievements - get all 99!<br/>- Build your own unique farm!<br/>- A comical series of video clips with country music<br/><br/>Welcome to America's Old West! Unbelievable adventures are about to begin!<br/>---------------------------------------------------------- <br/>LIKE GAMES BY NEVOSOFT? <br/>WHY NOT TRY SOME OF OUR OTHER GAMES! <br/><br/>Mysteryville: Sort out the small town's mysterious events in this classic hidden object game - made just the way it should be!<br/><br/>Million Dollar Quest: Solve the mystery from main hero’s childhood, travel the world and win one million dollars in the unique mixture of hidden object, puzzle and adventure genres!<br/><br/>Pantheon: Unlock magic artifacts of ancient deities on an amazing match-3 journey through beautiful locations of the Ancient India.<br/><br/>LandGrabbers: This addictive game combines classic elements of strategy, simulator, and resource management. Nothing can stop you from conquering the world now!<br/><br/>Paradise Beach: build a beach resort of your dream in a new addictive tycoon-style, click management game!<br/>--------------------------------------------------------- <br/>Get the inside scoop on Nevosoft Games: <br/>Join us on Facebook: www.facebook.com/Nevosoft <br/>Follow us on Twitter: http://twitter.com/NevosoftGames <br/>Watch us on YouTube: http://www.youtube.com/NevosoftCOM <br/>Visit our site: http://www.iphone.nevosoft.com<br/>--------------------------------------------------------- <br/>THIS GAME WAS PUBLISHED BY NEVOSOFT. <br/>If you want to successfully release your game on the App Store, write us at publishing@nevosoft.com. <br/>Our experts perform the following services: <br/>- Producing your game in the final stages of development <br/>- Localizing it into more than 10 languages <br/>- Preparing your game for release (and the release itself) <br/>- Marketing (We have a loyal client base of over a million users) <br/>- Promoting your game in various media <br/>- Providing quality customer support", "metacritic": null, "released": "2011-09-01", "tba": false, "updated": "2019-10-22T14:13:52", "background_image": "https://media.rawg.io/media/screenshots/5f1/5f1312e2d7c81983940385dffe12b8c8.jpg", "website": "http://iphone.nevosoft.com/games/pioneer-lands/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 232, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["Nevosoft"], "genres": ["Strategy", "Simulation"], "publishers": ["Nevosoft"], "esrb_rating": "Everyone 10+"}