{"id": 24685, "slug": "nerf-n-strike", "name": "Nerf N-Strike", "name_original": "Nerf N-Strike", "description": "<p>\n      Through the din of a popular arcade, one player has emerged as the best \n      N-Strike gamer his friends have ever seen. But even as Shane smashes \n      through the game's record, something far more mysterious is happening: \n      his success is being tracked and recorded. Shane is the perfect \n      candidate for an ultra-exclusive invitation to become an N-Strike Elite.\n    </p><p>\n</p><p>\n      Later that night, he's awakened to find the Nomad C Series Recruitment \n      bot hovering silently over his bed. \"B.O.B.\" has a challenge for Shane. \n      Join the quest to become an Elite Striker and he'll have access to Top \n      Secret Blasters.\n    </p><p>\n</p><p>\n      It's all the incentive Shane needs, and as the one controlling Shane, \n      it's your opportunity of a lifetime....\n    </p><p>\n</p><ul>\n<li>\n        SWITCH SHOT EX-3 Blaster included with game - Bundled with \n        every game, comes the revolutionary SWITCH SHOT EX-3 which transforms \n        between a live Nerf blaster and a Wii remote shooting peripheral for \n        the game.\n      </li>\n<li>\n        Choose Your Blasters - Play with over 25 NERF Blasters \n        including the MAVERICK REV-6, VULCAN EBF-25, LONGSHOT CS-6, and many \n        never seen before!\n      </li>\n<li>\n        Blast through Danger - Explore a top-secret NERF facility and \n        unravel the mystery of the unknown threat that awaits.\n      </li>\n<li>\n        Multiplayer Action - Go head to head with up to 4 players using \n        additional Wii Remotes and SWITCH SHOT EX-3 blasters.\n      </li>\n</ul>", "metacritic": null, "released": "2008-10-28", "tba": false, "updated": "2019-09-12T06:38:20", "background_image": "https://media.rawg.io/media/screenshots/8dd/8ddb63e27c83d8f608fa5b3844063a23.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "beaten": 2, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 150, "game_series_count": 0, "reviews_count": 0, "platforms": ["Wii"], "developers": [], "genres": [], "publishers": ["Electronic Arts"], "esrb_rating": null}