{"id": 246897, "slug": "dreamsleuth-hidden-object-adventure-quest-hd-lite", "name": "DreamSleuth: hidden object adventure quest HD lite", "name_original": "DreamSleuth: hidden object adventure quest HD lite", "description": "Dream Sleuth, a thrilling hidden object adventure! - <br/>Macgamestore.com <br/><br/>One night Catherine, the main hero, had a rather peculiar dream about a missing girl. Since there wasn’t any new information and the police were baffled by the case she decided to conduct her own investigation.  It’s up to you to question witnesses, compare facts and rumors, and find all the evidence you can... but the most important information will continue to come to you in your dreams. <br/><br/>Features: <br/>- Mysterious storyline <br/>- Unique mini-games <br/>- Exciting gameplay <br/>-  Amazing music <br/>-  Game Center support <br/><br/>Travel in the world of your dreams and save the girl! <br/><br/>We don't recommend playing this game at night. It might cause you to have weird dreams.<br/>--------------------------------------------------- <br/>Like games by Nevosoft?<br/>Why not try some of our other games! <br/><br/>Zzed: a logic marble-popper game filled with fun and humor!<br/><br/>My Kingdom for the Princess: An addictive, award-winning game with unique game play that combines time management, strategy, and simulation. <br/><br/>My Kingdom for the Princess 2: The adventures of Arthur and Princess Helen continue in this long awaited sequel to the addictive strategy, time management, simulation game <br/><br/>Laura Jones and the Gates of Good and Evil: Meet amusing characters and hunt for hidden objects as you try to save the world. <br/><br/>* Laura Jones and the Secret Legacy of Nikola Tesla: Test your Hidden Object skills as you race against time and the other people chasing down Tesla's invention! <br/><br/>Pantheon: Unlock magic artifacts of ancient deities on an amazing match-3 journey through beautiful locations of the Ancient India. <br/><br/>10 Talismans: Set to stunning oriental vistas, this match-3 puzzle game puts you on a quest to collect ten powerful talismans. <br/>--------------------------------------------------- <br/>Get the inside scoop on Nevosoft Games: <br/>Join us on Facebook: www.facebook.com/Nevosoft <br/>Follow us on Twitter: http://twitter.com/NevosoftGames <br/>Watch us on YouTube: http://www.youtube.com/NevosoftCOM <br/>Visit our site: http://www.iphone.nevosoft.com", "metacritic": null, "released": "2011-04-23", "tba": false, "updated": "2019-10-22T14:13:52", "background_image": "https://media.rawg.io/media/screenshots/221/221847a05f5549cc52936af295110ac2.jpg", "website": "http://iphone.nevosoft.com/games/dream-sleuth/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 165, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Nevosoft"], "genres": ["Adventure", "Puzzle"], "publishers": ["Nevosoft"], "esrb_rating": "Teen"}