{"id": 246894, "slug": "dreamland-hd-lite-spooky-adventure-game", "name": "Dreamland HD lite: spooky adventure game", "name_original": "Dreamland HD lite: spooky adventure game", "description": "Now compatible with iOS 6.<br/>---------------------------------------------------------- <br/>Welcome to Dreamland, an old abandoned amusement park! It is full of dangerous traps and broken rides not suitable for children. And it also contains a terrible secret... The evil dwarf who lives here brightens up his miserable days by collecting the souls of those who dare enter the neglected park. And he's got a plan to get your soul. <br/><br/>Only you can rid the world from his presence, but it won’t be easy. His traps and tests are waiting for you. You'll need to make your way around the park looking for useful things in all the old rides. You'll have to open a number of locks, outsmart the swindlers in the shell game, fire the cannon on the Pirate Ship and blast off to the Moon.  There's no turning back. You need to get to the safe where the evil dwarf keeps his contracts for all the lost souls. Contracts that were signed in blood. Moreover, one of these contracts has your younger brother's name on it – and there's another one ready just for you! <br/><br/>Features: <br/><br/>- Spooky and engaging storyline <br/>- Chock full of hidden object searches and various mini-games <br/>- Spellbinding atmosphere of children’s horror <br/>- Well designed locations - especially for iPhone/iPad <br/>- Professional voicing and soundtrack that will make players tremble with fear! <br/><br/>Dreamland is a unique game with a great mix of hidden objects, puzzles and adventure. Step right up to the big top and don't pass it by! <br/>---------------------------------------------------------- <br/>LIKE GAMES BY NEVOSOFT? <br/>WHY NOT TRY SOME OF OUR OTHER GAMES! <br/><br/>Mysteryville: Sort out the small town's mysterious events in this classic hidden object game - made just the way it should be! <br/><br/>Pantheon: Unlock magic artifacts of ancient deities on an amazing match-3 journey through beautiful locations of the Ancient India. <br/><br/>LandGrabbers: This addictive game combines classic elements of strategy, simulator, and resource management. Nothing can stop you from conquering the world now! <br/><br/>My Kingdom for the Princess: An addictive, award-winning game with unique game play that combines time management, strategy, and simulation. <br/><br/>My Kingdom for the Princess 2: The adventures of Arthur and Princess Helen continue in this long awaited sequel to the addictive strategy, time management, simulation game <br/><br/>Supercow: super-dynamic arcade game about the adventures of a new character that deserves everyone's attention! Supercow doesn’t give milk, she just rocks!<br/>---------------------------------------------------------- <br/>THIS GAME WAS PUBLISHED BY NEVOSOFT. <br/>If you want to successfully release your game on the App Store, write us at publishing@nevosoft.com. <br/>Our experts perform the following services: <br/>- Producing your game in the final stages of development <br/>- Localizing it into more than 10 languages <br/>- Preparing your game for release (and the release itself) <br/>- Marketing (We have a loyal client base of over a million users) <br/>- Promoting your game in various media <br/>- Providing quality customer support", "metacritic": null, "released": "2011-10-27", "tba": false, "updated": "2019-10-22T13:53:11", "background_image": "https://media.rawg.io/media/screenshots/578/5784277aea2eb50ae08c8375c5f4ab99.jpg", "website": "http://iphone.nevosoft.com/games/dreamland/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 260, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Nevosoft"], "genres": ["Adventure", "Puzzle"], "publishers": ["Nevosoft"], "esrb_rating": "Everyone 10+"}