{"id": 246919, "slug": "magic-academy-hd-lite-puzzle-adventure-game", "name": "Magic Academy HD Lite: puzzle adventure game", "name_original": "Magic Academy HD Lite: puzzle adventure game", "description": "At last the much anticipated prequel to Magic Academy can be yours! The game takes us back to the very beginning of this incredible story...<br/><br/>It was a number of years before the events in the Tirisfal Fortress. It was a time when Annie and her sister Irene were still very young, when an unbelievable event took place -- Annie disappeared, and not just anywhere, but in the Magic Academy! What happened between the walls of the buidling, who's to blame for the girl's disappearance, where is she now, and what great secret is hidden in the Academy's dark hallways? Only Irene is capable of finding the answer to these complicated questions!<br/><br/>Features:<br/>- An unpredictable plotline: it's impossible to guess what will happen next<br/>- Dynamic gameplay: great combination of hidden objects and adventure<br/>- A myriad of puzzles and mini-games<br/>- An option to get hints for completing the level faster<br/>- Magnificent musical background<br/>- Magical characters and excellent graphics create the uniquely mysterious atmosphere of the Magic Academy<br/><br/>Will Irene manage to complete all the tasks? Only true magicians are capable of uncovering the secrets of the Magic Academy!<br/>---------------------------------------------------------- <br/>LIKE GAMES BY NEVOSOFT? <br/>WHY NOT TRY SOME OF OUR OTHER GAMES! <br/><br/>Magic Academy 2: fascinating adventure game that mixes hidden object hunts with mini-games and sorcery. <br/><br/>Mysteryville: Sort out the small town's mysterious events in this classic hidden object game - made just the way it should be! <br/><br/>Million Dollar Quest: Solve the mystery from main hero’s childhood, travel the world and win one million dollars in the unique mixture of hidden object, puzzle and adventure genres! <br/><br/>Pioneer lands: an addictive combination of business simulation and strategy set on the frontier of America's Old West! A true Western casual game! <br/><br/>Supercow: super-dynamic arcade game about the adventures of a new character that deserves everyone's attention! Supercow doesn’t give milk, she just rocks! <br/>--------------------------------------------------------- <br/>THIS GAME WAS PUBLISHED BY NEVOSOFT. <br/>If you want to successfully release your game on the App Store, write us at publishing@nevosoft.com. <br/>Our experts perform the following services: <br/>- Producing your game in the final stages of development <br/>- Localizing it into more than 10 languages <br/>- Preparing your game for release (and the release itself) <br/>- Marketing (We have a loyal client base of over a million users) <br/>- Promoting your game in various media <br/>- Providing quality customer support. <br/>--------------------------------------------------------- <br/>Get the inside scoop on Nevosoft Games: <br/>Join us on Facebook: www.facebook.com/Nevosoft <br/>Follow us on Twitter: http://twitter.com/NevosoftGames <br/>Watch us on YouTube: http://www.youtube.com/NevosoftCOM <br/>Visit our site: http://www.iphone.nevosoft.com", "metacritic": null, "released": "2011-10-13", "tba": false, "updated": "2019-10-22T14:13:53", "background_image": "https://media.rawg.io/media/screenshots/8f8/8f80bffdffd802880f17a8779da5c783_msa5E1z.jpg", "website": "http://iphone.nevosoft.com/games/magic-academy-1", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 194, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Nevosoft"], "genres": ["Adventure", "Puzzle"], "publishers": ["Nevosoft"], "esrb_rating": "Everyone 10+"}