{"id": 246926, "slug": "mushroom-age-lite", "name": "Mushroom Age Lite", "name_original": "Mushroom Age Lite", "description": "Tom, young scientist who works in a super secret laboratory, suddenly went missing just before his wedding. When Vera, his fiancee, starts to search for him, it never occurs to her that she’s about to embark on a trip through the ages! Her journey will take her to the Jurassic period, the Stone Age, ancient Greece, and the distant future where the world is ruled by gigantic intelligent mushrooms.<br/><br/>Mushroom Age is a gripping hidden object puzzle adventure game with an original and humorous story line, sharp bright graphics, and unimaginable characters. You’ll help a dinosaur with a bad tooth, find an absolute truth with Socrates, teach a cave man how to make fire, have Nostradamus predict your future and save the world from total destruction.<br/><br/>Features:<br/>- Breathtaking story line with spectacular characters<br/>- Unbelievable locations from the Jurassic period to the year 100,000,000 A.D.!<br/>- Puzzles and mini-games from Socrates, Nostradamus, and the Omniscient One.<br/><br/>Try the game for free! Use In-App Purchase to upgrade the game and unlock the full adventure to: <br/>- Get more than 70 levels in 18 chapters<br/>- Travel in Time and Space<br/>- Meet the Über-Mushroom!<br/>- Save Tom<br/> <br/>This game will change your impression of hidden object puzzle adventure games forever! Get ready to embark on an amazing time travel adventure to save your true love!<br/>---------------------------------------------------------- <br/>LIKE GAMES BY NEVOSOFT? <br/>WHY NOT TRY SOME OF OUR OTHER Mac OS GAMES! <br/><br/>Paradise Beach: design, build and manage some of the world's leading beach resorts in an addictive, tycoon-style, click management game. <br/><br/>Paradise Beach 2: Around the World is an improved sequel of the reknown tycoon-style click management game where you build and manage of the world's leading beach resorts. <br/><br/>Laura Jones and the Gates of Good and Evil: Meet amusing characters and hunt for hidden objects as you try to save the world. <br/><br/>Laura Jones and the Secret Legacy of Nikola Tesla: Test your Hidden Object skills as you race against time and the other people chasing down Tesla's invention! <br/>---------------------------------------------------------- <br/>Get the inside scoop on Nevosoft Games: <br/>Join us on Facebook: www.facebook.com/Nevosoft <br/>Follow us on Twitter: http://twitter.com/NevosoftGames <br/>Watch us on YouTube: http://www.youtube.com/NevosoftCOM <br/>Visit our site: http://mac.nevosoft.com", "metacritic": null, "released": "2012-08-16", "tba": false, "updated": "2019-10-22T14:09:18", "background_image": "https://media.rawg.io/media/screenshots/03e/03eba194ea6cd00715f347f06b302ed5.jpg", "website": "http://mac.nevosoft.com/games/mushroom-age", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 223, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS"], "developers": ["Nevosoft"], "genres": ["Adventure", "Puzzle"], "publishers": ["Nevosoft"], "esrb_rating": "Everyone 10+"}