{"id": 246917, "slug": "my-kingdom-for-the-princess-ii-hd-lite", "name": "My Kingdom for the Princess II HD Lite", "name_original": "My Kingdom for the Princess II HD Lite", "description": "The innovative mixture of click management and building simulation still works perfectly, and some new twists along with engaging mini-games ensure a pleasant experience!\" - GameZebo.com (4.5/5.0)<br/><br/>See what the excitement is all about when you try the free trial version or download the full-unlimited version of My Kingdom for the Princess 2 today!\" - Gamehouse.com<br/><br/>My Kingdom for the Princess 2 is a resource management/strategy title with loads of charm and deceptively deep gameplay.\" - 148apps.com (4/5) <br/><br/>Best Time Management/Simulator in 2010 - My Kingdom for the Princess II won the 2010 Nevosoft People’s Choice Award for best Time Management/Simulator<br/><br/>The adventures of Arthur and Princess Helen continue in this long awaited sequel to the addictive strategy, time management and simulation game. Longbeard the Dwarf kidnaps Helen, and Arthur has to embark on a long and dangerous journey to save his Princess. On his way to triumph he will have to clear the land, defend against invaders, and work with magical beings like flying cats and witches. <br/><br/>My Kingdom for the Princess 2 is an innovative mixture of click management and building simulation that still works perfectly. The sequel builds on the original formula with some new twists and captivating mini-games. The game features a whopping 60 levels on five different islands with various landscapes and a wide range of tasks, which ensure hours of enjoyable play!<br/><br/>Features: <br/>- Unique mixture of genres - time-management, strategy, and simulation<br/>- An even more quirky and entertaining storyline<br/>- New characters and obstacles<br/>- Two brand new game bonuses expand the game's tactical possibilities.<br/>- Plenty of special tasks and mini-games to keep you on your toes<br/>- Diverse achievements for excellent performance<br/><br/>True heroes are always ready for a new challenge! It's time to prove yourself worthy being a knight once again!<br/>-----------------------------------------<br/>LIKE GAMES BY NEVOSOFT? <br/>WHY NOT TRY SOME OF OUR OTHER GAMES!<br/><br/>Supercow: super-dynamic arcade game about the adventures of a new character that deserves everyone's attention! Supercow doesn’t give milk, she just rocks! <br/><br/>Magic Academy: fascinating adventure game that mixes hidden object hunts with mini-games and sorcery <br/><br/>My Kingdom for the Princess: An addictive, award-winning game with unique game play that combines time management, strategy, and simulation. <br/><br/>Dream Sleuth: Travel in the world of your dreams and save the girl in this thrilling hidden object puzzle adventure! <br/><br/>Laura Jones and the Gates of Good and Evil: Meet amusing characters and hunt for hidden objects as you try to save the world. <br/><br/>Laura Jones and the Secret Legacy of Nikola Tesla: Test your Hidden Object skills as you race against time and the other people chasing down Tesla's invention!  <br/>--------------------------------------------------------- <br/>THIS GAME WAS PUBLISHED BY NEVOSOFT. <br/>If you want to successfully release your game on the App Store, write us at publishing@nevosoft.com. <br/>Our experts perform the following services: <br/>- Producing your game in the final stages of development <br/>- Localizing it into more than 10 languages <br/>- Preparing your game for release (and the release itself) <br/>- Marketing (We have a loyal client base of over a million users) <br/>- Promoting your game in various media <br/>- Providing quality customer support. <br/>-----------------------------------------<br/>Get the inside scoop on Nevosoft Games:<br/>Join us on Facebook: www.facebook.com/Nevosoft<br/>Follow us on Twitter: http://twitter.com/NevosoftGames<br/>Watch us on YouTube: http://www.youtube.com/NevosoftCOM<br/>Visit our site: http://www.iphone.nevosoft.com", "metacritic": null, "released": "2011-01-21", "tba": false, "updated": "2019-10-22T14:13:53", "background_image": "https://media.rawg.io/media/screenshots/495/4959499e67b09824204112496594f060_iT7FUka.jpg", "website": "http://iphone.nevosoft.com/games/my-kingdom-for-the-princess-2/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 168, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Nevosoft"], "genres": ["Strategy", "Simulation"], "publishers": ["Nevosoft"], "esrb_rating": "Everyone 10+"}