{"id": 246925, "slug": "vampireville-lite-haunted-castle-adventure", "name": "Vampireville lite: haunted castle adventure", "name_original": "Vampireville lite: haunted castle adventure", "description": "After the previous house appraisers went insane while evaluating the creepy and ominous Malgrey Castle estate, Rockwell and Rockwell decided to send a young and ambitious real estate agent named Michael to appraise the property and put it up for sale. Hopefully Michael will have stronger nerves and better luck than his predecessors while navigating around the eerie castle’s weird and sinister secrets. And if he doesn’t go mad hopefully his boss, Mr. Rockwell, won’t drive him crazy. Mr. Rockwell may be frail, but the perpetually discontent old man is planning to visit the premises personally because he believes the estate may hold a secret cure for his rare disease.<br/><br/>Vampireville is a hidden object, puzzle adventure game with three-dimensional characters and dynamic, addictive gameplay. You have to open secret doors, dig through the archives, catch bats, analyze blood samples, and play golf. You’ll also learn about vampires and ghosts, and meet a young witch who will predict your future!<br/><br/>Features:<br/>- Intriguing plot<br/>- Refined graphics and blood chilling soundtrack<br/>- Colorful three-dimensional characters<br/>- Original puzzles and mini games<br/>- Interesting and humorous conversations<br/><br/>Feel the spooky atmosphere of the castle! But beware - its full of surprises!<br/>---------------------------------------------------------- <br/>LIKE GAMES BY NEVOSOFT? <br/>WHY NOT TRY SOME OF OUR OTHER GAMES! <br/><br/>Magic Academy : Magical puzzles, mystical mini-games, and the ancient secrets of the Magic Academy waiting for you! What are you waiting for? Isn't it time you experienced a little magic? <br/><br/>Magic Academy 2: fascinating adventure game that mixes hidden object hunts with mini-games and sorcery. <br/><br/>Dreamland - Are you brave enough to enter the abandoned amusement park and fight for a stolen soul? <br/><br/>Mysteryville: Sort out the small town's mysterious events in this classic hidden object game - made just the way it should be! <br/><br/>Million Dollar Quest: Solve the mystery from main hero’s childhood, travel the world and win one million dollars in the unique mixture of hidden object, puzzle and adventure genres! <br/><br/>Pioneer lands: an addictive combination of business simulation and strategy set on the frontier of America's Old West! A true Western casual game! <br/>--------------------------------------------------------- <br/>THIS GAME WAS PUBLISHED BY NEVOSOFT. <br/>If you want to successfully release your game on the App Store, write us at publishing@nevosoft.com. <br/>Our experts perform the following services: <br/>- Producing your game in the final stages of development <br/>- Localizing it into more than 10 languages <br/>- Preparing your game for release (and the release itself) <br/>- Marketing (We have a loyal client base of over a million users) <br/>- Promoting your game in various media <br/>- Providing quality customer support. <br/>--------------------------------------------------------- <br/>Get the inside scoop on Nevosoft Games: <br/>Join us on Facebook: www.facebook.com/Nevosoft <br/>Follow us on Twitter: http://twitter.com/NevosoftGames <br/>Watch us on YouTube: http://www.youtube.com/NevosoftCOM <br/>Visit our site: http://www.iphone.nevosoft.com", "metacritic": null, "released": "2012-01-26", "tba": false, "updated": "2019-10-22T14:13:53", "background_image": "https://media.rawg.io/media/screenshots/ac6/ac627e2b1853bc7fbed32c3eccbc6f4b.jpg", "website": "http://iphone.nevosoft.com/games/vampireville", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 199, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Nevosoft"], "genres": ["Adventure", "Puzzle"], "publishers": ["Nevosoft"], "esrb_rating": "Everyone 10+"}