{"id": 246935, "slug": "wonderlines-match-3-puzzle-game", "name": "Wonderlines: match-3 puzzle game", "name_original": "Wonderlines: match-3 puzzle game", "description": "Once, during an expedition to South America, a famous archaeologist found some strange hieroglyphic writings. They described rules of the sacred game, which was the main challenge for anyone who desired to become the High Priest. When he returned  to Europe he gave the writings to best video game developers, and now you too can play this ancient and mysterious game!<br/><br/>The main principle of the game practically stayed the same, only instead of just matching several stones of a single color in a line, you need to match balls to destroy them over a selection brown tiles. <br/><br/>There are three game modes in this magic kingdom: action, puzzle and Zen. The game also has a lot of different power-up like crystals, bombs, dynamites, and wildcards that will help on difficult levels.<br/><br/>Features:<br/>- Fun and relaxing gameplay<br/>- Superb backgrounds <br/>- Three game modes: puzzle, action, and Zen<br/>- 70 levels and 6 power-ups<br/>- Gentle calming music<br/><br/>This game can be challenging or relaxing means for your mind according to game which mode which you will select! Who knows, maybe someday you’ll become a High Priest.<br/>---------------------------------------------------------- <br/>LIKE GAMES BY NEVOSOFT? <br/>WHY NOT TRY SOME OF OUR OTHER GAMES! <br/><br/>Mysteryville: Sort out the small town's mysterious events in this classic hidden object game - made just the way it should be! <br/><br/>Pantheon: Unlock magic artifacts of ancient deities on an amazing match-3 journey through beautiful locations of the Ancient India. <br/><br/>LandGrabbers: This addictive game combines classic elements of strategy, simulator, and resource management. Nothing can stop you from conquering the world now! <br/><br/>My Kingdom for the Princess: An addictive, award-winning game with unique game play that combines time management, strategy, and simulation. <br/><br/>My Kingdom for the Princess 2: The adventures of Arthur and Princess Helen continue in this long awaited sequel to the addictive strategy, time management, simulation game <br/><br/>Supercow: super-dynamic arcade game about the adventures of a new character that deserves everyone's attention! Supercow doesn’t give milk, she just rocks! <br/>---------------------------------------------------------- <br/>THIS GAME WAS PUBLISHED BY NEVOSOFT. <br/>If you want to successfully release your game on the App Store, write us at publishing@nevosoft.com. <br/>Our experts perform the following services: <br/>- Producing your game in the final stages of development <br/>- Localizing it into more than 10 languages <br/>- Preparing your game for release (and the release itself) <br/>- Marketing (We have a loyal client base of over a million users) <br/>- Promoting your game in various media <br/>- Providing quality customer support <br/>--------------------------------------------------------- <br/>Get the inside scoop on Nevosoft Games: <br/>Join us on Facebook: www.facebook.com/Nevosoft <br/>Follow us on Twitter: http://twitter.com/NevosoftGames <br/>Watch us on YouTube: http://www.youtube.com/NevosoftCOM <br/>Visit our site: http://www.iphone.nevosoft.com", "metacritic": null, "released": "2012-09-05", "tba": false, "updated": "2019-10-22T14:13:54", "background_image": "https://media.rawg.io/media/screenshots/1d9/1d99b3fe9e1b3394027e443b98c92ebc.jpg", "website": "http://iphone.nevosoft.com/games/wonderlines", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 201, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Nevosoft"], "genres": ["Adventure", "Puzzle"], "publishers": ["Nevosoft"], "esrb_rating": "Everyone 10+"}