{"id": 247, "slug": "neon-chrome", "name": "Neon Chrome", "name_original": "Neon Chrome", "description": "<p>Neon Chrome is a cyberpunk top-down shooter with rogue-like elements developed by 10tons.</p>\n<h3>Plot</h3>\n<p>In a distant future, where human morality is at an all-time low. Major technological advancements happen, such as the perfection of cloning technology. This allowed for creating remote-controlled human clones. These clones are used in many aspects of everyday life. Several individuals that got fed up with the current oppressive government use the clones in order to kill the Overseer, who got holed up in his office in the building of a global corporation. Take control of the clones and eliminate the oppressor.</p>\n<h3>Gameplay</h3>\n<p>The levels of Neon Chrome are procedurally generated. The developers created an advanced physics model that allows for the environments to be completely destructible. </p>\n<p>If you die at some point in the game, you will have to start all over again. This makes the path to the Overseer a completely different experience every time you start over. </p>\n<p>There are many guns and cybernetic augmentations available to the players in the game. It is also possible to upgrade your character. At the beginning of the game, the players choose one of three roles to play. All three of them suit the cyberpunk universe of the game where giant corporations take over governments. </p>\n<p>The game comes bundled with a map and mod editor which allows for creating completely new experiences and sharing them with the game&#39;s community.</p>", "metacritic": 74, "released": "2016-04-25", "tba": false, "updated": "2024-01-07T04:11:01", "background_image": "https://media.rawg.io/media/screenshots/4cb/4cbbe312e35374b4dfdbdab98887d447.jpeg", "website": "http://www.neonchromegame.com", "rating": 2.93, "rating_top": 3, "added_by_status": {"yet": 81, "owned": 1317, "beaten": 29, "toplay": 6, "dropped": 61, "playing": 5}, "playtime": 3, "achievements_count": 84, "ratings_count": 148, "suggestions_count": 441, "game_series_count": 0, "reviews_count": 150, "platforms": ["Xbox One", "Nintendo Switch", "PS Vita", "PlayStation 4", "PC", "Linux", "macOS", "iOS", "Android"], "developers": ["10tons"], "genres": ["Action", "Shooter", "Adventure", "RPG", "Indie"], "publishers": ["10tons"], "esrb_rating": null}