{"id": 247088, "slug": "fruit-link-legends-story", "name": "Fruit Link Legends Story", "name_original": "Fruit Link Legends Story", "description": "The game Dragon Monster Link is very cute, this cute animals game is a puzzle game line match, should play very interesting. Colorful fruit style manga and bright's touch pop the little dragon. This amazing link game is the most challenging games in the training speed and reaction. Need to play dragont by connect line match dragon and achieve the target score before time runs out. For fans of the game style link or line and fruit matching. The cute monster that splash this game is a legend of puzzles, casual games for everyone of all ages. For toddlers, children before school age. There will be more to promote learning. With colorful interesting of charm dragon and piano music cool. Using mobile phones and tablet on learning of the children.<br/><br/>Fruit Property<br/>- Adventure with charm dragon in farm more than 99 level.<br/>- Delicious charm dragon beautiful visual image very cool.<br/>- Fun and easy to learn, difficult in a higher level.<br/>- Special charm dragon can cut the fruit both rows like fruit ninja and get the score increases.<br/><br/>How to play<br/>- Drag the charm dragon, connect the charm dragon  three or more to clear charm dragon blast and earn points.<br/>- Score points exceeded the target to levels more difficult.<br/>- To eliminate the more charm dragon can quickly get the special charm dragon. <br/><br/>For teenagers girls boys and adults that connect a line of colorful charm dragon , And solve the difficulty level in each level in the farm supply adventure and puzzle charm dragon in the legend.", "metacritic": null, "released": "2016-12-01", "tba": false, "updated": "2019-10-22T14:14:00", "background_image": "https://media.rawg.io/media/screenshots/dbf/dbf015939ee26afa369f36c3b827de1f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 42, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["NAREE ANANEUA"], "genres": ["Arcade", "Puzzle"], "publishers": ["NAREE ANANEUA"], "esrb_rating": "Everyone 10+"}