{"id": 247149, "slug": "wordigo-lite", "name": "Wordigo Lite", "name_original": "Wordigo Lite", "description": "Wordigo is a great choice to round out any puzzler’s collection… Wordigo is a super challenging word builder with a high level of replayability… Overall, we enjoyed the gameplay experience as it feels like a good fit for the iPhone OS.  Wordigo gets our AppSmile 5-Dimple rating\" - From Appsmile.com review<br/> <br/>“Wordigo is the most challenging word game that I have ever come across.  Wordigo is a word game that can really make the little hamster in one's brain run the wheel to the point of creating smoke.”  - Keri Honea Dallas iPhone Games Examiner<br/><br/>\"This is the best new board word game that I have seen in years.\"  - John McCallion, GAMES Magazine (from the 2004 GAMES 100 Buyers Guide).<br/> <br/><br/>Challenge yourself to a crossword-style word game like no other.   <br/><br/>Wordigo’s quick pace – only 7 minutes a game – keeps you on your toes as you race to complete all the paths AND achieve a high score before time runs out.  Or, turn the timer off and make completing all the paths on one of the 8 boards the challenge. <br/><br/>Winner of numerous awards, including a GAMES Magazine top 100 for the board game version, the apps version takes Wordigo to a whole new dynamic level of play.   <br/>You’ll never view vowels the same way again as the uniquely marked vowels with arrows and multipliers, provides a refreshing new tactic for word game lovers.  Strive for high scores by strategically placing the vowel tiles adjacent to consonants – see screen shots below.   <br/><br/>For an easier challenge, start on Board 1 or 2.  When you are ready for a bigger challenge, move on to one of the other six boards with either more paths, longer paths or more complex connections.   <br/><br/>TO PLAY <br/><br/>Select the available board.  The letter rack will fill with eight letter tiles and the 7 minute timer will begin. <br/>Begin by forming a word at Path 1. <br/>Once you complete your word, press SUBMIT for validation, and go on to Path 2.<br/>Continue on, completing the paths in order, working your way to the final path before time runs out.<br/>Complete all the paths and receive 20 – 60 bonus points, depending on the board.<br/> <br/>At a loss to make a word?   Tiles may be discarded at will.  But beware…discard too many tiles and there will not be enough letters remaining to complete the board.", "metacritic": null, "released": "2009-12-16", "tba": false, "updated": "2019-10-22T14:14:02", "background_image": "https://media.rawg.io/media/screenshots/4af/4af484da23c861a5665f308857579928.jpg", "website": "http://www.wordigo.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 111, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Michael Gilbert"], "genres": ["Puzzle"], "publishers": ["Michael Gilbert"], "esrb_rating": "Everyone 10+"}