{"id": 247115, "slug": "bubble-mags-no-ads", "name": "Bubble Mags - no ads", "name_original": "Bubble Mags - no ads", "description": "*** The perfect way to waste some time!<br/><br/>The physics simulation really makes the bubbles come alive, and it's super easy to start playing. Just tap the screen in the direction you want the bubble to move and aim for two or more bubbles of the same color. The more bubbles you shoot at the same time, the higher score you get.<br/><br/>Features:<br/>* Three game modes; Normal, Stress and Clean<br/>* Four difficulty levels - Easy enough for everybody to play, though enough to give everybody a challenge<br/>* Six different bubblestyles<br/>* True physics simulation makes the bubbles come alive<br/><br/><br/>How to play:<br/>In normal mode you have all the time you want. Aim carefully, and make those bubbles pop. After a number of faults (shooting without making bubbles explode) a new row of bubbles will appear. The remaining numbers of faults will be shown as small white dots at the bottom of the screen. If you manage to clean all bubbles, you will be awarded a bonus score and get to the next level. The game ends if a bubble gets to the lowest row.<br/><br/>In stress mode you need to be fast. Keep popping bubbles rapidly to keep the timer from becoming empty. If it becomes empty, a new row of bubbles will appear.<br/><br/>In clean mode there is no bubbles to shoot. You must touch the bubbles (groups of two or more) to make them pop. It might sound easy, but watch your popping, or else you will end up with only one bubble of one of the colors.", "metacritic": null, "released": "2011-11-27", "tba": false, "updated": "2019-10-22T14:14:01", "background_image": "https://media.rawg.io/media/screenshots/e1f/e1f8e46f77cc3e4f7d739c07b1017054.jpg", "website": "http://kimbobbyproductions.weebly.com/bubble-mags.html", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 88, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Kim Bobby Productions"], "genres": ["Arcade", "Casual", "Puzzle"], "publishers": ["Roy Hamm"], "esrb_rating": null}