{"id": 24719, "slug": "di-gata-defenders", "name": "Di-Gata Defenders", "name_original": "Di-Gata Defenders", "description": "<p>\n      With the help of powerful Guardians these young heroes fight to control \n      the destiny of the four pure stones. They are the last line of \n      protection between the good people of Rados and the villains who seek to \n      rule them. Lord Nazmul has found a new way to release the Megalith \n      trapped by the four pure stones. He plans to build a gigantic machine to \n      concentrate pure cosmic energy in order to destroy the pure stones. You \n      must help the hard-hitting heroes prevent the execution of this evil \n      plan by creating your own character and exploring the world of Rados! \n      For the fans, the game is an extension of their favourite show. For the \n      expert, this game allows them to test their strategic abilities.\n    </p><p>\n</p><p>\n      Play and interact with the characters from the show Seth, Melosa, Erik, \n      Kara, Adam, Lord Nazmul, Brackus, Flinch and Malco. The Di-Gata game for \n      Nintendo DS takes players on a fantasy quest that challenges them and \n      calls on their skills, speed and strategic abilities. Take part in this \n      action-packed adventure and get ready to CAST THE POWER!\n    </p><p>\n      Features\n    </p><p>\n      • Create your very own Di-Gata Defender and improve your skills and HP<br/>• \n      Unlock new abilities with powerful stones and build your own strategies \n      and kits<br/>• Explore 3 provinces of Rados World and visit villages, \n      towns, caves, towers and much more<br/>• Talk, battle and trade with the \n      characters you encounter along the way<br/>• Unlock numerous side quests \n      by talking with the characters you meet in the villages and buy or sell \n      cards and stones to help you advance in the game<br/>• Participate in \n      challenging multiplayer battles with your friends\n    </p>", "metacritic": null, "released": "2008-09-15", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["Nintendo DS"], "developers": [], "genres": [], "publishers": ["The American Game Factory"], "esrb_rating": null}