{"id": 24713, "slug": "bomberman-blast", "name": "Bomberman Blast", "name_original": "Bomberman Blast", "description": "<p>\n      Look out for Bomberman Blast! There's 8-person online multiplayer \n      and you can even use your Mii as a Bomberman! \n    </p><p>\n      A brand new addition to the Bomberman series is available on WiiWare! Up \n      to eight players can battle online simultaneously via Nintendo Wi-Fi \n      Connection! Simple controls make this a great game for family and \n      friends to enjoy at anytime! New items can be triggered by shaking the \n      Wii Remote controller for excitement never before experienced in a \n      Bomberman title! You can even take the intensity up another notch by \n      adding your own Mii caricatures to the mix! Battle results can be \n      recorded on Nintendo Wi-Fi Connection Ranking, so see how you stack up \n      against others around the globe! This title will prove to be a blast for \n      everyone--from those who've never touched a Bomberman game, to the \n      Bomberman masters!\n    </p><p>\n      As of May 20, 2014, the Nintendo Wi-Fi Connection service for Nintendo \n      DSi and Wii systems has been retired. Online features of this game are \n      no longer available after this date but this game still provides an \n      entertaining experience in offline mode.\n    </p><p>\n      To learn more about this service change, please visit To learn more \n      about this service change, please visit support.nintendo.com/servicesupdate.\n    </p>", "metacritic": null, "released": "2008-09-29", "tba": false, "updated": "2019-09-12T06:38:14", "background_image": "https://media.rawg.io/media/screenshots/72f/72f127bcab920402eecf2909cf7ed8dc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 5, "beaten": 2, "toplay": 3, "dropped": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 407, "game_series_count": 0, "reviews_count": 0, "platforms": ["Wii"], "developers": [], "genres": [], "publishers": ["HUDSON SOFT"], "esrb_rating": null}