{"id": 247153, "slug": "boxoff", "name": "BoxOff", "name_original": "BoxOff", "description": "BoxOff - A new and exciting solitaire puzzle that will keep you busy for hours on end.  <br/><br/>BoxOff was featured on the cover of Games Magazine (August 2013)<br/><br/>BoxOff is a unique puzzle, created by Steven Meyers.  The objective is simple,  remove all the stones from the board. Sounds easy right? Once you advance into the higher levels you'll be amazed as to how difficult such a simple task becomes. <br/><br/>Play consists of making a series of \"moves\", where each move consists of removing a single pair of same colored stones from the board.  A pair may only be removed if it occupies a rectangle of squares containing no other stones.  Usually at the start, the only possible kind of move is to remove a pair of adjacent same colored stones, which can be thought of as occupying a (1x2) rectangle of squares.  As more and more board squares become empty, the number of choices of possible moves grows.  Your choice of moves will be critical, one bad turn and you're liable to end up at a dead-end where no further stones can be removed.<br/><br/>Several variations are included that will provide more challenges:<br/><br/>Area Mode - In addition to clearing all the stones off the board, you will need to find the pairs that offer the highest number of squares within the rectangle area.  It's possible to clear the board but not complete the level. <br/><br/>Stacks - In this mode, squares can have several stones stacked on top of one another.  With Stacks there's a new element of depth to consider.", "metacritic": null, "released": "2014-05-15", "tba": false, "updated": "2019-10-22T14:14:03", "background_image": "https://media.rawg.io/media/screenshots/95c/95c0ad9794c4aa7e3cc90e369564738b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 70, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Michael Gilbert"], "genres": ["Board Games", "Puzzle"], "publishers": ["Michael Gilbert"], "esrb_rating": null}