{"id": 247271, "slug": "biba-butterfly-bounty", "name": "Biba Butterfly Bounty", "name_original": "Biba Butterfly Bounty", "description": "Biba Butterfly Bounty is part of a fun collection of free games built for parents to play with their kids on the playground! Biba games turn screen-time on its head, encouraging social and imaginative gameplay that get kids physically active and OFF the couch!<br/><br/>Each Biba game presents an imaginative game premise that gets kids naturally active. In Biba Butterfly Bounty kids join BigBot on a scavenger hunt through a magical forest, seeking out the rare and magical Golden Butterfly! <br/><br/>In this fully interactive and inclusive experience, kids get to scan the playground AR tags using the phone as a virtual magnifying glass, trying to befriend and collect new butterflies in their virtual butterfly jar! And Butterfly Bounty is designed to work with Unlimited Play locations that feature inclusive playground equipment and layouts for those with physical disabilities!<br/><br/><br/>HELPING BALANCE SCREEN TIME<br/>We know that balancing screen-time can be tough! That's why Biba games seek to use screens to get parents and kids engaging in outdoor and active experiences on their local playground. No sitting around staring at screens, in Biba games, kids ARE the avatars!<br/><br/>EASY TO PLAY<br/>Biba games are simple to play and designed to re-imagine play for children, breaking kids away from sedentary video game experiences and getting them outside where the real fun happens.<br/><br/>DRIVING KID’S IMAGINATIONS<br/>A whole new category of imagination-driven games that bring back the basic joy of play, blending digital interaction with the real world physical activity that kids need!<br/><br/>TOTALLY FREE &amp; PRIVATE<br/>We here at Biba are parents too, which means all of our games are not only free forever, but they respect your privacy, complying with COPPA/PIPEDA privacy legislation at every turn.<br/><br/>ACTIVE AND OUTDOOR<br/>Biba games are intended specifically to get kids participating in what the World Health Organization refers to as “moderate-to-vigorous physical activity”--games that elevate heart rate and encourage consistent movement.<br/><br/><br/>And don’t forget - Biba games are often wacky and unconventional, so for the best experience, please remember to agree to camera and microphone permissions when asked for!<br/><br/>Visit www.playbiba.com for more!", "metacritic": null, "released": "2016-10-24", "tba": false, "updated": "2019-10-22T14:14:08", "background_image": "https://media.rawg.io/media/screenshots/830/830cb3789e824c95c12deeb827140527.jpg", "website": "http://www.playbiba.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 161, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Biba Ventures"], "genres": ["Family"], "publishers": ["Biba Ventures"], "esrb_rating": "Everyone 10+"}