{"id": 247328, "slug": "starters-orders-4-horse-racing-jumps-edition", "name": "Starters Orders 4 Horse Racing (jumps edition)", "name_original": "Starters Orders 4 Horse Racing (jumps edition)", "description": "The No.1. Horse racing management game finally comes to the iPad!<br/><br/>*** STOP PRESS - APP OF THE DAY on Pocket-Lint.com (2nd June 2011) \"both editions (of Starters Orders 4) are superb, in-depth management simulations, the like of which rare on the casual gaming-heavy App Store\" ***<br/><br/>Train, own, race, breed and bet on your own string of race horses. Target all the big world-wide races in an open ended, unlimited play game world. Flat and Jumps racing editions available.<br/><br/>UK and Irish Jump game modes,<br/><br/>Starters Orders 4 has long been the No.1. PC horse racing management game and has recieved rave reviews from both the racing and gaming press (PC reviews):<br/><br/>\"Where Starters Orders scores over other racing games past and present is in the level of accuracy in the underlying game world.\" - RACING POST.<br/><br/>\"It's hard to find fault with Starters Orders 4 and Strategic Designs deserve racing fans' support for developing such an excellent game.\" - RACING AHEAD (monthly horse racing magazine).<br/><br/>\"If the prospect of raising and racing a cavalcade of horses interests you then Starters Orders 4 wins the roses!\" - OUT OF EIGHT GAMES REVIEWS.<br/><br/>\"A photo-finish at a big purse meet can get you screaming at your monitor every bit as much as watching the Grand National on TV!\" - IT REVIEWS.<br/><br/><br/>Just a few STARTERS ORDERS 4 FEATURES:<br/><br/>*Play in a vast horse racing world with thousands of horses and hundreds of computer controlled Jockeys and Trainers.<br/><br/>*Relatic races and Jockey AI. Watch as the jockeys settle their mounts and jockey for position before driving their horses for the finish.<br/><br/>*Relaistic betting and dynamic odds with Ante-post and racecourse betting.<br/><br/>*Fields of up to 30 runners.<br/><br/>*Hundreds of realistic feature races to target including the Grand National, Cheltenham gold cup and many, many more.<br/><br/>*Improve your stable by purchasing add-ons and evaluate your horses by running them on your home gallops.<br/><br/>*Realistic races including Maidens, Claimers, Sellers, Handicaps, Group races, Listed races etc.<br/><br/>*Hundreds of world-wide race courses.<br/><br/>*Realistic form analysis with in-depth form book to study and realistic race cards on race day.<br/><br/>*Fallers, Unseated riders, Injuries, stewards enquiries, disqualifications, non-triers etc. etc.", "metacritic": null, "released": "2011-03-16", "tba": false, "updated": "2019-10-22T13:53:02", "background_image": "https://media.rawg.io/media/screenshots/471/4718a78bded1595771f772792cab6c8e_oLyyjbK.jpg", "website": "http://www.startersorders.com/ios/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 167, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Strategic Designs"], "genres": ["Strategy", "Sports"], "publishers": ["Strategic Designs"], "esrb_rating": "Teen"}