{"id": 24748, "slug": "the-monkey-king-the-legend-begins", "name": "The Monkey King: The Legend Begins", "name_original": "The Monkey King: The Legend Begins", "description": "<p>\n      THE LEGEND BEGINS! GO ON A FANTASTIC JOURNEY THROUGH ANCIENT CHINA AS \n      THE LEGENDARY MONKEY KING. DEADLY FORCES HAVE INVADED THE HEAVENLY \n      KINGDOM AND IT IS UP TO YOU TO PROTECT THIS LAND AS YOU FIGHT YOU’RE WAY \n      TO BECOMING A GOD! FLY ON YOUR MAGICAL CLOUD AND DEFEAT THE HORDES OF \n      ENEMIES THAT COME YOUR WAY ON YOUR QUEST TO FULFILL YOUR DESTINY AS THE \n      CHUKA TAISEN!\n    </p><p>\n      An arcade classic reinvented for the Nintendo Wii system. Utilizing the \n      controls of the Nintendo Wii, you can literally dodge your attackers and \n      take control of the action! With beautiful graphics that depicts the \n      beauty of ancient China from which this story came, users will be able \n      to fly in the shoes of the legendary Monkey King and relive the tale for \n      which he became famous.\n    </p><p>\n</p><ul>\n<li>\n        New Gameplay Mechanic– The series adopts a new tilt control feature \n        that lets you control the pace of the gameplay, allowing players to \n        dodge and move in a way never seen before.\n      </li>\n<li>\n        Multiplayer Fun – A two player co-op mode adds fun for you and your \n        friend including several different modes of play.\n      </li>\n<li>\n        Classic Story – A classic tale fit for all ages and races. Learn the \n        origins of the Monkey King and his conquest to becoming a God.\n      </li>\n</ul>", "metacritic": null, "released": "2008-05-27", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["Wii"], "developers": [], "genres": [], "publishers": ["UFO Interactive Games"], "esrb_rating": null}