{"id": 247472, "slug": "3d-ballin-classic-free", "name": "3D Ballin Classic Free", "name_original": "3D Ballin Classic Free", "description": "Quite cool and awesome 3D game! <br/>Hold your device tight while playing 3D Ballin, or you may miss your favorite device! <br/><br/>Just handle your device, tilt, flip, snap as you want. Then the plates in the screen will move exactly the same as your device does and the balls on the plates will rock and roll. <br/><br/>Put the balls in the halls of plates by several simple rules. <br/>- All balls except 'X' balls must pass through plate-color halls. Avoid black halls. <br/>- Numbered balls must keep the order. Lower first, higher last. <br/>- 'O' balls can go anytime, while 'X' balls should never go. <br/>- Finish it as quickly as you can. There are maximum 3 golden balls award per stage for your achievement. <br/><br/>Captured images below show the rules. Here are some tips.<br/>- O/X : Only 'O' balls. <br/>- 1/2/3: Keep the number order. <br/>- Broken plates: Should jump and move around to reach right halls. <br/>- Items: Changing ball size, control directions, restitution, blinking, etc. <br/><br/>In this version, you get 12 stages for free. Enjoy it! Try to get all golden balls for all stages.<br/><br/>If you feel funny and want more stages, consider purchasing $0.99 version of '3D Ballin Classic' with 96 fun full challenging stages. It deserves!", "metacritic": null, "released": "2012-07-21", "tba": false, "updated": "2019-10-22T14:11:53", "background_image": "https://media.rawg.io/media/screenshots/29b/29bf400bea7722e5863b8123dc6964d9.jpg", "website": "http://www.youtube.com/watch?v=ftZEscSiQDc", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 55, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Rev. Soft"], "genres": ["Simulation", "Puzzle"], "publishers": ["LEE DUCK"], "esrb_rating": "Everyone 10+"}