{"id": 247549, "slug": "pro-football-2017-game-3d-head-soccer-games-17", "name": "pro football 2017 game - 3d head soccer games 17", "name_original": "pro football 2017 game - 3d head soccer games 17", "description": "Are you a football maniac? Do you have football frenzy? If yes, Best Real Speed Pro football 2016 will keep you engrossed and entertained. This well crafted 3d football game is a great app which you keep your friends occupied on their fingertips for hours!!<br/><br/>Presently, the best football game is available with two teams: Italy and Germany…but worry not, soon some more teams will be added from all the 5 continent Europe, Australia, South and North America, Asia, and Africa like France, UK England, Japan, United States of America (USA), Canada, Brazil, Portugal, Spain, Mexico, Russia, China, Switzerland, Belgium, Korea, Netherland, Algeria, Morocco, Egypt, Nigeria, South Africa, Cameroun, Ivory Coast, Saudi Arabia, Kuwait, United Arab Emirates, Qatar, Argentina, Chili, Paraguay, Thailand, Iran, Irak, Uruguay, etc. This is not the end of the list for Crazy football 2016 fans like you, big football clubs like Real Madrid, FC Barcelona, Manchester United, Chelsea, Bayern Munich, Paris saint Germain, Atletico de Madrid, AC Milan, Juventus, Inter Milan, Raja Casablanca, Ahli, Zamalek, Guangzhou Yiyao will soon be available at your fingertips.<br/><br/>Have you ever dreamed to Play football Real football 2016 game with Messi, Ronaldo, Suarez, Iniesta, Lahm, Bale, Xavier, Ronaldinho, Neymar, Sanchez, Rodriguez, Muller, Kahn, Ribery, Puyol, and the old best players too like Maradonna, Pele, Figo, Zidane, Bekham, Tevez, Batistuta, Buffon, and many other football good players? this best football game will allow fulfilling your dream in reality; with this app downloaded on your ios devices, you will be able to play and enjoy virtually 3d football league 2016 at your fingertips.<br/><br/>Loaded with 3d and HD graphics and lively animations, this best football game is an awesome example of super football app game and you will surely love it.<br/><br/>How to play:<br/><br/>You will have here a special button How to play, it will explain you the use the joystick and about the pass and shoot button to play…..<br/><br/>You have to manipulate the football 2016 football players with joystick, use pass button for passing or taking over the ball from the other team players, and shoot button to shoot for making prodigal goals as Messi does in real performance!<br/><br/>The features of the app:<br/><br/>•\tA 3d football game for young and adults: you will surely enjoy this crazy 3d football game play on your iOS device,<br/>•\tVivacious animation, awesome HD graphics, and realistic game play will keep you enthralled,<br/>entertaining sound effect is an extra attraction,<br/>•\tYou can play this football 2016 game without Internet connection, you just have to download it and enjoy.<br/>•\tCompatible with all the iOS 6.0 devices<br/>•\tThe game is really addictive: it will keep you engaged for long time!<br/><br/>Download the game now and start enjoying this super football 2016 game! You will find it worth playing for entertaining your football mania.", "metacritic": null, "released": "2015-12-19", "tba": false, "updated": "2019-10-22T14:11:56", "background_image": "https://media.rawg.io/media/screenshots/e20/e20831c671fe5bc2a3bff46702ca84d3.jpg", "website": "https://www.youtube.com/watch?v=lqsf7GellIk", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 100, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Mustapha EL BOUKHARI"], "genres": ["Sports"], "publishers": ["Mustapha EL BOUKHARI"], "esrb_rating": "Everyone 10+"}