{"id": 247507, "slug": "candy-donkey-bubble-shooter-king-free-puzzle-games", "name": "Candy Donkey Bubble Shooter king free puzzle games", "name_original": "Candy Donkey Bubble Shooter king free puzzle games", "description": "This version is on promotion for a month, you can play the bubble classic game with no limited Gems, so you can unlock all the levels without buying anything<br/><br/>Welcome to this sweet bubble world where you can play unlimited with your bubble frenzy! A new bubble archery game is now available at your fingertips and here we have kept the name of this new bubble family member as sweet puzzle game Candy Donkey Bubble Shooter 2016.<br/>This sweet bubble shoot game is simple to play but it is indeed complex to map the best bubble shooting adventure, where you will be able to shoot maximum number of bubble burst at minimum movement. It is cool unlimited yet it is super addictive that hardly you can spare the game to get played by your kids and other family members!<br/><br/>How to play this sweet bubble boom game: <br/>This shoot bubble frenzy deluxe game will offer you simple but exciting game plan. You have to shoot the bubbles at least three of same color and shape! More the merrier is the simple game plan of this Candy Donkey Bubble Shooter 2016 app. You have to shoot as maximum number ofthe best bubble boom donkeys and get the level be over by the minimum shots. Indeed the game is super simple to play but it is really hard to master. The juxtaposition of simple and tough dynamics of this bubble blaze is the prime USP of this bubble shooting adventure game.<br/><br/>You can set off the bubble blaze sound and music, see how to play with the small menu at the bottom left of the game screen.<br/><br/>Before you start playing with this free bubble pop game on your ios screen and tablet, take a look at its rocking features. We can bait that you will love this sweet puzzle game bubble frenzy game as much as your kids will love playing this.<br/><br/>Check out this amazing puzzle game and bubble shoot features :<br/>• There are more than 55 levels to play the game Candy Donkey Bubble Shooter 2016: it is a super rocking pass time game you can play on your ios device,<br/>• Bright and vibrant user interface: it is enormously easy to cognize the bubble blaze,<br/>• Enjoy the awesome sound effect: it will keep your energy level always up,<br/>• The bubble pop app is built with lively animation, awesome graphics, and stunning colors: your bubble shooting adventure will be exciting unlimited always with new algorithm<br/>Difficulty level will increase as you climb up the level of bubble burst: enjoy the bubble shoot frenzy marbledroid and score bagful, <br/><br/>• You can chase the highest score: engage yourself against challenge and advance your puzzle game donkeys bubble archery skill.<br/>Enjoy the Bubble go on your ios device now and start blasting bubble pop at your fingertips. Enjoy puzzle game the bubble blaze mania with your friends and have fun unlimited!<br/><br/><br/>Bubble donkey shooter blast games are all-time hits because of their ageless appeal and unlimited fun-packed colorful game plan.<br/><br/>These funny bubble shoot games are wonderful source of entertainment, kids and adults both love this Sweet bubble puzzle games for their simple but exciting bubble adventure game play algorithm. The free bubble epic ios app,Bubble donkey shooter blast, is the latest bubble classic game avatar now available for play unlimited at your fingertips both on your bubble ios mobile and bubble tablet.<br/><br/>Play this amazing bubble epic app: <br/>Post download you need to play the new bubbleupnp game with all its Sweet bubble frenzy to top bubble shoot as max as possible numbers of lovely and attractive Bubble donkey shooter of different stunning colors. You need to shoot either three Bubble donkey together or more and these top Bubble donkey shooter have to be of the same color. <br/>You have to complete each level with as minimum as possible top bubble pop on screen! If you can complete a level super-fast, you are the winner and you will get to play in the next level. If you fail to complete the new bubble shooting game within stipulated action frame, you have to play the new bubble pop shooter game again on the same level where you are stuck.", "metacritic": null, "released": "2015-11-27", "tba": false, "updated": "2019-10-22T14:11:54", "background_image": "https://media.rawg.io/media/screenshots/f0d/f0df2c2e7fbd9430e51d6a782e4e63cb_vJHYJbN.jpg", "website": "https://www.youtube.com/watch?v=8rqJCWt2uFk", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 43, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Mustapha EL BOUKHARI"], "genres": [], "publishers": ["Mustapha EL BOUKHARI"], "esrb_rating": "Everyone 10+"}