{"id": 247551, "slug": "donjon-castle-ninja-run-2016-no-ads-version", "name": "Donjon Castle Ninja Run 2016 - No Ads Version", "name_original": "Donjon Castle Ninja Run 2016 - No Ads Version", "description": "Ninjas are super cool, super brilliant, and relentless fighters, who does not know why to stop before reaching his goal. He is power of indomitable spirit and courage. If you love fighting and running like a Shuriken Ninja, you will find free running Samurai Ninja app irresistible and simple addictive for unlimited playing.<br/>What is unique about this game app ?<br/><br/>This incredible Ninja game is all about speed, run, and relentless fight with obstacles. Put yourself in the super-fast shoe of a cool ninja and start running to reach the goal. Put your Ninja power at tough test and prove your mettle that you are the best Ninja! You may have to fly over dangerous thorns, you may have to use ninja jumper, or can use ninja climbing skill!<br/><br/>The goal of the game is to get a faster run by slamming obstacles! Watch out for what is approaching next and respond quickly with your extra cool ninja skills.<br/><br/>Amazing Features:<br/>• Collection of the droid ninja shuriken to get the best scores on the game and share it on Facebook and twitter<br/>• The ninja have to escape all the obstacle to reach his goal and to fulfil Tons of missions<br/>• It's an addictive and unlimited ninja running game; the game difficulty level gets higher in every 45 seconds<br/>• The app free running Samurai Ninja is made with awesome 2D graphics with overwhelming sounds effect.<br/>• True ninja experience with power-ups, utilities and more<br/>• The app is super-fast paced and it is simple to play,<br/>• Both HD/SD are supported.", "metacritic": null, "released": "2015-12-05", "tba": false, "updated": "2019-10-22T14:11:56", "background_image": "https://media.rawg.io/media/screenshots/29e/29e6ca3814a5db2665f833c97f21cdbf.jpg", "website": "https://www.youtube.com/watch?v=lgIvjL3UwrY", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 101, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Mustapha EL BOUKHARI"], "genres": ["Action", "Arcade"], "publishers": ["Mustapha EL BOUKHARI"], "esrb_rating": "Everyone 10+"}