{"id": 247514, "slug": "soccer-cup-2018-games-footbal", "name": "Soccer cup 2018 games footbal", "name_original": "Soccer cup 2018 games footbal", "description": "Play the free soccer 2018 world cup Ultimate edition, you can choose between 32 soccer team, and play a friendly match, or a championship world cup, and try to beat all the best soccer stars.<br/><br/>Presently, the free soccer 2018 is available with 32 soccer team : USA, Algeria, Angola, Argentina, Austria, Bahrain, Brazil, Cameroon, China, Colombia, Denmark, Finland, France, Gabon, Germany, Greece, India, Honduras, Iran, Italy, Ivory Coast, Korea, Latvia, Mexico, Morocco, Peru, Portugal, Scotland, Slovakia, Slovenia, Russia, Togo, Ukraine, Uruguay, USA.<br/><br/>We will add more soccer teams on our upcoming updates, so stay tuned.<br/><br/>You can play with the best soccer stars like Messi, cristiano ronaldo, Suarez, Iniesta, andrea pirlo, Bale, Xavier, Ronaldinho, Neymar, buffoon, Sanchez, Rodriguez, Muller, Kahn, Ribery, Puyol, and the old best players too like Maradonna, Pele, Figo, Zidane zizou, tevez, lampard, modric, puppeteer, kahn, Bekham, Tevez, Batistuta, Buffon, fellaini and many other soccer star.<br/><br/>How to play:<br/><br/>• Choose your play soccer mode <br/>• Choose your soccer team<br/>• Use the joystick to move the soccer player<br/>• Use the button to shoot, pass, tackle, and sprint.<br/><br/>Features of this best soccer games :<br/><br/>•\treal soccer 3d for young and adult people : you will surely enjoy this real soccer 2018 on your device,<br/>•\tVivacious and drastically animation, awesome HD graphics, and realistic game play will keep you enthralled,<br/>entertaining sound effect is an extra attraction,<br/>•\tYou can play this top soccer games 2018 game without Internet connection, just download and enjoy.<br/>•\tThe best soccer games is really addictive: it will keep you engaged for long time!<br/><br/>Download your dreaming soccer app now and start enjoying this super soccer 2018 game!", "metacritic": null, "released": "2017-05-11", "tba": false, "updated": "2019-10-22T14:11:55", "background_image": "https://media.rawg.io/media/screenshots/bed/bedb89be5ac34a11f9b7a7b9c962fda4_V6BmpQJ.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 119, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Mustapha EL BOUKHARI"], "genres": [], "publishers": ["Mustapha EL BOUKHARI"], "esrb_rating": "Everyone 10+"}