{"id": 247674, "slug": "train-gunner-gunship-attack-2017", "name": "Train Gunner Gunship Attack 2017", "name_original": "Train Gunner Gunship Attack 2017", "description": "Train Gunner Attack<br/><br/><br/>3D Train Gunner Attack<br/>3D Train Gunner Attackis a FPS where you are escorting a military supply convoy across vast open territory for frontline battlefield troops. You will encounter enemy troops that will try to cut off your advance! So use your minigun and rocket propelled grenades to ward off the enemy attack and make sure the supplies reach on time! The enemy will try to stop you at all cost so they will send in whatever firepower they can find, evenhelicopter gunship gunner will try to gun you down! But will you emerge as a glorious warrior? All youhave to do is keep an eye on the oncoming soldiers and keep firing until all of your enemies are down.To complete your mission, you have to successfully eliminate all the incoming waves of enemy soldiers and helicopter gunship; and let the train reach the supply area successfully! <br/>Features 3D Train Gunner Shooting:<br/>Thrilling endless missions with fast paced first person shooting gameplay! <br/>Stunning locations; in the desert and in the mountains! <br/>Touch based and fire and forget gameplay! <br/>Life Kit, Extra missiles, Shields to protect yourself<br/>Unlimited thrilling missions <br/>Helicopter, tanks, machine guns attack <br/>This 3D Train Gunner Shooting game is for hardcore gamers who enjoy the top latest FPS, shooting, simulation games. Never before will you have found yourself being a Navy shooter PS. We work hard to ensure that our games run properly on every major android phone and tablet. If however you encounter any issue which doesn't let you enjoy our games, please report it to topactiongames@gmail.com .", "metacritic": null, "released": "2016-12-19", "tba": false, "updated": "2019-10-22T14:12:03", "background_image": "https://media.rawg.io/media/screenshots/f6d/f6d6e42fb2569083c269c24289549a1c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 230, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Sunstar Technology Group"], "genres": ["Action", "Adventure"], "publishers": ["Sunstar Technology Group"], "esrb_rating": "Teen"}