{"id": 24767, "slug": "octomania", "name": "Octomania", "name_original": "Octomania", "description": "<p>\n      It's just another day in Lonropia and Kari, an apprentice magician, \n      decides to summon up some of her favorite treat: Takoyaki! But instead \n      of delicious Takoyaki appearing, a shower of colored Ocotpi rain down \n      from the sky.\n    </p><p>\n</p><p>\n      A guardian angel appears and informs Kari that she must rid Lonropia of \n      the Octopi. Now she must embark on a journey to find the prince \n      Exaultus. Surely he will know what to do!\n    </p><p>\n</p><p>\n      Hurry up and rid your screen of Octopi before your enemy beats you to \n      it! Line up your Octopi in groups under the Octo-nets and watch them \n      disappear! Line up as as you can and create a massive chain.\n    </p><p>\n</p><p>\n      Pull off a giant chain and cripple your opponent with a nasty Sea Urchin \n      attack! Clear your screen of Octopi as quickly as you can to win the \n      game!\n    </p><p>\n</p><ul>\n<li>\n        Arcade, Multiplayer and Wi-Fi Network play modes!\n      </li>\n<li>\n        Easy to learn but fast moving puzzle-like game play!\n      </li>\n<li>\n        Cute and loveable characters like Gobu the pig and Kanizaemon, the \n        samurai crab!\n      </li>\n</ul><p>\n      As of May 20, 2014, the Nintendo Wi-Fi Connection service for Nintendo \n      DSi and Wii systems has been retired. Online features of this game are \n      no longer available after this date but this game still provides an \n      entertaining experience in offline mode.\n    </p><p>\n      To learn more about this service change, please visit To learn more \n      about this service change, please visit support.nintendo.com/servicesupdate.\n    </p>", "metacritic": null, "released": "2008-03-25", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["Wii"], "developers": [], "genres": [], "publishers": ["Conspiracy Entertainment"], "esrb_rating": null}