{"id": 247601, "slug": "my-virtual-girlfriend-ar", "name": "My Virtual Girlfriend AR", "name_original": "My Virtual Girlfriend AR", "description": "From the creators of My Virtual Girlfriend comes the first Augmented reality dating simulation game.<br/><br/>D E S C R I P T I O N:<br/>My Virtual Girlfriend AR is a fun and flirty dating simulation game like no other. Choose from an impressive assortment of virtual beauties that match your interests. There are literally thousands of beautiful girls to choose from, all with unique personalities and appearance, so you are sure to find a virtual date that appeals to you.<br/><br/>What can i do with her?<br/>Once you hook up with your new date, you can flirt it up through conversation, go on activities like mini golf or the movies, listen to her corny jokes, take specific actions with her and offer her gifts like a new bikini or cosplay outfit, she will even wear it for you. She will even respond to your touch, just be careful about where you are poking your fingers around, she can get very upset. <br/><br/>Every choice you make will have either rewards or consequences (depending on your actions) so It's best to find things that cater to your girls unique personality. As you progress with your new AR girlfriend on this wild date, she will grow to like you more and more. With each new level achieved, it will open up new ways of interacting with her, unlock crazy and fun outfits, as well as all kinds of activities that adults do- like watching Netflix and chill, or going on a dinner date! There are 35+ levels in the game, once you reach the end level, you've won her heart and achived LOVE status, and are rewarded with some interesting choices. <br/><br/>Do the right things and she’s yours forever, but make the wrong moves and this virtual hottie will show you the door, where you will remain alone until you start a new game. So if you have any game at all-  don’t be part of the lonely hearts club, download My Virtual Girlfriend AR today!<br/><br/>Features:<br/>► Augmented Reality (AR) gameplay<br/>► 1000's of beautiful girls to choose from<br/>► AR girls are adjustable in size, from tiny to giant!<br/>► Several ways to interact- through conversation, actions, activities and touch<br/>► Customize your girl. Change her face, hair, skin, clothes, bobble heads, body proportions, and more.<br/>► 35+ levels of progressive game play<br/>► Vampire and Zombie girlfriends<br/>► Simulated personalities that can mimic funny female personalities<br/>► Adult dating simulation of the virtual fun kind<br/>► Achievements and rewards <br/>► Special outfits - bikinis, hot swimwear, lingerie, and more!<br/><br/><br/>It's all about flirting, love, dating and romance. Love is in the air and with this many cute females in one place, It's like being on a Virtual spring break in Cancun! <br/><br/>Why are you still reading? This will be the cheapest date you will ever have and besides that- here is your chance to get some practice in and level up your dating game!", "metacritic": null, "released": "2018-09-21", "tba": false, "updated": "2019-07-30T13:33:09", "background_image": "https://media.rawg.io/media/screenshots/c9a/c9ad094d5be2c7c56a19264f15507025.jpg", "website": "http://www.myvirtualgirfriendgame.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 239, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Wet Productions"], "genres": ["RPG", "Simulation"], "publishers": ["WET Productions"], "esrb_rating": null}