{"id": 247652, "slug": "mom-prison-break-escape-pro", "name": "Mom Prison Break Escape Pro", "name_original": "Mom Prison Break Escape Pro", "description": "**NO ADS in this pro version**<br/><br/>Surviving and escaping prison doesn't get any intense than Mom Prison Break Escape Survival Mission, where you play as an angry single mom who is hell bent towards making her prison escape by hooks or by crooks. With police guard dogs, prison snipers and corrupt police officers at your tail, make an escape, and survive the onslaught of tough secure lockdown prison life in this survival escape mission. Stranded on merciless alcatraz prison island, avoid all the police special ops commanders, CCTV cameras and devise a strategy to make your heroic impossible prison break survival escape. You can also fight back the enemy guards and chase freedom in this mom hero escape story. <br/><br/>Equipped with police helicopters and patrol cars, prison guards will come at your with every thing that they have, including their K-9 units. They will be equipped with batons and guns, so they won't hesitate from using full lethal force as your escape the secure lockup and breakout of forest prison facility. So prove your ultimate survival skills, make your hero escape and emerge as a survivor as you escape this life of sin and corruption in this breakout 3D prison escape game.<br/><br/>Features:<br/>Intense and challenging survival game play<br/>Intuitive controls and combat system<br/>Top notch visuals and graphics<br/>Several escape missions to complete", "metacritic": null, "released": "2017-06-03", "tba": false, "updated": "2019-10-22T14:12:00", "background_image": "https://media.rawg.io/media/screenshots/a88/a884ae494c32eaae00f127e6f1feb953.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 189, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Sunstar Technology Group"], "genres": ["Action", "Strategy", "Sports"], "publishers": ["Sunstar Technology Group"], "esrb_rating": "Mature"}