{"id": 247694, "slug": "onslaught-shooter-killer-2017", "name": "Onslaught Shooter Killer 2017", "name_original": "Onslaught Shooter Killer 2017", "description": "Onslaught shooter killer 2017 is the only action game that would quench your thirst of ACTION. It is first person shooter easy to play game. This easy to play game will immerse your mind and make you play it time and again. Onslaught shooter killer 2017 is addictive. Bonus, cash and a lot more to gain here and play smart. Make a sensible strategy and attack.<br/>Commando! The enemy forces attacked our frontline and have killed and assassinated many of our soldiers, it was sudden and unfortunately we could not defend and they captured our city next to the border. Now a battalion is being sent to the city to save the kingdom from the evil enemy and get the charge back of the city which was once peaceful. You will lead this mission operation being the sniper shooter.<br/><br/>You are the soldier who has the skills to make the terrorists retreat from the occupied areas. This military operation is crucial. Shooter you are the best commando and this war has to be won by us. It is a do or die situation. Mission critical is on hand.<br/><br/>This is the final battle with the enemy. They have all the weapons and they are on their positions roaming on the roads terrorizing the innocent people. Make a strategic approach and eliminate their evil force. Innocent people are afraid and are looking for a savior and you are that savior. Onslaught shooter killer 2017 would make the history. The proud and angry army of the enemy has to retreat and run away. We need them dead or alive. We need the area back in our control. Sniper rifles are life taking in just a bullet. One bullet is enough. You are equipped with heavy weaponry, artillery and armor.<br/><br/>Commandos have been provided with different kind of snipers riffles to execute the enemy force. Take you position, hold your breath, take the aim and pull the trigger and shoot. You are the best sniper shooter. Our weapons are the best weapons. Using military technology to kill them is the best. Keep yourself save.<br/><br/>Once we get back to the army base, we would be paid a tribute. We have to take the tribute and unfurl our flag in this city again. Enemy has to be destroyed. Let’s get the tribute. Strike sniper to execute these bloody terrorists. Sniper strike is lethal. This is the lethal war and there is no way you lose it.<br/><br/>Onslaught attack should let us smell the scent of the burning flesh of those enemy attackers. Sniper shooters burnt he boats and fight strong. Are you strong? Prove that you have the guts to fight like a warrior. Best warriors never leave the battle field. Shooter killer you are. Never back down.<br/><br/>Features:<br/>-Destructive city environments<br/>-Real life sounds<br/>-Various challenging missions<br/>-Addictive gameplay <br/>-Sniper rifles to play with<br/>-Cash and rewards", "metacritic": null, "released": "2017-02-03", "tba": false, "updated": "2019-10-22T14:12:05", "background_image": "https://media.rawg.io/media/screenshots/5f5/5f56a6f71337838e7141fcf7b7eb1d4a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 199, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Sunstar Technology Group"], "genres": ["Action", "Adventure"], "publishers": ["Sunstar Technology Group"], "esrb_rating": null}