{"id": 247682, "slug": "gunners-battle-city", "name": "Gunners Battle City", "name_original": "Gunners Battle City", "description": "Gunners Battle City<br/>The famous Gunner is in the town to cheer the terrorized citizens<br/><br/>It’s a free gunner game about criminal domination in the city and reputation for lawlessness! Your duty will be to perform a secret operation and destroy their stronghold. It’s not a piece of candy; it’s not a war of small weapons anymore! Terrorist are equipped with the weapon of modern era and will be ready to crush you. They are roaming around in the Humvees, surveillance of their strong hold is on apache helicopters, Rpg , AK47 are the standard weapons they have and skilled in counter attacks.<br/><br/>It’s a new + updated idea game. The gangsters are dominating over the city and the law. They openly demonstrate their superiority over the law and their criminal skills is way above anything it’s a wicked gangster game and you need to show your anti criminal skills and prove that you are the boss of town. The underworld gangs are very well organized, you need to become a part of them in order to break them. You will get the tanks to ride and will give you the chance to storm into the stronghold of criminals.<br/><br/>Unlimited criminal tasks would keep you on your toes. Neutralize the no go areas and clear it for terrorized innocent public.<br/><br/>Feature of Gunner Battle City<br/><br/>Unlimited challenging battle missions<br/>Real Crime city 3d environment<br/>Best sound effects<br/>Superior Gunner gun<br/>Drive the battle tank<br/>Use the RPG to shot down battle helicopters<br/>Cool animations", "metacritic": null, "released": "2016-12-14", "tba": false, "updated": "2019-10-22T14:12:04", "background_image": "https://media.rawg.io/media/screenshots/fc8/fc87203038fde69827c8861aa96f201e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 71, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Sunstar Technology Group"], "genres": ["Action", "Adventure"], "publishers": ["Sunstar Technology Group"], "esrb_rating": "Teen"}