{"id": 247665, "slug": "russian-mafia-grand-robbery-crime-2017", "name": "Russian Mafia Grand Robbery Crime 2017", "name_original": "Russian Mafia Grand Robbery Crime 2017", "description": "Russian Mafia gang has made some underground force and they are making mischiefs in the main city full of people. The enemy is equipped with heavy weapons and artillery. They are trained and skilled criminals of underground. This time the bad men have planned to do the bank robbery in the day time and they have gone so far in their executions that they are under estimating the Police and military of the city. Now is the time we chose our predefined plans and just act. They don’t care about the CCTV cameras and guards and K9 units, as they are fully load extremist enemies of this land.<br/>You are the lead commando to lead this close combat. Bring the courage down and kill them just once and for all. This robberies won’t stop unless we shoot the bloody terrorists in every mission we have to complete. Take your position and wait till the enemy is in the aim, hold your breath and shoot after precise aim. You have multiple weapons like sniper, m14 and short guns. Stop this crime and bring back the peace.<br/>Show them that you are the real commando soldier. Medical assistance is there for you till we don’t return victorious from this crucial mission. Russian Mafia has to be stopped now. Save the people and get back the looted money and jewels from them. Kill them or arrest them. Good luck<br/>Features<br/>Amazing 3D city environment<br/>Real life sound effects<br/>Challenging action packed missions<br/>Engaging game play<br/>Chance to prove to be a Hero<br/>Multiple weapons<br/>Encounter the Russian Mafia<br/>Medical kit and help", "metacritic": null, "released": "2016-12-19", "tba": false, "updated": "2019-10-22T14:03:00", "background_image": "https://media.rawg.io/media/screenshots/fd6/fd69ea00e0de0f6c9509b3941c981680.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 155, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Sunstar Technology Group"], "genres": ["Action", "Adventure"], "publishers": ["Sunstar Technology Group"], "esrb_rating": "Teen"}