{"id": 247700, "slug": "vr-us-army-commando-gunship", "name": "VR US Army Commando Gunship", "name_original": "VR US Army Commando Gunship", "description": "Are you ready for the ultimate FPS action game &amp; that too in Virtual Reality VR? Not just this, do you want to be a gunner of a military army gunship helicopter flying high in a realistic virtual reality VR 3D environment? Download VR US Army Commando Gunship now &amp; hop on to your very own military army gunship helicopter to take part in a VR virtual reality battle. Take control of the turret machine gun &amp; wage the war against enemy. This is the time you show your commando skills and conquer. Feel the reality and live by it now.<br/><br/>The enemy has crossed into your land &amp; started the war. It is now your job to finish what the enemy started. Get on your turret machine gun in the military army gunship helicopter and be the battle hero by making it impossible for the enemy to advance. Protect your land &amp; save your people. Jump right into the action &amp; complete the missions given to you. Only by doing so you will be able to win the war &amp; be the battle hero. This would be the close combat in VR and be ready to feel the bits of every scene. Shoot and kill. Strike with your gunship beast.<br/><br/>Be a US Army soldier and fly over realistic beautiful VR virtual reality environments consisting of a vast sea, various islands, bunkers, trees &amp; enemy marine ships etc. Destroy enemy in the war with your turret machine gun &amp; rocket launcher. Shoot down enemy military gunship helicopters &amp; destroy their marine ships. Defeat waves upon waves of enemies in the battle, save your people &amp; secure your land. Save the day &amp; win the war. You are the hero your country &amp; your military army gunship helicopter deserves. Fly over a realistic &amp; beautiful environment based in a vast sea &amp; enjoy an amazing 3D VR virtual reality world. Experience the intensity of war &amp; fight the enemy in a virtual reality VR while being a US Army commando. This game is full of explosive war combat action. Once you get back victorious, you would get the military and civil tribute. Tribute is what every soldier craves for. Best of luck.<br/><br/>Download now &amp; experience the best VR has to offer in FPS action genre, war &amp; military gunship battle games.<br/><br/>FEATURES:<br/>-Challenging missions to accomplish<br/>-Optimized controls for VR virtual reality.<br/>-Realistic 3D environments.<br/>-Auto shooting for better VR controlling.<br/>-Two weapons to choose from.<br/>-Real life sound effects.<br/>-Addictive gameplay.<br/>-Another reality to experience.", "metacritic": null, "released": "2017-02-14", "tba": false, "updated": "2019-10-22T14:12:05", "background_image": "https://media.rawg.io/media/screenshots/3fc/3fca4ff17ce24ebd61576b49cad34048.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 162, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Sunstar Technology Group"], "genres": ["Action", "Adventure"], "publishers": ["Sunstar Technology Group"], "esrb_rating": null}