{"id": 247854, "slug": "skyward-realms", "name": "Skyward Realms", "name_original": "Skyward Realms", "description": "Vast World to Explore\r\n<p>UNRAVEL A STORY that takes exploration to new levels of interaction. The paths chosen and the world state left behind impacts the narrative.</p>\r\nEver-Changing Story\r\n<p>MAKE CHOICES that create a ripple effect altering quests and objectives. Further manipulate important items to decide what to do with them.</p>\r\nSinistris\r\n<p>SEAMLESS GROWTH involving the Sinistris bane, the character's capacity to endure hardship is influenced by their decisions and perception of the world.</p>\r\nTurn Based Combat\r\n<p>FAST PACED BATTLES featuring environmental advantages, strategic elements and erratic outcomes. Access hundreds of abilities and equipment items.</p>\r\nField Abilities\r\n<p>TRANSFORM THE WORLD by restoring landscape and crafting utility items. Master field abilities to solve puzzles and overcome obstacles.</p>\r\nChaos\r\n<p>POWER COMES AT A PRICE, manage the chaos generated or become a cautionary tale. A ancient darkness awaits within the abyss of the Spirit Realm.</p>\n\n<p><strong>\"Decayed by the scars of sin, war was imminent for our world. On Ethiryon; creatures from the depths of the spirit realm and the many things right outside of our reach suddenly stepped into the light leaving rifts in the fabric of the universe. A gift and curse un-mended.\"</strong> - The many races of Ethiryon focused on the blessings. Beginning their race for enlightenment and mastery of the Aether to thwart off the spiritual threat on the living. Universities of magic were erected, scholars rose, and great men, Magus’s, led civilization into a new realm of science.</p>", "metacritic": null, "released": "2018-09-30", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/fab/fab156981575f7c590b5b9abe0b866e5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 193, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Rehmlok Arts"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}