{"id": 247963, "slug": "puffy-pigeon-kickstarter-demo", "name": "Puffy Pigeon [Kickstarter Demo]", "name_original": "Puffy Pigeon [Kickstarter Demo]", "description": "<p><strong>Please note that this game is a demo accompanying a Kickstarter campaign to turn it into a full fledged experience. If you are interested in supporting us, please check the link below!</strong></p>\n<p>https://www.kickstarter.com/projects/minimgames/puffy-pigeon</p><p><strong>PLEASE NOTE - A Mac-compatible version of the demo is in the works and will be released soon!</strong><br/></p>\n<p>Puffy Pigeon is a fast-paced arcade-like game featuring our titular hapless hero, Puffy the Pigeon!</p>\n<p>Guide our fat feathered friend through stages filled with dangerous hazards, aggressive enemies and sweet collectibles, keeping him out of harm's way as he is blustered from place to place.</p>\n<p>Gameplay Features:</p>\n<ul><li><strong>Multiple stages with many new hazards and obstacles each level</strong></li><li><strong>Each stage comes with a boss to test your skills</strong></li><li><strong>Normal mode or a hard mode designed for masochists - your choice!</strong></li><li><strong>No microtransactions - Play the game without worrying about waiting on lives or purchasing level buffs!</strong></li></ul>\n<p><strong>Puffy </strong>is cute, fluffy and ... uhm, not very bright. Prone to eating anything and everything that he can swallow, it is bound to get him in trouble one day...</p>\n<p>...Today is that day.</p>\n<p>Finding a mysterious glowing device, he does what he does best and eats it - only to immediately find himself fat, bloated and soaring into the skies against his will.</p>\n<p>He's not the only one with his eye on the Device, however, and soon attracts the attention of the Beaked Bandits, a quintet of bird baddies who will stop at nothing to get it from him!</p>\n<p>And so it up to you to guide Puffy past hazards and foes (gathering all those delicious berryfruits on the way!) until he makes it to the end of his <strong>big</strong> adventure... wherever that may be.</p>\n\n<p>Track our progress through the following links!</p>\n<p><strong>Kickstarter -</strong> https://www.kickstarter.com/projects/minimgames/puffy-pigeon</p>\n<p><strong>Website - </strong>http://puffypigeongame.com</p>\n<p><strong>Twitter - </strong>https://twitter.com/puffy_pigeon</p>\n<p><strong>Facebook -</strong> https://www.facebook.com/PuffyPigeon<br/></p>", "metacritic": null, "released": "2018-09-30", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/718/7182c231a7370c8881fcbfe576fd7e0b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 36, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Minim Games"], "genres": [], "publishers": [], "esrb_rating": null}