{"id": 248073, "slug": "its-free-organs", "name": "It's Free Organs", "name_original": "It's Free Organs", "description": "<p>A Game made for 12 hour Fall 2018 Kick Off Game Jam at CSULB.</p>\n<p>The theme was Artificial Life.</p>\n<p>Team members were:<br/></p>\n<p>Josh Mendez (lead/programming) - CSULB</p>\n<p>Mary Perkins (art) - CSULB</p>\n<p>Louise Ilg (programming) - CSULB</p>\n<p>Kenny Nguyen (programming) - CSULB</p>\n<p>Kristi Chang (programming) - CSUF</p>\n<p>Trisa Alvarez (writing) - CSUF</p>\n<p><strong>Story for Conrad the Zombie Frankenstein:</strong></p>\n<p>Little, but not long ago...a modern alchemist decided to perform an experiment. <br/>The dream goal of creating the perfect Frankenstein. <br/>Would it be considered the modern Prometheus? <br/>No. <br/>A newfound creature of the night to lurk around and scare the neighborhood children?<br/>Maybe so.<br/>But this alchemist simply wished to recreate Frankenstein, the monster Mary Shelley created through her own writing. However little did they know, that adding an essence of hunger for organs would be the alchemist’s downfall. By the time they performed a procedure of electrical conduction, the alchemist removed the blanket. <br/>Only to reveal an awakened Frankenstein that held no hesitation in eating his first victim. Through eating his first victim, the Frankenstein gained a sense of knowledge via eating his creator’s brain. </p>\n\n<p>And with knowledge comes curiosity. <br/>The Frankenstein spotted a fallen book on the ground. Within the open pages of the book, the Frankenstein read the first name he saw in bold. Having no name from his creator, the zombie Frankenstein decided to take on the name shown within the book. <br/><strong>Conrad.<br/></strong>Sadly Conrad had no supply of food to sustain him. So Conrad lurked down the streets at night, in search of food. Only to find the smell of something delicious. </p>\n<p>He recognized it. The smell was similar to that of his creator’s. </p>\n<p>“<em>F o o d.</em>” Conrad’s mouth perked up into a grin as he made his way towards the source of the delicious smell. <br/>Then and there Conrad found a building. A hospital building. Specifically a hospital that specializes on organ donations. Thus began Conrad’s nightly adventure through the halls of a hospital housing many sleeping organ donors. Kind enough to leave Conrad the food he needs to supply him.</p>\n<p>This game features a zombie who traverses a hospital to collect bags of organs, avoid a security guard, and make his way to the exit. Controls are wasd or arrow keys.<br/></p>", "metacritic": null, "released": "2018-09-30", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/69e/69e1415dd07718af5cc950573ada712b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 10, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["krstchng"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}