{"id": 248253, "slug": "galactic-destroyer", "name": "Galactic Destroyer", "name_original": "Galactic Destroyer", "description": "<p><strong><em>INSTRUCTIONS:</em></strong><strong><em> </em></strong></p>\n<p>•<strong>Left Click</strong> to launch the ball,</p>\n<p>•Destroy <strong>all </strong>the bricks</p>\n<p>• <strong>have fun</strong>! :)</p>\n\n<p><strong><em>INTRODUCTION:</em></strong></p>\n<p>This is the very first game that I created on my own, the game is designed to be sort of a rage/adventure game using a simple concept of block breaking (based on the original \"Arkanoid 1986\").  I am a student learning to become a game developer in the future so this is my very first crack at a simple concept with some extra features that will make the game interesting and fun!</p>\n<p><strong><em>FEATURES:</em></strong><br/></p>\n<p>The game is simple,<em> </em><strong>break blocks</strong> to progress level by level. As of right now (in development) there are a total 20+ levels with some unique adventure/ game mechanic elements scattered throughout the game (that I thought would be amazing to have!). The <strong>rage </strong>elements of the game are designed to not be considered a <em>\"Break your keyboard\"</em> level of rage but rather a <em>\"Mild inconvenience\"</em> level of rage. I wanted to add a feeling of <strong>horror </strong>through visual and audio representations since the game is based in a space-like environment and as we know, space can be very frighting packed with many unknowns.</p>\n\n<p><strong><em>FUTURE:</em></strong></p>\n<p>I have set up some visual representations of a story that I would like to tell  (using the breakable blocks) and have also thought of some extra/ returning mechanics that I would like to add to the game but that is entirely based on your opinion. Yes <strong><em>y</em></strong><em><strong>our opinion means a lot to me </strong></em>and I would like to make whatever I create better then ever so please tell me in the comments what you think about this game. From the bottom of my heart I thank you for giving it your time and I sincerely hope you guys enjoy what I create, now and in the future!</p>\n\n<p>Don't forget to smile :)</p>\n\n\n<p>Special thanks to freesound.org, bensound.com and Youtuber Annex for providing the music and sound effects! </p>", "metacritic": null, "released": "2018-09-29", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/638/638ab7de0f86011cbdfb6d47b73cc5ad.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 83, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["demon202"], "genres": ["Action"], "publishers": [], "esrb_rating": null}