{"id": 248229, "slug": "astral-nights", "name": "Astral Nights", "name_original": "Astral Nights", "description": "<p><strong>Astral Nights</strong><em> </em>is a <em>mystery visual novel</em> (story-based game with a lot of choices to make and paths to take). It blends romance, suspense, some spookines, motives from Polish legends, books and traditions into interesting, creepy story  about ghosts, demons and helping others.</p>\n<p>You play as Main Character, a high school student, who was asked by the teacher to help a girl with her math homework. At first, everything looks so easy - you have to spend some time with one of the most rumored and definetly most interesting girl in the school. It shouldn't be that difficult... and maybe you will be able to learn why everyone is talking about her?<br/></p>\n<p>It was made for the Ren'Py Game Jam 2018 (from 09/15 to 09/30). <br/></p>\n\n\n\n<p>... and many, many other interesting characters! <br/></p>\n\r\n\r\nChoices\r\n<p>There is so many of them! Some of them are silly, some of them will take you to a journey through Rea's past, and some of them can save your live!</p>\r\nAbsorbing story\r\n<p>Your adventures with Rea include ghost busting, preparing for rituals, running away from some face-stealing monsters, learning more about her past and polish traditions. </p>\r\nRomance*\r\n<p>Try to win the heart of your companion through your actions. Will you go on a date with the beautiful rumored girl, snarky guy from neighbourhood, intelligent student or council president? Or maybe someone else?</p>\r\nPerforming your own ritual\r\n<p>Did you ever wanted to perform your own ritual to summon a ghost? With the help from other characters, now you can!</p>\r\nAnd more!\r\n<p>- about 9 000 words = 1 hour of gameplay</p>\n<p>- Multiple endings</p>\n<p>-<em> Forefathers Eve</em> - one of the greates literary achievement in history of Poland</p>\n<p>- fun minigame</p>\n<p>- relationship points*<br/></p>\n<p>*Note that this is only a demo, so some of the features might be incomplete or missing.</p>\n<p>After finishing the game, you can fill out a quick survey: click here. You can also visit our tumblr page to support the game development!<br/></p>", "metacritic": null, "released": "2018-09-29", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/f2f/f2f2c1d44a1131b17ebce8bfa1aec343.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 192, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Forsaken"], "genres": [], "publishers": [], "esrb_rating": null}