{"id": 248491, "slug": "cuboid-keeper", "name": "Cuboid Keeper", "name_original": "Cuboid Keeper", "description": "Cuboid Keeper is a 2D twin stick shooter with ship building elements and with an unique story.<br/><br/>The game consists of about 40 levels. Each level takes place in an enclosed play zone where the player must fire on the enemies that successively spawn, while evading their attacks by transforming into a Spark.<br/><br/>Between each level, the main character can be upgraded with modules. Each module enables a skill that complements the others and requires adapting the play style to fully master. Modules can be equipped many times to increase their effect.Story<br/>In the middle of the galaxy, floating in space, a colossal cubic construction can be found. The legend says that this \"Cube\" holds a secret so enlightening, that it can make anyone the ruler of the universe.<br/><br/>However, to be rewarded with the secret, one must first defeat a powerful being known as the Cuboid Keeper.<br/><br/>You are the Keeper.<br/><br/>The secret of the Cube is under your protection !Features<br/><ul><li>Face more than 40 different types of enemies (including 8 bosses) from 4 distinct factions, each with their own graphic style and skill set.<br/></li><li>Transform into energy with the Spark Mode to evade enemy attacks and collect power fragments.<br/></li><li>Build your Cuboid Keeper by assembling offensive, defensive and special attack modules, to fit your play style.<br/></li><li>Protect the forbidden secret. For millions of years, it has remained hidden. Not even you, the Keeper, can be revealed its contents. Unless...</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:52:38", "background_image": "https://media.rawg.io/media/screenshots/9f8/9f8c73ea042e0aa806861e660fd5179d.jpg", "website": "http://cuboidkeeper.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 363, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ottropi Games"], "genres": ["Action", "Indie"], "publishers": ["Ottropi Games"], "esrb_rating": null}