{"id": 248404, "slug": "plantechtor", "name": "PlanTechtor", "name_original": "PlanTechtor", "description": "In PlanTechtor, you must design a plan that lets you exploit the level and overcome waves of invading enemies.<br/>\n<br/>\r\nEach level starts with a pre-game phase. Your quest provides some hints about the invading forces. Your weapons are given bonuses unique to that level. You must design the best weapon loadouts possible to fully take advantage of the bonuses and to conquer the invaders. Once you are confident in your plan; you can commit to the challenge.<br/>\n<br/>\r\nGameplay is intense VR action. Waves of invading alien, robot forces will try to destroy your castle home. You must use the weapon loadouts you designed to take them down. Make sure to use the right weapon against the right enemy. Fast reflexes, quick decision making, and expert skill will be needed to take them all out.<br/>\n<br/>\r\nFail, and you must try again. Maybe you missed a hint in your quest. Maybe you need to focus more on the level bonuses. Maybe you just missed too many shots. One way or another, you will need to adjust your plan and try again.<br/>\n<br/>\r\nSucceed, and you will advance to the next level; where new worlds, new bonuses, new skills, and new threats wait for you. PlanTechtor has 50 hand-crafted levels to provide a slew of unique puzzle-like experiences.<br/>\n<br/>\r\nA weapon loadout is a player-chosen combination of weapon, skill, and combos. The player has 3 unique weapons. Each weapon is a different tool with it's own strengths and differences. The player will unlock skills over the course of the game to use with their weapons. The skills drastically change how the weapon behaves and how the player should use the weapon. Finally, the player can earn and use combos. Combos can be used to design synergistic reactions between the weapons and/or skills. There are endless combinations of weapon loadouts to explore and design. The experience is similar to building a deck of cards in a CCG or designing a character build in an ARPG.<br/>\n<br/>\r\nFunnerSoft is an independent game studio. It's founder, Lester Bloom, built a career working on AAA games, but moved into independent development to realize and share the many ideas floating around in his head.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:52:45", "background_image": "https://media.rawg.io/media/screenshots/ebd/ebd6323852b6bc92dd5bec359a0e4c06.jpg", "website": "http://www.funnersoft.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 362, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["FunnerSoft"], "genres": ["Action", "Strategy"], "publishers": ["FunnerSoft"], "esrb_rating": null}