{"id": 248438, "slug": "bliss-mazeji-le-mi-gong", "name": "Bliss Maze(极乐迷宫)", "name_original": "Bliss Maze(极乐迷宫)", "description": "Bliss Maze is a new multiplayer horror game. As the old world was destroyed by mysterious forces, the master of the world, yuxuan, made use of the mysterious Oriental buddhist power to create the survival space station for the survivors. But the space station needs the power of Buddha India to sustain its operation. Players take on the role of survivors, creating unique buddhas, entering into a sinister and terrifying labyrinth of unknown existence, and competing for the power of buddhas.<br/>Innovation points of the game:<br/><br/>1. The skin of the character is completely painted freely by the player, and even can be imported into their own emojis, photos and other materials for skin diy.<br/><br/>2. The voice of the character can also be recorded by the player, including the call of attack, call of being attacked, call of long-range shooting, jump call, dodge, death call and so on.<br/><br/>3. After multiplayer online, you will see the character skins created by other players. When you interact with other players (fighting, killing, etc.), you can even hear their own voices. Due to the physical effect of the character's movements, it will be very happy in the process of fighting and interacting.<br/><br/>4.While having fun, the sheer horror of the bliss maze and the often eerie appearance of \"she\" can make all players feel numb. Thanks to the voice of a real old man, there is such a strange \"she\".<br/><br/>5.A combination of science fiction and superstition. Elysium maze is a randomly generated three-layer three-dimensional maze, each game, map routes are completely different, including wall maps, staircases, props are randomly generated. In order to maintain the operation of the space station, survivors through the way of worship Buddha, blessing the players, while competing for the power of Buddha India.<br/><br/>Come on, use your expressions or favorite pictures in your chat, and the sounds of nature in your throat to create your own unique Buddha seal, join the crazy Buddha seal to win!", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:52:42", "background_image": "https://media.rawg.io/media/screenshots/911/91113b2628e04dcbdda032d582b68c08.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 373, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MagicK"], "genres": ["Action", "Adventure", "RPG", "Massively Multiplayer", "Indie"], "publishers": ["MagicK"], "esrb_rating": null}