{"id": 248464, "slug": "the-tension", "name": "The Tension", "name_original": "The Tension", "description": "The Tension is a stealth-based puzzle horror game. It's a game where the player can see the character from the top camera view and control it. The main mentality of the game taken from Alien Isolation. The current game state is Alpha. While there are still a lot to do, the main systems work perfectly. <br/><br/>You will be controlling a kid who got kidnapped by aliens. You will be trying to escape from their mother ship. You will have tense moments while looking for your ship and escape from the alien mothership and solve puzzles on the way.  All levels have some kind of puzzles inside. Some have enemies that you will need to avoid. <br/><br/>There are different kind of puzzles in this game. I tried to balance the puzzle difficulty depending of the level. You will need to solve each and every one of them in order to proceed to next level. Once you complete a level you can either go to next level or you can repeat the same level to get the higher score. The score is determined by the time you spend in a level. The time stops when you pause the game which happens in few different ways.<br/><br/>The game first will be published in English language. There will be multiple languages (which already translated but not implemented yet) .<br/><br/>What this game can provide:<br/><ul> <li>Multiple levels that are unlockable<br/> </li><li>Story based single player mode<br/> </li><li>Different puzzle systems<br/> </li><li>Tense environment<br/> </li><li>Amazing musics</li></ul><br/>Who am I?<br/><br/>My name is Yigit and this is my first game which is almost complete. I'm writing this game since 2016 November and working mostly by myself. Im the developer. There are few friends who add important things to the game like scenario, music etc. You can all see their names in credits scene. Since this is my first game to publish Im sure there will be things that needs improvements. Please dont hesitate to contact me for any suggestions or feedbacks<br/><br/>Things to improve/add:<br/><ul> <li>Enemy AI system.<br/> </li><li>Friendly NPC AI system<br/> </li><li>More languages for the scenario and UI<br/> </li><li>Star system for each level need orginizing<br/> </li><li>Story telling system character avatars need to be implemented<br/> </li><li>Some collectable object need changing.</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:52:40", "background_image": "https://media.rawg.io/media/screenshots/177/177c8e2813e6520a88e762c38cb8cc28.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 295, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Yigit Tatlipinar"], "genres": ["Adventure", "Strategy", "Indie"], "publishers": ["HH Studios"], "esrb_rating": null}