{"id": 248411, "slug": "arkane-rush", "name": "Arkane Rush", "name_original": "Arkane Rush", "description": "Arkane Rush is a roguelike spellcasting game starring an old mage, which has the mission to explore the forest islands, fighting harmful enemies and finding different Magic Staffs that will aim him on his journey. Every magic staff has a combination of two unique powers that the mage will have to use wisely against the horde of enemies.<br/><br/><br/><br/>Every adventure is different from the others, as the scenarios, itens and enemies are generated differently every run.<br/><br/>The adventure tends to get more hardcore as the player advances through the levels and gets closer to find his greater objective, which is to find the Magic Forger, his very own apprentice who rebelled against the magic order and is reviving and controlling the Old Gods to create his own order.<br/><br/>The Magic Staffs are a collection of tools imbued in powerful magic. They store the essence of the elements within them so the holder can cast powerful fire laser beams that explodes enemies to create cascade damage effects, hit multiple enemies with strong lightning strikes, create a clone which distracts enemies to gain time and so on. Those spells can create devasting effects if combined correctly!<br/><br/>The enemeis horde are created by the Spawners, which are big structures full of arkane magic. While still alive, the Spawners can summon malicious creatures, so the mage must destroy them in order to proceed to the next levels. But to destroy them, the mage will have to fight a huge amount of Goblins, Imps, Orcs, Necromancers and more!<br/><br/><br/><br/>Will the mage be able to defeat the Magic Forger and his devil creations?", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:52:44", "background_image": "https://media.rawg.io/media/screenshots/6d9/6d9dcbd36f088bd569728ab1c8c3e691.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 289, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Mafu Games"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Mafu Games"], "esrb_rating": null}