{"id": 248417, "slug": "the-watson-scott-test", "name": "The Watson-Scott Test", "name_original": "The Watson-Scott Test", "description": "Take the <strong>Watson-Scott</strong> personality test and discover your deepest and darkest fears.<br/><br/>30 multiple-choice questions will tell you if you're more afraid of clowns, snakes, or something more sinister... Are you a pathological liar or an empathic listener? Do you run from danger or take it head on? Do you really believe in ghosts?<br/><br/><br/><ul><li> Unique psychological horror experience that blurs the line between fact and fiction.<br/></li><li> Accessible gameplay. Use your mouse to answer multiple-choice questions.<br/></li><li> Creepy and suspenseful atmosphere, utilizing Steam's 3D spatial audio, for truly unnerving scares.<br/></li><li> Save a copy of your personal analysis to share with friends.<br/></li><li> Procedurally generated questions with branching narrative. The test can be taken multiple times if you want to explore the secrets of the test itself...<br/></li><li> Short playtime. 20 minutes to complete the test!</li></ul><br/>This is a small game made by two programmers over a short period of time. We wanted to make an experience that was different to other horror games out there and blur the lines between the screen and the real world.<br/><br/>We appreciate your feedback and we're going to do our best to support this game as much as possible. Please don't hesitate to reach out if you have any problems or suggestions. We really hope you enjoy our game! &gt;:)<br/><br/>-Andy (Normal Wholesome Games)", "metacritic": null, "released": null, "tba": false, "updated": "2023-04-29T15:26:27", "background_image": "https://media.rawg.io/media/screenshots/8a4/8a446e036a259135d00858cf228d721d.jpg", "website": "http://normalwholesomegames.com", "rating": 0.0, "rating_top": 4, "added_by_status": {"owned": 15, "beaten": 4, "dropped": 1}, "playtime": 1, "achievements_count": 6, "ratings_count": 5, "suggestions_count": 49, "game_series_count": 0, "reviews_count": 5, "platforms": ["PC"], "developers": ["Normal Wholesome Games"], "genres": ["Indie"], "publishers": ["Normal Wholesome Games"], "esrb_rating": null}