{"id": 248538, "slug": "premiere-collection-du-10eme-anniversaire-les-esse", "name": "Première collection du 10ème anniversaire: les essentiels indémodables", "name_original": "Première collection du 10ème anniversaire: les essentiels indémodables", "description": "<p>\n\nLes langues, les fonctionnalités et les configurations requises peuvent varier selon les jeux : consultez les pages des produits pour plus de détails. Si vous possédez déjà certains des jeux inclus dans la collection, vous recevrez automatiquement par e-mail un code promo que vous pourrez partager avec un ami. Ce code expirera 2 mois après la date d’achat.</p>\nOn a grandi avec ces jeux. On a même fait l'école buissonnière, enquiquiné nos parents et appris à survivre à coups de rations de biscuits rassis, rien que pour passer plus de temps à y jouer. Des grands incontournables dans toute collection de gamers, désormais disponibles à un prix imbattable pendant la fête du 10e anniversaire de GOG.\n<br/>\n\n\n\nTheme Hospital est un jeu de gestion très bien ficelé provenant des légendaires Bullfrog Productions, qui vous redonnera instantanément du baume au cœur en cas de pépin vidéoludique. La posologie : deux pilules de fantaisie, une gorgée de surréalisme et rincez le tout avec un petit verre de réalité sordide... Vous êtes désormais tous fin prêts pour guérir le monde des maladies comme l'hyperlangue, l'excès costal et l'encéphalantiasis.\n\n\n\n\n\n\nDungeon Keeper 2 reste le maître incontesté du \"jeu dont vous êtes le méchant pour l'éclate\", même 20 ans après sa sortie. Défoulez-vous en dirigeant un empire souterrain, en frappant vos sbires et en regardant des âmes charitables tomber dans vos pièges diaboliques. Le cher \"Grand Cornu\" revient dans cette suite exceptionnelle qui introduit bien évidemment le mode bac à sable \"Mon p'tit donjon\" que nous adorons tous.\n\n\n\n\n\n\n\nAnother World est un jeu d'action et d'aventure innovant qui a posé les jalons de la cinématique en toute beauté dans le jeu vidéo. Mettant en vedette un jeune scientifique qui se retrouve involontairement perdu dans un monde extraterrestre hostile, le chef-d'œuvre au style unique d'Éric Chahi est doté de graphismes vectoriels spectaculaires et d'une animation fluide qui relatent une véritable histoire de bromance sous-jacente dans les jeux vidéo.\n\n\n\n\n\n\n\nSystem Shock 2 reste à ce jour une référence en termes de \"simulation immersive\", et à juste titre. Éviter les pièges et les mauvaises consignes de SHODAN et tenter de survivre aux horreurs qui vous attendent dans le vaisseau à l'abandon Von Braun font partie de ces rares expériences haletantes et angoissantes qui sont venues hanter nos écrans d'ordinateur. Des couloirs où vous vous sentez à l'étroit, une histoire de science-fiction percutante, des pouvoirs psioniques qui en jettent et une I.A. impitoyable à vos trousses... Que vouloir de plus ?", "metacritic": null, "released": null, "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/c91/c91f1574cafbc3c9ea6c788cce292f2c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 432, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Multiple"], "genres": ["Action", "Strategy"], "publishers": ["Multiple"], "esrb_rating": null}