{"id": 248560, "slug": "makerocket-block-hexa-puzzle", "name": "MakeRocket Block Hexa Puzzle", "name_original": "MakeRocket Block Hexa Puzzle", "description": "MakeRocket is a block puzzle game that anyone can enjoy!<br/><br/>The rules are simple:<br/>Just fit the blocks displayed at the bottom into the open spaces.<br/><br/>Although the controlling is easy, this game will make you use your brain!<br/>It's great for training your mind and preventing dementia! <br/><br/>Why not try aiming for a high score or competing with your friends?<br/><br/>-------<br/>After a 3-day free trial, VIP membership costs $7.49 per month for the subscription and deletes all ads. <br/>Additionally, you can also earn everyday bonuses, such as doubling the number of stars you can get from subscriptions.<br/><br/>This VIP membership can be automatically renewed and the payments are taken from your iTunes account.<br/>Unless the subscription is canceled 24 hours before the end of the period, the subscription will be renewed and the renewal fee will be charged from your account.<br/>It's possible to cancel by turning this feature off in your account settings.<br/><br/>Automatically renewed subscription<br/>Subscription option<br/>The game has the following agreement periods:<br/><br/>After a 3-day free trial, the monthly VIP membership costs $7.49 per month for the subscription.<br/>With the subscription, all ads are deleted. Additionally, you can earn everyday bonuses, such as doubling the number of stars you can ear.<br/><br/>End of trail period and renewal of agreement<br/>This price has been established for customers in the USA.<br/>Prices for other countries may vary, and depending on the  country of residence, the amount may be converted to the local currency.<br/><br/>Payment will be charged from your iTunes account with the confirmation of purchase.<br/><br/>If the automatic renewal is not turned off at least 24 hours before the end of the current period, the registration will be automatically renewed. <br/><br/>Subscriptions are managed by the user and you can turn off automatic updates when you go to your account settings after purchase.<br/><br/><br/>Cancel trial or subscription<br/>If you want to cancel the subscription contract, you can cancel it by turning off automatic updating 24 hours before the contract period through the itunes account.<br/>After the subscription has expired, you will not be able to use the elements contained in the subscription option.<br/><br/>If you have any questions, please contact ftyappli@gmail.com<br/><br/>Privacy Policy: <br/>https://app.ftyapp.com/privacy/<br/>Terms of Use: <br/>https://app.ftyapp.com/rule/", "metacritic": null, "released": "2017-07-25", "tba": false, "updated": "2019-10-22T14:12:07", "background_image": "https://media.rawg.io/media/screenshots/c7e/c7e107c2818a3ba70e27e0b05074a1c8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 33, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["FTY"], "genres": ["Board Games", "Puzzle"], "publishers": ["FTY"], "esrb_rating": "Everyone 10+"}