{"id": 248529, "slug": "sinister-halloween", "name": "Sinister Halloween", "name_original": "Sinister Halloween", "description": "Experience a Halloween night in Mountain peaks, Northern Canada.<br/>Famous for it's Horror Festival.  You go out with your friends, trick or treating, entering haunted themed houses<br/>as you make your way to the big party, but this year's holiday of the afterlife brings something sinister. <br/>Are the legends true? Find out for your self. Play in Virtual Reality.<br/><br/>Explore highly detailed environments, search for items, weapons, notes to clues, keys, and spiritual pagan rituals, <br/>anything to help you survive the night.<br/><br/>We've painstakingly developed every element from the ground up for HTC ViveFEATURES<br/><ul><li>Full single player story driven campaign. experience the horror and story behind this sinister night</li></ul><br/><ul><li>Experience the night along with your friends. Each character has their own history. Take part in their fate.</li></ul><br/><ul><li>VR driven game-play mechanics: Perform physical actions true to life that immerse players deep inside the world.</li></ul><br/><ul><li>Plenty of Weapons. Use Firearms, Melee weapons, Fire, Curses, Rituals, The bible and holy crosses, anything you can find.</li></ul><br/><ul><li>True Horror Survival: With limited weapons or tools, you must run and hide or out smart the evil spirits on this holy night.</li></ul><br/><ul><li>Horde survival mode. Blast your way through the story campaign in survival hunt mode. Killing enemies along the way.</li></ul>VR LOCOMOTION<ul><li>Walking Locomotion</li></ul><ul><li>Teleportation</li></ul><ul><li>Simple Flash Motion</li></ul>", "metacritic": null, "released": "2018-10-30", "tba": false, "updated": "2019-08-28T21:52:35", "background_image": "https://media.rawg.io/media/screenshots/417/417ba5a5f7bc4932b1035f8832262c0f.jpg", "website": "https://www.sinisterhalloween.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 18}, "playtime": 0, "achievements_count": 47, "ratings_count": 0, "suggestions_count": 419, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Celeritas Games"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Celeritas Games"], "esrb_rating": null}