{"id": 248652, "slug": "mr-runner-2-the-masks", "name": "Mr. Runner 2: The Masks", "name_original": "Mr. Runner 2: The Masks", "description": "Mr. Runner 2: The Masks, the critically acclaimed multi-million selling iOS game, is now available on Mac!<br/> <br/>▶Quality Index's Top 10 iPhone games list of April 2013<br/>▶The series has achieved over 5 million downloads on iOS<br/>▶Golden Pass award at Global Game Stars event during Game Developers Conference<br/><br/>Reviews:<br/>▶\"Overwhelms, impresses, and entertains\" - Pocket Gamer<br/>▶\"It really looks (and sounds) fantastic.\" - TouchArcade<br/>▶\"If you love runner games, but are tired of the usual fare, then this game is a refreshing and welcome challenge.\" - AppAdvice<br/>▶\"I liked the feel of the game. It’s definitely unlike any other game out there.\" - 148 Apps<br/>▶\"Mr. Runner 2 looks wonderfully insane\" - Kotaku<br/>▶\"A love letter to all us gamers at heart\" - Gamezebo<br/>\"It’s challenging and exciting like any Mega Man game during the SNES days.\" - GGVogue<br/>▶\"…it’s safe to say that Mr. Runner 2 does something very right.\" －Save Game Online<br/><br/>Are you speedy or cautious?  You may need to be both!  The mischievous Le Magie has sprung a vile trap and locked your head in a mysterious mask!  Hunt down Le Magie through strange and uncharted worlds.  Unlock the mask before you forget who you are!<br/><br/>Mr. Runner 2: The Masks is a unique side-scrolling running platformer unlike any other runner games out there.  If you love runner games and want to experience something new and different, please play Mr. Runner 2 and join 5 million other gamers.  You will be addicted! <br/> <br/>FEATURES:<br/>▶Simple control scheme to let gamers focus on the fun of the SPEED!<br/>▶4 game worlds featuring different themes and challenges<br/>▶32 carefully crafted levels with high replayability for HOURS of fun<br/>▶Epic boss fights to test your evasion skills<br/>▶Cute characters, vibrant worlds, marvelous animations, HD optimized graphics, and stunning art direction<br/>▶54 pop-culture inspired masks<br/>▶5 special ability outfits<br/>▶Interactive menus: Explore the castle and meet new characters!<br/> <br/>Check out the game trailer:<br/>www.youtube.com/user/Zinggames2012<br/>Join our community and keep yourself up to date on winning prizes on our Facebook:<br/>www.facebook.com/MrRunner2<br/>www.facebook.com/ZingGamesInc", "metacritic": null, "released": "2013-06-15", "tba": false, "updated": "2019-10-22T14:12:09", "background_image": "https://media.rawg.io/media/screenshots/076/076f7db8d84db3103bfdc0e40c0426de.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 128, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS"], "developers": ["GameVision"], "genres": ["Adventure", "Arcade"], "publishers": ["Game Vision"], "esrb_rating": "Everyone 10+"}