{"id": 248684, "slug": "flo-game", "name": "FLO Game", "name_original": "FLO Game", "description": "Flow along an infinite horizon and challenge your Facebook friends in FLO. Roll your ball up and down hills to gain speed in this exciting, fast-paced infinite runner.<br/><br/>Use simple one-touch tap gameplay to travel as far as you can, achieve your personal best and connect with Facebook to see friends’ playing FLO, then challenge them to beat your high score!<br/><br/>Dodge deadly mine obstacles with one tap to flow through the horizon. Hitting a mine will reduce the speed of the ball, making it harder to beat your friends’ scores on the leaderboard.<br/><br/>• Travel above the horizon to pick up speed as you roll down<br/>• Travel below the horizon to pick up speed as you roll up<br/>• Dodge the mines and flow through the horizon by tapping on impact<br/>• Tap and hold to glide past obstacles<br/>• Smash through score walls set by your Facebook friends<br/>• Losing momentum brings the Wall of Death ever closer. If it engulfs you, it’s game over<br/><br/>FLO is a beautiful game experience with music tracks by UK Hardcore act Fracus &amp; Darwin.<br/><br/><br/>Thank you for downloading this game from everyone at Rogue Games.<br/><br/>http://www.rogue-games.co.uk/<br/>https://twitter.com/roguegamesuk<br/>https://imgur.com/user/RogueGamesOfficial<br/>https://www.facebook.com/RogueGamesOfficial/<br/>https://www.facebook.com/FloAppGame/", "metacritic": null, "released": "2018-02-13", "tba": false, "updated": "2019-10-22T14:12:12", "background_image": "https://media.rawg.io/media/screenshots/463/4635d8226895001bd856729d1131d87f.jpg", "website": "http://rogue-games.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 34, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Rogue Games"], "genres": ["Racing", "Arcade"], "publishers": ["4t2 Multimedia"], "esrb_rating": "Everyone 10+"}