{"id": 248647, "slug": "hidden-empire", "name": "Hidden Empire", "name_original": "Hidden Empire", "description": "A placebo is a substance or treatment with no active therapeutic effect but this treatment might be given to a person with the intention of deceiving the recipient into believing that it is an active treatment. And the evidences show that this treatment could be rather efficient sometimes but those experiments are performed under very controlled circumstances, in order to avoid any possible risk. The human will and the belief in something could make a person heal completely, sometimes using only water or a simple candy with no medications at all.<br/><br/>The St. Luis Hospital was a really reputable hospital and the scientists and doctors that worked there were also real professionals. However, it seems that things have changed last years since some of the people that work there took the courage to start doing some things that are not allowed by the basic ethics of the 'doctors' craft'. The detective Frank has just arrived at the St. Luis Hospital. There are few reports that some of the doctors that work there do certain illegal experiments on the patients, using the placebo effect. Placebo might be good in certain controlled circumstances, but in this case seems that nothing is controlled and those doctors put the patients into danger.<br/><br/>Frank is at the place with one intention - to discover the key evidences that will prove that those illegal acts are really performed here.", "metacritic": null, "released": "2018-02-20", "tba": false, "updated": "2019-10-22T14:12:14", "background_image": "https://media.rawg.io/media/screenshots/509/5092e2c63b57e866cc6f308253647a9f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 171, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["wang kai"], "genres": ["Adventure", "Puzzle"], "publishers": ["wang kai"], "esrb_rating": null}