{"id": 248633, "slug": "shadow-battle-2", "name": "Shadow Battle 2", "name_original": "Shadow Battle 2", "description": "The SHADOW force has corrupted our Universe by its dankness power, all life forms are covered under its effect. The souls of the most powerful heroes have been sealed inside the magical artifact called Cube. Only you - the Commander - can free the imprisoned heroes, take the lead and fight against the SHADOW to bring peace back to the Universe.<br/><br/>This is SHADOW BATTLE 2.2 - A Revolutionary RPG-fighting action game!<br/><br/>* NEWS! *<br/>SHADOW BATTLE 2.2 is released with Online Multiplayer Arena game mode!<br/><br/>* CREATE YOUR OWN FIGHTING TACTIC *<br/>SHADOW BATTLE brings to you many heroes under 6 unique classes to choose from. Collect new heroes, emblems and manage them in the way you like. Be fast and graceful, strong and shattering, enigmatic and deadly.<br/><br/>* BECOME THE GREATEST LEGEND *<br/>As a Commander, you can recruit, power up and manage heroes to fight against the SHADOW force that threatens to enslave all Universe!<br/>- Gather all of the most powerful heroes together and let them stay by your side, fight under your lead.<br/>- Undertake your epic journey amongst the stars, explore planets and beautiful landscapes.<br/><br/>* RISE TO THE CHALLENGE *<br/>Engage in Versus battles to conquer your challengers; Win rewards, upgrade your force and become the top-ranked Commander!<br/><br/>* UNLOCK MYSTICAL PRIZES *<br/>Win Cubes to discover the loot and treasures within: rare heroes, diamonds, valuable resources and other amazing rewards!<br/><br/>* Contact us *<br/>We want to make sure you are entertained. Feel free to write us any feedback. They are real-time credits for us. Let's improve the game together!<br/><br/>* Update Suggestions *<br/>Any ideas and suggestions, please send us an email at shadow.battle.superhero@gmail.com.", "metacritic": null, "released": "2018-09-13", "tba": false, "updated": "2019-07-29T19:37:17", "background_image": "https://media.rawg.io/media/screenshots/a9f/a9f6171f844a90e1567123bf4377ebe4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 346, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["doan lan", "ABIGAMES PTE"], "genres": ["Action", "Adventure"], "publishers": ["doan lan", "ABIGAMES PTE"], "esrb_rating": "Everyone 10+"}