{"id": 24863, "slug": "pet-alien-an-intergalactic-puzzle-palooza", "name": "Pet Alien: An Intergalactic Puzzlepalooza", "name_original": "Pet Alien: An Intergalactic Puzzlepalooza", "description": "<p>Gumpers the Alien wakes up. He&#39;s all alone. He&#39;s not at home anymore…<br />\nhe&#39;s in a gigantic spaceship! Where is Tommy, his human friend? Where<br />\nare his alien friends?! What happened?</p>\n<p>The whole gang&#39;s been captured by the Robotix, who&#39;ve been hijacking<br />\ncreatures from all over the universe to build the biggest zoo in the<br />\ngalaxy. When they came to take specimens from the Earth, they knew that<br />\nTommy the Human would be an easy target. but what they didn&#39;t know was<br />\nthat the weirdest aliens around had made friends with him and were<br />\nliving in his home!</p>\n<p>Gumpers now has to find his Alien friends, rescue Tommy and get back to<br />\nEarth…. All five eccentric and wacky Pet Aliens need to work together<br />\nusing their unique abilities to get Tommy home safely. Its time for some<br />\nPet Alien action!</p>\n<p>Play and interact with Gumpers, Dinko, Swanky, Flip and Scruffy as you<br />\nhelp them find their way around the giant spaceship on their rescue<br />\nmission. Your main objective - to find the way through each level to the<br />\nexit. That&#39;s not easy when each level is filled with puzzles, obstacles<br />\nand clever enemies - in other words - teamwork is inalienable!</p>\n<p>Experience cool action and clever puzzles whilst learning the universal<br />\nvalues of friendship, fellowship, sharing, humour and fun! So jump on<br />\nboard and take a spaceship ride with the Pet Aliens - its OUT OF THIS<br />\nWORLD!</p>", "metacritic": null, "released": "2007-07-30", "tba": false, "updated": "2019-09-12T06:37:09", "background_image": "https://media.rawg.io/media/screenshots/aa7/aa7858f402f1f003a93cd497393c7498.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 54, "game_series_count": 0, "reviews_count": 0, "platforms": ["Nintendo DS"], "developers": ["Shin'en"], "genres": ["Action"], "publishers": ["The American Game Factory"], "esrb_rating": null}