{"id": 248765, "slug": "the-journey-surf-game", "name": "The Journey - Surf Game", "name_original": "The Journey - Surf Game", "description": "\"The real surf experience\"  <br/>Surf over 300 waves from around the world, ride boards from the top shapers and style out with well-known brands in The Journey Surf!   <br/><br/>YouRiding The Journey is a free-to-play mobile surf game developed by Intellysurf, the online game developer and publisher of YouRiding since 2007, the surfing and bodyboarding browser game with over 1 million players worldwide!<br/><br/>With an impressive selection of over 300 real waves, stunning graphics and intuitive touch-screen controls, YouRiding The Journey makes it easy to travel the world, ride perfect waves, get barreled and pull off big moves no matter where you are!<br/><br/>\"A delightful resurrection of surf video games\".  - STAB Magazine<br/><br/>\"It’s pretty damn fun, even for a decided non-gamer like myself.\" - Justin Houseman, Surfer Magazine<br/><br/>\"The game is sick fun\". - Matt Wilkinson (Current world number one)<br/><br/>\"Best surf game ever! Finally, someone decided to come out with a real surf game. This is by far the best surfing game app out there! Nothing even gets close.\" - Player - Terry Weissman <br/><br/>FEATURES<br/>-Free to play<br/>- Over 300 real waves including Pipeline, Teahupoo, Mundaka, Snapper Rocks and Trestles<br/>- Real-life physics that create realistic riding moves like the power carve, nosepick, tailblow and airs<br/>- Customization with real products from such brands like Superbrand, Quiksilver, Rip Curl and more<br/>- Detailed tutorials and riding tips from real pros and world champions including Matt Wilkinson, Kanoa Igarashi, Ry Craike, Balaram Stack and many more<br/>- Ability to invite your friends to play online<br/>- Constant graphics enhancement and updates, as well as optimization for various devices<br/><br/>Download The Journey now for FREE!<br/><br/>Languages supported:<br/>- English<br/>- Portuguese<br/>- Spanish<br/>- French<br/><br/>\"Never Stop Riding\"<br/><br/>Follow us on social media: @YouRidingGames<br/>For more information please visit: http://www.youriding.com", "metacritic": null, "released": "2016-06-20", "tba": false, "updated": "2019-10-22T14:12:16", "background_image": "https://media.rawg.io/media/screenshots/b13/b134d89ea64e51055df71dd63114aaa8_CYcCOCG.jpg", "website": "http://www.youriding.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 147, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Intellysurf"], "genres": ["Adventure", "Sports"], "publishers": ["Intellysurf"], "esrb_rating": "Everyone 10+"}