{"id": 24877, "slug": "harry-potter-and-the-order-of-the-phoenix", "name": "Harry Potter and the Order of the Phoenix", "name_original": "Harry Potter and the Order of the Phoenix", "description": "<p>The close and synergistic relationship between book, film and videogame<br />\nis more defined in the Harry Potter and the Order of the Phoenix<br />\nvideogame than ever before. Players will be able to explore the many key<br />\nlocations within Hogwarts in minute detail, each one a visual match to<br />\nits film equivalent, while being engrossed in the thrilling adventures<br />\noutlined in the rich narrative of the book.</p>\n<p>In Harry Potter and the Order of the Phoenix, Harry returns for his<br />\nfifth year of study at Hogwarts and discovers that much of the wizarding<br />\ncommunity has been denied the truth about the teenager’s recent<br />\nencounter with the evil Lord Voldemort. Fearing that Hogwarts’ venerable<br />\nHeadmaster, Albus Dumbledore, is lying about Voldemort’s return in order<br />\nto undermine his power and take his job, the Minister for Magic,<br />\nCornelius Fudge, appoints a new Defense Against the Dark Arts teacher to<br />\nkeep watch over Dumbledore and the Hogwarts students. But Professor<br />\nDolores Umbridge’s Ministry-approved course of defensive magic leaves<br />\nthe young wizards woefully unprepared to defend themselves against the<br />\ndark forces threatening them and the entire wizarding community, so at<br />\nthe prompting of his friends Hermione and Ron, Harry takes matters into<br />\nhis own hands. Meeting secretly with a small group of students who name<br />\nthemselves “Dumbledore’s Army,” Harry teaches them how to defend<br />\nthemselves against the Dark Arts, preparing the courageous young wizards<br />\nfor the extraordinary battle that lies ahead.</p>\n<p>With the ability to play multiple characters, including Harry Potter,<br />\nDumbledore and Sirius Black, the videogame of Harry Potter and the Order<br />\nof the Phoenix offers fans the opportunity to wield a wand, explore all<br />\naround Hogwarts and experience one of the most exciting and dangerous<br />\nyears in the life of the Boy Who Lived.</p>", "metacritic": 65, "released": "2007-06-15", "tba": false, "updated": "2024-04-13T05:35:29", "background_image": "https://media.rawg.io/media/games/5e1/5e1b388efe99ea9561363262fda06f23.jpg", "website": "http://www.masterthemagic.com", "rating": 3.52, "rating_top": 4, "added_by_status": {"yet": 18, "owned": 170, "beaten": 239, "toplay": 28, "dropped": 76, "playing": 4}, "playtime": 18, "achievements_count": 41, "ratings_count": 205, "suggestions_count": 606, "game_series_count": 10, "reviews_count": 206, "platforms": ["Wii", "Nintendo DS", "PC", "Xbox 360", "PlayStation 2", "PlayStation 3", "PSP", "Game Boy Advance", "Classic Macintosh"], "developers": ["Electronic Arts", "Electronic Arts Bright Light", "Electronic Arts UK"], "genres": ["Action", "Adventure", "Arcade"], "publishers": ["Electronic Arts"], "esrb_rating": "Everyone 10+"}