{"id": 248797, "slug": "jellyfish-aquarium-free", "name": "Jellyfish Aquarium Free", "name_original": "Jellyfish Aquarium Free", "description": "Over one million downloads worldwide!<br/>Introducing the 「Jellyfish」 to this already popular game!  FREE DOWNLOAD!  It's real easy to raise your own pet in this game!!<br/><br/>■Raise your own Jellyfish on your smartphone.<br/>■Watch how cute your Jellyfish moves.  It's so soothing and therapeutic.<br/><br/>[Instructions]<br/>This is a virtual pet app where you can raise your very own Jellyfish on your smartphone.  It`s so easy to raise.  Just feed your pet once every four days and clean its home once a week.  This game app is great for kids and people who find RPG's and puzzle games a bit tedious.  Try this game out!  It's therapeutic, and a great way to kill time!<br/><br/>[Basic Functions]<br/>・It's simple to raise.  Just remember to feed you Jellyfish and clean its home.<br/>・Like a real Jellyfish, it moves around in such an adorable way.<br/>・You can call over your Jellyfish by tapping on the screen.  Look at how adorable this is!<br/>・You can give your Jellyfish a name.  You can give it a new name at anytime.<br/>・Your Jellyfish grows in realtime.  The growth of your pet is calculated by every 0.5 second.  <br/>・The game records how much your pet has grown since the last time you visited it.<br/>・You can take a picture of your Jellyfish with your mobile device and share it with your friends over various social networking sites.<br/>・The app also can send you notifications to let you know when your pet needs feeding and cleaning.<br/>・You can even transfer your pet's data to a new device so that you can keep the same pet even after you change your mobile device.<br/>・All of these functions are free and do not require any microtransactions!<br/><br/>[Recommended for:]<br/>・people who have always wanted a Jellyfish or already have one and want a virtual Jellyfish to spend time with everywhere and at anytime<br/>・people who love visiting the zoo and aquariums<br/>・people who love raising virtual pets<br/>・people who want a simple game to pass their free time with something fun", "metacritic": null, "released": "2015-10-31", "tba": false, "updated": "2019-10-22T14:12:17", "background_image": "https://media.rawg.io/media/screenshots/9e1/9e11a60cd6e80c8274dcafdf7a5ba17b_p8AGfdz.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 29, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Hiroki Yamada"], "genres": [], "publishers": ["Hiroki Yamada"], "esrb_rating": "Everyone 10+"}