{"id": 248767, "slug": "the-journey-bodyboard-game", "name": "The Journey - Bodyboard Game", "name_original": "The Journey - Bodyboard Game", "description": "The best bodyboarding game just got better with enhanced graphics, animations, and more product!  Play for Free! <br/><br/>\"The real bodyboard experience\"<br/> <br/>YouRiding The Journey is a free-to-play mobile bodyboard game developed by Intellysurf, the online game developer and publisher of YouRiding since 2007, the surfing and bodyboarding browser game with over 1 million players worldwide!<br/><br/>With an impressive selection of over 300 real waves, stunning graphics and intuitive touch-screen controls, YouRiding The Journey makes it easy to travel the world, ride perfect waves, get barreled and pull off big moves no matter where you are!<br/><br/>\"The best bodyboarding game\"<br/><br/>\"More than 300 real waves with real moves and real gear? You can’t do better than that!\"<br/><br/>\"Not only is this game fun and addictive but I’m also becoming a better bodyboarder in real life!\"<br/><br/>FEATURES<br/>- Over 300 real waves including Pipeline, Teahupoo, Mundaka, El Fronton and The Wedge<br/>- Real-life physics that create realistic riding moves like the backflip, invert air, air forward and ARS<br/>- Customization with real products from such brands like Pride Bodyboards, Hubboards, Science and more<br/>- Detailed tutorials and riding tips from real pros and world champions including Pierre-Louis Costes, Mike Stewart, Jeff Hubbard, Jared Houston and many more<br/>- Ability to invite your friends to play online<br/>- Constant graphics enhancement and updates, as well as optimization for various devices<br/><br/>Download The Journey now for FREE!<br/><br/>Languages supported:<br/>- English<br/>- Portuguese<br/>- Spanish<br/>- French<br/><br/>\"Never Stop Riding\"<br/><br/>Follow us on social media: @YouRidingGames<br/>For more information please visit: http://www.youriding.com<br/>Any problem? support@youriding.com", "metacritic": null, "released": "2015-07-06", "tba": false, "updated": "2019-10-22T14:12:16", "background_image": "https://media.rawg.io/media/screenshots/41c/41c153186bf6fee7a66c9be41f05d010.jpg", "website": "http://www.youriding.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 149, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Intellysurf"], "genres": ["Adventure", "Sports"], "publishers": ["Intellysurf"], "esrb_rating": "Everyone 10+"}