{"id": 248838, "slug": "stickman-shooter-elite-strike", "name": "Stickman Shooter Elite Strike", "name_original": "Stickman Shooter Elite Strike", "description": "On a dangerous special forces mission behind enemy lines, your elite strikeforce was captured. As the only member of your team who has evaded capture, it’s your job to infiltrate the prison, shoot &amp; kill the enemies and free your squad! <br/><br/>Armed with an experimental assault rifle with ricochet bullets, you’ll use your accuracy and marksman skills to kill the enemy soldiers and free your squad from the cages in this intense, exciting new stickman shooter. You’ll only have a limited number of bullets for each stage, so use them wisely!<br/><br/>Shooting enemy soldiers isn’t the only way to kill them, though. Using your environment to your advantage, there are a variety of ways to dispatch your enemies. Don’t have a clean shot? Bounce your bullet off the wall to hit them! <br/><br/>-------------------------------------------------<br/>STICKMAN SHOOTER: ELITE STRIKEFORCE – HIGHLIGHTS<br/>-------------------------------------------------<br/>- 240 challenging special forces missions<br/>- Shoot the enemy soldiers &amp; free your squad from capture<br/>- Use an experimental assault rifle with ricochet bullets<br/>- Try Weapons and Characters in an Empty Room.<br/>- Weapons are now more powerful.<br/>- Bounce your bullets off walls &amp; use the environment to your advantage<br/>- Kill all enemies &amp; free prisoners using a limited number of bullets<br/><br/>Do you have the accuracy, skill and tactical awareness to kill the enemy and get your special forces squad to safety? With over 240 challenging levels, our hottest new stickman shooter will have you entertained for hours! <br/><br/>RESCUE THE ELITE STRIKEFORCE &amp; DEFEAT YOUR ENEMY – DOWNLOAD TODAY!", "metacritic": null, "released": "2018-06-09", "tba": false, "updated": "2019-10-22T14:12:19", "background_image": "https://media.rawg.io/media/screenshots/2f8/2f86ef0721fbb27f3aa8ea9e2fa44aac_oXKP9xE.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 148, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Adnan Raoof", "Syed Muneeb"], "genres": ["Action", "Arcade", "Casual"], "publishers": ["Adnan Raoof", "Syed Muneeb"], "esrb_rating": null}