{"id": 248876, "slug": "cricket-power-play-lite", "name": "Cricket Power-Play Lite", "name_original": "Cricket Power-Play Lite", "description": "Are you ready to step into the league of the most devastating batsman in the game? <br/><br/>Terrorize the bowlers with your big-hitting skills during the Power-Play overs, in this exciting, realistic and feature packed cricket game! Choice of teams, customizable and easy-to-play interface options, separate practice mode, global leaderboards and immersive graphics make Cricket Power-Play a must have game for every Cricket fan on the iOS.<br/><br/>Interface options - A choice of conventional control buttons as well as option to \"swipe\" your batting shots. These controls can be positioned on either side of the screen depending on your preference for a left-handed or right-handed layout.<br/><br/>Team flags - Choose your team and the opponents from a list of the top cricketing nations of the world<br/><br/>Practice Mode - Use the built in Net Practice mode to get the feel of correct timing and shot selection for each type of delivery that is bowled<br/><br/>Check out the game's support page using the link below, to get a better idea of how to use the batting controls.<br/><br/>This is the Lite version (ad-sponsored) of the Cricket Power-Play game with 5 overs of match-play and 3 wickets in hand. You can purchase the full version (with no ad popups)  to enjoy additional features such as access to team-wise global high scores, cheerleaders, and 15 overs of match-play with 10 wickets in hand.", "metacritic": null, "released": "2010-06-05", "tba": false, "updated": "2019-10-22T14:12:20", "background_image": "https://media.rawg.io/media/screenshots/e2f/e2fd8e188458a9fb350c9cfce4a777af_ZmC2fQl.jpg", "website": "http://veplapps.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 45, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Vaibhav Electronics Pvt"], "genres": ["Simulation", "Sports"], "publishers": ["Vaibhav Electronics Pvt"], "esrb_rating": "Everyone 10+"}