{"id": 248837, "slug": "dirt-bike-stunt-master", "name": "Dirt Bike Stunt Master", "name_original": "Dirt Bike Stunt Master", "description": "Do you have a passion to race in fast-paced Bikes Racing 3D games? Everything you love about Dirt Bikes brought to life in this awesome racing Dirt Bike Stunt Master game. This Stunt bikes racing game is for free!<br/><br/>Dirt Bike Stunt Master has a realistic stunt and real bike physics difficult tricky path road track. Take sharp turn on the rally road to finish to the checkpoint. Collect all checkpoints to complete your track. You collect coins to unlock other Dirt bikes too.<br/><br/>This game has a real game play. Each level is more challenging and exciting than the other. And perform some daring stunts!<br/><br/>Drive your dirt bike over crazy dirt bike tracks with rocks and obstacles to navigate, can you complete all the levels? Each level is more challenging and exciting than the other. And perform some daring stunts! Then this fast speedy racer Dirt Bike Stunt Master is yours for free now!<br/><br/>Dirt Bike Stunt Master is a 3D Dirt Bike Racing Game, where you perform big jumps and Stunts set in a junk yard type biking course. Enjoy exciting levels with realistic motorcycle physics and amazing graphics that are perfectly optimized for high-resolution devices.<br/><br/>Features:<br/>- 6 different tracks to play<br/>- Amazing Bike physics<br/>- Game Play like a 3D Motor Bike Simulator<br/>- Challenging obstacles and courses<br/>- 3 different dirt bikes to choose from <br/>- Tricky and tough Levels to keep you Playing<br/>- Great HD graphics and visuals.", "metacritic": null, "released": "2017-05-15", "tba": false, "updated": "2019-10-22T13:53:03", "background_image": "https://media.rawg.io/media/screenshots/3ca/3ca3bcc786d5b65f64e26bd553a21e2b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 152, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Adnan Raoof", "Syed Muneeb"], "genres": ["Adventure", "Racing"], "publishers": ["Adnan Raoof", "Syed Muneeb"], "esrb_rating": null}