{"id": 248864, "slug": "syzygy-tablebase-5-pieces", "name": "Syzygy Tablebase - 5 Pieces", "name_original": "Syzygy Tablebase - 5 Pieces", "description": "Syzygy Chess Tablebase is a companion app with SmallFish (running the Stockfish engine). Download this app to import 5-men tablebase files into SmallFish. You can also import your own Syzygy files with iTunes.<br/><br/>Please read the following description carefully.<br/><br/>-----------------<br/>SYZYGY BUNDLE<br/>-----------------<br/><br/>This app bundles all 5-men Syzygy tablebase piece configurations. You may also want to download 6-men tablebase files (search \"Syzygy Tablebase\" on the App Store).<br/><br/>----------------<br/>REQUIREMENTS<br/>----------------<br/><br/>This app is a 1GB download. You will need the following:<br/><br/>- The SmallFish chess app - running the Stockfish engine<br/>- 1GB disk space for this app<br/>- Another 1GB disk space to process the tablebase files<br/><br/>You will need at least 2GB disk space to run this app. <br/><br/>--------------<br/>DESCRIPTION<br/>--------------<br/><br/>Syzygy endgame tablebase is a massive database that contains pre-calculated exhaustive analysis of chess endgame positions. The tablebase is able to tell you whether your position is a win, loss or draw instantly, without running lengthly analysis.<br/><br/>The latest Stockfish 8 chess engine provide support of the new Syzygy tablebase format. You should use this app:<br/><br/>- Improve your Stockfish analysis and performance<br/>- Check distance to the nearest checkmate<br/>- Import your own Syzygy files with iTunes<br/>- Integrate tablebase with the SmallFish chess app (it's free)<br/><br/>The tablebase bundled with this app should bring about 50 ELO improvement to the Stockfish engine and is recommended for all serious players.", "metacritic": null, "released": "2017-01-07", "tba": false, "updated": "2019-10-22T14:12:19", "background_image": "https://media.rawg.io/media/screenshots/932/932e782dcd020d6965b4ef909676a211_zvm7ksN.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 45, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Ted Wong"], "genres": ["Board Games", "Puzzle"], "publishers": ["Ted Wong"], "esrb_rating": null}