{"id": 248873, "slug": "archer-mania", "name": "Archer Mania", "name_original": "Archer Mania", "description": "\"Archers - Take your mark. Ready on Line\".  <br/><br/>Test your skills as a marksman in the centuries old sport of Archery. Work your way through the grueling levels, negotiating wind conditions, barriers and moving targets. <br/><br/>***************<br/>A big thanks to all our customers who have written in over the years, with suggestions for the game<br/><br/>Version 7.0 onwards, Archer Mania now comes with an all new and much improved 3D engine for more immersive graphics. All the levels have been refined for improvement, and uniformity across different screen sizes. We have also simplified the game controls - instead of the earlier joystick pad on the screen, you can move your finger or thumb anywhere on the screen to move and aim the bow and arrow. <br/><br/>The Speed Archery rounds are now specifically designed to be played using the Super Bow, that is automatically unlocked (and becomes the default option) when you purchase the Premium Pack within the game. You can however, manually still select either of the Bows to play any level you like. <br/><br/>Check out the new step by step walkthrough in the Tutorial section of the game, in the Main Menu<br/><br/>***************<br/><br/>Archer Mania comes with 10 rounds of classical Target Archery to test your speed and accuracy as you try and hit the Bulls Eye. Each round has different wind conditions and obstacles that you must avoid, to hit the Target.<br/><br/>Additionally, an In App Purchase of the Premium Pack will unlock another 10 rounds of Speed Archery where the race is on to knock down all targets within the given time frame in each round. Once again, each round will have increasingly difficult conditions of wind speed and barriers.<br/><br/>The Premium Pack also unlocks a Super Bow, having stationary sights that allow for more accurate aiming. Purchase of the Premium Pack will also disable ad popups at the end of a round.<br/><br/>Features:<br/>- Realistic 3D look and feel<br/>- 10 challenging rounds of Target Archery<br/>- Game Center enabled for global leader boards and achievements<br/>- Additional 10 rounds of Speed Archery (in the Premium Pack)<br/>- Choice of a Super Bow (in the Premium Pack)<br/>- Adjustable firing controls for left and right handers<br/><br/>The Range is clear … nock and fire!", "metacritic": null, "released": "2012-10-17", "tba": false, "updated": "2019-10-22T14:12:20", "background_image": "https://media.rawg.io/media/screenshots/39a/39a6fbb88b4ffb59fd7d66613f8c3bc4_Sc2f3rs.jpg", "website": "http://veplapps.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 42, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Vaibhav Electronics Pvt"], "genres": ["Simulation", "Sports"], "publishers": ["Vaibhav Electronics Pvt"], "esrb_rating": "Everyone 10+"}