{"id": 248845, "slug": "hero-robot-parking", "name": "Hero Robot Parking", "name_original": "Hero Robot Parking", "description": "Have you ever tried parking a Two Wheeler Robot in your life? What you think it is easy? Not at all. Try your skills now in this amazing super hero Robot Parking 3D Game. <br/><br/>In this Super Hero Robot Parking game, you can choose between 3 different robots, plenty of parking lot levels and unlimited entertainment. You will have different environments including military grounds, Shipping port and junk yards. Parking a robot becomes a serious challenge in these tough environments where weather conditions won’t be of your choice and there will be lot of hurdles in the way! Do you think you can park the Giant Robot in every situation? Challenge yourself by trying to be as quick as you can, as some levels are time based.<br/><br/><br/>Super Hero Robot Parking is an interesting, casual and fun game in which you have to park a robot on its destination. Moving through beautifully designed levels and avoiding different obstacles in it's way makes it a challenging but adventure game.<br/><br/>You have to ensure that your robot safe from Lasers, chemical drums, Enemy Missiles, explosive Rockets, Leak gas pipes, Black holes and many other hurdles. Collect coins on your way so that you can unlock different types of Robots <br/><br/>You will forget car parking and bus parking because superhero robot parking is here with whole new perspective.", "metacritic": null, "released": "2017-04-19", "tba": false, "updated": "2019-10-22T14:12:19", "background_image": "https://media.rawg.io/media/screenshots/d97/d974d39b1e24dae9a7119eb825de8bea.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 161, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Adnan Raoof", "Syed Muneeb"], "genres": ["Simulation"], "publishers": ["Adnan Raoof", "Syed Muneeb"], "esrb_rating": null}