{"id": 248833, "slug": "pheasant-bow-hunting-safari", "name": "Pheasant Bow Hunting Safari", "name_original": "Pheasant Bow Hunting Safari", "description": "Welcome to the most actual Pheasant Bow Hunting Safari: Birds Shooting Game 18 on apple apps Store. Its really awesome hunter game to hunt pheasant bird in different environments. This is a new released action &amp; adventurous hunting pheasant game. You can play an extremely realistic game in beautiful environment. Now you can enjoy flying real Pheasant Bow Hunting Safari adventure in a jungle safari with grassy and sand effect, island and the mountain where you can hunt pheasant with bow, crossbow, hmg and gatling(mini machine gun). You can select your environment from main menu in which you want to play. Enjoy the latest hunting game by getting hunting experience of pheasant bird. Download the action packed thrilling &amp; adventurous hunting season 2018 game to improve feather huntsman skills. Game is so addictive &amp; multi-level game with an aim to offer real target shooting experience. Enjoy the unique shooting and most adventure thrilling and action-packed game. Game have one of the most addictive hunts missions and stylized HD stunning graphics and wonderful realistic bow, crossbow, HMG and Gatling Gun (mini machine gun) is specially designed for your imagination. This is actual 3D amazing graphics make you fell immersive. If you are a fan of hunting games then play this game on apple apps store.<br/><br/><br/>Aim accurately to hunt the flying pheasant birds with bow as a Bow hunter and get real bird shooter &amp; wings hunting target experience in a beautiful 3D environment. Enjoy the latest crossbow &amp; gatling gun hunt game by shooting pheasant bird. Perfect day to hunt pheasant with an eagle-eye. Hunt down your bird targets and make the most of hunting season 2018. Pheasant Bow Hunting Safari: Birds Shooting Game 18 is a super addictive bird hunting game to improve real huntsman target skills.<br/><br/>Features Of Pheasant Bow Hunting Safari: Birds Shooting Game 18<br/><br/>- Stunning Pheasant Birds and high-quality 3D graphics<br/>- Realistic controls for best target shooting experience<br/>- 10 action packed and challenging bird hunting missions<br/>- Best hunter experience by shooting pheasant bird with Bow &amp; Crossbow<br/>- Included HMG (Heavy Machine Gun) &amp; Gatling Gun (mini machine gun) for great fun of Bird Hunting<br/><br/><br/>Download Pheasant Bow Hunting Safari: Birds Shooting Game 18 on your Iphone or Ipad and have unlimited fun by shooting flying birds.", "metacritic": null, "released": "2018-07-29", "tba": false, "updated": "2019-07-15T03:24:28", "background_image": "https://media.rawg.io/media/screenshots/327/327cfd682e1549b48a5346f177cb010a_Pny5kOg.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 140, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Muhammad Abdullah"], "genres": ["Action", "Simulation"], "publishers": ["Muhammad Abdullah"], "esrb_rating": null}