{"id": 248863, "slug": "ninja-hop-endless-double-jump", "name": "Ninja Hop: Endless Double Jump", "name_original": "Ninja Hop: Endless Double Jump", "description": "Are you ready to embark on the next step of your ninja training? Do you have what it takes to complete the impossible task and jump up the endless tower? <br/><br/>Play as a stickman ninja with a seriously awesome taste in music as you jump from platform to platform, climbing the endless tower in this endless jump game. The tower is full of dangerous enemies including ghosts, zombies, spear-wielding maniacs and more! <br/><br/>It’s easy to play with simple one touch controls - tap to jump over the enemies and avoid them, or tap and hold to double jump and jump up to the next platform. Touch them and it’s game over, unless you pick up a shield. <br/><br/>Keep jumping.. and jumping.. and jumping! Collect coins as you climb the tower to unlock new costumes including Santa, master ninja, pizza delivery boy, soldier and much more! <br/><br/>Endless jumping means endless fun – jump as high as you can to get the highest score possible and compete against other players on the global leaderboard. <br/><br/>------------------------------------------------<br/>NINJA HOPPER: HIGHLIGHTS<br/>------------------------------------------------<br/>• Simple one touch controls. Tap to jump, tap and hold to double jump.<br/>• Collect coins &amp; unlock 9 different costumes<br/>• Find shields to protect you against enemies<br/>• Seriously funky soundtrack! <br/>• Compare your scores and compete against others on the leaderboard<br/>• Endless game play – endless fun! <br/>• Complete unique challenges to earn special achievements<br/><br/>Ready for some fast-paced endless jumping fun? Entertain yourself for hours with Stick Ninja Hop and see how many platforms you can climb!", "metacritic": null, "released": "2017-12-22", "tba": false, "updated": "2019-10-22T14:12:19", "background_image": "https://media.rawg.io/media/screenshots/5f3/5f33b8a362fcf9be82ea8ac03d6df385.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 72, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Adnan Raoof"], "genres": ["Arcade"], "publishers": ["Adnan Raoof"], "esrb_rating": "Everyone 10+"}