{"id": 24892, "slug": "pogo-island", "name": "Pogo Island", "name_original": "Pogo Island", "description": "<p>\n      Easy to pick-up and hard to put down! EA’s Pogo™ Island embodies the \n      spirit of casual gaming, offering an addictive Nintendo DS compilation \n      of Pogo.com™ favorites that will entertain for hours on end.\n    </p><p>\n</p><p>\n      Pogo Island pushes the phenomenon of online casual gaming to new fronts. \n      The title marks the debut of Pogo.com, the stickiest online gaming site, \n      on a portable console. Through the quick-play option, five of the most \n      popular games from Pogo.com—Word Whomp™, Poppit!™, Phlinx, Tri-Peaks \n      Solitaire and Squelchies— are made accessible to play anywhere and \n      everywhere. Each game has been reskinned to an island theme and delivers \n      the same engrossing and stimulating gameplay that has already captivated \n      millions online.\n    </p><p>\n</p><p>\n      Complementing the quick-play option is a story mode that integrates all \n      five Pogo games and their associated mascots into an island-wide \n      adventure. Playing as Perry the Parrot Captain, your objective is to \n      navigate through the island game board, reunite with each mascot, and \n      along the way, collect tools and supplies that will help you repair your \n      boat and leave the island. As you successfully tackle the gameboard, you \n      will be earning tokens that not only translate into bragging rights \n      amongst your peers but they can also be transferred to Pogo.com where \n      they can be used to enter frequent cash drawings*.\n    </p><p>\n</p><p>\n      Pogo Island uses the technology of the Nintendo DS to deliver \n      ultra-bright dual screens which provide for an amplified gaming \n      experience. Meanwhile, the simplicity of the touch-screen controls makes \n      for increased user accessibility and a minimal learning curve.\n    </p><p>\n      As of May 20, 2014, the Nintendo Wi-Fi Connection service for Nintendo \n      DSi and Wii systems has been retired. Online features of this game are \n      no longer available after this date but this game still provides an \n      entertaining experience in offline mode.\n    </p><p>\n      To learn more about this service change, please visit To learn more \n      about this service change, please visit support.nintendo.com/servicesupdate.\n    </p>", "metacritic": null, "released": "2007-03-26", "tba": false, "updated": "2022-08-27T05:16:56", "background_image": "https://media.rawg.io/media/screenshots/629/62934fe157a0ac2ed7df86a3b7d79217.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 96, "game_series_count": 0, "reviews_count": 1, "platforms": ["Nintendo DS"], "developers": [], "genres": [], "publishers": ["Electronic Arts"], "esrb_rating": null}