{"id": 248933, "slug": "pinochle-pro", "name": "Pinochle Pro", "name_original": "Pinochle Pro", "description": "Tired of playing pinochle games with unintelligent players?  Then this is your game.  We have painstakingly tested and improved the artificial intelligence. Pinochle Pro is the best 4 handed single deck pinochle game available for the iPad iPhone and iPod Touch. <br/><br/>••••• Finally, a great pinochle game!... \"Oldsoul12\"<br/>••••• I play this game every day! love it! \"sabinlvr10\"<br/><br/>• Partners bid when they have a good hand, pass when they dont.  <br/>• Partners know when to over bid you and when to not.<br/>• Partners know when to break up their own meld and when not to.<br/>• \"Ive Got the Rest\" is a great option to toss in the rest of the cards if you can take all the remaining tricks.<br/>• Give it a try and if you find ANYTHING that you are not satisfied with, Please let us know through our support email.  We very actively make improvements<br/><br/>Additional Features<br/>• Features animated characters that talk and respond to the game! Play against Jed the cowboy or grumpy old Grandpa Bob. Watch your opponents get frustrated when you win! <br/>• 5 animated characters in full retina support <br/>• Settings to match how you play the game including - passing 3 or 4 cards, allowing peek or no peek, and more <br/><br/>Check out the free version of the app for a chance to try the app out before you buy.", "metacritic": null, "released": "2012-09-13", "tba": false, "updated": "2019-07-30T07:26:14", "background_image": "https://media.rawg.io/media/screenshots/e73/e73f541d795fc50f7d991dd2c21dec44.jpg", "website": "http://www.blackpanthersoftware.com/home/pinochlepro", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 122, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Black Panther Software"], "genres": ["Strategy", "Card"], "publishers": ["Black Panther Software"], "esrb_rating": null}