{"id": 24908, "slug": "fullmetal-alchemist-dual-sympathy", "name": "Fullmetal Alchemist: Dual Sympathy", "name_original": "Fullmetal Alchemist: Dual Sympathy", "description": "<p>For Edward to possess the Philosopher&#39;s Stone, he has to go through the<br />\nevil Homunculi in the first Fullmetal adventure for Nintendo DS!</p>\n<p>Features</p>\n<p>Six playable characters: Edward or Alphonse Elric, Roy Mustang, Alex<br />\nLouis Armstrong, Izumi and Scar</p>\n<p>Perform devastating melee and combo attacks</p>\n<p>Release powerful alchemy attacks with the Nintendo DS touch screen</p>\n<p>Explore the Fullmetal Alchemist story that features the same voice<br />\ncast from the Cartoon Network TV series</p>\n<p>More than 10 touch screen mini-games, including “Whack-A-Homunculus”<br />\nand “Fullmetal vs. Flame”</p>\n<p>Tons of unlockable content including talking character alarms, image<br />\ngalleries, and video and sound libraries</p>\n<p>Who knew science kicked so much butt? Brawling is the formula for<br />\nFullmetal Alchemist: Dual Sympathy, a side-scrolling action game that<br />\nputs players in the role of Edward Elric, the Fullmetal Alchemist, on a<br />\njourney to combat the evil Homunculi and acquire the fabled<br />\nPhilosopher’s Stone.</p>\n<p>Alchemy might be hard, but controlling Fullmetal Alchemist is easy. You<br />\npress A to attack and B to jump. Players can execute different attack<br />\ncombos, but make no mistake: the game&#39;s formula calls for tons of<br />\nbrawling.</p>\n<p>The most valuable attacks come from the DS touch screen. Each of the six<br />\nplayable characters have special attacks, and to activate them, all<br />\nyou&#39;ll need to do is touch the appropriate icon on the touch screen.<br />\nEdward, for example, can put up walls and produce an explosion from a<br />\ncannon. To activate these attacks, you&#39;ll just need to touch the<br />\nrespective icon.</p>\n<p>As you fight through each level, you&#39;ll occasionally come across<br />\ntouch-screen challenges. You won&#39;t need to do this on-the-fly, which is<br />\nimportant to note. The game will stop and let you prepare for the<br />\nchallenge. In one challenge, for example, you&#39;ll need to untie a<br />\nkidnapped person.</p>\n<p>Bottom Line<br />\nAlthough this game will mainly appeal to Fullmetal<br />\nAlchemist fans, those who like brawlers should give it a look.</p>", "metacritic": 58, "released": "2006-12-12", "tba": false, "updated": "2022-12-07T13:08:12", "background_image": "https://media.rawg.io/media/games/320/32023ad4be0a257aed3b9b44d15b261f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 2, "beaten": 2, "toplay": 2, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 304, "game_series_count": 12, "reviews_count": 3, "platforms": ["Nintendo DS"], "developers": ["NATSUME"], "genres": ["Action"], "publishers": ["Destineer", "Bandai"], "esrb_rating": "Teen"}