{"id": 249057, "slug": "alleys", "name": "Alleys", "name_original": "Alleys", "description": "Alleys is an adventure experience in which the player explores a theme park world full of quaint alleys that would fit perfectly in small towns in the English countryside. The gameplay is simple, with fewer of the complicated elements often found in puzzle games. All the player needs to do is to search for passageways, gather resources, and get immersed in the exquisite graphics and noir atmosphere. The player is free to choose where to go and can solve puzzles in any order to escape.<br/><br/>Background Story of Game:<br/>Alleys is a large-scale escape room hosted by a theme park, and the player is a tourist who has decided to take part in the escape experience. The player wanders through a fictional old English-style town, collects resources, solves puzzles, and overcomes obstacles to gradually discover the backstory woven throughout the alleys. In the end, the player finds the exit gate and escapes.<br/><br/>MAIN FEATURES:<br/><br/>1. Alleys Exploration<br/>The players must find the way through complicated alleys, buildings, and sewers.<br/><br/>2. Check in to Proceed<br/>Accumulate points by activating the check-in stations found in new locations. Certain areas require a specific number of points to enter.<br/><br/>3. Freely Choose Your Route<br/>Alleys is a non-linear adventure puzzle game with no predetermined route. The player is free to explore and can escape the game as long as the conditions required to open the town exit gate are fulfilled.<br/><br/>4. Collect Resources<br/>Player decides how to use the keys and other resources collected in the game. The decisions the player makes will affect the difficulty of the game.<br/><br/>5. Solve Riddle on Tool Cards<br/>Every Tool Card is its own little riddle. Figure out the meaning of the illustration to find out what the card can be used for.<br/><br/>6. Simple Controls<br/>No need for virtual controllers—just swipe and tap to easily move around and interact with items.", "metacritic": null, "released": "2018-05-16", "tba": false, "updated": "2019-08-02T02:43:45", "background_image": "https://media.rawg.io/media/screenshots/e96/e969d3b72c44abfc3f311b572755c1c0.jpg", "website": "http://alleys.tw", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 211, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tilt Games", "THEMEr"], "genres": ["Adventure", "Puzzle"], "publishers": ["SHANGHAI QIAOBI INFORMATION TECHNOLOGY CO", "THEMEr Design"], "esrb_rating": null}