{"id": 249009, "slug": "rhythm-world", "name": "Rhythm World", "name_original": "Rhythm World", "description": "※ It's been a year, we are keeping update, multiplayer battle system is ready！ ※ <br/>\"Rhythm World:Master Project\" is a battleable music game developed by EXD team. It's combined with advanced judgement algorithm and 3D track. Rhythm world will give you a whole new experience of music game! <br/><br/>※Online multiplayer battle※ <br/>Come and battle with your friends！\"Tentacles power\" will be the most powerful prove of your strength！ <br/><br/>※Time Cross Battle mode※<br/>You can battle with other in any time in any where, your records will be inside the \"Time Cross Space\" too.<br/><br/>※Original Mix mode※<br/>Play Hex mode and mania mode in single level with seamless switching， one level may comes with two challenge. Maybe you can't get used to it in the first place, but why not challenge your limits?<br/><br/>※Full replay support※<br/> Do you want to replay your operations? Now you can see your replay or others in the ranking board. <br/><br/>※Permanent updates of the stories and songs※ <br/>We guarantee that each piece of music that can join this game goes through the strict selection, even the different operation mode comes with different beatmaps.<br/>The story content is just starting, it will be updated constantly, don't miss every update.<br/>Song library includes free song library and paid song packs, these songs will be updated constantly too. We also hope that musicians who are willing to join our games will contact us.<br/><br/>※Free beatmap editor，share your own beatmaps with others※<br/>We provide free beatmap editing tool \"Rhythm Beatmap Editor\"<br/>You can get the download link in game.(Only support PC)<br/>You can share beatmaps with others(*Custom Library feature should be unlocked to import beatmaps)<br/><br/>※The two developers are working hard※<br/>If you have any advise, please contact us. We will reponse ASAP.<br/>If you like this game, please give us five star rating.", "metacritic": null, "released": "2018-08-26", "tba": false, "updated": "2021-02-12T04:54:29", "background_image": "https://media.rawg.io/media/screenshots/344/34406e03f28ffcc1052ffc947f011bfd_IsyQzqD.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 208, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["Jin Yonghui"], "genres": ["Simulation"], "publishers": ["Jin Yonghui"], "esrb_rating": null}