{"id": 249102, "slug": "bar-oasis", "name": "Bar Oasis", "name_original": "Bar Oasis", "description": "The lastest instalment in the Bar Oasis is OUT NOW!!!<br/>https://itunes.apple.com/us/app/bar-oasis-2-aftertaste-01/id1070716801?mt=8<br/><br/>The original instalment of the critically acclaimed unique visual novel meets time-management game series Bar Oasis. <br/><br/>Enjoy the story of Bar Oasis in the visual novel styled STORY MODE as Victor Johnson (Vic) stumbles into a bar with a 'Wanted' sign and get a job as a bartender despite having no experience behind the bar. Once behind the bar at Bar Oasis, Vic is forced to learn the tricks of the trade quickly thanks to the manager (Boss) who's often absent. While working his butt off, he befriends the regulars of Bar Oasis, Mark the photographer, Sheila the actress, Desree the accountant, Alex the 007 wannabe, Vicky the party girl, Kane the biker, Mr. Robinson the square, as well as the actual owners or the bar - the Grumps. And as is generally the case with any bartender, Vic ends up hooking up with one or two clients, with mixed results. Vic (you) is caught in the middle of it all, doing his best to run the bar, listen to everyone’s problems and also try to deal with his own life too! Welcome to the weird and wonderful world of Bar Oasis, just have a seat and drink it all in!<br/><br/>Learn how to make around 100 real drinks that're served in bars around the world with easy-to-follow instructions in the MAKE DRINKS. Even the over 100 liquors and ingredients used to make the drinks are real. liquors! Learn about all the different drinks and liquors and use the drink list and recipes to impress your friends next time you're in a bar, or even making a drink yourself! <br/><br/>Award nominated Bar Oasis soundtracks now available in iTunes Store!!!<br/>https://itunes.apple.com/us/album/bar-oasis-ost/id434920856<br/><br/>Help us make a better sequel!!!<br/>Let us know what you think - we value your questions and comments. Really!!!<br/><br/>Tell us: cornersstudio@gmail.com<br/>Like &amp; follow us: facebook.com/BarOasisEng<br/><br/>DISCLAIMER<br/>This game is intended solely for users of legal drinking age, and is not intended to encourage drinking in any way.<br/>Each user takes full responsibility for making sure that they are of legal drinking age in their respective region.", "metacritic": null, "released": "2011-04-29", "tba": false, "updated": "2019-08-02T04:13:00", "background_image": "https://media.rawg.io/media/screenshots/226/2262b42dbdbd7aa5bbaaf02223150069.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 163, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["Corners Studio Ultramarine"], "genres": ["Adventure", "RPG"], "publishers": ["Corners Studio Ultramarine"], "esrb_rating": null}