{"id": 249162, "slug": "x-mapper-tng-for-x-plane-desktop", "name": "X-Mapper TNG (for X-Plane Desktop)", "name_original": "X-Mapper TNG (for X-Plane Desktop)", "description": "“X-Mapper TNG” is a helper application for X-Plane flight simulator. Connecting to a computer running X-Plane Desktop makes your iPhone/​iPad work as a map tracker for the simulated aircraft. Additionally, by purchasing the Upgrade as a paid add-on, it becomes a more useful flight assistance device including full-equipped avionics panel, flight path display and flight controller with feedbacks.<br/><br/>*This application requires full or demo version of X-Plane 10 or X-Plane 11 Desktop (Mac/​Windows/​Linux). CANNOT be used with X-Plane Mobile for iPhone/​iPad.<br/><br/>MAP TRACKER<br/><br/>The location and the heading of the simulated aircraft will be displayed in the map with an orange icon when network connection established. You may use this feature FOR FREE WITHOUT THE PAID UPGRADE.<br/><br/>AVIONICS PANELS (Upgrade Required)<br/><br/>The full-equipped avionics panel allows you to operate various radio and autopilot equipment sets in simulated aircrafts. It is useful especially for IFR operations that was bothering the pilot in busy. Also, you can setup the autobrake even if omitted in some cockpit panels. <br/><br/>FLIGHT PATH DISPLAY (Upgrade Required)<br/><br/>The flight path of the simulated aircraft is drawn on the map as orange lines. Flight paths for your past flights also remain on the map in dimmed color. You can, however, make them hide, reshow or reset as your preference.<br/><br/>FLIGHT CONTROLLER (Upgrade Required)<br/><br/>Touching and holding on the white slider activates motion sensor that allows you to control your aircraft like as 3-axis joystick. As well, dragging the white cross on the Yoke Pad allows control without the motion sensor. It features;<br/><br/>–Controlling the aileron and the elevator by the tilt of your device or dragging the cursor.<br/>–Controlling the rudder by the slider for taxiing and crosswind takeoff/​landing.<br/>–Releasing off the slider disables the motion sensor and maintains trimmed-neutral.<br/>–Auto-calibrated elevator allows you comfortable tilt-operation.<br/><br/>The flight control is enabled only while touched on, so you may let your device down anytime without unexpected consequence. It is convenient for auxiliary control in IFR flight.<br/><br/>CONTROL FEEDBACKS<br/><br/>Control deflections of the aircraft feedback to the Rudder Sliders and the Yoke Pad where you can monitor the controls from the motion sensor, the auto pilot and joysticks. Also, the black crosses on the sliders and the pad indicate actual deployments of control surfaces. It is useful not only for control aid, but also for monitering art-stabs, FBW and also external control devices. You can observe the feedbacks FOR FREE WITHOUT THE PAID UPGRADE unless you want to manipulate them.<br/><br/>THROTTLE CONTROLLER (Upgrade Required)<br/><br/>With the black slider, you can control the throttle as well as watch the auto-throttle feedback. This smart controller allows you fine tuning of jet engines without expensive dedicated devices. Also, there is a handy reverser button for smooth operation at landing and rejecting takeoff.<br/><br/>AUTOMATED SETUP AND MULTI-DEVICE CONNECTION<br/><br/>Unlike previous versions of X-Mapper series, this application automatically detects an X-Plane running in the network and configures the net settings all by itself. Just launch X-Plane on the computer belongs to the same LAN as your iPhone/​iPad. Also, you can connect multiple iPhone/​iPad devices as many as you have each running X-Mapper TNG at the same time.<br/><br/>GETTING X-PLANE<br/><br/>Desktop (Mac/​Windows/​Linux) version of X-Plane 10 (10.40 or later) or X-Plane 11 is required to use this application: It can’t be used for Mobile (iPhone/​iPad) versions of X-Plane. Open “Obtain X-Plane” from the ⓘInfo Menu for ordering the full version or downloading the free Demo version.<br/><br/>Please refer to help messages in the application for detailed instructions.", "metacritic": null, "released": "2017-01-25", "tba": false, "updated": "2019-10-22T14:12:32", "background_image": "https://media.rawg.io/media/screenshots/aa3/aa3bf6476e957a5c2f52b85b8fef5ce3.jpg", "website": "http://www.mgjshop.co.jp/mgji/en/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 210, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["MGJ Interactive"], "genres": ["Simulation"], "publishers": ["Asahi Technoservice"], "esrb_rating": "Everyone 10+"}