{"id": 249103, "slug": "bar-oasis-2", "name": "Bar Oasis 2", "name_original": "Bar Oasis 2", "description": "The lastest instalment in the Bar Oasis is OUT NOW!!!<br/>https://itunes.apple.com/us/app/bar-oasis-2-aftertaste-01/id1070716801?mt=8<br/><br/>The 2nd instalment of the critically acclaimed unique visual novel meets time-management game series Bar Oasis. <br/><br/>Enjoy the continued story of Bar Oasis in the visual novel styled STORY MODE as Vic returns from Hong Kong in pursuit of his love interest, only to find that Boss had left everything to a rookie girl and did a runner on the job and left the bar to a new girl, Carla. As Vic tries to undo the damages that the bar suffered during his absence, more people join the ranks of regulars at Bar Oasis. Eric the international businessman, Abbott and Costello the fashion gurus, and Risa a neighbourhood street performer. With more regulars on the scene, Vic gets naturally entangled with more people, again with mixed results.  Vic (you) is caught in the middle of it all, doing his best to run the bar, listen to everyone’s problems and also try to deal with his own life too! Welcome to the weird and wonderful world of Bar Oasis, just have a seat and drink it all in!<br/><br/>Learn how to make around 100 real drinks that're served in bars around the world with easy-to-follow instructions in the MAKE DRINKS. There're even some original cocktails made just for the game, such as Boa Noite, Desree and Soul Mate. Even the over 100 liquors and ingredients used to make the drinks are real. liquors! Learn about all the different drinks and liquors and use the drink list and recipes to impress your friends next time you're in a bar, or even making a drink yourself! <br/><br/>Award nominated Bar Oasis soundtracks now available in iTunes Store!!!<br/>https://itunes.apple.com/us/album/bar-oasis-jukebox-2/id548711790<br/><br/>Help us make a better sequel!!!<br/>Let us know what you think - we value your questions and comments. Really!!!<br/><br/>Tell us: cornersstudio@gmail.com<br/>Like &amp; follow us: facebook.com/BarOasisEng<br/><br/>DISCLAIMER<br/>This game is intended solely for users of legal drinking age, and is not intended to encourage drinking in any way.<br/>Each user takes full responsibility for making sure that they are of legal drinking age in their respective region.", "metacritic": null, "released": "2012-07-27", "tba": false, "updated": "2019-08-02T04:09:32", "background_image": "https://media.rawg.io/media/screenshots/c7d/c7d3613e6162d9d0fd8e3ab08d6059a0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 175, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["Corners Studio Ultramarine"], "genres": ["Adventure", "RPG"], "publishers": ["Corners Studio Ultramarine"], "esrb_rating": null}