{"id": 24914, "slug": "monster-4x4-world-circuit", "name": "Monster 4x4: World Circuit", "name_original": "Monster 4x4: World Circuit", "description": "<p>\n      Get ready to pilot the world's most powerful trucks and go head-to-head \n      in pulse-pounding off-road competitions all over the world. Whether \n      you're grinding through the desert of Egypt, crunching up snowy \n      mountains in Russia, or smashing up trees in California to make the ride \n      a little bumpier for the guy behind you, keep your eyes on the prize: \n      the cash you earn on the circuit goes to customize your trucks and build \n      up your ultimate Monster machine.\n    </p><p>\n      Features\n    </p><p>\n      • Super-accessible gameplay with the Wii Remote controller: Perform \n      spectacular stunts, jump and race with your powerful Monsters<br/>• \n      Customize your machine: Personalize your truck's appearance with sweet \n      paint jobs and decals and soup up its performance by maxing out its \n      speed, jumping and destruction capabilities<br/>• Money makes the wheels \n      go round: Win races, unleash spectacular stunts and jumps, and demolish \n      everything in sight to win cash and upgrade your Monster truck to the \n      ultimate stomping machine<br/>• Test your skills on 40 tracks: Tear \n      through 40 Monster events in the hairiest off-road circuits your tires \n      have ever seen<br/>• Show the world what you're made of: Smoke the \n      competition as you blaze through exciting new locations all over the \n      world, such as Egypt, Moscow, Barcelona, San Francisco, South Dakota and \n      more<br/>• Dominate in every mode: Master your tricks in Quick Race mode \n      as you taste all of the thrills, spills, twists and rolls of Monster \n      Truck racing. Then turn up the heat in Single Race or Monster League \n      Championship mode and leave your opponents choking<br/>• Challenge \n      friends to multiplayer: Demolish friends in four-player split-screen \n      races or crush their hopes of domination in four intense new minigames.\n    </p>", "metacritic": null, "released": "2006-11-19", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 1, "platforms": ["Wii"], "developers": [], "genres": [], "publishers": ["Ubisoft Entertainment"], "esrb_rating": null}