{"id": 249184, "slug": "city-street-car-driving", "name": "City Street Car Driving", "name_original": "City Street Car Driving", "description": "Start your engine; fasten your seatbelt, look left then right and then left again and take your car for a spin in this city with a population of 220,000. This is a model society you cannot drive without a driving license. Start taking your driving lessons and finish them without crashing, or disobeying the traffic rules. City Street Car Driving School: Learn to Drive will test your driving skills while following the city traffic laws. You cannot ram into traffic and cannot hit pedestrians. Be careful of the sidewalks and the city decorations. Look for stop signs on pedestrian crossing and stop on red light. Turn on indicators on turns and overtake after indicating. <br/><br/>Everyone in the city knows how to drive a car; cars are the most important means of travelling so learn before it is too late. Where ever you have to go you have to take your car with you hence having driving license is a must.<br/><br/>Every mission in the start will tell you what to do in the following mission. You cannot reckless drive in this City Street Car Driving School: Learn to Drive game. You have to follow every rule to earn points and unlock new cars. There are several missions to play from with different colors representing different set of rules to follow. You can free roam and start any mission you want. You have to give way to passing ambulance and overtake different cars.<br/><br/>There are several unique cars but you have will have to earn coins and buy those cars. Every car comes with more speed and better control.<br/><br/>Game Feature<br/>•\tSeveral cars to select from<br/>•\tRealistic car controls<br/>•\tRealistic City with Dynamic Traffic<br/>•\tGreat User Interface<br/>•\tManual Gearbox<br/>•\tSeveral free mission to play from<br/>•\tDifferent controls modes<br/>•\tIndicators, Engine Start and Fasten Seatbelt button<br/><br/>Hurry-up and download City Street Car Driving School: Learn to Drive and earn a license in high-school. No need for your parents to take you to the mall or school. Now you can do that by yourself and enjoy life. Earn your virtual driving permit.", "metacritic": null, "released": "2017-10-20", "tba": false, "updated": "2019-10-22T14:12:33", "background_image": "https://media.rawg.io/media/screenshots/d82/d8284335ac0c6c2820c737fba2106900.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 112, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Erqem Habib Husaini"], "genres": ["Simulation"], "publishers": ["Erqem Habib Husaini"], "esrb_rating": "Everyone 10+"}