{"id": 249232, "slug": "mcpanda-super-pilot-kids-app", "name": "McPanda: Super Pilot Kids' App", "name_original": "McPanda: Super Pilot Kids' App", "description": "A great open-world game for kids. With this app you can fly exciting missions, experience great adventures, and become a real flying hero. Choose one of the super-cool planes and your favorite pilot. Wow, each aircraft has special abilities that help you solve tasks and missions!<br/><br/>AIRPLANES<br/>► The Flying Racer<br/>The ultimate flying race taxi.<br/><br/>► Speedy Plane<br/>Super agile airplane - perfect to find hidden places and caves. <br/><br/>► Power Firefighting Plane<br/>Boasts a super-powerful water cannon to extinguish even the biggest fire. <br/>Also suitable for taxi jobs. <br/><br/>► Super Duper Jet<br/>It's incredibly fast, smooth, and just amazing to fly. <br/>You can pick up passengers and deliver packages.<br/><br/>► Rescue Chopper<br/>A powerful, giant helicopter that specializes in rescue missions. <br/>It can put out fires, save people, and be used as a taxi.<br/><br/>► Bumblebee Spaceship<br/>Whoa, that’s one not to miss! Are you excited yet? <br/>A totally crazy aircraft. <br/><br/><br/>YOUR MISSIONS<br/>•• Air-Taxi pilot<br/>Pick up passengers and quickly fly them to their destination.<br/><br/>•• Rescue pilot<br/>Rescue injured residents from difficult terrain and fly them to a hospital.<br/><br/>•• Fire service pilot<br/>Put out forest fires in time with the water cannon before they spread.<br/><br/>•• Airmail pilot<br/>Land your aircraft, disembark, and collect parcels. Then take them to the residents’ homes. <br/><br/>•• Tourist guide<br/>Find great attractions and land to take a picture. The better the photo, the more stars you’ll get...<br/><br/>...and the more jobs you complete, the more stars you can collect. <br/><br/><br/>MORE FEATURES<br/>» Walking, swimming, flying<br/>Land wherever you want, jump out, and walk or swim to go exploring!<br/><br/>» Skydiving<br/>Jump off skyscrapers and cliffs, and use your parachute. Try to break the glide record...<br/><br/>» Switching planes<br/>Don’t feel like flying the chopper any longer? Fly over to the jet and switch planes. <br/><br/><br/>WHAT ELSE?<br/>⋅⋅ Explore huge caves and hidden places.<br/>⋅⋅ Fly cool stunts.<br/>⋅⋅ Take the helicopter to rescue people in distress from the water.<br/>⋅⋅ Use the boost to move faster.<br/>⋅⋅ Use the warp portals to find shortcuts.<br/><br/>(One airplane is free to play. More airplanes are available as an in-app purchase.)", "metacritic": null, "released": "2017-07-08", "tba": false, "updated": "2019-10-22T14:12:36", "background_image": "https://media.rawg.io/media/screenshots/6fe/6fe4bfda556d31fb2c7b65b5c648f81e_qhULX4c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 87, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["wonderkind"], "genres": ["Arcade", "Family"], "publishers": ["wonderkind"], "esrb_rating": "Everyone 10+"}