{"id": 249289, "slug": "bowling-paradise-3-exotic-multiplayer-game", "name": "Bowling Paradise 3 - Exotic Multiplayer Game", "name_original": "Bowling Paradise 3 - Exotic Multiplayer Game", "description": "Go bowling in a variety of stunning locations in Bowling Paradise 3! <br/><br/>Bowling Paradise 3 combines the best features of the previous two generations of Bowling Paradise. With a variety of locations and unique details, Bowling Paradise 3 will undoubtedly keep you entertained for hours. <br/><br/>Each of the nine locations has a unique atmosphere. <br/> - Camping: Go bowling on a quiet, peaceful night in the forest. <br/> - Desert: Experience the wild atmosphere without feeling the heat and dryness!<br/> - Dome: If you’re looking for a high class experience, go bowling in the luxurious and classy Dome. <br/> - Garden: Immerse yourself nature for a relaxing bowling game. <br/> - Outer Space: Who says you can’t go bowling in outer space?! <br/> - Paradise Beach: Enjoy this fun and relaxing beach setting.<br/> - Sky Island: A unique location at either noon or sunset. <br/> - Space Challenge: With moving pins, this location will definitely test your bowling skills. <br/> - Undersea: Bowl alongside sea creatures and beautiful coral. <br/><br/>The customization options in Bowling Paradise 3 are endless. Choose from 10 different, beautiful balls. You can even select a different ball for each throw! You can also choose a different style of pins for each frame. For controlling, you can choose to either swipe or tilt your device. At the end of each game you can reward yourself by seeing an impressive fireworks show. If you earned a higher score, your show will be better! <br/><br/>Features:<br/> - Bowl in 9 unique locations<br/> - Choose from a variety of pins and balls <br/> - Experience special effects and realistic physics<br/> - Play in different player modes <br/><br/>Choose from several different player modes. If you want to practice your skills, you can play individually. After practicing, you can play with up to four friends or family members. If you are looking for a challenge, try playing against the CPU at three different difficulty levels.<br/><br/>Download Bowling Paradise 3 now to go bowling like never before! For more information, visit our website at http://www.innolab-au.com. <br/><br/>PRESS QUOTES<br/><br/>TUAW - Whichever version of Bowling Paradise 2 you choose I believe it will provide you lots of enjoyment and a real challenge.<br/>AppStoreArcade - Paradise Bowling 2 improves on the original while staying true to the arcade feel with it’s out-of-this world physics and spot on controls.", "metacritic": null, "released": "2015-09-19", "tba": false, "updated": "2019-10-22T14:12:39", "background_image": "https://media.rawg.io/media/screenshots/134/13433c4d9f25a75f9c5193b28e3aee74.jpg", "website": "http://www.innolab-au.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 214, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["INNOLAB"], "genres": ["Sports", "Family"], "publishers": ["INNOLAB"], "esrb_rating": "Everyone 10+"}