{"id": 249302, "slug": "repixel-art-sandbox-coloring", "name": "Repixel Art - Sandbox Coloring", "name_original": "Repixel Art - Sandbox Coloring", "description": "Repixel Art - Sandbox Coloring in this new addictive game. Choose from a variety of super fun images and follow the numbers to bring them to life. <br/><br/>Tons of Artworks to color by number. Try Repixel Art Camera to create your own.<br/><br/>New images<br/><br/>Key Features:<br/>• Easily color any image!<br/>• Share with friends on Instagram, Twitter or Facebook Messenger<br/>• Family-friendly content: coloring for all ages<br/>• Perfect relaxing activity<br/><br/>Repixel Art Unlimited Access Subscription:<br/><br/>- With Repixel Art Unlimited Access you can subscribe for daily new pictures, export without watermark, remove ads, and have unlimited access to all pictures.<br/>- You'll be able to access all available pictures and receive daily updates ad free for the duration of your subscription<br/>- The subscriptions are $0.99 weekly or equal to the same price tier that \"Apple's App Store Matrix\" determines in other currencies.<br/>- You may cancel a subscription or free-trial anytime via the subscription setting through your iTunes account. This must be done 24 hours before the end of the free-trial or subscription period to avoid being charged. <br/>- You will be able to color all available images for the duration of the subscription<br/>- Subscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the current period. No cancellation of the current subscription is allowed during active subscription period. Any unused portion of a free-trial period, will be forfeited when the user purchases an Unlimited Access subscription<br/><br/>Terms of use: https://muhammadumarzahid.godaddysites.com/enduser-license-agreement<br/>Privacy policy: https://muhammadumarzahid.godaddysites.com/privacy-policy", "metacritic": null, "released": "2018-03-21", "tba": false, "updated": "2019-10-22T14:12:39", "background_image": "https://media.rawg.io/media/screenshots/a2a/a2a7d37e553fe354386452bc716de2b1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 36, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Muhammad Umar Zahid"], "genres": ["Simulation", "Puzzle"], "publishers": ["Muhammad Umar Zahid"], "esrb_rating": "Everyone 10+"}