{"id": 249384, "slug": "tied-together", "name": "Tied Together", "name_original": "Tied Together", "description": "<p>\n      One fine day a bunch of scientists created four tiny monsters. But for \n      what? To test their cooperation skills of course! So they tied them \n      together to a tiny monstrous chain and let them make their way through \n      colourfull, tricky, cooperative experimental set-ups that only \n      scientists can think up.\n    </p><p>\n</p><p>\n      Anybody complained the plot is as flat as 2D? Bullseye! You are right. \n      The unbelievable truth is: YOU are the monsters and WE are the \n      scientists. Get tied to your friends and we will test your cooperation \n      skills and creativity! And we will even test your friendship…\n    </p><p>\n</p><p>\n      Single players don’t even have a chance to handle the monster’s \n      challenges. Also, it's a lot more fun to play with friends instead of \n      playing alone, right?!? As a team you have to coordinate movement, jumps \n      and cling to ground and walls to complete the levels and stay alive. \n      That’s not as easy as it sounds, but all the funnier! And every time \n      your monstrous cooperative skills are not enough it will end up in great \n      chaos – and great laughter.\n    </p><p>\n</p><p>\n      Come on, subject, what about your friendship and cooperative skills?\n    </p><p>\n</p><p>\n      Fun-tied features:\n    </p><p>\n      - Play our award-winning highly funny local co-op 2D party game!\n    </p><p>\n      - Tons of cooperative and non-violent fun for the whole family - from \n      child to granny!\n    </p><p>\n      - Over 40 challenging levels in the Duo Mode (2 players)\n    </p><p>\n      - And more than 20 tricky levels in the Party Mode (3 or 4 players)\n    </p><p>\n      - Finish the levels as fast as possible and earn Gold, Silver or Bronze \n      based on your time!\n    </p><p>\n      - Let the tied-together co-op fun begin!\n    </p>", "metacritic": null, "released": "2018-10-19", "tba": false, "updated": "2024-01-22T15:30:27", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "beaten": 2, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 3, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 3, "platforms": ["Nintendo Switch"], "developers": ["Napalmtree studios"], "genres": [], "publishers": ["Headup Games"], "esrb_rating": null}