{"id": 249673, "slug": "first-person-shouter-game-a-week-01", "name": "First Person Shouter - Game-a-Week #01", "name_original": "First Person Shouter - Game-a-Week #01", "description": "<p>Controls:</p>\n<p>WASD: Walking.<br/>Scroll up/E: Increase intensity vocals.<br/>Scroll down/Q: Decrease intensity vocals.<br/>F: Toggle between Verbal and Lethal mode.<br/>Voice commands differ if you point to other objects!</p>\n<p>First Person Shouter is an idea how to solve verbal commands and lethal actions for police-themed games. </p>\n<p>I got this idea by watching a lot of police tv programs where police have very distinct commands they always shout. I thought it would be interesting to make a prototype combining these two. This is not a normal commands system but rather a situation based command system. </p>\n<p>Commands are 'chosen' by pointing your gun at the desired subject and 'fired' by clicking the left mouse button (shoot button). Because police are often in tense situations you can increase the intensity of your command by scrolling up. If the voice commands don't work you can switch to lethal mode and fire away (with the left mouse button or shoot button).</p>\r\nHow it's made\r\n<p>To get quick results I used several plugins. For the first person shooter camera I used Ultimate First-Person Shooter (UFPS). For the environment I used ProBuilder and ProGrid.</p>\r\nHacks\r\n<p>I used the component based nature of UFPS to my advantage. To create the Lethal and Verbal mode I made the Verbal mode script separate. Another player script toggles the 'Shooter' script on and the Verbal script off to toggle between the two modes. </p>", "metacritic": null, "released": "2018-10-02", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/91f/91f31ef37753c9ec484668131b42f4c7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 9, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["FriedCandle"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}