{"id": 249706, "slug": "car-robot-transformation-18-robot-horse-games", "name": "Car Robot Transformation 18: Robot Horse Games", "name_original": "Car Robot Transformation 18: Robot Horse Games", "description": "<p>Welcome to the Car Robot Transformation 18: Robot Horse Game with third person shooting controls. Enjoy modern robot battle with car transformation feature. In this car war game your car transform into a super robot car. This muscle robot car 3D simulator chases the enemy and then transform into a monster shooting robot to finish them. Your wild horse transforms into a robot horse with super powers and fight against enemy. This futuristic robot transformation game gives you an ultimate experience of third person shooter action games. Horse robot transformers games are based on modern simulation technology. This robot battle is not only a robot game but also a war against crime.</p>\n<p>This Car Robot Transformation 18: Robot Horse Game is against enemy car robots involved in criminal activities. This is also a car racing simulator like other car games to follow the enemy car robots and finish them. This shooting robot car game gives you a street fighting experiences. Robot horse is just like futuristic robot to enjoy the fun of wild horse. This fighter robot transformer game is very unique than other robot shooting and action games. This futuristic war game has different missions of clash of robots to become a best robot battle warrior.</p>\n<p>Car Robot Transformation 18: Robot Horse Game Features: <br/>* Stunning and realistic city environment with realistic transforming machine robots<br/>* Amazing robot fighting animations and robot horse transform simulator <br/>* Car transforming robot shooting physics with wild horse robot and car transformation<br/>* Superhero robot car 3D shooting experience </p>\n<p>Transformation games have many types like car robot transforming; air force robot transformer and other car transform games etc. This Third Person Shooting is a combo of shooting action and car transformer simulator. Enjoy the fun of shooting with car racing simulation. Robot Car war are the best robot games to play offline. Robot Car games are much different to horse robot transformation simulation. Have some fun of robot fighting, stunts and shooting experience and finish attacking robot transformers.</p>\n<p>Download and install Car Robot Transformation 18: Robot Horse Game in your android device and enjoy unlimited robot action and shooting. Rate it and give feedback in reviews.</p>", "metacritic": null, "released": "2018-10-02", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/532/532d94371e678208026eff6ae7451f88.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 331, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Apex Logics"], "genres": ["Action"], "publishers": [], "esrb_rating": null}