{"id": 249818, "slug": "lem", "name": "Lem", "name_original": "Lem", "description": "<p>Lem is literally my first game project ever, so it will be rough around the edges, but if you're looking for something fun to play while killing time, then you've found the right game!<br/><br/><strong>THIS GAME IS A DEMO. There is currently 9 levels, but more planned with new mechanics and enemies.</strong><br/><br/><strong>The object of Lem<br/></strong>Your goal is to reach the door of each stage, but alas, it is being blocked off. To remove the blockers you'll need to destroy all of the blobs. Unfortunately this isn't Mario, so no, you can't just jump on their heads. Try dropping crates onto their heads instead.<br/><br/><strong>The cast<br/></strong>Lem - This is you, the player. You can run, jump, push crates, and pull them at a slower pace.<br/><br/>Blob - Defeat all the blobs to destroy the blockers gating your path to the door. Careful not to touch them!<br/></p>\n<p>Snail - Because of their shell, you're able to hitch a ride on their backs, but they can still harm you if you run directly into them.<br/></p>\n<p>Buzzy - Buzzies have a hard time flying, so they bounce constantly, making them quite hard to dodge. Not included in the first release, but have been developed.<br/></p>\n<p>Blue switch - When you touch a vertical platform it will stop moving, and some are actually stopped by default. Activate a blue switch to get them running again.<br/></p>\n<p>Spring - Did you know if you walk off a platform or crate directly onto a spring you can gain additional height? This may, or may not, be something useful to know ;)</p>\n<p><strong>Controls (keyboard and xbox controller)<br/></strong>Movement - Arrow keys / D-Pad<br/>Jump - X / A button<br/>Pull crate, activate switches and close level title - Z / X<br/>Open/Close menu - Escape / Start button<br/>Restart level - R / Open menu and press restart level<br/><br/><strong>I hope you enjoy playing Lem, and as it's my first game I would appreciate any and all feedback (even bad stuff)</strong></p>", "metacritic": null, "released": "2018-10-01", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/b18/b18df0df97ad77c65afb17189d59a14f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 62, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["poltergasm"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}