{"id": 249986, "slug": "squareworld-unpixeled", "name": "SquareWorld Unpixeled", "name_original": "SquareWorld Unpixeled", "description": "Build whatever comes into your mind with over 220 blocks to build with! Most blocks can be chiseled and shaped in dozens of ways to ensure there is everything you need!<br/><br/><br/>A planet is not enough? Well, luckily there are 100 additional planets to explore! Each randomly generated, no one looks the same. Some have villages, some epic dungeons, lava oceans, giant caves or purple alien worlds. There is always something to explore!<br/><br/><br/>With friends everything is even funnier. Just input the name of your buddy and you can join his world, no server, no work.<br/><br/><br/>Ever wanted level 10 on your gold-silver bow with a mithril string and a cactus on it? No? Well, with the forging system you can use whatever material you want!<br/>Furthermore, there are paintings to collect, bosses to slain, music to play, precious ores to mine, dungeons to loot, villager to trade with and get mini quests from, plants and trees to grow and a high tech airship to craft (out of leather, steel and wood. Trust me, it flies!)<br/>You are not sure what you want to do? An exciting main quest will lead you through the world of SquareWorld!<br/><br/><br/>Something is missing? Throw your suggestions in the Steam forum so we can add it or make use of the easy modding API and share your own content via the Workshop!", "metacritic": null, "released": "2018-10-26", "tba": false, "updated": "2019-08-28T21:52:33", "background_image": "https://media.rawg.io/media/screenshots/b20/b20b5095f4eac3a50293045ce56ff9d6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 301, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SnowEagle Entertainment"], "genres": ["Adventure", "Indie"], "publishers": ["SnowEagle Entertainment"], "esrb_rating": null}