{"id": 249980, "slug": "super-ledgehop-double-laser", "name": "Super Ledgehop: Double Laser", "name_original": "Super Ledgehop: Double Laser", "description": "Ever came in a situation where you had a chance to become a <strong>cute anime girl</strong>, but for some reason thugs wanted to <strong>blast you into smithereens</strong> and the government is so <strong>corrupt </strong>that they're sending out their top tier dudes <strong>after you instead of the thugs?</strong> Well, in this game, that's <strong>exactly</strong> what you're getting! Experience the life of Chizuru, an colorblind orphan who for some reason <strong>can only see four specific colors</strong>. Help her find her big bro, who happens to be the senator as well! But be careful, because their government is <strong>crazy nuts</strong> right now! Use your knowledge from <strong>rhythm games and bullet hell games</strong> to create a barrage of bullets to your enemies while <strong>shooting to the beat of the background music!</strong> Become <strong>the better thug</strong> by stealing your opponent's bullets through <strong>waveshines</strong>! Blast those cheese heads with <strong>their own bullets</strong> and show them what's up!DELICIOUS FEATURES:<ul><li> Play a cute anime girl named Chizuru<br/></li><li> Experience a non-accurate depiction of being a colorblind person that can only specifically see four colors<br/></li><li> Freshly baked original soundtrack with lots of songs to shoot along the beat with<br/></li><li> SUPER COOL UNCLE HYPE THAT TEACHES YOU EVERYTHING!<br/></li><li> Learn how to waveshine and absorb bullets with your super cool uncle!<br/></li><li> MULTIPLE BULLET TYPES TO ABSORB FROM THUGS!<br/></li><li> THUGS!!!!!!!!<br/></li><li> Get the chance to become friends with a thug!!<br/></li><li> But get a cooler chance to experience having a senator as your big bro!<br/></li><li> YUUTO ICHIKA!!!!!!<br/></li><li> Chizuru is cute but Yuuto Ichika is the best, top tier girl<br/></li><li> EXPERIENCE EATING CHEESE FROM TRASH CANS TO RESTORE HP!<br/></li><li> TWO FINAL BOSSES AND A SUPERBOSS??? </li></ul>", "metacritic": null, "released": "2018-11-16", "tba": false, "updated": "2019-08-28T21:52:34", "background_image": "https://media.rawg.io/media/screenshots/26a/26aa31571fb8abfad04295a9c473a0ba.jpg", "website": "http://www.lamedimension.moe/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 3, "beaten": 1}, "playtime": 0, "achievements_count": 14, "ratings_count": 0, "suggestions_count": 149, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["LAME Dimension"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["LAME Dimension"], "esrb_rating": null}