{"id": 250036, "slug": "wisielec-kto-zostanie-powieszony-free", "name": "Wisielec: Kto zostanie powieszony? Free", "name_original": "Wisielec: Kto zostanie powieszony? Free", "description": "Wisielec: Kto zostanie powieszony? <br/><br/>Wisielec (szubienica), to wspaniała gra, którą pewnie pamiętasz z dzieciństwa. Kiedyś potrzebna była kartka lub tablica, teraz możesz w nią grać na telefonie lub tablecie! <br/>Odgadnij ukryte hasło wybierając literki. Każda błędna literka, to kolejna część wisielca. Nie pozwól mu zawisnąć! <br/><br/>Kategorie <br/>Geografia - Dużo podróżujesz? Jakie państwa, miasta oraz nazwy geograficzne znasz? <br/>Jedzenie - Lubisz gotować lub jeść? Może znajdziesz inspiracje. Odkrywaj potrawy i napoje. <br/>Muzyka - Muzyka popularna nie ma przed Tobą tajemnic? Odgaduj nazwy wykonawców. <br/>Kino - Film to Twoja pasja? Dobrze znasz filmy, aktorów oraz reżyserów? Sprawdź się! <br/>Sport - Czy wiesz wszystko o sporcie? Znasz każdego sportowca, wszystkie drużyny i dyscypliny sportowe. To kategoria dla Ciebie! <br/>Zwierzęta – Jesteś dobry z biologii? A może po prostu kochasz zwierzęta? Udowodnij ;) <br/><br/><br/>Tryby rozgrywki <br/>Jeden gracz <br/>Wybierz kategorię (lub wszystkie) i odgaduj losowe hasła. Masz jedną podpowiedź na hasło. <br/><br/>Dwóch graczy <br/>Graj z przyjacielem. Wymyśl hasło dla przeciwnika. Jeśli nie masz pomysłu na hasło, wylosuj jakieś. Możesz losować aż znajdziesz takie, które Ci się podoba. Wygrywa ten, kto odgadnie więcej haseł. <br/><br/><br/>Jeśli masz jakieś uwagi lub propozycje ulepszeń, napisz do nas: macaque.games@gmail.com", "metacritic": null, "released": "2012-10-20", "tba": false, "updated": "2019-10-22T14:12:43", "background_image": "https://media.rawg.io/media/screenshots/05b/05b84213dc5ec789316cda15af3879c5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 56, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Macaque"], "genres": ["Puzzle"], "publishers": ["Pawel Maka"], "esrb_rating": "Everyone 10+"}