{"id": 250007, "slug": "afarid", "name": "Afarid", "name_original": "Afarid", "description": "<strong>\"And there were men from mankind who sought refuge in men from the jinn, so they [only] increased them in burden.\"<br/><br/>Surah Al-Jinn (72:6), Al-Qur’an al-Kareem</strong><br/><br/><strong>960 Before Christ – Mount Zion</strong><br/><br/>One night, while King Solomon was in the belief that his empery is the Golden Age of his kingdom, he dreamt his father Prophet David. When he woke up, he met the holy bird Hoopoe, his future guide, for the first time.<br/><br/>Besides his ability to speak with animals, with this dream, King Solomon became aware of the puissance of the ring, which was given to him by God to rule over the 4th dimension creatures.<br/><br/>A convention with the attendance of 25 jinn clans took place at King Solomon’s castle located at the Mount of Zion. At this convention, together with 13 other clan leaders, the leader of the clan Afarid, Bir-un Shatan, refused to be yoked by King Solomon.<br/>Bir-un Shatan considers the jinn race as superior to the human race. In order to take possession of King Solomon's ring and subjugate all the 4th dimension beings, he swore to eradicate King Solomon and every last one of his descendants.<br/> <br/>King Solomon used the wisdom of the book, Kenz-ul Havas, to create a strong incantation for taking his former descendants under protection and ensured with a chest to pass on this wisdom from generation to generation.<br/> <br/>Bir-un Shatan abused four of the clan leaders for his own interests, who formerly refused to be dominated by King Solomon and were inhibited to change dimension.<br/> <br/><strong>1955 - Village of Parlak</strong><br/><br/>The last soldiers of King Solomon’s ancestry, Hafiz and his grandson Dai, settled in an Anatolian village near Izmir called Parlak, in the light of the wisdom acquired from the chest.<br/> <br/>The Ministry of Culture starts an archaeological excavation after the village’s children find a jug filled with hundreds of gold coins. Hafiz and Dai now know for sure that they are one step closer to finding the King Solomon’s shrine which they have been hunting after for years.<br/> <br/>The moment Bir-un Shatan waited for centuries had finally arrived. He took action with all his force to seize the ring and to wipe King Solomon’s lineage off the face of the earth.<br/> <br/>In this adventure, Bir-un Shatan’s brother Raman helps Hafiz and Dai by virtue of his love of God and his loyalty oath towards King Solomon’s descendants. <br/>Three revelations, one king, and the relentless struggle between the last man of his bloodline and the damned jinn clans.<br/><br/><strong>Key Features:</strong><br/><br/><ul><li>Bloodcurdling religious atmosphere <br/></li><li>Possibility of discovering a cursed Anatolian village with high graphics quality<br/></li><li>Realistic stealth experience in nerve-shredding action scenes due to superior artificial intelligence mechanics<br/></li><li>Changing gameplay system in tandem with puzzle and object interactions <br/></li><li>Engrossing story with multiple endings</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:52:32", "background_image": "https://media.rawg.io/media/screenshots/c46/c460290e0e4c84861a12db2047816e8d.jpg", "website": "https://panda.istanbul", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 249, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Panda Bear"], "genres": ["Action", "Adventure", "Simulation", "Indie"], "publishers": ["Panda Bear"], "esrb_rating": null}