{"id": 250044, "slug": "tricky-puzzle-challenge", "name": "Tricky Puzzle Challenge", "name_original": "Tricky Puzzle Challenge", "description": "A Puzzle Game to Stimulate Your Brain!<br/><br/>Quiz-Matchstick is a classic brain training puzzle game that most anyone has played at least once.<br/>This version can be enjoyed for free by all ages.<br/>Move the matchsticks and try to find the correct answer while training your brain through a fun game!<br/><br/>How to Play<br/><br/>The rules are simple.<br/>Move, add, or remove matchsticks to create the correct answer. That's it!<br/>This puzzle game has no time limit, so you can stimulate your brain at your own pace.<br/><br/>Don't worry! The puzzles will become more and more difficult as you continue to solve them.<br/>There are also hints available for each puzzle that you may use if you get stuck.<br/><br/>This is your chance to invigorate your brain with a fun, free game!<br/>You won't want to put it down!<br/><br/>Once you join Tricky VIP membership,<br/>you can enjoy the following VIP service:<br/><br/>1. New additions weekly<br/>2. 5 hints/day<br/>Prices and Period of Subscription Subscription period is 1 Week. <br/>Every period your subscription renews.<br/>• Weekly Package $0.99 <br/><br/>- Payment will be charged to your iTunes<br/>Account at confirmation of purchase.<br/>- Every duration week(that is to say\"1 week\")your subscription renews.<br/>- Subscription automatically renews unless auto-renew is turned off at least 24 hours before the end of the current period.<br/>- Account will be charged for renewal within 24 hours prior to the end of the current period.<br/>- Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user’s Account Settings after purchase.<br/>- You can cancel your subscription via this url: https : //support.apple.com/en-us/ HT20 2039<br/>- You cannot cancel the current subscription during the active subscription period.<br/>- Any unused portion of a free trial period, if offered, will be forfeited when the user purchases Premium Subscription.Price Description: Currently, Tricky VIP subscription price Start from $0.99/week. It should be noted that the subscription price of each country may vary, and the price will not be notified if there is any change.<br/>Privacy Policy:https://docs.google.com/document/d/e/2PACX-1vRMSvcXBS1Z_8ndzDrSu9ygDMxJKZCJPgTrV1JNcbaKGbIUkmGElc4uIFVFJrXBpd3SjkzbO52SKV9c/pub<br/>TERMS OF USE:https://docs.google.com/document/d/e/2PACX-1vT9_wx9R-DNbq8C-FiBDIFHLBoIDPRdLKEPxAfHu9bkaV7JnKrRFF-kfTsdmULl0mPv7gxf8V_N9XQE/pub", "metacritic": null, "released": "2018-09-10", "tba": false, "updated": "2019-10-22T14:12:43", "background_image": "https://media.rawg.io/media/screenshots/d77/d7713a35987648696f786252065c292d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 55, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["David Powell"], "genres": ["Family", "Puzzle"], "publishers": ["David Powell"], "esrb_rating": "Everyone 10+"}