{"id": 250038, "slug": "henker-wer-wird-gehangt-free", "name": "Henker: Wer wird gehängt? Free", "name_original": "Henker: Wer wird gehängt? Free", "description": "Henker: Wer wird gehängt?<br/><br/>Der Henker (Galgenmännchen) ist eine wunderbare Unterhaltung, die jedem an seine eigne Kindheit erinnern kann. Damals brauchte man ein Blatt Papier oder einen Tafel, jetzt kann man einfach auf Handy oder Tablet spielen! Um den versteckten Begriff zu erraten muss man nur die richtigen Buchstaben auswählen. Für jeden Buchstaben, der nicht in dem gesuchten Wort vorkommt, wird ein Stück an einem Galgen gebaut. Lassen Sie ihm nicht gehängt werden!<br/><br/>Kategorien<br/>Geographie – Reist du viel? Welche Staaten, Städte und geographischen Namen kennst du?<br/>Essen - Magst du Kochen und Essen. Vielleicht findest du eine Inspiration? Entdecke Speisen und Getränke.<br/>Musik – Hast du die Popmusik im kleinen Finger? Errate mal die Namen der Sänger.<br/>Sport – Interessierst du dich an Sport? Kennst du jeden Sportler, alle Mannschaften und Sportdisziplin? Prüfe dich!!!<br/>Tiere – Bist du gut in Biologie? Vielleicht liebst du Tiere? Wir lassen dich nicht enttäuschen.<br/><br/>Optionen:<br/>ein Spieler<br/>Wähle eine Kategorie (oder alle) aus und errate den Begriff. Du hast einen Hinweis für das Kennwort.<br/>zwei Spieler<br/>Spiele mit deinem Freund. Denke einen Begriff für deinen Gegner aus. Wenn du keine Idee für den Begriff hast, wähle einen einfach aus. Du kannst solange auswählen bis du ein spannendes Wort findest. Der gewinnt, der mehr Begriffe erraten wird.<br/><br/>Falls du irgendwelche Bemerkungen oder Vorschläge hast, komme gern auf uns zu: macaque.games@gmail.com", "metacritic": null, "released": "2012-10-20", "tba": false, "updated": "2019-10-22T14:12:43", "background_image": "https://media.rawg.io/media/screenshots/259/2590b965cb3edf26bd2bec49bc078718.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 49, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Macaque"], "genres": ["Puzzle"], "publishers": ["Pawel Maka"], "esrb_rating": "Everyone 10+"}