{"id": 2503, "slug": "party-hard", "name": "Party Hard", "name_original": "Party Hard", "description": "<p>The genre of this game is defined as stealth-action. However, its plot is very unusual, although it does not contradict such a definition of the genre.</p>\n<h3>Plot</h3>\n<p>Your character is a person who is deadly tired of a very common problem: the neighbors who threw a noisy party, not taking into account that they do not live alone in the world.</p>\n<p>In ordinary life, you usually silently endure or call the police. But in this game you should just kill everyone who has the imprudence to make noise. You can do it with a knife, and you can use other, very simple, improvised means. At first, you only have a knife, but over time, the tools appear more interesting.</p>\n<h3>Gameplay</h3>\n<p>The game has ten unique levels. Some details of each level are generated randomly, so each game is somewhat different from the other.</p>\n<p>After loading the level of the hero finds himself standing in front of a building or a complex of buildings, where there is a party with the participation of about fifty people.</p>\n<p>It is assumed that by this time your character is already quite angry. And now he faces only one simple task - to destroy all.</p>\n<p>The character has the skills to work with a knife, can set a variety of different traps, use various items.</p>\n<p>There are also obstacles in the game. For example, party members may call the police, there are guards in the building, and if you kill a police officer, FBI agents will arrive. There are also others who may suddenly appear.</p>\n<h3>Bonuses</h3>\n<p>Your character is not always the same person. There are several characters in the game that you can become as you play. These characters are more capable of killing, among them there are ninja and even a policeman.</p>\n<p>You may have allies, someone you can call for help.</p>\n<p>There is also a spin-off simulation game titled Party Hard Tycoon.</p>", "metacritic": 64, "released": "2015-08-24", "tba": false, "updated": "2024-04-18T21:17:39", "background_image": "https://media.rawg.io/media/screenshots/5a1/5a1ce6908dc401fa9f805d5db4e832d7.jpg", "website": "http://tinybuild.com/partyhard", "rating": 3.51, "rating_top": 4, "added_by_status": {"yet": 103, "owned": 1694, "beaten": 160, "toplay": 28, "dropped": 113, "playing": 9}, "playtime": 4, "achievements_count": 116, "ratings_count": 266, "suggestions_count": 404, "game_series_count": 1, "reviews_count": 273, "platforms": ["Xbox One", "PlayStation 4", "Nintendo Switch", "PC", "macOS", "Linux", "Android"], "developers": ["tinyBuild", "Pinokl Games", "Kverta"], "genres": ["Action", "Strategy", "Arcade", "Fighting", "Indie"], "publishers": ["tinyBuild"], "esrb_rating": "Mature"}