{"id": 250331, "slug": "city-bus-driving-sim", "name": "City Bus Driving Sim", "name_original": "City Bus Driving Sim", "description": "Start your career as a bus driver, learning everything that gets into doing the job effectively and dependably. Enter a demanding training arena simulated, try out a selection of varied vehicles and show your skills driving them! Now updated with 2 new cars and 10 new missions!<br/><br/>FEATURES:<br/>▶ DEMANDING OBSTACLE ARENA: Featuring a bus station and varied environment around it<br/>▶ VARIED SELECTION OF VEHICLES: 12 Buses of different shapes and sizes to drive (2 brand new!)<br/>▶ CHALLENGING MISSIONS: 60 trials to complete with precision and on time (10 new!)<br/>▶ FUN &amp; REALISTIC DRIVING MODEL: Learn to drive &amp; have fun in the process!<br/>▶ FREE ROAMING MODE: Explore the area at your own pace<br/><br/>In the game you will have to show your ability to navigate through tricky obstacle courses and show your creativity. You have to show your ready to transport your passenger safely and effectively when the time to start your job comes!<br/><br/>It’s important for you to get to the destination on time, but speed is not the only thing you should be concerned about here. Drive fast but remember to also be safe. Try not to make a mistake that will lead to a fatal crash! Show your skills and talent as a pro bus driver!<br/><br/>You will get to drive a large selection of buses – long ones, short ones, small ones, large ones, articulated ones... To spice things up the game also introduces one limo that is as challenging and demanding to drive as any bus. All of the available vehicles are modelled in high quality for increased immersion.<br/><br/>The challenges presented by the game aren’t easy or straightforward, but with enough practice you will be able to pass them with flying colours! Remember not to treat is as a race, though speed is definitely important too!<br/><br/>Are you up to the challenge?", "metacritic": null, "released": "2018-04-22", "tba": false, "updated": "2019-07-29T20:09:00", "background_image": "https://media.rawg.io/media/screenshots/888/8886e4390ed6747ed46c5bec160a7be3_x5ufaUc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 93, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Play With Games"], "genres": ["Sports", "Racing"], "publishers": ["Play With Games"], "esrb_rating": "Everyone 10+"}