{"id": 250308, "slug": "bubbagolf-free", "name": "BubbaGolf Free", "name_original": "BubbaGolf Free", "description": "Step up to the tee and play BubbaGolf! Play as Masters Champion and long driver himself, Bubba Watson, and take aim at the best arcade golf game in the iTunes App Store! It’s addictive, easy to learn and tough to master for players of all skill levels! Get ready for some LONG BALL fun and maybe even tee it up against Bubba himself! <br/><br/>**MULTIPLE GAME MODES** (paid version only) <br/>-MULTIPLAYER - play against friends via Game Center or join a random game and play against the Masters Champion himself! Those who play a round with Bubba will earn a special achievement and Bubba's Championship outfit! Follow @bubbawatson on Twitter to find out when he will be playing! <br/><br/>-CHALLENGE MODE - Test your distance and accuracy by progressing through 20 challenges per level! <br/>-SCORE ATTACK - Rack up the points by hitting targets, landing on 'Hot Greens' and hitting the long ball! <br/><br/>**FULL GAME CENTER INTEGRATION** (Paid Version Only)<br/>-ACHIEVEMENTS - Can you earn all 40 achievements? <br/>-LEADERBOARDS - Earn bragging rights by having the top score on every level! <br/>-MULTIPLAYER MATCHMAKING - Invite friends or join a random game! <br/><br/>**BEAUTIFUL 3D ENVIRONMENTS** <br/><br/>**Do you have a friend that loves Bubba Watson/golf/fun games? Gift this app to your Bubba-lovin' buddy! Simply click the Buy App arrow and select Gift This App!", "metacritic": null, "released": "2012-11-07", "tba": false, "updated": "2019-07-29T19:56:28", "background_image": "https://media.rawg.io/media/screenshots/b55/b55efe72476d07f49790b55b049fb040.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 185, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["GameMill Entertainment"], "genres": ["Strategy", "Sports"], "publishers": ["GameMill Entertainment"], "esrb_rating": null}