{"id": 250488, "slug": "bat-kill-vampire-arcade-game", "name": "Bat Kill-Vampire Arcade Game", "name_original": "Bat Kill-Vampire Arcade Game", "description": "The aim of Bat Kill is to go back in time to save humanity but to do that you need to get to the tower and pull the time machine lever to go back in time. To get to the tower you need to destroy the bats by shooting them.<br/>Kill as many bats as possible within a time frame. <br/>As the time progresses the timer will decrease to reach zero.<br/>Bats will fly in from the bottom and sides of the screen.<br/>User has to shoot these bats before they reach the top of the screen. <br/>User has to tap on a bat to shoot it. When user taps on a bat it is shot dead.<br/>If a bat reaches the top of the screen then the health of the player will be<br/>reduced. When health of the player reaches zero the level is over.<br/>User has to kill the specific amount of bats in each level in the given time before timer reaches to zero.<br/>There are 15 levels and each level becomes more diffiult as the number of bats increase and so does their flying speed.<br/>User can also purchase and use bomb, health packs and virtual money from the in-app purchase.<br/>When user uses a bomb then all bats present on the screen will be dead. Health packs top up your health and with virtual money you can purchase from the in-app shop.<br/>The more bats you kill, the higher the score you will get, the highest score is recorded in Top Score tab.<br/>Comlete each level to improve your score.<br/>When you complete level 15 the animation will show the player character running towards a tower. Then player character will enter the tower and pull the lever of time machine<br/>to go back in time to save humanity.", "metacritic": null, "released": "2013-12-30", "tba": false, "updated": "2019-10-22T14:10:36", "background_image": "https://media.rawg.io/media/screenshots/270/270f2910003bace53bd52a6cd84688eb.jpg", "website": "http://www.batkill.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 121, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tania Moise"], "genres": ["Action", "Adventure"], "publishers": ["Tania Moise"], "esrb_rating": "Everyone 10+"}