{"id": 250431, "slug": "farm-frenzy-3-madagascar", "name": "Farm Frenzy 3 Madagascar", "name_original": "Farm Frenzy 3 Madagascar", "description": "Enjoy an all-new Farm Frenzy adventure set in stunning Madagascar!  Join Scarlett as she travels to the exotic country to help the workers on a reservation save their animals that have become sick for an unknown reason.<br/><br/>Raise indigenous creatures like guinea birds, elephants, and water buffalo, construct and use new buildings, and manufacture products throughout 90 thrilling levels!  If you've been itching to get back on the farm, the wait is over!<br/><br/>GAME FEATURES:<br/><br/>◇ 90 beautiful levels on the unique island - Madagascar!<br/>◇ Career and Endless modes<br/>◇ Grab unique trophies and achievements!<br/>◇ An assortment of various buildings! Upgrade them all!<br/>◇ Various transport vehicles and trucks!<br/>◇ Funny and amusing animals to care for!<br/>◇ Hilarious visual gags<br/>◇ Plant fresh crops, earn money and grow up your business further and further!<br/>◇ Helps you to greatly improve your concentration, perception, and focus, enhance your cognitive capacities and train your reaction<br/>◇ Unique graphics and embracing sound!<br/>◇ No Wi-Fi or internet connection required - download and play where and when you want!<br/>◇ Supported languages: English, Italian, Russian, German, French, Chinese, Dutch, Portuguese, Japanese, Spanish.<br/><br/>\"Farm Frenzy 3: Madagascar\" - unique game, that stands in the middle of the collaboration of genres \"Farming game\" and \"Time manager\"!<br/><br/>Your own farm, in this game, is a very funny business of growing crops, collecting goods and then trade them on the market. Also, you'll need to purchase factories and upgrade buildings.<br/>Upgrade all of your stuff: trucks and various facilities. Manage your business in real time and make yourself a most famous farmer around the world! Upgrade your vehicles and you're can earn money much faster in this perfect growing game! Hire smart cats for collecting goods and brave dogs to defend your animals  - it's a perfect time to serious business!<br/><br/>Can you beat the highest score and prove everyone that you're the best virtual farmer in the world?<br/><br/>Play the best games from \"Alawar\", the makers of such games as Beholder, Farm Frenzy, The Treasures Of Montezuma, House of 1000 doors, on App Store!<br/><br/>FIND US on FACEBOOK: AlawarEntertainment<br/>FOLLOW US on TWITTER: @AlawarMobile<br/>Be the first to hear about our new games and awesome contests!", "metacritic": null, "released": "2013-04-26", "tba": false, "updated": "2023-06-17T22:41:50", "background_image": "https://media.rawg.io/media/screenshots/d51/d51a869d101999e4a0866e4633e74812.jpg", "website": "https://www.alawar.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 1, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 214, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["Alawar Entertainment"], "genres": ["Simulation", "Arcade", "Casual"], "publishers": ["Alawar Entertainment"], "esrb_rating": null}