{"id": 250539, "slug": "speedy-ting-lite", "name": "Speedy Ting Lite", "name_original": "Speedy Ting Lite", "description": "Warning:  This is an old game with a new twist to the rules.  You are now in the presence of a historical moment in time.<br/><br/>This new adaptation of the classic game of \"Speed\" is an intense ride.  It's a card game that truly belongs in the arcade game category.  <br/><br/>It will push you to beat and re-beat your own personal best time along with any other player who even dares to challenge your score.  This game is not for the faint of heart.  It's an addicting joyride, it's brain stimulating, and although luck plays a factor, strategy and speed are the more dominant traits required to get the ultimate time.  <br/><br/>You have never played \"Speed\" like this before. <br/><br/><br/><br/>GAME DESCRIPTION<br/><br/>Two cards will be shown in the PLAY AREA.  You will be dealt seven cards to form YOUR HAND. Forty-three cards will remain in the DECK (with the first 2 cards visible). <br/><br/>The objective is to play all the cards in your hand and the deck onto the play area as quickly as possible.  <br/><br/>Cards can be played from your hand onto the play area if they are one step higher or lower than the card in the play area (card suit does not matter).  For example, if there is a three in the play area, you can play a two or a four from your hand.  For ace cards, the two choices are king and two.<br/><br/>After a card is played from your hand, another is drawn from the deck to maintain seven cards in your hand.\t  \t<br/><br/>If you are unable to move a card from your hand to the play area, you can drag a card from the deck pile over to the play area.  This will incur a penalty of +10 seconds added to your time.<br/> <br/>If the cards in the deck have all been used up, and there are no possible moves, you will be allowed to move any card in your hand to the play area.  (If the card played from your hand is not one step higher or lower than the play area card, the +10 second penalty will be applied.)  The clock stops when all cards have been moved to the play area.", "metacritic": null, "released": "2009-05-22", "tba": false, "updated": "2019-10-22T14:13:03", "background_image": "https://media.rawg.io/media/screenshots/8bc/8bcdaa0ad7f3c0c4d7c64bd4456284e6.jpg", "website": "http://vanderpuye.spaces.live.com/default.aspx", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 32, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["iKeman Consulting"], "genres": ["Strategy", "Card"], "publishers": ["Isaac Vanderpuye"], "esrb_rating": "Everyone 10+"}