{"id": 25061, "slug": "dragon-ball-z-budokai-tenkaichi-2", "name": "Dragon Ball Z: Budokai Tenkaichi 2", "name_original": "Dragon Ball Z: Budokai Tenkaichi 2", "description": "<p>Dragon Ball Z: Budokai Tenkaichi 2 takes the acrobatic and intense 3D<br />\nflying and fighting dynamic made popular in last year’s blockbuster and<br />\ntakes it to a whole new level with exciting new features sure to please<br />\ndie-hard Dragon Ball fans and those new to the franchise.</p>\n<p>Features</p>\n<p>Use the Wii Remote and Nunchuk controllers to re-create character<br />\nsuper-moves</p>\n<p>More than 100 DBZ warriors, including many that have never been seen<br />\nbefore in a video game</p>\n<p>In-game transformations players can trigger in real-time</p>\n<p>Team up with up to two other Z-Warriors to complete exciting missions<br />\nripped right from the TV show</p>\n<p>Post customizable character codes to the Internet</p>\n<p>Nine different game modes, including single and multiplayer battles</p>\n<p>Minigames and tag-team fighting</p>\n<p>Dragon Ball Z: Budokai Tenkaichi 2 offers the complete DBZ mythology<br />\nfrom Dragon Ball to Dragon Ball GT with a staggering roster of over 100<br />\nDBZ heroes and villains and an expansive story mode that allows players<br />\nto recreate some of the storied confrontations from the TV show, or<br />\nall-new showdowns of their own with characters that never actually<br />\nfought in the animated series.</p>\n<p>Lightning-fast fighting, light RPG and action gameplay elements give<br />\nplayers the power to engage in titanic battles set in 15 vast and<br />\nvibrant 3D highly destructible environments. The game also features<br />\nlevels that are twice the size of those in the original, in-game<br />\ntransformations, tag battles, an all new vanishing attack and complete<br />\nenvironmental destruction.</p>", "metacritic": 73, "released": "2006-10-05", "tba": false, "updated": "2023-12-06T16:29:45", "background_image": "https://media.rawg.io/media/screenshots/f91/f9191489880a18417b93df64541e3775.jpg", "website": "", "rating": 4.16, "rating_top": 4, "added_by_status": {"yet": 1, "owned": 19, "beaten": 89, "toplay": 2, "dropped": 12, "playing": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 53, "suggestions_count": 306, "game_series_count": 56, "reviews_count": 56, "platforms": ["Wii", "PlayStation 2"], "developers": ["Spike"], "genres": ["Fighting"], "publishers": ["Atari"], "esrb_rating": "Teen"}