{"id": 250731, "slug": "bass-constructor", "name": "Bass Constructor", "name_original": "Bass Constructor", "description": "Make music with your iOS Device that will captivate your audience!<br/><br/>Produce impressive results in no time even  without any prior knowledge. Just by tapping the sample blocks you can develop your own hit songs that will make your friends dance.<br/><br/>This app will give you six construction kits with the hottest beats, bass lines and perfectly composed melodies and synth chords ranging from house &amp; trance to hands-up.<br/><br/>Start now and create your own hit record.<br/><br/>********************************************************************************<br/><br/>Here are the first user reviews for Bass Constructor I have received. Thank you to everyone!<br/><br/>***** Great app<br/>By Bjorkismyfriend<br/>Going to be top 25!!!!!<br/><br/>***** Uhhhhhh wow<br/>By Baddawg41<br/>This is amazing. I have never a found an app like it that is this good.<br/><br/>***** This Is awesome<br/>By Yo mamamamammam<br/>Im gonna tell everyone about this app and you'll go to the top just keep on making apps like these<br/><br/>***** Amusing!!<br/>By Stuart Walsh<br/>I stumbled across this app and I'm glad I did! It's so fun pretending to be a DJ! Download it, even if its just to mess about making a couple of beats!!<br/><br/>***** wow<br/>By Kezz 96<br/>too good!!! done a good job!!5 star full deserve<br/><br/>***** Great App!<br/>By ETs m s<br/>Hope it reaches 1º in which ever category it is!<br/><br/>***** Fette App<br/>By dreamfluider<br/>Der Bass Constructor macht wahnsinnig viel Spass. Es gibt eine Menge nette iPad Synths, aber so ein intuitives Music Construction Kit habe ich noch nicht gesehen. Funzt super auf dem 3er ipad!<br/><br/>***** Sick!<br/>By I am skrillex7000000<br/>freaking love music and this I like chill I just don't really wanna get te full version but I could make some sick stuff with just this!<br/><br/>***** GEWELDIG<br/>By Larsieado<br/>This is really a great app with is also still good music you can make yourself", "metacritic": null, "released": "2012-04-21", "tba": false, "updated": "2019-10-22T14:37:36", "background_image": "https://media.rawg.io/media/screenshots/cd0/cd059ea72559e8ee2dcb773cd81a8e4f.jpg", "website": "http://www.intermediaware.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 36, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Jochen Heizmann"], "genres": ["Simulation"], "publishers": ["Jochen Heizmann"], "esrb_rating": "Everyone 10+"}