{"id": 250861, "slug": "1000000-skins-creator-for-minecraft-edition", "name": "1,000,000+ Skins Creator for Minecraft Edition", "name_original": "1,000,000+ Skins Creator for Minecraft Edition", "description": "Support and compatible with Minecraft Pocket Edition and PC versions of Minecraft! <br/><br/>Now you can create, upload and share Minecraft skins on-the-go! Get creative and design an epic skin for your character. Why stick with plain old Steve when you can choose from almost a MILLION community created skins or design your very own personalized skin using our easy to use the app!<br/><br/>• Design your own Minecraft skins, upload to Minecraft or share with the world or send to your Minecraft Pocket Edition!<br/>• We have more than ONE MILLION designs to choose from!<br/>• Compatible with Minecraft Pocket Edition! (NO In-App Purchase needed, enjoy all the ONE MILLION skins now)<br/><br/>How to use with Minecraft Pocket Edition.<br/>1. Select &amp; and Edit the Skins. Then select to  “Save to Camera Roll\". Now your Minecraft skins are on the camera roll now.<br/>2. Open Minecraft Pocket Edition.<br/>4. Tap on options button on the bottom right.<br/>5. Tap on the skins button on the left. second from the top.<br/>6. Tap on \"Custom\" and choose the skin from step #2 above.<br/>7. Please note that you need to update Minecraft Pocket Edition to the version 0.11 or higher.<br/><br/>Minecraft Skin Creator with 1,000,000+ Best Skins: Ironman, SpiderMan, SuperMan, Hero, TV &amp; Game Character, Mob, Animal, Girl, Boy, Bat, Big Boss, Cat and Tiger, Chicken, Cow, Creeper, Dog, Ender Man, Pig, Sheep, Skeleton, Slime, Spider , Squid , Wolf ... More than 1,000,000 skins!<br/><br/>Easy to design, creator, edit and apply the skins! Or share the most cool and popular skins to your friends. <br/>Features:<br/>* Full featured and most powerful skin editor.<br/>* Undo and ReDo to modify your changes.<br/>* A lot of image filter to apply to your skins.<br/>* Recent used colors are saved for easy access.<br/>* Load a skin from a URL to modify.<br/>* Quick share your skin.<br/>* Easy manager your favorite skins.<br/>* Thousands of best selected Skin template to use.<br/><br/>Live New Skins - Hundreds of new Skins added everyday for Free! <br/><br/>Disclaim:<br/>This app is not an official Minecraft product, not approved by or associated with Mojang.", "metacritic": null, "released": "2013-04-21", "tba": false, "updated": "2019-10-22T14:10:44", "background_image": "https://media.rawg.io/media/screenshots/509/509ca8d450399e79ec68900650db55ab.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 72, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["CHUNSHENG LIU"], "genres": ["RPG", "Strategy"], "publishers": ["CHUNSHENG LIU"], "esrb_rating": "Everyone 10+"}