{"id": 250901, "slug": "evolution-indian-hunter-free", "name": "Evolution: Indian Hunter - Free", "name_original": "Evolution: Indian Hunter - Free", "description": "Feels like I'm hunting with my ancestors +++++<br/>by Colesoccer16 - Version 1.7 - May 14, 2014<br/><br/>Makes me feel like I'm back with my ancestors smoking tobacco and killing deer with my tomahawk. My great great grandfather fought in the creek war and looks just like the avatar in this game! He told me of hunting when he had to leave toward Oklahoma and this just reminds me of those hard times trying to survive.<br/><br/>EXPLORE A NEW WORLD AND SEE THROUGH THE EYES OF THE HUNTER!<br/><br/>The year is 1835--the great wave of American pioneers pushing west is imminent. Can you overcome them?<br/><br/>Grow up like a real North American Indian!<br/>In the role of Chayton, the son of tribal chief and hunting companion Akecheta, you will go on a traditional buffalo hunt. <br/><br/>Achieve great distinction and honor, learning to fend for yourself and even thrive as you venture through the wilderness!<br/><br/>FEATURES<br/><br/>o  Learn  how to handle the tomahawk, spear, and bow and arrow skillfully–make use of realistic flight physics and defend yourself and your people!<br/><br/>o  Master your multifaceted hunting missions – sneak up on buffalos, wapitis, and beavers, and slay them to nourish your people!<br/><br/>o  Protect yourself from dangerous predators – rattlesnakes, wolves, coyotes, and grizzly bears are coming for you!<br/><br/>Play our FIRST 4 LEVEL FOR FREE to acquaint yourself with the controls, the weapons, and the techniques of hunting!<br/><br/>GET THE FULL VERSION! <br/><br/>14 unique levels in an open and realistic 3D-world are waiting for you – take up the challenge and become the leader of your tribe!", "metacritic": null, "released": "2013-03-29", "tba": false, "updated": "2019-07-30T16:44:22", "background_image": "https://media.rawg.io/media/screenshots/9ac/9ac6e871aa56b66fd378002240188dc2_7jdzFz5.jpg", "website": "http://www.scorpius-forge.com/index.php/EVO_Indian_Hunter.html", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 135, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Scorpius Forge"], "genres": ["Adventure"], "publishers": ["Scorpius Forge"], "esrb_rating": null}