{"id": 250992, "slug": "vertical-assault-vietnam-war", "name": "Vertical Assault - Vietnam War", "name_original": "Vertical Assault - Vietnam War", "description": "Prepare for war! In the heat of the Vietnam War it's your job to pilot a Huey helicopter to transport American soldiers into and out of hostile territory to help bring an end to this conflict. Fly troops from our headquarters and bases to outlying North Vietnamese Army bases to tackle their forces and take control of villages. Rescue troops if they're hopelessly surrounded by enemy forces and use the guns and rockets on your chopper to back-up the ground troops that you've transported. With your skill we can win this war!<br/><br/>New for 2014 - Skirmish Mode. Name your battalion and take part in quick skirmish battles set throughout the timeline of the Vietnam War. Participate in different mission styles such as assault, rescue or timed missions as you earn ranks. The campaign follows the timeline of the war and ends when you complete the final mission or when you lose your battalion helicopters.  <br/><br/>Game Tactics<br/><br/>- Vertical Assault – Drop your troops behind enemy lines to encircle them.  <br/>- Air Lift – Use your Huey to quickly deploy and recall your troops. <br/>- Air Support – Use the machine guns and rockets on the chopper to provide back-up in the air for ground troops.<br/>- Capture The Flag – Like the game, American troops must be transported to enemy villages and kill the troops there to \"capture\" the flag and take control of the village.<br/>- Chopper Simulation – The speed and reaction of the chopper is made to mimic realistic take-offs and landings.<br/><br/>Features:<br/><br/>- Battle through twelve thrilling missions as you pilot an American Huey to rescue troops, defend villages and provide support for ground troops.<br/>- Enjoy the quick battles of Skirmish mode.<br/>- You can control the Huey by holding your finger on the screen to take off or land and move in a direction. Swipe your finger on the right or left side of the screen to change direction. Alternatively, control the Huey using a joystick for ease of movement. You can select the option you prefer in the Options menu.<br/>- Buttons will appear when you land the chopper to drop off or call nearby American soldiers to the chopper for evac. Tap the corresponding button to load and unload groups of troops.<br/>- The chopper will auto fire machine guns at nearby enemy targets that are in range as you’re flying or as you’re on the ground.<br/>- The Huey can launch rockets when you press the fire button. The number of rockets that are currently loaded on the chopper appears above the button and rockets are fired in pairs.<br/>- If the chopper is damaged, you can land in HQ and when the rotor stops, the chopper will be repaired.<br/>- The Huey has a crew of two pilots and two gunners who can be killed during missions. If both pilots die, the chopper will crash and if both gunners die, the helicopter’s firing rate will decline. <br/>- Using your chopper and ground troops, take out all soldiers in an enemy village to rustle control from the NVA and hoist an American flag signalling the village is now under American control. Controlling villages will stop NVA troops from spawning in that area. <br/>- Utilize the strategy of Vertical Assault to complete difficult missions. Transport a platoon of soldiers in front of a group of enemy troops and fly and position a second platoon behind enemy lines to box in the enemy to make them easier to overcome. <br/>- A handy mini map at the top of the screen indicates your location and the location of American and Vietnamese troops and flags represent who controls what villages and bases making navigating the game simple. <br/>- Crisp and realistic backdrops including a beautiful scrolling mountainous range and an American base and villages in Vietnam allow you to feel like you’re part of the action.<br/>- Daytime effects are added to the scene for missions during the day and at dusk.<br/>- Sound effects such as the whirl of the helicopter, which changes as you take off and fly, add to the atmosphere of the game.<br/>- Prepare to enter the heat of battle and fight for the American cause!", "metacritic": null, "released": "2011-06-11", "tba": false, "updated": "2019-10-22T14:10:50", "background_image": "https://media.rawg.io/media/screenshots/071/071e1d8ffc404d515ec615f99d19e801.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 189, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Magitech"], "genres": ["Simulation", "Arcade", "Casual"], "publishers": ["Magitech"], "esrb_rating": null}