{"id": 251, "slug": "sonny", "name": "Sonny", "name_original": "Sonny", "description": "The beloved Flash RPG series played by millions lives again in an all-new adventure that's not a sequel or a simple remake. When Sonny returns from the dead without his memories, he finds himself caught between the conflict of a seemingly endless horde of mutated monstrosities and a mysterious paramilitary force. With the help of some unlikely allies, he will discover his destiny is greater than he expected, and maybe save the world. <br/><br/>Sonny is a challenging turn-based, combat-focused RPG where unlocking and combining the effects of new skills and abilities is required to topple foes with an enormous amount of power. Sonny is designed for cunning and creativity with an emphasis on strategy and difficulty as the gameplay evolves. Featuring stunning artwork by Jet Kimchrea and an engrossing original score by David Orr.<br/><br/><ul><li>Engaging, mysterious storyline full of secrets, conspiracies, and zombies.<br/></li><li>Combat-focused gameplay with an intuitive interface.<br/></li><li>Battles with an emphasis on strategy... think your way through it, don't grind.<br/></li><li>Intriguing party members with their own unique abilities.<br/></li><li>Upgrade and enhance your equipment to grow even more powerful.</li></ul>", "metacritic": null, "released": "2017-01-12", "tba": false, "updated": "2023-06-04T06:11:16", "background_image": "https://media.rawg.io/media/screenshots/e6c/e6c6f50f516d8a6e482b794bc39908c6.jpeg", "website": "https://armorgamesstudios.com/games/sonny/", "rating": 3.33, "rating_top": 4, "added_by_status": {"yet": 2, "owned": 13, "beaten": 4, "toplay": 1}, "playtime": 5, "achievements_count": 10, "ratings_count": 5, "suggestions_count": 434, "game_series_count": 0, "reviews_count": 6, "platforms": ["macOS", "PC", "Android", "iOS"], "developers": ["Armor Games", "Krin Juangbhanich"], "genres": ["RPG", "Strategy", "Indie"], "publishers": ["Armor Games"], "esrb_rating": "Teen"}