{"id": 251060, "slug": "under-the-rain", "name": "Under The Rain", "name_original": "Under The Rain", "description": "<p><strong>Under The Rain</strong> is a <strong>psychological survival horror</strong> game in the style of the old classics of the genre with some modern gameplay elements added to the mix.<br/></p>\n<p>You play as<strong> Randolph Carter</strong>, who has recently been plagued by a recurring nightmare that is starting to pour into his waking life and is summoned by a stranger to return to <strong>Arkham</strong>...</p>\n<p>In <strong>Under The Rain</strong> the player will aid<strong> Carter</strong> while he explores the abandoned and cursed city of<strong> Arkham</strong>, and some other locations found throughout the<strong> Lovecraftian Mythos</strong> to uncover it's mysteries. That is if he can survive and maintain his sanity...</p>\n<p><strong>Under The Rain </strong>is also thought out to be an <strong>episodic adventure</strong>, in active development. </p>\n<p>I could also use some donations, because as a solo (and at the moment unemployed) developer, it is a huge struggle, and with some help from you guys, I could get some additional talent to help pull this off better and faster.</p>\n<p>So, if you can donate, much appreciated, if not, well, enjoy the game and spread the word (and some feedback is welcome).</p>\n<p> Also, you can go check out my IndieDB page and help me get a boost.</p>\n<p>With that said, I hope you enjoy this short demo, and if you find anything wrong, or just have a suggestion to make, you are more than welcome to do so.</p>\n\n\n\n<p><strong>Features</strong></p>\n\n<ul><li><strong>Melee and firearm combat</strong> - so you can have a fighting chance.</li><li><strong>Stealth </strong>- hiding in shadows and not making a lot of noise helps.</li><li><strong>Exploration </strong>- keep an eye out for useful items. These can be in plain sight or stashed around somewhere.</li><li><strong>Limited save slots and locations</strong> - just like in the good old days: no checkpoints, no autosaves, it's up to you to be careful.</li><li><strong>Controller friendly </strong>- Under The Rain is optimized to be played with a controller (although you can't navigate the inventory with a gamepad yet, sorry...), using by default a tank control scheme much like the old classics, but you can change it in the settings.</li><li><strong>Cinematic experience</strong> - no interface clutter, no Hud. Using a dynamic camera system, you feel like you are watching a horror movie, but you make the choices.</li></ul>\n\n\n<p><strong>To Do</strong></p>\n\n\n<p>A lot of things... but mostly art assets.</p>\n<p>Also, the AI is still a bit dumb, needs a lot of work in the sound department, a lot of animations need to be polished, and a few pesky bugs need fixing.</p>\n<p>Besides a list of fixes I have, I also need your help to do some more bug hunt...</p>\n<p>So, with all that said, I hope you enjoy it.</p>", "metacritic": null, "released": "2018-10-07", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/149/1497efeb39f72de187f6795f0f814ecd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 190, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Telmo Pereira"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}