{"id": 251102, "slug": "brain-storm", "name": "Brain Storm", "name_original": "Brain Storm", "description": "<p>Why is our little cloud nervous to walk back home from school?</p>\n<p>Why does it have to stop and breathe a little while?</p>\n<p>\n</p>\n<p> We represented a form of anxiety called: Panic Disorder with Agoraphobia. What are those?</p>\n<p>\n</p>\n<p> \r\n</p>\n<ul><li>Panic Disorder: It is more commonly known as Panic Attacks. We’ve all experienced that once in our lives. It’s when something stresses you so much that your body reacts to it by having a hard time to breathe, your heart beats super fast, you might be shaking and trembling, it is starting to get hot or maybe your chest hurts. Those symptoms can be pretty scary, it makes you think that you might go crazy, that you’re going to lose control, or the pain can be so strong that you think you might die. But you won’t! Those attacks are almost like a new reality, like you are escaping from everyone’s reality, a bit like when you play games but not as fun.\r\n</li></ul>\n<p> \r\n</p>\n<ul><li>Agoraphobia: A scary name, which goes with being scared of going outside or being scared of social interactions of any sorts. This is also the fear of having those panic attacks in a public place where you could be humiliated in front of others.  It makes you avoid those places and basically makes you stay in your comfort zone, which is usually your home. Escaping the problem though, isn’t how you BEAT THE HELL OUT OF IT. Here is an article that can help you find solutions on how to control it: https://www.verywellmind.com/homebound-with-agoraphobia-2583911 it has a bunch of different solutions for everybody.\r\n</li></ul><p>Controls: Xbox 360 controller or Xbox One controller.</p><p>Best if played with headphones.</p><p>A game by Team Nefarious: Cristelle Sinnett, Félix Leblanc, Maxime Jacquet, Marie Gabrielle Plante, Maude Roussin and Myriam Boisvenue St-Jean, for JamNation 2.1 Game Jam.</p>", "metacritic": null, "released": "2018-10-07", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/1b9/1b92e3b4ab0f0c60f0839ff8cc09057c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 49, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["myri"], "genres": [], "publishers": [], "esrb_rating": null}