{"id": 251117, "slug": "nostromo", "name": "NOSTROMO", "name_original": "NOSTROMO", "description": "<p><strong>Comment jouer à Nostromo ?</strong><br/></p>\n<p>Dans Nostromo, vous dirigez un équipage<strong> </strong>de voyageurs intergalactiques, en quête du mystérieux SALSA (Super Artefact Légendaire du Savoir Ancien), qui sont membres du TANGO (le Talentueux Agglomérat des Nations Galactiques Organisées). <br/><br/>Votre tâche ne sera pas facile car vous serez pourchassés sans relâche par les chasseurs du RUMBA (un Royaume Ultra Méchant, Belliqueux et Acariâtre).<br/></p>\n<p>Pour survivre, vous devrez apprendre à utiliser les différentes infrastructures de votre vaisseau : tourelles (T1 à T4), laboratoire (L1), terminal de commande (C1), cultures hydroponiques (G1), pharmacie (D1), rayon (R1),  portails de téléportation (P1), etc. (il y a 14 bâtiments différents dans la première version du jeu). Vous devrez également veiller à l'état de votre vaisseau, indiqué par un % structurel, ainsi qu'au bien être des membres de votre équipage, indiqué par des points de santé (en rouge), d'énergie (en vert), de mental (en bleu) et de satiété (en jaune).<br/></p>\n<p>Pour débuter l'aventure, vous pouvez commencer par désactiver l'autopilote (A1) qui se trouve dans la salle la plus à droite de votre vaisseau. Cela vous permettra ensuite d'utiliser le terminal de commande (C1) pour voyager. Lorsque la progression de votre voyage aura atteint  100%, vous atteindrez une nouvelle planète. Si des chasseurs du RUMBA apparaissent, utilisez les tourelles (T1, T2, T3 &amp; T4) pour les détruire. Si un membre d'équipage perd des points de satiété (en jaune) envoyez-le à la cuisine (K1).<br/></p>\n<p><strong>Commandes : <br/></strong>- touche P pour mettre en pause<br/>- touches M, PLUS &amp; MINUS pour régler la musique et le son. <br/>- touche TAB pour sélectionner un membre d'équipage (par switch). <br/>- touches 1 à 9 du pavé numérique pour sélectionner un membre d'équipage (par rang). <br/>- touches directionnelles (ou QSDZ) pour déplacer un membre d'équipage sélectionné. <br/>- touche SPACE/ENTER pour qu'un membre d'équipage sélectionné actionne un bâtiment. <br/>- touche CTRL pour changer la sélection entre un membre d'équipage et un bâtiment. <br/>- CLIC GAUCHE de la souris pour faire une sélection.\r\n</p>\n<p><strong>Remarques : </strong><br/>- lorsqu'un membre d'équipage est bleu, il est actif (si vous déplacez le personnage l'action s'arrête). <br/>- lorsqu'un membre d'équipage est gris, il est inactif. <br/>- les textes en violet sont des messages de l'intelligence artificielle de votre vaisseau. <br/>- les textes en orange sont des messages des membres de votre équipage.</p>\n<p><strong>Développement de la version 1.0:</strong></p>\n<p>J'ai développé ce jeu seul en pur code Lua/LOVE, sans librairie externe ; c'est ma première expérience avec ce langage. <br/></p>\n<p>Je n'est pas chronométré mais je pense que la première version de jeu a bien dû nécessiter entre 30 et 40 heures de travail (réparties sur 6 jours).</p>\n<p>Il y a pas mal de génération procédurale : pour les membres d'équipage (noms &amp; statistiques), pour les planètes et pour les zones explorables des planètes.<br/></p>\n<p>Je n'ai pas utilisé d'algorithme de <em>pathfinding </em>(comme A* par exemple) dans cette version de jeu mais cela fait partie des évolutions possibles que j'envisage dans le programme. <br/></p>\n<p>Le jeu est toujours en cours de test de mon côté et je n'ai pas encore eu le temps de tester tous les résultats possibles d'exploration notamment (il y en a 150 en tout). <br/></p>\n<p>Si vous rencontré un bug, vous pouvez me laisser un message sur cette page et je m'empresserais de le corriger ! ^^<br/></p>\n<p><strong>Crédits (musique) : </strong></p>\n<p>La version du jeu 1.0 utilise 1 musique (CC BY 3.0) et 1 son (CC0) qui ont tous deux été téléchargés sur le site <em>opengameart.org </em>.</p>\n<p><em>Musica Universalis</em> (CC-BY 3.0) by  Pyerye (téléchargé sur<em> opengameart.org</em>).<br/></p>", "metacritic": null, "released": "2018-10-07", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/684/684cf4c8d9d74403a4c4cc85fcde51c6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 18, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Meraxes"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}