{"id": 251355, "slug": "tale", "name": "Tale", "name_original": "Tale", "description": "<p>A hardcore monster survival game in a simulated sandbox eco-system filled with lots of guns and magic. Planned release on Halloween.<br/><br/><strong>WASD</strong> - Move/Mine<br/><strong>Arrows </strong>- Mine<br/><strong>SPACE</strong> - Interact<br/><strong>K</strong> - Turn on/off rain<br/><strong>L</strong> - Turn on/off snow<br/>Wind is turned on by default.<br/><br/>Target audience: Terraria &amp; Minecraft<br/><br/><strong>*please read*</strong><br/><strong>There's not a lot to it, but the entire engine is almost done, including the inventory, sandbox, placing blocks, block generation, crafting (there's only an oven to craft, if you have 2 dirt blocks, click the purple square up somewhere and you can interact with the oven with space after placing it</strong><strong>), gun system (which isn't yet imported into the main game) </strong><strong>. And you can plant grass. </strong><br/><strong>But, I am interested in what you think the game feels like to you, if it has an identity and potential, since I want to release it on Halloween to an early access stage on Steam and start marketing it as soon as there is play-ability. I have three atmospheric songs for now, 1 is in the main menu (from opengameart) and 2 in game are mine.<br/><br/>Planned: You pretty much survive in a small world with a brutal season system and two monster spawners on each side, which you will shoot down every night and every 5th day is a horde. You'll be able to craft guns, tools, generate electricity and more. Objective will be to defend an obelisk in the middle (not yet in the game). You are playing as a monster as well, which you can evolve. You will be able to build a portal to the next dimension, every dimension is different and harder, until you beat all dimensions.<br/><br/>I really appreciate you taking your time to play!  Thank you!<br/><br/>Some of the current monster animations!<br/><br/><br/><br/></strong></p>", "metacritic": null, "released": "2018-10-05", "tba": false, "updated": "2019-08-28T23:20:02", "background_image": "https://media.rawg.io/media/screenshots/a6c/a6c4cda059c3eb8a5acabe9d99c1018c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 7, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["HolidayExplanation"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}