{"id": 251393, "slug": "dig-up-devrams-journey", "name": "Dig-Up! Devram’s Journey", "name_original": "Dig-Up! Devram’s Journey", "description": "<p><strong>This is the first game that I have been working on during my first year of University.  It is still very buggy, but it is in a playable state. I might decide to come later on this project in order to update it and make it better, if my studies allow me.</strong></p>\n<p><strong><em>Please leave some feedback, if you play the game! It would be very helpful for me. :3</em></strong></p>\n<p>Dig-Up! Devram’s Journey is a 2D digging game, which follows the journey of the archaeologist Devram towards the Fountain of Youth. While working on an archaeological dig in Egypt, he finds an ancient papyrus affirming the possibility of achieving eternal life, by drinking the waters of the fountain. Originally, a map was drawn to make the journey easier, but it was later torn apart in four pieces to avoid people abusing the power of it. However, the document tells where their locations. Devram’s Journey begins.<br/>The gameplay includes a randomly generated map, in which it is possible to destroy the terrain around Devram. Moreover, the archaeologist will have to face enemies, that can be attacked and defeated by fighting with his shovel, as the player digs furthermore. Both the number and location of the enemies is random and it will change each time the level will be restarted or replayed. Lastly, the levels include the presence of two different collectable items: coins, which increase the score, and the map pieces, located at the end of each level and needed to proceed in the game.</p>", "metacritic": null, "released": "2018-10-05", "tba": false, "updated": "2019-08-28T23:20:02", "background_image": "https://media.rawg.io/media/screenshots/9d0/9d075a93184e7f388698745bbbc36c0a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 31, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Android"], "developers": ["Rosie_Mable"], "genres": ["Adventure", "Platformer"], "publishers": [], "esrb_rating": null}