{"id": 251329, "slug": "avelions-2-all-stars", "name": "Avelions 2 - All Stars", "name_original": "Avelions 2 - All Stars", "description": "<p>Latest version : Demo v1.02\r\n<br/></p>\n<p><strong><strong>STORY</strong></strong>\n</p>\n<p>Ferdinan deiz Marceil was originally a Historia summoned by the Avelion of the<strong> </strong>Northern Sky, Maegarf Thal. Widely considered to be a genius Archmage, Ferde becomes a hope for the mankind in the Northern Sky to defend themself against Diaclou Sky Order invasion. Ferde's memory has been erased since he was kid so that Maegarf could refine him as a heartless living-weapon to its finest quality...But one year ago, outraged at Ferde's decision to reside with Diaclou Sky Order, Maegarf killed Ferde in the Battle of Archmages using the Four Disasters magic...</p>\n<p>...Knowing Ferde's rage and power, Lumina, the Servant of the Demon King, brings him back to life and give him unlimited magic pool to face Maegarf. Ferde who wants to get revenge against the Kingdoms Alliance and Stranded Heroes in the Northern Sky, seals his own emotion to break the bond to his creator. Soon after, Ferde claims himself to be a Grimoire Omega and places his chamber in the Tower of the Immortals and comes up with a plan to unite the Mortal World and the Demon World by finding and destroying the seal of the four worlds in the Tower of the Immortals... </p>\n<p>...Withstanding the vengeance, Maegarf sent another Historia, Sido Helvar, to put an end to Ferde's plan in the Tower...However, despite Ferde being defeated, Sido vanishes without a trace. While there are no more Historias that can be summoned to enter the tower, Auvrelyn, who was Sido's apprentice, enters the tower herself to search for her master...<br/></p>\n<p>F<strong><strong>EATURES</strong></strong></p>\r\n\r\n+ 6~8 HOURS OF GAMEPLAY (45 minutes for the Demo)\r\n+ ACTION BATTLE SYSTEM\r\n+ 2 PLAYABLE CHARACTERS\r\n+ 12 SIGN OF STAIRS\r\n+ WEAPON &amp; ARMOR CRAFTING\r\n+ UPGRADE YOUR HIDDEN BASE", "metacritic": null, "released": "2018-10-06", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/ebe/ebe912e928196ff9399822436ba01ba4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 156, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Hossi Games"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}