{"id": 251460, "slug": "shin-megami-tensei-digital-devil-saga", "name": "Shin Megami Tensei: Digital Devil Saga", "name_original": "Shin Megami Tensei: Digital Devil Saga", "description": "<p>Junkyard, a town of endless rain. With his four companions, Serf, the main character and a member of a tribe called Embryon, sets out for Nirvana, a land that can only be reached by the champions of Junkyard. They devote themselves to fighting against the never-ending resistance mustered by other tribes. In the midst of chaos, a mysterious object, the Pod, suddenly appears. Countless spheres of light are emitted by the Pod and infect Serf and his comrades, awakening their demonic powers. An unimaginable battle unfolds within their faint conscience. They develop a desire to tear the flesh and shatter the bones of their enemies, who have also been transformed. Their instincts tell them to devour every being in their path. Until then, Serf and his comrades only knew of battle, but for the first time, they experience new emotions. At that time, a dark-haired girl, Sera, comes to their rescue. Although she does not know where she came from, she holds a strange power - the power to control the party&#39;s demonic transformation. They receive orders from the Church of Karma to head for Nirvana, and they are accompanied by the dark-haired girl. &quot;They who reach Nirvana first shall be recognized as the champions of Junkyard.&quot; The struggle intensifies, and they discover that the girl holds a key to the mystery. But, true fear still awaits Serf&#39;s party. Including Embryon, the tribe that the main character leads, several groups are at war with each other in order to survive. &quot;Devour&quot; your enemies and absorb their devastating powers and special abilities!</p>", "metacritic": 78, "released": "2004-07-15", "tba": false, "updated": "2024-01-23T12:13:55", "background_image": "https://media.rawg.io/media/screenshots/5e8/5e81c7b26deefde08f8d3b858d9c20f9.jpg", "website": "", "rating": 4.27, "rating_top": 4, "added_by_status": {"yet": 19, "owned": 20, "beaten": 35, "toplay": 25, "dropped": 5, "playing": 4}, "playtime": 0, "achievements_count": 0, "ratings_count": 30, "suggestions_count": 159, "game_series_count": 39, "reviews_count": 30, "platforms": ["PlayStation 2"], "developers": ["Atlus"], "genres": ["RPG"], "publishers": ["Atlus"], "esrb_rating": null}