{"id": 2514, "slug": "the_hunted", "name": "The_Hunted", "name_original": "The_Hunted", "description": "Get ready for a new kind of multiplayer experience...<br/><br/>&amp;quot;The Hunted throws you into multiplayer battles where vision is everything.&amp;quot; - Touch Arcade<br/><br/>Nine Hunters from across the galaxy have been abducted, cloned, and forced to fight in the arena. Gather your friends and jump in to live out these action-packed multiplayer battles!<br/><br/>With mobile optimized dual-stick shooter controls and an inventive limited field of view you get a multiplayer deathmatch game that is perfect for your iPhone or iPad.<br/><br/>* Limited field of view lets you dodge, sneak by, trap, and hunt your enemies.<br/><br/>* Invite your friends and play with up to 8 players online.<br/><br/>* Nine unique characters, each with their own weapons and special abilities<br/><br/>* Multiple Game Modes - Deathmatch, King of the Hill, Krazy King, and Skulls.<br/><br/>* Play each mode as a free for all or on teams.<br/><br/>* Create your own game server to decide the map, game mode, and number of players. (Server hosting requires Wifi connection)<br/><br/>* Dedicated Servers - Meet your enemy on neutral ground using our new dedicated servers.<br/><br/>* Item Pickups - Grab the Double Damage to strengthen your attacks or the Shield to take more hits<br/><br/>* Optimized for iPhone/iPad Retina Display<br/><br/>- iPod 4G and iPad 1 are not supported<br/>- Multiplayer available on Wifi or Cellular connections, but server hosting is available only on a Wifi connection<br/><br/>Follow us on Twitter - @f5games.com<br/>Like us on Facebook - Facebook.com/f5games<br/><br/>Touch Arcade quote from - &amp;quot;Check Out &amp;#39;The Hunted&amp;#39;, a Dual Stick Multiplayer Shooter - http://toucharcade.com/2014/10/08/check-out-the-hunted-a-dual-stick-multiplayer-shooter/", "metacritic": null, "released": "2014-11-20", "tba": false, "updated": "2019-10-22T14:28:06", "background_image": "https://media.rawg.io/media/screenshots/d68/d685e20a84fd8ebe61de690ec7469c1a.jpeg", "website": "http://f5games.com/thehunted", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 81, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["F5 Games"], "genres": ["Action", "Arcade"], "publishers": ["F5 Games"], "esrb_rating": "Teen"}