{"id": 2515, "slug": "spongebob-marbles-slides", "name": "SpongeBob Marbles & Slides", "name_original": "SpongeBob Marbles & Slides", "description": "SpongeBob Marbles and Slides is a drawing-meets-physics puzzler that lets you play with SpongeBob and the rest of the Bikini Bottom gang as you never have before! <br/><br/>Help SpongeBob and friends foil Plankton’s plot to steal the Krabby Patty recipe! Navigate crazy obstacles and Plankton’s diabolical traps through various Bikini Bottom locations, rolling their marble-shaped bodies through level after level by drawing slides, using the environment, and tilting your device. <br/><br/>Earn bonus points based on how skillfully and quickly the levels are completed. Unlock achievements and more levels of play! <br/><br/>With SpongeBob Marbles and Slides you can: <br/>* Explore eighty levels of varying difficulty spread across Bikini Bottom <br/>* Draw lines to create slides and guide SpongeBob and his friends to safety <br/>* Use a variety of special tools—flippers, cannons, teleportals, etc.—to solve each puzzle <br/>* Compile a Spectacular Collection of Stuff: rack up achievements and collect tons of SpongeBob memorabilia<br/><br/>ADDITIONAL NOTES:<br/>SpongeBob Marbles &amp;amp; Slides collects personal user data as well as non-personal user data (including aggregated data).  User data collection is in accordance with applicable law, such as COPPA. User data may be used, for example, to respond to user requests; enable users to take advantage of certain features and services; personalize content and advertising; and manage and improve Nickelodeon&amp;#39;s services. For more information regarding Nickelodeon’s use of personal user data, please visit the Nickelodeon Group Privacy Policy. Our Privacy Policy is in addition to any terms, conditions or policies agreed to between you and Apple, Inc., and Nickelodeon and its affiliated entities are not responsible for Apple&amp;#39;s collection or use of your personal user data and information. Use of this app is subject to the Nickelodeon End User License Agreement.<br/><br/>Privacy Policy:<br/>http://www.nick.com/info/privacy-policy.html<br/><br/>End User License Agreement:<br/>http://www.nick.com/info/eula.html<br/><br/>", "metacritic": null, "released": "2010-10-08", "tba": false, "updated": "2019-10-22T14:28:06", "background_image": "https://media.rawg.io/media/screenshots/279/279d5c3423a9c3b58094914ebd6101d7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 214, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "Android"], "developers": ["Nickelodeon"], "genres": ["Puzzle"], "publishers": ["Viacom International"], "esrb_rating": "Everyone"}