{"id": 251566, "slug": "the-endless-empty", "name": "The Endless Empty", "name_original": "The Endless Empty", "description": "All sales of this game will be donated to the Trevor Project<br/><br/>It only took a few moments for the feeling of panic to set in. “What if I lived my life wrong? How would I be judged? What if there is nothing after this? <br/><br/>The story begins with an individual, recently deceased, who is struggling to comprehend the reality of being dead. The mind, disconnected and failing, desperately attempts to form some vision of reality. Yet, the memories of its life are only distant whispers. It can't recall a personality, friends, or even an appearance. But there is hope. The memories of the music, the disconnected emotions. And in a rush of information, sometimes there appear memories of her: the rockstar. <br/><br/>The Endless Empty is an adventure RPG with a focus on exploration and choices. The game explores the concepts of death and the afterlife, and takes place in 5 chapters. Each chapter has a different theme and a unique art style. The game takes the player on a branching journey through the unknown. there are a variety of memories to explore; From upbeat suburban neighborhoods, to gritty industrial wastelands, to colorful psychedelic hallucinations. <br/><br/>The game will feature a multilayered storyline with alternative paths and multiple endings as well as a customized battle system. Complementing the game will be a completely original soundtrack with classical, electronic, funk and rock musical styles.", "metacritic": null, "released": "2018-11-03", "tba": false, "updated": "2024-03-17T22:36:36", "background_image": "https://media.rawg.io/media/screenshots/7fe/7feb0e824d465f5424eccf0d22e49ea2.jpg", "website": "https://www.facebook.com/SugarySweetMachines/?ref=settings", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 15, "beaten": 3, "toplay": 4, "playing": 1}, "playtime": 5, "achievements_count": 5, "ratings_count": 3, "suggestions_count": 341, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC"], "developers": ["Erik Sheader-Smith"], "genres": ["Adventure", "RPG"], "publishers": ["Erik Sheader-Smith"], "esrb_rating": null}