{"id": 251578, "slug": "survival-ball", "name": "Survival Ball", "name_original": "Survival Ball", "description": "Single or Local Co-Op game with six distinct stages developing a simple premise: As the decaying world challenges you, don't fall!Six Distinct Stages<ul><li><strong>RocketX:</strong> Keep your rocket platform in the air and off the ground lava by refueling it with the parachuting fuel crates. Reach space 🚀<br/></li><li><strong>Hex Elevator:</strong> As the lava keeps rising, the only way up is through elevators which only go up when everyone has completed their prompts and are ready to go up.<br/></li><li><strong>Beatmill:</strong> The beat dictates the rhythm of the prompts along the crisscross treadmills. Hit them on time, or they will fall.<br/></li><li><strong>Venom Rig:</strong> Pillars are destroyed when their respective button is pressed, and rockets land to decay the platform. Avoid platform collapse.<br/></li><li><strong>Unfair Fair:</strong> A moody revolving wheel filled with ever spawning decay balloons.<br/></li><li><strong>Big Giant Head:</strong> Your final nemesis.</li></ul>Features:<ul><li>Move, Jump, Dash and Stomp are your tools. Use them to skillfully survive, help your teammates, confront enemies and interact with the world.<br/></li><li>Unlock the next stages and move on, or keep playing to improve your highscore.<br/></li><li>Support for a very wide range of gamepads (although not required, playing with a gamepad is recommended ❤️)<br/></li><li>Up to two players can use the keyboard to play simultaneously.</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:52:24", "background_image": "https://media.rawg.io/media/screenshots/313/313b0c826b883cf9a9b34115b6da1025.jpg", "website": "https://survivalball.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 119, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Rockbyte"], "genres": ["Action", "Indie"], "publishers": ["Rockbyte"], "esrb_rating": null}