{"id": 251545, "slug": "1971-indian-naval-front", "name": "1971: Indian Naval Front", "name_original": "1971: Indian Naval Front", "description": "<strong>1971 : Indian Naval Front is a Naval Combat game made as a tribute to the Indian Navy towards their contribution during the 1971 India-Pakistan War.</strong><br/><br/>1971 was a year filled with diplomatic tensions between India and her neighbour Pakistan. As the atrocities by the Armed Forces from West Pakistan against the people of East Pakistan kept increasing, <strong>Indira Gandhi</strong>, the then <strong>Prime Minister of India</strong> decided to act on it and determined to liberate <strong>East Pakistan(Bangladesh)</strong> as an independent country. During the months of <strong>October and November</strong> in 1971, Indian Navy sent her famed aircraft carrier <strong>INS Vikrant</strong> and few more powerful vessels to create a blockade against the naval vessels of <strong>West Pakistan</strong> and her <strong>allies</strong> in the <strong>Bay of Bengal</strong> to the East. Pakistan Air Force, on 3rd December, attacked multiple Indian airfields along the North and North West regions of India.<br/><br/><strong>The War had now officially begun!</strong><br/><br/>In retaliation, the Indian Navy sent 3 of her <strong>Osa-I class missile boats</strong> in an operation codenamed <strong>Operation Trident</strong> with an objective to destroy the <strong>Karachi Harbour</strong>. <strong>Operation Trident</strong> was a resounding success! After this point, major naval operations were kicked off in both the <strong>Eastern and Western waters</strong>; an encounter with the Pakistan Navy's <strong>Submarine PNS Ghazi</strong> being one of them. Indian Navy's fighter jets like the <strong>Hawker Seahawk</strong> were also used to destroy many East Pakistani Airfields and Harbours like <strong>Chittagong</strong> and <strong>Cox Bazaar</strong>.<br/><br/>On 16th December, Pakistan eventually signed the <strong>Instrument of Surrender</strong> and <strong>Bangladesh was declared an independent country</strong>.<br/><br/><strong>1971 : Indian Naval Front will enable you to experience pretty much all the Indian Navy operations executed during the 1971 War including transmission of intel through morse codes</strong>!Features<ul><li> Play with iconic ships of the Indian Navy like INS Vikrant, INS Rajput, INS Brahmaputra, INS Veer, etc.<br/></li><li> Experience real world missions in the form of a campaign like Operation Trident, taking out PNS Ghazi, destruction of airfields, etc.<br/></li><li> Wreak havok from the air using the Hawker Seahawk of Indian Navy.<br/></li><li> Fly the classic Westland Seaking helicopter for recon and search and rescue missions.<br/></li><li> 15 levels of naval and air combat missions.<br/></li><li> Transmit Morse Codes to deliver intel as part of the Military Intelligence team.<br/></li><li> A Quick Battle mode with preset scenarios and classic time-trial modes.</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:52:27", "background_image": "https://media.rawg.io/media/screenshots/735/73557ee2446ac305b079c691413a956a.jpg", "website": "http://www.neosphereinteractive.com", "rating": 0.0, "rating_top": 0, "added_by_status": {}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 303, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Neosphere Interactive"], "genres": ["Action", "Indie"], "publishers": ["Neosphere Interactive"], "esrb_rating": null}