{"id": 251511, "slug": "evenicle", "name": "Evenicle", "name_original": "Evenicle", "description": "GameplayWith mountains, valleys, seas, and skies to explore, it's a world-traversing RPG!<br/><br/>- Travel the world with a party of girls!<br/>- Beat up tons of monsters!<br/><br/>The meat of any adventure, combat is very much present here.<br/>Mix and match a variety of different skills to mow down your foes.<br/><br/>- Meet tons of people! Have tons of different experiences!<br/>- Travel by boat! Travel by balloon<br/><br/>Starting from a single, simple objective, the plot goes through all kinds of twists and turns.<br/>And as the story comes to a close…!<br/><br/>- Capture tons of gal monsters!<br/><br/>Not all monsters are nasty and scary.<br/>Some of them can be real cuties.<br/>If you manage to catch one, you’ll get to see it in a luscious pose!<br/><br/>- Defeat tons of Megamonsters...?<br/><br/>Giant and powerful, they're Megamonsters!<br/>Can anyone do anything to combat these ferociously mighty beings?StoryWhen Mother Eve created the world,<br/>she gave humans two rules to follow.<br/>One-- any given person may only ever have one sexual partner,<br/>and two-- killing another human being is forbidden.<br/><br/>All philanderers and murderers lose Mother Eve's blessing,<br/>and such sinners are branded as Outlaws and shunned.<br/><br/>The strongest people may be permitted to become Knights,<br/>and are allowed to marry multiple partners, so as to better pass down their superior genes.<br/><br/>Asterisk, our hero, wants to marry his two beautiful twin sisters.<br/>His solution to this quandary?<br/>\"I'll become a Knight and have lots of wives!\"<br/><br/>Thus, one young man sets off on an adventure!", "metacritic": null, "released": "2018-06-27", "tba": false, "updated": "2023-08-07T19:04:00", "background_image": "https://media.rawg.io/media/screenshots/6a9/6a950f3ce8749e2de6eeef3cd0f465fb.jpg", "website": "", "rating": 3.8, "rating_top": 5, "added_by_status": {"yet": 7, "owned": 48, "beaten": 4, "toplay": 6, "dropped": 5, "playing": 5}, "playtime": 11, "achievements_count": 0, "ratings_count": 10, "suggestions_count": 373, "game_series_count": 0, "reviews_count": 10, "platforms": ["PC"], "developers": ["Alicesoft"], "genres": ["RPG"], "publishers": ["MangaGamer"], "esrb_rating": null}