{"id": 251553, "slug": "winged-sakura-mindys-arc-2", "name": "Winged Sakura: Mindy's Arc 2", "name_original": "Winged Sakura: Mindy's Arc 2", "description": "Winged Sakura: Mindy's Arc 2 is a sequel to Winged Sakura: Mindy's Arc. It is not necessary to play the prequel to enjoy this game.<br/><strong>Story</strong><br/>Mindy Akumori recovers her memories and exits the dimensional world only to find her nation, Hysteria, in a brink of war. She voluntarily joins the Hysteria military and is now being personally trained under her sister, Cindy Akumori, a highly ranked commander.<br/><br/>Within a short amount of time, it was reported that the situation was more direr than the informants proclaimed. The enemy nations have gained access to a forbidden spell that has allowed them to conquer a clear majority of Hysteria in one fell swoop by deactivating and surpassing Hysteria’s defense.<br/><br/>Mindy receives an order to sortie east and she happily complies, but she encounters the unexpected and something nasty begins to stir...<br/><strong>Features</strong><br/><strong>Innovative Tower Defense</strong><br/>Experience a breathtaking Tower Defense game like no other. Strategically plan and overwhelm enemies by materializing time ticking units onto the battlefield or by casting powerful spells. Equip units with powerful items to unleash their fullest potential via our Progression System.<br/><br/><strong>Progression System</strong><br/>Level up and gain skill points to learn and upgrade skills. Equip units with powerful items that can be obtained through crafting and clearing stages. Enchant and uncap the items to maximize their stats.<br/><br/><strong>A Rewarding Grind</strong><br/>Boost the drop rates of any rare items you wish to obtain from a Free Battle stage to guarantee the item to drop within a few clears.<br/><br/><strong>Bond Abilities</strong><br/>Using a skill will trigger specific Unique units' Bond Abilities, making them perform powerful actions. Minzy and Nino's Bond Abilities can become even more powerful when you raise their Affection by completing their story events.<br/><br/><strong>Story Segments</strong><br/>15 Chapters split into two story arcs consisting of over 80 story segments, allowing you to revisit the events and reread as much as you'd like.<br/><br/><strong>Steam Trading Cards &amp; Leaderboards</strong><br/>Obtain popular emoticons creatively designed for the Winged Sakura series. Compete against others on the Steam Leaderboards.<br/><strong>Post Game Content</strong><br/><strong>Complex Boss Challenges</strong><br/>Designed for those who craves for more challenging post-game content. Utilize well-geared units to their fullest potential and overcome extremely difficult boss fights.<br/><br/><strong>Progressive Survival Mode</strong><br/>Unlock the most powerful items by playing through the Progressive Survival Mode up to 200 waves. A checkpoint is created every 10 successful wave clears, allowing you to easily farm for specific end-game items. After clearing all 200 waves, you can continue indefinitely, but checkpoints are no longer saved.<br/><br/><strong>Survival Mode</strong><br/>Designed for hardcore players who craves for a new experience every new playthrough. Challenge the hardest Survival Mode and see how far you can get on a separate save file where you start at level 1 with a starter unit. Every few wave clears will reward you with random rewards for you to progress indefinitely until you lose all your lives.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:52:26", "background_image": "https://media.rawg.io/media/screenshots/23a/23ac341436915fc879148a3049bb69a6.jpg", "website": "http://wingedsakura.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 5, "toplay": 1}, "playtime": 2, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 427, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["WINGED SAKURA GAMES"], "genres": ["RPG", "Strategy", "Indie"], "publishers": ["WINGED SAKURA GAMES"], "esrb_rating": null}