{"id": 251541, "slug": "shepard-fairey-vr-damaged", "name": "Shepard Fairey VR - DAMAGED", "name_original": "Shepard Fairey VR - DAMAGED", "description": "It’s been nearly 10 years since Shepard Fairey’s last solo exhibition in his hometown of Los Angeles and the iconic HOPE imagery he created for then Presidential candidate Barack Obama. Now for the very first time Shepard Fairey's work has been transformed into a virtual reality experience. experience his most ambitious show to date, aptly titled DAMAGED.<br/>\n<br/>\r\nIn this unprecedented political climate, Fairey’s message has changed from hope to purpose: “DAMAGED is an honest diagnosis, but diagnosis is the first step to recognising and solving problems. I definitely think that art can be part of the solution because it can inspire people to look at an issue they might otherwise ignore or reject.”<br/>\n<br/>\r\nDAMAGED also takes aim at another hindrance to reformative communication: social media. For what should be the most meaningful platform for important discussion ever created, discourse has fallen secondary to self-indulgence and celebrity: “Even prior to the election, I’ve been troubled by the social media mentality of ‘construct your own reality’ in superficial terms, at least. The internet and social media are valuable for democratization, but as Marshall McLuhan warned with his—”the medium is the message”—the rapid pace and temporary nature of social media can lead to throwaway approaches from the consumer and the creator…”<br/>\n<br/>\r\n* Listen to over 100 minutes of exclusive narration by Shepard Fairey.<br/>\r\n* Interact with hundreds of artworks, including world premier exclusives.<br/>\r\n* A full three dimensional photo realistic representation of his Damaged show.<br/>\n<br/>\r\nJoin Shepard Fairey in this state of the art virtual reality experience, where he will share his thoughts and methods behind his artwork.", "metacritic": null, "released": "2018-10-15", "tba": false, "updated": "2019-08-28T21:52:27", "background_image": "https://media.rawg.io/media/screenshots/2ba/2ba955946e9a52f454aef5997f12f732.jpg", "website": "http://www.vrtventures.art", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 161, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Talespin"], "genres": ["Simulation", "Casual"], "publishers": ["VRt Ventures"], "esrb_rating": null}