{"id": 251698, "slug": "world-of-apes", "name": "World Of Apes", "name_original": "World Of Apes", "description": "Play for the survival of the apes in Evergreen hills. The battle is between the dangerous monster apes and the ruthless evil humans. Play as an angry ape to fight the battle with the human forces and become the savior of your specie. Play the most challenging survival missions as an angry ape hero fighter. With an exciting gameplay and thrilling adventures, this action game “World of Apes” is an epic play. Enter the world of ultimate survival games. Survive the escape missions in a jungle among stranded deep forest hills. An ultimate survival adventure in a cave! Plan a strategy to the human race, escape from the warriors and survive the mission. It’s going to be a hard time to escape this island. Now its time to start your stealth operations to get free from this evil enemy. Move as invisible as a ghost Fight like a ninja, search for weapons to kill the enemy. Craft your own destiny escape like a real commando hero. Go for your freedom and save the entire race in mountains. Run for your life, fight the brutally targeted missions in a forest &amp; mountains. As a mastermind attack your rivals to take revenge for the blood of your fellow apes. Give them a hard time. Bang the rivals and thrash into an enemy. Have a safe escape!<br/><br/>“Human is the true enemy of nature “, many of us have only heard this but the people of Evergreen Hills Town witnessed the incident when it became a Warzone between the humans &amp; Apes revolution. In a faraway jungle of Evergreen Hills, there lived apes for centuries in some areas. As the political power in the US changed, many remote places &amp; Natural Parks were acquired by the government to build &amp; expand new towns including Evergreen Hills &amp; mountains. The mayor of the town ordered to expand the town by cutting down the dense Jungles of Evergreen Hills but they crossed the line by killing many of the Apes families. What happens next is a lesson to mankind that is ‘Don’t play with nature, when you hurt nature it hurts you back’. When they were attacked, they counter-attacked the humans to defend their species. This evolution has initiated a battle for island hero survival. The tyrannical regime of humans has lost the balance of nature. Survive against all the odds.<br/><br/>World of Apes features:<br/>√ Amazing 3D Jungle Environment<br/>√ Exciting gameplay​ challenging escape missions<br/>√ Real Thrill of Escaping the Jungle and chase game<br/>√ Thrill of Playing the Role of an angry ape<br/>√ Action packed challenging escape missions<br/>√ Excellent sound effects", "metacritic": null, "released": "2018-08-02", "tba": false, "updated": "2019-10-22T14:10:55", "background_image": "https://media.rawg.io/media/screenshots/dba/dba829c249007b6deff8ce566261b42d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 168, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Syed Haris Izhar"], "genres": ["Action", "Adventure"], "publishers": ["Syed Haris Izhar"], "esrb_rating": "Mature"}