{"id": 251690, "slug": "police-flying-car-chase", "name": "Police Flying Car Chase", "name_original": "Police Flying Car Chase", "description": "Do you love police car chase games? Do you ever wanted to fly a flying police car &amp; Have a Airborn Fight with Escaped Prisoners, Terrorists &amp; Criminals. Get ready for thrilling experience of Flying Cop Car Drive! You will feel like you are living in Future. You only need airplane pilot skills &amp; Car Driving Skills. Fly you car high &amp; Hunt down criminals after a stunning chase. Yes its a Fully modified Flying Police Car; Drive your police car do stunts and drifts in city &amp; air on same time.<br/><br/>Its totally different experience to chase criminals in Extreme Flying Police Car. In this game you will be a Cop who is Driving Flying police car &amp; chasing Criminals or breakout prisoners. You enemy also have flying cars &amp; they are attacking your city; You will feel like a aircraft pilot who shoot at criminals Flying Cars and destroy their planes. Its a Future Super Car you will not find it anywhere. Turn on siren, lock on target, launch missile, bombard and takedown criminals be the legendary super hero of the world. Enjoy flying police car and be the topnotch cop.<br/><br/>Police Flying Car Chase 2020 Game is made for all Fans of Police Games, Airplane Flight Games, Free Car Driving Games and Simulation Games.<br/><br/>Police Flying Car Chase 2020 Features <br/>- Test your Police Car Driving Skills<br/>- Improve Airplane Flight Ability<br/>- Advanced airplane flight physics<br/>- Realistic and dynamic auto physics<br/>- Stunning HD Graphics<br/>- Epic Futuristic 3D City<br/>- Easy &amp; Free to use<br/>- Muscle Cop Car Model<br/><br/>Download now and feel the best airplane flight experience!", "metacritic": null, "released": "2018-07-24", "tba": false, "updated": "2019-10-22T14:10:54", "background_image": "https://media.rawg.io/media/screenshots/3b1/3b1b370fb49fa066ddc984a78f4236b1_HpbXwUZ.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 138, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Syed Haris Izhar"], "genres": ["Action", "Simulation"], "publishers": ["Syed Haris Izhar"], "esrb_rating": "Teen"}