{"id": 2516, "slug": "wizard-quest", "name": "Wizard Quest", "name_original": "Wizard Quest", "description": "Wizard Quest is an epic journey through a mysterious experience where you are the master of the world around you, and the landscape becomes the game board. Uncover the rich storyline while casting spells using elemental forces to clear paths, vanquish cunning monsters, unlock doors, and burst open chests full of mana. Conjure powerful weapons and magic items to defeat a myriad of hostile creatures and explore custom built and unique quest levels.  Can you survive and discover the secrets of your adventure? <br/><br/>Wizard Quest&amp;#39;s Match-3 gameplay is easy to learn, and grows in depth and complexity to challenge the most advanced demanding puzzle gamers. For the more competitive and social players, they can share videos of your progress or conquests, challenge and dominate friends in high-score leaderboards, unlock achievements and complete quests for rewards.<br/>_______<br/><br/>* Unique match-3 spell casting system for navigation and combat<br/>* Large world to explore with main story quests and more challenging side quests<br/>* Large horde of monsters who will fizzle your spells, mirror your attacks, beat on you, and kill you each in their own unique way<br/>* Weapon and Item Conjuration and Collection system with hundreds of pieces of equipment to arm and master!<br/>* Earn Mana and Crystals from Levels and Quest Journal to build up your inventory and customize your character<br/>* RPG Level Up and Skill Point system to customize your wizard<br/>* Competitive Social World and Quest Leaderboards <br/>* Rich Story and Fantasy Game World<br/>* Immersive custom music soundtrack<br/>* Detailed and creative pixel art and visual monster design <br/>_______<br/><br/>NOTE: The game does not support 3rd Gen iPhone/iPod.", "metacritic": null, "released": "2014-01-30", "tba": false, "updated": "2019-10-22T14:28:06", "background_image": "https://media.rawg.io/media/screenshots/cb5/cb52efa73b46296053c20231ed8da5be.jpeg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 189, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Mana Giant"], "genres": ["RPG", "Puzzle"], "publishers": ["Mana Giant Oy"], "esrb_rating": "Teen"}