{"id": 251669, "slug": "basketball-real-fight-stars", "name": "Basketball Real Fight Stars", "name_original": "Basketball Real Fight Stars", "description": "Once the basketball matches are over, the regular rules of the game states the players go to their locker rooms and chill out a bit but tonight... tension between players needs to be unleashed! Are you ready to participate in the mortal combat of the battle warriors of basketball? Let Le Bron leads you through the thrills of this versus battle and win the fight against your basketball rivals to get to the top of the leaderboards and proclaim yourself master of the mortal combat warriors. Time to attack the enemy fighters! Slash, kick, get the most out of your fists und dunk your enemies against the floor!<br/><br/><br/><br/>There are no rules in the mortal combat of the battle warriors of basketball. Play with Le Bron or any of your favorite basketball stars. Learn how to perform combos that will help you to win all the combats. Win all the rounds and use the defense position to refrain your enemies from having any chance to take the victory home. <br/><br/><br/><br/>Compete in different rounds and fight against mortal enemies. Progress through the tournament and win coins to upgrade your character and become invincible! Step by step you will be able to defeat all your rivals of the mortal combat of the battle warriors of basketball. Start practice your combos now!<br/><br/><br/><br/>Features:<br/><br/>- Many basketball stars! Choose to play with Le Bron or your favorite player from the mortal combat warriors!<br/><br/>- Win all the rounds of the battle and take the victory home with you!<br/><br/>- Complete the different battle modes and unlock upgrades for Le Bron!<br/><br/>- Take your fighter to the top of the leaderboards and become an invincible basketball star!<br/><br/>- Share your achievements with your friends!<br/><br/><br/><br/>Join now the basketball battle of the mortal combat warriors with Le Bron and have a new perspective of this amazing sport and its players! It is time to fight out of the court! Play now!", "metacritic": null, "released": "2018-12-08", "tba": false, "updated": "2019-10-22T14:10:55", "background_image": "https://media.rawg.io/media/screenshots/f36/f3630a1e44da2da3bbe27b92c6903181_tmXpZnc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 207, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["BEST FREE GAMES-FUN APPS"], "genres": ["Adventure", "Sports"], "publishers": ["BEST FREE GAMES-FUN APPS"], "esrb_rating": null}