{"id": 251714, "slug": "mafia-in-highschool", "name": "Mafia in HighSchool", "name_original": "Mafia in HighSchool", "description": "We hope you Love High School Gangster Games &amp; Underworld Grand Mafia Escape Games. This open world High School Mafia Game is most Epic Mafia Hustle Gang Life Action Adventure Game is a combination of High school games &amp; Mafia gangster games. Its not like other High School Love Story or High School Romance Games its Real Mafia in High School Gang Life Game. This is the story of Downtown Mafia Cartel Gang Fighters family who rule the Vegas Crime City &amp; American High School Gangs. Play as Jack Williams, A evil minded highschool student from Godfather Mafia Family who rule the open world streets &amp; mafia towns is running a gang of evil students. Jack the gang hero is an evil kid who leads this survival gang land they call it Mafiasos &amp; All member of this american high school gang belongs to rich mafia godfather families. Evil Mafiasos are big time house party kids &amp; they bully everyone in High school master dash. They rule the best high school of Vegas Crime City they strike girlfriends &amp; boyfriends with flying paper ball, Steal lunch boxes, Steal bags, Steal exam papers at night, Gang fighting with security guards, Hit crazy teachers &amp; Hit city police officers with strike weapons in attack fighting mission. American High School frontline security authorities are unable to stop these bullying warrior blood run fast to dodge them for your life survival don't let them chase!<br/><br/>State Department strike against the Downtown Mafia Lords which ignite the mafia battle &amp; Ruin the romantic love story of charming high school sweethearts forever. Rich Mafiosos are now suspended from American high schools &amp; they are ready to take revenge mafia. Mafiosos are targeting Angry Teachers &amp; Handsome legend hero's students like the gang in high school. Vegas City Police is now involved in this fiasco &amp; Mafiosos has to escape high school in a secret manner in gang games. Battle nightmare between Grand Mafia &amp; City Police has just begun in high school revenge games. You have to escape high school &amp; fight in the open world as an amazing gangsta in high school simulator. Its an incredible battle game for those who love high school escape the room games &amp; High School Adventure Games. Crime City Police fighters are ready to strike on mafia thieves &amp; street warriors in escape revenge mission. Sneak into secret classroom, Principle office &amp; angry teachers room to complete shadow missions. Play this awesome mafia hero boss game like a ​fighter in High school NOW! fight the boss &amp; Make a great &amp; safer exit from Mafia in High School Survival Game.<br/><br/>Mafia in High School Features:<br/>- Easy and fun to play<br/>- Smooth, Easy &amp; Intuitive Controls<br/>- Exciting and challenging gameplay<br/>- Different Combat &amp; Fighting Weapons<br/>- Stunning &amp; High-Quality 3D Graphics<br/>- Fun challenging missions of school life<br/>- Amazing High-End School 3D Environment<br/><br/>You can play this game without wifi &amp; it's 100% offline game. This High School Survival Game is FREE &amp; FUN, So Download NOW!", "metacritic": null, "released": "2018-08-05", "tba": false, "updated": "2019-10-22T14:10:56", "background_image": "https://media.rawg.io/media/screenshots/f63/f6328bf6aae207855fd7c4c8c76dc1e5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 94, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Syed Haris Izhar"], "genres": ["Action", "Adventure"], "publishers": ["Syed Haris Izhar"], "esrb_rating": "Mature"}