{"id": 251796, "slug": "kiss-of-war", "name": "Kiss of War", "name_original": "Kiss of War", "description": "Set in World War II, Kiss of War is a war strategy game about a group of unique and charming females with extraordinary life experiences. During the war, they joined a secret agent organization to help the Allies to fight against invaders. You will play as a commander in the Allies, train strong armies, recruit beautiful agents as officers to lead your armies, rally all commanders in the world to eliminate invaders and ultimately build a stronger allied force to maintain peace in this world!<br/><br/>1. Brand New Army Control System<br/>The game has adopted a ground-breaking free control system with which players can command several troops on the battlefield. March, garrison, change targets, adjust marching routes, operate everything at your will. It will not just be about who has the stronger forces, but who has the better strategy.<br/><br/>2. Vivid War Scenarios<br/>According to Europe's actual geography in Word War II, we've built vivid cities and battlefields, particularly iconic buildings everyone can recognize. In addition, we've modeled famed weapons of war that were in use during World War II, sending you back to that legendary time.<br/><br/>3. Multi-player Real-time Battles <br/>It's not about battling AIs. We're talking about battling real players. Befriend them or act against, it's all up to you.<br/>Hundreds of players participate in this legendary battlefield. Expand your guild territory, demonstrate your power, and conquer the land!", "metacritic": null, "released": "2018-04-11", "tba": false, "updated": "2019-12-27T01:53:11", "background_image": "https://media.rawg.io/media/screenshots/944/9441f10efe0698ab56a7b6aa72791dfa.jpg", "website": "", "rating": 4.43, "rating_top": 4, "added_by_status": {"owned": 10, "toplay": 2, "playing": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 6, "suggestions_count": 397, "game_series_count": 0, "reviews_count": 7, "platforms": ["iOS"], "developers": ["tap4fun"], "genres": ["Action", "Strategy"], "publishers": ["Tap4Fun"], "esrb_rating": "Mature"}