{"id": 251709, "slug": "freecell-classic-2", "name": "FreeCell Classic :)", "name_original": "FreeCell Classic :)", "description": "The App Store's most user friendly FreeCell solitaire card game, for FREE! <br/><br/>Test your focus and strategy skills with FreeCell Classic :). This classic card game and brain training app tracks your achievements as you rise through various difficulty levels and compete against other players! <br/><br/>FreeCell Classic :) card game features:<br/><br/>• FreeCell just like you'd expect it!<br/>• Statistics that track your progress<br/>• User-friendly interface. If you’ve made a wrong move, simply hit “Undo” and keep playing!<br/>• Game Center integration. Earn achievements and compete with your friends to see who's best at FreeCell<br/>• A quest mode to unlock the secret of the castle and free the king from his cell<br/>• This card game works for both iPhone and iPad, and portrait and landscape modes (play anytime, anywhere!)<br/><br/>** Conquer 400 games within this FreeCell solitaire card game to complete the quest. Each game you complete brings you closer to filling up a piece of the picture. What’s the picture? Play to find out! :) <br/><br/>Brought to you by Maple Media, the Solitaire, Mahjong and Sudoku Company. Challenge yourself, conquer each card game in the app, and please feel free to email us at contact@maplemedia.io if you have questions or concerns.", "metacritic": null, "released": "2011-12-16", "tba": false, "updated": "2019-10-22T14:10:56", "background_image": "https://media.rawg.io/media/screenshots/6b2/6b29d5482d044812b1f551b6a4257645.jpg", "website": "http://www.maplemedia.io/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 63, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Solitaire, Mahjong and Sudoku Company"], "genres": ["Strategy", "Card"], "publishers": ["The Solitaire, Mahjong and Sudoku Company"], "esrb_rating": null}