{"id": 251728, "slug": "royal-hero-dungeon-survival", "name": "Royal Hero Dungeon Survival", "name_original": "Royal Hero Dungeon Survival", "description": "Welcome to the Quest of Dungeon Escape Survival. You have played a lot of Survival Island Games &amp; Survival Jungle Games but this one is the most Epic Survival Prison Escape Game. It’s the prison survival escape story of Prince of Anatolia. Prince Yilmaz is the real-life legend, a fighter &amp; a war hero survivor as he fights the war survival horror many times. He is the only son of the King. There was an ultimate clash of armies in Anatolia convert in the Great Battle of North Anatolia. The royal​ family of Anatolia lost the battle at last &amp; was captured on the last day of battle by enemies. Royale Family was imprisoned in a far away lava mountains dungeon where it was impossible to survive &amp; escape. Their Village, Castle and Farms were attacked &amp; destroyed. You have to play as a royale hero prince in Anatolia. It’s your mission to escape the dungeon, Do Jungle Survival. Use your ninja survival skills in this survival jail game to escape the prison. Dark Shadows are capturing the royal empire of Anatolia. The defender hero prince has to take revenge &amp; strike in defense of their Empire. You have to use your hero skills to cross devil mountain &amp; use a raft to cross the mighty river. Use your hunter skills to survive in jungle. Play the best Prison Escape game now. We hope it will be a fun to go on a quest for Prison Escape. <br/>Yilmaz is not only a Prince but also a brave warrior &amp; a survivor hero. The Dungeon has only one way out which is heavily guarded by the Knights in every area. Yilmaz first has to get out of the cell to find his warrior weapons. After that he has to find where the royal families are kept imprisoned in the Dungeon. The fate of the Anatolia is in Yilmaz hands as he has decided to save Royale families by surviving &amp; escaping the dungeon. Escape from the dungeon jail like a real hero commando for survival. Go on a quest of your freedom. Survival adventure begins with a hard time to escape from this dungeon Prison along with the other royale prisoners. Play survival missions in a dangerous jungle with wild animals and use your driving skills to drive a boat to escape. Use all the possible tools to defend yourself from thugs and enemies. The hard time will pass away once you breakout free from the prison. Try escaping from even the narrowest ways. Give them a hard time. Bang the rivals and thrash into wardens. Have a safe escape from your cell! Fight the brutal guards and wild dogs with hints and tools. Grab your weapons, make use of your archery skills to fight for your survival.<br/><br/><br/>It’s the Top Free Game in Survival Simulator category. You can play this game without wifi &amp; its 100% offline game. This Survival Game is FREE &amp; FUN, So Download NOW!", "metacritic": null, "released": "2018-07-28", "tba": false, "updated": "2019-10-22T14:10:57", "background_image": "https://media.rawg.io/media/screenshots/ff4/ff4c1ed01eda41bbd4f498ca6e9de705_C95WdWk.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 90, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Syed Haris Izhar"], "genres": ["Action", "Arcade"], "publishers": ["Syed Haris Izhar"], "esrb_rating": "Mature"}