{"id": 251720, "slug": "mongol-warrior", "name": "Mongol Warrior", "name_original": "Mongol Warrior", "description": "Play the role of an epic Mongol Warrior battle as a General Commander to fight the enemy. There has been a clash. The great survival war needs a legend fighter superhero man with an army of troops and knights on the defensive line to win the battle and save the empire. The powerful supreme commander will lead the battle in the arena to get the glory. Attack, fight and kill the enemies to win the real-time battles. Strategically plan your attacks to save the people of Karluk. Don’t let the enemies escape the battlefield. Get ready for an action-packed adventure. Witness the legendary fighter fight like a real superhero with his mighty sword. This survival game is all about battle, fight, attack and kill in an ancient world. Plan strategies to fight the great war fearlessly and help the other troop's fighter defeat the enemy. This action-packed superhero fighting game needs a real fighter hero to defeat the enemy clans, take revenge and save the region of Karluk. Fight the war like a real hero legend in one of the best warrior fighting games. Attack and win to get the glory. <br/><br/>It dates back to the 12th and 13th century where the Mongol Empire was on rising conquering many regions of Central Asia. After Benghazi Khan &amp; his army defeated the local Mongolian tribe Naimans in the early 12th Century, their ruler Kublagh fled to Qara Khitai to take refuge. To plan his return, Kubla took control over the Karluk region &amp; started persecuting the people of Almaliq City who refused to ally with him. Now the Karluk people has asked for aid from Mongol Warriors to save them. To pursue Kublagh, Benghazi Khan has dispatched is General Commander Tabur Khan army to fight the Kubla forces &amp; saving the region of Karluk. Use your sword to assassinate those who comes your way to become a grand fighter lord. Sneak away from a strike, escape like a hero and get back the rule. Enjoy this fun addictive game with true legend fighter! Be prepared for any situation. Attack before the hunters hunt you down. Fight to win the battle against the evil. Experience the most addictive survival action superhero games Mongol Warrior: Super Hero Epic Battle with brave warrior heroes. Survive the most dangerous challenges that come your way. Mongol Warrior is an action combat game of epic legends. It’s a superhero challenge to work on a mission in a captured empire. If you are a fan of superhero movies, you will love to play this superhero battle. Superhero games for free!<br/><br/>Mongol Warrior: Super Hero Epic Battle features:<br/><br/>- Action packed levels<br/>- Smooth, addictive and easy gameplay<br/>- Different tools to fight &amp; win your battle<br/>- Smooth and easy controls of the Sultan warrior hero<br/>- Amazing superhero backgrounds of a superhero city<br/>- superhero unlimited fun of superhero vs villain game<br/>- An epic war between warrior hero vs the enemies superhero games<br/>- Challenging superhero​ fighting games missions in a 3D ancient city environment<br/>- Realistic animations of superhero powers, fighting warrior tales and superhero effects", "metacritic": null, "released": "2018-09-01", "tba": false, "updated": "2019-10-22T14:10:56", "background_image": "https://media.rawg.io/media/screenshots/0c6/0c68707d8990e8b32045a75d16e4be59.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 137, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Syed Haris Izhar"], "genres": ["Action", "Arcade"], "publishers": ["Syed Haris Izhar"], "esrb_rating": "Mature"}