{"id": 251864, "slug": "hugo-world", "name": "Hugo World", "name_original": "Hugo World", "description": "Hugo World is a new game experience where you are helping Hugo and Hugolina in their search for new troll species and in building a unique and fantastic troll town with houses, shops, fields and much more.<br/><br/>Hugo and Hugolina had always believed they were the last troll family left in the world. But one day Charlie the Stork had exciting news to tell. There were lots of trolls out there and they all wanted to live together in a large troll town. Hugo and Hugolina immediately picked up the challenge and started dreaming up how the city could be. They quickly realized it would be a huge task.<br/><br/>Hugo needs your help! Build the largest and prettiest troll town that has ever existed. Set up the village with the many different trolls and their unique troll homes. Help Charlie the Stork in the search for rare trolls for the town and help Hugo cook food for the trolls and watch them grow.<br/><br/>PLEASE NOTE! Hugo World is completely free to play, however some game items can also be purchased for real money. If you don't want to use this feature, please disable in-app purchase in the settings of your device.<br/><br/>In Hugo World you can: <br/><br/>• Build your own troll town with paths, streams, houses and shops<br/>• Find all the rare trolls<br/>• Explore Hugo’s gold mine and find building materials and treasures<br/>• Test your skills in the woodchopper game and see how many combinations you can chop<br/>• Solve the quests Hugo gives you<br/>• Grow your fields and harvest wheat, spices and vegetables<br/>• Make honey in your bee hive<br/>• Cook food for your trolls and watch them grow<br/>• See your trolls change looks when they grow up (gain levels)<br/>• Catch the witch Sculla!<br/>• Remove the weed and keep your town clean<br/>• Find the missing troll baby Rit<br/>• Sell your goods to the troll world<br/>• Compete with your friends in building the prettiest troll town<br/>…and much much more", "metacritic": null, "released": "2014-01-15", "tba": false, "updated": "2019-10-22T14:11:03", "background_image": "https://media.rawg.io/media/screenshots/296/2966e6658693c2ddf0f3b685509ca533_gvs9hPi.jpg", "website": "http://www.hugogames.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 207, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Hugo Games A/S"], "genres": ["Simulation", "Family"], "publishers": ["Hugo Games ApS"], "esrb_rating": "Everyone 10+"}