{"id": 251866, "slug": "soccer-shootout-penalty-kick", "name": "Soccer Shootout: Penalty Kick", "name_original": "Soccer Shootout: Penalty Kick", "description": "Can you make the shot? Can you make the save? Can you handle the pressure as a stadium of sports fans looks on? <br/><br/>New authentic multiplayer penalty kick game Soccer Shootout puts you in the roles of football kicker and keeper for an ultimate showdown. Enjoy live, 3D gameplay with a simple flick of a finger. Build your dream team of kickers and train them in special skills. Go head to head with opponents from around the world in free and unlimited challenges. Win rich rewards every week! Are you ready to be a hero? The world is watching.<br/><br/>VISUALLY STUNNING<br/>Feast your eyes on vivid 3D graphics and realistic player animation. Soccer Shootout’s fantastic game physics engine shows your spectacular goals and saves in grand detail. Enjoy slow motion replay for those too fast the first time.<br/><br/>INTUITIVE GAMEPLAY<br/>It’s easy learning to score with the game’s simple finger flick game operation. However, live championship and cup matches against international opponents will require perfect performance for the final face off. <br/><br/>MANAGE YOUR TEAM<br/>As manager you’ll train them in diverse penalty star tactics and skills for a wide range of player specialties. Make sure they’re ready for weekly league tournaments to win honors and prizes, climbing to the top of the ranks. <br/><br/>CUSTOMIZE EVERYTHING<br/>Give your team unique style with abundant customization options such as boots, balls, stadiums, and officially-authorized jerseys from premier clubs like Benfica, Valencia, and Liverpool!", "metacritic": null, "released": "2016-10-26", "tba": false, "updated": "2019-10-22T14:11:03", "background_image": "https://media.rawg.io/media/screenshots/08d/08db7eeef7a5973292dff1c578eb4da7.jpg", "website": "https://www.facebook.com/groups/SoccerShootout/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 171, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["gamegou"], "genres": ["Simulation", "Sports"], "publishers": ["baldongx he"], "esrb_rating": "Everyone 10+"}