{"id": 25206, "slug": "dk-jungle-climber", "name": "DK: Jungle Climber", "name_original": "DK: Jungle Climber", "description": "<p>\n      King K. Rool is up to no good again, and it’s up to Donkey Kong to swing \n      into action. Using the same simple control scheme that made the DK: King \n      of Swing Game Boy Advance SP game so accessible and fun to play, players \n      of all skill levels can swing and climb to new heights made possible by \n      the dual screens of Nintendo DS.\n    </p><ul>\n<li>\n        King K. Rool is up to no good again, and it's up to Donkey Kong to \n        swing into action. Using the same simple control scheme that made the \n        DK: King of Swing Game Boy Advance SP game so accessible and fun to \n        play, players of all skill levels can swing and climb to new heights \n        made possible by the dual screens of Nintendo DS.\n      </li>\n<li>\n        Not only does Adventure mode feature Diddy Kong as a sub-character, \n        but players can look forward to new moves, new items and a bunch of \n        mini-games sure to make them go bananas. Not only that, but fun \n        tutorials that ease new players into the game also can be accessed as \n        mini-game challenges.\n      </li>\n<li>\n        If players are more in the mood to rumble, they can take on up to \n        three pals in fun multiplayer challenges using DS Download Play and \n        the DS Local Area Network. They can pick from Donkey Kong, Diddy Kong, \n        Dixie Kong or Funky Kong, and let the monkey business begin.\n      </li>\n</ul>", "metacritic": null, "released": "2007-09-10", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/2f9/2f981ad5709ce36a9ae2573a878f698f.jpg", "website": "", "rating": 3.0, "rating_top": 4, "added_by_status": {"owned": 8, "beaten": 3, "toplay": 3, "dropped": 5}, "playtime": 0, "achievements_count": 0, "ratings_count": 6, "suggestions_count": 127, "game_series_count": 0, "reviews_count": 7, "platforms": ["Wii U", "Nintendo DS"], "developers": ["Nintendo"], "genres": [], "publishers": ["Nintendo"], "esrb_rating": null}