{"id": 252176, "slug": "silly-spin-abc", "name": "Silly Spin ABC", "name_original": "Silly Spin ABC", "description": "Swipe, spin and tap the colorful alphabet wheel to play.  Enter the Silly Spin ABC world and interact with animated bugs, animals and silly characters for all 26 letters of the alphabet!<br/>Children of all ages will love to discover and explore each animated picture as they familiarize themselves with the letters of the alphabet. <br/><br/>FEATURES INCLUDE <br/>- Easy touch forwards and backwards, spinning wheel with all 26 letters of the alphabet. <br/>- 26 interactive letters, PLUS 26 auto play letters. <br/>- Four entertaining modes to play. Interactive, Easy Play, Swipe and Tap and Tap and play as a Movie.<br/>- Player can choose to play the most challenging and interactive mode for a fully interactive game down to the easiest mode where the game plays automatically like a video. <br/>- Hidden fun facts and up to five interactive buttons in each alphabet letter <br/>- Original rock 'n' roll ABC song. <br/>- Age appropriate and visual stimulating graphics. <br/>- Amusing sound effects that correspond with each action. <br/>- Hear and see the action, teaching eye hand coordination. <br/>- Hear and see each letter of the alphabet with a word that starts with corresponding letter. <br/>- Kid tested and approved. <br/>- Teacher, speech and occupational therapist tested and approved. <br/>- Ability to turn ABC song on or off. <br/>- Endless hours of play. <br/>- Excellent learning game for young children. <br/>- Our apps do not collect any personal information or promote third-party advertising.<br/><br/><br/><br/>For information on our upcoming updates and  releases: <br/>Visit us: www.LearningGiraffe.com  or  www.SillySpinABC.com <br/>Facebook: www.facebook.com/LearningGiraffe  <br/>Support: hello@LearningGiraffe.com   <br/> <br/>Recommended Ages: 0-6", "metacritic": null, "released": "2013-08-18", "tba": false, "updated": "2019-10-22T14:11:14", "background_image": "https://media.rawg.io/media/screenshots/e26/e264b64e3f14c4fe1e84b0c5ac413d97_ecBbENV.jpg", "website": "http://www.SillySpin.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 93, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["LearningGiraffe"], "genres": ["Family"], "publishers": ["Learning Giraffe"], "esrb_rating": "Everyone 10+"}