{"id": 252142, "slug": "chaos-combat-copters-hd-1-multiplayer-helicopter-s", "name": "CHAOS Combat Copters HD -­ #1 Multiplayer Helicopter Simulator 3D", "name_original": "CHAOS Combat Copters HD -­ #1 Multiplayer Helicopter Simulator 3D", "description": "This is 3D realistic Combat helicopter assault operation simulator - short name C.H.A.O.S.<br/><br/>CHAOS - is a unique opportunity to act online as a pilot of a military helicopter. The game simulator is an unequalled power of a fighting vehicle (like Apache, Chinook, etc.) in your hand. This realistic feeling of flight and the ease of management of a difficult machine are available to an ordinary user.<br/><br/>In comparison with common game-shooters,CHAOS has the advantage of  high-detailed helicopter models, true-to-life maps and battle locations, unique sound and visual effects. War is waged not only in the sky: tanks, self-propelled units, ships, submarines, enemy planes attack and makethe game process and dogfight very intense.<br/>Training missions and online battles, regular tournaments and video-recording of dogfights, detailed statistics of battle achievements, loyal system of awards, prizes and various bonuses – and this is  onlya part of the conquering world of CHAOS multiplayer.<br/><br/><br/>Choose helicopters from different manufacturers from the USA, Russia and Europe such as AH-64 Apache, UH-60 Black Hawk, Hind, Ka-52 Alligator, RAH-66 Comanche and more! Accomplish missions, go through intensive air combats and defeat the enemy!<br/><br/>Achieve new ranks, get money and gain experience, upgrade your helicopter and deter your enemy!<br/><br/>Features:<br/>- Realistic helicopter simulator with action-packed gameplay<br/>- Highly detailed helicopter models from leading manufacturers including the U.S., Russia and Europe (AH-64 \"Apache\", UH-60 \"Black Hawk\", MI-24 \"Hind\", Ka-52 \"Alligator\", RAH-66 \"Comanche\") and other <br/>- Award-winning visual and sound effects<br/>- Real-world battle locations<br/>- Eight training missions to get ready for real air combat frenzy<br/>- Helicopter upgrades<br/>- Exciting multiplayer mode: Death Match<br/>- The integration of games with Game Center and Facebook <br/>- Realistic helicopter simulator and game play, rich with action and events <br/>- Unique visual and sound effects <br/>- Real maps and battle locations <br/>- 8 training missions, you can prepare for the air fight by passing training missions <br/>- Ability to improve performance and upgrade weapons for your helicopter <br/>- Medals and orders for the professionalism displayed in battle <br/>- Detailed statistics combat achievements, which is available both in game and on the website <br/>Add friends, participate in tournaments, improve combat skills in between tournaments in training missions and online battles, and win awards and titles. <br/><br/><br/>Buying an HD version you will get: <br/>- High resolution graphics <br/>- Improved sound effects <br/>- Antialiasing settings <br/>- And also +free bonus <br/><br/>The War never ends.Si vis pacem, para bellum is a Latin adage translated as, \"If you wish for peace, prepare for war\". <br/><br/>If you like dog-fighting in the AIR - that's is it. <br/><br/>The entire world is under attack. And you're here to save it from terror!<br/><br/>PS - If you have a problem we’ll do all we can to help. Please contact us before giving the game a bad review by emailing support@chaos-game.com, we’ll hopefully turn your bad experience into an awesome one!<br/><br/>Connect with us:<br/>Facebook https://www.facebook.com/chaos.game.HD<br/>Forum: http://chaos-game.com/en/forum/<br/>Twitter: https://twitter.com/Chaos_game<br/>Web site: http://chaos-game.com", "metacritic": null, "released": "2011-09-01", "tba": false, "updated": "2019-10-22T14:11:13", "background_image": "https://media.rawg.io/media/screenshots/ffa/ffadfdb6cbfef75ab247786de7b8276c_AJhYAfT.jpg", "website": "http://chaos-game.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 259, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["SKY JET INTERNATIONAL"], "genres": ["Simulation", "Arcade", "Casual"], "publishers": ["Sky Jet International"], "esrb_rating": null}