{"id": 252253, "slug": "modern-sniper-monster-killer", "name": "Modern Sniper Monster Killer", "name_original": "Modern Sniper Monster Killer", "description": "Modern Sniper Monster Killer game is based on shooter 3d monster and the real beast war defense against the monster zombies attack in survival from monster arena. This is a place of dangerous rising dead monster city where you are the alone survivor of dark monster humor rescue killer mission. <br/>Modern Sniper Monster Killer game is designed in a new exciting ultimate monster sniper war and amazing real world combat monster shooting killer mission of dangerous monster 3d world in shooting killer monster battle. There are multiple missions for strike battle out where you have to kill the monsters and collect the keys to proceed to the next level. You can also collect health in this game to survive in the monster hunting city. All the Missions are the most thrilling in which you have to kill all the monster dead squad and shoot all the monsters with the sniper gun in this sniper 3d monster shooting game. You have to complete the ultimate monster war mania missions to get keys and to go to the next level.<br/>You have to survive and save yourself in this blood and borne game from all the hunter Monsters attacks while killing the monsters with your 3d sniper gun in this combat monster survival mission game. If you are monster shooting game lover than this Modern Sniper Monster Killer game is best for you.<br/>In Modern Sniper Monster Killer game your main target is to find monsters in monster battle mania and shoot the monsters with your monster ultimate sniper in this monster hunting legends war game. Kill all Monster devil Squad. It is one of the best shooting dead monsters by the bullet to hunt them and sniper shooting monster game.<br/><br/>Modern Sniper Monster Killer Features:<br/><br/>Multiple monster characters. <br/>Multiple challenging levels with thrilling missions.<br/>Realistic bullet effects. <br/>Challenging ultimate Missions.<br/>Realistic monster environment. <br/>3d dangerous monster.<br/>Thrilling sound effects of real fighting game.<br/>Impressive and easy on screen controls in this defense shooting game.<br/>Adventurous killer Monsters 3d Animations.<br/>It is a free game available on app store.", "metacritic": null, "released": "2018-03-11", "tba": false, "updated": "2019-10-22T14:11:17", "background_image": "https://media.rawg.io/media/screenshots/91c/91c5846bdfff8a39b8ecdd35f0b22aed_I0Iv7na.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 81, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Mubasher Ali"], "genres": ["Action", "Adventure"], "publishers": ["Mubasher Ali"], "esrb_rating": "Mature"}