{"id": 252224, "slug": "smash-block-tower-hexorio", "name": "Smash Block Tower: Hexor.io", "name_original": "Smash Block Tower: Hexor.io", "description": "Crush Blocks! Hexor.io enables you to control a magic hexagon and your goal is to destroy and smash all the blocks so that the Hexagon does not fall out and make it reach the finish line. Besides the engaging gameplay with fun gravity concept, the entire objects and environment have been drawn with pencil and you’ll just love the pencil world and tower designs.<br/><br/>If you are looking for an addictive block tower game, Crush Blocks! Hexor.io is going to become your best companion as it offers everything you should expect from such puzzle games and it even sets the bar to a higher level by offering fun gravity concept, pencil tower designs, toon blocks, easy to learn yet addictive gameplay and a lot more. <br/><br/>So, download this smash hex game for free and enjoy crushing and destroying the toon blocks and finding your way through the end line. <br/><br/>What to expect from the Crush Blocks! Hexor.io?<br/><br/>Crush Block, the free and addictive puzzle game, comes with a clean and neat design and the interface is so user-friendly and the gameplay is so easy to learn that you’ll get the whole idea after using the magic hexagon to smash and pop the blocks for a couple of times and of course avoid hitting obstacles and hurdles.<br/><br/>There are some boosters, power-ups and colorful skins of hex to collect, which enable you to customize your magic hexagon and make it more powerful and reflexive.  The available power-ups can make the hex be very light, very heavy, bouncy, small, or big. So, you need to follow a solid strategy and be fast and precise while collecting power-ups and popping the toon blocks. <br/><br/>Why should I install this free puzzle game?<br/><br/>While there are so many other puzzle games available on Play Store, why should I install this free hex reflex game? Well, this is a fair question to ask and here are just a few reasons to fall in love with this free puzzle game:<br/><br/>One. It comes with pencil design, and the entire world, tower, and magic hexagon have been drawn professionally.<br/><br/>Two. The gameplay is addictive and thanks to different challenges, modes, power-ups, boosters, and skins you won’t feel bored or tired.<br/><br/>Three. It follows physics and gravity rules to make the gameplay even more realistic when it comes to smashing, destroying and crushing.<br/><br/>Four. It comes with more than 100 different levels with different challenges and levels of difficulties to entertain you for hours without noticing the time.", "metacritic": null, "released": "2018-05-12", "tba": false, "updated": "2019-10-22T14:11:15", "background_image": "https://media.rawg.io/media/screenshots/d07/d0709caa9797af7b2560ea018e7b611e_kttjBqu.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 80, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Symstudio Games"], "genres": ["Arcade", "Puzzle"], "publishers": ["Symstudio Games"], "esrb_rating": "Everyone 10+"}