{"id": 252232, "slug": "last-commando-sniper-hero-2018", "name": "Last Commando Sniper Hero 2018", "name_original": "Last Commando Sniper Hero 2018", "description": "Last Commando Sniper Hero 2018 is an blood and the killing borne battle of combat defense against the gangster enemies squad game. Last sniper hero have to survive in this expandable dead survival mission by shooting the assassins with ultimate modern sniper alone by pressing the trigger on the right time and won this battle by strike against the sniper killers out in this sniper 3d clash shooting defense mission game. In this ultimate sniper war the sniper gun commando shooter is the responsible to make the correct kill enemies bullet shots for assassins hunt.<br/>Last Commando Sniper Hero 2018 3D game is the most advance last sniper hero battle field assassin game. Commando is a well-trained army soldier in the battle of surviving by shooting the killer gangsters in the survival combat arena. Modern sniper hitman shooter have to make the right aim on the assassins to survive in the game and complete the mission. This game has multiple levels so you have to make perfect sniper kill gangster shots in this commando survival shooting 3d game. Commando should utilize the real sniper gun man shooting skills to survive in the battle field on the gangster earth and kill the gangsters like a bravo fire shot fighter in kill gangster zone.<br/>Last Commando Sniper Hero 2018 Game is like elite sniper Commando alone shooter and world sniper defense dead shooting mission. Full of Action modern army alone commando game which is according to your need.Elite Army commando bravo Shooter Take the cover behind the hills to avoid of getting hit by terrorist attack in this counter terrorist 3d game. Army Mountain Sniper Fury Start to kill the enemies and boss and the terrorist army base in this sniper assassins shooting game. Kill the terrorists by multi shots and win the shooter defense mission. In Mountain Sniper Army Shooting 3D game the only way to kill your sniper enemies by using modern Elite army sniper in the shooter sniper world. Elite sniper shot killer elite game is thrilling multi shot bravo shooter and ultimate commando adventure shooter world war game.<br/><br/>Last Commando Sniper Hero 2018 game Features:<br/>- Realistic Army Battle and Smooth Controls.<br/>- Advanced Military 3d snipers and Wonderful Game play.<br/>- Excellent Graphics and Stunning Sound Effects.<br/>- Best army person sniper shooting game.<br/>- Realistic Commando Shooting adventure game.<br/>- Easy tap to shoot and kill the enemies in one shot.<br/>- Detailed Map position of the enemies.<br/>- Target the enemy commando shooters with the scope.<br/>- Outclass war environment &amp; wonderful combat campaigns missions.<br/>- Amazing sound effects to help you play the game with more concentration.<br/>- It is a free game available on app store.", "metacritic": null, "released": "2018-03-18", "tba": false, "updated": "2019-10-22T14:11:15", "background_image": "https://media.rawg.io/media/screenshots/b78/b785145217dbfaa5b0f8d73d69623bdf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 171, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Mubasher Ali"], "genres": ["Action", "Adventure"], "publishers": ["Mubasher Ali"], "esrb_rating": "Mature"}