{"id": 252236, "slug": "pool-party-splash-crazy-princess-swimming-vip-girl", "name": "Pool Party Splash - Crazy Princess Swimming - VIP Girls Game", "name_original": "Pool Party Splash - Crazy Princess Swimming - VIP Girls Game", "description": "Hello, do you like parties? Surely you like them and that is why we prepared a very nice kids game. You will love it, you will can play with us through this game for kids. Birthday parties are very nice but if the party is held at the pool is more interesting. Today, through this cleaning game you'll know Victoria. This is the home alone and wants to have fun and thought it would be nice to organize a pool party, she wants to be alone and you will have to be there for her and help her with whatever she needs. You could have fun with us and even you'll make friends. We are happy that you have chosen to help us, you can use your more skills and be able to prove to everyone that you are a responsible child. Our friend is happy becauses she knows that you will go to her. After the party you will have to do cleaning, we're sure the place will look great and you will prove that you're a hard-working kid.<br/>Follow all instructions of this game for girls.<br/>Good luck!<br/>- At the beginning you will know our beautiful girlfriend;<br/>- This is home and wants to help her to have fun;<br/>- Fill the pool with warm water;<br/>- Help her to play in water;<br/>- Now you have to help her to look better;<br/>- Clean the skin with an exfoliating gel;<br/>- Rinse with warm water;<br/>- Apply a honey mask;<br/>- Apply a moisturizer;<br/>- Clip the eyebrows;<br/>- Apply concealer;<br/>- Choose a beautiful dress;<br/>- Young is ready for the party;<br/>- After the party will have to do cleaning;<br/>- Collect garbage;<br/>- Clean the pool;<br/>- Then you have to help Victoria to eat;<br/>- Young is happy, you did a great job;<br/>- You are a wonderful friend.<br/><br/>Thank you for help, please come back every day through this game.<br/><br/>Rate Us / Follow Us :<br/><br/>Web : http://skyblitzstudio.com<br/>Facebook : https://www.facebook.com/SkyblitzStudio", "metacritic": null, "released": "2016-07-04", "tba": false, "updated": "2019-10-22T14:11:16", "background_image": "https://media.rawg.io/media/screenshots/f2c/f2cba8a4b8ead3a4dbe322ad4354e31e_MeWwTsh.jpg", "website": "http://skyblitzstudio.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 142, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["BHUMEET BHATT"], "genres": ["RPG", "Arcade"], "publishers": ["BHUMEET BHATT"], "esrb_rating": null}