{"id": 252264, "slug": "crazy-chained-heavy-bike-stunt", "name": "Crazy Chained Heavy Bike Stunt", "name_original": "Crazy Chained Heavy Bike Stunt", "description": "Crazy chained heavy bike stunt game is quite different from the other Motorcycle heavy Bike rider and real motorcycle stunts games. Be prepared yourself and ready for the extreme challenge with chain quad bike like that driver who enjoys doing dangerous stunts on highway. Sit behind the wheel on quad bike for start dangerous stunt against opponent vehicle which connected with big chain on the highway. For riding and stunts best you can select one of the best heavy drive from the store. Its amazing highway chain quad bike simulator where a lot of hurdles, barriers and speed breakers on the highway lets drive your vehicle and enjoy stunts. It is an amazing motto challenge mission you need to complete it and have to show some extra ordinary skills to reach the finish line. In the 3D stunt bike game, mission is that you have to ride your vehicle parallel to the opponent and keep in mind don’t break the chain, reach the finishing point very carefully and you have to show your best driving skills. Join the extraordinary stunning game made for you and perform realistic stunts on the highway with quad bike stunts. Don't hit any hurdle, barriers and opponent drive during the race. With extreme motor vehicle driving skills perform real stunts. The daredevil aerobatics can be a risk for life so drive safely to become the legend of such kind of challenging race. You need to be a fearless driver to complete all the challenging levels. Play most exciting multiple levels and exciting missions in this chained quad bikes game.<br/>Prepare for ultimate stunt riding as frenzy and crazy moto bike race rider stunts and actions. Overcome the hurdles and obstacles. Cross the ramp and control your chained bikes without breaking the iron chain apart. Sharpen your chained bike racing skills. Practice this amazing daredevil race on grand motorcycles. The highway is packed with hurdles. Your target is to avoid breaking chain with moto racing and perform rider stunts before reaching finish line. Show the audience real motor cross drifting and one wheeling. Move on to racing tracks with efficient speed. Chained bike race rider stunts is the most fascinating chained bike driving experience. Gear up and race against the bikers. Show extreme real acceleration. These roads are full of speed bumps and other tricky obstacles. You have to keep up with rider without breaking chains. Race on busy highway roads packed with heavy traffic. Race against your rival riders. Be a fearless motorcycle rider. Ride your way through epic trails with downhill or off-road highway mountains.<br/>Amazing design animations, immersive gameplay physics, realistic background sound effects and nice control in the part of this amazing simulator game. Amazing and multiple advanced vehicles on store from where you can collect your favorite one. To get another vehicle from store you need to win a race with doing different type of challenges and earn cash to unlock other bikes from store. Crazy moto riders you were once winning races as cycle rider with your crazy bike but now its highway traffic. City rush do not allow you to do hot bike parking as a bicycle rider. Do not kill on road &amp; avoid truck jump in bike racing 3D game. To avoid crashing is bike brakes attainment’s for crazy rivals racing mania. You are the part of group motorcycle riding as a city bike rider. Be the ultimate motorcross rider in this extreme bike race simulator game. This dangerous racing chained cars 3d game is must recommended for legendary racers like you. Don’t lose hope &amp; won the final racing championship.<br/>Crazy Chained Heavy Bike Stunt Features:<br/>• Multiple bikes.<br/>• Realistic background sound effects.<br/>• Multiple exciting missions.<br/>• Nice smooth control.<br/>• Fantastic chain break effect.<br/>• Most realistic trail bike plus heavy bike simulation.<br/>• New biking city adventure.<br/>• It is a free game available on app store.", "metacritic": null, "released": "2018-06-17", "tba": false, "updated": "2019-10-22T14:11:17", "background_image": "https://media.rawg.io/media/screenshots/0e9/0e919f78302fc7f1e67335bcd98e698a_akYwXut.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 126, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Mubasher Ali"], "genres": ["Simulation", "Racing"], "publishers": ["Mubasher Ali"], "esrb_rating": "Teen"}