{"id": 252210, "slug": "domes-of-titan-le", "name": "Domes of Titan LE", "name_original": "Domes of Titan LE", "description": "Play it free!  Uniquely immersive 3d Flight Sim - Assist the overwhelmed police force of Titan's largest domed city to protect the citizenry from waves of merciless invaders.  Retrieve debris from destroyed craft for cash to upgrade your ship and replenish your weapons.  Domes of Titan puts you in the cockpit of an advanced intra-dome fighting craft, pitting you against waves of invading ships in a battle to protect the citizens of Titans largest city, or try multiplayer, with two to four player head to head battles against friends old and new over the internet.<br/><br/>Check out the trailer here:  http://youtu.be/qZzMvt7p5aw<br/><br/>***<br/><br/>Written exclusively for the iPad with a powerful 3D engine providing a dense city environment in which to play, smoke, fog, day/night effects - it's a gas man...<br/><br/>- Runs on all iPads<br/>- Retina support for iPad3<br/>- Three levels of single player difficulty to challenge you<br/>- Upgrade ship systems and weapons<br/>- Play two to four players live over the internet (GameCenter)<br/>- BlueTooth support for two player head to head<br/>- Online leader board for single and multiplayer games<br/>- Voice Chat in game (for GameCenter)<br/>- Hands free Fish Bowl mode, and endless battle over the skies of Titans largest city for your viewing pleasure", "metacritic": null, "released": "2012-10-09", "tba": false, "updated": "2019-10-22T14:11:15", "background_image": "https://media.rawg.io/media/screenshots/68f/68f905e234f9e0403695c879c645cf19.jpg", "website": "http://spicyclam.com/domes/domes.html", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 172, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["TheWay"], "genres": ["Action", "Simulation"], "publishers": ["TheWay"], "esrb_rating": "Everyone 10+"}