{"id": 252369, "slug": "us-army-commando-shoot-attack", "name": "US Army Commando Shoot Attack", "name_original": "US Army Commando Shoot Attack", "description": "Get ready for the mission to eliminate the terrorist in the US Army Commando Shoot Attack game is unique fight with enemies in this sniper game. Show your sniper gun skills in this snipping game. Shoot as prefect shooter in sniper 3d game shooting game. The action game of sniper shooting game is best revenge of strike game. You are a contract Army soldier and it is your duty to kills all criminals with your gun shooting games. In Commando game army military camp under the gangsters. Use powerful sniper shoot rifle with ammunition and sharp bullets to perfect shooting skills.<br/>Be ready to survive army missions of this Shooting FPS mission 3D game. You are well trained US army commander by military army force for this grand mission. Secret agent commando military force alerted the terrorists, gangsters &amp; mafia are hidden in mountain hills. Pick up your gun and start best frontline sniper hero gun strike shooting skills &amp; abilities for ultimate battle to secure frontier army shooter with fury in this critical special rage ops shooting mission. Action packed game Elite Commando Secret Spy Mission your opponent army attack on your border with tank, armor vehicles and helicopters.<br/>Fps sniper games is not easy war show good warrior skills in terrorist game. Extreme real enemy strike and clean battle area zone from the terrorist by doing counters gun strike in defend zone. Before starting army combat strike counter with terrorist, take gun and start gun shooting in the army game 3d of best action game and kill all the terrorist in the shooting game of sniper combat game. Try to focus on target and not missed any chance of the sniper shoot to stay in top shooting game and perform well in the action game as in military combat game. Enjoy gun shooting game.<br/>In this sniper 3d hitman killing games, you have to quick attack to find rivals terrorist and kill them by doing sniper shooting as the fps sniper in the terrorist game. Full aim on the terrorist and shoot as a sniper real assassin in the sniper combat game. This contract assassin killer sniper 3d shooting game is like a sniper game have a feature of gun and become a frontline sniper by doing fps shooting to do strike counter with terrorist and remove them from city and clean your city from terrorist to become a sniper shooter. Do encounter shoot in a proper new action game of sniper mission game. The shooting game will allow you to do sniper commando elite military war strike in the terrorist game and doing real enemy strike in combat game of top shooting game. In gun games 3d, you have to do gun shooting as the counters gun strike in the shooter game. Ready to take experience of gun swat strike of the sniper shoot in the shooting game with gun and become a gun shooter in the best action game 3d in the military sniper game.<br/>This call of sniper 3d killer shooting games will make to do gun swat strike with terrorist and kill the terrorist in the terrorist shooting game. The gun games will made you fps sniper shooting on the terrorist in the new action game. This contract sniper 3d sniper games is a new action game to become sniper shooter in terrorist game by doing counters gun strike in the sniper 3d game. While doing counter shoots, don’t missed target in the gun shooting as the sniper real assassin in sniper combat game. Real enemy strike as the sniper commando strike shooting of the sniper shoot in the action games. The strike counter with terrorist improve your fps shooting as the frontline sniper in the combat game of military sniper game. Make a good impact in the action gun shooter game.<br/>Features:-<br/>- 3d stunning graphics of Mountain.<br/>- Offline game no internet connection required.<br/>- Realistic battlefield environment.<br/>- Paid game on app store.", "metacritic": null, "released": "2018-07-26", "tba": false, "updated": "2019-10-22T14:11:22", "background_image": "https://media.rawg.io/media/screenshots/8be/8bee32bec6ada1a3d2f2283c85285838.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 185, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Mubasher Ali"], "genres": ["Action", "Adventure"], "publishers": ["Mubasher Ali"], "esrb_rating": "Mature"}