{"id": 252347, "slug": "snow-hill-car-fast-racing-2018", "name": "Snow Hill Car Fast Racing 2018", "name_original": "Snow Hill Car Fast Racing 2018", "description": "Play offroad snow hill car fast racing 2018 climbing missions to experience offroad snow car driving on deadly terrains and deep valleys. Show excellent car drifting and car handling skills on bumpy offroad tracks. Follow the navigator map and complete the snow climbing missions to reach the next mission.<br/>Show your crazy driving skills to complete impossible tracks, drive fearlessly in this snow hill extreme driving simulator. Extreme offroad heavy car driving game requires extraordinary handling skills from the car driver to control heavy offroad vehicle and offroad snow cars. Tighten your seat belt and take your raptor car on mountain tracks. Experience challenging road hurdles with the real car driving sensations and endless fun with car mountain racer. Prepare yourself for this new snow hill car fast racing climb adventure game. Change car colors with high quality shining colors. Customize your 4x4 car according to the requirement and enjoy driving in deadly terrains. If you love offroad car driving on mountainous tracks with a supercar than this 4 wheel car simulator game is for you. Drive sports cars in an offroad environment with advanced controls. Test your extreme driving skills with this Hill Adventure Drive in this greatest car driving game.<br/>No rules define for this endless racing game, just gear up your offroad car and dodge your opponent to win the snow car rally in this driving simulator. No traffic signals define for this hill climb race just find your way and win the jeep racing contest in this car simulator 2018.<br/>Lead the snowfield as a champion racer in this pro rally racing with exquisite cars and monster trucks. Shift perfect gear and follow the arrow to beat the gravity to knockout your rivals in dust and win your dream race event in less time. 4x4 Winter Snow Car Rally Racing game requires pure rally racing drift and stunts capability to survive and instincts to win laps. Drive various cars with extreme suspension and Heavy engines for best asphalt grip while you drift on hilly tracks. Unlock the rally racer inside you with this lap racing game. Watch out for deadly turning point over the edge or you can fall from hill climb. Turbo Winter Snow Car Rally Racing presented with 20 challenging missions with 10 4x4 furious racing cars. Build your racing career by completing all the challenging missions before you beat all the speedy racers. Become an ultimate off-road racing driver on different environments like snow and off-road Now you can drive the fastest 4x4 SUV cars and feel a sports rally car driver in this winter car rally driving game with snowy winter games.<br/>Defeat all of your rivals by showing your jeep driving expertise and survive on this desert rally arena in jeep simulator. A smooth snow hill car fast racing 2018 control with realistic impossible tracks environment on Snow Mountain in car driving games. We will give you multi-angle camera view with accelerator button or brake screen touch button for your convenient in car offroad games. Enjoy your hill climb journey on maneuver narrow path or other astonishing impossible tracks on Snow mountain in car impossible games. <br/> Snow Hill Car Fast Racing 2018 Features:<br/>- Realistic offroad Snow Environment.<br/>- Explore hill climbing levels.<br/>- Car parking game hilly tracks and curvy paths.<br/>- Fast sports car.<br/>- Drive quickly without getting crashed.<br/>- It is a paid game available on app store.", "metacritic": null, "released": "2018-06-17", "tba": false, "updated": "2019-10-22T14:11:21", "background_image": "https://media.rawg.io/media/screenshots/806/806cac461a0ea46c0432df7d7fa173e5_LWTBxMt.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 116, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Mubasher Ali"], "genres": ["Simulation", "Racing"], "publishers": ["Mubasher Ali"], "esrb_rating": "Teen"}