{"id": 252309, "slug": "oil-tanker-cargo-transporter", "name": "Oil Tanker Cargo Transporter", "name_original": "Oil Tanker Cargo Transporter", "description": "Oil Tanker Cargo Transporter game is the Extreme oil tanker fuel transport task to transport offload cargo through the the big road which is in the rugged terrains, mountains and hills. Paths are very difficult to drive for oil tanker in this cargo transport carnage game, so tanker transporter of oil truck can handle this job with oil tanker drive in this impossible drilling game. An objective based offroad cargo simulator oil truck 3d shell game in which oil tanker driver has to Keep oil hunt side by side towards oil hunt parking stop.<br/><br/>In Oil Tanker Cargo Transporter game Show your skills as the extreme oil tanker driver to drive parking tanker gasoline log to place the fuel by using oil tanker to its desired place which is mention in each level to complete the level. You can buy new oil tankers by playing multiple levels of this addicting game. Be careful on dangerous twists and turns and deliver oil tycoon safely by driving the offload oil tanker truck. Drive fuel tanker essence oil cargo truck simulator like a skilled transporter oil cargo trailer driver and transport oil tanker to the destination on hill areas. Drive this oil tanker transport cargo simulator truck carrying oil tanker.<br/><br/>Driving Oil Tanker Cargo Transporter offroad tanker simulator 3d transporter has very attractive graphics and nice environment. If you like oil tanker driving games then this game is best for you because it has real time oil tycoon for oil truck. Extreme oil truck simulator truck parking crashing game have very fun to play, become a transporter and make an oil tanker drive and reach the point.<br/>Travel across the hills and sea which is really nice experience at all. Oil cargo truck parking and transporter game is for oil transport . Oil Tanker Cargo Transporter game require some skills. <br/><br/><br/>Oil Tanker Cargo Transporter Features:<br/><br/>- Real Experience of Driving oil tanker on big roads.<br/>- Multiple Exciting Game play Missions .<br/>- Amazing 3D Graphics &amp; Natural Environment.<br/>- Cool graphics and well-crafted animations.<br/>- Transporting oil from one place to another.<br/>- Thrill of Driving on narrow and u turn Paths.<br/>- Excellent sound effects.<br/>- Smooth Steering, Brakes,Roads and Drifting.<br/>- Stunning 3D Graphics and Real oil tanker cargo truck game features.<br/>- It is a paid game available on app store.", "metacritic": null, "released": "2018-03-09", "tba": false, "updated": "2019-10-22T14:11:19", "background_image": "https://media.rawg.io/media/screenshots/662/6625162bf30e4f013dddd932c032d1f9_n5dwk7s.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 137, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Mubasher Ali"], "genres": ["Simulation", "Racing"], "publishers": ["Mubasher Ali"], "esrb_rating": "Teen"}