{"id": 252365, "slug": "real-city-bumper-car-racing-3d", "name": "Real City Bumper Car Racing 3D", "name_original": "Real City Bumper Car Racing 3D", "description": "Real city bumper car racing 3D dodging cars racers is the best game. Knock down every single opponent, crash them with your superhero car powers with full force to become a pro racer. Be ready for the bumper race by selecting bumper cars. The best game came in town to amuse your time in the dodging arena. Play superhero car racing games like a dodging car games. Superhero Driving 3D provide you incredible features for cars crashing in this bumper crash car game. Dodging cars are always been fun among kids now they can drive their favorite bumper cars with superheroes. Play various bumper cars racing and Demolition missions in this realistic dodging arena.<br/>In this modern city, show your furious speed in this riding challenge. This Real City Bumper Car Racing 3D is one of the best among superhero bumper car games as it carries crazy fun adventures and thrilling missions to destroy cars that are ultimate dodging cars. There is not only racing and riding but it has multiple modes to play in this superhero bumper car games, racing users are always fascinated by dodging car games and derby games. First mode is arena mode that will provide superhero car to drive in the city to destroy cars, there would be extreme massively destruction by these superhero cars as bumper cars in this dodging arena. You as a real bumper cars racer will perform amazing bumper race by driving superhero car. Accomplish all the hitting/destroy cars adventure in given minimum time to win the rewards, on that base you can get more efficient bumper cars to drive in this unique Real City Bumper Car Racing 3D game. Enjoy real variety of dodging cars and superhero cars to crash other bumper cars.<br/>In this Real City Bumper Car Racing 3D that can fascinate you and increase your urge to play more. You might have played real car driving and racing games with lot of actions but this pro racer superhero bumper car games is in the best category for fun racing adventure. Win this championship as a real life superhero in this city. Become a jumper racer by driving real furious bumper cars for the destruction of enemy rival cars. With the blend of derby games, superhero bumper car games and dodging cars this Real City Bumper Car Racing 3D is a loveable treat for amazing bumper race lovers. These superhero cars are designed with realistic graphics and responsive controls to drive and crash other bumper cars. You would love to drive your bumper cars to crash in this unique 3D simulator of ultimate race. In this crazy fun mode, you have to prove your car crashing and smashing skills. Go in the city with full action, find your rival bumper cars and crash them with ultimate speed and power. Show your furious attitude so that you can always be called as a superhero car racer in this great modern city. Dodging cars are always fun to drive, the realistic and responsive controls will blow your mind and increase your urge to destroy cars in this bumper crash car game of 2018 with an excellent 3D simulator. Get the championship trophy at the end of each thrilling mission.<br/>Features:- <br/>- Hit all the dodging cars and knock them out.<br/>- Stunning 3D graphics and best audio effects.<br/>- Paid game available on app store.", "metacritic": null, "released": "2018-07-25", "tba": false, "updated": "2019-10-22T14:11:22", "background_image": "https://media.rawg.io/media/screenshots/a86/a86339e093fd5e0430382500ce9e7a7f_1e9j8Au.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 119, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Mubasher Ali"], "genres": ["Simulation", "Racing"], "publishers": ["Mubasher Ali"], "esrb_rating": "Everyone 10+"}