{"id": 252324, "slug": "elite-commando-modern-shooting", "name": "Elite Commando Modern Shooting", "name_original": "Elite Commando Modern Shooting", "description": "Elite Commando Modern Shooting game is the best first person shooting game on mobile. Step on to the combat zone and be the commando in this war against terrorism. Shoot your way through different stages to win the battle. Enjoy the fresh levels to win against your opponents. You have to fight with gun in the levels and you can swap on new weapons like grenade and many more. This game is 3d strike warship shooting battle game in which the last military real Commando have kill all enemies one by one in this legacy warship battle of craft military delta counter army attack strike.<br/>Elite Commando Modern Shooting  is an commando action strike shooting game. Commando experience the most amazing adventure fighting combat mission and shooting against dangerous terrorists in the battle field counter army fierce attack war. Experience extreme of kill the enemies like an American commando delta shooter in the war shooting military mission like an elite army occupation commando in the fields of the warship monster battle strike.<br/>Become a secret agent – not from mafia or government, but getting into business for yourself! Find out all sides of this interesting and dangerous job and have fun playing Elite Commando Modern Shooting.Do you like war games? Complete different war missions and enjoy realistic battle scenery with this game. Fight against enemy’s army as a well-trained soldier and survive in this war! Show your bravery shooting and killing enemies with your gun in this ultimate 3D action game!<br/>Elite Commando Modern Shooting is nothing but combat commando army fight for our military force and you are a real fearless fighter in military battle. It is a challenge for you to complete this adventure operation of commando in this army shooter killing strike game. Amazing and high definition 3D realistic graphics, background sound effects and smooth control are the best part of it that make your interest in the game. <br/>If you are getting bored then this Elite Commando Modern Shooting game is suitable for you to play and enjoy real gun shots and thrilling 3d adventure environment.Don't give your enemies time to make shot on you because if they do so then your life will drop and you will lose the military real gun battle. Shooting more enemies means more chances to survive into this commando in action 3d counter shooter attack game. Advance in game in order to unlock new levels for better ultimate real army counter battles in this shooting elite commando mission game. <br/><br/>Elite Commando Modern Shooting Features:<br/>- Realistic Commando Shooting adventure game.<br/>- Realistic secret agent simulator.<br/>- Experience the thrill of a fighter.<br/>- Realistic Army Battle and Smooth Controls.<br/>- Advanced Military shooting weapons and Wonderful Gameplay.<br/>- Feature levels bring you fun.<br/>- Innovative 3D graphic!<br/>- Number of Powerful Guns.<br/>- Excellent Graphics and Stunning Sound Effects.<br/>- It is a paid game available on app store", "metacritic": null, "released": "2018-04-22", "tba": false, "updated": "2019-10-22T14:11:20", "background_image": "https://media.rawg.io/media/screenshots/e98/e98093f4f926c80d87c7ac9c1805e871_M1V8jz5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 105, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Mubasher Ali"], "genres": ["Action", "Adventure"], "publishers": ["Mubasher Ali"], "esrb_rating": "Mature"}