{"id": 252312, "slug": "zombies-killer-survival-fight", "name": "Zombies Killer Survival Fight", "name_original": "Zombies Killer Survival Fight", "description": "Welcome to the Zombies Killer Survival Fight and war game. Become a zombie shooter hunter by shouting on the killer 3d zombies into this dark survival game which are menace on the hunter of zombies killer. You are lone battle survivor into the fort nite of bad land of zombies hunt. Take your ammo in this apocalypse survival against the zombies and put them back to hell and left no zombie for dead.<br/>Run and Shoot the monster zombies in the battle of Royale to become a real hero by taking care of all the survival rules and thinking that it was the last survival day on this waste of the land. Fight with the brutal zombie men, women and wild dogs in this zombie survival frontier game. Save yourself from zombie apocalypse and kill the walking dead zombies to becomes a killer of zombies hunter. Be careful in to the bad zombies land in to the dim light for the hunting of zombies to survive yourself.<br/>In this game you have a limited health to kill the dead killer man zombies in in this zombies shooting hunt. Being an real hero you need to survive in Zombies Killer Survival Fight and left no zombie for the dead. Make a perfect Aim on the zombies and take head shots to survive in the waste horror land. You as a Royale zombie killer in the battleground of the zombies survival frontier in to the darkness. Now in your hands to kill all the zombies in the dead like a hunter to survive in this zombie hunter game. As a brave hunter you have to survive in the darkness of the dead zombies houses and fight like a hero. <br/>This Zombies Killer Survival Fight game is a real zombie shooting game. The gaming environment is breathtaking with immense and horror zombies. Grab your hunting gun for zombies and start killing in this zombie shooting game.<br/><br/>Zombies Killer Survival Fight Features <br/><br/>• Multiple zombies with many kinds of behaviors like dogs, mens, women and wolves.<br/>• Multiple guns which can bring you real experience.<br/>• Realistic shooting as a zombie killer hunter.<br/>• Intense action and best controls.<br/>• Thrilling challenging missions with zombies shooting.<br/>•  Horrifying 3d visuals and sound.<br/>• Realistic 3D graphics.<br/>• Easy simple controls<br/>• It is a paid game available on app store.", "metacritic": null, "released": "2018-03-11", "tba": false, "updated": "2019-10-22T14:11:20", "background_image": "https://media.rawg.io/media/screenshots/5dc/5dc11eda47973550f0d5888d5ffcdae4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 147, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Mubasher Ali"], "genres": ["Action", "Adventure"], "publishers": ["Mubasher Ali"], "esrb_rating": "Mature"}