{"id": 252306, "slug": "prison-break-survival-lockdown", "name": "Prison Break Survival Lockdown", "name_original": "Prison Break Survival Lockdown", "description": "Prison Break Survival Lockdown is a death game. Prisoner was sentenced 20 years imprisonment in a horrible. In this prison game The officers sent the Murderer to the prison outside the City in big jail which is in the desert for a crime as a prisoner . It’s a high security prison, a jail just like Alcatraz. <br/>Kill the police guards and officer before they shoot fight &amp; kill Gangster &amp; pick up their modern weapons &amp; guns to combat back. The corrupt warden has assigned police sniper shooters, police security guards to keep an eye on  prisoners  to avoid prison break. It’s time for broke the Prison escape prison life to plan &amp; break out of this jail and prove you a prison fighter. Run prisoner Run away from this high security Alcatraz prison because it is kill time.<br/>The Police officer has the maximum security like Alcatraz  and impossible to jail break by the prisiners. <br/><br/>In Prison Break Survival Lockdown game the Escape prisoner have all the skills required to break out of a prison. The police sniper shooters &amp; polices guards are equipped with modern weapons &amp; guns which means they won’t hesitate to shoot prisoners if they Try to escape from prison who are trying to jailbreak. It’s not just a jail break it’s a war for prison survival. Prisoner will have to move stealthy &amp; use your stealth skills throughout this special mission in order to escape from jail. Stealth, fighting &amp; gun shooting is what you’ll need the most to survive &amp; break out jail in Escape prison Death games. You’ll face a lot of shooting during you’re the escape break out mission so be ready to aim &amp; shoot accurately &amp; swiftly. Its Kill time so Get ready to execute your grand prison escapes plan by killing the police guards who are trying to stop you. Police officers are equipped with all sort of modern weapons, snipers, pistols and guns. So run for your life and Survive the Prison. <br/><br/>It’s time to enjoy Prison Break Survival Lockdown death game. Latest escape prison plan 2018 game.<br/><br/>Prison Break Survival Lockdown FEATURES :<br/><br/>• Challenging Levels of Escaping and Fighting<br/>• Eliminate Police Officers trying to stop your Breakout <br/>• Thrill of Taking out Prison Officers <br/>• Modern Sniper guns<br/>• Highly Additive &amp; Immersive Gameplay<br/>• Punch, Kick or Hit them with knief<br/>• Escape the Prison with a Master Breakout Plan<br/>* Its a paid game to available on app store.", "metacritic": null, "released": "2018-02-24", "tba": false, "updated": "2019-10-22T14:11:19", "background_image": "https://media.rawg.io/media/screenshots/332/332608cb1e49d8481d1b03788b358efd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 129, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Mubasher Ali"], "genres": ["Action", "Adventure"], "publishers": ["Mubasher Ali"], "esrb_rating": "Mature"}