{"id": 252328, "slug": "crazy-basket-ball-dunk-hit-2d", "name": "Crazy Basket Ball Dunk Hit 2D", "name_original": "Crazy Basket Ball Dunk Hit 2D", "description": "Crazy Basket Ball Dunk Hit 2D game is the basket ball dunk games on app store. Getting over it Tap and drag or touch on screen to jump a shot floppy hoop bounce falls in the basket rings and dunk within time limits go over challenging hit basketball dunking 2d sports game. Bouncy hoop! Ball game brings lot of fun of dunk flappy games that hoop the thrill of bouncy basketball hit, spin, shots floppy. Jumping shot perfect floppy combination of a sports game with a skill hit dunk game. Flick Flappy Hoop Bounce free Dunk fall. Dunk free shot. Dunk free hit. Flappy basket dunk. Dunk! it hoop best 2d.Fires up flappy ball dunk smash fire flappy pockets ball slides ball droped game. Flappy Hoop Bounce! Best tappy game is addictive and best dunk hint practice game in world basketball. Maximum shoot it floor hoops. Get on floppy fire hit fire basketball game. Make high balling dunk score as you can. Take bonus on every floppy strike. If you love basketball through into goal sports games then download now Ball and basket ultimate fun and addictive duck hit game.<br/>In Crazy Basket Ball Dunk Hit 2D throw the bouncer bounce ball while time countdowns and get extra time after each successful hiting the dunk! it. It’s an addictive sports game with a tappy touch game play. Best ball Game with immersive experience in dunking basketball within time limit. This tappy game is addictive and best dunk hit practice game in world basketball. Basketball game with immersive experience. Maximum shoot hoops maximum score keeps you on top in leader board so shootout as much as you can in this challenging basketball dunking basketball game.<br/>Crazy Basket Ball Dunk Hit 2D is fired ball rushed game gives you best fuse rollout rush game experience. Game designed for basketball fans, which it offers single player options, as well as many fun game modes where you can show off your basketball skills.<br/><br/>Crazy Basket Ball Dunk Hit 2D Features:<br/><br/>- Ideal for children, girls, boys and adults.<br/>- 2D graphics for sports arcade game with colorful arena.<br/>- Smooth, simple &amp; easy touch screen game play controls.<br/>- Attractive visual effects of the game.<br/>- Multiple levels of this adventure 2d game.<br/>- Realistic basketball player flicks &amp; hoops during gameplay.<br/>- Simple and smooth control.<br/>- Realistic graphics and sound effect will enhance the gameplay experience.<br/>- This is offline gamePlay.<br/>- It is a paid game available on app store.", "metacritic": null, "released": "2018-04-30", "tba": false, "updated": "2019-10-22T14:11:20", "background_image": "https://media.rawg.io/media/screenshots/18b/18b0a8998b167004226e66c7c093d24a_hYoOV1G.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 50, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Mubasher Ali"], "genres": ["Arcade", "Puzzle"], "publishers": ["Mubasher Ali"], "esrb_rating": "Everyone 10+"}