{"id": 252398, "slug": "duoi-hinh-bat-chu-the-gioi-duoi-long-dat", "name": "Đuổi hình bắt chữ - Thế giới dưới lòng đất", "name_original": "Đuổi hình bắt chữ - Thế giới dưới lòng đất", "description": "Đuổi hình bắt chữ phiên bản mới nhất của LapKan Corp<br/><br/>Bạn là người Việt Nam, bạn nói tiếng Việt hằng ngày. Tuy nhiên bạn có thể hiểu sâu được bao nhiêu về tiếng Việt của chúng ta.<br/>Việt Nam có câu: \"Phong ba bão táp không bằng ngữ pháp Việt Nam\" đủ để nói về sự phức tạp của Tiếng Việt. <br/><br/>- Đuổi hình bắt chữ: tuy dễ mà khó, từng chữ có nghĩa riêng khi ghép chung lại thành một lại mang ý nghĩa hoàn toàn khác so với hai từ riêng. Đó chính là điểm hấp dẫn của game đối với người chơi. <br/>- Tìm ra chữ là một niềm vui nhỏ nhỏ trong cuộc sống, nó còn giúp bạn có được sự vận động về trí não, tìm về những ngóc ngách trong trí trớ để củng cố hơn nữa vốn từ Tiếng Việt.<br/><br/>Hãy cùng nhau trau dồi tiếng Việt của bạn bằng trò chơi \"Đuổi hình bắt chữ\". Bạn không những có thể hiểu thêm về từ ngữ tiếng Việt mà còn có thể biết được thêm nghĩa những từ ngữ tiếng Việt nữa.<br/>Chia sẽ với mọi người thân của bạn qua Facebook và có những giây phút thật vui vẻ nào.<br/>Hãy bắt đầu game và thưởng thức thôi.", "metacritic": null, "released": "2014-08-27", "tba": false, "updated": "2019-10-22T14:11:23", "background_image": "https://media.rawg.io/media/screenshots/2d9/2d9f8568b9f1c4c26d4075b158e3a1c3.jpg", "website": "http://huygamer.blogspot.com/p/ban-la-nguoi-viet-nam-ban-noi-tieng.html", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 41, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Huy Nguyen"], "genres": ["Family"], "publishers": ["Huy Nguyen"], "esrb_rating": "Everyone 10+"}