{"id": 252318, "slug": "commando-attack-combat-mission", "name": "Commando Attack Combat Mission", "name_original": "Commando Attack Combat Mission", "description": "Commando Attack Combat Mission is an commando action strike shooting game. Commando experience the most amazing adventure fighting combat mission and shooting against dangerous terrorists in the battle field counter army fierce attack war. Experience extreme of kill the enemies like an American commando delta shooter in the war shooting military mission like an elite army occupation commando in the fields of the warship monster battle strike. <br/>In this Commando Attack Combat Mission game you have selected for this mission where you are alone elite real army commando of the military in the fields of the delta battle strike and eliminate all the terrorist. This is multilevel game with 3d graphics of the city environment. There are multiple weapons which you can buy by earning the ,money by clearing the interesting levels of the game. You are bravo commando shooter in this enemy battle attack.<br/>You have to show extra ordinary quickness like a sharp army shooter and make good aim on the terrorists to kill them otherwise they will kill you in this military top strategy action legacy game. There are wild enemies everywhere around you so fight with them with bravely and eliminate all to get rid of them. So get your best advanced shooting guns and make the right city gun shots in this target commando shooting battle game.<br/> It is a challenge for you to complete this adventure operation of commando in this army shooter killing strike game. Amazing and high definition 3D realistic graphics, background sound effects and smooth control are the best part of it that make your interest in the game.<br/><br/>Commando Attack Combat Mission Features:<br/>- Realistic Army Battle and Smooth Controls.<br/>- Advanced Military shooting weapons and Wonderful Gameplay.<br/>- Feature levels bring you fun.<br/>- Innovative 3D graphic!<br/>- Excellent Graphics and Stunning Sound Effects.<br/>- Realistic Commando Shooting adventure game.<br/>- Easy tap to shoot and kill the enemies in one shot.<br/>- Experience the thrill of a fighter.<br/>- Detailed Map position of the enemies.<br/>- It is a paid game available on app store.", "metacritic": null, "released": "2018-03-31", "tba": false, "updated": "2019-10-22T14:11:20", "background_image": "https://media.rawg.io/media/screenshots/99f/99f2c43e055c14df0c855f096c42513d_3KOY0lh.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 143, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Mubasher Ali"], "genres": ["Action", "Adventure"], "publishers": ["Mubasher Ali"], "esrb_rating": "Mature"}