{"id": 252340, "slug": "real-chained-heavy-bike-racing", "name": "Real Chained Heavy Bike Racing", "name_original": "Real Chained Heavy Bike Racing", "description": "Real Chained Heavy Bike Racing is chained Moto bikes real stunts and racing missions. In the bike racing game you have to play the role of a stuntman and perform bike racing stunts. If you love Bike racing games &amp; want to become a real stuntman bike Rider then this chained moto bike stunt racer game is a super new idea of chained bike stuntman race game. Perform extreme stunts with your heavy bike and have fun like a real stuntman bike rider. Drive real sports bike on rough environment on a verity of tracks to do extreme stunts. You might have played different stunt racing games e.g. car racing, impossible race, hill racing, bike stunts, monster truck, bike hill stunts and stunt racing games but this chained crazy moto bike racing game is interesting and addictive that you will never give up.  Impossible tracks in deserts are very dangerous and risky so you have to race your heavy bike carefully on adventurous air tracks with chained moto bikes. Monster hurdles on tracks is a big challenge. Driving cargo truck, bus sim, chained taxi, car simulator in the air on crazy tracks is easy than to drive 2 wheeler bikes chained together on the highway roads.<br/>Let’s play one of the best risky bike racing game you can chose different kinds of real luxury bikes. Real chained heavy bike racing game is really fascinating and satisfying crazy bike chain break driving experience in the world. Download this real chained heavy bike racing. Get ready for chained ramp Bikes adventure in unlimited tracks with the other bike chasing. <br/>Real Chained Heavy Bike Racing game is the tricky motorbike stunt rival racing game. Moto real bike driving simulator game is the best bike rider game. The Most Important features about the Chained Heavy Bike Real Riders Racing game is that you can select different racer bikes and multiple monsters extreme full bike racing vehicles. This impossible crazy bike stunt challenge game is a landmark in the category of the different model of the real highway motorcycle driver.<br/>Features<br/>• Vehicle selection for selecting Amazing stunt heavy bikes.<br/>• Fantastic chain break effect.<br/>• High ramps and incredible hurdles and obstacles.<br/>• Challenging Bike riding.<br/>• It is paid game.", "metacritic": null, "released": "2018-06-07", "tba": false, "updated": "2019-10-22T14:11:21", "background_image": "https://media.rawg.io/media/screenshots/6fd/6fddb8c33f41b67c70e2718ba92fe4ab_38kn8j0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 122, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Mubasher Ali"], "genres": ["Simulation", "Racing"], "publishers": ["Mubasher Ali"], "esrb_rating": "Teen"}