{"id": 252395, "slug": "sudoku-16-monster", "name": "Sudoku 16 Monster", "name_original": "Sudoku 16 Monster", "description": "16x16 Sudoku! 60,000 puzzles; 6 levels; 7 color skins; Notes; AutoFill mode; Smart Notes; Smart shortcuts; Sudoku 16x16 Manual and much more! <br/>Designed for iPad.<br/><br/>FEATURES AND OPTIONS:<br/>• 60,000 puzzles<br/>• 6 difficulty levels<br/>• 7 color skins<br/>• Sudoku 16x16 manual &amp; game help<br/>• 3 smart double-tap shortcuts<br/>• AutoFill mode<br/>• Manual mode<br/>• Manual mode with Smart Notes<br/>• Conflict alert (With hidden conflicts warning)<br/>• Wrong Number Alert<br/>• Number-Finder feature<br/>• Mark-Completed feature<br/>• Notes-Size feature<br/>• Hide/Show Notes feature<br/>• Show all notes in manual mode feature<br/>• Hint feature<br/>• Clear notes and reset features<br/>• Game statistics<br/>• Right-handed / Left-handed feature<br/>• Timer<br/><br/>APPROXIMATE SOLVING TIMES:<br/>Level 6 - AutoFill:45 min; Manual: ... well it depends<br/>Level 5 - AutoFill:30 min; Manual: 2 hours<br/>Level 4 - AutoFill:20 min; Manual: 1.5 hours<br/>Level 3 - AutoFill:12 min; Manual: 1 hour<br/>Level 2 - AutoFill: 5 min; Manual: 40 min<br/>Level 1 - AutoFill: 2 min; Manual: 20 min<br/>NOTE: Solving times of advanced Sudoku players.<br/>As in all Sudoku games with AutoFill notes mode enabled - it is just too easy to play level 1, so use it for higher levels.<br/>You can solve it 20% faster using the iPad version.<br/><br/>FEATURES DETAILS:<br/>• AutoFill Mode - all notes will be automatically populated and then kept in sync with the numbers you enter. You can remove notes. You can add notes only if you previously removed them. In this mode the game does everything for you and lets you do the thinking. You can switch back to manual mode - the auto-populated notes will remain.<br/>• Manual Mode - you are responsible for adding/removing notes. No restrictions.<br/>• Manual Mode with \"smart notes\" - you are responsible for adding/removing notes, but the game will auto cleanup the corresponding notes when you enter a new number. If you change your mind and remove the number the game will put them back. In manual mode you can use the \"Clear Notes\" button to clear all notes.<br/>• Clear notes - in manual mode delete/clear all user notes<br/>• Hide/Show notes - temporary hide/show notes in all modes<br/>• Hint - press the \"Hint\" button and one unknown number will be revealed<br/>• Mark-Completed feature - mark completed numbers with a star on the Notes Pad<br/>• Sudoku 16x16 MANUAL - you think it is too hard for you - no such thing - read the manual and you will be ready. <br/><br/>ALERT LEVELS:<br/>• OFF - No alerts<br/>• Conflicts Alert - When the entered number conflicts with another number on the same row, column or box it will be colored in red and you will hear an alert sound. Hidden conflicts warning.<br/>• Wrong Number alert - When the entered number doesn't match the real number it will be colored in red and you will hear an alert sound.<br/><br/>DOUBLE-TAP SHORTCUTS - very convenient for this type of big puzzle:<br/>1. If you want to quickly remove a number you entered - just double-tap it<br/>2. When there is only one note in a certain square - double tap it and the note will become the number<br/>3. If a row, column or sub-square is populated with unique numbers and there is only one number left - double-tap the square - the remaining number will appear<br/>Double-tap shortcuts reduce the solving time by 10 - 20%.<br/><br/>NUMBER-FINDER FEATURE:<br/>When nothing is selected tap a number in the notes pad or in the number pad. All squares containing this note or this number will be highlighted;<br/>This feature will allow you to solve the puzzle much faster: 40% in AutoFill mode and 10% in Manual mode.<br/>For some players it is half of the fun to find the correct notes by themselves and solve it without any extra help. Don't use the feature if you are one of those players.<br/><br/><br/>**** NOTE ****<br/>If it looks like you have solved the puzzle, but nothing happens or the numbers don't make sense - please don't write a bad review, but set the alert level to \"Wrong Number\" to see what is wrong.<br/><br/>CONTACT US<br/>Tap the email address on the Help or About screen - we will give you hints and directions of how to resolve any problem.<br/><br/>Enjoy :-)", "metacritic": null, "released": "2010-05-13", "tba": false, "updated": "2019-10-22T14:11:23", "background_image": "https://media.rawg.io/media/screenshots/552/552e1694b91f730620feaa385fce186c.jpg", "website": "http://ipad.sudoku16monster.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 100, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Vladimir Kussakov"], "genres": ["Puzzle"], "publishers": ["Vladimir Kussakov"], "esrb_rating": "Everyone 10+"}