{"id": 252651, "slug": "sunken-treasures", "name": "Sunken Treasures", "name_original": "Sunken Treasures", "description": "Dive into the dangerous deep blue sea, with the most comprehensive treasure hunt on the App Store – SUNKEN TREASURES.<br/><br/>This incredible underwater game will give you the extreme thrill of a complete under water expedition as you deep dive into the sea to find the top 20 sunken treasures from across the world.<br/> <br/>The search for the treasures is not easy. You have to be careful of the dangerous marine creatures they are waiting to attack you as you make your descend to the bottom of the sea. Fight your enemies with high-tech gadgets and reach the bottom safely.<br/><br/>Get yourself into a chilling combat with the “BIG BOSS” who protects the final treasure. Win him and become the sole owner of all the precious sea jewels.<br/><br/>CONTROLS<br/>The controls are very simple.<br/>You can use the touch / tap feature to fire bullets at the enemy. You can use the accelerometer to move the character to the left or right. <br/><br/>Ensure that the Oxygen and Health meters are always filled up, or you’ll end up losing your life.<br/><br/>Game Features:<br/><br/>• Excellent game-play with complete underwater mission experience<br/>• A proper blend of gravitational force and drowning effect to give an actual diving effect<br/>• 20 thrilling missions and progressive game difficulty<br/>• 360 degree rotational firing adjustments with hi-tech weapons, with full screen touch firing<br/>• Smooth game play, thrilling sounds and attractive graphics<br/>• Optimum use of touch and accelerometer tilt feature on the iPhone", "metacritic": null, "released": "2009-12-16", "tba": false, "updated": "2019-10-22T14:11:32", "background_image": "https://media.rawg.io/media/screenshots/85a/85ac29224259eeb3f3a450427ddba4f8.jpg", "website": "http://www.octanetech.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 172, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Octane Technologies"], "genres": ["Action", "Adventure"], "publishers": ["Octane Technologies"], "esrb_rating": null}