{"id": 252643, "slug": "ipingpong-3d", "name": "iPingpong 3D", "name_original": "iPingpong 3D", "description": "The definitive Table Tennis experience is finally here! Millions of players have enjoyed this game online and finally iOS devices has the ultimate finger flicking game in Octane Technologies’ iPingpong 3D. Featuring smashes, cuts and snicks, this game will have your fingers dancing all over the screen versus some of the funniest named opponents on the App Store!<br/><br/>Slide your finger anywhere on screen to control the paddle and remember, timing is everything! Featuring a comprehensive visual Help section and 5 addictive game modes for endless fun.<br/><br/>The most realistic Table tennis experience is here! Buy now and get your fingers flicking in the definitive Table Tennis experience for the iPhone.<br/><br/>Features:<br/><br/>•  Four game modes: Practice, Quick Match, Tournament, Multiplayer and Head To Head<br/>• Three match types: Single Game, Best of Three, and Best of Five<br/>• 15 challenging Ping Pong masters to compete against<br/>• Wi-Fi and Bluetooth multiplayer<br/>• Slice shots can spin the ball<br/>• Immersive 3D visuals<br/>• Realistic physics<br/>• Smooth touch screen controls<br/><br/>Watch the multiplayer video: https://youtu.be/0Saze5_4Wx0<br/><br/>Here are some great reviews:<br/><br/>“I’ve played a few of the Ping Pong games in the store and have to say that this is so far my favor-ite.” -- www.appversity.com <br/><br/>“Slick and a lot of fun! - iPingpong delivers a solid Ping Pong experience that’s easy to play, and challenging at later levels. The addition of multiplayer is a great feature - it’s the best Ping Pong game out there!” -- www.iphonegamenetwork.com", "metacritic": null, "released": "2008-12-12", "tba": false, "updated": "2019-10-22T14:11:32", "background_image": "https://media.rawg.io/media/screenshots/d13/d13b36715bf94fd203b7e130f6b562b8_iOTtgqd.jpg", "website": "http://www.octanetech.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 108, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Octane Technologies"], "genres": ["Simulation", "Sports"], "publishers": ["Octane Technologies"], "esrb_rating": null}