{"id": 252649, "slug": "shopping-mogul", "name": "Shopping Mogul", "name_original": "Shopping Mogul", "description": "Put your management skills into practice with our latest game ‘Shopping Mogul’ – a game which is all about building a shopping paradise in the small and dynamic city of Kensonville and watch it reach the heights of fame. <br/><br/>Yes, you heard it right! You flex your mind, strategize and build a shopper’s haven, where money spent by your customers leads to money earned by you, paving a path for wealth and fame!<br/><br/>As a beginning entrepreneur, you will start as an apprentice land builder. If you strategize and plan your shopping city well, you will land larger land deals with the city mayor to build new shopping options in Kensonville.<br/><br/> You have a choice to build shopping malls, salons, coffee shops, shoe shops, supermarkets and more for your buyers. You can also sell and upgrade your shops when money starts rolling in! Remember upgraded shops attract more customers!!<br/><br/>The game has a flow of customers coming into your shopping arena on every game day, and you have to ensure that they leave happy and contended with their money spent. The happier your customers are, the more you will earn.<br/>Like every city, you have to ensure that your shopping paradise is free of clutter, theft and other unforeseen events such as fire. These can drain your resources leaving you to keep investing in rebuilding the land.<br/><br/>Now you know the game, so start playing and see yourself grow into a Shopping Mogul!<br/><br/>Game Features<br/>• 8 different levels to win the final title of the Shopping Mogul!<br/>• 103 days of interesting game play<br/>• 7 shops to build and 3 utilities to provide to customers<br/>• 14 shop upgrades available<br/>• Interactive in-game tutorial<br/>• In-game iPod accessibility to listen to favorite tracks while playing.<br/>• In-game Facebook connectivity to challenge and post in-game pictures.<br/>• Strategy helps build personal management skills.<br/>• Colorful graphics and animations add to the game-play<br/>• Interesting background sounds and special effects", "metacritic": null, "released": "2010-11-25", "tba": false, "updated": "2019-10-22T14:11:32", "background_image": "https://media.rawg.io/media/screenshots/ad6/ad6415e7c048eb8d7efa49da3410f212.jpg", "website": "http://www.octanetech.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 246, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Octane Technologies"], "genres": ["RPG", "Strategy"], "publishers": ["Octane Technologies"], "esrb_rating": null}