{"id": 252637, "slug": "donkey-dash-derby-pro", "name": "Donkey Dash Derby Pro", "name_original": "Donkey Dash Derby Pro", "description": "Donkey Dash Derby Pro. No ads.<br/><br/>We're off to the horse races with this fairground favourite. <br/><br/>Easy to play, just throw your ping pong balls into the holes to race your horse towards the finish line. <br/><br/>If your little pony is the first across the finish line then you'll win a hand full of tickets. Compete with your friends online to see who can collect the most tickets and also unlock new cute donkeys.<br/><br/>The more you play, the more you win, the more tickets you collect!<br/><br/>There are 5 horses in each race, each controlled by one of the 5 boards. The 2 outside boards are already taken, but the 3 middle ones are available so up to 3 people can play at the same time.<br/><br/>This is a quick game with stacks of balls and frenzy horse racing action. You'll need to be quick and accurate to get your little pony trotting along.<br/><br/>Click on your lane number to change your donkey, initially there are 5 to choose from but there are more available as you collect winning tokens.<br/><br/>Collect  tokens to unlock other horses, including hula  horse, Steam punk pony and  disco donkey.<br/><br/>Another of our fabulous retro carnival games, Donkey Dash Derby<br/><br/>Download Donkey Dash Derby now, pull up a seat and roll the balls into the holes to be first across the line.", "metacritic": null, "released": "2016-09-24", "tba": false, "updated": "2019-10-22T14:11:31", "background_image": "https://media.rawg.io/media/screenshots/1f3/1f3792cfc4d2fd4311b48f9335b98869_WxXolPQ.jpg", "website": "http://galaticdroids.com/donkeydash.html", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 114, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Galatic Droids"], "genres": ["Sports", "Family"], "publishers": ["Gold 5"], "esrb_rating": "Everyone 10+"}