{"id": 252892, "slug": "subway-rush-running", "name": "Subway Rush Running", "name_original": "Subway Rush Running", "description": "<p>Experience Running, jumping, turning, sliding and much more in this Subway Rush Running android game. Subway runner is here with thrilling and exciting features that you’ll enjoy. Come for this adventurous boy run to have an exciting simulation game experience. There are different subway train games that you’ve been playing for years. Now, try this subway running simulator to enjoy royal kingdom run. </p>\n<p>Subway Rush Running is an endless run game with challenging game play. Run as fast as you can and avoid the obstacles comes in your way in this subway run. Control your character with efficient controls and not smash with oncoming hurdles like any endless run games. Subway run are very popular simulation games and have huge fan following. . You will enjoy this boy run like a real entertainment game. </p>\n<p>Features of Subway Rush Running Game:<br/>* Multiple 3D characters and skis for subway run<br/>* Endless running track with obstacles like run dash<br/>* Stunning 3d graphics of this subway free game <br/>* Smooth and effective flawless controls and easy game play </p>\n<p>Choose your favorite character for this Subway Run and feel the thrills of adventurous Subway Run. Subway train simulators are playing widely around the world. There are different obstacles oncoming, avoid all hurdles by moving, jumping and sliding with its effective controls. Collect the gold coins in this subway boy run games. </p>\n<p>Download this Subway Rush Running game and enjoy the adventure of running with this new simulation game.</p>", "metacritic": null, "released": "2018-10-10", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/a0b/a0b1b4e0996fabf12acfdcc4ec576d48.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 131, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Apex Logics"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}