{"id": 25284, "slug": "hooked-real-motion-fishing", "name": "Hooked: Real Motion Fishing", "name_original": "Hooked: Real Motion Fishing", "description": "<p>\n      Cast your line and set your hook for fishing fun with the Core Gamer Wii \n      Fishing Rod Controller. Packed with Aksys Wii tiel Hooked! Real Motion \n      fishing. Universally created for your Nintendo Wii and compatible \n      fishing game software. Enjoy great fishing action without ever leaving \n      the comfort of your couch. The fully functional rod and rotating reel \n      simulates a natural fishing experience. Don't let the big one get away.\n    </p><p>\n      You'll be working up a sweat as you lean your Wii Remote in every \n      direction, all the while reeling on the Nunchuk to catch the big one \n      with the included Fishing Rod. It's as if you have a rod and reel right \n      in your hands! A wide range of fishing environments: Explore six \n      photorealistic lakes, from a meteorite crater turned lake to a man-made \n      recreational reservoir. Three exciting single-player gameplay modes: \n      Hone your skills in Practice or Time Attack mode. Then take on \n      Tournament mode to see if you can become the next world champion!\n    </p><p>\n      As of May 20, 2014, the Nintendo Wi-Fi Connection service for Nintendo \n      DSi and Wii systems has been retired. Online features of this game are \n      no longer available after this date but this game still provides an \n      entertaining experience in offline mode.\n    </p><p>\n      To learn more about this service change, please visit To learn more \n      about this service change, please visit support.nintendo.com/servicesupdate.\n    </p>", "metacritic": null, "released": "2007-10-30", "tba": false, "updated": "2019-09-12T06:38:17", "background_image": "https://media.rawg.io/media/screenshots/0db/0db1f1dfc19fefaef0c1d8c435365e1f.jpg", "website": "http://www.aksysgames.com/hooked", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 326, "game_series_count": 0, "reviews_count": 0, "platforms": ["Wii"], "developers": [], "genres": [], "publishers": ["Aksys Games"], "esrb_rating": null}