{"id": 253102, "slug": "auto-rhythm", "name": "Auto Rhythm", "name_original": "Auto Rhythm", "description": "<p><strong>Controls: You play using Z, X, , and . in the field. Song Selection can also be navigated with the arrow keys.  Songs can be selected with Enter. Escape will bring you back out of a song.</strong></p>\n<p><strong>If there is no audio, reload the page :)))</strong><br/></p>\n<p>An open source rhythm game, where the goal is to hit the notes at the correct time.</p>\n<p>Every song is parsed and mapped automatically by the AI, based on the frequencies in the audio-file. Each song is unique, but the generation process yields the same result for the same song each time.<br/><br/>As notemaps are generated by the AI (and it was written in a couple of days) the difficulty curve can be a bit... difficult at time. Keep that in mind as you play the game. <br/><br/>Scoring per note is calculated based on your current combo, and how accurately you hit the note. (There's a distance away from center based function for this). </p>\n<p>Future ideas include: Rate modifiers, noteskins, general visual and algorithmic improvements, youtube integration or some other form of user provided audio, applying an ANN or some other machine learning algorithm to this, key configuration, lots of community features like export to other rhythm game formats, online leaderboards, local scores, grading of scores, pass fail, more effects etc.<br/><br/>The hardest challenge for this was/is to balance the very quiet songs (or parts of songs) with the loudest parts, without one or the other ending up empty or insanely dense. We got some of the way there, but there's much more work to be done on the algorithms to call this a complete product.</p>\n<p>See https://github.com/Garlov/OpenJam.SpamToWin for more info.</p>", "metacritic": null, "released": "2018-10-08", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/449/4497413adcc2fc57bf5fc72b20cc6771.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 2, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Garlov", "Sidaroth"], "genres": [], "publishers": [], "esrb_rating": null}