{"id": 253246, "slug": "war-dust", "name": "WAR DUST", "name_original": "WAR DUST", "description": "JOIN THE ALPHA TEST ON OUR DISCORD!<br/><br/>Large-scale tactical warfare in Virtual RealityWith War Dust, we want to push the boundaries of Virtual Reality and create epic battles on a scale that has never been reached before.<br/>A total immersion experience that throws you into a breathtaking action film, full of explosions and dynamic tactics. The opportunity to live an incredible situation where armies clash.<br/>Our goal is to create a feeling of being a part of a real epic war, not just a small combat.  <br/><br/>64 PLAYERSWe have always wanted to create large-scale battles rather than small skirmishes which is why War Dust gives you the opportunity to join a company of 32 soldiers. With 64 fighters on the battlefield, War Dust will take you into the largest online battles that have ever been made in VR. <br/>Everyone has a role to play on the battlefield: one single man, at the right place at the right time, can make a decisive difference. Get ready to be this difference, to dare, to fight, and defeat your enemies.<br/>Solidarity, rivalry, cooperation, confrontation: enjoy virtual reality from a new perspective. We look forward to share that experience with our players!<br/><br/>VEHICLES<br/>We wanted to create a game that makes your heart pound faster and gives you the opportunity to use everything you can for your team to win: aircrafts, rocket launchers, grenades: the possibilities are endless and no two battles are alike. Each vehicle available brings a new gameplay and has a major impact on the battle. <br/><br/>In War Dust you can experience the conflict from various points of views. The game is not restricted to ground combat but also it includes aerial fighting; as a plane or helicopter pilot, you will be responsible for supporting your allies on the ground. We are particularly proud of the aerial combats that give incredible sensations when you fly across the battlefield. <br/><br/>Enjoy the thrill of a tense dogfight or help your teammates from far above. Get ready to storm the enemy lines, to cut through their defenses under the cover of a tank, to cross the battlefield at full speed on a quad to join your allies, to push the offensive with a helicopter or show dexterity dodge a missile in a plane...<br/><br/>Surgical strike or massive attack, you will have to choose your strategy and organize quickly.Huge battlefields<br/>Our goal at Raptor Lab is add a new dimension to virtual reality. We wanted to bring combat to a scale that has never been seen before.<br/>To do this we had to create large and rich battlegrounds to give 64 players access to a multitude of different gameplays and possible strategies.Cooperation &amp; synergy<br/>There are four classes, each with their own features and a specific role to play on the battlefield. The battle can only be won as a team.<br/><br/>You will have to strategically communicate and interact with your teammates in order to crush your opponents.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-23T12:11:27", "background_image": "https://media.rawg.io/media/screenshots/3b9/3b925f0e5264ea80bc159495b90d4d35.jpg", "website": "http://www.raptor-lab.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 20, "beaten": 1}, "playtime": 2, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 518, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["raptor lab"], "genres": ["Action", "Simulation", "Massively Multiplayer"], "publishers": ["raptor lab"], "esrb_rating": null}