{"id": 253289, "slug": "car-eats-car-2-racing-game", "name": "Car Eats Car 2 - Racing Game", "name_original": "Car Eats Car 2 - Racing Game", "description": "Car Eats Car finally returns, this time with a vengeance! Just when you thought you had the coolest remote control car ever, along come the neighborhood menaces, taunting you with their mean machines. You fall asleep that night wishing, you could crush and plow through their cars somehow. And just like that, you’re behind the wheel of your RC car, driving and crushing through levels of pure madness!<br/><br/>SCREECHING FEATURES<br/>• 35+ crazy new levels and 4 worlds to conquer! <br/>• Outrun enemy cars trying to devour you!<br/>• Perform flips, tricks and stunts and rule the streets!<br/>• Collect super cool upgrades to enhance your vehicle!<br/>• Insane cartoon style graphics!<br/>• Burn rubber and watch enemies eat your dust!<br/><br/>DRIVING MADNESS<br/>This rocket-fast game requires some serious driving skills. Jump over obstacles, avoid oncoming cars, swerve left and right of objects and collect super boosters to go even faster! Before you know it, you’ll be on the tracks slamming into cars and fighting your way to first place!<br/><br/>STEER CLEAR OF THE BITERS<br/>Beware of biting enemy cars that try to devour you as you drive through troublesome levels. They are nimble and always like to nibble at your vehicle, so stay alert! Gather super guns and boosters to help you destroy these evil mechanical creatures before they destroy you! Do you have what it takes to not get eaten in this crazy, uphill driving game?", "metacritic": null, "released": "2018-07-30", "tba": false, "updated": "2019-10-22T13:53:01", "background_image": "https://media.rawg.io/media/screenshots/223/22378ef1bf3cf011b49e9ca369707552_4xxo2cN.jpg", "website": "http://smokoko.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 173, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["SMOKOKO"], "genres": ["Action", "Racing"], "publishers": ["SMOKOKO"], "esrb_rating": "Everyone 10+"}