{"id": 253294, "slug": "kpop-piano-magic-tiles", "name": "KPOP Piano Magic Tiles", "name_original": "KPOP Piano Magic Tiles", "description": "KPOP Piano Magic Tiles<br/><br/>Tap the music tiles fast, enjoy the music game, and challenge your tapping speed!<br/>KPOP Piano Magic Tiles is the best piano music game awaiting to be played!<br/>It’s a music game for FREE.<br/>BTS, EXO, GOT7, Red Velvet, SNSD, Seventeen, Wanna One, TWICE, BlackPink, T-ara, Stray Kids ... You can find more idols here.<br/>Let's catch up the music game trend! Just enjoy the rhythm belongs to you.<br/><br/>Game’s rules:<br/><br/>It’s similar to other piano games, you just have to tap the music tiles then enjoy the wonderful music and rhythm in game.<br/><br/>Game feature: <br/><br/>● Simple graphics, music tiles different from other music games. Easy to play and everybody gets playing the piano!<br/>● Breath-taking rhythm music tiles will challenge your handspeed limit! <br/>Top challenge mode with faster music tiles gives you thrill and risk!<br/>● Update of numerous songs, original, classic, anime, pop and all the style to satisfy different taste.<br/>● Sound of high quality makes you feel like in a concert, more than a music game.<br/>● More challenge, more bonus and a better music game, a better self. <br/><br/>So, get ready and try out this music game for free! The attractive piano online which is more challenging than you could imagine. <br/><br/>Become a real pianist now! Tap the music tiles and catch up the trend with this new music game right now!<br/><br/>Free music game and music game lovers are waiting for you!<br/><br/>If you have any problems about our piano music game, <br/>send the email to help.bonbonmobile@gmail.com", "metacritic": null, "released": "2018-10-11", "tba": false, "updated": "2019-07-29T09:16:27", "background_image": "https://media.rawg.io/media/screenshots/a12/a128046096c5fd3d84fda4d225d25e4f_1hZF0pd.jpg", "website": "http://bonbonmobile.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 52, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Yen Le"], "genres": ["Puzzle"], "publishers": ["Yen Le"], "esrb_rating": null}