{"id": 253369, "slug": "battle-royale-ultimate-show-2", "name": "Battle Royale Ultimate Show", "name_original": "Battle Royale Ultimate Show", "description": "Enjoy the best PvP combat action with Battle Royale: Ultimate Show!<br/><br/>Play online with your friends in the most intense multiplayer PvP Battle Royale game! <br/>Fight in the arena with your favorite hero and become the best player of the Ultimate Show!<br/><br/>Battle Royale: Ultimate Show is the definitive mobile device multiplayer action game! Choose one of the mighty heroes and fight against other players online, be it solo or in a team, it’s up to you! There are many ways to become a legend of the PvP arena.<br/><br/>Discover unique weapons, handguns, and shotguns. Equip your hero with the best items at your disposal… to win in the PvP arena, you will need the strongest armor, devastating weapons, and outstanding combat tactics.<br/><br/>AN AMAZING BATTLE ROYALE EXPERIENCE<br/>5v5 matches? 3v3 fights? No, this is the Ultimate Show, where only the strong survive. Enter the Ultimate Show, defeat all your enemies, and become master of the multiplayer arena. <br/><br/>Enjoy the action of online PvP combat against other players from around the world. Climb the global leaderboards to become the Ultimate Warrior.<br/><br/>COURAGEOUS HEROES<br/>Different battles require different strategies. You can choose to play as a tank, healer, or DPS. Do you prefer a hero that attacks from a distance, or do you prefer a close combat specialist?<br/><br/>Select your hero before each combat, equip him (or her) with the most powerful items available to you, and choose whether to enter the battle alone, or with a team.<br/><br/>FUTURISTIC WEAPONS AND ITEMS<br/>Handguns, shields, grenades, shotguns and rifles, every item has its advantages. Discover new ways to combine each hero’s skills to achieve glory in a no holds barred PvP arena.<br/><br/>TEAM UP FOR GLORY<br/>Play with your friends and fight in the battleground as a team in 5v5 or 3v3 matches. Only one team wins!<br/><br/>Whether you choose a balanced team with healers, DPS, and tanks, or an assault team with only DPS and tanks, your strategy could determine the outcome well before the battle begins!<br/><br/>AWESOME 3D GRAPHICS<br/>Stunning graphics, incredible special effects, and great animations. Battle Royale: Ultimate Show is the most amazing third person experience for mobile devices. Discover new highly detailed battlegrounds and colorful futuristic scenarios.<br/><br/>INTUITIVE GAMEPLAY<br/>Control your heroes on the arena with the on-screen gamepad. Defeat your enemies using the easy-to-learn controls, unique to each hero type: tank, healer, DPS, carry, or support. <br/><br/>If you like MMO action games, you’ll master the simple controls in no time.<br/><br/>AWESOME FEATURES:<br/>- Courageous heroes with unique skills<br/>- A combination of Battle Royale games with 5v5 and 3v3 gameplay<br/>- Online multiplayer arena<br/>- Customize your hero with futuristic guns, shotguns, grenades, and rifles<br/>- Upgrade your deadly weapons to make them more powerful<br/>- Amazing third-person 3D graphics<br/>- Easy-to-learn controls<br/><br/>Battle Royale: Ultimate Show is the best multiplayer action game for mobile devices. It combines classic 5v5 gameplay with the action and strategy of an online Battle Royale game.<br/>If you’ve been fighting for glory in 3v3 or online action games, and love action 3D games, Battle Royale: Ultimate Show will quickly become your favorite online PvP game.<br/><br/>This game will make you forget about any other action, 5v5, 3v3, or multiplayer game you played. Wanna be a sniper, or a tank? Maybe a healer? Equip your hero with the best guns, grenades, shotguns, or rifles. Prepare your strategy before battle, defeat your enemies in the arena, and fight for glory!<br/><br/>Please note:<br/>- This epic online action game is free to play, but in-app items can be purchased with real money. To restrict in-app purchases, adjust the settings on your device.<br/>- Battle Royale: Ultimate Show is an online action PvP game, and requires an Internet connection to play.", "metacritic": null, "released": "2018-06-21", "tba": false, "updated": "2019-10-22T14:00:33", "background_image": "https://media.rawg.io/media/screenshots/230/23002e8326dd1deb2ce23e6350190c85_LCvckd7.jpg", "website": "http://codigames.com/portfolio/battle-royale-ultimate-show/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 207, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Digital Things"], "genres": ["Action", "Strategy"], "publishers": ["Digital Things Sociedad Limitada"], "esrb_rating": "Teen"}