{"id": 253367, "slug": "zombie-faction-apocalypse", "name": "Zombie Faction - Apocalypse", "name_original": "Zombie Faction - Apocalypse", "description": "Are you ready to survive the zombie apocalypse?<br/><br/>You knew the day would come, and you have been getting ready for this moment. Remember what you have learnt about surviving a zombie disaster and guide your people in this post-apocalyptic adventure.<br/><br/>The world as we know it no longer exists; now it is time to create a new one. It won’t be easy! The zombies are a true plague. They’re not very smart, but they’re everywhere, and they are legion.<br/><br/>Build your own shelter and make it safe. Find survivors and convince them to join you. Together you will be able to improve the shelter and create a new home. Those will be the first steps towards building a new civilization, a new zombie-free world for humans.<br/><br/>But the road to survival is filled with danger. There are no governments, no authorities: anarchy reigns over the world. Survival not only depends on staying away from the zombies, you must also defend your shelter from bandits and thieves. Other survivors have built shelters too, and they see you as a threat. In this post-apocalyptic world, every new settlement that is discovered is considered a threat and treated like a dangerous enemy. Trust is no longer the order of the day – it is an exception.<br/><br/>DEFEAT THE PLAGUE<br/>Lead your squad against the zombie hordes and defeat the undead. Attack their gathering points and collect resources to help your people. Victory in the war against the undead lies in your hands.<br/><br/><br/>FIGHT FOR SURVIVAL<br/>Attack other settlements to survive. Study their defenses, prepare your team, and develop the right strategy to get inside other shelters to steal their resources.<br/><br/>DEFEND WHAT IS YOURS<br/>Train your team to defend your base and configure a defensive system to protect it from the zombies. But do not underestimate survivors! Humans from other settlements will try to plunder your shelter.<br/><br/>RECRUIT SURVIVORS<br/>Find isolated people, and together build a safe place to live, far from zombies and bandits. Assign them roles in the shelter and ask for their help while you leave to collect resources. Turn survivors into heroes in the war against zombies.<br/><br/>NEGOTIATE WITH OTHER SETTLEMENTS<br/>Everyone is an enemy, but it doesn’t have to be that way forever. Contact other refugees and create alliances with them. Building a new world is a tough proposition: you’ll need to negotiate with other shelters to succeed.<br/><br/>BUILD THE BEST SHELTER<br/>The world has come to an end, but that doesn’t mean survivors should live badly. Manage your shelter, improve it to make space for more survivors, add entertainment zones and farming areas. Grow crops, recycle materials, and establish a self-sufficient community.<br/><br/>TAKE THE SURVIVORS INTO THE REAL WORLD<br/><br/>Use the Augmented Reality feature to bring the survivors into the real world. See how they look in the street or in your home, and take a photo with them.<br/><br/><br/>KEY FEATURES:<br/>- Build your shelter from scratch and defend it from zombies and other survivors<br/>- Attack other shelters to get more resources<br/>- Player Vs. Player modes<br/>- Recruit survivors and create a powerful anti-zombie squad<br/>- Chat with other players<br/>- All game modes can be played for free<br/>- Sign in to your Game Center account to save your progress<br/>- Optimized for iPhone 8, iPhone 8 Plus, and iPhone <br/>- The Augmented Reality feature is exclusive for iOS devices. Compatible with iPhone 7, iPhone 7 Plus, iPhone 8, iPhone 8 Plus, iPad Air (2017), and iPad Pro.<br/><br/>ZOMBIES is a free online game. However, some game items can also be purchased for real money. If you don't want to use this feature, please disable in-app purchases in your device's settings.<br/><br/>IMPORTANT NOTES: <br/>- This app requires an iPad 4 (or newer), or iPhone 6 (or newer),<br/>- An Internet connection is required to play.<br/>_____________________________________________<br/><br/>Visit our official site at http://codigames.com", "metacritic": null, "released": "2017-12-06", "tba": false, "updated": "2019-07-29T12:41:13", "background_image": "https://media.rawg.io/media/screenshots/98b/98b8e37d3e372f16ffe4a9c7f99bebba.jpg", "website": "http://codigames.com/portfolio/zombie-faction/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 225, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Digital Things"], "genres": ["Action", "Strategy"], "publishers": ["Digital Things Sociedad Limitada"], "esrb_rating": "Mature"}