{"id": 253384, "slug": "poker-live-3d-texas-holdem", "name": "Poker Live! 3D Texas Hold'em", "name_original": "Poker Live! 3D Texas Hold'em", "description": "Say hello to Octro Poker Live! from the makers of the original sensation Teen Patti. Octro Poker Live! is a real time 3D multiplayer Poker game which you can play with your friends or people around the world.<br/>Currently Octro Poker Live! features the Texas Hold'em style Poker which is inarguably the most common form of poker played around the world.<br/><br/>Game Features:<br/><br/>• Full immersive 3D playing experience<br/>• Choose from a wide variety of dealers and backgrounds<br/>• Elegant UI which adapts to your playing preference<br/>• Silly, cool and funky gifts. Have fun giving a donkey to your opponent<br/>• Smooth gameplay even on low end devices<br/>• Chat with your friends and other players (or block annoying people)<br/>• Play in style with your friends on Private Tables<br/>• One tap access to Poker Hands list while playing the game<br/><br/>Poker 3D consists of two cards being dealt face down to each player and then five community cards being placed face-up by the dealer—a series of three (\"the flop\") then two additional single cards (\"the turn\" and \"the river\" or \"fourth and fifth street\" respectively), with players having the option to check, bet, raise or fold after each deal; i.e., betting may occur prior to the flop, \"on the flop\", \"on the turn\", and \"on the river\". Poker 3D is a western version of the famous Octro Teen Patti game, with the primary difference being that you are dealt 2 cards instead of three. You need to pair your cards with the ones that form the river and bet big!", "metacritic": null, "released": "2016-01-12", "tba": false, "updated": "2019-10-22T14:11:36", "background_image": "https://media.rawg.io/media/screenshots/659/659d13995b53c306df337eaea41940fc_BJ3rW1t.jpg", "website": "http://poker.octro.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 90, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Octro"], "genres": ["Card"], "publishers": ["Octro"], "esrb_rating": "Teen"}