{"id": 253366, "slug": "lords-castles-epic-empires", "name": "Lords & Castles - Epic Empires", "name_original": "Lords & Castles - Epic Empires", "description": "What kind of king would you be? Are you ready to rule a kingdom?<br/><br/>Take control of your own realm, and turn it into the most powerful one. Defeat your enemies, and conquer the world!<br/><br/>Be part of the evolution of the strategy genre. Design the best defense by designing every aspect of your realm. Create mountains, dig moats, and place buildings in strategic positions. Give your archers an advantage by placing them in the top of a hill, or build a moat around your castle.<br/><br/>Once your city is well protected, recruit an army from more than 20 different troops, and attack your enemies. Summon great leaders of history that will help you in your adventure. Let Julius Caesar lead your army, and call Cleopatra to manage the defense of your city in your absence.<br/><br/>KEEP YOUR PEOPLE HAPPY<br/>Arrange the buildings wisely in order to make your subjects happy, and gain their favor. Peasants, and workers prefer to live near the protection of the castle. A tavern in the neighborhood is also appreciated.<br/><br/>RESEARCH NEW TECHNOLOGIES<br/>Science is your ally! Your scientist can help your kingdom. Ask them to research new technologies to improve your weapons, and your defenses. They can also make your crops more efficient.<br/><br/>CHANGE THE TERRAIN<br/>If you are king, why would you not be able to decide every detail of your city? Build hills, and mountains, create valleys, and dig moats. Use the terrain to improve the defenses of your kingdom.<br/><br/>RULE THE KINGDOM<br/>Attack your enemies’ kingdoms to get extra resources. Destroy their defenses and plunder your rivals’ castles.<br/><br/>GET HELP FROM GREAT LEADERS<br/>Summon great leaders from all times to help you in battle. Recruit William Wallace, Lincoln, or Cleopatra, among others, to defend your city, and attack your enemies.<br/><br/>DESIGN YOUR DEFENSES<br/>Help your soldiers to defend your land by creating mountains and digging moats. Take advantage of the terrain to improve your defenses!<br/><br/>FORGE ALLIANCES<br/>Join your friends to build a powerful kingdom. Ally with other kingdoms, and sign treaties with them to protect them, or to force them to help you in time of war.<br/><br/>CONQUER THE WORLD<br/>Select a country, and start to build your kingdom. Make it the most powerful one, conquer all the territories around you, and create an empire.<br/><br/>MAIN FEATURES:<br/>- Design your city. Create mountains, and dig holes to defend it.<br/>-  Attack other players’ land, and defend yourself from them<br/>- Chat with other players<br/>- All game modes can be played for free<br/>- Sign in to Game Center to play on various devices<br/>- Optimized for iPhone 7 and iPhone 7 Plus", "metacritic": null, "released": "2016-08-30", "tba": false, "updated": "2019-07-29T12:41:12", "background_image": "https://media.rawg.io/media/screenshots/ee6/ee655a8a3acec9fa8f69578b0f678b40_Z8FgzbY.jpg", "website": "http://codigames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 159, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Digital Things"], "genres": ["Strategy", "Simulation"], "publishers": ["Digital Things Sociedad Limitada"], "esrb_rating": "Teen"}