{"id": 253396, "slug": "bhabho-laad-get-away", "name": "Bhabho - Laad - Get Away", "name_original": "Bhabho - Laad - Get Away", "description": "Bhabho is very addictive and popular Indian Card Game.<br/><br/>Bhabho is also known by many players as Bhabhi or Laad or Get Away. The aim of the game is to \"get away\" by playing all of one's cards. The last remaining player who fails to get away and is left holding cards is the loser.<br/><br/><br/>First trick of Bhabho - Laad - Get Away:<br/><br/>The player who holds the Ace of Spades begins by playing it face up on the table, and each of the other players must play also a card face up. For convenience, this may be done in clockwise order, but in this first trick it is not strictly necessary for players to wait for their turn before playing. Those players who have a spade must play a spade of their choice; those who have no spades may play any card they wish. When everyone has played one card, these cards are gathered and set aside face down, beginning a waste pile. The player who had the Ace of Spades now begins the second trick by playing any one of his her remaining cards face up on the table. <br/><br/>Second and subsequent tricks of Bhabho - Laad - Get Away:<br/><br/>Each trick is begun by the player of the highest card in the suit that was led to the previous trick: this player is said to \"have the power\". The player leads any card, placing it face up on the table. Then the other players, in clockwise order, must if possible play a card of the same suit as the card that was led. If they have several cards of the suit they have a free choice which of them to play. A player who has no card of the suit led may play any card. This card of a different suit, sometimes known as a 'tochoo' or a 'thulla', and it ends the play to that trick. Subsequent players, to the left of the one who played the tochoo, do not get to play a card. <br/><br/>If everyone plays a card of the same suit as the card led by the first player, then when all have played one card, these cards are gathered and added face down to the waste pile. <br/><br/>If someone was unable to follow suit and played a tochoo, then whoever played the highest card of the suit that was led picks up all the cards played to the trick and adds them to their hand. In either case, the player who played the highest card of the suit that was led now \"has the power\" and begins the next trick by leading any card from hand. <br/><br/>Getting away<br/><br/>As the game continues, since not everyone plays to every trick and players sometimes have to pick up cards, the players will run out of cards at different times. Players who run out of cards have \"got away\": they take no more part in the play and are therefore safe from losing. <br/><br/>However, it is not possible to get away if you \"have the power\". If your last card is the highest in a trick in which everyone is able to follow suit, then it is your turn to lead to the next trick but you have no card. In this case you must draw a card at random from the (shuffled) face down waste pile, before the cards from the trick just played are thrown onto the pile.<br/><br/>You must lead the card that you drew to continue the game. If you are lucky, and a higher card of that suit is played to the trick, then you will be out of the game and safe. If no one plays higher in that suit then you will have to lead again, either from the cards you pick up if there is a tochoo, or otherwise by drawing from the waste pile again. <br/><br/>Taking cards Before any trick, any player is allowed to take all the cards from the player to their immediate left - or if that player has no cards, the next player in clockwise order who still has cards - and add these cards to their hand. The player whose cards were taken has got away and cannot lose. <br/><br/>At first sight it may seem surprising that anyone would wish to do this given that the aim is to get rid of cards. In fact it is often the best move if the player to your left does not have the suits that you have, or has some low cards that you need.", "metacritic": null, "released": "2018-02-16", "tba": false, "updated": "2019-10-22T14:00:43", "background_image": "https://media.rawg.io/media/screenshots/f19/f193fb2400f468568938cf03ff9538c7_XhqZdPt.jpg", "website": "http://bhabho.octro.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 57, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Octro"], "genres": ["Card"], "publishers": ["Octro"], "esrb_rating": "Everyone 10+"}