{"id": 253371, "slug": "zombie-battleground-survival", "name": "Zombie Battleground - Survival", "name_original": "Zombie Battleground - Survival", "description": "Will you survive in a zombie world?<br/><br/>Be brave, and enter the post-apocalyptic world full of zombies. Get ready to fight the zombies, and be prepared to defend yourself from all the dangers that awaits you.<br/><br/>Gather unique survivors, and train them to fight in real-time online strategy battles against other players. Capture zombies, and use them against your enemies.<br/><br/>REAL-TIME STRATEGY BATTLES<br/>Fight online against other players in real-time battles. Use a good strategy to defend your stuff, and get your enemy’s resources to improve your squad, and survive in the post-apocalyptic world.<br/><br/>COLLECT SURVIVORS… AND ZOMBIES!<br/>Recruit new survivors, and help them to become stronger. Capture zombies, and use them in combat. Each survivor, and zombie is unique, and combining them wisely during the battle is the way to victory.<br/><br/>SPECIAL ITEMS THAT WIN BATTLES<br/>Find special items that will help you in battle. First-aid kits, Molotov cocktails, explosives, … Create a good arsenal to help your survivors defeat their enemies.<br/><br/>CREATE THE PERFECT SQUAD<br/>Gather a great group of survivors, and create your squad. Each survivor has a different ability that makes him, or her, special. Zombies are also an important part of the team. Unleash them in the right moment, and surprise your opponent.<br/><br/>MAIN FEATURES:<br/>- Online real-time battles<br/>- Post-apocalyptic world full of zombies<br/>- Collect unique survivors<br/>- Capture zombies, and use them in battle<br/>- Chat with other players.<br/>- All game modes can be played for free.<br/>- Sign in to Game Center to save your progress.<br/>- Optimized for iPhone 8,  iPhone 8 Plus, and iPhone X<br/><br/>This app is an online free to play game. However, some game items can also be purchased for real money. If you don't want to use this feature, please disable in-app purchases in your device's settings.<br/><br/>IMPORTANT NOTES: <br/>- This app requires an iPad 4 (or newer), or iPhone 6 (or newer),<br/>- An Internet connection is required to play.<br/>_____________________________________________<br/><br/>Visit our official site at http://codigames.com", "metacritic": null, "released": "2018-07-05", "tba": false, "updated": "2019-10-22T14:00:34", "background_image": "https://media.rawg.io/media/screenshots/75c/75c9b12a88ecb5816d379122cccff8fb.jpg", "website": "http://codigames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 250, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Digital Things"], "genres": ["Action", "Strategy"], "publishers": ["Digital Things Sociedad Limitada"], "esrb_rating": "Teen"}