{"id": 253388, "slug": "seep", "name": "Seep", "name_original": "Seep", "description": "Seep (also known as Sweep) is a classic Indian Card game played between 2 or 4 players. Seep is more over popular in Indian, Pakistan and few other Asian countries.<br/><br/>In 4 player mode Seep played in fixed partnerships of two with partners sitting opposite one another. <br/><br/>The aim of the Seep game is to capture cards worth points from a layout on the table (also known as the floor). The game ends when one team has accumulated a lead of at least 100 points over the other team (this is called a baazi). Players can decide in advance how many games (baazis) they want to play.<br/><br/>At the end of the seep round the scoring value of the captured cards is counted:<br/><br/>- All cards of the Spade suit have point values corresponding to their capture value (from the king, worth 13, down to the ace, worth 1)<br/>- The aces of the other three suits are also worth 1 point each<br/>- The ten of diamonds is worth 6 points<br/><br/>Only these 17 cards have a scoring value - all other captured cards are worthless. The total scoring value of all the cards in the pack is 100 points.<br/><br/>Players can also score for a seep, which occurs when a player captures all the cards from the layout, leaving the table empty. Normally a seep is worth 50 points, but a seep made on the very first play is worth only 25 points, and a seep made on the last play is worth no points at all.<br/><br/>Seep is very similar to the Italian game Scopone or Scopa.<br/><br/>For rules and other information, check out http://seep.octro.com/.", "metacritic": null, "released": "2012-07-03", "tba": false, "updated": "2019-10-22T14:11:37", "background_image": "https://media.rawg.io/media/screenshots/590/590e7ab4233abd8c34160763aaf7017c.jpg", "website": "https://seep.octro.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 30, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Octro"], "genres": ["Card"], "publishers": ["Octro"], "esrb_rating": "Teen"}