{"id": 253317, "slug": "museum-of-thieves", "name": "Museum Of Thieves", "name_original": "Museum Of Thieves", "description": "Welcome to the perilous City of Jewel , a repressive society that protects young people \"for their own good.\" Where impatience is a sin and boldness is a crime.<br/>Goldie Roth has lived in Jewel all her life. Like every child in the city, she wears a silver guardchain and is forced to obey the dreaded Blessed Guardians. She has never done anything by herself and won’t be allowed out on the streets unchained until Separation Day.<br/>When Separation Day is canceled, Goldie, runs away to the mysterious Museum of Dunt. Only the cunning mind of a thief can understand the museum’s strange, shifting rooms. Fortunately, Goldie has a talent for thieving.<br/><br/>Which is just as well, because the leader of the Blessed Guardians has his own plans for the museum—plans that threaten the lives of everyone Goldie loves. And while there's great wonders hidden in the museum, there's terrible things too, things that mustn't be allowed to break out into the city. And if ever the museum's under threat, those things grow more and more restless….<br/>In this beautifully illustrated game based on the first book in the Keepers Trilogy by Lian Tanner – MUSEUM OF THIEVES – you must spot the differences in order to find your way through the museum. <br/>Beware and be warned . . . The Blessed Guardians are watching.", "metacritic": null, "released": "2010-09-26", "tba": false, "updated": "2019-10-22T14:00:34", "background_image": "https://media.rawg.io/media/screenshots/c81/c8157c6e7b72563abc70758a8037ab7a.jpg", "website": "http://", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 271, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Difference Games"], "genres": ["Family"], "publishers": ["Difference Games"], "esrb_rating": "Everyone 10+"}