{"id": 253435, "slug": "roundabout-2-city-driving-sim", "name": "Roundabout 2: City Driving Sim", "name_original": "Roundabout 2: City Driving Sim", "description": "Fasten your seatbelt, start your engine and get ready for some real driving! This isn't one of those fantasy scenarios, where cars behave like children's toys and all you have to do is drive as fast as you can. This is a game for true car enthusiasts. Select one of many meticulously rendered vehicles and take it for a spin in a lifelike environment. Cruise in the subburbs, traverse the city streets and show you have what it takes to consider yourself a real driver.<br/><br/>A VARIETY OF EXCITING CARS<br/><br/>We have something for everyone. There's a sports car, a pickup, a caravan, even a police van! Every one of them poses a different challenge. Learn to take advantage of their strengths, work around their weaknesses!<br/><br/>BELIEVABLE CITY ENVIRONMENTS<br/><br/>You will drive around tracks designed to look as lifelike as possible. City streets are bustling with traffic, the details give the surroundings a real sense of place.<br/><br/>REALISTIC TRAFFIC<br/><br/>Staying on course and avoiding the obstacles won't be your only concern. You also have to mind other cars. Watch other drivers as they go about their business and don't let them interfere with yours!<br/><br/>FREE TO PLAY<br/><br/>The Main Game Mode is 100% FREE to play, all the way through, no strings attached! Extra Game Modes which alter the rules slightly to make the game easier are available through optional In-App Purchases.<br/><br/>GAME FEATURES<br/><br/>▶ VARIED VEHICLES: Drive &amp; Park 13 Unique and Different Vehicles! 3 Brand New!<br/>▶ PARKING: Over 65 Precision Driving Missions to Pass! <br/>▶ ARENA: Each track is a challenge full of obstacles and opportunities.<br/>▶ 100% Free-2-Play Missions<br/>▶ CONTROLS: Buttons, Wheel or Tilt Controls<br/>▶ CAMERAS: Multiple cameras including First Person view<br/>▶ FREE ROAMING MODE: Explore the area at your own pace<br/>▶ iCLOUD: Supports play between your devices &amp; automatic progress backup with iCloud", "metacritic": null, "released": "2017-03-10", "tba": false, "updated": "2019-07-29T20:08:16", "background_image": "https://media.rawg.io/media/screenshots/402/4028b400f82a69e1c325333c8544f8f6_EYi66AZ.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 179, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Play With Games"], "genres": ["Sports", "Racing"], "publishers": ["Play With Games"], "esrb_rating": null}