{"id": 253518, "slug": "made-in-chelsea-unlocked", "name": "Made in Chelsea: Unlocked", "name_original": "Made in Chelsea: Unlocked", "description": "Raise your phone and get your selfie stick at the ready as the vlogging world takes over Chelsea. Increase you profile throughout London by gathering in-game followers to boost your celebrity status. Air-kiss, fight and date your way to the top of the social ladder as you party with the in crowd of MIC.<br/><br/>Will you become the ultimate socialite in London’s prestigious SW3? Can you vlog your way to the top?<br/><br/>Features<br/>- Gossip, flirt and date familiar faces from the BAFTA-winning reality TV show.<br/>- Interact with your favourite Chelsea socialites: Victoria, Mark Francis, Louise, Rosie, Lucy, Jamie, Alex, Binky, Ollie, Cheska, James, Olivia, Alik, JP, Toff, Tiff, Jess, Sam, &amp; Steph.<br/>- Exclusive voiceovers from members of the gang.<br/>- Discover the London suburbs of Kensington, Belgravia and Mayfair as you progress through the game.<br/>- Visit the west London venues featured in the E4 show including: Beaufort House, Broadway House, Vanilla, Dirty Martini, Bluebird, The Henry Root &amp; The Phene.<br/>Style your own 3D character and customize your look regularly to remain in the limelight.<br/>- Not to mention beloved music from the hit TV show including: Peaness – Oh George, Face + Heel – We Can Swim, Lecaude – Smoke N Mirrors, Shrinking Minds – Fun, Holy57 – 1.9.9.0, Litany – Work this Out, Tea Street Band – Feel It, Get Inuit – My Oh My.<br/><br/>*Please note – this game is free to play, however some items may be purchased for real money. If you do not want to use this feature, please disable in-app purchases in your device settings.<br/><br/>** This game does not support iPhone 3GS, iPad 1, iPod Touch 4th Generation or earlier devices.<br/> <br/>In order to deliver a personalised, responsive service and to improve the game, we remember and store information about how you use it. The information is completely anonymous and will never include any personal details. It is used only by Channel 4 or the trusted partners we work with. If you wish, you can switch off our analytics software within the “Options” screen of the game. The game contains promotions for Channel 4’s other products and services as well as some promotions of third party products and services. By downloading this application, you agree to our terms of use (http://www.channel4.com/programmes/all-4-games/articles/all/game-terms-and-conditions), privacy policy and cookies policy.<br/> <br/>Connect with All4Games -<br/>Website: www.all4games.co.uk<br/>Twitter: https://twitter.com/All_4_Games<br/>Facebook: https://www.facebook.com/All4GamesOfficial/?ref=bookmarks", "metacritic": null, "released": "2016-11-24", "tba": false, "updated": "2019-10-22T14:11:41", "background_image": "https://media.rawg.io/media/screenshots/1b7/1b73bbabb5a8afe2cf6161f84be01a72_uJ3nzJN.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 157, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Channel 4"], "genres": ["RPG", "Simulation"], "publishers": ["Channel 4"], "esrb_rating": "Mature"}