{"id": 253558, "slug": "island-survival-game", "name": "Island Survival Game", "name_original": "Island Survival Game", "description": "Something terrible happened and you are alone on island survival!<br/><br/>Survive on a deserted swarm with wild hungry animals at winter. Big island is absolutely winter desert - now your friends is different ore and trees. May be people live at winter island many years ago, but now you can see some mysterious secrets.<br/><br/>You must survive even one night, but you can try.<br/>Meet Island Survival FREE game – extremely addictive survival simulator of wild life.<br/><br/>*** HOW TO PLAY ***<br/>- Pickup stone and hew trees. You can use only one item for these goals - it can take a long time, but later you can craft pick or axe. Come close to the tree or stone and tap item button guns, follow the scale (STONE or TREE). When the range is full, you'll get wood\\stone.<br/><br/>- Using resources you can craft weapons for hunting animals, a torch and a fire for light at nights, as well as materials for building a house<br/><br/>- To build a house, you have to to install the foundation first, then the walls, windows and doors, then roof.<br/><br/>- To hunt animals for food<br/><br/>- Attacks of predators, you can use any tool. Aim the camera at an animal and press the item button. When an animal dies, you can collect food.<br/><br/>Island Survival game features:<br/>•\tCrafting<br/>•\tBuilding<br/>•\tSurvival At Island<br/>•\tWild animals hunting<br/>•\tBeautiful graphics<br/>•\tReal island adventure<br/>•\tA lot of items<br/>•\tBig islands<br/><br/>Play Island Survival! Can you survive at night? Anyway, good luck, and let's start island exploration!", "metacritic": null, "released": "2017-03-12", "tba": false, "updated": "2019-10-22T14:37:46", "background_image": "https://media.rawg.io/media/screenshots/8f2/8f287218f50a3506e196c593bf74036f_dnnlpAL.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 185, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Svetlana Semenova"], "genres": ["Adventure", "Simulation"], "publishers": ["Svetlana Semenova"], "esrb_rating": null}