{"id": 253501, "slug": "the-overkill", "name": "The OverKill", "name_original": "The OverKill", "description": "Fight against real people from all around the world as a DEADLY MONSTER or an ELITE SOLDIER. Who are you gonna be?<br/><br/>ULTRA-REALISTIC 3D<br/><br/>You won’t believe how realistic the 3D graphics are! Experience console-level quality while you explore a hard, dangerous, and rich world.<br/><br/>BE THE MONSTER OR BE THE HERO<br/><br/>Become a monstrous abomination and kill the skilled soldier from the opponent team. Make them cry for their mamas while you bring havoc and death to the battlefield!<br/><br/>Or you can either decided to join forces with other players to bring down the monster, proving your skills as an elite soldier.<br/><br/>CLASS-BASED GAMEPLAY<br/><br/>Choose any class you want. Chase the monster and kill it from from afar as a Sniper, defend your team as an Engineer, or even heal your allies being a Doctor.<br/><br/>TONS OF WEAPONS<br/><br/>Customize your weapons and upgrade your gear to fit your class’ specific abilities. Unlock new and powerful weapons and abilities as you progress. Craft traps and bombs to damage and immobilize the enemy.<br/><br/>FIGHT DIFFERENT MONSTERS<br/><br/>Travel to different locations and fight a variety of monsters of all sizes and breeds. Think fast to counter-attack their specific abilities with the right weapons and powers. No enemy is equal to another!", "metacritic": null, "released": "2017-02-16", "tba": false, "updated": "2019-10-22T14:11:41", "background_image": "https://media.rawg.io/media/screenshots/d11/d111e1ce9e570767d7293b4ea7d12062_G49fUFU.jpg", "website": "http://www.texaspfcg.com/app?bundleId=com.cronus.hackathon201612.group10.project1&name=Zombits", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 119, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Texas PFCG Aplicativos Ltda"], "genres": ["Adventure", "Puzzle"], "publishers": ["Texas PFCG Aplicativos Ltda"], "esrb_rating": "Everyone 10+"}