{"id": 253521, "slug": "annoying-orange-splatter-up-free", "name": "Annoying Orange: Splatter Up Free!", "name_original": "Annoying Orange: Splatter Up Free!", "description": "Join the Annoying Orange and his entourage for this splatterific home run derby game that is sure to put you in stiches.  Swipe for the fences and induce maximum pain (and points) on unsuspecting fruits like Apple, Banana and Cantaloupe in the Kitchen of Casualty. <br/><br/>Features:<br/><br/>• Tons of characters and hilarious color commentary from Apple, Strawberry, Banana, the Annoying Orange and more!<br/><br/>• Bruise, burn, slice, freeze, electrocute and eviscerate your favorite fruits with a multitude of dangers in the Kitchen!<br/><br/>• A variety of pitches that start easy but will quickly challenge your timing and accuracy!<br/><br/>• Over 30 achievements to test your Resolve… which you will need plenty of after a round of this game.  HAHAHA!<br/><br/><br/>Jingle bells, jingle bells, splattered fruit smells!  Enjoy a Splatter Up! holiday themed kitchen environment!<br/><br/>• “Stitchy” the Softball joins the crew.  Use this ol’ timer when you need a slow and straight pitch. Use him wisely though… you only get 3 per game!<br/><br/>• Santa Squash arrives in the kitchen with a present for all the good (and bad) boys and girls!<br/><br/>• Marshmallow jumps in and enjoys his favorite holiday drink.  Dunk him for a chocolate boost! Yay!<br/><br/>• Power-up your scores by collecting the elusive Starfruit for 5 additional outs in the current game!.", "metacritic": null, "released": "2013-12-05", "tba": false, "updated": "2019-10-22T14:11:42", "background_image": "https://media.rawg.io/media/screenshots/631/6310a55319748253f124ed62e735bae0_RkbsJDX.jpg", "website": "http://www.bottlerocketapps.com/thruster", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 100, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Thruster"], "genres": ["Action", "Arcade"], "publishers": ["Thruster Apps"], "esrb_rating": "Teen"}