{"id": 253674, "slug": "biok", "name": "BIOK", "name_original": "BIOK", "description": "BIOK is pure strategy and intuition. A board game for the ingenious and the acute minds.<br/>Lead the creatures on the playing field to capture monsters and all kinds of items. Watch the monsters' eyes and guide them to their preys.<br/><br/>There are multiple solutions in each level, but the best strategists will strive for the maximum, with great skill and a pinch of logic.<br/><br/>PLAN<br/>Carefully study the disposition of the creatures and plan the moves taking full advantage of the characteristics of each creature.<br/><br/>CAPTURE<br/>Each mission has its objectives. Capture the required monsters and respect the markers to complete the level. The less movements you use, the more stars you get.<br/><br/>COLLECTS<br/>Collect special items and consult the Monsterpedia to learn all the details about each monster, object and special item.<br/><br/>HOW TO PLAY<br/>- Move the creatures, swipe in any direction<br/>- Capture monsters according the targets<br/>- Collect special items<br/>- The less the moves, the more the stars earned<br/><br/>FEATURES<br/>- Simple controls and fluid mechanics, super simple to understand and fun to use<br/>- 60 levels in many worlds with various maps<br/>- 10 creatures with different characteristics and abilities<br/>- Bonus and survival mode to solve puzzles and challenges<br/>- Special objects and environmental elements<br/>- Secondary missions and hidden objectives<br/>- Achievement and integration with Game Center<br/>- Fun and suitable for all ages<br/><br/>BIOK does not require an internet connection. It is possible to play BIOK in total tranquility while being offline.<br/><br/>Relax yourself by playing BIOK just a little before falling asleep. Don't let the social media catch you, be a captain and a strategist, lead the BIOK creatures by your command to catch their preys.", "metacritic": null, "released": "2018-08-02", "tba": false, "updated": "2022-11-02T18:59:59", "background_image": "https://media.rawg.io/media/screenshots/b42/b42d7104ace41cacbd4ceb0b72eb3a24_b5gmVdJ.jpg", "website": "http://www.nonostante.io/games/biok", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 54, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["Giuseppe La Torre"], "genres": ["Board Games", "Puzzle"], "publishers": ["Giuseppe La Torre"], "esrb_rating": null}