{"id": 25378, "slug": "action-girlz-racing", "name": "Action Girlz Racing", "name_original": "Action Girlz Racing", "description": "<p>\n      Pick your favorite Action Girl and take to the roads to race around \n      fairy-tale castles, holiday resorts and even through school corridors \n      while the teachers aren't looking! Best of all are the Action Girlz \n      themselves:\n    </p><p>\n</p><p>\n      Meet Kat, an action girl with no fear – she will take anything on! She \n      loves to hug the curves of every race track as close as she can, and is \n      always the first to have a drink after the racing is over Latisha is so \n      cool you have to check her for a pulse – nothing riles this girl! She \n      knows her own mind and no one changes it – watch out for her, she’ll \n      have no qualms about overtaking at speed. Bianca is all about being a \n      professional – she has it all! She uses her head and thinks about every \n      corner and pick-up on the track. But she isn’t all brains though, Bianca \n      knows how to have fun &amp; relax with her mates once the race is finished. \n      Amber may come across like she’s more concerned about her looks but \n      that’s only because she wants to win in style! Her image is important to \n      her, but nothing compares to the feeling of winning. Akiko likes indie \n      music and tap-dancing, hey every girl's different! But when it comes to \n      racing she only thinks about the finish line, and will do whatever it \n      takes to cross it first. Blossom harnesses flower-power like no other \n      female – she’s really something, and her passionate yet relaxed \n      personality makes her the ideal driver - all the other girls love her. \n      Courtney is up there with Latisha for being the coolest chick around – \n      but she’s not copying man, oh no, she’s got her own style. When she \n      overtakes her competitors on the track, she knows she'll be seeing them \n      L8er.\n    </p>", "metacritic": null, "released": "2005-07-23", "tba": false, "updated": "2023-02-16T15:27:19", "background_image": "https://media.rawg.io/media/screenshots/281/281d272421732fb1b29a47824907e872.jpg", "website": "http://217.199.176.105/full_item.php?item=3", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "toplay": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 234, "game_series_count": 0, "reviews_count": 0, "platforms": ["Wii", "PC", "PlayStation 2"], "developers": ["Data Design Interactive", "Data Design"], "genres": ["Racing", "Arcade"], "publishers": ["Conspiracy Entertainment", "Metro 3D Europe"], "esrb_rating": null}