{"id": 253888, "slug": "down-town-city-bus-driver-transport-simulation-3d", "name": "Down Town City Bus Driver: Transport Simulation 3D", "name_original": "Down Town City Bus Driver: Transport Simulation 3D", "description": "Enjoy the best Bus Driver Job in Metro Bus Service! Steer the big vehicle Metro Bus and start your city drive for transporting passengers in New big cities of the world, with fantastic city environment in day and night modes. Metro city Bus Public Transport Driving Simulation is a driving and pick &amp; drop game for transporting passengers to their destinations. Drive awesome 3D Metro Bus and enjoy realistic city traffic and Metro tracks. To be precise on time, head to the terminal with speeding race. Extreme driving and parking bus game will refresh your driving skills and dream of driving a real on-tour metro bus. Like parking games you have to stop city metro bus to pick passengers and to drop them on time. <br/><br/>Driving a real big bus which has the duty to take passengers and drop them on their specified stations is a real challenging job that requires true attention to play Metro city Bus Public Transport Driving Simulation  and your points will let you get to the next thrilling levels of this game. Task is challenging so be on time. Being a metro bus driver your duty is to arrive on time.  Time to ride a metro bus in city traffic at extreme speed. Show your extreme driving skills and simulate your drive with 3D metro bus. When you are on the city-road with your metro retro bus there are signals for the passenger picking, they are either on the bus station or randomly on road sides, keep your eyes towards them so that no passenger is left behind. It a hurry to rush game, reaching destination in time, with least collision rate and ensuring safety to the people in your bus will let you upgrade the game in less amount of time.<br/><br/>This latest game of all times is waiting for its driver to get the metro bus to its station in time and become the best on-duty driver. It is a dream of many people to ride a big bus, or a big heavy vehicle that gives plenty of challenging tasks, to test your skills and driving a bus experience. So here is the time for your to get into one of such experiences for free, by installing Metro city Bus Public Transport Driving Simulation in your mobile and enjoy endless extreme game-play with ultimate goals to complete and accomplish the title of best rider, road king or a metro-bus champ!<br/><br/>Metro city Bus Public Transport Driving Simulation Features:<br/>•\tCool jumbo city metro buses<br/>•\tRealistic metro tracks and stations<br/>•\tThree touch steering and button control options with the built-in accelero meter<br/>•\tDifferent camera angles that give you more control<br/>•\tAmazing 3D graphics<br/>•\tExtreme precision driving and sound simulations<br/>•\tChallenging and outstanding 3D outdoor environment with stunning graphics<br/>•\tOptimized game performance.<br/>•\tRealistic vehicle physics, high quality graphics and unlimited missions.<br/>•\tGreat Game Play and controls. <br/>•\tRefreshing background music &amp; sound effects. <br/>•\tRealistic bus features.<br/>•\tEasy and exciting game play.<br/>•\tHuge 3D virtual city to explore.", "metacritic": null, "released": "2017-03-31", "tba": false, "updated": "2019-10-22T14:09:40", "background_image": "https://media.rawg.io/media/screenshots/bfd/bfd54f32ee080f4adcb5a1a098908eed.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 107, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Syed Raza"], "genres": ["Simulation"], "publishers": ["Syed Raza"], "esrb_rating": "Everyone 10+"}