{"id": 2538, "slug": "get_fiquette", "name": "Get_Fiquette", "name_original": "Get_Fiquette", "description": "Mr Fiquette, Master Gentleman Thief, has busted out of jail and has set his sights on the good citizens of Bootleg City.  Come, join the fun of stopping Mr. Fiquette by dropping objects onto his head before he reaches his Hot Air Balloon and gets away.<br/><br/>From the dusty sketchpad of a grumpy ex-Electronic Arts Concept Artist and the deranged mind of a former Halfbrick Game Designer comes, &amp;quot;Get Fiquette&amp;quot;, a masterpiece of simple, addictive gameplay with an eye popping visual art style. It&amp;#39;s a technical marvel that merges the very latest advancements in electronic game manufacturing technology, complex binary spaghetti coding methods, multi-coloured, multi-parallax scrolling pixel planes, decidedly run-of-the-mill sound effects into an alluring package that&amp;#39;s cheaper than a cheeseburger and small enough to fit in your back pocket.<br/><br/>It&amp;#39;s fully Kickstarter free, Subscription free, Pop-up Adds free, partly biodegradable, somewhat crashable, fully rechargeable and Totally Enjoyable!! <br/><br/><br/>FEATURES:-<br/><br/>1. RESPONSIVE AND INTUITIVE TOUCH CONTROLS <br/>Open, Close, Drop, Pull, Swipe your way through the game with your favourite finger. <br/><br/>2. SIMPLE NAVIGATION <br/>Easy to follow camera system guides you through Bootleg City busy streets automatically. <br/><br/>3. DYNAMIC 2D WORLD <br/>Semi-real time Day and Night cycles, plus Rain and Thunder effects bring levels to life like ever before. <br/><br/>4. AUTHENTIC HAND DRAWN ART <br/>From the renowned skilled hands of pencil master Ferdinand Kreozot.<br/><br/><br/><br/>WHAT PEOPLE ARE SAYING:-<br/><br/>Gamesalad Game of the Year Winner - 2014 <br/><br/>&amp;quot;Fiquette will have you laughing and shaking your fist in the air as he makes his getaway&amp;quot;<br/>         - 8/10 - NewGamersNation.<br/><br/>&amp;quot;It&amp;#39;s goofy and shallow in just the right measures, and it completely owns its chosen style&amp;quot;<br/>         - 3.5 Stars - Touch Arcade.<br/><br/>&amp;quot;Love the game. It&amp;#39;s a reverse take on the runner style games. You have to stop the runner instead! Awesome!&amp;quot;<br/>         - BazookaTime<br/> <br/><br/><br/>http://youtu.be/TmUOY5ZhlcQ", "metacritic": null, "released": "2014-05-17", "tba": false, "updated": "2019-10-22T13:55:11", "background_image": "https://media.rawg.io/media/screenshots/7b5/7b5eabb671ab19f3c8f4f94164aeeb36.jpeg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 193, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Ross Mcrae"], "genres": ["Action", "Arcade"], "publishers": ["Ross Mcrae"], "esrb_rating": "Everyone 10+"}