{"id": 253899, "slug": "jungle-cargo-transportation-offroad-experience", "name": "Jungle Cargo Transportation: Offroad Experience", "name_original": "Jungle Cargo Transportation: Offroad Experience", "description": "Start your mega trucks engines and transport the forest woods and fuel barrels in the extreme dangerous hilly roads &amp; slippery snow conditions in Jungle Cargo Transportation: Offroad Experience. These heavy duty trucks and extreme weather conditions will test the drivers for their skills for jungle driving, parking, loading and transporting.<br/>In Jungle Cargo Transportation: Offroad Experience you will be driving the mega American and Euro trucks to transport the huge wood logs and fuel barrels from one location to another location in these shaggy snow forest and mountain locations. Unlock these trucks as you starts completing these amazing and challenging missions. The roads and tracks are also be test for you where roads are slippery due to heavy snow. So be careful! Don’t over run the turns and edges and protect your transporting stuff to reach its destination safe and sound.<br/>So don’t waste any time and download this addictive game Jungle Cargo Transportation: Offroad Experience to be legendary truck driver in these risky and dangerous off-road transporting missions you have ever faced!   <br/>Game Features:<br/>1)\tMega Trucks Driving Experience<br/>2)\tChallenging Off-road Driving Missions <br/>3)\tSmooth &amp; Easy Driving Controls", "metacritic": null, "released": "2017-06-15", "tba": false, "updated": "2019-10-22T14:09:41", "background_image": "https://media.rawg.io/media/screenshots/8c6/8c6b7633e246eb19159acdccda554d1e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 144, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Syed Raza"], "genres": ["Adventure", "Simulation"], "publishers": ["Syed Raza"], "esrb_rating": "Everyone 10+"}