{"id": 253838, "slug": "shark-fingers-3d-interactive-aquarium-free", "name": "Shark Fingers! 3D Interactive Aquarium FREE", "name_original": "Shark Fingers! 3D Interactive Aquarium FREE", "description": "Remember to try Fish Fingers! and Dolphin Fingers! too!<br/><br/>\"Live every week like it's SHARK WEEK!\" - Tracy Jordan<br/><br/>**** THE ORIGINAL AND THE BEST FINGER EATING SHARKS APP!!! BEWARE OF IMITATIONS!!! **** <br/><br/>** Upgrade to unlock the HAMMERHEAD SHARKS!!<br/><br/>** NEW IN v1.4: FEED YOUR FRIENDS TO THE SHARKS!<br/>It's easy! Here's how:<br/>- Set your background to the live camera, or an image of your friend (touch the menu in the top left of screen, and select Select Background)<br/>- Double tap the screen where you want the sharks to attack!<br/>- When you're ready, tap the Take Photo! button!<br/>- Save your image, or share it on FaceBook!<br/>Your friends (or enemies!) wont stand a chance!! :) **<br/><br/>#1 TOP FREE ENTERTAINMENT APP!<br/>TOP 10 FREE APPS IN THE US, EUROPE AND MOST OF THE WORLD!!!<br/>TOP 10 IN AUSTRALIA! (Made in Australia, by an Australian!)<br/>Millions of downloads!! Amazing!! Thank you to everyone! Email us your feedback so we can keep improving! Email us from www.UselessiPhoneStuff.com<br/><br/><br/>Watch as your iPad, iPhone or iPod Touch fills with water and vicious, real 3D, sharks begin to swim around your screen! <br/><br/>Features: <br/>- Too many aquariums claim to be 3D, but they're just flat pictures of fish floating around your screen being boring! Shark Fingers has REAL 3D SHARKS! They swim in all directions and can be viewed from any angle! They're really 3D! And they CHASE YOUR FINGERS! <br/><br/>- INTERACT WITH YOUR SHARKS! Touch the screen and watch the sharks hunt for your finger. But be careful not to lose your fingers... once you're bitten and there is blood in the water, the sharks may go into a frenzy! <br/><br/>- MORE THAN 1 SHARK! You'll have a whole bunch of sharks to deal with, not just 1 boring old shark! <br/><br/>- BLOOD!! Not for the feint hearted! Not only does your finger bleed when bitten, but if you bleed it enough, it tints the water red! Ouch!! <br/><br/>- LIVE CAMERA BACKGROUND! Set the background of your shark tank to the input from your camera and feed your friends to the sharks! <br/><br/>- TAKE UNDERWATER PHOTOS AND SHARE THEM ON FACEBOOK!<br/><br/>- USE ANY IMAGE you like as the background to your aquarium! Simply select any image from your photo library and it'll look like your iPhone or iPad is full of water, and full of 3D sharks! See what your Uncle Harry looks like with sharks chewing on his ears, or what your car would look like underwater, or your cat, your messages, any image you want!! Want more ideas? Visit: www.UselessiPhoneStuff.com!<br/><br/>- Tilt your iPhone, watch the water move! Just like that time you tried to pick up your real aquarium and all the fish fell out, but... not! <br/><br/>- JUMPING SHARKS! Just because your finger is above the water line, doesn't mean you're safe! Everyone asked for sharks jumping up to grab your finger, now they do it!!! <br/><br/>Visit www.UselessiPhoneStuff.com for more info, and drop us a line if you have feedback! <br/><br/>Enjoy! And beware of the sharks!!", "metacritic": null, "released": "2011-06-24", "tba": false, "updated": "2019-10-22T14:09:37", "background_image": "https://media.rawg.io/media/screenshots/03a/03a02bef1ab4bbfadadf37592de6b245.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 101, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Useless Creations"], "genres": ["Action", "Simulation"], "publishers": ["Useless Creations"], "esrb_rating": "Everyone 10+"}