{"id": 253815, "slug": "dr-schplots-nanobots-puzzle", "name": "Dr. Schplot’s Nanobots: Puzzle", "name_original": "Dr. Schplot’s Nanobots: Puzzle", "description": "Dr. Schplot's Nanobots is the only FREE puzzle match game that takes place inside your intestines!<br/> <br/>Reclusive scientist Dr. Schplot invented a crazy cast of life-saving nanobots that now live inside of every human being on the planet. These tiny nanobots were originally designed to fight disease, maintain organs, and extend lifespan from within our bodies.  The bad news is they have gone rogue and are taking over! It is now up to you to guide an army of new and improved nanobots on a journey to save humankind!  Solve unique tricky puzzles as you battle a wide variety of misbehaving micro-machines.  Recycle their spare parts to build ever more powerful new allies, collect cute characters and build an army to cure every last human in the wacky world of Dr. Schplot’s Nanobots!<br/> <br/>The game features:<br/><br/>● Unique gameplay: puzzle game with experimental puzzle mechanics!<br/>● Master challenging puzzles <br/>● Collect adorable nanobots and assemble your army<br/>● Make use of unique abilities<br/>● Find out the identity of the reclusive Dr. Schplot!<br/>● Play events to collect rare nanobots to complete your collection<br/>● 100% indie - made by 1 guy and 1 gal, no office, no publishers, no funding, lots of caffeine<br/><br/>Additional levels coming soon!<br/><br/>We hope you'll love our puzzle game! Having any problems? Any suggestions? We would love to hear from you! You can reach us at support@middlecitygames.com", "metacritic": null, "released": "2018-10-04", "tba": false, "updated": "2019-10-22T14:09:37", "background_image": "https://media.rawg.io/media/screenshots/644/64428d14000d87f884e1bf14d0dc6e1a_LS3rB3a.jpg", "website": "https://www.middlecitygames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 80, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Middle City Games"], "genres": ["RPG", "Puzzle"], "publishers": ["Middle City Games"], "esrb_rating": "Everyone 10+"}