{"id": 253861, "slug": "christmas-zombies-everywhere-santa-claus-vs-the-ap", "name": "Christmas Zombies Everywhere! (Santa Claus vs the Apocalypse)", "name_original": "Christmas Zombies Everywhere! (Santa Claus vs the Apocalypse)", "description": "** FREE FOR A LIMITED TIME! **<br/><br/>WARNING: This game is NOT very Christmassy! It is not intended for youngsters! If you love Christmas, DO NOT PLAY THIS GAME!<br/><br/>You've never played a game like this before. Especially not a Christmas game like this before!<br/><br/>The zombie apocalypse has reached the North Pole, and it's time for Santa to fight back!! Help Santa battle hordes of undead elves, reindeers and more!<br/><br/>Christmas Zombies Everywhere! uses amazing Augmented Reality to place zombies all around you in the REAL WORLD! Look around as if you're taking a photo, and prepare to fight for your life! How long can you survive??<br/><br/>You have to see it to believe it! You've never seen a game like this before. Seriously.<br/><br/>Features:<br/>- Totally immersive Augmented Reality puts zombies all around you in the real world. IT'S LIKE THEY'RE REALLY THERE! <br/>- Fight zombies in the real world, OR in a virtual environment! Now you can enjoy zombie slaying even in the smallest of spaces! <br/>- Different undead enemies! The longer you survive, the more different undead nasties will show up!<br/>- As you kill the walking undead, you unlock new weapons! Including AK-47, Shotgun, 44 Magnum, Flame Thrower, Mini-Gun, Sniper Rifle and MORE! <br/>- 2 Modes: Play the game and try to survive, or switch to SAFE MODE and enjoy the Augmented Reality effects without being attacked! You can still blast the lifeless walkers to Xmas Hell tho! <br/>- Unlock weapons within the game to use in Safe Mode. <br/>- Awesome 3D graphics. <br/>- Your movements control the game. Simply look around you, line up your cross hairs with your target, and tap to shoot. Swipe up to reload, then keep shooting! It's totally different to anything else, and very addictive! <br/><br/>WARNING: When using Augmented Reality please be aware of your surroundings! Be careful of the people and things around you. It's easy to be completely immersed in the Augmented Reality Apocalypse and forget where you are!<br/><br/>If you like this silly game, try the original ZOMBIES EVERYWHERE, ALIENS EVERYWHERE, NINJAS EVERYWHERE and more from Useless Creations!", "metacritic": null, "released": "2013-12-03", "tba": false, "updated": "2019-10-22T14:09:39", "background_image": "https://media.rawg.io/media/screenshots/ef5/ef55ab4afa3135c761373dc1614616a2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 107, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Useless Creations"], "genres": ["Action", "Simulation"], "publishers": ["Useless Creations"], "esrb_rating": "Mature"}