{"id": 253860, "slug": "air-crazy-gunship-battle-mission-stone", "name": "Air Crazy Gunship Battle: Mission Stone", "name_original": "Air Crazy Gunship Battle: Mission Stone", "description": "Gunship Stirring Sober Clash:  Air Stony Battle is the most immersive and realistic 3D gunship air battle action game available on Apple Store. <br/>Helicopter Gunship Strike puts you in the gunner seat of the most powerful helicopters. <br/>Launch the attack on the most dangerous terrorists now! You the air fighter helicopter pilot are well equipped with state of the art weapons, ammos and armories, counter attack to defeat the helicopter war terrorists. The flying battle for glory will not be easy it will be an ultimate modern air combat and gunship war between you and the counter terrorists. But beware, for next time you are launching a counter attack army helicopter air attack you will have to showcase immense skills, and extreme helicopter combat precision to destroy the enemy fleet, ensuring minimum self-damage in the modern air combat.<br/>Gunship Stirring Sober Clash:  Air Stony Battle put you in the gunner seat of the most powerful combat helicopters. Strategically fire your powerful machine guns and devastating missiles to slay hordes of enemies across the world. Guide with precision your combat helicopter and demolish the enemy military bases in the world’s greatest commando combat shoot experience! <br/>Just like other games you will be assigned a mission to strike on enemy base. So heads up and plan your gunship helicopter strike on enemy base. In your very first mission you have to strike on your enemy and destroy enemy base camp. Second mission will be to destroy enemy base and enemy tanks. Strike hard ruthless with your apache striker.", "metacritic": null, "released": "2017-03-30", "tba": false, "updated": "2019-10-22T14:09:39", "background_image": "https://media.rawg.io/media/screenshots/462/462846e7a2fa0d7f9c415f5eeddde1a3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 196, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Syed Raza"], "genres": ["Action"], "publishers": ["Syed Raza"], "esrb_rating": "Mature"}