{"id": 25399, "slug": "psychosis", "name": "Psychosis", "name_original": "Psychosis", "description": "<strong>Psychosis is a psychological survival horror game about familicide.</strong><br/><br/>When a family goes missing and you receive a mysterious phone call, all hell breaks loose as you are plunged into an expansive world where demons hunt you down and logic is turned inside out. Battle with the shreds of your own humanity through an hour of mind-breaking gameplay packed with combat, puzzles and mystery. <h3>KEY FEATURES</h3><br/><ul><li>Use blunt objects and firearms to fight demons and your own mind to save yourself from a never-ending hell.<br/></li><li>Pick up the mysterious pieces of a family gone missing and fight your way to the truth. <br/></li><li>Trust nothing as you lose your mind finding yourself in unfamiliar places at inopportune times.<br/></li><li>Transport yourself back to the 1990s Pacific Northwest with a hybrid-retro art style reminiscent of the era. The game is presented in a derezzed art style with modern lighting and crunchy audio.</li></ul><h3>PROLOGUE</h3><br/>It's nearly midnight and you're bored doing overtime at work, at your small office in the rural Pacific Northwest. The dull silence is cut by a phone call from a man with a familiar voice. The gruff voice urges you to \"come quickly, they're all gone.\"<br/><br/>Disturbed, you get in your car, and suddenly you're standing in the dimly lit foyer of someone's home. The place is empty, like everyone just got up and left. There's an awful stench in the air but you can't make out what it is. All you can hear is the sound of the wind and tree branches crashing against the side of the house, and a faint ticking noise. <br/><br/>Suddenly you feel an icy cold presence shoot through your body as your vision fades and your body washes with fear. You're paralyzed lying on the reeking, damp ground; through half-open eyes you see a tall figure wielding a harsh blade standing over you. The being opens its mouth as if to speak and all that comes out is the blood-curdling screeching of metal on metal.", "metacritic": null, "released": "2008-02-25", "tba": false, "updated": "2022-12-23T05:18:29", "background_image": "https://media.rawg.io/media/screenshots/f07/f079fcabc05b2c962d4c4ca4f34402c2.jpg", "website": "https://psychosisgame.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 427, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Wii"], "developers": ["Aaron Gilbert"], "genres": ["Action", "Indie"], "publishers": ["Naxat Soft", "Aaron Gilbert"], "esrb_rating": null}