{"id": 253904, "slug": "real-excavator-vehicles-heavy-duty-machines", "name": "Real Excavator Vehicles: Heavy Duty Machines", "name_original": "Real Excavator Vehicles: Heavy Duty Machines", "description": "Are you ready to driving heavy duty extreme excavator vehicles? These hydraulic muscle excavation cranes are not easy to handle. Drive through the high rugged rough terrain with incredible real 3D graphics and animations and with this heavy excavator you can perform all the hydraulic operations like universal winch, rotation, elevation and extension. Use steering that allow easy maneuvering in tight quarters. Test your heavy excavator handling skills at a real construction site with Real Excavator Vehicles: Heavy Duty Machines. <br/>First, you need to move excavation crane near to the rubble. Then rotate the excavator to excavate the rubble and dump it into the dumper. Automatic switched control will allow you to drive the dumper, you’ll have to park the loader dumper into the parking spot. Real Excavator Vehicles: Heavy Duty Machines is the real excavator handling experience.<br/>Real Excavator Vehicles: Heavy Duty Machines is for fans of extreme excavation challenges, with real heavy excavator and telescopic crane with extraordinary graphics that will also gratify double parking simulation enthusiasts.<br/><br/>Game Features:<br/>• Easy Steering, Brakes, Lifting and Rotation Controls.<br/>• Incredible 3D Graphics &amp; Environment.<br/>• Multiple heavy duty vehicles<br/>• Challenging  Gameplay Missions<br/>• Real Heavy Excavator Driving Experience.<br/>• Explore the Construction Site environment.<br/>• Complete all Levels of Driving and Excavation<br/>• HD Graphics, Animations and Sound Effects", "metacritic": null, "released": "2017-04-13", "tba": false, "updated": "2019-10-22T14:09:41", "background_image": "https://media.rawg.io/media/screenshots/d35/d356cc382bc6710a9d9a1d21ac4776f1_JcCLDMh.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 65, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Syed Raza"], "genres": ["RPG", "Simulation"], "publishers": ["Syed Raza"], "esrb_rating": "Everyone 10+"}