{"id": 25402, "slug": "kirby-64-the-crystal-shards", "name": "Kirby: The Crystal Shards (Wii)", "name_original": "Kirby: The Crystal Shards (Wii)", "description": "<p>Kirby&#39;s first 3-D adventure is also his Nintendo 64 debut, and it finds<br />\nthe always-versatile hero battling a new enemy called Dark Matter. Dark<br />\nMatter is after a distant land&#39;s powerful crystal, but a young fairy<br />\nnamed Ribbon attempts to save it by escaping with the gem to Dream Land.<br />\nNow the crystal has been broken, and it&#39;s scattered around the world.<br />\nTake control of Kirby and help him journey across six worlds, battling a<br />\nwide variety of enemies and challenging bosses, as he tries to collect<br />\nall 100 pieces of the shattered crystal. Along the way, you&#39;ll use<br />\nKirby&#39;s trademark copying ability to use enemies&#39; strengths against<br />\nthem. Not only that, but try combining any two abilities to create a<br />\nbrand-new one that is usually stronger than the original. Throw in three<br />\nexciting multiplayer minigames, and you&#39;ve got a package of which even<br />\nKing Dedede would be proud. Fans of Kirby and action games with bright,<br />\ncolorful graphics should vacuum this one up.<br />\nThis classic game is part of the Virtual Console service, which brings you great games created for consoles such as NES™, Super NES™ and Game Boy™ Advance. See more Virtual Console games for Wii.</p>", "metacritic": null, "released": "2008-02-25", "tba": false, "updated": "2022-05-25T07:17:33", "background_image": "https://media.rawg.io/media/screenshots/24d/24dde1ed4f8b09fe71d4136393f52db2.jpg", "website": "", "rating": 4.09, "rating_top": 4, "added_by_status": {"yet": 2, "owned": 9, "beaten": 24, "toplay": 3, "dropped": 2, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 23, "suggestions_count": 278, "game_series_count": 0, "reviews_count": 23, "platforms": ["Wii", "Wii U"], "developers": ["HAL Laboratory"], "genres": ["Adventure", "RPG"], "publishers": ["Nintendo"], "esrb_rating": null}