{"id": 254093, "slug": "happy-time-market", "name": "Happy Time: Market", "name_original": "Happy Time: Market", "description": "<p>Auf dem Markt herrscht Chaos und Happy weiß gar nicht, wo sie zuerst hinschauen soll!<br/></p>\n<p><em>Nach dem kaum spielbaren erst-Upload, nun eine spielbare Version.</em><br/></p>\n<p>Das Prinzip ist einfach: Tippt man auf ein Position, geht man dort hin. Je näher diese Position im Blick des sich drehenden Kopfes ist, desto schneller bewegt man sich.</p>\n<p>Je genauer man das Sichtfeld trifft, desto mehr Punkte bekommt man auch, visualisiert durch die Wertungen S,A,B,C,D &amp; F. Es gibt eine Combo bei S &amp; A, eine negativ Combo bei mehrfachem F.</p>\n<p>Das umherfliegende essen gibt Punkte je nach dem wie schnell sie sind - die Dosen ziehen Punkte ab. Das war's im Prinzip auch schon, ich hoffe es macht Spaß! :)</p>\n\n<p>Das Spiel habe ich zusammen mit meiner Freundin gemacht, von ihr stammen vor allem die Grafiken. Happy - übrigens - ist unser Hund. :)</p>\n<p>Thema: Aus Jahrmarkt ist ein eher klassischer Markt geworden, in dem alles umher fliegt. Dilemma!</p>\n<p>Diese Version ist natürlich erst nach dem Jam hochgeladen, da ich die letzten Stunden des Jams leider damit verbringen musste, das ganze auf Android zu portieren... (Hatte dafür 2 Stunden eingeplant, am ende waren es ca. 6) Wie dem auch sei, die Version hier entspricht dem, was ich zum Ende das Jams zumindest auf dem PC hatte. Bitte seht die zweite Version daher als die Offizielle, die erste hatte nur den Sinn, noch innerhalb der Zeit etwas hochgeladen zu haben.</p>\n\n<p><strong>Bugs und Probleme:</strong></p>\n<p>Das Spiel hat noch kein Ende. Zwar gibt es HP, diese haben aber noch keinen Nachteil. Glitches beim bewegen: Teilweise wird man sofort Teleportiert manchmal bekommt man auch ein F, obwohl man perfekt getroffen hat. Die Bodentextur muss auch unbedingt ausgetauscht werden. Die Schrift ist auch eine Katastrophe, die Fonts waren allerdings einer der Gründe, weshalb es mit Android so Problematisch wurde.</p>", "metacritic": null, "released": "2018-10-14", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/ef5/ef583af6edbb427295a65a9e99fe1432.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 30, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["PGH"], "genres": [], "publishers": [], "esrb_rating": null}