{"id": 2540, "slug": "draw-slasher-dark-ninja-vs-pirate-monkey-zombies", "name": "Draw Slasher: Dark Ninja vs Pirate Monkey Zombies", "name_original": "Draw Slasher: Dark Ninja vs Pirate Monkey Zombies", "description": "TheAPPera.com: &amp;quot;Pirate Or Ninja, Either Way... This Game&amp;#39;s Great!&amp;quot;<br/><br/>SlidetoPlay.com: &amp;quot;Gorgeous graphics and animation&amp;quot;<br/><br/>AppVee.com: &amp;quot;...has some of the coolest art I have seen in a game...&amp;quot;<br/><br/><br/>************ &amp;quot;Draw Slasher&amp;quot; ************<br/>&amp;quot;Draw Slasher&amp;quot; is an survival action game in which you take control of a cute ninja fighting against Pirate Monkey Zombies. These monsters invade your peaceful island, and you are the only one, who can stop them!<br/><br/>Slash through your enemies in style known from countless Japanese anime, and movies!<br/><br/>Cut off your opponents heads, hands, legs - whatever you want! Slash them to pieces and never stop the mayhem!<br/><br/>Hack your opponent and reappear behind his back. Do it over and over and make the biggest combo ever seen without being wounded once!<br/><br/>Features: <br/>- Gameplay modes: survival, waves, hardcore, classic<br/>- OpenFeint lederboards <br/>- Dozens of achievements <br/>- Opportunities to make unbelievable (100+) combos<br/>- Black &amp;amp; white sketch graphics<br/>- Lots of gore and cut off limbs!<br/>- Easy, but fun fighting mechanics<br/>- Pirate Monkey Zombies!<br/><br/><br/>Expansion Pack features:<br/>- New fighting arena (Sakura garden): Hack and slash in a garden covered by fallen Sakura petals <br/><br/>-Three survival modes: easy (15 stages), medium (30 stages), hard (45 stages). In each, you have to endure a certain number of levels. You can&amp;#39;t replenish your health by standing still. Instead you get health points between stages. The more, and bigger combos you make, the more health you regain.", "metacritic": null, "released": "2009-10-07", "tba": false, "updated": "2019-10-22T14:28:06", "background_image": "https://media.rawg.io/media/screenshots/ab4/ab4465c5a41ff395dd0fb6e407f3aeef.jpeg", "website": "http://mass-creation.com/drawslasher/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 213, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Mass Creation Sp"], "genres": ["Action", "Adventure"], "publishers": ["Mass Creation Sp"], "esrb_rating": "Teen"}