{"id": 254117, "slug": "doce-prologue", "name": "Doce: Prologue", "name_original": "Doce: Prologue", "description": "<p><em>You wake up in an alley. Your head hurts, and there's blood all over the place. You investigate your surroundings, but after you check everything, there's still something you don't know. <br/></em></p>\n<p><em><strong>\"Who am I?\"</strong></em>\n</p>\n<p><em>This is a mystery story about unveiling what happened in that alley. But what can someone without a clue of what his name is do?</em></p>\n<p><em>Luckily for you, someone comes to you as soon as you leave the alley... and it's your girlfriend?</em><br/></p>\n\n<em><strong>\"I'll help you as much as I can!\"</strong>                   <br/></em>\n\n<p><em>She'll support you as you discover your own past, and above everything else, what happened in that alley. But, you may also end up uncovering something that you wouldn't like to...</em></p>\n<br/>Final release features:\r\n<p><strong>Lockers</strong>: As you play, you will end up in some <em>bad places</em>, but don't worry! Sometimes, when everything goes south is when you're able to <em>find</em> something that will help you continue!</p>\n<p><strong>Memories:</strong> This handy feature allows you to automatically store important information you recieve, which could help you later if you need it.</p>\n<p><strong>Up to three different ways to solve the case: </strong>Uncover the truth behind the cases in up to three different ways, each one with it's own logic train and reasoning.</p>\n<p><strong>Who done it?: </strong>Each chapter, you'll end up having to apply all your logical skills to pinpoint the culprit, but there's a twist to this...</p>\n\r\nHowever!\r\n<p>Keep in mind that this is just the prologue of the visual novel, and as such, it's meant to be an introduction. This means that the difficulty of this case will be very low, and most of the features won't be applied. This means that you can relax and enjoy (hopefully) the beggining of this story, and familiarize with Doce's main cast.</p>\n\r\nFAQ\r\n<p><strong>Is this your first release? </strong>It depends on what you mean with release, but if you mean that if this is my first time doing something from nothing, yes, and I feel very happy with the result.<br/></p>\n<p><strong>Hm, even so, I think you could improve some stuff. </strong>So do I! That's why I'm always open to any type of criticism. In fact, if you want to directly tell me stuff, you can always contact me via Discord (TSS~Danny#2610). <br/></p>\n<p><strong>Will this specific release get updates? </strong>Yes it will as I see fit. It might be just some bugfixes or it may be a complete art revamp based on feedback, so everything you say does matter! </p>\n<p><strong>Do you intend on reaching some kind of milestone before working on the full release? </strong>No, of course not. This is my first game and I completely intend it to be something I can use to learn from it. However, if you want to help me by donating, I more than welcome it. If you do, contact me via Discord.</p>\n<p><strong>Who worked on this visual novel? </strong>Me, NNDanny, and the artist, K.C. Chi (Discord: Chi#2113) are the only people who actively worked on this visual novel. As for the music, all credit goes to MusMus (MusMus main page (Japanese)), and the backgrounds were made by Uncle Mugen (Original post containing the assets used).</p>\n<p><strong>Will the final release be free as well? </strong>Sadly, no. I'm going to invest a lot of time, and the artist (or artists in plural) are going to make a big effort to bring the best out of this project. BUT, if you expect me to ask you more than 5$, that's not going to be true. <br/></p>\n<p><strong>What can I do to support this project? </strong>Several things, actually! Share it with some friends of yours, comment and leave some feedback, or you can even donate (Patreon) if you want to! Any money gained this way will be used to further improve the quality of this project.  (To donate via PayPal, contact me via Discord)<br/></p>\n\n<p>I'll update this FAQ with more to come questions any of you may have, so, if you want to ask something, just do<br/></p>", "metacritic": null, "released": "2018-10-14", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/014/01473e4644c1a4dce5a2b3e89ff93e43.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 68, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["NNDanny"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}