{"id": 25414, "slug": "super-smash-bros-brawl", "name": "Super Smash Bros. Brawl", "name_original": "Super Smash Bros. Brawl", "description": "<p>Super Smash Bros. Brawl is a crossover platform fighting game for the Nintendo Wii published by Nintendo in 2008 and the third entry in the Super Smash Bros. series. It was developed by an ad hoc development team consisting of staff from Sora Ltd, GAME ARTS, Monolith Soft, HAL Laboratory and Paon.</p>\n<p>Like the two precedent instalments, the game features characters, locations and items from various Nintendo video game franchises such as Mario, The Legend of Zelda or Kirby. However, Brawl is the first game to include characters from third-party franchises, such as Sonic the Hedgehog or Solid Snake from the Metal Gear series. </p>\n<p>The Smash Bros. series is notable among fighting games for its unorthodox gameplay. A game takes place on a stage that could be compared to a platform game level. Instead of a health bar, damage is represented by a percentage. When a player hits another, the victim&#39;s percentage increases. The higher the percentage, the further a player will be knocked away when hit. The goal is to knock other players out of the screen using a varied set of moves. Two to four players can fight at the same time, either in a free-for-all match or a team battle. Special rulesets also allow for different win conditions.</p>\n<p>Items randomly appear around the stage and can be picked up and used by fighters to aid in combat. These include food that heals the user, various weapons such as laser swords or firework launchers, or even Pokéballs containing powerful Pokémon. Brawl also introduces Assist Trophies, items that allow one to summon characters from various franchises to fight for them temporarily, as well as Smash Balls, which, when broken, allow a fighter to unleash their ultimate attack on their opponents. The game also supports custom rulesets, allowing players to disable items if they wish.</p>\n<p>Brawl is the first game in the series to include a complete single-player story campaign, named the Subspace Emissary. It features all the playable characters in the midst of a conflict against a mysterious entity looking to collect pieces of their world for an unknown reason. The player fights hoards of enemies throughout a multitude of platforming levels. It was also the first game to allow online play with friends or random players. This feature is no longer available due to the discontinuation of the Wii&#39;s online service in May 2014</p>\n<p>Super Smash Bros. Brawl was praised by the critic for its fun and easy to learn gameplay, its sheer density and the attention put into the representation of its featured franchises. However, it left many fans of the series, particularly its competitive aspect, disappointed. The changes made to the gameplay from Melee considerably slowed the pace of the game and severe balance issues existed, which resulted in the game&#39;s competitive scene becoming inactive early in its life. To fix these issues, players resorted to modding. Among the various mods that were created was Project M, a mod that, at first, aimed to make Brawl feel more like its predecessor Melee, and later grew to become much more distinct from any game in the series. Project M gathered a decently sized competitive scene to the point where it was played at major tournaments along with the official games, but its development eventually shut down in 2015.</p>\n<p>Despite this, Brawl is the eight best-selling game on the Wii, having sold 13.29 million units as of March 2018. It is often considered to be the best Smash Bros. game for casual play or single-player.</p>", "metacritic": 93, "released": "2008-03-09", "tba": false, "updated": "2024-03-26T12:31:05", "background_image": "https://media.rawg.io/media/games/a00/a00c19dae42d87ca31d903d26761d335.jpg", "website": "http://www.smashbros.com/en_us/index.html", "rating": 4.3, "rating_top": 4, "added_by_status": {"yet": 15, "owned": 115, "beaten": 338, "toplay": 24, "dropped": 104, "playing": 6}, "playtime": 24, "achievements_count": 0, "ratings_count": 301, "suggestions_count": 228, "game_series_count": 5, "reviews_count": 306, "platforms": ["Wii"], "developers": ["Intelligent Systems", "HAL Laboratory", "Sora", "Monolith Soft", "Paon", "GAME ARTS"], "genres": ["Action", "Casual", "Fighting"], "publishers": ["Nintendo"], "esrb_rating": "Teen"}