{"id": 254133, "slug": "carnivalism", "name": "Carnivalism", "name_original": "Carnivalism", "description": "<p>Titel: Carnivalism<br/>Genre: Simulation<br/>Entwickler: Andy Schüler<br/>Engine: Unity3d<br/><br/>Story:<br/>Während deines Partyrauschs hast du alles um dich herum vergessen. Raum und Zeit sind nur noch randomisierte Zahlen für dich, erlebst aber die schönsten Momente, was das Leben zu bieten hat. <br/><br/>Langsam - nach 72 Stunden - erwachst du. Deine klebrigen Augen öffnen sich und du siehst... du siehst ein rotes Auto. Es könnte deins sein, aber sicher bist du dir nicht. Es hat ein paar Kratzer, Tennisballgroße Löcher in der Windschutzscheibe und keine Türen mehr. Du läufst zu dem Auto und setzt dich langsam hin... Du scheinst noch etwas verunsichert, weil sich die Welt noch etwas dreht. Der Autoschlüssel wurde stecken gelassen.<br/></p>\n<p>Bevor du losfährst, drehst du dich noch einmal zur Rückbank um. Vielleicht findest du Hinweise darauf, was genau passiert ist. Du entdeckst Polaroidfotos. 20 Stück. Jedes Foto zeigt 1 Person, die dir bekannt vorkommt. Alles sehr merkwürdig...</p>\n<p>Es fühlt sich alles so leer in dir an. Du hast kein Hunger, kein Durst und Schlafen willst du auch nicht. \"Was mach ich´n jetzt?\" ... Nachdem du 20 Minuten ins Nichts geschaut hast, triffst du eine Entscheidung. \"Ich könnt´ die Leute such´n!\".<br/></p>\n<p>Gesagt, getan. Du drehst entschlossen den Schlüssel rum und düst in die nächste Stadt, in der Hoffnung, dass dort jemand zu finden ist, der auf einem der Fotos zu sehen ist.<br/></p>\n<p>Der Rest liegt bei dir.</p>\n\n<p>Steuerung:<br/>Klicke mit deinem Finger oder Maus auf eine Hauptstadt, um dich und deine Gefolgsleute dort hinzubewegen.<br/><br/>Ingame:<br/>Grüne Städte bieten dir Möglichkeiten einzukaufen, um deine Leute bei Laune zu halten. <br/>Nur wenn alle Werte positiv sind, wirst du Freunde suchen können.<br/><br/>Spielziel:<br/>Wenn du 20 Freunde gefunden hast, ist das Spiel gewonnen.<br/>Sobald dein Geld auf -1000 € gesunken ist, verlierst du.<br/><br/><br/>Notiz:<br/>Freunde suchen: Die einzigste Möglichkeit, das Spiel zu gewinnen<br/>Krankenhaus: Setzt deine Gesundheit auf 100<br/>Suppenküche: Setzt dein Hunger und Trinken auf 100<br/>Tagesjob: Bringt 100 € Geld<br/>Geld leihen: Setzt deine Zinsen auf 0 und erhöht dementsprechend dein Geld<br/>Geld anlegen: Geld -10, Zinsen +10<br/><br/>Die Freunde haben alle Zufallswerte, was das Spiel entweder mittel, schwer, brutal schwer oder verdammt schwer macht... Du wirst keine Möglichkeit haben (in dieser Version) irgendetwas daran zu ändern, außer es einfach immer wieder neu zu probieren ^.^<br/><br/>Viel Spaß<br/>PS: Das Projekt wird weiterentwickelt, wenn es genügend Zuspruch bekommt.</p>", "metacritic": null, "released": "2018-10-14", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/f87/f87e541fdab4df7fcc908fcba420b350.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 32, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Android"], "developers": ["Bärchen-Studios"], "genres": ["RPG", "Simulation"], "publishers": [], "esrb_rating": null}