{"id": 254100, "slug": "funfair-nightmare", "name": "Funfair Nightmare", "name_original": "Funfair Nightmare", "description": "<p>Funfair Nightmare is an small point and click adventure about a blues musican on a fairfun. Backed with an graet art, the pixel-adventure cotrasts in a small story of dilemma and blues.</p>\n<p>Insruktions: Left Mouse = Move/Confirm; Right Mouse = Actionwheel<br/></p>\n\n<p>Funfair Nightmare ist ein kleine Point and Click Adventure über einen Blues-Musiker auf einem Jahrmarkt. Hinterlegt mit einem großartigen Kunstwerk, kontrastiert das Pixel-Abenteuer eine kleine Geschichte von Dilemma und Blues. <br/></p>\n<p>Steuerung: Linke Maus = Bewegen/Bestätigen; Reche Maus = Aktionsrad</p>\n\n<p>Important!/Wichtig!</p>\n<p>This game is totaly unfinisched. It's looks cool, you can do a bit and can see a basic, but we got to mutch problems at the implementation with our System. But the game dont work that mutch after we export the game out of unity, but you can start in editor. :D  Maby we finish the game in a few days, but thats out of the rate of the Jam.</p>\n<p>Dieses Spiel ist komplett unfertig. Es sieht cool aus, man kann einiges machen und kann eine Basis erkennen, aber wir haben zu viele Probleme bei der Implementierung mit unserem System bekommen. Aber leider klappt das spiel nach der Exportierung nicht mehr so ganz, aber im editor kann man es starten. :D  Villeicht beenden wir das Spiel die Tage, aber das wird dann außerhalb der Jambewertung stattfinden.</p>\n\n<p>If someone want to use anything out of the game, your wellcome. (Or fix it ;D)<br/></p>\n<p>Wenn jemand irgendwas aus dem Spiel benutzen möchte, fühl dich frei. (Oder reparier es ;D)<br/></p>", "metacritic": null, "released": "2018-10-14", "tba": false, "updated": "2019-08-28T23:19:59", "background_image": "https://media.rawg.io/media/screenshots/50f/50fc832f580ec23cdbd6e83e54f00598.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 2, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Psychopraktica"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}