{"id": 254209, "slug": "the-valley-of-ashe", "name": "The Valley of Ashe", "name_original": "The Valley of Ashe", "description": "<p>“The Valley of Ashe has seen an increase in the number of monsters lately. Valen, a ranger from the town of Ashe, hunts and gathers for the town’s survival. Although he is known as “The Lone Wolf”, his fiery sister Sylvyth insists on helping him gather food for the coming winter. The Village of Ashe may be on the brink of starvation, but Valen swears to the Faeries to only take what they need to survive. Both he and the Faeries understand that the balance must be kept…</p>\n<p>After finding out that the invading horde is led by a certain Lord Tyrak and the recent monster attacks are an effort to starve out the town of Ashe, Valen and Sylvyth volunteer to leave the valley and seek out allies as well as gather any other information they can find about Lord Tyrak and why he wishes to invade the Valley of Ashe.</p>\n<p>Upon their return, Valen and Sylvyth find the King of Ashe has passed away, and a new king has been installed. The new king does not believe in the balance Valen seeks and tensions mount. After tragedy strikes, how will Valen set the wrong deeds right? Will he learn to lead, instead of always being “The Lone Wolf”? Will Lord Tyrak triumph over the people of the Valley?</p>\n<p>We invite you to take this journey and help Valen become the hero he is destined to be. With 6-8 hours of DEMO gameplay, multiple characters and realms to visit, we watch our Lone Wolf become a hero, leader, and lord of his own kingdom to help take back the Valley of Ashe and restore balance to the kingdom. Progressive re-building of your own kingdom, rich environments and storyline, with concept/conflicts that are not just a recycled story you are used to! Each class has unique skills and abilities to differentiate combat style and tactics. <strong>True Active-Time Battle</strong> with the ability to <strong>combine skills</strong>, similar to classic favorite - <strong>Chrono Trigger. </strong>Difficulty increases as your skills become more diverse, first allowing you more options to defeat enemies, then requiring you to be creative in how you handle your skills in order to succeed!”</p>", "metacritic": null, "released": "2018-10-14", "tba": false, "updated": "2019-08-28T23:19:58", "background_image": "https://media.rawg.io/media/screenshots/bc8/bc813581eddcf55a9b236221bc030aa9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 250, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["tome571"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}