{"id": 254200, "slug": "boxi", "name": "Boxi", "name_original": "Boxi", "description": "<p>Boxi is a cute and colourful platform game fuelled by a community of gamers and developers. Members of our community tell us what kind of content they want to see in the game, and our team collect these ideas and discuss them to see which ones would gel together in a satisfying way.</p>\n<p>Boxi is a creature made of cardboard living in a world of robots. Being the only one of their kind, our hero suffers from an inferiority complex, jealous of how advanced the robots are in comparison.</p>\n<p>Boxi sets out on an adventure to upgrade their body so that they can fit in with the other inhabitants of the world. Along the way, Boxi discovers they have access to abilities and powers the robots can’t use. These unique abilities boost Boxi’s confidence and show them realise being different isn’t a bad thing.</p>\n<p>As the player progresses through the game, Boxi will obtain upgrades that will overcome obstacles in upcoming levels and unlock previously unreachable areas in previous zones.</p>\n<p>RC Car – Areas too small for Boxi to enter are perfect for the remote-control car. Take control of Boxi’s favourite vehicle and drive around through small tunnels and gaps, who knows what you might find lurking.</p>\n<p>Bounce – Boxi can only jump so high, good thing you can throw down a bounce pad to spring yourself higher than usual to get to those hard to reach places.</p>\n<p>Grapple – Some areas aren’t safe enough for a Bounce, good thing you found that grapple hook to fly across those extra wide gaps.</p>\n<p>Freeze – Boxi can’t go into water! But luckily you can freeze the surface of the wet stuff to cross safely.</p>\n<p>There are more powers planned, but for the demo we have created an area that utilises the powers above.</p>", "metacritic": null, "released": "2018-10-14", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/94c/94c0481ace50b1049d1ae4ddebfe24df.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 8, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["IntergalacticSandwich"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}