{"id": 254311, "slug": "majestic-12-itch", "name": "Majestic-12 (itch)", "name_original": "Majestic-12 (itch)", "description": "<p>Majestic-12 is a 3d action side-scroller where you take control of an elite MJ-12 commando and battle your way through secret installations and strange alien environments with your friends. Mj12 has a retro vibe mixed with an exciting visual style and original game mechanics that will leave the player very satisfied. The game mixes humorous enemies with action-packed gameplay in single player, and several innovative multiplayer modes.<br/></p>\n<p><strong>What is it like?\r\n</strong></p>\n<p>Imagine if you took castle Crashers, mixed it with contra, and then made it 10x more stupid... oh yea, and bear tanks controlled by alien heads in a jar.<br/><strong>Features:</strong></p>\n<p>• Local co-op modes for 4 players<br/>• 40 in-game Achievements<br/>• Exciting combat and movement mechanics seldom explored in side-scrollers<br/>• Enjoyable arcade style campaign mode <br/>• Survival mode for 4 players<br/>• Easy to pick up, hard to master.<br/>• Versus Combat mode for 4 players<br/>• Drop-in / Drop-out multi-player<br/>• 3d play field / depth - effects gameplay<br/>• Spaceship combat side-scroller levels</p>\n<p><strong>Press Coverage:</strong></p>\n<p>http://www.xblafans.com/pax-east-majestic-12-preview-44695.html</p>\r\nOriginally posted by <strong>XBLA FANS</strong>: \"I urge you to check this one out when it does make its way to the PC Market, I had a lot of fun demoing this one, I can't wait to see more.\" \r\n<p>http://www.cinemablend.com/games/Majestic-12-Four-Player-Side-Scrolling-Shooting-Game-Announced-40941.html</p>\r\nOriginally posted by <strong>CinemaBlend</strong>: \"Actually, I can't wait to get my hands on this game. It seems pretty awesome and I've always enjoyed the nostalgic feel.\"\r\n<p><strong>Gamers Haven:</strong><br/></p>\r\nOriginally posted by <strong>Gamers Haven</strong>: \"To be honest I loved my time with this game while on the show floor. It was a great experience playing with multiple people and wrecking everything in our path from boxes and small enemies to the giant bosses (bear on a bulldozer). \r\n<p><strong>Pikimal:</strong></p>\r\nOriginally posted by <strong>Pikimal</strong>: \"Majestic-12 is a zany dual stick style shooter…It essentially plays like a love letter to the arcade days long gone...If you've got a group of friends that love old-school arcade shooters, Majestic-12 would definitely be a title worth looking into.\"", "metacritic": null, "released": "2018-09-28", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/5ae/5ae6fabc225fc4875433c9f94db50e18.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 469, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Exis games"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}