{"id": 254388, "slug": "cleaver", "name": "Cleaver", "name_original": "Cleaver", "description": "<p>Jogo criado por:</p>\n<ul><li>Fabrizio Issaca Juliati (fabriziojuli@gmail.com)</li><li>Thales Igor Poletti (thales_igor@yahoo.com.br)</li></ul>\n<p>Turma de 2018/1 do CST em Jogos Digitais da Faculdade Impacta.</p>\n<p>Cleaver é um game com conteúdo educativo que serve como demonstração de uma futura ação humana plausível na vida real. O jogador verá um processo de produção de alimentos que não condiz com a realidade, é uma produção simplificada e lúdica para contextualizar.</p>\n<p>Com poucos níveis, Cleaver faz uma inversão de papéis entre animais e humanos em uma indústria alimentícia. Faz uso de referências atuais e mantém o foco em estilos gráficos e mecânicas simples. Com base em mecânicas de arrastar objetos e subir em superfícies, além de uma tensão constante por precisar da paciência, atenção e furtividade do player.<br/></p>\n<p>Sem mecanismo de combate, o jogador precisa evitar ser visto e escolher lugares arriscados para não ser pego pelos operários da indústria. Faz parte do gênero Ação Plataforma 3D, com um visual sombrio, iluminação parcial e ênfase em sound effects com poucas trilhas sonoras.</p>\n<p>Cleaver é desenvolvido para PC (Windows) visando um público majoritariamente masculino de 28 a 40 anos.</p>", "metacritic": null, "released": "2018-10-12", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/3e1/3e1891f9d8005416aecba28a99eed7d8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 56, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Jogos Digitais - Faculdade Impacta"], "genres": ["Action"], "publishers": [], "esrb_rating": null}