{"id": 2543, "slug": "activision-anthology", "name": "Activision Anthology", "name_original": "Activision Anthology", "description": "Download Activision® Anthology to receive the classic hit KABOOM!™ for FREE, and collect up to 45 classic Activision® and Imagic games!<br/><br/>Pitfall!™, Kaboom!™, River Raid™ — everyone remembers these great Activision games on the 2600 console. Now, for the first time ever on your iPad, iPhone and iPod Touch, relive these classics and experience the phenomenon that started the video-game revolution. This one-of-a-kind compilation offers the entire Activision 2600 catalog in one app, with controls designed and optimized for each game. Each game is presented alongside the original box art and manuals for retro lovers, and features Game Center support and the ability to earn digital versions of the famous game patches!<br/><br/>FEATURES:<br/>• Get the action classic KABOOM! for FREE <br/>• Access to 45 classic Activision and Imagic games including PITFALL, RIVER RAID, THE ACTIVISION® DECATHLON, BARNSTORMING™, STAMPEDE™, PITFALL II, ENDURO™, DEMON ATTACK, and many more!<br/>• Choose from multiple control schemes to play as you like to play<br/>• Enjoy full Game Center integration including leaderboards and achievements!<br/>• Earn digital versions of the renowned Activision game patches offered in the 1980&amp;#39;s<br/>• Features original cartridge and box art, original game manuals, tips and strategies from the original game designers, and more<br/>• In-app game purchases unlock across devices associated with the player&amp;#39;s account<br/>• Taunt your friends by showing off your high scores on Facebook<br/>• Compatible with the iCade© gaming cabinet!<br/>• Buy once, play any time!<br/><br/>Complete your collection and keep these classic retro games alive for generations to come. Purchase four additional bundle packs with 11 games each at $2.99 or collect all 45 games for a special limited-time introductory price of only $6.99. We hope you enjoy them as much as we do.<br/><br/>-Your Friends at Activision<br/><br/>", "metacritic": null, "released": "2012-08-30", "tba": false, "updated": "2019-10-22T14:28:06", "background_image": "https://media.rawg.io/media/screenshots/c43/c43562dbeee2418ebe26be1b2978f1be.jpeg", "website": "http://www.facebook.com/ActivisionAnthology", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 136, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Activision"], "genres": ["Arcade", "Family"], "publishers": ["Activision Blizzard"], "esrb_rating": "Everyone 10+"}