{"id": 254477, "slug": "real-assassin-ninja-warrior-hero-battle-fight", "name": "Real Assassin Ninja Warrior Hero - Battle Fight", "name_original": "Real Assassin Ninja Warrior Hero - Battle Fight", "description": "<p>Become a Real Assassin Ninja Warrior Hero and take revenge from enemy ninja warrior with your shuriken, classic samurai sword, bow and arrows and with your super martial art skills. Fight like a true warrior ninja assassin and show fighting skills like deadly ninja samurai fighters. Be the legendary ninja and defeat all strange shadow enemy fighters by showing your amazing ninja fighting and survival skills.  Collect different items like the treasure chest, shuriken, bow and arrows, prison cell keys while fighting in this real assassin ninja fighting game.</p>\n<p>Sneak up enemy ninjas with stealth techniques, and act like a real ninja samurai warrior. Challenge enemy ninjas for combat fight and finish them all. Realistic ninja action fight in the gangster town for ninja survival fight. Rescue innocent humans in the city from corrupt and evil ninja warrior. Your mission is to survival fights and act like a real assassin ninja warrior hero in this kung fu battle fight. Be the real warrior ninja assassin superhero and shadow enemy fighter. You as a superhero ninja warrior are the last and only hope for them to get back to their life as they were. Real assassin ninja warrior hero – Battle fight is the perfect and only choice for ninja fighting games lovers.</p>\n<p>Features of Real Assassin Ninja Warrior Hero - Battle Fight:<br/>* Realistic 3D Ninja Castle.<br/>* New Shuriken throws the fight.<br/>* Ninja Sword fights.<br/>* Fistfight combos and batons.<br/>* Smooth game play.<br/>* Fun and Exciting levels.<br/>* Realistic &amp; High-Quality 3D Graphics<br/>* Amazing Weapons and swords.</p>\n<p>In Real Assassin Ninja Warrior Hero – Battle Fight Game samurai fighters, fight for the survival in an extremely intense situation. Perform real combat fighting skills and fight for your survival in ninja assassin game. Finish shadow enemy fighters, knights and soldiers of the dungeon cell. Try different fighting styles including Taekwondo, Muay Thai, Kung Fu, and Boxing and enjoy being a real ninja assassin warrior game. Your mission is to fight like a super hero ninja against kingdom soldiers around dungeon castle.</p>", "metacritic": null, "released": "2018-10-12", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/543/543bfc3b048f2108291e0ad983c24d59.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 532, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Apex Logics"], "genres": ["Action", "Fighting"], "publishers": [], "esrb_rating": null}