{"id": 2545, "slug": "beben-iii", "name": "Beben III", "name_original": "Beben III", "description": "Beben III is a fast, brutal online First Person Shooter, featuring the old &amp;quot;kill or be killed&amp;quot; gameplay style from classic FPS games like Quake 3, QuakeLive and Unreal tournament. <br/><br/>Test your skills against the deadliest arena soldiers, across the diverse deadly fighting grounds in the Arena. Earn the title of Arena Legend. <br/><br/>Supported games: Open Arena, Quake 3 Shareware, Quake 3 Arena (needs original game files, read more on http://mac-and-i.net )<br/><br/>Supported game modes: Deathmatch, Team-Deathmatch and Capture the Flag. <br/><br/>These classic, proven game modes outshine popular FPS shooters with their real skill requirements instead of relying on gimmicks like killing streaks and game unbalancing perks. Try this fast, competitive online FPS, <br/><br/>Features (using Open Arena game files):<br/><br/>- Play against others in servers up to 32 players in the different game modes. Online or local network!<br/><br/>- Over 20 arenas to test your skills in the different game modes.<br/><br/>- Diverse weapon arsenal, including machineguns, shotguns, and rocket and grenade launchers.<br/><br/>- Singleplayer mode. Test your skills offline against bots in the Arena mode, with 5 difficulty modes.<br/><br/><br/>Based on ioquake project&amp;#39;s source code and licensed under GNU GPL v2. <br/><br/>In accordance with GPL v2, the source code is available upon request.", "metacritic": null, "released": "2013-12-19", "tba": false, "updated": "2019-10-22T13:57:15", "background_image": "https://media.rawg.io/media/screenshots/434/43415b2829e02c815a3613de1923cffd.jpeg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 163, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Ronny Stiftel"], "genres": ["Action", "Arcade"], "publishers": ["Ronny Stiftel"], "esrb_rating": "Mature"}