{"id": 254587, "slug": "galaxity-beta", "name": "Galaxity Beta", "name_original": "Galaxity Beta", "description": "<strong>This is a wonderful Virtual City!</strong><br/><br/>You can join virtual cities with any VR device. (Even it is also possible with Mobile VR and Standalone). You can enjoy the fantastic VR life by connecting to the network anytime, anywhere. There are various mini games such as soccer, baseball, survival and so on that you can enjoy with your friends for you. You can also change your costume and enjoy a night party with colorful fireworks. It's also possible to watch a great movie with a loved one, and all of this is free!Sign in with FacebookDo you have your Facebook account? When you connect to a virtual city with your Facebook account, your data will be stored and you can change your VR device at will.Create your avatarWe have developed a variety of hair, skin, clothing and color options for you. Show your creativity to friends in the virtual world.Talk to people and make friendsWe provide voice chat. You can talk to people through your voice. If you can not communicate with each other in different languages, use various emotional options. And you can register people as friends.Play various mini gamesWe offer you a variety of mini-games, and it will continue to be updated. First of all, there are soccer, baseball, two survival modes and crossing high-pipe. Have fun with your friends.Visit the theaterYou can create your own movie theater for your friends to play and watch on YouTube. Now, prepare popcorn and pizza.EtcThe more actions you take in a virtual city, the more money you can collect. With that money, buy a nice costume from the store and show it to your friends. You can buy firecrackers and play, or change hair color or skin color with special items. The various missions we have developed will make your virtual world life even more fantastic.Beta testing servicesWe start an open beta test to make a better city. This space will be open until November 30, 2018. (But if people want longer, it can change)", "metacritic": null, "released": "2018-11-05", "tba": false, "updated": "2019-08-23T12:11:27", "background_image": "https://media.rawg.io/media/screenshots/1e6/1e6e8b6f2f7c67e4954b6dd99d7b310b.jpg", "website": "https://www.galaxity.net", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 118, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MAMMOSSIX Co"], "genres": ["Casual", "Indie"], "publishers": ["MAMMOSSIX Co"], "esrb_rating": null}