{"id": 254559, "slug": "zombie-bitcoin-defense", "name": "Zombie Bitcoin Defense", "name_original": "Zombie Bitcoin Defense", "description": "<p>Zombie Bitcoin Defense is an action packed top down shooter about surviving the zombie apocalypse with a shop full of weapons and a Bitcoin miner. Test your skills against the onslaught as one of the few remaining humans on earth and build your base to last, because the horde will stop at nothing in this ruthless battle to the end. Will you survive, or perish like the rest?4 Player Multiplayer Co-op!<br />\nEnlist the help of friends and take on the infected with up to four players in multiplayer co-op. Play with friends, or strangers, and vote to start waves sooner.The Infected45 Waves 5 Zombie Types 4 Unique BossesMultiplayer Scaled WavesWeaponsFrom pistols to SMG&#39;s, shotguns to sniper rifles; mow down the hordes of infected with your choice of over 20 weapons, including assault rifles and rocket launchers. Don&#39;t forget to set a few claymores for good measure.The ShopAccess the shop between waves. Purchase much needed ammo, weapons and barricades to help survive the night. For the right price, you can even buy a turret. This is also where access to the Bitcoin miner and Skill Tree can be found.Power-Ups<br />\nAs if you needed any more reason to kill zombies, each mob has a chance to drop a unique power up to help you clear the wave. But grab them quickly, as they won&#39;t last for long.The MinerUpgrade the Bitcoin miner to generate passive income each wave. Be careful to balance miner upgrades with weapon purchases, because income isn&#39;t worth anything to a dead man.The Skill TreeEarn experience with every kill and take it with you when you die. Its just like riding a bike, right? Keep earned skill points that transfer between games and use them on the 37 point skill tree to unlock perks and weapons along the way.Base Building<br />\nNo one ever survived the zombie apocalypse standing out in the open. Purchase barricades and turrets at the shop between waves and build your base however you like. Don&#39;t forget to upgrade both your barricades and your turrets or else, just like you, they won&#39;t survive very long.DisclaimerNo real Bitcoin, the cryptocurrency, is used, traded, or mined in the operation of this game. Funds are safu.</p>", "metacritic": null, "released": "2018-11-02", "tba": false, "updated": "2019-08-28T21:52:17", "background_image": "https://media.rawg.io/media/screenshots/273/273724b9a8cff7cb458e25e08b141b7c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 79}, "playtime": 4, "achievements_count": 9, "ratings_count": 2, "suggestions_count": 305, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["NOHAM Games"], "genres": ["Action"], "publishers": ["NOHAM Games"], "esrb_rating": null}