{"id": 254578, "slug": "deadliest-catch-the-game", "name": "Deadliest Catch: The Game", "name_original": "Deadliest Catch: The Game", "description": "<p>Hey, you! Yes, you! Do you want to be a landlubber your whole life? Or maybe you dream of making a fortune, sailing dangerous seas and learning the secrets of king crab catchers? Are you not afraid of risk, storms and crab claws? If you are brave enough, come with me to Dutch Harbor!<br />\nFor a few days every year, experienced crab catchers and greenhorns brave the elements side by side, putting their health and life on the line. The goal is to earn a fortune and become known as the best crab catcher. Now you can become one of them!<br />\nIn Deadliest Catch: The Game you will compete with dangerous sea rallies to catch more crabs than you ever thought possible. The task is not simple – it is a battle against time, fishing quotas, crab migrations, and most importantly: the sea. Such is your underwater fate.<br />\nYour ship is no different from those that sail from Dutch Harbor every fall to seek a fortune in the marine abyss. You will conn your vessel in all conditions: breeze or gale, no storm can scare you, however terrifying it may look. The troubled sea, the soaked ship deck, the vessel floating on the waves - and you to overcome it all!<br />\nAt your disposal we leave not only this fishing vessel, but also all the onboard equipment - the crane, the winch, the launcher, and the coiling system. We will teach you to use them, step by step. Remember, no-one was born with the rudder - or a crab - in their hand. However, you will manage the vessel by yourself - as captain and fisherman at the same time. All devices are handled by you in first-person mode to have the best view of everything happening on your boat. You will also get original crab pots - thanks to them you will be able to pick out all the crabs from the vastness of Bering Sea.<br />\nRemember that you must follow Alaskan law. Not all crabs can be caught and sold! A realistic 3D model will help you judge whether you have caught a handsome and expensive male, a protected female, or a baby. Analyze the water and seabed to better predict where crabs may be found.<br />\nNature will not be your only opponent. Match your skills against the computer and other players! Invite your friends to compete for the title of the best crab catcher. Load your pots on board, sit at the controls of your ship and see which one of you is the fastest and most effective in catching your crab fortune from the bottom of the sea!</p>", "metacritic": null, "released": "2020-04-14", "tba": false, "updated": "2020-11-16T15:28:59", "background_image": "https://media.rawg.io/media/games/fa6/fa60ed04e412d8f0cff842a141784007.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 44, "toplay": 1, "dropped": 1}, "playtime": 3, "achievements_count": 23, "ratings_count": 2, "suggestions_count": 212, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Ultimate Games", "Moonlit"], "genres": ["Action", "Simulation", "Indie"], "publishers": ["PlayWay", "Ultimate Games"], "esrb_rating": null}