{"id": 254652, "slug": "apsulov-end-of-gods", "name": "Apsulov: End of Gods", "name_original": "Apsulov: End of Gods", "description": "<p>Far beneath the earth lies a place built in one man’s search for answers, control, and the mercy of the Gods. But as he delved deeper he found something buried, something locked away, to never again reach the surface of the nine realms of Yggdrasil. Something that now resides in Midgard, the human world, where it re-makes and exploits human technology to suit it’s own goals to leave nothing but destruction and misery behind.<br />\nIn this world of human technology and mythological artifacts, chaos rules over the realm of man. It is in this chaos you find your purpose and destiny.<br />\nYou awake in a sanctuary of steel and concrete, built to honor the Nordic Gods and to house an artifact, buried in the earth aeons ago.<br />\nUnveil the secrets of the inhabitants, the artifact, and the nine realms of Yggdrasil in Apsulov: End of Gods.<br />\nImmerse yourself in this Future Viking Horror-Adventure containing:<br />\nNordic Mythology and Science-fiction<br />\nImmersive environments<br />\nAtmospheric sound and music<br />\nA range of mechanics to aid you on your journey<br />\nImportant notice: This game is in production. Languages, functions etc will be added to the page when it’s implemented in the game.</p>", "metacritic": 71, "released": "2019-08-08", "tba": false, "updated": "2024-04-09T04:10:01", "background_image": "https://media.rawg.io/media/screenshots/65e/65ea0434536e4431c39625c9212b7004.jpg", "website": "", "rating": 3.57, "rating_top": 4, "added_by_status": {"yet": 25, "owned": 179, "beaten": 24, "toplay": 21, "dropped": 6}, "playtime": 4, "achievements_count": 117, "ratings_count": 30, "suggestions_count": 375, "game_series_count": 0, "reviews_count": 30, "platforms": ["PlayStation 4", "PlayStation 5", "PC", "Xbox One"], "developers": ["Angry Demon Studio"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Angry Demon Studio"], "esrb_rating": null}