{"id": 254641, "slug": "heart-chain-kitty", "name": "Heart Chain Kitty", "name_original": "Heart Chain Kitty", "description": "A stranger has arrived on Kitty Island. A heart-shaped stranger. Not only is he riding a whale, he also brings very personal news for Kittey. As he sets out on a quest to find his parents, Kittey has to face what remains of a world nearing its end. From Kitty Island to the City of Cyclopia with its weird enslaved citizens through a huge comet-struck desert into the deepest pits of Darkside, Kittey's big journey may lead to some uncomfortable truths.<br/><br/>But, remember: Even if the walls of reality are crumbling and it's becoming hard to tell dreams from reality, Everything Will Be Fine. Just keep collecting those strange Power Hearts that litter the world. It's Always Been That Way. If you get enough of those, you'll surely win! Right?<br/><br/>The Game<br/><br/>Heart Chain Kitty is a big 3d platform adventure with a few twists. There's a chance you'll like it if you've enjoyed collect-a-thons like Banjo Kazooie or Mario Sunshine but want a bit more added to the formula. This is a continuation of my freeware game series 'A Game with a Kitty'.<br/><br/>The game features inventory items that can be used to interact with the world or its inhabitants. There also are optional quests and hidden levels. The way forward isn't always going to be collecting this game's version of McGuffins. But it'll probably help if you collect them. Nothing wrong with that!<br/><br/>Kittey can jump quite well, but he'll get additional moves quickly. There's the Hat Glide, the Power Glove (good for punching people in the face) and its Screw Ray (tm) upgrade, giving you a way to dominate screws and bolts all over the world. Later on you'll ride bottle rockets and do tricks high up in the sky using the zoom ability.<br/><br/>Don't forget to buy some strength-enhancing cakes from your nerd bro. And maybe some of Darling's life hearts. You'll need 'em!Some Features Neatly Arranged in a List<br/><br/><ul><li>Self-generating Voxel World<br/></li><li>Maps (level/overall)<br/></li><li>Steam Cloud Saving<br/></li><li>A chubby Kitty as a protagonist<br/></li><li>Hippos<br/></li><li>Two secret Bosses &amp; optional levels and challenges<br/></li><li>Quests<br/></li><li>A Robot Mom<br/></li><li>Nerds (plural because there's more than one)<br/></li><li>2.5d Levels - hidden 2d levels in a 3d platformer<br/></li><li>Two endings (and one non-ending)</li></ul><br/>Wow!", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:52:09", "background_image": "https://media.rawg.io/media/screenshots/931/9313c9ada4668437c54c39828a812fcb.jpg", "website": "http://www.origamihero.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 447, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["origamihero games"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["origamihero games"], "esrb_rating": null}