{"id": 254607, "slug": "angel-devil-elf-and-me", "name": "Angel, Devil, Elf and Me!", "name_original": "Angel, Devil, Elf and Me!", "description": "Ayumu is just your average bachelor until out of nowhere three gorgeous women from a fantasy world burst through a portal into his living room. It turns out our 'normal guy' Ayumu is somehow the descendant of a legendary Hero and of course, any children he has will be incredibly powerful! Join Ayumu as his everyday life is turned upside down as beautiful girls from across dimensions battle it out for his 'essence!'<br/>\n<br/>\r\nAyumu, not being the type who enjoys seeing these lovely ladies tear each other (and his house) apart, Ayumu steps in and pleads that they not fight over him so the three decide it is up to Ayumu to choose one among them to become his bride. Each of the girls try to appeal to him in their own unique way, Rizabel is a saucy succubus and princess of hell who wants to seduce Ayumu so she can have powerful children to rule over hell. Elysia, the motherly angel, wishes to marry Ayumu to prevent his overwhelming essence from falling into the wrong hands she takes a more soothing and pampering approach to win Ayumu over. Finally Hilda the leader of a clan of Dark Elves hopes to marry Ayumu so that his essence will provide her clan with many strong children, she comes off as very noble and stoic but is quite a novice when it comes to romance and her awkward attempts to woo Ayumu might just do the trick.<br/>\n<br/>\r\nCheck out the story of the unlikely descendant of a Hero who finds himself beset by beautiful brides from another world as he tries to figure out just how he is going to handle the situation he finds himself in with the three other-worldly women and lead a happy married life.<br/>\n<br/>\r\nAngel, Devil, Elf and Me! Is the localization of a Japanese Visual Novel developed by Norn, we at Cherry Kiss aim to provide this authentic Japanese visual novel experience to gamers outside of Japan.", "metacritic": null, "released": "2018-11-07", "tba": false, "updated": "2020-01-24T14:26:04", "background_image": "https://media.rawg.io/media/screenshots/04b/04be7c8a4c64aba5bae6f5dab79cf5d6.jpg", "website": "http://cherrykissgames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 7, "toplay": 1, "playing": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 329, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "PC"], "developers": ["CherryKissGames", "Norn/Miel"], "genres": ["Adventure"], "publishers": ["Cherry Kiss Games"], "esrb_rating": null}