{"id": 254627, "slug": "apollo-11-vr-hd", "name": "Apollo 11 VR HD", "name_original": "Apollo 11 VR HD", "description": "Apollo 11 VR HD is the story of the greatest journey ever taken by humankind. <br/><br/>Now you get to experience this historic event through the eyes of those who lived through it. Using a mix of original archive audio and video together with accurate recreations of the spacecraft and locations, all set to inspirational music, get set for an experience that will not only educate you but will also leave a lasting impression and deep respect for the men and women who worked on the Apollo program during NASA’s golden era.<br/><br/>Apollo 11 VR HD is a complete remake of the very popular Apollo 11 VR which was a launch title on the Oculus Rift and HTC Vive. This new version has all new assets, new textures, new animation, new lighting, revamped audio and Windows MR support. <br/><br/><strong>What to do inside Apollo 11 VR HD ?</strong><br/><br/><ul>[Take control of the command module for docking with the lunar module]</ul><ul>[Take control of the lunar module and land it on the moons surface]</ul><ul>[Explore the Apollo 11 landing site and deploy the original experiments]</ul><ul>[Explore every detail of the LM and CM at your own pace]</ul><br/>If you don't want to play the game elements you can sit back, relax and enjoy the original full experience with new demo options allowing you to pick and choose which sections to play.", "metacritic": null, "released": "2018-11-07", "tba": false, "updated": "2019-08-28T21:52:10", "background_image": "https://media.rawg.io/media/screenshots/c59/c59519b821316a5dd12ea509644c116e.jpg", "website": "http://immersivevreducation.com/apollo-11-vr/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 24, "beaten": 1, "dropped": 2}, "playtime": 1, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 413, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Immersive VR Education"], "genres": ["Adventure", "Simulation"], "publishers": ["Immersive VR Education"], "esrb_rating": null}