{"id": 254672, "slug": "roads-of-rome-new-generation-2-2", "name": "Roads of Rome: New Generation 2", "name_original": "Roads of Rome: New Generation 2", "description": "For many years, Rome prospered in peace and serenity. But dark shadows of the past ascended on distant borders. The young leader of the Vikings invaded the lands of the Empire to avenge his father. Now mature son of General Victorius, Markus, is leading the troops toward danger, and despite all the admonishments of his lover, leaves her back in Rome. Disappointed by not being able to participate in the battle, Valeria strives to prove that she too is capable of making the lives of the people of the Empire better. She seeks a new appointment for herself and together with her squad, she sets off in the rear guard with goal to restore destroyed communities and build roads on the distant frontiers of the Empire.<br/>\r\nClear up and build roads, leave gifts and offerings on the Gods' altars and help Victoria.<br/>\r\nTake up new tricky tasks and overcome dangerous challenges in Roads of Rome: New Genegaration 2, an addictive game that successfully combines strategy and time management features!<br/>\n<br/>\r\nGame features:<br/>\r\n - 40 levels and one bonus level;<br/>\r\n - Familiar but improved gameplay;<br/>\r\n - A new system of bonuses and altars;<br/>\r\n - Possibility of selecting options of construction and demolition of buildings;<br/>\r\n - 3 difficulty modes.", "metacritic": null, "released": "2018-10-30", "tba": false, "updated": "2023-01-19T19:14:48", "background_image": "https://media.rawg.io/media/screenshots/a3b/a3ba09c84ff90ac25d42acdd5e5f2c07.jpg", "website": "http://qumaron.com/roads-of-rome-new-generation-2-game", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 4}, "playtime": 11, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 233, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Whiterra"], "genres": ["Adventure", "Strategy", "Simulation", "Casual"], "publishers": ["Qumaron"], "esrb_rating": null}