{"id": 25465, "slug": "iron-man", "name": "Iron Man", "name_original": "Iron Man", "description": "<p>&quot;Tony Stark had it all: a genius mind, fame, and even a multinational<br />\ncorporation. But his life would soon change forever. During a routine<br />\nweapons test in the Middle East, power-hungry militants led a violent<br />\nambush against Tony and claimed him as their prisoner. Armed with Stark<br />\nIndustries weaponry, Tony’s new foes demanded he construct a new<br />\nultimate weapon for them. Instead, with the help of fellow captive<br />\nYinsen, Tony built his own ultimate weapon – a powerful suit of armor<br />\nthat served as the key to his heroic escape.</p>\n<p>After returning home, Tony’s near-death experience drastically altered<br />\nhis outlook on life. The attack against Tony – with his own creations,<br />\nno less – inspired him to cease production of all Stark Industries<br />\nweapons, despite the protests of longtime family</p>\n<p>friend and mentor Obadiah Stane. And that wasn’t all. Aided by his<br />\ncharming assistant, Pepper Potts, and equipped with a new suit even more<br />\nadvanced than the one used in his escape, Tony took it upon himself to<br />\ndestroy all Stark weapons in enemy hands – personally. He became more<br />\nthan a man. He became Iron Man.</p>\n<p>&quot;</p>\n<p>Become a one man army as the unstoppable Iron Man! Customize your suit<br />\nand battle against armies of fighter jets, tanks, armored Super Villains<br />\nand more. Blast into hardcore shooting action and explosive combat from<br />\nthe film as well as exclusive content created just for the game.</p>", "metacritic": 40, "released": "2008-05-02", "tba": false, "updated": "2024-02-14T11:57:09", "background_image": "https://media.rawg.io/media/games/02d/02d9794a728e08aff562774535103fb8.jpg", "website": "http://ironmanthegame.marvel.com", "rating": 2.54, "rating_top": 3, "added_by_status": {"yet": 5, "owned": 130, "beaten": 67, "toplay": 9, "dropped": 45, "playing": 2}, "playtime": 15, "achievements_count": 39, "ratings_count": 91, "suggestions_count": 388, "game_series_count": 0, "reviews_count": 91, "platforms": ["PC", "Nintendo DS", "Xbox 360", "PlayStation 2", "Wii"], "developers": ["Secret Level", "Artificial Mind and Movement", "A2M"], "genres": ["Action", "Shooter"], "publishers": ["SEGA"], "esrb_rating": "Teen"}