{"id": 254749, "slug": "vox-rhythm-music-tap-game", "name": "Vox Rhythm - Music Tap Game", "name_original": "Vox Rhythm - Music Tap Game", "description": "Welcome to the Musical World of VOX<br/>Immerse yourself in your favourite music video, enjoy your stay with the accompany notes, or choose to take on the challenges of various stages in VOX. Let's enjoy the harmony of music, rhythm and light from the various music video of our time (and beyond).<br/>VOX is trying to prolong the unique gameplay of the proclaimed music game, by extending the concept, adding more songs, new music, new theme, and many more feature to be added, hoping to satisfy the thirst of a rhythm game. In VOX, you will saw some familiar aspects, and discover many more goodies.<br/><br/>VOX's features :<br/><br/>- All songs and future updates are free to play<br/>- You can request your favourite songs!!<br/>- Fluid and easy to understand gameplay<br/>- New song updates every week<br/>- Constantly update with many planned feature, all for free<br/>- Customize the game's appearance to your liking<br/>- All levels are created with love, carefully sync all the beats<br/><br/><br/>-HOW TO PLAY:<br/><br/>- Follow along the Active Scan Line<br/>- Tap each note as the line passes through<br/>- Time your taps as the line is at the center of the note for a higher score!<br/>- Make consequently successful taps to score higher with combos<br/><br/><br/>Let's feel the rhythm of your songs, in VOX", "metacritic": null, "released": "2018-04-22", "tba": false, "updated": "2019-10-22T14:09:46", "background_image": "https://media.rawg.io/media/screenshots/8ec/8ec20b4d9571df19cf3aab9fda282bd0_Yq6uTZm.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 59, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["GoPencils Company"], "genres": ["Arcade"], "publishers": ["GoPencils Company"], "esrb_rating": "Everyone 10+"}