{"id": 254794, "slug": "clash-of-greeks-and-romans", "name": "Clash of Greeks and Romans", "name_original": "Clash of Greeks and Romans", "description": "This game is happening around 500 - 300 B.C when there were clash of Greeks and Romans. You as a warlord of Roman and need to protect, upgrade and create a war strategy to put a stand against the marching Greece enemies. Story revolves around one of the fantasy history about these titan quest, evolution and fight.<br/><br/>They have game like Olympic style games in Greece, while Gladiatorial games were played in Rome. Every citizens most enjoyable time is when these games are running like a festival season.<br/><br/>Create a Roman type strategy.<br/>Defend your Roman area and people from marching enemies.<br/>Plan to take a strong stand against attack from Air, Land and Water.<br/>Upgrade your war machinery regularly.<br/>Power from Gods like thunder to fight against titans and warlords.<br/>Use coins to purchase more weapons and upgrades.<br/><br/>Ancient civilization had unique culture, gods, war type, society, treating women, slaves and art styles.<br/><br/>The ancient Roman and Greek civilizations had well-organized political processes that greatly influenced the manner in which later governments were structured in Europe and the United States. The system of political parties, the establishment of divisions in government -- even political words such as democracy, monarchy and tyranny originated in ancient Rome and Greece. Although Rome drew many of its political principles from the Greeks, and as a result, developed a government similar to that of Greece, there were several differences between the two.<br/><br/>Greeks built roads to connect two specific cities. Romans built roads that connected their empire to Rome. This is the location of this addictive game.<br/><br/>Some of the popular Greek God Vs Roman Gods names<br/>Zeus : Jupiter<br/>Poseidon : Neptune<br/>Dionysus: Bacchus<br/>Hades : Dis Pater, Pluto, Orcus<br/>Ares : Mars<br/>Hermes : Mercury<br/>Eros : Cupid (Amor)<br/><br/>Both are Mediterranean countries, similar enough latitudinal for both to grow wine and olives, but with very different terrain. The ancient Greek city-states were separated from each other by hilly countryside and all were near the water. on the other hand Rome was inland, on one side of the Tiber River, but the Italic tribes (in the boot-shaped peninsula that is now Italy) did not have the natural hilly borders to keep them out.<br/><br/>In Ancient Greece women had no rights.  They were property. While in Rome, under the king and in the republic, women were not property, still they had no equal rights.  During the Empire, Roman women had quite a few rights, but were still not citizens.<br/><br/>The armies of Republican Rome were strongly rooted in the Italian peasantry.  Rome's political reach was broader than comparable Greek states and military service obligations extended farther down the social scale. This made for a large army with a lot of rural soldiers: people who were used to the outdoor life, familiar with manual labor, and self sufficient.<br/><br/>Greek city state armies tended to be more upper class affairs: the extreme example being Sparta, where the entire army was drawn from the privileged class of Spartiates; but even at Athens there was a lot of tension between the relatively well off hoplite class of landowners and prosperous city folk and the thetes - the urban  working class who could not afford their own armor and were relegated to the rowing benches of the navy. (Note the the Macedonians during their heyday had a much broader base among rural peasants, more on the Roman model).<br/><br/>Over time both Greek and Roman armies professionalized, but in different ways.  After the classical period many Greek armies relied heavily on mercenaries, which provided some impressive technical skills and specialties, but also political unreliability.  Roman armies became more professional as the Italian peasantry was displaced in the late Republic by huge slave-run plantations: the military revolutions of generals like Caesar and Pompey were made easier as soldiering became a lifelong career instead of a short-service civic duty.", "metacritic": null, "released": "2016-03-13", "tba": false, "updated": "2019-10-22T14:09:48", "background_image": "https://media.rawg.io/media/screenshots/64b/64b63d40c689670838fdf832ce07e08c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 196, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Wahid Zhowandai"], "genres": ["Action", "Strategy"], "publishers": ["Wahid Zhowandai"], "esrb_rating": "Everyone 10+"}