{"id": 254763, "slug": "city-of-games-baccarat-slots", "name": "City of Games Baccarat & Slots", "name_original": "City of Games Baccarat & Slots", "description": "Enjoy the thrill of winning authentic baccarat and slots games from Macau, Vegas and more! Play for free and win big! Earn real-world rewards from our world-class partners for VIP nightclub access, shows, dinners, spa treatments and even 5-star accommodations.<br/><br/>What are you waiting for? Download the City of Games app on your iOS devices today!<br/><br/>Join now and connect to Facebook to receive even more Free Chips and Reward Points!<br/><br/>Download the City of Games app to enjoy:<br/>-- Real Rewards from resorts, entertainment venues, and restaurants!<br/>-- Huge Progressive Jackpot for win streaks<br/>-- Brand new SLOTS 777 games<br/>-- New slots machines will be introduced on a regular basis<br/>-- Authentic Baccarat (both Classic and No-Commission)<br/>-- Real 3D Card Squeezing<br/>-- Daily Goals earn free chips and reward points <br/>-- Spin the Jackpot Wheel for even more free chips <br/>-- Play in Cantonese, Mandarin, Vietnamese, Bahasa Indonesia, Thai and English. More languages on the way!<br/>Note:<br/>-- City of Games is intended for adult audiences.<br/>-- City of Games does not offer “real money gambling<br/><br/>If you ever need help or have comments, please contact us at: info@cityofgamesapp.com<br/><br/>AND... if you like us, give City of Games a 5-star review!!!", "metacritic": null, "released": "2016-11-03", "tba": false, "updated": "2019-10-22T14:09:47", "background_image": "https://media.rawg.io/media/screenshots/4c6/4c63805f188f6577abd6f96656615291_2GPnCFj.jpg", "website": "http://www.cityofgamesapp.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 237, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Explorer"], "genres": ["Card"], "publishers": ["Explorer"], "esrb_rating": "Teen"}