{"id": 254730, "slug": "spider-solitaire-16", "name": "Spider Solitaire․", "name_original": "Spider Solitaire․", "description": "Play the #1 FREE SPIDER SOLITAIRE card game on your iPhone, iPod Touch or iPad!<br/><br/>Spider Solitaire, is one of the most popular card game that millions of people love to play from the PC era. We have kept the game true to the spirit of the classic Spider Solitaire, and now make it available on the go.<br/><br/>In Spider Solitaire, your goal is to build stacks of cards of the same suit from King to Ace. For more fun and challenges, you can choose to play in Winning Deal, Random Shuffle, and Daily Challenge modes, and you are also free to choose the difficulty of the game from play with 1 to 4 suits of cards.<br/><br/>Fun Daily Challenges every day: each day you will receive a fresh solvable Daily Challenge, solve the challenge will earn you a crown for that day. Win medals from Bronze to Gold by collecting more crowns!<br/><br/>We gave this game a clean and intuitive interface, and carefully designed some beautiful theme packs for you to choose, we surely you would enjoy the gameplay and also love the new looks, it definitely will be the Spider Solitaire that exceeds your expectation!<br/><br/>Highlights:<br/>- Fresh and solvable Daily Challenges<br/>- Classical Spider Solitaire gameplay<br/>- Clean and user-friendly interface<br/>- Concise design and easy to reach cards<br/>- Beautiful theme packs: textures, floral, pets, festival specials and more<br/>- Custom card backs and back grounds<br/>- 1 suit game (easiest)<br/>- 2 suit game<br/>- 3 suit game<br/>- 4 suit game (most difficult)<br/>- Option for All Winning deals<br/>- Option for unrestricted Deal allows you to deal cards even with empty tableaus<br/>- Single tap to move magically to the destination you expect<br/>- Unlimited Smart hints show potentially useful moves <br/>- Unlimited undos<br/>- Interruption friendly with auto-save and resume<br/>- Standard Spider Solitaire scoring <br/>- Timed mode<br/>- Timer, moves and statistics<br/>- Left-handed supported<br/>- Tablet supported<br/>- Offline play and no data cost<br/>- And so much more!<br/><br/>Download the best free Spider Solitaire now and join millions of other players who are having fun NOW!", "metacritic": null, "released": "2016-12-06", "tba": false, "updated": "2019-08-02T03:25:21", "background_image": "https://media.rawg.io/media/screenshots/8a3/8a35ea6e125e6e673fa9585b67fb4664.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 68, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Meng Li"], "genres": ["Card", "Puzzle"], "publishers": ["Meng Li"], "esrb_rating": null}