{"id": 25474, "slug": "defend-your-castle", "name": "Defend your Castle", "name_original": "Defend your Castle", "description": "DESCRIPTION <br/>\r\nDefend your Castle against the relentless army of crayon invaders! Those crafty barbarian hordes have amassed their forces once again to challenge your domain. Will you and your court rise to the challenge, or stand aside as they raze your Castle to the ground? <br/>\n<br/>\r\nFEATURES <br/>\r\n• Battle many different types of enemy invaders, requiring varying tactics to defeat <br/>\r\n• Upgrade your kingdom with fortified walls, the archery range, wizard tower, craftsmen's workshop, and the demolition laboratory <br/>\r\n• Strengthen your forces by converting soldiers and assigning them as Archers, Wizards, or Craftsmen to work within your castle or deploying them as Bombers <br/>\r\n• Cast powerful spells with the aid of your Wizards <br/>\r\n• Your superb defending abilities now earn you up to 45 new achievements! <br/>\r\n• Unlimited levels: Continue to grow the strength of your Kingdom indefinitely <br/>\r\n• Heroic difficulty mode for players of royal descent<br/>\n<br/>\r\nPRESS <br/>\r\n\"You'd be insane not to give Defend Your Castle a download. Final Score 9/10\" - Joystiq.com <br/>\n<br/>\r\n\"It’s more cathartically satisfying than bubble wrap and a whole lot prettier\" - iPhone Games Network <br/>\n<br/>\r\nFeatured in Apple's \"Best Castle Defense Games\"", "metacritic": null, "released": "2008-05-12", "tba": false, "updated": "2023-06-03T20:35:08", "background_image": "https://media.rawg.io/media/screenshots/e2a/e2a7d302882e46c4fcc80ef987e75d47.jpg", "website": "http://www.xgenstudios.com/defend-your-castle/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 9, "dropped": 3}, "playtime": 2, "achievements_count": 0, "ratings_count": 3, "suggestions_count": 161, "game_series_count": 0, "reviews_count": 3, "platforms": ["Wii", "macOS", "PC", "Android", "iOS"], "developers": ["XGen Studios"], "genres": ["Action", "Arcade", "Casual", "Indie"], "publishers": ["XGen Studios"], "esrb_rating": "Everyone 10+"}