{"id": 254779, "slug": "doom-survivor", "name": "Doom Survivor", "name_original": "Doom Survivor", "description": "\"Doom Survivor\" is a shooting game with a third person view where you use the left and right rockers to control and can enjoy the actions and shooting at the same time. This game combines the Roguelike random gameplay, RPG stimulation and PVP battle royale, along with 3 career systems, hundreds of weapons, and thousands of weapon components. As one of the few survivors at the apocalypse, you have to armor yourself and find a way to escape from these zombies and traps;<br/>【Game features】<br/>1. Third person camera, double-rocker operation, and the super sensation of actions + shooting<br/>----------------------------------------------<br/>----------------------------------------------<br/>2. Regional Exploration, challenge the 5-star BOSS alone<br/>----------------------------------------------<br/>----------------------------------------------<br/>3. War of Annihilation in Affected Areas, random Roguelike, go unlock the invisible routes<br/>----------------------------------------------<br/>----------------------------------------------<br/>4. Death Race, battle royale between 10 players, but only one will survive<br/>----------------------------------------------<br/>----------------------------------------------<br/>5.Arsenal, where there are hundreds of weapons and you can customize weapons<br/>----------------------------------------------<br/>----------------------------------------------<br/>6. Three career systems, create your own exclusive talent build<br/>----------------------------------------------<br/>----------------------------------------------<br/>7. Stay tuned. Several player form a group to pass the level together<br/>----------------------------------------------<br/>----------------------------------------------", "metacritic": null, "released": "2018-09-25", "tba": false, "updated": "2019-10-22T14:09:47", "background_image": "https://media.rawg.io/media/screenshots/0e1/0e1c7d455f14105c4f8ab68bbabf0f14_w39j5EW.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 182, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["珠海乐趣科技有限公司"], "genres": ["Action", "RPG"], "publishers": ["Zhuhai Funova Technology Co"], "esrb_rating": "Teen"}