{"id": 254967, "slug": "birthday-present-surprise-maker-create-your-own-pr", "name": "Birthday Present Surprise Maker - create your own presents", "name_original": "Birthday Present Surprise Maker - create your own presents", "description": "Have you ever wanted to create your very own Birthday Present and get your family and friends to open it?<br/>Well now you can!<br/><br/>Birthday Present Surprise Maker is a free super fun game where every day will feel like your birthday as you get to design and open as many birthday presents as you can open!<br/> <br/>   HOW TO PLAY<br/> <br/>Pick a toy, then design the present box to put your toy surprise in. From the color to the paper wrapper pattern, it can all be customized. <br/>Its not just birthday presents you can make, why not make presents for other special occasion like easter, christmas or thanksgiving.<br/><br/>Once you're finished with the look of your present surprise box you can then decorate it with a choice of tons of stickers. Change the color and size of stickers so you can personalises your special present.<br/><br/>Next is to set up the birthday room, put up balloons and banners to give the room a real birthday party feel! <br/><br/>Let your imagination run wild and come up with as many cute, cool, crazy ideas as you can. <br/><br/><br/>   FEATURES<br/><br/>* Lots of toy to choose from including: baby egg toy, toy monsters, toy robots, cute toy animals, video games, toy cars and much more!<br/><br/>* Save your favourite creations to be opened whenever you want!<br/> <br/>* Show them off to your family and friends then get them to open it.<br/><br/>* Unbox it yourself like your favourite online video unboxing collectors. <br/><br/>Birthday Present Surprise Maker is totally free and does not contain any in-app purchases.  This is the full app and all the items are unlocked.", "metacritic": null, "released": "2016-05-28", "tba": false, "updated": "2019-10-22T14:09:53", "background_image": "https://media.rawg.io/media/screenshots/650/650f61bc822ef5a6ad1eb75ef656ae35.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 63, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Simon Turner"], "genres": ["Family"], "publishers": ["Simon Turner"], "esrb_rating": "Everyone 10+"}