{"id": 254950, "slug": "chessica", "name": "Chessica", "name_original": "Chessica", "description": "Chess, the game of kings. So you may be surprised that we gave our chess app a female name. But aside from the fact that we like the pun, we think that chess is actually a game of queens. Not only because the queen is chess' most powerful piece but because more and more women get into the game. And for good reason, since they've proven to be exceptionally strong players. Also, women love fair play, probably because they don't need to cheat in order to win. But even in case they lose, they do so with grace. Like queens do.<br/><br/>And so Chessica is more than a chess app, it's a statement and a call to action to all the girls and women out there: let's play chess!<br/><br/>The game's design is an homage to some old textbooks on chess we found, and found to be beautiful. The user interface is clean with a new (yet old) look and feel that is easy on the eye and makes playing chess an even more joyful experience.<br/><br/>When you download this app, you actually get two apps, an iOS app (that shows up on your home screen) and an iMessage app (that shows up only within iMessage). The iOS app includes the help topics and contact info and might later include other features as well. The iMessage app is for playing chess with a friend.<br/><br/>FEATURES<br/>+ Flip board<br/>+ Move history (SAN)<br/>+ View legal moves for each piece<br/>+ En passant capture possible <br/>+ Queenside and kingside castling possible<br/>+ Resignation possible<br/>+ Draw offer possible<br/>+ 50-move rule enforced<br/>+ Threefold repetition rule enforced<br/>+ Pawn promotion to queen, rook, bishop, knight<br/>+ Undo last move<br/>+ Replay game<br/>+ Move by drag &amp; drop<br/>+ Export position to FEN<br/>+ Export game to PGN<br/><br/>START GAME<br/>1) Start or open a conversation in iMessage<br/>2) Tap the Chessica app icon in the bottom bar <br/>3) Tap `New Game` <br/><br/>MAKE MOVE<br/>1) Tap the message bubble to view the game.<br/>2) If you have the turn, select any of your pieces to see all legal moves for that piece.<br/>3) Tap any highlighted destination square to determine the move.<br/>4) Tap `Move` to finish the move and send it to your opponent.<br/>5) Or drag &amp; drop the piece to the destination square.<br/><br/>MAKE DRAW OFFER<br/>1) Tap the message bubble to view the game.<br/>2) If you have the turn, determine a move first.<br/>3) Then tap `Game` and select `Send Draw Offer`<br/>4) Your opponent can accept or decline your offer.<br/><br/>ACCEPT/DECLINE DRAW OFFER<br/>1) Tap the message bubble to view the game.<br/>2) When asked, tap `Accept` to draw the game.<br/>3) Or tap `Decline` and continue the game by making the next move.<br/><br/>RESIGN<br/>1) Tap the message bubble to view the game.<br/>2) If you have the turn, tap `Game` and select `Send Resignation` to end the game by resignation.<br/><br/>SYMBOLS<br/>W: white player<br/>B: black player<br/>Q: queenside castling ability still available<br/>K: kingside castling ability still available<br/>Left number: half-move clock<br/>Right number: full move number<br/><br/>FEN EXPORT<br/>1) Tap the message bubble to view the game.<br/>2) Tap `Game` and select `Share Position (FEN)` to share the current position via email or otherwise.<br/><br/>PGN EXPORT <br/>1) Tap the message bubble to view the game.<br/>2) Tap `Game` and select `Share Game (PGN)` to share the game via email or otherwise.<br/><br/>UNINSTALL <br/>Uninstall the app on your home screen like any other app. The iMessage app will be removed as well.<br/><br/><br/>If you have questions, comments, ideas for improvements or if you've found a bug, don't hesitate to drop us a note, we're easy to talk to: <br/><br/>hello@dracoexmachina.com<br/><br/>Or, better yet, leave us a review so others can benefit too. We're trying to always reply in a timely manner.  <br/><br/>We hope you'll enjoy playing this game as much as we did developing it. Thank you and have fun!", "metacritic": null, "released": "2018-08-10", "tba": false, "updated": "2019-10-22T14:09:53", "background_image": "https://media.rawg.io/media/screenshots/3a9/3a91a6af9ce8b1ff2384067071999a0c.jpg", "website": "https://www.facebook.com/pg/chessicaapp", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 56, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Stefan Hoppe"], "genres": ["Strategy", "Board Games"], "publishers": ["Stefan Hoppe"], "esrb_rating": "Everyone 10+"}