{"id": 254922, "slug": "bj-bridge-pro", "name": "BJ Bridge Pro", "name_original": "BJ Bridge Pro", "description": "Learn bridge as a novice or improve your bridge as a seasoned player. Connect up with other duplicate bridge players. <br/><br/>Unlimited random deals are free.<br/><br/>Download hands and double dummy results from your club’s BridgeWebs website. [Use option \"Load\"; then \"Web search to find deals\"; find your your club site; go to your results page; touch the \"Hands\" tab, then touch \"Download as Pbn\"]. Or use the preloaded CLUB-SESSION-SAMPLES to compare you play with actual results of a club session.<br/><br/>Create your own deals [Use option \"Load\"; then \"New Manual Deal\" or \"Amend Manual Deal\"].<br/><br/>Ad free.<br/><br/>This app offers a choice of Standard American Yellow Card (SAYC), simplified Acol (EBU) system for beginners, Standard Acol or Benji Acol. 2/1 is an optional extra.<br/><br/>For any bidding style, choose optional conventions: 5-card majors, Benji weak and strong twos, ELH two-suited overcall, ASPTRO 1NT defence or Landy 1NT defence, Roman Key Card Blackwood, standard Blackwood, Gerber, Quantitative 4NT, Baron 3C ‘Normal’ Stayman or Puppet, Stayman, Jacoby 2NT 1-suit support, Truscott 2NT 1-suit doubled support, Ogust responses, Inverted minors, Unassuming Cue Bid, Splinter, Strong jump overcall, Weak take-out choices.<br/><br/>There is also a choice of weak or strong 2-level opening bids for each suit, selection of preferred high card point ranges for weak or strong 1NT and 2NT bids and control of ‘bidding aggression level’ during contested auctions.<br/><br/>**Note for BEGINNERS and improvers: turn off any convention you do not recognise and set \"aggression\" to low. You will find the bidding easier to follow! <br/><br/>Experienced players can make full use of the Convention Card wizard.<br/><br/>If you find any problem or have queries / suggestions, please email Helen at bjsoftware42@gmail.com", "metacritic": null, "released": "2017-01-05", "tba": false, "updated": "2019-07-30T07:13:14", "background_image": "https://media.rawg.io/media/screenshots/5f2/5f2d8622fd7a126761d08814918bda7d.jpg", "website": "http://bjbridge.org", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 102, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Helen Fordred"], "genres": ["Card"], "publishers": ["Helen Fordred"], "esrb_rating": null}