{"id": 255106, "slug": "ace-3d-boat-parking-speedboat-driving-simulator", "name": "Ace 3D Boat Parking Speedboat Driving Simulator", "name_original": "Ace 3D Boat Parking Speedboat Driving Simulator", "description": "Boat parking &amp; driving at its best! Featuring realistic 3D environments, choice of ship steering &amp; driving (wheel or buttons), multiple levels, real water physics, and more! You won't be able to put this speed boat parking &amp; driving game down!<br/><br/>GAME FEATURES<br/>- Multiple speed boats to choose from. Each ship handles &amp; drives differently so no two boats are the same!<br/><br/>- Awesome real world environments. Each one is visually stunning! Featuring Miami and the French Riviera. We didn't stop there! You'll also experience sunny blue skies, or beautiful sunsets.<br/><br/>- Incredible detailed graphics. Check out how realistic and jaw dropping the water looks!! You'll even see the boat and environments reflection in the water. A TON of detail has gone into making everything look real!<br/><br/>- Real water physics! As you drive your powerboats on the water, you'll have to be careful steering your ship around turns, stopping, backing up, etc... this game uses real water physics so what happens to a boat in real life when you try to stop quick or turn too quick, will also happen in this game!<br/><br/>- Multiple steering options! Choose from a wheel or button for your driving needs.<br/><br/>- 100% FREE! All ships are unlocked!<br/><br/>Bottom line, this boat parking game will keep you entertained for hours!", "metacritic": null, "released": "2014-01-12", "tba": false, "updated": "2019-10-22T14:09:57", "background_image": "https://media.rawg.io/media/screenshots/f4f/f4fc7435b8f964b884375b71b1a80419.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 107, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Skullbox Games"], "genres": ["Sports", "Racing"], "publishers": ["Skullbox Games Pte"], "esrb_rating": null}