{"id": 255171, "slug": "flughafen-simulator-2013", "name": "Flughafen Simulator 2013", "name_original": "Flughafen Simulator 2013", "description": "Schlüpfen Sie in die Rolle eines Flughafenmitarbeiters und erleben Sie mit dem „Airport Simulator 2013“ den spannenden und herausfordernden Alltag rund um das Thema Flughafen und Flugzeugabfertigung.<br/><br/>Ihr Aufgabenfeld umfasst dabei viele abwechslungsreiche Arbeiten unmittelbar am Flughafenvor- bzw. Rollfeld eines modernen Großflughafens. Kümmern Sie sich z.B. darum, dass Maschinen betankt werden, die Fluggastbrücke in Position gebracht wird, um Passagiere ein- und aussteigen zu lassen und kümmern Sie sich um das Catering sowie den Transport von Gepäck und Fracht. Sind die Tragflächen der Flugzeuge vereist, so sind Ihre Fähigkeiten auf dem Enteisungsfahrzeug gefragt. Ist das Flugzeug startbereit, ist es Ihre Aufgabe, die Maschine mithilfe des Flugzeugschleppers aus der Parkposition zum Rollfeld zu schieben.<br/>Insgesamt sieben unterschiedliche Fahrzeuge und Maschinen unter-stehen bei der Flugzeugabfertigung Ihrer direkten Kontrolle. Mithilfe der frei beweglichen Kamera und einer stufenlosen Zoomfunktion haben Sie zudem stets den vollen Überblick über die verschiedenen Arbeitsschritte und Aufgaben. Jeder Handgriff und jede Bewegung muss gut überlegt sein, damit der reibungslose Ablauf und der enge Zeitplan im Flugverkehr nicht gefährdet werden.<br/>26 verschiedene Missionen inklusive Tutorial und Freeplay stehen Ihnen zur Auswahl und neben einem Punktesystem sowie verschiedener Auszeichnungen, erhalten Sie mit jeder erfolgreich abgeschlossenen Aufgabe Kapital, um Ihre Fahrzeugflotte auszubauen und zu verbessern.<br/>Neben drei unterschiedliche Flugzeugtypen sowie einem detaillierten Flughafengelände, mit typischen Markierungen und Gebäuden, gibt es zudem einen dynamischen Flugzeug- und Fahrzeugverkehr sowie eine realistische Soundkulisse, Funkverkehr und unterschiedliche Wetterbedingungen wie Regen, Schneefall und Nebel.<br/><br/>Tauchen Sie ein in eine realistische Flughafen-Simulation und erleben Sie dieses spannende Thema hautnah!<br/><br/>FEATURES:<br/>•Eine spannende Berufs- und Technik-Simulation rund um das Thema Flughafen und Flugzeugabfertigung<br/><br/>•Drei verschiedene Flugzeugtypen und insgesamt sieben steu-erbare Fahrzeuge und Maschinen - Fluggastbrücke, Flugzeugschlepper, Catering Fahrzeug, Flughafenschlepper, Containertransporter, Tankfahrzeug und Flugzeug-Enteisungsfahrzeug<br/><br/>•Ein detailliertes und frei befahrbares Flughafengelände sowie dynamischer Flugzeug- und Fahrzeugverkehr (Inkl. Flugzeug-starts und Landungen)<br/><br/>•Insgesamt 26 Missionen, inklusive Tutorial sowie Freeplay<br/><br/>•Verschiedene Auszeichnungen sowie Punktesystem und der Möglichkeit Fahrzeuge und Maschinen zu verbessern<br/><br/>•Unterschiedliche Wetterbedingungen wie Schneefall, Regen, Nebel und Sonnenschein<br/><br/>•Realistische Soundkulisse sowie Funkverkehr und eine frei beweglichen Kamera inkl. stufenlosem Zoom", "metacritic": null, "released": "2013-07-05", "tba": false, "updated": "2019-10-22T14:09:11", "background_image": "https://media.rawg.io/media/screenshots/d75/d75956ec6802af3e50fb3f3cb7133bc8_5sJcAjL.jpg", "website": "http://www.simuwelt.de", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 101, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS"], "developers": ["Rondomedia"], "genres": ["Simulation"], "publishers": ["rondomedia Marketing & Vertriebs"], "esrb_rating": "Everyone 10+"}