{"id": 255189, "slug": "mini-water-track-tricky-bike-s", "name": "Mini Water Track Tricky Bike-s", "name_original": "Mini Water Track Tricky Bike-s", "description": "Stunt on Bike is an action packed fun game.Live life on the edge! Drive your bike through amazing track and perform some amazing stunts.This game have many levels.Each level is more thrilling than the previous level.Perform some serious stunts and race to the finish line really fast.Come and play the most exciting bike stunt game.In Racing on Bike,you will feel like a real stunt rider.Experience the fastest and most exhilarating 3D stunts action.Racing on Bike is an exciting bike stunts game that will get your adrenaline pumping.<br/>Let's go fast and show incredible tricks.Speed with amazing levels of breathtaking motorcycle adventures.Develop your biking skills: jump, climb.<br/>This is a physics-based motorbike racing game.To collect more stars you must do a perfect run.With such an easy controls even a kid can play this game, but you need to really master the game to collect all the stars.You will have to use your trail bike and expertly use your trial bike.Only a highly skilled bike racer is needed who has a passion for racing and stunt.<br/>High end graphics, realistic physics engine that tests your abilities and control. Negotiate hundreds of obstacles including ramps, jumbo tires, rocks, planks and more in this exciting racing games.It is an extreme test of skills.Try bike racing through a world of adventure and crazy characters. Go crazy with the combinations, it’s your ride - your rules.Enjoy playing our extreme courses with amazing 3D environments that will keep you engaged in some extreme trial bike riding action.<br/>Take your bike riding skills to the next level in trial bike extreme.We believe you are naturally gifted in riding motorbikes,here’s your chance to prove it once and for all.Skillfully master all of the obstacles within these beautiful levels to show yourself and the world how good you actually are.<br/>So what are you waiting for? Get stunt on bike NOW and race to the finish line!<br/>Features:<br/>1.Realistic game sounds<br/>2.Fun and challenging tracks<br/>3.Feel good graphics<br/>4.Smooth and realistic Bike handling<br/>5.Fun surprises in each level", "metacritic": null, "released": "2017-10-07", "tba": false, "updated": "2019-10-22T14:10:01", "background_image": "https://media.rawg.io/media/screenshots/51a/51ad36ab8e8f9d56d562996f7890afa2_4azRZqt.jpg", "website": "https://majhyanatech.wordpress.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 104, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Adil Munir"], "genres": ["Adventure", "Simulation", "Sports"], "publishers": ["Adil Munir"], "esrb_rating": "Everyone 10+"}