{"id": 25516, "slug": "fatal-fury-2", "name": "FATAL FURY 2", "name_original": "FATAL FURY 2", "description": "<p>\n      Released in 1992 by SNK, FATAL FURY 2 is the second installment of the \n      renowned fighting-game series. In addition to Terry, Andy, and Joe, who \n      appeared in the original game, another five distinctive fighters gather \n      from around the world to compete for the championship title. Also newly \n      added are stage-specific hazards and the ability to perform desperation \n      attacks when a character’s strength is low. These particularly deadly \n      techniques create the chance for a come-from-behind victory achieved \n      with a single strike. Moreover, the innovative two-line battle, which \n      proved popular in the previous version, has also been radically \n      enhanced. Pressing the weak attack and strong attack buttons \n      simultaneously enables a player to move their fighter to another line \n      themselves, or to launch an attack that pushes the opponent back to \n      another line. This game mechanic, unique to this title in the series, \n      allows the player to take advantage of the depth of the screen and \n      create even more exciting bouts. Can you prove yourself the king of \n      fighters again?\n    </p><p>This classic game is part of the Virtual Console service, which brings you great games created for consoles such as NES™, Super NES™ and Game Boy™ Advance. See more Virtual Console games for Wii.</p>", "metacritic": null, "released": "2008-06-30", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/122/122db6a592cfff1e093def72f1285bf9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 3, "beaten": 2, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 127, "game_series_count": 0, "reviews_count": 1, "platforms": ["Wii"], "developers": [], "genres": [], "publishers": ["D4 Enterprise"], "esrb_rating": null}