{"id": 25529, "slug": "nancy-drew-the-mystery-of-the-clue-bender-society", "name": "Nancy Drew: The Mystery of the Clue Bender Society", "name_original": "Nancy Drew: The Mystery of the Clue Bender Society", "description": "<p>\n      The Clue Bender Society, a group consisting of the world's greatest \n      detectives, is looking for their newest member. Teen super-sleuth Nancy \n      Drew is among three exceptional candidates that could make the cut if \n      she can solve a series of pre-determined challenges before the others. \n      But when a secret tome containing the solutions to history's greatest \n      mysteries goes missing, the Clue Bender Society's test case becomes \n      real; they turn to Nancy and the other applicants to help recover the \n      book before it ends up in the wrong hands. With only 24 hours to solve \n      the case and earn membership into the Society, Nancy Drew will have to \n      be at the top of her game.\n    </p><p>\n</p><ul>\n<li>\n        Play as Nancy Drew, the world's most recognizable teen sleuth, in this \n        3rd person action adventure follow up to Nancy's DS debut in The \n        Deadly Secret of Olde World Park.\n      </li>\n<li>\n        Unravel 9 intriguing chapters as Nancy completes progressively \n        difficult tasks including: new fingerprint retrieval and \n        identification, maze navigation, following suspects, sneaking, \n        interrogations, accessing areas, inspecting items and now even \n        snowmobiling and boating!\n      </li>\n<li>\n        Use the Touch Screen to:\n      </li>\n</ul><p>\n</p><p>\n      *Play new contextual detective games with various interactive objects \n      that affect your progression through the game. Play conversation and \n      unlocking games too.\n    </p><p>\n      *Access your new Suspect File and keep track of information including \n      fingerprints, habits, characteristics and more.\n    </p><p>\n      *Navigate the all new map feature so you never lose the trail.\n    </p><p>\n      *Access clues, tasks and inventory.\n    </p><ul>\n<li>\n        Unique graphic novel format pays homage to the classic book series \n        that introduced Nancy Drew to the world\n      </li>\n<li>\n        All new cell phone feature lets you keep up with all incoming \n        information\n      </li>\n<li>\n        Use the shadows to sneak past danger areas and avoid detection\n      </li>\n<li>\n        Use your lock picking skills to sneak into areas to search for clues\n      </li>\n<li>\n        Use Nancy's Clue Journal to check current objectives and discover new \n        information\n      </li>\n</ul>", "metacritic": null, "released": "2008-07-15", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "toplay": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["Nintendo DS"], "developers": ["Gorilla"], "genres": [], "publishers": ["Majesco Entertainment"], "esrb_rating": null}