{"id": 2552, "slug": "sonic-the-hedgehog-2", "name": "Sonic the Hedgehog 2", "name_original": "Sonic the Hedgehog 2", "description": "<p>Sonic the Hedgehog 2 is a platform game, the second installment in Sega’s Sonic the Hedgehog series.  </p>\n<h3>Plot</h3>\n<p>The story shares many similarities with the previous game. Once again, Sonic must halt Dr. Robotnik’s plan on collecting six Chaos Emeralds and using their power to take over the world. This time, Robotnik build a space station called Death Egg and the events take place mostly on West Side Island. The game also introduces Tails – Sonic’s best friend and important character for the series. </p>\n<h3>Gameplay</h3>\n<p>Gameplaywise the game is very similar to its processor. The game consists of eleven zones.<br />\nAll zones, except the final one, are divided into two or three acts. In each act, your goal Is either to reach the finish of the level or to defeat a boss. The gameplay revolves around Sonic’s ability to run at high speed. The levels involve many objects that help Sonic gain high speed such as slopes, loops, and springs. Sonic can attack enemies and break certain obstacles by using Spin Attack. Like in previous game Spin Attack activates by gaining high speed while rolling on the ground or jumping but Sonic the Hedgehog 2 introduces new gameplay mechanic – Spin Dash. Pressing down and jump while stationary results in Sonic curling in a ball and then upon releasing the button launches launching forward at high speed. The game supports co-op multiplayer in which one player takes the role of Sonic and other plays as Tails.</p>", "metacritic": 78, "released": "1992-11-21", "tba": false, "updated": "2024-04-07T23:40:04", "background_image": "https://media.rawg.io/media/games/2c3/2c3363eb1ae202b9e4e7520d3f14ab2e.jpg", "website": "http://www.sega.com", "rating": 4.28, "rating_top": 4, "added_by_status": {"yet": 38, "owned": 707, "beaten": 386, "toplay": 31, "dropped": 134, "playing": 10}, "playtime": 5, "achievements_count": 24, "ratings_count": 368, "suggestions_count": 369, "game_series_count": 64, "reviews_count": 375, "platforms": ["Genesis", "GameCube", "Game Gear", "Android", "PlayStation 3", "Xbox 360", "Wii", "PC", "iOS", "Nintendo 3DS", "Xbox One"], "developers": ["SEGA", "Sonic Team"], "genres": ["Action", "Arcade", "Platformer"], "publishers": ["SEGA"], "esrb_rating": "Everyone 10+"}