{"id": 25540, "slug": "rock-blast", "name": "Rock Blast", "name_original": "Rock Blast", "description": "<p>\n      ENJOY THIS ROCK BLAST FROM THE PAST. A VOLCANO HAS ERUPTED CAUSING \n      MASSIVE AMOUNTS OF HOT LAVA TO DESTROY YOUR TOWN. WITH THE AID OF YOUR \n      DINOSAUR COMPANIONS, SHOOT AND DESTROY THE ROCKS TO SAVE THE VILLAGE.\n    </p><p>\n</p><p>\n      Think and react fast in this frantic puzzle game fit for everyone. \n      Touch, aim and drop the perfect shot to destroy the rising lava rocks. \n      Match three or more of the same colored rocks and witness the intensity \n      of the action as your dinosaur supporters aid you with mind-blowing \n      attacks.\n    </p><p>\n</p><p>\n      Rock Blast Key Features:\n    </p><p>\n</p><p>\n</p><p>\n      Game Modes - Lots of variety and game modes for all puzzle fanatics. \n      Challenge all 99 levels in the classic Story Mode and master the art of \n      timing and precision in the Time Attack and Survival Mode.\n    </p><p>\n</p><p>\n</p><p>\n      Puzzles - Tons of puzzles for those who prefer a casual experience. The \n      player must eliminate all of the rocks with a given amount of moves.\n    </p><p>\n</p><p>\n</p><p>\n      Multiplayer - Two players can battle and test each other’s ability to \n      think and react fast. Battle for supremacy and send rocks to your \n      opponent in the Battle Mode or play for the highest score in Time Attack.\n    </p><p>\n</p><p>\n</p><p>\n      Dinosaur Supporters - Upgrade up to 5 dinosaurs each with their special \n      abilities. Build each skill to help you destroy, dodge, and cool down \n      the rising lava rocks.\n    </p><p>\n</p><p>\n</p><p>\n      Simple Control Scheme - Crafted for all players, this game features easy \n      to use Control Pad and Touch Screen controls that is changeable on the \n      fly.\n    </p>", "metacritic": null, "released": "2008-08-05", "tba": false, "updated": "2019-10-14T02:42:59", "background_image": "https://media.rawg.io/media/screenshots/bbc/bbcf1d6171d379a80bdf965b8a0a5f0e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 47, "game_series_count": 0, "reviews_count": 0, "platforms": ["Nintendo DS", "iOS"], "developers": ["Candy Match Three Puzzle Games"], "genres": ["Action", "Casual"], "publishers": ["UFO Interactive Games", "Beijing New Vision Real Estate Development Co"], "esrb_rating": "Everyone 10+"}