{"id": 255432, "slug": "project-myriad-itch", "name": "Project Myriad (itch)", "name_original": "Project Myriad (itch)", "description": "<p>Project Myriad is a tower defense strategy game. You build towers on a map of hexagons that will attack and defeat oncoming waves of enemies. Towers can be upgrade and some have varied upgrade paths. The goal is clear as many waves as possible.<br/></p>7 Unique Towers\r\n<p>Choose from a variety of unique towers that target enemies in different ways. Want to flood your enemies with damage, Storm tower is what you want. Need an extra edge against the Starfish Boss wave, then the Missile tower has your back. Mix and match placement to find your ideal build configuration.<br/></p>Varied Upgrade Paths\r\n<p>Some towers have upgrade paths you can take to increase their efficiency in battle!<br/></p>Build a Maze\r\n<p>Each level allows you to weave an intricate maze to force enemies in the direction you want to, giving you more time to take them out.<br/></p>Strategic Level Tiles\r\n<p>Each level map can contain any number of level tiles that add strategy to the game play. Try to avoid hazardous tiles like the lightning bolt tile that speeds up enemies, or maze all the enemies into the minus tile that will deal damage to the enemies for you.<br/></p>Unlimited Waves\r\n<p>Each level has an unlimited number of enemies. How far can you get?<br/></p>4 Unique Enemies\r\n<p>There are 4 types of enemies; Skull: Which is the basic Unit. Speedy: Which has slightly reduced health but increased movement. Carapace: Has increased health but when it hits half health you break it's shell and it tries to speed away. Starfish: This wave is just one Boss enemy with very high health.</p>", "metacritic": null, "released": "2018-10-17", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/b37/b37ae29676e8a9d7581f625b36497ed0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 73, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Android"], "developers": ["JumpmenGaming"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}