{"id": 255521, "slug": "bus-simulator-mobile", "name": "Bus Simulator Mobile", "name_original": "Bus Simulator Mobile", "description": "<p>Bus Simulator Mobile is the Natural environmental based that will give you the feel to become real drive environment in Indian based location in creative and secure way. Bus Simulator Mobile is only provide game play location without any reputation. All are new locations and new feel. <br/><br/>Bus Simulator Mobile ha too much facilities in the game play. It consists the highlight-able features like natural based real time drive Environment, Huge number of Buildings, houses, local houses, various types of roads and side lands, India based City bus stands, Indian Shops, Interior rooms for bus showcase, Body building, Hill Driving, Chassis driving will make you enjoy like driving a real environment.<br/><br/>It has too much curve roads, up and down roads, hairpin bend roads, stone tunnel, hill tunnel, Train movement, and more number of buses. <br/><br/>None other game implemented the Chassis drive mode. Bus Simulator Mobile starting from bus body building level to final leak test. The designed bus will added in game play. <br/><br/>Some top Features of Bus Simulator Mobile are given below:<br/><br/>🎮Verified Indian Based cities and western ghats based hills area<br/><br/>🎮Indian Buses<br/><br/>🎮Easy driving control and variations<br/><br/>🎮All mobile Supportable 3D Graphics<br/><br/>🎮Huge number of Objects like real environment.<br/><br/>🎮Social Media Login and Sharing<br/><br/>🎮Ad free while driving environment<br/><br/>🎮Achievements and Leader Board<br/><br/>🎮Huge number of Bus designs<br/><br/>🎮Design in your Own buses(In- App- Purchase)<br/><br/>🎮 Different type of Playing modes( Day Night Mode, Rainy mode) <br/><br/>🎮 Special mode also added chassis to bus body building..<br/><br/>🎮 Local AI vehicles (Lorry,Auto,Bus,Car)<br/><br/>🎮 Different Types of sound horns.<br/><br/>We aren't big team.<br/><br/>We are 2 persons team. we created entire game. we worked for texture design, modelling, code, levels implementation , logic , environment, and AI...<br/><br/>How to Design your own Bus(Paid)?<br/></p>\n<p>Note: The ads give Virtual currency and toe service. It will helpful to full petrol and when the bus in trouble time. You can also buy buses using virtual currency.<br/><br/>Specification: For Good Graphics the phone needs at least 1.5 GB RAM. it can Also Run in 1GB RAM<br/></p><p>Website: http://indietrex.com/bussimulator</p>", "metacritic": null, "released": "2018-10-17", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/bf8/bf89b51264a4ea92a1b1100229e96a6e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 207, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["indietrex"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}