{"id": 255656, "slug": "patient-1890", "name": "Patient 1.8.90", "name_original": "Patient 1.8.90", "description": "<p>Patient 1.8.90 is an atmospheric horror game set in a recently abandoned insane asylum. You are just an average individual, who for Halloween decided to investigate the decrepit facility, thinking it to be merely a fun little thrill. You had no idea of the horrors you would unveil... </p>\n<p><strong>Controls:</strong></p>\n<p><em>-WASD: Movement</em></p>\n<p><em>-Left Click: Interact with items</em></p>\n<p><em>-Right Click: Toggle flashlight</em></p>\n<p><strong>Jam Details:</strong></p>\n<p>The theme for this jam was <em>'shadows'</em>, a theme that was incorperated into the level's lighting, the narriative, and the visual design of certain elements of the game. This will become far clearer upon loading into the game.</p>\n<p><strong>Please Note:</strong></p>\n<p>The game does have a tendency to crash/appear to crash on first boot-up. Either alt+f4 the game and try again or wait for it to resolve itself.</p>\n<p>The game may be intensive upon some hardware. I developed and tested it on a rather high end PC, and have not been able to test it on other systems. I did all that I knew of to increase optimization, however please be aware that I am unable to give minimum or recommended requirements.</p>\n<p>This game was made as part of a game jam (this one, to be specific: https://itch.io/jam/sandwichs-spoopy-jam-week2), and as such was made under a limited amount of time, and developed between three other college/personal projects. While I am happy with elements of this game, certain aspects leave a lot to be desired (In truth, I'm not all too happy with the sound or animation, but hey, they work well enough). When playing, please bare this in mind, and enjoy :)</p>\n<p>Also, while I remember, some things to keep in mind:</p>\n<p>-The game has no menus, it just starts once you boot the program.</p>\n<p>-The game also closes upon completion.</p>\n<p>-There are no options once in game, so be sure to tweak your system sound settings if the game is too loud.</p>\n<p>-Sound effects and pictures used in the game all belong to their rightful owners. While all meshes and textures were made by myself for the jam (using student licences for Autodesk Maya 2018, and Substance Painter 2018)</p>\n\n<p>(Mac and Linux versions soon to come)</p>", "metacritic": null, "released": "2018-10-15", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/7dd/7dd738c35248262bcb5366a5a594aff1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 161, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["TomRobson"], "genres": [], "publishers": [], "esrb_rating": null}