{"id": 255732, "slug": "real-air-combat-war-airfighters-game", "name": "Real Air Combat War: Airfighters Game", "name_original": "Real Air Combat War: Airfighters Game", "description": "<p>You’re an air force fighter pilot and participating in Real Air Combat War. You’re going to air battle mission and your duty is to eliminate all the fighter aircraft of the enemy. Perform the aerobatics to dodge the enemy air planes. There are many fighter helicopters and thunder jets ready for air attack against you. This air fighter game is a modern flight simulator in all spitfire planes, air combat games. Prove that you’re the real airborne fighter pilot hero of air strike and air combat fighter of all air force games. In Real Air Combat War you’re fully ready to attack on the aircraft carriers, fighter jets, helicopters and all fighter planes of your enemy.<br/><br/>Everyone likes air fighter games and enjoys the fun of air fighter combat using airplane shooting games. This combat flight simulator is a complete war birds and aircraft game. Attack on the enemy’s warplanes with your fighter jet and air fighter thunder plane to finish your air battle mission.Fly your best gunship helicopter for assault air combat war. Huge variety of different air combat fighter jets for brand new battle war missions with different air attack helicopters. Use your flying skill and become a real air attack hero of this passionate air battle.<br/><br/>Real Air Combat War: Airfighters Game Features:<br/>* Wide range of air to air missiles like modern air combat fighter<br/>* Realistic and stunning graphics of war field<br/>*Realistic roaring and thundering sounds of air fighter jets<br/>* Realistic aircraft physics <br/>* Different air fighter jets and gunship helicopters for air combat mission<br/>* Outstanding air combat war missions<br/><br/>In this arcade flying jet fighter game enjoy realistic and stunning war field and battle field environment with amusing thunder air crafts roaring sound effects. Enjoy the thrilling warplane game missions and use wide range of latest missiles for air attack. In Real Air Combat War: Airfighters Game you are fully loaded with ammunition, armors and different missile systems. This air force game has realistic air fighter game physics for air combat war. Choose different fighter jets before going for air attack on enemy aircraft carrier. This is real gunship battle with full of supersonic missiles to finish your enemy.</p>", "metacritic": null, "released": "2018-10-15", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/795/7955d139b231b546c9cc83e3313f7392.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 308, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Apex Logics"], "genres": ["Action"], "publishers": [], "esrb_rating": null}