{"id": 255897, "slug": "the-horus-heresy-legions", "name": "The Horus Heresy: Legions", "name_original": "The Horus Heresy: Legions", "description": "THE GALAXY IS BURNINGBased on the New York Times bestselling novel series, uncover the epic origins of Warhammer 40,000 in <strong>The Horus Heresy: Legions</strong>. The galaxy is in flames after Warmaster Horus turns against his father, the Emperor of Mankind. The Great Crusade to unite all of humanity has exploded into a civil war between the traitors that sided with Horus and those still loyal to the Emperor. At the heart of the conflict are the galaxy’s most fearsome weapons: the Legiones Astartes, genetically enhanced Space Marine armies, clad in the best power armor and wielding the most deadly armament from the Forge Worlds of the Mechanicum. The mighty Astartes will face each other in battle with the fate of the galaxy resting on their shoulders.THE ROAD TO TERRA IS OPENGrab your bolter, board the Thunderhawk… and play cards! <strong>The Horus Heresy: Legions</strong> will take you on an epic journey through one of the richest settings of Warhammer 40,000’s history. Play cards to field troops, execute tactics and embody the heroes and villains of The Horus Heresy. Join a Lodge and plot your way to take over the galaxy with new friends. Make history fighting in time-limited events with game-changing consequences.<br/><br/>With an ever growing collection of hundreds of cards and dozens of Warlords to lead your decks, the path to victory will always shine with new strategies to build powerful decks of unstoppable Space Marines.<br/><br/>Play in Ranked and Friendly modes with your best deck or master Sealed Deck events using cards you might not own yet. Need more practice? Duel any member of your Lodge easily, go solo against the AI, or issue a challenge to any player you know.<br/><br/>Are you ready for this time of reckoning?FEATURES<ul><li> 45+ playable Warlords to collect, each fully voiced and with a unique set of abilities.<br/></li><li> 600+ unique cards. Expand your card collection as new Space Marine Legions from the Warhammer 40,000 lore are added, each with a flavorful card list and strategy.<br/></li><li> 10 Legiones Astartes and 3 neutral factions: Imperial Army, Mechanicum and Chaos. Even more Space Marine legions will join in future expansions.<br/></li><li> Build a deck from your card collection and play in PvP Ranked and Friendly modes, or practice solo against AI opponents.<br/></li><li> Rack up rewards, play with cards you don’t own yet and influence the future of the game in PvP Sealed Deck time-limited events, where two factions compete for one game-changing effect. It could be the choice of abilities for a new card, fighting for the addition of a new Warlord from your favorite Legion, or even deciding which new Legion will be featured in the next expansion!<br/></li><li> Join a Lodge and coordinate with your new friends to master each event, come on top of other Lodges and collect bigger rewards. Discuss strategy and try your decks with other Lodge members. <br/></li><li> Challenge any player and add your friends to know when they’re online to play!<br/></li><li> Cross-platform. Play on PC or mobile sharing your progress.</li></ul>CHOOSE YOUR LEGIONEach Legion has its own play style in tune with their history and key characters:<br/><ul><li> <strong>Sons of Horus</strong>: the Warmaster’s own legion, specializing in decapitating strikes against the enemy warlord.<br/></li><li> <strong>Emperor’s Children</strong>: pursuers of perfection, rewarded with powerful bonuses from playing perfect turns.<br/></li><li> <strong>Death Guard</strong>: masters of attrition and chemical warfare, increasingly corrupted by the Chaos God of Decay to become immortal.<br/></li><li> <strong>World Eaters</strong>: war dogs that do away with the nuances of strategy in favor of fearsome charges and close combat massacres.<br/></li><li> <strong>Iron Hands</strong>: relentless and growing stronger the longer they stay in the field, building up overwhelming momentum that tramples everything in their path.<br/></li><li> <strong>Raven Guard</strong>: guerrilla experts that excel at hit-and-run tactics and stealth operations, emboldened by a thirst of justice against the enemies they sentence to death.<br/></li><li> <strong>Salamanders</strong>: innate survivors, they can overcome punishment that would wipe out other Astartes, and then burn those who dared fight them.<br/></li><li> <strong><strong>Iron Warriors</strong></strong>: tempered and dispassionate, they approach warfare with cold logic and excel in siege warfare, disregarding their own losses as long as victory is achieved.<br/></li><li> <strong>Alpha Legion</strong>: Secrecy is their weapon. It’s hard to tell who you’re fighting, as they all claim to be Alpharius. Watch out, they may have agents in your ranks...<br/></li><li> <strong>Night Lords</strong>: They come unseen and terrorize their opponents so that they can’t fight back.</li></ul><br/>In addition, three Neutral factions provide support for all Legions that want it:<br/><ul><li> <strong>Chaos</strong>: the Chaos Gods are aiding Horus and his allies, but the Loyalists aren’t immune to corruption. The power of chaos, however, can be fatally unwieldy.<br/></li><li> <strong>Imperial Army</strong>: the countless men and women unable to compete against the Astartes in single combat, but who can overwhelm them with sheer numbers and ingenuity.<br/></li><li> <strong>Mechanicum</strong>: seekers of knowledge from the Dark Age of Technology who supply weapons and vehicles, as well as aiding with their own armies and Titan Legions.</li></ul><br/><strong>More Legions will come in future expansions!</strong>", "metacritic": null, "released": "2018-08-03", "tba": false, "updated": "2023-12-07T11:39:57", "background_image": "https://media.rawg.io/media/screenshots/ada/ada4b28eb7ccf70bf47a9ba4415868bc_yRJj281.jpg", "website": "http://www.horusheresylegions.com/", "rating": 2.71, "rating_top": 1, "added_by_status": {"yet": 4, "owned": 255, "dropped": 3, "playing": 1}, "playtime": 1, "achievements_count": 24, "ratings_count": 7, "suggestions_count": 461, "game_series_count": 3, "reviews_count": 7, "platforms": ["iOS", "Android", "PC", "macOS"], "developers": ["Everguild"], "genres": ["Strategy", "Card"], "publishers": ["Everguild"], "esrb_rating": "Teen"}