{"id": 255857, "slug": "scouts-honor", "name": "Scout's Honor", "name_original": "Scout's Honor", "description": "Scout’s Honor is a frenetic couch co-op game for friends and the family where up to four players work as a team to set up camp in the wilderness. The Scout’s tents, campfire and food all need to be sourced from the environment and constructed before time runs out and darkness falls. Throw into the mix some hazards from the natural environmental such as ghost attacks and spike traps and things are sure to get out of hand quickly.<br/><br/>Scout’s Honor captures the childlike innocence of adventure and exploration and mixes with frantic and hectic cooperative gameplay. Work as a team and together achieve the highest rank of \"Dreamer\" Scout!Key Features:<ul><li><strong>Be a Scout</strong> - From the comfort of your couch, you too can be a Scout. Take control of one of four Scouts including: Quintana, Covington, Saffron &amp; Rascal.<br/></li><li><strong>Go Camping</strong> - Use your scouting skills to place \"blueprints\" and utilise tools from your backpack to construct tents and a campfire to set up your campsite.<br/></li><li><strong>Teamwork</strong> - To build your campsite in time, you will need to work as a team. The more teamwork between Scouts, the quicker the job gets done.<br/></li><li><strong>Get Dirty</strong> - Utilise the natural environment which surrounds you to source the items required to build your campsite.<br/></li><li><strong>Hazards</strong> - The natural environmental is also full of many dangers including ghosts, spikey traps, fire and water.</li></ul>Meet The Scouts:<br/><ul><li><strong>Quintana</strong> - Quintana is the Scout Leader at Roaring Pines Scout Camp. She is the eleven year old daughter of high achieving parents. Her mother, a respected surgeon and father, a psychiatrist. As the first born of two girls, Quintana feels a sense of responsibility to protect her little sister. She’s clever and curious and having achieved leadership status in Mensa for Kids, prefers the company of books to frivolous child’s play.<br/></li><li><strong>Covington</strong> - Covington is ten years old and lost his father when he was only five. Coming from a creative family, Covington's father left him with music in his veins. Covington continues to teach himself to play guitar by watching online videos of his favorite bands. He loves excursions and field trips with his fellow Scouts, as he feels a close bond with them and will often serenade them with melodic renditions of his favorite songs.<br/></li><li><strong>Saffron</strong> - Saffron is ten years old and the middle child of seven children. But with her ginger locks and eyes of blue and spirit to match her dazzling appearance she has no trouble standing out amongst the crowd. Living on the expanse of the farm with her six siblings, she is constantly seeking her next adventure and with a freckle to match each of her escapades, she’s unstoppable.<br/></li><li><strong>Rascal</strong> - Rascal is eleven years old and an only child who’s been misunderstood until he was diagnosed with ADHD. His parents had him join the Scouts when he was seven, and as his name suggests he has a tendency to create mischief between his peers. Rascal loves to build and will use any material available to bring his imagination and creations to life. Whether it be sailing through stormy seas on a raft made of driftwood or flying through space with meteorite precision, Rascal leaves those around him in the wake of his creative destruction.</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:52:02", "background_image": "https://media.rawg.io/media/screenshots/6d7/6d7801e2da9a174b3bdde726d2c68568.jpg", "website": "https://www.scoutshonorgame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 363, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["INCA Studios"], "genres": ["Action", "Simulation", "Casual", "Indie"], "publishers": ["INCA Studios"], "esrb_rating": null}