{"id": 255842, "slug": "vambrace-cold-soul", "name": "Vambrace: Cold Soul", "name_original": "Vambrace: Cold Soul", "description": "<p>The King of Shades has cursed the great city of Icenaire. Now cast under a permanent blight of frost fall, its former residents have returned from the dead as mad Wraiths. Survivors take refuge deep underground where they lead a desperate campaign against this unearthly power. Woefully outmatched, they are forced into hiding as the King of Shades amasses an army of the undead above them. One fateful day, a mysterious stranger appears in the city with an enchanted vambrace. She may now be their only hope…<br />\nYou are Evelia Lyric, bearer of the Aetherbrace and the only human capable of entering Icenaire. The survivors now look to you as their best hope against the King of Shades. Only one problem...you’re woefully outmatched, and survival is not guaranteed.<br />\nVambrace: Cold Soul is a narrative-driven game filled with memorable characters, brutal challenges, and deep strategy. To succeed, you must choose perceptive party leaders, camp to recuperate, navigate strange encounters, and survive deadly combat. Will you scavenge for supplies to sell or use them to craft new items for your next expedition? The surface of Icenaire is cold and unforgiving. So, prepare your party well before departing...lest you join the cursed city&#39;s undead.<br />\nIn this game, the difference between life and undeath all comes down to good planning and smart tactics!<br />\nEmbark on an epic fantasy-adventure spanning 7 intriguing chapters.<br />\nComplete sub-quests to unlock up to 26 new, thematic character skins.<br />\nAssemble your party from 5 races and 10 unique classes of recruits.<br />\nCraft items and armor from precious materials gathered on your trips.<br />\nMake crucial decisions where one wrong turn can seal your party&#39;s fate.<br />\nPrepare well well or condemn your comrades to permanent death.<br />\nFind codex pages to expand upon Ethera&#39;s history and mythical lore.</p>", "metacritic": null, "released": "2019-08-28", "tba": false, "updated": "2023-07-21T16:41:51", "background_image": "https://media.rawg.io/media/games/a0d/a0dbc7462cbdc18ee621b8e9448155da.jpg", "website": "http://www.devespressogames.com", "rating": 3.25, "rating_top": 3, "added_by_status": {"yet": 26, "owned": 288, "beaten": 5, "toplay": 14, "dropped": 25, "playing": 4}, "playtime": 6, "achievements_count": 66, "ratings_count": 35, "suggestions_count": 506, "game_series_count": 0, "reviews_count": 36, "platforms": ["Xbox One", "Nintendo Switch", "PC", "macOS", "PlayStation 4", "Linux"], "developers": ["Devespresso Games"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["Headup Games", "Devespresso Games"], "esrb_rating": "Teen"}