{"id": 255821, "slug": "wwe-2k19-digital-deluxe-edition", "name": "WWE 2K19 Digital Deluxe Edition", "name_original": "WWE 2K19 Digital Deluxe Edition", "description": "<p>Enhance your WWE 2K experience and upgrade to the WWE 2K19 Deluxe Edition for Early Access and play four days early! WWE 2K19 arrives as the latest entry to the flagship WWE video game franchise and features cover Superstar AJ Styles. WWE 2K19 will showcase a massive roster of WWE and NXT&#39;s most popular Superstars and Legends! Experience authentic gameplay, tons of creation options, match types, animations and the opportunity to win ONE MILLION DOLLARS*! The Deluxe Edition includes the WWE 2K19 Season Pass and Collector’s Edition digital content.</p>\n<p>He’s the “Master of the 619.” She’s the “Baddest Woman on the Planet.” Pre-order WWE 2K19 to play as both Rey Mysterio and “Rowdy” Ronda Rousey. Never Say Never.</p>\n<p>STUNNING VISUALS<br />\n- Engage in the action through jaw-dropping graphics, heart-pounding excitement and thousands of new gameplay animations that enable you to experience WWE at a premium level.</p>\n<p>MyCAREER<br />\n- Experience high stakes matches, talk smack to your opponents and shape your MyPLAYER’s career path as you strategize your way to WWE glory. An original story voiced by WWE Superstars makes WWE 2K19 the best MyCAREER experience yet!</p>\n<p>THE RETURN OF DANIEL BRYAN!<br />\n- YES! YES! YES! Relive the incredible journey of WWE Superstar Daniel Bryan – from his career-defining moment in the main event of WrestleMania XXX to his heartbreaking retirement to a triumphant return in 2018 – all told through the words of Daniel Bryan. Complete objectives to unlock playable characters, attires and arenas.</p>\n<p>NEW MODE - 2K TOWERS<br />\n- A new way to play – The all new 2K Towers! Take your favorite WWE Superstar or MyPLAYER into any tower with a gauntlet of matches that boast panic-inducing challenges, incredible stipulations, mind-blowing rule changes and dynamic difficulty, presented in ways you’ve never seen before in WWE 2K.</p>\n<p>MASSIVE PLAYABLE ROSTER<br />\n- The WWE 2K19 roster is the biggest yet and loaded with your favorite WWE Superstars, Legends and Hall of Famers alongside your NXT favorites! Play as the WWE Superstars of today, such as AJ Styles, Brock Lesnar, Seth Rollins, Braun Strowman or Shinsuke Nakamura, as well as the legendary “Stone Cold” Steve Austin, The Rock, André the Giant and more! With more than 200 playable WWE Superstars, the amount of dream matches you can create is nearly unlimited!</p>\n<p>[Deluxe Only] EXTENSIVE BONUS CONTENT!<br />\n- The WWE 2K19 Deluxe Edition includes all WWE 2K19 Season Pass downloadable content, as well as bonus digital content from the Ric Flair “Wooooo!” Edition. In addition, enter the ring to compete with pre-order characters “Rowdy” Ronda Rousey and Rey Mysterio!</p>", "metacritic": null, "released": "2018-10-05", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/07e/07e7819b33f0a6d6a203df6094335ed6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 56, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "PlayStation 4", "Xbox One"], "developers": ["Visual Concepts", "Yuke's Co"], "genres": ["Sports", "Fighting"], "publishers": ["2K Games"], "esrb_rating": "Teen"}