{"id": 25586, "slug": "samba-de-amigo", "name": "Samba De Amigo", "name_original": "Samba De Amigo", "description": "<p>\n      The samba-inspired rhythm music game made popular in the arcades is \n      shaking its way onto the Wii! Keeping the beat with over 40 songs on a \n      Samba-inspired sound track, players shake the Wii Remote and Nunchuk \n      like maracas and compete with friends to see who has the best moves. \n      Throughout the dynamic songs there will be opportunities to strike a \n      pose for extra points. Friends and family will be thoroughly entertained \n      cheering each other on as they anxiously await their next turn.\n    </p><p>\n      Features:\n    </p><ul>\n<li>\n        A Brand New Dual Wii Remote Control Option gives players’ untethered, \n        maraca-shaking freedom with two remotes or the Wii Remote and Nunchuck.\n      </li>\n<li>\n        Fun for Two Players in competitive or cooperative multiplayer modes, \n        including Love Love mode where two players synch up their moves to \n        earn points and test their compatibility.\n      </li>\n<li>\n        The Samba-infused Soundtrack features over 40 upbeat, festive \n        favorites from the original game, plus many new tunes.\n      </li>\n<li>\n        Online Leaderboards and Friends Lists let players post their best \n        scores and compare them to their friends’ scores.\n      </li>\n<li>\n        Multiple Game Modes include Career, Single Player, Multiplayer, \n        Training and Records.\n      </li>\n<li>\n        Special Modes expand gameplay with Quick Play, Classic, Battle, \n        Survival, Hustle and Mini-games.\n      </li>\n</ul><p>\n      In-game content available for purchase using stored account funds.\n    </p><p>\n      As of May 20, 2014, the Nintendo Wi-Fi Connection service for Nintendo \n      DSi and Wii systems has been retired. Online features of this game are \n      no longer available after this date but this game still provides an \n      entertaining experience in offline mode.\n    </p><p>\n      To learn more about this service change, please visit To learn more \n      about this service change, please visit support.nintendo.com/servicesupdate.\n    </p>", "metacritic": null, "released": "2008-09-23", "tba": false, "updated": "2019-09-08T04:34:48", "background_image": "https://media.rawg.io/media/screenshots/88b/88b88d6c4a7d216f88a38394dc5841dc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 4, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 114, "game_series_count": 0, "reviews_count": 0, "platforms": ["Wii"], "developers": [], "genres": [], "publishers": ["SEGA"], "esrb_rating": null}