{"id": 255848, "slug": "zquirrels-jump", "name": "Zquirrels Jump", "name_original": "Zquirrels Jump", "description": "Zquirrels need your help! Become one of the best jumpers and save the day with your awesome skills. Zquirrel Jump is a hardcore arcade game for people ready to bruise their fingers. Or speedrunners, because they will feel at home.<br/><br/> But what does it mean to “save the day” in Zquirrels’ world? It means, save as many nuts as you can before they hit the ground. Obviously. Because there is no worse thing in the world than nuts hitting ground.<br/><br/><strong>Key Features:</strong><br/><ul><li>40 unique levels made by not random generated people called level designers<br/></li><li>7 skills which will make you accomplish something unimaginable<br/></li><li>A bunch of skins for your Zquirrels and their parachutes<br/></li><li>5 biomes, because every good game needs a lava level<br/></li><li>3-star scale to tell you how bad was your run<br/></li><li>22 comics about Zquirrels, because you somehow have to get to know their story<br/></li><li>A few Achievements and Steam Workshop, like in any other new game on Steam!<br/></li><li>User-friendly level editor, because don’t we all love to create?<br/></li><li>No microtransactions, you will have to gain every little skin in the game with an effort<br/></li><li>Babymode for all of the “casual players”<br/></li><li>And parachutes! It’s a key feature because without a parachute you would probably fall and die</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:52:03", "background_image": "https://media.rawg.io/media/screenshots/d57/d5700c1d963a4f0e27af062782bb3478.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 6, "ratings_count": 0, "suggestions_count": 192, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Artists Entertainment", "Nutty Wizards"], "genres": ["Action", "Racing", "Indie"], "publishers": ["Artists Entertainment"], "esrb_rating": null}