{"id": 255987, "slug": "dungeon-hunter-champions", "name": "Dungeon Hunter Champions", "name_original": "Dungeon Hunter Champions", "description": "You are an Invoker, a being with godlike cosmic powers and the ability to summon powerful Champions to fight in your name. <br/><br/>For eons, Invokers and their Champions have battled in the Eternal Contest, a magical competition that exists between the Realms of the Multiverse. However, a dark new force has appeared and is spreading a corruption through the Eternal Contest, twisting its magic and threatening the stability of the Mortal Realms. <br/><br/>Rally your Champions, discover the cause of the corruption, and fight to save the Multiverse from the greatest threat it has ever known!A CROSS PLATFORM HACK ‘N’ SLASH<br/><strong>DUNGEON HUNTER CHAMPIONS</strong> lets you switch between PC and Mobile devices without any restrictions to take your fight against the corruption of the multiverse anywhere. With control schemes suited for each platform (Keyboard &amp; Mouse, Gamepad or Touch), join one global community and clash with your enemies whenever you want!COMPETITIVE 5V5 MODE<br/><br/>A little competition never hurt anyone, right? Take a break from saving the world and master the 5v5 PVP mode to dominate the leaderboards and reap the best rewards. And of course brag about it.5-PLAYERS CO-OP BOSS BATTLES<br/><br/>Team-up with Friends and Guildmates to challenge the Biggest &amp; Baddest Boss Monsters of the Multiverse. <strong>DUNGEON HUNTER CHAMPIONS</strong> offers full co-op and cross platform battles where communication and coordination are key to prevail.NEW CHAMPIONS EVERY MONTH<br/><br/>In case the base pool of 250+ Champions is not enough for you, new characters with unique playstyles and skills are added every month. With new combos and theorycrafting possibilities, you have total freedom to build the ultimate team.25 vs 25 PLAYERS GUILD WARSForm a Guild, recruit members, prepare a plan, carry out your strategy, and invade the enemy Guild Hall. May your Guild banner fly high all across the Multiverse.<br/><br/><br/>", "metacritic": null, "released": "2018-05-02", "tba": false, "updated": "2019-08-28T21:52:00", "background_image": "https://media.rawg.io/media/screenshots/c19/c196c266ab83d457cbe89fb246311eb8.jpg", "website": "http://www.gameloft.com", "rating": 2.33, "rating_top": 1, "added_by_status": {"yet": 2, "owned": 132, "beaten": 1, "toplay": 1, "dropped": 4, "playing": 1}, "playtime": 1, "achievements_count": 10, "ratings_count": 9, "suggestions_count": 532, "game_series_count": 0, "reviews_count": 9, "platforms": ["PC", "iOS"], "developers": ["Gameloft"], "genres": ["Action", "Adventure", "RPG"], "publishers": ["Gameloft"], "esrb_rating": "Teen"}