{"id": 255924, "slug": "green-riding-hood-read-aloud", "name": "Green Riding Hood: Read Aloud", "name_original": "Green Riding Hood: Read Aloud", "description": "* \"Free App of the Week\" in 2017<br/>* iPad App of the Year 2015 (Best of App Store, Russia)<br/>* Winner of the “Rating of Runet 2016” contest in “Leisure, Entertainment, Shopping” nomination<br/>* “Interactive Book of the Year 2015” nominee at Moscow International Book Fair<br/><br/>\"Green Riding Hood\" is not just a new masterpiece mobile app for kids. It is a wonderful digital kindergarten, which in a playful form lets your children get acquainted with the importance of being fit and healthy, of spending more time outdoors with friends and of course eating enough fresh fruits and vegetables.<br/><br/>The core of the app is a cheerful fairy tale with the central themes of friendship, yoga and the idea of living healthily — a beautifully drawn and animated story about a little girl, her Grandma, their animal friends and a hungry Wolf. But don't be afraid. In this spinoff of the famous classic fairy tale by Charles Perrault and Brothers Grimm the Wolf won't have to eat anyone.<br/><br/>The first chapter that started our story is available inside the app for free. In addition you will find other pieces of interactive content that are either free of charge or become available via in-app purchases. At the moment Green Riding Hood contains: <br/><br/>* First Chapter of the fairy tale.<br/>* Gramdma’s Cooking Book of tasty and healthy recipes. <br/>* A set of morning exercises designed by Wolf himself.<br/>* A terrific dance class with Green Riding Hood.<br/>* Gramdma’s Yoga asana set.<br/>* iMessage app with a pack of animated stickers made after our beloved characters.<br/><br/>The content is updated and extended on a periodical basis. The app is translated on 11 languages, and the voiceover narrations are recorded by guest-star actors, videobloggers and radio hosts from all around the world.<br/><br/>Download Green Riding Hood right now and have fun with your kids playing mini-games and studying Grandma's cooking recipes!<br/><br/>The app features:<br/><br/>* BEAUTIFUL GRAPHICS AND GREAT ANIMATIONS made by the team led by an award winning illustrator Andrey Gordeev whose portfolio includes Cannes Lion and ADC Global awards.<br/><br/>* CUTE CHARACTERS that will make your family have a hearty laugh!<br/><br/>* FUN MINIGAMES that will cheer up and entertain kids and adults alike.<br/><br/>* USEFUL SETS OF DAILY EXERCISES so that you can do them with your children to get fit and healthy together with your kids’ favourite characters.<br/><br/>* GRANDMA’S COOKING BOOK with plenty of recipes for a healthy and balanced diet.<br/><br/>* EXCELLENT VOICEOVER recorded by guest-star actors, videobloggers and radio hosts from all around the world.<br/><br/>Download Green Riding Hood and enjoy its beautiful graphics, cute characters, bright story and excellent narration! <br/><br/>Green Riding Hood is a great opportunity to spend good time and have a laugh. If friendship, yoga, sports and healthy lifestyle are thing you want your children to get acquainted with, then you are welcome!<br/><br/>The app contains the following subscription options:<br/>- Monthly for $9.99 USD with a 3-day free trial period<br/>- 6-Month Subscription $29.99<br/>- Free trial subscription is automatically renewed unless cancelled 24 hours before the renewal<br/>- Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that publication<br/>- Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user's Account Settings after purchase<br/> - Payment will be charged to iTunes Account at confirmation of purchase<br/> - Account will be charged for renewal within 24-hours prior to the end of the current period, and identify the cost of the renewal<br/><br/>Privacy Policy: http://huracanapps.com/privacy.html<br/>Terms of Service: http://huracanapps.com/terms.html", "metacritic": null, "released": "2015-05-21", "tba": false, "updated": "2019-10-22T14:10:05", "background_image": "https://media.rawg.io/media/screenshots/037/03755425d81a7ad0be923d4ed7b9227c_otxVeqa.jpg", "website": "http://huracanapps.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 163, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Huracan Apps"], "genres": ["Adventure", "Family"], "publishers": ["Huracan Apps"], "esrb_rating": "Everyone 10+"}