{"id": 255915, "slug": "pixelly-color-by-number-pic", "name": "Pixel.ly - Color by Number Pic", "name_original": "Pixel.ly - Color by Number Pic", "description": "Pixel.ly makes creating modern masterpieces of digital art simpler than ever!<br/><br/>Enjoy the art of true coloring. It really makes time fly!<br/><br/>===== Features:<br/>• Easily color any image and wait for the surprise in the end!<br/>• Share with friends on social media.<br/>• Family-friendly content: coloring for all ages.<br/>• Perfect relaxing activity.<br/><br/>Happy coloring!<br/><br/>===== Pixel.ly Plus Subscription<br/>- With Pixel.ly Plus Subscription you can subscribe for daily new picture updates and unlimited access to the full picture catalog.<br/>- You'll be able to access all available pictures and receive daily updates for the duration of your subscription.<br/>- The subscriptions are $2.99 USD weekly, $7.99 USD monthly and $29.99 USD annually or equal to the same price tier that \"Apple's App Store Matrix\" determines in other currencies.<br/>- Payment will be charged to iTunes Account at confirmation of purchase<br/>- Subscription automatically renews for the same price and duration period as the original \"one week\"/\"one month\"/\"one year\" package unless auto-renew is turned off at least 24-hours before the end of the current period<br/>- Account will be charged for renewal within 24-hours prior to the end of the current period at the cost of the chosen package (weekly, monthly or yearly package)<br/>- Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user's iTunes Account Settings after purchase<br/>- No cancellation of the current subscription is allowed during active subscription period<br/>- You may cancel a subscription during its free trial period via the subscription setting through your iTunes account. This must be done 24 hours before the end of the subscription period to avoid being charged. Please visit http://support.apple.com/kb/ht4098 for more information<br/>- You may turn off the auto-renewal of your subscription via your iTunes Account Settings. However, you are not able to cancel the current subscription during its active period<br/>- Any unused portion of a free-trial period, will be forfeited when the user purchases a PixelDoodle Plus subscription<br/><br/>===== Terms of Service and Privacy Policy<br/>Privacy Policy: http://www.yiqux.com/privacy-policy<br/>Terms of Use: http://www.yiqux.com/terms", "metacritic": null, "released": "2018-01-08", "tba": false, "updated": "2019-10-22T14:10:05", "background_image": "https://media.rawg.io/media/screenshots/e15/e1520eeff053d621766556e5b1d09565_hWqkL4q.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 78, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["daiguo zhou"], "genres": [], "publishers": ["daiguo zhou"], "esrb_rating": "Everyone 10+"}