{"id": 256007, "slug": "jumpy-jack-mighty-hero-survive-pesky-birds", "name": "Jumpy Jack - Mighty Hero Survive Pesky Birds", "name_original": "Jumpy Jack - Mighty Hero Survive Pesky Birds", "description": "JOIN THE JUMPY JACK IN HIS BIGGEST ADVENTURE YET!<br/>Test your abilities and immerse yourself into 8 diverse levels of Jumpy Jack universe.\u2028 Jump from rock to rock, over the rifts, avoid those wild birds or pop them, watch out of those nasty bombs! Bombs can stop any hero, even as mighty as Jumpy Jack. Try to survive, as birds are get more angry, they are raging because they are defending their kingdom, their stone castle! You will meet angry parrot also - but wait - they are not bad at all! They are your friends, but anyway, you have to watch out, they are big, heavy, with dangerous beak. If you get lucky, you will get extra life from parrot. Main challenge is to stay on rocks after all! You will not find any other animals there, as only those pesky birds reigns over the canyons, they are kings of rocks.<br/>Jumping Jack features challenging physics-based gameplay and hours of fun and adventures if you get successful. You will need logic, skill and force to get ahead.<br/>COMPETE WITH FRIENDS!<br/>Try to beat your own score or compete with your friends and people all over the globe. Check the leaderboard and let's see who will be the king of the hills!<br/>So what are you waiting for, download it now and see you on the rocks!", "metacritic": null, "released": "2017-01-27", "tba": false, "updated": "2019-10-22T14:10:09", "background_image": "https://media.rawg.io/media/screenshots/6cf/6cfb7ebbd74d9149438cf0f0efc841c1_inrucsa.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 108, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["Juris Pukis"], "genres": ["Action", "Arcade"], "publishers": ["Juris Pukis"], "esrb_rating": "Everyone 10+"}