{"id": 2560, "slug": "mega-man-mobile", "name": "MEGA MAN MOBILE", "name_original": "MEGA MAN MOBILE", "description": "Play a piece of gaming history with the original Mega Man, the action-packed classic platformer!<br/><br/>In the year 200X, six robots created by master roboticist Dr. Light are tampered with by the evil genius Dr. Wily, and go on a destructive rampage! <br/>Only one robot remains who can put a stop to Wily’s plans and restore world peace: the heroic Mega Man.<br/><br/>[Caution]<br/>------------------------------------------------------------------------------- <br/>・The gameplay and difficulty of this version have been optimized for smartphones,<br/>so certain elements will differ from the original game.<br/>------------------------------------------------------------------------------- <br/><br/>◆What is Mega Man?<br/><br/>The original Mega Man captivated users at the time of its release<br/>with its challenging gameplay and innovative concept of taking<br/>the weapons from your enemies, then using them to exploit weaknesses in the bad guys yet to come.<br/><br/><br/>◆Modes<br/>This version features a choice of two difficulty modes.<br/><br/>・Normal Mode<br/>Unlimited continues.<br/>The continue screen is displayed whenever Mega Man dies.<br/>Selecting continue allows you to restart from the last <br/>checkpoint you passed in the current stage.<br/><br/>・Hard Mode<br/>This challenging mode limits your number of continues, <br/>and enemy attacks deal more damage.<br/>There are also fewer checkpoints within stages.<br/><br/>◆Options<br/>The following settings can be adjusted in-game.<br/><br/>・Sound<br/>Increase the number to raise the volume.<br/><br/>・Vibration<br/>Set to \"On\" to have your device vibrate when Mega Man takes damage.<br/>(Default setting: On)<br/>Note: This option will not be displayed on devices with no vibration function.<br/><br/>・Attack<br/>Auto: Hold the attack button for rapid-fire Mega Buster shots.<br/>Manual: Each press of the attack button fires one Mega Buster shot. <br/>Tap repeatedly for rapid-fire shots.<br/>(Default setting: Auto)<br/><br/>・Speed<br/>Choose between Normal and High to adjust gameplay speed.<br/><br/>・Key Config<br/>Change position of the in-game attack button and jump button.<br/><br/>◆Gameplay Tips<br/>Search Elec Man’s stage for the Magnet Beam, which lets you place platforms wherever you like!<br/><br/>To access the Magnet Beam, you’ll need to defeat Guts Man and get his weapon, or defeat Elec Man and play through the stage again with his weapon.", "metacritic": null, "released": "2017-01-05", "tba": false, "updated": "2019-07-30T21:29:24", "background_image": "https://media.rawg.io/media/screenshots/d55/d55a2761931504dc6dfb85b6f574de4c.jpg", "website": "http://www.us.capcommobile.com/mega-man", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "beaten": 1, "toplay": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 99, "game_series_count": 0, "reviews_count": 1, "platforms": ["Android", "iOS"], "developers": ["Capcom"], "genres": ["Action", "Adventure"], "publishers": ["Capcom"], "esrb_rating": null}