{"id": 256060, "slug": "maggies-murder-mystery", "name": "Maggie's Murder Mystery", "name_original": "Maggie's Murder Mystery", "description": "Unravel a string of mysteries in an exciting new binge-worthy, “TV Style” episodic Match-3, crime drama: Maggie’s Murder Mystery! Beat fun Match-3 levels and mini-games to solve intriguing crimes in the swinging forties!<br/><br/>Settle in and embark on exciting adventures of Phillies best detective, Maggie McAvery! Along with her bookish grandson Leo, and a fiery assistant Heloise, help Maggie uncover a shocking conspiracy aboard the cruise ship, Charmed Life. Travel to exotic destinations, outwit wicked villains, solve complex crimes, and rediscover old romances in this enthralling crime mystery!<br/><br/><br/>A BINGE WORTHY EPISODIC CRIME STORY WITH A MATCH-3 GAMEPLAY<br/>— Play through “TV Style” episodes and seasons of match-3 levels and mini-games to untangle a twisted conspiracy and unmask an unexpected villain! Experience a brand new dialogue and character heavy, story-driven gameplay as you’ve never experienced before!<br/><br/>MORE THAN A MATCH-3 GAME<br/>— Complete exciting puzzles and discover an enthralling storyline! Investigate crime scenes by looking for hidden objects, comparing crime photos, cross-examining suspects to solve murders and crimes!<br/><br/>BIG CAST OF INTRIGUING CHARACTERS<br/>— Join Maggie, Leo, and Heloise through crime-filled episodes and meet evil geniuses, goofy bystanders, unlucky victims, and intriguing heroes! Follow different story plots and learn what makes these unique characters tick!<br/><br/>EXPLORE THE WORLD<br/>— Travel in a luxurious cruise ship, Charmed Life, to the most beautiful and exotic places around the world -  from lavish and extravagant metropolitan cities to the wild and dangerous hidden islands and jungles!<br/><br/>CONSTANTLY UPDATED NEW EPISODES<br/>— Just like in a TV Show, we will constantly release new episodes with each one containing a unique crime story! Our game will turn into your new favorite TV crime series!<br/><br/>A FACEBOOK COMMUNITY OF MYSTERY SEEKERS<br/>— Join our Facebook community to keep up with the news, find new game friends and share your progress! Let’s figure out who is the best murder mystery detective!<br/><br/>No time to wait! Just hit the “Install” button to start your grand adventure!<br/><br/>In case you have any issues, questions or concerns please e-mail us at support@zimad.com.", "metacritic": null, "released": "2018-10-21", "tba": false, "updated": "2019-07-29T16:39:57", "background_image": "https://media.rawg.io/media/screenshots/64e/64e4a9e998597035d734b28dee2d57a1_smt3Zpp.jpg", "website": "https://zimad.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 324, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["ZiMAD"], "genres": ["Arcade", "Casual", "Puzzle"], "publishers": ["XIMAD"], "esrb_rating": null}