{"id": 256127, "slug": "othello-hd", "name": "Othello ++ HD", "name_original": "Othello ++ HD", "description": "Othello, a game that few minutes to learn and whole life to master. <br/><br/>Othello is a classic game, especially popular in Japan and Western countries. Easy to learn since the rule is simple, but changing unexpectedly. You can take this Othello ++ HD with you wherever you go since we offer the iPad version. <br/><br/><br/><br/>Rules: <br/><br/>Othello has another name - reversi. This game is played on an 8x8 board with 64 identical pieces. Two players take turns to play. The player's goal is to turn the opponent's disks into himself. The player with the most pieces on the board at the end of the game wins. <br/><br/><br/><br/>Features: <br/><br/>1. Three levels: Easy, Med and Hard, meeting needs of all players. <br/><br/>2. Undo function. <br/><br/>3. Enable to load game progress.Auto-save when exit or phone ring. <br/><br/>4. Challenging computer or play with your friend on the same device, can also play against a friend via bluetooth on two devices. <br/><br/>5. In Game Center, free to play with friends or anyone online. <br/><br/>6. Excellent user interface and exciting sound effects. <br/><br/><br/>With intuitive user interface and vivid animation graphics, this game is a best for you to improve skill for Othello! <br/><br/>************************************************* <br/><br/>Dear players, your comments are very useful for us, which help us to improve and offer you better user experience! Please feedback us any suggestion! <br/><br/><br/>Fatbird also brings you other games: Ludo, Mancala, Checkers, Tic Tac Toe, Gomoku, Dots, 4 in a Row, Chess, Backgammon <br/><br/><br/>***********************************<br/>If you love FatBird Games, please:<br/>Like us on Facebook: https://www.facebook.com/FatBirdGames<br/>Follow us on Twitter: @FatBirdGames", "metacritic": null, "released": "2012-01-11", "tba": false, "updated": "2019-10-22T14:10:15", "background_image": "https://media.rawg.io/media/screenshots/949/94902d4215ba89588af28db2beef84e4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 65, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Fat Bird Games"], "genres": ["Board Games", "Card"], "publishers": ["Richard Lee"], "esrb_rating": "Everyone 10+"}