{"id": 256123, "slug": "chess-deluxe-hd", "name": "Chess - Deluxe HD", "name_original": "Chess - Deluxe HD", "description": "Since Chess is one of the world's most popular games, you cannot miss Chess - Deluxe HD, it must be your favorite soon! <br/><br/>Chess - Deluxe HD supports 1 and 2 player mode, you may challenge both the AI computer and your friends. Chess is one of the greatest game, it is your best choice so far if you really want to get fun and learn something. <br/><br/><br/>*Features* <br/><br/>1. Three levels of play, meeting needs of all players. <br/><br/>2. Play against a nearby player via Bluetooth or your friend on the same device with Two Players mode.<br/><br/>3. Enable to save game progress and load it next time. <br/><br/>4. Can tick to show possible moves. <br/><br/>5. Move-clock function. <br/><br/>6. Great visual effect and exciting sound effects. <br/><br/>7. Retina display high resolution. <br/><br/><br/><br/>*Rules* <br/><br/>In different countries, Chess owns different names: xiangqi (China), shogi (Japan), janggi (Korea), makruk (Thailand) and variant like Chess960. Although they are different in names, they share almost the same rules with western chess. <br/><br/>Each player begins the game with sixteen pieces: one king, one queen, two rooks, two knights, two bishops, and eight pawns, each piece moving differently. Pieces are used to attack and capture the opponent's pieces. The object of the game is to 'checkmate' the opponent's king by placing it under an inescapable threat of capture. In addition to checkmate, the game can be won by the voluntary resignation of one's opponent, which may occur when too much material is lost, or if checkmate appears unavoidable. <br/><br/><br/>********************************************************** <br/><br/>Fatbird is greatly honoured to bring you Chess - Deluxe HD and will continue to add new features, please don’t hesitate to rate us, we love to see your support and suggestion! <br/><br/><br/>Fatbird also brings you other games: Ludo, Mancala, Checkers, Tic Tac Toe, Gomoku, Dots, Othello, 4 in a Row, Backgammon<br/><br/><br/>***********************************<br/>If you love FatBird Games, please:<br/>Like us on Facebook: https://www.facebook.com/FatBirdGames<br/>Follow us on Twitter: @FatBirdGames", "metacritic": null, "released": "2011-05-24", "tba": false, "updated": "2019-10-22T14:10:15", "background_image": "https://media.rawg.io/media/screenshots/072/072206e061ab31fe343592dc6ac6a57f.jpg", "website": "http://www.fatbirdgames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 78, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Fat Bird Games"], "genres": ["Board Games", "Card"], "publishers": ["Richard Lee"], "esrb_rating": "Everyone 10+"}