{"id": 256133, "slug": "checkers-deluxe", "name": "Checkers - Deluxe", "name_original": "Checkers - Deluxe", "description": "Checkers is a challenging board game that easy to learn but hard to master. <br/><br/><br/>Checkers is played on an eight-by-eight squared board (with sixty-four total squares) with twelve pieces on each side. Checkers - Deluxe supports both 1 player and 2 player gameplay, so you can play checkers with the AI computer or a friend on your iPhone &amp; iPod touch. <br/><br/><br/>*Features* <br/><br/>1. Three levels, meeting needs of all players. <br/><br/>2. Play against a nearby player via Bluetooth or your friend on the same device with Two Players mode.<br/><br/>3. Enable to save game progress and load it next time. <br/> <br/>4. Forced-jumps function. <br/><br/>5. Support iPhone Retina, better visual effect. <br/><br/>6. Great graphics and exciting sound effects. <br/><br/><br/>*Rules* <br/><br/>Checkers, or draughts, can be divided into American Checkers and English Draughts, but the rule is alomost same. <br/>Two players take turn to move. A simple move involves sliding a piece one space diagonally forwards to an adjacent unoccupied dark square. If a player's piece moves into the kings row on the opposing player's side of the board, becoming a king and can move both forwards and backwards. The opponent's pieces are caputured by jumping over them. A player wins by capturing all of the opposing player's pieces or by leaving the opposing player with no legal moves. <br/><br/><br/>******************************************************* <br/><br/>Fatbird is greatly honoured to bring you Checkers - Deluxe and will continue to add new features, please don’t hesitate to rate us, we love to see your support and suggestion! <br/><br/><br/>Fatbird also brings you other games: Ludo, Mancala, Tic Tac Toe, Gomoku, Dots, Othello, 4 in a Row Chess, Backgammon<br/><br/><br/>***********************************<br/>If you love FatBird Games, please:<br/>Like us on Facebook: https://www.facebook.com/FatBirdGames<br/>Follow us on Twitter: @FatBirdGames", "metacritic": null, "released": "2011-05-24", "tba": false, "updated": "2019-10-22T14:09:53", "background_image": "https://media.rawg.io/media/screenshots/465/465138bbeb7956d4da15352c3ec320b0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 71, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Fat Bird Games"], "genres": ["Board Games", "Card"], "publishers": ["Richard Lee"], "esrb_rating": "Everyone 10+"}