{"id": 256139, "slug": "king-solitaire-klondike", "name": "King Solitaire - Klondike", "name_original": "King Solitaire - Klondike", "description": "The definitive solitaire app is here! Introducing King Solitaire!<br/><br/>Solitaire (a.k.a. Klondike), that game we all know and love from our PCs, is now available.<br/><br/>- \"Solitaire\" is a term referring to a family of single-player \"patience\" games.<br/>- The solitaire variant that comes standard with the Windows OS is also known as Klondike.\"<br/><br/>This marks our third solitaire app, and we've poured a whopping 4 years of experience into bringing you a true digital masterpiece!<br/><br/>- You'll find the smooth, responsive control of the smash hit Solitaire Victory here!<br/>- For fans of Princess*Solitaire, the visuals are customizable! Switch up the look to suit your mood!<br/>- New features, themes, and options!<br/>- We've made major improvements for this Klondike-only release! Jump into an even better, immersive gaming experience!<br/>- Get your hands on this stellar solitaire app FREE!\"<br/><br/>Check out King Solitaire now!<br/><br/>King Solitaire is loaded with fun features! Read on for details!<br/><br/>6 different modes, with up to 10 possible gameplay patterns if you include dealing options!<br/><br/>- Choose from a variety of gameplay options, including cards drawn (Draw 1, Draw 3)!<br/>- Scoring includes both standard and Vegas (cumulative-style) types.<br/>- You can also try your hand at Double Klondike, using 2 decks!<br/>- Choose from standard dealing or the special option Winnable Deal (available for standard scoring only)<br/><br/>Our experience shows in the tight controls!<br/><br/>- Responsive controls are optimized for your touchscreen! Intuitive tap and drag controls help you keep cards moving at a brisk pace.<br/>- Layouts are optimized to fit the screen of your device,whatever it may be!<br/><br/>Customize the display to fit your play style!<br/><br/>- Choose from portrait or landscape orientations.<br/>- An optimized screen design offers a plethora of options for controls and how the device is held.<br/>- Toggle screen rotation (on/off, fixed portrait, fixed landscape).<br/><br/>Standard:<br/>Play using the index finger of your dominant hand while holding the device with your other hand (or setting it down). Works well with both portrait and landscape orientations.<br/><br/>One-Hand:<br/>Play using the thumb of the hand holding your device. Works best with the portrait view.<br/><br/>Gamer:<br/>Hold your device with both hands and play using both thumbs. Works best with the landscape view.<br/><br/>Individual elements of the gameplay screen can be moved around too! Choose the layout that suits you best!<br/><br/>- Specify your dominant hand and toggle the location of the stock (left/right)!<br/>- Portrait and landscape orientations each include 3 different layouts to choose from!<br/>- You can alter the size of the vertical intervals in tableaus, as well as the positioning of the foundations and stock!<br/>- Move the toolbar around via the Options screen!<br/><br/>Having trouble winning? Try the Winnable Deal!<br/><br/>- While skill is a big factor, luck of the draw is also key.<br/>- Under standard rules you're dealt cards randomly, sometimes resulting in games impossible to win.<br/>- The Winnable Deal option, however, deals cards for a game that has been verified to be winnable!<br/><br/>New themes and designs abound! Customize as you please!<br/><br/>- 5 types of card fronts, 12 different card backs, and 12 backgrounds provide virtually endless combinations!<br/>- You can use your own images for card backs and backgrounds via your device's Camera Roll!<br/>- Randomize card backs and backgrounds if you like surprises!<br/><br/>This app is bursting with features to play your way!<br/><br/>- Step up and beat your personal best if you're looking for a challenge! The game keeps track of your stats and high scores via My Records!<br/>- Itching to show your buddies who's boss? Beat your friends and post your score on Facebook, Twitter, or LINE for sweet satisfaction!<br/>- See how you measure up against players around the globe via the World Ranking chart!<br/><br/>And that's not all! Other features include:<br/><br/>- Auto-saving when your game is interrupted<br/><br/>Don't miss the definitive solitaire experience!", "metacritic": null, "released": "2013-09-24", "tba": false, "updated": "2019-10-22T14:10:16", "background_image": "https://media.rawg.io/media/screenshots/39c/39ce14cb6c5f6c1720a66b542cfc644a.jpg", "website": "http://www.pro-japan.co.jp/sp/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 115, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["P.R.O Corp"], "genres": ["Board Games", "Card"], "publishers": ["P.R.O"], "esrb_rating": "Everyone 10+"}