{"id": 256167, "slug": "dots-and-boxes-deluxe", "name": "Dots and Boxes - Deluxe", "name_original": "Dots and Boxes - Deluxe", "description": "Dots and boxes is a pencil and paper game for two players (or sometimes, more than two) first published in 1889 by Édouard Lucas, and later developed into board games. Fatbird offers you a deluxe style dots, you may have a try now!<br/><br/><br/>*Features*<br/> <br/>1. Three levels of play, meeting needs of all players. <br/><br/>2. Play against a nearby player via Bluetooth or your friend on the same device with Two Players mode.<br/><br/>3. Enable to save game progress and load it next time.<br/> <br/>4. Great visual effect and exciting sound effects.<br/><br/><br/>*Rules* <br/><br/>Although this game is very simple, it has many different names: boxes,dots and boxes,dot boxing,squares,paddocks,square-it,dots and dashes,smart dots.<br/><br/>In this game, starting with an empty grid of dots, players take turns, adding a single horizontal or vertical line between two unjoined adjacent dots. A player who completes the fourth side of a 1×1 box earns one point and takes another turn. (The points are typically recorded by placing in the box an identifying mark of the player, such as an initial). The game ends when no more lines can be placed. The winner of the game is the player with the most points.<br/><br/><br/>******************************************************<br/><br/>Fatbird is greatly honoured to bring you Dots - Deluxe and will continue to add new features, please don’t hesitate to rate us, we love to see your support and suggestion!<br/><br/><br/>Fatbird also brings you other games: Ludo, Mancala, Checkers, Tic Tac Toe, Gomoku, Othello, 4 in a Row, Chess, Backgammon<br/><br/><br/>***********************************<br/>If you love FatBird Games, please:<br/>Like us on Facebook: https://www.facebook.com/FatBirdGames<br/>Follow us on Twitter: @FatBirdGames", "metacritic": null, "released": "2016-06-07", "tba": false, "updated": "2019-10-22T14:10:17", "background_image": "https://media.rawg.io/media/screenshots/3af/3af778f793e4409d09537a1c4d7cdb5d.jpg", "website": "http://www.fatbirdgames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 74, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Fat Bird Games"], "genres": ["Board Games", "Family"], "publishers": ["Richard Lee"], "esrb_rating": "Everyone 10+"}