{"id": 256103, "slug": "arimaa-trainer", "name": "Arimaa Trainer", "name_original": "Arimaa Trainer", "description": "Arimaa is one of the fastest growing modern strategy games. Rules are simple and intuitive enough for kids to play easily, yet there is more than enough strategic depth to satisfy the most demanding gamer. If you enjoy challenging games like Chess, Checkers, Go, or Shogi, discover Arimaa and see why it was chosen in the Discovery Channel's list of the Top 10 Mind-bending Strategy Games and also recommended by Scientific American MIND magazine.<br/><br/>“The rules are simple enough for kids to learn, and the game was creative and engaging.” <br/>—Frederik Joelving; Scientific American Mind magazine<br/><br/>With millions of opening setups to choose from, every game requires creative thinking right from the beginning and no need to memorize openings. It's a never ending puzzle, each game is different. In just the first 10 moves of Arimaa there's more possible games than there are atoms in our universe.<br/><br/>“Because the number of possible moves in an Arimaa position (roughly 20,000) is much higher than in chess (about 30 or so), even the fastest computers will not be able to search very far into the tree of possibilities.” <br/>—R. Wayne Schmittberger; GAMES magazine<br/><br/>Arimaa provides the whole family a chance to show the computer who's boss. Many games boast of the strength of their computer AI, but Arimaa requires a higher level of intelligence which humans possess and computers have yet to achieve. In fact Arimaa offers a $10,000 prize for anyone capable of writing an AI that can defeat the top human Arimaa players. Visit www.arimaa.com for more details.<br/><br/>This Arimaa app includes a video tutorial to teach the rules of the game making it easy to get started. There are increasing levels of difficulty to help you build your skill, and a score to let you know how well you played. Try beating the AI faster or by losing fewer pieces to top your high score. The app is loaded with features and settings to help you learn this addictive new game.<br/> <br/>Features: <br/>• video tutorial to teach the rules <br/>• several difficulty levels <br/>• ability to play handicap games <br/>• keep track of high scores <br/>• keep track of ratings <br/>• mode to pass and play with a friend <br/>• option to auto-rotate the board between moves <br/>• option to auto-rotate the game between moves <br/>• option to pause between moves <br/>• option to play rated games <br/>• option to use a move timer <br/>• ability to load and save games <br/>• ability to email the game <br/>• ability to replay a game from any position<br/>• dedicated full screen mode for iPad<br/><br/>Awards and Recognition: <br/>• Scientific American MIND magazine: Brainy gift recommendation <br/>• Discovery Channel's HowStuffWorks: Selected as 3rd most mind-bending game <br/>• Parents Choice: Approved award <br/>• Creative Child magazine: 2010 Game of the Year<br/><br/>This app is provided in compliance with Section 2 of the Arimaa Public License. License #100520.<br/><br/><br/>DISCLAIMER: Apple is not a sponsor of, or responsible for<br/>conducting, the $10,000 Arimaa challenge.", "metacritic": null, "released": "2010-06-24", "tba": false, "updated": "2019-10-22T14:10:14", "background_image": "https://media.rawg.io/media/screenshots/e63/e63883e6b79e118e5cc6c7d73809261b.jpg", "website": "http://arimaa.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 112, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Martti Juotasniemi"], "genres": ["Strategy", "Board Games"], "publishers": ["Martti Juotasniemi"], "esrb_rating": null}