{"id": 256191, "slug": "pocketsports-football-lite", "name": "PocketSports Football Lite", "name_original": "PocketSports Football Lite", "description": "Finally iPhone and iPod touch gets it's first real 3D Football game.  <br/><br/>*Throw Passes, <br/>*Run the ball with Spins and Power Moves,<br/>*Play Defense,<br/>*AND NOW Kick Field Goals!  <br/><br/>DIRECTIONS!  <br/><br/>1.) First hit \"Quick Game\"<br/>2.) Then hit \"OK\" at the Atlanta vs San Fran Screen<br/>3.) VERY IMPORTANT Pregame Setup hit \"Play Orientation\"<br/>    Here you will set the orientation that you play the game, NOTICE the Y changes as you tilt the phone.  Hit OK!<br/>4.) Hit \"Pre Game Warm Up\" also VERY IMPORTANT <br/>    Here you will practice Run and Pass plays.  <br/>Just hit \"Run\" first and try tilting the iphone to run the ball. <br/>You can also hit \"Tilt\" in the upper right to switch to DPAD on screen controller.  <br/>Hit A) for a Power Move and B) for for a spin move.  <br/><br/>Once you have running down trying passing by hitting \"Pass\", hit \"hike\" and the receivers will have circles over their heads.  Hit the circle to pass to them.  Now you have full offensive control!  <br/><br/>I suggest you stay in pregame warmup until you find the configuration that works for you either with  \"tilt\" or \"dpad\" control, and can run and pass with ease.   <br/><br/>Defensive NOTE:<br/>In game, on defense select your defender with A) and B) before the play and then hit A) to tackle.  Can you make the game saving tackle?     <br/><br/><br/>GAME ON!   <br/><br/>Description: <br/><br/>PocketSports Football Lite is designed for the unique capabilities of the iPhone and iPod touch.  Simply tilt to run and touch to pass.  Also you can execute spins or lower your shoulder when running.  On offense drop back and scope out the defense.  Then just touch the receiver to pass.  Finally on Defense see if you can come up and make the big hit or game changing interception.<br/><br/>Features:<br/><br/>Tilt and touch controls<br/>DPad Control if you choose (Hit Tilt in upper Right)<br/>Spin Move(B), Power Move(A)<br/>Touch Passing<br/>Defensive Player Control (A-B to select)(A to tackle)<br/>3 Camera Views! (Normal, High, Close) <br/>Tilt to view left and right in game!  <br/><br/>What are you waiting for. Get PocketSports Football Lite RIGHT NOW!", "metacritic": null, "released": "2009-02-12", "tba": false, "updated": "2019-10-22T14:10:18", "background_image": "https://media.rawg.io/media/screenshots/fcf/fcfab8920207b02ec8d3840d175510c1.jpg", "website": "http://www.pocketsportsfootball.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 153, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Solus Games"], "genres": ["Strategy", "Sports"], "publishers": ["Richard Stenson"], "esrb_rating": "Teen"}