{"id": 256227, "slug": "da-vinci-pinball", "name": "Da Vinci Pinball", "name_original": "Da Vinci Pinball", "description": "Enhanced for the MacBook Pro with Retina Display!<br/><br/>Answering the calls for another stellar pinball offering, Gameprom presents Da Vinci Pinball, a pinball monument to the intellectual wellspring of Leonardo!<br/><br/>– Stunning graphics paint a landscape of mysterious symbols and interactive machinery, all rendered in Gameprom's award-winning style and brought to life with our own physics engine, praised for its realism. <br/><br/>– Race along the pathways of knowledge to bring new discoveries to Mankind. <br/><br/>– Medieval weapons, elements of architecture and geometry, mechanical components, and Leonardo's tank and flying machine are all there to explore. <br/><br/>– Embark upon the journey of the Renaissance Mind with Da Vinci Pinball!<br/><br/><br/>FEATURES INCLUDE:<br/><br/>– inventive mechanisms providing engaging and open-ended gameplay<br/>– beautiful, high resolution color graphics (from the design team who<br/>received the 2010 Apple Design Award)<br/>– realistic physics and lifelike table operation<br/>– original soundtrack and voice<br/>– three camera views, each displaying the table in high resolution<br/>– 3D (anaglyph) stereographic capability<br/>– high quality audio with stereo pinball sounds<br/>– numerous unique and challenging missions<br/>– gameplay can follow a sequential plotline or be played spontaneously<br/><br/><br/>GAME CHALLENGES:<br/><br/>– Invent the Bicycle - hit three droptargets<br/>– The Path to Truth - pass along the accelerator and past the spinners<br/>to a hole pocket<br/>– Fire the Arbalest - activate the arbalet entry, then hit 4 droptargets<br/>in the sub-table arbalest minigame<br/>– Shoot the Cannon - hit all droptargets and enter the cannon<br/>– Multiball #1 - knock the balls free from their holes<br/>– Multiball #2 - knock the balls free from their holes<br/>– Decode the Codex Minor - cross all lit symbols to illumine the Codex Minor<br/>– Multi-barreled Gun - land in the left hole pocket three times, then<br/>enter the accelerator<br/>– Release the Helicopter - pass through the mechanical dredge and hopper<br/>– Invent the Crane - send three balls into the crane trap<br/>– Decode the Codex Major - cross all lit symbols to illumine the Codex Major<br/>– Construct the Flying Machine - pass over all lit symbols to light both Codices", "metacritic": null, "released": "2012-12-17", "tba": false, "updated": "2019-10-22T13:48:47", "background_image": "https://media.rawg.io/media/screenshots/115/115e4c18f1c256dcf57f13c089a8e707.jpg", "website": "http://gameprom.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 7}, "playtime": 0, "achievements_count": 4, "ratings_count": 2, "suggestions_count": 487, "game_series_count": 0, "reviews_count": 2, "platforms": ["iOS", "macOS"], "developers": ["OOO Gameprom"], "genres": ["Simulation", "Sports", "Arcade", "Casual"], "publishers": ["OOO Gameprom"], "esrb_rating": "Everyone 10+"}