{"id": 256243, "slug": "rogue-cards", "name": "Rogue Cards", "name_original": "Rogue Cards", "description": "Rogue Cards is a roguelite deckbuilder set in a medieval fantasy world of endless choices and dry humor. Multiple unique mechanics that build your tactical decisions into strategic effects. The more you play, the further your deck and character develop, and the closer you get to ascending to godhood!<h3>Discord Server now up! Check the links section.</h3><br/><strong>Roguelite deckbuilding</strong><br/><br/><ul><li>Unique graveyard mechanic that challenges tactical and strategic gameplay<br/></li><li>Character and deck development over multiple runs<br/></li><li>Hundreds of cards, endless combinations<br/></li><li>Deck management tools to alter your gameplay from one encounter to the next<br/></li><li>Ultra rare cards from boss encounters that have truly astounding impact<br/></li><li>Enemies that remember killing you</li></ul><br/><br/><strong>Challenging tactical and strategic gameplay</strong><br/><br/><ul><li>Monsters with multiple stages of attack<br/></li><li>Cards you play aren't automatically available for the next fight - choices matter!<br/></li><li>Cards that alter your character through the whole run<br/></li><li>Bosses that require unique approaches and give unique rewards<br/></li><li>Adjustable difficulty perks for those who want a truly hardcore challenge and the bragging rights to go with it</li></ul><br/>Have you ever felt like you were a peasant from a generic medieval time period destined to save the world? Are you skilled enough to challenge The Outsider - a god of the Outer Planes? Does your food taste bland in the morning due to lack of purpose? If you answered yes to those, or any other questions you might have, then look no further in your search of games!", "metacritic": null, "released": "2018-08-06", "tba": false, "updated": "2023-09-18T03:47:24", "background_image": "https://media.rawg.io/media/screenshots/738/73863db157d2801967bb981f8fedb083_yEN235G.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 42, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "iOS"], "developers": ["Ivan Khokhlenkov", "Dapper Grim Studios"], "genres": ["Action", "RPG", "Strategy", "Casual", "Card", "Puzzle"], "publishers": ["Ivan Khokhlenkov", "Dapper Grim Studios"], "esrb_rating": null}