{"id": 2562, "slug": "battleborn-open-beta", "name": "Battleborn Open Beta", "name_original": "Battleborn Open Beta", "description": "A tremendous band of badass heroes fight to protect the universe’s last star from mysterious evil in this next-gen shooter by the creators of Borderlands <br/>HEROES<br/>Battleborn has a deep roster of 25 playable heroes. Every hero has their own personality and comes equipped with unique weapons and powers.<br/>STORY MODE<br/>Battleborn's Story Mode is a narrative experience that can be played entirely singleplayer, and can be played cooperatively with friends both splitscreen and online.<br/>MULTIPLAYER<br/>Battleborn's team-based competitive multiplayer can be experienced by up to 10 players online in 5v5 matches, and includes three distinct multiplayer modes – Incursion, Capture, and Meltdown.<br/>BETA<br/>The Battleborn Beta will contain 2 Competitive Modes (1 Map per Mode), 2 Story Missions, 25 characters, Command Rank and Character Rank progression systems, and Gear and Loot Packs.<br/>The Battleborn Open Beta will be live at 10:00 AM PST on 4/8/2016.<br/><br/><br/><br/>Use of PSN and SEN account are subject to the Terms of Service and User Agreement and applicable privacy policy (see terms at sonyentertainmentnetwork.com/terms-of-service &amp; sonyentertainmentnetwork.com/privacy-policy). *Online multiplayer also requires a PlayStation®Plus subscription.<br/><br/>1-10 players<br/>Network Players 2-5<br/>DUALSHOCK®4<br/>1080p HD Video Output<br/>Online Play (Required)<br/><br/>  Software subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service).<br/><br/>", "metacritic": null, "released": "2016-04-06", "tba": false, "updated": "2019-10-23T14:56:33", "background_image": "https://media.rawg.io/media/screenshots/09c/09cb82f472bfc066673dc7fcc3737580.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 291, "game_series_count": 0, "reviews_count": 0, "platforms": ["PlayStation 4"], "developers": ["2K"], "genres": [], "publishers": [], "esrb_rating": "Teen"}