{"id": 25629, "slug": "rock-revolution", "name": "Rock Revolution", "name_original": "Rock Revolution", "description": "<p>\n      ...or allow your friends the privilege of picking up an axe or pounding \n      the skins with you to over 40 mind bending rock and roll tracks! Unleash \n      your creative juices in the Jam Mode where you can create your own music \n      in a state of the art multi-track studio! This is the musical revolution \n      the world has been waiting for!\n    </p><ul>\n<li>\n        Choose between drums, bass, guitar and vocal\n      </li>\n<li>\n        Rhythm-based gameplay uses stylus gestures for rhythm matching\n      </li>\n<li>\n        Complete combos to see your character pull off moves like scissor kicks\n      </li>\n<li>\n        Customizable venues allow users to unlock stage props like fireworks \n        displays and laser shows\n      </li>\n<li>\n        Get together with your friends and play songs as a band or against one \n        another via wireless\n      </li>\n<li>\n        Power-up your character and band with new picks, sticks, and amps\n      </li>\n<li>\n        Choose from 20+ songs to rock out too\n      </li>\n<li>\n        Choose between multiple modes for the ultimate Rock Revolution \n        experience:\n      </li>\n</ul><p>\n      - Quick Play (Single) - Choose a song and an instrument and play single \n      songs\n    </p><p>\n      - Career Mode (Single) - Take your band from the garage to the top of \n      the charts\n    </p><ul>\n<li>\n        Suit up your band with new gear and rack up huge amounts of cash\n      </li>\n<li>\n        Take on new challenges like mastering a song in the recording studio, \n        or playing a set list of multiple songs\n      </li>\n</ul><p>\n      - Co-op Mode (Multiplayer, 2-4 players) - Create a band with your friend \n      or join a band that’s looking to ‘hire’\n    </p><ul>\n<li>\n        Work together with friends to achieve massive scores\n      </li>\n</ul><p>\n      - Battle Mode (Multiplayer, 2–4 players) - Go head to head with your \n      friends and family\n    </p><p>\n      - Custom Battle – Every player must play the same instrument with the \n      same character\n    </p><p>\n      - Ultimate Battle – Console randomly chooses instrument, character, song \n      and venue\n    </p><ul>\n<li>\n        Career mode: play songs, learn techniques, create set lists and \n        complete challenges\n      </li>\n</ul>", "metacritic": null, "released": "2008-10-15", "tba": false, "updated": "2019-07-30T13:28:40", "background_image": null, "website": "", "rating": 0.0, "rating_top": 4, "added_by_status": {"yet": 1, "owned": 20, "beaten": 1, "dropped": 2, "playing": 1}, "playtime": 1, "achievements_count": 44, "ratings_count": 5, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 5, "platforms": ["Xbox 360", "Nintendo DS"], "developers": ["Zoë Mode"], "genres": [], "publishers": ["Konami"], "esrb_rating": "Rating Pending"}