{"id": 256354, "slug": "bear-simulator-no-mercy", "name": "Bear Simulator: No Mercy", "name_original": "Bear Simulator: No Mercy", "description": "Control a huge Bear as he goes racing around the fame. After a cold, bleak winter, it's time for the bear to wake up from his 3-months-long hibernation. We worked hard to create the best Bear Simulator on the store. <br/><br/><br/>---This application was built in conjunction with Big Baja apps.  Therefore, we authorize Big Baja apps the right to distribute this app on the Google Play store.--<br/><br/><br/>Features:<br/>--Control a huge 3D Bear<br/>--16 Fun Missions to Complete<br/>--2 Huge Maps to Explore<br/>--Go for the High Score<br/>--Cars, Trains, Helicopters, and Rockets<br/>--Farm and City Elements<br/>--Real Bear Simulation<br/>**This version has no ads**<br/><br/>Your bear woke up in a bad mood; hungry and lonely. Unlucky the one who stands in his way. You have the whole town and a farm to help the bear let his rage out. Destroy everything around you. Disturb the cows, goats and sheep. Intimidate passers-by and cars with your wild animal. All happening in a super fun 3D environment.<br/>Let the bear madness begin! <br/><br/>Use your energy on finding crucial objects to successfully win the game. Race around and smash into Cars, Trucks, Helicopters, Tractors, and Rockets. <br/><br/>Completed all the missions? Don't be in a hurry to leave the app. There are more exciting things about this game than you think! By purchasing the full version of \"Bear No Mercy\", you don't just get rid of all the ads, you also receive the access to a free play where you can enjoy the freedom to do whatever the heck you want. If you enjoy playing Goat Simulator, Shark Simulator, Dinosaur Simulator, and Wolf Simulator, you are going to love this game.<br/><br/>Feel like marauding the village? Go for it! In the mood to create car accidents? Carry on with your devious plans! Anxious to disrupt trains' schedule? It's all there for you, in this simple but fascinating game. The bear sim with the edge!", "metacritic": null, "released": "2014-07-23", "tba": false, "updated": "2019-10-22T14:10:26", "background_image": "https://media.rawg.io/media/screenshots/286/28693dfbec6fed6c60e2d9fcfc5c5486.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 111, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Ksenia Tsarkova"], "genres": ["RPG", "Simulation"], "publishers": ["Ksenia Tsarkova"], "esrb_rating": "Teen"}