{"id": 256379, "slug": "race-stunt-fight", "name": "Race, Stunt, Fight!", "name_original": "Race, Stunt, Fight!", "description": "Race, stunt and fight your way across America on your motorcycle. Play as one of the Adrenaline Crew, sport bike, cop or chopper rider as you gain points completing stunts and finishing first!<br/><br/>NOW FOR iPHONE 5!<br/><br/>\"One of the best games for 2012\" The Washington Post<br/>\"Road Rash on Steroids\" Gamer Online Magazine<br/>\"If it wasn't for this game I would probably get a lot of work done!\" Kenny Kelley<br/><br/>From the #1 selling 'Adrenaline Crew' platinum motorcycle mayhem DVD series we come to you now as digital anarchy... <br/><br/>HOW TO PLAY<br/><br/>- Tilt your phone/tablet to steer left and right<br/>- Stay away from cars, curbs, and cops<br/>-Tap ATTACK to punch and kick other players off their bikes and get Stunt Bonuses<br/>- Tap the Stunt button to wheelie and perform other special stunts<br/>- Pick up Nitro's to earn an extra boost.<br/>- Tap break to avoid wrecks and sticky situations, bike will automatically do an endo!<br/><br/><br/>FEATURES<br/><br/>* Adrenaline filled addictive gameplay with ultra smooth tilt controls<br/>* Over 10  different characters to unlock and play, each with their own unique abilities, speed and gameplay!<br/>* Real stunts the Adrenaline Crew performs on the streets across America<br/>* Gain points by holding stunts while being attacked by other riders.<br/>* Lifelike character animations and physics<br/>* Play with Game Center and add your score to the Leader Boards and unlock achievements!<br/>* Facebook integration: compete with your friends for top score and post brags to your wall <br/>* Awesome realistic sound effects recorded from real motorcycles, including a sport bike, chopper, dirt bike, and a cafe racer!<br/><br/><br/>BONUS TIPS<br/><br/>- Save up your Nitro to use in sticky situations like running away from other bikers attacking you<br/>- Concentrate on coming in first and just fending off those who attack you<br/>- Hit Nitro then Stunt button so you can get extra speed while doing a stunt<br/>- If being attacked on the side that a cop is shooting radar don't hit the rider off till you pass the cop, he will go after the other guy instead!", "metacritic": null, "released": "2011-10-04", "tba": false, "updated": "2019-07-30T13:01:17", "background_image": "https://media.rawg.io/media/screenshots/136/13688ccd54f895edf3f1a87c584c8b6e.jpg", "website": "https://www.adrenalinecrew.com/motorcycle-video-game-iphone-android/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 97, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Adrenaline Crew"], "genres": ["Action", "Sports", "Racing"], "publishers": ["Adrenaline Crew"], "esrb_rating": null}