{"id": 256337, "slug": "wooble-wobble-for-merge-cube", "name": "Wooble Wobble for Merge Cube", "name_original": "Wooble Wobble for Merge Cube", "description": "PLEASE NOTE: This app requires a Merge Cube and a smartphone or a tablet to play. To find out how to get a Merge Cube and learn more, visit this website at: https://www.MergeCube.com<br/><br/>Navigate through various puzzles to try and get your ball to the goal!  Includes 5 unique worlds to play on. Made to be used with the Merge Cube.<br/><br/>HOW TO PLAY IN PHONE MODE (Without VR/AR Goggles)<br/>- Launch the app<br/>- Be sure to allow camera and photo access<br/>- Enter your activation code (found inside the cube packaging)<br/>- Enter an adult's email address to create an account<br/>- Select Phone Mode<br/>- Play the tutorial within the app<br/>- Make sure you can see the cube through your phone<br/>- Hold your device with one hand and hold the cube with your other hand, or use the optional stand in the package<br/>- Play Wooble Wobble with the Merge Cube<br/><br/>HOW TO PLAY IN VR MODE (with VR/AR Goggles)<br/>- Launch the app<br/>- Be sure to allow camera and photo access<br/>- Enter your activation code (found inside the cube packaging)<br/>- Enter an adult's email address to create an account<br/>- Select VR/Merge Mode<br/>- Place your smartphone in your VR/AR Goggles<br/>- Play the tutorial within the app<br/>- Make sure you can see the cube through your screen<br/>- Play Wooble Wobble with the Merge Cube", "metacritic": null, "released": "2018-03-20", "tba": false, "updated": "2019-10-22T14:10:25", "background_image": "https://media.rawg.io/media/screenshots/2f4/2f40601a02d1eb1aed1d287f3a8a7b15_6x93qHf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 58, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["NovaCove"], "genres": ["Puzzle"], "publishers": ["NovaCove"], "esrb_rating": "Everyone 10+"}