{"id": 25635, "slug": "wii-music", "name": "Wii Music", "name_original": "Wii Music", "description": "<p>\n      Wii Music includes many other modes besides the main band jams, \n      including several musical games and an enhanced video playback mode for \n      recorded jams.\n    </p><ul>\n<li>\n        Play it again: Use the playback mode to see your jam recordings \n        brought to life with dramatic camera angles.\n      </li>\n<li>\n        Pick up the baton: Command an orchestra in the conducting game \n        where you’ll wave the Wii Remote controller like a conductor’s baton \n        to lead a Mii orchestra through orchestrated music. Make them play \n        quickly, slowly, strongly or gently.\n      </li>\n<li>\n        Ring a bell? Play a handbells game where you’ll swing your Wii \n        Remote and Nunchuk controllers to play your two handbells as part of a \n        larger ensemble. Everyone on the team has a job to do: Play one of \n        your notes only when the tune demands it.\n      </li>\n<li>\n        An ear for music: Take a tone quiz that tests your musical ear \n        by giving you challenges, like putting note-playing Miis in order from \n        lowest to highest pitch.\n      </li>\n<li>\n        Bang the drum: Play a virtual drum set in the drumming mode, \n        the one mode in Wii Music that also uses the Wii Balance Board \n        accessory (sold with Wii Fit™). You’ll use the Wii Remote and Nunchuk \n        controllers as drumsticks, and place both feet on the Wii Balance \n        Board—which work as virtual pedals for the bass drum and hi-hat cymbal.\n      </li>\n<li>\n        Create a musical masterpiece with up to four players. Anyone can play \n        the huge selection of instruments in Wii Music with simple \n        motions—like strumming and drumming.\n      </li>\n<li>\n        It’s easy to play improv jams. Musicians in your band jam by simply \n        playing their instruments to the beat of a song or by improvising to \n        their heart’s content. Play faster. Play slower. Skip a beat, or throw \n        in 10 more. No matter what you do, Wii Music automatically transforms \n        your improv stylings into great music. There are no mistakes—just \n        playing for the pure joy of playing.\n      </li>\n<li>\n        Wii controls immerse you in the music. You can play most of the \n        60-plus instruments in Wii Music using simple motions with the Wii \n        Remote and Nunchuk controllers. Strum to play guitar, banjo and sitar. \n        Drum to play jazz drums, congas and marching drums. Hammer away to \n        play piano, vibraphone and marimba. Unlike most music games, Wii Music \n        doesn’t make you use complex buttons. You only need to imitate playing \n        the instrument.\n      </li>\n<li>\n        Wii Music offers virtually endless ways to make music. You choose the \n        song and instruments and decide whether to blaze through a rock take \n        on classical songs, put a jazzy spin on folk tunes or transform \n        Nintendo classics like the Super Mario Bros. theme into Latin-flavored \n        numbers. The song list is only a takeoff point—it’s how you improvise \n        with the songs that matters.\n      </li>\n</ul><p>\n      As of May 20, 2014, the Nintendo Wi-Fi Connection service for Nintendo \n      DSi and Wii systems has been retired. Online features of this game are \n      no longer available after this date but this game still provides an \n      entertaining experience in offline mode.\n    </p><p>\n      To learn more about this service change, please visit To learn more \n      about this service change, please visit support.nintendo.com/servicesupdate.\n    </p>", "metacritic": null, "released": "2008-10-20", "tba": false, "updated": "2023-03-23T14:42:40", "background_image": "https://media.rawg.io/media/screenshots/c76/c760f9cbcabb4a715ddb2f7aeebfbb45.jpg", "website": "", "rating": 2.46, "rating_top": 3, "added_by_status": {"owned": 5, "beaten": 16, "dropped": 22, "playing": 1}, "playtime": 17, "achievements_count": 0, "ratings_count": 26, "suggestions_count": 321, "game_series_count": 0, "reviews_count": 26, "platforms": ["Wii"], "developers": ["Nintendo"], "genres": [], "publishers": ["Nintendo"], "esrb_rating": null}