{"id": 256596, "slug": "un-vogon-a-saint-tropez", "name": "Un vogon à Saint-Tropez", "name_original": "Un vogon à Saint-Tropez", "description": "<p>Ce jeu a été réalisé en 2013 avec Elastico-Gadget qui s'est occupé de la musique et surtout des graphismes !</p>\n<p>Je codais de mon côté, avec Game Maker (plus jamais... dans le même genre aujourd'hui je partirais plutôt sur Godot). Je me suis aussi amusé à enregistrer ce poème vogon. J'aime beaucoup cette haute forme de lyrisme et ne désespère pas de voir un jour plus de personnes apprécier les vers vogons :D</p>\n\n<p><strong>Cadre du concours</strong></p>\n<p>Le jeu a été proposé pour un concours organisé par un forum francophone dédié à Game Maker, et on avait gagné le premier prix !</p>\n<p>Le thème général était \"Summer Holidays\", mais l'originalité de la contrainte était que sur les deux mois alloués, de nouveaux thèmes et contraintes étaient ajoutés au fil des semaines, pour aboutir au final à cette liste d'éléments à intégrer :</p>\n<ol><li>Une étoile de mer.</li><li>Un parasol qui fait sauter plus haut.</li><li>Un menu au lancement du jeu.</li><li>Un jus de fruit.</li><li>Des ennemis qui tirent des cœurs.</li><li>Un bouton pour couper le son si vous en avez. Si vous n'en avez pas, ajoutez en, et le bouton avec.</li><li>Un naturiste.</li><li>Un PNJ (Personnage Non Joueur) Mydexios <em>(du nom d'un des modérateurs du forum)</em>.</li></ol>\n<p>On avait réussi à presque tout intégrer, sauf les ennemis qui tirent des cœurs.<br/></p>\n<p>Page du concours :<br/>http://www.game-maker-forum.net/t1916-concours-n9-summer-holidays</p>\n<p>Page de résultats :<br/>http://www.game-maker-forum.net/t2088-resultats-concours-n9-summer-holidays</p>\n\n<p><strong>L'après concours</strong></p>\n<p>J'avais voulu quelques temps plus tard reprendre le jeu et l'améliorer (surtout ajouter le gendarme-boss prévu en fin de niveau), mais Game Maker avait déjà un poil évolué et acceptait mal mes fichiers de travail d'origine.</p>\n<p>Puis ce fut encore pire, la version 1.4 a cessé d'être mise à jour alors que j'avais payé la totale plus de 500 euros moins de 2 ans avant... Dégoûté, j'ai laissé tomber ce moteur par trop mercantile. J'ai depuis travaillé lors d'une game jam avec Godot qui est super, et envisage aussi d'apprendre Unity.</p>", "metacritic": null, "released": "2018-10-21", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/7df/7df7056061615efdd7d47fa0c8e2c004.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 8, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Feldo"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}