{"id": 25659, "slug": "go-diego-go-great-dinosaur-rescue", "name": "Go Diego Go! Great Dinosaur Rescue", "name_original": "Go Diego Go! Great Dinosaur Rescue", "description": "<p>\n      In Go, Diego, Go! Great Dinosaur Rescue your child joins Diego on an \n      epic prehistoric adventure on the Nintendo Wii. In this journey to the \n      earth's Cretaceous Period, Diego, his sister Alicia and their pal Baby \n      Jaguar travel millions of years back in time to the age of the dinosaurs \n      to help Maia the Maiasaura find her way back to her family on Egg \n      Island. In this amazing rescue adventure your child will explore a wild \n      jungle-covered world filled with dinosaurs and volcanoes where they will \n      have to climb rock walls, travel along monkey bars, solve puzzles and \n      even jump on a pogo stick to help Diego’s friend find her way home.\n    </p><ul>\n<li>\n        Explore 5 levels and search your way through Cretaceous Jungle and \n        Volcano Cliffs to find your way to Egg Island\n      </li>\n<li>\n        Travel back in time with Diego, Alicia and Baby Jaguar\n      </li>\n<li>\n        Help Maia the Maiasaurus reunite with her family\n      </li>\n<li>\n        Use more than 12 different Wii Remote motions to stomp like a \n        dinosaur, climb across monkey bars, fly on a Pteradon and bounce over \n        obstacles on a pogo stick\n      </li>\n<li>\n        Grown-ups can join in using the Dinosaur Guide Helper Feature and a \n        second controller\n      </li>\n</ul>", "metacritic": null, "released": "2008-10-27", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["Nintendo DS", "Wii"], "developers": [], "genres": [], "publishers": ["2K Play", "Take 2 Interactive Software"], "esrb_rating": null}