{"id": 25666, "slug": "ultimate-i-spy", "name": "Ultimate I Spy", "name_original": "Ultimate I Spy", "description": "<p>I SPY takes a revolutionary turn that will have you up and moving! Play<br />\npaddleball, throw darts, juggle, and more to solve immersive 3-D<br />\nriddles. Solving riddles uncovers a mysterious machine and unlocks a<br />\nheart-stopping game that reveals a special surprise! Plus, grab a friend<br />\nand compete for bragging rights in the Game Room fetauring 10<br />\nmulti-player games.</p>\n<p>Revolutionary I SPY Experience - 3-D riddles, action-oriented play and<br />\nmultiplayer features introduce an interactive I SPY experience like no<br />\nother.</p>\n<p>3-D Immersive Environments - For the first time in an I SPY game, 3-D<br />\nriddle screens allow players to navigate through 360º and 180º<br />\nenvironments with multiple angle views--searching above, under and<br />\nbetween objects.</p>\n<p>Move to Solve Riddles - Solve 40 I SPY riddles actively! Use the Wii<br />\nRemote and Nunchuk to search the scenes, pick up objects and engage in<br />\nactivities like connect-the-dots, juggling or playing maracas to<br />\nfinish the riddles.</p>\n<p>Intriguing Mystery - Solving riddles reveals pieces of a mysterious<br />\nmachine. Complete all 40 riddles to unveil the machinge.</p>\n<p>Scavenger Hunt - Follow the clues to search for objects throughout all<br />\nthe riddles and bring the machine to life!</p>\n<p>Heart-Stopping Climactic Game - Break a sweat in a final game to<br />\npower-up the machine through an intense series of movements with<br />\nobjects such as a boomerang, a yo-yo or a tennis racket that you&#39;ve<br />\ncollected over the course of the game.</p>\n<p>Multi-Player Games - Compete in 10 replayable games, boasting<br />\nmulti-player options and leaderboard features. Fly rockets, play<br />\npaddleball, throw darts, or win races.</p>", "metacritic": null, "released": "2008-10-28", "tba": false, "updated": "2019-09-12T06:38:24", "background_image": "https://media.rawg.io/media/screenshots/19e/19ef394131217e712cbce63645faca3b.jpg", "website": "http://www.ispyvideogames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 126, "game_series_count": 0, "reviews_count": 0, "platforms": ["Wii"], "developers": [], "genres": ["Action"], "publishers": ["Scholastic Interactive", "Elastic"], "esrb_rating": null}