{"id": 256697, "slug": "open-panzer-itch", "name": "Open Panzer (itch)", "name_original": "Open Panzer (itch)", "description": "<p>Tactical scale World War 2 turn based strategy game, that puts the player in the role of an Axis or Allied army general. You command battalion level units with the objectives to engage the enemy forces to occupy key locations or supply points. <br/><br/>• USA, German and Soviet campaigns in 72 historical semi-accurate scenarios, and introductory tutorial scenario. <br/>• 4000 historically accurate units, each unit having more than 20 stats and only being available depending on scenario year, based on AdlerKorps equipment. 30 countries available. <br/>• Build you own core army, train your core units to increase their experience, gain prestige to upgrade or buy new units, carry them over scenarios as the campaign progresses. <br/>• Units can gain Leaders in combat for more abilities <br/>• Special unit actions depending on unit class <br/>• Cross platform save/load game state at anytime beside the automatic turn save . Cloud based save/load game facility to continue playing on other devices. <br/>• 20 Terrain types that influence combat, weather and ground conditions, automatic reinforcements. <br/>• Strategic overview map of entire battlefield, clean user interface that never hides the battlefield from player. <br/>• Full featured unit upgrade/purchase Equipment window with sorting and filtering <br/></p>", "metacritic": null, "released": "2018-10-21", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/351/35162d47adcce584c3f9da76b1acc271.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 374, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Nicu Pavel"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}