{"id": 256775, "slug": "jaguar-fractal-virtual-temple", "name": "Jaguar fractal virtual temple", "name_original": "Jaguar fractal virtual temple", "description": "<p>The August full moon is approaching and with it the opening of our new exhibition “fake plastic forevers &amp; détournement of digital colonialism”. Curated by Juan Covelli, this is a continuation of his previous internet based work \"Speculating the Fragmented Copy\": http://speculating-the-fragmented-copy.schloss-post.com/, where he released 14 3D scans from Mesoamerican archaeological artifacts that he scanned from the Stavenhagen Collection -CCU Tlatelolco in Mexico.<br/><br/>For fake plastic forevers, He invited 6 artists to download the objects and modify them however they wanted, to give the 2,000 year-old archeological treasures a new digital life. The 3D scans are freed from physical matter, an illusion of sorts. Translated to a new dimension and language, which is not made of tangible material, their components are zeroes and ones, without dimension. The new artifacts are algorithmic calculations, released from the museum and its geographical limitations; now they are coming back to the people. Not bound by the original, the digitalized objects can become forever multiple, forever fluid.<br/><br/>Featured artists:<br/><br/>Léa Porré…………........... https://www.leaporre.com/<br/>Olga Fedorova.. https://www.instagram.com/olgamikhfedorova/<br/>Nabbteeri…………………http://www.nabbteeri.com/index.html<br/>Neale Willis………………………. http://www.nealewillis.com/<br/>Miguel Angel Salazar…………….. http://www.wimpysalazar.com/<br/>Yuma burgess…………https://www.instagram.com/yumaburgess/<br/><br/><br/>The project is part of a current open source countermovement against museums and tech companies such as Google who are also digitizing cultural heritage for creative re-use, but often just reproduce tactics of traditional colonialism due to closed and controlled production environments.</p>", "metacritic": null, "released": "2018-10-20", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/aa8/aa8b56459393d6742d9036c470224d3d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 123, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Kitamago"], "genres": [], "publishers": [], "esrb_rating": null}