{"id": 256771, "slug": "beyond-the-mask-demo", "name": "Beyond the Mask (demo)", "name_original": "Beyond the Mask (demo)", "description": "<p>ENGLISH: </p>\n<p>Beyond the mask is an interactive visual novel created as the first personal project  of this magnitude and as a college thesis. It tells the story of our main character, Kiyoko, a 17 year old high school student about to graduate, who tries to find out why all the people in the town where she lives are suddenly asleep, and unable to wake up. <br/>The goal of the game is to find all the clues and choose the correct options to discover the real truth behind this incident.</p>\n<p>The prologue demo is avaliable in English and Spanish.</p>\n\n<p>ESPAÑOL:</p>\n<p>Beyond the Mask es una novela visual interactiva de suspense creada como primer proyecto personal de esta magnitud. Nos pondremos en la piel de nuestra protagonista, Kiyoko, una estudiante de 17 años a punto de graduarse, que intenta descubrir por qué todos los habitantes del pueblo en el que vive permanecen dormidos de manera indefinida.<br/></p>\n<p>Este juego se encuentra en proceso de desarrollo, por ahora es una demo. Está disponible en español y en inglés.</p>\n<p>You can follow updates on the project here:</p>\n<p>https://beyondthemaskvn.tumblr.com/</p>\n<p>https://twitter.com/beyondthemaskVN</p>\n<p> </p>\n<p>WARNING: Most of the tracks used were composed by me, as well as all the sprites, character designs and backgrounds. The use of these assets in other visual novels, games or any other form of redistribution is prohibited and it will be taken legal action if done.</p>\n<p>SIDE NOTE: If you see a bug or any grammar error my beta testers or me didn't catch feel free to send me a message on tumblr or twitter. Your constructive comments are always welcome! I'm still learning so there might be mistakes. </p>", "metacritic": null, "released": "2018-10-20", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/8db/8dbeaf330baf2578a066c96807bbe802.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 99, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["BIO"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}