{"id": 25695, "slug": "mlb-superstars", "name": "MLB Superstars", "name_original": "MLB Superstars", "description": "<p>\n      Choose from a variety of multiplayer mini-games to play with your \n      favorite pros and challenge each other to baseball’s wacky versions of \n      golf, bocce, piñata, and other original games.\n    </p><ul>\n<li>\n        Baseball Bocce - Grab your Wii Remote and take turns using an \n        underhand throwing motion to get your ball as close to the jack (white \n        ball) as possible. Watch out for gophers, lawnmowers, and other \n        obstacles that can block your path.\n      </li>\n<li>\n        Wall O Bricks - Smash the Wall O Bricks with your bat and avoid \n        the Behemoth! Players will swing the Wii Remote like a baseball bat to \n        knock out bricks and earn power-ups.\n      </li>\n<li>\n        Snack Cannon - The fans are hungry and they’re letting you know \n        it. Can you feed them all in time? Look at the bubble above a fan’s \n        head to see what kind of snack he wants. Aim and launch the correct \n        food at the fans to earn points.\n      </li>\n<li>\n        Baseball Golf - Bat, bunt, and toss the ball to sink it in the \n        hole in the fewest strokes possible! Multiple Wii Remote motions will \n        be used to complete a hole. Swinging motions for drives, throwing for \n        mid range shots and once on the green you’ll utilize a bunting motion \n        to finish off the hole.\n      </li>\n<li>\n        Marbles - Try to knock marbles out of the circle in this \n        baseball themed take on a classic childhood game! Hold the B Button \n        and perform an under-arm throwing motion with your Wii Remote. Release \n        the B Button when you wish to release the ball.\n      </li>\n<li>\n        Batting Range - Don’t want to play a full game of Baseball \n        Golf? Work on your swing at the Batting Range!\n      </li>\n<li>\n        Pachinko - Bat balls into the stands and try to earn prizes on \n        the biggest pachinko board around. The baseballs you’ve collected can \n        be spent in Pachinko to earn prizes such as bats, balls, shirts and \n        more which can then be equipped in your player’s locker!\n      </li>\n<li>\n        Piñata Smash - As you play the different mini games, you \n        can win Piñatas. These Piñatas are needed to play the Piñata Smash \n        mini game. You’ve got 30 seconds to swing the Wii Remote to smash the \n        Piñata and reveal the prizes within.\n      </li>\n<li>\n        Trophy Room - Head on into the Trophy Room to see the prizes \n        you have won by completing and winning the mini games.\n      </li>\n<li>\n        Locker Room - Here you can equip your character with all of the \n        unlockable gear you’ve discovered along the way! The gear is broken \n        down into categories: headgear, clothing and equipment.\n      </li>\n<li>\n        Mascot Dance - Think you’ve got the moves? Play with Wally the \n        Green Monster, Fredbird, Mr. Met, or Phillie Phanatic. Perform for the \n        crowd and show them what you’ve got. Mimic the gestures on screen with \n        the Nunchuk and Wii Remote to earn points before time runs out.\n      </li>\n</ul>", "metacritic": null, "released": "2008-11-10", "tba": false, "updated": "2019-09-12T06:38:19", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["Wii"], "developers": [], "genres": [], "publishers": ["2K Sports"], "esrb_rating": null}