{"id": 256951, "slug": "fallstreak-itch", "name": "Fallstreak (itch)", "name_original": "Fallstreak (itch)", "description": "<p><strong>A Psychological Fantasy Visual Novel<br/></strong></p>\n<p><em>The land of Socotrine— a hidden garden surrounded by a border of reality-distorting mist. Fallstreak tells the tale of Adelise Cotard, a young girl that enters a timeless golden dream when she falls asleep.<br/><br/>How are her dreams related to the Fire of Collapse, a mysterious disaster ten years ago in which prismatic flames rained from the sky, and how does it connect with her ultimate goal: escape from the closed world of Socotrine?</em></p>\n<p>Fallstreak is a linear visual novel that combines elements of traditional storytelling with modern components of dark fantasy and psychological thriller to create a unique narrative experience.</p>\n<p><strong>Features</strong></p>\n<p>- Writing: 80,000 Word Script<br/>- Character Sprites: 13 Unique Character Sprites<br/>- Backgrounds: 30+ Unique BGs<br/>- Illustrations: 12 Event CGs<br/>- Original Sound Track: 23 Tracks</p>\n<p><strong><br/>Content Advisory</strong><br/></p>\n<p> Depictions of extreme violence and cruelty are contained within Fallstreak. Heavy psychological themes are also prevalent.<br/><strong><br/>Fallstreak Fan Pack<br/><br/></strong>Available for $9.99, the Fallstreak Fan Pack contains each of the following:<br/><br/>\n</p>\n<p><em>Fallstreak Prototype Novel</em><br/>A 60,000 word prototype novel written early in Fallstreak’s development featuring a unique, self-contained story that follows after Cecil in an apocalyptic rendition of Socotrine.</p>\n<p><em>Fallstreak Original Soundtrack</em><br/>23 high-quality audio tracks, composed and recorded by Centi.</p>\n<p><em>High-Resolution Wallpapers</em><br/>10 wallpapers featuring hi-res images of the best of Fallstreak’s art.</p>\n<p><em>Fallstreak Developer Art Book</em><br/>A special digital art book containing concept and iteration art as well as specs and direction notes that delve into the underlying vision behind Fallstreak’s unique aesthetic.</p>", "metacritic": null, "released": "2018-10-19", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/3d6/3d608d22ccb6e24d0d6747fd425de28e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 188, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Centicerise"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}