{"id": 257030, "slug": "gemu-no-kami", "name": "Gemu no Kami", "name_original": "Gemu no Kami", "description": "<p><strong>Gemu no Kami</strong><br/><em>You are a game god but don't loose \"your\" head(s) to avoid speeding up things and loose control over things...</em><br/><br/><strong>GOD Controls: </strong></p>\n<ul><li>A, D : Left and right</li><li>Space jumping</li></ul>\n<p><strong>Creation controls:</strong></p>\n<ul><li>Arrow keys: Left, right, up and down</li></ul>\n<p><strong>Story: </strong></p>\n<p>When creating a game you are a God of your creation. You can add whatever your mind can think of. Do you want some health orbs, sure, just add it in the game. It is that simple. But be ware that it might get to your head, and things will just get out of hand. Speeding up until you loose all control and your divine powers will decrease! </p>\n<p>The game is about you as an game developer (Game God) created a game where you should collect health orbs. And you are in charge of keeping this little creation of yours alive and well for as long as possible. During this time there will be head enemies that you need to spike and also you need to keep your vision clear and not let the darkness take over your game! </p>\n<p>Try to survive as long as possible to keep up all the divine powers you are granted being God! Good luck, you will need it</p>\n<p><strong>Assets:</strong></p><p>All sprites were created using Pyxel Edit, music were made with Bosca Ceoil.<br/>Game created in Unity and all code written using IDE Rider</p>", "metacritic": null, "released": "2018-10-19", "tba": false, "updated": "2019-08-28T23:19:52", "background_image": "https://media.rawg.io/media/screenshots/b02/b02b5bbad8c3b8db22d91f1f57406b4b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 11, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["troligtvis"], "genres": [], "publishers": [], "esrb_rating": null}