{"id": 257049, "slug": "bola-na-mao-nao-pedrolemoine", "name": "Bola na Mão, Não! (PedroLemoine)", "name_original": "Bola na Mão, Não! (PedroLemoine)", "description": "<p><strong>BOLA NA MÃO, NÃO!</strong></p>\n<p>Por: Pedro Henrique Lemoine Vedolin</p>\n<p>Link de acesso Online: https://pedrolemoine.itch.io/bolanamao-nao</p>\n<p>Respeitar as regras impostas pelo jogo, mesmo que o mesmo provoque o usuário a quebrá-las, é um exercício de autocontrole.</p>\n<p>Autocontrole é a habilidade de tomar as rédeas de nossas emoções, em especial as mais fortes.  O ser humano necessita da capacidade de autocontrole quando tenta manter o foco numa tarefa que precisa ser realizada de uma determinada forma, sem distrações e sem falhas. Mas o que acontece quando nos sentimos pressionados?<br/><br/></p>\n<p>Como podemos manter o controle emocional, a força de vontade e a atenção?<br/>Quando nos sentimos pressionados por um tempo prolongado acabamos tendo atitudes que podem afetar a nossa autoestima e criar obstáculos para alcançar metas. <br/>Quando esses sentimentos são bem trabalhados, é possível conseguir mudanças perceptíveis em outras formas de agir diante de situações problemáticas.<br/>Reforçar a habilidade do autocontrole é um exercício que leva o ser humano à compreensão e conexão com a sua forma de entender o mundo, com seus pensamentos e suas ações.</p>\n<p><strong>Construção da obra</strong></p>\n<p>O jogo é bastante simples, o usuário joga com um goleiro que deve defender a bola arremessada no gol. A bola arremessada é direcionada aleatoriamente para a parte superior do gol e também para a parte inferior, porém há uma regra: o usuário não deve defender a bola com as mãos, apenas com o pé. O jogo possibilita que o usuário defenda tanto com as mãos, através da tecla “enter” como com os pés através da tecla “espaço”, porém quando o jogador defende a bola no ar com as mãos, automaticamente a partida é encerrada e “game over”.</p>\n<p>A bola é propositalmente lançada no ar, provocando o usuário a defender com as mãos, mas este precisa ter domínio de seu autocontrole e deixar com que a bola atravesse o campo e chegue no gol quando arremessada para cima, para que possa continuar com o jogo.  Ter de aceitar algo que às vezes parece não ser o “aceitável” faz parte da vida, pois precisamos deixar que “algumas bolas marquem um gol indesejável” quando a situação não nos permite que façamos algo para intervir.</p>\n<p>A pontuação do jogo é cumulativa, somando o “score” apenas quando o usuário defende a bola com os pés, ou seja, quando a bola vem de baixo, tornando o jogo uma prova de resistência, paciência e autocontrole, fazendo com que o usuário espere até que a bola seja arremessada para que ele possa defender com os pés, nas condições que são aceitas nas regras do jogo.</p>\n<p>O jogo dialoga com jogos arcades simplificados, como jogos de atari e até mesmo jogos online que trabalham com a mecânica cumulativa de pontos como uma forma de “resistência”. O que torna o jogo “fora do comum” é justamente dar as duas opções dentro da jogabilidade para o usuário e uma delas faz com que o jogo acabe imediatamente quando usada, ou seja, apesar de duas opções o usuário é forçado a jogar apenas com uma para que o jogo continue, porém a opção de utilizar a outra alternativa, que não é a adequada, é inteiramente do usuário, porém implica no “fim de jogo”.</p>\n<p><strong>Conclusão do desenvolvimento do projeto</strong></p>\n<p>Acredito que ainda faltam recursos técnicos (de produção) para que o jogo de fato possa expressar exatamente o conceito do projeto sem a necessidade deste documento de apoio. As duas interações, que inicialmente foram designadas para exercer apenas a determinada função, como é o caso da tecla “enter” para a defesa com as mãos, acaba tendo brechas, que pode ser usada para defender a bola com o peito ou outra parte do corpo do goleiro que não sejam as mãos. A intenção é a de que esta função implicasse apenas na defesa com a mão e que o jogo sempre fosse encerrado (“game over”) quando utilizada, mas neste quesito faltou experiência e habilidade no Construct ao desenvolver o jogo e evitar estes possíveis eventos (que não eram previstos).</p>\n<p>A estética do jogo também foi comprometida devido esta falta de conhecimento técnico no Construct durante o desenvolvimento, como por exemplo: alguns textos que infelizmente não puderam seguir a estética “pixelizada” do jogo pois eu não consegui importar fontes personalizadas no Construct, o restante das fontes que são personalizadas foram inseridas como imagem e não como fonte, por isso funcionam. </p>\n<p>Foi planejado e até mesmo desenvolvido um sound design para ambientar melhor o jogo e proporcionar uma experiência mais interessante, porém não consegui inserir os mesmos dentro do jogo, mas eles existem no conceito original do projeto e com certeza se presentes fariam deste jogo um pouco mais interessante.</p>\n<p>De modo geral, a proposta do jogo funciona bem juntamente com este documento justificando a proposta, mas para um projeto futuro ou até mesmo o aprimoramento deste, seria interessante um estudo aprofundado na tecnologia do Construct para que o jogo pudesse ser melhor expressado sem o auxílio de uma explicação textual.</p>", "metacritic": null, "released": "2018-10-19", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/761/7613468f9d93e43d2ca025e4f6feb8ce.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 5, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["PedroLemoine"], "genres": [], "publishers": [], "esrb_rating": null}