{"id": 257125, "slug": "revolta-dos-buzios-220-anos", "name": "Revolta dos Búzios 220 anos", "name_original": "Revolta dos Búzios 220 anos", "description": "<p>Em 1798, ocorreu uma revolta separatista. Ela teve diversos nomes: Revolução dos Alfaiates, Revolta das Argolinhas, Conjuração Baiana e aqui vamos chamá-la de Revolta dos Búzios. E teve bastante influencia da Revolução Francesa com seu lema Igualdade, Liberdade e Fraternidade.\r\n  </p>\n<p>No período da Revolta dos Búzios a cidade de Salvador, com seus becos, ruas e praças no período colonial, 33 pessoas foram processados por tentarem promover um levante na cidade de Salvador contra a dominação Portuguesa. \r\n  </p>\n<p> \r\n  </p>\n<p>O fato ocorreu nos últimos anos do século XVIII, envolveu seis soldados da tropa paga, cinco alfaiates, três oficiais militares, dois ourives, um pequeno negociante, um bordador, um pedreiro, um professor, um cirurgião e um carpinteiro.\r\n  </p>\n<p> \r\n  </p>\n<p>Os quatro protagonistas da Revolta dos Búzio(Manoel Faustino de 18 anos, o alfaiate João de Deus, os soldados Lucas Dantas e Luiz Gonzaga) em 04 de março de 2011 foram considerados heróis devido à importância que tiveram para o Estado Brasileiro. Também foram incluídos no livro dos Heróis Brasileiros. A revolta também contou a presença feminina, dentre elas Ana Romana.\r\n  </p>\n<p>O Game é do gênero point and Click, com influencias de Graphic Novel, é produzido pela Strike Games em parceria com a Nix Gamelab e conta com músicas de Tonho Matéria. Tem o objetivo de regatar a cultura baiana e tem um cunho histórico e pedagógico.\r\n</p>", "metacritic": null, "released": "2018-10-19", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/dd3/dd3a259451f8863bc6be4bff100a69c7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 130, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["strikegames"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}