{"id": 257157, "slug": "sneaker-savior-a-game-about-protecting-your-kicks", "name": "Sneaker Savior: A game about protecting your kicks!", "name_original": "Sneaker Savior: A game about protecting your kicks!", "description": "<p>This is a project created for the Intermediate Games Development course at the NYU Game Center.</p>\n<p>HOW TO PLAY: </p>\n<p>WASD: Move around the level.</p>\n<p>Click: click on enemies and hazards to shove them away!</p>\n<p>1. It's Sunday morning, and you've overslept for church, oh no! You get dressed and put on your favorite shoes. As you step outside, you notice something has gone very wrong. There's trash everywhere! And there are muggers on the hut for fresh kicks! It's too late to head upstairs and change, the service is starting soon! You'll have to tough out this wild climate and make it to church without sullying your beloved footwear!</p>\n<p> I chose this topic for my game because when I was younger, I used to go to church with my grandmother every Sunday. I remember always wearing my favorite sneakers to church to look my Sunday best. Since I'm also very passionate about my sneakers, getting them dirty is a sin! I chose to combine those two memories/aspects of myself into a fun game for this project.</p>\n<p>2. The process of creating this game was fun at times and also very difficult. there were many times where I would hit coding roadblocks and not know what to do in order to resolve my issues. From tweaking the core mechanics, to figure out how UI buttons worked, I found myself becoming very frustrating when I could not figure out how to debug my code. Luckily, using resources such as Google, my peers, and my professors help make that process a little less of a pain for me.</p>\n<p> My favorite part about creating this game was coding the core mechanic of shoving hazards away. It was difficult to figure out, but once I did I was proud of myself. Not only that, clicking on stuff in the game is very satisfying, so I think I did a good job creating a core mechanic.</p>\n<p>Music: https://www.purple-planet.com</p>", "metacritic": null, "released": "2018-10-19", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/124/124d8770e898c230a6f60dbb5ede001d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 3, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["zayzizzurp"], "genres": [], "publishers": [], "esrb_rating": null}