{"id": 257180, "slug": "top-gunnes", "name": "Top Gun (1987)", "name_original": "Top Gun (1987)", "description": "<p>Top Gun is loosely based on the film of the same name. It is an action game in which the player controls an F-14 Tomcat fighter through four different missions.</p>\n<p>The action is seen from a first-person cockpit view. Depending on the mission, different kinds of targets must be destroyed. There are always enemy aircraft, but some missions include sea and ground targets as well. Two weapons are available: machine guns (with unlimited ammunition) and missiles. The player can choose from three types of missiles before a mission: the more powerful ones can only be carried in lower quantities.</p>\n<p>Enemy aircraft either overshoot the players&#39;s plane from behind and can be easily taken down, or they come from the front and fire guns and missiles. Sometimes, an enemy plane will position itself on the player&#39;s six. It should be lost quickly by steering left and right, or instant death follows.</p>\n<p>Halfway through missions two through four comes a refueling sequence where the fuel plane&#39;s nozzle must be aligned with one&#39;s aircraft.</p>\n<p>Every mission (except the first one) features a final mission target, which can take a lot more damage than regular targets.</p>\n<p>Each mission concludes with a landing attempt on the aircraft carrier. To successfully land, the player&#39;s plane must have a certain altitude and speed. Successfully landing gives bonus points, but crashing the plane doesn&#39;t end the game - it simply costs a life.</p>", "metacritic": null, "released": "1987-11-01", "tba": false, "updated": "2023-10-11T19:37:46", "background_image": "https://media.rawg.io/media/games/a65/a65361b96b1a883bf49423dcff8059f9.jpg", "website": "", "rating": 3.67, "rating_top": 4, "added_by_status": {"yet": 1, "owned": 22, "beaten": 20, "toplay": 2, "dropped": 23}, "playtime": 0, "achievements_count": 0, "ratings_count": 30, "suggestions_count": 224, "game_series_count": 0, "reviews_count": 30, "platforms": ["NES"], "developers": ["Konami Digital Entertainment"], "genres": ["Simulation"], "publishers": ["Konami"], "esrb_rating": null}