{"id": 25711, "slug": "shaun-white-snowboarding", "name": "Shaun White Snowboarding", "name_original": "Shaun White Snowboarding", "description": "<p>Enter a snowboarding world of total freedom. You can create your own<br />\nexperience in this game, and choose when, where, how and with whom you<br />\nwant to ride.<br />\nDeveloped in close collaboration with Olympic Gold Medalist Shaun White<br />\n– the most successful snowboarder in the history of the sport – Shaun<br />\nWhite Snowboarding is the next-gen game that redefines the action sports<br />\ngenre.</p>\n<p>Open-world mountains: Choose how you ride in open-world mountains<br />\naccross the globe. Conquer the extreme peak conditions, create your<br />\nown paths in the back country, or compete with fellow riders in the<br />\nterrain park.</p>\n<p>Your friends are always around: Play in a world where your friends are<br />\nalways around. Do you own runs on mountains populated by real gamers,<br />\nor join your friends for a quick session from anywhere in the<br />\nmountains.</p>\n<p>More than just snowboarding: Have fun with your friends on and off the<br />\nboard: Throw snowballs, hike to access secret spots, film your friends<br />\ndoing crazy tricks. You can also upload your videos online to share<br />\nwith the world.</p>\n<p>Ride your way: Express yourself through tricks, riding styles, and<br />\nhighly customizable avatars both in single-player and in the online<br />\nworld. Use the intuitive dual analog control to pull off a huge<br />\nvariety of tricks that express your style.</p>", "metacritic": 61, "released": "2008-11-14", "tba": false, "updated": "2023-08-24T09:08:06", "background_image": "https://media.rawg.io/media/games/98e/98e09a2c1f49b461d3e8748be3783fd0.jpg", "website": "http://shaunwhitegame.us.ubi.com/index.php", "rating": 3.7, "rating_top": 4, "added_by_status": {"yet": 2, "owned": 51, "beaten": 17, "toplay": 6, "dropped": 21, "playing": 2}, "playtime": 0, "achievements_count": 48, "ratings_count": 20, "suggestions_count": 369, "game_series_count": 0, "reviews_count": 20, "platforms": ["PSP", "Nintendo DS", "PC", "PlayStation 2", "PlayStation 3", "Xbox 360"], "developers": ["Ubisoft"], "genres": ["Action", "Sports"], "publishers": ["Ubisoft Entertainment"], "esrb_rating": "Teen"}