{"id": 257270, "slug": "extopia", "name": "Extopia", "name_original": "Extopia", "description": "<strong>20XX</strong>. The world as you know it is gone. In its place spawned the land known as \"Oasis\", a so-called paradise in a world filled with chaos. Five major factions control the Oasis through manipulation of trade, military might, and tentative alliances; spurred on by the equipment and weaponry supplied by their global manufacturers.<br/><br/>You, the player, take the role of a new recruit entering Oasis to make a name for yourself among the factions. Thrust into the middle of an all-out war between <strong>\"Lion's League\"</strong>, <strong>\"Aqua Corps\"</strong>, <strong>\"Lotus Sector\"</strong>, and <strong>\"Serpent Labs\"</strong>, you must choose which side to stake your claims while being careful to not make enemies with the wrong people.<br/><br/>Extopia features all the FPS gametypes you know and love, along with a <strong>\"DIY Battle Royale\"</strong> gamemode made possible through the flexible level editor built into the backbone of many of Extopia's systems. In this gamemode, you are given the freedom to build and destroy various objects such as barriers, boxes, ladders, and ramps in order to gain a tactical advantage against your opponents.<br/><br/><strong>Features:</strong><br/><ul><li><strong>DIY System:</strong> From creating personalized weapon skins to designing entire 8x8km Battle Royale maps one building at a time; Extopia's DIY system puts the power of creation in the hands of the player, and allows creations to be shared or perhaps even sold to other players. <br/><br/></li><li><strong>Character Customization:</strong> After choosing male or female, nearly all aspects of your character can be modified in detail, using a multiple system of sliders to ensure your character looks and feels exactly as you'd like.<br/><br/></li><li><strong>PvP, PvE, or somewhere in between:</strong> Compete against other players in PvP, or work together to conquer challenging missions against AI controlled monsters. Most PvP gamemodes can also be played against AI for training or for fun!<br/><br/></li><li><strong>Satisfying Gamefeel:</strong> All the guns are built with player satisfaction in mind; from recoil, to hit splash, screen space, and more. We believe every gun should feel satisfying to use, and easy to get a feel for.</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-23T12:11:26", "background_image": "https://media.rawg.io/media/screenshots/96c/96c5438f06ad6ff759afc008baf46cdb.jpg", "website": "https://subagames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 291, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["KingSoft"], "genres": ["Action", "Massively Multiplayer"], "publishers": ["SubaGames"], "esrb_rating": null}