{"id": 257306, "slug": "bugs-must-die", "name": "Bugs Must Die", "name_original": "Bugs Must Die", "description": "<strong>Do you want to live like a coward for a lifetime? Or live like be a hero, even if only for a few minutes?  Show your bravery in Bugs Must Die!</strong><br/><br/>\"Bugs Must Die\" is a fast-paced modern retro top-down shooter where players fight against alien bugs and bosses by controlling heavy armored vehicles and agile special agents. As an elite from the Galactic Pests Control Company, you are sent to the planet M-79 to prevent Mantis Beings from invading Earth. On the terrestrial planet, you not only have to destroy the cruel Mantis soldiers but also battle with the various Bosses cloned from Earth pop culture.<br/><br/>Shooting them with a machine gun, blasting them with missiles, dashing them with a vehicle, whipping them with an energy chain, or burning them with a napalm...No matter how you get it done, “ALIEN BUGS MUST DIE!”<br/><br/><strong>Features</strong><br/>Gamers Of Any Levels Can Beat the story Mode!<br/>Hardcore gamers: Try to beat the game using just the basic weapons-show off your superb skills. <br/><br/>Average gamers: Never fear! Spend coins obtained from missions to update your vehicles and weapons to take down the bugs with ease.Different characters to choose from! Equip them with various weapons to show off your unique fighting style!<br/>2 Mantis Agents that have completely different fixed weapon systems and rolling dodge mechanisms.<br/><br/>3 powerful vehicles: Equip up to 6 main weapons and 9 sub-weapons, but that’s not all! Equip a “Battle Core” which deploys when your vehicle is destroyed to keep the fight going!<br/><br/>4 major categories of equipment with more than 35 options. Did we mention the superweapon !? It launches a full-screen attack! BOOOOOOM！！！Story Mode, Challenge Mode, and Hell Mode will bring well over 10 hours of gameplay.<br/>Story Mode: 16 levels with one boss per level, clearing all the levels will unlock all characters!<br/><br/>Challenge Mode: 8 levels with one boss per level. In addition to the 16 bosses from Story Mode, you’ll encounter additional secret bosses randomly. To come across all available bosses, Challenge Mode is a must!<br/><br/>Hell Mode: Start this mode only with one basic weapon. The more levels that you pass the greater the loot!All Bosses are cloned from Earth pop culture by Mantis Beings!", "metacritic": null, "released": "2018-09-24", "tba": false, "updated": "2020-03-25T11:39:27", "background_image": "https://media.rawg.io/media/screenshots/6ae/6ae98b1b0fff95488635fb38fb73fce4.jpg", "website": "https://dggamesworkshop.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 5}, "playtime": 1, "achievements_count": 10, "ratings_count": 0, "suggestions_count": 295, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Dragonglass Games", "DG Games Workshop"], "genres": ["Action", "Shooter", "Adventure", "Indie"], "publishers": ["DG Games Workshop"], "esrb_rating": null}