{"id": 257335, "slug": "gravity-wars-black-hole", "name": "Gravity Wars: Black Hole", "name_original": "Gravity Wars: Black Hole", "description": "Have you ever created heavenly bodies? And here it is done in one<br/>\r\ntouch!<br/>\r\nGreat, now you can fill the vast expanses of space -<br/>\r\nnew, pouring light into infinity, stars!<br/>\r\nWould you like to launch a satellite into orbit?<br/>\r\nTake it higher - run a small star into the orbit of the giant, and it will be beautiful<br/>\r\nThe circling around, demonstrating the beauty of gravity and leaving behind<br/>\r\nsoft flaming tail.<br/>\r\nImpressive? - But you can do much more!<br/>\r\nCreate whole constellations, expand the boundaries of your possessions, feel yourself<br/>\r\ncreator of the universe and meet face to face with his rival in<br/>\r\nexciting, spectacular, universal scales of battle!<br/>\r\nUse the stars as weapons, run through the objects of the opponent, light up<br/>\r\nouter space by colossal explosions from giant<br/>\r\nsupermassive collisions and finally, create the worst<br/>\r\nuniverse weapon - a black hole! No heavenly body can<br/>\r\nto resist her incomprehensible gravity. Traveling by territory<br/>\r\nopponent, it will effectively absorb everything in its path, not<br/>\r\nleaving no chance of preservation, leaving nothing but<br/>\r\nof darkness.<br/>\r\nDo you want to see all this in 3D? Elementary!<br/>\n<br/>\r\nThe strategy is simple:<br/>\n<br/>\r\n- There is only one resource - energy. It is needed to create gaming<br/>\r\nobjects.<br/>\r\n- The main object is a giant star. To produce energy,<br/>\r\nYou need to launch a small star into the orbit of the giant. More stars - more<br/>\r\nproduced energy.<br/>\r\n- The more giant stars in a player, the more energy they cost<br/>\r\nspace objects.<br/>\r\n- If a player loses all the giant stars, he loses. Giant can be<br/>\r\nDestroy or shelling with small stars, or by absorbing a black hole.<br/>\r\n- Several giants form constellations - this is the protective perimeter of the player's territory. Only the object can pass through the perimeter. Foreign objects, except for a black hole, are destroyed.<br/>\r\n- Also, you can get energy for destruction or for absorption<br/>\r\nobject. If you destroy the small star in the first seconds, after it<br/>\r\ncreation - then it will give more energy. This is effective when intercepted<br/>\r\nattack opponent.<br/>\n<br/>\r\nThere are two single player modes:<br/>\n<br/>\r\n- Rating game - is presented in the form of a set of levels for passing.<br/>\r\nThe effectiveness of each level is summarized in the overall rating and<br/>\r\nis entered in the general table of records.<br/>\r\n-Training battle - a game in normal mode against computers where you can<br/>\r\nchoose the size of the map and the complexity of the AI.", "metacritic": null, "released": "2018-11-05", "tba": false, "updated": "2019-08-28T21:51:55", "background_image": "https://media.rawg.io/media/screenshots/6ae/6aeeeeb666abdf75aa087734be0b6e02.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 166, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["stariy8419"], "genres": ["Simulation", "Indie"], "publishers": ["stariy8419"], "esrb_rating": null}