{"id": 257377, "slug": "boomerang-fu", "name": "Boomerang Fu", "name_original": "Boomerang Fu", "description": "<p>Every round of Boomerang Fu high-stakes showdown with one-hit kills and bouncy boomerang physics. Transform your character from a startled banana into an unstoppable killing machine with persistent powerups like wildfire, ice trails, disguises, telekinesis and more. Powerups stack together between rounds to form dangerous combinations that could turn the tide of battle of backfire hilariously.<br />\nEach match of Boomerang Fu can be a finely-balanced ballet of blades or a comedy of errors. Simple controls let newcomers grill, chill and tenderise their opponents within seconds, while advanced players will uncover the hidden depths of this lost martial art by learning to deflect attacks and curve boomerangs around corners. And everyone can use the environment against their foes, setting off traps, hiding in bushes, or pushing one another into treacherous koi ponds.<br />\nFrantic action, multiple game modes and a formidable cast of AI opponents make Boomerang Fu the perfect start to a Friday night in with new friends or bitter rivals.<br />\nFeatures<br />\nChoose from a cute cast of playable food characters<br />\nFight with up to 4 friends in slapstick kung fu arenas<br />\nStack powerups together in silly or deadly combinations<br />\nMaster the hyper-realistic boomerang physics to get an edge over your enemies<br />\nEngage in senseless but adorable violence thanks to one-kit kills<br />\nUse your favourite XBox, PlayStation or Steam controllers<br />\nGame modes Deathmatch: Do battle with boomerangs in deadly arenas. Points are awarded for kills or last food standing.<br />\nTeam Up:: Team up against your friends or challenging AI opponents. Don&#39;t want a fair fight? Everyone can team up against the best player in the room.<br />\nGolden Boomerang: Fight to hold onto the golden boomerang in an asymmetric &quot;1 vs many&quot; showdown.Stackable powerups Caffeinated<br />\nDash Through Walls<br />\nTeleport Boomerang<br />\nExplosive Boomerang<br />\nMulti Boomerang<br />\nFire Boomerang<br />\nIce Boomerang<br />\nDisguise<br />\nShield<br />\nTelekinesis</p>", "metacritic": null, "released": "2020-08-13", "tba": false, "updated": "2023-08-31T08:14:50", "background_image": "https://media.rawg.io/media/screenshots/8d8/8d84c9b411822404205342f53fb98285.jpg", "website": "http://www.boomerangfu.com", "rating": 3.83, "rating_top": 4, "added_by_status": {"yet": 45, "owned": 734, "beaten": 20, "toplay": 9, "dropped": 11, "playing": 4}, "playtime": 4, "achievements_count": 26, "ratings_count": 23, "suggestions_count": 101, "game_series_count": 0, "reviews_count": 23, "platforms": ["Nintendo Switch", "PC", "Xbox One"], "developers": ["Paul Kopetko"], "genres": ["Action", "Indie"], "publishers": ["Paul Kopetko"], "esrb_rating": null}