{"id": 257466, "slug": "panzer-sturm-ii", "name": "Panzer Sturm II", "name_original": "Panzer Sturm II", "description": "Panzer Sturm II, a perfectly balanced tank strategy game, is developed by the original team of Panzer Sturm with 4 years efforts. Various well-known tanks for you to choose from. The combination of sea, air and land forces helps you sweep enemies. <br/> <br/>Manage base and unlock the most powerful tanks. Make strategic decisions in the way you want your base develop. Create your legion and defend the honor of it with members. The vast world is open to be explored. Mine resources and clear pirates, rebels and terrorists on the world map to enforce justice. Come and play Panzer Sturm II, the destiny of your legion depends on you.<br/><br/>Features:<br/>\tHighly polished interface with stunning retina graphics <br/>\tVarious explosive battle modes, including single, legion, city and country<br/>\tCoordination of Sea, Air and Land forces<br/>\tCollect 110+ iconic tanks around the world for you<br/>    Unlock and deploy tanks depending on your strategy, and send the most powerful beasts to <br/>sweep enemies<br/>\tDeep tank upgrade system, customize tanks with parts you want<br/>    Well-designed tank upgrade system for you to upgrade and arm tanks at your will<br/>\tOccupy and defend cities with legion members<br/>    Launch attack to occupy cities on the world map with legion members and fight back all invaders. Achieve the goal of world hegemony<br/><br/>Unite commanders from all over the world and build your own tank empire! The future is in your hands, download the best war strategy game for free now!<br/><br/>Like Panzer Sturm II on Facebook to get news and updates :<br/>https://www.facebook.com/PanzerSturmII<br/>Contact us via ps2en@movga.com if you need help", "metacritic": null, "released": "2018-10-20", "tba": false, "updated": "2019-10-22T14:36:52", "background_image": "https://media.rawg.io/media/screenshots/215/2150600278574577d662ba21796d7871.jpg", "website": "https://www.facebook.com/PanzerSturmII", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 278, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Xiaofei XiaofeiZhao"], "genres": ["Adventure", "Strategy"], "publishers": ["Xiaofei XiaofeiZhao"], "esrb_rating": "Everyone 10+"}