{"id": 257504, "slug": "zombie-defense-hng", "name": "Zombie Defense HNG", "name_original": "Zombie Defense HNG", "description": "Today, 7 billion humans live on our planet.<br/>Over 100 billion lived and died on it in the past.<br/>What if just a tenth of them came back... for us?<br/><br/>A modern hybrid of the classic RTS and modern Tower Defense.<br/>Recruit soldiers, place them on slots and let them shoot incoming waves of zombies by their own.<br/>Manually move soldiers between slots, upgrade slots and soldiers, order supplies, <br/>throw grenades and molotovs, order airstrikes and operate huge bulldozers.<br/>Perfect mix of strategy, tactics and micromanagement.<br/><br/>Earn money on missions and spend them between missions to buy permanent technologies, upgrades, weapons ect.<br/><br/>Features<br/>- 49 missions.<br/>- 5 difficulty modes regular, nightmare, 3 man challenge, TV challenge, boss challange<br/>- 22 types of recruits.<br/>- 150 permanent upgrades between each mission.<br/>- 8 basic enemy types, from shambling creatures, to crawling horrors, to fast predators.<br/>- 2 types of giant mutant zombie bosses for extra action.<br/>- Zombie birds<br/>- Decoys<br/>- A gun rack of weapons, from trusty .38s, to deadly shotguns, to ultra-accurate sniper rifles.<br/>- High explosives to turn zombies into pink jelly.<br/>- Molotov cocktails to stop zombies with a blazing inferno.<br/>- Heavy vehicles to crush every zombie in their path.<br/>- Laser-activated turrets. <br/>- Devastating airstrikes.<br/>- Tesla towers<br/>- Supply deliveries.<br/>- Real-time soldier upgrades, recruitment and trading.<br/>- Infinite mode for hardcore players who crave endless excitement.<br/>- Special challenge modes.<br/>- High replayability allows you to complete each mission and return to it as you please, to earn more money and rise your score.<br/>- Full 3D environment, highways, towns and deserts.", "metacritic": null, "released": "2016-09-17", "tba": false, "updated": "2019-11-20T10:56:59", "background_image": "https://media.rawg.io/media/screenshots/6c6/6c62a0ea2c5fce2f44bd543c7e8be9b8.jpg", "website": "https://www.homenetgames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 418, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "iOS"], "developers": ["Teresa Dymek"], "genres": ["Action", "Strategy"], "publishers": ["Teresa Dymek"], "esrb_rating": "Teen"}