{"id": 257554, "slug": "drop-sloth-twist-twitch-and-test-your-reflexes", "name": "Drop Sloth - Twist, Twitch and Test your Reflexes", "name_original": "Drop Sloth - Twist, Twitch and Test your Reflexes", "description": "Tired of being Flappy and Angry?  Then it's time to get Droppy!  <br/><br/>Have some of what Jack's having:<br/><br/>\"Literally the best game ever made on windows phone, makes me cry every time, certain things happen once every millennium, a random amalgamation of perfect things, I feel it my mission to spread the news of this excellent work of art. To think a sloth could high dive.... My mind is blown.\"<br/>by jack<br/><br/>You're a sloth, navigating through rings, diving into the water.  You're being rated, and can only advance if you convince your animal judges that you deserve it.   <br/><br/>The judges rate you based on how vertical the sloth is as he enters the water, as well as if you successfully navigate the rings.  How many levels can you achieve before the judges send you back to the start?  Can you do 10? <br/><br/>Tokens can be used to start at higher levels or to try again at certain levels.  You will earn tokens each day you play the app, but they are rare so spend them wisely. <br/><br/>There are two modes of play, one with gates and one without.  These can be accessed via the Options menu.  <br/><br/>Hone your twitch skills, and try to get to higher levels.  Earn badges, share your victories.  Sloths like dropping from trees, so keep trying! SLOTH!", "metacritic": null, "released": "2014-06-29", "tba": false, "updated": "2019-10-28T03:12:44", "background_image": "https://media.rawg.io/media/screenshots/8bb/8bb922b24e3309e4671a184ac6b59078.jpg", "website": "http://www.youtube.com/watch?v=yln8MwfdkiI", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 26, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Blocshop"], "genres": ["Action", "Arcade", "Casual"], "publishers": ["Blocshop"], "esrb_rating": "Everyone 10+"}