{"id": 257759, "slug": "red-ant-simulator-3d", "name": "Red Ant Simulator 3D", "name_original": "Red Ant Simulator 3D", "description": "Do you like animal simulators? Play Red Ant Simulator 3D and try to help a lonely insect to stay alive in a dangerous microworld! Imagine you are a little scout in the forest full of aggressive giant predators. You strayed from your ant colony and now you are searching the right way to return home. It will be an epic struggle, we promise! <br/>So, be attentive, aggressive predators, such as, bees, beetles, spiders or butterflies are nearby you. Enter this highly detailed 3D insect world as a red ant don’t forget to mind ant’ indicators to survive. Control your indicators. Your ant has health, energy, water and food indicators. And if one of it drops – there is no chance to stay alive! Collect enough resources, upgrade your insect’s skills to be more effective in this epic struggle. Use the map of this microworld to get out the wilderness.<br/>Red Ant Simulator 3D features:<br/>Help the cute ant to find it’s colony<br/>Use the map to choose the right way<br/>Feel like a part of the forest full of bugs<br/>Struggle against giant predators<br/>Use the points to upgrade your bug<br/>Enjoy realistic graphic with lifelike creatures<br/>Stay alive as long as possible in this microworld<br/>Explore wilderness and get an unforgettable experience<br/>Become the bug from the giant microworld, run through the forest to find food and water, fight against other aggressive insects, stay alive and return to your colony in Red Ant Simulator 3D game!", "metacritic": null, "released": "2016-06-03", "tba": false, "updated": "2019-10-22T14:00:22", "background_image": "https://media.rawg.io/media/screenshots/34d/34d6e60a1f457e10820b14a4356073f1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 160, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Games Banner Network"], "genres": ["Adventure", "Simulation"], "publishers": ["Geimz Banner Netvork, OOO"], "esrb_rating": null}