{"id": 257756, "slug": "cargo-ship-crane-simulator-3d", "name": "Cargo Ship Crane Simulator 3D", "name_original": "Cargo Ship Crane Simulator 3D", "description": "Try yourself working at the sea port! Control cargo loader, lift heavy containers or other cargo and prove your worth as a crane operator! Enjoy driving huge port crane with realistic physics with our new 3D simulator!<br/><br/>Load huge cargo ships with containers and other stuff operating forklifts and tower cranes located inside realistic sea port environments. This loading simulator gives you a chance to operate different heavy vehicles – cranes, loaders and transporters! Upgrade driving and transporting skill with this new cargo game in 3D!<br/><br/>Feel like a real crane operator with this Cargo Ship Crane Simulator 3D game! Load or unload, drive, lift and transport! Freight huge containers, blocks and other cargo using special tower crane - it’s even more funny that it seems. Or a ship might be full of heavy containers and your goal as an operator will be to unload it using suitable vehicle! Heavy tower cranes, forklifts and other transporting machines are waiting for you! This simulation will give you a different concept than all the other city construction simulators have! It' not like simple construction crew games building bridges, loading cargo on driving construction machines! Avoid crashes – your cargo might be fragile so lift and load it accurately! Work at realistic sea port loading ships with heavy containers with Cargo Ship Crane Simulator 3D - feel like an operator driving a tower crane with this transporting simulator!<br/><br/>Cargo Ship Crane Simulator 3D features:<br/><br/>- Huge sea ports full of ships ready for loading<br/>- Different vehicles to operate – forklifts, tower cranes and other transport machines<br/>- Detailed cabin for a tower crane operator<br/>- Load or unload ships with various cargo – heavy containers, cars, blocks and more<br/>- Great cargo crane simulator in 3D<br/><br/>Being a crane operator is not as easy as it seems! Operate a tower crane or a forklift to unload ships and transport cargo! Be accurate not to damage it! Upgrade your driving skill and prove your worth as a heavy crane operator! It’s not like playing simple construction games, building houses and driving construction machines. Try yourself as a sea port driver with Cargo Ship Crane Simulator 3D game!<br/><br/>Great simulator for those who loves to drive, transport and construct! Become the best crane operator in whole port!", "metacritic": null, "released": "2015-09-13", "tba": false, "updated": "2019-10-22T14:32:33", "background_image": "https://media.rawg.io/media/screenshots/24b/24b432550b12a418a90657ed9dece84f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 114, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Games Banner Network"], "genres": ["Simulation"], "publishers": ["Geimz Banner Netvork, OOO"], "esrb_rating": "Everyone 10+"}