{"id": 257755, "slug": "euro-truck-simulator-3d-free", "name": "Euro Truck Simulator 3D Free", "name_original": "Euro Truck Simulator 3D Free", "description": "Great driving simulator for those who loves high speed racing! Drive heavy loaded truck through the city streets, autobahns and highways to deliver cargo on time! Feel like a real trucker, explore European roads and autobahns, complete challenging loader, transfer and delivery missions and enjoy this driving simulator for all ages – even children and toddlers!<br/><br/>Your goal as a truck driver is to deliver goods and earn money for delivery! Great truck driving economic game! Faster you drive your truck and deliver the goods - more money you earn! Try this Euro Truck Simulator 3D!<br/><br/>Keep the goods safe – drive fast, but accurate! Prove your worth as the best European trucker playing this truck driving simulator in 3D! Your aim is to find goods to deliver and drive a truck fast to deliver goods on time. Avoid accidents - don't demage your truck or goods! Get your driving skills to work with Euro Truck Simulator 3D! Driving huge loaded truck with a trailer is not as easy as it seems, huh? Explore city roads as a driver, deliver a cargo and enjoy urban European landscapes! <br/><br/>Euro Truck Simulator 3D features:<br/><br/>- Great truck simulator - deliver goods in time or forget about the delivery fee!<br/>- Realistic driving situations<br/>- Various types of cargo to load, deliver and transfer<br/>- Upgrade your truck to a pro level – more space for cargo, bigger trailer, more powerful engine and more<br/>- Ultimate 3D graphics<br/><br/>Be a truck driver with this driving simulator! Upgrade a truck to have more space for your goods or drive faster! Improve your driving skills with Euro Truck Simulator 3D!", "metacritic": null, "released": "2015-12-19", "tba": false, "updated": "2019-10-22T14:00:22", "background_image": "https://media.rawg.io/media/screenshots/785/78543d9d30055c4f60957e427c0778db.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 125, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Games Banner Network"], "genres": ["Simulation", "Racing"], "publishers": ["Geimz Banner Netvork, OOO"], "esrb_rating": "Everyone 10+"}