{"id": 257941, "slug": "forklift-operator-game-city-fork-lift-simulator", "name": "Forklift Operator Game: City Fork lift Simulator", "name_original": "Forklift Operator Game: City Fork lift Simulator", "description": "<p>Get ready to operate real fork lifter in this Forklift Operator Game: City Fork lift Simulator. Show your forklift operating skills in cargo and car lifting. This fork lift driving simulator needs high car driving skills. This is the best forklifting game to cargo containers, cars and big boxes. Drive fork lifter to pick up cargo and take real forklift challenge. Fork lift driving simulator is also one of parking games too. <br/><br/>This forklift driver game has a variety of challenges for cargo transport. You need driving skills like car and excavator driving games. Forklift operator game is having different extreme forklifting 3D simulator challenges. Pick up the cargo by fork lift and drop off to the given point. This is different game to other heavy machinery games like crane simulator or bulldozer simulator and truck driving games.<br/><br/>Forklift Operator Game: City Fork lift Simulator Features:<br/>* Realistic warehouse environment provided for Forklift operation.<br/>* Enjoy effective and smooth controls of fork lift driving.<br/>* Different warehouses for cargo Service.<br/>* 12 levels of real forklift challenge.<br/>* 4 different models of extreme fork lifters.<br/><br/>You have different real challenges of cargo loading and operate forklift in warehouse for luggage movement. This 3D simulator game is proving you the real warehouse environment for cargo forklift driving simulator. So, be the best forklift driver and enjoy the stunning graphics of realistic warehouse with its best challenging levels. Cargo forklift games is very near to car lifter games and forklift operating techniques are same but with new real forklift challenges.<br/><br/>Download Forklift Operator Game: City Fork lift Simulator to test your driving skills. Rate and review it.</p>", "metacritic": null, "released": "2018-10-24", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/582/582bce6b583435d7692831d0714b1164.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 124, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Apex Logics"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}