{"id": 25794, "slug": "high-voltage-hot-rod-show", "name": "High Voltage Hot Rod Show", "name_original": "High Voltage Hot Rod Show", "description": "<p>\n      Rev up your Hot Rod and race up to 3 of your friends! Master \n      death-defying stunts and post your best times online! \n    </p><p>\n      High Voltage Hot Rod Show is a slick and fast-paced racer that \n      challenges up to four players to tear up the track on a variety of \n      off-road courses, mastering death-defying stunts and building enough \n      Boost to stomp the competition. Players must learn to tame their monster \n      Hot Rods by nailing ramps, power slides, bunny hops, and tricks while \n      avoiding mud pits and smashing through Boost Rings to fill their Boost \n      Meters. Players can compete against seven CPU opponents in Championship \n      mode or set their best lap times in the time trials. Top times can be \n      uploaded to an online scoreboard via Nintendo Wi-Fi Connection and \n      shared with players around the world. Multiplayer supports up to four \n      players in split-screen mode, giving each player a wide range of \n      controller choices. High Voltage Hot Rod Show is an addictive racer that \n      fully leverages the company's cutting-edge technology!\n    </p><p>\n      As of May 20, 2014, the Nintendo Wi-Fi Connection service for Nintendo \n      DSi and Wii systems has been retired. Online features of this game are \n      no longer available after this date but this game still provides an \n      entertaining experience in offline mode.\n    </p><p>\n      To learn more about this service change, please visit To learn more \n      about this service change, please visit support.nintendo.com/servicesupdate.\n    </p>", "metacritic": null, "released": "2009-01-19", "tba": false, "updated": "2019-09-12T06:38:17", "background_image": "https://media.rawg.io/media/screenshots/670/670db7812ca7a3ebf6023b991cf75c3b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 333, "game_series_count": 0, "reviews_count": 0, "platforms": ["Wii"], "developers": [], "genres": [], "publishers": ["High Voltage Software"], "esrb_rating": null}