{"id": 257912, "slug": "code4coffee-fix-webgl", "name": "Code4Coffee (fix + webgl)", "name_original": "Code4Coffee (fix + webgl)", "description": "<p>This is a bugfixed version of my Blackthornprod Gamejam #1 entry \"Code4Coffee\" (https://gaschd.itch.io/code4coffee). The original version had critical bugs that can make the game unplayable after the first coffees. I will merge both versions after the ratings are over, so please comment on the original link.<br/></p>\n<p>Changelog (24.10.2018):</p>\n<ul><li>Critical: Coffee won't spawn outside the area anymore</li><li>Critical: Camera won't lose focus on the player anymore</li><li>Coffees will respawn correctly</li><li>Tweaked movement a little bit so it's less frustrating</li><li>Animated the green arrow so it's more obvious where to go.</li><li>WEBGL-version for easier accessibilty (Had to change Powerup from \"Alt\" to \"CTRL\")</li></ul>\n<p>--------------------------</p>\n<p>My contribution to the Blackthornprod GAME JAM #1.</p>\n<p>You work as a dev in a game company. Move around your new office with code to get as many coffees as possible and avoid your collegues. <strong>Have fun!</strong>\n</p>\n<p><strong>Instructions</strong></p>\n<p>You need a keyboard to play this game. Enter the code lines you see on the screen to move your Player in the direction of the codeline and collect coffees.</p>\n<p>It's really important to type the the codelines correctly, so check the case sensitivity + spelling and don't forget the semicolon :). Additional/Less whitespaces infront or after the characters \"=(),;\" are valid.\r\n</p>\n<p>The speed you gain is dependend on the number of characters in the codeline.</p>\n<p>The green arrow points towards the coffee, the white arrow is your current direction.\r\n</p>\n<p><strong>Hints</strong></p>\n<p> If you have &gt;10 Coffees you've discoverd all mechanics (enemies, 2 powerups), but you can still play the game and earn more.</p>\n<p>Autocomplete Powerup explained: Your autocomplete only works if the codeline is unique in the current window, so if there is \"int armor = 310;\" and \"int armor = 130;\", you have to either type \"int armor = 3\" + TAB or \"int armor = 1\" + TAB to move in the direction.\r\n</p>\n<p><strong>Credits</strong></p>\n<p>Background generated with : http://patternico.com</p>", "metacritic": null, "released": "2018-10-24", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/d40/d4019612aaec0710f08242c1403b5637.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 46, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["gaschd"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}