{"id": 257931, "slug": "make-my-house", "name": "Make My House", "name_original": "Make My House", "description": "<p>2 day project for internship acceptance task. Made using Unity engine.</p><p>Tried to create \"Sims\" style building system with interactive menus where player can choose what he would like to build on the map.</p><p>When starting a new game player has an option to decide what size of land he prefers to build in. (x and y scale of land). </p><p>When loaded a map, player can choose between two modes: preview and edit. While in preview mode, player can freely move around the map without interacting with the map.</p><p>While in edit mode player can still move around the map, but a new menu pops up, where player can choose what to build on the land. There are five categories of items to choose from (floor, walls, furniture, environment and color). When selecting floor or wall categories a player can place the selected items to their liking. To distinguesh rooms a new menu pops up, where you can select the number of layer. Each layer has its' color. When selecting furniture or environment categories player is shown a list of items to select from. Each item has its own size so planning is necessary before placing the item. Last category is color. Selecting it opens a menu with different colors to choose from. Colors can be applied to floors, walls (color is applied to a whole layer) and furniture items. Also while in edit mode player can easily destroy object while pointing at them with a mouse and pressing the right mouse button.</p><p>Some bugs are still present because of the short development time:</p><p>-Walls can be placed in the same position of existing wall creating a layer of walls in the same position</p><p>-UI does not block the mouse, so pressing something in the menu while pointing at the interactible object can cause some unwanted events.</p><p>-While player has selected an item to place but destroys the object that already exists on the map disables an option to place the selected item on the ground (object does not turn green disabling the option to place on the map). To avoid this select the wanted item again in the menu.</p>", "metacritic": null, "released": "2018-10-24", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/2b2/2b2cc7d7c7d614f2537f763d81e23010.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 58, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MrPeJay"], "genres": [], "publishers": [], "esrb_rating": null}