{"id": 257903, "slug": "luminous-driller-contusion-spiritual-occupy", "name": "Luminous Driller Contusion: Spiritual Occupy", "name_original": "Luminous Driller Contusion: Spiritual Occupy", "description": "Luminous Driller Contusion: Spiritual Occupy<p>Dreamy walking simulator, created for the Emulated Dreams jam, 2018. Take a trip into a surreal world inspired by my weirdest dreams of the last few years, and find the hidden message!</p>\r\nBackground\r\n<p>I actually found out about the jam only a few hours before the deadline, so it was super unlikely that I will manage to submit anything I'd call \"complete\"... but since I liked the topic so much, and wanted to create something like this sometime anyway, I felt like I couldn't afford to miss it... and in the end, I <em>barely</em> finished it before the extended deadline. I'm tired but happy – at the time of writing is description, I'm almost in a dreamy state.</p>\r\nAcknowledgements\r\n<p>Admittedly, I cut some corners:</p>\n<ul><li>Most of the code is taken from the article series by Jacob Seidelin about<br/>creating a ray casting engine with JavaScript, DOM and Canvas. I made<br/>slight changes to it to fit my purposes for the jam better, but those<br/>are very minimal.</li><li>The project name was generated with Diceware, so it could have been a strong password... but please don't use it as your password</li><li>The high-quality images were downloaded from Pixabay (floor image, sky image)</li></ul>\n<p>So thanks to all of these people for unknowingly making this surreal mess possible!</p>", "metacritic": null, "released": "2018-10-24", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/2d5/2d52bd0aedaca07e26102c96356c1270.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 91, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["madve2"], "genres": [], "publishers": [], "esrb_rating": null}