{"id": 258014, "slug": "toil-and-trouble", "name": "Toil and Trouble", "name_original": "Toil and Trouble", "description": "<p><strong>The Moon rises high o'er the Wood on this night.<br/>Where four Witches gather and cackle delight.<br/>Toiling away at their spells and their brew.<br/>Looking for Trouble? For it has found you.</strong></p>\n<p>Toil and Trouble is a smaller RPG that revolves around exploring and battling with a party of four Witches. The Woods are often a bit directionless, and our Witches may find themselves in more danger than they'd like if they aren't careful.</p>\n<p>Stylized after the strategic and turn-based JRPGs of old, the game confronts its players with compelling combat scenarios and customization options. The Witch's spells, Rituals, equipment, crafting system, and especially enemies are Toil and Trouble's most intricately designed features.  Around every corner is another new challenge to face.</p>\n<p>That being said, our Witches aren't without their weaknesses. Baba Yaga has brought forth their Vices, demonic faeries that represent figures from their mysterious pasts. And each is ready for a fight.</p>\n<p>Will the Witches best their Vices and defeat Baba Yaga? Or will they be vexed by the mysteries of the wood and the ghosts from their history?</p>\n<p>An \"Assist Mode\" is available for players who just want to have a good time exploring the forest, meeting new bad guys, and watching the story. All art and music is custom made, by me, ScientistWD. </p>\n\n<p>You're welcome.</p>\n<p><strong><em>This game is free until after Halloween. Best to pick it up soon.</em></strong><br/></p><p>(The Mac version is known to have problems saving, loading, or accessing the options menu. I believe I have fixed them, but let me know if you have these problems.<strong>)</strong></p>", "metacritic": null, "released": "2018-10-23", "tba": false, "updated": "2019-08-28T23:19:50", "background_image": "https://media.rawg.io/media/screenshots/a9b/a9baadf4b17f731c1c0e03c341a26933.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 194, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["ScientistWD"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}