{"id": 25823, "slug": "dragon-quest-v-hand-of-the-heavenly-bride", "name": "Dragon Quest V: Hand of the Heavenly Bride", "name_original": "Dragon Quest V: Hand of the Heavenly Bride", "description": "<p>\n      DRAGON QUEST V: Hand of the Heavenly Bride–the second installment in the \n      Zenithia Trilogy–makes its way to North America for the first time. \n      Follow a journey that crosses three generations of a family’s legacy in \n      a classic RPG brimming with new ideas, numerous lands to explore, \n      multiple branches to enhance replayability, and dozens of your favorite \n      DRAGON QUEST monsters. What begins as an innocent childhood voyage of a \n      boy following alongside his father’s journey soon develops into an \n      eye-opening adventure of a brave young man traveling the world as he \n      faces life-altering decisions that transcend generations. You – a hero \n      in the making – determine your own path, choose your wife, and befriend \n      a wagonload of quirky monsters along the way. Indulge in the colorful \n      DRAGON QUEST world created by Yuji Horii, combined with the charming \n      characters and monsters designed by Akira Toriyama and memorable \n      soundtrack from famed composer Koichi Sugiyama to create an \n      unforgettable gaming experience.<br/>\n</p><ul>\n<li>\n        Journey through a beautifully rendered 3D world, with dynamic \n        dual-screen presentation and newly animated monsters\n      </li>\n<li>\n        Recruit a unique cast of DRAGON QUEST monsters and create an \n        indestructible party of your own\n      </li>\n<li>\n        Brace yourself for some life-altering decision making – a key decision \n        will affect the outcome of the game, and change the course of the \n        hero's life forever\n      </li>\n<li>\n        Take a breather from the main quest with addicting mini-games like \n        Bruise the Ooze, T'n'T, the Slurpodrome, and the Tombola\n      </li>\n<li>\n        Collect and customize knick-knacks from around the DRAGON QUEST world \n        to create a personalized Knick-knackatory. With the wireless \n        capabilities of Nintendo DS, players can now exchange their creations \n        with friends for a one-of-a-kind collection of rare items\n      </li>\n</ul>", "metacritic": null, "released": "2009-02-17", "tba": false, "updated": "2023-10-30T17:18:17", "background_image": "https://media.rawg.io/media/screenshots/453/453b73758407a70d1519d2e76dc59b9e.jpg", "website": "", "rating": 4.5, "rating_top": 5, "added_by_status": {"yet": 9, "owned": 8, "beaten": 18, "toplay": 10, "dropped": 4, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 12, "suggestions_count": 406, "game_series_count": 35, "reviews_count": 12, "platforms": ["Nintendo DS"], "developers": [], "genres": [], "publishers": ["Square Enix"], "esrb_rating": null}