{"id": 258220, "slug": "you-cannot-survive", "name": "You (Can)Not Survive", "name_original": "You (Can)Not Survive", "description": "Alas, but you not the last survivor of the recent zombie Apocalypse. Or was it not a zombie Apocalypse? The choice you have is not big, to die or survive at any cost.<br/><br/><ul><li>An zombie shooter action game with elements of RPG.<br/></li><li>Under your control one character under direct control.<br/></li><li>Additional you control a squad that executing your commands through indirect control.<br/></li><li>The character possesses stats which improve over time, based on your game actions.<br/></li><li>Split and improve your things by means of ability to engineering.<br/></li><li>Get experience, collect valuable parts and spend them for weapons, medicines and useful devices. All this will be used against thousands of enemies that you will meet on your way.<br/></li><li>Huge base of weapon, including flame throwers, grenade launchers, rifles, hand guns, plasma guns and more others.<br/></li><li>Enemies become stronger and stronger. They can use a huge range of abilities.<br/></li><li>You will Fight against bosses with dangerous abilities. But also you will receive for it a deserved reward.<br/></li><li>Reach safe areas, perform tasks, make team, equip your character, defend positions and advance to your goal. <br/></li><li>Are you will Uncover the secret of the Apocalypse?</li></ul><br/>", "metacritic": null, "released": "2018-10-21", "tba": false, "updated": "2019-08-28T21:51:50", "background_image": "https://media.rawg.io/media/screenshots/0fa/0fa502e126339487b1aaa79504f286ab.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 286, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["dazbjax", "DAX Entertainment"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["DAX Entertainment"], "esrb_rating": "Adults Only"}