{"id": 258399, "slug": "mma-team-manager", "name": "MMA Team Manager", "name_original": "MMA Team Manager", "description": "MMA Team Manager is the all new, face punching, body slamming manager game for the real MMA fans. Experience the life as a manager running your own team and leading the fighters to international glory in the Octagon. Fight your way through gruelling season after season across multiple leagues, with over 100 teams and take part in world wide knock-out events which tests your managing ability to the absolute limit. Incorporating a feature packed 3D fight engine that includes dynamic AI decisions and with up to 100 motion captured animations, this brings the real-life brutality of the Octagon right to your finger tips.<br/><br/><br/><strong>Key Features</strong><br/><br/><br/>Experience the brutality of live MMA cage fighting, with the ability to change tactics in fight, to overcome your opponents utilising MMA techniques.<br/><br/><br/> <br/>Select from over 100 clubs of fighters from around the globe.<br/> <br/><br/><br/><br/>Upgrade able facilities lets you keep your fighters in top form ready for the competitions.<br/><br/><br/><br/>Train, hone and grade your fighters in an array of traditional striking martial arts, including Boxing, Karate, Tai Kwon Do and Thai Boxing.<br/><br/><br/><br/><br/>Train, hone and grade your fighters in an array of traditional grappling martial arts, including Brazilian Jiu Jitsu, Judo, Olympic Wrestling and Shoot Fighting.<br/><br/><br/><br/><br/>Hire and fire coaches and physios to mould your club into a competitive team of elite fighters.<br/><br/><br/><br/>Team based MMA with 7 leagues, involving promotion &amp; relegation, cup and shield competitions. <br/><br/><br/><br/>Find, recruit and nurture young talent before promoting to the senior ranks for competitive selection.", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-25T21:03:40", "background_image": "https://media.rawg.io/media/screenshots/d0d/d0dd082fd7e56722579a65a44bdcf42e.jpg", "website": "http://www.alternativesoftware.com/mmateammanager/mmateammanager.html", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 7, "dropped": 1}, "playtime": 0, "achievements_count": 36, "ratings_count": 1, "suggestions_count": 343, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "macOS"], "developers": ["Alternative Software"], "genres": ["Action", "Simulation", "Sports", "Indie"], "publishers": ["Alternative Software"], "esrb_rating": null}