{"id": 258325, "slug": "clock-tower-3", "name": "Clock Tower 3", "name_original": "Clock Tower 3", "description": "<p>Clock Tower 3 is a survival horror video game. The plot and characters have very little relation with the previous Clock Tower games. The story follows 14-year-old Alyssa Hamilton who is part of a family lineage of female warriors who travel through time to defeat evil spirits. Alyssa travels from her time in 2003 London to the 1940s and 1960s in order to defeat these &quot;Entities&quot; and bring peace to troubled souls. </p>\n<p>Gameplay:<br />\nPlayed from a fixed third-person camera perspective in which players control 14-year-old school girl Alyssa Hamilton. It&#39;s the first game in the series to incorporate direct control over the protagonist, as opposed to the point-and-click gameplay used in the previous games. To progress through the game, the player must find items to unlock new areas, solve puzzles, and flee and hide from enemies (&quot;Subordinates&quot;). Eventually, each Subordinate must be defeated in battle. Throughout each level, the player also encounters the spirits of innocent people slain by the Subordinates. These spirits will attack Alyssa if she approaches them. In order to pacify them, an item of sentimental value must be found and returned to the spirit&#39;s corpse.</p>\n<p>Story:<br />\nThe story of Clock Tower 3 is set in London in 2003. Alyssa Hamilton is a 14-year-old girl who has been living at a boarding school for three years. Her mother, Nancy, sent her there after her grandfather, Dick, disappeared. The game begins with Alyssa receiving a letter from her mother telling her to go into hiding until after her fifteenth birthday. Alarmed, Alyssa decides to go against her mother&#39;s wishes and return home. However, when she arrives at the boarding house in which they live, her mother is absent, and the only person there is a man called &quot;The Dark Gentleman&quot;. Determined to find her mother, Alyssa explores her mother&#39;s room. Suddenly, Frédéric Chopin&#39;s Fantaisie-Impromptu begins to play with no apparent source, and Alyssa is transported back in time to the streets of London during World War II.</p>", "metacritic": 69, "released": "2002-12-12", "tba": false, "updated": "2024-01-21T08:32:54", "background_image": "https://media.rawg.io/media/games/794/7943981063b299d1ee95152efe95ba21.jpg", "website": "", "rating": 3.78, "rating_top": 4, "added_by_status": {"yet": 12, "owned": 9, "beaten": 10, "toplay": 11, "dropped": 4}, "playtime": 0, "achievements_count": 0, "ratings_count": 17, "suggestions_count": 499, "game_series_count": 3, "reviews_count": 18, "platforms": ["PlayStation 2"], "developers": ["Capcom"], "genres": ["Adventure"], "publishers": ["Capcom"], "esrb_rating": "Mature"}