{"id": 258390, "slug": "evil-bank-manager", "name": "Evil Bank Manager", "name_original": "Evil Bank Manager", "description": "<p>What could be better than having a million? Have a hundred million? Billion? But this will not give you complete power over the world. Your goal is not to make a lot of money - your goal is to get control of money. Start printing them. Only by becoming a Federal Reserve System will you become great!<br />\nAlways dreamed of achieving great influence and making big money? Now you can realize the dream of millions and achieve influence, wealth and respect! Earn your billion during the era of great geographical discoveries and before the industrial revolution.<br />\nEvil Bank Manager is an exciting economic simulator in which you can become the most successful capitalist in the world!<br />\nJoin the hot fight for financial dominance! Manipulate and conspire on the way to your glory and success. Explore and develop new technologies, expand production, buy and build real estate!<br />\nWell-designed gameplay with a complex economic system will provide many hours of interesting gameplay, because the player will have to compete for the championship with dozens of competitors! Consider the features of the world market with the expansion of your influence. Relations between countries are constantly changing, which will affect your activity. However, even martial law can be turned in your favor - finance the participants in the conflict and supply them with weapons!<br />\nDon&#39;t lose sight of rivals who pursue their goals. Your property and even entire regions can be overbought by the enemy in no time. Therefore don&#39;t hesitate to bribe officials and influence the government!<br />\nAre you ready for the test? Your bank on top of the world - challenge accepted!<br />\nFeatures:<br />\n- detailed dynamically changing world map<br />\n- the elaborated logic of changing relations between countries on the map<br />\n- the possibility of organizing the production of dozens of different types of resources and weapons<br />\n- personnel management in the bank<br />\n- system of investments, crediting and development of countries on the map<br />\n- a dynamically changing exchange for trading resources<br />\n- wars, riots and other events that affect the situation in the markets of the world</p>", "metacritic": null, "released": "2018-11-10", "tba": false, "updated": "2022-07-24T09:05:22", "background_image": "https://media.rawg.io/media/screenshots/b18/b183ce37953c9f9bb46e98f086101080.jpg", "website": "http://hamstersgaming.com/", "rating": 3.44, "rating_top": 3, "added_by_status": {"yet": 2, "owned": 70, "beaten": 6, "toplay": 1, "dropped": 3}, "playtime": 4, "achievements_count": 57, "ratings_count": 9, "suggestions_count": 430, "game_series_count": 0, "reviews_count": 9, "platforms": ["PC"], "developers": ["Hamsters Gaming"], "genres": ["Strategy", "Simulation", "Indie"], "publishers": ["Hamsters Gaming"], "esrb_rating": null}