{"id": 258490, "slug": "instakitty3d", "name": "InstaKitty3D", "name_original": "InstaKitty3D", "description": "Discover the most beautiful and realistic cat simulator on the App Store! Adopt your own cat, name it, and make it part of your daily life by feeding, playing and bonding with it. Take LOL CAT pics or videos with your kitty and share with friends. Win FREE Gifts &amp; unlock prizes!  <br/><br/>BREATHTAKING 3D GRAPHICS<br/>InstaKitty 3D uses a new fur shader, giving it an amazing look!<br/><br/>CAT DANCING!! <br/>New Cat Disco Dancing Game!<br/><br/>LOL CAT PHOTOS AND VIDEOS<br/>- New Photo Mode with FaceTracking mode!<br/>- Cat Selfies - 'nuff said :) <br/>- Place your cat in the real world, dress it up, take pics, add funny captions <br/>- Shoot hilarious video of yourself and friends dancing with your cat<br/>- Share with Friends on social media<br/><br/>WIN GIFTS &amp; PRIZES - for free! <br/><br/>PLAY<br/>- Pet your cat! FEEL &amp; hear it meow and purr in delight!<br/>- Play and bond with your cat<br/>- Treat your kitty to CATNIP! Change the Litter!<br/><br/>DECORATE<br/>Change wallpaper, furniture, rugs and more to give your Cat the most styling room!<br/><br/>Download InstaKitty 3D now and take care of your own virtual cat! Follow us on Instagram - iheartinstakitty3D; Twitter @instakitty3D &amp; http://www.facebook.com/instakitty3D<br/><br/>PLEASE NOTE! InstaKitty 3D is free to play, but it contains items that can be purchased for real money. You can toggle these purchases on/off in the \"Restrictions\" menu on your device.<br/><br/>InstaKitty 3D is published and developed by HappyGiant. Email us at \"info@happygiant.com\" for help or questions. We love feedback! Thanks!", "metacritic": null, "released": "2015-05-14", "tba": false, "updated": "2019-10-22T13:57:14", "background_image": "https://media.rawg.io/media/screenshots/505/505c357b6270171e769eec8349176e77.jpg", "website": "http://www.happygiant.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 18, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["HappyGiant"], "genres": ["Simulation", "Family"], "publishers": ["HappyGiant"], "esrb_rating": null}