{"id": 258449, "slug": "driving-car-stunts", "name": "Driving Car Stunts", "name_original": "Driving Car Stunts", "description": "Driving Car Stunts allows driving skills to enhance on real impossible tracks right above real city. Crazy car stunt with impossible racing car driving controls and impossible tracks racing challenge are real thing to enjoy in this car racing simulator game. Get ready for real racing challenge of impossible tracks and perform real ramp stunts like stunt racing games. It requires extreme racing and driving controls when thinking about real impossible track driving. <br/><br/>Driving Car Stunts is a modern sport where deadly drivers around the world gather for car stunt jump tricks. Impossible track race on real city environment of stunt car zone with smoothest driving controls ever is real flavor of crazy car impossible stunts. Real car stunts with trick impossible track stunt of this crazy car game allow you to drive car with extreme control of car drifting simulator. Perform speed impossible track stunts in most advanced tracks of the impossible race tracks history and stunt car games. Conquer the speed of your racing car on the track and become stunt trick master of impossible challenge of impossible track car game. Racers around the world are trying their luck on car stunt impossible to win all the challenges of stunt car racing game and car racing simulator games.<br/><br/> Features:<br/>• Awesome real racing tracks.<br/>• Real gear shifting and awesome controls.<br/>• Most difficult and tricky stunt challenges.<br/>• Awesome sky box with crazy city environment.<br/>• Smooth and easy controls for real driving.<br/>• High quality sound tracks.", "metacritic": null, "released": "2018-10-29", "tba": false, "updated": "2019-10-22T13:55:37", "background_image": "https://media.rawg.io/media/screenshots/442/442d21ca602ae7e27581a9680b24b6b4_S1qyMAd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 42, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["NGUYEN THI HUYEN"], "genres": ["Sports", "Arcade"], "publishers": ["NGUYEN THI HUYEN"], "esrb_rating": null}