{"id": 258495, "slug": "dolphin-paradise-all-access", "name": "Dolphin Paradise - All Access", "name_original": "Dolphin Paradise - All Access", "description": "Dolphin Paradise: All Access is the premiere Dolphin Pet Sim for iOS! Play with Dolphins in this gorgeous 3D pet–sim that turns your iOS device into a virtual lagoon. Here, you can feed, train and create a strong bond with realistic looking dolphins and orcas. These high-resolution, animated dolphins swim and perform tricks across your screen and crave your attention at each step of the game, awaiting your commands. Learn tricks and perform Shows! Share with friends! <br/><br/>GRAPHICS <br/>Amazing 3D graphics replicate actually swimming in a lagoon with dolphins. <br/><br/>TRICK TRAINING AND DOLPHIN SHOWS <br/>Train dolphins to do fun and exciting tricks and then perform in ever bigger and grander dolphin shows! <br/><br/>CARE, NURTURE &amp; PLAY <br/>Take good care of your dolphins. Shower them with affection by petting and rubbing their bellies. Keep them healthy with tasty feedings and let them swim, frolic &amp; jump in the paradise lagoon; above and below water! <br/><br/>MINI-GAMES <br/>Help keep the lagoon clean from jellyfish to earn shells and pearls which can be used to buy dolphins, props, decorations and habitats. <br/><br/>PHOTOS <br/>Use our camera system to zoom and pan and take pictures of your dolphins, above or below water. Share exciting pics of your dolphins swimming, leaping, jumping and doing tricks via email, Facebook or Twitter. <br/><br/>FRIENDS AND SHARING <br/>Share photos, Dolphin Show scores and achievements with friends. And coming soon, visit friend’s lagoons! <br/><br/>CUSTOMIZATION <br/>Players can acquire custom props and decorations for Dolphin Shows and buy multiple dolphin types, eventually caring for many dolphins. Coming soon too, different habitats! <br/><br/>Dolphin Paradise is paid app but contains items that can be purchased with real money. If you don’t want to use this feature please disable in-app purchases. <br/><br/>Install Dolphin Paradise today!<br/><br/>Dolphin Paradise is published and developed by HappyGiant <br/><br/>Follow #HappyGiantMedia, #DolphinParadiseApp <br/><br/>PRESS <br/>GameZebo: “Dolphin Paradise features bright, colorful 3D graphics and lots of dolphin-ish clicks and whistles…” <br/><br/>The Iphone Mom: \"Dolphin Paradise: Wild Friends is a beautifully detailed 3D app that kids will be sure to love. If you think that your kids would enjoy playing with dolphins – check out Dolphin Paradise!\"", "metacritic": null, "released": "2013-01-04", "tba": false, "updated": "2019-10-22T13:57:16", "background_image": "https://media.rawg.io/media/screenshots/f7d/f7ddac3aa0749280db4c4991833b7840_Si4wbcQ.jpg", "website": "http://www.dolphinparadiseapp.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 71, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["HappyGiant"], "genres": ["Simulation", "Family"], "publishers": ["HappyGiant"], "esrb_rating": null}