{"id": 258555, "slug": "cake-crush-match-3-game", "name": "Cake Crush - Match 3 Game", "name_original": "Cake Crush - Match 3 Game", "description": "The most delicious casual game is finally here! Cake Crush Sugar Smash is a fun and exciting game where you have to draw a line and match 3 cookies, cakes, ice creams or other heavenly desserts. You will be accompanied by Granny and her Grumpy Cat in your journey inside this crazy kitchen. If you want to have some cupcakes and cookie party, then come and join us now!<br/><br/>Cake Crush Sugar Smash is a match three connecting game with sweet bakery theme. If you love cupcakes, ice creams, chocolate chip cookies, and other heavenly dessert, you can join Grumpy Cat and Granny and explore the vast cake factory. You can throw some cookie party and perform some cookie smash by connecting at least three similar items. The more snacks you connect, the higher the score, and the more bonus you will get in this connecting game! Each level has its own challenge so pay attention to the level objective and the number of moves you have. <br/><br/>This is a casual game, but that doesn’t mean it is not challenging! You will find that it’s harder and harder to fulfill the objectives at later levels. Just concentrate and keep creating match three desserts inside this sweet bakery. In time, you will win! So let’s start our cookie match mission. If you are still unsure, read the features and tips below before you start. <br/><br/><br/>=======================================<br/>TOP FEATURES OF CAKE CRUSH SUGAR SMASH: <br/>=======================================<br/>•\tDownload and play our awesome connecting game for FREE<br/>•\tJoint Granny and the Grumpy Cat in their quest to explore all the heavenly desserts inside this cake factory<br/>•\tGreat game graphic and design with sweet bakery theme.<br/>•\tSimple gameplay: draw a line and match three or more of the same items.<br/>•\tAnd yet challenging: complete the objective of each level with limited moves. <br/>•\tUse strategy to win this connecting game. <br/>•\tOver 100 levels to challenge your brain<br/>•\tBonuses and boosts to help you get through a level. <br/>•\tPerfect for kids and adults who have sweet tooth! <br/><br/> This is really a fun cookie smash game! <br/><br/>There are so many tempting and heavenly dessert inside the crazy kitchen: the yummy cupcakes, delicious cookies, irresistible donuts, tasty ice creams, and many more. Just seeing these wonderful sugary things will make you happy (although this crazy kitchen is a bit messy because some people just threw some cookie smash party). We hope that in time, we can make the Grumpy Cat smile too! <br/><br/><br/>TIPS ON HOW TO WIN ON CAKE CRUSH SUGAR SMASH:<br/>1.\tPay attention to the objective of each level. If you can’t fulfill the objective, you won’t progress to the next level. <br/>2.\tYou also need to pay attention on the number of moves you are allowed to make. You have to fulfill the objective within the limited moves each level. <br/>3.\tAlthough you can find match 3 items, you will get higher scores and boosts if you can draw a line connecting as many items as possible.<br/>4.\tDon’t give up easily, if you fail a level, just try again and think of another strategy to win. <br/>5.\tReplay to achieve perfect 3 Stars for every level! <br/>If you are ready to join us, simply download this fun and delicious casual game and we can start right away.", "metacritic": null, "released": "2017-04-08", "tba": false, "updated": "2019-10-22T13:55:22", "background_image": "https://media.rawg.io/media/screenshots/be5/be52025ea33a66e1d3141d67b18a7599_JTFuQR8.jpg", "website": "https://myanu05.wixsite.com/cakecrush1", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 80, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Manoj Yerra"], "genres": ["Strategy", "Arcade"], "publishers": ["Manoj Yerra"], "esrb_rating": null}