{"id": 258511, "slug": "kingdom-story-brave-legion", "name": "Kingdom Story: Brave Legion", "name_original": "Kingdom Story: Brave Legion", "description": "A funny and whimsical take on Romance of Three Kingdoms like never done before! Enjoy deep gameplay and spectacular spell effects in Kingdom Story!<br/><br/>Progress through the plot of the Chinese Three Kingdoms period in history.  Collect tons of powerful and cool warriors.  Build your base from a quaint little outpost to a formidable military city! Take over China in World Domination mode! Challenge your countrymen in epic PvP matches.<br/><br/>Interested in Chinese history? Loved Dynasty Warriors? Fan of RPGs with tons of cool characters? Kingdom Story is the mobile RPG for you!<br/><br/>CREATE THE ULTIMATE TEAM<br/>The greatest and most famous warriors from Chinese history all make an appearance here! Guan Yu, Zhao Yun, Gan Ning, Zhuge Liang and many more to collect.  Strategically mix and match your lineup to take advantage of team-up bonuses that come from characters' relationships!<br/><br/>TAKE OVER ANCIENT CHINA<br/>World Domination mode provides a unique experience! Start out in your outpost on a map of ancient China, take over territories and appoint your generals as governors! Beware of rebellions and invasions from rival factions!<br/><br/>EXPERIENCE THE TIMELESS STORY OF THREE KINGDOMS<br/>Kingdom Story is a comedic and lighthearted take on the Romance of Three Kingdoms, the most famous piece of Chinese literature.  Get to know about the deviousness of the Wei ruler Cao Cao, the courageousness of the hero Guan Yu and the genius of the Chinese strategist Zhuge Liang!<br/><br/>BUILD AND CUSTOMIZE YOUR BASE<br/>Beginning with just a small military outpost, construct farms, walls, mines, and even hotsprings to your heart's desire and grow your base into the greatest military city of ancient China! The look and layout of the base is yours to decide!<br/><br/>COMPETE AGAINST OTHER PLAYERS<br/>Kingdom Story's PVP is strategic and satisfying.  Decide your formation amongst Strategists, Melee Warriors, Mid-Range Warriors, Archers and Royals, each with different skills and abilities.  Mix and match and form the best team that steamrolls the competition.<br/><br/>Download Kingdom Story today!<br/><br/>Follow @playkingdomstory on Facebook and Instagram and @KingdomStoryRPG on Twitter for the latest news and updates!<br/>Facebook: https://www.facebook.com/PlayKingdomStory", "metacritic": null, "released": "2016-11-09", "tba": false, "updated": "2019-10-22T14:01:03", "background_image": "https://media.rawg.io/media/screenshots/195/195787ff0c28010bd6f21c13bc98879e_9z3gvGH.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 267, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["NHN Entertainment"], "genres": ["RPG", "Strategy"], "publishers": ["NHN Entertainment"], "esrb_rating": null}