{"id": 258539, "slug": "total-warfare-epic-kingdoms", "name": "Total Warfare: Epic Kingdoms", "name_original": "Total Warfare: Epic Kingdoms", "description": "Total Warfare brings the ultimate real-time strategy gaming experience from The Legend of Three Kingdoms. Mobile players can explore the most thrilling battlefields, develop a militarily superior country, expand their territories and become the overlord of the kingdom! <br/>In the world of Total Warfare, players will set out on a significant quest to unite the three kingdoms by recruiting strongest heroes to conquer hundreds of powerful enemies. Unlock legendary characters and use your army strategically to dominate intense battles and climb your own way to the TOP! The Stunning 3D graphics offer you an immersive gaming experience and create a real and different world of kingdoms.<br/><br/>===Features===<br/>【No Constraints: Real-time Sandbox Strategy Game】<br/>Worldwide players will take the role as a warlord of a land and are settled randomly in various corner of Three-kingdom simulated sandbox map. You’ll be able to conquer 1440000 land resources from 14 states, fight alongside with Cao Cao and Liu Bei from 16 forces of legendary warriors and eventually take the empire. Scout, feint, sneak attack, gathering, support, trap of sowing discord, scheme, collaboration…… Rich strategies can be used to plan your campaign and crush enemy troops. What’s more, PVP gameplays like bandits suppressing and mines war enable you to develop rapidly into a great warlord!<br/>【Immersive Storyline: Recruit Legendary Heroes】<br/>Choose your team wisely from hundreds warriors with different attributes.  Plan and deploy your warriors strategically to maximize their powerful abilities: advising campaigns, training army, farming, minting, visiting heroes, carrying out scheme and supervising army. <br/>【High Interaction: Battle with Worldwide Players】<br/>Alliance war, siege war, defending war……All these gameplays require the efforts of all members of the alliance. You must communicate with your alliance in real-time to share reports and coordinate in military operation. Discuss your brilliant strategy with your friends and unite the kingdoms together!<br/>【Stunning Graphic: Most Delicate Art Ever】<br/>Restore the real three-kingdom battlefields and create immersive gaming experience. The world map is highly simulated with the variable seasons and realistic environment, hundreds of generals are delicately designed, each vivid and unique. You can travel back to classic battles, find your military base and take control of the map!<br/><br/><br/>===Contact Us===<br/>Visit our official page: <br/>https://www.facebook.com/TotalwarfareETK/<br/>Send support ticket:  cstwetk@enjoyfun.app", "metacritic": null, "released": "2018-08-16", "tba": false, "updated": "2019-10-22T13:57:20", "background_image": "https://media.rawg.io/media/screenshots/02f/02ff93f86ad8a4edd7f4fd2095a7b5ce_IQISE3O.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 187, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Enjoy Fun Tech Co"], "genres": ["Strategy"], "publishers": ["HongKong Enjoy Technology Co"], "esrb_rating": "Teen"}