{"id": 2585, "slug": "beat-sneak-bandit", "name": "Beat Sneak Bandit", "name_original": "Beat Sneak Bandit", "description": "RHYTHM. STEALTH. PUZZLE.<br/>When all the clocks in the world are stolen by Duke Clockface and the world is in chaos, it'll be up to the Beat Sneak Bandit to steal them back!<br/><br/>- Rhythmadelic controls: Everything in this game moves rhythmically, just like the simple controls: Tap to the beat to sneak!<br/><br/>- Stealthalicious gameplay: Sneak past patrolling guards, security lights, trapdoors and all the other freaky stuff and contraptions the creepy Duke's got in store for you!<br/><br/>- Puzzletastic levels: Watch, listen and learn the rhythm patterns to figure out how to solve all of the sneaky puzzles!<br/><br/><br/>Winner of Best Mobile Game in the Independent Games Festival 2012<br/>Winner of Best Audio Design 2012 in the Edge Awards 2012<br/>Winner of Best Gameplay at the Unity Awards 2012<br/>Winner of Best Mobile Action in Jayisgames.com Best of 2012 Awards<br/>Winner of Best Mobile Puzzle Games in IGN's Best of 2012 Awards<br/><br/>Nominated for Audio Achievement at BAFTA 2013<br/>Nominated for Excellence In Innovation at International Mobile Gaming Awards 2012<br/>Nominated for Excellence In Gameplay at International Mobile Gaming Awards 2012<br/>Nominated for Best Mobile at the Golden Joystick Awards 2012<br/>Finalist at Indiecade 2012<br/><br/>Chosen by Apple as iPad Game of the week<br/><br/>9/10 - Edge<br/>9/10 - IGN<br/>5/5 - TouchArcade<br/>9/10 - Pocketgamer<br/>5/5 - Appspy<br/>9/10 - Videogamer.com<br/>5/5 - Hookshot Inc.<br/>4/4 - Slide to Play<br/>5/5 - TouchGen<br/>5/5 - Gamezebo<br/><br/>\"It's rare to find a game that does something so original so well, with every element of gameplay and design falling into place. Simogo has pulled it off with Beat Sneak Bandit. In my books it's a must buy, and such a shame it would be to miss out.\" - TouchArcade<br/><br/>\"It's impossible not to fall in love with this funky little number.\" - Videogamer.com<br/><br/>\"Beat Sneak Bandit is polished, challenging, wholly original and a heck of a lot of fun. It’s a great example of how presentation, control and design can come together to create a cohesive and extremely fun package. Don’t miss it!\" - IGN<br/><br/>\"Quick to get into but devilish in the detail, Beat Sneak Bandit makes all the right noises, and in what's already a strong year for mobile gaming, this is the best iPhone game I've played.\" - Eurogamer<br/><br/>\"Every now and again though, a game comes along for iOS that knocks you for six, and re-ignites your passion for not just iOS gaming, but gaming in general. Well, Beat Sneak Bandit is one such game.\" - Touchgen<br/><br/>\"It's an unlikely mix for sure, but Beat Sneak Bandit's smart blend of puzzling and beat-matching proves to be an ingeniously crafted delight.\" - Pocketgamer<br/><br/>\"You'll be hard pressed to put this game down until you've 'clocked' it entirely - a must have for all iPhone gamers.\" - Appspy<br/><br/>\"A true work of art, in so many ways. It's smart. It's challenging. It's gorgeous. But most importantly, it's fun - dizzying, dreamy, and delightful fun.\" - Gamezebo", "metacritic": null, "released": "2012-02-16", "tba": false, "updated": "2022-08-12T06:05:35", "background_image": "https://media.rawg.io/media/screenshots/175/1751d26094cf6b7973557000412dd211.jpg", "website": "http://www.beatsneakbandit.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 4, "beaten": 1, "dropped": 1, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 161, "game_series_count": 0, "reviews_count": 2, "platforms": ["iOS"], "developers": ["Simogo"], "genres": ["Puzzle"], "publishers": ["Simogo"], "esrb_rating": null}