{"id": 258688, "slug": "13-balls", "name": "13 Balls", "name_original": "13 Balls", "description": "Ready? Aim, Drop!<br/><br/>13 Balls is a ball-dropping, peg-elimination game that involves mostly skill, a bit of luck, and fair amount of patience. The goal on each level is to clear all the pegs by dropping balls on them.  Each peg has to be hit a certain number of times indicated by it's color and the amount of dots it has.<br/><br/>As you progress through the levels, you may feel that you have an improved self-worth and a strong desire to gloat to your friends about how much of a ricochet master you are.  You're encouraged to utilize the share feature on the \"You Win\" screen to do just that.<br/><br/>13 Balls integrates Apple's Game Center keeping track of how many levels you've beat, so you can see how you're doing against your friends, and the world.<br/><br/>How to Play:<br/>When you tap on the screen, the ball is ejected from the dropper as it moves back and forth above the multi-colored pegs.<br/><br/>Each time you hit the peg, one dot is removed and the color changes.  Once you get all the way down to the last dot, the peg shatters when you hit it! Clear a whole screen of the pegs, and you beat the level.<br/><br/>If you use all your balls, and you have not cleared all the pegs, your turn is over.  You have the option to purchase 3 more balls to \"Keep Going\" via in-app purchase.<br/><br/>Collect \"Douballs\" as you play. Douballs are special balls that bounce out twice as many dots when they hit a peg. You can save up your Douballs and use them on a challenging level.<br/><br/>13 Balls:<br/>• Is fun for kids, teens, adults &amp; senior citizens<br/>• Improves hand-eye coordination (according to the internet)<br/>• Easy to play, difficult to master!<br/><br/>When you beat level 50, be sure to post it to Facebook and Twitter with #13balls so that we know you're ready for more levels!  Good luck.", "metacritic": null, "released": "2018-01-01", "tba": false, "updated": "2019-10-22T13:57:40", "background_image": "https://media.rawg.io/media/screenshots/6b5/6b58800b627150932aca3e455ca5e0a7.jpg", "website": "http://www.bimzagames.com/13-balls.html", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 36, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Bimza"], "genres": ["Strategy", "Arcade"], "publishers": ["Bimza"], "esrb_rating": "Everyone 10+"}