{"id": 2587, "slug": "jungle-style-pinball", "name": "Jungle Style Pinball", "name_original": "Jungle Style Pinball", "description": "You seek treasures hidden by Indians in the jungle, in an abandoned temple. Many a man has tried to seize the treasure, and many have paid with their lives for that because the jungle is not the friendliest place in the world; however, it is full of mystery and adventure. Show some wit hunting for the golden ball; try to deceive a cunning shaman, see what you are worth fighting with a huge ape, attempt to find a way out of a trap waiting for you, learn how you can save your life and make your breathtaking experience last – do not put your Odyssey off till tomorrow! The sky is the limit; you have a chance to play with more than one ball at a time and get yourself a golden ball (please note that a golden ball is bigger and heavier than a metal one). Do not lose your life in a deadly hole, seek ways to reactivate lifeguards. Search for keys the hints for which you find on a path – they will help you move the labyrinth in the right direction thus boosting your chances to get the golden ball. Test your luck on a slots-machine; you might activate a lifeguard or get another ball in the game or… get trapped. Seek for treasures – they might as well be packed and waiting for you aboard! Compete with other treasure seekers all over the world: for that, see the global record table. With fast 3D graphics and realistic physics this game will blow your mind. All parts of pinball table are real objects and you can see how it works! Jungle style locations and environment gives you a lot of fun.<br/><br/>The most exacting players will be surprised with the most frequent requests of WWP and TDP fans which we have taken into account.<br/><br/>FEATURES<br/><br/>– New improved 3D engine<br/>– Missions and Checkpoints<br/>– Multiball<br/>– Hidden locations<br/>– Realistic physics<br/>– Camera effects with three modes<br/>– Unique sounds<br/>– Save/Restore game<br/>– Original soundtrack<br/>– Table tilting<br/>– Local scores table<br/>– World scores table<br/><br/><br/>HOW TO PLAY<br/><br/>When running the app, you are presented with a 3D simulated camera zoom, pan and fly-over of one of the games. Swiping right brings up Gameprom news and swiping left brings up the local score screen. Tapping on a game's fly-over screen starts game play. Controls in game:<br/>• Tap ANYWHERE on the left side of screen to control the left flipper and ANYWHERE on the right side to control the right flipper.<br/>• Shake your iPad to realistically shake the pinball table, but not too much or you'll tilt.<br/>• Tap on the \"electronic caption\" at the top of the screen to pause or resume your game.<br/>• During the game pinch your fingers together or apart to toggle camera mode from live to fixed.", "metacritic": null, "released": "2009-12-21", "tba": false, "updated": "2019-10-22T14:09:24", "background_image": "https://media.rawg.io/media/screenshots/3f3/3f352696003e6cbfe3c0ab983a883323_GOyCBHi.jpg", "website": "http://gameprom.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 345, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["OOO Gameprom"], "genres": ["Simulation", "Arcade", "Casual"], "publishers": ["OOO Gameprom"], "esrb_rating": "Everyone 10+"}