{"id": 258750, "slug": "space-cat-laser-pointer-sim", "name": "Space Cat Laser Pointer Sim", "name_original": "Space Cat Laser Pointer Sim", "description": "Pew pew! Someone threw kittens to the cold space! Let’s save them! <br/><br/>White fluffy kittens are lost in the open space and they are really sad because of that! They are cold and scary, they just want to sleep, play and eat, not to explore deadly space. Charge your laser gun aka portal teleporter, designed specifically for kittens, and try to save every kitty! Laser Pointer – Cat-a-genesis – meet the SPACE CAT!<br/><br/>What an incredible landscape - fluffy astronauts flying among stars. Start your laser in time and teleport kittens to the special box, where they will be in safety. Space is a really bad area for such cute creatures – they must be sleeping all day long on the sofa or on the lap of the owner. Help these cats today, and one day someone will help your cat!<br/><br/>GAME FEATURES:<br/>-\tExplore mysterious outer space;<br/>-\tMaster real laser gun and practice in shooting;<br/>-\tImprove your laser pointer;<br/>-\tHelp space kittens;<br/>-\tYou can shoot and you can not to shoot;<br/>-\tThere are cute cats, because everyone loves cats.<br/><br/>Laser Pointer – Cat – a – genesis – crazy space shooter campaign with laser guns and so on. Meow!<br/><br/>*** This games is just a joke. No animals were harmed while developing and testing this product", "metacritic": null, "released": "2015-11-10", "tba": false, "updated": "2019-10-22T13:57:49", "background_image": "https://media.rawg.io/media/screenshots/c53/c531ea5ad00daa8c1d2218f9d10fc0de.jpg", "website": "http://nilteam.com/survivalcraft/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 40, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Valeriy Martinov"], "genres": ["Arcade", "Family"], "publishers": ["Valeriy Martinov"], "esrb_rating": null}