{"id": 258727, "slug": "space-shooter-360deg", "name": "Space Shooter 360°", "name_original": "Space Shooter 360°", "description": "Space Shooter 360° brings back all the fun of your favorite arcade games. Launch your spaceship and prepare to battle relentless enemies as they try to take you out! Use aim lines for better accuracy so you can rack up more points. Enemy spacecraft fly in from all directions, ready to destroy you. Use machine gun fire to stop the onslaught and earn extra lives or restore health. <br/>Remember the old days of visiting the arcade to pump quarters into the newest game consoles and earn a higher score than your friends? You can relive those good times all over again without spending your pocket change! <br/>Space Shooter 360° inspires nostalgia with gameplay that appeals to all ages. Adults and kids will love testing their skills while surviving waves of enemy spaceships invading the galaxy! Learning how to play is easy - it’s becoming a master and surviving each level that’s challenging. Prove that you are an arcade game expert by navigating your ship through battle, destroying everything that stands in your way.  <br/>Take your attackers out one by one with a satisfying explosion! Simple controls allow you to pivot and fire with the press of a thumb. Work through each stage to earn more points and prove yourself to be the champion of outer space! <br/>•\tAim lines help guide your attack<br/>•\tFight back with powerful machine guns<br/>•\tCollect health and survive the onslaught<br/>•\tEarn extra lives to play longer<br/>•\tHit enemy ships and watch them explode on impact<br/>•\tBeat your highest score and earn achievements<br/>•\tRetro arcade game fun that you can play anywhere", "metacritic": null, "released": "2017-12-17", "tba": false, "updated": "2019-10-22T13:57:43", "background_image": "https://media.rawg.io/media/screenshots/295/29525aedb6b163c8c046013c86791b9d_69wjsuS.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 34, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Arnt-Henning Moberg"], "genres": ["Action", "Arcade"], "publishers": ["Arnt Henning Moberg"], "esrb_rating": "Everyone 10+"}