{"id": 258723, "slug": "the-forgotten-treasure", "name": "The Forgotten Treasure", "name_original": "The Forgotten Treasure", "description": "***New game out***<br/>Check out our new Game: The Man From Hmmbridge!<br/><br/>Adventurer, are you ready? There is a forgotten treasure waiting for you somewhere in the world and it is your job to find it. Grab your trusted crowbar and explore both an ancient Egyptian pyramid and a desolate Mayan temple for clues. <br/><br/>The Forgotten Treasure is an exciting but rather short game (1 hour’s worth of puzzles, 40 minutes if you are a sharp one). It is a fun drag-n-drop adventure game with cartoonish, razor-sharp graphics, interesting objects to interact with and nice sound-effects. There is a camel (and a couple of other animals), an obelisk, a mysterious stone, lots of sand, priceless urns and much more to poke around with. You have to use that brain of yours a little but most of all this game aims for an overall feeling of good old-fashioned fun. <br/><br/><br/>System Requirements<br/>This game is thoroughly tested and runs smoothly on iPhone 5 and newer devices. It also runs fine on iPad Air if you can abide with letterbox mode. We would not recommend buying it for anything with less memory than an iPhone 5 because it will not run smoothly or not at all.<br/><br/><br/>This indie game is inspired by late Terry Pratchett's Discworld, Tim Schafer &amp; Ron Gilbert's Monkey Island and Joe Kauffman's The Lost City. It is produced by a small team of dedicated individuals who enjoy their coffee black and their mobile games unpretentious and fun.<br/><br/>So without further ado:<br/>Peeking Peacock presents: The Forgotten Treasure.<br/><br/>Thank you for the sounds:<br/>http://www.freesfx.co.uk/<br/><br/>Walkthrough can be found on our webpage: www.pointandrate.com", "metacritic": null, "released": "2015-04-28", "tba": false, "updated": "2019-10-22T13:57:42", "background_image": "https://media.rawg.io/media/screenshots/3d9/3d9b0bc60adf266a220834cb85e2608d_uQlswLd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 116, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Peeking Peacock HB"], "genres": ["Adventure", "Puzzle"], "publishers": ["Peeking Peacock HB"], "esrb_rating": "Everyone 10+"}