{"id": 258893, "slug": "igi-commando-hero", "name": "IGI Commando Hero", "name_original": "IGI Commando Hero", "description": "IGI Commando Hero! Do you think you are crazy enough to make yourself the part of deadly shooting fight? Are you courageous enough to guard your army base? If yes then download this commando game and be the part of this commando shooting &amp; action game. There is lot of commando shooting fight with great deal of risks, but at the same time this is a package of adventure and commando shooting. In this duty of commando, there is lot of killing and shooting of commando against enemies. You are commando soldier, known as one man army, your commando duty is to guard and protect the base. <br/><br/>The innocent people have been killed and some are migrated to the neighbor city for the sake of their lives. There might be some hostages as well, this times your mission is a bit different from the previous ones, as you have to move carefully in the city you can find enemy at any moment. A great challenge to kill the bunch of enemy soldiers with your amazing commando skills. Escape your city from the enemy and rebuild life in it. Kill the criminal army the guards; bring back the migrated people escape the hostages. If you succeed your duty is done! <br/><br/>Features.......<br/><br/>- Amazing 3D graphics.<br/>- Deadly weapons.<br/>- Addictive game play.<br/>- Thrilling missions.<br/>- Brutal action military game.<br/>- Efficient weapon controls and movement.<br/>- Smooth game play.<br/>- Amazing sound effects.<br/>- Challenging levels in different battlefield environment", "metacritic": null, "released": "2017-06-16", "tba": false, "updated": "2019-07-30T14:57:24", "background_image": "https://media.rawg.io/media/screenshots/f88/f8895fbee6e540aea69d996363f389ea.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 45, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Shawal Tarik"], "genres": ["Action", "Adventure"], "publishers": ["Shawal Tarik"], "esrb_rating": null}