{"id": 258833, "slug": "business-empire-city-manager", "name": "Business Empire: City Manager", "name_original": "Business Empire: City Manager", "description": "Business Empire: City Manager - build an amazing city of your dreams! <br/><br/>Welcome to your own city! It is your time to build your own business empire! You are looking at Business Empire: City Manager - one of the best building and economic simulators, where you take the role of a city manager, a  businessman and a builder at the same time. You are going to create a paradise from mud and stones and you have to be sure that every citizen in your world’s greatest empire is happy! You will have to solve huge amount of real problems, but we are sure that you are not only able to do it, but you will enjoy doing it!<br/><br/>In Business Empire: City Manager game you are the only one, who decide where and what to build at first: new school or police post, cinema or hospital, game center or bar. And what is most important is that your own people will show you whether they are happy or not of what you are doing. You will have to show great flexibility of your cool strategic mind and decide what to do: build a bank that grants amazing money profit or make your citizens a little bit happier. Business Empire: City Manager is full of such challenges! More than 50 super unique buildings, a lot of upgrades, interesting quests, mini games, dynamic map and much more is waiting only for you!<br/><br/>If you are a fan of city building simulation games, if you like to decide what to do, if you do love to create business empires, than Business Empire: City Manager is exactly what you need! Hesitate no longer and start creating a real Heaven on Earth! Good luck!", "metacritic": null, "released": "2016-01-29", "tba": false, "updated": "2019-10-22T13:57:53", "background_image": "https://media.rawg.io/media/screenshots/2a1/2a19c2b4405bb3be7b7acdce33dd700d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 144, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Kristina Fedenkova"], "genres": ["Strategy", "Simulation"], "publishers": ["Kristina Fedenkova"], "esrb_rating": null}