{"id": 258969, "slug": "swat-anti-terrorist-elite-shot", "name": "SWAT Anti-Terrorist Elite Shot", "name_original": "SWAT Anti-Terrorist Elite Shot", "description": "SWAT Anti-Terrorist Elite Shot! Ultimate first person shooting with advance multiple weapons and different battle zones is now on your screen. Assassin sniper shooting is call of sniper action oriented first person sniper action and shooting category you've been expecting is here. Target Sniper Shooting is a tactical sniper game that employs stealth hand to hand assassinations and elite sniping techniques. Gameplay features realistic bullet physics that factors distance wind and bullet drop when sniping targets!<br/><br/>Play this elite commando game. In this elite commando game there is lot of commando shooting by army force. Army force is the main force in this SWAT Anti-Terrorist Elite Shot game, This game is the only game in which there is only a force and that is YOU. You works as a commando force in this game.<br/><br/>SWAT Anti-Terrorist Elite Shot puts you directly in the battle zone. Enemy army force has taken over the city and spread its army soldiers through out the city streets and snipers on the rooftops of the buildings. Your army force is counting on you and sent you to the city to take out these enemy soldiers on duty with heavy weapons and armory. You just have a single partner and that is your high precision ultimate sniper riffle to make this city a hell for the enemy soldiers and sharp shooters. Take the position like the real sniper hawk in sniper nest or behind the sandbags and blockades.<br/><br/>Game Features: <br/> Realistic Graphics <br/> 3D Environment that gives the real commando feeling <br/> First Person Shooting <br/> Excellent city Environment for military attack <br/> Realistic effects and new challenges to your mission. <br/> Outclass sound effects, Background and shooting sounds. <br/> Easy and intuitive controls <br/> Multiple addictive levels in The best virtual reality based game. <br/> Use you left and right controls to play this game <br/> Real war and sniper shooting sounds", "metacritic": null, "released": "2017-05-12", "tba": false, "updated": "2019-07-30T15:08:03", "background_image": "https://media.rawg.io/media/screenshots/403/40354638c0aa44f856d7c3dff0fb71d2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 90, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Shawal Tarik"], "genres": ["Action", "Adventure"], "publishers": ["Shawal Tarik"], "esrb_rating": "Mature"}