{"id": 258952, "slug": "gunship-air-strike-mission-2017", "name": "Gunship Air Strike Mission 2017", "name_original": "Gunship Air Strike Mission 2017", "description": "If you are a action games lover then this game is just made for you. you can play this game with full of joy thrill and action. In this Gunship Air Strike Mission 2017 game there are more than 40 missions to achieve. If you complete the mission in time it will result in open up the next level. To start the mission you need to start up chopper first from the home base and fly towards the enemy strike area . When your helicopter enter the death zone of your strike area first mission is to aim then plan to strike the targeted point and protect yourself from their fire and rocket launcher.<br/><br/>Become a Extreme helicopter pilot shooter in Gunship Air Strike Mission 2017 and engage in combat missions across the world. Control room has suspected that your army base has been attacked by hoards of air stealth jet fighter shooter helicopter, unknown ship carrier bombarding panzer tanks drone attacks and other elite forces .It’s an assault tank war and drone attack by the elite enemy force and your fleet has been destroyed and you have left alone against this brutal force in this fighter war.<br/><br/>Gunship Air Strike Mission 2017 puts you in the gunner seat of the most powerful combat helicopters. Strategically fire your powerful machines guns and devastating missiles to slay hordes of enemies across the world. Guide with precision your combat helicopter and demolish the enemy military bases in the world’s greatest combat experience! Gunship Air Strike Mission 2017 combines tactics, flying skills and the right amount of ruthless in this #1 military helicopter action game!<br/><br/>Features:<br/>Unique scene with aerial combat from a heli gunship on the battlefront!<br/>Action packed enemy characters!<br/>Enemy AI!<br/>Efficient weapon controls &amp; movement!<br/>Deadliest 3D Chopper shooting!<br/>Target the Whirling Powerful Sky Copters!<br/>Wide range of helicopters!<br/>Equip your Copter with Rocket Pods, Cannons and Missiles!", "metacritic": null, "released": "2017-06-08", "tba": false, "updated": "2019-07-30T15:04:40", "background_image": "https://media.rawg.io/media/screenshots/543/5430828706f1714f698e0b63909c8515_ccUP0yw.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 58, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Shawal Tarik"], "genres": ["Action", "Adventure"], "publishers": ["Shawal Tarik"], "esrb_rating": null}