{"id": 25898, "slug": "101-in-1-explosive-megamix-2", "name": "101 in 1 Explosive Megamix", "name_original": "101 in 1 Explosive Megamix", "description": "<p>\n      101-in-1 Explosive Megamix is the perfect game to take on the road \n      because players can play a game whenever they have a spare moment. In \n      addition, 101-in-1 Explosive Megamix takes full advantage of the unique \n      capabilities of Nintendo DS, meaning you can easily manage the \n      dual-screen fun using the intuitive touch controls. On top of all this, \n      players can challenge a friend to multiplayer competition through \n      multi-card local wireless play, making 101-in-1 Explosive Megamix for \n      Nintendo DS a never-ending supply of fun and excitement!\n    </p><p>\n      Features\n    </p><p>\n      • One hundred and one games on a single cartridge - No other game for \n      Nintendo DS offers players this much bang for their buck. It averages \n      out to less than twenty cents a game, and that's not including the fun \n      of unlocking new challenges and the ability to play with a friend!<br/>• \n      Unlock dozens of exciting new games! - Collect gold coins by setting \n      high scores, and then spend them to unlock dozens upon dozens of \n      exciting new games. The more you play, the more gaming enjoyment you'll \n      uncover!<br/>• Compete with friends in local wireless - Challenge friends \n      to head-to-head action through multi-card local wireless play.\n    </p>", "metacritic": null, "released": "2009-04-21", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/3bc/3bc9322a638cca8cda451825c1ed8629.jpg", "website": "http://www.atlus.com/101/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 337, "game_series_count": 0, "reviews_count": 1, "platforms": ["Nintendo DS"], "developers": ["Nordcurrent"], "genres": [], "publishers": ["Atlus"], "esrb_rating": null}