{"id": 258961, "slug": "real-3d-formula-racing", "name": "Real 3D Formula Racing", "name_original": "Real 3D Formula Racing", "description": "Free 3D Real Formula Racing is the gift for the Sick of racing drift adventures games. Are you Sick of racing games with third person eye perspective? Need speed car mania is real one for your desires. Top new jeep speed Is Drift based drag simulation for Sick lover of racing action games. Drive your car on highway and feel like a drive as in real life. <br/><br/>Have you ever wanted to be the fastest real formula car racer in traffic? WELL NOW YOU CAN!!<br/><br/>Pick your wanted formula car and join the extreme racing challenge. Race head to head with opponents cars to become a racing champion. Turbo formula racing car’s gear is in full throttle and the foot is on the pedal, all you have to do is take control and drive your real Super Cars on some of the fastest racing tracks around. Realize your dream with this Free, Fast, and action packed formula cars racing game. With this High Speed Racing game you will think that you are a a Real driver of furious Super Cars racing. Zoom around in the fastest cars on three different tracks - each difficult than the previous one - and three distinct surroundings to enhance your driving pleasure.<br/><br/>Real Speed Car Racing has been made for the lovers of speed. Drive your automatic real Super formula Cars around the 3d challenging environment, spin around corners, drifting, crushing, and do as much as you can.<br/><br/>If you like full and free racing games, challenges and the smell of the asphalt, Real Formula Racing is perfect for you!", "metacritic": null, "released": "2017-06-28", "tba": false, "updated": "2019-07-30T15:06:06", "background_image": "https://media.rawg.io/media/screenshots/97d/97d2cc3eaec29f799aa3797bf0e4aaba.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 66, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Shawal Tarik"], "genres": ["Adventure", "Sports", "Racing"], "publishers": ["Shawal Tarik"], "esrb_rating": null}