{"id": 25894, "slug": "crystal-defenders-r1", "name": "Crystal Defenders R1", "name_original": "Crystal Defenders R1", "description": "<p>\n      In CRYSTAL DEFENDERS R1, you must deploy various units such as Soldiers \n      and Black Mages to stop wave after wave of encroaching monsters from \n      escaping the area with your party's crystals. There are many different \n      types of units to choose from, some specializing in powerful short-range \n      attacks, some wielding far-reaching magicks, and still others equipped \n      with bows, enabling them to bring down aerial foes. Deploy units in \n      strategic locations to take full advantage of their traits. Each time an \n      enemy breaches your defenses and reaches a map's exit, your party will \n      lose crystals. When all your crystals are gone, the game is over. \n      CRYSTAL DEFENDERS R1 comes complete with a plethora of exciting stages, \n      each varying in layout and difficulty. Can you defend them all without \n      losing a single crystal?\n    </p><p>\n      As of May 20, 2014, the Nintendo Wi-Fi Connection service for Nintendo \n      DSi and Wii systems has been retired. Online features of this game are \n      no longer available after this date but this game still provides an \n      entertaining experience in offline mode.\n    </p><p>\n      To learn more about this service change, please visit To learn more \n      about this service change, please visit support.nintendo.com/servicesupdate.\n    </p>", "metacritic": null, "released": "2009-04-20", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/a9e/a9ee59754aeca3d073b1bae481927bfb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 226, "game_series_count": 0, "reviews_count": 0, "platforms": ["Wii"], "developers": [], "genres": [], "publishers": ["Square Enix"], "esrb_rating": null}