{"id": 25895, "slug": "steal-princess", "name": "Steal Princess", "name_original": "Steal Princess", "description": "<p>\n      The King has ordered Anise, the greatest thief in the world, to rescue \n      his son from the demons. Should she accept, she’ll jump, swing, climb, \n      and battle through more than 150 levels of fiendish traps and ruthless \n      foes... Should she decline, she’ll be prosecuted for her crimes... It’s \n      time to decide: to be a hero or not to be a hero...<br/>\n</p><ul>\n<li>\n        3-D puzzle platformer - Dive into a playing field of simple design, \n        but deceptively complex challenge, that combines action elements with \n        puzzle-solving skills on a 3-D, isometric plane. Jump, swing, climb, \n        and attack as you search for the key to complete each level.\n      </li>\n<li>\n        Over 150 levels to beat - Levels spanning different geographies and \n        requiring different strategies deliver on the promise of true breadth. \n        Play them again to beat your best times, earn higher rankings, earn \n        better endings, and collect more gems to unlock items.\n      </li>\n<li>\n        Create and trade custom levels - A robust custom map maker lets you \n        construct levels with any enemies, items, and victory conditions you \n        want.\n      </li>\n</ul><p>\n      As of May 20, 2014, the Nintendo Wi-Fi Connection service for Nintendo \n      DSi and Wii systems has been retired. Online features of this game are \n      no longer available after this date but this game still provides an \n      entertaining experience in offline mode.\n    </p><p>\n      To learn more about this service change, please visit To learn more \n      about this service change, please visit support.nintendo.com/servicesupdate.\n    </p>", "metacritic": null, "released": "2009-04-21", "tba": false, "updated": "2019-09-12T06:37:16", "background_image": "https://media.rawg.io/media/screenshots/987/9874c1f82b9d14edbf119a0aebef0059.jpg", "website": "http://www.atlus.com/stealprincess/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 449, "game_series_count": 0, "reviews_count": 1, "platforms": ["Nintendo DS"], "developers": ["Marvelous"], "genres": [], "publishers": ["Atlus"], "esrb_rating": null}