{"id": 258930, "slug": "car-crash-2-online", "name": "Car Crash 2 Online", "name_original": "Car Crash 2 Online", "description": "Car Crash 2 Online Simulator Racing Beam XE 2018 is specially created for fans to kill wheelbarrows in the trash! <br/>Push the gas pedal into the floor and accelerate to maximum speed for maximum driving pleasure while driving the fastest sports cars.<br/><br/>To achieve professional driving skills, use the steepest springboards. Collect more coins for tuning your car, turning various tricks, you put new records for rivals.<br/><br/>Try all the cars from your car park to determine for yourself which car is better than sharpened for the hooligan style of driving. The appearance of some cars may seem deceptive, but having conquered a couple of steep jumps - you will understand that this is so!<br/><br/>Choose your own style of driving a street racer, having under the hood of the car a serous reserve of horsepower. Drift, use nitro for instant acceleration, feel like a racing car racer after clicking on nitrous oxide in your car. Be angry when riding with opponents, otherwise you will simply be smeared into a flat cake about concrete bumpers. There is no police in the game, so you have the opportunity to perform illegal actions on our circuit, full speed without harassment of the police - it's only real in our race!<br/><br/>Features:<br/>- Realistic crashes and deformation of cars!<br/>- Interesting obstacles on the way.<br/>- A large number of trampolines, pipes, unreal ascents and descents.<br/>- Realistic physics of driving.<br/><br/>Drive and make adventures in a super online racing game, create multiplayer companies and invite all your friends to the legendary duels! Prove your friends that you are the fastest driver in the world, burn tires of asphalt at prohibitively extreme speeds.", "metacritic": null, "released": "2018-01-31", "tba": false, "updated": "2019-07-30T11:42:23", "background_image": "https://media.rawg.io/media/screenshots/4c4/4c4703f350e2fa1bacc9c3cc0768045e_Hq0FIzb.jpg", "website": "https://www.facebook.com/smartmovegames", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 88, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["art ivanov"], "genres": ["Simulation", "Racing"], "publishers": ["art ivanov"], "esrb_rating": "Everyone 10+"}