{"id": 258926, "slug": "maximum-derby-upgrades-online", "name": "Maximum Derby Upgrades Online", "name_original": "Maximum Derby Upgrades Online", "description": "Maximum Derby Upgrades Damage Engine CarCrash Make fun to crash cars on special derby arenas.<br/>In our game you will not find the best shooters of the world, driving off-road on off-road cars, drift and nitro. Ready to crash incidents of the car without brakes. The game is full of crashes and breakage from the broken auto rivals, just press new games and start destroying the wheelbarrows of rivals with all sorts of unimaginable blows. Racing without rules on cars is a special time of chaos in the derby arenas.<br/>Driving around the city according to the rules in stores or observing street traffic - not here! Survive a deadly race in a race without rules. The events in the game evolve so that you can hone your race skills where cars are broken into the most dangerous derby for survival. Your car is fighting from the car to break up its rivals.<br/>It's time to race with accidents on cars in the racing arena. Get ready for the car crashing into each other, hold out in the arena the longest. Feel the smell of fuel and enjoy the rout!<br/><br/>Features: <br/>- Racing with good graphics;<br/>- realistic damage from a car crash in a car accident game;<br/>- Mass collision crash game;<br/>- specially designed Derby arena race for survival;<br/>- games that weigh a little, with realistic graphics;<br/>- feel the race offline, the simulator is the best race to survive.<br/><br/>Victory and all the money of the world - not the main thing in the derby race for survival, most importantly - will enjoy the moment from collisions with other wheelbarrows! Machines without brakes game is filled with unexpected twists and at any moment you can change the position of the leader, on that guy whose car is turned over to the roof!", "metacritic": null, "released": "2018-03-17", "tba": false, "updated": "2019-07-30T11:42:59", "background_image": "https://media.rawg.io/media/screenshots/ac0/ac06103d6fb70c9fb7faa8297c46f777.jpg", "website": "https://www.facebook.com/smartmovegames", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 124, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["art ivanov"], "genres": ["Simulation", "Racing"], "publishers": ["art ivanov"], "esrb_rating": "Everyone 10+"}