{"id": 259238, "slug": "fnaf-final-purgatory", "name": "FNAF: Final Purgatory", "name_original": "FNAF: Final Purgatory", "description": "<p><em><strong>You cannot escape the nightmare you helped to create...</strong></em><br/></p>\n\n<p>FNAF: Final Purgatory is a randomly generated Five Nights at Freddy's fan game created in nine days for ProcJam 2018.</p>\n<p><strong>Go check out all of the other amazing ProcJam 2018 entries here!<br/></strong></p>\n\n<p>Survive the night, lasting from 12 PM to 6 AM. Keep an eye  out for animatronics as they roam through the map, waiting to stuff you into a suit if you are not careful! Each pizzeria layout is randomly generated, making every play through unique.</p>\n<p>FNAF: Final Purgatory is a remake of FNAF: Purgatory, which has been downloaded and played thousands of times since I developed it for ProcJam 2016. For ProcJam 2018, I thought I'd remake the game from the ground up, putting everything I have learned in the two years to make everything better overall.<br/></p>\n<p>(Also, it was an excuse to learn Unity again :P)<br/>\n<br/></p>\n<p><strong>Features</strong>:</p>\n<ul><li>All maps are completely randomly generated.<ul><li>Map size has increased from a maximum 9x9 in FNAF:Purgatory 2, To a massive 30x30 maximum size!</li><li>Likewise, maximum animatronic count has grown from 5 to 50!</li></ul></li><li>The majority of the generation process can be customized in game.<ul><li>Everything from map size to the amount of amount of animatronics. In the future, there will be more options for adding special\r\n    animatronics like Foxy, Balloon Boy, and Marionette.</li></ul></li><li>All of the graphics have been remade with a new stylized low-poly look.<ul><li>Everything has returned to it's FNAF:Purgatory 1 roots, but remastered<br/>    to keep a consistent scale and feel across the entire game.</li></ul></li><li>The code has been rewritten from the ground up, giving better overall performance!</li><li>FNAF:Final Purgatory is made with the Unity game engine, opening the door for interesting additions that would have been harder (though not impossible) to do with Godot (which is what the other games use).<ul><li>For example, Unity allows for sharing of animations across models with the same skeleton, which greatly speeds up animations across similar animatronics.</li><li>Godot is a great game engine, I moved to Unity to allow for interesting features that would have been otherwise much harder to make (and also because I wanted to learn Unity :P)</li></ul></li></ul>\n<p><strong>Known Issues</strong>:</p>\n<ul><li>When generating giant maps (over 20x20), sometimes the buttons for the rooms disappear and are hard, if not impossible, to access.</li><li>Sometimes animatronics can enter the opposite side of the security room, despite initially being on the other side! For example, they can sometimes<br/>  go to the left door when they entered the room on the right. This is unintended\r\n  functionality that will be removed in later versions.</li></ul>\n<p><em>If you find any issues, please let me know in the comments below! Thanks!</em><br/></p>\n<p><strong>Change log</strong>:</p>\n<ul><li>Version 0.1.0:<ul><li>Initial release!</li></ul></li></ul>\n<p><strong>Future plans:<br/></strong></p>\n<ul><li><strong>Planned for the next version:<br/></strong><ul><li>Add Foxy and Mangled. Foxy will act as you expect, with Mangled acting just like Foxy with some minor tweaks. Right now I do not know, but I'll figure it out.</li><li>Add pirate cove and whatever room Mangled will get.</li><li>Add Marionette and Prize corner.</li><li>Redo the dialog/recording for the intro cut scene. The current one is from FNAF:Purgatory 2, and it's <em>okay </em>at best. and really should be redone</li></ul></li><li><strong>Planed for a future version:</strong><ul><li>Add Balloon Boy and Balloon Girl. I have an idea on what they will do and it should be fairly unique and original.\r\n  (Might not be though, I have not kept up with any of the FNAF games/fan-games)</li><li>Add the \"Please stand by\" Foxy like animatronic from FNAF custom night. Like with Balloon boy/girl, I think I have a interesting idea for this one.</li><li>Add Spring Trap.</li><li>Add Golden Freddy. (Maybe?)</li><li>Add a vent system. (Maybe?)</li><li>Add shadow animatronics for Freddy, Chica, and Bonnie. (Maybe?) (Probably will just be reskins with tweaked AI, to be honest.)</li><li>Add more rooms, both new and from the FNAF games.</li><li>Add new animatronics/features/office (maybe?)</li><li>And more. <strong>If you have any suggestions, please leave them in the comments below!</strong></li></ul></li></ul>\n<p><strong>Note: This is a fan game, developed in my spare time. Please support the official Five nights at Freddy's games!<br/></strong></p>\n<p><strong>I do not claim ownership of any of the Five nights at Freddy's\r\nmaterial in this game</strong>.\r\nAll rights to Five nights at Freddy's belong to Scott Cawthon.\r\nThis is a free fan game, I don't make any money off it.\r\n<strong>For more legal information, please download and read README.pdf</strong>.</p>\n<p>Also: <strong>This game contains flashing lights, jump scares, and potentially loud noises!</strong> This game may cause issues to people with <strong>Photosensitive epilepsy</strong>, or similar conditions.<br/></p>", "metacritic": null, "released": "2018-10-28", "tba": false, "updated": "2019-08-05T09:50:03", "background_image": "https://media.rawg.io/media/screenshots/a47/a47a1200038ddd9da0caeaddf092b3e4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 6}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 67, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["TwistedTwigleg"], "genres": [], "publishers": [], "esrb_rating": null}