{"id": 259212, "slug": "caapora-adventure-ojibes-revenge", "name": "Caapora Adventure - Ojibe's Revenge (itch)", "name_original": "Caapora Adventure - Ojibe's Revenge (itch)", "description": "<p>An exploration/ adventure game with a wide world to be explored through skills that the player will acquire during the course of the game. With a beautiful hand painted cartoon graphic, the game has unique scenarios and characters inspired by amazon rainforest that hold the attention of the player who will have to face mythological entities to complete the main mission of the game: restore peace to the world of Zaltana.<br/></p>\n<p>STORY <br/><br/>A long time ago, the world was ruled by a constant conflict between the mythological and human world. But one day, a very powerfull shaman called Tamand arise and seald the peace between these two worlds by closing the portal through a holy stone called Caapora.<br/><br/>Since then, this stone has been protected for years by elemental guardians created from the power of Caapora. Some years later, the holy stone was broken up by a renegade Shaman called Ojibe and was fragmented into four parts that were spread throughout the continent of Zaltana. Since then, chaos and darkness has once again hovered over the human world and the mythological creatures and entities, such as: Boitatá, Yara, Mapinguari, Caipora(Curupira) e Mula sem cabeça, returned to inhabited the their world. <br/><br/><br/>Help Yacamin to restore the peace between the two worlds again! <br/><br/>OVERVIEW:<br/><br/>- A beautiful world to explore inspired by amazon rainforest <br/>- Release new places by using new behaviours (Mounting, Swimming, Jumping, Exploding Bomb, Metroidvania-like gameplay)<br/>- Use weapons such as: Bow, magical bombs, Spear, zarabatana, crafted Shields <br/>- Many Puzzles to solve in Dungeons<br/>- Original Characters<br/>- Original Soundtrack<br/>- Find the 10 rare Arara's feather<br/>- Defeat creature and entities inspired by Myths and Legends from Brazilian Folklore</p>", "metacritic": null, "released": "2018-10-27", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/f43/f43a5c8455d2838c8501317f0b5eb23c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 144, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Overaction Game Studio"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}