{"id": 25938, "slug": "reel-fishing-anglers-dream", "name": "Reel Fishing Angler's Dream", "name_original": "Reel Fishing Angler's Dream", "description": "<p>\n      Reel Fishing: Angler’s Dream is a fishing game like no other! Immerse \n      yourself in the sights, sounds, and even feel of fishing as you \n      experience the most realistic fishing game ever!\n    </p><p>\n      Reel Fishing: Angler’s Dream offers beautiful, picturesque fishing \n      locales, from calm, tranquil lakes to the beaches of tropical paradises. \n      You'll feel like you're really in nature as you listen to the gentle \n      lapping of waves, the call of distant birds, and the splash of hungry \n      fish ready to be hooked. You'll battle more than forty different types \n      of fresh and saltwater fish in your quest to become a master angler. \n      Each fish looks, moves, and fights just like the real thing; they'll \n      flee, dive, and jump out of the water in an effort to dislodge your hook \n      or break your line. Using the Wii Remote and Nunchuk, you'll believe \n      you're really fishing as you cast, reel, and move your rod.\n    </p><p>\n      When you're done fishing, head back to the lodge. There you can get \n      expert tips and advice from the Fishing Master, raise and care for your \n      most prized catches in the aquariums, check out the prizes and equipment \n      that you've earned, and learn about the tough and wily Legendary Fish \n      that you might one day catch.\n    </p><p>\n      Whether you are a casual angler or a seasoned veteran, Reel Fishing: \n      Angler’s Dream is the next best thing to actually being there!\n    </p><p>\n      Features\n    </p><p>\n      • Test your fishing skills against your family and friends in Versus \n      Mode, where up to 4 players can play!<br/>• Realistic stages, tons of \n      fresh and saltwater fish, and loads of tackle options!<br/>• Put your \n      angler skills to the ultimate test as you battle the rare Legendary Fish!<br/>• \n      Catch and raise fish in your aquariums!\n    </p>", "metacritic": null, "released": "2009-05-30", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 12, "reviews_count": 0, "platforms": ["Wii"], "developers": [], "genres": [], "publishers": ["Natsume"], "esrb_rating": null}