{"id": 25948, "slug": "the-legendary-starfy", "name": "The Legendary Starfy", "name_original": "The Legendary Starfy", "description": "<p>Beneath Starfy&#39;s glamorous exterior pulses the heart of a true hero. He<br />\ncan handle anything anyone throws at him. Swift ocean currents,<br />\nbottomless pits and hordes of enemies daunting for a lesser hero, but<br />\nnot Starfy, Nintendo&#39;s newest platforming sensation.</p>\n<p>FEATURES:</p>\n<p>Starfy has been a hero in Japan for years, and The Legendary Starfy<br />\nmarks his North American debut.</p>\n<p>Players must guide Starfy through a variety of lush environments to<br />\nthe end of each stage by swimming, jumping and bouncing - all while<br />\ndefeating comical enemies and big bosses. No two stages are alike.<br />\nEach one has its own mazes, puzzles and challenges to keep Starfy on<br />\nhis toes.</p>\n<p>Starfy&#39;s main ability is the Star Spin, an attack that propels him<br />\ninto his enemies with great force. It also lets him burst through<br />\nwalls and barriers, or power through strong currents. As the adventure<br />\ncontinues, Starfy learns new skills, such as the Shooting Star attack,<br />\nwhich lets him shoot into the ground like a meteor, and Air Jump,<br />\nwhich gives him increased jumping abilities.</p>\n<p>One of Starfy&#39;s key powers is his ability to transform into four<br />\ndifferent, powerful forms. Each one grants him special powers to help<br />\nhim overcome the obstacles he encounters throughout the game: Monstar,<br />\na dragonthat spits fire; Starpedo, an Arctic seal with acrobatic<br />\nabilities; Starfright, a spooky specter; and Roostar, a<br />\nsuper-squawking chicken that lays sonic eggs.</p>\n<p>Players can link with friends over a local wireless connection and<br />\nface off in a variety of mini-games that involve fishing (Fishing<br />\nDerby), racing (Depth Chargers), tracing shapes in the sand (Sand<br />\nTracer) and even cooking (Dumpling Master).</p>\n<p>Players can connect with friends through a local wireless connection<br />\nto play through a selection of the game&#39;s stages as Starfy and his<br />\nsister, Starly.</p>", "metacritic": 75, "released": "2008-07-10", "tba": false, "updated": "2023-05-10T04:57:18", "background_image": "https://media.rawg.io/media/screenshots/e0d/e0db71d53c13baaadf0507587e2984de.jpg", "website": "", "rating": 0.0, "rating_top": 4, "added_by_status": {"owned": 11, "beaten": 8, "toplay": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 5, "suggestions_count": 134, "game_series_count": 4, "reviews_count": 5, "platforms": ["Nintendo DS"], "developers": ["Tose"], "genres": ["Platformer"], "publishers": ["Nintendo"], "esrb_rating": "Everyone"}