{"id": 259707, "slug": "project-retrograde", "name": "Project Retrograde", "name_original": "Project Retrograde", "description": "<p>\n<br/>You can follow our progress on Project Retrograde at our facebook or twitter page, links below:</p>\n<p>\n<br/>Project Retrograde is a multiplayer twin stick brawler with a twist where your weapon doesn't kill other players, but the environment does. Players will only die when they touch any red objects in the map. </p>\n<p>Your objective is to be the last man standing among other players by killing players or just surviving the round. The last man standing will win the round, and the first to win five rounds will win the match. Battle against others with up to 8 players in a hectic match and experience the ultimate mayhem.</p>\n<p>\n<br/>The game is physics based, your bullets will push and bounce around objects including other players. You could use your own weapon's recoil to maneuver around the map much quicker or to dodge certain doom.</p>\n<p>\n<br/>Project Retrograde supports LAN, Online and Local multiplayer and supports up to 8 players in a match with a maximum of 4 players in a single machine.</p>\n<p>The online feature uses steam, and thus is currently disabled, this build currently only supports LAN in the meantime.</p>\n<p>\n<br/>Hey there, we are from Freemergency Studio, a freshly created game studio and Project Retrograde is our first project. After finishing college we took a leap of faith to chase our dream and, here we are.</p>\r\n\r\n\r\n\r\n\r\nFAQ\r\n<p><strong>When will the game be released?</strong></p>\n<p>Somewhere around Q1 2019.</p>\n<p><strong>Will there be a Battle Royale mode?</strong></p>\n<p>No. yes. I dunno, do you want it?</p>\n\n<p>Project Retrograde is a multiplayer only game, you would need a friend to join and play with you. Hook up some controllers and try it out.</p>", "metacritic": null, "released": "2018-10-26", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/d43/d43ae5816451eb6348eb98c81f1d46c7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 52, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["freemergency"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}