{"id": 259851, "slug": "brave-hero-yuusha-ex", "name": "Brave Hero Yuusha EX", "name_original": "Brave Hero Yuusha EX", "description": "What better way to spend an evening than gathered around listening to a classic tale of a brave hero saving a princess from a sinister demon lord bent on ruling the world? Sure, it may be the same story you've heard time and time again, but don't old stories get better with age? <br/><br/>So here we find our usual crew. A hero, a demon lord, and a princess all congregating to tell the story of the hero's triumph and the defeat of a great evil. Everyone here know their role and exactly how to carry it out. But what happens when the story doesn't go exactly as we know it? What if someone were to rewrite the story to something no one within it knows how to enact? Who's responsibility is it to put the story back on its track and find the happy ending we all know and love? <br/><br/>...Wait, didn't we do this once before? <br/><br/>Well, let's do it again, and we'll make it bigger and better this time! <br/><br/>Here Comes Brave Hero Yuusha EX! <br/><br/>This extended version of original Brave Hero Yuusha is Yuusha as you've never seen it before! Join the ragtag crew of the Yuusha, Demon Lord, and the Princess as they traverse the land to put the story of The Hero and the Demon back together and set the world right! Inspired by older console RPGs, Brave Hero Yuusha EX features a colorful visual style while keeping that classic adventure feel that you've come to love from RPGs of the 80s and 90s.<strong>Features: </strong>* 4-6 hours of that old-timey JRPG goodness.<br/>* A stellar new soundtrack by Agent Ape, and the ability to switch to the original chiptune OST at any time. <br/>* Fully revamped combat with new skills, improved enemy AI, and a more satisfying challenge. <br/>* Skippable encounters! If you are strong enough, flick those mean old random encounters away with the press of a button. <br/>* Jokes I thought were funny in 2015 and still aren't. <br/>* New battle animations. <br/>* Choose between male and female appearances for the hero. <br/>* A whole new postgame quest to enjoy.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:51:43", "background_image": "https://media.rawg.io/media/screenshots/6c0/6c0282011e012b755a79fddd3c9bf356.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "beaten": 1, "toplay": 1, "playing": 1}, "playtime": 0, "achievements_count": 20, "ratings_count": 1, "suggestions_count": 80, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Torch60"], "genres": ["RPG", "Indie"], "publishers": ["Torch60"], "esrb_rating": null}