{"id": 259863, "slug": "rise-of-ages", "name": "Rise of Ages", "name_original": "Rise of Ages", "description": "Rise of Ages is an adventure and exploration 2D game in sandbox style. In this incredible world, you will have to face several challenges to ensure your survival and evolve your civilization through history ages. Each age brings a story to be lived through and you will be rewarded with technologies to make new items.<br/><br/><br/><br/>Venture through quests and experience an exciting story. You will make friends, meet secret places and face the greatest challenges of your journey. But remember: there are great forces that will confront you as you advance in your discoveries.<br/><br/><br/><br/>Travel to the ends of the world and explore the most diverse biomes. With each new place, new resources will be at your disposal. Combine them to craft items and equipment that will allow you to go further.<br/><br/><br/><br/>Throughout the ages, you can produce new and more modern equipment. Your genetics will also evolve and allow you to acquire new skills and increase your vital attributes. You will not be alone! Form a civilization by inviting members and assigning professions to them. Boost your production and manage your economy.<br/><br/><br/><br/><ul><li>Evolve from stone age to space age, going through a total of six eras.<br/></li><li>Discover new technologies, each one expanding your possibilities. There is more than 30 of them.<br/></li><li>Found your civilization and call NPCs to live there. A city is just the beginning, claim other cities through war and build an empire.<br/></li><li>Each NPC will have a job and will work for you. They can specialize in a profession and become better at it. You can even create a supply chain.<br/></li><li>Experience a unique story on each age through dozens of quests and multiple side quests.<br/></li><li>Fight bosses that are powerful enemies and unimaginable beings.<br/></li><li>Craft multiple objects from your hands or from your skilled workers.<br/></li><li>Explore the world beyond the limits, going through the left/right most side of a region will leave you to the World Map that connects multiple regions of the world.</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2023-02-07T02:15:35", "background_image": "https://media.rawg.io/media/screenshots/99f/99fc9145c0261bbdb3a6711103b31435.jpg", "website": "http://playriseofages.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 7}, "playtime": 14, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 292, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Anguis Game Studio"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["99Gamers Digital"], "esrb_rating": null}