{"id": 25985, "slug": "treasure-world", "name": "Treasure World", "name_original": "Treasure World", "description": "<p>\n      Get out and explore to uncover thousands of wondrous treasures that are \n      waiting to be found. Create your own world that becomes more vibrant and \n      melodic as your riches grow. Expand your world and join Club Treasure \n      World where you can chat, set up trades and show off with other treasure \n      hunters across the globe.\n    </p><p>\n      Explore and discover Wi-Fi signals in the real world that will unlock \n      thousands of treasures in the game. Use the treasures to create your own \n      customized world; Treasures encompass numerous themes and appeal to \n      boys, girls and gamers of all ages; Use your imagination to dress up a \n      character that is uniquely yours – choose from over 100 character sets \n      like Ninja, Panda, Anime, Sports, Feline and so much more; Add some \n      melody to your world and create a musical masterpiece with every \n      treasure you collect; Choose from 150 song templates or be creative and \n      lay down your own tunes; Earn and collect Stardust to buy your treasure \n      collection’s missing pieces; Join ClubTreasureWorld.com and chat with \n      members to find out their favorite treasure spots, show off music and \n      treasures, set up trades and more!\n    </p><p>\n      As of May 20, 2014, the Nintendo Wi-Fi Connection service for Nintendo \n      DSi and Wii systems has been retired. Online features of this game are \n      no longer available after this date but this game still provides an \n      entertaining experience in offline mode.\n    </p><p>\n      To learn more about this service change, please visit To learn more \n      about this service change, please visit support.nintendo.com/servicesupdate.\n    </p>", "metacritic": null, "released": "2009-06-30", "tba": false, "updated": "2019-09-12T06:37:18", "background_image": "https://media.rawg.io/media/screenshots/ec3/ec3de257a81ba9f83c9c93ee8f432e7e.jpg", "website": "http://www.aspyr.com/product/info/111", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 225, "game_series_count": 0, "reviews_count": 0, "platforms": ["Nintendo DS"], "developers": [], "genres": [], "publishers": ["Aspyr"], "esrb_rating": null}