{"id": 259885, "slug": "pwu-huai-bao-bi", "name": "巭孬嫑毖", "name_original": "巭孬嫑毖", "description": "Dear friends! Let me briefly introduce our game \"without Kungfu shut up\" for you. It is an RPG simulation game, it is adventurous, casual, independent, and a little strategy, I hope you will be the one who dominates it! The anxious old king who was taken away by the dragon by the dragon will navigate for you and you will get the following experience:Outing adventureThe 10 chapter map is waiting for you to explore. Track the footprints of the dragon, you need to go to the map of ten different environments to take risks and collect materials to create powerful equipment!<br/><br/> Half turn-based battleSpeed affects the number of shots, and the attributes of the equipment and the Warrior affect combat effectiveness. Make up a team of 3 people and go for the little monsters.<br/>Don't be too reluctant to take the brother's life seriously, feel that the head is wrong, then quickly withdraw, when the deserter is quite shameful, but can live better than anything else!<br/>Building equipment<strong>800+ equipment waiting for you to build</strong><br/>I can only tell you that the selection of the strength of the warriors can create more powerful equipment, the rest can only look at your character!<br/><br/>Every piece of equipment is unique The attributes and skills of the equipment are <strong> look at the face </strong>, <strong>300+ skills waiting for you to experience </strong>, every time you create or surprise or accident. When the character breaks out, it is not only high in attributes, but also in many skills. It is more <strong> outside the border </strong> equipment appears!<br/>Powerful skills can ignore all attributes<br/><br/> Fortunately: When a fatal attack occurs, there is a 20% chance of resurrection.Store sale Shops generally sell some common materials. Of course, sometimes you will see something like this...<br/><br/>Choose a pair of underwear?  Pick a pair of broken shoes?  Or come to a pan that eats chicken? <br/>Want to bargain with the owner of the store? Feel free to join the bar. Recruiting Warriors 60+ Warriors are waiting for you to conquer. Recruitment of the pub, they have dreams and skills. Funny dialogues, accidents emerge endlessly.<br/><br/><br/> Refined pharmaceutical waterSome maps contain magical mushroom essence, and you can see your life if you can meet them! Catch them and bring them to Tang Grandpa. You will have unexpected gains.<br/><br/><br/> delegate mission Delegate tasks generated in real time, where the powerful materials are acquired.<br/><br/><br/>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:51:38", "background_image": "https://media.rawg.io/media/screenshots/cd2/cd2cdacc089a41092d3ef41dae9a7cca.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 301, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["FunLimit"], "genres": ["Adventure", "RPG", "Simulation", "Casual", "Indie"], "publishers": ["FunLimit"], "esrb_rating": null}