{"id": 259859, "slug": "wallenda", "name": "Wallenda", "name_original": "Wallenda", "description": "<strong>Wallenda invites players to the era of science &amp; magic.</strong><br/><br/><br/><br/>It was a very prosperous world, the people’s life was very convenient due to the strong power of science and magic. However, since the people accidentally found that Heart Stone can provide energy for Magic Doll, they had been focusing on the research on Magic Doll, no longer care about the planned development direction. Finally, nightmare came. The world was invaded and all people disappeared. Many years later, one early Magic Doll woke up quietly. With the awakening of the mysterious power, she travelled through the world full of nightmare. In order to find the airship and escape from the horrible world, she must go through various levels until the end of the journey.<br/><br/><br/><br/><strong>Wallenda is an action &amp; adventure puzzle game.</strong><br/><br/><br/><br/>In the game, you will meet challenges of different kinds. Players can use the existing abilities of the doll to cope with these difficulties and collect the Heart Stone hidden in the levels. As the energy for Magic Doll, Heart Stone can encourage Magic Doll to move forward and provides big help in the last battle. Some Heart Stones are not easy to acquire.  With the level development, Magic Doll will be able to unlock more powerful abilities. When she grows strong enough, she can go back to the early levels to hunt for Heart Stone as well as challenge the hidden sub-line levels.<br/><br/><br/><br/>Compared to the previous one, Wallenda has more interesting gameplay. The character is added with more actions and skills, which can give you special visual effects. If you are able to collect some ancient magazines during the journey and have a read, you will understand the origin of the story between Magic Doll and the Nightmare.<br/><br/><br/><br/>The game has total 7 chapters which consists of 56 unique levels. Each level has different scene and BGM. Follow the excellent sound, embark on your adventure in the fantasy scene and hunt for the secret. The gameplay element includes action, puzzle, collection, escape, underwater, BOSS battle, etc. Enjoy the journey! If you are careful enough, you may find some “Easter Eggs”!<br/><br/><br/><br/>The game levels are delicately designed to bring players the main-line levels of moderate difficulty and some hidden sub-line levels of high challenges. The sub-line levels require more skilled controls and quicker reactions. More difficult, more bonus, of course. <br/>In the last chapter, Magic Doll will take advantage of the collected Heart Stone and have an epic battle with the powerful pirate.  Only the winner can leave the nightmare world and embark on a new journey!<br/><br/>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:51:42", "background_image": "https://media.rawg.io/media/screenshots/1e0/1e0d0347e5df67e883b0f85ec853b245.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 283, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["DongXiang"], "genres": ["Action", "Adventure", "Casual", "Indie"], "publishers": ["Maple Whispering Co"], "esrb_rating": null}