{"id": 25986, "slug": "harry-potter-and-the-half-blood-prince", "name": "Harry Potter and the Half-Blood Prince", "name_original": "Harry Potter and the Half-Blood Prince", "description": "<p>In Harry Potter and the Half-Blood Prince, Voldemort is tightening his<br />\ngrip on both the Muggle and wizarding worlds and Hogwarts™ is no longer<br />\nthe safe haven it once was. Harry suspects that dangers may even lie<br />\nwithin the castle, but Dumbledore is more intent upon preparing him for<br />\nthe final battle that he knows is fast approaching. Together they work<br />\nto find the key to unlock Voldemort’s defenses and, to this end,<br />\nDumbledore recruits his old friend and colleague, the well-connected and<br />\nunsuspecting bon vivant Professor Horace Slughorn, whom he believes<br />\nholds crucial information. Meanwhile, the students are under attack from<br />\na very different adversary as teenage hormones rage across the ramparts.<br />\nHarry finds himself more and more drawn to Ginny, but so is Dean Thomas.<br />\nAnd Lavender Brown has decided that Ron is the one for her, only she<br />\nhadn&#39;t counted on Romilda Vane’s chocolates! And then there’s Hermione,<br />\nsimmering with jealousy but determined not to show her feelings. As<br />\nromance blossoms, one student remains aloof. He is determined to make<br />\nhis mark, albeit a dark one. Love is in the air, but tragedy lies ahead<br />\nand Hogwarts may never be the same again.</p>\n<p>Return to Hogwarts to help Harry survive his sixth year. You will have a<br />\nchance to engage in exciting wizard duels, mix magical ingredients in<br />\nPotions class and take to the air as the Seeker of the Gryffindor<br />\nQuidditch team. You may even get sidetracked by Ron’s romantic<br />\nentanglements as you journey towards a dramatic climax and discover the<br />\nidentity of the Half-Blood Prince.</p>", "metacritic": 64, "released": "2009-06-30", "tba": false, "updated": "2024-04-09T07:44:11", "background_image": "https://media.rawg.io/media/games/11a/11a4b86d38c877c6ffbf915547388d01.jpg", "website": "http://www.harrypotter.ea.com", "rating": 3.43, "rating_top": 4, "added_by_status": {"yet": 17, "owned": 172, "beaten": 232, "toplay": 31, "dropped": 40, "playing": 1}, "playtime": 17, "achievements_count": 83, "ratings_count": 182, "suggestions_count": 551, "game_series_count": 10, "reviews_count": 183, "platforms": ["Nintendo DS", "PlayStation 2", "Xbox 360", "PlayStation 3", "macOS", "PSP", "Wii", "PC"], "developers": ["Electronic Arts Bright Light", "Electronic Arts Casual Entertainment"], "genres": ["Action", "Adventure"], "publishers": ["Electronic Arts"], "esrb_rating": "Teen"}