{"id": 259813, "slug": "cypest-underground", "name": "CYPEST Underground", "name_original": "CYPEST Underground", "description": "As a computer virus you are infiltrating various servers and avoid their defense systems to reach the CPU. This is like a racing competition. Every progress gets you points. Your best score for each level will be saved in an online highscore list.<br/>The highscore list is separated into 7 continents, 26 regions and 216 countries. You can see your ranking everytime for the respective location. Set your own goals! Do you want to be the best at your favorite level in your country, continent or even worldwide?<br/><br/>Besides the highscores for every level CYPEST also has a \"Hacker-Olymp\"! There all scores of a player are summed up for universal global highscore list. The game mechanices are child's play. The virus is flying upwards automatically, you'll only need to press left or right on the keyboard or gamepad. Easy to learn, hard to master. You can play the game with your friend on one PC. In each level you can also get up to four medals for your score.About the development<br/>Our goal is to develop an aracde game which brings back the feeling of the 80s and 90s without copying another classig game one to one. You'll learn the game mechanics in seconds and have fun immediately. On the other side you can play for many hours to master the gameplay.<br/><br/>CYPEST was originally developed as a freeware game and can still be played on the website of the game for free. It is running inside the browser and on Windows. The twenty freeware levels are 100% free.<br/><br/>CYPEST Underground is the further development. There is one new mission with 12 levels. The levels from the freeware were overhauled. The game is now more beginner friendly, but experienced players will also get a challenge. The medal system is completely new. You can play the freeware and see if you like the gameplay. It is like an extensive demo.<br/><br/>You can not only see your accomplishements inside the game, but also on the CYPEST web page. You can also share them on every social network without hassle.<br/><br/>CYPEST Underground is 100% integrated into the Steam ecosystem. You don't have to register a new account. There will be achievements and many other things. During the first start of the game you'll need to set your location and can play immediately. Highscores from the freeware can not be carried over. The game is running on a custom engine written in C++ and based on SDL2. There was also a custom level editor used, which will not ship with the game. Besides a few alpha and beta testers, CYPEST was developed by two people.<br/><br/>Privacy protection<br/>We're only saving the data which is absolutely necessary, regardless of the freeware or Steam version. The game is only connecting to the server if one logs in or reaches a new highscore. The score will be saved into a database. We don't save how often you play. We will not know how many times you tried a level. There is no tracking code. Only the data is saved which is needed for your maximum gaming experience. The statistics you'll see inside the game will only be saved on your local machine.Features<br/>- easy controls via keyboard or gamepad<br/>- currently 32 levels<br/>- medal awards<br/>- comprehensive online highscore lists<br/>- an online profile for every player<br/>- local two player mode<br/>- local statistics<br/>- colorful neon graphics", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:51:45", "background_image": "https://media.rawg.io/media/screenshots/fae/faecf0f9742e39736b525b98d58fedb3.jpg", "website": "https://www.cypest.net/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 113, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Gravitation Art"], "genres": ["Action", "Indie"], "publishers": ["Gravitation Art"], "esrb_rating": null}