{"id": 259855, "slug": "maomao-discovery-team", "name": "Maomao Discovery Team", "name_original": "Maomao Discovery Team", "description": "！Story:<br/>\r\n In a office where only you and your assistant Maomao live in,<br/>\r\n your Maomao got succubus curse from an adventure,<br/>\r\n so you have to start a journey to help Maomao remove her curse.<br/>\n<br/>\r\n！Instructions:<br/>\n<br/>\r\n ． This is an idle RPG game.<br/>\r\n    It’s easy to handle those RPG battles.<br/>\r\n    Aside from RPG battles, you can ask Maomao to do auto explorations,<br/>\r\n    so that they can be enhanced and empowered with skills.<br/>\r\n    When you encounter strong enemies, you can either go back to the labyrinth for practices,<br/>\r\n    or ask your Maomao to do auto explorations and ultimately you will beat the enemies someday.<br/>\r\n    (You could still get all the game contents without auto exploration.)<br/>\n<br/>\r\n ．When your Maomao’s HP is reduced, <br/>\r\n   three types of changes will be effective for its graphic.<br/>\n<br/>\r\n ．This is a pure love game in which you are able to <br/>\r\n   cultivate relationships with your Maomao from time to time,<br/>\r\n   and the higher level of lust you get, the more sex positions <br/>\r\n   you can play with your Maomao.<br/>\n<br/>\r\n ．There are some power-ups elements, <br/>\r\n   including learning skills, enhancing skills, weapons and bases.<br/>\n<br/>\r\n ．The window can be minimised,<br/>\r\n   so that you can play the game whenever you want,<br/>\r\n   and you can have sex with your Maomao whenever you would like.<br/>\n<br/>\r\n ．This game has auto battle and speed-up functions so that you can do a quick play.<br/>\n<br/>\r\n！Game System:<br/>\r\n ．Battle system:<br/>\r\n   The player and the enemy both have special skill deck when the battle starts,<br/>\r\n   and the player has four weapon decks while the enemy has only one,<br/>\r\n   during every round, the player and the enemy can choose one special skill to attack each other.<br/>\r\n   When all the special skills are used up, they can consume the number of rounds to reload.<br/>\n<br/>\r\n ．You can get gear, special skills and normal skills in the labyrinth,<br/>\r\n   once you get a duplicate gear or special skill, their efficiency will be enhanced.<br/>\n<br/>\r\n ．Under specific circumstance in the labyrinth, the lust of Maomao will be increased,<br/>\r\n   Maomao’s lust level will be upgraded after have a sex,<br/>\r\n   and you can play more sex positions with Maomao when its level is upgraded.", "metacritic": null, "released": "2018-11-08", "tba": false, "updated": "2019-08-28T21:51:42", "background_image": "https://media.rawg.io/media/screenshots/54b/54b808f7358667940ca37b51d39c396c.jpg", "website": "https://celusisstudio.blogspot.com/", "rating": 4.33, "rating_top": 5, "added_by_status": {"owned": 7, "toplay": 1}, "playtime": 0, "achievements_count": 13, "ratings_count": 6, "suggestions_count": 366, "game_series_count": 0, "reviews_count": 6, "platforms": ["PC"], "developers": ["Celusis"], "genres": ["RPG", "Indie"], "publishers": ["CelLab"], "esrb_rating": null}