{"id": 259877, "slug": "pythagoras-perpetual-motion-machine", "name": "Pythagoras' Perpetual Motion Machine", "name_original": "Pythagoras' Perpetual Motion Machine", "description": "A puzzle game featuring \"perpetual motion machines\".<br/>\r\nHead to the top of the tower, guided by a mysterious voice...<br/>\n<br/>\r\nIn Pythagoras' Perpetual Motion Machine, use various <br/>\r\ncontraptions to make your way through the game.<br/>\n<br/>\r\nThe game setting is located in a tower piercing the heavens.<br/>\r\nEach stage contains gimmicks including...<br/>\r\n- Boulder ejecting switches<br/>\r\n- Elevators <br/>\r\n- Catapults<br/>\r\n- Balance Scales<br/>\n<br/>\r\nBy setting up the contraptions in the right locations, <br/>\r\nthe boulders will roll around in a perpetual route.<br/>\n<br/>\r\nMove things, press switches, roll around yourself...<br/>\r\nThink about the mutual effects of the gimmicks and <br/>\r\ncreate \"perpetual motion machines\". That is your objective.<br/>\n<br/>\r\nWith a huge volume of 40 stages, there are difficult levels <br/>\r\nwhich will require you to use your brain. As such, <br/>\r\ncompletion should leave you with a truly fulfilling sense <br/>\r\nof achievement. You may just even embrace feelings of awe, <br/>\r\nwishing to gaze endlessly at your beautiful construction.<br/>\n<br/>\r\nAll stages have hints and the ability to skip.<br/>\r\nThere are no penalties or restrictions built into this game.<br/>\r\nSo even those that are not good at puzzles can enjoy.<br/>\n<br/>\r\nIn the tower there be special monuments with messages <br/>\r\nart inscribed into them. Just what do they mean...?<br/>\n<br/>\r\nWho am I? What purpose does this tower serve...?<br/>\r\nBetween the puzzles and contraptions, give it a ponder.<br/>\n<br/>\r\nThis game does not require fast aiming or precise control.<br/>\r\nFace off against the game's logic with your knowledge, <br/>\r\ncunning and sparks of brilliance as your only weapon.<br/>\r\nWe hope you enjoy this purely puzzle solving experience.", "metacritic": null, "released": "2018-11-12", "tba": false, "updated": "2019-07-25T21:05:03", "background_image": "https://media.rawg.io/media/screenshots/af3/af3bb489b756737c9a4709e9ee797ea5.jpg", "website": "http://marudice.hatenablog.jp/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 426, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Maru Dice"], "genres": ["Action", "Indie"], "publishers": ["DLsite.com"], "esrb_rating": null}