{"id": 259987, "slug": "ma-thien-ky", "name": "Ma Thiên Ký", "name_original": "Ma Thiên Ký", "description": "Ma Thiên Ký –  siêu phẩm Tiên Hiệp cuối cùng của năm 2017. Không chơi, phí một đời người!<br/><br/>Ma Thien Ky Mobile có gì hấp dẫn<br/>1.  Đồ họa sống động, màu sắc bắt mắt.<br/><br/>2.  Chức năng chuyển sinh - lần đầu tiên xuất hiện trong game tiên hiệp:<br/>- Tu vi lên cấp, chuyển sinh càng mạnh, chức vị tu tiên càng cao.<br/>- Đồ chuyển sinh gồm full 12 cấp với 4 môn phái khác nhau.<br/><br/>3.  Hệ thống BOSS dày đặc, phụ bản vượt ải thăng tiên:<br/>- Với hơn 6 phụ bản, vượt qua 200+ Ải tìm kiếm nguyên liệu nâng cấp.<br/>- Hàng trăm Boss Dã Ngoại, Ảo Cánh, Cá Nhân, Thế Giới, Chi Gia, tru tiên liên tục được hồi sinh đánh quài không hết, farm quài không chán.<br/><br/>4. Tiên minh tranh bá - Kết tình huynh đệ - Công thành và có nguyên 1 Lãnh địa dành riêng cho mỗi Tiên Minh trong Ma Thien Ky<br/><br/>5.  Nhiều tính năng đặc sắc, hấp dẫn, trên từng mi-li-mét:<br/>- Chat Voice, thay Avatar, Đồ thời trang, Chiến Kỵ, Cánh, Pet tru triên, Mỹ Nữ, Tiên Bảo, ảo hóa kiem vu, tọa kỵ đôi ... cực kỳ phong phú và cực đẹp.<br/><br/>6. Trăm cách chơi, vạn cách phối đồ, triệu cách mãn nhãn.<br/><br/>7. Ma Thiên Ký – Sở hữu 4 môn phái tha hồ lựa chọn.<br/><br/>8. Game nhẹ mà hay, chơi mượt mọi máy. Cam kết Update 2 lần 1 tháng", "metacritic": null, "released": "2017-09-01", "tba": false, "updated": "2019-10-22T13:58:30", "background_image": "https://media.rawg.io/media/screenshots/03c/03c77d185526c6422bdb34d0d728b27e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 185, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["VTC Mobile"], "genres": ["Action", "RPG"], "publishers": ["VTC MOBILE JOINT STOCK COMPANY"], "esrb_rating": null}