{"id": 259916, "slug": "mutate", "name": "Mutate!", "name_original": "Mutate!", "description": "Mutate is a rogue-like game with some features of bullet-hell. The player takes on the role of one of the genetic clones specially engineered for a particular mission to save the mankind.<br/>\n<br/>\n<br/>\r\n•\tRandom generation of systems and planets.<br/>\r\n•\tThree classes of characters with their own special game styles.<br/>\r\n•\tMutations are the main feature of the game.<br/>\r\n•\tEach planet differs in ecosystem and species of enemies.<br/>\r\n•\tRandom planetary events.<br/>\r\n•\tHuge weapons arsenal.<br/>\n<br/>\n<br/>\n<br/>\r\nIt was the XXII century. Mankind was at its peak. All the disputes and fights between people were settled, which soon led to building the unified great state. Science developed rapidly, and scientists were able to make interstellar journeys by 2100. This discovery was followed by massive colonization of livable planets. It seemed that nothing could destroy the idyll, but something unexpected happened: the communications breakdown with the colony Helios-15. A military detachment was sent there immediately to clarify the circumstances, but soon the communication with them was broken too. And that’s when the nightmare began. Portals began to open, and high-tech robots started to appear from them one by one. They killed everyone they noticed without hesitating. The military could do nothing, and the colonies surrendered by the onslaught of the enemy, one after another. Soon the line of defense reached the Earth. Humans resisted, but it was useless, as the enemy outnumbered them and emerged from the most unexpected places. Everything seemed to be lost, but there was still hope. The remains of the government sent the cruiser through the enemy blockade with a squad onboard of scientists, military, and also some civilians who were fortunate enough to evacuate. The goal was to preserve what remained of mankind and to try to find out where the robots came from and how to deal with them. The cruiser broke through and disappeared in the depths of the so-called black space. There, in the laboratory, the genetically modified clones were engineered and planned to be used to fight the enemy. But as it turned out later, their DNA was unstable, and after a while, they showed different mutations. These mutations radically changed their appearance but gave superhuman abilities. Without thinking twice, scientists and military began to send them to explore the borders of our galaxy, in order to find out where the Enemy came from and how to stop it. You are one of those clones, and the fate of mankind depends on you only.", "metacritic": null, "released": "2018-10-27", "tba": false, "updated": "2019-08-28T21:51:36", "background_image": "https://media.rawg.io/media/screenshots/fc8/fc80d1d5fe408422f0de86575d601369.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 15, "ratings_count": 0, "suggestions_count": 292, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MyDreamForever"], "genres": ["Adventure", "Indie"], "publishers": ["Atriagames"], "esrb_rating": null}