{"id": 259990, "slug": "thien-thu-mobile", "name": "Thiên Thư Mobile", "name_original": "Thiên Thư Mobile", "description": "Thiên Thư Mobile - game nhập vai MMORPG đầu tiên cho Farm người lên cấp, Đồ sát kiếm tiền.<br/><br/>10 tính năng đặc sắc<br/><br/>01. Đồ sát có quà hằng ngày.<br/>02. Đồ sát nhiều có tôn hiệu<br/>03. Đô sát quá tay, nhận ngay tên ĐỎ. Lúc đó bị giết sẽ có khả năng RƠI ĐỒ đang mặc<br/>04. Đồ sát được nhận EXP, Đồ sát người chơi tên ĐỎ được EXP nhiều hơn. <br/>05. Không mất (reset) chúc phúc. Không lo bị HÚT MÁU<br/>05. Đánh quái rơi đồ không khóa<br/>06. Tự do giao dịch TẤT CẢ<br/>07. Có chat voice, cho up avata thật như facebook<br/>08. Thú cưỡi đôi, không phân biệt giới tính<br/>09. Nông trại \"chăn\" cá. Sáng \"chăn\" cá - Tối PK <br/>10. Phi thăng xuyên địa hình<br/>......... và còn nhiều tính năng đặc sắc các, mời bạn vào game để khám phá <br/><br/>Cam kết <br/>- Không lag, dis <br/>- Cập nhật liên tục 1 tháng 1 lần <br/>- Hỗ trợ 24/24 qua tổng đài 19001104 <br/>- Các admin game Thỏ Ngọc, Tuấn Tài Tình, Long Huynh... support tận hình, đồng hành cùng gamer. <br/>- Thường xuyên tổ chức họp mặt offline<br/><br/>Thiên Thư Mobile đem đến điều gì cho bạn?<br/><br/>1. Một thế giới đầy màu sắc và thử thách khi bạn muốn \"Trốn Tránh Thực Tại Buồn Chán\"<br/>2. Cảm giác PK sếp, ĐỒ SÁT khách hàng mà không phải chịu hậu quả<br/>3. Được LÀM LIỀU với nhiệm vụ do thám cực kỳ đau tim<br/>4. Tham gia vào những cuộc THANH TRỪNG đẫm máu giữa các bang hội<br/>5. Những cuộc vui THÂU ĐÊM cùng 500 anh em mà vẫn được ở bên GẤU.<br/>6. Rèn luyện BẢN LĨNH trong game để MẠNH MẼ ngoài đời.<br/><br/>Một số lời nhắn nhủ từ BQT Thiên Thư Mobile<br/><br/>1. Tính mạng nhân vật của bạn là do bạn quyết định. Chúng tôi không thể BẢO KÊ hay bảo hiểm cho bạn.<br/>2. Chúng tôi tặng các bạn KNB đủ để bạn sống được trong game. Còn muốn giàu thì tự đi mà cày, quái có rơi vật phẩm đó.<br/>3. Chúng tôi có chợ cho các bạn giao dịch tự do. Có chí lập bang, có gan làm giàu nha.<br/>4. Nếu thấy cày lâu quá thì bạn có thể đi CƯỚP. Nhưng bạn tự phải chịu trách nhiệm về hành động của mình<br/>5. Chúng tôi không hút máu. Bạn thích hiến máu thì chúng tôi nhận. Cảm ơn!<br/>6. Tại Thiên Thư Mobile, an toàn khu chỉ rộng 5 hàng gạch tại thành chính. Tất cả các nơi khác đều có thể đồ PK - ĐỒ SÁT. <br/><br/>Thiên Thư là tựa game nhập vai MMORPG hàng đầu với chiến trường PK đa dạng nhất hiện nay. Đến với Thiên Thư, các bạn bước vào thế giới tiên hiệp, trải nghiệm cảm giác phàm nhân tu tiên, tranh đoạt lãnh thổ, pk loạn anh hùng. Thiên Thư mang đến một thế giới tiên hiệp lung linh, huyền ảo nhưng cũng đầy khốc liệt với chế độ pk khắp nơi, bang chiến quyết liệt, đặc biệt với tính năng phi hành, du ngoạn mọi địa hình, hứa hẹn sẽ là một tính năng hấp dẫn.<br/><br/><br/>Trên thị trường có hàng trăm tựa game. Cảm ơn bạn đã chọn Thiên Thư Mobile. Chúng tôi hứa sẽ cố gắng không làm bạn thất vọng. Nếu có bất kỳ thắc mắc góp ý nào hãy cho chúng tôi biết ngay theo địa chỉ:", "metacritic": null, "released": "2017-06-29", "tba": false, "updated": "2019-10-22T13:58:30", "background_image": "https://media.rawg.io/media/screenshots/881/881abf792cda84be4444b5c6b55d0ef4.jpg", "website": "http://thienthumobile.vn", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 182, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["VTC Mobile"], "genres": ["Action", "RPG"], "publishers": ["VTC MOBILE JOINT STOCK COMPANY"], "esrb_rating": null}