{"id": 260051, "slug": "street-dunk", "name": "Street Dunk!", "name_original": "Street Dunk!", "description": "Grab the ball and set it on fire!<br/><br/>There is only one rule - NO RULES! Well, as long as ball scores the hoop! <br/><br/>Tap at the right moment to shoot the ball. Take your time to find the right curve and score! Execute the clean shot for perfect hit and turn the ball ablaze!<br/><br/>Score all the hoops to complete the level and travel to the next court. Can you dominate them all? <br/><br/>Do you have what it takes to become the best baller on the street?<br/><br/>SUBSCRIPTION PRICING AND TERMS<br/><br/>Weekly Vip Club offers a weekly subscription for $5.99 after a 3-day free trial. It unlocks exclusive car, unique outfit, free car upgrade upon level completion and removes all skippable ads and banners.<br/><br/>End of trial and subscription renewal<br/><br/>This price is established for United States customers. Pricing in other countries may vary and actual charges may be converted to your local currency depending on the country of residence.<br/><br/>Payment will be charged to your iTunes Account at confirmation of purchase.<br/><br/>Subscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the current period.<br/>Account will be charged for renewal within 24-hours prior to the end of the current period, and identify the cost of the renewal.<br/><br/>Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user’s Account Settings after purchase.<br/><br/>Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that publication, where applicable.<br/><br/>Canceling trial or subscription<br/><br/>You can turn off the auto-renew for the subscription whenever you want to through iTunes.<br/><br/>Check https://support.apple.com/HT202039. When your current trial/subscription period expires, you will be unsubscribed. The current active subscription period can not be canceled. After your subscription expires, you will no longer be able to use elements included in Subscription option.<br/><br/>If you have any questions or comments, feel free to contact us at info@saygames.by<br/><br/>Privacy Policy: https://saygames.by/privacy-policy/streetdunk <br/>Terms of Use: https://saygames.by/terms-of-use/streetdunk", "metacritic": null, "released": "2018-10-05", "tba": false, "updated": "2019-07-29T07:22:25", "background_image": "https://media.rawg.io/media/screenshots/c28/c28a094bdc684d08e5dbd7082d2b24b8_KXOBXY1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 40, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["SayGames"], "genres": ["Action", "Arcade", "Casual"], "publishers": ["SEIGEIMS, OOO"], "esrb_rating": null}