{"id": 260136, "slug": "2d-rally-race-against-time-2", "name": "2D Rally - Race Against Time", "name_original": "2D Rally - Race Against Time", "description": "You drive a buggy to a rugged mountain range, ready for an extreme racing challenge, driving a buggy on a hilltop, moving to a target location within a specified amount of time, constantly gaining new distances and challenging higher points; and paying attention , Here's buggy is no brake, only the throttle. You can only choose to accelerate forward.<br/><br/>2D RALLY FEATURES<br/>- 2D Rally: Race Against Time is a 2D racing game with one touch controls<br/>- Procedurally generated hill tracks with check points<br/>- Compare your rally racing skills against others and share your highscore to friends<br/>- NO in-app purchases<br/>- In game leaderboard. Can you beat your friend’s highscore? <br/>- In Play achievements: distance, speed and more, compare your progress against friends<br/>- Quick reset in case you crash your rally car<br/>- Additional race and player stats for advanced drivers: collected medals, longest drive, average speed, high speed and crashes<br/><br/>2D RALLY GAME GUIDE<br/>- Tap and hold the screen to start racing. Keep it down to give car more speed<br/>- Try to get your car as far as possible, as fast as possible before you run out of time. Try to finish a race without many crashes<br/>- Release touch to slow down speed. Handy against steep hills<br/>- If you crash your car and get stuck, wait till the car resets automatically to continue the race.<br/>- Open the game menu and click the rewind button to restart a race<br/>- To drive further, a check point will increase your time<br/>- If you are out of time, you may still make it to a check point if the car is rolling downhill!<br/>- After a game over, a line segment will show your previous best drive and current drive", "metacritic": null, "released": "2017-12-06", "tba": false, "updated": "2019-10-22T13:58:52", "background_image": "https://media.rawg.io/media/screenshots/d3d/d3d6797f0b1668e76f33044e4f9b1efb.jpg", "website": "http://opencoder.blogcn.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 42, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["qinglin yao"], "genres": ["Action", "Racing"], "publishers": ["qinglin yao"], "esrb_rating": null}