{"id": 26017, "slug": "atv-quad-kings-2", "name": "ATV: Quad Kings", "name_original": "ATV: Quad Kings", "description": "<p>\n      ATV Quad Kings immerses the player in the world of ATV motocross racing \n      where aggressive driving and hard-hitting skills are needed to become \n      the King of ATVs. Travel across the globe from the United States to \n      Australia and race in nine breathtaking locations. Compete in incredible \n      high-adrenaline races at each track… but that’s not all! Perform tricks \n      and catch big air in freestyle events to increase your skill rating. \n      There’s no where to hide! It’s fast and furious four-wheel racing on Wii!\n    </p><p>\n      Features\n    </p><p>\n      • Four championship levels from Amateur to All Star gets everyone in the \n      game<br/>• Four game modes: World Tour, Arcade, Time Trial, and Freestyle<br/>• \n      Many quad bikes and dune buggy vehicles to choose from, each with \n      varying suspension, acceleration, speed, handling, and braking attributes<br/>• \n      Earn money from races to customize your vehicles in your virtual garage<br/>• \n      Race head-to-head in two player Arcade and Freestyle events<br/>• Win the \n      five World Tour trophies including the ultimate ATV Quad Kings Trophy to \n      be #1<br/>• Master the Freestyle stunt events to unlock tracks in the \n      Arcade game mode<br/>• Contend with different road surfaces such as soil, \n      grass, and water—and watch out for the occasion rain shower to change \n      the track conditions<br/>• Play with your Wii Wheel for additional fun\n    </p>", "metacritic": null, "released": "2009-08-04", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["Wii"], "developers": [], "genres": [], "publishers": ["Zoo Games"], "esrb_rating": null}