{"id": 260120, "slug": "mini-attack-counter-terrorist", "name": "Mini Attack Counter Terrorist", "name_original": "Mini Attack Counter Terrorist", "description": "Fight the global terrorism and become the ultimate counter terrorist!<br/>Now step into a world full of terrorists, make a blitz attack, secure a location, defuse a bomb or just save or rescue hostages! Can you keep steady aim under heavy fire <br/>and strike out terrorists while grenades are exploding all around you? Gun down your enemies using a variety of heavy weapons. Or switch to butterfly knife to finish <br/>them off. It’s all your call, my bravo shooter!<br/><br/>Mini Attack Counter Terrorist is the fast paced first person shooter where you play as a dangerous agent on a task to complete all the major missions. In this game you <br/>will have to take down multiple targets with , assassinate all the targets from the top of a helicopter and much more. These tasks just keep getting harder and harder <br/>and the enemies are increasing in every level. Can you maintain your cool and come out as the top shot? Use high tech long range weapons to sniff out the enemy and <br/>hit them. Upgrade to higher guns to create huge damage with a single bullet. Bored of the sniper mode? Do not worry, we also have a huge arsenal of assault rifles to <br/>keep the heat high. Ammo may be not enough, you also can collect different type's ammo during action war, ammo is really important.<br/><br/>Auto reloading, crouch, jump and smooth scope controls wih minimal recoil make Mini Attack Counter Terrorist the best shooter gaming experience on mobile. <br/>Use the mini map to watch out for the enemy that approaching forward or towards you and stay alert to survive till the end. Smooth scope also let you shoot more easy.<br/>With tactical AI using high level offense moves like throwing a grenade to hold you engaged for hours. This is not going to be easy at all. So get ready for the <br/>ultimate rain of bullets while using the medi kit to refill the health regularly or you will die soon! Reload, stack up the bullets and fire to eliminate the last of <br/>the enemies. Especially headshots will kill your enemies on single shot! Follow the sniper's bullet as it travels forward or towards your kill.<br/><br/>Mini Attack Counter Terrorist Features:<br/>- Use Joystick to move around<br/>- Touch and slide the screen to aim and kill the enemy<br/>- Use sniper mirrors to zoom in and out and aim at and kill enemies<br/>- Click the Shoot button, launch bullets<br/>- Nice Graphics", "metacritic": null, "released": "2018-10-26", "tba": false, "updated": "2019-10-22T13:58:52", "background_image": "https://media.rawg.io/media/screenshots/04f/04f7672b8cabff0ec2259a1c5670a691.jpg", "website": "https://www.facebook.com/opencoderx/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 182, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["qinglin yao"], "genres": ["Action", "RPG"], "publishers": ["qinglin yao"], "esrb_rating": null}