{"id": 2602, "slug": "space-miner-platinum-edition", "name": "Space Miner: Platinum Edition", "name_original": "Space Miner: Platinum Edition", "description": "The Game of the Year award-winning action-RPG is back in a big way with this new MEGA UPDATE! With a brand new storyline, new enemies, new asteroids, and new gear, it&amp;#39;s the perfect time to experience this iOS classic for the first time!<br/><br/>- New bonus storyline that continues the adventures of Uncle Jeb and the Gritstone Mining Company!<br/>- A new map filled with 16 new sectors to mine! <br/>- New asteroids, tougher enemies, and brand new secrets to uncover!<br/>- Two new License Levels, with top-tier ship equipment to match!<br/>- A new ultra-powerful level 8 ship, designed by billionaire madman Bancroft!<br/><br/>Since its original release, SPACE MINER: SPACE ORE BUST has been hailed as one of the greatest iOS games of all time by critics and customers alike. Don&amp;#39;t believe us? Check out these reviews:<br/><br/>&amp;quot;Without a question, this is one of the best games I&amp;#39;ve played since the App Store went live&amp;quot; - Toucharcade.com (5/5 stars)<br/><br/>&amp;quot;HOW GOOD IS SPACE MINER. The answer is INCREDIBLE GOOD. It&amp;#39;s probably the best original game to hit the iPhone.&amp;quot; - Gizmodo<br/><br/>&amp;quot;Space Miner: Space Ore Bust gets my total complete recommendation. Long gamelife, great polished graphics and most importantly fun gameplay in space accompanied by banjos. Now I want a sequel.&amp;quot; - Touchgen.com (5/5 stars)<br/><br/>&amp;quot;Few games truly stand out like Space Miner does.&amp;quot; - Slide to Play (4/4 - Must Have)<br/><br/>App Store Rating: 4.5/5 (over 5,000 reviews!)<br/><br/>Onion AV Club: Grade A<br/><br/>No Dpad: &amp;quot;MUST HAVE&amp;quot;<br/><br/>App Spy: 5/5<br/><br/>_____________________________________<br/><br/>Still reading? Awesome! Here are some more good reasons to pick up SPACE MINER!<br/><br/>- Hours of space-blasting gameplay across a massive 64-sector, non-linear galaxy!<br/>- Fully upgradeable and customizable ships with literally thousands of possible equipment combinations!<br/>- Hilarious storyline featuring top-notch writing!<br/>- New Game+ mode lets you keep your game-changing ALIEN TECH and play on harder difficulty modes!<br/>- Full Game Center integration for Achievements and Leaderboards.<br/><br/>_____________________________________<br/><br/>Want to learn more about SPACE MINER or the Venan crew? Check us out!<br/><br/>http://www.venan.com<br/>Follow us on Twitter @VenanEnt <br/>Join us on Facebook: www.facebook.com/VenanEnt", "metacritic": null, "released": "2010-02-05", "tba": false, "updated": "2019-10-22T14:28:08", "background_image": "https://media.rawg.io/media/screenshots/280/280d804c39ee2237cdaf93286587c10f.jpeg", "website": "http://www.venan.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 208, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Venan Entertainment"], "genres": ["Adventure", "RPG"], "publishers": ["Venan Entertainment"], "esrb_rating": "Everyone 10+"}