{"id": 260341, "slug": "tank-battle-warfare-strategy", "name": "Tank Battle - Warfare Strategy", "name_original": "Tank Battle - Warfare Strategy", "description": "Get ready for a devastating tank battle against the army tanks in this world war duty game. Tank battle 3d is a tank attack war 3d game where you defend your pride against the enemy war tanks. The city surrounded by the mountains is in a state of war. Being an ex-military men who led an army in the world war against hundreds of enemy soldiers, tanks, gunship helicopters and gunner trucks. It’s time to show your skills in the battle field against army tanks. The last resort of the survival mission is you. Fight the defense battle &amp; lead the troops in your gunner army tank against the deadly enemy tank attacks. The opposition is equipped with dangerous and heavy gunner machinery. Get ready to fight the ultimate army tank war as you play the role of an army general in this world war battle field..<br/><br/><br/>Your duty in the world war starts when you navigate your tank around the destroyed city. Battle tanks as the enemy have taken over the control with their gunner tanks, panzer, helicopters and armed forces. Your last resort is the ability to fight back with the heavily armed army tanks with guided missiles, highly optimized enemy zoom, targeting and much more. You have also called for a backup air strike that will help as you move along. Complete all missions to gain the control of the city back and destroy the enemy for good. Go on a mission to clash against the enemy army gunning, bombing, killing and destroying their military vehicles. Inflict deadly strikes and attack the enemy as heavily as you can.<br/><br/><br/>***** GAME FEATURES *****<br/><br/>• Deadly &amp; Breathtaking Action<br/>• Mission Based Game play<br/>• World War like Environment<br/>• Gunner Attacks, Air Strikes, Bombing, Guided Missiles<br/>• 5 Highly Intense Game play Missions<br/>• Precise Aiming &amp; Highly Optimized Zoom", "metacritic": null, "released": "2015-05-02", "tba": false, "updated": "2019-10-22T13:59:13", "background_image": "https://media.rawg.io/media/screenshots/d2f/d2fb9a74946877faced55a9500b96dde_Hes752v.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 158, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["The Game Storm Studios"], "genres": ["Action", "Simulation"], "publishers": ["The Game Storm Studios"], "esrb_rating": null}