{"id": 26039, "slug": "3-2-1-rattle-battle", "name": "3-2-1, Rattle Battle!", "name_original": "3-2-1, Rattle Battle!", "description": "<p>\n      3-2-1, Rattle Battle! is a party game packed with exciting mini-games. \n      Intuitive controls mean that anyone can enjoy playing - just grab the \n      Wii Remote and shake it to “rattle”. Great fun for single players, but \n      the party really gets started when you register high scores on Nintendo \n      Wi-Fi Connection to see how you measure up against players from around \n      the globe!\n    </p><p>\n</p><p>\n      ■Mini-Games:\n    </p><p>\n      Rattle In Time: Use split-second timing to rattle at exactly the right \n      moment!\n    </p><p>\n      Rattle Reflex: Test your powers of concentration!\n    </p><p>\n      Rattle With Caution: Rattle to move forward when the bad guy's back is \n      turned!\n    </p><p>\n      Tight Rope Rattle: Rattle to move across the high wire while dodging the \n      arrows!\n    </p><p>\n      Rattle-a-Kiss: Gauge the correct rattle speed to give that shy guy a \n      push so he flies in for a smooch.\n    </p><p>\n      Rattle Blast: An intense duel where you need to get your rattling \n      strength just right!\n    </p><p>\n      *With a total of 12 mini-games, you and your friends are in for a \n      rattling good time!\n    </p><p>\n      As of May 20, 2014, the Nintendo Wi-Fi Connection service for Nintendo \n      DSi and Wii systems has been retired. Online features of this game are \n      no longer available after this date but this game still provides an \n      entertaining experience in offline mode.\n    </p><p>\n      To learn more about this service change, please visit To learn more \n      about this service change, please visit support.nintendo.com/servicesupdate.\n    </p>", "metacritic": null, "released": "2009-08-31", "tba": false, "updated": "2019-09-12T06:38:12", "background_image": "https://media.rawg.io/media/screenshots/98e/98ece7a56fbbeaa58d2c67340310d209.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 176, "game_series_count": 0, "reviews_count": 0, "platforms": ["Wii"], "developers": [], "genres": [], "publishers": ["Tecmo"], "esrb_rating": null}