{"id": 260371, "slug": "90-seconds-spy-cars-racing-game-a-free-extreme-esc", "name": "90 seconds: Spy Cars Racing Game -a Free Extreme Escape Adventure", "name_original": "90 seconds: Spy Cars Racing Game -a Free Extreme Escape Adventure", "description": "You have a 90 seconds. Hurry up go to exit and race against to the time.Because robots invaded the base. They want to destroy to the earth.You have to stop them.You are trapped in a dangerous maze full of destructive obstacles and deadly paths! Race through the hurdles! Escape the portcullis, jump through fiery paths! Fight your way through to survive! You will definitely get enough share of thrill and danger! Speedily dash through spiked gates and vicious obstacles for survival<br/>Find your way through the maze without getting killedOvercome the obstacles by racing spy cars against time and reach the exit as soon as possible. <br/>The world is in danger again. Dangerous robots seized a base in a hidden space base. You have to destroy there right on time. <br/>You have to reach the exit within 90 seconds in levels with tough obstacles. With its ease of playing and stage designs with plenty of action spy cars will save the world thanks to you. Both race and action are waiting for you. 5 cars are available for you to select. Drive whichever you like and collect golds. With its lifelike car checks you can choose out of two different checking options.<br/>After new updates, new cars and stages will be added to the game. <br/><br/> Drive various cars each with an unique behavoir. Discover lots of varied missions in a completely physical simulated world.Peer through the sharp ledges, fit through dangerous obstacles, climb up insane ramps, jump through the skies... There is no limit to what you can do in this staggeringly hard arcade style car game.<br/>Join the rush of an adrenaline rising in this amazing car racing game<br/>Features:<br/>-Arcade style levels and realistic physics control<br/>• high quality physical environment<br/>• physically calculated and detailed cars<br/>• lots of varied missions<br/>• customizable quality<br/>• detailed sound environment<br/>• Exciting musics and obstacles<br/>-Nitrous boosts to pick up the speed!<br/>-Addicting gameplay!", "metacritic": null, "released": "2015-07-24", "tba": false, "updated": "2019-10-22T13:59:21", "background_image": "https://media.rawg.io/media/screenshots/227/2270ccdd1d00693480bfd190a495df48.jpg", "website": "http://goodbyealiensgame.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 163, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Serkan Bakar"], "genres": ["Action", "Racing"], "publishers": ["Serkan Bakar"], "esrb_rating": null}