{"id": 260354, "slug": "blocktrix", "name": "BlockTrix", "name_original": "BlockTrix", "description": "Breaking Blocks is an addictive and fun game that you can enjoy any time when you are bored. <br/><br/>Your mision is to eliminate blocks of same color or shape that are grouped by 2 or more. To pass level there must be less tan 10 blocks on the screen. Look well the strategy to follow in order to achieve the following levels and so complete new worlds. <br/><br/>Use special blocks to help you destroy all blocks. <br/><br/>In total there are up to 120 levels and 6 worlds which bring you new scenarios and where you will have to achieve a goal, by getting the highest number of possible stars. <br/><br/>It is optimized for best display of new iPad and iPhone´s retina screen with excellent high-resolution graphics and full screen interface. <br/><br/>Blocks is available in several languages including: English, Spanish, French, German, Italian and Portuguese. It also has a sophisticated and intuitive interface. <br/><br/>Features: <br/><br/>- No time limit <br/><br/>- Playable on all devices <br/><br/>- Enabled Game-Center with worlwide leaderboards and 6 achievements to unlock <br/><br/>- Background music and sound effects <br/><br/>- Auto-save when application is closed or when you answer a telephone call while you are playing, in order to continue playing it from where you were, after finishing the call <br/><br/>We hope you enjoy it and remember, blocks is an easy game to play but difficult to master.", "metacritic": null, "released": "2015-04-18", "tba": false, "updated": "2019-10-22T13:59:15", "background_image": "https://media.rawg.io/media/screenshots/457/457e56b1df7ecd488f6a1d78e1a9f114.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 83, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["juan carlos lopez diaz"], "genres": ["Board Games", "Puzzle"], "publishers": ["juan carlos lopez diaz"], "esrb_rating": "Everyone 10+"}