{"id": 260581, "slug": "cry-cryptids-plea", "name": "Cry - Cryptid's Plea", "name_original": "Cry - Cryptid's Plea", "description": "Brand-New Kinetic Novel!\r\n\n<p>(Content Warning! Sex, Drugs, Death)<br/></p>\n<p>CRY: Hunter’s Record is the first in a four-part series of kinetic novels. The CRY series focuses on the tale of a Witch and a Hunter, two women who contend with the fears and struggles of trying to survive in a world where the system is stacked against people like them. CRY: Hunter’s Record is the opening chapter of this drama; a Witch with hopes of a better world for Cryptids teams up with a Hunter with nothing left to lose, and together the two work to save as many mythical creatures as they can. Sometimes they’re successful in helping these beasties and supernatural critters adapt to modern society, and sometimes the violence inherent in the system is too much to overcome.</p>\n<p>Featuring lurid visuals and brilliant character art, the CRY series uses a mixture of text, pictures, and sound design to bring the drama to life.</p>\r\nA Queer Lens on the Roadtrip Genre\r\n<p>The Witch and the Hunter travel a mixture of dark urban and country landscapes. In this world, Roads are merely interstitial places, tying together cities and the vast wildernesses in-between. This stitching has a habit of regularly coming undone, and shadowy things bleed out into the countryside. Some things are benign, while others carry malice; the Witch and the Hunter use their knowledge of magic, alchemy, and monster-tracking to solve these problems before they can poison the waking world — the world you and I are used to. <br/></p>\n<p>Through this exploration of serious (yet, often humorous) themes, CRY: Hunter’s Record digs deep into its queer roots. The story is an examination of the everyday struggles of those who have been othered through the sheer fact of their existence, and what adapting to the “normal” world actually entails.</p>\r\nDeep Monster Lore Inspired by Actual Cryptids\r\n<p>Drawing on rich histories of tall-tales, monster sightings, and urban legends, CRY: Hunter’s Record blends all three together to create a monstrous tapestry across North America. From lumberjack folklore to well-known ghost stories, Mothman to Bigfoot, the cryptids at play are sometimes scary, sometimes cute, and sometimes very, very deadly. Familiar myths of Snipe hunts, boggy swamp monsters, and spectres of unrequited lovers are bursting at the seams of the cry series, threatening to spill over in to our own.<br/></p>\r\nA Lesbian Romance Submerged in American Gothic\r\n<p>Foremost in CRY: Hunter’s Record is the story of the Witch and the Hunter’s relationships, both to the world around them as well as to each other. Struggling with the thorns of past trauma, the two women are confronted time and again by the pieces of their adolescence they were forced to cut off in order to survive. Together, they learn to rely on each other, and begin the arduous process of healing. However, some scars run deep, and opening up to one another is perhaps the most difficult challenge facing our heroines.</p>\n<p>Set against the backdrop of a country steeped in a history of violence and erasure, the blossoming romance between these two women is choked by the harsh reality of that hostile climate. North America’s fears, prejudices, and virulence gain concrete form in the blood-soaked, shadowy landscape that stretches out from the endlessly winding roads. Together, the two will forge a path forward, always hopeful of a coming dawn.</p>", "metacritic": null, "released": "2018-11-01", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/b00/b0002efde7bd076b29a941274b46df0f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 111, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Android", "macOS"], "developers": ["Lesbian Cryptid Roadtrip"], "genres": [], "publishers": [], "esrb_rating": null}