{"id": 26064, "slug": "you-me-the-cubes", "name": "You, Me & the Cubes", "name_original": "You, Me & the Cubes", "description": "<p>\n      Experience a unique combination of strategy and skill as you focus on \n      maintaining a level playing field in the physics-based action puzzler \n      You, Me, and the Cubes. The action centers around Fallos, mysterious \n      creatures that resemble humans in some ways, and their ability to \n      balance on a playing field of 3-D cubes.<br/>Your role begins with \n      creating a pair of Fallos inside your Wii Remote controller by shaking \n      it up and down. Next, you’re responsible for determining suitable \n      destinations for them to land and then flinging the Fallos from your Wii \n      Remote to the selected cube with a swinging motion. After that, the \n      Fallos are on their own. If your placement is sound, the Fallos will \n      remain stable and you’ll clear the stage after tossing a required number \n      onto the cubes. But if the weight or locations of Fallos causes the \n      cubes to tilt and sway too much, the Fallos will lose their balance and \n      fall off. Adding to the challenge, you’ll find that some cubes have \n      different properties, making tosses tricky and further threatening the \n      stability of the Fallos.Guide Fallos through dozens of single-player \n      stages or invite family and friends to join you in two-player \n      cooperative mode. Simply shake, point, and fling!\n    </p>", "metacritic": null, "released": "2009-09-21", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/e9a/e9a34dee6002cdbe2493261289fa7b51.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 164, "game_series_count": 0, "reviews_count": 0, "platforms": ["Wii"], "developers": [], "genres": [], "publishers": ["Nintendo"], "esrb_rating": null}