{"id": 260794, "slug": "relapse-blueprint-games", "name": "RELAPSE (Blueprint Games)", "name_original": "RELAPSE (Blueprint Games)", "description": "<p><strong>This is a cancelled project and will not receive updates</strong><strong>! Please read the below FAQ for more details!</strong></p>\r\nWelcome to Arcadia\r\n\r\n<p>Welcome to Arcadia Asylum! A psychological thriller and puzzle game. Relapse into madness and download the prequel today, we've kept the best content inside.</p>\n<p>Relapse is a genre mash up of two beloved gaming genres, horror and puzzle adventure games! Using research on the psychology of fear to play with your emotions.</p>\n<p>Inspired by games like Amnesia and Grim Fandango. Solve puzzles to escape the now abandoned asylum and fight for your life against Dirk, your somewhat persistent stalker. Will you make it out or become another victim?</p>\r\nFeatures\r\n<ul><li>A first person horror adventure game</li><li>Immersive experience, stunning graphics and realistic ambient soundtrack</li><li>Puzzle solving with a choice of modes for players who don't want the puzzles to be too taxing</li><li>Thoroughly researched to make the game as realistic as possible</li><li>A full back story to explore, learn what life was like in a UK Victorian Insane Asylum</li></ul>\n\r\nStory\r\n<p>You visit the asylum as an urban blogger when you are captured by Dirk- a psychopath who locks you inside and wants to play hide and seek. As he intends to carve you up with a machete if he finds you, you need to find a way to escape. Dirk knows the asylum like the back of his hand and can hear you – so you need to be on the top of your game if you're going to survive.</p>\n\r\nThe History\r\n<p>The asylum and grounds are like a small city, with everything it needed to house over a thousand patients. It finally closed down in 1987, with all patients being released into Care In the Community. Not all patients coped with the new freedoms and some stopped taking medication necessary to keep them calm.</p>\n<p>The game has all the immersion and shocks of a horror game along with the puzzles of an old school adventure game which you need to solve to escape.</p>\r\nGet in Contact!\r\n<p>Facebook ► https://www.facebook.com/BlueprintGames<br/>Twitter ►https://twitter.com/blueprint_games<br/>Email ►enquiries@relapse-game.com<br/>Instagram ►https://www.instagram.com/blueprintga...</p>\r\nFAQ\r\n<p><strong>Why was the project cancelled?</strong><br/></p>\n<p>The project was cancelled in 2016/17 After participating in a game jam we found more success and public reception from our adorable new 3D platforming game Billie Bust Up! No we're not joking, we really went from realistic horror to a cute animal mascot 3D Platforming game. We originally put the project on hold but as Billie Bust Up grew we no longer had time to continue working on this game (we're a very small team of recent graduates and this was our first big game)</p>\n<p><strong>Why upload the game now?</strong></p>\n<p>We spent a lot of our time and money on the game and despite cancelling the project we still love our creation. The entire game was produced by only 2 people, each asset was handmade  by our team. It seemed a shame to leave it stored on a digital shelf to gather dust so this seemed like the best option! We've also had multiple requests from old fans who never had a chance to play the game until now. </p>\n<p><strong>How long is the game?</strong></p>\n<p>The prequel has a defined start and end and was intended to serve as a prequel rather than a full game, it has around 30mins to 1 hour of content depending on the puzzle difficulty mode you chose and your past experience with adventure games. Those who choose \"Anxiety\" mode will have a shorter playtime as most puzzles have been removed. </p>\n<p><strong>What are the minimum requirements?</strong></p>\n<p>Here is the hardware we used to produce and run the game:</p>\n<p>NVIDIA Geforce GTX 760 2GB </p>\n<p>16GB Memory</p>\n<p>Intel i7-4770K 3.50 GHz </p>\n<p>We tried to build the game to be optimised as we could with the time frame we had for development (we were given 10 weeks to produce this demo for EGX), however we did not have time to run extensive testing on multiple hardware so the game could experience frame rate drops for older hardware.  <br/></p>\n<p><strong>I'm stuck on a puzzle?</strong><br/></p>\n<p>We have a handy walk through for you here! </p>\n<p><strong>Why is the game no longer receiving updates?</strong><br/></p>\n<p>The game was shelved in 2016 we have the old packaged files but the actual engine build is now gone so we can no longer work on it</p>\n<p><strong>Mac/Linux Build?</strong></p>\n<p>Due to not having a copy of the game in engine we can no longer compile new versions of the game</p>\n<p><strong>Any Cut Content?</strong></p>\n<p>Some areas of the game were cut due to bugs before EGX, although these areas are not functional they are still in game, feel free to explore by accessing the console</p>\n<p>press ` to open the console and type in \"ghost\" to explore out of bounds! We recommend you play the game through once first</p>\n<p>Have any further questions? Please email us! enquiries@relapse-game.com</p>", "metacritic": null, "released": "2018-10-31", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/8ae/8ae3d2a64b6158033a6b856b8c85fb7f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 248, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Blueprint Games"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}