{"id": 260742, "slug": "vagrant-fury-itch", "name": "Vagrant Fury (itch)", "name_original": "Vagrant Fury (itch)", "description": "<p>Vagrant Fury is a casual arcade shooter inspired by the 80's and 90's, with a powered up soundtrack and a pixel/voxel visual style. It's like a weekend afternoon action movie: full of explosions and psycho villains, but laid back at the same time. Try to spot all the movie references!</p>\n<p><strong>NOTE:</strong> <strong>A free demo is available right now (containing the opening cutscenes and the entire first level of the game); the full version will be available for sale in the beginning of November.</strong> <br/></p>\r\nGIVE IT A SHOT (LITERALLY)\r\n<p>Check out our free demo; if you like the game, please consider buying the full version. Cheers!</p>\n\r\nFIREPOWER\r\n<p>Blowing stuff up doesn't have to blow: you'll have brand new weapons for each mission, and they'll reflect the character of the level you're playing. Try aiming for double, triple and penta-kills!</p>\r\nSPECIAL ABILITIES\r\n<p>When the going gets tough, the tough get powerups! Shoot enough baddies, and activate one of two special abilities: super offensive or mega defensive.</p>\r\nEVIL DUDES\r\n<p>Bosses with big guns and big mouths — just what every action hero needs! But beware: when they get cranky, they'll unleash their special attacks on you. Also featuring different enemy classes: Fighter, Tanker, Shooter, Grenadier, Bazooker.<br/></p>\r\n\r\nENJOY THE VIEW\r\n<p>Colorful level designs and cutscenes will take you through the City's neighbourhoods: from low-class to high-rise, there's violence and corruption everywhere, and you'll blast through it all.<br/></p>\r\nGET READY TO VOXEL\r\n<p>Harnessing the power of computers salvaged from our local dumpster, we're able to offer you the most advanced voxel graphics on the market in 1990. VoxelPower™ — Because Pixel is Dead!</p>\n\r\nBE A HERO... A DARK HERO\r\n<p>A secret past! A plot full of twists and surprises! A hero's path, tragic but inspiring! Clichés you can trust! — (Action and Sci-fi Tropes Certified)</p>\n\r\nSYNTH FURY\r\n<p>Remember when music was good? Yeah, us too — that's why we have an awesome synthwave soundtrack! So you can be shootin' while groovin'!<br/></p>", "metacritic": null, "released": "2018-10-31", "tba": false, "updated": "2019-08-28T23:19:45", "background_image": "https://media.rawg.io/media/screenshots/ae9/ae9c308341422691823e9cb64cfccba7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 461, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["VectorGoat Games"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}