{"id": 260759, "slug": "i-spy-baby-dragons", "name": "I Spy Baby Dragons", "name_original": "I Spy Baby Dragons", "description": "I Spy Baby Dragons\r\n<p>This is a Point-and-Click Adventure. Best with Full-Screen!</p>\n<p>Find Clickable Areas which may be Items for you to pick up, or may take you to Another Place, or block a Sword Attack (or Broom Attack, as the Case may be). Many Places can have Unexpected Clickable Areas, so keep your Eyes open!<br/><br/>Your Aim is to gather all the Items, and then you will be able to get <strong>The Baby Dragon</strong>!</p><p>In many Places you can click the Bottom Edge or the Side Edge to leave the Place where you are (for example, to cut short a Car Journey, run from a Ghoul, leave a Lot of Letters lying, and so on).</p>\n<p>If you recognize Something from Another Place then it may take you back to that Place. If you want to go back to the \"How?\" Place by the Tea just crawl around in the Bottom of your Hat. If you close the Adventure it will keep your Place for you.</p><p>You can usually see the Brim of your Hat, which will take you to your Hat. If you turn your Hat over and go Inside you will see all the Items you have gathered so far (and not lost). The Little Feet will take you back out.</p><p>If you find the Game of Cards, accomplishing it is not necessary for your Main Goal. It unlocks a More Difficult Goal in the Adventure: to find Secret Passages; which has Another Reward.</p><p>If you find the Letters, you can type in the Words that you can make with them (Words of Three Letters or more) and press Enter. You do not need to find All Possible Words, only Two are necessary to the Main Goal.</p><p>If you find a Certain Item there will be Hints available in Certain Areas of the Adventure, which will be very helpful. If, however, you do not feel quite equal to this Adventure you may lay hold of the Hints in the \"How?\" Place for an Easy Mode.</p>\n<p>(Note to Parents: this Adventure is SFW but might be too scary for Very Little Chillins, and there is an Old Painting, though difficult to find, which has a Dead Person with Blood on his Head.)</p>\n<p>Leave a Comment if you find a Bug, or if you get stuck!</p>\n<p>I hope you really find this Adventure intriguing! You can support the creator on Patreon!</p>\n<p>God be with you!</p>\n<p>Your Servant,</p>\n<p>Patrick Lauser</p>", "metacritic": null, "released": "2018-10-31", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/517/517678567b7f8713de96a33ca8914bbf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 202, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Kneeling"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}