{"id": 260823, "slug": "mmx-offroad-car-driving-simulator", "name": "MMX Offroad Car Driving Simulator", "name_original": "MMX Offroad Car Driving Simulator", "description": "<p>MMX Offroad Car Driving Simulator game is a challenging ride on impossible offroad tracks. In this car simulation game you will enjoy monster car racing with hill climb runner challenge. Feel the thrills of MMX hill climb on the curvy and steep impossible tracks. There are different car driving and bike racing simulation games that you’ve played before but this is very different offroad car drive. Speed your car up with multiple hazards, hill climbs and car stunts. MMX dash is based on real physics with its best mechanics with fully loaded monster truck strategies.</p>\n<p>MMX Offroad Car Driving Simulator Game Features:<br/>* Many offroad racing tracks for this MMX hill climb mania<br/>* Climb to the top with monster cars and become a master driver<br/>* Efficient controls make your hill dash racing smooth<br/>* Realistic 3D game-play with easy interface </p>\n<p>In this hill dash game there are different monster trucks and roughest terrain tracks for driving simulation skills test. Become an off-road driver of dash racing tracks like a hill climb runner. In this MMX game a variety of monster trucks and cars are waiting for real driver for offroad race. This hill dash game is one of the toughest racing game in all offroad hill climb games.There are number of racing tracks for you to enjoy this hill dash mania driving simulator.</p>\n<p>There are different 3D environment with realistic graphics for offroad driving. Choose your best brand new model of MMX car from the selection panel. The job you’re going to do is not very easy its very tough for this MMX hill game. Its effective controls help you to play offroad racing in this car game. Avoid crashes and accidents and move fast towards finish line during hill dash racing challenge.</p>\n<p>Download MMX Offroad Car Driving Simulator game now and enjoy a unique driving experience with monster cars and trucks.</p>", "metacritic": null, "released": "2018-10-31", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/bb9/bb9c89f22c263420d68111dc11f6ee03.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 251, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Apex Logics"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}