{"id": 260891, "slug": "a-klance-texting-game", "name": "A Klance Texting Game", "name_original": "A Klance Texting Game", "description": "<p><em>Will Lance score a date with Keith? Will he get a confession? A rejection? Or just a sweet goodnight message? It's up to you! 20 different endings await you!</em></p>\r\nAttention!\r\n<p><strong>Before playing: </strong></p>\n<p><strong>1. This game is designed to be played on phones, but you can also play it in the browser. I tested it on Android phones with different browsers but obviously I couldn't test it on all devices. UPDATE: As it seems the game has some issues on ios devices! I'm sorry, but I don't know how to fix that! :c</strong></p>\n<p><strong>2. Make sure your browser allows cookies from third parties! </strong></p>\n<p><strong>3. The game may need a few seconds to start up in the beginning! </strong></p>\n<p><strong>How to play:</strong></p>\n<p><strong>You advance the story by clicking the \"Tap!\" button! At some points in the game you get to decide your answers, but THINK before you choose because you can't  undo your messages! Just like in real life! ;D Try to get all 20 Endings!</strong><br/></p>\n<p><strong>You can find a list with all the ending names here!</strong></p>\r\nPLEASE tell me what you think! Leave a comment down below or  BETTER send me a message on Tumblr!\r\n_____\r\nAbout the Game\r\n<p>Hello everyone! I proudly present you the \"Klance Texting Game\"! Yeah, I was too lazy to come up with a good title, and this describes it best so LMAO </p>\n<p>What started as an idea to make a \"Choose your own adventure\"story somehow turned into this monster of a project that took me over a year to finish! Actually I wanted to make an even bigger story, but decided to make a small one for now :) </p>\n<p>I was obsessed with a game called \"Mystic Messenger\" at the time and thought: Hey wouldn't it be neat to make a game like this for Klance? Since I had NO experience with programming whatsoever I thought it'd stay a dream, but somehow I couldn't let go of it and worked on this project from time to time. Honestly, I never thought this would be possible and I'm really proud of what I made! Obviously, it's not perfect but WHO CARES, I MADE IT.</p>\n<p><strong>Anyway since I put SO much work into it PLEASE let me know what you think! Leave a comment down below or even better send me a message on </strong><strong>Tumblr!</strong></p>\n<p><strong>If you guys like it, I might consider making more games like this! Maybe even with fic endings and art! So if you want to support me, you could also buy me a Ko-fi! :)</strong></p>\n<p><strong>THANK YOU and have fun playing the game! :D</strong></p>\n\n<p><em><strong>Credits:</strong><br/>Game made with Twine<br/>Chat Bubbles: https://codepen.io/jdniki/pen/isomC<br/>Link Buttons: https://codepen.io/Aberdeener/pen/FoeIj<br/>Sounds: https://www.zedge.net/ringtone/2ebdd873-ac79-31bc-960a-b5c94904845b, https://www.zedge.net/ringtone/e8bd3dc3-7d59-3c9c-b0d6-d900ce3ef9d8<br/>Pick-up Line: Inspired by Tumblr user nikneedsalife ;D</em></p>", "metacritic": null, "released": "2018-10-30", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/738/738e4b80c18e6d83ce8ec69590129027.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 8, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Queerklancing"], "genres": [], "publishers": [], "esrb_rating": null}