{"id": 260939, "slug": "rat-witch-tactics-demo", "name": "Rat Witch Tactics Demo", "name_original": "Rat Witch Tactics Demo", "description": "<p>Rat Witch Tactics is a turn-based tactics RPG that follows the adventures of magical rats and their friends.</p>\n<p><em>Flood, famine, war; rats endure all.</em></p>\n<p><em>When the conquest of the City faltered, a splinter group of witches founded a new society for those who wished to remain free from the Sorceress Supreme. The walls of the Southern District a shield against Her power.</em></p>\n<p><em>\tA new way of life was forged for rats and muskrats alike. One not driven by the Cult of the Supreme or the war against the Woodlanders. In this tentative peace, an unexpected challenge emerged: an Unnatural Rat was born in the district.</em></p>\n<p><em>\tShould she stray beyond walls, she would fall to the Supreme. Their only choice was to raise her as their own. A new kind of witch. One who will face new kinds of trials.</em></p>\n\n<p>Rat Witch Tactics provides a glimpse into the past of the Free Witches of District South and begins the story of their apprentice. Each story chapter beyond the tutorial features procedurally generated maps.</p>\n\n<p><strong>Features</strong></p>\n<ul><li>Four magical rats and an avuncular muskrat.</li><li>Stories from the past and present of a mostly realized world rich with history.</li><li>Procedurally generate maps that make each play through unique.</li><li>A wide variety of magical powers and special abilities.</li><li>Skirmish mode for a quick battle fix.</li></ul>\n\n<p><strong>Demo</strong></p>\n<p>Rat Witch Tactics is still in development. This should be considered a beta demo as things will change. The demo features a tutorial level, a full story chapter, and a rudimentary skirmish mode.</p>\n\n<p><strong>Future</strong></p>\n<p>The full version of the game will offer:</p>\n<ul><li>Additional story chapters</li><li>More robust skirmish options</li><li>2-player local co-op skirmish</li><li>Even more abilities</li><li>Revised art</li><li>Sound and music</li></ul>\n\n<p><strong>Controls</strong></p>\n<p>Keyboard</p>\n<ul><li>Move Cursor - WASD/Arrow Keys</li><li>Confirm - Space/Return</li><li>Cancel - Left Shift/Right Shift</li><li>Pause - Escape</li></ul>\n<p>Gamepad<br/></p>\n<p>Currently only have a Dual Shock 4 to use for testing. Not sure if this layout translates well to other gamepads. Need to find additional controllers for testing.</p>\n<ul><li>Move Cursor -Left Analog Stick/Directional Pad </li><li>Confirm -Joystick Button 1 (X on DS4) </li><li>Cancel -Joystick Button 2 (O on DS4) </li><li>Pause -Joystick Button 3 (Triangle on DS4) </li></ul>\n\n<p><strong>System Requirements</strong></p>\n<p>OSX</p>\n<ul><li>Runs well at medium or lower settings for Macs with integrated graphics cards.</li><li>If you see a warning that the game can't be opened, you'll need to right click -&gt; open (or ctrl+click) on the icon, then choose open.</li></ul>\n<p>Windows</p>\n<ul><li>Currently only have a very low end windows machine to test with. Runs okay on a Dell Inspiron 11.6 at lowest graphics setting, but needs more testing on better hardware.</li><li>If you see a warning that the game can't be opened, click More Info, then there should be an option to open it.</li></ul>\n<p>Linux</p>\n<ul><li>Coming soon, need to get a machine setup to test with.</li></ul>\n\n<p><strong>Special Thanks</strong></p>\n<p>Rat Witch Tacitcs was made possible by the amazing work of Jon Parham at The Liquid Fire. The foundation of the game was entirely built from tutorials found here: http://theliquidfire.com</p>\n<p>Thanks to Jasper Flick and Catlike Coding for additional tutorials that helped guide the way: https://catlikecoding.com</p>\n<p>And thanks to my wonderful spouse, friends, and family for their support.</p>", "metacritic": null, "released": "2018-10-30", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/caf/cafdc613180cd114ad74885a86706f12.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 113, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["En Moiety"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}