{"id": 261078, "slug": "the-deman-within", "name": "The DeMan Within", "name_original": "The DeMan Within", "description": "<p>This game was created during the 2018 Chillennium Game Jam at Texas A&amp;M University! It was made in 48 hours, and the theme of the competition was \"Transform\". <br/><br/>The objective of the game is to last as long as you can. It's an endless runner in which you can switch between a human form or a demon form. Collect icebergs (the Chillennium logo) for a 5 point increase to your score, and watch out for a rare sighting of Texas A&amp;M's official mascot - Reveille! Both the background, music, and obstacles change depending on which form you are in, with occasional leaks between worlds to try and force you to switch!<br/></p>\n<p><strong>Controls:</strong></p>\n<ul><li>Press 'Space' to Jump</li><li>Press 'C' to Change/Transform</li><li>Press 'Esc' to Pause</li><li>Press 'B' and hold to slide (<strong>Human Form</strong>)</li></ul>\n<p><strong>Human Form:</strong><br/></p>\n<ul><li>Can dash underneath obstacles</li><li>When left of the center of the screen, every jump moves the player more towards the center</li></ul>\n<p><strong>Demon Form:</strong><br/></p>\n<ul><li>Can jump much higher than human form</li></ul>\n\n<p><strong>CREDITS:</strong><br/></p>\n<ul><li>Lead Programmer - Dylan Theriot</li><li>Head Graphic Designer - Karina Muffoletto</li><li>Project Manager - Nathan Armstrong</li><li>Head Sound Designer - Mark Treviño</li></ul>\n<p>---------------------------------------------------------------------------------------------------</p>\n<p><strong>Personal Contribution and Experience:</strong><br/></p>\n<p>Howdy! Before this Game Jam, I had zero experience with C# or Unity. However, those were the two things we had decided to use for our game, and wow was it fun to learn in such a short time period! I do have a little bit of experience with Roblox's IDE, which is similar to Unity's, and a lot of the rudiments of the game development process were learned from online tutorials. Although I programmed a majority of the game, I was also project leader. I allocated roles to each of our members, did regular status checks, and helped ensure consistency among the work. Also, it was amazing being able to walk around the competition area and learn how others were going about creating their game. Discussions over game development, design, artwork, programming, sound, and more filled the air throughout the two days. To me, the experience felt like learning a foreign language and going to live in a country that predominantly speaks that language - I learned so much about C# and Unity within those two days. Because this was our first game, bugs (or 'secret features' as we like to call them) do exist. But I am extremely proud of my team for managing to make this amazing game! And a hint for anyone who has read this far - if you get stuck behind an obstacle, jump really high in the Demon form and while you're in the air switch to Human :) !<br/><br/></p>\n<p><strong>Updates</strong><br/></p>\n<p>Some differences do exist between the game submitted for Chillennium and the one uploaded here. After the event, Mark and I went back to fix some of the more glaring bugs and to make some quality of life changes.</p>\n<ul><li>Music properly switches</li><li>Pause button works</li><li>Icebergs interpolate across the screen to look more smooth</li><li>Cooldown between switching forms reduced to 0.5 seconds (from 3)</li><li>Fixed title screen animation</li></ul>", "metacritic": null, "released": "2018-10-29", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/1db/1dba22d7ecae26340d8456af2a0031b8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 85, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["DTheriot"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}