{"id": 261124, "slug": "wave-37", "name": "Wave 37", "name_original": "Wave 37", "description": "<p>This was made in javascript , only using jquery. The main purpose of this game,is to show off the particle system, that combines physics with randomness, to create awesome effects.</p>\n\n<p>Short tutorial:</p>\n<ul><li>when you have you trail red, it means your special ability is ready:  <br/>\r\npress \"E\" to heal or \"Q\" to deal damage to all enemies on the screen... Each time you use this ability, the load time is doubled!</li><li>press space to accelerate</li><li>rotate with \"A\" and \"D\"</li><li>press \"S\" to shoot</li></ul>\n<p>Guide to enemies:</p>\n<ol><li>blue enemies: medium movement speed, can only deal damage by hiting the ship, can be destroyed by hiting it once</li><li>red enemy: fast movement speed, can go trough walls, and exit the map, can deal damage only by hiting the ship</li><li>green enemies: medium movement speed, can shoot, at a medium rate, a bullet has an attack of 25</li><li>brown enemies: very slow movement speed, can shoot at a slow rate, a bullet has an attack of 25, can go trough walls and exit the map,100 hp(destroyed by 4 bullets)</li><li>white enemies: slow movement speed, can heal other enemies, 50 hp(destroyed by 2 bullets)</li><li>multi-color enemies: medium movement speed, can shoot at a fast rate, each bullet has an  attack of 5, 75hp(destroyed by 3 bullets)</li></ol>\n<p>Other important things:</p>\n<ul><li>the background shows the hp: vlack means max, and white means min.</li><li>the next wave would start when you destroy all the enemies, or when the time runs out</li><li>the red arc from the background represents the timer</li><li>this game is computation heavy, so you may need a decent computer</li><li>this <strong>shouldn't </strong>be played on mobile</li></ul>\n<p>I managed to finish this in 1 and a half days, because the last week i was busy with high school (its awful to have 6 tests a week)</p>\n\n<p>Tell me what you think in the comments!!! Any positive criticism is appreciated!!!</p>\n\n<p><strong><em>Many thanks to:</em></strong><br/></p>\n<ul><li>Teodora Matei(my sister) for play-testing my game<strong>!</strong></li><li>Calin Avram - for making the awesome music and art!</li></ul>", "metacritic": null, "released": "2018-10-29", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/cc1/cc17eb703ce42a813165b9266e375fb8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 70, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Adrielus"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}