{"id": 261173, "slug": "luna-itch-funomena", "name": "Luna (itch) (Funomena)", "name_original": "Luna (itch) (Funomena)", "description": "Funomena's award-winning Luna is now on itch.io\r\n\r\n\r\nOverview\r\n<p>A Bird's peaceful summer slumber is disturbed by the majestic call of a mysterious Owl. Enticed to swallow the last piece of the waning Moon, Bird is blown far from its Golden Gate home.</p>\n<p>Re-awaken shadowy forests and bring life back to sparkling lakes. Discover hidden creatures, help Bird reunite the fragmented Moon... and find its way home. </p>\n<ul><li><strong>Solve celestial puzzles</strong> to unlock each level's tree, plants and animal spirits.\r\n</li><li><strong>Place, customize and interact</strong> with them in miniature, musical terrariums. </li><li><strong>Bring each world to life</strong>, revealing Austin Wintory’s haunting, enchanting score.</li></ul>\n<p>Brought to you by Funomena’s uniquely diverse team of veteran developers (<em>Journey, Flower, Boom Blox, The Sims 2</em>), Luna is an interactive fable about learning by the light of unexpected mistakes.<br/></p>\n<p>Luna started off in partnership with Intel and their RealSense Camera technology, but as the project evolved, and hand-tracked VR controllers began to emerge, we partnered with Oculus to bring the game to the Touch. The non-VR PC version was released shortly after the original launch date.</p>\n<p>You can find out more about how the idea for Luna came to be through these tweets by Robin Hunicke. Luna is a very personal game for Robin, and we hope it'll touch you like it has already touched others across the world.\r\n<br/></p>\r\n\r\n\r\nReviews\r\n<p><em>“Without so much as a single word, Luna traps us within its narrative fantasy, quickly switching its focus to puzzles so we discover the truth in metered, literary chunks.”</em>\r\nGameranx</p>\n<p><em>“This process is truly special and unique because the more time you take with it, the more beautiful and rewarding the world will look...”</em>\r\n8.6 – The Nerd Mag<br/></p>\n\n<p>Download <strong>Austin Wintory's haunting score</strong> to Luna right here.<br/></p>\r\n\r\nRecommended<strong> Specs<br/></strong>\n<ul><li>Windows 10\r\n</li><li>Intel Core i5 4590\r\n</li><li>8 GB RAM\r\n</li><li>NVidia GTX 960/965M/1050 (or greater) DX12-capable discrete GPU or AMD RX 460 (or greater) DX12-capable discrete GPU</li><li>Luna is best played with a mouse with a scroll wheel.</li></ul>\n<p><em>This itch.io listing only includes the non-VR PC version of Luna.  The VR version is currently unavailable on itch.io.</em><br/></p>", "metacritic": null, "released": "2018-10-26", "tba": false, "updated": "2023-08-12T06:44:42", "background_image": "https://media.rawg.io/media/screenshots/a28/a283623bc34856467d2e4239ff7a855a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 1, "beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 178, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Funomena"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}