{"id": 26114, "slug": "alien-monster-bowling-league", "name": "Alien Monster Bowling League", "name_original": "Alien Monster Bowling League", "description": "<p>\n      You might be the best bowler in the world, but are you the best bowler \n      in the Galaxy? Compete against humans, aliens and monsters in this \n      interstellar twist on league bowling. It takes more than a good hook \n      shot to compete in the Alien Monster Bowling League. Power moves, \n      special balls and Whammies bring a whole new dimension to the lanes for \n      a bowling experience that is out of this world!\n    </p><p>\n      Features\n    </p><p>\n      • Fearsome Competitors: Take to the lanes against various \n      aliens and legendary monsters like werewolves, vampires, zombies and \n      more! Each of your fearsome foes has a unique special bowling ability, \n      so get ready for some big surprises!<br/>• Galactic Bowling: You’ve \n      never seen bowling like this. Unleash special throws with the Sonic \n      Ball, Split Ball, Ghost Ball, Nitrous Ball and Clone Ball. Disrupt your \n      opponents turn with Whammies that twist the lane, cause earthquakes, \n      fire lasers and create other cosmic conundrums!<br/>• Multiple Modes \n      of Mayhem: Face off against progressively stranger league bowlers in \n      Campaign Mode or jump right into Quick Play Mode. Challenge a friend in \n      head-to-head multiplayer and take on a test of pure bowling skill \n      without power-ups or Whammies in Regular Mode.<br/>• Stellar Controls: \n      Aim for the high score with intuitive controls that require only the Wii \n      Remote.\n    </p>", "metacritic": null, "released": "2009-10-20", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/fd3/fd34656c61327554a0b6e1ff5963fb5e.jpg", "website": "http://destineergames.com/games/wii/ambl/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 396, "game_series_count": 0, "reviews_count": 0, "platforms": ["Wii"], "developers": ["Perpetual FX"], "genres": [], "publishers": ["Destineer"], "esrb_rating": null}