{"id": 261247, "slug": "fateextella-link", "name": "Fate/Extella Link", "name_original": "Fate/Extella Link", "description": "<p>Picking up where the story ended in Fate/EXTELLA: The Umbral Star, Fate/EXTELLA LINK expands the roster of playable Servants with 10 legendary heroes added to the original selection of 16. These newly added Servants hail from other entries in the Fateseries and include the likes of Astolfo, Scàthach, and Francis Drake. The high-speed action gameplay of Fate/EXTELLA: The Umbral Star returns with improved visuals and new battle mechanics in both single-player and an added multiplayer mode supporting 4-on-4 online battles on PlayStation®4 system. Players will also be able to move freely around their new base camp—a medieval cathedral suspended in the sky—and interact with Servants to build bonds with them.</p>\n<p>•Combatants from Across the Fate Universes Join the Fray<br />\nIn addition to the 16 original Servants from Fate/EXTELLA: The Umbral Star, characters from other Fate series will enter battle as playable Servants, including Astolfo from Fate/Apocrypha, Scáthach from Fate/Grand Order, and the return of Francis Drake from Fate/Extra.</p>\n<p>•A Thrilling Continuation of the Fate/EXTELLA Legend<br />\nThe original creator of Fate/stay night and the scenario writer of Fate/EXTRA, Kinoko Nasu, returns as supervising director for Fate/EXTELLA Link. The story will further develop the lore of this universe.</p>\n<p>•Hunker Down in Base Camp<br />\nMove freely around your army’s base camp—a medieval church suspended in the sky. Interact with your Servants to build your bonds and take on side-missions to learn their stories.</p>\n<p>•Polished Graphics and Battle Mechanics <br />\nBoth combat mechanics and animation have been refined for the ultimate in single and multiplayer battles. Team up with support Servants to deliver devastating Chain Phantasm attacks.</p>", "metacritic": 76, "released": "2018-06-07", "tba": false, "updated": "2024-03-06T03:03:52", "background_image": "https://media.rawg.io/media/screenshots/e14/e141a7f02276e01e25a9a1bacdf0d9e4.jpg", "website": "http://www.xseedgames.com/games/fate-extella-link/", "rating": 3.95, "rating_top": 4, "added_by_status": {"yet": 14, "owned": 85, "beaten": 13, "toplay": 21, "dropped": 8, "playing": 7}, "playtime": 6, "achievements_count": 220, "ratings_count": 20, "suggestions_count": 260, "game_series_count": 0, "reviews_count": 20, "platforms": ["PlayStation 4", "PS Vita", "Nintendo Switch", "PC"], "developers": ["Marvelous", "Type-Moon", "Marvelous USA"], "genres": ["Action"], "publishers": ["XSEED Games", "Marvelous USA", "Marvelous"], "esrb_rating": null}