{"id": 261382, "slug": "frontier-commando-war-3d-sniper-game", "name": "Frontier Commando War: 3D Sniper Game", "name_original": "Frontier Commando War: 3D Sniper Game", "description": "\"The city is under threat of breaking into a war of massive proportions, as crime is on the rise and the local prisons are struggling to hold of the prisoners. Jack Nolan has been called in to handle this war mission using his expert sharp shooter skills. <br/><br/><br/>Wield up your weapons to take down criminals and save your city from each threat in this FPS shooter war mission. The objective is simple, kill off each criminal who tries to escape the prison frontier and hold off until reinforcements arrive. If you fail, the city burns to ashes. But if you win, you will finally confront the mastermind behind the plot in a final boss war mission. <br/><br/><br/>GAMEPLAY FEATURES :<br/><br/>- FPS shooting gameplay with objective levels <br/>- Dual gun carrying capacity with more pick up weapons available in-game <br/>- 5 war mission levels with the final boss fight <br/><br/>DETAILED FRONTIER WAR MISSION TO TAKE OUT CRIME<br/>Gear up 2 massively damaging guns against the shooting criminals and hold the frontier against the onslaught in this war mission. <br/><br/>INTENSE BOSS BATTLE IN THE WAR MISSION FINALE<br/>This shooting ops war mission will culminate in the finale boss battle against the mob leader. The leader will be ruthless in his attack, so be precise and take him down.\"", "metacritic": null, "released": "2016-03-29", "tba": false, "updated": "2019-10-22T13:59:39", "background_image": "https://media.rawg.io/media/screenshots/c02/c0217dee115b8e7b25bac710956487a7_yJ7rb5L.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 174, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Muddy Apps"], "genres": ["Action", "Adventure"], "publishers": ["Muddy Apps Pvt"], "esrb_rating": null}