{"id": 261301, "slug": "roboball", "name": "RoboBall", "name_original": "RoboBall", "description": "RoboBall is a game in which you control a ball-shaped robot and solve physics- and logic-based puzzles. Your goal is to control various mechanisms in order to reach the end of the level, where you will find a teleporter that will take you to the next level.<br/><br/>Puzzles<br/><br/>On every stage you will find a large number of different mechanisms, buttons, laser switches, and doors. To open a door, start an elevator, or simply activate a certain mechanism, you will need to activate a button. Sometimes you can't do it by yourself and will need some help from metal balls, barrels, or crates. But don't forget that they might also need your help to perform certain actions.<br/><br/>Workshop<br/>RoboBall has a level editor that is very flexible and packed with functionality. All of the levels in the game were created using this editor. Place static objects such as zones, paths, glass tubes, and metal [unknown - possible typo]. Active objects perform various functions. These include doors, elevators, and machines that create metal balls, crates, or barrels. Buttons deserve special attention. You can use them to open or close doors, activate elevators, or deactivate turbines that are preventing you or any other physical object from advancing. There are two different kinds of buttons in the game: switches, which activate the objects they are linked to and then turn them off again when pressed a second time, and triggers, which activate objects as long as you or another physical object remains on top of them. When the object leaves the trigger, the objects linked to the button are deactivated.<br/>Once you've created a level you can publish it in the workshop. You can also play other players' levels.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:51:30", "background_image": "https://media.rawg.io/media/screenshots/f31/f31e698094ad8673313577ae6a34bb13.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 204, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["PS Games"], "genres": ["Adventure", "Indie"], "publishers": ["PS Games"], "esrb_rating": null}