{"id": 261389, "slug": "helicopter-sniper-shooter-be-the-hero-and-defend-t", "name": "Helicopter Sniper Shooter - Be the hero and defend the nation", "name_original": "Helicopter Sniper Shooter - Be the hero and defend the nation", "description": "Helicopter Sniper Shooter is an action packed Criminal Car and Truck Shooter game. Get ready to be on a criminal chase mission in the Apache Helicopter having the Sniper shooting criminals for the sake of city defense.<br/><br/>You are an expert Sniper Shooter and assigned a task to eliminate the criminals putting your Sniper Killer skills online. Criminals are on the run. Chase them and destroy their cars and trucks by shooting them with sniper to save the city from their terror.<br/><br/>Jump into the flying action Full of thrill busting chase adventure while eliminating street crime rate in the city. The interesting blend of flight simulation and Sniper Shooter bring you to encounter with most daunting Sniper missions of your life. Fly in the helicopter around the city with an aim to gain control on skipping criminals and gangsters. This criminals shooting mission will take you to drift through tricky skyways, edge of top buildings and busy streets and highways. Balance between cars speed and air drive will be a real test of your Sniper gesture control. Get your Sniper Gun and fly through the sky and destroy the cars and trucks of the criminals. Race around the city chasing gangsters.<br/><br/>Helicopter Sniper Shooter Gameplay: <br/>Shoot the cars and trucks of criminals with sniper flying in the Helicopter in 4 exciting levels. Chase the criminal and shoot / destroy their cars and trucks to save the urban city from there terror.<br/><br/>It is your call of duty, racing against time to destroy international mafia and organized crime syndicates, you will liberate the cities from these criminal gangs!<br/><br/>Clear each level successfully, and within the best possible time, for becoming the ultimate Sniper.<br/><br/>Please Note! Helicopter Sniper Shooter is free to download and play. Download now!<br/><br/>Helicopter Sniper Shooter Features: <br/>&gt;In-flight Sniper shooting adventure in urban city environment<br/>&gt; Flight simulation combined Sniper shooter<br/>&gt; Smooth transition of gyroscopic motion<br/>&gt; Stunning 3D graphics in real physic gesture control<br/>&gt; Amazing skyline and overhead city environment<br/><br/>Visit our Facebook Fanpage at: https://www.facebook.com/Rahma-Apps-1652372978372736", "metacritic": null, "released": "2016-01-06", "tba": false, "updated": "2019-10-22T13:59:40", "background_image": "https://media.rawg.io/media/screenshots/90c/90ca593b7dfef584ffd370b48359d844_zzsxtWX.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 91, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Muddy Apps"], "genres": ["Action", "Simulation"], "publishers": ["Muddy Apps Pvt"], "esrb_rating": null}