{"id": 261375, "slug": "death-race-speed-rage-gangsta-over-drive-wreck", "name": "Death Race Speed Rage: Gangsta Over Drive Wreck", "name_original": "Death Race Speed Rage: Gangsta Over Drive Wreck", "description": "Unleash The Inner Death Racer In You<br/><br/>Death Race is an epic event taking place every year on a deadly island of Cuba, all the extreme and violent criminals who are sentenced to death are kept in the prison there. Every year death race is organized with the moto to \"Gain Your Freedom\", any racer who wins five races and is alive, will be granted him freedom. <br/><br/>Upgrade your car with modern guns and deadly weapons to have accurate kill the enemies and other racers. The racers have their own rivalry and you are to survive this epic race to gain your freedom from the prison but you have other plans for you. <br/><br/>As this deadly race starts you had a clean kill shot and you now on your way to escape from the prison, the police cars are chasing you and the snipers are firing at your car. Let's see how long can you get along in this endless runner adventure. <br/><br/>Avoid crashing your vehicle, if you receive enough damage your sports car will immediately burst into flames and you will die on spot. Take kill shots as much as you can and crush the shooters on the road with your asphalt sports car. <br/><br/>High Power Escape Shootout Action<br/><br/> Drive insane in an adrenaline filled racing car action, pacing through heavy city traffic and trying to lose tail. Push the speed barriers to the limit, as your only hope of surviving this Most Wanted onslaught is to boost through the city and escape the bounds of the shooters force after you.<br/><br/>Bring on the heat to the city roads, as you power up your racing car to blaze through the city in an attempt to make the ultimate escape, surviving an ambush by forces throughout the city. Drive angry and don’t let any shooter take you down. Racing car meets the ultimate survival quest, as your choice of survival will depend on how good you are with your machine.<br/><br/>If you’re fast enough, maybe you can survive the attack from the shooters. If the going gets crazy, time to raise havoc in the city for your escape. The numbers are overwhelming, but so is your high powered racing car. Unleash a roadkill streak if you have to!<br/><br/>Just drive like there’s no obstacle in your path and over run these soldiers. Beware though, too much damage to your car, and your days of being the most wanted drag racer are over. Run you are driving asphalt car and survive as long as you can. <br/><br/><br/>FEATURES<br/><br/>- High octane Racing car gameplay combined with action/arcade sequences<br/>- Brilliant city tracks and traffic AI<br/>- Endless Racing concept, along with an engaging Roadkill action<br/>- Choose different cars to play with", "metacritic": null, "released": "2015-12-08", "tba": false, "updated": "2019-10-22T13:59:39", "background_image": "https://media.rawg.io/media/screenshots/10a/10a939beee588692d3ba49fd3691aa57.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 77, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Muddy Apps"], "genres": ["Action", "Racing"], "publishers": ["Muddy Apps Pvt"], "esrb_rating": null}