{"id": 261358, "slug": "call-of-sniper-war-2018", "name": "Call of Sniper War 2018", "name_original": "Call of Sniper War 2018", "description": "In this beautiful game of call of impossible army sniper world war 2 hero game of 2017. You will get the chance to accompany the Lost soldier and bravo commando sniper hero on a quest to eliminate the AS a terrorist organization which is working in forests and deep jungles of South Africa and America to promote drugs and ammunition from Afghanistan. This terrorist organization got the trained guards and snipers to protect their boundaries and business. Be very careful from the guard dogs and sniper fury heroes. Enjoy the realistic and natural shooting and fighting environment of the call of impossible army sniper World War 2 hero. In this futuristic robo commando sniper hero battle game the key feature is the lost sniper hero who has to escape the jungle of enemies in order to survive. This makes this commando survival shooting game a unique piece of work. Being the lost survival super hero commando shooter you have to shoot all the enemies from a safe distance and survive through the mission.<br/><br/>There is a reason of providing you different modern robo commando gun. You enemy is very smart and knows the whereabouts of your location so be prepared to battle your smart enemy in the battlefield of deep forests and valleys covered with snow. You have to act like the modern gun sniper hero because you have all the modern weapons of sniper. Target the enemy gangsters and shoot them before being spotted by them. Your shooting strategy and foot work of modern shooting sniper can help you survive the battlefield. <br/><br/>&gt;&gt;&gt;Key Features of call of impossible army sniper world war 2***<br/><br/>1-\tChallenging environment of modern sniper shooting game<br/>2-\tMultiple Challenging and survival missions<br/>3-\tPlay it anywhere as it is an offline fury game<br/>4-\tThrilling fights with clans of enemies<br/>5-\tReal FPS Experience", "metacritic": null, "released": "2017-12-22", "tba": false, "updated": "2019-10-22T13:59:36", "background_image": "https://media.rawg.io/media/screenshots/d26/d26266df142df7918c0284e0f68bac75_WbXbhNU.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 224, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Muddy Apps"], "genres": ["Action", "Adventure"], "publishers": ["Muddy Apps Pvt"], "esrb_rating": "Mature"}