{"id": 261384, "slug": "heavy-construction-simulator-drive-a-forklift-thro", "name": "Heavy Construction Simulator- Drive a forklift through the city suburbs to become a construction master", "name_original": "Heavy Construction Simulator- Drive a forklift through the city suburbs to become a construction master", "description": "Stay true to your driving skills while drive clean to prove you an expert loader truck driver. Take control on steer and gear of heavy machine gears to park in parking bay. An expert construction driver needs to be accurate of his construction machine moves and the same will demanded from you with some extra drive simulator care.<br/><br/><br/>Take part in city construction by providing a driving hand to the loader trucks driver union. Only the expert drivers will be chosen to take part in construction simulator team. First, show your skills by passing a driving test of none other than this heavy machine, excavator loader truck.<br/><br/><br/>Carefully drive excavator loader truck taking it towards the parking bay while managing to avoid crash into fast coming city traffic and other vehicles to slow you down. This under construction city needs less damage so handle your machine with special simulator skills.<br/><br/><br/>Control over your steer, clutch brake and reverse gear via on screen board. Avoid hitting with other heavy vehicles while parking loader truck to the parking bay. Your ultimate goal is to park loader at destination with a clean drive way. Pass through increasingly difficult driving levels also testing your expert parking skills to go on next driving mission. Being a heavy truck driver bears a lot of skills and you will acquire it through these collections of levels seeking a proof driving license. <br/><br/><br/>OBJECTIVES<br/><br/><br/>Get mastered in on-board vehicle simulator controls<br/>Maintain clean drive without hit into other vehicles<br/>Get some extra points with error free driver simulation", "metacritic": null, "released": "2015-06-26", "tba": false, "updated": "2019-10-22T13:59:39", "background_image": "https://media.rawg.io/media/screenshots/d4b/d4b2324429ab9ab248ac856e36320237.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 95, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Muddy Apps"], "genres": ["Simulation", "Puzzle"], "publishers": ["Muddy Apps Pvt"], "esrb_rating": null}