{"id": 261383, "slug": "subway-dog-and-angry-rabbit-endless-running-race-w", "name": "Subway Dog and Angry Rabbit Endless Running Race: Wacky Obstacles and Temple Surfers", "name_original": "Subway Dog and Angry Rabbit Endless Running Race: Wacky Obstacles and Temple Surfers", "description": "Get ready to the endless racing battle between angry dog and subway rabbit in a complete temple run adventure game. In this endless simulation game, let’s see either you catch the rabbit or it keep you running on the subway. <br/><br/>Subway Dog and Angry Rabbit Endless Running Race: Wacky Obstacles and Temple Surfers is an infinite running 3D adventure with several obstacles and monster characters.  <br/><br/>*****Story*****<br/>Put yourself into the shoes of wild and angry dog, looking to attack the rabbits to feed on them. The stage is set on temple and subway, either you can do surfing or watch your dog chasing and hunting down rabbits in an endless freerunning adventure game.<br/><br/>Put your running shoes tight in this endless freerunning game as you are not going to be alone in this dog and rabbit temple run chase. You also have to complete with the CPU player, so run your dog as fast as you can and catch the wild rabbit first.<br/><br/>On the subway surfing track, the dog also have to tackle the wacky obstacles surrounded around him, make sure to jump, tilt, and slide at the right time to catch and with the infinite running mode. Sprint on a wild rabbit hunt, competing against other dogs in a one on one competition. <br/><br/>Keep running after the fast rabbits and don’t lose the tail, or you lose and the hunt gets away.<br/><br/>*****Game Play*****<br/>Use the device’s tilting controls to strafe sideways. Press the on screen sprint button at the precise moments to boost your dog’s speed and keep ahead of the competing dogs.<br/><br/>Chase and catch the rabbit before the rival dog gets there and you are left empty handed.<br/><br/>*****Features*****<br/>- Catch the rabbit in endless freerunning mode.<br/>- Choose Temple or Subway Run Theme. <br/>- Complete with CPU mode and catch the wild rabbit first. <br/>- Tilt your screen to avoid obstacles. <br/>- Complete 3D environment<br/>- Four levels of extreme runner game play", "metacritic": null, "released": "2015-11-23", "tba": false, "updated": "2019-10-22T13:59:39", "background_image": "https://media.rawg.io/media/screenshots/dc3/dc3aebb0ff3f54205459dfbd6446250a_JpXXCKZ.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 127, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Muddy Apps"], "genres": ["Adventure", "Arcade", "Casual"], "publishers": ["Muddy Apps Pvt"], "esrb_rating": null}