{"id": 261361, "slug": "dino-hunter-sniper-3d-dinosaur-target-kids-games", "name": "Dino Hunter Sniper 3D - Dinosaur Target Kids Games", "name_original": "Dino Hunter Sniper 3D - Dinosaur Target Kids Games", "description": "Hungry Dino Hunter is an addictive sniper survivor game with extreme graphics and amazing game-play. It enables the user to polish their sniping skills and eliminate all the threats in order to survive in the deadly jungle combat. <br/><br/>**********BACKGROUND STORY**********<br/><br/>A squad of elite sniper is sent into jungle for training, the commander has assigned different tasks, and you are unfortunately separated from the task force and are left alone in the jungle to survive along with the fierce animals and hungry dinosaurs on deadly shores. <br/><br/>Your best friend in this situation is your sniper rifle, you are provided with the map to reach to the base camp of your fellow troops but you have to kill all the threats which come your way. You have a limited amount of bullets left in your rifle, so use them wisely and try to kill the dinosaurs with single head-shot. <br/><br/>Using your military training you are making your way through the jungle but the biggest threat you will encounter is the Hungry Dinosaurs and T-Rex. <br/><br/>One of the Dinosaurs has spotted you and as soon you will hunt down the threat, the rest of the dinosaurs will start attacking you, try to kill them as soon as possible with head shots and make your way back to the sniper camp.<br/><br/>Let’s see how long you survive in the jungle! <br/><br/>**********FEATURES**********<br/><br/>-\tAmazing 3D Graphics<br/>-\tShort and Long Range Snipers to Select From<br/>-\tMultiple Dinosaur Attacks <br/>-\tExciting Challenges at Every Level<br/>-\tHunt or Be Hunted <br/>-\tExotic Jungle Locations <br/>-\tSavage Dinosaurs and T-Rex<br/>-\tDeadly Dino Combat <br/>-\tWeapon Upgrade System <br/><br/>-\tVisit us at http://www.muddyapps.com/ <br/>-\tLike our Facebook Page: http://www.facebook.com/Muddy.Apps <br/>-\tFollow us on Twitter: https://twitter.com/Muddy_Apps", "metacritic": null, "released": "2016-06-09", "tba": false, "updated": "2019-10-22T13:59:36", "background_image": "https://media.rawg.io/media/screenshots/dad/dad16cfbac1c8ba4461499a9c4f3f247.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 214, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Muddy Apps"], "genres": ["Action", "Adventure"], "publishers": ["Muddy Apps Pvt"], "esrb_rating": null}