{"id": 261316, "slug": "mlb-the-show-19", "name": "MLB The Show 19", "name_original": "MLB The Show 19", "description": "<p>Game contains In-Game Purchases.<br />\n1 player<br />\nNetwork Players 2-8<br />\n53GB minimum save size<br />\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service &amp; playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.<br />\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service &amp; playstationnetwork.com/privacy-policy).<br />\nOnline multiplayer requires a PlayStation Plus membership.<br />\nOnline features may be terminated at any time.<br />\nMajor League Baseball and Minor League Baseball trademarks and copyrights are used with permission of Major League Baseball Properties, Inc. and MLB Advanced Media, L.P., as applicable. All rights reserved. Visit MLB.com, the Official Site of Major League Baseball and MiLB.com, the Official Site of Minor League Baseball. The Baseball Hall of Fame and Museum trademarks and copyrights are used with permission of the National Baseball Hall of Fame and Museum, Inc., as applicable. Visit the official website of the Hall of Fame at BaseballHall.org. Officially Licensed Product of Major League Baseball Players Association-MLBPA trademarks and copyrighted works, including the MLBPA logo, and other intellectual property rights are owned and/or held by MLBPA and may not be used without MLBPA’s written consent. Visit www.MLBPLAYERS.com, the Players Choice on the web. Official Licensee-Major League Baseball Alumni Marketing, Inc. © MLAM. All trademarks are the property of their respective owners. Appearance in this game does not imply sponsorship or endorsement.</p>", "metacritic": null, "released": "2019-03-26", "tba": false, "updated": "2023-07-28T07:33:02", "background_image": "https://media.rawg.io/media/games/e66/e6683904582e35ad06b7431c86475300.jpg", "website": "", "rating": 2.97, "rating_top": 3, "added_by_status": {"yet": 43, "owned": 469, "beaten": 19, "toplay": 1, "dropped": 67, "playing": 20}, "playtime": 0, "achievements_count": 28, "ratings_count": 101, "suggestions_count": 208, "game_series_count": 13, "reviews_count": 101, "platforms": ["PlayStation 4"], "developers": ["Sony Interactive Entertainment"], "genres": ["Sports"], "publishers": [], "esrb_rating": "Everyone 10+"}