{"id": 261351, "slug": "my-beauty-spa-stars-stories", "name": "My Beauty Spa: Stars & Stories", "name_original": "My Beauty Spa: Stars & Stories", "description": "My Beauty Spa is a unique blend of intriguing Hollywood stories, city building and farming ! <br/>Build your perfect Beauty Spa! Harvest crops, process them at your facilities, and create amazing eco-friendly treatments. Trade with other Spas. Open hair and make-up salons, massage studios and other treatment services to provide a perfect experience to your Hollywood customers. Explore the Hollywood boulevard and find rare resources. Run your own production and get involved in the Hollywood gossip and stories. <br/>Are you ready to build your dream beauty spa? Let’s get started!<br/><br/>My Beauty Spa features: <br/>● FUN and exciting storylines to follow and explore <br/>● PROVIDE and build classy beauty and spa services to your customers <br/>● UNLOCK fun, charismatic beauty-experts with orders you need to fill <br/>● GROW ingredients and create eco-friendly treatments<br/>● FASHION and Beauty events to participate in and win great prizes <br/>● SPA Managers help you out with production and treatments <br/>● Play with your friends or make new friends in the game community! <br/><br/>My Beauty Spa is free to play, though some in-game items can also be purchased for real money. <br/>*You need an internet connection to play the game and enable social interaction, competitions, and other features.*<br/>Got questions? Check out our community: https://www.facebook.com/mybeautyspagame<br/>Got feedback? We’re always happy to hear it: hello@cherrypickgames.com<br/><br/>Privacy Policy: http://www.cherrypickgames.com/privacypolicy/<br/>Terms of Service: http://cherrypickgames.com/termsofservices/", "metacritic": null, "released": "2018-10-31", "tba": false, "updated": "2019-10-22T13:59:33", "background_image": "https://media.rawg.io/media/screenshots/6e4/6e4242f98889c6976494b4ec11ca9464.jpg", "website": "http://www.cherrypickgames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 158, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["cherrypick games"], "genres": ["RPG", "Family"], "publishers": ["Cherrypick Games"], "esrb_rating": "Everyone 10+"}