{"id": 261380, "slug": "last-commando-redemption-a-fps-and-3rd-person-shoo", "name": "Last Commando Redemption - A FPS and 3rd Person Shooting Game", "name_original": "Last Commando Redemption - A FPS and 3rd Person Shooting Game", "description": "Engage in an intense third person action adventure, as your elite commando gears up for a last survival attempt in a bludgeoning battlefield, where the odds are stacked against you from all ends.<br/><br/><br/>Fight through the enemy war line, executing elite spy kills and assaulting enemy shooters with multiple weapons. The enemy numbers are elusive of what appears, it may very well be your very last survival run in an attempt to retrieve the territory for the enemy run carnage.<br/><br/><br/>THIRD PERSON/ FPS HYBRID CONTROLS<br/><br/><br/>Enter a superb realm of shooting experience, navigating the enemy territory and engaging in elite commando carnage war in hybrid controls, being able to switch to third and FPS controls.<br/><br/><br/>BRILLIANT AND ENGAGING WAR MISSIONS<br/><br/><br/>In this last survival attempt, unleash an elite commando carnage streak to unsettle the enemy force in five exhilarating levels of gameplay, with different enemy classes and attack patterns to put a serious dent to your last survival mission.<br/><br/><br/>REALISTIC WAR ENVIRONMENTS<br/><br/><br/>Journey through the tough and challenging mountain residences, where enemy shooters can ambush your elite spy from any side.<br/><br/><br/>With realistically build game design and enemy AI, keep a step ahead of them to keep your hopes of this last survival mission alive.<br/><br/><br/>FEATURES<br/><br/>- Brilliantly designed mountain scenarios<br/>- 5 exhilarating levels of war mission based gameplay<br/>- Third person and FPS hybrid controls gameplay", "metacritic": null, "released": "2016-09-08", "tba": false, "updated": "2019-10-22T13:59:39", "background_image": "https://media.rawg.io/media/screenshots/97f/97f14d7e0cd5682be0135e97bc115425.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 188, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Muddy Apps"], "genres": ["Action", "Adventure"], "publishers": ["Muddy Apps Pvt"], "esrb_rating": null}