{"id": 261401, "slug": "presidential-rescue-commando", "name": "Presidential Rescue Commando", "name_original": "Presidential Rescue Commando", "description": "Presidential Convoy Security<br/>Enjoy the latest Presidential Rescue Commando Convoy Security 3D which is fully optimized for your mobile devices. America has just selected their new president and everybody is very happy about the new revolutions new president promised about, but there is a group of terrorists named dragons of brave atlantis who are not happy with this. Dragon of brave atlantis want to ruin the peace of the city and make the city a warzone. Your duty is to become the special terrorist contra hunter fighting force and to make sure the presidency is safe with you. Dragon of brave atlantis is a threat to the presidency, clear the way and become the brave fantasy exvius of the president. Dragons of brace atlantis will intervene in different places and different time to attack the presidential convoy. You will have to be aware of the Presidential survival driver counter terrorist deadly attack. The President depends on Presidential survival driver and very confident that the special force is able to counter the terrorist deadly attack. The frenetic Presidential survival driver counter terrorist deadly attack can only be faced if you understand the strategy of dragons of brave atlantis. Stop them by confronting them in the warzone and limit them in their boundaries. Dragon of brave atlantis want to make your country game of wear fire age. They think of you the brave commando exvius of the president security and espn frenetic fantasy hero.<br/>Secure the way of the presidential convoy and take the great responsibility of presidential convoy security. Tell the dragons of brave atlantis that you own America and you are the brave soldiers of special terroist contra hunter fighting force.  Get ready for the ultimate madness of presidential security attack games. There are a lot of game like presidential car driver games and presidential security commando shooter but this game is a beautiful blend of game of war fire age and warzone. Confront the terrorists and enemies of your country in the battlefield. Brave draggons of atlantis have been planning these attacks for almost a year now. It’s time for them to make your country a warzone. So you need to be super sharp and wise to eliminate the chances of their attack on the presidential convoy. You can also be the president secret car driver to make sure the presidential safe survival. Drive the president to home and in meetings by yourself.<br/>You will play as special Presidential survival driver and counter terrorist deadly attack hero and both at the same time. Prove yourself the best man this country got by making sure the president security survival and driving convoy to a safe place. Be the super hero of this blend of security and driving game at the same time.<br/><br/>Feature of special terrorist contra hunter fighting force game 3D<br/>1-\tEngaging Gameplay<br/>2-\tRealistic controls of president super security convoy driving games 3D<br/>3-\tEntertaining environment of president survival security game<br/>4-\tBest Graphics of president security car driver 3d", "metacritic": null, "released": "2017-11-17", "tba": false, "updated": "2019-10-22T14:39:13", "background_image": "https://media.rawg.io/media/screenshots/e8f/e8f60b3c326484d5e98b1eb3df891c3f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 114, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Muddy Apps"], "genres": ["Action", "Arcade", "Casual"], "publishers": ["Muddy Apps Pvt"], "esrb_rating": null}