{"id": 261449, "slug": "slugterra-slugslinger-showdown", "name": "Slugterra: Slugslinger Showdown", "name_original": "Slugterra: Slugslinger Showdown", "description": "Dr. Blakk’s minions are invading, and the citizens of Slugterra need you! In this action game based on the popular animated television series Slugterra, play as Eli Shane, the protector of Slugterra, and battle hordes of villains to save the 99 caverns. Collect little critters called slugs, then fire them out of your high-powered blaster, transforming them into powerful battle beasts to take down your foes! Customize your blaster with high-tech mods and blast your way to victory.<br/><br/>To play, tap enemies to fire a slug, and hold to charge up your shot. Swipe Eli back and forth to duck, dodge and flip out of harm’s way. With each shot, your slugs get pumped up until they’re ready for a supercharged hit that can take out multiple enemies at once!<br/><br/>The key to victory is upgrading your blaster with high-powered mods, and choosing the best slugs for each round.<br/><br/>Players can collect new slugs and gear and unlock new caverns by dueling Dr. Blakk’s army of minions in Story Mode.<br/><br/>Features:<br/><br/>• Defeat waves of enemies using powerful slug attacks<br/>• Duck, dodge and flip to avoid slug fire<br/>• Collect all of your favourite slugs and blast them in battle to transform them into powerful battle beasts!<br/>• Collect new gear and customize your blaster with high-tech mods!<br/>• Battle all of your favourite villains from Slugterra!<br/>• Unlock new caverns through gameplay", "metacritic": null, "released": "2015-05-09", "tba": false, "updated": "2019-10-22T14:39:12", "background_image": "https://media.rawg.io/media/screenshots/132/132d204a177e2fbab66e2d1c368586fc_mQVrI3N.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 209, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Epic Story Interactive"], "genres": ["Action", "Arcade", "Casual"], "publishers": ["Epic Story Interactive"], "esrb_rating": null}