{"id": 261599, "slug": "tap-robo", "name": "Tap Robo", "name_original": "Tap Robo", "description": "The Future World with the insurgency giant Robot, the day that Robot is the threat to the survival of mankind.<br/>Robot begin to control the power and thought, they want to dominate the world, they want to destroy the entire human, and they're going to succeed. The only hope for humans is you, stand up and start leading the war for survive with your Heroes.<br/><br/>To destroy the Robot which has enormous power, you will get the help of the Warrior/Heroes - they are Robots fight, you also will be equipped with modern weapons, armor and Pets to make your ROBO TAP stronger.<br/><br/>Let's face the ROBOT MONSTER and become a Tap Heroes. THE ROBOT are extremely dangerous, but they also have weaknesses, you can completely destroy them by TAP HEROES, just use your power and determination, the world's rescue is mission for you.<br/><br/>Tap ROBO – the role-playing game is extremely interesting in 2016, TAP TITANS - are you ready to experience the unique adventure yet?<br/><br/>TAP to attack, TAP to kill ROBOT, TAP to adventure, TAP to convene and hire warriors/ HEROES, TAP to activate HEROES combat skills, TAP TAP to collect hidden treasures in TAP TITANS.<br/><br/>TAP ROBO is the best game to relieve stress, you will not only feel excited when you kill a Robot, but also can discharged your upset by TAP TAP constantly, TAP TITANS kill all the angry or unhappy. You will not be enjoyed this feeling in other games than this TAP TITANS.<br/>Features<br/>- To upgrade your ROBOT skills and Robot Warriors/ HEROES through a thousands of levels to prove your caste<br/>- Tap to beat 80 giant and brutal Robot.<br/>- You can hire Warriors, Heroes to Tap Heroes to fight giant monsters ROBOT ( Tap Titans ), even if you are not TAP TAP. Just open the TAP ROBO game, and earn trophies.<br/>- Varied and unique Map System in TAP TAP MONSTERS, you will be lost in another world with all different terrains, feeling extremely interesting with ROBOT COMBAT<br/>- The secret gifts be collected during the Tap Titans game screen, you will never know what you get if you did not open the gift box yet, but it will be a pleasant surprise for the TAP HEROES<br/>-  6 special skills for Heroes. Diversity Weapons systems, clothing Pet of TAP HERO for you to discover<br/>- Charts for you to fight<br/><br/>Join the Tap ROBO<br/>https://www.facebook.com/Zonmob/", "metacritic": null, "released": "2016-09-27", "tba": false, "updated": "2019-07-29T21:13:34", "background_image": "https://media.rawg.io/media/screenshots/99a/99a4a88bce6761cd5c2523ab175803f3.jpg", "website": "https://www.facebook.com/Zonmob/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 134, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Vietnam Zonmob Technology JSC"], "genres": ["Action", "RPG"], "publishers": ["Vietnam Zonmob Technology JSC"], "esrb_rating": null}