{"id": 261524, "slug": "ruby-run-eye-gods-revenge", "name": "Ruby Run: Eye God's Revenge", "name_original": "Ruby Run: Eye God's Revenge", "description": "You’re a mustached hero and you've awakened the Eye God by stealing his sacred ruby - bad move.<br/>The race of death is on - POW! It started when you grabbed the sacred ruby and ignited the temple laser.<br/>Run fast, climb each hill, and combat every obstacle while you shoot down the Eye God’s worshipers (they’re a bit slow and get in your way).<br/>Collect gems on your path, build your gun inventory and shoot your way to survival, A.K.A your highest score (let’s face it, you’re going to die).<br/><br/>If you like our Hopeless series, then you’ll love this action game!<br/><br/>Ruby Run's Key Features:<br/> • Earn gems for having friends! When logged-in with Facebook, if any of your friends join, you will get more gems.<br/> • Get even more gems when you defeat your friends when logged-in to Facebook.<br/> • Build your weapon collection with the Gun Lottery to help you wipe out those pesky worshipers. Collect them all!<br/> • In the mood for grenades today? You can choose any gun (even a grenade launcher!) from your inventory.<br/> • Get other free goodies along the way.<br/> • A new game from the developers of Hopeless: The Dark Cave<br/><br/>FOLLOW US:<br/>Official website: http://www.upopa.com<br/>Facebook: https://www.facebook.com/upopagames<br/>Twitter: https://twitter.com/UpopaGames<br/><br/>Please email us with any new bugs or glitches to support@upopa.com", "metacritic": null, "released": "2015-07-28", "tba": false, "updated": "2019-10-22T13:59:56", "background_image": "https://media.rawg.io/media/screenshots/ab9/ab93a1bb3e180bbb0f00ba579a271a9f.jpg", "website": "http://upop.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 103, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Upopa Entertainment"], "genres": ["Action", "Racing"], "publishers": ["Upopa Entertainment"], "esrb_rating": null}