{"id": 261596, "slug": "god-of-era-epic-heroes-war", "name": "God of Era: Epic Heroes War", "name_original": "God of Era: Epic Heroes War", "description": "Gods of Era revolves around the fierce battles of heroes<br/><br/>When the Magical power was liberated, the world broke out, casting the world into dark and chaos. A new Legendary order needs to be established, and this is the time that war begins.<br/><br/>The Epic Heroes will have to fight monsters to increase their strength, as well as proving their power.<br/>Explore exiting world maps in God of Era, where formidable new opponents are waiting to challenge your fighting skills.<br/>Fight in each battle with your warrior to regain control over it and collecting the spoils to equip your warriors<br/>GoE: Heroes War is an action role-playing game (ARPG) where you and your Warrior, participate in the big war, along with the warriors, stand up and unify the kingdom!<br/><br/>Heroes War Features<br/>- Heroes system is extremely diverse: Warriors come from different lands, have different fighting style and skills.<br/>- Heroes upgrade from the resources gained from winning, including: level, power and the hero skills.<br/>- Boss System: Daily boss and World boss to be conquered; there are 7 daily boss trials each day to challenge the heroes team.<br/>- You can set up your hero team and join the epic battle.<br/>- Soldier Support System for each warrior.<br/>- The stages in this game present a variety of themes<br/>- Daily Task System for warriors, completing missions and receiving upgrades to become Legendary.<br/>- Players can use the Automatic mode to let heroes control the epic war and win.<br/>- Daily rewards to receive the legend bonus every day and get online gifts each hour<br/>- Collect items and the Hero fragments to be a summoner.<br/><br/>How to play<br/>- Summon over 20 legendary Heroes and legendary warriors and assemble them into powerful squads<br/>- Look for items and equip to increase the hero’s power, prepare for the Battle of Gods<br/>- Level up, enhance and strengthen your Heroes<br/>- Unlock the magic skills to engage in epic battle<br/>- Be smart, organize your Heroes team and strategy to fight other players<br/>- Finish the quest to get a bonus every day<br/><br/>If you spot any bugs or have anything to report about the GoE: Heroes War, please reply to us on our fan page:<br/>Facebook: https://www.facebook.com/GodsofEra/<br/>Twitter: https://twitter.com/Zonmob_Games<br/><br/>Let’s play God of Era: Heroes War", "metacritic": null, "released": "2017-12-14", "tba": false, "updated": "2019-07-29T21:13:33", "background_image": "https://media.rawg.io/media/screenshots/cb4/cb48d8a0d41f5bcab323ae91790ab857.jpg", "website": "https://www.facebook.com/GodsofEra/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 142, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Vietnam Zonmob Technology JSC"], "genres": ["Action", "RPG"], "publishers": ["Vietnam Zonmob Technology JSC"], "esrb_rating": null}