{"id": 261586, "slug": "stickman-revenge-3", "name": "Stickman Revenge 3", "name_original": "Stickman Revenge 3", "description": "Stickman Revenge 3 - The spectacular return in Stickman Revenge series toppled the international game market. <br/><br/>The followers of Stickman Revenge game still have not forgotten the feeling of tight guillotine and ecstatic graphics of Stickman Revenge old version. And what would you expect in a recent version of Stickman fight and this revenge? Whether this revenge will end or not? <br/><br/>Stickman Revenge 3 (Stickman fight) will come back with a new look. Be ready to wipe out the enemy – cruel monster and their obstacles by unprecedented features in Stickman Revenge 2<br/><br/>### Graphics have been updated to a new level.<br/><br/>Continuing the success of images in the old Stickman Revenge, the new version will impresses with absolute contrast and dramatic color and attract the players with each detail (Stickman gun, kinds of Stickman warriors and pet system).<br/><br/><br/>### Character system was upgraded, diversified and INCREDIBLE than ever. <br/><br/>Character system -  League of stickman has 3 Stickmans in 3 different styles which are “Truong Kiem”, “Song Dao” and “Trong Kiem”<br/>Each Stickman has his own fighting feature and uses the different weapons and stickman gun, which brings the whole new experience for players.<br/><br/>### Pet system is diversified <br/>With Stickman Revenge 3, the Heroes have been retrofitted Pet system unprecedented in Stickman 2 version.<br/>Pet types are: Angels, Ghosts, Dogs, Pigs and Butterfly which will increase the bonus and score and gain more coin in the runway for Stickman. They are also great warriors.<br/><br/>### Skill<br/>Unique skill system for each character<br/>Skills help Stickman and Stickman warriors increase their power many times and wipe out the enemies at a glance. The warriors can also use Stickman gun to destroy the monster faster. <br/><br/><br/>### Cruel Boss system was unprecedented in precedent<br/><br/>In Stickman Revenge 3, Stickman and Stickman warriors not only have to confront the monsters with various shapes and different mode of attack, but also to destroy the most dangerous Group Boss Monster with incredible power. <br/><br/>Why not download Stickman Revenge 3 right now and be one of the bravest warriors to continue the revenge journey for Stickman and his family, destroying the bloodthirsty monsters and seek justice for the world.<br/><br/>Download Stickman Revenge 3 - League of stickman and rate 5* if you like this Stickman fight!", "metacritic": null, "released": "2016-07-14", "tba": false, "updated": "2024-01-05T22:59:14", "background_image": "https://media.rawg.io/media/screenshots/1c5/1c56accf9c20f4bab39e29127dfb8f8c.jpg", "website": "https://www.facebook.com/game.stickmanrevenge/", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 146, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["Vietnam Zonmob Technology JSC"], "genres": ["Action", "Adventure"], "publishers": ["Vietnam Zonmob Technology JSC"], "esrb_rating": null}