{"id": 261578, "slug": "police-boat-chase-racing-drift", "name": "Police Boat Chase Racing Drift", "name_original": "Police Boat Chase Racing Drift", "description": "Imagine that you just robbed a bank and the police is on your tail. Jump into a boat and try to shake off the pursuit! This game is about racing, it’s about drifting with a trunk full of cash through an insanely crowded city! You are being chased by the cop police that wants to get back each cent from the stolen money bag. Don’t let them take it back from you! Test your skills, drift across the city and find out if you can be faster than them. Let the drifty chase begin!<br/><br/>Beware of the police though as they won’t stop chasing and trying to smash you. If you hit another car or a building during the chase, you're busted. You have a long way ahead of you and plenty of time to develop your skill and to find out if you can beat your friends on the global leaderboards.<br/><br/>In Police Cop  Boat Chase Racing Drift the longer you play the faster you go. Each boats has different speed and handles a little bit differently so the game experience is never the same - it differs the more you play! Better boats let you earn more coins which lets you unlock other cars with a totally different game sceneries.like drive car<br/><br/>If you like drifting, race games or high tension, this game is definitely for you! Because of the one tap mechanics, it requires only one hand to play, so you can play Police Boat Chase Racing Drift while taking a walk with your dog, riding a bus or during boring classes. Just don’t play it while driving a real car!<br/><br/>FEATURES<br/>- One tap mechanics<br/>- Easy to grasp controls<br/>- Addictive drift-based gameplay<br/>- 10 boats to unlock with more coming soon<br/>- 10 different cities to explore<br/>- Stunning 3D graphics<br/>- Music seamlessly adapting to the current area<br/>- Online Leaderboards and Achievements<br/>- Cloud sync between different devices<br/>- Realistic sounds, which will give you real hang of driving!", "metacritic": null, "released": "2018-05-14", "tba": false, "updated": "2019-10-22T14:00:00", "background_image": "https://media.rawg.io/media/screenshots/e9c/e9c848e08aa63535079f85044f60bcca_pQbFkZg.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 68, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Chi-Chi Games"], "genres": ["Racing", "Arcade"], "publishers": ["Huai-Chih Hsiao"], "esrb_rating": null}