{"id": 261526, "slug": "city-crimemafia-assassin-3d", "name": "City Crime:Mafia Assassin 3D", "name_original": "City Crime:Mafia Assassin 3D", "description": "City Crime-Mafia Assassin 3D<br/>Control NewYork Hitman defending its territory from humans. Sneak up on enemy Gangster and kill them wit your strong hits. In this Android game you have to control a Hitman , who is infuriated by the fact that there humans entered his territory. Penetrate the military camp, City, and other places where Mafia settled to destroy them all. Be careful, the Mafia are well-armed. So you need to use a variety of shelters, guide your hero along rooftops, etc. Attack enemies from behind.<br/><br/>\"City Crime\" - violent action \"Ninja Assassin Grand godfather stealth crime street assassination simulator\" game<br/>Incarnation of the protagonist of the game, becoming the most feared orangutan jungle it!Theft<br/>The protagonist of a Hitman, in order to save fellow snatch territory, and human Himan at war!<br/><br/>Brutal assassination sneak jungle, like a ninja thief give a fatal blow from behind the enemy!<br/>Watch your footsteps in the jungle, never positive conflict warring with the enemy,st uncertainty<br/>Human Sniper firepower very powerful!<br/><br/>Gorgeous bloody action violence assassinations, random assassinations launched action<br/>Exciting treasure hunt mode, collect the key to save the orangutan companion<br/>360-degree 3D visual effects operation, free to manipulate perspective worse Animal Gorilla Auto", "metacritic": null, "released": "2015-04-19", "tba": false, "updated": "2019-10-22T13:59:56", "background_image": "https://media.rawg.io/media/screenshots/cd3/cd36da8d162a423837835edd8d3d6ef2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 158, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Chi-Chi Games"], "genres": ["Action", "Arcade"], "publishers": ["Huai-Chih Hsiao"], "esrb_rating": null}