{"id": 261588, "slug": "kingdom-defense-hero-legend", "name": "Kingdom Defense: Hero Legend", "name_original": "Kingdom Defense: Hero Legend", "description": "Defense your Kingdom against the orcs in the most addictive Tower Defense game!<br/>Get ready for an epic journey to defend your kingdom against hordes of orcs, monsters, evil wizards and other nasty fiends with a vast arsenal of towers, heroes, knights and spells at your command!<br/><br/>Rain fire upon your enemies, command your troops, summon reinforcements, recruit warriors and face legendary monsters on a quest to save the Kingdom from the forces of darkness! Deploy rapid-fire archers! Carve walls with magic beams! Fire roaring cannons! Summon allies! Kingdom Defense offers variety and challenge.<br/><br/>Kingdom Defense: The War of Empires is the biggest Tower Defense game ever. This Tower Defense game is a whole new level of furiously fast, enchantingly charming gameplay and powerful strategy!<br/><br/>***  WONDERFUL KINGDOM <br/>Kingdom Defense takes place in a fantasy realm of beauty and nature. Adventure through lush forests, golden landscapes, snow-covered mountains, and epic desert as you face off against an army of slime, goblins, skeletons, werewolves, orcs and other fearsome creatures. Engage in an epic battle to save the world with courageous heroes and ancient magic by your side! <br/><br/>***  POWERFUL TOWER SYSTEM<br/>Kingdom Defense offer four basic towers: Archer Turret, Knight Barrack, Stone-Thrower and Magic Dragon. Each tower has its own function and strength, which is built to help defeat certain types of monsters easier, but can be ineffective when it comes to other opponents. When upgraded, towers gain more fire power and range to help win the battle!<br/>On top of that, towers can also be enhanced using stars earned per battle. With this new surge of power, you can customize each tower with various special effects such as boosting power, reducing skill cool-down. If you find out the same strategy cannot be carried to the next battle, you can reset the skill tree and mold it to your heart's content.<br/><br/>*** MAGIC SYSTEM<br/>Collect magical items such as the meteor strike, frost gem, healing ward or the gold box! They will greatly help you win your battles!<br/><br/>*** LEGENDARY HEROES AND KNIGHTS<br/>One very special feature Kingdom Defense offers is the hero system. We aim to create a perfect combination of strategy and RPG elements! In addition to towers and magical items, you can summon heroes and command them to fight off enemies. <br/>A variety of heroes can be chosen to be taken into battle: Galahad the Indomitable Warrior, Ashi the Hawkeye, Wukong, Shaman, Golem - each warrior is special. Choose wisely and you'll be the winner!<br/><br/>*** FEATURES<br/>- Impressive European-style graphics<br/>- Spectacular effects<br/>- Diverse monster system<br/>- 12 maps and many other game modes<br/>- Unique item system<br/>- Strong heroes system<br/>- War of Empires with magic.<br/><br/>Kingdom Defense: The War of Empires will not cease to bring you an exciting game experience. You need not only good planning and strategy in each battle, but also the ability to manage time and resources wisely, and to skillfully control your heroes.<br/>Engage us through social media:<br/>Fanpage: https://www.facebook.com/KingdomDefense.BestTDGame/<br/>Group: https://www.facebook.com/groups/KingdomDefense.StrategyGame/", "metacritic": null, "released": "2018-09-07", "tba": false, "updated": "2019-07-29T21:13:05", "background_image": "https://media.rawg.io/media/screenshots/896/896185e7312fbab4ebce0ee73e04eb2c_HfVAcKF.jpg", "website": "http://zonmob.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 272, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["Vietnam Zonmob Technology JSC"], "genres": ["Strategy", "Puzzle"], "publishers": ["Vietnam Zonmob Technology JSC"], "esrb_rating": null}