{"id": 261600, "slug": "hot-wheels-augmoto", "name": "Hot Wheels Augmoto", "name_original": "Hot Wheels Augmoto", "description": "**App to be used with the Hot Wheels Augmoto Reality Racing Track Set**<br/> <br/>Accept the Challenge with Augmented Reality Racing!<br/> <br/>Hot Wheels Augmoto now brings iconic Hot Wheels racing into Augmented Reality (AR) space for the first time. Speed past drones and cheering crowds, hit the loop to collect AR attacks, and force your opponent to defend or be sent to the pit to play mini games. Strategize pit stops for recharging as you challenge each other for the win. There’s a ton of action and excitement around each curve and loop as you zoom through at lightning speeds!<br/> <br/>Utilizing the power of Augmented Reality, players are able to play fun and challenging digital games with a new physical Hot Wheels track set like never before.<br/> <br/>Challenge Accepted!<br/> <br/>- 2 Gameplay Modes: Single Player vs. AI or 2 Players<br/>- Choose your car color, number of laps and level of expertise<br/>- Strategize pit stop charging to go through the loop and gain attacks<br/>- Attack your opponent, forcing them to pitstop and play Augmented Reality Minigames<br/>- Augmented Reality brings Hot Wheels race cars into a whole new dimension!<br/> <br/>Optimized for iPhone 6s, iPhone 7, iPhone 8, iPhone X, iPad (2017), iPad Pro (1st generation) or newer.", "metacritic": null, "released": "2018-10-01", "tba": false, "updated": "2019-07-29T10:58:03", "background_image": "https://media.rawg.io/media/screenshots/afb/afbb0e32842dcb846f80811a5b2f9c4f.jpg", "website": "http://www.hotwheels.com/augmoto", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 194, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Mattel"], "genres": ["Strategy", "Racing"], "publishers": ["Mattel"], "esrb_rating": "Everyone 10+"}