{"id": 261743, "slug": "sixskills", "name": "SixSkills", "name_original": "SixSkills", "description": "Can you master all Six Skills in this highly addictive and simple to play game compendium.<br/><br/>Each game is designed to be controlled with a single touch, making it very easy and enjoyable to play. <br/>Gameplay is king. Everything that is not gameplay is stripped away.<br/> <br/>These skills will take time to master.  <br/>Experience the rewarding feeling as you develop your skills to an expert level.  <br/><br/>Master each skill to unlock the next.<br/><br/>1.  Manouver - Pilot your ship around a deadly maze using delicate taps of your thrusters.<br/><br/>2.  Magnet -  Control your descent to the exit, dropping from magnetic shape to shape. Best described as parkour ball-bearing madness !<br/><br/>3.  Grapple -  Use your grapple to expertly swing round hazards. Only with precise timing will you be able to make it you the exit.<br/><br/>4.  Land -  You are at the controls of a rocket. Land before your fuel runs out. You will need to time your engine thrusts with an expert touch.<br/><br/>5.  Bounce - To complete each level you must bounce around the walls to reach the exit. Careful planning is required as you can only bounce on walls that are the same colour as your ship.<br/><br/>6.  Target - Expert timing and judgment is required to shoot all 100 targets.<br/><br/>Complete all six skills to unlock special feature.", "metacritic": null, "released": "2015-06-02", "tba": false, "updated": "2019-10-22T14:00:20", "background_image": "https://media.rawg.io/media/screenshots/741/741cf73c5a5b7f023da02ed36397ba4b.jpg", "website": "http://www.vector3up.co.uk", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 39, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Jeremy Horton"], "genres": ["Arcade", "Puzzle"], "publishers": ["Jeremy Horton"], "esrb_rating": null}