{"id": 261766, "slug": "haunted-hotel-phoenix-a-mystery-hidden-object-ga-2", "name": "Haunted Hotel: Phoenix - A Mystery Hidden Object Game", "name_original": "Haunted Hotel: Phoenix - A Mystery Hidden Object Game", "description": "Play the trial for FREE!  Pay once &amp; complete the adventure!<br/><br/>Witnesses have been reporting that a legendary creature called the Oregon Phoenix has been starting wildfires all over the mountains of the Pacific Northwest. As a detective, you must travel to the Stone Spire Hotel to investigate the death of a university professor, whose friend believes that his demise was no accident, but rather murder! <br/><br/>• WHAT TERROR RISES FROM THE ASHES? <br/>Is this mythical bird really responsible for the fires, or is this the work of a sinister arsonist? As the list of suspects grows, so does the danger of you becoming the next victim. <br/><br/>• DON’T FAN THE FLAMES! <br/>Use your skills to blaze your way through a land of fiery hidden object scenes? <br/><br/>• CRACK THE CASE WITHOUT GETTING BURNED <br/>Dig through the scene of the crime with heated puzzles and scorching mini games. <br/><br/>• SOLVE MORE STONE SPIRE MYSTERIES IN THE BONUS CHAPTER <br/>Keep the adventure going and enjoy additional Collector’s Edition exclusives including morphing objects, collectible items, achievements, and more!<br/><br/>*** Discover more from Big Fish! ***<br/><br/>Check out our entire game library with our Big Fish Games app absolutely FREE here: http://bigfi.sh/BigFishGamesApp<br/><br/>Sign up for our newsletter and never miss a new release or promotion again: http://bigfi.sh/iSplashNewsletter<br/><br/>Big Fish is the leading global marketplace to discover and enjoy casual games. You can enjoy our virtually endless selection of games anytime, anywhere — on your PC, Mac, mobile phone, or tablet. Learn more at bigfishgames.com! <br/><br/>Become a fan on Facebook: http://www.facebook.com/BigFishGames<br/><br/>Follow us on Twitter: http://bigfi.sh/BigFishTwitter", "metacritic": null, "released": "2016-05-17", "tba": false, "updated": "2019-10-22T14:01:09", "background_image": "https://media.rawg.io/media/screenshots/4ca/4ca1a5078357af716fb0017fdbe957d4.jpg", "website": "http://www.bigfishgames.com/mobile-games/ios-games/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 241, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Big Fish Games"], "genres": ["Adventure", "Puzzle"], "publishers": ["Big Fish Games"], "esrb_rating": null}