{"id": 261777, "slug": "shining-force-classics", "name": "Shining Force Classics", "name_original": "Shining Force Classics", "description": "Three episodes of SEGA’s Shining series hit SEGA Forever in one single app! Sharing the same universe but taking the players through different game genres – both 3D dungeon-crawler and turn-based tactical RPG – this Shining saga throws you and your team into deep stories and large-scale strategic battles. Are you ready for the three quests ahead?<br/><br/>Shining in the Darkness<br/><br/>Vanish the fiendish forces of Dark Sol and restore peace to the enchanted Kingdom of Thornwood. Search for the powerful Arms of Light and fight the savage creatures that roam the darkness of the Labyrinth. Use your warrior’s skills and cunning to pass the test of the Ancients and become a shining knight.<br/>•        3D first-person perspective puts you in the adventure<br/>•        Incredible panoramic and cinematic views<br/>•        Fast-paced scrolling whisks you from battle to battle, for non-stop action<br/><br/>Shining Force: The Legacy of Great Intention<br/><br/>The Continent of Rune has slumbered in peace for 50 generations. A horde of invaders swarm across the border, while a dragon that has slept for centuries stirs in its tomb. Only the King’s youngest swordsman and his war party can defy the Dark Dragon’s evil power and crush the mighty army!<br/>•        Control up to 10 different characters at once<br/>•        Increase their skills and attributes through strategy, combat, and exploration!<br/>•        Search through eight brilliant scenarios<br/>•        Sub-quests and imaginative sequences make every game a new adventure!<br/><br/>Shining Force II<br/><br/>In the eerie Cave of the Past, a mischievous thief tampers with the mystical Stones of light and Dark. The Stones once imprisoned the Evil of All Ages. Now the deadly Zeon is unleashed. His rage will hurl the galaxy into eternal darkness — unless the Shining Force can stop him!<br/>•        The legendary epic resumes with an entirely new story, awesome cinematic battle sequences, and incredible monsters!<br/>•        Build an awesome 12-member strike force from over 20 characters and develop them into fiercer, stronger, more magical warriors!<br/>•        Experience superb fantasy-style 16-bit graphics!<br/><br/>MOBILE GAME FEATURES<br/>PLAY FREE with ad-support or ad-free via In-App Purchase<br/>SAVE YOUR GAMES – save your progress at any point in the game.<br/>LEADERBOARDS – compete with the world for high scores<br/>CONTROLLER SUPPORT: MFi compatible controllers<br/><br/>- - - - -<br/>Privacy Policy: http://www.sega.com/mprivacy/<br/>Terms of Use: http://www.sega.com/mobile_EULA<br/>Game apps are ad-supported and no in-app purchases are required to progress; ad-free play option available with in-app purchase.<br/><br/>This game may include \"Interest Based Ads\"​ and may collect \"Precise Location Data\" ​(please see http://www.sega.com/mprivacy#2e_Third_Party_Info ​for more information)​<br/><br/>", "metacritic": null, "released": "2018-10-25", "tba": false, "updated": "2019-07-29T17:19:39", "background_image": "https://media.rawg.io/media/screenshots/6ff/6ff7e3c20f373f23c23f9f95bf288132_yEv9Qe5.jpg", "website": "http://www.sega.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 176, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["SEGA"], "genres": ["RPG", "Strategy"], "publishers": ["SEGA"], "esrb_rating": null}