{"id": 2618, "slug": "z-exemplar", "name": "Z-Exemplar", "name_original": "Z-Exemplar", "description": "Z-Exemplar is a side-scrolling shooter in the tradition of R-Type, Gradius, Nemesis and other classic arcade games from the past. Borrowing its aesthetic from the computers of yesteryear (specifically the Sinclair ZX Spectrum) Z-Exemplar combines bright, bold, 8-bit pixel art with frantic action and an epic mission to conquer a galaxy of almost 1000 planets.<br/><br/><strong>The Background</strong><br/><br/>Z-Exemplar was conceived as a love letter to the ZX Spectrum. Proudly retro, the game embraces the limitations of its 8-bit inspiration to deliver a fast-action, guns-toting, laser-blasting quest with intuitive gameplay and long-lasting appeal.<br/><br/><br/> <br/><br/><br/>But it's not just nostalgia for its own sake.<br/><br/>There is something hugely appealing in the 8-bit aesthetic, something that can be absent in photo-realism. There is space for interpretation, for imagination and a vague assemblage of pixels can evoke in players a different emotion from that engendered by more detailed, distinct images. With the added vibrancy of the ZX Spectrum’s colour palette, this pixellated aesthetic gives Z-Exemplar’s visuals a unique and distinctive feel. <br/><br/>On its surface Z-Exemplar's gameplay appears simple - shoot anything that moves and collect the booty they leave behind - but the over-arching goal of the game is anything but. You are tasked with conquering all 960 planets that make up a hostile galaxy with each planet's defenses uniquely configured. As you explore the outer reaches of the galaxy, the defenses become stronger and enemies more lethal and numerous. There is abundant challenge in Z-Exemplar, challenge that grows with your experience.<br/><br/><br/><br/>To turn the battle in your favour you can access an arsenal of over 20 upgradeable weapons that transform your basic fighter craft into a devastating war machine - selecting the right loadout for each planetary battle is essential.<br/><br/>Features<br/><br/><ul><li>    960 Unique planetary battlegrounds<br/></li><li>    10 Planet themes<br/></li><li>    21 Awesome Weapon loadouts<br/></li><li>    16+ Hours of gameplay<br/></li><li>    A galaxy full of secrets<br/></li><li>    Conquest leaderboard - who'll be first to take over the entire galaxy?<br/></li><li>    Hundreds of enemy types<br/></li><li>    Huge end-of-level guardians<br/></li><li>    Authentic 8-bit pixel art style and audio</li></ul>", "metacritic": null, "released": "2016-11-25", "tba": false, "updated": "2019-10-22T14:28:08", "background_image": "https://media.rawg.io/media/screenshots/839/839dba1f7d13b033317693d96581fc80.jpeg", "website": "http://www.zexemplar.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 38}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 310, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC", "Linux", "iOS", "Android"], "developers": ["Ed Campbell", "Suminell Studios"], "genres": ["Action", "Arcade", "Indie"], "publishers": ["Ed Campbell", "Suminell Studios"], "esrb_rating": "Everyone 10+"}