{"id": 262015, "slug": "saida", "name": "Saída", "name_original": "Saída", "description": "<p>Saída é um jogo de progressão lateral 2D do gênero Arcade com jogabilidade casual e de repetição, aonde o jogador controla <em>Tulho</em>, um porco residente na decadente cidade de <em>Baycomsville,</em> que ao completar o seu aniversário de 5 anos, se vê livre para tentar alçar voos mais altos. Talvez tão altos que o levem para a mítica terra prometida.<br/></p>\n<p>\"S<strong>aída\"</strong> tem  o seu maior poder de diversão e replay na transposição dos obstáculos, que dificultam a progressão do jogador, ao mesmo tempo em que, se usados corretamente, servem para impulsioná-lo. Estes obstáculos são minuciosamente organizados em cada fase de acordo com o ritmo da trilha sonora, dando ritmo muito prazeroso para o gameplay. Por qualquer pequeno erro, o jogador pode perder o fluxo de seus movimentos de uma maneira que não tenha volta. Mas à medida em que joga mais e mais, o jogador aprende a utilizar melhor os poderes de <em>Tulho</em>, se adapta ao ritmo da trilha sonora, e, através da repetição, aprimoramento das habilidades do personagem e motivação de acompanhar aonde a jornada de nosso porquinho vai levar, domina o jogo e sente sua evolução enquanto jogador.</p><p>O desenvolvimento do MVP de \"Saída\" para a Game Jam Gamethon Hacktudo 2018 foi realizado pela equipe composta por: <br/>- Raphael Sanguinete: Conceito, Produção, Narrativa e Game Design<br/>- Ítalo Nievinski: Conceito, Produção, Game Design e Level Design<br/>- Diogo Souza: Conceito, Programação e Game Design<br/>- Enrick Magalhães: Conceito, Ilustração e GameArt<br/>- Bettina Calmon: Conceito, Trilha Sonora e Sound Design</p>", "metacritic": null, "released": "2018-11-04", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/ced/cedd21385105048640b1a452326aee43.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 11, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["raphael.sanguinete"], "genres": [], "publishers": [], "esrb_rating": null}