{"id": 262480, "slug": "precipice-2", "name": "Precipice", "name_original": "Precipice", "description": "Atomic Age Brinkmanship<br/>Take control of the United States or Soviet Union and provide technical and economic assistance to guerrillas all over the world fighting for your cause, all while avoiding a direct and open-confrontation with the enemy.<br/><br/>​In Precipice, subterfuge is the most important strategy.  Safeguard your closest allies and change unfavorable regimes without giving away your long-term ambitions. Every action risks an enemy reprisal, and if nobody backs down from a standoff, we all lose.<br/><br/>Will you be victorious in the Cold War, or will you send us all over the precipice of nuclear annihilation?<br/><br/><strong>Features</strong><br/><br/><ul><li>Tense strategy for one or two players.  Face a highly-responsive, unpredictable AI that will attempt to understand your strategy and counter it at every turn, or invite a friend and see if you can collectively work to avoid global catastrophe online.  <br/></li><li>World leaders from 72 countries realized as animals native to the region, all pawns in the dangerous game of nuclear chicken.<br/></li><li>Manage resources from territories under your control to resolve immediate crises or win over future allies.<br/></li><li>Recreate history, or forge your own path.  Put a bear on the moon.  The possibilities are endless.<br/></li><li>Simple, intuitive gameplay that is also difficult to master.</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:51:19", "background_image": "https://media.rawg.io/media/screenshots/971/971b0065bf57d3d5b3ea3e13ddffff70.jpg", "website": "https://www.littlereddoggames.com/precipice", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 62, "beaten": 1, "dropped": 1}, "playtime": 1, "achievements_count": 14, "ratings_count": 2, "suggestions_count": 211, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC", "macOS", "Linux"], "developers": ["LRDGames"], "genres": ["Strategy", "Simulation", "Indie"], "publishers": ["LRDGames"], "esrb_rating": null}