{"id": 262408, "slug": "seek-love", "name": "Seek Love", "name_original": "Seek Love", "description": "PLOTPhoebus and Venus have met each other an old time ago. For a long time, in the heart of Phoebus, he has always loved Venus, but they have not seen each other for a long time. By chance, they met, and Phoebus finally expressed his love to Venus. But Venus said to Phoebus: \"I can only come back if you find your true love.\" Thus, Phoebus…INSTRUCTIONThis game has the world's top interface design which is the pink of perfection, you can play directly without even having to explain. Its characters and scenes are exciting everywhere. Miraculous light effects and particle effects are free of mind and happy of heart. The heart-shaking music seems to make you are personally on the scene. This is simply an art of genius.<br/>You might think this is just a normal adventure game, but you are wrong. The most special thing about this game is the every detail hided in the game. Every little decision you make can lead to different endings. Of course, if you are not satisfied with the endings, you can choose to restart your journey of ‘Seek Love’. In order to achieve this amazing setting, we used the world's ultimate algorithm to make the impossible become possible.<br/>In the game, such as jet power, wind, gravity and other physics settings, we all use advanced physics algorithms, real and accurate. In this game, you will constantly encounter new obstacles, each level will make you feel definitely different. At the same time, you will feel the vastness of the scene. You need constant thinking and reasoning can get the final victory, maybe because of a wrong step, you will lack a basketful. You can buy your equipment in the store, you need to use the jetpack to cross the obstacles you can't overcome, and you need to use the weapon to knock down those terrible monsters. The best part is that you can also have the rich and creative exceptional functions, and when you release them, you will feel they are very powerful.MESSAGEStart your journey now!", "metacritic": null, "released": "2018-11-21", "tba": false, "updated": "2019-08-28T21:51:26", "background_image": "https://media.rawg.io/media/screenshots/003/003122c0264f504f042e0344f0f4e529.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3}, "playtime": 0, "achievements_count": 4, "ratings_count": 0, "suggestions_count": 134, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SUNYU Software"], "genres": ["Adventure", "Strategy", "Casual", "Indie"], "publishers": ["SUNYU Software"], "esrb_rating": null}