{"id": 262484, "slug": "kitten-love-emulator", "name": "Kitten Love Emulator", "name_original": "Kitten Love Emulator", "description": "Kitten Love Emulator is a fast paced exploration game where everything is all smiles, sunshine, and sweetness! Hang out at the mall, spend a day at the beach, murder him now 💕, or even explore the vastness of space!  WOWSIES!  It's totes filled with humanly delicious comedy that two legged talky meat things of all ages and mental states will find gnawingly humerus.<br/><br/>It's just bursting open and gushing out 'great' and awe-full features, such as:<br/><ul> <li>Levels that react to your cats emotions, ever-changing to fit the current mood (Intense Anger, Blinding Zeal, Suicidal Depression, 𝐿𝒪𝒱𝐸 𝐿𝒪𝒱𝐸 𝐿𝒪𝒱𝐸 𝐿𝒪𝒱𝐸 𝐿𝒪𝒱𝐸, etc.)<br/> </li><li>AI that constantly watches what your doing to try to prevent boredom, and turning homicidal too early.<br/> </li><li>Non-traditional puzzles that require everything from abusing game glitches to stabbing things in their organs repeatedly.<br/> </li><li>Cats that you can like dress-up! Today they can be an angel, and tomorrow a demon...although demons are technically angels, so whatevs.<br/> </li><li>The bestest and MOST delightful bunny friend to aide you on your epic journey. Everyone freakin' LOVES bunnies! Srsly, you had better &gt;:}<br/> </li><li>Drive a bunch of vehicles that cat's absolutely have no bzns driving, no siree. Like tanks, and spiders, and attack helicopters, and a spaceshi*, and even other cats.</li></ul><br/>Really, when I just like stop and think about it, you should totally get this game.  It's a great game, that'll either A) Keep you busy for like 10 hours or even more if ur dumb, B) Fill you with such discomfort and confusion that'll you'll quit out of sheer disgust.  Either way you get to experience monar...LOVE first hand, and that's like a complete bargain buy itself.<br/><br/>Just remember that I ABSOLUTELY LOVE EVERY INCH OF YOU -- well at least the edible bits<br/>（*＾3＾）/～♡", "metacritic": null, "released": "2018-11-22", "tba": false, "updated": "2019-08-28T21:51:19", "background_image": "https://media.rawg.io/media/screenshots/498/498f3da92427fe96303008b11577d18f.jpg", "website": "http://kitten-love.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 321, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["True"], "genres": ["Adventure", "Simulation", "Casual", "Indie"], "publishers": ["False"], "esrb_rating": null}