{"id": 262405, "slug": "absinth", "name": "Absinth", "name_original": "Absinth", "description": "Absinth is a psychological horror-thriller by indie developer blackHound Studios. Explore the chilling world of Zane Zaminsky and discover the unsettling events of his past.<br/>\n<br/>\r\nIt is a weekend in late July 2018 when Zane visits the US California Redwoods only to disappear without a trace shortly after arrival. Two days later, the local Police Department locates Zane on the main road near the Redwoods after receiving an anonymous tip. Chief Inspector Carter opens the investigation a few hours later, only to discover that not only does Zane have no recollection of the past two days, but the fact that he has a daughter has been completely wiped from his memory. As the investigation unfolds, more and more clues surface to suggest Zane’s past hides more than the just the answer to his amnesia.<br/>\n<br/>\r\nExperience what happened to Zane and how his life changed overnight. Hide yourself from the unknown and try to distinguish between reality and illusion. Solve dimension-unravelling riddles to reach your targets and uncover the intrigue which brought Zane’s life to ruin. Decipher secret documents to expose the truth and win against your own mind to survive. Use the innovative AR glass to analyze your environment and constantly find new ways to avoid the encounter with the devious AI.<br/>\n<br/>\r\nAbsinth takes you to a world of fear, darkness and loss, but also hope. The duplicitous presentation of scenes combined with the classic dark atmosphere will have your emotions twisted and in a constant state of heightened adrenaline. Experience unique storytelling and the innovative machinations of Absinth from a real indie developer studio in a way you’ve never played before.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:51:26", "background_image": "https://media.rawg.io/media/screenshots/a53/a53726888bc18062f2dec94bb6845078.jpg", "website": "https://www.absinthgame.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 216, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["blackHound Studios GbR"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["blackHound Studios GbR"], "esrb_rating": null}