{"id": 262467, "slug": "lambs-on-the-road", "name": "Lambs on the Road", "name_original": "Lambs on the Road", "description": "Lambs on the Road<br/>– Human greed has had no limits since many years passed.<br/>– Today is cold and grey, but no less so than yesterday.<br/>– I’m not sure what day or month it is, but I suspect it is September.<br/>– It all started when the world’s climate as we know it began to change violently at the hands of man.<br/>– Rivers and lakes dried up or became polluted. And with the water shortage, crops started to deteriorate.<br/>– Animals were the first living things to suffer, later, all humanity.<br/>– The world as we know it has been lost forever.<br/>– When food became scarce, everything collapsed, chaos took over.<br/>– A fierce struggle for survival began.<br/>– In a desperate attempt to save humanity, what was left of the authorities evacuated the young to makeshift camps outside the cities<br/>– Entire families were separated and parents were devastated at having to abandon their children.<br/>– They were never to be heard from again.<br/>– Meanwhile in the cities, people fought for the slightest hint of food.<br/>– Order was lost to be replaced by survival of the fittest .<br/>– And finally, due to despair, it happened……Story<br/>Inspired on the bestseller ” The Road” by Cormac McCarthy. Live the story of a father and her depth daughter in a post-apocalyptic world. <br/>Due to climate change, chaos became to our world. Order as we knew has dissapeared and human being try to survive.<br/>Lambs on the road is a flat 2D platformer adventure game. Play with the father and his daughter separately in different levels and help them to meet again.<br/>Let them meet and keep on  playing in a coperative way to scape from cannibals and survive to arrive to a secure point.<br/>Both characters have different skills and limitations. Separately maybe can survive, together they have a chance.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:51:21", "background_image": "https://media.rawg.io/media/screenshots/980/9800a172746dff4aa45f29c4ed565e35.jpg", "website": "http://www.flynnsarcades.com/?portfolio=lambs-on-the-road", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 5, "ratings_count": 0, "suggestions_count": 247, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Flynn's Arcade"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Flynn's Arcade"], "esrb_rating": null}