{"id": 262470, "slug": "starboy-2", "name": "STARBOY", "name_original": "STARBOY", "description": "The game is about a Starboy, that's about you, who needs to run off from alien world at any price.<br/><br/>The puzzle that you need to go through to get out of the cruel world.<br/>Minimum of buttons, maximum convenience control, super gameplay and story - all you need.<br/><br/>Forget all the hardcore games you played. Your life begins with the click of the Play Game button.<br/>All the puzzles you played are nothing compared to StarBoy.<br/>Exciting action, beautiful gameworld and anger from which you can't get rid while playing this game wait for you.<br/>Do you know why? Because you won't can complete even the first level.Game features:<ul><li>Fascinating gameplay:<br/>If you think this is a boring puzzle - you are mistaken. Movement, jumping, action, etc.</li></ul><ul><li>Beautiful gameworld:<br/>The game is made on a powerful engine, it means that you will enjoy with all the graphics and beauty of the surrounding world.</li></ul><ul><li>Interesting and fascinating story:<br/>The storyline is full of colors and enthralling history will not allow you to break away from the game.</li></ul><br/>You will get the world with open opportunities. All you need is your brain and sleight of hand;<br/><br/>You can be anyone, but you must go to the end.<br/>You will have to overcome difficulties to survive.<br/>If you like to challenge - this is the game for you.<br/><br/>Are you still reading this? Hurry up! Buy, install and start playing!", "metacritic": null, "released": "2018-11-30", "tba": false, "updated": "2019-08-28T21:51:21", "background_image": "https://media.rawg.io/media/screenshots/84f/84f1f561aa59112fb7fba8524594b838.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 130, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["BoominShit", "Banjo"], "genres": ["Action", "Adventure", "Strategy"], "publishers": ["BoominShit", "Banjo"], "esrb_rating": null}