{"id": 262553, "slug": "best-casino-social-slots-fun", "name": "Best Casino Social Slots Fun", "name_original": "Best Casino Social Slots Fun", "description": "Want to enjoy new social slot machine games? Free slot app with numerous wildly entertaining and relaxing Vegas slots? Well, Best Casino Social Slots Fun is just like made for you.<br/><br/>Join your friends from all over the world for an exciting slot machine experience with Best Casino Social Slots. Enjoy versatile casino slots for fun with amazing bonuses and enormous payouts, enter slot casino competitions, collect &amp; share achievements and so much more. <br/><br/>The most fun free slot casino app yet!<br/><br/>AMAZING SOCIAL CASINO SLOT EXPERIENCE <br/>As an exquisite social slot machine casino app it features free social slots built for up to seven players at a time. Beside enjoying your free time playing different kinds of real vegas slots, you are sure to experience even greater excitement with the social features. <br/><br/>ADDICTIVELY ENJOYABLE, VISUALLY STUNNING SLOTS<br/>From Farm Village &amp; Rio Carneval, to Galaxy Explorers &amp; Pirate Gold, you are sure to find amazing slot machines with different themes. Find your favorite and literally enjoy hours of pure casino amusement. Don’t worry, ALL of the social casino slots are audio-visually spectacular!<br/><br/>HUGE PAYOUTS FOR ULTIMATE SATISFACTION<br/>Don’t you hate it when you want to relax and enjoy fun slot machines for free &amp; you don’t have funds? No worries, this is one of the most generous social casino slots games yet. Enjoy astounding jackpots, daily bonuses and enormous payouts! Our progressive slots &amp; progressive jackpots will give keep the social casino game fun for you!<br/><br/>COMPETE, JOIN EVENTS &amp; WIN HIGH PAYING COMPETITIONS <br/>We bring original social casino for extra excitement! Check the frequent upcoming events and join all sorts of different challenges. With slots multiplayer features, our social casino game is more than just a regular app with free slots with bonus rounds. Connect and compete with your friends too. There is nothing more satisfying than playing, competing and discussing free slots for fun casino games with your friends.<br/><br/>Our players absolutely love:<br/>◆ Free download for iPhone<br/>◆ Real-time competitions with multiple players &amp; friends all over the world<br/>◆ Extra special bonuses &amp; free daily and hourly coins<br/>◆ Collecting &amp; sharing achievements<br/>◆ Playing &amp; winning challenges and special events<br/>◆ Chatting with other players &amp; friends live while you play<br/>◆ Free daily coins &amp; hourly coins for online slots<br/>◆ Inviting friends to play, sending and receiving gifts &amp; sharing achievements<br/><br/>Stop searching for social slots that are boring and don’t give huge and frequent payouts.<br/>Try real vegas slots and ultimate social casino entertainment with Best Casino Social Slots Fun.<br/>Download &amp; play amazing free slots for fun!<br/><br/>INFO: <br/>Please note: Log in with Facebook account to enjoy all the social features.<br/>Play our always growing selection of free social slot machines earn free coins, choose the highest possible pay-line, and share gifts and chips with your friends.<br/><br/>Best Social Slots is intended for use by those 21 or older for amusement purposes only.<br/><br/>Practice or success at social casino gaming does not imply future success at real money gambling.<br/><br/>The games do not offer \"real money gambling\" or an opportunity to win real money or prizes.<br/><br/>Visit our website: http://www.diwip.com<br/>Interact with us on our Facebook community: https://www.facebook.com/diwipBestCasino<br/>Follow us on Twitter: https://twitter.com/PokerSlotGames<br/>Play on Facebook: https://apps.facebook.com/best_casino/<br/>Need help? Contact our support: http://www.diwip.com/diwip_support.php<br/>Terms of service: http://www.diwip.com/termsofservice.php", "metacritic": null, "released": "2015-01-01", "tba": false, "updated": "2019-10-22T14:00:57", "background_image": "https://media.rawg.io/media/screenshots/e93/e93090dae8f6a2109bc649cd1e75fe64_rMWZlTI.jpg", "website": "http://www.diwip.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 157, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["diwip"], "genres": ["Arcade"], "publishers": ["diwip"], "esrb_rating": "Teen"}