{"id": 262509, "slug": "egypt-old-kingdom-demo", "name": "Egypt: Old Kingdom Demo", "name_original": "Egypt: Old Kingdom Demo", "description": "You are one of the multitudes of incarnations of the great Horus, and side by side with the pharaohs, you are fighting against the mighty Seth, who unleashes numerous disasters upon the lands of Ancient Egypt. Win wars and overcome crises, discover new technologies, worship your gods and conquer neighboring tribes! Are you wise enough to help the ancient kings to unify Lower and Upper Egypt, build a stable economy and to erect the Great Pyramids?Based on real historyYou will find yourself in Memphis, 3500-2140 years B.C., the time of the first six dynasties of pharaohs. You will unify the country and create a prosperous kingdom, which later will have to face the havoc of the First Intermediate Period.Construction of the Great PyramidsYou will lead the construction of pyramids, choose their design and materials. This process requires tremendous investments, but it is the only way to keep peace and order in the country.Ancient society simulatorYou will not only deal with the problems of farmers and craftsmen but also make important political decisions, which will define the future of the kingdom. Numerous challenges and events of different scale await you.Ancient mapsDiscover the world of the Old Kingdom: exploit new lands, send expeditions to different places, and meet different cultures. Use every opportunity to learn about your surroundings and to expand Egypt's borders.Differences from Predynastic Egypt<ul><li>More diversity in the game, varied tasks in the regions, different tactics for playthroughs and unique bonuses from patron gods.\n<br/>\n</li><li>Egypt: Old Kingdom is longer.\n<br/>\n</li><li>New technologies: 3D engine and skeletal animation.</li></ul>", "metacritic": null, "released": "2018-05-23", "tba": false, "updated": "2019-07-25T21:04:17", "background_image": "https://media.rawg.io/media/screenshots/c02/c02b3689372df2febb04066f55e664ed.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 6, "owned": 76, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 345, "game_series_count": 0, "reviews_count": 2, "platforms": ["macOS", "Linux", "PC"], "developers": ["Clarus Victoria"], "genres": [], "publishers": ["Clarus Victoria"], "esrb_rating": null}