{"id": 262552, "slug": "fun-vegas-slot-machines", "name": "Fun Vegas Slot Machines", "name_original": "Fun Vegas Slot Machines", "description": "Get lucky and win big! Best Casino, the leading social casino game on Facebook, brings you a thrilling slots experience with the new mobile version of its popular video slots!<br/><br/>Now available for iPhone and iPad, Best Casino Slots offers the same amazing slot machine journey that you know from Facebook! From Caribbean Vacation to the Wild West, win huge jackpots and play exciting bonus levels in our growing selection of slot machines!<br/><br/><br/>Game Features:<br/><br/>- Collect free coins daily!<br/>- Coin bonuses every 4 hours!<br/>- Get free spins!<br/>- Play exciting bonus games!<br/>- Progressive jackpot machines<br/>- Special events<br/><br/>Pick from our grand selection of machines and try them for free! Our slots include:<br/>- Caribbean Vacation slot is a tropical island slot with great vacation atmosphere<br/>Put your sunglasses on, sit back and relax. This Slot Machine is all about time off. Cool down with a tropical drink, go on boat rides, and if you’re lucky, you might even see a dolphin!<br/><br/>- Wild West slot is a real wild ride<br/>There is nothing like a good journey through the old west. If you came looking for gold, you will find places that house all kinds of treasures while playing this fun slot machine.<br/><br/>- Sweets Factory is a really sweet slot machine<br/>Find all kinds of candies and goodies waiting for you! Mmm... Chocolate...Chocolate candies and ice-cream - this slot machine has a great taste.<br/><br/>- Tikal Treasures slot is about searching the jungle for buried treasures<br/>Deep within the heart of the jungle lies the ancient temple of the Mayans where buried riches hide. Will you find chests of gold or a perfect diamond? Play this slot machine to uncover them and get rich!<br/><br/>- FairyDust is where the magic happens<br/>Enter the magical realm of fairies, unicorns and dragons. This charming slot machine will put you under its spell.<br/><br/>- Zodiac Fortune gives a good sign to spin and win<br/>In this slot machine your luck is pre-written. Spin to find out if you'll win the jackpot. Don't forget to check your daily horoscope to see how the sun, moon and stars line up.<br/><br/>Best Casino Slots is brought to you by diwip. We create engaging social games, where players can experience fun and excitement with their friends.<br/><br/>As one of the freshest app developers on popular social networks and mobile platforms, diwip has become all ages’ entertainment company. We offer millions of people worldwide the ability to engage, communicate and socialize with one another through our games!<br/><br/>Best Video Slots is intended for use by those 21 or older for amusement purposes only.<br/><br/>Practice or success at social casino gaming does not imply future success at real money gambling.<br/><br/>The games do not offer \"real money gambling\" or an opportunity to win real money or prizes.<br/><br/>Visit our website: http://www.diwip.com<br/>Interact with us on our Facebook community: https://www.facebook.com/diwipBestCasino<br/>Follow us on Twitter: https://twitter.com/PokerSlotGames<br/>Play on Facebook: https://apps.facebook.com/best_casino<br/>Need help? Contact our support: http://www.diwip.com/diwip_support.php<br/>Terms of service: http://www.diwip.com/termsofservice.php", "metacritic": null, "released": "2013-01-16", "tba": false, "updated": "2019-10-22T14:00:57", "background_image": "https://media.rawg.io/media/screenshots/0cd/0cd035940dd01b0ba27d226a4d2c8408_oNnYReH.jpg", "website": "http://www.diwip.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 104, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["diwip"], "genres": ["Arcade"], "publishers": ["diwip"], "esrb_rating": "Teen"}