{"id": 262600, "slug": "twisty-board-2", "name": "Twisty Board 2", "name_original": "Twisty Board 2", "description": "The first time was just a training ground. Now, the real fight lies ahead.<br/><br/>Alien warlords called the Q’Tath have decimated earth’s defenses.<br/>As they spread across the galaxy, their rations ran low…<br/>So they rounded up and imprisoned the people of Earth.<br/>Now, the fate of the world rests on your shoulders.<br/><br/>Repel the Q’Tath from 5 new battlegrounds.<br/>Free the prisoners.<br/>Save humanity!<br/><br/>How to Play:<br/>Tap &amp; Tap to navigate! You’ll shoot automatically once they’re in your direction &amp; range.<br/>Use new weapons to fight new against enemies.<br/><br/>Game Features:<br/>* Awesome Voxel Graphics and Environments<br/>* Unlock 30+ Characters &amp; Superpowers<br/>* Optional in-game recording so you can watch and share videos of your performance <br/><br/>Key Features:<br/>* MetalKit <br/>* Replaykit <br/>* Haptic Feeds<br/>* Game Center<br/><br/>SUBSCRIPTION PRICING AND TERMS<br/><br/>Subscription options<br/><br/>Twisty Board 2 provides you with the following subscription options:<br/><br/>1.Weekly Diamond Membership offers weekly subscription for 7.99$ after 3-day free trial. It gives you 2500 coins everyday, remove all Ads and 3 unique characters. <br/><br/>2.Monthly Diamond Membership offers monthly subscription for 19.99$.  It gives you 2500 coins everyday, remove all Ads and 3 unique characters. <br/><br/>3.Yearly Diamond Membership offers yearly subscription for 99.99$.  It gives you 2500 coins everyday, remove all Ads and 3 unique characters. <br/><br/>END OF TRIAL AND SUBSCRIPTION RENEWAL<br/><br/>This price is for United States customers. Pricing in other countries may vary and actual charges may be converted to your local currency depending on the country of residence.<br/><br/>Payment will be charged to iTunes Account at confirmation of purchase.<br/><br/>Subscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the current period.<br/><br/>Account will be charged for renewal within 24-hours prior to the end of the current period, and identify the cost of the renewal.<br/><br/>Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user’s Account.<br/><br/>Settings after purchase.<br/><br/>Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that publication, where applicable.<br/><br/>CANCELING TRIAL OR SUBSCRIPTION<br/><br/>You can turn off the auto-renew for the subscription whenever you want to through iTunes. Check https://support.apple.com/HT202039. When your current trial/subscription period expires, you will be unsubscribed. The current active subscription period can not be canceled. After your subscription expires, you will no longer be able to use elements included in Subscription option.<br/><br/>If you experience any problem please write to us @ reachus@lhd.co.in.<br/><br/>Privacy Policy: http://www.lhdgameslab.com/tb2_privacypolicy.pdf<br/>Terms of Use: http://lhdgameslab.com/termsofuse.pdf<br/><br/>Thank you for playing Twisty Board 2!", "metacritic": null, "released": "2017-11-15", "tba": false, "updated": "2019-10-22T14:01:03", "background_image": "https://media.rawg.io/media/screenshots/8af/8afa2e18b16f2278c919d4438c45163d_n41ZpkH.jpg", "website": "http://www.twistyboard2.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 149, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["LHD Games"], "genres": ["Racing", "Arcade", "Family"], "publishers": ["LHD Games"], "esrb_rating": "Everyone 10+"}