{"id": 262731, "slug": "dubble-bubble-shooter-hd", "name": "Dubble Bubble Shooter HD", "name_original": "Dubble Bubble Shooter HD", "description": "The bubbles in this game move like jelly and swing through the level, giving you awesome gameplay. That's why Dubble is the best rated bubble shooter for iPhone, iPad, iPod touch and Mac.<br/><br/>GAME INFO <br/>Dubble is a highly addictive bubbleshooter with natural physics coming to you from the Netherlands. Four fantastic game modes with an addictive balance between challenge, entertainment and relaxation.<br/><br/>SINGLE MODE (1 Player) <br/>We've built three awesome single-player modes to have endless fun with. Play as fast as you can in Arcade mode, as smart as you can in Puzzle mode, or have endless fun in Zen mode. Each mode has its own background music and gets more challenging as you shoot your way through up to 8 colors of organically moving bubbles. <br/><br/>DUBBLE MODE (2 Players) <br/>Allows two players to fight a colorful battle on a single iPad, iPhone or iPod Touch simultaneously. Create explosions to drive the bomb towards your opponent, but look out: he's trying to do the same to you! <br/><br/>SUPPORT <br/>Please e-mail us at dubble@rodo.nl for support, or follow us on Twitter @RodoIC for info on the development of Dubble.<br/><br/>OpenGL 2 required: supports iPad1, iPad2, iPhone 3GS, iPhone 4, iPod Touch 3rd gen. and everything newer.", "metacritic": null, "released": "2010-04-01", "tba": false, "updated": "2021-01-25T06:16:30", "background_image": "https://media.rawg.io/media/screenshots/d83/d8377cd7e1e0574e945e7c3e25b17b65_b864c8u.jpg", "website": "http://www.dubble.net", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 105, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Rodo - Intelligent Computing", "Willem Vervuurt"], "genres": ["Arcade", "Casual", "Puzzle"], "publishers": ["Rodo - Intelligent Computing", "Willem Vervuurt"], "esrb_rating": null}